[{"articleID": "2014121208_00029812_W", "names": {"Fernando Torres": ["Q3821470", "Q42731", "Q47088453", "Q58658056"], "Patrick Moore": ["Q1368317", "Q21462359", "Q268024", "Q28758394", "Q47906441", "Q56755948", "Q7147244"], "James Walsh": ["Q21457849", "Q25183766", "Q548595", "Q6145079", "Q6145080"], "Margaret Evans": ["Q25189513", "Q56597986", "Q6759386"]}, "date": "2014-12-12", "url": "http://westsussextoday.co.uk/report-into-south-downs-a-e-future-discussed-1-6469375", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. From the Back Pages, December 9: FA Cup draw: Arsenal vs Hull, AFC Wimbledon vs Liverpool and Manchester United to play Accrington or Yeovil From the Back Pages, December 12: <mark>Fernando Torres</mark> set to be offered up for FREE after Milan move to cancel Chelsea loan deal Sir <mark>Patrick Moore</mark> archive acquired by Science Museum From the Back Pages, December 8: Arsene Wenger targeted with foul-mouthed abuse at train station by furious Arsenal fans Report into South Downs A & E future discussed Health chiefs were quizzed last week over a controversial health contract award which could put South Downs A & E services at risk. Health bosses from both the Western Sussex Hospital Trust and Coastal West Sussex Clinical Commissioning Group (CCG), which awarded Bupa CSH Ltd a £ 235m musculoskeletal (MSK) contract, were before West Sussex County Council's Health and Social Care committee on Friday December 5. An independent impact assessment into the decision was jointly commissioned by the Trust and CCG after Western bosses went public with fears that its accident and emergency units at Chichester's St Richard's Hospital and Worthing Hospital could suffer as a result of the deal. Both are used by South Downs residents. One question asked by GP and committee vice chairman Dr <mark>James Walsh</mark> was why private procurement was chosen over public bidders. Marie Dodd, the CCG's chief operations officer, said legal advice made it clear there was \"no other option' but to offer the services out to tender. She said:\" The CCG (sought legal guidance) and reluctantly had to accept the advice that procurement was going to be the best vehicle, and the required vehicle for us to use in those circumstances. \"Dr Katie Armstrong, chief officer at the CCG, said a summary of the assessment would be made public once both bodies had studied it in full. The results will be shared with committee members ahead of HASC's next meeting on January 21, 2015. Committee's chairman, <mark>Margaret Evans</mark>, said:\" We will look very closely at the impact assessment's results as the MSK contract has been a matter of significant concern to the committee and to the public. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Springfield House Springfield Road Horsham clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. West Sussex Gazette provides news, events and sport features from the West Sussex area. For the best up to date information relating to West Sussex and the surrounding areas visit us at West Sussex Gazette regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2015122519_00456809_W", "names": {"Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"]}, "date": "2015-12-25", "url": "http://www.inquisitr.com/2656933/justin-bieber-could-have-died-bombshell-from-scooter-braun-reveals-biebers-darkest-moment-what-saved-him/", "content": "Meet Scooter Braun, the man behind the pop idol phenomenon known as Justin Bieber. Now 21, Bieber recently underwent a dramatic transformation that changed his persona and the public's perception of the pop star. But reflecting on the past of his protegee and client, Scooter reveals that Justin could have died at one point, revealed the Mirror. Braun has managed Bieber for years, but only now is the pop idol's manager ready to share the struggles that, during one particularly dark period, were life-threatening. How serious were those past problems? Scooter shared that after a tidal wave of bad publicity that hit Justin hard, Braun would not allow his client to tour. That ban occurred in 2013, following the release of the Journals album. Scooter Braun and Justin Bieber are pals as well as manager and client. [Photo by Jemal Countess/Getty Images] \"I was not going to let him work. He wanted to tour, and I honestly at that time felt, if he toured, he could die,\" Braun said. Scooter admits that the outside world had no idea what was going on in Bieber's life. Braun also made it clear that he won't tell the full story because he's waiting for Bieber to share when he's ready. \"The outsiders don't really know what was happening. It was far worse than people realize. and when he is ready, he will tell what he was going through. But it's a hard thing to watch someone you care and genuinely love go through that. I'm really, really happy that's over,\" emphasized Scooter. Justin Bieber and Scooter Braun share a sense of humor. [Photo by Eugene Gologursky/Getty Images for Dolce & Gabbana] In addition, Braun recalled a turning point in the career of his client, crediting an intern in his office for coming up with the milestone event. It happened when Scooter held a staff meeting, encouraging his employees to suggest ideas for a thorough interview. Although Braun suggested famous talk show hosts such as Oprah Winfrey and Katie Couric, a 21-year-old Ava Coleman, then an intern, suggested something very different. \"I just think my generation doesn't care about that,\" said Ava in response to the suggestions of Oprah and Katie. \"I think if you want people to see that he's for real, he should do a Comedy Central roast.\" Scooter proclaimed it a genius concept, and just one day later engaged Comedy Central in a phone conversation. With <mark>Kevin Hart</mark> taking on the role of host and utilizing his comedic talents, the Comedy Central roast proposed by that intern and embraced as a great idea by Scooter proved to be the turning point that saved Bieber's career by revealing his humility and sense of humor. The pop idol changed his life at the Comedy Central Roast of Justin Bieber. [Photo by <mark>Kevin</mark> Winter/Getty Images] As to what caused those dark times and damaging reports? Braun did not go into detail himself just yet, noted the Daily Mail. Just like his client, Scooter is modest. Braun admitted that he feels in some ways he failed when it came to helping the young pop star turn around his life. Scooter recognizes that the intense marketing program has made an impression, but he praises the 21-year-old for making the decision to undergo a life-changing--and potentially life-saving--transformation. \"I know people have seen the marketing and the A & R and everything we put together, and they're like,\" Wow, great job!' But I want to be really clear: I was trying to do that job for a year and a half, and I failed every single day. It wasn't until something happened that it clicked for him. He made the conscious decision as a young man: \"I need to make a change in my own life .'\" Braun also maintains an active Twitter account, sharing tidbits from his life as well as those of the clients he manages and, as shown with Bieber, genuinely cares about. And his mini-bio on Twitter reveals that Braun believes in the importance of family and friends. \"Family and friends are everything. I live life and try and smile as much as possible. Inspire the world to try!\" urges Scooter. [Photo by Jemal Countess/Getty Images]"}, {"articleID": "2015031411_00052259_W", "names": {"David Coburn": ["Q16979872", "Q3017692"]}, "date": "2015-03-14", "url": "http://belfasttelegraph.co.uk/news/world-news/25-boko-suspects-died-in-custody-31066051.html", "content": "Like St Patrick, Dr Welby is a leader with great vision The participation by the Archbishop of Canterbury...Two-and-a-half years after its launch, Tinder has...Love is the greatest legacy of Simpsons creator Simon Video archive: Belfast Harbour 1954 footage of home time for workers -...The day New Zealand All Blacks trooped past Army at Ravenhill Back Then: Story of Joymount Church brought to book In my day: We quiz Carl Johannesson on the time of his life A black day when old Carnmoney blacksmith's closed Video: Irish Open 2015 launched at the Royal County Down Video: Belfast City Council - Lord Mayors mark the end of an era Video: Public sector strike - Northern Ireland's public services disrupted by...Video: HomeFinder property of the week - 3 Ardenlee Avenue, Belfast Troops on patrol in the fight against Boko Haram. (AP) Cameroon has acknowledged that more than two dozen Boko Haram suspects died in custody late last year, but a government spokesman denied the country's army was carrying out regular human rights abuses in its crackdown on the extremist group. Ikea pulls magazine site in Russia Seven dead in Serb helicopter crash The 25 suspects were found dead in their cell a day after being arrested in December, communications minister Issa Tchiroma Bakary said. They were part of a group of 56 detainees and the cause of their deaths is still being determined, he said. \"I can already state here that at this stage of investigation no evidence has been established to corroborate that these persons were deliberately killed,\" Mr Bakary said. He added that a senior military official had been removed from his post and was being investigated over the deaths, though he did not identify the person by name. In January, the Network of Human Rights Defenders in Central Africa, based in the capital Yaounde, cited \"reliable sources\" in claiming that 50 Boko Haram suspects had suffocated to death in their cells before being buried in a mass grave. The group's report accused the army of engaging in rights violations including torture \"with impunity\" . Boko Haram has been fighting a near six-year insurgency against the Nigerian government, killing thousands and carrying out mass kidnappings, including of schoolgirls. The conflict has taken on an increasingly international dimension in recent months. Cameroon's northern region was repeatedly targeted by Boko Haram before the country signed up to participate in a multinational force that has dislodged the group from a score of north-eastern Nigerian towns in recent weeks. Nigeria has acknowledged it is getting help from regional security operatives amid reports that South Africa and other foreign contractors are involved in the fight against Boko Haram. Man secretly fed his ex-girlfriend abortion pills in a smoothie to force miscarriage Iceland no longer wants to be part of Europe Union - as it thinks it can get a.. . North Korea fires missiles into the sea during US-South Korean exercises Pope Francis to be greeted by bare-breasted nun billboard on visit to...Obese dog, Dennis the dachshund, loses 75% of his bodyweight and \"is no longer...Snake in cornflakes: Man finds python inside box of cereal Maho Beach plane landing: Man films jet metres above tourists on Saint Martin...Magaluf tourists face drinks ban after Northern Ireland teen girl's sex act with...Video: Irish Open 2015 launched at the Royal County Down Video: Belfast City Council - Lord Mayors mark the end of an era Video: Public sector strike - Northern Ireland's public services disrupted by...Video: HomeFinder property of the week - 3 Ardenlee Avenue, Belfast Watch: Amazing moment baby says\" hello' at 7 weeks Botanic Inn Belfast, January 2015 Northern Ireland Nightlife: Cuckoo - Winter 2014 Northern Ireland Nightlife: Sixty6, Cathedral Quarter, Belfast - Winter 2014/2015 Northern Ireland Nightlife: The Bar With No Name - January 2015 Northern Ireland Nightlife: Shine Belfast, December 2014 Northern Ireland Nightlife: Shiro State of Decay has ridiculous amount of hidden penises' \"Protestants shop at Tesco - Tuesday films for Catholics' Revealed: Who are the richest people from Northern Ireland? Apple Watch: battery disappointing and expensive Mother's Day recipe: Balsamic onion & goat's cheese tart Northern Ireland's 25 most expensive houses for sale Images from the Belfast Telegraph Troubles Gallery IRA checkpoint, the early 1970's\" src = \"http: //cdn2.belfasttelegraph.co.uk/news/article25696284.ece/c4303/ALTERNATES/w300h165/iracheckinside\" title = \"Images from the Belfast Telegraph Troubles Gallery IRA checkpoint, the early 1970's\" > The Troubles gallery - IRA checkpoint, early 1970s new Ukip MEP <mark>David Coburn</mark> is facing calls to resign after allegedly comparing SNP...'25 Boko suspects' died in custody Cameroon has acknowledged that more than two dozen...Villages wiped out by Pacific storm new The Brumbies completed a season double over the Reds in comprehensive fashion...new The Highlanders claimed a 26-19 bonus-point win as...new Singer Van Morrison says he is not a fan of the modern...new Lindsay Lohan only went on nights out because she had nothing else to do. Ryan Gosling's \"complicated women' By using this website you consent to our use of cookies. For more information on cookies see our"}, {"articleID": "2010021515_00146192_W", "names": {"David Bates": ["Q12629627", "Q16105553", "Q16215698", "Q20876984", "Q21665492", "Q3017471", "Q5231201", "Q56248470", "Q57291048"]}, "date": "2010-02-15", "url": "http://ontopmag.com/article.aspx?id=5270&MediaType=1&Category=26", "content": "the new hampshire house will take up wednesday two measures that attempt to repeal the state's six-week-old gay marriage law, the ap reported. one bill would repeal the gay marriage law approved by lawmakers last year, while the second defines marriage as a heterosexual union in the new hampshire constitution, effectively banning gay marriage and blocking the state supreme court from taking action. both proposals met with strong opposition from democratic members of a key house panel which considered the bills last week. with a 2 to 1 margin, the house judiciary committee recommended the house should kill both measures. state representative nancy elliott touched off a loud debate in the blogosphere after video of her testimony condemning gay sex at the hearing was posted on youtube.com. the video was quickly taken down. \"we're talking about taking the penis of a man and putting in the rectum of another man and wriggling it around in excrement. and you have to think, would i want that to be done to me?,\" elliott, a republican from hillsborough, testified. elliot also alleged that the new law was hurting children, a standard claim of gay marriage opponents. new hampshire public schools are \"showing presentations of anal sex...they are showing our fifth graders how they can actually perform this kind of sex...that is the context of the lesson, that\" this is something that you, as a fifth grader, you may want to try,' \"she said. gay marriage opponents concede the democrat-controlled legislature is unlikely to reconsider its decision this year, but they hope to use the issue to alter the political landscape in their favor in november. state representative <mark>david bates</mark>, a republican from windham, is behind a grassroots effort to raise the issue at town hall meetings this spring. keep on top of all our headlines with our convenient newsletter. join us everyday!"}, {"articleID": "2017071323_00856362_W", "names": {"Brian Kerr": ["Q2924937", "Q4964340", "Q56877196", "Q849630"]}, "date": "2017-07-13", "url": "http://www.galesburg.com/news/20170713/bail-cut-in-half-for-galesburg-man-charged-with-child-abuse", "content": "Bail cut in half for Galesburg man charged with child abuse Thursday Jul 13, 2017 at 6:44 PM Jul 13, 2017 at 6:44 PM Robert Connelly The Register-Mail RConnelly _ GALESBURG--A Galesburg man charged with battering a seven-week-old child had his bail cut in half, but was not expected to post bond. Austin M. Mitchener, 19, East North Street, made a court appearance before Circuit Judge Paul Mangieri Thursday afternoon on a motion to reduce bail. His bail was set at $500,000, $50,000 needed to get out of jail, in an arrest warrant on one count of Class X felony aggravated battery to a child. That charge says Mitchener allegedly bounced a child \"on his lap without supporting the (victim's) neck, causing blood and swelling on the brain and/or seizures and/or shaken baby syndrome.\" If Mitchener is convicted, the charge carries a sentence of between six and 30 years in the Illinois Department of Corrections, which would be served at 85 percent. It is not eligible for probation. Mitchener is represented by defense attorney Jeremy Karlin. Knox County Assistant State's Attorney <mark>Brian Kerr</mark> successfully filed a motion to continue Mitchener's preliminary hearing one week to begin Thursday's court appearance. That led to the bond hearing, in which Karlin called Melania Mitchener to testify. She said she is Mitchener's stepmother. She has become a foster parent for the child in the case, who is now 2 1/2 months old, through the Illinois Department of Children and Family Services. The child was released from an area hospital last Friday, July 7. Karlin requested bail be lowered to $10,000, and Melania Mitchener said she could post the $1,000 that would be needed to get Austin Mitchener out of the Knox County jail. Even if he were to get out of jail, she said she understood he was to have no contact with the victim while the child's mother has supervised visits with a DCFS representative present. <mark>Kerr</mark> read from the Galesburg police report related to the incident to make an argument against reducing bail. He said Galesburg police received a call for a suspicious injury report on June 23 involving a child with blood on her brain, which came from non-accidental head trauma. A doctor said it was shaken baby syndrome and that the child was suffering from seizures and the swelling on her brain caused her brain to shift, <mark>Kerr</mark> said. It was not initially expected that the baby would survive, but she has subsequently recovered. The doctor ruled there was \"no other possible explanation other than some form of child abuse\" that caused the injuries, <mark>Kerr</mark> said in court Thursday afternoon. He further said Mitchener said he had anger issues growing up and would get frustrated when the child would not calm down. In those instances, he would hand the baby off to her mother. Early June 21, he took care of the child and was attempting to calm her down while the child's mother slept. He reportedly bounced the baby on his knee and chest without supporting the baby's neck. \"Shortly after bouncing her is when she went limp,\" which Mitchener thought was her going to sleep, <mark>Kerr</mark> told Mangieri in court. At that point, he reportedly lay the girl down and then checked on her a few hours later and found her twitching. Later that morning, the child was taken to the emergency room, <mark>Kerr</mark> said. Mangieri elected to cut Mitchener's bail in half from $500,000 to $250,000, $25,000 needed to get out of jail. That amount was believed to be too high for him to be able to post, according to testimony heard Thursday afternoon. Mitchener will return to court at 2 p.m. Thursday for his preliminary hearing. Robert Connelly: (309) 343-7181, ext. 266; rconnelly @ register-mail.com; @ RConnelly_"}, {"articleID": "2019021809_00151549_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}, "date": "2019-02-18", "url": "http://indiatoday.intoday.in/movies/celebrities/story/salman-khan-to-akshay-kumar-bollywood-joins-forces-to-donate-for-pulwama-martyrs-1458758-2019-02-18", "content": "On Thursday, the country saw the deadliest terror attack on security forces in over a decade. The Pulwama attack killed 40 CRPF jawans, leaving the country shaken. As the whole nation, Bollywood celebs too took to social media to condemn the dastardly attack. Many also came together to donate for the families of the martyrs. From <mark>Salman Khan</mark> and Amitabh Bachchan to Akshay Kumar and Badshah, many celebs have donated to the families of the martyrs. Condemning the attack, <mark>Salman</mark> tweeted, \"My heart goes out for the Jawans of our beloved country and their families who lost their lives as martyrs to save our families.\" My heart goes out for the Jawans of our beloved country and their families who lost their lives as martyrs to save our families...#YouStandForIndia <mark>Salman Khan</mark> (@ BeingSalmanKhan) February 14, 2019 Minister of State for Home Affairs Kiren Rijiju took to Twitter to reveal that <mark>Salman</mark> was donating to the families of the martyrs by contributing to the Bharat Ke Veer fund through his charity, Being Human Foundation. Thank you @ BeingSalmanKhan on offering to contribute for Pulwama Martyrs through BEING HUMAN FOUNDATION. I'll work out for handing over of the cheques in the account of #BharatKeVeer @ BharatKeVeer Kiren Rijiju (@ KirenRijiju) February 17, 2019 Amitabh Bachchan will also donate Rs 5 lakh each to the families of CRPF jawans who were martyred in the Pulwama terror attack. The actor will be donating a total amount of Rs 2.5 crore, he revealed in a tweet. Akshay Kumar too will donate Rs 5 crore through Bharat Ke Veer, a fundraising initiative of the Union Ministry of Home Affairs. The actor also urged his Twitter followers to do the same. He tweeted saying, \"#Pulwama is something we cannot & will not forget. We're all angry & it's time to act. So act now, donate to the martyrs of Pulwama on bharatkeveer. gov. in. There's no better way to pay homage to them & show your support. This is the only official site, pls don't fall prey to fakes.\" #Pulwama is something we cannot & will not forget. We're all angry & it's time to act. So act now, donate to the martyrs of Pulwama on https: //t.co/5j0vxsSt7f There's no better way to pay homage to them & show your support. This is the only official site, pls don't fall prey to fakes pic.twitter.com/sYruUtzgKY Akshay Kumar (@ akshaykumar) February 16, 2019 Diljit Dosanjh donated Rs 3 lakh for the families of the CRPF jawans. He tweeted saying, \"Saddened to hear the cowardly Attack on our brave soldiers. Prayers to the families of the brave #CRPF personnel who have sacrificed their lives at #Pulwama today. Salute all our martyred brave hearts.\" Saddened to hear the cowardly Attack on our brave soldiers. Prayers to the families of the brave #CRPF personnel who have sacrificed their lives at #Pulwama today. Salute all our martyred brave hearts. DILJIT DOSANJH (@ diljitdosanjh) February 14, 2019 Musician Badshah, who is also making his Bollywood debut this year, donated Rs 3 lakh to the CRPF Wives Welfare Association fund. He took to Instagram to announce the same. He wrote, \"What happened in Pulwama can neither be forgotten nor forgiven. But it's time to let our soldiers know that we stand with them. Many of the shaheed jawaans have left their families without any earning sources. It is time to contribute and help their families, children and wives and parents. To show them that we all stand with them and assure them of a future full of opportunities. Please donate through various platforms available. Whatever amount you can. Remember, they protect us and keep us safe and they deserve every bit of help and support. Donate karo, contribute karo. JAI HIND.\" View this post on Instagram What happened in Pulwama can neither be forgotten nor forgiven. But its time to let our soldiers know that we stand with them. Many of the shaheed jawaans have left their families without any earning sources. It is time to contribute and help their families, children and wives and parents. To show them that we all stand with them and assure them of a future full of opportunities. Please donate through various platforms available. Whatever amount you can. Remember, they protect us and keep us safe and they deserve every bit of help and support. Donate karo, contribute karo. JAI HIND A post shared by BADSHAH (@ badboyshah) on Feb 16, 2019 at 3:01 am PST The team of Total Dhamaal is also donating Rs 50 lakh for families of the martyrs. Ajay Devgn, who stars in the film, also took to Twitter to announce that the film, which is set to release on February 22, won't be released in Pakistan. ALSO READ | Kangana Ranaut on Pulwama terror attack: Anyone who talks peace now should be slapped on the streets ALSO READ | Janhvi Kapoor slams Pakistan daily for calling Pulwama terror attack a fight for freedom ALSO READ | Amitabh Bachchan to donate Rs 2.5 crore to families of soldiers martyred in Pulwama attack ALSO WATCH | Breaking down deadliest terror attack in Jammu and Kashmir"}, {"articleID": "2009030422_00089142_W", "names": {"Ricky Lee": ["Q7332121", "Q9198162"]}, "date": "2009-03-04", "url": "http://telegram.com/article/20090304/APA/903041822", "content": "fort worth, texas - unholstering her cell phone from her bra, a tough-talking texas woman chased down a purse snatcher in her car while calling 911. \"put it on the hood, now!\" val renfro is heard yelling on the 911 recording after she got her man. \"you give me my purse, right now.\" renfro, 65, from arlington, had finished shopping sunday at a fort worth office supply store and was getting into her car when a man shoved her twice, grabbed her purse and ran, according to a police report. that's when she reached for her phone, which she always keeps tucked into her bra, and called 911. while talking to the operator, renfro drove after the fleeing man. at one point, she apparently nudges the man with her car. the man tells her if she rolls down her window, he'll return the purse. \"like hell i will,\" she yells. onlookers eventually cornered the man near a movie theater. renfro said she later ran into the suspect at the police station, where he apologized to her. she said she accepted his apology. \"i don't have any animosity toward him,\" renfro said. \"who am i to be the judge of him?\" police identified the suspect as <mark>ricky lee</mark> sample, 47. he remained in the tarrant county jail on wednesday on a charge of aggravated robbery as well as a parole violation. his bail was set at $20,000. snow plow drivers looking for experienced (3 season minimum) snow plow...lot person needed pt. vehicle cleaning & general bldg maintenance. dan's...sprinkler fitters, licensed - top salary, benefit package includes...service consultant / warranty clerk strictly confidential. worcester...davis' farmland children's discovery farm in sterling, ma has the...customer service rep wanted needed entry level customer service / inside...housekeeper 24 hours per week 7 am to 3 pm includes every other weekend ....town engineer the town of grafton is seeking a qualified applicant for...plumbers, licensed / exp'd. apprenticed. exp. in commercial / multi - ..."}, {"articleID": "2012021808_00024119_W", "names": {"Brian Mcdermott": ["Q316345", "Q4964690"], "Ryan Hall": ["Q2943933", "Q3453794", "Q727961", "Q7384116"]}, "date": "2012-02-18", "url": "http://chesterchronicle.co.uk/chester-sport/national-sport/2012/02/18/mcdermott-salutes-victorious-rhinos-59067-30355089/", "content": "<mark>mcdermott</mark> salutes victorious rhinos feb 18 2012 leeds coach <mark>brian mcdermott</mark> hailed two-try winger <mark>ryan hall</mark> but admitted it was his side's defence that earned the spoils in friday night's heinz big soup world club challenge. the super league champions gained a thrilling 26-12 victory over manly sea eagles at headingley to lift the title for the third time in eight years and end a run of three straight victories by australian clubs. <mark>mcdermott</mark>, who became the first man to win a world club challenge as both a player and coach, said: \"i feel very proud and very humble. i'll get a bit excited when nobody is watching.\" he added: \"it's still sinking in to be honest. we did it the tough way and i don't think we'd want it any other way. it was an old-fashioned game of rugby league.\" we looked scruffy at times but we were brave and courageous. there was a period in the second half when we were gone. \"(<mark>ryan</mark>) bailey got a crack on his head, jonesy (jamie jones-buchanan) did his knee and neither could go back so we had two players left for the whole of the second half.\" i wouldn't say we were at our most vintage offensively, but you deserve to win world club challenges when you defend like that. it came down to how much the fellas were prepared to bend their backs. \"england international <mark>hall</mark> provided the individual highlight with a 90-metre interception try and added a second just before half-time to give the rhinos a winning platform.\" i'm pleased for <mark>ryan</mark>, \"said <mark>mcdermott</mark>.\" he's wants to learn and he's very hungry to keep on improving. \"he's a clever fella, very astute. interceptions don't just happen, it's something he works on in practice.\" keep up to date with the news. sign up for have your say! post your views and comments and have your say on the chester stories and issues that affect you."}, {"articleID": "2018091115_00247001_W", "names": {"Michael Regan": ["Q21062491", "Q21459008", "Q58249666"]}, "date": "2018-09-11", "url": "https://www.mirror.co.uk/sport/football/news/hugo-lloris-names-toughest-striker-13227835", "content": "Sport Hugo Lloris names toughest striker he's faced - and it's not Cristiano Ronaldo or Lionel Messi The Spurs goalkeeper, who led France to World Cup glory this summer, has faced a wealth of attacking talent in his career Share Comments By Thomas Bristow Online sports writer 16:48, 11 SEP 2018 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Get FC Barcelona updates directly to your inbox Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Hugo Lloris has named the toughest striker he's ever faced - and it's not Cristiano Ronaldo or Lionel Messi. The World Cup winning captain played for Nice and Lyon before arriving at Spurs and has more than 100 caps under his belt. At the fairly ripe age of 31 Lloris has faced a wealth of attacking talent throughout his career, but the best forward he's come up against is neither of the five-time Ballon d'Or winners. Instead, the Spurs shot-stopper named Real Madrid and Spain legend Raul. Read More Kylian Mbappe or Neymar: Atletico Madrid boss Diego Simeone reveals which PSG star he would rather sign Real Madrid's Raul celebrates scoring (Image: Getty) Hugo Lloris has faced some of the best strikers in the game (Image: <mark>Michael Regan</mark>) \"It's hard to pick one,\" Lloris told RMC Sport. \"A player like Raul, I played him when he was at Real Madrid and Schalke, he always had that quick glance on the goalkeeper, on where he was positioned and he shot depending on that.\" After that, there's the Suarezs, the Messis, I don't need to present them. Back in the day, there was also Pauleta at Paris Saint-Germain. I played him a lot when I was at Nice. \"The Spain forward scored 323 goals in 741 appearances for Los Blancos and 44 in 102 caps for Spain. Like us on Facebook Follow us on Twitter FC Barcelona Newsletter mirrorfootball Follow @ mirrorfootball Subscribe to our FC Barcelona newsletter Enter email Subscribe Comments Show more comments More On Hugo Lloris Nice Paris Saint-Germain Cristiano Ronaldo FC Barcelona Lionel Messi"}, {"articleID": "2014073113_00020415_W", "names": {"Chris Wills": ["Q5108490", "Q56754189"]}, "date": "2014-07-31", "url": "http://sj-r.com/article/20140730/NEWS/140739942/12662/www.sj-r.com", "content": "State officials will consider targeted reductions in historic site hours after Labor Day - including in Springfield - to ease the effects of budget cuts. Illinois Historic Preservation Agency Director Amy Martin said Wednesday that the agency is working on specifics and will attempt to maintain hours as much as possible at the most popular sites, including Abraham Lincoln sites. More than 1.3 million people visited eight state historic sites in Springfield and Petersburg in 2013, according to agency figures. \"We wanted to make it through the Labor Day holiday to accommodate people who have travel plans,\" Martin said after an Illinois Tourism Office event at Dana-Thomas House in Springfield. \"We're looking at trying to target it so that it's not all 26 sites.\" The agency budget for historic site operations was cut by $1.1 million for the fiscal year that started July 1, or 19 percent below the previous year. Martin said post-Labor Day hours also would take into account traditional fall visits by school groups. \"We have so many school groups coming in, and we don't want to affect those,\" Martin said. \"Teachers plan those so far in advance as well.\" Agency spokesman <mark>Chris Wills</mark> said discussions continue with legislative leaders for restoration of the $1.1 million early next year. \"That's what they cut, and that's what we would hope they'd put back,\" <mark>Wills</mark> said. \"It's not like we're going back to a level that would be an improvement.\" State Senate President John Cullerton, a Chicago Democrat, told The State Journal-Register editorial board last month that restoration of historic site funding should be a priority. <mark>Wills</mark> said lawmakers likely would not act on the restoration request until January. Lincoln's New Salem State Historic Site in Petersburg was the busiest local historic site in 2013 with more than 376,000 visitors, followed by a little more than 358,000 visitors at the Lincoln Tomb, and 321,000 at the Abraham Lincoln Presidential Library and Museum. *** Historic site visits in 2013 * Lincoln's New Salem State Historic Site: 376,463 * Lincoln Tomb: 358,142 * Abraham Lincoln Presidential Library and Museum: 321,071 * War Memorials: 152,040 * Old State Capitol: 109,687 * Lincoln-Herndon Law Offices: 29,066 * Dana-Thomas House: 23,893 * Vachel Lindsay Home: 3,530 Source: Illinois Historic Preservation Agency Contact Tim Landis: 788-1536, tim.landis @ sj-r.com, twitter.com/timlandisSJR."}]