[{"date": "2014-10-03", "url": "http://feeds.theguardian.com/c/34708/f/663841/s/3f169732/sc/13/l/0L0Stheguardian0N0Ceducation0C20A140Coct0C0A30Ccatholic0Eschool0Est0Ebenedicts0Ebury0Est0Eedmunds0Ebreach0Etrojan0Ehorse0Eofsted0Erules/story01.htm", "content": "A Catholic school in Bury St Edmunds fell foul of Ofsted rules. Photograph: <mark>Graham Turner</mark> for the Guardian A Catholic state school has fallen foul of controversial rules on promoting British values and guarding against extremism and radicalisation, introduced in the wake of Birmingham's Trojan Horse affair. The Ofsted report, which followed a snap inspection but was withdrawn within hours, claimed that younger pupils at St Benedict's secondary school in Bury St Edmunds, Suffolk, \"show less awareness of the dangers of extremism and radicalisation\". It questioned whether the school prepared pupils \"for life and work in modern Britain\" - with the language Ofsted said on Friday morning that the report was on hold for review by its east of England regional director, Sean Harford, after St Benedict's released what appeared to be the final version of the document on its website. The report was the result of a no-notice inspection of St Benedict's by Ofsted last month, only a few days into the start of the school year, because the school website failed to include details of its citizenship teaching. Ofsted's snap inspections were introduced after the investigations in Birmingham. The inspectors recommended \"making clearer the contribution to students' preparation for life and work in modern Britain and the dangers of extremism\". The Ofsted team also complained that the school's \"delivery of citizenship education is not made clear, or how the school teaches students about the dangers of extremism and radicalisation\". St Benedict's is a voluntary-aided Catholic faith secondary school with more than 600 pupils, around two-thirds of whom are Catholics. It boasts excellent A-level results, and in 2014, 70% of its pupils passed GCSEs with five or more A * - C grades, including English and maths, well above the government's minimum of 45%. <mark>Hugh O'Neill</mark>, the school's headteacher, said: \"We accept that Ofsted has a job to do, and there are reasons why they regard no-notice inspections as a valid form of inspection. We will follow whatever guidance the eventual Ofsted report that we receive asks us to follow .\" I've been gratified, as have the staff, by the number of messages we've had from colleagues, parents and students, who have all said they regard the school as excellent and don't feel the Ofsted report reflects their view of the school at all. That's been universal with everyone I've spoken to. \"The inspectors also found fault with the school's teaching and pupil progress regarding disadvantaged, disabled students - and lowered its grade from\" good \"to\" requires improvement, \"the second-lowest rating. <mark>O'Neill</mark> said Ofsted's report had come at a bad time, with parents visiting open days before making their final choices for secondary school applications this month. The school's previous inspection took place last year, and praised the pupils' moral, social and cultural development. Ofsted said that the regional director had decided to delay publication of the report\" to allow further quality assurance checks to take place \". Student rewards such as cash and free trips fail to improve GCSE results <mark>Tom Hardy</mark> in Peaky Blinders Preview of <mark>Hardy</mark> as Camden gangster Alfie Solomons Finally, the flying car may have landed Ebola isn't the big one. So what is? And are we ready for it? US Ebola patient's friends quarantined under armed guard Violent clashes break out in Hong Kong after counter-protesters storm sit-in <mark>John Lewis</mark> boss:\" France is sclerotic, hopeless and downbeat...it's finished '", "articleID": "2014100313_00045035_W", "names": {"John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"], "Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}}, {"date": "2014-10-05", "url": "http://www.fuse.tv/videos/2014/10/acl-fest-2014-paolo-nutini-interview", "content": "Paolo Nutini Meets Fans, Talks \"Caustic Love' & Influences at Austin City Limits On location at the Waterloo Autograph Tent at Austin City Limits Fest, Esteban Serrano caught up with not just UK soul-pop star Paolo Nutini, but his biggest fans, too! We found out exactly why a few of Paolo's fans were so excited to meet the singer, including one couple who say they have his music to thank for their initial spark .\" The first songs he played on the guitar for me were Paolo songs, \"one fan told us while looking at her boyfriend. Another fan first saw Nutini at ACL in 2007 and has been waiting for his return .\" His voice is just The Best Photos from Austin City Limits Fest 2014 (So Far) Excited to meet his fans, Nutini confided to Fuse before the signing, \"You just hope people are gonna' turn up .\" And turn up they did. Before signing countless autographs, the singer explained the title and theme of his Caustic Love album, which dropped earlier this year. \"Human on human love, romantic love - It can wash over all your defense mechanisms and leave you vulnerable,\" says Nutini. As an admirere in line to meet Paolo told us, it's the singer's deep, soulful (and sexy) voice that draws in fans, so we wanted to know who his musical influences were. \"The first thing I put on...was my grandfather's Drifters records. When I was about 5 years old, I put the needle on the vinyl and on came Ben E. King,\" says Nutini. \"It was all the old Stax [records], all the old Motown, all these five-part vocal groups; [The] Coasters, [The] Flamingos, [The] Platters - It was what I liked!\" ACL Fest 2014 Chvrches Talk New Single, Album at Last 2014 U.S. Festival Date ACL Fest 2014 Jack Antonoff Shares Strangest Desire at ACL Viral Watch Princess Jasmine From \"Aladdin' Sing\" A Whole New World \"22 Years Later Exclusive Interview Steve Aoki Explains Differences Between Two\" Neon Future' Albums Childish Gambino Delivers New Tracks, Old Favorites at ACL Avicii Returns With Genre-Defying \"The Days\" ft.. <mark>Robbie Williams</mark>", "articleID": "2014100516_00063496_W", "names": {"Robbie Williams": ["Q2156159", "Q2156168", "Q47875", "Q7341022", "Q7341023", "Q7341027"]}}, {"date": "2014-10-05", "url": "http://www.navhindtimes.in/chelsea-dump-arsenal-united-edge-everton/", "content": "Chelsea dump Arsenal, United edge Everton LONDON: Chelsea went five points clear at the top of the Premier League after a 2-0 win at home to Arsenal in a fiery all-London clash on Sunday. Eden Hazard gave Chelsea a 27th-minute lead with a coolly-taken penalty after he had been brought down in the box by Gunners defender Laurent Koscielny. Diego Costa's ninth goal in seven Premier League games after an excellent lofted through-ball from former Arsenal favourite Cesc Fabregas sealed Chelsea's victory 12 minutes from time. Kick-off at Stamford Bridge was delayed by 15 minutes as officials slowed the entry of Arsenal fans into the away end after a flare was set off. There was a flare-up of a different kind when Arsenal manager Arsene Wenger clashed with Jose Mourinho on the touchline, the Frenchman pushing his Portuguese counterpart to one side before the feuding bosses were separated. Chelsea then saw goalkeeper Thibaut Courtois leave the field with suspected concussion following a collision with Arsenal's Alexis Sanchez. Victory saw Chelsea go five points clear of second-placed reigning champions Manchester City and meant Wenger was still left searching for his first win against a Blues side managed by Mourinho in what was his 12th attempt. This defeat, Arsenal's first in the Premier League this season, left the Gunners nine points off top spot. It also extended their miserable away record at their English title rivals, with the Gunners now having won six points from 21 league matches at the home grounds of top five clubs. Earlier, Radamel Falcao's first goal for Manchester United secured a 2-1 victory over Everton. Colombia striker Falcao-signed on loan for a reported 10 million euros (£ 7.8 million, $13.1 million) on transfer deadline day-marked his fourth United appearance by scoring from inside the box after getting on the end of Angel di Maria's long-range shot in the 62nd minute. Argentina midfielder di Maria had given Louis van Gaal's side a 27th-minute lead when he curled in a shot from just inside the penalty area after an excellent pass from <mark>Juan Mata</mark>. Everton could have equalised on the stroke of half-time after they were awarded a penalty when Luke Shaw brought down <mark>Tony Hibbert</mark>. But Leighton Baines's spot-kick was too close to David de Gea, who dived to his right to make a fine one-handed save-the first of several fine stops. However, Baines recovered his composure to whip in a superb cross from which Gary Naismith headed Everton level 10 minutes after the break. Stoppage-time saw de Gea preserve United's lead with two impressive saves to deny Everton substitutes Leon Osman and Bryan Oviedo. The result meant United had their first back-to-back successes under Dutch manager van Gaal following last week's 2-1 victory at home to West Ham. \"David de Gea was fantastic,\" van Gaal told the BBC. \"It was not easy for him because he had a lot of players in front of his view. Despite that he stopped good and speedy shots .\" Turning to his new goalscorer, the manager said: \"Falcao was forcing himself last week against West Ham. I told him to be satisfied about his performances and that the goals are coming. The goals are coming!\" Everton's defeat was compounded by John Stones being carried off on a stretcher late on-placing a question mark over the defender's participation in England's upcoming Euro 2016 qualifiers with San Marino and Estonia. \"John Stones has an ankle ligament problem. It's too early to know the extent of it but it must be something serious for him to come off,\" said Everton manager Roberto Martinez. Christian Eriksen's 40th-minute shot from the edge of the box was good enough to give Tottenham Hotspur a 1-0 win at home to high-flyers Southampton-the club Spurs manager Mauricio Pochettino left before moving to White Hart Lane in pre-season. Pak Taliban switches side; vows to send jihadists to help ISIS...33 mins ago ISIS document disclose plans to seize Iran's nuclear secrets ...", "articleID": "2014100519_00027021_W", "names": {"Juan Mata": ["Q168740", "Q41839093"], "Tony Hibbert": ["Q310040", "Q7822568", "Q7822569"]}}, {"date": "2014-10-07", "url": "http://www.wctrib.com/content/willmar-city-council-gives-preliminary-ok-tax-abatement-redevelopment", "content": "Festivities surrounding Meander Weekend set in western Minnesota Tweet WILLMAR - Hutchinson mobile home park owner Gus Wurdell recently purchased the Regency East Mobile Home Park from its Colorado owners and is proposing to redevelop the Willmar park with new infrastructure and new affordable workforce housing. But Wurdell said the project will not support itself without a city business incentive, and he's requesting the Willmar City Council consider a 10-year abatement of city property taxes. Wurdell said the abatement will allow time for sufficient redevelopment and position the project for long-term success. Wurdell's request was reported to the council Monday night and the council voted to give preliminary approval to the abatement and directed City Planning and Development Director Bruce Peterson to solicit a formal application from Wurdell. The council's action was recommended by the Community Development Committee. Councilwoman Audrey Nelsen asked City Attorney <mark>Robert Scott</mark> to clarify the meaning of \"preliminary approval .\" <mark>Scott</mark> said the council was not obligating itself. With preliminary approval, the council will likely receive a formal application, in which case the council will have to apply its policies to make a decision, he said. \"You're not binding the council one way or the other,\" <mark>Scott</mark> said. \"You're giving a signal to the potential applicant that it might be worth his time to go through that process .\" In a Sept. 15 letter to Peterson, Wurdell said Regency East has suffered from poor management and deferred maintenance, which resulted in 75 percent vacancy and blighted conditions. After several years of trying to take over ownership of the park, he successfully closed on the property Sept. 15. Wurdell said affordable, quality housing is in short supply in Willmar as noted in the Vision 2020 and Vision 2040 community studies, \"and I believe this project will make a tremendous impact towards satisfying this need .\" Preliminary approval was recommended by the Community Development Committee. Committee Chair Rick Fagerlie said some questions were raised during committee discussion regarding the value of property that would be subject to the abatement. Fagerlie said staff will research that matter and the matter will be part of the financial analysis. The financial analysis will determine whether or not the mobile homes, which are considered personal property, are included in the abatement. Fagerlie reminded the council that Wurdell came to the committee about a year-and-a-half ago and said he wanted to purchase the park, but that the owners in Colorado decided not to sell. \"I think this would be a great project and really help the northeast part of Willmar,\" Fagerlie told the council. Councilman Jim Dokken asked if the project will be a positive thing for the city. Peterson explained Wurdell must still provide a formal application with a better statement of intent and a financial analysis to demonstrate the need for the tax abatement, among other things. Peterson said the city can expect the infrastructure to be upgraded and streets to be improved. The park will be better maintained and common areas for recreation will be created. Peterson said Wurdell was looking to be the primary home buyer and will resell the homes, but will rent the lots. Councilman <mark>Tim Johnson</mark> said he did not recall that the council had given preliminary approval to tax abatements in the past. Peterson agreed and said the committee worked on a different process to evaluate and review tax abatement requests. As a reasonable first step, Peterson suggested staff receive the developer's proposal and staff do some initial review and bring it to committee to determine if the request adheres to the policies. <mark>Johnson</mark> said Peterson is working on more formalized procedures. \"Obviously on this particular property, it looks quite positive,\" <mark>Johnson</mark> said. Gas prices dip under $3 per gallon 39 min ago COINS, ANTIQUES, GUNS & MISC AUCTION Located: Hawick Town Hall, Hawick, MN. SUN ., OCT 12, 12:00 NOON Coins to be sold at 8:45 am. Apx 350 lots. ANTIQUES, CLOCKS, GUNS & MISC AUCTION Located: Block's Auction Center, 2 mi SW of Spicer, MN on Hwy 23. MON., OCT 13, 4:00 PM Crock bowls; RENVILLE, MN - REAL ESTATE AUCTION Located: 402 SE 3rd ST, Renville, MN. THUR ., OCT 16, 10:30 AM Open House Dates: Mon, Oct 6, 5-6 pm, Mon, Oct 13 ANTIQUES, SHOP, YARD & MISC AUCTION Located: 850 Flanders Dr, Paynesville, MN. From Hwy 23 & MN 55, 4/10 mi SE on Hwy 55, 2 blks S on Maple 2208 Trott Ave. SW / P.O. Box 839 Willmar", "articleID": "2014100704_00062853_W", "names": {"Robert Scott": ["Q16195792", "Q17011471", "Q22280381", "Q26844391", "Q27835060", "Q28792452", "Q43391197", "Q43911924", "Q51589864", "Q55214937", "Q55215079", "Q57398724", "Q7340536", "Q7349659", "Q7349662"], "Tim Johnson": ["Q21279635", "Q329070", "Q3991363", "Q57844502", "Q7803722", "Q7803724", "Q7803725", "Q7803726", "Q7803727", "Q7803728", "Q861115", "Q925052"]}}, {"date": "2014-10-07", "url": "http://www.rte.ie/sport/soccer/international/2014/1007/650668-midfielders-play-down-impact-of-keane-book/", "content": "Roy Keane will give further insight into his book on Thursday Republic of Ireland midfielders Darron Gibson and Jeff Hendrick believes the furore over revelations in Roy Keane's new book will not have an impact on preparations for the upcoming Euro 2016 qualifiers. The release has dominated headlines since details emerged yesterday, including his departure from Manchester United. Gibson refused to be drawn on the dispute between his former manager Alex Ferguson and Keane, saying the squad have joked about the book rather than dwelling on it too much on the subjects. The Everton player said: \"There have been a few comments but nothing serious. The lads just get on with it .\" There have been a few jokes around the table but, like I said, nothing serious. I don't think it will affect the lads. \"Derby County's Jeff Hendrick, who will also be vying for a place in midfield against Gibraltar and Germany with <mark>James McCarthy</mark> ruled out with injury, said that the players only have eyes on the two qualifying matches. Hendrick said:\" I saw that his book was out but I don't really do too much reading. It's not really a distraction for us. The main thing for us is getting in training and getting focused on the game. \"I don't see why we would get uptight about his book to be honest. Our job is to get three points on Saturday and that's all we are focused on .\" Roy Keane says he turned down the chance to replace Neil Lennon as Celtic boss because the Hoops did not try hard enough to land him. Keane details Ferguson spat that prompted Utd exit Roy Keane has revealed he clashed with Alex Ferguson and <mark>Carlos Queiroz</mark> in a training camp prior to his Manchester United exit, telling the manager that he wasn't doing enough to address their problems. RTé is not responsible for the content of external internet sites.", "articleID": "2014100714_00099571_W", "names": {"Carlos Queiroz": ["Q313209", "Q9697298"], "James Mccarthy": ["Q529013", "Q55643105", "Q6139191", "Q6139195"]}}, {"date": "2014-10-08", "url": "http://www.brisbanetimes.com.au/entertainment/movies/new-teresa-palmer-thriller-screen-music-nominees-and-early-oscar-buzz-short-cuts-column-20141008-10rjr5.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Teresa Palmer. Photo: Hugh Hamilton Teresa Palmer thriller lined up for a Sydney shoot While there was no word on funding for the Hollywood movie that has brought Robert Redford to Sydney - he is playing newcaster Dan Rather in James Vanderbilt's drama Truth opposite Cate Blanchett and Elisabeth Moss - the NSW government has backed another film with Hollywood connections. Former Fox Filmed Entertainment executive Bill Mechanic, who produced the Pierce Brosnan-William Hurt historical fantasy The Moon and The Sun in Melbourne earlier this year, is part of the high-profile team behind <mark>Paul Currie</mark>'s thriller 2.22. Due to start filming at Fox Studios in January, it centres on an air traffic controller who finds himself returning to New York's Grand Central Station at 2.22 pm every day - an event that threatens the life of the woman he loves. While the male lead is still to be confirmed, Teresa Palmer will star in the film once she finishes shooting the Nicholas Sparks romance The Choice. With Screen Australia backing 2.22 in August, the state government has now put up $600,000 for an expected spend of $8.1 million in NSW. Arts Minister Troy Grant describes it as \"a great example of how our entrepreneurial filmmakers are working on the world stage and partnering with international producers\". Hirschfelder has two shots at winning best feature film score Colin Firth in The Railway Man. Composer David Hirschfelder has been a regular award winner over the years for his scores for the likes of Shine, Elizabeth and Better Than Sex. And as he works on Russell Crowe's The Water Diviner, he has claimed two of the four nominations for best feature film score at the Screen Music Awards to be held next month. Nominated for The Railway Man and Healing, Hirschfelder is up against <mark>Christopher Gordon</mark> for Adoration and <mark>Christopher</mark> de Groot for the little-known thriller Sororal. But two other composers have done even better with six nominations each - Antony Partos, whose work includes Redfern Now, Rake and Fallout, and Cezary Skubiszewski, whose work includes Once My Mother, The Broken Shore and Serangoon Road. Held by the Australian Guild of Screen Composers with the Australasian Performing Right Association and the Australasian Copyright Owners Society, the awards will be held at Sydney's City Recital Hall on November 12. Advertisement Early Oscar buzz has only one Australian actor in contention With Charlie's Country selected as Australia's entry for the foreign-language category, the Oscars are back in the news. And it looks like the near certainty that at least one Australian actor will be nominated might not eventuate next year. In the 16 years since Geoffrey Rush won best actor for Shine, the country's actors have only missed out twice, with a remarkable 23 nominations for five wins. While there are still three months before the nominations are announced, The Hollywood Reporter has framed a list of the leading contenders. With no mention of Cate Blanchett, Nicole Kidman, Geoffrey Rush, Russell Crowe, Hugh Jackman and other leading lights, only one Australian actor features - Mia Wasikowska is considered a long-shot for a best actress nomination for Tracks. For best actor, the only (tenuous) Australian connection is <mark>Jack O'Connell</mark> as a frontrunner for Unbroken, which was shot here. Two Australian editors who were both nominated five years ago are deep in the running again - two-time winner Kirk Baxter for Gone Girl and <mark>Lee Smith</mark> for Interstellar. And, deservedly, the Sydney-shot The Lego Movie is one of the favourites for best animated feature. Mia Wasikowksa in Tracks. Gone Girl arrives with a flourish at the box office On the back of strong reviews and the the popularity of the bestselling novel, Gone Girl zoomed to the top of the Australian box office on the weekend. Director David Fincher's follow-up to The Social Network and The Girl With The Dragon Tattoo took $4.7 million with a strong average of $11,700 per cinema. In a country where horror films often perform modestly, Annabelle also opened well with $1.9 million for an average of $11,500 per cinema. A prequel to The Conjuring, it continues an impressive run with low-budget horror for prolific Australian filmmaker James Wan, who broke through with Saw a decade ago. Wan was one of the producers of Annabelle after directing last year's hits The Conjuring and Insidious: Chapter 2. He has Fast & Furious 7 out next April. Social media popularity leads to surprising results at the US box office Ben Affleck in Gone Girl. The importance of social media in film marketing was shown at the US box office at the weekend, when Gone Girl and Annabelle surprisingly outperformed box office projections - both taking more than $US37 million at the top of the charts. According to Deadline Hollywood, tracking showed that Annabelle's trailers and promotional videos had 16.2 million YouTube views and the movie had 2.4 million Facebook posts and 2.8 million Tweets. More popular on older-skewing social media, Gone Girl had 9.2 million YouTube views, 30.1 million Facebook posts and 18.7 million Tweets. While Short Cuts will always encourage newspaper advertising, the value of a powerful trailer and promotional clips as part of a social media campaign has become increasingly important to a movie's release. Playwright live tweets film shoot Speaking of which, playwright <mark>Tommy Murphy</mark> boosted the social media presence of the film adaptation of his play Holding The Man by live tweeting from the Sydney set this week. He posted a series of photos of the crew, including director Neil Armfield (Neil Armfield on the set of Holding The Man. Photo: Photo: <mark>Tommy Murphy</mark> Academy in best financial position in years after new sponsor With a new two-year sponsorship deal with Hyundai and another new sponsor to be announced soon, chief executive Damian Trewhella says the Australian Academy of Cinema and Television Arts is in its best financial position for a long time as its award judging screenings get under way. The deal will see the car company present Social Shorts, which Trewhella describes as a chance for \"emerging filmmakers to have their work seen, shared and acknowledged by film enthusists and industry\" through a web site linked to social media voting. The academy does not having a naming rights partner for the awards but isn't chasing one either. Instead, Trewhella says it's looking for a presenting rights partner. \"We'd like to keep the AACTA Awards clean but\" the AACTA Awards presented by X or Y' is a really great opportunity now that these strong mid-tier building blocks are put in place. \"Free concert of film scores to launch Melbourne Symphony Orchestra season 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? Morrissey fans in shock over his cancer revelation:\" If I die, I die' 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? The Bachelor's sham proposal: Why is Network Ten not the villain? 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse", "articleID": "2014100813_00042309_W", "names": {"Christopher Gordon": ["Q2966583", "Q3332332", "Q43109056", "Q57902219"]}}]