[{"articleID": "2014083005_00010690_W", "names": {"Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2014-08-29", "url": "http://www.sys-con.com/node/3166218", "content": "VANCOUVER, BRITISH COLUMBIA--(Marketwired)--08/29/14--biOasis Technologies Inc. (TSX VENTURE: BTI) (OTCQX: BIOAF) (the \"Company\" ) is please to announce it has closed its non-brokered private placement announced on August 8th, 2014. The Company has issued 1,694,447 units (each a \"Unit\" ), including an over allotment of 94,477 Units, at a price of CDN $0.95 per unit, for gross proceeds of CDN $1,609,753.15. Each Unit consists of one common share and one full common share purchase warrant. Each warrant entitles the holder to purchase one additional common share of the Company at a price of CDN $1.20 per share for a period of twelve months up to and including August 29th, 2015, subject to an exercise acceleration clause. Under the exercise acceleration clause, which the Company may exercise once the Units are free of resale restrictions and if the Company's shares are trading at or above a volume weighted average price of $1.40 for 10 consecutive trading days, the Warrants will expire upon 30 days from the date the Company provides notice in writing to the Warrant holders via a news release. A cash finder's fees of CDN $101,460 was paid on a portion of the financing. All securities issued are subject to a hold period of four (4) months and one day and as such may not be traded until December 30th, 2014. The net proceeds from the sale of units have been added to working capital in furtherance of the Company's business. The insider of the Company purchased a total of 30,530 Units under the private placement and their participation in the Private Placement constitutes a \"related party transaction\" as defined in Multilateral Instrument 61-101 (\"MI 61-101\" ). The Company relied on Section 5.5 (a) of MI 61-101 for an exemption from the formal valuation requirement and Section 5.7 (1) (a) of MI 61-101 for an exemption from the minority shareholder approval requirement of MI 61-101 as the fair market value of the transactions did not exceed 25% of the Company's market capitalization. The Company did not file a material change report more than 21 days before the expected closing of the Private Placement as the details of the participation therein by related parties of the Company were not settled until shortly prior to closing of the Private Placement and the Company wished to close on an expedited basis for sound business reasons. \"The company was extremely pleased with meeting its stated objectives pertaining to this financing,\" said Rob Hutchison CEO. About biOasis biOasis Technologies Inc. is a biopharmaceutical company headquartered in Vancouver, Canada. Based on Transcend, biOasis proprietary brain delivery platform, the company is focused on creating new drugs that can cross the BBB to address unmet medical needs in the treatment of brain diseases such as neurodegeneration, metastatic cancer and metabolic diseases. biOasis trades on the OTCQX under the symbol \"BIOAF\" and on the TSX Venture Exchange under the symbol \"BTI\" . For more information about the company please visit www.bioasis.ca. On Behalf of the Board of Directors Rob Hutchison Chairman & CEO \"Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release\" biOasis Technologies Inc.. Tiffany Tolmie 778-383-3280 x103 www.bioasis.ca Investor Relations Contact: Gale Capital Copyright © 2014 SYS-CON Media, Inc. - All Rights Reserved. More Stories By Marketwired. Copyright © 2009 Marketwired. All rights reserved. All the news releases provided by Marketwired are copyrighted. Any forms of copying other than an individual user's personal reference without express written permission is prohibited. Further distribution of these materials is strictly forbidden, including but not limited to, posting, emailing, faxing, archiving in a public database, redistributing via a computer network or in a printed form. New Release of Quest Toad for Oracle Offers Enhancements to Reduce Risk Cloud Computing & All That It Touches In One Location Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. Add the key topics of WebRTC and DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday Submit your speaking proposal for the upcoming Cloud Expo in Silicon Valley Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. Produced and presented by Cloud Expo, Inc.. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2013052008_00050121_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2013-05-20", "url": "http://au.news.yahoo.com/a/-/business/17248707/oxfam-warns-of-health-risks-to-syria-refugees/", "content": "AMMAN (AFP) - Aid organisation Oxfam warned on Monday that the warmer weather will increase health-related risks for hundreds of thousands of Syrian refugees in Jordan and Lebanon, and appealed for urgent funds. With temperatures set to soar up to 40 degrees Celsius (104 Fahrenheit), and as refugees continue to flee to Jordan and Lebanon, \"the health risks must be urgently addressed,\" Oxfam said in a statement. \"Increased cases of public health-related diseases such as diarrhoea and skin infections have already been recorded in host communities and temporary settlements where an increasing number of refugees now live,\" it added. Oxfam said it is \"crucial to ensure funds are in place to provide refugees with shelter, clean water and adequate sanitation,\" adding that it is aiming to raise $53.4 million (41.6 million euros) over the next year. So far Oxfam's appeal is only 23 percent funded, the statement said. The UN High Commissioner for Refugees has said the number of refugees in Jordan alone could reach 1.2 million by the end of the year--equivalent to one fifth of the kingdom's population. The kingdom says it currently hosts more than 500,000 Syrian refugees. Lebanon currently houses 400,000 Syrians, according to the United Nations. \"Providing safe water, appropriate sanitation facilities and access to health care is costly. It's time for the key donors to wake up and face that reality,\" said Rick Bauer, regional humanitarian coordinator of Oxfam. \"The sad reality is that the vast majority of Syrian refugees are not going home soon. It is also crystal clear that host communities in Lebanon and Jordan need urgent help.\" Bauer said Oxfam is \"starting to really worry about the health of Syrian refugees\" . \"The aid effort must be properly funded and focused on providing refugees with affordable and decent places to stay, where they can live with dignity. That's priority number one for refugees and host communities alike,\" he said. NRL walks away from reported $50m sponsorship deal with bookie Tom Waterhouse <mark>Tony Abbott</mark>'s top adviser Peta Credlin charged with drink-driving"}, {"articleID": "2020021405_00171029_W", "names": {"Neil Henry": ["Q15442583", "Q6988735"], "Brian Dawson": ["Q15992895", "Q18378941", "Q4963533"]}, "date": "2020-02-14", "url": "http://radionz.co.nz/news/ldr/409563/blenheim-business-hub-concerns-raised-in-new-report", "content": "Blenheim business hub concerns raised in new report 31 minutes ago Chloe Ranford,, Local Democracy Reporter Business leaders in Marlborough fear \"competition\" and looking like a \"council puppet organisation\" if they worked together under one roof. Business groups in Blenheim are in talks over a business hub. Photo: LDR / Chloe Ranford A report detailing the pros and cons of a business hub has been released by four of the region's business groups and the Marlborough District Council - who have christened themselves \"Marlborough Inc'. The idea was first pitched during last year's annual plan, when the Marlborough Chamber of Commerce asked the council to fund a feasibility study into a business hub. The council instead offered to run meet-ups to pinpoint how to better support local businesses. It had since held three meetings with Destination Marlborough, Marlborough Chamber of Commerce, Business Trust Marlborough and the Blenheim Business Association (BBA), the report said. Council strategic planning and economic development manager <mark>Neil Henry</mark> said the organisations had supported an investigation into possible business hub costs, and creating a more\" cohesive \"business model. But their report showed the organisations were concerned that setting up a hub would cause a loss of brand identity and independence,\" community confusion \", and difficulties over who owned the building and its data. Written under the\" cons' section were people's worries, including: \"[the] bad performance of one partner effecting all\" , \"[being] tarred with the same brush\" and \"dominant personalities winning out\" . Business Trust Marlborough also queried the potential cost of renting a space in the hub, as their current lease was $285 a month. Benefits of a business hub included reductions in duplication, a potential reduction in costs, and a \"vibrant work environment\" . \"[It could allow] cover while I am on holiday,\" one person wrote. Marlborough Chamber of Commerce CEO Hans Neilson pitched the idea of a business hub to the Marlborough District Council last year. Photo: LDR / Chloe Ranford <mark>Henry</mark> said a hub would also prove Marlborough was \"open for business', and could entice central government agencies to set up. The organisations noted under an\" insights' prompt that the business hub might need to be located outside Blenheim's town centre, and that moving in together could encourage a lower infrastructure footprint. <mark>Henry</mark> pointed out that a business hub was not needed to build a more cohesive business system, which the organisations were working on. The proposed system, which could be put down instead of or before a business hub's establishment, encouraged the organisations to discuss each other's services to clients and share reporting. Business Trust Marlborough manager and councillor <mark>Brian Dawson</mark>, who could not vote on the report due to conflict of interest, said to keep or scrap the business hub was a \"big decision\" . He went with Marlborough Chamber of Commerce chief executive Hans Neilson to Hawkes Bay in September last year to pilfer ideas from its business hub, which covered a region, like Marlborough. \"Like all things, there's advantages and disadvantages,\" he said. Hawkes Bay's business hub was \"no doubt\" the go-to place for businesses, but there was also \"an air of very stiff competition\" . \"This is fine for bigger corporations, but the smallers ones have to constantly carve out a space in a client's mind,\" <mark>Dawson</mark> said. \"All events have multiple organisations attached to them. Sponsors don't know whether to sponsor one organisation or all of them.\" <mark>Henry</mark> said the organisations would decide whether to submit a funding request to the council's 2020-21 annual plan in April, and would consider opening the meetings to others in future. Until then, they aimed to complete several \"quick wins', like streamlining event calendars to\" remove duplication \", and publishing each other's business pitch to their personal websites to\" helped present a united \"Marlborough Inc' face\" , he said in his report. The organisations would continue to meet monthly to \"improve collaboration\" . Local Democracy Reporting is a public interest news service supported by RNZ, the Newspaper Publishers' Association and NZ On Air. Share this"}, {"articleID": "2011111001_00083632_W", "names": {"Joe Frazier": ["Q102301", "Q6209921"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2011-11-10", "url": "http://bet.com/news/music/2011/11/09/cee-lo-drops-new-anyway-single.html", "content": "previous jay-z, rihanna team for talk that talk duet is nothing if not honest and in the goodie mob member's newest single \"anyway,\" he scrolls down a list of his imperfections. fortunately, there's a women somewhere who doesn't mind his personal flaws. the mc-singer-songwriter born thomas farranti has released a new track from what may be his fourth solo album following 2010's highly successful the lady killer. \"anyway\" is co-written by wallpaper, an electronic group, and rivers cuomo, front man for the rock group weezer. \"i know i'm stingy with my money and it's hard to get some from me but you still love me anyway,\" cee-lo sings over strolling drums and an electronic twinkle of keys on the clip leaked on the web. \"there's no one else like this that would put up with my sh--, and still love me anyway,\" he adds later. photos from the life of boxing legend <mark>joe frazier</mark>. signs of the times: <mark>michael jackson</mark> fans show their support signs carried by <mark>jackson</mark> fans and a murray advocate. uncurbed appetites: top political sex scandals sex and politics are strange bedfellows. remembering the life of a hip hop icon. tweet sheet: celebs react to heavy d's death"}, {"articleID": "2014112416_00016238_W", "names": {"Reinhard Marx": ["Q18691585", "Q43930"], "John Paul": ["Q1701359", "Q6252169"], "Ian Paisley": ["Q296597", "Q575881"]}, "date": "2014-11-24", "url": "http://ncronline.org//news/global/europe-awaits-pope-francis-visit-parliament", "content": "When Pope Francis arrives at the European Parliament, the legislative branch of the European Union, in Strasbourg, France, on Tuesday, he'll be entering a place where the hopes and fears, passions and prejudices of a whole continent are routinely played out. In May's elections, nationalist and populist formations such as France's National Front and Britain's UK Independence Party made strong advances. And while two-thirds of the assembly is still made up of the mainstream center-right and center-left, Francis must offer a message that resonates with an audience ranging from devout Christians to militant atheists. \"The pope will be warmly welcomed--both as a religious leader and as a moral authority,\" said Jan Bernas, spokesman for the Socialist-Democrat group, which holds the second-most seats in the 751-seat Parliament. \"As a secular political organization, we embrace various orientations and don't follow any religious doctrine,\" Bernas told NCR. \"But we believe charity and the common good should be at the heart of politics, and we'll be eager to hear his words of encouragement.\" Become one today! Francis will also be visiting the nearby Council of Europe, the wider advisory organization of European states, whose 47 members include Russia and Ukraine. German Cardinal <mark>Reinhard Marx</mark>, who heads the Commission of European Union Bishops Conferences (COMECE) said he hopes Francis will plead against the war now setting Russia and Ukraine against each other. But he said he's confident Francis will also address the poverty and exclusion that have worsened during the financial crisis and reiterate Catholic support for the \"noble ideals of European integration.\" \"Pope Francis is acknowledging the unique significance of the European institutions in the life of our continent and saluting the achievements of the European project,\" <mark>Marx</mark>, archbishop of Munich-Freising, said in a mid-September statement. \"We hope he'll encourage European parliamentarians in their work and show how the foundational values of the Union, largely inspired by the Christian faith, may shape the Europe of tomorrow,\" <mark>Marx</mark> said. Not everyone has been so positive. There have been calls for a boycott of the visit by politicians favoring the French model of strict church-state separation, as well as from a coterie of secularist and anti-clerical organizations. Members of the feminist group Femen protested the pope's intended \"attack on secularization\" in a naked St. Peter's Square protest in mid-November, while The Alliance for a Secular Europe rejected Schulz's invitation, citing the Catholic church's alleged compounding of the Ebola pandemic in West Africa. \"The religious movement represented by the Pope continues to actively combat human rights, such as the European Union defends, seeking to impose on the rest of society a dogmatic moral vision, in defiance of the principles of freedom of conscience and equality,\" The Alliance for a Secular Europe wrote in an Oct. 31 open letter. \"The Catholic Church's doctrinal positions on start and end of life and sexual matters, including women's reproductive rights, the very issues on which they campaign most forcefully, are the very ones on which they are at most variance from their followers, especially in Europe,\" the letter continued. Schulz has sought to reassure the critics. \"We'll be welcoming someone who, at this historical moment, is a point of reference not only for Catholics but for many other people as well,\" Schulz said at a mid-October Strasbourg press conference. \"At a time when many are disorientated and the world is moving at a dizzying speed, often in very risky directions, the pope is the only person giving people hope through his noble rectitude,\" he said. It remains to be seen, however, how Francis will be received. \"The Holy Father's presence is symbolic--but he'll be speaking in front of European representatives who are responsible for democracy, freedom of religion and human rights, and he'll clearly be viewed differently than his predecessors,\" Marion Jeanne, a French spokesman for the conservative European People's Party, told NCR. \"Although his visit will strongly signal recognition for the EU as a peace project, however, I'm not only expecting words of peace. I also imagine he'll want to wake Europe up to its Christian roots and our global responsibility to keep them alive.\" The visit, which will last barely four hours, will be the pope's first to the territory of the European Union outside Italy and the first to the European Parliament by a pontiff since that of Pope <mark>John Paul</mark> II in 1988. <mark>John Paul</mark>'s address to the Parliament was disrupted by the Rev. <mark>Ian Paisley</mark>, leader of Northern Ireland's Protestants, who was bundled from the chamber after waving posters branding the pontiff the \"anti-Christ.\" But the pope was otherwise well-received for his speech, defending the \"aspirations of Slavic peoples\" then under Communist rule, and for championing a united \"sovereign Europe, shaped by the Christian faith.\" Much has changed since in Europe's political and cultural map. The 1989 collapse of Communist rule brought old nations back into the European family. Meanwhile, the EU has expanded from 12 to 28 member-states with a combined population of 507 million and wields far greater power and influence as the world's largest economic bloc. Although the Vatican appointed its own permanent representative to the European institutions in 1990 and has consistently argued for an integrated Europe, it's often been unhappy with the course of events. Church membership and participation plummeted, and EU officials have been accused of ignoring the role of religious communities in their treaties and directives. Prominent Catholics, meanwhile, have accused the European Parliament itself of an anti-Catholic agenda on issues like same-sex unions and embryo research. Others, however, have cautioned against overreacting. Although the EU's landmark 2009 Lisbon Treaty declined to acknowledge Europe's Christian roots directly, it recognized the \"identity and specific contribution\" of churches under the national law of member-states and committed EU officials, under Article 17, to maintain \"an open, transparent and regular dialogue\" with them. During the same year, church leaders expressed concern when MEPs, members of the European Parliament, voted to strip away national exemptions from the Anti-Discrimination Directive, raising fears that faith schools would be forced to admit non-believers and gay couples would be able to sue if refused church marriages. In 2011, however, they welcomed a ruling by the European Court of Human Rights validating the public presence of crosses after a previous judgment barring them from state schools had prompted calls for a Europe-wide ban. In 2013, church leaders accused the Parliament of trespassing beyond its competence after a draft resolution called for abortion--which is tightly restricted in Poland, Malta, and other countries--to be recognized as a \"fundamental right\" throughout the EU. In June 2013, however, they lauded the Parliament's backing for new EU plans to make financial help for countries around the world conditional on their protection of religious rights. Such topics may well appear in the pope's Strasbourg address. Although Francis has said little so far about Europe, he'll most likely be aware, as an experienced Jesuit pastor, of the challenges of secularization and the need for change in how his church proclaims the Gospel in an area deeply affected by hardship and social injustice and showing signs of tiredness and disillusionment. Speaking in Sardinia, Italy, in September 2013, Francis talked of an economic system that had fueled a crisis both cultural and economic and the need to place mankind at its center again in place of the \"would-be pagan god of money.\" It may be a message the pontiff brings to talks with new European officials such as Poland's Donald Tusk, who takes over Dec. 1 as president of the European Council, or the EU's head of state, and Jean-Claude Juncker of Luxembourg, who took over on Nov. 1 as 12th president of the EU's 28-member governing commission. As his largest encounter with politicians to date, the Strasbourg visit will bring Francis into contact with all the political and ideological tendencies of a continent marked through history by wars and crises. But Fr. Patrick Daly, secretary-general of COMECE, is hopeful. Francis cannot assume a \"familiarity with Christian social teaching\" on the part of his audience, Daly said, but he can be expected to cope well with \"his first test in the political arena.\" \"President Schulz and the MEPs have a right to assume the pope will display sensitivity to the long-term aspirations of the European project, and to the competences and policy fields specific to the Union,\" Daly said in an October statement. \"But the Holy Father will be speaking to a Parliament that still has the freshness and energy of any parliament at the beginning of its term, knowing that 58 percent of MEPs are there for the first time, and are impressionable,\" he said. [Jonathan Luxmoore is a freelance writer covering European church news from Warsaw, Poland and Oxford, England. His latest two-volume book, Before you can post a comment, you must verify your email address at Disqus.com / verify. Comments from unverified email addresses will be deleted. Be respectful. Do not attack the writer. Take on the idea, not the messenger. Don't use obscene, profane or vulgar language. Stay on point. Comments that stray from the original idea will be deleted. NCR reserves the right to close comment threads when discussions are no longer productive. We are not able to monitor every comment that comes through. If you see something objectionable, please click the \"Report abuse\" button. Once a comment has been flagged, an NCR staff member will investigate. Special Section: Saints Not all of our content is online. National Catholic Reporter publications:"}, {"articleID": "2017051600_00054126_W", "names": {"Susan Collins": ["Q22279", "Q7647692"], "Mike Rogers": ["Q1933467", "Q970515"]}, "date": "2017-05-15", "url": "http://rss.cnn.com/~r/rss/cnn_allpolitics/~3/1aarWYngrWI/index.html", "content": "GOP senators question whether Cornyn should get FBI job Updated 2146 GMT (0546 HKT) May 15, 2017 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. JUST WATCHED Sen. John Cornyn is on the short list to be the next FBI director Some of his Republican Senate colleagues want someone else (CNN) Influential Senate Republicans are questioning whether one of their own--Senate Majority Whip John Cornyn--should be tapped to run the FBI, amid a deeply chaotic political environment after President Donald Trump fired James Comey as director of the bureau. While Cornyn is one of the more popular members of the Senate GOP Conference, a number of his colleagues are skeptical that he would be the right choice for the job, worried that such a pick would be viewed as too political at a time when many critics are questioning whether Comey was fired to slow-walk the FBI's investigation into alleged Russian coordination with the Trump campaign during last year's elections. On Sunday, Senate Majority Leader Mitch McConnell declined to put his weight behind his top deputy, instead pushing another potential candidate, Merrick Garland, who was former President Barack Obama's Supreme Court pick before the majority leader led an effort to scuttle his nomination last year. Sen. Lindsey Graham, who serves on the Senate judiciary committee with Cornyn, suggested that it made sense to name an FBI agent to the post--rather than the Texas Republican. And on Monday, Sen. <mark>Susan Collins</mark>, who sits on the intelligence committee with Cornyn, said it made sense to choose either Garland or <mark>Mike Rogers</mark>, a former House intelligence committee chairman and FBI special agent. \"I think the world of John Cornyn, and he would be a great choice in normal times, but we're not living in normal times,\" Sen. <mark>Susan Collins</mark>, a Maine Republican, told CNN Monday. Read More With Garland, <mark>Collins</mark> said: \"No one could argue that he was beholden to anybody in any way and he would bring integrity and independence to the job.\" On Monday, Cornyn, who has insisted he has not been offered the job, told CNN he interviewed this weekend for 45 minutes with Attorney General Jeff Sessions, one of his former Senate colleagues, and Rod Rosenstein, who is the deputy attorney general. But Cornyn declined to say whether the Russia probe or Comey's firing were discussed. And he would not say if there was a pledge for loyalty, as Trump reportedly asked Comey to commit to earlier this year, though the White House has denied that account. \"I met with the attorney and the deputy attorney general. I told him I was interested in having a conversation and, basically, that's what we did,\" Cornyn said. Asked about the White House's shifting explanations for Comey's firing, Cornyn said he still backed the President's decision and supported the initial reasoning behind the firing--that Comey mishandled the Clinton email investigation. \"I found the Rod Rosenstein email compelling--that's still my view.\" Cornyn would not comment about Trump's threats to release a tape of his conversations with Comey--or if Congress should obtain those tapes. But <mark>Collins</mark>, like other Republicans, said the White House should be prepared to turn them over. \"We have no idea whether or not there are tapes but if there are tapes then they should be turned over,\" <mark>Collins</mark> said. \"That issue was settled many years ago when the Supreme Court ruled in 1974 that the tapes that President (Richard) Nixon had should be turned over to Congress.\" Democrats have vowed to try to block the new FBI director until Rosenstein names a special prosecutor to investigate the Russia probe. But they would need to court at least three Republicans to be successful. And <mark>Collins</mark> signaled she would not go that route. \"I don't think that's a good strategy at all,\" <mark>Collins</mark> said, adding that she wanted to question Rosenstein Thursday on whether a special prosecutor was indeed needed."}, {"articleID": "2017082103_00635726_W", "names": {"Brad Pitt": ["Q35332", "Q373912"]}, "date": "2017-08-21", "url": "http://www.9news.com.au/national/2017/08/21/12/49/daniel-kelsall-argues-murder-sentence-should-be-reduced-by-up-to-10-years", "content": "Killer who stabbed victim 28 times in \"senseless' murder appeals sentence By Kelly Fedor • Court Reporter 1:40 pm Aug 21, 2017 Daniel Jack Kelsall today argued for his sentence to be reduced. F Share T Tweet B Mail J Tumblr G Share L LinkedIn W WhatsApp Daniel Jack Kelsall has argued his sentence for the murder of Morgan Huxley at Neutral Bay, should be reduced by up to 10 years. The now 24-year-old chose not to appear via video link as his appeal was heard in the NSW Supreme Court this morning. But his parents Mark and Lynne Kelsall were there to support him almost two-and-a-half years after he was sentenced to a minimum 30 years behind bars for stabbing Morgan Huxley 28 times in his Neutral Bay unit. CCTV showed Kelsall following the 31-year-old home from the Oaks Hotel that night. The sentencing judge, Justice Robert Allan Hulme said the murder\" was utterly senseless and needless...it must have been the doing of a very disturbed individual. \"Morgan Huxley was stabbed 28 times in his Neutral Bay unit. But Kelsall's barrister Braddon Hughes SC argue today the judge made an error in not considering his prospects of rehabilitation properly. He argued he should have placed\" more emphasis on his age, his youth, his lack of convictions and the very, very long time he's going to spend in custody \"he said. Related Articles Sydney trip ends in tragedy for bricklayer Max Summerfield French designer goes head to head with <mark>Brad Pitt</mark> over chateau Husband charged after wife allegedly stabbed in Sydney home He called the sentence\" crushing \"and said\" no matter what steps the applicant makes with his mental health it won't count in a positive way. \"Crown prosecutor Sally Dowling SC today argued Kelsall showed\" psychopathic traits \"which was\" an incurable condition \"and had never shown any remorse.\" This was a...truly heinous, chilling and grotesque case of murder. \"She said the sentencing judge took into account Kelsall's youth when he refused to grant their requests for a life sentence. The three judges hearing the appeal will deliver their judgement at a later date. Mr Huxley's sister Tiffany was among those in court for the hearing. © Nine Digital Pty Ltd 2017 Continue reading courts New South Wales crime national Auto news: Which is Australia's best small hatch? - caradvice.com. au"}, {"articleID": "2010091718_00130604_W", "names": {"Abdul Rahman": ["Q25471383", "Q2632820", "Q26955606", "Q317395", "Q4665622", "Q4665623", "Q48970513"]}, "date": "2010-09-17", "url": "http://gulfnews.com/opinions/columnists/religious-dogma-infects-israeli-politics-1.683445", "content": "religious dogma infects israeli politics by brutalising palestinians based on ancient myths, tel aviv is igniting a huge fire that threatens its very existence by as \"ad <mark>abdul rahman</mark>, special to gulf news published: 00:00 september 18, 2010 the destiny of the entire middle east is now being linked to a myth that is bound to inflict destruction across the whole region, including israel, if ever it turns into a reality. the jewish creed is steadily becoming the dominant factor in israeli politics with the number of secular israelis decreasing. the zionist entity has acquired a religiosity after being born from secular principles and so the middle east conflict, according to many israelis, has become an extension to the so-called destroyed temple\" that must be built again \". the destiny of the entire middle east is now being linked to a myth that is bound to inflict destruction across the whole region, including israel, if ever it turns into a reality. the self-created religious dogma has now emerged as the deciding factor in israeli politics, not the national interests or national security, thus affecting the safety and the very survival of israel. political pressures from the international community have utterly failed to stop israel from creating new facts on the ground and imposing them by brutal force upon the palestinians in their lands occupied since 1967. this brutal israeli policy has been and is still being operated above international law, without feeling worry about or fear of any accountability. such a state of mind is causing all differences between the left and the right to completely disappear. no difference can now be perceived between ehud barak, the current defence minister, who said;\" if i were a palestinian, and at the right age, i would have joined a terrorist organisation \", and the extreme right\" star', lieberman, who now insists on the so-called \"oath of loyalty\" that has to be pledged to \"the jewishness of israel\" , even by non-jews to maintain the israeli citizenship. racism moreover, prime minister benjamin netanyahu, whose main project is to turn israel into a purely jewish state, is asking the palestinians and the world to officially endorse his racial proposition which would make the transfer of palestinians an absolute inevitability. therefore, all of the above-mentioned israeli leaders appear in full agreement to not cede an inch that might support legitimate palestinian rights. a close observation of israeli policy in the occupied territories reveals utter stupidity. an example is that the israeli colonies have practically negated the possibility of any peaceful two-state solution which has been an endorsed policy of the international community. colonies have gained israel the full image of and similarity with the former apartheid regime of south africa. in his article the mark of settlements, published in yediot ahranot, israeli writer jedi taos, said: \"the continued process of settlement is a clear proof that the jewish state does not belong to the enlightened nations of the world. the ones looking at us from the outside believe that while israel speak of two states, it is doing all it can to eternalise a situation in the occupied territories in which jews have the right to vote, but not the arabs. it is exactly like south africa's apartheid period. we are a state with a shameful mark on its forehead. and the settlements are this mark. we will not only be boycotted by musical bands and universities, but in the end, we will be boycotted by business companies and governments\" . in an article entitled a state of illusional duality, the jewish writer alexander jacobson states: \"it is clear, since 1967, that israel has no choice to annex the territories and to grant citizenship to its occupants..., endorsing the annexation and the granting of citizenship is an illusion. how could we assume that palestinians would agree to stay without any sense of belonging that is an integral part of the arab world? there is no heroism in brutally attacking peace convoys to break the siege around gaza. there is no heroism in attacking peaceful demonstrations against the wall and against the expansion of colonial settlement. if israel is not confronted with punitive resolutions, israel's madness would keep going.\" by holding on to talmudic and torah myths, israel appears unable to achieve balance with violence committed on a daily basis brutalising palestinians economically, politically and culturally, igniting a huge fire that shall very soon drag the israelis into its heat. it is important to remember that israel will not be the first entity who would be committing suicide by the hand of her sons! email a friend emailing an article to friend is a simple way to share a news item. your friend will receive an email with your name and email address as well any personal message you choose to send. the information you provide on this page will not be used to send unsolicited emails. opec needs to present a united front organisation has to sort out internal rivalries and enhance investment to tackle western challenges to its influence"}, {"articleID": "2018011117_00194252_W", "names": {"Bill Smith": ["Q17017840", "Q20273869", "Q4020151", "Q4400961", "Q4910910", "Q4910914", "Q4910916", "Q4910919", "Q4910920", "Q4910921", "Q4910925", "Q4910927", "Q56274191", "Q621106", "Q862469"]}, "date": "2018-01-11", "url": "http://www.bigcountryhomepage.com/news/main-news/shipt-to-bring-groceries-from-heb-to-abilene-homes/910517139", "content": "Shipt to bring groceries from HEB to Abilene homes By: Erica Garner Posted: Jan 11, 2018 11:02 AM CST Updated: Jan 11, 2018 11:04 AM CST Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Shipt is coming to Abilene, meaning residents will soon be able to have HEB groceries delivered right to their doors. Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Shipt is coming to Abilene, meaning residents will soon be able to have HEB groceries delivered right to their doors. ABILENE, Texas (KTAB/KRBC) - Shipt is coming to Abilene, meaning residents will soon be able to have HEB groceries delivered right to their doors. Beginning on January 18, anyone who wants to take part in the Shipt service can create a profile on the company's website, select their food items, and get their order delivered fresh the same day in as little as an hour. The full selection of products available at HEB will be listed on the website. Membership to Shipt is normally $99 a year, but to honor their expansion, Abilene residents who sign up prior to January 18 can receive a $50 discount. Shipt began serving HEB customers in May of 2016 and is now launching in 14 additional areas, including Abilene. \"In the past year, we've seen tremendous growth with H-E-B, an incredible partner and beloved retailer in the state of Texas. Together, our latest expansion brings the simplicity and convenience of grocery delivery to more families across the state,\" said <mark>Bill Smith</mark>, founder and CEO of Shipt. Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. More Stories A Florida university posted campus police outside a sociology class...46 minutes ago Whataburger is giving customers a chance to win free food for a year...1 hour ago"}, {"articleID": "2020010907_00193145_W", "names": {"Duncan Wilson": ["Q21063532", "Q59504415"]}, "date": "2020-01-09", "url": "http://www.enfieldindependent.co.uk/news/national/18147314.privately-owned-roman-fort-hadrians-wall-gifted-nation/", "content": "Privately owned Roman fort on Hadrian's Wall gifted to nation By Press Association 2019 Carrawburgh Roman Fort 0 comment A Roman fort on Hadrian's Wall has been donated to the nation by the landowner. Carrawburgh Fort in Northumberland is one of 16 along the 73 miles of Hadrian's Wall and has been handed over to the care of English Heritage by owner Jennifer Du Cane. The 1.4 hectare site, which sits between the cavalry fort at Chesters and the infantry outpost at Housesteads, would once have been the garrison of 500 soldiers defending the wall from tribes in the north. The fort's surviving structures, including the remains of its walls, lie beneath the turf and it has been investigated archaeologically less than other sites nearby, meaning it could hold undiscovered treasures. Carrawburgh's garrison on the edge of the Roman Empire was made up of soldiers from south-west France and later southern Belgium, and they built a nearby temple to their god Mithras. The site has been cared for by the Du Cane family since 1950. Jennifer Du Cane said: \"It has been a great privilege, but also a serious responsibility, to own Carrawburgh Roman Fort.\" The time has come to pass on this amazing site as a gift to the nation. \"Legal ownership of Carrawburgh has transferred to Historic England, the Government's heritage adviser, and it will be cared for by English Heritage. The site has been owned by the du Cane family (Justin Minns/English Heritage/PA) It will join the National Heritage Collection which are important historic sites, dating back to Stonehenge and as recent as a Cold War bunker outside York. The fort is the first acquisition for the National Heritage Collection since English Heritage became a charity in 2015. Kate Mavor, English Heritage's chief executive, said:\" This is a great start to the New Year, not only for English Heritage but for the nation who will get to enjoy this wonderfully evocative site on what was once the edge of the Roman Empire. \"We would like to thank Jennifer Du Cane for her generosity and look forward very much to welcoming the public to Carrawburgh.\" It is already open for visitors (Justin Minns/English Heritage/PA) <mark>Duncan Wilson</mark>, chief executive at Historic England, said: \"We are enormously grateful for this generous gift.\" Hadrian's Wall is one of England's most important historic sites and Carrawburgh makes a really valuable addition to our National Collection of historic properties. \"The fort represents a key part of the Roman frontier and is of outstanding archaeological significance.\" It has the potential to contribute significantly to our knowledge of the Roman Empire and to visitor enjoyment of the Wall. \"Carrawburgh Roman Fort is now open to the public and entrance is free. 0 comment"}]