[{"articleID": "2013101023_00036435_W", "names": {"Florian Mayer": ["Q47176970", "Q51526161", "Q77170"], "Andy Murray": ["Q10125", "Q526811"]}, "date": "2013-10-10", "url": "http://www.sanluisobispo.com/2013/10/10/2726596/djokovic-nadal-into-quarters-federer.html#storylink=rss", "content": "Shanghai, China (SportsNetwork.com) - Top seeds Novak Djokovic and Rafael Nadal moved into the quarterfinals, while former world No. 1 great Roger Federer suffered a third-round upset Thursday at the $3.85 million Shanghai Masters tennis event. The reigning Shanghai champion and former world No. 1 Djokovic drubbed Italian Fabio Fognini 6-3, 6-3, while the second-seeded, newly-crowned No. 1 Nadal beat Argentine Carlos Berlocq 6-1, 7-6 (7-5) on the hardcourts at Qizhong Forest Sports City Arena. The fifth-seeded 2010 Shanghai runner-up Federer succumbed to oft-injured former top-10 performer Gael Monfils, 6-4, 6-7 (5-7), 6-3, on Day 5. \"[It was] one of those matches that could have gone either way,\" said Federer. \"I think I was a little lucky in the second set to get back, to be quite honest. I played a solid tiebreak .\" I had chances early on in the third set I think to make something happen. He kind of recovered, then started to serve a bit better again towards the end of the third set, which made it difficult for me. It's a bit of an up and down performance for me. \"The struggling Federer, who hasn't reached a semifinal since mid-July, lost to a player outside the top 20 for the fifth time in his last six tournaments. Monfils is now 2-6 lifetime against the 32-year-old 17-time Grand Slam king Federer .\" It's a good win for me, \"said Monfils .\" I feel a bit sorry for him because I know he's running for London. But it's tennis. He's going to have more opportunity those weeks coming up. \"Other big upsets came when German <mark>Florian Mayer</mark> doused third-seeded Spaniard and 2011 Shanghai runner-up David Ferrer 6-4, 6-3 and 15th-seeded Spaniard Nicolas Almagro took out fourth-seeded Czech slugger Tomas Berdych 6-7 (6-8), 6-3, 7-6 (7-4). Also on Thursday, sixth-seeded Juan Martin del Potro advanced via walkover when sixth-seeded Tommy Haas was unable to go because of a back injury, while seventh-seeded Jo-Wilfried Tsonga topped 12th-seeded Japanese Kei Nishikori 7-6 (7-5), 6-0 and eighth-seeded Stanislas Wawrinka bested 10th - seeded Canadian Milos Raonic 7-6 (7-2), 6-4. Raonic was last week's Tokyo runner-up to del Potro and titled in Bangkok two weeks ago. Friday's quarterfinals in Shanghai will pit the Australian Open champion and U.S. Open and Wimbledon runner-up Djokovic against Monfils, the 2009 Shanghai runner-up Nadal versus Wawrinka, the former U.S. Open champion del Potro against Almagro, and Tsonga versus <mark>Mayer</mark>. Djokovic defeated then two-time reigning champion <mark>Andy Murray</mark> in last year's Shanghai finale. Djokovic beat the U.S. and French Open champion Nadal in last week's final at the China Open in Beijing .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}, {"articleID": "2011080423_00022779_W", "names": {"Trevor Booker": ["Q2429069", "Q7839072"]}, "date": "2011-08-04", "url": "http://sbnation.com/ncaa-football/2011/8/4/2345144/steve-spurrier-turner-gill-twitter-ban-south-carolina-kansas-players-season", "content": "sb nation ncaaf thu, aug 4, 2011 college football rankings 2011: oklahoma leads top 25, sec looks deep dirk nowitzki will make overseas decision after eurobasket; jordan farmar, <mark>trevor booker</mark> to israel updated throughout the day with quick takes from staff. steve spurrier, turner gill teaching personal responsibility by removing it altogether sean keeley? aug 4, 2011 6:56 pm edt it's the age-old argument college coaches have been having for centuries. should you allow your players to tweet freely on twitter or should you forbade them from ever doing so. on one hand, it's understandable that you might want to limit your high-profile student-athlete's interactions with the public, especially if they're going to tweet things like this. on the other hand, doesn't it make sense to sit down with your athletes, preach personal responsibility and show them a modicum of trust? consider syracuse's jim boeheim \"well, we have some dumb, immature players that put crap on their twitter, and we don't need that. so the best thing to do is just ban it .\" college football rankings 2011: oklahoma leads top 25, sec looks deep recent ncaaf posts on from our editors college football rankings 2011: the young perish and the old linger contact us? 2011 sportsblogs, inc. certain photos copyright? 2011 by associated press or getty images. any commercial use or distribution without the express written consent of associated press and getty images is strictly prohibited. scoreboard data copyright? 2011 by stats llc. any commercial use or distribution without the express written consent of stats llc is strictly prohibited. we've developed a unique newsletter that delivers the five most interesting sports stories fans are talking about, direct to your email three times a week. each email is curated by an sb nation editor who follows sports the way you do: as a fan. one email three times a week, with stories worth your time."}, {"articleID": "2010081121_00042072_W", "names": {"Danny Davis": ["Q5220272", "Q5220273"], "Alan Dixon": ["Q16093692", "Q1886056"], "Mike Quigley": ["Q3313500", "Q465767", "Q6848485"]}, "date": "2010-08-11", "url": "http://kwqc.com/Global/story.asp?S=12964620", "content": "associated press - august 11, 2010 4:54 pm et reactions to the death of former congressman dan rostenkowski of illinois: \"chicago was his heart and soul when it came to his...\"); var headline = escape (\"reactions to the death of dan rostenkowski\" ); openwin (' / global/create _ email_story. asp? s = 12964620 & headline =' + headline +' & summary =' + summary +' | | width = 650, height = 545, toolbar = no, scrollbars = 1, resizable = 1, status = 0') \"> associated press - august 11, 2010 4:54 pm et reactions to the death of former congressman dan rostenkowski of illinois:\" chicago was his heart and soul when it came to his political career. he spent his time as chairman of 1 of the most prestigious committees in washington, focusing on tax code for sure, but never forgetting where he came from. \"- u.s. sen. dick durbin of illinois .\" he truly helped not only chicago and illinois but all cities. and he was very, very effective. \"- chicago mayor richard m. daley .\" what he was really good at was working with both republicans, democrats and that's an art that has been lost. \"- former republican illinois gov. jim edgar .\" that was kind of the old way you did things. congress changed in a sense, and he didn't. that was probably his biggest weakness. \"- former house speaker dennis hastert, an illinois republican, on rostenkowski's misuse of office funds .\" he goes down in history as 1 of the powerful chairmen of the ways and means committee and, of course, the people of illinois remember him with tremendous fondness as a key element of the political landscape in our state. \"- u.s. rep. <mark>danny davis</mark> of chicago .\" it's fair to say that he deserves credit for helping the city of chicago grow to become the world class city it is today. \"- u.s. rep. bobby l. rush of chicago .\" he believed you had to accomplish something. he did not like politicians that just talked. \"- former secretary of commerce william daley .\" it was so sad what happened to him at the end, he was just a fine guy. he probably did more for illinois and for chicago in particular than any person that's ever represented the state. \"- former u.s. sen. <mark>alan dixon</mark> of illinois .\" chicago and the nation have lost a political giant. \"- u.s. rep. <mark>mike quigley</mark> of chicago .\" dan rostenkowski devoted his life to his community, chicago and the state. his accomplishments are many. his efforts on behalf of the regular people who needed a friend to wade through the tangle of government are unparalleled. \"- illinois house speaker michael madigan .\" he was a larger-than-life political figure whose legacy of accomplishments will outlive his years on this earth. \"- illinois senate president john j. cullerton"}, {"articleID": "2018103013_00054027_W", "names": {"Tommy Williams": ["Q1488293", "Q17143263", "Q7820010", "Q7820011"]}, "date": "2018-10-30", "url": "https://geektyrant.com/news/hawkeye-may-be-getting-a-series-for-disneys-streaming-platform-and-not-a-solo-film", "content": "Hawkeye May Be Getting His Own Series on Disney's Streaming Platform Rumor TV Movie Hawkeye Jeremy Renner Katherine Langford about 3 minutes ago by <mark>Tommy Williams</mark> Do you remember that report from several months ago that Hawkeye was going to get his own film? MCU Cosmic, the same source that gave us that rumor, is providing an update about that project. The update mentions that it is possible that instead of a film, the project may be a series for Disney's upcoming streaming service. It is also said that the project will \"involve Clint Barton's Hawkeye, but it will deal with him training a new younger archer .\" Many fans will know that most likely means they're bringing Kate Bishop into the universe, which would be pretty awesome. What's even cooler is that we may see Kate Bishop before then. The rumor mill has been trying to figure out who Katherine Langford will play in Avengers 4, and now fans think they have their answer: Kate Bishop. We know that Jeremy Renner will be Ronin in Avengers 4, but with the time traveling, who's to say that we don't see Kate show up? What are your thoughts? If Langford isn't Kate, who do you think she'll play and who should play Kate? <mark>Tommy Williams</mark> When I'm not writing for GameTyrant or GeekTyrant, I enjoy playing games and running my YouTube channel Poor Man Pedals for guitarists. For official inquiries, please email me: tommywilliams @ geektyrant.com | | @ tyguitaxe GeekTyrant Homepage Categories Art Comic Book GameTyrant Gear Humor Infographic Movie Music Tech Toy TV Original Podcast Rant Review Media Interview Photos Poster Trailer Videos Events Comic-Con D23 Expo E3 FantasyCon GT-X NYCC Star Wars Celebration Sundance WonderCon Alerts Rumor Spoiler Updated"}, {"articleID": "2018101903_00245139_W", "names": {"Mark Bradley": ["Q25190093", "Q3849450", "Q55111709", "Q56549811", "Q6766814", "Q6766815", "Q6766817"]}, "date": "2018-10-19", "url": "https://www.irishexaminer.com/breakingnews/sport/killyclogher-captain-emmet-mcfadden-theres-no-man-bigger-than-the-team-here-876741.html", "content": "Killyclogher captain Emmet McFadden: \"There's no man bigger than the team here' Friday, October 19, 2018 - 04:40 AM By Francis Mooney Killyclogher captain Emmet McFadden wears the number 15 on his back, but you won't see him taking on defenders and knocking over scores in Sunday's Tyrone SFC final against Coalisland. The Killyclogher team celebrate with the cup after the Tyrone County Senior Club Football Championship Final in 2016 McFadden is the embodiment of the modern game, a player with the footballing brain to master the sweeper brief and keep things tight and organised at the back. The 28-year-old has perfected the role through several seasons of sacrificing his own game and working for the greater good of the team. But he's hoping he will get to savour his moment of individual glory by climbing the steps of the Healy Park stand to take delivery of the O’Neill Cup this weekend. READ MORE: Condensed calendar fails to free up club championships\" My role is not as a scorer, \"he said .\" Of course you get forward an odd time, but trying to keep the scores to a minimum for the other team is my job. I'll just take it for the team. \"Both finalists have come through tight games on their way to this weekend's title decider, with Killyclogher dragging themselves back from the brink to deny Ardboe and win their semi-final in extra-time. We showed a lot of character in the last few minutes of that game. We knew we were never beaten until the final whistle. We were creating a few chances but the ball wasn't really sticking at times when we were going through. There were a few mistakes, but we always knew we were going to get the chance, and thank God we took it. Three points down in stoppage time with ace finisher <mark>Mark Bradley</mark> off the pitch, they had to look elsewhere for scores, and Conall McCann who rescued them with a dramatic goal .\" There's no man bigger than the team here. <mark>Mark</mark> has carried us with his talent, and it's great to have him but every player makes his own contribution. We have all dug in and got over the line. \"KEYWORDS"}, {"articleID": "2012030618_00047187_W", "names": {"Jacoby Jones": ["Q16730404", "Q3805829"]}, "date": "2012-02-26", "url": "http://wafb.com/story/17018608/lsu-baseball-suffers-first-loss-of-season-to-appalachian-state", "content": "baton rouge, la - appalachian state (3-2) put the only run on the board on a fourth-inning solo homer saturday and defeated no. 7 lsu (5-1), 1-0, during the second game of the three game series. the tigers took the first game 4-0 last night, and will look to win the series tomorrow. sophomore right-hander kurt mccune takes the hill for lsu in a 11 a.m. start at alex box stadium. appalachian state's ryan arrowood (1-0) frustrated the lsu offense and retired 20 of 21 batters during one stretch of the game. the righty went seven innings, struck out 10 and allowed two hits. reliever nathan hyatt pitched a scoreless eighth and ninth inning for the save, his second of the season. lsu's starter ryan eades (1-1) took the loss for the tigers despite an impressive performance of his own. the sophomore went 6.1 innings, allowed four hits, one earned run and punched out five. relievers chris cotton and nick goody combined to pitch the end of the seventh, the eighth and ninth innings and allowed one and struck out four. \"it's a particularly frustrating loss, because i thought we pitched very well today,\" said lsu coach paul mainieri. \"but, you've got to score runs, you can't keep putting goose eggs on the board. their starter really confused our hitters - all three of his pitches were working and he was able to throw his breaking pitches for strikes in any count .\" tyler hanover led lsu with two singles and a walk. casey yocom had the other hit for the tigers. the tigers threatened early in the bottom of the first. hanover drew a lea off walk and moved to second on yocom's single in front of the right fielder. raph rhymes grounded into a double play, which moved hanover to third. mason katz struck out to strand hanover at third. after katz's strike out, arrowood recorded five strikeouts in a row to contain the lsu offense through the first three innings. appalachian state put the only run on the board in the top of the fifth. after eades set down the first two batters, designated hitter daniel kassouf hit a first pitch two-out home run into the left field bleachers. tyler tewell stepped in and hit a single and moved to third on jeremy dowdy's hit up the middle. eades settled down and forced trey holmes to pop up at first to end the threat. appalachian state threatened to increase the lead in the top of the seventh. tewell drew a lead off walk against eades. dowdy popped out to right field and cotton replaced eades. tewell advanced to second on a balk. trey holmes's drive to center was fielded by chris sciambra and tewell moved to third. cotton struck out noah holmes swinging to end the threat. the mountaineers put a runner on third in the top of the eighth. crespo placed a perfect drag bunt and advanced to second and then third on back-to-back stolen bases. goody forced a ground out to end the threat and keep the tigers within one run. arrowood left the game prior to the eighth inning and gave way to closer nathan hyatt. he proceeded to strike out jackson slaid and ty ross, and forced jared foster to ground out to first. lsu put a runner in scoring position in the bottom of the ninth. hanover hit a one-out single under the second baseman's glove and arby fields entered the game as a pinch runner. yocom hit a hard grounder to third and fields was thrown out at second. <mark>jacoby jones</mark> pinch ran for yocom and reached second on a wild pitch, but hyatt struck out rhymes to end the game. \"we've got to put this behind us and move forward, because we've got an early start tomorrow,\" mainieri said. \"that's the nature of baseball; there's always the next day and the opportunity to play well and improve. we'll come back ready tomorrow to try to win this series .\" "}, {"articleID": "2018040521_00079677_W", "names": {"Evan Jenkins": ["Q5415437", "Q56597319"], "Sean Farrell": ["Q16744758", "Q7440985", "Q7440988"], "Shelley Moore Capito": ["Q459618", "Q47506415"], "Jerry Brown": ["Q152451", "Q717620"]}, "date": "2018-04-05", "url": "http://www.wacotrib.com/news/ap_nation/politics/the-latest-white-house-trump-referring-to-migrants-plight/article_77d65ea9-dc12-5b88-9dd4-bf9c9ad6fef6.html", "content": "The Latest: White House: Trump referring to migrants' plight Apr 5, 2018 President Donald Trump speaks during a roundtable discussion on tax policy Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump smiles during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., with from left, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, CEO of Davis Trust Company Hugh Hitchcock, assistant head teller at Davis Trust Company Ann Macomber, parts manager at Leslie Equipment Company Jon Lilly and his wife Elizabeth Lilly. (AP Photo/Evan Vucci) Evan Vucci US President Donald Trump told a crowd in West Virginia that the US and China will have a \"fantastic relationship\" in the long term. Trump also complained about trade with the European Union. (April 5) President Donald Trump smiles as people applaud him during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va.. From left, Principle Engineer at Service Pump and Supply <mark>Sean Farrell</mark>, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, Trump, CEO of Davis Trust Company Hugh Hitchcock, and Assistant Head Teller at Davis Trust Company Ann Macomber. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump smiles as people applaud him during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., from left, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, and CEO of Davis Trust Company Hugh Hitchcock. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump speaks during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump smiles during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., with from left, Service Pump and Supply principal engineer <mark>Sean Farrell</mark>, Rep. <mark>Evan Jenkins</mark>, R-W. Va., and West Virginia Attorney General Patrick Morrisey. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump waves during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., with from left, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, Trump, CEO of Davis Trust Company Hugh Hitchcock, and assistant head teller at Davis Trust Company Ann Macomber. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump responds to White House visitors as he makes his way to board Marine One on the South Lawn before departing the White House, Thursday, April 5, 2018 in Washington. Trump is traveling to West Virginia to hold a discussion on taxes in White Sulphur Springs, W. Va. (AP Photo/Manuel Balce Ceneta) Manuel Balce Ceneta Rep. <mark>Evan Jenkins</mark>, R-W. Va., left, and West Virginia Attorney General Patrick Morrisey, right, watch as President Donald Trump arrives for a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci West Virginia Attorney General Patrick Morrisey, right, listens as President Donald Trump speaks during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump gives a thumbs up during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump will be directing the departments of Defense and Homeland Security to deploy the National Guard to the southwest border. A former Border Patrol Chief, from El Paso says he sees the military's role as look-out post. (April 4) FILE - In this June 21, 2006, file photo, members of the California National Guard work next to the U.S.-Mexico border fence Wednesday, June 21, 2006, near the San Ysidro Port of Entry in San Diego. President Donald Trump said April 3, 2018, he wants to use the military to secure the U.S.-Mexico border until his promised border wall is built. The Department of Homeland Security and White House did not immediately respond to requests for comment. At the Pentagon, officials were struggling to answer questions about the plan, including rudimentary details on whether it would involve National Guard members, as similar programs in the past have done. But officials appeared to be considering a model similar to a 2006 operation in which former President George W. Bush deployed National Guard troops to the southern border in an effort to increase security and surveillance. (AP Photo/Denis Poroy, File) DENIS POROY President Donald Trump will be signing a proclamation directing the departments of Defense and Homeland Security to work together with governors to deploy the National Guard to the southwest border with Mexico. (April 4) WASHINGTON (AP)--The Latest on President Donald Trump (all times local): 4:55 p.m.. The White House says President Donald Trump was referring to the plight faced by migrants when he said those who make the journey to the U.S. from Mexico are \"raped at levels that nobody has ever seen before .\" Trump said Thursday at a tax event in West Virginia that \"yesterday it came out\" that during \"this journey coming up, women are raped at levels that nobody has ever seen before .\" Trump had previously mentioned a caravan of migrants working its way north through Mexico, so it appeared to some that he was suggesting the caravan was besieged by violence. But White House spokesman Hogan Gidley says it has been \"a widely reported fact for years\" that there is \"extensive and extreme victimization of those making the journey north with coyotes/smugglers in general .\" ------3:15 p.m. President Donald Trump is alleging without evidence that voter fraud is a huge problem in California. At a tax event in West Virginia on Thursday, Trump says that \"in many places, like California, the same person votes many times .\" He says, \"They always like to say,\" Oh, that's a conspiracy theory .' Not a conspiracy theory, folks. Millions and millions of people. \"After the 2016 election, Trump alleged repeatedly and without evidence that voting fraud cost him the popular vote. Earlier this year he disbanded a voter fraud commission amid infighting and lawsuits as state officials refused to cooperate. While there have been isolated cases of voter fraud in the U.S., past studies have found it to be rare .------3:10 p.m. President Donald Trump is seething over immigration policies at a tax event in West Virginia. Trump on Thursday complained about catch-and-release policies and family based migration, in which immigrants sponsor their relatives to join them in the U.S. Trump also noted he'd been criticized for saying in his campaign kickoff speech that Mexico was sending rapists across the border. But he says that\" yesterday it came out \"that during\" this journey coming up, women are raped at levels that nobody has ever seen before. \"It's unclear what he was referring to, but a White House spokesman pointed to past reports of women being raped by smugglers. Trump announced this week that he was requesting the deployment of the National Guard to the U.S.-Mexico border to fight illegal immigration and drug smuggling .------2:45 p.m. President Donald Trump is taking shots at Democratic Sen. Joe Manchin while visiting West Virginia. Speaking at a tax event Thursday, Trump referenced the fact that Manchin did not vote for his tax plan. He told the audience that they would get\" a chance to get a senator that's going to vote our program. \"He added that\" you're not getting that help right now. \"Trump says:\" Joe Manchin, he's really not helped us. \"Six Republicans are competing in a GOP primary to challenge Manchin, who is running for re-election. Trump easily carried the state in 2016 .------11:10 a.m. President Donald Trump plans to see two GOP Senate candidates during his visit to West Virginia. Trump is scheduled to hold a discussion on taxes in White Sulphur Springs later Thursday. Among those expected to attend are a congressman, <mark>Evan Jenkins</mark>, and the state's attorney general, Patrick Morrisey. They're among six Republicans competing in the May 8 for the party's Senate nomination. The incumbent is Democrat Joe Manchin, who is seeking another term in November. Trump, who overwhelmingly won West Virginia in the 2016 president election, has stayed neutral in the Senate primary so far .------10:50 a.m. President Donald Trump is ready to discuss his tax overhaul with business owners and families in West Virginia. The White House says Trump will hear from West Virginia companies that provided benefits to workers due to the tax law, as well as from families and elected officials. The companies include two community banks and a truck dealership. Republican officials expected to attend include the governor, Jim Justice, and Sen. <mark>Shelley Moore Capito</mark>. Trump signed the $1.5 trillion tax package into law in December. The Republican measure cut taxes on corporations and the wealthy, and gave more modest savings for many middle-class and lower-income Americans. The trip marks Trump's fourth visit to the state as president .------9:25 a.m.. The Trump administration hasn't determined how many troops it will seek to have deployed to the U.S.-Mexico border. That's according to Homeland Security Secretary Kirstjen Nielsen. She says:\" We're going to be sending as many troops as we need. \"President Donald Trump has signed a memo clearing the way for the deployment of National Guard troops to the border. Ultimately, it will be up to the four border-state governors to finalize the numbers and precise timing. Nielsen says the administration wants the National Guard's help providing surveillance along the border and maintenance for border patrol vehicles and aircraft to free up law enforcement assets for securing the border. Nielsen says she'll be speaking again Thursday with California Gov. <mark>Jerry Brown</mark> about earning his support for the deployment .------8:05 a.m. President Donald Trump is praising the Mexican government for breaking up a\" caravan \"of Central American migrants and avoiding\" a giant scene \"at the U.S. border. In a tweet, the president credits\" the strong immigration laws of Mexico and their willingness to use them. \"The tweet comes hours after Trump signed a proclamation directing the deployment of National Guard troops to assist in securing the U.S.-Mexico border. Trump has seized on news reports that the migrant group was traveling toward the U.S. Organizers of the migrant group said they never intended to reach the U.S. border. Trump adds that\" Border crossings are at a still UNACCEPTABLE 46 year low. \"------1:32 a.m. President Donald Trump has signed a proclamation directing the deployment of the National Guard to the U.S.-Mexico border to fight illegal immigration and drug smuggling. Homeland Security Secretary Kirstjen Nielsen says she's been working with governors of the southwest border states to develop agreements on where and how many Guardsmen will be deployed."}, {"articleID": "2010101914_00039516_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2010-10-19", "url": "http://shropshirestar.com/money/uk-money/2010/10/19/plea-to-keep-winter-fuel-allowance/", "content": "the chancellor has been urged not to abolish the winter fuel allowance or free eye tests for older people the government has been urged not to cut the winter fuel allowance for older people or end their right to a free eye test. six out of 10 people aged over 50 said they would be angry if the winter fuel allowance was abolished, while 63% said having a free eye test was important to them, according to a saga survey. around 56% of women aged over 50 also said they thought pensioners should still qualify for a free bus pass, with 47% of men also valuing this benefit. but older people were less attached to the pensioners' christmas bonus, with 75% saying they did not think it was important, while 66% said they did not think free television licences for older people were a key benefit. ros altmann, director-general of saga, said: \"both <mark>david cameron</mark> and nick clegg made pledges to protect older people's benefits during the general election .\" we expect them to protect the most vulnerable in society and also take account of the things that older people most value. \"the winter fuel allowance, free eye tests and bus passes are their line in the sand. once roused, older voters may not riot in the streets - but they do vote and they don't forget .\" keep updated with the latest breaking news and content on our twitter feed. latest dining reviews read the latest reviews by the shropshire star's dining out reviewers before you decide where to eat. all the film reviews before you plan a trip to the pictures, get our critics' verdicts on all the latest movie releases."}, {"articleID": "2012122609_00055005_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"], "Sushil Kumar": ["Q27924858", "Q378384", "Q47568673", "Q57041099", "Q57157332", "Q7648941", "Q7648943", "Q7648947"], "Kamal Nath": ["Q1287413", "Q57327046"], "Balbir Singh": ["Q17662963", "Q37376001"]}, "date": "2012-12-26", "url": "http://truthdive.com/2012/12/26/Gang-rape-horror-Panel-will-identify-lapses-if-any-says-Chidambaram.html", "content": "new delhi, dec 26 (ani): finance minister p. chidambaram on wednesday said that a commission, headed by retired justice usha mehra, will probe the delhi gang-rape case and submit its report in three months. \"the commission headed by former high court judge usha mehra will identify the lapses and may also come up with an interim report if necessary,\" chidambaram told mediapersons here. chidambaram said that the commission would fix responsibility in the case and look into any negligence on part of the delhi police. \"the commission has been also tasked to suggest measures on security and safety of women in the country, especially in the delhi-ncr region,\" said chidambaram. \"whatever we are doing now is only intended to demonstrate the government's serious intent in the matter-that we will apprehend and punish the perpetrators. we will try and find out what went wrong and fix responsibility. we will also amend the laws as deemed necessary,\" he added. emphasizing that the congress-led upa government was serious about ensuring the safety of women across india, chidambaram said: \"we are serious about finding lasting solutions to women's safety issue .\" chidambaram expressed sympathy with the gang-rape survivor's family on the centre's behalf. \"our prayers are with the family of the victim,\" he said. the finance minister also appealed to everyone to stay calm. \"we are trying to find a lasting solution to the problem,\" he added. the congress core group reviewed the situation in the national capital earlier on tuesday in the wake of protests over the gang-rape incident emphasising that police should deal with the matter with sensitivity while there should be no room for violence. the meeting that was held at prime minister dr. <mark>manmohan singh</mark>'s official 7, race course road (rcr) residence here was attended by congress president sonia gandhi, defence minister a.k. antony, p chidambaram and sonia gandhi's political secretary ahmed patel. union home minister <mark>sushil kumar</mark> shinde and parliamentary affairs minister <mark>kamal nath</mark> were present as special invitees in the meeting. previous post toyota eyes 9.9 mln global auto sales in 2013 box office collection: dabangg 2 collects 64.50 cr on first (opening) weekend ramesh: rohit bhai me apke sath hu ye sale sallu se jalte he?. srk se gand marva ke aye he ramesh: sale srk fan madarchod he sale? srk gay fans ho tum log?. rohit: saale danish aur sumit madarchod o. shahrukh teri bhi gand leta hai kya? salman se itni jo jalti hai na to...andy: u guys r stupid & dont hv any ability 2 judge one's credentials. danish: jthj worldwide collections in 6 days = 128cr this shows that taklu lallu (sallu) remake khan is still far behind...lone a g: plz. send me the detailed information box office first day collection: talaash vs ek tha tiger vs jab tak hai jaan jajithran: hi amirkhan is not 1weak hero. his record beat hero mind it. delhi gang rape: suzanna reddy does photo shoot to support victim <mark>balbir singh</mark> kandola: rape is some thing we are all ashamed of hearing it never mind being close to the victim. the ..."}, {"articleID": "2015120801_00340324_W", "names": {"Dan Smith": ["Q15906708", "Q16206931", "Q17579939", "Q5214397", "Q5214399", "Q5214400", "Q5214401", "Q5214402", "Q5214403", "Q5214404", "Q5214405", "Q5214407", "Q56404422", "Q9201145"]}, "date": "2015-12-08", "url": "http://www.aikenstandard.com/article/20151207/AIK0101/151209508/1002/AIK01/night-of-1000-lights-in-aiken-set-for-thursday", "content": "Night of 1,000 Lights in Aiken set for Thursday - Aiken Standard Night of 1,000 Lights in Aiken set for Thursday Email @ @ ChristinaNCleve Dec 7 2015 8:18 pm Aiken Standard File photo Luminaries light up downtown during a previous Night of 1,000 Lights. The event this year will be on Thursday. Thousands of lights will glow in downtown Aiken on Thursday for the annual Night of 1,000 Lights. Luminaries, weighed down by cans provided by Golden Harvest Food Bank, will line the streets and several shops will stay open later for downtown shoppers. Santa Claus and his elves will also be present at the event, which is hosted by the Aiken Downtown Development Association, or ADDA. \"It's just a fun, festive evening downtown,\" said Avery Spears-Mahoney, executive director of the ADDA. \"There's hundreds of people shopping and having dinner and it just kind of kicks off the season as far as the holiday shopping and enjoying all the downtown has to offer .\" Luminaries can be found along many of the streets downtown Thursday including The Alley, Laurens Street and Richland Avenue and participating shops will decorate their windows for a window decorating contest in between activities, Spears-Mahoney said. Gift wrapping will be set up outside, and area nonprofits are expected to offer sweets from cookies to hot chocolate and cider to patrons. The event runs from 6 to 8 p.m., though the shops stay open throughout the day and evening. <mark>Dan Smith</mark>, co-owner of Lionel Smith Ltd., is one of dozens of store owners who will extend their hours and said the men's clothing store participates each year. \"We have a lot of people walk in because it's beautiful downtown--a very\" Christmas-y,' old-town and nostalgic feeling, \"Smith said .\" Some people buy, not everyone purchases, some may come in later and buy (and) they generally use that night to come and look around. \"For those who are ready to purchase at the store Thursday, there will be an incentive .\" We do a Santa pick of the night and Santa will come through Wednesday night after we're closed and Thursday we'll have an item that might be discounted, \"Smith said .\" But we don't know what it is--Santa's elves do all of that work. \"3 Monkeys Fine Gifts will also offer special holiday deals, which were still in the works as of last week. Co-owner Kathy Reynolds said Night of 1,000 Lights is great for the community and business .\" It's a huge night for us, \"Reynolds said .\" It's a festive evening, brings out people from all over and it's always been well attended. It's a good night for us business-wise. We have great foot traffic and sales ....People of all ages are out on the street, and the entire downtown has a festive feel with the music and holiday activities. \"For more information on this year's Night of 1,000 Lights and participating businesses, visit www.downtownaiken.com or www.aikenismagical.com. Christina Cleveland is a general assignment reporter. Follow her on Twitter @ ChristinaNCleve. Keywords"}]