[{"date": "2014-10-08", "url": "http://www.brisbanetimes.com.au/entertainment/movies/new-teresa-palmer-thriller-screen-music-nominees-and-early-oscar-buzz-short-cuts-column-20141008-10rjr5.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Teresa Palmer. Photo: Hugh Hamilton Teresa Palmer thriller lined up for a Sydney shoot While there was no word on funding for the Hollywood movie that has brought Robert Redford to Sydney - he is playing newcaster Dan Rather in James Vanderbilt's drama Truth opposite Cate Blanchett and Elisabeth Moss - the NSW government has backed another film with Hollywood connections. Former Fox Filmed Entertainment executive Bill Mechanic, who produced the Pierce Brosnan-William Hurt historical fantasy The Moon and The Sun in Melbourne earlier this year, is part of the high-profile team behind <mark>Paul Currie</mark>'s thriller 2.22. Due to start filming at Fox Studios in January, it centres on an air traffic controller who finds himself returning to New York's Grand Central Station at 2.22 pm every day - an event that threatens the life of the woman he loves. While the male lead is still to be confirmed, Teresa Palmer will star in the film once she finishes shooting the Nicholas Sparks romance The Choice. With Screen Australia backing 2.22 in August, the state government has now put up $600,000 for an expected spend of $8.1 million in NSW. Arts Minister Troy Grant describes it as \"a great example of how our entrepreneurial filmmakers are working on the world stage and partnering with international producers\". Hirschfelder has two shots at winning best feature film score Colin Firth in The Railway Man. Composer David Hirschfelder has been a regular award winner over the years for his scores for the likes of Shine, Elizabeth and Better Than Sex. And as he works on Russell Crowe's The Water Diviner, he has claimed two of the four nominations for best feature film score at the Screen Music Awards to be held next month. Nominated for The Railway Man and Healing, Hirschfelder is up against <mark>Christopher Gordon</mark> for Adoration and <mark>Christopher</mark> de Groot for the little-known thriller Sororal. But two other composers have done even better with six nominations each - Antony Partos, whose work includes Redfern Now, Rake and Fallout, and Cezary Skubiszewski, whose work includes Once My Mother, The Broken Shore and Serangoon Road. Held by the Australian Guild of Screen Composers with the Australasian Performing Right Association and the Australasian Copyright Owners Society, the awards will be held at Sydney's City Recital Hall on November 12. Advertisement Early Oscar buzz has only one Australian actor in contention With Charlie's Country selected as Australia's entry for the foreign-language category, the Oscars are back in the news. And it looks like the near certainty that at least one Australian actor will be nominated might not eventuate next year. In the 16 years since Geoffrey Rush won best actor for Shine, the country's actors have only missed out twice, with a remarkable 23 nominations for five wins. While there are still three months before the nominations are announced, The Hollywood Reporter has framed a list of the leading contenders. With no mention of Cate Blanchett, Nicole Kidman, Geoffrey Rush, Russell Crowe, Hugh Jackman and other leading lights, only one Australian actor features - Mia Wasikowska is considered a long-shot for a best actress nomination for Tracks. For best actor, the only (tenuous) Australian connection is <mark>Jack O'Connell</mark> as a frontrunner for Unbroken, which was shot here. Two Australian editors who were both nominated five years ago are deep in the running again - two-time winner Kirk Baxter for Gone Girl and <mark>Lee Smith</mark> for Interstellar. And, deservedly, the Sydney-shot The Lego Movie is one of the favourites for best animated feature. Mia Wasikowksa in Tracks. Gone Girl arrives with a flourish at the box office On the back of strong reviews and the the popularity of the bestselling novel, Gone Girl zoomed to the top of the Australian box office on the weekend. Director David Fincher's follow-up to The Social Network and The Girl With The Dragon Tattoo took $4.7 million with a strong average of $11,700 per cinema. In a country where horror films often perform modestly, Annabelle also opened well with $1.9 million for an average of $11,500 per cinema. A prequel to The Conjuring, it continues an impressive run with low-budget horror for prolific Australian filmmaker James Wan, who broke through with Saw a decade ago. Wan was one of the producers of Annabelle after directing last year's hits The Conjuring and Insidious: Chapter 2. He has Fast & Furious 7 out next April. Social media popularity leads to surprising results at the US box office Ben Affleck in Gone Girl. The importance of social media in film marketing was shown at the US box office at the weekend, when Gone Girl and Annabelle surprisingly outperformed box office projections - both taking more than $US37 million at the top of the charts. According to Deadline Hollywood, tracking showed that Annabelle's trailers and promotional videos had 16.2 million YouTube views and the movie had 2.4 million Facebook posts and 2.8 million Tweets. More popular on older-skewing social media, Gone Girl had 9.2 million YouTube views, 30.1 million Facebook posts and 18.7 million Tweets. While Short Cuts will always encourage newspaper advertising, the value of a powerful trailer and promotional clips as part of a social media campaign has become increasingly important to a movie's release. Playwright live tweets film shoot Speaking of which, playwright <mark>Tommy Murphy</mark> boosted the social media presence of the film adaptation of his play Holding The Man by live tweeting from the Sydney set this week. He posted a series of photos of the crew, including director Neil Armfield (Neil Armfield on the set of Holding The Man. Photo: Photo: <mark>Tommy Murphy</mark> Academy in best financial position in years after new sponsor With a new two-year sponsorship deal with Hyundai and another new sponsor to be announced soon, chief executive Damian Trewhella says the Australian Academy of Cinema and Television Arts is in its best financial position for a long time as its award judging screenings get under way. The deal will see the car company present Social Shorts, which Trewhella describes as a chance for \"emerging filmmakers to have their work seen, shared and acknowledged by film enthusists and industry\" through a web site linked to social media voting. The academy does not having a naming rights partner for the awards but isn't chasing one either. Instead, Trewhella says it's looking for a presenting rights partner. \"We'd like to keep the AACTA Awards clean but\" the AACTA Awards presented by X or Y' is a really great opportunity now that these strong mid-tier building blocks are put in place. \"Free concert of film scores to launch Melbourne Symphony Orchestra season 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? Morrissey fans in shock over his cancer revelation:\" If I die, I die' 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? The Bachelor's sham proposal: Why is Network Ten not the villain? 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse", "articleID": "2014100813_00042309_W", "names": {"Jack O'Connell": ["Q16028203", "Q16184113", "Q16733588", "Q16733590", "Q22680912", "Q348066", "Q43379437", "Q6114376", "Q6114380"], "Lee Smith": ["Q1078252", "Q13563113", "Q1811998", "Q3228933", "Q3829387", "Q6515097"], "Paul Currie": ["Q7150070", "Q7150071"], "Stephen Collins": ["Q2346903", "Q42715096", "Q435434", "Q7608927", "Q7608929"], "Tommy Murphy": ["Q22979519", "Q7819726", "Q7819734"]}}, {"date": "2014-10-08", "url": "http://www.tracking-board.com/stephen-twitch-boss-dances-into-magic-mike-xxl/", "content": "by: Donna Whitehead <mark>Stephen \"tWitch\" Boss</mark> will appear in director <mark>Greg Jacobs</mark> MAGIC MIKE XXL. The sequel to Steven Soderbergh's male stripper movie <mark>\"</mark> Magic Mike <mark>\"</mark> catches up with Mike and his friends as they head out on a road trip to a stripper convention. Specific details of <mark>Boss</mark>' character aren't known, but he is playing a stripper. The film stars Channing Tatum (who also co-wrote the script with Reid Carolin), Matt Bomer, Joe Manganiello, Amber Heard, Jada Pinkett Smith, Donald Glover, and <mark>Elizabeth Banks</mark>. <mark>Boss</mark> broke out after starring in the dance movie <mark>\"</mark> Step Up 3D <mark>\"</mark> and subsequent sequels <mark>\"</mark> Step Up Revolution <mark>\"</mark> and <mark>\"</mark> Step Up All In. <mark>\"</mark> He's also appeared on episodes of <mark>\"</mark> Drop Dead Diva <mark>\"</mark> and <mark>\"</mark> Bones. <mark>\"</mark> But <mark>\"</mark> So You Think You Can Dance <mark>\"</mark> fans remember him from his beginnings as a contestant on - and ultimately second-place winner of - the show's fourth season. He has since remained involved with <mark>\"</mark> So You Think You Can Dance, <mark>\"</mark> appearing as an All-Star partner to new contestants. <mark>Boss</mark> is repped by Global Artists Agency and A-Team Entertainment. - TO SEE ALL THE PROJECT DETAILS CLICK HERE - Share This 0 1 0 0 0", "articleID": "2014100819_00070757_W", "names": {"Elizabeth Banks": ["Q219373", "Q47295776"], "Greg Jacobs": ["Q15812791", "Q20657044"], "Stephen \" Twitch \" Boss": ["Q17711905", "Q21284625"]}}, {"date": "2014-10-08", "url": "http://independent.co.uk/news/business/news/rate-fears-put-damper-on-housing-says-halifax-9783563.html", "content": "Fears of a rate rise will scare off would-be homebuyers for the rest of the year despite a surprise September spike in house prices, according to the lender Halifax. The cost of the average home rose 0.6 per cent over the month although longer-term barometers - the average quarterly and annual rate of growth - both showed signs of a cooling market. Halifax's housing economist, <mark>Martin Ellis</mark>, said yesterday: \"The recent rapid rise in house prices in some parts of the UK, earnings growth that remains below consumer price inflation and the possibility of an interest rate rise over the coming months appear to have tempered housing demand .\" The figures contrast with those from Nationwide, which reported the first monthly drop in prices for more than a year in September, although the Bank of England has also revealed falling mortgage approvals. life Vaginal orgasms are a myth, claim researchers Some of the ads that have fallen foul of the regulatory watchdog San Marino fly in for a good day out...and the usual thrashing Is smoking marijuana dangerous? A review of research over the last 20 years says it is Life after death? Largest-ever study provides evidence that \"out of body' and\" near-death' experiences may be real Dear young men: The old stereotypes of what it is to be a \"man' are a load of rubbish Naomi Wolf reacts to Isis\" conspiracy theories' critism after she questions whether beheading videos are real NBA 2K15: Face scan an early issue with US release of basketball game Australian newspaper's \"shemale' headline about murder victim Mayang Prasetyo sparks outrage Jennifer Lawrence nude photos: Actress's Wikipedia page\" hacked' with explicit images Life after death? Largest-ever study provides evidence that \"out of body' and\" near-death' experiences may be real Blood Moon live: Watch total lunar eclipse with Nasa and Slooh webcasts i100: A single mother on benefits who became one of the world's most successful authors £ 30000 per annum + pension, 22 days holiday: Ashdown Group: A growing industry...£ 27000 per annum + pension, 22 days holiday: Ashdown Group: An established ind.. . £ 23 per hour: Ashdown Group: A growing industry leading professional services...£ 30000 per annum + pension, 22 days holiday: Ashdown Group: A growing industry...What it's like to be struck by lightning (and survive) Can teenagers perform better at school after a midweek lie-in? Pupils to be given an hour more in bed to see if their exam results can be improved upon Nancy's cockiness is well-founded as the \"Queen of Consistency' is crowned champion IBM's new super-computer has been hailed as the future of healthcare...... and it can devise a recipe for a mean stew Gear up for darker evenings and illuminate your bicycle with the best kit to keep you well-lit this autumn It is ludicrous they are given a free pass to play in a game that is supposed to represent the elite of the sport Bayern's signing of Alonso was a masterstroke - but passing on a trade to secure Fabregas haunts Arsenal On returning to the Durham pit village where she grew up, Anne McElvoy finds that the miners' strike is still a part of everyone's story The seminal, surreal Nineties hit series is being rebooted by <mark>David Lynch</mark>. But will today's audiences still find it a damn fine blend? What's a distinguished, old publishing house like Faber doing hosting gigs in its own pop-up shop? The actress on the hell of playing the hardest role in American musical theatre Geoffrey Macnab on the challenge of reviewing\" Gone Girl' when half of you know the twists, and the rest don't want to", "articleID": "2014100900_00016084_W", "names": {"David Lynch": ["Q1175355", "Q2071", "Q5236852"], "Martin Ellis": ["Q16207745", "Q55465471", "Q59593254", "Q6775385"]}}]