[{"articleID": "2017070700_00583351_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-07-06", "url": "http://feeds.nydailynews.com/~r/nydnrss/sports/hockey/islanders/~3/m5Iu8IE8GGs/tough-north-korea-choices-regime-arm-article-1.3306797", "content": "Across 25 years and five administrations, we have kicked the North Korean can down the road. We are now out of road. On July 4, North Korea tested an intercontinental ballistic missile apparently capable of hitting the United States. As yet, only Alaska. Soon, every American city. Moreover, Pyongyang claims to have already fitted miniaturized nuclear warheads on intermediate range missiles. Soon, on ICBMs. Secretary of State Rex Tillerson's initial reaction to this game-changer was not encouraging. \"Global action is required to stop a global threat,\" he declared. This, in diplo-speak, is a cry for (multilateral) help. Alas, there will be none. Because, while this is indeed a global threat, there is no such thing as global interests. There are individual national interests and they diverge. In this case, radically. Take Russia and China. If there's to be external pressure on North Korea, it would come from them. Will it? On Tuesday, they issued a joint statement proposing a deal: North Korea freezes nuclear and missile testing in return for America abandoning large-scale joint exercises with South Korea. This is a non-starter. The exercises have been the backbone of the U.S.-South Korea alliance for half a century. Abandonment would signal the end of an enduring relationship that stabilizes the region and guarantees South Korean independence. In exchange for what? A testing freeze? The offer doesn't even pretend to dismantle North Korea's nuclear program, which has to be our minimal objective. Moreover, we've negotiated multiple freezes over the years with Pyongyang. It has violated every one. That Russia and China would, amid a burning crisis, propose such a dead-on-arrival proposal shows that their real interest is not denuclearization. It is cutting America down to size by breaking our South Korean alliance and weakening our influence in the Pacific Rim. These are going to be our partners in solving the crisis? And yet, relying on China's good graces appeared to be <mark>Donald Trump</mark>'s first resort. Until he declared two weeks ago (by tweet, of course) that China had failed. \"At least I know China tried!\" he added. They did? <mark>Trump</mark> himself tweeted out on Wednesday that Chinese trade with North Korea increased by almost 40% in the first quarter, forcing him to acknowledge that the Chinese haven't been helping. Indeed not. The latest North Korean missile is menacing not just because of its 4,000-mile range, but because it is mobile. And the transporter comes from China. In the calculus of nuclear deterrence, mobility guarantees inviolability. (The enemy cannot find, and therefore cannot pre-empt, a mobile missile .) It's a huge step forward for Pyongyang. Supplied by Beijing. How many times must we be taught that Beijing does not share our view of denuclearizing North Korea? It prefers a divided peninsula, sustaining its client state as a guarantee against a unified Korea allied with the West and sitting on its border. Nukes assure regime survival. That's why the Kims have so single-mindedly pursued them. The lessons are clear. Saddam Hussein, no nukes: hanged. Moammar Khadafy, gave up his nuclear program: killed by his own people. The Kim dynasty, possessing an arsenal of 10 to 16 bombs: untouched, soon untouchable. What are our choices? <mark>Trump</mark> has threatened that if China doesn't help we'll have to go it alone. If so, the choice is binary: acquiescence or war. War is almost unthinkable, given the proximity of the Demilitarized Zone to the 10 million people of Seoul. A mere conventional war would be devastating. And could rapidly go nuclear. Acquiescence is not unthinkable. After all, we did it when China went nuclear under Mao Zedong, whose regime promptly went insane under the Cultural Revolution. The hope for a third alternative, getting China to do the dirty work, is mostly wishful thinking. There's talk of sanctioning other Chinese banks. Will that really change China's strategic thinking? Bourgeois democracies believe that economics supersedes geostrategy. Maybe for us. But for dictatorships? Rarely. If we want to decisively alter the strategic balance, we could return U.S. tactical nukes (withdrawn in 1991) to South Korea. Or we could encourage Japan to build a nuclear deterrent of its own. Nothing would get more quick attention from the Chinese. They would face a radically new strategic dilemma: Is preserving North Korea worth a nuclear Japan? We do have powerful alternatives. But each is dangerous and highly unpredictable. Which is why the most likely ultimate outcome, by far, is acquiescence. letters @ charleskrauthammer.com Send a Letter to the Editor Join the Conversation: facebook Tweet"}, {"articleID": "2013082508_00011906_W", "names": {"Johnnie Walker": ["Q466525", "Q6266126", "Q939019"], "David Lynn": ["Q1175360", "Q28155105", "Q5236858", "Q58003126"]}, "date": "2013-08-25", "url": "http://www.sportingnews.com/nfl/story/2013-08-24/pga-tour-gary-woodland-matt-kuchar-tied-for-lead-at-barclays", "content": "JERSEY CITY, N.J. - Matt Kuchar and Gary Woodland began their week at The Barclays by going to Citi Field and getting a tour of the clubhouse, where Kuchar noticed an indoor batting cage and asked if they could try it out. He stood behind the net and threw to Woodland, a promising baseball player in high school. \"Gary hit and was really impressive,\" Kuchar said. \"I didn't hit and didn't show anything differently, but Gary was impressive swinging a baseball bat .\" Gary Woodland heads down the course toward a share of the lead. (AP Photo) Woodland isn't too bad with a golf club in his hands, either. Playing with Kuchar in the final group, Woodland ran off four straight birdies Saturday afternoon with another powerful display of his athleticism and shot a 3-under 68, giving him a share of the lead with Kuchar going into the final round at Liberty National. Leaderboard: Tiger in the hunt | Europe: <mark>Johnnie Walker</mark> | Champions Tour | \"Man, that guy can play some golf,\" Kuchar said, knowing that Woodland was within earshot. Kuchar, who played bogey-free on the back nine in blustery conditions for a 70, remains more polished. He already has two wins this year, at the Match Play Championship and Memorial, and he is a past champion at The Barclays. For much of the day they were trading birdies - along with a few bad breaks - and wound up tied at 12-under 201. Kuchar's from off the green on the reachable par-4 16th was stopped by a sprinkler, while Woodland putted his to close range for birdie. Woodland gave back the stroke on the next hole with a drive that plugged into the far end of the bunker, forcing him to blast it out sideways and costing him a bogey. They are close friends and former World Cup partners. But the final round at Liberty National doesn't belong to only them. Kevin Chappell broke the tournament course record with a 62 - 10 shots better than the average score on Saturday - and was one shot behind. \"In the wind, if you would have told me someone was going to shoot 62 today, I would probably have laughed at you,\" Chappell said. And very much in the mix was Tiger Woods, bad back and all. Woods was just hanging around for so much of the day, gingerly bending over to put his ball on a tee and retrieve it out of the cup. His fortunes turned with two strong shots on the par-5 13th led to birdie, he drove the 16th green for another birdie and finished with a 10-foot birdie putt and a 69. Woods was four shots behind, along with <mark>David Lynn</mark>, who also had a 69. \"It starts off great every day, and then it progressively deteriorates as the day goes on,\" Woods said of his lower back, which he hurt from what he said was a soft bed in his hotel room. \"Hopefully, tomorrow it will be one of those days again. Fight through it and see if I can win a tournament .\" The large group at 7-under 206 included 20-year-old Jordan Spieth, Bubba Watson, Jim Furyk, Justin Rose and Rickie Fowler. Chappell's round was evidence that even in windy conditions, low scores are available. For the former UCLA Bruin, it was really was simple as making putts, most of them in that 10-foot to 15-foot range. There were a few par saves on the back nine, and six birdies on the front. \"I just really holed all the putts that you kind of expect to hold but you don't always hole,\" he said. Kuchar and Woodland will be in the final group for the second straight day, and they certainly aren't strangers. Kuchar represented the Americans in the World Cup two years ago in China. After scouting the Mission Hills course and seeing it was long, he picked Woodland as his partner. The Americans wound up winning their first World Cup title in over a decade. Woodland is regarded as one of the best athletes on tour - a promising baseball player in high school who first went to a Division II school to play basketball and then transferred to Kansas to play golf. But he has disappeared since winning at Innisbrook two years ago, mainly from injuries to both wrists. He began working with Claude Harmon III in the spring, and he hired mental coach Julie Elion right before his season turned around by winning the Reno-Tahoe Open earlier this month. \"I've really let my game take over,\" Woodland said. He surged into the lead during a four-hole stretch to close out the back nine - a 5-iron into the par-5 sixth, a sand wedge to 10 feet for birdie on No. 7, a 4-wood for his second shot on the par-5 eighth for birdie, and a 6-iron for a fourth straight birdie on the ninth. Even on the 16th hole, which played 289 yards, Woodland has so much power than he went with a 2-iron and came up just short. Kuchar caught up by playing bogey-free on the back nine with three birdies, starting with a superb shot on the 10th to 3 feet. DIVOTS: Rory McIlroy had an even-par 71 and was six shots out of the lead ....Aaron Baddeley shot 66, and at No. 119 in the FedEx Cup standings, stands a good chance of being among the top 100 players to advance to the second playoff event next week outside Boston ....Greg Chalmers made a hole-in-one on the 135-yard 14th, with the Statue of Liberty in view to the right. In the next group, K.J. Choi almost made an ace ....<mark>Lynn</mark> was squatting to read the line of his putt on the 10th green when he toppled backward and landed on his seat. Looking over, he made a motion that he had been drinking, and the gallery ate it up ....Chappell has gone 25 consecutive holes without a bogey."}, {"articleID": "2015011314_00027857_W", "names": {"Ian Taylor": ["Q11154675", "Q1438500", "Q14943179", "Q20877307", "Q23409808", "Q28094325", "Q57062399", "Q5983044", "Q5983046", "Q5983056"], "Nathan Smith": ["Q18088901", "Q1966636", "Q1966650", "Q24005445", "Q24663895", "Q27448076", "Q30123019", "Q6969340", "Q6969341", "Q6969342"], "Chris Robertson": ["Q48743619", "Q5107891", "Q5107892", "Q5107893", "Q5107895"]}, "date": "2015-01-13", "url": "http://www.stokesentinel.co.uk/Video-Port-Vale-face-Stoke-City-cup-final-Potters/story-25847097-detail/story.html", "content": "Video: Port Vale could face Stoke City in cup final as Potters aim for revenge MikeBaggaley | Posted: January 13, 2015 Stoke's Carl Beeston and Vale's <mark>Ian Taylor</mark> tussle in the heat of Potteries derby action Comments (0) STOKE City could have the chance to avenge last month's defeat to Port Vale after the Staffordshire Senior Cup draw set up the possibility of a Potteries derby final. The Potters were beaten 3-0 by the Valiants in a reserve game in training pitches to protect the main pitch before Vale's lucrative Boxing Day game at home to Sheffield United. But even so, the game, which kicked off on 1pm on a Wednesday afternoon, attracted a crowd of around 250 to watch on the grass bank above the training pitch at the back of the Bycars Stand. A re-match will happen if both clubs can come through away matches in the cup semi-finals. Stoke are away to Stafford Rangers or Walsall Wood. Neither will take their semi-final ties for granted, but after his Stoke youngsters were well beaten by Vale a month ago, City's coach Glyn Hodges made clear he would like the chance for another derby game. He said: \"It was a good test. Port Vale are a bit stronger and more experienced than us, but we will gain more out of the game. Although it is a defeat, the experience is good for us .\" We like the derbies and have taken these games on because we know we are going to play experienced players as opposed to the academy football in the under-21s league. \"Meanwhile, Vale expect to extend defender <mark>Nathan Smith</mark>'s loan to Stafford this week in a deal which could see the 18 year old move until the end of the season. The Valiants have been impressed with <mark>Smith</mark>'s progress and are keen to give the centre-half, from Madeley, more matches in the Evo-Stik Division One South. A measure of <mark>Smith</mark>'s progress is that Vale will look to insert a clause in the deal that mean he could be recalled to Vale Park. At the moment he is behind a list of more experienced central defenders at Vale which includes Richard Duffy, Freddie Veseli and <mark>Chris Robertson</mark>. However, manager, who watched <mark>Smith</mark> in action for Stafford last week, says the Vale youth graduate is improving fast thanks to playing in adult football with Stafford. He said:\" We have to try to make sure that, if we have injuries here, we can get <mark>Nathan</mark> back. He is becoming a strong character and is learning a lot coming up against stronger players than play in the reserves. \"I have really enjoyed working with <mark>Nathan</mark> because he has such a good character and determination. Stoke City: Perhaps Liverpool should send a cheque this way for...Video: Port Vale could face Stoke City in cup final as Potters...Stoke City: Potters ready to make loan bid for Man City star Edin...Arsenal 3, Stoke City 0 match report: Outclassed Potters lick...Weather warning: Snow expected to hit the region as temperatures plunge Stoke City: Potters ready to make loan bid for Man City star Edin Dzeko Looking to Buy or Let in Stoke-on-Trent and Newcastle under Lyme? Lettings and estate...Lister Trade Frames Welcome to Lister Trade Frames in Stoke We've been established since 1976 and if you're a.. ."}, {"articleID": "2019052704_00058321_W", "names": {"Imran Khan": ["Q155164", "Q15987686", "Q1660487", "Q17306146", "Q18351186", "Q18619306", "Q18637473", "Q18637525", "Q18637527", "Q18649030", "Q18687912", "Q18687913", "Q18687915", "Q18687916", "Q21061850", "Q27951129", "Q312781", "Q42560214", "Q43384689", "Q50064378", "Q51161844", "Q57064458", "Q59198528", "Q6008185", "Q6008187"]}, "date": "2019-05-27", "url": "https://www.prokerala.com/news/articles/a919502.html", "content": "Islamabad, May 27: Visiting Chinese Vice President Wang Qishan said the the China-Pakistan Economic Corridor (CPEC) was rapidly expanding onto other sectors, while expressed the resolve that the two allies would continue to safeguard each other's interests. On the first day of his three-day trip to Pakistan, Wang on Sunday inaugurated a number of projects along with Prime Minister <mark>Imran Khan</mark> and the two leaders witnessed signing of several agreements, reports Dawn news. Soon after his arrival at Chaklala airbase, Wang spoke at a meeting of \"Friends of Silk Road\" hosted by the Pakistan-China Institute. Sharing his assessment of the progress on the CPEC and the recently launched second phase, the Chinese Vice President said: \"CPEC has come a long way over the past five years...CPEC is rapidly extending to new priority areas including industrial parks and livelihoods .\" CPEC will produce new outcomes and lend new impetus to economic and social development of Pakistan and economic integration of the region. \"CPEC is a consensus that transcends political parties, regions and communities across Pakistan. It also enjoys the most extensive and strongest support in China .\" Recalling Pakistan's support for China at \"critical moments\" , Wang said Beijing too had always supported Islamabad on its \"core interests\". \"No matter how the international landscape changes, China and Pakistan will always stay iron brothers that trust and support each other,\" he told the gathering. Later on Sunday, President Arif Alvi conferred the Nishan-e-Pakistan, the highest civil award of the country, on Vice President Wang to recognise his services in promoting Pakistan-China ties."}, {"articleID": "2011111417_00041153_W", "names": {"Matt Carter": ["Q55375208", "Q59392746", "Q6788455", "Q6788457", "Q6788458"]}, "date": "2011-11-14", "url": "http://fiercewireless.com/story/sprint-wants-increase-wholesale-customers-10/2011-11-14?utm_medium=rss&utm_source=rss", "content": "most powerful people in wireless 8 stars in mobile apps ones to watch ctia to appeal judge's ruling on san francisco cell phone radiation ordinance 22. charlie ergen, chairman, dish network - most powerful people in wireless 5. dan hesse, ceo, sprint nextel - most powerful people in wireless 21. dick costolo, ceo, twitter - most powerful people in wireless 10. j.k. shin, president, samsung mobile communications - most powerful people in wireless february 28, 2012 - fira de barcelona nyse: s) plans to increase the number of wholesale customers by 10 percent over the next year, a senior executive said. in an interview with bloomberg, <mark>matt carter</mark>, president of sprint wholesale solutions and new ventures, said the company is accelerating its push into the wholesale business and is providing more services to its wholesale customers. sprint currently has around more than 100 wholesale customers, representing 6.3 million subscribers. sprint's total customer base is 53 million. the focus on wholesale, in addition to sprint's emphasis on its prepaid brands such as assurance wireless, indicate that the carrier increases is looking beyond postpaid subscribers to grow its business. <mark>carter</mark> said sprint is offering its wholesale customers services such as billing, marketing support and competitive analysis, rather than just selling them capacity. \"we are kind of a factory that produces these capabilities,\" he said. some of sprint's most high-profile wholesale customers include leap wireless (nasdaq: leap) and best buy, as well as smaller players such as credo mobile, liberty wireless and platinumtel. wholesale has become an increasingly critical part of sprint's business. sprint added a net of 835,000 wholesale and affiliate subscribers in the third quarter, nearly double the 441,000 retail subscribers it added. that was a stark reversal from the third quarter last year when wholesale additions trailed sprint's branded customers. sprint said in august it would start wholesaling clearwire's (nasdaq: clwr) mobile wimax network to other companies, one of the results of a revised wholesale agreement the two companies inked in april. <mark>carter</mark> said sprint is marketing its wholesale capabilities to a variety of companies, including retailers and international carriers. interestingly, <mark>carter</mark> said customers of an unnamed chinese carrier can get sprint's handsets and service under the chinese company's brand when they stay in the united states for prolonged periods of time. donald tan, president of china telecom americas, told"}, {"articleID": "2015102713_00035342_W", "names": {"M Singh": ["Q57321613", "Q57413863"], "Ajit Singh": ["Q1172625", "Q44751749", "Q4699804", "Q4699805", "Q57905434", "Q57986365", "Q58429220"]}, "date": "2015-10-27", "url": "http://www.newindianexpress.com/nation/Eying-Assembly-Polls-Maneka-Kin-V-M-Singh-Announces-New-Party/2015/10/27/article3100224.ece", "content": "Email 1 LUCKNOW: Eying the 2017 Uttar Pradesh assembly polls, farmer leader V <mark>M Singh</mark> today announced that he would launch a new party on December 23, the 113th birth anniversary of former prime minister Chaudhary Charan <mark>Singh</mark>. \"The new organization has nothing to do with votes. It is for empowering farmers, who have been going through difficult times,\" he told PTI. <mark>Singh</mark>, a former MLA who has unsuccessfully contested Lok Sabha elections on several occasions, hoped that the new outfit named Kisan party will help farmers rise above caste and religion barriers. \"It will be a farmer-oriented party. It will not only help farmers but also farm labourers improve their condition .\" In an agrarian society where 70 per cent of people are from rural background, there is not a single party which is working for the upliftment of farmers. It will be the only party in which farmers will be supreme, \"he said. <mark>Singh</mark> said the farmers' plight prompted him to return to active politics .\" While SP supremo Mulayam <mark>Singh</mark> claims himself to be the dharti putra (son of the soil) and RLD chief <mark>Ajit Singh</mark> says he represents the legacy of Charan <mark>Singh</mark>, the farmers' plight is becoming bad to worse and they are committing suicide at the drop of a hat, \"he said. Asked about BJP MP Maneka Gandhi, who is related to him, <mark>Singh</mark> said,\" There can be no similarity between us. She protects animals while I hope to empower farmers. \""}, {"articleID": "2014101223_00030387_W", "names": {"Luis Enrique": ["Q222789", "Q322350"]}, "date": "2014-10-12", "url": "http://www.goal.com/en-india/news/138/spain/2014/10/13/5179222/pique-i-had-pain-killing-injections-to-play-through-injury", "content": "The Bacelona defender has cleared up confusion following his appearance for Barcelona 48 hours after leaving the Spain squad through injury last month Gerard Pique admits he had pain-killing injections in order to play through injury. The 27-year-old caused some confusion last month after he appeared for Barca in a Liga match against Villarreal just two days after pulling out of the Spain squad for the games against France and Macedonia. He returned to the national team this week to play the full 90 minutes of Spain's defeat to Slovakia on Thursday and Sunday's 4-0 victory over Luxemburg but says that while his injury is improving, he is still suffering some minor discomfort. \"It's true that I had hip problems, and that is what I let Del Bosque know,\" he told AS. \"In fact, although I play with discomfort I am already much better. What happened was that <mark>Luis Enrique</mark>, who also knew about my situation, felt I was needed by the team to play against Villarreal .\" But I was being treated by the doctors, who prescribed me [the pain-killer] Voltaren, and during the international break I had to receive injections. \"Pique added that his surprise inclusion against Villarreal was simply down to differing opinions between his club and country coaches .\" They both knew how I was and what happened to my hip \", he said .\" [Spain coach Vicente] Del Bosque thought it was best to give me a rest and [Barcelona coach] <mark>Luis Enrique</mark> took the decision to make me play. \"My team needed me and I understood. On other occasions when Spain needed me I have played with pain or physical problems .\" "}, {"articleID": "2018072402_00235876_W", "names": {"Mark Saunders": ["Q20006905", "Q4428797", "Q56724352", "Q6769597"]}, "date": "2018-07-24", "url": "https://news.nationalpost.com/news/toronto/toronto-danforth-shooting-victim-reese-fallon?video_autoplay=true", "content": "Reese Fallon, 18, a recent Toronto high school graduate and political activist who was set to study nursing in the fall, was identified by her family Monday as one of two people killed in a shooting rampage Sunday night. She spent the evening celebrating a birthday with two friends with dinner at a downtown pizza restaurant, before heading to the Danforth. A woman who answered the phone at the Fallon family's east-end Toronto home said they are devastated and asked that their privacy be respected. She identified herself as a family friend, but did not wish to be named. \"She was the nicest person--enjoying her life, living her life. She did not deserve to die this way,\" said her friend Frank Hong, who met her in April at the federal Liberal convention in Halifax, where Fallon was part of the Young Liberals delegation, talking politics and sizing up candidates. \"She had a promising life ahead of her .\" Danforth shooting victim Reese Fallon. Facebook She did not deserve to die this way In the 2015 federal election, Fallon volunteered as a canvasser for Nathaniel Erskine-Smith, Liberal MP for her home riding of Beaches-East York. \"She was smart, passionate, energetic and out to make a difference in the world,\" Erskine-Smith said in an interview. \"This is a huge loss .\" One of Fallon's dinner companions on Sunday was Samantha Price. Snapping a picture from what appeared to be a hospital bed Monday, Price wrote on Instagram: \"Thank you to everyone who has been supportive during this time. It was truly devastating to have gone through this experience. My heart goes out to the other families suffering through this .\" Social media postings indicate Fallon graduated this year from Malvern Collegiate Institute, and was set to study nursing at McMaster University in Hamilton in the fall. Carrie Lauren Fallon, who identified herself as Reese Fallon's cousin on social media, posted a link to news coverage of the shooting on Monday morning, with the comment: \"My beautiful cousin. My heart hurts seeing this everywhere. Seeing my friends <mark>mark</mark> themselves as safe on Facebook. But Reese can't <mark>mark</mark> herself safe. I'm so devastated for her and her family. I'm in f--king shock .\" Reese Fallon was identified on Monday as the 18-year-old victim of the Danforth shooting in Toronto. Facebook The Toronto District School Board said in a statement it was \"heartbroken,\" and called Fallon \"an engaging student\" who was \"highly regarded by staff and loved by her friends .\" Director of education John Malloy said the school will open on Tuesday, despite summer holidays, and flags at Malvern and all school board administrative buildings will fly at half-staff. The other victim who died, identified by police as a 10-year old Toronto-area girl, has not been publicly named. It is not known where Fallon was along the strip of Danforth Avenue, where a gunman shot 15 people, prompting mass casualty responses at Toronto hospitals. But the 15 victims were found on the street, in a restaurant, an ice cream parlour, a coffee shop, and other places in Toronto's Greektown. Video shot from an apartment above a store shows a man dressed in black firing at least three times into an ice cream parlour from the sidewalk. Police were urging witnesses to immediately contact police to report what they may have seen or heard. Given the time, around 10 p.m. on a warm summer night, the Danforth would have been busy with hundreds of people. Video screenshot of the suspected gunman who opened fire in Toronto's Greektown. @ arilanise / Instagram The emergency medical response was the largest since the van attack on Yonge Street in April. St. Michael's Hospital in the downtown core received five patients, of whom three underwent immediate life-saving surgery for gunshot wounds, according to Dr. Najma Ahmed, the acting medical director of trauma. She said all remained in serious but stable condition on Monday. Sunnybrook Hospital in north Toronto received three patients with gunshots, of whom two are now in good condition, and one in critical but stable condition, according to spokeswoman Laura Bristow. The 15 victims ranged in age from 10 to 59, with injuries ranging from minor to fatal, Toronto Police Chief <mark>Mark Saunders</mark> said at a Monday afternoon press conference. He said family members of all victims have been notified. The 29-year-old male shooter also died after being shot. His death, whether by suicide or police fire, is the subject of a separate investigation by the Special Investigations Unit. The SIU identified him Monday evening as Faisal Hussain. Police line the street at the scene where a gunman shot more than a dozen people on Danforth Avenue in Toronto, Ontario, July 23, 2018. Tyler Anderson / National Post Bonnie Levine, executive director of Victim Services Toronto, a charity that works with police to provide immediate short-term assistance to victims of trauma, urged people deeply affected by the shootings to contact her agency for help. \"We know that these events have far-ranging effects. We know that, not only do people who were at the Danforth and in the shops and those who were injured and families of those who are deceased, are affected, but it can also be triggering for anyone who was at the April 23 van attack .\" These situations really can compound the trauma. If anyone is needing any type of support, our services are offered 24 hours a day, 365 days a year, \"she said. The phone number is 416-808-7066. Det.-Sgt. Terry Browne, the lead investigator for Toronto Police, described\" a moving scene \"that was\" very rapid and fluid \"and the investigation is focused on several\" scenes within the scene. \"He said a key question is whether there were other people involved. With files from Joe O’Connor • Email: jbrean @ nationalpost.com | Twitter: josephbrean"}, {"articleID": "2017080318_00572952_W", "names": {"Stephanie Smith": ["Q587622", "Q7608398"]}, "date": "2017-08-03", "url": "https://nupge.ca/content/bcgeu-granted-standing-national-inquiry-missing-and-murdered-indigenous-women-and-girls", "content": "\"The essential work of our members has been recognized by the commission and they've asked to hear from them directly\" --<mark>Stephanie Smith</mark>, BCGEU President Vancouver (2 Aug. 2017)--The B.C. Government and Service Employees' Union (BCGEU/NUPGE) has been granted standing in the National Inquiry into Missing and Murdered Indigenous Women and Girls (MMIWG) allowing it to make formal written and oral submissions to the public inquiry. The letter from the MMIWG states: \"On behalf of the Commissioners, the Application for Standing submitted by BC Government and Service Employees' Union has been granted, for greater certainty, the Commissioners have granted standing in Part I, for the Region of British Columbia, for the issues as applied, with full rights .\" \"I am very pleased to hear our application was accepted. The essential work of our members has been recognized by the commission and they've asked to hear from them directly,\" said <mark>Stephanie Smith</mark>, BCGEU President. \"Several of our members around the province have worked with now missing and murdered women and girls, and feel strongly that their stories and experiences be shared with the commission .\" BCGEU report looks at work done by members to protect vulnerable women and girls \"I am so proud of the work our members do with Indigenous peoples and communities. We now have some of our most important work ahead of us as we prepare for our submission to the Inquiry. Recently, we released our report on Women's Services in B.C.--Collective Wisdom: Challenges and Opportunities in BC Women's Services. It speaks to the vital work our members do to protect and support vulnerable women and girls and their children, including many Indigenous women and girls. We intend to share this collective voice and experience directly with the inquiry .\" \"We have already shared these findings with the Federal Minister of Status of Women, Honourable Maryam Monsef, as well as the former Provincial Minister of Social Development and Social Innovation, Honourable Michelle Stilwell. I hope to meet with Minister Monsef in September to further discuss our members' work, how we can better protect and support Indigenous women and girls, and how we can help provide healing and justice for their communities .\" The BCGEU will issue further updates as our involvement with the National Inquiry into Missing and Murdered Indigenous Women and Girls progresses. NUPGE and Components pushed for the inquiry NUPGE and its Components supported efforts to get the federal government to call an inquiry into the tragically high number of missing and murdered indigenous women. This has included supporting the Native Women's Association of Canada (NWAC) and its Sisters in Spirit Initiative to increase awareness and address the issue of the appalling high number of Indigenous women and girls who are missing or have been murdered. While an Inquiry has been called, it is clear that it needs to be restructured. To meet the hopes and expectations people have for the Inquiry, a process is needed that honours the lives of Indigenous women and girls and leads to measures to end the violence. Organizations like the Native Women's Association of Canada have made concrete suggestions for how the Inquiry can be restructured and it is hoped those suggestions will be listened to. NUPGE The National Union of Public and General Employees (NUPGE) is one of Canada's largest labour organizations with over 370,000 members. Our mission is to improve the lives of working families and to build a stronger Canada by ensuring our common wealth is used for the common good. ~ NUPGE NUPGE Components: BCGEU Issues and Campaigns: Women's Issues Occupational Groups: Social Services People: <mark>Stephanie Smith</mark> Private: National Inquiry into Missing and Murdered Indigenous Women and Girls MMIWG violence against women"}, {"articleID": "2015041617_00023265_W", "names": {"Paul Harrison": ["Q1790955", "Q3427121", "Q3802904", "Q42889436", "Q45882852", "Q56439843", "Q7151154", "Q7151155", "Q7151156", "Q7151157"]}, "date": "2015-04-16", "url": "http://nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=11433853", "content": "Grant Bradley Aviation, tourism and energy writer for the Business Herald Service to centre in Texas will be local airline's longest flights yet The Houston flights will provide links to the big southern and eastern US markets. Photo / Getty Images Air New Zealand is launching a fresh near half-billion dollar push into the United States with services to Houston from Auckland this year. The airline is on a rapid growth path this year, expanding by around 12 per cent over the next six months. Chief executive Christopher Luxon said the new capital - planes - invested in new routes typically amounted to about $450 million for services built up to daily using a wide-body plane and annual operating costs added up to $160 million. The Houston service would run up to five times a week and start about the same time as Air New Zealand continues to bed down its resumption of flying to Singapore and starts flying three times a week to Buenos Aires. And it hopes to start a partnership with Air China for daily services to Beijing. \"We've got a bit on, we've thrown the company into growth mode. Internally within Air New Zealand it's quite a change as we learn how to manage profitable growth .\" Although fuel prices had risen slightly from recent lows, they did not colour the airline's thinking. \"If we let that dictate our decisions we'd get into trouble very quickly. We're a demand-driven organisation and if we think there's an opportunity as a company and a country to exploit it we do,\" he said. Salt Funds Management managing director <mark>Paul Harrison</mark> said the Houston move made sense for Air New Zealand with strong connections through the United States with alliance partner United Airlines. But while it sealed up one route it could alert another US carrier to the opportunity of flying here. Since 2012 Air New Zealand has had direct flying to the US mainland to itself which <mark>Harrison</mark> said was important for yields and profitability. Air New Zealand shares closed down 0.2 per cent at $2.815 yesterday. Tourism leaders and the travel industry have welcomed the flights, set to start in late December, as giving more momentum for rapidly growing traffic between NZ and the US. Prime Minister and Tourism Minister John Key said the new service would provide a more direct route for the millions of US citizens living in the south and east of the country. The US is already New Zealand's third-largest visitor market behind Australia and China, with 226,608 arrivals in the year to February - a 10 per cent rise on the previous year. The Auckland-Houston flights will be the longest on Air NZ's network. It will take about 13 hours 50 minutes to make the 11,990 km flight and an extra 40 minutes to fly back to New Zealand into prevailing head winds, 30 minutes more than the airline's current longest flight from Auckland to Vancouver - about 11,340 km. The airline will use refurbished Boeing 777-200s. New route • Air New Zealand will fly between Auckland and Houston up to five times a week. • It provides connections to the big southern and eastern US markets as well as the Caribbean and central America."}]