[{"date": "2014-10-12", "url": "http://wcnc.com/story/sports/motor/nascar/2014/10/12/kevin-harvick-wins-at-charlotte-advances-in-chase/17148223", "content": "Kevin Harvick wins at Charlotte, advances in Chase Kevin Harvick celebrates in victory lane after winning the Bank of America 500 at Charlotte Motor Speedway. MORE CONCORD, N.C.--Breaking down the Bank of America 500 from Charlotte Motor Speedway: Winner: Kevin Harvick pulled away from Jeff Gordon on the final restart in a green-white-checkered finish after <mark>Brian Vickers</mark>' crash with seven laps remaining brought out the race's final caution. With the win, Harvick earned a slot in Round 3 of the Chase for the Sprint Cup. It is his third win of the season and first since April. \"It's great, to be honest with you,\" Harvick said after the race. \"We know we have the car we need to run up front and win races; things just haven't gone right. This was the night we needed to win .\" Gordon finished second, followed by Jamie McMurray, Joey Logano and Kyle Busch. \"I'm really proud of that finish, really proud of that effort,\" Gordon said. \"Kevin was tough. I knew when he got out front it was going to tough to beat him .\" Fight: Meanwhile, 2012 titlist Brad Keselowski, who also needed a very strong finish or win after a blown tire last week, was 16th. He and fellow Chase driver Denny Hamlin got tangled up on the cool down lap, with Keselowski taking a swipe across the No. 11 Toyota's fender. Hamlin had to be restrained by his crew when he exited his vehicle in the garage. Matt Kenseth, who said he also was hit by Keselowsi under yellow, jumped him as Keselowski was walking betwen the Team Penske haulers. \"He's a champion; he's supposed to know better than that,\" Kenseth said. Race 5: Kevin Harvick does a burnout after winning the Bank of America 500 at Charlotte Motor Speedway to clinch a berth in Round 3 of the Chase. Race 5: Reporters surround Denny Hamlin after he tried to go after Brad Keselowski following the Oct. 11 race at Charlotte Motor Speedway. The cars of Keselowski and Hamlin made contact on the cool-down lap and on pit road immediately after the race ended. Race 5: The No. 2 Team Penske crew pushes Brad Keselowski's car to the garage after he plowed into two cars on pit road following the conclusion of the Bank of America 500. Race 5: <mark>Ryan Newman</mark>, left, spins out as he tries to avoid colliding with a crashing Danica Patrick (not pictured) during the Oct. 11 race at Charlotte Motor Speedway. Race 5: A broken gear shifter forced Dale Earnhardt Jr.'s crew to push him out of his stall during a pit stop in the Bank of America 500 at Charlotte Motor Speedway. Race 4: NASCAR Sprint Cup Series driver Joey Logano celebrates after winning the Hollywood Casino 400 at Kansas Speedway. Race 4: Joey Gase is helped out of his car by safety workers after spinning out and hitting the wall on lap 188. Race 4: Crew members work in the garage on the car of Brad Keselowski, driver of the No. 2 Ford. He crashed due to a tire failure on lap 160. Race 4: Teammates Dale Earnhardt Jr., driver of the No. 88 Chevrolet, and <mark>Jimmie Johnson</mark>, driver of the No. 48 Chevrolet, speak in the garage area while their crews work on their damaged cars. Earnhardt blew a tire on lap 122. Race 4: <mark>Jimmie Johnson</mark> (No. 48) and Greg Biffle (No. 16) wreck on lap 85. Race 3: Jeff Gordon celebrates in victory lane after winning the AAA 400 at Dover International Speedway to advance to the next round of the Chase for the Sprint Cup. Race 3: Greg Biffle was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 21st at the AAA 400 at Dover International Speedway. Race 3: <mark>Kurt Busch</mark> was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 18th at the AAA 400 at Dover International Speedway. Race 3: Aric Almirola was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 28th at the AAA 400 at Dover International Speedway. Race 3: AJ Allmendinger was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 23rd at the AAA 400 at Dover International Speedway. Race 2: Joey Logano applies his name to the next round of the Chase grid after winning the Sylvania 300 at New Hampshire Motor Speedway. Race 2: No Chase driver struggled more at New Hampshire Motor Speedway than Denny Hamlin. First his team had to deal with a fueling malfunction early in the race. Then his No. 11 Toyota collided with David Ragan's No. 34 Ford. Race 2: Kyle Busch needed extensive front-end repairs after a collision with Kasey Kahne during the Sept. 21 race at New Hampshire. Race 2: Matt Kenseth spins into the wall after colliding with <mark>Paul Menard</mark> during the Sylvania 300 at New Hampshire Motor Speedway. Race 2: Drivers make their way into Turn 2 during the Sylvania 300 at New Hampshire Motor Speedway. Race 1: Top seed Brad Keselowski does a burnout after winning the MyAFibStory.com 400 at Chicagoland Speedway to kick off the Chase. Race 1: Jeff Gordon (24) and <mark>Kyle Larson</mark> (42) finished second and third, respectively, at Chicagoland Speedway. Race 1: Aric Almirola reacts during an interview with ESPN's Jamie Little after blowing an engine at Chicagoland Speedway. Almirola finished 41st. Race 1: Carl Edwards (99) pits after blowing a tire during the MyAFibStory.com 400 at Chicagoland Speedway. Edwards finished 20th. Race 1: Kyle Busch (18) leads the field as the green flag waves to start the MyAFibStory.com 400 at Chicagoland Speedway. Race 5: Kevin Harvick does a burnout after winning the Bank of America 500 at Charlotte Motor Speedway to clinch a berth in Round 3 of the Chase. (Photo: <mark>Peter Casey</mark>, USA TODAY Sports) FullscreenNext Slide Bad start: Kenseth was penalized after a crew member cut a decal off the right rear quarterpanel - apparently at NASCAR's request - before the race but after all cars had cleared inspection. That was considered an unapproved adjustment, so he was sent to the rear of the field to start the race. He finished 19th and now also is in danger of missing Round 3. Out for revenge: Joey Logano turned Danica Patrick into the wall with 86 laps to go, and she asked for - and was granted - permission to retaliate against the Chase points leader. \"Too bad taking the 22 out doesn't hurt his Chase because he won last weekend,\" she said. Broken shifter puts Dale Earnhardt Jr. on Chase brink Big shift: With just under 200 laps to go, Earnhardt Jr. reported a broken shifter. He pitted several times for repairs, but they didn't work and he was forced to go on another green-flag run while waiting for a replacement. At one point, his crew had to push him off pit road during a green-flag stop and he lost a lap. Tires all good: Despite worries about blown tires like the ones at Kansas Speedway, teams didn't experience any major issues at Charlotte. Heavy rains soaked the track in the afternoon, leaving it green. But the lack of rubber on the 1.5-mile surface--which often can lead to faster tire wear--were a non-issue. Blown up: Clint Bowyer's Toyota Racing Development engine blew up less than 100 laps into the race, leaving he and his team quite unhappy. \"Everyone else's (engine) lived every time they (freaking) run it,\" crew chief Brian Pattie radioed to Bowyer. \"At least they make good power,\" Bowyer said, moments after he said the failure \"put us out of our (freaking) misery .\" What channel is it on? NASCAR fans expressed their outrage on Twitter after the first 25 laps of the race were unable to be seen anywhere but the track. A college football game between TCU and Baylor on ABC ran late, which forced ESPN to scramble for another option. Officials settled on ESPNEWS, but a preseason NBA game on that network went to overtime. The race was then set to be played on ESPN3, an online network, but it never appeared. Finally, ABC started showing the race after the football game concluded - just in time for a competition caution. \"We are disappointed that our fans were unable to see the start of tonight's race,\" NASCAR said in a mid-race statement. \"We do all we can with the networks to avoid delays when live sports run late. We're grateful for the passion of our fans and are thankful to those now watching on ABC .\" ESPN later issued a statement of its own: \"We started the race on ESPN3, which is available to 95 million homes. We're fortunate to have multiple TV networks available, but tonight there were live events on all of them, including an epic football game on ABC and an overtime NBA game on ESPNEWS. We joined the race on ABC at lap 26 .\" Follow Gluck on Twitter @ jeff_gluck SATURDAY'S BANK OF AMERICA 500 RESULTS 1. (7) Kevin Harvick, Chevrolet, 334 laps, 145.3 rating, 48 points. 2. (2) Jeff Gordon, Chevrolet, 334, 126.8, 43. 3. (18) Jamie McMurray, Chevrolet, 334, 112.7, 42. 4. (13) Joey Logano, Ford, 334, 92.3, 40. 5. (1) Kyle Busch, Toyota, 334, 115.5, 40. 6. (24) <mark>Kyle Larson</mark>, Chevrolet, 334, 107.5, 39. 7. (5) <mark>Ryan Newman</mark>, Chevrolet, 334, 94.4, 38. 8. (10) Carl Edwards, Ford, 334, 84.5, 37. 9. (3) Denny Hamlin, Toyota, 334, 96.2, 36. 10. (19) Kasey Kahne, Chevrolet, 334, 83.5, 34. 11. (11) <mark>Kurt Busch</mark>, Chevrolet, 334, 111.9, 34. 12. (26) AJ Allmendinger, Chevrolet, 334, 79.1, 32. 13. (20) Austin Dillon, Chevrolet, 334, 82.1, 32. 14. (23) Martin Truex Jr., Chevrolet, 334, 86.1, 30. 15. (16) Justin Allgaier, Chevrolet, 334, 72.2, 30. 16. (17) Brad Keselowski, Ford, 334, 97.5, 29. 17. (21) <mark>Jimmie Johnson</mark>, Chevrolet, 334, 91.7, 27. 18. (12) Greg Biffle, Ford, 334, 66.8, 26. 19. (22) Matt Kenseth, Toyota, 334, 64.8, 25. 20. (9) Dale Earnhardt Jr., Chevrolet, 333, 85.4, 25. 21. (4) <mark>Tony Stewart</mark>, Chevrolet, 333, 78.8, 23. 22. (15) Aric Almirola, Ford, 332, 63, 22. 23. (32) Landon Cassill, Chevrolet, 331, 46.9, 0. 24. (28) Ricky Stenhouse Jr., Ford, 331, 56.2, 20. 25. (27) Marcos Ambrose, Ford, 331, 54.1, 19. 26. (14) Danica Patrick, Chevrolet, 331, 61.8, 18. 27. (30) Reed Sorenson, Chevrolet, 330, 49.9, 17. 28. (36) Cole Whitt, Toyota, 330, 43.1, 16. 29. (31) <mark>Michael McDowell</mark>, Ford, 330, 50.5, 15. 30. (33) Alex Bowman, Toyota, 330, 46.6, 14. 31. (29) Casey Mears, Chevrolet, 329, 55.2, 13. 32. (37) David Gilliland, Ford, 329, 40, 12. 33. (35) Michael Annett, Chevrolet, 328, 41.7, 12. 34. (34) David Ragan, Ford, 328, 35.1, 10. 35. (42) Corey LaJoie, Ford, 326, 32.9, 0. 36. (40) Timmy Hill, Chevrolet, 326, 31.9, 8. 37. (8) <mark>Brian Vickers</mark>, Toyota, engine, 325, 79.9, 7. 38. (41) J.J. Yeley, Toyota, 325, 29.5, 0. 39. (43) Blake Koch, Ford, 322, 26.3, 0. 40. (39) Brett Moffitt, Toyota, 320, 25.5, 4. 41. (38) <mark>Josh Wise</mark>, Chevrolet, rear gear, 178, 38.8, 3. 42. (6) <mark>Paul Menard</mark>, Chevrolet, engine, 134, 58.6, 2. 43. (25) Clint Bowyer, Toyota, engine, 94, 56.5, 1 .--Race Statistics Average Speed of Race Winner: 145.346 mph. Time of Race: 3 hours, 26 minutes, 49 seconds. Margin of Victory: 0.571 seconds. Caution Flags: 8 for 39 laps. Lead Changes: 32 among 14 drivers. Lap Leaders: Ky.. <mark>Busch</mark> 1-13; J. Gordon 14-27; M. Annett 28; D. Earnhardt Jr. 29; Ky.. <mark>Busch</mark> 30-36; J. Gordon 37-74; Ku. <mark>Busch</mark> 75; D. Earnhardt Jr. 76; B. Keselowski 77-78; J. Gordon 79-97; D. Earnhardt Jr. 98-99; J. McMurray 100-104; K. Harvick 105-139; J. Gordon 140; K. Harvick 141-187; J. Gordon 188; B. Keselowski 189-190; K. Harvick 191-222; K. <mark>Larson</mark> 223; K. Harvick 224-237; A. Dillon 238-242; Ky.. <mark>Busch</mark> 243-263; K. <mark>Larson</mark> 264-267; B. Keselowski 268-271; D. Hamlin 272-293; K. Harvick 294-310; J. Gordon 311; Ku. <mark>Busch</mark> 312; A. Dillon 313; R. <mark>Newman</mark> 314; C. Edwards 315; J. Allgaier 316-317; K. Harvick 318-334. Leaders Summary (Driver, Times Led, Laps Led): K. Harvick, 6 times for 162 laps; J. Gordon, 6 times for 74 laps; Ky.. <mark>Busch</mark>, 3 times for 41 laps; D. Hamlin, 1 time for 22 laps; B. Keselowski, 3 times for 8 laps; A. Dillon, 2 times for 6 laps; J. McMurray, 1 time for 5 laps; K. <mark>Larson</mark>, 2 times for 5 laps; D. Earnhardt Jr., 3 times for 4 laps; Ku. <mark>Busch</mark>, 2 times for 2 laps; J. Allgaier, 1 time for 2 laps; R. <mark>Newman</mark>, 1 time for 1 lap; C. Edwards, 1 time for 1 lap; M. Annett, 1 time for 1 lap. Wins: B. Keselowski, 5; J. Logano, 5; J. Gordon, 4; D. Earnhardt Jr., 3; K. Harvick, 3; J. <mark>Johnson</mark>, 3; C. Edwards, 2; A. Allmendinger, 1; A. Almirola, 1; Ku. <mark>Busch</mark>, 1; Ky.. <mark>Busch</mark>, 1; D. Hamlin, 1; K. Kahne, 1.", "articleID": "2014101213_00011243_W", "names": {"Brian Vickers": ["Q2112545", "Q4965539"], "Jimmie Johnson": ["Q217238", "Q6199355"], "Josh Wise": ["Q328890", "Q5344899"], "Kurt Busch": ["Q201820", "Q42507470"], "Kyle Larson": ["Q11751789", "Q21184548", "Q5308142"], "Michael Mcdowell": ["Q1928579", "Q1928582"], "Paul Menard": ["Q16732470", "Q2879369"], "Peter Casey": ["Q15040081", "Q16188918", "Q41787474"], "Ryan Newman": ["Q18989", "Q525980"], "Tony Stewart": ["Q380127", "Q3993311", "Q4648431", "Q56803689", "Q7823492", "Q7823493"]}}]