[{"articleID": "2014051703_00031081_W", "names": {"David Griffin": ["Q16198682", "Q23769550", "Q2746775", "Q29572809", "Q5234408", "Q5234409"]}, "date": "2014-05-16", "url": "http://www.nba.com/2014/news/05/16/cavs-coaching-search.ap/index.html?rss=true", "content": "Cavs have no timetable for hiring new coach <mark>Griffin</mark> says they \"don't have a real specific timetable\" and doesn't \"anticipate anything happening anytime soon.\" There had been reports that the Cavaliers might meet with candidates during the NBA draft combine this week. But <mark>Griffin</mark> says \"nothing along those lines\" has happened. Combine: <mark>David Griffin</mark> Scott Howard-Cooper talks with Cavaliers new general manager <mark>David Griffin</mark>."}, {"articleID": "2019090618_00300366_W", "names": {"Noel Whelan": ["Q16191489", "Q3877698"]}, "date": "2019-09-06", "url": "https://footballleagueworld.co.uk/noel-whelan-reacts-to-recent-leeds-united-departure/", "content": "Share Tweet Former Leeds United striker <mark>Noel Whelan</mark> has expressed his surprise at midfielder Callum Nicell's departure from the club. Leeds confirmed earlier this week that Nicell had left Elland Road by mutual consent, with the 19-year-old having spent time with Premier League clubs including Leicester City earlier in the summer. Nicell, who was named the club's Academy Player of the Year in 2017, had only signed a two-year contract with Leeds last year, and <mark>Whelan</mark> appears to have been caught off guard by the termination of that deal. Speaking to Football Insider about Nicell's Leeds exit, the 44-year-old said: \"I didn't see this coming, to be honest, especially as everyone a the club seemed to think highly of him.\" He's obviously ambitious and he doesn't want to waste his time at Leeds if he isn't going to make the first team. \"That's up to him, and it shows that he backs himself to walk out on a contract. Leeds will have given him a percentage of what he would have earned over the season and he will hope to make up the remainder at a new club.\" Assessing Leeds' decision to allow Nicell to leave, <mark>Whelan</mark> appeared to suggest that manager Marcelo Bielsa will have been happy to allow the teenager to leave, as he claimed: \"That's brave, in a way. Will Leeds regret it? Obviously, they don't want their best young players to go, but you would think Marcelo Bielsa would have promoted him to the first team if he felt he was ready.\" He has backed young talent and given them lots of opportunities since he took over, so he obviously felt Nicell had some way to go. \"Nicell never made a senior appearance for Bielsa's side, although he was named on the bench twice for the Yorkshire club in the season prior to the argentine's appointment at Elland Road. The Verdict I can understand where <mark>Whelan</mark> is coming from here. Given the number of chances that have been given to young players at Leeds in recent years, you do feel the potential was there for Nicell to get his own opportunity in the first team at some point. You would imagine therefore that Nicell is confident in the quality of opportunity that he is getting elsewhere, although given the situation Leeds are in, that could backfire if something else fails to materialise for the youngster. Just how Nicell fares in the future is something that I imagine there will be more than a few at Elland Road watching with interest going forward. Like what the FLW have on offer? Sign up for more notifications! Related Topics: callum nicell Leeds United Sky Bet Championship Toby Wilding"}, {"articleID": "2009013017_00010683_W", "names": {"Emily Jackson": ["Q19325584", "Q27107501"], "Michael Miller": ["Q20641178", "Q21585572", "Q28663074", "Q36844646", "Q43325362", "Q56167800", "Q56479047", "Q58360224"]}, "date": "2009-01-30", "url": "http://scnow.com/scp/news/local/pee_dee/article/jackson_miller_to_speak_to_sierra_club/30749/", "content": "morning news staff reports published: january 30, 2009 local attorneys <mark>emily jackson</mark> and <mark>michael miller</mark> will speak to the pee dee group-sierra club on thursday. they will present \"the carolina food project: eating local for one year,\" and discuss how and why to eat locally, and how to make eating locally part of one's lifestyle. the program begins at 7 p.m. at st. luke lutheran church, 1201 cherokee road, florence. pee dee group-sierra club meetings are held the first thursday of each month from september through may. for more information, visit its web site,) please avoid offensive, vulgar, or hateful language. respect others. use the \"report inappropriate comment\" link when necessary. no tags are associated with this article."}, {"articleID": "2012051723_00056403_W", "names": {"Quincy Jones": ["Q193645", "Q25190073"], "Joan Collins": ["Q152843", "Q47122349", "Q6204959"], "Nick Adams": ["Q3339702", "Q41787493", "Q7026686", "Q7026687", "Q7026688"]}, "date": "2012-05-17", "url": "http://entertainment.msn.com/news/article.aspx?news=729421&affid=100055", "content": "celebrities react to the death of donna summer may 17, 2012, 6:06 pm est los angeles (ap)--reaction to the death thursday of singer donna summer, who was 63: \"michelle and i were saddened to hear about the passing of donna summer. a five-time grammy award winner, donna truly was the\" queen of disco. \"her voice was unforgettable, and the music industry has lost a legend far too soon. our thoughts and prayers go out to donna's family and her dedicated fans.\" - president barack obama .--\"so shocking to hear about the passing of donna summer. in the 70s, she reigned over the disco era and kept the disco jumping. who will forget\" last dance .' a fine performer and a very nice person. \"- aretha franklin .--\"i was shocked to hear about donna. she was so vital the last time i saw her a few months ago. i loved doing the duet with her. she had an amazing voice and was so talented. it's so sad.\" - barbra streisand .--\"rest in peace dear donna summer. your voice was the heartbeat and soundtrack of a decade.\" - <mark>quincy jones</mark>, via twitter .--\"we will miss donna summer! she changed the world of music with her beautiful voice and incredible talent.\" - janet jackson .--\"i can't believe we've lost another wonderful singer. donna, like whitney, had one of the greatest voices ever. i loved her records. she was the disco queen, and will remain so. i knew her and found her to be one of the most likable and fun people ever. she will be missed and remembered.\" - dolly parton .--\"when you lose a friend you feel like they are gone forever.that is not true with my dear friend donna. she was a queen, the queen of disco, and we will be dancing to her music forever.\" - liza minnelli .--\"wow, another legend gone. rest in peace to the beautiful disco queen donna summer.\" - nicki minaj, via twitter .--\"donna and i had a friendship for over 30 years. she is one of the few black women i could speak german with and she is one of the few friends i had in this business.\" - chaka khan .--\"i remember sitting in the front seat of my mom's toyota while she sang donna summer's\" she works hard for the money'...songs were just classic. \"- ryan seacrest, via twitter .--\"she not only made her mark in my heart as well as others, but she forever changed the way of how america danced and enjoyed themselves. she may have had her\" last dance' here on earth, but \"heaven knows' it is dancing with joy for her arrival.\" - gloria gaynor. \"so sad to hear about donna summer. i adored her voice. may she rest in peace.\" - <mark>joan collins</mark>, via twitter .--\"another one of my vocal idols has passed...rip donna summer.\" - fergie, of the black eyed peas .--\"few singers have impacted music & the world like donna summer! it's the end of an era. peace & prayers 2 all who loved her.\" - gloria estefan, who posted a photo of herself with summer on twitter .--\"she defined dance music in the 70's and had a wonderful voice and personality.\" - \"so you think you can dance\" creator and \"american idol\" producer nigel lythgoe, via twitter .--\"when i was starting i toured frequently with donna summer as her opening act, i'll never forget the sheer power of her voice or her kindness.\" - garry shandling, on twitter .--\"she will forever be a music legend and i am grateful i've had the opportunity to perform one of her biggest hits on broadway.\" - <mark>nick adams</mark>, who sings summer's hit \"hot stuff\" on broadway in \"priscilla queen of the desert, the musical.\" "}, {"articleID": "2019103100_00104880_W", "names": {"Joe Staton": ["Q1691605", "Q6212495"]}, "date": "2019-10-31", "url": "http://thechronicleherald.ca/business/reuters/uk-consumer-sentiment-returns-to-joint-weakest-since-2013-gfk-370129/", "content": "UK consumer sentiment returns to joint-weakest since 2013: GfK David Milliken Sorry you must be at least 19 years of age to consume this content. By David Milliken LONDON (Reuters) - Britain's longest-running measure of consumer sentiment slipped back to its joint-lowest level since 2013 this month, as Brexit uncertainty weighed again on households' assessment of the economic outlook. British consumers have generally remained upbeat since 2016's referendum to leave the EU - partly offsetting weaker business investment - but in recent weeks morale appears to have softened, boding poorly for spending in the run-up to Christmas. The GfK consumer sentiment dropped to -14 in October from -12 in September, a slightly bigger fall than economists had forecast in a Reuters poll. The index was last this low in August, and has not been lower since July 2013. \"The ongoing machinations in Westminster appear to be impacting how we view our personal financial situation for the coming year with a notable fall...in this measure in October,\" GfK strategy director <mark>Joe Staton</mark> said. The survey took place between Oct. 1 and Oct. 14, before Prime Minister Boris Johnson secured a new Brexit deal, which he has since abandoned trying to pass through parliament in favor of holding an early election on Dec. 12. Britain had been due to leave the EU on Oct. 31, but Johnson was forced by parliament to ask for a delay after failing to pass his transition deal in time and the Brexit deadline has moved back to Jan. 31. The GfK survey showed falls across all five measures it use to calculate sentiment, with the steepest decline coming in consumers' assessment of how their personal finances were likely to evolve over the next 12 months. British households declared themselves insolvent at the highest rate in eight years during the 12 months to the end of September, according to official data on Wednesday. Separately, there were also signs that Brexit uncertainty has weighed on Britain's commercial property market. Some 62% of surveyors believe the market had entered a downturn in the three months to September, the most since the survey began in 2015 and up from 53% in the last quarter, according to the poll from the Royal Institution of Chartered Surveyors. Retail was the hardest-hit real estate sector, RICS economist Tarrant Parsons said. \"It remains to be seen what impact the latest Brexit developments have on confidence across the sector, but with the picture unlikely to become clear until into the New Year it may well mean hesitation continues over the near term,\" he added. (Reporting by David Milliken, editing by Andy Bruce)"}, {"articleID": "2018100415_00344071_W", "names": {"Dave Roberts": ["Q5229686", "Q5229688", "Q5229690", "Q5229691", "Q5229692", "Q5229694", "Q5229696", "Q5229697", "Q5229698", "Q5229699", "Q5229701", "Q5229702"], "J. Miller": ["Q18730558", "Q56239397"], "Michael Goldberg": ["Q18206169", "Q23061147", "Q24005553", "Q28542651", "Q56061854"], "Mariano Rivera": ["Q382303", "Q48924970"], "Lou Ferrigno": ["Q24955125", "Q313306"], "Edward Martin": ["Q18819404", "Q42322260", "Q51589473", "Q5344354"]}, "date": "2018-10-04", "url": "https://www.seattletimes.com/nation-world/small-investors-bought-into-trump-hotels-then-the-embarrassment-came/", "content": "CHICAGO--Ten years ago, retired electrician <mark>Dave Roberts</mark> invested $650,000 in Donald Trump. <mark>Roberts</mark> bought a single room in Trump's hotel on the Chicago River, then waited for his share of the Trump profit stream. \"Everything he touches turns to gold,\" <mark>Roberts</mark> remembered being told. But the gold wore off, starting in 2016. Fewer guests checked in. Revenue dropped. <mark>Roberts</mark> estimated that his property value decreased by half, as the real-estate market was flooded with unsold Trump hotel rooms. \"I don't even like walking past the building\" now, he said. \"I can't even look at it.\" Most Read Nation & World Stories What was that \"presidential alert' test that appeared on your cell phone today? Trump engaged in suspect tax schemes as he reaped riches from father Kavanaugh allegations raise new question: Have you ever been in a bar fight? McConnell sets Friday test vote on Kavanaugh nomination WATCH Rancor rises as FBI's Kavanaugh report wraps up Unlimited Digital Access. $1 for 4 weeks. As a private company, the Trump Organization says little about its financial ups and downs. But The Washington Post obtained details from two of President Donald Trump's landmark properties--his luxury hotels in Chicago and Manhattan--from small-time investors such as <mark>Roberts</mark>, who get details that the public does not. Those investors--and internal documents they provided--showed that revenue at both properties dropped noticeably as Trump's political career took off. The decreases have stirred tensions in the buildings and left many investors worried that the Trump brand may be curdling in the liberal cities where Trump built much of his empire. In New York, documents show that the ownership board at Trump's hotel considered the stunning idea of removing the Trump name from the hotel the president still calls his\" flagship. \"The idea stalled. One board member, who spoke in favor of keeping the Trump name, was later nominated by Trump to a celebrity-studded presidential council on fitness. For the small-time investors--who bought individual hotel rooms, under an unusual arrangement that allowed Trump to offload financial risks onto others--the downturn has brought a bitter sense that they're suffering for the political rise of a figure who is now loathed in their communities.\" There's a lot of people who have nothing to do with him, that are being injured, \"said Howard Finkelstein, an investor in Trump's New York hotel.\" We're the ones that are paying the price for his ridiculous ego. There's no reason to have that name on there. \"Between 2015 and 2017, revenue from room rentals at the New York hotel declined 14 percent after adjusting for inflation, according to quarterly statements the Trump Organization provided to unit owners. At Trump's hotel in Chicago, a document investors saw last week showed a similar drop-off. Bookings fell 8 percent from 2015 to 2016, and this year's figures are still lower than the pace in 2016. At both hotels, the Trump Organization told investors that it did have some good news: In recent months, their losses had been cushioned, partly by new customers from overseas. Both hotels noted an influx of visitors from Saudi Arabia. Eric Trump--the president's son, who now runs the Trump Organization with his brother Donald Jr.--said this\" has been an incredible year \"for the Trump hotel brand. Across all Trump hotels, he said, business has increased since 2017.\" Our teams are consistently recognized for providing exceptional service and we couldn't be more proud of their hard work and dedication, \"he wrote.\" Year to date the portfolio as a whole is exceeding revenue and gross operating profit over last year considerably, as well as exceeding 2018 budget targets. \"The Trump Organization declined to give specifics about the hotels, or about the chain as a whole. There are now 11 Trump-branded hotels worldwide. That number is smaller than it used to be: Since Inauguration Day 2017, the owners of Trump hotels in Toronto, Panama and New York's SoHo neighborhood all cut ties with the Trump brand, and changed their hotels' names. Marriott announced this week that it will take over the Panama property. Among those remaining 11, some seem to be prospering: Trump's hotel in Washington, D.C., is busy with conservative groups, foreign embassy parties and GOP fundraisers. At Trump's hotel in Las Vegas, investors said their low rates have brought an influx of tourists from China. But the news has been worse at the Trump hotels in New York and Chicago, according to people who have invested in them. In these cities, Trump took on dozens or hundreds of small partners in an arrangement called a\" condo-hotel. \"That meant legally subdividing his hotels, so that each room could be sold as a separate piece of property. For the room owners, the benefit was that they got a share of the income, and the right to stay in their rooms for some nights. They also got details about income and occupancy rates for their rooms and--in some cases--for the hotel as a whole. In recent weeks, The Post spoke to 19 investors from the two hotels combined. For Trump--whose risk-taking businesses had needed repeated cash infusions from his father, Fred Trump, as a New York Times article detailed this week--the hotel-condo arrangement gave him two things he needed. One was cash. The other was a dilution of his financial risk. He got paid on the front end, by selling the units. Then he got paid on the back end, because he kept the contracts to operate the hotels.\" It's a way to enjoy a revenue stream, sort of indefinitely, if you can control the management group, \"said Jonathan <mark>J. Miller</mark>, a real-estate consultant who has studied condo-hotels. But, he said, that's a big\" if \": In many cases, he said, the investors who own rooms eventually take control, and kick out the original operator. In New York--where Trump's hotel opened at 1 Central Park West in 1997--it worked for many years. Celebrities visited often, liking the small, private lobby and sweeping park views. In 2012, for instance, a paparazzo caught Robert De Niro emerging with a laptop and papers in hand. The hotel's revenue from room rentals increased every year from 2011 to 2015, according to hotel-wide statistics shared with owners.\" 2015 was a banner year for us, \"Prince A. Sanders, the hotel's general manager, wrote in a letter to room owners. Trump had sold almost all of the hotel's 176 rooms. On the campaign trail, Trump bragged about this hotel, which had helped him re-enter the world of big-time New York real estate after his debt-fueled crash in the early 1990s. He called it\" a great success from the day it was built. \"Then came 2016. Overnight, Trump had transformed his brand--from an icon of big-city success, he became an icon of smoldering resentment against big-city America. In New York, his hotel was left to sell the old Trump, as this deep-blue city turned angrily on the new one.\" You come outside, you get yelled at. They have it gated off, there's police there, \"because of protests, said Finkelstein, one of the room owners.\" If you're going to stay in a hotel in New York, you figure out which one you're going to stay at. \"In 2017, Finkelstein said, he lost money on his unit for the first time after years--the room revenue didn't cover the fees and taxes. As Trump's political star rose, the celebrities thinned out, owners say. Protests increased. Sometimes, the celebrities led the protests: De Niro, for instance, returned to the hotel to speak to a large anti-Trump rally outside last year.\" I don't even like to use the umbrellas \"with the name\" Trump \"on them, said Ngaere Macray, who owns a hotel unit in the building that she uses for part of the year. She doesn't like Trump's politics, but doesn't want to sell her unit because she says the view is too good, the service is too nice. (The research firm CityRealty says the resale value of hotel-condo units has stayed stable, or even increased, despite the problems with revenue .) Macray wants Trump to go instead.\" He is the management group that we could, in theory, vote out. \"In the statements mailed to owners, good numbers turned south. From 2015 to 2017, the hotel's revenue from room rentals dropped from $34.4 million to $30.9 million. The average room rate--which had been high, even by New York's inflated standards--fell from $767 a night to $710. At the same time, other hotels nearby were also struggling as new competitors sprouted all over Midtown, cutting into everyone's revenue. But the Trump hotel fared worse than the others, said industry analyst <mark>Michael</mark> <mark>J.</mark> Bellisario of Robert W. Baird and Co.\" That decline is probably somewhat election-related, \"Bellisario said.\" There's no way of knowing for sure. \"At last, in early 2018, the Trump Organization told owners that it had identified the source of the problem. It wasn't the Trump brand. It was the bathrooms.\" A major dissatisfier has been the detrition of our room product...especially our bathrooms, which are actually twenty years old, \"Sanders, the general manager, wrote in the letter. Some were still outfitted with some 1990s-era Jacuzzi tubs. Sanders said a $20 million renovation would update the hotel's interior. But the hotel's board also was considering a more radical change. At a special meeting in January--the minutes of which were obtained by The Post--the board pondered whether it had the legal right to change the building's name (some owners wanted to call the hotel simply\" One Central Park West \"). First, three board members--including Donald Trump Jr. and a New Jersey doctor named Stephen Soloway--tried to shut down the discussion and adjourn quickly. But they were outvoted. Then the six other board members present voted to investigate the issue further, seeking out attorneys' advice. At some point after that, it appears, the idea fizzled. In recent weeks, Sanders issued a statement on behalf of the board, saying that it was not considering renaming the hotel and that it was pleased with its performance this year, one in which the New York hotel market is experiencing a comeback. Individual board members either declined to comment about the minutes of that meeting, or did not return calls from The Post. In May, Sanders wrote to the hotel's investors with a bit of good news: Revenue had increased in the first quarter of 2018. The reason, he wrote in his quarterly letter:\" a last-minute visit to New York by the Crown Prince of Saudi Arabia, \"in which a number of travelers accompanying the prince paid to stay at the Trump hotel. The Trump Organization did not respond to questions asking whether the Saudi government--a key U.S. ally--had paid for that block of rooms. Also in May, Trump nominated Soloway--the board member who had voted to end discussion of a name change--to the President's Council on Sports, Fitness and Nutrition alongside a raft of celebrities, including New England Patriots coach Bill Belichick, former baseball star <mark>Mariano Rivera</mark>, TV personality Mehmet Oz and <mark>Lou Ferrigno</mark>, who starred in the TV show\" The Incredible Hulk. \"A spokeswoman for the council said that Soloway had withdrawn his name from consideration a month later, on June 7. When The Post emailed Soloway about the hotel, his response included 62 exclamation points.\" Don't write or attempt to reach me again!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \"he wrote in late August. He signed the email,\" Stephen Soloway...Presidents Council for Sports Fitness & Nutrition. \"In Chicago, Trump's hotel had a lot going for it: a prime location along the revitalized Chicago River; a roof-deck restaurant, Sixteen, with two Michelin stars; and a clientele that included at least five pro-sports teams.\" Then the embarrassment came, \"said <mark>Michael Goldberg</mark>, who has owned his unit since the building opened in 2008 and, like some other investors who responded to The Post, is no fan of Trump's politics. The pro teams stopped coming. The two-star restaurant closed. <mark>Goldberg</mark> found that he couldn't even give away his unit for nothing.\" My daughter is getting married in September. They had their bachelorette [party], and I offered it to her for free. And she said, \"I would rather pay [to stay] somewhere else .'\" The Trump Organization issued a statement about the Chicago hotel, saying that \"the hotel is performing incredibly well, exceeding market share while garnering numerous accolades.\" But in a \"sales and marketing strategic update\" shared with investors in late September--and obtained by The Post--the hotel said its 2018 bookings were still 3.5 percent below the levels they'd decreased to in 2016. When the hotel tracked customers by country of origin, it found that bookings from U.S.-based visitors had fallen especially sharply. But there was good news, again, from Saudi Arabia. At last count, the hotel said, Saudi-based customers had booked 218 nights at Trump Chicago this year--a 169 percent increase from the same period in 2016. It also told investors about a rise in customers from China: \"China's room night production has increased significantly compared to 2016.\" The Trump Organization did not respond to questions from The Post about these latest statistics on the Chicago hotel. <mark>Roberts</mark>, the retired electrician, said he had invested in the hotel against his lawyer's advice. He had put down a $64,000 deposit on the unit in 2004, before the hotel was built. Then, in 2008, Trump asked for the rest of the money. \"\"Lose your $64,000, don't do it,'\" <mark>Roberts</mark> remembered his real estate lawyer saying. The lawyer worried that he was paying too much, as a financial crisis and a housing bust loomed. But <mark>Roberts</mark> went ahead: \"I'm careful with money, so I didn't want to lose my $64,000.\" Now, he said, the pain of the hotel's decreasing revenue has fallen disproportionately on him. He said that, before Trump's company passes along his room's earnings, it takes out fees for maintenance, reservations, housekeeping and other services. When revenue decreased, <mark>Roberts</mark> said, Trump's company took about the same cut--which left much less for him. \"I paid for the difference,\" he said. As a result, <mark>Roberts</mark> said, his room's payout dropped much faster than the hotel's overall revenue: It fell from $20,900 in 2015 to $8,900 in 2017. But after he pays taxes and his mortgage, <mark>Roberts</mark> says, Trump's unit gives him about $7 a day. \"I owe more than I can sell it for,\" he said. \"I can't catch up with the drop in price. I keep thinking that I'm ready to sell, and it drops again.\" He has $290,000 left on his mortgage. Even as revenue ticked up this year, owners of Trump hotel rooms in Chicago have struggled to sell them: Seventeen units are on the market now, and many of them have been available for months. \"The market is still significantly below where it was when the building opened. It's not a pretty picture for somebody who purchased then,\" said Gail Lissner of Integra Realty Resource In Chicago, there has been no sign of a revolt by the hotel's ownership board. <mark>Edward Martin</mark>, a Wisconsin businessman who heads the board, responded to The Post's queries with a short text message: \"Trump Tower Chicago is the premier property in Chicago.\" Soloway, the New Jersey doctor, is also on the board. But this spring, the Trump Organization's own real-estate brokers did something radical. They removed the Trump name from the building. At least, in the sales brochure. \"The perfect entertainment + dining destination,\" said the brochure, which was first reported by Crain's Chicago business. It was advertising some long-vacant retail space in the Trump building's bottom floors. In the photo under those words, the giant TRUMP sign on the building's facade had been airbrushed away. Krakow was a fellow at the Investigative Reporting Workshop at American University. The Washington Post's Crystal Duan in Las Vegas and Jack Gillum and Alice Crites in Washington contributed to this report."}, {"articleID": "2012111300_00064340_W", "names": {"Brad Jackson": ["Q4873258", "Q48791292"]}, "date": "2012-11-13", "url": "http://uwdawgpound.com/2012/11/12/3637652/washington-basketball-opens-season-with-win-versus-loyola-maryland", "content": "not from this game - james snook-us presswire twitter husky basketball has already started their season. despite my excitement for the season, it sort of sneaked up on me. brendan sherrer is gone. other than that the entire team is intact for this year which is already upon us. this was the first game with <mark>brad jackson</mark> as an assistant coach on the washington sidelines after spending nearly three decades as the head coach at western washington university, where this most recent season they won the division-ii national championship. <mark>jackson</mark> brought the high post offense to washington. lorenzo romar said that the team had some shadows of the high post already, but the main offense in years past was the motion offense; i like to call the half-court offenses of the lorenzo romar era the \"dribble around and see what happens\" offense. you see, i have a gift for naming such things. my other title for the offense was the \"just kidding you can stand there and we probably won't score anyways because we actually aren't running a play\" offense. bullet holes are how these go right? bullet holes we shall have! my biggest question going into the season was how will the team assimilate to the high post offense. it seems the team is making the transition quite well. there will always be growing pains, but they were kept to a minimum. granted, the team was able to practice their offense in europe for a series of games which means they dealt with quite a few of their growing pains overseas. in this high post offense i can see jernard jarreau shining. he has guard skills in a big man's body. he will have the ball in his hands quite frequently and will be forced to make decisions. those decisions very well may be better than those of most big men. speaking of jarreau, he had a strong game. maybe he didn't have a statsheet-stuffing game, but he played well. he showed off that he has a great handle for someone his size due to his history as a guard. he can get into the lane with his surprising quickness and dribbling ability to go along with his length. he also uses his abilities in other ways, such as shutting down passing lanes with his aforementioned length and quickness. he does not have great lateral quickness and that will lead to him getting beat off the dribble more frequently than most players. overall it was a good game for him. c.j. wilcox showed how much the team will lean on him this season for scoring. he lead the team in scoring with 22 points and hit four of his five three-point attempts. he showed that he is more than a shooter. he handled the ball in transition, scored inside and distributed the ball (one assist doesn't give his improvement passing justice). he had six rebounds, very important considering the wing-rebounding lost by the departure of ross. andrew andrews is quick. he is going to be a venoy overton-type defender. not a venoy overton-type offender. i hope. he has bought in to romar's ball-pressure defense and will get minutes thanks to that. he can get into the lane and showed off his athleticism on the and-one dunk attempt late in the second half. aziz n'daiye is important to this team. he will be extremely important until"}, {"articleID": "2018101301_00242322_W", "names": {"Rajiv Sharma": ["Q16223440", "Q47532510", "Q57286957"], "Sharad Kumar": ["Q16186757", "Q27069143", "Q37380153"], "Deepak Gupta": ["Q16745252", "Q39073074", "Q48741305"], "Shakeel Ahmed": ["Q24005560", "Q24005561", "Q24005562", "Q24005564", "Q25206235", "Q3527966"]}, "date": "2018-10-13", "url": "http://articles.economictimes.indiatimes.com/news/politics-and-nation/supreme-court-stays-uttarakhand-high-courts-order-banning-religious-outfits-from-issuing-fatwas/articleshow/66189951.cms", "content": "Supreme Court stays Uttarakhand High court's order banning religious outfits from issuing fatwas By Samanwaya Rautray, ET Bureau | Oct 13, 2018, 07.03 AM IST READ MORE ON \"Uttarakhand High Court | Raju Ramachandran | fatwa | Delhi | Constitution of India\" The panchayat, instead of sympathising with the woman, had the audacity to remove the family from the village, \"a division bench of acting Chief Justice <mark>Rajiv Sharma</mark> and Justice <mark>Sharad Kumar</mark> <mark>Sharma</mark> had said. New Delhi: The Supreme Court on Friday stayed a controversial Uttarakhand High Court order which had banned all religious institutions from issuing any fatwas, or diktats or firmans, till it examined the constitutional validity of the issue. A bench led by Justice Madan B Lokur also issued notices to the state government to place its stand formally on the issue. Justice <mark>Deepak Gupta</mark> was the other judge on the bench. The high court had imposed this blanket ban on any kind of orders being passed by any religious institution following a media report that a rape victim's family had been banished from the village under such an order. The case was argued in the top court by senior advocate Raju Ramachandran. The petition was filed by <mark>Shakeel Ahmed</mark> Syed. Fatwas are non-binding advisory opinions provided under Islamic law by a Muslim cleric, the petition filed by the Jamat-e-Ulema-e-Hind said. There was nothing illegal and unconstitutional a b o u t t h e s e, Ramachandran told the top court. The top court has in earlier judgements upheld the validity of these nonbinding opinions, he argued. These are only valid between parties who seek such opinion on any religious iss u e, b u t a r e non-binding, the petition said. The High Court had ruled that no religious body, statutory panchayat or group of p e o p l e i n Uttarakhand can issue a fatwa, because it\" infringes upon the statutory rights, fundamental rights, dignity, status, honour and obligation of individuals \".\" The panchayat, instead of sympathising with the woman, had the audacity to remove the family from the village, \"a division bench of acting Chief Justice <mark>Rajiv Sharma</mark> and Justice <mark>Sharad Kumar</mark> <mark>Sharma</mark> had said.\" Fatwa is nothing but extra-constitutional adventurism, not permissible under the Constitution. \"The High Court had acted on a media report which was brought to its attention by an advocate. The bench had directed that the media report be treated as a public interest litigation and directed that criminal proceedings be initiated against the panchayat members who issued the diktat. In this case the panchayat had ordered that the rape victim's family to be banished from the village of Laskar in Haridwar. The High Court had also asked the police to give protection to the family."}, {"articleID": "2011111014_00078121_W", "names": {"Alejandro Contreras": ["Q21549800", "Q3329566"]}, "date": "2011-11-10", "url": "http://pasadenastarnews.com/ci_19304505?source=rss_viewed", "content": "frank girardot: if it's true then penn state's joe paterno is a disgrace fifteen frustrating years could come to an end for the pasadena high school football team if it stops the run while developing a potent ground game that moves the chains. sweet victory no. 13 in a row could come muir's way if it plays with discipline and utilizes its team speed and versatility on offense. those are the variables the bulldogs and mustangs hope to execute when they meet in the 57th turkey tussle at 7 tonight at the rose bowl. the intense rivalry has been anything but, with muir (5-4, 3-3) winning 14 of the last 15 meetings. the teams tied in 1998 and pasadena has not won since 1995. and with a cif-southern section southeast division playoff berth on the line last season, it was the mustangs who got up for the game and put on a clinic with a 63-6 win. playoff implications once again are on the line, especially for muir. a win by the mustangs all but secures them a spot in the playoffs. a loss puts an abrupt ending to muir's season that was surrounded by hype early after a strong start and a high ranking in the southeast division. pasadena (5-4, 4-2) is all but assured a playoff spot, but the scenario could become hazy depending on what happens in the pacific league between burroughs (5-4, 5-1) and burbank (5-4, 3-3) on friday, as well as the matchup between arcadia (7-2, 5-1) and crescenta valley (6-3, 4-2), also on friday. the bulldogs, however, can't take solace in a likely playoff berth despite a loss. pasadena for too long has been dominated in a rivalry that has dissipated with every lopsided loss through the course of over a decade. school officials said this week the game could draw 13,000 fans, and announced that for the first time parking fees will be charged. but that will do little, if at all, to hold back the large fan bases of each school from attending. pasadena's randy horton has taken giant strides in just two seasons as head coach, elevating the program and turning it into a playoff contender. that the bulldogs were routed in last year's tussle may be perplexing to some given a playoff berth was on the line, but pasadena still was a young team gaining a new perspective from a coach who wanted to change a seemingly losing culture. pasadena has made considerable improvement through the season, particularly on defense. it's there where horton feels the bulldogs need to make the biggest impact if they are to break the muir streak. \"we have to tackle on defense and run to the ball,\" horton said. \"if we play the way we did against cathedral (when pasadena nearly pulled off its biggest upset) and like we did in the second half against crescenta valley, we'll be ok. we have to seize the moment.\" quarterback brandon cox is the focal point on offense for the bulldogs. \"he'll definitely be a concern for our defense,\" muir interim coach dave mitchell said. \"we have to be disciplined in our assignments. our defensive linemen can't push so far up the field that he steps up to the pocket and then bounces out underneath them. it's a matter of staying disciplined and containing him when he rolls out of the pocket.\" marcus green and riian simpson have benefited from cox's rise as one of the premier quarterbacks in the san gabriel valley. cox can sit in the pocket and read defenses, usually running when the pocket collapses or when the defense gives him open lanes. running back cleo bates has the ability, size and speed to go the distance, and he will be instrumental in helping the bulldogs establish the run if pasadena is to have a balanced attack. an offensive line that's a year older and stronger has improved considerably, led by freddy barnes, oscar rojas and <mark>alejandro contreras</mark>. \"we have to sustain blocks and open holes,\" horton said. \"we can't just sit back and throw the ball. you have to be able to run.\" muir's offensive weapons range from josh washington at quarterback to kevon seymour lining up out of the wildcat or freshman darick holmes jr. entering as a backup to bring a different dynamic at quarterback. washington-bound tairen owens is dangerous in the backfield and at wide receiver, and the mustangs will have to find a way to exploit their team speed. \"we realize we have a few options,\" mitchell said. \"offensively we have to get the ball in the hands of our playmakers.\" both teams paid a visit to the rose bowl this week. it seemed routine for muir, but pasadena's horton had one last message for the bulldogs before leaving the stadium."}, {"articleID": "2010032502_00056800_W", "names": {"John Kavanagh": ["Q16730658", "Q3181852", "Q39070984"], "Phil Gordon": ["Q1372396", "Q165803", "Q21248961", "Q7181927"]}, "date": "2010-03-25", "url": "http://statepress.com/2010/03/24/lawmakers-ask-voters-to-end-children%e2%80%99s-program/", "content": "lawmakers ask voters to end children's program joseph schmidt march 24, 2010 at 7:21 pm the fate and funds of a state agency for early childhood development is in the hands of arizona voters this november, and legislators say those funds are necessary to combat the budget crisis. since the 2006 passing of proposition 203, first things first has received more than $480 million from the imposed 80-cent tax increase on cigarettes. two-thirds of those funds sit unspent - money some legislators say could be better utilized elsewhere. however, legislators can't just redirect those funds toward whatever means they wish. they must obtain voters' permission. \"basically, voters chose to create first things first,\" said kristin borns, senior analyst for the morrison institute for public policy. \"by doing that, they generated a funding source just for that agency and passed that by ballot.\" this means that if legislators want to eliminate first things first and transfer its funds into the general fund, the residents of arizona have to vote on the issue. rhian evans allvin, first things first executive director, said voters dedicated this money toward early childhood development and education because it's an important issue. \"it is wrong for the legislature to try and steal money that was set aside by voters,\" allvin said. \"this was money that was never part of the general fund, and was not a cause of the budget crisis.\" reps. <mark>john kavanagh</mark>, r-fountain hills, and rich crandall, r-mesa, both said the money from first things first could be better applied. \"first things first has identified a tax stream for zero-to-5-year-olds - would it be better if that stream could benefit not only them but 6-to-65-year-olds as well?\" crandall said. the money from first things first would be used to finance state-funded programs that are in trouble because of the budget crisis, <mark>kavanagh</mark> said. \"we will be using the money for early childhood programs, like health care and disease screening,\" he said. \"we have a massive shortfall and it's getting worse. to allow hundreds of millions of dollars to sit idly...while we're having to cut vital services makes no sense.\" allvin said there are misconceptions about first things first processes and how they distribute funds. \"on one hand, we're accused of being reckless. the other hand, we're too slow and bureaucratic,\" she said. \"one, we're thorough. we won't stop being thorough. two, the fund balance we have is an intended fund balance.\" allvin said the organization is collecting money in anticipation of a declining revenue stream from the tobacco tax, which has gone down in recent years. that money will be used for long-term goals of the organization. \"to start to be able to prove that young children have different outcomes because of the investments, that's going to take a while,\" allvin said. though legislators have been critical of first things first in the past, crandall recently said they're \"doing good work, good mission,\" while <mark>kavanagh</mark> said it was \"an ambitious, beneficial program when it was introduced.\" however, both men urged voters to eliminate the program. \"there's need-to-have and nice-to-have,\" <mark>kavanagh</mark> said. \"it doesn't make much sense to have the nice-to-haves when your needs are getting cut.\" first things first has offered to loan the state $260 million, and then $300 million, but those offers have been declined. allvin said he will continue to pursue an alternative solution with the legislature. \"we acknowledge there's a huge crisis, and that these are different times than they were,\" allvin said. phoenix mayor <mark>phil gordon</mark> was a proponent of proposition 203 in 2006 and said he continues to support first things first. \"his position has not changed,\" said david leibowitz, spokesman for the mayor. \"it was a good idea in its inception and it remains a good idea today.\" he understands the state is in a difficult position, but the mayor is still of the opinion that protecting children is a \"worthwhile endeavor,\" leibowitz said. \"you take the money out of first things first and put it into the general fund, you will create a set of problems...that you'll need to solve with general fund money,\" he said. \"that money is earmarked for serious problems.\" the issue, however, remains to be decided by voters come november. rc cars and other remote control toys during their free time in tempe. custom mugs all-around tempe to haul their coffee. readers of the state press can find debt consolidation to consolidate all of their student loans and miscellaneous asu student expenses into one monthly payment. credit score when applying for student loans or home mortgages. arizona state students hoping to practice law may want to talk to a"}]