[{"date": "2014-10-12", "url": "http://www.goal.com/en-india/news/138/spain/2014/10/13/5179222/pique-i-had-pain-killing-injections-to-play-through-injury", "content": "The Bacelona defender has cleared up confusion following his appearance for Barcelona 48 hours after leaving the Spain squad through injury last month Gerard Pique admits he had pain-killing injections in order to play through injury. The 27-year-old caused some confusion last month after he appeared for Barca in a Liga match against Villarreal just two days after pulling out of the Spain squad for the games against France and Macedonia. He returned to the national team this week to play the full 90 minutes of Spain's defeat to Slovakia on Thursday and Sunday's 4-0 victory over Luxemburg but says that while his injury is improving, he is still suffering some minor discomfort. \"It's true that I had hip problems, and that is what I let Del Bosque know,\" he told AS. \"In fact, although I play with discomfort I am already much better. What happened was that <mark>Luis Enrique</mark>, who also knew about my situation, felt I was needed by the team to play against Villarreal .\" But I was being treated by the doctors, who prescribed me [the pain-killer] Voltaren, and during the international break I had to receive injections. \"Pique added that his surprise inclusion against Villarreal was simply down to differing opinions between his club and country coaches .\" They both knew how I was and what happened to my hip \", he said .\" [Spain coach Vicente] Del Bosque thought it was best to give me a rest and [Barcelona coach] <mark>Luis Enrique</mark> took the decision to make me play. \"My team needed me and I understood. On other occasions when Spain needed me I have played with pain or physical problems .\" ", "articleID": "2014101223_00030387_W", "names": {"Luis Enrique": ["Q222789", "Q322350"]}}, {"date": "2014-10-13", "url": "http://ajournalofmusicalthings.com/listen-david-bowies-new-song-sue-season-crime/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Published on October 13th, 2014 | by <mark>Alan Cross</mark> Listen to David Bowie's New Song, \"Sue (Or in a Season of Crime)\" A Journal of Musical ThingsWeek 6 in the NFL: Players Still Wearing Beats Headphones Despite League Ban - A Journal of Musical Things Notice Anything Different About Week 5 of the NFL Season? (Hint: Think Headphones) A Journal of Musical ThingsNow We Call It \"EDM .\" That's Just the Latest Label Given to Un-Label-able Music - A Journal of Musical Things", "articleID": "2014101317_00087770_W", "names": {"Alan Cross": ["Q27070265", "Q4706448", "Q4706450"]}}, {"date": "2014-10-13", "url": "http://www.theepochtimes.com/n3/1015660-lakers-news-rumors-2014-kobe-bryant-jeremy-lin-steve-nash-klay-thompson/", "content": "NBA Lakers News, Rumors 2014: Kobe Bryant, Jeremy Lin, <mark>Steve Nash</mark>, Klay Thompson Los Angeles Lakers guard Kobe Bryant, right, drives against Golden State Warriors forward Draymond Green (23) during the first half of a preseason NBA basketball game, Sunday, Oct. 12, 2014, in Ontario, Calif. (AP Photo/Alex Gallardo) Cleveland Cavaliers News, Rumors: Latest on <mark>Kevin Love</mark>, Dion Waiters, LeBron James, <mark>Ray Allen</mark>, Cavs NBA News, Rumors 2014: Thunder, Bulls, Celtics, Mavs, Warriors, Nets, Kings Updates Watch: Lebron James Plays Former Team Miami Heat Full Highlights The Los Angeles Lakers are coming off a horrible loss and a new wave of rumors and news have emerged. Check out the latest buzz below. Kobe Says Lakers Still Getting in Shape Kobe Bryant said after the rough 116-75 loss to the Golden State Warriors on Sunday that the Lakers have been working hard and may have been worn down. \"Kobe says everyone has pretty heavy legs right now, says they've been practicing really hard,\" reported Lakers Nation Serena Winters. \"We practice really, really hard .\" But Kobe believes that the team will be fine once the regular season starts. \"We haven't started tapering down yet,\" he said, reported Lakers reporter Mike Trudell. \"T hinks guys will be more fresh ahead of the regular season. Focus now has been work,\" Trudell said, paraphrasing Bryant. Bryant also praised the Warriors, who he said are an excellent team. They got some phenomenal players over there-that's a problem for some of the top defensive teams in the league to deal with, \"he said. Golden State Warriors guard Klay Thompson makes a gesture after making a three-point shot against the Los Angeles Lakers during the first half of a preseason NBA basketball game, Sunday, Oct. 12, 2014, in Ontario, Calif. (AP Photo/Alex Gallardo) The Warriors have until October 31 to extend Klay Thompson. If not, he becomes a restricted free agent next summer. fan website claims that the Lakers will target Thompson if the contract talks don't work out. The Lakers have expressed interest in Thompson before. The shooting guard had Kobe raving after the first preseason game between the two, saying\" He has the whole package. \"And the Lakers tried to pull off a trade for Thompson earlier this year before the NBA draft. Los Angeles Times said that the Lakers wanted to deal the seventh pick in the draft, which became Julius Randle, for Thompson as part of a three-way trade that would have also involved the Minnesota Timberwolves and <mark>Kevin Love</mark>. The T'Wolves later traded <mark>Love</mark> to the Cleveland Cavaliers for multiple players. <mark>Nash</mark> Injured? <mark>Steve Nash</mark>, the oldest player in the NBA, informed coach Byron Scott that he didn't feel good on Sunday night. <mark>Nash</mark>, 40, asked Scott to take him out of the game .\" Byron Scott said <mark>Steve Nash</mark> told him he was done for the night, said he just didn't feel right, \"Winters said. <mark>Nash</mark>, like Bryant, has dealt with injuries over the last couple seasons. But both have been practicing hard and appeared to be ready for the season. The Lakers are getting thin at point guard, with Jordan Clarkson straining his calf and Jeremy Lin spraining his ankle recently. Both sat out the game against the Warriors, along with Xavier Henry, <mark>Ryan Kelly</mark>, <mark>Ed Davis</mark>, and <mark>Nick Young</mark>. Ronnie Price and Keith Appling are the other point guards currently on the roster. Clarkson will be out until Friday, at least. Jeremy Lin #17 of the Los Angeles Lakers drives down the court against the Golden State Warriors at Staples Center on October 9, 2014 in Los Angeles, California. (Jeff Gross/Getty Images) Lin sprained an ankle at practice on Saturday, and will be evaluated again soon .\" He got up and kind of walked out on his own, but he was in a little pain, \"Scott said, reported the Los Angeles Times. Lin had replaced <mark>Nash</mark> in Thursday's loss to the Warriors, scoring 14 points and adding four assists in 21 minutes. Some believe that Lin should be starting over <mark>Nash</mark>, but it may come to whichever guard is in better condition to start the season .\" In early exhibition you want to see as many guys as you can, \"Scott said .\" Unfortunately for Jeremy, and obviously for <mark>Nick</mark>, it gives other guys an opportunity. \"Scott said that Lin should be ready to play on Thursday against the Utah Jazz. reported ESPN .\" But today he was walking a little gingerly and did some more treatment today. \"Prediction Has Lakers Missing Playoffs A number of season predictions have been coming out and the latest has the Lakers missing the playoffs .\" If everything were to go perfectly for the Lakers this season, it would still be tough to envision a win total of more than 45 games - and even then, that probably wouldn't be enough to reach the postseason in a traditionally loaded Western Conference, \"reported NBC .\" What's far more likely is that Bryant and <mark>Nash</mark> miss time at some point due to injury (whether major or minor), and that the roster simply doesn't have enough from a talent perspective to be able to compete on a nightly basis. A total of 35 wins and another trip to the Draft Lottery feels about right. \"The Lakers have high hopes after acquiring a number of new players, including Lin, Carlos Boozer, and Julius Randle, but will have trouble making it to the playoffs.", "articleID": "2014101318_00005100_W", "names": {"Ed Davis": ["Q1282320", "Q26858558", "Q5334728"], "Kevin Love": ["Q297221", "Q6396801"], "Nick Young": ["Q14949301", "Q28531164", "Q7028182", "Q703908"], "Ray Allen": ["Q208623", "Q2438891"], "Ryan Kelly": ["Q13605944", "Q20641855", "Q20713861", "Q22005766", "Q33744353", "Q7384209", "Q7384212"], "Steve Nash": ["Q16137022", "Q192955", "Q42316961"]}}, {"date": "2014-10-14", "url": "http://www.nj.com/mercer/index.ssf/2014/10/live_report_princeton_discusses_towns_first_post-consolidation_audit.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to comments Live report: Princeton discusses town's first post-consolidation audit PRINCETON - Council is discussing the town's first post-consolidation audit, with a \"corrective action\" resolution on the agenda to address recommendations. The former Princeton borough and township officially consolidated on Jan. 1, 2013. \"Given the complication of bringing two municipalities together, I'm pleased with the results of that audit,\" Mayor Liz Lempert said Monday afternoon. \"There are some items on there in the corrective action plan that will be adopted .\" The audit was conducted by Hodulik & <mark>Morrison</mark> of Highland Park. One recommendation is that the financial accounting software budget module's data entry privileges be reviewed and modified to limit the ability to override controls to authorized personnel. In response to that recommendation, the town said new finance software is in place to limit the ability to override system controls to Kathy Monzo, director of finance, and Sandra Webb, chief financial officer, according to the corrective action resolution. Another recommendation included making sure reports of credit card payments of parking costs be obtained and checked against amounts paid by the card companies to assure all parking revenues are received timely. Princeton said software changes were made at the Bank of America, and \"this is an on-going issue that we are still attempting to resolve,\" according to the resolution. mandatory quarantine issued Friday by state health officials for members of an NBC crew - which includes Princeton resident Dr. Nancy Snyderman - that was exposed to Ebola. Stay with The Times as we provide live updates of the audit discussion. Please be sure to refresh your browser for up-to-the-minute reports. 8:50 p.m. Lempert thanks the <mark>Morrison</mark> and municipal staff for undertaking the \"enormous, enormous task .\" 8:46 p.m. Resolutions pass unanimously to accept the 2013 audit and approve the corrective action plan. 8:35 p.m. <mark>Morrison</mark> said he would not be surprised if this year's audit produces a lot less recommendations because merging the towns' two databases was a large task for staff. 8:30 p.m. Auditor <mark>Robert Morrison</mark> kicks off the discussion, saying any concerns with the report are minor and do not impact the \"fairness of the financial statements\" at a great magnitude. \"By the time we met with management at the conclusion of the audit, several of these matters were corrected,\" <mark>Morrison</mark> said. \"These were not critical issues to the consolidation but they should be and must be addressed .\" \"We're satisfied that if the management implements actions in that corrective action plan, these matters will clear themselves up,\" he said. From local news to politics to entertainment and sports, the twice daily Right Now eNewsletter has all of the New Jersey news you need! Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 New Jersey On-Line LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of New Jersey On-Line LLC.", "articleID": "2014101400_00057527_W", "names": {"Robert Morrison": ["Q10363204", "Q27528639", "Q7347826", "Q7347828"]}}, {"date": "2014-10-14", "url": "http://financialexpress.com/news/ifci-invokes-one-lakh-shares-of-bhushan-steel/1298573", "content": "Raj Thackeray beats Shiv Sena, BJP in online battle for Maharashtra polls While Raj Thackeray rules the online roost...Shiv Sena launches fresh attack on BJP, likens its politics to Mulayam...After nude Aamir Khan PK poster, now it is Anushka Sharma's turn Hrithik Roshan's \"Bang Bang' 2nd weekend box office collections make it 3rd best movie of 2014 Market holiday note: Bombay Stock Exchange (BSE), the National Stock Exchange (NSE), Forex, Money markets closed Bajaj Auto Q2 net profit down 29%; hit by one-time charge on Pantnagar unit Bajaj Auto today reported a net profit of Rs 590.90 crore for...India's exports rose by a marginal 2.73 per cent to USD 28.9 billion in September, but trade deficit...Samsung Galaxy Note 4 launched in India; co's most expensive device priced at Rs 58,300 Samsung Galaxy Note 4 comes with an enhanced S Pen...At some point, we'd like to explore content in Indian languages: BuzzFeed's Scott Lamb Companies woefully unprepared for climate events: Standard & Poor's Malala Yousafzai, Barack Obama girls, Lorde make Time's\" influential teens' list Bhushan Steel said that company's one lakh shares, that were pledged by Singal, have been invoked by IFCI Ltd.. Reuters Summary Financial institution IFCI has invoked one lakh shares of Bhushan Steel that were pledged...Over 1 crore shares of Bhushan Steel promoters invoked in August With Neeraj Singhal in jail, debt-laden Bhushan Steel to explore Rs 2,500 crore asset sale Financial institution IFCI has invoked one lakh shares of Bhushan Steel that were pledged by the debt-ridden company's promoter Neeraj Singal. Singal is also Vice Chairman & Managing Director. In a filing to the BSE, Bhushan Steel said that company's one lakh shares, that were pledged by Singal, have been invoked by IFCI Ltd.. As per the filing, 36,732 shares were pledged on October 7 and 27,330 on October 9. Again 5,059 shares were pledged on October 10, followed by 30,879 on October 13. The CBI in August had arrested Singal in connection with alleged Rs 50 lakh bribery scandal involving CMD of Syndicate Bank S K Jain. Meanwhile, the company has denied that lenders are looking at selling it. \"Bhushan Steel is a standard account. Hence, the question of lenders looking at selling it does not arise in this situation,\" a company spokesperson said reacting to media reports. Flipkart, Snapdeal, Amazon invasion to wallop cell phone retail shops: Technopak Future Group chief Kishore Biyani slams huge Flipkart discounts, joins forces with Amazon India Flipkart counters Future Group's Kishore Biyani, says \"prices determined by sellers not company' Hrithik Roshan's\" Bang Bang' box office collections surge, target Rs 300 cr club Hrithik Roshan's \"Bang Bang' box office collections beat <mark>Salman Khan</mark>'s\" Ek Tha Tiger' Bhupinder Singh Hooda asks people \"not to waste' votes on BJP, INLD Diwali offer: Karbonn prices Android One powered Sparkle 5 at Rs 5,999", "articleID": "2014101416_00085741_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}]