[{"articleID": "2010101600_00044534_W", "names": {"Ali Ahmed": ["Q44749742", "Q4724574", "Q55483636"]}, "date": "2010-10-15", "url": "http://thirdage.com/news/dc9-club-owner-charged-second-degree-murder_10-15-2010", "content": "latest news? dc9 club owner charged with second-degree murder dc9 club owner bill spieler and four of his employees were arrested on charges of second-degree murder friday morning. 27-year-old <mark>ali ahmed</mark> mohammed was found severely beaten outside the northwest d.c. club. he was rushed to howard university hospital and pronounced dead at 3:15 a.m. friday. check out a sample newsletter> however, the club's manager kt robeson claimed that mohammed was merely restrained by the five men. \"whatever he died from had to do with something pre-existing,\" robeson told washington d.c.'s channel 7 news. \"he was not beaten, that is a lie.\" "}, {"articleID": "2019121219_00194904_W", "names": {"Brett Maher": ["Q16731836", "Q2924616"]}, "date": "2019-12-12", "url": "http://www.cbssports.com/nfl/news/cowboys-kai-forbath-ready-to-make-an-impact-after-replacing-brett-maher-lets-go-make-some-kicks/", "content": "CBSSports.com Cowboys' Kai Forbath ready to make an impact after replacing <mark>Brett Maher</mark>: \"Let's go make some kicks' The veteran is ready to get to work, and the Cowboys need him at his best Dec 12, 2019 at 2:37 pm ET • 2 min read Failing to address the issue when they had the chance in April, or even shortly thereafter, the Dallas Cowboys are now hoping against hope they've somehow bucked the odds and found a solution to their kicking woes in mid-December. It took <mark>Brett Maher</mark> missing 10 field goals in his second year with the club for him to finally be dismissed, leaving the team with a 2019 accuracy rate of 66.7 percent, which includes an abysmal 20 percent accuracy between 40-49 yards and 50 percent from 50 yards or more. Enter Kai Forbath, after a successful workout on Monday. Although he lacks the leg strength of his predecessor to boot it from 60 yards out, the 32-year-old does boast a higher career accuracy than <mark>Maher</mark> across distances, and he most recently went 5 for 6 from 50 yards or greater as a member of the Minnesota Vikings in 2017. who was signed this week in <mark>Maher</mark>'s place Plot twist cometh. It's not Forbath's first stint with the Cowboys, having been signed as an undrafted free agent in 2011. Sidelined by injury that summer, he was released and the nod was given to a fellow undrafted rookie named Dan Bailey, who went on to become a legend in Dallas before being replaced by <mark>Maher</mark> in 2018. Bailey now takes up residence for the same Vikings that employed Forbath one year prior to Bailey being cut in Dallas. Forbath's career took a much different arc after 2011, needless to say, going on to play for six different teams--his last being the New England Patriots--before finding his way back to North Texas, and he's bringing with him a career accuracy rate of 85.5 percent and a list of valuable lessons learned.\" Yeah, that's what I learned from college to the NFL, \"Forbath said.\" You have to take every single day serious and treat it like a game and try to get better every day. When you get complacent and take practice for granted, that's when things go bad. \"Even if Forbath is flawless from here on out (doubtful in today's landscape of kickers), it will have only resolved one of the many issues holding the Cowboys back from realizing their full potential in 2019. Sitting at 6-7 and barely clinging onto the NFC East lead, they need to fix everything from coaching issues to inconsistent play calling to disheveled play on the field and lack of takeaways if they're truly going to right the ship and make a possible run into and through the playoffs. Kicking matters, however, as the Cowboys have recently been reminded time and again. To his credit, Forbath, who's been around the block, says the workout was more stressful than kicking in the actual game will be.\" It might be more [pressure in the tryout] actually, \"he said.\" There's very important people watching you kicking each kick. I told my agent I got through the hard part and now let's go make some kicks. \"The potentially good news here is the Cowboys will no longer crutch their offense on the belief they can stroll out <mark>Maher</mark> for a 63-yard kick or a 58-yarder on an opening drive, instead potentially opting to now be more aggressive and push the ball downfield. That's ideally speaking, but whenever Forbath does take the field for his Cowboys debut on Sunday against the Los Angeles Rams, the silence he'll hear will be 100,000 people refusing to breathe until the ball sails through the uprights. And it he whiffs, it'll be 100,000 people calling for his head. But hey, no pressure. Pick Six Newsletter"}, {"articleID": "2017122001_00145643_W", "names": {"Felicity Jones": ["Q16232172", "Q21402730", "Q234447"]}, "date": "2017-12-19", "url": "https://uk.news.yahoo.com/star-wars-prequel-rogue-one-082200001.html", "content": "Star Wars: The Last Jedi has been out for less than a week and has proved rather divisive with some praising it as one of the best franchise entries to date and others disliking the direction that director Rian Johnson has steered the series in. Regardless of your stance on Episode VIII, it's hard to ignore the fact that the film - while immensely enjoyable in many place - is riddled with glaring plot holes and convenient devices which help our rebel heroes out of some pretty sticky situations. One such moment presents itself in a sequence which reveals that the First Order have developed technology that allows them to follow the Rebel Alliance through hyperspace. Convenient, huh? It turns out the First Order has been on the cusp of being able to do this for years - a discovery made by Jyn Erso (<mark>Felicity Jones</mark>) in prequel spinoff Rogue One. Redditor rhodetolove pointed out that in the 2016 film, Erso - while looking for the plans to the Death Star - sifted through the names of other files on the Empire's database, one of which is \"Hyperspace tracking.\" \"They can track us through hyperspace?!\" Hyperspace tracking is actually old tech, as old as the Death Star plans @ CenayangFilm pic.twitter.com/KZtmsoHVM6--Donny Narendra (@ donny_np) December 19, 2017 This throwaway moment lends credence to the fact that Johnson didn't just concoct the plot device to increase the danger for our heroes in The Last Jedi. The name of the film's most intriguing new character - a creation that hints at the future of the franchise under Johnson's guidance - has been revealed. Follow Independent Culture on Facebook"}, {"articleID": "2014102901_00062153_W", "names": {"Stephen Harper": ["Q206", "Q7609425"]}, "date": "2014-10-29", "url": "http://www.miamiherald.com/sports/nhl/article3428124.html#storylink=rss", "content": "Mike unplugged: Dolphins' Wallace rips team's offensive production Job fair planned during Fort Lauderdale International Boat Show Ana Veciana-Suarez: With grandparents, it's twice the love, twice the vulnerability Trailblazing Coconut Grove photographer, Klara Farkas, dies at 103 To place an obituary, please call 305-376-8901 or email Print Gordie Howe's health failing; suffered stroke Sunday Mark Howe told his children: Go see my father, because his health is failing. The message prompted Howe's daughter, Azia, to take her youngest child, Lahna, to see Gordie Howe this past weekend. It may be the last time they do so. Gordie Howe, the Detroit Red Wings legend so synonymous with the sport he became known as Mr. Hockey, suffered a stroke this past Sunday, one day after enjoying a pleasant stroll in Lubbock, Texas, with Azia and Lahna Howe. Gordie Howe has been staying in Lubbock with his daughter, Cathy, and sons Mark, Marty and Murray all spent Tuesday en route to join their sister, and in all likelihood say goodbye to their dad. \"He had a bad stroke a couple of days ago, and I tried to do some FaceTime with him, and he looked really bad yesterday,\" Mark Howe said Tuesday evening during a layover in Denver. \"He's pretty well immobile. It's not good, but at least my daughter spoke to him today, and said she understood a couple of words, which is very encouraging.\" We're keeping our fingers crossed, If anybody can recover, I know Dad can. \"Gordie, 86, suffers from dementia. In September, Mark Howe revealed to the Free Press that Gordie had had a very bad summer, one punctuated by mini strokes.\" The doctor said those mini strokes would gradually get worse and worse, \"Mark said.\" With the type of dementia he has, the long-term outlook is not good. Dad was with me most of summer, and he had a very difficult summer. He had surgery, and that got rid of some of the pain. But he had small strokes, and we were told there were ultimately going to be bigger and bigger ones. That was predicted six months ago. And that's been the case. \"I told my kids earlier this summer, my dad's health not what it should be. That's why my daughter went to Lubbock on Saturday, brought her little 1-year-old. They had a wonderful day, went for a long walk with dad.\" Sunday morning, he had the stroke. \"By this evening, messages of support poured in to the Howe family. Canadian Prime Minister <mark>Stephen Harper</mark> tweeted,\" Wishing my friend Gordie Howe all the best, you're in all of our thoughts and prayers. \"Oops, you haven't selected any newsletters. Please check the box next to one or more of our email newsletters and submit again. Oops, you didn't provide a valid email address. Sports (Monday - Friday) Heat. Dolphins. Marlins. Panthers. Get into South Florida sports with Dan LeBatard, Greg Cote & the crowd. Dolphins Get the latest Dolphins news, stats, injury reports - sent weekdays during the season. College Sports (Monday - Friday) UM & other Florida colleges: Keep up with your favorite teams. 5-Minute Herald (Monday - Friday) The best of the morning's Miami Herald."}, {"articleID": "2018012519_00899134_W", "names": {"Barry Jackson": ["Q15995218", "Q4864344", "Q4864346", "Q4864347", "Q4864348", "Q55619170", "Q809055"], "Tyler Johnson": ["Q17489372", "Q30122141", "Q57423105", "Q7585450", "Q7860052"], "Derrick Jones": ["Q24007463", "Q30122541", "Q5263043"]}, "date": "2018-01-25", "url": "http://www.miamiherald.com/sports/spt-columns-blogs/barry-jackson/article196645549.html#storylink=indep", "content": "What the Miami Heat is doing better than any team in the NBA By <mark>Barry Jackson</mark> Order Reprint of this Story January 25, 2018 02:48 PM A few Heat notes on a Thursday, with Goran Dragic hoping to play against visiting Sacramento on Thursday night but <mark>Tyler Johnson</mark> still out with an ankle injury: ▪ The Heat has done a lot of things well in moving seven games above .500. But there's one thing it has done better than any team in the league, by far: Shooting three-pointers late in close games. Never miss a local story. Sign up today for a free 30 day free trial of unlimited digital access. SUBSCRIBE NOW Even after missing two such shots late against Houston on Monday, Miami is shooting 47.2 percent on clutch threes: 25 for 53. The NBA defines clutch as the final five minutes of games with a margin of five points or fewer. The next-best three-point shooting team in the clutch? The Knicks at 38 percent. By comparison, Golden State is shooting 33.3 percent on clutch threes (20 for 60) and Houston 34.7 percent (17 for 49). Josh Richardson is 5 for 9 on clutch threes, injured Dion Waiters 7 for 13, Goran Dragic and Wayne Ellington 3 for 8. ▪ Two teams can regret giving up on Hassan Whiteside: Sacramento, which waived him in July 2012 (two years after drafting him 33 rd overall), and the Memphis Grizzlies, who released him twice--Oct. 22, 2014 (28 days after signing him) and Nov. 22, 2014 (two days after signing him). The Heat signed him Nov. 24, 2014, and, well, you know the rest. More Videos Goran Dragic talks about the All-Star game snub and the Miami Vice-themed City Edition uniforms, which will make their debut Thursday night when the Miami Heat plays the Sacramento Kings. Manny Navarro mnavarro @ miamiherald.com Kings coach Dave Joerger, who was Memphis' coach at the time the Grizzlies cut him twice, said Thursday morning that he's happy for Whiteside and explained why Memphis released him. \"It was tough on us because with the contract positions and rosters numbers we had, and we had Pau Gasol and Kosta [Koufos], experienced guys in the NBA. In today's game, it's pretty difficult to play him and Marc Gasol together, even though Marc can shoot the three. The game's being played with one big and four guys--you are either a shooter or a playmaker. You must be one or the other.\" Related stories from Miami Herald Does he ever wonder what might have been with Whiteside in Memphis? \"I'm over our win the other night,\" Joerger said. \"Coaches see a little bit shorter views.\" But...\"I'm happy for all those guys--James [<mark>Johnson</mark>], Wayne [Ellington], Hassan--that the Heat rewarded them for their performance and their work ethic. They're a great organization. You cheer for those guys. I'm fired up for them and their family. Hassan is a sweetheart human being. Really enjoyed being around him.\" Joerger was fired by the Grizzlies on May 7, 2016, despite guiding them to the playoffs all three of his seasons, then joined the Kings as coach two days later. ▪ After some growing pains defensively earlier in the season, Heat rookie Bam Adebayo isn't merely a decent defender. More Videos Richardson talked about the effort it took to hold the Bucks to 31.6 percent shooting and pick up the Heat's seventh win in a row. Andre C. Fernandez a1fernandez @ miamiherald.com \"He's much more than that,\" coach Erik Spooelstra said. \"Very good mind and terrific work ethic.\" Players defended by Adebayo are shooting 44.9 percent, compared with 48.1 overall. By comparison, players defended by Whiteside are shooting 46.5, and Kelly Olynyk 49.4. ▪ One of the ways the Heat shrewdly and legally is managing the remaining NBA days for Derrick Walton Jr. (six remaining) and <mark>Derrick Jones</mark> Jr. (nine left) was by having them practice alone--just the two of them--on Wednesday. As a result, that didn't count as a day of NBA service time as part of their two-way contracts that limit the number of days they can spend in the NBA this season. \"It was a little workout; being able to perfect our craft is a great thing,\" <mark>Jones</mark> said. The idea of giving <mark>Jones</mark> a standard contract has been considered internally, but the Heat likely will wait through the Feb. 8 trade deadline before making a move. As far as following all the steps necessary to conserve his days--such as practicing alone or not traveling with the team back from a road trip--<mark>Jones</mark> said: \"I just do what I'm told.\" "}, {"articleID": "2016091500_00115592_W", "names": {"Toby Smith": ["Q3992120", "Q7811889"]}, "date": "2016-09-15", "url": "http://www.springfieldnewssun.com/news/sports/wittenberg-quarterback-ready-for-second-start/nsYLh/", "content": "SPRINGFIELD--The Wittenberg Tigers started with a junior or senior at quarterback for eight straight seasons. Aaron Huffman earned the job as a freshman in 2006 and held it for four years. When Huffman left, junior Ben Zoeller grabbed the reins and started for two seasons. Reed Florence followed Zoeller, starting as a junior and senior. It was the same story with Zack Jenkins, who started in his final two seasons, 2014 and 2015. The Tigers began the 2016 season, however, with a sophomore. Jake Kennedy, a 6-foot-1, 200-pound graduate of Bellefontaine High School, completed 21 of 31 passes for 291 yards and two touchdowns Sept. 3 in a 34-0 victory over Capital. He threw one interception and rushed 12 times for 55 yards and a touchdown. \"It was definitely crazy,\" Kennedy said Wednesday before practice. \"I hadn't (started) in two years since high school. It was so fun. It was like I forgot how fun football was. I'm having a good time. The guys are taking me under their wing and showing me along.\" The Tigers (1-0) had their one off week last Saturday and return to action at 7 p.m. Saturday at Ohio Wesleyan. It's the first of nine straight North Coast Athletic Conference games. \"It's another huge challenge for a young quarterback,\" offensive coordinator Kevin Hoyng said. \"It was good for us to get back and have the week off and really hone on some of the mistakes he made and get back into camp mode.\" Kennedy is eager to improve on his first performance. \"I was happy with how the team did, but there were a few throws I wish I could take back,\" he said. \"I'm not looking to play perfect. The game of football is not that easy, especially being a sophomore. I should have done better, but overall I was pleased with my first performance.\" Kennedy comes from a family of football players. His uncle, Dal McDonald, played linebacker at Bowling Green. His cousin, Dax Notestine, a Bellefontaine graduate, played on the defensive line at Ohio University and is now the director of strength and conditioning there. Kennedy's mom's dad was an offensive lineman at Texas Tech. Kennedy finished his high school career as Bellefontaine's all-time leader in passing yards and touchdown passes. He played his final two seasons under coach <mark>Toby Smith</mark>, a Wittenberg graduate. \"He just had my back where I wanted to go,\" Kennedy said, \"but I think deep down he wanted me to go here just because him and Coach (Joe) Fincham are really tight. I wanted to be close to home. The tradition here speaks for itself. I couldn't get this experience anywhere else.\" "}, {"articleID": "2009091711_00124611_W", "names": {"Juan Carlos": ["Q19943", "Q3325304"]}, "date": "2009-09-17", "url": "http://nbcmiami.com/news/local-beat/Cuban-Mothers-Plea-To-Bury-Stab-Victim-Son-59608837.html", "content": "cuban mother's plea to bury stab victim son slain teen's mom meets with government to ask for travel to us, charges could increase for suspect the mother of the victim of tuesday's fatal stabbing at coral gables high school will meet with cuban authorities this morning to try to secure a visa so she can attend her slain son's funeral. <mark>juan carlos</mark> rivera, will plead for permission from her native cuban government to travel to the us for the services for her teen son who died earlier this week after a violent altercation outside the miami-dade school. rivera, 17, was killed early tuesday morning in the courtyard of the school, stabbed five times with a three-inch blade, according to miami-dade police. classmates have said the fight was over a girl. students describe stabbing aftermath \"the cuban government has to cooperate and authorize the exit from the country for a cuban doctor,\" andy rodriguez, 17, sits in a juvenile detention center, awaiting his next hearing - scheduled for oct. 6 - behind bars after a judge denied his attorney's request for his release yesterday. and the teen, already charged with second degree murder in the stabbing of rivera, could see those charges upped to first degree murder, prosecutors said. \"we will review whether or not this goes to grand jury for a first degree murder or whether it remains a second degree murder,\" said new details were released yesterday that painted a picture of turmoil at the home rodriguez shares with his mother, grandmother, sister and uncle. court documents show police have responded to his house several times for domestic disputes and disturbing the peace, but at least one family member said the teen, who has no criminal record himself, is a peaceful kid. \"he's not violent or anything, if he was, i would have known,\" said uncle felipe caulla. \"too much, i have no logic for it.\" as one family searches for logic, another prepares to bury their son. {\"comments\" : [], \"media\" : {\"ispublictaggingallowed\" : false, \"uploadtoakamai\" : \"\",\" categories \":\" \",\" pathtomedia \":\" 434889_59608837 \",\" admintags \":\" ct_article, sid_434889, sid_434914, sid_434944, sid_519847, sid_519887, sid_519897 \",\" uploadedbyphoto \":\" 116995/icons/defaultmember _ 116995_portrait. jpg? t = 1248875781749 \",\" views \":11,\" uploadedbyname \":\" nbc_editor \",\" isadultcontent \": false,\" updatedat \":\" 17 sep 2009 11:46:47 gmt \",\" country \":\" \",\" pathtopreview48x48 \":\" user/defaultaudio _ 48x48_e. jpg \",\" inappropriateflagcount \":0,\" isratedbyme \":\" f \",\" tags \":\" sad \",\" originalfileformat \":\" \",\" isfavorite \":\" f \",\" userid \":7918858,\" name \":\" cuban mother's plea to bury stab victim son \",\" description \":\" the mother of the victim of tuesday's fatal stabbing at coral gables high school will meet with cuban authorities this morning to try to secure a visa so she can attend her slain son's funeral. \",\" createdat \":\" 17 sep 2009 11:34:31 gmt \",\" isvisible \": true,\" postalcode \":\" \",\" title \":\" cuban mother's plea to bury stab victim son \",\" ispubliccommentingallowed \": true,\" stateorprovincename \":\" \",\" author \":\" \",\" reviewed \": true,\" city \":\" \",\" updatedby \":7918844,\" pathtopreview \":\" \",\" type \":\" externalmedia \",\" uploadtolimelight \":\" \",\" votes \":0,\" averagerating \":0},\" payload_type \":\" json \",\" status \":\" 1 \",\" error \":\" \"} {\"totsize\" :0, \"payload_type\" : \"json\" , \"status\" : \"1\" , \"results\" : [], \"error\" : \"\",\" totpages \":0}"}, {"articleID": "2010031617_00184690_W", "names": {"Joe Lewis": ["Q16185440", "Q268953", "Q712934", "Q942248"]}, "date": "2010-03-16", "url": "http://hindustantimes.com/othersports/Tiger-Woods-statement-on-his-return-to-golf/519886/H1-Article1-519882.aspx", "content": "tiger woods issued a statement on tuesday to announce he will begin his 2010 season at the masters. here's the full text of his statement: \"the masters is where i won my first major and i view this tournament with great respect. after a long and necessary time away from the game, i feel like i'm ready to start my season at augusta. the major championships have always been a special focus in my career and, as a professional, i think augusta is where i need to be, even though it's been a while since i last played. i have undergone almost two months of inpatient therapy and i am continuing my treatment. although i'm returning to competition, i still have a lot of work to do in my personal life. when i finally got into a position to think about competitive golf again, it became apparent to me that the masters would be the earliest i could play. i called both <mark>joe lewis</mark> and arnold palmer and expressed my regrets for not attending the tavistock cup and the arnold palmer invitational. i again want to thank them both for their support and their understanding. those are fantastic tournaments and i look forward to competing in them again. i would also like to thank the augusta national members and staff for their support. i have deep appreciation for everything that they do to create a wonderful event for the benefit of the game.\" comment note: by posting your comments here you agree to the europe: £ 23m bid to create world's first \"safe' cigarette"}, {"articleID": "2017070608_00351785_W", "names": {"John Paul": ["Q1701359", "Q6252169"], "Andrzej Duda": ["Q28354405", "Q9151911"], "Piotr Wilczek": ["Q51457828", "Q7197024"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2017-07-06", "url": "http://fox8.com/2017/07/06/watch-live-president-trump-visits-poland-ahead-of-tense-meeting-with-world-leaders-in-germany/", "content": "WARSAW, Poland--Republican presidents have been drawn to Poland ever since Ronald Reagan worked with Pope <mark>John Paul</mark> II and the Solidarity movement to help usher in the Eastern European country's democratic political system. And President Donald Trump, who landed in Poland Wednesday night. Poland's affinity for the United States is rooted in Reagan's actions to counter the USSR and truly blossomed when his successor, George H.W. Bush, helped orchestrate a soft landing for the country as it left the Soviet bloc. Despite welcoming Bill Clinton twice to great fanfare, the actions approved by Reagan and Bush created an affinity for the United States, in general, and specifically Republicans. Ties to the United States dipped during President Barack Obama's time in office. Obama's close ties with German Chancellor Angela Merkel--and his view that Germany was the heart of a collective Europe--raised suspicions in Poland, where Germany's power has long been viewed skeptically. Poland's relationship with Obama grew so fraught in 2012 that Republican presidential challenger Mitt Romney traveled there during the campaign to highlight, among other issues, the president's relationship with an ally. Obama's record in regard to Poland was mixed. Obama initially scrapped Bush-era plans to deploy ground-based missile defense systems to Poland and the Czech Republic. He later approved an anti-missile platform in Poland and delivered American troops to the country near the end of his presidency. But by the time those troops arrived to help NATO, the view of Obama as a pro-German leader was cemented. A Pew survey in 2014 found just 50% of Poles had confidence in Obama, one of his lowest ratings in Europe. \"Poland is the most pro-American country in the world--including the United States,\" Michael Mandelbaum, a professor emeritus at Johns Hopkins University, was quoted as saying after a 2003 trip to the country. The sentiment in Poland is changing, though. With populist tides rising--as evidenced by the election of nationalist President <mark>Andrzej Duda</mark>--Poles are now looking inward for leadership, cautious of both Russia to its East and the European Union and Germany to the West. Trump's presidency, however, may turn that feeling on its head. Trump has so far done little to combat Russian President Vladimir Putin's meddling into the 2016 election in the United States and Trump's own advisers are struggling to convince him that Russia still poses a threat, according to multiple senior administration officials. Trump, who will meet with Putin Friday after visiting Poland, will deliver an address to the Polish people on Thursday, as well as meet with <mark>Duda</mark> and speak to the leaders at the Three Seas Initiative, a project that aims to unite Eastern Europe through energy infrastructure. Trump may find a partner in his Polish counterpart, though. <mark>Duda</mark> rose to power in 2015 on the back of nationalist, anti-immigrant sentiment, not dissimilar to Trump's 2016 election win. Both Trump and <mark>Duda</mark> have been publicly skeptical of international organizations, with the Polish president worrying European Union diplomats with some fractures he is causing in Poland's relationship with the union. And local media have been reporting that <mark>Duda</mark> and his conservative Law and Justice Party promised people close to Trump sizable crowds for Trump's visit, particularly for his speech to the Polish people at the Warsaw Uprising Monument, a memorial in honor of Poles who rose up to fight Nazis in 1944. Even though relations with Poland have changed since Reagan, Republicans in particular have long viewed the former Soviet bloc nation as a pro-America haven in Europe, a country that has been welcoming to Republicans at times of relative unpopularity around the continent. Top White House aides said ahead of Trump's trip to Poland that the President plans to highlight the United States' ties to the country. \"The main message is that America is with you, America understands that its interests align with the interests of the Polish people, and we are determined to do our best to work together on our common priorities and our common interests,\" H.R. McMaster, Trump's national security adviser, said about his visit. Polish leaders said ahead of Trump's visit that now is the time for solidarity against Russia. \"President Donald Trump's visit to Poland is in my opinion truly taking place at a crucial moment in history. The threat that Russia poses cannot be overstated,\" said Polish Ambassador to the US <mark>Piotr Wilczek</mark>. \"Now is the time for allied solidarity and President Trump's decision to visit Poland so early in his presidency underscores the importance of our region to the US administration and the transatlantic community as a whole,\" he added. Nixon to Romney Every president since Richard Nixon--except for Reagan--has visited Poland, a feat not many European countries can boast. Nixon became the first US president to visit Poland when he traveled to Warsaw in 1972. The two-day visit was extraordinary for the Polish people, who lined the streets of Warsaw with signs like \"Nixon rescue Poland.\" By traveling to the then-communist nation, Nixon became the first president since Franklin D. Roosevelt to visit a country behind the Iron Curtain. It was Reagan's support of Solidarity, the anti-bureaucratic labor union founded by Lech Walesa in 1980, that truly won early support for American Republicans in Poland. George H.W. Bush's trip in 1989, including a speech to the Polish National Assembly, was a seminal moment for US-Polish relations. Bush met with Walesa on the trip, but his greatest contribution may have been how he modeled a different style of politics to the Polish people. Poles were fascinated at the difference between Bush and their old Soviet leaders when photos emerged of the American president running through Łazienki Park in Warsaw. President George W. Bush continued to foster a relationship with Poland during the Iraq and Afghanistan wars, where Polish soldiers participated in both missions. Bush traveled to Poland three times in his eight years as president. During a presidential debate against Democratic Sen. <mark>John Kerry</mark>, Bush even held Poland up as an example of his ability to build a coalition around the war in Iraq. \"Well, actually, he forgot Poland,\" Bush said at one point. Republican presidential nominee Mitt Romney visited Poland during the 2012 presidential election. \"Our nations belong to the great fellowship of democracies. We speak the same language of freedom and justice,\" Romney said during his visit. \"I believe it's critical to stand by those who have stood by America.\" Changing times Though Poland participated in the Iraq and Afghanistan wars, the conflicts grew unpopular over time. Only 58% of Poles polled in the Pew Research Global Attitudes and Trends survey released at the end of the Obama administration said they believed he would do the right thing regarding world affairs. Trump's rating is a dismal 23%. Apprehension toward the United States could also be associated with <mark>Duda</mark>'s nationalist rise. <mark>Duda</mark> has some refugee requirements imposed by the European Union, signaling he and his party will be skeptical of lawmakers in Brussels and more interested in their own success. <mark>Wilczek</mark>, Poland's ambassador to the United States, told reporters that the country remains committed to the North Atlantic Treaty Organization, especially because of Article 5, the principle that an attack on one NATO country is an attack on all NATO countries. \"We would like to hear that every day from the President of the United States and from actually leaders of all other NATO countries,\" he said. \"As far as Russia is concerned, what is important for us in NATO deterrence.\" Trump, McMaster said, will highlight Poland's historic ties to the United States and herald the country as one of America's \"staunchest allies.\" During his visit, the President is also expected to tout recent sales of liquified natural gas to Poland, highlighting the need for a Poland that is energy independent from Russia. \"It is a country that has partnered with us and had been a great ally during combat missions in Afghanistan and in Iraq, as well,\" McMaster said. \"And so...the President will emphasize themes about the past, what Poland has gone through as a nation, what they've achieved to fight to be part of Europe.\" 52.229676 21.012229"}, {"articleID": "2011110601_00028652_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Christopher Graham": ["Q21165674", "Q5112420"], "Tom Watson": ["Q263802", "Q532111", "Q7002019", "Q7818002"]}, "date": "2011-11-06", "url": "http://bucksherald.co.uk/news/national-news/cameron_told_to_reveal_flat_costs_1_3221545", "content": "published on sun nov 06 00:48:07 gmt 2011 <mark>david cameron</mark> has been told he must reveal further details about the refurbishment of his downing street flat under the freedom of information act. information commissioner <mark>christopher graham</mark> has ruled that the prime minister must disclose what work was done on the bathroom to the apartment at number 11, where he lives with his wife samantha and their three children. it emerged earlier this year that the camerons had spent the entire? 30,000 budget available to prime ministers annually for upkeep and improvements to his downing street flat. officials stressed that the costs charged to the taxpayer did not cover furniture, fixtures and fittings, but things such as electrics, plumbing, structural alterations and decorating. additional costs in the refit beyond the? 30,000 publicly funded allowance were met by the family. labour mp <mark>tom watson</mark> has been asking the cabinet office for details of the changes to the bathroom and any instructions given to contractors by mr and mrs <mark>cameron</mark>. the sunday telegraph disclosed that, having rejected the request, the cabinet office has now been told by mr <mark>graham</mark>'s office that he \"does not accept\" its decision. \"in particular the commissioner considers it unlikely that planning for refurbishment works at downing street would take place without the involvement of the cabinet office as the relevant government department,\" he said. the commissioner also raised concerns about delays in responding to mr <mark>watson</mark>'s request, which was submitted in june last year. mr <mark>watson</mark>, the shadow cabinet office minister, said: \"downing street is a grade one listed building and one of the jewels in the nation's crown. taxpayers have a right to know what the temporary residents are doing to such a historic building.\" a number 10 spokesman said mr <mark>graham</mark>'s letter had been received. aston clinton family loses battle with council over illegal extension two men taken to hospital after serious car crash near aylesbury aston clinton family loses battle with council over illegal extension bucks nhs trust pays tribute to sir jimmy, the man who made famous spinal injuries unit possible temperature: 7 c to 12 c wind speed: 22 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 9 c to 12 c wind speed: 17 mph temperature: 9 c to 12 c wind speed: 12 mph temperature: 9 c to 13 c wind speed: 14 mph temperature: 9 c to 14 c wind speed: 16 mph"}]