[{"date": "2014-10-15", "url": "http://news-sentinel.com/apps/pbcs.dll/article?AID=/20141015/NEWS/141019829", "content": "Related Community effort launched to aid Ebola fight in West Africa As Ebola continues to affect various parts of the world, including the United States, many wonder if there is enough help on the way to combat the outbreak and, if so, where donation dollars are going and how to help. In Fort Wayne, the effort to support the Ebola crisis is strong. Various localized efforts, like the church-based campaign by Mike and Kathy Doscek reported in The News-Sentinel today, have connected small local organizations with international relief organizations to help raise money and make an impact. The Doscek's and their church, St. John's Lutheran Church in Lake Township, are partnering with Direct Relief International, a nonprofit, nonpartisan organization that provides medical assistance to people around the world who have been affected by crisis. Tony Morain, vice president of marketing and development of Direct Relief International, said the organization has been working in West Africa for many years addressing the failing healthcare system, and as soon as the first cases of Ebola was reported, they ushered in their local, trained emergency responders and began sending tons of medical supplies. \"Our model is one where we work with locals within the community. There are real people that are responding to the needs in their communities. Then when an emergency happens, they become the immediate emergency responder. We built relationships with these people and then we are able to respond quickly when things are difficult,\" he said. He also said the timeliness is highly consequential when it comes to halting the spread of the virus. \"If collectively we could have gathered enough support and donations two months ago we would not be faced with this challenge. In terms of the problem of this scope, we do not have just one organization that can do it alone. People need to work together. We have been sending ongoing shipments every two weeks, and that includes the largest airlift of supplies to the region to date. As the crisis continues, it becomes more and more difficult to get supplies there. We need to maintain our support but as each day passes, it's more critical,\" he said. Depending on the fundraising organization, money raised will go toward transportation, medical supplies, waste disposal, training and sending emergency response workers. Locally, in addition Doscek campaign, the Catholic Diocese of Fort Wayne-South Bend is encouraging people to donate to the Catholic Relief Services, the U.S. bishops' overseas relief and development agency. Recently, the group has increased its support in affected countries and spent $376,000 toward training volunteers and religious leaders, providing hygiene kits and making household visits in Guinea, Liberia, Sierra Leone and Ghana. For those interested, the US Agency for International Development has put together a list of 37 non-governmental organizations that are working on the Ebola crisis, with direct links for how to donate to them online. Check out the list by visiting: http: //www.cidi.org/ebola-ngos/ #.VBBv7S5dXIV. While local efforts are relatively strong, the worldwide fundraising efforts are lackadaisical. <mark>Patrick Rooney</mark>, associate dean for academic affairs and research at the Indiana University Lilly Family School of Philanthropy in Indianapolis, said, in terms of the fundraising efforts, results have been shockingly small compared to larger scale disasters such as natural disasters. \"For whatever reason, this topic has not captured the same attention. My theory is because very few Americans have contracted the disease and it's mostly centered in West Africa. The mainstream media has been more focused on the American angle and not the total calamity in West Africa,\" he said. And the numbers of the total calamity are staggering. Wednesday, the World Health Organization reported there have been 8,914 cases overall, including the fatal cases. The WHO said it expects this number to top 9,000 by the end of the week. The organization also warned that West Africa could face up to 10,000 new Ebola cases a week within two months, adding that the death rate in the current outbreak has risen to 70 percent. In the U.S., a Dallas nurse who caught Ebola while treating a Liberian patient received a plasma transfusion donated by a doctor who beat the virus. Nina Pham, a 26-year-old nurse, was among 70 staff members at Texas Health Presbyterian Hospital who cared for Ebola victim Thomas Eric Duncan, according to medical records. And health workers have been hit the hardest by the virus, which is spread by contact with bodily fluids like blood, vomit and diarrhea. Doctors Without Borders said 16 of its employees had been infected with Ebola and nine of them have died. Experts note that there's an immediate demand for medical care and education, as well as long-term help dealing with the ripple effects such as orphans and stabilizing an already troubled economy. <mark>Rooney</mark> reiterates that for those wanting to donate, monetary donations to well-known and legitimate organizations and charities are the best option. \"If people want to donate, there are organizations locally, nationally as well as internationally that would be happy to accept donations. This is an opportunity to help something or someone,\" <mark>Rooney</mark> said.", "articleID": "2014101511_00087983_W", "names": {"Patrick Rooney": ["Q26261010", "Q33522416", "Q50326815"]}}, {"date": "2014-10-15", "url": "http://upi.com/Top_News/US/2014/10/14/Oklahoma-newspaper-publisher-wife-daughter-slain-in-home/1001413313626/?spt=hts&or=3", "content": "Oklahoma newspaper publisher, wife, daughter slain in home The publisher of two weekly newspapers in Oklahoma, his wife and daughter were found slain in their home in Duncan, police said. The bodies of John Hruby, 50, his wife, Katherine \"Tinker\" Hruby, 48, and Katherine, 17, were found by a housekeeper Monday morning. Investigators believe they were killed late Thursday or early Friday. \"It is a homicide...It may well be a day or two or three before we really know exactly what all was going on,\" Stephens County District Attorney Jason Hicks said late Monday. Hruby sold the Duncan Banner in 1997. He returned to weekly newspapers with the purchase of the Marlow Review in 2007 and the Comanche County Chronicle last year. <mark>Mark Thomas</mark>, executive vice president of the Oklahoma Press Association, Legal problems plagued family in Bell, Florida for years Oregon governor's fiancée Cylvia Hayes admits to pot growing Gunpowder residue detected on Vonderrit Myers' hands, t-shirt and jeans © 2014 United Press International, Inc.. All Rights Reserved. Any reproduction, republication, redistribution and/or modification of any UPI content is expressly prohibited without UPI's prior written consent. Oregon governor's fiancée Cylvia Hayes admits to pot growing ABOUT UPI Since 1907, United Press International (UPI) has been a leading provider of critical information to media outlets, businesses, governments and researchers worldwide. UPI is a global operation with offices in Beirut, Hong Kong, London, Santiago, Seoul and Tokyo. Our headquarters is located in downtown Washington, DC, surrounded by major international policy-making governmental and non-governmental organizations. UPI licenses content directly to print outlets, online media and institutions of all types. In addition, UPI's distribution partners provide our content to thousands of businesses, policy groups and academic institutions worldwide. Our audience consists of millions of decision-makers who depend on UPI's insightful and analytical stories to make better business or policy decisions. In the year of our 107th anniversary, our company strives to continue being a leading and trusted source for news, analysis and insight for readers around the world. Privacy Policy © 2014 United Press International, Inc.. All Rights Reserved. UPI.com is your trusted source for world news, top news, science news, health news and current events.", "articleID": "2014101511_00093139_W", "names": {"Mark Thomas": ["Q15273374", "Q1900455", "Q25184467", "Q48360466", "Q50147826", "Q57143303", "Q6767708", "Q6769973", "Q6769975", "Q6769976", "Q6769978", "Q6769980", "Q8835918"]}}, {"date": "2014-10-15", "url": "http://mercurynews.com/education/ci_26725430/sunnyvale-principal-court-seeking-stay-away-order-against", "content": "SAN JOSE--Schools trustee Chris Stampolis put his hand together with a finger outstretched like a gun and walked menacingly toward a middle school principal who wanted to talk to him about picking up his son on time, the principal testified Tuesday. The account of threatening behavior, not only toward Peterson Middle School Principal Susan Harris but also toward Superintendent <mark>Stan Rose</mark> and others, emerged in a hearing in Santa Clara County Superior Court. Harris is seeking to make permanent a temporary restraining order granted Sept. 24 against Stampolis, 48. \"He was angry and he was yelling and he was really pissed off,\" Harris said. As Stampolis moved closer, she said, \"I could feel his breath on my face ....I put my hands up .\" Santa Clara Unified School District's Board of Education board member Christopher Stampolis during a board meeting in the district board room in Santa Clara, Calif. on Thursday, May 30, 2013. (Nhat V. Meyer/Bay Area News Group) (Nhat V. Meyer) She said she was afraid the visibly enraged Stampolis was going to hit or push her. Stampolis' gestures were caught by a campus security camera. Harris' attorney, Eugene Whitlock, introduced still photos from that recording. But Stampolis' attorney, Tomas Margain, suggested instead that his client had been signaling Harris to \"put it in writing\" by simulating a paper and pencil with his hands. \"People do it in restaurants,\" he said. More than 40 people, including former superintendents, principals, teachers and parents attended the hearing to support Harris, who said the interactions and lack of immediate direction from the Santa Clara Unified School District sent her to the emergency room in September with anxiety. Sunnyvale police Officer Todd Fekete and <mark>Brian Allen</mark>, a security guard hired by the school district, also talked with Stampolis, Harris testified. On Sept. 23, when Stampolis arrived on campus 40 minutes after school let out, the guard handed him a 14-day stay-away order from Peterson. During their conversation in the school office, Stampolis' son sat nearby, apparently doing his homework. Immediately afterward, Stampolis, an attorney, drove to the Sunnyvale Department of Public Safety to try to have his son file a complaint against Harris, alleging false imprisonment. \"I felt this was another example of being harassed,\" Harris told the court. \"I felt like my job safety was at risk .\" Fekete testified that he told Stampolis that there was no merit to the false-imprisonment charge and would not take a report. Stampolis also filed a harassment claim against Harris. The school district hired an independent investigator, Thomas Newcomb, who cleared her of the accusation, she testified. Stampolis was elected to the Santa Clara Unified school board two years ago. To support Harris' request, Whitlock introduced documents indicating that Stampolis: Last month threatened <mark>Rose</mark>, telling him, \"I'm going to inflict as much pain as I can on you and your wife,\" Whitlock said. Threatened a parent who criticized his behavior at meetings of a school-site council. \"Stampolis got in her face and threatened to sue her,\" Whitlock said. Was the subject of a Peterson staff petition presented last month to the board to protest unsafe working conditions because of fear of Stampolis. Publicly accused another middle school principal of keeping a hidden bank account. A school district investigation cleared the principal and also showed a letter detailing the allegation was written by Stampolis but was signed by someone else. Followed home in his car a Santa Clara High junior who last year criticized Stampolis and other board members at a meeting. Whitlock also mentioned a 2006 case in Los Angeles. A clerk at a storage facility won a $35,000 settlement with Stampolis for aggressive, intimidating behavior. Judge Thomas E. Kuhnle refused to permit the playing of the 911 tape in that incident. Controversy has followed the public life of Stampolis, who previously served on the West Valley-Mission Community College District board. Last year, Santa Clara teachers angry at him staged a work slowdown. In 2012 former Santa Clara administrators and trustees who served with him took out ads opposing his candidacy. After his election, administrators who felt targeted by him left the district. In a telephone interview last month, Stampolis acknowledged that he may have been late a couple of times picking up his son since school started in August. Peterson requires that students leave campus or be picked up within 20 minutes of the end of the school day. But Stampolis also said that Newcomb's report will contradict the charges. \"All the staff concluded that I was cordial and pleasant to all staff,\" Stampolis said. The case was continued to Thursday afternoon with testimony from witnesses and with cross-examination.", "articleID": "2014101516_00000771_W", "names": {"Brian Allen": ["Q25190022", "Q27983414", "Q30122545", "Q4962957", "Q4962958", "Q55605910"], "Stan Rose": ["Q19517739", "Q7597862"]}}, {"date": "2014-10-15", "url": "http://scotsman.com/news/scotland/top-stories/world-s-end-trial-friend-saw-accused-with-teens-1-3574140", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online Annie Lennox slams mood of post-indyref Scotland Viking treasure hoard found in Scotland SNP, Greens slam TV debate plans amid court threat Keane let Celtic team-mates trash Man Utd club car Ukip to target \"rust belt' seats in Scotland SNP, Greens slam TV debate plans amid court threat Scottish independence: Thousands at Glasgow rally Rumour Mill: Virgil van Dijk | Scotland | Lennon Rumour Mill: Anya injury | Scotland | Neil Lennon Rumour Mill: Scotland | Celtic | Hibs | Hearts World's End trial: Friend\" saw accused with teens' A FRIEND of two teenagers killed in 1977 has told a court she saw the man accused of their murders with them in the pub where they were last seen alive. Jackie Thomson identified Angus Sinclair as one of the two men she saw with Christine Eadie and <mark>Helen Scott</mark> at the World's End pub in Edinburgh. Keep up to date with all aspects of Scottish life with The Scotsman iPhone app, completely free to download and use. Sinclair, 69, has pleaded not guilty to assaulting, raping and murdering the 17-year-olds between October 15 and 16 1977 between the pub and locations in East Lothian. Ms Thomson, who was with the girls on the night they went missing and were killed, was giving evidence on the third day of Sinclair's trial at the High Court in Livingston. She told the court that she and another friend, Tony, had left Christine and <mark>Helen</mark> in the World's End in the company of two men at around 10.45 pm on Saturday October 15, 37 years ago. Prosecuting, Lord Advocate Frank Mulholland said Ms Thomson had been shown a series of 12 photographs of men by the police in 2004. Mr Mulholland said she was shown the images to see if she could identify anyone who was one of the males she saw with the girls in the pub in 1977. Pointing to Sinclair, he told the court Ms Thomson had identified the accused. He asked: \"How sure were you that this person on photo K, Angus Sinclair, was one of the two male persons?\" Ms Thomson replied: \"In 1977 he looked quite a lot different - younger than that. It is hard to say because I had seen photos in the newspapers .\" Mr Mulholland asked her to answer the question directly, stating: \"How sure were you?\" * Please type the postcode as the example above Try The Scotsman app for 30 days free! View the latest news and sport or download full editions of the newspaper to read offline. Search for Scotsman.com in your Android or iOS app store today. Newspaper subscribers get free unlimited access to the app. Contact us If you wish, you can contact us using any of the methods below. clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. The Scotsman provides news, events and sport features from the Edinburgh area. For the best up to date information relating to Edinburgh and the surrounding areas visit us at The Scotsman regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2014101519_00079065_W", "names": {"Helen Scott": ["Q16227550", "Q26906899", "Q43392691", "Q43395889", "Q5703119"]}}, {"date": "2014-10-17", "url": "http://www.courant.com/sports/hc-on-the-fly-1017-20141016-story.html?track=rss", "content": "ew York Knicks power forward Amar' e Stoudemire reacts during the second half against the Miami Heat at American Airlines Arena. Red wine soothes the body. So says Amar' e Stoudemire, and so says anyone who might have a glass or two at the end of a long day. Stoudemire, however, hasn't been drinking in an effort to return to form with two surgically repaired knees. He's been bathing in it. He told reporters after Knicks practice, \"It allows me to create more circulation in my red blood cells. Plus, it's very hot, so it's like a hot tub. But it's also the red wine - just kind of soothes the body .\" ...Speaking of booze: Imagine how many people in the Kansas City area called in sick Thursday? The Royals have kept their postseason perfection party rocking right into the World Series. With a sweep, players and fans have plenty of time to recover and recharge ....Kevin Durant, meanwhile, says he'll be bathing in white wine. No, just kidding. The reigning MVP did have surgery on his fractured right foot, though. He'll be out at least six weeks. The Patriots sent out a Throwback Thursday tweet with a picture of <mark>Mark Sanchez</mark>'s infamous \"butt fumble .\" That, of course, would have been more appropriate if <mark>Sanchez</mark> was still with the Jets, whose spelling is apparently on par with their play-calling. In advance of Thursday's game in Foxborough, the Jets put out a highlight video with the message \"RIVARLY RENEWED .\" ...Connecticut's representation at the World Series might be on camera as much as anyone involved in the fall classic. The difference between former Clippers owner Donald Sterling (banned from the NBA and forced to sell the team in the aftermath of racist comments) and new owner Steve Ballmer? \"Steve is a good dude,\" Blake Griffin wrote in a piece for The Players' Tribune. \"He's like a cool dad who gives you candy. Donald was like a weird uncle .\" ...The UConn men, who won the national title for the fourth time last season, start out as No. 15 in the USA Today/Coaches preseason poll. No. 1? Kentucky, which, of course, was No. 2 when it mattered most in April. Arizona, Duke, Wisconsin and Kansas round out the top five ....Classy move by the Cromwell High cross country team, which has raised $500 to be donated to Komen Connecticut's breast cancer awareness and prevention campaign ....Rutgers football player", "articleID": "2014101703_00011683_W", "names": {"Mark Sanchez": ["Q15991558", "Q15991574", "Q6769581", "Q946184"]}}, {"date": "2014-10-17", "url": "http://zeenews.india.com/news/sci-tech/3-wild-bears-found-dead-in-odisha_1486268.html", "content": "Berhampur: Three wild bears were today found dead at Somanathapalli village in Ganjam district, about 90-km from here. Forest officials recovered the carcass of an adult female bear of about 20-year-old and its two male cubs, around two-and-half-year of age on the outskirts of the village located in the vicinity of a reserve forest. \"The animal bodies are decomposed. We suspected they died on Wednesday. The death of the animals, however, came to our notice today,\" said forest ranger Sarat Chandra Mishra. Though the exact reason of the death of the wild bears was not known, the forest officials suspected that the animals might have died either due to the electrocution or poisoning, he said. Local veterinary doctors conducted the post-mortem. Since the death of the bears was surrounded in mystery, the veterinary doctors also taken the viscera of animal for laboratory test, he said. NSG officials seize large stockpile of explosives, hand grenades Exit polls project BJP as single largest party in Maharashtra, Haryana Exit Poll: BJP emerges as the largest party in Maharashtra, Haryana - Part II Lyricist <mark>Santosh Anand</mark>'s son Sankalp <mark>Anand</mark> commits suicide along with wife Companies given 6 months to wind up can't be stopped from mining coal: SC Exit polls project BJP as largest party in Maharashtra, Haryana-Part 2 Assembly Election: Heavy voting in Maharashtra and Haryana - Part II With 25 sixes, 35 fours, James Tull slams 341 runs in limited-overs cricket! Pakistan is capable of inciting violence in Kashmir, says Musharraf Opinion divided in Maharashtra; clear edge to BJP in Haryana: Exit Polls India successfully launches IRNSS-1C navigation satellite on board PLSV C-26 SC grants bail to Jayalalithaa; AIADMK activists break out in celebrations Hong Kong's CY Leung defends police even as brutality video goes viral Sourav Ganguly confident of India defending Cricket World Cup title Al Qaeda-ISIS may launch joint terror attack on India: NSG chief India vs West Indies - Live Score: Virat Kohli hits ton as India post 330; tourists struggling on 223/7 Assembly polls: Record 73% voting in Haryana, Maharashtra sees over 64% turnout Maintain peace, law and order, don't criticise judgement: Jaya to cadres Burdwan blast case: We have no problem with NIA probe, says Mamata Banerjee", "articleID": "2014101716_00039570_W", "names": {"Santosh Anand": ["Q15696890", "Q56994518"]}}, {"date": "2014-10-22", "url": "http://interaksyon.com/article/97724/inside-malacaang-complex-3-places-to-visit-for-a-charming-date-with-history", "content": "Inside Malacañang Complex, 3 places to visit for a charming date with history Air conditioned jeepneys by Jeepney Tours provide transportation for the Malacañang Complex can let you discover history and culture the place has to offer. Photo by Romsanne Ortiguero, InterAksyon.com. One might be intimated walking along the Malacañang Complex in San Miguel District because of the tight security measures implemented inside. However, there is a wealth of unique finds inside the complex that can fill your mind with newfound historical and cultural knowledge; as well as fill your stomach with gustatory treats. A day tour of the whole complex can give you a glimpse of Baroque architecture and artworks by national artists; a taste of Spanish-Filipino dishes; a review of history; and a sight of the nation's seat of power, the Malacañang Palace. Some members of the press got to experience the San Miguel Tour, and hopping us to various destinations is a 20-seater air conditioned jeepney with videoke by The jeepney, with friendly and informative staff, brought passengers to the following destinations inside the complex: 1. San Miguel Church Built in 1603, the Church of San Miguel centered on the mission to minister to Japanese Christian converts. It was in 1986 when the church became a National Shrine for the Archangels dedicated to St. Michael and the archangels. \"It is the only church in the whole world dedicated to the seven archangels,\" shared Bro. Gil Santos, Parish Pastoral Council president. Interior of San Miguel Church at the Malacañang Complex in Manila. Photo by Romsanne Ortiguero, InterAksyon.com. Apart from its rich history in the Catholic faith, San Miguel Church is also notable for its baroque architecture. Meanwhile, another church inside the complex is the St Jude Church which has been popular for devotees with petitions. 2. Presidential Museum and Library One of the galleries inside the Presidential Museum and Library containing campaign paraphernalia of previous presidential candidates. Photo by Jericho San Miguel for InterAksyon.com. The Presidential Museum and Library offers a rich learning experience regarding the history of the official residence and principal workplace of the country's highest official, the president. Located at Malacañang Palace's Kalayaan Hall, the museum and library contains archives, works of art by national artists, and other paraphernalia that traces the history and evolution of the palace. Just a reminder, interested individuals must fill up a reservation form seven working days before the preferred date of the tour. Those who are not included in the list will not be allowed inside the palace's premises. Festive chicken relleno at Casa Roces. Photo by Romsanne Ortiguero, InterAksyon.com. One way to end the tour is to conclude it with a sumptuous meal with a relaxing ambiance, and a taste of food that gives you a feeling of being at home. Casa Roces, located along J. P, Laurel and Aguado streets, is a resto-café that offers hearty Filipino-Spanish dishes. During the press visit, the restaurant owners presented sample dishes that are part of their new Christmas package. The set included Mixed Green Salad with your own choice of dressing, Lentejas Soup, Assorted Breads, Pork Conchinillo Con Salsa, Lengua Estopado, Beef Pot Roast, Chicken Relleno, Maya Maya with Cherry Tomatoes, Oven Roasted Vegetables, and Paella Rice served with a refreshing glass of Sangria Te. The holiday meal ended on a sweet note with a serving of baked Cherry Walnut Cheesecake. Meanwhile, adding to the memorable dining experience is the cozy interior of the resto-café. Built in the 1930s, this heritage house of the Roces family has recently undergone refurbishments that marries the nostalgic feel of the heritage house with a contemporary look. A cozy corner of one of the function rooms of Casa Roces. Photo by Romsanne Ortiguero, InterAksyon.com. According to Maria Elena Carlos, Casa Roces' Senior Restaurant Manager, the restaurant's best selling classics are mainly heirloom recipes of the Roces family made with a twist and modern interpretations. Supersize Sisig at Big Bite! The Northern Foodfest opening in Pampanga \"WEEKEND CHEF | Easy pasta and crepes recipes from the Maginhawa Street Food Festival\" CHOW BUZZ | After QC's Maginhawa St., it's Bacolod's Lacson St. for the Masskara Festival this weekend \"CHOW BUZZ I Spotlight on Filipino food at the Lifestyle Asia Gala\" GALLERY | More photos at the First Maginhawa Street Food Festival \"Big boost for business as Maginhawa Street Food Festival draws 10,000 people Manila FAME's 60th edition spotlights top local and foreign designers\" <mark>James Cousins</mark>' Murakami dance pieces finds the tender in the dark side \"\"Disrupt': Filipina Women's Network launch book on Pinays as global leaders Fashion designer Oscar de la Renta dead at 82\" STYLE SMARTS | Gorgeous giving rings: Patty Laurel Filart collaborates with Elena Bautista \"STYLE SMARTS | How the fashion and beauty biz is fighting breast cancer\" VIDEO | <mark>Kim Jones</mark>, Rags2Riches unveil \"Ampersand' for Fall/Winter 2014\" #BOYCOTTBENCH | Netizens react to Coco Martin walking woman on a leash in fashion show, Bench apologizes \"Kickstart pursuing your dream job at Sunsilk's Dreamstarter Fair, October 3 Inside Malacañang Complex, 3 places to visit for a charming date with history\" Microtel at UP Technohub embraces booming IT and commercial biz CHOW BUZZ | After QC's Maginhawa St., it's Bacolod's Lacson St. for the Masskara Festival this weekend Style Smarts by Ronna Capili-Bonifacio STYLE SMARTS | Gorgeous giving rings: Patty Laurel Filart collaborates with Elena Bautista Down South by Jona Branzuela Bering Inkcanto by Ramil Digal Gulle INKCANTO | Glorious golden concert for prima ballerina Lisa Macuja-Elizalde Reflection by Rev. Fr. Christian B. Buenafe, O. Carm REFLECTIONS | Jesus on paying taxes to the emperor: \"Give what is due to God' Remoto Control by Danton Remoto REMOTO CONTROL | Attention, students! First semester blues and how to survive it Ninja Mama by Ninj Reyes-Abay NINJA MAMA | Raising kids on rock music-6 ways to keep it positive Money Works by Rowena C. Suarez MONEY WORKS | Make protecting your income part of your New Year's resolutions Guy Stuff by Kap Maceda Aguila GUY STUFF | Riding the digital wave through the Samsung experience WEEKEND CHEF | Easy pasta and crepes recipes from the Maginhawa Street Food Festival FAMILY LIFE | Finding the naked truth on positive body image and your kids Nomad's Lens by Erwin Mascarinas", "articleID": "2014102202_00008462_W", "names": {"James Cousins": ["Q27923980", "Q30092908"], "Kim Jones": ["Q25249302", "Q30122482", "Q6408927", "Q6408928", "Q6408929", "Q6408931", "Q6408932"]}}, {"date": "2014-10-23", "url": "http://www.tradersmagazine.com/news/regulation/sec-rejects-non-transparent-etfs-in-active-manager-setback-113023-1.html", "content": "SEC Rejects Non-Transparent ETFs in Active Manager Setback (Bloomberg)--The U.S. Securities and Exchange Commission rejected plans by BlackRock Inc. and Precidian Investments to open a new type of exchange-traded fund that wouldn't disclose holdings daily, setting back efforts to bring more actively managed ETFs to market. SEC, in preliminary decisions announced yesterday, denied BlackRock's September 2011 and Precidian's January 2013 requests for exemptive relief from the Investment Company Act of 1940. The move puts on hold plans by the firms to start the first non-transparent ETFs. The Precidian proposal falls \"far short of providing a suitable alternative to the arbitrage activity in ETF shares that is crucial to helping keep the market price of current ETF shares at or close\" to its net asset value, <mark>Kevin O'Neill</mark>, a deputy secretary at the The ruling hinders plans by asset managers to sell funds run by traditional stock-picking managers in an ETF package. Firms including Capital Group Cos. have asked for similar regulatory approval as they seek to expand offerings in the fastest-growing product in the asset-management industry. Money managers have been discouraged from introducing active ETFs, which combine security selection with the intraday trading and some of the cost-saving features of traditional ETFs, because the SEC's requirement for daily disclosure of holdings would make it easy for competitors to copy, and traders to anticipate, a manager's portfolio changes. \"We want to work with the SEC--we believe it's part of the process,\" Daniel McCabe, Precidian's chief executive officer, said in a telephone interview. \"We're not surprised by the fact that they have questions, but questions can be answered .\" ETF providers must disclose holdings every day to enable market makers to execute trades that keep the share price in line with the underlying value of the fund's assets. Firms including BlackRock, Precidian and Guggenheim Partners LLC proposed structures that they say would allow the funds to remain priced in line with assets, without revealing specific positions. T. Rowe Price Group Inc. in Baltimore and Boston's Eaton Vance Corp. are also among fund firms seeking SEC approval for non-transparent active ETFs. None of the applications has been approved. \"We are still pursuing our own proposal to offer non - transparent active ETFs,\" Heather McDonold, a spokeswoman for T. Rowe, said in a telephone interview. Melissa Garville, a spokeswoman for New York-based BlackRock, and Ivy McLemore, a spokesman for Guggenheim, declined to comment. Robyn Tice, a spokeswoman for Eaton Vance, and Elizabeth Bartlett for State Street Corp. didn't immediately respond to an e-mail and telephone messages seeking comment. BlackRock was one of the first U.S. fund managers to ask the SEC for approval, after spending three years crafting the product. Their leading role in seeking approval for a non - transparent active ETF has spurred excitement within asset management for the product's prospects, according to Todd Rosenbluth, director of mutual-fund and ETF research at S & P Capital IQ in New York. Mark Wiedman, BlackRock's global head of its iShares ETF unit, said in May that the firm was confident the products would work, \"but we don't actually think it will be much of a commercial opportunity .\" ", "articleID": "2014102313_00002057_W", "names": {"Kevin O'Neill": ["Q28149212", "Q3195781", "Q3195782", "Q3814839", "Q6397152"]}}]