[{"date": "2014-10-23", "url": "http://ktvn.com/story/26875662/at-1-all-world-series-moves-to-quirky-giants-park", "content": "meta content = \"2014-10-23 17:59:20\" > 911 calls show chaos after Delaware tour bus crash 911 calls show chaos after Delaware tour bus crash Emergency calls made by passengers and passing motorists capture the chaos, fear and confusion in the aftermath of a tour bus crash in Delaware that left three people dead. Emergency calls made by passengers and passing motorists capture the chaos, fear and confusion in the aftermath of a tour bus crash in Delaware that left three people dead. meta content = \"2014-10-23 17:39:20\" > CDC details new Ebola response and prep teams New federal Ebola response squads - likened to public health SWAT teams - are being readied to rush to any U.S. city where a new Ebola case might be identified, officials say. New federal Ebola response squads - likened to public health SWAT teams - are being readied to rush to any U.S. city where a new Ebola case might be identified, officials say. meta content = \"2014-10-23 16:19:21\" > Theater shooting prosecutors agree to trial delay Theater shooting prosecutors agree to trial delay Prosecutors say they would agree to push back the trial for the man charged in the Colorado theater shootings so defense attorneys can have more time to review his sanity exam. Prosecutors would agree to push back the trial for the man charged in the Colorado theater shootings so defense attorneys can have more time to review his sanity exam, according to court filings released Thursday. meta content = \"2014-10-23 17:09:21\" > Woman who stabbed pencils in eyes sues over photo Woman who stabbed pencils in eyes sues over photo A woman who stabbed pencils in her eyes during a suicide attempt is suing Los Angeles County, claiming her photo was snapped at a hospital and went viral online. A woman who stabbed pencils in her eyes during a suicide attempt is suing Los Angeles County, claiming her photo was snapped at a hospital and went viral online. meta content = \"2014-10-23 13:49:15\" > Driver attacked after ice cream truck kills boy Driver attacked after ice cream truck kills boy Authorities say a 7-year-old boy riding a motorized bike was hit and killed by an ice cream truck in South Los Angeles and residents then attacked the driver. An ice cream truck ran over and killed a 7-year-old boy riding a motorized bike in South Los Angeles and residents then attacked the driver, authorities said. A Maine mother who's using social media to have her son's ashes scattered all over the world has sent him on his greatest journey yet: to space. A Maine mother who's using social media to have her son's ashes scattered all over the world has sent him on his greatest journey yet: to space. meta content = \"2014-10-23 13:49:14\" > Prosecutors: Michigan girl meant to kill family Prosecutors: Michigan girl meant to kill family Prosecutors say a 15-year-old Michigan girl stabbed her 12-year-old brother and conspired to kill other family members so she could run away with her 23-year-old boyfriend. A 15-year-old girl accused of stabbing her younger brother as part of a plot to kill her family so that she could run off with a 23-year-old man appeared in a suburban Detroit courtroom Thursday, where a judge set her bond...meta content = \"2014-10-23 15:19:18\" > US journalist returns home after Ebola recovery An American video journalist who recovered from Ebola is home in Rhode Island. An American video journalist who recovered from Ebola is home in Rhode Island. meta content = \"2014-10-23 08:59:05\" > Massive cheating scandal at UNC involved athletes Bogus classes and automatic A's and B's are at the heart of a cheating scandal at the University of North Carolina that lasted nearly two decades, encompassing about 3,100 students - nearly half of them...Bogus classes and automatic A's and B's are at the heart of a cheating scandal at the University of North Carolina that lasted nearly two decades, encompassing about 3,100 students - nearly half of them athletes. meta content = \"2014-10-23 15:59:26\" > Eric Frein lookalike: I've been stopped repeatedly Eric Frein lookalike: I've been stopped repeatedly A northeastern Pennsylvania resident said he's been stopped and questioned more than 20 times by authorities who have mistaken him for a man sought in the killing of a state trooper, including one encounter at...Dancing priests become Internet sensation Dancing priests become Internet sensation as singing nun releases first album Dancing priests become Internet sensation as singing nun releases first album Obama expresses optimism about Ebola in US Obama says he's cautiously more optimistic about Ebola situation in US Obama says he's cautiously more optimistic about Ebola situation in US North Korean detainee reunites with family in Ohio American detained half a year in North Korea returns to Ohio, has tearful reunion with family American detained half a year in North Korea returns to Ohio, has tearful reunion with family One American released from North Korea, two remain American detainee released in North Korea; two others remain American detainee released in North Korea; two others remain Indiana serial murder suspect arrested Police in Indiana say deaths of 7 women could be serial killing; suspect hints at more victims Police in Indiana say deaths of 7 women could be serial killing; suspect hints at more victims Dallas nurse with Ebola transferred to Maryland Obama names Ebola \"czar' to run widening US response to the disease as criticism mounts Obama names Ebola\" czar' to run widening US response to the disease as criticism mounts Sources: Biden son out of Navy after drug test AP sources: Biden's son discharged from Navy Reserve after testing positive for cocaine Quiet \"whiz kid' from New York suburb, CDC's Frieden now the public face of US Ebola fight Quiet\" whiz kid' from New York suburb, CDC's Frieden now the public face of US Ebola fight US still searching for credible allies in Syria Bombs not enough: US faces a heavy challenge in building an anti-IS Syrian ground force Second Texas nurse tests positive for Ebola; woman flew home from Cleveland before falling ill AP Baseball Writer SAN FRANCISCO (AP) - Eric Hosmer is eager to see what makes San Francisco's waterfront ballpark unique. \"I know absolutely nothing,\" the Kansas City first baseman said. \"I've heard nothing but good things about it, the atmosphere and the energy the crowd brings. I've always wanted to play there .\" \"I'm sure going for the first time for a World Series game, it should be fun,\" he said. Well, wait until he trips over a bullpen mound chasing a foul ball. Or a teammate loses a fly in the mist that wafts above shallow center. Or those swirling winds turn a routine popup into an all-out scramble. Who knows? Might even get a crazy carom off that odd-shaped brick facade on the right-field wall, resulting in the first Series inside-the-park home run since 1929. Yep, loads of fun. Hosmer, <mark>Alex Gordon</mark>, Mike Moustakas and most of the Royals will get their first look at quirky AT & T Park during a workout Thursday. Then it's on to Game 3 on Friday with Kansas City and the Giants tied at 1-all. Tim Hudson starts for San Francisco against Jeremy Guthrie. The Royals' only trip to San Francisco came in 2005 and they took two of three. Buddy Bell was the manager, Tony Graffanino batted third and Jeremy Affeldt was in the bullpen. The 35-year-old Affeldt now pitches for the Giants and came on in relief Wednesday night in a 7-2 loss. He said he figured the Royals could handle the new park. \"That's an athletic team over there. So I think they can make adjustments. I don't think we'll go in thinking that they're at a disadvantage because of not being at our ballpark,\" he said. About one-third of the Royals have played at AT & T Park with other teams. Of the most frequent visitors, Josh Willingham has hit .352 with five homers in 16 games and Omar Infante has batted .307 in 19 games, STATS said. Among the pitchers, Guthrie did fine in two starts and Jason Frasor made two relief appearances. Outfielder Lorenzo Cain played one game at the stadium in 2010 when he was with Milwaukee. The AL Championship Series MVP plans to practice with coach Rusty Kuntz to \"work on my angles and see how the park plays .\" \"It's kind of a work in progress and a wait-and-see type thing,\" Cain said. Good luck, Giants designated hitter <mark>Michael Morse</mark> said. \"It's a big park; right field is tricky. The wind does a lot of different things in the outfield, so our guys are used to it,\" he said. \"It's tough. It's tough out there. But everybody's a professional. I don't think it will be a factor,\" he said. One thing will change, for sure. With no DH in the NL park, <mark>Morse</mark> and Kansas City's <mark>Billy Butler</mark> will lose their spots - <mark>Morse</mark> drove in a run during a 7-1 win in the opener, while <mark>Butler</mark> already has three hits and a pair of RBIs. With tight foul ground, gusts that whip off McCovey Cove, twilight starts and pesky seagulls that hover around in the late innings, a lot of balls become adventures in San Francisco. In 2007, <mark>Ichiro Suzuki</mark> hit the first inside-the-park home run in an All-Star game when his shot off the right-field wall took a weird ricochet. There have been nine inside-the-parkers in World Series play. Lou Gehrig and Casey Stengel are on the list, and Mule Haas of the Philadelphia Athletics hit the last one in 1929. Plus, postseason is frequently a weather adventure in the Bay Area. Players need to pack for all sorts of conditions - short sleeves, hoodies, hats and gloves. During the NLCS, Giants manager Bruce Bochy said the teams played in the toughest winds of the season. Right fielder Hunter Pence had no chance trying to track a fly ball by St. Louis' Kolten Wong that landed for a triple. \"You play this game, you play in a lot of different ballparks and you find a way to adjust,\" Pence said this week. \"I think everyone's going to enjoy it .\" Moustakas was looking forward to the trip. Raised in Southern California, the Royals third baseman has seen AT & T Park only on television. \"I don't know anything about it,\" he said. \"It looks like a beautiful park. I've always wanted to see it, and this is a great opportunity to go there .\" ___ AP Baseball Writer Janie McCauley contributed to this report. The Reno-Sparks Convention Visitors Authority's board members say they like the job their CEO is doing and they're willing to put their money where their mouth is. The RSCVA board voted Wednesday to reward authority president and CEO Chris Baum with a 16 percent bonus worth nearly $37,000. The Reno-Sparks Convention Visitors Authority's board members say they like the job their CEO is doing and they're willing to put their money where their mouth is. The RSCVA board voted Wednesday to reward authority president and CEO Chris Baum with a 16 percent bonus worth nearly $37,000. meta content = \"2014-10-22 18:41:57\" > Game Wardens Seek Information on Six Elk Shot, Left to Rot Game wardens at the Nevada Department of Wildlife are seeking the public's help to solve the illegal killing of at least six elk, including four cows and two calves, in two different incidents in Lincoln County. Game wardens at the Nevada Department of Wildlife are seeking the public's help to solve the illegal killing of at least six elk, including four cows and two calves, in two different incidents in Lincoln County. meta content = \"2014-10-22 23:29:39\" > Reno Police Arrest Man for Unlawful Contact With a Minor Reno Police have arrested a man they say approached young girls riding a bicycle in the area of Damonte Ranch. Reno Police have arrested a man they say approached young girls riding a bicycle in the area of Damonte Ranch. meta content = \"2014-10-23 11:52:35\" > Opponents of Question 3 Spend Over a Million Dollars Corporations and business interests are digging deep to fund a drive to defeat a Nevada ballot measure that would tax commerce to fund education in a state near the bottom nationwide in per-pupil spending. A Center for Public Integrity analysis made public Thursday finds opponents of Question 3, the Education Initiative, have spent more than $1.2 million on television ads. Corporations and business interests are digging deep to fund a drive to defeat a Nevada ballot measure that would tax commerce to fund education in a state near the bottom nationwide in per-pupil spending. A Center for Public Integrity analysis made public Thursday finds opponents of Question 3, the Education Initiative, have spent more than $1.2 million on television ads. meta content = \"2014-10-22 20:43:17\" > Reno police officers practiced the PIT maneuver on Wednesday. It causes a suspect's vehicle to spin out during a pursuit - and reporter <mark>Paul Nelson</mark> got a firsthand look. KTVN-TV Phone: (775) 858-2222 Fax: (775) 861-4298", "articleID": "2014102318_00013300_W", "names": {"Alex Gordon": ["Q16025008", "Q16136145", "Q25352122", "Q37583452", "Q4717069", "Q4717072", "Q997395"], "Billy Butler": ["Q2747753", "Q4912305", "Q4912309"], "Ichiro Suzuki": ["Q27997082", "Q57064719", "Q5986296", "Q600"], "Michael Morse": ["Q1093315", "Q6832934"], "Paul Nelson": ["Q21062490", "Q7152694", "Q7152695"]}}, {"date": "2014-10-24", "url": "http://www.stanforddaily.com/2014/10/23/anita-speaking-truth-to-power-screened-at-title-ix-conference/?utm_source=rss&utm_medium=rss&utm_campaign=anita-speaking-truth-to-power-screened-at-title-ix-conference", "content": "A Tale of Two Transfers Dylan Fugel dives into the to divergent paths of the past two Stanford quarterback transfers, Brett Nottingham and David Olson Back and forth with OSU Daily Barometer With the Oregon State game rapidly approaching, the Daily's Winston Shi talked about the matchup with the OSU Daily Barometer sports editor TeJo Pack Our talented staff of editors, writers and photographers form the hub of Stanford-related news, the voice of the student body and a window into the Farm for a broad print and digital audience. Scene from \"Anita: Speaking Truth to Power .\" Courtesy of American Film Foundation. Like many political events of the past few decades, Anita Hill's 1991 testimony before the Senate's Committee on the Judiciary can be recognized from a few token soundbites. Hill, then an attorney-advisor to Clarence Thomas, accused Thomas of sexual harassment preceding confirmation hearings for his nomination as Associate Justice of the Supreme Court. Hill passed a polygraph test; Thomas declined, calling it a \"high-tech lynching for uppity blacks .\" According to the film \"Anita: Speaking Truth to Power,\" this phrase is a grossly misleading caricature of a difficult case. The original hearing was televised on October 12. As a nod, it seems, both to the anniversary of Hill's hearing and the recent controversy surrounding Title IX rights on campus, Stanford University sponsored a two-day conference from October 16 to 17 with Hill, now a professor at Brandeis University. The conference featured a new documentary and workshops on Hill's hearing and sexual harassment in the workplace. \"Anita: Speaking Truth to Power\" was screened on October 16 at Paul Brest Hall, with a Q & A with Professor Hill afterwards. Director Freida Mock's documentary is a compilation of interviews with Hill and her colleagues and footage from the original hearing. Throughout the film, the audience is granted glimpses of a woman who remained remarkably poised while under attack from members of Congress. In the course of the film's commentary, Hill's friends point out the imbalance of demographics at the trial's outset. The Senate Judiciary Committee was homogeneously white and male (a much younger Joe Biden presided over the proceedings). Gender and race were hot-button topics that received only a cursory evaluation - the film commits a number of blundering inquiries to memory. In an interview, <mark>John Carr</mark>, a friend of Hill's, underscored the invisible consequences of the trial. \"She paid the price,\" said <mark>Carr</mark>. \"She could've been a judicial nominee .\" The film highlighted the committee's bouts of targeted questioning, most of which required that Hill reiterate embarrassing details of her encounters with Thomas, seemed designed to make her sound absurd. Hill's quiet resilience provided a foil for Thomas's fiery rebuttals. \"I think that this today is a travesty,\" said Thomas during his testimony, in reference to the hearing in whole. He proceeded to categorically reject every accusation against him - the phrase \"high-tech lynching\" was used during this opening salvo. \"He played the race card,\" said <mark>Carr</mark> of Thomas's phrasing. The focus of the trial promptly turned away from sexual harassment and towards race. For this reason, perhaps, Thomas was cleared for his hearing and confirmed as a justice by a vote of 52-48, the narrowest margin to date. Hill returned to her teaching position at the University of Oklahoma soon after the trial. Today, Hill speaks on sexual harassment, using her experiences as a vehicle. She engaged the audience in a Q & A session following the film screening. One female audience member expressed her shock at the blatant rudeness of committee members' questions: \"Has anyone apologized?\" Hill's response was at once illuminating, disappointing, and inspiring. \"No, no apologies,\" she said. \"[In] Washington, apologies are easy - they don't mean anything. What I want is action .\" She described her faith in the younger generation of female leaders and politicians, young women who could use her experience to move forward. Event Details CALLING ALL VIDEOMAKERS! CreaTV San Jose announces the Call for Entries for the 2014 CreaTiVe Awards. Videomakers from the Bay Area and Santa Cruz are invited to submit videos and TV shows [...] CALLING ALL VIDEOMAKERS! CreaTV San Jose announces the Call for Entries for the 2014 CreaTiVe Awards. Videomakers from the Bay Area and Santa Cruz are invited to submit videos and TV shows for competition in one or more of 10 categories at www.creatvsj.org through November 15, 2014. Finalists announced 12/8. Winners announced 1/10/15. Winners receive valuable prizes. Questions? Tips? Contact Pam Kelly at (408) 295-8815 ext. 307 or pam.kelly @ creatvsj.org. Time October 10 (Friday) - November 15 (Saturday) Reserved seating $15 / 20 20% discount for Stanford alumni, employees, and students 1:30 p.m. Science showcase 2:30 p.m. CCRMA performance Stanford University's Center for Computer Research in Music and Acoustics (CCRMA, pronounced \"karma\" ) has been on the scene of electronic and computer-generated sound, since, well, before there was a scene. We are proud in 2014 to be celebrating three important moments in the history of CCRMA and of computer music: founder John Chowning's 80th birthday; the 50th anniversary of the first computer music program on campus (in the form of a stack of punch cards); and the 40th anniversary of CCRMA.", "articleID": "2014102403_00004096_W", "names": {"John Carr": ["Q37372878", "Q37731921", "Q47546431", "Q55938805", "Q6225265", "Q7307535"]}}, {"date": "2014-10-24", "url": "http://lethbridgeherald.com/news/local-news/2014/10/24/securities-trial-adjourned-again-due-to-health-concerns/", "content": "dshurtz @ lethbridgeherald.com A trial for three men facing numerous charges under the Alberta Securities Act won't conclude this week as expected. Although one of the accused, Rand Stevenson, testified Monday in Fort Macleod, the trial had to be adjourned after co-accused Brent Derricott was unable to attend court Tuesday due to an ongoing battle with a foot infection. It's the second time the trial has been adjourned because of Derricott's health; the first adjournment was Sept. 15 when Stevenson, Derricott and Robert Smylski were scheduled to begin their defence. <mark>Don Young</mark>, chief litigation counsel for the ASC, said Thursday he's prepared to delay the case in deference to Derricott's illness, but not indefinitely. \"At some point we need to continue the trial,\" he said. The three men face some 62 charges under the Alberta Securities Act relating to unauthorized trading in securities. Stevenson, 63, and Derricott, 62, are charged with trading in OCI Q Corp. securities without registration or a prospectus and making misleading or untrue statements to investors. Smylski, 64, is charged with failing to comply with a previous order by the Alberta Securities Commission. Only Stevenson is represented by a lawyer. The ASC alleges that $1.2 million was raised between 2009 and 2011 from more than 50 investors through loan agreements with six-month terms, with the promise of returns of up to 150 times the loan amount. The funds were purportedly to be used to obtain the release of a billion-dollar inheritance connected to the late president Ferdinand Marcos of the Philippines. The Crown says many investors, who have not seen any of the promised returns on their money, had no idea their money was being used to cover the accused's personal expenses. Defence insists, however, investors have not been misled and the project is not a sham. During Monday's hearing much of Stevenson's testimony covered the project itself and information about the project contained in a binder. Defence successfully argued to have the contents of the binder placed under a publication ban. Careers Print Advertising: (403) 328-4410 National Advertising: (403) 380-7585 Online Advertising: (403) 380-7585 Classifieds: (403) 328-4433", "articleID": "2014102406_00031391_W", "names": {"Don Young": ["Q1239590", "Q20922240"]}}, {"date": "2014-10-27", "url": "http://www.eatsleepsport.com/hull-city/bruce-hails-jakupovic-1830241.html", "content": "Hull boss Steve Bruce has hailed the performance of Eldin Jakupovic after the goalkeeper put in a fine display at Liverpool. Hull have been hit hard by injuries, not least in goal with Allan McGregor and <mark>Steve Harper</mark> out, providing the opportunity for the Swiss Jakupovic to come in. The keeper grabbed his chance with both hands, pulling off a number of fine saves to help the Tigers earn a point in a 0-0 draw at Anfield. He also denied Mario Balotelli right at the death to leave Bruce singing his praises. \"I would expect him to make those saves but, to be fair to the kid, he has waited a long time,\" Bruce said. \"It is not easy being the third-choice goalkeeper .\" The corners were raining in from Steven Gerrard and he stood up to the task of it. Maybe 18 months ago he found that a struggle. He will remember that, he has kept a clean sheet at Anfield. \"Meanwhile, Bruce was also pleased to have collected another good point after last week's draw against Arsenal .\" When you come to Liverpool, like the Emirates last week, you have to make sure you play well, \"he added .\" If you play well and take something it is excellent for a club like ours, and where we have been, and what is expected. So we are very pleased with it. \"", "articleID": "2014102708_00054671_W", "names": {"Steve Harper": ["Q312117", "Q7612771"]}}, {"date": "2014-10-27", "url": "http://www.nola.com/movies/index.ssf/2014/10/chris_rocks_top_five_movie_tra.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to Chris Rock's \"Top Five\" started getting noticed from the moment it premiered in September at the Toronto Film Festival, but not just because it's funny. We already knew Chris Rock is funny. Rather, it's because he doesn't just act in \"Top Five .\" He wrote and directed it, too--making its warm reception that much more impressive. It's actually Rock's third time in the director's chair. (You can be forgiven for forgetting 2003's \"Head of State\" and 2007's \"I Think I Love My Wife,\" both of which he also wrote .) But the third time appears to be the charm, at least if early reviews are any indication: In his review, Variety film critic Scott Foundas said he saw shades of classic Woody Allen in \"Top Five .\" Granted, Foundas also saw some vintage Farrelly brothers at work there, too, which suggests a bit of a stylistic mishmash--but one that boasts an early 92 percent approval rating on movie-review aggregator RottenTomatoes.com. Fans will get to see for themselves on Dec. 5, which is when Paramount Pictures is scheduled to release \"Top Five\" into theaters. In the meantime, check out the recently released trailer for Rock's film in the embedded video above. It gets the nod as today's Movie Trailer of the Day. Below, find the description of the film--which also includes appearances by such Rock pals as Adam Sandler, <mark>Tracy Morgan</mark> and Jerry Seinfeld--that accompanied its Toronto Film Festival run. h1> Now Playing Get the latest news, reviews, trailers and up-to-date listings for movies playing in local theaters. Delivered Friday afternoons. Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 NOLA Media Group. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of NOLA Media Group.", "articleID": "2014102717_00055645_W", "names": {"Tracy Morgan": ["Q14542", "Q27119857"]}}, {"date": "2014-10-28", "url": "http://paddocktalk.com/news/html/modules.php?op=modload&name=News&file=article&sid=266354&newlang=&topic=39&catid=67", "content": "2014 Martinsville II (Chase 7): NASCAR Sprint Cup - Sunday Notebook Dale Earnhardt Jr Wins At Martinsville As Calamity Strikes Chase Favorites 2014 Martinsville II (Chase 7): NASCAR Sprint Cup Race Results - Earnhardt Jr, Chevrolet Win! 2014 Malaysian GP (Sepang): MotoGP Race Results - Marquez Wins! Equals Doohan's Record Posted by: newsla on Oct 28, 2014 - 06:12 AM 2014 IHRA Hot Rod Champion <mark>Tony Jones</mark> Only this time, there was much, much more at stake. <mark>Jones</mark> secured his second ever victory in IHRA competition at the IHRA Summit Racing Equipment World Finals at Memphis International Raceway earlier this month, clinching the Hot Rod World Championship in the process when he bested Fowler for the second time in as many tries during the Summit Racing Equipment Tournament of Champions presented by AMSOIL. With a championship on the line, <mark>Jones</mark>, a newcomer to IHRA competition, bested Fowler with a .024 reaction time paired with a 10.911-second pass in the 10.90 index class at 140.39 mph while Fowler, who had been spot-on all afternoon, ran a tick too quick with a 10.898 at 142.81 mph. The win gave <mark>Jones</mark> a championship in his first season out with the IHRA after finishing third in Division 4, capping off what can only be described as a dream season for <mark>Jones</mark>. \"I have pinched myself a couple of times, but it still really hasn't sunk in just yet that I won it,\" <mark>Jones</mark> said. \"All afternoon I just took it a round at a time. After every round we kept thinking it is just three more rounds, just two more rounds and then just one more round. In the winner's circle, my buddy looked at me and simply said\" zero more rounds' and it sort of clicked that we had just won it. \"After a long afternoon that included wins over the best-of-the-best in IHRA's Hot Rod category, the irony did not escape <mark>Jones</mark> as he went up against Fowler for the second time this season in Memphis .\" I really didn't think I could beat him twice. The first time we went to Memphis and beat him, he treed me. This time he stuck me in the left lane and I ended up treeing him. It was a great race, there were a lot of nerves, but the good Lord took the anxiety away from me and we were able to get the win, \"<mark>Jones</mark> said. <mark>Jones</mark>' afternoon included wins over two divisional champions and a divisional runner-up after he himself barely managed to hold on to a spot in the field. <mark>Jones</mark> entered the final race of the divisional season as the points leader in Division 4, but two poor showings plummeted him to third in the standings - the cutoff point to make the tournament. But in Memphis, <mark>Jones</mark> proved he belonged. Driving his bright yellow '67 Camaro, <mark>Jones</mark> bested Joe Tillman, Dakota Lowery and Ricky Roe to secure his place in the finals. All three rounds proved a challenge, with <mark>Jones</mark> using a .003 light to overcome Tillman's 10.915 in round one and a near-dead on 10.902 with a .009 light was needed in the semifinals to best Roe's 10.907 with a .009 tree, moving <mark>Jones</mark> into the championship bout. Championship runner-up Fowler had wins over <mark>Chris Dean</mark>, Tim Andersen and 2014 IHRA Sportsman Driver of the Year John Dustin, capping a great year for the Point Pleasant, West Virginia native who had one win and championship in Division 3 behind the wheel of the Friends of Coal sponsored 1980 Camaro .\" This whole thing has been like a dream come true. You pray for something like this, but people like me, we are just out here enjoying the sport. People like us just don't win these things, \"<mark>Jones</mark> said. Ironically, <mark>Jones</mark>' championship season almost didn't happen. It took the urging of longtime friend Roger Massey, himself an accomplished Top Sportsman racer, to get <mark>Jones</mark> out to his first IHRA event. From there, things just clicked for the Gilmer, Texas native .\" A friend of mine convinced me to give IHRA a try this year and from the very start, every time I went to a race, I found myself going rounds, \"<mark>Jones</mark> said .\" It was so different, so relaxing to run IHRA. I found myself right at home and before long we found ourselves leading the division. We almost gave it away in our final race, but we were able to hang on and get to Memphis. \"With the win, <mark>Jones</mark> will earn the coveted No. 1 for his car as he plans to continue racing with the IHRA and defend his championship in 2015. 2014 NHRA: Circle K Renews Sponsorship Of Tradition-Rich NHRA Winternationals To Open 2015 NHRA Mello Yello Series Season 2014 NHRA: It's Deja Vu All Over Again For Past Pro Mod Champion Coughlin 2014 NHRA: Brittany Force To Race Special Rookie Of The Year Dragster Starting In Vegas 2014 NHRA: Shoe's Latest News And Notes From Don Schumacher Racing 2014 NHRA: Courtney Force, Erica Enders-Stevens Eye History, World Championships Heading To NHRA Toyota Nationals In Las Vegas 2014 NHRA: NHRA Mello Yello Drag Racing Series: Erica Enders-Stevens, Courtney Force And John Force 2014 NHRA: NHRA Mello Yello Countdown To The Championship Returns To Southern California Where Series Crowns Will Be Decided 2014 NHRA: Aeromotive Inc Named Sponsor Of Season-Ending NHRA Pro Mod Drag Racing Series Las Vegas Event 2014 NHRA: John Force Accepts Crew Chief Jimmy Prock's Resignation Today 2014 NHRA: T.J. Coughlin Hopes To Hit Jackpot At Million Dollar Race 2014 NHRA: NHRA Funny Car World Champion Raymond Beadle: 1943-2014 Top NHRA Rookies Make Last Push Toward Auto Club Of Southern California Road 2014 NHRA: Tucker Regroups For Better Battle Against His Yankee Counterparts All logos and trademarks in this site are property of their respective owner.", "articleID": "2014102810_00049366_W", "names": {"Chris Dean": ["Q16979886", "Q2964697"]}}]