[{"articleID": "2019052115_00331186_W", "names": {"Jamie Oliver": ["Q1405258", "Q190051"], "Will Wright": ["Q309493", "Q8003199"]}, "date": "2019-05-21", "url": "https://www.brightonandhovenews.org/2019/05/21/jamies-italian-closes-with-the-loss-of-dozens-of-jobs/", "content": "<mark>Jamie</mark>'s Italian closes with the loss of dozens of jobs Comment: 0 More than 1,000 jobs have been lost with the closure of the chain of Italian restaurants started by celebrity chef <mark>Jamie Oliver</mark>. They include the branch of <mark>Jamie</mark>'s Italian in Black Lion Street, Brighton, and more than 20 others, although three sites at Gatwick airport <mark>will</mark> stay open. Mr <mark>Oliver</mark>, 43, had pledged £ 4 million as the business sought to attract more funding from investors. But today (Tuesday 21 May) the business was placed in administration, with specialist accountants from KPMG given the job of handling its affairs. Five years ago his Brighton branch of Recipease, a cooking school and deli in Western Road, also closed, with the last of the chain folding a year later in 2015. Mr <mark>Oliver</mark> said today: \"I am deeply saddened by this outcome and would like to thank all of the staff and our suppliers who have put their hearts and souls into this business for over a decade. I appreciate how difficult this is for everyone affected .\" I would also like to thank all the customers who have enjoyed and supported us over the last decade. It's been a real pleasure serving you. \"We launched <mark>Jamie</mark>'s Italian in 2008 with the intention of positively disrupting mid-market dining in the UK high street, with great value and much higher-quality ingredients, best-in-class animal welfare standards and an amazing team who shared my passion for great food and service. And we did exactly that .\" KPMG said: \"<mark>Will Wright</mark> and Mark Orton, from KPMG's restructuring practice, have been appointed joint administrators to <mark>Jamie Oliver</mark> Restaurant Group and its subsidiaries <mark>Jamie</mark>'s Italian, <mark>Jamie</mark>'s Italian Holdings, One New Change and Fifteen Restaurant .\" The group employs about 1,300 staff at 25 restaurants across the UK, including 22 under the <mark>Jamie</mark>'s Italian brand, in addition to <mark>Jamie Oliver</mark>'s Diner at Gatwick airport, Barbecoa and Fifteen London. \"The group recently undertook a process to secure additional investment in the business and, since the beginning of this year, <mark>Jamie Oliver</mark> has made additional funds of £ 4 million available to support fundraising .\" However, with no suitable investment forthcoming and in light of the very difficult current trading environment, the directors resolved to appoint administrators. \"Following their appointment, all but three of the group's 25 eateries have closed .\" Both <mark>Jamie</mark>'s Italian restaurants and <mark>Jamie Oliver</mark>'s Diner at Gatwick airport <mark>will</mark> continue to trade in the short term while the joint administrators explore options for the sites. \"Regrettably, these closures <mark>will</mark> result in about 1,000 redundancies .\" <mark>Jamie Oliver</mark> Holdings has made arrangements to ensure all restaurant staff salaries <mark>will</mark> be paid up to the date of the administrators' appointment. \"The international restaurants trading as <mark>Jamie</mark>'s Italian, <mark>Jamie</mark>'s Pizzeria and <mark>Jamie</mark>'s Deli <mark>will</mark> continue to trade as normal and are not affected by the administration of the UK restaurant business .\" Mr <mark>Wright</mark> said: \"The current trading environment for companies across the casual dining sector is as tough as I've seen .\" The directors at <mark>Jamie Oliver</mark> Restaurant Group have worked tirelessly to stabilise the business against a backdrop of rising costs and brittle consumer confidence. \"However, after a sales process that sought to bring new investment into the business proved unsuccessful, the team took the incredibly difficult decision to appoint administrators .\" Unfortunately, with insufficient funds available to be able to trade the business in administration, all but the Gatwick airport restaurants have now closed. \"Our priority in the coming hours and days is to work with those employees who have been made redundant, providing any support and assistance they need .\" See also:"}, {"articleID": "2011040819_00092519_W", "names": {"Karen Leibovici": ["Q16151822", "Q3193114"]}, "date": "2011-04-08", "url": "http://edmontonsun.com/news/edmonton/2011/04/08/17925006.html", "content": "edmonton councillors are speaking out against mammoth, above-ground power line that could run immediately east of the city, delivering power to the industrial heartland. the city wants to see the line buried, warning of possible health impacts, poor esthetics and the potential for nearby property values to drop. the towers could be up to 24 stories high. \"one of the names that this is being called is the mother of all power lines, because? 24-stories outside your backyard is not something attractive, to say the least,\" coun. <mark>karen leibovici</mark> told a news conference friday. the proposal, a joint venture between epcor and and altalink called the heartland transmission project, is slated to go before the alberta utilities commission (auc) monday. the hearing, which will hear from one of the city's lawyers, is expected to run into may. the 65 km power line would deliver electricity from south edmonton to industrial users northeast of edmonton, running along the eastern portion of the transportation utility corridor. the project would cost about $580 million if the lines are above ground, nearly doubling to $1.1 billion if a portion is buried, said tim le riche, spokesman for the project. \"we've gone through an extensive public consultation,\" said le riche, noting there was contact with over 200,000 stakeholders. \"after gathering all of the information, we have determined that when all factors are considered, it is our position that the best option, with the overall least impact, is an overhead line .\" however, the group has included information to the auc about burying a portion of the line, he said. epcor and altalink have countered claims of potential health risks and significantly lower property values. if the line is not buried, the city wants it to run along a second proposed route, immediately west of the city, through parkland and sturgeon counties. accused killer mark twitchell's \"lies' fire on 118 avenue near 94 street ivivva athletica to open at edmonton??? s southgate centre zig-zagging with my new reebok zigtech shoes fitness magazine offers ipad edition self magazine launches app for ipad"}, {"articleID": "2010092406_00057556_W", "names": {"Michael Kelly": ["Q1385380", "Q20811110", "Q21458877", "Q28824019", "Q30121927", "Q48999751", "Q53411237", "Q54153145", "Q556185", "Q57417054", "Q6831818", "Q6831821", "Q719556"]}, "date": "2010-09-24", "url": "http://cavalierdaily.com/2010/09/24/perriello-discusses-health-care-act/", "content": "rose lee, staff writer on september 24, 2010 freshman incumbent candidate tom perriello propelled \"patient's bill of rights\" in a public event wednesday. photo courtesy of the perriello office. president obama's patient protection and affordable care act was officially put into effect yesterday. proponents of the health care reform law emphasize the protections for privately insured consumers outlined in the \"patient's bill of rights .\" congressman tom perriello, d-charlottesville, highlighted those key patient rights and protections in a wednesday statement to the press. for example, virginians will have protective provisions against the denial of coverage to children with pre-existing conditions, the arbitrary cancellation of health coverage and lifetime limits on health coverage. other benefits include the rights patients will have \"to key preventive services without deductible or co-payments\" and to choose their own doctors within their insurer networks. perriello publicly discussed the \"patient's bill of rights\" wednesday at events in charlottesville and ferrum, va. \"we met parents with kids who have chronic illnesses,\" said <mark>michael kelly</mark>, deputy press secretary for the periello campaign, adding that those parents now have the freedom to make critical decisions about their healthcare under the new law. perriello and other supporters of the health care reform law emphasize that the \"reforms? put patients and doctors, not the health insurance companies, back in charge of health care decisions,\" according to perriello's press release. nevertheless, robert hurt, perriello's challenger in the upcoming congressional midterm election, believes that the health care reform bill is more detrimental than beneficial for virginians. \"robert believes that the government takeover of health care should be repealed and replaced,\" hurt campaign spokesperson amanda hennenberg said. \"it's no surprise that congressman perriello continues to champion? government takeover of health care that raises rates and taxes, kills jobs and adds burdensome costs onto the backs of small businesses and cuts medicare by $500 billion .\" other sources have shown that the health care reform policy could have some negative effects. the centers for medicare and medicaid services announced tuesday that 1.2 million seniors will be dropped from the medicare advantage or medicare prescription drug plan that is currently in place. in addition, small-town doctors who rely on medicare patients may suffer from these reported effects. despite how polarized views on the bill can be, isaac wood, media representative at the center for politics and a former cavalier daily opinion columnist, said he believes the health care policy's recent implementation will not affect the upcoming congressional election. \"i feel like many people have already made up their mind about the health care reform bill one way or another,\" wood said. \"unless they seem personally affected or changed, i don't think you will see a lot of change in the polls based on this alone .\" a new benenson strategy group poll released tuesday shows that democrat tom perriello and republican robert hurt are statistically tied. the poll revealed that 44 percent and 46 percent of likely general election voters would vote for perriello and hurt, respectively. wood called this poll more accurate than some previous polls that showed larger margins. \"anyone living in this district knows that [the election] is not a blowout - the margin is really small,\" he said. the congressional midterm election will take place nov. 2. mail (will not be published) (required) is this really a case of helicopter parenting? hmmm, consider for a moment ho...oh, and like all of you, my girlfriend was pissed at me about this article. so,...wow. i'm kind of getting trashed here.first off, let me say that it was a jo...i understand harris' position that the students own the honor. honor exists to f.. . love college football and think you are right on about that...but, that's where ..."}, {"articleID": "2012090706_00001411_W", "names": {"Ron Mcbride": ["Q7364134", "Q7364136"], "Colin Clark": ["Q30174601", "Q5144988"]}, "date": "2012-09-07", "url": "http://deseretnews.com/article/765602226/Weber-State-football-Interim-head-coach-Jody-Sears-and-Wildcats-making-the-most-of-a-tough-situation.html", "content": "view 16 photos? weber state interim head football coach jody sears wednesday, sept. 5, 2012 at practice. see, you're the new head football coach at weber state university, but they've chosen to put that iffy qualifier \"interim\" in front of your title after you were suddenly thrust into the job when the other guy abruptly bailed for a better gig. byu football notebook: former wildcat head coach <mark>ron mcbride</mark> expressed interest in playing cougars weber state football: wildcats ready for pair of formidable opponents weber state football: wildcats ready to play after rough few months weber state football: football team opens season saturday at fresno state \"after this game, regardless of the outcome, we still have to have our foot on the gas .\" weber state interim head football coach jody sears let's face it, folks, this is a pretty tough way for somebody to start their head coaching career. see, you're the new head football coach at weber state university, but they've chosen to put that iffy qualifier \"interim\" in front of your title after you were suddenly thrust into the job when the other guy abruptly bailed for a better gig. so now it's turned into one of those classic good news/bad news scenarios: the good news is congratulations, you're the wildcats' head coach; the bad news is, uh, sorry, but your first two games are on the road against a couple of perennially strong football bowl subdivision programs. yep, we're talking fresno state and byu. hey, good luck with that! that's the difficult challenge jody sears inherited when he took over the wsu reins in late-april after john l. smith bolted from his alma mater for the greener pastures of the university of arkansas. the wildcats opened their season last saturday with a lopsided 37-10 loss at fresno. and this weekend, they'll make the bus ride south to provo to face the cougars, who whipped that \"other\" wsu team (washington state) last week, 30-6. while sears admits he might've had a \"holy, crap!\" moment or two when he first glanced at the wildcats' early season schedule, he's not looking around for a white towel to throw in when saturday's game kicks off at lavell edwards stadium - marking weber state's first game against byu since 1979. \"that's the hand you're dealt, and there's no sense crying and whining about it,\" sears said. \"it is what it is .\" when i was at eastern washington, we opened up at oregon state and then went to west virginia - back to back. so this isn't my first rodeo. i've been there and done that, man. \"but, really, this is just part of the process, and it's setting us up, i think, for the rest of the year. you're going to face that formidable of an opponent, you definitely know who you are and where your strengths are and where your weaknesses are. and now you can cater to it .\" i'd hate to go into our big sky season after beating some paddy-cakes or what have you and you kind of have a false sense of reality, \"he said .\" we're going to have some reality now and we're going to know who we are. \"utah utes, after a two-year break, it'll be rivalry renewed when utah, utah state square off friday night at romney stadium. rsl beaten real salt lake goalie nick rimando fouled macoumba kandji in stoppage time, and that led to <mark>colin clark</mark>'s goal."}, {"articleID": "2012061113_00101756_W", "names": {"John Bryson": ["Q1365901", "Q42292038", "Q6223706"], "Mark Pope": ["Q3849539", "Q6769291"], "David Axelrod": ["Q1251914", "Q519838"]}, "date": "2012-06-11", "url": "http://feeds.abcnews.com/click.phdo?i=c12ea8b9c1e41e290734699078093775", "content": "u.s. secretary of commerce <mark>john bryson</mark> is suspected of felony hit and run in connection with an incident that took place on saturday evening, one that the white house was not told about until sunday night, officials told abc news. <mark>bryson</mark> allegedly hit two cars three times, and was found unconscious behind the wheel of his lexus. <mark>bryson</mark>, 68, was \"involved in a traffic accident over the weekend in los angeles. he was taken to the hospital for examination and has been released. he has sustained no injuries and the investigation is ongoing,\" jennifer friedman, a spokeswoman for the department of commerce, said in a statement. today, the statement was updated: \"secretary <mark>bryson</mark> was involved in a traffic accident in los angeles over the weekend. he suffered a seizure. he was taken to the hospital for examination and remained overnight for observation. he was released and has returned to washington. the investigation is ongoing. secretary <mark>bryson</mark> has no public events scheduled for today .\" <mark>bryson</mark> got out of his car, spoke to the three males in the buick, \"then left the scene, hitting the same car as he left the scene,\" read a joint statement from the san gabriel police department and los angeles county sheriff's department. \"the three males followed him in their car while calling san gabriel police officers via 911 and asking for assistance .\" in yet another bizarre twist to the story, about five minutes later <mark>bryson</mark> allegedly then hit a honda accord containing a man and woman in the city of rosemead and \"was found alone and unconscious behind the wheel of his vehicle .\" the law enforcement statement said that two of the three men in the buick and one of the occupants of the honda complained of pain as a result of the collisions. the men in the buick were treated by paramedics. the statement said that the investigation was in its preliminary stages and \"there is no indication that alcohol or drugs played a role in the collisions .\" \"information was given that he suffers from a preexisting medical condition,\" los angeles county sheriff's deputy <mark>mark pope</mark> told abc news radio. four years ago <mark>bryson</mark> blacked out at a boeing board meeting and was taken to the hospital, according to a witness. the weekend story was first reported by the pasadena star news. on thursday, <mark>bryson</mark> was commencement speaker at the polytechnic school in pasadena, from which all four of his daughters graduated. gma 6/07: man halves his weight, drops...watch: <mark>david axelrod</mark>: romney \"on a different planet' watch: roundtable i: obama's rough week"}, {"articleID": "2017100416_00390874_W", "names": {"Gordon Strachan": ["Q314095", "Q5585876", "Q5585877"], "Harry Kane": ["Q16093851", "Q29095108", "Q969725"], "Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"], "Scott Brown": ["Q15047261", "Q155125", "Q314160", "Q47233855", "Q7436044", "Q7436045", "Q7436046", "Q7436047", "Q7436048", "Q7436049", "Q7436050", "Q7436051", "Q7436052", "Q933673"], "Callum Mcgregor": ["Q16056060", "Q57417042"]}, "date": "2017-10-04", "url": "http://www.sport.co.uk/football/scotland-boss-gordon-strachan-is-excited-ahead-of-deci/9126262/", "content": "Scotland boss <mark>Gordon Strachan</mark> is \"excited' ahead of decisive qualifiers Tweet 04 October 2017 03:49 <mark>Gordon Strachan</mark> is feeling excitement more than any other emotion ahead of Scotland's decisive World Cup qualifiers. Scotland hauled themselves back into contention ahead of Thursday's visit of Slovakia after a disappointing start to Group F, when they took four points from their opening four matches. <mark>Strachan</mark>'s side have since gained 10 points from their next four and were only denied a clean sweep by England striker <mark>Harry Kane</mark>'s dramatic equaliser at Hampden Park in June. SCOTLAND | The squad were back at it this morning with final preparations ahead of #SCOSVK tomorrow evening. pic.twitter.com/XLLzcGsyaE--Scottish FA (@ ScottishFA) October 4, 2017 The Scotland boss looked to be moments from ending his reign before <mark>Chris Martin</mark> popped up with a late winner against Slovenia in March, so it is no surprise he is relishing the chance to lead his country to the play-offs. Victories over both Slovakia and Slovenia this week would secure second spot in Group F and a likely two-legged encounter in November for a place in Russia next summer. <mark>Strachan</mark> said:\" Forget how big it is, it's how exciting it is. And it's really exciting. Forget the rest of the emotions, excitement takes over the whole thing. \"When you have a challenge, excitement comes along. It's really exciting for me and really enjoyable taking on this challenge with the players. Two matches to go. It's in our hands. #SCOSVK pic.twitter.com/MLlOHKy0gp--Scottish FA (@ ScottishFA) October 4, 2017\" We try and start at the same level where we are all looking forward to joining up with each other. There's always a good buzz when we meet, but obviously the buzz is higher if you have got those couple of wins under your belt. \"<mark>Strachan</mark>'s frame of mind will no doubt have been boosted by the way his side handled that clash with Slovenia, which the 60-year-old unusually branded a\" must-win \"game. Ticket sales were nearing the 45,000 mark as <mark>Strachan</mark> spoke and the national boss feels the Hampden crowd can continue helping his team over the line .\" There were times against Slovenia when we needed their help and they gave us their help, there were times against England when we needed their help to get back in it, \"<mark>Strachan</mark> said. Scotland boss <mark>Strachan</mark> says Barry Bannan produced the best performance he has seen over the last 3-4 weeks--Gavin McCafferty (@ GavinMcCafferty) October 4, 2017\" Between the players and the fans we have dragged ourselves back in the position where we can determine our own future. \"The Scotland manager has had a fairly settled team since the Slovenia game, when he built his team around a Celtic core, but he has decisions to make after injured Parkhead midfielders <mark>Scott Brown</mark> and Stuart Armstrong pulled out, along with Newcastle's Matt Ritchie. Celtic midfielder <mark>Callum McGregor</mark> and Hibernian's John McGinn both hit doubles at the weekend as they challenge for a place in the centre of the park, but <mark>Strachan</mark> revealed that Barry Bannan's display in Sheffield Wednesday's 3-0 victory over Leeds on Sunday had given him a real chance of starting .\" You talk about John McGinn and <mark>Callum McGregor</mark>, probably the best performance I have seen over the last three or four weeks is Barry Bannan's, so he is certainly at the forefront of what we are trying to do, \"<mark>Strachan</mark> said. Source: By PA Sport Staff"}, {"articleID": "2012022120_00031392_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2012-02-21", "url": "http://newsbusters.org/blogs/clay-waters/2012/02/21/nyts-carl-hulse-indulges-russ-feingolds-preening-liberal-melodrama", "content": "judge on cbs prime time drama cheers \"amazing' occupy protesters:' i salute them' new york times congressional reporter carl hulse's\" congressional memo \"tuesday was a late valentine to former wisconsin senator and preening liberal hero russ feingold,\" who has a history of promoting democrats while dismissing republicans, portrayed feingold as a brave maverick trying to thwart a rising tide of fear. russ feingold always went his own way in the senate, much to the frequent aggravation of his democratic colleagues. but the wisconsin democrat was never more alone than on oct. 11, 2001, when he was the sole opponent to the patriot act antiterror law pushed through on a 96-1 vote in the weeks after the sept. 11 attacks. \"this was indeed an intimidating time,\" mr. feingold writes in his new book, \"while america sleeps\" (crown publishers), his personal recounting of the historic congressional period following the sept. 11 shock through the rise of the tea party conservatism that led to the loss of his own senate seat in november 2010. best known as the chief democratic architect of the campaign finance law, mr. feingold assembles a narrative of how the terrorist attacks, the deadly anthrax assault in the capital and the sniper killings in the washington region created a climate of fear that ultimately led to the antiterrorism law, the war in iraq and ugly political attacks. the pleasant capitol hill neighborhood that he inhabited became an armed camp reminiscent of another anxious period in american history when civil liberties were at risk. \"the combination of constant security fears with the weightiness of the responsibilities made this what had to be one of the most tense and frightening times on capitol hill since the civil war,\" he writes. ed rollins) ultrasounds already part of va. planned parenthood abortion procedures (commentary) mainstream scream of the week: matthews on limbaugh (<mark>glenn beck</mark> @ on faith) gop says happy 3rd anniversary, failed stimulus (liberal comedian slams santorum, \"jesus never condemned birth control or gay people' scott whitlock senior contributor"}, {"articleID": "2015091416_00127921_W", "names": {"Richard Kind": ["Q2054112", "Q449959"]}, "date": "2015-09-14", "url": "http://www.ctnow.com/hc-sacred-heart-ftma-film-festival-20150914-story.html", "content": "Orson Wells Double Feature Part Of FTMA Film Fest F is for Fake Janus Film \"F is for Fake\" is one of two Orson Welles films that will be shown as part of the FTMA film festival at Sacred Heart University. \"F is for Fake\" is one of two Orson Welles films that will be shown as part of the FTMA film festival at Sacred Heart University. (Janus Film) FTMA Film Festival at Sacred Heart University honors Kevin Nealon, <mark>Richard</mark> KindOrson Welles double feature, \"Bulworth\" part of Sacred Heart film fest Sacred Heart University in Fairfield celebrates its film and television program--the only graduate film-television program in the state--with its second annual FTMA Film Festival Thursday through Sunday, Sept. 17 to 20. The festival will include film screenings, a master class, a gala, a standup comedy show and after-parties, at the Fairfield campus and at Avon Theatre in Stamford. 0 Justin Liberman, a professor and one of the founders of the festival, said it was founded as a result of perceived shortfalls in the Fairfield County film scene. \"One of our real missions was to really cultivate a community and a culture of film,\" he said. \"We are recognizing that there is a thirsty community here. The festival is a way to\" throw the bat signal out,' in a way. \"Entertainment industry notables planning to attend the festival include actors Kevin Nealon and <mark>Richard Kind</mark>, screenwriter Brian Koppelman and Oscar-nominated screenwriter Jeremy Pikser. Here's a lineup: Thursday: Awards ceremony at which four award-winning student films will be shown, then a tribute to Koppelman, who wrote\" Rounders, \"\"Runaway Jury\" and \"Ocean's Thirteen .\" Avon Theater in Stamford, 7 p.m., followed by a reception. Friday: Screenwriting master class with Pikser, as well as a screening of his Oscar-nominated movie, \"Bulworth,\" which he co-wrote with Warren Beatty. Frank and Marisa Martire Business & Communications Center, Sacred Heart University, 11 a.m.; salute to Nealon (Class of' 75), with clip reel from his films, Martire Center, 7:30 p.m.; standup comedy show with Shul Egar, Keith Alberstadt and Nealon, Martire Center, 9 p.m. Saturday: Orson Welles double feature, \"A Touch of Evil\" and \"F is for Fake,\" followed by discussion on Welles by Dr. Sid Gottlieb, Martire Center, 10 a.m.; Sacred Heart student films, Martire Center, 6 p.m.; Sounds of Cinema concert, with songs from the movies of Wes Anderson, Martire Center, 9 p.m. Sunday: Award presentation for <mark>Kind</mark>, with clip reel from his films, including \"A Serious Man\" and \"Inside Out .\" Martire Center, 2 p.m. Admission is free to all events, but reservations are suggested and can be made at ftma.sacredheart.edu."}, {"articleID": "2012110104_00033243_W", "names": {"Mike Davis": ["Q14948795", "Q1608491", "Q16193543", "Q16235313", "Q16728420", "Q18631667", "Q1933136", "Q3313280", "Q6846501", "Q6846502", "Q6846504", "Q6846507", "Q6846508", "Q6846511", "Q6846512"]}, "date": "2012-10-31", "url": "http://columbiamissourian.com/stories/2012/10/31/columbia-college-rings-basketball-season-costumes-dance-/", "content": "print columbia college rings in basketball season with costumes, dance-off wednesday, october 31, 2012 | 10:51 p.m. cdt columbia - captain america watched from the stands as mark mcgwire was chased by a police officer across the gym floor to the song \"monster mash .\" it's safe to say that halloween night lent an extra touch of chaos to cougar madness, columbia college's annual athletics department-sponsored event to kick off the school's basketball seasons. costumed students scrambled around the gym playing knockout, musical chairs and wrapping themselves in toilet paper in the community-building event. thursday vs. oklahoma baptist at 7 p.m. at the arena of southwell complex columbia college men's basketball opener: friday vs. concordia seminary college at 7 p.m. at the arena of southwell complex columbia college women's basketball ends season with naia tournament loss columbia college men's and women's basketball teams get naia tournament berths fate uncertain for columbia college women's basketball after loss in conference tournament columbia college women's basketball ends regular season with a win sophomore continues comeback in columbia college women's basketball team victory cosmo, the morning dj for columbia radio station ktxy/106 .9 fm, was the master of ceremonies, narrating the night's events over the gym speakers. dressed in a gorilla suit, he blended right in with the student body. \"this is the first time cougar madness has been on halloween,\" cosmo said. \"we have a lot more students in costume than we were expecting .\" <mark>mike davis</mark>, head coach for the columbia college women's basketball team, said the event usually consists of a scrimmages, but that was cut out of this year's event because the women open their season on thursday, and the men open their season on friday. still, <mark>davis</mark> saw the events, including multiple highlight videos and a dance-off between the men's and women's teams, as a good start to the season. \"it showed we've got some good dancers on the team,\" <mark>davis</mark> said. \"i don't know how much that helps on the court, but it's always a fun event .\" junior guard heather english, who was a third-team national association of intercollegiate athletics all-american last season, also enjoyed the event, particularly the dance-off and her team's performance of \"the wobble,\" which earned her team a victory in the competition based on audience applause. what's this?) report corrections or additions here. leave comments logged in to participate in the show me the errors contest. leave a comment speak up and join the conversation! make sure to follow the guidelines outlined below and don't use language that makes personal attacks on fellow commenters or discriminates based on race, religion, gender or ethnicity. use your real first and last name when registering on the website. it will be published with every comment. (don't solicit or promote businesses."}, {"articleID": "2018030123_00123107_W", "names": {"Carlos Pascual": ["Q5042474", "Q5042478"]}, "date": "2018-03-01", "url": "https://www.bostonglobe.com/news/world/2018/03/01/ambassador-mexico-will-resign-soon-amid-tense-relations-under-trump/OkKhfA5fh5l2s2qLD9TgQP/story.html", "content": "MEXICO CITY--The US ambassador to Mexico plans to resign in May, according to a memo circulated Thursday to embassy staff, the latest in a string of senior diplomatic departures from the region--and more broadly from the State Department. The ambassador, Roberta S. Jacobson, 57, served just under two years in the post, after her arrival was delayed by a prolonged confirmation process. Analysts say her departure will be deeply felt by both US and Mexican officials: She was one of the most experienced Latin America experts in the State Department, having spent most of her 31 years there, focusing on the region. \"I have come to the difficult decision that it is the right time to move on to new challenges and adventures,\" Jacobson wrote. \"This decision is all the more difficult because of my profound belief in the importance of the US-Mexico relationship and knowledge that it is at a crucial moment .\" Advertisement The Trump administration has selected a nominee to replace Jacobson but has not released the name, according to a US official with knowledge of the decision who was not authorized to comment publicly and who discussed the matter on the condition of anonymity. Get Today's Headlines in your inbox: The day's top stories delivered every morning. Sign Up Thank you for signing up! Sign up for more newsletters here Jacobson leaves at a tense moment in relations between Mexico and the United States, with President Trump vowing to have Mexico pay to build a wall between the countries, pledging to tear up the North American Free Trade Agreement, and promising to deport millions of Mexicans who crossed the border illegally. There was also a testy phone call between Trump and President Enrique Peña Nieto of Mexico that derailed tentative plans for the two leaders to meet after Trump refused to drop his demand that Mexico fund the border wall. For Jacobson, the ambassadorial post was the culmination of a career largely centered in Washington, where she was most recently the assistant secretary for Western Hemisphere affairs. As a member of the State Department's Civil Service--as opposed to the foreign service, which typically fills the ranks of diplomats--it was highly unusual for Jacobson to have ascended to the top slot in Mexico. But Jacobson's supporters say her extensive experience and connections in the country were crucial assets for Washington at a time of strain between the two neighbors, which have closely intertwined economies. Advertisement Former President Barack Obama named Jacobson to the post in 2015, but a bitter partisan dispute in Congress meant nearly 11 months elapsed before she was confirmed. After she arrived in Mexico City, the honeymoon period did not last long. Trump's election abruptly changed the generally warm relations that the United States had developed with Mexico over 25 years--ones that Jacobson had helped foster. Jacobson was left working with her Mexican counterparts to assuage growing concern--and anger--about the new president's tough talk. At the same time, diplomacy on Mexico was being routed through the White House, via the president's son-in-law, Jared Kushner, which left Jacobson with less authority. Officials in Mexico, as well as former colleagues, lamented her departure, calling it the latest blow to strained relations. \"No career official has more consummately understood US-Mexico relations,\" said <mark>Carlos Pascual</mark>, a former US ambassador to Mexico and Ukraine. \"She grounded American policy in the belief that, as neighbors, the US and Mexico will gain most from using the vast resources of both countries to confront shared problems together .\" Advertisement Jacobson will be leaving a State Department that has seen an exodus of foreign service officers. Among those leaving are several high-ranking officials with deep experience in Latin America, including Thomas A. Shannon Jr., the third-highest-ranking official in the State Department. Shannon, the undersecretary of state for political affairs who previously served as an ambassador to Brazil, Guatemala, and Venezuela, announced his retirement last month."}]