[{"articleID": "2009101612_00094212_W", "names": {"Paul Mckeever": ["Q16190809", "Q7152380"]}, "date": "2009-10-16", "url": "http://mirror.co.uk/news/latest/2009/10/16/wpc-s-killers-known-for-25-years-115875-21751875/", "content": "wpc's killers \"known for 25 years' 16/10/2009 the identity of the libyans behind the fatal shooting of wpc yvonne fletcher has been known for 25 years, it has been claimed. campaigners for the family of the murdered officer said it is\" scandalous \"more has not been done to bring the guilty men to justice. they said a leaked two-year prosecution report claiming there is enough evidence to charge two men is not surprising. but they attacked the government for being\" tactless and insensitive \"because of secrecy around attempts to bring the suspects to justice. shadow justice secretary dominic grieve said:\" if prosecutors believe there is a case against the perpetrators of the cruel murder of yvonne fletcher, why has it been buried? we now need an immediate and full account of the evidence available and the decision-making process from the justice secretary and attorney general. \"advertisement - article continues below\" <mark>paul mckeever</mark>, chair of police federation of england and wales, said more must be done to bring the suspects to justice. speaking about the leak, he said: \"this demonstrates the tactless and insensitive way in which the government has handled this affair. it is astonishing that this has only just come to light now. why have people been sitting on it?\" michael winner, a friend of miss fletcher's parents and founder of the police memorial trust, said the identity of the suspects was known within two weeks. he said: \"it is obviously politically advantageous to court libya and let a couple of murderers go free. i do not think that is very ethical and it does not do any credit to anyone involved, but this is what happens in the world we live in. it is scandalous that a stronger stance has not been taken. they should be brought to justice and nothing should compromise that .\" boyzone to perform musical tribute at stephen gately's funeral - exclusive young film-makers competiton: here's your chance to be the next big thing on the film scene! balloon boy found hiding in attic after fears he took off in homemade hot air balloon"}, {"articleID": "2019040610_00380830_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2019-04-06", "url": "http://express.co.uk/news/uk/1110620/Brexit-news-UK-BBC-Theresa-May-European-Union-Conservative-Party-Labour", "content": "The Conservative Party has been engaged in Brexit talks with the Labour Party after the Prime Minister reached out to Jeremy Corbyn last week to help try to deliver Britain's exit from the EU. Speaking on BBC Radio 4's Today programme, Education minister, Nadhim Zahawi, warned a further Brexit delay which sees the UK fighting the EU elections in May would be a \"suicide note\" for the Tory Party. Mr Zahawi added the talks with the Labour Party are \"ongoing and we hope that they deliver an outcome that allows Labour to support the withdrawal agreement\". BREXIT BOMBSHELL! Leave would win again in 2nd referendum says Abbott New UK passports printed without European Union phrase--how to apply But the Tory frontbencher added that if Labour could not sign up to a joint approach with the Government, MPs should be forced to find a compromise through a preferential voting system in order to resolve the deadlock. He said: \"If we can't get Labour to agree I think it's important that Parliament acts quickly now to decide what it is in favour of - whether it is through some voting mechanism where we have a single transferable vote and we vote on all the different deals .\" We need to do that quickly because I think going into the EU elections for the Conservative Party, or indeed for the Labour Party, and telling our constituents why we haven't been able to deliver Brexit I think would be an existential threat. \"I would go further and say it would be the suicide note of the Conservative Party .\" Brexit news: Nadhim Zahawi warned entering EU elections would be a \"suicide note' for the Tories (Image: GETTY • ITV) I would go further and say it would be the suicide note of the Conservative Party Education minister, Nadhim Zahawi The Conservative minister also said the UK faced a\" seismic \"political shift with the rise of the hard-left and hard-right if Brexit was not delivered. He said:\" I could easily see a scenario in our politics where populist parties on the hard-left and the hard-right would say \"your mainstream politicians have lied to you, not delivered on their promise' .\" \"They promised you they would deliver the instruction you gave them at the referendum, 17.4 million people voted for', it was a close run thing, which is why I think Mrs May's deal such a good compromise, but since we don't deliver that, I think there could easily be a seismic change in our politics .\" He added: \"We need to find out what Parliament will accept and then make a judgment as to whether that delivers Brexit. MPs' FURY at BBC Question Time BIAS after moving show from Bolton t.. . Brexit betrayal EXPOSED: PM favours soft exit says ex-No10 aide\" If we do not deliver Brexit we would be unleashing forces that I think could get this country, and indeed the rest of Europe, into a very bad place. \"Mr Zahawi claimed Parliament's opposition to a no-deal Brexit meant\" we are at the mercy of the 27 other countries \"in the EU. He said:\" If we do pass the withdrawal agreement and ratify it then we can leave. All other options will be ceding control to the EU27. \"It comes as Chancellor <mark>Philip Hammond</mark> said there were\" no red lines \"from the Government side in the ongoing talks with Labour. At a meeting of EU finance ministers in Bucharest he said:\" We should be open to listen to suggestions that others have made. Some people in the Labour Party are making other suggestions to us, of course, we have to be prepared to discuss them. \"Our approach to these discussions with Labour is that we have no red lines, we will go into these talks with an open mind and discuss everything with them in a constructive fashion .\" Mrs May has asked for a Brexit delay until June 30 but wants to terminate any extension before the European polls if she is able to get a deal through Parliament. European Council president Donald Tusk is recommending a longer postponement of one year, with a break clause in the case of earlier ratification, in a so-called \"flextension\" deal."}, {"articleID": "2017060112_00667043_W", "names": {"Igor Dmitriev": ["Q1657680", "Q27579756", "Q433411"]}, "date": "2017-06-01", "url": "https://www.bloomberg.com/news/articles/2017-06-01/bank-of-russia-concedes-focus-shifting-as-inflation-nears-target", "content": "Bank of Russia Concedes Focus Shifting as Inflation Nears Target - Bloomberg Bloomberg the Company & Its Products Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 MENU Bank of Russia Concedes Focus Shifting as Inflation Nears Target by Nabiullina sees policy focused on keeping prices low, stable Central bank won't ease \"sharply and quickly,' governor says Russia's central bank is shifting gears as the goal of achieving its inflation target gives way to policy normalization. After a period of two years when rate setters focused on disinflation, steering price growth from almost 17 percent to near 4 percent, their attention now is on keeping it stable and low, Bank of Russia Governor Elvira Nabiullina said on Thursday at a panel during the St. Petersburg International Economic Forum .\" In some sense, the focus of our monetary policy has already changed slightly, \"she said. The aim is to ensure\" a gradual decline of annual inflation to 4 percent and holding it near that level in the future. \"With the price goal within reach months ahead of schedule, the central bank is broadening the scope of policy and clarifying its intentions after two surprise rate cuts of half a percentage point each. But its stance remains\" moderately tight, \"leaving Nabiullina to temper expectations of a pivot toward deeper easing two weeks before the Bank of Russia reviews borrowing costs again .\" We don't rush to loosen monetary policy sharply and quickly because we need to be sure that low inflation is rooted in such fundamental factors as a propensity to consume, a propensity to save, based on inflation expectations, \"she said. The central bank will cut its key rate to 9 percent from 9.25 percent at its June 16 meeting, according to most of the economists polled by Bloomberg. The benchmark will end the year at 8.25 percent, according to an average estimate of analysts in another survey. The most important market news of the day. Get our markets daily newsletter. Sign Up The median value of inflation expectations for a year ahead remains at more than double the target. While consumer-price growth slowed to 4.1 percent in April from a year earlier, households' perceived inflation was at 12.1 percent in May, according to a poll conducted for the central bank. Policy makers consider inflation expectations\" a pillar \"for making their rate decisions, according to <mark>Igor Dmitriev</mark>, head of the central bank' monetary policy department .\" Our target is not to reach 4 percent for one month, but to support the stability of low inflation in the medium term, \"Nabiullina said .\" And we can say that we reached low stable inflation in two to three years. \"Before it's here, it's on the Bloomberg Terminal."}, {"articleID": "2011082511_00135262_W", "names": {"Denis Law": ["Q233565", "Q30122280"]}, "date": "2011-06-21", "url": "http://thefa.com/TheFA/Wembley/NewsandFeatures/2011/UEFA-exhibition-Champions", "content": "the fa exhibition of champions at wembley wembley honour uefa champions league history with \"exhibition of champions'. items belonging to europe's most iconic names in football from david beckham to di stefano will go on display at wembley stadium from monday 29 august as part of a new\" exhibition of champions'. supported by uefa, the exhibition celebrates 56 years of glorious european football history and will form part of the wembley stadium tour. it will feature prize exhibits including inspirational liverpool skipper steven gerrard's 2005 captain's armband, david beckham's jersey from manchester united's nail biting victory in 1999 and graeme souness' three winners' medals from' 78, '81 and' 84. the uefa champions league final is the most prestigious event in european club football and since 1963 wembley stadium has hosted a total of six finals including the most recent final in may. a record breaking audience of over 300 million people tuned in worldwide to see barcelona take on manchester united at wembley and tv ratings in the uk reached a high of 11.1 million. history was made in the us when the final drew in an audience of 4.2 million, a 91% increase on figures from 2010. following the success of this final, widely recognised as one of the very best in champions league history, wembley was again chosen by uefa to be hosts of the final in 2013 - the 150th anniversary year of the football association. chairman of wembley stadium, melvin benn, said: \"wembley is a stage for the big football finals and they don't come much bigger than the champions league final .\" never before has a stadium been awarded this prestigious final twice in three years and so when wembley was chosen to host the final again in 2013 we were thrilled. it is acknowledgment of wembley's status as one of the very best football stadiums in the world. with such an impressive champions league history, it feels very appropriate to bring the exhibition of champions to wembley for football fans to enjoy. \"the\" exhibition of champions' supported by uefa through content and memorabilia will kick off on august bank holiday monday just before the group stages of the uefa champions league get underway and will feature over 700 artefacts including: the match balls from the last seven finals <mark>denis law</mark>'s jersey from 1968 the original intercontinental cup - valued at approximately? 225,000 johan cruyff's jersey from 1972 david villa's signed shirt from 2011 celtic signed frame from their 1967 victory di stefano's 1959 jersey van basten's jersey from 1990 mcgovern's shirt from 1979 eusebio's shirt from 1963 zidane's boots from 2002 the wembley stadium tour has welcomed millions of sports fans since it first opened in 1978 and now from monday visitors will be able to enjoy the \"exhibition of champions' as well as the england changing rooms, players tunnel, trophy winner's steps, press conference rooms and wembley's famous royal box."}, {"articleID": "2014031500_00003233_W", "names": {"Mike Lee": ["Q21064126", "Q30122331", "Q55622025", "Q627098", "Q6847648", "Q6847650", "Q6847651", "Q6847652", "Q6847653"], "Mark Jacobs": ["Q6768224", "Q6768225", "Q6768226"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2014-03-14", "url": "http://thegazette.com/2014/03/14/iowa-gop-senate-hopefuls-not-committed-to-mcconnell-leadership/", "content": "It's not only in Kentucky where Mitch McConnell is facing a challenge. The U.S. Senate minority leader, who has to get past a tea party challenger to get to the general election where the Democratic opponent is gaining traction, isn't getting much love from Iowa Republicans who hope to help the GOP to win back control of the Senate in this fall's mid-term elections. Sam Clovis, a retired Air Force colonel and college professor, doesn't mince words when asked whether he'll support McConnell, a five-term senator who has been minority leader since 2007. \"I think we need a change in leadership in the United States Senate,\" he said at a Republican forum in Ida Grove back in November. \"I'm going to go onto the floor of the Senate and make sure that vote goes to a leader other than the one we have right now. That's the first thing .\" Sen. Mitch McConnell of Kentucky If that wasn't clear enough, Clovis told a tea party gathering in December that \"If Mitch McConnell still wants to be the leader, he's not going to have my vote .\" Former U.S. Attorney Matt Whitaker has been a bit more nuanced. When asked about the Affordable Care Act, aka Obamacare, during a Tea Party Express interview, Whitaker said he favors repeal. \"But who the leader is in the Senate is going to make a big difference,\" Whitaker said, \"and if it's someone like Sen. McConnell from Kentucky I'm not sure we're going to have the same opportunities to advance a conservative agenda including repealing Obamacare that we would with a true conservative leader .\" While it might seem rash to be disrespecting the man who could have a say in which races the GOP senatorial campaign committee commits resources and who will make committee assignments after the election, neither Whitaker nor Clovis see it that way. \"Matt has never met Mitch McConnell and hasn't committed to voting for anyone,\" Whitaker spokesman Jason Klindt said. \"He wants to meet and talk with any candidate for leadership. He will be looking for a conservative leader who can get things done .\" \"I don't know that there's any danger\" in Clovis distancing himself from McConnell said campaign manager Chuck Laudner. \"Mitch McConnell doesn't have a vote in Iowa,\" he said. \"The base of this party, by and large, wants change. What's going on inside the party is not working. So you can't say\" I'll vote for McConnell' because that says more of the same. \"They may be right that there's little danger in being critical of the Senate GOP caucus leader, said Tim Hagle, a University of Iowa associate professor of political science. McConnell, said Hagle, who worked in the Bush administration, has taken a lot of heat from the more tea party-oriented candidates over a variety of actions he has taken .\" I don't know if risky is the right word, but it's probably not the wisest choice of action, \"Hagle said .\" Of course, \"he added,\" you don't have to worry about bad committee assignments if you don't get yourself elected and you can't get elected if you don't get the nomination. \"Clovis and Whitaker may see their anti-McConnell comments as increasing their chances of getting then nomination .\" It's not just political posturing if they see that McConnell has been a problem advancing the agenda they are running on, \"Hagle said. That's the strategy, according to Laudner, who said Clovis repudiation of McConnell is an applause line .\" People instinctively get it - what kind of a Republican, conservative you are, \"he said. It's one of the top three questions Clovis gets asked, Laudner said. The answer says everything about the candidate .\" It tells the Republican voter what kind of senator you will be, whether you are someone they can trust to go in there and do the right thing, \"Laudner said .\" You can't dodge it. If you dodge this one, the rest is a dodge. \"Clovis leans toward Texas Sen. Ted Cruz, who he will campaign with later this month, Kentucky Sen. Rand Paul or Utah Sen. <mark>Mike Lee</mark>. Whitaker hasn't committed to supporting anyone for the top GOP post, Klindt said .\" He wants to meet and talk with any candidate for leadership, \"Klindt said .\" He will be looking for a conservative leader who can get things done. \"GOP candidates <mark>Mark Jacobs</mark> and Scott Schaben say it's too early to make a decision whether to support McConnell .\" <mark>Mark</mark> is focused on his June primary and then winning the November general election, as is Sen. McConnell, \"said <mark>Jacobs</mark> spokeswoman Alissa Ohl said .\" Senate Republican leadership is a question for after the elections. \"While he didn't commit to voting for McConnell, <mark>Jacobs</mark> did show some respect .\" <mark>Mark</mark> has great respect for Sen. McConnell leading the united Republican charge on repealing Obamacare and <mark>Harry Reid</mark>'s job-killing agenda, \"Ohl added. Schaben says he's focused on his own race .\" If (McConnell) is still there when I arrive in D.C., I'll address it at that time, \"Schaben said .\" I hope this doesn't sound coy; just being honest. \""}, {"articleID": "2014070722_00091372_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "Nelson Cruz": ["Q1133784", "Q11957344", "Q6990454"]}, "date": "2014-07-07", "url": "http://www.baltimoresun.com/news/nation-world/sns-rt-us-britain-abuse-inquiry-20140707,0,3267653.story?track=rss", "content": "LONDON (Reuters) - The British government has ordered a wide-ranging inquiry into historical child sex allegations stretching over several decades, Home Secretary <mark>Theresa May</mark> said on Monday. A separate review will also be held into the handling of allegations of child abuse by politicians. \"In recent years we have seen appalling cases of organized and persistent child sex abuse,\" <mark>May</mark> told parliament. \"The government will establish an independent inquiry panel of experts in the law and child protection to consider whether public bodies and other non-state institutions have taken seriously their duty of care to protect children from sexual abuse .\" The broad inquiry, the chair of which is still to be appointed, will look into allegations of child abuse across organizations including the health service, political parties, the Church and the BBC. <mark>May</mark> said that given the scope of the inquiry it was unlikely to report back before a national election in <mark>May</mark> next year but would update parliament on its progress before the vote. Peter Wanless, the Chief Executive of anti child cruelty charity the NSPCC, has been appointed to hold a review of a 2013 investigation carried out by the interior ministry into the handling of allegations of abuse by politicians. Wanless will also look at how police and prosecutors handled information handed to them at the time, <mark>May</mark> said. The Baltimore Sun encourages civil dialogue related to our stories; you must register and log-in to our site in order to participate. We reserve the right to remove any user and to delete comments that violate our Buck Showalter responds Sunday to John Lackey's comments about <mark>Nelson Cruz</mark> Looking at the Orioles' next move with right-hander Kevin Gausman Randallstown woman killed by drunken driver in College Park, police say"}, {"articleID": "2019062207_00074580_W", "names": {"Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"]}, "date": "2019-06-22", "url": "http://www.dailypioneer.com/2019/sports/india-start-favourites-against-chile.html", "content": "Home Sports India start favourites against Chile Saturday, 22 June 2019 | PTI | Hiroshima Share T T T T 0 India start favourites against Chile Saturday, 22 June 2019 | PTI | Hiroshima Title contenders India will start as overwhelming favourites against lower-ranked Chile in the semifinals of the women's FIH Series Finals hockey tournament here today. The ninth ranked Indians are unbeaten so far in the tournament, having registered comfortable wins over Uruguay (4-1), Poland (5-0) and Fiji (11-0). And going by their world rankings and current form, India are expected to win hands down against world No 16 Chile. India are just one win away from securing their place in the final round of Tokyo Olympic qualifiers to be held later this year with two top spots up for grabs from here. And achieving that goal shouldn't be much of a problem for the Indians. In all their pool matches, India plenty of scoring opportunities but conversion rate is an area which is of a little concern for chief coach Sjoerd Marijne. \"We want to perform at the highest level possible and I believe there is still room for improvement,\" Marijne had said. \"Our conversion rate can definitely be higher and if that happens it will be easier for us to win matches .\" Chile, on the hand, finished second in their pool and had to go through the cross-overs to seal their place in the last-four round. Chile defeated Mexico 7-0, hosts Japan 3-1 before being stunned by world No25 Russia 2-5. But in the cross-overs, Chile edged past Uruguay 5-2 to set up a last-four encounter against India. In the other semifinal, Russia will take on world No 14 Japan. Trending News Police called to PM hopeful Johnson's home after \"row': UK media Columnist accuses Trump of sexual assault Google Doodle pays tribute to Amrish Puri Trump nominates Mark Esper as Secretary of Defense: White House Hong Kong police slam\" illegal, irrational' HQ protest Pak failed to complete its action plan on terror financing: FATF Iran denies receiving Trump warning of US attack \"Kabir Singh': A Shahid Kapoor canvas Global airlines reroute flights after Iran downs US drone Trump says in\" no hurry' for Iran strikes US prepped for strikes on Iran before approval was withdrawn Iran TV shows \"debris' of downed US drone more State Editions UP joins nation in celebrating yoga 22 June 2019 | PNS | Lucknow BJYM activists burn effigy of Sambhal MP 22 June 2019 | PNS | Lucknow Charbagh rly station to be remodelled 22 June 2019 | PNS | Lucknow SP supports what is written in Quran, says <mark>Azam Khan</mark> 22 June 2019 | PNS | Lucknow Govt sacks jailer, deputy jailer 22 June 2019 | PNS | Bhopal RSS functionary visits Deoband seminary 22 June 2019 | PNS | Lucknow Delhi, Bhopal, Bhubaneswar, Ranchi, Lucknow, Chandigarh, Dehradun, Raipur Sunday Edition Don't regulate us for the sake of it: Pichai 16 June 2019 | PTI | Sunday Pioneer Trade unions seek Rs 6K minimum pension, Rs 20K minimum wages 16 June 2019 | PTI | Sunday Pioneer India tops tech visa applications for UK: Report 16 June 2019 | PTI | Sunday Pioneer India's flat May fuel demand points to sluggish economy 16 June 2019 | Agencies | Sunday Pioneer Tanker attack jolts oil-import dependent Asia 16 June 2019 | AP | Sunday Pioneer IT industry meet Thakur to discuss data protection, tax issues 16 June 2019 | PTI | Sunday Pioneer E-mail this link to a friend. Email of your friend: Your Name (Sender's): Your Email (Sender's): Subject: Home About Us Contact Us Advertise with us Archives © 2019 The Pioneer. All Rights Reserved. Site Designed and Developed by: Infomedia Web Solutions"}, {"articleID": "2012020623_00085930_W", "names": {"Dmitry Medvedev": ["Q23530", "Q47858657"]}, "date": "2012-02-06", "url": "http://reflector.com/node/902609", "content": "memo to: prime minister vladimir putin and president <mark>dmitry medvedev</mark> subject: russia and the arab spring from: a traveler to cairo and moscow dear sirs: you may think that the situations in egypt and russia have nothing in common. think again. yes, these two countries have starkly different histories. but having visited both in recent weeks, i can tell you that they have one very big thing in common: the political eruptions in both countries were not initially driven by any particular ideology but rather by the most human of emotions - the quest for dignity and justice. humiliation is the single most underestimated force in politics. people will absorb hardship, hunger and pain. they will be grateful for jobs, cars and benefits. but if you force people to live indefinitely inside a rigged game that is flaunted in their face or make them feel like cattle that can be passed by one leader to his son or one politician to another, eventually they'll explode. have you gentlemen looked at the homemade videos going viral around russia these days? one of my favorites was made by two russian paratroopers-turned-singers, posted on youtube under the title \"russian airborne veterans against vladimir putin .\" their lyrics were aimed directly at you, mr. putin, in the wake of the sept. 24 announcement that president medvedev would step down and pave the way for you and your party (now widely known as \"the party of crooks and thieves\" ) to run for president for two more six-year terms - 12 more years! russians immediately started calculating how old they'd be when they might see their country led by someone other than you, mr. putin. it was depressing for many - made more so by the fact that mr. medvedev said that your \"trading places\" was planned long ago. yet no one else was consulted, and you two didn't even bother to offer a narrative as to why putin should have 12 more years. aleksei navalny, the shareholder-activist-blogger who helped stoke the rallies against you, said to me that nothing spurred the protests more than the daily experience of muscovites having to sit in traffic while a car with a flashing blue light carrying some putin crony behind tinted glass speeds past. \"it is all about dignity,\" said navalny. \"who are these people? why don't they care about our rights? it doesn't matter at all how good a career you build. you will stand in this traffic, and these people and their sons will drive past you with their blue lights .\" mr. putin, you have substantial achievements. during your first eight years as president, starting in 2000, you stabilized a collapsing russia and oversaw the emergence of a big urban middle class. admittedly, you didn't achieve this with kid gloves, and it was attended with widespread corruption and fueled by oil exports. but enough trickled down so that a real middle class of professionals and entrepreneurs emerged. they are your accidental political offspring - \"maybe the first independent political class in modern russian history,\" says max trudolyubov, the editorial page editor of the vedomosti newspaper - and now they want a voice in their future. have you spoken lately to mikhail dmitriev, the president of the center for strategic research? the anti-putin protests, dmitriev found, were not driven by the unemployed but rather by \"the highly skilled part of the russian population\" that has come to feel as though \"russian society is a two-lane highway, with one lane for the privileged individuals in proximity to state power,\" with its own laws or lack of them, \"and one lane for the rest of the population .\" one phrase, he says, \"suddenly appeared all over the country:\" we are not cattle .' \"this, he says, is when he realized that\" this is a matter of dignity and self-respect. \"this struggle between you and your accidental offspring will play out over a long time. but, good sirs, have no doubt about this: politics is back in russia. watch out. you, mr. putin, will surely win the march presidential election, predicts dmitriev,\" but in a weakened way. \"the putin brand is declining, he says .\" the trend is downward. this will ensure that putin is a weak president with declining support. \"therefore, argues dmitriev, your only hope to remain relevant is to\" set up a coalition government, including the opposition, on the basis of free and fair elections and move toward a more balanced and competitive political system. \"sweet leaf hydro your online supplier for indoor & outdoor hydroponic gardening supplies reflector find reflector online. free shipping $50 on 100,000 items! get all 3 credit scores, it's fast - easy & free! check online now."}, {"articleID": "2014101416_00085741_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}, "date": "2014-10-14", "url": "http://financialexpress.com/news/ifci-invokes-one-lakh-shares-of-bhushan-steel/1298573", "content": "Raj Thackeray beats Shiv Sena, BJP in online battle for Maharashtra polls While Raj Thackeray rules the online roost...Shiv Sena launches fresh attack on BJP, likens its politics to Mulayam...After nude Aamir Khan PK poster, now it is Anushka Sharma's turn Hrithik Roshan's \"Bang Bang' 2nd weekend box office collections make it 3rd best movie of 2014 Market holiday note: Bombay Stock Exchange (BSE), the National Stock Exchange (NSE), Forex, Money markets closed Bajaj Auto Q2 net profit down 29%; hit by one-time charge on Pantnagar unit Bajaj Auto today reported a net profit of Rs 590.90 crore for...India's exports rose by a marginal 2.73 per cent to USD 28.9 billion in September, but trade deficit...Samsung Galaxy Note 4 launched in India; co's most expensive device priced at Rs 58,300 Samsung Galaxy Note 4 comes with an enhanced S Pen...At some point, we'd like to explore content in Indian languages: BuzzFeed's Scott Lamb Companies woefully unprepared for climate events: Standard & Poor's Malala Yousafzai, Barack Obama girls, Lorde make Time's\" influential teens' list Bhushan Steel said that company's one lakh shares, that were pledged by Singal, have been invoked by IFCI Ltd.. Reuters Summary Financial institution IFCI has invoked one lakh shares of Bhushan Steel that were pledged...Over 1 crore shares of Bhushan Steel promoters invoked in August With Neeraj Singhal in jail, debt-laden Bhushan Steel to explore Rs 2,500 crore asset sale Financial institution IFCI has invoked one lakh shares of Bhushan Steel that were pledged by the debt-ridden company's promoter Neeraj Singal. Singal is also Vice Chairman & Managing Director. In a filing to the BSE, Bhushan Steel said that company's one lakh shares, that were pledged by Singal, have been invoked by IFCI Ltd.. As per the filing, 36,732 shares were pledged on October 7 and 27,330 on October 9. Again 5,059 shares were pledged on October 10, followed by 30,879 on October 13. The CBI in August had arrested Singal in connection with alleged Rs 50 lakh bribery scandal involving CMD of Syndicate Bank S K Jain. Meanwhile, the company has denied that lenders are looking at selling it. \"Bhushan Steel is a standard account. Hence, the question of lenders looking at selling it does not arise in this situation,\" a company spokesperson said reacting to media reports. Flipkart, Snapdeal, Amazon invasion to wallop cell phone retail shops: Technopak Future Group chief Kishore Biyani slams huge Flipkart discounts, joins forces with Amazon India Flipkart counters Future Group's Kishore Biyani, says \"prices determined by sellers not company' Hrithik Roshan's\" Bang Bang' box office collections surge, target Rs 300 cr club Hrithik Roshan's \"Bang Bang' box office collections beat <mark>Salman Khan</mark>'s\" Ek Tha Tiger' Bhupinder Singh Hooda asks people \"not to waste' votes on BJP, INLD Diwali offer: Karbonn prices Android One powered Sparkle 5 at Rs 5,999"}, {"articleID": "2017052921_01208568_W", "names": {"Cesar Chavez": ["Q17299958", "Q27983465", "Q5202531"], "Bill Griffin": ["Q16224682", "Q4909225"], "Donald Trump": ["Q22686", "Q27947481"], "Tim Duncan": ["Q193020", "Q7803451"]}, "date": "2017-05-29", "url": "http://www.lmtonline.com/news/article/Two-men-wounded-in-Santa-Rosa-in-gang-related-11180925.php", "content": "http: //www.sfgate.com/news/article/Two-men-wounded-in-Santa-Rosa-in-gang-related-11180925.php Two men wounded in Santa Rosa in gang-related incident By John Wildermuth Updated 4:53 pm, Monday, May 29, 2017 Begin Slideshow 35 Photo: Jacom Stephens, Getty Image Image 1 of / 35 Caption Close Image 1 of 35 File photo of police car lights. Flashing Lights on Police Car File photo of police car lights. Flashing Lights on Police Car Photo: Jacom Stephens, Getty Image Image 2 of 35 2017 SF crime statistics from Jan. 1-April 6 2017 SF crime statistics from Jan. 1-April 6 Photo: Ted Andersen Image 3 of 35 San Francisco has 10 police stations: Central, Northern, Southern, Bayview, Ingleside, Taraval, Richmond, Park, Mission and Tenderloin. The city makes crime data available to the public online through DataSF. San Francisco has 10 police stations: Central, Northern, Southern, Bayview, Ingleside, Taraval, Richmond, Park, Mission and Tenderloin. The city makes crime data available to the public online through DataSF. Photo: SFPD Image 4 of 35 The Mission District covers the area east of Twin Peaks and south of Market Street to <mark>Cesar Chavez</mark> Street. The neighborhood has become a destination spot for specialty restaurants, shops and sunny-day people watching. However, the area has seen a huge rise in thefts in 2017. less The Mission District covers the area east of Twin Peaks and south of Market Street to <mark>Cesar Chavez</mark> Street. The neighborhood has become a destination spot for specialty restaurants, shops and sunny-day people...more Photo: Google Maps Image 5 of 35 Mission Station Captain: <mark>Bill Griffin</mark> Capt. <mark>Griffin</mark> grew up in the Richmond District and attended George Washington High School. His father was a juvenile probation officer with the city for over 30 years and encouraged him to try a career in law enforcement. <mark>Griffin</mark> graduated from the SFPD Academy in 1981 and later earned a degree in Criminal Justice Management. He has served in the Mission, Southern, Park, Northern and Ingleside stations. less Mission Station Captain: <mark>Bill Griffin</mark> Capt. <mark>Griffin</mark> grew up in the Richmond District and attended George Washington High School. His father was a juvenile probation officer with the city for over 30 years and...more Photo: SFPD Image 6 of 35 MISSION STATION: 5,742 records No resolution: 4,018, Arrests: 1,639, Arrest/Citation rate: 28 percent 785 violent crimes (672 in 2016) 2,010 burglaries and thefts (1,140 in 2016) Top crime type: Larceny/Theft, 1,325 incidents (563 cases in 2016) 2017: 601 assaults, 172 robberies, 203 burglaries, 262 vehicle thefts (2016: 521 assaults, 142 robberies, 221 burglaries, 238 vehicle thefts) less MISSION STATION: 5,742 records No resolution: 4,018, Arrests: 1,639, Arrest/Citation rate: 28 percent 785 violent crimes (672 in 2016) 2,010 burglaries and thefts (1,140 in 2016) Top crime type:...more Photo: Godong/UIG Via Getty Images Image 7 of 35 SOUTHERN STATION: Southern District incorporates the Ferry Building, extending to the SOMA, Embarcadero, and China Basin areas. SOUTHERN STATION: Southern District incorporates the Ferry Building, extending to the SOMA, Embarcadero, and China Basin areas. Photo: SFPD Image 8 of 35 Southern Station Captain: Daryl Fong Capt. Fong grew up in the Bayview District and attended school in North Beach. Not ascribing to the traditional academic criminology path, he earned a BS degree in marketing at SFSU and then joined the SFPD in 1994. Fong trained at Richmond Station and served at Central Station as a patrol, plainclothes and school resource officer and has also served as a field training sergeant, internal affairs investigator and media relations spokesman. less Southern Station Captain: Daryl Fong Capt. Fong grew up in the Bayview District and attended school in North Beach. Not ascribing to the traditional academic criminology path, he earned a BS degree in marketing...more Photo: SFPD Image 9 of 35 SOUTHERN STATION: 6,996 records No resolution: 5,010, Arrests: 1,855, Arrest/Citation rate: 26 percent 737 violent crimes (672 in 2016) 2,932 burglaries and thefts (3,133 in 2016) Top crime type: Larceny/Theft, 2,254 incidents (2,319 in 2016) 2017: 604 assaults, 156 robberies, 211 burglaries, 190 vehicle thefts (2016: 560 assaults, 128 robberies, 268 burglaries, 158 vehicle thefts) less SOUTHERN STATION: 6,996 records No resolution: 5,010, Arrests: 1,855, Arrest/Citation rate: 26 percent 737 violent crimes (672 in 2016) 2,932 burglaries and thefts (3,133 in 2016) Top crime type:...more Photo: Ted Andersen Image 10 of 35 CENTRAL STATION: Central Station is located in the center of tourism, commerce, entertainment and civic events. The district comprises the Financial district, Chinatown, North Beach, Fisherman's Wharf, and three famous hills: Telegraph, Nob and Russian. less CENTRAL STATION: Central Station is located in the center of tourism, commerce, entertainment and civic events. The district comprises the Financial district, Chinatown, North Beach, Fisherman's Wharf, and...more Photo: SFPD Image 11 of 35 Central Station Captain: Paul Yep Capt. Yep was born at San Francisco's Chinese Hospital and raised in Chinatown. He attended Lowell High School and earned a BA degree in Business Administration from San Francisco State University. He joined the San Francisco Police Department in 1996, serving as a patrol officer at Central, Northern, Southern and Taraval Police Stations. He has also worked in the Community Relations Unit, Domestic Violence Reduction Unit, Vice Crimes Division, Station Investigations Teams and was the Director of Basic Training for the Police Academy until his promotion to Captain in 2016. less Central Station Captain: Paul Yep Capt. Yep was born at San Francisco's Chinese Hospital and raised in Chinatown. He attended Lowell High School and earned a BA degree in Business Administration from San...more Photo: SFPD Image 12 of 35 CENTRAL STATION: 4,561 records No resolution: 3,683, Arrests: 803, Arrest/Citation rate: 18 percent 433 violent crimes (405 in 2016) 2,301 burglaries and thefts (2,230 in 2016) Top crime type: Larceny/Theft, 1,175 incidents (1,640 in 2016) 2017: 309 assaults, 119 robberies, 206 burglaries, 133 vehicle thefts (2016: 327 assaults, 101 robberies, 141 burglaries, 118 vehicle thefts) less CENTRAL STATION: 4,561 records No resolution: 3,683, Arrests: 803, Arrest/Citation rate: 18 percent 433 violent crimes (405 in 2016) 2,301 burglaries and thefts (2,230 in 2016) Top crime type:...more Photo: Ted Andersen Image 13 of 35 NORTHERN STATION: The Northern District encompasses the Western Addition, Pacific Heights, Japantown, Polk Gulch, Russian Hill and the Marina. Although the Northern District is geographically one of the smallest, it's one of the most densely populated with large apartment buildings, senior citizens' residences, residential hotels, and public housing complexes. less NORTHERN STATION: The Northern District encompasses the Western Addition, Pacific Heights, Japantown, Polk Gulch, Russian Hill and the Marina. Although the Northern District is geographically one of the...more Photo: SFPD Image 14 of 35 Northern Station Captain: John Jaimerena Capt. Jaimerena was born in the Sunset and grew up on the peninsula. He joined SFPD in 1994 and spent much of his early career as a plainclothes and field training officer in the Southern Station. He later worked with the Gang Task Force at Tenderloin Station and became captain of Northern Station in 2016. less Northern Station Captain: John Jaimerena Capt. Jaimerena was born in the Sunset and grew up on the peninsula. He joined SFPD in 1994 and spent much of his early career as a plainclothes and field training...more Photo: SFPD Image 15 of 35 NORTHERN STATION: 5,604 records No resolution: 4,423, Arrests: 1,126, Arrest/Citation rate: 20 percent 436 violent crimes (485 in 2016) 2,883 burglaries and thefts (2,380 in 2016) Top crime type: Larceny/Theft, 2,314 incidents (1,756 in 2016) 2017: 359 assaults, 81 robberies, 234 burglaries, 196 vehicle thefts (2016: 408 assaults, 90 robberies, 224 burglaries, 198 vehicle thefts) less NORTHERN STATION: 5,604 records No resolution: 4,423, Arrests: 1,126, Arrest/Citation rate: 20 percent 436 violent crimes (485 in 2016) 2,883 burglaries and thefts (2,380 in 2016) Top crime type:...more Photo: Ted Andersen Image 16 of 35 PARK STATION: The Park District serves Cole Valley, Haight Street, the Western Addition, Twin Peaks, and the Duboce and Castro areas. They work in patrol cars, on foot beats, patrol wagons and off-road vehicles in and out of Golden Gate Park. less PARK STATION: The Park District serves Cole Valley, Haight Street, the Western Addition, Twin Peaks, and the Duboce and Castro areas. They work in patrol cars, on foot beats, patrol wagons and off-road vehicles...more Photo: SFPD Image 17 of 35 Park Station Captain: John Sanford Jr.. Capt. Sanford was born and raised in the Bayview/Hunters Point area and began his law enforcement career at age 14 as a Police Activities League cadet. Sanford attended Woodrow Wilson High School in San Francisco and holds a B.S. in public administration from the USF and an M.A. in leadership from Saint Mary's. less Park Station Captain: John Sanford Jr.. Capt. Sanford was born and raised in the Bayview/Hunters Point area and began his law enforcement career at age 14 as a Police Activities League cadet. Sanford attended...more Photo: SFPD Image 18 of 35 PARK STATION: 2,258 records No resolution: 1,767, Arrests: 456, Arrest/Citation rate: 20 percent 203 violent crimes (163 in 2016) 893 burglaries and thefts (948 in 2016) Top crime type: Larceny/Theft, 582 incidents (620 in 2016) 2017: 168 assaults, 27 robberies, 130 burglaries, 106 vehicle thefts (2016: 150 assaults, 26 robberies, 148 burglaries, 117 vehicle thefts) less PARK STATION: 2,258 records No resolution: 1,767, Arrests: 456, Arrest/Citation rate: 20 percent 203 violent crimes (163 in 2016) 893 burglaries and thefts (948 in 2016) Top crime type: Larceny/Theft, 582...more Photo: Mathew Sumner, Special To The Chronicle Image 19 of 35 TARAVAL STATION: The Taraval District encompasses a large area of the western part of the city, extending from west of Twin Peaks to Ocean Beach and south to the county line and north to Lincoln Way. The Taraval district is mostly residential and contains many schools and the zoo. less TARAVAL STATION: The Taraval District encompasses a large area of the western part of the city, extending from west of Twin Peaks to Ocean Beach and south to the county line and north to Lincoln Way. The Taraval...more Photo: SFPD Image 20 of 35 Taraval Station Captain: Denise Flaherty Capt. Flaherty grew up in the Mission District and joined SFPD in 1991. She has served in Central, Northern, Taraval, Richmond, Ingleside, Tenderloin and Park districts and has worked in the Narcotics Unit, Burglary Detail, Homeland Security, and in the Tenderloin Task Force. She became Captain of Taraval Station in 2012. less Taraval Station Captain: Denise Flaherty Capt. Flaherty grew up in the Mission District and joined SFPD in 1991. She has served in Central, Northern, Taraval, Richmond, Ingleside, Tenderloin and Park districts...more Photo: SFPD Image 21 of 35 TARAVAL STATION: 3,204 records No resolution: 2,476, Arrests: 662, Arrest/Citation rate: 21 percent 312 violent crimes (257 in Taraval) 1,184 burglaries and thefts (1,292 in 2016) Top crime type: Larceny/Theft, 790 incidents (816 in 2016) 2017: 282 assaults, 50 robberies, 188 burglaries, 145 vehicle thefts (2016: 233 assaults, 47 robberies, 224 burglaries, 150 vehicle thefts) less TARAVAL STATION: 3,204 records No resolution: 2,476, Arrests: 662, Arrest/Citation rate: 21 percent 312 violent crimes (257 in Taraval) 1,184 burglaries and thefts (1,292 in 2016) Top crime type:...more Photo: Stephen Lam, Special To The Chronicle Image 22 of 35 BAYVIEW and INGLESIDE STATIONS: The Bayview District covers one of the largest areas of the southeastern part of the city, extending along the eastern edge of McClaren Park to the bay and south to the San Mateo County line. The Ingleside Police District encompasses the area south of <mark>Cesar Chavez</mark> Street to the San Mateo County line, and area west from Highway 101 to Faxon Avenue and includes Balboa Park, McLaren Park and the Excelsior. less BAYVIEW and INGLESIDE STATIONS: The Bayview District covers one of the largest areas of the southeastern part of the city, extending along the eastern edge of McClaren Park to the bay and south to the San Mateo...more Photo: SFPD Image 23 of 35 Bayview Station Captain: Raj Vaswani Capt. Vaswani has more than 23 years of experience as a police officer, working in patrol, street crimes/narcotics plainclothes, investigative and field operations. He has worked in the Potereo, Ingleside, Southern, Northern, Park and Mission districts. less Bayview Station Captain: Raj Vaswani Capt. Vaswani has more than 23 years of experience as a police officer, working in patrol, street crimes/narcotics plainclothes, investigative and field operations. He has...more Photo: SFPD Image 24 of 35 BAYVIEW STATION: 3,648 records No resolution: 2,619 Arrests: 970, Arrest/Citation rate: 27 percent 476 violent crimes (500 in 2016) 1,143 burglaries and thefts (1,164 in 2016) Top crime type: Larceny/Theft, 686 incidents (650 in 2016) 2017: 426 assaults, 77 robberies, 135 burglaries, 258 vehicle thefts (2016: 468 assault, 64 robbery, 133 burglaries, 272 vehicle thefts in 2016) less BAYVIEW STATION: 3,648 records No resolution: 2,619 Arrests: 970, Arrest/Citation rate: 27 percent 476 violent crimes (500 in 2016) 1,143 burglaries and thefts (1,164 in 2016) Top crime type:...more Photo: Kevin Schultz / The Chronicle Image 25 of 35 Ingleside Station Captain: Joe McFadden Capt. Joe McFadden grew up in the Mission District. With more than 27 years in the SFPD, he began his law enforcement career as an Ingleside station patrol officer and has since served in Field Operations, Tactical (SWAT) Team, Investigations Bureau, Management Control/Internal Affairs, Homeland Security, and Crime Scene Investigations. less Ingleside Station Captain: Joe McFadden Capt. Joe McFadden grew up in the Mission District. With more than 27 years in the SFPD, he began his law enforcement career as an Ingleside station patrol officer and...more Photo: SFPD Image 26 of 35 INGLESIDE STATION: 3,099 records No resolution: 2,270, Arrests: 765 Arrest/Citation rate: 25 percent 411 violent crimes (477 in 2016) 989 burglaries and thefts (1,074 in 2016) Top crime type: Larceny/Theft, 571 incidents (555 in 2016) 2017: 350 assaults, 71 robberies, 159 burglaries, 231 vehicle thefts) (2016: 432 assaults, 89 robberies, 167 burglaries, 278 vehicle thefts) less INGLESIDE STATION: 3,099 records No resolution: 2,270, Arrests: 765 Arrest/Citation rate: 25 percent 411 violent crimes (477 in 2016) 989 burglaries and thefts (1,074 in 2016) Top crime type:...more Photo: PAUL CHINN Image 27 of 35 TENDERLOIN STATION: The Tenderloin District is the smallest of 10 district station areas. The Tenderloin Task Force was created on April 1st 1991 (with SF's first bicycle patrol) to combat high levels of crime in that area and made its headquarters in the basement of the historic Hibernia Bank building. A new headquarters opened in 2000 at 301 Eddy St. less TENDERLOIN STATION: The Tenderloin District is the smallest of 10 district station areas. The Tenderloin Task Force was created on April 1st 1991 (with SF's first bicycle patrol) to combat high levels of crime...more Photo: SFPD Image 28 of 35 Tenderloin Station Captain: Teresa Ewins Capt. Ewins spent her early years in SoCal but moved to the East Bay at age 10. She graduated from the SFPD Academy in 1995 and has since worked in the Southern, Mission, and Bayview stations. She has served in the Homeland Security Unit, the Special Victims Unit and the Fugitive Recovery Enforcement Team and led the Tactical Division before becoming Tenderloin Station captain in 2015. less Tenderloin Station Captain: Teresa Ewins Capt. Ewins spent her early years in SoCal but moved to the East Bay at age 10. She graduated from the SFPD Academy in 1995 and has since worked in the Southern,...more Photo: SFPD Image 29 of 35 TENDERLOIN STATION: 2,336 records No resolution: 1,303, Arrests: 984, Arrest/Citation rate: 42 percent 329 violent crimes (408 in 2016) 588 burglaries and thefts (680 in 2016) Top crime type: Larceny/Theft, 427 incidents (479 in 2016) 2017: 262 assaults, 75 robberies, 42 burglaries, 33 vehicle thefts (2016: 340 assaults, 89 robberies, 44 burglaries, 39 vehicle thefts) less TENDERLOIN STATION: 2,336 records No resolution: 1,303, Arrests: 984, Arrest/Citation rate: 42 percent 329 violent crimes (408 in 2016) 588 burglaries and thefts (680 in 2016) Top crime type:...more Photo: Ted Andersen Image 30 of 35 RICHMOND STATION: Covering the northwest corner of the city, the Richmond District is largely residential, but also includes the commercial, shopping, and restaurant corridors of Geary Boulevard and Clement Street, most of Golden Gate Park, the Golden Gate National Recreation Area and the University of San Francisco campus. less RICHMOND STATION: Covering the northwest corner of the city, the Richmond District is largely residential, but also includes the commercial, shopping, and restaurant corridors of Geary Boulevard and Clement...more Photo: SFPD Image 31 of 35 Richmond Station Captain: Alexa O’Brien Capt. Alexa O’Brien grew up in the Marina and Richmond districts. She earned a BA degree in sociology with a minor in criminology from USF before graduating from the SFPD academy in 2000. She has served at Southern, Mission, Northern, Park and Ingleside stations. In addition, she has served in Vice and Night Investigations and led the Homicide Detail and Major Crimes Unit. less Richmond Station Captain: Alexa O’Brien Capt. Alexa O’Brien grew up in the Marina and Richmond districts. She earned a BA degree in sociology with a minor in criminology from USF before graduating from the...more Photo: SFPD Image 32 of 35 RICHMOND STATION: 2,355 records No resolution: 1,892, Arrests: 409, Arrest/Citation rate: 18 percent 150 violent crimes (147 in 2016) 1,148 burglaries and thefts (1,143 in 2016) Top crime type: Larceny/Theft, 871 incidents (828 in 2016) 2017: 115 assaults, 23 robberies, 107 burglaries, 88 vehicle thefts (2016: 128 assaults, 21 robberies, 106 burglaries, 148 vehicle thefts in 2016) less RICHMOND STATION: 2,355 records No resolution: 1,892, Arrests: 409, Arrest/Citation rate: 18 percent 150 violent crimes (147 in 2016) 1,148 burglaries and thefts (1,143 in 2016) Top crime type:...more Photo: Liz Hafalia, The Chronicle Image 33 of 35 Violent crime throughout San Francisco in 2017. Violent crime throughout San Francisco in 2017. Photo: Ted Andersen Image 34 of 35 Thefts and burglaries throughout San Francisco in 2017. Thefts and burglaries throughout San Francisco in 2017. Photo: Ted Andersen Image 35 of 35 Two men wounded in Santa Rosa in gang-related incident 1 / 35 Back to Gallery Two men were hospitalized after being shot as they were walking on the Newhall Bike Path in Santa Rosa, police said Monday. The shootings occurred shortly before 10 p.m. Sunday. Officers were sent to to the 1300 block of Grand Avenue in response to a report of a gunshot victim. As they were on their way to the site, they learned of a second gunshot victim in the 500 block of Colgan Avenue, police said in a statement. The victims were taken to a local hospital where they are listed in serious, but stable condition. The victims, whose names were not released, were leaving Martin Luther King Park and were walking home via the bike path, when they were confronted by several suspects and at least one shooter, police said. The victims immediately fled the area seeking safety and assistance. Detectives from the Gang Crimes Team were called to assist and take over the investigation. The detectives believe the shooting was a targeted incident and gang-related. police said. Related Stories Man killed by Vacaville police after car chase Alternative courts for veterans show promise Mountain View man arraigned on child porn, cyberstalking charges The Santa Rosa Police Department is encouraging anyone who witnessed or has information regarding the incident to call the Gang Crimes Team at (707) 543-3670. A reward up to $2,500 is being offered by the Sonoma County Alliance \"Take Back Our Community Program .\" The reward is for information leading to the arrest and conviction of the suspects involved in this shooting. John Wildermuth is a San Francisco Chronicle staff writer. Email: jwildermuth @ sfchronicle.com Twitter: @ jfwildermuth The Latest U2's Bono made time to visit George W. Bush during the band's...\"It's sexist': Men flip out over women-only\" Wonder Woman'...Texas OKs upping combative board of ed's textbook veto power Budget totaling $216.8 billion is approved Toddler \"alert, smiling' after missing a day in Houston-area...Texas approves banning drones over stadiums, prisons Texas approves extending exam reprieve for some students Searching for killers, Texas Rangers post cold cases online Rockers U2 made a pit stop at a Whataburger after their...Photo: Retired Spurs star spotted at TX convenience store Best places to eat on a Texas road trip Supermodel suffers a second wardrobe malfunction Leaving Netflix, HBO June 2017 Most Popular 1 LPD: Suspect who hit three women with vehicle in custody 2 14-year-old boy electrocuted in central Laredo during severe...3 The best burgers in Laredo, according to Yelp 4 10 things to do in Laredo for Memorial Day weekend 5 Martin player with Down syndrome shines in All-Star game win 6 Manu Ginobili backs J.K. Rowling's trolling of <mark>Donald Trump</mark> 7 Photo: <mark>Tim Duncan</mark> spotted at San Antonio-area convenience store 8 Missing Tennessee teenager found, father arrested 9 Man found guilty of murdering 3-year-old in Laredo motel room 10 DAVID TAMEZ View Comments © 2017 Hearst Communications, Inc. ."}]