[{"date": "2014-10-28", "url": "http://paddocktalk.com/news/html/modules.php?op=modload&name=News&file=article&sid=266354&newlang=&topic=39&catid=67", "content": "2014 Martinsville II (Chase 7): NASCAR Sprint Cup - Sunday Notebook Dale Earnhardt Jr Wins At Martinsville As Calamity Strikes Chase Favorites 2014 Martinsville II (Chase 7): NASCAR Sprint Cup Race Results - Earnhardt Jr, Chevrolet Win! 2014 Malaysian GP (Sepang): MotoGP Race Results - Marquez Wins! Equals Doohan's Record Posted by: newsla on Oct 28, 2014 - 06:12 AM 2014 IHRA Hot Rod Champion <mark>Tony Jones</mark> Only this time, there was much, much more at stake. <mark>Jones</mark> secured his second ever victory in IHRA competition at the IHRA Summit Racing Equipment World Finals at Memphis International Raceway earlier this month, clinching the Hot Rod World Championship in the process when he bested Fowler for the second time in as many tries during the Summit Racing Equipment Tournament of Champions presented by AMSOIL. With a championship on the line, <mark>Jones</mark>, a newcomer to IHRA competition, bested Fowler with a .024 reaction time paired with a 10.911-second pass in the 10.90 index class at 140.39 mph while Fowler, who had been spot-on all afternoon, ran a tick too quick with a 10.898 at 142.81 mph. The win gave <mark>Jones</mark> a championship in his first season out with the IHRA after finishing third in Division 4, capping off what can only be described as a dream season for <mark>Jones</mark>. \"I have pinched myself a couple of times, but it still really hasn't sunk in just yet that I won it,\" <mark>Jones</mark> said. \"All afternoon I just took it a round at a time. After every round we kept thinking it is just three more rounds, just two more rounds and then just one more round. In the winner's circle, my buddy looked at me and simply said\" zero more rounds' and it sort of clicked that we had just won it. \"After a long afternoon that included wins over the best-of-the-best in IHRA's Hot Rod category, the irony did not escape <mark>Jones</mark> as he went up against Fowler for the second time this season in Memphis .\" I really didn't think I could beat him twice. The first time we went to Memphis and beat him, he treed me. This time he stuck me in the left lane and I ended up treeing him. It was a great race, there were a lot of nerves, but the good Lord took the anxiety away from me and we were able to get the win, \"<mark>Jones</mark> said. <mark>Jones</mark>' afternoon included wins over two divisional champions and a divisional runner-up after he himself barely managed to hold on to a spot in the field. <mark>Jones</mark> entered the final race of the divisional season as the points leader in Division 4, but two poor showings plummeted him to third in the standings - the cutoff point to make the tournament. But in Memphis, <mark>Jones</mark> proved he belonged. Driving his bright yellow '67 Camaro, <mark>Jones</mark> bested Joe Tillman, Dakota Lowery and Ricky Roe to secure his place in the finals. All three rounds proved a challenge, with <mark>Jones</mark> using a .003 light to overcome Tillman's 10.915 in round one and a near-dead on 10.902 with a .009 light was needed in the semifinals to best Roe's 10.907 with a .009 tree, moving <mark>Jones</mark> into the championship bout. Championship runner-up Fowler had wins over <mark>Chris Dean</mark>, Tim Andersen and 2014 IHRA Sportsman Driver of the Year John Dustin, capping a great year for the Point Pleasant, West Virginia native who had one win and championship in Division 3 behind the wheel of the Friends of Coal sponsored 1980 Camaro .\" This whole thing has been like a dream come true. You pray for something like this, but people like me, we are just out here enjoying the sport. People like us just don't win these things, \"<mark>Jones</mark> said. Ironically, <mark>Jones</mark>' championship season almost didn't happen. It took the urging of longtime friend Roger Massey, himself an accomplished Top Sportsman racer, to get <mark>Jones</mark> out to his first IHRA event. From there, things just clicked for the Gilmer, Texas native .\" A friend of mine convinced me to give IHRA a try this year and from the very start, every time I went to a race, I found myself going rounds, \"<mark>Jones</mark> said .\" It was so different, so relaxing to run IHRA. I found myself right at home and before long we found ourselves leading the division. We almost gave it away in our final race, but we were able to hang on and get to Memphis. \"With the win, <mark>Jones</mark> will earn the coveted No. 1 for his car as he plans to continue racing with the IHRA and defend his championship in 2015. 2014 NHRA: Circle K Renews Sponsorship Of Tradition-Rich NHRA Winternationals To Open 2015 NHRA Mello Yello Series Season 2014 NHRA: It's Deja Vu All Over Again For Past Pro Mod Champion Coughlin 2014 NHRA: Brittany Force To Race Special Rookie Of The Year Dragster Starting In Vegas 2014 NHRA: Shoe's Latest News And Notes From Don Schumacher Racing 2014 NHRA: Courtney Force, Erica Enders-Stevens Eye History, World Championships Heading To NHRA Toyota Nationals In Las Vegas 2014 NHRA: NHRA Mello Yello Drag Racing Series: Erica Enders-Stevens, Courtney Force And John Force 2014 NHRA: NHRA Mello Yello Countdown To The Championship Returns To Southern California Where Series Crowns Will Be Decided 2014 NHRA: Aeromotive Inc Named Sponsor Of Season-Ending NHRA Pro Mod Drag Racing Series Las Vegas Event 2014 NHRA: John Force Accepts Crew Chief Jimmy Prock's Resignation Today 2014 NHRA: T.J. Coughlin Hopes To Hit Jackpot At Million Dollar Race 2014 NHRA: NHRA Funny Car World Champion Raymond Beadle: 1943-2014 Top NHRA Rookies Make Last Push Toward Auto Club Of Southern California Road 2014 NHRA: Tucker Regroups For Better Battle Against His Yankee Counterparts All logos and trademarks in this site are property of their respective owner.", "articleID": "2014102810_00049366_W", "names": {"Tony Jones": ["Q1798305", "Q20710818", "Q22673586", "Q4160430", "Q53812649", "Q7822672", "Q7822675", "Q7822676", "Q7822677", "Q7822678", "Q7822679", "Q7822680"]}}, {"date": "2014-10-29", "url": "http://www.miamiherald.com/sports/nhl/article3428124.html#storylink=rss", "content": "Mike unplugged: Dolphins' Wallace rips team's offensive production Job fair planned during Fort Lauderdale International Boat Show Ana Veciana-Suarez: With grandparents, it's twice the love, twice the vulnerability Trailblazing Coconut Grove photographer, Klara Farkas, dies at 103 To place an obituary, please call 305-376-8901 or email Print Gordie Howe's health failing; suffered stroke Sunday Mark Howe told his children: Go see my father, because his health is failing. The message prompted Howe's daughter, Azia, to take her youngest child, Lahna, to see Gordie Howe this past weekend. It may be the last time they do so. Gordie Howe, the Detroit Red Wings legend so synonymous with the sport he became known as Mr. Hockey, suffered a stroke this past Sunday, one day after enjoying a pleasant stroll in Lubbock, Texas, with Azia and Lahna Howe. Gordie Howe has been staying in Lubbock with his daughter, Cathy, and sons Mark, Marty and Murray all spent Tuesday en route to join their sister, and in all likelihood say goodbye to their dad. \"He had a bad stroke a couple of days ago, and I tried to do some FaceTime with him, and he looked really bad yesterday,\" Mark Howe said Tuesday evening during a layover in Denver. \"He's pretty well immobile. It's not good, but at least my daughter spoke to him today, and said she understood a couple of words, which is very encouraging .\" We're keeping our fingers crossed, If anybody can recover, I know Dad can. \"Gordie, 86, suffers from dementia. In September, Mark Howe revealed to the Free Press that Gordie had had a very bad summer, one punctuated by mini strokes .\" The doctor said those mini strokes would gradually get worse and worse, \"Mark said .\" With the type of dementia he has, the long-term outlook is not good. Dad was with me most of summer, and he had a very difficult summer. He had surgery, and that got rid of some of the pain. But he had small strokes, and we were told there were ultimately going to be bigger and bigger ones. That was predicted six months ago. And that's been the case. \"I told my kids earlier this summer, my dad's health not what it should be. That's why my daughter went to Lubbock on Saturday, brought her little 1-year-old. They had a wonderful day, went for a long walk with dad .\" Sunday morning, he had the stroke. \"By this evening, messages of support poured in to the Howe family. Canadian Prime Minister <mark>Stephen Harper</mark> tweeted,\" Wishing my friend Gordie Howe all the best, you're in all of our thoughts and prayers. \"Oops, you haven't selected any newsletters. Please check the box next to one or more of our email newsletters and submit again. Oops, you didn't provide a valid email address. Sports (Monday - Friday) Heat. Dolphins. Marlins. Panthers. Get into South Florida sports with Dan LeBatard, Greg Cote & the crowd. Dolphins Get the latest Dolphins news, stats, injury reports - sent weekdays during the season. College Sports (Monday - Friday) UM & other Florida colleges: Keep up with your favorite teams. 5-Minute Herald (Monday - Friday) The best of the morning's Miami Herald.", "articleID": "2014102901_00062153_W", "names": {"Stephen Harper": ["Q206", "Q7609425"]}}, {"date": "2014-10-29", "url": "http://dailyranger.com/story.php?story_id=15096&headline=Election-Matchup:-Fremont-County-Commission,-District-4", "content": "The Ranger (beta) Fremont County's Daily Newspaper Election Matchup: Fremont County Commission, District 4 Oct 29, 2014 - By <mark>Eric Blom</mark>, Staff Writer Independent incumbent Stephanie Kessler faces former Fremont County planning director <mark>Ray Price</mark> in the race for Fremont County Commission District 4, which covers most of Lander and Hudson. Kessler was elected in 2012 after redistricting split a commissioner term into two, two-year terms. <mark>Price</mark> won the Republican primary in August, beating out Kathleen Cramer Averill to face Kessler. Stephanie Kessler - Independent - 59 years old - District 4 commissioner for two years, Fremont County School District 1 trustee for four years - Bachelor's degree in environmental education, master's in education policy and planning - Three children with husband John Gans - Works as consultant to non-profits and governmental agencies Views on...low median income in county \"One of the most important things that can help bring good paying jobs to our community is to absolutely ensure that we have reliable, quality airplane service, or else we will just get overlooked,\" Kessler said. \"As companies that are footloose...will just overlook us if they can't have reliable air service .\" Recreation opportunities make the Lander area an attractive place to live and can help bring companies to the area, she said. \"The commission needs to be understanding every community has its own unique flavor that makes it attractive for economic development and focus on infrastructure, roads, commercial air service, safety and some core services like ambulance .\" Views on...funding for flood study Kessler said she supports contributing to a flood study for the Lander area--$40,000 in the current budget and $40,000 planned for next year. \"When you look at all the county spends on a diversity of things, the current $40,000 that we have committed for planning for what is a huge issue in terms of public health and safety, life and property--it's an excellent use of our funds,\" she said. \"The more we can plan (and) address problems before they happen is money saved years down the line .\" Views on...new solid waste facility hours \"What I am impressed with is they brought in an outside expert to look at their operations and help them find savings. In the long term, they have to develop a fund for their future liabilities,\" Kessler said. \"I think they have tried when they have heard feedback from communities to make adjustments and changes .\" She thinks the Fremont County Solid Waste Disposal District is doing the best it can to balance its future needs with those of the communities, Kessler said. \"Some of us have had to find the days of free dumping of your trash are gone,\" she said. <mark>Ray Price</mark> - Republican - 66 years old - Retired after 36 years as Fremont County planning director - Master's degree in public administration and in geology, bachelor's degree in physical geography - Has two adult daughters, one in Lander - Episcopal priest for 10 years Views on...low median income in county \"To be quite honest, perhaps Fremont County may have a disparity against employees and what they need to be paid,\" <mark>Price</mark> said. \"I think that's evident in Fremont County government, and I think it's not just wages or benefits. He thinks the issue of a low median income in Fremont County is not just limited to the public sector, however .\" I think there's a feeling in a lot of places in the county that employees are...I don't think they're treated as well as they should be, \"<mark>Price</mark> said .\" I think if you treat employees with respect they're going to give back to you in spades. \"Views on...funding for flood study\" I think it is if it's an accurate study (the county should contribute to it), \"<mark>Price</mark> said. Lander and the Popo Agie Conservation District had been working on the flood study issue for years, he said .\" To me I think that the federal government has just as good of information as anybody else, so I think we should just use what the feds give us, \"<mark>Price</mark> said .\" It may not be completely accurate, but there are so many variations in any kind of flood; it's not a black and white kind of thing. \"Views on...new solid waste facility hours\" Being closed on Sunday and Mondays, I guess it's certainly an inconvenience to me as someone who takes my own stuff out to the landfill, and it's too bad, \"<mark>Price</mark> said. He voiced support for the Fremont County Solid Waste Disposal District Board's decision to allow Wyoming Waste Systems and the City of Riverton to bring trash to landfills on Mondays through January.", "articleID": "2014102921_00068216_W", "names": {"Eric Blom": ["Q20016879", "Q42922062"], "Ray Price": ["Q17628225", "Q1929135", "Q7297980", "Q7297981", "Q7297982", "Q7297987"]}}, {"date": "2014-10-31", "url": "http://www.hvpress.net/news/130/ARTICLE/14340/2014-10-31.html", "content": "October 31st, 2014 <mark>Sean Maloney</mark> is Your Man for Congress If you are looking for a Congressional representative that has demonstrated he is focused on helping his constituents, then search no further. <mark>Sean Maloney</mark> has been doing that for two years. If you want someone who has demonstrated he is willing to work \"across the aisle' to get something done in Congress, then <mark>Sean Maloney</mark> is your man. Congressman <mark>Maloney</mark> was instrumental in getting the EPA to complete the cleanup process for a contaminated site on the Hudson River. He and his team were key drivers to getting the EDA grant which saved 180 jobs in Newburgh and New Windsor and created the opportunity for more new jobs. <mark>Sean</mark> is a strong advocate for\" equal pay for equal work \"and for\" a woman's right to choose. \"He has authored and shepherded the Disabled Veterans Red Tape Reduction Act which shortens the wait time for veterans with disability claims. Additionally, he has been a partner in helping veterans with many other issues. Voters in the Hudson valley can expect leadership in Congress with <mark>Sean</mark>, not some silly phony baloney rhetoric from someone whose chief claim to fame is creating more polarization in Congress. Stars - Excellent Stars - Good Stars - Average Stars - Fair Stars - Poor Copyright 2006-2014 The Hudson Valley Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Copyright © 2006-2014 Hudson Valley Press.", "articleID": "2014103121_00005633_W", "names": {"Sean Maloney": ["Q50909122", "Q7441191", "Q7441192", "Q7441194"]}}, {"date": "2014-11-01", "url": "http://granitefallsnews.com/article/ZZ/20141101/NEWS/311019998/10063/ENTERTAINMENT", "content": "Local real estate broker, Edman, opens Exit Realty Scenic Valley Morning Jolt: At least 3,000 UNC student-athletes may have cheated <mark>Mike Tyson</mark> says he was sexually abused by an older man as a child. In an interview with Opie Radio this week, <mark>Tyson</mark> said that at age 7, an older man \"bullied me, sexually abused me and stuff...snatched me off the street .\" <mark>Tyson</mark>, 48, claims he ran away and never saw the man again. The former boxing champ never reported the abuse, which he says only happened once. \"It's nobody's business to know,\" he said during the interview. <mark>Tyson</mark> was doing the interview to promote his new show <mark>Mike Tyson</mark> Mysteries. In 1992, <mark>Tyson</mark> himself was convicted of raping a woman and was sentenced to six years in prison. He was released in 1995. Sign up for our newsletter and have the top headlines from your community delivered right to your inbox. © Copyright 2006-2014 Gatehouse Media, Inc.. Some rights reserved Gatehouse Media Publications Original content available for non-commercial use under a Creative Commons license, except where noted.", "articleID": "2014110121_00021601_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}}, {"date": "2014-11-02", "url": "http://www.aikenstandard.com/article/20141101/AIK0106/141109937/-1/feed&source=RSS", "content": "Aiken, Midland Valley bands combine on patriotic songs Residents fight flurries for Apple Fest ACC ROUNDUP: Thomas, Days lift Georgia Tech past Virginia Five area teams learn playoff path MYSTERY PLANT: Look of flower is definitive ON THE MONEY: Gifts of appreciated property can save taxes Local man cares for family's truck Author translates Italian diaries in new WWII book Can space industry survive two explosions in four days? AP Photo/Ringo H.W. Chiu National Transportation Safety Board Acting Chairman Christopher A. Hart speaks in a press conference on the crash of SpaceShipTwo on Saturday, Mojave, California. The explosion killed a pilot aboard and seriously injured another while scattering wreckage in Southern California's Mojave Desert, witnesses and officials said. WASHINGTON, D.C. - Fiery failures are no stranger to the space game. It's what happens when you push the boundaries of what technology can do, where people can go. And it happened again to Virgin Galactic's SpaceShipTwo. In the past decade, the space industry has tried to go from risky and government-run to routine private enterprise - so routine that if you have lots of money you can buy a ticket on a private spaceship and become a space tourist. More than 500 people have booked a flight, including Justin Bieber, Ashton Kutcher and little known space scientist Alan Stern. But it all depends on flying becoming safe and routine. This week hasn't helped. Three days after a private unmanned rocket taking cargo up to the International Space Station blew up six seconds into its flight, a test flight of SpaceShipTwo exploded Friday over the Mojave Desert with two people on board. The developments reignited the debate about the role of business in space and whether it is or will ever be safe enough for everyday people looking for an expensive 50-mile-high thrill ride. \"It's a real setback to the idea that lots of people are going to be taking joyrides into the fringes of outer space any time soon,\" said John Logsdon, retired space policy director at George Washington University. \"There were a lot of people who believed that the technology to carry people is safely at hand .\" The question for space tourism might be, \"if it survives,\" Logsdon said. But he thinks its momentum in recent years will keep it alive. Virgin Galactic founder Richard Branson expressed the same view Saturday after arriving in Mojave, California, to meet with the project workforce reeling from the accident. \"We would love to finish what was started some years ago, and I think pretty well all our astronauts would love us to finish it, love to go to space,\" he said. \"Millions of people in the world would love to one day have the chance to go to space .\" Federal estimates of the commercial space industry - only a little of it involving tourism - exceed $200 billion. NASA is counting on private companies such as SpaceX and Orbital Sciences to haul cargo to the space station. They are also spending billions to help SpaceX and Boeing build ships that will eventually take people there, too. Internet pioneers Elon Musk and Jeff Bezos have gotten into the space game. Aviation entrepreneur Branson and others are pushing a billion-dollar space tourism industry. The Virgin Galactic and Orbital accidents have nothing in common except the words private space, Stern said. Still it raises issues about the space industry. Some experts said they worry that private industry may just not be as safe as the government when it comes to going into space. Jerry Linenger, a former astronaut who narrowly survived a 1997 fire on the Russian space station Mir, said private industry lacks the experience and the advocates for safety that NASA had when he was launching into space. He pointed to former moonwalking astronaut <mark>John Young</mark>, who NASA encouraged to raise safety issues and slow things down. Watching the Orbital Sciences accident on Tuesday, Linenger said, \"it was blatantly obvious that it is a dangerous operation that is very nearly on the edge,\" yet private companies talk of doing it better, faster and cheaper. Then they find out that was naive, he said. American University space policy professor Howard McCurdy, who wrote the book \"Space and the American Imagination,\" said NASA in the 1990s and private companies tout lean management to get things done faster, better and cheaper in space. But he said that leaves no margin for error and \"is like flying an airplane without a qualified pilot. You really need to do it right .\" McCurdy pointed to all the Silicon Valley whiz kids in space and worried that they come with the same Microsoft attitude of pushing a product out and fixing it on the fly. \"I'm not sure that works for rocket ships,\" McCurdy said. \"That may work for cellphones, smartphones and computer programs .\" With space, he said, \"you're working much closer to the edge .\" Logsdon said he wouldn't fly on commercial space flights now, but Virgin Galactic customer Alan Stern said he had no qualms about it: \"Let's not be Chicken Littles,\" he said. He recalled the early days of aviation or the early days of jet test piloting in the 1940s, 1950s and 1960s, when people died pushing the boundaries of technology. McCurdy said the private space industry seems to be having the same growing pains and failures that NASA and the military had when the first astronauts watched a rocket blow up in front of them. It seemed that in the first five years of U.S. rockets, one blew up every other week, but it wasn't quite that bad, said Roger Launius, associate director of the National Air and Space Museum. This week seems a lot like those old times, he said. Launius wonders if the public will support private efforts despite the visible failures, and can the for-profit companies tolerate the risk that comes with space and accidents. Orbital's stock price has dropped 13 percent since Tuesday's accident. \"I want to be part of the opening of this future frontier,\" the former associate administrator of NASA said. \"I want to make that better future a reality .\" No frontier has been one without the risk of life and limb, \"he added .\" I stand with the brave pioneers of space who do this for all mankind. \"Seth Borenstein can be followed at http: //twitter.com/borenbears Aiken Standard is pleased to offer readers the enhanced ability to comment on stories. Some of the comments may be reprinted elsewhere in the site or in the newspaper. We ask that you refrain from profanity, hate speech, personal comments and remarks that are off point. We do not edit user submitted statements and we cannot promise that readers will not occasionally find offensive or inaccurate comments posted in the comments area. If you find a comment that is objectionable, please click the X that appears in the upper right corner when you hover over a comment. This will send the comment to Facebook for review. Please be reminded, however, that in accordance with our © 2014, Aiken Standard, an Evening Post Industries company.", "articleID": "2014110204_00005288_W", "names": {"John Young": ["Q107667", "Q11866773", "Q1452172", "Q16187378", "Q16723279", "Q16860770", "Q19325843", "Q21068890", "Q22336939", "Q24207181", "Q28611549", "Q3182207", "Q3182798", "Q37839006", "Q43395334", "Q43396131", "Q46733032", "Q6245076", "Q6265191", "Q6265194", "Q6265198", "Q6265201", "Q6265212", "Q6265220", "Q6265226", "Q937340"]}}, {"date": "2014-11-04", "url": "http://www.mtbeurope.info/news/2014/1411003.htm", "content": "Auspherix secures AU $1m from MRCF to advance novel antibiotics pipeline Auspherix Pty Ltd, an early stage company developing novel antibiotics to treat bacterial drug resistance, has announced that it has secured a further with AU $1 million in a series A financing from Australia's Medical Research Commercialisation Fund (MRCF). It has also strengthened its research team. In less than 12 months since its foundation 2013, Auspherix has identified a number of antibacterial compounds with broad spectrum activity against a panel of clinical isolates of antibiotic resistant Gram-positive and Gram-negative bacteria. Through a hit-to-lead programme conducted in collaboration with Domainex, Auspherix now has a better understanding of the SAR necessary to target the organisms and has improved the antibiotic activity of the initial compounds. The new investment will be used to further refine the lead compound series, and to screen these in in vivo models in collaboration with Evotec (previously Euprotec). Auspherix has adopted a virtual business model with research being directed by Professor Ian Charles CSO and founder of Auspherix, who is Director of the ithree institute at the University of Technology Sydney (UTS). The founding intellectual property behind Auspherix was in-licensed from the ithree institute based on research led by Professor Charles, together with Dr Dagmar Alber, ithree Senior Research Fellow. Professor Charles and Dr Alber previously worked together successfully at Arrow Therapeutics as CSO and head of virology respectively. The scientific team has been further strengthened by the appointment of Dr <mark>Ian Holmes</mark> as head of chemistry alongside Dr Alber as head of biology. Dr <mark>Holmes</mark> is an experienced medicinal chemist and pre-clinical project leader with a proven track record of program milestone delivery in large pharma and biotech environments. Past positions include Director of Medicinal Chemistry at Cancer Therapeutics CRC, Melbourne, Australia and prior to that at GSK. Auspherix has appointed two independent consultants to advise the Company: Dr Alan Naylor and Dr Mike Tarbit. Prior to his consulting career Dr Naylor spent 30 years in medicinal chemistry at GSK, latterly as Vice President, Head of Strategy and Operations and Director of Medicinal Chemistry at a UK-based centre of excellence in drug discovery. Dr Tarbit's career has spanned biotech and pharma, including at Inpharmatica, ArQule, GSK and Pfizer. Professor Charles said, \"It is now widely recognized that we desperately need to find new ways to combat infectious diseases including resistant bacterial infections. At Auspherix we are making rapid advances in optimizing potential antibacterial compounds with completely novel chemical structures which, if successful, will deliver the drugs needed to keep the threat from superbugs in check .\" Commenting on the second tranche of investment into Auspherix, <mark>Stephen Thompson</mark>, Chairman of Auspherix and Partner at Brandon Capital, the venture capital firm that manages the MRCF said \"Auspherix has made astonishing progress in less than a year, successfully achieving all of the key milestones. The potential to bring a new class of anti-infectives to market is an extremely exciting opportunity and we are pleased to have made an additional investment into the Company .\" ", "articleID": "2014110416_00090767_W", "names": {"Ian Holmes": ["Q22005026", "Q37389869", "Q5981826", "Q5981830"], "Stephen Thompson": ["Q11253984", "Q18588210", "Q57878587", "Q59587831", "Q7610676", "Q7610677", "Q7610681", "Q782348"]}}, {"date": "2014-11-05", "url": "http://theherald.com.au/story/2677524/hunt-for-two-men-raiding-hunter-drug-dealers/?cs=2452", "content": "h1 itemprop = \"name\" > Hunt for two men raiding Hunter drug dealers HUNTER: Two men are allegedly breaking into drug dealers' homes armed with knives and swords. Police have issued warrants for the arrest of Michael John Carroll, left, and <mark>Kevin Francis</mark> Sams. TWO men are allegedly breaking into drug dealers homes in Maitland armed with knives and swords and doing whatever it takes to escape with as many drugs as they can carry. Victims have told police the men have allegedly threatened to \"torch them\" and are not afraid to assault them if they do not hand over their illicit drugs. The pair have hit drug dealers in Tenambit, East Maitland and Cessnock in the past seven days. Their last-know hit was in Maize Street, Tenambit last week. Police believe they consume the drugs and then conduct another home invasion when their supply runs out. They have no idea how many other victims are out there because drug dealers are reluctant to report the matter to police. Police allege Michael John Carroll and <mark>Kevin Francis</mark> Sams are behind the home invasions and have issued warrants for their arrest. Central Hunter acting crime manager Acting Detective Inspector Mitch Dubojski said police were deploying every possible resource to track them down. He believed they were staying in the Rutherford area. \"We strongly urge anyone who sees them to notify police and make sure they do not to approach them as they could be dangerous,\" Acting Detective Inspector Dubojski said. \"At the very least we believe they are carrying knives and swords .\" Blind woman Gisele Mesnage sues Coles over online shopping website Herald Half-Time Rd5: Homecoming for Jets, but is Victory a stretch?", "articleID": "2014110521_00057827_W", "names": {"Kevin Francis": ["Q1740144", "Q26706887", "Q6396315", "Q6396316"]}}]