[{"articleID": "2020030516_00029207_W", "names": {"Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"]}, "date": "2020-03-05", "url": "https://www.morningstaronline.co.uk/article/b/scotland-to-reconsider-closure-of-nhs-laundry-services-due-to-coronavirus-spread", "content": "Thursday, March 5, 2020 Scotland to reconsider closure of NHS laundry services due to coronavirus spread × You can read 9 more articles this month Please help support the Morning Star by subscribing here THE decision to close NHS laundry services in Scotland will be reconsidered as part of planning to deal with a coronavirus pandemic following pressure from Labour today. Scottish party leader <mark>Richard Leonard</mark> secured a commitment from First Minister Nicola Sturgeon at Holyrood after he raised concerns about the closure of half of the sites serving hospitals north of the border. Discussions are ongoing about whether mainland Scotland should be left with just four laundries. Mr <mark>Leonard</mark> called on Ms Sturgeon to \"give an undertaking to ensure the necessary funding and resources are available to councils and the NHS\" and to \"place a moratorium\" on the plans to reduce the number of laundries. In response, the First Minister said no decision would be taken on the laundries which could adversely affect the Scottish government's response to coronavirus. She added that no final options had been presented to ministers on the potential closures, which would affect dozens of staff in Tayside and Fife. Ms Sturgeon was also asked to given councils the necessary resources to ensure that hygiene levels are maintained. Mr <mark>Leonard</mark> added that he had spoken to council leaders who were worried about the capacity of social-care services across Scotland. He asked Ms Sturgeon how the government planned to meet its Coronavirus Action Plan commitment to \"support early discharge from hospital,\" given that Scotland's NHS is struggling to discharge patients on time. She responded by pointing to increased resources for local government in the 2020-21 budget to cover cleaning services. The news coincided with the government warning that the number of confirmed cases of coronavirus in Scotland could rise \"very rapidly\" in the coming days. Ms Sturgeon also made clear that the Department for Work and Pensions must ensure that universal credit claimants who have to self-isolate are not sanctioned for following medical advice. With some workers not eligible for sick pay if they are affected, she said the British government should set up immediate hardship grants for people in this situation. Others liked Tuesday 03rd Mar 2020 Russell Group \"running scared' of reputational damage from UCU strike Wednesday 04th Mar 2020 British state linked to yet another set of killings in the north of Ireland Wednesday 04th Mar 2020 Red ambition: the Connolly Youth Movement in 2020 Wednesday 04th Mar 2020 Chairman of local Tory association resigns after telling SNP MEP to\" go back to the country of your birth' Tuesday 03rd Mar 2020 INTERVIEW From Bakers Oven worker to trade union leader Join the 501 Club You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by joining the 501 club. Just £ 5 a month gives you the opportunity to win one of 17 prizes, from £ 25 to the £ 501 jackpot. By becoming a 501 Club member you are helping the Morning Star cover its printing, distribution and staff costs--help keep our paper thriving by joining! Join here \"Buy Shares You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by become a member of the People's Printing Press Society. The Morning Star is a readers' co-operative, which means you can become an owner of the paper too by buying shares in the society. Shares are £ 1 each--though unlike capitalist firms, each shareholder has an equal say. Money from shares contributes directly to keep our paper thriving. Some union branches have taken out shares of over £ 500 and individuals over £ 100. Buy here\" Donate to the Fighting Fund You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by donating to the Fighting Fund. The Morning Star is unique, as a lone socialist voice in a sea of corporate media. We offer a platform for those who would otherwise never be listened to, coverage of stories that would otherwise be buried. The rich don't like us, and they don't advertise with us, so we rely on you, our readers and friends. With a regular donation to our monthly Fighting Fund, we can continue to thumb our noses at the fat cats and tell truth to power. Donate today and make a regular contribution. Donate here \""}, {"articleID": "2011120200_00086017_W", "names": {"John Hancock": ["Q1361200", "Q18601624", "Q20684250", "Q51586546"]}, "date": "2011-12-02", "url": "http://bangordailynews.com/2011/12/01/news/nation/rising-cost-of-long-term-care-insurance-angers-seniors/", "content": "rising cost of long-term care insurance angers seniors minneapolis - when dean di tosto bought long-term care insurance in 1998, he believed he was locking in a low rate. now the 83-year-old minnetonka, minn., resident feels duped. his insurance company, <mark>john hancock</mark>, raised the premiums twice in the past three years. the payments could go from $140 to $202 a month, a 44 percent increase. \"i understand the need for these increases,\" he said. \"i'm not a dummy. but it should affect future new policyholders, not those of us who have already put in thousands of dollars. many people can't go out and make more money to make up the difference .\" trapped between fast-rising costs for care and weak returns on their investments, insurers have been raising long-term care premiums by double-digit percentages. in minnesota, for example, <mark>john hancock</mark>, one of many companies to seek increases from the state, secured average rate increases of 13 percent in 2008 and 40 percent in 2010. some worry that higher premiums will make people less likely to get long-term care insurance - a potentially serious problem at a time when aging baby boomers' needs for long-term care are about to explode. ultimately, that could force people to lean on government programs to pay for nursing-home care and other costs. \"we've identified it as a priority for our health reform cabinet,\" said minnesota commerce commissioner mike rothman, whose office regulates the insurance industry. \"we're looking at it, monitoring it, and making sure that when those rate increases come in, that they're not exorbitant .\" long-term care insurance pays a fixed amount of daily benefits for a certain period of time. premiums are based on factors such as age, gender and health. state and federal lawmakers have spent considerable energy trying to encourage the middle class to plan ahead with long-term care insurance, without much luck. the obama administration last month scrapped the class act, a long-term care insurance program and major piece of federal health care reform. even though the medicaid program was designed as a safety net for people in poverty, middle-class seniors routinely deplete their assets and turn to the state. more than 180,000 minnesotans have long-term care insurance policies, designed to help seniors pay living costs later in life without being forced to deplete savings or sell their homes. the average cost of care is about $48,000 a year, but nursing homes can cost $80,000. in minnesota, medicaid pays about 40 percent of long-term elder care. costs could rise fivefold by 2035 to an \"unsustainable burden\" of $5 billion, according to a report last year from the citizens league. minnesota launched a program in 2008 that allows median-income households that buy long-term care policies to shelter some assets if they apply for medicaid. still, only about 11 percent of people in the state have the insurance. minnesota has tightened its long-term care law to add consumer protections and force insurers to build a stronger case to regulators for premium increases. but those rules only affect policies written in 2002 and beyond. long-term care coverage is a relatively new product. though policies have been available since the 1970s, sales didn't start taking off until 1996, when the federal government offered modest income tax advantages. a combination of factors has driven the recent price increases. insurers set their rates on assumptions that some people would let their policies lapse. but people held on to policies longer than expected. and their claims are bigger because they're living longer. low interest rates have had perhaps the biggest impact, because insurers planned to cover claims based on reserves they invested. when those investments fell short of expectations, insurers turned to policyholders to make up the difference. \"it's the perfect storm,\" said amy pahl, who advises insurance companies on long-term financial projections and regulatory matters for the actuarial firm milliman. \"you're looking at collecting premiums and investing them for 30, 40 or 50 years before a payout,\" she said. \"ten or 15 years ago, interest rates appeared to be sustainable at 6 or 7 percent. every american knows that's unachievable now .\" the difficulty of making the risks and financing work over such a long time horizon has led a number of companies to get out of the business, including blue cross and blue shield of minnesota, allianz life and ameriprise, paul said. a decade ago, 130 companies sold long-term care insurance. today there are about 20, she said. deb newman - whose richfield, minn.-based company, newman long term care, is one of the biggest long-term care sellers in the country - has sympathy for policyholders facing increases. she's one of them. a policy she bought 18 years ago went from $725 annual premiums to about $1,100. even so, it's a better deal than waiting, she said. similar coverage would cost someone who bought a policy now about $5,000 annually. \"people are understandably surprised when the insurance companies say,\" oops, we have to go back and increase everyone's premiums by 40 percent,' \"she said .\" but it's still a tremendous value relative to what they could purchase today. \"the squeeze is especially tough for people who bought policies in the 1980s and 1990s. some of those policies didn't cover assisted living or adult day care, because they didn't exist at the time. in an emailed response to questions, a <mark>john hancock</mark> spokeswoman said,\" the company has always tried to provide alternatives to policyholders facing rate increases so they can keep premiums close to their current levels. \"the alternatives include reducing the benefit period, adjusting the benefit amount or allowing policyholders to reduce inflation coverage, the company said. di tosto, a former marketing executive who runs a small business with his son, said he can afford higher premiums for himself and his wife, inga. he remains angry that his choices are to pay up, reduce his benefits, or cancel and lose the $50,000-plus he has paid over the past 13 years. he's made it his mission to push elected officials to do more to protect the state's elderly and infirm. health insurers must post reasons for premium increases under new rules guidelines for posting on bangordailynews.com the bangor daily news encourages comments about stories, but you must follow our terms of service. in brief: keep it civil and stay on topic no vulgarity, racial slurs, name-calling or personal attacks. people who harass others or joke about tragedies will be blocked. the primary rule here is pretty simple: treat others with the same respect you'd want for yourself. here are some guidelines (don't insult one another or the subjects of bdn stories. you may be ticked off at what someone did or said, but you can explain that without resorting to name-calling or obscenity. remember that young people are on this site too. that nasty line that makes your buddies go\" haw, haw \"? you're better than that. comments should be your own work, not copied and pasted from elsewhere, though brief quoted passages to make your point are fine. and please don't use all capital letters. there's no need to shout. stay focused on the issue in the article. off-topic posts will be deleted. this isn't a forum to chat about your personal life. some ideas - the fate of the earth, abortion, gun control, the nature of god - aren't going to be resolved in a reader forum, so no need to get frustrated if others don't see your point of view. state your position once and leave it at that. if you mouse over each comment you will see a\" flag \"button. please use it if you feel comments on the site are out of line. quite often, we won't see a comment until it's reported. questions about why a comment was - or wasn't - deleted? e-mail us at web @ bangordailynews.com and let us know your username and where you posted or saw the comment."}, {"articleID": "2018051515_00132096_W", "names": {"Tom Wolfe": ["Q216195", "Q7818092"], "Michael Phillips": ["Q1928892", "Q1928904", "Q2352024", "Q40912762", "Q4354599", "Q59203552", "Q6833535", "Q6833536", "Q6833537", "Q6833538", "Q6833539"]}, "date": "2018-05-15", "url": "http://www.sun-sentinel.com/news/obituaries/ct-tom-wolfe-dead-20180515-story.html#nt=oft12aH-1li3", "content": "Author <mark>Tom Wolfe</mark>, who chronicled everything from hippies to the space race before turning his sharp eye to fiction, has died. He was 87. <mark>Wolfe</mark>'s agent Lynn Nesbit told The Associated Press that <mark>Wolfe</mark> died in a New York City hospital. Additional details were not immediately available. The \"new journalism\" reporter and novelist insisted that the only way to tell a great story was to go out and report it. His writing style was rife with exclamation points, italics and improbable words. Among his acclaimed books were \"The Right Stuff\" and \"The Bonfire of the Vanities,\" a satire of Manhattan-style power and justice that became one of the best-selling books of the '80s. Check out the latest movie reviews from <mark>Michael Phillips</mark> and the Chicago Tribune."}, {"articleID": "2013040702_00022446_W", "names": {"Kevin Ware": ["Q14475931", "Q6397723"], "Charles Barkley": ["Q192707", "Q5077040"], "Magic Johnson": ["Q134183", "Q7490891"]}, "date": "2013-04-07", "url": "http://sctimes.com/usatoday/article/2059637&usatref=sportsmod", "content": "for most of the morning, everything was fairly routine for 10-year-old anna scherling and her...from the press box last season, it looked like phillip klaphake was a man running for his life. derek schlangen ventured to southwest minnesota state university in marshall over the christmas...dear st. cloud city council members, - 10:27 pm your turn: consider the legal perspective of non-english speakers recent media reports have covered an important issue involving people with limited english skills...halle berry is pregnant. - 5:26 pm this is what passes for a crisis in the lives of tv critics: each year about this time (well,...stepping into the large white farmhouse in rockville is a little like stepping into a time capsule. as the grass begins to show through the mucky grime of winter, it's time to prep that outdoor...six students in a classroom at northwest technical college are learning how to operate a big piece...the city of minneapolis since 2007 has distributed more than $1 million in loans through a program...caterpillar ceo wants more visas for engineers, path to citizenship for foreign workers atlanta - <mark>kevin ware</mark> received constant medical attention following his horrific leg injury suffered in the first half of louisville's midwest regional final win over duke last sunday. his mother said saturday at the final four that the public response to his misfortune could require some dental care. baked goods, homemade brownies and cookies and fruit baskets have arrived en masse, so many that <mark>ware</mark> will need help consuming them. \"while he's resting, he should be gaining a lot of weight,\" said lisa junior, <mark>ware</mark>'s mother. \"not only are we going to have to watch his leg, we're going to have to take him to the dentist .\" junior was sitting in the louisville courtside in the parents section at the georgia dome, the climax of a week that saw nationwide attention and even an international apparel company focused on her son, a cardinals sophomore. many members of the media and fans saw \"ri5e to the occasion\" t-shirts as another example of greed in college sports, where schools and shoe companies make money on the backs of student-athletes. one noteworthy person didn't??? his mother. the shirts used a familiar slogan with <mark>ware</mark>'s number inserted, but it was almost universally derided as exploiting the reserve guard's injury. junior saw it as a rare negative moment in a week of positives. \"i felt that there were so many other things going on at the time, to make it an issue when so much positiveness was coming out of it was meaningless,\" she said at halftime of the cardinals' national semifinal game vs. wichita state. \"it was sad that the media portrayed it as louisville trying to take advantage of the situation .\" <mark>ware</mark> suffered a compound fracture when trying to block a 3-pointer against duke. his lower leg collapsed as he landed, his bone protruding through his skin. yet it was <mark>ware</mark>'s message to his weeping teammates that helped louisville rally to defeat duke. win the game, he told them. get <mark>kevin</mark> home, coach rick pitino instructed his players who would need to win to get <mark>ware</mark> close to his home outside of atlanta. it was a rare injury and moving response played out on live television, making <mark>ware</mark> an overnight celebrity. shortly after, the shirts followed. schools with adidas contracts had worn \"rise to the occasion\" shirts throughout the postseason. with <mark>ware</mark>'s number inserted, the shirts went on sale early this week on louisville's website for $24.99. the school and adidas were criticized for seemingly trying to profit off <mark>ware</mark>'s misfortune while ncaa rules prohibit him from receiving any of that money. some of the cardinals players agreed. louisville announced that it had waived royalties for the shirts before adidas told usa today sports on friday that it had halted sales of the item. junior said the shirts would have been a way for fans to support <mark>ware</mark>, who became the story of the tournament this week. she never doubted the intentions of louisville officials. \"he works for louisville after all,\" she said. junior described this week as \"chaotic,\" a blitz of interviews and television appearances, including reading david letterman's \"top ten,\" after <mark>ware</mark> had surgery on sunday night to repair the leg. <mark>ware</mark> has not been to class as he remained in an indianapolis hospital until tuesday before going to louisville and proceeding on to atlanta. \"we had no idea this was going to blow up the way that it did,\" junior said. phone calls of support came from everywhere. <mark>charles barkley</mark>, <mark>magic johnson</mark> and rev. jesse jackson all called. so did first lady michelle obama, whom junior said was her idol. \"he was sedated, so he didn't remember the phone call,\" she said. once the season ends, junior knows the attention will fade. she said she'll help <mark>ware</mark> get settled back in at louisville and visit as often as she can. he has a long recovery to get back to basketball, but seeing him apply life lessons this week makes her believe he can return. for now, she has enjoyed the outpouring of support. signs throughout the stands at the georgia dome read, \"win for <mark>ware</mark>.\" amar' e stoudemire paid for 1,000 cutouts of <mark>ware</mark>'s head that were scattered in the crowd. 4 months after her husband died, alicia decker shares her story <mark>kevin ware</mark>'s mother explains dilemma from knee injury <mark>kevin ware</mark>'s mother said the shirts would have been a way for fans to support <mark>ware</mark>. 4 months after her husband died, alicia decker shares her story gloria dei day care vows to keep battling for tax-exempt status paid archives for news older than a week. become a subscriber today to enjoy these benefits: ipad-optimized edition mobile site & iphone app are you currently a subscriber? set up your digital access now. you now have full access. thank you for subscribing. access the tablet-optimized site, mobile site and iphone app share your access with any friend or family member subscriber exclusive top 5 daily email newsletter create an account or if you have a digital profile to continue using your current web browser, adobe flash must be installed or upgraded:"}, {"articleID": "2018030223_00154796_W", "names": {"James Davis": ["Q1651845", "Q21034426", "Q21973653", "Q43295578", "Q6132407", "Q6132409", "Q6132421"], "Eric Davis": ["Q12654077", "Q2943174", "Q3026100", "Q5386357"], "Billy Graham": ["Q213550", "Q4912624", "Q863115"]}, "date": "2018-03-02", "url": "http://abc7news.com/news/manhunt-for-student-accused-of-shooting-parents-on-campus/3164568/", "content": "BREAKING NEWS 12-year-old San Jose girl arrested for making threats against her school Full Story Email share share tweet email WEATHER ALERT Winter Storm Warning Full Story WEATHER ALERT Winter Weather Advisory Full Story WEATHER ALERT High Surf Advisory Full Story LIVE VIDEO Track the weather on Live Doppler 7 Watch Now Manhunt for student accused of shooting parents on campus Email share share tweet email ABCNews EMILY SHAPIRO Friday, March 02, 2018 03:33 PM A manhunt is underway for a 19-year-old Central Michigan University student whom officials accused of fatally shooting his mother and father on campus. More than 100 police officers are searching the Mount Pleasant area for <mark>James</mark> <mark>Eric Davis</mark>, whom authorities describe as armed and dangerous, after he allegedly shot his mother and father, an Illinois police officer. Bellwood Police Officer <mark>James Davis</mark> Sr. and his wife, Diva Jennen <mark>Davis</mark>, were the victims, according to the university. No students, faculty or staff were injured in the incident at Campbell Hall, a dorm building, according to the school. University police said the suspect was caught on camera fleeing the area. The Mount Pleasant Police Department is asking for the community's help to find him. A police department had contact with the suspect Thursday night, and at some point in the night, he was taken to a hospital, university police said. Debra Williams, the mother of <mark>James</mark> <mark>Eric Davis</mark>' roommate, told ABC affiliate Toledo, Ohio, station WTVG that she was overcome with panic after her son texted her Friday morning, saying that he thinks his \"roommate just shot his mom .\" The campus was on lockdown this morning and students posted on social media images of their barricaded dorm room doors and video of the school's alert message. All planned campus events have been canceled until further notice, as well as scheduled Saturday classes. Michigan Gov. Rick Snyder said, \"The priority right now is the safety of those still on campus .\" Related Topics: abc news national Email share share tweet email (Copyright © 2018 ABC News Internet Ventures .) Top Stories Officials: Missing snowboarder found dead at Squaw Valley Ski Resort Dangerous driving conditions amid winter storm warning in Lake Tahoe Flu activity decreasing in California, nationwide New sexual battery lawsuit filed in SJ against former Olympics doctor Police investigate officer-involved shooting at Santa Rosa armored car facility Track the rain on Live Doppler 7 Evangelist <mark>Billy Graham</mark> honored with funeral in North Carolina Instant Pot recalls multicooker model due to overheating, melting Show More 2 fatally shot at Central Michigan University, suspect at large SJPD ID 12-year-old as sender of threatening tweet against schools Teen first diagnosed with flu finds out it's cancer Howling winds, saturated soil causes trees to topple in Bay Area Driver released from jail after crash left mom, baby dead More News Photos Meet the stars where you live PHOTOS: Time's Up hops the pond to BAFTAs red carpet PHOTOS: Florida school shooting aftermath Man landed helicopter at SAS to impress woman, Feds say More Photos"}, {"articleID": "2015030601_00038124_W", "names": {"Jorge Soler": ["Q15115212", "Q18128227"], "Matt Cain": ["Q1185532", "Q55108640"]}, "date": "2015-03-06", "url": "http://dailyjournal.net/view/story/9139ea0011964d46a791bfbaeeaaafeb/BBO--Cubs-ss-Giants", "content": "Hunter Pence breaks left forearm in Giants' 8-6 win over Cubs, will miss 6 to 8 weeks Men's sports (2326) Places: SCOTTSDALE, Arizona - Hunter Pence broke his left forearm and will be sidelined six to eight weeks after being hit by a pitch in the sixth inning of the San Francisco Giants' 8-6 win over a Chicago Cubs split-squad on Thursday. One of the clubhouse leaders for the World Series champions, the quirky Pence has played in 383 straight games - the longest active streak in the majors - since the Giants traded for him in July 2012. He hit .277 with 20 homers and 74 RBIs last year. He was hit by a pitch from the Cubs' Corey Black and went to first base before being removed from for a pinch runner. \"It didn't look good,\" Giants manager Bruce Bochy said. \"You hate to see it but these things do happen. Guys work so hard to get ready .\" X-rays showed Pence has a non-displaced fracture in his left forearm. Jeremy Affeldt allowed a run in one inning as the Giants won their first in three exhibition games between the teams. Jacob Turner threw two scoreless innings in his spring debut with the Cubs. He gave up a hit, walked two and struck out a batter. Schwarber, taken fourth overall, connected in his first at-bat against a major league pitcher. He was hitting behind Kris Bryant, drafted in the first round in 2013. Vogelsong pitched two innings. He threw a perfect first, but gave up hits to <mark>Jorge Soler</mark> and Wellington Castro and walked Byrant ahead of Schwarber, who drilled a 1-2 delivery over the right field fence. STARTING TIME Cubs: Turner, who came to the Cubs last August in a trade with the Miami Marlins, is in the mix for a spot in the starting rotation. He made a positive impression with his effort. Giants: Vogelsong, also fighting for a spot in the starting rotation, said he felt good. \"All my pitches are close to being where I want them,\" he said. \"Now I have to work on the mental aspect. I lost my focus a little bit when I got into the stretch and got in a rush. I never slowed myself down .\" <mark>Matt Cain</mark> threw batting practice for the second time and could start an exhibition game in his next scheduled outing. . Tim Hudson threw to hitters for the first time and will do so again before a decision is made on when he will start a spring game. BIRTHDAY BOY On this day last year, Schwarber was leading off for the Indiana Hoosiers. He went 0 for 3 in a 2-1 victory over Xavier. He did a little better this year, on his 22nd birthday. \"I was nervous the whole time out there; I don't know why,\" Schwarber said. \"I guess it's a little different with the bases loaded and it being my first at-bat. I got the silent treatment a little bit but then they all came around for high-fives. It was cool .\" Schwarber throws right-handed but bats left-handed. \"It was something natural to me. Anything involving a swing I do left-handed,\" he said. MINUS ONE UMPIRE Home plate umpire Dale Scott left with a bruised arm after being hit by a pitch. For a time, Jim Joyce called balls and strikes from behind the pitcher's mound and Ron Kulpa was on the bases while Mark Ripperger readied himself to take over behind the plate. \"It was a little screwy,\" Vogelsong said. \"With no umpire it looks different. I don't think that's ever happened with me before. It's definitely a weird look in there .\" Jon Lester, Chicago's big offseason free-agent signing, will make his first exhibition start Friday against the Cincinnati Reds. Yusmeiro Petit starts for the Giants at the Texas Rangers on Friday. All content copyright © 2015 Daily Journal, a division of Home News Enterprises unless otherwise noted."}, {"articleID": "2013072400_00036535_W", "names": {"Nathan Lyon": ["Q6969216", "Q6969217"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}, "date": "2013-07-23", "url": "http://www.indianexpress.com/news/fussfree-frizz/1145604/", "content": "Poor man's spending power of Rs 33.33 makes Centre claim poverty fell to 21.9% Ramnath Goenka Excellence in Journalism Awards: Felicitating the best I'm convinced my hair has a mind of its own. And its mind and mine don't seem to gel very well. I have been trying, ever since I was a young girl, to figure out what my tresses were up to and never succeeded. Sometimes it was poker straight, other times it was full and bouncy and rather often, it seemed to curl into coils of different sizes. The thing is: I have wavy hair. It's neither here, nor there. It's just plain confused. And confusing. Like many women of my vintage, I've barely meddled with my hair. As a preteen I wore it long, and school demanded it always to be braided (black scrunchies only, mind you). My teenage years saw me get a fringe, it masked my adolescent insecurities. And the shoulder-length bob was freedom from hair accessories of all hues. I've coloured it once when a pushy socialite was trying to promote her hair salon. But I stuck to the shade closest to my hair. I've still to start dyeing, my few greys are comfortable being hand-plucked so far. Women in Mumbai, where I live, haven't seen the sun all week. The rains have wreaked havoc on the city's roads, traffic and daily life. Understandably, social soirees beyond a 15-minute drive are abandoned. What took 15 minutes to reach last month, now takes 45. But oh, the blow-dry can't wait that long. It is now dank, clammy and wisps of monkey hair have appeared. Besharam to launch at an orphanage \"alt =\" First trailer of Ranbir Kapoor \\'s Besharam to launch at an orphanage \"src =\" http: //static.indianexpress.com/frontend/iep/highlight/1374574626_ranbir-kapoor-150.jpg \"> Ashes 2013: <mark>Nathan Lyon</mark> should start the next Test, says Glenn McGrath Photos: Rare moments of Amitabh Bachchan, Aishwarya Rai, Sridevi\" alt = \"Photos: Rare moments of Amitabh Bachchan, Aishwarya Rai, Sridevi\" src = \"http: //static.indianexpress.com/frontend/iep/highlight/1374569770_amitabh-150.jpg\" > Most murders by spurned lovers in Andhra and UP, says crime study Photos: It's a boy for Prince William and Kate \"alt =\" Photos: It \\'s a boy for Prince William and Kate \"src =\" http: //static.indianexpress.com/frontend/iep/highlight/1374564910_thumb_150.jpg \"> Photos: It's a boy for Prince William and Kate Photos: When Shah Rukh <mark>Khan</mark> met <mark>Salman Khan</mark>'s father before the\" hug' \"alt =\" Photos: When Shah Rukh <mark>Khan</mark> met <mark>Salman Khan</mark> \\'s father before the \\ \"hug \\'\" src = \"http: //static.indianexpress.com/frontend/iep/highlight/1374558449_thumbnewsrks.jpg\" > MP is No. 1 state, says Chouhan, party ignores Modi at campaign launch Most murders by spurned lovers in Andhra and UP, says crime study"}, {"articleID": "2019011523_00168714_W", "names": {"Rick Gates": ["Q42429771", "Q92901"]}, "date": "2019-01-15", "url": "https://www.washingtontimes.com/news/2019/jan/15/mueller-rick-gates-still-cooperating/?utm_source=RSS_Feed&utm_medium=RSS", "content": "Mueller: <mark>Rick Gates</mark> still cooperating with \"several ongoing investigations' Follow Us Who will win the Super Bowl? Question of the Day Print By Alex Swoyer - The Washington Times - Tuesday, January 15, 2019 Special counsel Robert Mueller asked a federal court Tuesday to delay sentencing for former Trump campaign official <mark>Rick Gates</mark>, saying he's still cooperating in ongoing investigations. Mr. Mueller asked for a 60-day delay, suggesting they come back to the court in mid-March. Gate's attorney also signed on to the filing .\" <mark>Gates</mark> continues to cooperate with respect to several ongoing investigations, and accordingly the parties do not believe it is appropriate to commence the sentencing process at this time, \"Mr. Mueller's one-page filing said. <mark>Gates</mark> pleaded guilty early last year to conspiring against the U.S. as well as lying to federal investigators. He worked with former Trump campaign chairman Paul Manafort, who was convicted of several federal crimes including bank fraud and tax evasion."}, {"articleID": "2019092804_00150292_W", "names": {"James Carter": ["Q23685", "Q27926839", "Q27981527", "Q47115114", "Q51683353", "Q55411966", "Q6131095", "Q6131101", "Q650006", "Q674159", "Q942948"]}, "date": "2019-09-28", "url": "http://www.thehour.com/news/education/article/Education-leaders-say-NC-city-has-shortage-of-14472815.php", "content": "https: //www.thehour.com/news/education/article/Education-leaders-say-NC-city-has-shortage-of-14472815.php Education leaders say NC city has shortage of black teachers Published 12:05 am EDT, Saturday, September 28, 2019 In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) Photo: Brian Gord, AP Photo: Brian Gord, AP Image 1 of / 1 Caption Close Image 1 of 1 In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) Photo: Brian Gord, AP Education leaders say NC city has shortage of black teachers 1 / 1 Back to Gallery ASHEVILLE, N.C. (AP)--Studies show students perform better when they have teachers who look like them. In Buncombe County, where fewer than 2% of public school teachers are black, education leaders acknowledge a shortage of diverse teachers presents a barrier to equitable education. Yet recruiting black teachers in the Asheville area remains a challenge, and some feel the city's culture discourages black candidates from applying. \"A lot of black people, when they leave Asheville for college, they don't come back,\" said <mark>James Carter</mark>, who graduated from Asheville High in 1991 and now serves on Asheville City Schools' Board of Education. \"It is a mountain town, a small town, and when you get to other cities you're seeing a larger black middle class and staying there .\" <mark>Carter</mark>, who is black, said he does not believe teachers' race should dictate their instruction, but he recognizes the impact that a teacher of the same race can have on a student. \"Students of color gravitate more towards teachers of color,\" he said. \"I've heard that from current students as well as from older alumni students .\" Florancie Jacques, who goes by Flo, is one of three students of color out of 40 total students in their final year at UNC Asheville's teacher licensure program. She said Asheville schools will continue to struggle in recruiting teachers of color until the city better accommodates its black population. \"Here, there is a lack of differences in culture,\" said Jacques, who moved to Asheville from Durham and is now in her third year. Asheville feels less welcoming to young black professionals because of a scarcity of black-owned restaurants, festivals and salons that specialize in traditional black hair techniques, she said. \"I am willing to stay somewhere I can be with people like me or where I can interact with people who may not look like me but who also respect and celebrate my culture,\" she said. \"Asheville does not do that .\" After graduating, Jacques plans to return to Durham to teach. WHY RACE MATTERS Last school year, of the nearly 1,600 full-time teachers in Buncombe County Schools, fewer than 100 were non-white and only 12 teachers were black. In Asheville City Schools, 4% of teachers were black, five times lower than the district's overall percentage of black students. And in the area's five public charter schools, which are making efforts to diversify their student enrollments, only two full-time black teachers were on staffs last school year, according to the Public Schools of North Carolina database. The overall percentage of black teachers in North Carolina (15.7 trails the percentage of black students in the state, and the disparity is wider in Buncombe County. School leaders say they believe this contributes to the persistent gaps in student achievement across races in area schools. On recent state performance grades, five elementary schools in Asheville City Schools earned F rankings for their academic performance of their black students, as did both middle schools in the district. A 2017 study from the IZA Institute of Labor Economics found being assigned at least one black teacher between third and fifth grades increased four-year college attendance for economically disadvantaged black students. The same study determined that a black male student having a black teacher in early grades \"significantly reduces the probability that he drops out of high school .\" From fifth grade on, <mark>Carter</mark> estimates he had two or three black male teachers and never felt that their race or gender impacted his learning. Still, he sees value in hiring more black male educators in ACS. \"Changing this could be especially helpful for young men of color within the school system,\" <mark>Carter</mark> said. Teachers being of the same race as their students generally increases cultural synchronization, a term academics use to describe the ability of teachers to relate with students, helping with classroom management and lower discipline rates. \"Our teachers don't know how to handle us,\" said DeAngelo Collins, who is black and graduated from AHS in 2018. \"So they rather just send us out of the classroom .\" To that point, in 2017-18, the short-term suspension rate for black students in ACS was nearly four times higher than the rate for white students despite the district enrolling three times more white students according to data from the NC Department of Public Instruction. \"Some black children can have a deeper understanding with black teachers and form deeper connections,\" said Jacqueswho has written on culture and langue in education. A BETTER REFLECTION Two years ago, UNC Asheville created a recruitment and retention department focused on increasing teacher diversity. Part of the teaching department's efforts include a mentoring program that pairs upperclass candidates of color with younger college students of color. \"Sometimes we can get them into the intro course, but they don't always stay,\" said Nancy Ruppert, Asheville coordinator of 6-12 English/Language Arts Licensure at UNC Asheville. UNC Chapel Hill's School of Education funded a teacher recruitment position two years ago as well, with a similar focus on attracting more diverse candidates to teach around the state. In ACS, <mark>Carter</mark> has had conversations with the human resources department about efforts to target nonwhite teaching candidates. \"That it is something they are very cognizant of,\" he said. \"It is a priority of theirs to try to find more teachers of color .\" Buncombe County Schools belongs to the WNC Diversity Engagement Coalition, with the aim of increasing diversity districtwide. Teacher salary ranges combined with the city's higher cost of living make Asheville one of the most difficult places to live as a teacher in the state. All teacher recruitment efforts must contend with this economic reality. Jacques views teachers as an underutilized resource. \"It's very, very critical for a child to see themselves wherever they are in their world,\" Jacques said. \"And if black students spend their life in school and rarely see themselves in their teachers, they will not be as inspired as they could be .\" ___ Information from: The Asheville Citizen-Times, http: //www.citizen-times.com Most Popular 1 Matt Drudge played a major role in the Clinton impeachment - now he's back for another round 2 Giuliani engaged parade of Ukrainian prosecutors 3 Alleged hospital threats prompt police standoff 4 Multi-talented Latina helps build new car for America, offers inspiration for girls considering STEM careers 5 Warrant: Topless Norwalk woman bares all to complaining family at Westport beach 6 A year after Les Moonves' ouster, CBS seeks a new programming direction 7 Troconis refuses to answer questions in lawsuit deposition View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2012051705_00008835_W", "names": {"Mario Lopez": ["Q1898880", "Q372559", "Q57942357", "Q6007003"], "Michael Hunter": ["Q1370964", "Q18098287", "Q1927929", "Q24493", "Q27306088", "Q56424938", "Q6831292", "Q6831294"], "Ray Allen": ["Q208623", "Q2438891"], "Steve Nash": ["Q16137022", "Q192955", "Q42316961"]}, "date": "2012-05-17", "url": "http://msn.foxsports.com/boxing/story/Floyd-Mayweather-comments-on-Manny-Pacquiao-051612", "content": "us boxer floyd mayweather waded into the controversy surrounding manny pacquiao's vocal opposition to same-sex marriage wednesday, as the filipino superstar tried to quiet the storm. more coverage for more boxing news and analysis, check out the boxing tribune. pacquiao sparked a flurry of headlines in an interview earlier this week by disagreeing with president barack obama's view that gay couples should be allowed to marry--calling it a direct attack on the morals of society and the will of god. the devout christian said wednesday he is not against homosexuality, just same-sex marriage. \"i'm not against gay people,\" pacquiao said in a statement. \"i have a relative who is also gay. we can't help it if they were born that way. what i'm critical of are actions that violate the word of god. i only gave out my opinion that same-sex marriage is against the law of god .\" however his clarification was not enough to stop to another online confrontation with mayweather. fans of the sport have long called for the pair to match up against each other in the ring--but neither camp has agreed to the other's demands thus far, and the pair do most of their fighting through the media. mayweather tweeted wednesday evening, \"i stand behind president obama & support gay marriage. i'm an american citizen & i believe people should live their life the way they want .\" in his statement earlier in the day, pacquiao, who is training for a june 9 fight against undefeated american timothy bradley, also maintained he never made a reference to the bible's book of leviticus when interviewed. the writer who conducted the interview for examiner.com included the passage from leviticus stating, \"if a man lies with a man as one lies with a woman, both of them have done what is detestable. they must be put to death; their blood will be on their own heads .\" pacquiao, who is a lawmaker in his native philippines, said, \"i didn't say that, that's a lie...i didn't know that quote from leviticus because i haven't read the book of leviticus yet .\" the writer, granville ampong, has since said pacquiao never referenced the passage, although his article suggested the boxer had agreed with it. amidst the fallout from the interview, a popular los angeles entertainment complex nixed an interview between the boxer and <mark>mario lopez</mark> of \"extra,\" according to kcbs-tv. boxing's first-ever eight-division champion was slated to appear at the grove wednesday afternoon, and both men had tweeted invitations for fans to watch the filming. the grove, which is owned by prominent los angeles developer rick caruso, cited the 33-year-old boxer's \"intolerance\" in its decision to cancel the taping. \"based on news reports of statements made by mr. pacquiao we have made it be known that he is not welcome at the grove and will not be interviewed here now or in the future,\" read a statement from grove vice president of corporate affairs bill reich. posted: may 13, 2012 american <mark>michael hunter</mark> wins gold in an olympic qualifier over argentina's yami...london 2012: boxing posted: may 02, 2012 adidas detroit pistons royal blue primary logo t-shirt 17.95 adidas detroit pistons royal blue primary logo t-shirt adidas miami heat black primary logo t-shirt 17.95 adidas miami heat black primary logo t-shirt adidas boston celtics #20 <mark>ray allen</mark> green player t-shirt 24.95 adidas boston celtics #20 <mark>ray allen</mark> green player t-shirt adidas new orleans hornets teal basic logo slouch adjustable hat 17.95 adidas new orleans hornets teal basic logo slouch adjustable hat adidas denver nuggets light blue primary logo t-shirt 17.95 adidas denver nuggets light blue primary logo t-shirt adidas houston rockets red prime logo t-shirt 17.95 adidas houston rockets red prime logo t-shirt adidas phoenix suns #13 <mark>steve nash</mark> orange net player t-shirt 24.95 adidas phoenix suns #13 <mark>steve nash</mark> orange net player t-shirt adidas los angeles lakers #24 kobe bryant purple net player t-shirt 24.95 adidas los angeles lakers #24 kobe bryant purple net player t-shirt adidas chicago bulls #1 derrick rose red net player t-shirt 24.95 adidas chicago bulls #1 derrick rose red net player t-shirt adidas orlando magic #12 dwight howard black net player t-shirt statistical information provided by: stats llc"}]