[{"articleID": "2009022508_00040641_W", "names": {"Eric Holder": ["Q312644", "Q3591180"], "Roberto Garcia": ["Q1417969", "Q2275115", "Q3436901", "Q3938839"], "David Orr": ["Q25808079", "Q29006159", "Q492222", "Q5238251", "Q5238252"]}, "date": "2009-02-25", "url": "http://suntimes.com/news/politics/1448000,dominick-reelected-cicer-town-president-022409.article", "content": "the supremes speak on daley administration corruption i know i'm dying, children, but i ain't dead yet.... obama's speech before joint session of congress. feb. 24, 2009. text as delivered. massive federal probe at o'hare (2/23/2009 06:38:28 am) attorney general <mark>eric holder</mark>'s race speech stirs debate swallow cliff sledding is back! (12/23/2008 17:04:33 pm) kelly superfans attended every day of trial (6/20/2008 10:01:32 am) dr. pat has his say (2/05/2009 19:25:39 pm) \"proud day' | foe hits tactics - berwyn mayor also re-elected larry dominick decisively won re-election as cicero's town president by a 2-1 margin tuesday, with all 10,260 votes counted, according to unofficial results.\" it's a proud day for cicero, \"dominick told a crowd of supporters at al's restaurant.\" i'm proud of everybody who works for the town of cicero - 85 percent of them. \"\"it's a proud day for cicero,\" larry dominick said after his big win tuesday. even in a town that is majority hispanic, dominick beat back a challenge from cicero police officer <mark>roberto garcia</mark>, who said dominick had become the same kind of iron-fisted leader as former town president betty loren-maltese. it was her style that dominick took office four years ago pledging to erase. <mark>garcia</mark> said dominick won tuesday using the same kinds of tactics cicero leaders have used going back to the days of al capone. cook county clerk <mark>david orr</mark> had to call in sheriff's police tuesday to evict armed guards brought into polling places by dominick, according to <mark>orr</mark> spokeswoman courtney greve. \"it's voter intimidation when off-duty armed police officers show up in polling places,\" greve said. \"they had no authorization to be in the polling places. we have a crew of sheriff's officers on call. they had to come to remove the off-duty officers hired by dominick's campaign.\" <mark>garcia</mark> complained dominick paid high school kids $50 to hand out his flyers at polling places. a dominick spokesman says that's the rate he pays all volunteers. asked how he lost so convincingly to dominick, <mark>garcia</mark> said \"i think it's just the intimidation factor. people believe that someone knows how they vote. they fear the inspectors will come to their house the next day.\" but dominick said it was a gang member supporting <mark>garcia</mark> who twice punched a police officer while handing out <mark>garcia</mark> pamphlets at a polling place. the officer arrested the man. dominick's slate beat <mark>garcia</mark>'s for all town offices. dominick told his fans they had plenty of work to do, including finishing work on an olympic-sized swimming pool."}, {"articleID": "2018011619_00309261_W", "names": {"Mike Ashley": ["Q15454805", "Q554077"]}, "date": "2018-01-16", "url": "http://www1.skysports.com/football/news/11678/11210462/newcastle-takeover-talks-with-amanda-staveley-and-pcp-partners-have-ended", "content": "Newcastle takeover talks with Amanda Staveley and PCP Partners have ended By Sky Sports News Last Updated: 16/01/18 7:12 pm Newcastle owner <mark>Mike Ashley</mark> Talks between <mark>Mike Ashley</mark> and Amanda Staveley's PCP Partners over a potential takeover of Newcastle United have ended for now, Sky Sports News understands. And, as it stands, there is no deal is in place between the two parties for a sale of the Premier League club, nor is one under discussion. A source close to <mark>Ashley</mark> told Sky Sports News: \"It is only right to let the fans know that there is no deal on the table or even under discussion with Amanda Staveley and PCP.\" The source added that attempts to reach a deal had proved to be \"exhaustive, frustrating and a complete waste of time\" . Sky Sports News have contacted PCP and are awaiting comment. More to follow."}, {"articleID": "2012071413_00053450_W", "names": {"Rob Davies": ["Q1450938", "Q16206142", "Q28939871", "Q7340065"]}, "date": "2012-07-14", "url": "http://iol.co.za/news/south-africa/zuma-arrives-for-au-summit-1.1341294", "content": "president jacob zuma arrived in addis ababa, ethiopia on saturday for the 19th session of the african union (au) assembly, the department of international relations said. zuma was leading a delegation to the summit, where the election of a new chair is on the agenda. the delegation included international relations minister maite nkoana-mashabane, defence minister nosiviwe mapisa-ngqakula, trade and industry minister <mark>rob davies</mark> and public service and administration deputy minister ayanda dlodlo. the southern african development community (sadc) has nominated home affairs minister nkosazana dlamini-zuma for the position. he said southern african countries never had the opportunity to serve as chair of the au \"it is in the best interests of the african people in general and the au in particular that the matter be finalised at this summit,\" said zuma. \"we trust that the continent will rally behind the southern africa candidate 1/8dlamini-zuma 3/8.\" the presidency said on friday that the au had adopted a policy on gender parity in its commission, and said the post had never been occupied by a woman. there has been much controversy around the elections. the french news agency agence france presse (afp) reported on friday that sadc had accused sitting au chief jean ping, who is gabon's foreign minister, of abusing au resources in his election race. neither ping nor dlamini-zuma won the two-thirds majority needed at the previous summit, despite several rounds of voting, leaving ping in the post until a new election could be held. ping denied as \"outright fallacy and fabrication\" a report by the sunday times newspaper that he was pulling out of the race to allow dlamini-zuma to stand unopposed. the assembly of the union sits on sunday and monday. it was not immediately clear when the chair would be elected. comment guidelines. login and register, if you haven' t already .? copyright 1999 - 2011 independent online, a division of independent newspapers (pty) limited. the copyright in the literary and artistic works contained in this online news publication and its other related and connected websites, as well as in the published editions of group newspapers, their supplements and any other content or material, belongs exclusively to independent newspapers (pty) limited unless otherwise stated."}, {"articleID": "2016083017_00934540_W", "names": {"David Marshall": ["Q19663750", "Q21467267", "Q5237157", "Q5237158", "Q5237160", "Q5237162", "Q57420834", "Q947204"], "Michael Dawson": ["Q15835011", "Q43153045", "Q47091636", "Q59192", "Q6829755", "Q6829756"], "Abel Hernandez": ["Q318456", "Q5654899"]}, "date": "2016-08-30", "url": "http://www.yorkshirepost.co.uk/sport/football/hull-city/hull-city-s-triple-raid-to-land-david-marshall-ryan-mason-and-will-keane-1-8096118", "content": "Hull City's triple raid to land <mark>David Marshall</mark>, Ryan Mason and Will Keane Cardiff City's goalkeeper <mark>David Marshall</mark> is set to join Hull City Richard Sutcliffe 15:03 18:51 Tuesday 30 August 2016 1 Have your say HULL CITY'S protracted summer recruitment search has finally paid dividends with the capture of Cardiff City goalkeeper <mark>David Marshall</mark> and Tottenham midfielder Ryan Mason for a record fee, The sum they will pay Tottenham for the 25-year-old midfielder remains undisclosed, but is believed to be & pound; 10m and it is a new record. Mason will further strengthen their squad following the earlier signing of goalkeeper <mark>David Marshall</mark> from Cardiff, and becomes the latest to leave White Hart Lane for East Yorkshire, following Tom Huddlestone, Jake Livermore and <mark>Michael Dawson</mark>. For City, <mark>Marshall</mark>'s arrival brings to an end a seven-month wait to make a signing - comfortably the longest in the country. A Scotland international, the 31-year-old has signed a three-year deal at the KCOM Stadium after joining in a & pound; 5m transfer. \"Having spoken to the people up here, I didn't need any convincing,\" said <mark>Marshall</mark>. \"It's all about having that new, fresh challenge to look forward to.\" I feel that this is a club that is going places, especially when you look at the start they have made to the Premier League season. \"There are only four or five goalkeepers in this division who can categorically say that they are their club's number one (goalkeeper).\" Of course I anticipate a battle for the jersey. You can't take anything for granted and I'm here to fight for a place. \"First choice goalkeeper Allan McGregor is on the long-term injury list so <mark>Marshall</mark> will battle it out with Eldin Jakupovic to face Burnley when the Premier League resumes on September 10. Mason's arrival for a medical follows Sunderland's late attempt to hijack the deal, The 24 year-old, capped by England as recently as 18 months ago, has been on City's radar for some time with former manager Steve Bruce revealing the club's interest back in early July. He has signed a three-year contract after costing the club in excess of the & pound; 10million paid to recruit <mark>Abel Hernandez</mark> in 2014, and told their official website of his arrival:\" I can't wait to get started and I see this as a massive opportunity for me. \"I'm delighted and excited to be here.\" Hull later confirmed their third arrival of the day - striker Will Keane from Manchester United. The 23-year-old, who worked with Phelan during the latter's time as assistant manager, has signed a three-year contract having also arrived for an undisclosed fee. \"I'm delighted to move here,\" he told Hull's official website. \"It's a fresh start and a new challenge for me, so I'm really looking forward to getting things underway.\" "}, {"articleID": "2015071905_00050452_W", "names": {"James Allen": ["Q20028160", "Q20751577", "Q21456402", "Q3999811", "Q55945597", "Q56284437", "Q56284515", "Q56373202", "Q58314853", "Q59159556", "Q6128637", "Q6128640", "Q6133578"]}, "date": "2015-07-19", "url": "http://www.witf.org/news/2015/07/at-least-11-million-pennsylvania-homes-lack-internet-access.php", "content": "At least 1.1 million Pennsylvania homes lack Internet access News At least 1.1 million Pennsylvania homes lack Internet access Written by Elizabeth Daley | PublicSource | July 19, 2015 | Jul 19, 2015 1:01 AM Comments: 0 Photo by Molly Duerig | PublicSource <mark>James Allen</mark>, 57, uses the computers at the East Liberty branch of the Carnegie Library of Pittsburgh to search for jobs because he doesn't have Internet at home. Here, on June 22, <mark>Allen</mark> was scouring Craigslist for jobs as a delivery truck driver. President Barack Obama called the Internet \"one of the most significant democratizing influences the world has ever known.\" However, for many Americans, like Tracy Emerson of West Philadelphia, full connectivity remains out of reach. Emerson is a 47-year-old single mother of two who canceled her home Internet service when she lost her job at a daycare center. \"I couldn't afford it. They are always changing their packages,\" said Emerson who had a bundle, \"and it's never less; it's always more.\" "}, {"articleID": "2016090323_00238475_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "Alex Neil": ["Q1515752", "Q1828808"]}, "date": "2016-09-03", "url": "http://heraldscotland.com/opinion/14721998.Iain_Macwhirter__The_timing_of_the_referendum_is_the_biggest_decision_Nicola_Sturgeon_will_ever_make/", "content": "Iain Macwhirter: The timing of the referendum is the biggest decision Nicola Sturgeon will ever make STIRLING, SCOTLAND - SEPTEMBER 02: SNP leader and First Minister of Scotland, Nicola Sturgeon, delivers a speech to party members at the launch of a listening exercise to gauge support for a second referendum on September 2, 2016 in Stirling, Scotland. I / Iain Macwhirter, Political Editor 0 comments IT could be the best of times, or it could be the worst of times. In the next few months, Nicola Sturgeon must make the most difficult decision she will probably ever face in her political career: deciding when to hold the next independence referendum. If she gets it wrong, the cause could be set back a generation or two. It makes the decision over Article 50 look a doddle. If she goes too early, and there's another No, then the referendum route to independence may itself be finished. If she delays too long, and loses office, then the party may never again enjoy the kind of political authority it needs to force a referendum on a reluctant Westminster. It's either a chance that won't come again, or a referendum too far Few doubt that there will be another independence referendum at some stage. The material circumstances have clearly changed since 2014, following Brexit, and Scotland and England are moving further and further apart politically--not least because of Labour's civil war which could leave the Tories dominating Westminster for the next decade. Some, like Alex Salmond's former chief of staff, Geoff Aberdein, are confidently predicting that there must and will be an independence referendum \"within the year\" . Others, some of them very close to the First Minister, are predicting precisely the reverse--that she has no thoughts of going for broke until the Brexit fog clears. Loading article content The pro-independence camp, which includes prominent Yessers like the writer/musician Pat Kane and 10s of thousands of activists, believe there will never be a better moment than right now. Brexit has shredded the unionist argument that a vote for independence is a vote for isolation--from Europe and the UK. Scotland is being dragged unwillingly out of the EU with untold economic consequences. There is no \"caring, sharing\" unionist status quo any longer. <mark>Gordon Brown</mark>, who was back last week proposing another round of devolution, seems like a figure from history. Support for the SNP is at historic levels--the latest YouGov poll on Friday had the SNP back up to 52 per cent on the constituency vote. But many activists fear that it can only fall in future through the laws of political gravity, the longer the party is in office. Support for independence is up also on 2014, marginally, at around 47 per cent Yes, to 53 per cent No, according to Professor John Curtice. And while this may not be \"clear and sustained evidence that independence has become the preferred option of most Scots\" --as Sturgeon put it in May--it is headed in the right direction. Look how much support for independence increased during the last independence referendum campaign, say the go-for-it tendency. The iron is still hot: strike it. Others, like the former SNP cabinet minister, <mark>Alex Neil</mark>, want them to cool off. Staging a referendum while the nation is still confused and perplexed by Brexit is foolhardy. Asking people to cut off from the UK, when they have yet to learn what breaking from the EU means, is to invite a negative response from scunnered voters. People are fed up with referendums--two in two years--and need a moment to reflect on where they are--and where the hard borders will be. Once it sinks in that Brexit really does mean that Britain is leaving the EU, voters may be much more receptive to the argument that independence is the only way back into Europe. Moreover, you don't have to accept the GERS methodology to realise that the Scottish economy currently is in a bad way because of the collapse of the oil industry. It's not the end of the world, and many small countries do extremely well without any oil at all--and cope with large deficits. But there is a profound structural change taking place in the Scottish economy right now which makes it very difficult to frame a convincing economic case for independence. Nor is this uncertainty helped by the fact that the Scottish National Party is undergoing a review of its policy on the currency of an independent Scotland--the key issue on which the 2014 referendum turned. History is going the SNP's way, say the ca' canny tendency: don't blow it. Those counselling caution seem to be winning the First Minister's ear right at the moment. But the Scottish National Party is not one that thrives on caution and baby steps. It is a movement that wants to change history, and thrives on bold initiatives that get the blood going. The independence referendum campaign was, for many thousands of people in the Yes campaign, a transformative experience--politically and psychologically. It was an almost revolutionary moment that ignited the fire of political imagination and after which anything seemed possible. Voter registration at 97 per cent: the highest turnout in electoral history. Who wouldn't want to relive that experience? Never before in Scottish history has there been an independence movement like it. Almost overnight, 1.6 million people in Scotland decided that they weren't going to listen to Project Fear. Scotland surprised itself in 2014. It realised that it wasn't just a region of a declining post-imperial power, but a nation in its own right with new possibilities. The centre of gravity of Scottish politics shifted from a default if reluctant unionism, to an assertive, if strictly civic, nationalism. The aftershock was the Tsunami general election of 2015, when the unionist parties were obliterated. Scots already are, to use the cliché, \"independent in the mind\" . But it is quite possible to be confident about Scotland's future independence and still be highly cautious about the process of becoming independent. Scotland is a nation with a very long and turbulent history and Scots know from bitter experience that when they indulge in confrontation with their more powerful neighbour they are inclined to come off worst. This has not been an issue for most of the last 300 years because he Union--whatever people think of it now--was in its time an achievement of Enlightenment statesmanship. The Union ended 400 years of almost constant warfare by giving Scotland--or at any rate the Scottish elite--a stake in the emerging British Empire. That's history now. The alliance of convenience between Scotland and England in the Union no longer accords with either nation's interests. Yet Scotland finds itself left umbilically linked to a post-imperial and increasingly isolationist UK defined by financial interests in the City of London and by a Conservative-dominated Westminster. The process of disengagement from the UK is already advanced. The policy of incremental independence begun by Alex Salmond in the 1990s has been extremely successful. Scotland has already gone most of the way to independence without a hint of violence or civil unrest. A major step was the formation of the Scottish Parliament in 1999, which largely restored political autonomy, at least in terms of domestic legislation. Since then, Holyrood has acquired a range of economic powers which fall far short of economic autonomy, but could have provided the basis for a functionally independent Scotland located within the UK. But Brexit threw a spanner in the works. The SNP's over-arching policy of independence in Europe presupposed that the UK would remain in the European Union. Within that context, Scotland could have attained a form of independence through evolution, which would have allowed it to remain both part of the UK and part of Europe. That project, outlined in the 2013 White Paper On Independence, may no longer be viable. Indeed, incrementalism--independence by stealth--may have reached its limits. Of course, this doesn't mean a full-frontal assault is the only way. What may be needed is a re-engineering of the independence project. In addition to the bedrock economic argument, the SNP needs to work through its attitude to globalisation to redefine independence. The extraordinary events in Ireland, where the government has had to appeal against receiving & pound; 11bn in back taxes from Apple, shows the problems faced by small countries dancing with big business. Should Scotland emulate Ireland as some neo-liberals propose, and become a kind of Caledonian tax haven? Or should it continue to emulate the social democratic Scandinavian model, complete with high personal taxation and a big state? Should Scotland automatically seek to return to the European Union, which doesn't appear to be very interested in the welfare of small countries, like Greece, with large deficits? A broader question which the SNP listening cadre will hear asked on the doorstep is whether independence should take precedence over addressing Scotland's lingering social ills, revealed so starkly last week by the Scottish Index of Multiple Deprivation. Last year saw the biggest annual increase in mortality figures in Scotland since the Second World War: 8.5 per cent. Is the NHS sound enough to cope with the shock of independence? With all these questions swirling around, Nicola Sturgeon could be forgiven for having sleepless nights. Fortunately, she isn't. The one thing we know about the First Minister is that she has an astonishing capacity to sustain pressure, as we saw during the independence referendum and the UK general election when she was subject not only to abuse on social media but sustained attack from the combined forces of the UK media and political parties. One thing she isn't going to do is be bulldozed by over-zealous party activists into making a futile if glorious bid for national freedom. She is a utilitarian nationalist, and doesn't go in for romantic consolations of heroic defeat. Nicola Sturgeon's listening exercise--the biggest consultation in the party's history--is of course a delaying tactic: something to keep the activists engaged without actually committing them to a full-scale campaign. The consultation, announced last week, will expose the more gung-ho nationalists, who largely exist in a social media echo chamber, to the large number of Scots who don't want independence, at least not yet. But the new national conversation isn't an exercise in time-wasting. The SNP is very good on the doorsteps, as anyone who has followed them canvassing can confirm. They have a legion of 120,000 motivated and highly persuasive members who will be putting the case for self-government directly to the people who are most in need of persuasion: the older and more middle-class Scottish voters who avoid social media, think JK Rowling is a national treasure and believe the SNP are a bunch of mad cybernats. They will be doing so against the background of Britain's chaotic disengagement from the European Union led by mad Brexiteers. My own view is that the opinion polls underestimate the extent to which Scots of all classes have begun to take independence seriously as a practical project. The euthanasia of the status quo has changed the game. Brexit has all the makings of an historical watershed. A UK dominated by rightwing anti-Europeans, obsessed with immigration and deluded by echoes of empire, has undermined lingering moral attachments to the Union. The process of disengagement from Europe will be a long and trying one in which Scotland's interests will be repeatedly set aside. There is no downside here for the independence movement and no conceivable political threat from Labour or the Tories. So this is probably not be the time for an early referendum. Then again, it very well could be. 0 comments"}, {"articleID": "2017052500_00168633_W", "names": {"Jim Anderson": ["Q16091384", "Q20668766", "Q27887229", "Q3178726", "Q35814840", "Q6193381", "Q6193384", "Q6193386", "Q6193388", "Q6193392"]}, "date": "2017-05-25", "url": "http://www.pressreleaserocket.net/terma-software-sees-over-100-growth-in-services-for-workload-optimization/555356/", "content": "Home / Press Releases / Terma Software Sees Over 100% Growth in Services for Workload Optimization Terma Software Sees Over 100% Growth in Services for Workload Optimization By PR Rocket on May 25, 2017 Pin It Terma Software's introduction of an analytics based service offering to help companies optimize automation environments has helped the company experience significant growth. The service based offering combines the strength of its analytics based product for workload service management, deep knowledge of enterprise job schedulers, and industry best practices to help optimize workload processes. Boulder, CO (PRWEB) May 24, 2017 Terma Software introduced its Workload Service Model for optimization of Workload Automation environments over a year ago, in order to address the growing challenges organizations are facing with their workload solutions as complexity continues to grow. Since the introduction of this service offering, Terma has experienced significant growth and interest in the services that help to optimize batch workload environments as well as manage their inherent complexity. These services take a process based approach and employ both operational and statistical analyses to address inefficiencies and lack of insight into the management of the highly complex interdependent processes used to support critical business activities. Shane Hade, CEO of Terma comments, \"Many of our customers and prospects are challenged by not only time constraints, but also the lack of resources needed to analyze and develop service models for workload automation. Our service models help identify inefficient practices used within workload scheduling solutions such as AutoSys, CA 7, and Tidal. Once these models are applied and aligned with redesigned operational practices, a more reliable and efficient service can leveraged.\" <mark>Jim Anderson</mark>, VP, Product Strategy, Sales & Marketing says, \"Our professional service business has grown significantly due to a need in the workload automation customer base to drive more efficiency within IT operations. The capabilities inherent in our analytics solution, combined with the knowledge and experience of our consultants, helps customers develop a more efficient and reliable approach, insuring that the implemented processes meet their desired expectations. The Terma Workload Service Model is what drives this.\" About TERMA SOFTWARE Over the past decade Terma has developed the industry's most comprehensive knowledge of workload data and the ability to leverage that understanding to provide measurable business analytics. Terma's products, TermaUNIFY (formerly JAWS), TermaINSIGHT, and TermaVISION enable companies to optimize their workload processing and realize more value from their automation tools by providing SLA management, forecasting, prediction, business intelligence, reporting, simulation, and modeling for CA Technologies' CA 7 and AutoSys, and Cisco's Tidal Workload Automation. Availability for both IBM IWS and BMC ControlM are coming soon. The products are available as SaaS and on premise solutions. The solution ensures that companies can lower their costs and improve the reliability and performance of their mission critical workloads. For more information, please contact <mark>Jim Anderson</mark> at 303.396.0454 or email <mark>Jim</mark> (at) TermaLabs.com. For the original version on PRWeb visit: http: //www.prweb.com/releases/2017/05/prweb14368632.htm Related Items"}, {"articleID": "2009072016_00014434_W", "names": {"Ben Bradshaw": ["Q17385634", "Q264618"]}, "date": "2009-07-20", "url": "http://blogs.news.sky.com/boultonandco/Post:26410397-7afd-4c44-9089-995822169ad2", "content": "\"the prime minister,\" we are told by his official spokesman, \"has been following the cricket.\" really? and strauss's brave lads still won! \"this was clearly a good win for england,\" the pm's spokesman added. good? it was brilliant! it was england's first win over the aussies in a test match at lord's since 1934! good? the spokesman added: \"he looks forward to the rest of the series.\" really? following the cricket? \"he has been asking for updates today on what has been happening, when he was on his trip to the north east,\" the spokesman told political journalists. but i have worrying news for the pm. after the new culture, media and sport secretary <mark>ben bradshaw</mark> had described the win as a \"superb result\" (that's a bit more like it) a tory mp, the sven goran eriksson lookalike peter bone, said it was \"great news that history repeats itself\" . he told mps: \"in 1934 there was a labour government in deep trouble in the midst of an economic recession. the only bright spot that year was the england cricket team beating the australians at lord's.\" the following year labour was turfed out and a conservative government elected, leading the country out of recession. \"get the latest political gossip from sky's westminster team on the boulton & co. blog."}, {"articleID": "2017110207_00211351_W", "names": {"Brian Kelly": ["Q16186315", "Q16730700", "Q18098352", "Q194016", "Q21259238", "Q22920229", "Q28873135", "Q48773396", "Q4964312", "Q4964313", "Q4964314", "Q4964315", "Q4964316", "Q4964318", "Q4964319", "Q4964321", "Q4964322", "Q57431309", "Q58039928"]}, "date": "2017-11-02", "url": "http://wbtw.com/ap/notre-dames-mike-elko-faces-bittersweet-reunion-with-deacs/", "content": "Notre Dame's Mike Elko faces bittersweet reunion with Deacs 6 mins ago SOUTH BEND, Ind. (AP)--Through enticement, advancement and the turbulence of coaching college football, Notre Dame first-year defensive coo...25 mins ago LOS ANGELES (AP)--Who's next? The Houston Astros won their first World Series crown in their 56th season since starting play as the Colt .4...36th Annual American Heart Association Beach Ride set for this weekend in Myrtle Beach November 1, 2017 The 36th annual American Heart Association Beach Ride is set to take place Wednesday, November 1st to Sunday, November 5th, 2017 at Lakewood...Breast cancer myths debunked by oncologist October 30, 2017 Breast cancer is the most common cancer in American women and the second leading cause of cancer deaths in women, according to the American...Ideas for using your outdoor space as weather turns cooler November 1, 2017 MYRTLE BEACH, SC (WBTW)--Randy Hann from Contract Exteriors joined News13 NOW at 9 a.m. to talk about ideas to make outdoor living space in...36th Annual American Heart Association Beach Ride set for this weekend in Myrtle Beach November 1, 2017 The 36th annual American Heart Association Beach Ride is set to take place Wednesday, November 1st to Sunday, November 5th, 2017 at Lakewood...Notre Dame's Mike Elko faces bittersweet reunion with Deacs TODD BURLAGE, The Associated Press Published: November 2, 2017, 3:16 am Click to share on Pinterest (Opens in new window) SOUTH BEND, Ind. (AP)--Through enticement, advancement and the turbulence of coaching college football, Notre Dame first-year defensive coordinator Mike Elko will find himself this weekend across the field facing a group of players he once recruited to a program he helped build. Elko spent the last three seasons as the defensive coordinator at Wake Forest, which visits the fifth-ranked Fighting Irish (No. 3 CFP) on Saturday. It's a game Elko likely wishes had never been scheduled given the circumstances. \"I'm sure he would like to get through this (week) quickly,\" Notre Dame coach <mark>Brian Kelly</mark> said when asked about Elko's bittersweet reunion with his former players. \"It's never easy.\" Having a coach with first-hand knowledge of his former team might seem like an advantage for Notre Dame (7-1). But <mark>Kelly</mark> warned not to read too much into any benefits of inside info. After all, the Demon Deacons (5-3) can counter with a working knowledge of how Elko likes to attack an offensive opponent. Wake Forest averages 31.6 points per game, too. The success each program has enjoyed under Elko mirror each other. Elko came to Notre Dame as one of only two FBS coordinators with top-40 defenses in each of the past five years--three at Wake Forest and two at Bowling Green. Neither team is a perennial football power. \"We had lower-recruited players, but we had good players,\" Elko said upon his arrival at Notre Dame. \"We taught a defense that they understood, and we weren't asking kids to just make plays and do things that they weren't capable of doing.\" Wake Forest coach Dave Clawson knows what his team will be up against because it's what the Demon Deacons have been doing for some time now. \"They're one of the top teams in the country in limiting the run, creating turnovers,\" he said. \"Does that sound familiar? That's been Mike's M.O., try to make teams one-dimensional, and he's doing it.\" Clawson hired Elko as an assistant in 2009 when Clawson was the head coach at Bowling Green. The two coached and moved up together over the next eight years until Elko left Clawson for Notre Dame. The two also worked together at Fordham and Richmond from 2002 to 2005. Clawson expressed gratitude for Elko's service and wished him nothing but success--after this weekend. \"We know they're going to be well-coached, and Mike has made a big impact there already,\" Clawson said. \"He's a great coach. He's doing a great job (at Notre Dame) and I'm proud of him. But on Saturday, we want to beat him and he wants to beat us.\" With a defensive roster at Notre Dame filled with NFL prospects, leaving Wake Forest for a more prominent program seemed like an easy choice after last season. But Elko said his decision took great care and consideration, and the improvement followed. After finishing last season No. 104 in takeaways with only 14, Elko's Irish rank No. 11 in the country this season with 18 turnovers gained. Notre Dame allows only 16.1 points a game, the 10th best mark in the country. It has also given up only one rushing touchdown this season, the fewest in the FBS, and opponents have scored just 10 red zone touchdowns in 25 trips. Irish senior captain Drue Tranquill said there is no single reason for the success and turnaround from last season. He calls it a collection of shifts and changes that all correlate to Elko's arrival. Elko moved Tranquill from a strong safety last year to a rover (a safety/linebacker hybrid) this season and the production has followed. \"I don't know that you can point the finger at any one thing that has led to the change,\" said Tranquill, who leads the Irish with 6.5 tackles for loss and also has 1.5 sacks, three fumble recoveries, one forced fumble and an interception. \"It's just the all-around mental preparation of our team has been much better. I never walk into a game feeling inferior in terms of my mental preparation with our new coaching staff.\" Elko isn't the only former Wake Forest coach on <mark>Kelly</mark>'s staff, either. Chuck Lea, who coached linebackers at Wake Forest last season under Elko, is now doing the same job at Notre Dame. Clawson was asked about Notre Dame's improved defense this season. \"Well, they hired two guys from Wake Forest,\" he said. \"So I think that's what happened.\" ___ AP Sports Writer Joedy McCreary contributed. ___ More AP college football: http: //www.collegefootball.ap.org and https: //twitter.com/AP_Top25 Share this:"}, {"articleID": "2017050919_00748599_W", "names": {"Paul Griffiths": ["Q16215288", "Q28111204", "Q5162251", "Q58167926", "Q7151015", "Q7151017", "Q7151019"], "Ian Miles": ["Q20640922", "Q58231747"]}, "date": "2017-05-09", "url": "https://heatst.com/culture-wars/duke-university-professor-resigns-after-criticizing-intellectually-flaccid-diversity-training/", "content": "A Duke University theology professor resigned this week following disciplinary action taken against him by the school. This, after the professor had excoriated diversity training sessions suggested by the university as \"intellectually flaccid.\" Professor <mark>Paul Griffiths</mark>, Duke Divinity School A series of emails published by The American Conservative reveals that 61-year-old professor <mark>Paul Griffiths</mark>, who teaches Catholic theology at Duke, took umbrage by an invitation urging all divinity school faculty to partake in two full days of \"racial equity\" training this past March. \"Those who have participated in the training have described it as transformative, powerful, and life-changing,\" wrote Anathea Portier-Young, the associate professor who sent the invitation. \"We recognize that it is a significant commitment of time; we also believe it will have great dividends for our community.\" <mark>Griffiths</mark> wasn't too happy about the invitation, and sent a public reply to everyone else on the mailing list criticizing the value of the diversity training. \"I exhort you not to attend this training. Don't lay waste your time by doing so,\" he wrote. \"It'll be, I predict with confidence, intellectually flaccid: there'll be bromides, clichés, and amen-corner rah-rahs in plenty. When (if) it gets beyond that, its illiberal roots and totalitarian tendencies will show. Events of this sort are definitively anti-intellectual.\" Dean of the Duke Divinity School Elaine Heath His response wasn't well-received, and within hours, school dean Elaine Heath sent an email to campus faculty reprimanding mass emails like the one <mark>Griffiths</mark> sent out. Without mentioning the professor specifically, Heath wrote: \"It is inappropriate and unprofessional to use mass emails to make disparaging statements--including arguments ad hominem--in order to humiliate or undermine individual colleagues or groups of colleagues with whom we disagree. The use of mass emails to express racism, sexism, and other forms of bigotry is offensive and unacceptable, especially in a Christian institution.\" According to further emails published at The American Conservative, Heath requested to speak with <mark>Griffiths</mark>, but neither of them could agree on the conditions of the meeting. The News & Observer reports that <mark>Griffiths</mark> later sent out a separate email to his colleagues informing them that he was now subject to two separate disciplinary proceedings, including a harassment complaint by Portier-Young, which was prompted by his initial response. <mark>Griffiths</mark> says that the dean had furthermore banned him from attending faculty meetings and was told he wouldn't receive future funds for research and travel. Anathea Portier-Young, Duke Divinity School <mark>Griffiths</mark> characterized these punishments as \"reprisals\" for his willingness to voice criticism, designed not to engage the points he made \"but rather to discipline me for having expressed them.\" \"Elaine Heath and Thea Portier-Young, when faced with disagreement, prefer discipline to argument,\" he wrote in his blistering response. \"In doing so they act illiberally and anti-intellectually; their action shows totalitarian affinities in its preferred method, which is the veiled use of institutional power.\" \"They appeal to non - or anti-intellectual categories (\"unprofessional conduct' in Heath's case;\" harassment' in Portier-Young's) to short-circuit disagreement. All this is shameful, and I call them out on it, \"wrote <mark>Griffiths</mark>. Given Professor Griffith's position as an endowed chair, which includes tenure, there was little to no possibility that the university could have vacated his position or fired him. Griffith's resignation is clearly intended to send a message to the school's administration--and it's one that comes through loud and clear. <mark>Ian Miles</mark> Cheong is a journalist and outspoken media critic. You can reach him through social media at @ stillgray on Twitter and on Facebook. Advertisement More Elites Financing Social Justice: 6,000 Harvard Alums Invest in Left-Wing Site Mic.com Yale College Republicans Taunt Grad Student\" Hunger Strikers' With Barbecue, Corn and Baked Beans Columbia University Accused of Censoring Its \"Politically Incorrect' Marching Band Trayvon Martin to Receive Posthumous Degree From Florida University Show Full Article Related UVA Puts Business Professor on Leave for Criticizing Black Lives Matter College Disorientation How Campuses Became So Disconnected From Reality"}]