[{"date": "2014-11-06", "url": "http://www.reviewjournal.com/life/naming-las-vegas/walker-international-school-named-language-education-legend", "content": "From serving Mexican food to singing and playing \"La Cucaracha\" on the guitar, retired language teacher Dr. J. Marlan Walker is a Henderson legend. \"I loved when he would play his guitar or speak in one of the many different languages or dialects he knew,\" said former student Teddi Goodale Biggs. \"He made learning fun. Everyone respected and admired him .\" Well-respected throughout the community, it made sense when former students, family and friends nominated Walker as a potential elementary school namesake. \"When people ask me why they named a school after me, I tell them,' I don't have the slightest idea,'\" Walker said. \"I can think of many people who are more deserving than I, but I'm still very grateful for the honor they've awarded me. It touched me deeply .\" Walker International School, 650 Scholar Drive, opened in 2002, offering its students lessons in English and Spanish. \"I think the reason they made it a bilingual school was because of my background,\" Walker said. \"I've visited the children in different grades over the years, and I'm amazed at what they learn. It's given me a great deal of pride and satisfaction to watch them develop and grow into citizens of our society .\" Born in Southern Utah, Walker served in Mexico during a church mission shortly after graduating from high school. \"After the mission, I stayed there and went to the university in Mexico City to get a degree,\" Walker said. \"I was already employed with the government down in Mexico near the border, but I came to visit my sister in Henderson around 1952 .\" During the visit, Walker met with his sister's friend and former Clark County School District superintendent Lyal Burkholder. \"He said they needed a language teacher at Basic High School,\" Walker said. \"I hadn't planned on teaching or even staying in Henderson, for that matter, but I thought I would give it a try .\" For 36 years, Walker taught Spanish and Latin at Basic and ran the school's language department. He taught some of Nevada's most influential people, including Sen. <mark>Harry Reid</mark> and former Gov. Mike O'Callaghan. Walker said he was presented with opportunities to advance into administration, but he declined them to continue working with students. \"I had some opportunities to earn more money, but why would I want to leave something I loved so much?\" he said. \"With the rapport I felt with them and the love a teacher has for their students, teaching gave me a great deal of fulfillment and satisfaction .\" Walker continued visiting Mexico, Peru and Guatemala while teaching. He started exchange programs and planned trips to Mexico so students could immerse themselves in the language. \"I wanted students to have the opportunity to be involved in Spanish, but the classroom wasn't long enough,\" Walker said. \"So, we developed extra programs so that kids could learn to really love the language .\" Although Walker took teaching seriously, former students said he had a great sense of humor. Mark Prime attended a two-week trip to Mexico with Walker in June 1963. While visiting some Aztec pyramids, Walker encouraged Prime to barter with a vendor for an onyx carving. \"I was able to get the vendor to cut the price by half,\" Prime said. \"Proud of myself, I told (Walker) what I had done and how much I paid. He smiled and said I still paid twice what it was worth .\" Kathleen Kimmel traveled to Mexico during her sophomore year with Walker and met a boy named Alejandro, who wrote to her after she returned home. \"He wrote beautiful letters in wonderful penmanship, but I could not understand a word,\" Kimmel said. \"So I took my letters to (Walker), who read the letters to himself, chuckling and teasing me to pieces but not telling me what the letters said .\" Walker retired from the school district in 1989 but continued promoting education abroad. At 86, Walker helps run the Las Gaviotas Foundation, a humanitarian project that helps students attend secondary school to prevent poverty in Mexico, Peru and Guatemala. \"I will continue traveling until I get old and cannot move anymore,\" Walker said. \"This is the love of my life .\" Contact Henderson View reporter Caitlyn Belcher at cbelcher @ viewnews.com or 702-383-0403.", "articleID": "2014110607_00061311_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}}, {"date": "2014-11-06", "url": "http://wwl.com/Edwards-earns-runoff-spot-kiss-McAllister-goodbye/20259775", "content": "<mark>Edwards</mark> earns runoff spot; kiss McAllister goodbye The short, promising congressional career of Republican Vance McAllister came to an abrupt halt in Tuesday's elections in Louisiana, while the long and storied political career of <mark>Edwin Edwards</mark> was, at least temporarily, resurrected. McAllister, a married, family values Republican, lost the 5th District seat he was elected to less than a year ago after a video surfaced early this year showing him kissing another woman. <mark>Edwards</mark>, the four-term governor and thrice-married ladies' man, earned a runoff spot in the 6th District. He had to overcome a more serious scandal - his 2000 corruption conviction and subsequent prison term. That he has, at least for now, made for good headlines Tuesday but neither his success nor McAllister's defeat appear likely to do much to change Louisiana's congressional layout. Monroe's Democratic Mayor, Jamie Mayo, will face Republican physician <mark>Ralph Abraham</mark> in the Dec. 6 runoff in northeast Louisiana's 5th District, which has been a reliably Republican district for years. In the 6th, <mark>Edwards</mark> will face former state coastal restoration chief Garret Graves in a Baton Rouge-area district that has gone reliably Republican in the last two presidential races. <mark>Edwards</mark> was undaunted as he addressed supporters Tuesday night with his wife, Trina - five decades his junior and the mother of their toddler son - standing beside him. \"On the 7th day of December I'll address you as the congressman from the 6th District of Louisiana,\" <mark>Edwards</mark> said. Graves finished ahead of a divided Republican field that included state Sen. Dan Claitor, businessman Paul Dietzel and state Rep. Lenar Whitney. All sought to replace incumbent Republican Bill Cassidy, who is running for the Senate seat held by Democrat Mary Landrieu. In the 5th District, Monroe Mayor Jamie Mayo, a Democrat, earned a runoff spot against physician <mark>Ralph Abraham</mark>, who edged out other Republicans including Zach Dasher, a relative of the \"Duck Dynasty\" reality TV family. The state's other four House races were milder affairs in which incumbents faced no well-known opposition. Republicans Steve Scalise in the 1st District, Charles Boustany in the 3rd and <mark>John Fleming</mark> in the 4th and Democrat Cedric Richmond in the 2nd all won easily on Tuesday. <mark>Edwards</mark> staked out notably centrist views in the 6th District race, in contrast to his Republican opponents. He backed same-sex civil unions (but not gay marriage); supported a minimum wage increase; favored the expansion of Medicaid under the Affordable Care Act even as he voiced complaints about the act overall. Rounding out the field were Republicans <mark>Robert Bell</mark>, Craig McCulloch and Trey Thomas; Libertarian Rufus Craig Jr.; Democrats Richard Lieberman and <mark>Peter Williams</mark>. McAllister was considered something of a dragon slayer last November when he won a race to fill the unexpired term of another Republican, Rodney Alexander. The Saints are 4 and 4 and coming home to the Dome for the next three games. Are you waiting for one more win to think playoffs? Will it take 2 more to think that or playoffs, playoffs are you crazy too early for that. Waiting for one more win to think playoffs Will take 2 more to think that or playoffs", "articleID": "2014110608_00046934_W", "names": {"Edwin Edwards": ["Q18160058", "Q737491"], "John Fleming": ["Q1699042", "Q1699486", "Q1700075", "Q27951103", "Q28434600", "Q29642671", "Q3181504", "Q43914501", "Q6233427", "Q6233431"], "Peter Williams": ["Q12798640", "Q16106852", "Q16189569", "Q16751058", "Q19877010", "Q21066726", "Q23020690", "Q23900914", "Q24192582", "Q24704507", "Q24716880", "Q29034177", "Q29643792", "Q3376966", "Q37842905", "Q56989523", "Q57313212", "Q6193763", "Q7177725", "Q7177726", "Q7177727", "Q7177728", "Q7177730", "Q929719"], "Ralph Abraham": ["Q18683775", "Q973595"], "Robert Bell": ["Q17375839", "Q23541365", "Q3063343", "Q3113271", "Q3434544", "Q3434545", "Q47541907", "Q58416741", "Q58416759"]}}, {"date": "2014-11-06", "url": "http://www.masslive.com/news/worcester/index.ssf/2014/11/worcester_seeks_input_for_spen.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to comments Worcester seeks input for spending plan for federal funds \"There's 199 apartments here. That's bigger than a lot of neighborhoods .\" WORCESTER - City officials got an earful of complaints and suggestions from residents of Lincoln Park Towers Wednesday. The residents felt that their neighborhood had a number of strengths, ranging from easy access to stores, transportation and medical facilities, to a quiet atmosphere away from the city's bars and night-time hot-spots, to an inclusive atmosphere with a lot of activities for the largely elderly population. However, there were also a number of areas the residents hope to see improved, from the most local level, like the slow elevators and slamming doors in the tall apartment buildings and the need for a dog park, to more broad concerns, such as the construction of roads and bridges and better coordination of traffic and pedestrian signals. Some even raised concerns about \"troublemakers\" in the buildings and a desire for an increased police presence in the area. The comments came during one in a series of community forums aimed at getting input from residents to inform the city's five-year plan for spending federal Community Development Block Grants (CDBG). The goal, said <mark>Greg Baker</mark>, the city director of Neighborhood Development, is to explore the issues of importance to residents in different parts of the city. The comments will help the city craft its requests for federal funding and keep the government informed of the overall goals for Community Development Block Grants - which <mark>Baker</mark> said totaled some $4 million to $6 million per year. \"Your feedback is very important and we take it very seriously,\" he told the group of more than 20 residents. Ed Moynihan, chairman of the Community Development Advisory Committee, said that although the process can be cumbersome at times it really provides good, needed insights into what residents really want and need. \"That's one of the strengths of the program,\" Moynihan said of the CDBG's requirement to solicit community involvement. \"It does force people to listen and the process makes people feel involved in making improvements, which they are .\" He added, \"Hopefully we'll get a nice good cross section\" from the forum and the others like it in the series. Another four more community forums are scheduled before the end of the month. However, Moynihan noted that some of the concerns, like the complaints about the towers having only two elevators, were almost certainly outside of the scope of projects the grants are allowed to address. \"Still, it's a concern,\" he said. \"But it doesn't really make the cut .\" One resident, Randell Ormo, who lives in the towers, noted that although the facilitators were encouraging participants to think about their neighborhood, everyone present lived in the building. When the big stories break, we'll send you an alert. Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 MassLive LLC. All rights reserved (", "articleID": "2014110610_00056094_W", "names": {"Greg Baker": ["Q128830", "Q42913450"]}}, {"date": "2014-11-09", "url": "http://wkrg.com/story/27330142/column-king-james-knows-cavs-a-work-in-progress", "content": "(AP Photo/Rick Bowmer). A Utah Jazz fan celebrates as Cleveland Cavaliers' LeBron James (23) waits during the second half of an NBA basketball game Wednesday, Nov. 5, 2014, in Salt Lake City. (AP Photo/Rick Bowmer). Cleveland Cavaliers' LeBron James (23) looks at the scoreboard in the second quarter during an NBA basketball game against the Utah Jazz, Wednesday, Nov. 5, 2014, in Salt Lake City. (AP Photo/Don Ryan). Cleveland Cavaliers forward LeBron James watches from the bench during the second half of the Cavaliers' NBA basketball game against the Portland Trail Blazers in Portland, Ore., Tuesday, Nov. 4, 2014. (AP Photo/Don Ryan). Cleveland Cavaliers guard Kyrie Irving, left, drives past Portland Trail Blazers center Robin Lopez during the first half of an NBA basketball game in Portland, Ore., Tuesday, Nov. 4, 2014. By PAUL NEWBERRY AP National Writer LeBron James is right. Everyone needs to RELAX. The Cleveland Cavaliers are going to be just fine. But it's going to take time. <mark>James</mark> and his latest version of the Big Three are still a work in progress, which was evident as they lost three of their first four games. Not surprisingly for a team that's already been anointed as the next NBA champion, the slow start sparked an immediate stream of conjecture over just what's wrong with the Cavs. The diagnosis ranged from <mark>James</mark> playing too passively as he adjusts to a new set of teammates (guilty as charged) to the <mark>King</mark> not getting along with point guard Kyrie Irving (a run-of-the-mill disagreement has surely been blown waaaaay out of proportion). <mark>James</mark> took to Twitter, hitting the all-caps button for emphasis. He, better than anyone, knows it's far too early to hit the panic button. Let's not forget: When <mark>James</mark> and <mark>Chris Bosh</mark> signed with Miami in 2010, joining Dwyane Wade to turn the Heat into a supposedly unbeatable juggernaut, that version of the Big Three lost eight of its first 17 games together. <mark>James</mark>, Irving and <mark>Kevin Love</mark> will likely take even longer to mesh. \"It's a message for everyone to understand how important the process is,\" <mark>James</mark> said, when asked about his tweet during Friday's shootaround in Denver. \"Everyone wants overnight success. It just doesn't happen when teams first come together .\" The most pressing issue for the Cavs was tightening up when they don't have the ball. Heading into Friday night's game at Denver, they had surrendered 101.5 points a game (23rd overall), not exactly the sort of defense expected from a championship-level team. Only two teams were allowing opponents to make a higher share of their shots than Cleveland, which was giving up a whopping 49.5 field-goal percentage. The Knicks made nearly 54 percent in their opening-night win at Cleveland; they were shooting less than 42 percent against everyone else. Utah knocked down more than half its shots (39 of 77) while beating the Cavaliers on Wednesday night, the first time the Jazz had eclipsed 50 percent in a game this season. The Portland Trailblazers shot significantly better while beating LeBron & Co. (49.3 percent) than they had against their other opponents (a cumulative 44.2 percent). <mark>James</mark> has long been one of the league's top defenders, but he must get some help from <mark>Love</mark> and Irving. If not, the Cavs are unlikely to get out of the Eastern Conference, much less win long-suffering Cleveland's first championship - in any sport - since the 1960s. Not to get too far ahead of ourselves, but the Cavaliers may have to go through a postseason disappointment or two before they finally win it all. That's usually the way it's done. Detroit had to get over a pair of excruciating defeats to Larry Bird and the Boston Celtics before the Bad Boys finally broke through to win the first of two straight titles in 1989. During both of those title runs, the Pistons knocked off <mark>Michael Jordan</mark> and the Chicago Bulls in the Eastern Conference finals. MJ, of course, used the motivation from those defeats to win a half-dozen championships. Even the Heat lost in their first trip to the finals with a Big Three, beaten by the Dallas Mavericks in 2011. <mark>James</mark>, Wade and <mark>Bosh</mark> closed out their four years together with a crushing loss to San Antonio in last season's championship round. Now, <mark>James</mark> is teamed with <mark>Love</mark> and Irving, who are undoubtedly two of the league's best players but don't have the same life experiences - not yet anyway - as the last Big Three. Wade already had a championship on his resume before he played a minute with <mark>King James</mark>. <mark>Bosh</mark> had appeared in a couple of playoff series for Toronto before he signed with the Heat. <mark>Love</mark> and Irving have never been to the playoffs. Never even played for a winning team. Irving spent his first three years as the top player on Cleveland squads that were a combined 74 games under .500. <mark>Love</mark> endured even more frustration during six seasons in Minnesota, essentially a one-man team as the Timberwolves struggled through 160 more losses than wins. Both are used to putting up gaudy numbers, with little feedback or criticism for the flaws in their games. Now they're playing with <mark>King James</mark>, who is the undisputed star. <mark>Love</mark> and Irving are the supporting players, and how quickly they adapt to less-glamorous duties - playing tough defense, pounding the boards, doling out assists - will go a long way toward determining how long it takes the Cavaliers to win a championship. Consider Wade and <mark>Bosh</mark>, whose strong play in the early going this season shows just how much of an ancillary role they played while LeBron was around. Irving, for instance, can't go through a stretch where he's taken 36 shots since his last assist (as was the case before Friday's game against the Nuggets). \"This team can be as good as it wants to be,\" <mark>James</mark> said. \"But we can't short-cut the process along the way .\" Maybe he should've added another word to his \"RELAX\" tweet. Patience. ___ Paul Newberry is a national writer for The Associated Press. Write to him at pnewberry @ ap.org or www.twitter.com/pnewberry1963 555 Broadcast Dr, Mobile AL 36606 Telephone:", "articleID": "2014110900_00000363_W", "names": {"Chris Bosh": ["Q201386", "Q5105938"], "Kevin Love": ["Q297221", "Q6396801"], "King James": ["Q17100723", "Q36159"]}}]