[{"articleID": "2017111415_00398221_W", "names": {"Sean Flynn": ["Q461502", "Q7441002"]}, "date": "2017-11-14", "url": "http://www.chicagonow.com/2017/11/whos-your-daddy/", "content": "Tweet By <mark>Sean Flynn</mark>, Monday at 1:28 pm Everyone needs an example, right? \"Say, See, and Do\" is a common learning strategy used by some educators across the country. This practice is founded on the idea of following the leader. The notion of an example holds so much weight for us as people, even more so as minority men. As a matter of fact, everyone could use it as a point of reference. Needless to say, having a good example before us is vital to our development. So, since we are talking about examples, let's talk about fathers. Fathers represent the first model of a man for boys. It is expected that a male child will imitate or mimic the behavior that was displayed before him. This obviously works whether the situation is positive or negative. What is role modeled before us affects our preferences and decisions. Now place this in a context of moral accountability. If a child grows up without seeing his father display a relationship with God before him, it is plausible that the child will develop a similar preference. Of course, there's a possibility that the child can cultivate a spiritual relationship on his own, independent of what he saw growing up. But I would like to think that those chances are slim. I read a study some years ago that highlighted the fact that black churches are 25% male versus 75% female. Now consider this: a reported 74% of black children grow up in single parent homes where predominately the single parent is typically a woman. Stands to reason why more black males don't go to church or struggle to identify with a male figure of God seeing that their own relationship with their natural father is strained. I am a Christian. To that end, I'm a huge advocate for cultivating the spiritual man inside of me. By developing a personally active relationship with God (who I regard as my spiritual father), I am strengthening my moral accountability. This in turn encourages me to live ethically, leading me ideally to make the right decisions in life. Being a Christian is a lifestyle. Because of my spiritual stance there are certain ideologies that I strive to uphold. Namely for me, that's adhering to the principles of the Bible. This is what helps keep me grounded in life. Consider this: How do I tie a necktie properly if I've never been taught? How will I learn to shave correctly if I've never witnessed anyone do it? Do catch my drift? As time has it, you will learn some things along the way, whether right or wrong. Like plants, we all grow, but the question is will how we grow? My point is--not knowing how to maintain a relationship will affect you. In the case, I'm referring to a spiritual one rather than a natural one. I believe that a lot of men are affected on the inside because they don't know how to have a meaningful relationship with God. Unfortunately, these men seldom cry, lack compassion, show little empathy, usually become bitter, often become angry, in addition to being cold and alone internally. I attribute this to the possibility that they didn't see very many good examples of godly men. Maybe they didn't know any men who prayed or read their Bibles regularly. Maybe they didn't know any men who attempted daily to live out the principles of Christ. Maybe they saw some bad examples that turned them off to the idea of being a Christian male. I don't know for sure, but what I do know is that there is a difference in a man whose heart is filled with joy, has peace of mind, lives with purpose, shows love to many and is truly genuinely happy versus a man who doesn't know God in his heart. Similar to how it's important to know who your natural father is, I see it as just as important to know who your spiritual father is. Now understandably, some may not share the same beliefs in God as I do. I respect that. But for those that do, or are open to the idea, I think it's something to be said for such a meaningful bond. The way you engage God starts with believing who he says he is, the next step is prayer or communicating with him. Also meditating and studying his word, The Bible is an important step in getting to know Him. And lastly, intentionally living out the principles of Christ. These basic practices performed daily make up the foundation to building a meaningful relationship with God. Of course, there is more to this relationship outside of these basic steps. But whatever else you need to know will come organically as a result of your efforts to getting to know God. It is said that \"If you take one step toward him, he will take two toward you\". I am proud to say I know who my (heavenly) father is, even though I don't know my biological father. I wouldn't be the man I am today if not for God's impact on my life. I firmly believe that not only having a personal relationship with God has been beneficial to my life, but it can also be beneficial to yours as well. Meet The Blogger <mark>Sean Flynn</mark> <mark>Sean Flynn</mark> was raised in the West Pullman and Roseland neighborhoods on the Southside of Chicago. The product of a single parent home, Mr. <mark>Flynn</mark> is the youngest of four boys. Besides the harsh life experiences sometimes learned in the streets Mr. <mark>Flynn</mark>'s upbringing consisted of family, friends, school or church. At his core he is a son, brother, husband, father and friend to those who know him. Being a parent for Mr. <mark>Flynn</mark> wasn't just limited to his own children; he became a father figure to other young people whom he came in contact with as well. Having a heart for the troubled youth in Chicago led him into mentorship many years ago. Mr <mark>Flynn</mark>'s experience has included working for Chicago's Lighthouse for the Blind, THe Harris YMCA, Coaching Girls Basketball at Barnard Elementary, Mentoring youth at By The Hand Club for Kids, in addition to being a youth leader at the Joliet Church of God. Mr. <mark>Flynn</mark> has had extensive training in youth development; some of which being S.E.L., Mental Health First Aid, Trauma and De Escalation training. Mr. <mark>Flynn</mark> is a self published author of the book, \"The Manual - From Adolescence to Manhood\". He also facilitates a male mentorship program - Manology 101 for at risk teens in underserved communities in Chicago. Working in the various southside communities is Mr. <mark>Flynn</mark>'s passion. His mission is to shape and mold young minds into the positive leaders their neighborhoods will need in the future. Subscribe by Email"}, {"articleID": "2010091003_00209594_W", "names": {"Partha Banerjee": ["Q18763852", "Q47113633", "Q57050263"], "Narendra Kumar": ["Q16093889", "Q29829871", "Q42292955", "Q58431952", "Q6965784"]}, "date": "2010-09-10", "url": "http://blog.taragana.com/e/2010/09/09/queen-hilsa-reigns-over-kolkata-palates-eating-out-with-ians-165497/", "content": "0 queen hilsa reigns over kolkata palates (eating out with ians) kolkata - as the monsoon drenches kolkata, hilsa, the silvery delight of a fish that tantalises bengali palates, is firing the imagination of chefs at restaurants as they dish out a range of delicacies, traditional and cross-border! steamed, fried, roasted in banana leaf, or cooked with rice as biryani, it can invade your senses in many avatars, especially the catch from neighbouring bangladesh's padma river that has as much appeal for the sentiments of people here as for their appetites. bengali cuisine restaurant 6 ballygunge place organised a bangladeshi illish utsav, with the fish locally known as illish. \"bengalis have a special liking for illish-based cusines, whether costly or not. the response to the festival was quite good,\" <mark>partha banerjee</mark>, spokesperson for the eatery, told ians. the hilsa is a sea fish that swims up to the river to spawn. during the monsoon, the rivers of west bengal are dotted with the fish. there have been concerns about the dwindling numbers of hilsa due to over-fishing, but that has not stopped bengalis from putting it on top of their menu. and never mind its many bones; they know how to negotiate it anyway. \"it's the queen of all fish. bengalis love it. bangladeshi dishes based on the hilsa are simply mind-blowing. preparations such as lauer pata diye ilish, dhakai bhapa illish, langka dhonepata illish, illish macher dimer ambol and ilish paturi are indeed marvellous,\" said dhurjay batbal, a hilsa lover. dhakai bhapa hilsa is one of the most famous dishes of bangaldesh. it is prepared with poppy seed paste. langka dhonepata illish sees the fish combining deliciously with coriander leaf paste and chopped chilis. \"the response to the illish festival has been fantastic. illish is a weakness of bengalis all over the world. we too offer various kinds of illish dishes,\" hindol basu, spokesperson of tero parbon restaurant, told ians. the innovation - laupata diya illish macher dhakai paturi or gravy cooked with the leaves of the bottle gourd - can be paired with illish biriyani, blending two different traditions of cuisine. illish maachh bhaja or the simple fried fish with khichudi brings back many fond memories of monsoon evenings, especially for those who left the then east pakistan - present-day bangladesh - when india was partitioned. generations have grown up on stories of the padma illish, with the fish continuing to make an appearance in many kitchens during celebrations. even those who don't have time to cook due to hectic lifestyles don't miss their date with the hilsa, thanks to restaurants which dish out an incredible variety. \"as many families are nuclear families, they don't have time to cook different kinds of preparations. so hilsa festivals are the best way to satisfy the taste buds of bengalis,\" added basu. some bengali cuisine restaurants also offer the illish thali. a thali ranges from rs.500-800 depending on the items included. for enthusiasts, the illish thali comprises plain rice, dal with fish head, fried potato, fried hilsa eggs, bhapa ilish, shorshe illish and illish macher chachra combined with chatni, papad and sweets. fall foliage, festivals and southern charm in artsy asheville, nc venice film festival: tsui blends fantasy, martial arts, special effects for \"detective dee\" \"granny pods' instead of old age homes - a new idea for us seniors june 10th, 2010 kolkata - after playing varied roles, three time national award winning actor mithun chakroborty will be seen portraying a junior artist in the bengali movie\" shukno lanka \".\" my role in \"shukno lanka' is very challenging. may 30th, 2010 new delhi - the art of deboning a hilsa, a gourmet fish from bengal, is\" a rite of passage - a trial by bone that grants an outsider the right to entry into the bengali civil society \", says travel writer samanth subramanian .\" an executive chef at kolkata's park hotel once said only a real bengali could negotiate the bone. april 30th, 2010 kolkata - rice, dal, brinjal fry, vegetables, fish or mutton curry, with some chutney thrown in...sounds just like home food? that's what kolkatans are loving about the many new services that promise healthy, homely and reasonably priced food. working couples, the elderly, bachelors - basically anybody unable or unwilling to spend time in the kitchen and at the same time loathe to eating out because of rich and oily food - are part of this new trend in kolkata. april 19th, 2010 kolkata - want to try out mediterranean dishes like fisherman's ciopino (moroccan), gamboroni formaggi (italian) and chak chauka (turkish)? just step into any of kolkata's popular restaurants that specialise in mediterranean cuisine for a memorable dining experience. mediterranean cuisine is unique to countries such as italy, france, spain and lebanon, situated around the mediterranean sea. february 8th, 2010 kolkata - leading fashion designers j.j. valaya, <mark>narendra kumar</mark> and rocky s. october 19th, 2009 kolkata - skinny models gave way to average sized and buxom ones at designer tejas gandhi's fashion show in kolkata. gandhi's collection featured trendy clothes for people with all kinds of sizes, away from the size zero fashion image. september 18th, 2009 kolkata - the second edition of kolkata fashion week (kfw) may have recorded a good turnout of designers and spectators, but commerce did not pick up, with foreign buyers staying away due to swine flu and domestic ones calling for better quality control. \"we have just started and we are hopeful that with time we will get more buyers - though this time we have received quite a few buyers,\" pratik sen, one of the directors of mindscape maestro, the organiser of the show, told ians. kolkata fashion week at par with delhi, mumbai events: minissha lamba kolkata - the kolkata fashion week (kfw) is at par with similar shows in mumbai and delhi in terms of professionalism, says bollywood actress minissha lamba. \"there's been an astronomical change in the kfw event in just six months time. september 12th, 2009 kolkata - bollywood actors nandana sen and rituparna sengupta sashayed down the ramp on the second day of the ongoing second edition of kolkata fashion week. designer nandita palchoudhuri showcased her weaver's work with the models setting the ramp on fire exhibiting a wide range of tangail, baluchari and dhakai sarees made by the craftsmen of west bengal. september 12th, 2009 kolkata - popular tv personality and cricket commentator mandira bedi kept the kolkata fashion week-ii audience spellbound as she sashayed down the ramp for the satya paul collection that was showcased saturday. an excited mandira later told reporters:\" kolkata is my birth place. no synthetic for me: bangladeshi designer bibi russell (interview) kolkata - she was a catwalk queen abroad, but returned to her native land, bangladesh, to help the handwoven textile industry. today bibi russell says nothing in the world can make her design synthetic garments. september 10th, 2009 taragana has given kolkata fashion week ii the most comprehensive coverage possible! tens of pictures from notable designers like rocky s, ritu kumar, leena taneja, wendell rodricks zubair kirmani, shweta chhawchcharia bibi russell, kalol dutta, soumitra mondal and the one and only neeta lulla are here for you. exclusive fashion shows of weaves-i and weaves-ii have been shot drop dead. september 9th, 2009 kolkata - based in a city little known as a fashion destination, local designers are rating two fashion weeks in a space of five months in kolkata as a windfall of sorts. as they gear up to showcase their collection in the five-day kolkata fashion week (kfw) - ii beginning wednesday, the designers feel the event will bring them good business and facilitate tie-ups with buyers. september 8th, 2009 kolkata - the kolkata fashion week-ii, beginning wednesday, received a jolt tuesday with title sponsor emami pulling out over contractual issues. \"there were some contractual things, which they wanted us to do but we could not agree,\" event promoters mindscapes maestros managing director yudhajit dutta told ians."}, {"articleID": "2017041400_00207542_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Mark Warner": ["Q14949474", "Q1617921", "Q21166633", "Q453893", "Q51299121", "Q6770231"], "John Carlin": ["Q1231024", "Q15434040", "Q1898439", "Q33019263"]}, "date": "2017-04-14", "url": "http://www.610kvnu.com/world/dea40aa8c177bb9f3de5d152e1828b17", "content": "Analysts identify #SyriaHoax as Russian-fueled propaganda Posted just a moment ago the_guitar_mann / iStock/Thinkstock (NEW YORK)--As Syrian president Bashar al-Assad called videos of last week's chemical attack a \"fabrication,\" a piece of propaganda promoted by a Russian cyber operation and bearing the hashtag #SyriaHoax has gained traction in the United States, analysts tell ABC News. Following the chemical weapons attack that killed dozens of civilians on Tuesday, Al-Masdar News, a pro-Assad website based in Beirut, published claims that \"something is not adding up in [the] Idlib chemical weapons attack .\" Its author cited \"holes\" in the accounts provided by the \"Al-Qaeda affiliated\" White Helmets leading to the conclusion that \"this is another false chemical attack allegation made against the government .\" That hoax story was promoted by a network of Russian social media accounts and ultimately picked up by popular alt-right personalities in the United States, including Mike Cernovich, one of the leading voices in the debunked \"Pizzagate' conspiracy theory. Cernovich popularized its new hashtag--#SyriaHoax--and sent it soaring through cyberspace. According to Trends24, within hours of the retaliatory missile strike President <mark>Donald Trump</mark> launched on Thursday night, #SyriaHoax was the No. 1 trending Twitter topic in the United States. J.M. Berger of The International Centre for Counter-Terrorism at The Hague, who studies propaganda and social media analytical techniques, said #SyriaHoax is\" a clear example of a Russian influence campaign \"designed to undermine the credibility of the U.S. government .\" The point of an influence campaign is to get people involved who wouldn't otherwise be involved, \"Berger said .\" A lot of people in the alt-right would not necessarily characterize themselves as being pro-Russian, but they're receiving influence from this campaign. \"Berger cannot say whether Al-Masdar News is backed by either the Syrian government or the Russian government, only that the outlet\" is being promoted at an extraordinary level by this [Russian] network \"and the Kremlin has a history of weaponizing disinformation .\" This is a new iteration of an old type of warfare, \"Berger said .\" We saw the Soviet Union use tactics like this during the Cold War. The difference is that you can do it on an industrial scale at a very low cost without deploying actual operatives on the ground of a foreign country. \"This latest social media coup comes just months after Russia's attempts to use similar tactics to meddle with the U.S. presidential election, which U.S. officials believe was undertaken by a secretive Russian intelligence operation based in St. Petersberg tasked with manipulating public opinion. Senator <mark>Mark Warner</mark>, the ranking Democrat on the Senate Intelligence Committee investigating those efforts, says a close examination of the evidence so far reveals a disturbing timeline running throughout the campaign. WikiLeak's release of Hillary Clinton campaign chairman John Podesta's Russian-hacked emails--just 29 minutes after The Washington Postpublished an explosive video showing <mark>Donald Trump</mark> making sexually explicit comments during an Access Hollywood shoot--raised particular concerns .\" That was more than coincidence, \"<mark>Warner</mark> said .\" It is so outrageous that a foreign nation came in and manipulated our news, hacked into personal information leaked it out on a selective basis. \"According to Ciaran Martin, the head of a newly created national cybersecurity operation at Britain's GCHQ, which provided U.S. officials with the first indication that the Russians had hacked the Democratic Party, activity like this hasn't slowed down since the presidential election in November. It's actually on the rise .\" I think we've seen a significant increase in Russian aggression in cyberspace over the past two years, \"Martin said .\" We see attacks from state actors on a very frequent basis...It has not plateaued. It is continuing to increase. \"<mark>John Carlin</mark>, the former assistant attorney general for national security and an ABC News consultant, said the U.S. has less than four years to find a way to protect its election process .\" They're going to come after us again in 2020, \"<mark>Carlin</mark> said .\" If anything it may be more severe...They're probably going to come back with more skill, more desire to cause impact, and between now and then, we need to make sure they don't succeed. \"Copyright © 2017, ABC Radio. All rights reserved."}, {"articleID": "2018012919_00769155_W", "names": {"David Price": ["Q1176177", "Q16063598", "Q20804677", "Q20973688", "Q332804", "Q37830471", "Q5238707", "Q5238709", "Q5238711", "Q5238712", "Q5238713", "Q5238714", "Q5238716", "Q56072488", "Q56952850", "Q634326", "Q984010"]}, "date": "2018-01-29", "url": "http://mlb.mlb.com/news/article/mlb/tigers-castellanos-takes-on-leadership-role?ymd=20180129&content_id=265496936&vkey=news_mlb", "content": "Relaxed Castellanos embracing leadership role By Jason Beck MLB.com @ beckjason Facebook Share Twitter Share Email Copy Link Print DETROIT--Four years have passed since Nicholas Castellanos broke into the big leagues with the Tigers, as a highly-touted prospect with Detroit roots. As he talked with reporters at TigerFest on Saturday at Comerica Park, it might be the most comfortable the 25-year-old has seemed in his role here. At a time when Castellanos' future in Detroit isn't entirely clear, two years away from free agency on a team in the early stages of a rebuilding project, the Tigers' starting right fielder sounds not only relaxed and comfortable, but prepared to take on a role as part of the core of the franchise. DETROIT--Four years have passed since Nicholas Castellanos broke into the big leagues with the Tigers, as a highly-touted prospect with Detroit roots. As he talked with reporters at TigerFest on Saturday at Comerica Park, it might be the most comfortable the 25-year-old has seemed in his role here. At a time when Castellanos' future in Detroit isn't entirely clear, two years away from free agency on a team in the early stages of a rebuilding project, the Tigers' starting right fielder sounds not only relaxed and comfortable, but prepared to take on a role as part of the core of the franchise. Video: Castrovince, Justice on Tigers, Castellanos' options \"I would love to,\" he said. \"When I sit in my backyard and I'm looking up and just daydreaming about my dream career, it's [a vision of me being] the kid that helped bring the World Series back to Detroit. My mom was born here. My grandparents are from here. I have cousins that all go to school here ....\"So if I'm able to come over that hump, and it's myself and [Michael] Fulmer and [Shane Greene] and whoever, when we're not supposed to [win], that's Plan A....And I never leave, and I play 23 years in the big leagues here, and I'm an unbelievable right fielder and I'm in conversations with Al Kaline. That's the dream. That's the goal. That's what I love. But we all know in life, we don't always get Plan A. And you just have to make the best of whatever plan you get dealt .\" On Saturday, Castellanos was clearly one of the faces of the franchise at TigerFest and on the Winter Caravan, not only interacting with fans but showing personality. That extended to his talk with reporters, where he expressed his happiness to be a right fielder after years of scrutiny as a third baseman. Castellanos talked extensively about taking that happy feeling to the plate down the stretch. Video: Castellanos on moving to right, Candelario's impact \"To be honest, I love it out there,\" Castellanos said. \"I'm excited to get really good. I want to be called a very good outfielder. I think my arm is going to play better than it did at third base. I think my speed is going to be able to come into play a lot more than it did at third. I think that being able to be out there and be in a relaxed state of mind and not so tense at third base is going to also help me offensively. And I think that you saw that when I got put out there .\" The whole month of September, it was literally like playing backyard baseball, just joking around with the center fielder, having fun, hitting, doing whatever I could to try to win. \"To that end, Castellanos said he switched up his offseason workouts to improve his chances of sticking in right field, focusing on athleticism, agility and quickness .\" Basically I shifted my entire workout program as if I was going to be a corner in the NFL, \"he said .\" I'd run routes and do whatever. The really good outfielders are just really good athletes. And that is all I tried to be. \"Athletes as adults are just kids that just never stop doing athletic stuff. And that's all I tried to focus on this offseason, was kind of breaking down those walls and being a little kid again .\" Video: Nicholas Castellanos' 2017 Highlights That childlike enthusiasm, Castellanos said, carries over into his approach to leadership. \"I think I'm going to be a playful leader,\" he said. \"I think that it's not going to be work. My goal is that, win, lose or draw, we're kids playing baseball. And the rebuild is going to be as fun or as miserable as we make it .\" Castellanos did cite lessons he learned from Tigers veterans of years past, learning competitiveness from Ian Kinsler, how to treat people from Torii Hunter, and camaraderie from <mark>David Price</mark>. Still, Castellanos made it clear he wants to put his own stamp on helping his team. And as rough as September was for the Tigers last year, it's clear the relaxed pressure of that stretch run had an impact on him. Video: Castellanos on learning from his teammates \"I felt like for the first time that I was playing high school baseball again,\" he said. \"I didn't have anybody breathing down my neck. I didn't feel I had to do this, or I had to try to do this. I knew that I could just go about my day and have the best time, joke around, lighten the mood .\" I'm a competitor, but I'm not a very serious competitor. And I think that when you start putting handcuffs mentally on yourself when you try so hard, you get frustrated really easily, and then that's going to hinder your performance. \"Jason Beck has covered the Tigers for MLB.com since 2002. Read Beck's Blog, follow him on Twitter @ beckjason and Facebook. Read more: Detroit Tigers, Nicholas Castellanos Continue Reading View 0 Comments Hide Comments"}, {"articleID": "2013032814_00038093_W", "names": {"Jay Smith": ["Q10379844", "Q19665038", "Q55992720", "Q6167198", "Q6167200", "Q6167207"]}, "date": "2013-03-28", "url": "http://craveonline.com/tv/articles/470043-donut-showdown-comes-to-food-network-canada?utm_source=rss&utm_medium=rss&utm_campaign=donut-showdown-comes-to-food-network-canada", "content": "/ \"donut showdown\" comes to food network canada \"donut showdown\" comes to food network canada a new series on the food network canada has taken the station by storm - \"donut showdown\" is a tasty program that turns donuts into cold hard cash. in each episode three of the best donut makers from across north america test their creativity and must come up with a batch of donuts that includes three surprise ingredients. the show's three expert judges (chef david rocco, chef maggie mckeown, and restauranteur zane caplansky) sample and then send one of the donut makers home. the remaining two contenders then prepare a monster batch of donuts that are based on a theme dictated by the judges to determine who will be the week's winner of $10,000. \"tums! well once you eat, like, 100 doughnuts. or a treadmill, maybe,\" mckeown said on wednesday of her new favourite post-judging snack (as reported by the canadian press). \"i've got to tell you, that part was not easy. by the end of it i was like,\" oh my god, no more doughnuts!' \"she added,\" i think doughnuts are popular because it's a food everybody can relate to. it's a food that every part of the world has some version of? (and) doughnuts have a huge history in the food landscape. \"\"game of thrones' season 3 preview: inside the wildings adrian pasdar joins\" burn notice' season 7 music nova scotia musician <mark>jay smith</mark> dies after show sports best \"ridiculously photgenic jiu jitsu guy' memes monitoring_string =\" 81f1107463d5e188739a27bccd18dab9 \""}, {"articleID": "2011090715_00029913_W", "names": {"Jane Goodall": ["Q184746", "Q57195861"]}, "date": "2011-09-07", "url": "http://pin.primate.wisc.edu/scripts/external.php?link=10213", "content": "actress angelina jolie will appear in <mark>jane</mark>'s jour ney, a film celebrating the life and work of the world's most famous primatologist, <mark>jane goodall</mark>. people reports that the 77-year old scientist expressed her joy in having the hollywood lead actress take part in the film by telling media, \"i was delighted when she [jolie] told me she would be excited to be a part of the film,\" adding, \"sometimes, caught up in the moment, people promise to give their support but don't, or can't come through. that was not true with angelina .\" dr. <mark>goodall</mark>, considered to be the foremost authority on chimpanzees and has worked with other notables in related fields of study including researchers dian fossey (known for her study of gorillas), and birute galdikas (specializing in orangutans). though the doctor's work has been featured in many programs and documentaries through the years, this film gives an unprecedented look at the animal lover's private life. advertisement <mark>jane</mark>'s journey will launch in select theaters on sept. 27--with dr. <mark>goodall</mark> making a personal appearance at a red carpet premiere to commemorate the event. other celebrities who have championed the famous primatologist and will appear include musician dave matthews and actor pierce brosnan (who also appears in the film). did you know? despite her worldwide travels, international acclaim and having been married to an aristocrat, <mark>jane goodall</mark> continues to live in her native town of bournemouth, england."}, {"articleID": "2014072404_00069428_W", "names": {"Paul Chapman": ["Q16148201", "Q3497115", "Q7149781", "Q7149783"], "Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2014-07-23", "url": "http://chicagotribune.com/news/nationworld/chi-israel-palestinian-conflict-20140723,0,4885387.story", "content": "International Committee of the Red Cross warns of critical water shortage facing thousands in Gaza within days. <mark>Paul Chapman</mark> reports Video: Gaza fires rockets towards Israel as world pleads for truce Astronaut tweets photo of Israel and Gaza rocket fire from space GAZA/JERUSALEM - Hamas leader Khaled Meshaal called on Wednesday for a temporary truce to allow humanitarian relief into Gaza, but said his group would keep fighting against an Israeli offensive and would not agree to a more lasting ceasefire without full negotiation of terms. \"We are very interested to have a humanitarian truce as we did last Thursday. We need the calm for a few hours to evacuate the wounded and assist in the relief...This means a real truce backed by a real relief program offered to the people of Gaza,\" he said at a news conference in Qatar. The leader of the Islamist group, which controls Gaza, asked for the international community to help bring medicine, fuel and other supplies into the territory. However, he said that any more permanent ceasefire could only come about after Israel ended its siege, and could only be implemented after it had been fully negotiated. \"Everyone wanted us to accept a ceasefire and then negotiate for our rights, we reject this and we reject it again today,\" he said. He said that despite efforts to broker a more lasting ceasefire, there had been no breakthrough. In a blow to Israel's economy and image, American aviation authorities extended a ban on U.S. flights to Tel Aviv for a second day, spooked by rocket salvoes out of the Strip, with many other global airlines also avoiding the Jewish state. Adding to the pressure on Israel, U.N. High Commissioner for Human Rights Navi Pillay said there was \"a strong possibility\" that it was committing war crimes in, where 687 Palestinians, mostly civilians, have died in the fighting. She also condemned indiscriminate Islamist rocket fire out of and the United Nations Human Rights Council said it would launch an international inquiry into alleged violations. Israel denied any wrongdoing. \"Get lost,\" Justice Minister Tzipi Livni said on her Facebook page in response to the probe. Kerry met Palestinian President <mark>Mahmoud Abbas</mark>, U.N. Secretary General Ban Ki-moon and a grim-faced Netanyahu on Wednesday. He was due to return later in the day to Egypt, which shares a border with and has mediated with Islamist Hamas. \"We have certainly made some steps forward. There is still work to be done,\" said Kerry, on one of his most intensive regional visits since the peace negotiations he had brokered between Netanyahu and <mark>Abbas</mark> broke down in April. Kerry has been working through <mark>Abbas</mark>, Egypt and other regional proxies because the United States, like Israel, shuns Hamas as a terrorist group. Hamas brushed off the U.S. diplomat's appeal, saying it would not hold fire without making gains. \"Our interest and that of our people is that no agreement should be made before the conditions of factions of resistance are met,\" Hamas spokesman Sami Abu Zuhri said. Israel launched its offensive on July 8 to halt rocket salvoes by Hamas and its allies, which have struggled under an Israeli-Egyptian economic blockade on and angered by a crackdown on their supporters in the nearby occupied West Bank. After aerial and naval bombardment failed to quell the outgunned guerrillas, Israel poured ground forces into the Strip last Thursday, looking to knock out Hamas's rocket stores and destroy a vast, underground network of tunnels. \"We are meeting resistance around the tunnels...they are constantly trying to attack us around and in the tunnels. That is the trend,\" Israeli military spokesman Lieutenant-Colonel Peter Lerner said on Wednesday. MILITARY LOSSES RISE Israel announced that three of its soldiers were killed by explosive devices on Wednesday, lifting thearmy death toll to 32. Three civilians have also died in rocket attacks out of, including a Thai laborer hit on Wednesday. The military says one of its soldiers is also missing and believes he might be dead. Hamas says it has captured him, but has not released a picture of him in their hands. register to participate. We filter comments for adherence to our"}, {"articleID": "2019052323_00055075_W", "names": {"Carlos Cruz": ["Q16337071", "Q21005272", "Q5041960", "Q5041962", "Q5750097"], "John Ryan": ["Q16232393", "Q1701635", "Q20738089", "Q20980454", "Q21030342", "Q21166170", "Q3182407", "Q34797535", "Q6256071", "Q6256072", "Q6256074", "Q6256076", "Q6256085", "Q6256088", "Q6256090", "Q6256092"]}, "date": "2019-05-23", "url": "https://www.theobserver.ca/news/crime/dirty-dick-retired-nyc-detective-and-wife-plead-guilty-to-running-brothel-and-gambling-rooms/wcm/5f9a3f96-8a85-46a3-bf37-002e23230e48", "content": "DIRTY DICK: Retired NYC detective and wife plead guilty to running brothel and gambling rooms Published on: May 23, 2019 | Last Updated: May 23, 2019 7:04 PM EDT The devious crime couple Arelis Peralta and Ludwig Paz Facebook Share Adjust Comment Print Retired NYPD detective Ludwig Paz and his wife pleaded guilty to masterminding a sex and gambling ring that netted them an eye-popping $2 million. The kingpin of Queens, 51, and his wife, Arelis Peralta, 43, admitted to operating bordellos in Queens, Brooklyn and Nassau Counties as well as underground gambling establishments. The illicit gaming dens were operated behind beauty parlours and other fronts. Arelis Peralta and Ludwig Paz enjoying some of their ill-gotten bounty. (Facebook) The modern-day Bonnie and Clyde allegedly had several other cops lending a hand in their vice empire. Their buddies in blue would give them the heads up when police were planning undercover stings and raids. The seven cops arrested and alleged to be corrupt: Sergeants Cliff Nieves, 37, Steven Nieves, 32, Giancarlo Raspanti, Sergeant <mark>Carlos Cruz</mark>, 41, Rene Samaniego, 43, Giovanny Rojas Acosta, 40, and Sergeant Louis Failla. Bound body found in suitcase identified as New York woman The allegedly crooked cops traded tips for cash and sex, prosecutors said. Former vice squad detective Paz was savvy on how to avoid the cops from his previous work on the force. He forced new johns to get naked in front of hookers when first entering to prove they weren't undercover cops. Officers are forbidden from exposing their genitals in front of prostitutes when on duty. \"I want to commend the NYPD's Internal Affairs Bureau and members of this office's Organized Crime and Rackets and Integrity Bureaus for their hard work and dedication in closing down the defendant's illegal businesses,\" Queens District Attorney <mark>John Ryan</mark> told the New York Post. Arelis Peralta and Ludwig Paz in happier times. (Facebook) Prosecutors say the brothels and illicit casinos were run for around 13 months. Patrons of the brothels were charged $40 for fifteen minutes of sex or $160 for an hour. Paz faces 12 years in prison when he's sentenced at the end of June. His wife was immediately given 364 days in jail after admitting to being her husband's Duchess of Windsor to his Duke."}, {"articleID": "2015041110_00004555_W", "names": {"David Cox": ["Q21466826", "Q23415279", "Q464935", "Q47120686", "Q50164997", "Q5232622", "Q5232623", "Q5232626", "Q5232627"]}, "date": "2015-04-11", "url": "http://www.romfordrecorder.co.uk/teenager_given_community_order_for_failing_to_stop_after_harold_hill_collision_1_4031042", "content": "Michael Crumlish was given a community order at Barkingside Magistrates' Court for failing to stop at an accident and failing to report it Email this article to a friend To send a link to this page you must be logged in. Michael Crumlish, 18, of Lodge Lane, Collier Row, was sentenced at Barkingside Magistrates' Court yesterday after pleading guilty to the offence. He also admitted failing to report the accident and driving on a road/in a public place without due care and attention. Crumlish was driving a red Fiat in Gooshays Drive, Harold Hill, on October 10 last year when he smashed into a parked Renault Clio. Prosecutor Nijole O'Brien said: \"The defendant's vehicle overturned, landing on its roof on the wrong side of the road .\" Some witnesses saw him get out of the car, he appeared to have a head injury. \"Forensic analysis found saliva on the airbag, which was found to be the defendant's .\" A probation report heard at the court, in High Street, noted Crumlish was \"frightened\" following the incident. He \"simply panicked\" and left the scene. The report said: \"He is 18 years old, still very young and quite immature, and hadn't been driving very long .\" It could have been his inexperience that caused the accident. \"Prior to being given his punishment, Crumlish spoke to the court and said he regretted his actions .\" I'm just sorry for what I did, \"he said,\" It was wrong. I should have stayed in my car. \"Bench chairman <mark>David Cox</mark> said:\" For the failing to stop and failing to report you are going to receive a community order, because we believe it is serious enough to warrant it. \"Crumlish, who had three points on his driving licence already, was given no separate punishment for the careless driving offence, but his community order will run for 12 months - until April 9 next year. He was ordered to pay £ 85 in costs and an additional £ 60 as he received the order. He must pay this within 28 days. Teenager given community order for failing to stop after Harold Hill collision Police appeal after witnesses report man left injured woman after Rainham Road collision Romford man found dead in car at Tesco had been there a month, inquest hears"}, {"articleID": "2019070108_00149872_W", "names": {"Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"], "Manfred Weber": ["Q1427998", "Q88866"]}, "date": "2019-07-01", "url": "http://kidderminstershuttle.co.uk/news/national/17740075.eu-leaders-pull-all-nighter-at-summit-on-key-posts/", "content": "EU leaders pull all-nighter at summit on key posts By Press Association 2019 Journalists rest during a late-night negotiating session at an EU summit in Brussels 0 comment European Union leaders have pulled an all-nighter at a summit but failed to agree on the list of candidates for the bloc's key posts, with the marathon talks entering a second day. The leaders trickled in for bilateral contacts throughout Sunday before officially convening at around 8pm. They have been locked in talks ever since amid deep divisions over how best to balance political, geographic and gender considerations among the 28 member nations. With the selection process bogged down for the second EU summit meeting in a row, the leaders are still considering Dutch socialist Frans Timmermans to replace Christian Democrat Jean-Claude Juncker as president of the EU's powerful executive arm, the European Commission. European Commission president Jean-Claude Juncker sits prior to a round table meeting at the EU summit in Brussels (Geoffroy Van Der Hasselt, Pool Photo via AP) \"Let's see,\" Italian Prime Minister <mark>Giuseppe Conte</mark> said of Mr Timmermans's chances when briefly descending from the meeting room at EU headquarters at around breakfast time. The Timmermans option has deeply divided the European People's Party (EPP) as it would surrender the key post to the rival Socialists and Democrats (S & D) bloc despite the EPP remaining the biggest group in the EU following last month's election. Bulgarian Prime Minister Boyko Borissov, an EPP stalwart, posted a video on his Facebook account of a discussion with Mr Timmermans in which Mr Borissov said the Dutchman should get the commission job while the less coveted parliament presidency should go to EPP candidate <mark>Manfred Weber</mark>. But Irish Prime Minister Leo Varadkar insisted that the \"vast majority of the EPP prime ministers don't believe we should give up the presidency of the commission quite so easily, without a fight\". A journalist rests during the late-night negotiating session in Brussels (Virginia Mayo/AP) After negotiations started early on Sunday, summit host and EU Council president Donald Tusk had more than 30 bilateral meetings in his attempt to find a breakthrough. The appointments must take into account political affiliation, geography--balancing east and west, north and south--population size and gender. The leaders of EU institutions are supposed to impartially represent the interests of all member nations globally and in Brussels. Some leaders discussed the roster of upcoming vacancies, which also include the EU's top diplomat, the president of the European Parliament and the chief of the European Central Bank (ECB), on the sidelines of the Group of 20 summit in Japan that concluded on Saturday. Mr Tusk wants nominations to be wrapped up soon, seeking to prevent further erosion of public confidence in the EU amid Brexit uncertainty and intra-bloc divisions over managing migration. European Council president Donald Tusk, left, with Renew Europe party member Guy Verhofstadt (Virginia Mayo/AP) There was hope at the previous summit on June 20-21 that more time would clarify who should replace Mr Juncker. German Chancellor Angela Merkel backs Mr <mark>Weber</mark>, the German conservative whose centre-right EPP is the largest political group in the European Parliament but lost seats in the EU elections in May. French President Emmanuel Macron has suggested Mr <mark>Weber</mark> lacks the political and government experience for such a high-profile role. Mr <mark>Weber</mark> could still be considered for the head of the European Parliament, which is the EU's only elected institution. Mrs Merkel said there was still a good possibility for Mr <mark>Weber</mark> and Mr Timmermans, the top centre-left candidate from the S & D group, to be among the winners of the top positions. German Chancellor Angela Merkel arrives for the EU summit (Olivier Matthys/AP) Other leaders from the same political family disagreed. The EPP and the S & D are the two biggest political groups in the EU, but both lost seats in May's polls, where far-right and populist parties, pro-business liberals and the Greens made gains. EU leaders want to fill the positions soon because the European Parliament is set to pick a new president next Wednesday. Under EU rules, member countries choose who will run the commission, replacing Mr Juncker. The parliament must endorse that choice. But the assembly has insisted that only the lead candidates from parties that ran in last month's elections should be eligible for the post. \"The lead candidates is not the only criteria,\" said Mr <mark>Conte</mark>. The commission proposes and enforces EU laws on policies ranging from the massive single market to agriculture spending, and from competition issues to immigration. European Commission president Jean-Claude Juncker (Francois Lenoir/AP) The job responsibilities are huge: Mr Tusk and Mr Juncker negotiate with the likes of US President Donald Trump and Chinese leader Xi Jinping, while the head of the ECB can set monetary policy for the 19 nations that use the shared euro currency. The outgoing group of EU officials was lopsidedly Italian, with Antonio Tajani holding the parliament top post, Mario Draghi head of the ECB and Federica Mogherini the EU foreign policy chief. Top candidates include current prime ministers Stefan Lofven of Sweden and Andrej Plenkovic of Croatia. Others mentioned include Brexit negotiator Michel Barnier of France, Greens leader Ska Keller of Germany, Lithuanian President Dalia Grybauskaite and Margrethe Vestager, the EU's competition chief since 2014. 0 comment"}]