[{"date": "2014-11-09", "url": "http://wkrg.com/story/27330142/column-king-james-knows-cavs-a-work-in-progress", "content": "(AP Photo/Rick Bowmer). A Utah Jazz fan celebrates as Cleveland Cavaliers' LeBron James (23) waits during the second half of an NBA basketball game Wednesday, Nov. 5, 2014, in Salt Lake City. (AP Photo/Rick Bowmer). Cleveland Cavaliers' LeBron James (23) looks at the scoreboard in the second quarter during an NBA basketball game against the Utah Jazz, Wednesday, Nov. 5, 2014, in Salt Lake City. (AP Photo/Don Ryan). Cleveland Cavaliers forward LeBron James watches from the bench during the second half of the Cavaliers' NBA basketball game against the Portland Trail Blazers in Portland, Ore., Tuesday, Nov. 4, 2014. (AP Photo/Don Ryan). Cleveland Cavaliers guard Kyrie Irving, left, drives past Portland Trail Blazers center Robin Lopez during the first half of an NBA basketball game in Portland, Ore., Tuesday, Nov. 4, 2014. By PAUL NEWBERRY AP National Writer LeBron James is right. Everyone needs to RELAX. The Cleveland Cavaliers are going to be just fine. But it's going to take time. <mark>James</mark> and his latest version of the Big Three are still a work in progress, which was evident as they lost three of their first four games. Not surprisingly for a team that's already been anointed as the next NBA champion, the slow start sparked an immediate stream of conjecture over just what's wrong with the Cavs. The diagnosis ranged from <mark>James</mark> playing too passively as he adjusts to a new set of teammates (guilty as charged) to the <mark>King</mark> not getting along with point guard Kyrie Irving (a run-of-the-mill disagreement has surely been blown waaaaay out of proportion). <mark>James</mark> took to Twitter, hitting the all-caps button for emphasis. He, better than anyone, knows it's far too early to hit the panic button. Let's not forget: When <mark>James</mark> and <mark>Chris Bosh</mark> signed with Miami in 2010, joining Dwyane Wade to turn the Heat into a supposedly unbeatable juggernaut, that version of the Big Three lost eight of its first 17 games together. <mark>James</mark>, Irving and <mark>Kevin Love</mark> will likely take even longer to mesh. \"It's a message for everyone to understand how important the process is,\" <mark>James</mark> said, when asked about his tweet during Friday's shootaround in Denver. \"Everyone wants overnight success. It just doesn't happen when teams first come together .\" The most pressing issue for the Cavs was tightening up when they don't have the ball. Heading into Friday night's game at Denver, they had surrendered 101.5 points a game (23rd overall), not exactly the sort of defense expected from a championship-level team. Only two teams were allowing opponents to make a higher share of their shots than Cleveland, which was giving up a whopping 49.5 field-goal percentage. The Knicks made nearly 54 percent in their opening-night win at Cleveland; they were shooting less than 42 percent against everyone else. Utah knocked down more than half its shots (39 of 77) while beating the Cavaliers on Wednesday night, the first time the Jazz had eclipsed 50 percent in a game this season. The Portland Trailblazers shot significantly better while beating LeBron & Co. (49.3 percent) than they had against their other opponents (a cumulative 44.2 percent). <mark>James</mark> has long been one of the league's top defenders, but he must get some help from <mark>Love</mark> and Irving. If not, the Cavs are unlikely to get out of the Eastern Conference, much less win long-suffering Cleveland's first championship - in any sport - since the 1960s. Not to get too far ahead of ourselves, but the Cavaliers may have to go through a postseason disappointment or two before they finally win it all. That's usually the way it's done. Detroit had to get over a pair of excruciating defeats to Larry Bird and the Boston Celtics before the Bad Boys finally broke through to win the first of two straight titles in 1989. During both of those title runs, the Pistons knocked off <mark>Michael Jordan</mark> and the Chicago Bulls in the Eastern Conference finals. MJ, of course, used the motivation from those defeats to win a half-dozen championships. Even the Heat lost in their first trip to the finals with a Big Three, beaten by the Dallas Mavericks in 2011. <mark>James</mark>, Wade and <mark>Bosh</mark> closed out their four years together with a crushing loss to San Antonio in last season's championship round. Now, <mark>James</mark> is teamed with <mark>Love</mark> and Irving, who are undoubtedly two of the league's best players but don't have the same life experiences - not yet anyway - as the last Big Three. Wade already had a championship on his resume before he played a minute with <mark>King James</mark>. <mark>Bosh</mark> had appeared in a couple of playoff series for Toronto before he signed with the Heat. <mark>Love</mark> and Irving have never been to the playoffs. Never even played for a winning team. Irving spent his first three years as the top player on Cleveland squads that were a combined 74 games under .500. <mark>Love</mark> endured even more frustration during six seasons in Minnesota, essentially a one-man team as the Timberwolves struggled through 160 more losses than wins. Both are used to putting up gaudy numbers, with little feedback or criticism for the flaws in their games. Now they're playing with <mark>King James</mark>, who is the undisputed star. <mark>Love</mark> and Irving are the supporting players, and how quickly they adapt to less-glamorous duties - playing tough defense, pounding the boards, doling out assists - will go a long way toward determining how long it takes the Cavaliers to win a championship. Consider Wade and <mark>Bosh</mark>, whose strong play in the early going this season shows just how much of an ancillary role they played while LeBron was around. Irving, for instance, can't go through a stretch where he's taken 36 shots since his last assist (as was the case before Friday's game against the Nuggets). \"This team can be as good as it wants to be,\" <mark>James</mark> said. \"But we can't short-cut the process along the way .\" Maybe he should've added another word to his \"RELAX\" tweet. Patience. ___ Paul Newberry is a national writer for The Associated Press. Write to him at pnewberry @ ap.org or www.twitter.com/pnewberry1963 555 Broadcast Dr, Mobile AL 36606 Telephone:", "articleID": "2014110900_00000363_W", "names": {"Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}}, {"date": "2014-11-09", "url": "http://www.yakimaherald.com/news/latestnews/2627035-8/top-25-signs-you-might-be-a-band", "content": "As the marching band season draws to a close, band geeks everywhere are putting away their lyres, taking off their face paint and quietly reverting to the wintertime discipline of the concert band. The days of stressing over field maneuvers have come to a close, and the public starts to forget that their beloved band exists. That is, until basketball season, when it's summoned to try to make everyone excited about their great (or losing) team...again. The life of an always-on-call, always-spirited, I-believe-that-we-will-win pep band is one of multiple personality characteristics. As a concert band member, students will sit and tune, play the dynamics, pretend to listen to the director and focus on the balance of the band like a good musician is supposed to do. Shy band members avoid attention, and attention avoids them. Meanwhile, the school newspaper reporters groan when they have to go take photographs at the concerts. Then the big game rolls around, and all of a sudden the band is all-out screaming and singing and cheering and playing as loud as it can without a care for intonation. Nobody listens to anybody else, least of all the director. And meanwhile, mysteriously so, the newspaper gets every picture of the pep band in its stadium habitat. As one of these band geeks, I'll miss marching season like everybody else. However, I also know how necessary the concert band is to all of our lives. So now, as band fades for a few weeks from the memory of the general public, the rules by which every band geek lives, during both concert and pep band seasons, deserve some attention. In other words, you know you're a band geek when...1. You don't step on a scale every morning. You play one. 2. You walk by someone playing music in their car and you start marching in step. 3. Despite the claim by author <mark>Douglas Adams</mark> in \"The Hitchhiker's Guide to the Galaxy,\" the ultimate answer to Life, the Universe, and Everything is no longer 42. It's unison octaves. 4. When listening to pop music, you feel isolated by the lack of wind instrumentation. 5. You're watching a movie, and there's machine-gun fire. Your reaction: \"Who invited the snare drum?\" 6. You start comparing varsity track to wind ensemble. 7. You're prejudiced against the string players in the orchestra because they perform like dead people. That is, they don't have to breathe. 8. You dream of Disneyland...the music studio, not the theme park. 9. Someone's singing their favorite song and you wince because they're 20 cents flat in the wrong key. 10. When you're bored, you compose songs in your head and hum them aloud, to the harmony of your friends' complaints. 11. You know what a bass clarinet looks like. (Rare) 12. You know what a bass clarinet sounds like. (Rarer) 13. Same thing about the contrabass flute, soprano sax, English horn, sousaphone and bassoon. 14. The movie \"Drumline\" touched you more deeply than any other sports comeback story. 15. You know how to fix a broken music stand. But you have also perfected the art of avoiding the task. 16. You hum in tune with your refrigerator. 17. You know who Mendelssohn was. And how to spell \"Mendelssohn .\" 18. For you, time is only relative to the metronome. 19. People ask if you're bilingual; because you are in band you respond that you speak Italian. 20. You know the names of at least five music professors at the closest college. 21. In social studies class, you sit on the front six inches of your chair. Because you know it's best for your diaphragm. 22. The majority of your wardrobe is sweatshirts and pep shirts sporting your school's colors. 23. You use phrases like \"variations on the same theme\" in common conversation and don't even notice. 24. In addition to the inner and outer personas, you have a \"band persona .\" 25. Upon reflection...all your friends are band geeks like you.", "articleID": "2014110910_00027683_W", "names": {"Douglas Adams": ["Q28421831", "Q932869"]}}, {"date": "2014-11-10", "url": "http://www.standard.co.uk/business/business-news/quindell-digs-deeper-hole-on-confusing-directors-dealings-9851100.html", "content": "CCTV shows gang of youths bombard police car with fireworks in spectacular Bow attack Gallery: Dramatic CCTV shows the moment a mob of youths launched a volley of fireworks at a passing police car. The video which emerged online today shows a gang of around 15 youths brandishing rockets in the street before lighting them and levelling them at the police vehicle on patrol. A & E waiting times at west London hospitals hit a record after closures Patients in west London have the longest wait for A & E treatment in the country following the closure of two casualty units. First look at the new glass walkway installed 42 metres above Tower Bridge Quindell digs deeper hole on \"confusing' directors' dealings Embattled insurance outsourcer Quindell's attempt to explain opaque share-dealing by three directors backfired today as the shares plunged by as much as 25%. Chief executive Rob Terry, finance director Laurence Moorse and non-executive <mark>Steve Scott</mark> have taken loans secured on their own shares to fund the purchase of £ 2.2 million more in Quindell shares, which they believe are\" materially below \"their true worth. But today's detailed clarification to a complex deal first unveiled last week sent the stock into another tailspin amid City worries over\" jiggery-pokery \", as it emerged loan company Equities First Holdings was only prepared to lend on the shares at a price well below their closing value on Friday. Terry transferred 8.85 million shares over to EFH and received £ 7.47 million in return - an average price of just 84.5 p. EFH is under no obligation to hang onto the shares although it will not vote them, and it has pledged not to use them for short-selling purposes. Market Report: Quindell leaps on black-box deal with Canadian insurer Market report: Quindell mystified by driving force behind price plunge But the big haircut taken by EFH on the shares - far below Friday's closing price of 118.5 p - spooked the City, sending Quindell as low as 88.75 p at one stage, before recovering. Mike van Dulken at Accendo Markets said the update\" served only to generate more investor discontent with such jiggery-pokery \".\" Quindell is not doing anything to make life easier for itself, releasing what can only be surmised as a highly confusing update, \"he added. If the price falls more than 20% below the value at which they were transferred to EFH - around 68p - the directors will have to put up more stock or cash as collateral. Quindell successfully sued research firm Gotham City, which called the firm\" a country club built on sand \", but shares have fallen 8% since April. <mark>Robert Plant</mark> turns down £ 500million offer from Richard Branson to reform Led Zeppelin The\" wow project': first look at the new glass floor installed at Tower Bridge UCL students paying as much as £ 225 a week hit out at \"appalling' condition of their halls Hackney pair guilty of string of sexual offences against vulnerable teenage girls after grooming them online The moment gang shoots volley of fireworks at passing police car in east London Million Mask March protesters attack woman in London\" for having wrong accent' <mark>George Osborne</mark> accused over claim Britain has \"halved' £ 1.7 bn EU bill Met Commissioner Bernard Hogan-Howe in warning over internet safe-haven for terrorists and paedophiles Riot police on alert for bonfire night\" Million Mask March' by activists Anonymous Boy, 18, stabbed to death in one of four murders in London in just over 24 hours Russell Brand's revolution rants mocked online by #Parklife campaign Help catch thugs wearing pink tutus who beat my son to a pulp for being gay Sign-up for our weekly Reader Offers email CCTV shows gang of youths bombard police car with fireworks Nicki Minaj brings the wow factor to the 2014 MTV EMAs Why it's time the UK had its own NFL franchise First look at the new glass floor installed in Tower Bridge Blast off with Matthew McConaughey and <mark>Christopher Nolan</mark> Grace Dent on living with a Labrador in London", "articleID": "2014111012_00026726_W", "names": {"Christopher Nolan": ["Q224912", "Q25191"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Robert Plant": ["Q28036733", "Q428223", "Q58449717"], "Steve Scott": ["Q1394213", "Q16239327", "Q3499100", "Q55996252", "Q56485491", "Q7613875", "Q7613876", "Q7613877"]}}, {"date": "2014-11-10", "url": "http://www.ocregister.com/articles/new-641474-kroq-album.html", "content": "News Many school buses still don't have seat belts Business Alternative mortgages making a comeback News Review finds parole agents swamped with sex offender caseloads News Whatever happened to driver's ed in high schools? U2, Linkin Park top Almost Acoustic Christmas lineup Wrong-way driver on freeway off-ramp arrested on suspicion of DUI Musicians The Edge, Bono, Larry Mullen Jr., and <mark>Adam Clayton</mark> of U2 perform onstage during the Oscars at the Dolby Theatre on March 2. 25th annual KROQ Almost Acoustic Christmas When: Dec. 13-14 Where: The Forum, 3900 W. Manchester Blvd., Inglewood Ticketmaster.com. It's that time again, boys and girls. Southern California's premiere rock station, KROQ/106 .7 FM, has revealed the lineup for its coveted annual two-day holiday fest, set for Dec. 13 and 14 and held for the first time at the newly revamped Forum in Inglewood. Since it is the 25th anniversary of Almost Acoustic Christmas, the station has mixed things up with old reliables, throwback performances and new favorites. KROQ mainstays Linkin Park, which released its sixth studio album, \"The Hunting Party,\" this year, will undoubtedly top the bill Saturday along with Rise Against, which also issued a new record, \"The Black Market,\" in July, Incubus, Fall Out Boy, System of a Down, Walk the Moon, Royal Blood and KROQ fest darlings, New Politics. U2, one of the biggest rock bands in the world, which shoved its new album, \"Songs of Innocence,\" down the throats of iTunes users this year, will top the bill Sunday along with Weezer, Imagine Dragons, Interpol, Modest Mouse, Smashing Pumpkins, Vance Joy, Alt J and Tears for Fears. Yes, Tears for Fears. That shouldn't be too shocking of a revelation, however, since Tears for Fears bassist-vocalist <mark>Curt Smith</mark> came out to sing \"Everybody Wants to Rule the World\" with Portugal. The Man at AAC last year at the Shrine Auditorium. Though Foo Fighters, with their new album, \"Sonic Highways,\" out this week, would have seemed an obvious headliner for one of the two dates, Dave Grohl & Co. will be in South Africa, making even a surprise appearance not feasible, so let's hold out for that at Weenie Roast 2015. Tickets go on sale at noon Friday for KROQ street team members at Join the conversation Comments are encouraged, but you must follow our", "articleID": "2014111016_00036156_W", "names": {"Adam Clayton": ["Q175907", "Q2700669"], "Curt Smith": ["Q1916105", "Q5195431", "Q5195432", "Q924035"]}}, {"date": "2014-11-10", "url": "http://jordantimes.com/delicate-issue-under-scrutiny", "content": "Gov' t announces privileges for children of Jordanian women married to foreigners Amman Chamber of Commerce reveals lower exports during ten months Industry chief urges smooth operations at Aqaba Container Terminal Russians, concerned for their savings, buy dollars and hoard cash on ruble fears Drug-resistant superbug found in 1915 soldier killed by dysentery Apple iOS bug makes most devices vulnerable to attack - researchers Gov' t announces privileges for children of Jordanian women married to foreigners Italy to work with Jordan against terrorism, extremist ideologies - diplomat Higher Education Ministry mulls increasing Tawjihi score required for studying medicine abroad Film translated into sign language at 26th European Film Festival T he minister of interior has just announced that a committee formed by the Cabinet will scrutinise the moratorium on death penalty, which has frozen execution of death penalties since 2006, when the last execution was carried out. While death penalty is considered by its proponents a deterrent from crime, opponents point to flaws in the justice system - especially since the rise of the more sophisticated DNA tests that led to some exonerations. A report released on April 18, 2012, by the prestigious National Research Council of the National Academies, based on a review of more than three decades of research, concluded that studies claiming a deterrent effect on murder rates from the death penalty are fundamentally flawed. Said the report: \"The committee concludes that research to date on the effect of capital punishment on homicide is not informative about whether capital punishment decreases, increases, or has no effect on homicide rates...Consequently, claims that research demonstrates that capital punishment decreases or increases the homicide rate by a specified amount or has no effect on the homicide rate should not influence policy judgements about capital punishment .\" Not much help here in helping one make one's mind up. Whatever the case, some ugly crimes have been committed in Jordan recently, so the government is probably acting under pressure from the public now. While people want to see the phenomenon stemmed, officials need to tread a thin line between allaying citizens' fears, or anger, and upholding the country's stand and recognition worldwide as wanting to be among the increasing number of nations that abolish death penalty. Such move would be in deference to the Kingdom's obligations under existing international norms. It could also be taken in view of the fact that death penalty does not seem to actually contribute to lowering crime rates. Instead of executing people, the country has to deal with the causes of crime and try to address them. Poverty, ignorance and a justice system that by the minister's admission has loopholes can be often blamed for crimes, of all kinds. Education, awareness, reinforcing the value system of yore, good neighbourliness and good living conditions often keep crime at bay. His Majesty <mark>King Abdullah</mark> told an Italian newspaper in 2005 that, \"in coordination with the European Union, we would like to modify our Penal Code. Jordan could soon become the first country in the Middle East without capital punishment .\" This is a serious commitment that the government should take into consideration upon reviewing legislation, death penalty foremost. Syria rebels, Al Qaeda capture key southern town - monitor Syrian rebels and Al Qaeda seized the southern town of Nawa Sunday from troops loyal to President Bashar Al Assad after months of intense fighting, the Syrian Observatory for Human Rights said. Gov' t announces privileges for children of Jordanian women married to foreigners Scrapping peace deal with Israel \"impossible under circumstances' - Ensour", "articleID": "2014111020_00064482_W", "names": {"King Abdullah": ["Q57298", "Q57464"]}}, {"date": "2014-11-11", "url": "http://highschoolsports.nola.com/news/article/-9009810423852085887/chapelle-hands-on-for-dramatic-five-set-win-at-northshore/", "content": "If there was any doubt about the resolve of Chapelle and its ability to advance in the postseason, the Chipmunks erased them on multiple occasions, emerging with a five-set victory at Northshore. The Chipmunks were tested early, and were on the brink of elimination as the Panthers won the first two games, but that's when they rose to the occasion for a 23-25, 20-25, 25-21, 25-13, 15-13 win. There was no case of déjà vu even though it marked the second time in the past nine days the teams on the same court, resulting in a 3-1 Chapelle victory. \"We all wanted to pick up the intensity and win this game,\" Chapelle's Kayla Jones said. \"Now, we're going to get back to the gym and work hard, focusing on what we need to do to play the next game .\" Chapelle (27-17) will have their hands full in the Division I state tournament at the Pontchartrain Center as the take on Division I top seed St. Joseph's Academy, which advanced with a 25-4, 25-13, 25-7 win over 17 th seeded Zachary. After the Chipmunks fought back to tie the match at two games each, Northshore (26-13) appeared to have rediscovered the zeal to regain control, moving out to a 9-6 lead. However, no lead was safe with either squad, as Chappelle whittled away at the deficit, tying the match at 13-13. Sensing the moment, the Chipmunks captured the next two points, punching their ticket to the state tournament. Although there was very little distance between the two teams, Northshore was able to stay one step ahead and pull away from a 23-23 tie and close out the first game, taking the next two points. \"I'm so proud of our team and the way they fought in this match,\" Northshore coach <mark>Danny Davis</mark> said. \"The girls that were on the court left everything out there. They played with so much heart and intensity .\" In game two, the Panthers were trailing 15-12 but found their way back to tie it up at 20-20 with visions of a win and a 2-0 lead in games. The momentum Jones spoke about was evident as the team stayed within striking distance in game three and the Chipmunks were able stave off elimination for a 25-21 win. Chapelle takes on No. 1 seed St. Joseph's at the state tournament. (Pat Mashburn, NOLA.com | The Times-Picayune00 \"After that second game, we just came out with an all-or-nothing attitude,\" Chapelle coach Shannon Spafford said. \"We had nothing to lose at that point, and just left everything out on the floor. That's when we started fighting and brought the power back on our side .\" And, it didn't take long for Chapelle to assert itself in the fourth game, running out to an 11-3 lead before winning 25-13. Jones led Chapelle with 21 kills while Kaylee Madron paced the defense with 47 digs and Mallory Knudsen directed the offense with 45 assists. In her final home match of her career, Northshore's Haley Kirkpatrick had 28 kills and 28 digs while freshman Jenna Schmidt recorded 45 assists. Sabrina Buelle was the defensive leader with 33 digs.", "articleID": "2014111105_00028183_W", "names": {"Danny Davis": ["Q5220272", "Q5220273"]}}]