[{"articleID": "2012101108_00077909_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2012-10-11", "url": "http://thehindubusinessline.com/industry-and-economy/government-and-policy/article3987588.ece", "content": "soon, sending a pornographic multimedia message and emails may land you in jail for a maximum period of three years. the union cabinet, at a meeting chaired by prime minister <mark>manmohan singh</mark>, approved amendments to the indecent representation of women (prohibition) act (irwa), 1986, which also proposes to slap hefty fines on persons found guilty of such acts. \"the amendments broaden the scope of the law to cover the audio-visual media and material in electronic form,\" an official statement said here. the amendments were necessitated as the current act covers only the print media. the changes also enhance the amount of fine to be slapped against persons found guilty of such acts from rs 2,000 to a minimum of rs 50,000 going up to rs 1 lakh for the first conviction. in case of repeat of the offence, the imprisonment may extend to seven years and a fine between rs 1 lakh and rs 5 lakh for second conviction. police officers not below the rank of inspectors are authorised to carry out search and seizure, in addition to state and central government officers authorised by the state or central government, it said. these amendments seek to ensure that more effective protection is provided against indecent representation of women by covering newer forms of communication like internet, multimedia messaging, beyond the print and audio-visual media, it said. porn row: former karnataka ministers reply to show-cause notice 1. comments will be moderated 2. comments that are abusive, personal, incendiary or irrelevant cannot be published. 3. please write complete sentences. do not type comments in all capital letters, or in all lower case letters, or using abbreviated text. (example: u cannot substitute for you, d is not \"the', n is not\" and'). grasim industries contribution to further investments in terrace bay put at $44 m with delhi set to expand cng fleet, indraprastha gas well placed to meet demand able-ag welcomes pm's scientific advisory council stand on biotech tribunal asks competition commission to give full details in cement cartel order india, australia likely to finalise uranium safeguards pact next week karnataka bank aims to double biz; engages kpmg for re-engineering pune blasts: 3 suspected indian mujahideen terrorists held in delhi goa government begins surveying mining leases for encroachments minority govts 17 hr. 24 min. ago"}, {"articleID": "2014022304_00061853_W", "names": {"Jeremy Scott": ["Q14484510", "Q781789"], "Charlie Miller": ["Q1066958", "Q5085245"]}, "date": "2014-02-22", "url": "http://www.graziadaily.co.uk/fashion/news/milan-fashion-week-diary-3", "content": "Grazia's Katherine talks through the street style trends in Milano Next stop: the 2014 International Woolmark Prize. Let the contest begin! Alexa Chung wears a Valentino cape dress to take her seat on the judging panel Some wonderful wool creations hit the catwalk for the Woolmark Prize The judges, including Frida Giannini and Franca Sozzani, reveal the winner of the Woolmark Prize Digital Editor Jessica Vince chats to Alexa Chung about channelling Cheryl Cole on the Woolmark Prize judging panel And the winner is...Rahul Mishra! Name to know: Mauro Grifoni. Definitely for the Grazia girl We loved the Western influence at Gianvito Rossi The divine Paula Cademartori showcases her new Piaggi bag More luxe bags from Paula Cademartori Adoring these pretty floral pouches from Furla A parka and a polar bear at Woolrich People. Perfect. Snuggly parkas all in a row from Woolrich People Anna Dello Russo causes a paparazzi scrum outside the Armani show. And yes, that's the <mark>Jeremy Scott</mark> for Moschino outfit she's wearing ADR takes a selfie outside the Emporio Armani show - whilst sitting on a Vespa This little lady is causing paparazzi carnage outside the Emporio Armani show. Maybe they think it's JLo (it's not) Look who's backstage at Emporio Armani: it's only Calvin Harris! The DJ says he's here for his girlfriend. Yep, that's Rita Ora MTV's Laura Whitmore FROW'd at her first Emporio Armani show today. \"It was so exciting!' she told us We meet Chiara Ferragni kitted out in Burberry at the Emporio Armani show.\" Wear something comfortable' is her FROW tip We loved the mushroom-style hats at the Emporio Armani show Aw! Mummy and baby fluffy bags from Moncler Brian Atwood fringe-tastic creations are not for shrinking violets Georgia May Jagger in a buttoned white mini at Versace The day begins with me organising tickets for today's shows Look who we've bumped into: ADR herself! A sweet gift of roses from shoe genius Gianvito Rossi inviting me to his presentation tomorrow Can we have this Gucci biker too please? It was all about the gold biker with fringing at Just Cavalli. Bowie-fabulous! Check out the murals at Fendi's show space It's the street style queen! Anna Dello Russo arrives at Prada in her brilliant coat Alexa Chung makes a super-chic enterance at Prada A scarlet shaggy dress hits the catwalk at Prada A trio of Prada coats for the grand finale Model Hanne Gaby brings her metallic magic to MFW Now this IS exciting: <mark>Jeremy Scott</mark>'s first catwalk show for Moschino - and chocolate! A <mark>Jeremy Scott</mark> x Moschino phone case for everyone at the show. Hurrah! We had a gorgeous dinner with our friends from Matches to celebrate Paula Cademartori and her amazing bags It was an early start at Heathrow this morning, I am SO not a light packer Anna Dello Russo, chocolates and chic shoes at Gucci - MFW has begun! What a welcome! Gucci opens Milan Fashion Week How gorgeous is this short, sweet and crystallised frock at Gucci? Gucci reminds us it's all about the pastel outwear Champers o'clock! Now we're fashion week ready. Hello Joan Smalls! We want your beanie I'm loving the embellished coats and socks with sandals at Alberta Ferretti Dresses were tinged with gold at Alberta Ferretti We're obsessed with these monochrome majors in Raoul's Autumn Winter 2014 collection There's nothing quite like a goodbye gift from Raoul Well this makes up for missing lunch #roomserviceheaven On the third day of our Milan Fashion Week experience, we found some new designers to love, took in the Emporio Armani show and hung out with Alexa Chung. Here are our highlights...1. FROW & TELL at the Emporio Armani show The Emporio Armani show is always a larger-than-life affair. Forget being on the second row, there are TEN rows of seats here, each one individually numbered like a super-chic cinema with a gigantic catwalk running down the middle. When we arrived at the venue, we spotted the likes of Laura Whitmore and even Calvin Harris (sans Rita, boo) hanging out backstage waiting for the man himself. We grabbed a chat with Laura about her first time at Milan Fashion Week...\"The collection was unbelievable and just so elegant and graceful,' she told us after the show.\" You know when you go to fashion shows and a lot of the things you may not wear yourself? Well, this time I was like, \"I want that, I want that!\" . Armani is all about the female figure and the dress I'm wearing today makes me feel good so that's what fashion should be about .' We also met Chiara Ferragni of The Blonde Salad who looked resplendent in a Burberry ensemble. As a top-notch fashion blogger, we wanted to know her tip for our fashion week wardrobes. \"Try to wear something that is comfortable and although this isn't the most comfortable outfit, it makes me feel self confident .' 2. What We're Wearing The sun came out today here in Milan (hurrah!) so it was time to pack away our oversized coats and tights for something a little lighter. Here's <mark>Charlie Miller</mark>, Grazia's Executive Fashion and Beauty Director, wearing a black Cos sweater with a Victoria Beckham skirt topped off with Philosophy di Alberta Ferretti boots, Chanel aviators and a tasselled Gucci bag. Meanwhile, our Editor In Chief, Jane Bruton, is looking MFW-tastic in a Prada coat over a Jonathan Saunders sweater and MiH jeans. She's finished off the look with a Fendi bag and Sophia Webster shoes. The perfect combo of Brit meets Italiano chic! 3. Meeting the names-to-know As well as the high-profile catwalk shows the Fashion team enjoy, there's many smaller appointments on the agenda too. Today <mark>Charlie</mark> met Paula Cademartori, the lady behind a selection of luxury handbags designed in Milan, who talked us through the bags and clutches in multiple colours and leather combinations. We've also fallen in love with Mauro Grifoni and his super furry stripes and the Darlin' sweater is definitely for the 4. Anna Dello Russo's fash-tastic selfie ADR is always guaranteed to brighten up the streets of fashion week so it was no surprise to see she was the first lady to get her mitts on <mark>Jeremy Scott</mark>'s brilliantly bonkers debut for Moschino. Approximatley 12 hours after it had hit the catwalk, Anna was showcasing the Macdonalds-inspired sweater dress at the Emporio Armani show, complete with matching bag and iPhone case. She even found a vespa to strike a pose on. Well worth a selfie, we're sure you'll agree. Latest Tweet See Rihanna's latest bulk upload of holiday pictures: Please enter this information so that Bauer Media Group (the publisher of Grazia) can keep you up-to-date by email with fantastic offers and promotions. We promise that you can unsubscribe at any time if you don't find them interesting and you'll only get messages about things that we've chosen especially for you from ourselves and our network of great partners whose products and services we think you'll enjoy. women's fashion, beauty and news!"}, {"articleID": "2013113004_00060165_W", "names": {"Big B": ["Q4904960", "Q9570"]}, "date": "2013-11-29", "url": "http://www.indianexpress.com/news/dd-jain-girls-block-traffic-protest-against-rape/1201384/", "content": "During the protest near CMCH Chowk in Ludhiana on Friday. Gurmeet Singh Tehelka case LIVE: The lady is not normal, Tejpal's lawyer argues in court Tarun Tejpal is fighting to protect his wealth, I am fighting to preserve my integrity, says woman journalist They created a moral bubble, now their leader is exposed: Bangaru Laxman Uncertainty the story in Tehelka newsroom, Shoma says damaging time for all Hundreds of girls of Devki Devi Jain College on Friday came out of the college and blocked the main CMCH Chowk in protest against an alleged rape of a class VII girl at Atam Devki Niketan School located on the same campus. The girls shouted slogans of \"we want justice\" and protested against the alleged rape by the conductor of one of the school buses who had been dismissed by the management a few days back. However, the girls were not clear as to who the victim was. Interestingly, the girls came out of the college campus by forcibly opening the doors of the college. A few hundred girls came out while the rest remained inside as the college management soon locked the gates. The girls went to the nearby CMCH Chowk and blocked the traffic. The incident took everyone by surprise as normally such a reaction is not seen in girls' colleges of Ludhiana. The girls alleged that the matter was being suppressed and the victim and her family were not being given justice. The high drama continued for more than three hours outside and within the college campus. ADCP Nilambari Jagdale, who reached the spot along with other officers, said, \"We are investigating the case, but till now neither the victim nor her family has come before us with a formal complaint. We have no idea as who is the sufferer. The girls were protesting on mere rumours and even they were not clear as to who is the actual victim.\" In the morning, the girls met college principal Sarita Behl after they heard about this news. Later, they came out of the campus to protest. Photos: Ranbir, Kareena, Salman other celebs have \"Koffee with Karan' Photos: <mark>Big B</mark>, Rekha at Vishesh Bhatt's wedding IFS officer denies visa to spouse of gay American diplomat, moved out IFS officer denies visa to spouse of gay American diplomat, moved out They created a moral bubble, now their leader is exposed: Bangaru Laxman Firoz Fatma becomes first woman\" crorepati' of \"Kaun Banega Crorepati 7 '"}, {"articleID": "2017092722_00162555_W", "names": {"Mark Hammond": ["Q20730236", "Q55181092", "Q6767898"]}, "date": "2017-09-27", "url": "http://www.mypalmbeachpost.com/news/local-govt--politics/pbc-irma-costs-100-million-damage-million-haul-debris/KgBhPwPjg6vjiYcFSJOhLL/", "content": "politics By Wayne Washington - Palm Beach Post Staff Writer...Community engagement manager Marissa Jacobs examines bamboo in a large pile of debris removed from Mounts Botanical Garden west of West Palm Beach on September 15, 2017. (Bruce R. Bennett / The Palm Beach Post) Posted: 6:08 p.m. Wednesday, September 27, 2017 Palm Beach County's Solid Waste Authority expects to spend about $27 million to clear debris left in the wake of Hurricane Irma, the authority's executive director has told county commissioners. Most of that money should be reimbursed to the county from the Federal Emergency Management Agency and the state of Florida. But Solid Waste Authority Executive Director <mark>Mark Hammond</mark> said the county shouldn't expect to see reimbursement dollars flowing this way any time soon. RELATED: The Post's complete coverage of Hurricane Irma \"Unfortunately, it could be over a year before the Authority receives reimbursement,\" <mark>Hammond</mark> wrote to commissioners in an email to commissioners on Tuesday. \"The authority has yet to receive reimbursement for Hurricane Matthew which impacted us last year around this time.\" The authority, which has about $26 million in collection reserve accounts for unincorporated Palm Beach County, is \"exploring short term borrowing options to cover the costs of Irma in order to retain sufficient reserves for next year's hurricane season,\" <mark>Hammond</mark> told commissioners. The authority expects 87.5 of its debris removal costs--about $23.6 million--to be reimbursable, <mark>Hammond</mark> said. The authority will seek to get 75 of its debris removal costs back from the Federal Emergency Management Agency and another 12.5 percent back from the state of Florida. Meanwhile, with the initial estimate of damage to properties in unincorporated Palm Beach Beach County set at more than $100 million, the County Commission on Tuesday passed a resolution waiving permit and expedited review fees for residents attempting to rebuild after Irma. \"This resolution will authorize the Building Division to expedite reviews and issue permits to begin recovery and repair without charging any fees for these services,\" the county said in a statement announcing the waivers. The fee waivers extend to March 26, 2018. After that date, the county will compile a summary of the fees waived. The county was unable to provide an estimate for how much the fee waivers will cost in lost revenue. \"This is an excellent example of local government done right,\" Commissioner Melissa McKinlay said of the fee waivers. \"This is tremendous.\" The Solid Waste Authority's debris monitoring contractor, Thompson Consulting Services, reports that debris removal is in full swing. Through Tuesday, 520,733 cubic yards of vegetative debris have been removed in Palm Beach County. Some of the largest municipalities in the county are also seeing progress in debris removal: 60,437 cubic yards of vegetative debris has been removed from West Palm Beach, 30,778 cubic yards from Boynton Beach, 12,359 cubic yards from Wellington and 12,119 cubic yards from Royal Palm Beach. Municipalities are expected to pay the Solid Waste Authority an estimated $9 million to have debris from their localities brought to SWA disposal sites, <mark>Hammond</mark> said. Solid Waste Authority officials continue to urge county residents to be patient as crews attempt to clear roads and neighborhoods. Authority Spokesman Willie Puz pointed out that Hurricanes Frances and Jeanne in 2004 \"generated a similar amount of yard waste and took 6 months to remove. Hurricane Wilma in 2005 also generated about 3 million cubic yards of material that took 4 1/2 months to collect. That is why we keep asking PBC residents to be patient during cleanup.\" Puz stressed that the cleanup will be faster and safer if residents put garbage and recyclables out by 6 a.m. on regularly scheduled days. All vegetative debris is to be put in its own pile and other construction storm debris is to be placed in a another pile. Garbage, recyclables and debris should be placed away from fences, mailboxes, power lines, canal banks, water meters, fire hydrants and storm drains, Puz said. About the Author WAYNE WASHINGTON Popular in News 1 2 3"}, {"articleID": "2012040312_00026042_W", "names": {"Ryan Humphrey": ["Q1618767", "Q7384164"], "Justin Taylor": ["Q18402460", "Q25947449", "Q26014104", "Q3190502"]}, "date": "2012-04-03", "url": "http://in.reuters.com/video/2012/04/03/injured-british-yachties-treated-in-cali?videoId=232801728&feedType=VideoRSS&feedName=LatestVideosIN&videoChannel=117460", "content": "injured sailor nik brbora slowly makes his way to a waiting ambulance. he and shipmate jane hitchens were rescued by the u.s. coast guard on sunday during a round-the-world race. the australian yacht was in rough waters hundreds of miles off the coast of california when a towering wave smashed into their boat, injuring four crew members. (soundbite) (english) petty officer first class <mark>ryan humphrey</mark>, saying: \"from when we launched to looking at their face when we were coming along their side, talking to jane when she was on our boat trying to make her as comfortable as possible, the look of gratitude in her face was definitely rewarding.\" hitchens is thought to have broken ribs, while brbora may have a sprained pelvis. the two british sailors were taken to hospital where doctors will decide if they are fit to compete in the last leg of the clipper round the world race that starts in panama later this month. (soundbite) (english) <mark>justin taylor</mark>, assistant race director-clipper round the world round the world yacht race saying: \"the crew learn to anticipate the waves and the sea action on the boat. it's just every once in a while that wave will come out of nowhere and has your name on it and it's going to slam you that's exactly what happened.\" the other crew members are still on the yacht and will use back up steering and communications to dock in san francisco bay for repairs sometime on tuesday. jessica gray, reuters injured british yachties treated in california (1:22) our flagship financial information platform incorporating reuters insider an ultra-low latency infrastructure for electronic trading and data distribution a connected approach to governance, risk and compliance, and interactive television platforms. thomson reuters journalists are subject to an"}, {"articleID": "2016092116_00677409_W", "names": {"John Wesley": ["Q1425302", "Q353305", "Q971854"], "Marcus Johnson": ["Q16730362", "Q3846690", "Q39075998"]}, "date": "2016-09-21", "url": "http://stardem.com/life/article_edf32df8-6453-5231-b70b-4460baf2577a.html", "content": "Close CONTRIBUTED PHOTO Pastor <mark>John Wesley</mark> Moore is pictured with a rare 1962 Wocekiye Wowapi, the Episcopal Church's 1962 Dakota Sioux translation of \"The Book of Common Prayer,\" which is among the recently presented collection Moore gave to The Oaks of Mamre Interfaith Library and Graduate Center. The Oaks receives <mark>John Wesley</mark> Moore Collection of American Plains Spirituality 39 min ago0 CONTRIBUTED PHOTO Pastor <mark>John Wesley</mark> Moore is pictured with a rare 1962 Wocekiye Wowapi, the Episcopal Church's 1962 Dakota Sioux translation of \"The Book of Common Prayer,\" which is among the recently presented collection Moore gave to The Oaks of Mamre Interfaith Library and Graduate Center. EASTON--The Oaks of Mamre Interfaith Theological Library and Graduate Center has received The <mark>John Wesley</mark> Moore Collection of American Plains Indian Spirituality in a recent ceremony in Easton, which was attended by invited guests, several of Native American descent. The Oaks President Bishop Joel <mark>Marcus Johnson</mark> presided. The Rev. Moore, the benefactor, is the recently retired pastor of Talbot County's Riverview Charge of the United Methodist Church. Moore, who is of Oglala Lakota and Irish descent from his father, and Kogui Kiowa and Scottish descent from his mother, is a son of The Pine Ridge Reservation of South Dakota. A lifelong scholar of his Plains Indian heritage, he has collected memorabilia, such as rare translations of the Bible, prayer books and hymnals from native tongues, as well as social and political histories, and native artisanal studies. Among the rarest volumes presented in the ceremony was the 1962 Niobrara Service Book, the translation into Dakota of the Episcopal Church's Book of Common Prayer, titled \"Wocekiye Wowapi,\" literally translated as \"one who cries out for help.\" Other rare volumes include the Dakota Episcopal Hymnal of 1949, and historical works of Walker, Rice and the Deloria family. To signify the inter-cultural nature of Plains Indian Christianity, the ceremony concluded as <mark>Johnson</mark> gave the Hebrew Aaronic blessing from the Book of Numbers, and Moore sang a native Dakota hymn of blessing. \"This large, momentous collection is of great importance, as it serves to encourage members and scholars of other native tribes and nations also to participate in preserving their spiritual traditions and histories. The Oaks welcomes these good people,\" <mark>Johnson</mark> said. The Oaks of Mamre began this year under the tax exempt auspices of the Mid Shore Community Foundation. Its purpose is to promote peace and harmony among the world's great religions through academic seminars and symposia. For more information, email <mark>Johnson</mark> at oaksofmamre @ goeaston.net. Tags"}, {"articleID": "2015103017_00014462_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"], "Dan Harris": ["Q16225310", "Q18977889", "Q2556156", "Q5213645", "Q5213646"], "Robin Roberts": ["Q1185477", "Q2041541"]}, "date": "2015-10-30", "url": "http://www.usmagazine.com/celebrity-news/news/katie-holmes-will-address-leah-remini-scientology-on-2020-20153010", "content": "<mark>Katie Holmes</mark> Will Address Leah Remini, Scientology on 20/20 - Us WeeklyUS Weekly Tweet ABC News revealed that <mark>Katie Holmes</mark> will speak out about ex-Scientologist Leah Remini during the King of Queen star's 20/20 special on Friday, Oct. 30. Credit: Jason Merritt/Getty Images Set those DVRs! ABC News revealed on Friday, Oct. 30, that <mark>Katie Holmes</mark>, former wife of famed Scientologist Tom Cruise, will speak out about ex-Scientologist Leah Remini during the King of Queen star's much-anticipated 20/20 special. PHOTOS: Tom Cruise and <mark>Katie Holmes</mark>' relationship <mark>Holmes</mark>--who divorced Cruise in June 2012 after nearly six years of marriage--has never before spoken about Remini, let alone anything related to Scientology. ABC News' <mark>Dan Harris</mark>, who conducted the interview with Remini, told <mark>Robin Roberts</mark> and the co-hosts of Good Morning America on Friday morning that the Dawson's Creek actress will make an appearance on the special. \"You're also going to hear from <mark>Katie Holmes</mark>, the former wife of Tom Cruise,\" <mark>Harris</mark> teased. \"[And] what she is now saying about Leah.\" PHOTOS: Celeb Scientologists <mark>Holmes</mark> left Cruise in 2012, but issues from their marriage--specifically involving Scientology and their daughter, Suri--surfaced in a 2013 deposition. At the time, the Mission Impossible star was involved in a $50 million lawsuit against Bauer Publishing Company after several of its magazines wrote that Cruise had \"abandoned\" Suri. In his taped deposition, the A-list actor was asked by a Bauer lawyer if one of the reasons why <mark>Holmes</mark> filed for divorce was \"to protect Suri from Scientology.\" \"Did she say that? That was one of the assertions, yes,\" Cruise replied in the deposition. Credit: Alberto E. Rodriguez/Getty Images) As revealed on Friday's GMA segment, Remini also claims in her interview that she was once disciplined and \"written up\" by a Scientology official for an incident involving Cruise and <mark>Holmes</mark>. \"He was like, forcibly kissing <mark>Katie</mark>,\" Remini recalled to <mark>Harris</mark>. \"And I said,\" Hey, get a freaking room .' And uh, well, I was written up for that. \"Credit: Splash News Online Remini's memoir, Troublemaker: Surviving Hollywood and Scientology, will hit shelves on Nov. 3. Her 20/20 interview--including <mark>Holmes</mark>--will air Friday, Oct. 30, at 10 p.m. on ABC."}, {"articleID": "2015063018_00002261_W", "names": {"Emma Stone": ["Q147077", "Q58064847"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}, "date": "2015-06-30", "url": "http://saharasamay.com/entertainment-news/676575653/emma-stone-genre-is-her-true-love.html", "content": "Hollywood star <mark>Emma Stone</mark>, who started her career with comedy film \"Superbad\" , says the genre is her true love. The 26-year-old actress has been praised for her work on movies like period drama \"The Help\" and crime film \"Gangster Squad\" but will always enjoy working in light-hearted films the most, reported Contactmusic. \"Comedy is my true love. I doub' t whether there will ever be another genre that can compete. A big part of my job is being able to understand different facets of the human psyche and I like to be able to push myself in roles where you have to dig deeper inside,\" she said. The \"Birdman\" actress said she gets attracted towards strong female roles, where she is portraying more than someone's girlfriend. \"I probably gravitate towards those kinds of characters although it's not like I'm specifically looking to play strong women.\" I'm attracted to roles where the female character has her own sense of identity and not just the guy's girlfriend and reacting to whatever he does, \"said <mark>Stone</mark>. super luxury car maker Rolls-Royce is gearing up to tap the...Coming-of-age drama\" Boyhood' won three of the biggest award...Sunny Leone is seen scorching the screen in the first look...Samsung unveiled the Galaxy S6 and Galaxy S6 Edge at Mobile...Reality TV star Kim Kardashian reportedly wants Beyonce to b.. . Automaker Renault India today said it will roll-out a multi -...Pharma tycoon Dilip Shanghvi surpassed Mukesh Ambani as the...When Holi is round the corner, can anyone forget all-time hi...In an interim order, the Bombay High Court has restrained th...Good news for the fans' of <mark>Salman Khan</mark> and Deepika Padukon...Reality TV star Kim Kardashian has posed nude for the upcomi...Bollywood superstar Akshay Kumar and Actress cum Entrepreneu...Kashmir witnessed season's heaviest snowfall as the arterial...Mexican actress Stephanie Sigman has joined Monica Bellucci...Luxury carmaker Mercedes-Benz launched the all-new compact B.. . Bollywood actor Poonam Pandey, gets relief as a local court...Automaker Renault India launched the new generation Duster p.. . Now Bollywood A-list actors are competing to get nude on-scr...The 2015 edition of the International Indian Film Academy Aw...India defeated Zimbabwe by six wickets chasing 288 runs...Indian auto major Mahindra & Mahindra showcases its electric...Were Suresh Raina and Shruti Hasan having an affair? Bollywo...Eyeing a sales milestone of 5 lakh units in the domestic mar.. . Union Home Ministry has asked the Mumbai Police to expedite...When Aamir Khan turned 50, the event had to be a grand one. S.. . PICS: Now flavourful, antioxidant-rich chocolate produced by new method Researchers have found a way to make chocolate more flavourf...Bar Refaeli feels she is too sexy to be handle. Check out adorable pics of Isha Koppikar's little angel Other than Ranveer, who wants to marry Deepika Padukone? Those days are gone, when you have to depend on touch screens and buttons to control your World's first flexible skin-like display inspired by nature InFocus unveils smartphone with 13 MP selfie camera"}, {"articleID": "2010122013_00051197_W", "names": {"Rebecca Ford": ["Q24260285", "Q57156917"], "Sue Mcallister": ["Q39822000", "Q46993215", "Q57262008"]}, "date": "2010-12-19", "url": "http://tmcnet.com/usubmit/-san-jose-shelters-computer-lab-hopelessly-out-of-/2010/12/20/5204052.htm", "content": "dec 20, 2010 (san jose mercury news - mcclatchy-tribune information services via comtex)--the \"computer lab\" at the commercial street inn, a north san jose shelter for the homeless, is a dimly lit room furnished with a couple of desks, two computers and a file cabinet. here, women are supposed to launch their new lives, crafting resumes, looking online for jobs and housing and honing marketable computer skills. but no one bothers to plug in the computers--decade-old dells and ibms with slots for floppy disks--because they don't work. measured in the faster-than-you-can-tweet pace of silicon valley, these computers would belong in the pleistocene age. \"they're archaic,\" says <mark>rebecca ford</mark>, 32, a homeless mother who is staying at the shelter with her 9-month-old son and 10-year-old daughter. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. find solutions for enterprises, smbs & service providers at the itexpo east, february 2-4, 2011 miami beach convention center, fl. for women like <mark>ford</mark>, lack of access to working computers is not mere hardship; it's a life's hindrance. \"the women are working to try to change their lives for the better,\" says julia burkhead, program director at the shelter, which is operated by the nonprofit innvision and sleeps 27 women and their children. \"we want to give these women all the tools we can to help them move out and move up.\" computers are central to that goal. the out-of-date machines were donated to the shelter some years ago, burkhead says, but they were already a few years old and hampered by mysterious technical bugs that made working with them frustrating. there's a well-equipped computer lab across the street from the women's shelter at the georgia travis center, another innvision facility, but it's only available during the day. after 6 p.m., when mothers are home from jobs and kids are back from school, doing work that involves computers is impossible at the commercial street inn. workers there often tell the story of 10-year-old jake, son of one of the shelter mothers, who tried to use a decade-old imac to write a book report for school, only to discover that he could not print it. there were no printers. the computer was not connected to the internet, so the boy couldn't send the file elsewhere to print. <mark>ford</mark> can relate. she works two jobs when she's not at the shelter: one in accounting at a san jose information technology company and one as a part-time sales clerk at walmart. she's also taking online courses toward a bachelor's degree in business management, and tries to do her course work after putting her children to bed. arriving at the shelter with her children for the 6 p.m. curfew, <mark>ford</mark> sums up what she faces: \"i'm supposed to do my job search at night, but we don't have computers or internet access. you can't apply for jobs online. you can't print your resume. you can't check your e-mail to see if an employer has asked you to report for a job interview. when you don't have technology, you can't compete. you can't even look for bus routes!\" after 6 p.m., you're completely cut off from the world, \"she says.\" it's rough being cut off from the world. \"equipping the shelter with modern computing technology would help transform the lives of women at the shelter, burkhead said. they could learn critical skills in accounting, word processing, database management or online research. they could help their children do homework. and the commercial street inn could satisfy a requirement of calworks, a state back-to-work program for mothers, by helping shelter residents find work. innvision, the valley's largest nonprofit provider of shelter for homeless individuals and families, plans to turn the underused, dimly lit room into a proper computer lab. (for information about innvision, visit www.innvision.org .) the organization is asking for $13,000 to pay for a new docking station, printer, projector and four work stations loaded with software for educational and job-search use. it also hopes to buy tutorial software for clients who are learning english, as well as privacy and security devices to keep the hardware and software safe. wish book readers can help make the computer lab for homeless residents of the commercial street inn a reality. donations in increments of $100 will help fund the cost of the needed equipment. a few years ago, michele mims, 49, a recovering drug addict, was one of the homeless women staying at the shelter. with support from burkhead and belen garcia-aceves, the shelter's case manager, mims struggled to get back on her feet and find a job and her own place. because the computers at the shelter didn't work, mims rode the bus across town to the martin luther king jr. library in downtown san jose to search for jobs online after the georgia travis day center closed. today, mims, living in her own apartment, is general manager of the safeway at hamilton and meridian avenues in san jose. access to computers, she said, got her back on her feet.\" without computers, \"she says,\" women like me would not be able to get any farther than where i used to be: living on the streets and on drugs. \"comments about wish book stories? e-mail wishbook @ mercurynews.com or call coordinator <mark>sue mcallister</mark> at 408-920-5833.\" like \"our facebook page at www.facebook.com/mercurynews.wishbook. to see more of the san jose mercury news, or to subscribe to the newspaper, go to vaporstream restores privacy to the enterprise with next generation confidential messaging platform synchronica wins operator in nigeria - 8th subsidiary of pan-african operator group miami beach convention center in miami, fl digium | asterisk world makes triumphant return to itexpo in miami 4gwe - google, at & t, telio, sonnenschein nath & rosenthal to present at 4gwe conference the world's largest communications and technology community technology marketing corporation, 800 connecticut ave, 1st floor east, norwalk, ct 06854 usa"}, {"articleID": "2013061123_00043810_W", "names": {"Brad Pitt": ["Q35332", "Q373912"], "Michael Joseph": ["Q17124758", "Q21458869", "Q39073364"]}, "date": "2013-06-11", "url": "http://www.ottawasun.com/2013/06/11/cops-called-after-fan-gets-too-close-to-brad-pitt", "content": "Angelina Jolie poses with her husband <mark>Brad Pitt</mark> as they arrive for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall U.S. actress Angelina Jolie is seen upon arrival for the world premiere of her husband <mark>Brad Pitt</mark>'s film \"World War Z\" in London June 2, 2013, and the Spanish premiere of the movie \"The Tourist\" in Madrid December 16, 2010, in this combination picture made June 2, 2013. Sunday marks Jolie's first public appearance after announcing she underwent a double mastectomy in February 2013. REUTERS/Neil Hall/Juan Medina/Files <mark>Brad Pitt</mark> arrives for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall Angelina Jolie arrives for the world premiere of her husband <mark>Brad Pitt</mark>'s film World War Z in London June 2, 2013. REUTERS/Neil Hall <mark>Brad Pitt</mark> and Angelina Jolie arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com <mark>Brad Pitt</mark> kisses Angelina Jolie at the World premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie arrives for the world premiere of her husband <mark>Brad Pitt</mark>'s film World War Z in London June 2, 2013. WENN.com Kimberly Wyatt arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Natasha Bedingfield arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie and <mark>Brad Pitt</mark> arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie poses with her husband <mark>Brad Pitt</mark> as they arrive for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall Muse's Matthew Bellamy, Dominic Howard, Chris Wolstenholme at the World premiere of World War Z in London June 2, 2013. WENN.com Angelina Jolie poses with her husband <mark>Brad Pitt</mark> as they arrive for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall Angelina Jolie arrives for the world premiere of her husband <mark>Brad Pitt</mark>'s film World War Z in London June 2, 2013. REUTERS/Neil Hall Police were called to <mark>Brad Pitt</mark>'s hotel in Sydney, Australia on Monday after an overzealous fan attempted to get too close to the actor and his son. The Hollywood superstar was leaving the city's InterContinental Hotel with his adopted son Pax, nine, on their way to a cruise around Sydney Harbour when they were approached by a man in the building's underground car park. The fan - identified as <mark>Michael Joseph</mark> - was tackled by <mark>Pitt</mark>'s bodyguards and police were called to the scene. Officers issued <mark>Joseph</mark> with a warning and ordered him to move on. A police spokeswoman tells the Sydney Daily Telegraph, \"It was ascertained that, although being an enclosed public space, the car park was controlled land under the control of the hotel. The man was issued with a move-on order following the incident.\" <mark>Pitt</mark>, who visited Australia to promote his new movie World War Z, went on to enjoy a day out on a yacht with his son, and they flew out of the country on Monday night. Subscribe now! Ottawa Sun SUN + account includes: In-depth Local News Insider Sports Live Edgy Columnists"}]