[{"date": "2014-11-13", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/7078338", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. <mark>Bell</mark> Investment Advisors Announces Event: Making a Good Life Happen (R)--The Lunch <mark>Bell</mark> Investment Advisors Announces Event: Making a Good Life Happen (R)--The Lunch OAKLAND, CA--(Marketwired - Nov 13, 2014) - <mark>Bell</mark> Investment Advisors, www.bellinvest.com, a Bay Area registered investment advisory firm, announced today that they will be hosting an event, \"Making a Good Life Happen ®--The Lunch\" on Wednesday, November 19, 2014, 12 - 1:30 PM at the firm's Oakland office. The lunch is part of an ongoing series of events that reflect the firm's dedication to providing free educational opportunities to the greater community focused on investment management, financial planning, and career/life coaching. The event will be hosted by <mark>Jim Bell</mark>, CFP ®, President & Founder, and Bonnie <mark>Bell</mark>, MA, MDiv ., Principal, and Director of Career/Life Coaching, who will discuss the firm's philosophy, \"Making a Good Life Happen .\" Attendees will learn how the firm's momentum-based investment strategy can help build positive momentum in other areas of life. Join the firm for lunch and networking with interesting local professionals from the San Francisco Bay Area. Discussion during the event could have a direct impact on the future career and life planning decisions of its participants. \"Most people want to have a good life, but unfortunately too many people simply cross their fingers and hope that will happen. As we always say, hope is not a strategy. Our momentum-based strategy offers insight into our philosophy, Making a Good Life Happen. This is a lunch that could actually change your life!\" says Bonnie <mark>Bell</mark>. http: //www.bellinvest.com/news-events/events/november-making-a-good-life-happen-lunch <mark>Bell</mark> Investment Advisors is a privately-owned, registered investment advisory firm, managing over $500 million in assets. It is in its 24 th year of business, offering investment management, financial planning and career/life coaching services. For more information, visit MEDIA CONTACT: Nancy Isaacs <mark>Bell</mark> Investment Advisors Canadian Paralympic Committee congratulates Sochi 2014 flag bearer and para-alpine ski champion Josh Dueck on career Morgan & Morgan Reminds Investors That a Class Action Lawsuit Has Been Filed Against Retrophin, Inc.--RTRX 5N Plus Winner in Multiple Categories in the 2014 Deloitte Technology Fast 50 (TM) Awards for a Fifth Consecutive Year Telenav Announces New Features for Scout?, Offering a More Social, Personalized and Intuitive Navigation Experience Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein.", "articleID": "2014111319_00059119_W", "names": {"Jim Bell": ["Q557294", "Q6193618"]}}, {"date": "2014-11-13", "url": "http://nerej.com/79199", "content": "Counselors of Real Estate's Fall Convention in Boston Jill Hatton, CRE Members of the New England Chapter of the Counselors of Real Estate (CRE) joined counterparts from around the globe at the 2014 Annual Fall Convention at the Boston Fairmont Copley Plaza. The theme of the meeting was \"Legacy and Innovation: A Bridge to the Future of Real Estate\" and session topics were varied and included, among others, \"Real Estate Market Outlook,\" \"Where is the Capital Flood Looking to Go\" and \"The Changing Healthcare Industry and Its Impact on Doing Business .\" Mayor Walsh welcomed attendees to Boston and highlighted several of his key agenda items including: * Focus on strength of regional growth by collaborating with adjacent communities. * Targeting growth in underdeveloped areas, highlighting opportunities that will arise with 85 acres that will result at Beacon Yards. * Reiterating his platform for more housing - more senior housing, 16,000 beds of student housing to free up housing stock in neighborhoods, and creating workforce housing with tools such as potential zoning relief at transit hubs. The following are highlights of selected general sessions. Real Estate Market Outlook: Point/Counterpoint * Ray Torto, Ph.D., CRE noted real estate is in a sweet spot but all risks are not priced in, thus the potential for overbuilding exists. Ray noted the U.S. is the best of developed economies, thus attracting significant capital flows. As such, Torto notes as interest rates rise, cap rates may not rise significantly given this extensive capital in the system. * Doug Poutasse, CRE commented that some real estate is trading to bond investors and noted that while many believe U.S. interest rates are low, Spanish and Italian 10-year rates are lower than those in the U.S. with more country risk and German interest rates are .8%. 3D Printing * KC Conway, CRE treated the audience to a lively explanation of 3D Printing and how it will impact real estate and our lives. KC shared information on this evolving technology that is already being used to \"print\" BMW tire rims, breathable casts and pills. Processes are far along in \"printing\" skin, food and vaccines. * Directly relevant to real estate are printers that can \"print\" a housing shell of poured concrete in a week. * Issues that may arise from these emerging innovations include impacts to zoning, sales tax collection and disposal of waste arising from printing, some of which may be hazardous. The CRE attendees enjoyed an interactive session with <mark>Sam Kennedy</mark>, EVP/COO of Boston Red Sox and additional presentations on \"Being a Fiduciary,\" \"Emerging Trends in Real Estate,\" \"Business Issues Forums,\" and \"Samuels' Transformational Mixed-Use Development in the Fenway\" - among others - all of which provided rich content and take home value. The final New England CRE Chapter meeting of the year is planned for November 18th and will be hosted by <mark>David Connolly</mark>, Esq. at the offices of Hinckley, Allen & Snyder, LLP. <mark>Ken Wilson</mark>, CRE and CEO of Capital Hotel Management will speak on the topic \"HOTELS: Love Them or List Them? An Update of the Hospitality Market from Boston and Beyond .\" Invitations have been sent. 2014 New England CRE Chapter Officers * Jill Hatton, TurtleRock Investment Management, chapter chair and secretary. * <mark>Peter Nichols</mark>, NorthStar Ally LLC, vice-chair. * John Baczewski, Real Estate Fiduciary Services, LLC, treasurer. * Donald Bouchard, Lincoln Property Company, membership vice chair. * Julie McIntosh, Capital Crossing Servicing Co., LLC, board member. * Martha O'Mara, Corporate Portfolio Analytics, board member. * Harris Collins, CB <mark>Richard Ellis</mark> - NE Partners, board member. Jill Hatton, CRE, is the 2014 New England/Upstate N.Y. CRE chapter chair, Boston, Mass. .", "articleID": "2014111414_00065371_W", "names": {"David Connolly": ["Q1174052", "Q28672845", "Q441702", "Q5232517", "Q5232520"], "Ken Wilson": ["Q18640561", "Q6388703", "Q6388704", "Q6388705"], "Peter Nichols": ["Q50399024", "Q7176096"], "Richard Ellis": ["Q1153445", "Q41191700", "Q53952818", "Q716624", "Q7325486", "Q7325488", "Q7325489"], "Sam Kennedy": ["Q21063817", "Q7407741"]}}, {"date": "2014-11-17", "url": "http://buffalonews.com/feed/ub-makes-statement-in-loss-to-kentucky-20141116", "content": "Educational establishment should be fighting failing schools, not Paladino President, Senate must begin filling federal court vacancies, including 2 in WNY Educational establishment should be fighting failing schools, not Paladino Setting the table for holiday guests shouldn't be a chore The theaters are getting better, but it's still all about the movie on the screen From master printer to journeyman: WNY Book Arts Center's Chris Fritton hits the road The theaters are getting better, but it's still all about the movie on the screen Top-ranked Kentucky struggles but wins LEXINGTON, Ky. - Fourteen minutes into Sunday's game, University at Buffalo forward Justin Moss took a sharp bounce pass from Lamonte Bearden and made a leaping, one-handed, tomahawk dunk over Kentucky center Willie Cauley-Stein. Moss is 6-foot-7. Cauley-Stein is a 7-footer who is likely to be a first-round NBA draft pick next spring. \"I got a great opportunity and took my chance,\" Moss said. \"I guess you could call it a statement .\" No guessing about it. It was the statement play in a statement game for UB. If UB plays anything this season like it did in losing to the No. 1-ranked Wildcats, this is going to be a mighty good year for the Bulls. The final score alone - 71-52 - was a moral victory. But that did not tell the tale. A stunned crowd of 22,175 at famed Rupp Arena watched in silence as UB walked off at halftime with a 38-33 lead. The Bulls still were up, 45-44, with 13:30 to play. They were within four, 51-47, with 10:20 left. They were within 11 with five minutes left. This is a UB team that lost its three best players from last year. It's a Kentucky team that returns 60 percent of last year's national runner-up squad and has nine McDonald's high school All-Americas. \"Are you kidding?\" essentially was the reaction from Kentucky coach John Calipari to UB coach Bobby Hurley after the game. \"I told Bobby after,\" Calipari told reporters, \"he lost three of his guys, his starters, and had two starters back, has pretty much a brand new team. And they came in here and did that? Wow! Hats off to 'em ....I coach young teams. For him to do that the second game out, amazing stuff .\" If that's who they are in their league, they're going to be really, really good. \"UB's players obviously did not read the press clippings of Kentucky's stars before the game. On UB's first possession, 6-3 guard Jarryn Skeete hit a three-pointer on 6-6 guard Aaron Harrison, a preseason first-team All-American. That's Aaron Harrison, the guy who hit winning three-pointers in Kentucky's Sweet 16, Elite Eight and Final Four victories last season. On UB's second possession, freshman point guard Lamonte Bearden drove hard down the lane and drew a foul from 6-6 <mark>Andrew Harrison</mark>, the all-Southeastern Conference guard. When Skeete hit a 16-footer and a 20-footer back-to-back to give UB a 12-10 lead, it was obvious the Bulls were not backing down .\" We've got a tough team; we don't back down from nobody, \"said Moss .\" Intimidation - that's not something in my vocabulary, \"said UB guard Rodell Wiggington .\" But Skeete making some big plays kind of made the expectations bigger for us. \"Skeete, a junior from Ontario, led UB with 16 points. Wigginton, a 6-5 junior college transfer from Michigan, had 15. Moss, UB's best player, managed eight points on 3 of 13 shooting. He took mostly good shots, but Kentucky's front line simply is too tough to score against. Hurley was proud of his team .\" This had the feel of an NCAA Tournament game, \"he said .\" They're at the top of the food chain. For us to be able to be competitive, and to feel like we were outplaying them for a large portion of the game, gives our guys confidence. \"I'm proud of winning the hustle game early in the first half, loose balls, charges, gritty play .\" Among the reasons UB hung with Kentucky: • The Bulls guards - Bearden, Skeete, Shannon Evans and Wiggington - handled the ball well and showed quickness in creating some good shot opportunities. UB shot 44.4 percent from the field in the first half and made just seven first-half turnovers. \"They've got a lot of big guys, and coach just told me every time I go to the hoop make sure I hit a body,\" said Wiggington, who was 9 of 11 from the foul line. \"So that's what I tried to do, create contact and get to the free-throw line .\" • UB's low-post players - mostly Moss and Will Regan - had active hands and did just enough to keep Kentucky's massive post players from dominating. \"We tried to mix up some 2-3 zone, which we don't play that often, just for this game, and also played man just to give them different looks,\" Hurley said. \"Lucky for us they were not hitting their three-point shot in the first half .\" • Kentucky didn't pound the ball inside enough early. The Wildcats were 3 of 14 from three-point range in the first half. \"We came out sluggish, and they were playing harder than us,\" said Kentucky 7-footer Dakari Johnson. \"We needed this,\" Calipari said. \"We needed a team that could beat us on the dribble, that wasn't afraid, that played physical, that had an inside presence .\" Hurley wrote \"0-0\" on the locker room blackboard at halftime. But Kentucky turned up its defense in the second half and held UB to 14 points after intermission. \"The ability of their bigger players to play great defense away from the basket kind of was overwhelming at times in the second half,\" Hurley said. \"Being able to block shots makes it hard,\" Calipari said. \"You can say just drive the ball. But you're looking on the two 7-footers under there and a 6-10 guy .\" UB made just 4 of 19 second-half shots. Kentucky made 13 of 26. Alerts Text message notifications of news happening now. 280 Letter: Bishop's strong stance is a breath of fresh air Copyright 1999 - 2014 - The Buffalo News copyright-protected material. Sorry, an unexpected error occurred. Please try again later.", "articleID": "2014111705_00012548_W", "names": {"Andrew Harrison": ["Q14469654", "Q47339436", "Q4757245", "Q4757246"]}}, {"date": "2014-11-18", "url": "http://islanders.nhl.com/club/news.htm?id=739604&cmpid=rss-wright", "content": "Game Preview: Islanders vs. Lightning The Islanders wrap up a home and home series with Tampa Bay at Nassau Coliseum. Three days after their first loss in six games, all the New York Islanders want to do is get back on the ice to make amends. They may have had to wait a few days for a second crack at the Tampa Bay Lightning, but the Islanders will get their chance at revenge tonight at 7 p.m. at Nassau Coliseum. \"I thought we played a pretty good game in Tampa. We stayed right with them,\" Head Coach Jack Capuano said. \"We had a couple of breakdowns and that was the difference in the game I know this team and the more we play, the better we are .\" The Islanders played the Lightning in the second game of a back-to-back set Saturday, but the tables are turned tonight, as the Isles are rested, while the Bolts play their second game in two nights. \"Rested\" teams (teams that did not play the night before) hold a 39-16-13 record when facing teams who played the previous night. The Islanders hope to use that statistic - and fresh legs - to their advantage tonight. \"We get them on the back-to-back this time and we just want to be ready to play,\" Islanders captain <mark>John Tavares</mark> said. \"[We have to] just try to be a little bit more physical on the offensive side, on the fore check, be a little bit harder on them and try to generate a little more on our cycle .\" Capuano said he'll be adjusting the top power-play unit to bust out of a 1-for-16 slump. The coach had Johnny Boychuk and Frans Nielsen practicing on the top unit. While the Islanders are a top-10 team in goals (54), the Lightning counter with the NHL's most potent offense, with 71 goals (including shootout winners) in 19 games (3.7 per game). \"We have to make sure that we buckle down defensively,\" Capuano said. \"We're not looking to get into a track meet with them, we're looking to play our game .\" While most conversations about the Tampa Bay offense begin with Steven Stamkos, the Lightning boast a well-balanced attack. Sophomores <mark>Tyler Johnson</mark>, Nikita Kucherov and Ondrej Palat have all stepped up after impressive rookie campaigns. <mark>Johnson</mark> is second in team scoring with 21 points (six goals, 15 assists), Palat has 14 points (four goals, 10 assists) in 19 games and Kucherov (seven goals, nine assists) is two points shy of matching his output from last season in a fraction of the games. \"[Nikita] Kucherov is a real tricky player,\" <mark>Tavares</mark> said. \"He's got some great hands. He's very creative. [<mark>Tyler</mark>] <mark>Johnson</mark> is just a very underrated, smart player. He always seems to be in the right spot, very high hockey IQ and, obviously, can produce. Those couple guys can make a lot of plays and on their back end, they just have guys with a lot of size who move the puck well .\" The Lightning are still without top defenseman Victor Hedman and it is unclear which of their two goaltenders will play Tuesday. <mark>Ben Bishop</mark> played last night against the Rangers, potentially opening the door for former Islander Evgeni Nabokov to play at the Coliseum. The Islanders and Lightning face off at 7 p.m. 11-6-0 (22 points - 2nd in Metropolitan Division, 4th in Eastern Conference) 4-2-0 home Tampa Bay Lightning 13-4-2 (28 points - 2nd in Atlantic Division, 2nd in Eastern Conference) 7:00 p.m. Nassau Veterans Memorial Coliseum What's Happening at the Coliseum: Josh Bailey - Forward Josh Bailey hasn't missed a beat since returning from an eight-game absence, notching a goal and an assist in his first two games back. The Bowmanville, ON, native scored the Islanders second goal against the Lightning on Saturday and has points in four straight games (one goal, three assists), dating back before his hand injury. Bailey has six points (three goals, three assists) in nine games this season. Tampa Bay Lightning previous game lines 51 Valtteri Filppula - 91 Steven Stamkos - 24 Ryan Callahan 18 Ondrej Palat - 9 <mark>Tyler Johnson</mark> - 86 Nikita Kucherov 27 Jonathan Drouin - 90 Vladislav Namestnikov - 17 Alex Killorn 10 Brenden Morrow - 11 Brian Boyle - 13 Cedric Paquette Defensemen 6 Anton Stralman - 25 Matt Carle 5 Jason Garrison - 7 Radko Gudas 8 Mark Barberio - 62 Andrej Sustr By Adam Kimelman Monday, 11.17.2014 / 1:44 PM", "articleID": "2014111806_00005734_W", "names": {"Ben Bishop": ["Q12956342", "Q816445"], "John Tavares": ["Q537353", "Q6260293"], "Tyler Johnson": ["Q17489372", "Q30122141", "Q57423105", "Q7585450", "Q7860052"]}}]