[{"date": "2014-11-18", "url": "http://fakingnews.firstpost.com/2014/11/samajwadi-party-to-distribute-buffaloes-instead-of-laptops-to-woo-voters-back-in-uttar-pradesh/?utm_source=fp_widget", "content": "Samajwadi Party to distribute buffaloes instead of laptops to woo voters back in Uttar Pradesh Wife suspects extramarital affair after government employee starts staying in office after 5 PM Pictures: Reactions of various people to Mudgal committee report on IPL spot-fixing To improve India's relations with penguins, Modi to go Antarctica, 50K fans expected to attend his speech Students urge Smriti Irani to retain German, instead replace Maths with Sanskrit Local man wearing more than hundred lucky charms held at Delhi airport Man claims to have actually lifted <mark>Taj Mahal</mark> from its tip while getting clicked Bollywood boycotts Satyamev Jayate for appealing to refrain from objectifying women Those who know the art of celebrating an occasion without alcohol are on the verge of extinction: UNESCO With frequent foreign trips, Narendra Modi declared India's first \"Onsite PM\" Sonia Gandhi's Balance Sheet as declared to the Election Commission 5 ways to meet your financial needs while living your dream of watching popular American TV series all day long Auto driver changes his plan after passenger coincidentally asks him to go where he was already headed Engineering students shocked at AMU students discussing something as unimportant as library Virat playing well in Anushka's presence to make BCCI allow girlfriends on foreign tours: Sources Man tracks down school friend on Facebook to recover money which he had loaned him in class eight Hygienic garbage and statues of brooms to make \"Swachh Bharat Abhiyaan' a success Now weekend coaching classes for working male engineers to help them groom their flirting skills Samajwadi Party to distribute buffaloes instead of laptops to woo voters back in Uttar Pradesh blaming free laptop distribution scheme for his party's debacle in Lok Sabha Polls, Samajwadi Party supremo, Mulayam Singh Yadav has now asked his son to prepare for the next assembly polls in the state by distributing free buffaloes to voters. Arguing that literacy and awareness levels in Uttar Pradesh were increasing at alarming levels ever since the party gave laptops, Mulayam claimed that distribution of buffaloes would keep voters grounded and take them <mark>Azam</mark> has warned Mulayam against eyeing his beloved buffaloes for distribution .\" Look at what TMC did in West Bengal. I mean they did nothing and still won overwhelmingly in elections! \"Mulayam pointed,\" We should have followed their model. Literacy could be a boon to mankind, but certainly not for parties like us. \"Mulayam is confident that after having buffaloes in their house, voters will develop an instant connection with SP leader <mark>Azam Khan</mark> and thus with the party at large .\" <mark>Azam</mark> miyan's statements and acts in the past have made buffaloes completely synonymous with him. The first thing that comes to your mind when you hear buffalo is not milk, but <mark>Azam Khan</mark>, such has been the impact, \"Mulayam claimed. But not willing to take any more chances now, the buffaloes will have tattoos of SP leaders like Mulayam, Akhilesh, Dimple, etc. all over their body .\" If buffaloes don't remind them of SP, these tattoos will, \"explained party spokesperson Gaurav Bhatia. Mulayam was also mulling distributing goats initially for secularism's sake, but dropped the plan after he realized that people may eat the animal and forget about it by the time elections come. Political experts feel that distributing buffaloes is a master-stroke by Samajwadi Party as it will be the best for top-of-the-mind-recall value. Samajwadi Party blames no election in jails as reason for poor performance <mark>Azam Khan</mark>'s buffaloes run away once again, to shift media attention away from UP riots Buffalo chewed <mark>Azam Khan</mark>'s brain before he made Kargil statement Rape survivors request UP govt to show same sympathy as they show towards rapists Babulal Gaur awarded honorary doctorate by SP School of Sociology Abu Azmi turns into a zombie, on a biting spree to mutate Muslims into creatures like himself EC orders sun to stop rising till May 16, calls it a violation of conduct by DMK to influence voters To improve India's relations with penguins, Modi to go Antarctica, 50K fans expected to attend his speech | Faking News Students urge Smriti Irani to retain German, instead replace Maths with Sanskrit | Faking News With frequent foreign trips, Narendra Modi declared India's first\" Onsite PM \"| Faking News Wife suspects extramarital affair after government employee starts staying in office after 5 PM Pictures: Reactions of various people to Mudgal committee report on IPL spot-fixing To improve India's relations with penguins, Modi to go Antarctica, 50K fans expected to attend his speech I will have to run Virat Kohli out again when I'm batting well: <mark>Rohit Sharma</mark> श्रीलंका पर टीम इंडिया की क्लीन स्वीप से शादीशुदा खिलाड़ियों की अाई शामत कुत्तों ने' किस ऑफ़ लव' के प्रदर्शनकारियों को धिक्कारा और कहा,' तुम रहने दो बेटा, तुमसे ना हो पायेगा '", "articleID": "2014111808_00065685_W", "names": {"Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"], "Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"], "Taj Mahal": ["Q353023", "Q59627566"]}}, {"date": "2014-11-19", "url": "http://www.pinknews.co.uk/2014/11/19/islington-council-to-fly-transgender-flag-for-day-of-remembrance-tomorrow/", "content": "Enter your email address to receive our daily LGBT news roundup Islington Council will fly a flag from the Town Hall tomorrow Islington Council will fly a transgender flag from the top of town hall tomorrow, to mark the Transgender Day of Remembrance. The Transgender Day of Remembrance is held across the world every year on November 20world, 226 transgender people were reportedly killed in the past 12 months - though statistics are unreliable, as most countries do not hold accurate data on transgender victims. Islington Council will fly the transgender flag over town hall for the day, ahead of its remembrance event. Labour councillor Osh Gantly - who is currently the only openly trans elected politician in the UK - said: \"Transgender Day of Remembrance provides an opportunity for the entire community to remember, mourn and honour the transgender and gender-diverse people who have been murdered in the last year and the years before .\" In many countries today it is still the case that transgender and gender-diverse people are routinely murdered, beaten, bullied and discriminated against. \"It is vital that we stand-up for transgender rights as they are human rights .\" I am very proud to be an Islington Labour councillor that happens to identify as transgender. \"But I am especially proud that, for the first time ever, our council has chosen to mark Transgender Day of Remembrance by flying the transgender flag over Islington Town Hall .\" I'm fortunate that I live in London, one of the greatest cities in the world, which is in the main a welcoming place to be a transgender or gender-diverse person. But transphobic hate crimes do take place in our great city every day. \"I'm pleased to say that Islington Council is committed to tackling hate crime in all its forms .\" I know that, as a Labour council, we stand together for all our residents and today we proudly proclaim that includes our transgender and gender-diverse residents. \"Liverpool council also plans to fly the flag over its Town Hall tomorrow. NBA's first out gay player <mark>Jason Collins</mark> retires US: First same-sex marriage licence issued in South Carolina Republican congresswoman: I backed LGBT equality after my son came out as trans Trans radio host Stephanie Hirst: I went public with transition to help inspire others Welsh Lib Dems to lead landmark debate on transgender issues Mexico City: Legislative assembly passes pro-trans gender recognition bill UK: Man ordered to stand trial after allegedly abusing trans woman in supermarket Watch: Trans MMA fighter destroys claims she has an\" unfair advantage' in sport UK: Family accused of forcing daughter out of company for being transgender What happened after a single dad asked strangers for advice on helping his son come out as gay WATCH: University of Nottingham hockey team strip off against homophobia EastEnders star cut from Children in Need quiz after offending S Club 7 with anti-gay joke Comment: The truth about being a gay 16-year-old at an all boys boarding school France: Former President Sarkozy condemned by key allies for call to scrap equal marriage US: First same-sex marriage licence issued in South Carolina Islington Council to fly transgender flag for Day of Remembrance tomorrow NBA's first out gay player <mark>Jason Collins</mark> retires Stonewall CEO:' I know of gay footballers in the Premier League' Nicola Sturgeon becomes Scotland's First Minister Republican congresswoman: I backed LGBT equality after my son came out as trans Comment: Uganda's LGBT community is in limbo pending a new anti-gay bill Trans radio host Stephanie Hirst: I went public with transition to help inspire others WATCH <mark>Nicky Morgan</mark> presents PinkNews Award to the naked rowers WATCH <mark>David Laws</mark> presents Lynne Featherstone with PinkNews Ally of the Year Award Watch Conchita Wurst performs at the United Nations Watch Cartoon Network debuts first ever gay characters - but censors the kiss Interview Lord Cashman on Thatcher's hair, returning to EastEnders and equalising...British man jailed for \"homosexual acts': I don't support a travel boycott against Morocco Meet someone who isn't male or female and wants a new type of passport", "articleID": "2014111917_00050789_W", "names": {"David Laws": ["Q333663", "Q5236379"], "Jason Collins": ["Q2317740", "Q6161884"], "Nicky Morgan": ["Q10502518", "Q580375"]}}, {"date": "2014-11-20", "url": "http://independent.co.uk/sport/football/premier-league/arsenal-vs-manchester-united-olivier-giroud-and-mikel-arteta-return-from-injury-as-arsene-wenger-delivers-positive-news-9872977.html", "content": "Arsene Wenger has revealed that he has Olivier Giroud available for selection ahead of Arsenal's crucial Premier League clash with Manchester United this Saturday, with the striker recovering from a broken leg a month ahead of schedule. Giroud has not played since the end of August when he suffered a broken tibia in the 2-2 draw with Everton, having scored minutes before the injury to salvage a point for the Gunners. The French striker's absence led to Wenger making a deadline day move for Danny Welbeck, with the England international joining the North London club from United for £ 16m. Arsenal's injury list Ahead of the game against their fierce rivals, Wenger revealed that both Giroud and club captain Mikel Arteta are available after injury, and there was also positive news regarding the progress of defenders Mathieu Debuchy and Laurent Koscielny. \"Giroud and Arteta are both available,\" Wenger told www.arsenal.com. \"It's just a question of how ready they are. But they are available. Olivier Giroud is back in training\" He [Giroud] is three or four weeks ahead of schedule. Originally we planned to have him back for competition at the beginning of next year. So he's one month ahead. \"Koscielny and Debuchy are doing well, they are out on the field [working] again. We have to see now. Usually field work is three weeks away from full group training. Then there is fitness. It looks straightforward for Debuchy. It's not inflammation, it's just repairing surgery. For Koscielny, it depends how well he responds to training. At the moment he looks good .\" Wenger defends Ozil and Diaby Wenger added that both Welbeck and £ 35m Alexis Sanchez have helped the Gunners deal with the absence of their lead striker, but stressed that the return of both the France international and a fit-again Theo Walcott. When asked if they had relied on Welbeck, Wenger said: \"Yes, and on Sanchez as well. But we have Giroud back, we have Walcott back. Slowly they <mark>will</mark> integrate into the team again and give us different options. Welbeck has scored five goals since joining Arsenal Finally, Wenger gave a brief update on injured midfielder Mesut Özil as he continues to recover from a serious knee injury sustained in the 2-0 defeat to Chelsea. However, Wenger did concede that the timescale for his return still stretches into next year .\" Ozil is doing well but he <mark>will</mark> not be ready before the start of 2015, \"Wenger said. German-born US filmmaker suffered a heart attack Ashton Kutcher backs Uber exec's call to expose lives of female reporters people'What is so wrong about digging up dirt on shady journalist?' The Broadway Hotel a\" filthy hovel'? Our man has seen far worse Myleene Klass criticised by Nick Clegg over mansion tax claims tv Regular cast member Ste Hay, played by Kieron Richardson, is about to test TV boundaries \"There are gay footballers in the Premier League who are afraid to be open' Craig Charles leaves the jungle after sudden death of his brother tv Corrie star was missing from the live section of last night's show people Jimmy Ruffin passes away aged 78 Britpop guitarist decapitated by lorry in horrific road accident people Jeff Fletcher found fame in 1990s Daniel Sturridge injury latest: <mark>Brendan Rodgers</mark> ready to buy a striker as setback rocks Liverpool Jack Wilshere ready to be the heartbeat of Roy Hodgson's new England era Former Chelsea striker Mikael Forssell missed training\" because of a cat standing next to his car' This is what the one in ten British men who pay for sex need to know Pirelli calendar 2015: The problem with \"plus-size' models like Candice Huffine Woman opens professional cuddling shop - gets 10,000 customers in first week Angelina Jolie confuses everyone with\" ay up me duck' East Midland's greeting to Derby actor <mark>Jack O'Connell</mark> at awards show i100: A single mother on benefits who became one of the world's most successful authors Rising violence and increased police patrols have left residents of all faiths looking over their shoulders The Ebola crisis has Medecins sans Frontieres in the headlines, but their work goes far beyond West Africa Isis extends its deadly reach with suicide bombing in Kurdish capital Residents in what was Iraq's safest city fear an increase in jihadist attacks, reports Patrick Cockburn \"Mysterious and inviting' shot of diver wins photography competition Stunning image of cenote in Mexico takes top prize Negative West End portrayals of politicians put people off voting How the growth of 3D printing enabled toy-designer to make an army of custom-made figurines <mark>Will Smith</mark>'s children have made waves with a gloriously over-the-top interview, but <mark>will</mark> their music match their musings? How <mark>George Osborne</mark> keeping his fridge padlocked shows a frosty side to shared spaces From dogs in cars to online etiquette, while away a few minutes in peace with one of these humorous, original and occasionally educational tomes New Wigan manager said all the right things - but until the FA's verdict is delivered he is still on probation, says Ian Herbert\" O, Louis' is the plaintive title of a biography about the Dutchman. Ian Herbert looks at what it tells us about the Manchester United manager Ukip silk bow ties, Green Party T-shirts, and \"Iron Baby' romper suits", "articleID": "2014112013_00087047_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Jack O'Connell": ["Q16028203", "Q16184113", "Q16733588", "Q16733590", "Q22680912", "Q348066", "Q43379437", "Q6114376", "Q6114380"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}]