[{"articleID": "2015110403_00113306_W", "names": {"Robert Bruce": ["Q26265218", "Q30604152", "Q43393721", "Q43910743", "Q53475332", "Q7342438", "Q7342439", "Q7342441", "Q7342444", "Q7342446", "Q7342447"]}, "date": "2015-11-03", "url": "http://thedailyjournal.com/story/news/2015/11/03/1st-district-goes-all-democrat/75093702/", "content": "Share This Story! Let friends in your social network know what you are reading about FacebookEmail Twitter Google + LinkedIn Pinterest 1st District goes all Democrat 1st District Assembly race ends Post to Facebook 1st District goes all Democrat 1st District Assembly race ends Check out this story on thedailyjournal.com: http: //vineland.dj/1Nqbk2o {##} CancelSend Sent! A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CONNECT TWEET LINKEDIN COMMENTEMAILMORE The 1st Legislative District is moving back to full Democratic Party control as unofficial vote totals for Tuesday's election show Assemblyman <mark>Robert</mark> Andrzejczak and his first-time running mate, <mark>Robert Bruce</mark> Land, finishing in the top two spots. Land, who made his first political foray with his candidacy for the Assembly, said he was surprised and excited at the unofficial results declaring him a winner. \"It feels great,\" Land said. \"I didn't know what to expect but it's been a great ride. I'm excited--I'm ready to do this .\" Land added, \"I'm really going to enjoy working with Bob .\" Republican Assemblyman Samuel Fiocchi, in his first term as a state lawmaker, was the target of an extensive negative ad campaign that criticized his ethics as a businessman as well as a legislator. His running mate, Cumberland County Freeholder James Sauro, also caught part of the Democratic attack late in the campaign. \"What you saw in this election, you actually saw a party buy an election,\" Sauro said. \"I'm disappointed because seriously, when I look at our opponents, I really do believe they are not even close .\" State Sen. Jeff Van Drew had handpicked Andrzejczak, who first was appointed to an unexpired term in 2013, and Land, a retired state corrections department captain. Andrzejczak, a Middle Township resident, won his first full term later in 2013, the same year Fiocchi won. Senators did not have to run for election this year, but Van Drew was a strong presence in the race on both sides. The Assembly slate proudly ran as \"Team Van Drew\" while Republicans accused the senator of blocking legislative cooperation with Fiocchi. The 2015 race was unusual in that three of the four candidates were only are from the same county but the same city--Vineland. The district encompasses all of Cape May County and parts Cumberland and Atlantic counties. Like Andrzejczak in his first race, as well as this one, Land was introduced to voters with a heavy emphasis on his record as an Army combat veteran. Land saw action in the Vietnam War, escaping wounds but picking up numerous medals including two Bronze Stars. He grew up in Millville but has spent most of his adult life in Vineland. Andrzejczak, who also had not held office prior to becoming an assemblyman, lost a leg to an explosion while serving in Iraq. Fiocchi is a member of the family that built Lee Rain Irrigation, a firm well known in and out of New Jersey. He parted with that business but is active in others, including real estate. Sauro, who owns a second-generation plumbing business, has served widely spaced terms as a Cumberland County freeholder over the past decade and a half. He and Fiocchi briefly served as together on the freeholder board. Joseph P. Smith; (856) 563-5252; jsmith @ gannettnj.com CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //vineland.dj/1Nqbk2o"}, {"articleID": "2013040720_00070920_W", "names": {"Mark Kelly": ["Q10326587", "Q11770303", "Q22261100", "Q28709861", "Q357510", "Q43127604", "Q554312", "Q6768338", "Q6768340", "Q6768341", "Q6768343"]}, "date": "2013-04-07", "url": "http://delmartimes.net/2013/04/07/tphs-shuttle-service-from-solana-beach-back-on-for-2013-14/", "content": "tphs shuttle service from solana beach back on for 2013-14 the san dieguito union high school district was able to work some changes and find some wiggle room to bring back its bus shuttle service to torrey pines high school. eliminating the four high school shuttles in the district's transportation service was among a list of $3 million in proposed budget cuts for the 2013-14 school year impacting about 220 students, many of whom are included in the district's free and reduced lunch program and whose families don't own a vehicle. for those affected students, the service was the only way for them to get to torrey pines high school from solana beach. shuttles also run to la costa canyon and san dieguito academy. cutting the transportation would've saved $100,000 but the district's director of transportation, daniel love, and deputy superintendent rick schmitt were able to figure out a way to still offer the service for $30,000 with no new bus drivers and altering pick-up times. \"rick has a heart for the kids these shuttles are serving,\" said sduhsd superintendent ken noah. \"he's been working on this for quite some time .\" noah said that for at least one year the district can earmark $45,000 in the budget for the shuttle service, especially because the district won't have a board election this year. noah said the district will likely have to revisit the issue in the next year. solana beach water district board approves fiscal year 2013 budget carmel valley. you can follow any responses to this entry through the del mar foundation and del mar library to bring \"fancy nancy' to del mar all incumbents re-elected to carmel valley planning board, one member steps down upcoming solana beach ball to raise much-needed funds for classes at district schools flu deaths hit new high sixty san diegans have died from complications related to the flu this season, the county health and human services agency (hhsa) announced today. this will be the last influenza update issued this flu season. the new total surpasses the 58 deaths reported during the 2009-2010 h1n1 pandemic flu season. most of the dead this season were elderly people and all [?] astronaut talks about wife's brain injuries at scripps conference in la jolla capt. <mark>mark kelly</mark> is a bona fide american hero. he commanded four space shuttle missions, including the endeavor's final voyage, flew 39 combat missions over iraq during the gulf war, and has logged more than 6,000 flight hours as a navy pilot. as the keynote speaker at the eighth annual brain injury rehabilitation conference, march 22-23, <mark>kelly</mark> was qualified [?] rancho santa fe firefighters contain small vegetation fire in 4s ranch on friday, april 5, at 4:10 p.m., firefighters from the rancho santa fe fire protection district (rsffpd) and san diego fire department responded to a reported vegetation fire near camino del norte and craftsman way in 4s ranch. [?] the rancho santa fe garden club will hold an advisory vote this month that will coincide with the rancho santa fe association's advisory vote on the sale of the clubhouse. advisory votes are not binding. [?] rancho santa fe residents provide feedback on golf club tree management plan"}, {"articleID": "2018071607_00222622_W", "names": {"Robert Jennings": ["Q19874645", "Q7346099"], "Tom Burgess": ["Q3530669", "Q7815127", "Q7815128", "Q7815129"], "John Sutton": ["Q20675734", "Q21463425", "Q25796470", "Q2702211", "Q28037473", "Q429951", "Q48481687", "Q6259719", "Q6259722", "Q6259724", "Q6259728", "Q6259730"]}, "date": "2018-07-16", "url": "https://www.sportsnews.com.au/nrl/bunnies-better-than-14-burgess/443028", "content": "By AAP + on 16/07/2018 at 5:34 pm Filled in: NRL News Sam Burgess has declared South Sydney's class of 2018 better than their 2014 NRL premiership group. The Rabbitohs are flying high at the top of the NRL ladder after notching up nine straight victories. With the likes of Damien Cook and <mark>Robert Jennings</mark> enjoying breakout seasons, George and <mark>Tom Burgess</mark> running over the top of rival forward packs and veteran <mark>John Sutton</mark> discovering career-best form, the Bunnies have been installed as premiership favourites. Before a ball had been kicked in anger this year they were considered title outsiders, however expectations are now soaring in Redfern. Parallels are being drawn between this year's side under rookie coach Anthony Seibold and the one that broke a 43-year premiership brought in 2014. While clubs usually shy away from such comparisons, Rabbitohs talisman <mark>Burgess</mark> is happy to declare the side is playing better football this year compared with four years ago. However he points out that the rest of the competition has gone forward alongside them. \"We're playing better football than in 2014, certainly,\" <mark>Burgess</mark> said. \"Some of the shape that we're throwing and the combinations we've got going at the moment are probably better than what we had in 2014 .\" But that's probably a reflection of the competition as well. Everyone improves year-in and year-out and adapts with the times. \"Whether that means we're going to do the same thing as 2014, that's a different story. The competition is completely different. We understand that .\" Their convincing 24-6 win over Canterbury on Saturday got Souths to nine wins on the trot, the first time in 29 years they've achieved the feat. But <mark>Burgess</mark> said it would count for little if they didn't go on with the job. When the Rabbitohs last went nine in a row in 1989, they fell one game short of the grand final and <mark>Burgess</mark> said they were out to avoid the same fate. \"It really doesn't count, the amount of games you win in a row,\" <mark>Burgess</mark> said. \"You've got to be consistent, we understand that. But also you've got to get it right when the time's right and we all know when that is .\" When finals come around, there's no point winning nine in a row and resting on that because people don't care about it. \"* All Offers and Promotions posted in this article excludes NSW residents."}, {"articleID": "2014032105_00008534_W", "names": {"Abdul Hamid": ["Q3246667", "Q4665391", "Q46996242", "Q47118441", "Q938136"], "Dong Nguyen": ["Q15726354", "Q57421759"]}, "date": "2014-03-20", "url": "http://www.theepochtimes.com/n3/573449-vladimir-putin-commentary-thanks-for-being-so-cool-about-everything-is-satire/", "content": "Justin Casquejo Photos: NJ Teen Climbed to Top of 1 World Trade Center Ad Endorsing da Vinci Robot Violated U of Illinois Policies, Review Finds Jodi Arias Retrial: Sentencing Phase Set to Start Sept 8, Months Off Original Schedule Justin Casquejo Reaches Top of Freedom Tower, Eluding Guard Janet Lim Napoles Should Have to Pay For Her Stay in Jail, Senator Says Zaharie Ahmad Shah, Fariq <mark>Abdul Hamid</mark> Probe: Pilot Suicide a Taboo Topic in Previous Investigations Malaysia Airlines Conspiracy Theories: UFOs, Aliens, AWACS Hijacking; but Here's 7 Leading Ones on Missing Flight 370 Vladimir Putin Commentary \"Thanks For Being So Cool About Everything' is Satire Ad Endorsing da Vinci Robot Violated U of Illinois Policies, Review Finds WhatsApp: Founder Jan Koum Says Your Data Won't be Sold Off After Facebook Deal Spring 2014: Vernal Equinox Facts, Daylight Hours, Change of Seasons Reign Season 2: CW Show Renewed as Season 1 Passes Midway Point The Walking Dead Spoilers: Beth Isn't Dead, Rick Isn't\" Safe,' Season 4 Finale is \"Savage' Once Upon a Time in Wonderland Season 2: Will ABC Show Be Canceled or Renewed? Vernal Equinox 2014 Day: Broom Stand, Balancing an Egg\" Planetary Alignment' are Myths Tech News Vladimir Putin Commentary \"Thanks For Being So Cool About Everything' is Satire Russia's President Vladimir Putin addresses the Federation Council in Moscow's Kremlin on Tuesday, March 18, 2014. President Vladimir Putin defended Russia's move to annex Crimea, saying that the rights of ethnic Russians have been abused by the Ukrainian government. He pointed at the example of Kosovo's independence bid supported by the West, and said that Crimea's secession from Ukraine repeated Ukraine's own secession from the Soviet Union in 1991. (AP Photo/Sergei Ilnitsky, pool) Ad Endorsing da Vinci Robot Violated U of Illinois Policies, Review Finds WhatsApp: Founder Jan Koum Says Your Data Won't be Sold Off After Facebook Deal World Star Hip Hop:\" Father Whoops on His 13-Year-Old Daughter' Goes Viral; Gone Too Far? An article from preeminent satire website The Onion has a fake editorial from Russian President Vladimir Putin, titled \"A number of people believed the article was a real editorial from Putin after it was published on The Onion on Thursday afternoon .\" It's certainly no easy task to forcefully annex an entire province against another country's will, so I just wanted to thank you-the government of the United States, the nations of western Europe, and really the entire world population as a whole-for being super cool about all of this, \"the fake opinion piece says .\" Seriously, you guys have been amazing. All of you. I really appreciate it. \"disclaimer, which reads:\" The Onion is a satirical weekly publication published 52 times a year on Thursdays. \"\"The Onion uses invented names in all its stories, except in cases where public figures are being satirized. Any other use of real names is accidental and coincidental,\" it continues. The article seems to follow a similar theme explored by The Onion in previous fake opinion pieces by Syrian President Bashar al-Assad, which are titled \"Hi, In The Past 2 Years, You Have Allowed Me To Kill 70,000 People\" Bracketology 2014 Matrix: The Saddest NCAA Pool in America, and Other Bracket News The Walking Dead Season 4 Finale Spoilers: Who Dies, What Happens in Episodes 15, 16? Flappy Bird Game to Return to App Store? Creator <mark>Dong Nguyen</mark> Says Yes, But Not Soon"}, {"articleID": "2015020812_00047505_W", "names": {"Matthew Vaughn": ["Q2593", "Q30524398"], "Jane Goldman": ["Q19959610", "Q29033681", "Q32661"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"], "Sarah Thomas": ["Q13115054", "Q18536428", "Q2224511", "Q3950332", "Q40005", "Q56098806", "Q7422824", "Q7422826", "Q7422827"], "Mark Millar": ["Q2543", "Q6768884"], "Roger Moore": ["Q134333", "Q16856350", "Q18217772", "Q30069648", "Q30069829", "Q30075236", "Q30075241", "Q30075250", "Q30075253", "Q30075265", "Q30083185", "Q30083221", "Q30083238", "Q30083257", "Q30094638", "Q30094640", "Q30094641", "Q30502305", "Q30542705", "Q3439296", "Q3940091", "Q7358135", "Q7358675"], "Michael Caine": ["Q123351", "Q16197877"]}, "date": "2015-02-08", "url": "http://www.smh.com.au/entertainment/movies/kingsman-director-matthew-vaughn-and-writer-jane-goldman-together-again-20150206-137nf2.html", "content": "Register Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Kingsman: The Secret Service. \"itemprop =\" image \"/> Best of British: Colin Firth stars in Kingsman: The Secret Service. Photo: supplied British director and producer <mark>Matthew Vaughn</mark> and screenwriter <mark>Jane Goldman</mark> have worked together on several film projects, beginning with Stardust in 2007 and including their newest, Kingsman: The Secret Service. <mark>Vaughn</mark> says,\" We've written five and a half things, and they have all actually been made into films. \"(The half refers to X-Men: Days of Future Past, which <mark>Vaughn</mark> was hired to direct but ultimately didn't; the two received a story credit .) <mark>Goldman</mark> added,\" It's weirdly unusual. Which actually describes us. \"Eye spy: Colin Firth's secret agent is inspired by <mark>James Bond</mark> and Austin Powers. Photo: <mark>Sarah Thomas</mark> Weirdly unusual or no, <mark>Vaughn</mark> and <mark>Goldman</mark> seem to have a particularly harmonious taste for surreal ultraviolence that is often disturbingly funny and that has earned them a fair share of controversy (especially when they cast an 11-year-old Chloe Grace Moretz as a lethal schoolgirl in Kick-Ass, from 2010). They also share a love for old British spy characters, encompassing <mark>James Bond</mark> and Austin Powers, evident in X-Men: First Class (2011), and at the forefront in Kingsman, a spy spoof, based on a comic book series by <mark>Mark Millar</mark> that is also a homage to the venerable tradition of dapper men who never spill a vintage whisky while dispatching a foe. Advertisement In Kingsman, a youth from public housing named Eggsy (Taron Egerton) is recruited by Harry Hart, a suave secret agent played, obviously, by Colin Firth. (\"The French have wine, the Germans have cars, we have Colin Firth,\" wrote Stuart Jeffries in an article about the film in The Guardian that asked, \"Why must British spies be so posh?\" ) Hart is straight out of the Classic British Spy handbook, complete with bespoke tailored suit, bulletproof umbrella and a neat line in slinging a beer glass. As Eggsy is tested to see whether he is worthy of Kingsman, an independent international secret service, Hart and his colleagues try to unravel the evil plans of a Bond-worthy villain with a Bond-worthy name: Richmond Valentine. Played by Samuel L. Jackson with a lisp and a Russell Simmons wardrobe, Valentine is a tech billionaire who wants to save the world. In his own very, very special way. Kingsman opened in Britain to lukewarm reviews, and even though the film seems to end with the possibility of sequels, <mark>Vaughn</mark>, 53, and <mark>Goldman</mark>, 44, wouldn't say whether anything else was in the offing. \"It's like being about to give birth and being asked if you want another kid,\" <mark>Vaughn</mark> said. <mark>Goldman</mark> laughed. \"Definitely,\" she said. \"We'll be working on something else .\" In an hour-long telephone chat, <mark>Vaughn</mark>, speaking from London, and <mark>Goldman</mark>, calling from Toronto, did reveal: How They Met: \"Neil Gaiman, whose book Stardust was based on, and whom we both knew, somehow thought I'd be a good fit to write the screenplay, even though I had only written books before,\" explained <mark>Goldman</mark>, a former journalist who has written fiction and non-fiction. \"I think <mark>Matthew</mark> met me as a courtesy .\" <mark>Vaughn</mark> denied that. \"Not out of courtesy, out of desperation,\" he said. \"Most screenwriters do scripts as a way of making money, not as a way of making movies,\" he continued. \"I was so relieved to meet someone fresh, with a voice, who I could be in a room with and who didn't drive me mad .\" At the end of their meeting, <mark>Vaughn</mark> asked <mark>Goldman</mark> when she could start. How They Work Together: \"We don't necessarily fall into the complementary areas that people imagine,\" <mark>Goldman</mark> said. \"People think I do the human interest, and he does the crazy violence, but we crossover quite a lot .\" <mark>Vaughn</mark> made assenting noises. \"When <mark>Jane</mark> started writing gangster dialogue in Kick-Ass, I thought it would be a waste of time, but actually her middle name should be Scarface .\" Usually, they agreed, they have similar sensibilities when it comes to the cartoonlike, extravagant violence that has characterised several of their movies. \"I remember ringing <mark>Jane</mark> up and saying,\" We're going to blow everyone's heads up, and it's going to look like Busby Berkeley'; she thought it was a brilliant idea, \"<mark>Vaughn</mark> said. <mark>Goldman</mark> made assenting noises, then added,\" It's actually not gruesome; it's rather visually beautiful. \"Blowing Up People's Heads and Making It Look as if It Were Busby Berkeley Isn't Easy:\" We went to all these CG special effects guys, and they were all about lasers and stuff, \"<mark>Vaughn</mark> said .\" I couldn't make them understand it had to look good. But I knew this genius guy in France, and I told him what I wanted, and he said \"- <mark>Vaughn</mark> adopted a French accent -\" Eez no probleme, give me two days .' \"Occasionally They Do Conflict:\" The dog scene in Kingsman is the first time we've genuinely disagreed with one another for longer than a few minutes, \"<mark>Goldman</mark> said. For fear of a spoiler, suffice to say that Eggsy must make a difficult decision, which she felt was inappropriate for the hero. Eventually she came up with a solution that <mark>Vaughn</mark> liked .\" I love taking the audience down one path and then subverting expectation, \"he said gleefully. They Had Been Thinking About a Spy Movie for Ages:\" <mark>Matthew</mark> has been talking about it ever since we met, \"<mark>Goldman</mark> said, adding that they had talked a lot about the movies they loved when younger .\" <mark>Roger Moore</mark> was technically our <mark>Bond</mark>, \"she said .\" The things you encounter in your formative years always stay with you. \"<mark>Vaughn</mark> agreed:\" I was very aware of that history and referentiality in Kingsman. I call it a postmodern love letter to the tradition. The best part of shooting the film was when we stopped and <mark>Michael Caine</mark> could tell us stories about Harry Palmer, \"he said, referring to the five films featuring the Len Deighton hero in which <mark>Caine</mark> (who plays the Kingsman head, Arthur) is a secret agent. They Thought of Casting Oscar Pistorius: Valentine's sidekick, Gazelle, uses prosthetic lower legs with, er, killer precision .\" That was before the incident! \"<mark>Vaughn</mark> specified .\" I remember watching some event on TV, and I was mesmerised by the blade runners; I thought it was the most exciting thing I'd see for ages, \"he said .\" But we struggled to find the right guy, and I thought why not make it a woman? We cast a great lady who really had prosthetic legs, but she decided not to do it, and I had a moment of doubt. \"Then they found Sofia Boutella, who has a dance background and whose prostheses were created digitally. She\" could really do all the physical stuff beautifully, \"<mark>Vaughn</mark> added .\" As someone said to me, we've created an iconic, cool disabled person. \"50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Lindt cafe siege survivor Harriette Denny reveals moment she faced death in 60 Minutes interview Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Silvia Colloca to lead audience through gallery in modern take on Orpheus tragedy 50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate 50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Not so black and white: Is Selma's Oscars snub racist, or something else? That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate"}, {"articleID": "2009071720_00019774_W", "names": {"Yao Ming": ["Q45563541", "Q45643523", "Q45676966", "Q47495831", "Q58590"], "David Anderson": ["Q1175128", "Q16150074", "Q18572352", "Q20921979", "Q21004823", "Q21403068", "Q27909642", "Q3017380", "Q3017389", "Q3409354", "Q45496094", "Q5230766", "Q5230767", "Q5230768", "Q5230769", "Q5230773", "Q5233911", "Q5235389", "Q5237813", "Q5238291", "Q5240683", "Q57431545", "Q58652056", "Q59150007"], "Charles Barkley": ["Q192707", "Q5077040"]}, "date": "2009-07-17", "url": "http://bleacherreport.com/articles/219572-its-official-yao-ming-will-miss-09-10-season", "content": "my b/r sign up or login to track your favorite teams sign up for bleacher report as a registered user you can subscribe to your favorite teams, post comments, write your own articles, and much more. processing writing preferences...after weeks of close calls and excruciating deliberation, <mark>yao ming</mark> announced to the world today his decision to undergo surgery in his left foot. the surgery, which will be performed next week by rockets' team physician dr.. . (photo by stephen dunn/getty images) after weeks of close calls and excruciating deliberation, <mark>yao ming</mark> announced to the world today his decision to undergo surgery in his left foot. the surgery, which will be performed next week by rockets' team physician dr. tom clanton at the memorial hermann sports medicine institute, will involve a bone graft in the navicular bone of <mark>yao</mark>'s left foot in order to promote bone regeneration. additionally, clanton will also perform a surgical procedure designed to reduce the arch in <mark>yao</mark>'s left foot by realigning and restructuring the bones in the foot. while no timetable has been set for his return to action, <mark>yao</mark> is expected to be available for the team's training camp in 2010. \"this combination of procedures should not only allow healing of his navicular stress fracture, but also improve the mechanics of his foot to reduce the stress on that bone and give him the best long-term prognosis,\" said dr. clanton. \"this surgical option is similar to the successful procedure used by cleveland cavaliers center zydrunas ilgauskas in 2001 .\" <mark>yao</mark> will definitely miss all of next season due to this potentially career altering decision. however, with the midweek acquisition of <mark>david anderson</mark> from the atlanta hawks, the rockets are in a much better position to deal with his damaging absence. move box houston rockets articles <mark>yao ming</mark> to have surgery, will possibly miss all 2009-2010 season houston rockets 87, portland blazers 82, summer league game two recap <mark>yao ming</mark> to have surgery, will possibly miss all 2009-2010 season sign up for our newsletter we'd like to send you great stories about your favorite topics sign me up! we will never share your email address with anyone, for any reason we are a community of fans who write about sports. and we're growing. the top 10 head scratchers of the 2009 nba offseason read more from jockandballs.com tiger trashes <mark>charles barkley</mark>'s golf swing new bachelor tony romo hooks up with every company what teams, leagues, and players do you want to write about? thank you for registering! you will receive an email shortly with login instructions. bleacher report is a community of amateur sports writers. fans (like you) submit articles about the sports and teams you want to cover. the bleacher report team professionally edits the articles, publishes them, and exposes them to millions of readers. hundreds of articles are submitted by users every day. bleacher report publishes hundreds of great sports articles each day. we'd like to send you great stories about your favorite topics...copyright © 2009 bleacher report, inc. all rights reserved. certain photos copyright © 2009 by getty images."}, {"articleID": "2009031702_00048794_W", "names": {"Matt Flynn": ["Q1200152", "Q2698920", "Q47546427"], "Mike Mccarthy": ["Q1933317", "Q21062541", "Q22279122", "Q506866", "Q6847875", "Q6847876", "Q6847877"], "James Jones": ["Q14950321", "Q16467448", "Q1681147", "Q16973415", "Q18637520", "Q18671594", "Q20733323", "Q2074528", "Q22278434", "Q257840", "Q27972777", "Q440332", "Q56597620", "Q56604612", "Q6136948", "Q6136950", "Q6136951", "Q6136955", "Q663453"]}, "date": "2009-03-17", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=191394020&blogId=425194593", "content": "<mark>matt flynn</mark> very likely to become 2nd string qb behind aaron rodgers by tom fanning, packers.com posted 08/14/2008 brian brohm will once again be the second quarterback to enter the game again this week when the packers travel to san francisco, but fellow rookie <mark>matt flynn</mark>'s strong play of late has put him in position to compete for the backup quarterback job behind aaron rodgers. even though brohm was a second-round pick and <mark>flynn</mark> was selected in the seventh round of the 2008 nfl draft, head coach <mark>mike mccarthy</mark> said <mark>flynn</mark> is in the mix for the no. 2 job. \"i think <mark>matt</mark>'s definitely closing the gap, there's no doubt about it,\" <mark>mccarthy</mark> said. \"i think he's really been pushing brian here probably about the last eight to 10 days .\" i think <mark>matt</mark> is getting more comfortable. brian was more comfortable quicker in the earlier part as far as the otas, understanding what we're doing. i think they're both good young prospects. \"neither player put up numbers that jumped off the stat sheet on monday night, but <mark>mccarthy</mark> said both brohm and <mark>flynn</mark> showed some signs of progress .\" just looking at their grades, they did a number of positive things in the game, \"<mark>mccarthy</mark> said .\" they did not have winning performances is the way we look at it, and it's just a number of things we need to clean up. \"i've said it time and time again; (those) guys need to play. we knew this was going to take probably the full preseason to get those two guys ready, and we feel like we're on course to get that done .\" <mark>flynn</mark> entered monday night's game with a 5:27 to go in the third quarter and played five series, and finished the night 12-of-21 for 97 yards and a touchdown. with the packers trailing 20-10 with a little over six minutes remaining in the game, <mark>flynn</mark> led the offense on a 12-play, 62-yard drive that was capped off with an 11-yard touchdown pass to running back kregg lumpkin. <mark>flynn</mark>'s debut included some rough moments, beginning with a sack on his very first play, which he said could have been avoided. \"the things that always stick out in my mind are mistakes,\" <mark>flynn</mark> said. \"i could have made a couple of adjustments on protections. that would have helped out and not got me sacked on the first play. just the little things, reads, being quicker with decisions and things like that .\" despite entering camp as the third quarterback as a late-round pick, <mark>flynn</mark> said his focus has remained on getting better each practice and learning the offense. \"i really don't assume anything,\" <mark>flynn</mark> said. \"i came in here and i didn't really know what the situation was going to be or what it's going to be like at the end of camp. it's one of those things that i am going to go out and play as hard as i can and just let the coaches do their job .\" i look at it like i have an opportunity to come in here and learn how to play the game, learn from some great coaches, learn from aaron, and do the best i can and take advantage of the opportunity. \"<mark>mccarthy</mark> said earlier during camp that brohm has picked up the mental aspect of the game better than any other young quarterback that he has worked with, but against the bengals, brohm wasn't able to put any points on the board monday night in his five series directing the offense. brohm's evening got off to an inauspicious start as well, as he threw an interception on his very first play on as pass intended for wide receiver <mark>james jones</mark>. he finished the night 8-of-17 for 70 yards, but did make a nice throw at the end of the first half when he hooked up with fellow rookie jordy nelson for a 22-yard gain .\" overall i felt like i did a pretty good job of just the mechanics of the offense, getting in and out of the huddle, \"brohm said after the game on monday night .\" most of the time i felt like i went to the right place with the ball. obviously there were a few times where i made mistakes and went to the wrong place, forced one in there on the first play. \"<mark>mccarthy</mark> said the quarterback rotation will remain the same at san francisco on saturday night, and that as of now the number of repetitions that brohm and <mark>flynn</mark> will each receive will stay the same as well .\" we've kept them the same, as far as going through the installation phase, \"<mark>mccarthy</mark> said .\" brian took the reps of the no. 2 and <mark>matt</mark> took the reps of the no. 3. based on the period, 3-2-1 is the ratio, sometimes it was 4-2-1 as far as the starter. now, once we got into this in-season schedule, they split the opponent reps, and brian is still getting a little more work than <mark>matt</mark>. \"on wednesday, general manager ted thompson said even though it is unusual to have two rookies backing up the starter at quarterback, the team is pleased with the tandem's development up to this point .\" i don't know if you drew it up like this is the way you would do it, but this is the way it is, \"thompson said .\" we like our two young guys, and we think they are on a steady path here. quite frankly, our coaching staff likes working with them, so we feel pretty good. \"despite the inexperience at the position, thompson added that the team won't close the door on the possibility of bringing in a veteran at the position, but that it isn't more of a priority than any other spot on the roster. this makes me sad i hope broum gets a better feel for the game thats who i want to see backing up rogers"}, {"articleID": "2015031707_00064959_W", "names": {"Tony Kelly": ["Q16195148", "Q7822698", "Q7822699", "Q7822700", "Q7822701", "Q7822703"], "Paul O'Connell": ["Q2038034", "Q7152770"], "Joe O'Connor": ["Q16197145", "Q52301651", "Q6211592"], "Brendan Rodgers": ["Q19973684", "Q310623"], "John Carver": ["Q1330261", "Q6225403"], "Joe Schmidt": ["Q284169", "Q6280152"]}, "date": "2015-03-17", "url": "http://independent.ie/sport/gaelic-games/hurling/gpa-investigate-plight-of-departed-clare-duo-following-squad-humiliation-31071818.html", "content": "Clare boss Davy Fitzgerald congratulates <mark>Tony Kelly</mark> after his man-of-the-match display against Dublin on Saturday Comments Davy O'Halloran and Nicky O'Connell were apparently disciplined for being on a \"night out' prior to a league fixture last month. A third player is also understood to have been disciplined but has not left the squad and was a visible presence on the day of the Tipperary game though he was not involved. However, O'Halloran stressed over the weekend that he had not been drinking as alleged. He spoke of being\" humiliated \"by what he was asked to do and hit out at alleged double-standards, claiming a more senior player had also broken the disciplinary code set out at the start of the year. However, Clare manager Davy Fitzgerald stressed after Saturday's win over Dublin in Ennis that such an allegation of double-standards was\" 110 per cent \"not true. It has attracted the attention of the GPA who confirmed yesterday that they had begun to explore the matter but were not prepared to make any comment. Realistically, there are few avenues open to the GPA on this matter. Neither player made contact with the players' association, nor did the player representatives bring it to their attention. Instrumental It is understood that the Clare squad members themselves were instrumental in establishing a code of discipline that involved a ban on alcohol consumption at certain times of the season. However, it is not clear if the exact nature of the punishments were agreed upon by the players. O'Halloran has alleged that he and <mark>O'Connell</mark> were forced to train on their own, could not interact with any other squad members, could not wear Clare gear to training and were not going to be part of any match-day squad for the remaining Division 1A games in the league. It is nothing new for players to break agreed codes of discipline and be dropped from squads in the past. However, some of the punishments in this instance, as alleged by O'Halloran, are quite extreme. Donegal's Kevin Cassidy lost his place on the squad for his revealing insight into the their 2011 campaign, the first year of Jim McGuinness' management, in the book\" This Is Our Year'. Last year a prominent member of a football squad was left out for a month of pre-season because he had made critical comments in the media about their previous management. For Fitzgerald and his management, it has been a testing number of months since their exit from the 2014 championship. He lost highly respected coach Paul Kinnerk and another valued member of the backroom team, strength and conditioning coach <mark>Joe O'Connor</mark>, after last season. Kinnerk had a big influence on shaping the style that Clare developed to win an All-Ireland title in 2013 and three All-Ireland U-21 hurling titles from 2012 to 2014. He built up a great rapport with the younger members of the squad and they may have felt his absence in recent months. The Clare management's position not to embrace dual players forced Podge Collins to make a choice and he opted for his father Colm's football squad. Apart from his obvious skill set Collins was a popular member of the Clare squad and his absence has also been felt in that respect. But if morale has been in any way dented by O'Halloran's revelation, it certainly wasn't apparent when Clare hauled themselves from six points down against Dublin with 14 men after Brendan Bugler's dismissal to win by two. That will certainly have heartened Fitzgerald. Bugler's tweet afterwards about \"togetherness\" didn't point to a squad that's about to fragment. Meanwhile, Lar Corbett has confirmed his future as a Tipperary hurler is in doubt because of ongoing knee problems. Corbett is not currently part of the Tipperary squad as he battles the injury. \"The knee has been an ongoing problem. I honestly don't know one way or another. I'm doing a bit of work myself - that's just the way it is. I'll have to see how it is over the next month. I'll know then,\" he said. Corbett was troubled by a similar complaint last year and missed the Allianz League campaign. \"It's the same problem as last year. That's just the facts of it. I'll have to deal with it. If I get over it, I get over it, if I don't, I don't,\" he said. No end to Shefflin's hunger in most decorated career of all Colm Keys There surely isn't a better example to encapsulate the drive in Henry Shefflin than his decision to forego a team holiday with Kilkenny in Florida last December, possibly his last with a group of players that...Mulcahy eyes \"milestone' title for Limerick hurling Until this year, Kilmallock's Graeme Mulcahy assumed someone from Limerick had been to the top of the tree in the club scene. Experience can take Shamrocks to sixth club title Tipp edge Kilkenny closer to drop zone Clare hurling boss Davy Fitzgerald cuts RTE interview short after he was quizzed about...Bennett leads Deise rout to step up push for promotion Defiant Davy Fitzgerald spared by spirited comeback Rebels survive dramatic finale to book quarter-final spot POLL: The water charges have been revealed - do you intend on paying the...Woman set to become Ireland's youngest granny - aged 29 150 Shades of Green: Global landmarks light up for St. Patrick's Day Soapbox: Here's what matters to Enda and his ministers Cheap health cover forcing patients on to waiting lists\" We can't pretend we're all the same, this equality debate is losing that' - Senator Fidelma Healy Eames defends controversial same sex marriage tweet Lucinda Creighton slams RTE interviewers after Late Late grilling Woman set to become Ireland's youngest granny - aged 29 What do Ireland need to do to win the Six Nations? Final day permutations Welsh rugby legend praises one of the greatest games he has ever seen <mark>Rodgers</mark> targets top two Liverpool manager <mark>Brendan Rodgers</mark> has targeted a top-two finish in the Barclays Premier League after seeing his side...Smalling: United can overhaul City Chris Smalling insists Manchester United are capable of overtaking bitter rivals Manchester City...Sense of purpose driving Slaughtneil's bid for glory It's not a feeling of invincibility, but after all the late drama and one-point victories en route to the AIB All-Ireland club football final, there is a.. . McGinley's fingers crossed that Tiger turns up at Augusta and takes spotlight off McIlroy TIGER WOODS will do Rory McIlroy a favour if he tees it up at...Deal gives Rory licence to print money, time to thrill RORY McILROY crossed a major career threshold last night with the announcement that he has...Atletico Madrid on brink Hard WORK is the only way Atletico Madrid can end a poor run of form as they battle to stay in the Champions League,...Atletico want to take back Chelsea's Luis Filipe Luis could be offered a quick return to Atletico Madrid with the Spanish club...Silva drawing inspiration from Schalke's Madrid heroics \"La SEMANA MAGICA\" read La Vanguardia's headline yesterday, above a piece...Rice backs Hoops' midfield stars to bring good times back to Tallaght Gus Poyet has been sacked by Sunderland, with just nine games of their faltering Premier...VIDEO: Everton 3-0 Newcastle: <mark>John Carver</mark> unsure about Coloccini's red card Newcastle's caretaker manager <mark>John Carver</mark> admits that he is...VIDEO: Celtic see off Dundee United in Scottish League Cup final Ronny Deila captured his first trophy as Celtic manager as...VIDEO: Jose Mourinho bemoans penalty decision Chelsea boss Jose Mourinho believes a wrongly-awarded penalty in the 1-1 draw with...VIDEO - Reddan: \"It's all about the Scotland game now' Leinster & Ireland scrum half Eoin Reddan spoke after the defeat to Wales. VIDEO:\" It's one of the best feelings I've ever had in a Wales shirt' - Sam...Man of the match and Wales captain Sam Warburton said the...VIDEO - <mark>Schmidt</mark>: \"If you throw the baby out with the bath water, it's hard to start all...Ireland coach <mark>Joe Schmidt</mark> and captain <mark>Paul O'Connell</mark> gave...VIDEO: We were screaming for the ball out wide - Tommy Bowe Ulster & Ireland winger Tommy Bowe spoke after the...VIDEO: Six Nations Report -\" Ireland not clinical enough at the moment' Ireland's Grand Slam dreams were shattered in the Millennium...VIDEO: Manuel Pellegrini insists Manchester City players won't intimidate referees Manchester City manager Manuel Pellegrini insists his players will...Kai Rooney lines out for Manchester United as club mascot In Pictures: Irish Independent My 1000 hours 5/10k run In Pictures: Cricket World Cup South Africa v Ireland #IREvENG #6Nations: The best images from Ireland vs England at the Aviva Stadium, Dublin Ireland vs England Six Nations - Classic pictures from the archives Gallery: 20 pics from the night England thugs rioted in Lansdowne Road By using this website you consent to our use of cookies. For more information on cookies see our"}, {"articleID": "2018101918_00084324_W", "names": {"Karen Phillips": ["Q27043974", "Q3812973"]}, "date": "2018-10-19", "url": "http://feeds.cbsnews.com/~r/CBSNewsNational/~3/R8sbbOXVCsE/", "content": "Kierra Coles CBS Chicago Share Tweet Reddit Flipboard Email Police suspect foul play in the disappearance of Kierra Coles, a 26-year-old pregnant postal worker who went missing about two weeks ago. Coles, 26, was last seen on Oct. 2 in the Chatham neighborhood, CBS Chicago reports. She is three months pregnant with her first child. \"Based on the length of time of Kierra Coles' disappearance and the fact that she has fallen off the grid, police suspect possible foul play,\" the Chicago Police Department told The Associated Press. \"We continue to get leads and are following up diligently on those leads .\" Surveillance video from the South Side neighborhood shows Coles walking past her car in her U.S. Postal Service uniform, even though she had called in sick that day, WLS TV reports. Coles' mother, <mark>Karen Phillips</mark>, called police to report her missing two days later. She said she became concerned that her daughter hadn't called her and that her calls to her daughter's number went straight to voicemail. Police went to Coles' home to conduct a well-being check and didn't find her, but saw that her car was parked out front. \"She wouldn't go this long without talking to me,\" <mark>Phillips</mark> told WLS TV. She said when the two did talk on Oct. 2, her daughter told her how happy and emotional she was to hear her baby's heart beating. \"We talk every day. She wouldn't have me worrying like this .\" The U.S. Postal Service has offered a $25,000 reward for information on Coles' whereabouts and is assisting in the investigation into her disappearance. © 2018 CBS Interactive Inc.. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. Share Tweet Reddit Flipboard Email"}, {"articleID": "2012060209_00004391_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Brian Rogers": ["Q4965158", "Q4965159"], "Steve Schmidt": ["Q7613866", "Q7613869"]}, "date": "2012-06-02", "url": "http://kentucky.com/2012/06/02/2209486/obama-nostalgic-for-a-gop-opponent.html#storylink=rss", "content": "would politics be better if someone like john mccain were running for president? president barack obama seems to think so. in a case of strange bedfellows in american politics, obama and his re-election advisers are waxing nostalgic for the man the president defeated last time around. they're embracing mccain as a reasonable voice on climate change and immigration, someone who took on extremism in his own party. it's all a way of drawing a contrast with obama's current republican presidential opponent, mitt romney, and trying to convince crucial independent voters that the gop challenger is outside the mainstream. but the president's flattering memories of mccain conflict with their campaign clashes of 2008. back then, obama hammered his rival as \"out of touch\" with many of the problems facing americans. and the platitudes of today conceal the reality of obama's current dynamic with mccain. the arizona republican remains one of the president's staunchest critics on everything from health care to foreign policy. he's also a vocal romney supporter. to hear obama tell it now, the mccain who ran against him in 2008 was an example of a principled republican who knew how to reach across the aisle. the implication from obama is that those qualities simply don't apply to romney. \"john mccain believed in climate change,\" obama told supporters at a fundraiser in minneapolis friday. \"john believed in campaign finance reform. he believed in immigration reform. i mean, there were some areas where you saw some overlap. in this election, the republican party has moved in a fundamentally different direction .\" obama's riff on mccain has become a standard part of his fundraising appeal to donors. and as the general election heats up, the obama campaign is relishing more opportunities to try to turn its former foe into an asset. when romney didn't condemn his supporter <mark>donald trump</mark> for raising more questions this week about the president's citizenship, the obama campaign dug up old video clips of mccain correcting supporters in the 2008 who said they were scared of obama and one clip of a supporter who thought he was an \"arab .\" \"as the republican nominee, john mccain stood up to the voices of extremism in his party,\" an obama internet video says. it then asks why romney won't do the same. the 90-second video ends with words on the screen that read: \"mccain and romney: two republican nominees, only one willing to lead .\" <mark>brian rogers</mark>, a spokesman for mccain, said friday that if mccain and obama \"share so many priorities and are in such agreement, why didn't the president or his staff ever reach out to senator mccain to work on them?\" not surprisingly, veterans of the 2008 campaign are split down party lines over whether the 2012 obama campaign's strategic embrace of its former rival makes sense. \"they're not announcing that they're embracing all of (mccain's) positions on issues,\" said jennifer psaki, a former obama white house official who also worked on the president's 2008 campaign. \"but they are highlighting the standards that john mccain held himself to that mitt romney has not .\" <mark>steve schmidt</mark>, a senior strategist to mccain's 2008 campaign, said voters will see through the obama team's attempts to use the former gop nominee to paint the party's current standard-bearer as an extremist. \"it's very difficult to make the case that mitt romney is a right-wing nut, particularly because a lot of real right-wing nuts have spent a lot of time saying romney's not one of them,\" <mark>schmidt</mark> said. like romney, mccain faced criticism from democrats in 2008 who said the independent-minded senator had kowtowed to the conservative wing of the party in order to claim the gop nomination. the nearly four years since obama and mccain's electoral face-off have been filled with interactions that the president probably won't be bringing up at campaign fundraisers or using in a campaign video. in a meeting during the 2010 health care debate, mccain criticized how democrats were constructing the legislation. obama cut him off, saying \"we're not campaigning anymore. the election is over .\" mccain responded: \"i'm reminded of that every day .\" the longtime arizona senator has also been one of the harshest critics of the president on foreign policy matters, often arguing that the president is being too passive. in recent days, mccain said it was \"embarrassing\" that the united states wasn't doing more to stem the bloodshed in syria. the obama and mccain conflicts aside, <mark>schmidt</mark> said he's not surprised to see his former boss back in the electoral mix: \"the last guy is never more popular than after there's a new guy .\" "}]