[{"date": "2014-11-20", "url": "http://www.modernghana.com/news/582121/1/stephen-akwetey-to-invest-gh1-million-into-health-.html", "content": "The Former Greater Accra Regional Chairman Aspirant of the National Democratic Congress NDC, Stephen Akwetey has reiterated commitment to invest in the ongoing project he outlines, as part of the promises he made towards the campaign. At a news conference in Accra, he stated that since health and education plays a vital role towards the development of Ghana an amount of Gh 1 million has been allocated to these sectors because this fund is meant to care for the needs of brilliant but the poor party activists and their dependents. The funds which operate independent of the leadership of the region, he said will be managed by a board which be out - doored and inaugurated soon. Followed by a comprehensive training seminar for all constituency executives in the order to properly orient all stakeholders on the utilization of the fund. He touched on the ongoing construction of the constituency offices with respect to the current Shai-Osudoku site, inasmuch as the Obom-Domeabra site has received building equipment to begin work with land title and other necessary documentation for the other constituencies are being processed. Stephen Akwetey emphasized on the one thousand acres of land for Agriculture business which is intended to offer the constituencies the opportunity to raise funds for the running of their offices and the party's activities. He stressed on the need to create more jobs for party activists in all constituencies though there is ongoing registration of business entities for the purpose also giving respectable incomes to the people. Again as part of his project which is the youth and women movement agenda as a programme intended to into the collective energies of all constituency and branch youth organizers and their colleague branch and constituency women organizer to create a mass, vibrant and influential youth and women movement. On the integration of TEIN members into constituency activities, he said this programme aims at ensuring that the members of the Tertiary Educational Institutions Network (TEIN) of the NDC on various campuses are properly drafted and integrated into their respective constituencies and branches after their courses of study. \"That notwithstanding, let me assure all members of the NDC in the Greater Accra region that for the first in our political history, I, Comrade Stephen Akwetey will continue with all the projects I have started, even though I did not win the election\" He, therefore, called on ranking members and all to fully lend their support and commitment to the president, his excellency John Dramani Mahama as he embarked upon the Better Ghana Agenda to improve the socio-economic conditions of the people in the these country. 20-11-2014 We Need To Be Disciplined - Lee Ocran Charges Ndc Members 19-11-2014 Minority Walked Out Of Parliament Over 17.5% Petroleum Tax 19-11-2014 Everybody In Mahama's Government Is A \"<mark>king Kong</mark>' - Kwesi Pratt 19-11-2014 2015 Budget: A Lame Duck Budget From A Lame Duck Gov' t - cpp 19-11-2014 Minority Vows To Resist 17.5% Petroleum Tax 19-11-2014 Npp Borrowed $5.5 bn In 8yrs, Ndc $27bn In 6yrs - Bawumia Stokes Debt Debate 19-11-2014 Cocaine Bust Saga: Npp Will Politicize Issue, Expose Ndc Drug Barons--Agyarko 19-11-2014 Northern Npp Youth Caucus Congratulates Mustapha Salam 18-11-2014 Speaker, Mps Isolate Daboya Mp Over\" alomo Jata' Comment 18-11-2014 Daboya Mp's Comment Is An Act Of Terror - 31st Dwm 18-11-2014 Npp Borrowed $5.5 bn In 8yrs, Ndc $27bn In 6yrs - Bawumia 18-11-2014 Afari-gyan Should Be Allowed To Supervise 2016 Elections - kennedy Agyepong 18-11-2014 Ade Cokers Incompetence Hurting Ndc - former Lekma Mce 18-11-2014 Daniel Amartey Suspects foul Play In Ndc Election Defeat 18-11-2014 Ndc Needs Kofi Adams To Restore lost Integrity - rawlings 18-11-2014 Rawlings Still Relevant To Ndc - lecturer Argues 18-11-2014 New Npp Appointments: Nana Akomea Made Director Of Communications Again 18-11-2014 Tawiah Boateng Elected E/r Ndc Chair; Oliver-kevor Gets Secretary 18-11-2014 General Mosquito Defends $20m Ndc Office 18-11-2014 Ndc Boys Chase Ministersoldiers, Police Rescue 17-11-2014 Divisive Tactics Might Cost The Npp - Concerned Npp Youth 16-11-2014 Ndc Tamale Organiser Assaulted Me - Minister 16-11-2014 Angry Ndc Youth In Tamale Demand Removal Of Regional Minister 15-11-2014 Allotey Jacobs Wins; Ade Coker Retained In Ndc Regional Elections", "articleID": "2014112018_00001021_W", "names": {"King Kong": ["Q2171232", "Q22278621", "Q6411824"]}}, {"date": "2014-11-21", "url": "http://upi.com/Top_News/World-News/2014/11/21/Peeping-Tom-Russian-hackers-streaming-stolen-webcam-scenes/9581416549859/?spt=hts&or=20", "content": "World News \"Peeping Tom' Russian hackers streaming stolen webcam scenes Brazen Russian hackers are hijacking office and home computer webcams in 250 countries and streaming the private scenes live on a website, officials have revealed. Footage from webcams in bedrooms, nurseries and in gyms are being shared with thousands of listed on the site, the website features 4,591 feeds from the U.S., 2,058 from France, 584 from the U.K., as well as 563 from Hong Kong and 182 from China. Officials in several countries are urging webcam owners to change their passwords to block access to the hackers .\" We have got to grow up about this sort of thing, \"said British Information Commissioner <mark>Christopher Graham</mark>.\" These devices are very handy if you want to have remote access to make sure your child is OK, or the shop is all right, but everyone else can access that too unless you set a strong password. \"The website has been operating for about a month, beginning in Hong Kong, then Australia and Canada. Ukrainian political parties sign coalition agreement Brent rises in response to Chinese data D.C. press corps, clean yourself up for the royal visit Scientists sequence brain-dwelling tapeworm Biden to push Ukraine PM to form government ABOUT UPI Since 1907, United Press International (UPI) has been a leading provider of critical information to media outlets, businesses, governments and researchers worldwide. UPI is a global operation with offices in Beirut, Hong Kong, London, Santiago, Seoul and Tokyo. Our headquarters is located in downtown Washington, DC, surrounded by major international policy-making governmental and non-governmental organizations. UPI licenses content directly to print outlets, online media and institutions of all types. In addition, UPI's distribution partners provide our content to thousands of businesses, policy groups and academic institutions worldwide. Our audience consists of millions of decision-makers who depend on UPI's insightful and analytical stories to make better business or policy decisions. In the year of our 107th anniversary, our company strives to continue being a leading and trusted source for news, analysis and insight for readers around the world. Privacy Policy © 2014 United Press International, Inc.. All Rights Reserved. UPI.com is your trusted source for world news, top news, science news, health news and current events.", "articleID": "2014112115_00054412_W", "names": {"Christopher Graham": ["Q21165674", "Q5112420"]}}, {"date": "2014-11-21", "url": "http://news.ubc.ca/2014/11/21/vancouver-whitecaps-fc-launch-new-usl-pro-team-and-provide-update-on-national-soccer-development-at-ubc/", "content": "Preliminary rendering of the proposed state-of-the art fieldhouse at UBC by Acton Ostry Architects and BBB Architects. Soccer fans in Metro Vancouver will soon have a new professional team to cheer for. Whitecaps FC announced on Friday the launch of Whitecaps FC 2 (WFC2), the club's USL PRO team that will begin play in the spring of 2015. WFC2 will be owned and operated by Whitecaps FC and will play all home matches on the David Sidoo Field at Thunderbird Stadium, a natural extension of the club's training home at the University of British Columbia: the National Soccer Development Centre (NSDC) In partnership with UBC and the Government of British Columbia, the club also revealed preliminary renderings of the final phase of the NSDC, featuring a state-of-the-art fieldhouse (subject to final UBC Board of Governors approval), which is set to be completed prior to the start of the 2017 Major League Soccer (MLS) preseason. The fieldhouse is being designed by Acton Ostry Architects, an award-winning architectural firm based in Vancouver, in collaboration with BBB Architects, internationally recognized sports architects who recently completed the Kia Toronto FC Training Ground & Academy. In total, the multi-campus NSDC includes seven fields - two artificial turf fields at <mark>Simon Fraser</mark> University, and three grass and two artificial turf fields at UBC. \"Today marks another important milestone for our club and another step forward in our partnership with UBC,\" said Whitecaps FC president Bob Lenarduzzi. \"We're thrilled to be launching our USL PRO team at UBC. We have many talented young players at our club, including nine Residency products who recently did very well internationally with our Canadian U-20 men's national team. WFC2 will allow them to continue their development against quality competition, including our fellow Cascadia rivals from Seattle and Portland. Along with the renderings of our new training facility, we have a clear view into our future. These initiatives will provide a positive impact and lasting legacy for Whitecaps FC, Canadian soccer, UBC, and the community at large .\" \"This partnership with Whitecaps FC and the provincial government will allow for a greater student and community participation in field sports and will provide exceptional experiences for soccer fans,\" said UBC president <mark>Arvind Gupta</mark>. \"Having Whitecaps FC and varsity soccer programs here at UBC will inspire our students to pursue their passions and will further strengthen our successful Athletics program .\" Whitecaps FC 2 matches will be a unique, affordable experience for soccer fans, families, students, and supporters. The club is now accepting $50 deposits on season tickets, which start at $118 plus applicable fees - just $8 per match - for current MLS season ticket holders and the UBC campus community including residents, students, staff, and faculty. A limited supply of family packs are also available, starting at $199. For more information on all ticket options go to whitecapsfc2. com or call 604.669.9283 ext. 1. Fans who act now will also join the WFC2 Starting 11, recognizing the starting 1,100 season ticket holders of the inaugural WFC2 season and guaranteeing the lowest season ticket price for every future season. Starting 11 members will be provided exclusive rights such as voting on which kit the team will wear for each (home) match, winning a jersey off the back of a player, and two additional ambassador tickets to share with friends or family who have not attended a WFC2 match. As a bridge between the club's Residency program and MLS first team, WFC2 will replace the club's U-23 team and allow promising young players to develop in a competitive professional environment. Whitecaps FC are the seventh MLS club to officially field a team in USL PRO for the 2015 season, joining Cascadia rivals Portland Timbers (T2) and Seattle Sounders FC (Sounders FC 2), as well as LA Galaxy (LA Galaxy II), Montreal Impact (FC Montreal), Real Salt Lake (Real Monarchs), and Toronto FC. All MLS clubs are expected to either field their own team or have an affiliate in USL PRO next season. In September 2012, Whitecaps FC, UBC, and the B.C. government announced a joint initiative to construct and operate a shared-use soccer training facility at UBC. In February 2013, an improved grass field and locker room access was completed. In addition to Whitecaps FC's MLS team, the NSDC will become the permanent training home for the club's USL PRO and youth sides, as well as UBC's varsity teams, student recreation participants and community partners. Once completed, the NSDC at UBC will include five constructed, refurbished, and improved fields - three grass and two artificial turf - as well as the new 35,000 + square foot fieldhouse. The high performance training centre will create important recreational and high performance sports legacies for the UBC community, providing a major upgrade in facilities, including washrooms, change rooms, multi-use space, concessions, and classrooms. The NSDC will provide not only Whitecaps FC and UBC with state-of-the-art facilities and fields, but will be accessible to recreation leagues from across the city. The project is well underway with the near completion of UBC's Varsity Turf Field now located at Wolfson West Field. \"This world-class facility will be a hub of community activity for recreational, competitive and professional soccer players,\" said Coralee Oakes, minister of community, sport and cultural development. \"The centre will also be a tremendous draw for future hosting opportunities at a time when sport tourism is the fastest growing segment of B.C.'s tourism industry .\" Click here for the renderings of the proposed fieldhouse. For more information and news about WFC2, visit the official website at whitecapsfc2. com", "articleID": "2014112119_00053563_W", "names": {"Arvind Gupta": ["Q18043985", "Q3633965", "Q4802480"], "Simon Fraser": ["Q12058068", "Q19043594", "Q21457277", "Q4492612", "Q55834851", "Q7518792"]}}, {"date": "2014-11-23", "url": "http://examiner.com/article/olympian-manteo-mitchell-is-a-fit-dad-who-encourages-children-and-their-parents", "content": "Manteo Mitchell thinks parents have the most impact on their children's healthy eating habits. Photo by Christian Petersen/Getty Images may train all year for a race that lasts a mere forty-four seconds, but he's also working to extend his life expectancy while bettering his mental and physical health. Mitchell spoke with Examiner on Thursday night, November 22, 2014 about his life as an elite athlete, family man, and motivational speaker. RUNJUMPTHROW event sponsored by USA Track & Field and Hershey's. Mitchell was an ambassador for SUBWAY ®'s Fit For Life campaign. USA Track & Field partnered this fall with local SUBWAY ® restaurants in parts of North Carolina, South Carolina and Georgia, encouraging kids to get active and stay healthy through the SUBWAY ® \"Fit For Life Challenge\" program. Aimed at elementary and middle-school students, the Fit For Life Challenge promotes health habits during a two-week challenge taking place in October, dubbed \"Fit-tober .\" Mitchell, a 2012 Olympic silver medalist, studied health and fitness, and sees the benefit of good eating habits and physical activity for everyone. I have a sports management, Bachelor of Sciences degree. I know the business of sports, the education of sports, and the actual physical activity of sports. I go to these schools and I like to pick the brains of physical education teachers. I want to know if they are actually educating the children and helping them develop fine motor skills, increasing blood flow, and advancing brain activity. I go to some schools and they are actually doing these things that promote healthy brain activity and good blood flow. This actually helps the teachers. If your blood is flowing well, and you have exceptional brain activity, you're going to be more attentive in class. At some schools, they have what I call \"roll the ball out coaches .\" They just roll a ball out, take attendance, and let the kids do what they want to do for thirty minutes .--Mitchell Examiner spoke exclusively, with Mitchell about developing healthy kids, and balancing his busy schedule: One in every three kids is classified as obese or overweight, and we need to decrease that stat, or better yet eliminate it. It's really, really hard to do, but I really believe that it starts in the home. You learn how to say, \"yes ma'am\" or \"no ma'am,\" that starts in the home. [Parents] can't teach it when kids get to high school, if you didn't teach it when they were a baby or were growing up. It's a habit. That's where the whole food intake process happens. It's a habit that you have to establish. It could take a while. I know when I'm in the off-season, I have my days where I will go eat what ever I want. But, when you come back to training it is so hard to get back, and adjust it. It takes one or two weeks for me to actually get adjusted and know,' I can't eat this...I can't eat that .' It's just a learning phase. Some parents don't think much about the way children eat because children can be extremely picky. Fighting over dinner can be stressful. So, letting a child eat whatever makes him or her happy is often the easier route. However, it may not be the healthiest. It is imperative that parents model healthy behaviors for their children. Kids are so young, right now and they have so much time. Usually their metabolisms are so high that they don't really have to worry about not eating certain things. But, it would be so good if they did because it would enhance their performance so much, just like it would an elite athlete. Like I said it starts in the home. We need to educate not only the kids, but the parents as well. You know, usually what ever the parents are eating, the kids are eating. Mitchell, who holds a Masters in Physical Education from Western Carolina University, isn't on a special diet, but does have a nutritionist to help him with planning meals and making appropriate dietary decisions. I'm not the type where I'm going to count all my calories, I don't have time for that. I barely have time for myself. Mitchell's two-year-old son, Khi, briefly joined the phone conversation, which led to a discussion of Mitchell's ability to manage his career with his life as a family man: My entire family understands that I'm more than just an athlete. I actually travel all over the world doing motivational speaking for little kids to Fortune 500 companies, and all these different things. They understand that my time is priceless. Time is something that is on everybody's wish list. So, they understand. My son is two, and I've been doing these speaking engagements since before he was born. I'm pretty sure he knows that when daddy doesn't come home, I'm taking care of business. I'm trying to secure his future, my lady's future, and my family's future. They understand. I know it gets rough sometimes. It gets rough for me too, knowing that I'm in another country or another state, and I can't go next door or go to the room and see him when I get there. When we get back, we always make sure we spend a lot of time together. Just like now, we'll have the whole weekend together, then daddy's back to business again. They understand what it takes...the hard work and dedication. The end result is we get to do cool stuff, like go on vacations, so they understand. @ manteomitchell on Twitter or Instagram, you will see him with Khi taking in a football game at Mitchell's former high school, Crest High in Shelby, North Carolina. Mitchell is extremely focused on heath and wellness outside of the track & field arena, as he feels good nutrition combined with physical fitness can extend your life expectancy and add enjoyment to your life. Sex expert in Jodi Arias trial heats up courtroom, credibility under scrutiny Black Friday 2014 deals: Walmart price matching sales early on HDTVs, PS4 The Black Friday deals are starting early, as in tomorrow! While many retailers such as Target and Best Buy are gearing up for great in store and online sales next week, it seems the Walmart Black...Keystone XL pipeline: Will it hurt the fracking industry in Colorado? Sex expert in Jodi Arias trial heats up courtroom, credibility under scrutiny Jodi Arias trial paused as defense files motion to dismiss death penalty...again Top 8 songs to help you express your feelings when you don't have the words Emergency halts Jodi Arias trial, supporters hold hope Jodi is home by Christmas Teacher drags student to pool: WATCH as Calif. teacher manhandles student, 14 <mark>Adam Levine</mark> rips Taylor Swift: Tension on \"The Voice?' Talks Spotify music pull Ricardo Javid Lugo 12-year-old? Teen poses as 12-year-old to lure kids to abuser Family of little girl attacked by dog calls their pit bull a hero Teresa Giudice drops weight from constant worry over jail sentence Tapeworm in brain: Man's brain hosts tapeworm, claustrophobia one odd symptom Yoga pants camera butt: 59 faces ogling woman's butt in strange video campaign Teacher drags student to pool: Video of P.E. teacher\" grabbing' female student Mario Williams plows Kelly's driveway, delivers food to snowed in neighbors", "articleID": "2014112302_00032393_W", "names": {"Adam Levine": ["Q219631", "Q37840339", "Q4679401"]}}, {"date": "2014-11-24", "url": "http://londonderrysentinel.co.uk/news/local-news/lawyer-asks-court-to-jail-client-for-his-own-good-1-2090941", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Derry City: Duffy to have trial at Celtic' I was hooded and tortured by the British army' Linfield tracking Institute striker O'Flynn Ex-Institute boss helps Manchester United legend A DEFENCE lawyer urged Limavady's Resident Magistrate to save his client's life by sending him to prison on Wednesday. Colm Curran, aged 34, of Main Street, Ballykelly, had admitted stealing a tray of meat worth 7.48 from the village's Centra store on February 2. According to his solicitor, Peter Jack, he had committed that offence while on bail for stealing tinned goods worth 1.60 from a Spar supermarket on November 6 last year. According to Mr Jack, the pattern remained the same: Curran spent all his money on drink, leaving nothing for food and heat, then went to shops where he was well known and easily recognised and stole food in full view of staff. \"He's drinking himself into an early grave,\" the solicitor said. Mr Jack told RM Eamon King that Curran was already subject to up to five suspended prison sentences for similar offences and said: \"It may well be that a prison sentence now may be the best thing for him .\" And he told the court that there were no internal doors at Curran's house - they'd all been used as firewood. Asking Mr King to impose all the sentences concurrently, Mr Jack added that he hoped Curran would go to Magilligan Prison, making it easier for his family to visit. Jailing Curran for a total of six months, the magistrate said: \"The only issue is what effort Colm will make. Maybe he hasn't gone that far down .\" A TEENAGE couple embarked on a three-month-long series of car offences during which they were repeatedly caught by police, Limavady Magistrates Court heard on Wednesday. Danielle Gibbons, aged 18, and 19-year-old Nicholas Huston, both formerly of Main Street, Ballykelly, but now said to be living in Limavady, pleaded guilty to a series of charges involving numerous counts of driving without insurance, R-plates or an MoT certificate and failing to produce documents when required by police. PSNI Inspector Barry Collins said the first incident had been at 1.05 pm on August 31 last year when Mr Huston was stopped driving a Renault Clio through Ballykelly. Miss Gibbons was in the passenger seat and confirmed ownership of the vehicle but neither could produce their insurance or driving licence at the time. Then, at 11.30 pm on September 15, the couple were found with the car parked in Alexander Road, Limavady, after it had been seen driving along Edenmore Road earlier that evening. On this occasion, they admitted that the car was not covered by insurance or an MoT certificate. The following night, the Clio was stopped in Main Street, Ballykelly, with Miss Gibbons driving. She again confirmed ownership and admitted to not having insurance or being able to produce a driving licence. Inspector Collins said the teenager made a similar admission when stopped in Catherine Street, Limavady on September 30, telling police at the time: \"There's not much I can say .\" Mr Huston was driving along Glenhead Road, Ballykelly, with Miss Gibbons in the front passenger seat, when the Clio was stopped at 5.10 pm on October 2 - again for no insurance. Just five days later, his girlfriend was at the wheel of the Clio as it drove along Main Street, Ballykelly, turning into Plantation Road. This time, she admitted still not having insurance and once again failed to produce her driving documents. But the next day she was caught driving along Limavady's Main Street, at 12.30 am. When stopped, she admitted not having insurance, R-plates and failed to produce a driving licence. Officers next saw her driving the Clio along Greystone Road, Limavady, on October 28. However, she turned off onto Scroggy Road and accelerated away from the scene. According to the inspector, more than a month went by before Miss Gibbons was seen driving the Clio again - along Ballykelly's Main Street, turning onto Glenhead Road, at noon on November 30. Police interviewed her on December 6, when she admitted driving without insurance or R-plates. Defending, Johnny Sandhu said: \"The car has now been sold .\" The solicitor added that both his clients were in receipt of 44.50 a week through the New Deal work experience scheme and neither had considered the incidents to be of a serious nature. However, Resident Magistrate Eamon King told the couple: \"The record does either of you no credit at all .\" Disqualifiying both from driving for a total of two years over the insurance offences, he conditionally discharged them for two years on the other matters. The magistrate added that if either of them were caught behind the wheel of a car during that time they would be arrested and could expect to receive custodial sentences. Alcoholic A MAN with a history of alcohol-related offences threatened to kill himself after being arrested, Limavady Magistrates Court heard on Wednesday. Glenn Connor 25, of Caman Park, Ballykelly, had admitted stealing six air fresheners, to a total value of 8.34, from the Centra store in Main Street, Ballykelly, on January 2. PSNI Inspector Barry Collins said Connor was spotted walking out of the supermarket and, when apprehended for the offence and cautioned, said that he was going to kill himself. Defending, Johnny Sandhu said Connor had spent time in custody during 2005 and 2006 and had also been a patient at Gransha, He told Resident Magistrate Eamon King: \"He is a man with difficulties, who abuses alcohol .\" Imposing a three-month prison sentence, which he suspended for one year, the RM told Connor: \"If you have problems, it's up to you to seek help and get them sorted out .\" Abusive A MAN turned on police after challenging pub doormen to a fight, Limavady Magistrates Court heard on Wednesday. <mark>David James</mark> McFaul, aged 25, of Rose Park, Limavady, admitted disorderly behaviour outside the Corner Bar in Limavady town centre shortly after midnight on December 3. PSNI Inspector Barry Collins said McFaul and another man had been verbally abusing the door staff and challenged them to a fight. When police arrived the pair moved off but McFaul then started abusing police and shouted an obscenity in one officer's face. According to defence solicitor Johnny Sandhu, McFaul became aggressive when the other man - his brother - was arrested for assault on police. \"It was a short incident, with the drink in,\" he said. Resident Magistrate Eamon King replied: \"Short incident, short response - 150, with eight weeks to pay .\" Dog A PENSIONER has promised to keep his dog on a lead after it attacked a member of the public, Limavady Magistrates Court heard on Wednesday. <mark>James</mark> O'Kane, of Grange Park, Limavady, had admitted not having the pet under control when he walked it near his home, along the Blackburn Path, on August 17 last year. Joanne Carmichael, prosecuting on behalf of Limavady Borough Council, said the pensioner had admitted he was in charge of the dog but allowed it to run free along the path. Mr O'Kane said he heard a scream but did not see the dog bite anyone and promised Resident Magistrate Eamon King that it would be kept on a lead in future. The RM imposed a 12-month conditional discharge and ordered the pensioner to pay a total of 94 in costs. Overtaking A DRIVER did not notice his speed when he overtook a slow-moving vehicle in Glenshane, Limavady Magistrates Court heard on Wednesday. PSNI Inspector Barry Collins said Andrew McKnight, aged 42, of Durham Park, Londonderry, was doing 90.55 mph when he went through a radar trap near the Ponderosa pub at 9.30 pm on November 12 last year. Defending, Johnny Sandhu said his client admitted exceeding the 60mph limit in the overtaking lane but had been aware how fast he was going. He added that Mr McKnight needed to drive for his 50,000 per annum job that involved him driving approximately 35,000 miles each year. Resident Magistrate Eamon King imposed a 150 fine and three penalty points. Bricklayer A BRICKLAYER started to dismantle a wall outside the Gorteen House Hotel after being ejected from its nightclub, Limavady Magistrates Court heard on Wednesday. PSNI Inspector Barry Collins said 19-year-old William Christopher Moore, of Rosseden Park, Limavady, was caught by police while removing two coping stones at 1.45 am on May 28. Defending, Johnny Sandhu said the apprentice admitted criminal damage but was taking out his frustrations after being assaulted in the club, Jensen's, and then thrown out by bouncers. Resident Magistrate Eamon King ordered Moore to pay 150 in restitution and imposed a 100 fine. He told the teenager: \"I don't think either of the two coping stones jumped out and hit you that night .! Taxi A MAN had to be hauled out of a taxi by police after being involved in a fight, Limavady magistrates Court heard on Friday. PSNI Inspector Barry Collins said the initial incident had taken place at Catherine Street shortly after midnight on June 12. One of the people involved, 21-year-old William O' Connor, of Drumachose Park, Limavady, was stopped in a taxi at Irish Green Street and became aggressive towards police when they ordered him to get out. O'Connor - currently serving a four-year prison sentence for another offence - had to handcuffed after resisting arrest and lashing out at the officers. Defence solicitor Johnny Sandhu said his client had been in an aggressive mood after the earlier fight. RM Eamon King imposed 150 on each of the two charges, with an immediate prison sentence of one week in default of payment. Probation A MAN with a history of substance abuse was given a chance to sort his life out when he appeared at Limavady Magistrates Court on Wednesday. Simon Fleming, aged 32, of Somerset Drive, Coleraine, had admitted obstructing police in Alexander Road, Limavady. PSNI Inspector Barry Collins said two men had been seen by police after an alleged assault in the street at 11.20 pm on October 26. Fleming, who was heavily intoxicated, had tackled police in an attempt to help the other man to escape. RM Eamon King said Fleming, who had a lengthy history of offences committed through substance abuse, lost his brother last year and was still coming to terms with the tragedy. Placing him on probation for a year, the magistrate made it a condition that he liaise with the addiction team and take up any treatment as directed by his probation officer. Excess WHEN police stopped a VW Golf after it veered across the road several times they noticed that the driver's breath smelled of drink, Limavady Magistrates Court heard on Wednesday. PSNI Inspector Barry Collins said the man was arrested in Irish Green Street, Limavady, at 12.01 pm on December 26. Test showed that Gerald Kennedy, aged 53, of Benevenagh Drive, Limavady, had 113microgrammes of alcohol in 100 millilitres of breath - three times the legal limit. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Unit 4 5 Spencer House Spencer Road Waterside clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. Londonderry Sentinel provides news, events and sport features from the Londonderry area. For the best up to date information relating to Londonderry and the surrounding areas visit us at Londonderry Sentinel regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2014112400_00034080_W", "names": {"David James": ["Q10598", "Q12889410", "Q16197001", "Q16730163", "Q2139406", "Q24181959", "Q24818335", "Q25189319", "Q286937", "Q3018148", "Q5235554", "Q5235558", "Q5235563", "Q56596956"]}}, {"date": "2014-11-24", "url": "http://ncronline.org//news/global/europe-awaits-pope-francis-visit-parliament", "content": "When Pope Francis arrives at the European Parliament, the legislative branch of the European Union, in Strasbourg, France, on Tuesday, he'll be entering a place where the hopes and fears, passions and prejudices of a whole continent are routinely played out. In May's elections, nationalist and populist formations such as France's National Front and Britain's UK Independence Party made strong advances. And while two-thirds of the assembly is still made up of the mainstream center-right and center-left, Francis must offer a message that resonates with an audience ranging from devout Christians to militant atheists. \"The pope will be warmly welcomed--both as a religious leader and as a moral authority,\" said Jan Bernas, spokesman for the Socialist-Democrat group, which holds the second-most seats in the 751-seat Parliament. \"As a secular political organization, we embrace various orientations and don't follow any religious doctrine,\" Bernas told NCR. \"But we believe charity and the common good should be at the heart of politics, and we'll be eager to hear his words of encouragement .\" Become one today! Francis will also be visiting the nearby Council of Europe, the wider advisory organization of European states, whose 47 members include Russia and Ukraine. German Cardinal <mark>Reinhard Marx</mark>, who heads the Commission of European Union Bishops Conferences (COMECE) said he hopes Francis will plead against the war now setting Russia and Ukraine against each other. But he said he's confident Francis will also address the poverty and exclusion that have worsened during the financial crisis and reiterate Catholic support for the \"noble ideals of European integration .\" \"Pope Francis is acknowledging the unique significance of the European institutions in the life of our continent and saluting the achievements of the European project,\" <mark>Marx</mark>, archbishop of Munich-Freising, said in a mid-September statement. \"We hope he'll encourage European parliamentarians in their work and show how the foundational values of the Union, largely inspired by the Christian faith, may shape the Europe of tomorrow,\" <mark>Marx</mark> said. Not everyone has been so positive. There have been calls for a boycott of the visit by politicians favoring the French model of strict church-state separation, as well as from a coterie of secularist and anti-clerical organizations. Members of the feminist group Femen protested the pope's intended \"attack on secularization\" in a naked St. Peter's Square protest in mid-November, while The Alliance for a Secular Europe rejected Schulz's invitation, citing the Catholic church's alleged compounding of the Ebola pandemic in West Africa. \"The religious movement represented by the Pope continues to actively combat human rights, such as the European Union defends, seeking to impose on the rest of society a dogmatic moral vision, in defiance of the principles of freedom of conscience and equality,\" The Alliance for a Secular Europe wrote in an Oct. 31 open letter. \"The Catholic Church's doctrinal positions on start and end of life and sexual matters, including women's reproductive rights, the very issues on which they campaign most forcefully, are the very ones on which they are at most variance from their followers, especially in Europe,\" the letter continued. Schulz has sought to reassure the critics. \"We'll be welcoming someone who, at this historical moment, is a point of reference not only for Catholics but for many other people as well,\" Schulz said at a mid-October Strasbourg press conference. \"At a time when many are disorientated and the world is moving at a dizzying speed, often in very risky directions, the pope is the only person giving people hope through his noble rectitude,\" he said. It remains to be seen, however, how Francis will be received. \"The Holy Father's presence is symbolic--but he'll be speaking in front of European representatives who are responsible for democracy, freedom of religion and human rights, and he'll clearly be viewed differently than his predecessors,\" Marion Jeanne, a French spokesman for the conservative European People's Party, told NCR. \"Although his visit will strongly signal recognition for the EU as a peace project, however, I'm not only expecting words of peace. I also imagine he'll want to wake Europe up to its Christian roots and our global responsibility to keep them alive .\" The visit, which will last barely four hours, will be the pope's first to the territory of the European Union outside Italy and the first to the European Parliament by a pontiff since that of Pope <mark>John Paul</mark> II in 1988. <mark>John Paul</mark>'s address to the Parliament was disrupted by the Rev. <mark>Ian Paisley</mark>, leader of Northern Ireland's Protestants, who was bundled from the chamber after waving posters branding the pontiff the \"anti-Christ .\" But the pope was otherwise well-received for his speech, defending the \"aspirations of Slavic peoples\" then under Communist rule, and for championing a united \"sovereign Europe, shaped by the Christian faith .\" Much has changed since in Europe's political and cultural map. The 1989 collapse of Communist rule brought old nations back into the European family. Meanwhile, the EU has expanded from 12 to 28 member-states with a combined population of 507 million and wields far greater power and influence as the world's largest economic bloc. Although the Vatican appointed its own permanent representative to the European institutions in 1990 and has consistently argued for an integrated Europe, it's often been unhappy with the course of events. Church membership and participation plummeted, and EU officials have been accused of ignoring the role of religious communities in their treaties and directives. Prominent Catholics, meanwhile, have accused the European Parliament itself of an anti-Catholic agenda on issues like same-sex unions and embryo research. Others, however, have cautioned against overreacting. Although the EU's landmark 2009 Lisbon Treaty declined to acknowledge Europe's Christian roots directly, it recognized the \"identity and specific contribution\" of churches under the national law of member-states and committed EU officials, under Article 17, to maintain \"an open, transparent and regular dialogue\" with them. During the same year, church leaders expressed concern when MEPs, members of the European Parliament, voted to strip away national exemptions from the Anti-Discrimination Directive, raising fears that faith schools would be forced to admit non-believers and gay couples would be able to sue if refused church marriages. In 2011, however, they welcomed a ruling by the European Court of Human Rights validating the public presence of crosses after a previous judgment barring them from state schools had prompted calls for a Europe-wide ban. In 2013, church leaders accused the Parliament of trespassing beyond its competence after a draft resolution called for abortion--which is tightly restricted in Poland, Malta, and other countries--to be recognized as a \"fundamental right\" throughout the EU. In June 2013, however, they lauded the Parliament's backing for new EU plans to make financial help for countries around the world conditional on their protection of religious rights. Such topics may well appear in the pope's Strasbourg address. Although Francis has said little so far about Europe, he'll most likely be aware, as an experienced Jesuit pastor, of the challenges of secularization and the need for change in how his church proclaims the Gospel in an area deeply affected by hardship and social injustice and showing signs of tiredness and disillusionment. Speaking in Sardinia, Italy, in September 2013, Francis talked of an economic system that had fueled a crisis both cultural and economic and the need to place mankind at its center again in place of the \"would-be pagan god of money .\" It may be a message the pontiff brings to talks with new European officials such as Poland's Donald Tusk, who takes over Dec. 1 as president of the European Council, or the EU's head of state, and Jean-Claude Juncker of Luxembourg, who took over on Nov. 1 as 12th president of the EU's 28-member governing commission. As his largest encounter with politicians to date, the Strasbourg visit will bring Francis into contact with all the political and ideological tendencies of a continent marked through history by wars and crises. But Fr. Patrick Daly, secretary-general of COMECE, is hopeful. Francis cannot assume a \"familiarity with Christian social teaching\" on the part of his audience, Daly said, but he can be expected to cope well with \"his first test in the political arena .\" \"President Schulz and the MEPs have a right to assume the pope will display sensitivity to the long-term aspirations of the European project, and to the competences and policy fields specific to the Union,\" Daly said in an October statement. \"But the Holy Father will be speaking to a Parliament that still has the freshness and energy of any parliament at the beginning of its term, knowing that 58 percent of MEPs are there for the first time, and are impressionable,\" he said. [Jonathan Luxmoore is a freelance writer covering European church news from Warsaw, Poland and Oxford, England. His latest two-volume book, Before you can post a comment, you must verify your email address at Disqus.com / verify. Comments from unverified email addresses will be deleted. Be respectful. Do not attack the writer. Take on the idea, not the messenger. Don't use obscene, profane or vulgar language. Stay on point. Comments that stray from the original idea will be deleted. NCR reserves the right to close comment threads when discussions are no longer productive. We are not able to monitor every comment that comes through. If you see something objectionable, please click the \"Report abuse\" button. Once a comment has been flagged, an NCR staff member will investigate. Special Section: Saints Not all of our content is online. National Catholic Reporter publications:", "articleID": "2014112416_00016238_W", "names": {"Ian Paisley": ["Q296597", "Q575881"], "John Paul": ["Q1701359", "Q6252169"], "Reinhard Marx": ["Q18691585", "Q43930"]}}, {"date": "2014-11-27", "url": "http://fin24.com/Economy/Opec-wont-cut-output-despite-oil-price-dip-20141127", "content": "Toilets before temples It's no joke - sanitary shortcomings hamper economic growth, says Leopold Scholtz. Medical savings fact sheet Find out how the savings account on your medical scheme option works. We're currently experiencing serious technical problems on the site, and as a result are unable to update the news - even though our market data is running as per normal. We sincerely apologise for any inconvenience caused and hope to be up and running again this evening. Thank you for your patience in this regard. - <mark>David McKay</mark> (editor) & team Vienna - Opec Gulf oil producers will not propose an output cut on Thursday, reducing the likelihood of joint action by Opec to prop up prices that have sunk by a third since June and raising the prospect of a global oil price war. \"The GCC reached a consensus,\" Saudi Arabian Oil Minister Ali al-Naimi told reporters, referring to the Gulf Cooperation Council which includes Saudi Arabia, Kuwait, Qatar and the United Arab Emirates. \"We are very confident that Opec will have a unified position .\" \"The power of convincing will prevail tomorrow...I am confident that Opec is capable of taking a very unified position,\" Naimi added. A Gulf Opec delegate told Reuters the GCC had reached a consensus not to cut oil output. Three Opec delegates separately told Reuters they believed Opec was unlikely to cut output when the 12-member organisation meets on Thursday. The Opec meeting will be one of its most crucial in recent years, with oil having tumbled to below $78 a barrel due to the US shale boom and slower economic growth in China and Europe. Cutting output unilaterally would effectively mean for Opec, which accounts for a third of global oil output, a further loss of market share to North American shale oil producers. If Opec decided against cutting and rolled over existing output levels on Thursday, that would effectively mean a price war that the Saudis and other Gulf producers could withstand due to their large foreign-exchange reserves. Other members, such as Venezuela or Iran, would find it much more difficult. Brent crude was trading down 73 cents at $77.60 a barrel at 21:19. Naimi said earlier on Wednesday he expected the oil market \"to stabilise itself eventually\" , after talks with non-Opec member Russia on Tuesday yielded no pledge from Moscow to tackle a global oil glut jointly. The UAE sided with Naimi, saying oil prices would soon stabilise, while ramping up pressure on non-Opec nations. \"This is not a crisis that requires us to panic...we have seen (prices) way lower,\" UAE Oil Minister Suhail bin Mohammed al-Mazroui told Reuters. \"The oversupply came from the evolution of the unconventional oil production...I think everyone needs to play a role in balancing the market, not Opec unilaterally,\" he said. Iranian Oil Minister Bijan Zangeneh said some Opec members, although not Iran, were now gearing up for a battle over market share. \"Some Opec members believe that this is the time where we need to defend market share...All the experts in the market believe we have oversupply in the market and next year we will have more oversupply,\" he added. The group could opt to roll over output levels but stress the importance of better compliance, while also agreeing to hold an extraordinary meeting if prices keep falling, several Opec watchers have suggested. Price war Among the members of the Organisation of the Petroleum Exporting Countries, Venezuela and Iraq have called for output cuts. Opec's traditional price hawk Iran said on Wednesday its views were now close to those of Saudi Arabia. Zangeneh said there was unity inside Opec to \"monitor the market carefully\" but made no mention of a cut. \"The onslaught of North American shale oil has drastically undermined Opec's position and reduced its market share,\" said Dr <mark>Gary Ross</mark>, chief executive of PIRA Energy Group. Russia, which produces 10.5 million barrels per day (bpd) or 11% of global oil, came to Tuesday's meeting amid hints it might agree to cut output as it suffers from oil's price fall and Western sanctions over Moscow's actions in Ukraine. But as that meeting with Naimi and officials from Venezuela and non-Opec member Mexico ended, Russia's most influential oil official, state firm Rosneft's head Igor Sechin, emerged with a surprise message - Russia will not reduce output even if oil falls to $60 per barrel. Sechin added that he expected low oil prices to do more damage to producing nations with higher costs, in a clear reference to the US shale boom. On Wednesday, Russian Energy Minister Alexander Novak said he expected the country's output to be flat next year. Many at Opec were surprised by Sechin's suggestion that Russia - in desperate need of oil prices above $100 per barrel to balance its budget - was ready for a price war. \"Gulf states are less bothered about a price drop compared to other Opec members,\" an Opec source close to Gulf thinking said. Opec publications have shown that global supply will exceed demand by more than 1 million bpd in the first half of next year. While the statistics speak in favour of a cut, the build-up to the Opec meeting has seen one of the most heated debates in years about the next policy step for the group. 24. com publishes all comments posted on articles provided that they adhere to our SA's best and worst cellphone contracts AnswerIt Get your financial questions answered. RSS Feeds News delivered really simply. Calculators Easy-to-use personal finance tools. Newsletters You choose what you want. Blogs Your opinion on you, me and everyone. Data Products Get us in your home, on your television.", "articleID": "2014112709_00029452_W", "names": {"David Mckay": ["Q1175601", "Q15500677", "Q46515282", "Q47541485", "Q5237382", "Q5237386", "Q55942880"]}}]