[{"articleID": "2014122923_00039740_W", "names": {"Tom Russell": ["Q1345526", "Q20984552", "Q21461614", "Q27922619", "Q56696376"]}, "date": "2014-12-29", "url": "http://www.baldwincity.com/news/2014/dec/29/musing-hill-0101/", "content": "Print Happy New Year! My wishes for all are joy and health in the days ahead. The years fly by; where did they go? So swiftly they flew, as an arrow shot into the night is quickly lost to sight. How many years have we lost moaning over hurts and mistakes now long past? Forgive and forget. Let them go! It is time, you know. The bells are ringing in a new year. We can begin anew with good intentions and can endeavor to mend those fences and use another road not taken. As the famous philosopher Goethe wrote: \"One ought, every day at least, to hear a little song, read a good poem, see a fine picture, and, if it were possible, to speak a few reasonable words .\" Goethe should have included in his list laughter doeth good as fine medication, or \"a laugh a day keeps the doctor away,\" which has been proven true. Also, he should include nature's healing touch. Nature is very important to me. If I feel anxious or upset, I lean against a huge oak, and it seems to impart its strength and endurance, which renews my soul. Fortunately, I am able to adhere to Goethe's advice. Every day, the songs of birds fall upon my ears. I do not often come across good poetry that appeals to me. I am used to poems that rhyme. Fine pictures, I see every day. I only have to gaze upon <mark>Tom Russell</mark>'s wonderful \"Margaret's High Pasture,\" hanging in my living room. It pleasures my eyes. My daughter Tricia Spencer presented me, at Christmas, her beautiful painting of a group of red apples, which is hanging in my dining area. I feel my columns, which I work on almost every day, represent \"a few reasonable words .\" The following poem, which I wrote, does not in any way represent good poetry. \"Now I am old, red I will wear. It will go well with my snow white hair. The sun still sets in flaming red. That color's mine, gaily she said. Oh, not for me cold purple's shroud. I'll flaunt my age and cry aloud. Like setting sun on yonder hill, tinting every cloud at will. I too will set in flaming red, clouds of glory around my head!\" "}, {"articleID": "2016071111_00077944_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Robert Deleo": ["Q7343448", "Q924486"], "Charlie Baker": ["Q28051620", "Q5076629", "Q5084482", "Q56254750"], "Tommy Chang": ["Q19560219", "Q7819296"], "Michael Norton": ["Q23662981", "Q27831086", "Q42310522", "Q6018038"], "Brad Jones": ["Q26834399", "Q2923402", "Q299228", "Q4954040", "Q4954041", "Q4954042", "Q56280650", "Q896802"], "Katherine Clark": ["Q58757120", "Q6376330"], "Adrian Walker": ["Q4685414", "Q4685415"]}, "date": "2016-07-11", "url": "http://www.politico.com/tipsheets/massachusetts-playbook/2016/07/equal-pay-bill-incoming-mind-those-budget-earmarks-happy-birthday-ed-markey-215241", "content": "The fights before the convention fight in Cleveland Christie builds his case for <mark>Trump</mark>'s VP Why <mark>Paul Ryan</mark> won't accept--or dismiss--<mark>Donald Trump</mark> The Year the Veepstakes Really Mattered An Unfair Tragedy for Unlucky Dallas Politico Massachusetts Playbook Lauren Dezenski's must-read rundown of what's up on Beacon Hill and beyond. Subscribe Shares Facebook Twitter Google + Email Comment Print EQUAL PAY bill incoming--Mind those BUDGET earmarks--Happy Birthday ED MARKEY 07/11/16 07:02 AM EDT By Lauren Dezenski (ldezenski @ politico.com; @ laurendezenski) GOOD MORNING, MASSACHUSETTS. Welcome to Monday. And welcome to the world, Playbook 2.0, featuring Anna Palmer, Jake Sherman, and MA's own Daniel Lippman! Sign up here for the revamped Playbook out of DC--http: //politi.co/29sx4tx Story Continued Below Also, Happy 7 Eleven day. What's in it for you? A Slurpee. TODAY--Attorney General Maura Healey, Boston Mayor Marty Walsh, Senate President Stan Rosenberg, and House Speaker <mark>Robert DeLeo</mark> celebrate the transgender public accommodations bill being signed into law on the steps of the State House. In a little #mapoli Friday news dump, Gov. <mark>Charlie Baker</mark> put pen to paper with the trans bill as well as the FY17 state budget--Gov. <mark>Charlie Baker</mark> won't be at the celebration at the State House steps but he and Boston Mayor Marty Walsh will be in Dorchester for the groundbreaking of a new TOD building near Ashmont Station at noon--Boston Public Schools hosts a public feedback meeting on Superintendent <mark>Tommy Chang</mark>'s strategic implementation plan in Eastie tonight HOW MANY DAYS UNTIL THE END OF SESSION? 20. COMING THIS WEEK: EQUAL PAY LEGISLATION--Debate and a likely vote on the House's take on equal pay legislation which passed the Senate unanimously is expected to appeal to all sides thanks to tweaks from the House. More from yours truly in POLITICO Massachusetts--\"While the House language was not yet available late last week, those involved with negotiations say the bill will be amenable to all parties. It is currently being tweaked in the House Committee on Ways and Means .\" ...\"\"I would say that it's similar to the Senate version,' said Rep. Patricia Haddad, a Somerset Democrat. The main difference, she said, is that the House worked more closely with Associated Industries of Massachusetts in developing the legislation .\" ...\"In January, the Senate unanimously passed legislation to shrink the gap between men and women's wages by prohibiting potential employers from asking about salary history and establishing a definition for\" comparable work. \"'\" Associated Industries of Massachusetts, or AIM, was critical of the Senate's language. The group's president, Rick Lord, confirmed that his team has been closely working with House leadership as well as the Attorney General's office \"to hopefully come up with a bill out of the House that we would support .\" '...\"The Massachusetts High Tech Council, another group pushing back against the Senate proposal, sent a similar signal .\" Based on the conversations we've been having, we're optimistic about the House-produced bill. It will be an improvement over what the Senate did,' said public policy and communications executive vice president Mark Gallagher. \"READ ON--http: //politi.co/29ssPOE Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for the Playbook? Get in touch: ldezenski @ politico.com. ** A message from HydroTruthMA: Want to raise Massachusetts electric prices by $10 billion dollars over the next 20 years? NO. . The Massachusetts Hydro Plan threatens local jobs and there are serious questions about the cost and reliability of government-owned Canadian hydro power. Learn more: bit. ly/2928S3h ** ICYMI--THE BUDGET IS FINALIZED AND SIGNED--\"<mark>Baker</mark> skims $265M from final $38.92 B budget,\" by Lauren Dezenski, POLITICO Massachusetts: \"Gov. <mark>Charlie Baker</mark> signed the 2017 fiscal year budget into law Friday. He also used his signature to veto $265 million in outside and one-time spending from the final $38.92 billion measure ....The bulk of the vetoes came from health and human services, $72 million, as well as $59 million from administration and finance, $33 million from education and $20 million from public safety .\" http: //politi.co/29suiEA WHAT EARMARKS LIVE WHAT DIES WHO TELLS THEIR STORY: HERE COMES THE MASS BUDGET BOT!--\"Despite Belt-Tightening, Hundreds Of Earmarks Made It To Gov's Desk\" by Isaiah Thompson, WGBH: \"But an analysis of the finalized budget by WGBH News found roughly five hundred earmarks--defined as specific sums of money directed to specific recipients outside of state government--in the budget submitted to Governor <mark>Baker</mark>.\" http: //bit.ly/29uCaFh SORRY KIDS--\"Students at state's public colleges gird for higher tuition,\" by Laura Krantz, Boston Globe: \"The price for in-state students to attend Massachusetts' nine state universities is going up by as much as 7.8 percent in the coming academic year, according to preliminary figures from the campuses. The increase for students attending the 15 community colleges will be as much as 10 percent .\" http: //bit.ly/29syvs1 EDUCATION MATTERS--\"Declining prekindergarten enrollment worries Worcester education officials,\" by Scott O’Connell, Worcester Telegram: \"Since reaching a high of 1,624 students in 2012, the city's preschool population has dipped to 1,264 in the past school year, a decline of about 22 percent. The trend makes Worcester an outlier among similar-size cities around the state, as programs in systems like Boston and Springfield have added dozens to hundreds of students over the same period .\" http: //bit.ly/29yRxyB WHEN BANS DON'T WORK--\"Lowell: Don't give money to panhandlers,\" by Grant Welker, Lowell Sun: \"City officials will start a public-awareness initiative to tell residents and visitors that giving money to panhandlers isn't what's best for those asking for money ....The campaign is the latest effort by the city after a judge blocked a previous plan to make panhandling illegal. Now, instead of trying to stop the panhandlers, the city is trying to stop people from giving money to them .\" http: //bit.ly/29GQrmG ALSO ICYMI--\"<mark>Baker</mark> signs trans bill into law,\" by Lauren Dezenski, POLITICO Massachusetts: \"As expected, Gov. <mark>Charlie Baker</mark> has signed the transgender public accommodations bill into law, his office announced Friday afternoon ....Under the law, effective immediately, transgender individuals are included as a class protected from discriminatory advertising .\" http: //politi.co/29swzQ7 SEVEN DAYS UNTIL CLEVELAND--\"House leader's streak of consecutive GOP conventions to end,\" by <mark>Michael Norton</mark>, State House News Service: \"After attending three straight Republican national conventions, House Majority Leader <mark>Brad Jones</mark> does not plan to visit Cleveland next week for the 2016 convention, and he's not alone among GOP lawmakers ....Only three of the 34 House Republicans plan to attend the convention and none of the Senate's six Republicans plan to be there, aides told the News Service when asked about attendance plans. Rep. Geoff Diehl of Whitman, who has been actively supporting <mark>Donald Trump</mark>'s campaign, plans to attend, as well as Reps. Paul Frost of Auburn and Keiko Orrall of Lakeville, who will take over for Chanel Prunier as one of the state's two Republican National Committee members after the convention .\" http: //bit.ly/29svs2U FOLLOWING UP WITH A STORY ABOUT A STORY ABOUT A STORY--\"The HuffPost Story That Bizarrely Rocked Boston,\" by Daniel Marans and <mark>Ryan</mark> Grimm, Huffington Post: \"The Huffington Post raised the issue Wednesday of the Boston media's failure to report on the questionable record of Carmen Ortiz, the top federal prosecutor in Massachusetts ....As if working to prove the point, Boston media promptly turned its guns on the mayor and HuffPost in response .\" http: //bit.ly/29GOyX5 WIN THE MORNING. OWN THE DAY. GET THE NEW PLAYBOOK. Anna Palmer and Jake Sherman, along with Daniel Lippman, tell you what's really going on in Washington and beyond--with more big scoops, must-read intel, and backstage reporting on politics and power. Sign up here: http: //politi.co/29ta4fR WOOD WAR--Herald: \"I STAY PRAYED UP\" --Globe: \"MESSAGE OF HARMONY IN BOSTON,\" \"Police say Dallas gunman was planning wider attacks,\" \"Prices rising at state schools,\" \"Praise, doubts on Clinton's tuition plan,\" \"US refuge for Central Americans urged,\" \"Duck boat hits woman; safety please resurface .\" INBOX (from Friday)--\"<mark>Clark</mark> bills incorporated in passage of Congress' opioid reform package,\" from the office of Rep. <mark>Katherine Clark</mark>: \"Today, the U.S. House passed the Comprehensive Addiction and Recovery Act (CARA), Congress' opioid crisis response package that incorporates 3 of Congresswoman <mark>Katherine Clark</mark>'s bills. In May, the U.S. House unanimously passed <mark>Clark</mark>'s bills, the Reducing Unused Medications Act, the Infant Plan of Safe Care Improvement Act, and Lali's Law. The bills are aimed at reducing the amount of unused and unwanted pain medications, ensuring safe care plans for families with infants suffering from opioid exposure, and increasing access the availability of the overdose antidote Narcan. While the package passed with a bipartisan majority, <mark>Clark</mark> and other Democrats were critical of the minimal funding resources Republicans allowed in the bill. President Obama called for $1.1 billion in emergency funding to expand addiction treatment services and support overdose prevention programs. The bill passed by the House today contains only $181 million in new authorized funding .\" SIGN OF THE TIMES--\"Boston marches in protest,\" by Jack Encarnacao and Antonio Planas, Boston Herald: \"Black Lives Matter demonstrators continued to hit the streets in Boston and across the nation yesterday as President Obama admonished people to\" listen to each other \"ahead of his planned address at a memorial service tomorrow for five slain Dallas police officers .\" DATELINE HOLYOKE--\"Holyoke Black Lives Matter protest held after 5 police officers, 2 black men killed in week of national violence,\" by Jeannette DeForge, Masslive.com: But the goal of holding a non-violent protest was met. About 100 people gathered in the middle of the park off Maple Street, holding hand-made signs and listening to speeches, occasionally chanting \"Black Lives Matter' and\" We've got to do better. \"' http: //bit.ly/29GP2wk PROCESSING--\"Violence across the country touches many in Boston,\" by <mark>Adrian Walker</mark>, Boston Globe: \"So when Dallas explodes, Dudley Square protests. It's both a cry for justice and a plea for safety. At a time of deep anguish, there was healing in proclaiming that black lives matter .\" http: //bit.ly/29sw0WI WHAT THE DUCK--\"After 2nd duck boat crash this year, a renewed call for change,\" by Jan Ranson, Trisha Thadani, and Nicole Fleming, Boston Globe: \"A woman walking in the Back Bay was struck by a duck boat shortly before noon Sunday afternoon, prompting renewed calls for legislation providing safeguards to prevent more accidents involving the lumbering amphibious vehicles .\" http: //bit.ly/29sxGzC RISE UP--\"To Xfinity And Beyond: One Town In Western MA Took On Comcast, And Won,\" by Callie Crossley, WGBH: \"How did this small Western Massachusetts town have the wherewithal to go rogue against the internet behemoth? It started 5 years ago when city officials began looking for a solution to the poor service, so iffy that some still used dial up. So bad that 40 percent of residents opted not to be online. There's no wave of a magic wand to erase their daily frustration of trying to get and stay connected .\" http: //bit.ly/29svkkb CHEERS--\"Drink app founders want to change Mass. law,\" by Kerry J. Byrne, Boston Herald: \"A pair of local entrepreneurs are working to bring happy hour back to the Bay State and they have an online petition (happyhourboston.com) with more than 8,000 signatures that they're hoping to leverage into support from Mayor Martin J. Walsh's late-night task force and other state officials .\" http: //bit.ly/29GNYIZ ONE LAST TIME--\"Lin-Manuel Miranda's Final Bows in\" Hamilton' on Broadway, \"by Joshua Barone, New York Times:\" Lin-Manuel Miranda's final bows for his farewell performance in \"Hamilton\" on Saturday night seemed routine, if overly humble for the departure of the show's star and mastermind. He even shared his bows with the other cast members also exiting the show, including Phillipa Soo and the Tony winner Leslie Odom Jr....But then the theme song to \"The West Wing\" kicked in from the orchestra pit. \"http: //nyti.ms/29svTdA HAPPY BIRTHDAY--To Sen. Ed Markey, who turns 70 today and WBUR's Jack Lepiarz. DID THE HOME TEAM WIN?--Yes! The Sox beat the Rays 4-0. HEY NERDS--For those who have to catch\" em all on Pokemon GO before the end of session: There are multiple Pokestops at the State House (and that's saying nothing of the Common), according to an independent analysis conducted by Politico Massachusetts. Happy playing. SEE YOU TOMORROW--\"WGBH'S\" The Scrum' Live! Transit Edition \"--\"The Scrum heads to Somerville's Union Square, one of the key spots set to be revitalized by the MBTA's Green Line Extension project. But decades of promises to Somervillains were almost dashed by the T's fiscal woes when the project came close to cancellation ....When the MBTA hurts, Greater Boston hurts. Join WGBH News's Adam Reilly, Peter Kadzis and Mike Deehan - along with a rotating cast of transit experts and advocates - as the Scrum dives in to all things transit ....They don't serve nachos, so I guess we'll all have to order conch fritters instead .\" Fun starts at 6:30 p.m. at the Brass Union. RSVP to the Facebook event: http: //bit.ly/29GQSNE ** A message from HydroTruthMA: Since 1990, carbon emissions from MA power plants have dropped 51% according to the U.S. Department of Energy. Massachusetts has one of the cleanest and lowest carbon-producing power generation systems in the nation. In fact, transportation today represents twice the carbon emissions of power plants in the Commonwealth. And despite talk of an \"energy cost crisis,\" the last two years have seen the lowest electricity prices in more than a decade. The energy plan being pushed on Beacon Hill, however, puts all this progress at risk by outsourcing up to a third of our electricity market to government-owned Canadian utilities and locking consumers into decades-long hydro contracts. If passed by the legislature, energy bills are estimated to increase by up to $777 million each year for Massachusetts families and businesses. Government-owned Canadian hydro is expensive, unreliable and not the solution for Massachusetts. Learn more: bit. ly/2928S3h ** Want to make an impact? POLITICO Massachusetts has a variety of multi-platform solutions available to reach and activate the most influential people in the Bay State. Have a petition you want signed? A cause you're promoting? Share your message with our influential readers to increase awareness and drive action. Contact Chris Falls to find out how: cfalls @ politico.com. FOR MORE political and policy news from Massachusetts, check out: http: //politi.co/1qNSlWx SUBSCRIBE to the Playbook family: POLITICO Playbook: http: //politi.co/1phAeAC...New York Playbook: http: //politi.co/1ON8bqW...Florida Playbook: http: //politi.co/1JDm23W...New Jersey Playbook: http: //politi.co/1HLKltF...Massachusetts Playbook: http: //politi.co/1Nhtq5v...Illinois Playbook: http: //politi.co/1N7u5sb...California Playbook: http: //politi.co/1N8zdJU and our friends at POLITICO Brussels Playbook: http: //politi.co/1FZeLcw...All our policy and political tipsheets http: //politi.co/1M75UbX & laquo; View Archives This story tagged under: Massachusetts Clinton's new friend--and maybe VP <mark>Donald Trump</mark>'s God whisperer Massachusetts Playbook - POLITICO Archive Monday, 7/11/16 Friday, 7/8/16 Thursday, 7/7/16 Wednesday, 7/6/16 Tuesday, 7/5/16 View the Full Massachusetts Playbook Archives & raquo; Politico Magazine Measuring the Backlash Against the Muslim Backlash By Shibley Telhami Hillary Clinton's Press Conference Phobia By Jack Shafer How the World Fell Out of Love with Obama By Nahal Toosi Mike Huckabee: If You Can't Support <mark>Trump</mark>, You Don't Deserve a Microphone By Mike Huckabee"}, {"articleID": "2013021400_00047238_W", "names": {"Felix Hernandez": ["Q1196594", "Q58310246"], "Josh Beckett": ["Q1365880", "Q22338940"], "Carl Crawford": ["Q1037431", "Q26273593"], "James Loney": ["Q6138193", "Q629493"], "Paco Rodriguez": ["Q11886338", "Q3360253", "Q3499269", "Q6056949"], "Don Mattingly": ["Q19843097", "Q679120"], "Javy Guerra": ["Q1100188", "Q55367341"]}, "date": "2013-02-13", "url": "http://mlb.mlb.com/news/article.jsp?ymd=20130213&content_id=41594480&notebook_id=41614512&vkey=notebook_la&c_id=la", "content": "glendale, ariz.--the dodgers' zack greinke was gracious a day after losing the title of richest right-hander in baseball to <mark>felix hernandez</mark>. \"he's worth it,\" said greinke, whose six-year, $147 million deal was eclipsed by <mark>hernandez</mark>'s seven-year, $175 million contract with seattle. greinke, however, declined to publicly offer any negotiating advice to the left-hander two lockers over, clayton kershaw, who could become the richest pitcher in history if a contract extension is worked out this spring. the fact that the dodgers are willing to discuss an extension with kershaw after committing hundreds of millions to greinke, hyun-jin ryu and others helped sway greinke to pick the dodgers over other pursuers like the angels, rangers and brewers. greinke said he wanted a team that had the least chance of needing to rebuild during his tenure, which is why he studied the farm systems of some of the interested clubs. \"it wasn't just for the farm system,\" greinke said. \"some of it was the organization's ability to sustain a good team. the dodgers need a farm system less than if i signed with, say, the rays. every team may be able to sustain for a period of time with the current roster, but if something doesn't go right, do they have enough to go out and keep the team competitive? my preference is to be in the playoffs every year, and only a couple teams have a good chance at that .\" greinke said the dodgers were on his radar throughout his contract year and that he spoke with former teammates jerry hairston jr. and jamey wright during the season for a feel of the organization. greinke said that when the dodgers made their blockbuster trade with the red sox last summer--acquiring adrian gonzalez, <mark>josh beckett</mark>, <mark>carl crawford</mark> and nick punto for <mark>james loney</mark> and a package of prospects, picking up $280 million in salary commitment--he thought it was \"crazy .\" \"it was definitely bold,\" greinke said. \"it was a lot of money. but then you think about the talented guys; you can't get them without paying. but there was so much money involved, it sounded crazy. then i heard how much money they'll make with the tv deal, [roughly $7 billion].\" reliever elbert not expected back until may glendale, ariz.--dodgers left-handed reliever scott elbert, recovering from his second elbow operation in four months, said on wednesday that he won't resume throwing until next month and doesn't expect to return until may. \"they didn't give me a time frame, but it looks like may,\" said elbert, whose second surgery led to on sept. 19, elbert underwent a first procedure to remove scar tissue in the back of the elbow. but after beginning a throwing program, he developed pain in a different area that led to a jan. 23 arthroscopic procedure involving \"a new area of cartilage damage [that] was discovered and debrided\" by dr. neal elattrache, according to elbert. \"it feels a lot better now,\" elbert said of the elbow. \"after the first surgery, i tried throwing for two weeks but had to shut it down. it never calmed down; it just hurt .\" elbert went 1-1 with a 2.20 era over 43 appearances last year before being injured a second time at the end of august. his injury could provide an opening for lefty <mark>paco rodriguez</mark>, who was the first player from last year's draft to reach the major leagues; he posted a 1.35 era in 11 appearances. elbert said he won't allow himself to push too hard, too soon. \"i know i'm already behind, so there's no reason to force the issue now,\" elbert said. \"what's the difference if i miss four weeks or six? i just want to be sure that when i come back, i come back with a brand new arm .\" glendale, ariz.--korean sensation hyun-jin ryu was not sensational during the first conditioning run of spring training, huffing and puffing and cutting corners at the back of the pack that included pitchers and catchers. ryu then joked to the korean media that in america, they run too fast in spring training. having given up cheeseburgers on a diet that has seen him shed eight pounds, ryu might soon need to consider leaving cigarettes behind, too. \"he made it,\" said manager <mark>don mattingly</mark>, only to be told by a reporter that ryu actually didn't finish. \"no shortcuts in baseball. well, we told him,\" if you feel something, don't go too far .' he didn't. \"ryu is schedule to make his first bullpen session on thursday. it will be the first time general manager ned colletti or <mark>mattingly</mark> will see ryu pitch, other than on video. throwing their first official bullpen sessions of the spring on wednesday were <mark>josh beckett</mark>, chris capuano, chad billingsley, stephen fife, matt magill, matt guerrier, <mark>javy guerra</mark>, shawn tolleson, <mark>paco rodriguez</mark>, kelvin de la cruz, chris withrow, gregory infante and mark lowe. <mark>mattingly</mark>'s focus on team, not contract status glendale, ariz.--dodgers manager <mark>don mattingly</mark> said he won't let his contract status become a distraction .\" it can be part of the noise, but i'm not going to be a distraction to this club, \"<mark>mattingly</mark> said before his pitchers and catchers held their first workout of spring training on wednesday .\" i've always considered myself part of the solution, not part of the problem. i'm not going to be an issue. \"<mark>mattingly</mark> is entering the third and final season of his contract. his request at the end of last season that a 2014 option be guaranteed was declined .\" if it happens, it happens, and if it doesn't, it doesn't, \"<mark>mattingly</mark> said about a new deal .\" i'm concerned about doing my job. \"in 2011 and '12--<mark>mattingly</mark>'s two seasons in charge--the dodgers finished in third place and second, respectively, in the national league west. both seasons were hampered by ownership turmoil and, as a result, a limited payroll. this year, new owners have given <mark>mattingly</mark> an expensive and talented roster, and they apparently want to see what he can do with it before committing to him for the long term .\" i'm always challenged to get the most out of my club, \"<mark>mattingly</mark> said .\" i want to put them in the right position to succeed, to flourish. that's my job. then you open the gates, let them run and you're at their mercy. if they don't do the job, then it's my fault. \"<mark>mattingly</mark> acknowledged that the dodgers--through what many consider their ostentatious spending--put a target on their backs .\" yeah, you feel like that, \"<mark>mattingly</mark> said .\" why deny it? why run away from it? be realistic, and hopefully, you kind of spell out what to expect and not to be surprised by the expectations and lay it out. it's something we have a pretty good sense for, and we can address it before it becomes an issue. \"hyun-jin ryu meets the media in los angeles 00:02:23 <mark>mattingly</mark> on getting back to basics, players' health scott elbert bio, stats, photos and highlights j.p. howell bio, stats, photos and highlights? 2001 - mlb advanced media, l.p. all rights reserved."}, {"articleID": "2009072201_00022193_W", "names": {"Otis Taylor": ["Q180019", "Q7108832"]}, "date": "2009-07-22", "url": "http://popmatters.com/feeder/?FeederAction=clicked&feed=Listen&seed=http%3A%2F%2Fwww.popmatters.com%2Fpm%2Freview%2F107393-the-warlocks-the-mirror-explodes%2F&seed_title=The+Warlocks%3A+The+Mirror+Explodes", "content": "the warlocks the mirror explodes yes, the band shares a name with early incarnations of the grateful dead, velvet underground and - let us not forget-zz top. and its sound does aggressively recall critical darlings my bloody valentine and the jesus and mary chain. plus, would-be mastermind bobby hecksher has played with both the brian jonestown massacre and beck. but the warlocks fail to live up to its impressive pedigree on its fifth proper album, the mirror explodes, a dim facsimile of its heroes' brilliance. since forming in los angeles in 1999, the warlocks have persisted long enough to see the success of several bands doing the same dreamy, fuzz-rock shtick (most notably the black angels and the raveonettes) without finding much success. perhaps bobby hecksher and co. didn't deserve to lose its contract with mute after the commercial failure of the 2005 album surgery, but the acute listlessness of the its subsequent output has done little to bolster regard for tee pee records, former home of the band's old buddies brian jonestown massacre. since signing to tee pee, the warlocks have altered its sound slightly, abandoning the straight side two of white light/white heat homage that characterized its early material in favor of a lateral move into shoegaze. the mirror explodes finds bobby hecksher fronting an entirely new cast of sidemen through a wholly monochromatic set of eight fuzzy, reverb-drenched and indistinguishable tunes. like kevin shields, hecksher keeps his vocals soft and distant, just another instrument meant to mesh with the white noise of the warlocks' three-guitar assault. the lyrics are mostly indistinguishable, save a fleeting reference to a hospital on \"red camera\" and oblique statements of alienation and misery on \"there is a formula to your despair\" , all in keeping with the group's druggy persona and the oppressively dreary soundscapes. the songs have no peaks or valleys, just a constant drone that eventually yields to the next track without fanfare. everything is at the same dirge-like tempo, making the record seem to be one extended, formless jam. when the vocals drop out completely for an instrumental showcase on \"frequency meltdown\" , the band neglects to alter its formula, stubbornly soldiering on with the same pointless meandering. thankfully, the band refrains from the extended jams that showed up on their previous albums, never making any cut last much over six minutes, arbitrarily ending most around the five-minute mark. such apparently amorphous monotony would be forgivable if repeated listens revealed some sort of intention or structure or if hecksher imbued his music with any sort of meaning. no amount of time with the disc, however, will make la psych masters show us who's boss on their fourth lp. please enter your name and a valid email address. your email address will \"pentatonic wars and love songs\" : an interview with <mark>otis taylor</mark> an unlikely candidate for influence: \"naked lunch' at 50 years young sex in the u.s.a.: male sexuality in springsteen's american dream various artists: music from the original soundtrack and more: woodstock / woodstock 2 submissions © 1999-2009 popmatters.com. all rights reserved."}, {"articleID": "2018020723_00515243_W", "names": {"Marc Johnson": ["Q1375699", "Q3294120", "Q6755650"]}, "date": "2018-02-07", "url": "http://www.moultonadvertiser.com/news/national/article_9d061752-3a69-5321-8d88-0f8a68a663bc.html", "content": "Court: Idaho nuclear waste documents won't be made public - The Moulton Advertiser: National News BOISE, Idaho (AP)--U.S. officials don't have to provide details about proposed shipments of extremely radioactive spent commercial nuclear fu...posted: February 07 BOSTON (AP)--Josh McDaniels sent ripples throughout the NFL with his decision to pull out of an agreement to become the Indianapolis Colts' h...posted: February 07 The long-awaited ruling on the case of Nosey, the seized circus elephant, came out last Monday, and it appears that Judge Terry made the right...posted: February 01 Keith Ridler Court: Idaho nuclear waste documents won't be made public FILE - In this May 11, 2015, file photo, Colt Killian, left, and Rob Cox manipulate radioactive material remotely behind a protective barrier at the Hot Fuel Examination Facility at the Idaho National Laboratory near Idaho Falls, Idaho. A federal judge says the U.S. Department of Energy doesn't need to make public documents involving spent commercial nuclear fuel shipments to eastern Idaho sought by former Idaho Gov. Cecil Andrus. (AP Photo/Keith Ridler, File) Keith Ridler Court: Idaho nuclear waste documents won't be made public FILE - In this May 11, 2015, file photo, nuclear waste is stored in underground containers at the Idaho National Laboratory near Idaho Falls, Idaho. A federal judge says the U.S. Department of Energy doesn't need to make public documents involving spent commercial nuclear fuel shipments to eastern Idaho sought by former Idaho Gov. Cecil Andrus. (AP Photo/Keith Ridler, File) Posted: Wednesday, February 7, 2018 5:13 pm Court: Idaho nuclear waste documents won't be made public Associated Press | 0 comments BOISE, Idaho (AP)--U.S. officials don't have to provide details about proposed shipments of extremely radioactive spent commercial nuclear fuel to the country's top government nuclear research laboratory in Idaho, a federal court has ruled. The ruling was a major setback to a lawsuit filed by former Idaho Gov. Cecil Andrus, who had a long history of legal battles with the Energy Department over nuclear waste entering the state and a firm belief that residents had a right to know the agency's plans. U.S. District Court Judge B. Lynn Winmill on Tuesday ruled the federal agency acted properly in withholding information sought by Andrus in a Freedom of Information Act request he filed in January 2015. That decision means the documents will not be released to the public anytime soon, but they ultimately could be as another part of Andrus' argument has yet to play out and the case remains open. Andrus, a Democrat who died in August at age 85, filed the lawsuit in September 2015 after receiving heavily blacked-out documents from the federal agency about the spent commercial nuclear fuel shipments. His daughter, Tracy Andrus, has been substituted with the court's approval as the plaintiff in the case. The former governor's longtime aide, <mark>Marc Johnson</mark>, said he was disappointed with Tuesday's ruling in favor of the Department of Energy, \"particularly after waiting so long to see what DOE really has in mind for further waste in Idaho .\" The lawsuit seeks information about several hundred pounds of proposed research shipments of spent commercial nuclear fuel the federal agency wants to send to the Idaho National Laboratory, the nation's top federal nuclear research lab. The shipments required a waiver to a nuclear waste agreement the Energy Department and Idaho signed in 1995 limiting nuclear waste shipments to Idaho. The agreement followed federal court victories by then Gov. Andrus at a time when he feared the state was becoming a repository for the nation's nuclear waste. Andrus, before his death from complications from cancer, contended that signing such a waiver would open the state up to receiving tons of nuclear waste from around the nation, and is why he sought information about the Energy Department's plans. In August 2016, Winmill ordered the Energy Department to provide the court with the documents Andrus wanted to determine whether the agency's redactions fell within exemptions to the Freedom of Information Act. Winmill on Tuesday ruled they did. \"The court will sustain DOE's assertion of privilege, and not require it to provide the plaintiff with a copy of any of the documents,\" he wrote. Energy Department officials didn't immediately respond to inquiries from The Associated Press on Wednesday. The agency has previously said it wants to better understand \"high burnup\" spent fuel that is accumulating at nuclear power plants in the U.S.. The fuel stays longer in nuclear reactors than other nuclear fuel and produces more energy. But its spent fuel comes out hotter and more radioactive than fuel that does not stay so long in reactors. In Winmill's 2016 order, he also directed the Energy Department to determine whether the redacted material \"would relate to the public's interest, rather than that of the agency itself .\" He said if the information wasn't in the public's interest, the agency had to explain why, and not just site the policy underlying the exemption. Winmill in that order is telling the Energy Department to explain why releasing the information would not be in the public interest of Idaho residents, said Andrus' lawyer, Laird Lucas, with the Advocates for the West legal firm that often represents environmental groups. He said the federal agency hasn't yet responded to that part of Winmill's order. The former governor in a 2016 interview with The Associated Press said he filed the lawsuit because \"we have to know what's going on .\" The Energy Department's \"stonewalling and reluctance lends credence to my suspicion,\" he said. \"That's all I have right now--a strong suspicion backed up by a history of an agency that has run roughshod over the public for way too many years .\" Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2012090619_00047822_W", "names": {"Michael Graham": ["Q16195087", "Q22107127", "Q30907334", "Q6830720", "Q6830721", "Q6830722", "Q6830723", "Q705322"]}, "date": "2012-10-04", "url": "http://calendar.ucsf.edu/event/24392/?d=2012-10-04T12:00:00-07:00", "content": "description: violinist aenea keyes, cellist <mark>michael graham</mark> and pianist miles graber perform bach's \"sonata in e major for violin and piano, bwv 1016,\" keyes' \"for three, monet seasons,\" and piazzolla's \"four seasons of buenos aires .\" organization: campus life services arts & events"}, {"articleID": "2019120122_00114267_W", "names": {"Andrew Fleming": ["Q30126071", "Q4756965", "Q504683", "Q504706", "Q57273195"], "Dan Hurley": ["Q16729984", "Q5213719"], "Richard Barron": ["Q21289724", "Q27925010", "Q7323978"]}, "date": "2019-12-01", "url": "http://www.theday.com/uconn-sports/20191201/uconn-men-roll-past-maine", "content": "subscribe and support The Day. UConn men roll past Maine UConn's Tyler Polley is pressured by Maine's Nedeljko Prijovic, left, during the first half of Sunday's game at the XL Center in Hartford. (AP Photo/Jessica Hill) UConn's Brendan Adams, left, lines up a dunk as Maine's <mark>Andrew Fleming</mark>, right, defends during the second half of Sunday's game at the XL Center in Hartford. (AP Photo/Jessica Hill) Maine's <mark>Andrew Fleming</mark> grabs a rebound against UConn's Akok Akok, right, during the second half of Sunday's game at the XL Center in Hartford. (AP Photo/Jessica Hill) Published December 01. 2019 5:36 PM Hartford--UConn spends the first hour of every practice working on defense. Nothing else but defense. \"And then we lead to more defense,\" redshirt junior Alterique Gilbert said. \"It's really something that (coach <mark>Dan Hurley</mark>) is emphasizing this year .\" The Huskies are starting to get the desired results from their hard work. An aggressive defense helped turn a tight non-conference game into a runaway, as UConn forced Maine into 28 turnovers on the way to a 64-40 victory before 7,129 fans at the XL Center. It's been 19 years since the Huskies forced that many turnovers, accomplishing the feat against Fairfield. They scored 28 points off the turnovers and also had a season-high 13 steals. \"That's probably the most important thing for us this year is defensive pressure,\" sophomore Brendan Adams said. \"We've got a lot depth so we can run guards and bigs in and out and just keep pressuring the ball .\" Adams and freshman James Bouknight provided a spark off the bench, scoring 11 and a team-best 15 points, respectively. Gilbert (13 points) and junior Tyler Polley (12 points) also hit double figures for the Huskies (5-2). The Huskies entered Sunday's game looking to build on the success that they experienced in the Charleston Classic in South Carolina. Their performance wasn't a thing of beauty, but did the job. They never trailed and led by as many as 24. <mark>Hurley</mark> felt the Huskies didn't take full advantage of their athleticism and edge in talent and depth. They showed signs of immaturity and struggled to finish at the rim, he added. \"I was thrilled with the first two minutes and happier with the last 20...,\" <mark>Hurley</mark> said. \"Coming out of this, we've got to get better offensively. We're not going to be able to out-tough and out-heart the better teams because all the better teams play really hard .\" ...We're not there yet. We've got a lot of work to do. \"Up until UConn's pressure defense changed the game early in the second half, Maine (2-5) controlled the tempo, slowing the action down to a crawl. The Huskies, who shot just 38 percent from the field, needed something to lift them out of an offensive funk. The defense provided the necessary jolt, forcing nine turnovers during a four and a half minute stretch to help ignite a 17-2 spurt that pushed a five-point lead to 20. The Huskies extended their pressure defense and Maine, which was playing without its starting point guard, crumbled. Adams was in the middle of the action. He stole the ball and took off for fast break layup. Then after making a steal, senior Christian Vital fed Adams who rose up a monster dunk over a Maine player for a 42-30 lead .\" That felt great, \"Adams said with a smile. The Huskies kept attacking, building a 52-32 lead with 11:28 left on Jalen Gaffney's steal and transition basket. They cruised to the finish line from there .\" Coach was emphasizing all week that we need to pressure them and pressure them for 40 minutes, \"Vital said .\" If you didn't do that, you were coming out of the game. It's fun as hell to play like that. \"Maine coach <mark>Richard Barron</mark> called UConn's defense elite. The Black Bears shot an icy 35 percent from the field .\" UConn really came out and got in our shorts and made it tough on us, \"<mark>Barron</mark> said. Expect defense to continue to be the backbone for the Huskies this season. They're embracing <mark>Hurley</mark>'s defensive mindset .\" We practiced hard at it and that's what we're definitely going to keep doing all season, \"said Adams who finished with a career-best four steals. <mark>Hurley</mark> has seen improvement in his team's defense since the beginning of the season. But he's far from satisfied .\" We made a big jump just in terms of numbers, \"<mark>Hurley</mark> said .\" Akok (Akok) has helped us so much at that end of the court. Guys are a year more experienced and we emphasize it every day. \"Your only chance to play in any type of significant way in March is if you're a top 50 defensive team. And we're right around that number right now in terms of efficiency. I didn't think we were great today. I thought we had some breakdowns and we'll look at it and get it fixed .\" News and notes The Huskies played without reserve Sidney Wilson, who's sidelined with a knee injury. He may be ready to return for Wednesday's game against Iona in Storrs. \"We got best case scenario news,\" <mark>Hurley</mark> said. \"We're hopeful that he'll be able to do more (Monday).\" ...GIlbert, who entered the game shooting 22 percent, made his first two shots--both three-pointers--and finished 5 for 8 from the field. \"It was just good to see the ball go in,\" said GIlbert, who had 11 points in the first half. g.keefe @ theday.com"}, {"articleID": "2011050617_00022795_W", "names": {"Michael Gould": ["Q6830705", "Q6830706"]}, "date": "2011-05-06", "url": "http://weaselzippers.us/2011/05/06/wiccans-druids-and-%e2%80%9cearth-centered-groups%e2%80%9d-get-their-own-outdoor-chapel-at-air-force-academy/", "content": "report: obama close to signing executive order forcing companies to disclose political donations prior to obtaining contracts? egypt: islamists march in tahrir square protesting killing of osama bin laden? report: obama close to signing executive order forcing companies to disclose political donations prior to obtaining contracts? report: obama close to signing executive order forcing companies to disclose political donations prior to obtaining contracts? egypt: islamists march in tahrir square protesting killing of osama bin laden? video: actress eva longoria discusses her role as obama adviser? wiccans, druids and \"earth-centered groups\" get their own outdoor chapel at air force academy? they still drug test in the military, right? (the blaze) - colorado springs, co is seen by many as the center of the christian evangelical community in the american west. so it is more than ironic that the united states air force academy, also based in colorado springs, has just opened a prayer circle and stonehenge-like area so that its wiccans, druids, and \"earth-centered groups\" have a place to worship. \"this outdoor worship space is something we have created to help people of all religions,\" lt. gen. <mark>michael gould</mark>, the academy's superintendent, told the gazette before a ribbon-cutting on the site. so how many people will this benefit? the gazette says there are 10 cadets who regularly attend \"earth-centered\" worship services, which encompasses new age religion, paganism, druids, ancient norse beliefs, and wicca."}, {"articleID": "2012042204_00044593_W", "names": {"David Lean": ["Q1175138", "Q16107019"], "John Mills": ["Q16201718", "Q17402961", "Q19520598", "Q24257027", "Q27915240", "Q48810303", "Q54901208", "Q58209206", "Q6248833"], "Robert Newton": ["Q39190184", "Q56084820", "Q7348021"]}, "date": "2012-04-22", "url": "http://playbill.com/news/article/165174-THE-DVD-SHELF-Brief-Encounter-Vanya-on-42nd-Street-A-Night-to-Remember-Fred-Astaire-Car-54", "content": "noel coward and <mark>david lean</mark>, including \"brief encounter\" ; the titanic tale, \"a night to remember\" ; louis malle's \"vanya on 42nd street\" ; fred astaire in \"the sky's the limit\" ; and more. * if ever you wonder why high quality films are frequently licensed by their owners to the criterion collection - and not just old, black & white classics - you need look no further than the new 4-disc set, <mark>david lean</mark> directs noel coward [criterion]. these are not significant studio money-earners, true; one of the titles is a beloved and iconic classic, another might be termed a minor classic of sorts, and the others are respected films that have been relatively out of view. what criterion has done and repeatedly does - besides the not-insubstantial act of simply making these titles readily available - is restore these films beyond measure, both picture and sound. which in the case of a stunning film like \"brief encounter\" is a true gift. criterion also crams their releases with bonus features; not the sort that you can find here or there, but things which people who love the film (s) in question will actually be eager to watch. they add a booklet of pertinent essays, too. criterion releases are, typically, somewhat more expensive than the plain variety reissue (with or without mastering, with or without bonuses). but the overall packages present true explorations of the film, not just simply a copy of the movie. <mark>lean</mark> - he of the sweeping \"bridge on the river kwai,\" \"lawrence of arabia,\" and \"doctor zhivago\" - does not necessarily seem an obvious match for the enfant terrible of the haymarket. but the pairing made perfect sense at the time. <mark>lean</mark> was already an expert editor, with credits including the film adaptations of shaw's major barbara. when coward was signed to direct his first film in 1942, he enlisted <mark>lean</mark> to co-direct. \"in which we serve,\" the earliest title in this collection, was a full-throttle patriotic paean to the british war effort, with coward starring, writing, producing, composing, and who knows what else. and, yes, co-directing with <mark>lean</mark>. coward based his script on a real-life event, the 1941 sinking of the hms kelly during the battle of crete. coward's friend lord louis mountbatten was in command; noel plays a fictionalized version of his friend, here called captain kinross. the film really does do its job, and does it well. the cast includes <mark>john mills</mark>, bernard miles, next up was \"this happy breed,\" in 1944. not quite so much a coward film as the first; while it was based on his 1942 play and he served as producer and co-composer, he was neither before the camera nor behind it. (coward did star in the original play .) this was a domestic tale of a british family between the wars. <mark>robert newton</mark> and celia johnson star, with especially watchable turns from kay walsh (<mark>lean</mark>), stanley holloway, and <mark>john mills</mark>. the latter had appeared in the stage version, as well as in \"in which we serve .\" he went on to star for <mark>lean</mark> in \"great expectations\" and \"ryan's daughter,\" receiving an oscar for his performance in the latter. during the making of these first two films, coward was raking in the pounds and dollars from his longest-running comedy success, blithe spirit. the 1941 play was simultaneously produced in london (where it opened at the piccadilly in july, for 1,997 performances) and new york (at the morosco in november, for 657). coward appeared in neither, presumably eschewing london so that he could recreate his direction in new york. he did, though, play the role in the u.k. tour which opened just after the 1942 release of \"in which we serve .\" blithe spirit brought enormous cheer to war-weary audiences, with the coward stand-in originated by cecil parker in london and rex harrison took the lead, supported by kay hammond (elvira) and margaret rutherford (madame arcati) from the west end company, along with constance cummings as ruth. <mark>david lean</mark>'s film of \"blithe spirit\" - produced by coward - remains a delightfully whimsical joy. the prize of the set, naturally enough, is \"brief encounter .\" here we have celia johnson (once again) and trevor howard in that railway station refreshment room, as rachmaninoff's second piano concerto swells on the soundtrack. \"brief encounter\" was derived from still life, one of the short plays that encompassed coward's 1936 tour-de-force tonight at 8:30. (these were ten one-acts - nine in new york - which were performed by coward and co-star gertrude lawrence over the course of three evenings; given coward's numerous professional activities, the runs were limited .) still life was significantly transformed by <mark>lean</mark> to become \"brief encounter\" ; this is a coward/lean collaboration, and an altogether magical one. which is to say that <mark>lean</mark> - before he approached that series of sweeping classics typified by \"lawrence of arabia\" - was indeed well suited to coward. related articles: 12 apr 2012--once upon a tune: a beloved film score is reinvented for broadway once upon a tune: a beloved film score is reinvented for broadway photo exclusive: backstage at broadway's once and the \"letterman\" set with j. michael zygo photo exclusive: backstage at broadway's once and the \"letterman\" set with j. michael zygo photo exclusive: behind the scenes on \"the today show\" set with broadway's photo exclusive: backstage at broadway's once and the \"letterman\" set with j. michael zygo old jews telling jokes 4000 miles man and superman magic/bird the best man priscilla...regrets the big meal new york pops gala seminar chicago gore vidal's the best man how to succeed...mamma mia! mary poppins rock of ages sister act the dvd shelf: \"brief encounter,\" \"vanya on 42nd street,\" \"a night to remember,\" fred astaire, \"car 54\" drew overcash's by your side concert, with richard h. blake, nick cartell, rebecca larkin, offered april 22 suddenly, three more: songwriter alan menken scores a trio of broadway shows steamy streetcar revival, with blair underwood and nicole ari parker, opens on broadway"}, {"articleID": "2012091917_00033285_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2012-09-19", "url": "http://foxnews.com/opinion/2012/09/19/mitt-romney-and-disappearing-evangelical-dilemma/", "content": "republican presidential candidate mitt romney speaks at the faith and freedom coalition in washington june 3, 2011. (reuters) may 12, 2012: mitt romney speaks at the liberty university commencement ceremony in lynchburg, va. reuters next slide previous slide nearly one year ago i ignited a national discussion about mitt romney's religious faith by labeling mormonism as a \"cult .\" although i readily acknowledged that romney's mormonism did not disqualify him from the presidency (and that i would prefer him to president obama), i did predict that if romney became the republican nominee, president obama would win a second term. i'm now willing to admit my prognostication may have been premature for several reasons. i had based my prediction of romney's defeat on the belief that enough evangelicals would stay at home in november due to a lack of enthusiasm for a romney presidency. some evangelical christians have been troubled by romney's mormonism, while others are disturbed by his lack of a consistent, conservative record on social issues. since evangelicals historically have voted overwhelmingly for republicans, it would not take many evangelicals sitting out this election to ensure an obama victory. for example, in 2004 george w. bush garnered 79 percent of the evangelical vote and won a second term; yet, in 2008 john mccain captured 73 percent of the evangelical vote and lost to barack obama. i had no reason to think that evangelicals would be any more enthused about mitt romney than they were about john mccain. but over the last 11 months three developments have changed my mind about romney's appeal to evangelical voters. first, many evangelical christians are incensed by the obama administration's relentless assaults on religious freedom. in october of 2011, the obama justice department argued before the supreme court in the case of hosanna-tabor evangelical lutheran church and school v. eeoc that the ministerial exemption to federal hiring standards should be rescinded. the revocation of that exemption would mean that churches could be forced to violate their doctrinal beliefs and hire homosexuals as pastors or women as priests. an astonished supreme court asked the obama representative if the federal government should have jurisdiction over whom a church hired as its minister and the representative said \"yes .\" fortunately, the supreme court unanimously rejected that claim. yet, the fact that the obama administration would state such a position should be chilling to people of any faith. i had no reason to think that evangelicals would be any more enthused about mitt romney than they were about john mccain. but over the last 11 months three developments have changed my mind about romney's appeal to evangelical voters. - evangelicals were similarly angered in january, 2012 by the mandate issued by u.s. department of health and human services requiring organizations to provide contraceptives, sterilization services, and abortion-inducing drugs to its employees. although there was a narrow religious exemption to this order, religious charities and hospitals were required to violate their beliefs and offer these \"benefits .\" in a demonstration of spiritual solidarity, evangelicals and catholics joined together to protest this outrageous example of governmental overreach into religious institutions. to date, there has been no satisfactory resolution of this crisis and both pastors and priests have said they would choose prison over compliance with obama's edict. a second milestone development this past year was president obama's public approval of homosexual marriage in may of 2012 which has both energized efforts of evangelical republicans and at the same time diminished his support among evangelical democrats (primarily hispanics and african-americans). one does not have to be a homophobe to understand that it is impossible to reconcile homosexual marriage with the teaching of jesus christ who described god's design for marriage as one man and one woman in a lifetime relationship (matthew 19:4 -6). any deviation from that standard-adultery, polygamy, pre-marital sex, or homosexuality-is a sin according traditional christian and jewish teaching. beyond the theological objection to homosexual marriage, evangelicals see a flood of societal problems that will be unleashed on a country that attempts to redefine marriage. numerous studies have demonstrated that depression, incarceration, and even suicide are more prevalent among children who are not reared by their biological father and mother. princeton university sociologist sara mclanahan and others have noted that the ideal situation for a child is to be in a family with both biological parents. that reality may have been the impetus for cardinal timothy dolan's benediction at the democratic national convention (which had just adopted a platform supporting homosexual marriage .) \"empower us with your grace, so that we might resist the temptation to replace the moral law with idols of our own making, or to remake those institutions you have given us for the nurturing of life and community .\" president obama's support of homosexual marriage is not only igniting support among evangelical republicans but will also suppress voter turnout among evangelical african-americans and hispanics. i have a number of minorities in my church who voted for president obama in 2008 but are finding it difficult to support him in 2012 because they cannot reconcile his stance on homosexual marriage with their christian faith. they are insulted by those who would compare the fight for \"marriage equality\" with their centuries-long struggle for civil rights. as one african-american clergyman in our area said, \"don't equate sin with the color of my skin!\" these evangelical christian minorities are not going to suddenly transform into republican supporters of mitt romney. they will simply sit out this election which in a close election could be enough to deny president obama a second term. finally, romney's selection of <mark>paul ryan</mark> as his running mate sent a strong signal to evangelicals that they would have someone in the white house who represents their values. had romney picked a pro-choice vice-presidential candidate like former secretary of state condoleezza rice or new jersey governor chris christie, it would have only confirmed many evangelicals' suspicion about romney-that his conversion to conservatism was a matter of convenience rather than conviction. however, <mark>paul ryan</mark>'s strong pro-life record and unapologetic support for traditional marriage have assured evangelicals that when it comes time to nominate the next supreme court justice there will be someone at the table who represents their values. i don't pretend to know whether mitt romney will win on november 6. however, i am certain that president obama's hard turn to the left and romney's selection of <mark>paul ryan</mark> have made mitt romney much more palatable to evangelical christians-like me. dr. robert jeffress is pastor of the 11,000-member first baptist church in dallas, texas and hosts a daily radio program heard on 722 stations nationwide. print email share comments recommend tweet related video mitt romney responds to \"secret video' on neil cavuto related stories could religion tip the election? poll: qualms about mormonism widespread, but may not impact romney's run for the presidency"}]