[{"articleID": "2008103119_00023854_W", "names": {"James Dodson": ["Q6132686", "Q6132687"], "John Tucker": ["Q28946890", "Q29344907", "Q42292588", "Q6261352", "Q6261353", "Q6379336"], "John Rowland": ["Q20821172", "Q6255828"]}, "date": "2008-10-31", "url": "http://rediff.com/rss/redirect.php?url=http://www.rediff.com/movies/2008/oct/31jesse.htm", "content": "] television series has made him famous, can spin off a dozen stories of shooting his newest film the other end of the line, in mumbai. \"i think i will never forget my indian stay,\" he says, \"but if there is one thing that sticks up, â it is an unscripted scene that director <mark>james dodson</mark> shot .\" the scene involved metcalfe racing through mumbai traffic. \"it was actually the mumbai traffic,\" he says, laughing. \"no roads were shut down to shoot the scene. we trusted our luck and shot it, and i am proud the way it came out .\" to the american popular media, jesse metcalfe is a \"shirtless beef,' as one fan magazine wrote. he is also known for the film <mark>john tucker</mark> must die, a modestly budgeted comedy, which went to earn about $40 million in north america. the film was a hit in many countries in europe, earning about $10 million from its british and german run alone. also read:\" excellent chemistry between jesse & shriya' this is the first time he is cast oppositeâ an indian actress, shriya saran]. â the other end of the line is a cross cultural love story produced by ashok amritraj and distributed in north america by mgm. it opens today in the us. the film focuses on an unlikely romance between a spunky indian call center operator (shriya) and an american customer (metcalfe) she falls in love without meeting him. ditching her indian fiancï ¿ 1/2, and without telling him or her parents, she flies into san francisco and makes many discoveries, some pleasant, some disturbing and a few startling. \"my character in the film learns to connect the two cultures--american and indian,\" jesse says. \"i think i was able to do so in my own life. so i will always say that this film was a life-enhancing experience .\" the film created quite a bit of buzz not only for metcalfe but also shriya, who is featured in her first hollywood film. shriya, who has worked in 30 films in the last six years (including the rajnikanth-starrer sivaji: the boss), could not have asked for a bigger hollywood break than \"what makes the other end of the line a unique project for metcalfe is that he fell in love with his co-star, shriya saran,' wrote boxofficeprophets.com .\" that's right. one of the hottest actresses in bollywood is now hooking up with one of the hottest actors in hollywood, creating the possibility of some sort of ethnically diverse super-baby down the line .' \"everything that happened in this film was quite spontaneous,\" says metcalfe. \"we got along fabulously well with our indian co-artistes including anupam .\" ] plays shriya's nervous father, who follows her to san francisco along with his wife, hoping to persuade her to return to india to her fiancï ¿ 1/2. metcalfe says he chose the film \"because every artist looks for a film to advance his or her career .' in an interview with an american magazine he said he doesn't miss his role as the gardener in desperate housewives. he acknowledges that it was a huge opportunity and he had a lot of fun .\" but leaving the show was a blessing because i could have still been playing <mark>john rowland</mark> five years later,' he had said. \"now, i've gotten to play some really interesting, complex characters in feature films .'\" i came back from mumbai having glimpsed an entirely new and vibrating culture, \"he said .\" i think i grew as a person spending several weeks shooting in mumbai. i got to know the city quite well.â initially, like any other american tourist, i underwent a cultural shock. the city is densely populated. it has plenty of beauty and plenty of poverty. but i also realised soon that the poor people were trying to be resourceful and weren't taking their poverty for granted. and they had a sense of community. and many of them were trying to empower themselves. \"much of the film, including the hotel and restaurant scenes that take place in san francisco and new york, were shot in mumbai."}, {"articleID": "2020020906_00056296_W", "names": {"Chris Matthews": ["Q15735939", "Q25189328", "Q5107375", "Q5110828", "Q5112832", "Q948687"], "Chris Hayes": ["Q22944815", "Q5106834", "Q5106835", "Q5106836", "Q5106837", "Q541742", "Q55362566"], "Lawrence O'Donnell": ["Q6504428", "Q962974"], "Joy Reid": ["Q16499823", "Q5403050"]}, "date": "2020-02-08", "url": "https://www.newsweek.com/msnbc-host-chris-matthews-ties-bernie-sanders-fears-socialist-executions-central-park-fidel-1486375", "content": "Share Politics <mark>Chris Matthews</mark> Msnbc Socialism Fidel castro MSNBC host <mark>Chris Matthews</mark> warned that if Vermont Senator Bernie Sanders wins the 2020 election there could be socialist-led executions in Central Park. <mark>Matthews</mark> offered his latest on-air rant against the Sanders campaign and his supporters after the Democratic presidential debate Friday night. The longtime MSNBC political analyst warned viewers what might have happened if Fidel Castro and \"the Reds\" had won the Cold War, suggesting Sanders would have supported public executions of the late Cuban leader's perceived enemies. <mark>Matthews</mark> demanded to know if Sanders supports Castro's style of communism or if he's truly a backer of democratic socialist-style governments such as Denmark. Here's the video of the moment...It really is something pic.twitter.com/uKS3vxuyX1--Kombiz Lavasany (@ kombiz) February 8, 2020 Visibly-shocked fellow MSNBC panel members <mark>Chris Hayes</mark> and <mark>Lawrence O'Donnell</mark> attempted to interject, as <mark>Matthews</mark> said he may have been executed in Central Park if capitalism hadn't defeated socialism during the Cold War. Related Stories Bernie Sanders Calls Out Pete Buttigieg And Mike Bloomberg Who Won the Eighth Democratic Debate in New Hampshire? Sanders Claims Victory in Iowa at CNN Town Hall, Says He's Not Frontrunner \"I have my own views of the word\" socialist' and I'd be glad to share them with you in private, \"<mark>Matthews</mark> said Friday night after the Democratic debate .\" They go back to the early 1950s. I have an attitude about them. I remember the Cold War, I have an attitude towards Castro. I believe if Castro and the Reds had won the Cold War there would have been executions in Central Park and I might have been one of the ones getting executed. And certain other people would be there cheering, okay? \"So I have a problem with people who took the other side. I don't know who Bernie has supported over these years, I don't know what he means by socialism--one week it's Denmark, we're going to be like Denmark. Okay, that's harmless. That's basically a capitalist country with good social welfare programs. Denmark .\" MSNBC panelist and host <mark>Joy Reid</mark> also expressed her fear about videos or comments Sanders may have made in the past \"praising the version\" of socialism which could be used against him in a general election. \"What does he think of Castro? That's a good question, what's he think of Fidelismo?\" <mark>Matthews</mark> continued. \"We all thought he was great when he first came out. I cheered like mad for him when he first went in and then he became a communist and started shooting every one of his enemies. You've got to make those judgments .\" <mark>Hayes</mark> interjected that Sanders is \"pretty clearly in the Denmark category\" of mixed capitalist and socialist-style policies, which <mark>Matthews</mark> promptly questioned: \"Is he? How do you know? Did he tell you that?\" During the recent Iowa caucuses, <mark>Matthews</mark> claimed the only reason Sanders could win the contest is because \"socialists love meetings,\" similar to the caucus process. He referred to an Oscar Wilde quote about how socialism is hard to sell because \"it takes too many meetings .\" Newsweek reached out to <mark>Matthews</mark>' representatives for comment Saturday. MSNBC analyst <mark>Chris Matthews</mark> demanded to know Bernie Sanders' stance on Fidel Castro, tying the Vermont Senator to \"executions in Central Park\" led by Cold War communists. Screenshot: MSNBC <mark>Matthews</mark> continued his rant against socialism as a term: \"Some people like it, younger people like it, but those of us like me, who grew up in the Cold War and saw some aspects of it, if there visiting places like Vietnam, like I have, [and seeing countries] like Cuba, being there, I've seen what socialism's like, I don't like it. It's not only not free, it doesn't fricking work!\" Request Reprint & Licensing, Submit Correction or view Editorial Guidelines"}, {"articleID": "2013081409_00054206_W", "names": {"Adam Scott": ["Q201842", "Q350869"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2013-08-14", "url": "http://au.news.yahoo.com/a/-/sport/18495700/cancer-survivor-lyle-to-return-to-golf/", "content": "SYDNEY, New South Wales (AFP) - Australian golfer Jarrod Lyle will make a return to professional golf at the Australian Masters in November after an 18-month battle with cancer, organisers said Wednesday. Lyle, a member of the US PGA Tour, was diagnosed with a recurrence of the leukaemia he battled as a teenager in March last year and has been sidelined since. But the 31-year-old has agreed to make his return at the Australian Masters from November 14-17, where he will share the limelight with US Masters and defending champion <mark>Adam Scott</mark> and America's world No. 6 Matt Kuchar. \"I've made the decision to play the Masters this year as a test to see where everything is at before I look to head back to the States and the PGA Tour,\" Lyle said on the tournament website. \"That first tee shot is going to be for everybody who's supported me through all of this, but especially for my girls, Bri and Lusi,\" he added, referring to his wife and young daughter. \"I will be smiling from ear to ear for at least 36 holes. I'll enjoy the whole atmosphere, whether I play well or not .\" Lyle last played on the PGA Tour at the Mayakoba Golf Classic in Mexico in early 2012 where he finished in a tie for 37th. <mark>Tony Abbott</mark> makes \"captain's call' to preference Labor over Greens; move will put pressure on Adam Bandt Two fishermen rescued after cray boat broke anchor and washed up on island off Shark Bay Two fishermen rescued after cray boat broke anchor and washed up on island off Shark Bay"}, {"articleID": "2016081823_00090353_W", "names": {"Steve Green": ["Q16729431", "Q281452", "Q3973339", "Q3973340", "Q41773462", "Q43273454", "Q7612708", "Q7612709"]}, "date": "2016-08-18", "url": "http://www.stuff.co.nz/business/farming/83343715/Overseas-drinkers-quaff-New-Zealand-wines", "content": "Overseas drinkers quaff New Zealand wines GERARD HUTCHING Last updated 10:27, August 19 2016 Wine exports are on track for $2 billion in earnings by 2020. Overseas consumers' taste for New Zealand wine has lifted exports to just under $1.6 billion for the last year, up 10 per cent on the year before. The United States market jumped by 23 per cent, from $372 million in 2015 to $460m to the end of June 2016. Other leading export destinations include the United Kingdom ($381m), Australia ($361m), Canada ($107m), and the Netherlands ($44m). China, which has grown from practically nothing 10 years ago, is now worth $27.5 m, although it slipped in value slightly from the year before. Hong Kong, regarded as a separate market, recorded $17m in exports. New Zealand Winegrowers chairman <mark>Steve Green</mark> said this year marked the 21st in a row that wine exports had grown, and the industry was on target to reach its goal of $2b by 2020. \"This continued strong performance is testament to underlying market and consumer demand for our wines in key markets,\" <mark>Green</mark> said. Export volumes are expected to rise by a further 10 per cent over the next 12 months, following the 2016 grape harvest of 436,000 tonnes, 34 per cent higher than last year. By volume of variety, sauvignon blanc is by far the leader at 303,000 tonnes, followed by pinot noir (35,000 tonnes), chardonnay (29,000 tonnes), pinot gris (25,000 tonnes), and merlot (9000 tonnes). The total vineyard area is 36,000 hectares, predicted to grow to about 40,000 ha over the next four years. Wine is now New Zealand's sixth largest export good by value. Ad Feedback - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Farming story: Old school thinking stunts export gains Business Homepage"}, {"articleID": "2015072414_00162101_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2015-07-24", "url": "http://www.smh.com.au/entertainment/books/bookmarks-news-and-views-from-the-book-world-20150721-gigwm7.html", "content": "Bookmarks: News and views from the book world Books The Bros Karamazov. Seuss and the Lee factor In all the fuss about the publication of Harper Lee's Go Set a Watchman, it might be forgotten there is another literary giant who has a forgotten book coming out this month in the US. Dr Seuss' What Pet Should I Get? is published on July 28 and while it is not necessarily going to affect the moral standing of characters such as the Cat in the Hat or the Grinch, Random House has ordered a print run of 1 million copies. That doesn't quite match the 1.1 million copies of Watchman sold in the US in the first six days after publication last week. But it's still an event, even if old but unseen manuscripts by Dr Seuss--real name Theodor Geisel--keep popping up; this one was found by his widow, Audrey. To match the occasion, New York Times reviewer Michiko Kakutani produced her review in rhyme to match that of Dr Seuss. \"Seuss never spoke down to his readers, no matter how small. / His tales were told with vim, vigour and zest. / What Pet Should I Get? entertains us just fine. / Who cares if this book's not really his best?\" Doing evil on a Wednesday When philosopher Raimond Gaita heard Prime Minister <mark>Tony Abbott</mark> describe one of the Islamic State beheadings as pure evil, it set him thinking about how politicians use the term evil and what effect it has. People feel uneasy \"because they believe the use of the term betrays moral simplification and a desire to demonise those who are accused of being or having done evil\". But scepticism, he argues, about the use of such terms does not inevitably mean scepticism about the need for moral judgment in politics. And so Gaita arrived at the theme for his annual Wednesday lectures, beginning July 29, which will be run for the next six weeks in the public lecture theatre of the Old Arts Building at the University of Melbourne. Among the speakers are Gaita himself on \"Politics and the Idea of Evil\" , Anne Manne on \"The Anders Breivik Massacre: The Psychology of Evil\" , and Timothy Lynch on \"Good and Evil in American Politics\". The lectures are free. Bookings: alumni.online.unimelb.edu. au. Advertisement Books to set the heart racing Melbourne's Rare Book Fair continues this weekend with some fabulous offerings available for viewing and purchase. If you're a mad Jane Austen fan and have a spare $210,000 you could pick up a three-volume, first edition of Pride and Prejudice from London dealer Peter Harrington. His big-money offering, though, is a first edition of Sir Thomas More's Utopia--yours for $1.5 million. Closer to home, Kay Craddock has a catalogue of about 100 Arthur Upfield books, including 26 signed first or presentation editions. Prices range from $200 to $6000. The fair is at the University of Melbourne's Wilson Hall and admission is free. rarebookfair.com"}, {"articleID": "2018110713_00172049_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}, "date": "2018-11-07", "url": "http://macarthuradvertiser.com.au/story/5746566/pacific-2b-fund-in-foreign-policy-shift/?cs=9397", "content": "<mark>Scott Morrison</mark> is to announce a $2 billion Pacific infrastructure fund. A $2 billion fund will be created for infrastructure investment in the Pacific as <mark>Scott Morrison</mark> puts Australia's island nation neighbours at the centre of foreign policy. Defence links will also be beefed up, with more training of Pacific militaries and regular Navy deployments. In a speech in Townsville on Thursday, the prime minister will outline how Australia will make sure it is the first choice for Pacific nations on security, culture and the economy. \"My government is returning the Pacific to where it should be - front and centre of Australia's strategic outlook, foreign policy and personal connections, including at the highest levels of government,\" Mr <mark>Morrison</mark> will say. China has increasingly moved into the region with loans for infrastructure but Mr <mark>Morrison</mark> wants Australia to be the first port of call for Pacific nations. He's announcing the creation of an Australian Infrastructure Financing Facility for the Pacific to develop energy, communications and transport projects. \"This $2 billion infrastructure initiative will significantly boost Australia's support for infrastructure development in Pacific countries and Timor Leste,\" he says. \"It will use grant funding combined with long term loans to support high priority infrastructure development .\" A further $1 billion will go to Efic, Australia's export financing agency, to support Australian businesses active in the Pacific. Australian navy boats will be deployed to the Pacific for training and exercises using the new Guardian patrol boats Australia is giving to island nations. Defence, police and border security chiefs will also be invited to annual meetings. Mr <mark>Morrison</mark> will also speak to commercial TV networks about getting more Australian TV programming and sport available in Pacific countries. \"Our Pacific family switching on to the same stories, news dramas and sports we are watching at home,\" he says. Australia's diplomatic network is already larger than any other country in the Pacific but it will be expanded with posts in Palau, the Marshall Islands, French Polynesia, Niue and the Cook Islands. \"This will mean Australia is represented in every member country of the Pacific Islands Forum,\" Mr <mark>Morrison</mark> says. A new sports pathway program will also provide stronger sporting links between the Pacific, which has a population of more than 11 million, most of them in Papua New Guinea. Mr <mark>Morrison</mark> will host a barbecue for Pacific leaders at the APEC conference in Port Moresby next weekend. \"It's time to open a new chapter in relations with our Pacific family,\" Mr <mark>Morrison</mark> says. Australian Associated Press facebook SHARE twitter TWEET email whatsapp"}, {"articleID": "2015120715_00077102_W", "names": {"David Chandler": ["Q22574995", "Q51686959", "Q5232289", "Q56855054"], "Charles Clark": ["Q2958739", "Q29613595", "Q5076287"]}, "date": "2015-12-07", "url": "http://yallpolitics.com/index.php/yp/post/gov._phil_bryant_appoints_justice_david_chandler_to_dfc_director_-_creates_/", "content": "Gov. Phil Bryant appoints Justice <mark>David Chandler</mark> to DFC director - creates MSSC vacancy <mark>Chandler</mark> named Division of Family and Children's Services Executive Director Governor Phil Bryant announced today that he has named Mississippi Supreme Court Justice <mark>David Chandler</mark> the Executive Director of The Division of Family and Children's Services. The appointment is effective immediately. <mark>Chandler</mark> will vacate his seat on the court. In his post, <mark>Chandler</mark> will oversee the state's child welfare and foster care systems. This is the first time the DFCS Executive Director will be a cabinet-level position that reports directly to the Governor. This change is the result of a recent court order in long-running federal litigation. \"I deeply appreciate the trust and confidence Governor Bryant has shown in me by appointing me to this important position,\" <mark>Chandler</mark> said. \"It is a distinct honor, and I gladly accept the appointment. It is also a tremendous responsibility. Our Mississippi children who are placed in the care of the state are some of our most precious citizens. They find themselves without a family through no fault of their own, and we must do everything in our power to keep them safe and see that they are afforded proper food, shelter and clothing. We must pursue every avenue available to us to help them find the family that is meant for them. I promise you that this will be my goal and I will work as hard as I know how to accomplish it. I know the Governor is committed to the same .\" <mark>Chandler</mark> was born in Kosciusko and moved with his family to Weir just before his first year of school. He graduated from Weir High School and then attended Mississippi State University, where he earned his bachelor's, master's and doctoral degrees in education. <mark>Chandler</mark> earned his Juris Doctorate from the University of Mississippi School of Law and his Master of Laws in the Judicial Process from the University of Virginia School of Law. \"I am extremely pleased that Justice <mark>Chandler</mark> is taking on this critical role,\" Governor Bryant said. \"His experience and ability will be invaluable in making sure our foster care system operates safely and efficiently .\" <mark>Chandler</mark> spent the first 20 years of his professional career in education. For approximately 10 years, he served as a teacher, counselor, school psychometrist and administrator with the Choctaw County public schools. <mark>Chandler</mark> then moved to the college level, where he served as a research and curriculum specialist at Mississippi State University. In this capacity, he directed the development of curriculum material for secondary and post-secondary work force training programs. His work was designed to provide a more skilled workforce in order to attract business and industry to Mississippi. Following law school, <mark>Chandler</mark> practiced law in Tupelo. In January 2000, his law firm opened a branch office in Choctaw County, where he served as the attorney for the Board of Supervisors, a position he held until beginning his service on the Mississippi Court of Appeals in January 2001. He also served as municipal judge for his hometown of Weir from 1999 until beginning work on the appellate court. <mark>Chandler</mark> was elected to the Mississippi Court of Appeals in November 2000, and re-elected, without opposition, in 2006. After serving as a judge on the Court of Appeals for eight years, he was elected to the Mississippi Supreme Court. He commenced his duties as a Supreme Court justice on January 1, 2009. <mark>Chandler</mark> has served on numerous committees, including chairman of the Court of Appeals Rules Committee and co-chairman of the Professionalism Committee of the Mississippi Bar, as well as serving as a member of the Supreme Court Committee on Administrative and Related Matters. He presently serves as chair of the Mississippi Continuing Judicial Education Committee. He serves as adjunct professor at Mississippi College School of Law, where he teaches judicial administration, and he is a member of the <mark>Charles Clark</mark> Inns of Court. He was named the 2010 Alumnus of the Year by the Mississippi State University College of Education. Throughout his career, <mark>Chandler</mark> has authored professional articles in the field of education as well as in the legal field. In July 2007, <mark>Chandler</mark> had published an article in the professional journal for Mississippi Bar members. The article addressed methods of improving professionalism among lawyers. His thesis for his LLM degree consisted of a comprehensive analysis of Mississippi statutory law pertaining to acts of violence committed on school property. Since becoming a member of the appellate courts of Mississippi, <mark>Chandler</mark> has authored well over 600 opinions. <mark>Chandler</mark> is a member of the Tupelo Bar Association, the Mississippi Bar and the American Bar Association. He and his wife, Glenda, reside in Louisville, where they are members of First United Methodist Church. <mark>Chandler</mark> will start serving on the church's board of directors in January. He is the proud father of two sons. Gov. Phil Bryant Press Release 12/7/15"}, {"articleID": "2019081408_00212944_W", "names": {"David Hughes": ["Q10557465", "Q16179032", "Q16864051", "Q26324374", "Q3017347", "Q5235214", "Q5235219", "Q5235220", "Q5235224", "Q5235226", "Q5235227", "Q5235228", "Q5235229", "Q5235231", "Q5235236", "Q53955926", "Q56596954"], "Robert Nisbet": ["Q16292939", "Q21999572", "Q7348044"]}, "date": "2019-08-14", "url": "https://www.midhurstandpetworth.co.uk/news/politics/cheaper-train-travel-for-sussex-teenagers-1-9032650", "content": "Cheaper train travel for Sussex teenagers New 16-17 Saver offering discounted rail travel for young people Published: 06:47 Wednesday 14 August 2019 Share this article A brand new 16-17 Saver guaranteeing half-price travel for young people will launch next week. Discounted train tickets will benefit students attending sixth-form or college and those beginning an apprenticeship or entering the world of work from September. New 16-17 Saver offering discounted rail travel for young people The new saver will mean that young people are eligible for a child rail fare until their 18th birthday. It will be available to buy for £ 30 online from Tuesday August 20 at 9am at www.16-17saver.co.uk The discount will be available on most rail travel including peak and season tickets. The Government forecasts the new 16-17 Saver will save young people and their families an average of £ 186 a year. Rail minister Chris Heaton-Harris said: \"The brand-new saver means that a generation of rail passengers can now benefit from cheaper fares, keeping money in their pocket and helping them get to school, college and work .\" We want to create a railway system that's fit for the 21st century and provides a reliable, punctual journey. \"It's tempting to say fares should never rise, but the truth is that if we stop investing in our railways then we'll never see it improved .\" <mark>David Hughes</mark>, chief executive of the Association of Colleges, added: \"This rail discount for 16 and 17-year-olds is a huge step in the right direction and will help to alleviate the financial pressures facing young people and their families across the country .\" Many from disadvantaged backgrounds find themselves making difficult choices about their future based on how much their journey to college will cost, increasing the pressures of staying in education. \"Travel costs should never be a barrier to education, today's announcement will give a much needed helping hand to thousands who rely on rail travel to access education and training .\" The 16-17 Saver can also be purchased by calling 0345 301 1656. <mark>Robert Nisbet</mark>, director, nations & regions at the Rail Delivery Group, said: \"The launch of the 16-17 Saver, in partnership with the Department for Transport, demonstrates the rail industry's commitment to providing the best value fares for all customers .\" There are 1.2 m people aged 16 or 17 years in Great Britain--working together, we want to ensure they can access affordable rail travel with the new 16-17 Saver. \"Trending How much would it cost to buy The Fox Goes Free pub in Charlton? Shocking footage as bikers in Petworth narrowly avoid a head-on crash Sussex pier and seafront shut down after\" hazardous material' causes vomiting and sore eyes Two arrested after man stabbed in West Sussex village \"Major accident' blocks road on A259 The Essentials"}, {"articleID": "2018122416_00861721_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2018-12-24", "url": "http://www.gamereactor.eu/games/39904/Red", "content": "RED DEAD REDEMPTION 2 REVIEW. Written by Magnus Groth-Andersen on the 25th of October 2018 at 12 \"A watershed moment, an instant classic, another high point for a studio which has constantly delivered them for decades .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 17th of December 2018 at 12:58 A ton of games have had sales boosts this past week, meaning a bit of a shake-up at the higher end of the charts. 0 NEWS. Written by Christian Gaca on the 13th of December 2018 at 10:45 Rockstar has released title update 1.04 for Red Dead Redemption 2, which is great news of course, and even better is the fact that it also impacts the Red Dead Online...0 NEWS. Written by Christian Gaca on the 12th of December 2018 at 10:34 Due to the Switch's hybrid capabilities, it's always nice to have the big releases launch on Nintendo's platform as well, and Red Dead Redemption 2 is certainly one we...0 NEWS. Written by Arya W. Wibowo on the 11th of December 2018 at 11:20 It's been almost two weeks since Red Dead Online first launched in its beta form, and now someone might have just discovered a new mode coming to the game, which could be ..."}, {"articleID": "2009022201_00023847_W", "names": {"Chris Simms": ["Q5108059", "Q5108061"], "Jeff Garcia": ["Q1373024", "Q3990"]}, "date": "2009-02-22", "url": "http://nbcchicago.com/sports/football/Kurt-Warner-Is-Not-Out-Of-The-Picture.html", "content": "how good would warner be if instead of boldin and fitzgerald he had hester and, uh, whoever else the bears trot out there? just when you thought that the only options the bears had to find competition for kyle orton were whatever they could find in the dumpsters outside of other team's facilities--we're looking at you <mark>chris simms</mark>--another possibility gets thrown back into the fray. kurt warner has decided he wants to play another year in the nfl, but he's not sure where. warner's preference is still to play and finish his career in arizona where his family lives, but after the cardinals super bowl loss warner was saying it was either the cardinals or retirement. now according to his agent, mark bartelstein, \"yes he's going to play,\" bartelstein told the tribune on friday after a morning meeting with the cardinals. \"and arizona's definitely his first choice. but if we don't get something done...nothing is done as of yet .\" as for the bears, though warner would be an upgrade over kyle orton at this point, signing him or somebody like <mark>jeff garcia</mark> may prove to be counterproductive. neither warner or <mark>garcia</mark> are spring chickens and would only serve as quarterbacks of the year. orton, while still needing some work, has a much better chance at being the quarterback of the future, so if the bears can't find another possible long-term solution, they'd be better off just holding on to orton and trying to find another option in the draft. along with writing for nbcchicago.com, tom fornelli can also be found contributing at"}]