[{"date": "2014-12-05", "url": "http://latino.foxnews.com/latino/entertainment/2014/12/05/sofia-vergara-reveals-passed-her-us-citizenship-with-perfect-score", "content": "<mark>Sofia Vergara</mark> attends the Hollywood Foreign Press Association's Grants Banquet on August 14, 2014 in <mark>Beverly Hills</mark>. <mark>Sofia Vergara</mark> revealed on \"<mark>Jimmy Kimmel</mark> Live\" that she has completed the process of being a U.S. citizen - she even got a perfect score on her citizenship test. \"I didn't know that you went through the official process of becoming an American citizen,\" <mark>Kimmel</mark> noted at the beginning of the interview. \"That's good news for us .\" \"You though I was here illegal?\" the Colombian native quipped back. \"I mean I couldn't be illegal and show my face on national TV. I mean I would have to be low key .\" <mark>Vergara</mark>, 42, said her process to become a U.S. citizen was not made easier because of her celebrity status. She said she had to jump through all the hoops \"because they have to make sure that you deserve to be part of the country .\" \"The most interesting thing for me was they give you like a hundred questions that you have to learn, and then they give you a quiz, like a test, and then you swear you are going to fight for the United States,\" she said. <mark>Vergara</mark> went on to say that it was a \"very emotional moment\" for her. \"It took me a lot of time to get my residency even though I was working here for a long time,\" she explained. \"But it was fun, and I got all my questions perfect .\" <mark>Sofia Vergara</mark> gushes about boyfriend Joe Manganiello, has awkward run-in with ex <mark>Vergara</mark> says she seduced boyfriend Joe Manganiello...with her smell Miss BumBum runner-up hospitalized after bad plastic surgery to enlarge thighs Topless Miss Bum Bum contestant shows off her assets in Paris Move over Kim Kardashian, Indianara Carvalho crowned Miss BumBum 2014 Colombian cycling team defends racy uniform: \"we are not considering changing it' The Miss BumBum Girls Go Selfie Crazy Mexican version of Miss BumBum competition now seeking\" aesthetic behinds' Piñata of nude Kim Kardashian turns tiny Mexican shop into international sensation Cámara de EE. UU. aprueba el bloqueo al alivio migratorio anunciado por Barack Obama Al menos 22.000 policías de Nueva York serán reentrenados para evitar nuevos incidentes Nuevo caso: Policía mata a un afroamericano desarmado en la ciudad de Phoenix, Arizona Peña Nieto anuncia \"Estrategia Emergente para la Reactivación Económica\" en Guerrero Christina Milian--All I Want for Christmas From Lil Wayne Is...Ariana Grande--I Can Make You Hot...With My Chocolate (PHOTO) Ariana Grande--Obsessed Fan in Santa Suit Placed on Psych Hold Splurge-Worthy Christmas Gifts That Will Delight Friends This Christmas", "articleID": "2014120513_00073352_W", "names": {"Sofia Vergara": ["Q231911", "Q28111741"]}}, {"date": "2014-12-05", "url": "http://www.cbronline.com/news/govt-invest-10m-to-bring-driverless-cars-to-uk-roads-4461250", "content": "Gov' t invest £ 10m to bring driverless cars to UK roads Greenwich, Bristol, Coventry and Milton Keynes selected by Innovate UK to trial driverless cars. Four UK cities including Greenwich, Bristol, Coventry and Milton Keynes have been selected by Innovate UK to trial driverless cars. The formal trials are aimed at finding how driverless cars could be integrated into everyday life across the country, in order to better understand how driverless technology will interact with people. The UK Government has already funded £ 10m for the driverless cars competition and has the announced an additional £ 9m to help the cities implement the initiative. Bristol is planning to form a consortium, which is aimed at knowing how driverless cars can make roads safer and reduce congestion. Greenwich is expected to run the Gateway scheme which will test automated passenger shuttle vehicles and autonomous valet parking for adapted cars. Milton Keynes and Coventry will be working together on the UK Autodrive programme, which is aimed at developing technologies for integration into existing roads and the surrounding infrastructure to facilitate vehicle navigation. The programme is also expected to help the public get accustomed to seeing such vehicles on the road. Innovate UK lead technologist <mark>Nick Jones</mark> said: \"Cars that drive themselves would represent the most significant transformation in road travel since the introduction of the internal combustion engine and at Innovate UK; we want to help the UK to lead the world in making that happen .\" \"There are so many new and exciting technologies that can come together to make driverless cars a reality, but it's vital that trials are carried out safely, that the public have confidence in that technology and we learn everything we can through the trials so that legal, regulation and protection issues don't get in the way in the future .\" ICT Priorities in Financial Markets - Enterprise ICT investment plans Teneo is an infrastructure optimization company, providing solutions that help customers with the management, performance and virtualization of...Absolute ® Software specialises in technology and services for the management and security of mobile computers and smartphones. Webroot - Security Solutions Webroot provides industry leading security solutions for consumers, enterprises and small and medium businesses worldwide.", "articleID": "2014120516_00022343_W", "names": {"Nick Jones": ["Q16229192", "Q17198222", "Q24799774", "Q3876016", "Q52892180", "Q7027374", "Q7027375"]}}, {"date": "2014-12-06", "url": "http://upi.com/Top_News/World-News/2014/12/06/Britain-to-set-up-permanent-naval-base-in-Bahrain/3631417892889/?spt=hts&or=2", "content": "World News Britain to set up permanent naval base in Bahrain Britain is establishing a permanent military facility in the Middle East for the first time since removing its last permanent base over four decades ago. At a security conference in Manama, Bahrain, U.K. Foreign Secretary <mark>Philip Hammond</mark> signed the deal, which would expand the Mina Salman Port in Bahrain, adding aircraft carriers and destroyers to four British minesweepers already located at the facility. \"This new base is a permanent expansion of the Royal Navy's footprint and will enable Britain to send more and larger ships to reinforce stability in the Gulf,\" U.K. Defense Secretary Michael Fallon said. Since September Britain has conducted airstrikes against Islamic State targets in Iraq as part of a U.S.-led coalition that includes Australia, Belgium, Canada, Denmark, France and Netherlands. The new base would support such operations as well as those against piracy in the region. It will also be the first permanent British military facility to be located in the Middle East since a 1968 decision to close all U.K. bases east of the Suez Canal by 1971. The expansion of facilities at the Mina Salman Port is slated to cost $23 million, most of which will be paid by Bahrain, with Britain shouldering ongoing costs. Bahrain already hosts the U.S. Navy's Fifth Fleet at a larger, adjacent facility. abuses by the Sunni government,, the threat of Islamic State forces in Iraq and Syria have made Gulf monarchies more open to such deals with Western governments. \"We must never allow the isolationists to convince our people of the superficially attractive proposition that distance, or oceans can insulate,\" Bahrain holds first elections since Arab Spring, Shias boycott Uruguayan President Jose Mujica confirms he will take Guantanamo prisoners 24 minutes ago MONTEVIDEO, Uruguay, Dec. 6 (UPI)--Uruguayan President Jose Mujica confirmed Friday his country will take Guantanamo prisoners who have not been charged with any crimes. Vietnamese writer Nguyen Quang Lap arrested over his blog 1 hour ago HO CHI MINH CITY, Vietnam, Dec. 6 (UPI)--Nguyen Quang Lap was arrested Saturday for publishing articles critical of the Vietnamese government. Swiss photographer wields machete in daring escape from captors 3 hours ago ZAMBOANGA CITY, Philippines, Dec. 6 (UPI)--A Swiss photographer kidnapped by a militant group in the Philippines in 2012 killed a captor with a machete and raced to safety under a hail of gunfire. Hagel says more U.S. troops than planned to stay in Afghanistan in 2015 5 hours ago KABUL, Afghanistan, Dec. 6 (UPI)--During a visit to Kabul, U.S. Defense Secretary Chuck Hagel said 1,000 more troops than first planned will stay in Afghanistan for the early part of next year. Al-Qaida commander behind NY and London terror plots killed, Pakistan military says 7 hours ago WASHINGTON, Dec. 6 (UPI)--Adnan el-Shukrijumah, one of al-Qaida's senior leaders, was killed during a raid in Pakistan. He was indicted for his role in planned terror attacks. 500,000 flee as Typhoon Hagupit roars to Philippines 11 hours ago MANILA, Dec. 6 (UPI)--A half a million Filipinos have fled their homes as pelting rains hit the Philippines ahead of roaring Typhoon Hagupit just 150 miles off the eastern shore. U.S. journalist killed during failed rescue raid 11 hours ago SANA'A, Yemen, Dec. 6 (UPI)--A U.S. photojournalist who was being held hostage has been killed in Yemen during a failed rescue raid. New York trip not \"appropriate' for Prince George 14 hours ago LONDON, Dec. 6 (UPI)--The Duke and Duchess of Cambridge are ready to hit the States on Sunday, but Americans won't get a glimpse of bonnie Prince George. Mexico City police chief resigns over student death protests 17 hours ago MEXICO CITY, Dec. 5 (UPI)--Mexico City's chief of police resigned Friday amid criticism about how the department handled protests over the deaths of 43 students in September. Punjab government cracks down on health camps after botched procedures 21 hours ago CHANDIGARH, India, Dec. 5 (UPI)--The government of the Punjab state in India on Friday restricted health camps after at least 18 people lost their vision in botched cataract surgeries. Uruguayan President Jose Mujica confirms he will take Guantanamo prisoners New York trip not\" appropriate' for Prince George FBI: Navy engineer tried to sell secrets to Egypt Second mountain lion spotted in heart of Los Angeles U.S. journalist killed during failed rescue raid Uruguayan President Jose Mujica confirms he will take Guantanamo prisoners Vietnamese writer Nguyen Quang Lap arrested over his blog Worldwide protests continue against U.S. police violence Swiss photographer wields machete in daring escape from captors More Sears and Kmart closings than first announced Judge: Beastie Boys $1.7 M copyright-infringement verdict stands Hagel says more U.S. troops than planned to stay in Afghanistan in 2015 World's oldest two-faced cat dies Hero bus driver saves nearly 40 students from flames ABOUT UPI Since 1907, United Press International (UPI) has been a leading provider of critical information to media outlets, businesses, governments and researchers worldwide. UPI is a global operation with offices in Beirut, Hong Kong, London, Santiago, Seoul and Tokyo. Our headquarters is located in downtown Washington, DC, surrounded by major international policy-making governmental and non-governmental organizations. UPI licenses content directly to print outlets, online media and institutions of all types. In addition, UPI's distribution partners provide our content to thousands of businesses, policy groups and academic institutions worldwide. Our audience consists of millions of decision-makers who depend on UPI's insightful and analytical stories to make better business or policy decisions. In the year of our 107th anniversary, our company strives to continue being a leading and trusted source for news, analysis and insight for readers around the world. Privacy Policy © 2014 United Press International, Inc.. All Rights Reserved. UPI.com is your trusted source for world news, top news, science news, health news and current events.", "articleID": "2014120621_00010724_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}}, {"date": "2014-12-07", "url": "http://chroniclelive.co.uk/sport/football/football-news/blyth-spartans-hero-admits-didnt-8241141", "content": "Newcastle clubs introduce state of the art ID scanners to help pinpoint trouble makers Blyth Spartans hero reveals his joy at scoring 90th minute winner Hatem Ben Arfa will return to Newcastle United in January after Hull move turns sour Rob Elliot reveals he played on through the pain barrier for Newcastle United Newcastle 2-1 Chelsea: Five things we learned as soaring Magpies shoot down Premier League leaders <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night \"data-type =\" fb-share \"data-action =\" article:8241141 \"> <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night\" data-type = \"tw-share\" data-action = \"article:8241141\" > <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night Blyth Spartans goalscorer <mark>Stephen Turnbull</mark> celebrates after the FA Cup Second round match between Hartlepool United and Blyth Spartans <mark>Stephen Turnbull</mark> has admitted he did not see one of the best goals of FA Cup second-round weekend coming. The League Two side bossed the opening half-hour and took the lead through Jonathan Franks. But once Turnbull equalised in the 56th minute there was only one team in it - even if it did take until the 90th minute for Jarrett Rivers to confirm his side's place in tomorrow's third-round draw. And Turnbull admitted he had not been on that sort of form on the training ground. \"I'd been practising them all week in training and couldn't hit a barn door,\" said Turnbull, who started his career at Victoria Park. \"I said to Robbie Dale,\" I'm going to hit this \". Never in my dreams did I think I'd catch it like I did .\" It didn't just go in the top corner, it curled into the side-netting. \"Afterwards, our manager <mark>Tom Wade</mark> said that Alan Shearer (working for BBC television on the night) said it was the best free-kick he'd ever seen. Wow. That's good enough for me .\" Turnbull also set up the winner, releasing Rivers for the fairytale finish which sparked a bench clearance and a pitch invasion. \"I gave him (Rivers) the ball, it was a good pass, and I just thought,\" Go on, run at them', \"said Turnbull, part of the Bury team expelled from the competition for fielding an ineligible player in 2006 .\" Unbelievable. It was just incredible. \"I can't wait for tomorrow's draw - at least I know we'll definitely be playing in it this time .\" After the game <mark>Wade</mark> was keen to stress Turnbull's contribution went way beyond the pitch. \"<mark>Stephen</mark> and Phil Turnbull are probably two of the best midfield players around the area,\" he said. \"<mark>Stephen Turnbull</mark>'s just a great lad. He's got great ability and he's great in the changing room because he gets the young lads playing and gives them confidence .\" It was a fantastic goal but his overall play was fantastic. \"You saw the bench go up when the goals went in and even the lads who weren't stripped. I think that's the difference .\" We're a very, very close team and a close changing room. \"Blyth's win was extra sweet for Nathan Buddle. The defender was released by Pools club at the end of the 2012-13 season, much to his disappointment, and that gave Friday night's game at Victoria Park added spice for him. The Blyth Spartans boys have been sold short because football has done an Oasis and completely lost the plot Joe Allon can't wait for FA Cup clash between Blyth Spartans and Hartlepool Former Hartlepool striker and columnist Joe Allon says the draw proves the romance of the FA Cup isn't dead Gateshead FC hosts lowest rank team left in FA Cup, Warrington and Blyth head to Hartlepool Jak Alnwick: Five facts on Newcastle United's rookie goalkeeper Hatem Ben Arfa will return to Newcastle United in January after Hull move turns sour Newcastle 2-1 Chelsea: Five things we learned as soaring Magpies shoot down Premier League leaders Rob Elliot reveals he played on through the pain barrier for Newcastle United Contact us Got a story in your area? Is there something happening in your area you would like us to report on? Competitions and promotions Michelle Morgan Print The Chronicle is read by more adults than any other regional newspaper on sale in the area. With 170,115 average issue readers, this reach extends to 366,753 weekly readers - that's over 1/4 of adults in the area! The average time spent reading the Chronicle is 31 minutes; which shows the length of time that readers are engaging with the editorial and advertising content. 49,199 * copies of the Chronicle are sold on average each day as it continues to be an integral part of the region. * ABC Newcastle Chronicle 100% paid, Mon - Sat, JICREG, 1/10/2012 Page Views: 10m Audience figures from Omniture, monthly average (Jan - Jun 2014). More than 1 in 3 ChronicleLive users have clicked through to an online advertisement, demonstrating that our users are responsive and receptive to Internet advertising messages. ChronicleLive reaches an internet-savvy audience, with 84% of users having purchased products or services online in the past 12 months. Download our rate cards for all the prices of our print and digital products. Editor, The Chronicle Editor-in-Chief, Trinity Mirror North East Darren was appointed editor of the Chronicle in September 2011, following a six-year spell as editor of the Evening Gazette in Teesside.", "articleID": "2014120712_00059412_W", "names": {"Stephen Turnbull": ["Q3176384", "Q7610717"], "Tom Wade": ["Q10420373", "Q22762714"]}}, {"date": "2014-12-08", "url": "http://www.wxyz.com/news/region/macomb-county/sterling-heights-home-destroyed-after-fire", "content": "STERLING HEIGHTS, Mich. (WXYZ) - A Sterling Heights family is lucky to be alive after their home went up in flames Sunday morning. It happened on Headley Street in a neighborhood off Canal near M-53. Luckily, the parents and their two kids got out safely. \"Fire was coming out, like, the window and I was a little worried because the cars were both in the driveway and our house is next door,\" <mark>Carol Potter</mark>, a neighbor said. At the height of the blaze, the flames were so intense that the heat damaged the <mark>Potter</mark>'s home next door. Firefighters say the smoke detectors in the home weren't working. The parents say the smell of smoke woke them up. Neighbors are collecting donations to help the family. They've set up a GoFundMe account online. You can find more information about it by", "articleID": "2014120801_00038549_W", "names": {"Carol Potter": ["Q242440", "Q5044513"]}}, {"date": "2014-12-08", "url": "http://digitaljournal.com/news/politics/report-thousands-of-homeless-vets-unable-to-reach-va-call-center/article/419458", "content": "Washington D.c. - Thousands of homeless veterans who tried to contact the Department of Veterans Affairs national call center to seek treatment or shelter had to resort to leaving messages on answering machines and many never received a referral or medical services. That's according to a report by an independent watchdog agency, The report, issued by the VA Inspector General (IG) found that more than 21,000 homeless veterans in fiscal year 2013 weren't able to contact VA counselors and 3,000 were not referred to a VA medical facility, even when they provided all of the necessary information. Rather than providing a human voice, the call center relied on answering machines instead of counselors, and the VA IG added that it \"could not account for a significant amount of the counselors' time,\" the Beacon reports. The report noted that counselors spent large amounts of time unavailable to answer calls during peak call times. This resulted in 40,500 missed opportunities where the call center either didn't refer the veterans' calls to medical facilities, or it closed referrals without making certain that homeless veterans received the services they needed from VA medical facilities, Fox News reports. \"In our opinion, the majority of these calls could have been answered by counselors, instead of the answering machine,\" the report stated. It also said that 85 percent of the records reviewed by the IG lacked documentation to show that the veterans had received the support services they needed, The report also found that counselors working at the center \"often did not log in or did not spend the entire day logged into the call center telephone system .\" But the report is merely a drop in the bucket for what has been a terrible year for the VA, long mired in controversy after several other reports showed mistreatment of veterans--including hidden wait lists--at VA hospitals nationwide. The influx of reports resulted in the resignation of former VA Secretary Eric Shinseki, who started the Zero Homelessness Initiative in 2009. New VA Secretary <mark>Robert McDonald</mark> is following up with this, and the goal is to completely eliminate veteran homelessness by 2015, The Fiscal Times reports. It's estimated that on any given night, some 49,993 vets are homeless, the U.S. Department of Housing and Urban Development (HUD) reports, according to About 12,700 veterans of Operation Enduring Freedom, Operation Iraqi Freedom, and Operation New Dawn were homeless in 2010. The number of young homeless veterans is on the rise, although they only constitute 8.8 percent of the overall population of homeless vets. • The Interim Under Secretary for Health should stop the use of answering machines and make counselors more useful and accessible to the National Call Center before hiring extra staff. • The IG recommended that the Under Secretary implement effective performance measures and criteria for the call center and performance measures for staff to improve the accessibility of counselors, efficient management of calls, as well as making certain that calls are referred properly. • The Under Secretary should monitor and analyze calls routinely to assess the quality of call center support services, including counselor accessibility, efficiency in answering calls, and the issuance of referrals. • The IG recommended the Under Secretary install management controls so that VA medical facilities receive feedback on the quality of referral responses and on necessary corrections and improvements to the support services being offered to homeless veterans. Avian flu hits B.C. again, 7 countries restrict Canadian poultry", "articleID": "2014120809_00033520_W", "names": {"Robert Mcdonald": ["Q41948618", "Q7347500"]}}, {"date": "2014-12-08", "url": "http://www.westernjournalism.com/wolfboy-princess-cupcake-complementarity-sexes/?utm_source=rss&utm_medium=rss&utm_campaign=wolfboy-princess-cupcake-complementarity-sexes", "content": "Ouch: Rand Paul Just Rubbed This Big Loss In These Democrats' Face In A Funny Way WATCH: What Obama's Mentor, A Harvard Law Professor, Just Said About Ferguson Is Unbelievable WATCH: This Fired Up Fox News Host Body Slams \"Racial Hatred' Obama In An Unforgettable Way Cowardly Conservatives Use Garner Case To Grab Their\" Ferguson Moment \"WATCH: What Obama's Mentor, A Harvard Law Professor, Just Said About Ferguson Is Unbelievable WATCH: This Fired Up Fox News Host Body Slams\" Racial Hatred' Obama In An Unforgettable Way Alabama Christmas Parade Has Largest Attendance In Years Despite Atheist Attacks Wolfboy And Princess Cupcake: The Complementarity Of The Sexes Ecumenism at its best was recently demonstrated at the Vatican, where dozens of faith leaders worldwide assembled to remind us of the essential complementarity of men and women in life, marriage, and parenthood. It was enough to prompt a high-five between Pope Francis and evangelical pastor <mark>James Robison</mark>. Of course, do we really need reminding that male and female are different? Absolutely, especially with the advent of same-sex marriage, which is prompting assertions that it \"doesn't matter\" whether two men or two women parent a household. Ask any parent if males and females are different. My wife and I have eight children under our roof, and the boy-girl differences are dramatic. Here's a typical Saturday morning exchange at our house: \"Daddy!\" my 7-year-old son yells, running toward me in camouflage hunting clothes. \"I had a dream last night that I stabbed Bigfoot nine times with a spear!\" Not missing a beat, his 3-year-old sister prances and dances toward me in a flowered pink dress: \"Daddy, I had a dream about a ladybug!\" The 3-year-old goes by \"Princess Cupcake .\" She's of the age where she dresses up and displays herself in front of me waiting for me to gush, \"Wow, you look like a princess!\" She beams. Her older sisters did the same thing. The first time I said that to her oldest sister, she calmly glowed to her mom, \"He said I look like a princess .\" Needless to say, the boys have never done that-not once in 20,000-plus days of combined lives. My wife and I have nothing to do with these differences, other than providing the chromosomes. My 7-year-old boy, long before fancying himself a Bigfoot slayer, declared himself \"Wolfboy .\" My wife and I certainly didn't come up with that one. She will tell you that she did not give birth to a wolf boy. No, it was he alone who transmogrified himself into this half beast, half boy. Wolfboy sauntered around the house creeping, preying. We attempted to keep these wild manifestations at, shall we say, bay-a more restrained Wolfboy. One day at the home of friends, he politely asked my wife if he could go outside to \"howl,\" to the giggles of my friend's teenage girl. Fortunately, the Wolfboy thing eventually cooled. One afternoon, he grabbed two chopsticks for fangs, shoving them into his throat. Wolfboy had to be taken to the hospital. We've since had several full moons with no reappearances. That brings me back to the differences in the sexes. These traits follow us into adulthood, marriage, and parenting. There are things my wife does that I just can't. She happily jumps up in the middle of the night at the slightest cry. I lay there groaning. On the flip side, she has no yearning to take the teenage boys hunting in 20-degree weather with rifles and crossbows to shoot and gut and hang and skin and butcher a deer. My boys crave that, and they're utterly mystified at their sisters' insatiable interest in the Duggar family's weddings. In short, all of this is obvious, observable. Really, to deny it is to be warped by ideology, culture, politics, or some agenda. That brings me back to the ecumenical gathering at the Vatican, where these gender differences in married and family life were acknowledged and celebrated. \"The biggest threat to marriage is that people have forgotten its purpose,\" said Pastor Rick Warren, the 28th speaker at the conference. \"Children who grow up with the presence of a mother and father are more successful in life, are healthier, are stronger, are less likely to be involved in crime, are less likely to go to prison, are less likely to be involved in drug abuse, are less likely to live in poverty. If you really want to support children, we need to support two-parent families, a husband and a wife, a mom and a dad .\" The bishop of Rome didn't disagree with the Saddleback Church pastor. \"Children have a right to grow up in a family with a father and a mother,\" said Pope Francis. Such households are best \"capable of creating a suitable environment for the child's development and emotional maturity .\" Of course, not all children get that ideal; but it's an ideal our culture should strive for rather than against. We were made male and female; and from birth to death and childhood to parenthood, those differences have a distinct and complementary purpose. Photo credit: shutterstock.com The views expressed in this opinion article are solely those of their author and are not necessarily either shared or endorsed by WesternJournalism.com. Conservative Celebrities Lead Charge To Save '19 Kids And Counting' Previous post Cowardly Conservatives Use Garner Case To Grab Their \"Ferguson Moment\" Cowardly Conservatives Use Garner Case To Grab Their \"Ferguson Moment\" The following \"conservatives\" are using the Garner case to suck up to the liberal media ...", "articleID": "2014120817_00037903_W", "names": {"James Robison": ["Q16106427", "Q6142315"]}}, {"date": "2014-12-11", "url": "http://www.noise11.com/news/stax-to-release-box-set-of-singles-20141211", "content": "Concord Music Group and Stax Records have announced the digital release and physical reissue of two comprehensive box set titles: The Complete Stax/Volt Soul Singles, Vol. 2: 1968-1971 and The Complete Stax/Volt Soul Singles, Vol. 3: 1972-1975. Originally released in 1993 and 1994, respectively, these two compilations will be re-released back into the physical market in compact and sleek new packaging. Each set includes full-color booklets with in-depth essays by Stax historian and compilations co-producer <mark>Rob Bowman</mark>. The volumes feature stalwart Stax R & B artists including Isaac Hayes, the Staple Singers, Rufus <mark>Thomas</mark>, Johnnie Taylor, <mark>Carla Thomas</mark>, the Bar-Kays and <mark>William Bell</mark>, as well as bluesmen Little Milton, <mark>Albert King</mark> and Little Sonny, and \"second generation\" Stax hitmakers like Jean Knight, the Soul Children, <mark>Kim Weston</mark>, the Temprees, and Mel & Tim. Many of the tracks included in these collections will be made available digitally for the very first time. The story of the great Memphis soul label Stax/Volt can be divided into two distinct eras: the period from 1959 through the beginning of 1968, when the company was distributed by Atlantic and was developing its influential sound and image (chronicled in acclaimed 9-CD box set The Complete Stax/Volt Singles 1959-1968, released by Atlantic in 1991); and the post-Atlantic years, from May 1968 through the end of 1975, when Stax/Volt began its transition from a small, down-home enterprise to a corporate soul powerhouse. In Stax's early years as an independent label, founders <mark>Jim Stewart</mark> and Estelle Axton struggled with the loss of its back catalog to Atlantic/Warner Brothers Records and the loss of the label's most lucrative artist, Otis Redding, who tragically died in a plane crash months before. In need of funding and new stars, Axton and <mark>Stewart</mark> sold the label to Gulf + Western, bringing on promotion head Al Bell (who would soon become an equal partner and major figurehead of the label). In his Vol. 2 essay, <mark>Rob Bowman</mark> recalls, \"As the sun arose in Memphis on May 6, 1968 [the day Stax officially became independent of Atlantic], Stax had been essentially gutted. For all intents and purposes it was a new record company poised to issue its first few records .\" Comprised of nine CDs, Vol. 2 focuses on this period, 1968 through 1971, when Stax/Volt was forging ahead as its own entity. The 216-song collection includes all of the singles issued by the label during this time period, and features some of the biggest and best-loved hits of the day, including Isaac Hayes' Theme From Shaft, The Staple Singers' Respect Yourself and Johnnie Taylor's Who's Making Love, as well as a number of little-known gems by both major and less-familiar artists. By the end of 1971, <mark>Bowman</mark> notes, \"Al Bell's dream of [Stax/Volt] becoming a diversified full-line record company was several steps further along the line to being reality. The label now recorded a wealth of different styles and flavors of black popular music, ranging from the jazz and easy-listening proclivities of Isaac Hayes to the blues of Little Milton to the '70s disco-infused vocal style of the Dramatics to the gutsy soul of the Staple Singers .\" Indeed, the early 1970s found Stax/Volt a much bigger entity than ever thought possible during its initial split from Atlantic, with Isaac Hayes as its breakout star. Spurred by the success of Hayes' GRAMMY Award-Winning Shaft soundtrack in early 1972, the label was casting its net across a wide cross section of the entertainment industry, entering into new territory with soundtracks, comedy records, and even investing in a Broadway play. The Complete Stax/Volt Soul Singles, Vol. 3: 1972-1975, coming Spring 2015, covers this era of success and excess, when Stax's stars were shining bright, but the label was on the verge of its dramatic denouement. The 10-disc box set contains all 213 soul singles issued by Stax/Volt during this time, including such hits as <mark>Shirley Brown</mark>'s Woman to Woman and the Staple Singers' I'll Take You There. In 1976, faced with involuntary bankruptcy and an unsuccessful distribution deal with CBS Records, Stax was forced to close its doors. In his liner notes for Vol. 3, compilation co-producer Bill Belmont writes, \"Stax's difficult and inglorious end in no way diminishes its vital contributions to rhythm and blues and soul. Today, the music of Stax maintains a strong and steady presence, heard continually in cover versions by major artists, in movies and on television. Simply put, the Memphis Sound lives .\" And indeed it does. With a revival of the label in recent years, through Fantasy Records, the 2003 opening of the Stax Museum of American Soul Music in Memphis, Tenn., as well as several developing theatrical performances around the label, the music of Stax will continue to influence generations of musicians and fans alike .----------------------------------------------Never miss a story! Get your free Noise11. com daily music news email alert. Subscribe to the Noise11 Music Newsletter here Listen to the Noise11 Music News channel now at iHeartRadio Follow Noise11. com on Facebook and Twitter----------------------------------------------more from vvnmusic-com Comments comments Tagged as: music news, Stax Tweet", "articleID": "2014121105_00029974_W", "names": {"Albert King": ["Q3608060", "Q55754035"], "Carla Thomas": ["Q2939046", "Q462426"]}}]