[{"articleID": "2020030815_00027827_W", "names": {"Chris Wallace": ["Q21256789", "Q2964884", "Q2964885", "Q37624906", "Q5108402", "Q5108404"], "Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"]}, "date": "2020-03-08", "url": "http://www.foxnews.com/politics/fauci-says-anything-is-possible-when-asked-about-widespread-coronavirus-quarantine", "content": "close Video Dr. Anthony Fauci on US response to coronavirus Coronavirus task force member Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, joins <mark>Chris Wallace</mark> on \"Fox News Sunday .' Dr. Anthony Fauci, the head of the National Institute of Allergy and Infectious Diseases, said on Sunday that while he hopes it doesn't come to it, the government could shut down certain sections of the country hit hard by the coronavirus. Speaking during an interview on\" Fox News Sunday, \"Fauci said that\" anything is possible \"when asked if measures like those currently being imposed in Italy could be enacted in the U.S. to help prevent the continued spread of the coronavirus .\" I don't think it would be as draconian as nobody in or nobody out, \"Fauci said .\" But if we continue to get cases like this, particularly at the community level, there will be what we call \"mitigation,' where we have to essentially do social distancing, keep people out of crowded places, take a look at seriousness, do you really need to travel, and I think it's particularly important among the most vulnerable .\" He added: \"You know, you don't want to alarm people, but given the spread we've seen, you know, anything's possible. And that's the reason why we've got to be prepared to take whatever action is appropriate to contain and mitigate the outbreak .\" CORONAVIRUS: EVERYTHING YOU NEED TO KNOW Fauci's comments shortly after Italian Minister <mark>Giuseppe Conte</mark> signed a decree restricting the movements of about a quarter of the country's population in a bid to limit contagions at the epicenter of Europe's outbreak. Video \"For Lombardy and for the other northern provinces that I have listed there will be a ban for everybody to move in and out of these territories and also within the same territory,\" <mark>Conte</mark> said. \"Exceptions will be allowed only for proven professional needs, exceptional cases and health issues .\" Around the world, more and more countries were bracing for a big increase in virus cases. Western countries have been increasingly imitating China--where the virus first emerged late last year, and which has suffered the vast majority of infections--by imposing travel controls and shutting down public events. CLICK HERE FOR COMPLETE CORONAVIRUS COVERAGE While the global death toll has risen past 3,400, more people have now recovered from the virus than are sickened by it. As of Saturday, nearly 90,000 cases have been reported in Asia; more than 8,000 in Europe; 6,000 in the Mideast; about 450 in North America, Latin America and the Caribbean, and fewer than 50 cases reported so far in Africa. Video While many scientists say the world is clearly in the grips of a pandemic--a serious global outbreak--the World Health Organization isn't calling it that yet, saying the word might spook the world further. The virus is still much less widespread than annual flu epidemics, which cause up to 5 million severe cases around the world and up to 650,000 deaths annually, according to the WHO. CLICK HERE TO GET THE FOX NEWS APP The U.S. Centers for Disease Control and Prevention is urging older adults and people with severe medical conditions to \"stay home as much as possible\" and avoid crowds. Most people who get the virus have mild cases, though the elderly face greater risks. Among the many new cases in Europe on Saturday was a doctor in Slovenia who was in contact with more than 100 people in a nursing home after a ski trip to neighboring Italy. The Associated Press contributed to this report. Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox Arrives Weekdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter! ADVERTISEMENT"}, {"articleID": "2011110900_00045093_W", "names": {"Robert Jenkins": ["Q38800320", "Q7346083"]}, "date": "2011-11-08", "url": "http://wdsu.com/news/29717047/detail.html", "content": "mother fired from job after son named murder suspect bobby troy wanted in connection with slidell doctor's death a woman said she lost her job after the top man of the new orleans police department revealed her criminal past. supt. ronal serpas disclosed almenta johnson's rap sheet during a press conference about her son, bobby troy, over the weekend. police are seeking to arrest troy in connection with the death of slidell dr. brent hockfeld in the french quarter. johnson, of central city, said she turned on her television sunday and was shocked when the focus shifted on her. \"bobby troy's mother is a multiple arrested offender (on charges of) resisting arrest, resisting officers, possession or drugs, drug paraphernalia, criminal trespass, crimes against nature,\" serpas said. \"i believe that he shouldn't have put my business out in the street. i haven't robbed anybody. i haven't killed anybody,\" johnson said. johnson said she was fired monday, after six years, from her part-time job as banquet server. \"when i went there, she told me,\" no,' because they don't hire sex offenders or people who have been on drugs and she told me i couldn't work there anymore, \"johnson said. johnson said although her name was not mentioned during the press conference, her son used to work at her part-time job .\" they knew (he) was my son, \"johnson said.defense attorney <mark>robert jenkins</mark> said johnson's constitutional right to privacy and the right to work may have been violated, and she could have grounds to sue the city of new orleans and serpas for defamation .\" if indeed they terminated her based on the comments of the chief of police, i think she does have a case, \"<mark>jenkins</mark> said .\" (serpas) called her a criminal. that's the problem. it appears that the police department, through the chief, is starting to condemn families instead of going after suspect, and you can't condemn a whole family. that's wrong, absolutely wrong. \"<mark>jenkins</mark> said johnson has a right to look into litigation. couple ambushed in french quarter armed robbery deputies: men beat rape suspect with baseball bat group reacts to police comments on slidell doctor slaying woman says she lost her job over rap sheet revelations restaurant's fried chicken gets top honors siblings to reunite after 80 years apart"}, {"articleID": "2011061904_00007601_W", "names": {"Carlos Carrasco": ["Q16202313", "Q29021087", "Q2939315"]}, "date": "2011-06-19", "url": "http://medinagazette.northcoastnow.com/2011/06/18/indians-5-pirates-1-carrasco-carries-tribe-to-win/", "content": "cleveland - <mark>carlos carrasco</mark> is in a groove and now so are the previously struggling indians. with <mark>carrasco</mark> offering up his third straight dominant start saturday night, cleveland rolled to a 5-1 victory at progressive field, securing the series against interleague rival pittsburgh by winning for the fourth time in six games. the indians' offense is beginning to show signs of life, but it was <mark>carrasco</mark> that stole the show, needing little support to win for the third straight time. the right-hander allowed just a run on four hits over 6 1/3 innings, no-hitting the pirates while allowing just one baserunner over the first five innings. \"<mark>carrasco</mark> continues to throw the ball very well,\" said manager manny acta, whose team reassumed control of the central division with a one-game lead over detroit in the standings. \"he looks very comfortable out there .\" he's in a very good groove right now. hopefully he can continue to do that. he looks real good right now. he looks like he can throw any pitch in any count. \"locating his fastball to near perfection while mixing in a steady diet of breaking pitches, <mark>carrasco</mark> stymied pirates hitters for the majority of his outing. he struck out four and walked one, extending his scoreless innings streak to 21 1/3 innings before allowing his only run in the seventh .\" i had command of everything tonight, \"<mark>carrasco</mark> said .\" my slider was very good today. \"the most important thing is throwing deep into the game and that's what i've done the last three games .\" <mark>carrasco</mark> has done plenty over that span, winning three times, while posting a minuscule 0.41 era. he is 6-1 since may 11, and is tied for eighth in the american league with seven wins on the season to go along with a 3.87 era. \"he's been great,\" catcher lou marson said. \"he's locating his heater and pitching off his fastball, which is what he needs to do .\" marson has been behind the plate for the majority of <mark>carrasco</mark>'s starts, coming up with him in the phillies organization in 2004. he is comfortable with his former minor league catcher behind the dish. \"he reads my mind,\" <mark>carrasco</mark> said of marson. \"he knows exactly what i want to throw .\" <mark>carrasco</mark> allowed his first hit to lead off the sixth on a liner to second from michael mckenry that could have been handled by orlando cabrera. cabrera leapt and had the ball in his glove before it popped out and he couldn't scoop it in time to throw to first. acta thought cabrera was going to catch the ball. \"of course,\" he said. \"i was thinking no-hitter like everyone else .\" cabrera atoned himself by hitting a solo home run off pirates starter paul maholm to put the indians in front 3-0 in the sixth, his first homer since april 16. the indians scored single runs in each of the first two innings, then added two more after the cabrera homer to put the game away in the seventh. a leadoff triple from grady sizemore that just missed carrying the wall in center sparked the inning. sizemore rode home on a sacrifice fly from michael brantley and after singling and stealing second, asdrubal cabrera scored on a two-out base hit from shin-soo choo. \"we executed very well with runners in scoring position,\" said acta, whose team has struggled mightily in the department as of late. \"we have to continue pushing. it's a homestand we want to play well in .\" sizemore, who entered the night riding an 0-for-10 skid, went 2-for-3 with an rbi, two runs, a double and a triple."}, {"articleID": "2010100702_00099137_W", "names": {"John Edwards": ["Q1499392", "Q16192689", "Q1699944", "Q1699946", "Q19873112", "Q20733395", "Q21461221", "Q21461226", "Q217314", "Q27915201", "Q3809239", "Q52834658", "Q54556677", "Q56597692", "Q56706105", "Q57617438", "Q6231383", "Q6231395"]}, "date": "2010-10-07", "url": "http://411mania.com/politics/columns/156433", "content": "billionaire creates job for illegal immigrant, can't get no respect since republicans are frequently criticized for racial insensitivity, it's important to spotlight their progress in this area. case in point - did you know that california gubernatorial candidate meg whitman created a job for a young illegal immigrant named nicky diaz santillan? whitman employed santillan as a housekeeper for nine years, and i think we can all agree no racist would let a mexican near their personal belongings like that. however, whitman's in a pickle because she didn't know santillan was illegal (so whitman claims, anyway). once she found out, she had no choice but to terminate santillan, because that's what law-abiding employers do. to say santillan didn't take it well would be a massive understatement - she hired professional douchebag lawyer gloria allred to sue whitman. nothing illustrates the phrase \"no good deed goes unpunished\" like this nasty santillan business. custom requires me to point out meg whitman is a billionaire. does anyone not know she's a billionaire? in case you were unaware, meg whitman is supposedly, according to some estimates, worth upwards of one billion dollars. forbes lists her net worth at $1.3 billion. she's also spent tens of millions of her own fortune on her campaign, if that means anything to you. personally, i'm always in favor of an individual's right to spend their hard-earned money on frivolous pursuits. billionaire. so as you can imagine, being rich means you need a little help with the chores. santillan was whitman's domestic for almost a decade, and everything was in order until one fateful day. santillan confessed to whitman she was an illegal immigrant, and had provided false documentation of citizenship when applying for work. depending on whom you believe, santillan came clean out of loyalty to whitman, to warn her that this immigration issue could hurt the campaign. when faced with an admission of fraud, whitman terminated santillan's employment. apparently santillan wasn't expecting that reaction, and has retaliated with the legal equivalent of shock and awe: an attorney for nicky diaz santillan, the former housekeeper of california republican gubernatorial candidate meg whitman, claimed today that whitman was aware of santillan's status as an illegal immigrant and fired the housekeeper when she asked for help. the attorney, gloria allred, said she was filing a claim for lost wages that are due to santillan. the two women appeared at a press conference where santillan tearfully discussed the allegations. if i had to choose between being sued by gloria allred or being waterboarded? i actually think my chances of surviving waterboarding without lasting damage would be pretty good. seriously. wouldn't you? whether or not whitman mistreated santillan on occasion is beside the point now. hiring gloria allred is a decision that forfeits any reasonable benefit of doubt. in the parlance of the 2006 israel-lebanon war, deploying gloria allred is a disproportionate response. it's a morally repugnant act, comparable to suicide-bombing. outside of <mark>john edwards</mark>, there is no personification of pernicious lawyer-ism as thoroughly detestable as gloria allred. she barely seems human. allred's shameless attention-whoring is matched only by her transparent phoniness. this whole santillan case is quite obviously meant to harm whitman's campaign. it's certainly not for santillan's benefit. allred produced a letter from the social security administration that she says proves whitman knew santillan was undocumented in 2003. you can read the letter here (pdf), but it doesn't quite convey allred's undeserved self-satisfaction like this picture: the letter indicates there was a problem with santillan's social security number, which supposedly proves whitman is lying about not knowing santillan's immigration status. look, you can see whitman's husband's handwriting right there! it says, \"nicky please look into this. thanks .\" what a bastard! despite the flowery build up, it's not exactly evidence of anything other than whitman's husband's good manners. the third paragraph of the letter says, \"this letter does not imply that you or your employee intentionally provided incorrect information about the employee's name or ssn .\" it also says the letter is not a basis for terminating an employee, and that employers may face legal consequences if they do. all an employer can do is let their employee know about the letter and ask them to look into it. thanks. in her haste to embarrass whitman, it's very likely allred is harming her client. by holding a press conference, she's announced to the world her client is an illegal alien and a fraud. that's a peculiar way of advocating the client's best interests. in view of santillan's admitted dishonesty, any chance of winning a lawsuit for mistreatment is slim. by gratuitously manipulating her emotionally vulnerable client, allred has reached new depths of ignominy in a profession that is already famous for its depravity. for a more entertaining version of that same argument, here's greta van sustern ripping allred apart while she sits there wallowing in false indignation. but the ultimate responsibility is with santillan. if she truly felt exploited or treated unfairly by whitman, she could have sought employment elsewhere. nine years is a long time to keep a job you don't like. reports indicate santillan earned the equivalent of $47,000 annually when she worked for whitman, which suggests she has a valuable skill set. even when you account for california's high cost of living, $47,000 is better than median income. santillan could have gotten another job for less pay and still made a comfortable living. it's not as if she didn't have options. and post under your registered name. if not, you can post as a guest or i would have sex with gloria allred...posted by: fat ass tna troll (guest) on october 06, 2010 at 09:25 pm that's it, you just changed my mind i'm voting for meg whitman now privacy policy. please help us serve you better, fill out our"}, {"articleID": "2017101805_00353379_W", "names": {"Zubair Khan": ["Q16195412", "Q16222244", "Q42368847", "Q56275247"], "Hina Khan": ["Q10948640", "Q5765564"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"], "Sophie Turner": ["Q240573", "Q735034"], "Sussanne Khan": ["Q22301945", "Q23696666"], "Tom Holland": ["Q1236243", "Q1340923", "Q16104458", "Q2023710", "Q42887023", "Q7816215"]}, "date": "2017-10-18", "url": "https://www.indiatimes.com/entertainment/celebs/priyank-sharma-and-dhinchak-pooja-likely-to-enter-bigg-boss-11-house-as-wild-card-contestants-331873.html", "content": "Home> Entertainment> celebscoop Priyank Sharma And Dhinchak Pooja Likely To Enter Bigg Boss 11 House As Wild Card Contestants Garima Satija October 18, 2017 It has just been two weeks since Bigg Boss 11 started, and four contestants have already been evicted--Priyank Sharma, <mark>Zubair Khan</mark>, Sshivani Durga and Lucinda Nicholas. We have witnessed a lot of drama in this short span of time inside the Bigg Boss house, and a lot of it is going to follow henceforth. (Also Read: Eliminated Contestant Sshivani Durga Reveals She Didn't Do Black Magic Inside The Bigg Boss House) Twitter (Also Read: Here's How Much <mark>Hina Khan</mark>, Shilpa Shinde And Hiten Tejwani Are Earning Inside The Bigg Boss House) If the grapevine is to be believed, just like how arguments and fights have kick-started on season 11 so soon, the wild card entries, which generally arrive in the house when the show is half-way through the season, will also enter the house this week. In the Diwali special episode, two wild-card entries will go into the house--Dhinchak Pooja and Priyank Sharma. Confirming the news Priyank Sharma told Mumbai Mirror, \"This season has been explosive from the word go. My journey was incomplete because of an impulse decision. But I'll be going back into the house to make amends with a different outlook and advice from <mark>Salman</mark> sir. And I'm hoping I come out a winner at the end of this innings .\" Furthermore, according to Spotboye.com, internet sensation Dhinchak Pooja is also in talks to join Bigg Boss 11. What do you think of the two wild-card contestants? Tell us in the comments section below. Don't Miss <mark>Zubair Khan</mark> Hits Back At <mark>Salman</mark>, Mallika Dua Shares Her Molestation Story & More From Ent 828 SHARES Akash Dadlani Shouldn't Win Bigg Boss 11, Lashes Out Evicted Contestant Lucinda Nicholas 1.5 K SHARES After Sex-Change Surgery, Gaurav Arora Will Participate On \"India's Next Top Model' As...19.8 K SHARES Happy Anniversary, Saifeena! 9 Gorgeous Photos Of Saif & Bebo That Prove There's No One Like...22.2 K SHARES Stand-Up Comedian Mallika Dua Joins\" Me Too' Protest, Shares Her Horrifying Molestation Story 12 K SHARES Ajay Devgn Takes Potshots At Arshad Warsi & Tusshar Kapoor's Career And We Can't Help But...9.2 K SHARES Here's How Much <mark>Hina Khan</mark>, Shilpa Shinde And Hiten Tejwani Are Earning Inside The Bigg Boss...18.4 K SHARES After <mark>Zubair Khan</mark> Demands Apology, <mark>Salman Khan</mark> Says Sorry To His Dogs For Calling Him One 16.6 K SHARES Aamir Khan Reportedly Takes Kangana Ranaut's Side, Feels It's Unfair That She's Being...8.2 K SHARES 9 Countries Where Bollywood Is Badshah 11.5 K SHARES just in celebscoop 5 K SHARES Deepika Padukone Reveals She's Just 12th Pass & Her Parents Had A Big Problem With That MUST WATCH Trapped In Their Worlds, Will They Find An Escape? Entertainment Chris Hemsworth Is Open To Working In Bollywood If The Industry Offers Him A Great Script celebscoop 3.4 K SHARES Ajay Devgn Hails SC For Cracker Ban, Feels It Should Be Implemented In Other Cities As Well Looking for premium traffic in India? Times Group Entertainment 391 SHARES <mark>Sophie Turner</mark> Announces Engagement, Karni Sena Threatens To Burn Cinema Halls & More From Ent celebscoop 6.3 K SHARES Hrithik Roshan Is All Smiles As He Celebrates The Launch Of His Ex-Wife <mark>Sussanne Khan</mark>'s Luxury Boutique celebscoop 117 SHARES Pussycat Founder Rubbishes Kaya Jones \"Prostitution Ring' Claims, Says She's Looking For Fame bollywood 8.3 K SHARES Karni Sena Threatens To Burn Theatres If\" Padmavati' Is Not Shown To The Group Before Release celebscoop 775 SHARES Eliminated Contestant Sshivani Durga Reveals She Didn't Do Black Magic Inside The Bigg Boss House celebscoop 4.4 K SHARES Fatima Sana Shaikh Is The Central Character Of Thugs Of Hindostan And Not Katrina, Reveals Aamir Khan celebscoop 7.6 K SHARES <mark>Sophie Turner</mark> AKA Sansa Stark Announces Her Engagement To Joe Jonas & Priyanka Is Happy For Them celebscoop 340 SHARES Spiderman Star <mark>Tom Holland</mark> Pokes Fun At Mark Ruffalo, Calls Him \"Worst Avengers Secret Keeper' celebscoop 1.5 K SHARES Priyanka Chopra Looks Pretty As A Petal In Her Peach Attire As She Attends A Gala In Los Angeles Entertainment 1.5 K SHARES Sshivani Durga Evicted From Bigg Boss 11, Shabana Azmi Gets Trolled Again & More From Ent World"}, {"articleID": "2020021208_00163623_W", "names": {"Jesus Perez": ["Q1688453", "Q6188607"], "Bruno Fernandes": ["Q4979203", "Q4979316", "Q767698"]}, "date": "2020-02-12", "url": "https://www.mirror.co.uk/sport/football/news/mauricio-pochettino-pictured-ed-woodwards-21480036", "content": "Sign up to FREE daily email alerts from Mirror - Manchester United FC Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing We have more newsletters Show me See our privacy notice Invalid Email Mauricio Pochettino was pictured at Griffin Park alongside Ed Woodward's new advisor, Neil Ashton, on Tuesday night - after admitting his desire to return to work in the Premier League. Pochettino has been out of work since being sacked by Tottenham in November but has remained linked with the Manchester United job. With Ole Gunnar Solskjaer's struggling to get his rebuild off the ground, the Red Devils have been linked with a summer move for the Argetinian. As he continues to enjoy his downtime, Pochettino opted to take in Brentford's Championship clash with Leeds on Tuesday night. He was spotted on Sky Sports footage walking to his seat alongside Neil Ashton, recently employed by United's executive vice-chairman as a PR consultant. Mauricio Pochettino was pictured alongside Ed Woodward's new advisor at Griffin Park Read More Related Articles Anthony Martial lifts lid on relationship with Jose Mourinho after Man Utd tensions Read More Related Articles Mauricio Pochettino's dig at Arsenal as he declares pride over Tottenham tenure Pochettino was accompanied by assistant <mark>Jesus Perez</mark> as he watched the 1-1 draw at Griffin Park, although they are believed to have sat several rows away from Ashton. He is close friends with Leeds boss Marcelo Bielsa, whilst he was also spotted chatting to former Newcastle and Brighton boss Chris Hughton. Pochettino admitted he \"would love to work in the Premier League\" again as he eyes his next job. He told the In The Pink podcast: \"To be honest, I would love to work in the Premier League. Pochettino admits he would\" love \"to return to management in the Premier League (Image: Getty Images) Read More Related Articles Man Utd told not to play new signing <mark>Bruno Fernandes</mark> in No10 position\" It's going to be difficult, I know, and for now it's a moment to wait and we'll see what happens. \"It's a moment of recovery, to think about yourself a little bit, and to be ready because in football always something can happen and you need to be ready .\" I'm ready and waiting for a new challenge. I have the belief and confidence that the next challenge will be fantastic. \"Read More Mirror Football's Top Stories Pochettino issues come-get-me plea Why Wilder should beat Klopp to award Coutinho's honest Liverpool assessment Man Utd confident of signing Sancho Pochettino has long been linked with the United job, including when Spurs successor Jose Mourinho was sacked last December. Ole Gunnar Solskjaer eventually got the job and it is believed his job is not under immediate threat. But reports have claimed the club may reconsider his position if they miss out on the top four, with the looming presence of Pochettino meaning they could be tempted into action."}, {"articleID": "2009041402_00027246_W", "names": {"Alan Wilson": ["Q16087666", "Q16919824", "Q20738250", "Q2636879", "Q31429628", "Q33132025", "Q4708075", "Q4708076", "Q4708077", "Q4708079", "Q4708080", "Q4708081", "Q4708082", "Q59195204"]}, "date": "2009-04-14", "url": "http://thepeterboroughexaminer.com/ArticleDisplay.aspx?e=1521561", "content": "posted by brendan wedley/examiner staff writer the public is invited to take a walk downtown on saturday to learn about how local businesses and organizations are helping to make peterborough a greener city, the kawartha world issues centre says. the organization will hold the second annual peterborough earth day walkabout on saturday from 8 to 11 a.m. at the peterborough farmers' market then from 11 a.m. to 2 p.m. downtown. the kawartha world issues centre encourages participants to visit certain organizations and businesses in the downtown to learn how they're making peterborough a greener city. the planet bakery is one of several downtown businesses participating in the event. the bakery does a variety of things to operate in an environmentally friendly way, said ted pearson, the owner of the restaurant on water street. the restaurant uses bullfrog power to support renewable energy production, specializes in vegetarian food, buys products from local farms and it composts its waste, he said. the planet bakery is pretty much a zero-waste business, pearson said. \"we try as much as possible to eliminate any take-out waste as well with post consumer paper products and some corn products for disposable cutlery and disposable containers,\" he said. it was a natural fit for the restaurant to take part in an event that focuses on environmental sustainability, pearson said. \"it's always been a pretty big focus here,\" he said. participants can collect stamps at participating locations. continued after advertisement below anyone who collects at least three stamps will qualify for a draw for \"earth-friendly products\" donated by various businesses. green street is another business that's participating in the event. \"i sell the e-bikes,\" said verne windrem, who owns the business with his wife angella. \"they're a green source of transportation .\" activity haven's spring big bucks tournament will be held on saturday, april 25th at 11:00 a.m. roast beef dinner at 12:00 noon - $12.0 cued traditional line dance <mark>alan wilson</mark> invites all line dancers to an afternoon of fun saturday, april 18th from 1:00 p.m. to 4:00 p.m. queen alexandra community centre, volunteer appreciation activity haven will celebrate their wonderful volunteers on wednesday april 22nd. social time begins at 10:30 a.m. and brunch is at 11:00 a.m. if hello there: my name is tracy and im a grand mother who is irate. my grand children are 4 and 2and a half, and they house rentals hello my fiance and i are looking to rent a house for feb - we have no kids but we do have a cat merry birthday happy christmas hey just wondering who all out their has a dec 25th birthday? i was born on dec 25th and had a hard time with little lake development what in heavens name is the logical reason for such an uproar over the proposed little lake development brought forward by dean del mastro?"}, {"articleID": "2015082903_00031436_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-08-29", "url": "http://appeal-democrat.com/spotlight/entertainment/national/music/latin-music-academy-protests-trump-s-immigration-proposals/article_ba34692d-6197-5a61-b03c-862c233157df.html", "content": "WASHINGTON (AP)--Republican presidential candidate <mark>Donald Trump</mark> is drawing protests from another Latino organization--this time, one based in the music industry. The organization that runs the Latin Grammys and promotes the genre around the world, the Latin Recording Academy, says that \"<mark>Trump</mark> needs a respectful reminder\" of the \"countless contributions Latinos make to American culture .\" Subscription Required An online service is needed to view this article in its entirety. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 ALL ACCESS $162.00 for 365 days $81.00 for 180 days $40.50 for 90 days $13.50 for 30 days Print 7 days a week + e-Edition + Online. Rates are for Carrier Delivery only. Please contact our circulation department for Mail rates at (877) 741-1313. 2 TOTAL DIGITAL $144.00 for 365 days $72.00 for 180 days $36.00 for 90 days $12.00 for 30 days e-Edition + Online Current print subscribers 1 PRINT SUBSCRIBER ACCESS - TOTAL DIGITAL $1.50 for 30 days e-Edition + Online Current print subscribers! Active your total digital access for only $1.50 per month. Once your current print subscription expires, make sure to renew with the ALL ACCESS subscription. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now. You must login to view the full content on this page. Screen Name or Email Password Forgot? Login Screen Name or Email Now I remember! Need an account? Create one now. kAm% CF> A 92D G @ H65 E @ 56A @ CE 6G6CJ @? 6 =: G:? 8:? E96 &] $]: = = 682 = = J [6 =:>:? 2E6 3: CE9C:89 E 4: E: K6? D9: A 2? 5 3F: = 5 2 H2 = = @? E96? 2E: @? VD D @ FE96C? 3 @ C56C E @ DE @ A: = = 682 = 4C @ DD:? 8D]% 96 3: ==: @? 2: C6 3FD:? 6DD> 2? VD AC @ A @ D2=D 92G6 5C2H? AC @ E6DED 7C @> 5 @ K6? D @ 7 {2E:? @ 25G @ 424J 8C @ FAD] k^Am kAm {2E:? #64 @ C5:? 8 p4256> J! C6D:56? E 2? 5 rt ~ v23C:6 = p32C @ 2 yC] D2JD% CF> AVD Q56?:2 = @ 7 {2E:? @ 4 @? EC:3FE: @? D 2? 5 E96 5: G: D: @?: E H: = = 4C62E6 42?? @ E 36 E @ =6C2E65] Qk^Am & copy; 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Thank you for reading 5 free articles on our site. You can come back at the end of your 30-day period for another 5 free articles, or you can purchase a subscription at this time and continue to enjoy valuable local news and information. If you need help, please contact our office at 530 - 749-4700. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 ALL ACCESS $162.00 for 365 days $81.00 for 180 days $40.50 for 90 days $13.50 for 30 days Print 7 days a week + e-Edition + Online. Rates are for Carrier Delivery only. Please contact our circulation department for Mail rates at (877) 741-1313. 2 TOTAL DIGITAL $144.00 for 365 days $72.00 for 180 days $36.00 for 90 days $12.00 for 30 days e-Edition + Online Current print subscribers 1 PRINT SUBSCRIBER ACCESS - TOTAL DIGITAL $1.50 for 30 days e-Edition + Online Current print subscribers! Active your total digital access for only $1.50 per month. Once your current print subscription expires, make sure to renew with the ALL ACCESS subscription. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now."}, {"articleID": "2015042311_00013245_W", "names": {"Kevin Rose": ["Q16105194", "Q22968563", "Q2427588", "Q6397388"]}, "date": "2015-04-21", "url": "http://www.businessinsider.com/shyp-raises-50-million-2015-4", "content": "Just because it's worth $1 billion doesn't mean it's a unicorn, says VC who lived through the last bubble Oscar, a fast-growing startup that wants to shake up healthcare, just raised $145 million at a $1.5 billion valuation These are five of New York's most highly anticipated startups you need to know Shipping packages is a huge headache. So in March 2014, Shyp launched to make the process as easy as taking a picture of what you want to mail, pressing a single button to summon a delivery person, and having your package shipped. On Tuesday, Shyp announced that it had raised a $50 million Series B round of funding led by Kleiner Perkins Caufield & Byers, with participation from previous investors including Homebrew and Sherpa Ventures, and angel investors like <mark>Kevin Rose</mark> and Rent The Runway CEO Jennifer Hyman, bringing the startup's total funding to date to $62.2 million. In addition, the company says, Kleiner Perkins' John Doerr will join Shyp's board of directors. The company also announced the launch of a beta program in Los Angeles, in addition to the three cities where it currently operates: New York, Miami, and San Francisco. The new funding will allow Shyp to continue to expand throughout the US, to grow its team, and to develop new features. (In March, Shyp rolled out a feature for returns .) Since its last round of funding in July 2014, the company says it's seeing 20 percent month-over-month customer growth, has \"tens of thousands\" of customers, and its number of shipments has increased by nearly 500%. \"This is a momentous day for Shyp. We couldn't have hoped for a better partner to counsel us as we creatively solve extremely complex problems than John Doerr and the team at Kleiner Perkins,\" Shyp's CEO <mark>Kevin</mark> Gibbon said in a statement. In addition to its ease of use, Shyp provides transparency about where your package is along the way, and lets you know when it reaches its intended recipient. Shyp's convenience costs more than a trip to the post office would: you'll be paying $5 per package, plus the cost of shipping. And unlike Postmates, the on-demand courier service, Shyp can send packages globally, like UPS or FedEx. Shyp, a startup that wants to kill the post office, just raised $50 million Shyp, a startup that wants to kill the post office, just raised $50 million * Copyright © 2015 Business Insider Inc.. All rights reserved."}, {"articleID": "2012030206_00027814_W", "names": {"David Bellamy": ["Q3017494", "Q47517229"], "George Thompson": ["Q13519174", "Q17319936", "Q21463839", "Q3760658", "Q51077474", "Q51589758", "Q5545171", "Q5545183"]}, "date": "2012-03-02", "url": "http://shootinguk.co.uk/news/531971/Bellamy_awards_trophy.html", "content": "by will finch friday, 02 march 2012 prestigious conservation prize awarded to north yorkshire grouse keeper north yorkshire grouse keeper has won this year's prestigious <mark>bellamy</mark> trophy for his work promoting countryside conservation. the prize, now in it second year, is awarded annually by the national gamekeepers' organisation (ngo) educational trust and leading environmentalist professor <mark>david bellamy</mark>. winner <mark>george thompson</mark>, headkeeper at spaunton moor, near pickering, said: \"i come from the urban sprawl of middlesbrough, but i have had a love of the countryside since boyhood. luckily for me, i was steered down this path by a farsighted careers teacher. i am determined the public - both from town and country - get to hear about the amazing wildlife conservation work done by gamekeepers .\" for the sake of wildlife, it is vital people know the truth about the effectiveness of gamekeeper-driven conservation. it is a lifeline for much of the uk's flora and fauna - that's why i champion it at every opportunity. \"the rest of this article appears in the 29th february issue of shooting times. what is your opinion? this year's annual shooting times woodcock club dinner will be h.. ."}]