[{"date": "2014-12-11", "url": "http://www.noise11.com/news/stax-to-release-box-set-of-singles-20141211", "content": "Concord Music Group and Stax Records have announced the digital release and physical reissue of two comprehensive box set titles: The Complete Stax/Volt Soul Singles, Vol. 2: 1968-1971 and The Complete Stax/Volt Soul Singles, Vol. 3: 1972-1975. Originally released in 1993 and 1994, respectively, these two compilations will be re-released back into the physical market in compact and sleek new packaging. Each set includes full-color booklets with in-depth essays by Stax historian and compilations co-producer <mark>Rob Bowman</mark>. The volumes feature stalwart Stax R & B artists including Isaac Hayes, the Staple Singers, Rufus <mark>Thomas</mark>, Johnnie Taylor, <mark>Carla Thomas</mark>, the Bar-Kays and <mark>William Bell</mark>, as well as bluesmen Little Milton, <mark>Albert King</mark> and Little Sonny, and \"second generation\" Stax hitmakers like Jean Knight, the Soul Children, <mark>Kim Weston</mark>, the Temprees, and Mel & Tim. Many of the tracks included in these collections will be made available digitally for the very first time. The story of the great Memphis soul label Stax/Volt can be divided into two distinct eras: the period from 1959 through the beginning of 1968, when the company was distributed by Atlantic and was developing its influential sound and image (chronicled in acclaimed 9-CD box set The Complete Stax/Volt Singles 1959-1968, released by Atlantic in 1991); and the post-Atlantic years, from May 1968 through the end of 1975, when Stax/Volt began its transition from a small, down-home enterprise to a corporate soul powerhouse. In Stax's early years as an independent label, founders <mark>Jim Stewart</mark> and Estelle Axton struggled with the loss of its back catalog to Atlantic/Warner Brothers Records and the loss of the label's most lucrative artist, Otis Redding, who tragically died in a plane crash months before. In need of funding and new stars, Axton and <mark>Stewart</mark> sold the label to Gulf + Western, bringing on promotion head Al Bell (who would soon become an equal partner and major figurehead of the label). In his Vol. 2 essay, <mark>Rob Bowman</mark> recalls, \"As the sun arose in Memphis on May 6, 1968 [the day Stax officially became independent of Atlantic], Stax had been essentially gutted. For all intents and purposes it was a new record company poised to issue its first few records .\" Comprised of nine CDs, Vol. 2 focuses on this period, 1968 through 1971, when Stax/Volt was forging ahead as its own entity. The 216-song collection includes all of the singles issued by the label during this time period, and features some of the biggest and best-loved hits of the day, including Isaac Hayes' Theme From Shaft, The Staple Singers' Respect Yourself and Johnnie Taylor's Who's Making Love, as well as a number of little-known gems by both major and less-familiar artists. By the end of 1971, <mark>Bowman</mark> notes, \"Al Bell's dream of [Stax/Volt] becoming a diversified full-line record company was several steps further along the line to being reality. The label now recorded a wealth of different styles and flavors of black popular music, ranging from the jazz and easy-listening proclivities of Isaac Hayes to the blues of Little Milton to the '70s disco-infused vocal style of the Dramatics to the gutsy soul of the Staple Singers .\" Indeed, the early 1970s found Stax/Volt a much bigger entity than ever thought possible during its initial split from Atlantic, with Isaac Hayes as its breakout star. Spurred by the success of Hayes' GRAMMY Award-Winning Shaft soundtrack in early 1972, the label was casting its net across a wide cross section of the entertainment industry, entering into new territory with soundtracks, comedy records, and even investing in a Broadway play. The Complete Stax/Volt Soul Singles, Vol. 3: 1972-1975, coming Spring 2015, covers this era of success and excess, when Stax's stars were shining bright, but the label was on the verge of its dramatic denouement. The 10-disc box set contains all 213 soul singles issued by Stax/Volt during this time, including such hits as <mark>Shirley Brown</mark>'s Woman to Woman and the Staple Singers' I'll Take You There. In 1976, faced with involuntary bankruptcy and an unsuccessful distribution deal with CBS Records, Stax was forced to close its doors. In his liner notes for Vol. 3, compilation co-producer Bill Belmont writes, \"Stax's difficult and inglorious end in no way diminishes its vital contributions to rhythm and blues and soul. Today, the music of Stax maintains a strong and steady presence, heard continually in cover versions by major artists, in movies and on television. Simply put, the Memphis Sound lives .\" And indeed it does. With a revival of the label in recent years, through Fantasy Records, the 2003 opening of the Stax Museum of American Soul Music in Memphis, Tenn., as well as several developing theatrical performances around the label, the music of Stax will continue to influence generations of musicians and fans alike .----------------------------------------------Never miss a story! Get your free Noise11. com daily music news email alert. Subscribe to the Noise11 Music Newsletter here Listen to the Noise11 Music News channel now at iHeartRadio Follow Noise11. com on Facebook and Twitter----------------------------------------------more from vvnmusic-com Comments comments Tagged as: music news, Stax Tweet", "articleID": "2014121105_00029974_W", "names": {"Jim Stewart": ["Q16751261", "Q1689226", "Q21622965", "Q39078816", "Q6198338", "Q6198340", "Q782370"], "Kim Weston": ["Q1741589", "Q6409563"], "Rob Bowman": ["Q693016", "Q7339989", "Q7339991"], "Shirley Brown": ["Q30122835", "Q7498706", "Q7498707"], "William Bell": ["Q14950256", "Q19395422", "Q29000856", "Q3028826", "Q3568581", "Q43910767", "Q53844101", "Q59070365"]}}, {"date": "2014-12-11", "url": "http://www.scottishconstructionnow.com/2014/12/11/building-firms-enjoy-output-growth/", "content": "<mark>John Longworth</mark> The recovery of the construction sector should continue over the coming two years, according to new forecasts, with further growth predicted. The latest economic forecasts from the British Chambers of Commerce (BCC) indicate that the UK's overall Gross Domestic Product (GDP) rate should improve by 3 per cent this year. In response to weakening economic signals from abroad and lower-than-expected household consumption growth, this is slightly down on the group's earlier prediction of 3.2 per cent. However, despite the slight downgrade, the business group said further growth is expected to be seen in the building industry between now and 2016. It said the output of the construction sector should grow by 4.9 per cent in 2014, in full-year terms. Looking further ahead, the body added that construction output growth rates of 1.9 per cent and 1.6 per cent should also be witnessed respectively in 2015 and in the following year. Employers in the construction trade continue to offer apprenticeship schemes, in order to plug skill gaps and provide work opportunities to young people. These efforts appear to be having a positive impact, with the BCC suggesting that the unemployment total among 16 to 24 year-olds should drop from 737,000 in the third quarter of this year, to 533,000 in the same period of 2017. The UK's wider unemployment figure should dip from 1.959 million to 1.839 million by the third quarter of next year, meanwhile, the group suggested. Despite the downgrade in the headline GDP forecast, BCC director general <mark>John Longworth</mark> said the UK should remain one of the world's quickest-growing developed economies this year. He added: \"This is a great achievement, and businesses up and down the country should be congratulated for their hard work and resolve to drive the recovery in the face of challenges and uncertainty both at home and abroad .\" As Britain continues to recover from the effects of the recession, the BCC said businesses should see further economic growth in both 2015 and 2016. It said the country's GDP reading is likely to improve by 2.6 per cent next year and by another 2.4 per cent in 2016. Among its other predictions, the trade body said business investment levels should stay strong. It said these investments should go up by 7.5 per cent in 2014 alone. Share: More Share on Tumblr Pocket Print Press This Related", "articleID": "2014121113_00063702_W", "names": {"John Longworth": ["Q21462338", "Q23010148"]}}, {"date": "2014-12-11", "url": "http://www.morningstaronline.co.uk/a-88ae-Goodbye-Gordon-Brown/", "content": "He brought us boom and bust, facilitated City gambling, increased in-work benefits and oversaw the decline of British manufacturing. Nick Matthews on <mark>Brown</mark>'s legacy As <mark>Gordon Brown</mark> disappears into the dustbin of history as the man who saved the Union, it is appropriate to take a look at his significance. There is no doubt that he was both the architect and builder of new Labour's economic policy which has been so difficult for Ed Miliband to shake off. This is probably because he has persisted in dragging the dead weight of Ed Balls around with him. Balls not only represents the <mark>Brown</mark> legacy but offers little hope that Labour has learned anything from those years. My own view is that history will be much kinder to <mark>Brown</mark> the prime minister than to <mark>Brown</mark> the chancellor. This is probably the exact opposite of the popular perception. <mark>Brown</mark> the prime minister may have offered up a Freudian slip in the Commons when he said he had \"saved the world\" but to a large extent he had. When the banks teetered on the edge of collapse in 2008 he bailed them out and put up taxes. <mark>Brown</mark>'s bank nationalisation and bailout was the right thing to do. The alternative would have been catastrophic. However at a greater distance one can see that in effect the banks nationalised the government and socialised their losses. Did <mark>Brown</mark> extract enough from the state's newfound role as the owner or part owner of these banks? The answer is no. That bargain could only have been struck at the moment of disaster when - for a moment - the power moved to the state. But <mark>Brown</mark> asked for little or nothing for underwriting the banks to the tune of £ 1,162 billion. On the plus side, <mark>Brown</mark>'s Keynesian efforts to counteract the crisis meant the economy was returning to growth - before <mark>George Osborne</mark> put the brakes on with his first emergency budget and derailed the whole process, costing billions in lost output. However that is only a small part of <mark>Brown</mark>'s record. As chancellor he was a slavish supporter of Alan Greenspan who for 18 years was boss of the US Federal Reserve. The same Greenspan who finally admitted when the banks were collapsing that he had found a flaw in the theory of \"perfect markets\" - a flaw that had been obvious to most of us for years. Having pursued policies of deregulation and liberalisation, Greenspan had now found \"he made a mistake in presuming that the self-interests of organisations, specifically banks and others, were such that they were best capable of protecting their own shareholders and their equity in the firms .\" In pursuing the same policies and making London a safe haven for rogue global capital, <mark>Brown</mark> turned the City in to the world's largest tax haven. One of his daftest ideas and one the Establishment continues to praise him for was making the Bank of England \"independent .\" One of the greatest triumphs of the post-war Labour government was the nationalisation of the Bank of England. The idea that the policies pursued by the bank can somehow be depoliticised is fatuous. At this level economics is politics. What's more, an independent bank for years kept UK interest rates higher than those in mainland Europe, doing untold damage to Britain's manufacturing sector. <mark>Brown</mark> managed to destroy one-and-a-half million manufacturing jobs in the process. As well as liberating the City and the financial services sector to do their worst, his next crime was the way he structured the welfare state to create a set of subsidies to the private sector. His complex web of in-work benefits kept workers trapped on low pay and subsidised bad employers. Simultaneously housing benefit grew as private-sector landlords had a field day ratcheting up rents to milk the subsidy. What's more, because ordinary people received little benefit from his largesse they did not thank him at the ballot box for this spending. There are other examples, including the way that private-sector provision of care for children and the elderly has fallen in quality and risen in cost. A week does not go by without some scandal in these private services. He was truly naive in thinking ownership did not matter and you could use regulated markets to achieve better services for the public. Clearly Blair and <mark>Brown</mark> both had a malign influence in the Labour Party. <mark>Brown</mark> was ruthless in rooting out any opposition to his policies and spent an inordinate amount of time jousting with Blair in placing his cronies in safe parliamentary constituencies. It is clear now that the golden years of <mark>Brown</mark>'s chancellorship can be seen as being funded by fool's gold. Owned By Our Readers We're a reader-owned co-operative, which means you can become part of the paper too by buying shares in the People's Press Printing Society. Subscribe Have the Morning Star at your fingertips, wherever you are. All Rights Reserved Owned by Our Readers Companies House Number: IP12750R Registered office:", "articleID": "2014121200_00016857_W", "names": {"George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"]}}, {"date": "2014-12-12", "url": "http://westsussextoday.co.uk/report-into-south-downs-a-e-future-discussed-1-6469375", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. From the Back Pages, December 9: FA Cup draw: Arsenal vs Hull, AFC Wimbledon vs Liverpool and Manchester United to play Accrington or Yeovil From the Back Pages, December 12: <mark>Fernando Torres</mark> set to be offered up for FREE after Milan move to cancel Chelsea loan deal Sir <mark>Patrick Moore</mark> archive acquired by Science Museum From the Back Pages, December 8: Arsene Wenger targeted with foul-mouthed abuse at train station by furious Arsenal fans Report into South Downs A & E future discussed Health chiefs were quizzed last week over a controversial health contract award which could put South Downs A & E services at risk. Health bosses from both the Western Sussex Hospital Trust and Coastal West Sussex Clinical Commissioning Group (CCG), which awarded Bupa CSH Ltd a £ 235m musculoskeletal (MSK) contract, were before West Sussex County Council's Health and Social Care committee on Friday December 5. An independent impact assessment into the decision was jointly commissioned by the Trust and CCG after Western bosses went public with fears that its accident and emergency units at Chichester's St Richard's Hospital and Worthing Hospital could suffer as a result of the deal. Both are used by South Downs residents. One question asked by GP and committee vice chairman Dr <mark>James Walsh</mark> was why private procurement was chosen over public bidders. Marie Dodd, the CCG's chief operations officer, said legal advice made it clear there was \"no other option' but to offer the services out to tender. She said:\" The CCG (sought legal guidance) and reluctantly had to accept the advice that procurement was going to be the best vehicle, and the required vehicle for us to use in those circumstances. \"Dr Katie Armstrong, chief officer at the CCG, said a summary of the assessment would be made public once both bodies had studied it in full. The results will be shared with committee members ahead of HASC's next meeting on January 21, 2015. Committee's chairman, <mark>Margaret Evans</mark>, said:\" We will look very closely at the impact assessment's results as the MSK contract has been a matter of significant concern to the committee and to the public. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Springfield House Springfield Road Horsham clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. West Sussex Gazette provides news, events and sport features from the West Sussex area. For the best up to date information relating to West Sussex and the surrounding areas visit us at West Sussex Gazette regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2014121208_00029812_W", "names": {"Fernando Torres": ["Q3821470", "Q42731", "Q47088453", "Q58658056"], "James Walsh": ["Q21457849", "Q25183766", "Q548595", "Q6145079", "Q6145080"]}}]