[{"articleID": "2014080200_00049277_W", "names": {"Shane Byrne": ["Q1150486", "Q3481354", "Q7488001"], "Michael Rutter": ["Q3856254", "Q3856256", "Q47703212"], "Chris Walker": ["Q16196322", "Q21020894", "Q22811338", "Q2920788", "Q3675577", "Q42370515", "Q5108393", "Q5108394", "Q5108395", "Q5108396", "Q606715"], "Richard Cooper": ["Q16239345", "Q42758637", "Q5272785", "Q58193561", "Q7324878", "Q7324881", "Q7324882", "Q7324883", "Q7324884"]}, "date": "2014-08-01", "url": "http://superbike-news.co.uk/wordpress/Motorcycle-News/local-contender-bridewell-outpaces-byrne-as-top-16-separated-by-0-994s-in-free-practice/", "content": "Tommy Bridewell fired in a late scorcher to out-gun series leader <mark>Shane</mark> \"Shakey\" <mark>Byrne</mark> in the opening free practice for Sunday's sixth round of the MCE Insurance British Superbike Championship at the high-speed Thruxton circuit. The top 16 riders were covered by an incredible 0.994 s ahead of tomorrow's Datatag Qualifying session. Milwaukee Yamaha's Bridewell has just returned from competing in last Sunday's Suzuka Eight Hour race in Japan and he fired in a stunning time of 1m 15.845 secs late on in the second session. However <mark>Byrne</mark> responded instantly, closing within 0.039 s of Bridewell in the final minutes. Bridewell, based in nearby Devizes, was delighted with his performance at a circuit on which he has not had enjoyed good results in previous years. \"We have worked on the setting of the bike and it is working out just perfect. The bike feels really strong and the engine is fast so I am just enjoying my riding. Now we have to keep working hard and pushing ready for the races as that is what is important, but it is nice to be fastest today.\" <mark>Byrne</mark> in contrast has a strong pedigree at the Hampshire circuit, including a win double last year, and though he finished the day second. He said: \"I absolutely love riding this circuit, it's a bit like the M25, fast, flowing and wide and while we still have things to try, I'm feeling good. We had new brake discs to try and my first flying lap of the morning was actually faster than my fastest race lap of last year so that was a good starter.\" <mark>Michael Rutter</mark> set the third fastest time on the Bathams BMW, just eclipsing the Czech Republic rider Jakub Smrz on the Millsport Ducati and Buildbase BMW's Ryuichi Kiyonari, who like <mark>Byrne</mark>, is chasing a record fourth British title. Dan Linfoot, riding for the Bournemouth-based Quattro Plant Kawasaki team and Peter Hickman on the RAF Reserves Honda eased Aussie Josh Brookes on the second Milwaukee Yamaha back into eighth place. Lloyds British GBmoto Racing Kawasaki's <mark>Chris Walker</mark> and Anvil Hire TAG Kawasaki's <mark>Richard Cooper</mark> completed the top ten in a closely fought session. Josh Waters, the winner of the wet second race last time out at Brands Hatch, was sixteenth fastest on his Tyco Suzuki, but still less than a second off Bridewell. Results Free practice one: 1: <mark>Shane Byrne</mark> (Rapid Solicitors Kawasaki) 1m:16.020 s 2: Tommy Bridewell (Milwaukee Yamaha) +0.691 s 3: Josh Brookes (Milwaukee Yamaha) +0.903 s 4: Peter Hickman (RAF Reserves Honda) +0.947 s 5: <mark>Richard Cooper</mark> (Anvil Hire TAG Kawasaki) +0.958 s 6: Ryuichi Kiyonari (Buildbase BMW) +0.998 s Free practice two: 1: Tommy Bridewell (Milwaukee Yamaha) 1m:15.845 s 2: <mark>Shane Byrne</mark> (Rapid Solicitors Kawasaki) +0.039 s 3: <mark>Michael Rutter</mark> (Bathams BMW) +0.093 s 4: Jakub Smrz (Millsport Ducati) +0.199 s MCE British Superbike Contenders Feel the Need for Speed at Thruxton"}, {"articleID": "2012101615_00020119_W", "names": {"Danielle Spencer": ["Q516464", "Q5219443", "Q57770065"], "Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2012-10-16", "url": "http://theweek.com/article/index/234867/the-surface-tablets-glee-inspired-first-commercial", "content": "12 proposed u.s. states that didn't make the cut the surface tablet's glee - inspired first commercial clinton takes the blame for benghazi: 4 consequences the daily gossip: russell crowe splits with <mark>danielle spencer</mark> the surface tablet's glee - inspired first commercial microsoft enlists sun-soaked dancers to help unveil the new windows slab posted on october 16, 2012, at 10:50 am a new commercial for the surface tablet may mesmerize viewers with an elaborate choreographed dance and prominent \"body popping.\" see all 50 photos the video: microsoft debuted its first commercial for the long-awaited surface tablet during monday night football, and rather curiously, it's full of \"singing, dancing, and lots of clicking,\" says chris matyszczyk at cnet. the television spot, which features a colorful assemblage of hip youngsters giddily snapping the tablet's magnetic keyboard cover on and off, is the vision of director jon chu, who is best known for his work on the step up movies and justin bieber: never say never reportedly start at $499 for an entry-level version, and be available starting oct. 26. will the surface's tv debut help microsoft win over the new fans it needs to take on the ipad? the reaction: is this \"an episode of asks gavin clarke at the register. all the\" body-popping plus formation jumping and twirling kids in starched whites and pressed plaid \"are very obviously trying to prove one thing - that microsoft's windows tablets are\" fresh. \"there's just one problem, engadget: the commercial doesn't\" expose any deep details about the hardware, its potential price tag, or the software running on it. \"still, <mark>glenn beck</mark>, inc. <mark>glenn beck</mark>'s new advertisement? for jeans? the pakistan dilemma malala yousafzai: will her shooting end islamic extremism in pakistan? don't get taken for a ride when it comes to car repairs--savings experiment hillary clinton takes responsibility for libya attack on eve of debate contact us? 2012 the week publications, inc. all rights reserved. the week? is a registered trademark owned by felix dennis."}, {"articleID": "2012042421_00064320_W", "names": {"Steve James": ["Q1798956", "Q2347045", "Q28857138", "Q3526952", "Q3973356", "Q3973438", "Q7612926", "Q7612927"]}, "date": "2012-04-24", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://finance.yahoo.com/news/u-steel-outlook-disappoints-stock-210313315.html", "content": "tip: use comma (,) to separate multiple quotes. by <mark>steve james</mark> (reuters) - u.s. steel corp's (x) flat-rolled business could decline in the second quarter and the european economy is still a challenge, the company said on tuesday in a disappointing outlook that sent its stock down. but chairman and chief executive officer john surma later painted a rosier picture, telling wall street analysts that order rates have picked up in the last month as demand for steel improves in most end-markets except construction. \"our order rates in the last month or so have been better than the previous two months,\" surma said on a conference call. \"so demand...has been steady.\" the north american market...despite the fact that the economic recovery has been very choppy...is still a pretty good market. the biggest missing link there is in construction. \"surma said u.s. steel was benefiting from strong demand from oil and gas drillers for tubular steel, and also from detroit where auto production is on the upswing.\" on the overall automotive market for us in north america we've been doing very well, \"he said.\" (but) while our markets are gradually improving, the economic recovery is certainly not complete. \"earlier, the steelmaker reported better-than-expected first-quarter results, saying it shipped more steel in the january-march period than in any quarter in more than three years. but it also gave a gloomy outlook for the second quarter. results for the flat-rolled steel segment are expected to decrease due primarily to higher maintenance costs, surma said in the company's earnings statement. costs were expected to increase by about $50 million from the first quarter, for scheduled blast furnace and other maintenance projects. that will reduce the amount of steel the company produces.\" while the economic conditions in europe remain challenging, \"second-quarter results from the european business segment are expected to return a positive income from operations, u.s. steel said. the tubular segment, which makes steel for gas and oil pipes, is expected to have similar results to the first quarter. the company's stock fell as much as 4 percent during the morning but recovered somewhat to close down 2 percent at $27.65 on the new york stock exchange.\" the stock is down on a more muted second-quarter outlook. they are guiding to a flat quarter, \"said analyst kuni chen of crt capital group. he pointed out that steel prices, which rose earlier this year, have since stalled in recent weeks.\" it's a bit of a disappointment as people were expecting positive pricing and momentum to follow into the second quarter. \"michelle applebaum of steel market intelligence in chicago said steel prices had fallen back as a result of chinese steel production and export increases in march.\" when china produces more steel, the world has too much, \"she said. u.s. steel posted a net loss of $219 million, or $1.52 per share, compared with a net loss of $86 million, or 60 cents a share, in the same quarter of 2011. but adjusted for items, including a $399 million loss on the sale of its serbian operations, it showed a profit of 67 cents per share, which beat analyst expectations. sales rose to $5.2 billion from $4.8 billion in the 2011 quarter on higher prices and shipments, the pittsburgh-based company said. analysts on average had expected adjusted earnings of 45 cents a share and revenue of $4.95 billion, according to thomson reuters i/b/e / s. u.s. steel said first-quarter prices increased by $23 per ton to $764 per ton due to higher average realized prices on both spot and contract business. shipments increased by 8 percent to 4.1 million net tons, the highest shipping level since the third quarter of 2008. also on tuesday, a competitor, ak steel holding corp (aks), reported a first-quarter loss as a drop in shipment volumes offset higher steel prices. ak steel's net loss was $11.8 million, or 11 cents per share, versus a profit of $8.7 million, or 8 cents a share, in the year-ago quarter. the loss was expected and ak steel's stock fell 1.9 percent to $7.20. apple blows out earnings, sells 35m iphones in 2q; shares soar after hours your most recently viewed tickers will automatically show up here if you type a ticker in the\" enter symbol/company \"at the bottom of this module. breakout - wed, apr 18, 2012 2:27 pm edt copyright? 2012 reuters limited. all rights reserved. republication or redistribution of reuters content is expressly prohibited without the prior written consent of reuters. reuters shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. quotes delayed, except where indicated otherwise. delay times are 15 mins for nasdaq, nyse and amex. see also delay times for other exchanges. quotes and other information supplied by independent providers identified on the yahoo! finance partner page. quotes are updated automatically, but will be turned off after 25 minutes of inactivity. quotes are delayed at least 15 minutes. all information provided\" as is \"for informational purposes only, not intended for trading purposes or advice. neither yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. by accessing the yahoo! site, you agree not to redistribute the information found therein. capital iq. historical chart data and daily updates provided by"}, {"articleID": "2011012516_00107625_W", "names": {"Amir Khan": ["Q19561000", "Q24005694", "Q469870", "Q59490906"]}, "date": "2011-01-25", "url": "http://sportinglife.com/story_get.cgi?STORY_NAME=boxing/11/01/25/manual_160802.html", "content": "<mark>khan</mark> - may yet face paul mccloskey. click here for more boxing news undefeated irishman paul mccloskey may yet face wba light-welterweight champion <mark>amir khan</mark> in a world title showdown later this year. the european champion's hopes of facing 24-year-old <mark>khan</mark> (24-1 17kos) at manchester's men arena on april 16 appeared over following a breakdown in talks. negotiations fell apart with the dungiven fighter's promoter barry hearn claiming the fight was now \"dead' due to the\" joke' contract offered by the olympic silver medallist's team. however, mccloskey's manager francie mcnicholl has revealed that talks have restarted after team <mark>khan</mark> offered an improved package. \"they had initially told us we had to take or leave their offer, but things look a lot more promising now,\" said mcnicholl. \"we understand they are preparing to offer us better terms and we'll make sure they're right for paul before we sign any contracts. that's where we are at the minute.\" bolton star <mark>khan</mark> has urged 31-year-old mccloskey (22-0 12kos) to accept the latest terms. fantasy f1----------------------------------------------------------------"}, {"articleID": "2015072418_00011272_W", "names": {"Mike Magee": ["Q2889530", "Q6847758"], "Linda Harrison": ["Q16225353", "Q272445", "Q50904999"]}, "date": "2015-07-24", "url": "http://www.techeye.net/tag/wto", "content": "wto | TechEye TechEye by <mark>Mike Magee</mark>. The World Trade Organisation (WTO) published a list of 201 IT products today that will be free from import tariffs--meaning many products will be cheaper. The WTO's aim is to boost different economies worldwide and the freedom of tariffs will have widespread implications ....Read the rest by Nick Farrell. Antigua's government has hit on a wizard wheeze to force the US to stop illegally killing off its internet gambling industry. The US government went on a puritan push against online gambling under the Bush administration. Since the tiny country made most of its money from online gambling, the US set up a trade blockade ....Read the rest by Matthew Finnegan. With tensions over rare earth trade showing no signs of abating, DEFRA says that it is important to raise awareness of the threat to the supply chain. by Matthew Finnegan. The government is hoping that recycling rare earth materials could protect businesses in the UK from being buffeted by rising costs. Against a backdrop of EU and US appeals to the World Trade Organisation regarding China's relative monopoly over the valuable minerals, the government has launched an initiative to bolster security against fluctuating prices ....Read the rest by Matthew Finnegan. The US is leading a push against a Chinese stranglehold on rare earth minerals, with the EU and Japan also planning to take a case to the World Trade Organisation. Following the publishing of a report by the Associated Press, President Obama is expected to announce today that the trio will demand talks with China over rare earth exports ....Read the rest by Andrea Petrou. A WTO report attacking China's exports of raw materials has cast doubts of reliability. Dr Xiaolan Fu, a University Lecturer in Development Studies at the Fellow of Green-Templeton College, University of Oxford has said the World Trade Organisation (WTO) ruling casts aspersions of double standards ....Read the rest by John W. Daly. French NGO La Quadrature Du Net has sifted through US diplomatic cables released by Nobel Prize nominee Wikileaks and uncovered details surrounding the dreaded Anti-Counterfeiting Trade Agreement (ACTA). According to La Quadrature, the cables state Japan was approached by the USA to chalk up a \"gold-standard\" IPR (intellectual property rights) agreement \"among a small number of like-minded countries,\" i.e....Read the rest by <mark>Linda Harrison</mark>. Officials from the EU warned today they were keeping a close eye on the situation of China's restrictions on rare earths exports. The EU said at a conference with the World Trade Organisation in Berlin that it was watching China's actions for possible legal implications, reports ....Read the rest Reuters by Adamson Rust. The World Trade Organisation (WTO) has called on the European Union (EU) to abolish tariffs on imports of technology products, after receiving formal complaints from the US, Japan, and Taiwan. The EU has operated a system of tariffs between six and 14 percent on a small range of technology goods that many other countries believe should fall under the 1996 Information Technology Agreement, when 70 countries, including EU members, agreed to eliminate duties on IT products, which would total several billion a year otherwise ....Read the rest"}, {"articleID": "2018120319_00197128_W", "names": {"Joe Gray": ["Q26883429", "Q54867362", "Q6210101"]}, "date": "2018-12-03", "url": "http://www.runnersworld.com/gear/a25368752/best-shoes-2019-the-running-event/", "content": "How to Dress for Running This Winter The Best New Shoes for 2019 Launched at The Running Event From insanely light cross-country models to supremely soft marathon trainers, these shoes promise a lot of fun miles in the coming year. Dec 3, 2018 Jeff Dengate For running gear geeks, Austin, Texas, is the place to be in the final days of November. Each year, the industry descends on the city for The Running Event--part retail workshop where stores can share best practices, and part gear expo where brands can show off the latest in shoe tech and stylish apparel. Advertisement - Continue Reading Below At this year's show, the theme in general was shoe fit and comfort. While previous years have brought us a foam war--with each brand trying to deliver a bouncy, soft midsole--the companies really turned their focus to the shoes' uppers and how they interact with your foot. We haven't heard the last about foams, to be sure, but next year's shoes promise to better wrap your foot with less risk for blisters and hot spots. Here are 17 of the most exciting shoes launching in 2019. New Balance Fuel Cell Rebel Price: $130 Available: July 1, 2019 The Fuel Cell Rebel's curved shape and lateral fin is a novel design that caught the eye of expo attendees. Jeff Dengate One of the shoes that got the most attention at the show is the Fuel Cell Rebel (pictured here and at the top of this article). If you know anything about any Fuel Cell models NB has previously built, forget it. The company is keeping the name, but scrapping the nitrogen-infused foam it had used before. Instead, the name will live on in a speed-based series of shoes. The Rebel is rooted in the company's \"miler project,\" given the company's success at the mid-distance with runners like. This shoe has a bold fin sticking off the lateral (outer) edge of the shoe, to smooth the landing for runners who make ground contact out on the side of their foot. We were told \"this shoe is not for jogging.\" No, it looks clearly built for speed. It'll have a 6mm drop. Jenny Simpson Saucony Mad River TR Available: June 1, 2019 Jeff Dengate I absolutely love the concept of this trail shoe. I've often said that a running shoe is just a tool, and we should tweak it as needed to make it work the way we want. By that I mean you shouldn't be afraid to punch an extra eyelet in the upper to change how you lace the shoe, or even take a knife to the mesh to relieve pressure or irritation. Saucony has taken that concept here and actually suggested where you might customize it. The sole shows you recommended places to customize the shoe to your needs. Jeff Dengate Do you run a course with lots of stream crossings? Break out the Milwaukee drill and poke holes in the outsole--obviously do so when the shoe is not on your foot. Labels on the rubber even tell you what size drill bit to use. Or maybe you want to wear the shoe in the winter on slippery roads? More markings show you not only where to place the screws but also what size to use. There are also multiple options--ghillies and eyelets--for lacing the shoe up tight. Altra Vanish-XC Advertisement - Continue Reading Below Advertisement - Continue Reading Below This shoe is about as minimal as it gets these days. A fishnet upper straps a thin, 14mm foam and rubber sole to your foot--and that's about it. But the shoe has a purpose. Initially, it's intended to give young cross-country runners a tool to build foot strength and run fast in training over grass courses. Its X-shaped tread delivers grip on mild terrain. But it can also be used for much the same purposes for the rest of us. In introducing the shoe to us, Altra cofounder Golden Harper said \"stronger feet equals less shoe needed,\" and that's wise advice to heed. If you build foot strength, you can more comfortably run in thinner, lightweight shoes. So, while many of us might use it as a training tool, more advanced runners will take it out for long speed sessions. Altra athlete Zach Bitter wore it in November when he set the 100-mile trail world record, running 12:08:36--that's 7:17 per mile, by the way. If you're the type to lace this one up, you'll also like how you can loop the laces through nearly any hole in the upper to customize the fit to your foot. Hoka One One Clifton 6 Price: $130 Available: June 1, 2019 Jeff Dengate I'm a fan of the Clifton, and still of the franchise. But the 6 continues the shoe's legacy, positioning it right in the territory of a or--a do-it-all trainer that's going to work for an awful lot of runners. This version has been overhauled under and around the foot. The midsole has been softened just a bit from version 5, and rubber patches on the sole have been repositioned to improve durability. Meanwhile, the upper has been redesigned to add structure. To do so, Hoka is using embroidery through the midfoot--a series of six stitches extend from the eyerow to the midsole down near your heel to provide some lateral support to the engineered mesh upper. hold v1 as the pinnacle Brooks Ghost Nike Pegasus Advertisement - Continue Reading Below Available: June 1, 2019 Brooks Running A big overhaul that caught our attention is the Cascadia--a trail titan that typically doesn't see major changes. But the new version has been reworked top to bottom. Under the foot, a new trail rubber has a wet-grip formulation for more secure footing. Brooks says it took the rebound out of the rubber, so when you hit rocks on the trail, the rubber sticks better, rather than deflecting off it. The company has also retooled the lugs underfoot for more secure footing and changed up the pivots--those triangle wedges of firm foam at the four corners that deliver extra stability on uneven ground. Perhaps the biggest change, however, is the new knit upper. It's a sleek execution for a shoe that's. The knit material is lightweight but secure thanks to its no-stretch design. To give extra protection, Brooks is using a Cordura mesh just above the midsole, where you're likely to snag rocks and sticks on technical trail. The changes are reported to bring the shoe down an astonishing 1.2 ounces. typically had a burly construction Advertisement - Continue Reading Below Available: June 1, 2019 Jeff Dengate The Liberty won our thanks to its versatile mix of comfort and support for long runs. But how will its successor fare? Since it's an off-year update, very little changed under the foot--manufacturers are largely on a two-year cycle for foam and rubber updates. So this shoe still gets the full-length layer of Everun as a midsole, making for a bouncy, cushioned ride. Saucony beefed up the plastic post under the heel and arch a bit. It did so by making it slightly longer and extending a few plastic ribs of the post farther into the midsole, basically firming up that region. It also bolstered support by adding a genuine heel counter inside the shoe to lock the back half of your foot in place. The previous model had a simple plastic strap that wrapped around the heel but didn't really offer much in the way of structure. Saucony also added a \"high tensile polyester fiber\" to the heel and midfoot. It's a thread that winds around the shoe's upper and is stitched in place to add even more structure and support, much like traditional overlays would have but in a lighter execution. Best Debut award in early 2018 Reebok Forever Floatride Energy Jeff Dengate Advertisement - Continue Reading Below We've really loved the direction of Reebok the last couple years, and the team there has been cranking out some great shoes using a new Floatride midsole foam. But, to reach more runners with a lower price, they've come up with a slightly different kind of foam they're calling Floatride Energy. It's a lightweight expanded TPE--essentially, small plastic beads are steam molded together. Reebok says it's 30 percent lighter than traditional EVA and delivers better energy return, but it's not as soft as the midsole material used in other Floatride shoes like the. Add to that a simple full-length rubber outsole that will give good durability and value. I've been in the shoe a while now, and it's currently on the feet of our wear-testers. The early results are exactly as Reebok describes: It's a lightweight training shoe that feels quick when you want to run fast. It doesn't have the premium construction and plush build of pricier shoes, but it should be a real bargain for younger runners and those on a budget. Run Fast Asics Gel-DS Trainer 24 Price: $120 Jeff Dengate The DS Trainer has a bold new look. It's the first Asics shoe to get a knit upper. And our early indications are that this change alone has greatly improved the long-time tempo shoe. I've been running in this one as well, and our wear-test team is piling miles on it now, but I find myself reaching for it on quick days more often than I did recent versions. That's likely also due to the full-length layer of FlyteFoam Lyte. It's a lighter version of the foam the brand has been rolling out to its cushioned titans like the Nimbus and Kayano. Although it reduces weight, it still offers excellent cushioning power and responsiveness. Asics added a new heel counter into the knit upper so you don't get any slippage on heel lift. Don't like the mottled design? No worry. Our test samples came in a slick blacked-out option. Advertisement - Continue Reading Below Available: November 1, 2019 Brooks Running You're forgiven if you looked at this picture and thought you were seeing a Ghost. That's exactly what Brooks has in mind here with the Adrenaline. It's the stability brother to the Ghost, with a similar design and fit. The difference between the two going forward is the level of support. The GTS 20 will continue using guide rails for support, just like those found on the GTS 19 that's hitting stores right now. Those rails are in place of the traditional medial post--a firm wedge of foam under the arch for stability. But, while the shoe still delivers support for those who need it, it doesn't scream \"stability shoe.\" The new engineered mesh upper has a sleek design that any runner will be proud to lace up. The tread isn't overly aggressive, which is perfect for \"western technical\" trails--on the East Coast we call them rail trails. Saucony Switchback ISO Available: February 1, 2019 Jeff Dengate Saucony used to make a Kinvara for the trails, but it was a Kinvara in name only, really, and went extinct. The Switchback, however, is a lot like the Freedom ISO. The shoe came about because runners in northern California were taking that shoe on trails but wanted more traction. Enter the Switchback. It has a 4mm drop and full-length Everun midsole like the Freedom. One notable difference is the Boa closure for a quick, secure lock down. The dial lets you make tiny adjustments in tension--something you can't do with laces--and won't stretch or get loose over the duration of your run. Advertisement - Continue Reading Below Available: February 1, 2019 Jeff Dengate Though most brands focused on fit and materials at the show, many were talking about Skechers. Truth. Getting all that attention is Hyper Burst, a new form of EVA that's created differently. Instead of being blown with chemicals, it's made when CO2 is heated under pressure and becomes a supercritical fluid. There's a load of science behind it, but what it means for runners is the foam has a different cellular structure that allows it to be durable and springy, without being heavy. This is another shoe that we've been testing here at Runner's World already. The feeling underfoot is an odd sensation of firm but protective. There's plenty enough cushioning even when running down steep hills, but it's light and responsive. The same foam is being used in the GOrun Razor 3. But, the GOrun 7 has a stretchy knit upper mated to the midsole. The outsole has pods on the bottom of the foot--think way back to the, the pods are back. These boost the shoe's cushioning power a bit, as each compresses individually when you load them with weight, making the shoe feel smoother and softer. It's expected to weigh just 7.8 ounces and have a 4mm drop. original GOrun Advertisement - Continue Reading Below Available: July 1, 2019 Jeff Dengate In the past, I've bemoaned how much weight the Clifton gained over its five years, mostly because that first Clifton was so darn light and soft. My displeasure is eased a good bit now. No, the Clifton isn't going on a diet, as we saw above, but it has a new sibling that is lighter and suitable for race day. In fact, that's exactly why Hoka built this version. It has the same stack heights as the Clifton--29mm in the heel, 24mm in the forefoot, according to Hoka--and should fit like that everyday trainer. To help the shoe check in at 7.7 ounces, it uses a lightweight reinforced mesh that locks your foot in place. Under Armour Hovr Infinite Available: February 1, 2019 Jeff Dengate Under Armour is still in the high-energy return foam wars with its Hovr platform. And new to the line for 2019 are three shoes--the Infinite, a neutral trainer; the Guardian, a stability model, and the Velociti, a performance trainer or race day model. The most approachable of the three is the Infinite, though, and it's clearly shooting for shoes like the Asics Gel-Nimbus--a plush model built for high comfort over long miles. The key to the shoe, of course, is the Hovr foam, a squishy material that's so soft is has to be wrapped in a web to keep it from squeezing out of the shoe and encased in a more durable carrier foam. Women get their own gender-specific fit from this shoe, with the patterning of the upper adjusted to better fit the instep and volume of the toebox. They also get a different sockliner that boosts cushioning in the rear half of the shoe. It's spec'd to have an 8mm drop and every pair will come with the stride-tracking sensor in the midsole, which sends your run data to the MapMyRun app. Advertisement - Continue Reading Below Price: $155 361 Degrees The Strata continues as 361's top-of-the-line stability shoe. It delivers not only support for runners who need it but also loads of cushioning and plush comfort. If there's a comparison to make, it's the brand's take on the. This version has been re-engineered, but still features a full slab of the brand's Quickfoam directly under your foot. That's the company's bouncy, durable foam that really amps comfort and helps the shoe feel just as soft at mile 20 as it did on the first few steps out the door. The all-new upper has a jacquard mesh that really boosts the shoe's style, and a \"Morphit\" lacing system--fabric straps loop through the eyelets and tie directly into the laces, pulling across the top and helping the upper wrap up and around your foot for a snug fit. Kayano Advertisement - Continue Reading Below Available: Now Jeff Dengate You have to be a little bit crazy to launch a running shoe company nowadays. And you have to be out of your mind to do it outside of Asia, where the skilled laborers and manufacturing infrastructure already exist. But, that's just what Kenya-based Enda has done. Its first model, the Iten, is named after the small town in the Rift Valley that's loaded with distance-running talent. Cofounder Weldon Kennedy tells us that Enda set up shop in a flip-flop factory, one capable of churning out 200,000 pairs of the summer's shoes. As expected for a debut shoe from a small company--especially one in a flip-flop factory--the Iten has a compression-molded midsole and really basic construction. It's a shoe with a rich backstory and full of good will, if not loaded with technical features. As for performance, the Iten is designed to be a low-volume, go-fast shoe. That means it fits snug and is meant for fast running. It's not something you'll grab for an easy jog or a long run. That could prove a challenge for the company as it tries to grow, but it's already eyeing its second shoe, a midweight cushioned model. For now, the only place you can buy the Iten is from Enda directly at. endasportswear.com Merrell MTL Cirrus Jeff Dengate Advertisement - Continue Reading Below For a while, Merrell sponsored <mark>Joe Gray</mark>, currently the top mountain runner in the United States, and world mountain running champ in 2016. Although <mark>Gray</mark> now runs for Hoka One One, it was with his input previously that Merrell designed this shoe, suitable for running straight uphill. Dubbed the Cirrus, this skyrunner model is meant to deliver grip and protection for running up mountains. The shoe is really stripped of protective features you'd need for running back down, though it does have a rock plate to give you some relief. The sole is made from Vibram Megagrip and has lugs designed to give you great grip on steep terrain, while the upper is a nearly see-through nylon that won't rip easily. Diadora Mythos Blueshield 3 Available: Now Diadora Diadora is another name you may be unfamiliar with or associate with other sports. But the Italian brand is making a move into the performance running space again. It's working channels and getting into specialty run shops, so you may see its shoes on the wall of your local running store soon. The shoe leading the charge is the Mythos Blueshield 3. It's a neutral trainer that uses a gel-like layer in the midsole which has a series of nubs protruding from it to help cushion and stabilize the foot. Jeff Dengate Runner-in-Chief Jeff is Runner-in-Chief for Runner's World, guiding the brand's shoes and gear coverage. Advertisement - Continue Reading Below"}, {"articleID": "2013051121_00079082_W", "names": {"Phil Davis": ["Q576360", "Q7181829", "Q915916"], "Alexander Gustafsson": ["Q20680376", "Q723744"], "Jon Jones": ["Q285450", "Q3183202"]}, "date": "2013-05-11", "url": "http://bleacherreport.com/articles/1635616-lessons-the-ufc-can-learn-from-big-time-boxing-promoters", "content": "The rapid rise of the UFC, combined with the boxing's decline in the American mainstream, has led to a slew of pundits, including yours truly, suggesting that the sweet science has plenty to learn from its cage fighting brethren. And it's true. The UFC does many things extremely well, and their success has not come by chance. From providing excitement up and down the fight card to expert use of social media, the UFC has much to teach its older combat sports brother. Former junior welterweight boxing champion Ricky Hatton pinpointed the most important lesson after he spent a little time studying exactly how the neophyte Las Vegas-based MMA promotion has managed to do so well in recent years: What boxing can do is learn from what the UFC is doing. One thing that hinders fighters is not being able to get the fights they need as quickly as they need. I'd like to see boxing's promoters work more closely together. It would be for the good of the sport. But that doesn't mean the UFC has it all figured out. Boxing promoters have been raking in money hand over fist since John L. Sullivan was boasting he could \"whip any man in the room\" way back in the 1890s. There are some time-tested tricks boxing folks use very, very well that the UFC would be smart to pay careful attention to. The best thing boxing does is build stars. A cynic might replace the word \"build\" with the word \"manufacture.\" Either way, by the time boxing's best young fighters are ready to take on the world, they have been carefully matched in a way that maximizes their strengths, minimizes and slowly works to improve their weaknesses and gives them a chance to build a fanbase on increasingly large television platforms. The UFC doesn't nurture it's young fighters in the same tender way. Instead, matchmaker Joe Silva tends to throw them to the wolves, demanding they sink or swim early and often. Take, for example, the 2010 fight between then 25-year-old wrestling star <mark>Phil Davis</mark> and then 23-year-old Swedish striker <mark>Alexander Gustafsson</mark>. In boxing, these two prospects would have been on parallel paths, learning and developing at the same time. When and if they met, it would be in a fight that mattered, sometime well down the line. In MMA, they met up in what was just the second UFC fight for both young fighters. <mark>Davis</mark> got the better of <mark>Gustafsson</mark> that day, meaning before he'd ever had the chance to shine, a young prospect faced a very public and very bitter defeat. That fight should have never happened-and it wouldn't have in boxing. Once a star is built, even if you take the long way around like the UFC does, he needs to propelled onto the national scene. The UFC hasn't had great success making this happen. They've had one notable success in Chuck Liddell and another work in progress in <mark>Jon Jones</mark>. The rest of their crew are stars only in the insular world of fight fans. The bulk of the UFC's television time is spent attempting to make a name, not for potential pay per view drawing cards, but for young fighters, often no-hopers, on The Ultimate Fighter reality show. There's very little time or promotional muscle left for fighters climbing their way up the ladder, the grinders who build their success in tiny increments on card after card. Boxing has been kind enough, however, to leave behind a template for making a rising boxer a bona fide star. HBO, along with the gifted Floyd Mayweather, turned the young fighter from pay-per-view bust to pay-per-view sensation with their own reality television special called 24/7. Instead of investing hours and millions into fighters who will likely never leave the undercard, boxing turns its attention to the top of the card. 24/7 and All Access on Showtime let fans know what fighters are like outside the ring, and media tours to select cities make every major fight feel like an event, not just another night of television. As yet, the UFC has been content to promote their brand over any individual fighter. National media about the group almost always features the promotion's owners and president Dana White. Attention, and credit, is rarely deflected to the fighters themselves. It's a major part of the reason boxing has cornered the market on the \"mega event.\" When Floyd Mayweather and Manny Pacquiao fight, it's national and international news. What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? Craziest MMA GIFs From: BroBible.com We'd like to send you the most entertaining"}, {"articleID": "2011080514_00068967_W", "names": {"Stephen O'Neill": ["Q53281195", "Q57338151", "Q7610125"], "Barry Cahill": ["Q4864069", "Q4864070"]}, "date": "2011-08-05", "url": "http://herald.ie/sport/gaa/gilroy-and-harte-in-croker-bluff-2841142.html", "content": "pat gilroy and mickey harte have launched an early bout of mind games with some intriguing selection announcements for tomorrow night's all-ireland sfc quarter-final between dublin and tyrone at croke park. gilroy caused a stir at a dcu press conference this morning when including eoghan o'gara--long flagged as a definite non-starter with a broken wrist--in his starting sky blue team. however, the dublin boss immediately threw open the possibility of an 11th hour change when revealing that o'gara must still undergo a late fitness test. the same applies to two others returning from injury but not named in the team--midfielder michael darragh macauley and defender philly mcmahon. on o'gara's fitness, gilroy revealed: \"they took off the cast on wednesday evening and it was fine, it had healed well.\" he'll have a light protective case over it, and again we'll fully test it out tomorrow but it's probably a week or two quicker than anyone could have expected. \"we're very happy but we have to test it out fully tomorrow, whether he can take full contact, and it's a bit the same with michael darragh.\" while tyrone boss mickey harte has raised eyebrows by not listing ryan mcmenamin and <mark>stephen o'neill</mark> in his official match-day 26 - even though both are almost certain to feature, at least among the subs - gilroy has done likewise with some notable omissions from his chosen team. both macauley, returning from a broken finger, and <mark>barry cahill</mark> had been touted for possible starts - but instead the manager has confined himself to one defensive change from the team that laboured past wexford. cian o'sullivan is recalled for his first appearance of 2011 after a season blighted by hamstring trouble. the kilmacud player is named at corner-back, although there has been strong talk of a positional switch with regular no 6 ger brennan. gilroy has stuck with his leinster final midfield duo of denis bastick and eamon fennell while there's no place for <mark>cahill</mark>, contrary to suggestions that the versatile veteran was poised for a new role on the' 40'."}, {"articleID": "2018020710_00501921_W", "names": {"Jay Clayton": ["Q15441392", "Q1672427", "Q28122984", "Q57432267"]}, "date": "2018-02-06", "url": "http://rss.cnn.com/~r/rss/edition_world/~3/OimT7d-gS9g/index.html", "content": "Bitcoin's \"many problems' puzzle regulators by Nathaniel Meyersohn @ CNNMoneyInvest February 6, 2018: 12:00 PM ET What is an ICO? Bitcoin's extreme volatility has flustered lawmakers and regulators.\" There are many problems \"with the way bitcoin markets operate, testified Securities and Exchange Commission Chairman <mark>Jay Clayton</mark> at a Senate Banking Committee hearing on cryptocurrency oversight Tuesday. <mark>Clayton</mark> and Chris Giancarlo, chairman of the Commodity Futures Trading Commission, testified that tighter regulation and a more coordinated response between federal agencies were needed to protect investors from fraud and abuse in digital currency markets. Securities and commodities laws protecting investors don't neatly apply to new online currency trading. Regulators have trouble enforcing the laws, because it's not entirely clear what bitcoin is or does. Is bitcoin a currency? A security? Something entirely different?\" What's so challenging about bitcoin is that it has characteristics of multiple different things, \"Giancarlo said. Although <mark>Clayton</mark> said it was too soon to know whether Congress needed to enact laws targeting cryptocurrencies, he said,\" We may be back with our friends from Treasury and the Fed to ask for additional legislation. \"<mark>Clayton</mark> said investors raising money through initial coin offerings are similar to investors buying stocks. That makes bitcoin like a security, and it falls under SEC enforcement."}, {"articleID": "2019041111_00375640_W", "names": {"Gao Feng": ["Q16231274", "Q16908273", "Q24834646", "Q3095227", "Q45437663", "Q45512683", "Q45537138", "Q45537211", "Q45587330", "Q45682018", "Q45683278", "Q45702447", "Q711470", "Q8964143", "Q9447417"]}, "date": "2019-04-11", "url": "https://www.actionforex.com/live-comments/189463-us-mnuchin-on-china-trade-talks-both-sides-agreed-to-set-up-enforcement-offices/", "content": "Live Comments US Mnuchin on China trade talks: Both sides agreed to set up...Facebook Twitter Google + Pinterest WhatsApp Linkedin Email Print In a CNBC interview yesterday, US Treasury Secretary Steve Mnuchin talked about some concrete progress in US-China trade negotiations, including the core issue of enforcement. Mnuchin said: \"We've pretty much agreed on an enforcement mechanism. We've agreed that both sides will establish enforcement offices that will deal with the ongoing matters. This is something both sides are taking very seriously...We are really focused on the execution of the documents.\" Nevertheless he refused to put a timeline of the talks. \"We are hopeful we can do this quickly, but we are not going to set an arbitrary deadline,\" Mnuchin said. \"If we can complete this agreement, this will be the most significant changes to the economic relationship between the U.S. and China in really the last 40 years. The opening of the Chinese economy will be a tremendous opportunity with structural changes that will benefit U.S. workers and U.S. companies.\" - advertisement - <a href = \"https: //ads.actionforex.com/www/delivery/ck.php? n=a7dc4c0c' target =' _ blank'> <img src =\" https: //ads.actionforex.com/www/delivery/avw.php? zoneid=74 & n=a7dc4c0c' border =' 0' alt = \"/> </ a> Chinese commerce ministry confirmed today that senior trade negotiators from both countries held phone calls earlier this week. <mark>Gao Feng</mark>, the ministry's spokesman said\" in the next step, both trade teams will keep in close communication, and work at full speed via all sorts of effective channels to proceed with negotiations. \"Stay udpated with our FREE Forex Newsletters Download our Free Forex Ebook Collection RELATED ARTICLES MORE FROM AUTHOR Fundamental Analysis First Signs Of Stimulus Emerge In China Fundamental Analysis Investors Assess Important Macroeconomic Events Fundamental Analysis French And German CPI Data | Brexit Horror Continues | Fed Minutes Keeps Gold Above 1300 Fundamental Analysis Draghi Briefly Sinks Euro, Brexit Delayed Fundamental Analysis UK Gets Another Six Months To Agree On The Brexit Deal Central Bank Views FOMC Minutes--Pouring Cold Water on Doves who Expect Rate Cut This Year Market Overview Sterling Mildly Higher after Brexit Extension, Dollar Mixed after FOMC Minutes Live Comments FOMC minutes: Several members noted interest rate could shift in either direction Fundamental Analysis Fed Minutes Show Increasing Comfort with Patience LEAVE A REPLY Cancel reply Please enter your comment! Please enter your name here You have entered an incorrect email address! Please enter your email address here Save my name, email, and website in this browser for the next time I comment. I accept the Privacy Policy * This site uses Akismet to reduce spam. Learn how your comment data is processed. - advertisement - <a href =\" https: //ads.actionforex.com/www/delivery/ck.php? n=a7dc4c0c' target =' _ blank'> <img src = \"https: //ads.actionforex.com/www/delivery/avw.php? zoneid=74 & n=a7dc4c0c' border =' 0' alt =\" /> </ a> - advertisement - <a href = \"https: //ads.actionforex.com/www/delivery/ck.php? n=af1a6833' target =' _ blank'> <img src =\" https: //ads.actionforex.com/www/delivery/avw.php? zoneid=75 & n=af1a6833' border =' 0' alt = \"/> </ a>"}]