[{"date": "2014-12-12", "url": "http://westsussextoday.co.uk/report-into-south-downs-a-e-future-discussed-1-6469375", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. From the Back Pages, December 9: FA Cup draw: Arsenal vs Hull, AFC Wimbledon vs Liverpool and Manchester United to play Accrington or Yeovil From the Back Pages, December 12: <mark>Fernando Torres</mark> set to be offered up for FREE after Milan move to cancel Chelsea loan deal Sir <mark>Patrick Moore</mark> archive acquired by Science Museum From the Back Pages, December 8: Arsene Wenger targeted with foul-mouthed abuse at train station by furious Arsenal fans Report into South Downs A & E future discussed Health chiefs were quizzed last week over a controversial health contract award which could put South Downs A & E services at risk. Health bosses from both the Western Sussex Hospital Trust and Coastal West Sussex Clinical Commissioning Group (CCG), which awarded Bupa CSH Ltd a £ 235m musculoskeletal (MSK) contract, were before West Sussex County Council's Health and Social Care committee on Friday December 5. An independent impact assessment into the decision was jointly commissioned by the Trust and CCG after Western bosses went public with fears that its accident and emergency units at Chichester's St Richard's Hospital and Worthing Hospital could suffer as a result of the deal. Both are used by South Downs residents. One question asked by GP and committee vice chairman Dr <mark>James Walsh</mark> was why private procurement was chosen over public bidders. Marie Dodd, the CCG's chief operations officer, said legal advice made it clear there was \"no other option' but to offer the services out to tender. She said:\" The CCG (sought legal guidance) and reluctantly had to accept the advice that procurement was going to be the best vehicle, and the required vehicle for us to use in those circumstances. \"Dr Katie Armstrong, chief officer at the CCG, said a summary of the assessment would be made public once both bodies had studied it in full. The results will be shared with committee members ahead of HASC's next meeting on January 21, 2015. Committee's chairman, <mark>Margaret Evans</mark>, said:\" We will look very closely at the impact assessment's results as the MSK contract has been a matter of significant concern to the committee and to the public. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Springfield House Springfield Road Horsham clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. West Sussex Gazette provides news, events and sport features from the West Sussex area. For the best up to date information relating to West Sussex and the surrounding areas visit us at West Sussex Gazette regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2014121208_00029812_W", "names": {"Margaret Evans": ["Q25189513", "Q56597986", "Q6759386"], "Patrick Moore": ["Q1368317", "Q21462359", "Q268024", "Q28758394", "Q47906441", "Q56755948", "Q7147244"]}}, {"date": "2014-12-12", "url": "http://news.bbc.co.uk/news/world-asia-30445930", "content": "Some say Xi Jinping has won in Hong Kong. I doubt if that's how he sees it. As he watches pictures of traffic flowing through the heart of Admiralty today, he will certainly feel relieved that he didn't lose. But he is fighting a multi-level multi-player game. He has merely survived a level. This is not to say he didn't play adroitly. By leaving the protests to burn out amidst their own divisions and the weariness of the wider Hong Kong public, he deprived the umbrella movement of the oxygen of repression and demonstrated that Beijing's tool kit for dealing with citizen defiance runs beyond tanks or truncheons. What's more, he made no concessions. The lesson that Beijing does not bow to pressure was delivered not just to Hong Kong but to the world. But the only real victory Beijing can claim in the entire episode is not in Hong Kong but at home on the mainland where, barring a few brave souls who raised their voices on behalf of Hong Kong democracy, little stirred. The main thoroughfare in Admiralty is now open to traffic, with hardly any traces of the protest camp This is an important victory for the propaganda machine, which successfully presented the protesters as a mix of spoilt children narrowly pursuing their own interests at the expense of the public good, and cunning enemies of the state in league with foreign forces. \"Any person who cares about Hong Kong and about the people of Hong Kong should say\" NO' to this hijacking of the general public will for personal objectives, \"said the Communist Party flagship newspaper, the People's Daily. Champions of democracy everywhere take note - the aspirations of the young protesters of Hong Kong did not immediately resonate with their counterparts on the mainland. Despite being beneficiaries of globalisation and despite having ever greater contact with the West through university education and holidays abroad, many young Chinese are suspicious of idealistic political messages. Since childhood, they have been exposed to a historical narrative which dwells on China's humiliation at the hands of foreigners. Many now echo their government's suspicion of street protests, social chaos and foreign ideas peddled by people whose hidden agenda may be to divide China and keep it down. According to China's best known military theorist, Sun Tzu (writing two-and-a-half thousand years ago), the best kind of victory is won without fighting. Seeing the mainland stable throughout two-and-a-half months of street protest in Hong Kong is just such a victory. But provoking thousands of citizens onto the streets in the first place is, by the same token, no kind of victory at all. Beijing brought the umbrella movement on itself. Protesters have vowed to continue with their campaign With its white paper in June and electoral arrangements in August, it made clear that it would not only draw up a narrower political board game in Hong Kong but control the pieces too. Hong Kong citizens were already resentful of the scale of mainland tourism and immigration, and the young alienated by a growing list of frustrations including impossible property prices. In this combustible mix, Beijing's announcements were the proverbial sparks that lit the prairie fire. Sun Tzu would have called this self-inflicted injury. The electoral arrangements were intended to avoid future challenges from an elected Hong Kong leader. But instead they provoked a very present challenge from at least 100,000 citizens. For a government which likes to reinforce the impression that it is in charge of not just the staging but the script, Hong Kong was an uncomfortable discovery that the props can get up and misbehave. Ever since Chairman Mao's ideological experiments resulted in the deaths of countless millions in the 1950s and 1960s, China's Communist leaders have insisted that they believe in\" seeking truth from facts \". The sobering fact in relation to the Umbrella Movement is that a generation of young people in Hong Kong is increasingly politicised and alienated from China. With their demand for democratic rights, the members of the umbrella movement effectively rebranded themselves\" not China \". Alex Chow (L) and <mark>Joshua Wong</mark> (R) are two prominent Hong Kong student leaders who have led the protests The same is true in Taiwan. Despite all of Beijing's efforts to coax the island towards reunification, the message from recent local elections as well as from the Sunflower Movement in the spring is that the Taiwanese public and especially its young people, are moving in the opposite direction. Far from assimilating easily to an increasingly wealthy China, Hong Kong and Taiwan are growing more defiant. And adding to the list of troublesome peripheries whose citizens can't be trusted to behave like true Chinese patriots, let's not forget Xinjiang. So while Xi Jinping will go on talking up his China Dream and urging the young people of China to unite behind it, he must have realised by now that his message is struggling with key audiences. Hong Kong has seen a generation of young people devote energy, passion and sacrifice into a competing dream. These are people he needs on his side. Xi Jinping may not have lost in Hong Kong, but he needs to do much, much more if he is going to win. For weeks there was a life-size cardboard cut-out of President Xi amid the tent city of the Umbrella Movement, holding aloft the obligatory yellow umbrella. It's a shame he didn't visit. 2 Minutes ago Do the Chinese close down their comment sections at six. Unless they are in advertising territory of course?\" If he (Xi) starts trying to assimilate Hong Kong into his Chinese Dream then I can imagine an even larger protest emerging \"--That should have him quaking! Hit China financially and things could change. But too many vested interests around the world will not allow that to happen. While whitey is getting rich, nothing will change...it's the way of the world. China will do what China wants, Russia will do what Russia wants, Israel will do what Israel wants. The rest of the world will keep huffing and puffing yes, democracy...based on campaign funds, advertising, propaganda, media access, cover-ups, historical omissions, compromise, social upbringing, vested interest, xenophobia, jingoism, idealism etc.. Hitler, Abe, Bush & Blair were democratically elected. Turks & Japanese still deny their crimes against humanity. Hong Kong activists without financial commitments will learn realpolitik soon enough. Those business leaders in the west who put short term profits before people will breath a sigh of relief .\" You cannot keep a people down indefinitely. \"Of all people it was Margaret Thatcher who said that! Jihad money How extremists fund their fight through crime NHS Winter 2014 See how your nearest A & E unit is coping with winter pressures 7 days quiz Why did someone say nasty things about Angelina Jolie? 5: The female football mania that led to it being banned 1: Flights disrupted after computer failure at UK control centre 2: Live: UK Flight delays after computer failure 3: Farage and Brand trade post Question Time insults 5: Man faces deportation as UK wife's salary too low 6: Pensioner bonds to offer returns of 2.8% and 4% 7: Parents angered by\" awful' Frozen party in Kilgetty", "articleID": "2014121218_00058086_W", "names": {"Joshua Wong": ["Q12688635", "Q56320576", "Q9455382"]}}, {"date": "2014-12-14", "url": "http://wzzm13.com/story/news/2014/12/13/scott-flahive-memorial/20376479", "content": "Officer Flahive remembered in Grand Haven MORE GRAND HAVEN, Mich. (WZZM) - Hundreds gathered at the Grand Haven Eagles building Saturday to remember slain public safety officer Scott Flahive on the 20th anniversary of his death. \"We're still very emotional about it,\" said Margery Flahive, Scott's aunt. Officer Flahive was killed the night of Dec. 13, 1994 when he pulled over two escaped inmates on Beacon Boulevard. While approaching the vehicle, Flahive was shot and killed instantly. \"Even though I didn't know him personally, I feel like I did know him,\" said Sergeant <mark>Lee Adams</mark>, Grand Haven Department of Public Safety. \"Just through all the stories. When I went through the academy, he was the first officer I ever learned about .\" <mark>Adams</mark> said Flahive was the first officer in Ottawa County to be shot and killed while on service. A memorial fund has been set up in Flahive's name to pay for a marker that will one day line the entrance of the public safety building. To donate to the fund, email", "articleID": "2014121406_00031147_W", "names": {"Lee Adams": ["Q6512930", "Q6512934"]}}, {"date": "2014-12-16", "url": "http://forums.floridasportsman.com/showthread.php?177580-Anyone-have-Snopes-on-speed-dial&goto=newpost", "content": "Members who have not reregistered since June, 2011 will need to. REREGISTER. Sorry for the inconvenience. Also, due to the high number of spammers/Robots attempting to access the site memberships are approved manually several times a day, so you may experience a delay between the time you registered and are approved and can use all of the forum functions. If this is your first visit, be sure to check out the Bin Laden Shooter Rob <mark>O'Neill</mark> Mistakenly Attacked By Street Thugs Seeking To Collect Debt From Neighbor <mark>Robert O'Neill</mark>, the former United States Navy SEAL who shot and killed Osama Bin Laden, had his home mistakenly invaded by members of a street gang this morning shortly after 1AM. <mark>O'Neill</mark> was uninjured, the five intruders all suffered injuries and remain hospitalized, but are expected to make a full recovery. Their names were not released in anticipation of the oncoming media storm. Butte Police Commissioner Bartholomew S. Harrington told members of the Associated Press in a brief press conference that the five men, part of a local street gang connected with the infamous Crips, were seeking to collect on a drug debt and invaded the wrong house, with the intended target just so happening to be the next door neighbor of <mark>O'Neill</mark>'s. \"Mr. <mark>O'Neill</mark> had just turned in for the night, but was awoken by a loud crash when his backdoor was abruptly kicked in. As the five thugs ran aimlessly through the home, Mr. <mark>O'Neill</mark> used silent hand-to-hand combat tactics to individually disarm them of their weapons. Once Mr. <mark>O'Neill</mark> had taken down the five men and secured his home, he brewed a pot of coffee and called the police station. Those boys sure did find the wrong house!\" commissioner Harrington said as he chuckled. <mark>O'Neill</mark> had little to say on the matter when Butte Daily Times journalist <mark>Kevin Williamson</mark> interviewed the celebrated war hero. \"It was nothing really. Those kids didn't have their mission planned out properly and hit the wrong target. I hated to break their wrists and dislocate each of their knees like I did, but it was necessary in order to immobilize the invasion. I hope they get the money that is owed to them once they get out of jail and decide to live better lives. My main concern is getting my back door fixed. Those boys really did a number on the door jamb,\" <mark>O'Neill</mark> stated. The neighbor who was the intended target seems to have abandoned home and has not been found by police. According to the men in custody, the debt was over a $50 bag of marijuana. Location Ft Myers Posts 726 You may not post new threads You may not post replies You may not post attachments You may not edit your posts All times are GMT -4. The time now is 08:12 PM", "articleID": "2014121700_00011410_W", "names": {"Kevin Williamson": ["Q16191505", "Q16566420", "Q360642"], "Robert O'Neill": ["Q18510195", "Q57892227"]}}, {"date": "2014-12-19", "url": "http://forums.sherdog.com/forums/f2/rogan-classics-youre-dealing-whole-new-species-human-2891063/", "content": "Rogan Classics: \"You're dealing with a whole new species of human .\" @ 1:15, he's talking about Royce Gracie, essentially he's saying if Royce had to face a modern UFC fighter such as Rumble <mark>Johnson</mark> (who has strong TDD and can KO people) it would be like facing \"a whole new species of human\" i. e, a super human. Another day, another Rogan classic! Well, he is kinda right but not because of human evolution. More like sport evolution, training and weight cutting. Royce could have been a lw, easily. Imagine him training lots of stand up and wresslin at aka, att or jacksons...he would have been way better as well. __________________ Always remembering Evan Tanner and Jeremy Lusk Location: Moscow Posts: 5,638 vCash: 500 LOL He's been hanging around Goldie too much I think! Location: We are all one Posts: 1,475 Join Date: Mar 2011 Posts: 7,540 vCash: 50 Location: Montevideo, Uruguay Posts: 6,574 C'mon it's not like he isn't like this all the time, he wants to put emphasis on being a combination of scientific and mystic to kind of make it fantastic. Also <mark>Anthony Johnson</mark> got beat by Vitor, who's been fighting since UFC 12. __________________ Jose Aldo #1P4P Finishtime Pettis LOLer 1,4,5 Ronda Rousey Clithanger Jojo Wallace, Polish Jedi The Incredulous Cormier C'mon it's not like he isn't like this all the time, he wants to put emphasis on being a combination of scientific and mystic to kind of make it fantastic. Also <mark>Anthony Johnson</mark> got beat by Vitor, who's been fighting since UFC 12. Location: Sydney Posts: 1,865 vCash: 500 You may not post new threads You may not post replies You may not", "articleID": "2014121901_00029944_W", "names": {"Anthony Johnson": ["Q24005923", "Q24702926", "Q2556925", "Q4772838", "Q4772840", "Q4772841", "Q573440", "Q576548"]}}, {"date": "2014-12-19", "url": "http://independent.co.uk/life-style/food-and-drink/news/christmas-dinner-you-think-youll-consume-2000-calories-but-in-reality-its-closer-to-6000-9937146.html", "content": "Despite the mounds of mince pies, armfuls of chocolate boxes, and stacks of yule logs which fly off the shelves in December, Brits still believe they eat half as much on Christmas Day as they really do. Most people estimate that they consume around 2,600 calories on Christmas Day, but in reality the figure is closer to 6,000. That is the equivalent of 12 Big Macs, and three times the daily recommended amount of calories for a woman, and just under 2 and a half more than a man's. A survey of 2,000 UK adults also showed that 46 per cent us don't consider the amount we eat on Christmas Day, or any other day of the year. It also revealed that half of us are ditching the traditional Christmas turkey meal on 25 December. London pub's offer to feed the homeless Christmas dinner goes viral Despite dessert being a big part of the meal, the poll showed that only 29 per cent of those aged between 18 and 24 will eat Christmas pudding, compared to 61 per cent of those aged 55 years old and over which, indicates the reign of the fruit-filled desert may soon be over. Unsurprisingly, alcoholic tipples also play a major part in the season's festivities. A third of Brits plan to guzzle red or white wine this year, a quarter will celebrate with sparkling wine, and a fifth will opt for beer or lager. Dr Annie Gray, a food historian who conducted the research with AB sugar, said: \"Our food, drink and even lifestyle habits have really changed over the years .\" Back in WWI and WWII even the most manual of tasks could sometimes involve hard labour so we were certainly more active and, in fact, we were our healthiest as a nation at the end of WWII. \"cricket Eoin Morgan reportedly to take over ODI captaincy <mark>Stephen Ward</mark> trial was disgraceful. There can be no justification for it A Clockwork Orange (1971) Adapted from Anthony Burgess's best-selling novel, A Clockwork Orange tells the story of Alex and his gang of violent\" droogs' who kill tramps and rape women. Plus-sized woman asks Photoshop experts over the world to \"fix her'...Liverpool host Arsenal as Reds look to cling on to fading top-four hopes football Premier League preview: All the talking points ahead of this weekend's clashes A tale of two cities: sex and sensibility, from Givenchy, Celine and Stella McCartney <mark>Alexander McQueen</mark> at auction: What makes a really great piece of fashion? A bottle of wine a day is not bad for you and abstaining is worse than drinking, scientist claims No female ejaculation, please, we're British: a history of porn and censorship Stressed nurses are\" forced to choose between health of patients and their own' Pornhub: Kim Kardashian's sex tape is the most-watched porn video of all-time Nigel Farage: Me vs Russell Brand on Question Time - he's got the chest hair but where are his ideas? Harry Potter fans can apply to the Hogwarts-inspired College of Wizardry Jessica Chambers: 19-year-old woman \"doused with lighter fluid and burned alive' in the US Investigo: Finance Analyst £ 240 - £ 275 per day: Investigo: Support the global business through in-depth a.. . Negotiable: Ashdown Group: Data Manager - MySQL, Shell Scripts, Java, VB Scrip...Ashdown Group: Application Support Analyst - Bedfordshire/Cambs border - £ 32k £ 27000 - £ 32000 per annum: Ashdown Group: Application Support Analyst - near S.. . In 2010, Sgt Gary Jamieson stepped on an IED in Afghanistan and lost his legs and an arm. He reveals what, and who, helped him to make a remarkable recovery As a film following six patients receiving the controversial treatment is released, Kate Hilpern uncovers a very slippery issue You can't see Seth Rogen and James Franco's <mark>Kim Jong Un</mark> assassination film, but you can read about it here People have consumed gripping armchair investigation Serial with a relish typically reserved for box-set binges <mark>Kevin Lee</mark> Light, aka\" Jesus \", is the newest client of creative agency Mother while rival agency Anomaly has launched Sexy Jesus, depicting the Messiah in a series of Athena-style poses The most important scientific breakthroughs of 2014 Mulled wine is an essential seasonal treat. But now drinkers are rediscovering other traditional festive tipples. Angela Clutton raises a glass to Christmas cocktails Up the ante in your regimen and change the habits of a lifetime with this wearable tech It's a little-known fact, but I have played one of the seven dwarves Fifa's travelling circus once again steals limelight from real stars Club World Cup kicked into the long grass by the continued farce surrounding Blatter, Garcia, Russia and Qatar 2014 proves it's now one of sport's biggest hitters again Karen Tumulty explores the power dynamics of the two first families The Swedish capital is home to two of the most popular video games in the world, as well as thousands of technology start-ups worth hundreds of millions of pounds - and it's all happened since 2009 The story goes that Japanese store workers created a life-size effigy of a smiling\" Father Kurisumasu \"attached to a facsimile of Our Lord's final instrument of torture", "articleID": "2014121921_00018884_W", "names": {"Alexander Mcqueen": ["Q207939", "Q21014274"], "Kevin Lee": ["Q16905308", "Q18157401", "Q18763537", "Q28800491", "Q28971672", "Q30073058", "Q57573668"], "Kim Jong Un": ["Q14045951", "Q56226"]}}]