[{"articleID": "2016051707_00663517_W", "names": {"Joshua Wong": ["Q12688635", "Q56320576", "Q9455382"]}, "date": "2016-05-17", "url": "http://skynews.com.au/news/world/asiapacific/2016/05/17/top-chinese-official-to-hear-hk-demands.html", "content": "A top-ranked Chinese official has begun a rare visit to Hong Kong vowing to listen to residents' political concerns, seeking to address increasingly strident calls in the city for greater autonomy or even independence from the mainland. The visit by Zhang Dejiang, the first by a senior Chinese figure since the 2014 Occupy democracy protests, was officially to attend an economic summit. However, his first comments addressed the hot button political issue of Hong Kong's relationship with China, a topic that has sparked fierce debate in the Asian financial hub. \"(I will listen to) all sectors of society's suggestions and demands on how...the country and Hong Kong should develop,\" Zhang told reporters at Hong Kong airport on Tuesday. Following the unsuccessful Occupy protests of 2014, a handful of activists have been calling for an outright breakaway from China, a move some say would imperil Hong Kong's economic and political future. \"These young people have no idea that they could be putting Hong Kong on a potentially dangerous collision course with the motherland and bringing an unmitigated disaster,\" wrote former top Hong Kong security official Regina Ip in a recent editorial in the state-run China Daily. Tensions in the city are high, with thousands police mobilised for Zhang's visit. Local media reported pavement bricks were being glued down to quell the prospect of violent protests while police were camping atop a mountain where a pro-democracy banner was hung two years ago. A banner demanding \"true universal suffrage\" was hung on a different mountaintop on Tuesday morning. \"(We) are facing a very great threat from China: Our culture, our language, our people...we are dying!\" Chan Ho-tin, the head of the newly-formed National party, told Reuters. \"Do (Hong Kong people) want to be a Chinese city or do they want to be an independent country? There are only two choices,\" said Chan, whose party is expected to contest legislative elections in September. <mark>Joshua Wong</mark>, another prominent young activist who launched a new political party called Demosisto this year, wouldn't rule out taking an independence line in upcoming campaigns. \"The problem with young people is that they are not 100 per cent preoccupied with economic considerations,\" said Michael Tien, a Hong Kong delegate to China's parliament, the National People's Congress, which Zhang heads. \"A lot of young people saying they don't want development, they want a better environment, they want better work-life balance, they want better quality of life .\" Authorities haven't ruled out taking action against pro-independence activists. \"Any suggestion that (Hong Kong) should be independent or any movement to advocate such independence...would be inconsistent with the legal status of Hong Kong,\" the Department of Justice told Reuters. The DOJ said it was watching for \"possible criminal activities\" and would \"closely monitor the situation, maintain close liaison with the relevant law enforcement agencies, and take such action as may be necessary\". Hong Kong authorities said the \"counter-terrorism security measures\" were needed to ensure the safety of dignitaries during the visit. Observers with close ties to Chinese officials say one of Zhang's priorities will be establishing relations with more moderate democrats to lower the heat. Reuters"}, {"articleID": "2014100103_00021582_W", "names": {"Christopher Nolan": ["Q224912", "Q25191"], "Julia Gillard": ["Q41563", "Q59400153"]}, "date": "2014-10-01", "url": "http://brisbanetimes.com.au/entertainment/music/guess-which-downton-abbey-star-has-her-own-folkrock-band-20141001-10oe9b.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Downton Abbey) has her own band, Sadie and the Hotheads. \"itemprop =\" image \"/> Elizabeth McGovern (Cora, the Countess of Grantham in hit TV series Downton Abbey) has her own band, Sadie and the Hotheads. Downton Abbey star Elizabeth McGovern, who plays the demur Cora, Countess of Grantham in the show, is set to embark on her first US tour with her band Sadie and the Hotheads. The US actress and her bandmates formed the folk-rock group in 2007 and toured Europe earlier this year as the opening act for Mike and the Mechanics. Now McGovern is ready to head home and face American audiences .\" I think it's coming at the right time since we slowly built experience with each other, \"says McGovern, who is the lead singer and focus of most of the band's publicity and video clips. Downton Abbey has her own folk rock band, Sadie and the Hotheads .\" itemprop = \"image\" /> Elizabeth McGovern (centre), who plays the demur Cora, Countess of Grantham in Downton Abbey has her own folk rock band, Sadie and the Hotheads. \"I feel like we're more ready than we've ever been...I go there with more confidence than I would have in the past .\" Advertisement Sadie and the Hotheads have their own YouTube channel with just 500 subscribers and 61 videos, some of which are perhaps a tad awkward. The most popular track, for instance, is The Cow Song, (which has over 110,000 views) includes the lyrics: \"It's nice to watch the way they chew / I'm glad you brought me here with you / Hanging on to the gate while it swings / Gives me a chance to think about things\". Then there's a cover of the Bee Gees' classic Stayin' Alive. Sadie and the Hotheads set out on a 10-city tour beginning in Washington, USA, on December 4. \"It's a slightly funny experience for fans of the show to come hear the music because it's such a different world to the show (Downton Abbey) itself,\" McGovern says. \"When we first started touring there would be a lot of people carrying Downtown Abbey books...and I could see a look of surprise on their faces because it isn't what you expect. I mean it's not a classical quartet of violins .\" Error: Please enter your screen name. Error: Your Screen Name must be less than 255 characters. Error: Your Location must be less than 255 characters. I understand that submission of this content is covered by the You need to have read and accepted the Conditions of Use. <mark>Christopher Nolan</mark>'s Interstellar movie trailer finally answers some questions <mark>Julia Gillard</mark>'s memoir treads a careful path through her time in power"}, {"articleID": "2017042717_00770243_W", "names": {"Jon Favreau": ["Q295964", "Q581607"]}, "date": "2017-04-27", "url": "http://www.readingeagle.com/ap/article/in-vr-land-rush-creators-unlock-an-empathy-engine", "content": "AP The Associated Press | This image released by the Tribeca Film Festival shows a scene from the VR film, \"The Last Goodbye,\" being shown at the Tribeca Film Festival in New York. A number of high-profile projects unveiled at the Tribeca Film Festival show the young medium pushing forward to unlock VR's power to create empathy, whether it's a Holocaust survivor or a crow voiced by John Legend. (Tribeca Film festival via AP) The Associated Press | This image released by the Tribeca Film Festival shows a scene from the VR film, \"The Last Goodbye,\" being shown at the Tribeca Film Festival in New York. A number of high-profile projects unveiled at the Tribeca Film Festival show the young medium pushing forward to unlock VR's power to create empathy, whether it's a Holocaust survivor or a crow voiced by John Legend. (Tribeca Film festival via AP) The Associated Press | FILE - This Thursday, April 20, 2017 file photo provided by Strategy PR shows director Kathryn Bigelow at the Tribeca Film Festival Virtual Arcade in New York. A number of high-profile projects unveiled at the Tribeca Film Festival show the young medium pushing forward to unlock VR's power to create empathy, whether it's a Holocaust survivor or a crow voiced by John Legend. (Kathryn Bigelow/Strategy PR via AP) In VR land rush, creators unlock an 'em pathy engine' Thursday April 27, 2017 01:47 PM By JAKE COYLE, AP Film Writer NEW YORK (AP)--On a plain, overcast day in Poland, Holocaust survivor Pinchas Gutter walks toward the Nazi concentration camp Majdanek. He stands in the railway car that delivered him and his family to the camp. He walks to the gas chamber and the showers. Some rooms he can't bear to go in. He shares his recollections and tries to remember what he can of his family. All he can really visualize of his sister is the fleeting image of her golden braid of her hair. Walking with Gutter in Majdanek is an undeniably powerful way to make the Holocaust tangible, and to see it through a survivor's eyes. Now, being Gutter's companion as he revisits his painful past is an experience anyone can have just by putting on a headset. The virtual reality piece \"The Last Goodbye,\" made from 3-D video and thousands of photographs at Majdanek, is being billed as the first Holocaust survivor testimony in room-scale VR. It premiered at the Tribeca Film Festival, where the medium's growing ambitions have been on display over the past week. What \"The Last Goodbye\" and other works show is that virtual reality, while still very much in its early days, has a potent ability to foster empathy. In transporting you to an intimate space with someone, it gives that old expression, \"walk in my shoes,\" a new, high-tech, physical dimension. That's literally the concept behind Katheryn Bigelow and Imraan Ismail's \"The Protectors: Walk in the Ranger's Shoes,\" an 8-minute, 360-degree visit with the Garamba National Park rangers. They defend the Democratic Republic of the Congo park from waves of poachers. Ismail, whose earlier, award-winning VR experience, \"The Displaced,\" followed three child refugees, says of virtual reality: \"It enables empathy because it enables a kind of presence in someone else's space. And breaking through apathy .\" \"For me, it's exactly that. It's empathy,\" says Bigelow. \"Here are these individuals who put their lives on the line in order to thwart the problem. Sometimes they pay the ultimate price. In order to be able to help, you have to be very well informed .\" Big names filmmakers and actors are increasingly experimenting in VR, a fast-growing new media landscape that the investment bank Citi last fall forecast will be a trillion-dollar industry by the year 2035. <mark>Jon Favreau</mark> (\"Iron Man\" ) and Justin Lin (\"Fast & Furious\" ) have tried their hand in it, and in May, \"Birdman\" director Alejandro Inarritu will premiere a virtual reality project at the Cannes Film Festival. He has called it an effort to \"allow the visitor to go through a direct experience walking in the immigrants' feet, under their skin, and into their hearts .\" Jennifer Brea turned to VR for an accompanying experience to her Sundance entry film, \"Unrest,\" about her battle with chronic fatigue syndrome. In the VR experience, the viewer feels what it's like to be bedridden in her room. Brea calls virtual reality \"an engine of empathy .\" A sense of growth was palpable at Tribeca, which increased the size of its VR arcade this year. Loren Hammonds, a film and experiential programmer at Tribeca, sees a rapidly progressing medium where artists are continually reexamining their notions of how to orient the viewer. \"The rules are being broken,\" says Hammonds. \"There are constantly these sets of rules that keep being presented to creators: you can't move the camera or you can't cut. And the minute someone breaks it and it works, well, no more rule .\" Creators, many eyeing the neighboring booths in the Tribeca arcade, acknowledge there's a competitive atmosphere in VR that can feel like a land rush. Technology is one race, and all agree virtual reality is going to get exponentially smoother and crisper. \"The Last Goodbye\" has been \"future-proofed,\" meaning that more detailed photography and video has been set aside for when the tech catches up, says Patrick Milling Smith, chief executive of VR production company Here Be Dragons. But storytelling is a race of its own in VR, a medium many call a combination of cinema and gaming. Should the viewer have agency to move and shape their experience? If so, to what degree? How do you guide them? For inspiration, Baobab Studios co-founder Eric Darnell, an animation veteran who co-directed the \"Madagascar\" films, has studied how magicians manipulate the eyes of their audiences. Baobab's first VR work, \"Invasion!\" supplied the viewer a partner--a little white bunny--for an alien arrival. \"Now everyone is doing that,\" says Maureen Fan, chief executive of Baobab. \"But a lot of people debated us on that. We felt that as a user, why are you there if you're a fly (on the wall) verses if you're a bunny? If you have a role to play, how much more do you feel for that character and feel immersed in that world?\" At Tribeca, Baobab premiered the first chapter of an ambitious 10-part series, \"Rainbow Crow,\" in which John Legend voices a mythical, sonorous bird forever changed by a cosmic adventure. \"It's about love. It's about inclusion. It's about community,\" says Legend. The creators of the choose-your-own-adventure, live-action \"Broken Night\" wanted to take go further. In it, Emily Mortimer plays a woman with a hazy memory recounting a violent encounter with an intruder in her home. At various points in the story, viewers are given a choice to follow different paths in the story, which they select by looking to one side of the action or the other. \"The problem with live-action VR today is it's not interactive,\" says co-director Tal Zubalsky. \"Kind of the whole promise of VR is to get you to a different place. But if you get there only as an observer and not as a participant, then you're not really there .\" ___"}, {"articleID": "2014011901_00060872_W", "names": {"Bill Mccarthy": ["Q16239096", "Q2579916"]}, "date": "2014-01-18", "url": "http://www.thenewstribune.com/2014/01/18/3000054/vikings-metrodome-deflates-for.html#storylink=rss", "content": "Killer offers no words, as victim's family remembers South Hill teen MINNEAPOLIS - The Minnesota Vikings' Metrodome has deflated for the last time. Officials from the Minnesota Sports Facilities Authority opened the relief vents to begin the deflation at 7:15 a.m. Saturday. Fans providing the air that supports the roof were turned off. It was done in 35 minutes. The Minnesota Sports Facilities Authority gave the go-ahead despite concerns about weather conditions. According to the National Weather Service, between 4 and 5 inches of snow fell in the area overnight. Wind was a steady 5 to 10 mph Saturday morning. The deflation will make way for construction of a new $1 billion Vikings stadium. It will be located roughly where the Dome stands in downtown Minneapolis. MSFA Vice Chairman <mark>Bill McCarthy</mark> called it \"a sad and exciting day at the same time .\" > Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}, {"articleID": "2010020508_00039466_W", "names": {"Sean Young": ["Q23020954", "Q230736"], "David Greene": ["Q21095515", "Q28421802", "Q5234366", "Q5234367"], "Sean Jones": ["Q16223695", "Q7441105", "Q7441106", "Q7441107", "Q7441108"], "George Edwards": ["Q16198305", "Q5538733", "Q5538898", "Q5538902", "Q5538904", "Q5538907", "Q58331750"]}, "date": "2010-02-05", "url": "http://teamspeedkills.com/2010/2/5/1296442/sprints-wonders-if-a-meme-is-a", "content": "more photos \"butch dill - ap well-known media naysayer mark richt. another person echoes mainstream media meme about georgia's defensive coordinator search why can't these anti-georgia commentators stop talking about how the hiring process hurt the dawgs? the latest is...mark richt?\" recruiting is a lot about relationships, \"richt said .\" anytime there is some kind of change on your staff for whatever reason, the relationships that had been built throughout this recruiting process were broken. i think the timing of the hire, taking as long as it did, it did put a strain on some of these <mark>young</mark> men who had committed. we know some guys changed their mind. \"that's obviously different. just because. so says weiszer .\" i would say our recruiting class is a lot like our year this year. we didn't have the kind of year that i wanted to have, but we still did a lot of good things. we won eight games. that's not good, but...i'm not going to try to paint a picture that's any different than what it is...we definitely lost some good players. \"those words could have been uttered by georgia coach mark richt yesterday on national signing day as georgia's run of signing top 10 rated recruiting classes ended after eight straight seasons. they actually were spoken by jim donnan on georgia's signing day in 2000 when donnan lost some in-state recruits to georgia tech and top linemen <mark>sean young</mark> to tennessee ....who did donnan sign that year? guys like <mark>david greene</mark>, <mark>sean jones</mark>, musa smith, johnathan sullivan and will thompson, who all were starters on georgia's 2002 sec championship team. seriously, dan mullen is boasting about this .\" over the last two years, since we've been here, we've signed twice as many players than southern miss from the state of mississippi and three times than the school up north from the state of mississippi, \"mullen said. leaving aside how little sense it makes to say\" than the school up north \"followed by\" from the state of mississippi \"when\" the school up north \"is called mississippi, out-recruiting a conference usa team is kind of expected when you're in the sec, right? this is progress for tennessee. other news tee martin headed to kentucky this would be sort of like a michigan star coaching for michigan state, i suppose. sprints wonders if a meme is a meme if your coach repeats it / / 02.05.10 florida dc <mark>george edwards</mark> is buffalo bound, espn can't use wikipedia national signing day in the sec: the king is on a leave of absence! long live the king! sprints is committed to allowing you to comment on national signing day / / 02.03.10"}, {"articleID": "2018082315_00142621_W", "names": {"Christopher Parker": ["Q19325302", "Q5113026", "Q56000137"]}, "date": "2018-08-23", "url": "http://www.azcentral.com/story/news/local/arizona-education/2018/08/23/arizona-junior-college-football-end-after-2018-season/963334002/", "content": "Is Arizona junior college football dead after this season? Anne Ryman Arizona Republic Published 12:00 p.m. UTC Aug 23, 2018 Head football coach Ryan Felker puts his arm around defensive back Gerald Wilbon (30) during practice at Mesa Community College on Aug. 16, 2018. Patrick Breen/The Republic Gerald Wilbon won a football scholarship from Southern Utah University for 2018. But what appeared to be the fulfillment of a long-standing dream to play Division 1 college football turned to disappointment when the 18-year-old cornerback's grades weren't good enough to enroll. He gets a second shot at his dream this fall with a football scholarship to Mesa Community College, where he hopes to improve in the classroom, work on his game and eventually earn a scholarship to a four-year school. \"Without this, I don't know what I'd be doing right now,\" the Red Mountain High School graduate said at a recent team practice. But for Wilbon and about 400 other athletes, this opportunity to play football while furthering their education likely ends with the 2018 season. The Maricopa County Community College District, the state's largest community-college system, is pulling the plug on the sport for financial reasons. District officials say the colleges need to prioritize their spending as enrollment has leveled off and the Arizona Legislature has eliminated state funding. A district task force also raised concerns about injuries and football's low academic performance compared with other sports. The announcement earlier this year sent shock waves across the district, where four colleges--Glendale, Phoenix, Scottsdale and Mesa--have fielded football teams for decades. Football supporters in other Arizona communities fear that decision will have a domino effect. Pima Community College officials said Maricopa's decision \"accelerated\" an already-planned financial review of athletics. They announced in June that the Tucson school would also end football after 2018 as part of a three-year plan to cut college-wide spending by $15 million. The departure of Pima and Maricopa will leave two junior college football teams in Arizona and three in the Western States Football League: Eastern Arizona College in Thatcher, Arizona Western College in Yuma and Snow College in central Utah. Without Pima and the Maricopa schools, Eastern and Western will have to travel farther to compete. In June, Eastern announced plans for a \"careful review\" of football to see if a schedule is viable and if the sport can operate within budget beyond 2018. The move to eliminate JUCO football in Arizona comes as the sport, in general, is under increased scrutiny as more studies show links between football and brain problems. Already, participation is down among high-school students nationally and in Arizona--partly because of concerns over injuries, athletic officials said. \"It's an educational institution' Risk and cost aside, Maricopa football is not going down without a fight. A grassroots group is pushing to save the sport, including a Twitter campaign with the hashtag #savejcfootball. They are also pushing to shift the balance of power on the college district's governing board, hoping to elect four candidates sympathetic to football in the Nov. 6 election. Attorneys filed a complaint in early August with the U.S. Department of Education's Office for Civil Rights on behalf of 22 Maricopa players, alleging cutting football violates federal law because it adversely affects African-American students, who make up 62 percent of the rosters. The department is evaluating the complaint but hasn't said yet whether it will investigate. RELATED: Maricopa Community Colleges to eliminate football Football supporters say college officials used false or misleading statements to justify killing the program. They aren't buying the argument that the sport was eliminated for financial reasons, not when cutting football is estimated to save $989,000 a year and the college district projects $682 million in general-fund revenue this year, or about $11 million more than last year .\" They're trying to turn this into a business. It's not a business. It's an educational institution, \"said Louis Casillas, a retired dentist who played football at Mesa Community College and is advocating to save the program. Maria Harper-Marinick, chancellor of Maricopa Community Colleges. Maricopa Community Colleges In response to questions from The Arizona Republic, the district released a one-paragraph statement saying the decision to eliminate football was an operational decision made by district administrators after consulting with college presidents .\" We will support our players, coaches and staff through this final season, and we will honor the scholarships of our players through the Spring 2019 semester, \"the statement said. A district spokesman said Maricopa Chancellor Maria Harper-Marinick was busy with the start of the fall semester and unavailable for an interview. Governing Board President Laurin Hendrix told The Republic he supports the administration's decision and has not heard any opposition from board members .\" Our mission as a community college is to educate people. It's not to train football players, \"he said .\" If they play football while they are getting an education, that's great. But our mission is to educate. \"Last Chance U? Temperatures hovered in the triple digits at Mesa Community College on a recent Monday night as players practiced drills on a grassy field. Hip-hop music blasted from speakers. Shrill whistles pierced the air along with shouts of\" Go get 'em \"and\" Move! \"JUCO teams bring together a mix of backgrounds: players not big enough, fast enough, strong enough or mature enough for Division 1. Some who have struggled in the classroom. And others who have attended big schools but\" bounced back \"to JUCO because their grades or athletic abilities need work. JUCO football doesn't draw the revenue, attention or prestige of Division 1 college football. But it's a key pipeline for athletes who want to play football at major universities. About 65 to 70 percent of the Maricopa players are from Arizona, the rest from out of state. RELATED: Pima College in Tucson to drop football program Thanks to the popularity of the Netflix documentary\" Last Chance U, \"it's fair to say more people than ever before understand what the acronym\" JUCO \"means .\" It just opens so many doors for people, \"said Joe Kersting, a former head football coach at Glendale Community College, who is leading the fight to save the sport. Former Glendale player Kevin Cary, 48, credits JUCO football with opening doors for him. He grew up in a single-parent household in Maryvale, one of 10 children. By the time he was born, his mother had lost the family's home. She and the four children still living with her moved into a mobile home. A natural athlete, Cary played football at Trevor Browne High School, where he was recruited by many out-of-state junior colleges. But the partial scholarships they offered weren't enough to cover costs. Cary and his mother decided he would live at home and attend Glendale Community College on a football scholarship. The team won the national championship in 1988, his sophomore year. In January of his sophomore year, Temple University recruited him on a full scholarship .\" My mom used to say to me, \"Use football to get your education. Your football will end. You have to have something to live on .'\" Cary followed her advice. He majored in health marketing and management and today works with 1,400 doctors as a physician coordinator for a major health-care system in Pennsylvania. He considers himself a success, thanks largely to JUCO football giving him a start. Players line up during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic How football landed on the chopping block The move to eliminate football has its roots in a strategic plan to transform the 10-college Maricopa system into a national leader in higher education. To do that, district officials are focusing on student academic success. They want more students to complete degrees or certificates, and they want more to transfer to four-year schools after junior college. To fund what is known as \"the transformation,\" district officials and governing board members are also looking for efficiencies. Jeffrey Darbut, vice president of administrative services at Mesa Community College. Mesa Community College A March 2017 position paper written by Jeffrey Darbut, vice president of administrative services at Mesa Community College, offered several recommendations. Among them: to eliminate all athletic programs. Darbut estimated the district could save $12.5 million a year by getting rid of athletics. Another $25 million to $75 million could be raised by selling the athletic land and buildings. The report said athletics is \"viewed by many faculty members as not contributing to the college mission\" and that \"there are no student outcomes to support the enormous cost of the athletic programs .\" The document has become known by critics as the \"Darbut manifesto\" because the governing board has already implemented some recommendations. Football is the only sport that is being eliminated after 2018. Also, in May 2017, a college-district task force that had been reviewing athletics determined football players had the lowest grade-point averages, the second-lowest retention rates and the second-highest student-loan default rates of all sports. Football had the highest operating costs, the report said, and highest insurance claims. Eliminating football would save $770,000 a year and another $219,000 in insurance premiums, a report said. \"The high risk of catastrophic physical injury, low levels of student success and high cost to maintain football teams outweigh the intrinsic value of participation in the sport,\" the report concluded. \"The recommendation is made to eliminate these teams .\" In October 2017, the chancellor announced football would remain in place and be re-evaluated in 2018-19. Football supporters breathed a sign of relief. But the relief was short-lived when in early February, college employees received an email just before college-football signing day. The district had made a difficult decision, the email said: Football will be eliminated following the 2018 season. Players take a break during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic How accurate were statistics cited to kill the program? Football advocates say the district used incomplete or misleading statistics, in some cases, to justify getting rid of the sport. Take fall-to-fall student retention, which measures whether students who play football return to the Maricopa district the following fall. A school wants retention to be as high as possible, because students who come back are more likely to earn a degree or certificate. Half of football players don't return the next fall, the second-lowest rate of all college sports behind men's soccer. But football supporters say this statistic is misleading because it gives the impression that all of those players drop out. Retention rates fail to take into consideration a key goal of JUCO--for players to get scholarships from university teams. Consider 22-year-old Juan Giraldo. He wouldn't count toward the fall-to-fall retention rate because he spent a semester at Mesa Community College in fall 2014 but was recruited the next semester to Eastern Michigan University, where he played football for three years as a safety. He said his tuition was covered by athletic scholarships at Mesa and Eastern Michigan. He graduated this spring with a bachelor's degree in criminal justice. Without the scholarships, he wouldn't have attended a four-year school, he said. Also a matter of dispute: the projected cost to maintain and improve football facilities. The district said that ongoing costs to maintain football programs \"could exceed $20 million\" in capital improvements. But this figure is an estimate that came up in a meeting; there is no written report that details projected costs. Football supporters say athletic facilities such as stadiums will still need to be maintained and improved even if football ends because other sports teams use them. Football advocates also take issue with the task force's conclusions that eliminating the sport will save about $989,000 a year. That figure fails to take into account tuition paid by football players who aren't on scholarships. Head football coach Ryan Felker watches his team during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Nor does it account for the scholarships that players earn to four-year universities. Mesa Community College players have earned about $1.1 million a year in scholarships from other universities for each of the last three years, according to Ryan Felker, Mesa's football coach. The college district declined to answer specific questions that The Republic posed about data in the athletic report. Hendrix, the governing-board president, said he has not read the report but said the chancellor briefed him on it. He said a mixture of facts--financial, risk of injury, insurance concerns--supported eliminating football. \"Unfortunately, there's a group that feels football is necessary to go to college. I don't agree with that point,\" he said. Nov. 6 election could decide football's fate When Arizona State University announced it was dropping in 2008 three sports from its NCAA roster--men's tennis, wrestling and men's swimming--because of state budget cuts, the decision was made at the university level, not by the Arizona Board of Regents who set policy for the universities. Wrestling and men's swimming were saved via fundraising. Men's tennis was cut and returned in 2017-18 because of donations from the athletic director and the Adidas sportswear company. Similarly, the decision to eliminate football never came before the Maricopa Community Colleges Governing Board and such a decision doesn't require a board vote. Laurin Hendrix, president of the Maricopa Community Colleges governing board. Maricopa Community Colleges Hendrix, the board president, said he has not received any requests from board members to discuss football at a board meeting. \"I think the administration made a good decision, and I support the decision they made. I don't see it coming (to the board),\" he said. An email exchange between governing-board members on Oct. 20, 2017, shows at least one current board member opposed football. In the email to board President Hendrix, Chancellor Harper-Marinick asks for clarification on where fellow board member Jean McGrath stands on football: \"Is she in favor of keeping football or eliminating? It is not prudent to take that one on at this time, (in) my professional and political judgement,\" the chancellor wrote. Hendrix responded: \"Ms. McGrath's hot buttons at the moment are sabbaticals, travel, union memberships and most recently football. If we give her victories to give to her supporters, it will keep her on board for the bigger agenda, namely the transformation,\" Hendrix wrote, referring to the district's strategic plan. \"The ball that we need to keep our eye on is the transformation. This other stuff is window dressing but we need it so that the board members can share their list of victories with their supporters and remain supportive for the bigger picture .\" Hendrix told The Republic he wrote the \"candid\" email to the chancellor as a preview of issues that were going to come up. He said he wasn't passionately in favor of or opposed to football. Jean McGrath, member of the Maricopa Community Colleges governing board. Maricopa Community Colleges McGrath told The Republic the college district can't afford football. \"I'm not in favor of it going away, but...it was a financial decision .\" McGrath said she is especially concerned about liability if players are injured and sue. The NFL is being sued by former players who suffered concussions, and attorneys representing the players estimated that payouts from a settlement could top $1.4 billion, according to the Associated Press. \"I don't see how any educational institution can afford football,\" McGrath said. But football advocates are hoping to save the sport by throwing their support behind four candidates running in the Nov. 6 board election who they hope will be sympathetic to reviewing the decision. Four seats are open on the seven-member board with only two incumbents, McGrath and Augustine Bartning, running for re-election. Football supporters are backing challengers Tom Nerini, Stan Arterberry, Marie Sullivan and Roc Arnett. Arterberry is the sole candidate running against incumbent McGrath, whose District 4 includes the Sun City area. Arterberry told The Republic he hasn't committed to saving the sport. But if elected, he wants the board to review in a public meeting the data that went into the decision to eliminate football. \"Having said all that, I support athletics for students,\" said Arterberry, who attended college on a football scholarship. \"Because of football, I stayed in school, I passed my courses and most important graduated,\" he said. Did a football coach go too far? The rhetoric surrounding the football debatehas become heated at times. Hendrix, the board president, said he received in March a threat via Twitter from Scottsdale Community College football coach Doug Madoski. Madoski had responded to questions on Twitter about the decision to eliminate football. The March 2 tweet said, \"My mom taught me patience is a virtue and my dad taught me that when battling the king you only get one shot...make sure you kill him before he kills you. No need for other schools to panic I'm pretty calculated as are the others fighting this fight. Patience is a virtue .\" Hendrix said he interpreted the tweet as \"when they refer to killing the king, I'm the president of the board. I have to think that might be me .\" Madoski told The Republic the tweet was taken out of context, adding that he would never threaten anyone. \"The\" king' is not relating to an actual person or Mr. Hendrix, \"he said .\" It was simply...this is a large group of things, an ideological purpose, that we're confronted with now...Be patient. \"Players head in for water during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Is JUCO football on the decline? Most of the country's 1,500 community colleges don't offer football. The sport exists in pockets with a strong, decades-long football tradition. California has by far the most JUCO teams, with 68 belonging to the California Community College Athletic Association. Another 66 are part of the National Junior College Athletic Association (NJCAA), with six states fielding six or more football teams: Arizona, Texas, Minnesota, Kansas, New York and Mississippi. NJCCA Executive Director <mark>Christopher Parker</mark> said the number of schools sponsoring football has remained relatively steady over the last decade, plus or minus five schools. Among the junior colleges that have cut football since 2010: Rock Valley College, Joliet Junior College and Harper College, all in Illinois, and Grand Rapids Community College in Michigan. All of the schools cited financial reasons. Over the next decade, <mark>Parker</mark> predicts,\" I don't see a huge influx of schools adding and I don't see a huge number of schools dropping. \"He said he's been approached by some two-year colleges considering adding football as a way to boost enrollment. But he declined to name them until the schools make their decisions. Players line up for drills during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Concern over injuries Participation in high-school football is on the decline, nationally and in Arizona, in part because of concern over head injuries, officials said. The National Federation of State High School Associations reports participation is down 3 percent in the last five years, with about a million students playing the sport. Football participation in Arizona declined from about 22,000 five years ago, to about 19,900 in the 2017-18 school year, said David Hines, executive director of the Arizona Interscholastic Association. Hines said he's unaware of any large high schools that plan to drop the sport. He is seeing some smaller schools eliminate freshman teams because of a lack of interest .\" With the national attention on concussions, there are parents or kids that have said, \"You know what? I'm not going to play,'\" he said. The Maricopa colleges task force called football \"the most risky of the intercollegiate sports\" offered by the schools. The task force's report cited a 2007 study in the Journal of Athletic Training that analyzed 16 years of NCAA data and found football had the highest injury rate compared with other intercollegiate sports. At Maricopa colleges, football injuries in 2014 accounted for 51 percent of injury-related insurance claims. College officials have taken steps to make football safer, which has resulted in fewer sports-related claims, the report said. But that comes at a cost. Oakland Raiders running back Charlie Garner runs to the end zone on a 46-yard touchdown pass play against the Tennessee Titans in the second quarter on Sept. 7, 2003, in Nashville, Tennessee. AP/The Tennessean/George Walker IV One of Maricopa's former JUCO players, former NFL running back Charlie Garner, recently went public with his health struggles. The former Scottsdale Community College player revealed last year, at age 45, that doctors believe he is dealing with symptoms of Chronic Traumatic Encephalopathy (CTE), the degenerative brain disease found in athletes who have suffered repetitive brain trauma. Garner played pro football for 11 years for the Philadelphia Eagles, San Francisco 49ers, Oakland Raiders and Tampa Bay Buccaneers. \"I don't have all my faculties anymore,\" Garner told sportingnews.com. \"I can't remember things. When I go to the mall or grocery store, I have to take one of my kids with me to remember where the car is parked. I have trouble remembering conversations I had five minutes ago. Bright lights bother me. I just don't feel right all the time .\" Ernie Renfro's son, 18-year-old Trevor, played football at Centennial High School and is on Mesa Community College's team this fall on the offensive line, at center and guard positions. Renfro reflected on the increased scrutiny of football injuries as he watched the team practice on a recent night. \"I don't worry about it,\" he said. \"I think they've gotten better with the helmets and equipment and the safety rules. Can it happen? Yes. But it can happen with everything you do .\" Player Trevor Renfro poses for a picture during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Students try to focus, not lose hope Amid the ongoing debate over the future of Maricopa football, players are preparing for their first games of the season. Mesa faces Phoenix College and Scottsdale takes on Glendale on Saturday night. With football expected to go away next year, the push to land scholarships to Division 1 schools has never been greater. Those who get scholarships won't have to worry about the future. Mesa has sent 88 players to Division 1 schools on football scholarships during the last six years, and a total of 169 players on to four-year colleges overall. Player Ivory Williams talks with an Arizona Republic reporter during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Ivory Williams is a 19-year-old, red-shirt freshman safety from Tempe. Without a football scholarship, he said he has no way to pay for college. He has already turned down partial-scholarship offers from Division 2 schools because he can't afford it. He hopes to secure a scholarship to a four-year school. He and other players are also hopeful that Maricopa college-district officials may reconsider their decision and keep the sport. There are no guarantees on either. Unless something changes, Maricopa football scholarships end after the spring semester. And the stadium lights will go dark. Reach the reporter at 602-444-8072 or anne.ryman @ arizonarepublic.com. Published 12:00 p.m. UTC Aug 23, 2018"}, {"articleID": "2010021213_00137003_W", "names": {"Larry King": ["Q213430", "Q51724798", "Q6490623", "Q6490625"]}, "date": "2010-02-12", "url": "http://au.news.yahoo.com/a/-/world/6797764/bill-clinton-leaves-hospital-after-heart-procedure/", "content": "new york (reuters) - former u.s. president bill clinton left a new york hospital early on friday following a successful heart procedure to open a blocked artery in his heart that had caused him chest discomfort. clinton, 63, had quadruple heart bypass surgery in 2004 to free up four blocked arteries, and the latest incident comes after he has travelled twice to haiti to help recovery efforts after a devastating earthquake there. \"president clinton was released from new york presbyterian/columbia this morning in excellent health,\" douglas band, counsellor to clinton, said in a statement. \"he looks forward in the days ahead to getting back to the work of his foundation, and to haiti relief and recovery efforts .\" television footage show clinton, who was president from 1993 until 2001, walking to his vehicle as he left the hospital and later arriving at home in the new york suburb of chappaqua. two stents were placed in one of clinton's coronary arteries after tests showed that one of the arteries operated on in 2004 needed to be reopened, dr. allan schwartz, head of cardiology at columbia, told reporters. he said there was no indication clinton had a heart attack or of any damage to his heart. schwartz said clinton could resume his \"very active lifestyle\" and return to work as soon as monday. allan gave the president an \"excellent\" prognosis. clinton's wife, secretary of state hillary clinton, arrived at the hospital on thursday evening, joining daughter chelsea. a senior administration official told reuters that secretary clinton's departure to qatar and saudi arabia, planned for friday, was delayed to saturday but that the delay would not affect her meetings in the two countries. the white house said clinton told president barack obama that he felt \"absolutely great\" after the procedure. having stents placed in heart arteries is a relatively quick and routine procedure among patients like clinton who have suffered from heart disease. stents are tiny mesh tubes used to prop open heart arteries that have been cleared of blockages via angioplasty. they are now often coated with drugs to help prevent reclogging. just before his 2004 surgery, clinton spoke on cnn's \"<mark>larry king</mark> live,\" about his heart blockage: \"some of this is genetic and i may have done some damage in those years when i was too careless about what i ate...i've got a problem and i've got a chance to deal with it,\" clinton said."}, {"articleID": "2014052114_00038561_W", "names": {"Brett Butler": ["Q292073", "Q4962098", "Q4962101", "Q4962106"]}, "date": "2014-05-21", "url": "http://www.pr.com/press-release/559229", "content": "LeaderOne Financial Announces Hire of Patti Dieu, Sr.. Mortgage Banker)--LeaderOne Financial, one of the nation's fastest growing mortgage companies, is proud to announce the hiring of Patti Dieu, who will serve as a Senior Mortgage Executive within the organization. Ms. Dieu will be located in the organization's O'Fallon, Illinois office. \"My mission is to provide comprehensive mortgage solutions to all of my customers, with the highest degree of trust, knowledge, respect and convenience,\" says Ms. Dieu. The opportunity to work for a quickly growing national leader in the field, combined with the ability to continue serving the community she's help build, has Ms. Dieu feeling optimistic. \"I have been in the business for a long time. I have seen lots of changes, and I feel it's only going to get better from here .\" Ms. Dieu's long history in the mortgage banking and finance industry, along with her longstanding community ties, make her an ideal fit for LeaderOne, which originated nearly one billion dollars in loans throughout 2013. \"I was born and raised in St. Louis,\" says Ms. Dieu, \"and attended Southern Illinois University Edwardsville, as well as Wichita State. After I married, I moved to the Illinois area and have been here ever since .\" And taking care of her community has been a priority for Ms. Dieu for nearly thirty years. \"I started in the business in 1985 as a loan processor. Back then, you had to submit your loans to the agencies, VA/FHA, directly by mail. It could take months to get loans closed. In order to be successful you had to be top of the game. Rates are very important to our customers, but without knowledge and trust, you will not gain their confidence or respect. A good loan officer knows how to get the job done! There is nothing I hate more than hearing a loan officer say to a customer,' I am not sure why we need this, but my underwriter is asking for it .' Yikes!\" With LeaderOne recently having been named one of the top one hundred mortgage companies in America by Mortgage Executive Magazine, Ms. Dieu is ready to \"hit the ground running\" with one of the fastest growing leaders in the industry. \"The future for this industry is bright,\" she states. During her time off, Ms. Dieu and her husband have a small plane and are building another one. \"We hang out with a group of pilots with their own planes, and we like to take mini getaway trips over the weekends. We fly around to hear musicians, attend concerts and hit up the wineries .\" About LeaderOne: LeaderOne is a full service mortgage banking operation with over twenty years of experience. Located in Overland Park, Kansas, LeaderOne has seen incredible growth during recent years due to its insistence on fair and honest business practices. Contact: <mark>Brett Butler</mark> National Marketing Manager"}, {"articleID": "2010082304_00036994_W", "names": {"Matthew Bell": ["Q26678328", "Q55622464", "Q6790143", "Q6790146"], "Richard Compton": ["Q55760855", "Q7324850", "Q7325819"]}, "date": "2010-08-22", "url": "http://novinite.com/view_news.php?id=119392", "content": "the false estate: did property journalists mislead investors? views on bg | august 22, 2010, sunday did property journalists mislead investors? photo by www.independent.co.uk irish investors who claim they were misinformed may sue journalists, says <mark>matthew bell</mark> the independent if the british property market resembles a shrivelling party balloon, in ireland it looks more like the aftermath of the hindenburg disaster. the bubble that started growing in the 1990s and accelerated out of control after 2002, when ireland joined the euro, eventually burst spectacularly in 2008, and has yet to show any signs of recovery. since the crash, those who lost a fortune or who have been left with unsellable property have been looking for someone to blame. now a hate figure has emerged in the form of the property journalist. although a case has yet to be lodged, a number of aggrieved investors are said to be consulting dublin lawyers about launching a case against certain journalists who, they believe, were responsible for misleading them into investing in developments that failed to deliver promised returns. \"journalists fear they may be made legally liable for misleading readers who followed their advice and bought properties abroad, suffering major losses,\" says <mark>richard compton</mark> miller, a property journalist himself. \"there's a lot of anger among investors .\" if such a case were brought, it would raise questions about the responsibility of journalists who use supposedly impartial editorial space to promote commercial developments. it may be understood among journalists that the editorials of glossy property supplements follow a less rigorous code of impartiality than conventional journalism - they are essentially vehicles for advertising - but to the consumer such a distinction may not be so clear. articles recommending holiday homes abroad are particularly contentious, says <mark>compton</mark> miller. \"journalists would go on trips to places like bulgaria and recommend it as a place to buy a holiday flat. now, places like bulgaria have fared very badly, and people are feeling angry with the journalists who promoted it .\" property journalists have already fallen victim to the crash as newspapers have cut budgets and downpaged - or axed - their property supplements, because of loss of advertising. but many lawyers are sceptical about how strong a case against journalists could be. \"the idea that any investor could sue a property journalist is barking mad,\" says simon mcaleese, a dublin lawyer. \"though it wouldn't surprise me: people have been getting desperate to find someone to blame .\" even if it would be hard to prove that property journalists had deliberately misled readers, it is easy to see why investors might feel cheated. property journalism has exploded over the past decade in line with the boom. but it has always been fraught with questions of independence, as developers use offers of lavish trips abroad to entice journalists to write about their projects. \"there are a huge number of freebies,\" says journalist graham norwood. \"one top agent offered me cash to write a nice piece about a property. but part of the problem with international property is that the only way we can see a development is if the trip is paid for. newspapers can't afford to send us, and we can't afford to send ourselves .\" because of this, it is rare to find developments getting a negative press. \"if we don't like a development or property, we don't run an article,\" says one editor. this approach has led to certain supplements earning reputations for only running good-news stories, which investors might argue is misleading. but, says norwood: \"developers can be aggressive about coverage. they have threatened to sue newspapers if they publish negative editorial .\" among the victims of ireland's property crash are newspaper groups themselves: at the height of the boom in 2006, the irish times bought property search website myhome.ie for? 50m, a sum it would now be unlikely to fetch. and with papers investing in the property market, the impartiality of property supplements became even more questionable. \"there were certainly some journalists who were notorious for only writing good-news stories, and of questionable partiality,\" says one writer, who wishes to remain anonymous. \"but most are like any journalists, they try to be fair and accurate .\" whatever a story's angle, the burden of due diligence would always rest on an investor, says mcaleese. \"proving professional negligence is difficult at the best of times,\" he says. \"but the argument here would be impossible to stand up. it is buyer's remorse gone mad. it's like the mad murderer's argument: you knew i was mad, you should have put me in a padded cell .\" the false estate: did property journalists mislead investors? \"did property journalists mislead investors?\" bulgarian pm gets much praise from wb president bulgarian prime minister boyko borisov and his cabinet have been lauded by world bank president robert zoellick for dealing successfully with the effects of the global economic crisis as well as with corruption and administrative deficiencies. bulgarian diaspora minister makes blunder after blunder? israel's ambassador to bulgaria noah gal gendler: israelis feel the positive attitude of the bulgarian people? poll who is right and who is wrong in the exchange of criticism (and insults) between bulgaria's diaspora minister bozhidar dimitrov and leading archaeologists after the discovery of the alleged relics of st. john the baptist?? the archaeologists are right because dimitrov went ahead too quickly with announcing that the relics for sure belonged to st. john. - 36? both opposing sides have shown tremendous disrespect of one another and have essentially marred an otherwise important archaeological discovery with their insults and arguments. - 20? the whole \"conflict\" between dimitrov and the archaeologists has been blown out of proportion; it is really no big deal, and has not affected the importances of the find. - 16 changing world - \"it's clear\" said the teacher, \"that you haven't studied your geography. what's your excuse?\" "}, {"articleID": "2010012715_00116794_W", "names": {"Andal Ampatuan": ["Q464295", "Q464340"]}, "date": "2010-01-27", "url": "http://tetchtorres.wordpress.com/2010/01/27/ampatuan-clan-%e2%80%98violent%e2%80%99-arroyo-execs-warned-rival/", "content": "posted on january 27, 2010 by tetchtorres inquirer.net, philippine daily inquirer first posted 07:11:00 01/27/2010 manila, philippines - (update 6) president gloria macapagal-arroyo's officials had repeatedly warned buluan vice mayor esmael \"toto\" mangudadatu against challenging the political bid of the ampatuans because they were a \"violent people,\" the local executive himself told the court wednesday. mangudadatu said that following his decision to run against datu unsay mayor <mark>andal ampatuan</mark> jr. for the governorship of maguindanao, he was approached by secretary gabriel claudio, presidential adviser for political affairs, then defense secretary gilbert teodoro, and former congressman prospero pichay on separate occasions. mangudadatu, who as of posting time is testifying at the resumption of the trial against ampatuan jr., said that pichay called him last november 9 to ask if he was sure about running against ampatuan jr. \"he [pichay] asked me if i was running, and i said,\" yes .' he asked me if i was sure about my decision, and i said, \"yes,'\" mangudadatu said in filipino. \"pichay warned me and told me to take care because they (the ampatuans) were a violent people,\" he said. mangudadatu said teodoro issued the same warning last october 10 when they met at a restaurant in manila. \"he [teodoro] asked me if i was running, and i said,\" yes .' he told me not to. i love you very much toto [mangudadatu's nickname]. these people are violent, \"mangudadatu quoted teodoro as telling him, referring to the ampatuans. last august 11, mangudadatu said he met with the ampatuans in malacañang to settle the issue .\" i was invited in malacañang to have dinner with the ampatuans. \"it wasn't clear, however, whether the president was there. mangudadatu said that as early as july, claudio invited him and his relatives to meet teodoro. mangudadatu said that in that meeting, also present were the ampatuans - maguindanao governor ampatuan sr., ampatuan jr., governor zaldy ampatuan of the autonomous region in muslim mindanao, sajid ampatuan, saudi ampatuan - and congressman simeon datumanong. he said that this was the first instance wherein they were asked to settle the issue. he said his brother even requested that maguindanao's chief of police, sukarno dikay, and colonel medardo geslani, head of the 601st infantry batallion, be replaced. mangudadatu said that although teodoro assured him that this would be looked into, nothing happened. mangudadatu said the repeated warning for his safety was the reason why he requested for military and police escort last november 23 when his wife, lawyers, and supporters were to file his certificate of candidacy for him in shariff aguak .\" sabi niya [referring to colonel medardo geslani] nasa maynila ang mga tao nya para sa seminar [he said his people were in manila for a seminar], \"mangudadatu said, adding that his request was also rejected by police .\" nagpasya kami na mga babae ang ipadala para maghain ng coc dahil sa islam, ang babae ay binibigyan ng malaking respeto at hindi sinasaktan, gaya sa ibang relihiyon [we decided to send women to file the coc because in islam, the women are given the greatest respect and they are not hurt, like those in other religions], \"mangudadatu said. mangudadatu recalled that on the fateful day, at around 10 a.m., his mobile phone rang. it was his wife genalyn calling .\" she told me that they have been blocked by a lot of men in the area. i asked her who they were. she said they were armed. she said that unsay was there and that he slapped her. that was the last time i heard from my wife. i called her again and my other relatives who were with her in the convoy but no one answered, \"said mangudadatu in filipino. he said he then called dicay to inform him that his wife was kidnapped. mangudadatu said dicay told him that he did not know anything. mangudadatu said that his family and ampatuan clan once had close family relations .\" i know him [<mark>andal ampatuan</mark> jr.] well for more than 10 years. our families were very close, \"mangudadatu said. he said he decided to veer away from the ampatuan after they figured in on the killing of certain datu ipao in 2008. mangudadatu said that as early as 2006, he had plans of vying for the governorship. but ampatuan sr. told him not to run and that instead, he would be given a province of his own .\" he [ampatuan sr.] asked me to produce the necessary requirements. unfortunately, we failed to meet the requirements [stated under the law for the creation of a new province], \"mangudadatu said. in 2006, upon the creation of the province of shariff kabunsuan, mangudadatu said, by law, his brother freddie, then, head of the sangguniang bayan, was supposed to sit as vice governor. but mangudadatu said <mark>andal</mark> sr. told him that he was supposed to occupy the position, not his brother. because of this, mangudadatu said <mark>andal</mark> sr. issued a resolution stating that his brother was not qualified for the position due to lack of education and experience .\" i told him, \"apo [<mark>andal</mark> sr.], my brother was able to study, three terms as board member .'\" \"i told him\" apo change what has been put in writing [referring to the resolution] because it hurts a lot,' \"mangudadatu said .\" pero wala kaming nagawa, ako, ang nanay ko, ang kapatid ko [but we weren't able to do anything, my mother, my brother]. my brother was forced to sign the resolution. \"\"bakit wala kayong nagawa [why weren't you able to do anything]?\" asked department of justice senior state prosecutor leo dacera. \"dahil napakaraming bodyguard sa compound nila [because there were a lot of bodyguards in their compound],\" he said. but in exchange for the signing of the resolution, he said they asked that they be given two municipalities, mangudadatu said, adding that armm governor ampatuan has the authority to do so. two municipalities were created where his brothers freddie mangudadatu and sajib mangudadatu sat as mayors, he said. in 2007, mangudadatu said that news reached <mark>andal</mark> sr. that he was still considering running as governor. he said the \"old man\" visited him. this time, his uncle, congressman pax mangudadatu told him not to fight the old man. \"sabi ko hindi na po [i told him, no more],\" mangudadatu said. a year later, due to the prodding of his constituents, mangudadatu said he decided to push through with his political plan. mangudadatu said that following his decision, the provincial director of maguindanao on oct. 18, 2008 confiscated the firearms of the police in his municipality, saying it was for inventory purposes only. on july 8, 2009, maguindanao chief of police dicay along with members of the 76th infantry battalion and 601st ib entered pandan municipality and disarmed the police officers. they also fired a series of shots from a 105-millimeter howitzer, causing the public to panic. mangudadatu said that when he asked dicay about what he did, the police chief told him that they were looking for umbra kato, head of the breakaway group of the moro islamic liberation front. a day later, mangudadatu said he personally met with president gloria macapagal-arroyo in guagua, pampanga and told him of his problem in his municipality. \"she immediately called general [victor] ibrado and ordered that the firearms be returned to the police and told him that the people in mangudadatu were peace loving,\" he said. mangudadatu is scheduled to return next week for his cross examination. in an earlier testimony on wednesday, mohamad sangki, a member of the sangguniang bayan of datu abdullah sangki, testified that armm governor ampatuan supported the plan to ambush the convoy of mangudadatu in november 23. sangki said he was informed by datu noradin datumanong ampatuan last november 20 that the armm governor attended a meeting with nori unas, the provincial administrator of maguindanao, ampatuan jr., and other ranking officials. \"i asked him [noradin ampatuan] about how strong our action was going to be? he said he just came from a party convention in manila. argee, nori and the old man, together with other ranking officials, they all support the old man,\" sangki said. when the prosecutor asked who nori was, sangki identified him as the provincial administrator of maguindanao. when the prosecutor asked again who argee was, sangki said it was \"zaldy,\" referring to the armm governor. and when the prosecutor asked who the \"old man was,\" sangki said, \"it was <mark>andal</mark> sr.\" sangki said that datu bahnarin ampatuan also spoke to him last november 19. \"it was the wish of the old man [ampatuan sr.] to deploy auxiliary police in maguindanao,\" sangki quoted bahnarin ampatuan as telling him. sangki said he was accompanied by the mamasapano mayor to meet ampatuan jr. and was given p15,000 for the deployment of the auxiliary police. the deployment would have been in effect until december 2, sangki said. sangki said he deployed more than 20 police auxiliary and went to crossing saniag where they met with talumbu masukat, the sangguniang bayan of mamasapano, and his men. however, during the cross examination, ampatuan's lawyer sigfried fortun tried to discredit sangki, saying that he was indicted for cases of murder in the past. fortun said sangki had been indicted in the murders of hamsa kamal, mongkika ampatuan, mawani ampatuan, and saminda sangki. fortun added that sangki also has a pending case for murder and arson. but chief state prosecutor jovencito zuno said this did not affect the credibility of the witness. \"the defense tried to discredit his credibility by presenting criminal records...but it will not damage his credibility. the direct testimony was good and even in the cross examination,\" zuno told reporters. jeofrey freddie lizada, smart telecoms legal assistant, also testified and presented a copy of a billing statement of mangudadatu's mobile phone. \"he [lizada] just testified on the authenticity of the billing statement,\" roland argabioso, national bureau of investigation (nbi) field operations chief, told the philippine daily inquirer. when asked about the importance of the phone bill, the nbi official said the call records would back the claim of mangudadatu that he spoke with his wife bai genalyn moments before she and 56 others were slaughtered. mangudadatu had maintained that his wife was able to tell him over the phone that ampatuan and a group of about 100 armed men blocked their convoy in a checkpoint in ampatuan town before the victims were massacred. argabioso said lizada's testimony only lasted about five minutes. \"the defense lawyers did not make a cross examination of the witness,\" said argabioso, who was inside the makeshift courtroom at the philippine national police in camp crame. lizada later told reporters outside the courtroom that he just presented the copy of a phone billing statement, but refused to elaborate. the hearing at the police non-commissioned officers' club building was a continuation of a petition for bail by ampatuan jr., the prime suspect in the deaths of 57 people, including 31 journalists. ampatuan arrived in camp crame at 6:30 a.m. with several escorts from the nbi and the pnp. last week, raw video footage of the massacre site was presented during the hearing. the footage showed bodies being dug from the mass graves using a backhoe. twittering me am about to wrestle people again at the mrt...damn...there goes my freshness, walking away 16 hours ago is checking on latest jurisprudence...in my dual capacity 1 day ago freakin' sss phones kelan ba magkakatao sa mga opisina nyo!!!! inquirerdotnet: meralco eyes 2-hour rotating brownouts in metro"}]