[{"date": "2014-12-19", "url": "http://independent.co.uk/life-style/food-and-drink/news/christmas-dinner-you-think-youll-consume-2000-calories-but-in-reality-its-closer-to-6000-9937146.html", "content": "Despite the mounds of mince pies, armfuls of chocolate boxes, and stacks of yule logs which fly off the shelves in December, Brits still believe they eat half as much on Christmas Day as they really do. Most people estimate that they consume around 2,600 calories on Christmas Day, but in reality the figure is closer to 6,000. That is the equivalent of 12 Big Macs, and three times the daily recommended amount of calories for a woman, and just under 2 and a half more than a man's. A survey of 2,000 UK adults also showed that 46 per cent us don't consider the amount we eat on Christmas Day, or any other day of the year. It also revealed that half of us are ditching the traditional Christmas turkey meal on 25 December. London pub's offer to feed the homeless Christmas dinner goes viral Despite dessert being a big part of the meal, the poll showed that only 29 per cent of those aged between 18 and 24 will eat Christmas pudding, compared to 61 per cent of those aged 55 years old and over which, indicates the reign of the fruit-filled desert may soon be over. Unsurprisingly, alcoholic tipples also play a major part in the season's festivities. A third of Brits plan to guzzle red or white wine this year, a quarter will celebrate with sparkling wine, and a fifth will opt for beer or lager. Dr Annie Gray, a food historian who conducted the research with AB sugar, said: \"Our food, drink and even lifestyle habits have really changed over the years .\" Back in WWI and WWII even the most manual of tasks could sometimes involve hard labour so we were certainly more active and, in fact, we were our healthiest as a nation at the end of WWII. \"cricket Eoin Morgan reportedly to take over ODI captaincy <mark>Stephen Ward</mark> trial was disgraceful. There can be no justification for it A Clockwork Orange (1971) Adapted from Anthony Burgess's best-selling novel, A Clockwork Orange tells the story of Alex and his gang of violent\" droogs' who kill tramps and rape women. Plus-sized woman asks Photoshop experts over the world to \"fix her'...Liverpool host Arsenal as Reds look to cling on to fading top-four hopes football Premier League preview: All the talking points ahead of this weekend's clashes A tale of two cities: sex and sensibility, from Givenchy, Celine and Stella McCartney <mark>Alexander McQueen</mark> at auction: What makes a really great piece of fashion? A bottle of wine a day is not bad for you and abstaining is worse than drinking, scientist claims No female ejaculation, please, we're British: a history of porn and censorship Stressed nurses are\" forced to choose between health of patients and their own' Pornhub: Kim Kardashian's sex tape is the most-watched porn video of all-time Nigel Farage: Me vs Russell Brand on Question Time - he's got the chest hair but where are his ideas? Harry Potter fans can apply to the Hogwarts-inspired College of Wizardry Jessica Chambers: 19-year-old woman \"doused with lighter fluid and burned alive' in the US Investigo: Finance Analyst £ 240 - £ 275 per day: Investigo: Support the global business through in-depth a.. . Negotiable: Ashdown Group: Data Manager - MySQL, Shell Scripts, Java, VB Scrip...Ashdown Group: Application Support Analyst - Bedfordshire/Cambs border - £ 32k £ 27000 - £ 32000 per annum: Ashdown Group: Application Support Analyst - near S.. . In 2010, Sgt Gary Jamieson stepped on an IED in Afghanistan and lost his legs and an arm. He reveals what, and who, helped him to make a remarkable recovery As a film following six patients receiving the controversial treatment is released, Kate Hilpern uncovers a very slippery issue You can't see Seth Rogen and James Franco's <mark>Kim Jong Un</mark> assassination film, but you can read about it here People have consumed gripping armchair investigation Serial with a relish typically reserved for box-set binges <mark>Kevin Lee</mark> Light, aka\" Jesus \", is the newest client of creative agency Mother while rival agency Anomaly has launched Sexy Jesus, depicting the Messiah in a series of Athena-style poses The most important scientific breakthroughs of 2014 Mulled wine is an essential seasonal treat. But now drinkers are rediscovering other traditional festive tipples. Angela Clutton raises a glass to Christmas cocktails Up the ante in your regimen and change the habits of a lifetime with this wearable tech It's a little-known fact, but I have played one of the seven dwarves Fifa's travelling circus once again steals limelight from real stars Club World Cup kicked into the long grass by the continued farce surrounding Blatter, Garcia, Russia and Qatar 2014 proves it's now one of sport's biggest hitters again Karen Tumulty explores the power dynamics of the two first families The Swedish capital is home to two of the most popular video games in the world, as well as thousands of technology start-ups worth hundreds of millions of pounds - and it's all happened since 2009 The story goes that Japanese store workers created a life-size effigy of a smiling\" Father Kurisumasu \"attached to a facsimile of Our Lord's final instrument of torture", "articleID": "2014121921_00018884_W", "names": {"Stephen Ward": ["Q27831019", "Q334576"]}}, {"date": "2014-12-21", "url": "http://www.miamiherald.com/sports/college/football/article4772931.html#storylink=rss", "content": "Christmas downer: <mark>Chris Bosh</mark> might be out for Heat's matchup with LeBron James, Cavs Marlins' <mark>Mike Hill</mark> believes Martin Prado is an upgrade at third To place an obituary, please call 305-376-8901 or email Jameis Winston cleared of wrongdoing after FSU sexual assault conduct hearing By ILIANA LIMï ¿ 1/2 N ROMERO AND BRENDAN SONNONE Jameis Winston has been cleared of violating FSU's code of conduct. \"This was a complex case, and I worked hard to make sure both parties had a full and fair opportunity to present information. In sum, the preponderance of the evidence has not shown that you are responsible for any of the charged violations of the Code,\" retired Florida Supreme Court chief justice Major B. Harding wrote in his findings in the case, according to a document obtained by the Orlando Sentinel. Attorney David Cornwell, Winston's attorney during the hearing process, was the first to post the news on Twitter, listing a portion of the hearing finding. Winston partook in a two-day hearing Dec. 2-3 to determine whether he violated sexual misconduct and endangerment provisions in FSU's code of conduct policy during an alleged sexual assault in December 2012. The hearing spanned at least 12 hours. Winston's accuser has the option to appeal the ruling, although FSU's code of conduct provisions do not allow for entire hearing to be conducted again with a different panel. Harding indicated in his ruling the lack of witnesses beyond Winston and his accuser had an impact on his decision. \"1/8The accuser's 3/8 statements concerning the night's events have changed over time, but you one point on which she has remained steadfast is that once in your room that you had sexual intercourse with her and that she did not consent to or actively participate in the intercourse .\" You, however, vehemently contradict 1/8the accuser's 3/8 recitation of the night's events. \"Harding later stated,\" the evidence regarding the events that unfolded between you and 1/8the accuser3/8 once in your room are irreconcilable. In light of all the circumstances, I do not find the credibility of one story substantially stronger than that of the other. Both have their own strengths and weaknesses. I cannot find with any confidence that the events as set forth by you, 1/8the accuser3/8 or a particular combination thereof is more probable than not as required to find you responsible for violations of the code. Therein lies the determinative factor of my decision. \"Harding reviewed more 1,000 pages worth of evidence, including files originally generated during a sexual assault criminal investigation. Winston did not answer questions during the hearing but read a five-page written statement, a source told the Sentinel .\" Rape is a vicious crime, \"Winston's statement obtained by the Sentinel read .\" The only thing as vicious as rape is falsely accusing someone of rape. 1/8The accuser3/8 and her lawyers have falsely accused me, threatened to sue me, demanded $7,000,000 from me, engaged in a destructive media campaign against me, and manipulated this process to the point that my rights have and will continue to be severely compromised. \"1/8The accuser's 3/8 and her lawyers' public campaign to vilify me guarantees that her false allegations will follow me for the rest of my life .\" Winston's accuser, a former FSU student who withdrew from school once the charges became public, was also present for the hearing although she never was in the same room as Winston. It marks the second time Winston has been cleared in connection with the sexual assault allegation. State Attorney Willie Meggs opted not to pursue criminal charges against Winston in December 2013, citing insufficient evidence and issues with the timeline of the police investigation. Heading into Miami Beach Bowl, senior year a major positive for Memphis safety Fritz Etienne Oops, you haven't selected any newsletters. Please check the box next to one or more of our email newsletters and submit again. Oops, you didn't provide a valid email address. Sports (Monday - Friday) Heat. Dolphins. Marlins. Panthers. Get into South Florida sports with Dan LeBatard, Greg Cote & the crowd. Dolphins Get the latest Dolphins news, stats, injury reports - sent weekdays during the season. College Sports (Monday - Friday) UM & other Florida colleges: Keep up with your favorite teams. 5-Minute Herald (Monday - Friday) The best of the morning's Miami Herald.", "articleID": "2014122123_00032787_W", "names": {"Chris Bosh": ["Q201386", "Q5105938"], "Mike Hill": ["Q1498629", "Q16192754", "Q27043626", "Q30164739", "Q484948", "Q5805741", "Q6847237"]}}, {"date": "2014-12-22", "url": "http://www.inquisitr.com/1697123/rick-ross/", "content": "Man Makes Giant KitKat For Girlfriend: Drool, Then See How He Did It Etsy Selling Pills That Will Let You Poop Glitter - Just In Time For Christmas \"SNL' Gives Ode To The Office Christmas Party With This Music Video Video Of 13 Dogs, 1 Cat Enjoying A Holiday Meal With Human Hands Goes Viral [Video] Pit Bull Shooting Video: Cop Kevin Dupre Shoots Puppy Dog On Camera, Police Say It's\" Justified' \"Cop Lives Don't Matter': Brandon Tate-Brown Shooting Has Police Protesters Saying,\" F ** k Cops' WWE: Batista Tweet Hints Company Is Underutilizing This Superstar WWE: Third Of \"Andre The Giant Memorial' Participants No Longer On Main Roster Saddleback Leather Company: Let's Tip Waitstaff Better For Wishing\" Merry Christmas' Instead Of \"Happy Holidays' 2014 Walmart Christmas Eve Hours: What Time Do Stores Close For Last-Minute Holiday Shoppers? Are You Sitting Too Much? If So, This Video Will Be Very Informative!\" GTA V' Story-driven DLC Now In Development, Alongside Online Heists Looks like Wiz Khalifa, who's known to be a huge fan of smoking marijuana, has met his match. During a recent party at the Supper Club in Hollywood, Khalifa was photographed beside <mark>Rick Ross</mark> who was smoking a huge blunt. <mark>Ross</mark> posted a picture of him and Khalifa on Instagram with the caption, \"Wiz came thru to blow one wit me like a trill yung n *** a shud #hoodbillionaire in da air!\" <mark>Ross</mark> was celebrating the release of his seventh studio album, \"Hood Millionaire\" , and Khalifa came by to <mark>Ross</mark> is not only celebrating the release of his new album, but also the fact that he lost around a massive 85 pounds after a medical scare back in 2011. He told Good Morning America, \"I wanted to cut back on some of the drinking I was doing and sleep a little more, you know, watch what I ate .\" <mark>Ross</mark> revealed that with the help of his own spin on the CrossFit training program as well as a few diet changes, he was able to lose all that weight. told Good Morning America about his health scare two years ago after he suffered two seizures. \"I woke up from that and I was like,\" Wow, I really need to re-evaluate what I'm doing,' \"he said. He started eating healthy, revealing that he added pears to his diet. The revelation became a meme after several of his fans started posting pear emojis on his Instagram .\" I feel I'm fat boy forever. I'm going to always be a fat boy. But it most definitely was just something I had to do, \"<mark>Ross</mark> continued. Despite the fact that he's changing his lifestyle gradually, he assured that it will not affect his music .\" My music comes from the heart, which comes from my mindset, \"he said .\" After I sit down and absorb this great interview, it's something that's gonna come to me that I can put into a record. \"Back in 2009, <mark>Ross</mark> founded the record label the Maybach Music Group. The label released his studio albums Deeper than Rap, Teflon Don, God Forgives, Mastermind, and 2014's Hood Billionaire. The label is also home to other artists such as Wale, French Montana, and Omarion. Atheists Rewrite Ten Commandments, MythBusters' <mark>Adam Savage</mark> Judged New Commands Anonymous Announces Vengeance On North Korea For Sony Hack With #OpRIPNK Prominent Michigan Cancer Doctor Pleads Guilty:' I Knew That It Was Medically Unnecessary' Carl Herold: Popular Reddit User CarlH Accused Of Raping, Torturing 9-Year-Old Son Did Ellen DeGeneres Catch Leah Remini's Husband Cheating On Her? [Video] Malaysia Airlines Flight MH370 Shot Down By U.S. Military, Former French Airline Chief Says\" Destiny': How To Complete \"Urn Of Sacrifice' Quest For\" The Dark Below' h4 class = \"icon-medal widgettitle\" > NEWSMAX h4 class = \"widgettitle icon-featured\" > Featured Articles \"Take Me To Church' With Victoria's Secret Angels: Hozier Accused of Misogyny\" GTA V' Story-driven DLC Now In Development, Alongside Online Heists Five Wonderful Facts About Movie Classic, \"It's A Wonderful Life' <mark>Bill Maher</mark> Gives Berkeley Commencement Speech, Ignores Petition Against Him", "articleID": "2014122209_00021254_W", "names": {"Adam Savage": ["Q297618", "Q58232433"], "Bill Maher": ["Q17183175", "Q25189369", "Q2903288", "Q489", "Q56529291"], "Rick Ross": ["Q297831", "Q431969", "Q606032"]}}, {"date": "2014-12-23", "url": "http://tuscaloosanews.com/article/20141223/NEWS/141229878/1226/ENT?Title=Seth-Rogen-James-Franco-others-react-to-The-Interview-release", "content": "Seth Rogen, James Franco, others react to \"The Interview\" release FILE - In this Dec. 11, 2014 file photo, actors Seth Rogen, right, and James Franco attend the premiere of the Sony Pictures' film \"The Interview\" in Los Angeles. Sony Pictures Entertainment announced Tuesday a limited theatrical release of \"The Interview\" beginning Thursday, putting back into the theaters the comedy that prompted an international incident with North Korea and outrage over its cancelled release. Sony Entertainment CEO Michael Lynton said Tuesday that Seth Rogen's North Korea farce \"will be in a number of theaters on Christmas Day .\" He said Sony also is continuing its efforts to release the film on more platforms and in more theaters. (Photo by Dan Steinberg/Invision/AP, File) Published: Tuesday, December 23, 2014 at 2:15 p.m.. Last Modified: Tuesday, December 23, 2014 at 2:16 p.m. LOS ANGELES | Celebrities and others react to Sony's announcement Tuesday that it will release Seth Rogen and James Franco's embattled North Korean satire, \"The Interview,\" in some theaters on Christmas: - \"The people have spoken! Freedom has prevailed! Sony didn't give up! The Interview will be shown at theaters willing to play it on Xmas day!\" - Rogen on Twitter. - \"VICTORY!!!!!!! The PEOPLE and THE PRESIDENT have spoken!!! SONY to release THE INTERVIEW in theaters on XMAS DAY! CELEBRATING!!!!!\" The Interview \"starring Seth Rogen and James Flacco saved by President Obacco! I MEAN PRESIDENT OBAMA!!!!! Sorry!!!\" - Franco on Instagram. - \"Thanks to everyone who didn't give up on our movie! @ Sethrogen & I are humbled & overwhelmed by your support. Hope you enjoy the film!\" - \"The Interview\" co-writer-director, Evan Goldberg, on Twitter. - \"Can't wait for Ben Affleck's film about the making, marketing and release of\" The Interview. \"#OscarWatch 2019\" - \"Night at the Museum\" director <mark>Shawn Levy</mark> on Twitter. - \"...Just as I hoped, indie movie theaters step up. Good!\" - Salman Rushdie on Twitter. - \"We are proud to make it available to the public and to have stood up to those who attempted to suppress free speech .\" - Sony Entertainment chief Michael Lynton in a statement. - \"\"The Interview\" to screen Xmas day in Austin & Atlanta. So our free speech is finally safe again. Glad that's over. #Sony \"- Actor Harry Shearer on Twitter. -\" This is the best Christmas gift anyone could give us. We, both distributors and exhibitors, have collectively stood firm to our principles and for the right to freedom of expression. Two days til Christmas, and I am proud to be an American. \"- Tim League, chief of Alamo Drafthouse Cinema theaters in a statement. -\" Glad to see @ JamesFrancoTV and @ Sethrogen happy and plugged in again. Welcome back guys, we missed you! #TheInterview \"- Rob Lowe on Twitter. Witness: Car seen speeding away from fire at Rolando McClain's home", "articleID": "2014122320_00049307_W", "names": {"Shawn Levy": ["Q323076", "Q39444311"]}}, {"date": "2014-12-28", "url": "http://buffalonews.com/opinion/viewpoints/polarized-politics-our-unrealistic-hopes-for-presidents-20141228", "content": "Proposal to dissolve Village of Medina brews dissension Local investment advisers predict a strong year for stocks Welcome federal storm reimbursement will require an accurate accounting New ice rink is turning Canalside into a true year-round destination Another Voice: Old clothing should be donated, not thrown away New ice rink is turning Canalside into a true year-round destination \"Dancing With the Stars\" show is entertaining, but light on substance Mary Anne Buddenhagen, longtime Buffalo News correspondent [BN] the know Subscribe for just $1.99 / wk Polarized politics: Our unrealistic hopes for presidents When will we give up on the idea of a leader who will magically bring consensus and unity to our politics? At election time, candidates seduce us with promises to bring America together, but inevitably fall short and end up leaving office with the country more polarized than when they arrived. After blaming them for their failure to unite us, we turn to the next crop of presidential aspirants and the cycle of hope and disappointment begins all over again. The latest example of this pattern, of course, is President Obama. His 2008 campaign was premised on his ability to forge new coalitions in Washington, which Hillary Rodham Clinton mocked at the time as \"Let's get everybody together, let's get unified, the sky will open, the light will come down, celestial choirs will be singing .\" In office, though, he has never succeeded in overcoming Republican resistance to his agenda, forcing him to pass his most significant legislative accomplishments with few or no GOP votes. After his party's decisive defeat in last month's midterm elections, the administration has now largely given up on the pursuit of bipartisan dealmaking and is pursuing its policy goals on issues like immigration and the environment through executive action. The debate over why Obama failed to achieve some larger consensus has already begun. Some have suggested that if only he had not pursued health care reform or had a less detached and analytical personal style he might have won over the public and his opponents in Congress. It may be true that Obama has made mistakes, but our disappointment with him ultimately reflects the mismatch between our expectations for presidents and the partisan realities of the contemporary era. The public and the news media still want someone who meets the mid-20th-century ideal for a modern president: a uniting figure who works across the aisle to build support for his agenda and commands public opinion from the bully pulpit. While this image was always mostly a myth - presidents typically struggle to move polls or legislators' votes - the political realities of the time did allow presidents to build more diffuse coalitions in Congress and attract broad public support when the circumstances were favorable. However, the political system that helped enable this approach is disappearing. The mid-20th century was a historical anomaly - a low point in polarization that was made possible by the ugly history of race in this country, which enabled the rise of a group of conservative Southern Democrats who functioned almost as a third party. After the civil rights movement, the parties realigned on the issue of race, setting in motion a return to the historic norm of polarization that prevailed in the late 19th and early 20th century. This process, which is transforming all of our nation's political institutions, has been supercharged by the way the parties have become more closely aligned with ideological movements than ever before. A result is what the political scientist Richard Skinner calls the partisan presidency. In this era, presidents are dividers, not uniters (to reverse Bush's famous phrase); their public appeal is deeply polarized along party lines and they depend overwhelmingly on the support of co-partisans in Congress to enact legislation. They are particularly vulnerable to obstruction from the opposition party, which can withhold support as congressional Republicans have done, denying the president the imprimatur of bipartisanship and producing legislative gridlock for which the president is often blamed. That's why it's a mistake to personalize Obama's failures so much, as his critics often do. Critics suggest that Obama is too aloof and hasn't done enough to solicit Republican support or build relationships with legislators. Both may be true, but as <mark>John Harwood</mark> recently noted in the New York Times, Bill Clinton's more successful outreach to his opponents didn't keep him from getting impeached. Likewise, Bush was more gregarious than Obama, but it didn't make him any more popular among Democrats once the post-9 / 11 glow had worn off. It's a common mistake to attribute other people's behavior to their inherent characteristics in this way. We seem especially prone to this pattern, which is known as fundamental attribution error, with presidents. But as recent history shows, our current political system tends to produce division and conflict no matter the circumstances. Comedian Chris Rock is ahead of most political analysts in recognizing this new reality. In a recent interview, he described how Bush adapted to this new political environment, saying Bush \"only served the people who voted for him .\" \"He literally operated like a cable network,\" he added, while Obama is \"a network guy .\" He explained: \"He's trying to get everybody. And I think he's figured out, and maybe a little late, that there's some people he's never going to get .\" As we approach the next presidential campaign, we need to stop asking who can achieve the unity that has eluded Obama. For better or worse, the partisan presidency is here to stay. There are some people the next president will never get, as Rock puts it. The question we should ask instead is whether the candidate we choose will - or can - govern well without their support. Alerts Text message notifications of news happening now. U.S. should examine how torture occurred to ensure that it never happens again 287 Letter: It's likely that mankind created the notion of God Copyright 1999 - 2014 - The Buffalo News copyright-protected material. Sorry, an unexpected error occurred. Please try again later.", "articleID": "2014122805_00021617_W", "names": {"John Harwood": ["Q21165869", "Q6238161", "Q6238165"]}}, {"date": "2014-12-28", "url": "http://www.independent.ie/entertainment/movies/ramirez-evil-role-exorcised-fears-30865921.html", "content": "<mark>Edgar Ramirez</mark> starred in horror film Deliver Us From Evil Comments The Venezuelan actor, who plays Spanish priest Mendoza in Scott Derrickson's thriller, admitted he got scared of paranormal activities after watching The Exorcist. \"I remember that was the first horror movie that I saw. I saw three or four scenes, and I was traumatised for three years,\" he said. \"It was very difficult for me to sleep and I didn't watch the whole thing, that's how strong my reaction was. Then 35 years later, they offered me this movie, so that was a way to end my childhood fears, by being the exorcist .\" <mark>Edgar</mark>, who stars opposite Eric Bana and Olivia Munn in the film, said there was some unusual happenings on set. \"(It was) probably just hypersensitivity. I was in a bar and I went to the bathroom, and I saw that the paper machine, the ones that give you toilet paper if you put your hand on it, was broken. And then suddenly it went on, it just turned on and gave me paper (even though) I was very far away from it,\" he recalled. \"A couple of hours later, I am back in the bathroom, I am alone, and I heard that the machine was broken and actually somebody from production had put some extra paper on the side for us. Then (the paper towel dispenser) went out again .\" The 37-year-old actor added: \"Other than that, one of my crosses broke from the first exorcism. A metal cross. I put it in my pocket, and when I pulled it out, it was broken. But I wasn't scared any more .\" Rebel Wilson: Cohen wanted me naked Rebel Wilson has revealed how Sacha Baron Cohen kept trying to persuade her to strip off for his new film, Grimsby. Film hardman Ray Winstone has revealed he wet himself when he was introduced to gangster Ronnie Kray - although he was only six months old at the time. Irish writer scripts Sarah Jessica Parker's new show \"Don't f *** ing insult the Irish people any more' - Liam Neeson won't move home to...Movies: Coming soon to a screen near you Netflix October releases - A Separation, Girl Interrupted, Homeland, and...Yellow weather warning: Temperatures to plunge to minus five degrees tonight Hospital sends Christmas babies home in hand-knitted Christmas stockings\" Don't f *** ing insult the Irish people any more' - Liam Neeson won't move home to...Taxpayer faces huge bill over funding of \"quangos' Mother-of-two stabbed seven times with potato peeler by Facebook\" friend' Bus assault victim to return to \"safer' Mexico after Dublin attack Adams rewriting of Provo history sees McAuley-types lionised by SF\" The Interview' review: Controversial gross-out satire is broad, bawdy and bad - but...Take our 100-question quiz of the major events of 2014 VIDEO: Jamie Foxx: Hard missing time with family VIDEO: Seth Rogen attends The Interview movie release on Christmas Day US movie fans queue around the block as The Interview finally...VIDEO: Penguins Of Madagascar, Annie, Night At The Museum 3, all big at...Now that UK cinemas are back open after Christmas, there...The Movie Show: Unbroken and Exodus: Gods and Kings Aoife Kelly is joined in studio by Geroge Byrne and Paul Whittington to take a look at two of the...VIDEO: One Direction's Best Moments of 2014 Take a look back at One Direction's best moments of 2014. From the awards to the...VIDEO: Seth Rogen speaks out on The Interview controversy Seth Rogen finally breaks his silence as Sony announces that The Interview will be released. VIDEO: Sony confirms release of The Interview Sony has announced a limited cinema release of The Interview, putting the comedy back on to...VIDEO: \"One more time' - Independent. ie reporters share their 2014 bloopers It's been a busy year in news, so it's understandable that there...VIDEO: Legendary Singer Joe Cocker Passes Away VIDEO: Barry Egan meets <mark>Louis Walsh</mark> VIDEO: Celebrities Get Festive for the Y100 Jingle Ball A host of celebrities brought Christmas cheer to Florida as they performed at the Y100 Jingle Ball. Video: Build Your Own Gaming PC 1: The Case We're taking a look at what it takes to build your own gaming PC. To start off we're focusing...VIDEO: Barry Egan meets <mark>Enda Kenny</mark> Barry Egan scores a rare interview with our great leader, <mark>Enda Kenny</mark>. VIDEO: Caroline Flack wins Strictly Come Dancing More than 11 million people watched Caroline Flack as she was crowned champion of this...VIDEO: <mark>Jack O'Connell</mark> says Angelina Jolie is loved in Derby Angelina Jolie will always have a fanbase in Derby thanks to a.. . VIDEO: Christmas nuptials: <mark>Elton John</mark> shares snaps of official wedding to David...Nine years after they first tied the knot in a civil ceremony,...The Script, The Coronas and Joe Duffy entertain crowds on Grafton Street From Shirley Temple to <mark>Robin Williams</mark>, the stars of music, stage and screen we lost in 2014 Deck the hair with boughs of holly - Beards are this year's Christmas Jumper Beards are this year's way to flaunt your festive feeling -...The best signs at today's #WaterCharges protest In pictures: Love/Hate Season 5 finale 10 actresses who could play Bridget Jones As reports suggest Reese Witherspoon could be replacing Renee Zellweger on the third...Love/Hate series five - the story so far Top 10 sexist ads - prepare to feel your blood boil...By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2014122806_00032218_W", "names": {"Edgar Ramirez": ["Q11290342", "Q273788"], "Elton John": ["Q16209157", "Q2808"]}}]