[{"articleID": "2011012420_00029953_W", "names": {"John Major": ["Q27957644", "Q47546458", "Q9559"], "Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"]}, "date": "2011-01-24", "url": "http://telegraph.co.uk/comment/telegraph-view/8279753/Gordon-Browns-poisoned-PFI-legacy.html", "content": "telegraph view: private contractors have made huge profits out of labour's private finance initiative, leaving taxpayers to foot the bill. figures obtained by this newspaper through freedom of information requests reveal the full, mind-boggling cost of the private finance initiative (pfi) upon which the last government relied to fund its public sector infrastructure projects. more than 900 schemes have been completed with a total capital value of? 56 billion - yet the amount the taxpayer will have to repay currently stands at? 229 billion. that is the kind of interest rate a sink-estate loan shark would be proud of. in one particularly egregious example of how not to negotiate a contract, the princess royal university hospital in bromley in kent cost the contractor? 118 million to build but the final cost to the nhs will be? 1.2 billion. the pfi was actually conceived by <mark>john major</mark>'s conservative government but it was during <mark>gordon brown</mark>'s decade-long stint as chancellor of the exchequer that it really took flight. by using private sector firms to build and manage public sector facilities, it allowed labour to proceed far more quickly with its hospital and school-building programme. it had the added attraction for the chancellor of keeping vast amounts of state spending off the government's books. in theory, such a scheme makes sense - but only if the contracts are expertly negotiated and rigorously managed. unfortunately, such disciplines are as rare as hens' teeth in whitehall. what we had instead was the economics of the mad house, with private companies pocketing enormous profits and leaving the taxpayer to spend the next half century paying off the bills. in an interview in september 2002, mr <mark>brown</mark> defended the pfi with the words: \"i've got evidence that we are achieving value for money .\" perhaps he would care to share it with us. last week, the commons public accounts committee reported that when considering new hospitals or housing, the department of health and the department for communities and local government were given no alternative to the pfi, regardless of value for money. the treasury, to its great discredit, appeared to be working hand in glove with contractors to drive deals through. it was selfish? and wrong? of lady warsi to give that speech"}, {"articleID": "2014092504_00002155_W", "names": {"Tony Stewart": ["Q380127", "Q3993311", "Q4648431", "Q56803689", "Q7823492", "Q7823493"], "Kevin Ward": ["Q15452481", "Q17489694", "Q6397719"], "Heather Brown": ["Q1592530", "Q57355022", "Q58218852"]}, "date": "2014-09-25", "url": "http://wtol.com/story/26622257/toledo-homeowner-waits-over-a-year-to-get-14000-patio-fixed", "content": "Toledo homeowner waits over a year to get $14,000 patio fixed meta content = \"2000-03-29 16:19:59\" > Call 11 for Action at 419-255-2255 if you are the victim of a consumer scam, fraud, or rip off. I want to fill out an official complaint Click here to e-mail the Call 11 for Action office with your consumer complaint. Click here to e-mail the Call 11 for Action office with your consumer complaint. meta content = \"2000-03-29 16:52:15\" > Are you interested in helping others with their consumer problems? Call 11 for Action can use your help. meta content = \"2014-09-24 18:43:30\" > Live at 3 p.m.: Announcement of grand jury finding on <mark>Tony Stewart</mark> fatal crash Live at 3 p.m.: Announcement of grand jury finding on <mark>Tony Stewart</mark> fatal crash Prosecutors in upstate New York said a grand jury was finished hearing testimony regarding <mark>Tony Stewart</mark>'s role in the on-track death of sprint car driver <mark>Kevin Ward</mark> Jr.. Prosecutors in upstate New York said a grand jury was finished hearing testimony regarding <mark>Tony Stewart</mark>'s role in the on-track death of sprint car driver <mark>Kevin Ward</mark> Jr. and its decision would be announced Wednesday. meta content = \"2014-09-23 20:50:33\" > Nightmare: Dad hears burglar on baby's monitor It sounds like a scene from a horror movie; A Thomasville man heard a burglar breathing over his daughter's baby monitor. The man and his family have been victims of multiple burglaries in the past couple months. It sounds like a scene from a horror movie; A Thomasville man heard a burglar breathing over his daughter's baby monitor. The man and his family have been victims of multiple burglaries in the past couple months. At the Mid-south Saw milling lumber yard, there was a cut of wood that jumped out to owner Daniel Turbeville. He said he saw something sacred as he was working and cutting slabs. \"Talking to a couple At the Mid-south Sawmilling lumber yard, there was a cut of wood that jumped out to owner Daniel Turbeville. meta content =\" 2014-09-24 03:02:02 \"> <mark>Heather Brown</mark> speaks for first time in nearly a year <mark>Heather Brown</mark> speaks for first time in nearly a year We first introduced you to <mark>Heather</mark> and Sean Brown of Gladewater in September 2012. <mark>Heather</mark> was 34 weeks pregnant and slipped into a coma. Her son, John, was delivered by c-section. We first introduced you to <mark>Heather</mark> and Sean Brown of Gladewater in September 2012. <mark>Heather</mark> was 34 weeks pregnant and slipped into a coma. Her son, John, was delivered by c-section. meta content =\" 2014-09-23 22:56:33 \"> Wood County Health Department wants community to be aware of the signs and symptoms of viral meningitis A fifth grader from BG Schools was diagnosed last week. It is currently the only confirmed case and the Health Department is hoping it stays that way. Lumber yard owner finds Jesus in tree trunk At the Mid-South Sawmilling lumber yard, there was a cut of wood that jumped out. At the Mid-South Sawmilling lumber yard, there was a cut of wood that jumped out. Shocking! Dad hears creeper in baby's bedroom Video: Obama salutes while holding coffee cup A video of President Obama saluting Marines with a cup of coffee in his hands causes a stir online. A video of President Obama saluting Marines with a cup of coffee in his hands causes a stir online. Sheriff, BCI excavate at Vickery residence as part of investigation Officials executed a search warrant at a residence near High Street and County Road 268 on Tuesday. A prosecutor says a new tip led to the execution of the search warrant, but would not provide details about that tip. <mark>Heather Brown</mark> speaks for first time in nearly a year TOLEDO, OH (Toledo News Now) - A Toledo homeowner spent thousands of dollars on a custom-made patio when only three month later it started to crack. Bill Strall's life has revolved around keeping tabs on the work done at his home .\" I called him on April 6 at 2:15 left him a message, \"said Bill. After several failed attempts to reach Concrete Images Owner Troy Musselman, Bill felt like he had no choice but to pick up the phone again .\" I called him back on May 23 at 11:34 and left a message, \"said Bill .\" Called him again at 2:38 and left him a message. \"The problems between Bill and Troy Musselman go back to December 2012, that's when Bill says he noticed several cracks in the concrete spreading throughout his patio. Bill says he paid Troy a little over $14,000 for it just three months prior .\" When he went to pour the patio, the patio was fine and I told him there were two things, I didn't want it to pool water and I didn't want it to crack, \"said Bill. He says he called Troy just as soon as he realized his wishes were not being meant. Bill says Troy came out in March of 2013 and looked at the patio .\" He offered me a one-time deal, \"said Bill .\" He said,' I tell you what you pay for the concrete and I'll supply the labor .' \"Bill says he did just that, paying $750 for the concrete and delivery costs. He says Troy then told him to call him back in September when business slowed down and he would fix the cracks. Bill says it was deja vu all over again .\" I gave him a call, left a message, never heard back, \"said Bill. So Bill called Toledo News Now's Call 11 For Action Team. Troy didn't want to go on camera but he says that he offered to fix the cracks but Bill declined. He says that cracks are something he can't control. Once the Better Business Bureau got involved Troy offered to give Bill a $500 check for his purchase of the concrete and by Sunday Bill had his money .\" I'm happy that channel 11 got involved and you got me results within a week, \"said Bill. The BBB says make sure to get written estimates of everything, that includes work that may need to be re-patched, make sure the contractor can give a work schedule and ask if they are bonded or insured."}, {"articleID": "2011101005_00092557_W", "names": {"Sean Lee": ["Q12603093", "Q3476735", "Q53091300"]}, "date": "2011-10-10", "url": "http://post-gazette.com/pg/11283/1180995-143-0.stm?cmpid=psu.xml", "content": "print lb hodges helps fuel lions' five-sack game by ron musselman, pittsburgh post-gazette penn state running back joe suhey, right, leaps into the arms of tight end kevin haplea after haplea scored a touchdown, the only one of the game, against iowa in the fourth quarter saturday at beaver stadium. university park, pa .--gerald hodges arrived at penn state as a hard-hitting safety in 2009. he was moved to linebacker three games into his freshman year and has been there ever since. hodges, the nittany lions' starting weakside linebacker, helped launch an all-out blitz saturday against iowa's passing attack at beaver stadium. penn state was clinging to a 6-3 lead early in the fourth quarter when hodges made a game-changing play. he blitzed up the middle on a third-and-7 call from the 45 and sacked iowa quarterback james vandenberg for a 7-yard loss and forced the first fumble of his career, which strongside linebacker nate stupar recovered at the iowa 49. eleven plays later, quarterback matt mcgloin cashed in on the turnover, hitting backup tight end kevin haplea with a 2-yard touchdown pass to seal the 13-3 victory against the hawkeyes. \"[defensive coordinator tom] bradley was blitzing like crazy,\" hodges said. \"every play was a blitz and we were loving it. every time we got to blitz, we were smiling .\" it was another chance for us to make a good play. \"hodges sprinted off the field after the play and jumped high in the air to chest-bump with graduate assistant elijah robinson .\" he always talks to me about my pass-rushing; he always works with me on my pass-rushing, \"hodges said .\" so, he gave me a chance [saturday], and once i finally got [the sack], he come out there and gave me a big hit. \"the sack by hodges was one of a season-high five registered by the penn state defense, which is expected to get injured cornerback d'anton lynn (concussion) back this week. linebacker khairi fortt had 1 1/2 sacks, defensive tackle devon still and defensive end <mark>sean</mark> stanley each had one and defensive end eric latimore was credited with half a sack. strong safety drew astorino said hodges, a junior, played a big role in the victory .\" he did an unbelievable job, \"astorino said .\" we sent him on a lot of weakside blitzes and he got to the quarterback. he did his job and put pressure on the quarterback. \"he was huge for us .\" penn state (5-1, 2-0 big ten), which returned to the usa today coaches poll sunday at no. 25, will welcome purdue (3-2, 1-0) to beaver stadium saturday for homecoming. hodges, 6 feet 2 and 234 pounds, leads the lions defense with 36 tackles. he also has 3 1/2 tackles for loss and is tied with still and stanley for the team lead with two sacks. \"gerald's just a heck of an athlete,\" still said. \"he's all over the field. the defensive linemen are able to take more chances because we've got guys like him back there that can make up for it .\" hodges, from paulsboro, n.j., has suffered some minor bumps and bruises this year, ranging from a sprained ankle to an injured elbow. a year ago, he sustained a hairline fracture of his left leg on the opening kickoff in the second game at alabama and missed the next four games. he returned oct. 23 against minnesota and finished with 31 tackles. he played in every game as a freshman, mostly on special teams. \"i feel as though i came back better and stronger this year and even more mentally stronger [from the leg injury],\" hodges said. \"it was frustrating, but i feel like some good came out of it, too .\" hodges eventually would like to play strongside linebacker, following the same path that was paved by former penn state standouts <mark>sean lee</mark> and navorro bowman on their way to the nfl. \"i look at those guys and i'm like .\" these guys did it. i can do it,' \"hodges said .\" i just try to take what i can do and put it with the technical part and the instinct part, put them together, and just try to play football. \"at the same time, the position i am, it's kind of hard to do that. my time will come. i just keep praying, keep my mind clear and my frustration down and when you're playing, you want to get involved .\" we've got a good defense--you want to be a big part of that defense. \"ron musselman's penn state blog and videos are featured exclusively on pg +, a members-only web site from the pittsburgh post-gazette. our"}, {"articleID": "2017060818_01071598_W", "names": {"Jill Scott": ["Q10896", "Q232592", "Q23661775"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Tony Bennett": ["Q19946119", "Q23048751", "Q296729", "Q3993198", "Q4772102", "Q7821881", "Q7821882", "Q7821883"], "Marvin Sapp": ["Q4008540", "Q6778477"], "Faith Evans": ["Q236318", "Q5431183"]}, "date": "2017-06-08", "url": "http://www.courierpostonline.com/story/entertainment/2017/06/08/collingswoods-matt-cappy-finds-his-own-groove/377609001/", "content": "Buy Photo \"He always stood out,\" says Matt Cappy's fourth grade band director Bill Garton. Cappy of Collingswood plays his trumpet as he poses for a portrait inside the Gradwell House recording studio in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Matt Cappy's Haddon Heights rehearsal room could barely contain the soulful grooves and jazz jams pumped out by the sound system. The Collingswood trumpet player pushed the volume a tick higher with every track playing on his first album due to release this month. More: Free concerts in park feature heavy-hitters More: Gary Puckett & The Union Gap to play Pennsauken More: Big concerts set for South Jersey Lit by a single bulb in a lamp made from an old trumpet, Cappy, 43, swayed, bobbing his head to the thick bass lines, not noticing his fingers played along with his trumpet solos on the track. The Berlin Township native began playing professionally nearly two decades ago, backing super stars like <mark>Jill Scott</mark> and Jay-Z. Now it's Cappy's turn out front. His first album, \"Church and State,\" releases June 16, days before he heads out on a summer tour playing with <mark>Jill Scott</mark>. \"I want people's heads moving, not just sitting there watching me playing 1,000 notes,\" Cappy said. Buy Photo Matt Cappy's trumpet waits for his return inside his rehearsal space at Gradwell House Recording in Haddon Heights. Cappy's first album, \"Church and State,\" releases June 16, days before he heads out on a summer tour playing with <mark>Jill Scott</mark>. (Photo: Joe Lamberti/Staff Photographer) In The Gradwell House rehearsal space--a small, gray-painted room with a lamp, keyboard and not-yet assembled drum kit--his music blared. His lips moved, mouthing his parts of the melody. The record--much like this career--\"is about the groove,\" he said. \"I put a lot of years into this record,\" Cappy explained. The album's final track--titled \"The Last One\" --was the first song he wrote. That was a decade ago, he noted, yelling over the song as it played. His professional career began a decade before that, he said. \"We have great musicians in this area. The cover band scene is amazing. And the average wedding band is really good. But to punch through and have a national artist. We haven't done that yet .\" Buy Photo Albums upon which Matt Cappy has played trumpet line the walls of his rehearsal space at Gradwell House Recording in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) Hooking up with <mark>Scott</mark> in the late 1990s through Philly's jazz clubs and hip-hop funk scene catapulted his career. <mark>Scott</mark> affectionately nicknamed her band Fatback Taffy, Cappy said. A year after he played on <mark>Scott</mark>'s first album \"Who is <mark>Jill Scott</mark>?,\" she and Fatback Taffy were playing Wells Fargo Center-sized sports arenas. In 2002, he was part of her live album that went gold. \"I owe everything to <mark>Jill Scott</mark>,\" he said. \"I was with her literally for 10 years straight .\" Their first summer show together is June 23 in Virginia. Since, he's played on <mark>Michael Jackson</mark>'s double platinum-selling \"Butterfly\" record, and on recordings for other platinum-selling artists, like Musiq Soulchild. Cappy--GRAMMY's Philadelphia chapter board governor since 2003--has performed with The Roots, Mos Def, Common, Aretha Franklin, The O-Jays, The Moody Blues and <mark>Tony Bennett</mark>, and recorded with Earth, Wind and Fire, <mark>Marvin Sapp</mark>, and <mark>Faith Evans</mark>. And that's the short list. Buy Photo Matt Cappy of Collingswood plays his trumpet inside the Gradwell House recording studio in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) In February, DJ Jazzy Jeff invited Cappy and tons of other highly-regarded musicians and artists to his Delaware studio to record \"Chasing Goosebumps,\" an album curated from top to bottom in seven days. Cappy plays on a half-dozen tracks, recording at Jeff's studio through the night to meet the deadline. Cappy's album's title track \"Church and State\" was recorded at the same studio. Through marathon globe treks and arena performances, Cappy still remembers his first performances--with Dwight D. Eisenhower Middle School's band in Berlin. \"The percentage of kids in band in this blue-collar town,\" he remembered. \"I would go to my sister's concerts, and the whole town showed up for the band. I was hooked. I wanted to be in it as soon as I could .\" He knew early--about fourth grade--the jazz band is where he belonged. \"He always stood out,\" his fourth grade band director Bill Garton told the Courier-Post \"He had fire in his eyes. He just wanted to be great from fourth grade on .\" Buy Photo Matt Cappy of Collingswood plays his trumpet inside his rehearsal space at Gradwell House Recording in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) Cappy played under Garton's direction in middle schools, then again at Overbrook High School. Cappy--a former member of Berlin-based South Jersey String Band--also learned saxophone. Garton, a retired professor at University of the Arts, oversaw Cappy's student-teaching rotation at Berlin Borough schools. Cappy continues to give lessons to South Jersey student musicians. Garton will be in the audience Thursday at 2300 Arena in South Philadelphia for Cappy's album release concert. \"He's never forgotten his roots,\" Garton said. \"As a teacher, you really do appreciate that. You start the kids off with everything you got, then you wait and see .\" Cappy's Camden County roots get a nod on the record. The track \"Rose Lane,\" an Afro-beat-style song already played on London radio stations, is a nod to the Berlin Township street where he grew up--North Rose Lane, he said. \"Eight Five Six\" --a reference to South Jersey's area code--shows how his jazz playing has matured since Eisenhower and Overbrook. \"Sacramento,\" written in California, is a shout out to Overbrook High School, when teenage Cappy jammed to Power 99 and Stevie Wonder. Like the song, Overbrook is \"soulful, and a mix of all people,\" he explained. \"I've been in the music business this long. I've been part of big ships. I'm thinking of myself like a start-up business,\" he said. \"It's really exciting, and it's a little scary ....But what I learned from the <mark>Jill Scott</mark> model--you need to make great music and back it up live .\" How to listen: Find Matt Cappy's debut album \"Church and State\" on iTunes and Amazon.com starting June 16. For more on the musician visit www.mattcappy.com Carly Q. Romalino; (856) 486-2476; cromalino @ gannettnj.com Facebook Twitter Google + LinkedIn GALLERY: Local trumpeter Matt Cappy Fullscreen Post to Facebook Posted! A link has been posted to your Facebook feed. Buy Photo Matt Cappy of Collingswood plays his trumpet inside his rehearsal space at Gradwell House Recording in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Buy Photo Matt Cappy's trumpet waits for his return inside his rehearsal space at Gradwell House Recording in Haddon Heights. Cappy's first album, \"Church and State,\" releases June 16, days before he heads out on a summer tour playing with <mark>Jill Scott</mark>. Joe Lamberti/Staff Photographer Fullscreen Buy Photo Matt Cappy of Collingswood plays his trumpet inside the Gradwell House recording studio in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Buy Photo Albums upon which Matt Cappy has played trumpet line the walls of his rehearsal space at Gradwell House Recording in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Buy Photo \"He always stood out,\" says Matt Cappy's fourth grade band director Bill Garton. Cappy of Collingswood plays his trumpet as he poses for a portrait inside the Gradwell House recording studio in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Like this topic? You may also like these photo galleries: Replay 1 of 5 2 of 5 3 of 5 4 of 5 5 of 5 Autoplay Show Thumbnails Show Captions Last Slide Next Slide CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http: //www.courierpostonline.com/story/entertainment/2017/06/08/collingswoods-matt-cappy-finds-his-own-groove/377609001/"}, {"articleID": "2011122921_00091623_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2011-12-29", "url": "http://blog.zap2it.com/pop2it/2011/12/elly-may-clampett-donna-douglas-settles-barbie-lawsuit.html", "content": "donna douglas, who played elly may clampett on \"the <mark>beverly</mark> hillbillies,\" has settled her lawsuit over a barbie doll that uses elly may's name and likeness. the actress sued cbs and toymaker mattel back in may, claiming the company was \"engaging in the unauthorized use of [her] name, likeness, image and attributes\" as elly may for the doll, which was released a year ago. the lawsuit sought at least $75,000. it has been settled out of court, but details of the amount of the settle are being kept confidential, reports the ap. the comedy, about the black gold-findin' clampett family that moved to <mark>beverly hills</mark>, ran on cbs for nine seasons, with douglas playing elly may in all seasons. she claimed cbs and mattel needed her approval for the doll, but the network and toymaker claimed they didn't need her approval because cbs holds the exclusive rights to the character. we hypothesized when the lawsuit was filed that perhaps the doll was modeled after erika eleniak ..."}, {"articleID": "2018031418_00303343_W", "names": {"Matt Russell": ["Q16217590", "Q47349679", "Q6789277"]}, "date": "2018-03-14", "url": "https://www.gladstoneobserver.com.au/news/theyre-only-human-towns-cops-thank-officers-for-he/3361114/", "content": "Gladstone's police station are honouring their peer support officers this week with a morning tea to say \"thanks'. Sargent Kieran Barton, Chaplain Glenn Louttit, senior constable Wendy Brooks, acting inspector Tony Poli and peer support officer <mark>Matt Russell</mark>. Hannah Sbeghen News They're only human: Town's cops thank officers for helping hands by Hannah Sbeghen 15th Mar 2018 4:30 AM 0 THEY deal with ugly crimes so we don't have to, but who counsels a police officer at the end of a hard day? The Gladstone police station is recognising and honouring a group of 13 peer support officers this week who volunteer their free time to support struggling officers. Peer support officer <mark>Matt Russell</mark> said this week was one which recognised the hard days and strong support in the police network .\" It's a voluntary role that we do on our days off and as PSO's we need to make ourselves available to police officers who need our support, \"he said .\" I think people forget that police officers work shifts and juggle families at the same time. It's harder than it looks and when a rough day comes along that upsets you, you need someone to listen to you. \"Senior constable Wendy Brooks said each peer support officer (PSO) had to undertake extensive training course with yearly updates .\" There are funds being given to each patrol group and it's important because these are the people who understand us the best, they see what we do-day-in-and-day-out, \"she said .\" Our officers face a mix of issues that are unique to their role, everything from struggling with an emotional job to their own family life. But the best thing is that it's all confidential and there is no office gossip. \"Glenn Louttit has been counselling Gladstone police for the past six-a-half years and said some of their jobs take a horrendous emotional toll that outsiders would never see .\" There was a recent murder in Rockhampton and when the officers came back after their job, some were emotionally torn. These people are human too and it's important to share their burdens and lows with someone they can trust. \"They have an enormous amount of pressure on them to be good role models so they can't go to the pub and have a beer like the rest of us .\" Mr Louttit who is also a church minister, said he was honoured to be a release to the pressure. \"They keep our community safe and it's important we give them our shoulder,\" he said. 0"}, {"articleID": "2018011612_00337538_W", "names": {"Dan Murphy": ["Q28025982", "Q3013155", "Q5214076", "Q5214077", "Q5214078", "Q5214079"]}, "date": "2018-01-16", "url": "https://www.drovers.com/article/murphy-eagle-soars", "content": "<mark>Dan Murphy</mark> January 16, 2018 06:00 AM The return of the bald eagle shows the benefits of a useful regulation. (Photo: freeimages.com) One of underappreciated pleasures of living near the shores of Puget Sound in northwest Washington state is the annual springtime spectacle: watching juvenile bald eagles attempting to fend off a determined flock (murder?) of crows working as a team to drive the eagles away from their nesting areas. Sometimes these aerial battles, which literally take place right above my backyard, last as long as four or five minutes. Surprisingly, the young eagles are not nearly as adept as you might imagine, and the clever crows use their superior agility and numbers to harass the eagles until they're forced to fly away. Of course, when I lived back East years ago, the sight of a bald eagle, juvenile or otherwise, would have been front-page news, because back then, eagles were a species that was threatened with extinction. The reason proved to be straightforward: Widespread use of the potent pesticide DDT (dichloro-diphenyl-trichloroethane). The problem was that DDT is solvent in fats or oils. As a result, it bio-accumulates in the fatty tissues of animals, especially those at the top of the food chain, such as predators like eagles, hawks and condors. In humans, DDT exposure can cause damage to the liver, the nervous system and even birth defects. With eagles, their numbers began declining sharply in the 1960s and 1970s because the DDT they were ingesting made their eggshells thin and fragile, and the birds weren't able to reproduce effectively. Now just this year, the symbol of the nation has been removed from the protected list by the Washington Fish and Wildlife Commission, which acknowledged the raptor's comeback from threatened extinction. \"It's a real success story,\" agency spokesperson Hannah Anderson told news reporters. A Regulation that Worked It's easy to demonize the mass of federal regulations, and truthfully, many are cumbersome and problematic for businesspeople. EPA, in particular, has been excoriated by agricultural interests as an agency whose authority ought to be eviscerated, since its agenda (allegedly) is anti-industry. Blanket condemnation of any federal agency is counterproductive, however, and in the case of the bald eagle, as well as other avian species, EPA's regulatory authority turned out to be downright heroic. That's because in 1972, EPA banned the use of DDT, not only because of its impact on wildlife, but also because its toxicity was determined to be seriously problematic for people, as well. It took several decades, but once the pesticide was removed from the environment, the populations of eagles and other raptors began to rebound. In fact, a recent study by the state of Washington identified 1,334 eagle nesting sites, mostly in the northwestern part of the state where there are numerous lakes and salmon-bearing rivers. And talk about an impressive lifestyle: Bald eagles instinctively return from northern Canada and the Arctic each spring to the same nest or nesting territory, and those nests are often four to six feet across and can weigh as much as 2,000 pounds. The point of this feel-good story is that the American bald eagle, which appears on U.S. currency, on the official Great Seal of the United States (holding a bundle of arrows in one talon and an olive branch in the other) and in too many numerous patriotic depictions to catalog, is alive and well as a result of government regulation. \"In some ways, [their recovery] was an easy success story,\" Ruth Milner, a regional biologist for Washington's Fish and Wildlife Commission, told The Herald newspaper. \"We identified their problem and removed it from the environment .\" Granted, most regulatory edicts aren't as clear-cut in their impact as the DDT ban, nor as beneficial to both industry and the public. But the backstory of how the bald eagle journeyed from near-extinction to full recovery is a cautionary tale for those who reflexively oppose all government regulations as being intrinsically bad. What would have been bad is if the majestic bird that for 235 years has served as our national symbol had perished from these United States. Editor's Note: The opinions in this commentary are those of <mark>Dan Murphy</mark>, a veteran journalist and commentator. PREV Tally Time: Preparing for Calving Season Related on Drovers Thompson-Weeman: Refresh Your Hiring Procedures for the New Year Mon, 01/15/2018 - 10:30 by Hannah Thompson-Weeman <mark>Murphy</mark>: Bad Move for the Wrong Reasons Mon, 01/15/2018 - 10:00 by <mark>Dan Murphy</mark> Canada Welcomes Trump Suggestion of NAFTA Deadline Extension Fri, 01/12/2018 - 12:40 by Reuters Staff"}, {"articleID": "2017121517_00974154_W", "names": {"Whitey Ford": ["Q1345775", "Q453048"]}, "date": "2017-12-15", "url": "http://www.detroitnews.com/story/sports/mlb/tigers/2017/12/15/tigers-frank-lary-yankee-killer-dies/108629296/?src=rss", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Twitter Google + LinkedIn Pinterest Tigers' Frank Lary, \"The Yankee Killer,' dies at 87 Lary won 128 games in his 12-year career, with 28 of those coming against the Yankees. Post to Facebook Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Long-time Tigers pitcher Frank Lary, with 28 of his 128 career wins coming against the New York Yankees to earn him the nickname\" The Yankee Killer, \"died Wednesday in his home state of Alabama. He was 87. Lary pitched 12 seasons in the major leagues, from 1954-65, and nearly 11 of them with the Tigers. For his career, the right-hander was 128-116 with a 3.49 ERA. Against the Yankees, he was 28-13 with a 3.32 ERA in 56 games (49 starts). That included three shutouts, and he also had two of his 11 career saves against the Yankees. At Yankee Stadium, he was 12-6 with a 3.11 ERA in 24 games (21 starts).\" The Detroit Tigers are saddened to learn of the passing of Frank Lary, \"the ballclub said in a statement .\" A three-time All-Star and a Gold Glove winner in 1961, Frank spent 11 years of his 12-year major-league career in Detroit. The Tigers organization extends our deepest sympathies to Frank's wife, Emma, and their family. \"Lary, a native of Northport, Ala.--where he still lived when he died--broke into the majors in 1954, after a successful run at the University of Alabama, which he helped to its first College World Series appearance in 1950. He signed with the Tigers organization for a $6,000 bonus, and his first full season in the major leagues was 1955, when he was 14-15 with a 3.10 ERA. The next year, he won 21 games in finishing 17th in the American League MVP voting. His best season was 1961, when he was 23-9 with a 3.24 ERA and a league-best 22 complete games. He was third in the Cy Young voting, behind winner <mark>Whitey Ford</mark> of the Yankees and Warren Spahn of the Milwaukee Braves. By today's standards, Lary probably would've won, given his WAR (4.3) was higher than <mark>Ford</mark>'s and Spahn's .\" He is mean on the mound and a joker off it, \"Sports Illustrated wrote in a 1961 profile of Lary, who also had nicknames\" Taters \"--after he once placed an order on a dining cart for\" Taters, \"or potatoes--as well as\" The Mule. \"Lary also could hit a little bit, with six home runs and 54 RBIs in his career. His most memorable homer came against--you guessed it--the Yankees. On May 12, 1961, at Yankee Stadium, the game was tied at 3 when Lary led off the top of the ninth inning with a solo shot to left field. He then worked the bottom of the ninth inning for the complete-game victory. Lary had brief stints with the New York Mets, Milwaukee Braves and Chicago White Sox after departing the Tigers in 1964. He coached and scouted briefly following his 1965 retirement before returning home to start a construction business. Lary's older brother, Al, played briefly in the major leagues, as a pitcher with the Chicago Cubs in 1954 and 1962. He died in 2001. Lary was the youngest of seven boys, all of whom were taller than his 5-foot-11 frame .\" That's one thing that made him so competitive, \"Joe Lary told the Tuscaloosa News .\" He didn't want his older brothers showing him up in sports. \"According to the Tuscaloosa News, a funeral service will be held at 2 p.m. Saturday in Northport, just south of Tuscaloosa. tpaul @ detroitnews.com twitter.com/tonypaul1984 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE"}, {"articleID": "2010040100_00132502_W", "names": {"David Llewellyn": ["Q16193717", "Q5236684", "Q5236689", "Q5236691", "Q681560"], "Scott Mclean": ["Q21622011", "Q7436835", "Q7436836"]}, "date": "2010-04-01", "url": "http://abc.net.au/news/stories/2010/04/01/2862269.htm", "content": "full coverage at abc.net.au / elections \"email activists say election result a vote for forests tasmania's wilderness society believes the state election result is a clear rebuff for old-style forest policy. the group says the resources minister, <mark>david llewellyn</mark>, supported the gunns pulp mill and lost his seat in lyons to fellow labor candidate rebecca white who campaigned on forest\" renewal \". the society's vica bayley says voters rejected infrastructure minister graeme sturges, franklin labor mp daniel hulme and forestry union official <mark>scott mclean</mark> for the same reasons .\" this is a clear mandate for change coming from the voters. they want to see politicians leaving old-style policies, old-style thinking behind and they want to start seeing the politicians put the interests of the community before those of timber companies, \"he said .\" they really do need to embrace the change that markets are bringing upon the industry here and protect the forests and create an industry that all tasmanians can be proud of. \"mr <mark>mclean</mark> says the claims are rubbish .\" well that's to be expected from the wilderness society but the reality is all sides of politics had really good candidates in this election as they have in previous elections and the people of the respective electorates have made their decision in relation to these things, \"he said. from the court room to the play room: a corporate lawyer has quit his day job to build his own lego land. it may look like a giant treble clef, a massive shisha pipe or even a rollercoaster. either-way, the orbit is the uk's olympic sculpture for 2012 .\" policy on the run?' health minister nicola roxon responds to the ama's criticisms that the government policy will erode doctor-patient relationships. fire and ice: lava continues to spew out of a mountain in southern iceland. australia's most expensive painting, sidney nolan's first class marksman, has found a new home at the art gallery of nsw. rba governor surprises again by speaking about his christianity and how it drives his role as a central banker. experts warn australia could lose up to half of its agricultural science and business professionals in the next 5 years. this service may include material from agence france-presse (afp), aptn, reuters, aap, cnn and the bbc world service which is copyright and cannot be reproduced."}, {"articleID": "2017100217_00646112_W", "names": {"Peter Wilson": ["Q15538474", "Q17061111", "Q20641644", "Q21464402", "Q23415689", "Q39073329", "Q50654409", "Q7177736", "Q7177741", "Q964569", "Q965062"]}, "date": "2017-10-02", "url": "http://www.thedp.com/blog/under-the-button/2017/10/engineering-chair-transfers-to-mit", "content": "Satire Published 7 minutes ago This Student Was Elected to Represent the School of Engineering and Applied Sciences. Then He Transferred to MIT. By Alex Xu Photo by Pixabay / / CC0 Creative Commons All newly elected Class Board Engineering Chair <mark>Peter Wilson</mark> (E' 20) wanted was to serve his engineering class. He campaigned hard with concrete, positive goals, and was lauded by his classmates as a candidate with a strong vision and detailed steps to get him there. Naturally, he was voted into office and began his Engineering leadership immediately. \"Once I was appointed the Engineering Chair, I sat down and really thought about what Engineers want. Part of my job as the Engineering Chair is to be able to empathize with the Engineering class, to really be able to put myself in their shoes and think what they're thinking. And the more I talked to more my friends, the more I realized what they want. MIT is just so much better for engineering .\" <mark>Wilson</mark> was notified last Thursday of his acceptance into MIT's transfer class of 2021 three hours after he was elected into office. \"It was a good run,\" he said. <mark>Peter Wilson</mark> plans to take the offer and transfer to the Massachusetts Institute of Technology next month. Therefore, he'll will be stepping down as the Engineering Chair for the sophomore class. \"I don't think of it as abandoning and leaving my class. I'm simply realizing the desires of a typical student in Penn Engineering. When I'm there, I'll be receiving such a better tech education. I know my class will understand...it's what they would've wanted .\" Sophomore Rachel Myers (E' 20) spoke out about her concern. \"This is the third member of our Class Board that's left. I'm starting to think our class office doesn't even care about us. Who even is electing them?\" <mark>Wilson</mark> has indicated interest in running for class office once he gets to MIT."}]