[{"articleID": "2019022708_00751320_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2019-02-27", "url": "http://www.gamereactor.eu/games/69413/FIFA", "content": "FIFA 18 REVIEW. Written by Ricardo C. Esteves on the 30th of May 2018 at 14 \"The free update isn't quite as good as a game created from the ground up especially for the World Cup, but it comes very close .\" 0 REVIEW. Written by Ricardo C. Esteves on the 29th of September 2017 at 12 \"Unlike FIFA 13 on Wii U, this version of FIFA 18 is far from being a disappointment .\" ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of August 2018 at 10 Actors and esports pros celebrated the charity initiative. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 17th of August 2018 at 11 He spoke with the British Esports Association recently. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 14th of August 2018 at 10 The digital viewership saw a major increase. 0 ESPORTS. Written by <mark>Mike Holmes</mark> on the 6th of August 2018 at 10 The new FIFA 18 world champ crowned at the O2 in London."}, {"articleID": "2019052321_00251936_W", "names": {"Gretchen Peters": ["Q4818845", "Q51799886"]}, "date": "2019-05-23", "url": "http://blogs.houstonpress.com/music/things-to-do-jaimee-harris-will-perform-at-mucky-duck-with-mary-gauthier-11295374", "content": "Print Article A A There are professions as old as mankind that stand the test of time due to our dependence on them. Musicians make that list and Jaimee Harris knew this was the life for her when she was a little girl in Waco. Her father would fill her ears with music and take her on the road, often playing show in Houston with his cover band and letting young Harris take the stage during intermission, if the bar didn't kick her out first for being underage. Harris, who will appear at Mucky Duck on May 30, grew up in the Clear Channel dominated airwaves of Waco and made it her mission to seek out quality artists who focused on songwriting as a craft. She would spend countless nights at home studying the songs of others in her bedroom and teaching herself how to write. When a friend told her about the bustling music scene in Austin, Harris packed it up and moved on down. \"My heroes and people that I look up to, they are in Austin. I literally got convinced to move to Austin because a guy pointed at Congress and said\" There's a club down there where James McMurtry plays twice a week for less than ten dollars .' So many of the artists that I gravitated towards when I was learning to write songs were all there. \"says Harris. Her passion for the craft of songwriting was instantly recognizable to the artists she sought out and she was quickly embraced by the core of Austin's singer songwriter community. People who she had admired from afar back in Waco were now taking her under their wing, including the late, great Jimmy LaFave .\" I was really attached to his music when I was learning how to write my own songs and learning how to play guitar so the opportunity to get to work with him years later was such a joy for me and then to have a friendship with him and to have him as a mentor, obviously was such an unbelievable dream. \"Two years ago, Harris kicked off LaFave's final concert in Austin; a gut wrenching, soul shaking farewell concert that he organized himself to say goodbye to the city that had embraced him so warmly. LaFave passed away just days after sharing nothing but love on stage that night .\" There's only one of him. I remember after Jimmy left the stage I was standing there with Ray Bonneville, we stood together and we looked at this spot where Jimmy had been. It was like when you see a shooting star in the sky and you keep looking at that spot expecting that to happen again, but you know that it won't. \"Harris adds,\" Jimmy was such a great connector of people. He's how I got connected eventually to <mark>Gretchen Peters</mark>, Eliza Gilkyson and eventually Mary Gauthier. There are still people that I meet as I tour across the country that I'm connected to from Jimmy. \"LaFave guided Harris toward living artists but also pushed Harris to study artists of the past and gave her lessons in all things Woody Guthrie .\" He was the one who sparked my interest and it grew into a minor obsession. \"Harris admits with a chuckle. This year will be her fifth year performing at the Woody Guthrie Folk Festival in Okemah, Oklahoma. A unique experience to say the least; the small town only has one hotel and it gets packed to rim with musicians who come to honor the patron saint of songwriting, Woody Guthrie. LaFave also lent his vocals to the title track of his friends debut album, Red Rescue .\" Jimmy came in to sing on it and at the time we knew that he probably wasn't going to be alive by the time was released. \"says Harris .\" He was such a part of my musical fabric that it still blows my mind that it happened, that he sang on my record. \"\"Red Rescue\" tells the unfortunate and common tale of someone wanting to save another person from their situation without considering that sometimes people don't want to be rescued or don't even realize they need help. The song is based on a true story told to Harris by a friend discussing his ex wife. \"That song was about somebody else but this is a central theme of the record; you can't be saved from your own darkness by somebody else, you have to put in the work. Sometimes that does mean asking for help, but that part has to be voluntary .\" Harris knows a thing or two about dark times and described how music has helped her to progress in life, \"It has given me an opportunity to be a part in a world where I might not be able to function so well without it .\" In her first years in Austin she battled with alcohol and substance abuse and ended up in jail twice. After her second stint she knew it was her responsibility to get her act together. Harris got the usual runaround from state departments and insurance companies on her quest for support towards sobriety. Harris learned firsthand just how flawed the system is. One state employee even advised her to drink again so that she would be covered for a recovery program. \"I think a lot of people who don't have personal experience with the system, don't realize how many things are working against you .\" Her experiences have inspired Harris to reach out to marginalized communities who need more help then the state is willing or able to provide. \"My heart is really with prisons, women in prison specifically, and addicts in prison. I think the real crime is locking away addicts, not helping them and creating this inter-generational incarceration .\" Along with her touring partner, Mary Gauthier, the two women have performed at and worked with centers for women in Texas and Oklahoma. The two met at a songwriting workshop led by Gauthier, Gilkyson and <mark>Peters</mark>. Gauthier reached out to Harris and offered to be part of her support network if she needed it. \"I started realizing how amazing and powerful it is to have women that are in the business around you because you are able to talk about the issues that face you, what we are dealing with and how to move it collectively forward .\" says Harris of her budding friendships with so many women in the music business. If you like this story, consider signing up for our email newsletters. SHOW ME HOW email Both women are a perfect fit to share a bill, carrying the torch for songwriters of the past simply trying to make sense of the world and help others. \"The state of the world is in such chaos and when people are in pain great songs are written and those great songs tap into the universal experience of the people who are suffering. It brings us together and helps to create unity at a time when things could so horribly go off the rails. It gives us hope I think .\" Jaimee Harris will perform with Mary Gauthier Thursday May 30 at McGonigels Mucky Duck, 2425 Norfolk, early shows at 7 p.m. and at 9:30 p.m. $30"}, {"articleID": "2012042307_00057658_W", "names": {"William Fox": ["Q310012", "Q42325032", "Q58374473", "Q8009279", "Q8009280"]}, "date": "2012-04-23", "url": "http://.tbo.com/news/opinion/2012/apr/23/memeto1-whats-next-tampas-official-soup-ar-395476/", "content": "now that the tampa city council has pretty much launched what will surely become known as the \"sandwich wars\" with miami by declaring that the cuban sandwich is now tampa's \"signature sandwich,\" it might be time to move on. all credit for this goes to tampa city councilwoman yvonne capin for leading the charge to link tampa with this unique and splendid creation that historically was born in the kitchens of ybor city and west tampa. it was a little troubling the council went to the extreme of defining what a true cuban is, leaving out room for any variations - including the number of pickle slices you can have. i happen to like three slices instead of the traditional two, and i'd hate to think that would no longer be considered a real cuban. anyhow, you have to figure that when the republicans come to town in august, there will be vendors all around town advertising \"real tampa cubans,\" probably for about $15 a sandwich. * * * * * you know, now that we have our own sandwich, we ought to declare a few other things as ours before somebody else tries to horn in, especially if we can make a few bucks selling it to tourists. why not claim spanish bean soup as the \"original tampa soup,\" or maybe the guava turnover as the \"official tampa dessert .\" after all, tampa is the big guava, so why not claim what certainly is ours as much as anybody else's? i'm tempted, when the republicans show up, to have the frau whip up a few dozen sandwiches made with palmalito guava jelly they make down in palmetto and some crunchy peanut butter. didn't we invent peanut butter? i'll dress her up in a native tampa girl costume (t-shirt, shorts and flip-flops) and have her meander around the so-called \"clean zone\" downtown and see if we can make some christmas spending money. * * * * * finally, there is a stack of mail in the digital mailbag commenting on a column about retired brig. gen. c. <mark>william fox</mark> jr., who is undergoing physical rehabilitation at the james a. haley veterans hospital in tampa after being critically wounded in iraq. typical is david heckman of valrico, who writes, \"sometimes i muse about the achievements in my life and recognize they pale in comparison to those of the general. stories like this remind me of my three uncles and father-in-law, who fought the nazis in wwii and their heroics. one uncle is buried in normandy; another fought against rommel in north africa and escaped from a burning tank; and another was shot up and returned to america only to die months later from his wounds. my father-in-law fought in the battle of the bulge, got separated from his company and took shelter under a tree where his legs were frozen. he refused to have them amputated and miraculously recovered?. god bless people like general <mark>fox</mark> and thank you for choosing to write his story .\" "}, {"articleID": "2015121802_00224030_W", "names": {"Jerry Wilson": ["Q19586557", "Q20642537", "Q44746059", "Q6184664", "Q6184666"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-12-18", "url": "http://www.statesboroherald.com/section/76/article/71781/", "content": "Tough immigration plans not a must Poll shows GOP voters more concerned about terrorists, border security Text Size: Small Large Medium This Aug. 28, 2014 file photo shows demonstrators being arrested in front of the White House during a protest on immigration reform. For all of the ferocity and double-speak over immigration reform at the GOP debate, most Republicans say the issue isn't a decisive factor in their vote for president according to a new AP-Gfk Poll. deeply unpopular within their party. More broadly, more Americans, regardless of their political affiliation, favor than oppose a pathway to citizenship for immigrants who are in the United States illegally, the poll shows. By LAURIE KELLMAN and EMILY SWANSONAssociated Press WASHINGTON--Retired postal clerk <mark>Jerry Wilson</mark> likes what he hears from GOP presidential hopefuls about overturning President Barack Obama's executive order easing deportation policies against people in the U.S. illegally. But he'll choose a Republican presidential nominee based on other issues--keeping American companies from moving overseas, for one. Keeping would-be attackers out of the country, for another. \"America comes first when you're the president of the United States,\" the Batavia, Ohio, resident, 67, said. \"You do everything you can to keep America safe. What about migrants, people who are already here illegally? That's not a do-or-die issue to me .\" For all of the ferocity and double-speak on immigration reform at the GOP debate, most Republicans like <mark>Wilson</mark> say the issue isn't a decisive factor in their vote for president, according to a new AP-GfK poll. Even among conservative Republicans, more than half--56 percent--say they either prefer a candidate who would keep Obama's immigration action in place or that they can imagine voting for a Republican presidential hopeful who would. The survey shows that Obama's immigration actions last year, which allowed some immigrants to apply for temporary legal status, are a particular sticking point for Republicans. Seventy-three percent of them say they prefer to support the candidate who would undo those steps taken by this president, who is deeply unpopular within their party. More broadly, more Americans--regardless of their political affiliation--favor than oppose a pathway to citizenship for immigrants who are in the United States illegally, the poll shows. Even among Republicans--4 in 10 of whom oppose making citizenship an option for people in the country illegally--it doesn't seem to be a make-or-break issue in their choice for president. Four in 10 conservative Republicans and 3 in 10 tea party Republicans favor a path to citizenship for immigrants already in the country illegally. Notably, the results from the Dec. 3 through Dec. 7 survey are unchanged since the questions were last asked in April--even after months of strong rhetoric by Republican presidential candidates, including front-runner <mark>Donald Trump</mark>, who proposes deporting the 11.5 million people in the country illegally. The survey results are powerful data points for the GOP candidates with little more than six weeks to go before the first votes are cast in Iowa. Republican Sens. Marco Rubio and Ted Cruz, both children of Cuban immigrants, are locked in an extraordinary battle for second place in the nomination fight, in large part over their positions on immigration. Rubio's rivals had used his 2013 comprehensive immigration reform bill to cast him as a supporter of a path to citizenship for those here illegally. He hasn't backed off that idea but has abandoned the notion of comprehensive reform on the complex issue and emphasizes border security first. Cruz, meanwhile, is casting himself as an opponent to \"legalization .\" He proposed amendments to Rubio's bill that would have massively increased legal immigration--but mostly, he says, to try to kill Rubio's legislation. While illegal immigration may not be a deal-breaker for Republicans on a national scale, few issues are more hotly contested on the ground in early voting states like Iowa and New Hampshire. Some GOP conservatives often lash out at allowing people to stay in the U.S. illegally, producing an environment where Republican candidates like Rubio and Bush have been forced to distance themselves from their own more forgiving policies in the past. But the poll shows immigration may not be the most pressing issue on Americans' minds once voting begins in the GOP primary contest. \"No candidate fits everybody's view,\" said Terry Arnell of Tower Lakes, Ill., a retired insurance company manager who right now likes <mark>Trump</mark>. So, what will be Arnell's priorities come election day? \"Gun rights. Securing our borders and certainly, securing as much as we can within our borders,\" Arnell, 63, said. \"I think it's very important that we secure our borders now. Then, we can worry about the other illegals here .\" The AP-GfK Poll of 1,007 adults was conducted online Dec. 3-7, using a sample drawn from GfK's probability-based KnowledgePanel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 3.4 percentage points."}, {"articleID": "2017081819_00051541_W", "names": {"Bernard Thomas": ["Q16440226", "Q28099675", "Q2898665", "Q4893701"], "Terry Mcauliffe": ["Q3518911", "Q49001865"]}, "date": "2017-08-18", "url": "http://www2.newsadvance.com/news/state/wire/the-latest-conference-of-mayors-supports-anti-hate-pact/article_cecbe996-10e3-5ad1-bb35-7ebb034087d8.html", "content": "The Latest: Conference of Mayors supports anti-hate pact 9 min ago (...) Patrick Kellogg wears an American flag jacket during a rally in Coolidge Park on Thursday, Aug. 17, 2017, in Chattanooga, Tenn.. Organizers said that the purpose of the demonstration, held in response to Saturday's rally by white nationalists in Charlottesville, Va., was to declare resistance against Nazism. (Doug Strickland/Chattanooga Times Free Press via AP) Doug Strickland Robert Castello, owner of the Dixie General Store, discusses his dislike of neo-Nazis and the Ku Klux Klan in Chulafinee, Ala., on Thursday, Aug. 17, 2017. Castello and other supporters of Southern heritage fear that extremists are hurting their cause with protests like the rally that turned deadly in Charlottesville, Virginia. (AP Photo/Jay Reeves) Jay Reeves Jennifer Vik, Yvonne Thrash and Sheila Thrash hold signs during a rally at T.B. Butler Fountain Plaza in Tyler, Texas, on Thursday, Aug. 17, 2017. Around 75 people attended the rally to discuss ways the community could unify. The rally was held in response to a white nationalist rally held in Charlottesville, Va., over the weekend. (Chelsea Purgahn/Tyler Morning Telegraph via AP) Chelsea Purgahn Isaiah Moore, right, argues with counter demonstrators about race relations during a rally in Coolidge Park on Thursday, Aug. 17, 2017, in Chattanooga, Tenn.. Organizers said that the purpose of the demonstration, held in response to Saturday's rally by white nationalists in Charlottesville, Va., was to declare resistance against Nazism. (Doug Strickland/Chattanooga Times Free Press via AP) Doug Strickland People march in the streets of Durham protesting against a possible march by the Ku Klux Klan, Friday, Aug. 18, 2017, in Durham, N.C. Hundreds of anti-racist demonstrators gathered in a North Carolina city in response to rumors of a white supremacist march. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon. However, officers blocked streets and businesses closed. (AP Photo/Jonathan Drew) Jonathan Drew People march in the streets protesting against a possible march by the Ku Klux Klan, Friday, Aug. 18, 2017, in Durham, N.C. Hundreds of anti-racist demonstrators gathered in a North Carolina city in response to rumors of a white supremacist march. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon. However, officers blocked streets and businesses closed. (AP Photo/Jonathan Drew) Jonathan Drew Protesters take to the the street in response to rumors of a white supremacist march on Friday, Aug. 18, 2017 in Durham, N.C.. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon. However, officers blocked streets and businesses closed. (<mark>Bernard</mark> Thomas/The Herald-Sun via AP) <mark>Bernard Thomas</mark> CHARLOTTESVILLE, Va. (AP)--The Latest on developments related to a violent white-nationalist rally in Charlottesville, Virginia (all times local):------Breaking news emails | iOS app | Android app The U.S. Conference of Mayors says more than 250 of its members have signed on to a compact designed to combat hate, extremism and bigotry. The mayors announced the compact Friday on a conference call with the Anti-Defamation League, which is a partner in the effort. The compact lists 10 components, including rejecting white supremacism and extremism, celebrating diversity, and ensuring public safety while protecting free speech. During the call, Republican Mayor Shane Bemis of Gresham, Oregon, said the compact was needed because President Donald Trump failed to \"exhibit moral clarity\" when he blamed both sides for the violence last weekend in Charlottesville during clashes between white nationalists and counter protesters. Columbia, South Carolina, Mayor Steve Benjamin cited the need \"to create stronger cultures of kindness .\" ------2:45 p.m.. The City of Manassas, Virginia, is canceling an upcoming Civil War Weekend, citing a desire not to exacerbate recent tension over Civil War monuments. In a statement Friday, the city said that \"recent events have ignited passions in this country surrounding the Civil War and the symbols representing it .\" As a result, the city said it is canceling its Civil War Weekend planned for Aug. 25-27 out of concern for the safety of residents, visitors and re-enactors. Manassas spokeswoman Patty Prince said the city has hosted the weekend since 2011, when it was launched in connection with the 150th anniversary of the Civil War. She said the weekend is one of the smaller events on the city's tourism calendar. The Manassas area was host to two major Civil War battles .------1:30 p.m. Hundreds of anti-racist demonstrators are marching through the streets of a North Carolina city in response to rumors of a white supremacist march. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon Friday. However, officers blocked streets and businesses closed. Hundreds of others gathered downtown with signs such as \"Black Lives Matter\" and \"We Will Not Be Intimidated .\" They marched for several blocks and then held an impromptu rally in front of where a Confederate statue was toppled Monday. On Friday, protesters altered an inscription on the statue's base that had read \"In memory of the boys who wore the gray\" with the phrase \"Death to the Klan .\" The protest was largely peaceful, but two white men and some protesters engaged in a shouting match, and then the men entered a government building. Willis Brown, who is black, said he came out to support racial unity. He said protesters are \"trying to live in harmony .\" ------Noon Four people have been charged with trying to rip away a plaque honoring Confederate Gen. Robert E. Lee from its place of honor in a North Carolina city. Asheville police said the arrests came after officers found a group of protesters around the plaque on the city's main downtown plaza about 8 a.m. Friday. Photos show people using crowbars and an electric hand drill to yank away the top-right corner of the metal plaque from a granite boulder. The vandals failed to separate the rest of the plaque. Police say the four Asheville residents charged with damage to real property are 27-year-old Nicole Townsend, 45-year-old Amy Cantrell, 30-year-old Hillary Brown and 34-year-old Adrienne Sigmon. Asheville Police spokeswoman Christina Hallingse said she did not know if any of them had obtained a lawyer .------Noon Hundreds of mourners have arrived for the funeral of a Virginia state trooper who died in a helicopter crash after monitoring a white nationalist protest in Charlottesville. Gov. <mark>Terry McAuliffe</mark> and others who gathered at St. Paul's Baptist Church in Richmond on Friday praised Trooper-Pilot Berke Bates as a devoted family man and proud police officer. <mark>McAuliffe</mark> told colorful stories of Bates from his time spent on the governor's protective unit. Authorities say Bates was a passenger in a helicopter providing video to police of activities in downtown Charlottesville last Saturday before it broke off to lend support to a motorcade for the governor. Bates had recently gotten his pilot's license so that he could apply to work for the department's aviation unit. He joined the unit only last month .------10:15 a.m.. The mayor of the Virginia city rocked by a deadly white nationalist rally over a statue of Confederate Gen. Robert E. Lee has canceled a scheduled news conference about the monument's future. Charlottesville Mayor Mike Signer's office said Friday that he would no longer be making a previously scheduled \"major announcement\" about the Lee statue. Signer's office said the mayor would hold public events in the future to discuss public safety and the \"legacy of Heather Heyer,\" the woman who was killed after a car rammed into a group of people protesting against white supremacists last Saturday. Signer's office said Friday morning that the governor would release a statement later in the day .------9:30 a.m. Crime novelist and Charlottesville, Virginia-area resident John Grisham is condemning the white nationalists who descended upon the city for a rally that turned deadly. Grisham writes in a column published by Time that the neo-Nazis, skinheads, Ku Klux Klan members and others came to Charlottesville last Saturday to \"provoke violence and get attention .\" Grisham says the city has proved that \"silence is not an option\" in the \"face of intimidation and hate .\" Grisham says that Charlottesville's streets are quiet again and physical wounds are healing, but \"emotional wounds will take longer .\" One woman was killed and 19 were injured on Saturday when a car plowed into a crowd of people who gathered to condemn what is believed to be the largest gathering of white nationalists in a decade .------9 a.m. Faculty members at a college in South Carolina want their president to repudiate a Confederate flag event planned at the school in October. The Post and Courier of Charleston reported the history department at the College of Charleston has asked school president Glenn McConnell to ban events planned by the South Carolina Secessionist Party on campus. McConnell is a former state Senate leader and lieutenant governor who formerly owned a Confederate memorabilia shop. The South Carolina Secessionist Party plans to display Confederate battle flags on campus Oct. 28. McConnell has mostly avoided discussing the Civil War since becoming college president in 2014. A college spokesman said McConnell had no comment. The faculty said the event is designed to intimidate students, staff and faculty. Secessionist Party founder James Bessenger denies that .---- --"}, {"articleID": "2012032822_00063081_W", "names": {"David Howard": ["Q15993094", "Q16083794", "Q19039108", "Q20752793", "Q22673581", "Q26830027", "Q3703211", "Q5235173", "Q5235174", "Q5235175", "Q5235177", "Q56085566", "Q56380820"], "John Hood": ["Q19325421", "Q30603484", "Q56597744", "Q6239743"], "John Locke": ["Q21198546", "Q6245090"], "Bob Morgan": ["Q16732848", "Q57833888", "Q888143"]}, "date": "2012-03-28", "url": "http://charlotteobserver.com/2012/03/28/3134172/charlotte-city-manager-hopes-1.html#storylink=rss", "content": "when new property values were released last year, charlotte city manager curt walton said he noticed an \"unsustainable\" trend. due to large parts of the city dropping in value, the affluent wedge of the city south of uptown is now responsible for roughly half of the city's tax base. walton's worry is that charlotte would become similar to an older rust belt city, with a small sliver of the population paying the bills. that inequity is unfair, walton said, and could drive people away from the city. \"let's say we do nothing to change that, and by 2020 those (areas) are now 60 to 70 percent of the tax base,\" walton said. \"that's unsustainable .\" walton said that concern was behind his proposal for a nearly $1 billion capital plan through 2020, which would be paid for by a 9 percent increase in the city property tax. the tax revenue would allow the city to borrow money through bonds, which voters would start approving as soon as this fall. much of the plan would build traditional infrastructure, such as roads, sidewalks and bridges. but the capital program is also designed to bring economic development to the city's poorer areas. it ventures into new territory such as a proposal to spend $10 million with unc-charlotte in an effort to expand the city's technology sector, and it calls for a massive redevelopment of bojangles coliseum in east charlotte. the charlotte city council received the plan last week, and many members appeared to support it, at least in theory. <mark>david howard</mark>, part of a democratic 9-2 majority, said the city must work to increase the taxable value of poorer neighborhoods. \"this isn't a grab,\" <mark>howard</mark> said. \"this is to spread the tax burden .\" the last city property tax increase was in 2006. before that, the previous tax hike was in 1986. <mark>john hood</mark> of the conservative <mark>john locke</mark> foundation in raleigh agreed with walton that charlotte will be challenged as the city matures. but he said the city should focus on making it less expensive by keeping taxes low. \"history suggests that you can't overcome a fundamental cost disadvantage,\" <mark>hood</mark> said. \"it's a very common phenomenon of people moving out. the solution is to work on the cost side. how can you make it less expensive?\" under the plan, the city property tax rate would increase from 43.7 cents to 47.7 cents for every $100 of taxable property. the owner of a house with a taxable value of $200,000 would see their city tax bill increase by $80 a year. city property owners also are taxed separately by mecklenburg county. walton said he's sensitive to people having to pay more. \"i get that. people feel like they are paying enough,\" walton said. but he said the burden on taxpayers could be higher in the future if the city doesn't attract investment into less-affluent areas. walton said for years charlotte was able to grow its tax base relatively easy, as new neighborhoods were built in places like ballantyne and the city was able to annex other parts of mecklenburg county. but the city is now running out of room, with the city limits pushing up against other counties and other municipalities. affluent residents are choosing to move to south carolina, or union or cabarrus counties. capital plan the city has divided the capital program into three areas: neighborhood improvements ($334.5 million); transportation connections ($287 million); corridor investment ($305 million).? the neighborhood improvements are similar to past investments. it includes $124.5 million for public safety investments, including a $64 million join communications center to handle 911 and 311 calls and $56.5 million for six new police division stations. there is $60 million for affordable housing. and there is $120 million for improvements in the prosperity; whitehall; west trade/rozelles ferry; cental and sunset neighborhoods .? the transportation connections include $199 million to build between two and three miles of a streetcar line. it also includes $60 million for sidewalks and pedestrian safety, and $48 million to better synchronize traffic signals and repair and replace bridges .? the corridor investments are designed to promote economic development. for instance, the city plans to spend $43 million on road improvements west of charlotte/douglas airport, which is designed to accommodate distribution centers and warehouses expected to be built after norfolk-southern opens a new rail-to-truck transfer center at the airport. the city would spend $25 million as part of an overall $60 million plan to retrofit bojangles coliseum to make it more suitable for amateur sports. it would spend $102.5 million on infrastructure improvements along the corridor for the lynx blue line extension. perhaps the most unusual proposal is to spend $10 million partnering with unc-charlotte for its college of computing and informatics. the city hopes that its money will pay off with the creation of new start-ups and other businesses. <mark>bob morgan</mark>, president of charlotte chamber, said he can't yet endorse the plan. but he said he is impressed with the overall concept. \"it's a much different approach,\" <mark>morgan</mark> said. \"i comment curt and his team for having the creativity for looking at things in a different way .\" <mark>morgan</mark> said his first concern was how much money would be directed towards roads, which the chamber considers critical. he said the amount - $350 million - is a good number. if city council goes forward with the plan, the chamber would likely take the lead in a campaign to convince voters to approve the bonds. city staff are prohibited from using tax dollars to lobby voters. the focus on the city's more struggling neighborhoods has raised concerns among at least one council member, republican andy dulin, who represents south charlotte. during last week's meeting, dulin asked whether south charlotte - which he said pays much of the city's property tax bill - would get a fair deal. if council oks the plan, the city would hold bond referendums in 2012, 2014, 2016 and 2018."}, {"articleID": "2010122417_00031578_W", "names": {"Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2010-12-24", "url": "http://probasketballtalk.nbcsports.com/2010/12/24/gilbert-arenas-happy-coming-off-bench", "content": "gilbert arenas looked settled into his new magic role thursday night - 14 points, 9 assists off the bench. of course, everything with the magic looked settled for one game - granted, one game against the team with the best record in the league, but one game. there still may be changes ahead. \"i'm coming off the bench,\" arenas said. \"jameer's (nelson) starting and jason (richardson)? that's the group. i'm coming off the bench and i do what i do. i don't want to start. this team is too talented .\" stan van gundy's biggest challenge may be how to get arenas, nelson and richardson all enough minutes. which is not a bad problem to have. manu ginobili role - a star player willing to come off the bench who changes the game when he does enter. he did that against the spurs, arenas helped the magic start to pull away. suns will wear \"los suns\" jerseys as part of arizona immigration bill protest yellow jackets lose two starters, four players total, for bowl game <mark>michael jordan</mark> aggressive on trade front to revamp bobcat roster"}, {"articleID": "2019011405_00234497_W", "names": {"Jack Reed": ["Q528979", "Q6114777", "Q6114779", "Q6114783"]}, "date": "2019-01-13", "url": "https://www.breitbart.com/news/trump-says-us-will-hurt-turkey-economically-if-it-hits-kurds/", "content": "WASHINGTON (AP)--President Donald Trump warned Sunday that if Turkey attacks U.S.-backed Kurdish forces in Syria, the United States will \"devastate Turkey economically .\" Trump's decision to pull American troops out of Syria has left the United States' Kurdish allies vulnerable to an attack from Turkey. Ankara views the Kurdish forces as terrorists aligned with insurgents inside Turkey. In a tweet, Trump also warned the Kurdish forces not to \"provoke Turkey .\" The U.S. withdrawal has begun with shipments of military equipment, U.S. defense officials said. But in coming weeks, the contingent of about 2,000 troops is expected to depart even as the White House says it will keep pressure on the IS network. Once the troops are gone, the U.S. will have ended three years of organizing, arming, advising and providing air cover for Syrian, Kurdish and Arab fighters in an open-ended campaign devised by the Obama administration to deal the militants, also known as ISIS, a lasting defeat. \"Starting the long overdue pullout from Syria while hitting the little remaining ISIS territorial caliphate hard, and from many directions,\" Trump tweeted. \"Will attack again from existing nearby base if it reforms. Will devastate Turkey economically if they hit Kurds .\" Trump's decision to leave Syria, which he initially said would be rapid but later slowed down, shocked U.S. allies and angered the Kurds in Syria. It also prompted the resignation of Defense Secretary Jim Mattis and drew criticism in Congress. Sen. <mark>Jack Reed</mark>, a Rhode Island Democrat, called the decision a \"betrayal of our Kurdish partners .\" "}, {"articleID": "2013113005_00014749_W", "names": {"C. Thomas": ["Q57413099", "Q57913032"]}, "date": "2013-11-29", "url": "http://commercialappeal.com/news/2013/nov/29/man-charged-fiery-ohio-crash-killed-couple/#comments?CID=happeningnow", "content": "FREMONT, Ohio (AP) - An Ohio motorist traveling at more than 125 mph was charged Friday with vehicular homicide after his car struck a minivan, killing a couple inside, the State Highway Patrol said. Andrew D. Gans, of Kent, faces two counts of vehicular homicide with a reckless specification after Thursday night's crash on the Ohio Turnpike, where both vehicles burst into flames. The victims, Wilbur and Margaret McCoy, both 77, of Toledo, were wearing seatbelts when they were hit and were trapped inside of the minivan, the patrol said. Gans, 24, suffered injuries that are not life-threatening and was hospitalized for psychiatric evaluation at a Toledo hospital, said staff Lt. Anne Ralston, a patrol spokeswoman. Gans has spoken with investigators, but Ralston declined to comment on what he said or whether he offered any explanation for the erratic driving that was reported. He will be taken to jail following his release from the hospital. No court date has been set and the case will go to a grand jury. The patrol said the incident remains under investigation. Two troopers separately spotted Gans' car but weren't able to catch or keep up with it before the crash near Fremont, about 40 miles southeast of Toledo, Ralston said. Other drivers began calling dispatchers about the speeding, weaving vehicle just before 7 p.m., about 20 minutes before it crashed into the back of the minivan. The driver covered roughly 60 miles in that time and passed two troopers, each of whom tried to pull behind the westbound car but lost sight of it as it sped away, Ralston said. \"Just because it was going so fast, we were never able to get into a position where we were actually engaged in a pursuit with it,\" Ralston said. \"We were simply trying to catch up and intercept this vehicle and get it stopped .\" The speeding vehicle stunned some holiday travelers who witnessed it. Josh Pickett of Toledo told The Toledo Blade that he was headed home from Thanksgiving dinner with relatives in Cleveland when the speeding driver passed him, followed about a minute later by a state police cruiser. \"I was going 76, and the guy passes me like I was standing still,\" Pickett told the newspaper. He said within a few minutes, traffic suddenly stopped \"and I saw really big flames .\" Ty Mahaffey told The Blade a car zoomed by him \"at an enormously high rate of speed ....I have never seen a passenger car going so fast .\" The Toledo resident said he was going around 80 mph \"and when he passed me, it was like I was going in reverse .\" He said afterward he had to pull over briefly to collect himself. Kyle Veazey: Ole Miss blew it, Dan Mullen and Dak Prescott won it, and Egg momentum shifts back Pastner confident Johnson will break out of early season shooting slump Published 11/26/2013 at 7:08 p.m. Wendi <mark>C. Thomas</mark>: Follow the story of Thanksgiving past the potluck to the Trail of Tears Lafayette's Music Room returning to Overton Square with live music, chef Chandler's menu Published 11/20/2013 at 9:35 a.m.. Some University of Memphis cuts revealed by Provost Rudd to faculty Senate Get Storm Shield, our new weather radio app for iPhone and Android!"}, {"articleID": "2020032121_00019668_W", "names": {"Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"], "Brent Johnson": ["Q18705331", "Q4961442", "Q909756"]}, "date": "2020-03-21", "url": "https://www.nj.com/coronavirus/2020/03/new-jersey-lockdown-rules-what-residents-need-to-know-about-stay-at-home-order.html", "content": "Gov. <mark>Phil Murphy</mark> has ordered New Jersey residents to stay home. Michael Mancuso | NJ Advance Media for NJ.com By <mark>Brent Johnson</mark> | NJ Advance Media for NJ.com and Matt Arco | NJ Advance Media for NJ.com New Jersey will go into virtual lockdown mode starting Saturday night after Gov. <mark>Phil Murphy</mark> announced he is ordering all people to stay at home except for necessary travel and mandating that all non-essential retail businesses in the state close help to battle the spread of the coronavirus. Here's a look at what that means: SO I HAVE TO STAY IN MY HOME? People are limited to traveling for only essential needs, like groceries, food, or medicine, or if they are have to get to a job at a business that is still open. People can also go outside for walks or exercise. Except for the essential workers, the governor wants everyone off the roads, and specifically urged people not to go to the Jersey Shore If they have part-time residences there. \"We expect people to stay home,\" <mark>Murphy</mark> said during a news briefing Saturday at Rutgers-Newark. \"We want you off the roads. That's now 24 hours. We don't want you out there. Period .\" WHAT'S CLOSED? <mark>Murphy</mark> had already indefinitely shuttered a number of businesses amid the outbreak, including indoor malls, movie theaters, casinos, gyms, amusement parks, barber shops, salons, libraries and more. He also limited restaurants to takeout and delivery. Now it extends to the vast majority of retail businesses. WHAT CAN STAY OPEN? Retail businesses allowed to remain open include grocery stores, food banks, pharmacies, medical marijuana dispensaries, gas stations, auto mechanics and repair services, convenience stores, banks, hardware and home improvement stores, laundromats, dry cleaners, printing and office supply shops, pet stores, stores that sell supplies for young children, and mail and delivering shops. Restaurants, bars and liquor stores that provide takeout and delivery can also stay open. Manufacturing, industrial, logistics, ports, heavy construction, shipping, food production, food delivery, and other commercial operations may continue operating, but they must keep staff at a minimal level on site to make sure \"essential operations can continue .\" Medical facilities can continue to operate. Child day care centers will also remain open. <mark>Murphy</mark> has said many emergency and essential workers need a place to watch their children. Other businesses should allow people to work from home, if possible, the governor said. MORE: What is an essential retail business in N.J.? A list of places that can stay open in coronavirus shutdown. WHAT ABOUT PUBLIC GATHERINGS? <mark>Murphy</mark> has barred any public gatherings--parties, funerals, concerts, etc.. He first limited them to 250 people and then reduced it to 50 people. Now all are barred. \"This decision is not an easy one, and it pains me that important life moments will not be celebrated the way we are accustomed to,\" <mark>Murphy</mark> said. \"Our singular goal is to make sure we get through this emergency so you can safely gather with family and friends later and enjoy many more wedding and birthdays to come .\" WHO IS CONSIDERED AN ESSENTIAL WORKER? Health-care and medical-services workers, members of the media, law enforcement agencies, federal government workers, those who work at businesses that are allowed to remain open. WHEN DOES THIS GO INTO EFFECT? 9 p.m. Saturday. HOW LONG WILL IT LAST? That's unclear. <mark>Murphy</mark> said he expects the crisis will be \"measured in weeks to months. This is not next week .\" WHAT IF I DON'T COMPLY? <mark>Murphy</mark> didn't provide specifics on what the penalties would be, but he said: \"If folks are monkeying around, we will take action .\" He has also said any businesses that don't comply will be prosecuted for a disorderly person's offense at the local level. WHY TAKE THIS ACTION? Officials say the more people keep their distance from each other--otherwise known as \"social distancing\" --it will help slow the spread of the virus, which causes the illness COVID-19. \"Social distancing is the key to stopping this,\" state Health Commissioner Judy Persichilli said. \"There's nothing more sophisticated about it. We don't have a vaccine .\" An NJ Advance Media analysis of data from a Rutgers University study shows in a worst-case scenario, with the minimal amount of social distancing, 1 in 7 people could contract the virus. HOW MUCH HAS THE VIRUS ALREADY SPREAD? The coronavirus is a pandemic that has infected and killed thousands across the globe. In New Jersey, officials have confirmed at least 1,327 known cases, with 16 confirmed deaths. Officials say they expect that number to increase significantly in the coming days as testing expands and there is more evidence of \"community spread .\" The state has not released how many negative tests have come back or how many people have recovered from the virus. WHERE CAN I FIND MORE INFORMATION? The state has a new website devoted to its response to the pandemic: covid19. nj. gov / Sign up for text message alerts from NJ.com on coronavirus in New Jersey: If you would like updates on New Jersey-specific coronavirus news, subscribe to our Coronavirus in N.J. newsletter. <mark>Brent Johnson</mark> may be reached at bjohnson @ njadvancemedia.com. Follow him on Twitter @ johnsb01. Matt Arco may be reached at marco @ njadvancemedia.com. Follow him on Twitter @ MatthewArco or Facebook. Have a tip? Tell us. nj.com/tips Get the latest updates right in your inbox. Subscribe to NJ.com's newsletters. Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}]