[{"date": "2014-12-28", "url": "http://www.independent.ie/entertainment/movies/ramirez-evil-role-exorcised-fears-30865921.html", "content": "<mark>Edgar Ramirez</mark> starred in horror film Deliver Us From Evil Comments The Venezuelan actor, who plays Spanish priest Mendoza in Scott Derrickson's thriller, admitted he got scared of paranormal activities after watching The Exorcist. \"I remember that was the first horror movie that I saw. I saw three or four scenes, and I was traumatised for three years,\" he said. \"It was very difficult for me to sleep and I didn't watch the whole thing, that's how strong my reaction was. Then 35 years later, they offered me this movie, so that was a way to end my childhood fears, by being the exorcist .\" <mark>Edgar</mark>, who stars opposite Eric Bana and Olivia Munn in the film, said there was some unusual happenings on set. \"(It was) probably just hypersensitivity. I was in a bar and I went to the bathroom, and I saw that the paper machine, the ones that give you toilet paper if you put your hand on it, was broken. And then suddenly it went on, it just turned on and gave me paper (even though) I was very far away from it,\" he recalled. \"A couple of hours later, I am back in the bathroom, I am alone, and I heard that the machine was broken and actually somebody from production had put some extra paper on the side for us. Then (the paper towel dispenser) went out again .\" The 37-year-old actor added: \"Other than that, one of my crosses broke from the first exorcism. A metal cross. I put it in my pocket, and when I pulled it out, it was broken. But I wasn't scared any more .\" Rebel Wilson: Cohen wanted me naked Rebel Wilson has revealed how Sacha Baron Cohen kept trying to persuade her to strip off for his new film, Grimsby. Film hardman Ray Winstone has revealed he wet himself when he was introduced to gangster Ronnie Kray - although he was only six months old at the time. Irish writer scripts Sarah Jessica Parker's new show \"Don't f *** ing insult the Irish people any more' - Liam Neeson won't move home to...Movies: Coming soon to a screen near you Netflix October releases - A Separation, Girl Interrupted, Homeland, and...Yellow weather warning: Temperatures to plunge to minus five degrees tonight Hospital sends Christmas babies home in hand-knitted Christmas stockings\" Don't f *** ing insult the Irish people any more' - Liam Neeson won't move home to...Taxpayer faces huge bill over funding of \"quangos' Mother-of-two stabbed seven times with potato peeler by Facebook\" friend' Bus assault victim to return to \"safer' Mexico after Dublin attack Adams rewriting of Provo history sees McAuley-types lionised by SF\" The Interview' review: Controversial gross-out satire is broad, bawdy and bad - but...Take our 100-question quiz of the major events of 2014 VIDEO: Jamie Foxx: Hard missing time with family VIDEO: Seth Rogen attends The Interview movie release on Christmas Day US movie fans queue around the block as The Interview finally...VIDEO: Penguins Of Madagascar, Annie, Night At The Museum 3, all big at...Now that UK cinemas are back open after Christmas, there...The Movie Show: Unbroken and Exodus: Gods and Kings Aoife Kelly is joined in studio by Geroge Byrne and Paul Whittington to take a look at two of the...VIDEO: One Direction's Best Moments of 2014 Take a look back at One Direction's best moments of 2014. From the awards to the...VIDEO: Seth Rogen speaks out on The Interview controversy Seth Rogen finally breaks his silence as Sony announces that The Interview will be released. VIDEO: Sony confirms release of The Interview Sony has announced a limited cinema release of The Interview, putting the comedy back on to...VIDEO: \"One more time' - Independent. ie reporters share their 2014 bloopers It's been a busy year in news, so it's understandable that there...VIDEO: Legendary Singer Joe Cocker Passes Away VIDEO: Barry Egan meets <mark>Louis Walsh</mark> VIDEO: Celebrities Get Festive for the Y100 Jingle Ball A host of celebrities brought Christmas cheer to Florida as they performed at the Y100 Jingle Ball. Video: Build Your Own Gaming PC 1: The Case We're taking a look at what it takes to build your own gaming PC. To start off we're focusing...VIDEO: Barry Egan meets <mark>Enda Kenny</mark> Barry Egan scores a rare interview with our great leader, <mark>Enda Kenny</mark>. VIDEO: Caroline Flack wins Strictly Come Dancing More than 11 million people watched Caroline Flack as she was crowned champion of this...VIDEO: <mark>Jack O'Connell</mark> says Angelina Jolie is loved in Derby Angelina Jolie will always have a fanbase in Derby thanks to a.. . VIDEO: Christmas nuptials: <mark>Elton John</mark> shares snaps of official wedding to David...Nine years after they first tied the knot in a civil ceremony,...The Script, The Coronas and Joe Duffy entertain crowds on Grafton Street From Shirley Temple to <mark>Robin Williams</mark>, the stars of music, stage and screen we lost in 2014 Deck the hair with boughs of holly - Beards are this year's Christmas Jumper Beards are this year's way to flaunt your festive feeling -...The best signs at today's #WaterCharges protest In pictures: Love/Hate Season 5 finale 10 actresses who could play Bridget Jones As reports suggest Reese Witherspoon could be replacing Renee Zellweger on the third...Love/Hate series five - the story so far Top 10 sexist ads - prepare to feel your blood boil...By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2014122806_00032218_W", "names": {"Enda Kenny": ["Q5375903", "Q57815"], "Jack O'Connell": ["Q16028203", "Q16184113", "Q16733588", "Q16733590", "Q22680912", "Q348066", "Q43379437", "Q6114376", "Q6114380"], "Louis Walsh": ["Q16228796", "Q658547"], "Robin Williams": ["Q16853353", "Q27252", "Q28835708", "Q42954305", "Q7352873", "Q7352874", "Q83338"]}}, {"date": "2014-12-29", "url": "http://www.baldwincity.com/news/2014/dec/29/musing-hill-0101/", "content": "Print Happy New Year! My wishes for all are joy and health in the days ahead. The years fly by; where did they go? So swiftly they flew, as an arrow shot into the night is quickly lost to sight. How many years have we lost moaning over hurts and mistakes now long past? Forgive and forget. Let them go! It is time, you know. The bells are ringing in a new year. We can begin anew with good intentions and can endeavor to mend those fences and use another road not taken. As the famous philosopher Goethe wrote: \"One ought, every day at least, to hear a little song, read a good poem, see a fine picture, and, if it were possible, to speak a few reasonable words .\" Goethe should have included in his list laughter doeth good as fine medication, or \"a laugh a day keeps the doctor away,\" which has been proven true. Also, he should include nature's healing touch. Nature is very important to me. If I feel anxious or upset, I lean against a huge oak, and it seems to impart its strength and endurance, which renews my soul. Fortunately, I am able to adhere to Goethe's advice. Every day, the songs of birds fall upon my ears. I do not often come across good poetry that appeals to me. I am used to poems that rhyme. Fine pictures, I see every day. I only have to gaze upon <mark>Tom Russell</mark>'s wonderful \"Margaret's High Pasture,\" hanging in my living room. It pleasures my eyes. My daughter Tricia Spencer presented me, at Christmas, her beautiful painting of a group of red apples, which is hanging in my dining area. I feel my columns, which I work on almost every day, represent \"a few reasonable words .\" The following poem, which I wrote, does not in any way represent good poetry. \"Now I am old, red I will wear. It will go well with my snow white hair. The sun still sets in flaming red. That color's mine, gaily she said. Oh, not for me cold purple's shroud. I'll flaunt my age and cry aloud. Like setting sun on yonder hill, tinting every cloud at will. I too will set in flaming red, clouds of glory around my head!\" ", "articleID": "2014122923_00039740_W", "names": {"Tom Russell": ["Q1345526", "Q20984552", "Q21461614", "Q27922619", "Q56696376"]}}, {"date": "2014-12-31", "url": "http://www.movieweb.com/spider-man-3-sam-raimi", "content": "\"Saturday Night Live: Amy Adams/One Direction' Dr. Evil Cold Open\" Star Wars Rebels: Path of the Jedi' Yoda Contacts Kanan \"The Carbonaro Effect: Just A Milker' Milking Almonds Revealed Sam Raimi Says\" Spider-Man 3' Is Awful Gillian Greene directed. While there, he also reflected on the critically-panned 2007 sequel Spider-Man 3. Despite being drubbed by critics and fans alike, the director was initially slated to return for Spider-Man 4, before the studio decided to reboot the franchise once again with 2012's The Amazing Spider-Man and this year's The Amazing Spider-Man 2 Spider-Man 3, the director opened up, and revealed that trying to raise the stakes after the beloved Spider-Man 2 was what \"doomed\" the sequel, which he admits is \"awful .\" \"It's a movie that just didn't work very well. I tried to make it work, but I didn't really believe in all the characters, so that couldn't be hidden from people who loved Spider-Man. If the director doesn't love something, it's wrong of them to make it when so many other people love it. I think [raising the stakes after Spider-Man 2] was the thinking going into it, and I think that's what doomed us. I should've just stuck with the characters and the relationships and progressed them to the next step and not tried to top the bar. I think that was my mistake. [But] directors don't like to talk about their bad films .\" When host <mark>Chris Hardwick</mark> added that he didn't think \"bad\" was the right word for Sam Raimi added that the sequel was \"awful .\" The filmmaker was also asked if he had the chance to make Spider-Man 3 again, would he? The director said he would, although he would have to care about the characters. \"I wouldn't make that movie. If I had a different story with characters that I cared about and was engaging, yes, in a second. I love Spider-Man. That was never the issue, just that I made the wrong story, the wrong way. That's everything .\" Co-host Matt Mira also complimented the filmmaker on his last film, Oz: The Great and Powerful, which he didn't seem too happy with either. Spider-Man 3? Do you think the filmmaker should be given another crack at the Spider-Man franchise? Chime in with your thoughts below. \"Evil Dead' Director Fede Alvarez Confirms Sam Raimi Will Direct\" Army of Darkness 2' Sam Raimi Says \"Spider-Man 3' Is Awful\" Shaun of the Dead' Live Stage Show Trailer \"Into the Woods' Music Featurette with Anna Kendrick\" The Interview' Is Youtube's Best Selling Movie of 2014 \"Avengers: Age of Ultron' LEGO Comic Shows an Epic Battle GIVEAWAY: Win\" Woman in Black 2 Angel of Death' Prizes \"Avengers 2' Art Reveals Vision and Ultron Origin Details\" Independence Day 2': Is Randy Quaid Set to Return? Will the \"Ghostbusters' Reboot Be Rated R? Sylvester Stallone Confirms\" Rambo 5: Last Blood' Title?", "articleID": "2014123101_00044247_W", "names": {"Chris Hardwick": ["Q15844590", "Q313049", "Q3675502", "Q5106780"]}}, {"date": "2015-01-03", "url": "http://denverpost.com/news/ci_27251573/avalanche-victim-soldier-outdoorsman-friends-say", "content": "A Colorado Springs man who died in an avalanche Wednesday was a soldier and experienced outdoorsman who knew the risks and dangers of life and chose to take them anyway, friends said. Whether serving three combat tours in Iraq and one in Afghanistan or climbing mountains, friends of <mark>Christopher Thomas</mark> said the 39-year-old embraced challenges. \"He was extremely experienced and prepared,\" said Joy Burton, a family friend who knew <mark>Thomas</mark> through Living Earth Church in Denver, a church centered around neo-paganism. \"He purposely sought out challenges and experiences in the wilderness. I think it helped him with his last tour overseas .\" Sheriff seeks suspect in attempted Monarch Mountain sex assaults We reserve the right to remove any comment we feel is spammy, NSFW, defamatory, rude, or reckless to the community. We expect everyone to be respectful of other commenters. It's fine to have differences of opinion, but there's no need to act like a jerk. \"Bullet-looking missile thing' turns heads along highway south of Boulder Lockheed says object part of\" sensor technology' testing that ended Thursday", "articleID": "2015010318_00011857_W", "names": {"Christopher Thomas": ["Q17310815", "Q59020931"]}}, {"date": "2015-01-05", "url": "http://www.laprensasa.com/309_america-in-english/2867180_british-royals-staff-deny-prince-andrew-sex-scandal-involvement.html", "content": "Ampliar Buckingham Palace, the British Royal Family's official residence, asserted Monday that Queen Elizabeth II never had any acquaintance or contact with the woman that filed a lawsuit accusing her son, Prince Andrew (seen in this file photo), of sexually abusing her while she was still a minor. EFE/File London, Jan 5 (EFE). - Buckingham Palace, the British Royal Family's official residence, asserted Monday that Queen Elizabeth II never had any acquaintance or contact with the woman that filed a lawsuit accusing her son, Prince Andrew, of sexually abusing her while she was still a minor. Prince Andrew, the Duke of York, is at the center of controversy after the press revealed that his name appears in a U.S. lawsuit against billionaire Jeffrey Epstein, which includes accusations by a woman claiming she was forced to have sex with the queen's third son when she was just 17 years old. U.K. media identified the woman as Virginia Roberts, whose father, Sky Roberts, told the tabloid \"Daily Mail\" that his daughter mentioned her acquaintance with Prince Andrew a few years ago, when she was living in London. She also told him that she had met the Queen during her stay in the British capital. However, a Buckingham Palace spokesman insisted that there is no evidence suggesting that these statements are true, especially since the Royal Palace does not have any record of the alleged meetings. Buckingham Palace recently denied that Prince Andrew was involved in any kind of relationship with Roberts while insisting that her allegations \"are false and without foundation .\" The name of Prince Andrew, 54, was mentioned in documents filed in a Florida court during the Jeffrey Epstein trial, in which Virginia Roberts accused him of forcing her to have sex with the Duke of York three times (in London, New York and on a private Caribbean island owned by Epstein) between 1999 and 2002, according to U.K. media. Roberts claimed that Epstein, Prince Andrew's personal friend who was sentenced in 2008 to a year and a half in prison for sex with minors, loaned her to \"rich and powerful friends\" as a \"sex slave .\" The Metropolitan Police Service noted that it has not received any notification regarding this case until now, but assured it will start an investigation once an official report is filed. Prince Andrew, one of the Royal Family's most controversial members, stepped down in 2011 from his position as special representative tasked with attracting foreign investment to Britain after his friendship with Epstein was revealed. Normas de comentarios www.laprensasa.com no se hace responsable de las ideas expresadas por los autores de los comentarios y se reserva el derecho a eliminar aquellos contenidos que: resulten ofensivos y/o discriminatorios que tengan como fin promover el boicot contra personas, productos empresas o instituciones que atenten contra el derecho a la intimidad, al honor y/o a la propia imagen o nombre British Royals' staff deny Prince Andrew sex scandal involvement Bull beaten to death by 20 people angers Colombians 13 Inmates escape from detention centers in Colombia Ecuadorean president in China on state visit South Florida city gears up for big Miss Universe party Tokyo contemplates reimposing sanctions on Pyongyang Colts and Cowboys book spots in NFL divisional playoffs <mark>Luis Suarez</mark>, Cristiano Ronaldo top league scorers in 2014", "articleID": "2015010519_00010100_W", "names": {"Luis Suarez": ["Q26517", "Q270367"]}}, {"date": "2015-01-05", "url": "http://theblaze.com/contributions/is-your-local-telephone-company-really-a-villain", "content": "<mark>Jason Wright</mark> is a New York Times best-selling author of 10 books, including They're the villain you love to hate. If the new \"Star Wars\" movies reveal more children for Darth Vader, they will all be named after local telephone companies. In countless communities around the country, this utility is one plump piñata. But instead of mints and mini Milky Ways, it's packed with plastic modems and Ethernet cables. \"Step right up! Swing away!\" In my corner of the world - Virginia's Shenandoah Valley - the longtime bad guy goes by the name Shentel. Like any other phone company, the common complaints cover the phone bill, Internet speeds or why <mark>Bob Jones</mark> can't watch the Underwater Penguin Poker Network. That's probably not a real channel, but if it were, <mark>Bob</mark> would rant that it's not available on Shentel. \"I need my penguins playing cards!\" Perhaps it's unavoidable. After all, they're a utility, and for generations they've been easy targets with their costar antagonists: the power, water and gas companies. Is it really possible that with so many customers across such a large market that sometimes, maybe, just maybe, believe it or not, they actually do something right? Bays of equipment stand in the 4G area at an AT & T mobile telephone switching office on October 25, 2012 in Charlotte, North Carolina. The center handles wireless AT & T traffic from the western part of North Carolina. (Photo by John W. Adkisson/Getty Images) Let's see. About a month ago, I discovered that the AT & T Microcell that sits perched by the window of my building in Woodstock, Virginia had stopped working. The device functions like a cell phone signal booster and I tried the normal quick fix. I unplugged it, counted to 60, turned my pajamas inside out, flushed three ice cubes and plugged it back in again. Nothing, though we did get a little snow. I took a deep breath, mumbled a prayer and called AT & T's customer service. They waved a wand, spouted some numbers and told me the problem was mine. \"Call your local Internet service provider and tell them they need to quit blocking your ports .\" \"I'm not trying to sail anywhere. I just want my device to work .\" I laughed. They didn't. I explained that no changes had been made on my end and that the device had been working well for three years. It's had only a handful of minor hiccups always solved with the restarting and ice cube tricks. And thus began a three-week adventure with my local telephone company. We started with one call, then another, and another and another. The issue climbed rung by rung up the support ladder and even though the problem was not yet solved, the service was outstanding. Never once did they blame AT & T or whisper even a negative word. Nor did they make me feel as though I had somehow created the problem myself, a common tactic in the tech support world. We tried it all. AT & T sent another device, just in case. Nope. I experimented with several other routers. Negative. I brought in a private networking guru to troubleshoot. Thanks for trying. I invested many hours determining what was broken and how it could be fixed. I tried so many different cabling configurations that my office looked like my kid's Rainbow Loom. When I was nearing my breaking point - the day I was going to let my boys strap bottle rockets to it - I got another phone call from Shentel offering something that just might shock you. An apology. They'd discovered the problem was, in fact, theirs. It was the result of a simple tweak made in their network configurations about the same time my device decided to hibernate. They reverted to the original settings and within two minutes, everything was working perfectly. I didn't even have to flush the ice cubes. How impressive that they didn't pass the buck and they were completely transparent about their internal investigative process. They completely owned it. Simply put: they screwed up, and it took longer than it should have for them to recognize the issue. But the company I'm supposed to distrust and dislike did the right thing in a remarkably honest and genuine way. Perhaps some of my local readers will pounce on the comments to post their horrible experience dealing with the very same company. But as I've written before, we have a responsibility to highlight when things go right. I'm not an expert, I'm just a writer, but perhaps when we form our consumer opinions, we ought to rely more on our own experiences and less on the loud and disgruntled few. I offer public kudos to Emily, Judson, Larry, Michael, Robert and Seth at Shentel for aggressively working to solve a problem they admitted to creating in the first place. If that's a villain, we need a lot more of them in the marketplace. Channel Finder Unfortunately, TheBlaze is not available on to email your provider and urge them to add TheBlaze to your channel lineup. to email your provider and urge them to add TheBlaze to your channel lineup. How Many Christians, Jews and Muslims Will Be Part of the New Congress? Here's the Complete Religious Breakdown \"My Husband's Not Gay': New TLC Show About Married Mormon Husbands Who Are Attracted to Men Sparks Major Protest What Archaeologists Found Under the Floors of an Abandoned Jerusalem Building Could Be the Site of One of the Biggest Events in Jesus' Life Christian Blogger Pens Incredible Message as She Enters Hospice - Just Months After Begging Brittany Maynard Not to Take Her Own Life:' I Pray I Would Live Well and Fade Well' Brewery Apologizes for Naming One of Its Beers After a Famous Historical Figure American Oil Companies Have Sent a Hint That They Think Gas Prices Will Remain Low Your Dollars Just Got a Lot Stronger Against the Euro - Europe's Currency Hit a 9-Year Low and Could Go Lower Someone Gave the World a Brutal Look at Comcast's Inner Workings - but Their Identity Is Still in Question Someone Gave the World a Brutal Look at Comcast's Inner Workings - but Their Identity Is Still in Question These Texas Miners Used Drones in Exactly the Way You'd Expect Texas Miners to Use Drones New Blaze Magazine: The progressive left's threat to free speech State Dept. not looking to sanction Palestinians for trying to join Int' l Criminal Court Republicans target Obamacare in first wave of bills for the 114th Congress There was a problem submitting your tip. Please try again later. Please help us fight spam. Follow the instructions below to prove that you're a real person.", "articleID": "2015010521_00005921_W", "names": {"Bob Jones": ["Q4932955", "Q4932956", "Q4932957", "Q4932958", "Q4932959", "Q4932961", "Q56526001", "Q7343799"], "Jason Wright": ["Q16214266", "Q29048721", "Q42829331", "Q6163814"]}}]