[{"date": "2015-01-05", "url": "http://hindustantimes.com/sports-news/othersports/if-saina-nehwal-why-not-other-olympic-medallists/article1-1303694.aspx", "content": "Only the ministry of home affairs can tell whether London Olympic medallist Saina Nehwal's name will feature in the final list of Padma Bhushan winners. Her public outburst was enough to move the sports ministry to recommend her name for the third-highest civilian award as a special case, three-and-a-half-months after the deadline for submitting nominations. No one will question whether Saina deserves the award or not. But eyebrows are being raised on the way she questioned the ministry's judgement of not equating her achievements with India's only two-time Olympic individual medallist <mark>Sushil Kumar</mark>. Where is the sportsman's spirit? There are other Olympic medallists whose achievements are comparable to Saina's, then why not nominate them for the Padma Bhushan. Whether they get it or not is a different issue. Other contenders If the ministry is ready to accommodate a nomination after the deadline, then why not make a special case for London Olympic medallist shooter Gagan Narang, who got the Olympic medal a year after getting the Padma Shri and also won medals in the 2014 Commonwealth Games. Or, for Beijing Olympic medallist Vijender Singh, who got the Padma Shri in 2010, and went on win gold at the 2010 Asian Games and silver at the 2014 CWG. Wrestler Yogeshwar Dutt's achievements are no less. Though he got the Padma Shri in 2013 for his bronze at the London Olympics, he went on to win gold at the 2014 Asian Games and broke the nation's 28-year gold medal drought in wrestling. Following Saina's public outburst against the sports ministry for only recommending <mark>Sushil</mark>'s name, the ministry came up with a press release on Monday stating: \"In view of the achievements of Saina Nehwal, the department of sports has decided to recommend her case for Padma Bhushan to the ministry of home affairs as a special case, although the last date for making the recommendation is long over .\" The ministry also went on record to state that they hadn't got an application \"for or from\" Saina before the deadline. They only received Saina's nomination for a Padma Bhushan from the Badminton Association of India on January 3, 2015, three months and 20 days past the deadline. In view of her achievements, the ministry decided to go ahead. Pak fishing boat blows up near Gujarat coast after being chased by Coast Guard Ship Thought this happened only in India, say Chinese after stampede kills 36 PK breaks box office collection records, earns Rs. 276.32 crore in two weeks", "articleID": "2015010521_00018988_W", "names": {"Sushil Kumar": ["Q27924858", "Q378384", "Q47568673", "Q57041099", "Q57157332", "Q7648941", "Q7648943", "Q7648947"]}}, {"date": "2015-01-07", "url": "http://www.herald.ie/sport/soccer/dyke-welcomes-ali-call-30887078.html", "content": "07 January 2015 03:00 AM ENGLISH Football Association chairman Greg Dyke has welcomed the decision by Prince Ali Bin Al Hussein of Jordan to challenge Sepp Blatter for the FIFA presidency in May. Kick It Out: Football is still \"male and pale' QPR agree loan deal for Hammers' Zarate Vokes will help Long on comeback trail Prince Ali, a FIFA vice-president and head of the Jordanian FA, is the first credible challenger to emerge and his announcement has also been welcomed by UEFA president Michel Platini. Dyke, who has previously called for Blatter not to run again, said:\" Personally I welcome Prince Ali's decision to stand for the FIFA presidency. It is very important that there is a credible candidate standing against Mr Blatter and Prince Ali is certainly that. \"Platini added:\" I know Prince Ali well. He has all the credibility required to hold high office. We now await his proposals and his programme for the future of football. \"Over € 20k stolen in daylight raid on city cash van City pub is slammed over\" disgusting' booze promo \"No record' of prince's sex abuse claim woman ever meeting Queen, says palace Fergie stands by her ex-husband Prince Andrew, as underage sex allegations refuse to go away Rogue cyclists set to face € 50 on-the-spot penalties for breaking red lights Over € 20k stolen in daylight raid on city cash van City pub is slammed over\" disgusting' booze promo \"No record' of prince's sex abuse claim woman ever meeting Queen, says palace Fergie stands by her ex-husband Prince Andrew, as underage sex allegations refuse to go away In the not so distant past, we Irish were seen by many of our neighbours as a dirty old place. In the not so distant past, we Irish were...Cinema takings hit 25-year low but Star Wars is 2015's big hope Staying in tonight? Here's what to watch on the box While you're nursing that horrific credit card bill...Pat Stacey on TV: Do fact-based dramas have to be 100pc true? A few years ago, it would have been hard to imagine James Corden taking a pragmatic and modest attitude towards cracking...Reunited and it feels so good as Jenny's back on the air with hubby Ray I can't wait, says Angela as she lands plum role on the Voice UK <mark>Karen Koster</mark>'s newborn baby Finn may only be nine...EastEnders will finally reveal how its character...Pat Stacey review: And now, the UTV Ireland news: nothing to see here Luther <mark>King</mark> was inspiration for\" stage name', reveals TV3 weatherman <mark>Martin King</mark> By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2015010704_00034309_W", "names": {"Karen Koster": ["Q59195342", "Q6369788"], "Martin King": ["Q18822346", "Q59459475", "Q6775888", "Q6775889", "Q6775890"]}}, {"date": "2015-01-07", "url": "http://www.packagingtoday.co.uk/news/newsnew-versatile-hot-stamping-foil-has-got-it-covered-4483945", "content": "New Versatile Hot Stamping Foil Has Got It Covered 7 January 2015 Email Jan 7 2015 New Versatile Hot Stamping Foil Has Got It Covered API Foils has developed a new more versatile, general-purpose matt pigment hot stamping foil. It offers both fine detail and broad area coverage across a wider range of applications than any other pigment foil previously available from API. The PG grade is the result of two years research and development and combines the best qualities of the company's legacy pigment foils UA and 432, delivering a number of improved product features. A better opacity means customers will achieve a sharper colour and better overall finish and a wider operating temperature window increases productivity by improving process times. In addition, by providing a well-defined colour range in just a single grade, it is simpler for customers to choose their preferred product as PG will cover the vast majority of applications. Says <mark>Andy Kerr</mark>, International Technical Support: \"This new range has been developed to make product selection far easier for our customers. We have developed just one grade for most general-purpose applications, which is available in 12 well-defined colours .\" The versatility of PG across so many applications together with its improved technical capability, means the customer can concentrate on the effect they want to achieve rather than get involved in technical considerations. Having such a grade also means that deliveries will be quicker and simpler. \"Suitable for both fine detail and broad area coverage, PG can be used on a wide range of substrates including self-adhesive labels, coated and uncoated paper and board plus a wide range of plastics and natural materials such as leather and wood. In fact it can be used on anything from ballet shoes to brake pads .\" Working in collaboration with Newfoil, based in Bolton, API is launching the PG grade to platen press stamping label manufacturers in the UK. Commenting on PG after initial customer trials, Steve Tonge of Dotaprint Labels said: \"This foil makes label printing so much easier, one foil that suits all substrates and even works when printing foil on foil .\" Janet Clarkson, Director of Newfoil says; \"Initial customer trials have produced some truly exceptional results and as the leading hot foil distributor in the UK, we welcome a foil that not only delivers high performance, versatility and reliability, but also provides an easy machine set up .\" The new PG foils are available in a well defined range of colours and complement the comprehensive range of products that we already offer to the labeling industry. \"PG has an easy release and excellent adhesion. Depending on the machine type and application, it typically has activation at 85oC with an operating temperature of between 100oC to 1500C. For best results it has a recommended top temperature of 170oC. The new foil has good resistance to water, plasticiser migration and to wines and spirits. It is non-toxic and meets stringent compliance and legislation across numerous industry standards worldwide. Manufactured in Livingston, UK, PG is available worldwide through the company's dedicated distribution centres. REXAM DEVELOPS BESPOKE CUT-OUT TAB FOR CARLSBERG BEER...KNOWLEDGESHARE LIVE IN DUBAI - INTERNATIONAL FORUM TO ADDRESS GLOBAL BEVERAGE CHALLENGES Packaging Today is a product of Global Trade Media, a trading division of Progressive Media Group Limited. © 2015, All Rights Reserved. privacy policy. In the latest update it explains what cookies are and how we use them on our site. To learn more about cookies and their benefits, please view our", "articleID": "2015010716_00072723_W", "names": {"Andy Kerr": ["Q4760890", "Q4760892", "Q526409"]}}, {"date": "2015-01-08", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/7143919", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. SandRidge Energy, Inc.. Updates Shareholders on Financial Results for Third Quarter 2014 and First Nine Months of 2014 SandRidge Energy, Inc.. Updates Shareholders on Financial Results for Third Quarter 2014 and First Nine Months of 2014 Reported Adjusted Earnings of $0.07 per Diluted Share and Adjusted EBITDA of $225 Million for the Third Quarter Restated 2013-2014 Quarterly Financial Results to Incorporate New Accounting Treatment Will Announce 2015 Capex Plans In February Fully Undrawn Borrowing Base is $1.2 Billion with Current Facility of $900 Million Jan. 8, 2015 / PRNewswire /--SandRidge Energy, Inc. (the \"Company\" ) (NYSE: SD) today announced financial results for the quarter that ended September 30, 2014. The Company also filed restated results for quarterly periods in 2013 and 2014. Eddie LeBlanc, SandRidge's Chief Financial Officer and Executive Vice-President, commented, \"Today's release of financial results for the third quarter of 2014 complements our November 2014 operating results press release. As the result of discussions with the SEC, we are now accruing a portion of the annual CO 2 under delivery penalty each quarter which we previously recorded at the end of each year. Restated financial statements are included in amended historic quarterly and annual reports we are filing today. Importantly, annual results and cash flows remain unchanged .\" Key Financial Results Third Quarter Adjusted EBITDA, pro forma for divestitures and net of Noncontrolling Interest, was $225 million in the third quarter of 2014 compared to $160 million in the third quarter of 2013, 41% year-over-year growth. $203 million for third quarter 2014 compared to $227 million in third quarter 2013. Adjusted net income of $0.07 per diluted share, for third quarter 2014 compared to adjusted net income of $0.06 per diluted share, in third quarter 2013. Nine Months Adjusted EBITDA, pro forma for divestitures and net of Noncontrolling Interest, was $596 million in the first nine months of 2014 compared to $418 million in the first nine months of 2013, 42% year-over-year growth. $509 million for first nine months of 2014 compared to $569 million in first nine months of 2013. Included in the first nine months of 2014 results is $70 million of cash paid to unwind hedges related to the Adjusted net income of $109.2 million, or $0.19 per diluted share, for first nine months of 2014 compared to adjusted net income of $0.11 per diluted share, in first nine months of 2013. Adjusted net income available to common stockholders, pro forma adjusted EBITDA and adjusted operating cash flow are non-GAAP financial measures. Each measure is defined and reconciled to the most directly comparable GAAP measure under \"Non-GAAP Financial Measures\" beginning on page 7. As previously discussed in a Form 8-K filed on November 4, 2014, the Company has been in discussions with the Securities and Exchange Commission regarding certain accounting matters. As a result of these discussions, the Company restated its 2013 Annual Report on Form 10-K and its Quarterly Reports on Form 10-Q for the quarters ended June 30, 2014. For the three month periods ended, March 31, 2013 and 2014 and June 30, 2013 and 2014, an estimated CO 2 under delivery shortfall penalty was recorded in each quarter. The effect of the restatement for 2013 is to transfer a portion of the annual CO 2 under delivery shortfall penalty accrual that was previously recorded at year-end to the quarter-end periods within such year. The change in accounting treatment impacts the first, second and third quarters of 2013 by approximately $8 million of net income per quarter, while rendering no change to the 2013 annual net income. The first and second quarters of 2014 are also impacted by approximately $8 million of net income per quarter. Additionally, the Company also revised the recording of the Century Plant construction contract to account for it under the full cost method of accounting rather than the completed contract method of accounting for the year ended 2012. This resulted in eliminating an equal amount of income and expense from the 2012 Condensed Consolidated Statements of Operations and had no impact on total assets, total liabilities, net income or retained earnings. These restatements along with our Form 10-Q for the three month period ended September 30, 2014, which also included restated financial information related to the delivery shortfall penalty accrued for the three month period ended September 30, 2013, were filed on January 8, 2015. <mark>James Bennett</mark>, SandRidge's Chief Executive Officer and President, stated, \"As highlighted in our November third quarter operations update, we're expanding our low cost multilateral program and successfully extending our Mid-Continent resource base with Woodford production. Since the operating update, oil prices have fallen sharply; however, SandRidge is defensively positioned for 2015. We have an enviable hedge position on the vast majority of our liquids production, have no bond maturities until 2020 and at quarter end $1.4 billion of liquidity. Importantly, our Mid-Continent drilling program continues to generate commercial returns, even at current commodity prices. Given the market backdrop, we are high grading our development plans and are already reducing our rig count and capex levels. We anticipate announcing 2015 capital plans and full year guidance in February. Meanwhile, our teams are focused on continued well cost reductions, now further supported by likely lower service costs ahead .\" Operational and Financial Statistics Excludes production attributable to Permian properties (sold first quarter 2013) and Gulf of Mexico properties (sold first quarter 2014). Expense for three and nine-month periods ended September 30, 2013 has been restated for quarterly accrual of CO Excludes transaction costs, legal settlements, severance and consent solicitation costs totaling $0.1 million and $7.5 million for the three and nine-month periods ended September 30, 2014, respectively. Excludes transaction costs, legal settlements, severance, annual incentive plan adoption effect and consent solicitation costs totaling $2.7 million and $102.2 million for the three and nine-month periods ended September 30, 2013, respectively. Excludes $0.2 million and $2.2 million for the three and nine-month periods ended September 30, 2014, respectively, and $1.7 million and $54.7 million for the three and nine-month periods ended September 30, 2013, respectively, for the acceleration of stock awards. Includes accretion of asset retirement obligation. Includes shares considered antidilutive for calculating earnings per share in accordance with GAAP for certain periods presented. The table below sets forth the Company's consolidated oil and natural gas price swaps and collars for the years 2015 and 2016 as of The Company's capital structure at September 30, 2014 During the third quarter of 2014, the Company's debt, net of cash balances, increased by approximately $330 million as a result of funding the Company's drilling program. The Company had no amount drawn under its senior credit facility. Non-GAAP Financial Measures Adjusted operating cash flow, adjusted EBITDA, pro forma adjusted EBITDA, adjusted net income and adjusted net income attributable to noncontrolling interest are non-GAAP financial measures. The Company defines adjusted operating cash flow as net cash provided by operating activities before changes in operating assets and liabilities and adjusted for cash (paid) received on financing derivatives. It defines EBITDA as net income (loss) before income tax (benefit) expense, interest expense and depreciation, depletion and amortization and accretion of asset retirement obligations. Adjusted EBITDA, as presented herein, is EBITDA excluding asset impairment, interest income, (gain) loss on derivative contracts net of cash received (paid) on settlement of derivative contracts, (gain) loss on sale of assets, transaction costs, legal settlements, consent solicitation costs, severance, loss on extinguishment of debt and other various non-cash items (including non-cash portion of noncontrolling interest and stock-based compensation). Pro forma adjusted EBITDA, as presented herein, is adjusted EBITDA excluding adjusted EBITDA attributable to properties or subsidiaries sold during the period. Adjusted operating cash flow and adjusted EBITDA are supplemental financial measures used by the Company's management and by securities analysts, investors, lenders, rating agencies and others who follow the industry as an indicator of the Company's ability to internally fund exploration and development activities and to service or incur additional debt. The Company also uses these measures because adjusted operating cash flow and adjusted EBITDA relate to the timing of cash receipts and disbursements that the Company may not control and may not relate to the period in which the operating activities occurred. Further, adjusted operating cash flow and adjusted EBITDA allow the Company to compare its operating performance and return on capital with those of other companies without regard to financing methods and capital structure. These measures should not be considered in isolation or as a substitute for net cash provided by operating activities prepared in accordance with generally accepted accounting principles (\"GAAP\" ). Adjusted EBITDA should not be considered as a substitute for net income, operating income, cash flows from operating activities or any other measure of financial performance or liquidity presented in accordance with GAAP. Adjusted EBITDA excludes some, but not all, items that affect net income and operating income and these measures may vary among other companies. Therefore, the Company's adjusted EBITDA may not be comparable to similarly titled measures used by other companies. Management also uses the supplemental financial measure of adjusted net income, which excludes tax (benefit) expense adjustment, asset impairment, (gain) loss on derivative contracts net of cash received (paid) on settlement of derivative contracts, (gain) loss on sale of assets, transaction costs, legal settlements, consent solicitation costs, loss on extinguishment of debt, severance and other non-cash items from income available (loss applicable) to common stockholders. Management uses this financial measure as an indicator of the Company's operational trends and performance relative to other oil and natural gas companies and believes it is more comparable to earnings estimates provided by securities analysts. Adjusted net income is not a measure of financial performance under GAAP and should not be considered a substitute for loss applicable to common stockholders. The supplemental measure of adjusted net income attributable to noncontrolling interest is used by the Company's management to measure the impact on the Company's financial results of the ownership by third parties of interests in the Company's less than wholly-owned consolidated subsidiaries. Adjusted net income attributable to noncontrolling interest excludes the portion of asset impairment, (gain) loss on derivative contracts net of cash (paid) received on settlement of derivative contracts, legal settlement and loss on sale of assets attributable to third-party ownership in less than wholly-owned consolidated subsidiaries from net loss attributable to noncontrolling interest. Adjusted net income attributable to noncontrolling interest is not a measure of financial performance under GAAP and should not be considered a substitute for net income attributable to noncontrolling interest. The tables below reconcile the most directly comparable GAAP financial measures to operating cash flow, EBITDA and adjusted EBITDA, adjusted net income available to common stockholders and adjusted net income attributable to noncontrolling interest. Excludes unrealized gains on interest rate swaps of $2.4 million for the nine-month period ended September 30, 2013. Excludes amounts paid upon early settlement of derivative contracts. Includes loss on the Permian divestiture of approximately $398.9 million for the nine-month period ended September 30, 2013. Represents depreciation and depletion, impairment, loss on sale of Permian Properties (2013), (gain) loss on commodity derivative contracts net of cash (paid) received on settlement, legal settlement and income tax expense attributable to noncontrolling interests. Excludes unrealized gains on interest rate swaps of $2.4 million for the nine-month period ended September 30, 2013. Excludes depreciation and depletion, impairment, loss on sale of Permian Properties (2013), (gain) loss on commodity derivative contracts net of cash (paid) received on settlement, legal settlement and income tax expense attributable to noncontrolling interests. Excludes amounts attributable to noncontrolling interests. Weighted average fully diluted common shares outstanding for certain periods presented includes shares that are considered antidilutive for calculating earnings per share in accordance with GAAP. Conference Participation SandRidge Energy, Inc. will participate in the following upcoming events: - Goldman Sachs' Global Energy Conference; - Global Hunter Securities' Southern California Energy 1x1 Day; March 24, 2015 - Howard Weil Energy Conference; New Orleans, LA At 8:00 am Central Time on the day of each presentation, the corresponding slides and any webcast information will be accessible on the Investor Relations portion of the Company's website at www.sandridgeenergy.com. Please check the website for updates regularly as this schedule is subject to change. Also, please note that SandRidge Energy, Inc. intends for its website to be used as a reliable source of information for all future events in which it may participate as well as updated presentations regarding the Company. Slides and webcasts (where applicable) will be archived and available for at least 30 days after each use or presentation. Fourth Quarter 2014 Earnings Release and Conference Call February 26, 2015 (Thursday) - Earnings press release after market close February 27, 2015 (Friday) - Earnings conference call at SANDRIDGE ENERGY, INC.. AND SUBSIDIARIES CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS SANDRIDGE ENERGY, INC.. AND SUBSIDIARIES CONDENSED CONSOLIDATED BALANCE SHEETS SandRidge Energy, Inc. stockholders' equity Preferred stock, $0.001 par value, 50,000 shares authorized 8.5% Convertible perpetual preferred stock; 2,650 shares issued and outstanding at September 30, 6.0% Convertible perpetual preferred stock; 2,000 shares issued and outstanding at September 30, 7.0% Convertible perpetual preferred stock; 3,000 shares issued and outstanding at September 30, 2014 and December 31, 2013; aggregate liquidation preference of $300,000 Common stock, $0.001 par value, 800,000 shares authorized; 491,262 issued and 490,224 outstanding at SANDRIDGE ENERGY, INC.. AND SUBSIDIARIES Supplemental Disclosure of Cash Flow Information For further information, please contact: Duane M. Grubert EVP - Investor Relations and Strategy SandRidge Energy, Inc. 123 Robert S. Kerr Avenue (405) 429-5515 Cautionary Note to Investors - This press release includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements express a belief, expectation or intention and are generally accompanied by words that convey projected future events or outcomes. The forward-looking statements include statements about the Company's future capital spending, drilling and development plans, estimates of oil and natural gas production, rates of return, derivative transactions, liquidity, debt maturities and operating costs. We have based these forward-looking statements on our current expectations and assumptions and analyses made by us in light of our experience and our perception of historical trends, current conditions and expected future developments, as well as other factors we believe are appropriate under the circumstances. However, whether actual results and developments will conform with our expectations and predictions is subject to a number of risks and uncertainties, including the volatility of oil and natural gas prices, our success in discovering, estimating, developing and replacing oil and natural gas reserves, actual decline curves and the actual effect of adding compression to natural gas wells, the availability and terms of capital, the ability of counterparties to transactions with us to meet their obligations, our timely execution of hedge transactions, credit conditions of global capital markets, changes in economic conditions, the amount and timing of future development costs, the availability and demand for alternative energy sources, regulatory changes, including those related to carbon dioxide and greenhouse gas emissions and other factors, many of which are beyond our control. We refer you to the discussion of risk factors in Part I, Item 1A - \"Risk Factors\" of our amended Annual Report on Form 10-K/A for the year ended December 31, 2013. All of the forward-looking statements made in this press release are qualified by these cautionary statements. The actual results or developments anticipated may not be realized or, even if substantially realized, they may not have the expected consequences to or effects on our company or our business or operations. Such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. We undertake no obligation to update or revise any forward-looking statements. SandRidge Energy, Inc. (NYSE: SD) is an oil and natural gas Company headquartered in Oklahoma City, Oklahoma with its principal focus on exploration and production. SandRidge and its subsidiaries also own and operate gas gathering and processing facilities, saltwater gathering and electrical infrastructure facilities and conduct marketing operations. In addition, Lariat Services, Inc., a wholly-owned subsidiary of SandRidge, owns and operates a drilling rig and related oil field services business. SandRidge focuses its exploration and production activities in the Mid-Continent region of the United States. SandRidge's internet address is To view the original version on PR Newswire, visit: http: //www.prnewswire.com/news-releases/sandridge-energy-inc-updates-shareholders-on-financial-results-for-third-quarter-2014-and-first-nine-months-of-2014-300018189.html (Source: PR Newswire) (Source: Quotemedia) Sandridge Energy (SD) - 8.5% Convertible Perpetual Preferred Stock Futures Down After Bernanke Comments, Fed Decision; Red Hat Inc (RHT) Gains SandRidge Energy, Inc.. Updates Shareholders on Financial Results for Third Quarter 2014 and First Nine Months of 2014 SD--UPCOMING DEADLINE: LEVI & KORSINSKY, LLP Reminds Investors of Class Action Against SandRidge Energy, Inc. and Its Board of Directors and a Lead Plaintiff Deadline of January 12, 2015--SD UPCOMING DEADLINE: The Law Offices of <mark>Vincent Wong</mark> Notifies Investors of Class Action Involving SandRidge Energy, Inc. and a Lead Plaintiff Deadline of January 12, 2015 Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein.", "articleID": "2015010821_00070492_W", "names": {"James Bennett": ["Q58421068", "Q6129668", "Q6129676"], "Vincent Wong": ["Q21931904", "Q7186504", "Q7932114"]}}, {"date": "2015-01-11", "url": "http://medicinehatnews.com/sports/national-sports/2015/01/11/rex-ryan-accepts-offer-to-coach-buffalo-bills-says-person-familiar-with-talks/", "content": "By John Wawrow, The Associated Press on January 11, 2015. BUFFALO, N.Y. - Rex Ryan is staying in the AFC East after reaching an agreement Sunday to coach the Buffalo Bills. A person familiar with the talks told The Associated Press the former New York Jets coach accepted the Bills' contract offer after two days of discussions. The person spoke on the condition of anonymity because the Bills have not discussed their search to replace Doug Marrone, who stepped down abruptly Dec. 31. The offer was made a day after the Bills identified Ryan as a finalist and met with him for a second time in South Florida, where new owners Terry and Kim Pegula live. Ryan was one of 12 candidates to interview for the job since last weekend. At the same time, a second person familiar with talks told the AP the Bills are negotiating to hire Greg Roman as offensive co-ordinator. Roman, a finalist for the Bills' coaching job, spent the past four years as the San Francisco 49ers' offensive co-ordinator. Roman's future is uncertain in San Francisco after coach Jim Harbaugh left to coach Michigan. This is the Bills' sixth coaching search since Wade Phillips was fired after the 2000 season and the first since the Pegulas bought the team from the estate of Hall of Fame owner Ralph Wilson in October. The Bills went 9-7 to match their best record in a decade, but missed the playoffs to extend the NFL's longest active drought to 15 seasons. Ryan is very familiar with the Bills after spending the past six seasons coaching the Jets, Buffalo's AFC East rival. He had a 50-52 record, including 4-2 in the playoffs, with the Jets before being fired along with general manager John Idzik following a 4-12 finish. Ryan's father, Buddy, also had ties to Buffalo after spending 1961-65 as an assistant coach at the University at Buffalo. Ryan's strength is defence, as it is with the Bills. Buffalo's defence finished fourth in the NFL in yards allowed last season and produced three Pro Bowl linemen. It's unclear how Ryan's arrival would affect the status of Buffalo's current defensive co-ordinator Jim Schwartz, who completed his first season with the Bills. Schwartz is the former Detroit Lions coach and was a candidate for the Bills' job. Ryan's challenge in Buffalo would be similar to the one he had in New York - providing a spark to a sputtering offence. The Jets finished 22nd in yardage last season - four spots ahead of Buffalo. Quarterbacks were concerns for both teams, involving two players drafted in 2013 draft. The Jets faltered behind second-year starter Geno Smith, who was eventually benched and replaced by Michael Vick. In Buffalo, second-year starter EJ Manuel was benched after four games and replaced by 10-year journeyman Kyle Orton, who has since said he plans to retire. Manuel has two years left on his contract and is the only experienced starter on the roster. Bills players were already expressing their support for Ryan in posts made on their Twitter accounts. \"Love the hire!\" centre <mark>Eric Wood</mark> tweeted. Rookie receiver, and former Clemson player, <mark>Sammy Watkins</mark> wrote, \"Can't wait, gotta love REX RYAN,\" and then linked a photo Ryan wearing a Clemson T-shirt and posing with several Tigers players. Running back <mark>Fred Jackson</mark> wrote: \"Excited about the hire of Rex!! Great coach to come in and keep us moving in the right direction!\" Roman is regarded as a good fit under Ryan, because the two share a similar run-first philosophy. Under Roman, the 49ers' running attack ranked among the NFL's top 10 in each of the past four seasons. National Advertising: 403.528.5766 Online Advertising: 403.528.5698", "articleID": "2015011122_00039368_W", "names": {"Eric Wood": ["Q28756456", "Q3731545", "Q55452515", "Q58128614"], "Fred Jackson": ["Q1452376", "Q18601857", "Q3752634", "Q5495575"], "Sammy Watkins": ["Q7409856", "Q7409857"]}}, {"date": "2015-01-12", "url": "http://www.mortgagesolutions.co.uk/mortgage-solutions/news/2389800/questions-raised-over-sesame-protection-premiums-and-commissions", "content": "Questions raised over Sesame protection premiums and commissions Mortgage Solutions | 12 Jan 2015 | 13:56 An analysis of premiums and commissions found that premiums for protection products sold by Sesame's \"restricted focussed' advisers can be as much as 13% higher than for an identical product sold by its\" universal' advisers. Sesame restricted panel providers all deny breaching FCA inducement rules Sesame angers advisers with past advice crackdown after £ 6m fine The investigation had been prompted by concerned Sesame advisers. Providers have said the differences are down to Sesame, not them. Sesame Bankhall group chairman <mark>John Cowan</mark> said the model of charging higher premiums in one part of a business over another is \"the general market position, it pertains inside all sorts of financial services businesses\". But advisers have suggested the approach may not represent treating customers fairly (TCF). All Sesame advisers are \"restricted' by the regulator's definition, but the network operates two advice models within that. The first is\" universal', a whole of market arm which largely houses those Sesame advisers who were independent under the pre-Retail Distribution Review (RDR) definition of the term. The second is \"focussed', a much smaller proposition for advisers who must pick products from a panel of around six providers. In illustrations provided by Sesame advisers to Professional Adviser, for an individual, 15-year £ 200,000 life insurance policy for a male, non-smoker born in the 1960s, the difference in the monthly premium paid by a client of a\" universal' adviser can be about £ 5 less than a client transacting with a \"focussed' adviser, depending on provider. Over the lifetime of the policy, that means the client would pay around £ 1,000 more with a Sesame restricted focussed adviser. However, the difference is even starker in the example of a couple where critical illness (CI) cover and a waiver of premium - known as premium protection - have been added. In another illustration, for a husband and wife who are both non-smokers and are both aged 49, buying 20-year life insurance with CI cover and premium protection using a Sesame focussed adviser, the monthly premium is £ 418. For the same couple, taking the same products, from the same provider, but using a Sesame universal adviser, the monthly premium is £ 369 - 13% less. Over the 20-year lifetime of those products, the couple using the focussed adviser would pay £ 11,544 more than if they had gone to a universal adviser. The model Focussed protection advisers must choose products from a panel of just six providers: Aviva, Aegon, Bright Grey, Zurich, PruProtect and Friends Life. Universal advisers typically choose from around 13. There is no requirement for a Sesame focussed adviser to tell a client they could buy the same product cheaper from one of the network's universal advisers. The amount of commission paid by providers for products sold via Sesame's focussed advisers is also significantly higher, as commissions are linked to premiums. In the example of the couple above, the difference in the upfront commission paid is almost £ 5,000. Commission is paid by the product provider directly to Sesame, which takes its cut before passing the remainder onto the adviser. According to Sesame advisers, the network takes a single digit percentage of the per product commissions earned by universal advisers, but a percentage around three times higher on the greater commissions paid by providers for products sold by focussed advisers. Protection advice was not included in the commission ban, meaning advisers can still get paid by the providers of the products they sell. The amount they get paid must be disclosed to clients, but - like with the premiums - clients would not realise the different amounts being paid for the sale of products via focussed and universal advisers. Sesame Bankhall group chairman <mark>John Cowan</mark> said the model of having higher premiums and commissions in some parts of a business\" is not exclusive to Sesame \".\" It is the general market position. It pertains inside all sorts of financial services businesses. Certain business models are constructed in different ways. Different premiums are paid for products. The different price is due to differences between the universal and focussed advisers' business models, \"he said .\" Out of the higher commissions, professional indemnity (PI) cover is bought for [focussed advisers], regulatory fees are paid. But focussed advisers run a business for which they can charge a premium for. \"He added that the focussed part of the business is\" tiny \", with less than 50 advisers choosing that model. Sesame has around 2,000 adviser members in total. He defended the lack of disclosure to clients about the difference in price and commissions between Sesame's focussed and universal advisers .\" When someone goes to a universal adviser they don't have a conversation about restricted versus independent. It's the same when an adviser is restricted focussed. The world doesn't work like that. If I go to an IFA in London and Poole I'll get charged a different price for the same service, \"he said. But advisers said the model is more akin to two clients being charged differently for the same service by the same adviser. One, who asked not to be named, said:\" What doesn't sit right with this scenario is that we are effectively talking about the same distributor. Different adviser firms, but the products being distributed are being facilitated via the same network. If these were rival distribution channels, say IFA versus non-advised, then all's fair in love and war. But in this scenario the two advisers are operating under the same umbrella. \"The providers Asked why providers who feature on the focussed protection panel were willing to pay higher commissions, <mark>Cowan</mark> admitted it is probably because they think they are going to do more business due to the restricted nature of the options available to the advisers using it .\" The provider is paying higher commissions probably because they think they are going to get a lot of business from the focussed panel. Loads of life companies operate that system. We couldn't offer that unless the life companies are offering that. It must be profitable for them, \"he said. The Financial Conduct Authority (FCA) fined Sesame £ 1.6 m in October after it found the network had set up what it termed a\" pay-to-play' scheme, relating specifically to the panel used by its focussed investment advisers. The range of products recommended to Sesame clients under its focussed investment advice service was influenced by the amount product providers were willing to pay Sesame for certain services, the regulator ruled, saying it \"undermined the ban on commission payments brought in by the RDR\". All seven product providers on Sesame's \"focussed' restricted investment advice panel denied breaching the regulator's rules on inducements. Professional Adviser spoke to each of the six providers on Sesame's restricted focussed protection panel. All of them refused to discuss their commercial terms. However PruProtect, which gave the most detailed response, said the difference in premiums is down to Sesame .\" Networks and other distributors ask insurers for different pricing strategies for certain circumstances, it would be a question for the network or intermediary as to why they do so, \"a spokesperson for PruProtect said .\" We have a standard price (premium) which we set but some distributors ask for different pricing to suit certain strategies. Networks would tend to do this at group level rather than by individual adviser. It's a question for the network as to what their strategy is and why they need differentiated premiums, \"he said. On the difference in commissions he added:\" While we do not comment on any specific arrangements, it is common practice for protection insurers to vary the level of commission paid to intermediary firms depending on a range of different factors and commission payments are fully disclosed within all quotes provided. \"Aviva, Aegon, and Friends Life said only that they would not comment on commercial terms with individual distributors. A spokesperson for Zurich said:\" Zurich works diligently to ensure that all of our arrangements with key distributors and third parties deliver good outcomes for our customers. We consider the overall business opportunity of each distribution model separately and so the commission terms will vary between different agreements. \"Bright Grey also said the differences between the restricted focussed commissions and premiums and those of the universal proposition were negotiated by Sesame .\" Our distribution partners offer a range of different protection propositions, each of which is underpinned by different features and services such as technology, training, compliance and research. Vote in our polls, get your opinion across on the news and watch out for our weekly editorial round-up features. Withdrawn XF003, XF004 and XF001 and XF002 and launched XF0013, XF0014, XF0015 and XF0016", "articleID": "2015011214_00049418_W", "names": {"John Cowan": ["Q16196890", "Q16730319", "Q19276601", "Q56254372", "Q6227357"]}}]