[{"articleID": "2017080113_00464785_W", "names": {"Daniel Lee": ["Q2215646", "Q41065588", "Q42313359", "Q43085242", "Q5217896", "Q706142", "Q9430586"], "Nick Walsh": ["Q16196325", "Q30122335"]}, "date": "2017-08-01", "url": "http://www.nottinghampost.com/news/nottingham-news/man-jailed-strangling-ex-partner-261557", "content": "A \"controlling' partner has been jailed after he strangled his partner to the point she thought she was going to die. <mark>Daniel Lee</mark>, 30, previously of Bulwell, punched the woman in the face after she returned home from visiting his sister in June. Nottingham Crown Court heard on Tuesday (August 1) he then grabbed her throat with his left hand and squeezed. <mark>Lee</mark> punched her numerous times in her face and hit her head hard on the back board of the sofa.\" She struck her head on the back board, \"said Andrew Tanser, prosecuting.\" He moved his right and left hand to her throat and squeezed. She felt her face start to tingle and thought she was going to die. This lasted at least ten to 15 seconds. All of a sudden he let go \". Read More Nine year jail term for burglar who carried out violent £ 38,000 raid Nottingham Crown Court The woman ran from the house. She said she was left with marks on her neck and a very bad headache, added Mr Tanser.\" She describes being assaulted numerous times over the last few years. Her honest belief was he was going to kill her and she was going to die at the time he strangled her. She wants nothing more to do with him and wants him to stay away \". Mr Tanser added:\" He started to become very controlling and stopped her seeing friends and family. He wouldn't allow her out of the house to see them. He took hold of her bank card. She wasn't allowed her own money unless she asked for it \". <mark>Lee</mark>, who has been in Lincoln Prison on remand, pleaded guilty to assault, causing bodily harm. Read More Passenger who tried to get out of moving car was left hanging onto door in police chase Judge Gregory Dickinson QC sent him to prison for 18 months. He imposed a restraining order, stopping <mark>Lee</mark> from contact his now ex-partner. The judge gave him six points on his driving licence for driving without insurance. There will also be an endorsement on his driving record for having no licence. He told <mark>Lee</mark> he had two previous convictions for battery in 2012 on his partner. Of the latest attack, the judge said:\" You grabbed her around the throat with both hands and squeezed so hard, she was struggling to breathe. She feared she was going to die. \"I have seen photographs of marks to her neck\" . <mark>Lee</mark> said from the dock: \"I'm sorry\" . Read More Man denies attempting to abduct a child in Beeston The judge said: \"She still looks back on that as the worst day of her life and it will affect her for a long time to come\" . Solicitor <mark>Nick Walsh</mark>, mitigating, said his client \"wouldn't accept that he is controlling in nature\" . \"He disputes what has been said about money; she had her own money in the past.\" He knows a custodial sentence is inevitable in his case today \"."}, {"articleID": "2014031421_00026151_W", "names": {"Luis Rodriguez": ["Q1232924", "Q3266810", "Q3840413", "Q55092359", "Q6701065"]}, "date": "2014-03-14", "url": "http://thenewcivilrightsmovement.com/1-police-accused-of-pepper-spraying-handcuffing-and-beating-to-death-unarmed-non-violent-man/news/2014/03/14/84362", "content": "One month ago today was Valentine's Day. In Moore, Oklahoma, the <mark>Rodriguez</mark> family, <mark>Luis</mark>, 44, his wife Nair, and their 19-year old daughter went to the movies, but after a family fight, they left the movie and headed for the family car in the parking lot. What happened at that point is unclear, but what seems certain is that the mother and daughter had a minor altercation, and three police officers aided by two Oklahoma state game wardens moonlighting as security guards, pepper-sprayed <mark>Luis Rodriguez</mark>, took him down to the ground, handcuffed him, and beat him. \"Papa! Is he OK? He doesn't move!,\" Nair <mark>Rodriguez</mark> in the video she recorded can be heard saying. \"He doesn't move! You killed him! You killed him! You killed my husband!\" By the time the assault was over, <mark>Rodriguez</mark>, bloody and battered, was not moving. Police say he died after being taken to the hospital, although his wife insisted he was dead at the scene. Why were the cops so intent on beating <mark>Rodriguez</mark>, possibly to death? \"He refused to give his ID,\" one of the officers said, according to CNN. UPI reports that \"Moore Police Chief Jerry Stillings has said the use of force was appropriate.\" \"We're obligated to detain and investigate,\" Stillings said at a press conference. \"If someone does not cooperate with that investigation, we have to do what we have to do to get that information.\" The three police officers have been suspended, but with pay. NewsOK notes that \"the family's attorney, Michael Brooks-Jimenez, made public the six-minute video shot by Nair <mark>Rodriguez</mark>. In it, <mark>Luis Rodriguez</mark> doesn't appear to struggle or move while the officers detain him.\" Nair <mark>Rodriguez</mark> can be heard asking her husband if he's OK while officers attempt to calm her down and repeatedly ask for her and her daughter's ID. Officers appear to prop him up into a seated position partway through the video. \"I'm recording because this is too much,\" Nair <mark>Rodriguez</mark> tells them. The results of the autopsy, one month later, have not been released. Watch Nair <mark>Rodriguez</mark>'s video, but be warned, it is heartbreaking and extremely disturbing: More Digg Print Share on Tumblr Email Pin It Tagged as: excessive force, killed, <mark>Luis Rodriguez</mark>, Moore, Oklahoma, police brutality Friends: We invite you to sign up for our new mailing list, and subscribe to The New Civil Rights Movement via email or RSS. Also, please like us on Facebook, and follow us on Twitter!"}, {"articleID": "2015041622_00003610_W", "names": {"Daniel Goldberg": ["Q1160874", "Q5217295", "Q5762739"], "Lee Smith": ["Q1078252", "Q13563113", "Q1811998", "Q3228933", "Q3829387", "Q6515097"]}, "date": "2015-04-16", "url": "http://tabletmag.com/scroll/190332/in-support-of-jewish-lgbtq-youth", "content": "My Teacher's Son: A Memoir of Heresy Is Marked By a Father's Unnerving Piety The Scroll In Support of Jewish LGBTQ Youth (Photo illustration Tablet Magazine; original photos Shutterstock) Leading Orthodox Rabbis will meet with mental health professionals to publicly discuss the controversial issue of conversion therapy for LGBT Jews at a mental health conference on Sunday. Earlier this month, the Obama Administration said it supports efforts to ban the use of conversion therapy on gay and transgender minors. \"The end goal of this conference is that our leaders and experts will be well informed and able to provide proper care to LGBT Jews,\" Mordechai Levovitz, a conference co-chair, told me. A gay, Orthodox man, Levovitz is also the founder and director of JQY, a non-profit organization dedicated to providing crisis and support resources for at-risk LGBT youth in the Orthodox & Hasidic community. Levovitz explained that the conference is a way for the orthodox rabbinical community and the therapeutic community to work together. \"Therapists can't provide care if they don't understand the orthodox community and rabbis can't provide proper guidance if they don't understand the psychological issues at hand,\" he said. \"This conference isn't about advocacy but rather it's an opportunity for learning and dialogue.\" \"The question that this conference is asking isn't whether you can be both gay and Orthodox, because that is a very judgmental question. The question is: How can we provide responsible support for LGBT people in the orthodox community?\" In an interview, Levovitz explained that this question challenges the Jewish leaders in power as opposed to victims in the community. According to Levovitz, JQY influenced the Rabbinical Council of America's 2012 decision to rescind their recommendation of JONAH - the largest Jewish conversion therapy organization. Sean Herzfeld, a 15-year-old JQY member who recently came out to his Orthodox high school, was quoted in a press release as saying that \"It's not enough to simply tell LGBT teens in religious communities that it gets better later. We have to work within the community to make it better now.\" The Keynote speakers at the conference will be RCA Honorary President Rabbi Shmuel Goldin and RCA Executive Vice President Rabbi Mark Dratch. They will joined by mental health professionals including Dr. Jack Drescher and Dr. Mark Blechner, Editor in Chief Emeritus of the journal Contemporary Psychoanalysis, and Dr Alison Feit, Executive Director of The Jewish Center for Trauma and Recovery. JQY will hold the conference at the Kraft Center in New York together with the William Alanson White Institute of Psychiatry, Psychoanalysis and Psychology. Gay and Lesbian youth from families that reject their sexual or gender preferences are more than 8 times as likely to have attempted suicide. Related: Orthodox Parents of LGBT Children Navigate Their Own Coming Out Process Daily rate: $2 Monthly rate: $18 Yearly rate: $180 WAIT, WHY DO I HAVE TO PAY TO COMMENT? Tablet is committed to bringing you the best, smartest, most enlightening and entertaining reporting and writing on Jewish life, all free of charge. We take pride in our community of readers, and are thrilled that you choose to engage with us in a way that is both thoughtful and thought-provoking. But the Internet, for all of its wonders, poses challenges to civilized and constructive discussion, allowing vocal-and, often, anonymous-minorities to drag it down with invective (and worse). Starting today, then, we are asking people who'd like to post comments on the site to pay a nominal fee-less a paywall than a gesture of your own commitment to the cause of great conversation. All proceeds go to helping us bring you the ambitious journalism that brought you here in the first place. I NEED TO BE HEARD! BUT I DONT WANT TO PAY. Readers can still interact with us free of charge via Facebook, Twitter, and our other social media channels, or write to us at letters @ tabletmag.com. Each week, we'll select the best letters and publish them in a new letters to the editor feature on the Scroll. My Teacher's Son: A Memoir of Heresy Is Marked By a Father's Unnerving Piety By Shaul Magid - In and out of the fold of ultra-Orthodoxy, Shulem Deen and his father Dovid both pursued honest religious feeling \"From My Memories...I Will Never Forget It' By <mark>Daniel Goldberg</mark> - My grandmother's account of her liberation from Bergen-Belsen By Vox Tablet - Historian Jonathan Sarna discusses the Great Emancipator's ties to a chiropodist, military men, and other Jews How Often Should Married Jewish Couples Have Sex? By Adam Kirsch - And other matters of conjugal bliss in this week's Talmud study, including a woman's right to sexual fulfillment Inside Obama's Meeting With Jewish Leaders By <mark>Lee Smith</mark> - What he said, what they said, and what America is now saying to the world about exterminationist anti-Semitism Anne Roiphe - Israel is not a normal state. Here's why. Why We Keep Reading About the Shoah By David Mikics - A thorough new history of the Nazi concentration camps challenges us to face again our fears and weakness Enough With the Holocaust Books for Children! By Marjorie Ingall - Yes, we need to teach kids about our history. But our history constitutes a lot more than one tragic event. Larry Sultan's Porn Stars, Mezuzahs, Migrant Workers, and Jewish Mothers Stories for Passover about slavery, freedom, family...and lice In a new biography, Annie Cohen-Solal looks at the immigrant child who changed modern art"}, {"articleID": "2015072313_00117272_W", "names": {"Ajay Kumar": ["Q27909547", "Q4699642", "Q4699643", "Q56524947", "Q58765769"]}, "date": "2015-07-23", "url": "http://brecorder.com/top-news/108-pakistan-top-news/249098-rain-emergency-declared-in-karachi.html", "content": "Rain emergency declared in Karachi Thursday, 23 July 2015 18:47 Posted by Asfia Afzal 10 In view of the expected heavy rains in Karachi, the District Municipal Corporation (DMC), Karachi South, has declared rain emergency. This was announced by the Administrator of DMC Karachi South, Mir Farooq Langov. He said that the rain emergency would be for the protection from any losses during the expected downpour in the area, draining out of the accumulated water and addressing the grievances of the people. An emergency control room has been established at the DMC South office located at its central office near Haqqani Chowk on Rafiqui Shaheed Road. The emergency control room would operate on round the clock basis. Its phone numbers are: 99211390 and 99211429. The concerned staff would remain on duty. According to PDMA assistant director <mark>Ajay Kumar</mark>, the warning has been issued on the recommendation of the Pakistan Meteorological Department. \"There are chances of flash floods in low-lying areas of Karachi, such as Malir and Lyari,\" local media reported. Karachi is likely to expect heavy rains till next five days. Copyright Business Recorder, 2015"}, {"articleID": "2009111117_00046824_W", "names": {"Karen Collins": ["Q26885388", "Q39272290"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2009-11-11", "url": "http://organicauthority.com/blog/organic/organic-food/do-you-eat-deskfast/", "content": "do you eat deskfast? november 11th, 2009 - barbara feiner you're late for work, skip breakfast and grab something when you arrive at your job. in 1996, the dictionary listed a new word for this meal: deskfast. approximately 20% of us indulge in deskfast, according to registered dietitian <mark>karen collins</mark>, nutrition adviser for the american institute for cancer research. the trick is to choose whole-not junk-foods. \"a strategy for a high-energy, health-promoting breakfast is to include a good source of protein plus a whole grain and a fruit or vegetable,\" <mark>collins</mark> says. \"for protein, consider dairy or soy versions of skim milk, low-fat yogurt or reduced-fat cheese, an egg, peanut butter, walnuts or almonds. for a less traditional breakfast, grab leftover chicken or chili.\" juice is one quick way to get vitamins and antioxidants, \"she adds,\" but if you're trying to lose weight or have trouble with mid-morning hunger pangs, studies suggest that solid fruit [or vegetables] may keep you satisfied longer and for fewer calories. \"fresh fruit can pose the greatest deskfast challenge, unless you work close to a store that carries natural and organic foods. <mark>collins</mark> urges readers to wash or cut up fruit the night before. packing a complete deskfast the night before is the most economical option.\" in 5 to 10 minutes, you can make a peanut butter and fruit sandwich on whole wheat, a container of whole-grain cereal with separate containers of milk and fruit to combine at work, or grab dinner leftovers, \"she says. organic food this entry was posted on wednesday, november 11th, 2009 at 8:43 am and is filed under warhol's <mark>michael jackson</mark> portrait sells for $812k - the associated press | <mark>michael jackson</mark> was murdered on spam karma 2: 21765 spams eaten and counting ..."}, {"articleID": "2009040207_00015346_W", "names": {"Bobby Rush": ["Q888599", "Q888655"]}, "date": "2009-04-02", "url": "http://medicalnewstoday.com/articles/144531.php", "content": "0 posts aarp today testified before the house energy and commerce subcommittee on commerce, trade, and consumer protection for its hearing on \"the protecting consumer access to generic drugs act of 2009\" (h.r. 1706). the legislation, sponsored by reps. <mark>bobby rush</mark> (d-il) and henry waxman (d-ca), will help bring lower cost generic drugs to market sooner by preventing abuses in patent settlements between generic and brand prescription drug companies. \"lowering prescription drug prices will be a critical part of comprehensive health reform,\" said aarp board member joanne handy, who delivered the association's testimony. \"generic drugs have proven to be one of the safest and most effective ways for consumers to lower their prescription drug costs. consumers lose when drug makers are able to delay competition by paying off generic manufacturers.\" aarp is proud to endorse \"the protecting consumer access to generic drugs act,' which will put an end to patent settlements that jeopardize the availability of safe, less expensive generic drugs. we look forward to working with reps. <mark>rush</mark> and waxman and their colleagues to pass their legislation as a part of health reform this year.\" aarp's health reform campaign is working to lower prescription drug costs through a variety of changes including ending patent abuse, allowing for the safe and legal importation of lower priced prescription drugs from abroad, closing the medicare part d coverage gap, allowing medicare to negotiate lower prescription drug prices and creating a pathway for the approval of safe generic biologic drugs. for a complete copy of aarp's testimony to the subcommittee, please contact the media relations office at the number above. aarp is a nonprofit, nonpartisan membership organization that helps people 50 + have independence, choice and control in ways that are beneficial and affordable to them and society as a whole. aarp does not endorse candidates for public office or make contributions to either political campaigns or candidates. we produce aarp the magazine, the definitive voice for 50 + americans and the world's largest-circulation magazine with over 34.5 million readers; aarp bulletin, the go-to news source for aarp's 40 million members and americans 50 +; aarp segunda juventud, the only bilingual u.s. publication dedicated exclusively to the 50 + hispanic community; and our website, aarp.org. aarp foundation is an affiliated charity that provides security, protection, and empowerment to older persons in need with support from thousands of volunteers, donors, and sponsors. we have staffed offices in all 50 states, the district of columbia, puerto rico, and the u.s. virgin islands. any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a health care professional. for more information, please read our for any corrections of factual information, or to contact the editors please use our these are the most read articles from this news category for the last 6 months: 28 jan 2009 the pharmacy technician certification board (ptcb) - the pioneer in the certification of pharmacy technicians - announced today that on april 1, 2009, the ptcb examination will be available in continuous testing format at...cough and cold medicines not for children under 6, says health canada walgreen co. announces retirement of jeffrey rein as chairman and ceo - board names alan mcnally chairman and acting ceo"}, {"articleID": "2020040716_00107489_W", "names": {"Bernard Shaw": ["Q10537487", "Q322736", "Q4893642"], "Tim Carroll": ["Q24849258", "Q28043361"]}, "date": "2020-04-07", "url": "http://thestar.com/entertainment/stage/2020/04/07/shaw-festival-cancels-performances-until-june-30-due-to-coronavirus-pandemic.html", "content": "<mark>Shaw</mark> Festival cancels performances until June 30 due to coronavirus pandemic By Debra Yeo Toronto Star Tues., April 7, 2020 timer 2 min. read The show will not go on at the <mark>Shaw</mark> Festival in Niagara-on-the-Lake until at least July. The festival named for playwright George <mark>Bernard Shaw</mark> has announced that it's cancelling all performances and public events until June 30, due to the COVID-19 outbreak. That date matches the one declared by the Town of Niagara-on-the-Lake for cancellation of all in-person events during its state of emergency. But the festival says it will continue to monitor the situation to see if additional cancellations are required. \"You wouldn't believe how much great work this company is still doing, in spite of all the obstacles and uncertainty,\" artistic director <mark>Tim Carroll</mark> said in the news release. \"Of course it is frustrating to be pushing back the date when we hope to perform, but I know we will be ready with deeper and better artistry than ever before.\" One <mark>Shaw</mark> play that will not take the stage at any time in 2020 is \"Mahabharata,\" a Why Not Theatre production based on the 4,000-plus-year-old Sanskrit epic. The production, which features artists and creators from five countries, was to begin rehearsals in June and performances in August, and work had not yet begun on the sets, props and costumes. \"We remain positive and hopeful that we will realize this production in the near future, when it is safe for artists and audiences, both here in Canada and on the international stages for which\" Mahabharata' is destined, \"Why Not artistic director Ravi Jain said in the release.\" While I'm sad to have to postpone it, I really would rather do that than cut corners on what I believe will be an artistic event that people will talk about for years to come, \"he said. YOU MIGHT BE INTERESTED IN...<mark>Shaw</mark> ticket holders can email feedback @ shawfest.com. The province's other major theatre festival, the Stratford Festival, is cancelling performances through the end of May so far, with plans to issue an update in mid-April. Get the latest in your inbox Never miss the latest news from the Star, including up-to-date coronavirus coverage, with our free email newsletters"}, {"articleID": "2009090716_00082275_W", "names": {"George Harrison": ["Q1507529", "Q21288972", "Q21545055", "Q54556306", "Q5540271", "Q5540278"], "John Lennon": ["Q11979004", "Q6244563"], "Yoko Ono": ["Q11464149", "Q117012", "Q16264827"]}, "date": "2009-09-07", "url": "http://iol.co.za/widgets/rss_redirect.php?artid=5154014&sectid=2883&url=ioltechnology&vne=1&csect=IOLTechHome", "content": "london - beatlemania is set to break out again this week when the beatles' digitally remastered albums and a new computer game are released as the world's most famous pop group finally embraces the digital age. the legendary british quartet's entire back catalogue has been remastered and cleaned up, while the fab four appear in the beatles: rock band, which is tipped to become one of the world's biggest selling games. the beatles' company apple corps has historically shunned releasing their music in digital formats due to piracy concerns. but rock band players will be able to download entire albums in the coming months as the 1960s icons catch up with 21st century technology. the beatles' back catalogue was first released on compact disc in 1987, though many fans felt the sound quality did not match the original vinyl, while technological advances since then have highlighted flaws and imperfections. the new versions, to be released on wednesday, include the group's 12 albums, plus the magical mystery tour soundtrack and the past masters releases covering non-album singles. some are tipping them to dominate the charts around the globe. two box sets are also being released: one in stereo and the other in mono. the albums are those released in britain, and retain the original artwork and track listings. it is the first time that the group's first four albums - please please me, with the beatles, a hard day's night and beatles for sale - have been released on compact disc entirely in stereo. the albums were digitally remastered over a four-year period at abbey road studios in london, where the beatles - lead guitarist <mark>george harrison</mark>, rhythm guitarist <mark>john lennon</mark>, bassist paul mccartney and drummer ringo starr - recorded most of their music. the remasters were done \"utilising state of the art recording technology alongside vintage studio equipment, carefully maintaining the authenticity and integrity of the original analogue recordings,\" apple corps and record label emi said. \"the result of this painstaking process is the highest fidelity the catalogue has seen since its original release.\" it was agreed that electrical clicks, microphone vocal pops, excessive sibilance and bad edits should be improved where possible, so long as it didn't impact on the original integrity of the songs, \"they said. de-noising technology was only used for less than five of the beatles' 525 minutes of music. to mark the revival, the bbc is running a beatles week, with programmes examining the band in the studio, their first visit to the united states, their impact in the former soviet union and the beatlemania phenomenon. the broadcasts feature previously unreleased out-takes and studio chat. meanwhile the fab four have been recreated in virtual forms in the beatles: rock band, a game that lets players join the band as they springboard from gigs in their native liverpool, northwest england, to global stardom. players strum away at plastic replicas of guitars played by <mark>lennon</mark>, harrison and mccartney, keep the beat on a version of starr's drum kit, or try out beatles harmonies. forty-five songs are included with the videogame, and more of the bands' tunes will be sold as digital downloads from the internet. the abbey road album will be released in october, followed by sgt. pepper's lonely hearts club band in november and rubber soul in december. the videogame will be available for play on the three major consoles: microsoft's xbox 360, sony's playstation 3, and nintendo's wii. a 30-second clip has been produced to promote the game, using archive footage, actors and computer trickery to bring the famous\" abbey road \"cover to life.\" the project is a fun idea which broadens the appeal of the beatles and their music, \"mccartney said. the concept for the videogame was honed with input from mccartney and starr as well as from beatles widows <mark>yoko ono</mark> and olivia harrison.\" how wonderful that the beatles' legacy will find its natural progression into the 21st century through the computerised world we live in, \"starr said.\" the game is good, the graphics are very good - and we were great. \"- afp social bookmarking allows users to save and categorise a personal collection of bookmarks and share them with others. this is different to using your own browser bookmarks which are available using the menus within your web browser. use the links below to share this article on the social bookmarking site of your choice. free newsletter take a byte out of iol technology by technology - video games: beatles re-master, game drag band into digital age (reuters) technology - video games: beatles re-master, game drag band into digital age (reuters) technology - video games: thought-free action never stops in\" gamer \"(reuters) technology - video games: star trek online taking beta apps now (pc world) technology - video games: internet addiction center opens in us (ap) technology - video games: virtual detectives stalk in-game spammers (reuters) © 1999 - 2009 independent online. all rights strictly reserved."}, {"articleID": "2010010116_00026104_W", "names": {"John Dean": ["Q1630448", "Q18022486", "Q21228625", "Q21461030", "Q27865936", "Q42687912", "Q55691801"]}, "date": "2010-01-01", "url": "http://news-gazette.com/news/opinions/editorials/2010/01/01/out_out_darn_words", "content": "comments oh, if only it were so. for the 35th year, a committee at lake superior state university has released its list of words to be \"banished from the queen's english for mis-use, over-use and general uselessness.\" but these words are, unfortunately, too big to fail. at a new year's eve party in 1975, a public relations director at lake superior state university and his friends came up with a grand idea: an annual list of words to be banished from general use. that year's list included \"at this point in time\" (remember <mark>john dean</mark> at the watergate hearings?), detente, dialogue, macho and scenario. so you see how successful the list-makers have been. but the word-banishing \"czars\" (a word on this year's list) are undaunted. they have released a new audit that includes such overly popular terms and words as \"shovel-ready,\" \"tweet,\" \"app,\" \"sexting,\" \"teachable moment,\" \"stimulus,\" \"toxic assets,\" \"chillaxin'\" and \"too big to fail.\" advertisement send a letter to the editor"}, {"articleID": "2017071515_00591569_W", "names": {"Michael Woods": ["Q1501409", "Q16961795", "Q17041407", "Q18211822", "Q21459180", "Q3267081", "Q3308580", "Q47129080", "Q6835442", "Q995633"]}, "date": "2017-07-15", "url": "http://santamariatimes.com/news/national/penn-state-ex-officials-begin-jail-terms-in-sandusky-case/article_1cd8db4e-b12b-5010-91ae-4c84d6791d67.html", "content": "2 Penn State ex-officials begin jail terms in Sandusky case By JOE MANDAK Associated Press Jul 15, 2017 Updated 1 min ago This undated photo provided by the Centre County Correctional Facility on Saturday, July 15, 2017 shows former Penn State University athletic director Tim Curley. Curley and former Penn State University vice president Gary Schultz reported to the Pennsylvania prison on Saturday to serve sentences for how they responded to a 2001 complaint about Jerry Sandusky showering with a boy. (Centre County Correctional Facility via AP) HOGP This undated photo provided by the Centre County Correctional Facility on Saturday, July 15, 2017 shows former Penn State University vice president Gary Schultz. Schultz and former Penn State University athletic director Tim Curley reported to the Pennsylvania prison on Saturday to serve sentences for how they responded to a 2001 complaint about Jerry Sandusky showering with a boy. (Centre County Correctional Facility via AP) HOGP Two former high-ranking Penn State administrators surrendered Saturday morning to serve jail sentences for how they responded to a 2001 complaint about Jerry Sandusky showering with a boy. Former university vice president Gary Schultz and former athletic director Tim Curley turned themselves in, according to Lt. <mark>Michael Woods</mark>, the shift commander at the Centre County Correctional Facility. Wood confirmed their surrender, but said he was not authorized to release any other details from the jail, which is about 135 miles (217 kilometers) east of Pittsburgh. The lockup is about 7 miles (11 kilometers) northeast of Penn State's main campus. Schultz and Curley pleaded guilty to misdemeanor child endangerment in March, leading prosecutors to drop three felony charges of child endangerment and conspiracy. Curley, 63, must serve three months in jail, while Schultz, 67, has two months behind bars. Jail officials said they will be evaluated for participation in work release while incarcerated. A co-defendant, former Penn State president Graham Spanier, 68, was convicted of the same offense and faces two months in jail. Spanier remains free on bail while he appeals to Superior Court. Spanier continues to be a tenured faculty member and is on administrative leave. A deal with the university when he was forced out as president after Sandusky's arrest in November 2011 pays him $600,000 a year, ending this fall, after which he will receive a salary. The three men received a complaint from a graduate assistant football coach in February 2001 who said he was highly disturbed by seeing Sandusky appear to sexually abuse the boy late on a Friday night in a team shower. They told Sandusky not to bring children onto campus anymore, but prosecutors said the administrators had no plan to enforce that rule. Police were not notified, and a criminal investigation into Sandusky did not begin until a Pennsylvania school district reported another complaint about him in 2008. Sandusky was convicted in 2012 of 45 counts of child sexual abuse. He maintains his innocence and is appealing, while serving 30 to 60 years in state prison. The scandal led the university to fire Hall of Fame football coach Joe Paterno, who was informed of the 2001 incident the next morning by the assistant, Mike McQueary. Paterno notified Curley but did not call police. He died in 2012, a few months after his firing, and was never charged with a crime. An anonymous email in 2010 led investigators looking into Sandusky to contact McQueary, and he proved to be a critical witness at the criminal trials of both Sandusky and Spanier. Get news headlines sent daily to your inbox Sign Up! I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. At sentencing for Curley, Schultz and Spanier last month, Judge John Boccabella did not spare Paterno, saying he \"could have made that phone call without so much as getting his hands dirty. Why he didn't is beyond me.\" He also questioned Curley's memory lapses while testifying for the prosecution at Spanier's trial. \"I find it really hard to believe that he doesn't remember every detail of the most serious mistake he ever made,\" Boccabella said .------Associated Press writer Mark Scolforo contributed from Harrisburg. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Angry"}]