[{"date": "2015-01-13", "url": "http://www.stokesentinel.co.uk/Video-Port-Vale-face-Stoke-City-cup-final-Potters/story-25847097-detail/story.html", "content": "Video: Port Vale could face Stoke City in cup final as Potters aim for revenge MikeBaggaley | Posted: January 13, 2015 Stoke's Carl Beeston and Vale's <mark>Ian Taylor</mark> tussle in the heat of Potteries derby action Comments (0) STOKE City could have the chance to avenge last month's defeat to Port Vale after the Staffordshire Senior Cup draw set up the possibility of a Potteries derby final. The Potters were beaten 3-0 by the Valiants in a reserve game in training pitches to protect the main pitch before Vale's lucrative Boxing Day game at home to Sheffield United. But even so, the game, which kicked off on 1pm on a Wednesday afternoon, attracted a crowd of around 250 to watch on the grass bank above the training pitch at the back of the Bycars Stand. A re-match will happen if both clubs can come through away matches in the cup semi-finals. Stoke are away to Stafford Rangers or Walsall Wood. Neither will take their semi-final ties for granted, but after his Stoke youngsters were well beaten by Vale a month ago, City's coach Glyn Hodges made clear he would like the chance for another derby game. He said: \"It was a good test. Port Vale are a bit stronger and more experienced than us, but we will gain more out of the game. Although it is a defeat, the experience is good for us .\" We like the derbies and have taken these games on because we know we are going to play experienced players as opposed to the academy football in the under-21s league. \"Meanwhile, Vale expect to extend defender <mark>Nathan Smith</mark>'s loan to Stafford this week in a deal which could see the 18 year old move until the end of the season. The Valiants have been impressed with <mark>Smith</mark>'s progress and are keen to give the centre-half, from Madeley, more matches in the Evo-Stik Division One South. A measure of <mark>Smith</mark>'s progress is that Vale will look to insert a clause in the deal that mean he could be recalled to Vale Park. At the moment he is behind a list of more experienced central defenders at Vale which includes Richard Duffy, Freddie Veseli and <mark>Chris Robertson</mark>. However, manager, who watched <mark>Smith</mark> in action for Stafford last week, says the Vale youth graduate is improving fast thanks to playing in adult football with Stafford. He said:\" We have to try to make sure that, if we have injuries here, we can get <mark>Nathan</mark> back. He is becoming a strong character and is learning a lot coming up against stronger players than play in the reserves. \"I have really enjoyed working with <mark>Nathan</mark> because he has such a good character and determination. Stoke City: Perhaps Liverpool should send a cheque this way for...Video: Port Vale could face Stoke City in cup final as Potters...Stoke City: Potters ready to make loan bid for Man City star Edin...Arsenal 3, Stoke City 0 match report: Outclassed Potters lick...Weather warning: Snow expected to hit the region as temperatures plunge Stoke City: Potters ready to make loan bid for Man City star Edin Dzeko Looking to Buy or Let in Stoke-on-Trent and Newcastle under Lyme? Lettings and estate...Lister Trade Frames Welcome to Lister Trade Frames in Stoke We've been established since 1976 and if you're a.. .", "articleID": "2015011314_00027857_W", "names": {"Chris Robertson": ["Q48743619", "Q5107891", "Q5107892", "Q5107893", "Q5107895"], "Ian Taylor": ["Q11154675", "Q1438500", "Q14943179", "Q20877307", "Q23409808", "Q28094325", "Q57062399", "Q5983044", "Q5983046", "Q5983056"], "Nathan Smith": ["Q18088901", "Q1966636", "Q1966650", "Q24005445", "Q24663895", "Q27448076", "Q30123019", "Q6969340", "Q6969341", "Q6969342"]}}, {"date": "2015-01-14", "url": "http://kbtx.com/mycw8/entertainment/headlines/Snipers-Widow-Struggled-with-Having-Him-Portrayed-in-Film-288545281.html", "content": "Sniper's Widow Struggled with Having Him Portrayed in Film DALLAS (AP)--The wife of a famed Navy SEAL sniper said she struggled with the idea of someone playing the movie role of her husband, who was killed two years ago near Fort Worth, Texas. that actor <mark>Bradley Cooper</mark> did an excellent job accurately portraying her husband, Chris, and the difficult decisions he faced while fighting in Iraq and his struggles with determining his role when he returned from war. In the film, a subtle facial tic that <mark>Cooper</mark> has as he looks through the scope of his weapon made Kyle nearly forget she was watching an actor on screen, she said. \"It'd be almost like a tell in poker,\" she said. \"In a stressful situation, Chris would do that .\" The movie, \"American Sniper,\" is based on Chris Kyle's 2012 memoir that recounts his journey from being a rodeo cowboy to a trained sniper credited with 160 kills. He was honorably discharged in 2009 after 10 years of service, including four tours in Iraq. In February 2013, Kyle and his friend, Chad Littlefield, were killed at a shooting range. Ex-Marine Eddie Ray Routh is charged with capital murder, and authorities say he confessed to the killings to a Texas Ranger. He remains in jail in lieu of $3 million bail. His trial is scheduled to start next month. <mark>Cooper</mark> and the film's director, <mark>Clint Eastwood</mark>, visited Taya Kyle in Midlothian - about 25 miles south of Dallas - before filming. The trio sat around and talked, with Kyle showing them her husband's baseball caps, cowboy boots and the clothes still hanging in his closet. \"It felt like I had a couple of friends over,\" she said. \"They were very respectful, kind and warm .\" She said the film, which will open in theaters nationwide Thursday, is a \"beautiful gift\" to her family and to all military families who have experienced war. \"If you go to combat and you have people who love you at home, some version of this story is your story,\" she said. \"Paw-paparazzi' Take Note: World Dog Awards Honor Star Pets <mark>James Cameron</mark> Says\" Avatar' Sequel Delayed Until Late 2017 Join the Conversation! To comment, the following rules must be followed: No Obscenity, Profanity, Vulgarity, Racism or Violent Descriptions No Negative Community Comparisons No Fighting, Name-calling, Trolling or Personal Attacks Multiple Accounts are Not Allowed Stay on Story Topic Comments may be monitored for inappropriate content, but the station is under no legal obligation to do so. If you believe a comment violates the above rules, please use the Flagging Tool to alert a Moderator. Flagging does not guarantee removal. Multiple violations may result in account suspension. KBTX-TV Channel 3 4141 E. 29th Street Bryan, TX 77802 Phone: (979) 846-7777 Fax: (979) 846-1490 News Fax: (979) 846-188 × Online Public Information File Viewers with disabilities can get assistance accessing this station's FCC Public Inspection File by contacting the station with the information listed below. Questions or concerns relating to the accessibility of the FCC's online public file system should be directed to the FCC at 888-225-5322, 888-835-5322 (TTY), or fccinfo @ fcc.gov. Station Contact Info: KBTX-TV Channel 3 4141 E. 29th Street", "articleID": "2015011415_00060644_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"], "Clint Eastwood": ["Q2979323", "Q43203"], "James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}}, {"date": "2015-01-15", "url": "http://www.weau.com/home/headlines/Walker-scheduled-to-give-speech-in-Washington-288698691.html", "content": "Republican Gov. <mark>Scott Walker</mark>'s travel schedule is picking up as eyes a possible run for president. <mark>Walker</mark> was slated to give the keynote address at the Republican National Committee annual winter meeting Thursday night in San Diego, California. On Jan. 24 he and other potential GOP presidential candidates are attending a conservative summit in Iowa. And on Jan. 30 <mark>Walker</mark> is scheduled to give a speech at a conservative think tank that focuses on the economy in Washington, D.C.. The American Action Forum describes itself as a \"center-right policy institute providing actionable research and analysis to solve America's most pressing policy challenges .\" Judge: Michigan must recognize 300-plus gay marriages Taylor man allegedly trying to outrun police loses fake leg The comment sections of our web set are designed for thoughtful, intelligent conversation and debate. We want to hear from the viewers but we are not obligated to post comments we feel inappropriate or violate our guidelines. Here are some of the criteria you should follow when posting comments: Comments cannot be profane or vulgar. Children and families visit this site. We will delete comments that use profanity or cross the lines of good taste. We will delete all comments using hate speech. Slurs, stereotypes and violent talk aren't welcome on our web site. Comments should not attack other readers personally. We will delete comments we deem offensive, in bad taste, or out of bounds. We are not obligated to post comments that are rude or insensitive. We do not edit user-submitted comments. When in doubt, - have it checked out (by a medical professional) WEAU 13 NEWS 1907 S. Hastings Way Eau Claire, WI 54701 By Phone: Main Number (715) 835-1313 and (715) 832-3474. Tip Line (715) 839-WEAU - (715) 839-9328 Sports Line (715) 852-1537 × Online Public Information File Viewers with disabilities can get assistance accessing this station's FCC Public Inspection File by contacting the station with the information listed below. Questions or concerns relating to the accessibility of the FCC's online public file system should be directed to the FCC at 888-225-5322, 888-835-5322 (TTY), or fccinfo @ fcc.gov. Public File Liaison: Jolene Jensen - 715-852-1557 Station Contact Info: WEAU 13 NEWS 1907 S. Hastings Way Eau Claire, WI 54701 By Phone: Main Number (715) 835-1313 and (715) 832-3474. Tip Line", "articleID": "2015011517_00011553_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"]}}, {"date": "2015-01-16", "url": "http://www.vice.com/read/strengthening-family-bonds-with-ecstasy-116", "content": "Horizons Psychedelic Conference took place in a church. There were stained glass windows, columns, and marble angels. The setting matched the mood perfectly, as a series of distinguished psychedelics researchers from around the world described drug-induced mystical states of consciousness often associated with the divine. Most of the speakers were protected in their studies by government exemptions to harsh anti-drug laws. Relationship coach The Writer of \"Queer as Folk' Talks Rimming, Grindr, and <mark>Ryan Reynolds</mark> Masturbating Cry-Baby of the Week: A Church Allegedly Fired a Woman Because She Wasn't Married Studies are showing that therapeutic sessions with the drug can continue to help patients even years later .\" MDMA gives people a template [for how] they can relate to challenging emotions, \"researcher Dr. Michael Mithoefer told me over the phone .\" They can refer back to it after the medicine wears off. \"Lalla recognized the drug's potential to help resolve her own personal and relational issues. She experimented with MDMA first on her own before embarking upon a mission to enroll her mother, father, brother, and sister in MDMA-aided family therapy .\" You get a publicly-witnessed permanent record in your heart of your love for each other, \"she told me .\" It's stored in your heart, and you can draw on it forever. \"I sat down with Lalla to discuss what her experiences with MDMA have taught her about building better relationships. Annie Lalla: Professionally, I work with single clients and couples. The couples are often suffering recurring drama and conflict. They don't know how to move through the power struggle. That's kind of my expertise. I think 90 percent of couples never get past the power struggle. Well, for example, whenever myself and my husband are in conflict, we literally map out the conflict space. We've got our laptop out:\" OK, so you're pissed about this, and I'm pissed about that. What does it have to do with sex, reproductive issues, money? \"We're always tracking where we are in the conflict. I think people fight about the same things in the same ways. There are recurring motifs that I'm looking for, and that I use to help the couples I'm working with. What do you do when you find the source of the conflict? What I've come to realize is that it all basically boils down to,\" Oh, you feel unsafe. \"No matter if they're yelling, screaming, cryingâ €\" if I can feel a power move, I think, Oh, you're scared. So, I try to regulate my nervous system to take care of my sense of safety. Then, from that place, I think about how I can get them back to feeling safe. No matter if they're yelling, screaming, cryingâ € \"if I can feel a power move, I think, Oh, you're scared. Is the power struggle ever resolved? It's never resolved. The best you can do is to become aware of it, and to manage it. You can't stop wanting to arm wrestle, but you can say,\" I'm arm wrestling intentionally, for something I believe in, and I'm not doing it compulsively or unconsciously. \"Instead of letting your animal use your cognitive functions to do whatever it wants, you align yourself with what your animal is trying to do, and what you think is serving your current and future selves. You find the overlap between those, and that alignment is the place where you operate during your power struggle. What do you mean when you say\" animal \"? We are animals, and the more unsafe we feel, the more we want to control our environment. Every animal down from the amoeba all the way up to us does it, and so I think our relationship with our partners [consists of] replaying old dance routines of unfinished power battles that we had with our first attachment figures: our parents. Have your MDMA experiences changed the way you deal with conflict? Absolutely, yes. MDMA is egolytic [ego-dissolving] and the power struggle is between two egos. So, the more that the two egos feel separate, the more polarized the power struggle is. [With MDMA] you can empathically toggle between your perspective and theirs. How do you use their perspective? If you wanted to break into a house from the outside, you can, but it's way easier if you scope out the house from the inside first. Then you can create a map that you can use to infiltrate. Very stealthy. Stealth is important. The reason why I'm ethically comfortable with stealth is my attention. If the thing you're trying to burgle is the other person's presence and yours, I can get behind that. Most people are trying to burgle things that are not sacred. They're not operating on a sacred mission. What other insights have you gained from MDMA? If you pushed me metaphysically, I would have to say there's another step that I think exists in very intense psychedelic states. It's a state of communion beyond the separateness of self. Your being-ness and my being-ness ceases to be separate. We one-ify. So, I think that's possible in intense mystic states, but I don't think most people get there very often. I think our personality is a series of defenses against unsafe childhood conditions. So we develop a defended self that then becomes our character and personality. Are you able to use that insight to strengthen relationships? On MDMA, in my historic private useâ €\" not necessarily with my family, but in my romantic relationshipsâ € \"I can taste where there is a wall [between myself and] the person that I love. And I can feel the wall is obsolete because the ego that is erecting the wall ceases to require it. It's a defense. And when the ego is more porous, it just needs less defenses. What is it defending against? I think our personality is a series of defenses against unsafe childhood conditions. So we develop a defended self that then becomes our character and personality. And, in some ways, I'm grateful for that. I think of a bonsai tree, which is a beautiful work of art. It's a stunted tree, but artfully stunted. So, I feel like the environmental conditions of your life are stunting you into this particular flavor of God. How do you balance a need for defenses with a need for vulnerability? Often your defenses are against circumstances that are no longer the case. You're often using [childhood] strategies in current situations that are obsolete, because you have more resources, intelligence, and wherewithal now. It's like moths moving towards the light. They move towards the light because when they evolved, only stars existed. It kept them alive, and now it kills them. The same strategy that once served life is now destructive. for a project, and I've noticed that those kinds of childhood themes come up again and again. Are dreams something you use in your work? Dreams can be very helpful. I usually try to tell my dream to my partner or someone, because they'll see a pattern that I won't see. The dream is telling me that there's a blind spot. That's why [the issue] has to be smuggled into my dream space. The other trick I use is to identify with each character in the dream, and each item in the dream. So if I dream about a cat walking through a door and falling off a cliff, I'm the cat, I'm the door, and I'm the cliff. I climb into each one, and think, What can I learn from this? They say there's a series of emotions; I really think there's only love and fear. And even then, I don't think there's fear. I think there is just love, and fear is in the shadow of love when you forget temporarily that love is the nature of reality. Can you talk about some of the specific issues that you've worked on with your family? Way back [when we began], there were a lot. My mother had a very marginalized voice in the family, and with my father, there was a subtle tyranny. And through the MDMA sessions, that was a big part of what I was trying to elucidateâ €\" the ways in which he unknowingly was perpetrating this inequity. Once it became part of his consciousness, he could see that it was inconsistent with his identity. He wasn't the typical Indian patriarch. He wouldn't let his daughters learn to cook or clean because he never wanted us to be domesticated housewives. He wanted the feminine to be powerful. What do you mean when you say \"subtle tyranny?\" The way it would show up would be like a raised voice, or he would become impenetrable in conversation. He would just repeat the same thing, and you couldn't talk to him about the issue. How did you make him realize the effect he was having? I remember one time, all of us got together and expressed anecdotal descriptions of moments when he had interacted with us in a way that had made us feel smaller. So him hearing thatâ € \"and being under the influence of the MDMAâ €\" his ego was soft enough that he could not take it as an attack, and just hear it as reflections of behavior that was inconsistent with who we wanted to be. We even had him write out some commitments to remember. It's almost like notes to his future selfâ € \"notes about how he wanted to be as a husband and a father so he could refer to them later. It was his own writing, and his own signature, so there was really strong accountability for taking on the epiphanies that came up. Over the course of five years, he has become less and less tyrannical. It's interesting that you bring up the idea of there being two personas, the MDMA persona and the sober persona. What's the difference? Well, the sober state defends itself more, and the MDMA state is the more real self. What makes it more real? It has less fear. They say there's a series of emotions; I really think there's only love and fear. And even then, I don't think there's fear. I think there is just love, and fear is in the shadow of love when you forget temporarily that love is the nature of reality. There's no such thing as a shadow in and of itself, it's just a lack of sunlight. You could argue that shadows are just as real as the tree and the sun, but there's a way in which the tree is more real. But if I had to bet my life on what's more real, I bet on the thing that inspires me. I consciously confer more reality to the things I'm inspired by. It's to the point now where most of my friends wouldn't know whether I'm on MDMA or not. Getting back to MDMA, I wanted to ask, what was your first time taking it like? It was like home. My whole life up until that point, I was trying to have interactions with people that look like that. As long as I can remember, whenever I've met someone, I was looking for maximal intimacy per square inch per moment in our interaction. What did that look like? Sometimes I would be intrusive, or ask really intimate questions that were socially inappropriate. I just [wanted] to understand all the intricacies of the feelings and thoughts underneath the spoken statements. Shouldn't we be talking about that? Did you expose yourself as well? Or was the exchange mostly one-directional? When I was younger, it was more one-directional. I got alerted to that in high school. I started to realize that everyone felt very exposed around me, but no one actually knew me. Then I realized it was a defense mechanism. MDMA showed me that intimacy is the place that both of us climb into together, and we're naked together. And that felt way better than the other version that I'd been doing. When I was on MDMA, I would have an interaction with another human being I didn't know three minutes ago, and the level of fluid connection and alignment was the highest that I'd ever seen in a first encounter. Are you able to recreate that feeling off of MDMA? I knew from my research not to pin whatever I got from the MDMA onto the MDMA. The MDMA was just the facilitator. Say I was on MDMA right now, and I go and talk to [a nearby woman]. I would feel that I could talk to her easily without having an excuse. I know a lot of people say,\" Oh, it's the MDMA. The MDMA allowed me to talk to her. \"Well, I knew that the MDMA wasn't doing anything that I couldn't normally do. It made me aware of what I could do. And if I took note of what I was doing on MDMA, I could become more like that person when I was off MDMA. It's to the point now where most of my friends wouldn't know whether I'm on MDMA or not. Does your experience with the drug make normal reality less interesting? It makes baseline reality more like a fascinating Sudoku. It's like a mystery. It's very entertaining. I love being on MDMA, but I love being off of it too. My first drug ever was LSD, which goes from six to eight hours and then it's done. It's like going on a roller coaster. Do you say,\" I hate my life when I'm not on a roller coaster? \"No, you enjoy the rest of the park. Why did you choose to use MDMA with your family instead of LSD or mushrooms, for example? I chose MDMA because it's the most likely [drug for] not having anything negative come up or to have a bad trip. It also had the most research behind it, about it being therapeutically useful. What were some of the concerns that you had to overcome with your family about using MDMA? My mom was worried about it being illegal and addictive. She has no knowledge about drugs. Crack, cocaine, heroinâ €\" she had them all mixed together [in her mind] with MDMA. So I had to differentiate them for her. I had to use research to help her see that there's not this thing called \"drugs .\" There are specific drugs. First, I had to separate out addictive and not addictive. I was able to show her that alcohol was actually more dangerousâ € \"she'd be OK having a glass of wine. [But] alcohol actually has more negative physiological effects in the body and is more addictive. She was worried about MDMA being illegal. And I had to say,\" Yeah, it's illegal. And, here are the reasons why it's probably illegal. It doesn't suit the status quo powers in the world. \"My sister was like,\" I'm going to go crazy. \"She thought she could get physically hurt. So again, I had to take her to websites and show how the biochemistry works. We took 5-HTP. We took all the serotonin precursors. We did as much as we could to mitigate any neurotoxicity. What's your end goal with all of this work? I want myself and the people around me to feel the most alive. I mean, basically I think every emotion is a messenger from the unconscious mind to deliver an important insight. Every unfelt emotion becomes a pathology, an addiction, or a neurosis. I'm trying to teach my family, my friends, and the world at large how to hold a wider range of their emotional experiences, and in order to do that, I have to keep practicing doing that myself. The extent that you feel your emotion is the extent [to which] you can develop yourself and actualize. The Future of Sex According to VICE The Hard, Grim Work of Cleaning Up Meth Labs in West Virginia Cry-Baby of the Week: A Church Allegedly Fired a Woman Because She Wasn't Married The Writer of\" Queer as Folk' Talks Rimming, Grindr, and <mark>Ryan Reynolds</mark> Masturbating The Man Who Texted a Photo of Himself Having Sex with a Girl While She Vomited Isn't Getting Any Jail Time Behind Anonymousâ € ™ s Operation to Reveal Britainâ € ™ s Elite Child-Rape Syndicate Trent Reznor Talks About Making It Out of the Midwest The FBI Says It Stopped a 20-Year-Old's Terrorist Plot to Attack the US Capitol The Future of Protest According to VICE", "articleID": "2015011619_00054813_W", "names": {"Ryan Reynolds": ["Q192682", "Q7384463"]}}, {"date": "2015-01-16", "url": "http://wsoctv.com/ap/ap/sports/toronto-acquires-altidore-sends-defoe-to-sunderlan/njqLd", "content": "Updated: 3:29 p.m. Friday, Jan. 16, 2015 | Posted: 3:29 p.m. Friday, Jan. 16, 2015 TORONTO - Jozy Altidore and <mark>Michael Bradley</mark> grew up less than 50 miles apart in northern New Jersey, playing alongside each other on U.S. national youth teams. Now veterans of two World Cups each, the duo has been reunited as teammates with Toronto in Major League Soccer. \"Canada, who would have thought it, huh?\" Altidore said with a laugh Friday when introduced as Toronto's newest designated player. \"That's the thing about life, you never know what you're going to get the next day .\" Toronto confirmed the acquisition of the forward from Sunderland of England's Premier League and agreed to transfer English forward Jermain Defoe to the Black Cats, one year after obtaining him from Tottenham. Altidore said <mark>Bradley</mark>, the midfielder who joined Toronto along with Defoe in January 2014, was a \"huge\" part of his decision to sign with Toronto. \"We started at the youth national team together at 16, 17 years old,\" Altidore said. \"Every level we ascended to, we did it together. We were always close, always pushing each other from a young age. He was huge in this whole thing .\" <mark>Michael</mark>'s an honest guy, he's always been honest with me, \"Altidore added .\" He told me from the start \"Jozy, you will quickly see that this place, they have the same desire that we do, to get better and to kind of make a statement .' That's what we're all about in terms of growing and taking the game to a new height in North America. This is the perfect place to do that. There is no better place to do that .\" The 25-year-old Altidore played in MLS with the New York Red Bulls from 2006-08 before heading to Spain's Villarreal for a transfer fee of about $10 million. He failed to establish himself as a regular, spent time on loan at Xerez, Hull and Bursaspor before he was sold to the Netherlands' AZ Alkmaar. He set the record for goals by an American in a European club season with 31 for AZ in 2012-13, then went to Sunderland. He had just one goal in 40 league appearances with the Black Cats. \"The time at Sunderland was a difficult one for a lot of reasons,\" Altidore said. \"A lot of things went on behind the scenes that made it very tough to get off the ground there .\" Toronto coach Greg Vanney, a former U.S. national player, said he's confident Altidore's scoring drought won't continue in MLS. \"He will score goals. I have no concern about that,\" Vanney said. \"I have no doubt that he's going to be a great player and arguably the best striker in the league .\" General manager Tim Bezbatchenko called Altidore \"one of the top young Americans in the game today .\" Altidore was added to the U.S. training camp roster before upcoming exhibitions against Chile and Panama. <mark>Bradley</mark> and newly drafted Toronto goalleeper Alex Bono are also on the American roster. U.S. coach Jurgen Klinsmann has previously expressed a preference for American players to test themselves against opponents in Europe's top leagues. Altidore discussed his move with Klinsmann and said the German coach was supportive of a return to MLS. \"I spoke to him at length,\" Altidore said. \"It was a very open, honest conversation. He understands that I'm a guy who's always pushing myself, always looking to get better. I think he supported this move a lot. He's obviously going to work closely with me and everybody at this organization to make sure that I put my best foot forward .\" Defoe scored 12 goals in 21 games with Toronto, but Bezbatchenko acknowledged \"friction\" with the former English, who missed much of the second half of the season with injury and returned home for treatment. Bezbatchenko referred to Altidore as \"a known entity .\" Boehner uses Taylor Swift GIFs to criticize Obama's community college plan Cox Media Group. By using this website, you accept the terms of our Sign in with your existing account {* loginWidget *} Sign in with your email {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Select a display name and password {* #socialRegistrationForm *} {* socialRegistration_displayName *} {* socialRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} Tell us about yourself {* registration_firstName *} {* registration_lastName *} {* registration_postalZip *} {* registration_birthday *} {* registration_gender *} {* backButton *} {* socialRegistration_signInButton *} Select a display name and password Already have an account? Sign In {* #registrationForm *} {* traditionalRegistration_displayName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} Tell us about yourself {* registration_firstName *} {* registration_lastName *} {* registration_postalZip *} {* registration_birthday *} {* registration_gender *} {* createAccountButton *} {* / registrationForm *} Sign In {* #registrationFormBlank *} {* registration_firstName *} {* registration_lastName *} {* traditionalRegistration_displayName *} {* traditionalRegistration_emailAddressBlank *} {* registration_birthday *} {* registration_gender *} {* registration_postalZip *} {* traditionalRegistration_passwordBlank *} {* traditionalRegistration_passwordConfirmBlank *} {* backButton *} {* createAccountButton *} We have sent you a confirmation email. Please check your email and click on the link to activate your account. We look forward to seeing you frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Don't worry, it happens. We'll send you a link to create a new password. {* #forgotPasswordForm *} {* forgotPassword_emailAddress *} We have sent you an email with a link to change your password. We've sent an email with instructions to create a new password. Your existing password has not been changed. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} {* traditionalSignIn_signInButton *} To sign in you must verify your email address. Fill out the form below and we'll send you an email to verify. {* #resendVerificationForm *} {* resendVerification_emailAddress *} Your Verification Email Has Been Sent", "articleID": "2015011620_00044819_W", "names": {"Michael Bradley": ["Q1619538", "Q208425", "Q3308051", "Q55998165", "Q6828781", "Q6828782", "Q6828785", "Q9032247"]}}, {"date": "2015-01-21", "url": "http://highschoolsports.mlive.com/news/article/5991375050680989442/jackson-northwest-senior-bowler-brian-lewis-fires-300-game-in-victory-over-jackson/", "content": "JACKSON--<mark>Brian Lewis</mark> stepped up in the fifth frame of the second game Wednesday, rolled his bowling ball at the pins and sent all 10 of them scattering for a strike. His Jackson Northwest High School bowling coach, Gerry Lobdell, responded by saying, \"About time .\" The well-timed joke drew a dry smirk from Lewis, who had a spare the frame prior--and 15 straight strikes before that. Lewis, a senior, rolled the first 12 strikes of the first game of a match against Jackson at Airport Lanes for a 300 game. He added three more strikes to start the second game before a solid 9-pin ended his bid at a second perfect game. But his first game had the place jumping and everybody buzzing when it was over. \"The 10th frame, it was pretty scary but a great feeling,\" said Lewis, who led his team to a 26-4 victory over Jackson. \"The first one was pretty good, the second one was pretty good and the last one got a little inside, but it held in there and got the job done .\" Lewis is the seventh high school boys bowler to roll a 300 game this season, as reported to the Michigan High School Bowling Association website. Lewis also joins a list of recent Northwest bowlers to record 300 games in high school matches, joining Sierra Lasky in 2014, Corey Daniels in 2012 and <mark>Nick Taylor</mark> in 2011. Teammate Trevor Simons had a 300 game in November during the Greater Jackson USBC youth city tournament at Brooklyn Lanes, bowling with Lewis and fellow seniors Chris Salkowski and Tyler Ockert. Lewis remembered the moment Simons got his perfect game. \"It was awesome to watch,\" Lewis said. \"I felt kind of proud, it was cool. I was like,' I want to go get one of those .'\" Bowling with a Roto Grip Hyper Cell he also used to shoot his previous high game of 289 during a Youth Masters tournament, Lewis packed the pocket 12 straight times in the first game. He showed no nervousness, even as the crowd went silent in the late-going. \"The 10th frame was when they really got bad,\" he said of the nerves. \"When I was going up for the last one, I thought I was having a seizure. I wasn't sure, but that's what it felt like. Up until then, it wasn't too bad .\" In the crowd for his feat were his parents, Terry and Nancy Lewis, his girlfriend, and a large gathering of Northwest supporters. He said picking up his first perfect game with his team was the way he would have drawn it up. \"It's awesome getting to celebrate with the guys,\" Lewis said. \"It's nice having their support .\" Lewis finished the second game with a 213 for a 513 two-game series for Northwest (3-1). Simons, incidentally, had a solid day on the lanes himself, firing scores of 258 and 243 for a 501 series. Rob Dunham added games of 205 and 243 for the victors. Jackson (4-3) was led by Drake Csage with games of 257 and 235 for a 492 series, Joseph Bleiler with 213 and 223 (436) and Jacob Oberst with 236 and 188 (422).", "articleID": "2015012200_00003952_W", "names": {"Brian Lewis": ["Q16107026", "Q4964500", "Q912567"]}}]