[{"articleID": "2017112408_00570191_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2017-11-24", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-live-13945677", "content": "News What next for North East devolution after this week's Budget announcement? The \"North of Tyne' devolution deal is set to go ahead this week following the Chancellor's announcement - so what happens next? Share By Kathryn Riddell Multimedia Journalist Sean Seddon Updated 08:27, 24 NOV 2017 News Share Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Chancellor <mark>Philip Hammond</mark> announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £ 600m and months in the planning, will be officially launched this week. It is a major announcement for the North East and means that three councils serving communities north of the River Tyne will join together to create a new North of Tyne Combined Authority, which will be led by a regional mayor to be elected in 2019. Those councils are Northumberland County Council, North Tyneside Council and Newcastle City Council. Formal agreement to the deal from the councils involved is expected to be announced this week, and includes funding of £ 600 million for the new authority paid over 30 years. The creation of the North of Tyne Combined Authority raises questions about future funding for the councils not involved, including Gateshead, Sunderland, South Tyneside and County Durham. Here, we take you through the complexities of what has been announced so far, and we will bring you the latest updates as the councils move towards formal agreement. Read More Budget 2017 Everything you need to know £ 337m funding for Metro system Business leaders welcome Budget How social media reacted 08:27 Kathryn Riddell Budget divides opinions among MPs The Chancellor's Budget has divided opinion among North East politicians, with Conservatives hailing it as a\" big boost for the North East \"while Labour MPs claim it failed the region. Chancellor Phillip <mark>Hammond</mark> this week announced a £ 337 million grant for the Tyne and Wear Metro, allowing a new fleet of 84 trains to be delivered by 2021. Chancellor <mark>Philip Hammond</mark> has announced funding for a new fleet of Metro trains And he also said the Government had agreed with local council leaders to create a\" North of Tyne \"mayor and combined authority, with funding of £ 600 million over 30 years to start with. The Government also said it would\" begin negotiations on a growth deal for the Borderlands \", which could benefit Northumberland as well as the neighbouring region of Scotland. Here's how MPs have reacted. 08:04 Kathryn Riddell Devolution deal to be launched this week Chancellor <mark>Philip Hammond</mark> announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £ 600m and months in the planning, will be officially launched this week. It is a major announcement for the North East and means that three councils serving communities north of the River Tyne will join together to create a new North of Tyne Combined Authority, which will be led by a regional mayor to be elected in 2019. Those councils are Northumberland County Council, North Tyneside Council and Newcastle City Council. Devo What is the North of Tyne devo deal? This week's announcement means that Newcastle, North Tyneside and Northumberland councils will ultimately come together to form a new combined authority which will include an elected mayor, to be chosen in 2019. The three councils decided to go it alone after negotiations for an authority encompassing all seven North East councils collapsed last year. As well as £ 600m over 30 years, the government say the deal will include\" powers over important economic levers including planning and skills \". The full scale of the deal will be revealed soon, but it represents the biggest shake-up to local government in the North East for decades. Budget Recap on key points from the Budget Chancellor Phillip <mark>Hammond</mark> delivered his Autumn 2017 Budget statement on Wednesday. It included plans to help people afford a home, money for the NHS and improvements to the Government's controversial Universal Credit policy. There was also big news for the North East as it was confirmed that: a North of Tyne devolution deal is about to get the go ahead, to be led by a directly-elected mayor £ 337 million will be invested to pay for new Tyne and Wear Metro trains Read more about the Budget key points here, and more on the Metro investment here. More On Devolution Northern Powerhouse Politics North Tyneside North Tyneside Council Northumberland Northumberland County Council Newcastle upon Tyne Newcastle City Council Tyne & Wear The Budget Gateshead South Tyneside Sunderland County Durham North East Combined Authority"}, {"articleID": "2019010217_00541368_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"]}, "date": "2019-01-02", "url": "http://www.morningstaronline.co.uk/article/hunt-under-fire-after-report-reveals-kidnapped-women-forced-to-pay-his-department-to-be-rescued", "content": "Lamiat Sabin Wednesday, January 2, 2019 <mark>Hunt</mark> under fire after report reveals kidnapped women forced to pay his department to be rescued Labour's shadow foreign secretary Emily Thornberry demands the Foreign Office scraps the charges and end this \"morally repugnant' situation × You can read 19 more articles this month Please help support the Morning Star by subscribing here UNDER-PRESSURE Foreign Secretary <mark>Jeremy Hunt</mark> said today that he will investigate reports that his department charged British women forced into marriages abroad hundreds of pounds for their own rescue. His declaration followed a Times report revealing that such women have had to either pay for plane tickets, basic food and shelter themselves or, if they are over 18, take out emergency loans with the department. Tottenham Labour MP David Lammy likened the situation to the Windrush scandal as an indication of how Britons from ethnic minority backgrounds are treated by officialdom .\" A white woman who had been kidnapped, sold into slavery and raped would never have been asked to pay for her freedom, \"he said. It is understood that the forced marriage unit, jointly run by the Foreign & Commonwealth Office (FCO) and the Home Office, does not profit from the repatriations. A spokeswoman of the FCO, which claims to be a\" world leader in the fight to tackle the brutal practice of forced marriage, \"said that it has a duty to recover costs paid by public funds. The department helped 27 victims of forced marriage return to Britain in 2017 and 55 the year before, according to figures obtained under freedom of information laws. In the past two years the FCO has lent £ 7,765 to at least eight forced marriage victims who could not pay for repatriation. Debts of more than £ 4,500 are outstanding. Under FCO terms and conditions a surcharge of 10 per cent is added if an emergency loan is not repaid within six months. Last year four young British women sent by their families to a\" correctional school \"in Somalia, where they were imprisoned and physically abused, were charged £ 740 each, The Times said. Left destitute by the loans, two are living in refuges and two have become addicted to drugs since returning to Britain, they told the paper. Shadow foreign secretary Emily Thornberry said the situation is\" morally repugnant \"and accused PM Theresa May and Home Secretary Sajid Javid of\" rank hypocrisy \"given their statements made in the past about tackling forced marriages .\" The Foreign Office must immediately scrap these charges and write off all outstanding debts owed by women brought home in recent years, \"Ms Thornberry said. Mr <mark>Hunt</mark> told BBC Radio 4's Today programme that he wanted to\" get to the bottom \"of the issue .\" Any interventions that I have had on these consular matters, I have always stressed to embassies and posts abroad that they need to use discretion, \"he said. Others liked Sunday 30th Dec 2018 Firefighters slam former Merseyside chief who boasts of proper funding in new Australia role Wednesday 02nd Jan 2019 Veterans' protest outside PTSD treatment centre hit by health scare Tuesday 01st Jan 2019 Millions join\" women's wall' against oppression in Kerala Wednesday 02nd Jan 2019 Australian activists alarmed by Britain's response to refugee boats Friday 28th Dec 2018 An inconvenient truth: the enduring popularity of socialism in the post-Soviet states Join the 501 Club You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by joining the 501 club. Just £ 5 a month gives you the opportunity to win one of 17 prizes, from £ 25 to the £ 501 jackpot. By becoming a 501 Club member you are helping the Morning Star cover its printing, distribution and staff costs--help keep our paper thriving by joining! Join here \"Buy Shares You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by become a member of the People's Printing Press Society. The Morning Star is a readers' co-operative, which means you can become an owner of the paper too by buying shares in the society. Shares are £ 1 each--though unlike capitalist firms, each shareholder has an equal say. Money from shares contributes directly to keep our paper thriving. Some union branches have taken out shares of over £ 500 and individuals over £ 100. Buy here\" Donate to the Fighting Fund You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by donating to the Fighting Fund. The Morning Star is unique, as a lone socialist voice in a sea of corporate media. We offer a platform for those who would otherwise never be listened to, coverage of stories that would otherwise be buried. The rich don't like us, and they don't advertise with us, so we rely on you, our readers and friends. With a regular donation to our monthly Fighting Fund, we can continue to thumb our noses at the fat cats and tell truth to power. Donate today and make a regular contribution. Donate here \""}, {"articleID": "2018122023_00779112_W", "names": {"James Mattis": ["Q1680776", "Q267902"], "Donald Trump": ["Q22686", "Q27947481"], "Gary Cohn": ["Q5524866", "Q5524867", "Q5524868"]}, "date": "2018-12-20", "url": "http://www.krcc.org/post/defense-secretary-mattis-retire-february-trump-says-amid-syria-tension", "content": "Defense Secretary <mark>Mattis</mark> To Retire In February, <mark>Trump</mark> Says, Amid Syria Tension By Philip Ewing • 32 minutes ago Tweet Share Google + Email View Slideshow 1 of 2 Defense Secretary Jim Mattis, one of President <mark>Trump</mark>'s most important early advisers, is the latest to depart the administration. Jacquelyn Martin / AP View Slideshow 2 of 2 Joint Chiefs Chairman Gen. Joe Dunford (left) with <mark>Mattis</mark>, who is departing the administration. Jacquelyn Martin / AP Originally published on December 20, 2018 4:34 pm Updated at 5:46 p.m. ET Defense Secretary Jim Mattis, a living Marine Corps legend who made history by securing special permission from Congress to lead the Pentagon, is stepping down after a slow freeze-out by President <mark>Trump</mark>. The president made the announcement via Twitter Thursday evening. \"General Jim Mattis will be retiring, with distinction, at the end of February, after having served my Administration as Secretary of Defense for the past two years,\" <mark>Trump</mark> wrote. \"General <mark>Mattis</mark> was a great help to me in getting allies and other countries to pay their share of military obligations. A new Secretary of Defense will be named shortly. I greatly thank Jim for his service!\" t he president also wrote in a second tweet about the departure. <mark>Mattis</mark>' departure completes a near-wholesale shake-up of <mark>Trump</mark>'s initial national security team and follows a record-setting series of departures of administration leaders so early in a presidency. Of <mark>Trump</mark>'s initial top national security or diplomatic policy advisers, only Secretary of State Mike Pompeo, who began as CIA director, and United Nations Ambassador Nikki Haley remain--and Haley is set to depart the administration soon as well. The dismissal followed an abrupt decision by <mark>Trump</mark> this week to withdraw American troops from Syria, over the objections of many of the president's military and national security advisers. And it also followed the publication of a book by Bob Woodward that described <mark>Mattis</mark> as deeply frustrated with <mark>Trump</mark>, likening his understanding to that of a fifth - or sixth-grader, and being put into uncomfortable positions by the president's sometime outbursts. At one point, Woodward describes <mark>Trump</mark> calling <mark>Mattis</mark> and ordering him to assassinate Syrian President Bashar Assad; <mark>Mattis</mark>, according to the account, agreed to \"get right on that\" but ultimately brought about a much more measured low-level cruise missile attack. Following the reports, <mark>Mattis</mark> said, \"The contemptuous words about the president attributed to me in Woodward's book were never uttered by me or in my presence. While I generally enjoy reading fiction, this is a uniquely Washington brand of literature, and his anonymous sources do not lend credibility .\" But on Thursday, <mark>Mattis</mark> wrote in a resignation letter that he felt he could no longer continue to execute <mark>Trump</mark>'s policies. \"Because you have the right to have a secretary of defense whose views are better aligned with yours...I believe it is right for me to step down from my position,\" he wrote. <mark>Mattis</mark>' letter cited his support for America's \"unique and comprehensive system of alliances and partnerships .\" <mark>Trump</mark>'s brusque approach to those international relationships, <mark>Mattis</mark> wrote, is one reason the defense secretary feels he must step down. Departure of a major figure <mark>Mattis</mark>' departure is significant. He enjoyed outsize influence with <mark>Trump</mark> from his first day back in government and was, for example, credited with single-handedly changing <mark>Trump</mark>'s mind on the use of harsh interrogation with terrorism suspects. <mark>Trump</mark> campaigned in 2016 on the need to revive brutal techniques such as waterboarding and \"a lot worse,\" but he ceded that policy to <mark>Mattis</mark> after a conversation in which the former Marine general told him he could get better results by offering sympathy in interrogations. \"\"I've always found, give me a pack of cigarettes and a couple of beers and I do better with that than I do with torture,'\" as <mark>Trump</mark> described the conversation. So <mark>Trump</mark> backed away from his stance on torture and continued to lean on <mark>Mattis</mark> for advice about the toughest national security challenges in the early phase of his presidency. <mark>Trump</mark> relied on <mark>Mattis</mark> to execute his orders for two missile attacks on Syria in April in retaliation for the use of chemical weapons, and <mark>Mattis</mark> also played the good cop after <mark>Trump</mark>'s bad cop in dealing with allies in Europe and Asia. <mark>Mattis</mark>' long-standing enmity toward Iran also established a strong trend line in policy for <mark>Trump</mark>, although <mark>Mattis</mark> stopped short of telling members of Congress that the Iran nuclear deal wasn't working. It was working, he said--although <mark>Trump</mark> decided in May to abrogate America's participation in it. But <mark>Trump</mark> also grew frustrated with <mark>Mattis</mark> and the rest of his advisers--including then-national security adviser H.R. McMaster and then-Secretary of State Rex Tillerson--over the sputtering war in Afghanistan. <mark>Trump</mark>, who had at one time harbored ideas of simply cutting bait on Afghanistan and withdrawing nearly all American troops, found that <mark>Mattis</mark> and his military advisers counseled doubling down with increased deployments, again. The frustration appeared to go both ways. <mark>Mattis</mark> and Joint Chiefs Chairman Gen. Joe Dunford were blindsided by <mark>Trump</mark>'s spur-of-the-moment announcement last summer that the military would ban transgender troops, a policy they opposed. President comes into his own <mark>Trump</mark> grew more confident in his role over time. As the rare president with no experience in elective office or the military, <mark>Trump</mark> had relied on <mark>Mattis</mark> and other advisers of his vintage for on-the-job orientation about America's global security posture and what was considered feasible and not feasible in various regions around the globe. With more time in the job, <mark>Trump</mark> felt more comfortable going his own way, meaning the role that <mark>Mattis</mark> played as a mentor-adviser was diminished. <mark>Trump</mark> was said to have smarted at the notion that there was a \"Committee to Save America,\" comprising <mark>Mattis</mark>, Tillerson and others, which was fencing a feckless <mark>Trump</mark> safely away from serious mistakes. The \"committee,\" if there ever really was one, now is mostly gone--McMaster, Tillerson, former chief economic adviser <mark>Gary Cohn</mark> and several others all have left the administration. According to reports, <mark>Mattis</mark> was cut out of <mark>Trump</mark>'s decision on the Iran deal and also was not aware that <mark>Trump</mark> planned to commit to freezing U.S. and South Korean military exercises as part of nuclear negotiations with North Korea. The overall impression was that <mark>Trump</mark>, at some point along the line, stopped listening to <mark>Mattis</mark> in the way he once had. Myth of \"Mad Dog\" <mark>Mattis</mark> is a three-war veteran with service in Afghanistan and two Iraq wars, first in the 1991 Desert Storm campaign and then again following the 2003 invasion. The Marine Corps ground commander was revered perhaps more than any of his contemporaries--he is the subject of memes, quote pages and other devotional treatments. But when he rose to become head of U.S. Central Command, the military combatant command responsible for the Middle East, he fell out with President Barack Obama's administration, likely over Iran policy. <mark>Mattis</mark> retired and said at the time he did not expect to return to public service. U.S. law barred former commanders of his stature from serving as secretaries of defense until after a cooling-off period, a practice designed to preserve civilian control of the military. But <mark>Mattis</mark> came to the attention of <mark>Trump</mark> after his election, in part because of a nickname he'd picked up in Iraq: \"Mad Dog .\" <mark>Mattis</mark> didn't like the nickname and it was mostly the province of newspaper headlines, but the impression, for <mark>Trump</mark>, was made. President-elect <mark>Trump</mark>, as he then was, invited <mark>Mattis</mark> to join him onstage at a rally in December 2016. <mark>Trump</mark> later sought, and received, a waiver from Congress that permitted <mark>Mattis</mark> to take over the Defense Department, even though he was still technically within the window barring him from a civilian leadership position. If <mark>Trump</mark> thought \"Mad Dog\" <mark>Mattis</mark> was going to be a snarling martinet, however, he did not know his man. The cerebral, often soft-spoken <mark>Mattis</mark> told reporters he preferred the nickname \"Jim .\" He told Congress that his study of history meant he was seldom surprised by world events. All along, however, <mark>Mattis</mark> was aware of his reputation as a \"warrior monk\" and, to the degree that he could in the shadow of a headline-jealous <mark>Trump</mark>, continued cultivating it. John Dickerson of CBS News, for example, asked <mark>Mattis</mark> in an interview what scared him or kept him up at night. \"Nothing,\" he responded. \"I keep other people up at night .\" Copyright 2018 NPR. To see more, visit https: //www.npr.org. Tags: <mark>James Mattis</mark> <mark>Donald Trump</mark> Tweet Share Google + Email"}, {"articleID": "2015062718_00010818_W", "names": {"Paul Rudd": ["Q276525", "Q7153351"], "Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2015-06-25", "url": "http://www.hollywoodreporter.com/review/max-film-review-802593", "content": "The Bottom Line Anyone expecting complex, stirring drama is barking up the wrong tree. June 26 (Warner Bros. / MGM) Cast Josh Wiggins, Lauren Graham, Thomas Yakin After his Marine partner is killed in action, a military working dog is adopted by the soldier's Texas family. The handsome Belgian Malinois who plays the title character in Max (with the help of a few trusty stunt doubles) is an action star par excellence. He's also the only involving character in this blunt instrument of a family drama. The canine trouper fares best not just because of that expressive face and athletic body, but because he's spared the embarrassment of speaking the hokey dialogue. Emotional nuance never has been the forte of director Boaz Yakin (Remember the Titans) or his co-scripter, Sheldon Lettich (Rambo III), but here even the broad-stroke storytelling falls short of its intended impact - not helped by the desperate bombast of Trevor Rabin's score. The tale of a war-traumatized military working dog, or MWD, who helps a teen boy and his family overcome their own war-related grief, Max puts a YA slant on an intriguing setup. But the screenplay muddles its emotional core with a clunky cross between old-fashioned Hardy Boys mystery and a far-fetched weapons-trafficking subplot. Families who have already seen Inside Out might be enticed, along with moviegoers who are eager to root for a heroic hound and are not put off by the military angle. Though the movie's good guys and bad guys couldn't be more clearly drawn, that military angle is far from flag-wavingly simplistic (though not exactly complex), with Yakin and Lettich foregrounding PTSD and other devastating effects of frontline battle. Max's post-traumatic stress makes him unable to work with anyone else after his Marine handler, Kyle Wincott (Robbie Amell), is killed in Afghanistan. The sight of Max running to Kyle's coffin is wrenching. Summer Movie Guide: Sequels...Comedy...Action! Soon after the funeral, the Wincotts are alerted that Max will be put down, so they decide to adopt him. The decision is spearheaded by mom Pamela (Lauren Graham, lending leavening warmth), who declares, in one of the film's more effective lines, that \"this family takes care of its own .\" Dad Ray, an injured Iraq vet played with overdone rigidity by Thomas Haden Church, comes to blame the dog for his son's death, upping the friction between him and his younger son, Justin (Josh Wiggins of Hellion), who becomes Max's caretaker. With training tips from tough-talking tomboy Carmen (Mia Xitlali) that are drawn straight from the Cesar Millan playbook, Justin puts aside his video-game bootlegging enterprise and learns to handle Max and understand him. He discovers, too, that the dog growls around Kyle's friend and fellow Marine Tyler (Luke Kleintank) for a reason. Having telegraphed Tyler's bad-apple status from the get-go, Yakin draws a widening circle of hard-to-buy connections involving the discharged Marine, local gang leader Emilio (Joseph Julian Soria), a crooked cop (Owen Harn), a Mexican cartel and, farther afield, the Taliban. The baddies naturally include a couple of Rottweilers, and there's some impressive dog-on-dog action as Max assists de-facto detectives Justin, Carmen and her cousin Chuy (Dejon LaQuake) - without having to partake in their \"comic\" exchanges. Animal coordinator Mark Forbes has drawn commendable performances from the dogs, and the stunt sequences, both canine and human, are staged effectively and are shot well by Stefan Czapsky. But they never really matter. And the teens' hangout, a DIY bike park in the woods that's a nice element of Kalina Ivanov's production design, isn't quite enough to explain Justin's daring two-wheeled maneuvers. Though the lead performance would do Lassie and Rin Tin Tin proud, Max's increasingly ludicrous, cliche-packed plot generates not an ounce of suspense. Production company: Sunswept Entertainment Cast: Josh Wiggins, Lauren Graham, Thomas Haden Church, Luke Kleintank, Robbie Amell, Mia Xitlali, Dejon LaQuake, Jay Hernandez, Owen Harn, Joseph Julian Soria Director: Boaz Yakin Screenwriters: Boaz Yakin, Sheldon Lettich Producers: Karen Rosenfelt, Ken Blancato Executive producers: Ben Ormand, Boaz Yakin Director of photography: Stefan Czapsky Production designer: Kalina Ivanov Costume designer: Ellen Lutter Editor: Bill Pankow Composer: Trevor Rabin Animal coordinator: Mark Forbes <mark>Paul Rudd</mark> and Marvel's Kevin Feige Reveal \"Ant-Man's' Saga, from Director Shuffle to Screenplay Surgery to Studio's\" Phase Three \"Plans Murdoch Sons' First Challenges: Fix Fox and Win Over Wall Street Robert Downey Jr. and Secret Screen-Tests: How the New\" Spider-Man' Team Was Chosen HBO's Real-Life Game of Thrones: The Fight to Stay Rich, on Top and Score Bill Simmons Taraji P. Henson, Viola Davis and Drama Actress A-List Tackle Race, Sexism, Aging in Hollywood Lena Dunham, Amy Schumer and Comedy Actress A-List in Raunchy, R-Rated Roundtable The Cast of Kids on Sex, Death, and the NC-17 Movie's 20th Anniversary White House Is Lit Up Like a Rainbow to Celebrate Marriage Equality <mark>Chris Brown</mark> Is Releasing New Album in Fall - Listen to New Song \"Liquor' Here!"}, {"articleID": "2020022917_00182633_W", "names": {"Laurent Dubreuil": ["Q3219194", "Q4038571"], "Gaetan Boucher": ["Q16186991", "Q494831"]}, "date": "2020-02-29", "url": "https://lethbridgeherald.com/sports/national-sports/2020/02/29/canadian-speedskater-dubreuil-captures-silver-at-world-sprint-championships/", "content": "Canadian speedskater <mark>Dubreuil</mark> captures silver at world sprint championships Poll Are you happy, for the most part, with the new Alberta budget unveiled on Thursday? Yes Follow @ Leth_Herald on twitter By The Canadian Press on February 29, 2020. HAMAR, Norway--Canada's <mark>Laurent Dubreuil</mark> captured a silver medal at the ISU world sprint and allround speedskating championships on Saturday. The 27-year-old from Levis, Que ., is only the fourth Canadian to climb the medal podium at the world sprint championships, joining Jeremy Wotherspoon, who won nine medals, <mark>Gaetan Boucher</mark> (five) and Mike Ireland (four). <mark>Laurent</mark> earned second-place results in both the 500 and 1,000 metres on Saturday to clinch second in the overall standings. He was first in the 500 and fifth in the 1,000 on Friday. \"My two 500 and my 1000 today were exceptional races for me,\" <mark>Dubreuil</mark> said. \"I was able to manage everything around me to finish second at the world sprint championships, my favourite competition and the hardest and more stressful competition of the season, by far .\" His combined time of 137.700 put him second in the overall standings by 0.47 seconds behind Japan's Tatsuya Shinhama. Min Kyu Cha of Korea won bronze. Calgary's Kaylin Irvine was Canada's top-ranked woman, finishing a career-best ninth. This report by The Canadian Press was first published Feb. 29, 2020. Share this story:"}, {"articleID": "2010082920_00368594_W", "names": {"Earl Thomas": ["Q2051514", "Q23304639", "Q5326117"]}, "date": "2010-08-29", "url": "http://sports.espn.go.com/nfl/trainingcamp10/news/story?id=5509879&campaign=rss&source=NFLHeadlines", "content": "percy harvin's migraine headaches have been a riddle that no one has been able to solve. harvin after another battery of tests last week, and a promising 2010 preseason debut, harvin hopes he is getting closer to figuring out a debilitating medical condition that has plagued him for most of his life. minnesota vikings receiver had two catches for 30 yards and took two big shots to the head saturday night in a preseason victory over seattle, the first time he's played this year after being stricken by migraines for most of training camp. \"i felt great,\" harvin said after the game. \"just glad to get back out there with my teammates and work some of the rust off. i've got a lot of work to do, conditioning-wise, but it felt good to get out there .\" harvin has barely practiced this month while dealing with the death of his grandmother and a string of headaches that have been maddeningly random and devastatingly severe. no one knows exactly when they're going to occur or what triggers them. even more frustrating, doctors and trainers have been unable to come up with a treatment to neutralize them. the vikings have gone to great lengths to try to identify the causes and understand the problem. \"it's kind of a tenuous thing,\" coach brad childress told the associated press last month. \"what can exacerbate migraines? stress? check. fatigue? check. head or neck trauma? hmmm .\" espn.com's kevin seifert writes about all things nfc north in his division blog network: nfl nation despite playing a sport that doesn't exactly help his condition, harvin said he has no plans on making a career change. \"it's been rough, but it's life,\" harvin said. \"i don't want the easy way out sometimes. it's life, i'm dealing with it. i finally got back and it's good to be back out here with my teammates .\" he missed one game last year because of the headaches and missed several practices in the playoffs. but teammates and coaches got their first real glimpse of how serious they can be on aug. 19, when harvin vomited and collapsed on the practice field. he was taken by ambulance to a local hospital and spent the night. more tests ensued and harvin surprisingly suited up for the game saturday night despite not practicing all week. \"i did a test [friday] night and they found some things that we think was the main cause of it,\" harvin said. \"we're feeling really confident. i know we said that a couple times, but i think this time we found what the main cause was. i'm not saying i'll never get a headache again, but hopefully we can slow it down a little bit .\" the vikings know they have to be cautious in their optimism, but they were treating that development as good news for the reigning offensive rookie of the year. sidney rice out for possibly the entire first half of the season with a hip injury, harvin's importance to the offense has grown exponentially. he is brett favre's favorite target and a valued weapon for offensive coordinator darrell bevell, who can line him up at receiver or running back. \"it was a good start,\" favre said of harvin's first game. \"percy's a football player. i'm not surprised at anything he does .\" lofa tatupu that knocked his helmet off in the first half and another from safety <mark>earl thomas</mark> on a slant over the middle. \"he didn't seem any worse for the wear,\" childress said. \"he took a couple of pretty good licks .\" harvin knows that's going to come with the territory and prepared himself for it. \"everybody looks for that first contact to get hit, to feel part of the game,\" he said. \"i was looking forward to getting hit .\" privacy policy and safety information/your california privacy rights"}, {"articleID": "2014051323_00047585_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2014-05-13", "url": "http://www.newkerala.com/news/2014/fullnews-52343.html", "content": "hollywood-news Mary-Kate Olsen likely to design own wedding dress Los Angeles, May 13: Actress-turned-fashion designer Mary-Kate Olsen might be mum on her engagement to Olivier Sarkozy, but she has hinted that she may create her own wedding gown. In an interview with WWD, the 27-year-old actress and designer opened up about her plans, reports eonline.com. \"I'm, like, not even there yet,\" she said of deciding on a wedding dress. <mark>David Cameron</mark> says Gary Barlow deserves to keep OBE despite tax avoidance"}, {"articleID": "2019111713_00026668_W", "names": {"Steven Davis": ["Q18631669", "Q355807", "Q41805470", "Q57433367"], "Jordan Jones": ["Q27830873", "Q48841097", "Q55014126", "Q6276648"]}, "date": "2019-11-17", "url": "http://www.croydonguardian.co.uk/sport/national/18042161.oneill-plays-impact-double-role/", "content": "O’Neill plays down impact of double role By Press Association 2019 Northern Ireland v Netherlands--UEFA Euro 2020 Qualifying--Group C--Windsor Park 0 comment Michael O’Neill has insisted he will have no problem juggling his new role as Stoke boss with his position as Northern Ireland manager between now and the Euro 2020 qualifying play-offs in March. An agreement between the Potters and the Irish FA allows O’Neill to remain in charge of Northern Ireland for the fixtures next spring--their last chance of reaching Euro 2020 after Saturday's 0-0 draw with Holland closed the door on automatic qualification. On Friday, O’Neill refused to say definitively he would still be at the helm of the national team as he adjusts to the demands of the Championship, but speaking after the game he was adamant selecting a squad and scouting the opposition--who will be named in Friday's draw--would not pose a problem. \"It's dead easy,\" he said. \"We're going to turn up on a Sunday and play on a Thursday. I can pick my squad now. I could name it tomorrow. There are not 40 players out there we're not picking .\" I'll be able to (prepare for the opposition). That's not a problem. Our opponents don't play between now and then, they've already played. We're not going to watch individual players play for their clubs, so the work we have on the opponents, we'll have that well in advance. \"O’Neill had previously suggested\" common sense will prevail \"regarding his situation and they would find the\" right resolution for everyone \", comments taken as meaning he may find the demands on his time too much. But that was not the position he took after Saturday's draw--a game Northern Ireland might have won but for a missed penalty from captain <mark>Steven Davis</mark> in the first half .\" In this job, I could watch 40 games or two games and 99 per cent of the time, my squad will be pretty much the same, so people are making a lot out of this situation, which doesn't exist, \"he said .\" To be honest, there's nobody better than me to judge this because I actually do the job and the reality of the situation is to put a coach in with a play-off situation with three days' preparation wouldn't be fair to the players or the association because of what's at stake. \"And it wouldn't be fair to the coach to go and prepare .\" We know our team, we know our best team. We have one or two players to come back in--Conor Washington and <mark>Jordan Jones</mark>--but the squad picks itself other than that. \"Either way, virtually every play-off permutation has Northern Ireland playing away, making Saturday almost certainly O’Neill's Windsor Park farewell with Tuesday's final Group C fixture away to Germany in Frankfurt. He will end his tenure having taken charge of 32 games at the National Stadium, winning 17, drawing six and losing nine, a record he is proud of .\" I think this stadium used to be a place where at times (our own) players and fans dreaded coming, and performances showed that, \"he said .\" Now we have a great atmosphere here, the redevelopment of the stadium has been a big factor in that but what we also have is a group of players who love playing here and a really strong bond between the supporters and the players. \"It's really important we hold on to that going forward, regardless of who's in charge of the team .\" 0 comment"}, {"articleID": "2019052121_00224135_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"], "Stan Grant": ["Q7597664", "Q7597665"], "Donald Trump": ["Q22686", "Q27947481"], "Kerry Brown": ["Q55615855", "Q6394477", "Q6394478", "Q6394480"]}, "date": "2019-05-21", "url": "http://mideastafrica.foreignpolicy.com/2019/05/21/scott-morrison-won-australias-election-against-all-odds-it-shouldnt-have-come-as-a-surprise-alp-shorten-folau-religion/", "content": "Argument <mark>Scott Morrison</mark> Won Australia's Election Against All Odds. It Shouldn't Have Come as a Surprise. The Australian Labor Party made the same mistakes that have led to failure for center-left leaders across the globe--and the right is reaping the benefits. By <mark>Stan Grant</mark> | May 21, 2019, 4:44 PM Australian Prime Minister <mark>Scott Morrison</mark> (C) shakes hands with Opposition Leader Bill Shorten (L) at a special ecumenical service to mark the start of the parliamentary year at St Paul's Anglican church on Feb. 12 in Canberra, Australia. Tracey Nearmy/Getty Images Understanding Australia's shock election last weekend, in which the right-wing coalition of incumbent Prime Minister <mark>Scott Morrison</mark> unexpectedly won, requires looking to an unlikely source: a conservative Christian rugby star. The pundits didn't see it coming, but they don't spend too much time in church pews. Israel Folau, one of the most outstanding athletes of his generation, has become a lightning rod for debate about freedom of religion in Australia. Folau had his contract with Rugby Australia terminated after he posted a social media message six weeks ago that said, among other things, that gay people were sinners doomed for hell unless they repented and accepted Jesus Christ as their savior. He has been accused of hate speech, causing offense to the LGBTQ community, and breaching the game's code of conduct. What was a heated sports issue spilled over into politics in the final week of election campaigning. <mark>Morrison</mark> shares a similar Pentecostal Christian faith with Folau, and he was asked by journalists if he agreed with the rugby legend and also condemned gay Australians. <mark>Morrison</mark> replied as politicians do: He said he separated his politics and his faith. But within hours, Bill Shorten, the leader of the opposition progressive Labor Party, seized on the remark, seeing a chance to damage the prime minister. But playing politics with faith was a misstep--perhaps a fatal one. Shorten's move raised red flags in the minds of many voters. Just what did he stand for? Did he value the rights of the LGBTQ community not to be offended over the rights of someone to publicly profess their religious beliefs? It came in the same week that Shorten had given a rousing speech pledging to \"change the nation forever .\" But did Australians really want their country changed? Shorten had already outlined an agenda of social change: an ambitious plan for indigenous rights, making Australia a republic (something that had been put to the Australian people and rejected in 1999), as well as higher taxes on what Shorten called \"the big end of town .\" It was old-style class politics, and it spooked some Australians. Retirees, middle-class parents, and those dependent on the mining industry for their livelihoods all felt they were in the firing line. Christian leaders now say that religious freedom was a sleeper issue that turned votes in critical marginal seats. This was the so-called unlosable election for Shorten, who lost to <mark>Morrison</mark>'s predecessor in the 2016 federal election; opinion polls stretching back more than two years said the conservative government was doomed. It was wracked with division, having dumped two prime ministers in internal party coups. They went into the election light on policy but led by a new leader big on faith. Within hours of the vote count, it was clear the polls had been hopelessly wrong. Grand narratives are often foolhardy, and something as complex as an election can't be so tidily explained. But there is a realignment taking place. The wave that has broken across liberal democracies in the West has washed up in Australia. The conservatives have been in power for six years, and after this victory some analysts are predicting at least another six more. Throughout the world, long-silent voices are making themselves heard and it is shaking up politics as usual. In the United States, <mark>Donald Trump</mark> tapped into the frustration of those who felt left behind and promised to make their country great again; Viktor Orban in Hungary has entrenched his leadership by toughening the borders and stopping refugees; in France, Germany, the Netherlands, and Italy, far-right parties are increasing their popularity. At its worst, there are fears of resurgent fascism--certainly nationalism is back. People are saying they want to belong and they want their leaders to put them first. On immigration, trade, climate change policy, and more, countries are putting themselves first amid a blowback against multilateralism and globalization. After two decades marked by Middle East wars, the financial meltdown, and the Great Recession of 2008, whatever consensus had held around the free movement of goods and people and pooled sovereignty is looking frayed. Australia's election is not its <mark>Trump</mark> or Brexit moment as some have suggested--the picture here is too complicated for that. Overall, Australia's democracy is strong: The Economist Intelligence Unit's Democracy Index has placed Australia in the top 10 for the past decade. It is a country not given to political extremes; it is centrist and broadly conservative with a strong ethos of what Australians call a \"fair go\" for all. Australia avoided the worst of the financial crisis and has had nearly 30 years of uninterrupted economic growth in part fueled by a mining boom driven by China's hunger for Australia's natural resources. Compulsory voting also cushions Australia against get-out-the-vote campaigns and voter suppression efforts that can be so decisive in countries like the United States. But there are similarities: The political divide so critical elsewhere in the world is alive in Australia. It has been dubbed the \"quinoa curtain\" --the split between city and country, particularly the heavily mining-dependent state of Queensland, which broke heavily conservative in the election. The other similarity is that Shorten, like progressives globally, lost the ability to talk to big numbers of Australians--whether on religious freedoms, free speech, tax, or climate change policy. He created too many potential losers. Even worse, he lost the ability to listen. He wanted to change Australians, but he didn't think to ask if they wanted changing. Progressive hubris plays into the hands of the conservative right. The right is at home talking about nation and family and faith. <mark>Scott Morrison</mark> is a Christian, rugby-loving, suburban family man. In Australia we would endearingly call him a \"bogan .\" He is also a tough politician who knows his side: As immigration minister in 2013 and 2014 he turned back refugee boats and toughened Australia's border patrol; he once brought a lump of coal into Parliament to argue against shutting down mines to appease environmentalists. <mark>Morrison</mark> dedicated his victory to the \"quiet Australians .\" He claims to like them just as they are and does not seek to change them. Progressive politicians in Australia, like everywhere, are now realizing that if they want change, they need to win power--and that means bringing the people with them rather than telling them what's good for them. Two days before Australia's federal election, one of the country's most loved and popular former prime ministers, Bob Hawke, passed away. He came to power in the 1980s as a former union leader and towering figure of the left, but his message was summed up in one word: consensus. In four elections, he was never defeated. And he was a rugby fan. View Comments Tags: Argument, Australia, Elections, Politics, Religion, Sports Trending Now Sponsored Links by Taboola By Taboola More from Foreign Policy By Taboola Read More Australia's Draconian Refugee Policy Comes Home to Roost The government has gone to great lengths to keep asylum-seekers from its shores. Now it might have to accept some of them after all. Argument | Mark Isaacs The Abuse Scandal Rocking Australia's Special Operations Forces How changing military strategy may have led to misconduct. Argument | C. August Elliott Is China Pulling the Strings Down Under? Revelations about Chinese influence have rocked Australian media and politics. Should the U.S. have the same debate? ChinaFile | <mark>Kerry Brown</mark>, Kevin Carrico, Peter Mattis"}, {"articleID": "2018120715_00458348_W", "names": {"Kevin De Bruyne": ["Q357984", "Q52835665"]}, "date": "2018-12-07", "url": "http://www.rhyljournal.co.uk/sport/national/17284225.chelsea-clash-comes-too-soon-for-de-bruyne-and-aguero/", "content": "Sergio Aguero will miss Manchester City's trip to Chelsea 0 comments Sergio Aguero and <mark>Kevin De Bruyne</mark> have been ruled out of Manchester City's Premier League clash at Chelsea on Saturday. Aguero, City's record scorer, has not featured in the champions' last two games due to what was initially described as a minor muscle problem and he will again not be risked. <mark>De Bruyne</mark>, who scored the winner against his former club at Stamford Bridge last season, has missed most of the campaign so far with knee problems. Guardiola confirms neither Aguero nor <mark>De Bruyne</mark> will be fit to face Chelsea #MCFC pic.twitter.com/gu6Mbczwc2--Andy Hampson (@ andyhampson) December 7, 2018 When the Belgian suffered his latest setback early in November it was thought he could have an outside chance of returning to face the Londoners, but that has proved too optimistic. Speaking at his pre-match press conference, manager Pep Guardiola said: \"Both cannot play tomorrow. Both will be back soon .\" Chelsea have slipped to fourth in the table, 10 points behind leaders City, after losing two of their last three games but Guardiola sees it as a tough time to be playing them. He said: \"Always Stamford Bridge is difficult. I've travelled there many times as a manager and won once--last season. Most of the time I lose there. The day we truly believed we could win the league ...?? ⚽ ️ #mancity pic.twitter.com/mas3GeRqnn--Manchester City (@ ManCity) December 7, 2018\" They are a good side, a really good team. You see the level of people on the bench--they don't play regularly but they are excellent players. They are a real contender, an excellent team. \"How are they going to react after losing two games? I can imagine how intense, how aggressive and how committed they will be. That's why it's a good test for us, I will welcome that .\" Guardiola's opposite number Maurizio Sarri has spoken of City in complimentary terms ahead of the game, describing them as \"the best team in Europe, maybe the best in the world\". Guardiola was too modest to agree. Pep Guardiola insists his side have more to prove before they can call themselves the world's best team (Martin Rickett/PA) \"Thank you but we are not the best,\" he said. \"To be the best we have to win the titles and we did not win the titles to be the best in the world .\" Guardiola feels Tuesday's 2-1 victory at Watford, when City endured a nervy finish after dominating early on, underlines this point. He said: \"We could have dropped two points in the last 10 minutes. After 2-0 we were not the best side. There are many things we can do better and tomorrow we have a very demanding test for us .\" Guardiola has been impressed by the work of Sarri so far in his first season at Chelsea. He said: \"He needs time. Maybe they are not playing 90 minutes but when they play good for 50, 60, 70, 75 minutes they are excellent .\" 0 comments"}]