[{"date": "2015-01-21", "url": "http://highschoolsports.mlive.com/news/article/5991375050680989442/jackson-northwest-senior-bowler-brian-lewis-fires-300-game-in-victory-over-jackson/", "content": "JACKSON--<mark>Brian Lewis</mark> stepped up in the fifth frame of the second game Wednesday, rolled his bowling ball at the pins and sent all 10 of them scattering for a strike. His Jackson Northwest High School bowling coach, Gerry Lobdell, responded by saying, \"About time .\" The well-timed joke drew a dry smirk from Lewis, who had a spare the frame prior--and 15 straight strikes before that. Lewis, a senior, rolled the first 12 strikes of the first game of a match against Jackson at Airport Lanes for a 300 game. He added three more strikes to start the second game before a solid 9-pin ended his bid at a second perfect game. But his first game had the place jumping and everybody buzzing when it was over. \"The 10th frame, it was pretty scary but a great feeling,\" said Lewis, who led his team to a 26-4 victory over Jackson. \"The first one was pretty good, the second one was pretty good and the last one got a little inside, but it held in there and got the job done .\" Lewis is the seventh high school boys bowler to roll a 300 game this season, as reported to the Michigan High School Bowling Association website. Lewis also joins a list of recent Northwest bowlers to record 300 games in high school matches, joining Sierra Lasky in 2014, Corey Daniels in 2012 and <mark>Nick Taylor</mark> in 2011. Teammate Trevor Simons had a 300 game in November during the Greater Jackson USBC youth city tournament at Brooklyn Lanes, bowling with Lewis and fellow seniors Chris Salkowski and Tyler Ockert. Lewis remembered the moment Simons got his perfect game. \"It was awesome to watch,\" Lewis said. \"I felt kind of proud, it was cool. I was like,' I want to go get one of those .'\" Bowling with a Roto Grip Hyper Cell he also used to shoot his previous high game of 289 during a Youth Masters tournament, Lewis packed the pocket 12 straight times in the first game. He showed no nervousness, even as the crowd went silent in the late-going. \"The 10th frame was when they really got bad,\" he said of the nerves. \"When I was going up for the last one, I thought I was having a seizure. I wasn't sure, but that's what it felt like. Up until then, it wasn't too bad .\" In the crowd for his feat were his parents, Terry and Nancy Lewis, his girlfriend, and a large gathering of Northwest supporters. He said picking up his first perfect game with his team was the way he would have drawn it up. \"It's awesome getting to celebrate with the guys,\" Lewis said. \"It's nice having their support .\" Lewis finished the second game with a 213 for a 513 two-game series for Northwest (3-1). Simons, incidentally, had a solid day on the lanes himself, firing scores of 258 and 243 for a 501 series. Rob Dunham added games of 205 and 243 for the victors. Jackson (4-3) was led by Drake Csage with games of 257 and 235 for a 492 series, Joseph Bleiler with 213 and 223 (436) and Jacob Oberst with 236 and 188 (422).", "articleID": "2015012200_00003952_W", "names": {"Nick Taylor": ["Q16195356", "Q18128640", "Q20190704", "Q30084790", "Q59569480", "Q7028023", "Q7028025"]}}, {"date": "2015-01-22", "url": "http://blogs.ocweekly.com/heardmentality/2015/01/the_quiet_battle_for_the_soul_of_billy_preston_is_being_fought_in_a_santa_ana_courtroom.php", "content": "A Rap Against Rape By Gabriel San Roman On Nov. 21, 2005, the man known as \"The Fifth Beatle\" lay on a hospital bed, dressed in street clothes, thrashing and gasping for air. Billy Preston had just arrived at the Intensive Care Unit at <mark>Daniel Freeman</mark> Marina Hospital in Marina del Rey, rushed there from the Canyon, a nearby drug-rehab center. A large, frustrated nurse wrestled with the legendary, 59-year-old organ player, struggling to fit a black oxygen mask over his face. Eyes wide with fear, Preston dodged his head back and forth, unable to breathe. Holding his hand at his bedside was Preston's manager, Joyce Moore. She tried in vain to calm him down. \"I gripped him tight and said,\" Boo, you gotta relax,' \"Moore says .\" I thought he was having a panic attack. I kept saying, \"Breathe with me...breathe with me .'\" But it wasn't a panic attack or the pangs of crack withdrawal. Years of drug abuse had culminated in malignant hypertension and pericarditis, the internal drowning of the area around Preston's heart. He mustered the strength to push the mask away, look up at Moore and painfully utter his last words: \"I...can't!\" Suddenly Preston's eyes rolled back, and his grip loosened. The monitors flatlined. Even after doctors drained the fluid around his heart, he didn't wake up. He lay in a coma for nearly six months before dying on June 6, 2006. The loss is a nightmare that Moore's mind refuses to erase. \"I feel like Billy's sitting here. It's weird...He never leaves,\" says the spindly, silver-haired 69-year-old. \"It's not a physical presence, more like a conscience thing .\" Producing a string of acclaimed albums and hits through the 1960s and '70s, Preston's talent is knitted into the fabric of rock & roll, soul, gospel, and funk. In life, his talent defied gravity. The same goes for the financial mess that has followed his death. On a recent Tuesday night, Moore, dressed in a black-and-white-striped cardigan, sits in an empty restaurant inside a Costa Mesa hotel. There's barely room for food on the table, which is covered in court documents, the earthly remnants of Preston's ghost. They're pieces of the musician's tangled, now-long-posthumous bankruptcy case, originally filed in 2005. For nearly a decade, Moore has waged a quixotic battle with bankruptcy trustee lawyers in Santa Ana's Ronald Reagan Federal Building and Courthouse. Besides settling what the bankruptcy trustee believes to be Preston's $4 million debt, there's the fight over money gained from Preston's intellectual property and royalties from Preston Music Group Inc. (PMGI), of which Moore is the CEO. Decades later, Preston's soulful classics--including \"Nothing From Nothing,\" \"Will It Go Round in Circles\" and \"That's the Way God Planned It\" --sadly describe the legal battle that has followed his death. Accusations of misconduct have been leveled by both sides of the case. The bankruptcy trustee's lawyers accuse Moore of using Preston's royalties for her own financial gain, not paying his debts and refusing to disclose the financial records of PMGI. In the media, she's been accused of isolating Preston from his family in life and hoarding his money in death. Moore insists the bankruptcy trustee has no right to go after intellectual property as part of the delinquency of Preston's estate and that the entire case itself is a fraud. The war has put a hold on concerts, tours and projects done in the artist's memory--in other words, it kills any and all projects that might create revenue to pay off his creditors.", "articleID": "2015012201_00018036_W", "names": {"Daniel Freeman": ["Q18149703", "Q39051822", "Q42157784"]}}, {"date": "2015-01-22", "url": "http://www.thejc.com/news/uk-news/128731/money-mensch-martin-lewis-victim-commuter-rage", "content": "<mark>Martin Lewis</mark> Journalist <mark>Martin Lewis</mark> was a victim of \"commuter outrage\" on his way to work on Wednesday, he has revealed on his Facebook page. Mr <mark>Lewis</mark>, who writes a money-saving tips Money Mensch column in the JC, was attacked by the entrance of Waterloo station. He wrote: \"Feeling slightly shaken having just been a victim of commuter rage .\" A 50ish, grey haired, heavy set, white man, professionally dressed, carrying a bag, shoved me hard out of the way from the back. \"I said (not shouted) quite simply -\" the word is excuse me'. \"He turned around gripped me at the neck, by my coat, shoved me hard Mr <mark>Lewis</mark> later complained that the incident was blown out of proportion, after it was picked up by the national media. He wrote on his Facebook page:\" That'll teach me to vent on here as if it were a private page. Talk about turning a molehill into a mountain. \"<mark>Mark Lewis</mark>: Hacking's like speeding. You know it's wrong, but you do it <mark>Mark Lewis</mark>: Hacking's like speeding. You know it's wrong, but you do it", "articleID": "2015012216_00016592_W", "names": {"Mark Lewis": ["Q14950646", "Q16189365", "Q16218259", "Q23925347", "Q6768582", "Q6768584", "Q6768585", "Q6768586", "Q6768587", "Q6768589", "Q6768591", "Q6768593", "Q6768594"], "Martin Lewis": ["Q16151827", "Q3850102", "Q6775999", "Q6776002", "Q6776003"]}}, {"date": "2015-01-22", "url": "http://www.kboi2.com/sports/Patriots-coach-I-had-no-knowledge-of-deflated-footballs-in-AFC-game-289440961.html", "content": "FOXBOROUGH, Mass. (AP) - Patriots coach Bill Belichick said Thursday he doesn't know how footballs became deflated during the game that got his team to the Super Bowl. But Belichick declined to answer questions after saying he knew nothing until Monday morning about accusations that his team cheated with underinflated footballs in its win against the Colts in the AFC championship game on Sunday night. The NFL is investigating. Belichick said the team is fully cooperating. \"I had no knowledge of this situation until Monday morning,\" said Belichick, who said he was \"shocked\" to learn the news. \"I would say I've learned a lot more about this process in the last three days than I knew or have talked about it in the last 40 years that I've coached in this league,\" Belichick said during an 8 1/2 - minute opening statement during an 11 1/2 - minute news conference. \"I had no knowledge of the various steps involved in the game balls and process that went through .\" Belichick did not specify who in the Patriots organization was responsible for the underinflated balls, or absolve anyone besides himself of potential wrongdoing. Softer balls are generally considered easier to throw and catch, and quarterbacks, specialists and equipment managers are known to have very individualized preferences in how footballs are readied for games. Belichick said he was unaware of the process for game balls until the accusations were raised. Belichick said he sometimes hears quarterbacks, kickers and other specialists talk about their preferences. \"I can tell you and they will tell you that there is never any sympathy from me whatsoever on that subject. Zero,\" Belichick said. Patriots quarterback <mark>Tom Brady</mark> is expected to address reporters later Thursday. \"<mark>Tom</mark>'s personal preferences on his ball, footballs, are something that he can talk about in much better detail and information than I could possibly provide,\" Belichick said. \"I can tell you that in my entire coaching career I have never talked to any player, staff member about football air pressure .\" The NFL requires balls to be inflated between 12.5 and 13.5 pound per square inch. Under league rules, each team provides 12 balls for use on offense. Referees approve the balls more than 2 hours before game time, then keep the balls until they're turned over to ball handlers provided by home teams just before kickoff. Belichick said the balls used by the Patriots offense are inflated to the \"12 1/2 - pound range\" and \"any deflation would then take us under that .\" Going forward, he said, the Patriots will inflate footballs to a safe level to prevent them from dropping under allowable air pressure during games. \"We will take steps in the future to make sure that we don't put ourselves in this type of situation again,\" he said. The coach who has won three Super Bowls said he generally forces players to practice under bad-ball conditions. \"Anytime players complain about the quality of the footballs, I make it worse and that stops the complaints,\" he said. \"We never use the condition of the footballs as an excuse. We play with whatever or kick with whatever we have to use .\" The issue has drawn strong reaction from around the game and its fans as the Patriots prepare to play the Seattle Seahawks on Feb. 1 in Glendale, Arizona, for the NFL title. Several players said it would not distract them in preparing for the game. \"It's unfortunate. We'd rather be celebrating our trip to the Super Bowl,\" special teams captain <mark>Matthew Slater</mark> said. \"It's important to us that we respect the game and deal with things in a way that's considered professional .\" Copyright © 2015 Sinclair Interactive Media", "articleID": "2015012222_00042963_W", "names": {"Matthew Slater": ["Q52906896", "Q6791235"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}}, {"date": "2015-01-23", "url": "http://tampabay.com/blogs/the-buzz-florida-politics/scott-recommends-money-for-individuals-with-disabilities/2214899", "content": "State Roundup CFO Jeff Atwater, Agriculture Commissioner Adam Putnam call for investigation into FDLE firing CFO Jeff Atwater, Agriculture Commissioner Adam Putnam call for investigation into FDLE firing Gov. Scott proposes Bright Futures expansion but doesn't address criticisms Enterprise Florida picks new CEO: <mark>Bill Johnson</mark>, Miami-Dade's longtime port chief Editorial: The $1 billion cost of not taking Medicaid expansion money The Buzz From the staff of the Tampa Bay Times Scott recommends money for individuals with disabilities Gov. Rick Scott on Friday unveiled new additional of his budget proposal, including $8 million to enroll all individuals \"with critical needs\" from the waiting list to the Developmental Disabilities Medicaid Waiver Program. \"I am pleased to announce that for the second year in a row, Floridians will be removed from the critical needs waiting list with our proposed funding,\" he said in a statement. Scott is also prioritizing the Personal Learning Scholarship Account program. The program provides scholarships worth $10,000 or more to children with profound special needs. The money can be applied toward private school tuition, tutoring, educational materials and therapy. The governor's proposed budget will include an additional $5 million for the program. \"Every individual should have the opportunity to get a great job and education regardless of the challenges they may face, and that is why we are making this funding a priority,\" Scott said. Analysis: What the House GOP's abortion <mark>bill</mark> about-face really means Tampa Bay Times 490 First Avenue South", "articleID": "2015012320_00044789_W", "names": {"Bill Johnson": ["Q16204402", "Q17385655", "Q17626755", "Q21585452", "Q24817767", "Q2903258", "Q30717048", "Q3366808", "Q339036", "Q48645040", "Q4909622", "Q4909623", "Q4909624", "Q4909626", "Q56558077", "Q720797", "Q862215", "Q862229"]}}, {"date": "2015-01-23", "url": "http://www.bizcommunity.com/Article/196/469/123640.html", "content": "Brand News news China weather dents SABMiller quarterly beer sales BizLike SABMiller's weather-related woes in China spilled over into the brewer's third quarter ended December, the company said Wednesday, 21 January 2015, in a trading update that showed its total beer volumes are on track to shrink in its 2015 financial year. SABMiller's lager volumes were 1% lower in its third quarter after a similar contraction in the first half of its financial year, ending in March. In China, volumes fell 9% in the third quarter, following a 10% fall in the previous three months when bad weather over the peak summer season dented sales. Wholesalers remained overstocked going into the third quarter and it weighed on orders during the three-month period, a company spokesman said. Kagiso Asset Management investment analyst Dirk van Vlaanderen said: \"While China contributes around 20% of SABMiller's group volumes, it only adds around 3% to group operating profit and so the unexpected Chinese volume decline in quarter three is unlikely to have a significant profit impact at a group level .\" SABMiller said its group net producer revenue, or sales less excise and similar taxes, grew 4% in the third quarter. Continuing a previous trend, lager volumes were down 1% while soft drink sales remained buoyant, with volumes up 4% in the quarter. SABMiller CE <mark>Alan Clark</mark> said the firm's Latin American and African businesses \"continued to grow both volumes and revenues, together with Europe, while more difficult trading conditions, particularly in China, held back the overall group performance\". In Colombia - SABMiller's single most profitable market where its share of beer is about 98% - net producer revenues grew 5% with overall beverage volumes up 1%, held back by a 1% decline in lager volumes. SABMiller is preparing to deal with a fresh wave of competition in Colombia, as soft drinks group Postobón and Heineken - controlled brewer Compania Cervecerias Unidas eye a share of the market from a brewery they are developing. SABMiller said lager volumes in the country were \"impacted by a shift in consumer spending patterns, along with pressure on disposable income driven by increased levels of household debt and rising inflation\". SABMiller's lager volumes were up most in Africa, with growth at 3%. In SA, which was consolidated under SABMiller's Africa region from July last year, net producer revenues grew 6%, \"driven by positive pack and brand mix in lager\". Both lager and soft drinks volumes grew 2%. The fastest growing African countries for the brewer were Mozambique, where net producer revenue was up 26% on a 21% jump in lager volumes; and Nigeria, where net producer revenue grew by a third. Van Vlaanderen said SABMiller's third-quarter numbers \"were a bit of a mixed bag\" with Latin America and Africa offsetting weaker performances in North America, the Asia-Pacific region and Europe. \"The negative impact of a strong US dollar against SABMiller's key currencies meant reported sales actually fell by 5% in quarter three. We remain concerned that some of SABMiller's key emerging markets remain vulnerable to slower growth rates and further currency weakness given their dependence on oil and other global commodities .\" While some severe currency devaluations were already evident, \"we believe the inevitable consumer slowdown in these regions makes the growth outlook challenging in the quarters ahead\" , Van Vlaanderen said. For more than two decades, I-Net Bridge has been one of South Africa's preferred electronic providers of innovative solutions, data of the highest calibre, reliable platforms and excellent supporting systems. Our products include workstations, web applications and data feeds packaged with in-depth news and powerful analytical tools empowering clients to make meaningful decisions.", "articleID": "2015012404_00005519_W", "names": {"Alan Clark": ["Q15378814", "Q16204309", "Q18685443", "Q21453460", "Q676375"]}}, {"date": "2015-01-26", "url": "http://www.sys-con.com/node/3285442", "content": "News Feed Item WealthEngine Changes Landscape of Data-Driven Marketing with New Prospecting Product BETHESDA, Md., Jan. 26, 2015 / PRNewswire /--WealthEngine, the leading provider of wealth intelligence, prospect research and marketing services for nonprofits, healthcare, education, luxury goods and financial services, announces the release of its new prospecting solution, WE Prospect. Marketers, agencies and fundraisers can now easily identify ideal targets with WE Prospect by creating ultra-segmented audiences using wealth, demographic, lifestyle and personal attributes across a database of more than 300 million people in the U.S., delivered with the speed and accuracy of an Internet search engine. In the era of big data, WealthEngine has shifted the paradigm for prospecting for both marketers and fundraisers. Rather than starting with a list of names that marketers must cull for the perfect customer, WE Prospect allows marketers to begin with their model of an ideal customer, then find the consumers that fit those attributes. This approach empowers WealthEngine customers to take a more accurate and focused methodology to prospecting, while consumers will now experience more personalized, meaningful communication from the brands that matter most to them at the right moment in time. The result is a win-win for marketers and consumers, and helps marketers achieve a higher ROI while delivering higher satisfaction to end customers. \"The adoption of data-driven marketing is widespread. And WE Prospect is what differentiates WealthEngine from the rest of the market,\" said WealthEngine chief marketing officer Mike Lees. \"WE Prospect uncovers who has the wealth and affinity to buy or donate and determines if now is the right time to engage. No other company can deliver these capabilities with the clarity and precision that WE Prospect achieves .\" WE Prospect provides sales professionals, marketers and fundraisers with highly relevant, actionable and cost-effective options for their prospecting needs, including: Salesforce users can leverage an easy way to find, understand and contact affluent prospects - directly within their existing Salesforce database. WE Prospect for FindWealth8: WealthEngine subscribers can access real-time list curation and development as well as engage across channels with actionable contact info and optional online profile mapping - all within WealthEngine's online platform. WE Prospect Standalone: Customers can collaborate with WealthEngine to develop custom, highly-segmented audiences of high-potential prospects. \"As an industry leader in audience and wealth intelligence, WealthEngine is truly driving prospecting out of the Dark Ages,\" said <mark>John</mark> Funge, senior vice president of product management at WealthEngine. \"Through its modern, intuitive interface, WE Prospect provides users with a simple way to access unparalleled predictive insights into a prospect's financial status and persona. Now marketers and fundraisers know more before they engage, thus driving efficiency, effectiveness and actionability .\" For more information on WE Prospect, join us for our upcoming webinar, \"Introducing WE Prospect - Perfect Prospecting Made Simple\" on February 3, 2015. See how it works, learn its capabilities, and join an exclusive Q & A with <mark>John</mark> Funge. By attending the webinar, you will also have an exclusive opportunity to register for a free trial--allowing you to personally test drive WE Prospect & see how easy it is to target your best prospects. About WealthEngine WealthEngine ™, Inc. is a leading provider of audience intelligence solutions to customers targeting HNW clients in the healthcare, education, financial services and luxury markets. The company's unique data-driven approach to analytics, prospecting, and marketing has transformed the sales, marketing and fundraising processes of more than four thousand clients. Headquartered in [email protected] To view the original version on PR Newswire, visit: http: //www.prnewswire.com/news-releases/wealthengine-changes-landscape-of-data-driven-marketing-with-new-prospecting-product-300025006.html Published January 26, 2015 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. \"For over 25 years we have been working with a lot of enterprise customers and we have seen how companies create applications. And now that we have moved to cloud computing, mobile, social and the Internet of Things, we see that the market needs a new way of creating applications,\" stated Jesse Shiah, CEO, President and Co-Founder of AgilePoint Inc., in this SYS-CON. tv interview at 15th Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. You use an agile process; your goal is to make your organization more agile. But what about your data infrastructure? The truth is, today's databases are anything but agile - they are effectively static repositories that are cumbersome to work with, difficult to change, and cannot keep pace with application demands. Performance suffers as a result, and it takes far longer than it should to deliver new features and capabilities needed to make your organization competitive. As your application an...\"We are strong believers in the DevOps movement and our staff has been doing DevOps for large enterprise environments for a number of years. The solution that we build is intended to allow DevOps teams to do security at the speed of DevOps,\" explained Justin Lundy, Founder & CTO of Evident. io, in this SYS-CON. tv interview at DevOps Summit, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. It's time to face reality: \"Americans are from Mars, Europeans are from Venus,\" and in today's increasingly connected world, understanding \"inter-planetary\" alignments and deviations is mission-critical for cloud. In her session at 15th Cloud Expo, Evelyn de Souza, Data Privacy and Compliance Strategy Leader at Cisco Systems, discussed cultural expectations of privacy based on new research across these elements The consumption economy is here and so are cloud applications and solutions that offer more than subscription and flat fee models and at the same time are available on a pure consumption model, which not only reduces IT spend but also lowers infrastructure costs, and offers ease of use and availability. In their session at 15th Cloud Expo, Ermanno Bonifazi, CEO & Founder of Solgenia, and <mark>Ian Khan</mark>, Global Strategic Positioning & Brand Manager at Solgenia, discussed this shifting dynamic with an...More and more file-based and machine generated data is being created every day causing exponential data and content growth, and creating a management nightmare for IT managers. What data centers really need to cope with this growth is a purpose-built tiered archive appliance that enables users to establish a single storage target for all of their applications - an appliance that will intelligently place and move data to and between storage tiers based on user-defined policies. In her session a.. . Recurring revenue models are great for driving new business in every market sector, but they are complex and need to be effectively managed to maximize profits. How you handle the range of options for pricing, co-terming and proration will ultimately determine the fate of your bottom line. In his session at 15th Cloud Expo, <mark>Brendan O'Brien</mark>, Co-founder at Aria Systems, session examined: How time impacts recurring revenue How to effectively handle customer plan changes The range of pricing a.. . Mobile, the cloud and data have upended traditional ways of doing business. Agile, continuous delivery and DevOps have stepped in to hasten product development, but one crucial process still hasn't caught up. Continuous content delivery is the missing limb of the success ecosystem. Currently workers spend countless, non-value add hours working in independent silos, hunting for versions, manually pushing documents between platforms, all while trying to manage the continuous update and flow of mul...Over the last few years the healthcare ecosystem has revolved around innovations in Electronic Health Record (HER) based systems. This evolution has helped us achieve much desired interoperability. Now the focus is shifting to other equally important aspects - scalability and performance. While applying cloud computing environments to the EHR systems, a special consideration needs to be given to the cloud enablement of Veterans Health Information Systems and Technology Architecture (VistA), i.e....\"At Harbinger we do products as well as services. Our services are with helping companies move their products to the cloud operating systems. Some of the challenges we have seen as far as cloud adoption goes are in the cloud security space,\" noted Shrikant Pattathil, Executive Vice President at Harbinger Systems, in this SYS-CON. tv interview at Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. After a couple of false starts, cloud-based desktop solutions are picking up steam, driven by trends such as BYOD and pervasive high-speed connectivity. In his session at 15th Cloud Expo, Seth Bostock, CEO of IndependenceIT, cut through the hype and the acronyms, and discussed the emergence of full-featured cloud workspaces that do for the desktop what cloud infrastructure did for the server. He also discussed VDI vs DaaS, implementation strategies and evaluation criteria. Things are being built upon cloud foundations to transform organizations. This CEO Power Panel at 15th Cloud Expo, moderated by Roger Strukhoff, Cloud Expo and @ ThingsExpo conference chair, addressed the big issues involving these technologies and, more important, the results they will achieve. <mark>Rodney Rogers</mark>, chairman and CEO of Virtustream; <mark>Brendan O'Brien</mark>, co-founder of Aria Systems, Bart Copeland, president and CEO of ActiveState Software; Jim Cowie, chief scientist at Dyn; Dave Wagstaff, VP...\"The year of the cloud - we have no idea when it's really happening but we think it's happening now. For those technology providers like Zentera that are helping enterprises move to the cloud - it's been fun to watch,\" noted Mike Loftus, VP Product Management and Marketing at Zentera Systems, in this SYS-CON. tv interview at Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Bring the world's best IaaS to the world's best PaaS. In their session at 15th Cloud Expo, Animesh Singh, a Senior Cloud Architect and Strategist for IBM Cloud Labs, and <mark>Jason Anderson</mark>, a Cloud Architect for IBM Cloud Labs, shared their experiences running Cloud Foundry on OpenStack. They focused on how Cloud Foundry and OpenStack complement each other, how they technically integrate using cloud provider interface (CPI), how we could automate an OpenStack setup for Cloud Foundry deployments, an...\"Application monitoring and intelligence can smooth the path in a DevOps environment. In a DevOps environment you see constant change. If you are trying to monitor things in a constantly changing environment, you're going to spend a lot of your job fixing your monitoring,\" explained Todd Rader, Solutions Architect at AppDynamics, in this SYS-CON. tv interview at DevOps Summit, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) adMarketplace captures and analyzes massive data to allow for efficient real-time bidding for traffic sources for online advertising and delivers rapid cost-per-click insights to advertisers. The next BriefingsDirect bid data trailblazer interview examines how New York-based adMarketplace, a search syndication advertising network, has met its daunting data-warehouse requirements. Learn here how...Jan. 26, 2015 09:45 AM EST Reads: 314 Gordon Haff wrote an insightful column today about \"skeuomorphic virtualizaton,\" in other words the notion of thinking of virtual servers as having the same look and feel of the physical machines lying underneath. The upshot is that virtualization ends up just being a form of partioning; users view virtualized instances as no different from a single physical server. Gordon urges the end of ske...Jan. 26, 2015 09:00 AM EST Reads: 974 Application Economy and Cloud Meet IoT, Big Data As we enter 2015, it is time to dust off the crystal ball once again for our annual predictions forecast. The parade of new technology innovations and breakthroughs is unfolding across many fronts. In some cases the convergence of technologies themselves provides the breakthrough. The cloud, Internet of Things, mobile platforms, social media, Big Data and analytics, vertical-specific marketplaces...Jan. 26, 2015 09:00 AM EST Reads: 1,495 Network Security Trends to Be Aware of for 2015 With every New Year it is time to look back at the industry events of the past 12 months, and use our expertise to predict what lies ahead, in order to be more prepared. With regards to DDoS attacks, here is a short list of what to expect in 2015. We expect to see an increase in DDoS attacks size in terms of bandwidth, but likely there will be an emphasis on packets per second metric. Bandwidth...Jan. 26, 2015 09:00 AM EST Reads: 1,030 Production-Ready Clouds with Jeff Tegethoff \"Appcore has been around since January 2008. We exclusively built clouds for service providers. We've been working with CloudStack since about that same time and our software sits on top of CloudStack,\" stated Jeff Tegethoff, CEO of Appcore, in this SYS-CON. tv interview at 15th Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Jan. 26, 2015 09:00 AM EST Reads: 2,211 Some of the network gear vendors cast a wary look at network management vendors, particularly those who do continual, automatic discovery of the network inventory and connectivity. Why? We know what's actually out there, and what's actually being used. We had one customer in the insurance industry who was due to renew their maintenance agreement with a large, well-known network gear vendor ....Jan. 26, 2015 09:00 AM EST Reads: 840 Networking in 2015 - SDN and IPv6 After reading <mark>Sean Michael</mark> Kerner's article in Enterprise Networking Planet earlier this month, I thought I'd add a few thoughts of my own to what he wrote. He discusses SDN and IPv6. Here's my take on Software Defined Networking (SDN) in 2015: Given the ongoing hype and the range of benefits its proponents extol, I expect to see a continued increase in interest and evaluation of SDN. Howev...Jan. 26, 2015 08:16 AM EST Reads: 147 The Non-Tangibles Become Tangible We recently changed over the entire phone system in our London office. After four years, the equipment failed, and it was time to update. As we did so, we also changed vendors. Why? It occurred to us that, for four years, we had put up with horrible support - we were the victims of fraud at one point, and the vendor did nothing to support us with the main telecom provider. The phone system co.. . Jan. 26, 2015 08:10 AM EST Reads: 103 Enterprise Mobile App Development Enterprises are adopting mobile technologies at an unprecedented rate. As Business News Daily recently reported, 1.3 billion workers will go mobile by 2015, and with that massive number, the need for enterprise mobile apps can only skyrocket. With that increase, many mobile app developers will be called upon to create internal mobile enterprise apps. These apps have many requirements and consider...Jan. 26, 2015 08:00 AM EST Reads: 1,069 <mark>Jason</mark> Bloomberg Blog Over Million Views <mark>Jason</mark> Bloomberg, president of agile digital transformation analyst firm Intellyx, has surpassed one million page views on the SYS-CON family of online magazines, which includes Cloud Computing Journal, Internet of Things Journal, Big Data Journal, SOA World Magazine, and several others. His home page at SYS-CON can be found at JasonBloomberg.SYS-CON. com. Bloomberg is also a regular contributor...Jan. 26, 2015 08:00 AM EST Reads: 789 Gather Process Metrics on the Windows Agent Log data provides the most granular view into what is happening across your systems, applications, and end users. Logs can show you where the issues are in real-time, and provide a historical trending view over time. Logs give you the whole picture. As we continue to expand Logentries' powerful search and metric capabilities, we are also looking for new ways to allow our Users to send us critica...Jan. 26, 2015 04:30 AM EST Reads: 1,147 When a CIO or a CTO thinks of the applications they support it is almost always in terms of a \"portfolio\" When a research company named Gleanster poll executives about agile data management they discovered an interesting trend. Companies are reporting an increase in portfolio sizes with just over 36% of all respondents from large companies listing 75 or more applications in their portfolio. Jan. 26, 2015 04:00 AM EST Reads: 1,002 Release Managers at a DevOps Divide An operations group tasked with accepting and supporting a software release. This group wants a predictable process, they view releases as incidents to be managed, and they answer to a business that wants predictability and accountability. One or more development groups tasked with creating software to be released. These groups tend to be more diverse. You might have one development group that...Jan. 26, 2015 02:00 AM EST Reads: 982 Avoid Application Outages and Stalls Last week I was able to catch up with Chris Tranter, Technical Lead at Hallmark UK. Hallmark's engineering team runs on tight deadlines, and like all popular websites, places a huge importance on customer experience. As you can imagine, their site has abnormal and inconsistent load times, especially through the holiday season. Ensuring a smooth, seamless experience without stalls, outages, or cra...Jan. 26, 2015 02:00 AM EST Reads: 1,201 Slides: <mark>Robert</mark> H. <mark>Brown</mark> \"Possibilities of IoT' Code Halos - aka\" digital fingerprints \"- are the key organizing principle to understand a) how dumb things become smart and b) how to monetize this dynamic. In his session at @ ThingsExpo, <mark>Robert Brown</mark>, AVP, Center for the Future of Work at Cognizant Technology Solutions, outlined research, analysis and recommendations from his recently published book on this phenomena on the way leading edge org...Jan. 26, 2015 02:00 AM EST Reads: 2,755 Parsing and Centralizing Elasticsearch Logs No, it's not an endless loop waiting to happen, the plan here is to use Logstash to parse Elasticsearch logs and send them to another Elasticsearch cluster or to a log analytics service like Logsene (which conveniently exposes the Elasticsearch API, so you can use it without having to run and manage your own Elasticsearch cluster). If you're looking for some ELK stack intro and you think you're i.. . Jan. 25, 2015 11:45 PM EST Reads: 1,458 Seven Ways To Build Robust Production Testing Here's a short anecdote: a QA team maintained a test environment separate from their production environment, but they had gone through great lengths to ensure it matched what was in production in every respect. It was filled with the same hardware, and all the software was identical down to the patch level. They had a strong process to ensure that any change made to one environment was mirrored in...Jan. 25, 2015 11:45 PM EST Reads: 1,436 Enterprise Initiatives Episode: Our guest on the podcast this week is <mark>John Willis</mark>, Founder and VP of Customer Enablement at SocketPlane. We discuss the effort needed to implement a grassroots DevOps initiative. Listen in to find out how to gain the essential support of leaders for your project. (Make sure you have both headphones in to hear the full audio of this episode .) Jan. 25, 2015 11:00 PM EST Reads: 1,366 IoT and Enterprise End-User Support On January 21, 2015, Microsoft unveiled the next major beta of Windows 10, the Consumer Preview, with an event at the company's home in Redmond, Washington. As it is a major release for Microsoft we expected to see several new features toward Microsoft's vision on\" Mobile First' & \"Cloud First' and toward a Universal Application Platform across all of desktop, laptop, mobile devices, gaming device...Jan. 25, 2015 11:00 PM EST Reads: 1,262 The Bill and Melinda Gates Foundation recently identified four keys areas in which to focus for the next 15 years: Health, Farming, Banking, and Education. Bill himself holds forth on a regular basis about the challenges facing many billions of people in the world, particularly in Africa, as well as the opportunities to save lives and change lives. He does not seem naïve about the enormity of t.. . Release Managers at a DevOps Divide By @ Plutora | @ DevOpsSummit [#DevOps] Process Metrics on the Windows Agent By @ TrevParsons | @ DevOpsSummit [#DevOps] Enterprise @ Splunk\" Best \"DevOps Collaboration | @ DevOpsSummit [#DevOps] Industrial\" Internet of Things' By @ EnterpriseWeb | @ ThingsExpo [#IoT] New @ Cisco Ad Campaign Focuses on Application Economy | @ CloudExpo [#Cloud] Scaling Global Databases By @ Basho CTO @ McCrory | @ CloudExpo [#BigData] GE's Industrial Internet of Things as a Service | @ ThingsExpo [#IoT] Avoid Application Outages and Stalls By @ HannahHaleyC | @ DevOpsSummit [#DevOps] \"Internet of Things Moves into the Mainstream' By @ Autodesk | @ ThingsExpo [#IoT] Announcing @ CodeFutures Named\" Sponsor \"of @ CloudExpo New York [#Cloud] Mike Kavis\" DevOps Journal' Blog Exceeds 40,000 Reads @ MadGreek65 | @ DevOpsSummit [#DevOps] Accelerate \"Real-World' Internet of Things By @ AgilePoint | @ ThingsExpo [#IoT] Top @ AWSCloud Consulting Partner Award Goes to @ CloudTP | @ CloudExpo [#Cloud #DevOps] Podcast: DevOps Gaining Support with <mark>John Willis</mark> By @ MadGreek65 | @ DevOpsSummit [#DevOps] Enterprise DevOps Governance Gates By @ Plutora | @ DevOpsSummit [#DevOps] JavaScript for Java and C + + Developers By @ YFain | @ ThingsExpo [#IoT] The State of the\" Internet of Things' By @ MadGreek65 | @ ThingsExpo [#IoT] The World of Hadoop and Beyond By @ JnanDash | @ CloudExpo [#BigData] Apache Drill's Self-Service Capabilities By @ MapR | @ CloudExpo [#BigData] Application Intelligence From @ AppDynamics | @ DevOpsSummit [#DevOps] Timely, Optimal and Efficient with @ Creative_Busine | @ CloudExpo [#Cloud] Internet of Things Connectivity By @ Kaazing | @ ThingsExpo [#IoT] Easy Internet of Things Integration By @ AgilePoint | @ ThingsExpo [#IoT] Kafka Poll: Producer and Consumer Client By @ Sematext | @ DevOpsSummit [#DevOps] Do You Need PaaS for Cloud Microservices? By @ IoT2040 | @ DevOpsSummit [#DevOps] PagerDuty + Desk.com App Hub By @ PagerDuty | @ DevOpsSummit [#DevOps] DevOps Summit Accepting Keynote Proposals | @ DevOpsSummit [#DevOps] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Transitioning to a DevOps Model By @ DShack | @ DevOpsSummit [#DevOps] How to Ditch Scheduled Maintenance By @ PagerDuty | @ DevOpsSummit [#DevOps] Internet of Things New York Keynote Proposals | @ ThingsExpo [#IoT #M 2M] \"Docker Is Not Enough' By @ ActiveState | @ DevOpsSummit [#DevOps] ChatOps: Let's Talk Plugins By @ PagerDuty | @ DevOpsSummit [#DevOps] Software-Defined Storage & Hybrid Cloud By @ CloudianStorage | @ CloudExpo [#Cloud] SDN and Gartner's Hype Cycle By @ MartenT1999 | @ CloudExpo [#SDN] Internet of Things\" High Tech to \"I\" Tech \"By @ AndrewBolwell | @ ThingsExpo [#IoT] Is a\" Federated' European Cloud More Democratic? By @ ABridgwater | @ CloudExpo [#Cloud] Cloud Is All About Workload By @ ABridgwater | @ CloudExpo [#Cloud] TV Ad To Feature \"Internet of Things' and @ ThingsExpo [#IoT #CloudExpo] @ ThingsExpo | #WebRTC, Internet of Things and #API Gateways (#IoT)\" Decisions on Streaming Data' By @ Databricks | @ CloudExpo [#BigData] Gathering Process Metrics on the Windows Agent By @ Logentries | @ DevOpsSummit [#DevOps] The Management Gap with Business Cloud Apps By @ Exoprise | @ CloudExpo [#Cloud] The Technology Content of the SOTU By @ BobGourley | @ CloudExpo [#Cloud] Announcing @ Gridstore to Exhibit at @ CloudExpo New York [#Cloud] Telecom, WebRTC and the \"Internet of Things' By @ RingPlusMobile | @ ThingsExpo [#IoT #WebRTC]\" Internet of Things' and WebRTC with @ MatrixDotOrg | @ ThingExpo [#IoT #WebRTC] What Manufacturing Teaches Us About #DevOps By @ GHaff | @ DevOpsSummit Announcing @ PagerDuty Session at @ DevOpsSummit Silicon Valley [#DevOps] DevOps Is Even More Important Than You Think | @ DevOpsSummit [#DevOps] Beacon, Oh Beacon, Wherefore Art Thou Beacon? By @ ScottJenson | @ ThingsExpo [#IoT] Cloud Computing Security Issues and Challenges By @ GiladPN | @ CloudExpo [#Cloud] Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $900 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires January 31, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in New York [June 9-11, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2015012615_00025245_W", "names": {"Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"], "Ian Khan": ["Q23664007", "Q5981972"]}}]