[{"date": "2015-01-26", "url": "http://www.sys-con.com/node/3285442", "content": "News Feed Item WealthEngine Changes Landscape of Data-Driven Marketing with New Prospecting Product BETHESDA, Md., Jan. 26, 2015 / PRNewswire /--WealthEngine, the leading provider of wealth intelligence, prospect research and marketing services for nonprofits, healthcare, education, luxury goods and financial services, announces the release of its new prospecting solution, WE Prospect. Marketers, agencies and fundraisers can now easily identify ideal targets with WE Prospect by creating ultra-segmented audiences using wealth, demographic, lifestyle and personal attributes across a database of more than 300 million people in the U.S., delivered with the speed and accuracy of an Internet search engine. In the era of big data, WealthEngine has shifted the paradigm for prospecting for both marketers and fundraisers. Rather than starting with a list of names that marketers must cull for the perfect customer, WE Prospect allows marketers to begin with their model of an ideal customer, then find the consumers that fit those attributes. This approach empowers WealthEngine customers to take a more accurate and focused methodology to prospecting, while consumers will now experience more personalized, meaningful communication from the brands that matter most to them at the right moment in time. The result is a win-win for marketers and consumers, and helps marketers achieve a higher ROI while delivering higher satisfaction to end customers. \"The adoption of data-driven marketing is widespread. And WE Prospect is what differentiates WealthEngine from the rest of the market,\" said WealthEngine chief marketing officer Mike Lees. \"WE Prospect uncovers who has the wealth and affinity to buy or donate and determines if now is the right time to engage. No other company can deliver these capabilities with the clarity and precision that WE Prospect achieves .\" WE Prospect provides sales professionals, marketers and fundraisers with highly relevant, actionable and cost-effective options for their prospecting needs, including: Salesforce users can leverage an easy way to find, understand and contact affluent prospects - directly within their existing Salesforce database. WE Prospect for FindWealth8: WealthEngine subscribers can access real-time list curation and development as well as engage across channels with actionable contact info and optional online profile mapping - all within WealthEngine's online platform. WE Prospect Standalone: Customers can collaborate with WealthEngine to develop custom, highly-segmented audiences of high-potential prospects. \"As an industry leader in audience and wealth intelligence, WealthEngine is truly driving prospecting out of the Dark Ages,\" said <mark>John</mark> Funge, senior vice president of product management at WealthEngine. \"Through its modern, intuitive interface, WE Prospect provides users with a simple way to access unparalleled predictive insights into a prospect's financial status and persona. Now marketers and fundraisers know more before they engage, thus driving efficiency, effectiveness and actionability .\" For more information on WE Prospect, join us for our upcoming webinar, \"Introducing WE Prospect - Perfect Prospecting Made Simple\" on February 3, 2015. See how it works, learn its capabilities, and join an exclusive Q & A with <mark>John</mark> Funge. By attending the webinar, you will also have an exclusive opportunity to register for a free trial--allowing you to personally test drive WE Prospect & see how easy it is to target your best prospects. About WealthEngine WealthEngine ™, Inc. is a leading provider of audience intelligence solutions to customers targeting HNW clients in the healthcare, education, financial services and luxury markets. The company's unique data-driven approach to analytics, prospecting, and marketing has transformed the sales, marketing and fundraising processes of more than four thousand clients. Headquartered in [email protected] To view the original version on PR Newswire, visit: http: //www.prnewswire.com/news-releases/wealthengine-changes-landscape-of-data-driven-marketing-with-new-prospecting-product-300025006.html Published January 26, 2015 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. \"For over 25 years we have been working with a lot of enterprise customers and we have seen how companies create applications. And now that we have moved to cloud computing, mobile, social and the Internet of Things, we see that the market needs a new way of creating applications,\" stated Jesse Shiah, CEO, President and Co-Founder of AgilePoint Inc., in this SYS-CON. tv interview at 15th Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. You use an agile process; your goal is to make your organization more agile. But what about your data infrastructure? The truth is, today's databases are anything but agile - they are effectively static repositories that are cumbersome to work with, difficult to change, and cannot keep pace with application demands. Performance suffers as a result, and it takes far longer than it should to deliver new features and capabilities needed to make your organization competitive. As your application an...\"We are strong believers in the DevOps movement and our staff has been doing DevOps for large enterprise environments for a number of years. The solution that we build is intended to allow DevOps teams to do security at the speed of DevOps,\" explained Justin Lundy, Founder & CTO of Evident. io, in this SYS-CON. tv interview at DevOps Summit, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. It's time to face reality: \"Americans are from Mars, Europeans are from Venus,\" and in today's increasingly connected world, understanding \"inter-planetary\" alignments and deviations is mission-critical for cloud. In her session at 15th Cloud Expo, Evelyn de Souza, Data Privacy and Compliance Strategy Leader at Cisco Systems, discussed cultural expectations of privacy based on new research across these elements The consumption economy is here and so are cloud applications and solutions that offer more than subscription and flat fee models and at the same time are available on a pure consumption model, which not only reduces IT spend but also lowers infrastructure costs, and offers ease of use and availability. In their session at 15th Cloud Expo, Ermanno Bonifazi, CEO & Founder of Solgenia, and <mark>Ian Khan</mark>, Global Strategic Positioning & Brand Manager at Solgenia, discussed this shifting dynamic with an...More and more file-based and machine generated data is being created every day causing exponential data and content growth, and creating a management nightmare for IT managers. What data centers really need to cope with this growth is a purpose-built tiered archive appliance that enables users to establish a single storage target for all of their applications - an appliance that will intelligently place and move data to and between storage tiers based on user-defined policies. In her session a.. . Recurring revenue models are great for driving new business in every market sector, but they are complex and need to be effectively managed to maximize profits. How you handle the range of options for pricing, co-terming and proration will ultimately determine the fate of your bottom line. In his session at 15th Cloud Expo, <mark>Brendan O'Brien</mark>, Co-founder at Aria Systems, session examined: How time impacts recurring revenue How to effectively handle customer plan changes The range of pricing a.. . Mobile, the cloud and data have upended traditional ways of doing business. Agile, continuous delivery and DevOps have stepped in to hasten product development, but one crucial process still hasn't caught up. Continuous content delivery is the missing limb of the success ecosystem. Currently workers spend countless, non-value add hours working in independent silos, hunting for versions, manually pushing documents between platforms, all while trying to manage the continuous update and flow of mul...Over the last few years the healthcare ecosystem has revolved around innovations in Electronic Health Record (HER) based systems. This evolution has helped us achieve much desired interoperability. Now the focus is shifting to other equally important aspects - scalability and performance. While applying cloud computing environments to the EHR systems, a special consideration needs to be given to the cloud enablement of Veterans Health Information Systems and Technology Architecture (VistA), i.e....\"At Harbinger we do products as well as services. Our services are with helping companies move their products to the cloud operating systems. Some of the challenges we have seen as far as cloud adoption goes are in the cloud security space,\" noted Shrikant Pattathil, Executive Vice President at Harbinger Systems, in this SYS-CON. tv interview at Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. After a couple of false starts, cloud-based desktop solutions are picking up steam, driven by trends such as BYOD and pervasive high-speed connectivity. In his session at 15th Cloud Expo, Seth Bostock, CEO of IndependenceIT, cut through the hype and the acronyms, and discussed the emergence of full-featured cloud workspaces that do for the desktop what cloud infrastructure did for the server. He also discussed VDI vs DaaS, implementation strategies and evaluation criteria. Things are being built upon cloud foundations to transform organizations. This CEO Power Panel at 15th Cloud Expo, moderated by Roger Strukhoff, Cloud Expo and @ ThingsExpo conference chair, addressed the big issues involving these technologies and, more important, the results they will achieve. <mark>Rodney Rogers</mark>, chairman and CEO of Virtustream; <mark>Brendan O'Brien</mark>, co-founder of Aria Systems, Bart Copeland, president and CEO of ActiveState Software; Jim Cowie, chief scientist at Dyn; Dave Wagstaff, VP...\"The year of the cloud - we have no idea when it's really happening but we think it's happening now. For those technology providers like Zentera that are helping enterprises move to the cloud - it's been fun to watch,\" noted Mike Loftus, VP Product Management and Marketing at Zentera Systems, in this SYS-CON. tv interview at Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Bring the world's best IaaS to the world's best PaaS. In their session at 15th Cloud Expo, Animesh Singh, a Senior Cloud Architect and Strategist for IBM Cloud Labs, and <mark>Jason Anderson</mark>, a Cloud Architect for IBM Cloud Labs, shared their experiences running Cloud Foundry on OpenStack. They focused on how Cloud Foundry and OpenStack complement each other, how they technically integrate using cloud provider interface (CPI), how we could automate an OpenStack setup for Cloud Foundry deployments, an...\"Application monitoring and intelligence can smooth the path in a DevOps environment. In a DevOps environment you see constant change. If you are trying to monitor things in a constantly changing environment, you're going to spend a lot of your job fixing your monitoring,\" explained Todd Rader, Solutions Architect at AppDynamics, in this SYS-CON. tv interview at DevOps Summit, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) adMarketplace captures and analyzes massive data to allow for efficient real-time bidding for traffic sources for online advertising and delivers rapid cost-per-click insights to advertisers. The next BriefingsDirect bid data trailblazer interview examines how New York-based adMarketplace, a search syndication advertising network, has met its daunting data-warehouse requirements. Learn here how...Jan. 26, 2015 09:45 AM EST Reads: 314 Gordon Haff wrote an insightful column today about \"skeuomorphic virtualizaton,\" in other words the notion of thinking of virtual servers as having the same look and feel of the physical machines lying underneath. The upshot is that virtualization ends up just being a form of partioning; users view virtualized instances as no different from a single physical server. Gordon urges the end of ske...Jan. 26, 2015 09:00 AM EST Reads: 974 Application Economy and Cloud Meet IoT, Big Data As we enter 2015, it is time to dust off the crystal ball once again for our annual predictions forecast. The parade of new technology innovations and breakthroughs is unfolding across many fronts. In some cases the convergence of technologies themselves provides the breakthrough. The cloud, Internet of Things, mobile platforms, social media, Big Data and analytics, vertical-specific marketplaces...Jan. 26, 2015 09:00 AM EST Reads: 1,495 Network Security Trends to Be Aware of for 2015 With every New Year it is time to look back at the industry events of the past 12 months, and use our expertise to predict what lies ahead, in order to be more prepared. With regards to DDoS attacks, here is a short list of what to expect in 2015. We expect to see an increase in DDoS attacks size in terms of bandwidth, but likely there will be an emphasis on packets per second metric. Bandwidth...Jan. 26, 2015 09:00 AM EST Reads: 1,030 Production-Ready Clouds with Jeff Tegethoff \"Appcore has been around since January 2008. We exclusively built clouds for service providers. We've been working with CloudStack since about that same time and our software sits on top of CloudStack,\" stated Jeff Tegethoff, CEO of Appcore, in this SYS-CON. tv interview at 15th Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Jan. 26, 2015 09:00 AM EST Reads: 2,211 Some of the network gear vendors cast a wary look at network management vendors, particularly those who do continual, automatic discovery of the network inventory and connectivity. Why? We know what's actually out there, and what's actually being used. We had one customer in the insurance industry who was due to renew their maintenance agreement with a large, well-known network gear vendor ....Jan. 26, 2015 09:00 AM EST Reads: 840 Networking in 2015 - SDN and IPv6 After reading <mark>Sean Michael</mark> Kerner's article in Enterprise Networking Planet earlier this month, I thought I'd add a few thoughts of my own to what he wrote. He discusses SDN and IPv6. Here's my take on Software Defined Networking (SDN) in 2015: Given the ongoing hype and the range of benefits its proponents extol, I expect to see a continued increase in interest and evaluation of SDN. Howev...Jan. 26, 2015 08:16 AM EST Reads: 147 The Non-Tangibles Become Tangible We recently changed over the entire phone system in our London office. After four years, the equipment failed, and it was time to update. As we did so, we also changed vendors. Why? It occurred to us that, for four years, we had put up with horrible support - we were the victims of fraud at one point, and the vendor did nothing to support us with the main telecom provider. The phone system co.. . Jan. 26, 2015 08:10 AM EST Reads: 103 Enterprise Mobile App Development Enterprises are adopting mobile technologies at an unprecedented rate. As Business News Daily recently reported, 1.3 billion workers will go mobile by 2015, and with that massive number, the need for enterprise mobile apps can only skyrocket. With that increase, many mobile app developers will be called upon to create internal mobile enterprise apps. These apps have many requirements and consider...Jan. 26, 2015 08:00 AM EST Reads: 1,069 <mark>Jason</mark> Bloomberg Blog Over Million Views <mark>Jason</mark> Bloomberg, president of agile digital transformation analyst firm Intellyx, has surpassed one million page views on the SYS-CON family of online magazines, which includes Cloud Computing Journal, Internet of Things Journal, Big Data Journal, SOA World Magazine, and several others. His home page at SYS-CON can be found at JasonBloomberg.SYS-CON. com. Bloomberg is also a regular contributor...Jan. 26, 2015 08:00 AM EST Reads: 789 Gather Process Metrics on the Windows Agent Log data provides the most granular view into what is happening across your systems, applications, and end users. Logs can show you where the issues are in real-time, and provide a historical trending view over time. Logs give you the whole picture. As we continue to expand Logentries' powerful search and metric capabilities, we are also looking for new ways to allow our Users to send us critica...Jan. 26, 2015 04:30 AM EST Reads: 1,147 When a CIO or a CTO thinks of the applications they support it is almost always in terms of a \"portfolio\" When a research company named Gleanster poll executives about agile data management they discovered an interesting trend. Companies are reporting an increase in portfolio sizes with just over 36% of all respondents from large companies listing 75 or more applications in their portfolio. Jan. 26, 2015 04:00 AM EST Reads: 1,002 Release Managers at a DevOps Divide An operations group tasked with accepting and supporting a software release. This group wants a predictable process, they view releases as incidents to be managed, and they answer to a business that wants predictability and accountability. One or more development groups tasked with creating software to be released. These groups tend to be more diverse. You might have one development group that...Jan. 26, 2015 02:00 AM EST Reads: 982 Avoid Application Outages and Stalls Last week I was able to catch up with Chris Tranter, Technical Lead at Hallmark UK. Hallmark's engineering team runs on tight deadlines, and like all popular websites, places a huge importance on customer experience. As you can imagine, their site has abnormal and inconsistent load times, especially through the holiday season. Ensuring a smooth, seamless experience without stalls, outages, or cra...Jan. 26, 2015 02:00 AM EST Reads: 1,201 Slides: <mark>Robert</mark> H. <mark>Brown</mark> \"Possibilities of IoT' Code Halos - aka\" digital fingerprints \"- are the key organizing principle to understand a) how dumb things become smart and b) how to monetize this dynamic. In his session at @ ThingsExpo, <mark>Robert Brown</mark>, AVP, Center for the Future of Work at Cognizant Technology Solutions, outlined research, analysis and recommendations from his recently published book on this phenomena on the way leading edge org...Jan. 26, 2015 02:00 AM EST Reads: 2,755 Parsing and Centralizing Elasticsearch Logs No, it's not an endless loop waiting to happen, the plan here is to use Logstash to parse Elasticsearch logs and send them to another Elasticsearch cluster or to a log analytics service like Logsene (which conveniently exposes the Elasticsearch API, so you can use it without having to run and manage your own Elasticsearch cluster). If you're looking for some ELK stack intro and you think you're i.. . Jan. 25, 2015 11:45 PM EST Reads: 1,458 Seven Ways To Build Robust Production Testing Here's a short anecdote: a QA team maintained a test environment separate from their production environment, but they had gone through great lengths to ensure it matched what was in production in every respect. It was filled with the same hardware, and all the software was identical down to the patch level. They had a strong process to ensure that any change made to one environment was mirrored in...Jan. 25, 2015 11:45 PM EST Reads: 1,436 Enterprise Initiatives Episode: Our guest on the podcast this week is <mark>John Willis</mark>, Founder and VP of Customer Enablement at SocketPlane. We discuss the effort needed to implement a grassroots DevOps initiative. Listen in to find out how to gain the essential support of leaders for your project. (Make sure you have both headphones in to hear the full audio of this episode .) Jan. 25, 2015 11:00 PM EST Reads: 1,366 IoT and Enterprise End-User Support On January 21, 2015, Microsoft unveiled the next major beta of Windows 10, the Consumer Preview, with an event at the company's home in Redmond, Washington. As it is a major release for Microsoft we expected to see several new features toward Microsoft's vision on\" Mobile First' & \"Cloud First' and toward a Universal Application Platform across all of desktop, laptop, mobile devices, gaming device...Jan. 25, 2015 11:00 PM EST Reads: 1,262 The Bill and Melinda Gates Foundation recently identified four keys areas in which to focus for the next 15 years: Health, Farming, Banking, and Education. Bill himself holds forth on a regular basis about the challenges facing many billions of people in the world, particularly in Africa, as well as the opportunities to save lives and change lives. He does not seem naïve about the enormity of t.. . Release Managers at a DevOps Divide By @ Plutora | @ DevOpsSummit [#DevOps] Process Metrics on the Windows Agent By @ TrevParsons | @ DevOpsSummit [#DevOps] Enterprise @ Splunk\" Best \"DevOps Collaboration | @ DevOpsSummit [#DevOps] Industrial\" Internet of Things' By @ EnterpriseWeb | @ ThingsExpo [#IoT] New @ Cisco Ad Campaign Focuses on Application Economy | @ CloudExpo [#Cloud] Scaling Global Databases By @ Basho CTO @ McCrory | @ CloudExpo [#BigData] GE's Industrial Internet of Things as a Service | @ ThingsExpo [#IoT] Avoid Application Outages and Stalls By @ HannahHaleyC | @ DevOpsSummit [#DevOps] \"Internet of Things Moves into the Mainstream' By @ Autodesk | @ ThingsExpo [#IoT] Announcing @ CodeFutures Named\" Sponsor \"of @ CloudExpo New York [#Cloud] Mike Kavis\" DevOps Journal' Blog Exceeds 40,000 Reads @ MadGreek65 | @ DevOpsSummit [#DevOps] Accelerate \"Real-World' Internet of Things By @ AgilePoint | @ ThingsExpo [#IoT] Top @ AWSCloud Consulting Partner Award Goes to @ CloudTP | @ CloudExpo [#Cloud #DevOps] Podcast: DevOps Gaining Support with <mark>John Willis</mark> By @ MadGreek65 | @ DevOpsSummit [#DevOps] Enterprise DevOps Governance Gates By @ Plutora | @ DevOpsSummit [#DevOps] JavaScript for Java and C + + Developers By @ YFain | @ ThingsExpo [#IoT] The State of the\" Internet of Things' By @ MadGreek65 | @ ThingsExpo [#IoT] The World of Hadoop and Beyond By @ JnanDash | @ CloudExpo [#BigData] Apache Drill's Self-Service Capabilities By @ MapR | @ CloudExpo [#BigData] Application Intelligence From @ AppDynamics | @ DevOpsSummit [#DevOps] Timely, Optimal and Efficient with @ Creative_Busine | @ CloudExpo [#Cloud] Internet of Things Connectivity By @ Kaazing | @ ThingsExpo [#IoT] Easy Internet of Things Integration By @ AgilePoint | @ ThingsExpo [#IoT] Kafka Poll: Producer and Consumer Client By @ Sematext | @ DevOpsSummit [#DevOps] Do You Need PaaS for Cloud Microservices? By @ IoT2040 | @ DevOpsSummit [#DevOps] PagerDuty + Desk.com App Hub By @ PagerDuty | @ DevOpsSummit [#DevOps] DevOps Summit Accepting Keynote Proposals | @ DevOpsSummit [#DevOps] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Transitioning to a DevOps Model By @ DShack | @ DevOpsSummit [#DevOps] How to Ditch Scheduled Maintenance By @ PagerDuty | @ DevOpsSummit [#DevOps] Internet of Things New York Keynote Proposals | @ ThingsExpo [#IoT #M 2M] \"Docker Is Not Enough' By @ ActiveState | @ DevOpsSummit [#DevOps] ChatOps: Let's Talk Plugins By @ PagerDuty | @ DevOpsSummit [#DevOps] Software-Defined Storage & Hybrid Cloud By @ CloudianStorage | @ CloudExpo [#Cloud] SDN and Gartner's Hype Cycle By @ MartenT1999 | @ CloudExpo [#SDN] Internet of Things\" High Tech to \"I\" Tech \"By @ AndrewBolwell | @ ThingsExpo [#IoT] Is a\" Federated' European Cloud More Democratic? By @ ABridgwater | @ CloudExpo [#Cloud] Cloud Is All About Workload By @ ABridgwater | @ CloudExpo [#Cloud] TV Ad To Feature \"Internet of Things' and @ ThingsExpo [#IoT #CloudExpo] @ ThingsExpo | #WebRTC, Internet of Things and #API Gateways (#IoT)\" Decisions on Streaming Data' By @ Databricks | @ CloudExpo [#BigData] Gathering Process Metrics on the Windows Agent By @ Logentries | @ DevOpsSummit [#DevOps] The Management Gap with Business Cloud Apps By @ Exoprise | @ CloudExpo [#Cloud] The Technology Content of the SOTU By @ BobGourley | @ CloudExpo [#Cloud] Announcing @ Gridstore to Exhibit at @ CloudExpo New York [#Cloud] Telecom, WebRTC and the \"Internet of Things' By @ RingPlusMobile | @ ThingsExpo [#IoT #WebRTC]\" Internet of Things' and WebRTC with @ MatrixDotOrg | @ ThingExpo [#IoT #WebRTC] What Manufacturing Teaches Us About #DevOps By @ GHaff | @ DevOpsSummit Announcing @ PagerDuty Session at @ DevOpsSummit Silicon Valley [#DevOps] DevOps Is Even More Important Than You Think | @ DevOpsSummit [#DevOps] Beacon, Oh Beacon, Wherefore Art Thou Beacon? By @ ScottJenson | @ ThingsExpo [#IoT] Cloud Computing Security Issues and Challenges By @ GiladPN | @ CloudExpo [#Cloud] Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $900 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires January 31, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in New York [June 9-11, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2015012615_00025245_W", "names": {"Jason Anderson": ["Q30123038", "Q3162882", "Q55369961", "Q6161926", "Q6161927", "Q6161930"], "John Willis": ["Q25189216", "Q42313318", "Q48700479", "Q48808723", "Q6264417"], "Robert Brown": ["Q12053713", "Q16144772", "Q16200950", "Q18027424", "Q18358801", "Q19874190", "Q19959074", "Q21165598", "Q21452914", "Q2156625", "Q21664222", "Q24418955", "Q25189687", "Q28792824", "Q42969277", "Q43911980", "Q47505833", "Q51585297", "Q55937635", "Q56425064", "Q57412643", "Q6106949", "Q7342398", "Q7342400", "Q7342401", "Q7342410", "Q888471"], "Rodney Rogers": ["Q3909415", "Q634812"], "Sean Michael": ["Q2262098", "Q7441255"]}}, {"date": "2015-01-26", "url": "http://feeds.latimes.com/~r/latimes/entertainment/news/music/~3/6K_85HbiN-8/la-et-mn-sundance-saoirse-ronan-20150125-column.html", "content": "A gifted cinematic presence since her Oscar-nominated \"Atonement\" debut at age 12, Saoirse Ronan has played everything from a young assassin raised among wolves in \"Hanna\" to a resident of \"Grand Budapest Hotel's\" imaginary Zubrowka. But \"Brooklyn,\" her new film debuting Monday in the Premiers section at Sundance, was something different. \"Playing someone normal was the biggest challenge,\" the now 20-year-old actress says. \"I wasn't used to it .\" An image from the documentary \"Meru,\" about three Americans climbing a perilous face of Mt. Meru in Nepal. It's directed by Jimmy Chin, one of the climbers, and E. Chai Vasarhelyi. \"3 1/2 Minutes,\" in the U.S. documentary section, is directed by Marc Silver. It examines how and why an unarmed black teenager in Florida was killed for playing rap music too loud. \"The Wolfpack,\" in the U.S. documentary competition, is directed by Crystal Moselle. It focuses on six movie-crazed brothers who spend their childhood making meticulous re-creations of films like \"Reservoir Dogs .\" U.S. documentary competitor \"Welcome to Leith,\" directed by Michael Beach Nichols and Christopher K. Walker. It looks at what happens when a hard-core white supremacist attempts to take over a tiny North Dakota town. \"The Summer of Sangaile,\" directed by Alante Kavaite, is in the world dramatic competition. A haunting, hypnotically shot story out of Lithuanian about a young woman in love with flying. Sundance Film Festival 2015 | Kenneth Turan's 25 films of note Los Angeles film critic Kenneth Turan's 25 Sundance films of note. Sundance Film Festival 2015 | Kenneth Turan's 25 films of note Los Angeles film critic Kenneth Turan's 25 Sundance films of note. Ask her how old she was when she began acting and she'll reply, with amusement and style, \"I was in the womb, Kenny. I was zero. It started when my mum and dad had a glimmer in their eye .\" Eilis is \"Brooklyn's\" protagonist, a young woman who emigrates from Ireland to that celebrated New York borough in 1952 and ends up contending with homesickness, culture shock and a variety of romantic involvements. Impeccably directed by <mark>John Crowley</mark> and elegantly adapted by <mark>Nick Hornby</mark> from a novel by Colm Tóibín, \"Brooklyn\" is classic filmmaking beautifully done, illustrating the power of restraint in dealing with emotional material. And as Ronan's first time \"telling an Irish story in an Irish film,\" it has special meaning. \"I get very emotional when I talk about it; I hope I'm not going to start crying,\" the actress says. \"I never had a film affect me like that. It was very much a passion project for all the people involved .\" It's not only that \"for generation after generation, the relationship has been so close between Ireland and the United States\" but there's a personal connection as well. \"My mom and dad made that journey,\" says Ronan, who was born in the New York area and moved back to Ireland with her parents when she was 3. \"The town we shot in in Ireland was close to where I grew up, where I spent my childhood. Every second scene knocked me over by how it affected me .\" So for the actress, another of the challenges of \"Brooklyn\" was \"trying to find a balance, giving the story color, but at the same time holding back, keeping control. It was hard. I was very aware I didn't want to do too many crying scenes, I didn't want to do too much blubbering. That gets very boring, unless you really need it .\" Helping her greatly with her performance was <mark>Crowley</mark>, a director with extensive experience in theater whose films include \"Boy A\" and \"Closed Circuit .\" \"<mark>John</mark> is a theater director at heart, it's all about community, about communicating with your actors,\" Ronan says. \"He was involved in everything, but when it came to the acting, he was so tied into every single thing you were doing, performance was absolutely everything to him .\" He gave you notes after a take, he constantly moved you around. In the time it took to do eight takes, you discovered more and more about what you were doing. He revealed to me so many different elements in my character I hadn't really considered before. He made me more present because of the way he works. \"Because Ronan is roughly the same age as Eilis, and in fact has just gotten a place of her own in London, elements of Eilis' situation ring especially true .\" Really, this film is about choice, about when you've gone through enough life experience to make a choice for yourself, \"Ronan says .\" Eilis is finally at the stage in her life where she knows not what she needs to do but what she wants. That's a really empowering thing. \"Part of the choice Eilis has to make involves two suitors, played by Domhnall Gleeson and Emory Cohen. The men do not meet in the film, but the cast did have an introductory dinner together, and Ronan jokes that\" once we got past the fact that the film wasn't real, they were able to chill out and have fun. \"Fun was a theme of Ronan's early years in New York, where her father was a working actor .\" My parents were both very expressive people, and exposure to American humor broadened their world, \"she says. Deus Ex Machina makes high-end motorcycles and loses money on each one Obama's renewed push to close Guantanamo prison is seen as promising Deus Ex Machina makes high-end motorcycles and loses money on each one", "articleID": "2015012616_00061459_W", "names": {"John Crowley": ["Q1586867", "Q55987054", "Q6227781", "Q736447"], "Nick Hornby": ["Q313007", "Q7027324"]}}, {"date": "2015-01-27", "url": "http://edinburghnews.scotsman.com/sport/golf/sgu-chairman-we-must-end-gender-divide-1-3671052", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Student dies in window fall horror after party Carer \"tied toddler to chair and threatened him' Boy, 11, fights for life after being hit by car Hearts trio set for Tynecastle exit Double death tragedy for girlfriend of fall student Tram fall cyclists to sue\" negligent' council Hibs hope to be debt free in ten years Jason Cummings just like <mark>Michael Owen</mark> Lothian Buses row: Huge salaries to be axed Another step towards Scottish golf becoming a gender united body will take place in Edinburgh next weekend. A fresh proposal to amalgamate the Scottish Golf Union and Scottish Ladies Golfing Association will be put to a vote at the latter's annual general meeting in the Capital on Saturday week. If successful - and the SLGA membership agreed to it last time around - then the spotlight will be back on the men. In 2012, the SGU failed to gain sufficient support for the proposal and since then a lot of work has gone in to try and rebuild bridges. As the attempt to make it second-time lucky gathers pace, Capital clubs are being urged to have their say though voting in an independent poll. Now open and running until February 27, it is being conducted after agreement between the SGU Board and Area Associations, of which the Lothians is the largest. \"We encourage and advise all affiliated SGU clubs to vote in the independent poll,\" said SGU chairman <mark>Tom Craig</mark>. \"Currently, this is the most significant issue facing Scottish Golf. Amalgamation is fundamentally important to building a modern, democratic, inclusive governing body for Scottish amateur golf .\" It is vital we pass on a fit for purpose organisation for the next generation to take the game forward. \"It creates the opportunity to build an effective partnership among golfers, Clubs, Areas, Counties, Board and staff for the greater good of Scottish Golf .\" A single body will help attract more women into golf and remove some of the stigma of a male-dominated game. \"Meanwhile, world No. 2 Henrik Stenson has still to decide if he'll play in this summer's Aberdeen Asset Management Scottish Open at Gullane. The Swede used the event two years ago as the springboard to his rise back up the world rankings, finishing second to Phil Mickelson in The Open at Muirfield the following week before going on to top the money-list on both sides of the Atlantic. But Stenson didn't play in last year's Scottish Open at Royal Aberdeen and has yet to make up his mind about heading to East Lothian in July. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. Edinburgh Evening News provides news, events and sport features from the Edinburgh area. For the best up to date information relating to Edinburgh and the surrounding areas visit us at Edinburgh Evening News regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Digital Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2015012712_00019849_W", "names": {"Michael Owen": ["Q1061908", "Q128829", "Q17198421", "Q6833276"], "Tom Craig": ["Q16214797", "Q21934234", "Q30678500"]}}, {"date": "2015-01-28", "url": "http://www.multihousingnews.com/cities/indianapolis/teagan-development-to-redevelop-historic-industrial-complex-in-indianapolis-2/1004114107.html", "content": "Jan. 28, 2015 Teagan Development to Redevelop Historic Industrial Complex in Indianapolis A vacant portion of a massive industrial property at 1125 Brookside Avenue in downtown Indianapolis could soon be converted into a mixed-use structure with retail, restaurant and small manufacturing space. Indianapolis Business Journal, Teagan Development, Inc. is planning to buy the 539,000-square-foot Circle City Industrial Complex from the National Bank of Indianapolis, which took control of the property about four years ago from previous owner E & E Realty LLC. The complex dates back to the early 1920s, when it served as a factory for the Schwitzer Corp.. Located in the Windsor Park neighborhood, in an area which serves as the entrance to the Cottage Home neighborhood, the building now hosts a mix of about 50 tenants, including not-for-profit RecycleForce. At its southern end, the property also includes a vacant portion of about 120,000 square feet that holds the highest redevelopment potential. Plans call for approximately 40,000 square feet of retail and restaurant space, 30,000 square feet of incubator space to be used for small manufacturing, while the remaining 50,000 square feet would be demolished to make way for the construction of a parking facility and an access drive to link Brookside and Massachusetts avenues. \"This building and this location have the bones for what I call the next overnight sensation,\" <mark>Larry Jones</mark>, the company president, told the newspaper. \"It's an area where the residents of Cottage Home have put 25-plus years into turning that neighborhood around .\" The area is currently going through a revitalization phase, thanks to a number of residential developments, including Stenz Corp.'s Hillwood Investment Moving Ahead with $165M Legacy Park; Tennessee Receives $28M in CDBG", "articleID": "2015012907_00026041_W", "names": {"Larry Jones": ["Q16227670", "Q16730409", "Q6490591", "Q6490592", "Q742049"]}}]