[{"articleID": "2018112907_00200051_W", "names": {"Jay Powell": ["Q20640929", "Q6167053"]}, "date": "2018-11-29", "url": "http://www.exchangerates.org.uk/news/23740/exchange-rates-update-today-british-pound-crash-warnings-euro-soft-dollar-mixed-to-soft-vs-g10-currencies.html", "content": "Exchange Rates Update Today: British Pound Brexit Predictions, Euro Soft, Dollar Mixed To Soft Vs G10...Exchange Rates Update Today: British Pound Brexit Predictions, Euro Soft, Dollar Mixed To Soft Vs G10 Currencies Stumbleupon The British Pound (GBP) started the day poorly on Wednesday but later got a boost as the US Dollar (USD) weakened and brightened the outlook for stock markets as the Dow Jones roared higher by more than 600 points. The Bank of England released their Financial Stability report for Brexit, indicating their belief Sterling could fall as much as 25% <more from the initial 9% of losses which have been seen since the May 2016 Inflation Report. Pound Sterling Special Forecast: Bank of England predicts cumulative GBP Brexit losses of 34% It was a monster day for US stock markets as one of the most important people in global finance, whether it be Equity markets or Forex markets, Governor <mark>Jay Powell</mark> of the US Federal Reserve indicated that the period of FOMC tightening did possibly have an end in sight. The statement that got the reaction was as follows, \"Interest rates are still low by historical standards, and they remain just below the broad range of estimates of the level that would be neutral for the economy ‑ ‑ that is, neither speeding up nor slowing down growth,\" This is what markets have been waiting for, and whether due to the Presidential pressure or some indications of waning inflation it appears that <mark>Powell</mark> is now taking his foot off the accelerator. The British Pound to Dollar exchange rate (GBP/USD) which was falling initially on the day was buoyed by the weakness in the Dollar Index (DXY), and thus EUR/GBP was able to finish the day flat. The initial weakness in Sterling was largely due to a devastating report from the Bank of England. Governor Carney's team which are officially impartial but have often been accused of being overtly pro-remain for their often dark take on the state of the UK after Brexit. They have also been criticised by Remain at times so it has been a rough go for the UK's Central bank, however, financial traders around the world are likely to respect their figures to some degree and their dire warning on Wednesday of a collapsing British Pound, soaring inflation and higher interest rates is pause for thought. The Government's figures on GDP, while negative were not nearly so bad as the 8% GDP collapse and the soaring unemployment rate. Typically the Pound would probably have swung aggressively lower on this news but investors appeared to brush it off, signs of exhaustion in the bears? It is worth considering that the UK housing market is probably quite reliant on lower interest rates for stability, and so stagflation would be particularly devastating to the UK. Stability Report reveals stark reality of Brexit on Sterling We will have a look at the full report from the Bank of England in more detail as it relates specifically to the British Pound. The first mention of Sterling is the BoE addressing the fact that talking about future effects from Brexit is slightly missing the point, as the UK economy is already dealing with the damage that the decision to leave the EU has undeniably had on sentiment, \"EU withdrawal has already had consequences for the economy, providing some evidence of the nature of the Brexit adjustment. Productivity growth has slowed, sterling has depreciated and the increase in inflation has squeezed real incomes...Sterling fell sharply immediately following the referendum, and remains 18% below its 2015 peak before the referendum was called.\" The most damaging disorderly no-deal Brexit is addressed in the report and it makes explicitly clear what this scenario is, focusing on a pretty bleak view of having no trade deals with any of the EU nations, \"In the disorderly scenario, on which the FPC has focussed given its remit for financial stability, the UK loses existing trade arrangements that it currently has with non-EU countries through membership of the EU. The UK's border infrastructure is assumed to be unable to cope smoothly with customs requirements.\" For the British Pound this scenario would leave it undesirable, and hence we get the first indication for the Bank of England that they would be keen to raise interest rates (or at least they attempt to justify the hawkish mindset they are trying to sell to support GBP exchange rates during this period, \"There is a pronounced increase in the return investors demand for holding sterling assets. There are spillovers across asset classes.\" Brexit Forecast: 25% more downside possible in British Pound (GBP) Exchange Rates Now to the actual forecast for Sterling in such an eventuality. And it is a big one. The Bank of England believes that a rapid increase in the risk premium priced into Pound exchange rates could be seen and ultimately crush Sterling a total of 34% lower since the 2016 inflation report, \"In the disorderly Brexit scenario, the term premium on UK government bond yields rises by 100bp. And as the sterling risk premium increases, sterling falls by 25%, in addition to the 9% it has already fallen since the May 2016 Inflation Report.\" Perhaps in an attempt to not sound too gloomy, the BoE has included a caveat that this is the worst case scenario, and hence they are even pricing in a little overshoot into the prediction in what is very much intended to be a \"covered all bases\" take and therefore not something that Brexiteers should get too hot under the collar about as it states, \"Consistent with the worst case assumptions underpinning the scenario, this reflects a combination of a shift in the equilibrium level of the sterling exchange rate and some overshooting beyond that new lower level\" Hence we see that since 2016 the British People have essentially voted that their country could be worth as much as 34% less than it was worth before if the bearish stars align. If the bullish dominos were to fall Is the maximum upside of Brexit 34% or higher in some people's eyes? Probably not, and this is just one example of why the markets are quicker to position for more weakness rather than more upside. Advertisement Save money on your currency transfers with TorFX, voted International Money Transfer Provider of the Year 2016, 2017 and 2018. Their goal is to connect clients with ultra competitive exchange rates and a uniquely dedicated service whether they choose to trade online or over the telephone. Find out more here. Advertisement François Auré Traded Forex for 6 years. Trading consultant for Private Sports Betting Fund out of Edinburgh. Background in ..."}, {"articleID": "2012102310_00083749_W", "names": {"Emma Roberts": ["Q228598", "Q41070739", "Q56187743", "Q56187744"]}, "date": "2012-10-23", "url": "http://radaronline.com/exclusives/2012/10/ashley-benson-dumped-justin-biebers-bff-james-franco-selena-gomez-ticked", "content": "james franco, but radaronline.com has learned some exclusive dirt about how these two got together--and the bridges ashley burned in the process. before hooking up with james, 34, ashley, 22, was dating ryan good so she became fast friends with the canadian singer's girlfriend, selena gomez, who was actually the one that got ashley the role in photos: selena gomez and vanessa hudgens get sexy for spring breakers \"selena feels used and kind of punched in the face seeing as though she got ashley the role and ashley just used the opportunity to break her friend's heart,\" the insider revealed to radaronline.com. <mark>emma roberts</mark> turned down the role because she didn't want to gain weight for it, ashley practically begged selena to get her in front of producers for the part. she did, because she thought they were all friends, but it was clear early on that ashley had something going on with james. \"photos: selena gomez in her bikini according to the insider, ryan started feeling like something was up because ashley was usually quite possessive and insecure in their relationship, but when she all of a sudden didn't have time for him, justin and selena didn't know what to say.\" once the shoot wrapped, ashley told ryan they needed to \"slow down' and then booked a flight to new york city to go see james' art gallery showing,\" the source said. \"selena is pi ** ed off that she went out of her way to vouch for ashley, only to have her dump ryan. she got the role and she got the man, but she lost a good friend.\" that's hot! zac efron says nicole kidman sex scenes \"highlight of my life' ryan seacrest predicts kim kardashian and kanye west will get engaged soon exclusive! brandi glanville: my relationship with leann rimes isn't amazing right now"}, {"articleID": "2010101821_00035832_W", "names": {"John Breen": ["Q6223040", "Q6223046"]}, "date": "2010-10-18", "url": "http://huffingtonpost.com/chloe-spencer/play-the-world-hunger-gam_b_765869.html", "content": "most people want to make a contribution to charities, but many have no idea which ones to donate to, and how much of their money actually goes through to the people in need on the other end. so, they usually end up not donating at all, except for maybe some clothes to the goodwill every now and then. so what should you do? first, do research. read up on different charities you can donate to, perhaps more local ones if you can find them. talk to the people from the charities you research and ask them questions. ask your friends and people you know where they donate to and how much. but if that even seems like too much for you, then just go to freerice.com. i heard about free rice from a documentary on world hunger and poverty called one peace at a time (which was excellent by the way; be sure to pick it up from the library or add it to your netflix que!). what free rice is is a nonprofit game. several games to choose from to be precise. all you do is play the games and with every correct answer, you donate 10 grains of rice. you can play multiple choice games that test your vocabulary, grammar, famous paintings, chemistry symbols, geography, math and languages like spanish and french. if you get a question wrong, no grains of rice are donated. once you get a question correct, the 10 grains of rice are automatically and immediately donated. your following question will be harder, and your next three consecutive correct answers will progress you to a harder level. united nations world food programme. and you don't have to have an account to play free rice, you can start playing the moment the homepage loads. but you can have an account if you wish to track your totals of donated rice. and the best thing about donating to this charity is it's fun, educational, and addictive. i sat there and played free rice the first time i visited the site until i donated about 5,000 grains of rice. and i felt wonderful about it. there's no money lost in the process, it's just grains of rice being directly donated, and free rice donates 100 percent of it's earnings. the sponsors that advertise on the site are paying for the rice you donate. as quoted in the faq page on freerice.com, \"freerice is not sitting on a pile of rice. you and other freerice players earn it 10 grains at a time. here is how it works: when you play the game, sponsor banners appear on the bottom of your screen for every correct answer that you choose. the money generated by these banners is then used to buy the rice. so by playing, you generate the money that pays for the rice donated to hungry people.\" where does the rice go exactly? the grains of rice goes to hungry countries all over the globe, including bangladesh, cambodia, uganda, nepal, bhutan and myanmar. watch a video of free rice being donated in bangladesh. so who started this wonderful way to help stop world hunger? his name is <mark>john breen</mark>, and he launched the fabulous freerice.com in october of 2007. in march 2009, he donated free rice to the un world food program, and it's been accumulating billions of grains of rice since. so what are you waiting for? play free rice today, and as many days as you can, and tell all your friends about it who don't know how to contribute to charities or think it's too hard or not worth it! and if you have a blog, promote free rice on it by having a banner, which can be found here: 0y3qfmlgmr8o3qm45upqvasxqp5qzua% 2fv4zgovjezkmsxopkbtar7en8j7ztsigq3otvn6aurbj0zfzoxdxjta% 3d% 3d"}, {"articleID": "2013041715_00091650_W", "names": {"Manuel Alvarez": ["Q27835314", "Q6753013"], "Iker Casillas": ["Q11584", "Q1190369"], "William Hill": ["Q16209612", "Q18719475", "Q22667358", "Q39070895", "Q8009538", "Q8012338"]}, "date": "2013-04-17", "url": "http://goal.com/en/news/11/transfer-zone/2013/04/17/3910779/mourinhos-told-me-hes-leaving-spain", "content": "apr 17, 2013 4:07:00 pm the portuguese coach has been linked with a move to chelsea and paris saint-germain and those rumours will intensify following the latest revelations from <mark>manuel alvarez</mark> bet: returns: real madrid? 12.86 draw? 65.00 betis? 110.00 bet: returns: real madrid? 13.00 draw? 55.00 betis? 90.00 bet: returns: real madrid? 12.50 draw? 60.00 betis? 110.00 bet: returns: real madrid? 12.50 draw? 60.00 betis? 100.00 bet: returns: real madrid? 12.80 draw? 50.00 betis? 110.00 real madrid coach jose mourinho has told the president of his son's football club canillas that he will be leaving spain this year. the portuguese has been linked with a return to chelsea at the end of the season, with paris saint-germain also touted as another possible destination, and <mark>manuel alvarez</mark>'s claims will now add weight to those rumours. the canillas chief has pleaded with blancos president florentino perez to keep mourinho on board beyond the end of the campaign and suggested that the former inter boss' departure would have a detrimental effect on la liga. \"mourinho told us that next year he won't be able to come and give a talk to the coaches because he won't be here,\" the canillas president told cope deportes. \"if mou goes it will be a big loss to spanish football. i hope florentino sorts it out.\" in 2011, mourinho donated? 10,000 to canillas to help save them from going under financially and has developed strong emotional ties with the club. the ex-porto boss has taken madrid to the copa del rey final and has guided them to the champions league semi-finals where they will play borussia dortmund for a spot in the wembley final in may. the portuguese coach has been unable to defend the liga title his side emphatically took away from barcelona last season, however, and the club trail their arch-rivals by 13 points with seven games to go. his relationship with <mark>iker casillas</mark> and a number of other madrid veterans has also come under scrutiny and rumours continue to build that he will leave the bernabeu in the summer - regardless of whether he bags another two trophies this season. sign up with <mark>william hill</mark> for a free bet up to? 25 sign up with bet365 for a free bet up to? 200 sign up to paddy power for? 250 in free bets sign up today with coral and get a? 50 free bet - no strings attached! sign up today with betvictor and get a? 25 free bet!"}, {"articleID": "2012092513_00057917_W", "names": {"Matt Cameron": ["Q318587", "Q6788429"]}, "date": "2012-09-25", "url": "http://adelaidenow.com.au/sport/afl/fitness-failure-leaves-shattered-mcglynn-on-sidelines/story-e6frecmu-1226481352925?from=public_rss", "content": "fitness failure leaves shattered mcglynn on sidelines the swans' best small forward ben mcglynn is out of the running for saturday's grand final after failing to overcome his hamstring injury. mcglynn was tested with a sprint session before the team's regular tuesday run by team physiotherapist <mark>matt cameron</mark>. \"unfortunately benny wasn't able to train today,\" <mark>cameron</mark> said. \"he did a sprint test before training and whilst he sprinted once, when he sprinted again he had some discomfort, so really he failed that test in order to train.\" not being able to train today and thursday means he is unfortunately out of this game. since injuring his hamstring in the qualifying final against adelaide 18 days ago the 27-year-old mcglynn has been obsessive in his efforts to prove his fitness. \"benny has been extremely positive about his recovery,\" swans coach john longmire said. \"he has been in at the club at every available opportunity and i'm positive there is nothing more he could have done to make himself available to play.\" ben has played a big role in getting us to saturday's match and everyone at the club is disappointed he can't play \"we were going to give him every opportunity to prove his fitness.\" unfortunately when the training was ramped up he couldn't take the next step up. longmire knows the disappointment mcglynn is going through. injury ruled him out of the 1996 grand final when north melbourne defeated the swans."}, {"articleID": "2014110607_00061311_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2014-11-06", "url": "http://www.reviewjournal.com/life/naming-las-vegas/walker-international-school-named-language-education-legend", "content": "From serving Mexican food to singing and playing \"La Cucaracha\" on the guitar, retired language teacher Dr. J. Marlan Walker is a Henderson legend. \"I loved when he would play his guitar or speak in one of the many different languages or dialects he knew,\" said former student Teddi Goodale Biggs. \"He made learning fun. Everyone respected and admired him.\" Well-respected throughout the community, it made sense when former students, family and friends nominated Walker as a potential elementary school namesake. \"When people ask me why they named a school after me, I tell them,' I don't have the slightest idea,'\" Walker said. \"I can think of many people who are more deserving than I, but I'm still very grateful for the honor they've awarded me. It touched me deeply.\" Walker International School, 650 Scholar Drive, opened in 2002, offering its students lessons in English and Spanish. \"I think the reason they made it a bilingual school was because of my background,\" Walker said. \"I've visited the children in different grades over the years, and I'm amazed at what they learn. It's given me a great deal of pride and satisfaction to watch them develop and grow into citizens of our society.\" Born in Southern Utah, Walker served in Mexico during a church mission shortly after graduating from high school. \"After the mission, I stayed there and went to the university in Mexico City to get a degree,\" Walker said. \"I was already employed with the government down in Mexico near the border, but I came to visit my sister in Henderson around 1952.\" During the visit, Walker met with his sister's friend and former Clark County School District superintendent Lyal Burkholder. \"He said they needed a language teacher at Basic High School,\" Walker said. \"I hadn't planned on teaching or even staying in Henderson, for that matter, but I thought I would give it a try.\" For 36 years, Walker taught Spanish and Latin at Basic and ran the school's language department. He taught some of Nevada's most influential people, including Sen. <mark>Harry Reid</mark> and former Gov. Mike O'Callaghan. Walker said he was presented with opportunities to advance into administration, but he declined them to continue working with students. \"I had some opportunities to earn more money, but why would I want to leave something I loved so much?\" he said. \"With the rapport I felt with them and the love a teacher has for their students, teaching gave me a great deal of fulfillment and satisfaction.\" Walker continued visiting Mexico, Peru and Guatemala while teaching. He started exchange programs and planned trips to Mexico so students could immerse themselves in the language. \"I wanted students to have the opportunity to be involved in Spanish, but the classroom wasn't long enough,\" Walker said. \"So, we developed extra programs so that kids could learn to really love the language.\" Although Walker took teaching seriously, former students said he had a great sense of humor. Mark Prime attended a two-week trip to Mexico with Walker in June 1963. While visiting some Aztec pyramids, Walker encouraged Prime to barter with a vendor for an onyx carving. \"I was able to get the vendor to cut the price by half,\" Prime said. \"Proud of myself, I told (Walker) what I had done and how much I paid. He smiled and said I still paid twice what it was worth.\" Kathleen Kimmel traveled to Mexico during her sophomore year with Walker and met a boy named Alejandro, who wrote to her after she returned home. \"He wrote beautiful letters in wonderful penmanship, but I could not understand a word,\" Kimmel said. \"So I took my letters to (Walker), who read the letters to himself, chuckling and teasing me to pieces but not telling me what the letters said.\" Walker retired from the school district in 1989 but continued promoting education abroad. At 86, Walker helps run the Las Gaviotas Foundation, a humanitarian project that helps students attend secondary school to prevent poverty in Mexico, Peru and Guatemala. \"I will continue traveling until I get old and cannot move anymore,\" Walker said. \"This is the love of my life.\" Contact Henderson View reporter Caitlyn Belcher at cbelcher @ viewnews.com or 702-383-0403."}, {"articleID": "2017111316_00834961_W", "names": {"Kevin Brady": ["Q472241", "Q6395881"], "Richard Neal": ["Q1464697", "Q7328011"]}, "date": "2017-11-13", "url": "https://sg.finance.yahoo.com/news/latest-trump-tweets-suggestion-gop-tax-bill-153051901--finance.html", "content": "View photos House Ways and Means Committee Chairman <mark>Kevin Brady</mark>, R-Texas, left, joined by Rep. <mark>Richard Neal</mark>, D-Mass ., the ranking member, and Rep. Sander Levin, D-Mich ., offers his manager's amendment as the GOP tax bill debate enters the final stage, on Capitol Hill in Washington, Thursday, Nov. 9, 2017. (AP Photo/J. Scott Applewhite) More WASHINGTON (AP)--The Latest on tax legislation (all times local): 11:30 a.m. Congressional analysts are estimating that the Republican Senate tax bill would increase taxes in 2019 for some 13.8 million U.S. households earning less than $200,000 a year. The nonpartisan Joint Committee on Taxation provided the analysis Monday as the Senate's tax-writing committee begins work on its version of the tax overhaul bill. The legislation, promoted as a boon to the middle class, would steeply cut corporate taxes, double the standard deduction, and limit or repeal completely the federal deduction for state and local property and income taxes. The analysis of the Senate plan says 13.8 million households, or about 10 percent of all taxpayers, would face a tax increase of $100 to $500 in 2019. There also would be increases greater than $500 for a number of taxpayers, especially those with incomes between $75,000 and $200,000. By 2025, 21.4 million households would have tax increases. ___ 10:15 a.m. President Donald Trump is calling on Republican lawmakers to get more aggressive with their tax proposals. In a tweet Monday, Trump says the GOP should repeal \"the unfair & highly unpopular\" individual mandate in the Affordable Care Act as part of the tax legislation, and to reduce taxes \"even further.\" Trump tweets: \"Cut top rate to 35% w/all of the rest going to middle income cuts?\" Neither the House or Senate tax bills includes a repeal of the individual mandate, with lawmakers saying it would make their signature legislative promise all the more difficult to approve. Both versions of the tax plan cut the top individual rate, but the Senate version only lowers it to 38.5 percent. ___ 3:50 a.m.. The chairman of the House's tax-writing committee is expressing confidence that his chamber won't go along with the Senate's proposal to eliminate the deduction for property taxes. The GOP is moving urgently on the first rewrite of the U.S. tax code in three decades, but key differences promise to complicate the effort. The House bill allows homeowners to deduct up to $10,000 in property taxes while the Senate proposal eliminates the entire deduction. The deduction is particularly important to residents in states with high property values or tax rates. Rep. <mark>Kevin Brady</mark>, chairman of the House Ways and Means Committee, says he worked with lawmakers in those states to ensure the House bill delivers relief. The Senate's tax-writing committee will wade through its newly unveiled measure starting Monday."}, {"articleID": "2014061914_00076164_W", "names": {"Michael Cooper": ["Q15485508", "Q21642395", "Q42764969", "Q42887486", "Q47540919", "Q6829445", "Q6829446", "Q971538"], "John Brooks": ["Q10498801", "Q28131666", "Q6223369", "Q6223372", "Q6223373", "Q6223375", "Q6223377", "Q6224304", "Q821211"]}, "date": "2014-06-19", "url": "http://feeds.washingtonpost.com/c/34656/f/636679/s/3ba4dcd8/sc/13/l/0L0Swashingtonpost0N0Csports0Cmystics0Elead0Eevaporates0Elate0Ein0E830E730Eloss0Eto0Edream0C20A140C0A60C180Cbe76be0Ac0Ef7320E11e30Ea60A60E946fd632f9f10Istory0Bhtml0Dwprss0Frss0Isports/story01.htm", "content": "ATLANTA - Angel McCoughtry matched her season high with 27 points, scoring 18 points in the second half in the Atlanta Dream's She was 7 for 12 from the field in the second half and keyed a 14-0 fourth-quarter run with six points and three rebounds to help the Dream (8-3) run their winning streak to five games. Mystics (5-7) led much of the first three quarters. Washington, the least effective three-point shooting team in the league, went 7 of 10 from long range en route to a 39-34 halftime lead. But the Mystics went cold for nearly six minutes in the fourth quarter under stiffer defensive pressure, and the Dream took advantage. \"We (made) them stop shooting, got in their faces,\" McCoughtry said. \"We would rather let them have 2s than 3s, so that kind of helped us.\" Atlanta held Washington to 1-of-7 shooting from three-point range in the second half. \"I think our defense just stepped up a little bit; we started getting up on the shooters,\" Dream Coach <mark>Michael Cooper</mark> said. \"We changed our pick-and-roll (defense) from one to another, and it really helped.\" Tiffany Hayes added 11 points for Atlanta, and Erika de Souza had 10 points and eight rebounds. Rookie point guard Bria Hartley led Washington with 16 points, and Emma Meesseman added 15. Mystics rookie Stefanie Dolson, who scored eight points on 4-of-5 shooting in 20 minutes, pushed the lead to 66-63 on a runner with 7 minutes 37 seconds left. But the visitors went scoreless over the next 5:49. McCoughtry's 11-foot fadeaway jumper from the left baseline with 6:39 left gave Atlanta the lead for good, 67-66. Washington went 3 for 4 at the free throw line, while Atlanta was 20 for 23, including 7 of 7 by McCoughtry. \"When the free throw difference is 23-4, it's hard to make up for it,\" said Washington Coach Mike Thibault, whose team lost for the fifth time in six games. \"They were aggressive, drove well SECTION: {section = sports, subsection = null}!!! INITIAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!!! UGC FROM ARTICLE: {allow_comments = true, allow_photos = false, allow_videos = false, comments_period = 14, comments_source = washpost.com, default_sort =, default_tab =, display_comments = true, is_ugc_gallery = false, max_items_to_display = 15, max_items_to_display_top = 3, moderation_required = false, stream_id =}!!! FINAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!! SECTION: {section = sports, subsection = null}!!! INITIAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!!! UGC FROM ARTICLE: {allow_comments = true, allow_photos = false, allow_videos = false, comments_period = 14, comments_source = washpost.com, default_sort =, default_tab =, display_comments = true, is_ugc_gallery = false, max_items_to_display = 15, max_items_to_display_top = 3, moderation_required = false, stream_id =}!!! FINAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!! SuperFan Badge SuperFan badge holders consistently post smart, timely comments about Washington area sports and teams. Culture Connoisseur Badge Culture Connoisseurs consistently offer thought-provoking, timely comments on the arts, lifestyle and entertainment. Washingtologist Badge Washingtologists consistently post thought-provoking, timely comments on events, communities, and trends in the Washington area. Post Writer Badge This commenter is a Washington Post editor, reporter or producer. Post Forum Badge Post Forum members consistently offer thought-provoking, timely comments on politics, national and international affairs. Weather Watcher Badge Weather Watchers consistently offer thought-provoking, timely comments on climates and forecasts. World Watcher Badge World Watchers consistently offer thought-provoking, timely comments on international affairs. Post Contributor Badge This commenter is a Washington Post contributor. Post contributors aren't staff, but may write articles or columns. In some cases, contributors are sources or experts quoted in a story. Post Recommended Washington Post reporters or editors recommend this comment or reader post. You must be logged in to recommend a comment. Sign in here Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges:. Replies to those posts appear here, as well as posts by staff writers. All comments are posted in the All Comments To pause and restart automatic updates, click\" Live \"or\" Paused \". If paused, you'll be notified of the number of additional comments that have come in. Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges: US Patent Office finds Redskins' name offensive Manaus celebrates its World Cup games in the Amazon rain forest, even as some wonder why Spain eliminated from World Cup contention with 2-0 loss to Chile <mark>John Brooks</mark> rises from obscurity to World Cup hero with winning goal for U.S. soccer"}, {"articleID": "2019071607_00082170_W", "names": {"Michael Robertson": ["Q11778392", "Q16222420", "Q16222421", "Q320406", "Q6833913", "Q6833915"], "Robert Clifford": ["Q21165610", "Q40133440"], "Alan Johnson": ["Q19560876", "Q2830527", "Q332336", "Q4706980", "Q4706981", "Q4706983", "Q4706984", "Q4706985"]}, "date": "2019-07-16", "url": "https://www.wokv.com/news/national-govt--politics/man-whose-family-died-boeing-737-max-crash-scrap-the-jet/rTDvgPoCF27oiU4Gkdb26O/", "content": "Man whose family died in Boeing 737 Max crash: Scrap the jet Photo Credit: AP Photo/Mulugeta Ayene FILE - In this March 11, 2019, file photo, rescuers work at the scene of an Ethiopian Airlines flight crash near Bishoftu, or Debre Zeit, south of Addis Ababa, Ethiopia. Paul Njoroge, who lost his wife and three young children in the March 10 crash of an Ethiopian Airlines' Boeing 737 Max 8 aircraft, believes Boeing should scrap the 737 Max, and he wants the company's top executives to resign and face criminal charges for not grounding the plane after a deadly accident last October. On Wednesday, July 17, Njoroge will be the first relative of any of the 346 passengers who died in those crashes to testify before Congress. (AP Photo/Mulugeta Ayene) Man whose family died in Boeing 737 Max crash: Scrap the jet By: AP Airlines Writer July 16 2019 3:18 AM Updated: July 16 2019 3:18 AM Photo Credit: AP Photo/Mulugeta Ayene Paul Njoroge says he believes Boeing should scrap the 737 Max, and he wants the company's top executives to resign and face criminal charges for not grounding the plane after a deadly accident last October. Five months after that crash, Njoroge's wife and three young children were killed when another 737 Max went down near Addis Ababa, Ethiopia, shortly after takeoff. If Boeing and the Federal Aviation Administration had done their jobs properly, Njoroge told The Associated Press, \"these planes would have been grounded in November and today I would be enjoying summer with my family, I would be playing football with my son.\" On Wednesday, Njoroge (ja-ROW-ga) is due to be the first relative of any of the 346 passengers who died in those crashes to testify before Congress. He will be accompanied by <mark>Michael</mark> Stumo, whose daughter, Samya, also died in the March 10 crash of an Ethiopian Airlines 737 Max. In testimony he submitted to the House aviation subcommittee, Njoroge says passengers' families have several demands that must be met before the Max is allowed to fly again, including a new, top-to-bottom review of the plane by regulators. In an interview, Njoroge went further, saying the plane should never fly again because of what he considers an irredeemable design flaw. Because the size and placement of the plane's engines raised the risk of an aerodynamic stall, Boeing devised flight-control software called MCAS. Preliminary reports indicate that the software pushed the nose of the plane down in both crashes, and Boeing is working on changes to make MCAS more reliable and easier to control. Boeing did not tell pilots about MCAS until after the first crash, in October off the coast of Indonesia. \"They didn't want people to know about the design flaw, and that's why they kept the existence of MCAS hidden,\" Njoroge said. \"I'd like to see (Boeing CEO) Dennis Muilenburg and the executives resign, because they caused the deaths of 346 people,\" Njoroge said. \"They should be held liable criminally for the deaths of my wife and my children and my mom-in-law and 152 others in the crash of Ethiopian Airlines flight 302 because that was preventable.\" Chicago-based Boeing said it lamented the impact that the crashes are having on families of those on board. \"These incidents and the lives lost will continue to weigh heavily on our hearts and on our minds for years to come,\" the company said in a statement. \"We are committed to working with the communities, customers and the aviation industry to help with the healing process.\" Njoroge was born in Kenya and now lives in Toronto, where he works as an investment professional. A Chicago aviation lawyer, <mark>Robert Clifford</mark>, sued Boeing on his behalf over the deaths of his wife, Carol, his son and daughters, 6-year-old Ryan, 4-year-old Kelli and 9-month-old Rubi, and his wife's mother. They were on their way to visit family in Kenya when their Nairobi-bound plane crashed shortly after takeoff on March 10. Njoroge accused Boeing of trying to shift blame to foreign pilots in Indonesia and Ethiopia to avoid grounding the Max, which he called \"utter prejudice.\" After the Oct. 29 crash involving Indonesia's Lion Air, Boeing issued a bulletin to pilots reminding them about Boeing instructions for handling a nose-down pitch of the plane. After the Ethiopian crash, Muilenburg said the pilots did not completely follow the procedures. The preliminary report indicated the Ethiopian pilots tried the procedures nearly until the end but could not save the plane, and they were flying extremely fast. Muilenburg has repeatedly apologized in public to families of the passengers. Njoroge said he has not received personal condolences. \"It would be very important if Boeing executives can meet with the family members in person and apologize to them,\" he said. \"That would help.\" Wednesday's hearing will be the House aviation panel's third on the Max, which has been grounded worldwide since March. Other witnesses will include representatives from the National Transportation Safety Board and unions representing pilots, flight attendants, airline mechanics and safety inspectors. ___ David Koenig can be reached at http: //twitter.com/airlinewriter Related Man whose family died in Boeing 737 Max crash: Scrap the jet Photo Credit: AP Photo/Teresa Crawford, File FILE - In this April 29, 2019, file photo, Paul Njoroge, who lost his wife and three young children in the March 10 crash of an Ethiopian Airlines' Boeing 737 Max 8 aircraft, speaks at a news conference in Chicago. Njoroge believes Boeing should scrap the 737 Max, and he wants the company's top executives to resign and face criminal charges for not grounding the plane after a deadly accident last October. On Wednesday, July 17, Njoroge will be the first relative of any of the 346 passengers who died in those crashes to testify before Congress. Read More The Latest News Headlines Man indicted on murder charge in death of girlfriend's toddler son, claims boy slipped from his hands A Tennessee man was indicted on first-degree murder charges after his girlfriend's 2-year-old son was taken to the hospital and later died .>> Read more news stories <mark>Alan Johnson</mark>, 41, of Memphis, was taking care of the child while his mother was at work on Oct. 10, 2018, according to officials. He told investigators he was throwing the 2-year-old up in the air and catching him, but the boy slipped on the last throw, authorities said. According to investigators, <mark>Johnson</mark> said he swung the child--identified as Dylan Meeks--to \"keep him from hitting the ground.\" He said he saw the boy's neck go back and noticed he was not responding, so he called police, authorities said. The child died two days later. The staff at Le Bonheur Children's Hospital told police that the injuries, which included a skull fracture, brain swelling, internal injuries and rib fractures, were not consistent with <mark>Johnson</mark>'s story. The medical examiner found new and healing fractures of the child's ribs and also lacerations of several organs. <mark>Johnson</mark> was later charged with murder. He was indicted Monday on charges of first-degree murder in the perpetration of aggravated child abuse and neglect. <mark>Johnson</mark> is being held without bond in the Shelby County Jail. Pennsylvania man charged with homicide in death of girlfriend's 11-month-old daughter Police have apprehended a Pennsylvania man wanted on charges related to the death of his girlfriend's infant daughter, authorities said .>> Read more trending news Pennsylvania State Police confirmed that Derrick Bass, 29, was arrested in Ohio on Monday, two days after the 11-month-old was found dead in a Pack \"n Play at an apartment complex in East Huntingdon Township, Pennsylvania. He has been charged with homicide. The baby's mother told police that Bass was supposed to be watching her daughter and his two children. He also was supposed to pick her up from work, but never showed up, she told police. When the girl's mother got home, she noticed her daughter and various electronic items were missing, according to a complaint. She called police shortly after 11 p.m. Police responded to the apartment shortly after 12:30 a.m. after the mother reported finding her daughter unresponsive in the Pack\" n Play, the complaint said. She did not see her until that time because the baby was covered in blankets, according to the complaint. Family identified the girl as 11-month-old Niomie Miller. An autopsy was conducted Sunday morning, and the preliminary cause of death was determined to be drowning, authorities said. Congresswomen targeted by Trump call tweets \"xenophobic, bigoted remarks' The four high-profile liberal Democratic congresswomen targeted by President Donald Trump this weekend on social media responded Monday afternoon in a news conference, calling Trump's tweets\" xenophobic, bigoted remarks. \">> Read more trending news Democratic Reps. Ayanna Pressley (D-Massachusetts), Rashida Tlaib (D-Michigan), Alexandria Ocasio-Cortez (D-New York) and Ilhan Omar (D-Minnesota) responded to Trump's attack that they should\" go back and help fix the totally broken and crime-infested places from which they came, \"by calling for Trump's impeachment. Trump's comments were\" a disrupted distraction, \"Pressley said. She said she wants to focus on the issues her constituents sent her to Washington to address, such as immigration reform and health care, but she said it was important to respond to the president. Calling Trump\" callous \"and\" corrupt, \"Pressley said that despite the\" occupant of the White House trying to marginalize us, we cannot, we will not be silent. \"\"I will always refer to him as the occupant as he is only occupying space.\" Omar called Trump's remarks \"a blatantly racist attack on four duly elected members\" of Congress, all women of color. \"This is the agenda of white nationalists. Whether it is happening in chat rooms, or it is happening on national TV, and now it's reached the White House garden,\" she said. She agreed with Pressley, calling for Trump's impeachment. The lawmakers took several questions at the end of their statements. Three of the lawmakers were born in the United States. Omar, who was born in Somalia and came to the U.S. when she was 12 and is now an American citizen, was asked to reply to Trump's accusation that she's a communist and supports al Qaeda. \"I will not dignify that with an answer,\" she said. Trump tweeted during the news conference, saying Democrats were \"forced to embrace them,\" apparently referencing the party's support of the lawmakers he attacked. \"The Dems were trying to distance themselves from the four\" progressives, \"but now they are forced to embrace them. That means they are endorsing Socialism, hate of Israel and the USA! Not good for the Democrats!\" Trump said. The House plans to introduce a resolution this week condemning the president's attacks. Trump doubled down this morning on his remarks about the four Congresswomen, telling reporters gathered at the White House that criticism of his comments \"doesn't concern me because many people agree with me .' He said Ocasio-Cortez, Tlaib, Omar and Pressley are\" very unhappy' and \"hate our country .'\" I'm watching them--all they do is complain,' Trump said. \"So, all I'm saying is, if they want to leave, they can leave. Pelosi: Democrats to vote on condemning Trump's\" xenophobic' attacks on minority congresswomen House Democrats plan to introduce a resolution this week condemning President Donald Trump after he attacked four high-profile liberal Democratic congresswomen of color over the weekend, saying they should \"go back' to the countries they came from, according to multiple reports .>> Read more trending news In a letter sent Monday to fellow Democrats and obtained by Politico, House Speaker Nancy Pelosi said Trump\" went beyond his own low standards using disgraceful language' in his attacks on Rep. Alexandria Ocasio-Cortez (D-NY), Rep. Rashida Tlaib (D-MI), Rep. Ilhan Omar (D-MN) and Rep. Ayanna Pressley (D-MA). She called the president's comments \"xenophobic' and said they were\" meant to divide our nation .' \"This morning, the President doubled down on his attack on our four colleagues, suggesting they apologize to him,' she wrote.\" Let me be clear, our Caucus will continue to forcefully respond to these disgusting attacks .' Pelosi said the resolution will be sponsored by Polish-born Rep. Tom Malinowski (D-NJ) and Rep. Jamie Raskin (D-MD).>> Read the latest from our Washington Insider, Jamie Dupree The president brushed off criticism Monday, telling reporters gathered at the White House that condemnation of his tweets \"doesn't concern me because many people agree with me .' He said Ocasio-Cortez, Tlaib, Omar and Pressley are\" very unhappy' and \"hate our country .'\" I'm watching them--all they do is complain,' Trump said. \"So, all I'm saying is, if they want to leave, they can leave .' Trump set off a firestorm Sunday with a series of tweets attacking the freshmen congresswomen without naming them.\" So interesting to see \"Progressive' Democrat Congresswomen, who originally came from countries whose governments are a complete and total catastrophe, the worst, most corrupt and inept anywhere in the world (if they even have a functioning government at all), now loudly an viciously telling people of the United States, the greatest and most powerful Nation on earth, how our government is to be run,' Trump wrote.\" Why don't they go back and help fix the totally broken and crime infested places from which they came .' Of the congresswomen targeted in Trump's tweets, only one, Omar, was born outside the U.S. Omar was born in Mogadishu, Somalia, according to The Washington Post. Her family fled civil war in the country when she was a child, and she became a U.S. citizen when she was a teenager, the newspaper reported. Ocasio-Cortez was born in New York, Tlaib was born in Detroit and Omar was born in Cincinnati, according to the Post. It's not the first time Trump has been accused of holding racist views. In his campaign kickoff in June 2015, Trump deemed many Mexican immigrants \"rapists.\" In 2017, he said there were good people on \"both sides\" of the clash in Charlottesville, Virginia, between white supremacists and anti-racist demonstrators that left one demonstrator dead. Repeatedly, Trump has painted arriving immigrants as an \"infestation,\" and he has been slow in condemning acts of violence committed by white supremacists. He also launched his political career with false claims that President Barack Obama was not born in the United States. The Associated Press contributed to this report. Jersey cop who overdosed on heroin in patrol car pleads guilty, loses job New Jersey police dispatchers could not get a response from Franklin Township patrol Officer Matthew Ellery early one morning in April, so they sent another officer--who happened to also be a paramedic--to his last known location. Ellery's fellow officer saved his life as he overdosed on heroin in the driver's seat of the patrol car. Ellery, 29, of Middlesex, on Friday pleaded guilty to possession of a controlled dangerous substance and driving while intoxicated, according to the Somerset County Prosecutor's Office. As part of his plea, he will apply for admission into a five-year drug court-based treatment program. Failure to complete the progra would result in three to five years in New Jersey State Prison .>> Read more trending news Ellery, who NBC News reported had been an officer since August 2016, also agreed to forfeit his position as a police officer. His driver's license will be suspended for seven months. Somerset County Prosecutor <mark>Michael Robertson</mark> said in a statement that Ellery was on duty just after 1 a.m. April 7 when dispatchers could not reach him. When his fellow officer found him, he was parked in the driveway of a business. Ellery was unresponsive in the driver's seat of the car. \"The responding officer, who is also an EMT (emergency medical technician), determined that defendant Ellery was experiencing an opiate overdose because he was cyanotic, had no carotid pulse and was not breathing,\" <mark>Robertson</mark>'s statement read. \"The officer removed defendant Ellery from the vehicle and administered two doses of naloxone to him. After receiving the two doses of naloxone and before the officer could commence CPR, defendant Ellery regained consciousness.\" Naloxone, also known by the brand name Narcan, is a drug that can rapidly reverse the effects of an overdose of opioids, such as heroin, fentanyl and pain pills like hydrocodone and oxycodone. According to the National Institute on Drug Abuse, the drug works as an opioid antagonist. It binds to the opioid receptors in a person's brain and blocks or reverses the effects of the drug causing the overdose. \"It can very quickly restore normal respiration to a person whose breathing has slowed or stopped as a result of overdosing with heroin or prescription opioid pain medications,\" the institute's website says. Naloxone, which can be injected or administered via a nasal spray, has become a tool carried by police officers, deputies and paramedics across the country as they see a drastic uptick in opioid overdoses. Some states are also training civilians, including librarians, to administer the drug and some pharmacies will sell naloxone over the counter to customers, including chronic pain patients, at risk of an accidental overdose. Watch the video at the bottom of this story to learn more about how to obtain naloxone. The online reaction to Ellery's plea, for which he will be sentenced next month, was mixed on the Facebook page of the county prosecutor's office. Some posters noted that, when naloxone was first made available in the area, comments flooded the page stating that \"junkies shouldn't be saved.\" \"Guess what?\" one man wrote. \"It's possible to be aggravated at this officer,\" cause he's out arresting people for drugs while on drugs himself, but still have sympathy for him as a human being and what he's going through. \"Others offered Ellery prayers and well wishes that he can get the treatment he needs.\" Addiction can happen to anyone, even you, because it does not discriminate, \"one woman wrote. Another woman described addiction as a monster that affects everyone in the addict's family.\" I hope he can get the help he needs. Heroin is a killer, \"the woman wrote.\" This probably saved his life. \""}, {"articleID": "2010081510_00252411_W", "names": {"Daniel Radcliffe": ["Q20744643", "Q38119"]}, "date": "2010-08-15", "url": "http://hindustantimes.com/celebwatch/Daniel-Radcliffe-dating-Harry-Potter-producer-s-stepdaughter/586764/H1-Article1-582708.aspx", "content": "<mark>daniel radcliffe</mark> dating harry potter producer's stepdaughter harry potter star <mark>daniel radcliffe</mark> is said to be dating the wizard series' producer david heyman's stepdaughter. the english actor was spotted with 19-year-old olive uniacke several times in the recent past. <mark>radcliffe</mark>'s 21st birthday on 23 july 2010 and were also seen looking close at a cricket match in london, reports the daily star. the couple, who have been friends since the harry potter series started in 2001, are secretly dating, according to \"olive and dan have known each other a long time, ever since the harry potter films started. they were close a few years ago but the relationship fizzled out then. even so, they have always remained friends. and in the last few months they have grown closer again,\" a source said."}]