[{"date": "2015-01-29", "url": "http://www.cbronline.com/news/uk-oracle-user-groups-ceo-resigns-for-career-break-4499322", "content": "James Haslam, who joined in July 1997, is leaving UKOUG on 6 March 2015. James Haslam, who joined in July 1997 as financial controller, is leaving UKOUG on 6 March 2015 for a career break, using the opportunity to travel. During his tenure, Haslam held a range of leading positions, including operations manager, general manager, director of operations to the CEO and board member. In its announcement, the association said he played a \"pivotol role\" in building the UKOUG's position as a leading user group worldwide, and expanding the group's portfolio to include the user groups of PeopleSoft, JD Edwards, Hyperion, Siebel, Solaris and Taleo. \"The role James is vacating is a key leadership role to both UKOUG and in the wider User Group community. As such it is important that James' replacement is selected with care. To that end, until a replacement is selected, we will be appointing an interim CEO supported by the Senior Management Team,\" Fiona Martin, UKOUG's members advocate chair, said in a statement. <mark>David Cameron</mark> plans crackdown on encrypted communications ICT Priorities in Financial Markets - Enterprise ICT investment plans Capscan is a leading supplier of international address management solutions and data integrity services. Capscan has more than 1800 customers...Teneo is an infrastructure optimization company, providing solutions that help customers with the management, performance and virtualization of...Absolute ® Software specialises in technology and services for the management and security of mobile computers and smartphones.", "articleID": "2015012910_00044565_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}}, {"date": "2015-01-29", "url": "http://salon.com/2015/01/29/apnewsbreak_nfl_says_concussions_down_25_percent_this_year", "content": "News PHOENIX (AP) - The rate of concussions among NFL players fell 25 percent this season, according to the league, even as injury reporting and trips to injured reserve list rose overall. Data provided to The Associated Press by the NFL ahead of its annual pre-Super Bowl health and safety news conference Thursday shows there were 111 concussions in games during the 2014 regular season, down from 148 in 2013, and 173 in 2012, a 36 percent drop over that three-year span. When preseason games, plus preseason and regular-season practices, are included, the 202 concussions this season declined 12 percent from 2013, and 23 percent from 2012. That's despite no new rules meant to protect players' heads. \"Players are changing the way they're tackling,\" NFL Senior Vice President of Health and Safety Policy <mark>Jeff Miller</mark> said. \"They're changing the way they play the game .\" In all, the concussion rate is down to 0.43 per game, <mark>Miller</mark> said, adding: \"You have to play more than two games to get a concussion in the NFL, by those numbers .\" A total of 59 concussions were caused by helmet-to-helmet or shoulder-to-helmet hits this season, the league's data says, almost exactly half as many as two years ago. \"With all the technological innovations that we've had over the past few years, I'm surprised the numbers keep going down,\" St. Louis Rams team doctor Matthew Matava said. \"Because you'd think, with more vigilance, you'd see more of any sort of condition .\" According to STATS, there were 265 players placed on injured reserve during the regular season in 2014, a 17 percent jump from the 226 the year before. This season, for the first time, NFL injury data was collected by all 32 teams through electronic medical records, allowing for more comprehensive accounting. That system does a better job of capturing all injuries - from a bruise, say, to a broken leg - according to Christina Mack, an epidemiologist at Quintiles, a clinical research organization that works with the league. One change is that less-severe injuries, such as a first-degree sprain, are captured more frequently now, she said. Something worse, such as a concussion or torn knee ligament, is just as likely to have been reported under the old setup. A 15 percent hike in injury reporting from 2013 to 2014 - an increase of about 0.9 per game, on average - is at least in part due to the new system, according to Mack. \"We knew it was going to be up this year, because we transitioned to the electronic medical records,\" Mack said in a telephone interview, echoing <mark>Miller</mark>'s explanation. \"We can't conclude the incidence of injuries is up. We know the reporting of injuries is up .\" In December 2013, New England Patriots coach Bill Belichick - whose team plays the Seattle Seahawks on Sunday - said it was \"a matter of record, not opinion\" that injuries league-wide had been on the rise recently. Belichick blamed a decrease in the number of offseason, preseason and in-season practice sessions and workouts allowed as a main contributor to higher injury totals. That reduction in practice time was among changes made in an effort to cut down on head injuries after the NFL's concussion policies were criticized by Congress, and thousands of ex-players sued the league. Other safety measures include rules protecting defenseless receivers and barring hitting with the crown of the helmet; revised return-to-play protocols; independent neurologists on sidelines during games; \"eye in the sky\" monitoring by athletic trainers to make sure in-game injuries aren't overlooked. ___ Follow Howard Fendrich on Twitter at http: //twitter.com/HowardFendrich \"Broad City\" and the City: 10 ways you know you live in Abbi and Ilana's New York Thanks for nothing, Netflix: Depressing new research links TV binging to depression Lil B launches the vegan emoji app you never knew you needed <mark>Stewart</mark> on \"manspreading\" : \"Don't be an a ** hole on the subway\" <mark>Jon Stewart</mark> slams the Koch brothers for putting a price tag on the 2016 election Bieber's teary apology: \"I'm not that person who says' I don't give a f--!' I'm not that kid\" Not the next \"Gone Girl\" : Why \"The Girl on the Train\" can't fill Amazing Amy's shoes \"You're only as healthy as your darkest secret\" : Director Thomas Schlamme on what drives \"The Americans\" and his new show \"Manhattan\" \"Amira & Sam\" : Meet the rom-com antidote to \"American Sniper\" David Letterman reportedly sent Jay Leno an invitation to appear on \"Late Show\" \"Just about everybody else in this book is white\" : Daniel Handler and the race questions the New York Times won't ask Louis C.K.'s new stand-up special: From kids to death, the comedian covers familiar, very funny ground \"Ghostbusters\" reboot: Let's weigh the pros and cons of the new cast <mark>Amanda Palmer</mark> responds to Twitter outrage over Jonathan Chait essay with a poem, of course \"It was ill-advised, unfunny and not brand-appropriate\" : The \"Fifty Shades\" - inspired ad campaign too hot for Domino's \"Oh for f ***'s sake Jenny McCarthy\" : Larry Wilmore slams anti-vaxxers Watch the first-ever anti-domestic violence Super Bowl ad, brought to you by the NFL <mark>Jon Stewart</mark> destroys CNN over absurd blizzard coverage Rainn Wilson mocks hipster foodies: \"It makes me sick\" Why \"American Sniper\" Chris Kyle's defenders are so misguided Elite Daily/Twitter 2014's fast food atrocities McDonald's Black Burger: Because the laws of competition say that once Burger King introduces a black cheeseburger, it's only a matter of time before McDonald's follows suit. You still don't have to eat it. Domino's 2014's fast food atrocities Arby's / Facebook 2014's fast food atrocities KFC'S ZINGER DOUBLE DOWN KING: A sandwich made by adding a burger patty to the infamous chicken-instead-of-buns creation can only be described using all caps. NO BUN ALL MEAT. Only available in South Korea. Taco Bell 2014's fast food atrocities Krispy Kreme Triple Cheeseburger: Only attendees at the San Diego County Fair were given the opportunity to taste the official version of this donut-hamburger-heart attack combo. The rest of America has reasonable odds of not dropping dead tomorrow. Taco Bell 2014's fast food atrocities Boston Pizza's Pizza Cake: The people's choice winner of a Canadian pizza chain's contest whose real aim, we'd imagine, is to prove that there's no such thing as \"too far .\" Currently in development. 7-Eleven 2014's fast food atrocities Photos from the Happy Ending Salon Make Summer More Poetic with These 10 International Works 8 Illustrated Books for Every Age and Every Summer Reading List 10 Great Science Reads That You Can Take to the Beach Turn Summer into a Literary Field Day with these 9 Collections of Non-Fiction Sports Writing Travel to Foreign Lands in 10 Newly Translated Novels Get Lost in 8 Great Biographies - from Lawrence of Arabia to Margaret Fuller Explore Diverse Cultures Through Varied Genres with These 8 New Works 8 Great Essay Collections for Your Reading Pleasure Looking for Fresh Fiction for your Summer Reading? The best and worst series finale music of all time Stories from a Warming Planet: Wildfires Seven celebrity \"authors\" who didn't do it alone They're no \"Divergent\" : Eight young-adult movie franchises that died untimely deaths The Super Bowl Scammer: Dion Rich Is the Godfather of Gatecrashing Ringo Starr Slates \"Postcards From Paradise' Weeks Before Hall of Fame Watch Marty Stuart Sing, Shred and\" Streamline' on \"Letterman' Universal Orlando went by the book when creating live shows for the Wizarding World of Harry Potter - Diagon Alley\" The Nightly Show' Takes On The Koch Brothers' Dark Money...Or, Rather, \"Old, White Money' Kim Kardashian Masters The Art Of The Public Bathroom Selfie You Might Think You Know What This Mormon Woman Is Going To Say About Gay People, But Just Watch Boobs, Boobies, The Girls, Tatas. Whatever You Name 'Em, They're Kinda Incredible. They Liked Her Because She\" Talked White .' I Bet They Didn't Expect This. 90 Seconds Of Wiggling, Jiggling, Sweating, And Shaking Is All It Took To Get Me Off The Couch Copyright © 2015 Salon Media Group, Inc.. Reproduction of material from any Salon pages without written permission is strictly prohibited. SALON ® is registered in the U.S. Patent and Trademark Office as a trademark of Salon Media Group Inc. .", "articleID": "2015012919_00037770_W", "names": {"Amanda Palmer": ["Q240377", "Q4591749"], "Jeff Miller": ["Q30981158", "Q43459095", "Q6174508", "Q6174513", "Q6822669", "Q746834", "Q970478"], "Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}}, {"date": "2015-02-03", "url": "http://businessinsider.com/nfl-commissioner-roger-goodell-robert-kraft-deflategate-2015-2?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Patriots Owner Hijacks Bill Belichick Press Conference, Demands Apology From NFL If His Team Is Found Innocent <mark>Robert Kraft</mark>'s gutsy $175 million investment in the New England Patriots has paid off big time <mark>Richard Sherman</mark> Says The NFL Won't Punish The Patriots Because Their Owner Is Best Friends With Roger Goodell Despite one of the ugliest seasons in NFL history thanks to a number of issues and how the league handled them, commissioner Roger Goodell However, Goodell's biggest supporter, New England Patriots owner <mark>Robert Kraft</mark>, is suddenly singing a different tune and the commissioner's job may no longer be secure. The Season from Hell: Inside Roger Goodell's Ruthless Football Machine, \"Gabriel Sherman outlines just how close Goodell and <mark>Kraft</mark> have been and how it was <mark>Kraft</mark> that backed Goodell during the uproar over how the league handled the <mark>Ray Rice</mark> domestic assault scandal. According to the story, when the <mark>Rice</mark> case began to spin out of control, it was <mark>Kraft</mark> who arranged for Goodell to do his first on-air interview, on CBS with a woman as the interviewer. It was also <mark>Kraft</mark> who lobbied other owners to publicly support Goodell. Goodell and <mark>Kraft</mark> were so close, at least one NFL executive refers to <mark>Kraft</mark> as\" the assistant commissioner. \"<mark>Kraft</mark> was also the owner who\" vigorously defended \"Goodell's $44 million salary. The relationship between <mark>Kraft</mark> and Goodell was further cemented in the public eye when the two were photographed together at a party just days prior to the AFC Championship game. This #WrapPoll: The next dinner party involving Bob <mark>Kraft</mark> & Goodell is gonna be awkward because...But then the league discovered that the Patriots used deflated footballs during the AFC Championship game, There have been several recent incidents, some more telling than others, that when taken on their own can be easily explained away. But when the incidents are viewed as a whole, they suggest that Goodell has lost his most important ally. Here is a rundown <mark>Kraft</mark>'s recent actions: Prior to one of coach Bill Belichick's Super Bowl press conferences, <mark>Kraft</mark> made a surprise appearance and demanded an apology from the NFL if they are unable to prove that the Patriots intentionally deflated the footballs, noting that he is\" disappointed in the way this entire matter has [been] handled. \"<mark>Kraft</mark> was a no-show to Goodell's pre-Super Bowl state-of-the-league address, a move considered unusual for an owner of one of the team's in the Super Bowl, especially one so close to the commissioner (). After being handed the Lombardi Trophy following the Super Bowl, <mark>Kraft</mark> did not acknowledge the commissioner at all, something that raised the eyebrows of many. Mike Reiss, who covers the Patriots for ESPN.com and whom <mark>Peter King</mark> of SI.com calls\" well-plugged-in, \"recently wrote that it appears that the relationship between Goodell and <mark>Kraft</mark>\" is not in a good place \"and the biggest issue is the leaks that came from Goodell's office .\" My sense is that <mark>Kraft</mark> feels stung by Goodell, who he had backed in the wake of the mishandled <mark>Ray Rice</mark> domestic violence case, \"Reiss wrote for ESPN.com .\" The longstanding relationship between the two is not in a good place based on the league's handling of the team's under-inflated footballs and specifically public leaks. For perhaps the first time, I sense <mark>Kraft</mark> is doubting Goodell's leadership, and if Goodell loses one of his top supporters I wonder how much it could threaten his hold on the job. \"NFL commissioner Roger Goodell could be losing his biggest supporter because of\" Deflategate' and his job suddenly looks less secure NFL commissioner Roger Goodell could be losing his biggest supporter because of \"Deflategate' and his job suddenly looks less secure These articles have been shared on your timeline. You can remove them here: These articles have been added to your Google activity log. You can remove them here: THE PAYMENTS ECOSYSTEM: The Players And Trends That Are Reshaping The Industry THE APP-STORE MARKETING REPORT: App-Store Competition At An All-Time High THE NATIVE-ADVERTISING REPORT: Spending Trends, Format Breakdowns, And Audience Attitudes * Copyright © 2015 Business Insider Inc.. All rights reserved.", "articleID": "2015020319_00020432_W", "names": {"Peter King": ["Q15840165", "Q16104898", "Q2076274", "Q21063831", "Q22005836", "Q52534076", "Q52892721", "Q7175195", "Q7175199", "Q7175200", "Q7175201", "Q7175202", "Q7175203", "Q953554"], "Ray Rice": ["Q1523516", "Q23823439"], "Richard Sherman": ["Q16205086", "Q2947411"], "Robert Kraft": ["Q43159129", "Q591632", "Q706686", "Q7346461"]}}, {"date": "2015-01-26", "url": "http://embedded-computing.com/news/updated-brochure-product-catalog-available-dataforth/", "content": "Dataforth has just published two revised and updated MAQ20 Industrial Data Acquisition & Control documents: a 4-page brochure and the 32-page 2015 Product Catalog. The Brochure presents an overview of the MAQ20 system, which consists of high performance, DIN rail mounted, programmable, multi-channel, and industrially rugged signal conditioning input and output modules and communications modules. www.dataforth.com/catalog/pdf/MAQ20_brochure.pd [...] The Product Catalog provides detailed descriptions, block diagrams, specifications, and ordering information for each of the module types, as well as a system overview. \"The MAQ20 system is so flexible and powerful,\" says <mark>Bob Smith</mark>, VP of Sales and Marketing. \"We will be introducing new modules in coming months and will continue to enhance and grow the system for years to come .\" www.dataforth.com/catalog/pdf/MAQ20_Catalog.pdf The high performance MAQ20 offers the industry's lowest cost per channel, integral PID loop control, and ± 0.035% system accuracy (module dependent). It is ideal for test and measurement, factory and process automation, machine automation, military and aerospace, power and energy, environmental monitoring, and oil and gas applications. One MAQ20 communications module can interface to up to 24 I/O modules to construct a system with a maximum of 384 channels that fits within a standard 19 \"instrumentation rack. Modules mount on the industry standard 35x7 .5 mm gull-wing DIN rail; a backbone mounts within the rail to provide power and communication interconnections between the communications modules and each I/O module. • Communications Modules, which are offered in Ethernet, RS-232, RS-485, and USB with host application software interfacing to the system using Modbus TCP or Modbus RTU protocol • Analog Input Modules, which interface to a wide range of standard industrial sensors and equipment and offer up to 16 channels of input, each of which can be independently configured; signal ranges are user selectable and offered in differential and single-ended configurations - RTD and Potentiometer input modules • Analog Output Modules, which drive valves, perform other crucial process operations, and provide up to eight channels of output that can be independently configured • Discrete Input/Output Modules, which provide multiple channels of input and output per module and offer advanced special functions as well as alarm capability • System Backbone, which resides within the DIN rail used for module mounting and provides power to and interface between the communications module and the I/O modules Two dedicated software packages are offered for the system: the easy-to-use ReDAQ Shape for MAQ20, which is ideal for data acquisition, monitoring and control applications, and the advanced, intuitive IPEmotion, which was designed specifically for industrial and R & D applications and represents the next step in test & measurement. Both softwares provide the MAQ20 with leading-edge PID loop control. Additional advanced features include alarms, counters, timers, and PWMs. Like all Dataforth products, the MAQ20 system ensures exceptional isolation, protection, accuracy, and reliability. MAQ20 modules provide 1500Vrms channel-to-bus isolation, up to 240Vrms continuous field I/O protection, and ANSI/IEEE C37 .90.1 transient protection. They are meant for installation in Class I, Division 2 hazardous locations and have a high level of immunity to environmental noise commonly found in heavy industrial environments. All MAQ20 modules are Heavy Industrial CE Compliant. Dataforth was established in 1984 and is the world leader in data acquisition and control, signal conditioning, and data communication products for industrial applications. Worldwide, our products provide rugged signal and data integrity and wide spectrum accuracy. All Dataforth products are manufactured in the USA and have been RoHS Compliant since 2006. The Dataforth Quality Management System is ISO9001:2008 registered.", "articleID": "2015020319_00065237_W", "names": {"Bob Smith": ["Q1173492", "Q19577917", "Q20710739", "Q20710756", "Q28803422", "Q2907827", "Q4934018", "Q4934021", "Q4934022", "Q4934024", "Q4934025", "Q4934026", "Q51644740", "Q888261"]}}, {"date": "2015-02-04", "url": "http://mtairynews.com/news/home_top-news/151673635/City-may-take-over-tourism-funds", "content": "Those funds, which come from a 6 percent occupancy tax on rentals at local lodging establishments, represent a growing pot of money some city officials believe there should be greater municipal control over, based on discussion at a planning retreat last week. As it now stands, all that money - including $360,000 budgeted for this fiscal year - is collected by the city government but paid quarterly to a group known as the Mount Airy Tourism Development Authority (TDA). The TDA governing board then spends at least two-thirds of the funds on advertising and marketing of the area, with about one-third available for infrastructure projects such as a recent effort to convert the Earle Theatre to a digital facility. The TDA uses all the money as it sees fit, but in accordance with state legislation enacted years ago specifically permitting the collection of the occupancy tax here. Shirley Brinkley, a member of the Mount Airy Board of Commissioners - and also the TDA board - believes the city government itself should start getting some of the occupancy tax revenues. She mentioned other towns where occupancy taxes are levied, which collect all the proceeds then delegate money for tourism-related expenditures. \"We give 100 percent, which not a lot of cities do,\" the commissioner said of delegating the money to another entity. A different arrangement should be considered in Mount Airy, according to Brinkley, whose sentiments were echoed by Commissioner Jon Cawley. \"I think it made sense when it was $100,000 (per year), but it has grown,\" Cawley said of the present system that now involves significantly more money. Although the city budget reflects occupancy tax revenues of $360,000 for the 2014-2015 fiscal year, the final figure probably will be higher, city Finance Director Pam Stone said. She said it could total $400,000 - \"which is a good indicator that people are traveling .\" For the first five months of the fiscal year, through November, the revenues were up 10 percent over the same period in 2013. Cawley said he believes local citizens should be benefiting more from those funds. Changing Mount Airy's procedure of occupancy tax collection and dispensing would require special action by the N.C. General Assembly, according to City Attorney <mark>Hugh Campbell</mark>. That's because occupancy tax legislation is specific to each locality, he explained, including how the money is to be distributed and who can remit those funds and how. There was support at the retreat for seeking the required legislative change in Raleigh and Brinkley reiterated that Wednesday. \"Absolutely,\" she said. Brinkley emphasized during the retreat discussion that her desire to change the occupancy tax set-up does not signal any dissatisfaction with those who now administer the proceeds. \"This is not 'cause you're mad at anybody, or trying to create a mess,\" she said. It is simply a matter of the city needing to tap into additional revenue sources to meet several pressing needs, Brinkley said. Also discussed at the retreat was the possibility of an event fee that would be charged when organizations hold fund-raising walks or similar activities that require police and other services. Such a fee was first discussed a couple of years ago, but never materialized. Along with balancing the regular city budget, Mount Airy officials have been asked to fund a new fire truck, add parking at Reeves Community Center, develop a shell building to better attract industry and other projects in the next fiscal year. One target of TDA funding could be the redevelopment of the former Spencer's industrial site in downtown Mount Airy, Brinkley said. This might include funding a conference center that local tourism representatives have said would boost visitation here. Brinkley indicated that her position on the occupancy tax is bound to ruffle feathers - even with the group of which she is a member. \"I'm on the TDA board now,\" she said. \"But I may get kicked off after this .\" ", "articleID": "2015020423_00042892_W", "names": {"Hugh Campbell": ["Q14950666", "Q20676192", "Q21165079", "Q23583443", "Q43913059"]}}]