[{"articleID": "2017122400_00161411_W", "names": {"Shu Zhang": ["Q45385081", "Q45603848", "Q58662161", "Q59140667", "Q59549816"], "Wang Chao": ["Q3566047", "Q44952317", "Q45365235", "Q45429277", "Q45445341", "Q45482742", "Q45492396", "Q45510573", "Q45519116", "Q45520872", "Q45546830", "Q45558060", "Q45590542", "Q45593175", "Q45596084", "Q45609163", "Q45615236", "Q45617896", "Q45617958", "Q45618020", "Q45644529", "Q45647133", "Q45680319", "Q58234725", "Q7967378", "Q835832"], "Wang Jing": ["Q19602484", "Q30122604", "Q45359416", "Q45373540", "Q45429838", "Q45429962", "Q45433500", "Q45442900", "Q45443143", "Q45444482", "Q45445040", "Q45445465", "Q45448138", "Q45449611", "Q45461277", "Q45462687", "Q45465055", "Q45465853", "Q45471607", "Q45471925", "Q45474233", "Q45476816", "Q45476880", "Q45476943", "Q45483293", "Q45484784", "Q45488674", "Q45495675", "Q45497293", "Q45498258", "Q45501441", "Q45508092", "Q45508940", "Q45509036", "Q45512327", "Q45513671", "Q45517650", "Q45519168", "Q45524153", "Q45527504", "Q45527758", "Q45533434", "Q45535632", "Q45538425", "Q45539920", "Q45541960", "Q45542322", "Q45542879", "Q45545798", "Q45548812", "Q45552751", "Q45553378", "Q45557208", "Q45558894", "Q45560505", "Q45560688", "Q45562641", "Q45568743", "Q45572623", "Q45572685", "Q45573048", "Q45573960", "Q45575036", "Q45575898", "Q45582090", "Q45582609", "Q45584134", "Q45584388", "Q45589265", "Q45591270", "Q45593471", "Q45594426", "Q45598717", "Q45601711", "Q45603079", "Q45604375", "Q45605129", "Q45608160", "Q45616251", "Q45619266", "Q45621392", "Q45624759", "Q45632449", "Q45634709", "Q45635869", "Q45638924", "Q45640157", "Q45645833", "Q45646828", "Q45647657", "Q45648190", "Q45653570", "Q45654870", "Q45660728", "Q45660787", "Q45660848", "Q45664376", "Q45671654", "Q45677446", "Q45679032", "Q45682963", "Q45696268", "Q45698199", "Q45706724", "Q707336", "Q7967484", "Q7967486"]}, "date": "2017-12-24", "url": "http://ca.reuters.com/article/businessNews/idCAKBN1EI001-OCABS", "content": "December 24, 2017 / 12:07 AM / in 5 minutes An investor's best friend: China's booming pet market sparks deals Anita Li, Adam Jourdan 7 Min Read PINGYANG, China/SHANGHAI (Reuters) - Li Mingjie is a pet industry investor's dream. The 23-year-old e-commerce worker spares little expense to make his pooch happy. Pet dog Duoduo walks into Cute Beast Pet Resort in Beijing, China December 22, 2017. Picture taken December 22, 2017. REUTERS/Jason Lee \"I'll happily splash out on my dog,\" Li told Reuters as he walked his brown poodle Coco in Pingyang, a town on China's east coast. \"She is like a child to me .\" He is far from alone in China these days. The growth in the middle class, a massive move to urbanization and other demographic changes - such as growing numbers of elderly, and people getting married and having children later than before - have been turning this into not just a pet-owning society but also one that is prepared to lavish money on them. Chinese shoppers are set to spend 46.3 billion yuan ($7 billion) on their pets by 2022, up from 17.5 billion yuan this year as the market grows at around an annual 20 percent, according to estimates from Euromonitor. The U.S. market may be much bigger with an estimated $44.4 billion in sales this year but it is only growing around 2 percent a year. The surge in Chinese demand is not only great news for global pet food behemoths such as Mars Inc and Nestle SA NESN. S, but also rapidly growing Chinese pet food and product companies, as well as entrepreneurs setting up everything from dog salons for grooming to fancy pet hotels. It is an amazing shift in a country where owning pets was once banned for being too much of a bourgeois pursuit under revolutionary leader Mao Zedong, and where - despite protests - there is still an annual dog-meat festival in the southern Chinese town of Yulin. \"There is huge growth potential in the Chinese market,\" said Liu Yonghao, the chairman of Chinese company New Hope Group [NWHOP. UL] at a recent event in Beijing, noting that younger people especially were developing closer bonds with their pets. \"They are willing to spend lots of money on the pets because they have become like part of the family,\" he said. New Hope joined a consortium, including Singapore's state-owned fund Temasek and private equity firm Hosen Capital that just closed a $1 billion deal to acquire Australian pet food maker Real Pet Food Co, with the aim of bringing the firm's brands to China. The growing popularity of pets is turning China into a magnet for local and global firms. Thomas Kwan, chief investment officer of Hong Kong-based fund manager Harvest Global, said China's pet market would be one of his personal picks for 2018 as consumers looked to shift up to premium products. The questions pet owners are asking now: \"Can you buy them healthy foods? Can you give them a good lifestyle?\" he said. BONE-SHAPED CENTER Pingyang, where Li lives with his poodle, has big ambitions in China's pet economy. The county, which is near the wealthy city of Wenzhou and has a population of almost one million, is among a slew of places responding to Beijing's call to create 1,000 \"specialty towns\" by 2020 in industries from cloud computing to chocolate. In Pingyang's case the theme is pets. It has a dog bone-shaped visitor center and pet factories, while locals said there were plans for pet-themed hotels and a retail hub. On a recent visit, though, it was clear the concept has a way to go. The visitor center was shut and locals admitted the \"pet town' had yet to fully catch on. Nationally though, there is no doubt that the pet economy is thriving--helped by demographic shifts .\" Chinese society is aging, we're experiencing declining birth rates, we have empty nesters and the youngsters from those empty nests, \"said <mark>Zhang</mark> Tianli, co-founder of Hosen Capital, adding pets were helping people find\" spiritual sustenance \". The pet products boom has stoked imports and boosted local business. Among the Chinese companies that are now challenging the global giants, in China at least, are Shanghai Bridge Petcare, Sunsun Group and Navarch. Yantai China Pet Foods 002891. SZ has seen its stock climb close to 60 percent since it listed in Shenzhen in August. Smaller entrepreneurs abound too. They include DogWhere.com, which offers pet holidays and runs a boutique pet hotel in Beijing with all sorts of amenities for the pets - including a swimming pool, pet-sized bedrooms and a cinema. Owners can spend thousands of dollars per stay .\" We once looked after a dog in our hotel for 47 nights, at a total costs of 17,000 yuan ($2,585), \"said the platform's marketing manager <mark>Wang Chao</mark>. Xiao Xudong in Beijing runs a popular grooming service for\" Westies \"- West Highland White Terriers - and says his increasingly youthful clientele fly in from regions as remote as far-western Xinjiang and the southwestern Yunnan province .\" Young people hold a different consumption view to the older generations, \"said Xiao, 45 .\" They think a lot about how their pets are groomed and are willing to splash out on them. \"PET BATHING Despite the growth, Chinese pet ownership is still just getting started. Some pets are mistreated and there is a lack of know-how about vaccinations and sterilization. Strict rules about pet food imports also stoke a gray market trade. Earlier this month, police arrested gang members who were selling poisoned darts used to kill dogs that were then sold to restaurants, the official Xinhua news reported, opening the debate once more about the practice of eating dog meat. Back in Pingyang's state-sanctioned pet town, the owner of one pet shop said the shift towards pet ownership was nonetheless stark .\" Ten years ago this place was basically farmland and people were eating dogs, now they don't eat them as much and have started to see them as pets, \"he said. In the shop, <mark>Wang Jing</mark>, 26, was getting her two dogs - Can Can and Niu Niu - their regular bath. She said she spent around 2,000 yuan a month on them, mostly on food, but that it was all worth it when she arrived home each day .\" Otherwise when you come back there's nobody there, \"she said .\" But if you have a dog then it jumps on you happily as soon as you open the door. \"Reporting by Anita Li in PINGYANG, Hallie Gu in BEIJING and Adam Jourdan in SHANGHAI; Additional reporting by SHANGHAI newsroom, Lusha <mark>Zhang</mark> and <mark>Shu Zhang</mark> in BEIJING; Writing by Adam Jourdan; Edited by Martin Howell 0: 0"}, {"articleID": "2017122121_00165968_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}, "date": "2017-12-21", "url": "http://www.newsmax.com/us/donald-trump-walter-reed-visit-soldiers/2017/12/21/id/833201/", "content": "Trump Swings by Walter Reed to Visit With Soldiers (Andrew Harrer/Getty Images) By Jason Devaney | Thursday, 21 Dec 2017 04:03 PM Close A A President Donald Trump visited soldiers at Walter Reed National Military Medical Center Thursday afternoon via a short helicopter flight on Marine One. Trump arrived at the facility shortly before 3 p.m., according to a pool report. Prior to leaving the White House, he promised to wish soldiers there a Merry Christmas. \"Merry Christmas, everybody. I'm heading over right now to Walter Reed Medical Center to say hello to some of the bravest people anywhere in the world. They're great people,\" Trump said. \"I will be over there for a while. Just gonna wish them a Merry Christmas, Happy New Year. We love those people .\" According to White House Chief of Staff <mark>John Kelly</mark>--a retired Marine general--joined Trump on his visit. The Hill, Walter Reed is located in Bethesda, Maryland, a drive of less than nine miles from the White House. Related Stories:"}, {"articleID": "2013042607_00060022_W", "names": {"Niall Quinn": ["Q335831", "Q7023953"]}, "date": "2013-04-26", "url": "http://hartlepoolmail.co.uk/sport/football/sunderland-afc/sunderland-boss-paolo-di-canio-faces-aston-villa-backlash-after-swindon-incident-1-5619327", "content": "sunderland boss paolo di canio faces aston villa backlash after swindon incident having his say: the then swindon town manager paolo di canio reacts to aston villa's fans at the end of the game at the county ground paolo di canio can expect a hot reception next week from aston villa fans who feel they were taunted by the colourful italian on their last meeting. villa fans were incensed last october after the premier league side beat swindon 3-2 in the capital one cup at the county ground to see di canio approach them and seemingly suggesting swindon would be going up this season and villa would be relegated. but di canio insisted that that was not the case and he was merely praising robins' fans for the quality of their support in an eventful cup tie. the then swindon boss had watched his side storm back from a 2-0 deficit to level, only for villa striker christian benteke to score a match-winner to send his team into the last eight of the competition. and when the subject was raised post-match about villa supporters' fury at what they saw as baiting, he insisted: \"no, that was not the case .\" i was saying to my fans that they had been brilliant and their support was so good that they were up there and villa were below them. \"to see the county ground full of emotion when we scored the second goal was amazing .\" i was saying it was my fans that are the top and they are underneath you. \"sunderland will stay up says former striker and chairman <mark>niall quinn</mark> sunderland fans'\" paolo' mints gift to horse punched by newcastle fan video: easington club sings \"ding dong! the witch is dead' on margaret thatcher's funeral day hartlepool hospital's service boost as councillor calls for more to be maintained temperature: 2 c to 10 c wind speed: 17 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. hartlepool mail provides news, events and sport features from the hartlepool area. for the best up to date information relating to hartlepool and the surrounding areas visit us at hartlepool mail regularly or bookmark this page. can i opt out of receiving cookies? cookies are small data files which are sent to your browser (internet explorer, firefox, chrome etc) from a website you visit. they are stored on your electronic device. this is a type of cookie which is collected by adobe flash media player (it is also called a local shared object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. however, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. the types of cookies we, our ad network and technology partners use are listed below: a tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. to opt out of this type of targeting you can visit the\" your online choices' website by clicking here. google ads? our sites contain advertising from google; these use cookies to ensure you get adverts relevant to you. you can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"your online choices' website by clicking here. webtrends / google analytics? this is used to help us identify unique visitors to our websites. this data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. dart for publishers? this comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. this information is not used by us for any other type of audience recording or monitoring. comscore? comscore monitor and externally verify our site traffic data for use within the advertising industry. any data collected is anonymous statistical data and cannot be traced back to an individual. local targeting? our classified websites (photos, motors, jobs and property today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. these cookies store no personally identifiable information. grapeshot? we use grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. grapeshot stores the categories of story you have been exposed to. their privacy policy and opt out option can be accessed here. subscriptions online? our partner for newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. add this? add this provides the social networking widget found in many of our pages. this widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. temperature: 2 c to 9 c wind speed: 20 mph temperature: 3 c to 11 c wind speed: 22 mph temperature: 3 c to 11 c wind speed: 26 mph temperature: 3 c to 11 c wind speed: 16 mph"}, {"articleID": "2020012922_00001054_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}, "date": "2020-01-29", "url": "http://www.deccanherald.com/national/congress-alleges-poll-code-violation-by-pm-modi-asks-ec-to-take-note-799535.html", "content": "Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Family Finance Technology DH Wheels Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Videos Latest Videos Bengaluru Karnataka People Popular Features Metrolife Entertainment Travel Spectrum Sunday Herald Living DH Education Specials Insight Point Blank Sunday Spotlight Newsletter Get the best of news in your inbox everyday GET IT Thursday 30 Jan 2020 updated: 3:23 am IST E-Paper Classifieds BLR 19 ° C Mist Sensex: 41198.66 +231.8 Nifty: 12129.5 +73.7 Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Top Stories Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Family Finance Technology DH Wheels Assembly Elections 2019 World Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Metrolife Your Bond With Bengaluru Cityscape On The Move Lifestyle Videos Latest Videos Bengaluru Karnataka People Popular Entertainment DH Showtime Entertainment News DH Talkies Arts, Books & Culture Specials Insight Point Blank Sunday Spotlight Travel Spectrum Top Stories Statescan Living Front Page Health 'n' Well-Being Fashion Folio Food Fiesta Sunday Herald SH Top Stories Entertainment Articulations Art & Culture Melange Books Photos Pics of the Day DH Galleries 70 Years of DH My Take Your Space DH Education E-Paper Newsletter IN BRIEF: A microcosm in a macrocosm BJP MP claims was \"threatened'\" Give befitting reply to AAP' Rahul Gandhi backs Kunal Kamra Centre tweaks abortion law UK set to leave on January 31 Home National Congress alleges poll code violation by PM Modi Congress alleges poll code violation by PM Modi Congress alleges poll code violation by PM Modi, asks EC to take note X Share via Share permalink PTI, New Delhi, Jan 30 2020, 03:23 am ist updated: Jan 30 2020, 03:23 am ist The Congress on Wednesday alleged that Prime Minister Narendra Modi has violated the poll code by addressing an NCC rally a day before and urged the Election Commission to take note. Congress leader Prithviraj Chavan said it does not behove the prime minister to make such remarks to impressionable minds while addressing the NCC rally on Tuesday here. The Congress leader also raised questions over the credibility of the poll panel. \"We have got serious questions about the impartiality of the Election Commission,\" Chavan told reporters. On two BJP leaders who have been removed by the Election Commission from the list of star campaigners, he said, whatever BJP does, it is for the poll panel to take it up with the BJP leadership but we would like to raise the issue of Prime Minister's speech at the NCC rally. \"Election (campaign) is going on in Delhi and the prime minister's speech in the NCC rally, particularly to the young minds, I deplore that wholly and I request the Election Commission to take it up seriously .\" Just because he is the prime minister, he should not violate the rules. He cannot violate the guidelines of the Election Commission, \"he said. Chavan also welcomed the EC order against two BJP leaders, but remained critical of the prime minister's remarks at the NCC rally .\" Whatever the prime minister has said violated the model code. Whatever the PM has said to the young impressionable minds, I feel it does not behove the prime minister to say such things, \"he said. Addressing the Annual Prime Minister's National Cadet Corps (NCC) Rally 2020, Modi had on Tuesday said his government brought in the Citizenship (Amendment) Act to correct\" historical \"injustices and recalled the Nehru-Liaquat pact to assert that the law fulfils India's\" old promise \"to religious minorities in neighbouring countries. Modi had also said the Jammu and Kashmir problem had persisted since Independence with some families and political parties keeping issues in the region alive. This had resulted in terrorism thriving, he had said. He had also slammed Pakistan and said it lost three wars but continues to wage proxy wars against India. Union Budget 2020 | Get the latest updates, expert views & analysis only on DeccanHerald.com Click here for full coverage of Budget 2020 Deccan Herald News now on Telegram - Click here to subscribe DH Newsletter Privacy Policy Get top news in your inbox daily GET IT Congress Election Commission of India BJP Narendra Modi Prithviraj Chavan 0 Comments (+) Related stories Cong seeks action against youths who threatened Khader...Delhi polls: AAP seeks 48-hour campaigning ban on <mark>Shah</mark>... BJP MP claims to have received two threat calls...Vote for BJP for women's respect, says Smriti Irani...BBMP's volte-face over naming traffic circle after Tipu...Coward leveraging his influence: Rahul backs Kamra DH Picks Ace badminton player Saina Nehwal joins BJP Govt shield for PSU bankers taking\" genuine' decisions...Featured Content Chemical-Free, Fresh & No Fishy Business: Your complete guide...Armed man threatens Shaheen Bagh protesters to end stir...Australia may help combat deadly coronavirus IndiGo suspends Kunal Kamra from flying for six months...Featured Content You can play the ₹ 28 billion American Powerball...Featured Content How Trading with Olymp Trade Can Change Your Life...social feed What does your star sign say? Explore National Politics North and Central South East and Northeast West Karnataka Top Stories Politics Districts Bengaluru Top Stories Bengaluru Crime Politics Infrastructure Life in the City Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Budget 2019 Family Finance Technology DH Wheels Multimedia Videos Photos Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Entertainment Entertainment News DH Talkies Arts, Books & Culture Delhi Assembly Elections 2020 Budget 2020 Latest News CAA Protests China's Wuhan Virus 2012 Delhi rape case DH Picks Ace badminton player Saina Nehwal joins BJP Govt shield for PSU bankers taking \"genuine' decisions Armed man threatens Shaheen Bagh protesters to end stir Australia may help combat deadly coronavirus IndiGo suspends Kunal Kamra from flying for six months Latest stories Congress alleges poll code violation by PM Modi A microcosm in a macrocosm Cong seeks action against youths who threatened Khader\" Trump to visit Sabarmati Riverfront during India trip' 2013 rape case: Quantum of sentence likely on Jan 30 Trending news History will spit on this animal: Kashyap to <mark>Amit Shah</mark> Bengaluru: Dead lines of Namma Metro Nagpur woman raped, rod inserted in her private parts NPR causes panic among Muslim bank customers in TN Republic Day: What is its significance? Services About Epaper Newsletter Archives Sitemap Classifieds Contact Our group sites Printers Mysore Prajavani Sudha Mayura Privacy Policy Terms Disclaimer © 2020 The Printers (Mysore) Private Ltd.. X Share via Share permalink We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. Learn more I agree X We use cookies. Learn more X"}, {"articleID": "2012080813_00039576_W", "names": {"Dewayne Bunch": ["Q5268108", "Q5268110"]}, "date": "2012-08-08", "url": "http://wtvq.com/entertainment/story/No-new-album-from-Timberlake/6IG1P6wapUevtyUmFI-W8A.cspx", "content": "a rep for justin timberlake confirms the singer is in the studio recording tracks but it's not for a new timberlake album. timberlake has stepped away from music after his last album, 2006's futuresex/lovesounds, to concentrate on launching a career as an actor, with roles in bad teacher and friends with benefits, but he continued to dabble in recording, releasing collaborations with stars including t.i. and madonna. in 2011, timberlake insisted he had no immediate plans to release another album, but producer jim beanz revealed the former 'n sync star is currently working on tracks with fellow producer timbaland. beanz, who has worked with britney spears and nelly furtado, tells digital spy, \"when i get back to the states, i'm going to be helping out on...the justin timberlake project. it's still in the early stages, but they have a lot of tracks. while i've been over here in the u.k, they've been working, so by the time i get back they'll have a whole load of ideas and i'm going to have to catch up! he has some crazy, crazy stuff .\" police: man arrested for keeping children in filthy living conditions the laurel county sheriff's office arrested a man after finding his children in living conditions they called \"not safe for children .\" teens originally charged in <mark>dewayne bunch</mark> case scheduled back in court"}, {"articleID": "2011032117_00078097_W", "names": {"Tony Sheldon": ["Q7823394", "Q7823395"], "Nick Adams": ["Q3339702", "Q41787493", "Q7026686", "Q7026687", "Q7026688"], "Stephen Elliott": ["Q1125100", "Q56506567", "Q7609142"], "Alice Springs": ["Q15220322", "Q274518", "Q52353825"]}, "date": "2011-03-21", "url": "http://variety.com/article/VR1118034175?categoryid=4140&cs=1&cmpid=RSS|News|LatestNews", "content": "\"priscilla' preems\" queen' bows in gotham actors <mark>tony sheldon</mark>, will swenson, and <mark>nick adams</mark> attend the curtain call of the broadway opening night performance of \"priscilla queen of the desert the musical .' actor guy pearce, producer liz koops, and writer <mark>stephen elliott</mark> it was aussies, drag queens and ping pong at sunday's opening night party for\" priscilla queen of the desert. \"pier 60 was fitted out like the <mark>alice springs</mark> casino that is the destination of the tuner's trio of female impersonators, and seemingly everyone had a boa, an accessory that was deemed, in the words of one partygoer,\" like snap-on gay. \"for star <mark>tony sheldon</mark>, this makes opening night no. 7 in his long attachment to the show. turns out the night's crowd of legiters was tough to win over at first. as he put it to one of the tuner's producers,\" i said to bette midler, \"god, it was a tough room at the start .' but we had you by the second act .\" "}, {"articleID": "2018072604_00032779_W", "names": {"James Moore": ["Q16231821", "Q1680851", "Q21099520", "Q28444878", "Q3161289", "Q3806683", "Q48815536", "Q6139963", "Q6139968", "Q6139971", "Q6139973"], "Brian Mckenna": ["Q20090341", "Q2924955"], "Jason Holt": ["Q18044104", "Q57196134", "Q6162724"]}, "date": "2018-07-26", "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/james-moore-biddulph-brindley-ford-1820180", "content": "News Terrifying ordeal of \"screaming' girl, 13, sexually assaulted on cycle path by this pervert Sex offender had approached a 28-year-old woman just an hour earlier Share By Stoke-on-Trent Live 05:00, 26 JUL 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Get Daily updates directly to your inbox + Subscribe See our privacy notice Thank you for subscribing! Could not subscribe, try again later Invalid Email Pervert <mark>James Moore</mark> grabbed a 13-year-old girl before sexually assaulting her as she cycled away from a park. The victim - who was with a younger child at the time - suffered\" significant psychological harm' and is now afraid to play outside following the terrifying incident near Brindley Ford park. It happened just an hour after a 28-year-old woman fled when <mark>Moore</mark> approached her and asked if she had a boyfriend. Now the 28-year-old defendant - who has 40 previous convictions - has been handed a 26-month prison sentence after pleading guilty to the sexual assault and riding a motorbike while disqualified. Stoke-on-Trent Crown Court heard last year's incident happened on a bridge across Whitfield Greenway. Read More Bogus security guard who opened shutters to reveal this massive cannabis factory told cops: \"This will make your day' <mark>James Moore</mark> has been sentenced to 26 months Prosecutor <mark>Brian McKenna</mark> said:\" The two children saw the defendant standing on the bridge next to a motorbike. As they passed him he asked the girl if she had a boyfriend and she said that she didn't and moved on. Read More Man dragged his partner though the streets by her HAIR - after they accused each other of being unfaithful \"He then grabbed his victim around the waist with one hand and held her as she tried to wriggle free. He placed his other hand down her leggings for a few seconds. He let her go and the two rode off and were shaken. They called for help and police were contacted. The victim had been at Brindley Ford Park\" The defendant was arrested the following day. He made no comment in his interview and denied any sexual touching. But they held an identification parade and he was picked. The victim's clothing was sent off for analysis and it showed the defendant's DNA on the inside of her leggings. \"<mark>Moore</mark>, of St John's Road, Biddulph, also admitted failing to appear in court last month. Read More This paedophile groomed a schoolgirl before putting hand down her pyjama bottoms <mark>Jason Holt</mark>, mitigating, said:\" It is certainly behaviour that's bizarre in the extreme. This was someone under the influence of a substance and drink behaving in an erratic way. He was not planning on assaulting people and he was not targeting young people. \"<mark>James Moore</mark> was on a bridge near the park The court heard the girl was\" screaming' when she contacted her mum. Read More Handyman caught with knuckle duster in his man bag tells court: \"It was a souvenir' Judge Paul Glenn said:\" The girl's statement is quite moving and no girl of her age should feel like that. She speaks of feeling unsafe and fearful even when playing out in the street. She must have been terrified at both the time and during the aftermath. She will have suffered significant psychological harm. \"<mark>Moore</mark> was also handed a 12-month driving ban which will take effect when he is released from prison. Like us on Facebook Follow us on Twitter Daily Newsletter sentinelstaffs Follow @ Sotlive Subscribe to our Daily newsletter Enter email Subscribe More On Stoke-on-Trent Crown Court Biddulph Crime Courts"}, {"articleID": "2015121519_00351577_W", "names": {"Ken Burns": ["Q1106967", "Q616886"]}, "date": "2015-12-15", "url": "http://www.adweek.com/fishbowldc/weta-and-wbal-win-dupont-awards/152281", "content": "Washington public television station WETA and Baltimore's WBAL are among the 16 winners of the Alfred I. duPont-Columbia University Awards, announced this morning by NBC News special correspondent Tom Brokaw. The annual award recognizes broadcast, documentary and digital works that are well-crafted, well-reported and serve the public interest. WETA wins for a <mark>Ken Burns</mark> - produced, Barak Goodman - directed documentary series that examines the history, science and politics of cancer, as well as the lived experience of the people and families it affects. The series takes its name and inspiration from Siddhartha Mukherjee \"s book The Emperor of All Maladies. WBAL is honored for its breaking news coverage following the death of Baltimore resident Freddie Gray from injuries sustained under police custody .\" Investigative reporter Jayne Miller led the way locally and nationally on the investigation into what happened to Freddie Gray. Gray was arrested and injured on April 12, 2015. Miller immediately started questioning the official story, \"reads the citation .\" Her exemplary reports raised important questions about probable cause, police policy, and accountability. Miller asked probing, smart questions and followed up with clear analysis of a fast changing story. \"This year the committee also handed out its first ever award to a podcast, to WBEZ and This American Life for the first season of\" Serial. \"The Jan. 19, 2016 awards ceremony will take place in New York at Columbia University, hosted by Tom Brokaw and ABC News Nightline anchor Juju Chang. A livestream will also be available."}, {"articleID": "2015110506_00037065_W", "names": {"Helly Nahmad": ["Q18748764", "Q23759490"], "Jasper Johns": ["Q155057", "Q16236800"]}, "date": "2015-11-05", "url": "http://www.morningstar.com/advisor/t/110745801/sotheby-s-auctions-a-377-million-portion-of-taubman-estate.htm", "content": "Sotheby's Auctions a $377 Million Portion of Taubman Estate Sotheby's Auctions a $377 Million Portion of Taubman Estate 11/05/2015 Sotheby's kicked off a major round of fall sales in New York Wednesday by auctioning a $377 million portion of the estate of its former owner, Michigan shopping-mall magnate A. Alfred Taubman. Sotheby's fought hard to win the consignment--guaranteeing the estate for a little over $500 million--and it heavily marketed the sale, the first of four to feature his holdings, as a memorial to Mr. Taubman's artistic taste. But spotty bidding and a few unsold pieces damped the mood in Sotheby's York Avenue saleroom, turning the night into a dogged jog more than a victory lap. The sale eked past the low bar of Sotheby's $375 million and $537 million expectations, but its total includes its fees, unlike its presale estimates. It remains to be seen whether the house will break even on its deal with Mr. Taubman's heirs, but Chief Executive Tad Smith said, \"We remain on track to cover most of the total guarantee .\" The star of the sale was \"Paulette Jourdain,\" Amedeo Modigliani's demure portrait of his dealer's housemaid and girlfriend, which sold to an Asian telephone bidder for $42.8 million, well over its $25 million estimate. Before the sale, dealer <mark>Helly Nahmad</mark> said the 1919 portrait looked like a bargain compared with some of the Italian modernist's other portraits that have sold for as much as $69 million. (Rival Christie's plans to ask $100 million for a Modigliani nude next Monday .) Sotheby's also sold a chartreuse-and-cherry-colored abstract by Willem de Kooning for $25 million, its low estimate. Mr. Taubman bought the work from a gallery a year after the artist painted it in 1976. Sotheby's also reset the auction high bar for Frank Stella when it sold his red geometric abstract, \"Delaware Crossing,\" for $13.7 million, over its $12 million high estimate. But a gray-black <mark>Jasper Johns</mark> abstract, \"Disappearance I,\" estimated to sell for $15 million didn't garner any bids, and no one wanted Edgar Degas's sensuous portrait of a nude woman brushing her red hair after taking a bath, \"Nude Woman, Back .\" It also carried $15 million estimate. Elsewhere in the sale, a pair of Mark Rothko abstracts met with so-so results: \"No. 6/Sienna, Orange on Wine\" selling for $17.6 million and \"Untitled (Lavender and Green)\" selling for $20.4 million. Both were estimated to sell for at least $20 million. What does Mr. Taubman's sale portend for the art market overall? Collectors and dealers will likely wait to see how Sotheby's fares Thursday with its impressionist and modern art sale before making any lasting rulings."}, {"articleID": "2012012017_00096489_W", "names": {"Phil Wilson": ["Q16734486", "Q2085745", "Q262201", "Q7182561", "Q7182562", "Q7182564", "Q7182565"], "Anthony King": ["Q20749328", "Q3618504", "Q4772882", "Q4772883", "Q4772884", "Q55099172"], "Jim Moore": ["Q16732815", "Q17378085", "Q22006996", "Q28444878"], "Richard Thomas": ["Q15431585", "Q15993570", "Q203314", "Q2150753", "Q22111480", "Q3431268", "Q492238", "Q51880914", "Q56598144", "Q56600036", "Q57895976", "Q7329442", "Q7329446"], "Charlie Phillips": ["Q19979363", "Q39073772", "Q5085394", "Q5085397", "Q55042162"]}, "date": "2012-01-20", "url": "http://odt.co.nz/your-town/queenstown/195071/chamber-members-warned", "content": "queenstown chamber of commerce president alastair porter has warned members they have little cause to expect an improvement in business this year. the property developer told the 68 members who attended the annual meeting at the skycity queenstown casino \"the one certainty in the world today is uncertainty\". \"it is enormously difficult to predict the future and while 2010 and 2011 have been difficult years for many businesses, there is little reason to expect 2012 to be a return to better times .\" in fact there are many reasons particularly from a resort perspective to be cautious and concerned. \"mr porter said he would have served as president for more than four years if re-elected this year. he indicated 2012 would be his final term as president if he was re-elected .\" strong organisations are those that keep introducing new leadership and i will accordingly encourage the chamber to find a new president beyond the 2012 [annual meeting], \"he said. mr porter said at the meeting last month that, as president, he placed strong emphasis on the chamber's core values. his view was those core values had never been more important .\" they are for queenstown chamber of commerce to be a catalyst for discussing business issues including bringing key speakers to queenstown, to be proactive in promoting members' interests, being innovative in terms of ways it can assist the economic development of queenstown and co-operating with other key organisations in the district and beyond. \"the chamber was represented last year in forums and meetings regarding parking and transportation, central business district security, labour market and immigration, the sustainable tourism advisers group, sister city committee, the rugby world cup working group and international tourism trade show trenz. special thanks were given to board members miles <mark>wilson</mark>, past-president, tourism industry identity and canterbury franchisee for queenstown, who completed his tenure, and <mark>anthony king</mark>, lawyer, accountant and new world wakatipu general manager, who stepped down due to new family commitments. board members for 2012 include mr porter as president, event director julie hughes, hotel general manager <mark>jim moore</mark>, publisher <mark>richard thomas</mark>, pharmacist kim wilkinson and lawyer <mark>phil wilson</mark>. of the four members who put their names forward, queenstown resort college chief executive <mark>charlie phillips</mark> was elected to the voluntary board. the board retained the constitutional option of co-opting a further three members. annual accounts find a\" relatively small loss in 2011 \", due to increased chamber activities. increasing subscriptions and more profitable activities in 2011-12 were expected to restore the chamber to profit in this financial year. chief executive ann lockhart told the meeting the chamber's membership had grown considerably, with 80 new members in the previous financial year. the total stood at 345 .\" it is my intention to further raise the membership to 400 by june 2012, \"ms lockhart said."}]