[{"articleID": "2012031903_00068021_W", "names": {"Alex Gordon": ["Q16025008", "Q16136145", "Q25352122", "Q37583452", "Q4717069", "Q4717072", "Q997395"]}, "date": "2012-03-19", "url": "http://ohio.com/news/top-stories/tomlin-shelled-in-loss-to-royals-1.275257", "content": "surprise, ariz.: first it was ubaldo jimenez. now it's josh tomlin. nobody expects perfection in spring training, but these two indians starters have been serious underachievers during exhibition season. tomlin made his second horrid appearance of the spring sunday (none of the four could be described as first-rate), giving up six runs on 10 hits, as he struggled through four innings throwing 66 pitches, 46 strikes. <mark>alex gordon</mark> homered off tomlin with a runner on base in the first inning, jeff francoeur doubled in the same frame, and alcides escobar tripled home a run in the third. not all of the hits were struck with authority, by any means. at least three were blooped over the heads of infielders. on the other hand, shin-soo choo made an excellent running catch of a drive to right that was headed for extra bases in the fourth inning. \"he threw some good pitches,\" manager manny acta said after the 6-4 loss to the royals. \"but nothing [hit] was in-between. everything was either over the outfielders' heads or in front of them .\" tomlin is not the kind of pitcher who gets in trouble because he walks the house. you have to hit your way on base against him, and the royals did just that. acta attributed the outing to unfortunate circumstances. \"it was a tough matchup for him,\" the manager said. \"he's a contact pitcher; he's not a strikeout guy, and the wind was blowing out. we knew it would be a tough day for him. he got his work in and that's enough. he's in our rotation .\" acta never fails to emphasize the importance of throwing first-pitch strikes, and tomlin is the kind of starter who knows he has to hit his spots and get ahead of hitters. sunday, he faced 20 batters and threw nine strikes on the first pitch. a few got hit, including <mark>gordon</mark>'s home run, a single and a foul ball. \"he's usually better than that, but it was a tough day to pitch,\" acta said. tomlin said earlier in the spring that opposing teams changed their approach against him in the second half of last season. because he throws so many strikes, batters began to swing early in the count, confident that they were going to get something to hit. when tomlin came to camp he considered making a change - that is, try to throw more to the corners on the first pitch or even try to make hitters chase something just off the plate. acta does not want him to go away from throwing first-pitch strikes, even if the hitters are swinging at them more often. \"i hope he doesn't get it in his head to change his approach, because he can't afford to get behind in the count,\" the manager said. \"he has to throw strike 1 .\" we continue to show our pitchers that over 90 percent of guys who swing at the first pitch make an out. so we don't want our guys to shy away from throwing a strike on the first pitch. we love it when they [opposing batters] swing at the first pitch. \"are there other reasons tomlin might have struggled sunday or in his previous starts? the dry arizona air straightens out the movement in pitchers' breaking pitches. moreover, the royals and rangers, the teams that tomlin faced in his past two outings, are among the top offensive clubs in the american league. in his start against texas last tuesday, tomlin gave up seven runs (four earned) and eight hits in three innings. of course, during the season, he will have to face both teams multiple times, and the strength of opposing lineups is no excuse. overall, tomlin has given up 14 earned runs and 26 hits (two homers) in only 12 innings. he has yet to walk a batter and has struck out four. acta was pleased with the workmanship of the tribe's other pitchers. frank? herrmann pitched one inning, allowed one hit and struck out two. nick hagadone delivered a hitless inning and also struck out two. chen-chang lee threw two innings and gave up two hits, striking out one. hagadone and herrmann are among several pitchers battling for the final two spots in the bullpen .\" hagadone continues to throw the ball well, \"acta said .\" he kept the ball down and showed a sharp breaking ball. \"none of the tribe's four pitchers issued a walk. for the spring, indians pitchers are averaging 3.1 walks per nine innings. sheldon ocker can be reached at socker @ thebeaconjournal.com. read the indians blog at www.ohio.com/tribematters. follow him on twitter at www.twitter.com/sheldonockerabj and on facebook at www.facebook.com/sports.abj."}, {"articleID": "2012021708_00035264_W", "names": {"James Patrick": ["Q14950223", "Q503714", "Q6141008", "Q6141012", "Q6141013"], "Paul Harris": ["Q16729669", "Q17425211", "Q2059988", "Q2345201", "Q28225916", "Q3520835", "Q7151139", "Q7151140", "Q7151142", "Q7151146", "Q7151147", "Q7151148", "Q7151149"], "Tommy Smith": ["Q10581", "Q1179411", "Q13131957", "Q16235031", "Q1770763", "Q462503", "Q652743", "Q7819862", "Q7819863", "Q7819864", "Q7819865", "Q7819866"]}, "date": "2012-02-17", "url": "http://pressherald.com/r?19=961&43=582577&44=139492403&32=10367&7=606317&40=http%3A%2F%2Fwww.pressherald.com%2Fsports%2Fsimply-defenseless_2012-02-17.html", "content": "by <mark>james patrick</mark> special to the press herald portland - the look on stefhon hannah's face said it all. three minutes into the third quarter, hannah was smiling as he ran down the court after he hit a 3-pointer, his eighth of the game. click image to enlarge morris almond of the maine red claws goes under marcus dove of the dakota wizards for a shot thursday night at the portland expo. photos by gregory rec/staff photographer click image to enlarge taylor griffin of the dakota wizards, right, blocks a shot by <mark>paul harris</mark> of the maine red claws during dakoka's 122-100 victory thursday night at the portland expo. select images available for purchase in the maine today photo store who: red claws vs. bakersfield jam when: 1 p.m. sunday where: portland expo the maine red claws never found a way to wipe that smile off his face as hannah's dakota wizards took a 122-100 win thursday night at the portland expo. hannah finished with 30 points in 30 minutes of play. he hit 8 of 12 3-pointers, leading maine's kenny hayes to question his team's defense after the game. \"he's good, but we scouted them and he's a shooter,\" hayes said. \"you've got to get a hand in his face. we didn't force him to put the ball on the floor and drive. it's like coach (dave leitao) talks to us about what to do and we get out here and we're clueless .\" the red claws (12-20) certainly were at a loss for how to slow the wizards (15-14). six dakota players scored in double figures, including marcus dove's 21 points on 8-of-13 shooting. <mark>tommy smith</mark> had 16 points, also on 8-of-16 shooting. leitao wasn't happy with the defense, though he wouldn't condone hayes' criticism of the red claws. \"i don't know if i'd say clueless,\" leitao said. \"number one, it's about effort and number two, it's about trust, trusting that your teammate's going to be there for you. the funny thing about it is when we have days where we practice, not a day goes by where we don't spend 40 or 50 percent of the time working on defense .\" nothing went right for the red claws on thursday. dakota led 9-0 two minutes into the game. when the wizards went up 25-10 with 4:49 remaining in the first quarter, the red claws never again pulled within single digits. dakota's 122 points tied for the second-most points allowed by maine this year. though the 22-point margin was not the biggest of the season, dakota led by as much as 33 points several times in the third quarter. leitao could only speculate as to why defense is so hard to come by in the d-league. part of it, he said, was that players think they have to score big numbers to get noticed by nba teams, not play defense. \"a lot guys in this league have been major scorers in college and all the way along,\" he said. \"they're all used to scoring .\" morris almond had 30 points to lead maine's offense. hayes had the second triple-double in team history, with 19 points, 11 rebounds and 11 assists. not bad for a 6-foot-1 point guard, but hayes was definitely not in a celebratory mood. \"i think it's my first one since high school,\" he said. \"i definitely feel like it showed my all-around game. it just (stinks) i can't celebrate it with a win .\" it was hannah who did all the celebrating thursday. here at pressherald.com we value our readers and are committed to growing our community by encouraging you to add to the discussion. to ensure conscientious dialogue we have implemented a strict no-bullying policy. to participate, you must follow our terms of use. questions about the article? add them below and we'll try to answer them or do a follow-up post as soon as we can. email them to us with an exact description of the problem. make sure to include: type of computer or mobile device your are using"}, {"articleID": "2009103104_00043985_W", "names": {"Thomas H. Lee": ["Q7790292", "Q7790294"], "Robert Dodd": ["Q7343568", "Q7343571"]}, "date": "2009-10-31", "url": "http://istockanalyst.com/article/viewarticle/articleid/3595608", "content": "by chris serres, star tribune, minneapolis oct. 31--for moneygram international inc., the extraordinary is beginning to look ordinary. a series of messy, one-time expenses and events continue to eat into the st. louis park-based company's quarterly profits, overshadowing the fact that its core business of wiring money around the world is still growing amid a weak economy. the world's second-largest money transfer company reported a third-quarter loss of $18.3 million on friday, its second consecutive quarter of losses, despite showing unexpectedly strong revenue and transaction volumes through its network of 186,000 locations worldwide. in fact, moneygram would have posted a profit were it not for a series of embarrassing, one-time expenses that totaled $37.4 million. the expenses included:--$16.5 million for a patent lawsuit that it lost against englewood, colo.-based western union co.--$6 million to settle allegations by the u.s. federal trade commission that it allowed fraudulent telemarketers in canada to use its money transfer system to bilk u.s. consumers .--$9.2 million in stock-based executive compensation and severance. negative earnings surprises are not unusual at moneygram. in the second quarter, the company incurred a $9 million expense associated with the closing of its money transfer operations in cyprus. and in early 2008, a surprise, $1.6 billion loss on investments backed by mortgages forced the company to sell itself to private equity giant <mark>thomas h. lee</mark> partners of new york and goldman sachs. \"the good news is that the bulk of these charges have to do with single events that are unlikely to ever happen again,\" said <mark>robert dodd</mark>, an analyst with morgan keegan & co. in memphis. moneygram shares fell 14 cents friday to $2.99 a share. yet, the company's global money transfer business is performing better than that of western union, its larger rival. moneygram's revenue was virtually flat in the third quarter at $304.5 million, while western union's declined 5 percent to $1.3 billion. moneygram's money transfer volume increased 4 percent, with double-digit gains in certain parts of the world, including asia and eastern europe. in a conference call friday with analysts, ceo pamela patsley said the company would continue its focus on geographic expansion. \"we are working our way through the list of open issues,\" patsley said. \"i think we're getting to the end .\" however, moneygram has seen its revenue from investments--once a substantial part of its overall revenue--decline sharply over the past year, as the company shifts more of its assets into safer government-backed securities. it also faces a significant overhang of debt from the <mark>thomas h. lee</mark> buyout. as of sept. 30, the company's debt was $879 million, and its interest costs consume nearly 20 percent of its quarterly operating expenses. chris serres--612-673-4308---- - to see more of the star tribune, or to subscribe to the newspaper, go to copyright (c) 2009, star tribune, minneapolis distributed by mcclatchy-tribune information services. for reprints, email tmsreprints @ permissionsgroup.com, call 800-374-7985 or 847-635-6550, send a fax to 847-635-6968, or write to the permissions group inc., 1247 milwaukee ave., suite 303, glenview, il 60025, usa. kbr to participate at the goldman sachs 2009 global industrials conference youth, i.n.c. executive director and piper jaffray president and chief operating officer to ring the nasdaq stock market closing bell in honor of trading day for kids e * trade financial (nasdaq: etfc): why this company's takeover prospects keep improving 7 reasons gold will surpass $2,500 - and inflation isn't one of them wall street plunges as dollar gains, citigroup (nyse: c) tumbles"}, {"articleID": "2012040411_00075045_W", "names": {"Peter Lord": ["Q13130738", "Q1975096"], "Hugh Grant": ["Q163286", "Q1634366"], "Sajid Khan": ["Q15983149", "Q2762152", "Q27983602", "Q3469329", "Q55955724"], "Nick Murphy": ["Q16107442", "Q16218684", "Q16733035", "Q16772388", "Q5094088", "Q58132658"], "Rebecca Hall": ["Q230534", "Q58010813", "Q7301759"], "John Abrahams": ["Q27031600", "Q6218088"], "James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2012-04-04", "url": "http://emirates247.com/entertainment/films-music/movie-previews-for-this-week-in-uae-2012-04-04-1.452284", "content": "it's going to be another week of unimpressive line-up at the cinemas, prompting us to step outdoors and enjoy, in all probability, the last weekend of good weather. but if you must head to the theatres, then here's what's lined up. it'd be tough to pick a favourite, considering it all lacks in content or treatment, but if i had to, then it'd be <mark>peter lord</mark> and jeff newitt's \"the pirates! band of misfits\". voiced by <mark>hugh grant</mark> and salma hayek, it promises a fun take on the notorious life of the pirates. and there's little else you expect from the filmmakers who've created famed tales like \"chicken run\" and \"wallace and gromit\". and if there's one that should be skipped, apart from <mark>sajid khan</mark>'s crowded \"housefull 2\" , then it'd be \"titanic 3d\". considering we've all witnessed this epic romantic-drama way back in 1997, of how the gigantic titanic had its glorious life and those of its passengers cut-short by a massive chunk of ice, it's confusing why it needed to make this reappearance in 3d? director: mabrouk el mechri cast: bruce willis, henry cavill and sigourney weaver the story: a family sailing trip in spain goes haywire when a wall street trader finds his entire family goes missing. he's now faced with uncovering the truth, finding his family and ensuring his family stays unhurt during the whole ordeal. director: rob minkoff cast: patrick demsey, ashley judd genre: comedy the story: two sets of robbers attempt to loot the same bank, at the same time. and in the midst of this confusion, one customer tries to protect the teller, whom he secretly loves. director: <mark>peter lord</mark> and jeff newitt cast: <mark>hugh grant</mark> and salma hayek the story: in his bid to win the most coveted pirate of the year award, pirate captain must defeat his rivals black bellamy and cutlass liz, taking him from the shores of blood island to the foggy streets of victorian london. director: <mark>nick murphy</mark> cast: dominic west and <mark>rebecca hall</mark> the story: set in 1921, florence cathcart's life takes a mysterious turn when she lands up at a boarding school to inspect the spotting of a child ghost. director: martin guigui cast: dennis quaid, tony oller and aimee teegarden the story: another spooky tale that centres around a bunch of teen pals, who struggle to expose a local hero as the murderer of their best friend. director: <mark>sajid khan</mark> cast: ashkay kumar. asin and <mark>john abrahams</mark> the story: four fathers set out to get their four daughters married to the most moneyed boy from a gang of four. but no one, not even the daughters, know for sure if their lover is truly the richest. director: <mark>james cameron</mark> cast: leonardo dicaprio, kate winslet and billy zane [video] united kingdom, edinburgh: file images of a giant male panda loaned to britain by china has just 36 hours to romeo beckham definitely a mummy's boy! today i advertised my property, i got 4 calls from 4 different people in mfr, they offered 4 cheques and contract for excellent! now every single one of those guys who post slander or defamation about a person or business can be brought"}, {"articleID": "2014041720_00009780_W", "names": {"David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"]}, "date": "2014-04-17", "url": "http://gulfnews.com/sport/football/pellegrini-blames-liverpool-hangover-for-poor-show-1.1320926", "content": "Pellegrini blames Liverpool hangover for poor show Manchester City's Belgian midfielder Vincent Kompany (C) leaves the pitch at the final whistle with Manchester City's Montenegrin forward Stevan Jovetic (L) and Manchester City's Argentinian defender Mart? n Demichelis during the English Premier League football match between Manchester City and Sunderland at the Etihad Stadium in Manchester on April 16, 2014. The match ended in a 2-2 draw. AFP PHOTO/Andrew YATES - RESTRICTED TO EDITORIAL USE. NO USE WITH UNAUTHORIZED AUDIO, VIDEO, DATA, FIXTURE LISTS, CLUB/LEAGUE LOGOS OR \"LIVE\" SERVICES. ONLINE IN-MATCH USE LIMITED TO 45 IMAGES, NO VIDEO EMULATION. NO USE IN BETTING, GAMES OR SINGLE CLUB/LEAGUE/PLAYER PUBLICATIONS Manchester: Manchester City manager Manuel Pellegrini blamed the hangover from defeat by Liverpool for his side's damaging 2-2 draw at home to the Premier League's bottom club Sunderland. City needed to win the first of their two games in hand on Liverpool to keep the pressure on the league leaders and second-placed Chelsea. But Wednesday's draw with Sunderland, in which they needed a late equaliser from Samir Nasri just to avoid defeat, means that they are still six points behind Liverpool with just one extra game to play. Pellegrini hopes that wins in City's five remaining fixtures will still give them a chance, but he admitted that his team had been unable to recover from the mental strain of losing 3-2 at Anfield last weekend. \"Of course our chances are less than before the match,\" he said. \"It was very important for us to win this match. We could not, but we will continue fighting until the end .\" I don't think we could take out of our minds the game against Liverpool. That's why the team did not play well today (Wednesday). \"It was difficult for the players to get Liverpool out of their minds. We needed more intensity, but maybe it wasn't in their minds to do it .\" They were mentally tired. It was difficult to play this game after Liverpool. \"Before the match I was very worried, because when you play against a team that might be relegated at the end of the season, they come and fight for every ball like it's the last .\" The injury suffered by Yaya Toure at Liverpool also had an impact as his absence was clearly felt in City's midfield, along with that of <mark>David Silva</mark>. <mark>Silva</mark> was ruled out with an ankle problem, but Pellegrini hopes the playmaker will be fit to face West Bromwich Albion next Monday. And despite this setback, which looked like being a defeat after Connor Wickham scored twice to put Sunderland ahead, the Chilean is not writing off City's chances of an unlikely title success He added: \"There are five more games to play and we must try and win them and see where that takes us at the end of the season, and which team has the most points .\" Maybe Liverpool and Chelsea have a better chance than our team, but we will continue fighting until the last game. It's difficult, but this wasn't the last game played today. \"Sunderland's concerns are at the other end of the table and despite a heroic effort, they are now without a win in 10 games. Goalkeeper Vito Mannone's late fumble of Nasri's shot cost them dear, but manager Gus Poyet was delighted by his players, who hit back through Wickham's brace after Fernandinho had given City a 2nd-minute lead .\" We played a great game and deserved something. I thought for a few minutes it was going to be all three points, \"said Poyet .\" The situation we are in, bottom of the table and we concede a goal after two minutes. Everyone would have expected us to collapse, but we didn't. \"The players showed how important it is, for the club and the fans, to go to the end, whatever the result is .\" I am proud of the players. They kept going and it was not easy. It's going to give us a bit more of that word I hate - confidence - and will give us a different approach on Saturday [at Chelsea]. \"The result did little to help Sunderland's plight at the foot of the table as they remain six points away from safety. But Poyet admitted that his fellow Uruguayan, Liverpool striker Luiz Suarez, will have been delighted by the outcome."}, {"articleID": "2013010923_00064976_W", "names": {"Tom Cochran": ["Q16241110", "Q7815354"], "Tom Leonard": ["Q1563959", "Q16221406", "Q7816566"]}, "date": "2013-01-09", "url": "http://wilx.com/home/headlines/New-Beginning-for-Michigan-State-House-186231212.html", "content": "new beginning for michigan state house it was mostly ceremonial business on the first day of session for 2013, but the house chamber was packed with representatives and their family. lawmakers took their oath including 28 freshman representatives. five are from mid-michigan. democrats andy schor, <mark>tom cochran</mark>, sam singh and teresa abed and republican <mark>tom leonard</mark>. the newcomers say they're ready to get down to business. \"jobs and the economy have to remain priority number one for this legislature,\" said rep. <mark>tom leonard</mark>, r-dewitt township. \"how we position ourselves in a global economy, how we re-enforce our investment in education as well as higher education,\" said rep. sam singh, d-east lansing. the focus during session on wednesday was very much about moving forward, but house democratic leader tim greimel said it doesn't mean they've forgotten about the bitter disagreements that took over the capitol just a few weeks ago. lawmakers from both sides said they're ready to make some changes in 2013. \"i've already sat down with one representative, andy schor. we're continuing the tradition of the capital caucus,\" said rep. <mark>leonard</mark>. \"i hope to work with the other side of the isle on that, it's day one and all the comments were right,\" said rep. andy schor, d-lansing. as expected, rep. jase bolger will continue as speaker of the house. his nomination was seconded by rep. greimel. gray television, inc. - copyright? 2002-2013 - designed by gray digital media - powered by clickability"}, {"articleID": "2018081307_00147721_W", "names": {"William Nicholson": ["Q41779114", "Q55758217", "Q706935"], "Fiona Bruce": ["Q266078", "Q2893114"]}, "date": "2018-08-13", "url": "https://www.independent.ie/entertainment/painting-bought-for-185000-fails-to-convince-expert-it-is-genuine-37209988.html", "content": "Independent. ie Painting bought for € 185,000 fails to convince expert it is genuine The still life had been attributed to <mark>William Nicholson</mark>. <mark>Fiona Bruce</mark> with the painting (Rolf Marriott/BBC) Laura Harding Painting bought for € 185,000 fails to convince expert it is genuine Independent. ie A painting bought for € 185,000 (£ 165,000) and attributed to <mark>William Nicholson</mark> has failed to convince the artist's leading expert of its authenticity and been rejected as close to worthless. https: //www.independent.ie/entertainment/painting-bought-for-185000-fails-to-convince-expert-it-is-genuine-37209988.html Email A painting bought for € 185,000 (£ 165,000) and attributed to <mark>William Nicholson</mark> has failed to convince the artist's leading expert of its authenticity and been rejected as close to worthless. The still life of a glass jug and pears was rejected by the leading authority on <mark>Nicholson</mark>, Patricia Reed, and left out of the artist's latest catalogue raisonne--the official list of all his known works. The piece was examined on BBC One's Fake Or Fortune? but a thorough forensic case was not enough to persuade Reed that the painting is genuine. The programme obtained new evidence that scientifically linked the painting to <mark>Nicholson</mark>'s very own paint box which is kept in his grandson's house, and a handwriting expert also confirmed that writing on the back of the painting was very likely to have been written by <mark>Nicholson</mark> himself. <mark>Fiona Bruce</mark>, Philip Mould with Glass Jug with Plates and Pears. attributed to <mark>William Nicholson</mark> (Rolf Marriott) Presenter <mark>Fiona Bruce</mark> met reformed art forger John Myatt to ask him if he had ever faked a <mark>Nicholson</mark>, with Myatt revealing that he had, but not this painting. The programme found that while there are physical aspects to the painting that link it to <mark>Nicholson</mark>, there is not enough direct evidence to prove that he executed the work himself. It has been suggested that because there was a group of amateur painters who were tutored individually by <mark>Nicholson</mark> in his studio and elsewhere during the 1930s, known as the \"Sunday painters\" , the painting could have been executed by one of them, under his supervision. One of <mark>Nicholson</mark>'s most famous tutees in this group was Winston Churchill. <mark>Bruce</mark> said: \"I'm genuinely shocked by that verdict. I didn't expect it. I thought the case was so strong .\" Fake Or Fortune? is on BBC One on Sundays at 9pm. Press Association"}, {"articleID": "2012121115_00086399_W", "names": {"Chris Paul": ["Q1077636", "Q46040", "Q56754195"]}, "date": "2012-12-11", "url": "http://thegame730am.com/news.asp?c=803326&url=http%3A%2F%2Fwww%2Esportsnetwork%2Ecom%2Fmerge%2Ftsnform%2Easpx%3Fc%3Dcitadel%26page%3Dnba%2Fnews%2Fnewstest%2Easpx%3Fid%3D4549251", "content": "streaking clippers begin road trip in chicago (sports network) - the los angeles clippers will ride a six-game winning streak into the windy city tuesday night when they take on the chicago bulls. the clippers haven't lost since nov. 26 at home against the new orleans hornets. five of the six wins were at home and tuesday night's contest begins a four-game road trip. for just the third time in clippers history, the team has 14 wins through 20 games. the clippers boast the reigning western conference player of the week in blake griffin. over his last four, griffin averaged 23 ppg and 10.3 rpg. with chauncey billups injured again, and <mark>chris paul</mark> not posting <mark>chris paul</mark> numbers recently, the bench has carried the clippers. the clippers led the toronto raptors by four points after three quarters on sunday, but the reserves held the raptors scoreless for almost seven minutes. jamal crawford leads the nba in fourth-quarter scoring and the clips won for the fourth time in their last five outings without the starters scoring a point in the final quarter. \"our starters had their moments tonight, but overall i thought our bench was the key again,\" clippers head coach vinny del negro said. \"they're just doing a more consistent job for us defensively in terms of talking, getting into people as a group .\" the bulls have won three in a row themselves, including a home win saturday night against the new york knicks, who played once again without star carmelo anthony. the bulls bested the knicks 93-85 based on the great play of luol deng and marco belinelli, who both netted 22 points. belinelli is seeing a significant bump in minutes with the injury to rip hamilton. belinelli had 15 of his 22 in the first quarter. joakim noah added 10 points and 11 rebounds to go with a staggering nine turnovers. deng played all but 1:26 in the knicks game and noah and belinelli both logged over 44 minutes. kirk hinrich didn't play in the second half with an elbow injury and taj gibson was ejected in the second quarter after picking up two technical fouls. it all led to some gassed bulls. \"i was really tired out there,\" said noah. \"i was tired, but it's all worth it right now. we're growing as a team. we need everybody. we were shorthanded, but we're fighting. it's all you can ask for. as long as we're fighting, the city should be proud .\" the bulls will try to avenge a 101-80 loss earlier this season in los angeles."}, {"articleID": "2014092322_00057275_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "James Carroll": ["Q1680137", "Q21501580", "Q24247086", "Q652225"]}, "date": "2014-09-23", "url": "http://marinij.com/dining_food/ci_26591323/from-editors-kitchen-can-you-really-have-fine", "content": "From the Editor's Kitchen: Can you really have a fine dining experience at a mall? I admit it - I am a food snob. I hate eating in restaurants that are in malls. Maybe it's because I lived in Florida for a few years, where just about every fine dining establishment is in a mall. So I was a bit shocked that I actually enjoyed dining at the Mariposa Restaurant in Neiman Marcus a few months ago - not just in a mall but in a department store in a mall! Of course, it was in the Ala Moana Shopping Center in Honolulu and on a lanai overlooking the beach and the Pacific Ocean with the gentle trade winds caressing me, the intoxicating smell of plumeria trees wafting by and a mai tai in my hand. But in general, the idea of making a mall a destination to dine feels all wrong. Casual? Sure. Fine dining? Uh, no. We're lucky that Marin has a lot of upscale restaurants that aren't in malls. But, we have a handful that are. What about you? Do you enjoy the mall dining experience? What about restaurants in department stores? Let's dish! Send in your comments in 200 words or less in an email to lifestyles @ marinij.com by Oct. 17; please put \"Editor's Kitchen\" in the subject line. Don't forget to include your full name and hometown. We'll run them in the Oct. 29 Plus section and online. Last month we asked readers how they feel about dogs in restaurants in light of Gov. <mark>Jerry Brown</mark>'s recent signing into law a bill that permits dogs besides service dogs at restaurants with outdoor areas throughout the state. I was surprised by how many don't like it, especially since we are such a dog-loving county. Here's what they had to say: Most Bay Area dog owners will always insist that their dog is harmless and is not a nuisance to anyone else, and they will refuse to acknowledge any evidence to the contrary. But any dog CAN in fact be harmful and be a nuisance, for a long list of reasons; that is why it has always been well-understood that we need strict rules on dogs in shared public spaces. These rules are for the health and safety of everyone in our community. Dogs are not people, and do not have the rights of people. Dogs should always be on a leash in public places; they should not be brought into public buildings; and they should not be brought anywhere near where food is sold. Dogs are unclean, and some people can have serious allergic reactions to dogs, so it is dumbfounding to me that we would revise our laws to allow them in restaurants. I see no tangible benefit from this, but plenty of potential drawbacks. Dogs in public places, along with inconsiderate and self-entitled dog owners, are a serious and growing nuisance in the Bay Area. AB 1965 is just another step in the wrong direction. - Jim Feldman, San Rafael It's cruel I'm one of \"those\" people who don't have a problem with animal testing. Rats? Dime a dozen. Would I stand by and let anyone mistreat a defenseless animal? Never. Speaking of animal cruelty, isn't it cruel to subject your beloved pet to all the trauma of being around BIG humans? Isn't it cruelty to stuff them into your little shoulder bag? Or stuff them into a \"made for puppy\" stroller? Isn't it down right cruel to make them go shopping, or be at a food establishment when they can't even order an entrée? I've been subjected to \"pets\" in so many environments, like the grocery store; I actually have a picture I took on my cellphone where little Fido is sitting in the child area of the cart, with no layer between the pups bum and the cart. I've seen dogs, regularly, at the farmers market. When I mentioned this to a woman she said, \"Well, they should have signs .\" Really? They do, and do you really need to be told? The real animal cruelty is depriving your pet the unbridled joy of greeting you when you get home. Or, \"how can I miss you if you don't go away?\" - Abby Danielson, Novato Enriching life Our dog, Dutch, loves to go out to restaurants with us. He's a very well-behaved Tibetan terrier (almost 4 years old), and enhances our eating experience, particularly since he eagerly manages to share our meal. He doesn't bark, doesn't cry, doesn't create a ruckus - simply sits tight until the food arrives and then waits patiently for his handout. His presence also enhances the social experience since most people in Marin love dogs and will readily come over and chat with us while giving Dutch lots of attention. Who could possibly have a problem with that? A dog not only enriches the dining experience, but also enriches all aspects of our lives. Kudos to <mark>Jerry Brown</mark> for recognizing that. - Terry Bremer, San Rafael Better than some kids I think it is a great idea and one whose time was too long in getting here. We have always had one or two dogs and love taking them with us to dine out. Most of the time they are much better behaved than the children that are in the same place - they certainly never throw their food, scream and throw tantrums or do any of the other bad behaviors often witnessed by us. I would love to see dogs allowed inside restaurants - as they are in some of the best European ones - but at least this is a start. Pets, as well as children, need to be under the control of their \"parents\" at all times and this makes dining out with them a pleasure. - Sandy Hufford, San Rafael Disturbing trend Thanks for asking us to weigh in on the \"Take your dog just about everywhere\" trend. It takes a dog lover to speak up for those of us who are dismayed by the surge of canine encounters in public places. It's politically incorrect to say you'd rather not shop or eat a meal with someone's best furry friend down by your ankles. The fact is that even the sweetest, most docile doggy companion can be unpredictable. I wonder if the older woman who's small dog suddenly leapt up and bit me on the thigh because my \"hat frightened her\" ever thinks about me. I think about that encounter. She went off saying, \"She never does that .\" Well, obviously she does! And that's the point. In a store, restaurant, museum or farmers market unexpected things can happen. In the past year I've encountered dogs in all of those places. This despite large signs posted at the entryway and legitimate rules in place concerning hygiene. Most dogs are fine and sweet but overly friendly dogs can be almost as much a problem as aggressive ones when they greet you (uninvited) by jumping, or snuffling you and planting a nice smear on your shin or skirt. It mystifies me why someone would bring their dog to certain places. I'd be a little anxious that he/she might do something to disturb others and that would impact my own experience. But I think that many dog owners don't understand that their pooch is special to them but not to everyone and it's rude to give them freedoms that impinge on others. Even a dog/babe-in-arms might be vocal or smelly. I've noticed that many service people and business owners are cautious about causing a scene and so I'm glad that the IJ is giving us a forum to say: \"Please leave your best buddy at home when you go shopping or out to eat .\" By the way, I'm not talking about casual places with outdoor spaces where you would expect to see folks out for a walk with their pet. And if a business owner is a dog lover and encourages their presence I will do my part by choosing a different establishment but I hope that the doggy takeover in Marin allows dog-free places to remain; know that there are customers out there who appreciate it! - C. Powell, Corte Madera \"Gone to the dogs' California has literally\" gone to the dogs. \"So now bus boys will not only have to clean the tops of the tables; but they will also have to clean up dog urine and feces from underneath the tables. The restaurant menus for pit bulls and mastiffs dining outside will be: Chihuahua or toy poodles for an appetizer and perhaps a small toddler for an entree. Are dog owners insane? Is our Assembly a bunch of idiots? Has no one considered the potential danger and folly of allowing innumerable dogs together in the same place around each other and food? What were you smoking, Governor\" Moonbeam \"when you signed this inconceivable bill into law? - Pamela Lunstead, Novato Not my darling Please, leave Fido home or with a sitter while dining in a restaurant. Not everyone thinks your dog is a\" darling. \"It's bad enough that they are allowed in malls, at street fairs and in outdoor restaurant areas to be tripped on and cleaned up after, to say nothing of the confrontations that often occur between two canines. Sanitation is certainly another issue. I, for one, would not dine in a restaurant, upscale or otherwise, if dogs were allowed inside. - <mark>James Carroll</mark>, San Anselmo Leave them home I have a dog and love dogs but really - why are people dragging their dogs everywhere? Do people really think their dog enjoys shopping at the mall, going into the fitting rooms, being dragged from store to store? I am so tired of encountering dogs en masse everywhere I go. Barking, ill-mannered dogs are no better than screaming children. When we go out to eat I really do not want to sit next to dogs. I have that at home and certainly do not want it at a restaurant. Nowadays everyone seems to have some sort of companion dog. Are there that many people in the world that need this security or is it just an excuse to take their dog wherever they want? I know one thing for sure - my dog would much rather be sleeping comfortably at home than having anxiety with all the commotion at malls, restaurants, etc.. People, leave your dogs at home! - R. Boyett, Ignacio Not a fan Dog are wonderful beings and have enhanced man's life throughout time. However, I am baffled by this growing presence everywhere. I've seen dogs in carts at grocery stores, large long-haired dogs brushing through racks of clothing at malls and yes, at outdoor eateries. I recognize the beauty and companionship they provide, but am opposed to this ubiquity. First, is this where your dog wants to be? Being stepped around on a dirty sidewalk or at the mall? As for dog allergies, they are real and life threatening. Additionally, people don't have control. Dogs bark and nip. And seriously, Marin, why can't you pick up your dog's droppings? Municipalities increasingly spend more and more money dealing with this issue. And now it's near restaurants and at the mall. Dog waste is not organic fertilizer. I love dogs, but I'm not a fan of this new development. - Nicole Kowalski, San Rafael Form of abuse Regarding dogs at restaurants, with some exceptions of course, I can't see a good reason for people to bring one. To force the poor thing to patiently lay down and hungrily smell delicious food and not be able to have any while they enjoy theirs is a form of abuse and just plain cruel as I see it. It shows total indifference and lack of any real concern for the dog. To display this treatment makes me both sad and angry. It spoils the entire meal for me. Naturally, I'll go out of my way to avoid restaurants that allow dogs. - Lorraine Peters, San Rafael No yapping, please If the outdoor dining space at a restaurant is large enough to accommodate dogs I think it is OK to bring dogs along providing they are clean, well-behaved and not yappy. Some people are totally oblivious to the idea that not everyone is in love with their dog. And the claim that the dog is a service dog is often abused and an untrue claim to that effect can have negative consequences for those people who truly need a service dog. - Nancy Valente, Mill Valley She causes smiles Our dog is part of our lives. We take her with us whenever we can and for lunches we seek out places with outdoor seating so we can bring her with us. All of the places here in central Marin, with outdoor dining, welcome us, including our pooch. She is better behaved than some of the patrons and certainly quieter. She normally just goes to sleep under our table and gives us comfort by her presence. Most all time people come over to pet her and say hello and it seems to me that she enhances their luncheons as well as ours. She generates a lot of smiles. We've never encountered a negative reaction. So if you see us with our 60 lb beautiful golden doodle we hope you get a smile out of it. - Robert Greber, Greenbrae A delight to see Dogs are allowed in fine restaurants all over France, including Paris. In a country where a reverence for food and dining etiquette are unquestioned, this is a non-issue. Is it that French humans and dogs are more well-behaved? I currently do not own a dog, but am delighted to see well-trained dogs and well-trained humans wherever I go. - Nancy Heinemann, San Rafael Not her best friend I do not like dogs and they do not like me. I will never again be able to enjoy a meal in an outside restaurant because I am very against having dogs there."}, {"articleID": "2014082112_00057407_W", "names": {"Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "Mike Brown": ["Q1102021", "Q16200455", "Q16213884", "Q17306282", "Q1933055", "Q1933070", "Q2757687", "Q298913", "Q3313242", "Q3857364", "Q41790047", "Q4274643", "Q437776", "Q458065", "Q6380458", "Q6846151", "Q6846155", "Q6846156", "Q6846157"]}, "date": "2014-08-21", "url": "http://bostonglobe.com/metro/2014/08/20/ferguson-young-people-see-moment-opportunity/ix1qYqVzaVRj0FggYrF44I/story.html", "content": "Market Basket eyes deal this week Most Boston pedestrian accidents go unreported Researchers decry limits on drones Protesters in Ferguson, Mo., held roses as they demonstrated for justice after the fatal shooting of <mark>Michael Brown</mark>. FERGUSON, Mo. - Deandra Connors sat at the McDonald's on West Florissant Avenue looking out the window. Outside, her peers stood with protest signs and occasionally shouted what has become the battle cry of this movement: \"Hands up; don't shoot .\" Connors, 18, has been out here every day since her former classmate, <mark>Michael Brown</mark>, was shot to death by a Ferguson police officer 10 days ago. Here, in this moment, she feels part of something that she hopes will usher in an era where her dreams will not be deferred. <mark>Brown</mark>'s death has not only jolted many young people into consciousness and action, including daily protests, but it has also created a collective trauma of sorts. It has deepened the stress of being young black teens living in areas of concentrated poverty and crime - and prompted at least some teens to think beyond themselves. Connors dreams of going to nursing school or studying the culinary arts, or maybe becoming a forensic scientist. But, she said, whichever career she chooses must come with a paycheck large enough to help start a nonprofit to assist impoverished children in Africa immigrate to the United States. \"To help them find jobs, so they can live the American Dream, too, but I don't want them to come here and be targeted, too. So that's why everything's gotta change right now,\" she said. The daily march for justice has two purposes, she said: \"All of it's not for <mark>Mike</mark>; it's for people who been going through this stuff, like for real, for real. It just took <mark>Mike</mark> as a sacrifice for all of it to be shown .\" For many of these young people, this isn't just a philosophical protest. It's a personal one. They knew <mark>Brown</mark> or were connected to him by a few degrees of separation, and by shared experiences. In Ferguson and the neighboring communities in northern St. Louis County, some teens of color come from low-income households. African-American youths are dramatically more likely to be pulled over by police than whites, according to the state attorney general's office. And some attend struggling schools, according to state statistics. Last year, for example, the state Department of Education stripped the academic accreditation from the school district attended by <mark>Brown</mark> and Connors in Normandy, The state allowed students to transfer elsewhere with tuition and transfer fees paid by the unaccredited district, thus draining it of millions of dollars. To make it here, 16-year-old Kameron Dunn said, \"you gotta be on your game. It's gotta be three things to make it: be an A-student, stay swagged out, or you gotta know how to knock people out .\" And while he acknowledged that he started high school by getting into \"a lot of drama,\" now, he's trying to stay above the fray. \"I'm trying to go to college and be an engineer,\" he said, standing on West Florissant Avenue, a roadway lined with strip malls that could exist in anywhere USA but has become the nexus of protests in recent days. Dunn was standing with a friend, Elexus Steed, who was passing out roses to fellow protesters. Steed, 16, described <mark>Brown</mark> as her \"homeboy .\" \"<mark>Mike Brown</mark> knew everybody, though. Maybe that's why he has so many people out,\" she said. Thousands of people from across the country - and some traveling from as far as Boston and Texas - have converged on West Florissant Avenue. The initial protests, while mainly peaceful, were met with an aggressive show by police who used tear gas and rubber bullets to disperse the crowds. But as days have become weeks, a more youthful, volatile group has emerged at night and clashed repeatedly with police. Their anger and frustration at what they consider an unjust system is palpable, often creating tense standoffs with law enforcement. Their emotions can be kept in check by ministers and community elders, but it can easily spill over with the slightest of provocation. Some people in the community witnessed <mark>Brown</mark>'s shooting; many more saw his lifeless body as it lay on Canfield Drive, according to area residents. Connors said she was at her cousin's house nearby on Aug. 9, when one of <mark>Brown</mark>'s friends came running over. \"He said,\" Mikey been shot .' \"So, she said, they went outside, joining a growing crowd .\" They just displayed his body for like three or four hours without even putting a sheet on it, \"she said, her voice pitching with anger and emotion .\" And even after they put the sheet on there, he was still out there. \"Fourteen-year-old Manasseh Kimbrough was spared seeing his friend's body, but that doesn't make his anger at the situation any less tangible. Kimbrough and his brother, who live in an apartment complex on the west side of West Florissant Avenue, spent several hours rapping with <mark>Brown</mark> in front of the QuikTrip gas station and convenience store several days before he died. The subject matter, he said, was life .\" It wasn't like sex and money and weed or nothing. It was just life, to get out of the struggle and stuff like that, \"he said, as a group of protesters marched by shouting,\" No justice, no peace. \"The trio went their separate ways. Days later, <mark>Brown</mark> was dead .\" When we found out about this, me and him was mad, hurt, \"Kimbrough said. Kimbrough sang at the first candlelight vigil, and he and his brother have returned to protest since, their grief compounded by choking tear gas and stinging rubber bullets .\" They keep tear gassing and it makes it worse. It's building us up, \"he said of the several days police launched gas canisters into the crowd. These teens don't talk about the end of the protests. For them, they say, this is just the beginning. Work here © 2014 Boston Globe Media Partners, LLC You have read 5 of 10 free articles in a month. You have read 7 of 10 free articles in a month. This is your last free article in a month. Continue reading with unlimited access for just 99 ¢ Don't miss any of your favorite stories again. Read the stories that matter to you as much as you want, whenever you want when you subscribe to BostonGlobe.com. The login information you entered does not match an account in our records. To activate FREE access as a home delivery subscriber Forgot your password? Home delivery subscribers get free access. Link Account Customer Service Number: 1.888. MY. GLOBE E-mail address not found, please try again or contact customer service at 1-888-MYGLOBE Please check your e-mail for a message from BostonGlobe.com with the subject line\" BostonGlobe.com password request. \"Click the link in the e-mail to choose a new password for BostonGlobe.com, and note that your new password will also be used for your Boston.com membership. You have reached the limit of 10 free articles in a month Continue reading by subscribing to BostonGlobe.com for just 99 ¢. Continue reading by subscribing to BostonGlobe.com for Stay informed with unlimited access to Boston's trusted news source. High-quality journalism from the region's largest newsroom Convenient access across all of your devices Today's Headlines daily newsletter"}]