[{"date": "2015-02-05", "url": "http://clickorlando.com/news/politics/obamas-longestserving-staffer-leaving-post/31091906", "content": "Dan Pfeiffer is one of president's longest-serving strategists, closest advisers Chip Somodevilla/Getty Images/Public domain WASHINGTON (CNN) - The White House announced the parallel departures of two top aides to President Barack Obama on Wednesday, just past the midway mark of Obama's final term. Dan Pfeiffer, one of the President's longest-serving strategists and closest advisers, will depart the White House in early March, officials said. The second adviser, communications director Jennifer Palmieri, will leave in the spring. A Democratic source said she'll fill the same role on Hillary Clinton's all-but-certain presidential campaign. \"While their departures are significant, there is indeed value in bringing in new, energized staff with fresh ideas and new perspectives,\" a White House official said, noting Palmieri and Pfeiffer had made their decisions to leave independent from one another. \"Instead of filling jobs as one-offs, this timing presents an opportunity to build a cohesive team that is expressly designed to achieve and implement the President's priorities for the fourth quarter of his presidency,\" the official said. Pfeiffer is one of the longest-serving Obama staffers, with ties to the President's first presidential campaign in 2008. A previous White House communications director, Pfeiffer currently serves as assistant to the President and senior adviser--a role he's used to hone the administration's messaging in a shifting media environment. \"Dan has been beside me on every step of this incredible journey, starting with those earliest days of the campaign in 2007,\" Obama said in a statement on Wednesday. \"And through it all, he's been smart, steady, tireless and true to the values we started with .\" An official at the White House said Pfeiffer, who'd been contemplating leaving the administration for a \"long time,\" told Obama the day after this year's State of the Union address that he'd made his decision to depart. \"Given the position of strength we are in right now...he is now comfortable moving on,\" the official said. Palmieri--who also served in former President Bill Clinton's administration--is expected to assume a role on Hillary Clinton's campaign for the Democratic presidential nomination, should she decide to make a run. Two sources familiar with the campaign's planning said Palmieri was likely to take on the top communications job. She'll join another former Obama adviser, John Podesta, who is also expected to assume a major role on Clinton's campaign, potentially as its chairman. A top aide who helmed the administration's efforts combating climate change, Podesa is slated to leave the White House this month. As one of Pfeiffer's final tasks at the White House, he's been reviewing how the communications staff engages in a social media-driven news environment. The White House official said Pfeiffer had traveled to Silicon Valley recently to garner recommendations from American tech firms on how best to engage audiences using their platforms. The evidence of those efforts were on display last month leading up to Obama's annual State of the Union address: key elements of the speech were unveiled ahead of time on Facebook and Twitter, and the entire text of the speech was published on the website Medium before Obama stepped to the podium. In an interview on CNN's \"Reliable Sources\" in December, Pfeiffer said his White House position \"has been the greatest job I've ever had .\" He acknowledged \"there will be a day when it makes sense for me to do something else,\" but said he hadn't made up his mind about what's next. \"I think when I leave the White House, whenever that will be, I will spend a significant amount of time on a beach with an adult beverage for a long time,\" he said with a laugh. \"And then figure out what the next chapter is .\" In December, Pfeiffer spoke animatedly about American media being \"on the cusp of a massively disruptive revolution .\" \"There are big things that are going to happen,\" he said. \"The old models are starting to fall. And how we adjust to them, and how everyone adjusts to them--you know, entertainment television, the movies, the news, politicians and the government trying to get their message out--is going to be a massively fascinating thing .\" Pfeiffer added that he thinks these changes are \"even more interesting and potentially consequential than the invention of television and the invention of the Internet, because it's all those things combined at the same time .\" Pfeiffer's departure leaves few remaining \"Obama originals\" --those trusted aides and advisers who helped Obama win the White House and navigate the early years of his presidency. Valerie Jarrett and Anita Decker Breckenridge, both senior advisers who have served Obama for years, are two trusted aides who will remain in the West Wing. Others, however, have moved on: <mark>David Axelrod</mark>, David Plouffe and Alyssa Mastromonaco, three former senior advisers who served on Obama's 2008 campaign, have all left government for now. Obama said Wednesday that Pfeiffer had served not only as a top aide but as a friend. \"I'm going to miss having him just down the hall from me,\" he said. The views expressed are not those of clickorlando.com, WKMG or its affiliated companies. This is a community moderated forum (Please note the \"Flag' button). By posting your comments you agree to accept our Terms Of service Please set an email address for your profile. To complete your registration on this site, please supply an address.", "articleID": "2015020501_00037195_W", "names": {"David Axelrod": ["Q1251914", "Q519838"]}}, {"date": "2015-02-05", "url": "http://liverpoolecho.co.uk/sport/sport-opinion/dave-prentice-integration-not-segregation-8590115", "content": "Anfield rape: Police describe appalling attack after 14-year-old boy arrested on suspicion of assaulting woman in her 40s Liverpool FC fan left scarred after he was bottled and robbed during street attack Heartbroken Wallasey mum went from \"expectant mother to a bereaved parent in the space of minutes' Liverpool FC comment: Damien Comolli making\" massive mistake \"by carrying on talking Dividing Everton and Liverpool fans is not a solution\" data-type = \"fb-share\" data-action = \"article:8590115\" > Dividing Everton and Liverpool fans is not a solution \"data-type =\" tw-share \"data-action =\" article:8590115 \"> Liverpool and Everton in the 223rd Merseyside Derby, 2014 Merseyside police have reluctantly allowed tomorrow's derby match to kick-off at 5.30 pm - provided that Everton\" improve segregation. \"It is a surprising compromise. Because it was segregation which got us into this mess in the first place. The Merseyside derby was never the dewy-eyed love-in of sentimental folklore, but rival fans did, at the very least, put up with each other. And they policed each other too. Fans mixed at Merseyside derbies throughout the era of standing terraces, without one single, publicised problem. They mixed famously at Wembley in 1984, 1986 and 1989. But it wasn't just on the big occasions that they behaved themselves. They mixed on each other's turf, too. When Bruce Grobbelaar flopped over a Kevin Ratcliffe pea-roller in 1986, in a match billed as a title decider, you could clearly hear a mini-Kop choir gleefully bellowing:\" You're a clown, you're a clown! \"Hundreds of Evertonians, unable to get tickets anywhere else in the stadium, had bought tickets for the home end - as they regularly did - and expressed their feelings without censure. When Kenny Dalglish struck after 20 seconds of the same season's Goodison derby, you can clearly see much of the lower central section of the Gwladys Street End celebrating wildly - red bobble hats, the must-have fashion accessory of the day - visible everywhere. Everton and Liverpool fans mixed at matches. Why wouldn't they? There's no religious divide between Everton and Liverpool, no geographical split, every Everton and Liverpool fan reading this article has got brothers or sisters, wives or husbands, friends or work-mates who support the other side. It's a unique situation which once gave rise to the\" friendly derby \"tag. But that friendliness disappeared in the 1990s. And it's no coincidence that fans stopped mixing at matches in that decade. <mark>Peter Robinson</mark>, was an outstanding Anfield administrator, and a man who possessed one of the sharpest brains in football. And he once told me how the mixing at matches ended .\" After Heysel and Hillsborough, ground capacities were reduced dramatically as all-seater stadia were introduced, \"he recalled .\" I think Anfield came down from 48,000 to 42,000. We were the first club to host a derby match after the changes and in order to satisfy our season ticket holders I think the only section remaining for visiting fans was a small standing area of 1,500. \"We reduced the allocation for away fans, but Everton did exactly the same .\" All-seater stadia meant smaller capacities - smaller capacities meant smaller away allocations - and smaller away sections led to a small-minded mentality towards the now isolated away fans creeping in. A more partisan atmosphere was perhaps inevitable as soon as both clubs started creating small, easily identifiable ghettos of away support. Segregation adds to a sense of isolation amongst away fans, a bullying mentality is fostered amongst the majority - and idiots are emboldened without anyone to keep them in check or challenge them. Integration, not segregation, is the way forward. And it's an ideal we seem to be moving away from. On a wing and a prayer...wide men can thrill and spill Terry Curran hasn't been mentioned around Goodison Park for years. But there was a time once when the flamboyant winger was the name on every Evertonian's lips. Curran was a loan signing who in an awful autumn of 1982 injected a much needed spark into a talented but chronically under-achieving side (Sound familiar?) Such was his impact that Blues fans were quickly campaigning for their cash-light board to find the money to sign him on permanently. Everton were still reeling from the trauma of a 5-0 Goodison derby demolition and a run of just one goal scored in four games when Curran arrived on-loan from Sheffield United. The flowing D'Artagnan style locks were totally appropriate for a cavalier footballer (although his team-mates claimed he resembled Roland Rat even more) and his impact was swift. Everton won 2-0 at Ipswich in his second appearance, then ran riot against Luton when Curran was on the scoresheet in a 5-0 victory that had the Gwladys Street roaring his name. He ran, he dribbled, he took players on, he set up chances and helped inject that invaluable but elusive quality into the Everton squad - confidence. After a magnificent seven appearances he returned to Sheffield United, the Blues unable to stump up the money to sign him permanently until the following season, when his impact was significantly reduced. But he had briefly provided a spark for a struggling side - in a manner which would be repeated several times in Everton's future. Wingers, with their licence to run at defenders, have the ability to rouse a crowd and lift their team-mates. Landon Donovan did it in 2010, despite swapping California sunshine for a snowstorm at the Emirates on his debut. He played 13 games, scored twice and was named the club's Player of the Month for his performances in January. When he returned to the US he proudly told his 1.1 million Twitter followers that he was a \"Proud American, Angelino & Evertonian'. He returned by popular demand in 2012 and in a marvellous month took his tally of assists to seven when he set-up Denis Stracqualursi's goal in a 2-0 victory over Chelsea .\" For an autograph signing, Donovan's presence coaxed a line that zigzagged through the merchandise store, snaked out the door and hogged about 300 yards of sidewalk. \"wrote Chuck Culpepper in a New York Times article. Donovan wasn't the only winger to arrive on-loan that transfer window. Steven Pienaar returned from Spurs, created three goals in a 4-0 rout of Fulham and left David Moyes purring:\" All around, he looks as if he enjoys his football here, where he can be appreciated. \"Wingers can lift football clubs, which is what Everton will be hoping Aaron Lennon's direct running and incendiary pace can do between now and the end of the season. Of course signing wingers on-loan does not guarantee an upturn in fortunes. I still remember the nonplussed reaction of my Evertonian editor when I informed him on transfer deadline day 1998 that Everton had\" swoop-ed' to bring back Peter Beagrie to Goodison. Despite his dismay I kept my job. Howard Kendall didn't, after Beagrie got a half-time hook in two of his four starts. <mark>Walter Smith</mark> survived just seven matches following David Ginola's signing in 2002, proving that wingers can either thrill...or spill. Everton FC's Ross Barkley on the Merseyside derby:' I live for big games like this' Everton FC to unveil tribute to Hillsborough 96 ahead of Merseyside derby Memorial plaque to be revealed at Goodison Park ahead of the Merseyside derby between Everton and Liverpool FA Cup draw comment: Trip back to Palace won't have been high up on Liverpool fans' lists Liverpool FC comment: Damien Comolli making \"massive mistake\" by carrying on talking Contact us Want to get in touch? Our full contacts can be found on The Liverpool Echo, PO Box 48, Old Hall Street, L69 3EB Tel: 0151 472 2488 / 0151 472 2529 Fax: 0151 472 2474 Jamie McLoughlin Tel: 0151 472 2498 0151 472 2589 TRAINING Jayne Middlebrook 0870 701 0090 ECHO DIRECT DELIVERY 0845 304 0639 FAMILY ANNOUNCEMENTS here, alternatively send your story via this form. Trinity Mirror Merseyside, the Echo's parent company, is one of the North West's largest multimedia providers reaching more than 900,000 adults every month. The Liverpool Echo, Trinity Mirror Merseyside's flagship brand, is the area's best-read newspaper including national newspapers. The Liverpool Echo reaches 1 in 3 people in the area with a daily readership of more than 256,000 * people. The Liverpool Echo website reaches 1.5 million unique users each month who look at around 8.5 million pages **. for full details. * ABC January-June 2012 ** JICREG Omniture average figures Editor, The Liverpool Echo Editor-in-Chief, Trinity Mirror Merseyside, Cheshire and North Wales Alastair Machray was appointed editor of The Liverpool Echo in 2005 and is also editor-in-chief of Trinity Mirror Merseyside, Cheshire and North Wales. He is a former editor of The Daily Post (Wales and England) and editor-in-chief of the company's Welsh operations. Married dad-of-two and keen golfer Alastair is one of the longest-serving newspaper editors in the country. His titles have won numerous awards and spearheaded numerous successful campaigns.", "articleID": "2015020519_00072500_W", "names": {"Peter Robinson": ["Q15990258", "Q21229743", "Q27922659", "Q29575386", "Q333036", "Q37266874", "Q41787245", "Q41935087", "Q637306", "Q7176623", "Q7176625", "Q7176626", "Q7176627", "Q7176628", "Q7176629", "Q7176630", "Q7176634"], "Walter Smith": ["Q18821916", "Q30600441", "Q359387", "Q54110903", "Q7966162"]}}, {"date": "2015-02-05", "url": "http://wboi.org/post/red-notice-success-draws-treachery-tragedy-putins-russia", "content": "Interview: Andy Downs on Pence Administration's Proposed News Service Bill Browder crosses Red Square in 2004, at the height of the Hermitage Fund's success. Sergei Magnitsky, shown in 2008, was Browder's attorney. He investigated a 2007 incident in which Russian law enforcement officers raided Browder's offices and stole $230 million in taxes that Browder's companies had paid to the Russian government. He was arrested, tortured and, in 2009, beaten to death by eight guards in full riot gear. William Browder's new book, Red Notice, is named for the type of warrant the Russian government has sought from Interpol in hopes of capturing him. Hermitage Capital Management, a company he started in Russia in 1996. That, he says, drew the attention and machinations of a corrupt group of Russian officials. In an interview with NPR's <mark>Robert Siegel</mark>, Browder discusses Red Notice and his experiences in Russia - which he calls \"a place where lies reign supreme\" in his book - as well as why he made an unusual capitalist missionary to the post-Soviet nation. Interview Highlights On growing up as the grandson of a Communist Party USA leader When you come from a family of communists and you go through your teenage rebellion, what's the best way of rebelling from a family of communists? Well, I put on a suit and tie and became a capitalist...there was nothing I could do to upset my family more than that. What was most remarkable about it was that it involved just about everybody right up the chain of command, up to probably a Cabinet-minister level. So they applied for this illegal tax refund after stealing our companies. And they applied for it on the 23rd of December, 2007, and it was approved and paid out one day later - a $230 million tax refund, the largest refund in Russian history, paid out, with no questions asked ....And then the police go around to all of our banks looking for assets - but they didn't find anything there, because I had taken all the money out beforehand. We had $4 billion worth of assets and we sold every last penny and got it out of the country. Russia is an interesting place because they're extremely evil but they're not that good at implementing their evil. So they kicked me out in 2005 and it took 18 months before they actually started moving forward on their scam. As we learned about these raids and their frustration in not finding anything, I started to laugh because, I thought, all this effort...and they didn't get anything. On his lawyer Sergei Magnitsky Sergei was working with us on the investigation. And Sergei as I was laughing said: \"Bill, you shouldn't relax. And the reason you shouldn't relax is there's much more to the story. There's never a sort of clean and happy ending like you think .\" He was an idealist, a man of a new generation of Russians, and he thought that the country was a normal country. And so he thought, if police officers were involved in the theft of $230 million, that he would report that. And so he testified against a number of police officers involved, hoping that the good guys would get the bad guys. Instead, he was arrested in November of 2008. They put him in pretrial detention, and then they started to torture him to get him to withdraw his testimony. They put him in cells with 14 inmates in eight beds, left the lights on 24 hours a day to impose sleep deprivation. They put him in cells with no heat and no window panes in December in Moscow, so he nearly froze to death. They put him in cells with no toilet, just a hole in the floor where the sewage would bubble up ....They wanted to get him to withdraw his testimony against the police officers and sign a false confession to say that he stole the $230 million. And Sergei, in spite of this ever-increasing torture, refused to perjure himself. For him the idea of lying was worse than the idea of being tortured. And so the torture got worse and his health broke down. He ended up losing 40 pounds, getting very severe pains in his stomach and being diagnosed as having pancreatitis and gallstones, and needing an operation. And a week before the operation was due, they came to him again with this Faustian bargain of \"you sign a confession and then you can have your medical care .\" He refused to sign this false confession. He went into critical condition. He was supposed to be taken to a prison with a hospital, but instead they put him in an isolation cell, and eight riot guards with rubber batons beat him to death on Nov. 16, 2009. Encore Again At Trinity Episcopal Church", "articleID": "2015020601_00042503_W", "names": {"Robert Siegel": ["Q2158822", "Q2855841", "Q7349789"]}}, {"date": "2015-02-06", "url": "http://politico.com/story/2015/02/mitt-romney-obama-concession-call-2012-114954.html?hp=t2_r", "content": "It's one of the iconic moments in American politics - never rehearsed, and never pleasant. The loser of a long, expensive presidential campaign telephones the victor with carefully worded pleasantries after the networks have declared a winner. Then the two go before their supporters and a global television audience. But that ritual - designed to signal the polite end of the campaign, and the commitment to unite the country behind the winner - has sparked one final disagreement between the still-bitter camps of President Barack Obama and his 2012 rival, Mitt Romney, with eyewitnesses to the concession call lining up on Thursday to dispute just what was said between the two men. At issue isn't just the political spin, but a footnote of history, destined to be reviewed by anyone who writes about the 2012 presidential race. ALEX ISENSTADT In a passage previewed by the New York Daily News, Axelrod writes that an \"unsmiling\" Obama told those in the room after the call that Romney had said: \"You really did a great job of getting the vote out in places like Cleveland and Milwaukee .\" The president had added, according to Axelrod: \"In other words, black people. That's what he thinks this was all about .\" That sparked a war of tweets and interviews between the camps. Garrett Jackson, Romney's body man throughout the 2012 campaign, told POLITICO that he believes Axelrod \"concocted\" the call. \"When I read that, I was furious,\" Jackson said in a telephone interview from Houston, where he is now a private equity analyst. \"It didn't happen ....I was right next to the Gov. Hell, it was my phone. I was the one who called [Obama aide] Marvin Nicholson ....Mitt goes:\" Mr. President, I just wanted to call and congratulate you and your team on a well-fought race, and congratulate you on your victory .' Then there was a silence on Mitt's end - we weren't on speaker. \"<mark>MIKE ALLEN</mark>\" [H] e didn't do it in a malicious way - there was nothing about voter turnout, \"Jackson added .\" This was a national campaign. When I was giving the Gov. updates, they were macro, and state results. There was never talk of turnout in this city versus that city. \"Later in the day, Tagg Romney, who was also in the room when his father made the call, said in an email to POLITICO:\" Garrett is 100 percent correct...We had no idea what turnout was like in Milwaukee or Cleveland at that point. \"Axelrod is expected to respond to Jackson's account after\" Believer \"is published on Tuesday. But former Obama aides jumped in with a flurry of responses backing his account. <mark>Jim Messina</mark>, Obama's 2012 campaign manager, tweeted:\" Every word of @ davidaxelrod mitt e-night call is true. I was standing with axe & POTUS. That's what happened. \"<mark>Messina</mark> added in a telephone interview:\" He said exactly what David said he said. It's pretty much what Romney said after the election. That's what he thought. \"Jay Carney, former White House secretary, tweeted:\" Account by @ davidaxelrod of POTUS call w/Romney on election night is 100% accurate. I remember it well. \"Greg Whiteley, the filmmaker who chronicled Romney's campaign, said he did not record the call. Whiteley recalled that Romney made the call from a bedroom with Jackson, Tagg Romney, and, possibly, vice-presidential candidate <mark>Paul Ryan</mark> in the room.", "articleID": "2015020606_00037752_W", "names": {"Jim Messina": ["Q3088816", "Q6196934"], "Mike Allen": ["Q3307988", "Q6845851", "Q6845854"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2015-02-08", "url": "http://www.smh.com.au/entertainment/movies/kingsman-director-matthew-vaughn-and-writer-jane-goldman-together-again-20150206-137nf2.html", "content": "Register Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Kingsman: The Secret Service. \"itemprop =\" image \"/> Best of British: Colin Firth stars in Kingsman: The Secret Service. Photo: supplied British director and producer <mark>Matthew Vaughn</mark> and screenwriter <mark>Jane Goldman</mark> have worked together on several film projects, beginning with Stardust in 2007 and including their newest, Kingsman: The Secret Service. <mark>Vaughn</mark> says,\" We've written five and a half things, and they have all actually been made into films. \"(The half refers to X-Men: Days of Future Past, which <mark>Vaughn</mark> was hired to direct but ultimately didn't; the two received a story credit .) <mark>Goldman</mark> added,\" It's weirdly unusual. Which actually describes us. \"Eye spy: Colin Firth's secret agent is inspired by <mark>James Bond</mark> and Austin Powers. Photo: <mark>Sarah Thomas</mark> Weirdly unusual or no, <mark>Vaughn</mark> and <mark>Goldman</mark> seem to have a particularly harmonious taste for surreal ultraviolence that is often disturbingly funny and that has earned them a fair share of controversy (especially when they cast an 11-year-old Chloe Grace Moretz as a lethal schoolgirl in Kick-Ass, from 2010). They also share a love for old British spy characters, encompassing <mark>James Bond</mark> and Austin Powers, evident in X-Men: First Class (2011), and at the forefront in Kingsman, a spy spoof, based on a comic book series by <mark>Mark Millar</mark> that is also a homage to the venerable tradition of dapper men who never spill a vintage whisky while dispatching a foe. Advertisement In Kingsman, a youth from public housing named Eggsy (Taron Egerton) is recruited by Harry Hart, a suave secret agent played, obviously, by Colin Firth. (\"The French have wine, the Germans have cars, we have Colin Firth,\" wrote Stuart Jeffries in an article about the film in The Guardian that asked, \"Why must British spies be so posh?\" ) Hart is straight out of the Classic British Spy handbook, complete with bespoke tailored suit, bulletproof umbrella and a neat line in slinging a beer glass. As Eggsy is tested to see whether he is worthy of Kingsman, an independent international secret service, Hart and his colleagues try to unravel the evil plans of a Bond-worthy villain with a Bond-worthy name: Richmond Valentine. Played by Samuel L. Jackson with a lisp and a Russell Simmons wardrobe, Valentine is a tech billionaire who wants to save the world. In his own very, very special way. Kingsman opened in Britain to lukewarm reviews, and even though the film seems to end with the possibility of sequels, <mark>Vaughn</mark>, 53, and <mark>Goldman</mark>, 44, wouldn't say whether anything else was in the offing. \"It's like being about to give birth and being asked if you want another kid,\" <mark>Vaughn</mark> said. <mark>Goldman</mark> laughed. \"Definitely,\" she said. \"We'll be working on something else .\" In an hour-long telephone chat, <mark>Vaughn</mark>, speaking from London, and <mark>Goldman</mark>, calling from Toronto, did reveal: How They Met: \"Neil Gaiman, whose book Stardust was based on, and whom we both knew, somehow thought I'd be a good fit to write the screenplay, even though I had only written books before,\" explained <mark>Goldman</mark>, a former journalist who has written fiction and non-fiction. \"I think <mark>Matthew</mark> met me as a courtesy .\" <mark>Vaughn</mark> denied that. \"Not out of courtesy, out of desperation,\" he said. \"Most screenwriters do scripts as a way of making money, not as a way of making movies,\" he continued. \"I was so relieved to meet someone fresh, with a voice, who I could be in a room with and who didn't drive me mad .\" At the end of their meeting, <mark>Vaughn</mark> asked <mark>Goldman</mark> when she could start. How They Work Together: \"We don't necessarily fall into the complementary areas that people imagine,\" <mark>Goldman</mark> said. \"People think I do the human interest, and he does the crazy violence, but we crossover quite a lot .\" <mark>Vaughn</mark> made assenting noises. \"When <mark>Jane</mark> started writing gangster dialogue in Kick-Ass, I thought it would be a waste of time, but actually her middle name should be Scarface .\" Usually, they agreed, they have similar sensibilities when it comes to the cartoonlike, extravagant violence that has characterised several of their movies. \"I remember ringing <mark>Jane</mark> up and saying,\" We're going to blow everyone's heads up, and it's going to look like Busby Berkeley'; she thought it was a brilliant idea, \"<mark>Vaughn</mark> said. <mark>Goldman</mark> made assenting noises, then added,\" It's actually not gruesome; it's rather visually beautiful. \"Blowing Up People's Heads and Making It Look as if It Were Busby Berkeley Isn't Easy:\" We went to all these CG special effects guys, and they were all about lasers and stuff, \"<mark>Vaughn</mark> said .\" I couldn't make them understand it had to look good. But I knew this genius guy in France, and I told him what I wanted, and he said \"- <mark>Vaughn</mark> adopted a French accent -\" Eez no probleme, give me two days .' \"Occasionally They Do Conflict:\" The dog scene in Kingsman is the first time we've genuinely disagreed with one another for longer than a few minutes, \"<mark>Goldman</mark> said. For fear of a spoiler, suffice to say that Eggsy must make a difficult decision, which she felt was inappropriate for the hero. Eventually she came up with a solution that <mark>Vaughn</mark> liked .\" I love taking the audience down one path and then subverting expectation, \"he said gleefully. They Had Been Thinking About a Spy Movie for Ages:\" <mark>Matthew</mark> has been talking about it ever since we met, \"<mark>Goldman</mark> said, adding that they had talked a lot about the movies they loved when younger .\" <mark>Roger Moore</mark> was technically our <mark>Bond</mark>, \"she said .\" The things you encounter in your formative years always stay with you. \"<mark>Vaughn</mark> agreed:\" I was very aware of that history and referentiality in Kingsman. I call it a postmodern love letter to the tradition. The best part of shooting the film was when we stopped and <mark>Michael Caine</mark> could tell us stories about Harry Palmer, \"he said, referring to the five films featuring the Len Deighton hero in which <mark>Caine</mark> (who plays the Kingsman head, Arthur) is a secret agent. They Thought of Casting Oscar Pistorius: Valentine's sidekick, Gazelle, uses prosthetic lower legs with, er, killer precision .\" That was before the incident! \"<mark>Vaughn</mark> specified .\" I remember watching some event on TV, and I was mesmerised by the blade runners; I thought it was the most exciting thing I'd see for ages, \"he said .\" But we struggled to find the right guy, and I thought why not make it a woman? We cast a great lady who really had prosthetic legs, but she decided not to do it, and I had a moment of doubt. \"Then they found Sofia Boutella, who has a dance background and whose prostheses were created digitally. She\" could really do all the physical stuff beautifully, \"<mark>Vaughn</mark> added .\" As someone said to me, we've created an iconic, cool disabled person. \"50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Lindt cafe siege survivor Harriette Denny reveals moment she faced death in 60 Minutes interview Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Silvia Colloca to lead audience through gallery in modern take on Orpheus tragedy 50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate 50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Not so black and white: Is Selma's Oscars snub racist, or something else? That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate", "articleID": "2015020812_00047505_W", "names": {"James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"], "Jane Goldman": ["Q19959610", "Q29033681", "Q32661"], "Mark Millar": ["Q2543", "Q6768884"]}}]