[{"date": "2015-02-08", "url": "http://www.smh.com.au/entertainment/movies/kingsman-director-matthew-vaughn-and-writer-jane-goldman-together-again-20150206-137nf2.html", "content": "Register Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Kingsman: The Secret Service. \"itemprop =\" image \"/> Best of British: Colin Firth stars in Kingsman: The Secret Service. Photo: supplied British director and producer <mark>Matthew Vaughn</mark> and screenwriter <mark>Jane Goldman</mark> have worked together on several film projects, beginning with Stardust in 2007 and including their newest, Kingsman: The Secret Service. <mark>Vaughn</mark> says,\" We've written five and a half things, and they have all actually been made into films. \"(The half refers to X-Men: Days of Future Past, which <mark>Vaughn</mark> was hired to direct but ultimately didn't; the two received a story credit .) <mark>Goldman</mark> added,\" It's weirdly unusual. Which actually describes us. \"Eye spy: Colin Firth's secret agent is inspired by <mark>James Bond</mark> and Austin Powers. Photo: <mark>Sarah Thomas</mark> Weirdly unusual or no, <mark>Vaughn</mark> and <mark>Goldman</mark> seem to have a particularly harmonious taste for surreal ultraviolence that is often disturbingly funny and that has earned them a fair share of controversy (especially when they cast an 11-year-old Chloe Grace Moretz as a lethal schoolgirl in Kick-Ass, from 2010). They also share a love for old British spy characters, encompassing <mark>James Bond</mark> and Austin Powers, evident in X-Men: First Class (2011), and at the forefront in Kingsman, a spy spoof, based on a comic book series by <mark>Mark Millar</mark> that is also a homage to the venerable tradition of dapper men who never spill a vintage whisky while dispatching a foe. Advertisement In Kingsman, a youth from public housing named Eggsy (Taron Egerton) is recruited by Harry Hart, a suave secret agent played, obviously, by Colin Firth. (\"The French have wine, the Germans have cars, we have Colin Firth,\" wrote Stuart Jeffries in an article about the film in The Guardian that asked, \"Why must British spies be so posh?\" ) Hart is straight out of the Classic British Spy handbook, complete with bespoke tailored suit, bulletproof umbrella and a neat line in slinging a beer glass. As Eggsy is tested to see whether he is worthy of Kingsman, an independent international secret service, Hart and his colleagues try to unravel the evil plans of a Bond-worthy villain with a Bond-worthy name: Richmond Valentine. Played by Samuel L. Jackson with a lisp and a Russell Simmons wardrobe, Valentine is a tech billionaire who wants to save the world. In his own very, very special way. Kingsman opened in Britain to lukewarm reviews, and even though the film seems to end with the possibility of sequels, <mark>Vaughn</mark>, 53, and <mark>Goldman</mark>, 44, wouldn't say whether anything else was in the offing. \"It's like being about to give birth and being asked if you want another kid,\" <mark>Vaughn</mark> said. <mark>Goldman</mark> laughed. \"Definitely,\" she said. \"We'll be working on something else .\" In an hour-long telephone chat, <mark>Vaughn</mark>, speaking from London, and <mark>Goldman</mark>, calling from Toronto, did reveal: How They Met: \"Neil Gaiman, whose book Stardust was based on, and whom we both knew, somehow thought I'd be a good fit to write the screenplay, even though I had only written books before,\" explained <mark>Goldman</mark>, a former journalist who has written fiction and non-fiction. \"I think <mark>Matthew</mark> met me as a courtesy .\" <mark>Vaughn</mark> denied that. \"Not out of courtesy, out of desperation,\" he said. \"Most screenwriters do scripts as a way of making money, not as a way of making movies,\" he continued. \"I was so relieved to meet someone fresh, with a voice, who I could be in a room with and who didn't drive me mad .\" At the end of their meeting, <mark>Vaughn</mark> asked <mark>Goldman</mark> when she could start. How They Work Together: \"We don't necessarily fall into the complementary areas that people imagine,\" <mark>Goldman</mark> said. \"People think I do the human interest, and he does the crazy violence, but we crossover quite a lot .\" <mark>Vaughn</mark> made assenting noises. \"When <mark>Jane</mark> started writing gangster dialogue in Kick-Ass, I thought it would be a waste of time, but actually her middle name should be Scarface .\" Usually, they agreed, they have similar sensibilities when it comes to the cartoonlike, extravagant violence that has characterised several of their movies. \"I remember ringing <mark>Jane</mark> up and saying,\" We're going to blow everyone's heads up, and it's going to look like Busby Berkeley'; she thought it was a brilliant idea, \"<mark>Vaughn</mark> said. <mark>Goldman</mark> made assenting noises, then added,\" It's actually not gruesome; it's rather visually beautiful. \"Blowing Up People's Heads and Making It Look as if It Were Busby Berkeley Isn't Easy:\" We went to all these CG special effects guys, and they were all about lasers and stuff, \"<mark>Vaughn</mark> said .\" I couldn't make them understand it had to look good. But I knew this genius guy in France, and I told him what I wanted, and he said \"- <mark>Vaughn</mark> adopted a French accent -\" Eez no probleme, give me two days .' \"Occasionally They Do Conflict:\" The dog scene in Kingsman is the first time we've genuinely disagreed with one another for longer than a few minutes, \"<mark>Goldman</mark> said. For fear of a spoiler, suffice to say that Eggsy must make a difficult decision, which she felt was inappropriate for the hero. Eventually she came up with a solution that <mark>Vaughn</mark> liked .\" I love taking the audience down one path and then subverting expectation, \"he said gleefully. They Had Been Thinking About a Spy Movie for Ages:\" <mark>Matthew</mark> has been talking about it ever since we met, \"<mark>Goldman</mark> said, adding that they had talked a lot about the movies they loved when younger .\" <mark>Roger Moore</mark> was technically our <mark>Bond</mark>, \"she said .\" The things you encounter in your formative years always stay with you. \"<mark>Vaughn</mark> agreed:\" I was very aware of that history and referentiality in Kingsman. I call it a postmodern love letter to the tradition. The best part of shooting the film was when we stopped and <mark>Michael Caine</mark> could tell us stories about Harry Palmer, \"he said, referring to the five films featuring the Len Deighton hero in which <mark>Caine</mark> (who plays the Kingsman head, Arthur) is a secret agent. They Thought of Casting Oscar Pistorius: Valentine's sidekick, Gazelle, uses prosthetic lower legs with, er, killer precision .\" That was before the incident! \"<mark>Vaughn</mark> specified .\" I remember watching some event on TV, and I was mesmerised by the blade runners; I thought it was the most exciting thing I'd see for ages, \"he said .\" But we struggled to find the right guy, and I thought why not make it a woman? We cast a great lady who really had prosthetic legs, but she decided not to do it, and I had a moment of doubt. \"Then they found Sofia Boutella, who has a dance background and whose prostheses were created digitally. She\" could really do all the physical stuff beautifully, \"<mark>Vaughn</mark> added .\" As someone said to me, we've created an iconic, cool disabled person. \"50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Lindt cafe siege survivor Harriette Denny reveals moment she faced death in 60 Minutes interview Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Silvia Colloca to lead audience through gallery in modern take on Orpheus tragedy 50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate 50 Shades of commerce - Ringing tills no slapdash affair as demand outstrips supply in places That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate Not so black and white: Is Selma's Oscars snub racist, or something else? That Sugar Film from Damon Gameau turns spotlight on the sweet taste of excess Craig McLachlan - taking contrasting roles of Frank N Furter and Lucien Blake deliberate", "articleID": "2015020812_00047505_W", "names": {"Matthew Vaughn": ["Q2593", "Q30524398"], "Michael Caine": ["Q123351", "Q16197877"], "Roger Moore": ["Q134333", "Q16856350", "Q18217772", "Q30069648", "Q30069829", "Q30075236", "Q30075241", "Q30075250", "Q30075253", "Q30075265", "Q30083185", "Q30083221", "Q30083238", "Q30083257", "Q30094638", "Q30094640", "Q30094641", "Q30502305", "Q30542705", "Q3439296", "Q3940091", "Q7358135", "Q7358675"], "Sarah Thomas": ["Q13115054", "Q18536428", "Q2224511", "Q3950332", "Q40005", "Q56098806", "Q7422824", "Q7422826", "Q7422827"]}}, {"date": "2015-02-09", "url": "http://www.themalaysianinsider.com/world/article/same-sex-couples-marry-in-alabama-after-us-supreme-court-refuses-stay", "content": "World Same-sex couples marry in Alabama after US Supreme Court refuses stay Same-sex couples began marrying in Alabama after the US Supreme Court refused a request by Alabama's attorney general to keep such marriages on hold. - Reuters pic, February 9, 2015. Same-sex couples began marrying in Alabama on Monday, defying an attempt by the chief justice of the state's Supreme Court to block probate judges from issuing marriages licences to gays and lesbians. A ruling by the US Supreme Court on Monday helped clear the way for Alabama to become the 37th state to allow same-sex couples to marry. Justices refused a request by Alabama's attorney general to keep such marriages on hold until the court rules whether laws banning them are constitutional. \"We wanted to be part of history,\" said Dee Bush, 40, who received one of the first marriage licences issued to same-sex couples in Birmingham, Alabama. She and her partner of seven years, Laura Bush, quickly wed in a park outside the courthouse. Alabama Supreme Court Chief Justice <mark>Roy Moore</mark> had sought to throw up a last-minute roadblock for marriages between gay and lesbian couples. Late Sunday, the socially conservative justice issued an order directing probate judges in his state not to hand out marriage licences to people of the same sex. He said judges were not bound by a federal ruling that last month struck down Alabama's ban on same-sex marriages. US District Court Judge Callie Granade, an appointee of President George W. Bush, ruled in January that Alabama's prohibition on same-sex marriage was unconstitutional, but put her decision on hold until Monday. Two of the US Supreme Court's conservative justices, Clarence Thomas and Antonin Scalia, dissented from the court's decision not to further delay gay marriage in Alabama. In a dissenting opinion, Thomas hinted that the court's actions in allowing marriages to go ahead \"may well be seen as a signal of the court's intended resolution of that question .\" In April, the Supreme Court is set to hear oral arguments in cases concerning marriage restrictions in Michigan, Kentucky, Ohio and Tennessee. A ruling due by the end of June will determine if 13 state bans will remain intact. There has been a legal sea change, thanks in large part to the US Supreme Court. It began in June 2013 when the court struck down a federal law that restricted, for the purpose of federal benefits, the definition of marriage to heterosexual couples. Judges around the country later seized on the language in the high court decision, written by swing vote Justice <mark>Anthony Kennedy</mark>, to strike down a series of state bans.", "articleID": "2015020916_00012088_W", "names": {"Anthony Kennedy": ["Q11171", "Q59192346"], "Roy Moore": ["Q17466511", "Q27924997", "Q5302905"]}}, {"date": "2015-02-10", "url": "http://abc13.com/news/white-house-american-isis-hostage-has-died/511492/", "content": "Personalize your weather by entering a location. WASHINGTON--Kayla Mueller, a 26-year-old American woman held by Islamic State militants, has been confirmed dead, her parents and the Obama administration said Tuesday. The White House said that Mueller's family received a private message from her captors over the weekend. The information in the message was authenticated by the U.S. intelligence community. \"We are heartbroken to share that we've received confirmation that Kayla Jean Mueller, has lost her life,\" Carl and Marsha Mueller said in a statement. \"Kayla was a compassionate and devoted humanitarian. She dedicated the whole of her young life to helping those in need of freedom, justice, and peace .\" President Barack Obama said that Mueller, who was worked with Syrian refugees, \"epitomized all that is good in our world .\" \"No matter how long it takes, the United States will find and bring to justice the terrorists who are responsible for Kayla's captivity and death,\" the president said. The Islamic State group said Friday that Mueller had died in a Jordanian airstrike. HPD: Top 10 most stolen cars in Houston Plane makes emergency landing at Bush IAH without nose gear Plane makes emergency landing at Bush IAH without nose gear RAW VIDEO: Plane makes emergency landing at Bush IAH Family loses $500,000 lawsuit over barking dog Son accused in parents' and sibling's murder back in Houston Spider-Man set to join the Avengers' world VIDEO: Implosion of old Las Vegas casino Recipe you can create at home for Valentine's Day dinner <mark>Don Collins</mark> guilty of capital murder in Robbie Middleton's death PHOTOS: Grammys red carpet fashion Inside ABC-13: Behind the scenes photos PHOTOS: Kids' race raises funds for reading program Copyright © 2015 ABC Inc., KTRK-TV Houston. All Rights Reserved. Personalize your weather by entering a location.", "articleID": "2015021015_00071947_W", "names": {"Don Collins": ["Q1626928", "Q28059278", "Q5292441"]}}, {"date": "2015-02-12", "url": "http://news8000.com/news/us-little-league-champs-lose-title/31212778", "content": "Published On: Feb 11 2015 10:10:55 AM CST But now those feelings, like the championship, are no more. Little League International announced Wednesday that it is vacating all of the <mark>Jackie Robinson</mark> West squad's wins from last year's tournament, including from the Great Lakes regionals and U.S. championship, because some of its players lived outside its assigned boundaries. Mountain Ridge Little League, out of Las Vegas, officially becomes the 2014 U.S. champ in its place. The international youth baseball organization also suspended <mark>Jackie Robinson</mark> West's manager, ousted the local district administrator and barred the program from tournament play. Reflecting on what he called \"a heartbreaking decision,\" Little League International President Stephen Keener said the Chicago team's players can still be proud of what they accomplished last year. \"But it is unfortunate that the actions of adults have led to this outcome,\" Keener added. \"...As painful as this is, we feel it a necessary decision to maintain the integrity of the Little League program. No team can be allowed to attempt to strengthen its team by putting players on their roster that live outside their boundaries .\" <mark>Brandon Green</mark>, a player on the <mark>Jackie Robinson</mark> West team, said the players weren't involved in anything that should cause the squad to be stripped of its title. \"We know that we're champions, our parents know that we're champions...and Chicago knows we're champions,\" he said at a news conference. Chicago Mayor Rahm Emanuel called Keener and the two spoke for 10 minutes, a spokeswoman for the mayor, Kelley Quinn, said. Emanuel told the Little League official that the players didn't deserve to be punished. The organization should have sanctioned the adults, he said. \"You have turned them into the perpetrators when they are the victims,\" Emanuel told him, according to his spokeswoman. \"You know what they have done for Chicago, and let's face it, you know what they've done for your tournament .\" Named for the icon who broke baseball's color barrier and consisting entirely of African-Americans, the <mark>Jackie Robinson</mark> West squad proved that, despite talk to the contrary, baseball was not dead among inner-city youth. The Illinois team earned raves after knocking out Sports Illustrated cover girl Mo \"ne Davis' Philadelphia team and rolling to the U.S. championship contest. It entered that game as an underdog to Las Vegas, which had beaten every team it faced--including crushing Chicago by a 13-2 score. The title game was a much more even affair. The two squads swapped leads before Chicago jumped ahead for good with a three-run fifth inning en route to a 7-5 win. In the World Series final the following day, <mark>Jackie Robinson</mark> West rallied late but couldn't overcome the eventual champions from South Korea. That loss didn't halt the positive feelings about the team. Everyone from former Chicago White Sox great and baseball Hall of Famer <mark>Frank Thomas</mark> and longtime Obama adviser <mark>David Axelrod</mark> cheered their success. Emanuel credited\" their positive attitude and success on the field (for rallying) people from every neighborhood. \"The team was celebrated with a parade through their hometown and even a visit to the White House in November, where they met President Barack Obama, a Chicago resident. At the time of the Washington visit, local Little League officials were already investigating thanks to a tip from a neighboring district's official and documentation. Little League International initially determined that all of <mark>Jackie Robinson</mark> West's players were eligible. In the middle of December, though,\" Little League began to learn of multiple issues with boundary maps and operational process with multiple leagues in Illinois District 4, \"the international organization said in a statement. Several more meetings followed, including one on January 31 when several issues came up, including that\" <mark>Jackie Robinson</mark> West Little League used a falsified boundary map for their 2014 tournament and that <mark>Jackie Robinson</mark> West Little League officials met with other leagues in District 4 to try to get the territory they wrongfully claimed was theirs for their 2014 tournament. \"\"During our review, it became clear that both <mark>Jackie Robinson</mark> West officials and (the) District Administrator...signed documents to make players eligible who should not have been,\" Keener said. UP NEXT / / La Crosse police: Lock your doors Please set an email address for your profile. To complete your registration on this site, please supply an address.", "articleID": "2015021205_00047684_W", "names": {"Brandon Green": ["Q3445712", "Q4956876"], "David Axelrod": ["Q1251914", "Q519838"], "Frank Thomas": ["Q16091336", "Q16106478", "Q3082827", "Q3082840"]}}]