[{"articleID": "2016121223_00216526_W", "names": {"Frank Vogel": ["Q1444383", "Q2456047", "Q36935609"], "Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"], "King James": ["Q17100723", "Q36159"], "Brad Stevens": ["Q18164413", "Q4954288"], "Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"], "Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2016-12-12", "url": "http://ca.sports.yahoo.com/news/hawks-hope-keep-trending-vs-magic-224720473--nba.html", "content": "Hawks hope to keep trending up vs. Magic 21 minutes ago   ATLANTA--The Atlanta Hawks have had a split personality this season, going from terrific during a 9-2 start that featured a six-game winning streak to horrific during a 1-10 swoon that included seven losses in a row. Now are the Hawks ready to return to their good selves? It is a very small sample size, but Atlanta is showing positive signs in winning its past two games and will try to build momentum when it hosts the Orlando Magic on Tuesday night. If the Hawks (12-12) do end up having the season they hoped, coming back from a 20-point halftime deficit to win at Milwaukee on Friday may be looked on as the turning point. Atlanta had shown little resiliency during its slump, losing back-to-back games by 36 and 44 points. That wasn't the case against the Bucks, though. \"The message was, don't lose by 20,\" forward Paul Millsap said after the win in Milwaukee. \"Don't do it again. It was just about having some pride, going out there and trying to get it done.\" Millsap, who missed three games during the losing streak with a bad hip, had 23 points and 14 rebounds during the comeback victory, and point guard Dennis Schroder scored a career-high 33 points. The Hawks have had three days off since the victory and they need to pick right back up from where they left off in Milwaukee. \"We have to take care of business Tuesday,\" Millsap said. \"Get another win and keep building off the last game we've had. Hopefully, we'll continue to get better like we did (Friday).\" \"We have to have the right mindset from the jump ball on Tuesday,\" coach Mike Budenholzer said. The Magic (10-15) lost 17 of their past 22 games against the Hawks and come to Atlanta on a three-game losing streak. Orlando was stingy defensively early this season. That hasn't been the case lately. \"It's just frustrating,\" Magic coach <mark>Frank Vogel</mark> said after Saturday's 121-113 home loss to Denver. \"When you're trying to build something, it takes daily work, daily habits. We certainly have slipped on the defensive end.\" Power forward Nikola Vucevic took a hard fall during the loss at Charlotte on Friday and sat out the Nuggets game because of a lower back contusion. He is questionable against the Hawks, as is center Bismack Biyombo with a sore left shoulder. The Magic salvaged a split of the four-game season series against the Hawks a year ago, winning the final two games. Vucevic was a big part of that, scoring 22 and 28 points. Hawks guard Kent Bazemore missed the last three games because of a sore knee, with Tim Hardaway Jr. taking his place in the starting lineup. Atlanta's other recent lineup change is defensive-minded Thabo Sefolosha starting a small forward and Kyle Korver coming in to add offense when needed. \"I think Kyle can be really effective off the bench,\" Budenholzer said when making the move four games ago. \"I think it will be beneficial for both of them and us.\" Sports & Recreation The D-League will experiment with four and five-person referee crews The NBA's minor league will attempt, in an experimental run, to work with four or five referees in a single game. If the experiment could pan out, the move could go a long way toward pushing the NBA to move toward the use of four or five-person...More & raquo; Ball Don't Lie - 10 minutes ago Hawks hope to keep trending up vs. Magic The Atlanta Hawks have had a split personality this season, going from terrific during a 9-2 start that featured a six-game winning streak to horrific during a 1-10 swoon that included seven losses in a row. Now are the Hawks ready to return to...More & raquo; AP - Sports - 21 minutes ago LeBron to be producer of <mark>Ali</mark> documentary <mark>King James</mark> is set to tell the story of The Greatest. Cleveland Cavaliers star LeBron James will be the executive producer of an HBO documentary on <mark>Muhammad Ali</mark>, who died earlier this year. The as-yet-untitled film will be directed by Antoine...More & raquo; AP - Sports - 1 hour 15 minutes ago MIAMI (AP)--The NBA is going to take a look at having more officials on the court ....More & raquo; AP - Sports - 2 hours 9 minutes ago The Vertical's Chris Mannix and Bobby Marks discuss the floundering Mavs and if the rebuild needs to start with trading the face of their franchise ....More & raquo; Yahoo Sports Videos - 2 hours 14 minutes ago The Celtics received a hoax bomb threat while flying from Boston to Oklahoma City Coach <mark>Brad Stevens</mark> knew of the threat, but his players did not. By the time the Boston Celtics landed in Oklahoma City on Saturday evening, fears surrounding the city's infamous haunted hotel probably felt like child's play in comparison to what...More & raquo; Ball Don't Lie - 2 hours 19 minutes ago LeBron James wore a safety pin on the cover of Sports Illustrated This week's Sports Illustrated features the announcement that LeBron James has been named the magazine's Sportsperson of the Year for 2016. Sports Illustrated named LeBron James its 2016 Sportsperson of the Year. If we're being honest, the first...More & raquo; Ball Don't Lie - 4 hours ago Introducing Cost Per Win and the list of most valuable NBA free-agent signings Kevin Durant has tuned out the noise and turned up the Warriors. Consider it a refresher course on the free agents, coaches, trades, rookies and potential award winners that have shaped the league thus far. NBA teams spent more than $4 billion on...More & raquo; Ball Don't Lie - 4 hours ago NEW YORK (AP)--John Legend will return to the NBA All-Star weekend as the game's halftime performer, it was announced Monday ....More & raquo; AP - Sports - 5 hours ago After months of optimism surrounding a potential new collective bargaining agreement that would allow the NBA and the players' union to avoid another work stoppage, the momentum has slowed a bit as a critical date approaches ....More & raquo; AP - Sports - 5 hours ago Porzingis, Rose lead Knicks past Lakers Carmelo Anthony was thrilled when several Knicks took turns hitting big shots while they held off the Lakers. The Lakers had a similar rhythm going, and now they've lost it. Kristaps Porzingis had 26 points and 12 rebounds, Derrick Rose scored 25...More & raquo; AP - Sports - 16 hours ago Holiday time for Pelicans as New Orleans rally past Suns (The Sports Xchange) - With <mark>Anthony Davis</mark> struggling through a rare poor shooting night, the New Orleans Pelicans were forced to rely on the supporting cast to rally the team and pull out a rare road win. Jrue Holiday scored 16 of his 23 points in...More & raquo; Reuters - 16 hours ago Russell Westbrook lost his triple-double streak, but he still killed the Celtics Bad news, Russell Westbrook: rather than going one up on them, you're going to have to settle for just hanging out alongside Oscar Robertson and <mark>Michael Jordan</mark> for basketball eternity. Westbrook saw his historic streak of triple-doubles snapped at...More & raquo; Ball Don't Lie - 16 hours ago Highlights of Sunday's National Basketball Association games: Thunder 99, Celtics 96 Russell Westbrook scored 37 points to lead the Oklahoma City Thunder to a 99-96 victory over the Boston Celtics on Sunday, though his streak of consecutive...More & raquo; Reuters - 16 hours ago Catch up on all the action from around the league in Sunday's edition of The Fast Break ....More & raquo; NBA.com - 16 hours ago NBA-Holiday time for Pelicans as New Orleans rally past Suns With <mark>Anthony Davis</mark> struggling through a rare poor shooting night, the New Orleans Pelicans were forced to rely on the supporting cast to rally the team and pull out a rare road win. Jrue Holiday scored 16 of his 23 points in the fourth quarter and...More & raquo; Reuters - 16 hours ago Derrick Rose scores 25 points with three boards in the Knicks win over the Lakers ....More & raquo; NBA.com - 17 hours ago Kristaps Porzingis records a double-double with 26 points and 12 rebounds as the Knicks take care of the Lakers on the road ....More & raquo; NBA.com - 17 hours ago Frazier's triple-double keys Pelicans Triple-doubles are nothing new to Tim Frazier. Now he can add one with the New Orleans Pelicans, and that is a much bigger deal. Frazier had 14 points, a career-high 11 rebounds and 11 assists, helping the Pelicans rally from a 15-point...More & raquo; AP - Sports - 17 hours ago Late-fading Kings set to host Lakers Not long ago, Sacramento center DeMarcus Cousins watched how his team performed in the fourth quarter of games, especially late, and opined that the Kings were one of the league's best in the game's final minutes. The Kings (8-15) will be coming...More & raquo; AP - Sports - 17 hours ago"}, {"articleID": "2012050918_00103717_W", "names": {"Andrew Zimmern": ["Q19854616", "Q2405404"], "Chris Young": ["Q2964901", "Q2964905", "Q2964906", "Q47541480", "Q5108544", "Q952176"], "Brad Thomas": ["Q494807", "Q4954310"], "Jeff Scott": ["Q18637860", "Q42322479", "Q6174929"], "Gabrielle Hamilton": ["Q2697881", "Q5516072"]}, "date": "2012-05-09", "url": "http://startribune.com/lifestyle/150802825.html", "content": "locally, <mark>andrew zimmern</mark> received an award for his travel channel show \"bizarre foods with <mark>andrew zimmern</mark>.\" get your checkbook out. the james beard foundation announced the results of its cookbook awards--as well as broadcast, journalism and restaurant/chef awards--and the winning cookbooks could use a place on your shelf. cookbook of the year: \"modernist cuisine,\" by nathan myhrvold with <mark>chris young</mark> and maxime bilet. cookbook hall of fame: laurie colwin for \"home cooking\" and \"more home cooking.\" american cooking: \"a new turn in the south: southern flavors reinvented for your kitchen,\" by hugh acheson. baking and dessert: \"jeni's splendid ice creams at home,\" by jeni britton bauer. beverage: \"bitters: a spirited history of a classic cure-all, with cocktails, recipes & formulas,\" by <mark>brad thomas</mark> parsons. cooking from a professional point of view: \"modernist cuisine,\" by nathan myhrvold with <mark>chris young</mark> and maxime bilet. general cooking: \"ruhlman's twenty,\" by michael ruhlman. focus on health: \"super natural every day: well-loved recipes from my natural foods kitchen,\" by heidi swanson. international: \"the food of morocco,\" by paula wolfert. photography: \"notes from a kitchen: a journey inside culinary obsession,\" author/photographer <mark>jeff scott</mark>. reference and scholarship: \"turning the tables: restaurants and the rise of the american middle class, 1880-1920,\" by andrew p. haley. single subject: \"all about roasting,\" by molly stevens. writing and literature: \"blood, bones & butter: the inadvertent education of a reluctant chef,\" by <mark>gabrielle hamilton</mark>. on a local note, <mark>andrew zimmern</mark> won a beard award in the category of \"television program, on location: bizarre foods with <mark>andrew zimmern</mark>,\" on the travel channel. the james beard foundation, founded in 1986, celebrates and preserves america's culinary traditions."}, {"articleID": "2010013020_00179081_W", "names": {"Leon Taylor": ["Q1818914", "Q517281"], "David White": ["Q16194395", "Q17402764", "Q18668702", "Q19519442", "Q21063316", "Q21623298", "Q22076684", "Q266207", "Q353983", "Q41429213", "Q5241016", "Q5241017", "Q5241021", "Q5241022", "Q5241025", "Q54322010", "Q58195813"]}, "date": "2010-01-30", "url": "http://highschool.rivals.com/content.asp?CID=1045874", "content": "sheldon hagigal's season hasn't gone as smoothly as he'd planned. first, the aggressive combo guard was sidelined with a leg injury for 5 weeks, watching his westbury teammates eat defeat in the most challenging non-league games of their schedule. once he returned and worked his way back into action, personal reasons not only yanked him out of the line up, but had him mia from games altogether. \"i got in trouble with my mom for doing something wrong\" , the 6' 2 junior reflected. \"she took me off the team for a bit, but she (eventually) changed her mind and let me play basketball again.\" with westbury on a losing skid that pushed them out of the top 10last week (with their second loss to elmont this season), hagigal returned to action just in time with a 28 point, 11 rebound performance to help catapult westbury to a sorely needed win over their league rival south side cyclones, 65-64, in ot. hagigal wasn't bashful about making up for lost time, keeping westbury afloat with a buffet of mid-range jumpers, treys and coast to coast reverse lay-ups to start the game. south side would reciprocate, thanks to a cyclone of a start from 6' 5 big man brett cohen, who did much of the same. with westbury top gun paris abrams and south side's answer, <mark>leon taylor</mark>, both cold to start, hagigal and cohen would get a bit of help from the role players. 6' 3 forward ryan spadaford twisted his way to the hoop to give the cyclones a 12-7 lead, but lucens victor would help hagigal tie it up to end the first period. both teams would stay on each other's heels for much of the second quarter, making mini-runs and keeping each other honest. cohen's fast break lay-up gave the cyclones a four point lead, 23-19, but hagigal calmly waltzed up to the arc and buried a triple to close the gap. with the pace picking up and <mark>taylor</mark> beginning to percolate, westbury answered with a dose of diamond pressure. eventually, they would recapture the lead when mikey hooks nailed a three at the halftime buzzer to put westbury up, 29-27. westbury would open up the second half in a blaze, pressing, trapping and eventually going up six, 33-27. but south side adhered to the game script by making a counter-run, and a coast to coast lay-in from cohen brought them back within a deuce, 37-35. thanks to a solid display of defensive hustle and some play making prowess from lamard herron - pg tyrece redd didn't arrive until the third quarter - hagigal was able to convert on the break and in the paint. but the cyclones stuck around, and when redd turned the ball over with the quarter winding down, cohen converted on the other end to tie it at 43, sending the cyclones' home crowd into a frenzy. from that point onward, it was anyone's game. abrams sent home a trey to give westbury a 51-45 lead, but once again, here come the cyclones. <mark>david white</mark> answered with a long ball of his own, and moments later (after eating up 32 seconds of shot clock), julius jones dittoed with one from the corner to tie it at 51 with 4:12 left in regulation. both teams would take turns answering each other, but south side's 2-3 zone began to put the clamps on westbury's half court set down the stretch. with westbury seemingly limited to fast break points, the cyclones looked to have the momentum despite the game being a one possession affair throughout the waning moments. with the game tied at 57 and under a minute left, jones muscled in a put back to give the cyclones the edge and left westbury with only one shot to seal the deal. abrams' desperation shot rimmed out, but the 5' 9 redd slipped into the paint for the put back with time running out, saving the game and sending the nassau a rivals packing for a trip to overtime. the back and forth plot continued at the start of the extra session, but the turnover bug suddenly bit both teams. with 46.9 seconds on the clock, the score was tied at 63, and westbury's allegiance to defense stunted south side in their half court set, to the point of nailing the cyclones with a 35 second violation. with 12.3 on the clock, westbury finally broke the silence when herron's short inbound pass to hagigal was powered in from deep in the post for a point blank lay-up to give them a 65-63 lead. herron was forced to foul <mark>taylor</mark> with 0.7 left in the game and westbury in the bonus, making it seem as if double overtime was on the radar. <mark>taylor</mark>'s first attempt drew silence from the gym, as it bounced around the cylinder for a good two seconds and eventually dropped, sending the home crowd into pandemonium. the second attempt, however, didn't share the same fortune, and westbury escaped a two game in-league slide at the hands of the persistent cyclones. \"i'm just glad to be back and i'm happy we were able to pull out the\" w' \", hagigal said.\" we needed this \""}, {"articleID": "2019080216_00061003_W", "names": {"Robert Bradford": ["Q19596744", "Q7342296"], "Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-08-02", "url": "http://www.windsorobserver.co.uk/news/17813001.launch-lyra-mckee-book-bittersweet-family/", "content": "News Launch of Lyra McKee book \"bittersweet' for family By Press Association 2019 Nichola Corner 0 comment The sister of Lyra McKee has described seeing her book in print as\" bittersweet \". The 29-year-old journalist was shot dead by dissident republicans in April just weeks before her book, Angels With Blue Faces, was due to be published. Her murder while observing a riot in the Creggan area of Londonderry sparked outrage across the world. Irish President Michael D Higgins, former prime minister Theresa May and Taoiseach Leo Varadkar were among the mourners who attended her funeral. The book follows an investigation by Ms McKee into the murder of Ulster Unionist MP <mark>Robert Bradford</mark> in 1981, and examines speculation that he had been about to expose details of people involved with the abuse of children at the east Belfast boys' home Kincora. Lyra McKee was killed while observing a disturbance (Chiho Tang/Oranga Creative/PA) In the book, Ms McKee writes that she began her research when she was 22 years old and was inspired to write a non-fiction story that read like a novel. Her sister Nichola Corner said they were so proud to see her book in print but wished she was there to share the moment.\" We're extremely proud of her, it's obviously very bittersweet that she is not here with us to hold it because the book had meant so much to her and had circumstances been different we would have been celebrating this achievement with her. Unfortunately she isn't here to celebrate it but that doesn't meant we are not still proud of her. \"Our pride continues and we are so pleased she got it into a print version because she wanted it so much for so long for other people to read the story as well.\" Ms Corner said her sister came upon Mr <mark>Bradford</mark>'s murder while investigating another story at the Linenhall Library in Belfast. Taoiseach Leo Varadkar, ex-PM <mark>Theresa May</mark>, President Michael D Higgins and Lord Lieutenant of Belfast Fionnuala Jay-O’Boyle during the funeral service for murdered journalist Lyra McKee at St Anne's Cathedral in Belfast (PA) The library was the venue on Friday for the launch of Ms McKee's book. \"She was researching about the Kincora scandal when she had come across news reports about <mark>Robert Bradford</mark> and she initially wondered who he was, and began looking into him a little bit more,\" she said. \"The story was really born here in this library, and then her curiosity became insatiable and she wanted to know absolutely everything about him, the circumstances of his murder, and that became the springboard for her delving deeper and deeper into the story.\" She felt she needed to tell their story in order to try and clear up some rumours that had surrounded the nature of the murder. \"Lyra McKee's partner Sara Canning attended the book launch (Liam McBurney/PA) Ms McKee's book had been due to be published by Excalibur Press before her death. Excalibur Press owner Tina Calder said publishing the book had been an emotional time for her team, but said it is\" an immense honour to be able to bring Lyra's life's work into the public eye \".\" Excalibur Press will be donating our commission to our not-for-profit entity The Merlin Project where we hope to run a series of events, workshops and potentially courses for young reporters wanting to learn some of the practical aspects of the industry, \"she said.\" Taking inspiration from Lyra and her talent, we hope to teach young journalists the art of research as well as interview techniques and more. \"Angels With Blue Faces published by Excalibur Press is available now, priced £ 9.99, from excaliburpress. co. uk/lyra-mckee. 0 comment"}, {"articleID": "2013061210_00050350_W", "names": {"George Wallace": ["Q3101983", "Q43913855", "Q48817450", "Q5545830", "Q5545832", "Q5545834"]}, "date": "2013-06-12", "url": "http://www.ledger-enquirer.com/2013/06/11/2540957/richard-hyatt-commentary-a-front.html#storylink=rss", "content": "Richard Hyatt: An eventful year for the Muscogee County school board When Forrest Gump nervously peered over the shoulder of a fellow in a federally issued suit standing next to the feisty rooster that was <mark>George Wallace</mark>, Mike Raiford had seen enough. \"I was there,\" he exclaimed. His wife told him to be quiet, that everybody in the movie theater could hear him, but Raiford had to tell someone. \"No, I was there.\" On a day that his home state commemorated the 50th anniversary of <mark>Wallace</mark>'s defiant charade in the schoolhouse door, Raiford talked about a 17-year-old freshman from Phenix City that, on his first day at the University of Alabama, had a front-row seat to history. It was a great movie, but Forrest Gump wasn't really there. And there's no record of him toting a football for Bear Bryant either. Winston Groom, his creator, was on campus though, and so was Raiford. Ink was still wet on his Central High diploma when Raiford's family drove him to Tuscaloosa. He had never been away from home alone when they left him at his dormitory on June 7, 1963. That weekend, Raiford and some buddies went to town for a movie, and when they got back, the campus was sealed off, teeming with state troopers, conservation officers, policemen from all over the state and members of the Alabama National Guard. There were as many news people as there were lawmen. \"Word was out there was going to be trouble,\" he says. \"I thought to myself,\" this college life was going to be exciting .' \"Everybody knew <mark>George Wallace</mark> was taking a stand against integration on Tuesday. The governor didn't care what the White House said. Black students weren't registering at his alma mater. The doorway to Foster Auditorium would be his stage. What transpired was nothing but political theater.\" \"Little <mark>George</mark>' took up his position to stand against the federal government--at least that's what they told us. Standing all around were serious-looking men wearing dark suits in the Alabama heat.... I had never seen as many people carrying guns in my life.... It was over quickly. The guard marched in, and the governor left in his limo with the crowd cheering him on. I was caught up in the moment.\" As his car crept past Raiford and his friends, <mark>Wallace</mark> waved and they waved back. \"He gave us the victory sign. I may have given him one back,\" he said. Ceremonies Tuesday marked those events. Articles have tried to put that landmark day in perspective, claiming it led to the creation of a different Alabama. In an era of violence, no guns were fired and no blood was shed. Such things went over Raiford's head in 1963: \"We went back to the dorm and found a game of pool.\" <mark>Wallace</mark> went on to run for president three times, and at one campaign stop, he was seriously wounded, relegating him to a wheelchair for the last 26 years of his life. Raiford graduated from Alabama in 1967 and never had a black classmate. He served in the Air Force, finished law school and came home to practice law. That spectacle 50 years ago is only a memory. \"It was like a non-event after it happened,\" he said. \"We went back to the dorm and never talked about what we had seen. I didn't know how important it was until later.\" Raiford doesn't call it a watershed event in his own maturity or his view of other races. \"Something inside of me had always told me those things were wrong, but what could I do? You don't get above your raisin',\" he said .--Richard Hyatt is an independent correspondent. Reach him at www.twitter.com/hyattrichard .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}, {"articleID": "2016051009_00530807_W", "names": {"Matt Johnson": ["Q16227645", "Q1909207", "Q19874778", "Q21280798", "Q21621607", "Q25209047", "Q3299487", "Q3299489", "Q3299490", "Q3852014", "Q42116160", "Q43132123", "Q45293540", "Q6788852", "Q6788855", "Q6788856", "Q6788858"], "Nick Wilson": ["Q18631174", "Q2278624"]}, "date": "2016-05-10", "url": "http://northernpublicradio.org/post/us-attitudes-change-some-evangelicals-dig-others-adapt", "content": "As U.S. Attitudes Change, Some Evangelicals Dig In; Others Adapt By Tom Gjelten • 27 minutes ago Share Twitter Facebook Google + Email VIEW SLIDESHOW 1 of 2 The audience at last month's Together for the Gospel conference in Louisville, Ky.. cvi photography VIEW SLIDESHOW 2 of 2 Albert Mohler, president of the Southern Baptist Theological Seminary, is urging conservatives to put the \"protest\" back in Protestantism. Emil Handke / Southern Baptist Theological Seminary America's culture war, waged in recent years over gender roles, sexuality and the definition of marriage, is increasingly being fought inside evangelical Christian circles. On one side are the Christians determined to resist trends in secular society that appear to conflict with biblical teaching. On the other side are the evangelicals willing to live with those trends. For Albert Mohler, president of the Southern Baptist Theological Seminary in Louisville, Ky., the key question is \"whether or not there is a binding morality to which everyone is accountable.\" Mohler is a cofounder of the biannual Together for the Gospel conference, which brought together thousands of evangelicals last month at a sports center in Louisville, a few miles from the Southern Baptist campus. Electronic signs around the top of the arena carried such messages as \"We Were Born Out of Protest\" and \"We Stand On Scripture Alone, Not Man's Wisdom.\" \"Our theme for this year is,\" We Protest,' \"Mohler tells NPR.\" You might say [it's] putting the \"protest' back in Protestantism.\" He and his fellow conservative leaders urge Christians to take a \"biblical\" stand against such things as no-fault divorce, extramarital sex, transgenderism, and gay marriage. His new book is We Cannot Be Silent: Speaking Truth to a Culture Redefining Sex, Marriage, & the Very Meaning of Right & Wrong. Mohler and other conservatives are pushing against strong headwinds, however. Survey data show that the number of Americans who think divorce is morally acceptable has increased significantly in recent years, while disapproval of homosexuality and same-sex marriage has declined sharply. [Click to see changing attitudes on homosexuality and same-sex marriage by religion .] The latter holds true even for white evangelicals, among the groups most resistant to LGBT rights. For church leaders like Mohler, the challenge is unmistakable. \"Conservative Christians in America are undergoing a huge shift in the way we see ourselves in the world,\" Mohler says. \"We are on the losing side of a massive change that's not going to be reversed, in all likelihood, in our lifetimes.\" In his view, Christians must adapt to the changed cultural circumstance by finding a way \"to live faithfully in a world in which we're going to be a moral exception.\" (It is this goal, Mohler says, that explains the passage of \"religious liberty\" laws to protect people who want to express their opposition to same-sex marriage or transgenderism .) \"At Odds With What Everyday People Believe' Living as the moral exception was the prospect facing the Together for the Gospel attendees. Most were young men, training to be pastors in Southern Baptist churches. The Southern Baptists are one of the Protestant denominations that do not ordain women, even as church deacons. Some Southern Baptist congregations do not even allow divorced men to serve as pastors. Many in their millennial generation may reject conservative thinking on social issues, but the young men who choose to be Southern Baptist pastors have full knowledge of the church teachings. Their church mandate is somewhat limited: not to persuade the broader culture of new moral truths but rather to help their own congregants live their lives as a\" moral exception \"to the rest of society.\" The Bible makes claims about what is right and wrong, and those claims are often at odds with what everyday people believe, \"says Southern Baptist seminary student Joshua Van der Merwe, 24, of Louisville, during a break between conference sessions.\" Christians are called to protest and to witness to what the Bible claims to be right and wrong. \"An insistence on strict Bible-based standards of morality may exclude some of those everyday people, however. For them, one alternative is Ridgewood Baptist Church in a working-class suburb of Louisville. The pastor, <mark>Matt Johnson</mark>, grew up as a Southern Baptist, but his church is one of a group that broke from the Southern Baptist Convention about 25 years ago. It now serves a diverse congregation, and the men and women who make up <mark>Johnson</mark>'s lay advisory\" Dawnings \"committee advocate that it opens doors to everyday people.\" Let's offer words of hope, \"<mark>Johnson</mark> prayed at a recent Dawnings meeting.\" Hope for the future of what could happen here, who could come here and find a place to belong. \"The committee members included Janney Gilbert, a medical office manager whose son is gay, Estelle Power, a retired former deacon who became involved in the church after a painful divorce, and Janelle Perry, whose mother was the first female deacon at Ridgewood and who now serves as the church's youth director.\" I've been here all my life, and Ridgewood is not the same church we were 40 years ago, \"Perry says.\" Everyone can come. Some people are taken aback by that--[and] women deacons. And we'll let most anybody attend ....We're just open-armed. \"It is not that the church serves highly educated liberals who might be expected to support a progressive agenda. The surrounding community, according to <mark>Johnson</mark>, is\" a conservative area, with a lot of folks who feel disenfranchised. I'd say it represents the new face of poverty. \"The Role Of Women Economic stress can be hard on marriages, and Ridgewood's membership includes several people who have been divorced.\" I don't know what I would have done without this church, \"Power says.\" I felt I was the only person in the world that was going through a divorce. \"Now 76, Power says she has found others at Ridgewood whose lives didn't necessarily fit a church ideal. She can relate to them, she says, because of her own experience.\" I've made some friends, just saying hello, \"she says,\" and somebody would say, \"You're so kind .' I said,\" No, I'm just who I am .' But I do think that it makes you a little more humble when you go through something. \"Power grew up in rural Kentucky with divorced parents. Her father drank too much, but listened faithfully to Baptist preachers on the radio. Having heard bad things all her life about women who divorced, she welcomed the less judgmental attitude at Ridgewood.\" There are people who have stopped going to church because they think that all that church is is a place where you're being condemned, \"<mark>Johnson</mark> says,\" and where you're just told, \"This is what you have to think .'\" Such people, he says, are among those whom he now hopes to reach with his own ministry. The church's rupture with the Southern Baptist Convention was in a dispute over the role of women. Southern Baptists believe that men and women \"complement\" each other but are not interchangeable, which is why women are not allowed to serve in prominent church leadership roles. Mohler says the church position on complementary gender roles may seem outdated but comes straight from the Bible. \"It's an entire pattern of complementarity that we see woven throughout the account of scripture,\" he says, \"from Genesis 1:26 -28 all the way to the Book of Revelation. So it's not a minor matter to suggest that the church can somehow just update its understanding of gender. This is where we must be found faithful, regardless of the cultural understanding around us.\" More than 15 million Americans attend Southern Baptist churches. Many Christians yearn for the certainty and direction that come with a life based on a strict reading of the Bible. With the culture rapidly changing around them, however, the future of conservative evangelical Christianity is not clear. By contrast, the more moderate Baptist churches would seem to have an ever-growing market. On the other hand, some of the people who have soured on the Southern Baptist approach now reject church altogether. The evangelical Protestant share of the U.S. population is declining, so the growth prospects for a congregation like Ridgewood Baptist are also unclear. From the outside, with a cross prominently placed on the plain brick front, it looks like any other Baptist church in Louisville. <mark>Nick Wilson</mark>, the church pianist and most prominent gay member, says he would never have approached Ridgewood had he not heard it was a welcoming church. \"Driving by, seeing Ridgewood Baptist Church, I would not stop,\" he says. \"I would just assume that I already know what's going on inside those doors, and I'm not welcome, or I don't want to be part of it, and would go on.\" <mark>Nick Wilson</mark>'s story on being Baptist and gay will air on All Things Considered and publish online later today. Copyright 2016 NPR. To see more, visit NPR. View the discussion thread."}, {"articleID": "2017100802_00350610_W", "names": {"Kenny Hill": ["Q17523843", "Q20090908", "Q6391078", "Q6391081"], "Gary Patterson": ["Q25189982", "Q5525722", "Q5525724"], "David Sills": ["Q5239788", "Q5239790"]}, "date": "2017-10-08", "url": "http://www.kristv.com/story/36546240/tcu-only-undefeated-team-left-in-big-12", "content": "TCU only undefeated team left in Big 12 - KRISTV.com | Continuous News Coverage | Corpus Christi TCU only undefeated team left in Big 12 - KRISTV.com | Continuous News Coverage | Corpus Christi Member Center: TCU only undefeated team left in Big 12 Posted: Updated: TCU logo FORT WORTH, Texas (AP) - <mark>Kenny Hill</mark> scored three different ways, and got the winning score by avoiding three defenders as No. 8 TCU remained the only undefeated team in the Big 12 Conference. <mark>Hill</mark> eluded a defender in the backfield and lunged forward through two more Mountaineers for a 3-yard touchdown run with 2:53 left in a 31-24 victory over No. 23 West Virginia on Saturday. \"This team and the coaches trust me with the ball down there. That means a lot,\" <mark>Hill</mark> said. \"It gives you a lot of confidence.\" That winning TD run came only five plays after an apparent interception was reversed on a replay review, and after <mark>Hill</mark> had already thrown a 45-yard TD pass and been on the receiving end of a 48-yard score for the Horned Frogs (5-0, 2-0 Big 12). \"It seems like every week, you guys believe this wants to be a drama about <mark>Kenny Hill</mark>,\" coach <mark>Gary Patterson</mark> said. \"The guy's 5-0.\" <mark>Hill</mark> is only the second Big 12 player to throw, run and catch a touchdown in a conference game during the league's 22 seasons, while two players have done it in nonconference play, the last in 2008, according to STATS Inc.. Will Grier threw for 366 yards and three TDs for West Virginia (3-2, 1-1), including two long catch-and-run scores in a span of about 2 1/2 minutes late in the third quarter. It was tied at 24 after Grier hooked up with <mark>David Sills</mark> V on a 64-yard scoring play and then Ka'Raun White for a 76-yarder. TCU led 7-3 at halftime in the only game Saturday matching Top 25 teams, and after third-ranked and two-time defending Big 12 champion Oklahoma (4-1, 1-1) was upset at home by Iowa State. \"It was a close game. Everything that happened in the first half, throw it away,\" West Virginia coach Dana Holgorsen said, when asked what he told his team at the half. \"If we outplay them in the second half, we're probably going to win the game - and we didn't.\" After those two long West Virginia TDs, the Frogs used a little trickery to go ahead again. KaVontae Turpin took a handoff and swept to the right before stopping and throwing back to <mark>Hill</mark>, who sprinted down the left sideline for the score. It was a play TCU had worked on in practice, and <mark>Hill</mark> had told coach Sonny Cumbie he would score if it got called in a game. \"I was like\" Oh, let's go .' It just worked out. \"<mark>Hill</mark> said.\" Overall, that's just a great team effort. \""}, {"articleID": "2019120605_00112959_W", "names": {"Doug Collins": ["Q18352424", "Q3162841", "Q5300375", "Q919954"]}, "date": "2019-12-06", "url": "http://uspolitics.einnews.com/article/504098815/m766lHgP9KXGdChx", "content": "Top Judiciary Republican Says White House Should Participate In Inquiry, With Caveats By Jason Breslow Thursday, December 5, 2019, 8:12 pm Share: With Democrats in the House of Representatives formally moving to draft articles of impeachment against President Trump, the top Republican on the committee that will author those articles is saying the White House should participate in the impeachment inquiry. But participation should happen only, he says, \"when there is an actual opportunity in which it is a situation in which they can present, do the presentation that they need to.\" In a forceful critique of the impeachment inquiry, Rep. <mark>Doug Collins</mark> of Georgia, the ranking member of the House Judiciary Committee, accused Democrats of making White House participation all but impossible by not allowing for \"a robust set of hearings.\" \"At the end of the day, if people don't believe what you're doing is fair, then it doesn't matter,\" <mark>Collins</mark> said in an interview Thursday with All Things Considered host Mary Louise Kelly. Speaking from his office on Capitol Hill, <mark>Collins</mark> said Republicans on the Judiciary Committee are not being given the opportunity to question the fact witnesses who have testified before the House Intelligence Committee since the start of the impeachment inquiry in September. Republican members of the Intelligence Committee were present for those testimonies and were allowed to question the witnesses. The White House has blocked key witnesses from testifying in the inquiry and declined to participate in this week's Judiciary Committee hearing but has left open the possibility of participating in future proceedings. <mark>Collins</mark> argued thatDemocrats are presuming guilt and creating a scenario for the president where \"you have to prove your innocence...and that's just not the way our system works.\" <mark>Collins</mark>' remarks followed the announcement by House Speaker Nancy Pelosi, D-Calif ., earlier Thursday that Democrats will begin the process of drafting articles of impeachment. Addressing reporters against a backdrop of American flags, Pelosi said the president had \"abused his power for his own personal political benefit\" by seeking to pressure a foreign nation into conducting politically motivated investigations to aid his reelection. \"His wrongdoing strikes at the very heart of our Constitution,\" Pelosi said. \"Our democracy is what is at stake. The president leaves us no choice but to act because he is trying to corrupt, once again, the election for his own benefit.\" <mark>Collins</mark> said the announcement was \"only breaking news if you've been in hibernation for the last year,\" adding, \"They've been wanting to do this.\" The Democratic case against Trump was detailed in a scathing 300-page report released by the Intelligence Committee on Tuesday. In the report, Democrats allege that the president sought to coerce Ukraine into opening an investigation into former Vice President Joe Biden by withholding $391 million in U.S. assistance for Ukraine, as well as aWhite House meeting long coveted by Ukraine's president, Volodymyr Zelenskiy. The report's release was followed on Wednesday by the start of formal impeachment proceedings in the Judiciary Committee. Wednesday's hearing featured testimony from four constitutional scholars who were called to answer whether the president, in his dealings with Ukraine, engaged in \"treason, bribery, or other high crimes and misdemeanors,\" the threshold for impeachment as spelled out in the Constitution. From his perch as the Judiciary Committee's top Republican, <mark>Collins</mark> has emerged as one of Trump's chief defenders in the battle for public opinion. In his interview with NPR, the former attorney and military chaplain said he did not believe the president has done anything wrong and said he had no issue with the way Trump has conducted himself in regards to Ukraine. \"He did nothing wrong. The call did not show anything wrong,\" he said, referring to the White House's account of the July 25 call between Trump and Zelenskiy that helped spark the inquiry. \"At the end of the day, it's not about holding anything accountable,\" <mark>Collins</mark> said of the impeachment inquiry. \"It's about next year's election for them, to make sure that he is damaged going into an election cycle.\" <mark>Collins</mark> also pushed back against the charge among Democrats--and a potential article of impeachment--that the White House has obstructed the work of Congress through its decision, detailed in an Oct. 8 letter by White House counsel Pat Cipollone, to not cooperate with the impeachment inquiry. Democrats say that since that order, the administration has failed to produce a single document in response to 71 specific demands for information. They also say that at the president's direction, 12 current or former administration officials have refused to testify in the inquiry, including 10 officials who refused to in defiance of subpoenas. <mark>Collins</mark> said the remedy is not to rush forward with impeachment but to allow the process to play out in the courts. \"There is a precedent for the president himself, not just for himself, but for the presidency, to make sure that there are certain constitutional bounds that they're claiming and privileges that they're claiming,\" said <mark>Collins</mark>. Democrats, however, have said they are not willing to allow the White House to run out the clock on impeachment through a court fight, and they say the evidence they have already collected is enough to impeach the president. The Judiciary Committee is scheduled to hold its second hearing in the impeachment inquiry on Monday, when counsel for Democrats and Republicans on the Intelligence Committee will discuss the evidence against the president. In a letter on Thursday to the chairman of the Judiciary Committee, Rep. Jerry Nadler, D-N.Y., <mark>Collins</mark> said Republicans on the committee should be allowed a hearing day before articles of impeachment can move forward. Meanwhile, the White House faces a Friday deadline to inform the committee on whether it will participate in future proceedings. A vote by the full House on whichever impeachment articles are adopted by the Judiciary Committee could come by the end of the month. The process would then move to the Senate, where 20 Republicans would need to break ranks and join Democrats to reach the 67 votes, or two-thirds majority, required to convict and remove the president from office. Given those numbers, <mark>Collins</mark> said there is nothing to indicate impeachment can pass the Senate. \"Many of us believe it's already been decided,\" he said. \"Why waste our time?\" Copyright 2019 NPR. To see more, visit NPR. Commenting Policy Wisconsin Public Radio and WPR.org welcome civil, on-topic comments and opinions that advance the discussion from all perspectives of an issue. Comments containing outside links (URLs) will only be posted after they've been approved by a moderator. WPR.org will delete comments that violate our guidelines. Visit our social media guidelines for more information about these policies. Sponsored by: Keep updated on the latest news and information. Sign up now!"}, {"articleID": "2017060410_00746174_W", "names": {"Carlos Correa": ["Q2754588", "Q57055498", "Q58499542", "Q82518", "Q9696967"], "Carlos Beltran": ["Q1042743", "Q5041829"], "Lance Mccullers": ["Q6483471", "Q6483473"], "Martin Perez": ["Q3078130", "Q3850348"]}, "date": "2017-06-04", "url": "http://abc13.com/sports/mlb-best-astros-win-over-rangers/2064758/", "content": "SPORTS MLB-best Astros win 9th in a row with 6-5 win over Rangers Email share share tweet email AP Texas Rangers & #39; Andrew Cashner, left, talks with catcher Jonathan Lucroy and manager Jeff Banister, right, on the mound during a game against the Astros & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros & #39; Jose Altuve sits in the dugout in the first inning of a baseball game against the Texas Rangers on Saturday, June 3, 2017 & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Houston Astros first baseman Yuli Gurriel sits in the dugout during a baseball game against the Texas Rangers on Saturday, June 3, 2017, Texas. & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros & #39; Norichika Aoki of Japan heads to third during a baseball game against the Texas Rangers in the fourth inning & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Texas Rangers second baseman Rougned Odor fields a ground ball from the Houston Astros during a baseball game, & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros shortstop <mark>Carlos Correa</mark> fields a ground ball from the Texas Rangers during a baseball game, Saturday, June 3, 2017, in Arlington, Texas. & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Houston Astros & #39; Jose Altuve & #40; 27 & #41; gets a little help stopping from Texas Rangers second baseman Rougned Odor after sliding into second during game & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Sunday, June 04, 2017 05:36 AM A.J. Hinch isn't getting caught up in the streaks or all the impressive things the Houston Astros are doing this season. Their manager is just relishing each victory, and the Astros have 40 of them after winning their major league-best ninth in a row with a 6-5 victory over the Texas Rangers on Saturday night.\" It means we've put a lot of games together in a row successfully, \"Hinch said.\" We don't get caught up in first to 40, or leads. It's June and we're trying to win as many games as we can. \"<mark>Carlos Beltran</mark> had three hits and drove in three runs, Jose Altuve capped his three-hit game with a key homer leading off the ninth and the Astros (40-16), with best record in the majors and best start in franchise history, are already 14 games ahead of two-time defending division champion Texas.\" Everyone is having a good year, everyone is swinging the bat well so it's kind of rare to see that from top to the bottom, anyone could do damage, \"<mark>Beltran</mark> said.\" It's fun for us. For other people, I don't know how much fun it is. \"The Rangers are 3-10 since a 10-game winning streak last month that is still the longest in the majors this season - a mark the Astros have a chance to match in the series finale Sunday. Six Astros pitchers combined for 18 strikeouts, which came only nine days after Rangers hitters matched an MLB record for a nine-inning game with 20 strikeouts against five Boston pitchers. That included four strikeouts by second baseman Rougned Odor hitting fifth. His first three strikeouts came with runners in scoring position, and the last ended the game with a runner at first.\" Obviously he was a guy who was so good for us last year and obviously good for us in certain stretches this year, \"manager Jeff Banister said.\" Hitters go through certain stretches and this one is obviously challenging. \"<mark>Beltran</mark>'s seventh homer leading off the second tied the game at 1-all after the Rangers got a quick run off <mark>Lance McCullers</mark> in his first start since being named the AL pitcher of the month in May. The Astros went ahead to stay after six straight batters reached with one out in the third, and four of them scored. <mark>Carlos Correa</mark> had a tiebreaking RBI single before <mark>Beltran</mark>'s two-run single off Andrew Cashner (2-5).\" You can go through so many guys tonight that stepped up and made big pitches or had big at-bats, \"Hinch said. Chris Devenski (4-3) worked 1 2/3 scoreless innings after taking over for <mark>McCullers</mark> in the fifth. Ken Giles worked the ninth for his 15th save in 16 chances even while allowing an RBI single by Adrian Beltre. <mark>McCullers</mark> struck out eight but gave up six hits and four runs - three earned - in 4 1/3 innings. He was coming off a month of May when he was 4-0 with a 0.99 ERA when he allowed only four earned runs in 36 1/3 innings. MARRIED MAN Elvis Andrus, who got married Thursday when the Rangers had a day off, had three hits and drove in three runs. He had a two-run double in the fifth and scored on Beltre's one-out single that chased <mark>McCullers</mark>. CLOSING IN ON MILESTONES Beltre has 2,950 career hits, including eight in five games since his season debut this week after missing the first 51 games because of calf issues ....Astros LF Norichika Aoki got his 1,995 th career hit, his 711th in the majors to go with 1,284 he had in Japan. WELL, HELLO When third baseman Beltre fielded a grounder in the fifth, he tagged <mark>Beltran</mark> for the final out. The two, teammates with the Rangers at the end of last season, ended up in an awkward hug,\" He was trying to tag me. I had nowhere to go, so I just ended up giving him a hug for the great career that he's had in baseball, \"<mark>Beltran</mark> said. TRAINER'S ROOM Rangers: 1B Mike Napoli left in the fifth inning because of back spasms ....LHP Cole Hamels (right oblique strain) is scheduled to have his first bullpen session Sunday since sustaining a right oblique strain while warming up and being a last-second scratch before his scheduled start May 2 at Houston. UP NEXT Astros: Houston is going for its 10th consecutive road victory, which would match the team record set in 1989. Rangers: <mark>Martin Perez</mark> (2-5) starts as the Rangers try to avoid being swept in a series at home for the first time since losing three straight to Cleveland to start the season. Report a Typo Related Topics: sports Houston Astros Texas Rangers MLB Texas Email share share tweet email (Copyright © 2017 by The Associated Press. All Rights Reserved .) Load Comments Please enable JavaScript to view comments. SPORTS Freebies, deals and fun events this year at Astros' games Bear crashes round of golf in Alaska UH gears up for NCAA baseball regionals NBA handshakes steal the show before the game even begins More Sports Top Stories Dodging scattered downpours this weekend Police: 6 dead, 30 + injured in London attacks Trump argues for travel ban after attacks hit London Sand artists build awe-inspiring castles in Galveston Free Press attendees feel safe, even after London attack Convicted rapist on the run last seen in Houston Lightning puts damper on Free Press Summer Fest Show More PHOTOS: Aftermath of\" terror incidents' in London Detectives: Dealers peddled cocaine from pizza boxes Consider this new Houston bar like your own backyard 2 injured after suspect crashes into Humble home VP Pence coming to Houston next week More News Photos PHOTOS: Aftermath of \"terror incidents' in London PHOTOS: Celebrities who have been arrested PHOTOS: 21 children missing in Houston this year PHOTOS: Throwback Thursday pics of ABC13 talent More Photos"}, {"articleID": "2017112017_00433135_W", "names": {"Tom Kitt": ["Q2439786", "Q7816484"]}, "date": "2017-11-20", "url": "http://broadwayworld.com/industry/article/Industry-Editor-Exclusive-1984-and-Beyond-How-the-Tony-Awards-Committee-Makes-Their-Determinations-20171120", "content": "Industry Editor Exclusive: 1984 and Beyond - How the Tony Awards Committee Makes Their Determinations Tweet Share Last week, the Tony Awards Administration Committee made news when it declared 1984 ineligible to receive a Tony Award. The decision covered not only the play itself, but everyone who worked on it. What happened? The official statement from the Tony folks was generic: \"1984 has been deemed ineligible by the Tony Awards Administration Committee. The show did not fulfill all of the eligibility requirements, as outlined by the Tony Rules and Regulations.\" News quickly spread that nominator Jose Antonio Vargas, a journalist, had not been invited, breaking the Tony rules which state you have to invite all the nominators and voters. There are 50 nominators, each invited by the press office (which had no comment on the issue). Why the production chose not to invite Vargas is unknown. The New York Times reported 1984 producer Scott Rudin had a beef with Vargas because of the writer's criticism of the film THE SOCIAL NETWORK, which Rudin also produced. That does not make much sense to me because Vargas is not a new nominator, so an issue from 2010 (the year the movie was released) would have impacted him before now. But we don't know the complete truth and we may never know it. We also don't know if Vargas will be invited to Rudin's upcoming shows--and he is a lead producer on at least three more this season--though one would think so. The thing to understand for the future is how these things work. This season there were 50 nominators announced. To give you an idea of how that number has risen in the last decade: for the 2007-2008 season it was 27 and then it started growing. Each season there started to be additional nominators, perhaps because of a desire to diversify the pool. Though surprisingly this season the number is down from last season's tally of 51. Of course not everyone nominates. Every year a certain amount of people back out, sometimes because of conflicts of interest but also often because they failed to see all the shows. Last season nine stepped aside. This season, of the 50 announced, composer/lyricist/orchestrator <mark>Tom Kitt</mark> has already withdrawn because of his involvement in the new musical SPONGEBOB SQUAREPANTS. Producers have to invite the current list of those nominating though. That is what makes this seemingly controversial decision non-controversial: the rules clearly state producers need to invite all nominators and voters. The Administration Committee has great discretion otherwise. Too much in many cases in fact. The Tony Awards Administration Committee is comprised of 24 members, of whom 10 are designated by the Wing, 10 by the League, and one each by the Dramatists Guild, Actors' Equity Association, United Scenic Artists, and the Society of Stage Directors and Choreographers. There are alternates so the number stays consistent if someone is conflicted and has to drop out. These folks determine a ton throughout the season. Scene from 1984. Photo Credit: Julieta Cervantes Usually Tony eligibility goes along with opening night billing. Actors above the title are leads, below featured. However billing doesn't always match with reality. Sometimes star names go above-the-title even when the relevant actor has a small role; other times everyone is below-the-title, even clear leads. A producer must provide the Tony Awards Administration Committee a letter expressing what his/her position is regarding the categorization of productions and potential nominees, whether that letter says simply \"we agree the opening night title page should remain as-is for nominating purposes\" or whether a modification is requested. If a modification is requested, the reasons for this must be spelled out. Then the Administration Committee can do what it wishes. In 2013, I was extremely angry that the Administration Committee chose to make Kristine Nielsen, perennially below-the-title, eligible in the lead actress category without a request from the producers of VANYA AND SONIA AND MASHA AND SPIKE. She would have won featured, but Cicely Tyson was too much competition in lead. On occasion, the Committee goes against the wishes of even powerful producers (SHUFFLE ALONG as new musical, for example) and then sometimes they do perplexing things upon request (for instance Chita Rivera is moved down to featured for the revival of THE MYSTERY OF EDWIN DROOD when that character was considered a lead when the show was on Broadway originally). Last season I was surprised that the Administration Committee confirmed no one from PARAMOUR was a lead, despite it being obvious that there was a male and female lead of that show. And the above is just choices regarding acting. The Administration Committee sets the rules and enforces them more generally. Particularly troubling is the latitude the members are given to decide what is a \"classic\" and therefore eligible as a revival even if it has never been on Broadway before. Also there is a rule that even if a show isn't eligible for various reasons other than that they didn't invite nominators or voters, elements of the production that do not \"substantially duplicate any prior presentation of the play or musical\" can be eligible. So new designers, choreographers, actors and directors are often eligible even if a show is not. There is discretion on what it means to \"substantially duplicate\" though: last season CATS' producers thought Andy Blankenbuehler, whose work was \"based on the original choreography by Gillian Lynne,\" was new enough to garner eligibility, the Administration Committee disagreed. Christopher Gattelli, on the other hand, was nominated for the Lincoln Center revival of THE KING AND I, despite his work being \"based on the original choreography by Jerome Robbins.\" I thought the book of GIGI should be eligible, the Tony Awards folks did not. Eligibility rulings are made throughout the season and each time they come in we read and analyze them within minutes. Sometimes they are demonstrably wrong and reconsiderations are granted - I personally take some credit in Jason Robert Brown getting a Tony nomination for URBAN COWBOY after his work was originally deemed ineligible. But back then there was a precise guideline: over 50% of a score was new, it could be eligible. Now it is more amorphous, with producers self-reporting what percentage of a score is new and the Administration Committee determining eligibility without a set rule. (Although I suspect it is still in practice 50%, nothing has been close enough to test it in recent years .) An appeal and reversal requires more than \"I think you got it wrong.\" In fact, under the rules, technically Administration Committee decisions are not to be changed. So, while it has happened, it's extremely rare. Therefore 1984 will remain ineligible. In a season of few plays, no elements of 1984 will be in contention for any Tonys. As the show is closed, it didn't need to splash those nominations in promotional ads. One must think that the people who could have been nominated would have liked the honor however. Related Articles"}]