[{"articleID": "2016091005_00478380_W", "names": {"Harsha De Silva": ["Q56254066", "Q5673820"]}, "date": "2016-09-10", "url": "https://politicslk.wordpress.com/2016/09/10/ban-ki-moons-lament/", "content": "Did the United Nations Secretary General Ban Ki Moon commit a Hanuman when he spoke of the Ruwanda and Srebrenica massacres with our war against terrorism in the same breath? The Joint Opposition believes our country's image was deliberately tarnished--especially ahead of the upcoming war crimes probe proposal. Skills Development and Vocational Training Minister Mahinda Samarasinghe, in a special media briefing, insisted that the media had got it wrong. The UNSG, he stated, never compared Sri Lanka to the aforementioned massacres, but mentioned situations that had been far worse than in Sri Lanka. The UN Spokesperson Farhan Haq however simply stated that the UNSG's words spoke for itself. Ban's exact words were, \"Something more terrible, serious happened in the past. In 1994, in Rwanda, there was a massacre. More than one million people were massacred. United Nations felt responsible for that .\" Of course, it was their war and massacres. But the United Nations was not able to act on it. We said repeatedly, \"Never again, never again'. It happened just one year after in Srebrenica .\" Again, many people were massacred when they were not fully protected by the United Nations Peacekeeping Operations. So we repeated again, \"Never again' .\" How many times should we repeat never, never again? We did again in Sri Lanka. We have to do much more not to repeat such things in Sri Lanka, Yemen and elsewhere. \"Interestingly, the UN.org skips over this contentious quote and highlights that while Ban\" commended efforts to move forward on a comprehensive transitional justice agenda and on a constitutional reform process, as well as symbolic steps such as the decision to sing the National Anthem in Sinhala and Tamil on the country's Independence Day last February, he had said, \"These steps have built confidence and trust, and strengthened transparency and accountability. But more can and should be done to address the legacy of the past and acknowledge the voices of the victims...There is still much work to be done in order to redress the wrongs of the past and to restore the legitimacy and accountability of key institutions, particularly the judiciary and the security services' .\" UN.org also highlights from Ban's speech, \"Here in Sri Lanka, the world's work for human rights faced one of its most difficult tests. The decades-long civil war saw terrible violence, terrorism, the use of human shields and other grievous violations of human rights and humanitarian law. In the conflict's decisive final stages, tens of thousands of civilians perished. The war was ended--an unquestionable good for Sri Lanka, the region and the world. But we also know that even in its ending, the price was high .\" I again commend Sri Lankans for examining the difficult period you have now begun to leave behind. I am sure those efforts will continue to generate important lessons for the international community that can save many lives in many places. \"It is very interesting how Ban came to the conclusion that\" tens of thousands of civilians perished \". He is beholden to expose his source that other respective official reports had not had access. It is also very interesting how Sri Lankans examining this\" difficult period \"will\" generate important lessons for the international community that can save many lives in many places \". Be that as it may, disputing the JO Leader Dinesh Gunwardena interpretation of Ban's remarks, Acting Foreign Minister Dr <mark>Harsha de Silva</mark> opinionated in Parliament that Ban's visit and remarks improved Sri Lanka's image overseas. On that note, it is pertinent to visit the Ruwanda and the Srebrenica massacres that were subsequently ruled as those constituting genocide. The Rwandan Genocide The majority Hutu aimed to totally cleanse the minority Tutsi from Rwanda in 1994. From April 7 to mid-July, it is estimated that as many as 70 percent of the Tutsi and 20 percent of the Rwandan population perished. Hutu, Tutsi and Twa are the main groups in Rwanda, sharing the common language Banyarwanda. Hutu and Tutsi were of the same ethnicity, but of different castes. Traditionally, Tutsi herded cattle while Hutu farmed the land. Since 18th century, Tutsi became the more dominant and in a corvee system Hutu were forced to work for Tutsi Chiefs. The colonial era did not improve Hutu. s situation. Their traditional land was privatized, but were hardly compensation. Though the Belgians modernized Rwanda with large scale projects in health, education, agriculture and public works, Hutu were disenfranchised and subject to large scale forced labor. After World War II, Hutu began to agitate for their freedom. Tutsi also began to agitate for independence on their own terms. In the resulting clashes, the Belgian administration sided with Hutu and Rwanda regained its independence in 1964 with a Hutu dominated republic. To avoid Hutu reprisals, more than 300,000 Tutsi fled to neighboring countries and remained in exile for three decades. Tutsi refugees formed armed groups and frequently attacked Rwandan territory, which led to a cycle of further reprisals on Tutsi and more exiles. With President Juvenal Habyarimana ascending to power in 1973, violence against Tutsi reduced somewhat. However, Tutsi refugees continued to seek a military intervention. Chiefly, the Rwandan Patriotic Front with the backing of Uganda engaged in a guerrilla warfare. After the second peace negotiation attempt, in 1993 the two parties agreed on the Arusha Accords. It accommodated RPF in the Broad-Based Transitional Government as well as in the national army. The peacekeeping force, United Nations Assistance Mission for Rwanda arrived and the RPF were given room in the national parliament building for use during the setting up of the BBTG. These peace negotiations earned Habyarimana enemies from both his government and military. This also saw the rise of several radical youth militia. Many of them were trained and armed with machetes and so on by the army during the early ’90s to combat RPF led terrorism. There was also a concentrated racist propaganda against Tutsi's. In 1993, Burundi's first ever Hutu president was assassinated by Tutsi army officers. This further exacerbated the feelings of mistrust and reinforced Tutsi as the enemy. On January 11, 1994, UNAMIR commander, General Romeo Dallaire, warned UN headquarters that plans were afoot for Hutu militia to kill Belgium members of UNAMIR to force their withdrawal. Though the commander requested permission to protect his source and his family, the then UNSG Kofi Annan refused the operation--even after the commencement of the genocide. His reasons are unclear as the UNAMIR was established with the consent of both parties to the conflict. Thus the intervention would have been by the UN and not a member state. Then, UNAMIR could not be charged with intervening as it was requested and consented by both parties and authorized by the UN Security Council. On April 06, President Habyarimana was assassinated. The crisis committee that formed refused to allow PM Agathe Uwilingiyimana to take over--even though Dallaire insisted. When 10 Belgium soldiers from UNAMIR escorted her to Radio Rwanda to address the nation, soldiers and civilians overwhelmed her escort and forced them to surrender their weapons. They were then tortured and killed. PM and her husband too were killed. That night and the following day, prominent politicians and journalists were hunted down and killed. Dallaire notes, by April 07 noon, the political leadership was either dead or hiding. Anarchy and genocide followed. The military hierarchy blamed the RPF for the president's assassination and ordered the Hutu to\" begin their work \"and spare none--not even babies. In villages where families knew each other, Tutsi were easily identified and killed. In towns, roadblocks were set and Tutsi identified by their identity cards. They were then summarily executed. HIV-infected men were formed into\" rape squads \". Tutsi women and even Hutu women who were married to Tutsi men or harbored Tutsi were raped. In the aftermath, many survivors were infected with HIV and/or with unwanted pregnancies. It is estimated that in the first six weeks, as many as 800,000 Rwandans were killed. Yet, except for the advancing RPF, there was no other counterforce. UNAMIR were expressly forbidden to intervene, except in self defense. On June 23, a French-led UN force of about 2,500 soldiers entered Rwanda. That humanitarian mission went awry when the genocidal authorities also displayed the French flag on their vehicles, luring Tutsi from their hiding. Interestingly, at the beginning, the French launched a military operation with Belgians' and UNAMIR's assistance to evacuate expatriates from Rwanda. They however separated Tutsi spouses and only evacuated their families of foreign nationality. Those who boarded the evacuation trucks were forced off at checkpoints, where they were killed. The French, who were close to Habyarimana and regarded the RPF as a threat to their influence, however rescued several high profile members of Habyarimana's government. As RPF slowly gained control, Hutu en masse, fearing reprisals, fled to neighboring countries. By July 18 the genocide was officially over. The Srebrenica Genocide Following WWI, Bosnia was incorporated into the South Slav kingdom of Serbs, Croats and Slovenes, which together was named Yugoslavia. As Yugoslavia began to disintegrate, a referendum for independence was held on February 29, 1992. At the time, the Bosnian multiethnic composition comprised 44 percent Bosniaks, 31 percent Orthodox Serbs and 17 percent Catholic Croats. Bosnian Serbs firmly rejected the results, which was in favor of independence. However, the European Community (former European Union) and America formally recognized the Republic of Bosnia and Herzegovina. Bosnian Serbs, with the support of Serbian Government of Slobodan Milosevic and the Yugoslav People's Army (JNA), attacked the newly formed republic to unify and secure Serb territory. The region around Srebrenica (Central Podrinje), a predominantly Bosniak area was of primarily strategic importance to Serbs. Without it, their new political entity, Republika Srpska had no territorial integrity. Therefore, they engaged in ethnic cleansing of Bosniaks from Bosniak ethnic territories in eastern Bosnia and Central Podrinje. In the bitter conflict for territory, Srebrenica remained isolated in the Serb-controlled territory. Their only link to the Bosnian controlled land was Zepa. The advancing Serb military cut off this link and reduced the Srebrenica enclave to 150 square kilometers. As residents of these outlying areas sought refuge in the Srebrenica town, its population swelled to 50,000-60,000. When Commander of the UN Protection Force (UNPROFOR), General Philippe Morillon of France visited Srebrenica in 1993, the town was overcrowded and under siege. There was no running water as the Serbs had destroyed the water supplies, proper electricity and scarcity in food, medicine and other essentials. He assured the panicked residents that they were now under the UN protection and would never be abandoned. The UN High Commissioner for Refugees (UNHCR) began to evacuate thousands of Bosniaks. The Bosnian Government however opposed the move. They pointed out, it would contribute to the ethnic cleansing. Even after Serbs warned via UNHCR that the town would be attacked in two days unless Bosniaks surrendered and agreed to be evacuated, Bosniaks refused. From 1992-1995 the besieged population was deliberately starved. The world attention was centered on the fight for Sarajevo and the peace process. Srebrenica, located in eastern Bosnia was far removed geographically from Sarajevo. Thus, its rapidly deteriorating plight rarely came to focus. Only Dutchbat--the fourth tier in the UNPROFOR command chain--was assigned responsibility for the Srebrenica Safe Area. While Dutchbat was dependent on UNPROFOR for crucial supplies as fuel, it was largely expected to obtain its supplies from the Netherlands. On April 16, 1993, the UN Security Council passed the resolution demanding that Srebrenica and its surrounding areas be considered a safe area and free from all hostile acts. On May 8, it was agreed to demilitarize Srebrenica. The Bosniak forces within the enclave were to handover their weapons, ammunition and mines to UNPROFOR. Serbs would then to withdraw their heavy weapons and units. This safe area agreement was violated by both parties. The Bosnian Government Forces used the safe area as a convenient base to launch counter offensives and UNPROFOR failed to prevent. The Serb Forces prevented Dutchbat personnel, equipment and ammunition from getting through to Srebrenica. UN headquarters issued specific instructions to UNPROFOR not to be zealous in searching for Bosniak weapons and that the Serbs must withdraw their heavy weapons before Bosniaks gave up their weapons. The Serbs did not withdrew their weapons. By early 1995, fewer supply convoys made it through to the enclave and even the UN forces started running dangerously low on the essentials. On July 06, Serb offensive began in earnest and UNPROFOR posts rapidly fell. The Dutch soldiers either retreated in to the enclave or surrendered. NATO bombers could not attack VRS artillery positions due to poor visibility. Then it was cancelled altogether when VRS threatened to kill Dutch and French military hostages and attack locations with 20,000-30,000 civilians took refuge. That evening, Dutchbat commander was captured on film, drinking a toast with General Mladic. In the following days and months to come, as Dutchbat failed to protect Srebrenica from capture, boys and men, mostly but not necessarily of fighting age, were systematically rounded and mowed down en masse. Girls as young as nine were gang raped and infants who cried had their throats slit. Though 25,000-30,000 women, children and elderly were forcibly transferred, it is charged that not all buses reached safety. It is baffling how Sri Lanka came out smelling of roses when Ban laments that the UN failed in Rwanda, Srebrenica and again in Sri Lanka. This government insists that the international community is good with Sri Lanka. However, Ban grouping Sri Lanka with these carnage indicates otherwise. Hence, it is imperative for the government to stop playing politics with national security and immediately rectify this misconception. After all, our war was not one without witnesses as India, America and other prominent diplomatic bodies played a significant role in bringing humanitarian aid to the civilians held hostage by the terrorists. Like this: Like Loading...Related"}, {"articleID": "2018010114_00770634_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"], "Steve George": ["Q16186681", "Q20487038", "Q7612640"]}, "date": "2018-01-01", "url": "http://www.wsmv.com/story/37169137/kim-jong-un-offers-rare-olive-branch-to-south-korea", "content": "<mark>Kim Jong Un</mark> offers rare olive branch to South Korea - WSMV News 4 <mark>Kim Jong Un</mark> offers rare olive branch to South Korea - WSMV News 4 Member Center: <mark>Kim Jong Un</mark> offers rare olive branch to South Korea Posted: lee.morehouse @ meredith.com By Alanne Orjoux and <mark>Steve George</mark>, CNN (CNN)--North Korean leader <mark>Kim Jong Un</mark> has held out a rare olive branch to the country's southern neighbor, offering talks over sending a delegation to the Winter Olympics in Pyeongchang next month. <mark>Kim</mark> struck an unusually conciliatory note in his annual New Year's Day address, declaring his wish \"for peaceful resolution with our southern border .\" He nevertheless couched the message in more familiar bellicose language, warning the United States that North Korea's nuclear ambitions were now complete and the launch button was \"always on the desk in my office .\" <mark>Kim</mark>'s comments on South Korea surprised analysts, who described them as the most significant part of his speech. Tensions with the South have been high as <mark>Kim</mark> has presided over a dramatic increase in the pace of North Korea's weapons program. In September, the regime carried out its sixth and most powerful nuclear test. Call for peace In his address, <mark>Kim</mark> called for peace on the Korean peninsula. \"North and South must work together to alleviate the tensions and work together as a people of the same heritage to find peace and stability,\" <mark>Kim</mark> said, according to a CNN translation of his speech. He added that North Korean representatives should start talks with their South Korean counterparts \"as soon as possible\" to discuss sending a delegation to the 2018 Winter Games. <mark>Kim</mark> went on to wish South Korea success in hosting the upcoming Olympics and said the event would be a \"good chance\" to show the greatness of the Korean people. But <mark>Kim</mark> ratcheted up his warnings to the US. \"The entire mainland of the US is within the range of our nuclear weapons and the nuclear button is always on the desk of my office. They should accurately be aware that this is not a threat but a reality,\" <mark>Kim</mark> said. \"No matter how much America wants to attack us with their military might and nuclear power, they know that now we possess such great nuclear power and therefore they will not dare,\" he continued, adding that his country's greatest achievement of 2017 was the \"historic accomplishment of completing our nuclear capabilities .\" Softened tone Euan Graham, director of the International Security Program at the Lowy Institute, told CNN the softened tone toward South Korea was a surprise. \"The olive branch of trying to reach out to the South, that's the most significant change, because up until now, they just haven't shown any interest in engaging with the South, or anyone else for that matter,\" he said. \"But an olive branch is always wrapped in some sort of belligerent coating in North Korea, it doesn't mean the end of the nuclear program...Even if they do reach out and send a delegation to the Pyeongchang Winter Olympics, it wouldn't surprise me at all if they accompanied that with a continuing testing program as the spring comes, be that a submarine launch or satellite launch .\" Tension has been rising between the United States and North Korea in recent months. Adm. Mike Mullen, a former chairman of the Joint Chiefs of Staff, said Sunday that the United States is \"closer to a nuclear war with North Korea\" than ever. In an interview on ABC's \"This Week,\" Mullen warned that President Donald Trump's provocative rhetoric aimed at <mark>Kim Jong Un</mark> likely indicates he would prefer to take a more aggressive approach to countering the rogue regime's rapidly evolving nuclear weapons program. Last week, the <mark>UN</mark> Security Council unanimously adopted new sanctions on North Korea in response to Pyongyang's November 29 ballistic missile test, seeking to further strangle its energy supplies and tighten restrictions on smuggling and the use of North Korean workers overseas. North Korea's state-run news agency KCNA released a report Saturday promising that the country would remain committed to its nuclear development in 2018. \"Do not expect any change in its policy,\" the report read. \"Its entity as an invincible power can neither be undermined nor be stamped out. The DPRK, as a responsible nuclear weapons state, will lead the trend of history to the only road of independence and justice, weathering all tempests on this planet,\" the report continued, referring to North Korea's official name, the Democratic People's Republic of Korea. Joint military exercises In early December, the US carried out another round of military exercises with South Korea, involving the largest concentration of fifth-generation F-22s and F-35s fighter jets ever assembled in South Korea. The war games included attacks against a mock North Korean missile launch site with mock North Korean radars. In his New Year's address, <mark>Kim</mark> again denounced the exercises. \"These military exercises that you have with our enemy the USA must be halted at this very moment, because this behavior only causes fire and destruction on this great country,\" the North Korean leader said, apparently addressing South Korea. Tong Zhao, a fellow at the Carnegie-Tsinghua Center in Beijing told CNN that <mark>Kim</mark> does \"not want to appear threatening and provocative .\" \"He wants to convince the international community that his nuclear weapons are purely for self-defense and wants to have a negotiated solution with the United States on the basis that he gets to keep its nuclear deterrent capability, Zhao said .\" After achieving a preliminary strategic deterrent capability, North Korea might want to deescalate tensions and see (s) the Winter Olympics as a golden opportunity. The games make it possible for Washington and Seoul to meet Pyongyang's demand for self-restraint--adjusting their military exercises--without losing face and appearing weak on Pyongyang. \"The-CNN-Wire ™ & © 2018 Cable News Network, Inc., a Time Warner Company. All rights reserved. Popular Stories Monday, January 1 2018 7:46 AM EST 2018-01-01 12:46:32 GMT Lebanon Knights Hookah Bar (WSMV) Around 1:40 a.m., metro police responded to multiple calls for a shooting at the Lebanon Knights Hookah Bar on Charlotte Pike in West Nashville. When officers arrived to the scene, guests were hiding in the back of the bar. Monday, January 1 2018 7:46 AM EST 2018-01-01 12:46:14 GMT The wreck happened at the intersection of Harding Place and Nolensville Pike. (WSMV) Metro police are investigating a possible hit-and-run crash that sent one man to the hospital. Monday, January 1 2018 6:52 AM EST 2018-01-01 11:52:50 GMT People started showing up at Bicentennial Mall at 4 p.m. on New Year's Eve. (WSMV) By the time the clock struck midnight, the temperature was only around 14 degrees, but the frigid cold did not put a freeze on the celebrations. Updated: Monday, January 1 2018 12:09 AM EST 2018-01-01 05:09:21 GMT According to authorities, the car was traveling northbound in a white Chevrolet Malibu around 6 a.m. when a passing car opened fire. Monday, January 1 2018 12:06 AM EST 2018-01-01 05:06:29 GMT (Source: Mt. Juliet Police Department) It started around 5 p.m. in the 1400 block of Westwood Boulevard. Sunday, December 31 2017 9:28 PM EST 2018-01-01 02:28:43 GMT The shooting happened at Falcon View Apartments on East Palestine Avenue in Madison. (WSMV) The shooting happened at Falcon View Apartments on East Palestine Avenue in Madison."}, {"articleID": "2012020702_00049463_W", "names": {"Peter Coleman": ["Q21931807", "Q30612273", "Q7173326"]}, "date": "2012-02-07", "url": "http://afl.com.au/tabid/208/default.aspx?newsid=128654", "content": "fremantle has received a vote of confidence from its co-major sponsor woodside energy, with the company renewing its partnership with the club for a further four years. woodside had one year to run on its current agreement but renewed its sponsorship until the end of 2016. fremantle chief executive steve rosich said the new deal was a positive endorsement of the club's direction and strategic plan. \"we have built a strong foundation in the first two years of our partnership, helping woodside meet brand, community and staff engagement objectives,\" rosich said. \"our new agreement will see woodside continue alongside programmed group as a co-major sponsor, as well as assuming the mantle as the club's inaugural indigenous program partner .\" as well as appearing on the club's home and away jumpers, woodside's partnership with fremantle extends to supporting the club's indigenous programs. the company has a strong focus on indigenous reconciliation, including support for the clontarf foundation, and chief executive <mark>peter coleman</mark> said those programs would continue in partnership with fremantle. \"we will be working closely with fremantle from this year to develop and implement the club's first reconciliation action plan,\" he said. afl membership afl membership brings you the total game afl community club website everything on coaching, playing, umpiring, volunteering and managing your club play like a pro find your local club and play like a pro in 2012"}, {"articleID": "2013060322_00031763_W", "names": {"Tom Russell": ["Q1345526", "Q20984552", "Q21461614", "Q27922619", "Q56696376"], "Dan Patrick": ["Q19517991", "Q5214174", "Q5214175"]}, "date": "2013-06-03", "url": "http://cbs19.tv/story/22485912/landowners-to-weigh-in-on-road-expansion-tuesday", "content": "meta itemprop = \"datePublished\" content = \"2013-06-03 13:00:24\" > Web Exclusive: Winemaker takes an all-green approach to his wines (CNN) - One obstacle to small businesses going green can be the expense of new energy-efficient equipment, a major investment especially in an economy that's still a little shaky. But when you make your One obstacle to small businesses going green can be the expense of new energy-efficient equipment, a major investment especially in an economy that's still a little shaky. But when you make your livelihood off of the land, you may feel more inclined to find natural ways to give something back. Now a Maryland winemaker is taking things full circle. meta itemprop = \"datePublished\" content = \"2013-05-31 14:04:50\" > Web Exclusive: Mom turns to craigslist to find kidney for daughter (CBS/KCBS) - A mom has taken to the internet to find the perfect match for her daughter. But it's not what you think. The family is using Craigslist in a desperate search for a life-saving kidney. It A mom has taken to the internet to find the perfect match for her daughter. But it's not what you think. The family is using Craigslist in a desperate search for a life-saving kidney. meta itemprop = \"datePublished\" content = \"2013-05-30 16:20:37\" > Web Exclusive: Stars lend voice to Moore Oklahoma victims (CNN/CBS) - Blake Shelton welcomed a packed crowd to the Chesapeake Energy Arena in Oklahoma City Wednesday night for Healing in the Heartland. \"I'm here with some of my closest friends from Oklahoma Blake Shelton and musicians from all genres were on hand to raise money for the Oklahoma communities impacted by this month's tornadoes and lift a few spirits. meta itemprop =\" datePublished \"content =\" 2013-05-29 14:17:10 \"> Web Exclusive: College now offering a legit beer education (CNN/KSWB) - College and beer go hand-in-hand for many students. Now two San Diego universities are offering courses in craft brewing. But, the programs are no joke. It may not look like a classroom, College and beer go hand-in-hand for many students. Now two San Diego universities are offering courses in craft brewing. But, the programs are no joke. meta itemprop =\" datePublished \"content =\" 2013-05-28 14:22:04 \"> Web Exclusive: General Electric getting into fracking business (CBS) - General Electric is betting billions on the fracking boom. Fracking uses a pressurized liquid to break through rock layers to force oil and gas out. G.E. hopes its investment in research will General Electric is betting billions on the fracking boom. Also in Consumer Corner, Netflix is hoping a new series will mean big business. meta itemprop =\" datePublished \"content =\" 2013-05-24 16:13:57 \"> Web Exclusive: New attraction opens at Sea World Orlando in time for summer (CNN/Central Florida News 13) - Antarctica: Empire of the Penguin is SeaWorld Orlando's newest attraction. The ride transports families into a rarely seen, icy world to explore a massive penguin colony Antarctica: Empire of the Penguin is SeaWorld Orlando's newest attraction. The ride transports families into a rarely seen, icy world to explore a massive penguin colony up close and personal. meta itemprop =\" datePublished \"content =\" 2013-05-27 13:37:08 \"> Web Exclusive: Jersey Shore making Memorial Day Weekend Comeback (CNN) - Nearly seven months after Hurricane Sandy damaged much of the Jersey Shore, the popular beach destination is again open for business. Memorial Day weekend is turning out to be a good dry run with Nearly seven months after Hurricane Sandy damaged much of the Jersey Shore, the popular beach destination is again open for business. Memorial Day weekend is turning out to be a good dry run with the summer vacation season still ahead. meta itemprop =\" datePublished \"content =\" 2013-05-23 15:23:02 \"> Web Exclusive: Cleveland who helped kidnapping victims getting burgers for life (CNN) - The man who helped rescue three kidnapped women in Ohio will enjoy free burgers for the rest of his life! More than a dozen restaurants in the Cleveland area have pledged to give Charles Ramsey The man who helped rescue three kidnapped women in Ohio will enjoy free burgers for the rest of his life! More than a dozen restaurants in the Cleveland area have pledged to give Charles Ramsey a free burger whenever he stops in. meta itemprop =\" datePublished \"content =\" 2013-05-22 13:40:44 \"> Web Exclusive: Girl's lemonade stand shutdown (WTHR/CNN) - When it warms up outside, it's not unusual to see children set up lemonade stands around town. But in Indianapolis, confusion over health permits shut down a little girl's lemonade stand. Thousands When it warms up outside, it's not unusual to see children set up lemonade stands around town. But in Indianapolis, confusion over health permits shut down a little girl's lemonade stand. meta itemprop =\" datePublished \"content =\" 2013-05-21 15:29:38 \"> Web Exclusive: People struggling to pay bills moving to suburbs (CBS/CNN) - If you're a gamer, today is a big day. Microsoft will unveil its next-generation XBOX console today. The big announcement takes place at its headquarters in Redmond, Washington. There's plenty SMITH COUNTY (TYLER MORNING TELEGRAPH) - It was a high traffic day when a line of cars passed <mark>Tom Russell</mark>'s home along Farm-to-Market Road 2493, also known as Old Jacksonville Highway, in Gresham 30 years ago. Now, it's the norm. <mark>Russell</mark>'s driveway is situated where FM 2493's last expansion to five lanes coming south out of Tyler diverges into the two-lane road it was for decades. The road is a traffic bottleneck. But, the Texas Department of Transportation is planning a project to expand the five-lanes (two lanes each for south - and northbound traffic and a continuous left-hand turn lane) 2.2 miles to Farm-to-Market Road 346 in Flint. The project is still at least five years from beginning, but TxDOT officials are beginning to survey potential routes, rights of way needs and plan to meet with landowners along the proposed expansion Tuesday. <mark>Russell</mark> said the expansion would be a welcome relief for drivers commuting to and from dozens of surrounding subdivisions .\" When I look out the window in the morning sometimes, it's bumper to bumper, \"he said .\" There are a lot of frustrated drivers who will be happy (when the expansion is complete). \"<mark>Russell</mark> said the expansion will help alleviate traffic congestion but also make the road safer. Turning into his driveway is a\" look in the rearview mirror to see what's coming \"adventure at times. The danger comes when drivers heading south jockey for position as five-lanes become two. Wrecks and fender benders are common, he said .\" There are people screeching tires all the time, \"<mark>Russell</mark> said .\" The road changes abruptly, and it's a squeeze play when cars can't get over. \"In 2005, when the previous expansion of FM 2493 occurred, from Texas Highway 57 to FM 2813, 12,910 vehicles traveled the section, according to TxDOT. By 2011, daily counts reached more than 19,000. The section set for expansion had 8,750 daily vehicles in 2005 and 11,100 by 2011. The area along FM 2493 is buzzing with signs of growth. TxDOT Project Director Dale Booth said the continuation of the expansion is a result of continued residential and commercial growth along FM2493. Expectations are for Toll 49 to fuel growth in the area, he said. The preliminary meeting Tuesday will allow landowners along the route to express opinions and concerns regarding the expansion project and the department's options. Booth said the three options focus on which way the road will be widened. The road can be widened from the middle of the road equally on each side, or it could be widened from the east or west edge of the existing roadway, he said. Construction will depend on how the three options affect landowners along the route and TxDOT's ability to negotiate rights of way acquisitions. Rights of way acquisitions are expected to begin in 2016, Booth said. The\" best estimate \"for construction to begin is 2018 and end in 2020. <mark>Tom</mark> Mullins, president of the Tyler Economic Development Council, said development north of the planned expansion is evidence of the potential growth along FM 2493. He said the road is beginning to mirror development along Broadway Avenue. Many drivers are now using FM 2493 to avoid traffic on Broadway Avenue, which in turn stimulates commercial growth .\" Commercial and retail growth follows traffic and rooftops, \"he said .\" There's certainly a lot of activity and investment along Old Jacksonville, and it's moving south. \"Christoph Stockhammer, owner of Four Way Cafe, sees the growth potential in Flint. He's noticed TxDOT crews placing flags along the side of the road. His restaurant sits on the southeastern corner of the FM 2493-FM 346 crossroads .\" The growth potential is huge, \"he said of the area .\" Bigger stores are moving this way. That's a sign. \"The Tuesday meeting with TxDOT officials will be held at St. Mary Magdalene Catholic Church, 18221 FM 2493 in Flint from 5 to 7 p.m. meta itemprop =\" datePublished \"content =\" 2013-06-03 13:15:05 \"> End of CSCOPE means hardship for some Texas schools by Morgan SmithAUSTIN (TEXAS TRIBUNE) - In late May, state Sen. <mark>Dan Patrick</mark>, the chairman of the Senate Education Committee, announced what he called the end of an era in Texas public schools. Beginning <mark>Dan Patrick</mark>, the chairman of the Senate Education Committee, announced what he called the end of an era in Texas public schools. meta itemprop =\" datePublished \"content =\" 2013-06-01 21:42:15 \"> In El Reno, a tornado\" looking at us dead in the eye' In El Reno, a tornado \"looking at us dead in the eye' El Reno, Oklahoma (CNN)--David Stottlemyre was inside an oil field repair shop in El Reno, Oklahoma, when he saw a tornado\" looking at us dead in the eye. \"The lifelong Oklahoman said he and two coworkers David Stottlemyre was inside an oil field repair shop in El Reno, Oklahoma, when he saw a tornado\" looking at us dead in the eye. \"The lifelong Oklahoman said he and two coworkers stayed inside as the building took a direct hit--the roof collapsed and the structure blew apart. Though the three survived unscathed,\" We're all pretty shook up, \"the oil field mechanic told CNN .\" Surreal--really no other way to explain it. \"LONGVIEW (KYTX) - Longview Police say a father was shot by his daughter yesterday in one of two shooting incidents they were investigating. Officer Kristi Bryan tells CBS 19 News the woman shot her father Longview Police say a father was shot by his daughter yesterday in one of two shooting incidents they were investigating. Officer Kristi Bryan tells CBS 19 News the woman shot her father Saturday afternoon. The man was taken to Good Shepherd Hospital with life threatening injuries. meta itemprop =\" datePublished \"content =\" 2013-06-03 14:57:51 \"> Landowners to weigh in on road expansion Tuesday SMITH COUNTY (TYLER MORNING TELEGRAPH) - It was a high traffic day when a line of cars passed <mark>Tom Russell</mark>'s home along Farm-to-Market Road 2493, also known as Old Jacksonville Highway, in Gresham 30 It was a high traffic day when a line of cars passed <mark>Tom Russell</mark>'s home along Farm-to-Market Road 2493, also known as Old Jacksonville Highway, in Gresham 30 years ago. Now, it's the norm. meta itemprop =\" datePublished \"content =\" 2013-06-03 14:15:53 \"> New retail project could bring in mix of new companies TYLER (TYLER MORNING TELEGRAPH) - Bob Garrett and his partners have been working for 14 years to bring a large-scale retail project to far South Broadway Avenue, and they could see their hard work pay CBS19, MYTX & KCEB 2211 ESE Loop 323 All content? Copyright 2004 - 2013, WorldNow and KYTX, Owned and Operated by London Broadcasting Company."}, {"articleID": "2014031503_00006830_W", "names": {"John Daly": ["Q203831", "Q25190176", "Q382487", "Q389438", "Q50557115", "Q6228468", "Q6228481"]}, "date": "2014-03-14", "url": "http://sports.yahoo.com/news/john-daly-shoots-12-way-90-183418203--spt.html", "content": "PALM HARBOR, Fla. (AP) - <mark>John Daly</mark> has gone 17 straight years on the PGA Tour with at least one round in the 80s. He didn't even manage that Friday in the Valspar Championship. He missed a 4-foot putt on the last hole at Innisbrook and shot a career-high 90. \"I didn't give up,\" <mark>Daly</mark> said. \"I tried .\" He used up 12 of those shots on the 16th hole - tied for his fourth-highest score on any one hole - but was more concerned with the putting yips. <mark>Daly</mark> said the yips began last Sunday in Puerto Rico and reached a low point at Innisbrook. He took 70 putts over two days, including a four-putt on the second hole of Friday's round. \"You're going to have big scores on holes. That's just the way golf is,\" <mark>Daly</mark> said. \"But when you've got the yips, that's no fun .\" For <mark>Daly</mark>, there was nothing fun about Friday, especially the 16th hole. He started with a tee shot into the water. He had about 270 yards to cover the lake after his penalty drop and failed twice. From there, he hit a smother-hook well to the left of the water, only to hit what he described as a shank with his 7-iron well right of the green. He took three chips to reach the green and one-putted for a 12. <mark>Daly</mark>'s highest score ever was an 18 on the sixth hole of the 1998 Bay Hill Invitational. This wasn't anything like that. For one thing, he hit only three balls in the water. \"I got two good drops and hit a heel-cut 3-wood into the water,\" he said. \"Then I shanked a 7-iron, chili-dipped a chip, it was buried, didn't get that out ....It was a good 12. I got up-and-down for 12 .\" It was the 16th time on the PGA Tour that <mark>Daly</mark> has made at least a 10 on a hole. Friday was the one-year anniversary of his most recent when he took a 10 on the third hole after twice hitting a tree while trying to get out of a forest. <mark>Daly</mark> said he needed to find help with the yips after what already has been a bad week. The 47-year-old with two majors said he was treated for plantar fasciitis in his left heel on Wednesday, and he was walking with a slight limp toward the parking lot. \"I'm falling apart,\" he said. The putting is what unnerved him. <mark>Daly</mark> had some of the softest hands in golf when he won the 1991 PGA Championship and the 1995 British Open at St. Andrews. But his putting stroke, even more than elbow surgery last year, has hurt him. His last good chance to win a tournament was the 2005 American Express Championship at Harding Park, where he three-putted from 15 feet in a playoff against Tiger Woods. \"It's my head, my hands, and I can't stop it,\" <mark>Daly</mark> said. \"On a short stroke, I get quick. On my normal, long stroke, I come up. Even my legs are moving. I should just go put myself in a straitjacket and try that. I've always been a quick putter, so I should never get the yips. But I got 'em. I got 'em bad. <mark>Daly</mark>, who has been playing on sponsor exemptions for the last eight years, was not sure where he would play next. He said he was supposed to play in Indonesia in a few weeks for the start of the OneAsia circuit, but the missing Malaysian Airlines flight shook him up .\" I was going to Indonesia, but since they can't find a 777, \"he said, shaking his head as his voice trailed off .\" I ain't about to fly on a plane right now. It's a sick feeling. I'd have to go right there. I canceled it. I said, \"No way I'm getting on a plane to fly overseas .' A 777? One of the nicest planes in existence?\" It's scary, \"he said .\" There are more important things in life than a round of golf. I'm scared to fly. Our world, it's scary what's going on. (Buildings) blowing up in New York. A guy running over people in Austin, Texas? What the hell is going on? It's frightening. \"In his eyes, a 90 didn't seem so bad. Sports & Recreation Golf <mark>John Daly</mark> PGA Tour"}, {"articleID": "2012122916_00030361_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2012-12-29", "url": "http://coventrytelegraph.net/news/national-news/2012/12/29/cameron-leads-tributes-to-rees-mogg-92746-32513817/", "content": "<mark>david cameron</mark> has paid tribute to \"fleet street legend\" lord rees-mogg, who has died after a short illness aged 84. as william rees-mogg, he was editor of the times from 1967 to 1981 and went on to become an influential columnist. his son, conservative mp jacob rees-mogg, said the peer had only discovered recently that he had inoperable oesophageal cancer. \"it has been a mercifully short illness. he died very peacefully and a member of his family was with him. he was very prepared for it,\" jacob rees-mogg told the times. lord rees-mogg was at the helm of the times during rupert murdoch's 1981 takeover. during his editorship, he was credited with making the reporting more investigative and the paper's opinions more challenging. after his tenure as editor, lord rees-mogg was a columnist whose opinions were highly influential in tory circles, particularly during the thatcher and major governments. he was also vice chairman of the bbc's board of governors (1981-86) and chairman of the arts council (1982-89). the prime minister led tributes. he said: \"william rees-mogg is rightly a fleet street legend - editing the times through a tumultuous period with flair and integrity. i always found him full of wisdom and good advice - particularly when i first became leader of the opposition .\" my thoughts are with his wife and five children at this sad time. \"bbc trust chairman lord patten said:\" william rees-mogg was a great journalist and editor, and a distinguished public servant, for example at the arts council and bbc. \"my family knew him as a kind and good man, generous, spirited, warm, witty, and the much-loved father of a close and talented family. everyone who knew him will miss him deeply .\" the coventry telegraph, the best source for coventry city fc news. your coventry telegraph, great local images, videos and your local stories."}, {"articleID": "2018032918_00024020_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-03-29", "url": "http://dailycaller.com/2018/03/29/trumps-wax-statue-yak-squirrel-hair/", "content": "Politics <mark>Trump</mark>'s Wax Statue Includes Bovine And Squirrel Hair Saagar Enjeti White House Correspondent 1:07 PM 03/29/2018 Pinterest Reddit LinkedIn WhatsApp Share TOP President <mark>Donald Trump</mark>'s wax statue at the popular Madame Tussauds wax museum includes a mix of human, yak and squirrel hair. Of interest: pic.twitter.com/RsoyRWX7Rp--Jacqueline Alemany (@ JaxAlemany) March 29, 2018 \"His hair is a mixture of human hair and yak hair,\" Tussaud hairstylist Kelly Cox told CNN in January 2017. \"We use yak hair with people with white hair because human hair is not readily available .\" Museum hair inserter Sophie Crudginton told the Dallas News in November 2016 that the yak hair was specifically from the belly of the bovine species, declaring \"it is 100 percent belly yak hair .\" Museum workers also told CNN that squirrel hair was used for the President's signature bushy eyebrows. The statue was recently put on full display after <mark>Trump</mark> canceled a visit to London and the museum decided to place it outside the U.S. Embassy. Madame Tussauds trolls <mark>Trump</mark> by moving his wax statue to London embassy after canceled visit https: //t.co/AQbP152Txu pic.twitter.com/5GRQhmV13E--The Hill (@ thehill) January 13, 2018 Follow Saagar Enjeti on Twitter Tags: <mark>Donald Trump</mark> Hide Comments Show comments"}, {"articleID": "2013042603_00057209_W", "names": {"Ron Edwards": ["Q15842986", "Q322538", "Q7363728", "Q7363729"], "Ron Rivera": ["Q1991889", "Q7364319"], "Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"], "Jordan Gross": ["Q55946456", "Q6276575"]}, "date": "2013-04-26", "url": "http://gastongazette.com/sports/nfl/panthers-bulk-up-with-first-round-pick-1.133048/", "content": "charlotte (ap) - the carolina panthers bulked up their defensive front by selecting utah's star lotulelei with the 14th overall pick in general manager dave gettleman's first nfl draft. it marks the first time the panthers have selected a defensive tackle in the first round since joining the league in 1995. defensive tackle was considered a position of need for the panthers, who released starter <mark>ron edwards</mark> in a salary cap move earlier this offseason. lotulelei, 6-foot-2 and 311 pounds, is expected to step in and start right away alongside veteran defensive tackle dwan edwards, who re-signed in the offseason. gettleman called lotulelei a three-down lineman. \"what star does is he impacts the game on every snap in terms of the run game and the pass game,\" gettleman said. \"he's not someone you are going to replace in your sub package defense .\" gettleman likes the idea that lotulelei can occupy two players at the point of attack, which he hopes will free up middle linebacker luke kuechly to make even more plays. kuechly, the 2012 ap defensive rookie of the year, led the nfl in tackles last season. \"it gives luke more protection, which makes our whole defense better,\" gettleman said. in his last two seasons at utah, lotulelei had 20 of his 86 tackles behind the line of scrimmage and posted 6.5 sacks. he also forced four tackles. \"we think he's going to be an impact player for us as far as our front is concerned,\" coach <mark>ron rivera</mark> said. \"he's a guy that will command the double teams and can split the double teams as well as hold them point, which will give our linebackers an opportunity to run .\" it will affect the way we play pass coverage when you've got two guys up front in he and dwan that will be able to push the pocket for us. \"the panthers finished 10th in the league on defense last season and 14th against the run. at the scouting combine in february a heart test revealed his left ventricle was pumping at only 44 percent efficiency, thus clouding his future in the nfl. but following a variety of tests, including those by a cardiologist specialist in utah, it was revealed that a virus was causing the abnormal heartbeat. medication cured the problem .\" he was thoroughly checked out, \"gettleman said .\" our doctors felt very comfortable that he's fine. he's been completely cleared. \"lotulelei said it was a scary situation at the time .\" it was definitely a big blow, \"the soft-spoken lotulelei said .\" but it ended up just being a virus i had from a cold. but everything has been cleared and i'm ready to go. i'm ready to get down there and get to work. \"a native of tonga, the 23-year-old lotulelei is already married and has two daughters. lotulelei hails from the same school as two current panthers stars - <mark>steve smith</mark> and <mark>jordan gross</mark>."}, {"articleID": "2011102201_00064695_W", "names": {"Stephen Harper": ["Q206", "Q7609425"], "John Baird": ["Q16154590", "Q19043052", "Q27831227", "Q365736", "Q43911239", "Q6220326", "Q6220331", "Q6220342"]}, "date": "2011-10-22", "url": "http://theglobeandmail.com/news/world/africa-mideast/canadas-middle-power-status-delivered-results-in-libya/article2210169/?utm_medium=Feeds%3A%20RSS%2FAtom&utm_source=Home&utm_content=2210169", "content": "prime minister <mark>stephen harper</mark> is given a technical briefing by general charles bouchard prior to delivering a speech at camp fortin on the trapani-birgi air force base in trapani, italy, on thursday, sept. 1, 2011. sean kilpatrick/the canadian press canada's middle-power status delivered results in libya ottawa - from saturday's globe and mail in their parliaments, european political leaders continued to voice support for the nato mission in libya last summer even as the rebellion bogged down and protests grew. but when it came time to assign planes to a strike, their militaries frequently would \"red card\" the sorties, which meant they were declaring that they were unable to contribute, according to a government official who spoke on condition of anonymity. the colonel's four-decade descent from revolutionary to crazed tyrant with a canadian general in charge, canada couldn't have red-carded missions even if it wanted to, which is why canadian cf-18 pilots often found themselves in the most dangerous skies. as nato announced on friday that its effort to support the rebellion in libya would end on oct. 31 - now that the rebels are in charge and col. moammar gadhafi is dead - the conservative government congratulated itself on a job well done. throughout the mission, canada was able to use its status as a middle power pulling its weight and punching above it to leverage influence within nato and among libyan rebel leaders. and prime minister <mark>stephen harper</mark> demonstrated his willingness to put military forces on the front line in support of collective action against governments that become a menace to their own people. the liberals called the idea responsibility to protect. the conservatives gave it teeth. the uprisings of the arab spring caught western leaders, including mr. <mark>harper</mark>, by surprise. but when people took to the streets of libya, he decided he had to act. the prime minister demanded to know what force canada could get into the region and how quickly. word came back from national defence that a frigate could be at sea in a matter of days. do it, he ordered. on march 2, more than two weeks before the united nations security council authorized a no-fly zone over libya, hmcs charlottetown left halifax for the mediterranean sea. but it was unclear what would happen, as great britain and france pushed nato to act and a reluctant united states, which was still extricating itself from iraq and mired in afghanistan, pushed back. \"[president barack] obama had been elected to end two wars, not to start a third one,\" a canadian official stated. the alliance gelled only when it became clear that col. gadhafi was determined to crush the rebellion and to wreak vengeance on civilians who supported it. but mr. obama made it clear that, after the initial sorties, the united states intended to lead from behind. the other nato nations would have to do the heavy lifting canada decided on a strong commitment. cf-18s at bagotville, que., were readied for deployment. on march 20, the opposition parties endorsed a three-month mission. on march 25, lieutenant-general charles bouchard of the canadian forces was chosen to command the operation. \"i'm sure that putting the cf-18s in there helped bouchard get it,\" said the government official, who spoke on condition of anonymity. another official said that a canadian commander was probably chosen to bypass french and british rivalries and to reassure the americans. not everyone in nato was on board all the time, as the rebellion appeared to bog down. spring dragged into summer. cities changed hands and changed back. people appeared to be on the regime's side one day, the rebels' side the next. \"europe wobbled. throughout the entire process, europe was touch and go,\" said one canadian official. the wobbling got worse as it became clear that a mission that had initially been intended to protect civilians had crept toward regime change. the canadians were fine with that. \"a few months into the mission, it was realized that something had to change,\" the official said. \"gadhafi was just entrenching himself .\" on june 14, canada recognized libya's rebel council as the legitimate voice of the country's people, even as the house of commons voted to extend the mission by another three months. in late june, foreign minister <mark>john baird</mark> flew to benghazi, offering canada's unqualified support to the national transition council. (in october, he would become the first foreign minister to visit the tripoli compound of the toppled dictator .) on sept. 26, the house once again approved the extension of the mission, this time over the opposition of the ndp. but by then, tripoli had fallen and col. gadhafi's end was in sight. canada was one of the first countries to re-open its embassy in tripoli. by the end of the campaign, canadian jets had flown 446 missions over iraq, 10 per cent of the nato total, and used up 14.5-million pounds of fuel. the conservative government and nato leaders believe they have drawn valuable lessons from libya. the first is that regimes change only when the people are willing to change them. by limiting its mandate to air strikes, a sea blockade, intelligence and selective use of special forces, the alliance helped make possible a revolution that the libyan people fought themselves. disclaimer? copyright 2011 the globe and mail inc. all rights reserved. m5v 2s9 phillip crawley, publisher"}, {"articleID": "2018100919_00432365_W", "names": {"John Campbell": ["Q1148728", "Q12885331", "Q12885333", "Q1383155", "Q1444898", "Q15861577", "Q16198535", "Q18685177", "Q18704951", "Q19596498", "Q22003550", "Q2277620", "Q258792", "Q29216", "Q30077568", "Q3181179", "Q4251090", "Q43911585", "Q478094", "Q51212260", "Q51542318", "Q52834952", "Q56254457", "Q56434401", "Q57945700", "Q6217589", "Q6219128", "Q6224971", "Q6224989", "Q6224992", "Q6224995", "Q6224999", "Q6225008", "Q6225027", "Q6232197", "Q6249971", "Q6253779", "Q6264129"]}, "date": "2018-10-09", "url": "https://www.bbc.co.uk/news/uk-northern-ireland-45804193", "content": "Brexit mitigation measures announced in Irish budget By <mark>John Campbell</mark> BBC News NI Economics & Business Editor 9 October 2018 These are external links and will open in a new window Close share panel Image caption Ireland's European affairs minister Helen McEntee said the budget was an important step in getting \"Brexit ready\" The Irish government has announced spending on a number of Brexit mitigation measures in its budget. It is setting up a € 300m Human Capital Fund to pay for the training and re-skilling of workers in sectors vulnerable to Brexit. There is also more than € 20m for the recruitment of customs and food safety inspectors as well as new IT systems. The government has emphasised these inspectors will be needed for sea ports rather than the land border. VAT increased European affairs minister Helen McEntee said the budget was an important step in \"getting Ireland Brexit ready\". \"We must do everything to minimise against the potential impacts while at the same time reinforcing the importance of our EU membership,\" she added. Media playback is unsupported on your device Media caption Brexit is \"challenge of our generation' Meanwhile, the Republic of Ireland's finance minister has increased the VAT rate for the hospitality sector from 9% to 13.5%. The special low rate of 9% was introduced in 2011 as a temporary measure to help the industry in the depths of a recession. Paschal Donohoe said that given Ireland's strong recovery it was now appropriate to increase the rate. Ireland's tourism sector has boomed in recent years with growth in visitor numbers of about 8% this year alone."}]