[{"date": "2015-02-20", "url": "http://www.insidefutbol.com/2015/02/20/its-been-made-into-a-drama-brendan-rodgers-on-mario-balotelli-penalty-controversy/190400/", "content": "Have another go! \"class =\" isBlank, isPassword \"/> Have another go!\" class = \"isBlank, isPassword\" /> Have another go! \"title =\" Login Email \"class =\" isBlank, isEmail \"/> Have another go!\" title = \"Login Email\" class = \"isBlank, isEmail, varifyEmail\" /> Have another go! \"title =\" Username \"class =\" isBlank, isLogin \"/> Penny Now Starting To Drop For Adryan - Leeds United Boss Neil Redfearn <mark>Phil Jones</mark> and Robin van Persie? Yes - Louis van Gaal Provides Injury Update Louis van Gaal: Changing My Formation Mid-Game Is Only Good Thing <mark>John Terry</mark> Is Getting Contract Extension - Chelsea Boss Jose Mourinho Manchester United Are Premier League's Form Team Insists Louis van Gaal Sam Allardyce: Mauricio Pochettino Has Rotated Spurs Team Expertly Liverpool manager <mark>Brendan Rodgers</mark> has attempted to play down the chatter around Mario Balotelli pushing past Jordan Henderson to take a penalty against Besiktas last night. But Balotelli made it clear that he wanted to take the penalty and the Italian took the ball, leaving Henderson and Daniel Sturridge looking displeased and annoyed at the striker overriding the pecking order established before the match. Balotelli scored and secured Liverpool a 1-0 win, leaving <mark>Rodgers</mark> playing down the incident and explaining he was only unhappy at seeing arguing over who would take the penalty .\" There's probably been a lot more of a drama made out of it than there was \"Just Enough - Liverpool Star <mark>Alberto Moreno</mark> Happy With Win Over Besiktas Mario Balotelli Never Looks Like Missing Penalties - Liverpool Legend Backs Striker Signing For Liverpool Has Affected Divock Origi - Lille Coach <mark>Rene Girard</mark> Sean Dyche: Liverpool and Real Sociedad Target Danny Ings Enjoying His Football I'm Clarifying We Won 1-0 - Stern Faced <mark>Brendan Rodgers</mark> Won't Answer On Mario Balotelli Penalty Furore\" We scored the penalty. It is very clear who our penalty takers are. \"With the players that were on the pitch last night, Jordan was our number one penalty taker .\" If Jordan, Mario and Steven [Gerrard] were on the pitch then we would have Steven and Mario as the two penalty takers. \"Jordan showed what a team player he was last night .\" It was maybe more the etiquette that we didn't like last night. \"With Gerrard set to miss Liverpool's clash against Southampton this weekend, all eyes will be on who is the side's penalty taker if the Reds are awarded a spot kick vs the Saints. Like betting on football? Check out our sister site", "articleID": "2015022014_00042596_W", "names": {"John Terry": ["Q20022506", "Q21463485", "Q381791", "Q83456"], "Phil Jones": ["Q14329218", "Q16730412", "Q18632136", "Q206641", "Q20709445", "Q57014836", "Q601435", "Q7182047", "Q7182049", "Q7182050"], "Rene Girard": ["Q129228", "Q2144754"]}}, {"date": "2015-02-20", "url": "http://www.bbc.co.uk/news/uk-wales-politics-31557630#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa", "content": "Media playback is unsupported on your device 20 February 2015 Last updated at 18:16 GMT An MP is supporting residents of a Powys town fighting to stop its only GP surgery from closing due to a cut in NHS funding. Doctors running the practice in Llanwrtyd Wells have written to Health Minister Mark Drakeford asking him to reconsider the scrapping of the Minimum Practice Income Guarantee (MPIG). They say 1,200 patients will have to travel 13 miles to their main surgery in Builth Wells from August. The Welsh government said there had to be \"new ways of meeting local needs\". <mark>Roger Williams</mark>, the Liberal Democrat MP for Brecon and Radnorshire, said it was difficult to find the money to keep rural GP practices open.", "articleID": "2015022018_00027982_W", "names": {"Roger Williams": ["Q21165828", "Q266434", "Q30106740", "Q4014560", "Q56187912", "Q716906", "Q7359122", "Q7359124", "Q7359125", "Q7359126"]}}, {"date": "2015-02-20", "url": "http://www.chicagotribune.com/entertainment/theater/chi-palace-theater-wisconsin-dells-2015-season-20150220-story.html?track=rss", "content": "The Palace Theater, the relatively new dinner theater in the Wisconsin Dells, announced its 2015 season on Thursday. \"Pinkalicious,\" the family musical by John Gregor based on the children's book by Victoria Kann, begins March 14 and continues through April 12. The show will then return in the summer, running June 13 through August 29. It's particularly suitable for young children. New dinner theater set to debut in the Dells As a serial theatrical and banquet entrepreneur of the old school, Anthony Tomaska has had his hits - such as the hugely profitable Chicago production of \"Tony n' Tina's Wedding,\" which ran for more than a decade at Piper's Alley. And he's had his misses - most notably, the...As a serial theatrical and banquet entrepreneur of the old school, Anthony Tomaska has had his hits - such as the hugely profitable Chicago production of \"Tony n' Tina's Wedding,\" which ran for more than a decade at Piper's Alley. And he's had his misses - most notably, the...(<mark>Chris Jones</mark>) \"The Little Mermaid\" (May 20 - Sept 6), the stage adaptation of the Disney film with songs by Alan Menken and Howard Ashman, plays in spring and summer. <mark>Eric Simonson</mark>'s Broadway play \"Lombardi\" (Sept. 25 - Nov. 1), a biography of the Green Bay Packers coach Vince Lombardi then runs through the fall. The first of two holiday offerings is <mark>David Bell</mark>'s \"A Christmas Carol: The Musical\" (Nov. 13 - Dec. 27). And filling the final days of 2015 is \"The Nutcracker,\" Marc Robin and Curt Dale Clark's theater adaptation of the Christmastime Tchaikovsky ballet.", "articleID": "2015022022_00024058_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"], "David Bell": ["Q1173497", "Q1173700", "Q15111593", "Q20810479", "Q21505911", "Q3017488", "Q421455", "Q5231276", "Q5231278", "Q5231280", "Q5231281", "Q5231282", "Q5231283", "Q5231286", "Q57560893"], "Eric Simonson": ["Q1351634", "Q5387515"]}}, {"date": "2015-02-20", "url": "http://www.comicbookmovie.com/fansites/JoshWildingNewsAndReviews/news/?a=115541", "content": "SPIDER-MAN: 31 Year Old Donald Glover Is Done Campaigning To Play 14 Year Old \"Miles Morales' Back in 2010, Donald Glover campaigned hard for the role of <mark>Peter Parker</mark> in Donald Glover has been a fan-favourite choice to play Spider-Man for years now, with even The Amazing Spider-Man star Andrew Garfield even backing him to one day take over the role. While there's every chance that Marvel Studios and Sony Pictures will turn to him to play <mark>Peter Parker</mark> in Captain America: Civil War and the 2017 reboot, a lot of fans are rooting for him to take on the role of Miles Morales (despite being years too old). He does voice the character on TV though. Yahoo! Movies caught up with the Community star, they asked him to weigh in on whether or not he's still interested in playing Spider-Man .\" Of course, I would always be honored to play Spider-Man, \"he said .\" But I just want the Spider-Man movie to be dope, that's all I want. \"As for his intentions to campaing for the role again, he added:\" I'm leaving it to them. Campaigning's part of life, but for me, I've got a lot of stuff that I'm really excited about, and dropping it all...of course it'd be an honor. But it's fine, if it comes, if not. \"What do you think of these comments? DISCLAIMER: This article was submitted by a volunteer contributor who has agreed to our Think this article is front page worthy? [frick] Miles Morales. Oh, wait. I take this [frick] back. damn, who would have thought that geeks could be such racist pieces of shit...I guess if you choose <mark>Marky Mark</mark> as your Avatar (a celebrity that was convicted f a hate crime), what else could we expect. SPIDER-MAN: 31 Year Old Donald Glover Is Done Campaigning To Play 14 Year Old\" Miles Morales' BATMAN v SUPERMAN: Just How Close To The Comics Is Jason Momoa's \"Aquaman' Look? SPOILER WARNING: Here's What\" Aquaman' Gets Up To In BATMAN v SUPERMAN Latest DAREDEVIL Image Reveals A Major Tie To AGENTS OF S.H.I.E.L.D.", "articleID": "2015022023_00049455_W", "names": {"Marky Mark": ["Q164119", "Q55753348"], "Peter Parker": ["Q19596717", "Q21165177", "Q51587673", "Q56513979", "Q7176298"]}}, {"date": "2015-02-21", "url": "http://talkingpointsmemo.com/news/mexican-man-rock-police-shooting", "content": "Sorry, this feature is only available to TPM Prime members In a hurry? Bookmarks allow you to save an article to read later at your convenience. There isn't a limit, either, so you can store your favorites, too. Sorry, this feature is only available to TPM Prime members Sign In Dont ever miss an article again. PASCO, Wash. (AP) - The rallying cry in Ferguson, Missouri, was \"Hands up, don't shoot!\" In New York, it was \"I can't breathe!\" In Pasco these days, the protest signs say things like \"It was just a rock!!!\" In a case with unmistakable echoes of Ferguson and New York, demonstrators have gathered every day during the past week in front of City Hall to demand answers in the deadly police shooting of Antonio Zambrano-Montes, a 35-year-old Mexican immigrant and former orchard worker who authorities say was throwing rocks at officers. The Feb. 10 killing - captured on cellphone video by an onlooker - was the fourth by law enforcement officers in Pasco in less than a year. It has sparked calls for a federal investigation and roiled this fast-growing agricultural city of 68,000, where more than half the residents are Hispanic but few are members of the police force or the power structure. Protesters and police officials alike say they want to avoid the violence and acrimony that happened in Ferguson last year when officers shot and killed an unarmed black 18-year-old. \"We will continue to be calm, until they give us a reason not to,\" said protester Hector Alamillo, 62, of Pasco. \"We are not a Ferguson. We will not burn things down .\" But Alamillo said Hispanics are \"very distrustful right now\" and are wondering why officers did not use non-lethal force to subdue Zambrano-Montes. In the cellphone video, Zambrano-Montes is seen running across a busy street, pursued by three officers. As he stops and turns around, gunshots ring out and he falls dead. While the shooting is under investigation by a regional task force - and being watched by the FBI - police have said that Zambrano-Montes had hit two officers with rocks and had refused to put down other stones. They also said a stun gun failed to subdue him. The case has cast a spotlight on the ethnic makeup of working-class Pasco, an apple -, grape - and potato-growing center about 220 miles from Seattle that has more than doubled in size since 2000. The city is more than 55 percent Hispanic; many members of the community flocked here from Mexico to work in the fields and at food-processing plants. Starting in the 1960s and '70s, many of those migrant workers settled down here. Pasco's modest downtown is now lined with Mexican restaurants, bakeries and clothing stores, and city business is conducted in English and Spanish. The police force of 71 uniformed officers has just 15 Hispanics, and only one person on the seven-member City Council is Hispanic. Once a hotbed of gang - and drug-related violence, the city has seen crime plummet in the past 20 years, in large part because the Hispanic community worked with police to drive out the bad guys, said police Capt. Ken Roske. But there are worries that future cooperation will be jeopardized if the investigation clears the officers. \"We are asking for more training for our officers,\" said protester Lorian Reavely, 39, of Pasco, who stood in front of a sign reading \"Stop Police Brutality. It was just a rock!!!\" Police said officers felt threatened by Zambrano-Montes. He had been arrested by Pasco police early last year for assault after throwing objects at officers and trying to grab an officer's pistol, court records show. Police have said Zambrano-Montes was not armed with either a gun or a knife. Whether he had a rock in his hand when he was shot is still under investigation, said Kennewick police Sgt. Ken Lattin, spokesman for the regional investigative unit. All three officers - two whites and one Hispanic - opened fire; the number of shots has not been disclosed. Zambrano-Montes had recently spent time in a homeless shelter after his home burned. But investigators have been unable to interview anyone who saw him in the two weeks leading up to his death, Lattin said. Officers want to know if he had mental problems. \"His actions were not normal,\" Lattin said at a news conference. \"None of you would stand out there at 10th and Lewis Street and throw rocks at cars. And when the police show up, throw rocks at them and then run .\" Investigators' findings will be turned over to prosecutors, who will decide whether to bring charges. The county coroner has also ordered a public inquest in hopes of calming \"some of the fears and outrage of the community .\" In a letter to Attorney General <mark>Eric Holder</mark>, Felix Vargas, chairman of Consejo Latino, a local Hispanic group, said the investigation by the regional unit will have \"no credibility whatsoever .\" He noted that the unit exonerated officers in three other recent fatal shootings in Pasco. \"The eyes of the world are on Pasco,\" Vargas said. \"We fully expect charges to be brought .\" Last month, a Pasco officer was cleared in the deadly shooting of a suspected car thief who pulled a pellet gun. In December, an investigation concluded that a sheriff's deputy was justified in killing an intoxicated man who fired more than 60 rounds at officers. In November, a prosecutor cleared two Pasco officers who shot and killed a knife-wielding man. Zambrano-Montes' widow and two daughters have filed a $25 million claim with the city in the first step toward a lawsuit. And a makeshift memorial to Zambrano-Montes has taken shape outside Vinny's Bakery, a Mexican business near the spot where he was gunned down. \"The gentleman was being disruptive, but he was not violent enough to warrant guns,\" said Ben Patrick, who said he witnessed the shooting. \"It was wrong .\" Sen. Rand Paul (R-KY) said on Friday \"it's a mistake\" to question whether President...Just a day after refusing to comment on whether President Obama loves America, Wisconsin...Fox Analyst: Giuliani's Obama Remark \"Invites All Kinds Of Racial Tension' Fox News analyst Juan Williams said on Friday that former New York City Mayor...A spokeswoman for former Florida Gov. Jeb Bush (R) sidestepped the dustup surrounding former...× Bookmarking is a TPM Prime feature Amanda Hale Director of Product & Creative Development", "articleID": "2015022117_00004330_W", "names": {"Eric Holder": ["Q312644", "Q3591180"]}}]