[{"articleID": "2018092517_00197983_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2018-09-25", "url": "https://forums.macrumors.com/threads/apples-bud-tribble-to-offer-support-for-comprehensive-federal-privacy-legislation-at-senate-hearing-on-wednesday.2142912/", "content": "Apple's Bud Tribble to Offer Support for \"Comprehensive Federal Privacy Legislation' at Senate Hearing on Wednesday #1 Apple is sending longtime employee and Vice President of Software Technology Bud Tribble to a Senate Commerce Committee hearing on Wednesday to offer support for federal privacy regulations, reports. According to Tribble's prepared statement obtained by Axios, he plans to\" convey Apple's support for comprehensive federal privacy legislation that reflects Apple's long-held view that privacy is a fundamental human right. \"Tribble will echo sentiments that Apple executives have shared time and time again, explaining Apple's belief that customers have a right to keep their personal information private, a stance that differs from companies like Facebook and Google. Back in June, Apple CEO <mark>Tim Cook</mark> said in an interview that privacy\" from an American point of view \"is one of the\" key civil liberties \"defining what it means to be American. <mark>Cook</mark> has also said multiple times that Apple's customers are not its product .\" We could make a ton of money if we monetized our customers, \"<mark>Cook</mark> said in March .\" If our customers were our product. We've elected not to do that. We're not going to traffic in your personal life. \"Tribble will be testifying before the US Senate Committee on Commerce, Science, and Transportation alongside representatives from other tech and media companies that include Amazon, Twitter, Google, AT & T, and Charter Communications. Ahead of the meeting, the National Telecommunications and Information Administration, part of the U.S. Department of Commerce, released a proposal for consumer data privacy protection and is seeking public comment. The NTIA is asking for feedback on certain desired outcomes for organizational practices: [*] Organizations should be transparent about how they collect, use, share, and store users' personal information. [*] Users should be able to exercise control over the personal information they provide to organizations. [*] The collection, use, storage and sharing of personal data should be reasonably minimized in a manner proportional to the scope of privacy risks. [*] Organizations should employ security safeguards to protect the data that they collect, store, use, or share. [*] Users should be able to reasonably access and correct personal data they have provided. [*] Organizations should take steps to manage the risk of disclosure or harmful uses of personal data. [*] Organizations should be accountable for the use of personal data that has been collected, maintained or used by its systems. These are the same kind of topics that will be explored during the privacy-focused Senate hearing, which is designed to\" examine the privacy policies of top technology and communication firms \"as well as review the\" current state of consumer data privacy. \"Note: Due to the political nature of the discussion regarding this topic, the discussion thread is located in our Politics, Religion, Social Issues forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts. Axios Quote\" We want your device to know everything about you; we don't feel that we should, \"he'll say .\" These concepts have guided our design process for years because privacy is a core value at Apple, not an obligation or an aftermarket add-on. \"Click to expand...Never heard of that guy before, on reading the title I thought - what's a Bud Triddle? #6 CarlJ said: ↑ This seems like an exceptionally good idea. The list of points seem quite reasonable, and hard to argue against it being a good idea. Not sure why this needs to be in PRSI. Someone will probably be along shortly to prove the need. Click to expand...Since it's about potential law it's definitely political simply by nature. Either way I suspect 99% of posters will support this idea as we all know what bunk it is to wreck encryption wholesale just because (once again) authorities want to throw around\" national security \"in order to do ridiculous things and give powerful tools to people who have proven they can't properly secure what they already have. #11 It is big for Apple to do this. One of their key competitive advantages is their stance on privacy and how that informs every aspect of what they do. It is better for the long-term survival of our union to have privacy listed as a fundamental human right, but in some ways it weakens their position in the market. If Google was held to the same standard as Apple when it comes to privacy, I'd be more inclined to use Google's software and services. Would I actually end up using them? Maybe not, but for me privacy and security are the #1 top concern, followed by design and use of use."}, {"articleID": "2018011912_00555180_W", "names": {"Elizabeth Cook": ["Q1331177", "Q5362618"]}, "date": "2018-01-19", "url": "http://www.thenorthernecho.co.uk/news/national/15867120.Barry_Bennell_abuse_complainant_says_ex_Crewe_manager_Dario_Gradi_arranged_sleepovers/", "content": "File photo dated 8/1/2018 of Court artist sketch by <mark>Elizabeth Cook</mark> of Barry Bennell appearing via videolink at Liverpool Crown Court where he is accused of 48 counts of child sexual abuse. An alleged victim of former football coach Barry Bennell stayed at his house after an arrangement made with ex-Crewe Alexandra manager Dario Gradi, a court has heard. Liverpool Crown Court was shown a video of a police interview with the complainant, who alleges he was raped by Bennell, 64, between 18 and 20 times at his home. He said he would stay at the coach's house with other boys while playing for Crewe's youth team. Loading article content Former Crewe Alexandra manager Dario Gradi Asked whose idea it was to stay there, he said: \"The football club .\" It would have been Dario Gradi, the manager. \"\"Dario was the manager and Barry was in charge of the youth .\" But alleged victim also said Gradi stopped him staying there after about 18 months, adding: \"I grew up thinking Dario saved me from Barry .\" He told police how Bennell had first tried to touch him while he was in a bunk bed but he told him to \"go away\". Former football coach Barry Bennell He said: \"Nothing happened then for a while and he started to kind of play mind games, saying I wouldn't be able to play for England .\" He wasn't playing me in the right position. I got dropped out of the football team. \"I think it was five or six weeks later, that was the first time it happened .\" He added: \"He had this power over you and he had this nasty streak .\" He could turn on you just like that. He would say \"I'll ruin your football career' .\" The complainant broke down in tears on occasions as he described being \"paralysed with fear\" while he was abused by Bennell. He said: \"You feel like you're paralysed. All I'm trying to think about is my football. I can't say anything because of my football .\" The complainant told police that the abuse--alleged to have taken place over an 18-month period--ended when Gradi stopped him staying at Bennell's home. He said: \"Dario Gradi stopped me staying with Bennell. I was not allowed to stop there any more .\" Asked what was the reason given, he replied: \"I have no idea. All I can remember is it just stopped .\" I grew up thinking Dario saved me from Barry. I never stayed there again. \""}, {"articleID": "2018032014_00233596_W", "names": {"Chris Mills": ["Q1626618", "Q17306289", "Q26922398", "Q5107467", "Q51624478"], "Alan Henderson": ["Q2324397", "Q4706852"], "Gary Payton": ["Q1494855", "Q309872"], "Michael Stewart": ["Q16107145", "Q2353002", "Q2552654", "Q444465", "Q56072954", "Q56192103", "Q6834627", "Q6834628", "Q6834633", "Q6836547"], "Ricky Davis": ["Q16185311", "Q554586"], "Mark Blount": ["Q301863", "Q6766764"], "Mike Miller": ["Q16185439", "Q16213405", "Q19667639", "Q2064643", "Q25190524", "Q380541", "Q6848025", "Q6848026", "Q6848027", "Q6848031"], "Jason Collins": ["Q2317740", "Q6161884"], "Kevin Love": ["Q297221", "Q6396801"]}, "date": "2018-03-20", "url": "http://basketball.wikia.com/wiki/Antoine_Walker?diff=59780&oldid=45209", "content": "Revision as of 16:35, March 27, 2014 (view source) Sixerman (wall | contribs) (The NBA was not founded in 1722) ← Older edit Latest revision as of 13:54, March 20, 2018 (view source) Jdh87 (wall | contribs) (4 intermediate revisions by one user not shown) Line 1: Line 1: − {| class = \"Infobox NBA Player\" cellpadding = 1 cellspacing = 1 align = right width = 290px style = \"font-family: Arial; padding: 4px; margin: 0 0 1em 1em; font-size: 11px; background-color: #F 8F8FF; border:1 px solid #C 0C0C0; clear: right;\" + {{Heading 2}} {{Pagename}} {{Pagename}} | - | - − {{Colspan center}} [[Image: Antoine Walker. jpg | center]] + {{Colspan center}} [[Image: Antoine Walker. jpg | 220px]] <br> Walker at the NBAPA All-Star Players Social in 2015 − | - − {{Blank team color}} No. 8 − | - − {{Colspan center}} [[Power Forward]] / [[Small Forward]] | - | - {{Blank team color}} Personal information {{Blank team color}} Personal information | - | - − {{Colspan left}} Date of birth + {{Colspan left}} Born − | {{Birth date and age | 1976 | 8 | 12}} + | {{Birth date and age | 1976 | 8 | 12}} <br> Chicago, Illnois − | - − {{Colspan left}} Place of birth − | Chicago, IL | - | - {{Colspan left}} Nationality {{Colspan left}} Nationality − | [[Image: U.S. Flag. png]] American + | American + | - + {{Blank team color}} Physical stats | - | - {{Colspan left}} Listed height {{Colspan left}} Listed height Line 19: Line 19: | - | - {{Blank team color}} Career information {{Blank team color}} Career information + | - + {{Row}} \"\"High school\" ' + | Mount Carmel <br> (Chicago Illinois) | - | - {{Colspan left}} College {{Colspan left}} College Line 24: Line 27: | - | - {{Colspan left}} [[NBA Draft]] {{Colspan left}} [[NBA Draft]] − | [[1996 NBA Draft | 1996]]; Round: 1 / Pick: 6th + | [[1996 NBA Draft | 1996]] / Round: 1 / Pick: 6th | - | - {{Colspan center}} Selected by the [[Boston Celtics]] {{Colspan center}} Selected by the [[Boston Celtics]] | - | - − {{Colspan left}} Pro career + {{Colspan left}} Playing career | 1996-2012 | 1996-2012 + | - + {{Row}} \"\"Position\" ' + | [[Power forward]] | - | - {{Blank team color}} Career history {{Blank team color}} Career history | - | - − {{Colspan left 2}} Idaho Stampede (2010-2012) <br> Guaynabo Mets (2010) <br> [[Memphis Grizzlies]] (2008) <br> [[Minnesota Timberwolves]] (2008) <br /> [[Miami Heat]] (2005-2007) <br /> [[Atlanta Hawks]] (2004-2005) <br /> [[Dallas Mavericks]] (2003-2004) <br /> [[Boston Celtics]] (1996-2003) + | 1996-2003 + | [[Boston Celtics]] + | - + | 2003-2004 + | [[Dallas Mavericks]] + | - + | 2004-2005 + | [[Atlanta Hawks]] + | - + | 2005-2007 + | [[Miami Heat]] + | - + | 2008 + | [[Minnesota Timberwolves]] + | - + | 2008 + | [[Memphis Grizzlies]] + | - + | 2010 + | Guaynabo Mets + | - + | 2010-2012 + | Idaho Stampede | - | - {{Blank team color}} Career highlights and awards {{Blank team color}} Career highlights and awards + | - + {{colspan left 2}} * NBA champion (2006) * NBA champion (2006) * 3 × NBA All-Star (1998, 2002, 2003) * 3 × NBA All-Star (1998, 2002, 2003) Line 47: Line 55: |} |} − \"\"Antoine Devon Walker\" ' is a retired American [[basketball]] player in the [[NBA]] at [[Power Forward]], who last played for the [[Idaho Stampede]] of the [[NBA D-League]]. Walker was selected 6th overall in the [[1996 NBA Draft]] by the [[Boston Celtics]] out of the University of Kentucky. + \"\"Antoine Devon Walker\" ' (born August 12, 1976) is an American former professional [[basketball]] player. He was drafted with the sixth overall pick in the [[1996 NBA Draft]] out of the [[Kentucky Wildcats | University of Kentucky]] and played in the NBA from 1996 to 2008. Walker played for the Celtics, Mavericks, Hawks, Heat, Timberwolves, the [[Baloncesto Superior Nacional | BSN's]] Mets and the [[NBA D-League]]'s Stampede before retiring from basketball in 2012. Walker, a three-time NBA All-Star, won an NCAA championship with Kentucky in 1996 and an NBA championship with the [[Miami Heat]] in 2006. + + = = Pre-NBA career = = + Walker attended [[Mount Carmel High School (Chicago) | Mount Carmel High School]], in Chicago, where he played with future [[National Football League | NFL]] [[quarterback]] [[Donovan McNabb]] and attained all-state status as a senior, earning a full scholarship to play for [[Rick Pitino]] at the [[University of Kentucky]]. He was a starting forward on the Wildcats' [[1996 NCAA Men's Division I Basketball Championship Game]] - winning team. As a freshman at Kentucky he was named [[Southeastern Conference | SEC]] Tournament [[MVP]]. In his sophomore year, Walker was named All-SEC First, All-SEC Tournament and to the All-NCAA Regional Teams. + + = = Professional career = = + + = = = Boston Celtics = = = + After Walker's sophomore season, he declared for the [[1996 NBA draft]] and was picked sixth overall by the [[Boston Celtics]]. In the 1996--1997 season, Walker made the All-Rookie First Team and led the team in scoring (17.5 ppg) and rebounding (9.0), as the team had its worst season in franchise history, 15--67. The following season, Pitino was reunited with Walker as the new coach of the Celtics, and he made the All-Star team as a reserve while averaging 22.4 ppg and 10.2 rpg. He also scored a career-high 49 points in a loss against the [[Washington Wizards]]. In the '98 draft, the Celtics had the 10th pick and chose swing man [[Paul Pierce]]. The next few years, Pierce and Walker were the 1--2 punch for the Celtics. In the 2001--2002 season, Walker had his best overall season by helping lead the Celtics to a 49--33 record and their first playoff berth in seven years. He was second on his team in scoring (22.0), first in rebounds (9), and first in assists, (5.0). Pierce and Walker took the team to the Eastern Conference finals, where they fell to the New Jersey Nets in six games. The next season, Walker made his third All-Star team. + + On February 20, 2002, former Kentucky teammate [[Tony Delk]] was traded to the Celtics, reuniting Walker with him. + + = = = Dallas Mavericks and Atlanta Hawks = = = + Nine and one-half days before the start of the [[2003--04 NBA season | 2003--04 season]], Walker was traded with Delk to the [[Dallas Mavericks]] for [[Raef LaFrentz]], [[<mark>Chris Mills</mark> (basketball) | <mark>Chris Mills</mark>]], and [[Jiří Welsch]]. Walker was used in a relatively limited capacity on his new team due to the number of high-caliber players populating the Mavericks' roster. Included on that team was [[Antawn Jamison]], newly acquired from the [[Golden State Warriors]]. On August 8, 2004 Walker and Delk were traded again, this time to the [[Atlanta Hawks]] for [[Jason Terry]], longtime Hawk [[<mark>Alan Henderson</mark>]] and a draft pick. + + = = = Return to Boston = = = + On February 24, 2005, Walker was traded back to the Celtics in a deal that sent [[<mark>Gary Payton</mark>]], [[Tom Gugliotta]], [[<mark>Michael Stewart</mark> (basketball) | <mark>Michael Stewart</mark>]], and a first-round draft pick to the Hawks <ref> [http: //sports.espn.go.com/nba/news/story? id=1998923 Walker returns to Celtics in shocker]. Updated February 25, 2005 </ ref> (<mark>Payton</mark> was released by the Hawks and re-signed with Boston for the remainder of the season). Walker started all 24 remaining games for the Celtics, averaging 16.3 points and 8.3 rebounds a game as the Celtics advanced to the playoffs before losing to the [[Indiana Pacers]] in a 7-game first round series. + + = = = Miami Heat = = = + [[File: Antoine Walker Miami Heat. jpg | thumbnail | right | Walker with the Heat]] + On August 2, 2005, Walker was involved in a five-team, 13-player deal (the largest trade in NBA history) that sent him from the Celtics to the [[Miami Heat]]. The Celtics received [[Curtis Borchardt]], [[Qyntel Woods]], and a handful of draft picks in Walker's stead. + + The Heat played Walker mostly off the bench, and he rotated between both forward positions. Though he struggled early to adjust to this role, by the end of the season he was a force for the Heat, finishing the season with averages of 12.2 points and 5.1 rebounds a game as the team's main scorer off the bench. Walker also led the team in overall 3-point shots made for the season, and increased his 3-point, free throw and overall shooting percentages. + + In the playoffs his production would increase, as he would be the third leading scorer for the team while making crucial three-point baskets and posting 20 points in four different playoff games including 23 against the [[New Jersey Nets]] in the closing game of the conference semifinals. Miami advanced to the NBA Finals and faced the [[Dallas Mavericks]], with Walker posting 13.8 points per game in the series as the Heat won the [[NBA championship]] in 6 games. In the title clinching sixth game in Dallas, Walker contributed 14 points and 11 rebounds. Walker's production dipped in the 2006--2007 season as he averaged 8.5 points a game and 4.3 rebounds. The Heat failed to repeat as champions following a first round loss to the [[Chicago Bulls]]. + + = = = Minnesota Timberwolves and Memphis Grizzlies = = = + On October 24, 2007, Walker was traded to the [[Minnesota Timberwolves]] along with [[Michael Doleac]], [[Wayne Simien]], a first-round draft pick and cash considerations in exchange for [[<mark>Ricky Davis</mark>]] and [[<mark>Mark Blount</mark>]]. <ref> [http: //sports.espn.go.com/espn/wire? section=nba & id=3077864 By trading two more veteran starters, Wolves grow even younger], October 24, 2007 </ ref> <ref name = tradestokes> Ira Winderman, [http: //www.sun-sentinel.com/sports/sfl-flspheat25nboct25,0,5407411.story Riley's trade stokes the Heat] {{webarchive | url = https: //web.archive.org/web/20071026033138/http: //www.sun-sentinel.com/sports/sfl-flspheat25nboct25% 2C0% 2C5407411.story | date = October 26, 2007}}, \"[[South Florida Sun-Sentinel]]\" </ ref> <ref> [http: //www.nba.com/timberwolves/news/wolves_nab_first_round_pick_and_three_players_from_heat.html Wolves Nab First-Round Pick and Three Players From Heat] </ ref> + + On June 27, 2008, Walker was dealt to the [[Memphis Grizzlies]] along with [[Marko Jarić]], [[Greg Buckner]], and the rights to [[O. J. Mayo]], for [[<mark>Mike Miller</mark> (basketball player) | <mark>Mike Miller</mark>]], [[Brian Cardinal]], [[<mark>Jason Collins</mark>]], and the rights to [[<mark>Kevin Love</mark> (basketball) | <mark>Kevin Love</mark>]]. <ref> [http: //www.startribune.com/sports/wolves/21828189.html? location_refer=Homepage: highlightModules:1 Wolves pick Mayo, swap him for <mark>Love</mark> in 8-player deal] </ ref> After appearing in just two preseason games and remaining inactive throughout the opening months of the regular season, <ref> http: //www.commercialappeal.com/news/2008/dec/15/grizzlies-to-give-walker-a-contract-buyout/ </ref> he was waived by the Grizzlies on December 19, 2008. + + In February 2010, he signed with the [[Mets de Guaynabo (basketball) | Guaynabo Mets]] along with former [[Chicago Bulls]] player [[Marcus Fizer]]. <ref> [http: //probasketballtalk.nbcsports.com/2010/02/antoine-walker-signs-in-puerto-rico.html Antoine Walker Signs In Puerto Rico] </ ref> Walker was released on April 1, 2010. <ref> [http: //thehoopsmarket.blogspot.com/2010/04/mets-de-guaynabo-release-antoine-walker.html Mets de Guaynabo release Antoine Walker] </ ref> + + On May 6, 2010, ESPN reported that Walker was trying to return to the NBA. <ref> http: //sports.espn.go.com/nba/news/story? id=5167188 </ref> On December 7, 2010, Walker was acquired by [[Idaho Stampede]] of the [[NBA Development League]]. It was reported in April 2012 that Walker had announced his retirement after two years with the Stampede. <ref> [https: //archive.is/20120723080727/http: //www.cnnsi.com/2012/basketball/nba/04/09/antoine.walker.ap/index.html? sct=hp_t2_a12 & eref=sihp] </ref> + + = = Personal life = = + [[File:20140614 Antoine Walker at the Nike Chi-League (1). JPG | thumbnail | right | Walker coaching in the Nike summer basketball Chi-League in 2014]] + Walker was previously engaged to reality star [[Evelyn Lozada]] of [[Basketball Wives]]. + = = = Legal troubles = = = + On January 5, 2009, Walker was arrested for [[driving under the influence]] in [[Miami Beach, Florida]]. <ref> http: //www.tmz.com/2009/01/05/antoine-walker-busted-for-dui/ #.T3OOZ9lWEpM </ref> <ref> {{cite web | url = http: //www.aolnews.com/2009/01/05/antoine-walker-arrested-for-drunk-driving/ | title = Archived copy | accessdate = 2012-03-28 | deadurl = yes | archiveurl = https: //web.archive.org/web/20131105200437/http: //www.aolnews.com/2009/01/05/antoine-walker-arrested-for-drunk-driving/ | archivedate = 2013-11-05 | df =}} </ ref> + + On July 15, 2009, Walker was charged with three felony counts of writing bad checks related to gambling debts he had incurred at three Las Vegas casinos. <ref name = gamblingdebts> [http: //www.boston.com/sports/basketball/celtics/articles/2009/07/15/gambling_woes_for_walker Gambling woes for Walker] </ ref> Walker was arrested on July 15 at [[Harrah's Casino]] in [[South Lake Tahoe]], [[Nevada]]. The charges stemmed from over $800,000 in gambling debts. Walker was in South Lake Tahoe to play in the [[American Century Celebrity Golf Classic]] the following day. <ref> {{cite web | url = http: //sports.espn.go.com/nba/news/story? id=4336288 | title = Walker Arrested at Lake Tahoe Cabaret | publisher = ESPN.com | accessdate = 2009-09-19}} </ ref> + + On June 30, 2010, Walker entered a plea of not guilty on felony bad check charges stemming from his failure to pay $770,000 in gambling losses to Caesars Palace and two other casinos in Las Vegas, according to the \"Las Vegas Review Journal\". <ref> http: //www.lvrj.com/news/walker-pleads-not-guilty-to-charges-tied-to-gambling-debts-97516504.html </ref> A year later, he pleaded guilty to one felony count of passing a bad check. Under the plea agreement, he did not face a prison term, and was put on probation and worked towards repaying the debt. <ref> {{cite web | last = Shine | first = Conor | title = NBA's Antoine Walker pleads guilty to felony check charges | url = http: //www.lasvegassun.com/news/2011/jun/28/antoine-walker-pleads-guilty-felony-check-charges/ | work = Las Vegas Sun | accessdate = June 29, 2011 | date = June 28, 2011}} </ ref> + + = = = Robberies = = = + In July 2000, Walker and former University of Kentucky teammate [[Nazr Mohammed]] were robbed outside a [[South Side, Chicago | South Side]] Chicago restaurant. <ref name = robbery> [http: //sports.espn.go.com/nba/news/story? id=2931152 Heat forward Walker robbed at home in Chicago] </ ref> On July 9, 2007, Walker and another individual were robbed at gunpoint by two offenders in his own house. The assailants made off with close to $200,000 worth of merchandise, including Walker's [[Mercedes-Benz | Mercedes]]. His car was later recovered having been stripped of its expensive aftermarket wheels and stereo system. Four men were charged in this robbery and two of them were also linked to the similar robbery of fellow NBA player, [[Eddy Curry]]. <ref name = robbery2> [http: //sports.espn.go.com/nba/news/story? id=4143282 & campaign=rss & source=NBAHeadlines \"Man who robbed Walker gets 21 years\" ], ESPN.com. May 5, 2009. </ ref> + + = = = Bankruptcy = = = + On May 18, 2010, Walker filed for Chapter 7 bankruptcy protection in the Southern District of Florida (Miami) as case number 10-23558 with total assets of $4.3 million and debts of $12.7 million. The filing listed four pieces of real estate including a $2.3 million Miami home that was underwater with a mortgage of $3.6 million, and three other properties in Chicago, one listed for $1.4 million. [[Nazr Mohammed]] paid half the fee of Walker's bankruptcy attorney. Walker's championship ring had to be sold off. In August 2013, Walker announced that he was debt-free. <ref> [http: //www.sportsworldnews.com/articles/4451/20130817/antoine-walker-bankrupt-update-debt-free-former-nba-star-opens.htm Antoine Walker Bankrupt Update: Debt-Free? Former NBA Star Opens Up About Financial Crisis, Says He's Ready To Move On] </ ref> Between 1996 and 2009, Walker earned more than $108 million from NBA salaries. <ref> {{cite web | title = Antoine Walker page at basketball-reference. com | url = https: //www.basketball-reference.com/players/w/walkean02.html | publisher = basketball-reference. com}} </ ref> + + = = = Broadcasting career = = = + Walker is now a basketball analyst on [[120 Sports]]. <ref> http: //www.120sports.com/video </ref> Walker was also hired by [[SEC Network]] as a basketball analyst. + + = = NBA career statistics = = + + {{NBA player statistics legend}} + {| class = \"wikitable\" + | - + | style = \"background: #afe 6ba; width:3 em;\" | † + | Denotes seasons in which Walker won an [[List of NBA champions | NBA championship]] + |} + + = = = Regular season = = = + + {{NBA player statistics start}} + | - + | align = \"left\" | [[1996--97 NBA season | 1996--97]] + | align = \"left\" | [[1996-97 Boston Celtics season | Boston]] + | \"' 82\" ' | | 68 | | 36.2 | | .425 | | .327 | | .631 | | 9.0 | | 3.2 | | 1.3 | | .6 | | 17.5 + | - + | align = \"left\" | [[1997--98 NBA season | 1997--98]] + | align = \"left\" | [[1997-98 Boston Celtics season | Boston]] + | \"' 82\" ' | | \"' 82\" ' | | 39.9 | | .423 | | .312 | | .645 | | \"' 10.2\" ' | | 3.3 | | \"' 1.7\" ' | | .7 | | 22.4 + | - + | align = \"left\" | [[1998--99 NBA season | 1998--99]] + | align = \"left\" | [[1998-99 Boston Celtics season | Boston]] + | 42 | | 41 | | 36.9 | | .412 | | \"' .369\" ' | | .559 | | 8.5 | | 3.1 | | 1.5 | | .7 | | 18.7 + | - + | align = \"left\" | [[1999--2000 NBA season | 1999--00]] + | align = \"left\" | [[1999-2000 Boston Celtics season | Boston]] + | \"' 82\" ' | | \"' 82\" ' | | 36.6 | | .430 | | .256 | | .699 | | 8.0 | | 3.7 | | 1.4 | | .4 | | 20.5 + | - + | align = \"left\" | [[2000--01 NBA season | 2000--01]] + | align = \"left\" | [[2000-01 Boston Celtics season | Boston]] + | 81 | | 81 | | 41.9 | | .413 | | .367 | | .716 | | 8.9 | | \"' 5.5\" ' | | \"' 1.7\" ' | | .6 | | \"' 23.4\" ' + | - + | align = \"left\" | [[2001--02 NBA season | 2001--02]] + | align = \"left\" | [[2001-02 Boston Celtics season | Boston]] + | 81 | | 81 | | \"' 42.0\" ' | | .394 | | .344 | | \"' .741\" ' | | 8.8 | | 5.0 | | 1.5 | | .5 | | 22.1 + | - + | align = \"left\" | [[2002--03 NBA season | 2002--03]] + | align = \"left\" | [[2002-03 Boston Celtics season | Boston]] + | 78 | | 78 | | 41.5 | | .388 | | .323 | | .615 | | 7.2 | | 4.8 | | 1.5 | | .4 | | 20.1 + | - + | align = \"left\" | [[2003--04 NBA season | 2003--04]] + | align = \"left\" | [[2003-04 Dallas Mavericks season | Dallas]] + | \"' 82\" ' | | \"' 82\" ' | | 34.6 | | .428 | | .269 | | .554 | | 8.3 | | 4.5 | | .8 | | .8 | | 14.0 + | - + | align = \"left\" | [[2004--05 NBA season | 2004--05]] + | align = \"left\" | [[2004-05 Atlanta Hawks season | Atlanta]] + | 53 | | 53 | | 40.2 | | .415 | | .317 | | .534 | | 9.4 | | 3.7 | | 1.2 | | .6 | | 20.4 + | - + | align = \"left\" | [[2004--05 NBA season | 2004--05]] + | align = \"left\" | [[2004-05 Boston Celtics season | Boston]] + | 24 | | 24 | | 34.5 | | \"' .442\" ' | | .342 | | .557 | | 8.3 | | 3.0 | | 1.0 | | \"' 1.1\" ' | | 16.3 + | - + | style = \"text-align: left; background: #afe 6ba;\" | [[2005--06 NBA season | 2005--06]] † + | align = \"left\" | [[2005-06 Miami Heat season | Miami]] + | \"' 82\" ' | | 19 | | 26.8 | | .435 | | .358 | | .628 | | 5.1 | | 2.0 | | .6 | | .4 | | 12.2 + | - + | align = \"left\" | [[2006--07 NBA season | 2006--07]] + | align = \"left\" | [[2006-07 Miami Heat season | Miami]] + | 78 | | 15 | | 23.3 | | .397 | | .275 | | .438 | | 4.3 | | 1.7 | | .6 | | .2 | | 8.5 + | - + | align = \"left\" | [[2007--08 NBA season | 2007--08]] + | align = \"left\" | [[2007-08 Minnesota Timberwolves season | Minnesota]] + | 46 | | 1 | | 19.4 | | .363 | | .324 | | .530 | | 3.7 | | 1.0 | | .7 | | .2 | | 8.0 + | - class = \"sortbottom\" + | style = \"text-align: center;\" colspan = \"2\" | Career + | 893 | | 707 | | 35.3 | | .414 | | .325 | | .633 | | 7.7 | | 3.5 | | 1.2 | | .5 | | 17.5 + | - class = \"sortbottom\" + | style = \"text-align: center;\" colspan = \"2\" | All-Star + | 3 | | 1 | | 13.3 | | .350 | | .300 | | .500 | | 2.0 | | 1.3 | | .7 | | .0 | | 6.0 + {{s-end}} + + = = = Playoffs = = = + + {{NBA player statistics start}} + | - + | align = \"left\" | [[2002 NBA Playoffs | 2002]] + | align = \"left\" | [[2001-02 Boston Celtics season | Boston]] + | 16 | | 16 | | 43.9 | | .411 | | .385 | | .781 | | 8.6 | | 3.3 | | 1.5 | | .4 | | \"' 22.1\" ' + | - + | align = \"left\" | [[2003 NBA Playoffs | 2003]] + | align = \"left\" | [[2002-03 Boston Celtics season | Boston]] + | 10 | | 10 | | \"' 44.0\" ' | | \"' .415\" ' | | .356 | | .500 | | 8.7 | | \"' 4.3\" ' | | \"' 1.7\" ' | | .4 | | 17.3 + | - + | align = \"left\" | [[2004 NBA Playoffs | 2004]] + | align = \"left\" | [[2003-04 Dallas Mavericks season | Dallas]] + | 5 | | 5 | | 28.0 | | .361 | | .100 | | .571 | | \"' 10.0\" ' | | 2.4 | | 1.2 | | .6 | | 9.8 + | - + | align = \"left\" | [[2005 NBA Playoffs | 2005]] + | align = \"left\" | [[2004-05 Boston Celtics season | Boston]] + | 6 | | 6 | | 37.3 | | .413 | | .368 | | .636 | | 7.3 | | 2.3 | | 1.2 | | \"' 1.0\" ' | | 16.7 + | - + | style = \"text-align: left; background: #afe 6ba;\" | [[2006 NBA Playoffs | 2006]] † + | align = \"left\" | [[2005-06 Miami Heat season | Miami]] + | \"' 23\" ' | | \"' 23\" ' | | 37.5 | | .403 | | .324 | | .574 | | 5.6 | | 2.4 | | 1.0 | | .3 | | 13.3 + | - + | align = \"left\" | [[2007 NBA Playoffs | 2007]] + | align = \"left\" | [[2006-07 Miami Heat season | Miami]] + | 4 | | 0 | | 23.0 | | .405 | | \"' .500\" ' | | \"' .818\" ' | | 2.3 | | 1.5 | | .5 | | .3 | | 11.8 + | - class = \"sortbottom\" + | style = \"text-align: center;\" colspan = \"2\" | Career + | 64 | | 60 | | 38.5 | | .406 | | .352 | | .663 | | 7.1 | | 2.9 | | 1.2 | | .4 | | 16.1 + {{s-end}} + + = = See also = = + * [[List of National Basketball Association career 3-point scoring leaders]] + * [[List of National Basketball Association career turnovers leaders]] + + = = Notes = = + {{reflist | 30em}} − = = Gallery = = + = = External links = = − <gallery> + * {{basketballstats | nba = Antoine_Walker}} − AntoineWalker. jpg + * [https: //www. basketball-reference. com/players/w / walkean02. html Walker's Career Stats] − </ gallery> + * [https: / / web.archive.org/web/20100617211509/http: //bankruptcy4austin.com/2010/05/29/attorney/lawyer/antoine-walker-files-for-bankruptcy-view-the-documents-here/ Antoine Walker Bankruptcy Documents] {{DEFAULTSORT: Walker, Antoine}} {{DEFAULTSORT: Walker, Antoine}} Latest revision as of 13:54, March 20, 2018 Antoine Walker Walker at the NBAPA All-Star Players Social in 2015 Personal information Born August 12, 1976 (1976-08-12) (age 41) Chicago, Illnois Nationality American Physical stats Listed height 6 ft 9 (2.06 m) Listed weight 265 lbs (120 kg) Career information High school Mount Carmel (Chicago Illinois) College Kentucky (1994-1996) NBA Draft 1996 / Round: 1 / Pick: 6th Selected by the Boston Celtics Playing career 1996-2012 Position Power forward Career history 1996-2003 Boston Celtics 2003-2004 Dallas Mavericks 2004-2005 Atlanta Hawks 2005-2007 Miami Heat 2008 Minnesota Timberwolves 2008 Memphis Grizzlies 2010 Guaynabo Mets 2010-2012 Idaho Stampede Career highlights and awards NBA champion (2006) 3 × NBA All-Star (1998, 2002, 2003) NBA Three-Point Field Goals leader (2001) NBA All-Rookie Team (1997) NCAA champion (1996) Antoine Walker at NBA.com Antoine Devon Walker (born August 12, 1976) is an American former professional basketball player. He was drafted with the sixth overall pick in the 1996 NBA Draft out of the University of Kentucky and played in the NBA from 1996 to 2008. Walker played for the Celtics, Mavericks, Hawks, Heat, Timberwolves, the BSN's Mets and the NBA D-League's Stampede before retiring from basketball in 2012. Walker, a three-time NBA All-Star, won an NCAA championship with Kentucky in 1996 and an NBA championship with the Miami Heat in 2006. Contents [show] Pre-NBA career Edit Walker attended Mount Carmel High School, in Chicago, where he played with future NFL quarterback Donovan McNabb and attained all-state status as a senior, earning a full scholarship to play for Rick Pitino at the University of Kentucky. He was a starting forward on the Wildcats' 1996 NCAA Men's Division I Basketball Championship Game - winning team. As a freshman at Kentucky he was named SEC Tournament MVP. In his sophomore year, Walker was named All-SEC First, All-SEC Tournament and to the All-NCAA Regional Teams. Professional career Edit Boston Celtics Edit After Walker's sophomore season, he declared for the 1996 NBA draft and was picked sixth overall by the Boston Celtics. In the 1996--1997 season, Walker made the All-Rookie First Team and led the team in scoring (17.5 ppg) and rebounding (9.0), as the team had its worst season in franchise history, 15--67. The following season, Pitino was reunited with Walker as the new coach of the Celtics, and he made the All-Star team as a reserve while averaging 22.4 ppg and 10.2 rpg. He also scored a career-high 49 points in a loss against the Washington Wizards. In the '98 draft, the Celtics had the 10th pick and chose swing man Paul Pierce. The next few years, Pierce and Walker were the 1--2 punch for the Celtics. In the 2001--2002 season, Walker had his best overall season by helping lead the Celtics to a 49--33 record and their first playoff berth in seven years. He was second on his team in scoring (22.0), first in rebounds (9), and first in assists, (5.0). Pierce and Walker took the team to the Eastern Conference finals, where they fell to the New Jersey Nets in six games. The next season, Walker made his third All-Star team. On February 20, 2002, former Kentucky teammate Tony Delk was traded to the Celtics, reuniting Walker with him. Dallas Mavericks and Atlanta Hawks Edit Nine and one-half days before the start of the 2003--04 season, Walker was traded with Delk to the Dallas Mavericks for Raef LaFrentz, <mark>Chris Mills</mark>, and Jiří Welsch. Walker was used in a relatively limited capacity on his new team due to the number of high-caliber players populating the Mavericks' roster. Included on that team was Antawn Jamison, newly acquired from the Golden State Warriors. On August 8, 2004 Walker and Delk were traded again, this time to the Atlanta Hawks for Jason Terry, longtime Hawk <mark>Alan Henderson</mark> and a draft pick. Return to Boston Edit On February 24, 2005, Walker was traded back to the Celtics in a deal that sent <mark>Gary Payton</mark>, Tom Gugliotta, <mark>Michael Stewart</mark>, and a first-round draft pick to the Hawks [1] (<mark>Payton</mark> was released by the Hawks and re-signed with Boston for the remainder of the season). Walker started all 24 remaining games for the Celtics, averaging 16.3 points and 8.3 rebounds a game as the Celtics advanced to the playoffs before losing to the Indiana Pacers in a 7-game first round series. Miami Heat Edit File: Antoine Walker Miami Heat. jpg On August 2, 2005, Walker was involved in a five-team, 13-player deal (the largest trade in NBA history) that sent him from the Celtics to the Miami Heat. The Celtics received Curtis Borchardt, Qyntel Woods, and a handful of draft picks in Walker's stead. The Heat played Walker mostly off the bench, and he rotated between both forward positions. Though he struggled early to adjust to this role, by the end of the season he was a force for the Heat, finishing the season with averages of 12.2 points and 5.1 rebounds a game as the team's main scorer off the bench. Walker also led the team in overall 3-point shots made for the season, and increased his 3-point, free throw and overall shooting percentages. In the playoffs his production would increase, as he would be the third leading scorer for the team while making crucial three-point baskets and posting 20 points in four different playoff games including 23 against the New Jersey Nets in the closing game of the conference semifinals. Miami advanced to the NBA Finals and faced the Dallas Mavericks, with Walker posting 13.8 points per game in the series as the Heat won the NBA championship in 6 games. In the title clinching sixth game in Dallas, Walker contributed 14 points and 11 rebounds. Walker's production dipped in the 2006--2007 season as he averaged 8.5 points a game and 4.3 rebounds. The Heat failed to repeat as champions following a first round loss to the Chicago Bulls. Minnesota Timberwolves and Memphis Grizzlies Edit On October 24, 2007, Walker was traded to the Minnesota Timberwolves along with Michael Doleac, Wayne Simien, a first-round draft pick and cash considerations in exchange for <mark>Ricky Davis</mark> and <mark>Mark Blount</mark>. [2] [3] [4] On June 27, 2008, Walker was dealt to the Memphis Grizzlies along with Marko Jarić, Greg Buckner, and the rights to O. J. Mayo, for <mark>Mike Miller</mark>, Brian Cardinal, <mark>Jason Collins</mark>, and the rights to <mark>Kevin Love</mark>. [5] After appearing in just two preseason games and remaining inactive throughout the opening months of the regular season, [6] he was waived by the Grizzlies on December 19, 2008. In February 2010, he signed with the Guaynabo Mets along with former Chicago Bulls player Marcus Fizer. [7] Walker was released on April 1, 2010. [8] On May 6, 2010, ESPN reported that Walker was trying to return to the NBA. [9] On December 7, 2010, Walker was acquired by Idaho Stampede of the NBA Development League. It was reported in April 2012 that Walker had announced his retirement after two years with the Stampede. [10] Personal life Edit File:20140614 Antoine Walker at the Nike Chi-League (1). JPG Walker was previously engaged to reality star Evelyn Lozada of Basketball Wives. Legal troubles Edit On January 5, 2009, Walker was arrested for driving under the influence in Miami Beach, Florida. [11] [12] On July 15, 2009, Walker was charged with three felony counts of writing bad checks related to gambling debts he had incurred at three Las Vegas casinos. [13] Walker was arrested on July 15 at Harrah's Casino in South Lake Tahoe, Nevada. The charges stemmed from over $800,000 in gambling debts. Walker was in South Lake Tahoe to play in the American Century Celebrity Golf Classic the following day. [14] On June 30, 2010, Walker entered a plea of not guilty on felony bad check charges stemming from his failure to pay $770,000 in gambling losses to Caesars Palace and two other casinos in Las Vegas, according to the Las Vegas Review Journal. [15] A year later, he pleaded guilty to one felony count of passing a bad check. Under the plea agreement, he did not face a prison term, and was put on probation and worked towards repaying the debt. [16] Robberies Edit In July 2000, Walker and former University of Kentucky teammate Nazr Mohammed were robbed outside a South Side Chicago restaurant. [17] On July 9, 2007, Walker and another individual were robbed at gunpoint by two offenders in his own house. The assailants made off with close to $200,000 worth of merchandise, including Walker's Mercedes. His car was later recovered having been stripped of its expensive aftermarket wheels and stereo system. Four men were charged in this robbery and two of them were also linked to the similar robbery of fellow NBA player, Eddy Curry. [18] Bankruptcy Edit On May 18, 2010, Walker filed for Chapter 7 bankruptcy protection in the Southern District of Florida (Miami) as case number 10-23558 with total assets of $4.3 million and debts of $12.7 million. The filing listed four pieces of real estate including a $2.3 million Miami home that was underwater with a mortgage of $3.6 million, and three other properties in Chicago, one listed for $1.4 million. Nazr Mohammed paid half the fee of Walker's bankruptcy attorney. Walker's championship ring had to be sold off. In August 2013, Walker announced that he was debt-free. [19] Between 1996 and 2009, Walker earned more than $108 million from NBA salaries. [20] Broadcasting career Edit Walker is now a basketball analyst on 120 Sports. [21] Walker was also hired by SEC Network as a basketball analyst. NBA career statistics Edit Legend GP Games played GS Games started MPG Minutes per game FG% Field-goal percentage 3P% 3-point field-goal percentage FT% Free-throw percentage RPG Rebounds per game APG Assists per game SPG Steals per game BPG Blocks per game PPG Points per game Bold Career high † Denotes seasons in which Walker won an NBA championship Regular season Edit Year Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 1996--97 Boston 82 68 36.2 .425 .327 .631 9.0 3.2 1.3 .6 17.5 1997--98 Boston 82 82 39.9 .423 .312 .645 10.2 3.3 1.7 .7 22.4 1998--99 Boston 42 41 36.9 .412 .369 .559 8.5 3.1 1.5 .7 18.7 1999--00 Boston 82 82 36.6 .430 .256 .699 8.0 3.7 1.4 .4 20.5 2000--01 Boston 81 81 41.9 .413 .367 .716 8.9 5.5 1.7 .6 23.4 2001--02 Boston 81 81 42.0 .394 .344 .741 8.8 5.0 1.5 .5 22.1 2002--03 Boston 78 78 41.5 .388 .323 .615 7.2 4.8 1.5 .4 20.1 2003--04 Dallas 82 82 34.6 .428 .269 .554 8.3 4.5 .8 .8 14.0 2004--05 Atlanta 53 53 40.2 .415 .317 .534 9.4 3.7 1.2 .6 20.4 2004--05 Boston 24 24 34.5 .442 .342 .557 8.3 3.0 1.0 1.1 16.3 2005--06 † Miami 82 19 26.8 .435 .358 .628 5.1 2.0 .6 .4 12.2 2006--07 Miami 78 15 23.3 .397 .275 .438 4.3 1.7 .6 .2 8.5 2007--08 Minnesota 46 1 19.4 .363 .324 .530 3.7 1.0 .7 .2 8.0 Career 893 707 35.3 .414 .325 .633 7.7 3.5 1.2 .5 17.5 All-Star 3 1 13.3 .350 .300 .500 2.0 1.3 .7 .0 6.0 Playoffs Edit Year Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 2002 Boston 16 16 43.9 .411 .385 .781 8.6 3.3 1.5 .4 22.1 2003 Boston 10 10 44.0 .415 .356 .500 8.7 4.3 1.7 .4 17.3 2004 Dallas 5 5 28.0 .361 .100 .571 10.0 2.4 1.2 .6 9.8 2005 Boston 6 6 37.3 .413 .368 .636 7.3 2.3 1.2 1.0 16.7 2006 † Miami 23 23 37.5 .403 .324 .574 5.6 2.4 1.0 .3 13.3 2007 Miami 4 0 23.0 .405 .500 .818 2.3 1.5 .5 .3 11.8 Career 64 60 38.5 .406 .352 .663 7.1 2.9 1.2 .4 16.1 See also Edit List of National Basketball Association career 3-point scoring leaders List of National Basketball Association career turnovers leaders Notes Edit ↑ Walker returns to Celtics in shocker. Updated February 25, 2005 ↑ By trading two more veteran starters, Wolves grow even younger, October 24, 2007 ↑ Ira Winderman, Riley's trade stokes the Heat Template: Webarchive, South Florida Sun-Sentinel ↑ Wolves Nab First-Round Pick and Three Players From Heat ↑ Wolves pick Mayo, swap him for <mark>Love</mark> in 8-player deal ↑ http: //www.commercialappeal.com/news/2008/dec/15/grizzlies-to-give-walker-a-contract-buyout/ ↑ Antoine Walker Signs In Puerto Rico ↑ Mets de Guaynabo release Antoine Walker ↑ http: //sports.espn.go.com/nba/news/story? id=5167188 ↑ [1] ↑ http: //www.tmz.com/2009/01/05/antoine-walker-busted-for-dui/ #.T3OOZ9lWEpM ↑ \"Archived copy\". Archived from the original on 2013-11-05. https: //web.archive.org/web/20131105200437/http: //www.aolnews.com/2009/01/05/antoine-walker-arrested-for-drunk-driving/. Retrieved 2012-03-28. ↑ Gambling woes for Walker ↑ \"Walker Arrested at Lake Tahoe Cabaret\". ESPN.com. http: //sports.espn.go.com/nba/news/story? id=4336288. Retrieved 2009-09-19. ↑ http: //www.lvrj.com/news/walker-pleads-not-guilty-to-charges-tied-to-gambling-debts-97516504.html ↑ Shine, Conor (June 28, 2011). \"NBA's Antoine Walker pleads guilty to felony check charges\". Las Vegas Sun. http: //www.lasvegassun.com/news/2011/jun/28/antoine-walker-pleads-guilty-felony-check-charges/. Retrieved June 29, 2011. ↑ Heat forward Walker robbed at home in Chicago ↑ \"Man who robbed Walker gets 21 years\" , ESPN.com. May 5, 2009. ↑ Antoine Walker Bankrupt Update: Debt-Free? Former NBA Star Opens Up About Financial Crisis, Says He's Ready To Move On ↑ \"Antoine Walker page at basketball-reference. com\". basketball-reference. com. https: //www.basketball-reference.com/players/w/walkean02.html. ↑ http: //www.120sports.com/video External links Edit Template: Basketballstats Walker's Career Stats Antoine Walker Bankruptcy Documents Retrieved from \"http: //basketball.wikia.com/wiki/Antoine_Walker? oldid=59780\" Categories: Pages with broken file links Born in 1976 American basketball players National Basketball Association players Players who wear/wore number 8 Players who won the NBA Championship Kentucky Alumni Retired Power Forwards NBA All-Star participants Boston Celtics draft picks Boston Celtics players Dallas Mavericks players Atlanta Hawks players Miami Heat players Minnesota Timberwolves players NBA D-League players Idaho Stampede players Players who won the NCAA Championship"}, {"articleID": "2019062901_00058676_W", "names": {"Duncan Hunter": ["Q527493", "Q540521"], "Margaret Hunter": ["Q21456080", "Q43390035", "Q57408454"]}, "date": "2019-06-29", "url": "http://greenwichtime.com/news/crime/article/Congressman-Block-evidence-of-trysts-in-14060285.php", "content": "https: //www.greenwichtime.com/news/crime/article/Congressman-Block-evidence-of-trysts-in-14060285.php Congressman: Block evidence of trysts in corruption case Updated 9:42 pm EDT, Friday, June 28, 2019 FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally used his campaign account for personal expenses. Federal prosecutors say <mark>Hunter</mark> illegally used campaign funds to finance romantic flings with a series of women, spending thousands of dollars on meals, drinks and vacations. Allegations about the married Republican congressman's affairs were outlined in a government court filing late Monday, June 24, 2019, connected to charges he and his wife misspent more than $200,000 on trips and personal expenses. less FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally...more Photo: Gregory Bull, AP Photo: Gregory Bull, AP Image 1 of / 1 Caption Close Image 1 of 1 FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally used his campaign account for personal expenses. Federal prosecutors say <mark>Hunter</mark> illegally used campaign funds to finance romantic flings with a series of women, spending thousands of dollars on meals, drinks and vacations. Allegations about the married Republican congressman's affairs were outlined in a government court filing late Monday, June 24, 2019, connected to charges he and his wife misspent more than $200,000 on trips and personal expenses. less FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally...more Photo: Gregory Bull, AP Congressman: Block evidence of trysts in corruption case 1 / 1 Back to Gallery LOS ANGELES (AP)--Indicted California Rep. <mark>Duncan Hunter</mark> is asking a judge to reject an attempt by prosecutors to introduce evidence that the congressman used campaign funds to finance a string of extramarital relationships. In a motion Friday, the congressman's lawyers say prosecutors are seeking permission \"to focus the jury's attention on Mr. <mark>Hunter</mark>'s infidelity .\" They say evidence that some of <mark>Hunter</mark>'s relationships were romantic isn't necessary for a jury to evaluate the case. Allegations about the married Republican congressman's affairs were outlined in a government court filing Monday, connected to charges he and his wife illegally spent more than $250,000 in campaign funds. <mark>Margaret Hunter</mark> pleaded guilty this month to one corruption count. <mark>Duncan Hunter</mark> has said prosecutors have targeted him for political reasons. The trial is scheduled for September. Most Popular 1 Families in Dominican Republic tourist deaths have ordered independent autopsies 2' I floated inside': Man returns to site of 1973 UFO \"abduction' as it gets a historical marker 3 Elon Musk is worth about $22 billion and has never taken a paycheck from Tesla--here's how the notorious workaholic and father of 5 makes and spends his fortune 4 Ozzy and Sharon Osbourne Slam Trump Over Unauthorized Use of\" Crazy Train' 5 Latest UFO sightings in Connecticut 6 An Apollo astronaut explains how he nearly killed himself \"horsing around' on the moon in 1972 7 Stratford crash that caused 33 miles of delays on Merritt cleared View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2013080618_00092148_W", "names": {"Steve King": ["Q37084447", "Q749710", "Q7613030", "Q7613031", "Q7613033", "Q7613034", "Q7613037"], "Melissa Mccarthy": ["Q229048", "Q50437115"], "Joshua Oppenheimer": ["Q14634179", "Q6290103"]}, "date": "2013-08-06", "url": "http://www.siliconvalley.com/siliconvalley/ci_23800551/from-hollywood-washington-meet-drama-kings-summer", "content": "This image released by Universal Pictures shows Denzel Washington, left, and Mark Wahlberg in a scene from \"2 Guns .\" (AP Photo/Universal Pictures, Patti Perret) (Patti Perret /) Even by Hollywood's standards, the summer movie season has been notable for boys blowing up their toys: No sooner did Robert Downey Jr. almost destroy L.A. to save it in \"Iron Man 3\" than an onslaught of wanton destruction was loosed on the world, from such interstellar fantasies as \"Star Trek Into Darkness\" and \"Man of Steel\" to the \"real world\" mayhem of \"White House Down\" and \"Fast & Furious 6 .\" On Friday, Mark Wahlberg and Denzel Washington lay waste to greater Texas in \"2 Guns,\" an exercise in ritualized male aggression in which guns, cars and other things that go \"boom\" and \"vroom\" aren't celebrated as much as fetishistically worshipped. It's all in escapist good fun, of course. But, watching Stig Stigman (Wahlberg) and Bobby Trench (Washington) banter and back-slap their way through \"2 Guns,\" audiences may detect a whiff of anxiety beneath the bluster. Maybe it's director Baltasar Kormakur's habit of having his characters aim guns at each other's crotches or the increasingly frenetic (and laughable) escalation in firepower. But as the body count adds up in \"2 Guns,\" the inescapable impression is that the movie's pseudo-casual cool isn't entertainment as much as a cry for help. It's the same feeling that Anthony Weiner inspired this week as he tried to brazen his way through calls to exit the New York City mayoral race, with his compulsive exhibitionism outpaced only by his pathological ambition. Weiner's breathtaking braggadocio called to mind other instances of political posturing this summer, whether it was Rep. <mark>Steve King</mark>, R-Iowa, describing the children of undocumented immigrants as probable drug mules \"with calves the size of cantaloupes,\" or Congress spending this week avoiding substantive work, instead casting meaningless votes to score political points. Washington and Hollywood have always enjoyed a symbiotic relationship, with politicians looking westward for borrowed glamour and contributions, and the movie industry coming here for reflected gravitas and policy bona fides. But these days, the two cities share something else. Both are fear-based cultures whose once-invincible leaders are facing radical changes and imminent extinction. And they're coping with those threats, to use Gloria Steinem's famous phrase, with massive cases of self-induced testosterone poisoning. Facing diminishing domestic movie attendance, sliding DVD revenue and expanding international markets, Hollywood - never a courageous place - has become more risk-averse than ever. Few scripts are approved these days without big, fat valentines to a fanatic (the term of art is \"pre-sold\" ) audience, like comic-book fans or video gamers. With foreign markets now accounting for up to two-thirds of a film's revenue, dialogue is likely to consist of one or two catchphrases, with the bulk of communication occurring through gunplay, fireballs and car stunts that are understandable in any language. This summer has featured particularly bombastic examples of that formula. Even with recent hits like \"The Best Exotic Marigold Hotel\" and \"Bridesmaids\" - proving that grown-ups and women of all ages still go to movies - studio executives still cater to 14-year-old boys in their summer programming. But that strategy has proved wobbly, as bro-dacious spectacles like \"White House Down,\" \"The Lone Ranger\" and \"The Hangover Part III\" have gone limp at the box office. (The industry was reportedly gobsmacked when \"The Heat,\" a raunchy action comedy starring Sandra Bullock and <mark>Melissa McCarthy</mark>, turned out to be a sleeper hit .) For their part, politicians these days are also threatened, either by demographic shifts, primary challenges or their own self-destructive tendencies. Their rhetorical arms race, whether born of strategy or egomania, keeps escalating. But who's buying their lines? \"Quit isn't the way we roll in New York City,\" the chronically clueless - and thoroughly unconvincing - Weiner said in his new campaign videoTuesday. \"We fight through tough things. We're a tough city .\" Stig Stigman, meet Carlos Danger. Whether it's Wahlberg winking and blasting his way through \"2 Guns\" or Weiner arrogantly identifying himself with the city he seeks to lead (and that will surely reject him), both share an air of impunity that, to a far more troubling extent, suffuses the chilling documentary \"The Act of Killing .\" In the film, <mark>Joshua Oppenheimer</mark> interviews an Indonesian death squad leader named Anwar Congo, who reenacts the murders he committed in the 1960s as scenes from the pulp movies he idolized. Congo is so immersed in his own narcissistic myth that he's incapable of seeing the moral implications of his actions, which included torture, garroting and mass murders. It's not difficult to imagine Congo watching \"2 Guns\" and eagerly imitating Wahlberg and Washington's bravado, just as he'd almost certainly approve of - and maybe recognize himself in - Weiner's perverse, self-justifying defiance. To chalk up all this shootin' and shoutin' and brawlin' and braggin' simply to male ego would be glibly reductive, of course: Let it be noted, women buy plenty of tickets to these movies, too. But it's hard to believe that our current outbreak of testosterone poisoning - cinematic and political - isn't compensating for deeper insecurities. While studio executives desperately try to stay relevant by reverting to stereotypical male iconography, their counterparts on the political stage affect comical airs of cocky self-assurance and quien-es-mas-macho theatrics."}, {"articleID": "2012081611_00036417_W", "names": {"Craig Foster": ["Q48798475", "Q5180974", "Q925302"]}, "date": "2012-08-16", "url": "http://theworldgame.sbs.com.au/english-premier-league/news/1116506/Fox-optimistic", "content": "\"no fear\" ...southampton's danny fox (getty images) danny fox is confident southampton will travel to manchester city for its premier league opener this weekend pressure-free and with \"no fear\". the 26-year-old left-back returned from a three-year international exile in scotland's 3-1 friendly win over australia at easter road this morning (aest), and will complete the turnaround in his career by travelling with top-flight new boys saints to take on the champions at etihad stadium. city is red-hot favourite to get its campaign off to a flier, but the former celtic and burnley defender insists nigel adkins' side will play in the same positive and carefree manner that won it promotion last season. \"everyone knows how good manchester city are, we watched them last week against chelsea in the community shield,\" he said. \"it will be a game where if we win everyone will be shocked and if we lose no one will be shocked .\" obviously we are going there as underdogs but it is a game we have to go into with no fear and play the way we have been taught to and hopefully we do ourselves proud. \"the gaffer installs that [no fear] in us at southampton. he wants us to play off the cuff and play with a bit of freedom, so hopefully we can do that and do ourselves proud and you never know what can happen .\" fox insists saints can take heart from the performances of last season's new boys to the premier league, swansea and norwich. \"we surprised a lot of people last season so i don't see any reason why we can't do it this season,\" he said. \"look at swansea and norwich last season, they surprised many teams, i remember seeing norwich going to <mark>craig foster</mark>: fozz on football (book) a fascinating book from respected football commentator, broadcaster and ex-socceroo <mark>craig foster</mark>., hitwise '09 #1 television program, hitwise"}, {"articleID": "2008092511_00014832_W", "names": {"President Bush": ["Q207", "Q23505"], "Raul Martinez": ["Q3421438", "Q3930834", "Q7299802", "Q7299805"]}, "date": "2008-09-25", "url": "http://local10.com/politics/17552987/detail.html?rss=mia&psp=news", "content": "truth test - group targets diaz-balart ad posted: 4:28 am edt september 25, 2008 an attack ad that criticizes congressman lincoln-diaz balart tries to portray the incumbent republican as favoring a pay raise for lawmakers over financial support for u.s. troops. the ad cites the congressman's vote on a war funding bill that was eventually vetoed, without stating that he supported subsequent vote on an altered version of the bill. an organization called patriot majority, based in washington d.c., produced and paid for the 30-second television ad. the opening shots show a succession of men who say they served in the army and marine corps, in baghdad and in fallujah. the men look into the camera and say \"congressman lincoln diaz-balart voted against healthcare for our troops, against rehab for amputees, brain injuries, burn care\". the words hr 1591 are superimposed on the screen. diaz-balart did vote against the war funding bill in march 2007, as did almost every republican lawmaker opposed to the democrats' addition of a troop withdrawal date from iraq. the bill passed the house and senate, then died with president <mark>bush</mark>'s veto. the ad does not explain that, three months later, the congressman voted for a similar funding bill without an attached exit date. that bill eventually became law. the ad also alleges diaz-balart voted for five pay raises for members of congress. it does not explain that lawmakers automatically get a cost of living increase every year, unless they vote to cancel it. for six of the last eight years, congress allowed their raises to take effect. the patriot majority is a 527 special interest group technically and legally unaffiliated with any campaign--527s are not bound by election law or campaign finance reporting. diaz-balart's challenger, former hialeah mayor <mark>raul martinez</mark>, had nothing to do with the ad, according to his campaign. in response to local 10's e-mailed inquiry, craig varoga of patriot majority wrote a terse reply: if you want your resume to have a good chance of being read by prospective employers, you must invest time and energy in its content and look. 10 worst mistakes career changers can make"}, {"articleID": "2017052402_00006651_W", "names": {"Bob Knight": ["Q16538199", "Q4933049", "Q888594"], "Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"]}, "date": "2017-05-23", "url": "http://www2.kusports.com/news/2017/may/23/look-some-changes-now-bill-self-has-been-elected-p/", "content": "Keegan: Look for some changes now that Bill Self has been elected president Photo by Nick Krug Kansas University basketball coach Bill Self watches his drive from the first hole during the Bill Self/LPRD Golf Classic, Friday, June 17, 2016, at Eagle Bend. Proceeds from the event will benefit the Wee Folk Scholarship fund. Advertisement Now that Kansas basketball coach Bill Self has been elected president (of the National Association of College Basketball Coaches), what exactly does that mean to the state of college basketball? Well, look for some changes. For one thing, expect Self to turn into a tweeting fool at 3 a.m. Also, his skin will turn as orange as the Syracuse mascot and he will become Self-obsessed. President Self intends to build a wall around the KU campus so that when recruits visit, they won't be able to leave. They'll have no choice but to sign with the Jayhawks. And get this: He's going to get Kentucky coach John Calipari to pay for it. \"Trust me,\" he'll tweet at 3 a.m., \"Cal's footing the bill .\" President Self will see to it that every recruit who signs with either Duke or Kentucky is deported immediately. The fans have been known to raise the roof, figuratively, at Allen Fieldhouse. President Self will raise the roof literally because he is going to transform the field house into a massive tower: Self Tower. Self will proclaim the media \"the enemy of the American people\" and will send Chris Theisen to handle press briefings, but still will make appearances on \"the shows .\" On those shows, when asked how he'll go about devising a strategy for winning a 14th consecutive Big 12 title, Self will answer, \"From watching the General on the shows .\" Presumably, that will mean <mark>Bob Knight</mark>, who sadly no longer is on the shows much these days. President Self will do much of his work on the golf course, where his big hands will come in handy driving the ball 280-yards-plus. Self's term as president of the NABC might seem like an eternity, but will last just two years. President Self's vice president's first name is Mike and his last name is one syllable, Brey (Notre Dame). He will develop derogatory pet nicknames for opponents and won't even spare past NABC presidents. He'll refer to the Michigan State coach as \"Little Izzo .\" Henceforth, Self will refer to referee Ted Valentine as \"Lyin' Ted .\" Self is the third Kansas basketball coach to become president of the NABC. Phog Allen (1927-29) was the first and <mark>Roy Williams</mark> (2001-02) also filled the office that commands respect. Advisers will remind the president to conduct himself with the type of dignity associated with the lofty office. They'll do their best to keep him from tweeting at 3 a.m., but their best advice won't stand a chance against such a powerful urge. They'll lose that battle and he'll call them losers."}, {"articleID": "2019062611_00088748_W", "names": {"John Mcenroe": ["Q16474", "Q37772659"], "Andy Murray": ["Q10125", "Q526811"]}, "date": "2019-06-26", "url": "http://www.winsfordguardian.co.uk/sport/national/17731142.john-mcenroe-cautious-over-andy-murray-singles-return/", "content": "<mark>John McEnroe</mark> cautious over <mark>Andy Murray</mark> singles return By Press Association 2019 <mark>Andy Murray</mark>, right, and Feliciano Lopez won the doubles title at Queen's Club 0 comment <mark>John McEnroe</mark> remains cautious about <mark>Andy Murray</mark>'s hopes of a successful singles comeback. The former world number one made a brilliant return to the match court at Queen's Club last week following a second hip operation in January, winning the doubles title with Feliciano Lopez. <mark>Murray</mark> has also restricted himself to doubles at Wimbledon but spoke about the possibility of a singles return as early as the US Open at the end of August. <mark>John McEnroe</mark>, left, is unsure about <mark>Murray</mark>'s singles prospects (Toby Melville/POOL Wire) <mark>McEnroe</mark> is thrilled to see <mark>Murray</mark> back but is not reading too much into his doubles achievements. Speaking on behalf of espn. co. uk, the American said: \"Doubles is obviously a completely different animal than singles. Best of five (sets) is totally different than best of three .\" But it was nice to see him eager and into it and looking like he was relatively healthy. You can't really determine it until he starts playing singles matches and how the body reacts if you're on a hard court, for example, as opposed to grass. \"It looked very promising, which is great, and I think everyone wants him to be able to come back and then be able to retire on his own terms .\" <mark>Murray</mark> has not yet put himself through the physical rigours of singles (Steven Paston/PA) In <mark>Murray</mark>'s absence from singles, British hopes of a title challenger rest with Johanna Konta following her surprise run to the French Open semi-finals. American great Chris Evert declared herself speechless at Konta's performance in her quarter-final victory over Sloane Stephens, but the British number one was ultimately disappointing in a semi-final loss to Marketa Vondrousova where her old problems with nerves resurfaced. \"I was calling a match at the French, and she could have won the tournament the way she played, and then I see her play a match where she could have lost to almost anybody,\" said Evert. \"I think she's still a work in progress with the mental side of the game, but I think she's working really hard at it. Just the way she's wired, she has to work a little bit more on taking the emotion out of the game and just being fully focused .\" Johanna Konta struggled to hold herself together mentally in her French Open semi-final (Richard Sellers/PA) In the women's tournament, a lot of focus will again be on the form of Serena Williams as she continues her pursuit of Margaret Court's all-time record of 24 grand slam singles titles. The American reached the finals of Wimbledon and the US Open last year but this season has been disappointing, with the 37-year-old hampered by a knee problem and desperately short of matches. Williams did not follow through with her suggestion that she might play a warm-up tournament and arrives at the All England Club having completed just six matches since January. Evert feels Williams made a mistake not playing in Birmingham or Eastbourne, saying: \"I think definitely she should have done, just so she can gauge where she is on the grass and what she needs to work on. The flawless service motion is back. The eye of the tiger is back. The Dynamic Duo is back. @ serenawilliams is back. #Wimbledon prep underway. pic.twitter.com/WYoI6hXBmJ--Mouratoglou Tennis Academy?? (@ MouratoglouAcad) June 20, 2019\" Maybe she doesn't need to be 100 per cent, but she certainly needs to be 80, 90 per cent to really have a chance. \"The one difference that I see in Serena is since she's come back, she's been one or two steps slower than normal. I think that's a little bit of fitness. I think it's a little bit of match play. I think it's a little bit of confidence .\" But it's hard for me to bet against Serena. I would have said in January, if there was any grand slam she was going to win, it would probably be Wimbledon, and I just think with her game, she just loves hitting the ball. She just loves that power. And, if her serve is on, she's going to be tough to beat. \"?? Aorangi?? @ serenawilliams #Wimbledon pic.twitter.com/5TOmLh0L9b--Wimbledon (@ Wimbledon) June 26, 2019 <mark>McEnroe</mark> feels the pressure of time will be playing on the mind of Williams, who turns 38 in September .\" As you get older, at least for me, I felt there was more pressure because you realise that your window is closing and you don't know how much longer you're going to be doing it, \"he said .\" I don't know what she's thinking. But I'm thinking she can't be thinking, \"I'm going to be playing much more than a year or two' .\" 0 comment"}, {"articleID": "2019031509_01741512_W", "names": {"Susan Allen": ["Q18802458", "Q21458971", "Q2654842"]}, "date": "2019-03-14", "url": "http://www.msn.com/en-us/money/taxes/taxpayers-are-leaving-dollar14-billion-in-tax-refunds-on-the-table/ar-BBULmKz?srcref=rss", "content": "© Provided by CNBC LLC The IRS is sitting on $1.4 billion in unclaimed tax refunds, and taxpayers are running out of time to grab their cash. These tax refunds are from 2015, and they belong to about 1.2 million taxpayers who didn't file a return that year, according to the IRS. In order to claim the money, taxpayers must submit their 2015 tax returns by April 15. If these people fail to turn in their Form 1040, the cash goes to the U.S. Treasury. Top 5 Myths About Tax Audits Get the facts Ad Turbotax Generally, you have three years from the due date of your tax return to claim your refund. The IRS may continue to hold your 2015 refund if you haven't submitted returns for 2016 and 2017. More from Personal Finance Wealthy parents in college admissions scam may face IRS wrath Here's the tax bill if you hit the $448 million Powerball Trump budget could open up this tax-free savings account \"Most likely if you have an unclaimed refund, you just never filed your return,\" said <mark>Susan Allen</mark>, CPA and senior manager of tax practice and ethics for the American Institute of CPAs. \"The common thing is that maybe you thought you didn't have a filing requirement or your income is too low, but you could still be entitled to a refund,\" she said. There is no penalty for submitting a late return if you're due a refund. The IRS isn't as kind to late filers with balances due; those taxpayers are on the hook for penalties. Who needs to file © Provided by CNBC LLC The Internal Revenue Services offices in Washington, D.C. Generally, once your income reaches a certain level, you need to file. For the 2018 tax year, single filers under 65 are required to submit a return if their gross income was at least $12,000. For married couples under 65, the threshold is $24,000. If you're 65 and over, you'll need to file if your gross income is at least $13,600. That number goes up to $25,300 for married couples if one spouse is over 65, and $26,600 if both are at least that age. Your dependents aren't necessarily off the hook for filing, either. Whether your kids must file a return will depend on whether they had earned or unearned income. For 2018, single dependents under age 65 must file a return if they had unearned income--that is, income from taxable interest, dividends and capital gains--over $1,050, according to the IRS. They must also file a return if their earned income--money from salaries, wages, and tips--exceeds $12,000. When filing pays © Provided by CNBC LLC Just because you don't have to file, doesn't mean you should skip it. For instance, low-income filers might be eligible for the earned income tax credit. This tax break is more generous for families: Filers with no kids can get a maximum credit of $519 for the 2018 tax year, but the break goes up to $6,431 for taxpayers with 3 or more kids. The catch is that you need to file your return in order to claim the credit. Subscribe to CNBC on YouTube. Read More"}]