[{"articleID": "2019041608_00541235_W", "names": {"Alexander Mcqueen": ["Q207939", "Q21014274"]}, "date": "2019-04-16", "url": "http://www.westerntelegraph.co.uk/news/national/17576445.francois-henri-pinault-the-fashion-mogul-married-to-the-hollywood-star/", "content": "Francois-Henri Pinault--the fashion mogul married to the Hollywood star By Press Association 2019 Salma Hayek and Francois-Henri Pinault 0 comment Married to Hollywood star Salma Hayek and the son of a French business mogul, Francois-Henri Pinault has become one of the most important figures in the luxury goods industry and a regular on the front row of catwalk shows. He began his career at his father Francois Pinault's company Pinault Distribution, which later became PPR and then Kering, in 1987 and is now its chairman and chief executive. Under his leadership the group sold off its retail assets including La Redoute and Printemps and merged with the Gucci Group, which oversees luxury brands including Gucci, Yves Saint Laurent and <mark>Alexander McQueen</mark>, to become one of the biggest players in high-end fashion. Francois-Henri Pinault and Salma Hayek attending the British Fashion Awards in 2015 (Ian West/PA) He changed the name of the group from PPR to Kering in 2013 in reference to his Breton roots. Mr Pinault, 56, has been president of his family's investment firm, Groupe Artemis, since 2003, and it is this group that will donate funds to help restore Notre Dame Cathedral after it was devastated by fire. In a statement obtained by French newspaper Le Figaro, he said: \"My father (Francois Pinault) and myself have decided to release a sum of 100 million euro from our Artemis funds (the family holding company) to participate in the effort that will be necessary for the complete reconstruction of Notre Dame .\" Mr Pinault married Hayek in Paris in 2009 and the couple have an 11-year-old daughter named Valentina. He was previously married to Dorothee Lepere and dated supermodel Linda Evangelista. 0 comment"}, {"articleID": "2018110621_00059670_W", "names": {"Grant Edwards": ["Q5596200", "Q56590026"]}, "date": "2018-11-07", "url": "https://www.gladstoneobserver.com.au/news/cyclist-vows-to-keep-cameron-frewers-legacy-alive/3568829/", "content": "Experienced cyclist Matthew Eaton says for safety advocate Cameron Frewer's legacy to continue, more driver awareness and education is needed. <mark>Grant Edwards</mark> News Cyclist vows to keep Cameron Frewer's legacy alive by Ashley Carter Ashley Carter Full Profile Login to follow 7th Nov 2018 5:00 AM | Updated: 6:25 AM premium_icon Subscriber only 0 AS THE Sunshine Coast comes together to mourn safety advocate Cameron Frewer, one cyclist says more awareness is needed about road safety. Matthew Eaton, of Caloundra, had a near miss earlier this year, just 2km away from where Mr Frewer was killed Monday morning. Mr Eaton was turning right from Ivadale Blvd about 8am on April 17 when he was taken out by a driver who he said was not paying attention. \"I signalled and I had bike lights and everything,\" he said. \"After entering the roundabout...a car came up continuing on Parklands Blvd and didn't see me, and took me out from behind .\" He sustained a bad elbow injury with soft tissue and bone bruising, severe gravel rash to his back and legs, and whiplash in his back. Mr Eaton said the Sunshine Coast had \"amazing\" infrastructure for both cyclists and drivers, and the biggest issue with road incidents was driver inattention. \"I commuted every day in Sydney for five years...never had an accident,\" he said. \"It was sort of funny to come up here where there was a lot more space, and then suddenly there's an accident .\" The Sunshine Coast is really well set up for cycling. The shoulders of the roads are huge, there's usually a lot of space at intersections, there's lots of cycle lanes. \"But in a way, that almost breathes a bit of complacency amongst a lot of people, drivers and cyclists included .\" Mr Eaton is one of many cyclists who have saught legal advice from Shine Lawyers over incidents on Sunshine Coast roads. Cam Frewer has created a facebook page to educate drivers about cyclists on the roads and he has received death threats for his efforts. John McCutcheon While Mr Eaton didn't know safety advocate Cameron Frewer personally, he had read about his campaign efforts online. \"He was quite well known,\" he said. Mr Eaton said while there were \"bullies\" on the roads, they weren't the issue when it came to cyclist safety. To continue Mr Frewer's cyclist safety legacy, Mr Eaton said drivers needed to be educated on road sharing rules and be more attentive. \"They (bullies) are out there, and they intimidate you and they yell things and drive particularly close, but in actual fact I don't think they're the ones who are the most dangerous, because they're so attentive of you,\" he said. \"They see you and they try to annoy you, and they know you're there .\" In my accident it was just a normal, middle-aged lady who wasn't paying attention. \"Matthew Eaton had a near miss earlier this year. A long-running feud between drivers and cyclists on the Sunshine Coast has reignited in the wake of Mr Frewer's death. Mr Eaton said if each side could see the other's point of view, it would make a huge difference .\" I think every driver needs to ride a bike at one point, \"he said .\" If you got every person who drives a car just to ride a bike once on the road...that would make them understand. \"For cyclists to feel safe riding on public roads, Mr Eaton said all road users needed to be mindful and respectful of each other .\" At the end of the day, you're completely trusting people in vehicles...that they're going to see you and they're going to be attentive of you, \"he said .\" There's a lot of trust involved. \"Related Items premium_icon\" Cyclists are human beings': Lawyer's plea to drivers 0 caloundra Read More Login to follow cameron frewer Read More Login to follow cycling Read More Login to follow cyclist safety Read More Login to follow editors picks Read More Login to follow little mountain Read More Login to follow motoring Read More Login to follow road safety Read More Login to follow caloundra cameron frewer cycling cyclist safety editors picks little mountain motoring road safety"}, {"articleID": "2010031119_00019379_W", "names": {"David Smith": ["Q1176671", "Q1176674", "Q16194812", "Q16201315", "Q1916387", "Q1951382", "Q21165896", "Q21453047", "Q25184192", "Q25397428", "Q26848960", "Q28855433", "Q3018800", "Q3369644", "Q3527050", "Q39620757", "Q42761997", "Q42793405", "Q43240849", "Q43914056", "Q47451204", "Q50098593", "Q5229871", "Q5230807", "Q5231728", "Q5239876", "Q5239878", "Q5239879", "Q5239882", "Q5239883", "Q5239884", "Q5239886", "Q5239887", "Q5239888", "Q5239889", "Q5239891", "Q5239892", "Q5239893", "Q5239895", "Q5239896", "Q5239899", "Q5239900", "Q5239901", "Q5239902", "Q5239903", "Q5239904", "Q5239905", "Q5239906", "Q5239907", "Q5239908", "Q5239909", "Q53960880", "Q55965901", "Q57053421", "Q902736"]}, "date": "2010-03-11", "url": "http://fayobserver.com/Articles/2010/03/11/982685", "content": "what email address would you like us to send it to? first set of closing arguments presented in shareef trial the first set of closing arguments from the prosecution and the defense in the abdullah el-amin shareef capital murder trial took jurors down far different roads this morning. assistant district attorney rita cox led the 15 members of the jury on a chronological trail of what the prosecution has tried to present as pure murder and attempted murder. shareef, 31, is accused of stealing two vehicles and running down five people in cumberland and harnett counties on april 14, 2004. one of the victims, lonel bearl bass of linden, was killed. \"in the course of 90 minutes - an hour and a half - abdullah shareef would alter their lives forever,\" cox said. she revisited the course of tragedy, linking the five victims of shareef's road rampage. \"what do we know?\" she repeatedly asked members of the jury. on behalf of the state, cox presented a series of \"intentional acts\" on shareef's part. she emphasized words such as \"deliberate\" and \"malice\" in describing shareef's actions on that morning six years ago. \"he's pre-meditating,\" she said. \"he's deliberating ....he knows the consequences of his actions .\" later, attorney carl ivarsson delivered the defense's side of the case. he gave a chronology of the development of mental disease in his client. \"he has schizophrenia. he was born with it. you have it for life,\" he said. \"he had schizophrenia then. it just hadn't manifested itself .\" shareef has pleaded not guilty by reason of insanity to charges of murder and attempted murder. if convicted, he could face the death penalty. doctors have said shareef suffers from paranoid schizophrenia. he was twice found incompetent to stand trial, according to court testimony. the medication that he is on has made him competent. \"this case is not about failed attempts to help abdullah,\" said ivarsson. \"this case is about his state of mind at the time of the incident .\" ivarsson said, \"we're not blaming anyone ....it just happened. a mentally ill person did not get the medication he needed at the time it happened .\" defense lawyer <mark>david smith</mark> and attorney for the prosecution cal colyer are scheduled to present their closing arguments this afternoon. the jury could have the case in its hands by the end of the day. get your complete news report daily in the fayetteville observer: when you post comments on fayobserver.com, we ask that you keep the conversation civil and on topic as set out in our terms of use. avoid profanity, inappropriate language or innuendo. don't harass others, launch personal attacks or suggest or threaten violence. report abuse to"}, {"articleID": "2016090209_00244539_W", "names": {"Jim Parsons": ["Q190972", "Q30605776"]}, "date": "2016-09-02", "url": "http://www.ibtimes.com/big-bang-theory-star-kaley-cuoco-exposes-breasts-shocking-snapchat-photo-2410631", "content": "\"Big Bang Theory\" star Kaley Cuoco was feeling cheeky on Wednesday when she revealed her chest while playing around with her friend's Snapchat. The actress had been trying out different Snapchat filters and voice modifications on stylist Brad Goreski's phone, including one with adorable fox ears. In one photo, Goreski sported the creepy grandpa filter, complete with round-frame glasses and a checkered hat, while pointing at Cuoco's breast, which she exposed by unbuttoning her white shirt, according to Entertainment Tonight. But don't worry, the actress' assets were covered with a giant heart emoji. Cuoco, who does not have a public Snapchat account, also shared a video on her own Instagram account, showing her hanging out with boyfriend Karl Cook, Goreski and other friends. \"Killing the game today #squadgoals,\" she captioned the clip, which showed her sitting on Cook's lap and pressing several kisses on his cheek. Cuoco has been showing a lot of love for her equestrian boyfriend on social media lately. Last week, she shared a sweet photo of them kissing on Instagram, which she captioned, \"I miss this face already .\" Meanwhile, Cuoco is busy filming the upcoming season of \"The Big Bang Theory\" with co-stars Johnny Galecki, <mark>Jim Parsons</mark>, Simon Helberg, Mayim Bialik, Kunal Nayyar and Melissa Rauch. It was announced in July that Katey Segal, who played Cuoco's character's mother in \"8 Simple Rules,\" has been also cast as her mom in the CBS series. Cuoco, of course, immediately took to social media to share how excited she is to be working with Segal again. Related Stories Johnny Galecki, Kaley Cuoco Cuddle On \"The Big Bang Theory' Set Kaley Cuoco Shuts Down Marriage Rumors On Instagram Kaley Cuoco Shares Sweet Instagram Photo With Boyfriend Karl Cook\" Yes yes yes yes!!! Once my tv mom, always my tv mom love you @ kateylous!!!!! #fullcircle @ thebigbangtheory__, \"Cuoco captioned an Instagram pic with Segal. Catch Cuoco and the rest of the cast when\" The Big Bang Theory \"Season 10 returns with brand new episodes on Monday, Sept. 19 on CBS. Kaley Cuoco recently bared her chest in a Snapchat post. Pictured: Cuoco poses backstage with her award for Favorite Comedic TV Actress during the 2015 People's Choice Awards in Los Angeles, Calif., on Jan. 7, 2015. Photo: Reuters/Danny Moloshok"}, {"articleID": "2015100914_00153798_W", "names": {"Stephen Murphy": ["Q16733036", "Q20745075", "Q21090563", "Q551440", "Q55367520", "Q7610061", "Q7610062", "Q7610063", "Q7610064"], "Peter Mcintyre": ["Q40001085", "Q7175790", "Q7175792", "Q7175794"]}, "date": "2015-10-07", "url": "http://canberratimes.com.au/domain/domain-news/latest-news/werribees-first-apartment-tower-site-up-for-grabs-20151006-gk2zx3.html", "content": "Oct 7, 2015 Kirsten Robb Data Journalist Werribee Town Centre. There are plans to develop Werribee into a major city centre with high rise towers. Could this be the beginning of high rise living in Werribee? A double-block site, zoned to host a seven level apartment block, is piquing the interest of developers in Melbourne's outer west. If permits were issued, it would be the tallest residential apartment tower built in Werribee. The tallest building is currently a four storey serviced apartment block on Synnot Street in Werribee's town centre. The two properties at 41 and 43 Cottrell Street recently came on the market following the 2014 death of local identity and pharmacist Hinton Lowe, who owned one of the homes. Mr Lowe's neighbours saw the appeal of combining the site, after the area was re-zoned from residential to commercial use as a part of Werribee's Activity Centre Boundary. The land has been earmarked for mixed-use city development, with both state and local government encouraging higher density development in the area. Wyndham City Council has fast - racked the planning process, allowing potential developers to apply for permits along the area online. Domain understand there is currently one application for a seven level commercial building currently before the council. Wyndham Mayor Cr Peter Maynard said while nothing had yet been approved, high density living in the area had been welcomed by most residents. \"There is certainly a need for options for people, and we will try to tailor them to suit what we need,\" Cr Maynard said. The activity centre borders the 775 hectare old State Research Farm area in East Werribee, which the state government is currently reviewing tenders for. One of the bids included plans for 50-level skyscrapers amongst Melbourne's newest major education and employment hubs. Werribee City Centre and East Werribee are earmarked for enormous expansion and mixed-use city development. Photo: Wyndham City Council Brian Mark Real Estate agent <mark>Stephen Murphy</mark>, who is listing the sale of the Cottrell Street site via private treaty, said he had received significant interest in the site, particularly from overseas investors. \"We've spoken to developers from Indonesia and China, as well as a few local people,\" Mr <mark>Murphy</mark> said. Plans for the site will have to include commercial street frontage--such as ground floor offices, a restaurant or retail businesses--but can have apartments behind that frontage and on the upper floors, to a height of seven levels. The plans will see Mr Lowe's architectually-designed estate, at number 41, demolished. It had been crafted by well-known Melbourne architect <mark>Peter McIntyre</mark>, whose major projects include Melbourne's Parliament Station, The Jam Factory and the 1952 Melbourne Olympic Swimming Pool. The archictually designed home at 41 Cottrell Street, Werribee will likely be demolished to make way for an a high-rise apartments Photo: Supplied Mr <mark>Murphy</mark> said the of 2631 square-metre site on the Werribee River front was a rare opportunity, given the changing nature of Werribee. \"I can't imagine a better place to be buying something, in line with the what's happening with Werribee right now,\" he said. \"I'm personally very excited for my kids growing up, it will be the new city of the west out here, it's a very dramatic change .\" LJ Hooker Werribee director Adrian McEvoy said the news of the re-zoing had excited residents who believed they could cash in on developer hotspots. \"When you have zoning changes, it goes around like bushfire,\" Mr McEvoy said. \"All of sudden they have dollar signs in their eyes .\" He said many people were inquiring with agents, the council and architects about the possibilities their properties held and we starting to talk to thier neighbours about combining blocks. \"Real people are investigating and seeing what can and can't do, either on their own or by teaming up with their neighbours .\" Domain Home Price Guide Find out what your property's worth Find out now! Domain"}, {"articleID": "2014061806_00065710_W", "names": {"Barbara Williams": ["Q1844755", "Q4859413"], "Jerry Anderson": ["Q14950481", "Q16096792", "Q6183201"], "Ian Nelson": ["Q16236937", "Q39078787", "Q984070"]}, "date": "2014-06-17", "url": "http://wtol.com/story/25800903/attorney-for-riverdale-families-releases-scathing-letter", "content": "Attorney for Riverdale families releases scathing letter A photo of <mark>Williams</mark> sent home with a Riverdale student (Source: Blanton family) The following are mugshots of individuals arrested on a variety of charges in June by local authorities in Northeast Tennessee. The following are mugshots of individuals arrested on a variety of charges in June by local authorities in Northeast Tennessee. The following are mugshots of individuals arrested in May by local authorities in Northeast Tennessee. The following are mugshots of individuals arrested in May by local authorities in Northeast Tennessee. meta content = \"2014-06-16 11:11:09\" > Teen tuba player alerts family to fire, helps everyone get out safely Firefighters are working to put out a house fire in the Lake Carolina area. Details are limited right now, but Columbia Fire Chief Aubrey Jenkins confirms that firefighters were working to put out a fire A teenage tuba player is being credited with alerting his family about a house fire and getting them out safely. meta content = \"2014-06-17 04:40:23\" > Mother: Energy drinks factors in daughter's heart attack Lanna Hamann, 16, was vacationing in Rocky Point, Mexico, when her mother received a call she never expected: Her daughter was dead from a heart attack. Lanna Hamann, 16, was vacationing in Rocky Point, Mexico, when her mother received a call she never expected: Her daughter was dead from a heart attack. meta content = \"2014-06-17 01:04:11\" > Another allegation of abuse reported at Riverdale Schools involving same teacher A second family has come forward and has filed a report against Riverdale teacher Barb <mark>Williams</mark>. Tonight, WTOL's <mark>Jerry Anderson</mark> spoke with Bryce and April Blanton of Forest, OH. Mother says 16-year-old daughter died from energy drink heart attack Lanna Hamann, 16, was vacationing in Rocky Point, Mexico, when her mother received a call she never expected: Her daughter was dead from a heart attack. (6/16/2014) A house in Cheshire collapsed over the weekend, but the victim inside may have been buried under the rubble for days. A house in Cheshire collapsed over the weekend, but the victim inside may have been buried under the rubble for days. Sandusky County Jail and Dungeon open for spooky tours The historic Sandusky County Jail is open for tours. Monday June 16 many people had the chance to get a look inside the jail and dungeon. Two died on Monday when tornadoes struck Pilger, NE. (Source: Chad Cowan/CNN) Two died on Monday when tornadoes struck Pilger, NE. Two died on Monday when tornadoes struck Pilger, NE. Stormtrack Weather Forecast for Monday June 16: PM Edition A warm and humid setting moved in today and will stick through the work week. (Toledo News Now) - The attorney representing two Riverdale Elementary students who claim to have been abused by a teacher released a scathing letter he sent to the Hancock County Prosecutor on Tuesday. In the letter, attorney Daniel Margolis says \"the government entities that exist to investigate, charge and prosecute child abuse and crimes against children in both Hancock and Wyandot counties are hopelessly compromised .\" Margolis claims law enforcement never interviewed <mark>Ian Nelson</mark>, the first alleged victim to come forward. He also says there was \"no effort made to identify other victims of abuse as no law enforcement agency requested any other people to come forward if they have information .\" Margolis concludes the letter by requesting the investigation be turned over to the Ohio Bureau of Criminal Investigation. \"We are asking, demanding, on behalf of these two children, you request BCI take over these two cases, have an impartial special prosecutor appointed to investigate these cases. The special prosecutor would then direct a neutral law enforcement a agency not tainted by an overt conflict of interest, and allow the chips to fall where they may .\" On Monday, Bryce and April Blanton of Forest, OH came forward to say their son was also abused by <mark>Barbara Williams</mark>. <mark>Williams</mark> had already been caught on tape lifting up kindergartner <mark>Ian Nelson</mark> by the face. (Click here for video of that incident) Read the full letter here: Another allegation of abuse reported at Riverdale Schools involving same teacher Family's attorney requests special prosecutor in Riverdale teacher case Riverdale student's family attorney says case should have gone to grand jury Board meeting allows parents to speak about Riverdale teacher incident Police report on Riverdale School incident forwarded to prosecutor Riverdale Schools teacher hires lawyer after caught on video grabbing boy Attorney for Riverdale families releases scathing letter SLIDESHOW: Teacher under fire after grabbing kindergarten student Barb <mark>Williams</mark>, a teacher at Riverdale Schools, is under fire after she was caught on camera using what some say is excessive physical force with a student."}, {"articleID": "2016072719_00098293_W", "names": {"Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"], "Joe Allen": ["Q313250", "Q6208327", "Q641139"], "Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"], "Steve Walsh": ["Q24060240", "Q3499152", "Q4111257", "Q583470", "Q7614221"], "Farhad Moshiri": ["Q3066849", "Q861168"], "Bobby Brown": ["Q16091730", "Q16186597", "Q18631694", "Q2907929", "Q311241", "Q4934816", "Q4934817", "Q4934818", "Q4934821", "Q82004", "Q888468", "Q888471"], "Brad Smith": ["Q15477554", "Q16218831", "Q23664265", "Q24084114", "Q2923428", "Q4954263", "Q4954264", "Q4954266", "Q4954267", "Q4954269", "Q4954270", "Q50300377"]}, "date": "2016-07-27", "url": "http://www.mirror.co.uk/sport/football/news/brian-reade-column-forget-england-8505325", "content": "Compared to the summer of 50 years ago, this one hasn't exactly been a classic for English football, has it? Realising your national side isn't as good as Iceland's and that the best available choice to lead it into a bold, new era is Sam Allardyce fills an England fan with the kind of confidence a sixth-former has going to a disco with a cold-sore moustache. But a new Premier League season is now just around the corner--when football addicts from Khartoum to Kuala Lumpur will be crowding outside the windows of TV shops to watch the Greatest Show On Earth (copyright Richard Skydamore). Action Images via Reuters / Andrew Couldridge But anyway...let's focus on the new Premier League season So let's look past the ugly sights of next season--Norwich's third kit, Gary Lineker in his undies, Jose Mourinho whining about this new-fangled competition called the Europa League that has been designed solely to punish him--and focus on the positives. Read More David Beckham's Sky ad for the new season will make you ridiculously excited Here, in a bid to lift the spirits, I offer fans of all Premier League clubs three reasons to be cheerful: LEICESTER You are the champions. So far you've only lost N'Golo Kante. And you're looking at the prospect of watching Barcelona, Real Madrid or Juventus walk on to your pitch while you bang your plastic clackers together in time to the Champions League anthem. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video ARSENAL You may have missed out on Jamie Vardy, Zlatan Ibrahomivic and every other decent striker, but look at the plusses. Piers Morgan now lacks the will to keep up his \"Wenger Out\" rants. So enjoy your ascent to the top of the table. And then the fury of the downfall. Read More Ivan Gazidis insists Arsenal \"can't afford to outgun competitors\" TOTTENHAM That shocking run at the end of last season is history. Those young stars will be a year older and wiser. You're back in the Champions League, meaning you might be welcoming Real Madrid's Gareth Bale and Luka Modric back to London for a good pasting. Action Images / Matthew Childs These two could return to face their old club one midweek night before Christmas MANCHESTER CITY You're seeing Pep Guardiola on the training ground and the touchline. You're seeing Pep Guardiola at press conferences. Less than a decade ago, you were seeing Stuart Pearce in those places. MANCHESTER UNITED Louis van Gaal's clipboard has gone. Ibrahimovic and Mourinho are in place. Meaning Wayne Rooney will finally have to justify his & pound; 300,000-a-week wages or he'll be back on a plane to China--this time to play. Man Utd via Getty Where will Jose Mourinho deploy Wayne Rooney--and how often? SOUTHAMPTON You've lost your best players and your manager. But that happens every year and you cope. Do it again and you'll have the added pleasure of making me look a fool for saying this is the time you get sussed. WEST HAM Your Tory board managed to wangle the Olympic Stadium off a Tory government for two bob. You've got the star player of the Euros, Dimitri Payet, and the star pundit, Slaven Bilic. You're back in Europe--and good enough to take it seriously. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video LIVERPOOL Jurgen Klopp is ruthlessly moving on the dead-wood. He's also bringing in midfielders who look like they might be able to score. And you'll be able to watch them do so in a rebuilt Anfield, not some plastic Subbuteo stadium in Stanley Park. STOKE <mark>Mark Hughes</mark>, not Tony Pulis, is in charge, meaning decent football not rugby. You've convinced exotic names such as Shaqiri, Bojan, Arnautovic and Afellay to remain in The Potteries. And you've just added The Welsh Xavi. Twitter/Stoke City FC <mark>Joe Allen</mark> has joined Stoke's talented squad after shining for Wales at the Euros CHELSEA With new boss <mark>Antonio Conte</mark>, the words \"player power\" will be a thing of the past. Eden Hazard can't be as bad as last season. And your \"Captain, Leader, Legend\" will still be wearing a full Chelsea kit...when he bunks in on any laps of honour. EVERTON By hiring Ronald Koeman and <mark>Steve Walsh</mark>, new major shareholder <mark>Farhad Moshiri</mark> has shown brains and nous. Romelu Lukaku will probably stay, and be joined by players bought for unheard-of fees. And <mark>Bobby Brown</mark> Shoes will no longer state the opposite of what you've just seen. Tony McArdle/Everton FC via Getty Images Ronald Koeman and <mark>Steve Walsh</mark> have the job of making Everton contenders again SWANSEA Andre Ayew and Gylfi Sigurdsson are still there. You've got a couple of Dutchmen in and there's talk of a bid to bring Wilfried Bony back. And this is your sixth season in the Premier League--to Cardiff's one. WATFORD You've kept those two lethal strikers Troy Deeney and Odion Ighalo. You've lost a decent manager but in Walter Mazzarri gained one with a fine pedigree at the highest level in Italy. And you've bought a striker called Success. Which bodes well. Getty Watford have strengthened their attack by signing the brilliantly named Isaac Success WEST BROM Tony Pulis may bore you, but he'll bore you to safety. The Saido Berahino saga is surely about to end. You could be taken over by the richest man in China, meaning the financial shackles may soon come off. CRYSTAL PALACE Christian Benteke will no doubt end up getting on the end of Andros Townsend's crosses. The loudest of fans will cheer them on. Which could see a flying start that has Alan Pardew grinding his groin into the cameras in woefully premature celebration. Pardew's FA Cup final dance moves when Palace took the lead backfired on him BOURNEMOUTH You're still mixing it with the big boys and can open the season by beating Mourinho's Man United at home. Eddie Howe was not nicked by England. In Jordon Ibe and <mark>Brad Smith</mark> you've bought the cream of Liverpool's young talent. Sort of...SUNDERLAND The boss who sees narrowly avoiding relegation as a \"big achievement\" has gone. Replaced by one who, in his last seven seasons at Everton, averaged a sixth-placed finish on a net spend of & pound; 850,000. Newcastle went down. Getty David Moyes' arrival promises more ambitious goals than mere survival at Sunderland BURNLEY Back in the Premier League at the first attempt with your manager and players all the stronger for it. Last season's 40-goal strike partnership of Andre Grey and Sam Vokes is still there. As are Blackburn--in the Championship. MIDDLESBROUGH After seven years in exile, you're back where you belong. Neven Subotic almost joined. Alvaro Negredo and Victor Valdes did, reminding you of the days you could attract stars like Ravanelli and Juninho. Albeit today's stars are a decade older. HULL Right now, you've got 13 fit players. Plus no manager. So surely, things can only get better? Poll loading ..."}, {"articleID": "2015010318_00011857_W", "names": {"Christopher Thomas": ["Q17310815", "Q59020931"]}, "date": "2015-01-03", "url": "http://denverpost.com/news/ci_27251573/avalanche-victim-soldier-outdoorsman-friends-say", "content": "A Colorado Springs man who died in an avalanche Wednesday was a soldier and experienced outdoorsman who knew the risks and dangers of life and chose to take them anyway, friends said. Whether serving three combat tours in Iraq and one in Afghanistan or climbing mountains, friends of <mark>Christopher Thomas</mark> said the 39-year-old embraced challenges. \"He was extremely experienced and prepared,\" said Joy Burton, a family friend who knew <mark>Thomas</mark> through Living Earth Church in Denver, a church centered around neo-paganism. \"He purposely sought out challenges and experiences in the wilderness. I think it helped him with his last tour overseas .\" Sheriff seeks suspect in attempted Monarch Mountain sex assaults We reserve the right to remove any comment we feel is spammy, NSFW, defamatory, rude, or reckless to the community. We expect everyone to be respectful of other commenters. It's fine to have differences of opinion, but there's no need to act like a jerk. \"Bullet-looking missile thing' turns heads along highway south of Boulder Lockheed says object part of\" sensor technology' testing that ended Thursday"}, {"articleID": "2019062202_00060302_W", "names": {"Govind Singh": ["Q25189168", "Q5589855"], "Joginder Singh": ["Q16221177", "Q3005290", "Q59247888"]}, "date": "2019-06-22", "url": "http://www.tribuneindia.com/news/himachal/thakur-visits-injured-assures-them-help/791264.html", "content": "Posted at: Jun 22, 2019, 7:35 AM; last updated: Jun 22, 2019, 7:35 AM (IST) Thakur visits injured, assures them help Also in this section Our Correspondent KULLU, JUNE 21 Chief Minister Jai Ram Thakur met the victims of Banjar bus accident at Kullu hospital here today and directed the district administration to provide all possible assistance to the injured. Giving details about the accident, the Chief Minister said that 44 persons had lost their lives while 37 were injured. Eleven injured have been referred to the PGI, Chandigarh, and three were admitted to Ner Chowk hospital. He said that 22 injured were being treated in Kullu hospital. The Chief Minister said a magisterial inquiry had been ordered and overloading seems to be primary reason for the mishap. He said \u0007 that action would be taken after the report of the inquiry was received. He said that bus operators sometimes give a go-by to norms, especially on the rural routes. Strong measures would be taken to ensure that such incidents don't happen in future. Transport minister <mark>Govind Singh</mark> Thakur said it was unfortunate that so many lives had been lost and expressed grief towards the affected families. He said, \"Condition of 2009 model bus, passing report of the bus and insurance were all in order. There looked a human error and the bus was overloaded .\" Those dceased are Balu Devi (67), Chandani (21), Champa Devi (27), Meera Devi (19), Pattu Devi (62), Hem Lata (24), Kanta Devi (28), Reeta Devi (31), Janvi (8), Durga Devi, Kusum Lata (20), Dhaneshwari (19), Pushpa Devi (29), Veena Devi (20), Yamuna Devi (17), Aditya Sharma (22), Depender (26), Kishan Chand (62), Dola Ram (60), Khem <mark>Singh</mark> (62), Hamesh Kumar (37), Nitu (26), Panna Lal (37), Bishan <mark>Singh</mark> (49), Ses Ram (69), Ramesh Chand (21), Yash Pal (39), Reet Ram (45), Charan <mark>Singh</mark> (54), Sayed Faizal Hasan (32), Kol <mark>Singh</mark> (26), <mark>Joginder Singh</mark> (28), Khawan <mark>Singh</mark> (65), Mohan Lal (42), Puran Chand (24), Ses Ram (68), Dina Nath (60), Thanesh (5), Sadi Devi (25), Ingit Negi (18), Lila Devi (35), Mamta, Budhi <mark>Singh</mark> (59). One body was unidentified."}, {"articleID": "2020040917_00093752_W", "names": {"Mike Ryan": ["Q20655947", "Q30122415", "Q360703", "Q37381043", "Q6848659", "Q6848661"]}, "date": "2020-04-09", "url": "http://latinpost.com/articles/144698/20200409/confirmed-study-finds-cats-catch-covid-19.htm", "content": "CONFIRMED! Study Finds Cats Can Catch COVID-19 By Neil P. (staff @ latinpost.com) First Posted: Apr 09, 2020 08:43 AM EDT Share This Tweet This Close Share This Tweet This (Photo: Pexels) A recently published study in the Journal of Science confirms that COVID-19 can infect cats, and this has now prompted the World Health Organization to have a further look at the study. COVID-19 TRANSMISSION COVID-19 that originated in Wuhan, China, is thought to be transmitted by persons to other persons through droplets. It is for this reason that social distancing, stay-at-home policy, and other strict measures are implemented across the globe to control the spread of the virus. Now, there are more than 1.5 million of COVID-19 cases around the globe and a death toll of more than 88,000 according to worldometers. These numbers are expected to increase or will reach its peak once there is mass testing for COVID-19. The transmission of COVID-19 from persons-to-persons has been scientifically established. It is the reason why almost 30 pharmaceutical companies are on the race of developing a vaccine that will kill the virus and treat the patients. CATS CAN CATCH THE VIRUS Recent research published in the Journal of Science states that COVID-19 can infect cats, but dogs and other animals like chickens, pigs, and ducks are not likely to catch the virus. The primary purpose of the study is to identify which among the animals are vulnerable for the virus so that they can use it in testing the vaccine before applying for the Phase 1 or the human clinical trial to make sure that the vaccine is safe and effective. It is believed that the virus first spread from bats to humans. Meanwhile, aside from the reports that cats and dogs can be infected with the virus, there is still no scientific and empirical evidence that pets can be carriers of the virus. In a recent report from Latin Post, a four-year-old Malayan tiger at the Bronx Zoo tested positive for COVID-19 after it was exposed to a zookeeper who was an asymptomatic COVID-19 carrier. It raised the question of whether or not the virus can be transmitted from humans-to-animals. HOW THE RESEARCH WAS CONDUCTED During the epidemic period of COVID-19 in China, they conducted a study in January and February and they found out that cats and ferrets are highly susceptible to the virus. The researchers of the said study attempted to infect the animals through viral particles via the nose. The other result of the study is that cats can transmit the virus to other cats via respiratory droplets. At the same time, these infected cats were found to have the virus in their mouth, nose, and small intestines. Daniel Kuritzkes, head of infectious diseases at Boston's Brigham and Women's Hospital, said: \"It's both interesting and not surprising in the sense that with the original SARS epidemic, civet cats were implicated as one of the vectors that may have transmitted virus to humans .\" He also added: \"What these data do provide is support for the recommendation that people who are with COVID-19 should be distancing themselves, not only from other household members but also from their household pets, so as not to transmit the virus to their pets, particularly to cats or other felines .\" WORLD HEALTH ORGANIZATION WILL HAVE A FURTHER STUDY For this reason, the World Health Organization announced that they are now working with their partners to have a closer look at the study so that they will know the role of cats in this infectious and deadly disease. Maria Van Kerkhove, a WHO epidemiologist, said: \"We don't believe that they are playing a role in transmission, but we think that they may be able to be infected from an infected person .\" Moreover, WHO's top emergency expert <mark>Mike Ryan</mark> is asking people not to retaliate against the animals. He said: \"They're beings in their own right and they deserve to be treated with kindness and respect. They are victims like the rest of us .\" Read a related article: First of Her Kind: Tiger at Bronx Zoo Tests Positive for COVID-19 Tags Cats, COVID-19, new study, COVID-19 infections © 2015 Latin Post. All rights reserved. Do not reproduce without permission."}]