[{"date": "2015-02-22", "url": "http://blackflag.jalopnik.com/alonso-crashes-in-f1-testing-airlifted-to-hospital-wit-1687327778", "content": "<mark>Fernando Alonso</mark> was airlifted to the hospital after crashing his McLaren in preseason testing at Barcelona earlier today. He went off at Circuit de Barcelona-Catalunya's Turn 3, smacking the right side of the car hard. McLaren race director Eric Boullier confirms that he was concussed in the accident. Autoweek reports that <mark>Alonso</mark> \"was conscious and spoke with the doctors\" according to the staff in the medical center at Catalunya, however, it was standard procedure to airlift him to the hospital for a wreck of this nature. <mark>Fernando Alonso</mark> airlifted to hospital following crash during F1 test in Barcelona <mark>Fernando Alonso</mark> airlifted to hospital following crash during F1 test in Barcelona <mark>Fernando Alonso</mark> airlifted to hospital following cr <mark>Fernando Alonso</mark> was taken to the hospital by helicopter after crashing in his McLaren during...Read more Read more According to NBC Sports reporter <mark>Luke Smith</mark>, <mark>Alonso</mark> will remain in the hospital overnight for observation. According to BBC Sport, medical scans found no signs of injury. <mark>Alonso</mark> concussed after test crash <mark>Alonso</mark> concussed after test crash <mark>Alonso</mark> concussed after test crash Read more Read more McLaren officials and the track have not given a reason for <mark>Alonso</mark>'s crash. No one is sure if something broke on the car or driver error was the cause. BBC Sport also reported that Sebastian Vettel had been following <mark>Alonso</mark> at the time and reported that the crash looked bizarre. \"The speed was slow - maybe 150kph [41 mph]. Then he turned right into the wall. It looked strange,\" he told them. #F 1 @ Alon_oficial to stay in hospital following crash during testing @ McLarenF1 @ SkySportsF1 http: //t.co/myZEfY2F10 pic.twitter.com/OaBemLKiBq - Optimum Sports Media (@ optimum_sports) February 22, 2015 Testing resumed at the track after a slight delay following a lunch break. McLaren, however, called it a day. Jenson Button was supposed to test out the car after <mark>Alonso</mark>, but opted not to throw it back together for today.", "articleID": "2015022221_00004950_W", "names": {"Fernando Alonso": ["Q10514", "Q20533356", "Q42393967", "Q42394430", "Q5444582", "Q5859158"], "Luke Smith": ["Q13512824", "Q16233583", "Q16853339", "Q17048712", "Q20713853", "Q22097885", "Q55621442"]}}, {"date": "2015-02-24", "url": "http://uk.reuters.com/article/2015/02/24/uk-mideast-crisis-britain-schoolgirls-idUKKBN0LS22Y20150224?feedType=RSS&feedName=topNews", "content": "British teenage girls Shamima Begun, Amira Abase and Kadiza Sultana (L-R) walk through security at Gatwick airport before they boarded a flight to Turkey on February 17, 2015, in this combination picture made from handout still images taken from CCTV and released by the Metropolitan Police on February 22, 2015. LONDON (Reuters) - British police said on Tuesday they believed that three London schoolgirls who travelled to Turkey and are thought to be trying to join militant Sunni Islamist group Islamic State, have now crossed into Syria. Friends Amira Abase, 15, Shamima Begum, 15, and Kadiza Sultana, 16, flew to Istanbul from London on Feb. 17. \"Officers...leading the investigation into the three missing schoolgirls from east London, now have reason to believe that they are no longer in Turkey and have crossed into Syria,\" police said in a statement. They gave no further details but said they continued to work closely with Turkish authorities on the investigation. The girls' plight has prompted widespread concern in Britain, with Prime Minister <mark>David Cameron</mark> urging social media firms to do more to deal with online extremism, saying the girls appeared to have been radicalised \"in their bedrooms\". He also said airlines needed new systems to vet children travelling alone. The three are friends with a fourth teenage girl from the same school who police believe is already in Syria, having travelled to Turkey in December. Police said their families, who have issued urgent appeals for their daughters to return, have been surprised and devastated by their disappearance. Security forces estimate some 600 British Muslims have travelled to the region to join the conflict there, some of them with Islamic State. Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance Thomson Reuters is the world's largest international multimedia news agency, providing, and interactive television platforms. Thomson Reuters journalists are subject to an", "articleID": "2015022417_00068535_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}}, {"date": "2015-02-25", "url": "http://mashable.com/2015/02/25/power-rangers-film-reaction", "content": "LOS ANGELES - Jason David Frank, who was cast as Tommy Oliver a.k.a. the original Green Ranger for the Power Rangers series in 1993, reacted unfavorably to Tuesday's release of a twisted 14-minute short film based on the Power Rangers franchise. In the POWER/RANGERS film - created and fully funded by prominent music video director <mark>Joseph Kahn</mark> (he recently directed Taylor Swift's \"Blank Space\" video) - James Van Der Beek as Red Ranger Jason interrogates Katee Sackhoff as Pink Ranger Kimberly before Green Ranger Tommy appears to face off against Jason. \"I'm just a PG-13 guy - like the cuss words, the drugs, all this other stuff doesn't fly with me,\" Frank, now 41, said in a reaction video on Facebook (below). \"You can't take a brand like this and reboot it so dark and gritty...you still have the kids who want to watch Power Rangers...we have to be responsible and know this is still a kids brand .\" Though not affiliated with Power Rangers rightsowner Saban Brands, this short film is one of darkest, if not the darkest, adaptations of our colorful defenders of Earth. JASON DAVID FRANK - Official Fan Page. For the uninitiated, the Power Rangers are high school students who are given superpowers to defeat bad guys from destroying Earth. The TV series from 1993 has since catapulted into an international brand fueled by clothes, games, comic books and toys. But <mark>Kahn</mark>'s morbid version, with a cackling twist at the end, puts the Power Rangers in more grown-up situations filled with drugs, murder and mysterious connections. Lionsgate and Saban Brands, which owns the rights to the Mighty Morphin Power Ranger s franchise, plan to \"re-envision\" the fighters of evil for the silver screen in <mark>Kahn</mark> is facing pressure from Saban Brands to take down his short film, which has already been removed from Vimeo. A tamer version (above) remains on YouTube at the time of this writing. \"Y' all better watch the shit out of POWER/RANGERS. No idea how long it'll be up. Going to bed. Goodnight,\" <mark>Kahn</mark> Vimeo took down my NSFW POWER/RANGERS short. Hope you guys downloaded it. The SFW version is still on Youtube: my POWER/RANGERS short you took down is protected under fair/use/free speech/satire. If anyone wants to see it, holla at Everyone is noticing you took down the short but youtube didn't. Tons of fan films exist online. Free speech/fair use. Every image in POWER/RANGERS is original footage. Nothing was pre-existing. There is no copyrighted footage in the short. I am not making any money on it and I refuse to accept any from anyone. It was not even kickstarted, I paid for it myself. This was made to be given away for free. It is just as if I drew a pic of Power Rangers on a napkin and I gave it to my friend. Is it illegal to give pic I drew of a character on a napkin to someone for free? No. . The world is watching your actions right now. If you are going to brand yourself as a place for filmmakers and shorts, then protect. Otherwise, we all go elsewhere. Soon. Saban is trying to shut POWER/RANGERS down. If you'd like to keep watching, tell them to stop harassing me Y' all better watch the shit out of POWER/RANGERS. No idea how long it'll be up. Going to bed. Goodnight. Can't sleep. 1.1 million views on youtube for POWER/RANGERS so far, plus 300k in vimeo views iced hours ago. Holy. Shit. Download POWER/RANGERS if you can. It's free. Take it. Hurry up. 3 million views now. wut wut wut wu t - <mark>Joseph Kahn</mark> (@ JosephKahn) February 25, 2015 Aside from directing Swift's \"Blank Space,\" <mark>Kahn</mark> has helmed music videos for Madonna, Rihanna, Lady Gaga, Britney Spears, Janet Jackson and many more big-name artists. He also directed the films It's Morphin' Time: 10 Things You Didn't Know About Power Rangers 10 Things You May Not Know About The Power Rangers 1. The American writers had to build plot lines around action sequences from the Japanese series. In the early days, English writers had no idea what was going on in the show and built plots around action scenes that were sent to them from the Japanese production. In the 1970s, the Japanese Toei Company produced a television show based on Marvel's Spider-Man comics. 3. Power Rangers were banned until 2011 in New Zealand. In 1994, the New Zealand Broadcasting Standards Authority (BSA) removed the show from the air due to the number of complaints from concerned parents who were thought the show taught kids to solve their problems with violence. 4. The show is heavily edited for Malaysian TV because censors think it will get kids addicted to drugs. Malaysian censors think \"Morphin\" is too close to \"morphine\". Bryan Cranston did some voice acting in the early 90s. 6. The character Tommy Oliver has been six different types of Ranger. The Green Ranger, White Ranger, White Ninja Ranger, Red Zeo Ranger, Red Turbo Ranger and the Black Dino Thunder Ranger. 7. In the original Japanese series, the Yellow Ranger is a man. This is why the Pink Ranger has a skirt and the Yellow Ranger doesn't. 8. The original Black Ranger has only four fingers on one hand. Actor Walter Emanuel Jones lost one of his fingers in a childhood accident. 9. The original Blue Ranger quit the show due to harassment. 10. Power Rangers has been on the air for 20 years. That's 20 action packed seasons and more than 700 episodes. is a leading source for news, information and resources for the Connected Generation. Mashable reports on the importance of digital innovation and how it empowers and inspires people around the world. Mashable's record 42 million unique visitors worldwide and 21 million social media followers are one of the most influential and engaged online communities. Founded in 2005, Mashable is headquartered in New York City with an office in San Francisco.", "articleID": "2015022506_00008121_W", "names": {"Joseph Kahn": ["Q1363428", "Q6284490"]}}, {"date": "2015-02-25", "url": "http://www.yakimaherald.com/news/latestnews/2940457-14/slow-go-without-snow-for-some-valley-businesses", "content": "By Kate Prengaman / Yakima Herald-Republic Although a few inches of snow are expected in the mountains tonight and Thursday, it's likely too little, too late for some Central Washington businesses that depend on winter recreation for customers. \"People are over it. They've already put their snowmobiles away for the season,\" said <mark>Jeff Anderson</mark>, owner of Sportland Yamaha in Cle Elum, which sells and repairs snowmobiles and off-road vehicles. \"It's not generating a lot of business .\" It's been a slow winter for everyone whose sales are tied to snowfall, which is only about a third of normal across the south-central Cascades, and has been limited to high elevations. While some business owners are holding out hope for late-season snowstorms, others are already switching to spring inventory. At Mountain High Sports in Ellensburg, owner Tami Walton said sales of winter clothing and gear were fine in December and January but slowed in February as the snow melted. She said some winter gear is now headed to the sale racks to make room for the spring sporting goods customers already are seeking. \"This year, it seems to be a different season every day, so we have about a 50-50 mix on the floor right now,\" Walton said. \"We did, however, leave the flip-flops in the boxes, but they are tagged and ready to go in case it is 80 degrees tomorrow .\" In Yakima, Sporthaus owner Sig Fossum said he's not planning to discount ski and snowboard gear yet, but he jokes that he does have snow on order. Dedicated skiers are making the best of the springlike conditions on the slopes while rooting for more snow, Fossum said. While the base of White Pass Ski Area looks grim from U.S. Highway 12, skiers report that the less-visible upper slopes have good snow and offer plenty of opportunities. Fossum said he's gotten in some good skiing at White Pass, but the warm weather in the Valley is pushing some of his customers to other sports. \"Business is slow, and we're having more interest in tennis a little bit earlier than usual,\" he said. \"It's quieter this year than last year because our weather down here is even nicer .\" Like other passionate skiers, Fossum is optimistic about the forecast of snow showers in the Cascades over the next few days, as temperatures are expected to range from the high - to low-30s, according to the National Weather Service. In Yakima, highs near 50 and lows in the 30s are expected, with chances of rain Thursday and Friday. Sunshine is expected to return Saturday. For the nonsnow sports enthusiasts, the warmer-than-usual weather has been good news. \"Our spring rush is about a month to six weeks early with this great weather,\" said <mark>Jeff Clark</mark>, co-owner of Revolution Cycles in Yakima. \"What I'm hearing is that people are tired of waiting for snow, so they are getting their bikes out. It's great for us .\" And the recent sunshine has inspired some gardeners to get an early start, said Lisa Lacour at Ace Hardware in Yakima. But she's been reminding people it's still February, too soon to plant much beyond the most cold-tolerant species. The springlike weather also allowed <mark>Anderson</mark>, the Cle Elum store owner, to sell a couple off-road vehicles last weekend, which he called highly unusual for February. But the sales this season didn't balance out the lack of interest in snowmobile gear and repairs caused by so few people riding. \"It's not what I like, but we're on to another season here pretty soon,\" <mark>Anderson</mark> said. His business has endured ups and downs with the weather before, he added. The lack of snow to entice snowmobilers also is affecting the bottom line at Whistlin' Jack Lodge, a popular home base for people who enjoy winter weekends in the Chinook Pass area, according to employee <mark>Scott Carlson</mark>. \"It's definitely hurting business,\" <mark>Carlson</mark> said. \"We are getting more hikers already, and people are already coming over and asking about fishing. But it's definitely not making up the difference .\" <mark>Carlson</mark> said that beyond the lost winter tourism, as a volunteer firefighter, he's also worried about the increased risk of wildfires this spring. \"We're already getting stuff prepared for the fire season,\" he said. \"It's going to be a bad fire season after having no snow like this .\" The long-term forecast calls for warm and dry conditions to continue for the next few months. Although, there's still a chance for a few more snowstorms, too. If serious snow arrives, local businesses will be ready to outfit customers.", "articleID": "2015022610_00035234_W", "names": {"Jeff Anderson": ["Q1140895", "Q26899394", "Q29167254", "Q50239827", "Q6173216", "Q6173217"], "Jeff Clark": ["Q1686278", "Q27057573", "Q6173576"], "Scott Carlson": ["Q3952821", "Q50278901"]}}, {"date": "2015-02-27", "url": "http://cbs19.tv/story/28215160/east-texas-family-fights-for-medical-marijuana", "content": "meta content = \"2015-02-26 14:07:49\" > Web Exclusive: KFC & Seattle's Best Coffee introduce a coffee cup you can eat Now you can have your coffee and eat the cup it comes in, too. KFC is teaming with Seattle's Best Coffee to create the Scoffee cup. Now you can have your coffee and eat the cup it comes in, too. KFC is teaming with Seattle's Best Coffee to create the Scoffee cup. meta content = \"2015-02-25 14:58:35\" > Web Exclusive: Vanilla Ice back in the spotlight for \"act of kindness\" after arrest Web Exclusive: Vanilla Ice back in the spotlight for \"act of kindness\" after arrest Just days after his high profile arrest Vanilla Ice is back in the spotlight, but this time in a gesture of kindness to one family. He helped install a swimming pool and hope for a five year old Florida boy and his family still hurting from a deadly car wreck. Just days after his high profile arrest Vanilla Ice is back in the spotlight, but this time in a gesture of kindness to one family. He helped install a swimming pool and hope for a five year old Florida boy and his family still hurting from a deadly car wreck. meta content = \"2015-02-24 13:59:26\" > Web Exclusive: Mobile payment wars heating up between Apple & Google The mobile payment war between Apple Pay and Google Wallet is heating up. Google says A-T & T, Verizon Wireless and T-Mobile will pre-install its Google wallet payments app on all android phones sold by the carriers this year. The mobile payment war between Apple Pay and Google Wallet is heating up. Google says A-T & T, Verizon Wireless and T-Mobile will pre-install its Google wallet payments app on all android phones sold by the carriers this year. meta content = \"2015-02-23 15:15:28\" > Web Exclusive: Fashion hits and misses from the Academy Awards Red Carpet Bold colors, big necklaces, and metallics ruled the red carpet at last night Academy Awards. There were some hits and misses from Hollywood's biggest night. Bold colors, big necklaces, and metallics ruled the red carpet at last night Academy Awards. There were some hits and misses from Hollywood's biggest night. meta content = \"2015-02-20 14:18:04\" > Web Exclusive: \"Houslet' could be a solution to housing crisis A solution to the Bay Area's housing crisis could be inside a man's garage. His vision requires only 64 square feet of living space. A solution to the Bay Area's housing crisis could be inside a man's garage. His vision requires only 64 square feet of living space. meta content =\" 2015-02-19 13:53:15 \"> Web Exclusive: New Dr. Seuss book hitting shelves soon Big news for fans of Dr. Seuss. More than 20 years after his death, Random House says it's publishing a recently discovered manuscript by the children's book author this summer Big news for fans of Dr. Seuss. More than 20 years after his death, Random House says it's publishing a recently discovered manuscript by the children's book author this summer meta content =\" 2015-02-18 14:37:14 \"> Web Exclusive: Man buys $5.99 watch at thrift store worth $35,000 Web Exclusive: Man buys $5.99 watch at thrift store worth $35,000 A Phoenix man found quite the thrift store treasure. He bought a watch at Goodwill for about $6. Then, he turned around and sold it for $35,000. A Phoenix man found quite the thrift store treasure. He bought a watch at Goodwill for about $6. Then, he turned around and sold it for $35,000. meta content =\" 2015-02-17 14:05:44 \"> Web Exclusive: Gas prices still climbing, but cheaper than a year ago Gas prices continue to climb this week. Triple-A says prices shot up 7 cents last week. Gas prices continue to climb this week. Triple-A says prices shot up 7 cents last week. meta content =\" 2015-02-16 14:07:42 \"> Web Exclusive: Bar Stool Races are an extreme event for the less serious crowd With all the extreme winter sports for serious athletes, a town in central Minnesota is offering an extreme competition for the less serious crowd. The Bar Stool Races in Ironton feature downhill events that are fueled in part by beer. With all the extreme winter sports for serious athletes, a town in central Minnesota is offering an extreme competition for the less serious crowd. The Bar Stool Races in Ironton feature downhill events that are fueled in part by beer. meta content =\" 2015-02-13 14:24:25 \"> Web Exclusive: Valentines to marry in the Big Apple We are just hours away from Valentine's Day, so if want to say\" I do \"overlooking the Big Apple, you better hurry. Valentine's Day is the only day of the year the empire state building allows weddings We are just hours away from Valentine's Day, so if want to say\" I do \"overlooking the Big Apple, you better hurry. TROUP (KYTX)--As more and more parents turn to medical marijuana in Colorado to treat their children's debilitating epilepsy, one East Texas family is fighting for a bill that would legalize it here at home. Eight-year-old Jacob Bingham suffers from multiple seizures a day, and his parents are worried medical marijuana may be his only hope. Jacob isn't like most 8-year-olds. He can't talk, ride a bike, eat on his own, or even play with his twin brother .\" He's so worn out from the seizures and from all the drugs that he just doesn't have an interest in much of anything. He just lays around, \"his mother Marcy Bingham said .\" It's hard to live through every day, \"Jacob's brother Jarod said .\" At first the day can just start out as a typical day, and then it all turns into a horrible day if Jacob starts to seize. \"Jacob suffers from Dravet Syndrome, a rare disorder that causes him to have violent and uncontrollable seizures--sometimes dozens a day .\" You can't live a normal life, \"Marcy Bingham said .\" You don't take vacations, you can't leave him with people. Even the nurses at times are uncomfortable with him because he seizes so much. \"The Binghams spent Wednesday in Austin meeting with senators in support of two bills that would legalize cannabis-based oils as a medical treatment for children with severe epilepsy. Senate Bill 339 and House Bill 892 would regulate the growth and dispensation of cannabis-based oils in Texas .\" It's amazing some of the stories we have seen and heard as to how it's helped children similar to our son, \"Jacob's father Dirk Bingham said. Children like 9-year-old Charlotte Figi of Colorado, whose parents credit cannabis-oil for relieving their daughter's constant seizures. The problem the Binghams face is that even if Jacob can get a prescription for the drug in Colorado, he can't legally use it here in Texas .\" We would like that opportunity too, and not worry about being prosecuted if he used it and not having to move to Colorado, \"Marcy Bingham said .\" We both have jobs, we have family here, we've lived here all our lives and we don't want to leave, \"Dirk Bingham said .\" But it may come to that. \"The controversial oil comes from the marijuana plant but it's low in THC and rich in cannabidiol, or CBD, and the Binghams say it's Jacob's last hope .\" If we hadn't tried everything, we wouldn't want to put our child on this, \"Marcy Bingham said .\" But we have tried everything, and there are no more drugs for him. The doctor has told us. \"Right now, Jacob takes up to six pills a day--pills that cause life-threatening side effects .\" He could stop breathing, his heart could stop, his brain could stop and that's it, \"Marcy Bingham said. The Binghams' hope is that Jacob will one day be able to live a normal life .\" Just to say \"mama,' if he could even do that,\" Marcy Bingham said. \"If he could play with his brother. And that's what he says, he has no one to play with. He's an only child basically .\" \"I just want him to at least say just a few words. I just want him to say,' I love you' or something,\" Jarod Bingham said. meta content = \"2015-02-26 17:54:45\" > <mark>Peterson</mark> to be reinstated after judge overturns suspension A Minnesota judge has sided with the NFLPA in its case vs. the NFL over <mark>Adrian Peterson</mark>'s suspension, CBS Sports NFL Insider Jason La Canfora has confirmed. A Minnesota judge has sided with the NFLPA in its case vs. the NFL over <mark>Adrian Peterson</mark>'s suspension, CBS Sports NFL Insider Jason La Canfora has confirmed. meta content = \"2015-02-26 20:30:36\" > Supreme Court: Texans, others may lose fed health insurance help Millions of Americans have a big personal stake in next Wednesday's Supreme Court challenge to the nation's health care law: Can they legally continue to get subsidies to help pay for their insurance? Millions of Americans have a big personal stake in next Wednesday's Supreme Court challenge to the nation's health care law: Can they legally continue to get subsidies to help pay for their insurance? TYLER (KYTX)--A border collie tossed off a bridge and left for dead has survived and has just been adopted, but now her unborn puppies need homes. TYLER (KYTX)--A border collie tossed off a bridge and left for dead has survived and has just been adopted, but now her unborn puppies need homes. meta content = \"2015-02-27 00:46:33\" > East Texas family fights for medical marijuana TROUP (KYTX)--As more and more parents turn to medical marijuana in Colorado to treat their children's debilitating epilepsy, one East Texas family is fighting for a bill that would legalize it here at home. TROUP (KYTX)--As more and more parents turn to medical marijuana in Colorado to treat their children's debilitating epilepsy, one East Texas family is fighting for a bill that would legalize it here at home. meta content = \"2015-02-26 21:30:41\" > Longview sanitation catching up after weather delays Due to the inclement weather this week, the City of Longview Sanitation Division has revised the collection schedule for the remainder of the week of February 23-27. CBS19, MYTX & KCEB 2211 ESE Loop 323", "articleID": "2015022701_00017792_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"]}}, {"date": "2015-03-02", "url": "http://tucsonnewsnow.com/story/28231183/kerry-tries-to-dampen-fuss-over-israeli-pms-speech", "content": "<mark>Kerry</mark> tries to dampen fuss over Israeli PM's speech (AP Photo/Marc Sellem, Pool). Israeli Prime Minister Benjamin Netanyahu looks on before praying at the Western Wall, the holiest site where Jews can pray, in Jerusalem's Old City, Saturday Feb. 28, 2015. By BRADLEY KLAPPER Associated Press WASHINGTON (AP) - Secretary of State <mark>John Kerry</mark> on Sunday tried to calm tensions with Israel before Prime Minister Benjamin Netanyahu's congressional address, yet insisted the Obama administration's diplomatic record with Iran entitles the U.S. to \"the benefit of the doubt\" as negotiators work toward a long-term nuclear deal. On a mission to warn of the dangers of a nuclear-armed Iran, the prime minister arrived in Washington for the speech the White House didn't want him to give. <mark>Kerry</mark> said in an interview broadcast before he arrived in Switzerland for talks with Iran's foreign minister that Netanyahu was welcome to speak in the U.S. and that the administration did not want the event \"turned into some great political football .\" That sentiment was a step back from some of the sharp rhetoric between the allies in recent weeks, and <mark>Kerry</mark> mentioned that he talked to Netanyahu as recently as Saturday. But <mark>Kerry</mark> stressed that Israel was safer as a result of the short-term nuclear pact that world powers and Iran reached in late 2013, and he described that improvement as the \"standard we will apply to any agreement\" with the Islamic Republic. Officials have described the United States, Europe, Russia and China as considering a compromise that would see Iran's nuclear activities severely curtailed for at least a decade, with the restrictions and U.S. and Western economic penalties eased in the final years of a deal. \"We are going to test whether or not diplomacy can prevent this weapon from being created, so you don't have to turn to additional measures including the possibility of a military confrontation,\" <mark>Kerry</mark> told ABC's \"This Week .\" \"Our hope is that diplomacy can work. And I believe, given our success of the interim agreement, we deserve the benefit of the doubt to find out whether or not we can get a similarly good agreement with respect to the future .\" Netanyahu will press his opposition to a diplomatic accommodation of Iran's program in his speech Tuesday to Congress. \"We are not here to offend President Obama whom we respect very much,\" said a Netanyahu adviser, who was not authorized to be identified. \"The prime minister is here to warn, in front of any stage possible, the dangers\" of the agreement that may be taking shape. The adviser, who spoke shortly before the delegation touched down in Washington, said Israel was well aware of the details of the emerging nuclear deal and they included Western compromises that were dangerous for Israel. Still, he tried to lower tensions by saying that Israel \"does not oppose every deal\" and was merely doing its best to warn the U.S. of the risks entailed in the current one. The invitation to speak to Congress extended by House Speaker John Boehner, R-Ohio, and Netanyahu's acceptance have caused an uproar that has exposed tensions between Israel and the U.S., its most important ally. By consenting to speak, Netanyahu angered the White House, which was not consulted in advance, and Democrats, who were forced to choose between showing support for Israel and backing the president. \"I will do everything in my ability to secure our future,\" Netanyahu said before flying to Washington. Boehner said Iran's nuclear ambitions were a threat well beyond the region. \"We're not going to resolve this issue by sticking our heads in the sand,\" Boehner told CBS' \"Face the Nation .\" He said Netanyahu \"can talk about this threat, I believe, better than anyone. And the United States Congress wants to hear from him, and so do the American people .\" The congressional speech also has sparked criticism in Israel, where Netanyahu is seeking re-election on March 17. He also planned to speak Monday at the annual conference of the pro-Israel lobby AIPAC. Netanyahu considers unacceptable any deal that does not entirely end Iran's nuclear program. But President Barack Obama is willing to leave some nuclear activity intact, backed by safeguards that Iran is not trying to develop a weapon. Iran insists its program is solely for peaceful energy and medical research. The dispute has become more personal of late. Last week, Obama's national security adviser, <mark>Susan Rice</mark>, described the timing and partisan manner of Netanyahu's visit as \"destructive\" for the U.S.-Israeli relationship. On Sunday, <mark>Kerry</mark> painted a more positive picture of continued close cooperation. He said the U.S.-Israeli security partnership was closer than at any point before, and noted the large investment of American money in the Jewish state's Iron Dome missile defense system. He said the U.S. government has \"intervened on Israel's behalf in the last two years a couple of hundred\" times in more than 75 forums \"in order to protect Israel .\" <mark>Kerry</mark> plans to make precisely that point when he addresses the U.N. Human Rights Council on Monday in Geneva. U.S. officials have often accused the council of being biased against Israel and inappropriately focused on the Jewish state. Officials traveling with <mark>Kerry</mark> said he would urge the council to take a more balanced approach. Associated Press writer Aron Heller contributed to this report. Lights, camera, blossom! Disney films inspire floral fantasy Lights, camera, blossom! Disney and Pixar films inspire exhibits at Philadelphia Flower Show Lights, camera, blossom! Disney and Pixar films inspire exhibits at Philadelphia Flower Show Graceland brings Elvis back to his Las Vegas home Graceland brings Elvis back to his Las Vegas home with exhibits, shows at Westgate Las Vegas Graceland brings Elvis back to his Las Vegas home with exhibits, shows at Westgate Las Vegas AP: Trayvon Martin's mother says killer got away with murder AP interview: Trayvon Martin's mother says Justice Department let killer get away with murder AP interview: Trayvon Martin's mother says Justice Department let killer get away with murder 3 nabbed in NY, Florida in plot to join Islamic State group 3 arrested in NYC, Florida on charges they plotted to go to Syria to join Islamic State group 3 arrested in NYC, Florida on charges they plotted to go to Syria to join Islamic State group Texas attorney general argues gay couple's marriage is void Texas attorney general argues marriage license of gay couple allowed to wed is void meta content = \"2015-03-01 16:25:08\" > Obama invoking civil rights struggles past and present For President Barack Obama, it's a week to invoke America's civil rights struggles from past to present. For President Barack Obama, it's a week to invoke America's civil rights struggles from past to present. meta content = \"2015-03-01 16:35:03\" > Newspaper: Nurse who survived Ebola says hospital failed her Newspaper: Nurse who survived Ebola says hospital failed her A 26-year-old nurse said in a newspaper interview that a hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed...A 26-year-old nurse said in a newspaper interview that a hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the...meta content = \"2015-03-01 18:15:12\" > Brrr! February brought record cold, snow to Northeast February 2015 was one for the record books in the Northeast - the coldest month ever for four cities in New York and the snowiest ever for Boston. Hardy souls who shivered and shoveled their way through February in the Northeast now have evidence of just how brutal the weather was, with record cold in at least eight cities and record snowfall in Boston. meta content = \"2015-03-01 09:04:52\" > New round of snow could push Boston to season record Parts of California were getting a welcome dose of rain and snow from a storm system moving through the state, while late-winter weather dumped snow elsewhere in the Southwest. After cold and snow that set February records, southern New England is entering March with another round that could push Boston over its 20-year-old snowfall record. meta content = \"2015-03-01 17:15:11\" > Sale will secure future for shelter for asylum-seekers The list goes up on the lobby bulletin board of Vive La Casa and the refugees who've come from their rooms tentatively approach and scan for their names. The lucky ones will take a taxi to Canada the next day ...", "articleID": "2015030200_00020550_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "Susan Rice": ["Q23848423", "Q50612"]}}]