[{"articleID": "2014061817_00054060_W", "names": {"Michael Schumacher": ["Q1929281", "Q19707089", "Q9671"]}, "date": "2014-06-18", "url": "http://www.channelnewsasia.com/news/world/schumacher-was-awake-for/1174538.html", "content": "Seven-time F1 world champion <mark>Michael Schumacher</mark>. (AFP/File/Giuseppe Cacace) GENEVA: Formula One champion <mark>Michael Schumacher</mark> was conscious and had his eyes open during his top-secret transfer from a French hospital to a facility in Switzerland, Swiss newspaper Blick reported. <mark>Schumacher</mark> was moved on Monday after emerging from a coma following his devastating ski accident in December. The paper said he had his eyes open for most of the journey by private ambulance, which was conducted like a secret service operation. <mark>Schumacher</mark> did not speak, but he communicated by nodding his head during the 200-kilometre (125-mile) journey, the paper said. The ambulance company was not told the identity of its world-famous passenger in advance, and staff had to give up their mobile phones when they came into contact with him. The paper said <mark>Schumacher</mark> had lost a lot of weight during his 170 days in hospital in the French city of Grenoble. It tracked down the Swiss ambulance company, whose head Mathias Volken confirmed its involvement, but refused to give further details. The seven-time world champion's spokeswoman Sabine Kehm on Monday thanked the doctors in Grenoble and asked for \"understanding that his further rehabilitation will take place away from the public eye\" . The hospital where he is now being treated is one of Switzerland's best and has renowned neurology experts. It is in the city of Lausanne, near where <mark>Schumacher</mark>'s wife Corinna and their two children live."}, {"articleID": "2012012020_00033092_W", "names": {"Roberto Hernandez": ["Q23007616", "Q281165", "Q3436912", "Q5842291", "Q943228"]}, "date": "2012-01-20", "url": "http://mlb.mlb.com/news/article.jsp?ymd=20120120&content_id=26406978&vkey=news_mlb&c_id=mlb&partnerId=rss_mlb", "content": "cleveland--the indians pitcher known to date as fausto carmona has been released from jail on bail in the dominican republic, but it is unclear how long it might be before he is able to return to the united states. the assocated press reported that carmona was released on friday after his arrest one day earlier for using a false identity. it has been reported that the pitcher's actual name is <mark>roberto hernandez</mark> heredia. carmona was arrested on thursday outside the united states consulate in santo domingo while on his way to apply for a visa so he can travel to arizona for spring training. the indians are currently working to gather more information to determine their next step in response to the situation. according to the ap report, carmona was released by judge keyla perez on bail of around $13,000. carmona was then instructed to check in with prosecutors as dominican authorities continue to investigate the matter. one allegation is that carmona is actually 31 years old, not 28, as he has claimed. the pitcher offered a brief statement as he exited the court friday. \"i ask for the forgiveness of my fans, the government of the united states and the cleveland indians for this situation,\" he was quoted as saying. the indians have yet to issue public comments beyond a statement issued by general manager chris antonetti on thursday. \"we were recently made aware of the situation that occurred [thursday] in the dominican republic,\" antonetti said, \"and are currently in the process of gathering information. we are not prepared to make any additional comment at this time.\" the pitcher's agent, bean stringfellow, has yet to return messages left by mlb.com. agent jay alou, who works for the same agency, told the associated press on thursday that the pitcher's representatives were stunned by the news. \"this took us by complete surprise,\" alou was quoted as saying. \"what we have to do now is wait to find out the process that has to be done with the consulate with this new identity in order to see if he can get a new work visa.\" one possible approach for cleveland would be to place carmona (under contract for $7 million in 2012) on major league baseball's restricted list. players on the restricted list do not count towards a team's 25-man or 40-man roster, do not receive pay and are not permitted to sign with another club. that was the route the marlins took when dealing with a similar situation. in september, the pitcher formerly known as leo nunez was forced to return to the dominican republic after it was discovered that he was playing under an assumed name. his real name is juan carlos oviedo and he admitted to using false documents in order to sign a professional contract. oviedo remains on the restricted list and the pitcher is still sorting through visa issues, even though he has cooperated with investigators. the marlins signed oviedo to a $6 million contract to avoid arbitration on tuesday, but the club does not have to pay the pitcher until he is back in the united states and off the restricted list. right now, it is not known if the indians would simply be able to void carmona's contract, or if the club would go down that route if allowed. it is also not clear how carmona's predicament might impact his availability for spring training (pitchers and catchers are scheduled to report on feb. 19) or the regular season. carmona's birth date has been listed as dec. 7, 1983, which would have made him 17 years old when he signed with the indians as a non-drafted free agent in 2000. it is possible that carmona was actually as old as 20 when he first pitched in cleveland's farm system. the right-handed sinkerballer broke in with the indians as a reliever in 2006, and he finished fourth in the american league cy young balloting after going 19-8 with a 3.06 era in the 2007 campaign. he's been erratic over the last few seasons, notching a 33-48 record and a 5.01 era in 111 starts between 2008 and 2011. last season, the pitcher went 7-15 with a 5.25 era in 32 starts after beginning the year as the indians' opening day starter. heading into the 2012 season, he projected to work within the nos. 3-5 slots in the rotation. the indians hold club options on his contract for 2013 and 2014. @ mlbastian. this story was not subject to the approval of major league baseball or its clubs .? 2001 - mlb advanced media, l.p. all rights reserved."}, {"articleID": "2014121218_00058086_W", "names": {"Joshua Wong": ["Q12688635", "Q56320576", "Q9455382"]}, "date": "2014-12-12", "url": "http://news.bbc.co.uk/news/world-asia-30445930", "content": "Some say Xi Jinping has won in Hong Kong. I doubt if that's how he sees it. As he watches pictures of traffic flowing through the heart of Admiralty today, he will certainly feel relieved that he didn't lose. But he is fighting a multi-level multi-player game. He has merely survived a level. This is not to say he didn't play adroitly. By leaving the protests to burn out amidst their own divisions and the weariness of the wider Hong Kong public, he deprived the umbrella movement of the oxygen of repression and demonstrated that Beijing's tool kit for dealing with citizen defiance runs beyond tanks or truncheons. What's more, he made no concessions. The lesson that Beijing does not bow to pressure was delivered not just to Hong Kong but to the world. But the only real victory Beijing can claim in the entire episode is not in Hong Kong but at home on the mainland where, barring a few brave souls who raised their voices on behalf of Hong Kong democracy, little stirred. The main thoroughfare in Admiralty is now open to traffic, with hardly any traces of the protest camp This is an important victory for the propaganda machine, which successfully presented the protesters as a mix of spoilt children narrowly pursuing their own interests at the expense of the public good, and cunning enemies of the state in league with foreign forces. \"Any person who cares about Hong Kong and about the people of Hong Kong should say\" NO' to this hijacking of the general public will for personal objectives, \"said the Communist Party flagship newspaper, the People's Daily. Champions of democracy everywhere take note - the aspirations of the young protesters of Hong Kong did not immediately resonate with their counterparts on the mainland. Despite being beneficiaries of globalisation and despite having ever greater contact with the West through university education and holidays abroad, many young Chinese are suspicious of idealistic political messages. Since childhood, they have been exposed to a historical narrative which dwells on China's humiliation at the hands of foreigners. Many now echo their government's suspicion of street protests, social chaos and foreign ideas peddled by people whose hidden agenda may be to divide China and keep it down. According to China's best known military theorist, Sun Tzu (writing two-and-a-half thousand years ago), the best kind of victory is won without fighting. Seeing the mainland stable throughout two-and-a-half months of street protest in Hong Kong is just such a victory. But provoking thousands of citizens onto the streets in the first place is, by the same token, no kind of victory at all. Beijing brought the umbrella movement on itself. Protesters have vowed to continue with their campaign With its white paper in June and electoral arrangements in August, it made clear that it would not only draw up a narrower political board game in Hong Kong but control the pieces too. Hong Kong citizens were already resentful of the scale of mainland tourism and immigration, and the young alienated by a growing list of frustrations including impossible property prices. In this combustible mix, Beijing's announcements were the proverbial sparks that lit the prairie fire. Sun Tzu would have called this self-inflicted injury. The electoral arrangements were intended to avoid future challenges from an elected Hong Kong leader. But instead they provoked a very present challenge from at least 100,000 citizens. For a government which likes to reinforce the impression that it is in charge of not just the staging but the script, Hong Kong was an uncomfortable discovery that the props can get up and misbehave. Ever since Chairman Mao's ideological experiments resulted in the deaths of countless millions in the 1950s and 1960s, China's Communist leaders have insisted that they believe in\" seeking truth from facts \". The sobering fact in relation to the Umbrella Movement is that a generation of young people in Hong Kong is increasingly politicised and alienated from China. With their demand for democratic rights, the members of the umbrella movement effectively rebranded themselves\" not China \". Alex Chow (L) and <mark>Joshua Wong</mark> (R) are two prominent Hong Kong student leaders who have led the protests The same is true in Taiwan. Despite all of Beijing's efforts to coax the island towards reunification, the message from recent local elections as well as from the Sunflower Movement in the spring is that the Taiwanese public and especially its young people, are moving in the opposite direction. Far from assimilating easily to an increasingly wealthy China, Hong Kong and Taiwan are growing more defiant. And adding to the list of troublesome peripheries whose citizens can't be trusted to behave like true Chinese patriots, let's not forget Xinjiang. So while Xi Jinping will go on talking up his China Dream and urging the young people of China to unite behind it, he must have realised by now that his message is struggling with key audiences. Hong Kong has seen a generation of young people devote energy, passion and sacrifice into a competing dream. These are people he needs on his side. Xi Jinping may not have lost in Hong Kong, but he needs to do much, much more if he is going to win. For weeks there was a life-size cardboard cut-out of President Xi amid the tent city of the Umbrella Movement, holding aloft the obligatory yellow umbrella. It's a shame he didn't visit. 2 Minutes ago Do the Chinese close down their comment sections at six. Unless they are in advertising territory of course?\" If he (Xi) starts trying to assimilate Hong Kong into his Chinese Dream then I can imagine an even larger protest emerging \"--That should have him quaking! Hit China financially and things could change. But too many vested interests around the world will not allow that to happen. While whitey is getting rich, nothing will change...it's the way of the world. China will do what China wants, Russia will do what Russia wants, Israel will do what Israel wants. The rest of the world will keep huffing and puffing yes, democracy...based on campaign funds, advertising, propaganda, media access, cover-ups, historical omissions, compromise, social upbringing, vested interest, xenophobia, jingoism, idealism etc.. Hitler, Abe, Bush & Blair were democratically elected. Turks & Japanese still deny their crimes against humanity. Hong Kong activists without financial commitments will learn realpolitik soon enough. Those business leaders in the west who put short term profits before people will breath a sigh of relief.\" You cannot keep a people down indefinitely. \"Of all people it was Margaret Thatcher who said that! Jihad money How extremists fund their fight through crime NHS Winter 2014 See how your nearest A & E unit is coping with winter pressures 7 days quiz Why did someone say nasty things about Angelina Jolie? 5: The female football mania that led to it being banned 1: Flights disrupted after computer failure at UK control centre 2: Live: UK Flight delays after computer failure 3: Farage and Brand trade post Question Time insults 5: Man faces deportation as UK wife's salary too low 6: Pensioner bonds to offer returns of 2.8% and 4% 7: Parents angered by\" awful' Frozen party in Kilgetty"}, {"articleID": "2019020820_00498107_W", "names": {"James Avery": ["Q3608171", "Q48240545", "Q493077", "Q825454"]}, "date": "2019-02-08", "url": "http://mysanantonio.com/news/us/article/Going-green-States-would-get-free-hand-under-pot-13601542.php", "content": "Text \"NEWS' to 77453 for Alerts San Antonio judge lowers bail for King Jay's grandmother NWS gives warning as heavy sleet showers move across S.A. Daughter: S.A. man accused wife of affair before slaying Multi-vehicle crash in S.A. shuts down lanes on I-35 https: //www.mysanantonio.com/news/us/article/Going-green-States-would-get-free-hand-under-pot-13601542.php Going green: States would get free hand under pot bill Michael R. Blood, Associated Press Updated 1:59 pm CST, Friday, February 8, 2019 FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free hand to allow legal marijuana markets without the threat of federal criminal intervention. less FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free...more Photo: Don Ryan, AP Photo: Don Ryan, AP Image 1 of / 3 Caption Close Image 1 of 3 FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free hand to allow legal marijuana markets without the threat of federal criminal intervention. less FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free...more Photo: Don Ryan, AP Going green: States would get free hand under pot bill 1 / 3 Back to Gallery Oregon Sen. Ron Wyden proposed legislation Friday that would give states a free hand to allow legal cannabis markets without the threat of federal criminal intervention, a move that marked the latest push in Congress to bolster the nation's burgeoning pot industry. The proposal, identical to a bill in the House, aims to ease the longstanding conflict between states where cannabis is legal in some form and the U.S. government, which categorizes marijuana as a dangerous illegal drug, similar to LSD or heroin.\" The federal prohibition of marijuana is wrong, plain and simple, \"Wyden, a Democrat, said in a statement.\" Too many lives have been wasted, and too many economic opportunities have been missed. \"Most Americans live in states where pot can be legally purchased for medical or recreational use, and the move to loosen federal restrictions on marijuana came as the issue has played into the emerging 2020 presidential campaign. A similar proposal previously languished in Congress. But Rep. Earl Blumenauer, an Oregon Democrat carrying the current bill in the House, said voters have\" elected the most pro-cannabis Congress in American history. \"The proposal would remove federal criminal penalties for individuals and businesses acting in compliance with state marijuana laws. It would also reduce barriers for legal marijuana businesses to get access to banking. A separate bill would impose a tax on marijuana products similar to federal excise taxes on alcohol, while another would allow state-legal marijuana businesses to claim tax deductions and credits. Justin Strekal, political director of the pro-legalization group NORML, said in a statement that the proposal is another sign of the\" growing public support for ending our failed war on cannabis consumers. \"Sign up for instant alerts from MySA by texting NEWS to 77453. Most Popular 1 Two Texas cities named among 50 worst areas to live in 2 Graphic crime scene photos show aftermath of gun battle outside strip club involving SAPD officer 3 Fried chicken, tacos planned for San Antonio retail development opening this summer 4 Photos: Viral S.A. bar goes up in flames 5 Thieves hit <mark>James Avery</mark> store, nab jewelry in less than 5 minutes 6 Fiesta Oyster Bake announces 2019 Tejano stage lineup 7 Buyer found for San Antonio's troubled Cowboys Dancehall 8 SAPD: Suspect in double homicide home invasion captured 9 Ikea having\" tons of giveaways' at grand opening in Live Oak 10 Big show coming to S.A. 11 Woman assaulted by 3 suspects, including 14-year-old, police say 12 S.A. eatery known for its massive menu closes after 23 years 13 S.A. singer explains \"goodbye' in long, emotional post 14 Friendly Spot named best restaurant for beer in Texas 15 Canada prosecutor: Serial killer staged photos of victims View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2015111717_00060986_W", "names": {"Glenn Miller": ["Q5568999", "Q57433120"]}, "date": "2015-11-17", "url": "http://rgj.com/story/news/education/2015/11/17/unr-military-interested-using-gumweed-jet-fuel/75928328/", "content": "<mark>Glenn Miller</mark> and Bishnu Neupane hold the final biofuel product based on the gumweed plant. The fluids in the tubes have been diluted at different levels and are being examined in the labs at the Applied Research Facility at the University of Nevada, Reno main campus. (Photo: Courtesy of Whip Villarreal) CONNECT TWEET LINKEDIN COMMENTEMAILMORE A University of Nevada, Reno professor is leading the way on converting a native roadside weed into fuel that could help the military. Glen Miller has been working to convert gumweed into a biofuel, which could be used as jet fuel for the military, UNR officials said in a news release on Monday. \"We are looking at breaking it down because it uses less water and it's already acclimated to Nevada conditions,\" Miller said in a statement. \"It would be beneficial generating this arid-land crop because it doesn't compete with food or animal feed.\" The primary resource for diesel fuel is soy beans and ethanol for corn which are always in direct competition with food. \"The final biofuel product could produce up to 122 gallons per acre on a biennial basis, attracting the U.S. Navy's interested in using it as jet fuel, Miller said in the news release.\" ...Gumweed is native in Nevada and grows on the side of freeways and, more importantly, is an arid land crop that requires less water than other substitutes like alfalfa, \"Miller said in the statement.\" Alfalfa takes five feet of water to grow while gumweed uses no more than a foot of water. \"Gumweed was planted at the UNR's Valley Road Field Laboratory and the Main Station Field Laboratory. After it grew and was harvested, it was broken down to a liquid that smells like tar, UNR officials said. The project received $500,000 in grant funding from the United States Department of Agriculture. It has the potential to supply up to 20 percent of fuel demand for the military, UNR officials said. Hongfei Lin is a professor of chemical and materials engineering, who is working with Miller on the project.\" It is estimated that if even 10 percent of sagebrush-covered lands in Nevada are used to grow gumweed for aviation biofuels, 400 to 600 million gallons per year of jet biofuels could be produced \", Lin, a College of Engineering collaborator, said in the news release.\" That's definitely incredible. There's lots of potential. \"Marcella Corona covers breaking news for the Reno Gazette-Journal. Contact her at 775-788-6340, online at mcorona @ rgj.com or follow her on Twitter at @ Marcella_Anahi or on Facebook at Facebook.com / Marcella.Anahi CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //on.rgj.com/1j5I0Bu"}, {"articleID": "2013030520_00032946_W", "names": {"John Carter": ["Q11035229", "Q1699559", "Q1699561", "Q21460725", "Q23970556", "Q369814", "Q4778991", "Q56281899", "Q6225346", "Q6225351", "Q6225353", "Q6225358"]}, "date": "2013-03-05", "url": "http://businessinsider.com/jack-the-giant-slayer-box-office-slump-2013-3", "content": "here's why everyone's going crazy about facebook's news feed-and why it will never stop here's why everyone's going crazy about facebook's news feed-and why it will never stop how alex day became the biggest unsigned singer in the world, without touring it only took 10 months for these guys to make more than $10 million a vanity fair profile of bill ackman is coming out tomorrow and trust us you're going to want to read it a vanity fair profile of bill ackman is coming out tomorrow and trust us you're going to want to read it why john boehner might be right to blame obama for the sequester why john boehner might be right to blame obama for the sequester email sent! you have successfully emailed the post. jack the giant slayer \"was the latest high-budget film to bomb opening weekend. in what has been a six-week slump to the start of year, warner bros. fairytale-inspired film earned jack's tumble from the box-office beanstalk shouldn't come as much of a surprise. the film not only changed its title months before opening, but also underwent changes in director and multiple delays ahead of its march release. here's five other factors that contributed to the downfall of\" jack the giant slayer \": however, the studio opted for a more family-friendly name after the film was pushed back last year (more on that in a minute). as a result, the film seems to have suffered from much of the same demographic issue as dreamworks animation's recent\" based off a children's nursery tale, the idea of seeing a reimagined \"jack and the beanstalk\" may have seemed too childish for older audiences. at the same time, the film may have come across too scary for young children with the word \"slayer\" or \"killer\" in the title. bryan singer came on as the second director for \"jack,\" overseeing an entire overhaul in the script. in january 2009, d.j. caruso (\"disturbia,\" \"eagle eye\" ) was bryan singer (\"x-men: days of future past\" ) became attached to the film as director instead. when he signed on, there was a complete while production was set to begin summer 2010, it became delayed until 2011 after singer voiced the film's release date then moved around a couple of times. the majority of these films were either sequels or well-known franchises with large a-list actors in the lead. (granted, \"jack\" had star power from ewan mcgregor which was underplayed in marketing .) rather, the film becomes the latest in a trend of movie studios taking gambles with large inflated budgets (\"<mark>john carter</mark>,\" \"oz the great and powerful\" ). universal \"jack the giant slayer\" seemed like a favored hit given the spike in fairytale interest, but it was missing some of the star power of the previous films. jack's run at theaters came less than a month after jeremy renner's fairytale adaptation of \"reviews and opened to $19.7 million which may be a sign to studios that audiences aren't interested in nursery rhymes and grimm fairy tales being adapted and altered for adults on the big screen. snow white and the huntsmen\" became huge sellers for hollywood as opposed to these recent two flicks. 2. despite darker takes, both \"alice\" and \"snow white\" have the luxury of popular and profitable disney characters before them so its less of a risk at the box office. hansel & gretel \"picked up overseas, as\" jack \"may do in the coming weeks, but neither will come close to the billion dollar hit of\" alice. \"five of the past six weekends have totaled well under $100 million for the box-office top 12. last weekend alone, the u.s. box office showed a 38 percent decline from the year before. lorax\" hit yet, no single film has seen a weekend gross close to the $70 million of the march dr. seuss hit last year. the largest hit of 2013 so far has been poorly received identity thief \"with a $34.6 million opening weekend. with\" oz \"out this weekend, and estimated to debut email address (required but never displayed) these articles have been shared on your timeline. you can remove them here: login with linkedin to see what your friends are reading on business insider. this solar-powered plane can revolutionize the way we produce energy it's becoming a lot easier to grow produce in your apartment window twitter reaction to events often at odds with overall public opinion"}, {"articleID": "2012051909_00080791_W", "names": {"Ying Wu": ["Q45403103", "Q55571828", "Q57513033", "Q59548663"], "Zhou Rong": ["Q45428989", "Q45434969", "Q45451716", "Q45519569", "Q45524711", "Q45545043", "Q45551538", "Q45551557", "Q45552882", "Q45564496", "Q45576194", "Q45592653", "Q45612817", "Q45630612", "Q45673828"]}, "date": "2012-05-19", "url": "http://abc12.com/story/18561202/la-police-arrest-2-in-killings-of-chinese-students", "content": "la police arrest 2 in killings of chinese students associated press los angeles (ap) - police arrested two young men in the shootings deaths of two graduate students from china last month near the university of southern california, an attack that stunned a school that has more international students than any other u.s. university. javier bolden, 19, and bryan barnes, 20, were arrested friday on suspicion of killing the two during an apparent robbery attempt, los angeles police chief charlie beck said. ming qu, of jilin, and <mark>ying wu</mark>, of hunan, were shot april 11 while sitting in a bmw about a mile away from the usc campus. both were 23 years old. their parents filed a lawsuit this week accusing usc of misrepresenting safety at the campus, where nearly one-fifth of the 38,000 students are from overseas, including 2,500 from china. the motive for their killings was still under investigation, beck said, but the \"evidence points to a street robbery,\" and investigators believe the killings were part of a larger string of crimes the two men committed in los angeles. \"forensic evidence recovered at the scene linked them to two other attempted homicides,\" beck said at a news conference. evidence directly linked both suspects to the victims, he added. beck said neither suspect had a long criminal history or is a documented gang member, though police suspect they may have a gang affiliation. mayor antonio villaraigosa congratulated the city's police force, which cooperated with the fbi and the bureau of alcohol, tobacco, firearms and explosives to investigate the killings and make the arrests friday. he praised officers for \"diligence in following every lead and investigating every detail.\" beck declined to provide details of how the suspects were pinpointed but said, \"this was a crime that shocked this city, and we absolutely left no stone unturned.\" barnes was arrested at a home about five miles from campus friday afternoon, and bolden was arrested a few hours later in palmdale, beck said. both were being held without bail and are set to be arraigned tuesday. the campus is located in an urban center a few miles south of downtown. it is across the street from county museums and not far from the staples center arena and a gentrifying area of victorian homes. yet it is also known as an area that had faced high crime and gang activity. in their lawsuit, the victims' parents alleged that the school made false claims about safety in the \"frequently asked questions\" section of its online application. the 15-page lawsuit accuses usc of hiding behind the word \"urban\" and not saying the school is in a high-crime residential area. it also notes that chinese students in particular would interpret urban to mean usc is in a safe area. \"the\" urban' representation misled chinese students, including ming qu, into believing the area is safe since in china, the more urban the area, the safer the area, \"the lawsuit states, claiming usc understood this is how chinese students would interpret the description. usc lawyer debra wong yang said the university was deeply saddened by the deaths but found the lawsuit to be baseless. <mark>zhou rong</mark>, a beijing-based education consultant who advises chinese students wishing to study overseas, said the word\" urban \"to people in china has no connotation of safety.\" i think it only means the location and has nothing to do with safety and crime, \"said <mark>zhou</mark>, who works for new oriental vision overseas consulting. the school and city police announced new security measures after the slayings and promised more video cameras, escorts and patrols. the additional security will include sending over 30 more officers to the department division that handles the usc area, and the university will pay for four additional officers to patrol the student residential neighborhoods, beck said. in a statement friday, usc president c.l. max nikias praised law enforcement and city officials.\" the arrest of the suspects in the tragic deaths of our graduate students, <mark>ying wu</mark> and ming qu, begins the process of healing and of closing a painful chapter in the life of our community, \"nikias said. _______ associated press researcher henry hou in beijing contributed to this report abc12 main station 810-233-3130"}, {"articleID": "2016070715_00095340_W", "names": {"Ramon Fernandez": ["Q3418520", "Q7289826"]}, "date": "2016-07-07", "url": "http://sunstar.com.ph/cebu/sports/2016/07/07/focus-asia-483988", "content": "Time to read 2 minutes Share Print a - a + Read so far Final Game. Jayson Castro tries to find an open man in Gilas Pilipinas' loss to New Zealand. Castro said after the game that he is planning to retire from international competition. (AP Foto) MANY Cebuanos were disappointed over the \"bad\" performance of the Gilas Pilipinas in the 2016 Rio Olympics qualifying tournament, exiting early after losing their first two games at the Mall of Asia Arena. But while many were frustrated at the way coach Tab Baldwin shuffled his players, some believed that the Philippines still has a long way to go. \"Forget international basketball. Train our sight on Asia. To SBP, huwag ninyo bilogin ang ulo ng mga Pinoy that we will make it in the international level. It seem that the objective of the Gilas program is marketing, not as what they have told us,\" said Philippine Sports Commission's <mark>Ramon Fernandez</mark>, a member of the 1974 Fiba World Cup Philippine team and a PBA 4-time MVP. <mark>Fernandez</mark>'s statement came at the heels of Gilas' frustrating loss to the Tall Blacks of New Zealand, 89-80, last Wednesday that ended the Philippines' hope of making it back to the quadrennial Summer Games slated in Rio de Janeiro, Brazil in August. The Philippines made a total of seven appearances in the Summer Olympics, the first was in 1936 in Berlin, Germany and the last time in Mexico, 1968. For Cebu City Sports Commission commissioner and sportsman Lorenzo \"Chao\" Sy, Gilas' lack of experience in international competitions was one of the reasons the team fell short. \"Their performance is okay. They entertained us, they fought hard, Gilas just lack international experience. I guess everybody was satisfied with their performance especially those who bought tickets to watch the game live at MOA Arena, even our president (Rodrigo Duterte) enjoyed the game,\" Sy said. What Sy saw was the lack of shooters and the tendency of the Gilas players to play as individuals. \"They should not disband that team, just add more shooters, size and ceilings. More training and exposure abroad, maybe that's what they needed,\" said Sy. Lawyer Baldomero Estenzo, the Dean of the University of Cebu College of Law and Junemar Fajardo's legal adviser, also admitted Gilas' too much dribbling and lack of defense was the cause of their defeats. \"It's either they were not lucky on their shots or the defense of New Zealand was good that Gilas had difficulty making their shots. Also, there was too much dribbling on the part of Gilas which led to many turnovers. Gilas' defense also left much to be desired. Finally I think there was too much reliance on the MVP (Manny V. Pangilinan) players to the dismay of many. But it was the coach's call and prerogative,\" Estenzo said. For Estenzo, to become a better team, our national team should be a selection of the best players and must have a longer preparation. \"Maybe it would be better if the champion team in the All-Filipino Conference will represent the country (to international competition) with privilege to get players from the other team that it needs. (In this case) teamwork is already there. Yeng Guiao can be the coach,\" Estenzo said. Veteran coach Jun Noel of the University of San Jose-Recoletos observed that Gilas was not prepared. \"Gilas was not ready for the tournament and the new players were still adjusting to the system. That is why their defense was too loose because of the poor rotation of the players, especially the new ones,\" Noel said. UV Green Lancers head coach Gary Cortes said Gilas wasted too much time dribbling, resulting to hurried and poor shot selections. Published in the Sun. Star Cebu newspaper on July 08, 2016. Latest issues of Sun. Star Cebu also available on your mobile phones, laptops, and tablets. Subscribe to our digital editions at epaper.sunstar.com. ph and get a free seven-day trial. DISCLAIMER: Sun. Star website welcomes friendly debate, but comments posted on this site do not necessary reflect the views of the Sun. Star management and its affiliates. Sun. Star reserves the right to delete, reproduce or modify comments posted here without notice. Posts that are inappropriate will automatically be deleted. Forum rules: Do not use obscenity. Some words have been banned. Stick to the topic. Do not veer away from the discussion. Be coherent and respectful. Do not shout or use CAPITAL LETTERS! Please enable JavaScript to view the comments powered by Disqus."}, {"articleID": "2013060312_00065390_W", "names": {"Alex Pearce": ["Q19876905", "Q425921"]}, "date": "2013-06-03", "url": "http://www.thisisanfield.com/2013/06/daniel-sturridge-ligament-damage-confirmed-lfc-striker-crisis/", "content": "Should Liverpool FC look to Germany for potential Summer signings? LFC News> Daniel Sturridge ligament damage confirmed - LFC striker crisis? Daniel Sturridge ligament damage confirmed - LFC striker crisis? Liverpool have been dealt a major blow with the news that striker Daniel Sturridge could face the whole summer on the sidelines, even missing the start of the new season in August, according to Monday morning's stretchered off during England's 1-1 draw with the Republic of Ireland on Wednesday night, with concerns immediately raised and Liverpool's medical team called-in. report that \"scans have subsequently confirmed Liverpool's worst fears on the extent of the injury, revealing ankle ligament damage, and he, too, is expected to be missing from Rodgers' attack when the next campaign opens.\" is still unclear, and the Uruguayan will miss the first six games of the season should he continue his stay on Merseyside. Liverpool are, however, looking set to land a new striker in the next week or so with the Daniel Sturridge ligament damage confirmed - LFC striker crisis? Report: Liverpool given green light to sign \"? 6.5 m Reina replacement\" When new ideas and methods are introduced to the Premier League,...Saturday's LFC Transfer Rumours: David Villa, a? 50m price tag and Rafa's knocking Liverpool Director spotted in London with <mark>Alex Pearce</mark> - deal imminent? Daniel Sturridge ligament damage confirmed - LFC striker crisis? Report: Liverpool given green light to sign \"? 6.5 m Reina replacement\" When new ideas and methods are introduced to the Premier...Saturday's LFC Transfer Rumours: David Villa, a? 50m price tag and Rafa's knocking Jamie Carragher Tribute Book \"We All Dream Of A.. .\" We all dream of a team of Carraghers \"- Tribute to a Liverpool Legend"}, {"articleID": "2018011310_00026210_W", "names": {"Kabir Khan": ["Q6344214", "Q6344216"]}, "date": "2018-01-13", "url": "http://gulfnews.com/life-style/celebrity/desi-news/bollywood/shah-rukh-khan-returns-as-dubai-hero-1.2156066", "content": "Published: 13:40 January 13, 2018 Staff Report SMALL MEDIUM LARGE He's back! Bollywood superstar Shah Rukh <mark>Khan</mark> returns to his starring role for Dubai Tourism's #BeMyGuest campaign. The actor starred in his first promotional film for the city, which was released last year and racked up millions of views online. In the first video from the latest mini series--there are four in total--directed by <mark>Kabir Khan</mark>, the actor is seen taking a couple through Dubai attractions, and ends with the man proposing to his girlfriend. Other videos will show <mark>Khan</mark> taking visitors through Dubai, introducing four characters and personalising each of their experiences in the city. The mini series has been shot at various landmarks, including Legoland Dubai, Bollywood Parks Dubai, Dubai Aquarium, Dubai Fountain, The Palace Downtown Dubai and the mountainous Hatta region. \"Last year I invited my fans around the world to Be My Guest while giving them a glimpse into my Dubai, as part of this exciting partnership with Dubai Tourism.\" This year, along with one of Bollywood's most recognised directors, <mark>Kabir Khan</mark>, we're taking that partnership further to exploring new places and attractions but with the signature essence of Dubai that truly makes it a place where every visitor can feel like they belong to even greater heights. \"I love this amazing city and I'm really looking forward to once again sharing my experiences with my fans,\" <mark>Khan</mark> said in a statement. #BeMyGuest Essam Kazim, the CEO of Dubai Corporation for Tourism and Commerce Marketing (DCTCM), added: \"We are delighted to partner with Shah Rukh <mark>Khan</mark> once again for the new edition of this very special project, #BeMyGuest.\" There is no one quite like him--with his charisma, global appeal, and most importantly because he truly considers Dubai to be his second home and shares so many similarities with what Dubai stands for. \"Our video last year that saw Shah Rukh surprise and delight people in Dubai, garnered great response from across the world, but that was only the beginning of our journey.\" This time around, we continue to celebrate this strong bond by capturing Shah Rukh <mark>Khan</mark> directly exploring the city and what it has to offer to audiences across different age groups and demographics. \"We are also very pleased to work with <mark>Kabir Khan</mark> for the first time, as he has brought to life Dubai's extensive tourism proposition, while weaving in Shah Rukh's unique relationship with the city. We look forward to sharing this series with our global audiences and the international diaspora as well as the wider global fanbase of Shah Rukh <mark>Khan</mark>.\" Director <mark>Kabir Khan</mark> is known for films such as Kabul Express, Ek Tha Tiger and the 2015 mega-hit Bajrangi Bhaijaan. \"It's been an absolute dream come true to work on this campaign with such power house names,\" he said. \"I have always aspired to work with Shah Rukh, the charisma he brings to every shot is admirable, while Dubai has been one of my favourite cities to visit. In these films, we've done our best to capture the essence of Dubai, from its stunning locations to its welcoming hospitality. After working so closely with both Dubai Tourism and Shah Rukh <mark>Khan</mark>, I can confidently call Dubai my home and cannot wait to be back.\" The first #BeMyGuest video, which debuted last year, has garnered more than 45 million views across multiple social media channels. The video also reached No 3 on YouTube's worldwide trending list within 48 hours of its launch and became one of the top 10 most viewed videos on the website globally in December. It also won the Grand Prix, as well as first prize in the Tourism Destination category at the International Tourism Film Festival held in Riga, Latvia."}]