[{"date": "2015-03-10", "url": "http://bostonglobe.com/ideas/2015/03/10/lost-pet-posters-genre/touMR4vRi6nUb9VmIV95PP/story.html", "content": "The Internet has made most forms of paper communication obsolete, but there's at least one as important as ever: lost-and-found pet notices, which are still most effective tacked to a telephone pole. Illustrator <mark>Ian Phillips</mark> collects these melancholy artifacts, and Princeton Architectural Press this month released a 15th anniversary edition of his book, \"The book features some of the most notable examples from <mark>Phillips</mark>'s collection, which he estimates contains more than 1,500 posters. He says he first started paying attention to the genre when his roommate's cat went missing .\" I just became fascinated with the little details that people would choose to put on the poster, \"<mark>Phillips</mark> says .\" Sometimes you could tell just how desperate they were. \"<mark>Phillips</mark> started placing advertisements in zines, asking people to send him posters they came across. In the late 1990s, he was receiving one to two each day, mostly from North America, where pets are more precious than they are in other parts of the world .\" In the Netherlands, someone wrote to me saying you'll never get a Dutch poster because when people lose their pets there, they just go out and get a new one, \"he says. (<mark>Phillips</mark> says he later received a poster from the Netherlands .) Besides dogs and cats, <mark>Phillips</mark> has\" lost \"posters for a turtle, a ferret, a rat named\" Poison, \"and one for a bunny rabbit that says\" alive or dead \"in French. The most desperate posters, he notes, appear to be written very quickly and\" talk about how their animal needs its medication. \"Want each day's news headlines delivered fresh to your Don't miss any of your favorite stories again. Read the stories that matter to you as much as you want, whenever you want when you subscribe to BostonGlobe.com. Subscriber Log In You have reached the limit of 5 free articles in a month Continue reading by subscribing to BostonGlobe.com for just 99 ¢. Continue reading by subscribing to BostonGlobe.com for Stay informed with unlimited access to Boston's trusted news source. High-quality journalism from the region's largest newsroom Convenient access across all of your devices Today's Headlines daily newsletter", "articleID": "2015031017_00075537_W", "names": {"Ian Phillips": ["Q11710887", "Q20683485", "Q21455089", "Q21522952", "Q29643429", "Q56394629", "Q5982597"]}}, {"date": "2015-03-11", "url": "http://www.abc.net.au/lateline/content/2015/s4195092.htm", "content": "Email Australian Broadcasting Corporation Reporter: Margot O'Neill In the online and mobile age, big companies are already collecting lots of information about us. The concern now is what the government intends to use it for. Transcript EMMA ALBERICI, PRESENTER: Some time in the past decade, what it means to be a \"private citizen\" changed. Tonight, we're going to examine the concept of privacy. What does it mean any more? And what's the Government doing snooping around our metadata? Shortly we'll cross to the US to speak to Bruce Schneier. He's one of the world's leading experts in online security. But before we get to that, let's talk about just how much of what we do and say is being tracked. EDWARD SNOWDEN, NSA WHISTLEBLOWER (The Guardian online, July 2014): Why are our private details that are transmitted online, why are our private details that are stored on our personal devices any different than the details and private records of our lives that are stored in our private journals? EMMA ALBERICI: Edward Snowden blew the whistle on how states and corporations are furiously scooping up what we thought was our private information. In the main, we don't think too much of protecting ourselves from the prying eyes of the Government. It's the trade-off, right? For the great convenience of having a phone in your pocket that's also an internet connection, a gaming tool, cinema and recording device. Giving up some of our privacy also doesn't seem so bad if it means we'll all be safer; if it's going to help authorities catch terrorists. But are we giving away too much? Australians wouldn't cop it when the Hawke government tried to introduce the Australia Card. Back in the mid-80s, they wanted us all tagged and numbered on one centralised ID card combining information from 13 government agencies into one database. You'd have to present your card to open a bank account, buy or sell real estate or get a job. All that was to stop tax and welfare cheats. But opposition came fast from both the left and the right. <mark>JOHN HOWARD</mark>, FMR OPPOSITION LEADER (1987): It accumulates an enormous store of information on all of us throughout the country. PETER GARRETT, MIDNIGHT OIL (1987): By numbering Australians, we now ensure that governments of the future can control us. EMMA ALBERICI: The Australia Card, though, was nothing compared to what's being proposed today. And this time the idea is supported by both major parties. They want internet and phone companies to store all our so-called metadata for two years. They want to keep the times and dates of your phone calls, how long the calls lasted, who you spoke to and from where the call was made. Likewise for your emails: where and when they were sent and received and who they were sent to. The actual content of your calls and emails won't be included, but police will have access to all the rest without the need for a warrant. Companies are already collecting all this information. The concern now is what the Government intends to use it for. Margot O'Neill conducted a little social experiment on how much we value our privacy. (footage of a café) CUSTOMER 1: Can I get a small hot chocolate? CAFE EMPLOYEE: Small hot chocolate? CUSTOMER 1: Yep. CAFE EMPLOYEE: That's $2.50. CUSTOMER 1: Thank you. CAFE EMPLOYEE: Can I see your four last text messages? CUSTOMER 1: Pardon? CAFE EMPLOYEE: Can I see your four last texts? CUSTOMER 1: Ah, sorry? (cut to second customer at till) CAFE EMPLOYEE: Where's your home? Can I have the address? (customer 2 simply smiles) CAFE EMPLOYEE: OK, can I have the email address? CUSTOMER 2: I haven't got an email. No. CAFE EMPLOYEE: Can I have your phone number? CUSTOMER 2: Why? (cut to third customer at till) CAFE EMPLOYEE: Um, can I see your last four text messages? CUSTOMER 3: Hey? CAFE EMPLOYEE: Your last four text messages. CUSTOMER 3: My what? (laughs) (Employee laughs. Cut to fourth customer at till) CAFE EMPLOYEE: Where were you last night at 8 o'clock? (Customer 4 laughs) EMMA O'NEILL, REPORTER: Every hour, every day, we're haemorrhaging personal details on the internet: what we buy, where we are, who we contact. We're being harvested, often surreptitiously. We wouldn't put up with it in the real world, which made us wonder: what if a shop assistant behaved like an online app? CAFE EMPLOYEE: Can I have your email then? CUSTOMER 5: My email (laughs)? CAFE EMPLOYEE: Your email. CUSTOMER 5 (laughing): No. . No. . CAFE EMPLOYEE: We want to try to provide a better service. CUSTOMER 6: You want to provide a better service in knowing what I did, 8 o'clock at night? CAFE EMPLOYEE: Yep. CUSTOMER 6: For what reason? CAFE EMPLOYEE: Just provide a better service. CUSTOMER 6: Explain it to me. EMMA O'NEILL: Our little hidden camera experiment was inspired by a recent Danish consumer campaign, which also shows that people don't like sharing personal information with strangers. CUSTOMER 1 (Danish consumer advertisement, translation): My telephone number? (Laughs) Then I want yours too. CUSTOMER 2 (Danish consumer advertisement, translation): No way. No, I refuse. EMMA O'NEILL: There's so many slick, fast, convenient services because of the digital economy. But the price is a slice of your life. Apps like Facebook, Instagram, Snapchat, Twitter and Messenger, to name just a few, can access your contacts, calendar, messages, photos, texts and your location data - which, by the way, may not be considered personal information under Australian law. Hey, check this out: deep in my privacy settings there's a thing called \"frequent location\" which shows exactly when and where, for how long I've been, even providing a handy little map. I think I'll just be turning that off. The average Australian now connects to the internet through four or five different devices: smart phones, tablets, PCs, laptops, TVs, work computers. From morning to night, your digital exhaust is logged for the global information economy. And most of us don't really understand what that means. Behind every keystroke there's a global buyer's market, itching to target who they think you are. Searching for a holiday, an abortion clinic, a cure for herpes: Google and its advertisers go there with you. (to Wade Alcorn) Is it our fault? Are we not reading privacy policies? WADE ALCORN, CYBER SECURITY EXPERT: I think those privacy policies are massive and you pretty much need a legal degree to understand them. (excerpt from AAMI advertisement) ACTOR (AAMI Safe Driver App advertisement): Are you ready for this? ACTOR (AAMI Safe Driver App advertisement): Bring it on, muchacho. EMMA O'NEILL: Using AAMI's safe driving app, AAMI hopes it will help uncover dangerous traffic spots to make the road safer. But it can also record when you speed or if you're in an accident. And it could turn over that data to the police if legally required to do so. AAMI says currently the data won't negatively affect insurance premiums, but there's no guarantees about the future. (excerpt ends) EMMA O'NEILL: And that's true of just about all data collection: it can be repurposed. WADE ALCORN: Maybe in a few years' time they can use it in a whole different way that isn't what you initially intended when you provided them access to your data. EMMA O'NEILL: Mega-data corporations like Google and Facebook say, \"Don't worry. The data's anonymous. Only machines read it to better target personal ads .\" But Stanford University researchers found that by analysing even limited information from mobile phones, they could predict individual medical conditions, hobbies and relationships. WADE ALCORN: For example, your GPS data: possibly, if an application is tracking where you're going, they may be releasing that information or, rather, selling that information on around how often you visit the doctor. EMMA O'NEILL: Companies also say we can trust them to keep the data safe. (excerpt from the film \"The Lord Of The Rings: The Fellowship Of The Ring') IAN McKELLEN (as Gandalf): Keep it secret. Keep it safe. (excerpt ends) EMMA O'NEILL: But last year computer hack attacks surged worldwide by 48 per cent. In Australia, companies don't have to tell the public if their information has been compromised. Some experts say there's really only two types of organisations: WADE ALCORN: Ones that have been hacked and ones that don't know they've been hacked. EMMA O'NEILL: And if it's not crooks hacking your data, governments want your stuff. All of it, apparently. The US electronic spy agency, the NSA, is like an intelligence super-trawler slurping up everything it can from internet servers around the world, including Australia. (excerpt from the film\" Signs'. Two children are wearing hats made of aluminium foil) RORY CULKIN (as Morgan): So the aliens can't read our minds. (excerpt ends) EMMA O'NEILL: It's no wonder encryption is becoming more popular. Getting off the grid is even becoming cool: like fashion wear with shield pockets to block mobile phone signals. Just ask Malcolm Turnbull. The Federal Communications Minister admits using the secret messaging app Wickr, which encrypts and then destroys messages. (to Wade Alcorn) Do you use encryption? WADE ALCORN: Absolutely, absolutely. Yeah. Absolutely. For business purposes, to ensure that communications are secure and also for personal communication as well. EMMA O'NEILL: And what should you do when you're asked to give up personal details? (footage of café) CAFE EMPLOYEE: Can I have your e mail? CUSTOMER 7: No, I don't hand out my private information. CAFE EMPLOYEE: OK. Can I have your phone number please? CUSTOMER 7: No, unfortunately not. You can't have that either. JUANITA PHILLIPS, NEWSREADER (ABC News, Feb. 10): The technology giant Samsung has admitted that its new Smart TV could be eavesdropping. EMMA O'NEILL: Now, you probably don't want to hear this but the potential to hack your life is about to get much worse. A new wave of wearable technology, like the Apple Watch, will be able to transmit every heartbeat, every footstep, every REM sleep cycle. And in the next decade, a looming tsunami of sensor-driven technology built into your home, your car, your office will mean just about every gadget from your desk chair to your fridge will be able to gossip about you on the internet. Cyber privacy is dead and we all have to get over it. At least, that's what Silicon Valley executives have been predicting for the last 15 years. No-one could have predicted how quickly, how willingly we would just give away our privacy. And there's no going back. But with technology now running so far ahead of consumer awareness and legal safeguards, a fight-back may be stirring. You can Google it - or maybe not .----------------------------------In response to a story posted by ABC News Online, AAMI provided the following statement: \"We are very disappointed in ABC Lateline's web story this afternoon on the AAMI Safe Driver App. We view running such a piece based on highly unlikely scenarios as scaremongering .\" The intention of the app was never to collect data to provide to police nor have the police request data from us. This is no different from the obligations we have today. Every company is required to provide information to police when legally compelled to do so. \"Our pilot study of the App involving more than 1000 drivers suggested that it had a significant positive impact on the way people drive .\" ", "articleID": "2015031201_00017245_W", "names": {"John Howard": ["Q1467025", "Q51330", "Q5670833", "Q58363217", "Q6228200", "Q6236889", "Q6240028", "Q6240032", "Q6240035", "Q6240041", "Q6240047"]}}, {"date": "2015-03-12", "url": "http://www.financialexpress.com/article/miscellaneous/former-congress-mla-claims-he-was-offered-ministerial-berth-by-aam-aadmi-party/52982/", "content": "Former Congress MLA claims he was offered ministerial berth by Aam Aadmi Party Former Congress MLA claims he was offered ministerial berth by Aam Aadmi Party A day after a former Aam Aadmi Party (AAP) MLA accused Delhi Chief Minister Arvind Kejriwal of trying to poach six Congress MLAs...http: //www.financialexpress.com/article/miscellaneous/former-congress-mla-claims-he-was-offered-ministerial-berth-by-aam-aadmi-party/52982/ Asif Mohammed Khan, former Congress MLA from Okhla, has claimed that he held meetings with deputy chief minister Manish Sisodia once and <mark>Sanjay Singh</mark>, another senior AAP leader, twice last year to dicuss the issue. Rubbishing Khan's claim, <mark>Singh</mark> challenged him to provide evidence. \"He (<mark>Singh</mark>) says that he did not indulge in horse trading. I had one meeting with Manish Sisodia ji and two meetings with <mark>Sanjay Singh</mark> in Noida. He never offered me money, but he offered me a ministerial berth and chairmanship of different boards to five MLAs in lieu of support,\" Khan said. The former Okhla legislator added that he had recorded the talks between him and <mark>Singh</mark> and will make the conversations public. \"I will certainly make the evidence public. I am not ready to back track. Now <mark>Sanjay Singh</mark> has accpeted that he has met me,\" he said. Khan said that <mark>Singh</mark> had also instructed him not to make the conversations between the two public until anything concrete came up. \"He (<mark>Singh</mark>) said that if you are quitting the party...we are aware that contesting polls is an expensive affair. Even on that front, we will think about it .\" He also said that the conversation should not go out of the room because some senior leaders of AAP do not want that we should form the government with Congress's support. So, till the time this does not work out the matter should not come on public platform, \"Khan said. <mark>Singh</mark> admitted to have met Khan for government formation lasy year, but denied that he had offered any ministerial berth in lieu of support to the party. Khan's claim assume significance because the AAP had yesterday claimed that it was neither involved in poaching or any kind of horse-trading .\" Using the term horse-trading is far too harsh and irresponsible. We neither lured them with money nor did we offer them with any gains. Political realignments are not new in this country. Please Wait while comments are loading...Former Congress MLA claims he was offered ministerial berth by Aam Aadmi Party Indian rupee rebounds 28p vs US Dollar to end at 62.50 on recovery in stocks Xiaomi Redmi 2 4G launched in India; smartphone priced at Rs 6,999 Xiaomi launches MiPad tablet on Flipkart, prices it at Rs 12,999 FDI inflows, Hindalco, Commodity exchanges, BSE Sensex, NSE Nifty and more Auto and passenger car sale, Indian women at work, BJP-PDP crisis and more Xiaomi Redmi 2 4G smartphone launched in India, to challenge Moto E 2nd gen Gagngrape: \"India's daughter' real reflection of what society thinks, says Udwin Today (12 Mar) This Week (08 Mar - 14 Mar) BSE Sensex up nearly 1% on reforms hopes BSE Sensex jumped on Thursday on hopes Prime Minister Narendra Modi would be able to steer a bill...Moto E, Moto G, Moto X: Motorola to account for a fifth of Flipkart's GMV at Rs 5,000 cr Xiaomi Redmi 2 4G smartphone launched in India priced at Rs 6,999, to challenge Moto E 2nd gen Xiaomi Redmi 2 budget smartphone lunched in India at a price of Rs 6,999, will directly compete with the newly-launched Moto E 2nd Gen which also carries the similar price tag. Indian govt should stop Bollywood from plagiarising: Jeffrey Archer Bestselling author Jeffrey Archer is angry over some Bollywood producers\" stealing \"his work without making any compensation...AirAsia flight QZ8501\" not giving up' but hunt for bodies drawing to close Silicon Valley sexual discrimination case: Woman says she didn't initially reject advances of colleague Indians look to fly cheap, but frown at making \"sacrifices' on services: Survey Column: India's Dharavi future Land Bill concessions make developing new cities a nightmare, so more urban slums seem likely", "articleID": "2015031214_00018810_W", "names": {"Sanjay Singh": ["Q16236542", "Q27050566", "Q7418478", "Q7418479"]}}, {"date": "2015-03-12", "url": "http://www.heyreverb.com/blog/2015/03/12/remember-remember-garth-brooks-was-in-denver/101377/", "content": "In this Jan. 25, 2008 file photo, country singer Garth Brooks performs during a charity concert in Los Angeles, to benefit the Southern California 2008 Fire Intervention Relief Effort (F.I.R. E). Brooks is going to be very busy in December. Brooks sold more than 140,000 tickets Saturday morning, Nov. 6, 2010, and his benefit concert for Nashville, Tenn., flood relief ballooned from one show to nine. (AP Photo/Mark J. Terrill, File) Garth Brooks took the stage with a beeper clipped to his belt. It was the year 1996 and Brooks and his then-wife Sandy Mahl were expecting their third child. Mahl was due any moment, her contractions were four minutes apart that day and the beeper was there to notify Brooks if his third child was coming. \"If this beeper goes off, I'm out of here,\" Brooks said before the show at McNichols Arena - his first of three-night sold out run. \"I've got a plane here ready to go .\" Lucky for Denver fans, Brooks' daughter (Allie Colleen Brooks) was born a week later and the country star made it through his string of McNichols shows. When Brooks returns on March 18 for his first Colorado concert since the McNichols run, Allie Brooks will be nearing her 18th birthday. Babies have become adults, the McNichols building has been demolished, Brooks has retired, returned from retirement and has released three more albums in the time it took him to make his way back to play a proper show in Colorado. That Colorado fans have waited nearly two decades to see the country superstar was only half the excitement when he announced his return in January. Brooks will be playing nine shows at Denver's Pepsi Center from March 18-24. It's a record breaking tour stop in the region: with 120,000 tickets up for grabs, Brooks has sold more tickets than any artist with consecutive shows at one venue in Colorado. While he hasn't played a proper show since 1996, Brooks has made two appearances in the state for charity events in the past few years. April 24, 2010 - Brooks attends the opening of Child Life Zone The Garth Brooks Teammates for Kids Foundation and the Troy Aikman Foundation built the $2 million therapeutic and education play area at Denver Health Medical Center. Brooks himself appeared for the grand opening. \"Trust me, you're gonna be very happy what it does for our kids,\" country singer Brooks told a large and cheering audience made up of hospital administrators, doctors, nurses, support staff, children, parents, politicians and members of both Broncos and Avalanche teams. June 8, 2000 - Baseball in field boots: Brooks was one of the celebrities on the roster for the Evening of Stars and Fireworks, a celebrity softball game featuring members of the Rockies, the Rapids, the Broncos, the Avalanche and the Nuggets. As the Denver Post's <mark>Joseph Sanchez</mark> wrote of the evening: \"It was country music star Garth Brooks, in farmhand field boots, trying to tackle <mark>Larry Walker</mark> of the Colorado Rockies in the pregame introductions at home plate...For the record, <mark>Walker</mark>'s Blue Stars defeated Brooks' Gray Stars 27-26 when Jon Klemm of the Avs slapped a Griese pitch over the centerfield fence in the bottom of the sixth inning, scoring Avs teammate <mark>Chris Drury</mark> ahead of him .\" And what about previous shows before his lengthy absence in Colorado? June 2, 1992 - McNichols Arena: As the Denver Post described the scene of Brooks' Colorado tour just before the release of his fourth studio album, \"The Chase\" : \"With his now familiar headset microphone, Brooks paced the length of the stage like a caged panther, using the ramps to work the audience along the sides and back of the arena. He played little guitar, opting to shake hands and hug members of the audience like a politician. Three songs into the set Brooks told the screaming throng:\" Six and a half months off and it took me one second tonight to figure out that this is where I belong .' Sept. 6, 1993 - Pueblo State Fair: Brooks headlined the Pueblo State Fair in 1993, where he accepted a rain of flowers from the fans. He even made a special request for crews to work non-stop to build a stage lower to the ground and closer to the crowd. \"It paid off,\" The Denver Post wrote. Google +. Or send us a telegram. Reverb Managing Editor <mark>Matt Miller</mark> has a really common name so please use these links to find his Google + page. Or just send him an email to mrmiller @ denverpost.com. Talib Kweli on the academics of hip-hop: \"When you have knowledge, you'll do better\" ", "articleID": "2015031218_00007123_W", "names": {"Chris Drury": ["Q2495654", "Q471491"], "Joseph Sanchez": ["Q11728477", "Q6286816"], "Larry Walker": ["Q11752886", "Q22337579", "Q3218116"], "Matt Miller": ["Q16732613", "Q20680269", "Q32945388", "Q6788873", "Q6789069", "Q6789071", "Q6789072", "Q6789073", "Q6789074", "Q6789075"]}}, {"date": "2015-03-13", "url": "http://www.texasgopvote.com/pro-life/end-life-talks-stalled-texas-right-life-will-not-come-table-007604", "content": "In letter, the group's attorney claims TEC could compel donor list release, other groups and their attorneys disagree Scott Braddock on March 13, 2015 at 3:49 PM originally published on the Quorum Report. The thorny issue of how to reform Texas' laws on end-of-life health care is front and center for prominent pro-life groups at the Texas Capitol. But, one of those groups is skipping out on negotiations about crafting legislation and in doing so the group's lawyer is blaming the Texas Ethics Commission for rules aimed at transparency in elections. Texas Right to Life is once again at odds with Texas Coalition for Life and Texas Alliance for Life, with the latter two of the three groups in agreement that there is no TEC rule standing in the way of productive talks on how to reform the Advance Directives Act. Former Sen. Bob Deuell, R-Greenville, unsuccessfully pushed changes in 2013 that would have given patients' families greater protections while providing clarity for doctors in situations when physicians and families do not agree about how to deal with a terminal illness. During last year's GOP primary runoff won by Sen. <mark>Bob Hall</mark>, Texas Right to Life seized on this issue and helped unseat Deuell by running broadcast advertisements that suggested he \"turned his back on life and on disabled patients\" and favored a \"death panel .\" Deuell has called those ads \"slanderous\" and the Texas Catholic Conference said Right to Life \"has tried to stoke fear through ridiculous claims of non-existent death panels and assertions that doctors are secretly trying to kill patients. Both claims are absurd .\" Texas Right to Life is suing Deuell in Houston because, the group says, he infringed on their First Amendment rights by asking radio stations to cancel the advertisements. Deuell's attorneys are working to get that case dismissed. A hearing is set in the next few weeks. Given that backdrop, it might not surprise you to learn that Texas Right to Life is refusing to participate in talks at the Capitol aimed at coming up with a legislative solution on end-of-life care. In an email obtained by Quorum Report, the group's attorney Trey Trainor argued that a rulemaking by the TEC about coordinated efforts during elections applies to lobby efforts. \"Clearly such a focused effort, one that is sorely needed, would meet the common activity portion of the TEC's new acting in concert definition,\" Trainor wrote. \"In fact, it is the singular focus of the group that wood evidence the common activity of the participating entities. If the end-of-life issue were ever discussed by any one of the participating entities in a campaign (notice the new rule, by design, has no limitation on when the cooperation or consultation had to occur in relation to a campaign expenditure) it could have the effect of forcing all the entities into donor disclosure,\" Trainor said. \"Participation by several non-profit entities in an organized and coordinated effort that has as its singular focus the discussion of one pending legislative/political issue jeopardizes the constitutionally protected private right of association of the donors to each entity because of the ambiguous and ill-conceived rulemaking of the Texas Ethics Commission,\" Trainor said. Trainor told Quorum Report that he could not comment on any advice he may have given his clients. copy of the email here. Executive Director of Texas Alliance for Life Joe Pojman said that his group's attorneys do not agree the assessment in Trainor's email. \"The TEC rule that he refers to does not apply to legislative activities, only to electioneering,\" Pojman said. \"The rule has no impact on our groups meeting to consider legislative action .\" Pojman argued that if Trainor were correct, the attorney would need to advise Texas Right to Life to withdraw from other activities in which end-of-life care has been discussed by multiple groups. Those activities include the Life, Liberty, and Property Coalition and the Texas Faith and Family Day at the Capitol headlined by Gov. <mark>Greg Abbott</mark> and Lt. Gov. <mark>Dan Patrick</mark>. Trainor said that those activities could not be equated with \"a backroom meeting wherein all manner of political and legislative information may be exchanged,\" ", "articleID": "2015031323_00005103_W", "names": {"Bob Hall": ["Q18619029", "Q47546010", "Q4932653", "Q4932654", "Q4932655", "Q887968"], "Dan Patrick": ["Q19517991", "Q5214174", "Q5214175"], "Greg Abbott": ["Q5605224", "Q5605225"]}}]