[{"articleID": "2016090412_00384483_W", "names": {"John Ross": ["Q11727979", "Q1701610", "Q19661432", "Q21063323", "Q27925053", "Q43380308", "Q43911093", "Q56254622", "Q6255678", "Q6255693", "Q6255697", "Q7252813"]}, "date": "2016-09-04", "url": "http://mysanantonio.com/news/article/3M-snow-melt-system-an-option-for-downtown-9202264.php", "content": "http: //www.ourmidland.com/news/article/3M-snow-melt-system-an-option-for-downtown-9202264.php $3M snow-melt system an option for downtown Midland Jessica Haynes, jhaynes @ mdn.net Published 7:30 am, Sunday, September 4, 2016 Midland's Downtown Development Authority is exploring the option of a potential $3 million snow-melt system for the streetscape redevelopment design plan. The DDA's Streetscape Committee recently met to look over the final designs, presented by project managers SmithGroupJJR, MKSK and DLZ of Michigan. While the streetscape features changes such as turning the one-way streets of Ashman and Rodd into two-ways and replacing traffic signals along Main Street with four-way stops in order to make downtown more walkable and less confusing for visitors, the committee is looking to add another pedestrian-friendly feature in the form of a snow-melt system. It is an idea that some downtown business and property owners have indicated interest in, said Selina Tisdale, community affairs director, and prompted some research into cities like Holland and Grand Haven that utilize the system. \"We realize that with the festival streets, we're adding quite a bit of sidewalk width,\" Tisdale said. That extra sidewalk could mean extra work for business owners clearing paths for customers who brave the elements to shop downtown. The snow-melt system is still under review, and is not part of the final design plan as of yet, Tisdale said. The biggest factor is cost: she estimated it could be anywhere from $1.1 to $3 million to install the system, not counting operating and maintaining it through the years. \"We know that won't be an element provided by the foundation support,\" Tisdale said, referring to multiple philanthropic organizations that have indicated funding interest in the streetscape design plan. \"We're keeping it on the table, continuing to explore it, but we know the funding has to come from somewhere and that's still a question at this point .\" She noted a snow-melt system could set downtown Midland apart. Another hot topic for the committee was parking, Tisdale said. It was a subject brought up numerous times by concerned residents, and has resulted in 2.5 blocks of Main Street transitioning to parallel parking. It also means the loss of six parking spaces along the downtown roadway, a decision that Tisdale said the streetscape committee took seriously, weighing the positives and negatives. \"At first we thought it would be a lot more than that,\" Tisdale said. \"We support this design from a parking perspective .\" It is also supported from a traffic perspective, and backed by statistics by Wes Butch from DLZ of Michigan. He was at the committee meeting, and said traffic would need to be 2.5 times heavier than current levels in order to warrant signalized intersections along Main. \"All of these elements, even though they are change, are better for the pedestrians,\" Tisdale said. \"That's the feel the streetscape committee wants for the downtown based on the original community input .\" The next steps for the streetscape design plan include approval by the DDA, and a workshop scheduled for 3 p.m. on Monday, Oct. 3, at City Hall where Midland City Council will have the opportunity to hear about the final design draft and ask questions of the project designers. The workshop is open to the public. \"We really thought this would be a better setting than a council meeting, when they have lots of items to get to on their agenda,\" Tisdale said. The final design draft would then be forwarded to the city council for formal approval at either its regular meeting on Oct. 10 or 24, where the DDA will seek approval to fund the next step: the engineering design phase, estimated at $500,000 to be paid by the DDA. As for the cost of the entire streetscape project, a previous estimate of $7 million is now closer to $9 million and would increase if the snow-melt system is included. Construction could begin as early as spring 2017, and the DDA is hopeful it could be done in one phase of construction. \"We're focused and committed to making this as painless as possible for downtown businesses. They want what's coming down the pike,\" Tisdale said. For Tisdale, the streetscape project is a way to continue the legacy of people who worked hard to bring downtown back from the brink in the early 1990s. \"We have to continue to make Midland forward-moving, forward-thinking,\" Tisdale said. \"A place where people continue to come, where businesses want to continue to be .\" The Next Story Hawaii tourists salvage vacations during hurricane threats Texans activate J.J. Watt Rick Porcello tosses gem, Red Sox rout Athletics once again Last-minute touchdown lifts Western to season-opening victory Oak Ridge outlasts Elkins State court hands Houston cop killer a stay weeks before...Conner stars in return from cancer, Pitt tops Villanova 28-7 3 & out: Takeaways as Jake Browning, <mark>John Ross</mark> lead Huskies'...Astros' Brady Rodgers has rough outing in MLB debut UTSA notepad: Wilson impressed by Spirit Walk Today's Deals Powered by SHOP NOW Ozark Trail 10x10-Foot Gazebo w /...WalmartPosted 1 day 13 hr ago SHOP NOW Mainstays Essential True Colors Wash.. . WalmartPosted 1 day 9 hr ago SHOP NOW Google Chromecast Audio Media Player...WalmartPosted 3 days 6 hr ago SHOP NOW Refurb Garmin Forerunner 620 Watch...WalmartPosted 1 day 1 hr ago View Comments & copy; 2016 Hearst Communications, Inc. ."}, {"articleID": "2018112322_00383360_W", "names": {"Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"], "Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}, "date": "2018-11-23", "url": "http://leaderlive.co.uk/sport/national/17251992.maurizio-sarri-chelsea-would-not-accept-four-years-without-silverware/", "content": "Maurizio Sarri doubts he would be permitted four trophyless years as Chelsea boss 0 comments Maurizio Sarri doubts Chelsea would tolerate four years without a trophy, like Tottenham have under Mauricio Pochettino. Sarri and Pochettino have attracted plaudits, despite sharing the unwanted distinction of not having won any silverware in their managerial careers. Sarri admits Chelsea's history suggests he must end his drought to remain as boss. Asked if he would be afforded four years at Chelsea without a trophy, Sarri said: \"I don't think so, but I don't know. It's up to the club--if it's more important to win, or more important to improve the players .\" Tottenham boss Mauricio Pochettino is yet to win a trophy in his managerial career (Adam Davy/PA Images) Sarri takes his Blues side to Tottenham's temporary Wembley \"home' on Saturday seeking to extend a 12-match unbeaten start to the Premier League season. The expense of the construction of Tottenham's new stadium at White Hart Lane and the continued uncertainty over when they will play there may have contributed to Pochettino being unable to end Spurs' 10-year wait for a trophy. Pochettino signed a contract extension until 2023 last summer and Sarri has sympathy with his lack of silverware .\" I want to win something just to avoid this question, \"the 59-year-old Italian added .\" Sometimes there are the conditions for winning. Sometimes not. \"It's clear he's a very important coach, with a trophy or without a trophy .\" Maurizio Sarri is a fan of Tottenham playmaker Christian Eriksen (Adam Davy/PA Images) <mark>Antonio Conte</mark>, Sarri's predecessor, was sacked in July despite winning the Premier League in his first season and the FA Cup in his second. <mark>Conte</mark> spoke of his admiration for Tottenham striker <mark>Harry Kane</mark>. Sarri was asked which Spurs player he would like if he could sign one and was happy to declare his appreciation of Christian Eriksen. But when the subject of the Denmark player's contract expiring came up, Sarri interjected. He said: \"No, no, no. . I like him very much, but I don't want to talk about a player of Tottenham for the (transfer) market, of course. I only answered a question .\" Just a reminder...#PL pic.twitter.com/XWS6o507nW--Premier League (@ premierleague) November 17, 2018 Sarri on Friday used his pre-match media conference to again play down his side's title chances and promote Manchester City's. Liverpool are the only side likely to challenge City, Sarri says, and Chelsea are battling it out for the remaining Champions League qualification spots. Pochettino claimed Chelsea and Arsenal have an advantage domestically due to playing in the second-tier Europa League, rather than the Champions League. Sarri admits the quality of the competition may be advantageous, but the proximity of the fixtures is a distinct disadvantage, as he cited playing PAOK next Thursday and Fulham in the Premier League next Sunday. Sarri added: \"From a mental point of view, maybe we do have an advantage. From a physical point of view, no .\" Sarri says we have some difficulties at the start of games, which he thinks is a mental problem for his players, and not a tactical one. \"Our opponents were more aggressive, more determined than us. We have to approach the match in a different way .' #TOTCHE--Chelsea FC (@ ChelseaFC) November 23, 2018 Sarri hopes his side start more aggressively against Spurs after being dissatisfied by a\" mental problem \"in the last three games .\" The problem was that the opponents were more aggressive, more determined than us, \"he added .\" It's not a tactical problem, it's not a physical problem. We have to approach the match in a different way, for application and determination. \"We have to be careful. We have to be focused on this problem .\" Chelsea have some undisclosed doubts, with Mateo Kovacic (ankle) expected to be in contention. 0 comments"}, {"articleID": "2018012403_00003275_W", "names": {"Thomas Farley": ["Q23058869", "Q59489244", "Q7789520"], "Tom Wolf": ["Q1557544", "Q7794795"]}, "date": "2018-01-24", "url": "http://www.wearecentralpa.com/news/philadelphia-wants-safe-injection-sites-to-help-opioid-fight-1/935531442", "content": "Philadelphia wants safe injection sites to help opioid fight By: KRISTEN DE GROOT, Associated Press Posted: Jan 23, 2018 07:51 PM EST Updated: Jan 23, 2018 07:51 PM EST KWWL via CNN KWWL via CNN PHILADELPHIA - PHILADELPHIA (AP) - Philadelphia wants to become the first U.S. city to allow supervised drug injection sites as a way to combat the opioid epidemic, officials announced Tuesday, saying they are seeking outside operators to establish one or more in the city. Public Health Commissioner Dr. <mark>Thomas Farley</mark> said the sites could be \"a life-saving strategy and a pathway to treatment,\" and would be just one piece of the city's overall plan to fight the epidemic. \"No one here condones or supports illegal drug use in any way,\" <mark>Farley</mark> said. \"We want people saddled with drug addiction to get help .\" Safe injection sites are locations where people can shoot up under the supervision of a doctor or nurse who can administer an overdose antidote if necessary. Critics have argued the sites may undermine prevention and treatment, and seem to fly in the face of laws aimed at stopping use of deadly illicit drugs. Philadelphia has the highest opioid death rate of any large U.S. city. More than 1,200 people fatally overdosed in Philadelphia in 2017, one-third more than 2016. The city hopes to hear from operators interested in setting up the injection sites - which they are calling comprehensive user engagement sites - where the city would provide outreach services. Other cities have proposed similar safe havens. No U.S. city has established such a site, though Seattle has set aside $1.3 million to create a safe injection site there. Injection sites are operating in Canada and Europe. Officials from Philadelphia visited Seattle and safe injection sites in Vancouver, where <mark>Farley</mark> said they have reduced overdose deaths, the spread of diseases like HIV and hepatitis C, and created safer neighborhoods that are free of used-needle litter. It's not clear how the federal government would respond if Philadelphia gets a safe-injection site. Nearly three months ago, President Donald Trump declared the U.S. opioid crisis a public health emergency. Philadelphia Police Commissioner Richard Ross said he was initially dead-set against injection sites but now is keeping an open mind if they can truly save lives. He said he still has a lot of questions about how it all would work but added: \"We cannot just throw our hands up and say,\" That's not my problem .' \"Mayor Jim Kenney wasn't at the news conference but <mark>Farley</mark> said the Democrat supports the recommendation. Philadelphia City Councilwoman Helen Gym called the decision to allow safe injection sites\" bold, brave, and lifesaving. \"\"This crisis requires us to think differently and comprehensively about how to reach everybody impacted by the opioid crisis,\" the Democrat said. Pennsylvania Attorney General Josh Shapiro said sanctioning such sites presents public safety concerns and changes in state and federal law would have to be made in order for them to operate legally. The Democrat also expressed doubt that the sites are an effective path to treatment. \"There is no safe way to inject heroin, fentanyl and carfentanyl,\" he said in a statement. \"These are dangerous drugs with devastating consequences .\" House Speaker Mike Turzai, who is running for the Republican nomination to challenge Democratic Gov. <mark>Tom Wolf</mark>, called Philadelphia's safe injection plan misguided and a violation of federal law. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Don't Miss Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2015011415_00060644_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"], "Clint Eastwood": ["Q2979323", "Q43203"], "James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2015-01-14", "url": "http://kbtx.com/mycw8/entertainment/headlines/Snipers-Widow-Struggled-with-Having-Him-Portrayed-in-Film-288545281.html", "content": "Sniper's Widow Struggled with Having Him Portrayed in Film DALLAS (AP)--The wife of a famed Navy SEAL sniper said she struggled with the idea of someone playing the movie role of her husband, who was killed two years ago near Fort Worth, Texas. that actor <mark>Bradley Cooper</mark> did an excellent job accurately portraying her husband, Chris, and the difficult decisions he faced while fighting in Iraq and his struggles with determining his role when he returned from war. In the film, a subtle facial tic that <mark>Cooper</mark> has as he looks through the scope of his weapon made Kyle nearly forget she was watching an actor on screen, she said. \"It'd be almost like a tell in poker,\" she said. \"In a stressful situation, Chris would do that .\" The movie, \"American Sniper,\" is based on Chris Kyle's 2012 memoir that recounts his journey from being a rodeo cowboy to a trained sniper credited with 160 kills. He was honorably discharged in 2009 after 10 years of service, including four tours in Iraq. In February 2013, Kyle and his friend, Chad Littlefield, were killed at a shooting range. Ex-Marine Eddie Ray Routh is charged with capital murder, and authorities say he confessed to the killings to a Texas Ranger. He remains in jail in lieu of $3 million bail. His trial is scheduled to start next month. <mark>Cooper</mark> and the film's director, <mark>Clint Eastwood</mark>, visited Taya Kyle in Midlothian - about 25 miles south of Dallas - before filming. The trio sat around and talked, with Kyle showing them her husband's baseball caps, cowboy boots and the clothes still hanging in his closet. \"It felt like I had a couple of friends over,\" she said. \"They were very respectful, kind and warm .\" She said the film, which will open in theaters nationwide Thursday, is a \"beautiful gift\" to her family and to all military families who have experienced war. \"If you go to combat and you have people who love you at home, some version of this story is your story,\" she said. \"Paw-paparazzi' Take Note: World Dog Awards Honor Star Pets <mark>James Cameron</mark> Says\" Avatar' Sequel Delayed Until Late 2017 Join the Conversation! To comment, the following rules must be followed: No Obscenity, Profanity, Vulgarity, Racism or Violent Descriptions No Negative Community Comparisons No Fighting, Name-calling, Trolling or Personal Attacks Multiple Accounts are Not Allowed Stay on Story Topic Comments may be monitored for inappropriate content, but the station is under no legal obligation to do so. If you believe a comment violates the above rules, please use the Flagging Tool to alert a Moderator. Flagging does not guarantee removal. Multiple violations may result in account suspension. KBTX-TV Channel 3 4141 E. 29th Street Bryan, TX 77802 Phone: (979) 846-7777 Fax: (979) 846-1490 News Fax: (979) 846-188 × Online Public Information File Viewers with disabilities can get assistance accessing this station's FCC Public Inspection File by contacting the station with the information listed below. Questions or concerns relating to the accessibility of the FCC's online public file system should be directed to the FCC at 888-225-5322, 888-835-5322 (TTY), or fccinfo @ fcc.gov. Station Contact Info: KBTX-TV Channel 3 4141 E. 29th Street"}, {"articleID": "2017040205_00471292_W", "names": {"Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"], "Keith Smith": ["Q15439635", "Q16105484", "Q16980993", "Q24451721", "Q3814340", "Q41782731", "Q43109906", "Q57541710", "Q6383947", "Q6385036", "Q6385038", "Q6385040", "Q6385041", "Q6385042", "Q6385043", "Q6385046"], "Chris Boucher": ["Q30668441", "Q5105946"], "Kris Jenkins": ["Q24005501", "Q6437191"]}, "date": "2017-04-02", "url": "http://www.startribune.com/sports/gophers/417882973.html", "content": "GLENDALE, ARIZ.--North Carolina's <mark>Roy Williams</mark> was the only coach in the Final Four that had been there before--and his program has an NCAA record 20 appearances in the national semifinals. That type of experience and tradition made the Tar Heels the clear favorite Saturday over Oregon, but it took them until late in the first half to wake up and play like a potential champion. Trailing by eight points in the first half, North Carolina was shooting just 25 percent from the field. The only reason it wasn't getting blown out was because of the play of Kennedy Meeks, who finished with 25 points and 14 rebounds. And Meeks' offensive rebound on a missed free throw in the closing seconds eventually helped the top-seeded Tar Heels barely escape with a 77-76 victory over No. 3 seed Oregon to advance to their second straight NCAA championship game. \"If it wasn't for Kennedy Meeks, we wouldn't have been in the basketball game,\" <mark>Williams</mark> said. \"It's a dream come true to get there. Now we've got to play better .\" Tyler Dorsey's three-pointer followed by a layup from <mark>Keith Smith</mark> cut it to 77-76 with seven seconds left in the game. Meeks missed two free throws with 5.8 seconds left, but Theo Pinson tapped the ball out to put his team on the line once again. David J. Phillip & #x 2022; Associated Press Oregon forward Jordan Bell fought for a rebound with North Carolina guard Stilman White during the first half. Joel Berry clanked the front end of a 1-and-1, but Meeks was there for the clutch carom to seal it. <mark>Williams</mark> will be vying for his third national title and first since 2009 when North Carolina (31-7) plays Gonzaga on Monday night. Jackson also had 22 points for the Tar Heels. \"We're moving on,\" said Jackson, who finished with 22 points. \"We'll get back in the gym tomorrow and probably work on a lot of free throws, but we're just happy to move on .\" Dorsey finished with 21 points and Dylan Ennis had 18 points for the Ducks (33-6), who were making their first Final Four appearance since 1939. That's when they won the inaugural crown. An all-West Coast final would've been intriguing. But Oregon was playing from behind after leading early. Meeks' dominance in the post kept his team within striking distance before a late surge helped the Tar Heels take a 39-36 lead into halftime. Meeks had 14 points on 6-for-7 shooting in the first half, while the rest of his team shot just 8-for-28 from the floor. Dorsey had just four points on 0-for-4 shooting in the first half. All-American Dillon Brooks wasn't that much better with just six of his 10 points on 2-for-7 shooting and four of his team's 12 turnovers by halftime. The Ducks stayed in the game by winning the rebounding battle early. Even without 6-10 center <mark>Chris Boucher</mark> (knee injury) in the NCAA tournament, they were tough to keep off the glass because of double-double machine Jordan Bell. Bell finished with 13 points and 16 rebounds. But he needed help battling in the paint Saturday. The Tar Heels' size eventually gained them the edge on the boards. The top rebounding team in the nation finished with 19 second-chance points on 17 offensive rebounds Saturday. Meeks opened the second half scoring twice on offensive rebounds, including an emphatic putback dunk. But he went to the bench with three fouls at 14:44. The Ducks, though, failed to take advantage of his absence. They couldn't stop Jackson. Jackson scored eight straight points during one stretch. After a few minutes, Meeks returned and immediately made his presence felt. After a missed free throw, Pinson grabbed the offensive rebound and found Meeks for a layup to take a 66-56 lead. It was basically a two-man show Saturday, but North Carolina's run to a second straight NCAA title game wouldn't have been possible without sixth-man Luke Maye's jumper with 0.3 seconds left in a 75-73 win against Kentucky in the Elite Eight. That was a fitting way to advance since the Tar Heels suffered a heart-breaking loss in last year's national championship game on a buzzer-beating three from Villanova's <mark>Kris Jenkins</mark>."}, {"articleID": "2014032809_00060879_W", "names": {"Michael Mccarthy": ["Q1933317", "Q20010903", "Q20642389", "Q3308368", "Q6832627", "Q6832630", "Q6832633"]}, "date": "2014-03-28", "url": "http://www.thebull.com.au/articles/a/45046-qantas-ff-changes-anger-customers.html", "content": "Qantas has drawn the ire of frequent flyers by cutting the number of points passengers can earn on cheaper fares as part of an overhaul of its loyalty program. Hundreds of customers have taken to Twitter or Qantas's Facebook page to voice their anger over the changes, with many calling on the airline to rethink the move and threatening to take their business to other carriers. Under the new program, effective from July, customers will earn points based on their ticket class, rather than the distance they fly. Those on sale fares will receive fewer points than those booking flexible tickets. For instance, a customer flying from Australian to London on a discount economy fare, which includes sale tickets, will receive 6,200 points, while those travelling on a more expensive flexi-saver will receive 12,400 points. Meanwhile, the airline will cut its minimum points guarantee for members flying on economy and discount economy fares from 1,000 to 800, which applies to short-haul routes like Sydney to Melbourne. The airline will also reduce the number of status credits customers earn with partner airlines, which will make it harder for some to achieve the Silver, Gold, or Platinum level within the frequent flyer program. Qantas announced the changes in an email to its nine million frequent flyer members on Thursday night, branding it a simpler and fairer system that rewards customers on higher ticket classes. \"It's all about creating a fairer, more simplified program, designed to align the number of Qantas points and status credits you earn more closely with the fare you pay, where you fly and the airline you choose,\" it said in its letter to Frequent Flyer members. CMC Markets chief market strategist <mark>Michael McCarthy</mark> said the changes were not surprising in the wake of the airline's record $252 million half year loss. \"With Qantas under pressure on all fronts, it was very likely they'd take back some of the more generous aspects of the scheme,\" he said. Mr <mark>McCarthy</mark> said the move would help lift Qantas's profit margins, which would be a welcomed by investors hurt by the airline's loss-making strategy of increasing passenger capacity to protect its market share against Virgin. \"We expect to see more moves like this as Qantas looks to build its margins,\" he said. He said that while the move had upset many leisure travellers, it was unlikely to affect Qantas's standing in the important corporate travel market. Woodside misses Israeli gas deadline Woodside Petroleum is still in talks to secure a stake in the Leviathan gas field in Israel after missing the proposed deadline for a deal. Qantas FF changes anger customers Qantas customers have taken to social media to vent their anger at changes to the airline's frequent flyer program. $A pushes towards 93 US cents A stable interest rate outlook continues to drive the Australian dollar up towards 93 US cents. TheBull's free daily and weekly newsletters Click here to receive TheBull's free weekly newsletters on stocks, trading, investing and more"}, {"articleID": "2014122123_00032787_W", "names": {"Chris Bosh": ["Q201386", "Q5105938"], "Mike Hill": ["Q1498629", "Q16192754", "Q27043626", "Q30164739", "Q484948", "Q5805741", "Q6847237"]}, "date": "2014-12-21", "url": "http://www.miamiherald.com/sports/college/football/article4772931.html#storylink=rss", "content": "Christmas downer: <mark>Chris Bosh</mark> might be out for Heat's matchup with LeBron James, Cavs Marlins' <mark>Mike Hill</mark> believes Martin Prado is an upgrade at third To place an obituary, please call 305-376-8901 or email Jameis Winston cleared of wrongdoing after FSU sexual assault conduct hearing By ILIANA LIMï ¿ 1/2 N ROMERO AND BRENDAN SONNONE Jameis Winston has been cleared of violating FSU's code of conduct. \"This was a complex case, and I worked hard to make sure both parties had a full and fair opportunity to present information. In sum, the preponderance of the evidence has not shown that you are responsible for any of the charged violations of the Code,\" retired Florida Supreme Court chief justice Major B. Harding wrote in his findings in the case, according to a document obtained by the Orlando Sentinel. Attorney David Cornwell, Winston's attorney during the hearing process, was the first to post the news on Twitter, listing a portion of the hearing finding. Winston partook in a two-day hearing Dec. 2-3 to determine whether he violated sexual misconduct and endangerment provisions in FSU's code of conduct policy during an alleged sexual assault in December 2012. The hearing spanned at least 12 hours. Winston's accuser has the option to appeal the ruling, although FSU's code of conduct provisions do not allow for entire hearing to be conducted again with a different panel. Harding indicated in his ruling the lack of witnesses beyond Winston and his accuser had an impact on his decision. \"1/8The accuser's 3/8 statements concerning the night's events have changed over time, but you one point on which she has remained steadfast is that once in your room that you had sexual intercourse with her and that she did not consent to or actively participate in the intercourse .\" You, however, vehemently contradict 1/8the accuser's 3/8 recitation of the night's events. \"Harding later stated,\" the evidence regarding the events that unfolded between you and 1/8the accuser3/8 once in your room are irreconcilable. In light of all the circumstances, I do not find the credibility of one story substantially stronger than that of the other. Both have their own strengths and weaknesses. I cannot find with any confidence that the events as set forth by you, 1/8the accuser3/8 or a particular combination thereof is more probable than not as required to find you responsible for violations of the code. Therein lies the determinative factor of my decision. \"Harding reviewed more 1,000 pages worth of evidence, including files originally generated during a sexual assault criminal investigation. Winston did not answer questions during the hearing but read a five-page written statement, a source told the Sentinel .\" Rape is a vicious crime, \"Winston's statement obtained by the Sentinel read .\" The only thing as vicious as rape is falsely accusing someone of rape. 1/8The accuser3/8 and her lawyers have falsely accused me, threatened to sue me, demanded $7,000,000 from me, engaged in a destructive media campaign against me, and manipulated this process to the point that my rights have and will continue to be severely compromised. \"1/8The accuser's 3/8 and her lawyers' public campaign to vilify me guarantees that her false allegations will follow me for the rest of my life .\" Winston's accuser, a former FSU student who withdrew from school once the charges became public, was also present for the hearing although she never was in the same room as Winston. It marks the second time Winston has been cleared in connection with the sexual assault allegation. State Attorney Willie Meggs opted not to pursue criminal charges against Winston in December 2013, citing insufficient evidence and issues with the timeline of the police investigation. Heading into Miami Beach Bowl, senior year a major positive for Memphis safety Fritz Etienne Oops, you haven't selected any newsletters. Please check the box next to one or more of our email newsletters and submit again. Oops, you didn't provide a valid email address. Sports (Monday - Friday) Heat. Dolphins. Marlins. Panthers. Get into South Florida sports with Dan LeBatard, Greg Cote & the crowd. Dolphins Get the latest Dolphins news, stats, injury reports - sent weekdays during the season. College Sports (Monday - Friday) UM & other Florida colleges: Keep up with your favorite teams. 5-Minute Herald (Monday - Friday) The best of the morning's Miami Herald."}, {"articleID": "2012042614_00041819_W", "names": {"Sarah Klein": ["Q20890164", "Q57230935"], "John Clifford": ["Q22998240", "Q6226379"], "Michael Marsh": ["Q452305", "Q6832547"]}, "date": "2012-04-26", "url": "http://manufacturing.net/news/2012/04/food-safety-experts-play-down-mad-cow-risk", "content": "food safety experts play down mad cow risk hanford, california (ap) - food safety experts played down the risk of mad cow disease entering the u.s.food supply wednesday, a day after a government agency detected the first new case of the disease in the u.s. since 2006. it was the fourth case discovered in the country, and no human version of the illness has ever been linked to eating u.s. beef. \"what we know is that 3,000 americans die every year from preventable food-borne illnesses that are not linked\" to mad cow disease, said <mark>sarah klein</mark> of the consumer advocacy group center for science in the public interest. \"things like e. coli, salmonella - that's where we should be focusing our attention, outrage and policy .\" two major south korean retailers suspended sales of u.s. beef in response. reaction elsewhere in asia was muted, with japan saying there's no reason to restrict imports. \"from simply a public health issue, i put it very, very low,\" cornell university food safety expert martin wiedmann said of the level of concern about mad cow disease. maintaining confidence in exports fuels the nation's monitoring of the beef supply as much as continuing safety concerns, he said. tuesday's news came from that monitoring: routine testing of a dead dairy cow from central california showed the animal had bovine spongiform encephalopathy, or bse, a disease that gradually eats holes in the animal's brain. u.s. health officials were adamant that there was no risk to the food supply - the cow never was destined for the meat market, and the world health organization says humans can't be infected by drinking milk from animals with bse. the u.s. has been guarding against bse for years, since a massive outbreak in britain that not only decimated that country's cattle but showed that eating bse-contaminated meat could trigger a human version of the disease. a key part of the safety net: the animal tissues that can carry the bse - including the brain and spinal cord - are removed from cattle before they're processed for food. tests are performed on only a small portion of dead animals brought to the transfer facility in central california. the cow had died at one of the region's hundreds of dairies, but hadn't exhibited outward symptoms of the disease: unsteadiness, incoordination, a drastic change in behavior or low milk production, officials said. but when the animal arrived at the facility with a truckload of other dead cows on april 18, its 30-month-plus age and fresh corpse made her eligible for usda testing. experts say it takes at least that long for the disease to develop. \"we randomly pick a number of samples throughout the year, and this just happened to be one that we randomly sampled,\" baker commodities executive vice president dennis luckey said. \"it showed no signs\" of disease. the samples went to the food safety lab at the university of california, davis on april 18. by april 19, markers indicated the cow could have bovine spongiform encephalopathy (bse), a disease that is fatal to cows and can cause a deadly human brain disease in people who eat tainted meat. it was sent to the usda lab in iowa for further testing. on tuesday, federal agriculture officials announced the findings: the animal had atypical bse. that means it didn't get the disease from eating infected cattle feed, said <mark>john clifford</mark>, the agriculture department's chief veterinary officer. it was \"just a random mutation that can happen every once in a great while in an animal,\" said bruce akey, director of the new york state veterinary diagnostic laboratory at cornell university. \"random mutations go on in nature all the time .\" in humans, experts say the disease can occur in one in 1 million people, causing sponge-like holes in the brain. but they say not enough is known about how and how often the disease strikes cattle. the disease cannot be transmitted by contact among cows, and experts say it's unclear whether this rare type of bse ever has been transmitted from a cow to a human by eating meat. the california department of public health and the state department of food and agriculture quickly worked to assure consumers that the food supply is safe - and that the cow hadn't been destined for human consumption. the building where the cow was selected to be tested sends animals to a rendering plants, which process animal parts for products not going into the human food chain, such as animal food, soap, chemicals or other household products. among the unknowns about the current case is whether the animal died of the disease and whether other cattle in its herd are similarly infected. the name of the dairy where the cow died hasn't been released, and officials haven't said where the cow was born. \"it's appropriate to be cautious, it's appropriate to pay attention and it's appropriate to ask questions, but now let's watch and see what the researchers find out in the next couple of days,\" said james culler, director of the uc davis dairy food safety laboratory and an authority on bse. the national cattlemen's beef association said in a statement that \"u.s. regulatory controls are effective, and that u.s fresh beef and beef products from cattle of all ages are safe and can be safely traded due to our interlocking safeguards .\" the infected cow was identified through an agriculture department surveillance program that tests about 40,000 cows a year for the fatal brain disease. there have been three confirmed cases of bse in cows in the united states - in a canadian-born cow in 2003 in washington state, in 2005 in texas and in 2006 in alabama. both the 2005 and 2006 cases were also atypical varieties of the disease, usda officials said. the mad cow cases that plagued england in the early 1990s were caused when livestock routinely were fed protein supplements that included ground cow spinal columns and brain tissue, which can harbor the disease. the agriculture department is sharing its lab results with international animal health officials in canada and england who will review the test results, <mark>clifford</mark> said. federal and california officials will further investigate the case. he said he did not expect the latest discovery to affect beef exports. state and federal agriculture officials plan to test other cows that lived in the same feeding herd as the infected bovine, said <mark>michael marsh</mark>, chief executive of western united dairymen, who was briefed on the plan. they also plan to test cows born at around the same time the diseased cow was. by krystal gabert, editor, food manufacturing | by lindsey coblentz, associate editor, food manufacturing do it right the first time: a dimensional engineering approach to closed-loop quality management advantage business media? copyright 2012 advantage business media you may login with either your assigned username or your e-mail address."}, {"articleID": "2011011107_00037388_W", "names": {"Ron Wilson": ["Q16968677", "Q1758337", "Q18536865", "Q45673189", "Q6382181", "Q7364544", "Q7364545", "Q7364549", "Q7364550", "Q7364551"], "Brian Burke": ["Q21063810", "Q21095479", "Q22639388", "Q364739", "Q4963227", "Q4963228"]}, "date": "2011-01-11", "url": "http://thestar.com/sports/hockey/nhl/article/919479--former-leaf-alexei-ponikarovsky-loves-l-a", "content": "los angeles-it didn't take long for alexei ponikarovsky, his wife and their three children to get used to life in sunny southern california. it's warm all the time, they live near the ocean, the los angeles kings' practice facility is five minutes away - a dream considering the l.a. traffic - and celebrities, to the delight of his oldest daughter, show up at games. \"the (kids) liked that you don't have to wear any snowpants and stuff like that,\" said ponikarovsky. \"no hats, no mitts and all that stuff .\" and my daughter met a guy from that wizards of waverly place show. she took his picture. she was pretty excited. \"ponikarovsky's on-ice adjustment has been a little more difficult. the towering winger has been injured twice this season, missing a total of 18 games. entering monday night's game against his former maple leaf teammates - his second since returning from an undisclosed lower-body injury - ponikarovsky had just three goals and four assists, a big disappointment to himself .\" for a new player, there's always an adjustment coming in, \"said kings coach terry murray .\" new team, new identity, new system. \"i thought that his game started to be pretty good about six games before he got injured again. we liked his game. he was being heavy and hard on the pucks and was being pretty physical .\" then murray let loose a refrain that was all too familiar. it could have been uttered by paul maurice when he coached the leafs, or <mark>ron wilson</mark>. \"he's a big guy, but he needs to call on himself and use that asset more than what he does,\" murray said of ponikarovsky. \"instinctively, it's not there for him .\" that's always been the knock on ponikarovsky - he's big but doesn't consistently use his size to his advantage. it's one reason leafs gm <mark>brian burke</mark> traded him to the pittsburgh penguins for luca caputi last season. it may be another reason why ponikarovsky didn't get a big contract last summer as a free agent. he ended up with a one-year, $3.2 million deal in los angeles. he'll try free agency again this summer. he did call the leafs last summer to see if they were interested in having him back. \"last summer was a tough summer for free agents,\" said ponikarovsky. \"we were trying to see what's available, who was interested. we called to see what the interest was and we ended up here .\" and as in toronto, the man they call \"pony\" is popular in the kings dressing room. careers @ the star advertise with us"}, {"articleID": "2010020118_00056119_W", "names": {"Neil Young": ["Q1361496", "Q16104585", "Q1974908", "Q48841251", "Q6265210", "Q633", "Q6989513", "Q6989515"]}, "date": "2010-02-01", "url": "http://networkworld.com/news/2010/020110-category-killer-will-iphone-be.html", "content": "with its 130,000 available apps, built-in camera and gps capabilities, the iphone sits squarely at the center of convergence. there's little question that the iphone has taken a bite out of sales of some standalone devices, notably navigation units and cheap cameras. but sony computer entertainment claims it has turned the tables on the iphone in the iphone's core gaming market: people purchase the iphone, enjoy certain games, and then get a sony psp to play it more fully. the iphone has become an on-ramp to sony psp sales, a sony executive says. wireless vs. wire line - what's right for your organization: download now five markets under siege, reports cio.com. | check out the gaming death match between the iphone and the sony psp .] \"we've seen a significant number of co-iphone and psp owners,\" says john koller, director of hardware marketing at sony computer entertainment. \"we don't view the iphone negatively in our sector. there's been more positive impact, in terms of attention turned to the handheld sector and the ability for consumers to graduate to psp after playing iphone games .\" just look at electronic arts madden nfl 10, the popular football game named after the legendary coach and television commentator, koller says. the 110 mb madden nfl 10 was one of the top games on the iphone deck when it came out on the iphone for the first time last fall for $10 (now selling for $7), whereas the 1.3 gb madden nfl 10 for the sony psp costs around $40. madden's iphone release was followed by strong sales for both madden on the sony psp and sony psp units themselves. \"it's a lag effect,\" koller says. as more and more big-name game developers target the iphone platform with sophisticated games, koller looks forward to new gamers seeking a richer gaming experience with the sony psp. this wasn't always the case. last year <mark>neil young</mark>, co-founder of iphone app game developer ngmoco and an electronic arts alum, said at the game developers conference in san francisco: \"don't let the haters tell you [the iphone] sucks compared to the ds or the psp. it doesn't. it's good .\" sony, which still views the iphone as a competitor, was also concerned about apple's penchant for pouring buckets of marketing dollars into the iphone, says koller. indeed, the iphone did become a strong gaming platform. last year, game apps, particularly role-playing ones, dominated the app store. for newer markets such as navigational devices, the iphone threatened to gobble up first-time customers who would have bought the standalone device. \"portable navigation devices are definitely under attack from smartphones with gps,\" gartner analyst van baker told cio.com in the article iphone apps: five markets under siege. \"the devices will have to get cheaper to remain viable, and that is not an attractive segment going forward .\" are you gambling with your data? it is at risk. find out and protect it. watch a step-by-step demo of how chinese hackers compromised brand name us high-tech companies like google. next-generation firewalls control applications and prevent threats."}]