[{"date": "2015-03-14", "url": "http://belfasttelegraph.co.uk/news/world-news/25-boko-suspects-died-in-custody-31066051.html", "content": "Like St Patrick, Dr Welby is a leader with great vision The participation by the Archbishop of Canterbury...Two-and-a-half years after its launch, Tinder has...Love is the greatest legacy of Simpsons creator Simon Video archive: Belfast Harbour 1954 footage of home time for workers -...The day New Zealand All Blacks trooped past Army at Ravenhill Back Then: Story of Joymount Church brought to book In my day: We quiz Carl Johannesson on the time of his life A black day when old Carnmoney blacksmith's closed Video: Irish Open 2015 launched at the Royal County Down Video: Belfast City Council - Lord Mayors mark the end of an era Video: Public sector strike - Northern Ireland's public services disrupted by...Video: HomeFinder property of the week - 3 Ardenlee Avenue, Belfast Troops on patrol in the fight against Boko Haram. (AP) Cameroon has acknowledged that more than two dozen Boko Haram suspects died in custody late last year, but a government spokesman denied the country's army was carrying out regular human rights abuses in its crackdown on the extremist group. Ikea pulls magazine site in Russia Seven dead in Serb helicopter crash The 25 suspects were found dead in their cell a day after being arrested in December, communications minister Issa Tchiroma Bakary said. They were part of a group of 56 detainees and the cause of their deaths is still being determined, he said. \"I can already state here that at this stage of investigation no evidence has been established to corroborate that these persons were deliberately killed,\" Mr Bakary said. He added that a senior military official had been removed from his post and was being investigated over the deaths, though he did not identify the person by name. In January, the Network of Human Rights Defenders in Central Africa, based in the capital Yaounde, cited \"reliable sources\" in claiming that 50 Boko Haram suspects had suffocated to death in their cells before being buried in a mass grave. The group's report accused the army of engaging in rights violations including torture \"with impunity\". Boko Haram has been fighting a near six-year insurgency against the Nigerian government, killing thousands and carrying out mass kidnappings, including of schoolgirls. The conflict has taken on an increasingly international dimension in recent months. Cameroon's northern region was repeatedly targeted by Boko Haram before the country signed up to participate in a multinational force that has dislodged the group from a score of north-eastern Nigerian towns in recent weeks. Nigeria has acknowledged it is getting help from regional security operatives amid reports that South Africa and other foreign contractors are involved in the fight against Boko Haram. Man secretly fed his ex-girlfriend abortion pills in a smoothie to force miscarriage Iceland no longer wants to be part of Europe Union - as it thinks it can get a.. . North Korea fires missiles into the sea during US-South Korean exercises Pope Francis to be greeted by bare-breasted nun billboard on visit to...Obese dog, Dennis the dachshund, loses 75% of his bodyweight and \"is no longer...Snake in cornflakes: Man finds python inside box of cereal Maho Beach plane landing: Man films jet metres above tourists on Saint Martin...Magaluf tourists face drinks ban after Northern Ireland teen girl's sex act with...Video: Irish Open 2015 launched at the Royal County Down Video: Belfast City Council - Lord Mayors mark the end of an era Video: Public sector strike - Northern Ireland's public services disrupted by...Video: HomeFinder property of the week - 3 Ardenlee Avenue, Belfast Watch: Amazing moment baby says\" hello' at 7 weeks Botanic Inn Belfast, January 2015 Northern Ireland Nightlife: Cuckoo - Winter 2014 Northern Ireland Nightlife: Sixty6, Cathedral Quarter, Belfast - Winter 2014/2015 Northern Ireland Nightlife: The Bar With No Name - January 2015 Northern Ireland Nightlife: Shine Belfast, December 2014 Northern Ireland Nightlife: Shiro State of Decay has ridiculous amount of hidden penises' \"Protestants shop at Tesco - Tuesday films for Catholics' Revealed: Who are the richest people from Northern Ireland? Apple Watch: battery disappointing and expensive Mother's Day recipe: Balsamic onion & goat's cheese tart Northern Ireland's 25 most expensive houses for sale Images from the Belfast Telegraph Troubles Gallery IRA checkpoint, the early 1970's\" src = \"http: //cdn2.belfasttelegraph.co.uk/news/article25696284.ece/c4303/ALTERNATES/w300h165/iracheckinside\" title = \"Images from the Belfast Telegraph Troubles Gallery IRA checkpoint, the early 1970's\" > The Troubles gallery - IRA checkpoint, early 1970s new Ukip MEP <mark>David Coburn</mark> is facing calls to resign after allegedly comparing SNP...'25 Boko suspects' died in custody Cameroon has acknowledged that more than two dozen...Villages wiped out by Pacific storm new The Brumbies completed a season double over the Reds in comprehensive fashion...new The Highlanders claimed a 26-19 bonus-point win as...new Singer Van Morrison says he is not a fan of the modern...new Lindsay Lohan only went on nights out because she had nothing else to do. Ryan Gosling's \"complicated women' By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2015031411_00052259_W", "names": {"David Coburn": ["Q16979872", "Q3017692"]}}, {"date": "2015-03-14", "url": "http://www.realclearpolitics.com/video/2015/03/14/krauthammer_explains_why_obama_will_have_utterly_defeated_congress_if_he_goes_to_un_over_iran.html", "content": "Krauthammer Explains Why Obama Will Have \"Utterly Defeated Congress\" If He Goes To U.N. Over Iran CHARLES KRAUTHAMMER: None of this is going to matter. It's obvious the administration wants to go to the U.N. and to cut out the Congress regardless of the legalities here. If he goes to the U.N. and he gets the Security Council to approve the deal, assuming he signs this deal, what's going to happen overnight, it will be approved and the Europeans, the Chinese and the Russians are going to end their sanctions. And that means that even if we retain our sanctions it will make little difference the sanctions regime will be over, we have seen during the months that Obama has been saying Iran is isolated and all that, delegation after delegation of Europeans and others arriving, business delegation arriving in Tehran, working out deals, anticipating that when this process is over--the one that started year and a half ago--that sanctions will be lifted they are ready to come out of the gate with billions of dollars of business which will revive the Iranian economy. At which point even if Congress hangs on to sanctions, it will make no difference. In fact it will be the worst of both worlds because we'll be cutting out--the Europeans will have suspended their sanctions. Iran will be progressing economically and we will have given Iran an excuse not to honor the agreement. So we'll have no inspections, no control and nothing and that's the strategy of the administration. Regardless of tradition or legality, if he goes to the Security Council he has utterly defeated Congress and completely overstepped his authority. Gen. Dempsey on Fight Against ISIS: \"Activities Of The Iranians Is A Positive Thing\" <mark>Jon Stewart</mark> Calls Out Hypocrisy of Right And Left For Conducting Foreign Policy Without President FP's Yochi Dreazen: Gulf States Fear An Iran With \"Hegemonic Influence\" Psaki: GOP Letter to Iran \"Brings Into Question Whether They Want To Prevent Iran From Acquiring A Nuclear Weapon\" ", "articleID": "2015031422_00012646_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}}, {"date": "2015-03-17", "url": "http://independent.ie/sport/gaelic-games/hurling/gpa-investigate-plight-of-departed-clare-duo-following-squad-humiliation-31071818.html", "content": "Clare boss Davy Fitzgerald congratulates <mark>Tony Kelly</mark> after his man-of-the-match display against Dublin on Saturday Comments Davy O'Halloran and Nicky O'Connell were apparently disciplined for being on a \"night out' prior to a league fixture last month. A third player is also understood to have been disciplined but has not left the squad and was a visible presence on the day of the Tipperary game though he was not involved. However, O'Halloran stressed over the weekend that he had not been drinking as alleged. He spoke of being\" humiliated \"by what he was asked to do and hit out at alleged double-standards, claiming a more senior player had also broken the disciplinary code set out at the start of the year. However, Clare manager Davy Fitzgerald stressed after Saturday's win over Dublin in Ennis that such an allegation of double-standards was\" 110 per cent \"not true. It has attracted the attention of the GPA who confirmed yesterday that they had begun to explore the matter but were not prepared to make any comment. Realistically, there are few avenues open to the GPA on this matter. Neither player made contact with the players' association, nor did the player representatives bring it to their attention. Instrumental It is understood that the Clare squad members themselves were instrumental in establishing a code of discipline that involved a ban on alcohol consumption at certain times of the season. However, it is not clear if the exact nature of the punishments were agreed upon by the players. O'Halloran has alleged that he and <mark>O'Connell</mark> were forced to train on their own, could not interact with any other squad members, could not wear Clare gear to training and were not going to be part of any match-day squad for the remaining Division 1A games in the league. It is nothing new for players to break agreed codes of discipline and be dropped from squads in the past. However, some of the punishments in this instance, as alleged by O'Halloran, are quite extreme. Donegal's Kevin Cassidy lost his place on the squad for his revealing insight into the their 2011 campaign, the first year of Jim McGuinness' management, in the book\" This Is Our Year'. Last year a prominent member of a football squad was left out for a month of pre-season because he had made critical comments in the media about their previous management. For Fitzgerald and his management, it has been a testing number of months since their exit from the 2014 championship. He lost highly respected coach Paul Kinnerk and another valued member of the backroom team, strength and conditioning coach <mark>Joe O'Connor</mark>, after last season. Kinnerk had a big influence on shaping the style that Clare developed to win an All-Ireland title in 2013 and three All-Ireland U-21 hurling titles from 2012 to 2014. He built up a great rapport with the younger members of the squad and they may have felt his absence in recent months. The Clare management's position not to embrace dual players forced Podge Collins to make a choice and he opted for his father Colm's football squad. Apart from his obvious skill set Collins was a popular member of the Clare squad and his absence has also been felt in that respect. But if morale has been in any way dented by O'Halloran's revelation, it certainly wasn't apparent when Clare hauled themselves from six points down against Dublin with 14 men after Brendan Bugler's dismissal to win by two. That will certainly have heartened Fitzgerald. Bugler's tweet afterwards about \"togetherness\" didn't point to a squad that's about to fragment. Meanwhile, Lar Corbett has confirmed his future as a Tipperary hurler is in doubt because of ongoing knee problems. Corbett is not currently part of the Tipperary squad as he battles the injury. \"The knee has been an ongoing problem. I honestly don't know one way or another. I'm doing a bit of work myself - that's just the way it is. I'll have to see how it is over the next month. I'll know then,\" he said. Corbett was troubled by a similar complaint last year and missed the Allianz League campaign. \"It's the same problem as last year. That's just the facts of it. I'll have to deal with it. If I get over it, I get over it, if I don't, I don't,\" he said. No end to Shefflin's hunger in most decorated career of all Colm Keys There surely isn't a better example to encapsulate the drive in Henry Shefflin than his decision to forego a team holiday with Kilkenny in Florida last December, possibly his last with a group of players that...Mulcahy eyes \"milestone' title for Limerick hurling Until this year, Kilmallock's Graeme Mulcahy assumed someone from Limerick had been to the top of the tree in the club scene. Experience can take Shamrocks to sixth club title Tipp edge Kilkenny closer to drop zone Clare hurling boss Davy Fitzgerald cuts RTE interview short after he was quizzed about...Bennett leads Deise rout to step up push for promotion Defiant Davy Fitzgerald spared by spirited comeback Rebels survive dramatic finale to book quarter-final spot POLL: The water charges have been revealed - do you intend on paying the...Woman set to become Ireland's youngest granny - aged 29 150 Shades of Green: Global landmarks light up for St. Patrick's Day Soapbox: Here's what matters to Enda and his ministers Cheap health cover forcing patients on to waiting lists\" We can't pretend we're all the same, this equality debate is losing that' - Senator Fidelma Healy Eames defends controversial same sex marriage tweet Lucinda Creighton slams RTE interviewers after Late Late grilling Woman set to become Ireland's youngest granny - aged 29 What do Ireland need to do to win the Six Nations? Final day permutations Welsh rugby legend praises one of the greatest games he has ever seen <mark>Rodgers</mark> targets top two Liverpool manager <mark>Brendan Rodgers</mark> has targeted a top-two finish in the Barclays Premier League after seeing his side...Smalling: United can overhaul City Chris Smalling insists Manchester United are capable of overtaking bitter rivals Manchester City...Sense of purpose driving Slaughtneil's bid for glory It's not a feeling of invincibility, but after all the late drama and one-point victories en route to the AIB All-Ireland club football final, there is a.. . McGinley's fingers crossed that Tiger turns up at Augusta and takes spotlight off McIlroy TIGER WOODS will do Rory McIlroy a favour if he tees it up at...Deal gives Rory licence to print money, time to thrill RORY McILROY crossed a major career threshold last night with the announcement that he has...Atletico Madrid on brink Hard WORK is the only way Atletico Madrid can end a poor run of form as they battle to stay in the Champions League,...Atletico want to take back Chelsea's Luis Filipe Luis could be offered a quick return to Atletico Madrid with the Spanish club...Silva drawing inspiration from Schalke's Madrid heroics \"La SEMANA MAGICA\" read La Vanguardia's headline yesterday, above a piece...Rice backs Hoops' midfield stars to bring good times back to Tallaght Gus Poyet has been sacked by Sunderland, with just nine games of their faltering Premier...VIDEO: Everton 3-0 Newcastle: <mark>John Carver</mark> unsure about Coloccini's red card Newcastle's caretaker manager <mark>John Carver</mark> admits that he is...VIDEO: Celtic see off Dundee United in Scottish League Cup final Ronny Deila captured his first trophy as Celtic manager as...VIDEO: Jose Mourinho bemoans penalty decision Chelsea boss Jose Mourinho believes a wrongly-awarded penalty in the 1-1 draw with...VIDEO - Reddan: \"It's all about the Scotland game now' Leinster & Ireland scrum half Eoin Reddan spoke after the defeat to Wales. VIDEO:\" It's one of the best feelings I've ever had in a Wales shirt' - Sam...Man of the match and Wales captain Sam Warburton said the...VIDEO - <mark>Schmidt</mark>: \"If you throw the baby out with the bath water, it's hard to start all...Ireland coach <mark>Joe Schmidt</mark> and captain <mark>Paul O'Connell</mark> gave...VIDEO: We were screaming for the ball out wide - Tommy Bowe Ulster & Ireland winger Tommy Bowe spoke after the...VIDEO: Six Nations Report -\" Ireland not clinical enough at the moment' Ireland's Grand Slam dreams were shattered in the Millennium...VIDEO: Manuel Pellegrini insists Manchester City players won't intimidate referees Manchester City manager Manuel Pellegrini insists his players will...Kai Rooney lines out for Manchester United as club mascot In Pictures: Irish Independent My 1000 hours 5/10k run In Pictures: Cricket World Cup South Africa v Ireland #IREvENG #6Nations: The best images from Ireland vs England at the Aviva Stadium, Dublin Ireland vs England Six Nations - Classic pictures from the archives Gallery: 20 pics from the night England thugs rioted in Lansdowne Road By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2015031707_00064959_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "Joe O'Connor": ["Q16197145", "Q52301651", "Q6211592"], "Joe Schmidt": ["Q284169", "Q6280152"], "John Carver": ["Q1330261", "Q6225403"], "Paul O'Connell": ["Q2038034", "Q7152770"], "Tony Kelly": ["Q16195148", "Q7822698", "Q7822699", "Q7822700", "Q7822701", "Q7822703"]}}, {"date": "2015-03-17", "url": "http://www1.skysports.com/football/news/11679/9763187/david-silva-believes-manchester-city-have-nothing-to-lose-in-barcelona", "content": "<mark>David Silva</mark>: Manchester City playmaker remains optimistic <mark>David Silva</mark> believes Manchester City have nothing to lose as they head into Wednesday's crunch Champions League game at Barcelona. City travel to the Nou Camp needing to overturn a 2-1 deficit to reach the quarter-finals but Spain international <mark>Silva</mark> is taking succour from recent history. Not many thought PSG could beat Chelsea, especially with only 10 men for so long, so I know that everything can happen, not only in the Champions League but in every game. \"Not many thought PSG could beat Chelsea, especially with only 10 men for so long, so I know that everything can happen, not only in the Champions League but in every game. Get Sky Sports City - beaten by Barcelona at the same stage last season - needed victories over Bayern Munich and Roma to progress from their group, successes which give <mark>Silva</mark> more cause for optimism. He said:\" We need this kind of mentality we showed in those games. \"The most important thing is not to concede a goal because obviously things then become more difficult. We played well in the second leg against Barca last season and played with freedom so we will see .\" ", "articleID": "2015031709_00028693_W", "names": {"David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"]}}, {"date": "2015-03-17", "url": "http://nationalinterest.org/node/12433", "content": "It's true: Israeli Prime Minister Benjamin Netanyahu stood before Congress and cast a critical lens on the Iranian nuclear deal being cooked up in Washington. Yet, despite President Obama's assertion that \"there was nothing new\" in the speech and that \"the prime minister didn't offer any viable alternatives,\" the Israeli leader actually did propose some reasonable options that bear consideration. The first is making the \"sunset clause\" conditional upon Iranian behavior, not an arbitrary timetable. The current terms under discussion call for a deal that would expire in around 10 years, at which point Iran would be allowed to operate an unlimited number of centrifuges, of unlimited sophistication, to enrich an unlimited amount of uranium. The narrow focus on Iran's nuclear program in the current grand bargain misses the reality that this issue is but the latest bone of contention between Iran and the West. Without nuclear weapons, Iran is still the foremost sponsor of international terrorism with terrorist networks active on five continents. With its recent expansion through terrorist proxies, Tehran now controls four Arab capitals in Lebanon, Syria, Iraq, and Yemen. Without a definitive change in the regime's behavior, other Arab states won't wait around until the deal expires to acquire their own nuclear capabilities. The Middle East nuclear arms race would begin in earnest immediately. Therefore, any sunset provision should be behavior-based, not time-based. The Israeli leader also raised the issue of verifying Iran's compliance with a deal. This is especially important given that Iran's past nuclear efforts have largely been clandestine or undeclared. The International Atomic Energy Agency (IAEA) can only report-not prevent or punish-violations of the agreement. And that's only if the nuclear watchdog knows the full breadth of Iran's nuclear program and has unfettered access to any site it chooses. Just this month the IAEA, declared - not for the first time-that Iran was being dilatory in its cooperation with the agency. What about violations? If the central point of an agreement is deterrence, then the penalties need to be agreed upon upfront, not debated as they occur, or worse, debated if they even happened depending on how one reads the deal. Another point Netanyahu raised was the size and scope of the nuclear infrastructure Iran would be permitted to keep. The current discussions would allow for Iran to operate around 6,500 centrifuges, but according to the IAEA former deputy director-general, <mark>Olli Heinonen</mark>, that number goes well beyond what is needed for civilian applications. This issue involves a combination of the number and quality of the centrifuges, their output, and the percentage of enrichment allowed. Finding the right number gets to the heart of the agreement as the only argument in favor of the deal that holds any water is that it would keep Iran at least one year away from being able to breakout toward nuclear weaponization-at least during the period of the agreement. That leads to another problem, which is that American and Israeli intelligence assessments differ over how fast Iran would be able to race toward a nuclear weapon. Netanyahu described the discrepancy as \"about a year by U.S. assessment, even shorter by Israel's .\" The difference is key because according to U.S. officials, the deal is designed to allow Iran to become a nuclear threshold state, just a year away from making the plunge if it decided to break off the agreement. As Robert Satloff, Executive Director of The Washington Institute for Near East Policy pointed out, it is questionable whether U.S. analysts can know with certainty if Iran's breakout capability is really one year. Indeed, given the aspects of the program not covered by the agreement, it is unlikely that a year of warning time would remain after three, five, or ten years of the deal. To allay the concerns of critics, the White House might offer Israel a \"nuclear guarantee\" as former American envoy to Israel, Martin suggested. But such an offer is undercut by the perception that the U.S. is retreating from the region, doesn't honor its international commitments, and does not enforce its own red lines such as those drawn in Syria. And why would Israel put its survival in American hands, especially with an administration that has proven so publicly hostile toward the Jewish state? America's word is not what it used to be. The Making of Future American Grand Strategy Unlocking the Puzzle of China's Neutron Bomb Securing Operational Access: Evolving the Air-Sea Battle Concept", "articleID": "2015031715_00059534_W", "names": {"Olli Heinonen": ["Q11885409", "Q16298772", "Q7088295"]}}]