[{"articleID": "2018021405_00016854_W", "names": {"Cristina Garcia": ["Q5186348", "Q5186349", "Q57422352"], "Jerry Brown": ["Q152451", "Q717620"]}, "date": "2018-02-14", "url": "http://www.lockportjournal.com/news/local_news/why-i-m-glad-not-to-be-rich-and-famous/article_6d05557f-74bd-592d-ade0-8cb846f7927f.html", "content": "Me too. I don't agree with everything President Trump says, but I think he hit the nail on the head with his Tweet about #MeToo over the weekend. He tweeted, \"People's lives are being shattered and destroyed by a mere allegation. Some are true and some are false. Some are old and some are new. There is no recovery for someone falsely accused - life and career are gone. Is there no such thing any longer as Due Process?\" I too have been accused of sexual misconduct. I was walking behind a temporary employee where I worked. Due to the cooler temperatures in the plant, I was wearing a \"hoodie,\" which was unzipped. All of a sudden she jumped up and started yelling that I had touched her bottom (not the word she used). I'm guessing my sweatshirt may have brushed her. I denied it but by the time she hit the front office, her story had changed. Now I had \"groped\" and squeezed her butt (again not her word). I was called to the front office to answer to these allegations and when the new scenario was presented to me, I actually saw red. Obviously my sweatshirt has a life of its own if it can grope someone. Let me say at this point that I have been very happily married since 1969. I have never been unfaithful despite a few opportunities. I respect the sanctity of marriage and take the oath \"'til death do us part\" very seriously. An allegation of this sort was like taking a bullet to everything I believe in. I was so livid about these lies, I told my supervisor that if he entertained any notion these allegations might be true I would punch out, get my stuff and they would never see me again. I had worked for this business for over 25 years and had a spotless record. I never even had an attendance problem. An allegation like this had the power to negate everything I worked my entire life for. Fortunately, my record spoke for itself and my supervisor told me they didn't believe anything that my accuser had said. She was gone the next day. Fast forward to today. If she were to make these accusations now, I would have been fired or suspended without pay pending an investigation. After an investigation I am certain that they would have to believe her story and I would have been terminated. I now see <mark>Cristina Garcia</mark>, a leading figure in California's #MeToo movement, has been accused of groping a male staff member from another politician's office. Ms. <mark>Garcia</mark> was a fierce advocate for legislation signed by Governor <mark>Jerry Brown</mark>, giving legislative staff members whistle blower protections for reporting sexual misconduct or other misbehavior. She has tweeted repeatedly about the importance of sexual consent in recent days. She allegedly rubbed former legislative staff member Daniel Fierro's back, gripped his buttocks and tried to feel his crotch in the dugout at an amateur softball game in 2014. Earlier this month, film star Catherine Deneuve and a group of 100 French women signed a letter that defended a man's right to flirt with women and claimed the #MeToo campaign promotes puritanism. Some observers have said the largest problem with the anti \"sexual harassment\" movement is that it's taking attention away from people who are molested, raped or otherwise sexually assaulted. I think we all have, at one time or another, been guilty of giving someone a hug in congratulations or possibly touching somebody in our youth. If we classify all \"petting\" as sexual harassment, many men and women may as well just quit their jobs. We may as well eliminate all dating, eliminate all love and just go with arranged marriages. Recently I told my wife I was afraid of her accusing me of sexual misconduct because while we were going out, I touched her without a signed, written waiver, in triplicate, notarized and filed with the county, before I proceeded. She said she wasn't inclined to file a complaint against me, because she knows how much money I have, where I keep it and it just isn't worth the effort. When I think about the number of girls I groped or who groped me when I was a teenager, I'm glad I never became rich or famous. Norb Rug resides in Lockport. Write to him at nrug @ juno.com."}, {"articleID": "2017030203_00391133_W", "names": {"Michelle Martin": ["Q2145289", "Q547953"]}, "date": "2017-03-02", "url": "http://stuff.co.nz/timaru-herald/sport/89916581/south-canterbury-rugby-union-returns-to-the-black", "content": "South Canterbury Rugby Union returns to the black STU PIDDINGTON Last updated 16:17, March 2 2017 John Bisset Alpine Energy Stadium's future is up for discussion. The South Canterbury Rugby Union is back in black, announcing a small profit at their 128th annual general meeting. The union made a surplus of $27,365, thanks to receiving a grant of $36,150 for their new scoreboard, otherwise an operational loss of $8786 would have occurred. While there was an increase in expenditure by $59,415 to $871,750, due to the appointment of a full time chief executive and increased maintenance costs at Alpine Energy Stadium, revenue also increased by $58,665. Tetsuro Mitomo/Fairfax NZ South Canterbury Rugby Union chief executive Craig Calder is keen to see Alpine Energy Stadium used more. Wages and salaries also increased to $278,016 over the 3.8 full time staff employed by the union plus some casual staff, who had a only a small impact on the figure. Outfitting eight representative teams from under 48kg to the Heartland side cost $59,665 for off field gear including hoodies, tops, bags and caps and alike. . Comparisons against the previous financial year were not available in detail as the union had changed its accounting system. The meeting also voted to change the financial year to finish on December 31 to fall in line line with New Zealand Rugby and most of the other unions. Chief executive Craig Calder said it was important to note that half of the union's came from New Zealand Rugby by way of grants, with $462,000 expected next year. \"We have key performances indicators to meet to protect that income .\" Declining player numbers in teenage boys rugby remained a concern, which was offset in part with the growth in the women's game, he said. Ad Feedback Calder said it was not easy to arrest the decline with 104 players gone in the 15 to 20-year-olds last year. Off the field the union was undertaking a feasibility study around the future of Alpine Energy Stadium, he said. It would address the redevelopment of the No. 1 and-or No. 2 playing surface. Also included was whether the damaged east stand should be repaired or redeveloped, as well as identifying the long term structural integrity and future of the main stand, including the lounge. The development of women's changing facilities, including showers, as well as access, driveway and parking to meet compliance issues were also part of the study. Calder said the union had also committed to several capital projects including new stairs to the broadcasting tower and barriers on top, renewing all the seating on the main stand as well as an upgrade of the changing rooms and offices, including new office equipment. No voting was required to fill any of the office bearers as there was only one nominee. Ranfurly Shield winning winger Murray Roberts was elected president, with his 1974 team-mate Neville \"Ru' Twaddell confirmed as vice president. Grant Norton was re-elected on to the board, with lawyer Craig O'Connor stepping down after nine years service. No further independent was needed to be appointed in O'Connor's case as the board had carried an extra person. Pat Scott was elected patron again while Colin Clemens retained his role as the liaison to the New Zealand Rugby Foundation. Long serving senior representative manager Cedric Coll was elected a life member. SCRU board: Ray Teahen (chairman), Brent Isbister, Steve McCoy, Grant Norton, <mark>Michelle Martin</mark>, Vaughan O'Shaughnessy, Jeremy Sutherland and Murray Roberts. - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Sport story: South Canterbury under perform at Hawke Cup level but show plenty of promise Timaru Herald Homepage"}, {"articleID": "2017121320_00048820_W", "names": {"Ross Tucker": ["Q47127665", "Q7369680"]}, "date": "2017-12-13", "url": "https://cyclingtips.com/news/tucker-analyses-froome-case/", "content": "Froome's salbutamol case, The Secret Pro's reaction: Daily News Digest by Shane Stokes December 14, 2017 Chris Froome urine test reveals twice the legal amount of Salbutamol; Nibali on Froome salbutamol case: No one can give me back the thrill of winning the Vuelta; Vuelta a España expresses \"extreme caution' about Froome situation; The Secret Pro: My thoughts on Froome's positive and the bikes we ride; <mark>Tucker</mark> analyses Froome case; INRNG on what comes next for Froome; Ewan confirmed for Tour de France debut in 2018; Stig Broeckx pushes through rehab; Aqua Blue reveals 2018 kit <mark>Tucker</mark> analyses Froome case by CyclingTips Link has been copied to your clipboard! <mark>Ross Tucker</mark> is the author of the Science of Sport website and also a sport scientist. He has been known for questioning Team Sky and Chris Froome, and wrote a long and interesting post after Wednesday's big news broke. Here's an excerpt:\" At the time, WADA's decision to classify salbutamol as a \"threshold drug\" (rather than being completely banned unless a TUE is obtained) was not entirely uncontroversial. Here's one quote, which I think you'll find is relevant as we explore the Froome situation further: \"Michel Rieu, scientist at the French Anti-Doping Agency, [said that] salbutamol should remain banned in any concentration. Rieu said to L’Equipe that in order to reach the 1000 ng/ml threshold,\" you really have to mess things up and not follow classic doping protocol. Those who cheat use salbutamol as a cure, out of competition, and are careful not to reach these kind of concentrations during competition. \"So, all of that history brings us to Chris Froome, whose urine contains levels that exceed the threshold by 100%. 2000 ng/ml vs 1000 ng/ml. Twice as high. That's a big miss. Like going out to buy a TV with a budget of $1000 and coming home with an 84 inch flat screen and surround sound speakers. It would take some pretty remarkable adjustments in dosage, or (possibly normal, mind) pharmacology, to clear the bar by that amount. The first thing I read in response to this story was the following quote by Froome:\" My asthma got worse at the Vuelta so I followed the team doctor's advice to increase my Salbutamol dosage. As always, I took the greatest care to ensure that I did not use more than the permissible dose. \"So with\" the greatest care \", Froome and a doctor, working together, with years of experience using this very same drug in stage races, managed to miss the mark by 100%? They missed the upper allowable limit by a factor of 2? See the full analysis here. The CyclingTips Daily News Digest features the most important and interesting news and content from around the cycling world, published every weekday morning at 9am AEST. Get it delivered straight to your inbox."}, {"articleID": "2009122915_00134610_W", "names": {"Mick Mccarthy": ["Q40063430", "Q437925"], "Peter Reid": ["Q2077801", "Q360514"]}, "date": "2009-12-29", "url": "http://football365.com/story/0,17033,8652_5808640,00.html", "content": "wigan head to old trafford to face manchester united on wednesday night with manager roberto martinez insisting his side have improved immeasurably since they last met. on that occasion, back on august 22, the latics conceded five having held the defending premier league champions at bay for 56 minutes. martinez always stressed the result did not do his side justice and believes they are much better equipped to cope with united. \"we all know the 5-0 defeat was not a clear reflection of the performance, when i was very pleased for 60 minutes,\" said the spaniard. \"we are a different team to the one in the first half of the season .\" physically we are a lot stronger, the partnerships are there, the players have a clearer understanding and we can change things around a bit. \"tactically we are more multi-dimensional and in every aspect we have improved .\" there is still a long way to go because we are very thin on numbers and the way we want to play we need to have that extra support. \"but we hope we can make our fans proud .\" boxing day's 1-1 draw at home to blackburn saw martinez keep the same 11 players on the field for the full 90 minutes - mainly to give those who had been so poor in the first half chance to redeem themselves. even with a couple of days' extra rest compared to most sides he is considering making changes, although he will not follow the controversial move of wolves manager <mark>mick mccarthy</mark> who made 10 changes for their recent trip to old trafford. \"we cannot afford to do it because we are quite thin in numbers in that respect but we go into every game trying to win,\" said martinez. \"what happened in the first half (against blackburn) had certain needs and we changed things around but had to keep those players on the pitch .\" manchester united are completely different opposition with different demands and tempo in the game so everyone should be ready. \"the players that were on the bench could have a good chance to be involved because we need absolutely everyone and everyone has an opportunity to play .\" every club has a different agenda but where we are now we want to go anywhere in the premier league and try to win a football game. \"we approach the game at old trafford with a big smile, praying and hoping the christmas spirit will be with us. you need to try to get some positives out of it .\" martinez can at least expect a warm welcome from counterpart sir alex ferguson after the spaniard revealed they have been able to \"laugh off\" the media storm which they were caught up in recently. a spanish newspaper, in late october, attributed comments to the latics boss which claimed the football association were afraid to punish ferguson. the comments, which martinez categorically denies making, also suggested the likes of blackburn and everton managers sam allardyce and david moyes were staunch defenders of the united boss and that liverpool boss rafael benitez was being targeted with constant sniping. however, martinez had a pre-christmas meal with ferguson, allardyce, moyes and stoke assistant <mark>peter reid</mark> and the wigan boss said the incident was not an issue. \"it has happened to many managers in the past and it will happen in the future,\" said martinez. \"what is important is to put the record straight and make sure the names that are involved have a clear understanding of what has happened .\" once that is done it is quite simple to understand because we have all been in a situation when we know how exposed we are and how easy it is for it to happen. \"i think we have got a good relationship, good enough to laugh off these situations .\" it is not an issue and it does not put any strain on our relationship at all. \"hull city 20.00 dec 30th 2009 2 - 2 sunderland chelsea 2 - 1 fulham everton 2 - 0 burnley stoke 0 - 1 birmingham tottenham 2 - 0 west ham wolverhampton 3 - 0 aston villa hull"}, {"articleID": "2012091112_00095440_W", "names": {"Bruce Taylor": ["Q2925084", "Q4978348", "Q4978350", "Q4978351", "Q4978352"], "Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"], "James Gayle": ["Q15694099", "Q6134541"], "Michael Cole": ["Q1562857", "Q18530374", "Q1927177", "Q57296", "Q6829340", "Q6829341"], "Demolition Man": ["Q1344532", "Q201608"], "Jason Campbell": ["Q19606939", "Q22003549", "Q82118"]}, "date": "2012-09-11", "url": "http://blogs.roanoke.com/andybittervirginiatechfootball/2012/09/10/on-second-thought-lb-bruce-taylor-says-hell-play-saturday/", "content": "frank beamer might have had doubts as to whether <mark>bruce taylor</mark> would be ready to play saturday against pittsburgh, but the senior linebacker was unequivocal about it. \"it's doing good,\" he said of his sprained ankle. \"yes, i will be playing .\" <mark>taylor</mark> dressed but was kept out of the austin peay game as a precautionary measure after spraining his against georgia tech last monday even though he wanted to play against the governors. instead, he stood on the sideline, donning a baseball cap with his helmet nowhere in sight. he was in a blue, limited contact jersey monday but defensive coordinator bud foste r said he was moving around well. fellow inside linebacker tariq edwards, meanwhile, continues to be in blue because of his knee. he was favoring his leg noticeably at the end of practice and, from all indications, will likely not make his season debut this weekend. \"tariq, there will be some things that he'll have to go through, do some contact, do some things and get his timing back,\" foster said. \"but i know that he's a guy that i trust. but we've got to see if he can go and do it too. i'll be anxious to see if he can go do it. he looks better and better and i think mentally he feels better and better and i think that's a big part when you have those type of injuries .\" receiver d.j. coles was also a surprise player in blue monday, although beamer said on tech talk live that he's still out for the season because of a knee injury. the coach wants to keep him around football for the time being. facebook. here are some more notes and quotes from monday interviews? i did not see center <mark>andrew miller</mark> out at practice near the end monday, although there were a lot of guys and it was difficult to spot them with their jerseys off. he appeared to leave saturday's game early with an ankle injury. defensive end <mark>james gayle</mark> had a wrap on his shoulder, something he hurt after one play against austin peay when he hit the quarterback, but he should be fine. foster likened playing pittsburgh to \"playing a wounded animal. they're going to be backed up in a corner .\" he said despite what the first two games have shown that the panthers still are a physical group with a dynamic tailback (ray graham). \"they're playing a quality opponent in us and they're going to play their tail off,\" he said. \"we expect that .\" foster said the hokies have looked at lot of wisconsin film to see what first-year pittsburgh head coach paul chryst will do saturday. chryst was the badgers' offensive coordinator for seven years before going to pittsburgh and taking much of his offensive staff with him. \"they're doing the same the same stuff,\" foster said. \"the coordinator, they've got another guy calling plays, but one of his guys. they're running the same routes, the same offense, they're doing with pitt that they were doing with wisconsin. but you know, it takes baby steps. they've been there 15 days of spring and a month and a half [this season]. i'm sure they want to build a foundation to the program. it looks like they're working that way. foster noted a few backups that had solid games against austin peay in what was really their first extended action: de dadi nicolas, cb donaldven manning, s <mark>michael cole</mark>, lb deon clarke and lb chase williams .\" you've got some guys who took a step right there, \"he said .\" and we may need them down the road. \"plenty of stuff on rover kyshoen jarrett tonight. i plan on writing something on him for wednesday's paper. here's what secondary coach torrian gray had to say about him:\" just from a physicality standpoint, when the lights went on, i wasn't sure if i was going to get the kind of player we've seen these first two games. after that first game and he came up with the physicality that he came with, it gave him confidence. \"(jarrett, by the way, is a pennsylvania native who was a former pittsburgh commitment until dave wannstedt got run a few years ago .) as for cb antone exum, gray thought he wasn't as sharp in the second game .\" first game he was great, \"gray said .\" second game he was very inconsistent. \"gray said exum's technique needs to be cleaned up, things like lining up with the right leverage .\" as good of an athlete that he is, there's still some things that you've got to go through that, ok, ok, and he's just going through that, \"gray said .\" it's still a new position for him, so he'll be fine. \"exum said he owed safety detrick bonner some gratitude for breaking up a long pass after an austin peay receiver got by him on a double move. bonner came over the top and leveled the receiver, jarring the ball loose for an incompletion .\" i thanked him right on the field when it happened, \"exum said .\" i don't know if y' all saw it. we were celebrating right on the field because if it wasn't for him? we game-planned on them running that throw, so i was going to jump it. any sign of him stopping, i was going to go jump it and try to make a play. when he did that and took off? we hadn't seen a double move all week on film from those guys, so i'm just glad he was able to come over and make a tremendous play. \"exum brought back the blond mohawk (or the simon phoenix look from\" <mark>demolition man</mark> \") because he felt like it was kind of his trademark .\" i had to get back, \"he said .\" i played well with it last year when i had it, so i had to get it back. \"he said his teammates don't give him as hard of a time about it as they did last year .\" they kind of went away from the jokes this year because i wore them out, \"he said .\" it's fun. \"linebacker jack tyler proudly sported a washington redskins t-shirt today after watching rookie quarterback robert griffin iii lead them to a season-opening win against new orleans on sunday .\" i actually just bought my super bowl tickets yesterday after the win, \"he joked .\" so i'll be there in february. \"tyler likes what he sees out of rgiii .\" it's fun to watch him, \"he said .\" he just looks like he's having fun out there. back when we had <mark>jason campbell</mark> and those guys, i always thought they were having a terrible time out there. he looks like he's having fun. every throw that he made yesterday, i was energetic about it and i thought that a big play was about to happen. that's something you don't get out of a lot of quarterbacks. \"apparently that wasn't the case with rex grossman .\" rex grossman is not my guy, \"tyler said with a laugh .\" something about him just never really appealed to me. \"tyler is apparently a nice guy on the field. too nice, according to <mark>taylor</mark>. tyler helped give a lost shoe back to an austin peay player during saturday's game .\" i just remember making the tackle and i feel like i missed the tackle and i came back and i just had his shoe in my arms, \"he said .\" what's the point in just throwing it? i just thought i'd give it back to him. i thought i'd be a nice guy about it. it's football. i like to have fun. i'm not one of those guys who is nuts and crazy on the field and is always screaming and yelling. i have my moments where i get energetic after a big play and like to show emotion, but for the most part i'm really relaxed out there. \"<mark>taylor</mark> gave him a hard time about it .\" apparently that's how you play good defense is you throw shoes at people, \"tyler said .\" i just thought i'd be a good samaritan and help him out. \"hokies kicker cody journell, two others arrested, charged with breaking and entering in alleged home invasion looking back at virginia tech's sugar bowl loss to michigan: notes and quotes from the post-game we'd like your feedback on virginia tech's sugar bowl ticket sales practice report: hokies change up spring game format; shane beamer takes a dig at uva hokiefan: you're kidding right,\" truth be told \". everyone in the country starts out with cupcakes,...mark: the hokies had to play austin peay this year as ecu was cancelled to make room for alabama next year. secondly,...zman: espn3 didn't work for me this week and neither did all-access. at least i can see this one. trevor: that camouflage uniform combination is starting to grow on me. i just hope i don't get crossed eyes ..."}, {"articleID": "2012103114_00020937_W", "names": {"Jimmy Page": ["Q10426092", "Q165467"], "Ronnie Wood": ["Q211094", "Q7366031"]}, "date": "2012-10-31", "url": "http://nme.com/news/kasabian/66913", "content": "photo gallery: kasabian photo: andy willsher/nme reading & leeds festivals, will play a headline set in the austrian alps at the shindig, which will be held between april 1-6 next year. the band will perform twice - once as headliners and a second, more intimate set. acts already confirmed for snowbombing 2013 include skream, toddla t, scuba, fake blood and carl cox. last year, the festival was headlined by and fatboy slim. speaking about their performance at reading & leeds earlier this year, kasabian guitarist serge pizzorno told nme in a video interview, which you can watch below: \"it's hard to put into words? i thought there were seven levels and there's actually eight. we got to the eighth level last night. it was absolutely unbelievable. the crowd? we flew out of this universe .\" nme.com/tickets now, or call 0871 230 1094. previous: bon jovi announce dates on cut-price uk tour madness launch appeal for saxophone lost after' x factor' performance cat power may cancel tourdates due to bankruptcy and poor health nirvana's smashed \"smells like teen spirit' guitar up for auction <mark>jimmy page</mark> remastering led zeppelin albums for 2013 boxset release the rolling stones play another secret show in paris last night (october 29) the rolling stones' <mark>ronnie wood</mark> to marry girlfriend sally humphreys subscribe to nme and save over 40% includes ipad edition at no extra cost!"}, {"articleID": "2018072809_00050040_W", "names": {"Thiago Silva": ["Q210453", "Q59245327", "Q604996", "Q7783822"]}, "date": "2018-07-28", "url": "https://www.football365.com/news/sokratis-things-will-be-much-better-in-arsenals-defence", "content": "Home Arsenal Sokratis: \"Things will be much better' in Arsenal's defence Share this Page Sokratis:\" Things will be much better' in Arsenal's defence Date published: Saturday 28th July 2018 9:09 Sokratis has explained how \"things at the back will be much better\" for Arsenal this season. Arsenal purchased Sokratis from Borussia Dortmund for £ 17.7 million this summer, arriving as instead of a marquee signing. a warrior The Greece international has echoed that sentiment with an insight into new manager Unai Emery's tactical preparation. \"A lot of coaches and a lot of teams now look at only how to play, not how to defend,\" Sokratis said. \"But with the new coach we work also on the situations when we don't have the ball and this is very important .\" On the first day, the coach worked on this. \"With him, all the players we work on tactics, we look a lot at videos, what was wrong, what we have to do better .\" I think and hope this year things at the back will be much better. \"Thirty is the best age for a defender, so for the next three or four years I would like to give everything for the team. I want to win with this team .\" With Borussia, with Milan, with Genoa, for 10 years now I have been outside Greece and of course I have experience. \"I feel very good and I'm working on the pitch and also off the pitch to help all the young guys to be very good with us .\" I am here to show I am first a defender and after that comes everything else. \"I played with Nesta, that was one big school for me .\" Also with <mark>Thiago Silva</mark>, great players to learn from--they were defenders who were defenders first. \"I learned a lot and now I am ready to give what I know .\" "}, {"articleID": "2019101621_00151423_W", "names": {"John White": ["Q10383267", "Q15821600", "Q16215641", "Q17423827", "Q18385573", "Q21230044", "Q21598415", "Q28873238", "Q3182735", "Q3809674", "Q43395687", "Q459082", "Q51586479", "Q53838422", "Q53838425", "Q53838427", "Q53838454", "Q54932732", "Q56817081", "Q6263775", "Q6263782", "Q6263788", "Q6263790", "Q6263798", "Q6263800", "Q6263804", "Q6263809", "Q719350"]}, "date": "2019-10-17", "url": "https://www.miragenews.com/cross-border-commissioners-visit-east-gippsland/", "content": "East Gippsland Shire Council welcomed Cross Border Commissioners Luke Wilson (Victoria) and James McTavish (New South Wales) to East Gippsland on Tuesday, October 15. Mayor Cr Natalie O’Connell said it was a great opportunity to discuss a range of issues that impact communities accessing services on both sides of the border in the shire's more remote towns. \"Having these conversations and keeping the lines of communication open are very important in Council advocating for our communities and improving opportunities for East Gippsland,\" Cr O’Connell said. \"It's great both Luke and James are showing a genuine, keen interest in East Gippsland. There is a real commitment to addressing some of the issues that face our cross-border communities .\" It's the third time I have met with Luke since he started in the role last October, and it was great to have James visit and provide the New South Wales perspective on some of the opportunities and challenges. \"The Mayor said school bus access, educational opportunities, regulatory and business registration challenges, and tourism promotion opportunities were among the items discussed with councillors .\" Our remote communities close to the border, like Mallacoota and Bendoc, that access services out of NSW particularly should see the benefits of this advocacy and cross-border relationship into the future, \"Cr O’Connell said. Council is also an affiliate member of the Canberra Region Joint Organisation (CRJO), which provides networking and funding opportunities for councils to drive infrastructure projects, investment opportunities and socio-cultural progress .\" The involvement with the CRJO and the willingness of James to travel into East Gippsland shows great progress, \"Cr O’Connell said. Crs Dick Ellis, Colin Toohey and Marianne Pelz, Victorian Cross Border Commissioner Luke Wilson, Crs Mark Reeves and Mayor Natalie O’Connell, NSW Cross Border Commissioner James McTavish, Crs <mark>John White</mark>, Joe Rettino and Ben Buckley, and Council Chief Executive Officer Anthony Basford."}, {"articleID": "2014090223_00062897_W", "names": {"George Williams": ["Q11310861", "Q16236651", "Q19664444", "Q21001058", "Q23838005", "Q3760673", "Q552019", "Q5546363", "Q5546368", "Q5546370", "Q5546374", "Q5546375", "Q5546376"], "Vincent Martin": ["Q2089239", "Q30127114", "Q3559734", "Q47392981"], "James Harding": ["Q11142372", "Q3161133", "Q6135540"]}, "date": "2014-09-02", "url": "http://www.reuters.com/places/africa/article/2014/09/02/us-health-ebola-idUSKBN0GX1IH20140902", "content": "MONROVIA (Reuters) - The United Nations said on Tuesday the spread of the deadly Ebola virus in West Africa was causing food shortages in one of the world's poorest regions and the U.S. Centers for Disease Control and Prevention warned the disease was threatening the stability of stricken countries and their neighbors. Doctors in Liberia were out on strike as they struggled to cope with the worst outbreak of Ebola on record, while the global aid organization Medecins Sans Frontieres (MSF) said 800 more beds for Ebola patients were urgently needed in the Liberian capital Monrovia alone, while in Sierra Leone highly infectious bodies were rotting in the streets. Governments and aid organizations have scrambled to contain the disease, which according to the World Health Organization (WHO) has killed more than 1,500 in West Africa since March. In an address to United Nations member states, MSF President Joanne Liu said, \"Six months into the worst Ebola epidemic in history, the world is losing the battle to contain it .\" She said aid charities and West African governments did not have the capacity to stem the outbreak and needed intervention by foreign states. Slamming what she called \"a global coalition of inaction,\" Liu called for the urgent dispatch of field hospitals with isolation wards and mobile medical laboratories. MSF, also known as Doctors Without Borders, said biological disaster response teams were needed to support West Africa's buckling healthcare systems. There are no approved Ebola vaccines or treatments, but as hospitals and Ebola treatment centers battled to contain the disease and tend to the sick and dying, the U.S. Department of Health and Human Services said a federal contract worth up to $42.3 million would help accelerate testing of an experimental Ebola virus treatment being developed by privately held Mapp Biopharmaceutical Inc.. The agency said in a statement that Mapp, based in San Diego, California, would manufacture a small amount of its ZMapp drug, which uses antibodies manufactured in tobacco plants, for early stage safety studies and animal studies needed to prove its effectiveness and safety in people. ZMapp is one of several treatments for Ebola under development. The drug, although never tested in humans, gained attention this summer when two American aid workers who contracted Ebola in Liberia were cured after receiving it. Their physicians said they did not know if the drug helped. Human safety trials are due to begin this week on a vaccine from GlaxoSmithKline Plc GSK. L and later this year on one from NewLink Genetics Corp NLNK. O. The Ebola epidemic in West Africa could infect more than 20,000 people and spread to more countries, the World Health Organization warned last week. With a fatality rate of 52 percent, the death toll stood at 1,552 as of Aug. 26. Cases of Ebola have been reported in Liberia, Sierra Leone, Guinea, Nigeria, Senegal, and Democratic Republic of Congo. The cases in Congo, which include 31 deaths, are thought to be a separate outbreak and not related to the West African cases. AMERICAN STRICKEN, MEDICAL STAFF STRIKE U.S. missionary organization SIM USA said on Tuesday that an American doctor treating obstetrics patients at the ELWA hospital in Monrovia had tested positive for Ebola. The doctor, who was not working in the hospital's Ebola treatment center, was in an isolation ward at the hospital and responding well so far, SIM said on its website. At Monrovia's John F. Kennedy Medical Center (JFK) scores of staff went on strike to protest against working conditions and unpaid bonuses. Amid shortages of equipment and trained staff, more than 120 healthcare workers have died in West Africa in the Ebola outbreak. \"Health workers have died (fighting Ebola), including medical doctors at...JFK and to have them come to work without food on their table, we think that is pathetic,\" <mark>George Williams</mark>, secretary general of the Health Workers Association of Liberia, told Reuters. <mark>Williams</mark> said healthcare workers at JFK, the country's largest referral hospital, had gone unpaid for two months. The Liberian strike came a day after healthcare workers at the Connaught hospital in Sierra Leone's capital Freetown held a one-day protest over pay and conditions. Staff there returned to work on Tuesday after they said the government settled a backlog of hazard pay and agreed to raise the weekly risk bonus to $100 from $40 for nurses working in Ebola wards and members of burial crews. Separately, the Liberian government began offering a $1,000 bonus to any healthcare workers who agreed to work in Ebola treatment facilities. The World Health Organization and other international bodies have rushed to support healthcare systems in affected countries, but additional staff and resources have been slow to arrive. PRICES SURGE, OBAMA ADDRESSES WEST AFRICANS In Monrovia, Medecins Sans Frontieres said its new ELWA 3 center, which has 160 beds, was overflowing with patients. \"Every day we have to turn sick people away because we are too full,\" said Stefan Liljegren, MSF coordinator at the site. Further pressuring the ability of the region's governments to spend money on healthcare, the epidemic has put harvests at risk and sent food prices soaring in West Africa, the U.N. Food and Agriculture Organization (FAO) said. The agency issued an alert over food security for Liberia, Sierra Leone and Guinea, which are most affected by the outbreak. Restrictions on people's movements and establishment of quarantine zones to contain the spread of the haemorrhagic fever have led to panic buying, food shortages and price hikes. \"Even prior to the Ebola outbreak, households in some of the most affected areas were spending up to 80 percent of their incomes on food,\" said <mark>Vincent Martin</mark>, head of an FAO unit in Dakar coordinating the agency's response. \"Now these latest price spikes are effectively putting food completely out of their reach .\" The director of the U.S. Centers for Disease Control and Prevention, Dr. Thomas Frieden, said he expected the outbreak to accelerate and urged governments to act now. \"We're likely to see significant increases in cases. Already we have widespread transmission Liberia. In Sierra Leone, we're seeing strong signs that that will happen in the near future,\" he said. Frieden said the outbreak was the first epidemic of Ebola the world has ever known, meaning it was spreading widely in society and \"threatening the stability\" of affected and neighboring countries. Frieden, who has been briefing U.S. President Barack Obama on the outbreak, said there was still a window of opportunity, but \"that window is closing .\" \"We need action now to scale up the response. We know how to stop Ebola. The challenge is to scale it up to the massive levels needed to stop this outbreak,\" he said. \"The virus is moving faster than anyone anticipated. We need to move fast .\" In a video message to West Africans in Liberia, Sierra Leone, Guinea and Nigeria and released on YouTube, Obama affirmed the United States' support in the fight against Ebola and attempted to dispel some myths about how it is spread. here \"Ebola is not spread through the air like the flu. You cannot get it from casual contact like sitting next to someone on a bus,\" he said. Instead, he said the most common way people become infected \"is by touching the body fluids of someone who is sick or has died from it, like their sweat, saliva or blood, or through a contaminated item, like a needle .\" Obama said that was why so many people were becoming infected while caring for Ebola patients at home, and he urged people who felt sick to get prompt treatment because half of the people who become ill recover. \"Stopping this disease won't be easy, but we know how to do it. You are not alone,\" Obama said. To try to ease the strain on their economies, Ivory Coast, which closed its borders with Liberia and Guinea last month, announced on Tuesday it would open humanitarian and economic corridors to its two western neighbours. The death toll from an Ebola outbreak in the Djera region of northern Democratic Republic of Congo has risen to 31, Minister of Health Felix Kabange Numbi told Reuters on Tuesday. The outbreak in Congo's Equateur province is thought to be separate from the West African epidemic. (Reporting by <mark>James Harding</mark> Giahyue; Additional reporting by Stephanie Nebehay in Geneva, Isla Binnie in Rome, Umaru Fofana in Freetown, We welcome comments that advance the story through relevant opinion, anecdotes, links and data. If you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. Views expressed in the comments do not represent those of Reuters. For more information on our comment policy, see http: //blogs.reuters.com/fulldisclosure/2010/09/27/toward-a-more-thoughtful-conversation-on-stories/ Cannot there be airdrops of food, water and other daily hygiene necessities? Cannot money be transferred into one of the Liberian banks to cover the unpaid salaries and other overdue payments of the health workers who risk their very lives to contain this pandemic? What is wrong with this world? Where is the humanitarian sensibility in each leader of each country? What does this say about our collective commitment to those in dire need? Actress Jennifer Lawrence contacts authorities after nude photos hacked Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance, and interactive television platforms. Thomson Reuters journalists are subject to an"}, {"articleID": "2010012708_00168330_W", "names": {"David Llewellyn": ["Q16193717", "Q5236684", "Q5236689", "Q5236691", "Q681560"], "Michael Spencer": ["Q1936755", "Q3308524", "Q51970690", "Q6834529"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2010-01-27", "url": "http://abc.net.au/news/stories/2010/01/27/2802985.htm", "content": "email greens talk down forestry's fsc chances the tasmanian greens say they do not believe forestry tasmania will be certified by the forest stewardship council (fsc), but they are prepared to accept its decision. the fsc does not allow the logging of high conservation-value forests and the primary industries minister <mark>david llewellyn</mark> has asked both gunns and forestry tasmania to seek its certification. mr mckim says the fsc makes it clear tasmania's current reserve system does not meet the protection standards necessary for even the lowest level of certification. \"forestry has been a huge political issue in tasmania for decades now and it's not good enough for david bartlett and will hodgman to keep their head in the sand and refuse to acknowledge what the world knows and that is if you want fsc certification you must protect your high conservation-value forests,\" said mr mckim. forestry tasmania stands by its logging practises. spokesman hans drielsma says he does not believe they will have to be changed to get fsc certification. but tasmania's forest industry is under increasing pressure to meet the latest international standards. the japanese paper manufacturer, mitsubishi paper mills, is sending a delegation to hobart next week for talks with industry and conservation groups. the company has fsc certification and wants to inspect local woodchip sources. <mark>michael spencer</mark> of the forest stewardship council says the market dynamic has changed in recent years. \"supply-demand equation has really changed and it's gone from one where the suppliers would say well, this is what we're giving you, to one where the customers are saying this is what we want,\" said mr <mark>spencer</mark>. papa don't preach? <mark>tony abbott</mark> says his virginity comments were meant only as advice for his daughters. sustainable suburbia what will it take to make our suburbs sustainable? one melbourne family may have the answer. this service may include material from agence france-presse (afp), aptn, reuters, aap, cnn and the bbc world service which is copyright and cannot be reproduced."}]