[{"date": "2015-03-17", "url": "http://feeds.washingtonpost.com/c/34656/f/636617/s/447f08a4/sc/14/l/0L0Swashingtonpost0N0Clocal0Cdc0Epolitics0Ca0Emarijuana0Eprotest0Ebeer0Efor0Est0Epatricks0Eday0C20A150C0A30C170C88c810A440Ecc980E11e40E8c540Effb5ba6f2f690Istory0Bhtml0Dwprss0Frss0Idc/story01.htm", "content": "DC Brau co-founder Brandon Skall, seated, with brewer <mark>Christopher Graham</mark> on March 14 during a tour of DC Brau Brewing Co. and a sneak peek of its new protest beer \"Smells Like Freedom .\" (Aaron C. Davis/The Washington Post) Aaron C. Davis March 17 at 2:19 PM But if that's what you like - a dank, resinous pint - or if you're willing to at least try it, this could be your kind of St. Patrick's Day in D.C.. The District's DC Brau will tap a few green-decorated kegs of its new seasonal india pale ale dubbed \"Smells Like Freedom\" on Tuesday night, for what is bound to be a first in the District's protracted fight for full voting rights. threats of jail time by congressional Republicans. Possession, sharing and home cultivation of marijuana is now legal in the District. But Congress has blocked legal sales or purchases of pot. conflict has spurred sit-ins, marches, and as late as Tuesday, a band of pro-marijuana advocates dressed up in colonial garb who barged into the Capitol Hill office of House Oversight Committee Chairman Jason Chaffetz (R-Utah), a leading opponent of legalization in D.C.. The protestors offered a glass peace pipe of sorts. Chaffetz's staffers declined. Brewing a marijuana protest beer, however, was far less spontaneous. It's been fermenting, in fact, since last fall, said Brandon Skall, chief executive and co-founder of DC Brau Brewing Co. DC Brau and Longmont, Colo.-based Oskar Blues Brewing, both of which bottle their beers in cans, had for more than a year been looking for a reason to team up on a brewing project. In e-mails last fall, Skall said he laid out the case for doing a beer together around D.C.'s legalization effort and the rarely-noticed plight of the 650,000 D.C. residents who have no voting rights in Congress. Oskar executives were sold, and brewers there took to their lab, Skall said. They found three experimental hops that, when combined, produced a distinctly marijuana-like aroma. \"The experimental hops were definitely unique,\" said DC Brau brewer <mark>Christopher Graham</mark>. \"Some were over the top with melon. Some had a lot of berry notes. But all had that undertone of piney, resinous, dank quality that someone would expect from a nugget\" of marijuana, he said. For Skall, the issue is more about the tax bill he said he pays every year to the District while feeling like a second-class citizen. \"I'll tell you straight up, I don't smoke pot,\" Skall said, \"but I believe 100 percent in people's freedom to do so. I think that if we didn't have people standing for the end of prohibition that this business would not be here today .\" But at root, he said, it's about the fact that the District could only partially legalize marijuana, instead of fully like Colorado, which designated much of the revenue from taxes on pot to go to schools. \"Something needs to change with D.C., it's ridiculous,\" Skall said. \"I live here, I'm about to have a second child here. We're sending our children to school in Washington, D.C. - There's no reason we shouldn't be able to benefit the same way they do in Colorado .\" You walk into a D.C. public school, you see empty bookshelves, you seen underfunding, you see teachers going out and spending their money to buy kids supplies. We should be able to benefit the same way that other states do. \"The unveiling of the beer comes Tuesday night at Meridian Pint in the District's Columbia Heights neighborhood, where Initiative 71 supporters gathered on Election Night last year to celebrate legalization. SuperFan Badge SuperFan badge holders consistently post smart, timely comments about Washington area sports and teams. Culture Connoisseur Badge Culture Connoisseurs consistently offer thought-provoking, timely comments on the arts, lifestyle and entertainment. Washingtologist Badge Washingtologists consistently post thought-provoking, timely comments on events, communities, and trends in the Washington area. Post Writer Badge This commenter is a Washington Post editor, reporter or producer. Post Forum Badge Post Forum members consistently offer thought-provoking, timely comments on politics, national and international affairs. Weather Watcher Badge Weather Watchers consistently offer thought-provoking, timely comments on climates and forecasts. World Watcher Badge World Watchers consistently offer thought-provoking, timely comments on international affairs. Post Contributor Badge This commenter is a Washington Post contributor. Post contributors aren't staff, but may write articles or columns. In some cases, contributors are sources or experts quoted in a story. Post Recommended Washington Post reporters or editors recommend this comment or reader post. You must be logged in to recommend a comment. Sign in here Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges:. Replies to those posts appear here, as well as posts by staff writers. All comments are posted in the All Comments To pause and restart automatic updates, click\" Live \"or\" Paused \". If paused, you'll be notified of the number of additional comments that have come in. Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges: Text from flight:\" Scariest moment' as passenger racing at cockpit is subdued Forget Harvard and Stanford. It really doesn't matter where you go to college Jet returns to Dulles after passenger disregards instructions from the crew D.C. area forecast: Afternoon cold front ends warm reign; Rain, snow chances late Thursday into Friday Before I Go: A Stanford neurosurgeon's parting wisdom about life and time Forget Harvard and Stanford. It really doesn't matter where you go to college Text from flight: \"Scariest moment' as passenger racing at cockpit is subdued Severe geomagnetic storm spurs beautiful aurora, could continue Tuesday evening (Photos) Wet snow chances tick up for Friday, but accumulation chances very iffy Put on your Sudoku hat and get ready for a challenging Sudoku puzzle! A marijuana (protest) beer for St. Patrick's Day Mayor Bowser spells out plan to close District's troubled homeless shelter Name of Related Newsletter (daily)", "articleID": "2015031718_00072611_W", "names": {"Christopher Graham": ["Q21165674", "Q5112420"]}}, {"date": "2015-03-18", "url": "http://www.pakistantoday.com.pk/2015/03/19/city/islamabad/education-policy-revamp-underway-na-told/", "content": "31.9 million Security plan for foolproof security for judiciary The National Assembly was informed on Wednesday that a new Education Policy is being finalised to improve the standard of education and make it compatible with modern global trends. Parliamentary Secretary for Education and Professional Training Dr Darshan told the House during question hour that a committee comprising members from provincial education departments has been constituted to bring a consensus on the education policy. He said the policy would be finalised by the end of this year and launched in January next year. Allocations for the education sector will be enhanced in a phased manner. Minister of State for Parliamentary Affairs Shaikh <mark>Aftab Ahmad</mark> told the House that the government has decided to resurvey the beneficiaries of the Benazir Income Support Programme in order to ensure that the cash grant reaches the people that deserve it. He said Rs. 4.1 billion have been disbursed to deserving people in Balochistan, under this programme, during the current fiscal year. He said that the government plans to widen the network of Sweet Homes under Pakistan Baitul Maal. He said the budget of Sweet Homes will be enhanced in the coming years and more homes will be opened at different places in order to accommodate a maximum number of orphans. He said the children of these homes are being provided with quality education at different schools. Parliamentary Secretary for Cabinet Division Raja Javed Ikhlas assured the House that construction work on the new building of the Poly Clinic Hospital Islamabad would be started during the current year. An additional land of 2.54 acres from the ArgentinaPark has been acquired for this purpose. He said there is a plan to include cancer department in the Poly Clinic Hospital Extension Project. He said the Planning Commission is working on the establishment of a full-fledged cancer hospital in Islamabad. A committee has been constituted to chalk out the prefeasibility of the project. \"Dedicated to the legacy of the late Hameed Nizami\" Arif Nizami (Editor) 4-Shaarey Fatima Jinnah, Lahore", "articleID": "2015031819_00061986_W", "names": {"Aftab Ahmad": ["Q56014091", "Q56992539", "Q57317269"]}}, {"date": "2015-03-23", "url": "http://buffalonews.com/columns/douglas-turner/minimum-wage-stance-could-cost-bush-votes-20150323", "content": "MessFest draws children and parents to Museum of Science Disturbing tailspin of BUILD Academy and other city schools demands action Generosity helps Catholic Charities continue its selfless work in WNY Another Voice: Erie County should pass a law to prevent housing discrimination Proposal would allow some juvenile criminals to escape justice Disturbing tailspin of BUILD Academy and other city schools demands action <mark>Michael Bolton</mark> pleases his audience with love songs - but without the trademark voice and hair [BN] the know Subscribe for just $1.99 / wk WASHINGTON - Inherited wealth would be only a moderate problem for Republican John Ellis Bush if he runs for president. The Bush family ranks somewhere in the middle of the ranks of monied White House aspirants. However, Jeb Bush, as he is called, complicated things on this score when he spoke about the federal minimum wage during stops in South Carolina a few days ago. He is against it, as are most conservatives around the country. While Bush's comments are sure to warm the pocketbooks of right-wing Republicans who control the presidential primaries, this issue rubs particularly raw with some voters because Bush is a Catholic, a convert of 20 years. The Associated Press reported Bush said he can accept the present federal minimum wage, last raised in 2009, of $7.25 an hour, but opposes raising it. \"State minimum wages are fine,\" Bush said, according to the AP. The wage, he said, should be left to the states and the influences of the marketplace. As governor of Florida, Bush opposed a 2004 referendum approved by voters that tied the wage to inflation. In his South Carolina appearances, Bush implied that the minimum wage actually hurts employment opportunities for the poor. Unfortunately for Bush, these comments came as the New York Times published a lengthy story about how Bush is increasingly influenced by his Catholic faith. \"It's made me a better person,\" he told the Times. There is nothing in the catechism about the minimum wage. It is surely not an article of faith. Yet, the concept of government intervention on behalf of working men and women has been deeply embroidered into the literature and actions of the Catholic Church for the last 114 years. In reaction to the growth of Marxism in Europe, Pope Leo XIII published the papal encyclical \"Of New Things\" in 1891 in which he supported a living wage, and workers' rights to organize into labor unions. Leo's message swept through Catholic Western Europe. In America, it particularly influenced the struggling dioceses of Chicago, Cleveland and Buffalo, where bishops fostered the creation of diocesan labor colleges to support unions and fair wages. In 1991, Pope <mark>John Paul</mark> II penned his own letter on economics, \"Our 100th Year,\" that took Leo's message further, stressing Christianity's \"preferential option for the poor .\" This is a fancy phrase calling for private and public intervention for the economic welfare of the poor and powerless. <mark>John Paul</mark> also warned that the economic boom of the 1990s was occurring \"over the heads\" of ordinary people, meaning the poor would be left out. Now it is Pope Francis who is warning about the spiritual and political dangers of the widening disparity of incomes. Of all the varied comments Francis has made about the church and society, his forebodings about rich and poor are his most consistent. According to the New Republic, Francis condemned \"the economics of exclusion\" in remarks before U.N. officials last May. Francis called for \"the legitimate redistribution of economic benefits by the state .\" He likened the economic \"throw away culture\" to the \"culture of death\" that allows abortion. All this makes tough sledding in swing states like Ohio and Florida for Bush, interested in becoming the second Catholic president. It was for Rep. <mark>Paul Ryan</mark>, R-Wis ., also a Catholic, as the GOP's vice presidential candidate in 2012. <mark>Ryan</mark> was attacked by Catholics for wanting to slash spending for social welfare. The Buffalo News works to promote civil conversation in the comments section below. Please review the Alerts Text message notifications of news happening now. Copyright 1999 - 2015 - The Buffalo News copyright-protected material. Sorry, an unexpected error occurred. Please try again later.", "articleID": "2015032304_00035517_W", "names": {"John Paul": ["Q1701359", "Q6252169"], "Michael Bolton": ["Q25829592", "Q312514"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2015-03-23", "url": "http://timesrecordnews.com/newsy/millions-of-computers-vulnerable-to-twominute-attack", "content": "Photo Credit: happyhappyjoyjoy / CC BY NC SA 2.0 Security researchers are definitely earning their keep. According to a report by Wired, researchers at a digital security conference Friday revealed a difficult-to-detect BIOS attack called LightEater that leaves YouTube / hdgadget) When you turn on your computer, the BIOS - which stands for basic input/output system - helps your computer get going. It loads up your operating system - like Microsoft Windows - and helps the computer communicate with the stuff you've plugged into it: the display, the keyboard, the mouse, etc.. The hack works by infecting this basic input/output system. It's particularly worrisome because software designed to protect your computer from viruses doesn't typically scan the BIOS; it scans the operating system loaded by the BIOS. So if hackers can infect the BIOS, they are - in theory - capable of loading malware onto your system undetected. And here's the kicker, via Wired: \"The vulnerabilities...were so easy to find that they wrote a script to automate the process and eventually stopped counting [them] because there were too many .\" The problem is people aren't updating their BIOS when manufacturers make updates available. That leaves dozens of openings for hackers, which result in millions of vulnerable computers. \"To check the setup version from Windows, go to the Start screen and type\" msinfo32 .' Click \"msinfo32,' and the System Information window will open .\" Yeah, that was just a few seconds of a The Register spoke to the lead researchers who discovered these vulnerabilities. The duo hopes to essentially shock governments, businesses and users into action by showing just how simple it is to gain nearly unprecedented access to millions of computers - especially now that DEFCONConference / CC BY 3.0) \"The research pair says the attacks should serve as a boot in the arse for governments and corporations to apply BIOS patches if only to make life more difficult for less-resourced hostile spy agencies .\" Woolly mammoth DNA added to elephant cells Supreme Court won't consider Wis. voter ID law Vin Diesel names daughter after <mark>Paul Walker</mark> Packing peanuts key to fast-charging batteries", "articleID": "2015032315_00021719_W", "names": {"Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"]}}, {"date": "2015-03-24", "url": "http://www.truthdig.com/report/item/how_we_know_republicans_serious_plight_working_class_americans_20150324/", "content": "An Early Look at the Republican Nomination for the 2016 Election Here's How We Know Republicans Aren't Serious About the Plight of Working Class Americans Being Mortal By Louise Rubacky \"Shock Wave': A Compelling Poem About the Boston Marathon Bombings WASHINGTON-Briefly, there seemed a chance we might have a cross-party discussion of the biggest economic problem the country faces: the vexing intersection of wage stagnation, declining social mobility and rising inequality. Even the most conservative Republicans were starting to talk about this challenge in rather urgent terms. In a moment whose irony he noted, Sen. Ted Cruz, R-Texas, told a bunch of rich Republicans gathered by the Brothers Koch earlier this year that those doing well in America were\" the top 1 percent, the millionaires and billionaires the president loves to demagogue, one or two of whom are here with us tonight \"while the\" people who have been hammered for the last six years are working men and women. \"And on it went through the country's top Republicans. Sen. Marco Rubio, R-Fla ., stressed\" opportunity inequality \"and Mitt Romney, in another ironic turn, charged that\" under President Obama, the rich have gotten richer. \"It would be wonderful if conservatives really wanted to deal constructively with the predicament they so passionately describe. But thanks to the House and Senate GOP budgets, we now know that conservatives and Republicans (1) aren't serious about the plight of working class and lower income Americans, and (2) would actually make their situations much worse. Their spending plans fail even on conservative terms: They are not fiscally responsible. Instead, they rely on all sorts of magic tricks that shove choices and problems down the road. One heartening sign is that at least some conservatives find these budgets ridiculous. For example, James Pethokoukis of the American Enterprise Institute headlined his commentary for The Week:\" The disappointing unseriousness of the House GOP's budget. \"Pethokoukis wrote:\" House Republicans say they want to balance the federal budget and eventually eliminate the federal debt. They do not have a plan to do so. Oh, to be sure, they have a plan! Just not a realistic one that will actually accomplish their goals. \"He noted that of the $5.5 trillion in cuts from planned spending, $2 trillion would come from\" repealing the Obamacare insurance subsidies and Medicaid expansion and replacing them with...well, nothing right now. \"The wholesale assault on efforts to provide lower income Americans with health insurance is the clearest sign that Republicans don't want to deal with inequality. The inability to get health insurance is one of the biggest burdens on low-income families, particularly those working for low wages and few or no benefits. Obamacare has helped 16.4 million Americans get health insurance. Where would they turn? And Republicans would compound the damage: The Senate proposes cutting an additional $400 billion from Medicaid over a decade, the House more than double that. Robert Greenstein of the Center on Budget and Policy Priorities notes that on other low-income programs, the Senate budget cuts even more than the House. The vagueness of these plans makes it hard to tally how much damage would be done to food stamps, Pell Grants for low-income college students and the like, but Greenstein estimates that about two-thirds of the cuts in both plans come\" from programs for the less fortunate, thereby exacerbating poverty and inequality. \"Greenstein concludes that under such proposals-here's hoping President Obama is relentless in blocking them -\" ours would be a coarser and less humane nation with higher levels of poverty and inequality, less opportunity, \"and an\" inadequately prepared \"workforce. Another bit of hypocrisy: These budget writers care so much about national security that they're not willing to raise a dime in taxes to cover their sharp increases in defense spending. Sen. Bernie Sanders, the Vermont independent, called out his conservative colleagues for how differently they treat defense and social spending .\" You're always telling us the deficit is so bad we've got to cut programs for the elderly, for the sick and for the poor, \"Sanders said,\" and suddenly, all of that rhetoric disappears. \"Budgets are, by their nature, boring. That's why those who assemble these long columns of numbers figure they can assail the well-being of the least privileged people in our society even as they profess to care about them so much. I'd respect these folks a lot more if they said what they clearly believe: They think more inequality would be good for us. It almost makes you nostalgic for the candor of the Romney who spoke about the\" 47 percent \"and the <mark>Paul Ryan</mark> who once divided us between\" makers \"and\" takers. \"Honesty beats saccharine words about the struggles of working people any day. E.J. Dionne's email address is ejdionne @ washpost.com. Twitter: @ EJDionne. An Early Look at the Republican Nomination for the 2016 Election Obama With Drama: Translating the President's Comments on Israel's Netanyahu from the Vulcan An Early Look at the Republican Nomination for the 2016 Election New and Improved Comments If you have trouble leaving a comment, review Mideast Apocalypse 2030: Why Obama Wants the Palestine Issue Solved. Now. An Early Look at the Republican Nomination for the 2016 Election Here's How We Know Republicans Aren't Serious About the Plight of Working Class Americans A Progressive Journal of News and Opinion", "articleID": "2015032412_00054187_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2015-03-25", "url": "http://heatworld.com/2015/03/jason-derulo-uses-tinder-to-promote-his-new-video-want-to-want-me", "content": "Jason Derulo is on TINDER! Though not quite how youâ € ™ d thinkâ € ¦ Tinder is supposed to be used to bag yourself a date, but it looks like Jason Derulo is using the app to try and score himself a number one hit too. Yep, the singer has released his new video Want To Want Me through the dating app. He revealed earlier this month that he was \"absolutely dating again' after his split from Jordin Sparks. Jeremy Clarkson\" to be sacked' today after investigation finds he DID punch BBC producer Kelly Osbourne plans to have ovaries removed like Angelina Jolie Mad Men's Jon Hamm has gone to rehab for his \"struggle\" with alcohol addiction Jason said: \"I wanted to find a new unique way to launch my video. I know my fans are tapped into social networking so what better way to launch my video for Want To Want Me than through Tinder .\" I see this app as the wave of the future. I know my fans will swipe right. \"Alright Jase - can your ego still fit through your front door? Want To Want Me follows Jason's record-breaking album cycle for 2013's Harry Styles tries to hit one of Zayn Malikâ € ™ s high notes on tour. He failsâ € ¦ Disqus allows you to post comments on our site. You can only post comments if you register with Disqus and your registration data will be handled in accordance with their VIDEO: Celine Dion breaks down as she reveals that her cancer-stricken husband Rene Angelil has to use a feeding tube VIDEO: FKA Twigs is PREGNANT (in her new music video for Glass & Patron, anyway) Charlotte Crosby would punch Ed Miliband and do sexy things to <mark>David Cameron</mark> LOOK! Itâ € ™ s the new Britainâ € ™ s Got Talent trailer Watch Kendall Jenner rock out in the new CourrÃ © ges Estee Lauder video X Factor producer on the future of the judges: â € ˜Simon Cowellâ € ™ s safe but thatâ € ™ s itâ € ™ © Bauer Consumer Media Ltd, company number: 01176085 registered office 1 Lincoln Court, Lincoln Road, Peterborough PE1 2RF registered in England and Wales.", "articleID": "2015032513_00024251_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}}, {"date": "2015-03-25", "url": "http://southfloridagaynews.com/Community/gay-history-101-women-s-history-month.html", "content": "Gertrude \"Ma\" Rainey (1886 -1939) is known as the Mother of the Blues. Although Ma Rainey was not the first black woman to sing the Blues, she has been credited with its rise in popularity. She sang about loving women in the 1920s. Gladys Bentley (1907 -1960) was a popular Blues singer during the 1920s Harlem Renaissance. She dressed in men's clothing, her signature look was a tuxedo and top hat. She was very out about her sexual orientation and reputation as a \"bulldagger' or butch lesbian and she openly flirted with women in the audience. Lorraine Hansberry (1930-1965) was an American playwright, best known for\" A Raisin in the Sun, \"which in 1959 became the first play by an African American woman to open on Broadway. It also won the New York Drama Critics Circle Award as the best play of the year. Although she was known as a supporter of equal rights regardless of sexual orientation, it wasn't until after her death that her own sexual orientation was revealed. <mark>Barbara</mark> Gittings (1932 -2007) was an early gay and lesbian rights activist and was instrumental in the forming of Daughters of Bilitis, one of the first lesbian organizations in the U.S. <mark>Barbara</mark> Gittings helped organize gay rights demonstrations in front of the White House and in front of Independence Hall in Philadelphia in 1965 to protest federal employment discrimination. <mark>Barbara Jordan</mark> (1936-1996) was an accomplished U.S. congressional representative from Texas and was the first African American congresswoman to come from the Deep South. Although she was in a long-term relationship with another woman for more than 20 years, she never publicly came out. It was only after her death in 1996 that the press reported about her sexual orientation. Ann Bannon (September 15, 1932) is a celebrated author of lesbian pulp fiction dating back to 1950 and 1960s. Although she was married and not quite living a lesbian life when she penned her popular books, Ann Bannon, author of Odd Girl Out, Beebo Brinker, I am a Woman, Journey to a Woman and Women in the Shadows, struggled with same-sex attractions and came out later in life. In fact, she calls her books\" love letters to the women I thought I would never get to know. \"Margarethe Cammermeyer (March 24, 1942) is the highest ranking military official to come out while in the service. Prior to\" Don't Ask, Don't Tell \"she challenged the military policy banning gays and won the right to serve. Born in Oslo, Norway she became a U.S. citizen in 1960. She had a 15-year marriage to a man and they had four sons. In 1988, when she was 46, she met her partner, Diane Divelbess. Kate Clinton (November 9, 1947) describes herself as a\" fumerist, \"a feminist humorist. She grew up Catholic in New York State and taught high school English for eight years before becoming a comedian. She began her stand-up career in 1981 using her lesbianism, Catholicism and current politics for her jokes. Melissa Etheridge (born May 29, 1961) Grammy and Oscar winner has been out and proud since 1993. She is as well known for her activism and being a breast cancer survivor as she is for her music. Etheridge is known for her mixture of\" confessional lyrics, \"pop-based folk-rock, and raspy, smoky vocals. She has also been an iconic gay and lesbian activist since her public coming out in January 1993. She has received fifteen Grammy Award nominations, winning two, and an Academy Award. In September 2011, Etheridge received a star on the Hollywood Walk of Fame. Phyllis Lyon (November 10, 1924), with her partner Del Martin (1921 - August 27, 2008) were two of the early lesbian rights activists in the U.S. On June 16, 2008, they were the first same-sex couple married in California. The wedding was officiated by San Francisco Mayor Gavin Newsom. Martin and Lyon published two books together,\" Lesbian/Woman \"(1972) and\" Lesbian Love and Liberation \"(1973). The Dinah Shore Weekend was named after the late Dinah Shore - a singer, TV personality and renowned golfer, born Frances Rose Shore, in 1916, who lived in the Coachella Valley and is credited for having founded, in Palm Springs, the Colgate-Dinah Shore Winner's Circle. The Dinah now coincides with the Kraft Nabisco Championship women's golf tournament. The first unofficial Dinah Shore Weekend took place in 1986 when women began to flock to Palm Springs in conjunction with the tournament. After-dinner parties following the golfing turned benefits for the Human Rights Campaign and the AIDS Service Foundation. Mariah Hanson is the promoter of the Dinah Shore Weekend party held every April that attracts thousands of women from all over the world to Palm Springs.", "articleID": "2015032515_00068687_W", "names": {"Barbara Jordan": ["Q4859035", "Q4859322", "Q53570"]}}, {"date": "2015-03-29", "url": "http://www.caughtoffside.com/2015/03/29/jordan-henderson-wants-to-be-at-liverpool-for-years/", "content": "Jordan Henderson vowed to stay at Liverpool for \"many years' and said he wants to do the best for his club and country. Nine hidden Premier League stars who could be the next <mark>Harry Kane</mark>, featuring Arsenal duo & Liverpool wonderkid (Image) Former WAG of Liverpool's Daniel Sturridge looks fed up on makeup-free shopping trip The 24-year-old will have only one-year left on his Liverpool deal at the end of the season amid claims he has rejected a new deal at Anfield but according to the Daily Star he has now said he wants to remain at the club .\" The contract issue is definitely not a distraction and it's not a major issue, \"said Henderson, reports Daily Star .\" I love playing for Liverpool and I want to be there for many years. \"Henderson added that whilst everyone else will make an issue of it it does bother him that he has yet to agree to a new contract .\" ...for me, it's just letting my agent and the club deal with it and whenever it gets sorted, it gets sorted. \"All I want to do is my best for club and country. Contracts and stuff can be sorted out by clubs and agents .\" That's why we've got agents and hopefully this can get done soon. \"All I want to do is concentrate on my football and not let this get in the way .\" ", "articleID": "2015032907_00002411_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}]