[{"articleID": "2010100813_00165036_W", "names": {"Graham Smith": ["Q17388770", "Q18737089", "Q20685584", "Q20873054", "Q28600236", "Q42575935", "Q43380296", "Q47498831", "Q55362421", "Q5593246", "Q5593247", "Q5593248", "Q5593249", "Q5593251", "Q5593252", "Q5593253", "Q5593254", "Q59478591", "Q640289"]}, "date": "2010-10-08", "url": "http://times-series.co.uk/news/topstories/8440951.Council_being_monitored_over_handling_of_FOI_requests/?ref=rss", "content": "barnet council told to \"get their house in order' on freedom of information request handling (from times series) barnet council is one of just 19 organisations in the country being monitored over slow responses to freedom of information requests by residents. the information commissioner is set to look more closely at the council's handling of the requests by members of the public, along with four other london councils and the cabinet office. when a member of the public makes a request under the legislation, authorities have 20 working days to respond. the authorities were singled out because they had either taken far too long to respond to a request, had more than six complaints in six months, or less than 85 per cent of responses are made on time. ico deputy commissioner <mark>graham smith</mark> said:\" we will monitor the authorities for three months, but may take action during this timeframe if an authority's standard of compliance is revealed to be particularly poor, or if it is unwilling to make the improvements necessary. \"this is a perfect opportunity for the authorities named to get their houses in order and demonstrate that they take freedom of information requests seriously.\" councillor melvin cohen, who is in charge of civic affairs, said the problem relates to a single freedom of information request. he added: \"barnet council, along with many other high profile organisations, is being monitored by the information commissioner's office.\" we are working with the information commissioner's office to make sure it continues to meet the requirements of the freedom of information act. \"the council responded to more than 600 freedom of information requests last year.\" need a change? search thousands of jobs locally and across the uk. find friendship and romance online with two's company tens of thousands of houses and flats for sale and rent."}, {"articleID": "2015111216_00037285_W", "names": {"Peter Taylor": ["Q20054080", "Q21064176", "Q21229966", "Q3056606", "Q323300", "Q403151", "Q47231522", "Q53784250", "Q54634454", "Q55629657", "Q57148484", "Q7177261", "Q7177262", "Q7177263", "Q7177264", "Q7177265"]}, "date": "2015-11-12", "url": "http://www.medicalnewstoday.com/releases/302544.php", "content": "Detailed results demonstrate baricitinib superiority to adalimumab in improving signs and symptoms of rheumatoid arthritis Published: Thursday 12 November 2015 at 6am PST Published: Thu 12 Nov 2015 at 6am PST email Adapted media release Eli Lilly and Company and Incyte Corporation have announced detailed data from the fourth Phase 3 study of baricitinib, RA-BEAM, at the American College of Rheumatology/Association of Rheumatology Health Professionals (ACR/ARHP) annual meeting in San Francisco. The findings demonstrated statistical superiority for investigational therapy baricitinib over adalimumab after 12 weeks based on several critical measures of rheumatoid arthritis (RA) disease activity, including ACR20, ACR50 and ACR70 response rates - composite scores that represent at least a 20 percent, 50 percent and 70 percent improvement in multiple measures of RA disease activity. Improvements in the mean number of swollen and tender joints and a reduction in pain were seen as early as week one for baricitinib versus placebo. At 52 weeks, baricitinib significantly improved all seven components of the ACR composite score compared to adalimumab, including reducing the number of tender and swollen joints, reducing patients' pain, and improving physical function. Patient-reported outcomes, including degree of tiredness and the severity and duration of morning joint stiffness, assessed daily for the first 12 weeks of the study, were all significantly improved with baricitinib compared to adalimumab. At week 52, structural changes in the joints, as measured by changes in the modified Total Sharp Score, were significantly improved for both baricitinib and adalimumab compared with placebo. Lilly and Incyte previously announced that the study met its primary objective of demonstrating superiority for baricitinib versus placebo based on ACR20 response rate after 12 weeks of treatment. \"Rheumatoid arthritis is a lifelong condition, but it can be managed with treatment to help control symptoms, including joint inflammation and fatigue, to slow the progression of the disease and improve a patient's quality of life,\" said <mark>Peter Taylor</mark>, M.A., Ph.D., F.R.C.P., study author and Norman Collisson chair of Musculoskeletal Sciences in the Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences at the University of Oxford. \"These findings suggest that the once-daily oral drug baricitinib, if approved, could provide another treatment option for those with insufficient response to current therapy.\" RA-BEAM was a 52-week trial of 1,305 patients who had active, moderate to severe RA, despite ongoing treatment with methotrexate. Patients were randomized to placebo once daily (n = 488), baricitinib 4 mg once daily (n = 487), or adalimumab 40 mg biweekly (n = 330). All patients received background methotrexate. At week 24, patients taking placebo were crossed over to baricitinib. \"This is the first Phase 3 study showing that a once daily, oral treatment significantly improved clinical outcomes compared with injectable adalimumab for patients with active RA who were also receiving treatment with methotrexate,\" said Dr Greg van Wyk, Senior Medical Director, Lilly UK. \"Lilly is committed to improving outcomes for patients living with this chronic condition.\" Serious adverse event rates were similar for baricitinib compared with placebo and lower for adalimumab, while serious infection rates were similar across groups *. There were no cases of gastrointestinal perforations. One event of tuberculosis was reported, in the adalimumab group. Four deaths occurred, one in the placebo arm, two in the baricitinib arm and one in the adalimumab arm. Two potential opportunistic infections occurred in the baricitinib arm; neither were considered serious. Temporary interruptions in treatment due to adverse events occurred with similar frequency across treatment groups. Lilly and Incyte announced top-line results in December 2014 for the first Phase 3 trial of baricitinib, RA-BEACON, in February 2015 for the second, RA-BUILD, in September 2015 for the third, RA-BEGIN and in October 2015 for the fourth, RA-BEAM. The companies will also share detailed results from the RA-BEGIN study at the American College of Rheumatology/Association of Rheumatology Health Professionals annual meeting this year, and plan to submit additional detailed data from all four studies for presentation in scientific meetings and publication in peer-reviewed journals in 2016. Detailed data from the long-term extension study, RA-BEYOND, will also be submitted for presentation in scientific meetings and publication in peer-reviewed journals in 2016. About Baricitinib Baricitinib is the only once-daily, oral, selective JAK1 and JAK2 inhibitor currently in late - stage clinical studies for inflammatory and autoimmune diseases. In December 2009, Lilly and Incyte announced an exclusive worldwide license and collaboration agreement for the development and commercialisation of baricitinib and certain follow-on compounds for patients with inflammatory and autoimmune diseases. About Baricitinib Phase 3 Trials Lilly and Incyte conducted four Phase 3 clinical trials of baricitinib in patients with moderately - to-severely active rheumatoid arthritis to support regulatory submission in most countries. The clinical trial program includes a wide range of patients including those who are methotrexate naïve, inadequate responders to methotrexate, inadequate responders to conventional disease - modifying anti-rheumatic drugs, or inadequate responders to TNF inhibitors. Patients completing any of the five Phase 3 studies can enroll in a long-term extension study. For additional information on this clinical trial program, please visit www.clinicaltrials.gov. Adapted by MNT from original media release Rate this article (click stars to rate) Detailed results demonstrate baricitinib superiority to adalimumab in improving signs and symptoms of rheumatoid arthritis Public / Patient:"}, {"articleID": "2018101113_00103101_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2018-10-11", "url": "http://www.gamereactor.eu/?system=ios&sid=16dbcb307daf3c1bce686f57f1be3a3f", "content": "iOS It's been MIA for more than 12 years now, but it just got a brand-new website. Article Written by David Caballero on the 10th of October 2018 at 17:15 It's been MIA for more than 12 years now, but it just got a brand-new website. 0 Written by David Caballero on the 10th of October 2018 at 13:37 Android users will have to wait a bit longer. 0 Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 12 Along with PUBG and Blackout. 0 Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players. 1 Written by Magnus Groth-Andersen on the 9th of October 2018 at 17:11 Their trailer for Season 6's Battle Pass was removed. 0 Written by Bengt Lemne on the 8th of October 2018 at 09:28 Robert Kirkman's Skybound steps in, though all details are not final. 0 Written by <mark>Sam Bishop</mark> on the 7th of October 2018 at 09:30 \"There's better ways to spend time on the road.\" 0 Written by <mark>Sam Bishop</mark> on the 6th of October 2018 at 09:13 He laughed about it on stream. 0 Written by Christian Gaca on the 4th of October 2018 at 18:00 Make a deck and then play either in the story or PvP. 0 Written by Christian Gaca on the 4th of October 2018 at 13:35 On October 25 we get the successor to Euclidean Lands. 0 Report: Telltale staff might get hired to finish Walking Dead Written by Bengt Lemne on the 4th of October 2018 at 11:49 Sources tell Kotaku Telltale are looking for another company to hire staff and finish the last two episodes. 0 Written by Arya W. Wibowo on the 3rd of October 2018 at 13:54 Calamity is now the third most searched character. 0 Written by <mark>Sam Bishop</mark> on the 3rd of October 2018 at 12 Mark December 1 in your calendars. 0 Written by <mark>Mike Holmes</mark> on the 3rd of October 2018 at 12:34 We're taking a look at the latest content to drop in Fortnite. 0 Written by <mark>Sam Bishop</mark> on the 2nd of October 2018 at 14 FaZe Clan get some good news in the competition."}, {"articleID": "2019032109_00196391_W", "names": {"Tarlok Singh": ["Q16885697", "Q9355688"]}, "date": "2019-03-21", "url": "http://www.tribuneindia.com/news/punjab/us-sikhs-collect-1-lakh-for-documentary-on-guru-nanak/746291.html", "content": "Posted at: Mar 21, 2019, 5:55 AM; last updated: Mar 21, 2019, 5:55 AM (IST) US Sikhs collect $1 lakh for documentary on Guru Nanak Also in this section Members of the Sikh community during a fund-raising event in New York. Tribune photo Tribune News Service Bathinda, March 20 Sikhs from various parts of New York City area have raised $1,00,000 for the first-ever documentary on Guru Nanak Dev. The documentary will be shown on 200 TV stations all over America during 2019, when the Sikhs will be celebrating the 550th birth anniversary of the founder of Sikhism. As per a release, members of Gurdwara Baba Makhan Shah Lobana in New York showed their enthusiasm for this cause and they backed the plan presented by the National Sikh Campaign (NSC). The NSC is spearheading this national project of the Sikhs in America and will be organising premier shows of this film in the US and other parts of the world. It has hired Auteur Productions to make this documentary to be shown on TV stations. The fund raising event started with a gatka show by children. Second generation US-born Sikh youth expressed their enthusiasm and support for this project. <mark>Tarlok Singh</mark> Chugh, an internet sensation on Punjabi jokes, came from Calgary, Canada, and made every one laugh. Over 20 youth members displayed their gatka skills. Dr Rajwant <mark>Singh</mark>, senior adviser, NSC, who gave a detailed presentation on the documentary's plan, said, \"The goal is to reach out to Americans. We are trying to make sure that we go beyond the traditional way of celebrating this important occasion.\" "}, {"articleID": "2011081300_00055325_W", "names": {"Rosemary Harris": ["Q234195", "Q4952797"]}, "date": "2011-08-13", "url": "http://startribune.com/nation/127622598.html", "content": "denver - a denver judge blocked colorado's first school voucher program friday, calling the program to give parents in the state's wealthiest county checks for tuition at religious schools a \"substantial disservice to the public interest.\" denver district judge michael martinez sided with a group of parents, the american civil liberties union of colorado and the group americans united for separation of church and state. they asked for an injunction blocking the \"choice scholarship pilot program\" in douglas county. the voucher opponents argued the program violates the separation of church and state because it gives taxpayer money to parents for use at approved private schools, including some religious schools. the judge noted that some of the schools authorized for douglas vouchers require students to attend religious services. martinez said the voucher program \"violates both financial and religious provisions set forth in the colorado constitution.\" school-choice advocates vowed to appeal. more than 200 students have already gotten voucher money from the county to use this fall. one of the private schools in the program starts monday, and it wasn't immediately clear whether any of the checks had been cashed. a message for the school district spokesman was not immediately returned friday afternoon. the u.s. supreme court has given its backing to voucher programs, ruling they don't violate the u.s. constitution. but courts in several states have overturned voucher laws because they went further toward supporting religious institutions than their state constitutions allowed. a new voucher program covering the entire state of indiana is similar to the one in colorado and is under legal challenge that state. an indianapolis judge has said he'll decide next week whether to issue an injunction in that state. a spokeswoman for the aclu of colorado said the plaintiffs in the douglas case don't oppose religious schools, but objected to taxpayer money being used. douglas county officials argued that because the scholarship checks went to parents, who would then choose their child's school, the county wasn't improperly sponsoring religion. plaintiffs insisted the parent pass-through was a ploy to get around the constitution. \"the court correctly recognized that it's unconstitutional for the state to subsidize the religious education of a child,\" aclu spokeswoman <mark>rosemary harris</mark> lytle said. a lawyer for parents expecting vouchers said they were distraught by the ruling but hoping for a quick reversal. \"we'll be moving as quickly as possible to try to get this program back in place for this school year,\" said michael bindas of the school-choice group institute for justice. douglas school officials approved the voucher program last spring, and some parents have already gotten scholarship checks. hundreds more are on a waiting list. one of the parents testified near tears last week at the injunction hearing that her son has a form of autism and she wouldn't be able to send her son to the proper school without the voucher money. highlands ranch mom diana oakley said her son can't get the necessary education at the county schools. \"inside those four walls, he doesn't fit,\" oakley said. martinez conceded that voucher recipients would be hurt by the injunction, which he said \"will undoubtedly result in significant hardships for the families already selected.\" but martinez concluded that constitutional concerns outweigh the hardships and that it was \"clear and certain\" plaintiffs would prevail in their legal challenge."}, {"articleID": "2019072212_00065878_W", "names": {"Joe Montana": ["Q348011", "Q6211408"]}, "date": "2019-07-22", "url": "http://money.msn.com/en-us/money/stockdetails/nas-drrx/fi-a1ranm", "content": "AdChoices Latest Stories Fears of a retirement crisis are overblown--and these numbers prove it MarketWatch This is the credit score you need to take out a mortgage CNBC Back-to-school sales tax \"holidays' lure shoppers despite slim savings The New York Times Date invented: 1942 Eastman Kodak was one of many companies that contributed to the war effort during World War II. In 1942, while testing a variety of compounds for use in a plastic rifle sight, Dr. Harry Coover a company chemist, inadvertently created cyanoacrylate, a compound later marketed as Super Glue. The material was incredibly durable but was dismissed for being too sticky. When a colleague was testing cyanoacrylate nine years later, Dr. Coover had another encounter with the material. As the colleague complained the compound ruined his equipment, Coover realized its commercial potential. Super Glue was first sold as a commercial product in 1958. The product was eventually adopted by military surgeons during the Vietnam War, who would spray it over wounds to stop bleeding instantly. ALSO READ: Countries With the Most US Military Bases\" src = \"http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif\" title = \"7. Super glue - Wikimedia Commons\" > 15 commercial products invented by the military 24/7 Wall St. AdChoices The youngest heirs poised to inherit billions from their parents Business Insider Elizabeth Warren is coming for the private equity industry Bloomberg Is a 4% withdrawal rate still a good retirement rule of thumb? Kiplinger Jim Cramer has a game plan for Wall Street's big earnings week CNBC A leveraged loan collapses and reveals key risk in credit market Bloomberg Dream of retiring abroad? The reality is Medicare doesn't travel well The New York Times 17 simple home repairs that will save you cash Money Talks News Track your favorite stocks Create your watchlist DOW DOW ▼ 27,154.20 -68.77 -0.25% Last updated time 7/19/2019 5:08 PM EDT US Markets Open In 58 min AtmHeader NASDAQ Composite Index NASDAQ Composite Index ▼ 8,146.49 -60.75 -0.74% S & P 500 Index S & P 500 Index ▼ 2,976.61 -18.50 -0.62% FTSE 100 FTSE 100 ▲ 7,526.15 +17.45 +0.23% NYSE Composite Index Mini Value (New Methodology) NYSE Composite Index Mini Value (New Methodology) ▼ 1,311.20 -5.67 -0.43% Most Active TARONIS TECHNOLOGIES, INC.. TRNX ▼ 0.3146 -0.0054 -1.69% INTEC PHARMA LTD NTEC ▼ 2.99 -0.40 -11.80% FUELCELL ENERGY, INC.. FCEL ▲ 0.3490 +0.0445 +14.61% DURECT CORPORATION DRRX ▲ 0.7266 +0.0527 +7.82% ACROSS THE MARKET Crude Oil ▲ 56.43 +0.67 +1.20% Gold ▲ 1,427.20 +0.50 +0.04% USD/EUR ▲ 0.8916 +0.0003 +0.0337% Companies Companies Equifax to pay up to $650 million in data breach settlement Reuters Judge denies J & J's request to transfer 2,400 talc lawsuits to federal court CNBC As Instagram tests its \"like' ban, influencers will have to shift tactics to make money CNBC Amazon's updated suspension policy still has sellers worried about getting inexplicably booted CNBC Report: Equifax could pay $700M to settle with FTC over 2017 data breach USA TODAY Dollar stores are everywhere. That's a problem for the poor CNN Markets Markets US stock futures slightly higher on hopes of a smaller Fed rate cut CNBC Xinhua: Chinese companies seeking new purchases of U.S. farm products Reuters Elizabeth Warren is coming for the private equity industry Bloomberg China has built a railroad to nowhere Bloomberg Americans still think they can make money owning houses CBS News Safe deposit boxes aren't safe The New York Times Technology Technology Read this before installing extensions to your web browser USA TODAY Despite high hopes, self-driving cars are\" way in the future' The New York Times Olympic robots offer \"virtual' attendance, help out on field Associated Press How to tell if your computer has been tampered with Popular Science Artificial intelligence is changing food's flavor and aroma dynamics AFP Pixel 4 screen leak show off large forehead bezel The Verge Small Business Small Business Boy's\" ice-cold beer' marketing stunt gets a town's attention Time 12 tips to lower your small-business overhead costs Mediafeed Barbershops, Bars, and Other Businesses on Wheels You Have to See Cheapism What the IRS doesn't tell you about self-employment taxes MarketWatch Opinion: Corporate Transparency Act will harm small businesses The Wall Street Journal. 5 Boring Tasks All Entrepreneurs Must Master to be Successful Debt.com AdChoices Key Quotes Across the market Quotes across security and market types that are moving the markets today Active TARONIS TECHNOLOGIES, INC.. TRNX ▼ 0.3146 -0.0054 -1.69% INTEC PHARMA LTD NTEC ▼ 2.99 -0.40 -11.80% FUELCELL ENERGY, INC.. FCEL ▲ 0.3490 +0.0445 +14.61% Currencies USD/Euro € ▲ 0.8916 +0.0003 +0.0337% USD/Yen ¥ ▲ 107.9300 +0.2300 +0.2136% British Pound £ / USD ▼ 1.2474 -0.0026 -0.2080% Gainers Medallia Inc MDLA ▲ 37.05 +16.05 +76.43% MIDATECH PHARMA PLC MTP ▲ 1.86 +0.56 +43.08% Afya Ltd AFYA ▲ 24.09 +5.09 +26.79% Commodities Gold ▲ 1,427.20 +0.50 +0.04% Crude Oil ▲ 56.43 +0.67 +1.20% Silver ▲ 16.41 +0.21 +1.30% Losers NEURALSTEM, INC.. CUR ▼ 5.90 -2.60 -30.59% MYnd Analytics, Inc.. EMMA ▼ 6.86 -2.94 -30.00% MARKER THERAPEUTICS, INC.. MRKR ▼ 6.33 -2.37 -27.24% Bonds 1-Month T-Bill 2.12 0.00 0.00% 3-Month T-Bill 2.07 0.00 0.00% 6-Month T-Bill 2.03 0.00 0.00% 1-Year T-Bill 1.94 0.00 0.00% 2-Year T-Note 1.82 0.00 0.00% 3-Year T-Note 1.78 0.00 0.00% 5-Year T-Note 1.81 0.00 0.00% 10-Year T-Note 2.05 0.00 0.00% 30-Year T-Bond 2.58 0.00 0.00% Videos The costly impact of Berkeley's ban on natural gas in new homes Fox Business 4 of the worst things to charge on your credit card USA TODAY Prime crime: Porch pirates find new ways to steal your packages CBS Sacramento Jim Cramer breaks down Netflix earnings as shares drop CNBC Whose 2020 campaigns are raising the most money? The Washington Post FaceApp raises privacy and security concerns CBS News Trump to businessman: If you don't support me, you're going to be so poor Fox Business 5 key signs that your home is losing value GOBankingRates How to find a work from home job Money Talks News Madagascar's vanilla boom attracts villains Reuters Would having $1 million make you feel wealthy? USA TODAY Priest pays coal miners' bills after company files for bankruptcy CBS News Trump suggests federal agencies should look into Google's China ties The Wall Street Journal. A factory goes from Viet Cong to Team USA Reuters Should you invest in Berkshire Hathaway? Fox Business How to make an air conditioner for less than $10 Money Talks News Top Stocks Top Stocks As Amazon stock nears $2,000, is it still a buy? InvestorPlace Microsoft Is a Pricey Stock That's Worth Every Penny The Street Netflix's Tight-Lipped Culture Makes Surprises Hard to Avoid Bloomberg A big Tesla skeptic on Wall Street raised his estimate for second quarter earnings CNBC \"Lion King' release is a good time to examine Disney's stock Benzinga The 10 cheapest Warren Buffett stocks Kiplinger Saving & Spending Saving & Spending Why are so many unable to cover a $400 emergency? USA TODAY Pros and cons of government 457 (b) retirement plans Bankrate 11 Tips and Tricks That Will Keep You From Overspending Money Talks News How Much You Really Take Home From a $100K Salary in Every State GOBankingRates 20 Ways Casinos Keep You Spending Money GOBankingRates The real cost of owning a car Espresso Careers Careers 15 managers reveal the interview red flags that keep them from hiring someone INSIDER 10 fast-food jobs that pay for college US News & World Report--EDU Can you live on minimum wage in your state? Stacker The most and least unionized states Stacker The 50 metro areas with the highest unemployment rates Stacker 10 bachelor's degree jobs that can pay more than $100,000 US News & World Report--EDU Real Estate Real Estate 14 first-time homebuyer mistakes to avoid Bankrate Humble celebrity homes regular people can afford Cheapism The world's most and least expensive cities to live in, revealed Lovemoney 6 tiny houses with huge price tags GOBankingRates Berkeley becomes first US city to ban natural gas in new homes San Francisco Chronicle The fastest-growing place in every state 24/7 Wall St. Popular Slideshows These are the fastest-dying jobs in every state Business Insider Great small towns for early retirement Kiplinger These people live without money Espresso Iconic American companies started the year you were born Stacker AdChoices Product recalls that rocked their company's stock price Stacker These 10 retailers might not survive 2019 The Motley Fool The worst hidden costs of living in the suburbs Business Insider American towns that went from rich to poor Lovemoney Why See's Candies is Warren Buffett's favorite company Business Insider See inside <mark>Joe Montana</mark>'s Napa Valley villa listed for $29M SF Gate Roads in poor condition: 5.5% (23rd highest)> Structurally deficient bridges: 1.3% (the lowest)> State highway spending per driver: $509 (23rd highest)> Avg. travel time to work: 26.5 minutes (14th highest)\" src = \"http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif\" title = \"42. Texas - Thomas Northcut / Getty Images\" > Which states are falling apart? 24/7 Wall St. 9 mind-blowing facts about Walmart Business Insider Jobs that no longer exist Stacker Clothing brands that are still made in America Cheapism 13 top-selling products still made in America The Motley Fool How the richest person in each state made a fortune Stacker 12 eerily accurate financial predictions from the past 25 years Bankrate From worst to best: America's top companies ranked by reputation Stacker GNI per capita: $1,078> 2017 GDP: $5.5 billion> Population: 4.7 million> Life expectancy at birth: 63.0 years Founded partly by freed U.S. slaves, Liberia's economy was all but destroyed in the 1990s and early 2000s by a civil war that left a quarter of a million dead and thousands more displaced. Limited economic development in the country has lead to a low standard of living. Less than 20% of the population has access to electricity, and about 39% are undernourished. The government, which ranks among the most corrupt in the world, spends relatively little on education as a share of GDP, and illiteracy is widespread. The West African nation is resource rich, however, and gold exports are driving growth. In 2017, gold accounted for 19% of the country's $1.0 billion in exports. ALSO READ: 14 Countries the US Government Doesn't Want You to Visit \"src =\" http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif \"title =\" 6. Liberia - Wikimedia Commons / blk24ga \"> Poorest countries in the world 24/7 Wall St. The most famous business started the year you were born Lovemoney AdChoices"}, {"articleID": "2019110623_00086293_W", "names": {"Mark Higgins": ["Q570357", "Q6768030", "Q6768032", "Q6768033"]}, "date": "2019-11-06", "url": "https://www.seattletimes.com/opinion/editorials/add-columbia-rivers-polluted-bradford-island-to-superfund/", "content": "Add Columbia River's polluted Bradford Island to Superfund Nov. 6, 2019 at 2:32 pm Bradford Island, adjoining the Columbia River's Bonneville Dam near Cascade Locks, Oregon, in 2011 (AP Photo / Rick Bowmer, File) By The Seattle Times editorial board For decades, the U.S. Army Corps of Engineers has treated the Columbia River's Bradford Island shamefully. Just off Bonneville Dam, the Corps used Bradford Island for dumping, painting, sandblasting, pistol practice and other polluting activities from the 1940s into the 1980s, and dumped electrical equipment and even light bulbs into the mighty Columbia. The toxic legacy left by these decades of poor stewardship is still abundant today, contaminating the river waters and the fish that swim in them. Although the Corps since the 1990s has been responsible for evaluating and cleaning up this mess, the process has been inexcusably slow. In a letter last month, nine environmental advocacy nonprofits charge that the Corps has not conducted any cleanup since 2007, and that fish caught near the island \"contain the highest levels of cancer-causing PCBs in the Northwest.\" Lead, mercury, pesticides and petroleum byproducts also pollute the area. Aside from dredging and removal of dumped transformers in 2007, the Corps has done little besides catalog the damage and requested no money in President Donald Trump's 2020 budget to clean up this section of Washington's signature river. Better leadership must be put into place. If the U.S. Army Corps of Engineers is unwilling to take seriously the need to clean up Bradford Island and get the contamination out of the nearby population of bass and clams, the task should be designated for Superfund cleanup. Bradford Island has never been a Superfund site, but the EPA is still adding new pollution cleanup sites to that list even under Trump. Of the 1,335 sites listed nationally as Superfunds as of this month, Washington has 48. Because it straddles the Washington-Oregon border, Bradford Island would become Oregon's 14th site. Assigning the job to the EPA would take the cleanup out of the hands of the Corps, the agency which dumped the toxic pollution and has shirked its duty to make things right. Do you have something to say? Share your opinion by sending a Letter to the Editor. Email letters @ seattletimes.com and please include your full name, address and telephone number for verification only. Letters are limited to 200 words. There must be accountability for this failing. Governments of Washington, Oregon and the Yakama Nation wrote in a letter to the EPA in October that the \"serious threat to human health and the environment\" requires stronger intervention. It's time to get serious about cleaning up Bradford Island and its stretch of the Columbia River. Corps officials said it \"continues to work with state and tribal health agencies to inform area subsistence fishers and recreational anglers about the danger of eating fish that may be contaminated.\" Not good enough. That must not be the last feckless word on this historic neglect. The Seattle Times editorial board members are editorial page editor Kate Riley, Frank A. Blethen, Brier Dudley, Jennifer Hemmingsen, <mark>Mark Higgins</mark>, Derrick Nunnally and William K. Blethen (emeritus). Most Read Opinion Stories"}, {"articleID": "2015051203_00003814_W", "names": {"Carlos Ruiz": ["Q21555320", "Q441052", "Q475730", "Q5042595", "Q5042597", "Q54555383", "Q55281068", "Q9697328"], "Carlos Torres": ["Q10861395", "Q20267761", "Q24703081", "Q25933138", "Q27103459", "Q28672711", "Q2939479", "Q56382789", "Q5642649", "Q5651485", "Q8338403", "Q858621", "Q962202"], "Cesar Hernandez": ["Q13435265", "Q5202564", "Q53104030"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-05-12", "url": "http://foxnews.com/sports/2015/05/09/lagares-hits-go-ahead-hr-as-mets-edge-phillies", "content": "Philadelphia, PA (SportsNetwork.com) - Juan Lagares clubbed the go-ahead two - run homer in the seventh inning and Buddy Carlyle got the New York Mets out of a bases-loaded jam in the eighth in a 3-2 win over the Philadelphia Phillies. Jonathon Niese (3-2) allowed five hits and a pair of unearned runs over seven innings. Niese had six strikeouts to gain his 10th career win against the Phillies, the most he's had against any club. His single led to Lagares' blast to left on a 1-0 pitch. \"Juan had a great hit there and our defense played outstanding,\" Niese said. Ruben Tejada had a pair of hits and scored once for the Mets, who bounced back from a 3-1 loss Friday to win for the third time in four games. Aaron Harang (3-3), pitching on his 37th birthday, gave up Lagares' first homer of the year. Harang surrendered eight hits over his seven-inning effort. <mark>Carlos Ruiz</mark> doubled in one run, but with the tying run at third in the eighth, he hit a sharp grounder to Tejada at shortstop. That started the inning-ending 6-4-3 double play. \"It was set up, but I thought the shortstop made a good play on Chooch's ball hit hard to the backhand,\" Phillies manager Ryne Sandberg said. New York used three pitchers in that eighth inning. Freddy Galvis doubled off <mark>Carlos Torres</mark> to begin the frame. With one out, Alex Torres came in, but of his nine pitches thrown, eight were balls in walks to pinch-hitter Grady Sizemore and <mark>Cesar Hernandez</mark>. Carlyle then put out the fire when he faced <mark>Ruiz</mark>. Chase Utley ended an 0-for-19 stretch with a pinch-hit single to right field with one out in the home ninth against Jeurys Familia. Pinch-hitter Ryan Howard then flied out to center and Ben Revere hit a slow bouncer toward first and was tagged out to give Familia his 12th save. <mark>Cesar Hernandez</mark> was unable to handle Lucas Duda's bouncer in the fifth, and that scored Tejada with the first run. Revere scored on Jeff Francoeur's sacrifice fly in the sixth. Later in the frame, <mark>Ruiz</mark> grounded a hit down the left-field line to plate Darin Ruf. 1 NFL suspends Patriots' QB <mark>Tom Brady</mark> 4 games for deflated footballs 2 Excerpts from NFL's letters to Patriots, <mark>Brady</mark> 3 Arkansas golfers charged with felony video voyeurism 4 <mark>Brady</mark> gets 4 games; Pats fined, lose draft picks <mark>Donald Trump</mark>, Will Ferrell, Dwight From \"The Office' React To <mark>Tom Brady</mark> Suspension Roger Goodell Knows The <mark>Brady</mark> Punishment Won't Stick, Is Playing It Smart The Verdict Is In: <mark>Tom Brady</mark> Suspended For 4 Games; Patriots Lose Draft Picks, Fined $1 Million"}, {"articleID": "2012021321_00063628_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Randy Moss": ["Q16193260", "Q462925"], "Terry Bradshaw": ["Q633263", "Q7704140"]}, "date": "2012-02-13", "url": "http://masslive.com/sports/index.ssf/2012/02/women_stand_up_for_gisele_who.html", "content": "ap file photo gisele bundchen has made it clear that if you are messing with husband <mark>tom brady</mark>, you are also messing with her - and that won't be pleasant. throughout my life, i have been constantly lectured by friends and foes alike about my cluelessness regarding two subjects in particular. one, i don't understand football. two, i don't understand women. rarely have these two blind sports come into confluence as they did last week, when gisele bundchen launched her campaign to be hired as receivers coach for the new england patriots. heckled by new york giants fans after a crushing super bowl defeat, mrs. <mark>tom brady</mark> responded by pointing out that her husband cannot throw and catch the ball at the same time. i do not defend heckler, ever. still, bundchen's expletive-laced indictment of the receivers, whose dropped passes sabotaged the patriots' last-minute drive, made life harder and not easier for her <mark>tom</mark>. like all good quarterbacks, <mark>brady</mark> nurtures his relationship with the men who catch his bullet-like throws. here's a guy who said defended <mark>randy moss</mark> and said nice things about chad ochocinco, for cryin' out loud. it gets no easier when the wife starts cryin' out loud or assigning blame. or so i thought. \"i feel sorry for gisele,\" a woman in the bank told me. after i had picked myself off the floor and stopped laughing, i asked why. she's being criticized for defending her husband. what's wrong with that? \"point taken, i said. i left for the office, wondering if that opinion represented a minority of one. not hardly, as the kids say.\" i don't care what anyone says. i'm defending gisele, \"said a woman who knows her football better than i do, and almost as well as gisele thinks she does. i have conferred with a few other women how they felt about bundchen's outburst. it's not unanimous, but evidently, a percentage of american femininity is standing by gisele for standing by her man. they all refer to her by her first name, suggesting a bond that should not be challenged. a common response begins with,\" i don't care what anyone says. \"i interpreted\" anyone, \"to mean\" me, \"or anyone unfortunate enough to share my gender. this has caused me to reassess the entire bundchen controversy. having lived through the women's liberation movement and changing attitudes of american culture, i realized bundchen represents something to all of us. to the modern woman, she is far from your everyday trophy wife. she is a bright, involved and feisty marriage partner, and very much her own person. to the more old-fashioned crowd, she is tammy wynette, crooning\" stand by your man, \"while the gloria steinems of the world cringe. american men, i would guess, are fairly united in their belief that bundchen should have kept her mouth shut. that i what many american men think all women, especially wives, should do. american women are tired of that. they probably figure if <mark>terry bradshaw</mark> can bray into the microphone and be passed off as a football analyst, anybody can do it. i think bundchen was a little harsh with the receivers. wes welker in particular has received too much blame for failing to haul in a pretty difficult catch. even so, i am willing to re-examine my initial reaction that bundchen was out of bounds by trashing her husband's own receivers. this could usher in an entirely new form of nfl analysis. instead of sending it back to the studio at halftime, we could send it up to the luxury boxes. there, the wives could break down the game with a candor we don't get from the clowns in the booth. until that day comes, i have to admire <mark>tom brady</mark>. sure, his wife is gorgeous, but she is also incredibly loyal. she is certainly no mrs. fritz peterson or mrs. mike kekick of 1972. those were the wives of new york yankees pitcher who were swapped by their husbands, at a time society still thought that was strange. not gisele. had the patriots done protected <mark>brady</mark> with the gusto she has shown in doing so, he probably would have won the game. i suspect we will not hear from bundchen for some time, but i hope we do. i'd like to hear her thoughts on shoring up that defensive secondary. none of the men seem to know how to do it."}, {"articleID": "2009010709_00013557_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Ivan Lewis": ["Q7175450", "Q749659"]}, "date": "2009-01-07", "url": "http://politics.co.uk/news//opinion-former-index/legal-and-constitutional/party-leaders-on-uk-tour-$1258822.htm", "content": "both party leaders will be touring the uk this week <mark>gordon brown</mark> and <mark>david cameron</mark> have both begun tours of recession-struck britain in a move unheard of outside election season. both men are using the trips to unveil competing proposals in a bid to convince the public they have the answer to the economic crisis. \"i can't honestly think of another prime minister who has done this outside of an election period,\" said one downing street aide. <mark>brown</mark>'s extensive tour of meet-and-greets will start in the east midlands today before a cabinet meeting in liverpool on thursday in front of 200 representative members of the public. the pm will then set off for the north-west and west midlands. the trip ends on friday in south wales. the government is keen to portray the unusual schedule of visits as part of an overall package to help reassure the public during the downturn. junior government minister <mark>ivan lewis</mark> said: \"this is the first time that a government is saying there is something they can do about a recession. when times are hard people want government who are on their side, not standing to one side.\" opposition mps suspect that the trip is more of an attempt to drum home policy and \"warm up\" labour heartlands in advance of a general election. mr <mark>cameron</mark> has also embarked on a series of speeches at events across the country revealing the conservative party's economic alternatives to <mark>brown</mark>'s plans. the child death toll in gaza has today topped 100, with conservative estimates putting it at 101 dead children since fighting began 11 days ago. bmf: london's bus lane access for motorcycles - the key to universal access say bmf diabetes uk: diabetes alert - one person diagnosed every three minutes in the uk politics.co.uk's new jobs section, for government, public sector and public affairs roles."}]