[{"date": "2015-03-31", "url": "http://www.sys-con.com/node/3318741", "content": "Mike Kavis News Feed Item Oxysure (OXYS) Reports Fourth Quarter and Full-Year 2014 Results FRISCO, TX--(Marketwired - March 31, 2015) - OxySure Systems, Inc. (OTCQB: OXYS) (\"OxySure,\" or the \"Company\" ), today announced financial and operating results for the fourth quarter and year ended December 31, 2014. Revenues were $2.4 million, up 35%, led by an 83% increase in revenues in the US Model 615 shipments up 18%; Replacement cartridge shipments up 35% Replacement cartridges up to 144% of Model 615 shipped Julian T. Ross, Chairman of the Board and Chief Executive Officer of OxySure stated, \"We are pleased to have grown the business once again, while remaining focused on building a solid medical device platform to leverage growth opportunities going forward. We are now remarkably well-positioned as an emerging medical device leader to achieve our goals for 2015 and beyond. These goals include rapidly growing our direct sales force, expanding overseas, launching a direct to consumer (DTC) campaign, uplisting our company to NYSE or Nasdaq, and making strategic acquisitions .\" For the fiscal year ended December 31, 2014, revenues increased by 35% to $2,437,402 from $1,800,327 in 2013. The increase was primarily driven by an 83% surge in revenues in the United States. The revenue increase in the US was driven primarily by an increase in sales from products for the military in connection with a teaming agreement. For the Company's Model 615 portable emergency oxygen product, unit cartridge reorder rates continued to increase as the installed base of Model 615 increases, continuing the trend of a very \"sticky\" customer relationship with the product upon adoption. Unit cartridge shipments as a percentage of Model 615 shipments increased to 144% in FY2014 from 125% in FY2013. Cartridges as a percentage of the Model 615 installed base as at December 31, 2014 increased to 45%, up from 39.3% as at December 31, 2013. During FY2014, Model 615 shipments increased 18% versus FY2013, and replacement cartridge shipments increased 35% versus FY2013. This continues to be consistent with historical trends of rising reorders as customers become more accustomed to OxySure's products. Gross profit was $1,018,355 for the twelve months ended December 31, 2014, a decrease of 15.7% from $1,207,341, primarily due to the effect of an increase in absorbed rent expense and labor cost. Adjusted for these rent and labor expenses gross profit was $1,352,746 representing a gross margin of 56%. Selling, general and administrative expenses for 2014 were $2,469,711 compared to $1,339,624 for fiscal year 2013. The Company increased sales and marketing expenses by 104% to $718,705 as it expanded its sales and marketing, branding and investor relations efforts. General and administrative expenses also increased by 78% to $1,751,006 primarily as a result of an increase in employee stock option expense, an increase in salaries and wages, and an increase in professional fees. Professional fees increased primarily due to legal and accounting fees related to an acquisition transaction the Company pursued during the second half of 2014 but did not consummate during FY2014. Interest expense increased to approximately $907,612 in the twelve months ended December 31, 2014, as compared to $249,979 in the twelve months ended December 31, 2013, primarily as a result of the amortization of debt discount and beneficial conversion features (BCF). The Company recorded approximately $747,612 in non-cash interest related to debt discount amortization during the twelve months ended December 31, 2014, as compared to $207,239 during the twelve months ended December 31, 2013. Net loss during fiscal year ended December 31, 2014 was $2,753,560, or $0.10 per share, as compared to $712,452 or $0.03 per share for fiscal year ended December 31, 2013. The weighted average shares outstanding were 26,367,254 and 23,754,402 for fiscal year 2014 and 2013, respectively. The Company's balance sheet remained strong. Cash was $647,093 at December 31, 2014 as compared to $657,673 at December 31, 2013. Working capital was a surplus of $418,734 at December 31, 2014 as compared to a surplus of $747,473 at December 31, 2013. The Company's current ratio was 1.3 as at December 31, 2014. Cash from financing activities was down 24% to $1.16 million during FY2014 from $1.52 million during FY2013. The Company had deferred income tax assets of $5,588,365 and $4,733,483 for the years ended December 31, 2014 and 2013 respectively which were offset in full by a valuation allowance. OxySure enters 2015 in a remarkably strong position as an emerging medical device leader. Over the past 12 months, the Company: Expanded its international distribution footprint by adding new distributors such as HTM Medico for Singapore, and Ajad Medical for Saudi Arabia; Received CE Mark Approval for the OxySure Model 615 Portable Emergency Oxygen Device, a critical step toward launching the product into the 30 countries belonging to the European Economic Area (EEA); Commenced a pilot for a cloud-based tracking and incident reporting system; Made significant progress on the development of new products for the military; Secured Cliff Meidl, two-time Olympian and Team USA Olympic Flag Bearer to be a Spokesman and Special Advisor exclusively to the Company; Was selected by the United States Patent and Trademark Office (USPTO) as one of 10 companies, including Caterpillar, Qualcomm and others to exhibit its product and related technologies at the Innovation Expo held at the Smithsonian; Made significant staffing additions to enhance medical device platform capability, including a VP of Resuscitation Sales, Director of Regulatory Affairs and Quality Assurance, and additions in engineering, manufacturing and territory sales management; and Opportunistically invested in operational efficiencies. The Company plans to continue its focus on growth by expanding its direct sales force and its global distribution channel. The Company also plans to ramp up its sales and marketing activities to raise market awareness and grow its brand, while maintaining a focus on regulatory approvals and compliance and reductions in product costs and operational costs. These initiatives and investments will result in higher sales for OxySure in the future, and at the same time expand OxySure's leadership position in the emergency/short-duration oxygen market and the pre-hospital medical emergency market in general. \"We are excited about 2015 as we anticipate continued growth, new opportunities and even the possibility of catalytic events,\" said Mr. Ross. \"We plan to continue to work hard to improve our products, our competitive position, and our category leadership, while striving to maintain our culture of innovation as we grow .\" OxySure's CEO Julian Ross will host the conference call to discuss the Company's fiscal year 2014 results. Date: Tuesday, March 31, 2015 Time: 9:00 am ET US Dial-In: 1 (800) 697-5978 Audience US Toll Free International Dial-In: 1 (630) 691-2750 Audience US Toll OxySure Systems, Inc. (OXYS) is a medical technology company that focuses on the design, manufacture and distribution of specialty respiratory and medical solutions. The company pioneered a safe and easy to use solution to produce medically pure (USP) oxygen from inert powders. The company owns numerous issued patents and patents pending on this technology which makes the provision of emergency oxygen safer, more accessible and easier to use than traditional oxygen provision systems. OxySure's products improve access to emergency oxygen that affects the survival, recovery and safety of individuals in several areas of need: (1) Public and private places and settings where medical emergencies can occur; (2) Individuals at risk for cardiac, respiratory or general medical distress needing immediate help prior to emergency medical care arrival; and (3) Those requiring immediate protection and escape from exposure situations or oxygen-deficient situations in industrial, mining, military, or other \"Immediately Dangerous to Life or Health\" (IDLH) environments. Statements in this earnings release that are not historical facts are considered to be forward-looking statements. Such statements include, but are not limited to, statements regarding management beliefs and expectations, based upon information available at the time the statements are made, regarding future plans, objectives and performance. All forward-looking statements are subject to risks and uncertainties, many of which are beyond management's control and actual results and performance may differ significantly from those contained in forward-looking statements. OxySure Systems, Inc. intends any forward-looking statement to be covered by the Litigation Reform Act of 1995 and is including this statement for purposes of said safe harbor provisions. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date of this news release. OxySure Systems, Inc. undertakes no obligation to update any forward-looking statements to reflect events or circumstances that occur after the date as of which such statements are made. A discussion of certain risks and uncertainties that could cause actual results to differ materially from those contained in forward-looking statements is included in OxySure Systems, Inc.'s Annual Report on Form 10-K for the year ended December 31, 2014. OXYSURE SYSTEMS INC.. BALANCE SHEETS December 31, 2014 2013 ASSETS----------------------------------------------Current assets Cash and cash equivalents $647,093 $657,673 Accounts receivable, net 369,575 47,183 Inventories 277,346 287,666 License fee receivable 463,308 500,000 Prepaid expenses and other current assets 53,588 107,305 Total current assets 1,810,910 1,599,827 Property and equipment, net 91,537 70,249 Intangible assets, net 362,764 392,746 Other assets, net 246,237 289,532 TOTAL ASSETS $2,511,448 $2,352,354 LIABILITIES AND STOCKHOLDERS' EQUITY----------------------------------------------Current liabilities Accounts payable and accrued expenses $558,338 $147,719 Related party payable 154,850 118,627 Deferred revenue - 2,976 Capital leases - current 149 309,129 Notes payable - current, net of discount 40,897 44,000 Convertible notes payable, net of discount 637,942 229,903 Total current liabilities 1,392,176 852,354 Long-term liabilities Capital leases - 554 Notes payable, net of discount 44,484 76,072 Total long-term liabilities 44,484 76,626 TOTAL LIABILITIES 1,436,660 928,980 COMMITMENTS AND CONTINGENCY (NOTE 9) STOCKHOLDERS' EQUITY----------------------------------------------Preferred stock, par value $0.0005 per share; 25,000,000 shares authorized; 593,750 Series A convertible preferred shares issued and outstanding as of December 31, 2014 and 743,750 shares issued and outstanding as of December 31, 2013. 296 371 1,145 Series B convertible preferred shares issued and outstanding as of December 31, 2014 and 750 shares issued and outstanding as of December 31, 2013. 1 - Common stock, par value $0.0004 per share; 100,000,000 shares authorized; 28,438,631 shares of voting common stock issued and outstanding as of December 31, 2014 and 25,854,307 shares issued and outstanding as of December 31, 2013 11,377 10,343 Additional Paid-in Capital 19,104,322 16,700,307 Accumulated deficit (18,041,208) (15,287,647) TOTAL STOCKHOLDERS' EQUITY 1,074,788 1,423,374 TOTAL LIABILITIES AND STOCKHOLDERS' EQUITY $2,511,448 $2,352,354 OXYSURE SYSTEMS INC.. STATEMENTS OF OPERATIONS For the year ended December 31, 2013 2014 Revenues, net $2,437,402 $1,800,327 Cost of goods sold 1,419,047 592,986 Gross profit 1,018,355 1,207,341 Operating expenses Research and development 583,435 356,015 Sales and marketing 718,705 353,156 Other general and administrative 1,751,006 986,468 Loss from operations (2,034,791) (488,298) Other income (expenses) Other income (expense) 188,843 25,825 Interest expense (907,612) (249,979) Total other income (expenses) (718,768) (224,154) Net loss $(2,753,560) $(712,452) Basic net income (loss) per common share $(0.10) $(0.03) Diluted net income (loss) per common share $(0.10) $(0.03) Weighted average common shares outstanding: Basic 26,367,254 23,754,402 Diluted 26,367,254 23,754,402 OXYSURE SYSTEMS INC.. STATEMENTS OF CASH FLOWS Year Ended December 31, 2014 2013 CASH FLOWS FROM OPERATING ACTIVITIES: $(712,452) Net income (loss) $(2,753,560) Adjustments to reconcile net income (loss) to net cash from operating activities: 53,159 Depreciation and amortization expense 42,151 Amortization of debt discount and beneficial 207,239 conversion features 747,612 - Gain on forgiveness of debt 14,466 - Gain on settlement of debt (90,912) - Derivative liability fair value adjustment 3,001 37,335 Expenses paid by related parties 4,374 - Expenses paid on behalf of third party 150,000 61,480 Stock based compensation 136,944 126,756 Common stock issued for services 64,873 Changes in operating assets and liabilities: (28,697) Accounts receivable (322,392) (66,321) Inventories 10,320 (500,000) License fees receivable 36,692 106,148 Other assets 125,531 (72,601) Accounts payable and accrued liabilities 763,046 - Prepaid expense (28,519) (72,837) Deferred revenue (2,976) (860,791) NET CASH USED IN OPERATING ACTIVITIES (1,099,349) CASH FLOWS FROM INVESTING ACTIVITIES (12,105) Purchase of property and equipment (68,080) (4,262) Purchase of intangible assets (198) (16,367) NET CASH USED IN INVESTING ACTIVITIES (68,278) CASH FLOWS FROM FINANCING ACTIVITIES 347,364 Common stock issued for cash 29,701 Series B preferred stock issued for cash and 750,000 warrants 525,000 216,800 Common stock issued for cash and warrants - 42,470 Cash received from related parties 9,800 (268,950) Payments made to related parties (227,951) - Payments made on notes payable - 431,500 Cash received from convertible notes payable 1,168,200 - Payments made on convertible notes payable (200,201) (2,254) Payments on capital leases (151,872) 4,388 Exercising of warrants 4,370 1,521,318 NET CASH PROVIDED BY FINANCING ACTIVITIES 1,157,047 644,160 Net change in cash and cash equivalents (10,580) Cash and cash equivalents, at beginning of 13,513 period 657,673 $657,673 Cash and cash equivalents, at end of period $647,093 Supplemental disclosure of cash flow information: Cash paid during the period for: $18,792 Interest $- $- Income taxes $- Supplemental non-cash investing and financing activities: $- Initial value of derivative $28,009 48,012 Capitalization of deferred loan costs - Common stock issued for services and rent 179,710 extension - Common stock issued for capitalized website 114,180 development costs - Common stock issued in connection with lease - extinguishment 66,750 Cashless exercise of warrants for forgiveness 14,700 of debt - 447,748 Conversion of convertible notes payable 625,913 317,609 Benefical conversion feature 951,423 Conversion of Series A preferred stock to 38 common stock 74 423,413 Conversion of accrued rent to common stock - www.redchip.com / Published March 31, 2015 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. SYS-CON Events announced today that Creative Business Solutions will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. Creative Business Solutions is the top stocking authorized HP Renew Distributor in the U.S. Based out of Long Island, NY, Creative Business Solutions offers a one-stop shop for a diverse range of products including Proliant, Blade and Industry Standard Servers, Networking, Server Options and...SOA Software has changed its name to Akana. With roots in Web Services and SOA Governance, Akana has established itself as a leader in API Management and is expanding into cloud integration as an alternative to the traditional heavyweight enterprise service bus (ESB). The company recently announced that it achieved more than 90% year-over-year growth. As Akana, the company now addresses the evolution and diversification of SOA, unifying security, management, and DevOps across SOA, APIs, microser...The webinar, hosted by XebiaLabs, will feature 4 experts including Special Host <mark>Gene Kim</mark>, author of The Phoenix Project, along with IT thought leaders Gary Gruver, Randy Shoup and XebiaLabs' <mark>Andrew Phillips</mark>. The panel brings more than 30 years of collective experience surrounding microservices transformations at major companies including Google, eBay and Tripwire. \"The story around microservices and containers is pretty compelling and the attraction of more flexibility is obviously alluring,\" ...Wearable technology was dominant at this year's International Consumer Electronics Show (CES), and MWC was no exception to this trend. New versions of favorites, such as the Samsung Gear (three new products were released: the Gear 2, the Gear 2 Neo and the Gear Fit), shared the limelight with new wearables like Pebble Time Steel (the new premium version of the company's previously released smartwatch) and the LG Watch Urbane. The most dramatic difference at MWC was an emphasis on presenting we...SYS-CON Events announced today that FierceDevOps will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. FierceDevOps keeps software developers and IT operations personnel updated on the latest news and trends around the rapidly evolving role of the traditional IT worker. WHOA.com has announced the newest addition to its data center footprint with the expansion into Equinix's newest state-of-the-art facility: DC-11 Washington, DC IBX +. Located in Ashburn, VA, this data center expands Whoa.com's presence to meet rapidly expanding customer demand for secure cloud solutions. Equinix, Inc. operates International Business Exchange ™ (IBX ®) data centers in 32 markets across 15 countries in the Americas, EMEA, and Asia-Pacific. Equinix is committed to operating faciliti...SYS-CON Events announced today that robomq. io will exhibit at SYS-CON's @ ThingsExpo, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. robomq. io is an interoperable and composable platform that connects any device to any application. It helps systems integrators and the solution providers build new and innovative products and service for industries requiring monitoring or intelligence from devices and sensors. Today, IT is not just a cost center. IT is an enabler and driver of business. With the emergence of the hybrid cloud paradigm, IT now has increasingly more capabilities to create new strategic opportunities for a business. Hybrid cloud allows an organization to utilize multi-tenant public clouds, dedicated private clouds, bare metal hosting, and the associated support and services for the right use cases through an on-demand, XaaS model. This model of IT creates tremendous opportunities for busi...SYS-CON Events announced today that the DevOps Institute has been named \"Association Sponsor\" of SYS-CON's DevOps Summit, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. The DevOps Institute provides enterprise level training and certification. Working with thought leaders from the DevOps community, the IT Service Management field and the IT training market, the DevOps Institute is setting the standard in quality for DevOps education and training. Business as usual for IT is evolving into a \"Make or Buy\" decision on a service-by-service conversation with input from the LOBs. How does your organization move forward with cloud? In his general session at 16th Cloud Expo, Paul Maravei, Regional Sales Manager, Hybrid Cloud and Managed Services at Cisco, discusses how Cisco and its partners offer a market-leading portfolio and ecosystem of cloud infrastructure and application services that allow you to uniquely and securely combine cloud busi...Businesses are looking to empower employees and departments to do more, go faster, and streamline their processes. For all workers - but mobile workers especially - utilizing the cloud to reconnect documents and improve processes without destructing existing workflows can have a dramatic impact on productivity. In his session at 16th Cloud Expo, Mark Grilli, vice president of Acrobat Solutions marketing at Adobe Systems Incorporated, will outline new ways that the cloud is changing the way peo...WSM International has launched a DevOps services division that offers assessment, consulting and implementation to large enterprises and organizations with complex infrastructures. The concept of DevOps is to blend information technology (IT) software development with operations to optimize the computing infrastructure according to the specific needs of the organization. According to a recent press release from Gartner, \"By 2016, DevOps will evolve from a niche strategy employed by large cloud...SYS-CON Events announced today that Solgenia will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY, and the 17th International Cloud Expo ®, which will take place on November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA. Solgenia is the global market leader in Cloud Collaboration and Cloud Infrastructure software solutions. Designed to\" Bridge the Gap \"between Personal and Professional S.. . SYS-CON Events announced today that QTS Realty Trust, one of the nation's largest and fastest-growing providers of data center facilities and cloud services and a leader in security and compliance, will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. QTS Realty Trust, Inc. (NYSE: QTS) is a leading national provider of data center solutions and fully managed services, and a leader in security and compliance...SYS-CON Events announced today that WSM International (WSM), the world's leading cloud and server migration services provider, will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. WSM is a solutions integrator with a core focus on cloud and server migration, transformation and DevOps services. Making Financial Sense of PaaS, Part Deux Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) Being a huge supporter of Platform-as-a-Service (PaaS), specifically, container-based PaaS, such as CloudFoundry and Heroku, I decided to apply my pricing experience to hacking up an estimate for delivering a mobile application inclusive of development through operations. The goal for me was to see if my own assertions that PaaS actually reduced both development and operating costs could be suppor...Mar. 31, 2015 08:00 AM EDT Reads: 1,295 WebRTC, un standard du Web, pas un produit WebRTC? Si vous n'en avez pas encore entendu parlé, il est important que vous découvriez une technologie qui va profondément changer les modes de communication de tous vos collaborateurs. Je vais m\" intéresser en priorité aux potentiels à moyen terme de cette technologie; il existe encore des limites techniques importantes, mais elles vont sauter dans les mois qui viennent. Les entreprises peuve...Mar. 31, 2015 08:00 AM EDT Reads: 1,766 One of the most difficult things to do today is to identify a legitimate user. Part of the problem is that the definition of a legitimate users depends greatly on the application. Your public facing website, for example, may loosely define legitimate as \"can open a TCP connection and send HTTP request\" while a business facing ERP or CRM system requires valid credentials and group membership as wel...Mar. 31, 2015 08:00 AM EDT Reads: 1,088 DevOps & Hybrid Clouds: A Match Made in Heaven? It seems today we are in a constant state of business and technology disruption. The convergence of the social, mobile, analytics, and cloud (SMAC) disruptions have both forced and enabled organizations to move at breakneck speeds addressing the needs and expectations of the lines of business/end users. This speed requires the development teams to be agile. They must be able to respond quickly to...Mar. 31, 2015 08:00 AM EDT Reads: 683 Containers & Microservices at Cloud Expo The 16th Cloud Expo has added coverage containers and microservices to its program for New York, to be held June 9-11 at the Jacob Javits Convention Center. Cloud Expo has long been the single, independent show where delegates and technology vendors can meet to experience and discuss the entire world of the cloud. This year will be no different. Containers are an old concept that saw renewed...Mar. 31, 2015 07:00 AM EDT Reads: 2,256 Making Financial Sense of PaaS, Part Deux As pointed out by Mark, it's very easy to make the cloud look financially attractive when pricing out a single application versus a portfolio of applications. Indeed, I would have to agree one of the most difficult things is to formulate an apples-to-apples comparison of cloud to data center. Even with the concept of reservations, the cloud cannot come close to the amortization of capital allocati...Mar. 31, 2015 04:30 AM EDT Reads: 474 Internet of Things Becomes High Fashion Wearable technology was dominant at this year's International Consumer Electronics Show (CES), and MWC was no exception to this trend. New versions of favorites, such as the Samsung Gear (three new products were released: the Gear 2, the Gear 2 Neo and the Gear Fit), shared the limelight with new wearables like Pebble Time Steel (the new premium version of the company's previously released smartw...Mar. 31, 2015 03:00 AM EDT Reads: 1,525 Our guest on the podcast this week is Jason Bloomberg, President at Intellyx. When we build services we want them to be lightweight, stateless and scalable while doing one thing really well. In today's cloud world, we're revisiting what to takes to make a good service in the first place. microservices Listen in to learn why following \"the book\" doesn't necessarily mean that you're solving key bu...Mar. 31, 2015 03:00 AM EDT Reads: 1,144 How You Integrate Network Services Matters Polymorphism is a concept central to object-oriented programming. The notion of polymorphism is used to extend the capabilities of a basic object, like a mammal, to specific implementations, like cats or dogs or honey badgers, even though they don't care about such technical distinctions. A good example of this is cats and dogs, which are both of the type \"mammal\" but that \"speak\" in a different v.. . Mar. 31, 2015 02:00 AM EDT Reads: 1,195 State of Application Delivery 2015: Full-stack Security Confidence Security is one the more prominent of the application service categories, likely due to its high profile impact. After all, if security fails, we all hear about it. The entire Internet. Forever. So when one conducts a survey on the state of application delivery (which is implemented using application services) you kinda have to include security. Which of course, we did. Mar. 31, 2015 02:00 AM EDT Reads: 1,410 In celebration of International Women's Day, we'd like to shine the spotlight on our very own Anita Engleder, DevOps Lead at ruxit. DevOps is definitely a male-dominated domain so \"doing DevOps #LikeAGirl\" is no small achievement here. I met with Anita earlier this week and asked her a few questions about the #LikeAGirl movement, working in the male-dominated tech industry, and whether or not t.. . Mar. 30, 2015 10:00 PM EDT Reads: 1,537 I first met Alan in New York City at the 2014 CloudExpo just after starting my new role at VictorOps. Known as \"Shimmy\" to most in the DevOps community, Alan launched DevOps.com as a resource for DevOps education and community building. Shimmy and I reconnected again in Houston where I gave a talk on ChatOps at Camp DevOps. A self-described serial entrepreneur and business executive, Alan has f.. . Mar. 30, 2015 06:15 PM EDT Reads: 1,361 Our guest on the podcast this week is Mark Thiele, EVP of Data Center Technology at Switch. We discuss the idea that private clouds are often equated with do-it-yourself and why that should be changed. Taking sure you are receiving the private environment you need at a cost that can support your business. Listen in to learn the different ways to own and manage a private cloud. Mar. 30, 2015 05:00 PM EDT Reads: 2,047 WHOA.com \"Bronze Sponsor\" of Cloud Expo SYS-CON Events announced today that WHOA.com, an ISO 27001 Certified secure cloud computing company, has been named \"Bronze Sponsor\" of SYS-CON's 16th International Cloud Expo ® New York, which will take place June 9-11, 2015, at the Javits Center in New York City, NY. WHOA.com is a leader in next-generation, ISO 27001 Certified secure cloud solutions. WHOA.com offers a comprehensive portfolio of...Mar. 30, 2015 04:00 PM EDT Reads: 1,321 The Era of the IoT On-Demand Economy The presentation describes the emergence of the On Demand Economy, how new super-scale ventures like Uber taxis, Airbnb and others are transforming the fundamental operating models for corporations and consequently destroying the competition in the industries they are disrupting. They do so by leveraging the peer to peer model, cultivating marketplace models for dynamically matching demand and su...Mar. 30, 2015 03:00 PM EDT Reads: 633 Increasingly, Pay Per Use Is Paying Off You hear the terms \"subscription economy\" and \"subscription commerce\" all the time. And with good reason. Subscription-based monetization is transforming business as we know it. But what about usage? Where's the \"consumption economy\" ? Turns out, it's all around us. When most people think of usage-based billing, the example that probably comes to mind first is metered public utilities - water, g.. . Mar. 30, 2015 02:45 PM EDT Reads: 779 Recent announcements from Google about the future of Glass naturally ignited an explosion of commentary in the tech media. For those of us in the Glass at Work world, the news that Glass has \"graduated\" from Google [x] into a true business unit headed by Tony Fadell is very promising. Yet many outlets' coverage focused on the end of the Glass Explorer program for consumers, characterizing it as the...Mar. 30, 2015 02:30 PM EDT Reads: 967 File Governance Policies and Features With recent high profile data breaches companies should ensure they have the five following file governance policies in place in their company to secure their file assets. Ensure that an Identity Management policy is in-place, is clear, and if one exists that it is validated and checked regularly. Check whether services and applications can take advantage of existing Identity Management to enabl...Mar. 30, 2015 02:00 PM EDT Reads: 625 Optimizing IoT and Mobile Communications There's a lot of focus on the performance of mobile communications given the incredible rate at which mobile is outpacing legacy PC (did you ever think we'd see the day when we called it that?) usage. There's been tons of research on the topic ranging from the business impact (you really can lose millions of dollars per second of delay) to the technical mechanics of how mobile communications is im...Mar. 30, 2015 02:00 PM EDT Reads: 1,376 This month I want to revisit supporting infrastructure and datacenter environments. I have touched (some would say rant) upon this topic since my post in April 2014 called \"Take a Holistic View of Support\". My thoughts and views on this topic have not changed at all: it's critical for any organization to have a holistic, comprehensive strategy and view of how they support their IT infrastructure a.. . Making Financial Sense of #PaaS, Part II @ DevOpsSummit [#DevOps] FierceDevOps to Exhibit at @ DevOpsSummit New York | @ FierceDevOps [#DevOps] Solgenia to Exhibit at @ CloudExpo NY & Silicon Valley | @ Solgenia_Corp [#Cloud] Declarative vs. Imperative Models By @ ScriptRock | @ DevOpsSummit [#DevOps] Containers and Microservices On the Agenda at @ CloudExpo By @ IoT2040 [#DevOps] DevOps Institute \"Association Sponsor' of @ DevOpsSummit | @ DevOpsInst [#DevOps] Technology Hype Lifecycle: Google Glass By @ KyleSamani | @ ThingsExpo [#IoT]. @ OmniTI Announces DevOps Customer Successes | @ DevOpsSummit [#DevOps] Rackspace to Present at @ CloudExpo New York | @ Rackspace [#Cloud] Increasingly, Pay-Per-Use Is Paying Off By @ AriaSystemsInc | @ CloudExpo [#Cloud] Internet of Things and Internet of Everything By @ CiscoGovt | @ ThingsExpo [#IoE #IoT] Painless Polyglot Persistence By @ IBMCloud | @ CloudExpo [#Cloud] State of Application Delivery By @ LMacVittie | @ DevOpsSummit [#DevOps] The Digital Application Economy By @ JackieKahle | @ ThingsExpo [#IoT] The Largest WebRTC Resource Launched By @ ThingsExpo [#IoT #WebRTC] Welcome to the Slope of Enlightenment By @ bcferrycoder | @ DevOpsSummit [#DevOps] Announcing @ MangoSpring to Exhibit at @ CloudExpo New York & Silicon Valley Introducing App Deployment in 25 Seconds By @ ActiveState | @ DevOpsSummit [#DevOps] Sematext's @ DevOpsSummit Blog Exceeds 30,000 Reads | @ Sematext [#DevOps] Engineering-Driven Delivery Model By @ Dynatrace | @ DevOpsSummit [#DevOps] File Governance Policies and Features By @ JimLiddle | @ CloudExpo [#Cloud] Announcing @ Creative_Busine to Exhibit at @ CloudExpo New York [#Cloud] Windows Server 2003 Migration By @ AppZero_Inc | @ CloudExpo [#Cloud] Availability Is a Coat of Many Colors By @ LMacvittie | @ CloudExpo [#Cloud] Cloud Expo Launches\" Microservices Journal \"| @ CloudExpo [#Microservices] ThingsExpo World's Most Influential M2M Media Brand @ ThingsExpo [#IoT] Will Automated Alerting Replace the NOC? By @ PagerDuty | @ DevOpsSummit [#DevOps] Securing the SDDC with @ TufinTech at @ CloudExpo New York [#Cloud] SafeLogic's\" Kosher Data Encryption \"at @ CloudExpo | @ SafeLogic [#Cloud] Announcing @ Plutora to Exhibit at @ DevOpsSummit New York [#DevOps] Surviving a Datacenter Outage By @ PagerDuty | @ DevOpsSummit [#DevOps] SDK Support for @ Atmel Internet of Things By @ PubNub | @ ThingsExpo [#IoT] WebRTC Startup @ TemasysRTC Appoints Leaders | @ ThingsExpo [#WebRTC] WebRTC + Internet of Things By @ LiveOps | @ ThingsExpo [#IoT #WebRTC] Containers and Microservices at @ CloudExpo New York By @ IoT2040 [#Cloud] MTA Awards @ VicomComputer Long Term Technology Agreement | @ CloudExpo [#Cloud] Monetizing Big Data with Hadoop By @ MapR | @ BigDataExpo [#BigData] Jesse Proudman of @ Bluebox with @ MadGreek65 | @ DevOpsSummit [#DevOps] The Automation Opportunity By @ Automic | @ DevOpsSummit [#DevOps] Financial Sense of #PaaS By @ JPMorgenthal | @ DevOpsSummit [#DevOps] SoftLayer\" Platform Track \"at @ CloudExpo | @ SoftLayer | [#IoT #DevOps] Secure Cloud @ WhoaCloud Named\" Bronze Sponsor \"of @ CloudExpo [#Cloud] OpenShift Commons Latest in Battle with Cloud Foundry By @ IoT2040 | @ DevOpsSummit [#DevOps] Operational Hadoop for Streaming Data By @ MapR | @ CloudExpo [#BigData] Moore's Law & Hadoop By @ MasonKatz | @ CloudExpo [#Cloud #BigData] Internet of Things Is the New Big Data? By @ JimKaskade | @ ThingsExpo [#IoT #BigData] UX for the\" Internet of Things' By @ PARCinc | @ ThingsExpo [#IoT] Monetize This! Internet of Things By @ MetraTech | @ ThingsExpo [#IoT] DevOps Can Learn from Enterprise By @ Plutora | @ DevOpsSummit [#DevOps] Internet of Things New York Keynote Proposals | @ ThingsExpo [#IoT #M 2M] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Locking Down Data with @ Vormetric's Derek @ Tumulak | @ CloudExpo [#Cloud] Private vs Public Cloud with Erik Levitt of @ OpenDataCenters | @ CloudExpo [#Cloud] Microservices Unplugged By @ DavidSprott | @ DevOpsSummit [#DevOps] DevOps Summit Was a Terrific Event! By @ QubellInc | @ DevOpsSummit [#DevOps] Modern Collaborative Troubleshooting By @ AppDynamics | @ DevOpsSummit [#DevOps] Announcing @ IsomorphicHQ to Exhibit at @ DevOpsSummit New York [#DevOps] IGEL thin clients to integrate with Imprivata ® OneSign ™ to deliver secure, No Click Access ™ to virtual desktops Red Hat Governance For DevOps | @ RedHatNews @ DevOpsSummit [#DevOps] Cloud Is All About Workload By @ ABridgwater | @ CloudExpo [#Cloud] Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $600 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires March 31, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in New York [June 9-11, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2015033112_00074275_W", "names": {"Andrew Phillips": ["Q17385572", "Q28868053", "Q4758268", "Q4758269", "Q4758271"], "Gene Kim": ["Q55153249", "Q5531290"]}}, {"date": "2015-04-01", "url": "http://www.guitarworld.com/van-halen-perform-hot-teacher-eruption-and-you-really-got-me-jimmy-kimmel-live-video", "content": "Inventing the Steel: How to Solo Like Angus Young, <mark>Jimmy Page</mark> and Tony Iommi Joe Satriani, Tosin Abasi and Guthrie Govan Join Forces for 2015 G4 Experience - Video Kurt Cobain Talks Gear and More in His Final Guitar World Interview from 1992 Black Sabbath's Geezer Butler and Tony Iommi on Fighting with Skinheads, \"War Pigs\" Inspiration and More In Deep with Andy Aledort: Ozzy Osbourne's \"I Don't Know\" Video Lesson The Guitar Drum, a New Percussive Acoustic Guitar Device - Video The Guitar Drum, a New Percussive Acoustic Guitar Device - Video Van Halen Perform \"Hot for Teacher,\" \"Eruption\" and \"You Really Got Me\" on \"<mark>Jimmy Kimmel</mark> Live' - Video Van Halen Perform\" Panama \"and\" Runnin' with the Devil \"on\" <mark>Jimmy Kimmel</mark> Live' - Video Eddie Van Halen Tests New EVH Gear 5150IIIS Amp Head - GoPro Video Dear Guitar Hero: <mark>Dave Davies</mark> Talks Kinks Reunion, His Kinks-Era Gibson Flying V, New Album and More Video: Brad Paisley Plays Van Halen's \"Hot For Teacher\" with 6-Year-Old Drummer 100 Greatest Guitar Solos: No. 46 \"Hot For Teacher\" (Eddie Van Halen) The Next Bend: Clarence White-Inspired Country B-Bender Lick in A - Video closed down part of Hollywood Boulevard Monday night so that Van Halen could perform in front of 6,000 die-hard fans. The first half of the band's outdoor performance, which included \"Panama\" and \"Runnin' with the Devil,\" was broadcast Monday night (and shared on GuitarWorld.com Tuesday). Last night, the show broadcast several more tunes from the event, including \"Hot for Teacher,\" \"Eruption\" and the Kinks' \"You Really Got Me .\" You can watch these last three songs in the pro-shot videos below. Some of you might notice that David Lee Roth is wearing a bandage on his nose. \"They opened with\" Panama,' but during <mark>Dave</mark>'s microphone-stand ninja moves, he cut his nose, \"says Andy Alt of Los Angeles, who was at the show .\" You can see he's dealing with it in some of the fan-shot videos-until he realizes they needed a bandage to stop the bleeding. \"It was a live taping, so Roth announced they needed to start over. However, it appears Roth didn't tell Eddie [Van Halen] that he was stepping off stage, so Eddie performed an impromptu guitar solo, which was cool and unexpected. The <mark>Kimmel</mark> performance is an extended part of Van Halen's 2015 North American summer and fall tour, which kicks off in earnest July 5 in Seattle. Tickets go on sale April 4. Van Halen's new live album, Tokyo Dome Live in Concert Eventide Announces H9 Max Spring Giveaway: Win an H9 MAX Stompbox Inventing the Steel: How to Solo Like Angus Young, <mark>Jimmy Page</mark> and Tony Iommi", "articleID": "2015040118_00035319_W", "names": {"Dave Davies": ["Q364890", "Q5228642"], "Jimmy Kimmel": ["Q20793563", "Q4914"], "Jimmy Page": ["Q10426092", "Q165467"]}}, {"date": "2015-04-02", "url": "http://news.yahoo.com/us-resettle-more-syrian-refugees-near-future-142513509.html", "content": "BEIRUT (AP) - A U.S. official says Washington is planning to increase the number of Syrian refugees allowed to resettle in the United States, mostly for vulnerable cases. Assistant Secretary of State <mark>Anne Richard</mark> says the numbers will still be very small compared with the nearly 4 million Syrians who have become refugees in neighboring countries, mostly Lebanon, Jordan and Turkey. <mark>Richard</mark> told reporters at the U.S. Embassy in Beirut on Thursday that the U.S. has received 648 Syrian refugees since the crisis began in 2011. She says the U.S. is \"moving to bring more refugees to the United States, and that between 1,000 and 2,000 will be brought in by the end of September. <mark>Richard</mark> says Washington seeks to bring\" those who have severe medial conditions, widows and orphans \"and traumatized people. <mark>Anne Richard</mark> Syrian refugees", "articleID": "2015040214_00050768_W", "names": {"Anne Richard": ["Q27995611", "Q2851261"]}}, {"date": "2015-04-02", "url": "http://www.pennlive.com/pennstatefootball/index.ssf/2015/04/penn_state_corner_trevor_willi.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to STATE COLLEGE--It really wasn't all that long ago, the spring of 2013, that <mark>Trevor Williams</mark> was new to defense at the college level, new to corner, and eventually the target of opposing passing attacks come that fall. The Baltimore native came to Penn State as a receiver, catching 10 passes as a freshman and returning four kicks. Then, in his second spring in blue and white, he stopped being a receiver and starter defending them. His first season was up and down; by mid-year, he was no longer a starter. That rough patch is far in the rear view mirror, though. Come August, and Penn State's season-opener against Temple, the rangy defensive back is set to begin his second straight season as a starting cornerback in Bob Shoop's defense. \"It's just been a learning experience; not getting down on myself, talking to guys from the previous teams,\" <mark>Williams</mark> said Wednesday. \"Adrian Amos [was] definitely like a big brother to me, and just working hard on the field and off the field has helped me out a lot .\" <mark>Williams</mark>, who has put on 10 pounds of muscle this winter and now stands 6-foot-1, 196 pounds, had to work hard to get on the field in his first year on defense, at least after Penn State was blown out at Ohio State two years ago. The following week, Amos moved up to corner, and Stephen Obeng-Agyapong, who played just about every where that season, slid back from linebacker to safety. The moment was likely shocking for <mark>Williams</mark>, then a sophomore, but now is merely a blip on his career's radar. <mark>Williams</mark> made 12 starts a year ago (he missed the Temple game), finishing with 27 tackles and two interceptions playing opposite Jordan Lucas. It was a successful season, but as <mark>Williams</mark>' career arc shows, change is possible in any college football program regardless of results. He and Lucas made a dynamic pair, but now the latter is back at safety (replacing Amos, of course), meaning <mark>Williams</mark> will likely play opposite a different corner for the third straight year. \"Grant Haley, he's stepped up this spring, he's doing a lot of great things,\" <mark>Williams</mark> said when asked about the contenders for Lucas' old job. \"Daquan Worley, he's showing some improvement; a lot of the young guys, <mark>Christian Campbell</mark>, <mark>Jordan Smith</mark>, Daquan Davis, the whole secondary room, we're working together, and [corners] Coach [Terry] <mark>Smith</mark> has been helping us out a lot .\" The group vying for snaps at corner is long, and also inexperienced. Haley saw the most snaps of anyone hoping to start a year ago, but head coach <mark>James Franklin</mark> has pointed out Worley's and <mark>Campbell</mark>'s performances this spring. <mark>Smith</mark> and Davis are veterans who have played sparingly on defense during their time in blue and white. Older players, like Amos, helped <mark>Williams</mark> anyway they could, and he's hoping to return the favor. He knows a thing or two about bumpy roads and competition leading to quality production, and if he can use his past hardship to make the starters and contributors on the opposite side of the field from him better, Penn State's defense has a chance to be better, too. h1> \"Nittany Insider' Get the latest in Penn State sports in your inbox daily from PennLive.com. Check here if you do not want to receive additional email offers and information. Thank you for subscribing to the\" Nittany Insider \"Registration on or use of this site constitutes acceptance of our Privacy Policy © 2015 PA Media Group All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of PA Media Group", "articleID": "2015040215_00055562_W", "names": {"Christian Campbell": ["Q20630663", "Q2965115"], "James Franklin": ["Q14950689", "Q14950690", "Q3530165", "Q3895609", "Q56807312", "Q6134186"], "Jordan Smith": ["Q18088815", "Q21622921", "Q27863139", "Q27918274", "Q28748042", "Q3183719", "Q3183720", "Q39069826", "Q55255667", "Q55255725", "Q58643255", "Q5934204", "Q5934211", "Q6277023", "Q6277024"], "Trevor Williams": ["Q18593559", "Q19847289", "Q26837136", "Q27306166", "Q30511571", "Q30601108", "Q7839488", "Q7839489"]}}]