[{"articleID": "2014031215_00085634_W", "names": {"Rob Jones": ["Q1179039", "Q27443340", "Q374688", "Q47140919", "Q59549874", "Q7340256", "Q9310669"], "Jon Daly": ["Q15634765", "Q3433083"]}, "date": "2014-03-12", "url": "http://www.gmanetwork.com/news/story/352238/scitech/science/australia-hatches-first-ivf-shark", "content": "AUSTRALIA, Melbourne: This picture released on March 12, 2014, by the SEA LIFE Melbourne Aquarium shows the first shark pup born in Australia via Artificial Insemination at SEA LIFE Melbourne Aquarium. Australia has successfully hatched its first shark born via artificial insemination with hopes that the development can ultimately be used to help breed threatened species, an aquarium said. AFP PHOTO / HO / SEA LIFE Melbourne Aquarium MELBOURNE - Australia has successfully hatched its first shark born via artificial insemination with hopes that the development can ultimately be used to help breed threatened species, an aquarium said Wednesday. Sea Life Melbourne Aquarium said the brown banded bamboo shark pup was born on March 3, ending a process which began in September when aquarists collected a semen sample from a shark in Mooloolaba in northeastern Australia. This was flown to the southern city of Melbourne and inseminated into the mother the same day-making the pup the first shark to be born globally via a live semen sample transported from one facility to another, Sea Life said. Melbourne Aquarium vet <mark>Rob Jones</mark> said the birth of the shark-which is expected to grow from its initial length of 16 centimeters (6.3 inches) to an adult size of 1.2 to 1.5 meters-was a milestone in using assisted reproductive technologies. \"This is a big leap,\" he told AFP. The hatching is part of a nine-year project into understanding the reproductive behaviors of sharks, animals which are common in Australia but are little understood. The team hope their research will help with plans to manage threatened species in the wild, in particular the critically endangered grey nurse shark. The egg, one of several laid by the shark in November but the only viable one, was monitored weekly during its incubation period of 112 days. \"With each insemination attempt, we continue to learn about the reproductive behaviours of Australian shark species,\" said Melbourne Aquarium research consultant <mark>Jon Daly</mark>. \"Hopefully we can use this technology as a basis for breeding grey nurse sharks in captivity and, in years to come, boost the species' dwindling numbers in the wild .\" Grey nurse sharks are considered critically endangered, with estimates that there could be as few as 1,500 left on Australia's east coast. Sharks are a known danger for those swimming, diving and surfing around the country and are currently subject to a controversial cull in Western Australia state after a series of fatal attacks in recent years. Unang Balita: Close encounter sa mga pating, pwede nang gawin sa isang amusement park sa Maynila Saksi: Basketball team mula sa China, nasa Pilipinas para sa ilang friendly game Kape at Balita: Mangingisda, sugatan matapos atakihin ng mga pating; kasamang pumalaot, patay GMA News Online All Rights Reserved 2014"}, {"articleID": "2020010800_00114213_W", "names": {"Ben Wallace": ["Q263166", "Q295364"]}, "date": "2020-01-08", "url": "http://www.expressandstar.com/news/uk-news/2020/01/08/boris-johnson-to-face-questions-from-mps-on-deepening-crisis-in-gulf/", "content": "Boris Johnson to face questions from MPs on deepening crisis in Gulf UK News | Published: Less than an hour ago The PM's Commons appearance comes after the Defence Secretary said the Government was putting in place \"urgent measures' to protect British nationals. Subscribe to our daily newsletter Sign UpBoris Johnson Boris Johnson will face questions from MPs on the deepening crisis in the Gulf as he takes his first Prime Minister's Questions since the General Election. The PM came under fire for his failure to address the Commons on the Iran situation on Tuesday, with Jeremy Corbyn accusing him of\" hiding behind \"the Defence Secretary <mark>Ben Wallace</mark>. Mr Johnson has been accused of being slow to respond to the crisis--not returning from his new year break on the private Caribbean island of Mustique until the weekend. However, he chaired a meeting of the National Security Council on Tuesday afternoon to discuss the issue and held a Cabinet meeting earlier in the day. The PM's Commons appearance comes after the Defence Secretary said the Government was putting in place\" urgent measures \"to protect British nationals and interests amid rising tensions in the region. Mr <mark>Wallace</mark> said non-essential personnel had been moved out of Baghdad while Royal Navy warships and military helicopters were on heightened readiness to assist if needed. In a Commons statement on Tuesday afternoon, he again appealed for all sides to\" de-escalate \"after the killing of the Iranian military chief Qassem Soleimani in a US drone strike. Advertising At the same time he defended the right of the US to act in self-defence, saying Gen Soleimani had been in neighbouring Iraq when he was hit to\" co-ordinate murder and attacks on US citizens \". British forces in the Middle East (PA Graphics) Mr <mark>Wallace</mark> said the safety and security of UK nationals and interests in the region were of\" paramount concern \". Non-essential personnel had been relocated from Baghdad to the military base at Camp Taji, north of the Iraqi capital, while the Department of Transport was reviewing its advice to British shipping on a daily basis. Advertising\" At the same time, Defence are changing the readiness of our forces--including helicopters and ships on stand-by to assist if the need arises, \"he said .\" As part of prudent planning, a small team has been sent to the region to provide additional situational awareness and contingency planning assistance. \"Watch Jeremy Corbyn answer questions about whether Soleimani was a terrorist pic.twitter.com/qNvJcZGxrn"}, {"articleID": "2012072009_00086040_W", "names": {"Adam Levine": ["Q219631", "Q37840339", "Q4679401"], "Scott Thompson": ["Q16214236", "Q2886450", "Q324114", "Q559081", "Q7437374", "Q7437375", "Q7437376", "Q7437377"]}, "date": "2012-07-20", "url": "http://cnn.com/2012/07/20/us/california-military-gay-parade/index.html", "content": "u.s. military can wear uniform in san diego gay pride parade: defense department by the cnn wire staff updated 5:27 am edt, fri july 20, 2012 the defense department allows service members to wear uniforms at a gay pride parade more than 300 active-duty service members have signed up for the parade, an official says the administration repealed \"don't ask, don't tell\" last year (cnn)--the u.s. department of defense is giving the go-ahead to all active-duty military personnel to wear their uniform to march in a gay pride parade in san diego on saturday, the first time such approval has been given in the united states. the defense department decision followed news that the navy had given approval to sailors to wear their uniform in the parade, which drew hundreds of active-duty service members last year shortly before the administration repealed \"don't ask, don't tell .\" \"based on our current knowledge of the event and existing policies, we hereby are granting approval for service members in uniform to participate in this year's parade,\" rene c. bardorf, deputy assistant secretary of defense for community and public outreach, said in a memorandum released thursday. the blanket approval for the various branches of the military applies only to the 2012 san diego pride parade, bardorf said. just a year ago, an active-duty service member faced punishment or discharge if he or she admitted being homosexual, but last september the administration scrapped the policy known as \"don't ask, don't tell .\" the defense department approval to allow service members to wear uniforms at the san diego parade follows reports that members of the military wore uniforms at a gay pride event held at the pentagon in june. under the guidelines released by the defense department, service members can wear their uniforms to march in the parade as long as they participate \"in a personal capacity\" and follow set standards of \"appearance and wear of the military uniform .\" while members of the military do not need approval to participate in civic events, they generally need approval to wear their uniforms. more than 300 active-duty service members have signed up to participate in the parade, dwayne crenshaw, executive director of san diego lesbian, gay, bisexual and transgender pride, said thursday. last year, roughly 200 active-duty and retired military service members marched in the san diego parade, donning t-shirts to indicate their branch of military service. the 2011 parade took place one day after a federal appeals court temporarily reinstated the \"don't ask, don't tell\" policy. the policy was formally revoked months later. cnn's <mark>adam levine</mark> and <mark>scott thompson</mark> contributed to this report."}, {"articleID": "2009041809_00027627_W", "names": {"Mel Gibson": ["Q3854066", "Q42229"]}, "date": "2009-04-18", "url": "http://fox23.com/entertainment/story/Billy-Ray-Cyrus-slams-Foxx-over-Miley-comments/-vNg1XrMzkibgsm4S-e22w.cspx", "content": "slideshow billy ray cyrus and actress miley cyrus, 2007 (charley gallay, getty images) billy ray cyrus is fuming after jamie foss urged his superstar daughter miley to \"make a sex tape...do some heroin...and become a lesbian\" , dubbing the oscar winner's comments \"hurtful .\" foxx has apologised for the remarks made on his foxxhole radio show last weekend, insisting he made the joke as a comedian. he said, \"there was a situation with miley cyrus, and i just want to say, i apologize for what i said. i didn't mean it maliciously. you know i'm a comedian. you know my heart. miley, i apologize, so i'll call you. i got a daughter too, so i completely understand .\" but cyrus senior isn't taking the comments about 16-year-old miley lightly and is disgusted by the you can send a story to multiple email addresses by separating the email addresses with a semicolon (;) <mark>gibson</mark>'s lawyer calls for judge to be removed from divorce trial <mark>mel gibson</mark>'s lawyer has moved to strike the judge overseeing his divorce trial from the proceedings. farrah fawcett's troubled son redmond o'neal has been given one last chance to kick his drug habit in a rehab recovery program."}, {"articleID": "2012092202_00045688_W", "names": {"Yoko Ono": ["Q11464149", "Q117012", "Q16264827"], "John Lennon": ["Q11979004", "Q6244563"], "Dmitry Medvedev": ["Q23530", "Q47858657"], "Andrew Hay": ["Q21174027", "Q21456447", "Q39078862", "Q43912209"]}, "date": "2012-09-21", "url": "http://ITBusinessNet.com/articles/viewarticle.jsp?id=2205403", "content": "<mark>yoko ono</mark> joins calls for pussy riot's prison release us-pussyriot-yokoono: <mark>yoko ono</mark> joins calls for pussy riot's prison release by christine kearney new york (reuters) - peace activist <mark>yoko ono</mark> on friday joined the prominent call to free the three imprisoned pussy riot punk band members, saluting their stand for freedom of speech after being handed a two-year sentence for staging a \"punk prayer\" in moscow's main cathedral. \"i thank pussy riot in standing firmly in their belief for freedom of expression and making all women of the world proud to be women,\" <mark>ono</mark> told reporters in new york, flanked by the husband and four year old daughter of one band member. she awarded the three imprisoned members - nadezhda tolokonnikova, maria alyokhina and yekaterina samutsevich - a peace grant established in the name of her late husband, former beatle <mark>john lennon</mark>. tolokonnikova's husband, pyotr verzilov, accepted <mark>ono</mark>'s grant on behalf of the three women. he said he and his daughter visited tolokonnikova in prison for the first time in six months earlier this week, where she is kept with her two fellow band members segregated from other prisoners. their daughter had sent her mother scribblings of plans of escape. \"for her it has been very emotional,\" he said, talking of his daughter's drawing, \"she breaks down the prison walls and helps nadia's escape .\" <mark>ono</mark> joined madonna, burmese opposition politician aung san suu kyi and rights groups that have also stood up against the band's imprisonment. speaking just days ahead of an october 1 appeal by the band, when amnesty international and other groups hope thousands of people will rally in dozens of cities, <mark>ono</mark> said she \"wanted to express my love and respect for them, i want to work for the immediate release from the prison they are in .\" the jail sentences - for the crime of hooliganism motivated by religious hatred after the band stormed the altar of moscow's main cathedral calling on the virgin mary to rid russia of president vladimir putin - has drawn sharp international criticism. opposition groups say the case was part of a kremlin crackdown on dissent. putin has declined to comment on the ruling, but has suggested abuses committed against the russian orthodox church during the soviet era made pussy riot's protest particularly offensive. in response to the peace grant from <mark>ono</mark>, verzilov said his wife hoped the world was returning to the activism of her time in the 1960s and 1970s. \"nadia wants people to continue to actively keep fighting and supporting the cause and to learn it is important to stand up for values that are crucial to you, no matter the price, no matter the cost,\" he said. on thursday verzilov met with u.s. lawmakers and aides who have drafted legislation, known as the magnitsky bill, to impose u.s. sanctions against any russian officials involved in the prosecution of the band. he did not expect the october 1 appeal to cause significant change to the two year sentences. nor did he think russian prime minister <mark>dmitry medvedev</mark>'s comments last week that the band should be freed would carry much weight. hence he asked for international support. amnesty international have listed the three women on their prisoners of conscience list that aims to free those wrongly imprisoned for their political, religious and other beliefs. \"at it's core this case is about three young women who are in jail for the crime of singing a song,\" amnesty international usa executive director suzanne nossel told reporters. \"anybody can relate to this case and to these women and you cant help but feel your heart tugged .\" verzilov said that even now, from prison, the three women still do not regret the act--\"they are very strong women and nothing seems to break their spirit,\" he said. (additional reporting by sharon reich; editing by <mark>andrew hay</mark>) us, pussyriot, yokoono related sites:"}, {"articleID": "2013022023_00077338_W", "names": {"William O'Neil": ["Q15854679", "Q4340917"]}, "date": "2013-02-20", "url": "http://us.rd.yahoo.com/finance/external/investors/rss/SIG=13jpmh8mg/*http://news.investors.com/article/645116/022013/tesla-motors-stock-drops-on-Q4-earnings-but-profit-seen-ahead.htm?ven=yahoocp&ven=yahoo", "content": "fourth-quarter 2012 earnings report late wednesday, but the the luxury electric-car maker said it expects to turn a profit earlier than expected. tesla stock was down 7% in after-hours trading after it released its results, following a nearly 2% slip in the regular session. the company should be \"slightly profitable\" in the current quarter amid higher gross profit margins and lower r & d expenses, tesla ceo elon musk said in a letter to shareholders. this excludes noncash option and warrant expenses. analysts didn't expect the company to hit the black until q3. tesla ceo elon musk, here in a media session last year, has been out front in defending the firm's model s. kyodo view enlarged image \"tesla-powered cars have now been driven more than 40 million miles,\" musk said in the earnings announcement. he also said production is \"now reliably at an annualized rate of 20,000 units per year .\" in a conference call with analysts, he says the rate could top that later this year, and the wait time for car buyers is usually about five months. tesla said it lost 65 cents per share minus items, vs. a 69-cent loss in q4 2011. revenue soared to $306.3 million from $39.4 million. analysts polled by thomson reuters expected a 53-cent loss on revenue of $298.9 million. tesla says it produced more than 2,750 vehicles in q4 and more than 3,100 in 2012. it topped its projected run rate of more than 400 vehicles a week for three weeks in december and says it's maintained that pace into q1. that beat tesla's 2012 target of 2,500-3,000 vehicles, which jefferies & co. analyst elaine kwei said pre-earnings she expected. one of \"the most important things will be the pace of production .\" she said. tesla has targeted a better-than - 25% gross margin once production efficiencies are in place. pacific crest securities estimates 20% for q1, slightly shy of consensus. tesla guided below pacific crest's number but might have stayed close enough. \"for me, the most important reporting metric is going to be gross margin guidance for the first quarter,\" pacific crest analyst ben schuman told ibd ahead of the report. schuman says anything under 15% would \"raise serious questions. they're producing at their target run rate for 2013, so the big unknown is how much money can they make off these things .\" tesla motors (tsla) ceo elon musk set the stage for the electric car company's after-the-close wednesday earnings report with one more blog volley in the back-and-forth over a disastrous new york times test drive involving charging difficulty and a tow truck. he'd called that feb. 8 review \"a fake\" ...stocks shifted lower near wednesday's midpoint, with about eight in 10 ibd industry groups losing ground through morning trade. the nasdaq dug in 0.7%. the s & p 500 dropped 0.5% and the dow jones industrial average held to a 0.3% decline. turnover remained down from tuesday's levels and largely...tesla motors (tsla) stock was up 5% in afternoon trading tuesday, as investors caught up with news ahead of the company's earnings slated to be released after the market close wednesday. tesla is up 4% for february and 15% for 2013. here's what's happened since that troubled new york times model s...a redone test drive finished friday morning, a refutation. a lot has happened since a very pointed wednesday night blog post from tesla motors ceo elon musk showed that model s data-tracking performance might just rival the electric luxury car's typically lauded track performance. that was only...dish network (dish) turned in mixed q4 results wednesday, as company chairman charles ergen said the tv service provider's next strategic moves in wireless broadband might depend on regulators' review of the softbank/sprint deal. dish network added 14,000 net video customers, fewer than analyst...xoom (xoom), a company that does money transfers via the internet in the u.s., did some zooming last week in its initial public offering. the stock soared 40% beyond its initial offering price of $16 a share on friday, closing above 25 in its debut. the company raised $101.2 million. but shares...cybersecurity and trade secret theft are topics of the day at the white house, a day after security firm mandiant claimed china was behind a series of computer spying incidents. the obama administration was set for the wednesday afternoon launch of a \"strategy to mitigate the theft of u.s. trade...shares of netspend (ntsp) rose 29% wednesday, to nearly 15.80, after the company accepted an all-cash buyout offer valued at $1.4 billion, or $16 a share. the buyer is total systems services (tss), a provider of payment processing services to banks and merchants. netspend is a provider of...participate in an ibd forum and connect with other ibd subscribers. access six valuable screens that show you top stocks in different categories. get customized stock lists to track your portfolio, watch lists and more! i am a current subscriber and need to register on investors.com. i am not a current subscriber and want to register it is very important to use a set of sell rules. notice: information contained herein is not and should not be construed as an offer, solicitation, or recommendation to buy or sell securities. the information has been obtained from sources we believe to be reliable; however no guarantee is made or implied with respect to its accuracy, timeliness, or completeness. the information and content are subject to change without notice. you may use ibd's services and subscriber-only features solely for personal, non-commercial use. removal or alteration of any trademark, copyright or other notices will result in legal action taken to protect our rights. you may not distribute ibd's services or subscriber-only features to others, whether or not for payment or other consideration, and you may not modify, copy, frame, reproduce, sell, publish, transmit, display or otherwise use or revise any portion of ibd's services or subscriber-only features. for information regarding use of ibd's services for any purpose, please see our <mark>william o'neil</mark> + co. incorporated. all rights reserved. the <mark>william o'neil</mark> + co. database and all data contained herein are provided by <mark>william o'neil</mark> + co. incorporated and are used by ibd under license agreement. daily graphs and daily graphs online are trademarks of <mark>william o'neil</mark> + co. incorporated or its subsidiaries. marketsmith, incorporated. charts provided by marketsmith are used by ibd under license agreement. marketsmith is a registered trademark of marketsmith, incorporated."}, {"articleID": "2011111612_00096300_W", "names": {"Mike Tindall": ["Q1386944", "Q6849051"], "Martin Johnson": ["Q18674174", "Q2036406", "Q3295480", "Q47545583", "Q54005278", "Q56490309", "Q57414280", "Q5889052", "Q6775826"], "John Griffiths": ["Q27651748", "Q29642849", "Q56597709", "Q6236389", "Q6236392", "Q6236400", "Q6236407", "Q6236411"]}, "date": "2011-11-16", "url": "http://espnscrum.com/scrum/rugby/story/154371.html?CMP=OTC-RSS", "content": "the bulls have appointed springboks no. 8 pierre spies as their new captain for the 2012 super rugby season. spies replaces outgoing skipper victor matfield and will have wynand olivier as his vice-captain. spies has 47 caps for the south african national side and was a key part of their 2011 world cup squad. and the 26-year-old admits the captaincy was a position he has eyed since matfield opted to leave loftus versveld. \"it was not such a big surprise though, as i had it in the back of my mind that i could be asked to lead the team when victor retired,\" spies said. \"i was privileged in my career at the bulls and the springboks to play with great captains and i could certainly learn a lot from them .\" i would like to try and do that. i believe a captain should lead from the front and i hope that will be something that i can do successfully.there are huge challenges ahead, but we are all looking forward to that. this group is younger than in previous years, but we have the same goals as those squads and that is to win the competition. \"olivier, who took on the vice-captaincy during the currie cup, is relishing the new role .\" i like that responsibility. anyone who wants to write off the bulls because we lost players, do so at their own peril, \"he said .\" i think we have a squad that can with the competition again. there are new faces, so there will be a challenge to make sure all share the same vision, but i see no problems in that. saru has much to ponder \"coetzee may well head the list of candidates as he has a good coaching record and is very well-spoken .\" stephen nell picks over who is in line for the boks' top job \"the heineken cup did what it does best by serving up a feast of drama and excitement and the kind of intensity normally reserved for the world cup\" \"the furore surrounding the treatment of <mark>mike tindall</mark> is surely set to be eclipsed in the near future by a decision on <mark>martin johnson</mark>'s future\" eurostars europe's premier tournament returns on friday with a host of new faces in tow. this week's eurostars europe's premier tournament returns on friday with a host of new faces in tow. this week's scrum sevens looks at a group of heineken cup debutants set to make waves \"the furore surrounding the treatment of <mark>mike tindall</mark> is surely set to be eclipsed in the near future by a decision on <mark>martin johnson</mark>'s future\" \"the heineken cup did what it does best by serving up a feast of drama and excitement and the kind of intensity normally reserved for the rugby world cup\" world cup final debutants, try scorers, referees and test captains' winning records. historian <mark>john griffiths</mark> answers your latest queries in make real profits in real time - full training for free"}, {"articleID": "2018092818_00357541_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Thune": ["Q4571225", "Q462981"], "Susan Collins": ["Q22279", "Q7647692"], "Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"]}, "date": "2018-09-28", "url": "http://www.bostonherald.com/news/national/2018/09/the_latest_trump_says_ford_was_credible_witness", "content": "WASHINGTON--The Latest on the Supreme Court nomination of Brett Kavanaugh (all times local): 2:35 p.m. President <mark>Donald Trump</mark> says he found Christine Blasey Ford, who accused Supreme Court nominee Brett Kavanaugh of sexually assaulting her in high school, \"a very credible witness .\" <mark>Trump</mark> told reporters Friday at the White House that he thought Ford's testimony Thursday to the Senate Judiciary Committee \"was very compelling\" and that \"she looks like a very fine woman, very fine woman .\" But <mark>Trump</mark> also says he though Kavanaugh's adamant denial \"really something that I hadn't seen before. It was incredible .\" <mark>Trump</mark> called it \"an incredible moment I think in the history of our country .\" The Senate Judiciary Committee voted Friday to advance Kavanaugh's nomination to the Senate floor--but Arizona Sen. Jeff Flake said the full Senate vote should be delayed for a week. __ 2:25 p.m. Republican Sen. Lindsey Graham says it's going to fall to him to lay out to President <mark>Donald Trump</mark> why Brett Kavanaugh's Supreme Court confirmation vote has been delayed. He spoke after Arizona Sen. Jeff Flake said he would vote to advance Kavanaugh's nomination to the full Senate only if the final confirmation vote is delayed for an FBI investigation into sexual assault allegations. Christine Blasey Ford says Kavanaugh attacked her in a locked room at a high school house party. Kavanaugh denies that. The Senate Judiciary Committee voted Friday to advance the nomination to the full Senate, but Senate Judiciary Chairman Chuck Grassley noted the timing on Senate vote was up to Senate Majority Leader Mitch McConnell. Graham, of South Carolina, is a <mark>Trump</mark> ally who is on the panel. Graham told reporters after the committee vote that somebody is going to have to explain the delay to <mark>Trump</mark>. Graham added: \"I guess that'll be my job .\" __ 2:18 p.m. President <mark>Donald Trump</mark> says he'll leave it to the Senate to determine when it will vote on his Supreme Court nominee Brett Kavanaugh. But <mark>Trump</mark> is expressing optimism, saying: \"I'm sure it will all be very good .\" <mark>Trump</mark> told reporters Friday during a meeting with the President of Chile that undecided Republican senators \"have to do what they think is right\" and \"be comfortable with themselves\" on the Kavanaugh vote. But he said he hadn't thought at all about a replacement, \"Not even a little bit .\" The Senate Judiciary Committee voted Friday along party lines to advance Kavanaugh's nomination to the Senate floor. But Sen. Jeff Flake of Arizona said at the last minute that he could not promise to vote for Kavanaugh on the Senate floor and called for a delay of up to a week for a further investigation of sexual assault accusations. Kavanaugh has denied the allegations. __ 2:10 p.m. Sen Jeff Flake says Brett Kavanaugh's Supreme Court nomination should on hold so the FBI can investigate the sexual misconduct allegations against him. Flake, the deciding vote in the Senate Judiciary Committee, voted to advance Kavanaugh's nomination to a full floor vote, but said the vote should be delayed for up to a week to allow time for the investigation of Christine Blasey Ford's claims. Ford says Kavanaugh sexually assaulted her while the two were in high school. Kavanaugh has denied Ford's accusation. __ 2 p.m.. The Senate Judiciary Committee has voted along party lines to advance Brett Kavanaugh's Supreme Court nomination to the Senate floor. The 11-10 vote Friday came just one day after Republicans heard testimony from Christine Blasey Ford, who accused Kavanaugh of sexually assaulting her when they were teens. Kavanaugh denied the accusation. At the last minute, Sen. Jeff Flake of Arizona, said he could not promise to vote for Kavanaugh on the Senate floor and called for a delay of up to a week for a further investigation. Republicans voted to move ahead with Kavanaugh's nomination. Senate Judiciary Chairman Chuck Grassley noted the timing on Senate vote was up to Senate Majority Leader Mitch McConnell. __ 1:40 p.m.. The Senate Judiciary Committee was supposed to be voting at 1:30 p.m. Friday on whether to recommend Brett Kavanaugh's confirmation, but something is afoot. Behind-the-scenes negotiations have delayed the committee vote on Kavanaugh's nomination. It wasn't clear what was being discussed. Republicans believed they had to votes to advance Kavanaugh out of the committee when Sen. Jeff Flake announced his support earlier Friday. But senators seated in the hearing room are talking among themselves--and Flake is not seated. Some senators have stepped out of the room. __ 1:10 p.m. Senate Republicans do not yet have the votes to confirm Brett Kavanaugh to the Supreme Court. That's according to Sen. <mark>John Thune</mark> of South Dakota, the third-ranking member of Republican leadership. <mark>Thune</mark> said that Republicans still have \"a little work to do\" to get enough support. Whether Kavanaugh is confirmed to the Supreme Court could hinge on the votes of two Republican senators: <mark>Susan Collins</mark> of Maine and Lisa Murkowski of Alaska. It does not appear that President <mark>Donald Trump</mark> or the White House is reaching out to them to try and influence their decision. <mark>Thune</mark> said while such calls may be well-intended, \"it's better to let people decide on their own up here .\" Republicans have set a committee vote for Friday afternoon to send Kavanaugh's nomination to the full Senate. __ 1:10 p.m. Democratic Sen. Heidi Heitkamp of North Dakota says \"there are a lot of lawyers in America who can sit on the court\" and Brett Kavanaugh isn't the only person who can do the job. Heitkamp said Friday she hasn't decided whether to support Kavanaugh's confirmation to the Supreme Court. But her remarks to the AP suggest she may vote no. Heitkamp is facing a tough re-election this year in a Republican-leaning state. Her decision on Kavanaugh is being closely watched. She said she found testimony from both Kavanaugh and Christine Blasey Ford, who accused him of sexual assault, \"compelling\" but \"this is not a criminal case .\" Heitkamp says appointees \"don't all have to come from Harvard and Yale and they don't all have to come from prep schools __ 12:40 p.m. Montana Sen. Jon Tester says he will join other Democrats in voting against Supreme Court nominee Brett Kavanaugh. Tester is up for re-election this year in his deeply Republican home state. But he said he has concerns about Kavanaugh's positions on privacy issues, campaign finance and about a California professor's claim that he sexually assaulted her when both were teenagers. Kavanaugh denied Christine Blasey Ford's allegations in a hearing Thursday. Tester said he has requested a meeting with Kavanaugh\" numerous times \"but the White House wouldn't commit. The Montana senator said his office had received\" thousands of calls and emails from Montanans \"about Kavanaugh, a majority of which were opposed to his confirmation. ___ 12:30 p.m.. The dean of Yale Law School is calling for additional investigation into sexual misconduct allegations against Brett Kavanaugh before the Senate votes on his nomination to the U.S. Supreme Court. Dean Heather Gerken said in statement Friday that she agrees with the American Bar Association that more investigation is needed. Gerken said proceeding with the confirmation process without more review is not in the best interest of the Supreme Court or the legal profession. Kavanaugh received his undergraduate and law degrees from Yale. The Senate Judiciary Committee is scheduled to vote on Kavanaugh's nomination Friday afternoon. A vote in favor will send the nomination to the full Senate. Kavanaugh denies allegations by Christine Blasey Ford that he assaulted her when they were in high school. Kavanaugh says he's never sexually assaulted anyone. ___ 11:50 a.m. Democratic Sen. Joe Donnelly says he'll vote against the confirmation of Supreme Court nominee Brett Kavanaugh. Donnelly is a moderate Democrat who voted for President <mark>Donald Trump</mark>'s first nominee to the high court, Neil Gorsuch (GOR' - suhch). Donnelly is up for re-election this year in Indiana, which is a strongly Republican state. His decision comes after a hearing Thursday when a California professor testified that Kavanaugh sexually assaulted her in high school when they were teenagers. Kavanaugh also testified and denied Christine Blasey Ford's allegations. Donnelly says Ford's allegations are\" disturbing and credible \"and should be investigated by the FBI, which <mark>Trump</mark> and Senate Republicans say isn't needed. ___ 11:45 a.m. Anita Hill says one of the things that stood out to her from Supreme Court nominee Brett Kavanaugh's testimony was how emotional and angry it was compared with the\" calm \"words coming from the woman accusing him of sexual assault when they were teenagers. Kavanaugh denies the accusation. Hill gave Senate testimony in 1991 about her allegations of sexual harassment by then-Supreme Court nominee Clarence Thomas. Hill--speaking Friday in Houston--says Kavanaugh\" was able to express a real anger, an aggression, as well as a lot of emotion. \"She said no woman nomination to the high court\" would ever have the license to express (herself) in that way. \"Hill says she was impressed with the calm and careful testimony of Kavanaugh's accuser, Christine Blasey Ford. ___ 11:40 a.m. Sen. John Cornyn of Texas says it is\" cruel \"and\" indecent \"for Democrats to seek public testimony from Mark Judge, a high school friend of Supreme Court nominee Brett Kavanaugh. Judge has told the committee in a signed statement that he doesn't recall the events described by Christine Blasey (BLAH' - zee) Ford. She accuses Kavanaugh of sexually assaulting her when they were teens. Kavanaugh denies the accusation. Ford has told senators that Judge was in the room during the alleged assault. Democrats have asked for the committee to subpoena Judge, but Republicans have voted down the request. Cornyn says Judge admits to being a recovering alcoholic and is a cancer survivor. Cornyn says Democrats are ignoring that and seeking to\" drag Mr. Judge into this circus-like atmosphere \"and subject his battles with addition to public ridicule. In Cornyn's words:\" That is cruel. That is reckless. That is indecent. \"___ 11:10 a.m. CNN cameras caught an extraordinary scene of Arizona Sen. Jeff Flake being confronted by two protesters as he waited in an elevator to take him to the Senate Judiciary Committee meeting. Moments earlier, Flake had announced he'd vote to confirm Supreme Court nominee Brett Kavanaugh. Flake stood looking downcast as one of the women said to Flake:\" Tell me, I'm standing right here in front of you, do you think he's telling the truth to the country? \"The senator listened for nearly two minutes until the elevator door closed. He told the women he had put out a statement and would have more to say before the committee. CNN's Jim Scutto said:\" I don't think we've witnessed a moment like that in recent memory. \"___ 10:50 a.m.\" Feels like Alice in Wonderland. \"That's what a top Democrat says about the Senate Judiciary Committee in moving forward with Brett Kavanaugh's nomination to the Supreme Court. Vermont's Patrick Leahy is denouncing the way that majority Republicans have handled Kavanaugh's nomination. Leahy says the committee has lost its independence and become, in his words,\" an arm, and a very weak arm, of the <mark>Trump</mark> White House. \"The committee has set a vote for later Friday on whether to recommend the nomination to the full Senate. Leahy says Kavanaugh has been\" credibly accused of sexual assault \"and the committee has failed to conduct a meaningful investigation. Christine Blasey Ford testified Thursday that Kavanaugh sexually assaulted her when they were teens. Kavanaugh says the accusation is\" categorically \"false. ___ 10:30 a.m. Sen. Dianne Feinstein (FYN' - styn) says the Supreme Court nomination of Brett Kavanaugh is\" a real test \"for the Senate and the nation\" to see how we treat women, especially women who are survivors of sexual assault. \"The top Democrat on the Senate Judiciary Committee says that 27 years after the Clarence Thomas hearings, Republicans appear to have a new strategy for handling sexual assault allegations. She says,\" The Republican strategy is no longer \"attack the victim .' It is to ignore the victim .\" Feinstein says she's disappointed the committee is set to vote on Kavanaugh's nomination less than a day after emotional testimony by Kavanaugh and Christine Blasey Ford, who accuses Kavanaugh of sexually assaulting her when both were teenagers. He denies the allegation. ___ 10:25 a.m.. The wife of Justice Clarence Thomas is praising Sen. Lindsey Graham for his criticism of Senate Democrats for their treatment of Supreme Court nominee Brett Kavanaugh. Ginni Thomas says on her Facebook page \"Thank you, Senator Graham, for speaking for so many of us!\" Thomas included a link to video from Graham's fiery comments Thursday when he called the Democrats' actions the \"most despicable thing\" he has seen in politics. The link says Graham \"exposes Democrat Kavanaugh sham .\" Ginni Thomas is a conservative activist who once worked for congressional Republicans. She made headlines in 2010 when she called Anita Hill and asked Hill to apologize for making sexual harassment allegations about Clarence Thomas after he had been nominated to the Supreme Court. ___ 10:15 a.m. Several Democrats on the Senate Judiciary Committee have walked out of a hearing on Brett Kavanaugh's nomination to the Supreme Court. Kamala Harris of California, Mazie Hirono of Hawaii, Richard Blumenthal of Connecticut, Sheldon Whitehouse of Rhode Island left after the GOP chairman set a vote on the nomination for 1:30 p.m. Friday. That was approved by a committee vote. Democrats say Republicans are rushing the confirmation. During that vote, Hirono yelled: \"\"I strongly object! What a railroad job! No, no, NO .\" ___ 10:05 a.m. Republicans have blocked Democratic efforts to subpoena a high school friend of Supreme Court nominee Brett Kavanaugh who's been described as a witness to an alleged assault involving Kavanaugh about three decades ago. The Senate Judiciary Committee's vote to subpoena Mark Judge has been defeated in a party-line vote, with all 11 Republicans on the panel voting against the motion and all 10 Democrats voting for it. Democrats say Judge has never been interviewed by the FBI or questioned by a member of the committee, and that committee has a responsibility to subpoena Judge before it votes on whether to recommend Kavanaugh to the full Senate. Kavanaugh denies the allegation. The committee chairman, Iowa Republican Chuck Grassley, has read a statement from Judge that says he doesn't recall the events described by Kavanaugh's accuser and \"never saw Brett act\" in the way that he's accused of. ___ 10 a.m.. The Senate Judiciary Committee is set to vote at 1:30 p.m. on whether to recommend Supreme Court nominee Brett Kavanaugh's nomination to the full Senate. The chairman, Iowa Republican Chuck Grassley, announced the vote as the committee began its meeting. Kavanaugh has just picked up a key vote of support from a committee Republican, Arizona's Jeff Flake. Republicans have slim 11-10 majority on the committee. With Flake's support, Kavanaugh's nomination is expected to clear the committee and go to the full Senate. The Senate could begin taking procedural votes over the weekend ahead of a final confirmation vote early next week. ___ 9:55 a.m. Emotions in the Capitol are running high over the Supreme Court nomination of Brett Kavanaugh. Soon after Republican Sen. Jeff Flake announced he'd vote to confirm Supreme Court nominee Brett Kavanaugh, he was cornered by two women as he got into an elevator to head to the Senate Judiciary Committee. Through tears, the women implored him to change his mind about his Kavanaugh vote. The women were seen in TV footage blocking the Arizona senator from closing the elevator door. One woman begged Flake to look him in the eye. She said: \"Look at me and tell me that it doesn't matter what happened to me .\" Another woman said Flake was allowing someone who \"violated someone\" to serve on the Supreme Court. Both women cried as they spoke to him. Eventually a member of Flake's staff said they needed to go and the doors closed. A committee confirmation vote is set for 1:30 p.m. Kavanaugh has denied that he sexually assaulted a woman when they were teenagers. The committee on Thursday heard emotional and sometimes combative testimony from both Kavanaugh and his accuser. ___ 9:40 a.m.. It'll be a \"yes\" vote on Brett Kavanaugh from one of the most closely watched Republican senators who's determining the fate of the Supreme Court nominee. The announcement from Arizona's Jeff Flake that he'll vote to confirm Kavanaugh virtually ensures that the nomination will advance to the full Senate from the Judiciary Committee. The committee is expected to vote Friday--and if the nomination advances to the full Senate, then senators could begin voting as early as Saturday. Flake says he wishes he could express the confidence in Kavanaugh that some of his other GOP colleagues have. But Flakes says in a statement he still has \"much doubt\" after the committee's explosive hearing Thursday. Kavanaugh has denied Christine Blasey Ford's allegation that he sexually assaulted her when they were teenagers. Flake says that without evidence to corroborate Ford's story, he believes \"our system of justice affords a presumption of innocence .\" ___ 9:10 a.m.. A Democratic senator who's facing a tough re-election race has come out against President <mark>Donald Trump</mark>'s Supreme Court nominee, Brett Kavanaugh. <mark>Bill Nelson</mark> of Florida tweets that he'll vote \"no\" if the nomination comes to the full Senate. The Senate Judiciary Committee is set to vote on Kavanaugh on Friday. <mark>Nelson</mark>'s decision comes a day after Kavanaugh told the committee that he didn't sexually assault a woman when they were teenagers. The accuser, Christine Blasey Ford, says she's \"100 percent\" certain that he did. <mark>Nelson</mark> hadn't taken a public position on the nomination before his announcement Friday. <mark>Nelson</mark> had never met with Kavanaugh even though his office said they tried several times to schedule a meeting. The senator is in a tight re-election race with Florida's Republican governor, Rick Scott, who has previously come out in support of Kavanaugh. Scott's campaign hasn't responded to questions about Ford's testimony. ___ 8:45 a.m. Former President George W. Bush has been advocating for Supreme Court nominee Brett Kavanaugh with wavering senators in recent days. That's according to a person familiar with the outreach who wasn't authorized to discuss the development publicly and spoke on condition of anonymity. Kavanaugh is a former top aide in Bush's administration. Bush has reached out to Republicans Jeff Flake of Arizona and <mark>Susan Collins</mark> of Maine. Bush spoke earlier this month to Democrat Joe Manchin of West Virginia in a call the senator's office says Manchin initiated .--Associated Press writer Catherine Lucey. __ 8:05 a.m.. The White House is pushing back against a call from the American Bar Association to slow the vote on Supreme Court nominee Brett Kavanaugh until the FBI can do a full background check. Spokeswoman Sarah Huckabee Sanders told reporters Friday that Kavanaugh has already \"been through six separate background investigations by the FBI .\" Kavanaugh testified Thursday to the Senate Judiciary Committee over an allegation of sexual assault when he was in high school. His accuser, Christine Blasey Ford, also appeared before the committee during the emotionally charged day. Sanders stressed <mark>Trump</mark>'s support for Kavanaugh and said he wanted to see a vote. She said <mark>Trump</mark> thought Kavanaugh's testimony was \"powerful, it was riveting and it was honest .\" ___ 1:30 a.m.. The American Bar Association has urged the Senate Judiciary Committee and the full Senate to slow down on the vote on Brett Kavanaugh for a position on the Supreme Court until the FBI has time to do a full background check on claims of sexual assault made by Christine Blasey (blah-zee) Ford and other women. \"We make this request because of the ABA's respect for the rule of law and due process under law,\" the ABA letter to committee leadership said. \"Each appointment to our nation's highest court (as with all others) is simply too important to rush to a vote .\" The Judiciary committee plans a vote on Kavanaugh Friday. ___ 12:35 a.m. Senate Republicans are plowing forward with a committee vote Friday on Brett Kavanaugh's nomination. Voting at the Senate Judiciary Committee comes after an extraordinary and highly emotional hearing over Christine Blasey Ford's allegations that Kavanaugh sexually assaulted her when they were teens. The marathon session appears to have only deepened the partisan divide. The Judiciary committee is narrowly split with the slimmest Republican majority. And Democrats are expected to oppose President <mark>Donald Trump</mark>'s nominee. But even if the panel deadlocks over recommending Kavanaugh, the nomination can push forward. The full Senate may start taking procedural votes as soon as Saturday toward confirmation next week. Senate Majority Leader Mitch McConnell says the committee's going to vote Friday and \"move forward .\" Related Articles Tesla without Musk at the wheel? That's what the SEC wants GOP advances Kavanaugh after Flake calls for FBI probe The Latest: Bush advocating for Kavanaugh with senators More On: Supreme Court of the United States U.S. Republican Party United States Senate United States Congress United States government U.S. Democratic Party American Bar Association Mitch McConnell Joe Manchin Brett Kavanaugh Lindsey Graham Anita Hill Patrick Leahy Clarence Thomas Kamala Harris Chuck Grassley Sheldon Whitehouse Dianne Feinstein Mazie Hirono Richard Blumenthal <mark>Donald Trump</mark> Christine Blasey Ford Jeff Flake <mark>Susan Collins</mark> Rick Scott <mark>Bill Nelson</mark> George W. Bush"}, {"articleID": "2019072722_00100223_W", "names": {"Shannon Miller": ["Q257672", "Q7488916"], "Jack Phillips": ["Q21622368", "Q6114605"], "Stéphane Roy": ["Q11463771", "Q3502067", "Q659670", "Q7630056"], "Hassan Diab": ["Q5679624", "Q5679626"], "Steve Irwin": ["Q18161164", "Q7612911"], "Tim Johnson": ["Q21279635", "Q329070", "Q3991363", "Q57844502", "Q7803722", "Q7803724", "Q7803725", "Q7803726", "Q7803727", "Q7803728", "Q861115", "Q925052"]}, "date": "2019-07-27", "url": "https://www.theepochtimes.com/four-of-nine-aboard-float-plane-crash-on-remote-b-c-island-dead_3019435.html", "content": "A float plane had crashed on Addenbroke Island, about 100 kilometres off the northern end of Vancouver Island, Canada. (Google Earth) Canada Four of Nine Aboard Float Plane Crash on Remote B.C. Island Dead By The Canadian Press July 27, 2019 Updated: July 27, 2019 Share LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON VICTORIA, Canada--Four people have been confirmed dead with five others injured in a float plane crash on an uninhabited island off the northern end of Vancouver Island. Lt. Chelsea Dubeau with the Joint Rescue Co-ordination Centre in Victoria said they received word Friday that a Cessna 208 float plane had crashed on Addenbroke Island, about 100 kilometres off the northern end of Vancouver Island. The centre said the chartered plane that had nine people aboard crashed at about 11 a.m.. It was headed to Calvert Island, a significantly larger neighbouring island, it said. \"Unfortunately we can confirm at this time that there are four individuals that are deceased,\" Dubeau said. #BCEHS paramedics have assessed and treated the five survivors of the Addenbroke Island plane crash. Two patients in serious condition are being airlifted with critical care paramedic teams to Vancouver. Three other patients were transported to a local area hospital .--Emerg Health Services (@ BC_EHS) July 27, 2019 B.C. Emergency Health Services said two of the survivors were airlifted to hospital in Vancouver in serious condition, while three others were taken to a local hospital for treatment of unspecified injuries. Spokeswoman <mark>Shannon Miller</mark> said paramedic ground crews and two air ambulance critical care teams had been staged in Port Hardy for survivors of the crash. Critical care teams are made up of paramedics with the highest level of specialized training, with a focus on acute medical emergencies and air medical responses, she added. Seair Seaplanes, which offers daily charter flights and scenic tour flights in British Columbia, said in a statement that the \"serious accident\" involved one of its Caravan float planes. \"Our thoughts are with those involved in the crash and their loved ones and are devastated by this fatal accident. We are currently working with first responders and authorities and have immediately suspended all flights,\" the statement said. The company said it would provide updates as details become available and its focus was on working with authorities to provide whatever support is needed. Dubeau said the BC Ferries vessel Northern Sea Wolf was on scene quickly because it was nearby and a Canadian Coast Guard helicopter, Cormorant helicopter, and Buffalo fixed-wing plane were all dispatched to lend assistance. Dubeau said no one lives on Addenbroke Island, although there is a lighthouse on the island. The island is on the route the ferry takes from Port Hardy to Prince Rupert. Chris Krepski, a spokesman for the Transportation Safety Board, said the board was gathering information before deciding what its next steps would be. Share this article Show Discussion RECOMMENDED TOP VIDEOS [TSAS Special] \"How We Can Strengthen From Within\" : Mercedes Schlapp on Trump's Approach & Her Time at White House 2d By Jan Jekielek [WCS Special] Larry Elder on His New Show With The Epoch Times; Tackling Racism & Reparations 2d By Jan Jekielek [WCS Special] Why America's Reliance on Imported Uranium Poses a Risk--Rep. Paul Gosar 2d By Jan Jekielek Canada August 23, 2018 Air \"Terrible' in Metro Vancouver, Air Quality Advisory Now Longest on Record By Mimi Nguyen Ly An Air Quality Advisory first issued on Aug. 13 continues as of Aug. 23 for the Metro Vancouver and Fraser Valley regions, making it the longest air...US News June 9, 2019 Plane Crash in New York Kills Everyone on Board, Dog Survives By <mark>Jack Phillips</mark> A pilot and passenger were killed in a small plane crash along Long Island's North Fork, but the dog survived, according to news reports. Officials in the...Crime and Incidents June 24, 2019 9 Men, 2 Women Killed in Hawaii Plane Crash, Feds to Probe Plane Repairs By Isabel van Brugen The skydiving plane that crashed shortly after takeoff from the North Shore of Oahu, Hawaii, on June 21, will have its repair and inspection records reviewed by...Canada July 19, 2019 RCMP Divers Heading to Labrador Lake to Investigate Plane Crash By Margaret Wollensak, The Epoch Times RCMP are heading to a remote lake in northern Labrador to investigate a plane crash that occurred there on Monday, July 15. There were seven people on...Canada July 27, 2019 Police Issue Warning as\" Distraction Thefts' Rise Across Canada By Lily Liu Police forces from Ottawa and Vancouver are warning the public to be careful after a spike in the \"distraction theft\" tactic has been recorded in Canada. In...Canada July 26, 2019 Two Sunwing Employees Among 11 Arrested in Drug Trafficking Probe: RCMP By The Canadian Press TORONTO--Two Sunwing Airlines employees have been accused of smuggling drugs from various Caribbean countries into Canada in a drug-trafficking ring that RCMP allege operated out of Toronto's...Canada July 26, 2019 Missing Quebec Businessman and His Son Found Dead Near Crashed Helicopter By Lily Liu The Quebec police believe the two bodies that have just been found north of Mont Tremblant belong to entrepreneur <mark>Stéphane Roy</mark> and his 14-year-old son Justin, who had...Canada July 26, 2019 Review Says Government Broke No Rules in <mark>Hassan Diab</mark> Extradition Case By The Canadian Press OTTAWA--An external review of the extradition of Ottawa academic <mark>Hassan Diab</mark> has concluded that federal lawyers on the case did their jobs ethically and within the law ....Canada July 26, 2019 Supreme Court of Canada Says Military's No Juries Justice System Constitutional By The Canadian Press OTTAWA--Military members accused of serious offences under military law do not have a constitutional right to a jury trial, the Supreme Court ruled Friday. The Charter of...Canada July 25, 2019 Fake Honey Imports Into Canada Prompt CFIA Investigation By Lily Liu Fake honey--also known as adulterated honey, often mixed with cheap sweeteners such as sugar, corn syrup, rice and beet--has managed to find its way onto the shelves...Canada July 25, 2019 EDC Says Probe Clears Staff After Corruption Claim Related to Snc-Lavalin By The Canadian Press OTTAWA--Export Development Canada says an independent review has cleared its personnel of any wrongdoing after a claim that its staff turned a blind eye to bribery and corruption in a 2011...Canada July 25, 2019 Petition Calling for Fines for Amber Alert Complainers Gathers 78,000 Signatures By Lily Liu A online petition launched by a Toronto woman calling for fines for people who call 911 to complain about Amber Alerts has gathered a total of more...Trump Presidency July 27, 2019 Trump Announces He Is Considering Declaring Antifa a \"Major Organization of Terror' By Janita Kan President Donald Trump announced on July 27 that his administration may declare the far-left extremist group Antifa\" a major organization of terror. \"\"Consideration is being given to declaring ANTIFA, the...International July 27, 2019 Russian Police Arrest More Than 1,000 in Moscow Protest: Monitor By The Associated Press MOSCOW--Russian police arrested more than 600 people on July 27, including prominent activists, around a political protest in Moscow to demand that members of the opposition be...Politics July 27, 2019 Cummings Responds to Trump's Criticism of\" Rat and Rodent Infested' Baltimore By Janita Kan Rep. Elijah Cummings (D-Md .) has responded to criticism from President Donald Trump over the Maryland congressman's treatment of border patrol officials during committee hearings and the conditions of...HK Current Affairs July 27, 2019 Police Fire Tear Gas in Clash With Hong Kong Protesters Over Banned March By Reuters Police fired tear gas during clashes in a rural Hong Kong town on Saturday as several thousand activists gathered to protest. Politics July 27, 2019 Trump Calls for Probes Into Obama Book Deal, Clinton \"Nonsense' By Zachary Stieber President Donald Trump said that the records regarding former President Barack Obama's book deal should be subpoenaed, along with other records, in addition to records having to...Politics July 27, 2019 Trump Lambasts Cummings Over\" Filthy' District in Murder-Riddled Baltimore By Zachary Stieber President Donald Trump called one of the top-ranking Congressional Democrats a \"brutal bully\" early July 27 before lamenting the conditions in the representative's home district. Trump said...Politics July 27, 2019 Rand Paul Offers Money to \"Ungrateful' Omar for Trip to Somalia:\" She Can Look and Learn' By Zachary Stieber Sen. Rand Paul (R-Ky .) offered to give Rep. Ilhan Omar (D-Minn .) money for a trip to Somalia, her country of birth, saying she should go there to...NY News July 27, 2019 SBA Head: New York's Anti-Police Sentiment Causes \"Pantaleo Effect' By Miguel Moreno, The Epoch Times NEW YORK--President Donald Trump pressed the mayor of New York on July 25 to\" stand up \"for police officers who have been doused and sprayed with water ....Asia & Pacific July 27, 2019 2 Dead, 8 Swimming Athletes Hurt in South Korea Balcony Collapse By The Associated Press SEOUL, South Korea--An internal balcony at a nightclub in South Korea collapsed on Saturday, July 27, killing two people and injuring 16 including American and other athletes...Asia & Pacific July 27, 2019 8 Killed in Quake, Aftershocks in Philippines, 60 Injured: Agency By Reuters MANILA--An earthquake and aftershocks struck islands off the north of the Philippines on July 27, killing eight people and injuring 60, disaster officials said. An initial quake...Trump Presidency July 26, 2019 Supreme Court Allows Trump Administration to Use Pentagon Funds for Border Wall By <mark>Jack Phillips</mark> The Supreme Court ruled on July 26 that President Donald Trump can use $2.5 billion in Department of Defense funding to build a portion of the wall...US News July 26, 2019 Judge Dismisses Nick Sandman's Lawsuit Against The Washington Post By Petr Svab A federal judge in Kentucky dismissed a lawsuit against The Washington Post brought by Nick Sandmann, one of the students of Covington Catholic High School who were...Viewpoints July 27, 2019 Are Your Frequent UTIs From the Food You're Eating? By Martha Rosenberg It is no secret that many bacteria causing human infections are developing resistance to the antibiotics that used to kill them. The U.S. Centers for Disease Control...US News July 26, 2019 Man Dies After Weight Loss Surgery in Mexico, 7 Others Infected After Operations by the Same Doctor By Venus Upadhayaya, Epoch Times A Utah man died after undergoing a weight loss surgery in Tijuana, Mexico, according to a press release by the Utah Department of Health on July 22. The...Performing Arts July 27, 2019 Beethoven Celebrates Healing and Divinity By J.H. White It's amazing how good music can lift your mood. On May 10, the string quartet Brooklyn Rider performed live at public radio station WGBH's Fraser Performance Studio...HK Current Affairs July 26, 2019\" Hong Kong Withstand': Comic Artist Uses Brush to Support Hong Kong Protesters By Eva Fu The image has become an emblem of the Hong Kong protests. A young woman wielding a yellow umbrella shields a girl from a torrent of tear gas...Entertainment News July 27, 2019 Joy Villa Slams Bette Midler as \"Crusty Racist' Over Twitter Post About Black Trump Supporters By Janita Kan Actress Bette Midler is facing backlash for a social media post in which she suggested that black attendees of one of President Donald Trump's recent 2020 rallies...Entertainment News July 27, 2019 Bindi Irwin's Brother Robert to Walk Her Down the Aisle at Upcoming Wedding By Zachary Stieber Australian animal expert Bindi Irwin, daughter of the famed\" Crocodile Hunter \"star <mark>Steve Irwin</mark>, will be walked down the aisle at her upcoming wedding by her brother...Food & Dining July 25, 2019 The Top 9 Grilling Mistakes and How to Fix Them By The Associated Press I love to grill, and barbecue, and I have devoted my career to outdoor cooking for more than two decades. In that time, I've seen a lot...Recipes July 25, 2019 Bored of Instant Noodles? You've Never Had Them Like This Before By Sponsored Content Instant noodles make a quick and convenient meal option, ready in little more time than it takes to boil water. But you don't have to be limited...Destinations July 27, 2019 Traveling Back in Time in Switzerland By <mark>Tim Johnson</mark> Together with nearby St. Moritz, the Grand Kronenhof Pontresina is one of Switzerland's most stylish destinations. Destinations July 25, 2019 6 Under-the-Radar Destinations in Europe By Skye Sherman Lesser-known destinations in Europe offer fewer crowds and more authentic, concentrated experiences. Life July 26, 2019 Woman Needs a New Kidney. But Learning Who the Donor Is, She Refuses to Accept It By Li Yen, Epoch Times If you sow seeds of kindness, you will reap kindness. Ingeborg McIntosh, of Phoenix, Arizona, is an incredible woman who has selflessly looked after more than 120...Life July 25, 2019 Boy With Rare Disorder Almost Looks Like a\" Newborn,' but He's Already 3 Years Old By Louise Bevan Many objects fit comfortably in the palms of our hands. Apples, coins, playing cards...but not babies. At least not a newborn human baby boy of...TOP NEWS Trump Announces He Is Considering Declaring Antifa a \"Major Organization of Terror' NEW By Janita Kan Russian Police Arrest More Than 1,000 in Moscow Protest: Monitor 1hr By The Associated Press Cummings Responds to Trump's Criticism of\" Rat and Rodent Infested' Baltimore 3hr By Janita Kan Police Fire Tear Gas in Clash With Hong Kong Protesters Over Banned March 8hr By Reuters Trump Calls for Probes Into Obama Book Deal, Clinton \"Nonsense' 9hr By Zachary Stieber Trump Lambasts Cummings Over\" Filthy' District in Murder-Riddled Baltimore 9hr By Zachary Stieber Rand Paul Offers Money to \"Ungrateful' Omar for Trip to Somalia:\" She Can Look and Learn' 9hr By Zachary Stieber"}, {"articleID": "2012081714_00060599_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2012-08-16", "url": "http://latimes.com/business/la-fi-mo-brown-administration-backs-comp-overhaul-20120816,0,7591678.story?track=rss", "content": "<mark>jerry brown</mark> is supporting an ambitious effort to overhaul the state's system for giving medical care and compensation to injured workers. late thursday, <mark>brown</mark>'s department of industrial relations, the agency that administers the workers' compensation insurance system, released a statement saying it's backing a proposal negotiated by labor unions and large employers. the governor's office endorsed the comments. \"representatives of labor and employers have been working vigorously to reform california's workers' compensation system before projected rate increases push california to a crisis situation,\" said agency director christine baker. \"the result of this work is a comprehensive reform proposal that protects workers and employers by improving benefits and ending wasteful litigation .\" the plan, which has yet to be introduced in the waning days of the legislative session, has run into strong opposition from the lawyers who represent victims of on-the-job accidents and illnesses. the california applicants' attorneys assn. complains that the overhaul would cut many workers' permanent disability benefits instead of boosting them. supporters counter that the changes would increase benefits to permanently disabled workers by $720 million a year and pay for them by streamlining the $16.2-billion system by reducing litigation, fraud and inefficiencies. the proposal was crafted by the california labor federation, the safeway inc., ups, grimmway farms and other large, self-insured employers during months of negotiations. comments are filtered for language and registration is required. the times makes no guarantee of comments' factual accuracy. readers may report inappropriate comments by clicking the report abuse link next to a comment. here are the full fan: cabrera suspension could \"ruin' s.f. season baseball fans in san francisco are expressing surprise and disappointment after"}]