[{"date": "2015-04-05", "url": "http://www.ottawasun.com/2015/04/04/live-coverage-leafs-vs-bruins", "content": "BOSTON - Was it really only two springs ago when the Maple Leafs brought so much hope into this building, convincing many that the franchise was headed in the right direction? As gutting as the overtime loss here at the TD Garden was to those in the lineup, the potential false expectations that came out of that seven-game series now seem like ancient hockey history. The inexperienced, under-achieving lineup the Leafs iced for Saturday night's 2-1 shootout loss to the Bruins had just eight players that were here for the May 13, 2013 collapse and who knows how many will be here the next time the team visits. It was an all too familiar Leafs team that interim coach Peter Horachek sent out on Saturday, one lacking in depth making the issue of motivation that much more challenging. And they certainly weren't equipped to fight through the defensively tough Bruins early on. Give them credit though - despite the lopsided play in favour of an opponent hungry to retain a playoff berth - the Leafs were able to take the Bruins to overtime and then to the shootout. Patrice Bergeron, who scored the Bruins only goal in regulation, got the shootout winner as well with a slow moving deke before flipping the puck over <mark>James Reimer</mark>'s pad. Leafs shooters Tyler Bozak, James van Riemsdyk and Nazem Kadri couldn't solve Tuukka Rask and that was that. For the Bruins, a fifth consecutive win helped strengthen their hold on an Eastern Conference playoff spot. The good news for the draft watchers is that with Carolina's 3-2 win over Philadelphia Saturday afternoon, the Hurricanes are now four points up on the Leafs with a game in hand. It's all but certain, then, that general manager Dave Nonis will select no worse than fourth overall at the NHL entry draft in June. The entire first period felt like was played in the Toronto zone with the Bruins peppering 19 shots at a sharp but shell-shocked <mark>Reimer</mark>. All but three Boston skaters had a shot on goal in the first and this from a team that isn't exactly an offensive juggernaut. But a Bruins squad somewhat desperate for two points, but lacking a killer instinct when it comes to scoring, allowed the Leafs to hang around, tied 1-1 after 40 minutes. They fired a season-high 50 shots at <mark>Reimer</mark>, who had one of his better games of the season. The longer the game went, it seemed, the more the Leafs remained in it, even if they had no reason to be and it was off to overtime. While it's clear that the Leafs aren't the same team they were two years ago, there are concerns with the B's, as well, some of those on display in this one. They have been hot lately, but have had their share of uneven stretches during the season creating a little unease in New England. Saturday's contest was fan appreciation night at the TD Garden, their final home contest of the season. With a playoff spot yet to be clinched, there was also an outside shot that it could be the last game here period until next October. The Bruins have been strong defensively, but offence is an issue, as we saw on Saturday. Still, the team is trying to summon up some consistency for what it hopes could be a deep playoff run in what seems to be a wide open Eastern Conference. After dominating the Leafs in the first period but with nothing to show for it, Bergeron got the Bruins on the board 19 seconds into the second. After fanning on a shot, he popped in to pick up his own rebound and beat <mark>Reimer</mark>. The Leafs tied it at 1-1 with 5:21 left in the second on the type of goal that had eluded them for much of the season. A puck that bounced off James van Riemsdyk's shoulder was eventually went into the net after Bruins defenceman Adam McQuaid. It was van Riemsdyk's 26th of the season giving a two-goal lead over Phil Kessel for the team high in that department. The Leafs were short-handed early in the first when centre <mark>Trevor Smith</mark> was rocked hard into the end boards by behemoth Bruins defenceman, Zdeno Chara. Bloodied and wobbly, <mark>Smith</mark> hobbled back to the dressing room and did not return after suffering what the team described as an upper body injury. Prior to the game the Leafs talked about employing the spoiler card as motivation, though for a while on Saturday anyway, that seemed like wishful thinking. They'll get a similar chance at home Sunday to the Sens, the team in hot pursuit of the Bruins for the last playoff ticket in the East. \"That should be enough, being a spoiler,\" Horachek said prior to the game. \"We want to give these two teams the respect they deserve by putting a really good game on. We want to give ourselves the respect by going out and playing all the way through .\" Both the Bruins and Leafs are down to their final four games in this NHL season but the teams couldn't be on more opposite paths. The depleted, defeated Leafs are playing out the string while the Bruins are trying to lock down a playoff spot and prepare for what they hope will be a deep playoff run.", "articleID": "2015040503_00018343_W", "names": {"James Reimer": ["Q1278471", "Q22109151"], "Trevor Smith": ["Q2452132", "Q7839430", "Q7839431", "Q7839432", "Q7839433"]}}, {"date": "2015-04-08", "url": "http://riveraveblues.com/2015/04/thoughts-following-opening-day-2-117033/", "content": "Opening Day and the traditional post-Opening Day off-day are in the rear-view mirror. The grind begins for real tonight, when the Yankees resume their series with the Blue Jays and play five games in the next five days. That's both the best and worst thing about baseball. They play every damn day. Here are some thoughts prior to tonight's game. <mark>Alex Rodriguez</mark> on Monday. Some boos, sure, but mostly cheers - he got the loudest ovation during the baseline introductions by a not small margin (video) - all throughout the game. Both before and after his at-bats. It helped that he was the team's most productive non - Brett Gardner hitter, so let's see what happens when he goes 0-for-4 with three strikeouts for the first time before saying the fans are on his side. <mark>Alex</mark> is going to get booed unmercifully on the road this year. It's unavoidable. A little fan support at home would be nice to see this summer. Let's face it, this Yankees team isn't particularly fun to watch aside from a handful of individual players, so a productive A-Rod will make the season more enjoyable. To me, anyway. 2. On that note: how long until A-Rod is hitting third, fourth, or fifth? I have close to zero confidence in Mark Teixeira rebounding, and only slightly more confidence than that in <mark>Brian McCann</mark> rebounding. <mark>Alex</mark> had the best at-bats on the team Monday, which, while just a one game sample, was a continuation of what we saw in Spring Training. Even if <mark>Alex</mark> is a 10-15 home run guy across a full season at this point of his career, he still looks like he might be able to hit .280 with enough walks to get his on-base percentage up to .340 or .350. I'm not sure I can say the same for Beltran, Teixeira, or <mark>McCann</mark>. I think A-Rod is hitting in the middle third of the order by May 1st. If <mark>Rodriguez</mark> shows he can still handle low-90s fastballs and work a walk, it'll make him one of the better offensive threats on the roster. 3. Remember a few years ago - gosh, it's been about eight or nine years now - when A-Rod dropped two foul pop-ups in one game? I'm pretty sure it was in Anaheim. <mark>Alex</mark> was slapped with the \"he struggles with pop-ups\" tag after that and it's stuck even though he's never really had any other problems since. Just the random dropped pop-up once or twice a year like every other player. I get the feeling that's what's going to happen with Didi Gregorius after his foolish attempted steal of third base on Monday. It was a terrible play, those extra 90-feet aren't worth the risk down five runs, and Didi admitted as much after the game. \"It was a bad mistake by me, I'll admit it. I'll admit that it was my mistake and it won't happen again,\" he said to Chad Jennings. And yet, I think that's going to stick with him. He's trying to do too much because he's replacing Derek Jeter, he's not a smart base-runners, he's too aggressive, yadda yadda yadda. We'll hear it all in the coming days and weeks. And, you know what, that might be true! If he does it again and again, then it'll be a problem. Sometimes things are just an isolated incidence and a baseball play though. A young player making a mistake. Not everything is a referendum on a player's style or mentality. Gregorius made a really bad play and it's okay to leave it at that. Ty Hensley is just awful. That poor kid can't catch a break. He had no arm problems up until this recent Tommy John surgery - the shoulder \"abnormality\" the team found in his physical didn't affect him on the mound - it was just a lot of unfortunate injuries. Hensley's going to go into 2016 having thrown roughly 42.1 innings from 2012-15. That's development time he simply can't get back. He's been dealt a crappy hand by the pitching gods and yet I have no reason to believe Hensley will do anything other than work his tail off to get healthy and get to MLB. If you follow him on Twitter, you know Ty has been relentlessly upbeat through all of this and he's incredibly easy to root for. As a fan I so very much want to see him on the mound at Yankee Stadium one day. I'm rooting like hell for the kid. Hughes was a disappointment relative to expectations but he still managed to turn into a serviceable big leaguer - he had a 95 ERA + in 780.2 innings with the Yankees, including one electric season in relief (2009) and two solid seasons as a starter (2010 and 2012). Joba was the poor man's version of Hughes, basically. Kennedy and Cole have had all their success with other teams. (Kennedy signed with the Yankees and was traded for Some people are worried over <mark>Tanaka</mark>'s stuff, I'm not. In that 5 run inning only Encarnacion's HR was actually hit hard. The 2 walks were a little troubling but he did strike out 6 over 4.1 innings. 1. Arod paid his time.... he should be treated like everyone else at this point. 2. . <mark>Alex</mark> does look like maybe their best overall hitter at the moment..... and while that would be great if he can be productive..... it's really a terrible thing if a 40 year old is even close to your best hitter. I had confidence in Beltran rebounding before I saw him play this spring.... but he looks old man..... Jeter got old really fast after his injury.... sometimes old guys just can't get it back after being hurt late in their career. I hope this isn't the case..... the Yankees really need it not to be the case. 1. A-Rod is an anti-hero. He will be embraced, especially if he hits. 2. He could be a good 3 hitter but he's not a power threat at 4 or 5. Beltran is done, such a horrific signing. Teixera and <mark>McCann</mark> will pop one every now and then but otherwise will just continue to hit the ball right into the shift. Teixera said, they want me to hit the other way! No, they want you to hit it right into their shift, that's why they're shifting dummy. 3. Didi will be just fine. He should be able to equal or surpass Jeter's meager offensive output last season. 4. Poor kid. We said a prayer for him last night. One day in, <mark>Alex Rodriguez</mark>'s return to the Yankees is a success so far Postgame Notebook: <mark>Tanaka</mark> hit hard in Yankees' fourth straight Opening Day loss New York Yankees fall to Toronto Blue Jays in season opener as <mark>Masahiro Tanaka</mark> struggles New York Yankees set 25-man roster, designate Austin Romine for assignment New York Yankees end spring on high note with 4-3 victory over Washington Nationals New York Yankees ace <mark>Masahiro Tanaka</mark> says velocity will be down this season", "articleID": "2015040814_00018868_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Brian Mccann": ["Q1059152", "Q4964655"], "Masahiro Tanaka": ["Q11575599", "Q11575656", "Q911463"]}}, {"date": "2015-04-09", "url": "http://irishexaminer.com/breakingnews/ireland/school-admissions-bill-does-nothing-to-offer-alternatives-to-church-schools-670939.html", "content": "School Admissions Bill \"does nothing to offer alternatives to church schools' Minister for Education Jan O'Sullivan is being urged to address the issue of school patronage. Admission to Schools Bill states that there will be no religious discrimination, but schools can ask for a baptismal certificate on enrolment. Still large areas of country with no alternatives to church schools, yet admissions bill does nothing to address this April 8, 2015 Educate Together - which runs non-denominational schools - has welcomed proposals to limit the number of places each institution can reserve for the children of past pupils. However the organisation says they will do little to address the growing demand from parents for places at non-denominational schools. CEO of Educate Together <mark>Paul Rowe</mark> said that new schools are needed .\" The only way that we can address this growing need for a system which provides a balanced choice for children in the country is to dramatically accelerate the delivery of new Educate Together schools or schools which offer the same guarantee of equality of esteem and access as Educate Together throughout the whole country, \"he said. School Admissions Bill\" does nothing to offer alternatives to church schools' Irish Examiner live news app for smartphones lets you quickly access breaking news, sport, business, entertainment and weather. Car ban looms for St Patrick's Street as Cork's traffic set for overhaul English prankster climbs into Irishman's car, gets more than he bargained for VIDEO: Niall Horan had a bit of a fall while caddying for Rory McIlroy Refusal to pay will lead to legal action and direct deductions as first water bills arrive Teachers' Conference: Croke Park deal is the \"greatest waste of time ever '", "articleID": "2015040910_00031064_W", "names": {"Paul Rowe": ["Q21931991", "Q7153343"]}}, {"date": "2015-04-09", "url": "http://prod.www.falcons.clubs.nfl.com/news/article-1/Quinn-Falcons-Arrive-in-Ridiculously-Good-Shape/2086d68c-a8a2-4d72-90eb-cd19124e341b", "content": "a The 2015 offseason workouts began Monday for the Falcons, and head coach <mark>Dan Quinn</mark> said his players arrived in \"ridiculously-good shape,\" embracing a mindset of having their best offseason ever You only have one chance to make a great first impression, and the Falcons players made the most of theirs to start their offseason workouts. On Thursday, the media was invited in to watch the Falcons players work out, followed by an evaluation from a very impressed head coach. \"I think there were a number of guys that completely came back in ridiculously good shape,\" <mark>Dan Quinn</mark> said. \"I think that mindset of the guys who started their individual work way earlier than this offseason program showed they're ready to take this offseason on, really having that\" best-offseason-they've - ever-had' mindset coming in; being in that good of shape told me a lot. \"was one of the players who clearly showed he's been working diligently in the offseason. The 24-year-old defensive star said he's loved the energy and excitement <mark>Quinn</mark> has brought to the building. Admitting\" silent success \"during his first two seasons, Trufant said he's ready to take his game\" two or three levels \"higher, if not more.", "articleID": "2015041023_00013884_W", "names": {"Dan Quinn": ["Q3013178", "Q5214234", "Q5214235"]}}, {"date": "2015-04-11", "url": "http://northjersey.com/sports/baseball/yanks-notes-a-rod-moved-up-to-third-in-order-1.1307045", "content": "Third watch Designated hitter <mark>Alex Rodriguez</mark> found himself batting third in Friday night's lineup, a sign of the club's offensive struggles, his good at-bats and manager Joe Girardi's decision to give regular No. 3 hitter <mark>Carlos Beltran</mark> a rest after a 1-for-10 start. A-Rod rewarded Girardi's move by going 2-for-5 with an RBI before leaving for a pinch-runner. \"His swings have been good,\" Girardi said of A-Rod, who hit his first homer of 2015 in Thursday night's 6-3 loss to Toronto. \"He's used to hitting in the middle of the order. He understands how to hit in that position and that's why I chose to do it .\" A-Rod has batted in three different spots in four games, opening as the No. 7 hitter and moved to No. 2 on Thursday night when Brett Gardner was rested. <mark>Rodriguez</mark> could get a rest as early as today against righty <mark>Joe Kelly</mark>. Girardi has yet to start <mark>Rodriguez</mark> in the field, but said he foresees giving first baseman Mark Teixeira and third baseman Chase Headley a break soon, with A-Rod possibly filling in. On Friday, A-Rod played in his first Red Sox-Yankees game since Sept. 15, 2013, due to his full-year MLB suspension due to steroids. Boston manager <mark>John Farrell</mark> was already impressed with what he saw from A-Rod briefly in spring training. \"You never count out a proven veteran,\" <mark>Farrell</mark> said. \"You marvel at the number of games [he] missed and to come back and seemingly have good timing, particularly [against] fastballs .\" ' height =' 105' alt =' A New Jersey businessman has founded a networking organization that can help seal business deals over a friendly game of golf .' height =' 105' alt = \"Tattoos can be removed effectively with the new PicoSure Laser technique .' height =' 119' alt =\" If you are injured in an accident, a personal injury attorney can help determine if you can receive compensation. Escapee from frozen food aisle? Parking lot turkey captivates shoppers Elmwood Park man who killed wife was committed in 2012 after strange behavior, police say Smoke alarm prompts North Arlington family to flee basement fire Elmwood Park man who killed wife was committed in 2012 after strange behavior, police say Escapee from frozen food aisle? Parking lot turkey captivates shoppers Juror in 2014 sex assault case says he's haunted by new charges against defendant Gunfire from the street grazes the head of a 17-year-old Paterson girl inside her home", "articleID": "2015041107_00051329_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Carlos Beltran": ["Q1042743", "Q5041829"], "Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"]}}]