[{"date": "2015-04-11", "url": "http://northjersey.com/sports/baseball/yanks-notes-a-rod-moved-up-to-third-in-order-1.1307045", "content": "Third watch Designated hitter <mark>Alex Rodriguez</mark> found himself batting third in Friday night's lineup, a sign of the club's offensive struggles, his good at-bats and manager Joe Girardi's decision to give regular No. 3 hitter <mark>Carlos Beltran</mark> a rest after a 1-for-10 start. A-Rod rewarded Girardi's move by going 2-for-5 with an RBI before leaving for a pinch-runner. \"His swings have been good,\" Girardi said of A-Rod, who hit his first homer of 2015 in Thursday night's 6-3 loss to Toronto. \"He's used to hitting in the middle of the order. He understands how to hit in that position and that's why I chose to do it .\" A-Rod has batted in three different spots in four games, opening as the No. 7 hitter and moved to No. 2 on Thursday night when Brett Gardner was rested. <mark>Rodriguez</mark> could get a rest as early as today against righty <mark>Joe Kelly</mark>. Girardi has yet to start <mark>Rodriguez</mark> in the field, but said he foresees giving first baseman Mark Teixeira and third baseman Chase Headley a break soon, with A-Rod possibly filling in. On Friday, A-Rod played in his first Red Sox-Yankees game since Sept. 15, 2013, due to his full-year MLB suspension due to steroids. Boston manager <mark>John Farrell</mark> was already impressed with what he saw from A-Rod briefly in spring training. \"You never count out a proven veteran,\" <mark>Farrell</mark> said. \"You marvel at the number of games [he] missed and to come back and seemingly have good timing, particularly [against] fastballs .\" ' height =' 105' alt =' A New Jersey businessman has founded a networking organization that can help seal business deals over a friendly game of golf .' height =' 105' alt = \"Tattoos can be removed effectively with the new PicoSure Laser technique .' height =' 119' alt =\" If you are injured in an accident, a personal injury attorney can help determine if you can receive compensation. Escapee from frozen food aisle? Parking lot turkey captivates shoppers Elmwood Park man who killed wife was committed in 2012 after strange behavior, police say Smoke alarm prompts North Arlington family to flee basement fire Elmwood Park man who killed wife was committed in 2012 after strange behavior, police say Escapee from frozen food aisle? Parking lot turkey captivates shoppers Juror in 2014 sex assault case says he's haunted by new charges against defendant Gunfire from the street grazes the head of a 17-year-old Paterson girl inside her home", "articleID": "2015041107_00051329_W", "names": {"John Farrell": ["Q1017017", "Q17916883", "Q46168067", "Q56723519", "Q6232765", "Q6232766"]}}, {"date": "2015-04-11", "url": "http://www.romfordrecorder.co.uk/teenager_given_community_order_for_failing_to_stop_after_harold_hill_collision_1_4031042", "content": "Michael Crumlish was given a community order at Barkingside Magistrates' Court for failing to stop at an accident and failing to report it Email this article to a friend To send a link to this page you must be logged in. Michael Crumlish, 18, of Lodge Lane, Collier Row, was sentenced at Barkingside Magistrates' Court yesterday after pleading guilty to the offence. He also admitted failing to report the accident and driving on a road/in a public place without due care and attention. Crumlish was driving a red Fiat in Gooshays Drive, Harold Hill, on October 10 last year when he smashed into a parked Renault Clio. Prosecutor Nijole O'Brien said: \"The defendant's vehicle overturned, landing on its roof on the wrong side of the road .\" Some witnesses saw him get out of the car, he appeared to have a head injury. \"Forensic analysis found saliva on the airbag, which was found to be the defendant's .\" A probation report heard at the court, in High Street, noted Crumlish was \"frightened\" following the incident. He \"simply panicked\" and left the scene. The report said: \"He is 18 years old, still very young and quite immature, and hadn't been driving very long .\" It could have been his inexperience that caused the accident. \"Prior to being given his punishment, Crumlish spoke to the court and said he regretted his actions .\" I'm just sorry for what I did, \"he said,\" It was wrong. I should have stayed in my car. \"Bench chairman <mark>David Cox</mark> said:\" For the failing to stop and failing to report you are going to receive a community order, because we believe it is serious enough to warrant it. \"Crumlish, who had three points on his driving licence already, was given no separate punishment for the careless driving offence, but his community order will run for 12 months - until April 9 next year. He was ordered to pay £ 85 in costs and an additional £ 60 as he received the order. He must pay this within 28 days. Teenager given community order for failing to stop after Harold Hill collision Police appeal after witnesses report man left injured woman after Rainham Road collision Romford man found dead in car at Tesco had been there a month, inquest hears", "articleID": "2015041110_00004555_W", "names": {"David Cox": ["Q21466826", "Q23415279", "Q464935", "Q47120686", "Q50164997", "Q5232622", "Q5232623", "Q5232626", "Q5232627"]}}, {"date": "2015-04-12", "url": "http://www.castanet.net/news/Business/137334/Harper-to-engage-on-Cuba", "content": "Canadian Prime Minister <mark>Stephen Harper</mark> (and U.S. President Barack Obama chat at the Summit of the Americas. <mark>Stephen Harper</mark> emerged from a meeting with Cuba's Raul Castro with a call for more engagement with the island nation, signalling a change of heart for the prime minister when it comes to the communist regime. The leaders' conversation Saturday at the Summit of the Americas in Panama followed a brief greeting and handshake at a photo-op. \"I have become convinced that a different approach is appropriate at this point in time,\" <mark>Harper</mark> told reporters in Panama City shortly after meeting Castro. \"We're at a point where an engagement is more likely to lead us to where want to go than continued isolation .\" It's a different approach than the one <mark>Harper</mark> has taken with Cuba in the past. <mark>Harper</mark>, who has had strong words about the communist regime, initially opposed inviting Cuba to this year's summit because it was not a democracy. He has also been a vocal critic of communism. He revealed that his views changed, at least in part, after the United States began contemplating a different approach to its relationship with Cuba. <mark>Harper</mark>, however, was careful Saturday to point out that more work is necessary on the Caribbean island. \"We are not by any means unconcerned about the lack of democratic space and human-rights abuses in Cuba,\" he told reporters. \"We've always been clear on that and we will continue to be clear on that .\" During the their conversation, <mark>Harper</mark> said he and Castro discussed the long-running relationship between their countries - on political, tourism and commercial levels. The prime minister, who also noted how Canada helped facilitate the December deal between the U.S. and Cuba to work toward normalizing their diplomatic relations, gave little additional information about his own chat with Castro or how long it lasted. \"We had a good and long discussion with the president,\" said <mark>Harper</mark>, who had never met Castro. The Castro-Harper discussion was overshadowed by the Cuban leader's meeting earlier in the day with U.S. President Barack Obama. It was the first formal, face-to-face talks between American and Cuban leaders in more than half a century. Obama and Castro sat side by side in a conference room in a bid to inject fresh momentum into their effort to restore diplomatic ties. Castro told Obama he was ready discuss sensitive issues including human rights and freedom of the press, saying, \"everything can be on the table .\" But he also cautioned that the two countries have \"agreed to disagree .\" For years, the Cuba issue overtook discussions at the Summit of the Americas, which it had never been invited to since the gatherings first started in 1994. They are held every three years. In 2012, Canada and the U.S. were the only two member countries to oppose Cuba's invitation to this year's summit. They faced criticism from other hemispheric leaders for leaving the Cubans out. On Saturday, <mark>Harper</mark> reminded his counterparts in a speech how Canada's played a role facilitating negotiations between the U.S. and Cuba by providing venues for their high-level talks. \"We also are pleased that all the countries of the hemisphere are represented here,\" <mark>Harper</mark> said in his five-minute address to the summit. The remarks mark a shift for <mark>Harper</mark>, a man who has railed against communism. Last year, <mark>Harper</mark> called communism a \"poisonous ideology\" with \"ruthless practices that slowly bled into countries around the world, on almost every continent .\" He made the comments in a speech at a Toronto fundraiser for a controversial victims of communism memorial that will be erected in Ottawa. On Saturday, <mark>Harper</mark>'s address was mostly dedicated to outlining his government's goals for the hemisphere, including the promotion of human rights, security and prosperity. The prime minister told fellow political leaders that democracy is growing in the Americas as never before. <mark>Harper</mark> insisted, however, that more effort was needed to build on the progress. He also used the summit to build bridges â € \"or mend fences â €\" with regional leaders in one-on-one talks. On Saturday, <mark>Harper</mark> met with Obama, who has a strained relationship with Ottawa following his opposition to the Keystone XL pipeline. Canada has also had a chillier friendship with Mexico ever since it tightened visa requirements for Mexican visitors. Comments on this story are pre-moderated and approval times may vary. Before they appear, comments are reviewed by moderators to ensure they meet our Personal Tax Return Filings Many people assume that they don't have to file a personal tax return because they don't have a balance owing. This isn't the best rule of thumb to follow...Photo: Thinkstock.com It's a generally accepted notion that acquiring a new customer is more expensive than retaining an existing customer. Add to that fact a sluggish economy where businesses a.. .", "articleID": "2015041209_00048920_W", "names": {"Stephen Harper": ["Q206", "Q7609425"]}}, {"date": "2015-04-12", "url": "http://www.nme.com/news/various-artists/84450", "content": "April 12, 2015 22:03 Record label and studio owner in fight over Chris Cornell-featuring supergroup's tapes A & M Records and the co-founder of Seattle's London Bridge studios, Rajan Parashar, are fighting over the master recordings of grunge supergroup Parashar's brother Rick, who he co-founded the studio with and was the producer of the recordings, failed to honour a deal made in 1993 in which he agreed to give the tapes and the subsequent rights to A & M for £ 24,000 ($35,000). Rick Parashar died in August of last year and left the tapes in his brother's possession. Rolling Stone reports that the record label believed the members of the supergroup, which included Soundgarden's Chris Cornell, had possession of the tapes but learnt that that was not the case. Rajan Parashar's attorney Warren Rheaume told the Seattle Times: \"He's had them all along. They're his .\" 2016 marks the 25th anniversary of the release of the \"Temple Of The Dog' album, with the record now considered a grunge classic having gone platinum despite originally being overlooked in 1991. Nelly will be cleared of drugs charges\" when facts come out', says lawyer Chance The Rapper shares short film for Social Experiment single \"Sunday Candy' - watch Este Haim joins Hozier on stage at Coachella to cover The Time's\" Jungle Love' <mark>Quincy Jones</mark> says <mark>Michael Jackson</mark> had \"no idea what we were doing' making...Idlewild unveil\" Every Little Means Trust' video starring Jay Baruchel - watch Zack de la Rocha and Travis Barker join Run The Jewels onstage at Coachella", "articleID": "2015041221_00039260_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Quincy Jones": ["Q193645", "Q25190073"]}}, {"date": "2015-04-13", "url": "http://www.sfgate.com/news/crime/article/Police-seek-arrest-of-mother-of-disabled-man-left-6195571.php", "content": "Contact SFGate visit | Home-Contact SFGate | navigation-www | 1 Contact SFGate visit | Home-Contact SFGate | navigation-www | 1 visit | Home-Contact SFGate-Customer Support | navigation-www | 2 Submissions & Tips visit | Home-Contact SFGate-Submissions & Tips | navigation-www | 3 About SFGate visit | Home-About SFGate | navigation-www | 2 About SFGate visit | Home-About SFGate | navigation-www | 2 Register on SFGate visit | Home-About SFGate-Register on SFGate | navigation-www | 3 SFGate Newsletters visit | Home-About SFGate-SFGate Newsletters | navigation-www | 4 visit | Home-About SFGate-SFGate Staff | navigation-www | 5 Careers visit | Home-About SFGate-Careers | navigation-www | 6 Hearst visit | Home-About SFGate-Hearst | navigation-www | 7 About SF Chronicle visit | Home-About SF Chronicle | navigation-www | 3 About SF Chronicle visit | Home-About SF Chronicle | navigation-www | 3 SF Chronicle Staff visit | Home-About SF Chronicle-SF Chronicle Staff | navigation-www | 2 Become a Subscriber visit | Home-About SF Chronicle-Become a Subscriber | navigation-www | 3 Manage Your Subscription visit | Home-About SF Chronicle-Manage Your Subscription | navigation-www | 4 SF Chronicle Delivery visit | Home-About SF Chronicle-SF Chronicle Delivery | navigation-www | 5 E-Edition visit | Home-About SF Chronicle-E-Edition | navigation-www | 6 Back Copies visit | Home-About SF Chronicle-Back Copies | navigation-www | 7 Chron in Education visit | Home-About SF Chronicle-Chron in Education | navigation-www | 8 Corrections visit | Home-About SF Chronicle-Corrections | navigation-www | 9 Advertise with us visit | Home-Advertise with us | navigation-www | 4 Advertise with us visit | Home-Advertise with us | navigation-www | 4 Media Kit visit | Home-Advertise with us-Media Kit | navigation-www | 2 Place a Classified Ad visit | Home-Advertise with us-Place a Classified Ad | navigation-www | 3 About Our Ads visit | Home-Advertise with us-About Our Ads | navigation-www | 4 Public Notices visit | Home-Advertise with us-Public Notices | navigation-www | 5 Local Business Directory visit | Home-Advertise with us-Local Business Directory | navigation-www | 6 Careers visit | Home-Careers | navigation-www | 5 Store visit | Home-Store | navigation-www | 6 Privacy policy visit | Home-Privacy policy | navigation-www | 7 Privacy policy visit | Home-Privacy policy | navigation-www | 7 Ad Choices visit | Home-Privacy policy-Ad Choices | navigation-www | 2 Your CA Privacy Rights visit | Home-Your CA Privacy Rights | navigation-www | 8 Terms of Use visit | Home-Terms of Use | navigation-www | 9 Site Index visit | Home-Site Index | navigation-www | 10 Newsletters visit | Home-Newsletters | navigation-www | 11 Get news alerts visit | Home-Get news alerts | navigation-www | 12 Get VIP access with SF Chronicle Membership Get SFGate newsletters for the latest from the Bay Bay Area & State visit | News-Bay Area & State | navigation-www | 1 Traffic visit | News-Traffic | navigation-www | 2 Nation visit | News-Nation | navigation-www | 3 World visit | News-World | navigation-www | 4 Politics visit | News-Politics | navigation-www | 5 Crime visit | News-Crime | navigation-www | 6 Tech visit | News-Tech | navigation-www | 7 Obituaries visit | News-Obituaries | navigation-www | 8 Opinion visit | News-Opinion | navigation-www | 9 You visit | News-You | navigation-www | 10 Health visit | News-Health | navigation-www | 11 Education visit | News-Education | navigation-www | 12 Video visit | News-Video | navigation-www | 13 News Blogs visit | News-News Blogs | navigation-www | 14 Lifelong Learning visit | News-Lifelong Learning | navigation-www | 15 Black man killed by white Oklahoma deputy in Taser error Hillary Clinton? Yes, she's running for president Man held in slaying of his daughter's mother 49ers visit | Sports-49ers | navigation-www | 1 Raiders visit | Sports-Raiders | navigation-www | 2 Giants visit | Sports-Giants | navigation-www | 3 Giants Fandom visit | Sports-Giants Fandom | navigation-www | 4 A's visit | Sports-A's | navigation-www | 5 Warriors visit | Sports-Warriors | navigation-www | 6 Sharks visit | Sports-Sharks | navigation-www | 7 Sports Blogs visit | Sports-Sports Blogs | navigation-www | 8 Sports Calendar visit | Sports-Sports Calendar | navigation-www | 9 MLB visit | Sports-MLB | navigation-www | 10 NBA visit | Sports-NBA | navigation-www | 11 College visit | Sports-College | navigation-www | 12 Preps visit | Sports-Preps | navigation-www | 13 Golf visit | Sports-Golf | navigation-www | 14 Outdoors visit | Sports-Outdoors | navigation-www | 15 Justin Suh, Sara Banke win S.F. City Golf titles visit | article-6195478 | Sports-nav-hcat | 1 Mickelson hopes to build on 2nd-place finish at Masters visit | article-6195499 | Sports-nav-hcat | 2 A's loss to Mariners caps week of extreme highs and lows visit | article-6195198 | Sports-nav-hcat | 3 Jordan Spieth wins Masters at record-tying 18-under Technology visit | Business-Technology | navigation-www | 1 Finance visit | Business-Finance | navigation-www | 2 Innovation visit | Business-Innovation | navigation-www | 3 Mortgage Rates visit | Business-Mortgage Rates | navigation-www | 4 Home Guides visit | Business-Home Guides | navigation-www | 5 Public Notices visit | Business-Public Notices | navigation-www | 6 Sponsored Content visit | Business-Sponsored Content | navigation-www | 7 Office Space visit | Business-Office Space | navigation-www | 8 The Tech Chronicles visit | Business-The Tech Chronicles | navigation-www | 9 Net Worth visit | Business-Net Worth | navigation-www | 10 Fossils & Photons visit | Business-Fossils & Photons | navigation-www | 11 Mind Your Business visit | Business-Mind Your Business | navigation-www | 12 S.F. tech scene unplugs, gets down at Daybreaker visit | article-6189977 | Business-nav-hcat | 1 LinkedIn buying online learning company Lynda.com visit | article-6190062 | Business-nav-hcat | 2 Apple Watch developers create apps for gadget they've never visit | article-6190387 | Business-nav-hcat | 3 Apple fans get to touch - but not take home - the Watch The Daily Dish visit | A & E - The Daily Dish | navigation-www | 1 Movies visit | A & E - Movies | navigation-www | 2 Music & Nightlife visit | A & E - Music & Nightlife | navigation-www | 3 Performance visit | A & E - Performance | navigation-www | 4 Art visit | A & E - Art | navigation-www | 5 Blogs visit | A & E - Blogs | navigation-www | 6 Videos visit | A & E - Videos | navigation-www | 7 Events visit | A & E - Events | navigation-www | 8 Books visit | A & E - Books | navigation-www | 9 TV visit | A & E - TV | navigation-www | 10 Horoscope visit | A & E - Horoscope | navigation-www | 11 Comics visit | A & E - Comics | navigation-www | 12 Games visit | A & E - Games | navigation-www | 13 Things To Do visit | A & E - Things To Do | navigation-www | 14 Adams family shows graceful progression in pair of concerts \"Talley's Folly' a solid and graceful Aurora presentation The Medea Project's\" Birthright? \"a powerful voice for women Music by living composers is faring well Restaurants visit | Food-Restaurants | navigation-www | 1 Recipes visit | Food-Recipes | navigation-www | 2 Wine visit | Food-Wine | navigation-www | 3 Top 100 Restaurants visit | Food-Top 100 Restaurants | navigation-www | 4 Top 100 Wines visit | Food-Top 100 Wines | navigation-www | 5 Bargain Bites visit | Food-Bargain Bites | navigation-www | 6 Reservations visit | Food-Reservations | navigation-www | 7 Inside Scoop SF visit | Food-Inside Scoop SF | navigation-www | 8 Healthy Eating visit | Food-Healthy Eating | navigation-www | 9 Lake County wine: Tasting without the traffic Red volcanic soil is real gem for Lake County vintners San Francisco now has a JuiceBot juice vending machine thing Home & Garden visit | Living-Home & Garden | navigation-www | 1 Style visit | Living-Style | navigation-www | 2 Parties visit | Living-Parties | navigation-www | 3 Lust visit | Living-Lust | navigation-www | 4 Weekend Warrior visit | Living-Weekend Warrior | navigation-www | 5 Ski visit | Living-Ski | navigation-www | 6 LGBT visit | Living-LGBT | navigation-www | 7 Houzz visit | Living-Houzz | navigation-www | 8 Outdoors visit | Living-Outdoors | navigation-www | 9 Blogs visit | Living-Blogs | navigation-www | 10 Sponsored visit | Living-Sponsored | navigation-www | 11 Schools, Camps & Activities visit | Living-Schools, Camps & Activities | navigation-www | 12 Mom creates powerful photo series of her daughters visit | blogPost-1660622 | Living-nav-hcat | 1 Lane Bryant's sexy new #ImNoAngel campaign Weekend Getaways visit | Travel-Weekend Getaways | navigation-www | 1 Neighborhoods visit | Travel-Neighborhoods | navigation-www | 2 Wine Country visit | Travel-Wine Country | navigation-www | 3 Monterey-Carmel visit | Travel-Monterey-Carmel | navigation-www | 4 Tahoe visit | Travel-Tahoe | navigation-www | 5 Hawaii visit | Travel-Hawaii | navigation-www | 6 Mexico visit | Travel-Mexico | navigation-www | 7 Vegas visit | Travel-Vegas | navigation-www | 8 Blogs visit | Travel-Blogs | navigation-www | 9 Virgin America announces SFO-Hawaii nonstops visit | blogPost-1657943 | Travel-nav-hcat | 1 An incredible volcano-inspired hotel in Patagonia visit | article-6184396 | Travel-nav-hcat | 2 Business travelers opt for Airbnb listings instead of hotels visit | article-6182342 | Travel-nav-hcat | 3 New Orleans' Tremé neighborhood helped shape U.S. culture visit | article-6176405 | Travel-nav-hcat | 4 Real Estate visit | Real Estate | navigation-www | 9 New Homes visit | Real Estate-New Homes | navigation-www | 1 Open Homes visit | Real Estate-Open Homes | navigation-www | 2 Luxury visit | Real Estate-Luxury | navigation-www | 3 Rentals visit | Real Estate-Rentals | navigation-www | 4 Mortgage Rates visit | Real Estate-Mortgage Rates | navigation-www | 5 Commercial visit | Real Estate-Commercial | navigation-www | 6 Place an ad visit | Real Estate-Place an ad | navigation-www | 7 Home Guides visit | Real Estate-Home Guides | navigation-www | 8 Homesales visit | Real Estate-Homesales | navigation-www | 9 On the Block Blog visit | Real Estate-On the Block Blog | navigation-www | 10 Couple Revives Classic Piedmont Pines Home, Moving On After visit | article-6192294 | Real Estate-nav-hcat | 1 Dilapidated Marin County cottage sells for $70K over asking visit | blogPost-1661744 | Real Estate-nav-hcat | 2 Occidental retreat celebrates great outdoors visit | article-6190089 | Real Estate-nav-hcat | 3 Zynga's Mark Pincus delists $18-million Gold Coast home visit | blogPost-1659875 | Real Estate-nav-hcat | 4 Cars visit | Cars | navigation-www | 1 Dealers visit | Cars-Dealers | navigation-www | 1 Click and Clack visit | Cars-Click and Clack | navigation-www | 2 Car Blog visit | Cars-Car Blog | navigation-www | 3 My Ride visit | Cars-My Ride | navigation-www | 4 Sell Your Car visit | Cars-Sell Your Car | navigation-www | 5 Job Events visit | Jobs-Job Events | navigation-www | 1 Advertise visit | Jobs-Advertise | navigation-www | 2 Salary Wizard visit | Jobs-Salary Wizard | navigation-www | 3 Take the mystery out of recruitment: Part 2 San Francisco is among the best cities for recent grads Think twice before complaining about your job on social media SFChronicle visit | SFChronicle | navigation-www | 3 Latest columns visit | SFChronicle-Latest columns | navigation-www | 1 <mark>Michael Bauer</mark> visit | SFChronicle-Michael <mark>Bauer</mark> | navigation-www | 2 Jon Carroll visit | SFChronicle-Jon Carroll | navigation-www | 3 Leah Garchik visit | SFChronicle-Leah Garchik | navigation-www | 4 Bruce Jenkins visit | SFChronicle-Bruce Jenkins | navigation-www | 5 Chip Johnson visit | SFChronicle-Chip Johnson | navigation-www | 6 Ann Killion visit | SFChronicle-Ann Killion | navigation-www | 7 <mark>Thomas Lee</mark> visit | SFChronicle-Thomas <mark>Lee</mark> | navigation-www | 8 Matier & Ross visit | SFChronicle-Matier & Ross | navigation-www | 9 C.W Nevius visit | SFChronicle-C. W Nevius | navigation-www | 10 Kathleen Pender visit | SFChronicle-Kathleen Pender | navigation-www | 11 Scott Ostler visit | SFChronicle-Scott Ostler | navigation-www | 12 http: //www.sfgate.com/news/crime/article/Police-seek-arrest-of-mother-of-disabled-man-left-6195571.php Police seek arrest of mother of disabled man left in woods print_article | article-6195571 | article-share-redesign | 7 comments_jump | article-6195571 | article-share-redesign | 1 email_share | article-6195571 | article-share-redesign | 1 facebook_share | article-6195571 | article-share-redesign | 2 twitter_share | article-6195571 | article-share-redesign | 3 pinterest_share | article-6195571 | article-share-redesign | 4 reddit_share | article-6195571 | article-share-redesign | 5 google_share | article-6195571 | article-share-redesign | 6 PHILADELPHIA (AP) - An arrest warrant has been issued for the mother of a severely disabled man left in the woods for several days near a Philadelphia park, authorities said. Nyia Parler left her 21-year-old son - who is quadriplegic and has cerebral palsy - lying in leaves and covered with a blanket next to a wheelchair and Bible while she left town, police said. He was found Friday night near Cobbs Creek Park. Police believe he was left there between the time he and his mother were seen together on Easter Sunday and before his mother boarded a bus Monday for Maryland to visit her boyfriend, said Lt. Walker said the victim was found was around the corner from their home and described the scenario authorities believe to have taken place this way:\" She pushes him about 150 yards from the highway into the wooded area, takes him out of wheelchair, lays him on the ground, puts a blanket over him and leaves a Bible with him, and then just walks away. \"During the period he was exposed to the elements, the young man was\" completely defenseless \"in an area with wild animals, with no water and in cold, damp weather, Walker said .\" It's only by the grace of God that he survived this. Amazing, \"he said. Contacted in Maryland after the young man's school became concerned about her absence, the victim's mother told relatives and authorities that he was with her, Walker said .\" Obviously her statements made during the week were not truthful, \"he said. Her boyfriend, however, assumed other relatives were caring for the young man and\" was in shock when he learned what happened, \"Walker said. A 16-year-old son also residing with the family is now the care of other family relatives, Walker said. Parler, 41, of Philadelphia, will face charges including aggravated assault, reckless endangering, neglect of a care-dependent person, kidnapping, unlawful restraint and false imprisonment, according to police. Philadelphia Inquirer reported that Maryland authorities said Parler was admitted to a hospital Sunday morning for treatment of an undisclosed condition .\" When her treatment is completed, we will take her to court and she can either waive or fight extradition, \"Capt. Paul Starks of the Montgomery County, Maryland, police told the newspaper. Walker said the son was hospitalized with dehydration, malnutrition, a deep cut on his back that caused concern about potential infection and possible eye injuries, but he appeared to be improving .\" He seemed to be a little happier yesterday, \"Walker said .\" You could tell he knew his family was around and felt more comfortable. \"Dear Abby: Friendly divorce may be best for unhappy wife Emotional memorial for pedestrian killed in S.F. car chase Actor <mark>Ryan Reynolds</mark> hit, not injured, by car in Vancouver Consumer Reports survey identifies cheapest, most expensive...4-year-old's tip leads to discovery of her parent's bodies Activate! Activate for access to SFChronicle.com!", "articleID": "2015041307_00026710_W", "names": {"Michael Bauer": ["Q1282419", "Q13194754", "Q21091340", "Q23559839", "Q3313220", "Q43127233", "Q50638837", "Q52833454", "Q55688645", "Q56953337", "Q6828496"], "Ryan Reynolds": ["Q192682", "Q7384463"], "Thomas Lee": ["Q49764058", "Q53953082", "Q54556224", "Q54557092", "Q54635300", "Q57434756", "Q7791777", "Q7791780", "Q9031661"]}}, {"date": "2015-04-13", "url": "http://seventeen.com/celebrity/movies-tv/news/a30020/cara-delevingne-casting-alice-in-wonderland", "content": "We've only gotten a taste of Cara Delevingne's mad acting skills in the Paper Towns, but it's already impossible to imagine a time when the supermodel wasn't an A-list actress. It might be hard to believe, but before her acting career took off, she was actually passed over for a major role in one of your fave Disney movies. Cara recorded an audition tape for the lead role of Alice in Disney's Alice in Wonderland and sent it to the producers, and for a second, it looked like she might be destined to get the part. New Zealand Herald of her crazy first-audition experiences, \"Then I was at a wedding and this woman came over to me. She said,\" You don't know me, but I know exactly who you are'. \"It turned out to be a producer behind the Alice In Wonderland movie .\" She told me that they all loved my tape! And I went to <mark>Tim Burton</mark>'s house and met with him. \"Obvs in the end, she didn't get the part, but she's not bitter .\" I didn't get the part, but that experience lit a fire in me, \"Cara said of how the experience helped spark her acting career. Even though we're supes bummed we never got to see an Dylan O'Brien & <mark>Gina Rodriguez</mark> Are In Talks To Star In A Major Movie Together! Fifth Harmony's Camila Cabello Shuts Down Becky G Feud Rumors In The Best Way Possible Rebel Wilson Doesn't Think It's Best for Girls to Model Themselves After Victoria's Secret Models", "articleID": "2015041317_00015921_W", "names": {"Gina Rodriguez": ["Q16729296", "Q732111"], "Tim Burton": ["Q56008", "Q7803257"]}}]