[{"articleID": "2012110408_00052765_W", "names": {"Mariano Rivera": ["Q382303", "Q48924970"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"], "Jeremy Hill": ["Q42422137", "Q57833877", "Q6181474", "Q6181476"]}, "date": "2012-11-04", "url": "http://nypost.com/p/sports/college/football/fit_to_be_tide_bX3PbQlysrVrOatwhgYQgN?utm_medium=rss&utm_content=Football", "content": "show of hope new york - from \"livin' on a prayer\" to \"the living proof,\" every song...little big apple with christmas around the corner, here's an ipad sized for elves. apple...pm: free pussy riot moscow - russia's prime minister said the women in the pussy riot band...fired-up party dennis rodman celebrated getting fired from \"all-star celebrity apprentice\" ...current broadway star jake gyllenhaal has been hanging at theater haunts...wilde side while many celebs ditched downtown manhattan last week for uptown...one mo time <mark>mariano rivera</mark> will be back in the bronx in 2013, as first reported by the...welcome home! it wasn't the opening night opponent the nets spent months planning for...tough as steel in the end, whether today's giants-steelers game provides a diversion or...tender <mark>bond</mark> his year marks the 50th anniversary of <mark>james bond</mark>'s first on-screen...<mark>bond</mark> classics first there's the bold, brassy note that sounds as if it's shimmering in...moms tell all you know her (and love to loathe her): the ultra-enviable hollywood mom,...baton rouge, la. - it wasn't billed as the game of the century. it just felt like it. after kansas state, notre dame and oregon had played - and won - their games, alabama and lsu reminded us one more time about the singular truth that exits in college football: the national championship always comes down to the sec, the uber conference. want to know why the last six bcs champs have come from this league? watch a replay of last night's epic that ended with alabama rallying for a 21-17 win at tiger stadium. \"we told our players, and it was kind of ironic they would have to overcome a lot of things to win a game here,\" alabama coach nick saban said. \"i've never been prouder of a bunch of guys to overcome adversity.\" wham, bama! alabama's t.j. yeldon scores after a 28-yard pass from aj mccarron with 51 seconds remaining to give the no. 1 crimson tide a 21-17 victory over lsu yesterday in an sec battle in baton rouge, la. lsu, trailing 14-3 in the third quarter and watching any chance of playing for the title slipping away like fog on the bayou, staged a comeback for the ages against the program of the decade. the tigers, behind a 1-yard touchdown dive by <mark>jeremy hill</mark> late in the third quarter and a 14-yard td pass from zach mettenberger to jarvis landry in the fourth took a 17-14 lead and held onto it until a scant 51 seconds remained. then no. 1 alabama drove a dagger into the record crowd of 93,374 in death valley. \"there are some sick guys in that room,\" lsu coach les miles said of his players after the bitter defeat. the crimson tide, led by heisman trophy candidate quarterback aj mccarron, went 72 yards in five plays with mccarron throwing a perfect screen pass to t.j. yeldon - against a blitzing lsu defense - that went 28 yards for the touchdown. saban said earlier this week he showed his players a tape of the navy seal team that took out osama bin laden. he pointed out that a lot of things went wrong on the mission, but the team adapted and got the mission done. alabama (9-0) protected its top ranking and its dream of back-to-back national titles. the tide have won 57 games over a five-year span, tying an sec record. fifth-ranked lsu (7-2) is out of the championship picture. on their winning drive, the tide got the ball with 1:34 left. mccarron, with no timeouts remaining, was 4-for-5 for 72 yards and the touchdown. he has thrown 19 touchdown passes and no interceptions this season. with the winning catch-and-run, yeldon atoned for a fumble on the lsu 10 late in third quarter when the tide seemed poised to build on a 14-10 lead. meanwhile the other unbeaten teams - kansas state, which beat oklahoma state, 44-30, notre dame, which overcame a 20-6 deficit to edge pittsburgh, 29-26 in triple overtime, and oregon, which blitzed usc, 62-51 - are left to fight for the right to face alabama. mettenberger was at his best on the drive that put the tigers up 17-14. he was 4-of-5 for 82 yards including one huge third down conversation before finding landry for the go-ahead score. the drama had just begun. lsu's defense held again and the tigers drove to the alabama 24, where they faced a fourth-and-1 at the 24. miles, of course, went for it, eschewing a field goal and a probable seven-point lead. alabama stuffed the run and held with 8:41 left. the tigers' defense rose up again, but when drew alleman missed a 45-yard field goal with 1:34 remaining, the tide had one last chance. mccarron made it count. new york post is a registered trademark of nyp holdings, inc. ."}, {"articleID": "2019012916_00141238_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-01-29", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/may-urges-mps-to-give-her-strong-mandate-to-renegotiate-brexit-37761521.html", "content": "Northern Ireland <mark>May</mark> urges MPs to give her strong mandate to renegotiate Brexit The Prime Minister was addressing the House of Commons ahead of a crucial set of votes on the way ahead for EU withdrawal. <mark>May</mark> urges MPs to give her strong mandate to renegotiate Brexit BelfastTelegraph. co. uk <mark>Theresa May</mark> has urged MPs to give her \"the clearest possible mandate\" to go back to Brussels and reopen Brexit negotiations with the aim of replacing the controversial backstop. https: //www.belfasttelegraph.co.uk/news/northern-ireland/may-urges-mps-to-give-her-strong-mandate-to-renegotiate-brexit-37761521.html Email <mark>Theresa May</mark> has urged MPs to give her \"the clearest possible mandate\" to go back to Brussels and reopen Brexit negotiations with the aim of replacing the controversial backstop. Opening a crucial day of debate in the House of Commons, Mrs <mark>May</mark> said MPs had made clear what they did not want when they rejected her Withdrawal Agreement by a 230-vote margin earlier this month, but now it was time for them to tell Brussels what they do want. She called for them to send an \"emphatic message\" to the EU by backing an amendment tabled by Tory grandee Sir Graham Brady which would require her to replace the backstop with \"alternative arrangements\" to avoid a hard border in Ireland. And she told them: \"If you want Brexit, you have to vote for Brexit.\" Despite what she acknowledged was a \"limited appetite\" in Europe for reopening talks, she insisted: \"I believe with a mandate from this House...I can secure such a change in advance of our departure from the EU.\" The amendment from Sir Graham--the chair of the influential Tory backbench 1922 Committee--was one of seven selected by Commons Speaker John Bercow for consideration and possible votes on Tuesday evening. Also up for debate is a cross-party proposal from Labour MP Yvette Cooper and Tory Nick Boles--backed by the Labour frontbench--which would hand control over the Brexit process to Parliament, potentially delaying departure day from March 29 to the end of the year. Mr Bercow also selected Jeremy Corbyn's own amendment--which would allow debate on Labour's preferred plan or a second referendum--as well as others which would rule out a no-deal Brexit, extend the two-year negotiation under Article 50 or permit a series of \"indicative votes\" to establish the will of the Commons. The Commons chamber was packed as the day's debate on Brexit began (PA) In an attempt to fend off possible rebellion by Tories seeking to avoid a no-deal departure, Mrs <mark>May</mark> promised that Tuesday's votes would not be MPs' final chance to pass judgment on EU withdrawal. She told the Commons she aims to return to the House \"as soon as possible\" with a revised deal, which will be subject to a \"meaningful vote\" of MPs. If defeated, she will table another amendable motion for debate the following day. If no new deal is reached by February 13, the PM will make a statement to Parliament that day and table an amendable motion for debate the following day. Mrs <mark>May</mark> acknowledged that the Commons defeat of the Withdrawal Agreement she agreed with EU leaders last November had been \"decisive\" . And she told MPs: \"I listened.\" It was in the interests of the whole House to back the Brady amendment, which would resolve the main obstacle to Britain securing a smooth and orderly exit from the EU, she said. A cross-party amendment tabled by Yvette Cooper was selected for debate (PA) Mrs <mark>May</mark> said it was time for Parliament to \"speak as one\" . \"I will never stop battling for Britain, but the odds of success become much longer if this House ties one hand behind my back,\" she said. \"I call on this House to give me the mandate I need to deliver a deal this House can support.\" Do that and I can work to reopen the Withdrawal Agreement. Do that and I can fight for a backstop that honours our commitments to the people of Northern Ireland in a way this House can support. Do that and we can leave the EU with a deal that honours the result of the referendum. \"So the time has come for words to be matched by deeds. If you want to tell Brussels what this House will accept, you have to vote for it. If you want to leave with a deal, you have to vote for it. If you want Brexit, you have to vote for Brexit.\" She warned those considering voting for the \"cacophony\" of rival amendments to rule out no-deal: \"Unless we are to end up with no Brexit at all, the only way to avoid no-deal is to agree a deal.\" That is why I want to go back to Brussels with the clearest possible mandate to secure a deal that this House can support. That means sending the clearest possible message not about what this House does not want but what we do want. \"Mrs <mark>May</mark>'s hopes of securing a majority for the Brady amendment were boosted when former foreign secretary and Brexit figurehead Boris Johnson said he would\" gladly \"vote for it, if it meant legally binding changes to the backstop. We can't have some codicil or letter or joint declaration. We need to go back into the text of the treaty and solve the problem. That is the way to unite remainers and leavers in the Conservative party and across the country 2/2--Boris Johnson (@ BorisJohnson) January 29, 2019 But the chances of the Commons derailing her plans were also heightened when Labour confirmed it will back the Cooper-Boles plan. Mrs <mark>May</mark> is expected to have phone discussions with key EU leaders over the course of the day, with votes taking place in the early evening. Brussels has been adamant that it will not reopen the Agreement, and Ireland's European affairs minister, Helen McEntee, cautioned:\" There can be no change to the backstop. It was negotiated over 18 months with the UK and by the UK. A bit of realism is needed at this stage. \"But Mrs <mark>May</mark>'s official spokesman said:\" There is a very clear message from the EU's leaders that they want the UK to leave with a deal and that they understand this is in the best interests of the EU as well as the UK. \"(PA Graphics) Tory MPs were told at a meeting with Mrs <mark>May</mark> on Monday evening that they would be whipped to support the Brady amendment. But it was far from clear whether this instruction would be followed by enough of the 118 Conservatives who rebelled against Mrs <mark>May</mark>'s deal on January 15. Remain-backing Tories <mark>may</mark> rally behind the Cooper-Boles amendment, while other proposals <mark>may</mark> gain cross-party support, including a plan by Conservative Caroline Spelman and Labour's Jack Dromey to rule out a no-deal Brexit. MPs rejected <mark>Theresa May</mark>'s EU withdrawal deal by a record margin of 230 votes earlier this month (Mark Duffy/UK Parliament/PA) Meanwhile, a compromise drafted by Conservative MPs from both the Remain and Leave sides of the party won the crucial backing of the Democratic Unionist Party. Drawn up in meetings co-ordinated by housing minister Kit Malthouse, the compromise recasts the backstop as a\" free trade agreement-lite \", with a commitment on all sides there should be no hard border and an extended transition period to December 2021. DUP leader Arlene Foster--whose 10 MPs prop up the minority Conservative administration in the Commons--said it provided a\" feasible \"alternative to the backstop.\" If the Prime Minister is seeking to find a united front, both between elements in her own party and the DUP, in the negotiations which she will enter with the European Union, then this is a proposition which she should not turn her back on, \"said Mrs Foster. Press Association"}, {"articleID": "2010032120_00122871_W", "names": {"Michael Weiner": ["Q3308574", "Q39710513", "Q56850515", "Q6835258", "Q6835259", "Q878144"], "Colin Curtis": ["Q2982583", "Q5145027"], "Pat Fitzgerald": ["Q19873419", "Q7143446"]}, "date": "2010-03-21", "url": "http://nj.com/yankees/index.ssf/2010/03/notes_a_few_visitors_and_a_few.html", "content": "jesus montero was reassigned to minor league camp on sunday, though not before leaving a good impression with yankees manager joe girardi. tampa, fla.--a few notes after sunday's rainout...players' association chief <mark>michael weiner</mark> spent about an hour giving a presentation in the yankees clubhouse on sunday morning, part of the union leader's annual tour through spring training. <mark>weiner</mark> said he touched on the collective bargaining agreement, which expires after the 2011 season. \"our contract is up after 2011 and by this time next year, if history is any guide, negotiations will have started already,\" he said. \"it's really just preparing them for that.\" *** the yankees reassigned two top prospects to minor league camp on sunday in catchers jesus montero and austin romine. montero is expected to begin the season in triple-a scranton/wilkes-barre while romine will likely be headed to double-a trenton. \"i was impressed with their work, their willingness to learn, their willingness to take what you give them and apply it to the game,\" girardi said. outfielders reid gorecki and <mark>colin curtis</mark> were also cut. *** northwestern football coach <mark>pat fitzgerald</mark> and his family visited yankees camp as guests of girardi, himself a northwestern alum. girardi followed <mark>fitzgerald</mark> as a player on the wildcats' powerful teams in the mid-1990s. in 2006, <mark>fitzgerald</mark> became the youngest head coach in the history of the big ten, taking over at northwestern following the death of then-coach randy walker. 0) {document.location.href =d. options [d.selectedindex]. value;} return false; \"> video: highlights of ny yankees world series-clinching victory and ticker-tape parade n.j. school boards weigh tough options after gov. christie's budget cuts states increasingly take aim at teachers' tenure as legal fees mount to fire some arrest made in racial prank at washington township walmart store n.j. man with multiple sclerosis gets prison for growing marijuana © 2009 new jersey on-line llc. all rights reserved ("}, {"articleID": "2013120318_00085434_W", "names": {"John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"]}, "date": "2013-12-03", "url": "http://www.kamcity.com/namnews/asp/newsarticle.asp?newsid=73133", "content": "UK: Waitrose Serves Up \"Kid Friendly' Brussels Sprouts Waitrose has announced the launch of a\" kid friendly' version of Brussels Sprouts, aimed at getting children to eat more of the vegetable during Christmas. The variant is a sweeter variety of the sprout, and will be available for just two weeks, starting 3 December. The chain said it has been testing two kid-friendly versions with growers over the past year, adding that the final product does not have the traditionally bitter aftertaste of Brussels Sprouts. It added: \"In the tests we have done people definitely notice the sweetness coming through\" . Waitrose noted: \"We're not saying where we got them from as we're worried that our rivals would simply copy us. We have bought up the entire UK supply of this new variety - two weeks supply\" . Waitrose said the new variant is one of 15 types of sprouts the chain will sell this Christmas, including a \"red' variety. UK: <mark>John Lewis</mark> Looking To Develop Food Offer With New Shop Floor Concessions UK: Waitrose To Stock New House of Cuckoo Cupcake Boxes UK: Tesco Expected To Reveal Another Period Of Falling Sales UK: Frozen Foods And Online Driving Growth At Waitrose"}, {"articleID": "2019111417_00108670_W", "names": {"John Major": ["Q27957644", "Q47546458", "Q9559"]}, "date": "2019-11-14", "url": "http://braintreeandwithamtimes.co.uk/news/national/18037648.justice-alfie-lamb-ex-ministers-son-jailed-car-seat-crush-death/", "content": "\"Justice' for Alfie Lamb as ex-minister's son jailed for car seat crush death By Press Association 2019 Alfie Lamb manslaughter court case The family of three-year-old Alfie Lamb said\" justice has prevailed \"after an ex-minister's son was jailed for crushing him to death with a car seat. Stephen Waterson, 26, reversed the seat of his Audi convertible, squashing his girlfriend's young son in the footwell on February 1 last year. He then orchestrated a\" campaign of lies \", even threatening to make witnesses\" disappear \"to avoid responsibility for Alfie's death. The toddler's aunt, Ashleigh Jeffery, eventually broke the wall of silence and recorded Alfie's mother revealing what really happened. A jury had failed to reach a verdict in Waterson's trial and he pleaded guilty of manslaughter by gross negligence in September ahead of his retrial. On Thursday, Mr Justice Kerr sentenced Waterson to seven-and-a-half years for manslaughter, plotting to pervert the course of justice and intimidating witness Marcus Lamb. The judge said:\" I do not find you were annoyed with Alfie and moved your seat back because of that annoyance. \"\"Nevertheless, I am satisfied so that I am sure on the evidence I heard at the trial that albeit not in anger but for your own comfort, you moved the car seat back twice and not only once.\" Stephen Waterson crushed three-year-old Alfie Lamb to death with his car seat (Metropolitan Police/PA) He accepted character references from the defendant's father, the former minister Nigel Waterson and his wife Barbara, who attended court, and agreed he was \"not all bad\" . But he said Waterson had been \"cunning, manipulative, dishonest, disloyal, deceitful, threatening, controlling and sometimes violent\" . Earlier this year, Alfie's mother, Adrian Hoare, 24, from Gravesend in Kent, was jailed for two years and nine months for child cruelty and her part in the conspiracy. Pregnant barmaid Emilie Williams, 20, had admitted lying to police and was sentenced to five months' imprisonment, suspended for 18 months, and 100 hours of unpaid work. On the cover-up, Mr Justice Kerr told Waterson: \"You orchestrated the campaign of lies, assisted by Ms Hoare who had the misfortune to fall in love with you and was willing to lie to protect you and herself.\" When the conspiracy began to falter in the second half of February 2018 under pressure from a very brave young woman, Ms Ashleigh Jeffery, you resorted to threats of violence, saying you could make people disappear. \"Alfie's mother Adrian Hoare was\" unlucky enough to fall in love' with Waterson and was caught up in the lies. (Met Police/PA) Speaking outside court, Ms Jeffery told how the family had been \"utterly devastated\" by the death of \"a very happy three-year-old boy with his whole life ahead of him\" . She said: \"The tragic circumstances surrounding his death is something we will never come to terms with.\" No sentence will ever be enough, but today we finally gave Alfie a voice and justice has prevailed. \"In a victim impact statement, she also said Waterson's guilty plea had been\" like a huge weight had been lifted \". Ms Jeffery, who had given key evidence in court, said:\" He could have avoided so much more upset in people's lives had he just owned up in the beginning. \"\"Justice has prevailed' Alfie's aunt Ashleigh Jeffery speaking outside the Old Bailey in London (Kirsty O’Connor / PA) Detective Chief Inspector Simon Harding described Waterson as a\" very arrogant, selfish, controlling and manipulative man \". He said:\" He knew what happened. He tried to put my officers off the scent from the word go. \"He paid tribute to Ms Jeffery, saying she had been\" incredibly strong and brave \"in her determination to find out what happened and\" changed the course of the investigation \". It is the first time anyone in the UK has died from crush asphyxiation as a result of an electronic car seat, police said. Stephen Waterson and Adrian Hoare with Alfie Lamb were caught on CCTV during a shopping trip to Sutton on the day he died (Metropolitan Police/PA) Waterson and Hoare had gone shopping for cushions in Sutton, south London, accompanied by Alfie, Williams, Marcus Lamb, 22, and another young child. Nightclub worker Waterson wanted to stretch his legs out and twice moved his front passenger seat into Alfie as he sat at his mother's feet, jurors heard. By the time they arrived at Waterson's home in Croydon, the little boy had collapsed and he died from crush asphyxia three days later. Nigel Waterson and Barbara Judge, parents of adopted Stephen Waterson, remained tight-lipped after their son Stephen was sentenced at the Old Bailey (Kirsty O’Connor / PA) In mitigation for Waterson, Tana Adkin QC told the court:\" Whilst thoughtless, I have no doubt, and selfish in his behaviour on February 1, he was not deliberately malevolent and nasty towards Alfie. \"Waterson's father Nigel Waterson was first elected MP for Eastbourne in 1992 and was a junior minister in <mark>John Major</mark>'s government, but was defeated by Liberal Democrat Stephen Lloyd at the 2010 general election."}, {"articleID": "2019021414_00286288_W", "names": {"Andrew Wheeler": ["Q4758886", "Q58994423"], "El Niño": ["Q5698971", "Q8773214"]}, "date": "2019-02-14", "url": "http://kfgo.com/news/articles/2019/feb/14/epa-to-begin-rulemaking-for-drinking-water-limit-for-pfa-chemicals-later-this-year/", "content": "EPA to begin rulemaking for drinking water limit for PFA chemicals later this year Thursday, February 14, 2019 8:25 a.m. CST FILE PHOTO: The U.S. Environmental Protection Agency (EPA) sign is seen on the podium at EPA headquarters in Washington, U.S., July 11, 2018 (Reuters) - The U.S. Environmental Protection Agency on Thursday laid out a plan to control a group of toxic chemicals found in Americans' drinking water but will not set a limit for them until later this year. Acting EPA Administrator <mark>Andrew Wheeler</mark> on Thursday announced the agency's Per - and Polyfluoroalkyl Substances (PFAS) Action Plan, a series of short - and long-term steps to help states exposed to these common chemicals found in Teflon and foams used by firefighters linked to cancer and other health risks. The agency did not announce a maximum contaminant level (MCL) for PFAS, a legal limit for the amount the chemical can be allowed in drinking water under the Safe Drinking Water Act. By the end of this year, EPA said it will undertake a rulemaking process around that by the end of the year. \"We are moving forward with several important actions, including the maximum contaminant level process, that will help affected communities better monitor, detect, and address PFAS,\" <mark>Wheeler</mark> said. (Reporting by Valerie Volcovici; Editing by Chizu Nomiyama) More From National Weak <mark>El Niño</mark> likely to prevail through spring: U.S. forecaster Striking Denver teachers, school district reach deal to end walkout: union Denver teachers, school district reach deal to end strike After year of action, silence to mark Florida school shooting After ex-policeman's murder sentence, divisions in Chicago persist Democrats swear off big money, but will it hurt their 2020 White House chances? Comments"}, {"articleID": "2014112709_00029452_W", "names": {"David Mckay": ["Q1175601", "Q15500677", "Q46515282", "Q47541485", "Q5237382", "Q5237386", "Q55942880"], "Gary Ross": ["Q5525855", "Q598675"]}, "date": "2014-11-27", "url": "http://fin24.com/Economy/Opec-wont-cut-output-despite-oil-price-dip-20141127", "content": "Toilets before temples It's no joke - sanitary shortcomings hamper economic growth, says Leopold Scholtz. Medical savings fact sheet Find out how the savings account on your medical scheme option works. We're currently experiencing serious technical problems on the site, and as a result are unable to update the news - even though our market data is running as per normal. We sincerely apologise for any inconvenience caused and hope to be up and running again this evening. Thank you for your patience in this regard. - <mark>David McKay</mark> (editor) & team Vienna - Opec Gulf oil producers will not propose an output cut on Thursday, reducing the likelihood of joint action by Opec to prop up prices that have sunk by a third since June and raising the prospect of a global oil price war. \"The GCC reached a consensus,\" Saudi Arabian Oil Minister Ali al-Naimi told reporters, referring to the Gulf Cooperation Council which includes Saudi Arabia, Kuwait, Qatar and the United Arab Emirates. \"We are very confident that Opec will have a unified position.\" \"The power of convincing will prevail tomorrow...I am confident that Opec is capable of taking a very unified position,\" Naimi added. A Gulf Opec delegate told Reuters the GCC had reached a consensus not to cut oil output. Three Opec delegates separately told Reuters they believed Opec was unlikely to cut output when the 12-member organisation meets on Thursday. The Opec meeting will be one of its most crucial in recent years, with oil having tumbled to below $78 a barrel due to the US shale boom and slower economic growth in China and Europe. Cutting output unilaterally would effectively mean for Opec, which accounts for a third of global oil output, a further loss of market share to North American shale oil producers. If Opec decided against cutting and rolled over existing output levels on Thursday, that would effectively mean a price war that the Saudis and other Gulf producers could withstand due to their large foreign-exchange reserves. Other members, such as Venezuela or Iran, would find it much more difficult. Brent crude was trading down 73 cents at $77.60 a barrel at 21:19. Naimi said earlier on Wednesday he expected the oil market \"to stabilise itself eventually\" , after talks with non-Opec member Russia on Tuesday yielded no pledge from Moscow to tackle a global oil glut jointly. The UAE sided with Naimi, saying oil prices would soon stabilise, while ramping up pressure on non-Opec nations. \"This is not a crisis that requires us to panic...we have seen (prices) way lower,\" UAE Oil Minister Suhail bin Mohammed al-Mazroui told Reuters. \"The oversupply came from the evolution of the unconventional oil production...I think everyone needs to play a role in balancing the market, not Opec unilaterally,\" he said. Iranian Oil Minister Bijan Zangeneh said some Opec members, although not Iran, were now gearing up for a battle over market share. \"Some Opec members believe that this is the time where we need to defend market share...All the experts in the market believe we have oversupply in the market and next year we will have more oversupply,\" he added. The group could opt to roll over output levels but stress the importance of better compliance, while also agreeing to hold an extraordinary meeting if prices keep falling, several Opec watchers have suggested. Price war Among the members of the Organisation of the Petroleum Exporting Countries, Venezuela and Iraq have called for output cuts. Opec's traditional price hawk Iran said on Wednesday its views were now close to those of Saudi Arabia. Zangeneh said there was unity inside Opec to \"monitor the market carefully\" but made no mention of a cut. \"The onslaught of North American shale oil has drastically undermined Opec's position and reduced its market share,\" said Dr <mark>Gary Ross</mark>, chief executive of PIRA Energy Group. Russia, which produces 10.5 million barrels per day (bpd) or 11% of global oil, came to Tuesday's meeting amid hints it might agree to cut output as it suffers from oil's price fall and Western sanctions over Moscow's actions in Ukraine. But as that meeting with Naimi and officials from Venezuela and non-Opec member Mexico ended, Russia's most influential oil official, state firm Rosneft's head Igor Sechin, emerged with a surprise message - Russia will not reduce output even if oil falls to $60 per barrel. Sechin added that he expected low oil prices to do more damage to producing nations with higher costs, in a clear reference to the US shale boom. On Wednesday, Russian Energy Minister Alexander Novak said he expected the country's output to be flat next year. Many at Opec were surprised by Sechin's suggestion that Russia - in desperate need of oil prices above $100 per barrel to balance its budget - was ready for a price war. \"Gulf states are less bothered about a price drop compared to other Opec members,\" an Opec source close to Gulf thinking said. Opec publications have shown that global supply will exceed demand by more than 1 million bpd in the first half of next year. While the statistics speak in favour of a cut, the build-up to the Opec meeting has seen one of the most heated debates in years about the next policy step for the group. 24. com publishes all comments posted on articles provided that they adhere to our SA's best and worst cellphone contracts AnswerIt Get your financial questions answered. RSS Feeds News delivered really simply. Calculators Easy-to-use personal finance tools. Newsletters You choose what you want. Blogs Your opinion on you, me and everyone. Data Products Get us in your home, on your television."}, {"articleID": "2018062311_00047099_W", "names": {"Paul Rudd": ["Q276525", "Q7153351"], "Edgar Wright": ["Q21552520", "Q37979146", "Q522057"]}, "date": "2018-06-23", "url": "http://www.avclub.com/?startTime=1529690400772", "content": "The A.V. Club - Pop culture obsessives writing for the pop culture obsessed. The A.V. Club Go to permalink Bad Witch is a thin, if rewarding, listen from Nine Inch Nails; while Kamasi Washington's cinematic soul-jazz is more ambitious than ever on the awe-inspiring Heaven And Earth; and Gang Gang Dance turn in a somewhat too-impeccable sixth LP with Kazuashita. These, plus Martyn and The Orb in this week's notable new...View on Kinja Deals | The Inventory Go to permalink In his new film, <mark>Paul Rudd</mark> plays Moe Berg, a Major League Baseball veteran who joined the Office Of Strategic Services as a spy in World War II to thwart Germany's attempt at a nuclear weapon. At the premiere of the film, we spoke with <mark>Rudd</mark> about the role. The Catcher Was A Spy Go to permalink A - After the mystical and enigmatic happenings in The Defenders, it's a real treat to return to the down-to-earth setting of Luke Cage. The subject matter feels familiar; the thrilling chess game of the underworld, dirty cops, drugs, stylish musical performances, and jazz and that's a good thing. The season two premiere...Go to permalink Welcome back to, where we throw out a question for discussion among the staff and readers. Consider this a prompt to compare notes on your interface with pop culture, to reveal your embarrassing tastes and experiences, and to ponder how our diverse lives all led us to convene here together. Got a question you'd AVQ & A...Go to permalink There are a handful of things that the average person knows about lobsters. They're an expensive thing to order at a restaurant. According to cartoons, they'll pinch the hell out of you. Jordan Peterson seems weirdly fixated on them. But, did you know that, technically speaking, lobsters can live forever? For a brief...Go to permalink Netflix stood by Jeffrey Tambor in the wake of his firing from Amazon's Transparent on sexual misconduct charges, but Paramount--perhaps after seeing the complete media shitshow currently swirling around Tambor and Arrested Development--is taking no such chances. reports that the studio has booted Tambor from...The Wrap Go to permalink Variety reports NBC has canceled the sci-fi drama. No, you're not experiencing déjà vu--it's just that a little more than a year after the network reversed its own decision to cancel the series from Eric Kripke and Shawn Ryan, NBC has decided once more that time's up for Timeless. Timeless Go to permalink The Weather Channel, it would seem, has received a bunch of money and decided to spend it on creating a cyberpunk-style postmodern augmented reality nightmare called Immersive Mixed Reality. Here Meteorologist Jim Cantore plays the role of Hiro Protagonist, as reality melts away and a furious tornado lays siege to The...Go to permalink Sometimes it's the simple things in life that bring the most joy--the smell of a freshly blooming wild flower on a spring day; a cup of coffee in the early morning hours; notorious blowhard Piers Morgan trying to make fun of someone on TV and inadvertently embarrassing himself instead. Shared from The Takeout Go to permalink Hey Salty, I live in a foodie-friendly city that allows my burger-loving heart (philosophically, not physically) to try out a new burger joint almost every week. I'm not terribly picky, and love trying out specialty burgers. If there's an item that I'm not super fond of, I'll usually try it anyway to see if they can...Go to permalink The Terror, AMC's first foray into the anthology-series trend, has been a big success for the network, ending its first season as the No. 2 drama on cable and earning high marks from critics like The A.V. Club's own Sean T. Collins, who gave all but one episode a stellar \"A\" rating. (Episode two got an \"A -.\" ) So,...Go to permalink The Dora Milaje are a household name after the massive success of Ryan Coogler's Black Panther. Now, Wakanda's group of elite warrior women is stepping into the spotlight in a Wakanda Forever trio of one-shots teaming these female fighters with Marvel's most popular heroes. Writer Nnedi Okorafor wrote a fantastic...View on Kinja Deals | The Inventory Go to permalink Need to get caught up before you see Jurassic World: Fallen Kingdom? All four films (including the semi-recent Jurassic World) are down to just $17 in one awesome Blu-ray set, complete with two discs full of bonus features, and even digital copies. Advertisement Go to permalink Introducing his Thursday interviewee (or \"opponent,\" as his ironic blowhard calls them), Jordan Klepper mentioned that all the proceeds from comedian Cameron Esposito's new standup special are going to charity. \"Comedy doing good in the world?,\" Klepper's pompous pundit asked incredulously, \"I just don't see it.\" But,...Go to permalink This month marks the 25th anniversary of Sleepless In Seattle, which reunited Meg Ryan with her co-star Tom Hanks. Well, kind of. While some rom-coms end in a kiss, some end in a wedding, and some don't offer a romantic happy ending at all, Sleepless In Seattle is something even more unique: a...Joe Versus The Volcano Go to permalink A dark-ish secret of the entertainment industry is that a major factor in big awards like the Oscars and Emmys is the advertising campaigns that try to get voters' attention. The idea is that if a voter gets a huge stack of critically acclaimed TV show episodes with no guidance, they might be so crippled by the huge...Go to permalink <mark>Edgar Wright</mark> movies tend to land somewhere between \"really good\" and \"great,\" so it's always a big deal when word starts to spread about whatever his next project will be. Will he reunite with Simon Pegg and Nick Frost for another brilliant genre satire? Will he make something wholly unique like Scott Pilgrim Vs. The...Go to permalink A - Pardon me while I catch my breath, because this is the most intense reunion ever held on RuPaul's Drag Race. I was expecting fireworks when all the queens got back together, particularly with The Vixen in the mix, but I couldn't have foreseen just how incendiary this episode would get. The elimination of The Vixen...More from The A.V. Club"}, {"articleID": "2013042705_00040594_W", "names": {"Brian Mccann": ["Q1059152", "Q4964655"], "Josh Hamilton": ["Q641352", "Q716346"]}, "date": "2013-04-27", "url": "http://mlb.mlb.com/mlb/gameday/index.jsp?gid=2013_04_27_atlmlb_detmlb_1&mode=preview&vkey=preview_web_home&c_id=det", "content": "atl: 680 am/93 .7 fm, wnnx 100.5 det: 97.1 the ticket porcello aims to bounce back facing medlen, braves though the tigers were on the winning end of friday's 10-0 series opener against the braves, seeing those numbers on the scoreboard may have brought back some bad memories for detroit's saturday starter, rick porcello. that was the exact score by which the tigers lost in porcello's last outing, which lasted less than one full inning. last saturday, porcello was tagged for nine runs on nine hits while lasting just two-thirds of an inning in his start against the angels. \"a little rusty, a little wild, a little unlucky,\" manager jim leyland said in characterizing porcello's disastrous start. \"and that pretty much sums it up.\" the unlucky part stemmed from the fact that all but one of the nine hits allowed by porcello were singles, with three not leaving the infield and three more finding their way up the middle on the ground. the only extra-base hit against porcello was a mike trout grand slam that ended the right-hander's day after 47 pitches and just two outs. \"i think we've all had games where guys are hitting the ball hard just right at [defenders],\" porcello said after the game, \"and you cruise through seven innings or whatever and you walk away feeling pretty good about it, but you didn't throw the ball that well. today, i felt like i threw the ball fine. it just wasn't in the cards for me.\" the braves, meanwhile, will counter with right-hander kris medlen, who--in spite of a 2.16 era--has already recorded more losses (two) in four starts this season than he did all of last year. that, however, is more of a testament to his dominant 2012 campaign than anything else. following his 10-1 record and 1.57 era in 50 appearances (12 starts) a season ago, medlen has experienced little drop-off this season, regardless of the two losses. medlen allowed just two runs over five innings, but he received zero runs of support in taking his first loss of the season in his season debut. then after allowing just one combined earned run in a pair of seven-inning performances in his previous two outings, medlen was saddled with his other defeat sunday after conceding three runs over six innings of work. braves: <mark>mccann</mark> homers twice in first rehab game catcher <mark>brian mccann</mark> homered in each of his first two at-bats friday with class a rome in his first game action since offseason shoulder surgery. he finished the game 2-for-3 with a pair of walks to go with his two homers. the current plan is to have <mark>mccann</mark>, who would be permitted to play up to 20 games in his rehab stint, play five games with rome, then approximately another five with triple-a gwinnett before making his return. though he's been able to swing without any issues for more than a month, <mark>mccann</mark> has been focused on regaining his arm strength following the surgery. \"the reports on him are that he is up to 180 feet throwing and it was really, really good,\" manager fredi gonzalez said. tigers: coke dealing with groin strain reliever phil coke was unavailable friday night due to a left groin strain, and his status for the rest of the weekend is up in the air. coke initially felt the strain while throwing a pitch in thursday's outing, during which he took the loss after allowing four runs on one hit and four walks over 1 1/3 innings of work. \"he's better today and so he's kind of a day-to-day guy at this point in time,\" head athletic trainer kevin rand said friday afternoon, \"but it'll probably be a couple days.\" worth noting tigers infielder jhonny peralta has reached base safely in each of his last 14 games. peralta is hitting .364 (20-for-55) with three doubles, a home run and nine rbis over the 14 games. @ paul_casella. this story was not subject to the approval of major league baseball or its clubs. select your team congrats! click now to claim your bingo ⇒ congrats! click now to claim your bingo ⇒ login watch your squares light up as each action happens. once you get five in a row, click the bingo button that will appear to the right. you have successfully submitted bingo! if you're selected as a winner for this game, you will be emailed your prize in three business days. 2012 subscription to postseason.tv (5 winners per game) first prize (championship series and world series): mlb.tv offseason subscription (5 winners per game) share with friends: get your first card now and share to earn two more cards. no purchase necessary to enter or win. open to legal residents of the 50 us and dc who are of legal age of majority in their jurisdiction (and at least 18 years of age). ends upon completion of the final out of the 2012 mlb world series championship. limit three (3) bingo cards per person and per email address per postseason game. all potential winning bingo cards are subject to verification and must be claimed within ten (10) minutes following the end of the applicable postseason game to be eligible for the drawing. no purchase necessary to enter or win. a purchase will not increase your chances of winning. odds of winning a prize will depend on the total number of bingo cards issued and the total number of valid potential winning bingo cards claimed for each applicable postseason game. void where prohibited by law. all disputes will be resolved solely by binding arbitration and entrants waive the ability to bring claims in a class action format. eligibility: mlb.com bingo (the \"promotion\" ) is open only to legal residents of the fifty (50) united states and washington, d.c. who are eighteen (18) years of age or older (except in the case of legal residents of certain states where the legal age of majority is greater than eighteen (18) years of age, such legal age of majority) at the time of entry. employees, officers, and directors (including immediate family members (spouse, parent, child, sibling and their respective spouses, regardless of where they reside) and members of the same household, whether or not related) of mlb advanced media, l.p. (\"sponsor\" ), the other mlb entities and each of their respective parents, affiliated companies, subsidiaries, licensees, distributors, dealers, retailers, printers, advertising and promotion agencies, and any and all other companies associated with the promotion are not eligible to participate or win a prize (defined below). the \"mlb entities\" shall mean sponsor, the office of the commissioner of baseball (\"boc\" ), its bureaus, committees, subcommittees and councils, major league baseball enterprises, inc., major league baseball properties, inc., the major league baseball clubs (\"clubs\" ), each of their parent, subsidiary, affiliated and related entities, any entity which, now or in the future, controls, is controlled by, or is under common control with the clubs or the boc and the owners, general and limited partners, shareholders, directors, officers, employees and agents of the foregoing entities. the promotion is subject to all applicable federal, state and local laws, rules and regulations. void where prohibited or restricted by law, rule or regulation. promotion period: the promotion period (the \"promotion period\" ) begins at 11:00 am eastern time (\"et\" ) on october 5, 2012 and ends upon completion of the final out of the 2012 mlb world series championship. how to enter: during the promotion period, you may enter the promotion by clicking on the banners, buttons and/or links within mlb.com gameday (a free application) and following the instructions provided to register for the promotion. if you are not already a member of mlb.com, you must become one before you can register to participate in the contest (membership is free). there is only one (1) way to participate in the promotion: online. no other method of entry or participation will be accepted. additional entries beyond the specified limit will be void. entries generated by script, macro or other automated means will be void. all information submitted online by entrants is subject to, and will be treated in a manner consistent with, mlb.com's terms of use accessible at: www.mlb.com/privacy. all online entries must include a valid e-mail address for the entrant. how to participate: upon successful registration, follow the instructions provided to receive one (1) virtual bingo card (the \"bingo card\" ) for each game of the 2012 mlb postseason played during the promotion period (each, a \"postseason game\" ). in addition, during the promotion period, participants may utilize sharing functionality available via the promotion upon completion of a successful contest (the \"sharing functionality\" ) to receive two (2) additional bingo cards. for each eligible individual any entrant notifies or makes aware of the promotion who clicks on a valid link made available via the sharing functionality identifiable as having come from the entrant, such entrant shall receive two (2) additional bingo cards (for a total of three (3) bingo cards). no additional bingo cards will be received other than through verified sharing functionality. there is a limit of three (3) bingo cards per person and per e-mail address per postseason game. each bingo card shall include a 5x5 grid that includes twenty-five (25) tiles (each, a \"tile\" ). each tile will include one (1) randomly selected game outcome for the active postseason game. for example, a participant could have a \"<mark>josh hamilton</mark> double\" tile on their bingo card which would be automatically marked in the event <mark>josh hamilton</mark> hits a double during a postseason game. any eligible participant who receives a bingo card that becomes marked with five (5) tiles in a vertical, horizontal or diagonal row (each, a \"potential winning bingo card\" ) may be a potential prize winner, subject to verification of eligibility and compliance with the terms of these official rules. (see the prize claim section below for more information .) for purposes of this promotion, mlb game outcomes will not be updated to reflect any official mlb statistics changes or corrections that may occur after the completion of any postseason game. once each postseason game is final following completion of the final out of that game, it will be final for purposes of this promotion. in the event any postseason game is cancelled, postponed or suspended, all bingo cards will be void for that game and sponsor reserves the right to award the applicable prizes by way of random drawing from among all eligible participants as of the time of such cancellation, postponement or suspension. prize claims: in the event you receive a message within mlb.com gameday notifying you that you have a potential winning bingo card, you must claim your potential winning bingo card by following the onscreen instructions provided by no later than ten (10) minutes following the end of the applicable postseason game to be eligible for the drawing (defined below). failure to claim your potential winning bingo card within ten (10) minutes following the end of the applicable postseason game will render the potential winning bingo card void and result in prize forfeiture. all potential winning bingo cards are subject to verification by sponsor whose decisions are final and binding. an entrant is not a winner of any prize, even if the promotion should so indicate, unless and until entrant's eligibility, the potential winning bingo card and entrant's compliance with these official rules have been verified by sponsor and entrant has been notified that such verification is complete. sponsor will not accept screen shots or other evidence of winning in lieu of its validation process. random drawings: approximately thirty (30) minutes following the final out of each postseason game, five (5) potential winners will be selected by random drawing from among all eligible participants who claim valid potential winning bingo cards for that postseason game in accordance with these official rules (the \"drawing\" ). subject to verification of eligibility and compliance with the terms of these official rules, the potential winners will be declared official winners of the sweepstakes (each, a \"winner\" and collectively, the \"winners\" ). odds of winning a prize will depend on the total number of bingo cards issued and the total number of valid potential winning bingo cards claimed for each applicable postseason game. limit one (1) prize per person, per family and per household. prizes: a maximum of two hundred fifteen (215) prizes (each, a \"prize\" and collectively, the \"prizes\" ) will be awarded (i.e. five (5) prizes per each postseason game with a maximum of forty-three (43) postseason games), as follows: for up to twenty-two (22) postseason games during the 2012 wild card games and the 2012 division series, each winner will receive one (1) postseason.tv subscription for the remainder of the 2012 mlb postseason. approximate retail value (\"arv\" ) of each such prize: $4.99. for up to twenty-one (21) postseason games during the 2012 league championship series and the 2012 mlb world series championship, each winner will receive one (1) mlb.tv offseason package subscription. arv of each such prize: $24.99. total arv of all prizes: $3172.85. for the avoidance of doubt, no prizes will be awarded in connection with any 2012 mlb postseason game that is not played because it is not necessary. prize conditions: all prize details to be determined in the sole discretion of sponsor. each winner is fully responsible for any and all applicable federal, state and local taxes (including income and withholding taxes). postseason.tv subscriptions are subject to blackout and other restrictions - see www.postseason.tv for complete details. all costs and expenses associated with the prize acceptance and use not specified herein as being provided including, but not limited to, any and all expenses incurred by accepting the prize are the sole responsibility of the winners. the prizes are non-transferable and non-assignable, with no cash redemptions except at sponsor's sole and absolute discretion. sponsor reserves the right to substitute any prize (or any portion thereof) with one of comparable or greater value at its sole and absolute discretion. notification: each potential winner will be notified at the e-mail address, postal address and/or telephone number (in the sole discretion of sponsor) provided at the time of entry (the \"prize notification\" ). in the event that any potential winner does not respond to any such prize notification within three (3) days of the date of issuance or declines the prize for any reason, a disqualification will result, the prize will be forfeited and, at sponsor's sole discretion and time permitting, an alternate potential winner may be randomly selected from among all remaining eligible entries. each potential winner may be required to submit his/her valid social security number and/or other identification to sponsor and may be required to execute, have notarized and return an affidavit of eligibility and release of liability and, unless prohibited by law, publicity, within five (5) days of date of issuance. failure to submit any identification required by sponsor or to return the required documents within the specified time period, noncompliance with these official rules or the return of the prize (or any portion thereof) or prize notification as undeliverable may result in disqualification and prize forfeiture and, at sponsor's sole discretion and time permitting, may cause an alternate potential winner to be randomly selected from among all remaining eligible entries. waiver of liability/publicity release: by participating in the promotion and submitting an entry, each entrant agrees to (i) be bound by these official rules, including all entry requirements, and (ii) waive any and all claims against sponsor, the other mlb entities, facebook, apple, inc. and each of their respective parents, affiliated companies, subsidiaries, officers, directors, employees, agents, licensees, distributors, dealers, retailers, printers, representatives and advertising and promotion agencies, and any and all other companies associated with the promotion, and all of their respective officers, directors, employees, agents and representatives (collectively, \"released parties\" ) for any injury, damage or loss that may occur, directly or indirectly, in whole or in part, from the participation in the promotion or from the receipt or use of any prize (or any portion thereof) or any travel or activity related to the receipt or use of any prize (or any portion thereof). by entering this promotion, each entrant gives his/her express permission to be contacted by sponsor by telephone, e-mail and/or postal mail for promotion purposes. each winner, by acceptance of the prize, grants to sponsor and each of its designees the right to publicize such winner's name, address (city and state of residence), photograph, voice, statements and/or other likeness and prize information for advertising, promotional, trade and/or any other purpose in any media or format now known or hereafter devised, throughout the world, in perpetuity, without limitation and without further compensation, consideration, permission or notification, unless prohibited by law. general conditions: all decisions of sponsor, including the determination of winners, are final and binding on all matters relating to this promotion. released parties are not responsible for stolen, late, incomplete, illegible, inaccurate, misdirected, lost, misrouted, scrambled, damaged, delayed, undelivered, mutilated or garbled entries, transmissions, e-mail or mail; or for lost, interrupted or unavailable network, cable, satellite, server, internet service provider (isp), wireless network, website, or other connections including those through and/or by any website, availability or accessibility or miscommunications or failed computer, satellite, telephone, cable or wireless transmissions, lines, or technical failure or jumbled, scrambled, delayed, or misdirected transmissions or computer hardware or software malfunctions, failures or difficulties; any error, omission, interruption, defect or delay in transmission, processing, or communication; non-delivery; misdirected, blocked, or delayed e-mail notifications; printing, typographical or other errors appearing within these official rules, in any promotion-related advertisements or other materials; or any other errors, problems or difficulties of any kind whether human, mechanical, electronic, network, computer, telephone, mail, typographical, printing or otherwise relating to or in connection with the promotion, including, without limitation, errors or difficulties which may occur in connection with the administration of the promotion, the processing of entries, the announcement of the prize or in any promotion-related materials, or the cancellation or postponement of any major league baseball game, event or exhibition. released parties are also not responsible for any incorrect or inaccurate information, whether caused by website users, tampering, hacking, or by any equipment or programming associated with or utilized in the promotion. released parties are not responsible for injury or damage to participants' or to any other person's computer related to or resulting from participating in this promotion or downloading materials from or use of the website. persons who tamper with or abuse any aspect of the promotion or website or attempt to undermine the legitimate operation of the promotion by cheating, deception or other unfair playing practices, or intend to annoy, abuse, threaten or harass any other entrant or any representative of sponsor or who are in violation of these official rules, as solely determined by sponsor, will be disqualified and all associated entries will be void. any attempt to deliberately damage the content or operation of this promotion is unlawful and subject to legal action by sponsor and/or its agents. sponsor shall have the sole right to disqualify any entrant for violation of these official rules or any applicable laws relating to the promotion, and to resolve all disputes in its sole discretion. released parties (i) make no warranty, guaranty or representation of any kind concerning any prize (or any portion thereof), and (ii) disclaim any implied warranty. sponsor's failure to enforce any term of these official rules shall not constitute a waiver of that provision. sponsor reserves the right, in its sole discretion, to cancel or suspend the promotion (or any portion thereof) should virus, bugs, unauthorized human intervention, or other causes corrupt administration, security, fairness, integrity or proper operation of the promotion (or any portion thereof). in the event of such cancellation, sponsor may elect to identify the winners and award the prizes by way of random drawing from among all non-suspect, eligible entries received up to the time of such cancellation. sponsor also reserves the right, in its sole discretion, to modify these official rules for clarification purposes without materially affecting the terms and conditions of the promotion. caution: any attempt by any individual, whether or not an entrant, to deliberately damage any website associated with this promotion or undermine the content or legitimate operation of this promotion may be a violation of criminal and civil laws and should such an attempt be made, sponsor will disqualify any such entrant, and sponsor and/or its agents reserve the right to seek damages (including attorneys' fees) and other remedies from any person or persons responsible for the attempt to the fullest extent permitted by law. in the event of dispute as to the identity or eligibility of any potential winner based on an e-mail address, the winning entry will be declared made by the \"authorized account holder\" of the e-mail address submitted at the time of entry provided he/she is eligible according to these official rules. the \"authorized account holder\" is defined as the natural person to whom the applicable internet service provider or other organization (such as a business or educational institution) has assigned the e-mail address for the domain associated with the submitted e-mail address. as a condition of participating in this promotion, each entrant agrees that (a) any and all disputes, claims, controversies or causes of action arising out of or relating to this promotion, or any prizes awarded (each, a \"claim\" ), shall be (1) arbitrated on an individual basis only, and shall not be consolidated or joined with or in any arbitration or other proceeding involving a claim of any other party, and (2) settled by binding arbitration in new york county, new york before a single arbitrator appointed by the american arbitration association in accordance with its then governing rules and procedures, and judgment on the award rendered by the arbitrator may be entered by any court having jurisdiction thereof; and (b) under no circumstance will entrant be permitted to obtain awards for, and entrant hereby waives all rights to claim, punitive, incidental, consequential or any other damages, other than for actual out-of-pocket expenses. these official rules shall be governed by and construed and interpreted in accordance with the laws of the state of new york, u.s.a, applicable to contracts entered into and performed exclusively in that state. apple, inc. is not a sponsor of, or responsible for conducting, the promotion. all entry data provided in connection with this promotion is provided to sponsor and not to facebook. this promotion is in no way sponsored, endorsed or administered by, or associated with, facebook. winners' list: for a list of winners (available after december 1, 2012) mail a request and a self-addressed stamped envelope to be received by january 15, 2012 to: mlb.com bingo winner's list c/o mlb advanced media, l.p., 75 ninth ave., new york, new york 10011, attn: sweepstakes department. sponsor: the sponsor of this promotion is mlb advanced media, l.p., 75 ninth ave., new york, new york 10011."}, {"articleID": "2015040910_00031064_W", "names": {"Paul Rowe": ["Q21931991", "Q7153343"]}, "date": "2015-04-09", "url": "http://irishexaminer.com/breakingnews/ireland/school-admissions-bill-does-nothing-to-offer-alternatives-to-church-schools-670939.html", "content": "School Admissions Bill \"does nothing to offer alternatives to church schools' Minister for Education Jan O'Sullivan is being urged to address the issue of school patronage. Admission to Schools Bill states that there will be no religious discrimination, but schools can ask for a baptismal certificate on enrolment. Still large areas of country with no alternatives to church schools, yet admissions bill does nothing to address this April 8, 2015 Educate Together - which runs non-denominational schools - has welcomed proposals to limit the number of places each institution can reserve for the children of past pupils. However the organisation says they will do little to address the growing demand from parents for places at non-denominational schools. CEO of Educate Together <mark>Paul Rowe</mark> said that new schools are needed.\" The only way that we can address this growing need for a system which provides a balanced choice for children in the country is to dramatically accelerate the delivery of new Educate Together schools or schools which offer the same guarantee of equality of esteem and access as Educate Together throughout the whole country, \"he said. School Admissions Bill\" does nothing to offer alternatives to church schools' Irish Examiner live news app for smartphones lets you quickly access breaking news, sport, business, entertainment and weather. Car ban looms for St Patrick's Street as Cork's traffic set for overhaul English prankster climbs into Irishman's car, gets more than he bargained for VIDEO: Niall Horan had a bit of a fall while caddying for Rory McIlroy Refusal to pay will lead to legal action and direct deductions as first water bills arrive Teachers' Conference: Croke Park deal is the \"greatest waste of time ever '"}]