[{"date": "2015-04-13", "url": "http://www.lithgowmercury.com.au/story/3007456/reggies-win-was-pleasing/?src=rss", "content": "h1 itemprop = \"name\" > Reggies' win was pleasing After suffering a number of set backs in the lead up to the 2015 first division rugby league competition, the Lithgow Workmens Club \"Reggies' got off to a winning start to the competition. Not to be outdone, the Oz League side also produced a win marking what was a very successful start to the season. SPEEDSTER: Wolves' Jenna Heath makes a great break. GOOD BREAK: Under 18's Cody Godden puts the big step on as he waits for support. TOP GAME: First division captain coach Kyle Willmott capped off a good game with two tries. ONE of the most pleasing wins of the afternoon for Lithgow Workmens Club was the win by the\" Reggies' (first division). Over the past months, the Wolves have been struggling for numbers after losing several players to the New Era competition. But in the last week, a couple of players came to training to make up what was a pretty good side. Spearheaded by inspirational captain coach Kyle Willmott, the Wolves posted a 22-16 win over Cowra and in doing so played some pretty good football. They worked for each other in defence, ran hard and scored some good tries. Trailing 10-6 at the break, the Wolves finished all over Cowra. They had some good performers in a team where all played well. Outstanding were Willmott who scored two tries, Steve Slaven, <mark>Josh Jones</mark>, <mark>Harry</mark> Bender and <mark>Harry Knight</mark>. \"We have had little time to work on any combinations, but we will only get better in the coming weeks,\" Willmott said. \"I was really pleased with their intensity and never say die attitude .\" It was a good win. \"The other try scorers were Joel Walsh and Keegan Craig. Oz League The Wolves girls got the day off on the right note with an impressive 16-4 win over the strong Cowra side. Cowra struck first with a try to Shailee Dolbel, but from then on it was all the Wolves. They used their speed to good effect with a number of girls having genuine pace. Players such as Jenna Heath, Chrissy West, Tahlia Nugent and Hannah Healey all have athletics' backgrounds and are really quick. Along with those, the other girls are no slouches either and coach Cory Stockton has a side that will really test the opposition with their speed. Best for the Wolves were Maddy Bender, Mallory Goodman, Hannah Healey and Chrissy West in a side where all played well. Try scorers were Gemma King, Chrissy West and Maddy Bender with West also kicking two goals. Under 18 The Wolves went down 34-14 to a very good Cowra side. The young Wolves stuck with them for a good period of the first half, but as the game wore on, Cowra pulled away .\" The boys tried hard, but they missed too many one-on-one tackles, \"coach Ross Harrington said .\" It is something that we are going to have to work on. \"Nathan McAndrew had a good game finishing with two tries while the other try scorer was Nic Miller. Gallery: Portland Central | Scots School | Easter Hat parades 2015", "articleID": "2015041318_00050395_W", "names": {"Harry Knight": ["Q18619353", "Q42319512"], "Josh Jones": ["Q26269516", "Q29862025", "Q30122055", "Q6289030"]}}, {"date": "2015-04-14", "url": "http://news.asiaone.com/news/world/clinton-taking-different-tack-new-campaign", "content": "Former secretary of state Hillary Clinton may have been just confirming the worst-kept secret in American politics by announcing her White House run, but the brief video she used to launch her campaign still made a splash when it was unveiled on Sunday. The clip, just over two minutes long, was notable for several reasons - its large and diverse cast, its sole emphasis on middle-class Americans and just how little it focused on the candidate. None of the 38 other people in the video - which included single mothers, same-sex couples, Asian Americans and Hispanics - talked about Mrs Clinton. They spoke only about themselves, offering no praise for the former first lady. In fact, the name \"Hillary Clinton\" is not uttered a single time. Mrs Clinton makes an appearance only towards the end to announce that she is running for president again and wants to fight for the American middle class. \"Everyday Americans need a champion and I want to be that champion, so you can do more than just get by - you can get ahead and stay ahead,\" she said. And that was the sum total of policy mentioned in the clip. There was no talk of her track record in government as secretary of state or senator. If anything, she appeared to be secondary to the video. It was a stark contrast not just to the launch videos of the two Republicans who have begun their campaigns, but also to the one she used to announce her first shot at the White House in 2007. Then, her video had consisted entirely of her seated in her Washington, DC, home laying out her priorities and vision. In style and substance, it is clear Mrs Clinton is trying to avoid the mistakes of the 2007 campaign that appeared to position her as an inevitable candidate and failed to latch onto the mood for change in the country. Sunday's video, which quickly racked up 1.5 million views, also took pains to make clear that Mrs Clinton does not have next year's election sewn up, despite her domination of current polls. \"I'm hitting the road to earn your vote, because it's your time, and I'm hoping you'll join me on this journey,\" she said. The video marks a further step in her campaign team's attempt to dispel her reputation of being aloof and out of touch. In the lead-up to the announcement, the team had also sought to try to bring out her softer side, emphasising her experiences as a mother and new grandmother. Just days earlier, she released an epilogue to her 2014 memoir that was dominated by how she felt when her daughter Chelsea gave birth to Charlotte Clinton Mezvinsky last September. She wrote: \"When Chelsea was born, I was full of nerves...As a new grandmother, however, there is nothing but joy. It's probably the world's best job .\" You get all the happiness of doting on a tiny child as she begins exploring the world but without the responsibilities or anxieties of being a parent. \"While analysts agree that pushing her softer side is a worthwhile strategy for a figure who has struggled to be relatable, it is not yet clear if the rebranding will work. Professor <mark>David Coates</mark>, from the department of politics and international affairs at Wake Forest University, said:\" Hillary looks unbeatable in her pursuit of the Democratic nomination, but all the Democrats I know are worried - they are not enthusiastic. \"They think she is too centrist, and that she comes with too much baggage. They worry the baggage might let a Republican in when we move from the primaries to the election, and that even if she wins, she will prove too moderate at home and too hawkish abroad .\" The entry of the highest-profile candidate has raised the temperature for a presidential race that is just beginning. A handful of Mrs Clinton's possible opponents wasted no time in attacking the Democratic front runner. Texas Senator Ted Cruz, who announced his candidacy three weeks ago, released a video saying Mrs Clinton \"represents the failed policies of the past\". Former Florida governor Jeb Bush, a Republican and the biggest name yet to officially declare his bid, similarly attacked her foreign policy track record in a new video. \"We must do better than the Obama-Clinton foreign policy that has damaged relationships with our allies and emboldened our enemies,\" he said. Other candidates in the race Other candidates who have officially declared, all Republican: Texas Senator Ted Cruz, 44 According to an average of polls done by RealClear - Politics, he trails Mrs Clinton by 10 percentage points. Among Republicans, he stands in third place, with just 10.5 per cent support. Kentucky Senator Rand Paul, 52 Polls show Dr Paul trailing Mrs Clinton by about 7 percentage points. He is just behind Mr Cruz in the Republican Party, with support of 9.8 per cent Florida Senator Marco Rubio, 43 Announced his candidacy yesterday. He is 7.8 percentage points behind Mrs Clinton. This article was first published on April 14, 2015. Caught on camera: Airport employees steal from tourists' luggage \"Slicing and dicing\" : How some US firms could win big in 2016 elections Veterans to attend Taiwan military parade marking defeat of Japan", "articleID": "2015041409_00057982_W", "names": {"David Coates": ["Q25675757", "Q5232435", "Q55996234"]}}, {"date": "2015-04-16", "url": "http://www.limerickleader.ie/limerick-students-await-day-of-destiny-1-6691795", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Horrific powerlift in Limerick becomes viral sensation <mark>Paul O'Connell</mark> selfie pic was \"perfect timing' Limerick friends appeal for missing student Karen Buckley Widow, 72 sues over exploding lemonade at Limerick store Judge says child is real loser after parents' split Call to name Limerick street in honour of Bobby Sands Developer's\" delight' as € 100m Limerick shopping centre gets green light Collins backs developer behind € 100m Limerick shopping centre Limerick councillor says road will alleviate Corbally traffic STUDENTS from across Limerick will descend on Croke Park next week to take part in the national enterprise final. Business-minded youngsters from Scoil na Tríonóide in Doon and Desmond College in Newcastle West will travel to the capital after being named the most enterprising students in Co Limerick. They will join 300 other students from around the countries at the April 22 showpiece. Students from Desmond College impressed judges of the Limerick Student Enterprise Awards with their project \"Guide a Key'. This is a device which aids people with limited dexterity inserting their key into a lock. It is affixed onto the area around the keyhole, and the user then simply slides their key into the top part of the keyhole. Another Desmond College student, Emily Duffy, 15, will travel to Dublin after winning the first prize in the intermediate category for her product, the imaginatively named\" Duffily Wrap'. Made with metallic bubble wrap, and aluminium, the sleeping-bag inspired product is designed to help the homeless. Emily started working on the idea when she took part in a fundraiser for the Novas Initiatives charity last year. And three best friends from Scoil na Tríonóide will complete Limerick's delegation in Dublin. Jayne Ryan, Lisa Meehan and Aoife Ryan, all 13, approached a number of companies in Limerick including Subway, Diesel, New Look and Wacky Shoes to offer discounts through a special card for second level students. The Enterprise Awards are co-ordinated in Limerick by the Local Enterprise Office. It is the largest programme of its kind for young entrepreneurs in Ireland, with 17,000 students entering from 370 secondary schools. Speaking ahead of the students' trip to Croke Park, the Head of Enterprise for Limerick, Eamon Ryan wished them all well, saying: \"Since last September, budding entrepreneurs from schools all over the county have been researching and running their own enterprises, learning about business in the real-world. The teachers, students and schools participating in the Student Enterprise Awards deserve huge recognition for what they have achieved and the Local Enterprise Office is proud to support them all the way to\" National Final Day' in Croke Park on April 22nd. \"The teams from Limerick will have to impress a tough panel of judges at the final including former enterprise board staff from around the country, management consultants, software developers and entrepreneurs. Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Create your own advertisement or send someone a special message. Limerick Leader provides news, events and sport features from the Limerick area. For the best up to date information relating to Limerick and the surrounding areas visit us at Limerick Leader regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Digital Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2015041606_00016124_W", "names": {"Paul O'Connell": ["Q2038034", "Q7152770"]}}, {"date": "2015-04-16", "url": "http://www.pymnts.com/news/2015/bank-of-america-sees-2m-mobile-banking-customer-growth/", "content": "Overstocked Retail Inventory Raises Alarms For Commerce Department Mobile Commerce> Bank Of America Sees 2M Mobile Banking Customer Growth Showing its own strength in a growing trend among banks, In fact, the number of mobile banking customers jumped 13 percent from last year's Q1 to just under 17 million users. Mobile now accounts for 13 percent of all consumer deposit transactions, which is a 3 percent increase on a year-to-year basis. Tailoring its growth strategy toward the mobile customer aligns with one goal of BoA. \"We have added new financial centers in areas of opportunity and we continue to invest in products and innovation, as well as efficiency,\" said CEO Brian Moynihan during the company's call with analysts April 15. \"A simple example - in our Consumer Mobile Banking space, we now have 70 million mobile banking customers up over 2 million from last year .\" But like other banks are seeing, with more customers going online for their banking needs, Bank of America is evaluating its physical banking needs as more consumers go digital. \"We continue to reduce our financial centers in the associated cost driven by consumer behavior patterns shifting to more digital,\" CFO <mark>Bruce Thompson</mark> said during the same call. In Bank of America's earning press release, the company shared more about how the growth in mobile banking and self-service customer touch points is changing the banking ecosystem. \"The company continued to refine its retail footprint and has closed or divested 287 locations and added 27 locations since the first quarter of 2014, resulting in a total of 4,835 financial centers at the end of the first quarter of 2015,\" according to the release. On the card side, card issuance also jumped 13 percent. BoA issued 1.2 million new credit cards in Q1, which is up by 200,000 from Q1 in 2014. Of its credit cards issued in the quarter, roughly 34 percent were from new customers and 66 percent of those were from existing customers. In terms of earnings figures, BoA reported a $1.3 billion revenue decline, year over year, but saw a profit of $3.4 billion for its Q1, which was a stark increase from last year's Q1 loss of $276 million. BBVA Acquisition Will Enhance Digital Banking Experience Intel, IoT And The Case For Commerce Reserve - The M-Payments Dining App - Breezes Into The Windy City How UK Consumers Use Mobile To Shop", "articleID": "2015041610_00046002_W", "names": {"Bruce Thompson": ["Q16886106", "Q4978357"]}}, {"date": "2015-04-16", "url": "http://nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=11433853", "content": "Grant Bradley Aviation, tourism and energy writer for the Business Herald Service to centre in Texas will be local airline's longest flights yet The Houston flights will provide links to the big southern and eastern US markets. Photo / Getty Images Air New Zealand is launching a fresh near half-billion dollar push into the United States with services to Houston from Auckland this year. The airline is on a rapid growth path this year, expanding by around 12 per cent over the next six months. Chief executive Christopher Luxon said the new capital - planes - invested in new routes typically amounted to about $450 million for services built up to daily using a wide-body plane and annual operating costs added up to $160 million. The Houston service would run up to five times a week and start about the same time as Air New Zealand continues to bed down its resumption of flying to Singapore and starts flying three times a week to Buenos Aires. And it hopes to start a partnership with Air China for daily services to Beijing. \"We've got a bit on, we've thrown the company into growth mode. Internally within Air New Zealand it's quite a change as we learn how to manage profitable growth .\" Although fuel prices had risen slightly from recent lows, they did not colour the airline's thinking. \"If we let that dictate our decisions we'd get into trouble very quickly. We're a demand-driven organisation and if we think there's an opportunity as a company and a country to exploit it we do,\" he said. Salt Funds Management managing director <mark>Paul Harrison</mark> said the Houston move made sense for Air New Zealand with strong connections through the United States with alliance partner United Airlines. But while it sealed up one route it could alert another US carrier to the opportunity of flying here. Since 2012 Air New Zealand has had direct flying to the US mainland to itself which <mark>Harrison</mark> said was important for yields and profitability. Air New Zealand shares closed down 0.2 per cent at $2.815 yesterday. Tourism leaders and the travel industry have welcomed the flights, set to start in late December, as giving more momentum for rapidly growing traffic between NZ and the US. Prime Minister and Tourism Minister John Key said the new service would provide a more direct route for the millions of US citizens living in the south and east of the country. The US is already New Zealand's third-largest visitor market behind Australia and China, with 226,608 arrivals in the year to February - a 10 per cent rise on the previous year. The Auckland-Houston flights will be the longest on Air NZ's network. It will take about 13 hours 50 minutes to make the 11,990 km flight and an extra 40 minutes to fly back to New Zealand into prevailing head winds, 30 minutes more than the airline's current longest flight from Auckland to Vancouver - about 11,340 km. The airline will use refurbished Boeing 777-200s. New route • Air New Zealand will fly between Auckland and Houston up to five times a week. • It provides connections to the big southern and eastern US markets as well as the Caribbean and central America.", "articleID": "2015041617_00023265_W", "names": {"Paul Harrison": ["Q1790955", "Q3427121", "Q3802904", "Q42889436", "Q45882852", "Q56439843", "Q7151154", "Q7151155", "Q7151156", "Q7151157"]}}, {"date": "2015-04-16", "url": "http://www.komando.com/happening-now/304421/we-have-to-end-swatting-before-somebody-gets-killed", "content": "JavaScript is currently disabled in your browser. In order to watch videos and to navigate this website, JavaScript needs to be enabled. Here are the I've told you about swatting before. It's an idiotic pranking trend popular with online gamers that involves making fake emergency calls to law enforcement in order to send SWAT teams barreling down on the intended target of the prank. One lawmaker in New Jersey is trying to stop it and became a swatting victim himself because of his efforts. Swatting is dumb, dangerous and could get someone killed. That's why New Jersey Assemblyman <mark>Paul Moriarty</mark> is trying to end it for good by promoting legislation that would increase the penalties for people who make prank calls to the police like this. <mark>Moriarty</mark> found out firsthand how dangerous swatting is recently when an anonymous caller reported a shooting at his home. \"I look out my front door. There's six cop cars. They have the street closed off. They have helmets, flak jackets and rifles,\" <mark>Moriarty</mark> said. \"I walk out and walk towards them. They motion me to keep walking towards them. The minute I walked out the door, I was still on the phone with the dispatch person, I said' I think I've just been swatted .' It just then occurred to me what happened .\" ", "articleID": "2015041621_00038343_W", "names": {"Paul Moriarty": ["Q16107434", "Q3371870", "Q7152604"]}}, {"date": "2015-04-16", "url": "http://tabletmag.com/scroll/190332/in-support-of-jewish-lgbtq-youth", "content": "My Teacher's Son: A Memoir of Heresy Is Marked By a Father's Unnerving Piety The Scroll In Support of Jewish LGBTQ Youth (Photo illustration Tablet Magazine; original photos Shutterstock) Leading Orthodox Rabbis will meet with mental health professionals to publicly discuss the controversial issue of conversion therapy for LGBT Jews at a mental health conference on Sunday. Earlier this month, the Obama Administration said it supports efforts to ban the use of conversion therapy on gay and transgender minors. \"The end goal of this conference is that our leaders and experts will be well informed and able to provide proper care to LGBT Jews,\" Mordechai Levovitz, a conference co-chair, told me. A gay, Orthodox man, Levovitz is also the founder and director of JQY, a non-profit organization dedicated to providing crisis and support resources for at-risk LGBT youth in the Orthodox & Hasidic community. Levovitz explained that the conference is a way for the orthodox rabbinical community and the therapeutic community to work together. \"Therapists can't provide care if they don't understand the orthodox community and rabbis can't provide proper guidance if they don't understand the psychological issues at hand,\" he said. \"This conference isn't about advocacy but rather it's an opportunity for learning and dialogue .\" \"The question that this conference is asking isn't whether you can be both gay and Orthodox, because that is a very judgmental question. The question is: How can we provide responsible support for LGBT people in the orthodox community?\" In an interview, Levovitz explained that this question challenges the Jewish leaders in power as opposed to victims in the community. According to Levovitz, JQY influenced the Rabbinical Council of America's 2012 decision to rescind their recommendation of JONAH - the largest Jewish conversion therapy organization. Sean Herzfeld, a 15-year-old JQY member who recently came out to his Orthodox high school, was quoted in a press release as saying that \"It's not enough to simply tell LGBT teens in religious communities that it gets better later. We have to work within the community to make it better now .\" The Keynote speakers at the conference will be RCA Honorary President Rabbi Shmuel Goldin and RCA Executive Vice President Rabbi Mark Dratch. They will joined by mental health professionals including Dr. Jack Drescher and Dr. Mark Blechner, Editor in Chief Emeritus of the journal Contemporary Psychoanalysis, and Dr Alison Feit, Executive Director of The Jewish Center for Trauma and Recovery. JQY will hold the conference at the Kraft Center in New York together with the William Alanson White Institute of Psychiatry, Psychoanalysis and Psychology. Gay and Lesbian youth from families that reject their sexual or gender preferences are more than 8 times as likely to have attempted suicide. Related: Orthodox Parents of LGBT Children Navigate Their Own Coming Out Process Daily rate: $2 Monthly rate: $18 Yearly rate: $180 WAIT, WHY DO I HAVE TO PAY TO COMMENT? Tablet is committed to bringing you the best, smartest, most enlightening and entertaining reporting and writing on Jewish life, all free of charge. We take pride in our community of readers, and are thrilled that you choose to engage with us in a way that is both thoughtful and thought-provoking. But the Internet, for all of its wonders, poses challenges to civilized and constructive discussion, allowing vocal-and, often, anonymous-minorities to drag it down with invective (and worse). Starting today, then, we are asking people who'd like to post comments on the site to pay a nominal fee-less a paywall than a gesture of your own commitment to the cause of great conversation. All proceeds go to helping us bring you the ambitious journalism that brought you here in the first place. I NEED TO BE HEARD! BUT I DONT WANT TO PAY. Readers can still interact with us free of charge via Facebook, Twitter, and our other social media channels, or write to us at letters @ tabletmag.com. Each week, we'll select the best letters and publish them in a new letters to the editor feature on the Scroll. My Teacher's Son: A Memoir of Heresy Is Marked By a Father's Unnerving Piety By Shaul Magid - In and out of the fold of ultra-Orthodoxy, Shulem Deen and his father Dovid both pursued honest religious feeling \"From My Memories...I Will Never Forget It' By <mark>Daniel Goldberg</mark> - My grandmother's account of her liberation from Bergen-Belsen By Vox Tablet - Historian Jonathan Sarna discusses the Great Emancipator's ties to a chiropodist, military men, and other Jews How Often Should Married Jewish Couples Have Sex? By Adam Kirsch - And other matters of conjugal bliss in this week's Talmud study, including a woman's right to sexual fulfillment Inside Obama's Meeting With Jewish Leaders By <mark>Lee Smith</mark> - What he said, what they said, and what America is now saying to the world about exterminationist anti-Semitism Anne Roiphe - Israel is not a normal state. Here's why. Why We Keep Reading About the Shoah By David Mikics - A thorough new history of the Nazi concentration camps challenges us to face again our fears and weakness Enough With the Holocaust Books for Children! By Marjorie Ingall - Yes, we need to teach kids about our history. But our history constitutes a lot more than one tragic event. Larry Sultan's Porn Stars, Mezuzahs, Migrant Workers, and Jewish Mothers Stories for Passover about slavery, freedom, family...and lice In a new biography, Annie Cohen-Solal looks at the immigrant child who changed modern art", "articleID": "2015041622_00003610_W", "names": {"Daniel Goldberg": ["Q1160874", "Q5217295", "Q5762739"], "Lee Smith": ["Q1078252", "Q13563113", "Q1811998", "Q3228933", "Q3829387", "Q6515097"]}}, {"date": "2015-04-19", "url": "http://www.wkyt.com/wymt/home/headlines/Annual-soap-box-derby-held-in-Hazard-on-Saturday-300561171.html", "content": "HAZARD, Ky. (WYMT) - Memorial drive in Hazard was closed this afternoon, but cars still zoomed down the steep hill. People gathered for the 16th annual Bud Combs Soap Box Derby in downtown Hazard. There were 27 drivers, ages 8-17, racing for a chance to qualify for the international soap box derby in Akron, Ohio. The chance to compete at such a high level is all the fuel these racers need. <mark>Sam Collins</mark> the event coordinator says the kids really get into the races, \"It gets really competitive and the kids really wannawin. There's some big trophies up there, its all in good fun .\" Special Olympic Spring games held in Johnson County Today's Calendar Saturday April 18 No Community Events Scheduled for Today Sunday April 19 WYMT CONTACT INFO 199 Black Gold Blvd.. Hazard, KY 41701 606-436-5757 - switchboard 606-439-9968 - newsroom × Online Public Information File Viewers with disabilities can get assistance accessing this station's FCC Public Inspection File by contacting the station with the information listed below. Questions or concerns relating to the accessibility of the FCC's online public file system should be directed to the FCC at 888-225-5322, 888-835-5322 (TTY), or fccinfo @ fcc.gov. Public File Liaison: 859-299-0411 Station Contact Info: WYMT CONTACT INFO 199 Black Gold Blvd. .", "articleID": "2015041904_00022970_W", "names": {"Sam Collins": ["Q20853588", "Q24663875", "Q30603377", "Q47005452", "Q7407331"]}}]