[{"articleID": "2015092119_00190737_W", "names": {"John Tucker": ["Q28946890", "Q29344907", "Q42292588", "Q6261352", "Q6261353", "Q6379336"]}, "date": "2015-09-21", "url": "http://www.lutontoday.co.uk/news/community/community-news/tucker-s-tank-has-pride-of-place-in-museum-1-6956188", "content": "<mark>Tucker</mark>'s tank has pride of place in museum Stopsley man <mark>John Tucker</mark> with the tank he made displayed in the Muckleburgh Military Collection 08:00 Sunday 20 September 2015 0 Have your say A meticulously constructed World War Two German Tiger Tank, made by a Stopsley man, has gone on display in the Muckleburgh Military Collection in North Norfolk--alongside a Luton News story about its creator <mark>John Tucker</mark>, 56. The Butterfields yardman said: \"They really did my tank proud. It's displayed in a lovely glass cabinet, set at head height. It was a real labour of love and took me three years to complete but all my time and effort have been worth it in the end.\" Have you got something to share on the story? Were you there? What do you think? - Send your pictures, videos or story and we'll publish the best & times; Continue the story <mark>Tucker</mark>'s tank has pride of place in museum Loading...Add up to 3 photos or 1 videos to the story There's been a problem uploading your files. Please try again. By uploading your file you agree to our Terms and Conditions Upload your files & times; Continue the story Sign in to contribute sign in shape the news in your area...& times; Continue the story <mark>Tucker</mark>'s tank has pride of place in museum A big thank you for contributing...We really appreciate you taking the time to send your content...if it complements our coverage we'll use it in our website or in our newspaper. Close"}, {"articleID": "2016080400_00152249_W", "names": {"Mark Carlson": ["Q6766995", "Q6766998", "Q6766999", "Q6767000", "Q6767002"]}, "date": "2016-08-02", "url": "http://crn.com/news/cloud/300081549/crn-exclusive-paas-powerhouse-pivotal-introduces-first-channel-program-around-cloud-foundry.htm?itc=hp_tax_cloud", "content": "Printer-friendly version Email this CRN article Pages 1 2 3 next' last & raquo; Pivotal, the EMC-VMware spin-off behind Cloud Foundry, is introducing its first formal channel program Tuesday as the open-source Platform-as-a-Service technology expands its base of enterprises looking to implement agile software development. Pivotal already has a thriving ecosystem, but the systems integrators deploying its distribution of the cloud-based development platform have thus far engaged with the company at only an opportunistic, ad hoc level, Nick Cayou, Pivotal's vice president of global alliances, said Tuesday. The Pivotal Ready Partner Program will help partners jointly develop their businesses with Pivotal and more clearly convey their expertise to customers and other members of the open-source community, Cayou told CRN. [Related: Where Will Ford's Investment In Pivotal Drive The Software Company's Channel?] \"As we've crystallized our product strategy, namely around Cloud Foundry, what we've found is in order to go to market effectively we need a really robust ecosystem of systems integrators,\" Cayou told CRN. The program launches with 29 inaugural partners--less than half the total number of integrators that currently deploy the platform to customers. With two tiers--Registered and Advanced--the program has some traditional elements. But the open-source nature of the San Francisco-based company's flagship product also spawns unique relationships with partners. Since Pivotal turned over the platform to the Cloud Foundry Foundation roughly two years ago, almost 70 companies have contributed code to the open-source project, Cayou said. Some of those contributors are traditional technology vendors, including IBM and Hewlett Packard Enterprise; others are primarily implementers that partner with Pivotal. Having partners that are also co-developers shakes up channel dynamics, Cayou said, as does Pivotal's practice of inverting the typical go-to-market order by frequently engaging directly with line-of-business leaders for its largest customers, then pulling partners into those enterprise deals. <mark>Mark Carlson</mark>, CTO of ECS Team, a solution provider based in Denver, told CRN that joining a formal Pivotal program will help ECS represent its Cloud Foundry credentials to an expanding ecosystem and customer base. Pages 1 2 3 next' last & raquo; Printer-friendly version Email this CRN article"}, {"articleID": "2019011513_02803368_W", "names": {"Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}, "date": "2019-01-15", "url": "http://www.thisislocallondon.co.uk/news/17359066.tom-hardys-richmond-home-extension-approved-despite-alleged-planning-breach/", "content": "News <mark>Tom Hardy</mark>'s Richmond home extension approved despite alleged planning breach <mark>Tom Hardy</mark> (Daniel Leal-Olivas/PA) 0 comment Actor <mark>Tom Hardy</mark> can keep high-end cladding he put on an extension to his £ 3.4 m home in Richmond--despite an alleged planning breach. The Peaky Blinders star was given permission to build a two-storey extension at his large Georgian home in 2013. But last year a local tipped off the council, claiming the actor's application only allowed him to use clad tiling - but he had put up white-oiled Siberian larch timber finish instead. <mark>Hardy</mark>'s planning agent was forced to submit a retrospective application to keep the extension as it is - and the proposal was accepted by the council. The decision by Richmond Council last month means <mark>Hardy</mark> won't have to take down the cladding on his five-bed home. Outlining their decision, a planner at London Borough of Richmond Council said the plans would not \"detract from the wider street scene.\" The 41-year-old was given the go-ahead to demolish a single-storey side extension and build a two-storey replacement in 2013. It was alleged he had not stuck to the exact details of his granted application, by using different materials on his home, according to planning documents. The council also discovered a window been moved from the right to the left of the extension, documents said. His alleged mistake apparently went unnoticed for five years, until someone informed the council, who contacted the actor, letters claim. Council workers said in the planning documents that he could either tear down the larch or submit a new application. . <mark>Hardy</mark>'s agent resubmitted the plans in October 2018 asking to keep the wood. A representative for his agents Howard Sharp and Partners LLP said when it was built, <mark>Hardy</mark> was \"very keen to ensure a high quality material\" was used. They said the white oiled Siberian Larch timber was chosen because it \"was seen by the applicants to positively respond to the overall contemporary design of the extension.\" They said the window was position to get a better internal layout and added: \"Our clients were somewhat surprised to be notified over an alleged breach of planning control.\" London Borough of Richmond Council approved Mr <mark>Hardy</mark>'s retrospective application on December 10. 0 comment"}, {"articleID": "2008092407_00011064_W", "names": {"Don Lee": ["Q5292983", "Q5292984", "Q5292986", "Q5292987"], "Wang Qiang": ["Q11262531", "Q45415540", "Q45440183", "Q45468299", "Q45495684", "Q45504554", "Q45546569", "Q4800760", "Q48618592", "Q7967583", "Q7967584", "Q7967588", "Q7967590", "Q9056668", "Q9056685"], "Zheng Wei": ["Q37837655", "Q45375443", "Q45463354", "Q45482119", "Q45494732", "Q45502739", "Q45504950", "Q45508221", "Q45518235", "Q45519350", "Q45532705", "Q45537366", "Q45537542", "Q45560562", "Q45569317", "Q45592009", "Q45620634", "Q45634911", "Q45665610", "Q45677602", "Q45678457", "Q45690091", "Q56057003", "Q59432825", "Q8070743"], "Cao Jun": ["Q11091308", "Q45438571", "Q45584214", "Q45613523", "Q45616479", "Q45638506", "Q45675868"]}, "date": "2008-09-24", "url": "http://latimes.com/news/opinion/la-fi-aig24-2008sep24,0,402301.story?track=rss", "content": "pedestrians walk past the building in shanghai's historic bund district where aig founder c.v. starr first established the insurance company in 1919. pedestrians walk past the building in shanghai's historic bund district where aig founder c.v. starr first established the insurance company in 1919. the company has deep roots in china, where some customers are canceling their policies. by <mark>don lee</mark>, los angeles times staff writer september 24, 2008 shanghai--aig's roots go deep here, all the way back to 1919 when a young and restless californian arrived in a booming semi-colonial city that was teeming with bankers, industrialists and opium merchants. cornelius vander starr had sold auto insurance in san francisco before serving as an infantry sergeant during the great war. but the fort bragg native wasn't commissioned overseas, so when the war ended, he ventured off by himself to asia's commercial hub at age 26. before long, he opened an office on nanking road with two chinese clerks, underwriting ordinary life insurance policies as well as coverage for cargo ships carrying refugees from russia's vladivostok to europe. and so was born the company that would become american international group inc., the biggest insurance firm in the world. since then, aig has had a special place in the hearts of many chinese, who regarded the company as among the best of international brands. but after the u.s. government's $85-billion rescue of the troubled conglomerate last week, its stellar reputation has been tarnished, and at least a few customers are canceling their policies. \"it probably won't have any problems, but i don't know. i just don't feel comfortable leaving it there,\" said <mark>wang qiang</mark>, 54, an administrator for a construction company who rushed to aig's branch in the southern city of guangzhou as soon as he learned about the government's intervention. despite aig's assurances that its customers were protected, <mark>wang</mark> didn't hesitate to cash out his $12,000 whole life policy. like <mark>wang</mark>, most chinese understand little of the turmoil that has engulfed aig and caused it to lose $18 billion over the last three quarters--primarily from its extensive exposure to the tottering u.s. housing and mortgage industries. but its stunning fall has hardly gone unnoticed here, illustrating the global ripple effects of the american financial crisis. aig has 3.7 million customers in china, according to an analyst's estimate, and millions more elsewhere in asia--a legacy of starr's aggressive expansion in the region in the 1920s. about half of aig's global workforce of 116,000 is in asia. the new york-based company manages $115 billion in assets in asia and has tens of billions invested in roads and development projects from the philippines to south korea. aig's operations in mainland china are more limited, mainly life, property and casualty insurance lines, reflecting the nation's tight restrictions on foreign financial service firms. aig spokespersons in china would not comment on how many customers had canceled policies in recent days, although interviews with aig salespeople and policyholders suggest the numbers are small. on tuesday, the company said it had completed the deal under which the u.s. government would lend aig as much as $85 billion for roughly 80% of the company. the insurance giant is expected to sell assets to repay the federal loan. analysts and former china executives of aig believe the corporation will hold on to aig's businesses in china, given the future potential. overall, income from insurance premiums totaled about $100 billion last year, more than double the amount in 2002, according to government figures. only about a fifth of china's 1.3 billion citizens have insurance policies, mostly in urban areas. aig's life insurance company, called aia in china, generated about $115 million in premium income last year, up 19.5% from 2006, according to a report by pricewaterhousecoopers. aig's property & casualty line in china has grown by an average of 25% annually in the last 15 years, said david peng, a former board director of aig's property and casualty company in china. \"they may sell the most valuable assets to get cash, but that's not good for aig in the long run,\" said peng, a 13-year veteran who last month resigned to build a brokerage in beijing. he described aig's international operations, including those in china, as the \"most beautiful\" of all the corporation's holdings. \"aig can be back to where it all started,\" he said. \"they're good at international markets.\" although aig is tiny in china compared with domestic players, it ranks no. 1 in almost all categories of insurance products among foreign firms in china. that's in no small part because of its long connections to the country. stories abound of starr's affection for china and his chinese employees. in 1945, shortly after v-j day, starr chartered a plane for shanghai, bringing with him a suitcase full of dollars to go back into business, according to an official biography of starr. when the communists came to power in 1949, starr closed aig's operations in china, moving the base to new york. in 1967, a year before his death, starr passed the baton to his protege, maurice \"hank\" greenberg. greenberg made frequent trips to china, endearing himself to government officials by helping fund a children's hospital in shanghai. in another grand gesture, he paid a paris antiques dealer $5 million for 10 copper windows that had been removed from beijing's summer palace and gave them to china as a gift. in 1992, aig became the first foreign insurer allowed to do business in contemporary china. \"no other insurance company can compare the kinship aig has with china,\" said <mark>zheng wei</mark>, vice chairman of the department of risk management and insurance at peking university. more recently, he said, \"customers believed that even if aig's shanghai branch or guangzhou branch had problems, it still had a strong headquarters in the u.s. to back it up. but right now, the financial situation of its headquarters has become aig china's biggest challenge.\" <mark>cao jun</mark> in the times' shanghai bureau contributed to this report. opinion l.a. the best in southern california opinion journalism tue, september 23, 2008 | 3:25:43 pm pdt the republican party certainly isn't making it easy for john mccain and sarah...technology the business and culture of our digital lives, from the l.a. times sd: the new cd? sun, september 21, 2008 | 10:45:00 pm pdt"}, {"articleID": "2014112313_00026180_W", "names": {"James Taylor": ["Q11075364", "Q1168698", "Q16561148", "Q17092246", "Q17140631", "Q18218071", "Q20631287", "Q21064423", "Q21996614", "Q23618920", "Q24005465", "Q25190090", "Q2536187", "Q28465652", "Q30362443", "Q310300", "Q39073622", "Q42322786", "Q43910676", "Q56885192", "Q58492697", "Q59162274", "Q6128460", "Q6128651", "Q6141741", "Q6144041", "Q6144043", "Q6144049", "Q6144051", "Q6144058"], "Paul Young": ["Q22101574", "Q360501", "Q3898174", "Q46110256", "Q51864276", "Q7154517", "Q7154518", "Q7154519", "Q7154521"], "Mike Campbell": ["Q1335425", "Q16019006", "Q27683717", "Q6846234", "Q6846235", "Q6846238"]}, "date": "2014-11-23", "url": "http://ultimateclassicrock.com/don-henley-building-the-perfect-beast", "content": "30 Years Ago: Don Henley Gets Confident, Builds a Near-Perfect \"Beast' Don Henley's solo debut, 1982 ′ s' I Can't Stand Still,' performed respectably on the charts, peaking at No. 24 and selling more than half a million copies. Compared to the commercial heights he'd reached as a member of the Eagles, however, that was small potatoes - and a far from definitive statement for a singer-songwriter seeking to define himself as an artist in his own right. He took a big step forward with his second effort,\" Building the Perfect Beast .' Released Nov. 19, 1984, the 10-song effort found Henley moving his sound further into the '80s - with all the synths and drum programs that entailed - while doubling down on the staunchly progressive social consciousness that informed' I Can't Stand Still' and deepening the pointed observations on human relationships that had always defined his best work. To some, the album's crowded, machine-assisted arrangements may have sounded like an attempt to glom onto current trends; to Henley, however, they were of a piece with his earlier work. \"I'm not ashamed of having been in the Eagles. I think we accomplished a great deal and added some pretty good music to the annals of rock n' roll,\" Henley told Record. \"The songs I'm writing now are simply extensions of songs I wrote then. They're more mature, succinct versions of those songs. I still am basically the same guy and I feel the same way about certain things; I've matured a great deal about other things, such as male/female relationships.\" As he had on his debut solo album, Henley worked closely with former <mark>James Taylor</mark> bandmate Danny Kortchmar, who'd made a name for himself as a producer and co-writer with many of the artists in Henley's peer group. By the time they hunkered down in the studio for the two-year process of writing and recording \"Building the Perfect Beast,' Henley and Kortchmar - a.k.a.\" Kootch' - had developed a level of trust and communication that allowed Henley the opportunity to take new risks. \"Songwriting is not quite as intimate a process as it used to be,\" Henley admitted during an interview with In the Studio. \"Sometimes nowadays - and I don't know if this is good or bad, but it seems to work - Danny will simply deliver me a cassette with a musical track on it and I'll just take it home and write it by myself, either in the car or at my house. I'll just play the music, and I can tell in the first couple of minutes if I can write a song - if it will pull a concept out of me. I have a bank of ideas in my head that I want to talk about, and I can either overlay that onto a piece of music or I can't.\" As he had on' I Can't Stand Still,' Henley employed a long list of session ringers for the \"Beast' tracks, enlisting liner notes mainstays like bassist Pino Palladino and drummer Jim Keltner as well as musicians who were recording artists in their own right, including Toto. But he also set about building the perfect solo band, with an eye toward upping his game when it came time to take the new songs on the road.\" I wanted some new, fresh people, so I just went out looking for them, I went to clubs all over town, \"Henley said of the arduous process of putting together new personnel.\" The word-of-mouth got around and we started getting volunteers. I held auditions for three or four weeks; I must have gone through God knows how many guitar players. It was excruciating. \"But, he pointed out, it paid off in terms of allowing Henley to surround himself with what he deemed a superior class of musician than the one he'd been accustomed to with the Eagles - particularly in terms of offstage behavior.\" I'm not a priest or anything, but I don't believe in making public spectacles, especially if you're in a rock 'n' roll band in a public place. We have a bad enough reputation in rock 'n' roll as it is, \"he shrugged.\" The whole rock musician as outlaw thing seems pretty immature and hokey to me now. \"Not only was Henley more concerned with keeping things on the up-and-up in his hotel rooms, he'd come around to a different way of thinking as far as stage presentation went for his solo tours.\" This is the Eighties: you dress up now, you have lights. It's showbiz now. It's not the Seventies and the Sixties anymore; it's completely different, \"he argued.\" I went to a lot of concerts in the past couple of years. I went to see the Eurythmics several times, and <mark>Paul Young</mark>, Tina Turner, a bunch of concerts. You don't go out in blue jeans and loiter anymore. \"He was also more aggressive about lining up guest appearances from famous friends and strangers, including Patty Smyth of Scandal, Tom Petty's longtime lieutenant <mark>Mike Campbell</mark> - the latter of whom ended up co-writing the record's biggest hit,\" The Boys of Summer .' \"I have a lot of nerve. I'll call anybody,\" he laughed. \"I was afraid some of those people were not going to be into an old guy from the mellow Seventies, you know? And Patty said,\" Are you kidding?' I used to sing \"Witchy Woman' when I was 15!'\" That all reflected Henley's increased confidence in himself as a solo performer - something he insisted developed slowly after the Eagles fell apart. \"I said,\" God, can I do this by myself?' I thought maybe I should put another band together. Then I said, \"Nah, I can do this .' I drank a lot of Scotch making that first album,\" he admitted. \"And then after it was done I figured,\" Yeah, I can do this,' so this album was much more confident. It sounds more confident, I think, and I stretched further and took more chances. \"Those chances paid off handsomely after\" Building the Perfect Beast' arrived in stores. A Top 20, triple-platinum hit, the album spun off a string of big singles, including four Top 40 pop hits: \"The Boys of Summer' (No. 5),\" All She Wants to Do Is Dance' (No. 9), \"Not Enough Love in the World' (No. 34), and\" Sunset Grill' (No. 22). More impressively, Henley's pop crossover act - which included heavy rotation on adult contemporary and dance playlists - didn't hurt his stature on rock radio, where five of the album's tracks went Top 20 (and \"The Boys of Summer' and\" All She Wants to Do Is Dance' hit No. 1). AC/DC Share Their Real-Life \"Spinal Tap' Stories - Exclusive Video 30 Years Ago: Don Henley Gets Confident, Builds a Near-Perfect\" Beast' Powerman 5000 Escape Scary Marietta, Georgia Hotel Fire Foo Fighters Reveal Christmas Sweaters Inspired by Black Metal Legends Emperor 15 \"Guardians of the Galaxy' Facts in One Video. You're Welcome. 15 Crazy\" The Hunger Games' Facts in One Video • The Top Five Worst Superhero Teams In Comics • Rock Star Yearbook Photos: Kurt Cobain, Dave Grohl, Billy Corgan + More 21 Best Alt Rock Albums of the 21st Century • Greatest Game Cosplay Ever (This Week): Valentine, Warsong Commander, Kefka + More Important Facts You May Have Missed In \"The Avengers' Welcome back to Ultimate Classic Rock It appears that you already have an account created within our VIP network of sites on YES, Activate My Account Now! * Please note that your points, prizes and activities will not be shared between programs within our VIP network. Welcome back to Ultimate Classic Rock It appears that you already have an account on this site associated with. To connect your existing account with your Facebook account, just click on the account activation button below. You will maintain your existing profile and VIP program points. After you do this, you will be able to always log in to YES, Activate My Account Now! * Please note that your points, prizes and activities will not be shared between programs within our VIP network. Register on Ultimate Classic Rock quickly by logging in with your Facebook account. It's just as secure, and no password to remember! Ultimate Classic Rock Registration"}, {"articleID": "2010032004_00059123_W", "names": {"Brent Jones": ["Q18208348", "Q19895523", "Q3373154"]}, "date": "2010-03-20", "url": "http://usatoday.com/sports/baseball/nl/2010-03-20-strasburg_N.htm?csp=34sports", "content": "(fsy) watched two of his first 11 pitches sail out of the ballpark. he didn't flinch. washington nationals' top pitching prospect can't handle a little adversity. after allowing two solo shots in the first inning, strasburg finished with eight strikeouts in four innings, and the washington nationals beat a st. louis cardinals split squad 13-5 on friday night. \"you got to go back out there and not let it faze you,\" strasburg said. \"just keep pitching and pitching your game and that's all i kept doing. i was able to get some outs.\" (fsy) slammed strasburg's first-pitch fastball over the fence in left-center. two batters later, allen craig (fsy) curled a high drive just inside the right-field foul pole, an opposite-field shot. all strasburg did after that was buckle down and stifle a cardinals lineup made up of players who will start the season in class aa and class aaa. he got tyler henley to miss three pitches, the last of which was a 97 mph rising fastball, to end the first and fanned three straight in the second. strasburg pounded the strike zone, getting groundouts. he has yet to record a flyball out in three outings this spring. \"i think he realizes it's going to be less taxing on his arm to get some groundball outs instead of deep pitch counts and a higher number of strikeouts,\" nationals manager jim riggleman said. \"i'm sure he's satisfied either way, but if you took the preference, i think he'd take the groundballs and he certainly gets a lot of groundballs.\" strasburg didn't sound enamored of the strikeouts. \"my ball's moving enough to force weak contact. my pitch count was a little up. you're not going to have that many strikeouts every time out,\" he said. strasburg, the top pick in june's draft who signed a record $15.1 million contract, gave up four hits in his longest spring outing. the right-hander threw 73 pitches, 53 strikes, and was constantly challenged by veteran (fsy), who caught him in a game for the first time. \"he wanted me throwing curveballs to both sides of the plate, he wanted me throwing changeups to the righties, fastballs in, fastballs away, fastballs up, sinkers, changeups, curveballs, everything ....(rodriguez) went out there with the confidence in me and with all my pitches,\" strasburg said. rodriguez barely needed to offer any encouragement to his 21-year-old battery mate. \"you have to go with your best pitch and sometimes that happens with power pitchers,\" rodriguez said. \"power pitchers are going to get hit sometime. after that he settled down and did a tremendous job.\" in his three outings, strasburg has yielded two runs and eight hits, walked one and struck out 12 in nine innings. those are impressive numbers that may or may not play into the impending decision on whether strasburg will get another exhibition start or whether the nationals need those innings for other pitchers they feel are more ready to contribute to the rotation. riggleman said washington's front office, coaching and player development staffs would meet saturday to discuss another round of cuts and acknowledged that strasburg would be discussed. \"we'll continue to talk about when his next start will be...and we'll schedule from there,\" riggleman said. notes: cardinals rhp kyle mcclellan (fsy) went four innings, allowing three runs - two earned - on five hits. he walked four and struck out two ....washington of (fsy), who hasn't played since sunday, remained sidelined with a tight right hamstring. riggleman said morgan wouldn't return before next week, but morgan was itching to play. \"in my eyes, i wish i was out there right now,\" morgan said ....of to report corrections and clarifications, contact standards editor <mark>brent jones</mark>. for publication consideration in the newspaper, send comments to"}, {"articleID": "2016052504_00115429_W", "names": {"Keith Brown": ["Q16180519", "Q1738042", "Q19609795", "Q24059778", "Q28445556", "Q3194726", "Q43433849", "Q6384118", "Q6384119", "Q6384120", "Q6384121", "Q6384122", "Q6384123"]}, "date": "2016-05-25", "url": "http://eveningtimes.co.uk/news/14514384.One_in_ten_adults_in_Glasgow_have_never_worked/", "content": "One in ten adults in Glasgow have never worked One in ten adults in Glasgow have never worked / Stewart Paterson, Political Correspondent / @ PatersonHT Share: 0 comments More than one in ten adults in Glasgow have never had a job, paid or unpaid, in their life according to new figures. The city with a population of more than half a million adults has 55,000 people who have never worked. Glasgow's rate, which is 11.1%, is not far away from double the Scottish figure of 6.7% who have never worked. The report covers over 16s but excludes those up to the age of 24 who are in full time education at school, college or university. The number of lifetime jobless in the city has increased in the last decade from 27,400 in 2005 but is a fall from the highest figure of 63,000 in 2012. Only Dundee has a similar rate at 11.2% with just under 14,000 in the same situation. Glasgow is home to tens of thousands of people who are on long term sickness benefit and may be one reason for the higher number of lifetime jobless in the city. Last year there were 111,700 economically inactive adults of working age in the city, including, students, those who retired but not yet of state pensionable age, long term sick and people looking after a relative. Almost 35,000 were long term sick, and 19,000 were looking after someone. There were 36,000 students and 8,000 retired and 9000 classed as other. The lifetime jobless also include young people not in education or training so includes some teenagers looking for their first job after leaving education which only accounts for around two to three thousands a year. In 2014 there were 2270 teenagers aged 16-19, not in education or training (Neet) the lowest in a decade and down almost 1000 from 2005. <mark>Keith Brown</mark> the new Economy Secretary said the picture for young people was improving. He said: \"We are seeing encouraging progress with more young people finding work across most of Scotland, with the youth employment rate increasing by three percentage points last year.\" Within the first 100 days of this Scottish Government we will build on the progress we have made with a new Labour market strategy to focus our efforts and target a further reduction in youth unemployment. \"The Scottish economy has a number of fundamental strengths that will be crucial for the future. Increased inward investment, combined with a resilient labour market and talented workforce, is positive news for our jobs market and our economy as whole.\" The Tories however warned that across Scotland the number of Neets was increasing and linked it to college cuts. Murdo Fraser, conservative finance spokesman said: \"These statistics should focus minds within the Scottish Government.\" The UK Government has worked very hard to ensure economic recovery, and we can't have young people in Scotland missing out on that because the SNP doesn't value college education. \"Share: 0 comments"}, {"articleID": "2017122407_00070788_W", "names": {"Karl Hofmann": ["Q1668724", "Q21544598"]}, "date": "2017-12-24", "url": "https://www.abqjournal.com/1110312/installation-offers-artist-opportunity-to-engage-with-the-street.html", "content": "............................................................................................................ALBUQUERQUE, N.M.--Ribbons and wisps of wood orbit and spiral around upside-down sawhorses like some kind of warped helix. At first, they seem like a random collection of Home Depot discards rising to the gallery's 25-foot ceiling. But a closer look exposes deliberate patterns of shape and light amid the cacophony of chaos. Advertisement Continue reading \"Putting this together is a balancing act,\" painter/sculptor and artist <mark>Karl Hofmann</mark> said. The Albuquerque artist's installation \"In the Balance\" snakes, swirls and climbs across the windows, above the door and inside the main gallery at 516 Arts. Created from plywood, poplar, plastic and metal, the creation mirrors the imbalance of the world today, <mark>Hofmann</mark> said. Organizers chose <mark>Hofmann</mark>'s playful piece out of about 15 submissions, 516 curator Josie Lopez said. \"We were really interested in artists who were able and willing to engage with that front window space,\" she said. \"We also saw it as an opportunity to engage with the street. You actually walk through the art as you enter the space. It makes it exciting in that you get different perspectives.\" <mark>Hofmann</mark> moved to Albuquerque from New Orleans to complete his master in fine arts degree at the University of New Mexico. His work is a hybrid of pop, dada and expressionism combining the organic geometry of Kandinsky with Marcel Duchamp's \"ready-made\" found objects. \"In the Balance\" mixes two-by-fours with soaring ribbons of poplar joined with metal and plastic clamps. A silver trash can hugs a bouquet of plywood stems. \"The idea is to create an aesthetic spectacle out of commonplace materials,\" <mark>Hofmann</mark> said. \"All of this stuff has its own visual language. It adds tension to the space. If I take the clamps off, the whole piece will collapse.\" Lifting materials from big-box hardware stores came easily to an artist who built his own stretchers and rehabilitated his own \"faux adobe.\" Advertisement Continue reading \"You start seeing these patterns of wood---- the psychedelic patterns of plywood when they're juxtaposed in a pile,\" he said. \"There's beauty in that.\" It was almost like playing with Legos. It came naturally and intuitively. \"The title springs from a world <mark>Hofmann</mark> sees as teetering toward imbalance.\" I'm balancing things in place, especially with these poplar ribbons, \"he said, gazing overhead at the undulating ribbons of wood.\" Then you start joining and connecting them. In my work, I'm always balancing to create and order, which is part of the sense I have of the world I live in. I think it is a direct reaction to all the uncertainty in the world. It gives me a sense of calm. \"<mark>Hofmann</mark> was an artist in residence at China's DaWang Culture Highland and is the recipient of the Arnold W. Brown Endowed Scholarship, the Florence Henri Prize and the Harry Nadler Memorial Fellowship, among others. His work has been exhibited internationally. He works in graphic design at Central New Mexico College. If you go WHAT:\" <mark>Karl Hofmann</mark>: In the Balance \"WHEN: Through Jan. 13 WHERE: 516 Arts, 516 Central SW HOW MUCH: Free. Call 242-1445; see 516arts. org."}, {"articleID": "2019120313_00245605_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}, "date": "2019-12-03", "url": "http://feeds.businessinsider.com.au/~/610781812/0/businessinsideraustralia~Van-Halen-responded-to-Billie-Eilish-not-knowing-who-they-were-by-telling-fans-to-go-check-her-out", "content": "Van Halen responded to Billie Eilish not knowing who they were by telling fans to \"go check her out' Hayley Peppin Email Michele Eve Sandberg/Corbis via Getty Images Bassist, Wolfgang Van Halen (right) defended Billie Eilish for not knowing who they are and said\" she's cool .' Billie Eilish has been defended by rock band Van Halen after the 17-year-old singer told <mark>Jimmy Kimmel</mark> she didn't know who they were. 28-year-old bassist Wolfgang Van Halen, son of band founder Eddie, wrote on Twitter Monday night: \"If you haven't heard of @ billieeilish, go check her out. She's cool. If you haven't heard of @ VanHalen go check them out. They're cool.\" On \"<mark>Jimmy Kimmel</mark> Live\" on November 22, the television host poked fun at the singer's age by asking her whether she could name a Van Halen band member, to which Eilish responded, \"Who?\" The 1980's rock band last performed together back in October 2015, when Eilish was just 13-years-old. Visit Insider's homepage for more stories. Billie Eilish has been defended by Van Halen after the singer admitted she hadn't heard of the popular 1980s rock band. <mark>Jimmy Kimmel</mark> asked the \"Bad Guy\" singer on \"<mark>Jimmy Kimmel</mark> Live\" on November 22 whether she could name a member of Van Halen, to which a puzzled Eilish responded, \"Who?\" On Twitter on Monday, the band's 28-year-old bassist Wolfgang Van Halen, son of founding member Eddie, told fans to check out the 17-year-old singer. ABC Eilish told <mark>Jimmy Kimmel</mark> that she hadn't heard of Van Halen. \"If you haven't heard of @ billieeilish, go check her out. She's cool. If you haven't heard of @ VanHalen, go check them out. They're cool too,\" he tweeted. Wolfgang also told people who had criticised Eilish after the <mark>Kimmel</mark> interview not to \"shame others for not knowing what you like.\" If you haven't heard of @ billieeilish, go check her out. She's cool. If you haven't heard of @ VanHalen, go check them out. They're cool too. Music is supposed to bring us together, not divide us. Listen to what you want and don't shame others for not knowing what you like .--Wolf Van Halen (@ WolfVanHalen) December 2, 2019 ’90s rock band Smash Mouth, popular for their songs, \"All Star\" and \"I'm a Believer,\" also defended Eilish, tweeting: \"We grew up listening to #VanHalen and we're old as fck so why would @ billieeilish know who they are? #NoDiss.\" We grew up listening to #VanHalen and we're old as fck so why would @ billieeilish know who they are? #NoDiss--Smash Mouth (@ smashmouth) December 2, 2019 Van Halen, which won a Grammy back in 1991 for best hard rock performance and was inducted int the Rock & Roll Hall of Fame in 2007, hasn't performed since October 2015. Eilish was only 13 at the time. The band also are said to have no plans to tour anytime soon with frontman David Lee Roth having said in recent interviews the band was \"finished\" according to The Rolling Stone. Read more:"}, {"articleID": "2015040520_00044948_W", "names": {"David Ortiz": ["Q19402485", "Q28815032", "Q38332228", "Q448005", "Q54541573"], "John Farrell": ["Q1017017", "Q17916883", "Q46168067", "Q56723519", "Q6232765", "Q6232766"]}, "date": "2015-04-05", "url": "http://providencejournal.com/article/20150405/SPORTS/150409603/13936/SPORTS", "content": "Sweethearts killed in wrong-way Providence crash were returning from \"Furious 7' screening PHILADELPHIA - Even with a left-hander on the mound in a National League park, <mark>David Ortiz</mark> will be in the lineup on Opening Day. While playing coy with his lineup on the whole, manager <mark>John Farrell</mark> at least announced that <mark>Ortiz</mark> would get the starting nod over Mike Napoli at first base at Citizens Bank Park. Although <mark>Ortiz</mark> took ground balls at first throughout the spring, he didn't play in an actual spring training game there.\" One of the disadvantages that we have coming into a National League ballpark is we're built as an American League club, and two of our primary power hitters occupy that same position, \"<mark>Farrell</mark> said.\" Mike has had a very good spring training. He's certainly available to us. Both guys will play a significant role in this series. \"Napoli slugged six home runs this spring. <mark>Farrell</mark> didn't specify on how he'd split the playing time between the two players on Wednesday and Thursday in Philadelphia. The manager did say there would be some shuffling in the middle of his lineup against the lefty Hamels. The Red Sox featured a consistent lineup in the spring against right-handers; <mark>Farrell</mark> said Pablo Sandoval could be dropped lower against southpaws.\" We might adjust accordingly, especially in the middle of the lineup, \"<mark>Farrell</mark> said. For most of the season, that probably means Napoli moving to fifth against lefties. On Monday with Napoli on the bench, perhaps it means Shane Victorino sneaks up a spot. Brown University identifies student who died after leaping from library Throwback Thursday: Make your own rice and ricotta pies with Angelo's recipes Lincoln furniture maker Hank Gilpin builds his masterpieces with centuries-old techniques (+ video) Retirees' group in limbo over legal challenge to R.I. pension suit Prostitution sting at Providence hotels nets at least 21 men (49) Sharon Estes: Indiana law about discrimination, not liberty (28) Retirees' group in limbo over legal challenge to R.I. pension suit (24) Lawyer for retirees seeks to withdraw from pension case citing splits within group (20) Greg Waradzin: Rhode Island should let Raimondo get her higher taxes (16) Independent pharmacies oppose R.I. bill banning tobacco sales (13) Sign up for our newsletter and have the top headlines from your community delivered right to your inbox. © Copyright 2006-2015 Gatehouse Media, Inc.. Some rights reserved Gatehouse Media Publications Original content available for non-commercial use under a Creative Commons license, except where noted."}]