[{"articleID": "2019033008_00398687_W", "names": {"Jack Daniels": ["Q6111998", "Q981415"]}, "date": "2019-03-28", "url": "http://crainscleveland.com/legal/licata-law-group-bridges-ne-ohio-china", "content": "March 30, 2019 04:00 AM Licata Law Group bridges NE Ohio, China Print As Chinese investors seek out deals in the U.S., Cleveland lawyer Louis Licata may be a catalyst who funnels their capital to Northeast Ohio. Licata's business contacts in China are looking to the former Council of Smaller Enterprises (COSE) chair to source deals across the U.S., since there's a sense their money could see better returns here because of the fragility of the Chinese economy right now. \"Part of the reason their economy has struggled over the last two years is because ours is doing so well,\" Licata said. \"In the last 20 years, I've seen this sort of back-and-forth. When China's economy is really good, ours isn't. A lot of the U.S. tries to invest in China. Then it shifts, and China comes back and tries to invest in the U.S.\" But Licata--who founded his Independence law firm, Licata Law Group, in 1990 and has spent decades navigating global business deals for smaller and midsize companies--has developed some special connections in Asian markets, to which roughly 35% of his firm's revenue is tied. That positions him and his practice as a portal connecting businesspeople in China and Cleveland. To that end, Licata recently signed an agreement with the Liaoning Zhuozheng Law Firm in Shenyang City in China's Liaoning province. It's believed to be the first formal relationship between law firms in the U.S. and China's populous northeast region. The idea is to establish, in writing, a dynamic whereby the two entities will work deals on behalf of their respective businesses, clients and potential investors. Founded in 2010, the Liaoning Zhuozheng firm has more than 100 lawyers. A goal of the firm is to increase its relationships in China's northern provinces versus the southern region where it's already well meshed into the business fabric. That ultimately means helping investors there make money. \"We are pleased to initiate this new agreement to establish the communication and collaboration between Chinese and American lawyers in the future, in the mutual understanding to create economic development projects for both of our law firms and business communities,\" said Liu Zhengwei, founder and director of Zhuozheng, in a prepared comment. That's something that particularly excites local stakeholders. \"There's no shortage of initiatives and ideas for how to move U.S. products to China, and those are certainly important,\" said Joe Roman, CEO of the Greater Cleveland Partnership, in a statement. \"What's exciting about this initiative is that it focuses the discussion on Northeast Ohio and highlights what our region has to offer to Chinese investors that might otherwise be unaware of the strength our own region has to offer. There's nothing but upside for the local business community in an agreement like this.\" Chinese investors sourcing deals here--and vice-versa--is certainly not novel. But the coordinated effort to focus on the Northeast Ohio region at this time, to some degree, is. And there are a number of reasons why it's playing out now. \"The Chinese money coming to U.S. has been a long history, but most money goes to the West and East coasts,\" said Su He, an attorney with He & Associates in Beachwood and executive director of the 2-year-old Greater Cleveland Chinese Chamber of Commerce. \"But it's hard to get into those markets because there are lots of people there already. The relationships are not as easy as we can get here.\" That's one element of the opportunity investors have here: the ability to foster new relationships in regions with which overseas businesspeople naturally aren't as familiar, such as the Buckeye State. After all, said He, to foreign businesspeople, there are no discernible differences between Cincinnati, Columbus and Cleveland--let alone Ohio compared to the rest of the Midwest. She noted the Chinese chamber devotes a bulk of its resources to building up Cleveland's public image and courting large Chinese companies to visit the market \"because we truly believe Cleveland has such huge potential.\" A more global Cleveland Licata's connections to Asia began with his undergrad degree, which bent toward China and Asia studies. He worked on business deals for smaller and midsize companies through the 1990s, sometimes his contribution as simple as writing out terms and conditions. But as his practice developed, and he sought more global opportunities for his growing clientele, his familiarity with the country naturally steered his attention there. Some of his work evolved into helping various U.S. companies and suppliers introduce facilities and products to the Chinese market. While reluctant to name-drop clients with deals in the works, one of the local manufacturers with whom Licata has been working is Cleveland Whiskey. There, he has assisted CEO Tom Lix to sell product in a country packed with stiff liquor competition (<mark>Jack Daniels</mark>, for instance, has its own facility for distribution capabilities there). Lix recently pulled back on expanding to overseas markets for now, including China and Europe--largely because of retaliatory tariffs that have hurt margins and good will--but is working with Licata on possible re-entry opportunities in China. As far as the kinds of items Chinese investors want, whether from the U.S. or elsewhere, in Licata's world, it's often a short, specific list of consumer-related products. Items in high demand right now include honey, olive oil, American red wine and juice products. Licata is currently working on deals involving all of those with suppliers in Greece for olive oil and the Middle East for honey. Going the other way, Licata noted that Chinese investors are relatively agnostic about what they'd invest in here. On the table is everything from what's tied to the obvious, big corporate players in the market, such as Cleveland Clinic, to real estate projects. \"The way this is working is, if I see something in our region that might be a good opportunity for Chinese investment, they just want me to bring it to them to start,\" Licata explained. \"It could really be anything.\" Some may want to invest in smaller funds: One effort in which Licata is engaged involves selling investors on Flashstarts' $6 million, pre-seed Blockchain + Fund, which carries just a $10,000 minimum buy-in. Others may want to outright acquire factories, product suppliers or warehouses, whether to collect on returns or otherwise establish a foothold in the American market (which would help them skirt taxes and exchange rates when money moves overseas). The perception in China right now, said He, is that any opportunity in the U.S. could be potentially viable--hence the reliance on a network here through Licata or someone like him. Various factors, not just Licata's experience, are leading to a lot of that potential being framed through the Northeast Ohio market. \"The general feeling is Chinese investors are exploring the Midwest area,\" He said. \"They are still motivated to source deals in the U.S., but because of harsh economic/trade policies, they are getting slower or waiting-and-see.\" One special thing in Cleveland is we are an important city in the health care industry, \"she added.\" China is very focused on developing health care-related businesses, such as diagnosis service, hospital management, medical devices and innovative technologies. So for this part, I see lots of Chinese investors still motivated and expanded opportunities in the Greater Cleveland area. \"He said the Chinese chamber is aware of a number of potential deals in the works, but can't disclose them publicly because of ongoing negotiations. A couple of related companies also declined interviews about those deals. Licata said the agreement with Liaoning Zhuozheng doesn't include any formal goals to ink a specific number of deals or help deploy a particular amount of capital in any specific amount of time. But with several deals already in the works, it's very possible Chinese money could weave its way into the local business fabric more than ever. That, in turn, could further grow and globalize the city and the region.\" I think this community has tremendous, unrealized potential to be a global city, \"Licata said.\" I think Cleveland has all the right pieces, but we're not realizing the potential of the collective use of those pieces. We are very fragmented in terms of being a global city. But we have good people in place and a lot of good opportunities. \"Letter"}, {"articleID": "2012041709_00013010_W", "names": {"George Bush": ["Q207", "Q23505"], "Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2012-04-17", "url": "http://daijiworld.com/news/news_disp.asp?n_id=135077", "content": "anupam shocked on censor cut in \"mr.bhatti on chutti' veteran actor anupam kher is\" shocked \"after reading reports that the central board of film certification (cbfc) has asked producers of his next film\" mr.bhatti on chutti \"to mute dialogues mentioning political leaders <mark>george bush</mark> and <mark>manmohan singh</mark>.\" censor board asks makers of my film \"mr.bhatti on chutti' to mute the names of <mark>george bush</mark> and <mark>manmohan singh</mark>. shocking,\" tweeted the 57-year-old. directed by karan razdan, the movie narrates the story of a group of indian tourists visiting the lake district in cumbria, britain. but they get mixed up in the saga of a missing british woman. with anupam in the lead role, the film is slated for release june 21. your comment [please limit your comments within 2000 characters] characters left. disclaimer: published by daijiworld media pvt ltd mangalore editor-in-chief: walter nandalike main office: emporium complex, c-5 first floor, old pumpwell road, mangalore, karnataka. pin 575002 telephone: 0091-824-4259372, 4278372, fax: 0091-824-2439373 about us copyright? 2001 - 2012. all rights reserved. kishoos enterprises, maithri complex, 3rd floor, udupi service bus stand, udupi, karnataka. pin 576101 telephone: 0091-820-4295571"}, {"articleID": "2012042507_00005057_W", "names": {"Jerry Jones": ["Q1280022", "Q16643824", "Q25190360"], "Rob Ryan": ["Q7340518", "Q7340519", "Q7340520", "Q7340521", "Q7340522"]}, "date": "2012-04-25", "url": "http://shreveporttimes.com/article/20120424/SPORTS/120424030/Cowboys-could-get-defensive-in-draft?odyssey=tab|mostpopular|img|FRONTPAGE", "content": "baton rouge - hundreds of people have packed rooms and hallways at the louisiana capitol asking...bird enthusiasts irate after lowe's removes colony the league would not comment on the meetings, which included discussions about human growth hormone...haughton high school is turning to a familiar face to lead its boys basketball team, former...documentary focuses on 1917 \"tarzan of the apes' filmed in louisiana tarzan will swing into the robinson film center next week with a double feature, including the...\"a bull named justice\" is making a name in art for caddo sheriff steve prator. there's something about government, april \"? and taxes. irving, texas - the dallas cowboys addressed some pressing needs during a flurry of free-agent signings they added two veteran offensive linemen who are expected to be starters, got a proven backup for quarterback tony romo, a starting cornerback, a safety, a linebacker and a fullback in just a couple of days. now they need to get really defensive in the draft, starting with their no. 14 overall pick thursday night.\" it would look like there is going to be potentially top defensive players there, \"cowboys owner <mark>jerry jones</mark> said.\" we have to take into consideration that we've done pretty well in free agency relative to our offensive line ....so you're not off base to say likely it will be a defensive player. \"while the cowboys defense improved in coordinator's <mark>rob ryan</mark>'s first season, despite the lack of a traditional offseason to install his scheme and work with his new players, there were five games where leads were blown in the fourth quarter. their aging inside linebackers became less of a factor and the secondary at times was just horrendous. need another indication of what the cowboys are thinking about for their first pick? the only on-campus pro day that coach jason garrett attended was at alabama. cowboys could get defensive in draft irving, texas - the dallas cowboys addressed some pressing needs during a flurry of free-agent signings"}, {"articleID": "2012011907_00055678_W", "names": {"Tom Coughlin": ["Q1378304", "Q7815428"], "Corey Webster": ["Q2074562", "Q5170460"]}, "date": "2012-01-19", "url": "http://timesleader.com/r?19=961&43=406164&44=137647133&32=3991&7=420054&40=http%3A%2F%2Fwww.timesleader.com%2Fgolackawanna%2Fsports%2FEli_Manning_gets_sacked_by_a_virus_01-19-2012.html", "content": "click image to enlarge new york giants quarterback eli manning reacts during the second half of an nfl divisional playoff football game against the green bay packers sunday, jan. 15, 2012, in green bay, wis. the giants won 37-20. (ap photo/darron cummings) new york giants quarterback eli manning enters the practice field after leaving momentarily during practice wednesday .' class = \"popboximagesmall' pbshowpopimage =\" true' title = \"click to magnify and shrink' onclick =\" pop (this,15, \"popboximagelarge\" );' border =' 1' /> click image to enlarge new york giants quarterback eli manning enters the practice field after leaving momentarily during practice wednesday. select images available for purchase in the times leader photo store east rutherford, n.j. - new york giants quarterback eli manning missed part of wednesday's practice session with an illness that coach <mark>tom coughlin</mark> called \"a stomach bug, hopefully a 24-hour deal.\" manning was placed on the giants' injury report for the first time this season as a limited participant in practice, though he missed the majority of it. the team is preparing to play the san francisco 49ers on sunday for the nfc championship. \"if there is one guy who can miss a practice wednesday mentally, it's no. 10,\" guard chris snee said of manning, who has had his best pro season. \"he was probably in here on monday and tuesday looking at film.\" tight end jake ballard figured manning headed right home to recuperate - and watch film. \"he's probably going to spend the rest of the day doing that,\" ballard said. also limited wednesday were defensive ends justin tuck (shoulder) and osi umenyiora (ankle, knee), cornerback <mark>corey webster</mark> (hamstring) and rookie linebacker mark herzlich (ankle). missing practice completely was running back ahmad bradshaw with a foot problem. bradshaw frequently has sat out practices or been limited in recent weeks. ballard said it was apparent immediately wednesday morning that manning wasn't feeling well .? copyright 2012 the times leader. all rights reserved. stock quotes may be delayed by 15 minutes."}, {"articleID": "2016092318_00942461_W", "names": {"Geoffrey Gordon": ["Q1502982", "Q56055704", "Q57437749"]}, "date": "2016-09-23", "url": "http://northjersey.com/news/education/student-athletes-eligible-to-opt-out-of-gym-under-proposed-policy-1.1665871", "content": "& copy; 2016 North Jersey Media Group September 23, 2016 Last updated: Friday, September 23, 2016, 2:46 PM Student-athletes eligible to opt out of gym under proposed Northern Valley Regional policy By Samantha Karas Staff Writer | Northern Valley Suburbanite OLD TAPPAN - The Northern Valley Regional Board of Education plans to amend a policy that allows student athletes to substitute one marking period of physical education for a study period during a season in which they are playing a sport. The second reading of the amended policy will be held during the Board of Education's Sept. 26 regular meeting, interim Superintendent <mark>Geoffrey Gordon</mark> said. The changes include what types of sports are eligible, as well as a clarification that the only sports permitted for the physical education substitution are Northern Valley Regional sports. The board is making the policy clearer, said Demarest Principal James Santana. <mark>Gordon</mark> said while some school districts allow students to use club teams after school as an alternative for physical education, those credentials do not apply under the Regional District policy. The district policy is to comply with a June 2009 Department of Education regulation that requires all district boards of education to create a process to allow \"individualized student learning opportunities that meet or exceed the Core Curriculum Content Standards.\" For the Northern Valley Regional school district, these individualized student learning opportunities allow students to take courses for credit if the student fails a course and has to remediate, the course is not offered at the district or if the student wishes to enroll in college level courses, participate in an independent study or a senior internship. The policy also allows for an alternative for physical education. Commonly known as the \"Option II\" policy, students who participate in these alternative programs must meet \"local district curricular objectives\" and the principal should \"carefully document the student's achievement.\" According to the Regional District's physical education criteria for acceptance under Option II, application for the alternative is valid for one physical education course for the specified school year and does not apply for health education or Project Adventure, a physical education course that emphasizes teamwork and leadership skills through adventure-based learning. The physical education alternative only applies for the student during their participating sports season and the student will receive either a \"pass\" or grade of \"F\" based on completion of requirements. Allowing students to swap a study hall for gym aims to alleviate some of the stress of juggling academics and school sports, <mark>Gordon</mark> said. \"We have kids taking five or six AP courses and they go to a top school and they often play sports,\" <mark>Gordon</mark> said. \"The idea was to give kids who legitimately loaded up on work and, during one specific season they are playing a year, they would have some relief where they could go to the library media center and catch up on studies while meeting state standards for physical education.\" State requirements say that a student has to participate in 150 minutes of physical education a week, he added, so Option II \"is an alternative to that.\" \"It's an alternative to being in the classroom and meeting the core curriculum standards,\" <mark>Gordon</mark> said. Option II is currently available only for 11th and 12th-graders, Santana said. Tenth-graders will not be able to use the alternative because of Project Adventure and health class requirements mandated by the state. Email: karasa @ northjersey.com"}, {"articleID": "2017031008_00419180_W", "names": {"Mark Mcgowan": ["Q16197112", "Q5981811", "Q6768808"]}, "date": "2017-03-09", "url": "https://www.gympietimes.com.au/news/barnett-says-labor-costings-cobbled/3153543/", "content": "WA Labor leader <mark>Mark McGowan</mark> visits the Civmec Construction and Engineering company in Perth on Friday. DAN PELED Popular Stories 15 jobs going in Gympie right now Why is there a chopper hovering over Gympie? $20k? Is this the Gympie region's cheapest land? Local Real Estate Subscribe Now LONG-serving West Australian Premier Colin Barnett used his final election campaign media conference yesterday to blast Labor's election promise costings as flimsy, fake and cobbled together by \"a couple of Labor mates\" . Despite criticism over WA's rising debt, Mr Barnett said the state had prospered through difficult times under his government and the economy was improving. The 66-year-old said a vote for Labor in today's poll was \"a vote for a return to Dullsville\" . Under pressure over the Liberal Party's controversial preference swap deal with One Nation, Mr Barnett admitted on ABC radio he was personally uncomfortable with the deal. \"But at the same time, can I say I accept the reality of that,\" he said. \"Micro parties game the system. They game it and trade preferences.\" A firm favourite to become WA's next premier, Labor leader <mark>Mark McGowan</mark> has been endorsed by the state's only daily newspaper, The West Australian. colin barnett Read More Login to follow dullsville Read More Login to follow <mark>mark mcgowan</mark> Read More Login to follow state election Read More Login to follow western australia Read More Login to follow Topics: colin barnett dullsville <mark>mark mcgowan</mark> state election western australia 0 PRINT Have your say"}, {"articleID": "2019061012_00247078_W", "names": {"John Finnie": ["Q1495635", "Q29057429", "Q57097730"], "John Mason": ["Q14945665", "Q1700987", "Q21077155", "Q21597927", "Q25344506", "Q27925051", "Q53953104", "Q6247048", "Q6247051", "Q6247057", "Q6247072", "Q6247074"]}, "date": "2019-06-10", "url": "http://www.northwichguardian.co.uk/news/national/17696043.campaigners-to-urge-msps-to-back-move-for-20mph-residential-streets-limit/", "content": "Campaigners to urge MSPs to back move for 20mph residential streets limit By Press Association 2019 20 mph zone 0 comment Campaigners are to hold a demonstration outside of the Scottish Parliament, calling for a 20mph default speed limit on residential streets. Demonstrators will place 60 chairs outside of the parliament building in Edinburgh on Tuesday to represent the number of lives they say could have been saved had the limit been put in 1999--when the parliament was first convened. Travel and environmental groups including Friends of the Earth Scotland, Cycling UK, Pedal on Parliament, Spokes Lothian, Go Bike and 20s Plenty, will join together as part of the demonstration, along with other campaigners, between 1pm and 2pm. My #saferstreets 20 mph bill has its Stage 1 debate this Thursday. Below are ten reasons why you should ask your MSP now to support the bill??--Mark Ruskell MSP (@ markruskell) June 7, 2019 Last month, Holyrood's rural economy committee refused to back a Bill seeking to make 20mph the standard speed limit on residential streets. It had been put forward by Scottish Green MSP Mark Ruskell with the aim of reducing deaths and serious injuries on roads. Of the committee's 11 members, eight MSPs said they were unable to recommend the general principles of the Bill, while three--<mark>John Finnie</mark>, <mark>John Mason</mark> and Colin Smyth--disagreed with the majority conclusion and argued that \"the current inconsistent use of 20mph speed limits is confusing and undermines road safety\" . MSPs will vote on Stage 1 of Mr Ruskell's Bill at the Scottish Parliament on Thursday. Gavin Thomson, an air pollution campaigner at Friends of the Earth Scotland, said MSPs must take the chance to demonstrate they are taking action to tackle climate change. \"This Bill is vital to making our streets healthier and safer,\" said Mr Thomson. \"Our politicians have a chance to show that they're to take action to face up to the climate emergency.\" This means making our roads safer so more of us can walk and cycle safely, and leave our polluting cars behind. It is shocking that MSPs are planning to put the need for motorists' speed ahead of the need for public safety. \"In April, First Minister Nicola Sturgeon declared a\" climate emergency \"at the SNP conference in Edinburgh. The Scottish government has also committed to achieving net-zero greenhouse gas emissions by 2045--five years ahead of the UK as a whole. This morning, the Committee has published its report on the Restricted Roads (20mph Speed Limit) (Scotland) Bill, it concluded that it did not agree the general principles of the Bill. Read the report here--https: //t.co/vZWE14JmWi pic.twitter.com/kW2EnxMBVd--REC Committee (@ SP_RECcttee) May 31, 2019 Sally Hinchcliffe, from Pedal on Parliament, said that MSPs must explain what measures they will take to reduce road danger if they do not back Mr Ruskell's proposed Bill. Ms Hinchcliffe said:\" This legislation presents a perfect opportunity to make our towns and cities safer right across Scotland, eliminating the postcode lottery of safer streets for children walking or cycling. \"If MSPs don't want to support this bill, we challenge them to tell us what measures they will enact that would reduce road danger for vulnerable road users as effectively as this.\" Duncan Dollimore, of Cycling UK, added: \"Despite acknowledging the safety benefits of 20mph limits, the Scottish government seems to want to carry on regardless, leaving local authorities to decide whether or not to introduce lower limits.\" But had such a limit been introduced when the Scottish Parliament was founded, 60 families might have been spared the agony of losing a loved one in a road collision. \"They might ask, why won't their government lead and assume, rather than duck responsibility?\" 0 comment"}, {"articleID": "2015072614_00069081_W", "names": {"Terry Simpson": ["Q3518933", "Q7705013"]}, "date": "2015-07-25", "url": "http://www.thecourier.com.au/story/3235917/tigers-jump-to-second-after-waubra-trip/?cs=4170", "content": "Springbank romped home over Waubra by 48 points after jumping the Roos early. GOOD DAY: Matt Tyler was one of Springbank's best on Saturday. SPRINGBANK romped home over Waubra by 48 points after jumping the Roos early. It was a scoreless first term for Waubra in wet and blustery conditions on Saturday. Jarryd Underwood got the party started for the Tigers, kicking the first four goals of the match. Underwood had a big impact on the scoreboard, booting six for the day. The young forward filled the gap left by the late withdrawal of gun Paul McMahon, who had a quadriceps injury from the week before. GJ Gardner Tigers supporters rose in cheers for first-gamer Darian Quinlan, who kicked his maiden senior goal on debut. Quinlan did some great work in the third term, with courageous tackling and effective smothers. Other players to stand out for the visitors were Matt Tyler, Simon Quinlan and Billy Driscoll. Robbie Lockett had his sights on the ball through thick and thin. Ruckman Matthew Wapling, who kicked two goals, was one of the best for the Roos. Tim Mullane, Shaun Mullane and Alex McPherson tried hard, while skipper Paul Dodds attempted to ignite a comeback. Springbank coach <mark>Terry Simpson</mark> said it was a terrific win against a quality side. \"The boys were great today. They played really great footy. It was windy and I thought they handled it pretty well. It made it easier when they got the score on the board early,\" he said. <mark>Simpson</mark> had praise for Underwood's performance in the forward line. \"It was great to see. He's been a bit of a borderline player and he's taken the step forward and proven to himself he can be a very good senior player.\" Waubra's coach Grant Luscombe conceded the Roos were \"just outclassed all over the ground\" ."}, {"articleID": "2016092616_00113887_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-09-26", "url": "http://fox23.com/web/koki/news/national/key-bridge-case-witness-traffic-problems-email-no-joke/450561227", "content": "Key bridge case witness: \"Traffic problems' email no joke by: DAVID PORTER, Associated Press Updated: Sep 26, 2016 - 10:51 AM Twtter NEWARK, N.J. (AP)--The government's key witness in the George Washington Bridge lane-closing case said that he interpreted an email from one of the defendants that it was\" time for some traffic problems \"as an order to put a political revenge plot into action. David Wildstein worked for the Port Authority of New York and New Jersey, the agency that operates New York-area bridges, tunnels, ports and airports. He pleaded guilty last year to conspiring to cause traffic gridlock near the bridge to punish Fort Lee's Democratic mayor for not endorsing Republican Gov. Chris Christie. Bridget Kelly, Christie's former deputy chief of staff, has claimed the email from mid-August 2013 was a joke, but Wildstein testified Monday that he didn't take it as one.\" I understood that to mean it was time to change the lanes configuration at the upper level of the George Washington Bridge in order to create traffic in the borough of Fort Lee, \"Wildstein said.\" We had had joking emails before. I did not think she was joking. \"The government contends that a month later, Wildstein, Kelly and Port Authority executive Bill Baroni put the plan into action and caused four days of traffic jams. Baroni and Kelly are on trial for fraud, conspiracy and civil rights counts. Christie hasn't been charged, but prosecutors say Wildstein will testify that he told the governor about the plot on the third of the four days of traffic chaos. Christie has denied that. Both defendants say Wildstein conceived and carried out the scheme in September 2013. The bridge, one of the world's busiest, spans the Hudson River and connects Fort Lee, New Jersey, with New York City. Last week, Wildstein testified that Christie's office used the Port Authority as a source of political favors for local Democratic officials whose endorsements were sought for his 2013 re-election. Christie wound up winning easily. Wildstein said Christie and his former campaign manager, Bill Stepien, were among those who discussed the strategy at a meeting about Christie's re-election. Stepien and another former Christie aide who testified Friday, Matt Mowers, now work for Republican presidential nominee <mark>Donald Trump</mark>'s campaign. Kelly and Baroni have pleaded not guilty and have said the government has twisted federal law to turn their actions into crimes. They also have said other people with more power and influence were involved in the lane closures but aren't being prosecuted. Wildstein also testified he told Stepien about the lane closures in mid-August 2013, shortly after his email and discussion with Kelly, and told Stepien he was going to\" create the cover of a traffic study. \"Mowers, a former Christie campaign staffer who worked with Kelly in early 2013, testified last week that Kelly's office kept a spreadsheet noting what favors mayors had received and, on a scale from 1 to 10, their likelihood of endorsing Christie. Prosecutors say Fort Lee Mayor Mark Sokolich, one of the Democratic mayors who declined to endorse Christie, was the target of the traffic jam scheme in September 2013. Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2010051509_00091621_W", "names": {"Michael Doherty": ["Q10409391", "Q42305796"], "George Savage": ["Q39078808", "Q5544306"]}, "date": "2010-05-15", "url": "http://newsletter.co.uk/news/Call-to-end-council-chiefs39.6296806.jp", "content": "a member of craigavon council has urged ratepayers to lobby against a joint sum of more than £ 200,000 per annum being paid to two temporary senior officers, both employed on a part-time basis. dolores kelly, an sdlp mla for upper bann, said: \"ratepayers should not have to foot the astronomical bill for these two men in this time of austerity.\" the council is meeting next week to decide whether to renew the contracts of interim chief executive <mark>michael doherty</mark> - who is costing the council £ 110,000 plus expenses - and interim director of leisure of services philip lucas, whose costs are £ 80,000 per annum. scotsman mr <mark>doherty</mark> recently retired as chief executive of a district council in scotland, while mr lucas was in charge of leisure services in belfast. the contracts are for commitments that fall short of full-time work: mr <mark>doherty</mark>'s contract is for 180 days a year, while mr lucas works four days a week in craigavon. and the council will be deciding whether to extend their contracts - which are due to end soon - for another few months. mrs kelly said: \"the director of leisure services post should be split amongst other directors to save money and promote internal skills enhancement, while the chief executive of either banbridge or armagh council should take responsibility for craigavon and save our ratepayers money.\" craigavon is due to join the other two councils in rpa (review of public administration) with the creation of the 11 so-called super councils from the current 26 - but it looks as though that will be delayed to 2014 or 2015. \"unionist members of the council want to continue to allow ratepayers' money to be used to pay those in unnecessary senior management positions, while low-paid staff are bearing the brunt of cutbacks.\" i would urge all ratepayers in craigavon to lobby their local councillor to vote against the renewal of these contracts next week, so that we can put an end to this squandering of public money. \"the issue was due to be decided at a special meeting on wednesday night, but with environment minister edwin poots reported to be delaying the reduction of the current 26 councils to 11, the decision was put off until next week. <mark>george savage</mark> - an ulster unionist mla for upper bann - said that the two men had been employed on an interim basis, on the assumption that rpa would happen next year,\" and in that aspect they were fully justified \".\" but if rpa is postponed until 2015, it's a whole new ball game and the posts would have to be re-advertised and filled on a full-time basis, \"he added. a spokeswoman for the council said that the issue was a confidential staffing matter and she could not comment."}]