[{"date": "2015-04-27", "url": "http://www.thecomet.net/inspired_by_the_london_marathon_beginner_runners_can_get_on_their_marks_in_hitchin_1_4050207", "content": "Email this article to a friend To send a link to this page you must be logged in. The programme of classes, supported by North Herts District Council along with England Athletics, will be supervised by friendly instructors who are members of Hitchin Running Club, including project leader Melissa Peacock. The weekly classes will take place every Tuesday evening from May 12 until July 28 at 6.30 pm, meeting at the Walsworth Common play area. The council's <mark>Liz Green</mark> said: \"We'd encourage as many people as possible to try the classes in Hitchin .\" Comments Please log in to leave a comment and share your views with other The Comet visitors. We enable people to post comments with the aim of encouraging open debate. terms and conditions can post comments. These terms and conditions explain our house rules and legal guidelines. Comments are not edited by The Comet staff prior to publication but may be automatically filtered. Not a member yet? Register to create your own unique The Comet account for free. Walk this way and help festival put a spring in Stevenage's step The third annual Stevenage Walking Festival steps out with a crowded calendar of pedestrian possibilities on Saturday. London Marathon 2015: Guinness World Record \"failure' doesn't dampen spirits of Letchworth, Baldock and Stotfold runners A barrier in a Baldock play park has been destroyed by vandals for the second time in five weeks. Man in serious condition after car rolls off A1 (M) near Baldock Services and lands on roof Drug dealing ring from Hitchin, Stevenage and Letchworth jailed for a total of 41 years Man punches woman in the face and tries to steal dog in Stevenage Labour leader Ed Miliband on the campaign trail in Stevenage, with comedian Eddie Izzard in tow", "articleID": "2015042919_00008568_W", "names": {"Liz Green": ["Q3257310", "Q56709371", "Q6660163"]}}, {"date": "2015-05-07", "url": "http://www.pressherald.com/2015/05/07/senate-passes-bipartisan-bill-to-review-iran-nuclear-deal/", "content": "Senate passes bipartisan bill to review Iran nuclear deal WASHINGTON - The Senate muscled its way into President Barack Obama's talks to curb Iran's nuclear program, overwhelmingly backing legislation Thursday that would let Congress review and possibly reject any final deal with Tehran. The vote was 98-1 for the bipartisan bill that would give Congress a say on what could be a historic accord that the United States and five other nations are trying to finalize with Iran, which would get relief from crippling economy penalties. Photo Store → The lone no vote came from freshman Sen. Tom Cotton, R-Ark ., who wants the administration to submit any agreement to the Senate as a treaty. Under the Constitution, that would require approval of two-thirds of the Senate. The House is expected to vote next week on the measure. House Speaker John Boehner, R-Ohio, said in a statement moments after the vote that the \"goal is to stop a bad agreement that could pave the way to a nuclear-armed Iran, set off a regional nuclear arms race, and strengthen and legitimize the government of Iran .\" The U.S. and other nations negotiating with Tehran have long suspected that Iran's nuclear program is secretly aimed at atomic weapons capability. Tehran insists the program is entirely devoted to civilian purposes. The talks resume next week in Vienna, with a target date of June 30 for a final agreement. Senate Majority Leader Mitch McConnell, R-Ky ., said the bill \"offers the best chance for our constituents through the Congress they elect to weigh in on the White House negotiations with Iran .\" Added Sen. Bob Corker, R-Tenn ., chairman of the Foreign Relations Committee: \"No bill. No review .\" The legislation would bar Obama from waiving congressional sanctions for at least 30 days while lawmakers examine any final deal. The bill would stipulate that if senators disapprove of the deal, Obama would lose his current power to waive certain economic penalties Congress has imposed on Iran. The bill would require Congress to pass a resolution of disapproval to reject the deal, an action that Obama almost certainly would veto. Congress then would have to muster votes from two-thirds of each chamber to override the veto. In the House, about 150 Democrats - enough to sustain a veto - wrote the president to express their strong support for the nuclear negotiations with Iran. \"We urge you to stay the course,\" the letter said. \"We must allow our negotiating team the space and time necessary to build on the progress made in the political framework and turn it into a long-term, verifiable agreement .\" The bill took a roller coaster ride to passage. Obama first threatened to veto it. Then he said he would sign it if the measure was free of amendments the White House believed would make continued negotiations with Tehran virtually impossible. It survived a blow from Israeli Prime Minister Benjamin Netanyahu, who stood before Congress in March and warned the U.S. that an emerging nuclear agreement would pave Iran's path to atomic weapons. \"It is a very bad deal. We are better off without it,\" he said in a speech arranged by Republicans. His address aggravated strained relations with Obama and gambled with the long-standing bipartisan congressional support for Israel. A few days later, Cotton and 46 of his GOP colleagues wrote a letter warning Iranian leaders that any deal with Obama could expire when he leaves office in January 2017. Senate Democratic leader <mark>Harry Reid</mark> of Nevada accused the GOP of trying to undermine the commander in chief while empowering the ayatollahs who lead Iran. In April, the Senate Foreign Relations Committee passed a compromise bill on a 19-0 vote. Obama withdrew his veto threat. But Republicans were not done trying to change the bill, drawing up more than 60 amendments. One, from Cotton, would have made any deal contingent on Iran's halting its support of terrorist activities that threaten Americans. Cotton used an unusual Senate procedural move to get his amendment heard. McConnell did not want to see the bill end in tatters, so he acted to end the amendment process and have votes on the legislation. \"It is a virtual certainty that no matter how terrible this deal is, it will go into effect and this legislation is unlikely to stop it,\" said Republican Sen. Ted Cruz of Texas, who is running for president. Another 2016 candidate, Sen. Sen. Marco Rubio, R-Fla ., said the bill puts Congress in a better position than having no say. A campaign pitch for every Republican preference in South Carolina Ferry captain goes all in to save man who fell into Portland Harbor The scoop on Portland's Press Hotel: It's ready to make headlines Two kayakers reported missing near UNE had made it to shore, gone to bed Biddeford council hears calls for accountability on claims of police sex abuse A mother listens to her son's transplanted heart beating in another man Ferry captain goes all in to save man who fell into Portland Harbor The scoop on Portland's Press Hotel: It's ready to make headlines MaineToday Media we value our readers and are committed to growing our community by encouraging you to add to the discussion. To ensure conscientious dialogue we have implemented a strict no-bullying policy. To participate, you must follow our", "articleID": "2015050920_00004547_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}}, {"date": "2015-05-11", "url": "http://theday.com/local/20150508/former-norwich-bulletin-building-sold-for-150000", "content": "Norwich - Mystic businessman <mark>Tim Owens</mark> purchased the four-building former Norwich Bulletin complex on Franklin Street for the \"bargain price\" of $150,000 - less than half the listed sale price, with no liability for environmental cleanup, his attorney said Friday. Attorney William Sweeney of the New London firm TCORS filed the closing transaction paperwork at Norwich City Hall Friday morning. <mark>Owens</mark> purchased the 34,000-square-foot complex at 30-66 Franklin St. under the name Bulletin Building LLC for $150,000 from Gatehouse Media Connecticut Holdings Inc.. The advertised asking price was $325,000. The Bulletin moved out of the complex to leased space downtown a year ago. Sweeney said he also plans to file the required state Transfer Act paperwork with the state Department of Energy and Environmental Protection certifying that the building has an environmental cleanup plan. Gannett Satellite Information Network Inc. - the owner prior to Gatehouse - assumed responsibility for the cost of the environmental cleanup that had plagued the complex for years and made it difficult to market the building. Sweeney and <mark>Robert Mills</mark>, president of the Norwich Community Development Corp., both attributed the low sale price to fears about the extent of the environmental liability. \"I think the reality is there has been a stigma surrounding the property because of the environmental issues,\" Sweeney said Friday. But he said the contamination turned out to be less than anticipated. Only one area beneath a former dry cleaning operation at the corner of Bath and Franklin streets remains to be cleaned. That work is expected to be done this summer. Sweeney, a former Norwich city planner, said he hopes the transaction encourages other business developers to look at Norwich properties and not be scared off by potential contamination. \"Norwich has a lot of contaminated properties people thought were a lost cause,\" Sweeney said. \"But it's not a lost cause if you work through the process .\" <mark>Owens</mark>, owner of the Pizzetta gourmet pizza restaurant in Mystic, said Thursday he plans to convert the complex into a combination of uses, including a business incubator, microbrewery, rooftop bar and assorted retail, artist and restaurant space. <mark>Owens</mark> said he hopes to complete first phase interior renovations and exterior façade improvements in time to move the first businesses into the complex by the end of this year. <mark>Mills</mark> said NCDC officials were \"thrilled\" to work with <mark>Owens</mark> over the past year to complete the transaction and praised his perseverance and excitement about the business opportunities there. <mark>Mills</mark> said <mark>Owens</mark> conveys that excitement to potential tenants as well. Business tenants would qualify for lease rebates through the Norwich downtown revitalization program administered by NCDC. Mother, daughter UConn-Avery Point students celebrate as one graduates", "articleID": "2015051101_00037127_W", "names": {"Robert Mills": ["Q28180932", "Q7347693"], "Tim Owens": ["Q41622515", "Q7804086"]}}, {"date": "2015-05-12", "url": "http://foxnews.com/sports/2015/05/09/lagares-hits-go-ahead-hr-as-mets-edge-phillies", "content": "Philadelphia, PA (SportsNetwork.com) - Juan Lagares clubbed the go-ahead two - run homer in the seventh inning and Buddy Carlyle got the New York Mets out of a bases-loaded jam in the eighth in a 3-2 win over the Philadelphia Phillies. Jonathon Niese (3-2) allowed five hits and a pair of unearned runs over seven innings. Niese had six strikeouts to gain his 10th career win against the Phillies, the most he's had against any club. His single led to Lagares' blast to left on a 1-0 pitch. \"Juan had a great hit there and our defense played outstanding,\" Niese said. Ruben Tejada had a pair of hits and scored once for the Mets, who bounced back from a 3-1 loss Friday to win for the third time in four games. Aaron Harang (3-3), pitching on his 37th birthday, gave up Lagares' first homer of the year. Harang surrendered eight hits over his seven-inning effort. <mark>Carlos Ruiz</mark> doubled in one run, but with the tying run at third in the eighth, he hit a sharp grounder to Tejada at shortstop. That started the inning-ending 6-4-3 double play. \"It was set up, but I thought the shortstop made a good play on Chooch's ball hit hard to the backhand,\" Phillies manager Ryne Sandberg said. New York used three pitchers in that eighth inning. Freddy Galvis doubled off <mark>Carlos Torres</mark> to begin the frame. With one out, Alex Torres came in, but of his nine pitches thrown, eight were balls in walks to pinch-hitter Grady Sizemore and <mark>Cesar Hernandez</mark>. Carlyle then put out the fire when he faced <mark>Ruiz</mark>. Chase Utley ended an 0-for-19 stretch with a pinch-hit single to right field with one out in the home ninth against Jeurys Familia. Pinch-hitter Ryan Howard then flied out to center and Ben Revere hit a slow bouncer toward first and was tagged out to give Familia his 12th save. <mark>Cesar Hernandez</mark> was unable to handle Lucas Duda's bouncer in the fifth, and that scored Tejada with the first run. Revere scored on Jeff Francoeur's sacrifice fly in the sixth. Later in the frame, <mark>Ruiz</mark> grounded a hit down the left-field line to plate Darin Ruf. 1 NFL suspends Patriots' QB <mark>Tom Brady</mark> 4 games for deflated footballs 2 Excerpts from NFL's letters to Patriots, <mark>Brady</mark> 3 Arkansas golfers charged with felony video voyeurism 4 <mark>Brady</mark> gets 4 games; Pats fined, lose draft picks <mark>Donald Trump</mark>, Will Ferrell, Dwight From \"The Office' React To <mark>Tom Brady</mark> Suspension Roger Goodell Knows The <mark>Brady</mark> Punishment Won't Stick, Is Playing It Smart The Verdict Is In: <mark>Tom Brady</mark> Suspended For 4 Games; Patriots Lose Draft Picks, Fined $1 Million", "articleID": "2015051203_00003814_W", "names": {"Carlos Ruiz": ["Q21555320", "Q441052", "Q475730", "Q5042595", "Q5042597", "Q54555383", "Q55281068", "Q9697328"], "Carlos Torres": ["Q10861395", "Q20267761", "Q24703081", "Q25933138", "Q27103459", "Q28672711", "Q2939479", "Q56382789", "Q5642649", "Q5651485", "Q8338403", "Q858621", "Q962202"], "Cesar Hernandez": ["Q13435265", "Q5202564", "Q53104030"], "Donald Trump": ["Q22686", "Q27947481"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}}, {"date": "2015-05-12", "url": "http://ozarksfirst.com/story/d/story/two-police-officers-shot-dead-in-hattiesburg-miss/42082/Inh5a2yPJkC5Hv0YMmpuxQ", "content": "HATTIESBURG, Miss. (CNN)--Two police officers were shot dead in Mississippi late Saturday. It was the first time in 30 years that an officer was killed in the line of duty in Hattiesburg, the mayor said HATTIESBURG, Miss. (CNN)--Two police officers were shot dead in Mississippi late Saturday. It was the first time in 30 years that an officer was killed in the line of duty in Hattiesburg, the mayor said. Officers Benjamin J. Deen, 34, and Liquori Tate, 24, were making a traffic stop when they were shot, Mayor Johnny DuPree said. They were taken to a hospital, but did not survive. \"The men and women who go out every day to protect us, the men and women who go out every day to make sure that we are safe, were turned on tonight,\" DuPree said. Police have apprehended two suspects, Marvin Banks and Curtis Banks, he said. After the shooting, the suspects stole a police vehicle, which they used to flee. It was later found abandoned, according to CNN affiliate WDAM. The two men both have criminal records. Police also took a woman into custody who was with the suspects at the time of the shooting, WDAM reported. They have not said whether she was involved. DuPree told CNN a third suspect was taken into custody, but did not disclose the gender. Deen was named the city's officer of the year in 2012, according to The Clarion-Ledger in Jackson, Mississippi. Tate had recently graduated from the police academy. Deen leaves behind a wife and two children. Tate was not married and had no children, DuPree said. After visiting the crime scene, the mayor went to the hospital, where he tended to family members until early Sunday. \"You have to search for words you say to family members how much we love them; we are here to support them,\" he said. The city is making grief counselors available to the slain men's fellow officers. DuPree vowed that the perpetrators of the attack would face justice. Police in Oxford, Mississippi, sent out condolences in a tweet. \"Both Hattiesburg Police Officers have died. Terrible. Prayers to the entire community and families,\" it read. (<mark>Joe Sutton</mark> and Ben Brumfield, CNN)", "articleID": "2015051215_00031221_W", "names": {"Joe Sutton": ["Q16885980", "Q19560871"]}}]