[{"articleID": "2010091107_00131116_W", "names": {"Mohammed Ali": ["Q16002506", "Q6854083"]}, "date": "2010-09-11", "url": "http://topnews.in/dhobi-ghat-wows-toronto-film-festival-2274236", "content": "toronto, sep 11: kiran rao's \"dhobi ghat,' which premiered at the toronto international film festival (tiff) here friday night in the presence of the whole cast at the city's elgin garden theatres, wowed the audiences with its artistry and fluidity. the film is kiran rao's directorial debut, with her husband aamir khan playing the lead role of a painter (arun living in bhendi bazaar). apart the bollywood couple, monica dogra, who plays the role of nri girl shai, prateik babbar, who plays the role of dhobi boy (zohaib), and kriti malhotra were also on stage. set in the mumbai monsoon season, the plot revolves around shai's feelings for arun and zohaib in the teeming metropolis. a beaming kiran rao introduced the cast to the audience before the start of the film. she said she was immensely pleased with her directorial debut and expected\" dhobi ghat' to do well. reacting to statements that the film was meant more for the global stage, she said indian audiences too welcome such films. it is not the first time that such a film has come out of mumbai, she said. kiran, who also wrote the script, called the story of the film delicate, and said she was pleased with the performance of her cast. recalling her most difficult moments during the shooting, she said filming the crowded eid scene on <mark>mohammed ali</mark> road during ramadan last year was one of those tough moments. she said she had to surround herself with five security guards and aamir had to hide his face under a helmet to reach the shooting spot near the illuminated mosque. for his selection for the lead role, aamir said initially the couple's idea was not to cast him because they thought that his presence will \"overpower\" others. but after a few weeks, he said, they had second thoughts. and kiran put him through usual tests before casting him, he said. amid laugher, the bollywood star said he was so impressed by his wife' script that he fell in love with her all over again after reading it. he said she was very particular about what she wanted from each actor. \"a wonderful film. i cannot believe that kiran is so talented,\" said indo-canadian physician atul tolia who came with his whole family to watch the film. \"it is wonderful to see a new idea, a new director, and a whole new cast. it is so fresh. while watching the film, i felt as if i was reading a gujarati novel. the plot unfolded like literature. i was also impressed by the pace of the film, it flew fluidly,\" tolia told ians. he was also very impressed by prateik babbar, son of the late smita patil, for his role. \"prateik is going to be a new star. you are going to hear a lot about this chap in the future,\" said tolia. (ians)"}, {"articleID": "2010011723_00035696_W", "names": {"David Drummond": ["Q43911871", "Q5233079", "Q57338789"]}, "date": "2010-01-17", "url": "http://pcauthority.com.au/News/164970,us-government-to-issue-complaint-to-china-over-google-hack.aspx", "content": "state department spokesman reveals diplomatic tension between two superpowers. the us government is set to issue a formal complaint to china over its alleged involvement with the hacking attacks revealed by google and several other companies earlier this week. told reporters at a press conference that secretary of state hillary clinton has already spoken this week to chinese foreign minister wang, although he could not confirm whether the google hack was on the agenda on that occasion. \"we will be issuing a formal demarche to the chinese government in beijing on this issue in the coming days, probably early next week,\" he added. \"it will express our concern for this incident and request information from china as to an explanation of how it happened and what they plan to do about it .\" statement on tuesday claiming that it would have to re-evaluate its business operations in china, after it discovered hackers originating in the country had tried to break into its corporate systems in order to monitor the gmail accounts of human rights activists in the region. \"these attacks and the surveillance they have uncovered, combined with the attempts over the past year to further limit free speech on the web, have led us to conclude that we should review the feasibility of our business operations in china,\" wrote <mark>david drummond</mark>, chief legal officer at google. buying a phone in 2010? here's what's big at the ces gadget-fest from tv on your phone, to stunning new android phones, oled screens, faster processors, fancy bluetooth accessories and other things that might even make you re-think your iphone purchase. preview: asus eee top et2203t boasts multitouch support and blu-ray specs asus' latest all-in-one combines a 21.6 in hd touchscreen with blu-ray and some serious entertainment credentials hp's mediasmart server ex490 boasts powerful backup features for home and office sharing my life with linux: day 1 - the daily ups and downs of switching to open source haymarket media. this material may not be published, broadcast, rewritten or redistributed in any form without prior authorisation."}, {"articleID": "2018010810_00580725_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2018-01-08", "url": "http://www.standard.net.au/story/5156730/pregnant-miranda-kerr-leads-stars-at-globes-after-party/?cs=36", "content": "It was billed as a Golden Globes unlike any other in history but once it was over, the stars still partied the night away. Led by Australian-born Miranda Kerr, pregnant with her second child, a host of celebrities not at the awards flocked to various after parties - many of them also wearing the all-black dress code implemented as part of the Time's Up initiative. Kerr, whose baby is her first with second husband Evan Spiegel and a sibling to Flynn, 7, was making her first red carpet appearance since the announcement. Also flaunting her news - and a $2-million ring - was Paris Hilton, who recently became engaged to Chris Zylka. Hilton, at the HBO party, sported a black lace dress that covered her fingertips, allowing the massive diamond to pop. Baby on board with #TimesUp...Miranda Kerr. Photo: CHRIS PIZZELLO But possibly the most poignant reminder of what the Golden Globes was about - solidarity, women speaking out on abuse and all forms of mistreatment, the \"enough is enough\" vibe that has blanketed Hollywood since the allegations surrounding Hervey Weinstein - was the arrival of Ashley Judd and Selma Hayek, two of Weinstein's accusers, arm in arm. At the @ instylemagazine party...#GirlPower @ mariahcarey @ ashley_judd En la fiesta de #Instyle A post shared by Salma Hayek Pinault (@ salmahayek) on Jan 7, 2018 at 11:28 pm PST The pair even shared photos of themselves getting ready for the event together, with Hayek posting to Instagram: \"With my date @ ashley_judd heading to the #GoldenGlobes, as usual we are kind of tardy, even though #Time\" sUp. \"Absent from the parties was actress Rose McGowan, who publicly disapproved of the call to wear black and called out\" Hollywood fakery \"on Twitter. And not one of those fancy people wearing black to honor our rapes would have lifted a finger had it not been so. I have no time for Hollywood fakery, but you I love,. @ AsiaArgento #RoseArmy https: //t.co/9e0938y5sI??? rose mcgowan (@ rosemcgowan) January 8, 2018 McGowan was the first high-profile actress to go public with her claims of abuse at the hands of Weinstein, which was first exposed in the New York Times three months ago. Since then, a flood of women have come forward with their own stories of abuse against Hollywood's mighty, which has also led to the inception of Time's Up, a coalition of 300 women in entertainment who have formed a fighting fund and have vowed to take widespread action against sexual and other forms of abuse and degradation of women. Paris Hilton arrives at the HBO Golden Globes afterparty at the <mark>Beverly</mark> Hilton Hotel on Sunday, Jan. 7, 2018, in <mark>Beverly Hills</mark>, Calif. (Photo by Richard Shotwell/Invision/AP) Photo: Richard Shotwell This story Pregnant Miranda Kerr leads stars at Globes after party first appeared on The Sydney Morning Herald. facebook SHARE twitter TWEET email whatsapp"}, {"articleID": "2020030522_00169586_W", "names": {"Carlos Correa": ["Q2754588", "Q57055498", "Q58499542", "Q82518", "Q9696967"], "George Springer": ["Q1508274", "Q5544750"]}, "date": "2020-03-05", "url": "https://www.bostonglobe.com/2020/03/05/sports/astros-left-their-stars-home/", "content": "FORT MYERS, Fla.--The villains didn't show. Yet no one among the sellout crowd of 9,472 Thursday at JetBlue Park for the first Red Sox-Astros encounter of the spring seemed to mind. When the Red Sox clubhouse opened at 8 a.m., the lineup cards for both teams were posted just inside the door. Familiar names filled out the Red Sox' side--Xander Bogaerts (at shortstop for the first time this spring), J.D. Martinez, Rafael Devers. It was not far from the lineup they'll wield on Opening Day March 26 in Toronto. The Astros' side was a different matter. Manager Dusty Baker's batting order included relative obscurities with the last names Dawson (Ronnie, not Andre), Stubbs (Garrett, not Franklin or Drew), and Mayfield (Jack, definitely not Baker). Advertisement Alex Bregman did not make the two-plus-hour trip from the Astros' camp in Kissimmee. Neither did Jose Altuve, <mark>Carlos Correa</mark>, or <mark>George Springer</mark>. There was not a single Astro that baseball-reference. com considered a starter from last year's team. Aledmys Diaz, who had 247 plate appearances last year as <mark>Correa</mark>'s understudy, was the most experienced Astro in the lineup. The entire lineup combined for 640 plate appearances in the majors last season, or 50 fewer than Bregman alone. The most notable member of the champion 2017 Astros to put in an appearance at JetBlue Thursday was pitcher Collin McHugh, who stopped in to sign a one-year contract with the Red Sox. The absence of any Astro with legitimate name recognition was naturally a cause of suspicion given the events of the offseason. The Astros were busted in a sign-stealing scandal that cost general manager Jeff Luhnow and manager A.J. Hinch their jobs and has led many fans to put a mental asterisk on their 2017 World Series title. The collateral damage reached Boston, too, with former Astros bench coach Alex Cora losing his managerial job with the Red Sox for his role as a mastermind of the Astros' cheating. The Red Sox, accused of a sign-stealing scheme of their own during Cora's tenure, are still waiting to learn the consequences. Advertisement For now, the Astros are the sole wearers of the black hats, baseball's bad guys, the sport's most collectively disliked franchise in recent memory. They've been booed lustily in opposing territory this spring, and seven Houston batters were hit by pitches through the first week of spring training games. Perhaps it's wise for preservation purposes to keep theelite players away from road crowds for a while. But manager Dusty Baker, Hinch's replacement and a calming presence who each day must face questions about a scandal he had nothing to do with, said he left his stars home for case-by-case reasons. \"You've got Altuve who is sick,\" said Baker, holding court in the Astros' dugout two hours before the game. \"You've got [Yordan] Alvarez who is dealing with his knee. Bregman and Altuve went to Lakeland [to play the Tigers Wednesday]. I try to play them every other day. So no, it's not out of the ordinary at all .\" Baker did acknowledge that his roster was a little short of recognizable major league talent. Teams are supposed to bring a minimum of four regulars to each road game. \"The hardest part is having four regulars that can go, because we don't have a utility-type team,\" said Baker. \"We were told Diaz didn't count, and he has four years in the big leagues .\" Advertisement Baker was asked who actually does count. \"Bregman,\" he deadpanned. \"Altuve...\"So this starless sky of a lineup he brought with him had nothing to do with avoiding a potentially loud and aggravated reception from Boston fans?\" Hell, no, \"said Baker .\" That was the furthest thing from my mind. \"Perhaps it was because all of the familiar names and suspected trash-can bangers were not in attendance, but it turned out that there was no obvious negative response to the Astros anyway. There were no boo birds among the snowbirds. No hoots or verbal jabs were aimed at leadoff hitter Myles Straw when he dug in. A foul pole to foul pole walk through the concourse in the first inning revealed not a single anti-Astros sign in the crowd. Signs are not technically prohibited in JetBlue's ballpark rules (don't try to bring in beach balls, flag poles, lawn chairs, firearms, or knives of any size, however). Three ticket takers working Gate B told me that they hadn't seen a single sign all day. Of course, maybe Red Sox fans should be hesitant to let the Astros have it quite yet since any punishment for their own team's alleged sign-stealing scheme is pending, and has been pending for a somewhat alarming amount of time. To totally hate on the Astros before knowing your own team's consequences would be akin to playing baseball in a glass house, something Baker subtly noted before the game. Advertisement\" Better be careful of the reception they're giving, \"he said .\" It could be here, too. \"Chad Finn can be reached at chad.finn @ globe.com. Follow him on Twitter @ GlobeChadFinn."}, {"articleID": "2016120422_00982886_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-12-04", "url": "http://slog.thestranger.com/slog/2016/12/04/24727147/celebration-and-tears-at-standing-rock-as-obama-administration-halts-plans-to-drill-under-the-missouri-river#more", "content": "Celebration and Tears at Standing Rock as Obama Administration Halts Plans to Drill Under the Missouri River by Sydney Brownstone • Dec 4, 2016 at 2:27 pm Tweet Christinia Eala, 70, told me back in September that she took a stand against the pipeline for her grandchildren. Tentatively, it looks like Eala and her fellow water protectors may have won. Today the US Army Corps of Engineers announced in a press release that it is denying a permit builders of the Dakota Access pipeline need in order go forward with their plans to drill under the Missouri River. In response to the decision, Standing Rock Sioux chairman Dave Archambault II has issued this statement: \"This is something that will go down in history and I know that it's a blessing,\" Archambault said. Activists who have been camping out in the cold for months are ecstatic. Benalex Dupris, a film producer I met at camp and a member of the Colville Confederated Tribes from Washington State, described the scene to me like this: The scene at camp is electric, with eagle feathers on top hats, army jackets that don't camouflage from the snow, and wild ass Indians war hooping at each other non stop. Everyone is singing or crying, and in the distance it's either cries of \"Mni Wiconi\" or \"black snake killa .\" Brian Cladoosby, chairman of the Swinomish Indian Tribal Community and president of the National Congress of American Indians, put out a statement thanking the Obama administration for the Army Corps' decision. US Secretary of the Interior Sally Jewell also released a statement saying that there would be \"an in-depth evaluation of alternative routes for the pipeline and a closer look at potential impacts .\" The Army's Assistant Secretary for Civil Works, Jo-Ellen Darcy, announced that alternative routes would be considered through an Environmental Impact Statement, a process that takes months and will incorporate public and tribal input. \"Although we have had continuing discussion and exchanges of new information with the Standing Rock Sioux and Dakota Access, it's clear that there's more work to do,\" Darcy said. Even though the Army Corps of Engineers has denied the Dakota Access pipeline project the permit to drill under Lake Oahe, a man-made reservoir on the Missouri River, much of the construction of the Dakota Access pipeline has already been completed. Dupris, the filmmaker I quoted above, says people are celebrating a \"cautious victory .\" <mark>Donald Trump</mark> has expressed his support for the pipeline project, and it remains to be seen whether a <mark>Trump</mark> administration might just re-issue a permit for a pipeline that impacts tribal rights and access to clean drinking water. \"We hope that Kelcey Warren, Governor Dalrymple, and the incoming <mark>Trump</mark> administration respect this decision and understand the complex process that led us to this point,\" Standing Rock Sioux chairman Dave Archambault II said in a statement. Update: Here's the full statement from Archambault: Today, the U.S. Army Corps of Engineers announced that it will not be granting the easement to cross Lake Oahe for the proposed Dakota Access Pipeline. Instead, the Corps will be undertaking an environmental impact statement to look at possible alternative routes. We wholeheartedly support the decision of the administration and commend with the utmost gratitude the courage it took on the part of President Obama, the Army Corps, the Department of Justice and the Department of the Interior to take steps to correct the course of history and to do the right thing. The Standing Rock Sioux Tribe and all of Indian Country will be forever grateful to the Obama Administration for this historic decision. We want to thank everyone who played a role in advocating for this cause. We thank the tribal youth who initiated this movement. We thank the millions of people around the globe who expressed support for our cause. We thank the thousands of people who came to the camps to support us, and the tens of thousands who donated time, talent, and money to our efforts to stand against this pipeline in the name of protecting our water. We especially thank all of the other tribal nations and jurisdictions who stood in solidarity with us, and we stand ready to stand with you if and when your people are in need. Throughout this effort I have stressed the importance of acting at all times in a peaceful and prayerful manner--and that is how we will respond to this decision. With this decision we look forward to being able to return home and spend the winter with our families and loved ones, many of whom have sacrificed as well. We look forward to celebrating in wopila, in thanks, in the coming days. We hope that Kelcey Warren, Governor Dalrymple, and the incoming <mark>Trump</mark> administration respect this decision and understand the complex process that led us to this point. When it comes to infrastructure development in Indian Country and with respect to treaty lands, we must strive to work together to reach decisions that reflect the multifaceted considerations of tribes. Treaties are paramount law and must be respected, and we welcome dialogue on how to continue to honor that moving forward. We are not opposed to energy independence, economic development, or national security concerns but we must ensure that these decisions are made with the considerations of our Indigenous peoples. To our local law enforcement, I hope that we can work together to heal our relationship as we all work to protect the lives and safety of our people. I recognize the extreme stress that the situation caused and look forward to a future that reflects more mutual understanding and respect. Again, we are deeply appreciative that the Obama Administration took the time and effort to genuinely consider the broad spectrum of tribal concerns. In a system that has continuously been stacked against us from every angle, it took tremendous courage to take a new approach to our nation-to-nation relationship, and we will be forever grateful."}, {"articleID": "2012032602_00064032_W", "names": {"Michael Mann": ["Q1425193", "Q1827335", "Q1928511", "Q270097", "Q30276452", "Q633081", "Q6832490"], "Walter White": ["Q59196219", "Q7966404"]}, "date": "2012-03-26", "url": "http://hitfix.com/blogs/whats-alan-watching/posts/interview-luck-creator-david-milch-on-the-series-premature-end", "content": "interview: \"luck' creator david milch on the series' premature end\" luck \"suggesting creator david milch had a premonition that the series would be abruptly canceled due to the third horse death during production, milch told me in an interview on friday that he never had it in his mind that this would be a series finale. (you can read my finale review here .) in fact, if the ultimate decision-making power on this fell in milch's hands, the show would have continued, though he says he understands and supports what hbo chose to do. instead, it became the third milch series that hbo has canceled before he was finished telling his story, following\" deadwood \"(and he had some illuminating things to say on that subject) and\" john from cincinnati. \"because my old partner matt zoller seitz did such a thorough job interviewing milch and <mark>michael mann</mark> about what exactly happened to the horse, the safety precautions the show took, and about allegations that the horses were mistreated, i didn't go over that ground again. i highly recommend reading matt's interview before this one. and if you want to know even more details of the approach team\" luck \"took to horse safety, i've been given a copy of the show's official safety protocols, plus this note from milch and <mark>mann</mark>: here are luck's protocols and safety procedures. they were stricter than anywhere in the equine world and were in place during the production of luck's 2,500 horse/runs at santa anita. this is in response to the distortions and fabrications stated by peta about the care of horses on the luck production and on behalf of the horse trainers, wranglers, exercise riders, veterinarians and grooms who - with concern and caring - looked after those horses download the safety protocols document here. in the 15 + years i've been interviewing milch, i've never heard him as emotional as he sounded on friday. i'm not sure it quite comes across in text, but the best way i can put it is this: like the college professor he used to be, milch is generally expansive with his commentary, sometimes to a fault, where here he kept his answers brief because it wasn't an easy subject to discuss. this project is something he's been hoping to make for a very long time, a marriage of his vocation and his avocation, and not only did it disappear out from under him in a snap, but he's now being accused of mistreating horses, when he's had a deep love for horses going back to when he was a little boy. there was a lot of pain and sadness - but not, i should say, anger, as he understands why this happened - in his voice as we spoke about the decision to halt production permanently, the differences between this and the\" deadwood \"finale (including a fact about that episode that i never knew before), what might have come later, and a whole lot more, all coming up just as soon as i'm an airport profiler...what were the conversations like that day, between the time when production was suspended and when the decision was made,\" alright, we can't go forward anymore \"? angry incredulity. who was it who ultimately made that call? was it you and <mark>michael</mark>? was it hbo? it was hbo, definitively. there was back and forth about it, but their feeling was so clearly that the situation was untenable, that there was really no protracted dispute. we were presented with an accomplished fact. and i don't say that with any resentment. they made the decision they felt they had to make. but had it been up to you, would that have been the decision? no, i guess i would have continued. in no way was there any irresponsibility or failure of care in the treatment of those horses. i satisfied myself with that repeatedly. i don't know if you're familiar with the details of how this horse died - i read the interview you and <mark>michael</mark> did with matt seitz, so i know a little. this was an incident equivalent to you walking down the street, being frightened by something, taking a misstep and falling. the horse was not being asked to do anything remotely dangerous or that would put him in jeopardy. in any case, this was something that generated its own momentum and fed off itself. corporately, i absolutely understand what hbo felt were the necessities of its position. but substantively, there was no dereliction at all on our part. one of the questions i've heard asked in the wake of the cancellation was whether you could have continued the show without filming new racing scenes, whether using cgi horses or some kind of stock footage. that was a possibility that was examined. the horses are of the essence of the piece. we really weren't doing anything - you need the horses around. it's like asking an actor to act in company with a cartoon. long-term, it would've been an erosion of the credibility of the material. given your passion for this world and how long it took you to get this on the air, how does it feel to have it go away this quickly? it's a sick feeling. you realize, what swearengen used to say,\" if you want to hear god laugh, tell him your plans. \"we're creatures of forces so other than and more powerful than we are, that it's an illustion to believe anything else, and it's an occasion for gratitude wen you're able to sustain your endeavor and fate and experience accommodates it. i say that with no bitterness at all towards hbo. as i say, i think they were in an untenable position. how do you mean? just the bad publicity? yeah. anytime something happened, as it would inevitably have happened, they were going to get lambasted again. corporately, they just can't withstand that. i watched the finale again yesterday, and there are a number of moments and lines that feel prophetic - like marcus saying,\" today's the day they take it all away from us, \"or ace's speech at the end - like they were designed to be in a series finale. and that's always how i've viewed the last\" deadwood \"episode; like it was a series finale without being intended as one. were you ever thinking as you wrote this that there would be a chance you wouldn't get to do more? no, there was no sense of that on my part. by way of contrast, i absolutely knew when i was writing the last\" deadwood \"that it would be the last, and i wrote it intending it as the finale. interesting. i had never heard that before. that's the case. i was trying - the last images of swearengen scrubbing the bloodstain and saying\" wants me to tell him something pretty, \"that was as close as i felt i could come to a concluding speech. so you knew even at that point in production that hbo was not going to go forward? yes, i did know that. how did the episode hold up for you? yeah. (pause) we would have found our stride. i don't think that we had conclusively, but the materials were moving in that direction. it was too bad. it was too bad. what do you think were some of the things that needed to be improved? or what were the parts of the show where you felt you were close to that direction? the extent to which the character of bernstein was living in self-deception was in the process of being revealed. as he encountered that fact and lived into the necessities of his situation, i think he was going to become a more transitive character. and that was very much in the process of being realized. but i try not to think about it too much. i interviewed milch and <mark>mann</mark> at press tour in january, i asked milch whether ace and <mark>walter</mark> never sharing any scenes together in the first season was by design, or if - like much of his work - things just turned out that way. he responded,\" it wasn't planned, but these are characters who have not discovered themselves as yet such as to make their intersection fruitful. they come together right at the beginning of the second season and it is every bit as provisional and tentative a coming together as you would expect, but these are both you know. you know dickens used the expression \"mind - forged manacles .\" these are isolates of one kind and another and they have a civil exchange with each other, but to expect more from them would be unrealistic. they have to find more of themselves first. \"which leads us to this ...) at the end of the interview in january, you and i spoke about how ace and <mark>walter</mark> would come together at the start of the second season. looking back, ace's story is largely separate from everyone else's. was that something that you realized as you were going on that maybe he was too far apart from the rest of the world? yes. i agree with that. it assumed a little bit too much of the viewer, i think. since we're not going to see it play out, what exactly was ace's plan in regards to mike? the best explanation i've seen was from one of my commenters, who suggests that ace wants mike to steal the casino deal out from under him, and that mike will go to prison as a result because it's crooked. is that it? yeah, that's pretty close. when you compress it, invariably you distort it. you obviously have to do what you think is appropriate, but my own preference is not to linger too much on the would have beens of this show. okay, then let's look back on what was instead. in these nine episodes that you were able to make, what do you feel were the strengths of it? what are some scenes you would point to as the show you had in your head all these years? that's a good question. everything that demonstrates the human capacity for perseverance and self-deception simultaneously. those are the scenes that i like. i recall with affection so many of the scenes with the degenerates and that connection. and i enjoyed very much writing the scenes between gus and bernstein. in some ways, i felt that those two sets of relationships mirrored each other. watching the show, it really did feel like your heart was particularly in the scenes with the four degenerates. that's right. if i were to point to a favorite scene, i guess it would be the niagara falls scene, where they were doing the exegesis of niagara fall as opposed to niagara falls, and what the might possibly mean. now that this is done, are you moving full-force onto the william faulkner project? yes. we were just working on the concluding section of\" light in august \"when you called. i had the privilege of working on that with my daughter, olivia. so it's a compounded pleasure. i'm hopeful that hbo will be receptive. i have no reason to think they won't be. this is the third time now you've done a show for them and the third time it's ended before you were intending it to end. are you still okay with the relationship? absolutely. each set of circumstances was unique. you'll have to ask them whether they are (option 1 comment instantly as a guest it's not a cliffhanger. there were places the story could have gone in a fourth season, but no one's fate was hanging in the balance, and most of the stories of the third season came to a close. even though i never watched it myself - horse racing is not my thing - it's a real shame such a talented writer lost his series under such circumstances, because of distortions from a typically hypocritical peta, who put to death about 85% of the animals arriving at their shelters, btw - whereas luck (darkly ironic name, given the series had none) was just the victim of a sad accident. hope milch's next project goes wonderfully for him .\" good wife': matthew perry on his \"strictly sexual' relationship with alicia florrick novak djokovic on '60 minutes':' [the war] made us tougher...more hungry for the success' weekend box office: the hunger games opens with $155 million--why it's good news for the industry and the moviegoer about this blog all through his childhood, alan sepinwall's relatives told his parents,\" all that boy does is watch television! how's he going to make a living doing that? \"his career as a tv critic has been 15 years and counting of his attempt to answer their concerns .\" what's alan watching \"is a blog whose title is self-explanatory: alan watches tv shows, then writes about what he watched. he can be reached at sepinwall @ hitfix.com interview:\" luck' creator david milch on the series' premature end would he have made the call to cancel? and how does this compare to the \"deadwood' finale? the horses and their owners thrill in their last day in the sun can <mark>walter white</mark> take out samcro? can sterling archer defeat phil dunphy?"}, {"articleID": "2018020208_00745096_W", "names": {"L. Smith": ["Q16885749", "Q27597449", "Q54911965"]}, "date": "2018-02-02", "url": "https://www.pr.com/press-release/743175", "content": "Receive press releases from Shero Comics: By Email RSS Feeds: The Comic Book World Marvels as a Black Shero Emerges with New Release in Graphic Novel Series, Rayven Choi Rayven Choi book series creates a historic moment, just in time for Black History Month. Los Angeles, CA, February 02, 2018--(PR.com)--This February, Marvel's \"Black Panther\" won't be the only comic book hero making black history when award-winning writer, Shequeta <mark>L. Smith</mark>, releases the third installment of her female empowered graphic novel series, \"Rayven Choi,\" on February 7, 2018. The graphic novel series is centered on the story of Rayven Choi, a young African-American woman who witnesses the murder of her parents by a hit man. Choi finds herself growing up in Seoul, Korea where she's adopted and is influenced by the local culture. As an adult, Choi returns to America to uncover the truth behind her parents' murders with the intention of finding the hit man who destroyed her family. The first two books, published under the \"Shero Comics\" indie imprint, have quickly gained popularity amongst seasoned comic book fans. The books have been highlighted in several popular blogs, podcasts, and newspapers and were most notably featured in Publisher's Weekly under the evocative headline: \"The World Needs More Sheroes .\" <mark>Smith</mark>, who is based in Los Angeles, recently completed a lengthy, multi-city, \"Year of Rayven Choi,\" book tour in 2017 that included multiple stops on military bases. Following the release of Rayven Choi Chapter 3, <mark>Smith</mark> will be heading across the pond with her \"Shero Universe\" book tour that will feature stops in South Korea, Mexico, and Canada. Additionally, all three books in the series have been translated into Spanish and Hangul (Korean), with upcoming scheduled releases in South Korea and Mexico - something that <mark>Smith</mark> hopes will help to further reach the international audience she's been targeting. \"I created Rayven Choi with the idea that I could present a black female character that the entire world could relate to. So it's extremely exciting to not only be releasing the third book in the series but to personally introduce Rayven to the world with the Shero Universe book tour,\" said <mark>Smith</mark>. Rayven Choi Chapter 3 will be available as an eBook on Amazon Kindle, Comixology, Barnes & Noble Nook, Kobo, and iTunes. Physical copies will be on sale on the Shero Comics webstore and at several brick and mortar stores in Los Angeles, Chicago, North Carolina, and Florida. For more information on <mark>Smith</mark> or the Rayven Choi series, please visit www.sherocomics.comA bout Shequeta <mark>L.</mark> SmithShequeta <mark>L. Smith</mark> is a writer and filmmaker located in Los Angeles, California. <mark>Smith</mark> recently beat more than 5,000 entrants to become the only individual female director, of the Top 20 finalists, in HBO's Project Greenlight. After her success with the project, <mark>Smith</mark> decided to adapt her award-winning screenplay, Rayven Choi, into a graphic novel series. Additionally, she shot an innovative 14-minute short film based on the first three books in the series. For more information on Shequeta <mark>L. Smith</mark> and her company, Shero Comics, visit www.sherocomics.com Contact Information"}, {"articleID": "2017122415_00366473_W", "names": {"John Francis": ["Q22590", "Q51077505", "Q56597700", "Q6233853", "Q6233855", "Q6233857", "Q6233859"], "John Mason": ["Q14945665", "Q1700987", "Q21077155", "Q21597927", "Q25344506", "Q27925051", "Q53953104", "Q6247048", "Q6247051", "Q6247057", "Q6247072", "Q6247074"]}, "date": "2017-12-24", "url": "http://www.christianpost.com/news/10-christmas-carols-everyone-should-know-210556/", "content": "Subscribe to the Voices Newsletter Engaging views and analysis from outside contributors on the issues affecting society and faith today. CP VOICES do not necessarily reflect the views of The Christian Post. Opinions expressed are solely those of the author (s). 10 Christmas Carols Everyone Should Know So this Christmas, how can we truly be present and not just buy presents? Sun 24 Dec 2017 10:18 EST Expand | Collapse REUTERS/Kevin Coombs Hustle. Bustle. It's all too easy to look up at the end of December and--poof--like excess glitter in the floor that fell from some cheap ornament, the moment gets vacuumed up or packed away for next year like another decoration. So this Christmas, how can we truly be present and not just buy presents? The answer is surprisingly found in the most fundamental of places--in singing traditional carols together. Redemption drew a baby breath that first chilly Christmas night, offering eternal breath to a forlorn world dying to be rescued. And yet even before Jesus lay snuggled up in the manger, the miraculous story of rescue was already being sung about. Mary sang about Him in the Magnificat (Luke 1:46 -51). Zechariah sang about Him in the Benedictus (Luke 1:68 -79). And of course, on the night of His birth, the skies over Shepherds' Field became a vertical stage for hosts of choiring angels. We have literally been created, compelled and commanded to sing, thus it's no surprise that the oldest Christmas traditions are the masterpieces of the hymns: the carols. Our sixth annual Christmas event--Sing! An Irish Christmas Tour--features ten timeless hymns none of us should ever forget. 1. \"Hark! The Herald Angels Sing\" is one of over 6,000 hymns penned by Charles Wesley, who included it in his 1739 Methodist hymnal. It was later set to music by Felix Mendelssohn, which added dashing majesty to the deeply theological truth of the words. This is among our richest hymns in terms of doctrine, but it got off to a bumpy start. Wesley's first line originally said, \"Hark, How All the Welkin Rings .\" The word \"welkin\" meant \"the vault of heaven .\" Evangelist George Whitefield did us all a favor by changing the words to \"Hark! The Herald Angels Sing .\" We have finished the first half of every Irish Christmas concert with a celebratory arrangement of this song, including an Irish reel and cultural Irish dance, which I suspect would have pleased neither Wesley nor Mendelssohn! 2. \"Come Thou Long Expected Jesus\" is another carol by Charles Wesley, appearing in his book of 18 Christmas songs in 1745. If I had to name my three favorite carols, this would definitely be one of them. In its advent or its Old Testament context, imagine the centuries of waiting, longing and weeping coming to their fruition when people--and indeed all of us today in the chaos and emotion that is Christmas--can find our ultimate supernatural rest in Christ. Israel's strength and consolation, Hope of all the earth thou art; Dear desire of every nation, Joy of every longing heart. I can hardly get through this one without crying. 3. \"O Come, All Ye Faithful\" is a Christmas call to worship, mostly likely written by <mark>John Francis</mark> Wade, a catholic artist who created beautiful manuscripts decorated with exquisite floral images. His hymn, Adeste Fidelis, remained a Latin masterpiece for a hundred years before being translated into English by Rev. Frederick Oakeley. For congregational singing, especially when trying to teach harmony or when singing acapella, this carol sings beautifully, which is why it is has often also been a selection to finish our Christmas concerts. 4. is among our most plaintive carols, partly because of the haunting melody by Gustav Holst. The words came from the pen of the English poet, Christina Rossetti, who was born in London in December, 1830. A gifted writer, she dictated her first story to her mother before she was old enough to read and write. She was also lauded as the most beloved poet of her generation. Her hymn, \"A Christmas Carol,\" appeared in the January issue of Scribner's Monthly in 1872, and was later set to music under the title, \"In the Bleak Midwinter .\" The last stanza has appeared on thousands of Christmas cards: \"What can I give Him, poor as I am? / If I were a Shepherd I would bring Him a lamb; / If I were a Wise Man I would do my part, / Yet what I can I give Him: give my heart .\" We have edited this carol and added Dvorak's New World Symphony melody to link it to Simeon's song, the benedictus, which has proved an effective moment of dedication in our Christmas events. \"In the Bleak Midwinter\" 5. with its triumph cadence and rousing spirit was written by the man who is frequently called the \"Father of the English Hymn,\" Isaac Watts. It was published a 1719 hymnal in which Watts translated, interpreted, and paraphrased the Old Testament book of Psalms, overlaying them with the truths of the Gospel. He called the hymnal, The Psalms of David Imitated in the Language of the New Testament. \"I have rather expressed myself as I may suppose David would have done if he lived in the days of Christianity,\" said Watts. His hymn, \"Joy to the World,\" wasn't originally a Christmas hymn, but history has embedded it into our holiday traditions. \"Joy to the World\" 6. \"O Come, O Come Emmanuel\" is a medieval Latin hymn dating from the 800s. It was one of a series of antiphons that were sung every December, and it isn't hard to imagine the mystic beauty of this hymn echoing off the walls of remote monasteries during the Middle Ages. This particular antiphon was discovered by an English minister and musician named <mark>John Mason</mark> Neale, who rendered it into English and published it in 1851. 7. \"Joy Has Dawned\" is a hymn Stuart Townend and I wrote back in 2004 as part of the Apostles Creed collection we put together following the introduction of In Christ Alone. It takes us through the Christmas story, explaining much of the symbolism, and has been a helpful hymn for both children and adults. Stuart wanted to draw out parts of the Christmas story, such as the gifts of the Magi, that aren't particularly present in other Christmas hymns and demonstrate how those elements are connected to the gospel story and present throughout. Melodically, we wanted to give this carol the same fit and feel you might expect from classic Christmas songs you sang growing up in church so there would be an element of familiarity the first time you sang it. If you are considering using this with your congregation, we often find it helpful to combine this with a familiar hymn such as angels \"We Have Heard On High .\" 8. \"Angels we have heard on High\" is one of the most joyful and well-written choruses ever composed. The lyrical journey, which sweeps from \"Angels we have heard on high sweetly singing o'er the plain\" to the ending lyric, \"Gloria, in excelsis Deo,\" shines a light on the reality of incarnation in a way that refreshes the soul each time you sing it. 9. \"O Little Town of Bethlehem\" was inspired by a visit to Bethlehem by the American preacher, Phillips Brooks. For the 1867 Christmas worship services at Philadelphia's Holy Trinity Church, Brooks wanted to write a carol for his children's choir. Recalling his visit to the birthplace of Jesus, Brooks wrote the words for \"O Little Town of Bethlehem\" and handed them to the church's worship leader, Lewis Redner, who composed the melody. It was first sung by a group of six Sunday School teachers and thirty-six children. 10. \"Once is Royal David's City\" might be the least known of these 10 carols, but we mustn't lose its message or music. Cecil Frances Alexander was a pastor's wife whose poetry was much better known than her husband's sermons. She published this carol in her hymnbook for children in 1848. She's also the author of the children's hymn, \"All Things Bright and Beautiful .\" How interesting it is, then, that many consider her works too deep to sing in adult congregations today. The famous festival of lessons and carols service at King's College in Cambridge opens every year with this carol, where a boy soprano (nominated that day!) opens the service that is televised around the world with verse one as a solo. If ever we needed empirical evidence that the Irish actually did save civilization, this may actually be it. How remarkable that every December the greatest themes of the Gospel are carried by the winds, through the malls, into hotels and restaurants and stores and churches as we hear, play, and most importantly, sing the carols of Christmas! They express our highest Christian worship, sharing joy with the world in the bleak midwinter. They remind us that hope has dawned in the little town of Bethlehem, in Royal David's city, and we should all join the triumph of the skies. O come, let us adore Him--Christ the Lord! Engaging views and analysis from outside contributors on the issues affecting society and faith today. CP VOICES do not necessarily reflect the views of The Christian Post. Opinions expressed are solely those of the author (s)."}, {"articleID": "2018123110_00280711_W", "names": {"Jitendra Singh": ["Q24005532", "Q44749762", "Q6203273", "Q6203277"], "Kamal Nath": ["Q1287413", "Q57327046"]}, "date": "2018-12-31", "url": "http://aninews.in/videos/national/agustawestland-case-sonia-rahul-gandhi-never-interfered-deals-procurement-says-ak-antony/", "content": "AgustaWestland case: Sonia & Rahul Gandhi never interfered in deals & procurement, says AK Antony Updated: 0 min ago IST New Delhi, Dec 31 (ANI): Speaking on the AgustaWestland case, former Defence Minister AK Antony said, \"AgustaWestland took place in my tenure. I would like to say, categorically, that Sonia Gandhi and Rahul Gandhi never interfered in deals and procurement. AgustaWestland was selected after evaluation by team of officials .\" He added that the moment report came from Italy that there is corruption in this case, he only ordered CBI enquiry, not this government. Share Top Videos Updated: 3 weeks, 5 days ago IST India vs Australia: Virat Kohli, Tim Paine pose with Border--Gavaskar trophy Updated: 1 month ago IST Trump blames Schwarzenegger for The Apprentice's failure to win Emmy Updated: 2 months, 3 weeks ago IST Deepika Padukone to play acid attack survivor for Meghna Gulzar's next Updated: 1 year ago IST Watch: Rahul Gandhi takes charge as Congress President Updated: 1 year, 3 months ago IST Operation \"All-Out' is a success, will continue it to bring peace: Lt Gen J.S. Sandhu Updated: 1 year, 3 months ago IST Cooperatives can change demographics of our state: CM Raman Singh Related Video Updated: 0 min ago IST AgustaWestland case: Sonia & Rahul Gandhi never interfered in deals & procurement, says AK Antony New Delhi, Dec 31 (ANI): Speaking on the AgustaWestland case, former Defence Minister AK Antony said,\" AgustaWestland took place in my tenure. I.. . Updated: 1 min ago IST Security forces free to initiate operations as per ground reality: <mark>Jitendra Singh</mark> on Mufti's warning New Delhi/Pulwama (J & K), Dec 31 (ANI): Peoples Democratic Party (PDP) president Mehbooba Mufti paid a visit to a suspected terrorist's sister in...Updated: 45 min ago IST Triple Talaq Bill: Opposition parties in Rajya Sabha will oppose the bill, says Kharge New Delhi, Dec 31 (ANI): Senior Congress leader Mallikarjun Kharge is confident that the Triple Talaq Bill set to be tabled before Rajya Sabha...Updated: 50 min ago IST 1984 anti-Sikh riots: Today Sajjan Kumar is going to his right place, says eyewitness Amritsar (Punjab), Dec 31 (ANI): Bibi Jagdish Kaur, family member of victims and a key eyewitness to the 1984 anti-Sikh riots expressed...Updated: 2 hours, 4 min ago IST Triple Talaq Bill: BJP is entering our houses, says Mehbooba Mufti Srinagar (Jammu and Kashmir), Dec 31 (ANI): While briefing a press conference in Srinagar on Triple Talaq Bill, Former Chief Minister of Jammu and...Updated: 2 hours, 5 min ago IST Ghazipur violence shouldn't be linked with law & order situation in UP: Mahesh Sharma New Delhi, Dec 31 (ANI): Union Minister of State for Culture Mahesh Sharma, while talking about the Ghazipur stone pelting incident, said, \"It is...Updated: 2 hours, 37 min ago IST AIADMK continues protest against construction of dam across Cauvery River New Delhi, Dec 31 (ANI): AIADMK MPs continued their protest on Monday against the construction of Mekedatu dam across Cauvery River. The MPs...Updated: 2 hours, 37 min ago IST Lord Hanuman dressed up as Santa Claus in a temple in Gujarat Botad (Gujarat), Dec 31 (ANI): Lord Hanuman was dressed up as Santa Claus at Sarangpur temple. The temple is situated in Gujarat's Botad. The...Updated: 2 hours, 38 min ago IST Kanaka Durga Temple to implement dress code for devotees Vijayawada (AP), Dec 31 (ANI): Come 2019, Kanaka Durga Temple or Indrakeeladri Temple in Vijayawada will see visitors donning uniforms. The temple...Updated: 3 hours, 42 min ago IST UTS Mobile app: Easy ways to get rail tickets भारतीय रेलवे अपने वायदे के मुताबिक़ आपके सफ़र को आरामदायक और झंझट से राहत दिलाने के प्रति कृतसंकल्प है...यूटीएस मोबाइल एप को इंट्रोड्यूस करना उसी की...Updated: 4 hours, 12 min ago IST Sajjan Kumar's surrender will push Jagdish Tytler & <mark>Kamal Nath</mark>'s arrest: Manjinder Sirsa New Delhi, Dec 31 (ANI): Shiromani Akali Dal (SAD) leader Manjinder Singh Sirsa on Monday said that the convict in 1984 anti-Sikh riots, Sajjan...Updated: 4 hours, 13 min ago IST Leaders of Opposition hold meeting in Rajya Sabha New Delhi, Dec 31 (ANI): A meeting was held between leaders of Opposition parties in Rajya Sabha on Monday. The meeting was held in the chamber of...Updated: 4 hours, 19 min ago IST 1984 riots case: Sajjan Kumar expected to surrender today New Delhi, Dec 31 (ANI): The 73-year-old Congress leader, Sajjan Kumar, who was awarded life sentence by the Delhi High Court in a 1984 anti-Sikh...Updated: 4 hours, 58 min ago IST Fire breaks out at cloth factory in Thane Thane (Maharashtra), Dec 31 (ANI): A massive fire broke out in a cloth factory in Bhiwandi city of Maharashtra's Thane district on Monday. No...Updated: 6 hours, 40 min ago IST Security tightened near border areas ahead of New Year Rajouri (J & K), Dec 31 (ANI): Security has been tightened up near border areas ahead of New Year. Security personnel have been deployed at several...Updated: 7 hours, 6 min ago IST Delhi continues to reel under cold waves New Delhi, Dec 31 (ANI): Cold waves intensify in the national capital as the year comes to an end. At India Meteorological Department (IMD), the...Updated: 9 hours, 36 min ago IST Tourists throng Goa ahead of New Year celebrations Panaji (Goa), Dec 31 (ANI): Goa is all set to welcome New Year with extravaganza as tourists thronged various beaches. Both Indian and foreign...Updated: 9 hours, 37 min ago IST Cities light up ahead of New Year celebrations Bengaluru/Mumbai, Dec 31 (ANI): With only a day left for the arrival of New Year, streets of cities like Bengaluru and Mumbai light up with...Updated: 11 hours, 15 min ago IST BJD workers join BJP in presence of Dharmendra Pradhan in Bhubaneswar Bhubaneswar (Odisha), Dec 31 (ANI): Several workers of Biju Janata Dal (BJD) joined the Bharatiya Janata Party (BJP) in Odisha's Bhubaneswar on...Updated: 11 hours, 15 min ago IST Poor couple runs orphanage with funds & donations in Odisha's Kalahandi Kalahandi (Odisha), Dec 31 (ANI): It is rightly said that where there is will there is way. This has been proven by a poor and uneducated couple ..."}, {"articleID": "2012050813_00028854_W", "names": {"Don Graham": ["Q5292693", "Q5292694"]}, "date": "2012-05-08", "url": "http://inc.com/bill-murphy-jr/facebook-lobbying-operations-built-for-battle.html", "content": "facebook's lobbying operations \"built for battle\" the single biggest threat to facebook's business model might be the stroke of a federal bureaucrat's pen. so, with its roadshow underway and hopes for a giant ipo on may 18, the social media giant has been sending friend requests all over washington. the prime objective? keep the government from imposing stricter privacy laws that could restrict how facebook collects information about users-and what it does with all that data. \"there's nothing cute about [facebook's] lobbying operation,\" writes politico's michelle quinn. \"its d.c. shop has been built for battle .\" so, what would your strategy be if you had an almost unlimited budget, an insane valuation, and a wildly popular but controversial product? here are the five keys to how facebook hopes to keep the government off its back: 1. recruit heavy hitters. facebook's team members were well-known in political circles long before they joined the social network's lobbying network. joel kaplan, was a member of president george w. bush's staff. the point person in its dealings with the u.s. house of representatives was an aide to speaker of the house john boehner. erskine bowles, a former white house chief of staff under president clinton, and <mark>don graham</mark>, the chairman of the washington post, are on its board of directors. and its chief operating officer, cheryl sandberg, was chief of staff to the secretary of the treasury under clinton. of course, facebook isn't alone in playing the known-name game. in february, politico, facebook is the first pre-ipo tech company to have its own political action committee. moreover, its key people have spread the wealth, so to speak, by donating to the campaigns of president obama, likely gop nominee mitt romney, and congressman ron paul. 3. become indispensable. the same people facebook lobbies in washington are often among its users. it's virtually impossible to imagine running a political campaign now without making facebook a central part of your online strategy. \"it has hosted congressional leaders and their aides at its washington office and its menlo park, calif., headquarters,\" quinn reported. \"it hosted so-called young guns from house gop leadership as well as president barack obama, and streamed the events live on its site .\" 4. get in front of key issues...when the ftc insisted on a 20-year oversight deal to settle charges that facebook had engaged in \"unfair and deceptive\" practices last year, ceo mark zuckerberg trumpeted the consent decree as \"a framework for how companies should approach privacy,\" and evidence of \"a clear and formal long-term commitment\" to privacy. that's typical of how the company works, representative mary bono mack, a republican from california, told politico. \"they are responsive, engaged, and big thinkers when it comes to internet policy .\" 5 ....but let others be the lightning rods. get on the same page show and tell by sharing your screen instantly at join.me. free. office 365 live demo join microsoft office 365 specialists for a live online demo and q & a. the mercedes-benz sprinter grow your business with the commercial van that works as hard as you do"}]