[{"articleID": "2017053105_00203726_W", "names": {"Bill Barber": ["Q30122755", "Q323103"], "Paige Peterson": ["Q1170263", "Q7124726"]}, "date": "2017-05-31", "url": "http://www.pe.com/2017/05/30/riverside-poly-holds-off-dana-hills-reaches-first-softball-final-since-2004/", "content": "Riverside Poly holds off Dana Hills, reaches first softball final since 2004 By Michael Huntley | Press-Enterprise PUBLISHED: May 30, 2017 at 10:02 pm | UPDATED: May 30, 2017 at 10:04 pm DANA POINT>> The Riverside Poly softball team outlasted Dana Hills, 6-4, Tuesday in the semifinals of the CIF-SS Division 2 playoffs. Riverside Poly (28-6) will play in its first championship game since 2004, taking on Camarillo on Friday or Saturday at <mark>Bill Barber</mark> Park in Irvine. \"It's such a great feeling for this group of girls,\" Bears coach Robert Sakaguchi said. \"They are doing absolutely everything we could have expected or wanted from them.\" The loss snapped a 12-game winning streak for Dana Hills (19-13), which won the Sea View League championship this season. \"This is the best group we've had since I've been coaching here,\" Dana Hills coach Brandon Cosenza said. \"They battled until the end and done everything we've asked. It's been a successful and fun season.\" The Dolphins were shut out by Riverside Poly pitcher <mark>Paige Peterson</mark> until fifth inning. They trailed, 6-0, but scored three runs in the fifth and one in the sixth to cut the lead to two. Cozette Zoch started the rally with a triple in the fifth inning. Cameron Cecil drove her in for the Dolphin's first run of the game. Tori Sickmeier and Jessie Nagel drove in the other two runs in the inning. Carlee Russo singled in the sixth and was driven in by Cecil to cut the Poly lead to two. \"I have to admit, I got a little comfortable with the lead,\" <mark>Peterson</mark> said. \"But after I saw them scoring, it got into my head and I picked it up.\" <mark>Peterson</mark> has been the most reliable pitcher for the Bears all season. The senior allowed only one run the past two playoff games. \"It was a gutsy performance,\" Sakaguchi said. \"She knew that her team needed her and we weren't going to go to anyone else. She stepped up and took that challenge.\" Riverside Poly struck first in the third inning with a four-run rally. The Bears hit four consecutive singles, which included run-scoring hits by Niki Calderon and Kayla Trayor. Later in the inning, Jacquelin Loya drove in a run on a fielder's choice. In the fifth inning, Nahuaque Orona led off the inning for Riverside Poly with a triple. On the ensuing pitch, Savannah Favre hit an inside-the-park home run to extend the Poly lead to 6-0. \"We were talking about it on the drive over here that with the size of this field, any gapper could turn into a home run,\" Sakaguchi said. \"It was huge getting those runs but we still weren't comfortable.\" Get the latest news delivered daily! Subscribe Follow Us Facebook Twitter Instagram RSS"}, {"articleID": "2016092019_00173776_W", "names": {"Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"], "Donald Trump": ["Q22686", "Q27947481"], "Ron Rivera": ["Q1991889", "Q7364319"], "Jonathan Stewart": ["Q14951008", "Q3809956"]}, "date": "2016-09-20", "url": "http://10thousandcouples.com/2016/09/gas-shortage-wilmington-feeling-the-effects-of-colonial/", "content": "Gas shortage: Wilmington feeling the effects of Colonial Pipleline leak Gas shortage: Wilmington feeling the effects of Colonial Pipleline leak by Terry Joseph | September 20, 2016 | 22:08 Most Jacksonville stations were at $1.98 a gallon Monday. A pipeline leak in Alabama is pushing gas prices higher in the southeast part of the United States. Alabama, South Carolina, North Carolina, Tennessee and Virginia also saw prices climb since Monday, AAA reported Tuesday. While there is no problem at most gas stations in the Mid-South, there has been panic at the pump stretching from middle Tennessee to Atlanta. \"While there are pockets of service stations that have experienced temporary shortages, many have received supplies and others have them scheduled for Monday\" . Gasoline prices are increasing across the South following a pipeline break in Shelby County, Ala.. Colonial Pipeline, the company with owns the line, said in a statement Monday that it has rerouted the fuel that would have been sent down the leaking line to its second mainline, which normally carries distillates, in order to keep supply moving to the affected areas. \"Upon completion of the bypass, it will take a day to test and get the line back in operation\" , the statement from McCrory's office said. As a result of the leak and downtime for the fix, Colonial Pipeline announced over the weekend that it would construct a temporary pipeline to bypass the section of the line that is damaged. Around 8 p.m. central time on September 9, the Pelham Fire Department determined the benzene and gasoline fumes near the assumed site of the leak had reached unsafe levels, and \"suspended all activity and evacuated all persons\" from the assumed leak site and a nearby retention pond, Pond 2, that collected much of the spilled gas. Still, GasBuddy.com's live average of 704 gas stations in Hampton Roads shows that gas prices increased 6 cents from $1.98 Sunday to $2.04 by 4:30 p.m. Monday. In North Carolina, Attorney General <mark>Roy Cooper</mark> urged North Carolina consumers to report gas prices that seem unreasonably high. Georgia Gov. Nathan Deal also signed an executive order forbidding price-gouging Monday. With the spike in gas prices and reports of dry gas station pumps, drivers could see the situation get worse before it gets better, Keen said. At least 252,000 gallons of gasoline spilled from the pipeline into a pond. Governor Robert Bentley toured the incident command center for the Colonial Pipeline gasoline spill that has been blamed for gasoline shortages and gas price increases in the South. The gas will need to get to the Atlanta market, go to the terminals, then onto delivery trucks, and then go to the stations for drivers. The Colonial Pipeline does supply his store, but Patel's confident it will be fixed this week. It's unclear when the spill actually started. The average price of regular gas in Georgia a week ago was around $2.10, AAA reported. According to a preliminary report, it wasn't possible to immediately pinpoint the leak, partly because highly flammable benzene and gasoline vapors hung in the air and prevented firefighters, company officials and anyone else from being near the site for more than three days. Related Articles <mark>Trump</mark> \"bets' terror suspect not on a watch list because he's litigious Initially, a garbage can explosion at a Marine Corps charity race in Seaside Park, New Jersey, seemed to be an isolated incident. After an officer arrived and recognized Rahami, Rahami shot the officer, who was saved by his bulletproof vest, authorities said. 20 September 2016 New Jersey congressman: Bomb suspect asked for visa help No one was injured in the other blasts.\" We all have a role to play as citizens to make sure we don't succumb to that fear \". Investigators believe more people were involved in the NY and New Jersey bombing plots, two USA officials told Reuters. 20 September 2016 JPMorgan nudges Wells Fargo off perch as most valuable US bank In fact, a lawsuit filed by Los Angeles against Wells Fargo in May 2015 says that the bank was consumed by this goal. It's the first time in over three years Wells Fargo hasn't been able to call itself America's most valuable bank. 20 September 2016 Manchester United boss Jose Mourinho\" to rest trio for EFL Cup tie' United lost the derby to Manchester City last weekend and were then beaten by Feyenoord in their midweek Europa League clash. But even at 25 metres, you have to jump and go and press, but no, we wait. \"This is a tactical but also a mental attitude\" . 20 September 2016 Clinton had been sidelined for most of this week after coming down with a form of pneumonia. The message, Clinton said, was, \"\"Please don't think. 20 September 2016 Doctor says <mark>Donald Trump</mark> in\" excellent physical health' In discussing his campaign positions, <mark>Trump</mark> told Oz that women should be able to obtain birth control without a prescription. Mr <mark>Trump</mark> had avoided referring to Mrs Clinton's medical problems but on Wednesday night made a veiled attack on her health. 20 September 2016 Mike Zimmer: \"It's going to be another miserable Tuesday' Coach <mark>Ron Rivera</mark> revealed to reporters running back <mark>Jonathan Stewart</mark>'s hamstring injury could keep him out at least a week or two. Bank Stadium on crutches after an NFL football game against the Green Bay Packers Sunday, Sept. 18, 2016, in Minneapolis. 20 September 2016 Authorities were also investigating the stabbings of nine people at a Minnesota mall as a possible act of terrorism. <mark>Trump</mark> blamed the President Barack Obama's administration for letting in too many refugees. 20 September 2016 People stand near burning debris during election protests in Kinshasa, Democratic Republic of Congo, Monday, Sept. 19, 2016. Human Rights Watch said in a statement on Monday that the clashes were preceded by intensified government repression. 20 September 2016 Authorities believe the\" main guy \"has been caught, but the investigation continues to determine if Rahami had help. He thanked the police for arresting Ahmad Khan Rahami, the man suspected in bombings in NY and New Jersey. 20 September 2016 Tulsa Shooting Video of Cops Killing Unarmed Man Crutcher's death is the latest in a string of police shootings against black men.\" We're going to stop it right here \", she said. In the video, Crutcher approaches the driver's side door before dropping to the ground after being shocked with a stun gun. 20 September 2016"}, {"articleID": "2015101318_00071739_W", "names": {"Kevin James": ["Q22278351", "Q44561", "Q6396595", "Q6396597", "Q6396599", "Q6396601"]}, "date": "2015-10-13", "url": "http://www.publicopiniononline.com/nation-world/ci_28962814/man-convicted-dallas-officers-2001-death-faces-execution", "content": "Man convicted in Dallas officer's 2001 death faces execution By Michael Graczyk Associated Press Updated: 10/13/2015 02:07:42 PM EDT HUNTSVILLE, Texas (AP)--The 19-year-old was already wanted in Dallas in the fatal shooting of a neighbor when he got involved in a brawl outside a club, pulled out a 9 mm semi-automatic handgun and opened fire on police as they tried to break up the fight. Licho Escamilla's bullets twice struck Christopher <mark>Kevin James</mark>, among four uniformed Dallas officers working off-duty security that 2001 Thanksgiving weekend, knocking him to the ground. Escamilla then calmly walked up to <mark>James</mark> and pumped three more shots into the back of his head before running and exchanging shots with other officers, witnesses said. A wounded Escamilla was arrested as he tried to carjack a truck. On Wednesday night, Escamilla is slated to become the 24th convicted killer put to death this year in the United States--with Texas accounting for half of the execution. The U.S. Supreme Court last week refused to review the 33-year-old's case, the Texas Board of Pardons and Paroles on Monday decided against a reprieve and recommending clemency and no new appeals were in the courts Tuesday. \"He's a really bad guy,\" trial prosecutor Fred Burns said Tuesday. \"I think what happened is the guy already committed one murder and figures that's what (officers) were coming after him for.\" Advertisement A warrant had been issued for Escamilla in the shooting death of a West Dallas neighbor nearly three weeks before <mark>James</mark>' death on Nov. 25, 2001. Escamilla's trial attorneys told jurors he was responsible for <mark>James</mark>' slaying but argued it didn't merit a death sentence because <mark>James</mark> was not officially on duty, meaning the crime didn't qualify as a capital murder. As the judge in October 2002 read his death sentence, Escamilla threw of pitcher of water at the jury, started kicking and hitting people and hid under the defense table until he was subdued by sheriff's deputies. \"It was a real scene,\" Wayne Huff, Escamilla's lead trial lawyer, said. \"I don't think there was any real doubt he was going to be found guilty.\" Testimony showed Escamilla bragged to emergency medical technicians who were treating his wounds that he had killed an officer and injured another and that he'd be out of jail in 48 hours. He also admitted to the slaying during a television interview from jail. <mark>James</mark>, 34, had earned dozens of commendations during his nearly seven years on the Dallas police force after graduating at the top of his cadet class. He was working the off-duty security job to earn extra money so he and his new wife could buy a house. A second officer wounded in the gunfire survived. According to court documents, Escamilla and some older brothers were involved in gang activities and sold and used drugs from an early age. He was involved in two high-speed police chases and an assault on an assistant principal in school, where he dropped out after the eighth grade."}, {"articleID": "2012010410_00068576_W", "names": {"Sergio Sanchez": ["Q3956304", "Q7454416", "Q974214"], "Luis Oliveira": ["Q48010734", "Q51232803", "Q723383"]}, "date": "2012-01-04", "url": "http://foreign.peacefmonline.com/sports/201201/87362.php", "content": ": real madrid coach jose mourinho has admitted that he was unhappy with his entire team's first-half display in the 3-2 victory over malaga in the copa del rey. <mark>sergio sanchez</mark> and martin demichelis gave malaga a surprising two-goal lead at the break, before madrid turned the score around in the second half, with three goals in 10 minutes, to take an important step towards reaching the quarter-finals of the competition. after the match, mourinho noted that it was crucial to change some things at the break and admitted it was not easy to decide which players he had to replace. \"i told my players at half-time that if i could make 11 substitutions, i would change the entire team,\" he told reporters at a pist-match press conference. \"i could only make three, but i would have changed all 11 players. i changed three players so that the team could do different things, i thought about doing it before the break, but that is not something that i like. sochaux president alexandre lacombe: marvin martin will not leave in january santos close down futsal and female football teams to keep neymar corinthians president roberto de andrade: we want carlos tevez on loan santos prez <mark>luis oliveira</mark>: we are willing to sell ganso if he wants to leave west brom made it difficult for us, admits tottenham's harry redknapp massimiliano allegri: gennaro gattuso will return against paris saint-germain"}, {"articleID": "2015040503_00018343_W", "names": {"James Reimer": ["Q1278471", "Q22109151"], "Trevor Smith": ["Q2452132", "Q7839430", "Q7839431", "Q7839432", "Q7839433"]}, "date": "2015-04-05", "url": "http://www.ottawasun.com/2015/04/04/live-coverage-leafs-vs-bruins", "content": "BOSTON - Was it really only two springs ago when the Maple Leafs brought so much hope into this building, convincing many that the franchise was headed in the right direction? As gutting as the overtime loss here at the TD Garden was to those in the lineup, the potential false expectations that came out of that seven-game series now seem like ancient hockey history. The inexperienced, under-achieving lineup the Leafs iced for Saturday night's 2-1 shootout loss to the Bruins had just eight players that were here for the May 13, 2013 collapse and who knows how many will be here the next time the team visits. It was an all too familiar Leafs team that interim coach Peter Horachek sent out on Saturday, one lacking in depth making the issue of motivation that much more challenging. And they certainly weren't equipped to fight through the defensively tough Bruins early on. Give them credit though - despite the lopsided play in favour of an opponent hungry to retain a playoff berth - the Leafs were able to take the Bruins to overtime and then to the shootout. Patrice Bergeron, who scored the Bruins only goal in regulation, got the shootout winner as well with a slow moving deke before flipping the puck over <mark>James Reimer</mark>'s pad. Leafs shooters Tyler Bozak, James van Riemsdyk and Nazem Kadri couldn't solve Tuukka Rask and that was that. For the Bruins, a fifth consecutive win helped strengthen their hold on an Eastern Conference playoff spot. The good news for the draft watchers is that with Carolina's 3-2 win over Philadelphia Saturday afternoon, the Hurricanes are now four points up on the Leafs with a game in hand. It's all but certain, then, that general manager Dave Nonis will select no worse than fourth overall at the NHL entry draft in June. The entire first period felt like was played in the Toronto zone with the Bruins peppering 19 shots at a sharp but shell-shocked <mark>Reimer</mark>. All but three Boston skaters had a shot on goal in the first and this from a team that isn't exactly an offensive juggernaut. But a Bruins squad somewhat desperate for two points, but lacking a killer instinct when it comes to scoring, allowed the Leafs to hang around, tied 1-1 after 40 minutes. They fired a season-high 50 shots at <mark>Reimer</mark>, who had one of his better games of the season. The longer the game went, it seemed, the more the Leafs remained in it, even if they had no reason to be and it was off to overtime. While it's clear that the Leafs aren't the same team they were two years ago, there are concerns with the B's, as well, some of those on display in this one. They have been hot lately, but have had their share of uneven stretches during the season creating a little unease in New England. Saturday's contest was fan appreciation night at the TD Garden, their final home contest of the season. With a playoff spot yet to be clinched, there was also an outside shot that it could be the last game here period until next October. The Bruins have been strong defensively, but offence is an issue, as we saw on Saturday. Still, the team is trying to summon up some consistency for what it hopes could be a deep playoff run in what seems to be a wide open Eastern Conference. After dominating the Leafs in the first period but with nothing to show for it, Bergeron got the Bruins on the board 19 seconds into the second. After fanning on a shot, he popped in to pick up his own rebound and beat <mark>Reimer</mark>. The Leafs tied it at 1-1 with 5:21 left in the second on the type of goal that had eluded them for much of the season. A puck that bounced off James van Riemsdyk's shoulder was eventually went into the net after Bruins defenceman Adam McQuaid. It was van Riemsdyk's 26th of the season giving a two-goal lead over Phil Kessel for the team high in that department. The Leafs were short-handed early in the first when centre <mark>Trevor Smith</mark> was rocked hard into the end boards by behemoth Bruins defenceman, Zdeno Chara. Bloodied and wobbly, <mark>Smith</mark> hobbled back to the dressing room and did not return after suffering what the team described as an upper body injury. Prior to the game the Leafs talked about employing the spoiler card as motivation, though for a while on Saturday anyway, that seemed like wishful thinking. They'll get a similar chance at home Sunday to the Sens, the team in hot pursuit of the Bruins for the last playoff ticket in the East. \"That should be enough, being a spoiler,\" Horachek said prior to the game. \"We want to give these two teams the respect they deserve by putting a really good game on. We want to give ourselves the respect by going out and playing all the way through.\" Both the Bruins and Leafs are down to their final four games in this NHL season but the teams couldn't be on more opposite paths. The depleted, defeated Leafs are playing out the string while the Bruins are trying to lock down a playoff spot and prepare for what they hope will be a deep playoff run."}, {"articleID": "2014091122_00029737_W", "names": {"Taniela Tupou": ["Q18166319", "Q25189771"], "Richard Graham": ["Q3430805", "Q391756", "Q43395925", "Q7326015", "Q7326016", "Q7326017", "Q7326018", "Q9310288"]}, "date": "2014-09-12", "url": "http://www.sbs.com.au/news/article/2014/09/12/schoolboy-star-tupou-signs-reds", "content": "The Queensland Reds secure spectacular Kiwi schoolboy prop <mark>Taniela Tupou</mark>, after popular tryscoring video clips saw him dubbed the \"Tongan Thor\" . Standout New Zealand schools player <mark>Taniela Tupou</mark> - known as the \"Tongan Thor\" - has signed a two-year Super Rugby contract with the Queensland Reds. <mark>Tupou</mark>, 18, burst into the limelight this year with his performances for the Sacred Heart College first XV in Auckland. The 135kg prop scored a series of long-range tries, employing speed and footwork which belied his size. Videos of his tries went viral on social media, earning him the nickname \"Tongan Thor\" and sparked domestic and international interest in his services. Reds head coach <mark>Richard Graham</mark> says he will seek to further develop <mark>Tupou</mark>'s game, adding to an impressive skill base. \"I think he is a phenomenal athlete and his YouTube clip in late May is a snippet of what he is capable of at this early stage in his rugby career,\" <mark>Graham</mark> said. \"He understands there is a lot of hard work in front of him.\" Tongan-raised <mark>Tupou</mark> says he grew up supporting the Wallabies as they featured some Tongan players. He says his decision was partly influenced by the advice of Reds and Wallabies playmaker Quade Cooper, who grew up in New Zealand. \"My goal now is to try and play for the Reds as soon as I can.\" "}, {"articleID": "2018021618_00321147_W", "names": {"David Willey": ["Q5241102", "Q5241103", "Q5241104"]}, "date": "2018-02-16", "url": "http://www.expressandstar.com/sport/uk-sports/2018/02/16/willey-rashids-red-ball-exit-could-be-the-first-of-many/", "content": "<mark>Willey</mark>: Rashid's red ball exit could be the first of many Less than an hour ago <mark>Willey</mark> believes it is getting harder for players to excel in all formats. Subscribe to our daily newsletter Sign UpEngland's Adil Rashid (Steve Parsons/PA) England all-rounder <mark>David Willey</mark> believes Adil Rashid could be the first of many top players to turn their backs on red-ball cricket. Rashid has decided to focus exclusively on limited-overs competitions next season and is renegotiating a deal with Yorkshire to reflect his withdrawal from the first-class game. The leg-spinner, who earned the last of 10 Test caps in December 2016, has not closed the door on a future return but, at the age of 29 and with lucrative Twenty20 opportunities at an all-time high, few expect it. Rashid has gone a step further than one-day captain Eoin Morgan, who has not donned his Middlesex whites since 2015 but remains theoretically available to do so, and does not suffer from the fitness problems which constrain short-form specialist Tymal Mills. The Yorkshire County Cricket Club can confirm that leg-spinning all-rounder Adil Rashid will not play red-ball cricket for the White Rose in 2018 .--Yorkshire CCC (@ YorkshireCCC) February 15, 2018 As such, his announcement is sure to usher in plenty of soul-searching from those who fear for Test cricket's status at the pinnacle of the game and hold the Specsavers County Championship as the premier domestic competition. But <mark>Willey</mark>, Rashid's team-mate with club and country, sees it as a natural step and one that others could soon pursue. \"It's to be expected. It is too much to play everything and that's cricket now,\" he said. Advertising \"If you look around now with all the white-ball cricket around the world people can make a career out of that. <mark>Willey</mark>, centre, expects other players to follow in the footsteps of Rashid, right (Owen Humphreys/PA)\" Whether more people decide to do it or not is another matter but it's certainly been discussed. \"It's just the way the game seems to be going and these Twenty20 competitions are appealing to people not only for the cricket but also financially. At the end of the day we have a short time playing sport--it's not something we do until we're 60 years old--and there comes a time when you have to make decisions for yourself and your family.\" Advertising Totally understand players who get huge figures in the IPL...& if @ josbuttler did it i would not argue...Rashid didn't get an IPL deal so why not continue to play for Yorkshire!!!!!!!!!! https: //t.co/ovhP3lXrzB--Michael Vaughan (@ MichaelVaughan) February 15, 2018 As well as money, elite cricketers are increasingly finding themselves funnelled towards specific formats by the relentless international schedule. England felt compelled to rest Joe Root, Chris Woakes and Moeen Ali for the ongoing T20 triangular series while Australia have effectively had to select parallel squads due to the imminent Test campaign in South Africa. <mark>Willey</mark> has a long-held ambition of following in the footsteps of his father Peter, who played 26 Tests for England from 1976-86, but increasingly finds himself pigeon-holed as a white-ball player. <mark>Willey</mark> has been used predominantly in limited-overs cricket since moving to Yorkshire (Rui Vieira/PA) \"It's probably nearly impossible to play Test cricket when you're playing so much white-ball cricket,\" he said. \"Last year we were barely available for any four-day cricket because of the Champions Trophy so it then becomes difficult to play regular red-ball cricket, which you need to be doing if you want to be pushing for Tests,\" he said. \"If you're only playing two or three games a year, you're probably not making much of a contribution to a championship title and you're certainly not going to be able to push for Test cricket, so if you are in that position you're probably thinking\" what am I playing it for? \"'"}, {"articleID": "2011022515_00104474_W", "names": {"David Platt": ["Q1150897", "Q27909630", "Q312143", "Q5238607"]}, "date": "2011-02-25", "url": "http://sportspromedia.com/guest_blog/bergkamps_legacy_has_opened_the_image_rights_floodgates/?utm_source=Feeds&utm_campaign=General&utm_medium=rss", "content": "bergkamp's legacy has opened the image rights floodgates the first image rights case tested by hmrc before the tax special commissioners was in april 2000 and involved payments made by arsenal to <mark>david platt</mark> and dennis bergkamp. until recently, few people thought of tax when thinking of football. however, nowadays few weeks pass media scrutiny of some club or player in a tangle with the taxman. although some of this increased publicity results from hmrc's policy of \"publically shaming' errant taxpayers, there is no doubt that football is now big business and the taxman is anxious to ensure that he gets his fair share. recently, press attention has focussed on the use of image rights by top footballers to\" dodge millions in tax' and how hmrc is said to be negotiating a payment of uk? 100m from premier league clubs to make good the tax owing. - so, how much of this is true, and how much is media sensationalism? \"despite recent publicity, clubs have been making payments for use of players' images for at least ten years\" first of all, it's worth pointing out that, despite recent publicity, clubs have been making payments for use of players' images for at least ten years. the first case tested by hmrc before the tax special commissioners was in april 2000 and involved payments made by arsenal to <mark>david platt</mark> and dennis bergkamp. hmrc claimed that the arrangements whereby arsenal made payments made to <mark>platt</mark> and bergkamp for use of their images, were simply a \"smokescreen' for paying them money offshore to avoid tax. hmrc asked the special commissioners to determine that the payments were effectively additional payments made to the players for playing football, which should have treated as earnings, i.e. subjected to income tax and nic via arsenal's payroll. the commissioners, however, decided that the payments were legitimately made in return for allowing arsenal to exploit the players' images, a purpose entirely different to playing football, for which they were paid a salary via the payroll. as a result the floodgates opened, and as the influx of foreign players into the british game increased, the use of image rights as part of players overall payment packages became much more common.\" typically, image rights payments may account for 15 to 20 per cent of a player's total remuneration package, and for genuine superstars even more \"the amounts at stake are substantial. in straightforward arrangements for british players, the differential between personal and company tax rates means that for each uk? 100,000 paid as image rights rather than salary, hmrc stands to lose up to uk? 36,000 in tax and nic. recently, more aggressive tax planning arrangements for british players may enable loans to be taken from image rights companies which may be made almost tax free. depending on the exact arrangements, it may even be possible to write off these loans later without attracting a further tax liability. if payments are made to offshore image rights companies, as is usually the case for foreign players, the losses can be considerably greater as no uk tax may be payable. typically, image rights payments may account for 15 to 20 per cent of a player's total remuneration package, and for genuine superstars even more. bearing in mind premier league earnings, it is easy to see how hmrc believes that multi-millions of pounds may be at stake. not for the lack of trying! over the past five to six years, almost all premier league clubs have come under review by hmrc. not unexpectedly few were ready to accept large hmrc claims to tax and nic in relation to image rights payments made, but instead engaged the services of leading tax advisers to fight their corners. hmrc maintained that in the vast majority of cases, the amounts paid were wildly in excess of the player's values, and/or that the paying clubs made little or no effort to exploit the images of the players they had paid to richly to obtain use of. clubs maintained the payments were reasonably valued, and not related to playing football. after several years of getting nowhere hmrc and the premier league decided to explore the possibility of a centrally negotiated agreement. discussions began in late 2009, with tentative initial ideas being that players' image values should be determined by international status, with different bandings depending upon factors such as the international country involved, and number of caps. however, these negotiations quickly fell over, largely because the bigger clubs maintained that the images of their star players were worth far more than hmrc's banding system envisaged. however, perhaps fuelled by the government's dash for cash, negotiations recommenced in late 2010; this time hmrc tried to band clubs by reference to turnover, with the percentage of image rights payments being treated as liable to tax and nic increasing as turnover decreased. the cynical may say that this was a blatant attempt to gain agreement from the bigger clubs who resisted previous proposals. the outcome of the clubs' vote on whether or not to accept hmrc's latest proposals is awaited. however, on previous history, it is perhaps unlikely that a consensus view will be achieved .? copyright 2010 sportspromedia ltd. all rights reserved. level 2, trans-world house, 100 city road, london, ec1y 2bp, united kingdom"}, {"articleID": "2015041107_00051329_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Carlos Beltran": ["Q1042743", "Q5041829"], "Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"], "John Farrell": ["Q1017017", "Q17916883", "Q46168067", "Q56723519", "Q6232765", "Q6232766"]}, "date": "2015-04-11", "url": "http://northjersey.com/sports/baseball/yanks-notes-a-rod-moved-up-to-third-in-order-1.1307045", "content": "Third watch Designated hitter <mark>Alex Rodriguez</mark> found himself batting third in Friday night's lineup, a sign of the club's offensive struggles, his good at-bats and manager Joe Girardi's decision to give regular No. 3 hitter <mark>Carlos Beltran</mark> a rest after a 1-for-10 start. A-Rod rewarded Girardi's move by going 2-for-5 with an RBI before leaving for a pinch-runner. \"His swings have been good,\" Girardi said of A-Rod, who hit his first homer of 2015 in Thursday night's 6-3 loss to Toronto. \"He's used to hitting in the middle of the order. He understands how to hit in that position and that's why I chose to do it.\" A-Rod has batted in three different spots in four games, opening as the No. 7 hitter and moved to No. 2 on Thursday night when Brett Gardner was rested. <mark>Rodriguez</mark> could get a rest as early as today against righty <mark>Joe Kelly</mark>. Girardi has yet to start <mark>Rodriguez</mark> in the field, but said he foresees giving first baseman Mark Teixeira and third baseman Chase Headley a break soon, with A-Rod possibly filling in. On Friday, A-Rod played in his first Red Sox-Yankees game since Sept. 15, 2013, due to his full-year MLB suspension due to steroids. Boston manager <mark>John Farrell</mark> was already impressed with what he saw from A-Rod briefly in spring training. \"You never count out a proven veteran,\" <mark>Farrell</mark> said. \"You marvel at the number of games [he] missed and to come back and seemingly have good timing, particularly [against] fastballs.\" ' height =' 105' alt =' A New Jersey businessman has founded a networking organization that can help seal business deals over a friendly game of golf .' height =' 105' alt = \"Tattoos can be removed effectively with the new PicoSure Laser technique .' height =' 119' alt =\" If you are injured in an accident, a personal injury attorney can help determine if you can receive compensation. Escapee from frozen food aisle? Parking lot turkey captivates shoppers Elmwood Park man who killed wife was committed in 2012 after strange behavior, police say Smoke alarm prompts North Arlington family to flee basement fire Elmwood Park man who killed wife was committed in 2012 after strange behavior, police say Escapee from frozen food aisle? Parking lot turkey captivates shoppers Juror in 2014 sex assault case says he's haunted by new charges against defendant Gunfire from the street grazes the head of a 17-year-old Paterson girl inside her home"}, {"articleID": "2019020812_00351730_W", "names": {"Michelle Rodriguez": ["Q184219", "Q3311458"]}, "date": "2019-02-08", "url": "http://pinkvilla.com/entertainment/news/michelle-rodriguez-defends-liam-neeson-says-he-not-racist-439864", "content": "entertainment <mark>Michelle Rodriguez</mark> defends Liam Neeson; says he is not racist <mark>Michelle Rodriguez</mark> has defended actor Liam Neeson, who came under fire earlier this week for admitting that he once wanted to kill a black person for revenge, saying he is not racist. Written By I.A.N.S 2751 reads Mumbai Published: February 8, 2019 05:23 pm <mark>Michelle Rodriguez</mark> defends Liam Neeson; says he is not racist 0 Actress <mark>Michelle Rodriguez</mark> has defended actor Liam Neeson, who came under fire earlier this week for admitting that he once wanted to kill a black person for revenge, saying he is not racist. In an interview to Vanity Fair, Neeson's \"Widows\" co-star <mark>Rodriguez</mark> said Neeson can't be racist because he \"made out with a black person\" . \"It's all (expletive). Liam Neeson is not a racist. Dude, have you watched\" Widows'? His tongue was so far down Viola Davis' throat. You can't call him a racist, ever. \"Racists don't make out with the race that they hate, especially in the way he does with his tongue - so deep down her throat. I don't care how good of an actor you are. It's all (expletive). Ignore it. He's a loving man,\" Usatoday.com quoted <mark>Rodriguez</mark> as saying. During the promotions of his upcoming film \"Cold Pursuit\" a few days ago, Neeson made a controversial statement. He said: \"I went up and down areas with a cosh, hoping I'd be approached by somebody - I'm ashamed to say that - and I did it for maybe a week, hoping some (uses air quotes with fingers)\" black bastard' would come out of a pub and have a go at me about something, you know? So that I could kill him. \"Shortly after the statement, he received backlash on social media and people started calling him racist."}]