[{"date": "2015-05-14", "url": "http://www.huffingtonpost.com/2015/05/14/philadelphia-mayor-super-pac_n_7268872.html", "content": "45 Years Ago, A Nun Promised To Protect These Women. Now They're Searching For Her Killer. Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama American Apparel Fires Back At Dov Charney With A Lawsuit Of Its Own How One Grocery Chain Succeeds In Low-Income, Underserved Communities Blue Bell Will Lay Off A Third Of Its Workers After Listeria Outbreak <mark>Magic Johnson</mark>'s Son Debuts 100-Pound Weight Loss While Promoting Reality Show Sharon Osbourne: \"The View'\" Lost Its Direction' After Barbara Walters Left ABC Disputes RNC Chair's Implication The Party Can Pick Its Own Debate Moderators Cartoon Nails Why So Many People Are Frustrated With Brady's Suspension Jalen Rose And <mark>Chris Webber</mark>'s Public Beef Just Reached Another Level Don't Let Feel-Good Stories Trick You Into Thinking The Sports World Isn't Homophobic Inside The Mind That Built Google Brain: On Life, Creativity, And Failure \"Game Of Thrones' Star Talks About Sexuality On Hit Show And The Homoerotic Night's Watch WASHINGTON--Voters will cast ballots in the Democratic primary for Philadelphia's mayoral race on May 19, but three libertarian donors from the suburbs could really influence the contest. According to city campaign finance records, Arthur Dantchik, Joel Greenberg and Jeff Yass--heads of the trading firm Susquehanna International Group--have pumped almost $7 million into the American Cities super PAC, which backs state Sen. Anthony H. Williams (D). The total contributed by the three financial executives through May 4, the cutoff for the latest reports, not only dwarfs the amount spent by each candidate in the race, but also is nearly equal to all candidate and other super PAC fundraising combined. The contributions come amid a continued uptick in large campaign donations from financial investors to city, state and municipal elections sent through super PACs in recent years. The funds are largely given in support of market-based education reforms including the privatization of public schools, the diversion of public school funds to charter schools and the breaking of teachers unions .\" There is a trend right now toward increased outside spending on lower-ticket races, \"said Denise Roth Barber, managing director at the National Institute on Money in State Politics, a group tracking campaign finance at the state level. The $7 million contributed by just three individuals in the Philadelphia mayoral race stands out as one of the largest financial investments at the city level since the Supreme Court's 2010 Citizens United ruling opened the door for unlimited independent spending by corporations, unions and, ultimately, wealthy individuals. A super PAC that was largely funded by supporters of charter schools and school privatization spent $4 million in support of Chicago Mayor Rahm Emanuel's winning re-election campaign this year. A hedge-fund-backed group in New York that successfully helped elect a Republican state Senate majority in 2014 also spent $4 million. And in Newark's 2014 mayoral election, supporters of market education reform similarly spent $4 million in a losing campaign to elect a successor to Sen. Cory Booker (D-N.J.). The Susquehanna International Group investors are major backers of these policies through their political and charitable donations, and as a staunch supporter of these types of policies, <mark>Williams</mark> is a perfect fit with these priorities. In the state Senate, <mark>Williams</mark> was the architect of an expansion of the state tax credit diverting public funds to charter schools by allowing corporations and wealthy individuals to be refunded with public money when they pay for a scholarship, or\" voucher, \"for a public school student to attend a charter school. He also served on the education commission created by former Republican Gov. Tom Corbett, a proponent of charter schools and vouchers. <mark>Williams</mark> is not a new commodity for the investors based in Bala Cynwyd, Pennsylvania. Dantchik, Greenberg and Yass spent at least $6 million through their Students First PA PAC to support <mark>Williams</mark>' bid for the Democratic Party's gubernatorial nomination in 2010. Susquehanna International Group did not respond to a request for comment from Dantchik, Greenberg, Yass or the company itself. Barbara Grant, a spokeswoman for the <mark>Williams</mark> campaign, said she could not comment on the prior connections between the campaign and the American Cities PAC donors, citing the ban on coordination between campaigns and super PACs .\" I can tell you what the senator has said for a very long time about his being influenced by the gentlemen who are the founders [of American Cities PAC], \"Grant said .\" And basically, he's said they have supported him for a long time and they've never asked him for anything except to advance the cause of good schools and good education for kids. \"Connections between <mark>Williams</mark> and the Susquehanna International Group donors are not limited to their contributions. <mark>Williams</mark>' campaign manager, Dawn Chavous, Chavous also founded a charity, Sky Community Partners, to take advantage of the tax credits for scholarships policy pushed by <mark>Williams</mark>. The Susquehanna International Group investors have given money to Sky Community Partners in exchange for tax credits under the program. Actually, Dantchik, Greenberg and Yass are, collectively, the largest users of the tax credit program. Not only do they give to Sky Community Partners, but they have also donated to Choice Academics, a charter charity run by Yass' wife, Janine. The tax credit program, which cost the state $127 million in 2014, has been plagued by a lack of oversight and criticized by Gov. <mark>Tom Wolf</mark> (D). According to a report on Philly.com, the state's Department of Community and Economic Development\" acknowledged that until 2012, it did not keep digital records for hundreds of millions of dollars worth of educational tax-credit applications filed on paper. \"The program also contains a loophole, according to Philly.com, allowing companies to sidestep the limit in the total amount of tax credits they can receive under the program in a given year by donating through affiliates or subsidiaries. This is precisely the practice used by the Susquehanna International Group. While Dantchik, Greenberg and Yass have a long history of supporting <mark>Williams</mark> in Democratic primary elections and have made bipartisan contributions for years, they are primarily backers of Republican Party politicians and groups promoting libertarian policies. They have contributed to national Republican Party committees, Corbett, Wisconsin Gov. <mark>Scott Walker</mark> (R) and Republican leaders such as former U.S. House Majority Leader Eric Cantor (R-Va .). Large contributions have flowed to various committees set up by the Club for Growth. Most of the candidates they supported in recent elections are from the more libertarian wing of the party or the tea party. Yass contributed to the 2000 presidential campaign of Libertarian Party nominee Harry Browne and the Libertarian National Committee and also the Ralph Nader's 2004 independent presidential campaign. The trio has also donated to Democrats, including both Hillary Clinton and Barack Obama during the 2008 presidential nominating contest and Pennsylvania politicians such as then-Gov. Ed Rendell and U.S. Sen. Bob Casey. Democratic congressmen on key financial services committees have also received contributions. Dantchik, Greenberg and Yass have given contributions to Democratic Party committees as well, albeit on a smaller scale than to Republican groups. The three investors have also given millions of dollars to such nonprofits as the libertarian Cato Institute, the libertarian legal group Institute for Justice and the Ayn Rand Institute .\" They know they can't elect a Republican citywide in Philadelphia, and <mark>Tony Williams</mark> is the closest thing they can get, \"said Kati Sipp, director of Pennsylvania Working Families, a group backing <mark>Williams</mark>' opponent Jim Kenney in the mayoral race. Previous polling, both independent and by groups favoring individual candidates, showed a tight race between Kenney and <mark>Williams</mark>. An NBC 10 poll released on Thursday, however, gave Kenney a large lead and <mark>Williams</mark> in a tie for second with former District Attorney Lynne Abraham. Kenney has the backing of many of the city's largest unions including the teachers unions and national unions like the AFL-CIO, and those groups have contributed large sums to super PACs supporting his election, but not nearly to the level of the Susquehanna International Group. The union-supported Building a Better PA super PAC raised $1.5 million through May 4. Another pro-Kenney union group, Forward Philadelphia, raised $783,100 through the same date. Spending by all super PACs is expected to pick up in the final week of the campaign. Charlotte mayor Dan Clodfelter speaks during an event on Sept. 24, 2014 at the Siemens Charlotte Energy Hub in Charlotte, N.C. (Jason E. Miczek / AP Images for Siemens) San Diego Mayor Kevin Faulconer speaks before the California Republican Party 2014 Spring Convention Friday, March 14, 2014, in Burlingame, Calif. (AP Photo/Ben Margot) Chicago Mayor Rahm Emanuel speaks to members of the Safe Passage program during a training session at Chicago State University in Chicago, Wednesday, Aug. 21, 2013. (AP Photo/Scott Eisen) San Francisco Mayor <mark>Ed Lee</mark> speaks to reporters during a news conference after Asiana Flight 214 crashed at San Francisco International Airport in San Francisco, Saturday, July 6, 2013. (AP Photo/Darryl Bush) Los Angeles Mayor Eric Garcetti speaks in front of city hall after being sworn in on Sunday, June 30, 2013. (AP Photo/Mark J. Terrill) New York City Mayor Bill de Blasio sits on stage during the swearing in ceremony for New York City's 42nd police commissioner William Bratton at One Police Plaza on January 2, 2014. (Photo by Spencer Platt/Getty Images) President Barack Obama, right, meets with Houston Mayor Annise Parker during his arrival at Ellington Airport, Friday, March, 9, 2012, in Houston. (AP Photo/Pablo Martinez Monsivais) Indianapolis Mayor <mark>Greg Ballard</mark> talks the plans for the city to bid for the NFL football's 2018 Super Bowl as Allison Melangton, left, chair the 2018 Super Bowl Bid Committee, watches during an announcement in front of the downtown skyline in Indianapolis, Friday, Aug. 30, 2013. (AP Photo/Michael Conroy) Mike Duggan celebrates his election as the new mayor of Detroit at a victory party at the Renaissance Center November 5, 2013 in Detroit, Michigan. (Photo by Bill Pugliano/Getty Images) Philadelphia Mayor Michael Nutter speaks about ways to reduce U.S. murder and gun violence rates and other issues affecting urban communities at the National Press Club in Washington, D.C., September 26, 2013. (SAUL LOEB/AFP/Getty Images) Oscar Leeser poses during the reception for Hyundai Hope on Wheels and CHOC Children's Foundation's Change the World Campaign on May 10, 2011 in Orange, California. (Photo by Ryan Miller/Getty Images) Phoenix Mayor <mark>Greg Stanton</mark> speaks at a press conference to introduce Brittney Griner (not pictured) of the Phoenix Mercury at U.S. Airways Center on April 20, 2013 in Phoenix, Arizona. (Photo by Christian Petersen/Getty Images) U.S. Health and Human Services Secretary Kathleen Sebelius, right, with Dallas Mayor <mark>Mike Rawlings</mark>, left, discusses the implementation of the federal health care overhaul in Dallas, Texas, on Thursday, September 26, 2013. (AP Photo/Nomaan Merchant) This April 22, 2011 file photo shows San Jose Mayor <mark>Chuck Reed</mark> speaking during the 8th Annual CEO Summit at IBM offices in San Jose, Calif. (AP Photo/Paul Sakuma, File) Secretary of Health and Human Services Kathleen Sebelius, left, leads a meeting with Austin, Texas, Mayor Lee Leffingwell, second from left, and City Manager Marc Ott, right, and others at City Hall in Austin, Texas, on Thursday, Aug. 8, 2013. (AP Photo/Austin American-Statesman, Jay Janner) Jacksonville mayor <mark>Alvin Brown</mark> speaks to the media during the Road to Daytona Fueled By Sunoco Tour stop at City Hall on February 12, 2013 in Jacksonville, Florida. (Photo by Sam Greenwood/Getty Images for NASCAR) Mayor <mark>Michael Coleman</mark> of Columbus, Ohio speaks to members of the media outside the West Wing during a news briefing after a meeting with President Barack Obama at the White House December 12, 2012 in Washington, D.C. (Photo by Alex Wong/Getty Images) Fort Worth Mayor Betsy Price looks on during a press conference before the start of the 2013 Mayor's Cup on July 26, 2013 at Texas Motor Speedway in Fort Worth, Texas. (Photo by Cooper Neill/Getty Images for Texas Motor Speedway) Describe the error here (1,000 character limit) * Type the words below so we know you are not a cyborg", "articleID": "2015051618_00009127_W", "names": {"Alvin Brown": ["Q10900657", "Q4738049", "Q4738052"], "Chris Webber": ["Q314415", "Q5108439"], "Chuck Reed": ["Q21170808", "Q5115678"], "Ed Lee": ["Q241750", "Q5335075"], "Greg Ballard": ["Q2340949", "Q5251212"], "Greg Stanton": ["Q5606289", "Q56718996"], "Magic Johnson": ["Q134183", "Q7490891"], "Michael Coleman": ["Q18390603", "Q18629172", "Q50418243", "Q52359840", "Q6829344", "Q6829345", "Q6829347", "Q6829353", "Q6829361"], "Mike Rawlings": ["Q15689970", "Q6848512"], "Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"]}}]