[{"date": "2015-05-14", "url": "http://www.huffingtonpost.com/2015/05/14/philadelphia-mayor-super-pac_n_7268872.html", "content": "45 Years Ago, A Nun Promised To Protect These Women. Now They're Searching For Her Killer. Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama American Apparel Fires Back At Dov Charney With A Lawsuit Of Its Own How One Grocery Chain Succeeds In Low-Income, Underserved Communities Blue Bell Will Lay Off A Third Of Its Workers After Listeria Outbreak <mark>Magic Johnson</mark>'s Son Debuts 100-Pound Weight Loss While Promoting Reality Show Sharon Osbourne: \"The View'\" Lost Its Direction' After Barbara Walters Left ABC Disputes RNC Chair's Implication The Party Can Pick Its Own Debate Moderators Cartoon Nails Why So Many People Are Frustrated With Brady's Suspension Jalen Rose And <mark>Chris Webber</mark>'s Public Beef Just Reached Another Level Don't Let Feel-Good Stories Trick You Into Thinking The Sports World Isn't Homophobic Inside The Mind That Built Google Brain: On Life, Creativity, And Failure \"Game Of Thrones' Star Talks About Sexuality On Hit Show And The Homoerotic Night's Watch WASHINGTON--Voters will cast ballots in the Democratic primary for Philadelphia's mayoral race on May 19, but three libertarian donors from the suburbs could really influence the contest. According to city campaign finance records, Arthur Dantchik, Joel Greenberg and Jeff Yass--heads of the trading firm Susquehanna International Group--have pumped almost $7 million into the American Cities super PAC, which backs state Sen. Anthony H. Williams (D). The total contributed by the three financial executives through May 4, the cutoff for the latest reports, not only dwarfs the amount spent by each candidate in the race, but also is nearly equal to all candidate and other super PAC fundraising combined. The contributions come amid a continued uptick in large campaign donations from financial investors to city, state and municipal elections sent through super PACs in recent years. The funds are largely given in support of market-based education reforms including the privatization of public schools, the diversion of public school funds to charter schools and the breaking of teachers unions .\" There is a trend right now toward increased outside spending on lower-ticket races, \"said Denise Roth Barber, managing director at the National Institute on Money in State Politics, a group tracking campaign finance at the state level. The $7 million contributed by just three individuals in the Philadelphia mayoral race stands out as one of the largest financial investments at the city level since the Supreme Court's 2010 Citizens United ruling opened the door for unlimited independent spending by corporations, unions and, ultimately, wealthy individuals. A super PAC that was largely funded by supporters of charter schools and school privatization spent $4 million in support of Chicago Mayor Rahm Emanuel's winning re-election campaign this year. A hedge-fund-backed group in New York that successfully helped elect a Republican state Senate majority in 2014 also spent $4 million. And in Newark's 2014 mayoral election, supporters of market education reform similarly spent $4 million in a losing campaign to elect a successor to Sen. Cory Booker (D-N.J.). The Susquehanna International Group investors are major backers of these policies through their political and charitable donations, and as a staunch supporter of these types of policies, <mark>Williams</mark> is a perfect fit with these priorities. In the state Senate, <mark>Williams</mark> was the architect of an expansion of the state tax credit diverting public funds to charter schools by allowing corporations and wealthy individuals to be refunded with public money when they pay for a scholarship, or\" voucher, \"for a public school student to attend a charter school. He also served on the education commission created by former Republican Gov. Tom Corbett, a proponent of charter schools and vouchers. <mark>Williams</mark> is not a new commodity for the investors based in Bala Cynwyd, Pennsylvania. Dantchik, Greenberg and Yass spent at least $6 million through their Students First PA PAC to support <mark>Williams</mark>' bid for the Democratic Party's gubernatorial nomination in 2010. Susquehanna International Group did not respond to a request for comment from Dantchik, Greenberg, Yass or the company itself. Barbara Grant, a spokeswoman for the <mark>Williams</mark> campaign, said she could not comment on the prior connections between the campaign and the American Cities PAC donors, citing the ban on coordination between campaigns and super PACs .\" I can tell you what the senator has said for a very long time about his being influenced by the gentlemen who are the founders [of American Cities PAC], \"Grant said .\" And basically, he's said they have supported him for a long time and they've never asked him for anything except to advance the cause of good schools and good education for kids. \"Connections between <mark>Williams</mark> and the Susquehanna International Group donors are not limited to their contributions. <mark>Williams</mark>' campaign manager, Dawn Chavous, Chavous also founded a charity, Sky Community Partners, to take advantage of the tax credits for scholarships policy pushed by <mark>Williams</mark>. The Susquehanna International Group investors have given money to Sky Community Partners in exchange for tax credits under the program. Actually, Dantchik, Greenberg and Yass are, collectively, the largest users of the tax credit program. Not only do they give to Sky Community Partners, but they have also donated to Choice Academics, a charter charity run by Yass' wife, Janine. The tax credit program, which cost the state $127 million in 2014, has been plagued by a lack of oversight and criticized by Gov. <mark>Tom Wolf</mark> (D). According to a report on Philly.com, the state's Department of Community and Economic Development\" acknowledged that until 2012, it did not keep digital records for hundreds of millions of dollars worth of educational tax-credit applications filed on paper. \"The program also contains a loophole, according to Philly.com, allowing companies to sidestep the limit in the total amount of tax credits they can receive under the program in a given year by donating through affiliates or subsidiaries. This is precisely the practice used by the Susquehanna International Group. While Dantchik, Greenberg and Yass have a long history of supporting <mark>Williams</mark> in Democratic primary elections and have made bipartisan contributions for years, they are primarily backers of Republican Party politicians and groups promoting libertarian policies. They have contributed to national Republican Party committees, Corbett, Wisconsin Gov. <mark>Scott Walker</mark> (R) and Republican leaders such as former U.S. House Majority Leader Eric Cantor (R-Va .). Large contributions have flowed to various committees set up by the Club for Growth. Most of the candidates they supported in recent elections are from the more libertarian wing of the party or the tea party. Yass contributed to the 2000 presidential campaign of Libertarian Party nominee Harry Browne and the Libertarian National Committee and also the Ralph Nader's 2004 independent presidential campaign. The trio has also donated to Democrats, including both Hillary Clinton and Barack Obama during the 2008 presidential nominating contest and Pennsylvania politicians such as then-Gov. Ed Rendell and U.S. Sen. Bob Casey. Democratic congressmen on key financial services committees have also received contributions. Dantchik, Greenberg and Yass have given contributions to Democratic Party committees as well, albeit on a smaller scale than to Republican groups. The three investors have also given millions of dollars to such nonprofits as the libertarian Cato Institute, the libertarian legal group Institute for Justice and the Ayn Rand Institute .\" They know they can't elect a Republican citywide in Philadelphia, and <mark>Tony Williams</mark> is the closest thing they can get, \"said Kati Sipp, director of Pennsylvania Working Families, a group backing <mark>Williams</mark>' opponent Jim Kenney in the mayoral race. Previous polling, both independent and by groups favoring individual candidates, showed a tight race between Kenney and <mark>Williams</mark>. An NBC 10 poll released on Thursday, however, gave Kenney a large lead and <mark>Williams</mark> in a tie for second with former District Attorney Lynne Abraham. Kenney has the backing of many of the city's largest unions including the teachers unions and national unions like the AFL-CIO, and those groups have contributed large sums to super PACs supporting his election, but not nearly to the level of the Susquehanna International Group. The union-supported Building a Better PA super PAC raised $1.5 million through May 4. Another pro-Kenney union group, Forward Philadelphia, raised $783,100 through the same date. Spending by all super PACs is expected to pick up in the final week of the campaign. Charlotte mayor Dan Clodfelter speaks during an event on Sept. 24, 2014 at the Siemens Charlotte Energy Hub in Charlotte, N.C. (Jason E. Miczek / AP Images for Siemens) San Diego Mayor Kevin Faulconer speaks before the California Republican Party 2014 Spring Convention Friday, March 14, 2014, in Burlingame, Calif. (AP Photo/Ben Margot) Chicago Mayor Rahm Emanuel speaks to members of the Safe Passage program during a training session at Chicago State University in Chicago, Wednesday, Aug. 21, 2013. (AP Photo/Scott Eisen) San Francisco Mayor <mark>Ed Lee</mark> speaks to reporters during a news conference after Asiana Flight 214 crashed at San Francisco International Airport in San Francisco, Saturday, July 6, 2013. (AP Photo/Darryl Bush) Los Angeles Mayor Eric Garcetti speaks in front of city hall after being sworn in on Sunday, June 30, 2013. (AP Photo/Mark J. Terrill) New York City Mayor Bill de Blasio sits on stage during the swearing in ceremony for New York City's 42nd police commissioner William Bratton at One Police Plaza on January 2, 2014. (Photo by Spencer Platt/Getty Images) President Barack Obama, right, meets with Houston Mayor Annise Parker during his arrival at Ellington Airport, Friday, March, 9, 2012, in Houston. (AP Photo/Pablo Martinez Monsivais) Indianapolis Mayor <mark>Greg Ballard</mark> talks the plans for the city to bid for the NFL football's 2018 Super Bowl as Allison Melangton, left, chair the 2018 Super Bowl Bid Committee, watches during an announcement in front of the downtown skyline in Indianapolis, Friday, Aug. 30, 2013. (AP Photo/Michael Conroy) Mike Duggan celebrates his election as the new mayor of Detroit at a victory party at the Renaissance Center November 5, 2013 in Detroit, Michigan. (Photo by Bill Pugliano/Getty Images) Philadelphia Mayor Michael Nutter speaks about ways to reduce U.S. murder and gun violence rates and other issues affecting urban communities at the National Press Club in Washington, D.C., September 26, 2013. (SAUL LOEB/AFP/Getty Images) Oscar Leeser poses during the reception for Hyundai Hope on Wheels and CHOC Children's Foundation's Change the World Campaign on May 10, 2011 in Orange, California. (Photo by Ryan Miller/Getty Images) Phoenix Mayor <mark>Greg Stanton</mark> speaks at a press conference to introduce Brittney Griner (not pictured) of the Phoenix Mercury at U.S. Airways Center on April 20, 2013 in Phoenix, Arizona. (Photo by Christian Petersen/Getty Images) U.S. Health and Human Services Secretary Kathleen Sebelius, right, with Dallas Mayor <mark>Mike Rawlings</mark>, left, discusses the implementation of the federal health care overhaul in Dallas, Texas, on Thursday, September 26, 2013. (AP Photo/Nomaan Merchant) This April 22, 2011 file photo shows San Jose Mayor <mark>Chuck Reed</mark> speaking during the 8th Annual CEO Summit at IBM offices in San Jose, Calif. (AP Photo/Paul Sakuma, File) Secretary of Health and Human Services Kathleen Sebelius, left, leads a meeting with Austin, Texas, Mayor Lee Leffingwell, second from left, and City Manager Marc Ott, right, and others at City Hall in Austin, Texas, on Thursday, Aug. 8, 2013. (AP Photo/Austin American-Statesman, Jay Janner) Jacksonville mayor <mark>Alvin Brown</mark> speaks to the media during the Road to Daytona Fueled By Sunoco Tour stop at City Hall on February 12, 2013 in Jacksonville, Florida. (Photo by Sam Greenwood/Getty Images for NASCAR) Mayor <mark>Michael Coleman</mark> of Columbus, Ohio speaks to members of the media outside the West Wing during a news briefing after a meeting with President Barack Obama at the White House December 12, 2012 in Washington, D.C. (Photo by Alex Wong/Getty Images) Fort Worth Mayor Betsy Price looks on during a press conference before the start of the 2013 Mayor's Cup on July 26, 2013 at Texas Motor Speedway in Fort Worth, Texas. (Photo by Cooper Neill/Getty Images for Texas Motor Speedway) Describe the error here (1,000 character limit) * Type the words below so we know you are not a cyborg", "articleID": "2015051618_00009127_W", "names": {"Tom Wolf": ["Q1557544", "Q7794795"], "Tony Williams": ["Q11704565", "Q15059471", "Q16216174", "Q17132118", "Q27058293", "Q27922630", "Q3430687", "Q3993322", "Q41762006", "Q4777220", "Q7823679", "Q7823682"]}}, {"date": "2015-05-19", "url": "http://www.dailyrecord.co.uk/sport/football/football-news/dundee-united-captain-sean-dillon-5723911", "content": "T in the Park is voted UK's best value music festival ahead of rivals including Reading/Leeds, Glastonbury and V Edinburgh Fringe: <mark>John Hannah</mark>, <mark>Alan Cox</mark> and Jeffrey Holland among big names set to perform at festival BBC weather presenter Judith Ralston cries tears of relief after police help her escape car park drama Man \"sneaks into women's loos to eat FAECES - and has done for EIGHT YEARS' See cop KARATE KICK handcuffed suspect in the head TWICE as fellow police officers stand by and watch Ex-Apprentice star jailed for\" flagrant contempts of court' in tug-of-love legal battle with former partner Horrifying moment hit-and-run cyclist riding on pavement smashes into three-year-old girl and drags her 12ft Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I don't know how much of my own money I will invest in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 million <mark>Dave King</mark>: It will cost Rangers £ 30million to catch Celtic and become a force in Europe again Rangers 2 Hibernian 0: Rangers fans set the standard and the players deliver in first leg play off victory Celtic scrap move for Jonathan Mensah: FIFA ban rules out bid Scottish champions' bid for Ghana World Cup star Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I don't know how much of my own money I will invest in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 million <mark>Dave King</mark>: It will cost Rangers £ 30million to catch Celtic and become a force in Europe again Watch as two lovers find out they're BROTHERS after most intense Jeremy Kyle DNA result yet Paolo Nutini's dad says singer is \"wee bit upset' his old man met up with Godfather actor Al Pacino at Scots gig Jeremy Clarkson returns to BBC for first interview since Top Gear controversy and insists: I was NOT sacked DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club .\" data-type = \"fb-share\" data-action = \"article:5723911\" > DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. \"data-type =\" tw-share \"data-action =\" article:5723911 \"> DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. Sean Dillon in action for Dundee United DUNDEE UNITED captain Sean Dillon has signed a new deal with Jackie McNamara's side that will see him remain at Tannadice until May 2017. The 31-year-old defender - who has made 293 appearances since signing in January 2007, has agreed a two-year extension to add to the eight years he has already spent on Tayside. Manager McNamara was delighted to secure Dillon on a new deal and told United's official website:\" I am happy to secure Sean for a further two seasons. He is immensely valuable to the club both on and off the field. \"On field, Sean has a versatility which means I can call on him to cover a number of positions and in the dressing room and as an ambassador for the club he is the model professional and the ideal role model for our younger players. Sean Dillon is delighted to have committed to Dundee United for a further two years\" It is very rare in today's football world that a player commits ten years to one club and by signing this contract, Sean has ensured he will be a United player for that length of time. \"His commitment to Dundee United is amazing and I believe he will continue to prove a valuable part of the squad for the foreseeable future .\" Dillon was ecstatic to have his future at Tannadice secured and said: \"I love playing for Dundee United .\" This Club is obviously a massive part of my life and the Dundee area is my family home. I have had many happy days here and have enjoyed success. I am delighted to get the contract signed and can now look forward to helping the Club achieve even more success. \"The support I receive from the United fans has always been excellent and I am proud to continue to wear the tangerine top for another two years .\" Record FC Dundee United: Jackie McNamara has lost the fans. . it's best for everyone he goes now Djokovic will be the eighth man to achieve a career Grand Slam if he wins the French Open. \",\" isResultYoutube \": false,\" answeroptions \": [{\"answerletter\" : \"A\" , \"answertext\" : \"Win a career Grand Slam\" , \"correctanswer\" : true}, {\"answerletter\" : \"B\" , \"answertext\" : \"Win the French Open three times\" , \"correctanswer\" : false}, {\"answerletter\" : \"C\" , \"answertext\" : \"Remain undefeated for a year\" , \"correctanswer\" : false}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i4.dailyrecord.co.uk/incoming/article5465383.ece/ALTERNATES/s318/JS60665765.png\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"If Novak Djokovic wins the French Open, he will become the eighth man to achieve what career milestone?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"2\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"<mark>Owais Shah</mark> holds the record with 5128 runs .\" , \"isResultYoutube\" : false, \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"<mark>Luke Wright</mark>\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"<mark>Owais Shah</mark>\" , \"correctanswer\" : true}, {\"answerletter\" : \"C\" , \"answertext\" : \"Ravi Bopara\" , \"correctanswer\" : false}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i2.dailyrecord.co.uk/incoming/article5721778.ece/ALTERNATES/s318/CD30124327.jpg\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"Who holds the record for the most runs by an English batsman in all Twenty20 cricket?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"3\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"Wigan manager <mark>Gary Caldwell</mark> is the youngest manager at 33 years old .\" , \"isResultYoutube\" : false, \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"<mark>Adam Murray</mark>\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"<mark>Gary Caldwell</mark>\" , \"correctanswer\" : true}, {\"answerletter\" : \"C\" , \"answertext\" : \"Karl Robinson\" , \"correctanswer\" : false}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i4.dailyrecord.co.uk/incoming/article2123398.ece/ALTERNATES/s318/Gary-Caldwell.jpg\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"Garry Monk is the youngest manager in the Premier League but who is the youngest in the whole of the Football League?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"4\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"Hermann Hreidarsson and Nathan Blake hold the record for most Premier League relegations .\" , \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"Ashley Ward and Nigel Quashie\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"Hermann Hreidarsson and Nathan Blake\" , \"correctanswer\" : true}, {\"answerletter\" : \"C\" , \"answertext\" : \"Marcus Bent and Nathan Blake\" , \"correctanswer\" : false}], \"description\" : \"\",\" questiontext \":\" Which two players hold the record for most Premier League relegations? \"},\" totalquestions \":\" 5 \"}}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"5\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"Sir Bradley Wiggins is the only British cyclist to have won the Tour of California .\" , \"isResultYoutube\" : false, \"isLastQuestion\" : true, \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"Chris Froome\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"Mark Cavendish\" , \"correctanswer\" : false}, {\"answerletter\" : \"C\" , \"answertext\" : \"Sir Bradley Wiggins\" , \"correctanswer\" : true}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i1.dailyrecord.co.uk/incoming/article5722074.ece/ALTERNATES/s318/CS62213266.jpg\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"Who is the only British cyclist to have won the Tour of California?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}]}], \"quizContentTitleFriendly\" : \"quick-quiz-sport-19515\" } \"data-share =\" [{\"ico\" : \"facebook\" , \"intro\" : \"\\ n DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. \\ n\" , \"omnitureAction\" : \"article:5723911\" , \"name\" : \"Share\" , \"styleclass\" : \"fbShare\" , \"label\" : \"Facebook\" , \"title\" : \"Dundee United captain Sean Dillon signs two-year contract extension at Tannadice\" , \"url\" : \"http: //www.dailyrecord.co.uk/sport/football/football-news/dundee-united-captain-sean-dillon-5723911 #ICID=sharebar_facebook\" , \"omnitureType\" : \"fb-share\" }, {\"ico\" : \"twitter\" , \"intro\" : \"\\ n DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. \\ n\" , \"omnitureAction\" : \"article:5723911\" , \"name\" : \"Tweet\" , \"styleclass\" : \"twShare\" , \"label\" : \"Twitter\" , \"title\" : \"Dundee United captain Sean Dillon signs two-year contract extension at Tannadice\" , \"url\" : \"http: //www.dailyrecord.co.uk/sport/football/football-news/dundee-united-captain-sean-dillon-5723911 #ICID=sharebar_twitter\" , \"omnitureType\" : \"tw-share\" }, {\"ico\" : \"googleplus\" , \"intro\" : \"\\ n DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. In Pictures: Dundee United launch their new home kit for 2015/16 Scottish Premiership season CAPTAIN Sean Dillon modelled the latest take on the famous tangerine jersey as he announced signing a two-year contract extension at Tannadice. Sean Dillon hell-bent on clinching Euro spot after signing new two-year Dundee United deal Dundee United boss Jackie McNamara defends his decision to pick blundering rookie keeper Michal Szromnik in Tayside derby POLISH goalie looked suspect as St Johnstone eased to a 2-0 win but Tannadice gaffer says starting with Szromnik was the right call. Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I don't know how much of my own money I will invest in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 million Rangers 2 Hibernian 0: Rangers fans set the standard and the players deliver in first leg play off victory Celtic scrap move for Jonathan Mensah: FIFA ban rules out bid Scottish champions' bid for Ghana World Cup star BBC weather presenter Judith Ralston cries tears of relief after police help her escape car park drama Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I'll invest more than £ 20million in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 m Man\" sneaks into women's loos to eat FAECES - and has done for EIGHT YEARS '", "articleID": "2015052115_00029493_W", "names": {"Adam Murray": ["Q3604998", "Q43914471"], "Alan Cox": ["Q28764566", "Q4706432", "Q4706436", "Q55123"], "Dave King": ["Q1173256", "Q15509384", "Q19118748", "Q20645742", "Q20645771", "Q5229102", "Q729093", "Q936186"], "Gary Caldwell": ["Q3098523", "Q334628", "Q42789154"], "John Hannah": ["Q1377462", "Q18044018", "Q298243"], "Luke Wright": ["Q3529926", "Q6702480"], "Owais Shah": ["Q23664755", "Q6831317"]}}, {"date": "2015-05-22", "url": "http://www.brookings.edu/blogs/brookings-now/posts/2015/05/how-to-create-opportunity-in-baltimore-and-beyond?rssid=Blogs", "content": "\"Since Freddie Gray's death and all that has followed, I think many of us, maybe all of us in Baltimore, have experienced a collective, pervasive ache .\" Jennifer S. Vey, a Brookings Metropolitan Policy Program fellow and Baltimore resident, shared her personal response to the death of Freddie Gray and subsequent riots while introducing a recent Brookings panel focused on creating more opportunities for young people and families in distressed communities and the role of place in poverty. Though the events in Baltimore served as the backdrop for a discussion among experts from the nonprofit, community development and public policy sectors, Vey reminded the audience that the challenges faced by her city \"are far from unique\" and that the difficult lessons learned and paths forward following its recent challenges can be applied to struggling urban areas nationwide. Remember that \"it takes a village\" Amy Liu, co-director of the Metropolitan Policy Program, echoed Vey's point, noting that there's currently a broad, national discussion taking place about poverty. (Including a In order to sustain this national conversation and identify real solutions, Liu stressed the importance of convening leaders and organizations who have been on the front lines of these issues. As she put it, \"to convert neighborhoods of poverty to neighborhoods of opportunity, it takes a village. And we've brought a mini village in today .\" Ensure that redevelopment is linked to employment opportunities Part of that village included Bart Harvey who, like Vey, calls Baltimore home. As former CEO of Enterprise Community Partners, a nonprofit focused on developing public-private partnerships to create affordable housing, Harvey helped families purchase about 400 homes in Freddie Gray's neighborhood, Sandtown-Winchester, 20 years earlier. When Harvey returned to the neighborhood a day after the riots, what he witnessed, he said, \"was very different than what you might have expected .\" \"Being a Baltimorean I was [initially] heartbroken, but when I went and toured all of the investments Enterprise had made, and they looked better than they did 20 years ago when we built there. Homeowners were there, and there was a beating heart at the center of Winchester. That was very positive and reassuring .\" If the investments made by Harvey's organization in housing were (and remain) successful, then what went wrong? Harvey said that a lack of economic growth in the area-and associated jobs-are likely to blame. \"There wasn't an economic driver that kept that redevelopment going past where the homeowners and stability were in Sandtown-Winchester. The employment didn't occur .\" The key, Harvey says, to sustaining growth in neighborhoods like Sandtown-Winchester is working to ensure that once housing investments are made, \"economic development and employment follow .\" Plan for change Donald Hinkle-Brown, CEO of The Reinvestment Fund, agreed with Harvey, and attributed careful economic planning to his organization's success in revitalizing other low-income Baltimore neighborhoods. Hinkle-Brown noted that after initiating prudently planned, data-driven building and investment projects, the private market has followed suit. \"The private market is drafting on our wind, and that is what makes it manageable in terms of public subsidies in today's environment of shrinking budgets,\" said Hinkle-Brown. But he was careful to distinguish his organization's work from traditional gentrification, reminding the audience that \"this is planned change. What we're trying to do is manage a joint effort [between public and private sectors] to build value and opportunity for existing residents and new residents in a way that's managed and self-sustaining .\" Focus on more doing and less planning Derek Douglas, vice president for civic engagement at the University of Chicago and former member of the White House Domestic Policy Council, joined the conversation with a unique perspective from both his past policy work and his current role as a representative of the largest economic driver on Chicago's South Side. Douglas's advice for moving the needle in our nation's most troubled urban areas: More doing, less planning. As he put it: \"If you go into these communities they'll have 50 plans, and every year some new group is coming to do a plan. And they feel that they're essentially planned all the time, with nothing ever actually happening .\" This phenomenon, Douglas said, \"is actually a negative for a community .\" In his role at the University of Chicago Douglas has put this advice into practice by helping fully implement civic engagement programs, like UChicago's Urban Labs, that leverage the university's offerings throughout South Side communities. Involve young people in improvement projects Joel Miranda, director of leadership development and graduate leadership at YouthBuild USA, a nonprofit that provides support for unemployed young Americans, says many of the solutions we seek for improving struggling communities can come from the very group that is often blamed for a variety of issues in these areas: local youth. \"If you simply stop and ask a young person what they'd like to do their community, they'll have lots of great ideas,\" said Miranda. Moreover, once some of those ideas are put into place, Miranda says young people are more likely to feel a connection to and invest in the well-being of their communities. \"Once young people are building community assets, they remember that for a lifetime. They drive past that house, that building that they helped build, and they say' I built that, and therefore I am taking care of care of that .'\" When it comes to funding projects, \"un-crowd the field\" and \"bet on winners\" When it comes to successful grant giving, <mark>Michael Smith</mark>, special assistant to President Obama and senior director of cabinet affairs for My Brother's Keeper stressed the importance of funding the right, data-driven organizations. \"As obsessed as we are in American with data...our FitBits, our Apple watches, our Trip Advisor and our Yelp, when it comes to organizations that are supposed to be [our] springboards and safety nets, we throw that all out the window .\" Rather than continuing to invest in organizations \"because our grandparents invested in them, or because it has a friendly member in the legislature,\" he argued that in our current economy, the impetus is on funders to recognize \"that good is not good enough\" and to \"stop investing in organizations that are counting how many kids went through, and not counting real, meaningful impact .\" ", "articleID": "2015052418_00017282_W", "names": {"Michael Smith": ["Q15637781", "Q1620255", "Q16207164", "Q16225563", "Q1627389", "Q16976514", "Q1720858", "Q18325554", "Q18325556", "Q18344457", "Q1929419", "Q1982423", "Q21175251", "Q3856267", "Q52907019", "Q56394971", "Q58870848", "Q6829665", "Q6831697", "Q6834460", "Q6834463", "Q6834464", "Q6834465", "Q6834468", "Q6834469", "Q6834471", "Q6834472", "Q6834473", "Q6834474", "Q6834475", "Q6834476", "Q6834478", "Q6834480"]}}]