[{"articleID": "2010021504_00090364_W", "names": {"Karan Singh": ["Q1234662", "Q16887704", "Q18921535"]}, "date": "2010-02-15", "url": "http://blog.taragana.com/health/2010/02/14/indian-data-on-swine-flu-shamefully-inadequate-virologist-19406/", "content": "0 indian data on swine flu shamefully inadequate: virologist bangalore - warning that india should brace for more deaths from the swine flu (h1n1) pandemic, a leading virologist has described as \"shameful\" the lack of scientific data on its outbreak in the country. \"even though india has over 28,000 confirmed cases and 1,152 deaths - which would translate into manifold more - no epidemiological analysis of the indian outbreak is found in the public domain,\" says shahid jameel of the international centre for genetic engineering and biotechnology (icgeb), new delhi. \"we do not know the risk factors for the indian population, the reasons for a mortality rate that is about three to four times the global average, or any epidemiological details of the terrifying spread in cities like pune,\" jameel wrote in the latest issue of the journal \"current science'. there are also no genomic sequences from india uploaded in public databases, making it difficult to analyze the virus circulating in india, he said .\" considering that icmr (indian council of medical research, new delhi) has an entire national institute dedicated to disease epidemiology (national institute of epidemiology, chennai), it is shameful that no epidemiological analysis of the outbreak is available, \"the scientist who heads the virology group in icgeb noted with surprise. he said it is imperative that such information be in the public domain for all stakeholders to analyse it and participate in the vaccination strategy. reacting to statements by icmr and the health ministry that a vaccine against the h1n1 pandemic virus will soon undergo bridge trials in the country, jameel wonders who will receive it .\" have we identified the risk groups? \", he asks pointing out that in the absence of any epidemiological analysis of the indian outbreak it is difficult to select the recipients .\" even in the presence of a public health preparedness plan, an early initiative to screen for the pandemic virus, and the government's generous spending on the testing initiatives, experts believe that a poor healthcare infrastructure has failed the country, \"jameel said .\" there is a clear need to strengthen that. \"jameel said the government's aggressive screening of passengers at ports of entry did help delay the spread of the virus in india by two to three weeks, but it eventually followed an expected pattern of spread - first in large urban centres followed by small towns .\" we do not even know the situation in rural areas, \"jameel said. according to jameel, daily updates being released by the health ministry since aug 1, 2009, remains the only source of information on h1n1 spread in india. based on the analysis of this limited data - updated till jan 20, 2010, - jameel has concluded that h1n1 cases did increase in what appeared to be a second wave .\" since the \"mortality curve' runs almost parallel to the\" cases curve,' and as the number of cases increase, we should be prepared for more deaths, \"he warns. according to jameel, an over-zealous media coupled with the government's perceived lack of transparency and an inherent mistrust of the government system created widespread panic and knee-jerk reactions. this is not good for dealing with any pandemic, he said. jameel predicted there will be more cases and more deaths, but calm and sustained response (and not panic) is the only way to overcome it. at the same time, he said, there is a need for more transparency from government institutions and the media should be considered partners in disseminating the message .\" and the message is that this pandemic is serious but we have the tools to manage it. \"thankfully, the mortality is still low, said jameel, the question remains if this virus will return in a more virulent form in the next wave .\" the 1918 pandemic started that summer as a mild disease, but in the next wave during winter, the virus came back in a highly virulent form, eventually infecting about a third of the world population and killing an estimated 40-50 million people. \"according to the icgeb scientist,\" this history of pandemic flu is reason enough to exercise caution and limit virus transmission in the human population \". cdc: swine flu has made more than 57 million americans ill, but cases remain down lately february 12th, 2010 new delhi - the indian council for cultural relations (iccr) has set up a full-fledged indian cultural centre (icc), complete with a dance studio, music and yoga rooms, in kuala lumpur in malaysia, a statement said friday. inaugurated by iccr president <mark>karan singh</mark> and malaysia's human resource minister s. january 19th, 2010 new delhi - the indian capital wednesday reported eight new swine flu cases, taking the total number in the city to 9,608, an official said .\" there were eight new cases of influenza a (h1n1), of which four were children, \"anjana prakash, the assistant nodal officer handling swine flu cases in delhi, told ians. january 5th, 2010 new delhi - with 14 new cases of swine flu reported tuesday, the total number in the indian capital now stands at 9,495, a health department official said .\" there were 14 new cases of influenza a (h1n1) today. december 11th, 2009 new delhi - with over 20,000 swine flu cases in the country, the central government has initiated talks with four international vaccine manufacturers to import the h1n1 vaccine, health minister ghulam nabi azad said friday. \"the government is exploring the possibility of importing the h1n1 vaccines and anticipating early release of foreign made vaccines,\" azad told the lok sabha during question hour. new delhi - ayurveda plays a \"positive role\" in preventing swine flu, which has claimed over 630 lives in india and infected around 20,000 people, but there is no scientific data to prove its efficacy, the rajya sabha was informed tuesday. in a written reply, minister of state for health and family welfare s. december 7th, 2009 new delhi - four more swine flu patients have died in the indian capital, taking the total to 34, officials said monday. but they refused to count a fifth fatality because he was not from delhi. november 22nd, 2009 chandigarh - the health department here has directed the school and college authorities to compile data of students who took off from the educational institutions due to swine flu, an official said sunday. the decision has been taken in the wake of falling attendance in schools and colleges. november 5th, 2009 new delhi - the traditional indian healthcare system was a \"comprehensive solution\" to healthcare problems as it reached out to the masses unlike western methods that only touched \"the top of the pyramid\" , national knowledge commission chairperson sam pitroda said here thursday. in his keynote address at the sixth india health summit in the capital, pitroda said: \"for a comprehensive solution to our healthcare shortcomings, we need to adopt the traditional indian model in the healthcare system .\" \"the indian healthcare system reaches out to the bottom of the pyramid while the western method of healthcare reaches only the top of the pyramid,\" he added. october 28th, 2009 washington - a triple-combo experimental drug has shown promise in treating the resistant h1n1 swine flu virus, says a virology researcher. in the lab, the triple combination of oseltamivir (tamiflu), amantadine (symmetrel) and ribavirin showed a significant capacity to stop flu-virus growth, says mark prichard, university of alabama birmingham (uab) virologist. higher vitamin d intake may help fight off back aches, pains in winter washington - higher intake of vitamin d in winters can help people get rid of extra soreness and aches in their backs, say researchers. the study showed that patients with chronic back pain usually had inadequate levels of vitamin d and when sufficient vitamin d supplementation was provided, the pain either vanished or was at least helped to a significant extent. new delhi - mental illness will be the biggest health risk in india by next year but the number of specialist doctors to deal with it is grossly inadequate. hoping to fill the huge gap, the national human rights commission (nhrc) has suggested that mental health be made a separate subject for medical students. cdc: nearly half of patients hospitalized for swine flu were healthy, with no other conditions nearly half of swine flu patients were healthyatlanta - the largest u.s. analysis of adult hospitalized swine flu patients has found that 46 percent did not have asthma or any other underlying condition. september 25th, 2009 hyderabad - india's exports of drugs, pharmaceuticals and fine chemicals grew by 29 percent last fiscal to rs .39,538 crore (around $9.35 billion) compared to the previous fiscal, commerce and industry minister anand sharma said friday. \"in recent times, the indian pharmaceutical sector has emerged as one of the major contributors to indian exports with export earnings rising from a negligible amount in early 1990s to rs .29,139.57 crore by 2007-08,\" sharma said while addressing the indo-africa pharma business meet here. september 23rd, 2009 new delhi - with a surge in flu cases in the indian capital, delhi health officials wednesday said people were staying away from taking immediate medical help even after showing symptoms of the disease. \"despite all our efforts to make people aware that they should immediately approach the nearest hospital if they show swine flu-like symptoms, the majority are not following it."}, {"articleID": "2009121818_00086193_W", "names": {"Sam Houston": ["Q6834480", "Q7407635"]}, "date": "2009-12-18", "url": "http://nsudemons.com//ViewArticle.dbml?DB_OEM_ID=20000&ATCLID=204859805", "content": "12.16.09 men's basketball vs. grambling (dh) (l) 62 - 63 12.16.09 women's basketball vs. grambling (w) 93 - 62 12.12.09 women's basketball vs. arkansas-pine bluff (w) 76 - 74 12.08.09 men's basketball vs. lsu - shreveport (w) 83 - 73 12.06.09 women's basketball vs. alabama (l) 56 - 61 justin aldredge has a 3.90 gpa in accounting chattanooga, tenn.--northwestern state sophomore justin aldredge, an honorable mention all-southland conference tight end this season, was selected for the 12th annual football championship subdivision athletics directors association academic all-star team announced friday. a seven-member review panel of athletics directors from around the nation's fcs ranks selected 55 winners from 86 total nominees. the winners were announced at the site of friday night's fcs national championship game in chattanooga. aldredge has a 3.90 grade point average in accounting. he was a first-team espn the magazine academic all-district 6 selection earlier this fall, earning the honor in a region that includes all division i football programs in new mexico, oklahoma, texas, arkansas, mississippi and louisiana. he had a breakout year in his first season at tight end after playing linebacker as a freshman. the 5-11, 215-pound ruston-cedar creek product led nsu this season with four touchdown receptions and ranked third on the team with 25 catches for 328 yards. he also scored another td on a 1-yard run. aldredge was among four southland conference student-athletes chosen for the fcs ada academic all-star team. also selected were all-american defensive end tim knicky, a senior at stephen f. austin with a 3.33 gpa in kinesiology; <mark>sam houston</mark> state offensive lineman jordan bowersox, a graduate student who has a 3.73 gpa in finance; and texas state defensive lineman travis <mark>houston</mark>, a senior with a 3.65 gpa in a double major of finance and computer information systems. \"the fcs ada looks forward to honoring outstanding student-athletes each year, which culminates with the annual academic all-star team announcement,\" said fcs ada president peter fields, chair of the selection committee and athletics director at montana state. \"these football players that represent the true meaning of the student-athlete concept and we are proud of their accomplishments both in the classroom and on the field .\" football players from all fcs institutions are eligible for the prestigious awards. each of the nominees were required to have a minimum grade point average of 3.20 (on a 4.00 scale) in undergraduate study and have been a starter or key player with significant athletics credentials. he must have reached his second year of athletics and academic standing at the nominated institution and have completed a minimum of one full academic year at the nominated institution. he must also have participated in 50 percent of the games played at his designated position. kelsey ream returns from injury to help penn state nittany lions women's volleyball in ncaa tournament"}, {"articleID": "2019022721_00241261_W", "names": {"Doug Collins": ["Q18352424", "Q3162841", "Q5300375", "Q919954"]}, "date": "2019-02-27", "url": "http://wtvbam.com/news/articles/2019/feb/27/us-house-approves-expanded-background-checks-for-gun-sales/", "content": "U.S. House approves expanded background checks for gun sales Wednesday, February 27, 2019 4:20 p.m. EST FILE PHOTO: Rifles are displayed for sale at the Guntoberfest gun show in Oaks, Pennsylvania, U.S., October 6, 2017. REUTERS/Joshua Robert By Amanda Becker WASHINGTON (Reuters) - The U.S. House of Representatives on Wednesday passed a bill that would expand background checks for gun sales to include firearm purchases at gun shows and over the internet, a measure likely to face Senate and White House opposition. The background check bill, which was approved by a 240-190 vote, is the first gun control measure taken up by Democrats since they regained control of the House in the 2018 congressional midterm elections. The bill is likely to face opposition when it goes to the Republican-controlled Senate, however. It would also need President Donald Trump's signature in order to become law. The White House said on Monday that Trump's advisers would recommend the president veto the legislation because it would apply \"burdensome requirements\" that are \"incompatible with the Second Amendment's guarantee of an individual right to keep arms .\" Trump has previously indicated he supported efforts to extend background checks to all gun sales. \"I will be strongly pushing Comprehensive Background Checks with an emphasis on Mental Health. Raise age to 21 and end sale of Bump Stocks! Congress is in a mood to finally do something on this issue - I hope!\" Trump tweeted a year ago, after a shooting at a high school in Parkland, Florida, that left 17 dead. Representative Steny Hoyer, the No. 2 House Democrat, told reporters on Tuesday that Republicans had prevented a vote on a background check bill when they controlled the chamber, and that while there were differences among Democrats about how to curb gun violence, the background check bill had broad support. \"The carnage that we've seen perpetrated by gun violence over the last decade has heightened the American people's concern, and the bill that we're putting on the floor we believe has the support of 90 percent of the American people,\" Hoyer said. From 2009 to 2017, there were at least 173 shootings in the United States in which four or more people were killed, with at least 1,001 total deaths, according to the advocacy group Everytown for Gun Safety. Representative <mark>Doug Collins</mark>, the top Republican on the House Judiciary Committee where the background check bill originated, said on Wednesday that the bill was ineffective because it \"foolishly presumes criminals who flout existing laws will suddenly submit themselves to background checks .\" The House is set to vote on Thursday on a second bill that would extend the time it takes to conduct a background check before a gun sale to 10 days from minutes. (Reporting by Amanda Becker; Editing by Sonya Hepinstall) More From National North Carolina Republican operative charged in election fraud scheme U.S. top court backs killer who forgot crime in death penalty case Johnson and the House vote to block Trump's emergency declaration U.S. bars lithium batteries as cargo on passenger aircraft Northern California community isolated as rain-swollen river rises U.S. top court sympathetic toward Maryland cross in major religion case Comments"}, {"articleID": "2019030619_00497682_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Paul Blair": ["Q1524916", "Q7149400"]}, "date": "2019-03-05", "url": "http://hypervocal.com/items/2511306", "content": "Scott Gottlieb, the leader of the Food & Drug Administration (FDA), is resigning his position effective next month, the <mark>Trump</mark> administration announced Tuesday. In a note to FDA staff, Gottlieb said he was leaving to spend more time with his family. \"There's nothing that could pull me away from this role other than the challenge of being apart from my family for these past two years and missing my wife and two young children,\" he wrote. His replacement has not been announced. ADVERTISEMENT Gottlieb, a physician and cancer survivor, has been one of President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> Tlaib to join protest calling for <mark>Trump</mark> impeachment Ex-Trump campaign aide says he might not cooperate in House Dem probe <mark>Trump</mark> to meet with former Yemen hostage: White House MORE's most popular appointments and appeared to be widely liked within Congress by both Democrats and Republicans. He led the agency's response to the opioid epidemic, and recently has been cracking down on youth vaping. Gottlieb has also made it an agency priority to speed up approvals for generic drugs. During his confirmation process, congressional Democrats and outside groups sounded the alarm about Gottlieb's industry connections, warning they pose major conflicts of interest. He had investments in 20 different health-care companies that made products regulated by the agency. Gottlieb is the only FDA commissioner who worked in the pharmaceutical industry prior to being nominated; the others have mainly come from public health or academia. But he won over skeptics with his focus on bringing down high drug prices and reducing youth smoking rates. His resignation was unexpected, as he recently hired senior staff. \"I want to be very clear--I'm not leaving,\" he tweeted two months ago. \"We've got a lot important policy we'll advance this year .\" In a statement Tuesday, Health and Human Services Secretary Alex Azar praised Gottlieb's contributions to the agency. \"He has been an exemplary public health leader, aggressive advocate for American patients, and passionate promoter of innovation,\" Azar said. \"Scott's leadership inspired historic results from the FDA team...The public health of our country is better off for the work Scott and the entire FDA team have done over the last two years .\" I will personally miss working with Scott on the important goals we share, and I know that is true for so many other members of the HHS family, \"Azar added. In his resignation letter, Gottlieb listed a host of agency accomplishments under his tenure, including a record number of generic drug approvals. He lavished praise on agency staff for being able to avert drug and device shortages in the aftermath of Hurricane Maria in Puerto Rico. This was Gottlieb's second stint at FDA. He served as a deputy FDA commissioner under former President George W. Bush before leaving the agency in 2007. After he left the agency, Gottlieb served on the boards of pharmaceutical companies, worked as a venture capitalist and was a resident fellow at the American Enterprise Institute, a conservative think tank. Gottlieb's resignation occurs as his signature plan to crack down on the\" epidemic \"of youth vaping is poised to be released. The FDA rule that would sharply limit the sales of flavored e-cigarettes, which he says are attractive to kids, is under review at the White House. Gottlieb has tried to balance restricting the sales of e-cigarettes to youth, while also making sure they are available as a tool to help adults quit smoking traditional cigarettes. He has frequently threatened companies that he would pull their products off the market if they didn't stop marketing to teenagers. The rule has not been made public yet, but Gottlieb has previously proposed limiting the sales of most flavored e-cigarettes to age-restricted, in-person locations, effectively ending sales at gas stations and convenience stores. He also recently requested meetings with the leaders of e-cigarette manufacturers and large retailers about what they're doing to keep the devices away from kids. The initiative drew praise from some anti-tobacco activists, but was criticized by conservatives and some Republican members of Congress who said he was going too far .\" The FDA is a stand out agency, across the administration, that's moving in the completely wrong direction, \"said <mark>Paul Blair</mark> of Americans for Tax Reform, which led a coalition of conservative groups seeking to block the changes. <mark>Blair</mark>, in an interview before Gottlieb's resignation, said the commissioner's approach to regulation is inconsistent with the president's agenda .\" Without your intervention, Commissioner Gottlieb may not only destroy tens of thousands of jobs at small stores and manufacturers, but he will prevent some of the more than 35 million American adults who still smoke tobacco cigarettes from ever successfully quitting, \"ATR and 18 other groups wrote in a letter to <mark>Trump</mark> last month. Tobacco stocks briefly spiked on the news Gottlieb was planning to resign; shares of Altria, which recently invested $13 billion in e-cigarette maker Juul, jumped almost $2 a share before leveling off. President <mark>Trump</mark> on Tuesday tweeted that Gottlieb\" has done an absolutely terrific job as Commissioner of the FDA. \"\"Scott has helped us to lower drug prices, get a record number of generic drugs approved and onto the market, and so many other things. He and his talents will be greatly missed!\" <mark>Trump</mark> said. Gottlieb waded into the drug pricing fray shortly after he took charge of the agency. He wrote in a public blog posting that high drug prices are \"a public health concern that FDA should address .\" In a speech, he said he wanted to \"end the shenanigans\" that interfere with competition. ADVERTISEMENT The FDA has historically stayed out of the drug pricing debate, but Gottlieb insisted the pricing issue fits with the agency's mission. In an interview with The Hill last year, he said unleashing free market forces is the key to lowering drug prices. Members of Congress who worked with Gottlieb called him an effective leader and public servant. \"In all my years of public service, I've never worked with a more talented, forthright, and effective agency leader than Dr. Scott Gottlieb,\" said Rep. Greg Walden Gregory (Greg) Paul Walden FDA chief Scott Gottlieb resigns State rules complicate push for federal data privacy law A conservative climate plan will build on personal responsibility while reducing emissions MORE (R-Ore .), the top Republican on the House Energy & Commerce Committee. \"He worked effectively with Congress to find solutions and to improve the quality of life for all of us .\" Updated at 5:26 p.m. Tags <mark>Donald Trump</mark> Greg Walden e-cigarettes Health FDA resignation <mark>Trump</mark> Cabinet"}, {"articleID": "2009050601_00017332_W", "names": {"Dean Martin": ["Q5246331", "Q5246333", "Q5246334"], "Rod Taylor": ["Q16197304", "Q17375854", "Q308459", "Q3438108"]}, "date": "2009-05-06", "url": "http://presstelegram.com/ci_12298910?source=rss_viewed", "content": "cerritos man's death apparently is not tied to home-invasion robberies students at long beach schools bring city's swine flu count to 5; all are recovering failure to upgrade gas pumps cost long beach $48,000 in overtime dom deluise died in southern california on monday, may 4, 2009, according to his son, michael deluise. he was 75. (ap photo/mark terrill, file) comedic actor dom deluise, known for his work alongside burt reynolds in the \"cannonball run\" movies and in a spate of screwball mel brooks comedies, has died in a santa monica hospital. he was 75. deluise, who was also a director, author and chef, died in his sleep monday evening, according to the celebrity news web site tmz.com. he leaves behind wife carol arthur and three sons: actor/writer/director son peter deluise and actors david and michael deluise. michael deluise told ktla5 that his father was surrounded by family at the time of his death. the brooklyn-born funnyman, whose \"dominick the great\" routine earned him regular appearances on the <mark>dean martin</mark> show (1965-74), hammed it up in such brooks comedies as \"blazing saddles,\" \"silent film,\" \"history of the world, part i,\" \"spaceballs\" and \"robin hood: men in tights .\" in the 1980 film \"fatso,\" directed by anne bancroft, the portly deluise played a food-obsessed dieter, who eventually meets the love of his life and conquers his appetite. with reynolds, he was in \"cannonball run\" and the sequel, \"smokey and the bandit ii,\" \"the end,\" \"the best little whorehouse in texas\" and \"all dogs go to heaven .\" in a 1996 episode of \"3rd rock from the sun,\" deluise appeared with all three of his sons, a stunt he also pulled off in a 1993 episode of \"seaquest dsv .\" over the years, he appeared in dozens of episodic and variety television shows high school of performing arts in new york city, made his film debut in 1964's \"diary of a bachelor\" and appeared that same year in sidney lumet's \"fail-safe .\" next, in 1966, was the romantic comedic--some called it a musical--\"the glass bottomed boat,\" with doris day and <mark>rod taylor</mark>. deluise's first film with brooks was the 1970 slapstick \"the twelve chairs,\" set in russia."}, {"articleID": "2019040923_00109917_W", "names": {"Stephen Jones": ["Q11836360", "Q1380938", "Q17476791", "Q2374211", "Q25345871", "Q2670107", "Q4160428", "Q43565191", "Q47119713", "Q56598186", "Q7609616", "Q7609617", "Q7609618", "Q7609619", "Q7609620", "Q7609622", "Q7609623", "Q7612967"]}, "date": "2019-04-09", "url": "http://www.inverelltimes.com.au/story/6011642/labor-pushes-investigation-into-phone-tower-on-rineharts-kingstown-property/?src=rss", "content": "Local News news, local-news, An investigation request into a phone tower on Gina Rinehart's New England property has been filed with the Auditor-General. A letter from Labor's regional communications spokesman <mark>Stephen Jones</mark> has asked that the decision to place the tower on the Kingstown property be scrutinised. \"I believe the decision-making around the location of this particular base station should be investigated to ascertain if proper departmental procedures were adhered to and if decision-making was influenced by factors outside of the program objectives,\" Mr <mark>Jones</mark> wrote. \"I understand that you are already considering an audit of Round 3 of this program .\" In that round, the Coalition Government selected the locations for co-funding, leading to criticisms from state governments alleging the program was not delivering good outcomes for the community. \"Kingstown residents have complained that the tower has been plagued by reception problems since it was switched on two weeks ago. Member for New England Barnaby Joyce campaigned for the tower and announced it as part of the federal government's Mobile Black Spot program in June 2015. He said he had no say in the exact location of the phone tower in Kingstown. Mr Joyce told The Inverell Times on Tuesday afternoon that the referral of the issue to the auditor-general was a political stunt .\" The Labor Party of course will play games, this is a political tactic, \"he said .\" I could refer anything; I could refer Mr <mark>Jones</mark> if I wanted too. \"Mr Joyce said he worked to get the funding for the tower in the village, but where it is placed is up to Telstra. He rejected any assertion he had any dealings with Gina Rinehart on the issue, and said the government and Telstra negotiated with the previous owners of the property, prior to her purchase\" I have never have had any conversation with Ms Rinehart with any purchase of hers in the New England, \"Mr Joyce said .\" Any negotiations about the phone tower do not include me; I provide the money for a phone tower in Kingstown, it's up to Telstra where it puts it. \"If it was up to me, I would have put it on top of the hill so that it gives coverage to the whole town .\" The tower is located on Sundown Valley, a property purchased by Gina Rinehart's pastoral arm, Hancock Agriculture, in August last year. But the contract with Telstra to host the tower was signed by the previous owners, Hancock Agriculture chief executive David Larkin told the Times, and said the annual rent paid on the tower was not a motivation. The Australian National Audit Office (ANAO) will now consider the request, a spokesman for the Auditor-General said. \"As outlined in the ANAO corporate plan, the Auditor-General aims to respond to the vast majority, 90 per cent, of requests for audit within 28 days,\" he said. It's not the first time the federal government's Mobile Black Spot program has been referred to the national audit body. READ MORE: Third drought assistance package announced A 2016 ANAO investigation found the $110 million program did not target the funding to areas where coverage had not previously existed. At least 89 of the 499 base stations provided minimal new coverage at a cost of $28 million; that means the public funded a program that did not extend coverage into new areas. The investigation also found that there was not a structured method for assessing the technical and financial aspects of proposals. It found that the department's ability to measure the effectiveness of the program was difficult, given there was no way to evaluate it. https: //nnimgt-a.akamaihd.net/transform/v1/crop/frm/hAWJC77isbRCSsmqzS5A6F/777f8a0f-e2fb-46d6-bfb0-652852e883cf.png/r2_0_1152_650_w1200_h678_fmax.jpg"}, {"articleID": "2014012819_00064305_W", "names": {"Malcolm Gray": ["Q56050641", "Q6742345"], "Paul Marsh": ["Q20640918", "Q7152220"]}, "date": "2014-01-28", "url": "http://au.sports.yahoo.com/cricket/news/article/-/21126020/four-nations-oppose-sweeping-icc-revamp/", "content": "meta name = \"description\" content = \"South Africa, Pakistan, Sri Lanka and Bangladesh are set to oppose a push to cede control of world cricket to India, Australia and England .\" /> Four nations oppose sweeping ICC revamp Pakistan, South Africa, Sri Lanka and Bangladesh are likely to oppose sweeping changes in the ICC as the governing body's executive board meeting began in Dubai on Tuesday. Before the meeting, Pakistan Cricket Board chairman Zaka Ashraf told private television channels in Pakistan that all four boards \"have one stance and we will stick to our stance\". The three richest cricket boards of India, England and Australia have drafted a radical position paper in an apparent bid to get more powers in all the administrative and financial matters of the ICC. \"I will vote for Pakistan and whatever is in Pakistan's interests,\" Ashraf said. \"We have to see what is in our interests when we vote. Bangladesh, Pakistan, South Africa and Sri Lanka, we all have one stance .\" The draft has been widely criticised by former Test cricketers and ICC officials Ehsan Mani, <mark>Malcolm Gray</mark> and Malcolm Speed. South Africa was the first to openly criticise the paper citing the \"big three' - Board of Control for Cricket in India (BCCI), Cricket Australia (CA) and the England and Wales Cricket Board (ECB), for not following correct consultation procedures within the ICC. Cricket South Africa termed the proposals as fundamentally flawed. <mark>Paul Marsh</mark>, head of the Federation of International Cricketers' Associations, termed the proposals as disturbing, saying they would broaden disparities between cricket's rich and poor. In case the big three get stiff opposition in Tuesday's meeting, the draft might not be tabled for consideration because - to get any special resolution passed - it would require the backing of eight out of the full 10 members. Officials from the BCCI, ECB and CA reportedly first presented the document to other countries at a meeting this month, with ICC officials even having limited knowledge of the proposals. The proposed reforms would likely revise or abandon the Future Tours Program which guarantees smaller nations regular series against the big three sides. A 21-page document from the ICC's influential financial and commercial affairs committee proposes that a new four-member executive committee be set up, with three places taken by the rich and powerful Indian, English and Australian boards. They would decide on the fourth member. The position paper also recommends the troubled Test Championship, set for introduction in 2017, be scrapped and the limited-overs Champions Trophy be retained in its place. Apparently the four opposing members are also not in favour of promotion-relegation system, as suggested in the draft. That would establish a reduced eight-country top tier for Test cricket from 2015, but with India, England and Australia immune from relegation because of\" the importance of those markets and teams to prospective ICC media rights buyers \". The document argues that cricket, especially Test cricket, is often not financially viable outside of the big three countries."}, {"articleID": "2018072406_00122404_W", "names": {"Brian Baker": ["Q4963025", "Q4963026", "Q4963027", "Q4963029", "Q53329", "Q911812"]}, "date": "2018-07-24", "url": "http://wbtv.com/story/38712403/man-in-nh-dies-after-yellow-jacket-stings-him", "content": "Man in NH dies after yellow jacket stings him - | WBTV Charlotte Man in NH dies after yellow jacket stings him - | WBTV Charlotte Member Center: Man in NH dies after yellow jacket stings him 2018-07-24T05:49:12 Z2018-07-24T05:49:12 Z Family members describe 34-year-old <mark>Brian Baker</mark> Jr. as a man with a \"heart of gold\" who \"always had good intentions .\" (Source: Mandi Baker/WMUR/CNN) WINCHESTER, NH (WMUR/CNN)--The family of a New Hampshire man who died after he was stung by a yellow jacket is sharing his story to encourage others to undergo allergy testing, even as an adult. Family members describe 34-year-old <mark>Brian Baker</mark> Jr. as a man with a \"heart of gold\" who \"always had good intentions .\" \"He would do anything for anyone,\" said his wife, Mandi <mark>Baker</mark>. <mark>Baker</mark> Jr. died Wednesday from an allergic reaction to two stings from a yellow jacket. He had been doing electrical work outside on his deck July 14 when he was stung. After her husband was stung, Mandi <mark>Baker</mark> jumped into action, administering an EpiPen as she dialed 911. \"I had him cooling with wet towels, and I believe he started to stop breathing before the ambulance was even there,\" Mandi <mark>Baker</mark> said. Eventually, <mark>Baker</mark> Jr. ended up in the intensive care unit at a Manchester, NH, hospital. \"Rescue personnel really went--everything to keep <mark>Brian</mark> with us and give him a chance. They performed CPR on him for 40 to 45 minutes, just to give him that chance,\" said the man's father, <mark>Brian Baker</mark> Sr.. Unfortunately, the 34-year-old died from his injuries. Family said it's tragic that such a strong man could be overcome by two stings. They want to share his story in hopes that it may save lives. <mark>Baker</mark> Jr. found out about his allergy only two years ago, and experts say that can often be the case. \"If they have any kind of reaction distant from the sting site, such has hives or the same kind of symptoms previously described--tightness, problems breathing, those kinds of symptoms--they should see an allergist and have testing done,\" said Dr. Marie-Helen Sajous of Dartmouth Medical Center. <mark>Baker</mark> Jr. was an organ donor, and his family said it brings them some peace knowing his death may change someone's life for the better. Copyright 2018 WMUR, Mandi <mark>Baker</mark> via CNN. All rights reserved. Raycom reports Raycom reports More>> Tuesday, July 24 2018 1:49 AM EDT 2018-07-24 05:49:12 GMT Updated: Tuesday, July 24 2018 1:49 AM EDT 2018-07-24 05:49:12 GMT Family members describe 34-year-old <mark>Brian Baker</mark> Jr. as a man with a \"heart of gold\" who \"always had good intentions .\" (Source: Mandi Baker/WMUR/CNN) The 34-year-old was working outside on his deck when he was stung twice and had an allergic reaction. Monday, July 23 2018 3:05 AM EDT 2018-07-23 07:05:17 GMT Updated: Tuesday, July 24 2018 1:46 AM EDT 2018-07-24 05:46:06 GMT (AP Photo/Carolyn Kaster, File). FILE - In a Wednesday, June 27, 2018 file photo, Veterans Affairs Secretary nominee Robert Wilkie is sworn in at the start of a Senate Veterans Affairs Committee nominations hearing on Capitol Hill in Washington. Wilkie...The Senate on Monday confirmed Pentagon official Robert Wilkie to be secretary of Veterans Affairs. Monday, July 23 2018 12:35 AM EDT 2018-07-23 04:35:01 GMT Updated: Tuesday, July 24 2018 12:46 AM EDT 2018-07-24 04:46:13 GMT President Donald Trump issued an all-caps warning via Twitter to Iranian President Hassan Rouhani overnight. (Source: CNN) Trump has a history of firing off heated tweets that seem to quickly escalate long-standing disputes with leaders of nations at odds with the U.S. Sunday, July 22 2018 11:44 PM EDT 2018-07-23 03:44:54 GMT Updated: Tuesday, July 24 2018 12:03 AM EDT 2018-07-24 04:03:46 GMT Police have not yet released a possible motive for the suspect. Monday, July 23 2018 4:12 PM EDT 2018-07-23 20:12:42 GMT Updated: Monday, July 23 2018 11:51 PM EDT 2018-07-24 03:51:13 GMT Nia Wilson, 18, was murdered at a BART station in Oakland on Sunday night, and her sister was taken to the hospital."}, {"articleID": "2011052620_00003553_W", "names": {"Jack Davis": ["Q1360238", "Q14950412", "Q16093667", "Q1677016", "Q21014334", "Q3157160", "Q48804464"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2011-05-26", "url": "http://foxnews.com/opinion/2011/05/26/memo-republicans-ryan-medicare-plan-needs-clearer-populist-defense/", "content": "five and a half weeks after house republicans passed their budget, democrats and liberal pundits have decided it is political kryptonite that will fatally weaken the gop. their evidence is tuesday's special election in new york's 26th district, where democrat kathy hochul defeated republican jane corwin for a vacant congressional seat. this is not just any congressional district, but one carried by george w. bush and john mccain in the last two presidential elections, and one represented for 58 years by a republican. liberals can barely contain their glee. msnbc's ed schultz said the outcome left \"republicans scrambling\" while the washington post's e.j. dionne said \"it will petrify\" republicans. sen. patty murray (d-wa .) said it proved \"democrats have the keys to drive the budget debate and play offense in 2012 .\" most, but not all, of this is wishful thinking. ms. hochul won a plurality (47%) of the votes, not a majority, getting only one percentage point more than barack obama as he was losing the district in 2008. not exactly a compelling performance. democrats won only because a third-party candidate-self-proclaimed tea partier <mark>jack davis</mark> - spent a reported $3 million of his own money. absent mr. davis as a spoiler-he got 9% of the vote-democrats would never have made a serious bid for this district, nor won if they did. ironically, mr. davis ran for the same seat in the last three elections as a democrat. this year he ran as a populist conservative. still the question remains: did the medicare reforms proposed by house budget committee chairman <mark>paul ryan</mark> and supported by ms. corwin play a role in the outcome? the answer is yes, though not with the blunt force and trauma some democrats are claiming. karl rove is a former senior adviser and deputy chief of staff to president george w. bush. he is a fox news contributor and author of \"courage and consequence\" (threshold editions, 2010). to continue reading his column about medicare and the republican strategy in the wall street journal, click here."}, {"articleID": "2012091019_00056757_W", "names": {"Danny White": ["Q16983371", "Q4111239"], "Bill Adams": ["Q23302614", "Q4907865"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"], "Stump Mitchell": ["Q3940974", "Q7628664"]}, "date": "2012-09-09", "url": "http://tylerpaper.com/article/20120909/NEWS08/120909751/-1/rss01", "content": "search help for best search results: do not search by date--full issues of the paper are not available on the site; if you are looking for a specific article, type in one or two words only from the headline or the name of someone in the story; articles provided by wire services are not included in this search; stat pack; oldest fantasy football league in texas cparry @ tylerpaper.com david hight is the first engraved name on an all-important trophy of the texas football league. hight's quarterbacks for that winning season were dallas cowboys' <mark>danny white</mark> and philadelphia eagles' ron jaworski, with the legendary walter payton of the chicago bears as his starting running back. clearly, the tfl has been around long before the popularity of fantasy football exploded. tyler's reggie howell believes it's the oldest fantasy football league in the state and one of the oldest in the nation. \"thirty-three years is a longtime,\" said howell, who created tfl in 1980. \"i do know of a league in california that is celebrating its 50th year this year, and it was started by a couple of guys who were actually part owners of the oakland raiders. ron wolf, who went on to be general manager of the green bay packers, used to play in that thing .\" the 33rd draft of the tfl was a few hours before kickoff of the dallas cowboys-new york giants game on wednesday. the league has always been composed of seven teams. the owners are all area residents: glenn smith, kirk brookshire, les loggins, howell, kearby herrington, <mark>bill adams</mark> and doug danley. howell had the first pick wednesday and took arian foster, houston texans running back. thirty-three years ago, the first player drafted was a dynamic running back named earl campbell. \"i really don't know what triggered it, but i remember watching a preseason game (in 1980) and saying,\" wouldn't it be fun if we could get points for what they do,' \"said howell, vice president of business development for karis resources in tyler .\" so i wrote up some rules, and amazingly they are pretty similar to today. \"howell moved to tyler a couple years later and continued the tfl in his new home with a few new owners. one of those was longtime friend and college golf teammate glenn smith. smith said he was apprehensive when howell approached him, but agreed to give it a try .\" he came to me and said, \"you're going to love this,'\" said smith, who owns glenn a. smith homes, a home-building company in tyler. smith said fantasy football in those early decades was not a regular part of the sports landscape like it is today. friends and relatives did not understand. there were questions: why are you so intense now on sundays? the cowboys won, so why are you so unhappy? or the ultimate, the cowboys just lost, why are you smiling? \"i was watching a cowboys game, and the philadelphia eagles scored, and i yelled,\" yeah!' smith recalled. \"i got the dirtiest looks from my family that you've ever seen .\" howell had a weekly ritual monday to take his usa today paper and scour it for stats on sunday's nfl games. and he wasn't the only one. every owner admitted to spending many hours amassing as much statistical information as possible about their players. \"people didn't understand what we were doing,\" said loggins, who has played in the league since 1983. \"the thing that is interesting is i am kind of a college football person. i was a cowboys fan, but i got involved with this, and it got me starting to watch (pro football).\" we started out having to dig out our stats in newspapers, and usa today was our newspaper of choice, and sometimes they'd get the stats wrong. \"football viewers today can see statistics scrolling by on their television screens during games. but loggins remembers a time when the only televised games seen sundays were ones shown on cbs or nbc, and the only way to get up-to-date stats was to watch the games and keep the stats yourself .\" that is the stuff that people can't appreciate, \"loggins said .\" you'd have a piece of paper, and you were watching one game and trying to keep up with how your player was doing. \"smith said the league improved dramatically thanks to espn premiering\" primetime \"in 1987. a highlight show hosted by sportscaster chris berman,\" primetime \"showed every game's scoring plays and other big plays. that allowed tfl owners to not have to wait on the newspaper the next day to get statistics .\" that was such a big deal, \"smith said. player transactions, such as trades or scooping up unrostered players, now can be done with a mouse click, but in those days, it was a race to see who could dial their telephone the quickest and tell the league commissioner about a player pickup. anyone with a rotary phone was in trouble .\" you'd be watching the game and see a running back for the cowboys go down with (an injury), \"loggins said .\" everybody would pick up the phone and try to call in and the first one who got through to (howell) would be able to pick up the backup. \"there was an opening in the tfl 13 years ago with an owner pulling out, and herrington (who was first on the waiting list), jumped at the opportunity .\" i thought it was crazy when i first heard about it, but then i wanted in, \"said herrington, a representative from feliciano financial group in tyler. while many leagues do head-to-head matchups each week, tfl pits all seven team's scores each week and puts them against one another. for instance, if howell's team scored 130 points, and that ranked second overall, he would be 5-1 that week, with the team ahead of him going 6-0. the league continues this way through the playoffs until the winner is the team with the best record at the close of the season .\" part of our strategy, even in our draft, is to try and prognosticate the playoffs and pick players who will be on those teams, \"herrington said. the positive with this type of scoring is in tfl, unlike the nfl, the best team throughout the entire season is the winning team. howell and smith have their names engraved on the tfl trophy the most .\" people have left and come back after playing other leagues, and everybody has always told me that this is the best league they've played in, \"howell said. memories in the 1987 afc championship game, a fumble by cleveland browns running back ernest byner has forever haunted their memory and added more mystique to the winning team, which had denver quarterback john elway. but that fumble also created havoc in the tfl final standings .\" that night we went to sleep thinking that one guy had won the championship and we didn't realize that ernest byner, on that play, had given his owner 100 yards and that boosted up his score enough to finish first, \"howell said .\" so when we woke up the next morning and looked at the stats, everything changed. \"the other owners admitted that smith takes the league much more seriously than the rest of them, to the point that he\" crawls into a dark room and you won't see him for months (when his team struggles), \"loggins said in jest. that obsession is shown in a letter smith still has that was sent from <mark>joe gibbs</mark> after smith wrote the former washington redskins coach and asked why he was not playing running back ricky ervins more .\" i am not any more obsessed than the rest of them, but yeah, i did that, \"smith admitted .\" ervins had been giving the redskins some huge games, but then all of a sudden, (<mark>gibbs</mark>) wouldn't play him. i copied some clippings of his stats from a couple games and highlighted him. i lied and said in the letter that i was a huge washington redskins fan, and i've got these stats and just wonder why you are not playing him more. \"well, he sent a letter back that said i really appreciate you being a fan of the redskins and i will give consideration to what you said; signed, <mark>joe gibbs</mark>.\" smith said the letter had no effect on ervins' playing time the rest of the season. in another year, howell completed a trade with an owner who was a lawyer and that player tore his acl the next week. \"one day i was at the office, and a sheriff's deputy was there and he handed me a summons,\" howell said. \"i look at it and i am being sued in the universal court of man for damages because i knew about <mark>stump mitchell</mark> before i traded him. it was a well-written two-page document .\" howell said the reasons he formed the league three decades ago are the same: everyone still enjoys it today."}]