[{"articleID": "2016021701_00033508_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Brian Phillips": ["Q21461057", "Q21553548", "Q4965038", "Q4965039", "Q56885961"], "Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2016-02-16", "url": "http://kcci.com/politics/ted-cruz-picks-up-another-freedom-caucus-endorsement/38029282", "content": "Text Size: ASmall Text AMedium Text ALarge Text Another member of the conservative House Freedom Caucus endorsed Ted Cruz on Tuesday, as he continues to hold support from the group known for giving Republican leadership headaches. Other Stories Obama takes on <mark>Donald Trump</mark> Obama: SCOTUS nominee will be...GOP candidates at war in SC Cruz aims to put <mark>Trump</mark> on defensive...<mark>Trump</mark> keeps hitting Cruz over Coburn Kansas Rep. Tim Huelskamp endorsed Cruz on Tuesday, the Texas senator's rapid response director <mark>Brian Phillips</mark> tweeted. \"Ted Cruz is a full spectrum conservative that the people of Kansas should rally behind,\" said Huelskamp in a statement. Huelskamp's endorsement makes 12 members of the Freedom Caucus that have supported Cruz, the most of the group behind any candidate, according to FiveThirtyEight's endorsement tracker. A number of the lawmakers had endorsed Kentucky Sen. Rand Paul, another libertarian, anti-establishment Republican, who dropped out of the race after failing to gain momentum. The group is known for causing trouble for House Republican leadership, especially during the reign of former House Speaker John Boehner. Their opposition was part of why Boehner stepped down from his role and resigned from Congress, and they also stood against his first heir apparent, Majority Leader <mark>Kevin McCarthy</mark>, causing the Californian to withdraw his name from contention and convincing now-Speaker <mark>Paul Ryan</mark> to run for the job. Tweet Tweet Copyright 2016 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags Politics Comments () Print Recommended Comments The views expressed are not those of this site, this station or its affiliated companies. By posting your comments you agree to accept our terms of use. KCCI offers readers the ability to comment on stories with the understanding that these comments may be reprinted elsewhere on the site or used on KCCI newscasts. We ask that you refrain from profanity, hate speech, comments that don't relate to the story and any personal remarks. THIS IS IMPORTANT: KCCI does not edit user submitted statements and we cannot promise that readers will not, at times, find offensive or inaccurate comments posted in this area. If you find a comment that is objectionable or offensive, click the flag that appears in the upper right corner when you hover over a comment. Flagged comments may be automatically hidden from comment threads. For comments to appear on the website and/or the mobile app, email addresses must be verified through Disqus. We ask the community to monitor this forum with the knowledge that KCCI does not regularly monitor these comments. Please enable JavaScript to view the comments powered by Disqus. blog comments powered by Disqus"}, {"articleID": "2012111303_00007245_W", "names": {"Justin Hawkins": ["Q3190452", "Q552608"]}, "date": "2012-11-13", "url": "http://blogs.siliconindia.com/beatsbydre08/Corruption/beats-by-dre-solo-hd-cheap-bid-6K9uY21z43420838.html", "content": "email-id and password doesn't match, please try again a blog is your easy-to-use web site, where you can publish your thoughts, share your ideas & experiences with other professionals, gather feedback and do more. why is innovative business idea important? china another common use for headphones is for using various forms of real-time chat over programs such as skype.the best way to get an idea of?? the types of headphones you find comfortable is to go to a store selling headphones on try on the various types.close headphones tend to block high frequencies generally as well as the noise cancelling headphones, but they do not isolate low lady gaga heartbeats headphones frequency sounds, they are still the headphones to own and enjoy. it will be the best money you have ever spent on headphones. they are much bigger, and consequently they often include more noise reducing material that creates a better buffer to protect against outside noise.choosing the right pair of dj headphones can be confusing, especially when you don't know what beats by dr dre pro to look for.with the wide range of excellent budget noise cancelling headphones that are now available you can experience total peace and quiet, where ever you are, it will make you batteries run down much quicker than they would do normally.there is also reviews and plenty of other information than can help you choose the right type of headphones to suit your needs monster - beats by dr dre studio - mlb philadelphia phillies headphones. there are some memories you're going to want to capture on your camping trip. bring along a small camera that can fit in your pocket. just place the plate into the middle of the frisbee at meal times and the plate will not collapse no matter how big your hamburger.if you are camping outdoors instead of in power beats dr dre a travel trailer or rv, it is important to dress in (or carry with you) layers of clothing. but you should also know how to use them. study up and learn the proper methods of using these tools to prevent from getting lost. venom are clearly the metallest of them all. no others need apply. check them out! you may find them to be far more toe-tapping than beats by dre solo hd cheap you'd expect! suicide: suicide are proof you don't need to pay a lot of musicians to make music. as a duo, had suicide made any money, they wouldn't have had to share it with extraneous bass players and drummers.diamanda galas: wikipedia says she has a three and a half octave vocal range and that her \"works largely concentrate on the topics of aids, monster - beats by dr dre studio - electroplating crisis gun color mental illness, if you practice doing this ahead of time, it will be a breeze to do once you get to your destination.make sure you always have a source of clean water with you. when camping, you can't always trust that a natural water source is clean enough to drink from without boiling the water first. surround the fire with stones to help keep it contained.most importantly, never leave any beats diddy campfire unattended.when packing for your camping trip, make sure to pack either a pair of flip flops or water shoes. these will come in handy in and around the campground.the darkness's <mark>justin hawkins</mark> is one of the top rock songwriters of the 2000s, not only penning such darkness classics as\" love on the rocks with no ice, \"diamond rings melds elements of pop, rock, electro, indie and punk beats by dre tours with deep, sinister vocals that can be as earnest as they are evil. the band perry and zac brown band are vying for their first award. incidentally, this is the first year since their streak began in 2002 that rascal flatts hasn't even been nominated in this category. lambert won two years ago with\" the house that built me. \"keith won in 2005 with\" as good 6 best useful use the ipad for productivity get more facebook likes with these methods tax avoidance is very common in india benefits of performing physical exercise sachin, a mere rajya sabha member! send your and help us continue to improve siliconindia"}, {"articleID": "2013032714_00107363_W", "names": {"Paul Lambert": ["Q246724", "Q42306921", "Q47511367", "Q52134533", "Q7151926", "Q7151928", "Q7151929", "Q7151930"]}, "date": "2013-03-27", "url": "http://clubcall.com/aston-villa/boss-christian-message-1566687.html", "content": "boss <mark>paul lambert</mark> has put his foot down - telling villa officials they cannot sell christian benteke to manchester city this summer. <mark>lambert</mark> believes the belgian will commit his future to villa - as long as the club remain in the premier league. manchester city are believed to be leading the domestic chase for the 22-year-old's signature, but 13 premier league goals since his? 7million summer arrival from racing genk have also brought him to the attention of serie a clubs inter and friorentina. benteke's agent eris kismet told interlive.it that it would be a \"dream' for the belgian to join the nerazzuri this summer. he said:\" i have had no contacts with inter personally and i don't know if the two clubs have spoken about him. certainly inter is one of those clubs where christian dreams of playing. \"villa know they will be under pressure to sell benteke if <mark>lambert</mark>'s side lose their battle against relegation - even though the premier league parachute payments could almost sustain their current wage bill in the championship as long as attendances were maintained. but the player could force the issue if he feels his international prospects are going to be harmed in a world cup year, leaving villa with a potentially unhappy striker going into a season where they have to hit the ground running."}, {"articleID": "2019092015_00093864_W", "names": {"Simon Jones": ["Q10548323", "Q181664", "Q325070", "Q42926431", "Q47435289", "Q54483127", "Q57263285", "Q7519069", "Q9337052"]}, "date": "2019-09-20", "url": "http://feeds.breakingnews.ie/~r/bntopstories/~3/eS5z2Bjw0js/premier-league-footballer-blackmail-trial-messages-between-defendants-revealed-952035.html", "content": "Premier League footballer blackmail trial: Messages between defendants revealed 20/09/2019 - 15:38:00 Back to Court case World Home By Press Association A former Take Me Out contestant sent a message stating that a Premier League footballer's \"days are numbered\" before allegedly blackmailing him, a court in England heard. The player, who cannot be named for legal reasons, jumped out of a hotel room wearing only his underwear after being filmed with a woman who was not his partner. He had previously met Natalie Wood, 28, on two occasions after contacting her on social media and arranged to meet her for a third time last year. Wood, along with three men, allegedly hatched a plot to blackmail the sportsman by filming \"incriminating\" footage of him in bed with her. Bristol Crown Court has heard the plan was formed after Wood revealed her liaisons with the footballer to former Take Me Out contestant Tyrone Coleman, 34. <mark>Simon Jones</mark>, prosecuting, told jurors that messages between the defendants, and Wood and the player, had been examined by police as part of the investigation. In one voice message sent before the incident, Rowe told Tyrone Coleman: \"...been plotting this for too long to be taken out of the equation\". Coleman replied: \"[The footballer's] days are numbered. It is what it is fam. The dirty **** .\" Other messages between Rowe and Coleman included advice for Wood to be flirty in messages to the footballer, to \"keep him enticed and draw him in\". Rowe suggested that Wood, of Cleethorpes, should \"play it smooth--make him want this now\". She sent the player a number of \"provocative\" messages ahead of their meeting, <mark>Simon Jones</mark>, prosecuting, said. \"The picture that is really building here is how carefully managed all of this is--it is all a sting,\" Mr <mark>Jones</mark> told the jury. In one message, Wood told Tyrone Coleman: \"Something I'm hella nervous about. What other girl would be willing to do this for you? As well as it benefits all of us I know .\" READ MORE Lenny Henry tells audience: I am Justin Trudeau Coleman sent a screenshot of messages between Wood and the player--discussing football training and the cost of their hotel room--to Rowe. The player previously told how he and Wood had exchanged \"general chit chat\" on social media before meeting at a hotel. He would transfer money to Wood, who would pay for the hotel room and check in before he arrived--sending him the room number in a message. On the final occasion, the player said Wood seemed \"nervous\" and was using her mobile phone, which was odd as they were \"only going there for one thing\". \"All of a sudden, two guys just walked into the room,\" he told jurors. \"One of the guys said something like:\" Is this what you are doing?'. It happened so quickly. It seemed so staged. \"I managed to get out of the window without without thinking how high up it was .\" The footballer took hold of a fire escape and was able to run down to a car park before fleeing into a nearby restaurant, where he took shelter until police arrived. His designer tracksuit and Rolex watch, which he had taken off in the room, were missing when officers went to it. Rowe was found to be wearing the tracksuit when he was arrested days later, awaiting a flight to Dubai. The watch was on the wrist of Ras Robinson, 37, who was charged with handling stolen goods. After leaving the hotel, the footballer received a message from Wood's phone, stating that he had been in the \"wrong place at the wrong time\" and telling him to contact a number. \"I don't really want to expose you to the media but if you don't respond within 24 hours then you leave me no choice,\" it said. When asked about the message, the footballer told jurors: \"Obviously it is blackmail .\" That's what they wanted to do--to get footage of me and take it to the papers. \"Wood, who has admitted conspiracy to blackmail, said she took part in the plot after discovering that the footballer had a partner .\" I had previously asked him if he did have a partner and he would always shrug it off and say why was I asking if he was single, \"she said .\" I wanted his girlfriend to know that he had been cheating because it is not fair, it's not right. \"She claimed the plan was for the footballer to be filmed in bed with her, then confronted by Rowe and Coleman, who would ask him for money .\" He was kissing me, he started to take his boxers down, \"Wood told the court .\" The key in the door went and Prince and Nathan came in the room. \"READ MORE Emiliano Sala's sister calls pair\" wicked' for accessing mortuary footage She said it did not go to plan as the footballer \"jumped out of the window\" before Rowe and Coleman could speak to him. Nathan Coleman, of Sussex, denies conspiracy to blackmail and two counts of thefts relating to the Rolex watch and designer tracksuit. His brother Tyrone Coleman, of Birmingham, denies conspiracy to blackmail. Prince Rowe, of Birmingham, denies conspiracy to blackmail and two counts of theft. Ras Robinson denies a charge of handling stolen goods relating to the watch. The trial will continue on Monday. - Press Association"}, {"articleID": "2010120722_00049393_W", "names": {"Jack Newman": ["Q42411995", "Q6114310"]}, "date": "2010-12-07", "url": "http://daytondailynews.com/news/nation-world-news/ex-pastor-going-to-prison-for-duping-investors-1022838.html?cxtype=rss_nation-world", "content": "smaller type the associated press updated 4:52 pm tuesday, december 7, 2010 sullivan, ind. - a judge sentenced a southern indiana church financier to 54 years in prison tuesday for pocketing millions of dollars that investors believed would be used to build churches. former pastor vaughn reeves, 66, had little reaction as officers escorted him from the courthouse in sullivan, about 80 miles southwest of indianapolis, said his attorney, who promised to challenge the conviction and the sentence. reeves was convicted on nine counts of securities fraud in october. \"there's going to be an appeal on a lot of grounds,\" attorney dale webster said after the hearing. investigators said reeves and his three sons used their now-defunct company, alanar, and sales pitches that included prayers and bible passages to dupe about 11,000 investors into buying bonds worth $120 million secured by mortgages on construction projects at about 150 churches. instead, reeves and his sons diverted money from new investments to pay off previous investors, pocketing $6 million and buying two airplanes, sports cars and vacations, investigators said. prosecutors have said the case was a prime example of affinity fraud, in which scammers prey on people who share a common interest, such as religious affiliation, ethnicity or age. \"what they did in their company hurt a lot of people,\" said <mark>jack newman</mark>, 73, of terre haute, a retired vice president of marketing who said he invested about $26,000 with alanar and so far has recovered just 20 cents on the dollar. \"justice needed to be served .\" one of the victims who testified at tuesday's sentencing hearing said he wasn't able to buy health insurance after investing $600,000 in church bonds from alanar, sullivan county prosecutor bob hunley said. as a result, steve duncan testified that he went blind after developing an eye condition that would have been preventable. reeves' sons are scheduled to go on trial in march. special judge dena martin sentenced their father to consecutive six-year terms for each of the nine fraud counts, which alleged that he victimized about 2,900 investors who lost a total of $13.1 million, hunley said. among aggravating factors, martin found reeves targeted people over age 65 and used religion to influence them, hunley said. \"we're very happy with the judge's decision,\" hunley said. the judge gave reeves credit for cooperating with investigators after he turned himself in. alanar used a modified ponzi scheme in which it diverted investors' money from their building projects to speculative investments and to interest payments on other bonds, according to the indiana secretary of state's office, whose securities division assisted prosecutors in the case. alanar encouraged church members to sell the bonds to fellow congregants using sales pitches that included prayers and bible passages. \"never sell the facts, sell warm stewardship and the lord,\" alanar training materials said, according to the securities division. martin ordered public defenders to handle reeves' appeal. webster, reeves' current public defender, said the new attorneys haven't been selected yet. user comments are not being accepted on this article."}, {"articleID": "2012121102_00010502_W", "names": {"Brian Johnston": ["Q17484184", "Q17505791", "Q4964228", "Q4964231", "Q4964234"]}, "date": "2012-12-10", "url": "http://gantdaily.com/2012/12/10/aging-doctors-face-greater-scrutiny-over-patient-care/", "content": "national news / aging doctors face greater scrutiny over patient care aging doctors face greater scrutiny over patient care leave a comment united states (kaiserhealth) - a distinguished vascular specialist in his 80s performs surgery, then goes on vacation, forgetting he has patients in the hospital; one subsequently dies because no doctor was overseeing his care. an internist who suffered a stroke gets lost going from one exam room to another in his own office. a beloved general surgeon with alzheimer's disease continues to assist in operations because hospital officials don't have the heart to tell him to retire. dr. ephraim engleman, 101, still practices medicine, and has no plans to retire (photo by mike kepka/san francisco chronicle). these real-life examples, provided by an expert who evaluates impaired physicians, exemplify an emotionally charged issue that is attracting the attention of patient safety experts and hospital administrators: how to ensure that older doctors are competent to treat patients. about 42 percent of the nation's 1 million physicians are older than 55 and 21 percent are older than 65, according to the american medical association, up from 35 percent and 18 percent, respectively, in 2006. their ranks are expected to increase as many work past the traditional retirement age of 65, for reasons both personal and financial. many older doctors remain sharp, their skills up-to-date and their judgment honed by years of experience. peter carmel, the ama's immediate past president, a 75-year-old pediatric neurosurgeon in new jersey, recently wrote about \"going full tilt .\" unlike commercial airline pilots, who by law must undergo regular health screenings starting at age 40 and must retire at 65 - or fbi agents, whose mandatory retirement age is 57 - there are no such rules for doctors. nor are any formal evaluations required to ensure the continued competence of physicians, many of whom trained decades ago. most states require continuing education credits to retain a medical license, but, as ann weinacker, chief of the medical staff at stanford hospital and clinics in california, observed, \"you can sleep through a session, and if you sign your name, you'll get credit .\" \"the public thinks that physicians' health and competence is being vigorously monitored and assessed. it isn't,\" said geriatrician william norcross, 64, founding director of a program at the university of california at san diego that performs intensive competency evaluations of doctors referred by state medical boards or hospitals. the program - known as pace, for physician assessment and clinical education - is one of about 10 around the country. norcross, who evaluates 100 to 150 physicians annually, estimates that about 8,000 doctors with full-blown dementia are practicing medicine. (between 3 and 11 percent of americans older than 65 have dementia .) studies have found, norcross noted, that approximately one-third of doctors don't even have a personal physician, who might be on the lookout for deteriorating hearing, vision or motor coordination, or the cognitive impairment that precedes dementia. the effects of aging \"doctors are not immune to the effects of aging,\" norcross said, adding that the onset of dementia is often insidious and gradual. too often, he said, health problems become impossible to ignore after a catastrophic event, such as the death of a patient. \"doctors with cognitive and neurological problems almost never have insight into their problems,\" he said, and many deny that anything is wrong. while few experts would argue that age alone should control who can continue to practice, some studies suggest that doctors' skills tend to deteriorate over time. a 2006 report found that patient mortality in complex operations was higher among surgeons older than 60 than among their younger colleagues. to address the problem in a systematic way, a small but growing number of hospitals - including the university of virginia health system, stanford hospital and clinics, and driscoll children's hospital in corpus christi, texas - have recently adopted policies requiring doctors over a certain age - 70 at u-va. and driscoll, 75 at stanford - to undergo periodic physical and cognitive exams as a condition of renewing their privileges. diane pinakiewicz, former president of the national patient safety foundation, a boston-based information and advocacy group, calls the policies \"a fabulous idea\" that is long overdue. \"without a rule, it's left to someone's personal decision\" to self-monitor. new hampshire health-care consultant jonathan burroughs, who has worked with hospitals seeking to implement testing policies for older physicians, estimates that roughly 5 to 10 percent of institutions have adopted them and that interest is growing. \"colleagues have a code of silence,\" said burroughs, who spent 30 years as an emergency department physician. during his career, burroughs said he followed several elderly doctors around, quietly correcting their orders to prevent mistakes. such experiences, he said, are nearly universal in medicine. \"most medical staffs look the other way, thinking,\" there but for the grace of god .' this person has been a good doctor, and we're not going to betray them, \"burroughs said. but that kindness can backfire, he added, subjecting patients to potentially disastrous consequences such as serious injury or death, and the faltering physician to a malpractice suit or the loss of a medical license. john schorling, a professor of medicine who heads u-va .'s physician wellness program, said the policy adopted last year was prompted by\" general concerns \"about patient safety and is modeled on aviation industry practices .\" pilots have people's lives in their hands, and so do doctors, \"he said .\" fred flintstone' care but some hospital administrators dispute the need for such testing. fitness to practice, they maintain, is already paramount in decisions that hospitals make every two years or so to renew a physician's privileges. and that process, they say, has gotten more stringent in the past decade with the proliferation of performance data on doctors. \"in medicine, i think you need to look at people individually,\" said david mayer, 59, vice president of quality and safety at medstarhealth, the largest hospital network in the district and maryland. \"to just put a number there and say,\" you need to be looked at more closely' because of age is not justified. \"<mark>brian johnston</mark>, chairman of the emergency department at white memorial medical center in los angeles, agrees .\" it's just very hard to make a hard-and-fast rule based on age, \"said <mark>johnston</mark>, 74, who is still pulling regular shifts in the fast-paced specialty. testing everyone who hits a certain age is\" unnecessarily ham-handed. \"but marty makary, a johns hopkins surgeon and author of\" unaccountable: what hospitals won't tell you and how transparency can revolutionize health care, \"says that screening can weed out those who should no longer be practicing while giving\" those who are fully functional the freedom to practice without the stigma of ageism. \"although an older doctor can be a font of wisdom and experience, makary warns that too often patients receive what he calls\" fred flintstone care \"from doctors whose skills have not kept pace .\" some older surgeons are all over minimally invasive surgery, \"he said,\" but many have just ignored minimally invasive techniques. \"their patients, he said, may receive state-of-the-art care - for' 76. orthopedic surgeon ralph blasier agrees. in a 2009 review article entitled\" the problem of the aging surgeon, \"blasier wrote that\" essentially every treatment technique taught 25 years ago has been abandoned and replaced, \"including the treatment of traumatic fractures and joint diseases .\" all surgical specialties, \"he continued,\" have had similar turnover of treatment methods. \"blasier, 62, who practices in escanaba, mich., has cut back his practice in recent years. he no longer performs certain demanding operations, such as arthroscopic shoulder surgery, because he doesn't think he does them as well as he did at age 50, when he was at his peak. one reason blasier believes doctors are loath to retire is that they haven't planned for it. five years ago, he earned a law degree from wayne state university and is handling several legal cases, in addition to his reduced surgical practice. in a few years when he retires, he plans to practice law .\" if i screw up a legal case, \"he said,\" nobody dies. \"at stanford, weinacker, chief of the 1,800-member medical staff, said that reaction to the policy, which affects about 25 doctors, has been mixed. several doctors, she said, have decided to retire instead of undergoing testing .\" i think the main thing i stressed with people was that this policy is intended to be supportive, \"not punitive. anyone found to have problems will be referred to the pace program for a more complete evaluation. at u-va., schorling said that 28 of the 35 doctors older than 70 completed screening and passed easily. the other seven decided against participating and no longer have hospital privileges there, although they are free to practice elsewhere. still practicing at 101 rheumatologist ephraim engleman, who will turn 102 in march, said he plans to never quit. one of the nation's oldest practicing physicians, engleman drives from his san mateo home to the sprawling medical campus of the university of california at san francisco three days a week. there he sees about eight longtime patients per week and spends most of his time directing the rosalind russell medical research center for arthritis, an administrative post he has held since it was created in' 79 .\" i'm very much opposed to retirement, \"said engleman, an accomplished violinist who plays once a week with a chamber music group .\" as long as i'm able intellectually and physically, i'm going to continue. \"engleman, who graduated from medical school in' 37, loves being a doctor and said,\" i can do everything i ever did. \"his only impediment, he said, is severe spinal stenosis, which has left him stooped and dependent on a cane .\" i walk like an old man, \"he said."}, {"articleID": "2018041008_00086024_W", "names": {"Amar Shah": ["Q16223949", "Q58806795"], "Elizabeth Moss": ["Q54573547", "Q6152388"]}, "date": "2018-04-10", "url": "https://in.news.yahoo.com/why-fans-upset-latest-episode-080249344.html", "content": "Many 90s kids have known the struggle of picking the best episode of The Simpsons, the longest-running scripted series in TV history. Over a decade later, the fans are wiser. They stand evolved and have mixed feelings about some of the problematic depictions. The stealthy stereotypes and racist depictions of the character, Apu - the Indian owner and manager of the Springfield Kwik-E-Mart, prompted Hari Kondabalu an Indian-American fan of the classic comedy series to release a documentary titled The Problem with Apu. Hank Azaria, a non-Indian actor lent his voice replete with an Indian accent to the animated series. Azaria's performance as Apu was based on a guy who worked at the 7-11 in Los Angeles back in the late 1980s - the result was a caricature. In one of the interviews, Kondabalu asserted that Apu is predominantly \"a white person's perception of an Indian immigrant .\" He's not the only fan who is grappling with this conflict. Kondabalu argued that the stereotyping provoked bullying of and racism towards people of colour. The latest episode of the series, titled No Good Read Goes Unpunished finally addressed the criticisms around the character but not without being defensive. In the episode Marge decides to update a book she loved as a girl, The Princess in the Garden before introducing it to Lisa to make it more relevant to the times, to strip it off any traces of misogyny and racism and to make it \"politically correct'. #TheSimpsons completely toothless response to @ harikondabolu #TheProblemWithApu about the racist character Apu:\" Something that started decades ago and was applauded and inoffensive is now politically incorrect...What can you do? \"pic.twitter.com/Bj7qE2FXWN--Soham (@ soham_burger) April 9, 2018 The new version fails to fascinate Lisa .\" Well, what am I supposed to do? \"Marge inquires exasperated. Lisa then breaks the fourth wall and tells the audience:\" \"It's hard to say. Something that started decades ago, and was applauded and inoffensive, is now politically incorrect. What can you do?\" \"- Lisa in the latest episode of The Simpsons She then glances at her nightstand, on which a framed photo of Apu is perched, emblazoned with the caption,\" Don't have a cow! \"Marge also indicates that there's no point to the book after the revision. The response was perceived as flippant, at best by Twitterati, who agree that The Simpsons jumped the shark long ago. The aforesaid documentary released last year had ignited a conversation on how Apu's depiction as a character fails to stand the test of time. The facile jab didn't go unnoticed by Kondabalu who jumped into the discussion online. Wow .\" Politically Incorrect? \"That's the takeaway from my movie & the discussion it sparked? Man, I really loved this show. This is sad. https: //t.co/lYFH5LguEJ--Hari Kondabolu (@ harikondabolu) April 9, 2018 Disappointed in The Simpsons. @ harikondabolu's doc was fair and articulate about media representation of South Asians. The Simpsons' writers shat on it by getting the most progressive character (Lisa) to dismiss it as\" politically incorrect \"& followed up with a Hindu/cow joke. https: //t.co/HePO5qspTk--Areeq Chowdhury (@ AreeqChowdhury) April 9, 2018 Back then, the depiction of Apu in the series surreptitiously made Indian Americans vulnerable to ridicule and bigotry. The episode assumed that the show was\" inoffensive' all along. It discounted the little or no representation of Indian Americans in the media. \"\"We just were underrepresented. We didn't have any other representation in this country. That creates a problem when the most popular show on television is showing mainstream America what an Indian is .\" \"- Actor Utkarsh Ambudkar in The Problem with Apu. It was\" inoffensive \"? When? Back when y' all didn't give a shit what Indian-American kids felt? (I'm kidding, of course, they still don't care. Just some of those kids grew up, grew into their voice and were able to point out how hurtful this shit was .) https: //t.co/OvMtDJcToP--aprotim (@ aprotim) April 9, 2018 What assholes. Not to mention the erasure of the people who were offended and weren't applauding .--Cate Young (@ battymamzelle) April 9, 2018 Fans are disappointed that the show loved by them for decades has shirked culpability and dismissed the discourse that Kondabalu began with his documentary. They almost see it as a smug cop-out. Story Continues 1. Desi kids get called Apu by bullies too young to really get The Simpsons 2. Guy makes doc about it 3. The Simpsons blow it because their heads are too far up their own asses to really get The Simpsons 4. The machines take over and we are set free .--rob corddry (@ robcorddry) April 9, 2018 Everybody has an opinion about Apu, but did they ever talk to someone who owned a convenience store or gas station or work in one or grow up in one? You know, like my dad and I? #simpsons #apu--<mark>Amar Shah</mark> (@ amarshahism) April 9, 2018 Apu on The Simpsons being voiced by a white guy is one of those things that everyone is aware of but no one wants to reconcile with, like the fact that <mark>Elizabeth Moss</mark> is a scientologist--Dana Schwartz (@ DanaSchwartzzz) April 9, 2018 Source: Vulture. Read more on TV by The Quint. CWG 2018 | Day 6: Heena Sidhu Wins Gold in 25 m Pistol Event Here's Why Fans Are Upset With the Latest Episode of The Simpsons. Read more on TV by The Quint."}, {"articleID": "2013022719_00051962_W", "names": {"Andrew Romanoff": ["Q15283659", "Q4758427"]}, "date": "2013-02-28", "url": "http://westword.com/2013-02-28/news/andrew-romanoff-pac-money/", "content": "when <mark>andrew romanoff</mark> said no to pac money, he earned a bonus how much do voters care where campaign money comes from? peak campaign, working for cleanslatenow.org, just polled 400 active voters in colorado, asking them this question: \"during election years, special-interest groups such as unions, trial lawyers, banks, oil companies, environmentalists and developers use political action committees, sometimes called pacs, to contribute to campaigns. if you had the choice between two otherwise equally qualified candidates, one who took campaign contributions from pacs and one who raised money only from individual contributions, would you be more likely to vote for the candidate who only accepts money from individuals, or would you be more likely to vote for the candidate who accepts pac contributions, or does it not matter to you in how you vote?\" the results show that 58 percent of all respondents would be more likely to vote for the candidate who did not take pac money, and 3 percent would be more likely to vote for the candidate who did. for unaffiliated and women voters, the results are even more skewed: women are 61 percent to 1 percent in favor of a candidate who does not take pac money, and unaffiliateds are 66 to 2 percent. as for unaffiliated women? they polled 68 percent in favor of the candidate who does not take pac money - with precisely none preferring the candidate who does. this exercise is not entirely hypothetical. democrat <mark>andrew romanoff</mark>, who's announced he's running for incumbent republican mike coffman's seat in the 6th congressional district, isn't taking any pac money. (<mark>romanoff</mark>, who lived in washington park when he was in the colorado house, now lives in aurora .) \"confirming my own door-to-door experience, the poll shows that people do care where a candidate gets money, and a great majority would prefer that a candidate get money from people rather than special interests,\" says cleanslatenow.org. \"this finding has particular significance for this coming election cycle in colorado because of <mark>andrew romanoff</mark>'s decision to forgo special interest pac money. people who care about democracy from all over the country will be watching colorado's 6th. laying an egg: stapleton isn't chicken about chickens. the majority of the ever-growing community allows the backyard birds, in fact, just like the rest of the city of denver. but at least one part of stapleton - one governed by its own homeowners' association - recently gave the bird to one of the development's most outspoken chicken lovers, caroline vierow, who runs a facebook page called clucs, or chicken lovers united communityof stapleton. in early february, the stapleton neighborhood #7 hoa, which governs about 100 residences built by kb homes, rejected a request by vierow and her husband, dane, to build a fence and a chicken coop in their back yard. the association said that a coop would\" detract from the harmony of the association \"and went on to explain that\" the board feels that, while chickens are allowed by the city and county of denver under certain criteria...they do indeed attract predators, have a potential for the nuisance of smell, and do not fit into the overall feeling of the community of stapleton #7. in addition, the board feels that allowing a chicken coop could negatively affect the marketability of neighboring homeowners. \"the vierows were surprised .\" stapleton prides itself on being very sustainable and green, \"caroline says .\" there are a lot of people here who have chickens. the master community association doesn't prohibit chickens; they're fine with them. that's why we were so taken aback when the hoa came back with this. \"the association added that the vierows' back yard was also small, and pointed out that forest city, stapleton's master planner, is currently marketing a new housing development - the first part of stapleton that will be north of i-25 - more suited for fowl neighbors. conservatory green plaza, as it is called, will\" flow with the area's natural prairie; homes will have even faster technology; and there will be opportunities for urban agriculture in community gardens, the public landscape, or your own backyard. \"franklin sain, accused of racist threats against gun-control backer, should be fired, says naacp alex landau frustrated by cop reinstatement, latest delay in bloody beating investigation voice places find everything you're looking for in your city find the best happy hour deals in your city get today's exclusive deals at savings of anywhere from 50-90%"}, {"articleID": "2013012920_00009507_W", "names": {"Brian Williams": ["Q10498110", "Q11688807", "Q16106138", "Q20273975", "Q22636441", "Q28777337", "Q39185757", "Q43162643", "Q459695", "Q4965638", "Q4965639", "Q4965640", "Q4965642", "Q4965643", "Q4965645"]}, "date": "2013-01-29", "url": "http://lifesitenews.com/news/networks-give-521-times-more-coverage-to-manti-teo-than-march-for-life", "content": "reprint permissions networks give 521 times more coverage to manti te'o than march for life january 29, 2013 (mrc) - fact usually triumphs over fiction - except on tv news. the major networks have been obsessed with manti te'o's fantasy football story of a fictional girlfriend. but when 500,000 people showed up in washington to speak out for the unborn, it was barely a footnote. abc, cbs, and nbc devoted close to two-and-a-half hours (147 minutes and 43 seconds) to the te'o fiasco and just 17 seconds to the washington, d.c., march for life. that's 521 times more coverage for te'o and a girlfriend who never even existed. abc covered the story of the notre dame's linebacker for 63 minutes and 57 seconds, while nbc came close with 59 minutes and 15 seconds. cbs was rational by comparison with just 24 minutes and 31 seconds. the anchors reported on te'o with gluttony for more detail. abc's dan abrams made a convincing argument for less coverage on the january 23, \"good morning america .\" that argument clearly failed. \"and, hard to believe that we don't learn any new details. i mean, remember, this story has broken almost a week ago, and we've learned very little new since that happened .\" yet abc led all three networks with more than one hour of coverage. the anchors continued to talk, decorating the controversy with ornamental descriptions. nbc's willie geist called the te'o account \"so compelling\" and abc's george stephanopoulos described it as \"that bizarre love story .\" neither spared even a second for those marching to prevent another 55 million babies from dying in the next 40 years after roe v. wade. between the threads of the te'o story, one anchor, nbc's <mark>brian williams</mark> devoted 17 seconds to the 40th march for life on last friday, january 25, saying: \"back in this country, in washington today, thousands of anti-abortion demonstrators marched to the steps of the supreme court, protesting the landmark decision that legalized abortion. annual march for life, as it's called, this year, coincides with the 40th anniversary of the roe v. wade decision .\" the networks have a history of bias concerning the march for life. the lack of coverage of the march became even more impressive when half a million people attended. a spokesperson for the eternal word television network (ewtn), \"the largest religious media network in the world,\" confirmed that organizers interviewed on ewtn estimated 500,000 marchers. thoughtful, respectful comments that add useful, additional information or insights directly related to the stories lsn commenting is not for on-going debates or theological or other disputes between commenters. it is also not a place for hobby commenters to post numerous comments promoting their personal agendas. multiple comments from one person under a story are discouraged (suggested maximum of three). lifesitenews gives priority to pro-life, pro-family commenters since this is an alternative news service founded to give fair and accurate information on life, family and culture issues which are very poorly covered in most mainstream media. lifesitenews reserves the right to edit or remove comments that do not meet the standards noted above. 2,000 + youth learn the nuts and bolts of pro-life activism at students for life conference networks give 521 times more coverage to manti te'o than march for life morally straight? the transformation of the boy scouts of america doctor in canada's lone \"abortion-free' province found offering chemical abortions: report gvmt minister rona ambrose:' i believe abortion should be safe, legal and rare .' healing, not scarlet letters, promoted at national pro-life prayer service before march for life cuomo's extreme abortion bill creates a civil war with democrats, catholics (124) a post-abortive mother's response to the' i had an abortion' t-shirt (111)"}, {"articleID": "2014073018_00052101_W", "names": {"Jim Mcdonald": ["Q18379036", "Q27915165", "Q47545518", "Q6196786", "Q6196792"], "David Somers": ["Q15526573", "Q16196708", "Q43275382"], "Dan Wallace": ["Q17501740", "Q5214548"], "Henning Berg": ["Q123303", "Q343093"], "Tommy Wright": ["Q3531369", "Q7820025", "Q7820027", "Q7820028", "Q981825"]}, "date": "2014-07-30", "url": "http://dailyrecord.co.uk/sport/football/football-news/callum-davidson-tells-grieving-st-3935163", "content": "Watch hilarious video of Northern Irish mum shouting at her daughter when she doesn't know how long to go 80 miles at 80mph Rangers hero Shota Arveladze wins gruelling legal battle to evict tenants who fell £ 42k behind on rent payments Serial pervert was caught in street sex act but still left free to rape and kill OAP Rosina Orlando Bloom throws PUNCH at Justin Bieber outside Ibiza restaurant Liam Neeson opens up about heart-wrenching moment wife Natasha Richardson's life support was turned off Coronation Street legend Charlie Lawson happy to bring <mark>Jim McDonald</mark> back - even after drinking row Rangers chairman <mark>David Somers</mark> hits back at fans by insisting he has no plans to sanction the sale of Murray Park Usain Bolt \"says Commonwealth Games are\" a bit s *** \"and that the\" Olympics were better \"' Celtic boss Ronny Deila insists he's not afraid of Champions League catastrophe as he gears up for showdown with Legia Warsaw Glasgow 2014: <mark>Dan Wallace</mark> steals the show at Tollcross with a kilted entrance and a sensational silver in dramatic final Celtic new Bhoy Jo Inge Berget insists he won't think twice about doing dirty on former mentor <mark>Henning Berg</mark> during Euro crunch THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May. THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May .\" data-type = \"fb-share\" data-action = \"article:3935163\" > THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May. \"data-type =\" tw-share \"data-action =\" article:3935163 \"> THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May .\" data-type = \"email\" data-action = \"article:3935163\" > St Johnstone coach Callum Davidson CALLUM Davidson has told grieving St Johnstone boss <mark>Tommy Wright</mark> he will make sure the players are ready for tomorrow's European showdown with Spartak Trnava. The Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May. <mark>Wright</mark> won't fly back to Scotland until hours before kick-off but Davidson has assured him it will be business as usual on the training ground in the run-up to the Europa League first-leg qualifier. Last season he stepped up to the plate when the Ulsterman underwent gall bladder surgery and was ordered to steer clear of McDiarmid Park during his recuperation. So Davidson has no fears about taking over before the Slovakian side pitch up in Perth. He said: \"It's a little bit different to when <mark>Tommy</mark> was in the hospital. The main thing at the moment is he's with his family, especially his dad .\" They have the funeral to get through and then he'll be back on Thursday. So it's not a problem. \"We have been in constant contact. <mark>Tommy</mark> was the same when he was in hospital - he wants to know everything that's going on .\" He has asked for videos of Spartak Trnava to be sent to him back home. So he'll be watching them, working out the setplays and stuff before speaking to the lads when he's back. \"We'll do a chunk of prep work before the game. We'll sit down with the players and go through some videos we have .\" The good thing about that is things will be fresh in their minds. \"After showing great character to see off Swiss side Luzern in the last round Saints are determined to keep the Euro adventure going. And Davidson believes they are so professional the absence of <mark>Wright</mark> won't be felt in training. He said:\" The boys take care of themselves anyway - you rarely see a bad training session. \"They know what's expected of them and what they expect from themselves. The fact the manager isn't here won't impact on things one bit .\" The boys will make sure their standards are kept high in training. They always do that. \"But Davidson admitted compiling a dossier on the Slovaks has been more challenging than the homework they did on Luzern. The former Scotland full-back said:\" Our scout Ewan Peacock was over watching their last European game so we have a report on them. \"We're also speaking to people who have played Spartak .\" It has been more difficult to get info on them than it was for Luzern but we'll get there. \"They'll be physical. They get the ball forward quickly and are strong at the back. So it's a different test to last week against Luzern .\" It's similar to the Minsk game last year when we lost on penalties after winning away. \"The one thing I would say from the game against the Swiss is we need to improve on our ball retention. We want to be better on the ball .\" If we can keep it tight at home and take our chances then we will have something to take to Slovakia. \"Not losing an away goal would be huge so we'll have that in mind .\" Davidson expects another bumper crowd at McDiarmid Park with fans able to pay at the gate and is thrilled the squad has a clean bill of health. St Johnstone boss <mark>Tommy Wright</mark>: We've won the Scottish Cup - now it's time for a crack at the Europa League See more stories you'll love You've turned off story recommendations. Alex Salmond accused of a \"huge deception' over his plans for a currency union after a Yes vote Smoking gun: Mum's battle with cigs as stats show how second-hand smoke is really harming kids In pictures: Armed police attend routine incident in Glasgow city centre caused by a bus braking suddenly See more stories you'll love You've turned off story recommendations. Glasgow 2014: The complete schedule for Day Seven of the Commonwealth Games Glasgow 2014: Usain Bolt insists he didn't say the Commonwealth Games were' a bit sh **' and that the Olympics were better Glasgow 2014: Waveheart <mark>Dan Wallace</mark> steals the show with kilt stunt and sensational silver in dramatic final Rangers chairman <mark>David Somers</mark> hits back at fans by insisting he has no plans to sanction the sale of Murray Park Usain Bolt\" says Commonwealth Games are \"a bit s ***\" and that the \"Olympics were better\" ' Celtic boss Ronny Deila insists he's not afraid of Champions League catastrophe as he gears up for showdown with Legia Warsaw Glasgow 2014: <mark>Dan Wallace</mark> steals the show at Tollcross with a kilted entrance and a sensational silver in dramatic final Orlando Bloom throws PUNCH at Justin Bieber outside Ibiza restaurant Rangers chairman <mark>David Somers</mark> hits back at fans by insisting he has no plans to sanction the sale of Murray Park Usain Bolt \"says Commonwealth Games are\" a bit s *** \"and that the\" Olympics were better \"' Watch hilarious video of Northern Irish mum shouting at her daughter when she doesn't know how long to go 80 miles at 80mph"}]