[{"date": "2015-05-23", "url": "http://hamptonroads.com/2015/05/angler-wasnt-looking-shark-one-found-him", "content": "Sports \"Outdoors Angler wasn't looking for a shark, but one found him A 9-foot blue shark caught by <mark>David Leslie</mark> is brought to the side of the boat. get hooked Off the Hook is a Sunday outdoors feature highlighting the tales (fact, not fiction) of anglers from Hampton Roads and northeastern North Carolina. If you have a story to tell, send pictures and ideas to Pilot outdoors writer Lee Tolliver at lee.tolliver @ pilotonline.com, or call him at (757) 222-5844. Be sure not to miss Lee's Fishing Forecast each Thursday at May 24, 2015 Friends didn't believe <mark>David Leslie</mark> when he told them about catching a nearly 10-foot blue shark while fishing for sea bass off the coast of Virginia Beach. But those fishing with him - Beth and Kevin Synowiec - can attest to the story .\" I looked up and saw this fin on the surface, \"said <mark>Leslie</mark>, a 29-year-old Newport News resident who grew up freshwater fishing in Wisconsin .\" We weren't sure what it was at first. \"The torpedo-like shark with the deep blue back didn't take <mark>Leslie</mark>'s first offering of bait .\" I had a 4500 Daiwa spinning rig set up for drum and cobia, \"<mark>Leslie</mark> said .\" I had a piece of piano wire leader rigged up and put that on with a piece of squid and tossed it out there. \"Given the length of the shark, <mark>Leslie</mark> admitted that the size of his tackle\" wouldn't have been my weapon of choice. I've got a couple of 50 - and 80-wide (larger reels) in the garage that I would have preferred to have been using. \"Fishing for sharks is not exceptionally difficult, given a shark's never-ending appetite. Anglers usually use chum to attract a fish, then pieces of cut bait to entice a bite. Many species, such as mako and hammerheads, charge after trolled offerings for tuna and billfish. And when hooked, all species are known for putting up a battle. <mark>Leslie</mark>'s shark made several runs, nearly spooling his reel. And because the trio was anchored over a wreck for bottom fishing, chasing the shark wasn't an option at first. When the shark swam around the anchor line, getting it to the side of the boat seemed nearly impossible .\" I had 300 yards of braid (braided fishing line) and he got me down pretty close several times, \"<mark>Leslie</mark> said. About halfway into the fight, the Synowiecs taped together a pair of 48-inch-long fishing measuring strips and got them to the edge of the boat for a good estimate of the shark's length .\" That gave us 96 inches and it was longer than that, \"<mark>Leslie</mark> said .\" We weren't about to bring it into the boat because it wasn't a species we were going to keep and eat. And bringing it in otherwise would have been too dangerous. \"More slender than some shark species, blues can top 500 pounds. The International Game Fish Association all-tackle world record is a 528-pounder caught off Montauk, N.Y., in 2001. And like nearly all shark species, they have a formidable set of teeth .\" This one wasn't that big, I don't think, but it was the biggest fish I've ever caught, \"<mark>Leslie</mark> said .\" We got him close to try and measure him and cut him loose. \"It was just an amazing experience...that electric-blue colored shark in that beautiful blue water .\" ", "articleID": "2015052600_00000221_W", "names": {"David Leslie": ["Q1175203", "Q16731417", "Q762029"]}}, {"date": "2015-06-08", "url": "http://startribune.com/three-twins-postgame-thoughts-from-len3-hunter-the-desginated-hitter-graham/306357031", "content": "Here are three thoughts following the Twins 10-5 loss to Milwaukee THE MISSED CATCH: Visions of Ray Durham and Mark Kotsay were running through my mind as Torii Hunter got locked up trying to catch Adam Lind's rocket and had it get past him for a RBI double. Durham and Kotsay's were worse, because they came against Oakland in the playoffs. \"He hit it, line drive in the lights,\" Hunter said. \"And it stayed in the lights. If it's on a line it is going to stay in there. All I could do is make the adjustment, jump as high as I could on the run. But, that was hit hard .\" ROSTER NEEDS WORK: What are the Twins going to do about their DH spot? Eduardo Nunez was 1-for-4 on Friday, but this lineup could use some pop, and there's a speed bump after Trevor Plouffe bats. Kennys Vargas apparently is just doing OK at Rochester and Josmil Pinto has tailed off after a hot start. It has forced the manager to come up with some eye-popping lineups. \"It's been challenging,\" Twins manager <mark>Paul Molitor</mark> said. \"It is kind of where we are at right now, especially with our hand being forced to use our bullpen tomorrow we need depth. We are a little limited on the bench, so we have have to rendez-vous through the DH and the middle of the lineup for now. We're looking for people to come up and help us but I don't think anyone is jumping out at us right now .\" TOMORROW!!!: The Twins need a solid start from J.R. Graham tomorrow or things could get interesting. It sounds like Ryan Pressly will be the first one out of the bullpen once Graham is done. Brian Duensing and Tim Stauffer could be used but they did pitch tonight and the bullpen was gassed when it left for Boston. That's why the Twins were relieved that <mark>Kyle Gibson</mark> was able to go seven innings on Friday when it looked like he was going to hit the showers early. La Velle E. Neal III has covered baseball for the Star Tribune since 1998 (the post-Knoblauch era). Born and raised in Chicago, he grew up following the White Sox and hating the Cubs. He attended both the University of Illinois and Illinois-Chicago and began his baseball writing career at the Kansas City Star. He can be heard occasionally on KFAN radio, lending his great baseball mind to <mark>Paul Allen</mark> and other hosts. <mark>Mark Rosen</mark> borrows him occasionally for WCCO-TV. StarTribune.com welcomes and encourages readers to comment and engage in substantive, mutually respectful exchanges over news topics. Commenters must follow our Terms of Use. Keep it civil and stay on topic. No profanity, vulgarity, racial slurs or personal attacks. Comments with web links are not permitted. Comments that violate the above will be removed. Repeat violators may lose their commenting privileges on StarTribune.com. Graham tries to save the bullpen and lead the Twins over Brewers Woman falls to her death in abandoned Mpls. grain elevator Brodkorb: Downey's plan for cutting deputy's salary draws criticism", "articleID": "2015060805_00022248_W", "names": {"Kyle Gibson": ["Q14878777", "Q24283915", "Q6451161"], "Mark Rosen": ["Q56610769", "Q57431876"], "Paul Allen": ["Q162005", "Q24062169", "Q3370450", "Q37834596", "Q7149040"], "Paul Molitor": ["Q1972377", "Q93152"]}}, {"date": "2015-06-10", "url": "http://www.foxnews.com/us/2015/06/10/nobody-heard-anything-prison-break-spotlights-code-silence-behind-bars/", "content": "Law enforcement officers question a woman, Wednesday, June 10, 2015, who lives near the prison in Dannemora, N.Y., as they searched houses near the maximum-security prison in northern New York where two killers escaped using power tools. State Police said the fifth day of searching will entail going from house to house in Dannemora, where David Sweat and Richard Matt cut their way out of the Clinton Correctional Facility. (AP Photo/Seth Wenig) Law enforcement officers walk the streets in Dannemora, N.Y., as they searched houses near the maximum-security prison in northern New York where two killers escaped using power tools, Wednesday, June 10, 2015. State Police said the fifth day of searching will entail going from house to house in Dannemora, where David Sweat and Richard Matt cut their way out of the Clinton Correctional Facility. (AP Photo/Seth Wenig) Other inmates at the state prison in Dannemora may have been in a position to see or at least hear two convicts making their escape using power tools to cut steel, break through bricks and slice open steam pipes. But in a world where snitching can get you killed, investigators ran all too predictably into a wall of silence. \"Nobody heard anything. Nobody saw anything,\" Gov. Andrew Cuomo said sarcastically this week about the questioning of inmates. \"They're all heavy sleepers .\" Prison experts and former inmates say breaking through that silence is tough but not impossible. And in a case as notorious as the weekend escape of two murderers from the maximum-security Clinton Correctional Facility in Dannemora, investigators may be willing to make deals. \"There's certainly a group of people in every prison or every jail who are just waiting to be snitches,\" said University at Buffalo Law School professor Charles Ewing, a forensic psychologist. \"But it needs to be done very discreetly .\" A prisoner wanting to talk might send an anonymous note to the warden offering information that can be valuable currency behind bars. It could be traded for a favorable parole recommendation, dismissal of disciplinary measures, a transfer to a prison offering \"easier time,\" or something as simple as extra bedsheets. Indeed, investigators are wary of snitches who make up information just to get benefits or settle a score. But the code of silence can be so strong that any rewards authorities can offer may be outweighed by the dangers of being branded an informant. Investigators coming through a prison may well hear inmates yelling to each other from behind bars: \"Make sure you mind your business!\" said Ronald Day, a former New York inmate who is now a vice president of the Fortune Society, which helps ex-prisoners. The search for the escaped inmates entered a fifth day Wednesday, with law enforcement officers in helmets and body armor going door to door in the Dannemora area. The 170-year-old, 3,000-inmate prison has a particularly notorious reputation, singled out in a watchdog report last year for a higher rate of violence among inmates than most New York state prisons. State Assemblyman Daniel O'Donnell, who is chairman of the Corrections Committee and visited Clinton last September, said he was astounded by the accounts of violence from inmates. He said any inmate who might have heard the power tools used in the escape wouldn't dare say anything. \"Let me be clear: That will get you killed. That's the kind of environment it is,\" O'Donnell said. \"You can't expect people to behave like Catholic school monitors .\" While investigators try to protect their prison sources, Day said word of any informants on a case as big as this one is likely to leak out. It took New York City private investigator Joseph Barry three years to persuade a group of convicts at the Dannemora prison to sign statements clearing fellow inmate <mark>David Wong</mark> in a deadly prison-yard stabbing. Barry showed up repeatedly, seeking to catch the inmate witnesses by surprise and in private. Over time, more than 10 met with him behind bars. Some were promised parole recommendations, transfers or other benefits, he said. But the ultimate factor in getting them to come forward? The fact that the inmate they implicated in the stabbing had died and couldn't retaliate, Barry said. \"Because you can't be looking over your shoulder all the time,\" he said. 1 AACP lends supports to local leader accused of misrepresenting herself as black 2 Prison worker smuggled tools, other items to escaped inmates that may have aided their break-out 3 Ex-candidate pleads guilty in New Mexico topless video extortion case 4 Prosecutor: Slain mom, girl were witnesses against suspect", "articleID": "2015061219_00022745_W", "names": {"David Wong": ["Q1177251", "Q5240254", "Q5241267", "Q5241268", "Q5241269", "Q7186568", "Q7930045", "Q8231513"]}}, {"date": "2015-06-13", "url": "http://thespec.com/news-story/5671948-hhs-and-joseph-brant-spend-big-on-administration", "content": "Low morale, disrespect dominates workplace culture: public works survey Airbnb capitalizes on island traditions for brisk growth in Cuba listings Airbnb has grown rapidly in Cuba because it took advantage of two...How big does the lottery jackpot need to be to let you quit your job? President of Kylemore Communities/Angus Glen Development among runners June...June 12 editorial cartoon Editorial cartoon for Friday, June 12, 2015 by Graeme MacKay, The Hamilton...Increased risk of schizophrenia if you had a cat as a kid: study Academics say your feline friend could put you at higher risk of mental...HHS and Joseph Brant spend big on administration Hamilton Health Sciences and Burlington's Joseph Brant Hospital spend more than average on administration compared to other Canadian hospitals. Just over six per cent of the $1.2 billion budget at HHS goes to administration, finance, human resources and communications, according to a national report released Wednesday. To compare, the national average is 4.5 per cent. Hamilton seniors declining faster than average in long-term care homes Joseph Brant was nearly double that at almost 8.5 per cent of its $150-million budget in the fiscal year starting April 1, 2013 and ending March 31, 2014. That is down from a high of 10.5 per cent the year before and nine per cent in 2011/2012. St. Joseph's Healthcare is below the national average at four per cent of its $600-million budget. The provincial average is just under six per cent, found the Canadian Institute for Health Information in its annual report on hospital performance, long-term care and the health of area residents. \"It's important to devote as many resources as we can to patient care,\" said Dr. <mark>David Higgins</mark>, president of St. Joseph's, which dropped its average by a percentage point in one year. \"It's a balancing act,\" said <mark>Higgins</mark>, noting organizations have to be careful not to spend too little on administration. \"We strive so that it is as low as we can reasonably achieve .\" HHS spent nearly $1.1 million on CEO salaries in 2014. New hire Rob MacIsaac was the second-highest paid hospital CEO in Ontario, making $757,583 in salary and taxable benefits. At the same time, HHS paid $312,618 to former CEO Murray Martin, revealed public salary disclosure released by the province in March. Both HHS and Joseph Brant say their higher than average administration costs are the result of one-time expenses. A $7-million pay equity payment caused HHS administration costs to rise to 6.2 per cent from just over 5.6 per cent the year before, says Dr. <mark>Richard McLean</mark>, executive vice-president of interprofessional practice and chief medical executive. \"It's not a reflection of the fact we have too many administrators. That's not what's going on .\" Joseph Brant claims its administration costs temporarily went up because of an internal operational review and a reorganization of the administration. \"It is something we monitor,\" said Susan Wannamaker, senior vice-president at Joseph Brant. The interactive report, which is available at www.cihi.ca, also found HHS and Joseph Brant do more caesarean sections for high-risk births than average. HHS has been around 16 per cent for four years while Joseph Brant has been at about 18 per cent for three years. The national average is 14 per cent and St. Joseph's is around 13 per cent. \"We're working on it,\" said <mark>McLean</mark>. \"C-section rates are creeping up everywhere. We are paying an increasing amount of attention to it .\" For St. Joseph's, the report flagged an issue with patients returning to hospital after discharge. The rates were higher than average for medical and surgical patients, as well for all hospital patients as a whole. Return rates were also slightly higher than average for surgical patients at HHS. \"We're focused very much on this,\" said <mark>Higgins</mark>. \"It's distressing for patients to come back to the hospital again. We want to do better .\" The biggest outlier was backlogs in the emergency department at Joseph Brant. The report found it takes more than 60 hours for nine out of 10 patients in the emergency department to get a bed in the Burlington hospital. That is more than double the provincial and national average. \"We know our numbers aren't where they need to be,\" said Wannamaker. \"We have a number of initiatives across the organization focused on patient flow .\" She stresses the numbers in the report are a \"point in time .\" \"It provides us with a goalpost,\" she said. \"But there are a lot of things that change .\" Innovative robotic hair restoration a cut about traditional transplants Robotic hair transplants have made finding a permanent solution to hair loss less invasive, leaving...Low morale, disrespect dominates workplace culture: public works survey Dying man bled profusely onto street as students left school, trial hears", "articleID": "2015061301_00006563_W", "names": {"David Higgins": ["Q1174729", "Q2595776", "Q26329081", "Q41048497", "Q47467677", "Q5234981", "Q5234982"], "Richard Mclean": ["Q1524417", "Q7327751"]}}, {"date": "2015-06-11", "url": "http://news.smh.com.au/breaking-news-sport/jets-make-pascoe-acting-football-manager-20150611-3xkrb.html", "content": "Register Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Two weeks after former Newcastle assistant coach James Pascoe was shown the door, he's been appointed as the beleaguered club's interim football manager. Pascoe replaces experienced administrator Ben Mannion, who was appointed as Newcastle's general manager of football last month but has been left high and dry after the recent change in club ownership. Mannion, who had been Football Queensland's chief operating officer for past three years, came to the Jets when the club was still owned by Nathan Tinkler's Hunter Sports Group. At the time, Jets chief executive Mitchell Murphy described Mannion as a \"first-rate sporting administrator\" and his appointment as a \"major coup\" for the club. Advertisement It's understood Mannion was offered the role by FFA, which is now in control of the club - but only on a significantly reduced salary, despite assurances he would be retained on like-for-like terms. Pascoe and fellow assistant <mark>Mark Jones</mark> were released from the Jets when coach Phil Stubbins was axed last month, as new owners Football Federation Australia announced it would seek a new manager as part of a fresh start for the 2015-16 season. The club announced on Thursday that Pascoe would start immediately in assisting with Newcastle's pre-season planning and development, player recruitment and A-League compliance matters. \"James brings the right football and administrative skills, but as importantly has a great insight into football in Northern NSW and the elite player pathways,\" said A-League boss Damien de Bohun. \"This appointment is the first of many steps to ensure that there is a strong Novocastrian spirit in the new club that is taking shape .\" The Hunter Sports Group's licence was revoked three weeks ago after it failed to pay a series of debts, with Tinkler earlier that day placing the Jets into voluntary liquidation saying it owed $2.7 million.", "articleID": "2015061303_00002964_W", "names": {"Mark Jones": ["Q15072754", "Q15222722", "Q17523860", "Q22005690", "Q3294123", "Q3849506", "Q3849511", "Q6768275", "Q6768277", "Q6768278", "Q6768280", "Q6768281", "Q6768282", "Q6768283", "Q6768284", "Q6768285", "Q6768286", "Q6768287", "Q6768289", "Q934587"]}}, {"date": "2015-06-15", "url": "http://ktvz.com/news/wyden-intros-bill-to-cut-craft-brewers-taxes-rules/33551552", "content": "Deschutes Brewery founder <mark>Gary</mark> Fish backs Sen. Wyden's bid to cut regulations, taxes on craft brewers PORTLAND, Ore. - Sen. Ron Wyden, D-Ore ., said Friday he has introduced legislation that would promote continued job creation in the growing craft beverage, cider, wine and distillery industries throughout Oregon and the country. The Craft Beverage Modernization and Tax Reform Act, S. 1562, introduced Thursday, would cut taxes and modernize outdated regulations for craft brewers, cider makers, vintners, and distillers. Junction City police chief sues city, ex-administrator Most Oregon sex offenders not listed on public website Bundy denies firing gunshots near US researchers in Nevada In Oregon, those industries are responsible for an estimated 40,000 jobs collectively and generate about $6 billion annually in revenue. \"Oregon's craft beer, wine, cider and spirits producers are both world-renowned and a huge boon to our state's economy,\" said Wyden, co-chair of the Senate Bipartisan Small Brewers Caucus. \"Each of these industries is unique, and this legislation takes targeted approaches to update antiquated rules and reduce taxes for these growing businesses to ensure that these innovators continue to create high-quality jobs for Oregonians,\" added Wyden, the top Democrat on the Senate Finance Committee, which oversees excise taxes and alcohol regulations. Wyden's legislation builds on a consensus reached among multiple industry groups. And it builds on a number of popular proposals, including the Small BREW Act sponsored by Senators Ben Cardin (D-Md .) and <mark>Susan Collins</mark> (R-Maine); the Fair BEER Act sponsored by Senators Roy Blunt (R-Mo .) and Tammy Baldwin (D-Wisc .); the Distillery Excise Tax Reform Act sponsored by Senator <mark>Gary Peters</mark> (D-Mich .); the CIDER Act sponsored by Senator Charles Schumer (D-N.Y.); the AGED Spirits Act sponsored by Senate Majority Leader Mitch McConnell (R-Ky .); and the Craft Beverage Bond Simplification Act, which was approved by the Finance Committee earlier this year. In addition, Wyden's legislation includes a variety of new proposals to reduce tax and regulatory burdens for each industry. \"As co-chair of the Senate Bipartisan Small Brewers Caucus, Senator Wyden has been a longtime champion for America's craft brewers and we appreciate his strong support,\" said Bob Pease, CEO of the Brewers Association. \"He has been diligently working to reduce federal excise taxes for craft brewers through his co-sponsorship of the Small BREW Act. Now with the introduction of the Craft Beverage Modernization and Tax Reform Act, Senator Wyden has gone even further to ensure growth for small and independent brewers .\" \"We applaud Senator Wyden for this positive step forward in addressing beer excise tax reform in a fair, equitable and comprehensive way,\" said Jim McGreevy, president and CEO of the Beer Institute, a national trade association representing brewers, beer importers and industry suppliers. \"The beer-specific provisions of this bill will help brewers and beer importers of all sizes. We look forward to working with the Senator and our industry partners to build support for this important legislation .\" \"Oregon's breweries contribute mightily to our state's economy and Senator Wyden's legislation will allow our small businesses to build on what they've done naturally for decades - create good-paying jobs all across our state,\" said Deschutes Brewery Founder <mark>Gary</mark> Fish, Board Chair of the Brewers Association. \"A fresh approach to eliminating outdated regulations and lowering taxes is a recipe for breweries' uniquely Oregon success story to continue for years to come .\" \"The Oregon Winegrowers Association thanks Senator Wyden for his continuing support and leadership on issues that help improve the competitiveness of Oregon's craft beverage brands,\" said Association Board Director and Treasurer Steve Thomson, Executive Vice President at King Estate Winery. \"Under his proposal, Oregon's midsize and small family wineries would see a significant new tax benefit, enabling them to reinvest in their businesses and further fuel the wine industry's growth and contribution to the Oregon economy. Currently Oregon's 605 wineries, 950 vineyards, and related businesses account for 17,100 jobs, $208 million in tourism, and $3.35 billion in total annual economic impact spread across Oregon's 36 counties .\" \"I am excited to a see very progressive and comprehensive approach to positively change the excise tax for the cider industry, dramatically improve the small producer credit so growth is not taxed excessively and at the same time offer our regulating body, the TTB, more funds to assist our growing industry with compliance,\" said James Kohn, owner of Salem-based Wandering Aengus Ciderworks. \"The Craft Beverage Modernization and Tax Reform Act is a comprehensive piece of legislation that tackles some of the most significant barriers that America's distillers currently face, and it provides a measure of excise tax parity that will boost investment and create new jobs in communities across the country,' said Thomas Mooney, President of the American Craft Spirits Association and Co-Owner & CEO of House Spirits Distillery in Portland .\" These issues are important to the rapidly growing number of American craft distillers, and this bill comes only days after the introduction of the bipartisan Distillery Innovation and Excise Tax Reform Act of 2015 (HR 2520) in the House. On behalf of more than 700 distillers across the country, and as an Oregon distiller myself, I thank Senator Wyden for his leadership in taking on these important issues in the Senate. \"In addition to providing tax relief for Oregon's brewers, cider makers, vintners, and distillers, this legislation would also reduce compliance burdens for craft beverage producers by exempting nearly 90 percent of all industry members from complex bonding and bi-weekly tax filing requirements. The bill would exempt aged beers, ciders, wines, and spirits from complicated and burdensome accounting rules. It would reform rules on brewers to encourage more collaboration and streamline regulations. And it would equalize the playing field for all distilled spirits producers. Finally, this bill would cut administrative backlogs by ensuring the Alcohol and Tobacco Tax and Trade Bureau, which is charged with regulating these industries, is sufficiently funded. Additional enforcement funding and authority would help offset the cost of this bill by cracking down on tax cheats. Copyright 2015 KTVZ. All rights reserved. This material may not be published, broadcast, rewritten or redistributed Comments The views expressed are not those of this company or its affiliated companies. Please note by clicking on\" Post \"you acknowledge that you have read the Terms of Service and the comment you are posting is in compliance with such terms. Confirm Unsubscribe Are you sure you would like to unsubscribe from all current subscriptions? Please set an email address for your profile. To complete your registration on this site, please supply an address.", "articleID": "2015061502_00012968_W", "names": {"Gary Peters": ["Q1230954", "Q1494930", "Q5525742", "Q56560036"]}}]