[{"date": "2015-06-15", "url": "http://ktvz.com/news/wyden-intros-bill-to-cut-craft-brewers-taxes-rules/33551552", "content": "Deschutes Brewery founder <mark>Gary</mark> Fish backs Sen. Wyden's bid to cut regulations, taxes on craft brewers PORTLAND, Ore. - Sen. Ron Wyden, D-Ore ., said Friday he has introduced legislation that would promote continued job creation in the growing craft beverage, cider, wine and distillery industries throughout Oregon and the country. The Craft Beverage Modernization and Tax Reform Act, S. 1562, introduced Thursday, would cut taxes and modernize outdated regulations for craft brewers, cider makers, vintners, and distillers. Junction City police chief sues city, ex-administrator Most Oregon sex offenders not listed on public website Bundy denies firing gunshots near US researchers in Nevada In Oregon, those industries are responsible for an estimated 40,000 jobs collectively and generate about $6 billion annually in revenue. \"Oregon's craft beer, wine, cider and spirits producers are both world-renowned and a huge boon to our state's economy,\" said Wyden, co-chair of the Senate Bipartisan Small Brewers Caucus. \"Each of these industries is unique, and this legislation takes targeted approaches to update antiquated rules and reduce taxes for these growing businesses to ensure that these innovators continue to create high-quality jobs for Oregonians,\" added Wyden, the top Democrat on the Senate Finance Committee, which oversees excise taxes and alcohol regulations. Wyden's legislation builds on a consensus reached among multiple industry groups. And it builds on a number of popular proposals, including the Small BREW Act sponsored by Senators Ben Cardin (D-Md .) and <mark>Susan Collins</mark> (R-Maine); the Fair BEER Act sponsored by Senators Roy Blunt (R-Mo .) and Tammy Baldwin (D-Wisc .); the Distillery Excise Tax Reform Act sponsored by Senator <mark>Gary Peters</mark> (D-Mich .); the CIDER Act sponsored by Senator Charles Schumer (D-N.Y.); the AGED Spirits Act sponsored by Senate Majority Leader Mitch McConnell (R-Ky .); and the Craft Beverage Bond Simplification Act, which was approved by the Finance Committee earlier this year. In addition, Wyden's legislation includes a variety of new proposals to reduce tax and regulatory burdens for each industry. \"As co-chair of the Senate Bipartisan Small Brewers Caucus, Senator Wyden has been a longtime champion for America's craft brewers and we appreciate his strong support,\" said Bob Pease, CEO of the Brewers Association. \"He has been diligently working to reduce federal excise taxes for craft brewers through his co-sponsorship of the Small BREW Act. Now with the introduction of the Craft Beverage Modernization and Tax Reform Act, Senator Wyden has gone even further to ensure growth for small and independent brewers .\" \"We applaud Senator Wyden for this positive step forward in addressing beer excise tax reform in a fair, equitable and comprehensive way,\" said Jim McGreevy, president and CEO of the Beer Institute, a national trade association representing brewers, beer importers and industry suppliers. \"The beer-specific provisions of this bill will help brewers and beer importers of all sizes. We look forward to working with the Senator and our industry partners to build support for this important legislation .\" \"Oregon's breweries contribute mightily to our state's economy and Senator Wyden's legislation will allow our small businesses to build on what they've done naturally for decades - create good-paying jobs all across our state,\" said Deschutes Brewery Founder <mark>Gary</mark> Fish, Board Chair of the Brewers Association. \"A fresh approach to eliminating outdated regulations and lowering taxes is a recipe for breweries' uniquely Oregon success story to continue for years to come .\" \"The Oregon Winegrowers Association thanks Senator Wyden for his continuing support and leadership on issues that help improve the competitiveness of Oregon's craft beverage brands,\" said Association Board Director and Treasurer Steve Thomson, Executive Vice President at King Estate Winery. \"Under his proposal, Oregon's midsize and small family wineries would see a significant new tax benefit, enabling them to reinvest in their businesses and further fuel the wine industry's growth and contribution to the Oregon economy. Currently Oregon's 605 wineries, 950 vineyards, and related businesses account for 17,100 jobs, $208 million in tourism, and $3.35 billion in total annual economic impact spread across Oregon's 36 counties .\" \"I am excited to a see very progressive and comprehensive approach to positively change the excise tax for the cider industry, dramatically improve the small producer credit so growth is not taxed excessively and at the same time offer our regulating body, the TTB, more funds to assist our growing industry with compliance,\" said James Kohn, owner of Salem-based Wandering Aengus Ciderworks. \"The Craft Beverage Modernization and Tax Reform Act is a comprehensive piece of legislation that tackles some of the most significant barriers that America's distillers currently face, and it provides a measure of excise tax parity that will boost investment and create new jobs in communities across the country,' said Thomas Mooney, President of the American Craft Spirits Association and Co-Owner & CEO of House Spirits Distillery in Portland .\" These issues are important to the rapidly growing number of American craft distillers, and this bill comes only days after the introduction of the bipartisan Distillery Innovation and Excise Tax Reform Act of 2015 (HR 2520) in the House. On behalf of more than 700 distillers across the country, and as an Oregon distiller myself, I thank Senator Wyden for his leadership in taking on these important issues in the Senate. \"In addition to providing tax relief for Oregon's brewers, cider makers, vintners, and distillers, this legislation would also reduce compliance burdens for craft beverage producers by exempting nearly 90 percent of all industry members from complex bonding and bi-weekly tax filing requirements. The bill would exempt aged beers, ciders, wines, and spirits from complicated and burdensome accounting rules. It would reform rules on brewers to encourage more collaboration and streamline regulations. And it would equalize the playing field for all distilled spirits producers. Finally, this bill would cut administrative backlogs by ensuring the Alcohol and Tobacco Tax and Trade Bureau, which is charged with regulating these industries, is sufficiently funded. Additional enforcement funding and authority would help offset the cost of this bill by cracking down on tax cheats. Copyright 2015 KTVZ. All rights reserved. This material may not be published, broadcast, rewritten or redistributed Comments The views expressed are not those of this company or its affiliated companies. Please note by clicking on\" Post \"you acknowledge that you have read the Terms of Service and the comment you are posting is in compliance with such terms. Confirm Unsubscribe Are you sure you would like to unsubscribe from all current subscriptions? Please set an email address for your profile. To complete your registration on this site, please supply an address.", "articleID": "2015061502_00012968_W", "names": {"Susan Collins": ["Q22279", "Q7647692"]}}, {"date": "2015-06-15", "url": "http://wesm913.org/post/race-president-really-begins-week", "content": "Mark this down as the week the race for president begins in earnest. officially off the sidelines. And the crowded GOP field now includes 11 candidates, while Democrats have four hopefuls in the race. For Republicans especially, the pressure is on to make the most of their nascent campaigns to make it into the first presidential debate, which is a mere 52 days away on Aug. 6 in Cleveland. \"Everyone's starting their engines and deciding they're going to have to make this push now,\" said national GOP strategist Ford O'Connell. There has been little drama this cycle with the will-they-or-won \"t-they game. Virtually everyone who has been toying with a White House run has pulled the trigger. Only Govs. <mark>Scott Walker</mark>, Wisconsin; Chris Christie, New Jersey; Bobby Jindal, Louisiana; and John Kasich, Ohio, are left. <mark>Walker</mark> is reportedly eyeing an official announcement the second week of July, after his state's budget deadline, while Jindal is set to announce next June 24. Christie continues to give signs that he is getting in, while Kasich has started to build a team in the early states and hired top-name consultants. Some of the candidates who got in early have all gotten bounces. Texas Sen. Ted Cruz, who announced nearly three months ago, saw his stock rise, especially in Iowa, while Florida Sen. Marco Rubio saw a marked uptick in early states and nationally. Meanwhile, despite good reviews, other candidates - including former Hewlett-Packard CEO Carly Fiorina, South Carolina Sen. Lindsey Graham and Texas Gov. Rick Perry - are still lagging in the polls and face the real threat of being left off the first debate stage. Fox News has decided they are limiting the event to the top 10 candidates in an average of the most recent national polls, though last week they bowed to pressure and will host a forum earlier that day for candidates who don't make the cut. Monday, all eyes were on Bush, as he officially launched his presidential campaign. Though he was one of the first to confirm in December he was\" actively exploring \"a bid - and he has so many establishment advantages of money and organization - his unofficial campaigning over the past few months has been unable to put any space between him and the rest of the field. He hopes his official campaign announcement can be something of a reset .\" I will take nothing and no one for granted, \"he said Monday in Miami at his kickoff .\" I will run with heart. I will run to win. \"While the past two nominating cycles have seen the GOP establishment favorite eventually take the nomination, strategists warn that this cycle there's now no clear front-runner .\" He's the one with the hardest task, \"said Ford O'Connell, who worked for the Arizona senator's 2008 campaign .\" Unlike previous establishment folks like [John] McCain and [Mitt] Romney, the one thing he faces they didn't is a very challenging field. \"After missteps and concern from conservatives over his positions on immigration reform and Common Core educational standards, Bush is near the top of the pack Iowa. Another big question will be answered on Tuesday - what will <mark>Donald Trump</mark> do? After flirting with presidential runs for years - and trying to psych out the press - the reality TV star and business mogul keeps talking like he's really taking the plunge this year. If that does happen, he could push other candidates off the debate stage, too, since he's currently polling ninth nationally. The field could see another aftershock if Kasich does jump in. But the Ohio governor could face the curse of other candidates who have waited too long to officially announce - Perry waited until August 2011 last time and never gained traction, while in 2008, then-Tennessee Sen. Fred Thompson's long-awaited candidacy flopped .\" A lot of people don't understand that running for president looks real easy from the cheap seats but it's a lot different from the ground, \"said O'Connell.", "articleID": "2015061721_00011898_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"]}}, {"date": "2015-06-25", "url": "http://www.daijiworld.com/news/news_disp.asp?n_id=329810", "content": "Tuesday, June 23, 2015 10:36:47 AM (IST) Sr Nirmala Joshi, successor of Mother Teresa passes away Kolkata, Jun 23 (IANS): Sister Nirmala, who succeeded Mother Teresa as superior general of the Missionaries of Charity, died here on Tuesday. She was 81. Prime Minister Narendra Modi said her life was devoted to \"caring for the poor and underprivileged\". Nirmala became the second head of the Missionaries of Charity after its founder Mother Teresa stepped down from the post in March 1997. The Nobel laureate died on September 5 the same year. Nirmala held the post till March 24, 2009, when she was succeeded by Sister Mary Prema. Archbishop of Kolkata <mark>Thomas D'Souza</mark> told IANS that the funeral mass will be held at the Mother House on Wednesday at 4 p.m. Sister Nirmala will be laid to rest at the St. John's cemetery. Born Nirmala Joshi in Ranchi to a Brahmin family from Nepal in 1934, she joined the MoC after converting from Hinduism in het youth. An MA in political science and a trained lawyer, Sister Nirmala started the MoC's contemplative branch in 1976 and headed it till 1997 when she was elected to succeed Mother Teresa as the order's Superior General. She was elected for a second term in 2003. Sister Nirmala was re-elected for a third term on March 13, 2009, but the MoC held a second election days later after she wanted to be relieved of the responsibility owing to ill-health and also expressed a desire to return to the contemplative life she led before heading the order. Sister Nirmala was honoured with India's second highest civilian order Padma Vibhushan in 2009 for her services to the nation. West Bengal Chief Minister Mamata Banerjee condoled Sister Nirmala's death and tweeted: \"Saddened at the passing of Sister Nirmala who headed Missionaries of Charity after Mother Teresa. Kolkata and the world will miss her .\" Banerjee paid her last respects to Sister Nirmala at St John's Church here. Describing it as a personal loss, she said the state government will extend all help and cooperation for the last rites. International Society for Krishna Consciousness (ISKCON) also extended its condolences. \"Her life of dedication and service especially to the poor is a great inspiration and it is to be pondered upon and to be followed,\" ISKCON's spokesperson Radharaman Das said. Stay updated wherever you go with Daijiworld.com and Daijiworld 24X7 tv channel mobile apps. My association with Sr.. Nirmala was in 1957 when she was a Hindu. Her name then was Kusum Joshi. She was doing her post graduation and we six of us Mangalorean teachers, working at Patna Womens College. She stayed with us along with her two sisters, Rabha and Bindu. She was also N.C.C. captain. A very jovial, smart and active person. Though she was a Hindu, she attended daily mass regularly. She was an inspiration to us catholics. After many years I met her in Mangalore as Sr.. Nirmala. I was extremely excited to see her. She told me then, that her sister Radha expired some years back and Bindu ian A.C. nun in one of the convents in the north. <mark>William Joseph</mark> & Milliana Concessao, Mangalore, Muscat. Wednesday, June 24, 2015 Olivia Moras, Mangalore/Toronto Canada Stanley Menezes, Modankap/Jeddah KSA EVANS N MARIA ALEX, FALNIR MANGALORE Augustine Daniel <mark>D'Souza</mark>, Udupi - Mumbai - VASAI - STATE OF KUWAIT One of the noble soul passed through this earth! As she continued the legacy of Mother Teresa, hope somebody will take over the legacy from Sr.. Nirmala. Santan Mascarenhas, Kinnigoli/Mumbai RIP Sister Nirmala. Big thanks to you for the dedication of your entire life for the poor, sick, lepers, destitute and dying. Govt of India gave you Padma Vibushan for your dedicated service. Her father, who was an Army Officer in British Army till 1947, came to her convent with a gun to take back her. But, after sensing her determination and meeting Mother Theresa, we went back. I think her younger sister is also a sister in M.C. Tuesday, June 23, 2015 A very big thank you from the bottom of our hearts for dedicating your life to God in the service of the \"poorest of the poor' and the down trodden in the footsteps of our most Blessed Mother Teresa - a Saint to us. Your Comment [Please limit your comments within 2000 characters] Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Published by Daijiworld Media Pvt Ltd Mangalore Editor-in-chief: Walter Nandalike Corporate Office: Daijiworld Residency, Airport Road, Bondel Post, Mangalore - 575 008 Karnataka India City Office: First Floor, Divya Deepa Arcade, About Us Copyright © 2001 - 2015. All rights reserved. Kishoo Enterprises, Maithri Complex, 3rd Floor, Udupi Service Bus Stand, Udupi, Karnataka. Pin 576101 Telephone: 0091-820-4295571 Daijiworld Middle East FZE P.O. Box: 84772, Dubai, UAE Tel: 971-50-6597629 Fax: 971-4-2639207", "articleID": "2015062506_00003575_W", "names": {"Thomas D'Souza": ["Q2423560", "Q30232517"], "William Joseph": ["Q12898320", "Q28914201", "Q8013761", "Q8013762", "Q8013764"]}}, {"date": "2015-06-23", "url": "http://iphone.sys-con.com/node/3345150", "content": "IT Operations and Digital Disruption | @ DevOps Summit #APM #DevOps Transaction-Centric NPM: Enabling IT/Business Collaboration One of the consequences of digital disruption is that IT is propelled much closer to users, who expect applications and services to be available and to perform well anytime, anywhere, on any device. Communicating with the business now more than ever requires communicating with these users, and effective communication requires a clear understanding of their experience with the application services you deliver. But how well do you understand end-user experience? To answer that question, let's first define end-user experience as the transaction response time a user receives from an application service; click to glass seems to be the term in vogue. Alternatively, you can look at the question from a different perspective: How is the quality of your application services measured? Are you driven primarily by infrastructure and application performance metrics, or by end-user experience? Whether your data center supports customer-facing applications that directly generate revenue or enterprise applications that automate and manage critical business processes - or, increasingly, both - application performance matters. It is the way your service quality is perceived by your users - consumers or employees. Business owners understand this intrinsically; poor ecommerce site performance results in lost revenue and damaged loyalty, while internally, poor application performance leads to decreased productivity and lost business opportunities. APM's Three Aspects Application performance monitoring can be segmented into three aspects, or disciplines: Device monitoring provides critical visibility into the health of the infrastructure components - the servers, disks, switches, routers, firewalls, desktops, etc. required to deliver application services. Application monitoring provides visibility into critical application components, such as application containers, methods, databases, APIs, etc.. End-user experience monitoring, within its performance context, provides visibility into user productivity, and provides a top-down business-centric perspective of both device and application performance. It's clear that the first two aspects - device and application monitoring - are fundamentally important. We should also be able to agree that, to answer our earlier question about service quality, you must also measure the end-user's experience. When users complain, they speak in terms of transaction speed, not network latency, interface utilization, database queries, java server pages, or CPU speed. (Well, if you're on the network team, you'll claim they often will say the network is slow, but we generally know better .) The user's experience can be considered the intersection between business metrics (productivity) and IT metrics (device and application); it's the one metric both groups have in common. Most of us are pretty good at device and application monitoring; this is often not the case when we consider end-user experience monitoring. So what are the penalties if you're not measuring end-user experience?' You won't know users are having a problem until they call you (unless something catastrophic happens). You will chase after problems that don't affect users (because you're monitoring dozens, or hundreds, of metrics of varying impact). You won't have a description of the problem that matches your metrics (and therefore don't have a validated starting point for troubleshooting). You won't know when or if you've resolved the problem (without asking the users). At Cisco Live this week, an IT manager told me of his frustration with all-too-frequent 3 a.m. infrastructure or application alerts: should he get up and investigate? He had no idea if the problem of the moment had any impact on users. Only by adopting end-user experience monitoring was he able to qualify and prioritize his response. Don't We Already Measure End-User Experience? It's true that many applications - particularly those based on Java and. NET platforms - may already be instrumented with APM agents, some of which provide exactly this insight into end-user experience. However: These APM solutions are often not used by operations teams Not all Java and. NET apps will be instrumented (and if you're not using Dynatrace, you might only be sampling transactions) Many application architectures don't lend themselves to agent-based instrumentation IT operations teams therefore usually rely on more traditional infrastructure-centric device and network monitoring solutions. The rise of application-awareness (primarily in Application Aware Network Performance Monitoring - AA NPM - solutions, but also in device management offerings) has given IT varying degrees of insight into application behavior - and sometimes a degree of insight into application performance. However, without visibility into end-user experience, without a user transaction-centric starting point, these tools do little to foster the communication and collaboration we mentioned earlier. As I pointed out in a recent webcast called the Top Five Benefits of Transaction-Centric NPM, AA NPM solutions are generally quite limited in their ability to measure actual end-user experience, especially across a broad range of application architectures. Instead, these tools use key infrastructure measurements such as network latency, packet loss, jitter, etc., as indicators or hints of application performance as experienced by end users. These metrics may be quite meaningful to IT specialists, but they aren't end-user experience and don't provide a basis for effective communication. Published June 25, 2015 - Reads 1,136 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. Add your comment You must be signed in to add a comment ., we encourage comments that are on topic, relevant and to-the-point. We will remove comments that include profanity, personal attacks, racial slurs, threats of violence, or other inappropriate material that violates our Please wait while we process your request...In his General Session at 16th Cloud Expo, David Shacochis, host of The Hybrid IT Files podcast and Vice President at CenturyLink, investigated three key trends of the \"gigabit economy\" though the story of a Fortune 500 communications company in transformation. Narrating how multi-modal hybrid IT, service automation, and agile delivery all intersect, he will cover the role of storytelling and empathy in achieving strategic alignment between the enterprise and its information technology. Jun. 25, 2015 09:45 AM EDT Reads: 1,415 Slides: Growing IoT from Industry to Society It is one thing to build single industrial IoT applications, but what will it take to build the Smart Cities and truly society-changing applications of the future? The technology won't be the problem, it will be the number of parties that need to work together and be aligned in their motivation to succeed. In his session at @ ThingsExpo, Jason Mondanaro, Director, Product Management at Metanga, discussed how you can plan to cooperate, partner, and form lasting all-star teams to change the world and it starts with business models and monetization strategies. Jun. 25, 2015 09:00 AM EDT Reads: 879 Microservices and IoT Power Panel Buzzword alert: Microservices and IoT at a DevOps conference? What could possibly go wrong? In this Power Panel at DevOps Summit, moderated by Jason Bloomberg, the leading expert on architecting agility for the enterprise and president of Intellyx, panelists peeled away the buzz and discuss the important architectural principles behind implementing IoT solutions for the enterprise. As remote IoT devices and sensors become increasingly intelligent, they become part of our distributed cloud environment, and we must architect and code accordingly. At the very least, you'll have no problem fillin...Jun. 25, 2015 09:00 AM EDT Reads: 1,470 IT Transforming into the Cloud Enabler Business as usual for IT is evolving into a \"Make or Buy\" decision on a service-by-service conversation with input from the LOBs. How does your organization move forward with cloud? In his general session at 16th Cloud Expo, Paul Maravei, Regional Sales Manager, Hybrid Cloud and Managed Services at Cisco, discusses how Cisco and its partners offer a market-leading portfolio and ecosystem of cloud infrastructure and application services that allow you to uniquely and securely combine cloud business applications and services across multiple cloud delivery models. Jun. 24, 2015 12:00 PM EDT Reads: 1,260 @ ThingsExpo Keynote: The Internet of Everything Converging digital disruptions is creating a major sea change - Cisco calls this the Internet of Everything (IoE). IoE is the network connection of People, Process, Data and Things, fueled by Cloud, Mobile, Social, Analytics and Security, and it represents a $19Trillion value-at-stake over the next 10 years. In her keynote at @ ThingsExpo, Manjula Talreja, VP of Cisco Consulting Services, discussed IoE and the enormous opportunities it provides to public and private firms alike. She will share what businesses must do to thrive in the IoE economy, citing examples from several industry sectors. Jun. 24, 2015 11:45 AM EDT Reads: 1,461 There will be 150 billion connected devices by 2020. New digital businesses have already disrupted value chains across every industry. APIs are at the center of the digital business. You need to understand what assets you have that can be exposed digitally, what their digital value chain is, and how to create an effective business model around that value chain to compete in this economy. No enterprise can be complacent and not engage in the digital economy. Learn how to be the disruptor and not the disruptee. Jun. 24, 2015 11:30 AM EDT Reads: 1,235 Slides: <mark>Rodney Rogers</mark> Keynote Presentation In his keynote at 16th Cloud Expo, <mark>Rodney Rogers</mark>, CEO of Virtustream, discussed the evolution of the company from inception to its recent acquisition by EMC - including personal insights, lessons learned (and some WTF moments) along the way. Learn how Virtustream's unique approach of combining the economics and elasticity of the consumer cloud model with proper performance, application automation and security into a platform became a breakout success with enterprise customers and a natural fit for the EMC Federation. Jun. 24, 2015 09:30 AM EDT Reads: 1,564 Opening Keynote at Cloud Expo New York Growth hacking is common for startups to make unheard-of progress in building their business. Career Hacks can help Geek Girls and those who support them (yes, that's you too, Dad!) to excel in this typically male-dominated world. Get ready to learn the facts: Is there a bias against women in the tech / developer communities? Why are women 50% of the workforce, but hold only 24% of the STEM or IT positions? Some beginnings of what to do about it! In her Opening Keynote at 16th Cloud Expo, Sandy Carter, IBM General Manager Cloud Ecosystem and Developers, and a Social Business Evangelist, d.. . Jun. 24, 2015 08:30 AM EDT Reads: 1,393 Containers & Microservices Expo Launched SYS-CON Events announced today that the \"Second Containers & Microservices Conference\" will take place November 3-5, 2015, at the Santa Clara Convention Center, Santa Clara, CA, and the \"Third Containers & Microservices Conference\" will take place June 7-9, 2016, at Javits Center in New York City. Containers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. Jun. 22, 2015 02:15 PM EDT Reads: 2,115 SYS-CON Events announced today that the \"First Containers & Microservices Conference\" will take place June 9-11, 2015, at the Javits Center in New York City. The \"Second Containers & Microservices Conference\" will take place November 3-5, 2015, at Santa Clara Convention Center, Santa Clara, CA. Containers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. Jun. 20, 2015 12:00 PM EDT Reads: 3,357 @ ThingsExpo Sponsorship Opportunities With major technology companies and startups seriously embracing IoT strategies, now is the perfect time to attend @ ThingsExpo in Silicon Valley. Learn what is going on, contribute to the discussions, and ensure that your enterprise is as \"IoT-Ready\" as it can be! Internet of @ ThingsExpo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, is co-located with 17th Cloud Expo and will feature technical sessions from a rock star conference faculty and the leading industry players in the world. The Internet of Things (IoT) is the most profound change in personal an...Jun. 15, 2015 08:45 PM EDT Reads: 3,636 Cloud Expo Sponsorship Opportunities Announced 17th Cloud Expo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, will feature technical sessions from a rock star conference faculty and the leading industry players in the world. Cloud computing is now being embraced by a majority of enterprises of all sizes. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises are using some form of XaaS - software, platform, and infrastructure as a service. Jun. 15, 2015 07:15 PM EDT Reads: 3,376 Cloud Expo Silicon Valley \"Call for Papers' The 17th International Cloud Expo has announced that its Call for Papers is open. 17th International Cloud Expo, to be held November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, brings together Cloud Computing, APM, APIs, Microservices, Security, Big Data, Internet of Things, DevOps and WebRTC to one location. With cloud computing driving a higher percentage of enterprise IT budgets every year, it becomes increasingly important to plant your flag in this fast-expanding business opportunity. Submit your speaking proposal today! Jun. 15, 2015 10:15 AM EDT Reads: 5,362 Virtustream: A Blue Collar Unicorn In his keynote at 16th Cloud Expo, <mark>Rodney Rogers</mark>, CEO of Virtustream, discusses the evolution of the company from inception to its recent acquisition by EMC - including personal insights, lessons learned (and some WTF moments) along the way. Learn how Virtustream's unique approach of combining the economics and elasticity of the consumer cloud model with proper performance, application automation and security into a platform became a breakout success with enterprise customers and a natural fit for the EMC Federation. Jun. 11, 2015 08:00 AM EDT Reads: 1,890 @ ThingsExpo Silicon Valley Call for Papers The 4th International Internet of @ ThingsExpo, co-located with the 17th International Cloud Expo - to be held November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA - announces that its Call for Papers is open. The Internet of Things (IoT) is the biggest idea since the creation of the Worldwide Web more than 20 years ago. Jun. 10, 2015 06:00 PM EDT Reads: 2,844 SafeLogic CEO at Cloud Expo New York SafeLogic is proud to promote CEO Ray Potter's speaking engagement on the agenda of Cloud Expo New York City. Cloud Expo will be hosted at the Javits Center in Manhattan, New York, on June 9 - 11, 2015, alongside SYS-CON Media's Big Data Expo, Internet of Things Expo, SDDC (Software-Defined Datacenter) Expo, DevOps Summit, and WebRTC Summit, to form one massive event focused on today's hottest technologies. The need for reliable and secure data storage and processing is a common thread across each sub-event. Jun. 10, 2015 11:00 AM EDT Reads: 1,693 MediaTek Labs to Exhibit at @ ThingsExpo New York SYS-CON Events announced today that MediaTek Labs will exhibit at SYS-CON's @ ThingsExpo, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. MediaTek Labs is a global ecosystem initiative supporting Wearables and Internet of Things device creation, application development, and services based around MediaTek chipset offerings. Developers can use the MediaTek LinkIt ™ ONE development platform and the LinkIt ONE HDK to easily access the features and functions of the MediaTek MT2502 System on a Chip (SoC), with the goal of creating the next generation of MediaTek p.. . Jun. 9, 2015 01:00 PM EDT Reads: 1,769 Architecting IoT Enabled Supply Chains Businesses are increasingly considering IoT product enablement as a means to implement connected supply chains to support rapidly evolving business models. Manufacturing firms that are used to managing physical supply chains are suddenly finding themselves knee deep in requirements to implement digital supply chains with which they have little experience. While many analysts are jumping over each other to claim ever larger predictions for the expected growth of IoT over the next five years, it is clear that customers can be expected to vote with their feet, if they do not see value or trust th...Jun. 9, 2015 11:00 AM EDT Reads: 1,712 The Stories We Tell: Three Key Narratives In his General Session at 16th Cloud Expo, David Shacochis, host of The Hybrid IT Files podcast and Vice President at CenturyLink, will investigate three key trends of the\" gigabit economy \"though the story of a Fortune 500 communications company in transformation. Narrating how multi-modal hybrid IT, service automation, and agile delivery all intersect, he will cover the role of storytelling and empathy in achieving strategic alignment between the enterprise and its information technology. Jun. 9, 2015 09:15 AM EDT Reads: 1,855 Aria Systems to Discuss IoT at @ ThingsExpo NY Aria Systems, which helps enterprises grow recurring revenue, today announced that its co-founder and inventor of cloud billing <mark>Brendan O'Brien</mark>, will be a featured speaker at the Cloud Expo, June 9-11 at The Javits Center in New York. Aria also will be demonstrating its Active Monetization platform in Booth #424 on the Expo Floor. <mark>O'Brien</mark> will lead the following sessions: June 9 - 11:00 am - 11:35 am, Room 1A16 with participants from Constant Contact, MGI Research and ATG Enabling Complex Recurring Revenue Strategies - With IoT exploding, massive data will transform businesses with oppor...IBM Delivers Docker Based Container Services Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) In a recent survey of eighty IT and business professionals, 73 percent responded that having optimized mobile applications and user experiences was\" very important to critical \"to their company's future success. In the same survey however, 78 percent reported their mobile strategies and plans were inhibited or limited by their existing IT environment. These results reveal a critical gap between the requirements for success and the reality of the obstacles enterprises are facing. Overcoming these challenges is the strategic imperative facing large enterprises today. Jun. 25, 2015 12:17 PM EDT Reads: 159 Intelligent Infrastructure Defined Today, more organizations are looking at new technologies and applications for their operations. There is a convergence of industries that were thought to be independent which are now interdependent. What is missing is the ability to find common ground in definitions of infrastructure and other terminologies. From the US Army Corps of Engineers'\" Infrastructure and the Operational Art \"Handbook: The word infrastructure has many definitions, each tailored to the particular perspective of the author. Each is correct for the needs of the author, but in a broader, conceptual sense, multiple defi...Jun. 25, 2015 11:15 AM EDT Reads: 1,428 To the Industrial Internet...and Beyond In the last blog we started the conversation on our findings from @ Cloud Expo 2015 and @ ThingsExpo 2015 as the industry came together to explore the impact of Cloud and Internet of Things (IoT) on business models as we know them. While often the focus of IoT are consumer services and the sometimes over-simplification of what constitutes an IoT company or service, one area there is no disputing is the significant advancement in the Industrial Internet (a term made popular by GE). Ongoing improvements in sensor technologies - including performance, miniaturization, cost and energy consumption -...Jun. 25, 2015 11:15 AM EDT Reads: 1,366 Critical Communications & the Internet of Things The Internet of Things, IoT, is without a doubt one of the most buzzed about topics in our tech-obsessed culture right now. While I agree that the near-endless possibilities of the consumer side of IoT will transform our everyday lives for the better, making things simpler and more connected, it's not the only angle our society should focus on. There is a huge opportunity for the industrial IoT to significantly impact the world - especially in critical situations. Jun. 25, 2015 09:45 AM EDT Reads: 1,263 When something as simple as an API can integrate massive amounts of data into, and through, a wide variety of applications, any company can be a digital enterprise. There is a perception that some industries are using technology to innovate, while others languish in antiquated ways of running their business. But in our massively connected age, it's rare to find examples where technology isn't making an impact on helping organizations grow and become more efficient. John Deere is one of the world's largest and most successful manufacturers of agricultural machinery, and it's not a stretch to s.. . Jun. 25, 2015 09:45 AM EDT Reads: 1,151 IFTTT and the Internet of Things IFTTT stands for the conditional statement\" If this then that'. It is a web based service with a simple workflow. Flow of work (action, that) is created by a trigger based on a condition (this), like say, \"If it rains take the umbrella'. This service was provided in some cases, such as the various financial services that you could get an email if your chosen stock price reached a new high, etc.. They were called alerts and they are also used by banks and credit card companies. Jun. 25, 2015 09:30 AM EDT Reads: 388 Over the last couple months, in between some video coverage for events, I've been writing a series of IoT stories. From the basic What are These\" Things \"? and IoT Influence on Society to the descriptive IoT Effect on Applications and the IoT Ready Infrastructure. I thought it only fair to share how F5 can play within an IoT infrastructure. Because F5 application services share a common control plane-the F5 platform-we've simplified the process of deploying and optimizing IoT application delivery services. With the elastic power of Software Defined Application Services (SDAS), you can rapidl...Jun. 25, 2015 08:00 AM EDT Reads: 1,317 Where the Network Got Invited to the Party At DevOps Summit NY there's been a whole lot of talk about not just DevOps, but containers, IoT, and microservices. Sessions focused not just on the cultural shift needed to grow at scale with a DevOps approach, but also made sure to include the network\" plumbing \"needed to ensure success as applications decompose into the microservice architectures enabling rapid growth and support for the Internet of (Every) Things. Jun. 25, 2015 08:00 AM EDT Reads: 1,167\" People' Are Latest Trend at Cloud Expo People have re-entered the picture in discussions about cloud computing. This was my primary takeaway from this year's Cloud Expo East in New York, an event for which I serve as Conference Chair. Over three days, we hosted thousands of delegates attending sessions from more than 150 speakers, including two prominent women as keynoters, and a range of topics that covered not only enterprise cloud in general, but microservices and containers, Big Data and the IoT, WebRTC, software-defined most-anything, an emerging DevOps culture...and people. People, Process, & Technology People, process,...Jun. 25, 2015 07:45 AM EDT Reads: 773 Forking Hell, Why Unification Matters Leaving aside (most of) the deeper technical details of the situation, an interesting development occurred in the open source community this week. Under the auspices of The Linux Foundation, a new \"neutral' coding community emerged as a result of the coming together of the Node. js and io. js developer groups who will now collaborate to merge their respective code bases. Jun. 25, 2015 07:00 AM EDT Reads: 800 This week, the team assembled in NYC for @ Cloud Expo 2015 and @ ThingsExpo 2015. For the past four years, this has been a must-attend event for MetraTech. We were happy to once again join industry visionaries, colleagues, customers and even competitors to share and explore the ways in which the Internet of Things (IoT) will impact our industry. Over the course of the show, we discussed the types of challenges we will collectively need to solve to capitalize on the opportunity IoT presents. Jun. 24, 2015 08:00 AM EDT Reads: 1,398 I Almost Bit...and Would've Been Bitten SYS-CON Events announced today that the\" First Containers & Microservices Conference \"will take place June 9-11, 2015, at the Javits Center in New York City. The\" Second Containers & Microservices Conference \"will take place November 3-5, 2015, at Santa Clara Convention Center, Santa Clara, CA. Containers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. Jun. 20, 2015 12:00 PM EDT Reads: 3,357 Monitoring an Ear of Corn with an IoT Sensor? Today agricultural drones with sensors and analysis software can fly over large fields and analyze the crops and their needs precisely in seconds. Once upon a time, farmers would walk through a field or ride a horse around it to determine the amount of fertilizer and water their crops required. I have done this myself. Today agricultural drones with sensors and analysis software can fly over large fields and analyze the crops and their needs precisely in seconds. If we wanted to get even more ambitious, we could place an IoT (Internet of Things) sensor next to every stalk of corn to monito...Jun. 18, 2015 08:42 AM EDT Reads: 620 Performance Testers: Prepare for the IoT Within the next decade, we are going to see everything from power plants to transportation systems to factories to the appliances in our homes connected together for data collection, analytics, command-and-control, and all sorts of other applications. What is all this going to mean for performance testing? It's almost impossible to know for sure as so much of this story remains unwritten. However, there are industries where IoT is already happening. Let's take a look at a few of these and ponder the future of performance testing for IoT applications. iPhone Developer's Journal provides updates on related technology advances, software and business trends, and new products and standards relating to the iPhone. Sharding for Scale By @ LMacVittie | @ DevOpsSummit #Microservices Simplified API Monitoring for DevOps Teams | @ DevOpsSummit #API #DevOps Five Requirements for Application Services By @ LMacVittie | @ DevOpsSummit #DevOps DevOps with Containers for Microservices By @ SiRuslan | @ DevOpsSummit #DevOps Cloud Migration: From Monolith to Microservices | @ CloudExpo #Cloud #Microservices Sumo Logic Delivers Analytics for #Microservices & #Containers | @ DevOpsSummit #DevOps Microservices & IoT Power Panel at @ DevOpsSummit | #IoT #Microservices IBM Delivers #Docker - Based #Container Services | @ DevOpsSummit @ IBM #DevOps Deploy Applications with Containers | @ DevOpsSummit #DevOps #Containers Announcing @ CommVault\" Bronze Sponsor \"of @ CloudExpo Silicon Valley | #IoT #API #DevOps #Microservices Growing IoT from Industry to Society By @ JMondanaro | @ ThingsExpo #IoT Replication, Backup, and Recovery By @ Windstream | @ CloudExpo #Cloud IT Operations and Digital Disruption | @ DevOps Summit #APM #DevOps Announcing @ Solgenia_Corp to Exhibit at @ CloudExpo Silicon Valley | #IoT #API #DevOps #Microservices Critical Communications & the Internet of Things By @ ImadMouline | @ ThingsExpo #IoT Why Workloads Are Not on the Public Cloud | @ CloudExpo #IoT #API #Cloud Forking Hell, Why Unification Matters By @ ABridgwater | @ ThingsExpo #IoT IndependenceIT to Present at @ CloudExpo New York | @ IndependenceIT [#Cloud] To the Industrial Internet...and Beyond By @ EsmeSwartz | @ ThingsExpo #IoT #API ThingsExpo World's Most Influential M2M Media Brand @ ThingsExpo [#IoT] Private Cloud-in-a-Box By @ KellyMurphyGS | @ CloudExpo #DevOps #Docker BaaS - The New Possibility in Mobile Cloud Technology | @ CloudExpo #Cloud IT Transforming into the Cloud Enabler by @ CiscoCloud | @ CloudExpo #IoT #API #DevOps IBM Acquires @ BlueBox | @ CloudExpo #IoT #DevOps #OpenStack #Microservices Free Registration to #Containers and #Microservices Expo | @ CloudExpo #DevOps #IoT #API Day 3 Keynote at @ CloudExpo By @ RJRogers87 | #IoT #BigData #DevOps #Microservices Announcing @ AlertLogic\" Bronze Sponsor \"of @ CloudExpo & @ DevOpsSummit Silicon Valley | #IoT #DevOps I Almost Bit...and Would've Been Bitten By @ PSilvas | @ ThingsExpo #IoT Day 2 Keynote at @ ThingsExpo by @ ManjulaTalreja | @ Cisco_IoT #IoT Day 3 Keynote at @ CloudExpo By @ RJRogers87 | #IoT #Cloud #BigData Four Ways Technology Is Advancing Business By @ FrankMakesSense | @ CloudExpo #Cloud Containers and Microservices at @ CloudExpo New York By @ IoT2040 [#Cloud] DevOps Summit\" Call for Papers' Open | @ DevOpsSummit #DevOps #Docker #Microservices IoT Sponsorship Opportunities @ ThingsExpo Silicon | #IoT #M 2M #WebRTC #DevOps #Microservices WSM to Exhibit at @ CloudExpo New York | @ WSMINTL [#DevOps #Cloud] Cisco \"Gold Sponsor\" of @ CloudExpo New York | @ CiscoCloud [#Cloud #IoT] Myths of Cloud Computing with @ Wrecks47 | [@ CloudExpo @ OracleCloudZone] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Infrastructure as a Toolbox By @ SoftLayer at @ CloudExpo | #IoT #API #DevOps #Microservices Announcing @ Plutora to Exhibit at @ DevOpsSummit New York [#DevOps] Sponsorship Opportunities | @ CloudExpo #IoT #DevOps #Linux #Containers #Microservices Internet of Things and SAP HANA Cloud Platform | @ ThingsExpo @ SAPInMemory #IoT Internet of Things Supply Chains By @ Microsoft | @ ThingsExpo [#IoT] OpenShift Commons Latest in Battle with Cloud Foundry By @ IoT2040 | @ DevOpsSummit [#DevOps] Keep CALM And Embrace #DevOps By @ Momskij | @ DevOpsSummit [#IoT #Microservices] \"Cloud Foundry Deployment' By @ Altoros | @ DevOpsSummit [#DevOps] Top Three Cloud Takeaways from @ CloudExpo By @ IanKhanLive | #Cloud\" Signaling Layer for WebRTC' By @ MatrixDotOrg | @ ThingsExpo [#WebRTC #IoT] Integrating Security into #DevOps By @ ScriptRock | @ DevOpsSummit Seize The Biggest #Cloud, #BigData & #IoT Opportunity in 2015 | @ CloudExpo WebRTC, Internet of Things and API Gateways | @ ThingsExpo [#IoT #WebRTC] WebRTC Startup @ TemasysRTC Appoints Leaders | @ ThingsExpo [#WebRTC] Software-Defined Business with @ AppDynamics | @ DevOpsSummit #DevOps How to Accelerate Government IT By @ DHDeans | @ DevOpsSummit #DevOps Internet of Things Maturity Model By @ TonyShan | @ ThingsExpo [#IoT] New Relic's #Microservices and #Docker Platform | @ DevOpsSummit [#DevOps] \"UP Your OPs Game' By @ DTzar | @ DevOpsSummit [#DevOps @ MS_ITPro]. NET SDK for Cloud From @ ProfitBricksUSA | @ DevOpsSummit [#DevOps]\" Pillars of Modern Enterprise' By @ KrishAtRH | @ DevOpsSummit [#DevOps] Don't Skeu Up #Containers, Use #Microservices | @ DevOpsSummit [#DevOps] Andi Mann Outlines Vision | @ DevOpsSummit @ AndiMann #DevOps #Containers #Microservices DevOps Summit Was a Terrific Event! By @ QubellInc | @ DevOpsSummit [#DevOps] Scalable Cloud-Based Video Surveillance Solutions | @ CloudExpo [#Cloud] Timely, Optimal and Efficient with @ Creative_Busine | @ CloudExpo #Cloud Announcing @ Creative_Busine to Exhibit at @ CloudExpo New York [#Cloud] Making Agile Real: The Zen of Continuous Delivery By @ XebiaLabs | @ DevOpsSummit [#DevOps] Kafka Poll: Producer and Consumer Client By @ Sematext | @ DevOpsSummit [#DevOps] All the World's a Cloud All of Cloud Is at Cloud Expo! Cloud Computing - Big Data | Analytics - Internet of Things Containers - Microservices - WebRTC - DevOps Join Us at the Santa Clara Convention Center in Santa Clara, California, November 3-5 Cloud computing software is eating the world, and each day is bringing new developments in this world. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises are using some form of XaaS - software, platform, and Infrastructure as a Service. Big Data | Analytics and the emerging Internet of Things (IoT) are driving exponentially increased demands on datacenters and developers alike, as we cross the zettabyte horizon this year. Containers and microservices are now part of every PaaS conversation, and IaaS providers are increasingly competing for platform customers. WebRTC continues to reform web communications, and DevOps is pushing its way into an enterprise IT world that is increasingly agile, lean, and continuous. Through all this, Cloud Expo remains the single independent event where delegates and technology vendors can meet to experience and discuss the entire world of the cloud. Only Cloud Expo brings together all this in a single location: • Cloud Computing • Big Data | Analytics • Internet of Things • Containers | Microservices • WebRTC • DevOps Cloud computing budgets worldwide are reaching into the hundreds of billions of dollars, and no organization can survive long without some sort of cloud migration strategy. Each month brings new announcements, use cases, and success stories. Cloud Expo offers the world's most comprehensive selection of technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features a Demo Theater that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $300 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires June 8, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in Santa Clara [November 3-5, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2015062517_00006204_W", "names": {"Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"], "Rodney Rogers": ["Q3909415", "Q634812"]}}, {"date": "2015-06-25", "url": "http://www.hollywoodreporter.com/review/max-film-review-802593", "content": "The Bottom Line Anyone expecting complex, stirring drama is barking up the wrong tree. June 26 (Warner Bros. / MGM) Cast Josh Wiggins, Lauren Graham, Thomas Yakin After his Marine partner is killed in action, a military working dog is adopted by the soldier's Texas family. The handsome Belgian Malinois who plays the title character in Max (with the help of a few trusty stunt doubles) is an action star par excellence. He's also the only involving character in this blunt instrument of a family drama. The canine trouper fares best not just because of that expressive face and athletic body, but because he's spared the embarrassment of speaking the hokey dialogue. Emotional nuance never has been the forte of director Boaz Yakin (Remember the Titans) or his co-scripter, Sheldon Lettich (Rambo III), but here even the broad-stroke storytelling falls short of its intended impact - not helped by the desperate bombast of Trevor Rabin's score. The tale of a war-traumatized military working dog, or MWD, who helps a teen boy and his family overcome their own war-related grief, Max puts a YA slant on an intriguing setup. But the screenplay muddles its emotional core with a clunky cross between old-fashioned Hardy Boys mystery and a far-fetched weapons-trafficking subplot. Families who have already seen Inside Out might be enticed, along with moviegoers who are eager to root for a heroic hound and are not put off by the military angle. Though the movie's good guys and bad guys couldn't be more clearly drawn, that military angle is far from flag-wavingly simplistic (though not exactly complex), with Yakin and Lettich foregrounding PTSD and other devastating effects of frontline battle. Max's post-traumatic stress makes him unable to work with anyone else after his Marine handler, Kyle Wincott (Robbie Amell), is killed in Afghanistan. The sight of Max running to Kyle's coffin is wrenching. Summer Movie Guide: Sequels...Comedy...Action! Soon after the funeral, the Wincotts are alerted that Max will be put down, so they decide to adopt him. The decision is spearheaded by mom Pamela (Lauren Graham, lending leavening warmth), who declares, in one of the film's more effective lines, that \"this family takes care of its own .\" Dad Ray, an injured Iraq vet played with overdone rigidity by Thomas Haden Church, comes to blame the dog for his son's death, upping the friction between him and his younger son, Justin (Josh Wiggins of Hellion), who becomes Max's caretaker. With training tips from tough-talking tomboy Carmen (Mia Xitlali) that are drawn straight from the Cesar Millan playbook, Justin puts aside his video-game bootlegging enterprise and learns to handle Max and understand him. He discovers, too, that the dog growls around Kyle's friend and fellow Marine Tyler (Luke Kleintank) for a reason. Having telegraphed Tyler's bad-apple status from the get-go, Yakin draws a widening circle of hard-to-buy connections involving the discharged Marine, local gang leader Emilio (Joseph Julian Soria), a crooked cop (Owen Harn), a Mexican cartel and, farther afield, the Taliban. The baddies naturally include a couple of Rottweilers, and there's some impressive dog-on-dog action as Max assists de-facto detectives Justin, Carmen and her cousin Chuy (Dejon LaQuake) - without having to partake in their \"comic\" exchanges. Animal coordinator Mark Forbes has drawn commendable performances from the dogs, and the stunt sequences, both canine and human, are staged effectively and are shot well by Stefan Czapsky. But they never really matter. And the teens' hangout, a DIY bike park in the woods that's a nice element of Kalina Ivanov's production design, isn't quite enough to explain Justin's daring two-wheeled maneuvers. Though the lead performance would do Lassie and Rin Tin Tin proud, Max's increasingly ludicrous, cliche-packed plot generates not an ounce of suspense. Production company: Sunswept Entertainment Cast: Josh Wiggins, Lauren Graham, Thomas Haden Church, Luke Kleintank, Robbie Amell, Mia Xitlali, Dejon LaQuake, Jay Hernandez, Owen Harn, Joseph Julian Soria Director: Boaz Yakin Screenwriters: Boaz Yakin, Sheldon Lettich Producers: Karen Rosenfelt, Ken Blancato Executive producers: Ben Ormand, Boaz Yakin Director of photography: Stefan Czapsky Production designer: Kalina Ivanov Costume designer: Ellen Lutter Editor: Bill Pankow Composer: Trevor Rabin Animal coordinator: Mark Forbes <mark>Paul Rudd</mark> and Marvel's Kevin Feige Reveal \"Ant-Man's' Saga, from Director Shuffle to Screenplay Surgery to Studio's\" Phase Three \"Plans Murdoch Sons' First Challenges: Fix Fox and Win Over Wall Street Robert Downey Jr. and Secret Screen-Tests: How the New\" Spider-Man' Team Was Chosen HBO's Real-Life Game of Thrones: The Fight to Stay Rich, on Top and Score Bill Simmons Taraji P. Henson, Viola Davis and Drama Actress A-List Tackle Race, Sexism, Aging in Hollywood Lena Dunham, Amy Schumer and Comedy Actress A-List in Raunchy, R-Rated Roundtable The Cast of Kids on Sex, Death, and the NC-17 Movie's 20th Anniversary White House Is Lit Up Like a Rainbow to Celebrate Marriage Equality <mark>Chris Brown</mark> Is Releasing New Album in Fall - Listen to New Song \"Liquor' Here!", "articleID": "2015062718_00010818_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "Paul Rudd": ["Q276525", "Q7153351"]}}, {"date": "2015-06-27", "url": "http://www.comingsoon.net/movies/news/453915-robert-zemeckis-the-walk-to-open-one-week-early-in-imax-3d?utm_source=rss&utm_medium=rss&utm_campaign=robert-zemeckis-the-walk-to-open-one-week-early-in-imax-3d", "content": "Audiences at IMAX 3D and other select theaters will have the chance to be the first to experience The Walk, the new motion picture event from Academy Award winner Robert Zemeckis, when it is released exclusively in those theaters on Wednesday, September 30. The film, which has also been chosen as the opening night selection of the New York Film Festival, will then enter wide release on October 9. Twelve men have walked on the moon. Only one man has ever, or will ever, go where The Walk will take moviegoers. In the film, the director behind Forrest Gump, Cast Away, Back to the Future and Flight, once again uses cutting edge technology in the service of what is targeted to be an emotional, character-driven story. Said to offer innovative photorealistic techniques and IMAX 3D wizardry, The Walk aims to give moviegoers a chance to viscerally experience the feeling of reaching the clouds. A love letter to Paris and New York City in the 1970s and to the Towers of the World Trade Center, The Walk is rated PG, targeting audience members of all ages. The film offers the true story of a young dreamer, <mark>Philippe Petit</mark>, and a band of unlikely recruits who together achieve the impossible: an illegal wire walk in the immense void between the World Trade Center towers. With little more than nerve and blind ambition, <mark>Petit</mark> and his ragtag crew overcome daunting physical obstacles, betrayals, countless close calls and overwhelming odds to beat the system and execute their mad plan. \"We're excited to be part of Sony's exclusive release for\" The Walk,' which was designed for and makes brilliant use of IMAX 3D, \"said <mark>Greg Foster</mark>, Senior Executive Vice President of IMAX Corp. and CEO of IMAX Entertainment,\" No one understands IMAX better than our longtime partner Bob Zemeckis - he is an artistic genius who uses all of his expertise to give audiences an edge-of-your-seat thrill that will make moviegoers feel like they are out on the tightrope themselves. We're excited that our audiences will have the chance to see it first. \"Featuring a screenplay by Robert Zemeckis & <mark>Christopher Browne</mark>, The Walk is based on the book\" To Reach the Clouds \"by <mark>Philippe Petit</mark>, and is produced by Zemeckis, Steve Starkey and Jack Rapke. Joseph Gordon-Levitt, Ben Kingsley, James Badge Dale, Ben Schwartz, Charlotte Le Bon, Clément Sibony and César Domboy star.", "articleID": "2015062718_00017618_W", "names": {"Christopher Browne": ["Q21084520", "Q5111995"]}}]