[{"articleID": "2018112212_00252048_W", "names": {"Matthew Hedges": ["Q57833991", "Q58987432"], "Jeremy Hunt": ["Q333533", "Q929730"], "Theresa May": ["Q264766", "Q30161835"]}, "date": "2018-11-22", "url": "http://nwemail.co.uk/news/national/17240706.uk-putting-uae-relations-above-jailed-academics-freedom-wife-says/", "content": "<mark>Matthew Hedges</mark> with his wife Daniela Tejada 0 comments The wife of a British academic jailed for life in the United Arab Emirates on an allegation of spying has accused the UK Government of putting relations with the Gulf state before her husband. Daniela Tejada condemned the Foreign Office over the handling of the case of 31-year-old PhD student <mark>Matthew Hedges</mark>, ahead of her meeting with Foreign Secretary <mark>Jeremy Hunt</mark> on Thursday. Mr <mark>Hunt</mark> has threatened the UAE with \"serious diplomatic consequences\" if Mr <mark>Hedges</mark> is not freed, saying he has seen \"absolutely no evidence\" to support the charge. The Cabinet minister is understood to have met with the UAE ambassador in London on Thursday morning and had a \"very frank\" conversation with him. But Ms Tejada, having landed back at Heathrow Airport, said the UK had \"failed\" to take a firm stance over the Durham University student from the start of his ordeal. \"I was under the impression they were putting their interests with the UAE above a British citizen's rightful freedom and his welfare,\" she told BBC Radio 4's Today programme. \"They were stepping on eggshells instead of taking a firm stance.\" Health Secretary Matt Hancock defended the Foreign Office on the show for working \"behind the scenes\" to support Mr <mark>Hedges</mark>, with Mr <mark>Hunt</mark> appealing personally to the Crown Prince on November 12. Ms Tejeda, who was at the Abu Dhabi court when Mr <mark>Hedges</mark> was sentenced during a five-minute hearing on Wednesday, is expected to quiz Mr <mark>Hunt</mark> over what efforts the Government will make to secure Mr <mark>Hedges</mark>'s release. She has made it clear she believes the UK should stop at nothing to free the \"innocent\" Briton, who was jailed after the UAE presented \"completely fabricated\" evidence. Her calls for immediate action were echoed by Tory MP Johnny Mercer, who condemned the academic's jailing and called for the Government to be resilient. He wrote on Twitter: \"This is ridiculous. Our Defence assistance, mentoring and intelligence relationships alone with this country should preclude absurd things like this happening. From a friend and partner, simply unacceptable.\" Consequences must be immediate until he is released. \"This is ridiculous. Our Defence assistance, mentoring and intelligence relationships alone with this country should preclude absurd things like this happening. From a friend and partner, simply unacceptable. Consequences must be immediate until he is released. Resilience required pic.twitter.com/ouvxfjJIBH--Johnny Mercer MP (@ JohnnyMercerUK) November 21, 2018 Mr <mark>Hunt</mark> said the UK\" will do everything we can to get him home \"over the charges he has seen\" absolutely no evidence for \". He told Sky News:\" The UAE is supposed to be a friend and ally of Britain's. We've given them repeated assurances about <mark>Matthew</mark>. \"If we can't resolve this there are going to be serious diplomatic consequences, because this is totally unacceptable.\" Mr <mark>Hedges</mark>, a Middle Eastern studies specialist, was arrested at Dubai Airport on <mark>May</mark> 5. A family representative said he had since been held in solitary confinement for more than five-and-a - half months, during which his \"mental and physical health seriously deteriorated\" . <mark>Matthew Hedges</mark> with his wife Daniela Tejada (Daniela Tejada/PA) Lawyer and human rights campaigner David Haigh said he was encouraged by Mr <mark>Hunt</mark>'s public stance, but warned that securing Mr <mark>Hedges</mark>'s release quickly was important. He told the BBC's World Tonight: \"It's urgent. I know what he will be going through. He'll be in some form of national security jail and it's horrific there.\" Mr Haigh, a former managing director of Leeds United, said he was tortured and raped while he was held in a Dubai jail over a fraud conviction that was later overturned. David Haigh (Martin Rickett/PA) <mark>Theresa May</mark> said she was \"deeply disappointed and concerned\" by Mr <mark>Hedges</mark>'s jailing and told MPs the UK \"will continue to press this matter at the highest level with the Emiratis\" . Professor Stuart Corbridge, vice-chancellor of Durham University, said there is \"no reason to believe that Matt was conducting anything other than legitimate academic research\" . A Foreign Office spokesman did not say what form any possible diplomatic consequences could take, but said a number of options are available. Mr <mark>Hedges</mark> has 30 days to challenge the court ruling. 0 comments"}, {"articleID": "2015091614_00141473_W", "names": {"Scott Dann": ["Q16214802", "Q448074"], "Steve Parish": ["Q23301488", "Q7613543"]}, "date": "2015-09-16", "url": "http://clubcall.com/crystal-palace/dann-deal-thanks-to-cabaye-1781884.html", "content": "<mark>Scott Dann</mark> decided to pen a new deal with Crystal Palace as soon as the Eagles snapped up Yohan Cabaye from Paris Saint-Germain. Palace pulled off something of a coup when luring the France international to Selhurst Park in a deal worth & pound; 11million, and co-chairman <mark>Steve Parish</mark> says it was important the club made a statement of intent. Cabaye did not come cheap but <mark>Parish</mark> says he is worth it after <mark>Dann</mark> snubbed the likes of Everton to sign a new deal. \"Nothing about the Cabaye deal is a bargain. We paid full whack to the club, full whack to the player,\" he told the Guardian. \"But sometimes you just have to pay to take you to another level.\" There was no question about Yohan's pedigree, but it was also what it said about the club. The statement it made. \"<mark>Scott Dann</mark> was courted by other clubs this summer but, when we signed Yohan, he said to me:\" The clubs I'm being linked with aren't signing players of that calibre. They're not showing that ambition. Why would I go anywhere else?' \""}, {"articleID": "2013061211_00034921_W", "names": {"Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}, "date": "2013-06-12", "url": "http://www.timesfreepress.com/news/2013/jun/12/stephen-king-john-mellencamp-break-rules-ghost-bro/", "content": "<mark>Stephen King</mark>, T Bone Burnett and John Mellencamp, from left, collaborated on the musical \"Ghost Brothers of Darkland County.\" <mark>Stephen King</mark> and John Mellencamp had a simple problem when they started the long odyssey to create a musical. \"Quite frankly, we didn't know what the hell we were doing,\" Mellencamp says. Thirteen years later they've created \"Ghost Brothers of Darkland County,\" a musical that's not quite like anything out there - as you might expect from two of America's most independent artists. Along the way, the author and the singer picked up producer T Bone Burnett to serve as a general contractor, enlisted stars like Sheryl Crow, Elvis Costello, Kris Kristofferson and Rosanne Cash, and broke several rules in the classic musical theater handbook. <mark>King</mark> says he might have given up long ago had Mellencamp not kept rolling things forward. Mellencamp says that's a bunch of bull. Now that they're done - \"Ghost Brothers\" now out with a CD box set, mini-documentary and e-book, with a theatrical tour starting in October in Bloomington, Ind. - they say the project strengthened their friendship and left them with a tremendous sense of accomplishment. \"This morning when I went over to my office there was a big stack of the box sets and I looked at that thing and said,\" We actually have a product here,' \"<mark>King</mark> says.\" It's all been give up to this point. You give of your talent and you give of your time, and then you get something back. It's here and people are either going to play these tunes or not, buy and download or not, go to see the show when it comes to a town near them or not. \"The musical started with a real-life ghost story. Mellencamp was looking for a cabin on Lake Monroe in his home state of Indiana. As the owners handed over the keys, they casually let it drop that the cabin might be haunted, the spiritual remnants of a terrible tragedy that had happened decades earlier when two brothers quarreled over a girl. The story came with a stack of ancient pulp magazines that detailed the deaths in grisly detail, complete with photos of a headless body and plenty of purple prose. Mellencamp scoffed, had the cabin remodeled and took his family to the lake for a long visit. They noticed the\" weird vibe \"immediately.\" I don't believe in this stuff, \"Mellencamp says,\" but stuff would start moving. You'd start smelling cigars. Funny smells would appear and stuff would turn on and turn off. It was kinda creepy, you know? \"Mellencamp unloaded the cabin and eventually relayed the story to his agent sometime before the turn of the century. He'd recently been approached about doing a musical based on his hits, but he wasn't interested. The agent suggested the ghost story could serve as the basis for that musical, and suggested they contact mutual client <mark>King</mark> to help write it. <mark>King</mark> and Mellencamp had met a few times over the years, and to Mellencamp's surprise the idea quickly took root. It was just the kind of challenge <mark>King</mark> likes.\" Once you get to a certain age - I'm in my 60s now - you've got to try to keep expanding your field, \"<mark>King</mark> says.\" You've got to try new things and if you don't, you tend to get conservative. I always say you dig yourself a rut and then you furnish it. \"John asked me when we started this if I'd ever done anything like this before. I says,\" John, yes, I have. I wrote a play for my Boy Scout troop when I was 11 years old. And it was a big hit with my relatives .' \"They traveled to New York together where they took in several musicals on Broadway. And almost nothing appealed to them.\" It was like, how does this work? \"Mellencamp says.\" What we saw on these musicals, at least to me, was a bunch of s--we didn't want to do. OK, we don't want any dancing, that's the first thing. We just don't. We don't want this, we don't want that. We don't want to advance the story forward with song, it's too corny. \"They decided they'd use their songs to color their characters. The spoken-word sections of the musical would drive the story, just as they do in a play.\" I just feasted on that because I'm a big rock music fan and country music fan and alt-rock fan and all that stuff, and I thought, that's what music does, \"<mark>King</mark> says.\" Music speaks to the heart and words speak to the brain, and we can really do something here. We saw eye to eye on a lot of things and one was we didn't really want this big orchestral, violin-heavy music. We wanted a kind of American soundtrack. \"<mark>King</mark> roughed out the story about two generations of brothers in fictional Lake Belle Reve, Miss., caught in a tragic tape loop and marked out spaces for songs, sometimes including a little rhyme to give Mellencamp cues. Mellencamp then worked up songs from several perspectives. That's where Burnett, the only producer Mellencamp's ever had, enters the picture about five years ago. Mellencamp played him the songs and, always up for a challenge, Burnett signed on.\" It's a very interesting group of tunes he's put together and I do believe some of his best songs, \"Burnett says.\" Time will be the judge of that but it seems so to me. They're real powerful tunes, and real stripped down, of-the-earth type tunes ....John and <mark>Stephen</mark> work a lot of the same turf, the legends of small-town America, that stuff. So I can see the resonance between the two of them pretty clearly. \"Burnett brought in friends and colleagues to hang Spanish moss from tree limbs, add humidity to the air and bring the characters to life. Actors like Matthew McConaughey and Meg Ryan helped with the spoken-word parts. Crow sings from the perspective of the coveted woman at the center of the story. Kristofferson provides a moral compass. And Costello had a great time taking it fire and brimstone.\" I had to be the Devil in that story so I made some very extraordinary sounds, \"he says.\" I mean I was creaking. I sounded like my teeth were about to fall out. I thought the Devil, that can't be an ordinary voice. So I sang in harmonic shrieks and whispering and everything. \"The thing that Mellencamp loves about the final product is you can't pigeonhole it. All the principles will be replaced by other actors and musicians when the musical hits the road around the country later this year. The ultimate goal is to debut\" Ghost Brothers \"on Broadway, but producers have been leery of that unconventional structure. No matter. Ethics policy - Copyright? 2013, Chattanooga Publishing Company, Inc.. All rights reserved."}, {"articleID": "2009101402_00087770_W", "names": {"Kevin Kennedy": ["Q5999672", "Q6396679"]}, "date": "2009-10-14", "url": "http://dailybreeze.com/news/ci_13554274?source=rss", "content": "just two weeks after gardena high school found itself on a list of 12 troubled los angeles unified campuses that could be taken over by outside operators, its principal has quit, citing a lack of unity on campus. <mark>kevin kennedy</mark>, who has been at the school less than two years, announced friday he was taking an administrative position with local district 8, which oversees schools from gardena to san pedro. district officials said the change was motivated by the need for help in the local district office, which saw half of its staff cut under budget reductions earlier this year. kennedy wrote in a memo sent to staff friday that he made the announcement with a \"heavy heart.\" \"the school faces tremendous challenges in the coming months,\" wrote kennedy, 61. \"to succeed in meeting those challenges, a united gardena is essential. the division among us is a distraction and collaborative team work is the first element for a united gardena.\" kennedy's replacement is rudy mendoza, 46, a carson resident and an alumnus and former assistant principal of banning high in wilmington. local district 8 superintendent linda del cueto cited mendoza's \"collaborative style\" in a letter announcing the selection. the change comes to gardena high as the sprawling, nearly 3,200-student campus - among the lowest achieving secondary schools in the south bay - enters a process that could see it turned over to operation by a charter organization, gardena, along with san pedro high and 10 other lausd campuses, was placed last month on a list of \"focus schools\" that are the first batch to be subject to the public school choice plan approved by the board of education in august. under the plan, underperforming and newly constructed campuses will be up for bids from operators both inside and outside the school district. students at gardena high were expected to stage a silent protest today demonstrating their opposition to being turned into a charter, district officials said. the timing of the leadership change has some teachers worried about bringing in a new principal, even though kennedy was reportedly unpopular among some staff. \"(mendoza) has never been a principal before. this isn't to say he can't do the job, but we have a school that has literally been thrown to the dogs by district administration,\" said teacher saul lankster, referring to the school's inclusion on the \"focus schools\" list. lankster is a history teacher and chair of the gardena high chapter of united teachers los angeles, which he said is drafting a plan that would recreate the campus as a district-affiliated charter school. mendoza, who started monday, could not be reached for comment. local district officials said mendoza's experience at \"tough schools\" made him well-prepared to guide gardena through the public school choice process. the campus this year also faces a high-stakes visit by a regional academic accreditation group and the implementation of \"small learning communities,\" a districtwide program that divides high school students into themed groups. those challenges come after kennedy's tenure marked a change for gardena high, which has a predominately latino and african-american student body. after serving as an assistant principal at narbonne high, kennedy was appointed to the top job at gardena in january 2008. because of health issues, he was unable to take his position until september 2008. his tenure coincided with an edict from lausd headquarters to reduce the number of suspensions of students, district officials said. when kennedy took the job, gardena had the highest number of suspensions in the district, said local district high school director juan flecha. that had been the legacy of gardena's previous principal, russ thompson, who \"ran a tight, tight ship\" as a way to address race-based violence on campus, flecha said. thompson was promoted to an administrative position at a local district office, a fact that irritated lankster, who said he would \"follow thompson into battle.\" under kennedy, the number of suspensions dropped significantly, flecha said. \"that's been interpreted as,\" oh wow, the discipline has gone south under his reign, \"' he said. kennedy also emphasized addressing behavioral problems in the classroom, rather than kicking kids out for acting up, flecha said, adding that the policy could have caused tension with teachers. lankster characterized the changes this way:\" all hell broke loose. there was no order on this campus. there hasn't been any discipline since mr. kennedy came. \""}, {"articleID": "2009121418_00183145_W", "names": {"John Watson": ["Q14951425", "Q16956511", "Q171422", "Q18129156", "Q18385565", "Q18764164", "Q43915369", "Q55412018", "Q57157767", "Q6263210", "Q6263212", "Q6263215", "Q6263223", "Q6263231"]}, "date": "2009-12-14", "url": "http://brentwoodweeklynews.co.uk/uk_national_entertainment/4793759.I_love_Sherlock__says_Jude_Law/?ref=rss", "content": "i love sherlock, says jude law (from brentwood weekly news) jude law, who stars as a sexy version of sherlock holmes's ally dr <mark>john watson</mark>, has described his co-star robert downey jr as \"the only person i'm in love with\" . the two actors have been described as having a powerful chemistry in guy ritchie's latest movie sherlock holmes, in which downey jr plays the title role. at a press conference ahead of the movie's world premiere on monday night, jude, who has been the subject of speculation that he has been growing closer to his ex-girlfriend sienna miller, was asked about romance and being in love. but jude, who was sitting to the right of downey jr, told reporters jokingly: \"the only person i'm in love with at the moment is sitting on my left.\" downey jr has described himself and jude as being \"very much on the same page, which is a pretty eccentric page\" . director ritchie told how he saw <mark>watson</mark> as being an attractive character. he said: \"i wanted a good looking <mark>watson</mark> and (the media) coined it\" hotson'. i always saw their relationship as much more of an equal partnership. \"jude told how it was not the first time he had appeared on the screen in a version of sherlock holmes - telling reporters:\" i played a stable boy. \"the actor appeared in the tv series which starred jeremy brett as holmes. search for hundreds of jobs in essex and beyond dating bring love into your life! find a date in essex homes for sale, and to let, in essex"}, {"articleID": "2018060719_00039772_W", "names": {"William Wright": ["Q17018282", "Q1724921", "Q19043849", "Q21006566", "Q28945688", "Q56598355", "Q8020587"]}, "date": "2018-06-07", "url": "http://www.myrecordjournal.com/News/Wallingford/Wallingford-News/Wallingford-police-remind-residents-to-lock-cars-after-recent-rise-in-car-break-ins.html", "content": "Wallingford police remind residents to lock cars after uptick in car burglaries, thefts Wallingford police remind residents to lock cars after uptick in car burglaries, thefts Wallingford police remind residents to lock cars after uptick in car burglaries, thefts The Wallingford Police Department, Thursday, Nov. 16, 2017. | Dave Zajac, Record-Journal Advertisement The Wallingford Police Department, Thursday, Nov. 16, 2017. | Dave Zajac, Record-Journal June 07, 2018 03:06 PM By Matthew Zabierek, Record-Journal staff WALLINGFORD--Police are reminding residents to lock their vehicles in response to a recent uptick in car break-ins and thefts. Police said in a press release they are \"continuing to investigate numerous thefts from motor vehicles and stolen motor vehicles,\" and asked residents \"to secure all valuables and lock their vehicles.\" Burglars usually commit the crimes at night and target unlocked cars, police said. \"The crime is often being committed by groups of individuals, many of them juveniles, who come into our neighborhoods and steal from vehicles that are left unlocked,\" the press release said. \"They typically do not force entry into locked vehicles, however, we are cautioning people to remove valuables from their vehicles.\" While car burglaries are something police continue to deal with, there has been a recent uptick in incidents, Police Chief <mark>William Wright</mark> said. \"There has been an increase,\" <mark>Wright</mark> said in an interview. \"I couldn't tell you with any great certainty by how much, but there has been an increase.\" <mark>Wright</mark> couldn't say whether break-ins occur more often in the summer months, but said \"it's not unreasonable to think that.\" <mark>Wright</mark> said investigating vehicle break-ins is difficult, but said the department has solved \"many cases, either through forensic evidence or work that other agencies have done.\" \"The Wallingford Police Department does initiate special enforcement to try to deter this activity,\" the release said, \"and have made several arrests, however, we need the assistance of our residents to put an end to this activity.\" <mark>Wright</mark> said many local communities are also dealing with car break-ins, and said in some other communities, burglars have used a garage-door opener left in an unlocked car to gain access to homes. Police are also asking residents to lock their vehicles to \"lock your vehicles at all times to prevent children from gaining access and getting locked inside vehicles during the hot summer months.\" mzabierek @ record-journal.com"}, {"articleID": "2009011214_00048305_W", "names": {"Fabian Walter": ["Q53952738", "Q57929754"]}, "date": "2009-01-12", "url": "http://blueollie.wordpress.com/2009/01/12/12-january-2009-new-years-resolution/", "content": "workout notes 4000 yard swim followed by a 3 mile (plus) walk. swim: 500 (slow), 10 x (25 front, 25 free) fins, 5 x 100 (25 sfs, 75 free) 2:05, 5 x 100 (25 3g, 75 free), 5 x 100 fist (on 2), 10 x 50 (on 1), 5 x (25 fly, 75 free), alt 50 paddle / 50 free. the swim pretty much sucked. walk 24 laps: 38:03 (12:50, 12:36, 12:35); was ok. resolution: it is cold, more snow is on the way and the temperature is due to \"drop like a rock\" . result: depression. so, what can i do about it, given that jobs are hard to come by and that i have one? well, i am going to strive to look for the opportunity in every situation rather than for what is bad. example: today, i thought \"damn, i am stuck in this dinky stupid little pool.\" instead: \"hey someone who swam the big shoulders in 1:14 trained here (22 minutes faster than i).\" you have enough here to succeed if you have the right attitude. \"example:\" damn, this gym is full of old, pregnant men. \"instead:\" hey at least that isn't you...yet. that scale did show 4 pound up, didn't it...not all of it is water weight. \"so, after this post, i am on my way to the office to get some research done. nyc educator tells the story: teachers, denied parking permits, park on the street - legally. school day starts. city crews show up, post brand new\" no parking signs. \"cops show up. cops ticket teachers' cars. $150 to park for the day. i guess that stupidity and callousness is universal and not just limited to the wasteland that i currently inhabit. science it appears that the black holes at the center of galaxies\" came first \"(though both the black holes and the galaxies co-evolved. reposted from: long beach, calif. - astronomers may have solved a cosmic chicken-and-the-egg problem: which came first - galaxies or the supermassive black holes in their cores? for several years now, researchers have known that galaxies and black holes must have co-evolved, with budding galaxies feeding material to a growing black hole while the immense gravity of the black hole generated in its vicinity tremendous radiation that in turn powered star formation. but the scientists hadn't pegged the starting point.\" it looks like black holes came first. the evidence is piling up, \"said chris carilli of the national radio astronomy observatory in new mexico. carilli presented his team's findings here today at the 213th meeting of the american astronomical society. previous studies of nearby galaxies revealed an intriguing link between the masses of the black holes at their centers and the mass of the central\" bulge \"(a mass of tightly packed stars and gas) in the galaxies: the black hole's mass is always about one one-thousandth the mass of the surrounding bulge. the ratio is the same for galaxies of all ages and sizes, whether the central black hole is a few million or many billions of times the mass of our sun.\" this constant ratio indicates that the black hole and the bulge affect each others' growth in some sort of interactive relationship, \"said study team member dominik riechers of caltech.\" the big question has been whether one grows before the other or if they grow together, maintaining their mass ratio throughout the entire process. \"to help answer this question, carilli, riechers and the rest of their team used the very large array radio telescope in new mexico and the plateau de bure interferometer in france to peer back to near the beginning of the universe, thought to be 13.7 billion years ago, when the first galaxies were forming.\" we finally have been able to measure black-hole and bulge masses in several galaxies seen as they were in the first billion years after the big bang, and the evidence suggests that the constant ratio seen nearby may not hold in the early universe, \"said study team member <mark>fabian walter</mark> of the max-planck institute for radioastronomy in germany.\" the black holes in these young galaxies are much more massive compared to the bulges than those seen in the nearby universe. \"[...] this should be the year when we make a concerted effort to wipe out superstitious and irrational beliefs of all kinds. this category includes not only religious beliefs but also absurd and divisive and harmful ideas such as that the people who share one's own nationality and ethnicity are somehow better than those who don't, and thus deserve greater allegiance and consideration. familiarity breeds false rationality. for many people, irrational beliefs are what other people hold, not their own. their own irrational beliefs seem reasonable because they acquired them at a very young age when they tended to believe what the adults in their lives told them and they have rarely been asked why they believe. the power of myths is that it never even occurs to people to question the validity of ideas that they have always had and which everyone around them seems to share. . as i wrote earlier, in his book the god delusion (p. 178), richard dawkins quotes the anthropologist pascal boyer who once over dinner at a cambridge university college recounted the beliefs of the fang people of cameroon who believed that\" witches have an extra internal animal-like organ that flies away at night and ruins other people's crops or poisons their blood. it is also said that these witches sometimes assemble for huge banquets, where they will devour their victims and plan future attacks. many will tell you that a friend of a friend actually saw witches flying over the village at night, sitting on a banana leaf and throwing magical darts at various unsuspecting victims. \"bayer says he was dumbfounded when a cambridge theologian turned to him and said\" this is what makes anthropology so fascinating and so difficult too. you have to explain how people can believe such nonsense. \"(italics on original) dawkins points out that the theologian, as a mainstream christian, did not see any irony at all in referring to the fang people's beliefs as nonsense even while he himself believed many or all of the following beliefs: * in the time of the ancestors, a man was born to a virgin mother with no biological father being involved. * the same fatherless man called out to a friend called lazarus, who had been dead long enough to stink, and lazarus came back to life. * the fatherless man himself came alive after being dead and buried three days. * forty days later, the fatherless man went to the top of a hill and then disappeared bodily in to the sky. * if you murmur thoughts privately in your head, the fatherless man, and his\" father' (who is also himself) will hear your thoughts and may act upon them. he is simultaneously able to hear the thoughts of everybody else in the world. * if you do something bad, or something good, the same fatherless man sees all, even if nobody else does. you may be rewarded or punished accordingly, including after your death. * the fatherless man's virgin mother never died but \"ascended' bodily into heaven. * bread and wine, if blessed by a priest (who must have testicles),\" become' the body and blood of the fatherless man. similar nonsense is believed by muslims, hindus, jews, mormons, scientologists, all of whom think that the beliefs held by people of other religions are not only wrong but even absurd, despite the fact that there is no difference at all in the evidentiary basis for all of them. all of them have exactly zero credible evidence in support and whose only basis for belief is that they are found in ancient texts of dubious authenticity. i should point out that i attended a unitarian universalist church where such christian beliefs were laughed at. instead we were supposed to respect other forms of nonsense, so long as it was the non-standard, non-traditional nonsense. dismissing stuff such as healing crystals, \"wymen's way of knowing\" , godesses, dousing, etc. was a sign of being \"close minded\" . possibly related posts: (automatically generated) notify me of followup comments via email \"previous | about blueollie this is my online diary. i use this blog for the following purposes: to keep track of my training. i train for ultramarathons (i usually walk these) and sometimes do running races, bicycle rides and open water swims for variety. my best ultra accomplishment was walking 101 miles in 24 hours in 2004. there was a time when i could run a sub 40 minute 10k (did that once), but that was another lifetime ago; these a days 24 minutes for a 5k would be more like it. i also have an off and on interest in yoga. from time to time, i post what i am thinking about mathematically i often post links to science articles, especially articles about cosmology and evolution. i am very sympathetic to the\" new atheist \"movement, though some might consider me to be an agnostic. i reject any notion of a deity that interferes with physical events, but remain agnostic to the idea that there might be something\" grand and wonderful \"(dawkins' phrase) outside of our current spacetime continuum. i am a liberal democrat who thinks that the current social atmosphere is tilted way too far toward the interests of big business, and i reject the idea that a\" free market \"cures all ills, though pure socialism doesn't work either. i am also a believer in the freedom of speech, including speech that i might not like. also, i've been involved (to a moderate degree) with political campaigns, ranging from city council races up to presidential races. i back barack obama enthusiastically. as far as john mccain: i admire his courage and military service but he simply doesn't have the ability to grasp the nuances of world affairs; he simply isn't up to the job. since being targeted by neo-nazis, i've started to identify with the anti-racist and the anti-fa movements. i like to post photos of trips and vacations. ollie is a reality-based intellectualist, also known as the liberal elite. you are a proud member of what's known as the reality-based community, where science, reason, and non-jesus-based thought reign supreme. barbara is a peace patroller, also known as an anti-war liberal or neo-hippie. she believes in putting an end to american imperial conquest, stopping wars that have already been lost, and supporting our troops by bringing them home. steelers vs. ravens touchdown controversy: replay officials get it right, announcers do n't"}, {"articleID": "2015011122_00039368_W", "names": {"Eric Wood": ["Q28756456", "Q3731545", "Q55452515", "Q58128614"], "Sammy Watkins": ["Q7409856", "Q7409857"], "Fred Jackson": ["Q1452376", "Q18601857", "Q3752634", "Q5495575"]}, "date": "2015-01-11", "url": "http://medicinehatnews.com/sports/national-sports/2015/01/11/rex-ryan-accepts-offer-to-coach-buffalo-bills-says-person-familiar-with-talks/", "content": "By John Wawrow, The Associated Press on January 11, 2015. BUFFALO, N.Y. - Rex Ryan is staying in the AFC East after reaching an agreement Sunday to coach the Buffalo Bills. A person familiar with the talks told The Associated Press the former New York Jets coach accepted the Bills' contract offer after two days of discussions. The person spoke on the condition of anonymity because the Bills have not discussed their search to replace Doug Marrone, who stepped down abruptly Dec. 31. The offer was made a day after the Bills identified Ryan as a finalist and met with him for a second time in South Florida, where new owners Terry and Kim Pegula live. Ryan was one of 12 candidates to interview for the job since last weekend. At the same time, a second person familiar with talks told the AP the Bills are negotiating to hire Greg Roman as offensive co-ordinator. Roman, a finalist for the Bills' coaching job, spent the past four years as the San Francisco 49ers' offensive co-ordinator. Roman's future is uncertain in San Francisco after coach Jim Harbaugh left to coach Michigan. This is the Bills' sixth coaching search since Wade Phillips was fired after the 2000 season and the first since the Pegulas bought the team from the estate of Hall of Fame owner Ralph Wilson in October. The Bills went 9-7 to match their best record in a decade, but missed the playoffs to extend the NFL's longest active drought to 15 seasons. Ryan is very familiar with the Bills after spending the past six seasons coaching the Jets, Buffalo's AFC East rival. He had a 50-52 record, including 4-2 in the playoffs, with the Jets before being fired along with general manager John Idzik following a 4-12 finish. Ryan's father, Buddy, also had ties to Buffalo after spending 1961-65 as an assistant coach at the University at Buffalo. Ryan's strength is defence, as it is with the Bills. Buffalo's defence finished fourth in the NFL in yards allowed last season and produced three Pro Bowl linemen. It's unclear how Ryan's arrival would affect the status of Buffalo's current defensive co-ordinator Jim Schwartz, who completed his first season with the Bills. Schwartz is the former Detroit Lions coach and was a candidate for the Bills' job. Ryan's challenge in Buffalo would be similar to the one he had in New York - providing a spark to a sputtering offence. The Jets finished 22nd in yardage last season - four spots ahead of Buffalo. Quarterbacks were concerns for both teams, involving two players drafted in 2013 draft. The Jets faltered behind second-year starter Geno Smith, who was eventually benched and replaced by Michael Vick. In Buffalo, second-year starter EJ Manuel was benched after four games and replaced by 10-year journeyman Kyle Orton, who has since said he plans to retire. Manuel has two years left on his contract and is the only experienced starter on the roster. Bills players were already expressing their support for Ryan in posts made on their Twitter accounts. \"Love the hire!\" centre <mark>Eric Wood</mark> tweeted. Rookie receiver, and former Clemson player, <mark>Sammy Watkins</mark> wrote, \"Can't wait, gotta love REX RYAN,\" and then linked a photo Ryan wearing a Clemson T-shirt and posing with several Tigers players. Running back <mark>Fred Jackson</mark> wrote: \"Excited about the hire of Rex!! Great coach to come in and keep us moving in the right direction!\" Roman is regarded as a good fit under Ryan, because the two share a similar run-first philosophy. Under Roman, the 49ers' running attack ranked among the NFL's top 10 in each of the past four seasons. National Advertising: 403.528.5766 Online Advertising: 403.528.5698"}, {"articleID": "2012013117_00098714_W", "names": {"Bill Stevenson": ["Q177111", "Q18808528", "Q23005315", "Q4911009"], "Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2012-01-31", "url": "http://blogs.westword.com/backbeat/2012/01/meshuggah_ogden_theatre_denver_may_11.php", "content": "? rejoice, metal heads! on friday, may 11, ogden theatre for a show in support of its forthcoming album, the eagerly anticipated follow-up to 2008's obzen, due out on nuclear blast on march 27. the swedish metal masterminds will be joined at the ogden by nicki minaj's \"stupid hoe\" takes aim at gaga and other fellow pop stars <mark>bill stevenson</mark> of descendents: \"maybe it's just all of our fans are paying us back for some good music we've given them\" win tickets to icelantic's winter on the rocks this friday! (20) win tickets and vip to see lotus at the fillmore on saturday (11) win tickets to see steve aoki this thursday at the fillmore (24) review: atmosphere and common at icelantic's winter on the rocks, 1/27/12 (6) <mark>chris brown</mark> does his best lmfao impression with \"turn up the music\" 6 deleted scenes from star trek movies that would've made them a little less confusing discover restaurants, nightlife, travel, shopping...get 50 to 90% off every day on restaurants, movies, massages...more than 10,000 of the best things to eat, drink, and experience join the village voice community and get exclusive deals and info your local happy hour guide at your fingertips social connect: use your favorite account to access my voice nation."}, {"articleID": "2010012011_00044574_W", "names": {"Iain Stewart": ["Q328953", "Q5980624", "Q5980633"]}, "date": "2010-01-20", "url": "http://primetime.unrealitytv.co.uk/last-night%e2%80%99s-tv-%e2%80%93-how-earth-made-us/", "content": "last night's tv - how earth made us january 20th, 2010 by lynn rowlands-connolly. tags: bbc, how earth made us, last night's tv, last night's tv reviews i have to say, geology is something that fascinates me; it always has. geology rocks as they say - \"they' being geology geeks primarily - and having the very personable and excitable <mark>iain stewart</mark> present this film was a very good plan. he came across as having an unashamed love of geology, and it was entirely infectious. as he roamed deep caverns and wedged himself into frighteningly small places to see what was in there, i was all bated breath and nerves, rather quickly followed by wonderment at what nature can do. but of course, as we've seen in haiti, nature and all its wonders can turn on us planet dwellers. gaia might be saying\" get off my land \"when she oversees the shifting of tectonic plates or issues forth blistering heat from subterranean fissures. however, events in haiti made this programme infinitely more topical than it might otherwise have been, which may well have attracted more viewers, and that can be no bad thing because it was very much worth watching. we saw <mark>iain</mark> in various locations across the world, trying to explain why it is that humanity seems\" drawn \"to fault lines, fissures and other holes in the earth. in mexico, he bravely went into what is arguably the world's most inhospitable and least welcoming cave system. he had to wear a cooling suit and carry an oxygen tank, for despite the beauty to be found in those caves, he would've died in minutes without that kit. much reference was made to the minoans of crete and their early influence on what geology has become. we also saw that in their spare time, they liked nothing more than a spot of bull-vaulting. as you do. there was one rather amusing moment for me when <mark>iain</mark> asked,\" how do you practise that? \"he looked so sincerely interested in how one might learn to use a bull's horns as a kind of springboard; it was both charming and amusing. and actually, the element of self-deprecation was part of <mark>iain</mark>'s charm as a presenter. he takes his subject very seriously of course but isn't above having a laugh at it, and himself, too. and that he's brave isn't an issue now that i've seen him clambering into the caves mentioned above and into abandoned mines and some seriously scary potholes. but his reward is in the flora that resides often miles beneath or into the earth's crust. beautiful arrangements of crystals and various growths of mineral deposits provided some awesome sights. if you missed this show, you can see it on bbc's iplayer here, and it's true...geology rocks. leave a reply click here to cancel reply. name (required) mail (will not be published) (required) website notify me of followup comments via e-mail"}]