[{"date": "2015-06-27", "url": "http://www.comingsoon.net/movies/news/453915-robert-zemeckis-the-walk-to-open-one-week-early-in-imax-3d?utm_source=rss&utm_medium=rss&utm_campaign=robert-zemeckis-the-walk-to-open-one-week-early-in-imax-3d", "content": "Audiences at IMAX 3D and other select theaters will have the chance to be the first to experience The Walk, the new motion picture event from Academy Award winner Robert Zemeckis, when it is released exclusively in those theaters on Wednesday, September 30. The film, which has also been chosen as the opening night selection of the New York Film Festival, will then enter wide release on October 9. Twelve men have walked on the moon. Only one man has ever, or will ever, go where The Walk will take moviegoers. In the film, the director behind Forrest Gump, Cast Away, Back to the Future and Flight, once again uses cutting edge technology in the service of what is targeted to be an emotional, character-driven story. Said to offer innovative photorealistic techniques and IMAX 3D wizardry, The Walk aims to give moviegoers a chance to viscerally experience the feeling of reaching the clouds. A love letter to Paris and New York City in the 1970s and to the Towers of the World Trade Center, The Walk is rated PG, targeting audience members of all ages. The film offers the true story of a young dreamer, <mark>Philippe Petit</mark>, and a band of unlikely recruits who together achieve the impossible: an illegal wire walk in the immense void between the World Trade Center towers. With little more than nerve and blind ambition, <mark>Petit</mark> and his ragtag crew overcome daunting physical obstacles, betrayals, countless close calls and overwhelming odds to beat the system and execute their mad plan. \"We're excited to be part of Sony's exclusive release for\" The Walk,' which was designed for and makes brilliant use of IMAX 3D, \"said <mark>Greg Foster</mark>, Senior Executive Vice President of IMAX Corp. and CEO of IMAX Entertainment,\" No one understands IMAX better than our longtime partner Bob Zemeckis - he is an artistic genius who uses all of his expertise to give audiences an edge-of-your-seat thrill that will make moviegoers feel like they are out on the tightrope themselves. We're excited that our audiences will have the chance to see it first. \"Featuring a screenplay by Robert Zemeckis & <mark>Christopher Browne</mark>, The Walk is based on the book\" To Reach the Clouds \"by <mark>Philippe Petit</mark>, and is produced by Zemeckis, Steve Starkey and Jack Rapke. Joseph Gordon-Levitt, Ben Kingsley, James Badge Dale, Ben Schwartz, Charlotte Le Bon, Clément Sibony and César Domboy star.", "articleID": "2015062718_00017618_W", "names": {"Greg Foster": ["Q2355201", "Q448013"], "Philippe Petit": ["Q15971636", "Q3380529", "Q705289"]}}, {"date": "2015-06-26", "url": "http://www.pakistantoday.com.pk/2015/06/26/national/atc-reserves-verdict-on-amir-khans-bail-plea/", "content": "An anti-terrorism court (ATC) on Friday reserved its verdict on the bail plea of MQM leader <mark>Amir Khan</mark>, who is under custody on judicial remand, till the 25 of June according to reports. The court reserved its verdict, claiming to announce on Monday, June 29. The defence lawyers had contended before the court that none of the accused arrested from the MQM headquarters, nine-zero stated during investigation that <mark>Amir Khan</mark> directed them to carry out any terrorist activity. On June 3, the MQM leader was charged for harbouring criminals and providing them protection. Muslim pilot appointed guardian of orphaned Hindu children in India \"Dedicated to the legacy of the late Hameed Nizami\" Arif Nizami (Editor) 4-Shaarey Fatima Jinnah, Lahore", "articleID": "2015062809_00021704_W", "names": {"Amir Khan": ["Q19561000", "Q24005694", "Q469870", "Q59490906"]}}, {"date": "2015-06-26", "url": "http://www.thescore.com/news/786308", "content": "Less than 24 hours after the 2015 NBA Draft, rumblings of discord have arisen from New York. New York Knicks president of basketball operations <mark>Phil Jackson</mark> turned heads Thursday when he selected 7-foot-1, 230-pound Latvian center Kristaps Porzingis with the No. 4 pick. Knicks fans who attended the draft, held at Barclays Center in Brooklyn, were Carmelo Anthony to the list of dissatisfied individuals, according to Frank Isola of the New York Daily News. Carmelo, according to source, called Tim Hardaway Jr. late Thursday to express his displeasure with <mark>Phil Jackson</mark>'s draft night moves. Oh boy June 26, 2015 Since Porzingis is a relatively unknown commodity stateside, it's understandable that Melo and Knicks fans are confused. However, some experts questioned why Porzingis' skillset didn't garner him No. 1 consideration Jahlil Okafor off the board, the Knicks had the opportunity to draft a promising point guard in Willie Cauley-Stein. Perhaps any of those players would have appeased Anthony. Drama may be brewing in the Big Apple in the wake of the Porzingis pick, but <mark>Jackson</mark> is resolute in his decision. Speaking with ESPN's Chris Broussard, <mark>Jackson</mark> justified tabbing Porzingis as their new prized rookie. \"He's got the best upside that we had available to us. Has a great attitude, good family, working at the game,\" <mark>Jackson</mark> said. \"We understand that it might take a year, but he's willing to work and he's got the equipment to do it .\" The tension surrounding this move might come from the time it could take Porzingis to evolve into an impact player. <mark>Jackson</mark> intends to surround his rookies (the Knicks also traded for the draft rights to Notre Dame's Jerian Grant) with veterans in order to relieve them of overwhelming pressure in their first year. June 26, 2015 It seems Melo may not have the requisite patience, however.", "articleID": "2015062819_00011649_W", "names": {"Phil Jackson": ["Q16197662", "Q21464447", "Q2342953", "Q316246", "Q7182034"]}}, {"date": "2015-06-29", "url": "http://www.msn.com/en-gb/news/uknews/war-vets-call-for-end-to-16-year-old-recruits/ar-AAccq4e?srcref=rss", "content": "Three disturbing videos about the impact of war have been made by a veterans' charity to campaign against the recruitment of young teenagers to the armed forces. The advert-style films use Action Man figures to represent one soldier suffering from post-traumatic stress disorder (PTSD), another who has been paralysed and a third who is seen being buried. \"For PTSD Action Man, danger lies at every turn. He never feels safe...not even in his own home...,\" says the voice-over in the first of the videos by Veterans for Peace UK. Another states: \"Here lies paralysed Action Man...Legs really don't work!\" The campaign has been launched to coincide with Armed Forces Day to highlight what the charity says is the reality of military service rather than the glossy image portrayed in recruitment videos. \"We are trying to show the public that it's not all about marching bands and flypasts...that there is a dirty, ugly, painful reality to conflict,\" said co-ordinator <mark>Ben Griffin</mark>, who served in the SAS and the Parachute Regiment in Northern Ireland, Iraq and Afghanistan. \"If you join the army at 16 you are twice as likely to be killed as someone who joined at 18 and the reason for that is because the army is funnelling its youngest, least educated recruits into the infantry which is the most dangerous job in the army .\" If you were an infantry soldier in Afghanistan you are seven times more likely to be killed than if you weren't in the infantry. \"Teenagers can begin the application process to join up when they are only 15, ready to start their training on their next birthday. But the Ministry of Defence says anyone under 18 must have written consent from a parent or guardian and recruits will not be sent on any operations until they are an adult. A statement from the MOD said:\" We take pride in the fact that our Armed Forces provide challenging and constructive education, training, and employment opportunities for young people equipping them with valuable and transferable skills. \"In no way do the Armed Forces shy away from the challenges that may be faced in a military career .\" But Kieran Devlin, who was 16 when he began training, said he lost interest in school once he knew he was going to join up and ended leaving the army after serving in the First Gulf War and Northern Ireland without an education. \"They take an immature child like I was and within a 14-week period they turn them into somebody who will kill on command,\" he said. \"Really the only thing I took away from the army was an alcohol and violence problem that continued in my life and hit a pinnacle where I ended up in jail .\" The UK is the only state in Europe to recruit 16 year olds. Other countries include Iran and North Korea. Around one in six UK recruits was under 18 last year. But the former head of the army, General the Lord Dannatt, said young recruits can leave. \"A youngster who might be 15, filling in the application form, going to the Army Foundation College at Harrogate when he is 16, is not then locked into four years of service. There are break points,\" said the former Chief of the General Staff. \"At the time they become 18 they then have the choice as to whether they want to go into adult service .\" Ginger Pride festival to take place next summer Document leak reveals PM's strategy to keep Britain in EU Defiant demonstrators reclaim massacre beach Tunisia: Gunman pictured on Sousse beach Man found dead at Olympic Stadium New footage emerges of killer sprinting along beach", "articleID": "2015062906_00001153_W", "names": {"Ben Griffin": ["Q4885745", "Q4885747"]}}, {"date": "2015-06-30", "url": "http://saharasamay.com/entertainment-news/676575653/emma-stone-genre-is-her-true-love.html", "content": "Hollywood star <mark>Emma Stone</mark>, who started her career with comedy film \"Superbad\" , says the genre is her true love. The 26-year-old actress has been praised for her work on movies like period drama \"The Help\" and crime film \"Gangster Squad\" but will always enjoy working in light-hearted films the most, reported Contactmusic. \"Comedy is my true love. I doub' t whether there will ever be another genre that can compete. A big part of my job is being able to understand different facets of the human psyche and I like to be able to push myself in roles where you have to dig deeper inside,\" she said. The \"Birdman\" actress said she gets attracted towards strong female roles, where she is portraying more than someone's girlfriend. \"I probably gravitate towards those kinds of characters although it's not like I'm specifically looking to play strong women .\" I'm attracted to roles where the female character has her own sense of identity and not just the guy's girlfriend and reacting to whatever he does, \"said <mark>Stone</mark>. super luxury car maker Rolls-Royce is gearing up to tap the...Coming-of-age drama\" Boyhood' won three of the biggest award...Sunny Leone is seen scorching the screen in the first look...Samsung unveiled the Galaxy S6 and Galaxy S6 Edge at Mobile...Reality TV star Kim Kardashian reportedly wants Beyonce to b.. . Automaker Renault India today said it will roll-out a multi -...Pharma tycoon Dilip Shanghvi surpassed Mukesh Ambani as the...When Holi is round the corner, can anyone forget all-time hi...In an interim order, the Bombay High Court has restrained th...Good news for the fans' of <mark>Salman Khan</mark> and Deepika Padukon...Reality TV star Kim Kardashian has posed nude for the upcomi...Bollywood superstar Akshay Kumar and Actress cum Entrepreneu...Kashmir witnessed season's heaviest snowfall as the arterial...Mexican actress Stephanie Sigman has joined Monica Bellucci...Luxury carmaker Mercedes-Benz launched the all-new compact B.. . Bollywood actor Poonam Pandey, gets relief as a local court...Automaker Renault India launched the new generation Duster p.. . Now Bollywood A-list actors are competing to get nude on-scr...The 2015 edition of the International Indian Film Academy Aw...India defeated Zimbabwe by six wickets chasing 288 runs...Indian auto major Mahindra & Mahindra showcases its electric...Were Suresh Raina and Shruti Hasan having an affair? Bollywo...Eyeing a sales milestone of 5 lakh units in the domestic mar.. . Union Home Ministry has asked the Mumbai Police to expedite...When Aamir Khan turned 50, the event had to be a grand one. S.. . PICS: Now flavourful, antioxidant-rich chocolate produced by new method Researchers have found a way to make chocolate more flavourf...Bar Refaeli feels she is too sexy to be handle. Check out adorable pics of Isha Koppikar's little angel Other than Ranveer, who wants to marry Deepika Padukone? Those days are gone, when you have to depend on touch screens and buttons to control your World's first flexible skin-like display inspired by nature InFocus unveils smartphone with 13 MP selfie camera", "articleID": "2015063018_00002261_W", "names": {"Emma Stone": ["Q147077", "Q58064847"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}, {"date": "2015-07-15", "url": "http://asia.eurosport.com/football/premier-league/2015-2016/arsene-wenger-chuba-akpom-has-chance-to-challenge-for-regular-game_sto4822353/story.shtml", "content": "Arsene Wenger: Chuba Akpom has chance to challenge for regular game By Desmond <mark>Kane</mark> via PA Sport Report ShareLast update 21 minutes ago - Published on 16/07/2015 at 01:06 By Desmond <mark>Kane</mark> via PA Sport Report - 21 minutes ago Arsenal manager Arsene Wenger has challenged Chuba Akpom to show he is ready for a regular place in the first team squad after the 19-year-old forward netted a hat-trick in the 4-0 win over a Singapore Select XI in the Barclays Asia Trophy. Akpom made a handful of appearances for the Gunners last season, before ending the campaign on loan at Nottingham Forest. The England youth international caught the eye during Wednesday's pre-season tour opener, putting Arsenal in front on 30 minutes. Arsenal's Chuba Akpom scores their third goal with a penalty - Reuters Midfielder Jack Wilshere scored a penalty on the hour, before Akpom also netted from the spot on 76 minutes then quickly completed his treble with a powerful header. \"It is down to performance and attitude. He has that grade to make between being a big talent and after an efficient talent week in, week out. That's of course the target,\" Wenger said, quoted on the club's official website, www.arsenal.com. \"That's up to him (on his role for the new season). How much (will he play)? I don't know, but I just believe that it's an encouragement to do well and to work even harder .\" He is a young player and it can lift his confidence. The confidence in the dressing room that you sense from the other players is important as well and that can help him. Let's not forget it's a friendly. He's a good talent, but he has to work and show that in [the big] games. \"\"I sent him out on loan last year because I thought he needed that. This pre-season, during the season I plan to keep him with us .\" Wilshere is another looking to get some much-needed game time following last season's injury problems, and was deployed in the number 10 role. Wenger said: \"He always had appetite Jack, but he was out for a long time. Already in the last two or three games of the season he has found his burst back with acceleration .\" He was injured last year early in the season and he missed five months. What you want at the top level today demands so much physically that to be [out] is a nightmare for the players. That's what he needs - continuity. After, we play so many games. \"We have a big squad, but not a massive one and I think the opportunities will be there for everybody .\" Wenger had rested 10 of his 27-man squad, including summer signing Petr Cech, while captain Mikel Arteta also watched on from the stands. The Arsenal manager was happy enough with the performance. \"Overall it was a positive game because we had a good resistance in the first game. We were tested against a very resilient, very dynamic, very mobile team, with a good collective attitude,\" Wenger said. \"I liked the fact that we kept a good team focus and as well that individually, every player had to dig deep. We suffered a little bit to get a good workout .\" Arsenal will face Everton in the final on Saturday after the Toffees defeated Stoke 5-4 on penalties earlier in the day after their game had ended goalless. Wenger said: \"I will rotate a bit because the week after we play two games again .\" For me at the moment the [objective is] to give competition to the players without overloading them and [for them] to be capable to work hard in training and to work on their fitness. If they play too many games, you cannot work in training. \"OUR VIEW With Yaya Sanogo apparently set to depart Arsenal for a season-long loan spell with Ajax, you might think opportunity knocks for young Akpom. Wenger certainly appears to be making encouraging noises about what the young forward could offer to the club in the season ahead. Wenger said the tour presented a chance for his younger players to impress, and the 19-year-old Akpom certainly appears to have been listerning. If he continues to score goals, he will be viewed as third in line behind Danny Welbeck and Olivier Giroud for a starting spot in the forward areas. Not a bad place to be for any young striker at the start of a season. As <mark>Harry Kane</mark> will testify. Share", "articleID": "2015071517_00093385_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}, {"date": "2015-07-15", "url": "http://northwestgeorgianews.com/associated_press/news/national/japanese-bills-would-expand-military-s-role/article_24f717aa-2b33-11e5-bead-ef8fda8ed84e.html", "content": "TOKYO (AP)--A parliamentary committee on Wednesday approved legislation that would expand the role of Japan's military after Prime Minister Shinzo Abe's ruling bloc forced the vote in the face of protests from some lawmakers and citizens. Opposition lawmakers tried to stop the committee vote as hundreds of citizens protested outside. The unpopular legislation was crafted after Abe's Cabinet adopted a new security policy last year that reinterpreted a part of Japan's post-World War II constitution that only permitted the nation's military to use force for its self-defense. The bills in question would allow Japan to also defend aggression against its allies--a concept called collective self-defense. Abe has argued that Japan should better prepare for China's regional threat and do more to contribute to international peacekeeping efforts. But opponents, including legal experts and academics, counter that the new interpretation is unconstitutional. Polls show that about 80 percent of Japanese find the bills hard to swallow, and the majority of them say they think the legislation is unconstitutional. That tension was on display Wednesday as opposition lawmakers attempted to thwart the committee's vote and hundreds chanted anti-war and anti-Abe slogans outside in protest. Lawmakers rushed over to the podium and began to slap and grab at committee chairman Yasukazu Hamada as he cut off debate and began the voting process. Some held up posters that read \"No to a forced vote!\" and \"No to Abe politics!\" The legislation would \"fundamentally change the way Japan has sought pacifism since the end of the war,\" Kiyomi Tsujimoto, an opposition Democratic Part of Japan lawmaker, told Abe before the vote. Abe acknowledged Wednesday that the legislation doesn't have public support but said he could force the vote because his party has the voters' mandate--an attitude that has also angered critics and polarized the debate around the military legislation. Abe has been increasingly criticized for being an autocratic leader and members of his right-wing Liberal Democratic Party came under fire recently after suggesting that two liberal newspapers on Okinawa should be destroyed. \"The existence of our constitution is threatened, the sovereignty-of-the-people principle is threatened, and our democracy is being threatened,\" Tsujimoto said. In Washington, State Department spokesman <mark>John Kirby</mark> declined to comment on the security legislation, calling it a domestic matter for Japan, a key U.S. ally. But he said the U.S. welcomes \"Japan's ongoing efforts to strengthen the alliance and play a more active role in regional and international security activities .\" ___ Associated Press writer Matthew Pennington in Washington contributed to this report. Follow Mari Yamaguchi at https: //www.twitter.com/mariyamaguchi/ Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. & copy; 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2015071522_00063361_W", "names": {"John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"]}}, {"date": "2015-07-15", "url": "http://www.justjaredjr.com/2015/07/15/daniel-radcliffe-plays-receptionist-at-nylon-mag-watch-the-vid/?ref=jrfooter", "content": "<mark>Daniel Radcliffe</mark> Plays Receptionist At Nylon Mag - Watch The Vid! <mark>Daniel Radcliffe</mark> gets ready to play receptionist in this funny new video from Nylon magazine. The 25-year-old British actor took the reins of the front desk at the mag's headquarters in New York City and while JJJ wouldn't actually call it chaos...that's kind of what happened anyway. \"I received no phone calls during that hour, which was strange,\" one staffer wrote of the temp one-hour receptionist and what happened. \"And a package that was supposedly delivered to the office for me never made it to my desk. As I started to track down the aforementioned package, I heard a squeal. Apparently had come into the office, to surprise <mark>Daniel</mark> and try to resume his job .\" Joe Jonas Check out the video below! Nylon--<mark>Daniel Radcliffe</mark> Was Our Receptionist for an Hour Like Just Jared Jr. on FB Share This!", "articleID": "2015071522_00099359_W", "names": {"Daniel Radcliffe": ["Q20744643", "Q38119"]}}]