[{"articleID": "2016092101_00096540_W", "names": {"David Barker": ["Q15710330", "Q15994282", "Q21466672", "Q3017446", "Q38804743", "Q5231130"], "Dave Walker": ["Q1167952", "Q11693064", "Q172091", "Q24279373", "Q27674957", "Q5230057"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-09-20", "url": "http://weblogs.sun-sentinel.com/news/nationworld/ct-black-lives-matter-protest-las-vegas-court-20160920-story.html#nt=oft13a-23gp1", "content": "A defense attorney touched off a protest Tuesday about race and free expression in a Las Vegas courtroom when she refused to remove a \"Black Lives Matter\" button from her blouse despite a judge's request not to demonstrate what he called \"political speech .\" Clark County District Court Judge Douglas Herndon asked Erika Ballou, a deputy public defender who is black, to remove the button or leave the courtroom and turn the case she was handling over to another lawyer. \"I'm asking the same thing of defense attorneys that I ask of anybody else,\" the judge said. \"Please leave any kind of political or opinion protest statements outside the courtroom .\" Ballou, with Clark County Public Defender Phil Kohn standing at her side and about a dozen defense attorneys in the audience to show their support, insisted that she had a First Amendment right to demonstrate her opinion. She also refused to remove herself from her client's case, which the judge postponed to Thursday. Several supporters wore a similar lapel button: Black, about the size of a silver dollar, with white letters. Attorney Jonathan MacArthur said he'll wear it again to Herndon's courtroom on Thursday. \"This is an issue about criminal justice,\" Ballou told the judge. She noted that some deputy district attorneys wear small office badge-type lapel pins, and that uniformed court officers are allowed to wear symbolic black bands on their badges to mourn police officers killed on duty. Eagles players protest during national anthem at Soldier Field Phil Rosenthal Birds of a feather don't necessarily flock together. While the rest of the Philadelphia Eagles stood along the sidelines during singer Jim Cornelison's performance of the national anthem before Monday night's kickoff against the Bears at Soldier Field, Eagles safety Malcolm Jenkins, defensive end...Birds of a feather don't necessarily flock together. While the rest of the Philadelphia Eagles stood along the sidelines during singer Jim Cornelison's performance of the national anthem before Monday night's kickoff against the Bears at Soldier Field, Eagles safety Malcolm Jenkins, defensive end...(Phil Rosenthal) \"This is not political speech. It is not supporting a particular candidate,\" she said of her pin. \"I believe a courtroom is the proper place .\" Ballou, a public defender for 11 years, said outside court that she took her stand after the head of the Las Vegas police union sent a letter last week to the chief state district court judge, <mark>David Barker</mark>, complaining that what the union executive termed \"\"Black Lives Matter' propaganda\" had no place in courtrooms. \"We are certain that the courts would not allow similar public displays from citizens who believe that killers should be sentenced to death or that sexual predators should be castrated,\" Las Vegas Police Protective Association director Steve Grammas wrote. \"While we embrace the First Amendment, we do not believe that such statements should be made in the halls of justice .\" Grammas said in a brief email that he raised the issue at the request of a union member, who was \"satisfied to have the issue addressed .\" Grammas didn't immediately respond to follow-up questions. <mark>Barker</mark> was in court hearings and unavailable to immediately respond to messages. Lawyers for Terence Crutcher say drug discussion is a distraction in Tulsa police shooting Tribune news services Investigators found the drug PCP in the vehicle of an unarmed black man fatally shot by a white officer, according to Oklahoma police, but attorneys for the slain man's family say discussion of drugs distracts from questions about the use of deadly force. Tulsa Sgt. <mark>Dave Walker</mark> told the Tulsa World...Investigators found the drug PCP in the vehicle of an unarmed black man fatally shot by a white officer, according to Oklahoma police, but attorneys for the slain man's family say discussion of drugs distracts from questions about the use of deadly force. Tulsa Sgt. <mark>Dave Walker</mark> told the Tulsa World...(Tribune news services) A court spokeswoman, Mary Ann Price, pointed to court rules of conduct making judges responsible for applying rules of decorum, proper attire and dignity. Herndon, who earlier asked court spectators to cover T-shirts they'd worn to support victims in another case, told Ballou he tries to keep his courtroom free of outside influences. The pin, the judge said, \"is making a political statement, that,' I wear this in protest of how the court is treating minority defendants .'\" \"Wear it in the hallway. Wear it in front of the courthouse,\" Herndon added. \"Demonstrate. Protest. Use your voice. But that's not what dealing with justice on an individual case is about .\" Ballou, a self-described \"middle-aged, middle-income\" woman, said she feared for her life when she was surrounded by four Nevada Highway Patrol officers during a traffic stop for a driving infraction last July 4. \"People are getting killed in the streets every day. People who look like me,\" she said. \"Black Lives Matter is not a protest against police. It is a protest against police brutality .\" She said she was moved to wear the pin after hearing about the police union letter, amid a backdrop of high-profile police shootings of black men across that have ignited protests and a national dialogue about race in America. Ballou also invoked recent national anthem protests by San Francisco 49ers quarterback Colin Kaepernick over racial injustice, including comments he made to the media that \"people don't realize what's really going on .\" <mark>Trump</mark>, in town named after man whose family owned slaves, says blacks in \"worst shape' ever Jose A. DelReal <mark>Donald Trump</mark> faced a swift backlash Tuesday after declaring that African-Americans are\" in the worst shape they've ever been \"during a campaign event here .\" We're going to rebuild our inner cities because our African-American communities are absolutely in the worst shape they've ever been in before...<mark>Donald Trump</mark> faced a swift backlash Tuesday after declaring that African-Americans are \"in the worst shape they've ever been\" during a campaign event here. \"We're going to rebuild our inner cities because our African-American communities are absolutely in the worst shape they've ever been in before...(Jose A. DelReal) In Las Vegas, race in criminal justice has been a controversial issue in recent years. The Las Vegas Metropolitan Police Department drew scrutiny from the U.S. Justice Department's office of Community Oriented Policing Services and began in 2013 to change a range of policies after a review of officer-involved shootings over several years. The seven-month COPS review looked at 87 cases of police use of deadly force from 2007 to 2012. Of those, 10 involved unarmed people, including seven who were African-American. Associated Press"}, {"articleID": "2011051310_00082131_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2011-05-13", "url": "http://wcyb.com/health/27873895/detail.html", "content": "(cnn)--in a thursday speech that was equal parts college lecture and campaign stump, former massachusetts gov. mitt romney issued a defense of the health care \"experiment\" he implemented while governor and slammed the obama administration's health care reform law as a federal \"power grab .\" the potential gop presidential contender said he would \"issue waivers for all 50 states\" to opt-out of health care reform on his first day in office should he be \"lucky\" enough to become president. he expressed the same sentiment in an op-ed for usa today thursday, which explicitly detailed his five-point plan. romney faced down criticism from fellow gop hopefuls including former pennsylvania sen. rick santorum, and former arkansas gov. mike huckabee as well as possible questions from conservative voters whom he may rely on for support, should he choose to run. he opened his address at the university of michigan in ann arbor with an explanation of how the massachusetts plan differs from one-year old health care reform. he joked that some may ask \"i heard that your plan in massachusetts is a lot like president obama's plan,\" and question why he's so anxious to repeal it. and romney responded with a lesson in american history. \"the people in america are sovereign,\" he said, explaining that the framers decided \"states would be the laboratories of democracy and compete with one another .\" \"i'm convinced that the obama administration fundamentally doesn't believe in that american experiment,\" he continued. \"they distrust that states are the ones with the power to decide .\" romney countered criticism by asserting that the massachusetts plan was such an experiment. though his action was \"a plan for the state of massachusetts,\" he described health care reform law as \"a power grab by the federal government .\" according to romney, the differences between his plan and obama's are many, but similarities exist as well-and he's not willing to apologize for one of them. though he \"respects\" those who believe he should've taken a different course as governor and realizes that his explanation is \"not going to satisfy everyone,\" he would not reject the individual insurance mandate included in the massachusetts plan--the pesky similarity to federal health care reform that serves as fodder for criticism from both sides of the aisle. \"it wouldn't be honest,\" romney said. \"i, in fact, did what i thought was right for the people of our state .\" the 2008 presidential candidate attempted to put distance between the president and himself, while moving closer to his base, by calling the health care reform law \"an economic nightmare\" and the reason \"why this recession has taken to so long to move on from .\" romney insisted that his reform would \"share some of the objectives\" of the plan proposed by house budget committee chair <mark>paul ryan</mark>, which he touted as including choice, inserting market dynamics, and keeping medicare solvent. romney's silver bullet solution to health care reform is to drive costs down by encouraging \"the consumer to care about the cost and the quality\" of their own health care, and to \"get healthcare to work like a market .\" in the end, he's confident that voters will see it his way. \"if i am the nominee on the republican side of the aisle and i get the chance to debate president obama, this is what we're going to talk about,\" he said. \"i'm confident that the people will say the mitt romney u.s. reforms, that's a lot better than obamacare .\" one potential opponent for romney wasted no time in issuing a response to his speech. santorum released a statement following romney's remarks the criticized his \"work to institute the precursor to national socialized medicine .\" \"both romneycare and obamacare infringe upon individual freedom and exponentially increase the government's healthcare cost burden,\" santorum said. chinese conjoined twins fight for survival could vampire bat spit save stroke victims? administrators at a tazewell county school evacuated classes after a student brought a hand grenade to show his friends. ashton kutcher teased twitter followers about reports that he'll join the \"two and a half men\" cast to fill the gap left by charlie sheen's departure. when storms become dangerous, it is important that we have enough advanced warning as possible. warnings issued by the weather service seemed to not be taken as seriously before the tornadoes. but these warnings are serious and more people are now paying more attention to them. click for video new information from washington county, va dept. of emergency management to move forward with fema's denial of individual assistance, efforts are still underway by the county to identify any impacted area of the county that may not have been indentified during the initial damage assessment by fema and to identify those owner-occupied homes that were totally destroyed or sustained major damage that were uninsured and underinsured. gates: seals who killed bin laden are concerned for their safety the department of defense is looking into ways to \"pump up the security\" for the team of navy seals who helped kill osama bin laden after the commandos expressed concern for their safety and the safety of their families, defense secretary robert...aerial photos of the damage done to the glade spring area after heavy thunderstorms and tornadoes on april 27. photos of storm damage and hail from storms in late april and early may 2011."}, {"articleID": "2008092706_00003321_W", "names": {"President Bush": ["Q207", "Q23505"], "Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}, "date": "2008-09-27", "url": "http://blog.myspace.com/index.cfm?fuseaction=blog.view&friendID=28126352&blogID=436384871", "content": "what if the disappearance of the bees is caused by superpesticides? there's been allot of news lately about the honey bee colony collapse disorder. based on current reports the world has lost approximately 70-80% of our honey bee stocks. honey bees, monarch butterflies, and amphibians please study the facts regarding i.g. farben and take it upon yourself to further investigate the beginnings of the pharmaceutical racket and plan for entered into a joint venture with i.g. farbenfabriken (i. g. farben), the financial core of the hitler regime and the key supplier of poison gas to the nazi racial extermination program. (ig farben built 300 concentration camps, made money off of slave labor and produced zyclon b and cyanide). after the holocaust, the german chemical firm joined with american counterparts in the development of chemical warfare agents and founded the \"chemagrow corporation\" in kansas city, missouri, a front that employed german and american specialists on behalf of the u.s. army chemical corps. \"ig farben was never shut down, even though the prosecuting attorney at the nuremberg trial said ig farben should be tried for war crimes and if we did not stop them they would continue criminal activities. it broke into 3 companies: german multinationals bayer, basf and hoechst, the i.g. farben cartel was founded with a total number of employees surpassing 80,000. the race for global control was on. hoechst and bayer, the largest and third largest companies in world pharmaceutical sales respectively, are descended from i.g. farben. in september 1955, hoechst appointed friedrich jaehne, a convicted war criminal from the nuremberg trials, as chairman of its supervisory board. also, a year later, bayer appointed fitz ter meer, another convicted war criminal, as chairman of its board. so the quick rundown is this...reated superpesticides that are killing our bees which is a form of population control because people will die from starvation. germany has had it with them and is doing a smackdown right now! basf tried to make it illegal to buy or sell vitamins and herbs and got slapped with the biggest lawsuit in the history of the vitamin/herb industry. hoeshst has a subsidiary called roche that has produced the avian flu vaccine. (hopefully this part of the company has a bit more integrity than its counterparts. we can only hope .) they create terminator crops that kill regular crops. the terminator crops have a lifespan of 1 year and then the farmers have to buy more seeds from monsanto. they buy up water rights of indigenous people's so they get to say who has a drink of water and who doesn't. they bankrupt small farmers by killing their regular crops with terminator crops that blow in the wind and sterilize regular organic crops. they put genetically modified crops on the market that are now showing to kill lab rats! president <mark>bush</mark> put several members of monsanto corp on his cabinet! monsanto had fox news reporters fired for reporting monsanto bgh in milk causes cancer. the amphibians are dying world-wide (on the verge of extinction) and monsanto's\" roundup \"is considered a main reason. monsanto is worth about 30 + billion dollars, is multinational and much of the bill is paid by the us eating their produce and not one country has been able to shut them down. because <mark>bush</mark> has monsanto as his cabinet members they have managed to dictate to the usda and fda to put gmo and ge food into our food supply without labels! in india scientists and farmers burned the monsanto crops .--they called it a\" death by a thousand cuts \"indicating the rest of the world would need to do the same burn crops and tie this corporation up in lawsuits world-wide. there's lots of information on the internet about the resistance to monsanto in india after 4,000 farmers committed suicide when their crops died and their families starved. so let's look at the bigger picture. if the pollinators die, crops die and people will starve to death. people will inevitably turn to buying seeds to grow food themselves. but monsanto has figured this out too. monsanto is now cornering the seed market so the public will not be able to buy seeds unless it is from them and the seeds they will sell will be genetically modified with life spans of 1 year where we have to buy from.monsanto every year! sound fun to you? monsanto has also gone to the trouble of building a\" doomsday seed vault \"along with bill gates and david rockefeller and stored all of the seeds in the world. i'll cut bill gates some slack (he might just see it as a\" good investment \").\" single acts of tyranny may be ascribed to the accidental opinion of a day; but a series of oppressions, begun at a distinguished period and pursued unalterably through every change of ministers, too plainly prove a deliberate, systematic plan of reducing [a people] to slavery. \"--<mark>thomas jefferson</mark>\" we are grateful to the washington post, the new york times, time magazine and other great publications whose directors have attended our meetings [the bilderberg group] and respected their promises of discretion for almost forty years. it would have been impossible for us to develop our plan for the world if we had been subject to the bright lights of publicity during those years. but, the work is now much more sophisticated and prepared to march towards a world government. the supranational sovereignty of an intellectual elite and world bankers is surely preferable to the national autodetermination practiced in past centuries. \"gender: female status: engaged age: 29 sign: aries city: humboldt county"}, {"articleID": "2009091406_00077134_W", "names": {"Javier Vazquez": ["Q2917758", "Q3163172", "Q6165756", "Q682043"], "Chris Carpenter": ["Q1185342", "Q2964676", "Q5106095"]}, "date": "2009-09-14", "url": "http://clarionledger.com/article/20090914/SPORTS02/909140336/1025/RSS02", "content": "st. louis - <mark>javier vazquez</mark> doesn't think he was ever this efficient. <mark>vazquez</mark> needed just 94 pitches to shut down the st. louis cardinals, and the atlanta braves roughed up <mark>chris carpenter</mark> in a 9-2 win on sunday. \"i don't remember throwing a complete game with less than 100 pitches,\" <mark>vazquez</mark> said. \"usually i'm at 100 pitches by the seventh inning. i feel really good about that .\" <mark>vazquez</mark> allowed a leadoff single to skip schumaker and then retired the next 17 batters before schumaker reached on an infield single in the sixth. it was the 25th complete game of <mark>vazquez</mark>'s career and his second of the season. <mark>vazquez</mark> (13-9) has won his last three decisions. he struck out eight while walking none and threw just 94 pitches. st. louis hadn't been swept since losing three in a row at houston july 20-22 and hadn't got the broom at home since losing four straight to the colorado rockies june 5-8. \"we got beat in two one-run games,\" cardinals manager tony la russa said. \"today, we just got pounded .\" <mark>carpenter</mark>, a cy young candidate, had his worst outing of the season. he allowed seven earned runs on nine hits in six innings. \"i made some bad pitches but i also made some good pitches,\" <mark>carpenter</mark> said. \"i just wasn't able to make a pitch to get out of the inning, bottom line .\" you must fill out the comment body in order to submit a comment. the comment you have entered is too long. please limit your post to {maxchars} characters or less."}, {"articleID": "2018100715_00179283_W", "names": {"David Adams": ["Q16091376", "Q24007533", "Q2633956", "Q42713808", "Q47546710", "Q5230604", "Q5230607", "Q5230608", "Q5230609", "Q5230611", "Q56855421", "Q57602629", "Q58218009", "Q586939"]}, "date": "2018-10-07", "url": "http://www.gamereactor.eu/gadgets/?system=ps3&sid=01255adf9a7563f808a7948ab221224e", "content": "On the 5th of October 2018 Portuguese livestream. Diablo III: Eternal Collection - Local multiplayer Gameplay On the 5th of October 2018 Nintendo Switch introduces on Diablo III a local multiplayer mode for up to four people. We play the 20 first minutes of the game with friends. Coca-Cola Zero Sugar and Gamereactor's Weekly Esports Round-up S02E36 On the 5th of October 2018 It's Friday, so that means we have another episode of our Weekly Esports Round-up, including results from two big CS: GO events, an interview with the NBA 2K League's managing director, hardware, and so much more. Quick Look - MSI GeForce RTX 2080 On the 4th of October 2018 Magnus and Dóri take a look at the new MSI GeForce RTX 2080, discussing how this new generation of graphics cards could well be a game-changer for the industry. Battlerite Royale - Livestream Replay On the 4th of October 2018 Dóri knows a thing or two about battle royale games, but what does he make of Battlerite Royale, a game that takes the basic BR formula and puts a MOBA spin on things? Find out as we play the game for a couple of hours in this Livestream Replay. Quick Look - HP OMEN 35 Curved Monitor On the 4th of October 2018 Dóri and Magnus take a look at the impressive UWQHD, G-Sync, ultrawide monitor by HP. Watch them as they talk about its resolution, response time, design, image quality and potential use for gaming. Assassin's Creed Odyssey - A Fully Fledged RPG (Video #2) On the 4th of October 2018 In this second chapter in our massive video series, we take a look at how Ubisoft has turned the series into a fully fledged RPG. League of Legends: The Lure - Dan Abnett Interview On the 4th of October 2018 Dan Abnett wrote the League of Legends comic The Lure, and we talked to him about its creation. League of Legends Esports - NicoThePico Interview On the 4th of October 2018 We talked with League of Legends coach NicoThePico about how he got into the game, his experience, and what he's doing now. Fortnite: Season 6 - Livestream Replay On the 3rd of October 2018 Fortnite Season 6 has just landed to make things extra spooky in the battle royale game, and although we're a bit early for Halloween, we tried the new Season 6 content to see what's up. And no, we're not just talking about the Loot Lake island. Runescape Old School Mobile - John Colgrave Interview On the 3rd of October 2018 We caught up with John Colgrave from Jagex to learn more about their efforts to bring Runescape Old School to mobile devices. Liftoff - Kevin Haelterman Interview On the 3rd of October 2018 We were joined by LuGus Studios' Kevin Haelterman to learn more about the drone racing simulator Liftoff that recently exited Steam Early Access. Spyro Reignited Trilogy - Lou Studdert Interview On the 3rd of October 2018 Spyro is coming back this year with the Reignited Trilogy and producer Lou Studdert is here to tell us all about it. Mutant Year Zero: Road to Eden - Mark Parker Interview On the 3rd of October 2018 We caught up with producer Mark Parker to chat about the enticing combination of real-time stealth, tactical combat, and deep narrative that makes up Mutant Year Zero: Road to Eden. GTFO - Simon Viklund Interview On the 3rd of October 2018 We caught up with 10 Chamber Collective's Simon Viklund to learn more about the \"loveletter to hardcore co-op shooter fans\" that is GTFO. Remnant: From The Ashes - <mark>David Adams</mark> Interview On the 3rd of October 2018 Creative director <mark>David Adams</mark> joined us for a chat about one of the many exciting projects in the works at Gunfire Games, the supernaturally themed co-op shooter Remnant: From the Ashes. Trüberbrook - Darius Cernota Interview On the 3rd of October 2018 Producer Darius Cernota joined us for a chat about the lovely looking adventure game Trüberbrook that's been created using miniatures and is set in a small German town in the 1960s."}, {"articleID": "2011081603_00043864_W", "names": {"Mario Lopez": ["Q1898880", "Q372559", "Q57942357", "Q6007003"]}, "date": "2011-08-16", "url": "http://411mania.com/movies/news/198015", "content": "advertisement [video] kim kardashian gives <mark>mario lopez</mark> some wedding spoilers she's got \"a lot of little surprises...\"and post under your registered name. if not, you can post as a guest or privacy policy. please help us serve you better, fill out our"}, {"articleID": "2009051320_00016773_W", "names": {"Kevin Reilly": ["Q18326303", "Q6397335", "Q6397336", "Q6397338"], "Tim Roth": ["Q203804", "Q2906366"], "Kelli Williams": ["Q19881842", "Q234661"]}, "date": "2009-05-13", "url": "http://zap2it.com/tv/zap-lie-to-me-renewed,0,6120058.story?track=rss", "content": "fox has renewed its freshman drama \"lie to me\" for a second season and hired a new showrunner to oversee the series. \"the shield\" creator shawn ryan has joined the series as an executive producer and will also supervise the show next season. the show, which has drawn healthy ratings this spring, ends its first season wednesday night. \"\"lie to me' came out strong, built a solid audience throughout its run and promises to be one of our big assets next season and beyond,\" fox entertainment president <mark>kevin reilly</mark> says. \"we're incredibly excited to have shawn on board to infuse\" lie to me' with even more creative energy next season. \"ryan is also an executive producer of cbs'\" the unit, \"which is on the fence for renewal. he has split time in the past between\" the shield \"and the cbs show, so it's tough to read what his move to\" lie to me \"might mean for the future of\" the unit. \"\"lie to me\" stars <mark>tim roth</mark> as dr. cal lightman, an expert in recognizing deception via facial tics, changes in people's voices and body language whose firm helps law enforcement agencies and other groups figure out who's lying and who's not. <mark>kelli williams</mark>, monica raymund and brendan hines also star. the show is averaging 11.6 million viewers and 4.0 adults 18-49 rating in the nielsen live-plus-seven-day ratings this season. part of that comes from airing as \"american idol's\" lead-out for its first few episodes, but the show has also held its own before \"idol\" on wednesdays, usually winning its hour. it's the second first-year series fox has picked up in advance of next week's upfronts, following \"fringe .\" ryan will join fellow exec producers sam baum (who created the show), brian grazer and david nevins. fall tv what's new, what's coming back and what to watch. emmy awards find everything you need to know about the 2008 primetime emmy awards. pick your favorite channels customize our tv listings to show only the channels you care about. new on nbc \"day one,\" plus five more too lazy to read our stories? let news at seven"}, {"articleID": "2016120503_00409705_W", "names": {"Ray Kelly": ["Q16509084", "Q3420958", "Q7297693"]}, "date": "2016-12-05", "url": "http://www.theborneopost.com/2016/12/05/california-warehouse-fire-death-toll-climbs-to-33/", "content": "A fireman walks before a warehouse after it was destroyed by a fire, Dec 3, 2016 in Oakland, California. AFP Photo OAKLAND: The death toll from a fire at a California warehouse where a rave party was taking place rose to 33 on Sunday, with authorities saying they had no idea how many more bodies they would find. \"When we started this investigation, if you would have told us we would have 33 victims, we wouldn't have believed you,\" Sergeant <mark>Ray Kelly</mark> of the Alameda County Sheriff's Department told reporters, adding that crews had searched less than half of the gutted building. \"I don't know how many people are left in there. We have no idea how many people were in that building that night...We're expecting the worst and hoping for the best in regards to how many more victims we find .\" The fire in Oakland, near San Francisco, broke out late Friday at the cluttered warehouse where artists and students worked and lived, even though the structure wasn't licensed for such use. The electronic dance music party, with between 50 and 100 guests, also took place without proper permits. The cause of the blaze was still under investigation but Oakland Mayor Libby Schaaf said the district attorney had activated a criminal investigation as a precaution to preserve options as the case unfolded. Authorities on Sunday asked relatives of the missing to \"eliminate future delays\" in identifying victims by preserving items like hairbrushes and toothbrushes for DNA samples. \"We will ask for them as we need them,\" said Captain Melanie Ditzenberger of the sheriff's department coroner's bureau. Firefighters worked for 12 hours by night to enter the building, eventually breaching a wall to clear their way into the warehouse, said Oakland Fire Battalion Chief Melinda Drayton .--\"A few more days'--\"It will take a few more days just getting through the building,\" Drayton told reporters. Images published online show artwork, pianos and wooden objects throughout the building, which helps explain how the fire quickly spread through the structure. \"It was filled end-to-end with furniture, whatnot, collections,\" Fire Chief Teresa Deloach Reed said Saturday. \"It was like a maze, almost .\" \"There wasn't a real entry or exit path,\" she said. In addition, firefighters said the building seemed to have no sprinklers or smoke detectors. Officials said the roof collapsed onto the second floor, which was connected to the ground floor only by a makeshift system of wooden pallets. A dozen bodies were found in an area in the middle of the building, Drayton said. She added that the firefighters had taken every precaution to treat the human remains with respect .--\"It was heartbreaking'--Describing the atmosphere during the night of excavation, Drayton choked back tears:\" It was quiet. It was heartbreaking. \"Most of those who perished in the blaze, which started at about 11:30 pm Friday (0730 GMT Saturday) were thought to have died on the upper floor of the warehouse known as the Oakland Ghost Ship, Reed said. Some of the missing were apparently foreign students thought to be in their 20s and 30s, making identification more difficult. The fire was the deadliest incident in Oakland since the 1989 Loma Prieta earthquake in northern California, which killed 63 people. The deadliest nightclub fire in the United States in recent decades occurred in 2003, when pyrotechnic effects by the rock band Great White set off an inferno at The Station nightclub in Rhode Island, killing 100 people. Oakland, a city of some 420,000, was once deemed largely unsafe but is now home to a more affluent population attracted by affordable rent and proximity to San Francisco .--AFP What do you think of this story? Great (0%) Interesting (0%) Nothing (0%) Sad (0%) Angry (0%)"}, {"articleID": "2016092312_00496241_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-09-23", "url": "http://wdtimes.com/sports/state_national_sports/article_33baa233-86f6-5ee0-91ea-58916239e8f4.html#user-comment-area", "content": "No. 12 Georgia, No. 23 Mississippi meet in Top 25 showdown - Watertown Daily Times Online: State National Sports MIAMI (AP)--Police in South Florida say they have a \"person of interest\" in the theft of a naked <mark>Donald Trump</mark> statue. Updated: 6:16 am OXFORD, Miss. (AP)--Georgia first-year coach Kirby Smart gets a second crack at trying to slow down Mississippi quarterback Chad Kelly. posted: September 23 FORT ATKINSON--Badger Bank has announced the promotions of Leanne Lehmann and Gina Gehring. Updated: August 30 Rogelio V. Solis Top-ranked Alabama rallies, beats No. 19 Ole Miss 48-43 Mississippi quarterback Chad Kelly (10) attempts a pass against Alabama in the first half of an NCAA college football game, Saturday, Sept. 17, 2016 in Oxford, Miss. (AP Photo/Rogelio V. Solis) Posted: Friday, September 23, 2016 7:01 am OXFORD, Miss. (AP)--Georgia first-year coach Kirby Smart gets a second crack at trying to slow down Mississippi quarterback Chad Kelly. He knows from experience it won't be easy. \"He's a little bit like a rodeo bull rider,\" Smart said. \"This guy will do anything and he's good at it. Trust me, I know from experience. He's good .\" The 12th-ranked Bulldogs (3-0, 1-0 Southeastern Conference) are the higher-ranked team in this matchup, but will still be about a touchdown underdog when they travel to face the 23rd-ranked Rebels (1-2, 0-1) on Saturday. Georgia has won 10 straight games in the series dating back to 1996. Smart was Alabama's defensive coordinator last season when Kelly torched the Tide for 341 yards passing, three passing touchdowns and one rushing touchdown in a 43-37 victory for the Rebels. Now Smart is ready for round two. He said the goal is to keep Kelly off balance, and used a baseball metaphor to illustrate the Bulldogs' plan. \"You've got to be able to pitch,\" Smart said. \"You've got to throw the fastball, you've got to throw a curveball. You've got to be able to change it up and you've got to throw the slider. You can't do the same thing all the time .\" It is obvious Smart has a lot of respect for Kelly. The Ole Miss quarterback said the feeling is mutual when it comes to Georgia's defense. \"They're big and athletic. They play really smart,\" Kelly said. \"I think that's a compliment to their head coach and their defensive coordinator. They do a really good job of staying in the right place. We have to make sure we play hard and keep the turnovers down .\" Kelly has thrown for 953 yards and 10 touchdowns this season, but his four interceptions have been costly. One was returned for a touchdown last week in the Rebels' 48-43 loss to Alabama. \"I have to take it upon myself to keep putting it in my head to take care of the ball,\" Kelly said. ___ Some other things to watch when Ole Miss hosts Georgia on Saturday: ENGRAM'S THE TARGET: Ole Miss senior tight end Evan Engram has emerged as Kelly's favorite target this season. He's caught 20 passes for 302 yards this season. Both numbers are tops in the nation for a tight end. Said Kelly: \"He's a heck of an athlete. He's a playmaker, he's aggressive. He likes to hit people, too. He's a blocker, so he's not just a receiving tight end .\" REBELS STRUGGLE TO KEEP LEADS: Ole Miss has already let two big leads get away during losses this season. The Rebels led Florida State 28-6 on Sept. 5 before eventually losing 45-34. Last weekend, Ole Miss had a 24-3 lead on No. 1 Alabama before the Tide rallied to win 48-43. GEORGIA CAN COME BACK: While Ole Miss has had trouble keeping leads, Georgia has proven adept at coming back after falling behind early in games. The Bulldogs trailed by 10 points to both North Carolina and Missouri before winning both games. CHUBB'S RESURGENCE: Georgia running back Nick Chubb has had a great start to the season after missing a big chunk of 2015 with a serious knee injury. The 5-foot-10, 228-pound junior has run for 365 yards and three touchdowns through three games. Said Ole Miss coach Hugh Freeze: \"Another great test for sure. They are going to present a great challenge to us in the run game and we've got to be sure that our eyes are disciplined .\" MCKENZIE EMERGES: Georgia receiver Isaiah McKenzie is having a breakout year, catching 18 passes for 305 yards and four touchdowns in three games. He had 10 catches for 122 yards and two touchdowns in last week's win against Missouri. ____ Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP. AP College Football website: www.collegefootball.ap.org."}, {"articleID": "2011080422_00004627_W", "names": {"Joseph Quinn": ["Q39073476", "Q40301777"]}, "date": "2011-08-04", "url": "http://us.rd.yahoo.com/finance/external/xbizwk/rss/SIG=13qg2opoh/*http%3A//www.businessweek.com/finance/fragile-economy-keeps-older-workers-from-retirement-08042011.html?campaign_id=yhoo", "content": "t retirement august 04, 2011, 5:12 pm edt fragile economy keeps older workers from retirement for those in their 50s and early 60s the doubts start after opening the quarterly 401 (k) statement. the numbers look small following a decade of measly stock market returns and bear market devastations, including a fresh jolt on aug. 4, when the s & p 500 index swooned, extending the tumble from its peak in late april to 12 percent. two-year treasury note yields hit a record low, while the yield on one-month t-bills slipped into negative territory. taken together, the economic data are sending an aging, insecure workforce a clear message: don't retire yet. \"things are too uncertain,\" says richard v. burkhauser, economist and professor of policy analysis at cornell university. \"there's no way to protect yourself from all unexpected risks except not to retire .\" in the first half of 2011, the u.s. economy grew at a meager 0.8 percent annualized rate; investors appear increasingly nervous that a so-called double-dip recession is becoming more likely. those worries were exacerbated this week by the debt-ceiling accord reached in congress, which will seek $1.5 trillion in deficit cuts by year's end-a particularly rocky period for the recovery. the long-term trend toward a declining average age of retirement has reversed itself. the decline started in the 1880s and accelerated in the post world war ii era, falling for men from an average age of 70 in 1950 to 62 in 1985. yet since the mid-1980s increasing numbers of older men and women have kept working. the labor force participation rate for men age 65 has risen 43 percent over the past quarter century. for women 65 and older, the participation rate has nearly doubled over the same period, to 13.4 percent in june 2011. on the positive side working into the traditional retirement years allows savings to compound longer. workers are healthier and better educated than earlier generations, and it's easier to toil away in an economy dominated by high-tech gear rather than the assembly line. the financial payoff from staying on the job also comes from higher social security benefits. waiting to file until the full retirement age of 66 increases the benefit by at least a third, compared with taking social security at age 62. wait until age 70 to claim your first benefit check, and it's at least 75 percent larger. \"the era of earlier and earlier retirement is over, and it isn't coming back,\" says <mark>joseph quinn</mark>, an economist at boston college. sounds good. the flaw in the new job-tirement message is that america's great job machine is sputtering. the u.s. economy hasn't done well at creating jobs for young and old workers alike, let alone jobs with decent pay and benefits. even before the labor market trauma of the great recession, private sector job growth was the weakest in half a century during the business cycle expansion of the 2000s. it increased at an annual 0.6 percent rate, according to the economic policy institute, a shadow of the 1.8 percent annual rate of the '90s and the 2 percent yearly pace of the '80s. jobs remain scarce 26 months after the recession was declared officially over; the u.s. unemployment rate is at 9.2 percent. much of the work that's available doesn't pay well, and unlike their younger workmates, older workers have little time left to climb the corporate ladder of success (or at least get a pay raise). it's striking how many older workers are staying on the job. the labor force participation rate-the percentage of the working age population in the labor force-for most middle-aged and younger workers is down since the recession started in december 2007. the same isn't true for older workers. for instance, among men 55 and older, the labor force participation rate was 46.2 percent in june 2011, up from 45.4 percent in december 2007. the comparable figures for women were 34.6 percent and 33.7 percent, respectively. \"older workers feel the need to stick around,\" says brad chambers, assistant vice-president in"}]