[{"articleID": "2019090216_00143420_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2019-09-02", "url": "https://thelincolnite.co.uk/2019/09/punish-a-muslim-letter-lincoln-white-supremacist-faces-jail/", "content": "Court Joseph Verney 5:16 pm Photo: Rowaida Abdelaziz/Twitter The man from Lincoln behind the \"Punish a Muslim Day\" campaign, who sent over 300 malicious letters to public figures including the Queen, admitted a string of offences in court on Monday. As previously reported, <mark>David</mark> Parnham, 36, of St Andrews Close in Lincoln was arrested by Counter Terrorism Policing North East, supported by Lincolnshire Police in June 2018. At a court hearing at The Old Bailey on Monday, September 2, Parnham, who previously worked at the City of Lincoln Council in a junior administrative role, admitted 15 offences. This included soliciting murder, encouraging crime, bomb and noxious substance hoaxes and sending letters with intent to cause distress. The offences relate to hundreds of letters penned between June 2016 and June 2018. At Monday's hearing a psychiatrist revealed that the defendant did not regret what he had done and did not consider it \"particularly serious\". The court also heard further details about the case ahead of Parnham's sentencing on Tuesday, September 3 including: Parnham had launched waves of malicious letters targeting mosques, politicians and the Queen for more than a decade. He sent letters to mosques and Islamic centres around Britain in February 2007 Parnham sent fake position to the Queen with a letter saying \"The Clowns R Coming 4 You\". The hoax letter to the queen triggered a Chemical Biological Radiological Nuclear (CBRN) response, but Parnham claimed he did not recall writing to the Queen He sent similar notes to the then Prime Minister Theresa May and two bishops, as well as the Home Office, in October 2016. This also contained white power and made an apparent reference to reports of attacks by people dressed as clowns Parnham also sent \"Punish a Muslim Day\" hate mail urging people to earn points by attacking and killing muslims Letters full of white powder were also sent addressed to former PM <mark>David Cameron</mark> and the Tory peer Lord Ahmed of Wimbledon, as well as a number of mosques. The letter to <mark>Cameron</mark> contained the phrase \"Allah is great\". Letters to MPS and mosques included the phrase \"Paki Filth\" Seven letters were intercepted at Sheffield mail centre in July 2016. They were found to contain harmless white powered. A further 11 letters were found to have been delivered In December 2016 he sent a fan letter to Dylann Roof, a white supremacist terrorist who murdered nine people at a church in Charleston, South Carolina In March 2017 letters were sent to addresses around the University of Sheffield campus calling for the extermination of minority racial and religious groups A letter to Berkeley Street mosque in Hull contained a drawing of a sword with a swastika on it cutting someone's head off with the words \"You are going to be slaughtered very soon\". The author signed off as \"Muslim Slayer\" In March 2018 Parnham sent over 300 letters to mosques and public figures calling for attacks in the street Read more The Lincolnite welcomes your views. All comments are reactively-moderated and must obey the house rules. Please stay on topic and be respectful of other readers. Twitter LinkedIn Share by email Send"}, {"articleID": "2013041618_00098120_W", "names": {"Mark Kelly": ["Q10326587", "Q11770303", "Q22261100", "Q28709861", "Q357510", "Q43127604", "Q554312", "Q6768338", "Q6768340", "Q6768341", "Q6768343"]}, "date": "2013-04-16", "url": "http://wandtv.com/story/21986736/skakel-blames-lawyer-in-latest-conn-murder-appeal", "content": "skakel blames lawyer in latest conn. murder appeal meta itemprop = \"datepublished\" content = \"2013-04-16 07:08:34\" > cartel money laundering trial begins in texas prosecutors are set to open their case against a man accused of buying racehorses to hide illegal drug profits for a powerful cartel. a multimillion-dollar horse racing and breeding operation run from an oklahoma ranch was actually a front for a notorious mexican cartel to launder millions of dollars in drug money, prosecutors alleged tuesday at the...meta itemprop = \"datepublished\" content = \"2013-04-16 12:48:40\" > marathon bombing victim, 8, recalled as spirited marathon bombing victim, 8, recalled as spirited the young victim of the boston marathon bombings is being remembered as a vivacious boy who loved to run and climb. neighbors and friends remembered 8-year-old boston bombing victim martin richard on tuesday as a vivacious boy who loved to run, climb, and play sports like soccer, basketball and baseball. meta itemprop = \"datepublished\" content = \"2013-04-16 06:38:29\" > skakel blames lawyer in latest conn. murder appeal kennedy cousin michael skakel is trying to get his 2002 murder conviction overturned by arguing his trial attorney failed to competently defend him. the trial attorney for kennedy cousin michael skakel said tuesday he was reluctant to call experts at times during his murder trial because he worried about a \"rich man's justice perception and we could just buy experts .\" meta itemprop = \"datepublished\" content = \"2013-04-16 16:18:44\" > high court wrestles with indian adoption dispute high court wrestles with indian adoption dispute the supreme court is trying to sort out a wrenching adoption case involving a native american child, a biological father who first renounced any interest in her and adoptive parents who were eventually ordered to...the supreme court is trying to sort out a wrenching adoption case involving a native american child, a biological father who first renounced any interest in her and adoptive parents who were eventually ordered to hand her...meta itemprop = \"datepublished\" content = \"2013-04-16 18:18:48\" > conn. shooting prompts expanded movie ratings conn. shooting prompts expanded movie ratings the motion pictures association of america is changing its rating system to better inform parents about violence in movies. the motion pictures association of america is changing its rating system to better inform parents about violence in movies. meta itemprop = \"datepublished\" content = \"2013-04-16 07:08:40\" > both sides hunt support in background check fight both sides hunt support in background check fight republican opposition is growing to a bipartisan senate plan for expanding background checks for firearms buyers. but both sides are still competing for support for one of the pivotal amendments in the gun control...republican opposition is growing to a bipartisan senate plan for expanding background checks for firearms buyers, enough to put the proposal's fate in jeopardy. but the measure may change as both sides compete for...meta itemprop = \"datepublished\" content = \"2013-04-16 14:28:54\" > boston bombs said to be made from pressure cookers police and federal agents appealed to the public tuesday for amateur video and photos that might yield clues to the boston marathon bombing as the chief fbi agent in boston vowed \"we will go to the ends of the earth\" ...the bombs that ripped through the crowd at the boston marathon, killing three people and wounding more than 170, were fashioned out of pressure cookers and packed with shards of metal, nails and ball bearings to inflict...meta itemprop = \"datepublished\" content = \"2013-04-16 17:38:57\" > defense rests case in jodi arias murder trial defense rests case in jodi arias murder trial jodi arias' defense attorneys have rested their case after about 2 1/2 months of testimony. jodi arias' defense attorneys have rested their case after about 2 1/2 months of testimony. meta itemprop = \"datepublished\" content = \"2013-04-16 17:38:47\" > rural elderly could lose rental assistance rural elderly could lose rental assistance agriculture secretary tom vilsack says 15,000 low-income elderly and disabled people in rural areas could lose rental subsidies because of across-the-board budget cuts that went into effect earlier this year. agriculture secretary tom vilsack says 15,000 low-income elderly and disabled people in rural areas could lose rental subsidies because of across-the-board budget cuts that went into effect earlier this year. meta itemprop = \"datepublished\" content = \"2013-04-16 17:18:46\" > giffords meets with senators on gun buyer checks giffords meets with senators on gun buyer checks wounded former rep. gabrielle giffords and husband <mark>mark kelly</mark> are meeting with the two senators sponsoring a compromise on expanding background checks for gun buyers. boston marathon bombing kills 3, injures over 140 3 dead, more than 140 injured as 2 bombs explode near boston marathon finish line obama: boston culprits to feel \"weight of justice' obama says boston culprits will\" feel weight of justice;' officials call explosions terrorism obama says boston culprits will \"feel weight of justice;' officials call explosions terrorism 3 dead, more than 100 injured as 2 bombs explode near boston marathon finish line senate sponsor of plan to expand background checks for gun buyers says vote too close to call mother of newtown victim steps in for obama, pleas for gun control in white house address kerry to north korea: don't test missile seoul, kerry warns north korea against possible missile test; rejects intel report on nukes army chaplain gets posthumous medal of honor obama awards medal of honor to army chaplain who braved enemy fire, died captive in korea thousands rally across us for immigration bill tens of thousands rally nationwide in support of comprehensive immigration measures gunman holding firefighters killed; 4 hostages ok gunman holding firefighters killed; 4 hostages ok ga. gunman holding 4 firefighters shot dead; hostages injured but ok; swat officer hit associated press vernon, conn. (ap) - the trial attorney for kennedy cousin michael skakel said tuesday he was reluctant to call experts at times during his murder trial because he worried about a\" rich man's justice perception and we could just buy experts. \"skakel's latest appeal trial began tuesday with his former lawyer defending an accusation that he failed to competently defend skakel when he was convicted of murder in 2002. skakel, the 52-year-old nephew of robert f. kennedy's widow, ethel, is serving 20 years to life in prison for the 1975 golf club bludgeoning of greenwich neighbor martha moxley when both of them were 15. skakel argues that during the 2002 trial, attorney michael sherman failed to challenge the state's star witness and obtain evidence pointing to other suspects, did a poor job with jury selection and closing arguments and didn't hire enough investigators and expert consultants. sherman, the first witness to take the stand in rockville superior court in the appeal trial, said he had been confident before the 2002 trial that he would win. sherman previously has said he did all he could to prevent skakel's conviction. attorneys for skakel argue that sherman failed to challenge the state's star witness, gregory coleman, by finding witnesses who later rejected his claim that skakel confessed to the crime. coleman testified that skakel confessed when they attended elan, a reform school in maine in the late 1970s, and said one of a few classmates he named may have heard it. sherman said monday coleman was\" patently unbelievable so i never felt i needed a smoking gun to shoot down mr. coleman's testimony. \"sherman was also pressed by skakel's current attorney, hubert santos, on whether he sought an expert to testify about elan and whether he tried to get block skakel's alleged confessions on the grounds that they were coerced. sherman said he reached out to several people, including an expert on false confessions, but felt the expert wasn't needed because the defense contended skakel never confessed .\" i didn't want to turn it into a rich man's justice perception and we could just buy experts, \"sherman said. sherman also was pressed on why he didn't obtain a police sketch of a man seen walking near the moxley property the night of the murder that skakel's defense contends resembled an early suspect. prosecutors say police concluded the sketch was of a neighbor. sherman said he did file motions seeking any sketches but didn't get them before trial. as skakel's attorney put up the sketch next to a photo of the earlier suspect, sherman acknowledged having the sketch would have been helpful. sherman also said he tried unsuccessfully to get a profile report on the suspect prepared by investigators, saying that also would have been helpful because investigators at the time backed up skakel's alibi. prosecutors say the report was hearsay and not admissible. santos questioned sherman on why he didn't call witnesses to establish that the lead investigator planned to write a book on the case, saying that could have opened a broad new line of defense. sherman said he tried unsuccessfully to find out about the book and acknowledged it could have been used in his defense. prosecutors say many of the issues were rejected in earlier appeals, including the book deal and issues related to the star witness. skakel, who lost a bid for parole last year, is hoping to get out of prison through a writ of habeas corpus arguing he was deprived of his constitutional right to effective legal representation when sherman was his attorney. santos, skakel's current attorney, argues his client's conviction is based on two witnesses of dubious credibility who claimed skakel confessed to the crime. he contends the verdict likely would have been different if sherman had conducted an appropriate investigation, obtained evidence and challenged inappropriate state evidence. prosecutor susann gill counters that skakel's conviction came after more than a dozen witnesses testified that he made incriminating statements, including three direct confessions. skakel has lost two appeals before the connecticut supreme court. 904 south side drive decatur, il 62521 primary phone:"}, {"articleID": "2013051323_00055448_W", "names": {"Rafael Rodriguez": ["Q20993830", "Q2126998", "Q29650178", "Q3417271", "Q7282299"], "Mark Sanford": ["Q11669", "Q18352854", "Q3849548"]}, "date": "2013-05-13", "url": "http://www.salon.com/2013/05/13/monsanto_wins_scotus_case_over_genetically_engineered_soy_beans_ap/", "content": "Charles Ramsey: My past \"helped me become the man I am\" Monsanto wins SCOTUS case over genetically-engineered soy beans WASHINGTON - The Supreme Court has sustained Monsanto Co.'s claim that an Indiana farmer violated the company's patents on soybean seeds that are resistant to its weed-killer. The justices, in a unanimous vote Monday, rejected the farmer's argument that cheap soybeans he bought from a grain elevator are not covered by the Monsanto patents, even though most of them also were genetically modified to resist the company's Roundup herbicide. Justice Elena Kagan says a farmer who buys patented seeds must have the patent holder's permission. More than 90 percent of American soybean farms use Monsanto's \"Roundup Ready\" seeds, which first came on the market in 1996. Monsanto has a policy to protect its investment in seed development that prohibits farmers from saving or reusing the seeds once the crop is grown. Farmers must buy new seeds every year. The case had been closely watched by researchers and businesses holding patents on DNA molecules, nanotechnologies and other self-replicating technologies. But Kagan said the court's holding only \"addresses the situation before us .\" Farmer Vernon Hugh Bowman bought the expensive, patented seeds for his main crop of soybeans, but decided to look for something cheaper for a risky, late-season soybean planting. He went to a grain elevator that held soybeans it typically sells for feed, milling and other uses, but not as seed. Bowman reasoned that most of those soybeans also would be resistant to weed killers, as they initially came from herbicide-resistant seeds too. He was right, and he repeated the practice over eight years. In 2007, Monsanto sued and won an $84,456 judgment. Bowman said he should not be liable, in part, because soybeans naturally sprout when planted. Kagan said the court did not buy that argument. \"We think the blame-the-bean defense tough to credit,\" she said. _ Justices said unanimously that use of the bankruptcy term \"defalcation\" requires an intentional wrong. This came in a case where an Illinois man took improper loans from his father's trust, the first at his father's direction. _ They also unanimously said that federal law does not pre-empt a state law claim against a New Hampshire towing company that towed, stored and then disposed of a car owned by a man who was seriously ill in a hospital. Astronaut Chris Hadfield's greatest hits Is climate change fueling an epidemic? New York terror suspect case could challenge NSA spying Must-see morning clip: Bill Gates plans to eliminate polio and tuberculosis Bloomberg editor apologizes for, explains spying Congress wants to let you unlock your cellphone The Pirate Bay steps in to distribute 3-D gun designs Kickstarter: Stop blaming us for Zach Braff and \"Veronica Mars\" Hidden in immigration reform, vast biometrics plan The future of television: Zombie gamers gone wild Bidding war over Sprint Nextel Corp. heating up State Dept. orders 3-D gun designs be taken offline YouTube launches pay channels with B movies Cybergang loots ATMs of $45m in mere hours A missing poster hangs on a tree outside the Cleveland home of Amanda Berry Wednesday. Berry and two other women, Michelle Knight and Gina DeJesus, made a daring escape this week after being held captive for more than a decade. Elvis <mark>Rafael Rodriguez</mark> and Emir Yasser Yeje pose with a stack of cash allegedly stolen using bogus magnetic swipe cards at ATM machines across New York. On Thursday, state prosecutors identified the pair as members of a worldwide gang that robbed $45 million in a matter of hours by hacking into a database of prepaid debit cards. New Jersey Gov. Chris Christie walks to a podium during the groundbreaking ceremony for the Technology Enhanced Accelerated Learning Center at Essex County Newark Tech in Newark, N.J., Tuesday. Christie made less flattering headlines this week after undergoing a secret stomach surgery to curb his weight. Workers stand outside the Tung Hai Sweater Ltd. factory in Dhaka, Bangladesh, Thursday after a fire broke out in its 11-story building. Eight people were killed in the blaze. Workers rescue a woman trapped for 17 days in the rubble of a garment factory building in Saver, Bangladesh, Friday. The building's collapse was the worst industrial disaster in the country's history, killing more than 1,000 people. Former South Carolina Gov. <mark>Mark Sanford</mark>, left, gives his victory speech in Mt. Pleasant, S.C., after winning back his old congressional seat in the state's first district. Jodi Arias reacts in Maricopa Country Superior Court Wednesday after being found guilty of first-degree murder in the gruesome killing of her one-time boyfriend, Travis Alexander. Arias has subsequently said she wants the death penalty, claiming she'd \"prefer to die sooner than later .\" Credit: AP/The Arizona Republic/Rob Schumacher Ariel Castro stands for his mug shot Thursday at the Cuyahoga County Corrections Center, where he is being held on $8 million bail. The former bus driver is accused of imprisoning three young women and beating them repeatedly over a period of 10 years. Neighbor Charles Ramsey speaks to media near the home on the 2200 block of Seymour Avenue, where three missing women were rescued in Cleveland, on Monday, May 6, 2013. Cheering crowds gathered on the street where police said Amanda Berry, Gina DeJesus and Michele Knight, who went missing about a decade ago and were found earlier in the day. So UK carriers are selling anonymized customer data? That may not be a bad thing. Startup Gridcom uses photons and quantum physics for smart grid security Sponsored post: Cloud and co-location hybridization (live webcast) Lamborghini Egoista: Photos Of The 50th Anniversary Single-Seat Supercar That Will Remain' A Dream' Airbus Shows Off The First A350 XWB, The Boeing 787's Rival [PHOTOS] Bloomberg Snooping Got You Spooked? Here Are 5 Alternatives To The Bloomberg Terminal Bangladesh Garment Industry: H & M Commits To Fire And Building Safety Agreement Copyright? 2013 Salon Media Group, Inc.. Reproduction of material from any Salon pages without written permission is strictly prohibited. SALON? is registered in the U.S. Patent and Trademark Office as a trademark of Salon Media Group Inc. ."}, {"articleID": "2009070104_00010204_W", "names": {"Jeff Kelly": ["Q14950724", "Q6174224"]}, "date": "2009-07-01", "url": "http://fortmyersbeachtalk.com/page/content.detail/id/500889.html", "content": "counterfeit money has re-surfaced and re-circulated on fort myers beach in the form of washed out $5 bills disguised as $50 reprints. local beach businesses - such as tropics bar & grill and the beach whale-have been feeling the pinch when depositing daily money at their respective banks. the targeted spots are out of luck if the money they deposit is counterfeit. \"as soon as we receive a counterfeit bill, basically we have to take the bill and send it out straight to the secret service,\" said gerald mercado of wachovia bank on 2815 estero blvd. \"there's a report we have to fill out. we send out the report with the bill and they send it right back saying they received it .\" the fraudulent bill gets seized until the secret service lets the bank know if the bill is counterfeit or not. \"(the counterfeit process involves) $5 bills that are washed out and a $50 print is placed on top of it,\" said mercado, who has detected $400 in counterfeit money in the past week or two. \"if it's not counterfeit, they'll send the bill back to us and we'll notify the customer .\" bank tellers are familiar with the touch, feel and look of money. they are accustomed to detect fake money...unlike a bartender or server who is more inclined to take a quick look and make change. \"you have to take a second and look at the bill,\" said <mark>jeff kelly</mark>, resident agent in charge at the fort myers secret service office. \"genuine currency will not bleed. if these bills get wet, the ink runs just like a document that is printed. also, check the other security features. the portraits should match on the bill if you hold it up to the light .\" fast food and drink does not always equal fastidious measures. \"that's the whole problem with the economy,\" said <mark>kelly</mark>. \"we live in a fast-pace world where workers are trained to get people in and out. if you look at the $5 bill, you can obviously tell it's counterfeit by the water mark of abraham lincoln and the security strip which is embedded in the paper that says usa 5 on it. the merchant taking the bill makes a decision in a split second. they need to slow down and take a look at the bill .\" <mark>kelly</mark> said a bleaching agent was used on these type of bills. \"this process is kind of different,\" he said. \"most businesses use the counterfeit detecting pen to deter counterfeiting, but the pen won't react to that because it is genuine paper .\" mercado said the counterfeit pen detectors are only 60 percent accurate anyway. an effective pen will detect a yellow or clear mark to indicate a good bill, while a brown or gray mark is a suspected bill. times have changed when making counterfeit bills was deemed an art, according to <mark>kelly</mark>. \"people reprint notes using ink jet technology which accounts for 70 percent of the counterfeit out there,\" he said. \"you used to have to be skilled; an artist. now, with the day and age of the computer and computer printers, anyone can hook it up .\" the local secret service agency receives an average of $3,000 to $4,000 in counterfeit bills every five days. compare that to miami's $35,000 to $40,000 for the same period of time. the majority of $100 bills and larger notes come from overseas. \"only 1/100 of one percent of money is counterfeit,\" said <mark>kelly</mark>. \"that's out of $700 billion. during the civil war, 1 of every 3 bills was counterfeit. then the secret service was established in 1865 to combat counterfeiters .\" we're known for protecting leaders of this country, but we were first created to combat counterfeit money. with our partnerships with local law enforcement, u.s. and state attorneys offices, we track down and investigate every counterfeit bill that gets passed. \"both men have noticed that fort myers beach was targeted recently and offer advice if counterfeit money reaches your hands again .\" if it looks funny, don't take it, \"said mercado .\" most important, if you do receive a counterfeit bill and you know who passed it to you, call 911, \"said <mark>kelly</mark>.\" the local sheriff's office will respond. also, try to jot down suspect information like description and tag number. \"fort myers beach bulletin | fort myers beach observer 19260 san carlos blvd, bldg. c fort myers beach, fl 33931 phone: 239-463-4421"}, {"articleID": "2009110402_00164087_W", "names": {"Jim Ryan": ["Q15498400", "Q23621762", "Q3178937", "Q39070492", "Q6197932", "Q6197934"]}, "date": "2009-11-04", "url": "http://startribune.com/sports/68937342.html", "content": "| sports u's royce white suspended after mall of america arrest by myron p. medcalf, star tribune royce white, last year's mr. basketball and minnesota's top freshman this season, was arrested by bloomington police officers oct. 13 on charges of shoplifting and fifth-degree assault at macy's in the mall of america. gophers coach tubby smith said today that he suspended white indefinitely for an unspecified violation of team rules, but did not elaborate on the reasons for the disciplinary action. a macy's security officer confronted white, who was with three other males, and tried to handcuff the 6-foot-8, 240-pound power forward, who allegedly stole $100 worth of merchandise. according to a police report, white pushed the security guard \"down to the ground two times .\" bloomington officers eventually arrived and arrested white, who was released with a citation. white was also issued a one-year trespass notice by security officials at the mall of america, according to the police. bloomington police cmdr. <mark>jim ryan</mark> said people who commit the crimes that white's been accused of don't usually serve jail time. white, one of the nation's most highly recruited high school players last season, played for basketball-powerhouse hopkins during his senior year of high school after being dismissed from de la salle during his junior season. smith also has suspended senior guard devron bostick, who was not involved in the mall of america situation. smith said they'll be held out of exhibitions thursday (against minnesota duluth) and monday (against minnesota state moorhead) and possibly more, until smith decides they're ready to return to the no. 25-ranked gophers. \"it could be two games. it could be five, six. it could be more,\" smith said, adding: \"it could be 20. it depends on what i want, what i decide .\" bostick is a reserve who averaged 11 minutes per game last season. white is part of a touted recruiting class that includes transfer trevor mbakwe, who is also out indefinitely while a felony aggravated battery charge against him goes through the legal process."}, {"articleID": "2009051208_00040748_W", "names": {"Stuart Clark": ["Q10858359", "Q3107247"], "Mitchell Johnson": ["Q3180617", "Q54569328", "Q6881268"]}, "date": "2009-05-12", "url": "http://cricket365.com/story/0,,6575_5316455,00.html", "content": "subscribe to rss feed macgill: no specialist spinner required more ashes news player profiles retired leg-spinner stuart macgill thinks australia should play to their strengths by using four pacemen and a spinning all-rounder in the upcoming ashes cricket series in england. \"i feel really, really bad for suggesting this but i have always been a loud advocate for picking your best bowlers,\" macgill, a long-time understudy to shane warne as australia's top spin bowling option, told the australian associated press on tuesday. \"the bowling side have to get 20 wickets, full stop .\" macgill said marcus north should be selected at number six to add depth to the batting and bowling, with his part-time orthodox spin supporting the quicks. he said australia's pace bowling depth had rarely been better and needed to be given a chance to work as a unit, a departure from the usual tendency to play a specialist spin bowler in most conditions. \"our bowling stocks in terms of quicks, seamers and swing bowlers at the moment are possibly depth-wise the best of all time,\" said macgill, who took 208 wickets in 44 tests. \"i can't think of another time when we had that depth and that variety available to us .\" that being the case i think it is really fortunate for australia that we have north because what he allows us to do is to maybe play another four bowlers on top of him. \"north made his test debut in australia's recent two-one series win in south africa, when he scored a century and took two wickets in two tests. macgill said north should retain his place as a genuine all-rounder for the ashes opener at cardiff, giving selectors the space to include fast bowlers brett lee, <mark>stuart clark</mark>, <mark>mitchell johnson</mark> and peter siddle in the starting xi. if selectors wanted to stick with a recognised spinner, macgill said nathan hauritz had an edge over bryce mcgain. australia has struggled to find a long-term spin bowling replacement since warne retired as the leading wicket-taker in test cricket after helping reclaim the ashes in 2007 and macgill succumbed to injuries and quit the international arena in 2008. australia will announce their ashes squad next week. the top-ranked australians were upset two-one in 2005 - the last time the ashes series was held in england. post a comment! be the first to post a comment on this story enter comment...character count: 0/1900 david tickner profiles the venue for the second test match between england and the windies, a ground at which the hosts have never lost...the west indies froze at lord's as england took full advantage of the conditions, says sky sports pundit matthew hayden rollicks back into the fray as the ipl team of the week"}, {"articleID": "2012120720_00082129_W", "names": {"Justin Miller": ["Q11979594", "Q16467603", "Q19664585", "Q37584168", "Q3811593", "Q6317911", "Q6317916", "Q6317918"], "Bill Murray": ["Q29250", "Q4910295"]}, "date": "2012-12-07", "url": "http://blog.sfgate.com/dailydish/2012/12/07/jennifer-nettles-becomes-a-mom/", "content": "sugarland singer jennifer nettles has given birth to a baby boy. the star and her husband <mark>justin miller</mark> welcomed their first child, little magnus hamilton, on thursday, just over a week after they celebrated their first wedding anniversary. a statement issued to people.com reads: \"we are so thankful for all the prayers and support and are excited to take some time together as a new family .\" nettles has been taking it easy since wrapping up the your hands tour with bandmate kristian bush earlier this year, prompting speculation about the duo's future .? david letterman stages <mark>bill murray</mark> kidnap leann rimes' husband defends her against ex's laxative allegations horoscopes your daily astrology fix"}, {"articleID": "2019122806_00123788_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-12-28", "url": "http://www.gamereactor.eu/fortnite/?sid=9e4ef3a20d2e9ea2228068c2a2f30e04", "content": "FORTNITE REVIEW. Written by Petter Hegevall on the 6th of April 2018 at 16 \"Fortnite for iPhone is something of a gem in terms of content and its free-to-play structure .\" NEWS. Written by <mark>Sam Bishop</mark> on the 20th of December 2019 at 12:41 The feature has been enabled once again after being taken out, letting you play alongside a friend on the same console. NEWS. Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 09:00 To celebrate the Star Wars collaboration in Epic's game, the pair have partnered for a special something on Thursday. NEWS. Written by <mark>Sam Bishop</mark> on the 11th of December 2019 at 13:06 Epic is allegedly trying to skip the 30% cut Google gets from in-app purchases, while Google is staying firm with its own rules. NEWS. Written by <mark>Sam Bishop</mark> on the 10th of December 2019 at 13:30 Matt Gailer has allegedly asked Epic to stop offering the Pump It Up emote, and Epic wants to make clear that it's not an infringement of trademark or copyright."}, {"articleID": "2014101511_00087983_W", "names": {"Patrick Rooney": ["Q26261010", "Q33522416", "Q50326815"]}, "date": "2014-10-15", "url": "http://news-sentinel.com/apps/pbcs.dll/article?AID=/20141015/NEWS/141019829", "content": "Related Community effort launched to aid Ebola fight in West Africa As Ebola continues to affect various parts of the world, including the United States, many wonder if there is enough help on the way to combat the outbreak and, if so, where donation dollars are going and how to help. In Fort Wayne, the effort to support the Ebola crisis is strong. Various localized efforts, like the church-based campaign by Mike and Kathy Doscek reported in The News-Sentinel today, have connected small local organizations with international relief organizations to help raise money and make an impact. The Doscek's and their church, St. John's Lutheran Church in Lake Township, are partnering with Direct Relief International, a nonprofit, nonpartisan organization that provides medical assistance to people around the world who have been affected by crisis. Tony Morain, vice president of marketing and development of Direct Relief International, said the organization has been working in West Africa for many years addressing the failing healthcare system, and as soon as the first cases of Ebola was reported, they ushered in their local, trained emergency responders and began sending tons of medical supplies. \"Our model is one where we work with locals within the community. There are real people that are responding to the needs in their communities. Then when an emergency happens, they become the immediate emergency responder. We built relationships with these people and then we are able to respond quickly when things are difficult,\" he said. He also said the timeliness is highly consequential when it comes to halting the spread of the virus. \"If collectively we could have gathered enough support and donations two months ago we would not be faced with this challenge. In terms of the problem of this scope, we do not have just one organization that can do it alone. People need to work together. We have been sending ongoing shipments every two weeks, and that includes the largest airlift of supplies to the region to date. As the crisis continues, it becomes more and more difficult to get supplies there. We need to maintain our support but as each day passes, it's more critical,\" he said. Depending on the fundraising organization, money raised will go toward transportation, medical supplies, waste disposal, training and sending emergency response workers. Locally, in addition Doscek campaign, the Catholic Diocese of Fort Wayne-South Bend is encouraging people to donate to the Catholic Relief Services, the U.S. bishops' overseas relief and development agency. Recently, the group has increased its support in affected countries and spent $376,000 toward training volunteers and religious leaders, providing hygiene kits and making household visits in Guinea, Liberia, Sierra Leone and Ghana. For those interested, the US Agency for International Development has put together a list of 37 non-governmental organizations that are working on the Ebola crisis, with direct links for how to donate to them online. Check out the list by visiting: http: //www.cidi.org/ebola-ngos/ #.VBBv7S5dXIV. While local efforts are relatively strong, the worldwide fundraising efforts are lackadaisical. <mark>Patrick Rooney</mark>, associate dean for academic affairs and research at the Indiana University Lilly Family School of Philanthropy in Indianapolis, said, in terms of the fundraising efforts, results have been shockingly small compared to larger scale disasters such as natural disasters. \"For whatever reason, this topic has not captured the same attention. My theory is because very few Americans have contracted the disease and it's mostly centered in West Africa. The mainstream media has been more focused on the American angle and not the total calamity in West Africa,\" he said. And the numbers of the total calamity are staggering. Wednesday, the World Health Organization reported there have been 8,914 cases overall, including the fatal cases. The WHO said it expects this number to top 9,000 by the end of the week. The organization also warned that West Africa could face up to 10,000 new Ebola cases a week within two months, adding that the death rate in the current outbreak has risen to 70 percent. In the U.S., a Dallas nurse who caught Ebola while treating a Liberian patient received a plasma transfusion donated by a doctor who beat the virus. Nina Pham, a 26-year-old nurse, was among 70 staff members at Texas Health Presbyterian Hospital who cared for Ebola victim Thomas Eric Duncan, according to medical records. And health workers have been hit the hardest by the virus, which is spread by contact with bodily fluids like blood, vomit and diarrhea. Doctors Without Borders said 16 of its employees had been infected with Ebola and nine of them have died. Experts note that there's an immediate demand for medical care and education, as well as long-term help dealing with the ripple effects such as orphans and stabilizing an already troubled economy. <mark>Rooney</mark> reiterates that for those wanting to donate, monetary donations to well-known and legitimate organizations and charities are the best option. \"If people want to donate, there are organizations locally, nationally as well as internationally that would be happy to accept donations. This is an opportunity to help something or someone,\" <mark>Rooney</mark> said."}, {"articleID": "2015081319_00211342_W", "names": {"Shane Nicholson": ["Q7488198", "Q7488199"]}, "date": "2015-08-13", "url": "http://rockrivertimes.com/2015/08/13/new-state-law-bans-choke-holds-gives-guidelines-on-body-cameras/", "content": "Crime & Courts News State News August 13, 2015August 13, 2015 <mark>Shane Nicholson</mark> 86 Views 0 Comment By Mary Wisniewski Reuters CHICAGO--Illinois Governor Bruce Rauner signed a law on Wednesday to improve training for police officers, banning excessive use of force including choke holds and creating guidelines on using body cameras. Illinois is among the first states to pass police reform legislation since a fatal shooting of an unarmed black teen by a white police officer in Missouri last year sparked a national debate about police conduct. Other states to pass reform bills include Colorado, Connecticut, Maryland and California, but Illinois' law is one of the broadest and most comprehensive, said Rich Williams, policy specialist for the National Conference of State Legislatures. State Senator Kwame Raoul, a Chicago Democrat who sponsored the bill, said most officers are putting their lives on the line for the public, and this law will help them do their jobs better, while weeding out abuses. \"This is not just about police officer accountability, but restoring public confidence so police can do their jobs .\" - State Senator Kwame Raoul \"This is not just about police officer accountability, but restoring public confidence so police can do their jobs,\" Raoul said in an interview. \"You have a heightened level of cooperation when you have a heightened level of confidence .\" The Illinois bill establishes rules for racial sensitivity training and reporting requirements for officers who make stops and arrests. The body camera portion of the bill establishes standards on when officers need to have cameras on and how long recordings should be retained. The bill also calls for setting up a database to keep track of when a police officer quits while under investigation, so he or she is not hired by another department. The bill also makes clear that police officers cannot stop another person from recording them while they are performing their duties. \"Today we are taking steps to strengthen the relationship between our law enforcement officers and the public they protect,\" Rauner said in a statement."}]