[{"date": "2015-07-23", "url": "http://stljewishlight.com/news/world/article_b9ccc6a4-ac6d-52b7-9b99-748f75083052.html", "content": "http: //www.jta.org The Global Jewish News Source Tue, 21 Jul 2015 17:38:36 +0000 en-US hourly 1 http: //wordpress.org/? v=4.1.1 http: //www.jta.org/2015/07/21/news-opinion/world/european-maccabi-games-to-play-at-olympic-venues-built-by-nazis http: //www.jta.org/2015/07/21/news-opinion/world/european-maccabi-games-to-play-at-olympic-venues-built-by-nazis #comments Tue, 21 Jul 2015 17:33:47 +0000 http: //www.jta.org/? p=1033429 The quadrennial Jewish sports event for the first time is coming to Germany, site of the ’36 Olympics that banned some Jews from competing .]]> Adolf Hitler, second from left, watching the Olympic Games in Berlin with the Italian crown prince, left, August 1936. (Fox Photos/Getty Images) BERLIN (JTA)--They are roaring through Europe, raising dust as they go: Jewish bikers bearing an Olympic-style torch all the way from Israel to this German city. Next week, 11 core riders will pull their steel steeds into Berlin's famous outdoor amphitheater, the Waldbuehne, to help usher in the 14th European Maccabi Games--the first ever in Germany--at a venue built by the Nazis for the 1936 Olympics. Other competitions will be held at the Olympic Stadium here, where Hitler presided over the opening of the games that year. The riders are following in the treads of the Maccabiah Riders, who rode through Europe in the early 1930s to promote the games then being held under British mandate in Palestine. The July 28 opening ceremony, which will feature remarks by German President Joachim Gauck and a concert featuring Matisyahu, Dana International and others, will usher in 10 days of sports, parties, a Limmud Germany learning event and more. Some 2,300 Jewish athletes from 36 countries will take part, cheered on by fans bused in from across the country by the Central Council of Jews in Germany. And the sports venues, including Berlin's Olympiastadion, will be open to all, free of charge and under heavy security. Elen Katz and Catherine Lurie-Alt participating in a motorcycle rally from Israel to Berlin for the opening of the European Maccabi Games. (Yosef Alony) Athletes will compete in 19 sports, as well as a few exhibition games pitting Jewish athletes against German soccer and basketball stars. On July 31, they will try to break the Guinness World Record for the largest kiddush ever. The European Maccabi Games grew out of the Maccabi movement, which traces back more than a century to Turkey when Jews, then shut out of local sporting clubs, founded the Israel Gymnastic Club in 1895. Jews elsewhere followed suit. The first European Maccabi Games were held in Prague in 1929, and the second a year later in Antwerp. But with the rise of the Nazis, Jewish sports associations were banned. Germany's Makkabi Club was reinstated only 50 years ago. In 1969, the quadrennial competition resumed, alternating every two years with the Maccabiah Games in Israel. Bringing the European Maccabi Games to Germany was a herculean feat, says Alon Meyer, head of Makkabi Germany. \"People told me they never could imagine setting foot in Germany because their parents and grandparents were sent away from there,\" said Meyer, 41, a Frankfurt businessman whose father fled Nazi Germany for Palestine. \"Now these people are coming back to see the changes [and take part in] the biggest Jewish event ever held on European ground .\" The Berlin Olympiastadion was built for the 1936 Olympic Games. (<mark>Scott</mark> Heavey/Getty Images) The change to which Meyer referred is the dramatic growth in Germany's Jewish population. Only a few thousand of Germany's prewar Jewish population of 500,000 remained in Germany after the Holocaust. Today there are some 240,000 Jews here, most of them immigrants from the former Soviet Union. Membership in Jewish sports clubs has grown, too. Meyer wanted the competition to be held in the Olympic Stadium, those same stone halls where many Jewish athletes, though not all, were banned in 1936. \"They came all the way to Germany and in the morning they got a call, they were not allowed to run. They found out right before the race,\" said Steven Stoller, 64, of New Jersey, a distant cousin of the late Jewish-American sprinter Sam Stoller, who was told he could not compete by Avery Brundage, then president of the U.S. Olympic Committee. \"I wanted to come to Berlin for my children, my future grandchildren, to have the story live on,\" Stoller said. Jed Margolis, the executive director of Maccabi USA, will fly in from Philadelphia to cheer some 200 participating American athletes aged 15 to 85. \"At one point in life I would say,\" I will never go to Germany or buy a German product, \"' Margolis said .\" Yet there is a vibrant and growing Jewish community there. We want to support them and at the same time teach our next generation \"about what happened there. Security will be tight for the event, in the stadium and beyond. Berlin announced the creation of a new digital reporting system for anti-Semitic incidents just in time for the games .\" Security is the No. 1 priority, \"said Lena van Hooven, spokeswoman for the games. But Danny Maron is not worried. He and the other Jewish bikers have been traveling through Eastern Europe with Israeli flags attached to their bikes .\" We have no fear at all, \"Maron said .\" We are very proud. \"Maron's father, Yoram, a Holocaust survivor, told JTA that he wanted\" to show the whole world that after all the death, we are still alive, and we keep moving. \"At each stop, from Athens to Romania to Krakow, more Jewish bikers have woven into the pack. The Maccabi torch itself rides in a specially built case carried by Greek biker Kobi Samuel, 48 .\" Two of our riders are descendants of actual Maccabi riders of the 1930s, nine are descendants of Holocaust survivors, and two of our bikers are actual survivors aged 73 and 78, \"said filmmaker Catherine Lurie-Alt, who snagged Jewish talk show host <mark>Larry King</mark> as the narrator for her documentary about the motorcycle rally .\" This is where it all started, \"Lurie-Alt said .\" We are going through communities where Jewish populations were decimated, on our way to Berlin, where they will enter that stadium with jubilation and joy. \"]]> http: //www.jta.org/2015/07/21/news-opinion/world/european-maccabi-games-to-play-at-olympic-venues-built-by-nazis/feed 0 http: //www.jta.org/2015/07/21/news-opinion/politics/dermer-makes-civil-rights-appeal-to-black-dems-and-other-iran-deal-politics http: //www.jta.org/2015/07/21/news-opinion/politics/dermer-makes-civil-rights-appeal-to-black-dems-and-other-iran-deal-politics #comments Tue, 21 Jul 2015 17:24:49 +0000 http: //www.jta.org/? p=1033749 Jeb Bush and <mark>Scott Walker</mark> debate how quickly to bomb Iran and a Democrat tries to use the Iran deal to unseat a Republican Senator .]]> Rep. Charlie Rangel, seen in New York on April 8, 2015, said he had a long talk with Israel's U.S. ambassador last week. (Andrew Burton/Getty Images) It's too early for blow-by-blow coverage of federal election campaigns, right? Maybe not, with the fight for the Iran deal getting very, very, very political. Republican presidential candidates Jeb Bush and <mark>Scott Walker</mark> are tussling, the Weekly Standard reported, over whether contemplating a strike on Iran in the first week of one's presidency is wise. (Bush thinks it isn't .) Rep. Tammy Duckworth, D-Ill ., is using Sen. Mark Kirk's criticism of the Iran deal in an ad for her bid to unseat the Illinois Republican. At least one Democrat isn't worried that her support of the deal makes her vulnerable. Ron Dermer, Israel's ambassador to Washington, has been lobbying the Congressional Black Caucus to oppose the Iran deal, Foreign Policy reported. He's been persistent, and welcomed, but less than successful .\" Is that the Republican guy from Florida? \"Rep. Charles Rangel, D-N.Y., reportedly chortled when asked if he had met with Dermer .\" We had a long talk. \"Rangel added that during his meeting with Dermer, the ambassador made references to Jewish support for the civil rights movement in the 1960s--a history Rangel didn't see as relevant .\" They certainly have the \"we were together in 1961' story,\" said Rangel. \"It's not germane to this .\" ]]> http: //www.jta.org/2015/07/21/news-opinion/politics/dermer-makes-civil-rights-appeal-to-black-dems-and-other-iran-deal-politics/feed 0 http: //www.jta.org/2015/07/21/news-opinion/united-states/jewish-run-childrens-charity-in-n-y-accused-of-fraud http: //www.jta.org/2015/07/21/news-opinion/united-states/jewish-run-childrens-charity-in-n-y-accused-of-fraud #comments Tue, 21 Jul 2015 17:21:50 +0000 http: //www.jta.org/? p=1034035 The National Children's Leukemia Foundation, founded and run by a Brooklyn Jewish man from his basement, reportedly collected $9.7 million from 2009 to 2013 and paid out $57,451 in assistance to patients .]]> (JTA)--New York state is suing to shut down a charity for children with leukemia run by a Brooklyn Jewish man accused of raising money fraudulently. A petition filed in state Supreme Court in Brooklyn on Monday requested the closing of The National Children's Leukemia Foundation, which was founded by Zvi Shor and run from his basement. The foundation collected $9.7 million from 2009 to 2013, The New York Times reported, citing court documents. Some 80 percent of the money went to telemarketing and direct-mail fundraising campaigns, and only $57,451 was paid out in \"direct cash assistance to leukemia patients,\" the Times report said. The state's attorney general is asking for the recovery of the money. The foundation's website has been taken down and its phone number disconnected, according to the Times. Shor was president of the foundation until his resignation in 2010 following revelations that he had been convicted of bank fraud in 1999. The foundation's accountant, Yehuda Gutwein, took over as president, though Shor continued to run things, according to the court filings. Shor established the foundation in 1991 after losing a son to leukemia, the court filing said, according to the Times. He paid himself $595,000 in salary and $600,000 in deferred compensation from 2009 to 2013, and a lifetime pension of more than $100,000 a year. The foundation fraudulently claimed to have a bone marrow registry and cancer research building in Israel. It also promoted a Make a Dream Come True program, arranging trips to places like Disney World for children with cancer, which apparently did not take place, investigators said in court filings. According to the petition, the foundation also transferred $655,000 to an Israeli research organization .]]> http: //www.jta.org/2015/07/21/news-opinion/united-states/jewish-run-childrens-charity-in-n-y-accused-of-fraud/feed 0 http: //www.jta.org/2015/07/21/news-opinion/politics/national-review-calls-bernie-sanders-a-national-socialist http: //www.jta.org/2015/07/21/news-opinion/politics/national-review-calls-bernie-sanders-a-national-socialist #comments Tue, 21 Jul 2015 16:11:45 +0000 http: //www.jta.org/? p=1033751 The right-wing magazine's <mark>Kevin Williamson</mark> acknowledged that describing a Jew whose father's family perished in the Holocaust as a Nazi has its problems, but found he had no choice .]]> Sen. Bernie Sanders speaks to the crowd at the Phoenix Convention Center, July 18, 2015 in Phoenix, Arizona. (Charlie Leight/Getty Images) Democratic presidential candidate Bernie Sanders has never been shy about calling himself a socialist, a term that most other American pols, however liberal their stripe, take pains to abjure. National Review's <mark>Kevin Williamson</mark> has been tracking Sanders' campaign for the nomination, and he said in an article Monday that \"socialism\" should be modified by \"national .\" Yes, that national socialism. \"L’Internationale, my patootie. This is national socialism,\" he said. Trying very hard to get from Ben & Jerry's Ice Cream to Hitler's Beer Hall Putsch, <mark>Williamson</mark> cited Sanders' Made-in-the-USA jobs rhetoric, although he never quite explained how this arrives at race ideology, never mind genocide. <mark>Williamson</mark> acknowledged that describing a Jew whose father's family perished in the Holocaust as a Nazi has its problems, but found he had no choice, saying: \"He is, in fact, leading a national-socialist movement, which is a queasy and uncomfortable thing to write about a man who is the son of Jewish immigrants from Poland and whose family was murdered in the Holocaust. But there is no other way to characterize his views and his politics .\" There's not a lot else of Sanders in the lengthy piece. There is a lot of what <mark>Williamson</mark> does not like, including Des Moines, Iowa, Nirvana and declarative sentences. \"Here in a dreary, rundown, hideous little corner of Des Moines dotted with dodgy-looking bars and dilapidated groceries advertising their willingness to accept EBT payments sits Drake University, where Bernie is speaking at Sheslow Auditorium, a kind of mock church--spire, stained glass, double staircase leading down to the podium for communion--that is the perfect setting for the mock-religious fervor that the senator brings to the stump. He is a clumsy speaker, pronouncing\" oligarchy'--a word he uses in every speech--as though he were starting to say \"à la mode .\" He's one of those rhetorical oafs whose only dynamic modulations are sudden shifts in volume--he's the oratorical equivalent of every Nirvana song ever written--and he is undisciplined, speaking for an hour and then pressing right through, on and on, feeling the need to check off every progressive box, as though new orbiters in the Bernieverse might think him a Rick Santorum--level pro-lifer if he didn't lay his pro-choice credentials out on the table at least once during every speech, \"he said. Should Sanders take offense? Perhaps not. On Twitter, New Republic senior editor Jeet Heer delved into how National Review treated national socialism and its discontents in the distant past. 1. Since National Review saw fit to call Bernie Sanders a Nazi, let's take a trip down memory lane .--Jeet Heer (@ HeerJeet) July 21, 2015]]> http: //www.jta.org/2015/07/21/news-opinion/politics/national-review-calls-bernie-sanders-a-national-socialist/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/rivlin-to-host-rabbis-in-unity-building-study-session http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/rivlin-to-host-rabbis-in-unity-building-study-session #comments Tue, 21 Jul 2015 15:17:23 +0000 http: //www.jta.org/? p=1033877 The Orthodox representative changed after the original participant backed out .]]> JERUSALEM (JTA)--Israeli President Reuven Rivlin will host a study session with rabbis from various streams of Judaism in a unity-building effort. Thursday's event in Jerusalem will mark the upcoming fast of the Ninth of Av. The Orthodox representative who originally had agreed to participate backed out, Haaretz reported. Rabbi Uri Sherki told Haaretz he would not attend for\" technical reasons. \"A day earlier, however, Sherki told the same newspaper that he was under pressure from some in the Orthodox community to cancel his appearance. He also was quoted on an Orthodox website as calling Reform Jews\" heretics, \"Haaretz reported. Rabbi <mark>Benny Lau</mark>, the cousin of Rabbi David Lau, the Ashkenazi chief rabbi of Israel, agreed to appear in Sherki's place. Several incidents in recent weeks have caused tension among the Jewish streams and the government .\" At this important time, the Office of the President, together with the Jewish People Policy Institute, has initiated an event to bring together the communities of the Jewish people in an atmosphere of mutual respect, and of learning and studying, to discuss the importance of Jewish unity and the need to work together to build understanding and respect, \"said a statement from the President's Office announcing the event. The timing of the event, according to the statement, comes during\" the Three Weeks, and indeed the Nine Days, and nearing the Ninth of Av, during which time we commemorate the destruction of the Temple and Jerusalem, among other terrible calamities which have befallen the Jewish people. Tragedies linked throughout Jewish tradition with the erosion of Jewish unity and respect for our fellow man. \"]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/rivlin-to-host-rabbis-in-unity-building-study-session/feed 0 http: //www.jta.org/2015/07/21/news-opinion/united-states/timeline-to-a-deal-irans-nuclear-push-has-been-decades-in-the-making http: //www.jta.org/2015/07/21/news-opinion/united-states/timeline-to-a-deal-irans-nuclear-push-has-been-decades-in-the-making #comments Tue, 21 Jul 2015 14:52:50 +0000 http: //www.jta.org/? p=1033389 There were two tracks to a nuclear deal with Iran: The Islamic Republic's race to a weapon and efforts by Israel and the United States to stop a weapon through sanctions .]]> A view of the reactor at the Russian-built Bushehr nuclear power plant in southern Iran as the first fuel is loaded, Aug. 21, 2010. (IIPA via Getty Images) WASHINGTON (JTA)--The road to the Iran nuclear deal did not start in November 2013, when the major powers and Iran launched formal talks. It did not begin in 2010, when the U.S. Congress passed the far-reaching Iran sanctions and the U.N. Security Council approved its own set of sanctions. Rather, the road to the deal secured last week, which will limit Iran's uranium enrichment in exchange for the lifting of international sanctions, began decades earlier. Here are some highlights on the way to the deal that now faces Congress's yea or nay. Mid-1950s to late 1970s With U.S. backing, the shah of Iran develops nuclear technology as an alternative energy source. Toward the end of his reign, Mohammad Reza Shah Pahlavi begins to look into nuclear weapons capacity. It is not clear whether it is with the knowledge or support of the United States. 1979 A revolution overthrows the shah in January and Ayatollah Ruhollah Khomeini returns to Iran the following month--a week after promising to preserve the rights of Iranian Jews. His aides tell JTA that they may renew ties with Israel. But in May, the new regime executes Habib Elkanian, a former leader of the Jewish community, prompting calls from U.S. Jews for the imposition of sanctions on the regime. On Nov. 4, Iranian students, with the regime's blessing, take hostage 52 Americans employed by the U.S. Embassy, and 10 days later, President Jimmy Carter freezes $12 billion in Iranian U.S. assets--the first U.S. sanctions imposed on the regime. Nearly half of the blocked assets are in the overseas branches of U.S. banks. 1980s Iran restarts its civilian nuclear program in 1984 and Iranian officials meet in 1987 with A.Q. Khan, the father of the Pakistani nuclear bomb, to discuss weaponizing their program. Meanwhile, Israel sells Hawk missiles to Iran in the mid-1980s at the behest of the United States as part of a complicated arms-for-hostages deal that culminates in a scandal for the administration of President Ronald Reagan. 1990 to 1992 Israel confirms importing oil from Iran in 1990, despite the regime's declared hatred of the Jewish state. By 1992, just-elected Prime Minister Yitzhak Rabin, who had authorized the sale of arms to Iran when he was defense minister, is concerned about intelligence that Iran is considering a nuclear weapon. Israel's political parties, left to right, share concern at the prospect of a nuclear Iran and the government launches an effort to persuade other countries to isolate Iran. Rabin, during meetings with American Jewish leaders, urges them to leave Israeli-Arab relations to the Israelis but asks them to take on Iran. 1994 to 2000 The 1994 bombing of the AMIA Jewish community center in Buenos Aires, Argentina, kills 85 and spurs calls to isolate Iran. (The Iran-backed terrorist group Hezbollah is suspected in the terror attack .) In 1995, Russia signs a deal with Iran to develop a civil use nuclear reactor at Bushehr, in southern Iran. The American Israel Public Affairs Committee, working closely with the office of then-Sen. Alfonse D’Amato, R-N.Y., begins drafting legislation in 1994 targeting third parties dealing with Iran. <mark>Steve Grossman</mark>, then the president of AIPAC and a friend of President Bill Clinton and first lady Hillary Clinton, spends a cool evening on a White House balcony after a dinner party in the spring of 1995 smoking cigars and attempting to persuade the president to use his executive powers to impose sanctions. In May 1995, Clinton issues an executive order banning investment in Iran, and in 1995 and 1996, Congress passes and Clinton signs into law the Iran Libya Sanctions Act, which targets foreign entities doing business with Iran's energy sector. Soon, however, Clinton is faced with tough European opposition to the sanctions. He is also encouraged by the election of a relatively moderate Iranian president, Mohammed Khatami. Clinton begins to waive some sanctions, disappointing some in the pro-Israel community. 2001 to 2008 President George W. Bush sustains Clinton's delicate engagement with the Khatami government, especially after the United States invades Afghanistan following the Sept. 11, 2001, terrorist attacks. (The U.S. and Iran have a shared enemy in al-Qaida .) However, Bush includes Iran in his\" axis of evil \"State of the Union speech in 2002 alongside Iraq and North Korea. Later in 2002, the Mujahedeen Khalq Iranian dissident group reveals that Iran is enriching uranium in Natanz and building a heavy water reactor in Arak. Bush, however, is preoccupied with plans to invade Iraq and does not devote much attention to Iran. The Khatami government, rattled by the initial success of the 2003 Iraq invasion, makes overtures to the international community to discuss placing limits on its nuclear activities in exchange for greater engagement. Bush does not want to directly negotiate with Iran until it ceases uranium enrichment, but he does consult closely with three European nations, Britain, France and Germany--the E3--that enter into talks with Iran. The talks are buried with the election in 2005 of a hard-line Iranian president, Mahmoud Ahmadinejad. The Bush administration leads the passage in the U.N. Security Council of resolutions targeting Iran's nuclear sector and arms sales, as well as Iranian individuals. Under Bush, the U.S. Office of Foreign Assets Control builds an architecture of sanctions that includes persuading third parties not only to end dealings with Iran's energy sector, but with its financial sector as well. In a February 2006 meeting with Jewish leaders, Condoleezza Rice, the U.S. secretary of state, for the first time intimates that the United States would contemplate a military strike to keep Iran from going nuclear. However, two years later, in 2008, Israeli Prime Minister Ehud Olmert fails to get the go-ahead from Bush he believes he needs to launch an Israeli strike. 2009 to 2015 Newly elected President Barack Obama in March 2009 offers Iran's people and leaders a message for Nowruz, the Iranian New Year, saying\" greater opportunities for partnership and commerce \"are available but they\" cannot be reached through terror or arms, but rather through peaceful actions that demonstrate the true greatness of the Iranian people and civilization. \"In April 2009, the United States joins talks between Iran and five other major powers: Britain, France, Russia, China and Germany. But Ahmadinejad is reelected in June of that year, and in September, Obama joins other world leaders in revealing the existence of a second uranium enrichment plant embedded deep in a mountain in Fordow, near the holy city of Qom. The Qom revelations accelerate legislation in Congress that would toughen Iran sanctions, dropping the threshold for banned investment in the energy sector from $20 million to $1 million in some cases and expanding bans to Iran's financial sector. The legislation passes in 2010. Meanwhile, the same year, Obama's team leads the passage in the U.N. Security Council of expanded sanctions that target Iran's energy and financial sectors and restrict arms sales to the country. In subsequent years, the intelligence agencies of Israel and the United States disrupt Iran's enrichment capacity through a computer virus, Stuxnet, and a number of Iranian nuclear scientists are assassinated, reportedly at Israel's behest. In September 2012, Israeli Prime Minister Benjamin Netanyahu, in a dramatic (and much mocked) United Nations speech, illustrates with a cartoon bomb diagram Israel's version of the\" red line \"that cannot be crossed: Enough uranium enriched at 20 percent, a step before weaponization at 90 percent, to power a bomb. Netanyahu predicts that Iran could arrive at the red line within a year. In June 2013, Iranians elect a relative moderate president, Hassan Rouhani. Just prior to the election and anticipating such an outcome, the United States begins secret negotiations with Iran to set up talks toward sanctions relief in exchange for nuclear restrictions. In November of that year, they arrive at a formula and announce a deal that ends Iran's enrichment of uranium beyond civilian levels. In January 2014, the major powers and Iran launch talks aimed at an agreement, and an increasingly wary Netanyahu mounts an effort to oppose what he sees as a dangerous deal, culminating in his March 2015 speech to Congress, organized with Republicans and without the knowledge of the White House. In April of this year, the sides reach the outline of an agreement in Lausanne, Switzerland. In May, Congress passes a law that will allow it to disapprove of a deal within a two-month period. On July 14, after multiple extensions of a June 30 deadline, Iran and the six world powers arrive at a comprehensive agreement. Two days later, 172 Republican co-sponsors in the U.S. House of Representatives introduce a resolution of disapproval .]]> http: //www.jta.org/2015/07/21/news-opinion/united-states/timeline-to-a-deal-irans-nuclear-push-has-been-decades-in-the-making/feed 0 http: //www.jta.org/2015/07/21/news-opinion/world/british-jewish-group-condemns-criticism-of-queen-over-nazi-salute http: //www.jta.org/2015/07/21/news-opinion/world/british-jewish-group-condemns-criticism-of-queen-over-nazi-salute #comments Tue, 21 Jul 2015 13:50:19 +0000 http: //www.jta.org/? p=1033819\" It's really important for us not to judge this event with hindsight, \"the president of the Board of Deputies of British Jews said .]]> (JTA)--A major British organization condemned criticism of Queen Elizabeth II in the wake of the release of a video showing her giving a Nazi salute at the age of 7. The president of the Board of Deputies of British Jews, Jonathan Arkush, on Sunday praised the royal family for its close relationship with the Jewish community .\" I don't think any criticism of a 7-year-old child would be remotely appropriate and I don't intend to make any, \"Arkush said at a meeting of the board, the Jewish Chronicle reported over the weekend, following the publication of the video on the website of The Sun and on the tabloid's front page .\" It's really important for us not to judge this event with hindsight. Obviously the Nazi salute now carries horrible memories and bitterness for us, but I do not think for one moment that it would be appropriate for me to suggest that the full horror of Nazi Germany was known at that point. \"Buckingham Palace reportedly has ordered an investigation into the publication of the images, including how The Sun obtained the footage. In the video, the young princess and her sister Margaret, 3, are shown dancing and smiling as the future British <mark>king</mark>, Edward VIII, instructs his nieces how to perform the Nazi Heil Hitler salute. Some historians have accused Edward of being sympathetic to Adolf Hitler's regime; Edward abdicated the throne in 1936 to marry divorcee Wallis Simpson. Queen Elizabeth, 89, is widely popular in Britain and it is not believed that the images will damage her reputation, according to reports. Last month, the queen met with survivors and liberators in a visit to Bergen-Belsen, her first to a Nazi concentration camp .]]> http: //www.jta.org/2015/07/21/news-opinion/world/british-jewish-group-condemns-criticism-of-queen-over-nazi-salute/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/eu-foreign-ministers-call-on-israel-to-halt-settlements-and-transfers http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/eu-foreign-ministers-call-on-israel-to-halt-settlements-and-transfers #comments Tue, 21 Jul 2015 13:10:03 +0000 http: //www.jta.org/? p=1033799 The ministers also called for the creation of an international support group to help move along the peace process .]]> JERUSALEM (JTA)--The foreign ministers of the European Union called on Israel to halt settlements and policies including\" forced transfer. \"Their statement on the Middle East peace process was released Monday at the end of a monthly European Union Council meeting in Brussels. It reiterates\" strong opposition to Israel's settlement policy and actions taken in this context, such as building the separation barrier beyond the 1967 line, demolitions and confiscation--including of EU funded projects--evictions, forced transfers including of Bedouins, illegal outposts, settler violence and restrictions of movement and access. \"More specifically, the statement\" calls on Israeli authorities to halt plans for forced transfer of population and demolition of Palestinian housing and infrastructure in the Sussiya and Abu Nwar communities. \"Israel's Foreign Ministry took umbrage at the use of the term\" transfer, \"but said it would raise the issue directly with the European Union, Haaretz reported. Sussiya is located near Hebron, and is next to an Israeli settlement by the same name. It is in Area C of the West Bank, which is solely under Israeli control. Israel plans by the end of the month to demolish the homes in Sussiya--home to about 340 Palestinians--that were built without permission, and relocate the residents to an area controlled by the Palestinian Authority. EU representatives visited the village last month. Abu Nwar is an illegally built Bedouin community. Israel plans to move its residents to a planned community in the country's south. The 28 EU ministers called for\" an increased common international effort \"in order to secure\" a just and lasting peace. \"The statement asks for the creation of an international support group to help move along the peace process, for which the ministers state that there is\" no alternative to a negotiated two-state solution. \"The statement also calls for an easing of restrictions on Palestinians in the West Bank and for a full opening of Gaza border crossings with Israel. It also\" urges all Palestinian factions to find common ground, based on non-violence and reconciliation, and to work together to address the needs of the Palestinian population. \"]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/eu-foreign-ministers-call-on-israel-to-halt-settlements-and-transfers/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/knesset-lawmakers-approve-law-against-rock-throwers http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/knesset-lawmakers-approve-law-against-rock-throwers #comments Tue, 21 Jul 2015 11:55:18 +0000 http: //www.jta.org/? p=1033793 Rock throwers can now be sentenced to up to 20 years in jail if it is proven that they intended to cause injury .]]> JERUSALEM (JTA)--Israeli lawmakers voted to impose longer jail terms on people caught throwing rocks at civilian cars and roads. The Knesset passed the bill on its second and third readings on Monday night by a vote of 69 to 17. Under the new law, rock throwers can be sentenced to up to 20 years in jail if it is proven that they intended to cause injury, and 10 years if harmful intent is not proven. Also, a prison sentence of five years can be levied for throwing a rock at a police officer or police car .\" Today justice has been done, \"said Justice Minister Ayelet Shaked of the Jewish Home party after the vote .\" For years terrorists have been evading punishment and responsibility. The tolerance shown to terrorists ends today. A stone thrower is a terrorist, and only a proper punishment can be a deterrent. \"The law does not cover the West Bank, which is under Israeli military law, and where Palestinians frequently throw rocks at Israeli civilian cars. The Arab Joint List party in a statement called the new law a form of\" collective punishment \"and said it was meant to\" oppress the Palestinians' civilian and popular struggle. \"At least three Israelis, including a baby, have been killed in the West Bank after rocks were thrown at the cars they were riding in, and others have been seriously injured. Earlier this month, a Palestinian teen was shot in the back and killed after throwing a rock at an army vehicle. Col. Yisrael Shomer said he felt threatened by the teen in the July 3 incident near the West Bank city of Ramallah, but a surveillance camera showed that the teen was shot as he ran away. The vehicle's windshield was shattered in the attack .]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/knesset-lawmakers-approve-law-against-rock-throwers/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/pilot-louis-lenart-called-the-man-who-saved-tel-aviv-dies-at-94-2 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/pilot-louis-lenart-called-the-man-who-saved-tel-aviv-dies-at-94-2 #comments Tue, 21 Jul 2015 10:56:47 +0000 http: //www.jta.org/? p=1033774 Lenart led an air attack with four airplanes on the Egyptian advance columns during Israel's War of Independence, causing them to retreat .]]> (JTA)--Louis (Lou) Lenart, an American fighter pilot hailed as\" The Man Who Saved Tel Aviv \"during the opening days of Israel's War of Independence, has died. Lenart died Monday at his home in Raanana, Israel, of heart and kidney failure. He was 94. His funeral will be held Wednesday at the Kefar Nachman Cemetery in Raanana. High-ranking officers of the U.S. Marine Corps and Israeli Air Force are expected to attend, according to Lenart's wife, Rachel Nir. Lenart was born Layos Lenovitz, the son of Jewish farmers, in a small Hungarian village near the Czech border. To escape the prevalent anti-Semitism, the family moved to the United States when Lenart was 10. His parents settled in the Pennsylvania coal-mining town of Wilkes-Barre, where he was the target of anti-Jewish taunts. At 17, Lenart enlisted in the U.S. Marines and after 18 months of infantry training talked his way into a flight school, where he was almost given up for dead after a midair collision during training. Lenart saw action in the Battle for Okinawa and other Pacific engagements. Discharged at war's end with the rank of captain, he learned that 14 relatives in Hungary had been killed in Auschwitz. It took little additional incentive for the ex-Marine to join the clandestine effort to smuggle war surplus planes into the nascent State of Israel in early 1948. When Israel declared its independence on May 14, 1948, the Israeli Air Force consisted of four bastardized Czech versions of the German Messerschmitt. On May 29 of that year, large Egyptian forces had advanced to within 16 miles of Tel Aviv and Israel decided to gamble its entire air force in an attack on the Egyptian advance columns. As the most experienced pilot, Lenart led the attack, backed by Ezer Weizman, later president of Israel, as one of the other three pilots. The stunned Egyptian troops, who had been assured that the Israelis had no aircraft, stopped their advance and retreated. Subsequent news reports hailed Lenart as\" The Man Who Saved Tel Aviv. \"After the war, Lenart participated in the airlift of Iraqi Jews to Israel, was a pilot for El Al Airlines and produced six feature films, including\" Iron Eagle \"and\" Iron Eagle II. \"One of his collaborators was Hollywood screenwriter <mark>Dan Gordon</mark>, who emphasized that the headline was no exaggeration .\" In many ways, Lou was what Lafayette and Nathan Hale were to the American Revolution, \"<mark>Gordon</mark> said .\" If it hadn't been for Lou and his three comrades, Tel Avivians would be speaking Arabic today. \"Michael Oren, Israel's former ambassador the United States and now a Knesset member, described his friend some years ago as\" a loving father, loyal friend, champion of Israel. Lou Lenart is an inspiration not only for Jews, but for all people who have suffered oppression and have had to struggle for their liberty and defense. \"Along with his wife, Lenart is survived by a daughter, Michal, and a grandson .]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/pilot-louis-lenart-called-the-man-who-saved-tel-aviv-dies-at-94-2/feed 0 This entry passed through the Full-Text RSS service - if this is your content and you're reading it on someone else's site, please read the FAQ at fivefilters.org/content-only/faq.php #publishers.", "articleID": "2015072303_00146037_W", "names": {"Steve Grossman": ["Q2033191", "Q7612724"]}}, {"date": "2015-07-23", "url": "http://brecorder.com/top-news/108-pakistan-top-news/249098-rain-emergency-declared-in-karachi.html", "content": "Rain emergency declared in Karachi Thursday, 23 July 2015 18:47 Posted by Asfia Afzal 10 In view of the expected heavy rains in Karachi, the District Municipal Corporation (DMC), Karachi South, has declared rain emergency. This was announced by the Administrator of DMC Karachi South, Mir Farooq Langov. He said that the rain emergency would be for the protection from any losses during the expected downpour in the area, draining out of the accumulated water and addressing the grievances of the people. An emergency control room has been established at the DMC South office located at its central office near Haqqani Chowk on Rafiqui Shaheed Road. The emergency control room would operate on round the clock basis. Its phone numbers are: 99211390 and 99211429. The concerned staff would remain on duty. According to PDMA assistant director <mark>Ajay Kumar</mark>, the warning has been issued on the recommendation of the Pakistan Meteorological Department. \"There are chances of flash floods in low-lying areas of Karachi, such as Malir and Lyari,\" local media reported. Karachi is likely to expect heavy rains till next five days. Copyright Business Recorder, 2015", "articleID": "2015072313_00117272_W", "names": {"Ajay Kumar": ["Q27909547", "Q4699642", "Q4699643", "Q56524947", "Q58765769"]}}, {"date": "2015-07-24", "url": "http://www.smh.com.au/entertainment/books/bookmarks-news-and-views-from-the-book-world-20150721-gigwm7.html", "content": "Bookmarks: News and views from the book world Books The Bros Karamazov. Seuss and the Lee factor In all the fuss about the publication of Harper Lee's Go Set a Watchman, it might be forgotten there is another literary giant who has a forgotten book coming out this month in the US. Dr Seuss' What Pet Should I Get? is published on July 28 and while it is not necessarily going to affect the moral standing of characters such as the Cat in the Hat or the Grinch, Random House has ordered a print run of 1 million copies. That doesn't quite match the 1.1 million copies of Watchman sold in the US in the first six days after publication last week. But it's still an event, even if old but unseen manuscripts by Dr Seuss--real name Theodor Geisel--keep popping up; this one was found by his widow, Audrey. To match the occasion, New York Times reviewer Michiko Kakutani produced her review in rhyme to match that of Dr Seuss. \"Seuss never spoke down to his readers, no matter how small. / His tales were told with vim, vigour and zest. / What Pet Should I Get? entertains us just fine. / Who cares if this book's not really his best?\" Doing evil on a Wednesday When philosopher Raimond Gaita heard Prime Minister <mark>Tony Abbott</mark> describe one of the Islamic State beheadings as pure evil, it set him thinking about how politicians use the term evil and what effect it has. People feel uneasy \"because they believe the use of the term betrays moral simplification and a desire to demonise those who are accused of being or having done evil\". But scepticism, he argues, about the use of such terms does not inevitably mean scepticism about the need for moral judgment in politics. And so Gaita arrived at the theme for his annual Wednesday lectures, beginning July 29, which will be run for the next six weeks in the public lecture theatre of the Old Arts Building at the University of Melbourne. Among the speakers are Gaita himself on \"Politics and the Idea of Evil\" , Anne Manne on \"The Anders Breivik Massacre: The Psychology of Evil\" , and Timothy Lynch on \"Good and Evil in American Politics\". The lectures are free. Bookings: alumni.online.unimelb.edu. au. Advertisement Books to set the heart racing Melbourne's Rare Book Fair continues this weekend with some fabulous offerings available for viewing and purchase. If you're a mad Jane Austen fan and have a spare $210,000 you could pick up a three-volume, first edition of Pride and Prejudice from London dealer Peter Harrington. His big-money offering, though, is a first edition of Sir Thomas More's Utopia--yours for $1.5 million. Closer to home, Kay Craddock has a catalogue of about 100 Arthur Upfield books, including 26 signed first or presentation editions. Prices range from $200 to $6000. The fair is at the University of Melbourne's Wilson Hall and admission is free. rarebookfair.com", "articleID": "2015072414_00162101_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}, {"date": "2015-07-24", "url": "http://www.techeye.net/tag/wto", "content": "wto | TechEye TechEye by <mark>Mike Magee</mark>. The World Trade Organisation (WTO) published a list of 201 IT products today that will be free from import tariffs--meaning many products will be cheaper. The WTO's aim is to boost different economies worldwide and the freedom of tariffs will have widespread implications ....Read the rest by Nick Farrell. Antigua's government has hit on a wizard wheeze to force the US to stop illegally killing off its internet gambling industry. The US government went on a puritan push against online gambling under the Bush administration. Since the tiny country made most of its money from online gambling, the US set up a trade blockade ....Read the rest by Matthew Finnegan. With tensions over rare earth trade showing no signs of abating, DEFRA says that it is important to raise awareness of the threat to the supply chain. by Matthew Finnegan. The government is hoping that recycling rare earth materials could protect businesses in the UK from being buffeted by rising costs. Against a backdrop of EU and US appeals to the World Trade Organisation regarding China's relative monopoly over the valuable minerals, the government has launched an initiative to bolster security against fluctuating prices ....Read the rest by Matthew Finnegan. The US is leading a push against a Chinese stranglehold on rare earth minerals, with the EU and Japan also planning to take a case to the World Trade Organisation. Following the publishing of a report by the Associated Press, President Obama is expected to announce today that the trio will demand talks with China over rare earth exports ....Read the rest by Andrea Petrou. A WTO report attacking China's exports of raw materials has cast doubts of reliability. Dr Xiaolan Fu, a University Lecturer in Development Studies at the Fellow of Green-Templeton College, University of Oxford has said the World Trade Organisation (WTO) ruling casts aspersions of double standards ....Read the rest by John W. Daly. French NGO La Quadrature Du Net has sifted through US diplomatic cables released by Nobel Prize nominee Wikileaks and uncovered details surrounding the dreaded Anti-Counterfeiting Trade Agreement (ACTA). According to La Quadrature, the cables state Japan was approached by the USA to chalk up a \"gold-standard\" IPR (intellectual property rights) agreement \"among a small number of like-minded countries,\" i.e....Read the rest by <mark>Linda Harrison</mark>. Officials from the EU warned today they were keeping a close eye on the situation of China's restrictions on rare earths exports. The EU said at a conference with the World Trade Organisation in Berlin that it was watching China's actions for possible legal implications, reports ....Read the rest Reuters by Adamson Rust. The World Trade Organisation (WTO) has called on the European Union (EU) to abolish tariffs on imports of technology products, after receiving formal complaints from the US, Japan, and Taiwan. The EU has operated a system of tariffs between six and 14 percent on a small range of technology goods that many other countries believe should fall under the 1996 Information Technology Agreement, when 70 countries, including EU members, agreed to eliminate duties on IT products, which would total several billion a year otherwise ....Read the rest", "articleID": "2015072418_00011272_W", "names": {"Linda Harrison": ["Q16225353", "Q272445", "Q50904999"], "Mike Magee": ["Q2889530", "Q6847758"]}}, {"date": "2015-07-25", "url": "http://sandiego.padres.mlb.com/news/article/mlb/pirates-alvarez-homers-into-allegheny-river?ymd=20150724&content_id=138486876&vkey=news_mlb", "content": "<mark>Alvarez</mark> tags Scherzer with Allegheny blast Email Print <mark>Alvarez</mark>'s two-run blast0:43 7/24/15: <mark>Pedro Alvarez</mark> hits a monster two-run homer out of the ballpark to give the Pirates an early lead in the 2nd inning ByAdam <mark>Berry</mark> / MLB.com | | @ adamdberry + 0 COMMENTS PITTSBURGH--Before Thursday's game, Pirates manager Clint Hurdle recalled a recent conversation with <mark>Pedro Alvarez</mark>. The Bucs have been trying to get their first baseman back \"in the productive place that we've seen him,\" Hurdle said, even as his name continues to pop up in trade rumors. <mark>Alvarez</mark> has been back in that productive place the last two days. A night after homering to left field, <mark>Alvarez</mark> launched a two-run shot off Nationals ace Max Scherzer all the way out of PNC Park in right-center on Friday and bounced it into the Allegheny River, giving the Pirates a 2-0 lead in the second inning. The blast was <mark>Alvarez</mark>'s team-leading 14th home run of the season. According to, the ball left <mark>Alvarez</mark>'s bat at 111 mph and traveled 439 feet from home plate. Statcast ™ The ball landed on the lower riverwalk beyond the right-field bleachers before bouncing into the river. It was the fourth time <mark>Alvarez</mark> has reached the river in his career, and the third time he has bounced a homer into the Allegheny. Must C: <mark>Alvarez</mark> homers into boat Must C Crushed: <mark>Alvarez</mark> homers out of PNC, into boat 5/19/15: <mark>Pedro Alvarez</mark> hits a solo home run that goes out of PNC Park and lands in a boat on the Allegheny River <mark>Alvarez</mark> reached the Allegheny River on the fly earlier this season, parking a homer directly into a boat on May 19. It has been a mostly disappointing year for <mark>Alvarez</mark>, who slugged 36 homers and drove in 100 runs in 2013. The former No. 2 overall pick entered Friday batting .232 / .302 / .424 while committing 15 errors in his first 77 games at first base. <mark>Adam Berry</mark> is a reporter for MLB.com. Follow him on Twitter at. This story was not subject to the approval of Major League Baseball or its clubs. @ adamdberry Share This", "articleID": "2015072500_00047402_W", "names": {"Adam Berry": ["Q23542551", "Q348765", "Q39073627"], "Pedro Alvarez": ["Q7159437", "Q767616"]}}, {"date": "2015-07-25", "url": "http://www.thecourier.com.au/story/3235917/tigers-jump-to-second-after-waubra-trip/?cs=4170", "content": "Springbank romped home over Waubra by 48 points after jumping the Roos early. GOOD DAY: Matt Tyler was one of Springbank's best on Saturday. SPRINGBANK romped home over Waubra by 48 points after jumping the Roos early. It was a scoreless first term for Waubra in wet and blustery conditions on Saturday. Jarryd Underwood got the party started for the Tigers, kicking the first four goals of the match. Underwood had a big impact on the scoreboard, booting six for the day. The young forward filled the gap left by the late withdrawal of gun Paul McMahon, who had a quadriceps injury from the week before. GJ Gardner Tigers supporters rose in cheers for first-gamer Darian Quinlan, who kicked his maiden senior goal on debut. Quinlan did some great work in the third term, with courageous tackling and effective smothers. Other players to stand out for the visitors were Matt Tyler, Simon Quinlan and Billy Driscoll. Robbie Lockett had his sights on the ball through thick and thin. Ruckman Matthew Wapling, who kicked two goals, was one of the best for the Roos. Tim Mullane, Shaun Mullane and Alex McPherson tried hard, while skipper Paul Dodds attempted to ignite a comeback. Springbank coach <mark>Terry Simpson</mark> said it was a terrific win against a quality side. \"The boys were great today. They played really great footy. It was windy and I thought they handled it pretty well. It made it easier when they got the score on the board early,\" he said. <mark>Simpson</mark> had praise for Underwood's performance in the forward line. \"It was great to see. He's been a bit of a borderline player and he's taken the step forward and proven to himself he can be a very good senior player .\" Waubra's coach Grant Luscombe conceded the Roos were \"just outclassed all over the ground\" .", "articleID": "2015072614_00069081_W", "names": {"Terry Simpson": ["Q3518933", "Q7705013"]}}, {"date": "2015-07-26", "url": "http://www.odt.co.nz/news/world/350413/turkish-jets-hit-pkk-targets-iraq", "content": "Turkish jets hit PKK targets in Iraq News: World Turkey attacked Kurdish insurgent camps in Iraq for a second night on Sunday, security sources said, in a campaign that could end its peace process with the Kurdistan Workers Party (PKK). Ankara, which called for a special NATO meeting on Tuesday to discuss its security concerns, said two of soldiers were killed and four wounded in the latest attack by PKK militants. Long a reluctant member of the United States-led coalition against Islamic State, Turkey made a dramatic turnaround this week by granting the alliance access to its air bases and launching air raids against both the jihadist movement and the PKK. But the relapse into serious conflict between Turkey and the PKK has raised doubts about the future of NATO member Turkey's peace process with Kurdish foes that started in 2012, after 28 years of bloodshed, but has recently stalled. Four Turkish F-16 fighter jets deployed from the Diyarbakir air base in the country's mainly Kurdish southeast hit PKK targets in Hakurk in northern Iraq, the sources told Reuters. The strike came after a car bomb and roadside explosives hit a passing military vehicle on a highway near Diyarbakir overnight on Sunday, the army said. Kurdish militants then opened fire on the vehicle with rifle fire, it said. Four other soldiers were wounded. At least six people had been detained in connection with the attack, the Dogan news agency reported. The PKK, which Ankara and Washington deem a terrorist group, has also targeted police officers in the southeast and elsewhere, accusing the Islamist-rooted central government of covertly helping Islamic State to the detriment of Syrian Kurds. The outlawed PKK has waged an insurgency against Ankara for Kurdish autonomy since 1984. Opposition politicians and critics accuse President Tayyip Erdogan of taking up the campaign against Islamic State as political cover to clamp down on Kurds. Prime Minister Ahmet Davutoglu, who has said the operations will continue as long as Turkey faces a threat, discussed security with United Nations Secretary-General Ban Ki-moon in a telephone call overnight. NATO said ambassadors will meet on Tuesday to discuss security at Turkey's request. A senior US diplomat condemned recent PKK attacks but denied any link between Turkey's new strikes on Kurdish militants and its newfound boldness in tackling Islamic State, which has seized large expanses of neighbouring Syria and Iraq. \"There is no connection between these air strikes against PKK and recent understandings to intensify US-Turkey cooperation against ISIL,\" Brett McGurk, the deputy special presidential envoy for the coalition to counter Islamic State, said on Twitter, using one of Islamic State's acronyms. White House spokesman <mark>Ben Rhodes</mark>, on an official visit to Kenya with President Barack Obama, told a news conference in Nairobi: \"The US of course recognises the PKK specifically as a terrorist organisation. And so, again, Turkey has a right to take action related to terrorist targets. And we certainly appreciate their interest in accelerating efforts against ISIL .\" Turkey said on Saturday its decision to enter the battle against Islamic State, soon after an IS suicide bomber killed 32 people, mainly Kurds, in the Turkish town of Suruc, would help create \"a safe zone\" across the nearby border in northern Syria. Turkish opposition leaders say they are concerned that Erdogan wants the new attacks on the PKK to whip up anti-Kurdish sentiment before a possible early election later this year. The Islamist-based AK Party he founded has until late August to find a junior coalition partner or face an early election. The AKP lost its single-party majority last June for the first time in more than a decade, in part due to the success of the pro-Kurdish Peoples' Democratic Party (HDP), which entered parliament for the first time. \"One of the aims of the air, land and media operations carried out right now is to undermine the HDP in early elections,\" HDP head Selahattin Demirtas said on Twitter. & raquo;", "articleID": "2015072621_00025088_W", "names": {"Ben Rhodes": ["Q4886343", "Q4886346", "Q4886347", "Q4886348"]}}, {"date": "2015-07-27", "url": "http://www.eonline.com/news/679920/caitlyn-jenner-plots-a-who-wore-it-better-prank-on-kris-jenner-watch-the-hilarious-i-am-cait-clip?cmpid=rss-000000-rssfeed-365-topstories&utm_source=eonline&utm_medium=rssfeeds&utm_campaign=rss_topstories", "content": "Caitlyn Jenner is plotting a style showdown with ex-wife! Kris Jenner In tonight's premiere of I Am Cait, the 65-year-old gives a tour of her new closet and growing wardrobe. Kim Kardashian \"I love this <mark>Tom Ford</mark> dress,\" Caitlyn says as she pulls the high-end garment out. \"Mom has that,\" Kim quickly blurts out. \"What's that?\" Caitlyn asks. \"Mom has that,\" she repeats before Caitlyn hilariously shrugs in disbelief. \"So it will be like a\" Who Wore It Better?' \"\"Who wore it best!\" Caitlyn exclaims with a giant smile. \"She has it in chocolate brown,\" Kim adds. \"We gotta do that,\" Cait laughs. \"Wouldn't that be the funniest thing ever?\" \"You should just come over at a time when I know she's there and I'll just pick out an outfit for her to wear and I'll say,\" Oh my god, I'm gonna take you to dinner. You should wear this .' And you'll stop by, \"Kim plots .\" And we'll both have the same outfit, \"Caitlyn adds .\" That is funny. I better wear it before she does! \"Watch the hilarious clip for yourself! Tune in to I Am Cait Sundays at 8 p.m., only on E! ShareCTRL-C or CMD-C, then press Enter. Click/tap elsewhere to exit, or press ESC.", "articleID": "2015072701_00024589_W", "names": {"Tom Ford": ["Q19873307", "Q240015", "Q318149", "Q7815834"]}}]