[{"articleID": "2009012409_00013332_W", "names": {"David Paterson": ["Q11674", "Q58331852"], "Bill Ritter": ["Q119255", "Q4910660"], "John Carney": ["Q16195457", "Q18576519", "Q21067052", "Q3181205", "Q42479381", "Q6217372", "Q6225238", "Q6225240"]}, "date": "2009-01-24", "url": "http://boston.com/news/nation/articles/2009/01/24/senate_picks_cast_governors_in_unflattering_light?rss_id=Boston.com+--+Latest+news", "content": "senate picks cast governors in unflattering light illinois gov. rod blagojevich responds to a question during a news conference in chicago, friday, jan. 23, 2009. blagojevich said he's boycotting his impeachment trial next week because the process is unfair, not because he's being defiant. (ap photo/charles rex arbogast) by beth fouhy associated press writer / january 24, 2009 email | print | single page | | text size - + new york - the departure of four sitting democratic senators this year has cast a new--and at times, unflattering--light on the nation's governors and their outsize power to fill senate vacancies. while governors must call a special election to replace members of the house who resign or die before their term is up, 38 states allow governors the sole power to appoint an interim senator, according to the national council of state legislatures. just nine states require a special election to fill a senate vacancy. in three other states--hawaii, utah and wyoming--governors must select a candidate from a list of prospective appointees submitted by representatives of the departing incumbent's political party. choosing a new senator has led to considerable drama for the four governors tasked with doing so this year. all have weathered some level of opprobrium for their choices or for how they handled the selection, with one--rod blagojevich of illinois--facing criminal charges for trying to barter president barack obama's former seat for cash and favors. \"politically, the choices made by the governors so far have been pretty odd,\" said seth masket, an assistant professor of political science at the university of denver. most recently, new york gov. <mark>david paterson</mark> engaged in a messy, drawn-out effort to name a replacement for hillary rodham clinton, obama's secretary of state. the process was largely dominated by a high-profile lobbying campaign by caroline kennedy, the 51-year-old daughter of president john f. kennedy hoping to win the nod. <mark>paterson</mark> spent weeks vacillating publicly about kennedy, at turns praising her intelligence while criticizing her lack of experience. the governor hinted openly that he would choose kennedy, then contradicted himself later by saying he was still considering other candidates. for her part, kennedy appeared tentative and unprepared, and she abruptly withdrew her name from consideration for the seat thursday. her departure launched a war of recriminations between her allies and <mark>paterson</mark>'s--a spectacle that suggested <mark>paterson</mark> had somehow lost control over the selection process. <mark>paterson</mark> announced friday he had selected rep. kirsten gillibrand, a moderate from the upstate region. but even that choice produced its share of grumbling. rep. carolyn mccarthy, citing gillibrand's opposition to gun control, vowed to challenge her in the 2010 democratic primary, or to find another candidate to do so. mccarthy came to congress after her husband was killed and son wounded during a shooting rampage on the long island railroad in 1993. gillibrand is also largely unknown in voter-rich new york city and its suburbs, where most of the state's democrats live. \"gillibrand seems fine for her district, but this is a state where liberals can actually win statewide,\" masket said. \"it's not clear why the governor wouldn't pick someone more liberal.\" in illinois, blagojevich prevailed in a high-stakes game of chicken with democratic leaders by naming former illinois attorney general roland burris to obama's seat. senate democrats had insisted that any candidate blagojevich named would not be considered a legitimate replacement. they eventually relented and allowed burris to be seated, but he remains tainted by his connection to blagojevich and may not be the strongest candidate to withstand a republican challenge in 2010. while less visible than the illinois and new york senate replacements, retiring delaware gov. ruth ann minner has withstood criticism for her choice to fill vice president joe biden's senate seat. and colorado gov. <mark>bill ritter</mark>'s choice of a replacement for ken salazar, now obama's interior secretary, has also mystified some. in delaware, minner selected longtime biden aide ted kaufman to serve until a special election in 2010. kaufman has made clear he will not run in the special election, clearing the way for biden's son beau, the state attorney general currently serving in iraq as a member of the delaware national guard. in appointing kaufman, a relative unknown to most delaware voters, minner passed over the state's popular lt. gov. <mark>john carney</mark>--reinforcing the notion that the seat belongs to the biden family and its loyalists. in colorado, <mark>ritter</mark> chose denver public schools superintendent michael bennet to succeed salazar, even though bennet has never run for statewide office and is virtually unknown beyond denver. the choice sets the stage for a strong republican push for the seat in 2010. despite the inevitable missteps, allowing governors to fill senate vacancies is generally a smart solution, said jeff bosworth, an assistant professor of history at mansfield university in pennsylvania. \"it's atypical to choose a senator this way, but it's worse to leave a state unrepresented for the time it takes to put together a special election,\" bosworth said. \"i can't see a better system than leaving it to the governor. they're elected, and if you don't like what they did, don't vote for them next time.\" © copyright 2009 associated press. all rights reserved. this material may not be published, broadcast, rewritten, or redistributed. more articles in nation"}, {"articleID": "2015112902_00057766_W", "names": {"Mark Jones": ["Q15072754", "Q15222722", "Q17523860", "Q22005690", "Q3294123", "Q3849506", "Q3849511", "Q6768275", "Q6768277", "Q6768278", "Q6768280", "Q6768281", "Q6768282", "Q6768283", "Q6768284", "Q6768285", "Q6768286", "Q6768287", "Q6768289", "Q934587"]}, "date": "2015-11-29", "url": "http://www.sandiegouniontribune.com/news/2015/nov/28/back-story-community-policing/", "content": "Back story: Going deep on community policing By Union-Tribune | 6:11 p.m. Nov. 28, 2015 Assistant Police Chief <mark>Mark Jones</mark> (left) and other officers support Special Olympics qualifiers in Rancho Bernardo this month .--Charlie Neuman Assistant Police Chief <mark>Mark Jones</mark> (left) and other officers support Special Olympics qualifiers in Rancho Bernardo this month .--Charlie Neuman Share Photo ✉ Q: What was the origin for this story? A: I was working on a piece about a new training program for recent police academy graduates that included a special focus on community engagement, and was invited to sit in on a session for some lieutenants who were going to be making the training happen. Kind of suddenly, this surprisingly candid conversation about how the department had strayed from community-oriented policing started up. Officers, lieutenants and a captain chimed in. They were telling really compelling stories about how the shift affected them and how it came about. I knew I wanted to do a deep dive into what had happened. Q: Why did you think readers needed to know this? A: Community policing is a philosophy that both police departments and neighborhoods should care about because, if it's going to work, it takes time and commitment from residents and officers. The practice is about preventing crime, but it's also about building relationships between officers and communities. Q: What were the challenges? A: Putting it all together was probably the biggest challenge. It was fascinating delving into what turned out to be a nationwide struggle to make community policing happen. The philosophy itself has a pretty rich history, too, so I didn't want to shortchange that while I told San Diego's story. I thought the biggest challenge would be getting people to talk with me about what went wrong, but everyone knew departments had strayed from problem-oriented policing. I think the conversation was easier to have because so many wanted to see it flourish again. Q: What stood out for you in reporting and writing it? A: Probably learning how miserable officers had been. I don't often hear from officers about their personal experience on the job, so it was enlightening hearing how crappy they thought the whole situation was. I also thought it was interesting that the community's perception of officers was fairly two-faced. There's the neighborhood officer who's ready to work alongside you, and the officer on patrol who's too busy to be bothered. Also, the fact that everyone was committed to community-oriented policing, even though research hadn't definitively shown it reduced crime. Q: Was there any aspect you wanted to explore but could not find the time or space for? A: A lieutenant I talked with said \"back in the day\" if an officer wanted to be promoted, he or she better be a pro at problem-oriented policing. Then, at some point, that wasn't the case. As officers got busier, more emphasis was placed on other qualities, so they weren't making as much of an effort for community policing because it wouldn't propel them through the ranks like it used to. That also suggested leaders that did get promoted weren't the community-policing proponents their predecessors were, because they were being chosen for different strengths. For another story, perhaps. Q: Will you be writing other stories on this topic? A: Definitely. I'll also be doing pieces on other areas the department committed to work on following the federal audit, particularly the department's Early Identification & Intervention System. It's a computer-based system that's designed to zero in on problem behaviors early. It needs a serious overhaul, which could cost quite a bit, so I'd like to help people better understand what it does and why departments across the nation say it's a must-have tool. Q: Why do you like covering police and crime and public safety? A: Covering crime can be draining, but that's because it's compelling and full of emotion. Like Edna Buchanan, a legendary Miami Herald crime reporter, said: The beat \"has it all: greed, sex, violence, comedy and tragedy.\" I also think law enforcement, as a whole, is a really important topic to cover closely, especially as our nation continues to discuss ways police can better do their job and how communities can help them do that. -"}, {"articleID": "2010081608_00005792_W", "names": {"Shaukat Ali": ["Q56274761", "Q56705910", "Q7490758", "Q7490759"]}, "date": "2010-08-15", "url": "http://azcentral.com/arizonarepublic/news/articles/2010/08/16/20100816pakistan0816.html", "content": "digg this pakistan is in dire need, u.n. says quarter of country flooded; ban urges speedy assistance by chris brummitt - aug. 16, 2010 12:00 am islamabad, pakistan - u.n. secretary-general ban ki-moon said sunday that he has never seen anything like the flood disaster in pakistan after surveying the devastation and urged foreign donors to speed up assistance to the 20 million people affected. ban's comments reflect the concern of the international community about the unfolding disaster in pakistan, which is battling al-qaida and taliban militants, has a weak and unpopular government and an anemic economy propped up by international assistance. \"this has been a heart-wrenching day for me,\" ban said after flying over the hard-hit areas with pakistan president asif ali zardari. \"i will never forget the destruction and suffering i have witnessed today. in the past, i have witnessed many natural disasters around the world, but nothing like this.\" ban visited myanmar after cyclone nargis devastated the country in may 2008, killing an estimated 138,000 people. he also flew to china's sichuan province just days after an earthquake that killed nearly 90,000 people in march 2008. the floods that began more than two weeks ago in pakistan's mountainous northwest have now hit about one-quarter of the country, especially its agricultural heartland. while the death toll of 1,500 is relatively small, the scale of the flooding and number of people whose lives have been disrupted is staggering. the world body has appealed for an initial $460 million to provide relief, but only 20 percent has been given. once the floods recede, billions more will be needed for reconstruction and getting people back to work in the already-poor nation of 170 million people. the international monetary fund warns that the floods could dent economic growth and fuel inflation. \"waves of flood must be met with waves of support from the world,\" ban said. \"i'm here to urge the world to step up assistance.\" zardari has been criticized for his response to the disaster, especially for going ahead with a state visit to europe just as the crisis was unfolding. zardari has visited victims twice since returning, but images of him at a family-owned chateau while in france are likely to hurt him for months to come. in his first comments to the media since returning, he defended the government. \"the government has responded very responsibly,\" he said, saying the army, the police, the navy and officials were all working to relieve the suffering. \"i would appeal to the press to understand the magnitude of the disaster.\" zardari said it would take up to two years for the country to recover. ban said visa restrictions had been eased for humanitarian workers, and they now could get visas on arrival at pakistan airports. on saturday, prime minister yousuf raza gilani said that 20 million people had been made homeless in the disaster. the monsoon rains that triggered the disaster are forecast to fall for several weeks yet, meaning the worst may not yet be over. over the weekend, tens of thousands of people were forced to flee their homes when they were inundated by fresh floods from the swollen indus river. while local charities and international agencies have helped hundreds of thousands of people with food, water, shelter and medical treatment, the scale of the disaster has meant that many millions have received little or no assistance. the u.n. has voiced fears that disease in overcrowded and unsanitary relief camps may yet cause more deaths. earlier sunday, survivors fought over food being handed out from a relief vehicle close to the town of sukkur in hard-hit sindh province, ripping at each others' clothes and causing such chaos that the distribution had to be abandoned, according to an associated press reporter at the scene. \"the impatience of the people has deprived us of the little food that had come,\" said <mark>shaukat ali</mark>, a flood victim waiting for food. waters 5 feet deep washed through dera allah yar, a city of 300,000 people on the border of sindh and baluchistan provinces, government official salim khoso said. about 200,000 had fled the city, and khoso said he did not know how they would be fed."}, {"articleID": "2015110120_00218706_W", "names": {"Shoaib Akhtar": ["Q738330", "Q7499709"], "Harbhajan Singh": ["Q11708624", "Q19667702", "Q9475"], "Mustafa Kamal": ["Q6943273", "Q6943274"]}, "date": "2015-11-01", "url": "http://www.deccanchronicle.com/151102/sports-cricket/article/labourer’s-son-india’s-‘fast-bowling-future’", "content": "Share Tweet Printer-friendly version Send by email Rajasthan pacer Nathu Singh was picked by Sandeep Patil to play for Board President's XI against South Africa in the tour match. Mumbai: He is fast and is described as India's fast bowling future by a legend. All of 20, a fast bowling son of a wire factory worker in Jaipur is making the right kind of noises in the domestic cricketing circle. Nathu Singh, a fast bowler from Rajasthan, was picked by chief selector Sandeep Patil in the Board President's squad for the two-day warm-up match against South Africa before the four-Test series starting November 5. Patil believed the boy had \"the X-Factor' that selectors always search for. And that spark in Nathu was also noticed by none other than Rahul Dravid. Nathu has picked up 12 wickets for Rajasthan in his four first-class matches. After his first match, he got the attention of Gautam Gambhir who mentioned to their coach Vijay Dahiya that\" after a long time he has seen a new India material, please make sure he is not ruined by over-bowling. \"Nathu was sent in to Surana Academy in Jaipur and he made a giant leap. From the academy, he was picked for Rajasthan's U-19 team in 2013. He made his first-class debut in the ongoing Ranji Trophy and stared it with 7 for 87 against Delhi. Within three years, he was bowling to the likes of Hashim Amla and AB de Villiers at the Brabourne Stadium in Mumbai.\" My life has changed a lot. I used to watch a lot of cricket on the television as a kid. And every time I watched a fast bowler run in, I would say to myself, \"I want to bowl like this one day',\" Nathu told bcci. tv. \"I loved watching <mark>Shoaib Akhtar</mark> bowl. He was so quick. I watched him and decided that I want to bowl so fast that I break his record. And for that I have to work really hard, for which I am absolutely prepared,\" he added. When asked to describe about his bowling, Nathu said: \"Everything about my bowling is natural.\" I still bowl the same way I used to when I started playing cricket. The only thing I have learned is to adjust my length according to the pitch and the match situation. \"I have a natural in-swinger and I get away swing with the same action and angle. I am not working on any aspect regarding swinging the ball. I am only focusing on getting my lengths right. I have a few variations as well, like the back-of-hand slower one and bouncer, and the cutters. I have learnt all these on my own, bowling with the tennis ball,\" he added. What makes Nathu different from the rest is that he knows his strengths and weaknesses - something you don't expect from an young man who has just stepped out of his teenage years. \"The one weakness I have is that I tend to go haywire with my line. I just want to improve on that,\" he said. \"When I bowled with the tennis ball, my run-up consisted of two to three steps. Once I started with the leather ball, I had to increase the length of my run-up to generate that force. It took me a lot of time to adjust to a long run-up.\" It was also a challenge to get control over my swing with the leather ball. Initially, it tended to swing too far across. The coaches would ask me to bowl with a crossed seam. Gradually as I practised more and more, I got the hang of it. \"Nathu is happy to get all the media glare but his modesty makes him sad too.\" It makes me feel really happy (that everyone is backing me to make it big) but at the same time it also scares me, \"Nathu said. Pages 1 2 next' last & raquo; Tags: sports Cricket India Nathu Singh Also Read 1st Test: Pacers skittle out New Zealand for a paltry 105 as India need 407 to win Hyderabad Cricket Association all set for pitched battle\" I want to learn from <mark>Harbhajan Singh</mark>,' says girlfriend Geeta Basra <mark>Mustafa Kamal</mark> lashes out at ICC, threatens to expose dark truth"}, {"articleID": "2013031209_00034319_W", "names": {"Kim Turner": ["Q462980", "Q6409519"]}, "date": "2013-03-12", "url": "http://examiner.com/article/strength-of-utuafare-brings-to-erau-to-heiva-i-honolulu", "content": "related topics honolulu music hawaii events polynesian arts & entertainment polynesian dancing drumline advertisement \"joining this family has been life changing for me,\" says rachel oliveros about tahitian dance group to'erau manu rahi, which oliveros as well as her three children are members of. this family-friendly atmosphere of to'erau is a leading component as to why the group has grown from twelve members to more than 150 in less than three years. \"they like to include everybody in everything, even if it's not dance related,\" says <mark>kim turner</mark>, mother of sixteen-year-old vanessa caluya. \"everyone in the group is always there for one another, lending a helping hand whenever needed.\" now with great experience and more exposure, the to'erau family will be attending its first out-of-state competition - the heiva i honolulu - hosted by tahiti nui international, from march 21 to 23 at the waikiki shell. \"the creation of to'erau was by a random decision that me and my brother, erik, made,\" says to'erau director and co-founder crystal boquiren. \"one day we sat down and decided to just go for it. the next day we went out and got a business license, and within two weeks, we were set.\" te aranui photo credit: to'erau manu rahi though the group developed in such a short amount of time, the combined history and experience of the boquirens catalyzed the strength and foundation of the group. though he started out at age nine as a dancer for tahitian dance company te mana o te ra in walnut creek, california, erik soon became absorbed in drumming. \"i eventually became the music director for hui tama nui (in vallejo, california) where we won multiple first place music, first place drumming, and\" best overall group' awards at the san jose tahiti fete and heiva i reno competitions, \"says erik, who is now in charge of concept design for productions, composing and arranging original drum beats and songs, and male choreography for to'erau. known for his not-so-typical tahitian drum teaching style, erik's students have established a nickname for their leader.\" they like to call me the \"bad cop' for my aggressive teaching and instruction with influences from being in and teaching marching percussion,\" says erik, who was a member-turned-instructor for award-winning drumlines at springstowne middle school and jesse bethel high school, both in vallejo, california. with mostly word-of-mouth advertising and support from the boquirens' mentors - sam almira and lisa aguilar - to'erau has made it a point to continue traditions and appropriately represent the tahitian culture. \"sam almira has been very supportive. he recognized the talent and pushed us,\" says crystal about the well-known tahitian drummer who has been deemed \"the godfather\" and is founder of award-winning group hui tama nui. \"he makes sure we have appropriate material and represent the culture respectfully.\" crystal's experience began as early as the age of ten when she became a member of te mana o te ra. much of her growth as a member of the tahitian dance community has come from the group's leader, lisa aguilar. \"she's made a huge impact on me and erik, and we owe a lot of our success to her,\" says crystal. after being a dancer for many years, crystal eventually became a music director for hui tama nui, where she worked with long-time tahitian dance frontrunner, the sencil family. \"aaron [sencil] completely changed the game, like how bruce lee did kung fu,\" says jeff sencil, former drummer of the kalihi dancers, about hui tama nui's direction shift from traditional to modern, yet still keeping the cultural spirit alive. it was much later during this change that hui tama nui took a break and to'erau found its own birth in january 2010. crystal's motivation to teach and to share the family bond of to'erau is the reason why, despite the many intense hours of rehearsal and preparation, she continues to build her group. \"i love when students have an immense passion to do well. they are always hungry to learn more and want to do better,\" says crystal. \"those students really inspire me and motivate me to become the teacher that i am, and make me love what i do.\" for <mark>turner</mark>'s daughter, vanessa, to'erau was a much needed group for those dance members who had taken a break. \"she [vanessa] had always wanted to go back to dancing. we knew that crystal and her brother had formed their own halau (dance group), because they used to sing/dance/drum in our former group,\" says <mark>turner</mark>. \"we also knew they had the experience needed to run and maintain a successful halau. plus, several other girls vanessa had danced with from our old group joined tmr.\" since 2010, the group has competed and/or performed at the kiki raina tahiti fete, manahere, san jose tahiti fete, na maka, heiva i reno, and te aranui. prior to competition, months and months of preparation are involved. from the music composition to the last-minute changes on the day of a show, the boquirens not only manage the members, they open their home and hearts to members who need them the most. \"there are always people in our house,\" says crystal. we're always spending time with each other, whether it be bowling or grocery shopping. \"but when it's time to work, production begins on a blank canvas with crystal and erik deciding on a theme. once a theme is in place, there is a blueprint of which piece will go in which spot.\" in tahitian culture, it's all about making sure that we follow the legend appropriately, \"says crystal, who looks to sam almira for guidance in designing a show. following the theme, songwriting takes place - a task that can sometimes take only an hour to do, but about two weeks to teach.\" me and my brother just sit and go for it, \"says crystal, who focuses on the vocal aspect and arrangement of a piece.\" whatever comes out becomes a song. \"\"when writing songs, it normally starts with my sister providing lyrics that are translated in english so we could see if it's a\" happy' or \"sad' song, or a song about love or nature. then, see what kind of chord progression to make, either a minor or major chord progression. from there, we start humming melodies, and the rest is history,\" says erik. \"the type of music we play has a very jazzy and r & b feel, but we still stay true to traditional tahitian music, to give it kind of a fusion.\" under the direction of crystal and erik, there are other instructors who help bring out and preserve the tahitian culture for this 150 + member group. malia villanueva instructs the children, jiusten santos instructs the men, danilo calingo assists as drum instructor, and jerwyn sendaydiego and joseph sai design the costumes. \"it's fun and wonderful to watch, especially knowing all the time, energy, and hard work that go into making the group successful,\" says <mark>turner</mark> about the show design from beginning to end. in addition, there are many parents of family members, such as <mark>turner</mark>, who have helped and continue to do so simply out of the love and dedication that has become recognized by other groups. \"we really, really have a unique, close-knit bond. we even get noticed for how positive and supportive we are of each other by the tahitian community,\" says crystal. \"like all families, we argue, but we argue in person instead of talking behind each other's back. it makes us stronger to become even more positive. it's unconditional.\" and it is this distinct bond that has drawn the attention of many parents to have their children become part of such a dynamic group. \"to'erau manu rahi is definitely one of a kind. they are such a warm and friendly group of people that care so much about each other,\" says eileen madayag, mother of six-year-old dancer reese madayag. \"we were looking for a group that was very family-oriented and kid-friendly, but most of all, patient and welcoming with beginners. crystal and erik are great leaders that offer the best support and guidance. we could not ask for a better family to be part of.\" positive leadership skills have brought the boquirens much familial success. their welcoming demeanor has not only been a deciding factor for children to join, but the children's parents, as well. \"it's always a good feeling to see all of the families make memories that last lifetimes,\" says erik. \"we have so many mothers dancing with their children, it's an amazing feeling,\" says oliveros, who used to dance when she was younger, and has now returned to share in the experience. \"when i introduced my children to the culture, they took it and showed appreciation, love, and respect for it. this is what they love to dance and it's great that we can all share it together.\" oliveros' children are eleven-year-old josiah rillera, six-year-old mariah oliveros-nau, and three-year-old caliyah oliveros-nau. of the three, two of them will be part of the heiva i honolulu competition. mariah will be competing in the solo category, while caliyah will be performing in exhibition. \"mariah, who is only six years old, has definitely made her mark in the tahitian community. she won first place last year,\" says crystal. first place is no stranger to to'erau. thirteen-year-old dancer darien panday has won in every single competition he has entered. \"he always wins first or second place,\" says crystal. \"last year he won the overall category (meaning he was the best in the entire competition), in which he competed against over 400 people.\" though there can only be one first place winner in every category, the parents of to'erau members see their children winning every day. \"to'erau has taught her to be more disciplined and to try harder to accomplish her goals,\" says <mark>turner</mark> about daughter vanessa. \"it also has and is, still teaching her to be more confident and to push herself more.\" for oliveros, her children have learned the true meaning of respect and love. \"my children have become some of the strongest children i know by being part of such a great family as to'erau manu rahi,\" says oliveros. \"my family has gained such a new meaning to life by being surrounded by such a great group of people that allows everyone to be a part of. everyone is treated equally no matter your age, shape, or size. if you dance with your heart, that is all that is ever expected. our ra'atiras (teachers) crystal and erik, provide us with a chance at a lot of things that seem, to many, impossible or unreachable.\" success in every form has been awarded to this tight-knit group of dancers, musicians, and parents. the weekly rehearsals, show design, costume making, fundraising, and so much more, have brought them to a point in their development where the possibilities are limitless. \"last year, it was not in my thoughts that we would be able to travel to hawaii to participate in heiva i honolulu, but here we are!\" says crystal. with a history embedded in the tahitian culture, and a fresh take on songwriting, the to'erau family hopes to one day bring its talent to tahiti, but this year, honolulu welcomes to'erau with much appreciation and respect. their name alone, has spoken volumes to those who have followed. to'erau manu rahi translates to \"great birds of the north winds\" , a fitting label for a group that continues to move forward and exemplify positive action. \"we chose a name that signified strength.\" to'erau' comes from a sense of new life and strength in the new generation, \"says crystal.\" \"manu' means bird, and birds are closest to the heavens. they're known for having the eyes of god.\" and strength in a family bond is what has kept this group motivated to lead every member down a righteous path. \"it is a huge stepping stone for what's to come,\" says erik about the heiva i competition. though nothing may be set for the future as far as competitions and productions, \"one thing that i can guarantee is that we will still be\" utuafare', \"says crystal."}, {"articleID": "2013011512_00026185_W", "names": {"Greg Ball": ["Q5605257", "Q5607121"]}, "date": "2013-01-15", "url": "http://inforum.com/event/apArticle/id/DA3QJS380/", "content": "published tuesday, january 15, 2013 ny agrees on 1st state gun control laws since newtown massacre; urges states, us to follow by michael gormley associated press, the associated press - albany, n.y. new york gov. andrew cuomo speaks during a news conference announcing an agreement with legislative leaders on new york's secure ammunition and firearms enforcement act in the red room at the capitol on monday, jan. 14, 2013, in albany, n.y. (ap photo/mike groll) new york lawmakers agreed to pass the toughest gun control law in the nation and the first since the newtown, conn., school shooting, and now dare other states and washington to follow. \"this is a scourge on society,\" gov. andrew cuomo said monday night, six days after making gun control a centerpiece of his progressive agenda in his state of the state address. the bipartisan effort was fueled by the newton tragedy that took the lives of 20 first graders and six educators. \"at what point do you say,\" no more innocent loss of life .' \"sen. jeffrey klein, leader of the independent democratic conference in the senate, said it is landmark legislation.\" this is not about taking anyone's rights away, \"said klein, a bronx democrat.\" it's about a safe society...today we are setting the mark for the rest of the county to do what's right. \"the measure, which calls for a tougher assault weapons ban and restrictions on ammunition and the sale of guns, passed the senate 43-18 on the strength of support from democrats, many of whom previously sponsored bills that were once blocked by republicans. the democrat-led assembly gaveled out before midnight and planned to take the issue up at 10 a.m. tuesday. it is expected to pass easily. the governor confirmed the proposal, previously worked out in closed session, also would mandate a police registry of assault weapons, grandfathering in assault weapons already in private hands. it would create a more powerful tool to require the reporting of mentally ill people who say they intend to use a gun illegally and would address the unsafe storage of guns, the governor confirmed. it was agreed upon exactly a month since the sandy hook elementary school tragedy.\" it is well-balanced, it protects the second amendment, \"said senate republican leader dean skelos of long island.\" and there is no confiscation of weapons, which was at one time being considered. \"this is going to go after those who are bringing illegal guns into the state, who are slaughtering people in new york city,\" skelos said. \"this is going to put people in jail and keep people in jail who shouldn't be out on the street in the first place.\" sen. andrea stewart-cousins of yonkers noted most bills had been pushed by democrats in past years, but bottled up by republicans. \"the senate democrats were proud to provide the votes to make this crucial package possible,\" said stewart-cousins, leader of the traditional democratic conference. \"the fact is, the bills passed today should have been enacted a long time ago.\" cuomo said he wanted quick action to avoid a run on assault weapons and ammunition as he tries to address what he estimates is about 1 million assault weapons in new york state. republican sen. <mark>greg ball</mark> called that political opportunism in a rare criticism of the popular and powerful governor seen by his supporters as a possible candidate for president in 2016. \"we haven't saved any lives tonight, except one: the political life of a governor who wants to be president,\" said <mark>ball</mark> who represents part of the hudson valley. \"we have taken an entire category of firearms that are currently legal that are in the homes of law-abiding, tax paying citizens ....we are now turning those law-abiding citizens into criminals.\" under current state law, assault weapons are defined by having two \"military rifle\" features spelled out in the law. the proposal would reduce that to one feature and include the popular pistol grip. private sales of assault weapons to someone other than an immediate family would be subject to a background check through a dealer. also internet sales of assault weapons would be banned, and failing to safely store a weapon could be subject to a misdemeanor charge. ammunition magazines would be restricted to seven bullets, from the current 10, and current owners of higher-capacity magazines would have a year to sell them out of state. an owner caught at home with eight or more bullets in a magazine could face a misdemeanor charge. in another provision, a therapist who believes a mental health patient made a credible threat to use a gun illegally would be required to report the incident to a mental health director who would have to report serious threats to the state department of criminal justice services. a patient's gun could be taken from him or her. the legislation also increases sentences for gun crimes including the shooting of a first responder that cuomo called the \"webster provision.\" last month in the western new york town of webster, two firefighters were killed after responding to a fire set by the shooter, who eventually killed himself. senate deputy majority leader thomas libous of broome county voted against the bill and said it was a tough vote for upstate republicans. \"i have had thousands of emails and calls,\" libous said. \"i have to respect their wishes.\" he said many of constituents worry the bill will conflict with the second amendment's right to bear arms while others anguish over shootings like at newtown, conn., and columbine, colo. the closed-door meetings prompted about a dozen gun workers to travel more than two hours to albany to protest the legislation they say could cost 300 to 700 jobs in the economically hard-hit mohawk valley. \"i have three small kids myself,\" said jamie rudall, a unionized worker who polishes shotgun receivers. \"so i know what it means, the tragedy...we need to look at ways to prevent that, rather than eliminate the rights of law-abiding citizens.\" in the gun debate, one concern for new york is its major gun manufacturer upstate. remington arms co. makes the bushmaster semi-automatic rifle that was used in the connecticut shootings and again on christmas eve when the two firefighters were slain in webster. the two-century-old remington factory in ilion in central new york employs 1,000 workers in a republican senate district. assemblyman marc butler, a republican who represents the area, decried the closed-door meetings by senate republicans and the democratic majority of the assembly as \"politics at its worst.\" the bill would be the first test of the new coalition in control of the senate, which has long been run by republicans opposed to gun control measures. the chamber is now in the hands of republicans and five breakaway democrats led by klein, an arrangement expected to result in more progressive legislation. former republican sen. michael balboni said that for legislators from the more conservative upstate region of new york, gun control \"has the intensity of the gay marriage issue.\" in 2011, three of four republicans who crossed the aisle to vote for same-sex marriage ended up losing their jobs because of their votes. ___ ap writer michael virtanen contributed to this report from albany."}, {"articleID": "2019061906_00107155_W", "names": {"David Pritchard": ["Q10264436", "Q245816", "Q5238723"]}, "date": "2019-06-19", "url": "http://newsandstar.co.uk/news/17714665.true-farmers-man-david-thomlinson-is-laid-to-rest/", "content": "News True farmer's man <mark>David</mark> Thomlinson is laid to rest By Maureen Hodges @ DancingSheep1 Farming and Rural Affairs Editor See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment IT WAS a poignant moment as hundreds of people gathered at a Carlisle mart to pay their respects to a giant in the livestock auctioneering world. Farmers, livestock breeders and business leaders' from all corners of the UK had gathered not for the usual hustle and bustle of a busy livestock mart sale day, but to pay their respects to <mark>David</mark> Thomlinson. His funeral was being live streamed on a giant screen in the Borderway Auction Mart at Rosehill, where he had spent 57 years of his working life. Anecdotes were exchanged about a man they counted as a friend and mentor, who liked nothing better than standing in the rostrum and selling anything presented in front of him - with the challenge of achieving the best price. A hush descended as mourners were asked to stand while on the screen an image appeared of <mark>David</mark>'s coffin being carried into the tiny Scaleby Church where he had been a regular worshipper. Warm tributes have flooded in from all over the globe for <mark>David</mark>, one of the best-known auctioneers of his generation, after he passed away two weeks ago following a tragic accident on the family farm at Scaleby. He had been working with a newborn calf in a pen. The decision to webcast <mark>David</mark>'s service at the mart and Scaleby Village Hall was taken by family and colleagues at Harrison & Hetherington after it was realised the tiny village could not cope with the numbers of mourners, which tallied more than 1,000. The service was led by Reverend Elizabeth Gough, who said perhaps it was no coincidence that she, a farmer's daughter, should lead <mark>David</mark>'s service. Then a tiny ripple of laughter went through the watching crowd as Rev Gough added there was a chaplain standing by \"just in case technology fails'. In a tribute to the auctioneer's early life, Rev Gough said it would have been <mark>David</mark> and wife Sheila's 49th wedding anniversary. The couple met back in the sixties at the Cosmo in Carlisle, when Sheila, a farmer's daughter from Yorkshire who was then living in Annan, caught his eye. The couple moved to Park View, <mark>David</mark>'s parents' farm in 1988.\" Sheila mentions that <mark>David</mark> said, \"when you get to Scaleby and got clay on your clogs you never moved',\" said Rev Gough. \"He loved his dogs Tink and Pip, who miss him, and was proud of the many young auctioneers he had mentored. I hope you've only picked up his good habits and ensure his legacy lives on through future generations.\" Ask yourself what would <mark>David</mark>, or DT or Tommo as I know some of you called him say or do. \"H & H joint managing director, <mark>David Pritchard</mark> said <mark>David</mark> was also a livestock breeder, an acclaimed and valued judge of livestock and an inspiration character for the younger generations he had mentored through their early days.\" <mark>David</mark> could tell you many a story in his early days in the office, and not all of it was work - playing cards was one of them, antics with the office bike to name but a few. \"I remember him telling me the first item he sold was a child's cot for one shilling. He said when he first started to sell he was very nervous and the thought of a fortnightly market used to play havoc with his digestive system two or three days before a sale.\" Brampton vet <mark>David</mark> McCrea, before reading the poem The Auctioneer, said: \"A neighbour told me he had asked <mark>David</mark> why he didn't take things a little easier and retire from the auction? <mark>David</mark> replied he couldn't give up the auction because he needed to look after his customers. But he didn't mean customers, he meant his friends.\" n News & Star attended with permission from <mark>David</mark>'s family. 0 comment"}, {"articleID": "2013061914_00064939_W", "names": {"Michael Hastings": ["Q21166753", "Q44706", "Q56087978", "Q6830997", "Q6830998"], "Ben Smith": ["Q21622916", "Q21622918", "Q2895559", "Q31193", "Q3637951", "Q4886477", "Q4886478", "Q4886480", "Q4886481", "Q4886482", "Q4886483", "Q4886484", "Q4886490", "Q56144844"], "David Rosenthal": ["Q2714150", "Q5236958", "Q57056589"]}, "date": "2013-06-19", "url": "http://www.wgem.com/story/22628652/award-winning-journalist-michael-hastings-dies", "content": "Award-winning journalist <mark>Michael Hastings</mark> dies (AP Photo/Blue Rider Press/Penguin). This undated photo provided by Blue Rider Press/Penguin shows award-winning journalist and war correspondent <mark>Michael Hastings</mark>. meta itemprop = \"datePublished\" content = \"2013-06-19 07:30:24\" > Zimmerman jury selection moving into a new phase Attorneys in the George Zimmerman murder trial are set for the next phase of jury selection. Prosecutors and defense attorneys in the George Zimmerman murder trial are about to move into the next phase of jury selection. meta itemprop = \"datePublished\" content = \"2013-06-19 07:30:41\" > Award-winning journalist <mark>Michael Hastings</mark> dies <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. meta itemprop = \"datePublished\" content = \"2013-06-19 07:20:41\" > FBI hunt for Jimmy Hoffa remains entering 3rd day FBI agents plan a third day of digging Wednesday in suburban Detroit for the remains of former Teamsters union leader Jimmy Hoffa, who disappeared 38 years ago. FBI agents plan a third day of digging Wednesday in suburban Detroit for the remains of former Teamsters union leader Jimmy Hoffa, who disappeared 38 years ago. meta itemprop = \"datePublished\" content = \"2013-06-19 07:20:21\" > W. Va. mine safety lab creates disasters to train Alpha Natural Resources is unveiling a $23 million training complex for coal miners that combines the world's best technology in a single West Virginia complex - and may save lives. Orange flames lick at the roof of the coal mine, heat building and visibility dropping as smoke begins to fill the underground passageway. Then, with the push of a few buttons on a hand-held remote, the flames flicker out,...meta itemprop = \"datePublished\" content = \"2013-06-19 07:10:20\" > Baked Alaska: Unusual heat wave hits 49th state Baked Alaska: Unusual heat wave hits 49th state A heat wave hitting Alaska doesn't rival the blazing heat of Phoenix or Las Vegas, but to residents of the 49th state, the weather feels like a stifling oven - or a tropical paradise. A heat wave hitting Alaska may not rival the blazing heat of Phoenix or Las Vegas, but to residents of the 49th state, the days of hot weather feel like a stifling oven - or a tropical paradise. meta itemprop = \"datePublished\" content = \"2013-06-19 06:50:19\" > Ohio woman accuses 3 of holding her captive Authorities say a woman was held captive by three people who forced her to do housework, raided her bank account and menaced her with snakes. A woman told authorities she was held captive for more than a year by three people who forced her to do housework, raided her bank account and menaced her with snakes and pit bulls. meta itemprop = \"datePublished\" content = \"2013-06-19 06:40:17\" > Ex-Bulger cohort to spend 3rd day on witness stand Ex-Bulger cohort to spend 3rd day on witness stand A former enforcer for James \"Whitey\" Bulger is expected to face more tough cross-examination by Bulger's lawyers when he returns to the witness stand for a third day. A former enforcer for James \"Whitey\" Bulger is expected to face more tough cross-examination by Bulger's lawyers when he returns to the witness stand for a third day. meta itemprop = \"datePublished\" content = \"2013-06-18 21:49:57\" > Rural lawmakers push for farm bill votes in House Rural lawmakers push for farm bill votes in House Farm-state lawmakers are scrambling to win bipartisan votes for a five year, half-trillion dollar farm bill on the House floor this week. Farm-state lawmakers are scrambling to win bipartisan support for a five-year, half-trillion-dollar farm bill on the House floor this week. meta itemprop = \"datePublished\" content = \"2013-06-18 11:29:33\" > NSA director says plot against Wall Street foiled NSA director says plot against Wall Street foiled The chairman of the House Intelligence Committee says it appears the much-criticized national electronic surveillance program foiled \"dozens\" of terrorist plots. The U.S. foiled a plot to bomb the New York Stock Exchange because of the sweeping surveillance programs at the heart of a debate over national security and personal privacy, officials said Tuesday at a rare open hearing on...meta itemprop = \"datePublished\" content = \"2013-06-19 04:10:11\" > Gov' t report: Smooth launch unsure for health law Gov' t report: Smooth launch unsure for health law There's no guarantee that President Barack Obama's health care law will launch smoothly and on time, congressional investigators say in the first in-depth independent look at its progress. Seeking a Syria consensus despite US-Russia divide At the G-8, leaders seek a Syria consensus despite a US-Russia divide To ease shortage of organs, grow them in a lab? As more patients get lab-grown body parts, scientists face challenge of making complex organs Some evacuations lifted in destructive Colo. fire With flames in check, some evacuation orders lifted in devastating Colo. wildfire 2 found dead in area burned by out-of-control Colo. wildfire that destroyed 379 homes Colorado wildfire destroys at least 360 homes Out-of-control Colorado wildfire destroys at least 360 homes, surpasses last year's record Defense hints at no trial in Ohio kidnap-rape case Defense hints at plea to avoid trial for Cleveland man charged with kidnapping, raping 3 women US spy programs raise ire both home and abroad No plans to end broad US surveillance despite sharp backlash from foreign allies, Congress Man kills 6 in Calif. before police shoot him dead Gunman kills 6 in Santa Monica before he reaches college library and is shot dead by police Not quite the ER: Boston hospital cleaning mummy Boston hospital that 2,500-year-old mummy calls home gives its patient a good cleaning Monumental phone-records monitoring is laid bare Government sweep of millions of citizens' phone records ignites fresh debate over surveillance Associated Press LOS ANGELES (AP) - <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. <mark>Hastings</mark>, who was 33, was described by many of his colleagues as an unfailingly bright and hard-charging reporter who wrote stories that mattered. Most recently, he wrote about politics for the news website BuzzFeed, where the top editor said colleagues were devastated by the loss. \"<mark>Michael</mark> was a great, fearless journalist with an incredible instinct for the story, and a gift for finding ways to make his readers care about anything he covered from wars to politicians,\" said <mark>Ben Smith</mark>, BuzzFeed's editor-in-chief. <mark>Smith</mark> said he learned of the death from a family member. Authorities said there was a car crash early Tuesday in the Hancock Park neighborhood of Los Angeles that killed a man, but coroner's officials could not confirm whether <mark>Hastings</mark> was the victim. <mark>Hastings</mark> won a 2010 George Polk Award for magazine reporting for his Rolling Stone cover story \"The Runaway General.\" His story was credited with ending Gen. Stanley McChrystal's career after it revealed the military's candid criticisms of the Obama administration. <mark>Hastings</mark> quoted McChrystal and his aides mocking Obama administration officials, including Vice President Joe Biden, over their war policies. At a Pentagon ceremony for his subsequent retirement in 2010, McChrystal made light of the episode in his farewell address. The four-star general warned his comrades in arms, \"I have stories on all of you, photos of many, and I know a Rolling Stone reporter.\" When he died, <mark>Hastings</mark> was a contributing editor at Rolling Stone, where Managing Editor Will Dana was quoted Tuesday saying <mark>Hastings</mark> exuded \"a certain kind of electricity\" that exists in great reporters whose stories burn to be told. \"I'm sad that I'll never get to publish all the great stories that he was going to write, and sad that he won't be stopping by my office for any more short visits which would stretch for two or three completely engrossing hours,\" Dana said. <mark>Hastings</mark> was also an author of books about the wars. \"The Operators: The Wild and Terrifying Inside Story of America's War in Afghanistan\" was published late last year and details shocking exploits of the military overseas. In 2010, with the publication of \"I Lost My Love in Baghdad,\" <mark>Hastings</mark> told the story of being a young war correspondent whose girlfriend died in Iraq. \"<mark>Michael Hastings</mark>' death cuts short a life dedicated to speaking truth to power. He believed that journalists must be more than bystanders; he was a truthteller, a charming provocateur and a relentless seeker of decency in a nasty world,\" said <mark>David Rosenthal</mark>, president of The Blue Rider Press, which published \"The Operators.\" In the summer 2013 issue of Vermont Life magazine, <mark>Hastings</mark> was quoted telling an audience at the Burlington Book Festival that he doesn't believe in objectivity in journalism. \"What I try to do is be intellectually honest in my writing,\" he said. <mark>Hastings</mark>' family moved to Vermont when he was 16, a state he told the magazine was his \"spiritual home.\" According to the magazine, he lived in New York with his wife. All content? Copyright 2000 - 2013 WorldNow and WGEM. All Rights Reserved."}, {"articleID": "2017061707_00619514_W", "names": {"Chris Carter": ["Q1017050", "Q1077082", "Q1077084", "Q15953386", "Q27120913", "Q2964680", "Q355398", "Q437267", "Q5106106", "Q5106107", "Q5106108", "Q5106109", "Q5106110", "Q5106111", "Q55208181", "Q58062201", "Q9190902"], "Mason Williams": ["Q339892", "Q6783644"], "Masahiro Tanaka": ["Q11575599", "Q11575656", "Q911463"]}, "date": "2017-06-17", "url": "https://sports.yahoo.com/starter-hahn-looking-forward-facing-yankees-071819377--mlb.html?src=rss", "content": "OAKLAND, Calif.--Oakland Athletics right-hander Jesse Hahn is no stranger to the mystique and history of the New York Yankees. He grew up in Connecticut, watching countless Yankees games on television, even though much of his family was from Pittsburgh and he was a Pirates fan. But it was while Hahn attended Virginia Tech that he became a true fan of the Yankees. \"When I was in college at Virginia Tech after the massacre we had there in 2007, they came and played a memorial game for us and donated money to the school,\" Hahn said Friday. \"I've always had much respect for those guys. It's cool just to be pitching against the New York Yankees.\" On April 16, 2007, a student at Virginia Tech shot and killed 32 people at the university before killing himself. Hahn will make his third career start against the Yankees on Saturday afternoon in the third of a four-game series at the Oakland Coliseum when the A's will try to make it three straight wins against New York. Oakland won the series-opener 8-7 in 10 innings on Thursday night and beat the Yankees 7-6 on Friday night, handing them their season-high fourth straight loss. \"It's part of the game, every team's going to go through it,\" Yankees manager Joe Girardi said of the skid. \"I'm pleased with the way we keep fighting back and that will bode well during the course of the season. Right now, our bullpen's been in a little bit of disarray. We'll get that straightened out.\" Hahn is 0-2 with a 5.40 ERA in two starts against the Yankees, both at the Coliseum. \"This is a complete different lineup over here, a very strong one,\" Hahn said of the Yankees. \"I believe they're one of the best in baseball. So I've got to go out there and pitch my game and have confidence out there tomorrow.\" Rookie right fielder Aaron Judge went 2-for-3 with his major league-leading 23rd home run, a three-run shot, on Friday, and first baseman <mark>Chris Carter</mark> had a solo home run for New York. The Yankees had plenty of offense, despite having four regulars out of the lineup. Catcher Gary Sanchez (strained groin) and center fielder Aaron Hicks (strained Achilles tendon) were out with injuries and remained day-to-day. Left fielder Brett Gardner and shortstop Didi Gregorius had scheduled days off, although Gardner pinch hit in the ninth. <mark>Mason Williams</mark>, who was called up from Triple-A Scranton/Wilkes-Barre and started in center, had a hit and scored a run. Hahn will make his third start since a stint on the disabled list with a strained right triceps. He's 1-0 with a 2.45 ERA in his past two starts and 2-4 with a 3.56 ERA for the season. On June 6, Hahn allowed one run on seven hits in a 4-1 victory against Toronto at the Coliseum. Then on Sunday on the road against Tampa Bay, Hahn had a no-decision in a 5-4 loss. Hahn gave up three runs--all in the fifth inning--on seven hits. \"I thought the last one went well,\" Hahn said. \"I just had that one inning where they strung together a couple good hits. I'm not going to say I was hit hard, because I don't think I was by any means. But they had a good approach on me that inning and were able to get some timely doubles, timely hitting. I gave up three and was able to get out of it after that.\" Hahn has allowed one home run in 60 2/3 innings and will face a Yankees team that has hit 108 homers, the most in the major leagues Yankees right-hander <mark>Masahiro Tanaka</mark> (5-6, 6.55 ERA) will make his 14th start of the season. In his last start, he gave up one run on two hits over seven innings with eight strikeouts and two walks in a 16-3 victory against Baltimore. <mark>Tanaka</mark> had a no-decision in his only career start against the A's, a 7-3 loss on April 21, 2016. He allowed two runs on seven hits over six innings, struck out four and walked none."}, {"articleID": "2010031713_00067904_W", "names": {"Jose Luis Rodriguez": ["Q3052148", "Q54512527"]}, "date": "2010-03-17", "url": "http://boston.com/news/world/europe/articles/2010/03/17/spain_blames_eta_for_death_of_french_policeman?rss_id=Boston.com+--+Latest+news", "content": "spain blames eta for death of french policeman by angela doland associated press writer / march 17, 2010 e-mail this article to: invalid e-mail address add a personal message: (80 character limit) your e-mail: invalid e-mail address sending your article your article has been sent. e-mail | print | | text size - + paris - spain's prime minister blamed the basque separatist group eta on wednesday for the shooting death of a french policeman, while france's anti-terrorism police interrogated one suspect and tried to track down at least one other assailant who escaped. the shooting tuesday of a 53-year-old officer outside paris marked the first time eta has killed a member of the french police, spanish media said. eta has traditionally used france as a refuge and a staging ground for attacks in spain. french police have been cracking down on members hiding out in france, and the shooting came soon after the group's suspected leader was arrested here. \"france has paid a high price for its help against eta,\" spanish prime minister <mark>jose luis rodriguez</mark> zapatero said at an impromptu news conference. a former eta member said the police killing in the eastern paris suburb of dammarie-les-lys did not appear to be a calculated shift in eta strategy--willful violence in a country long spared the type of attacks waged across the border. rather, he said, it seemed to result from on-the-spot thinking by a unit confronted by police. he said eta crossed a line it had avoided until now by killing a member of french security forces. france may react with a crackdown, and eta might be forced to keep an even lower profile for a while, said the former eta member, who spoke on condition of anonymity, citing the sensitivity of the case. it was the first killing this year blamed on eta. the last one was a car bomb that killed two civil guards in july on the spanish mediterranean island of mallorca. the exact circumstances of the shooting were still unclear. one french police official said the suspected eta commando unit was allegedly trying to steal cars tuesday when it was surprised by police. the gunfight started after four officers approached a suspicious vehicle near a used car dealership in dammarie-les-lys, he said. one of the suspects opened fire on the officer, who was hit by two bullets and died soon afterward, said the official, who spoke on condition of anonymity in keeping with department policy. the suspect being questioned was a spanish basque wanted on a european arrest warrant issued by authorities in spain, the police official said. officials were analyzing his weapon to see if it was the gun used to kill the officer. authorities were still searching for at least one other suspect. eta's alleged leader was arrested in france on feb. 28. ibon gogeascoechea and two other suspected eta members had been hiding out in a cottage rented with false identity papers when they were apprehended. gogeascoechea was the fifth eta leader arrested in spain or france since may 2008. although this is first killing of a french policeman blamed on eta, the group has been involved in shootouts with french security forces at least four times since 1988, and four french police officers have been wounded, the spanish newspaper el pais reported. so far this year, 34 eta members have been arrested: seven in france and the rest in spain, according to the spanish interior ministry. the figure includes the detainee in the policeman's killing. the spanish prime minister said he planned to speak with french president nicolas sarkozy and expressed his condolences to the family of the slain officer. his comments were the first official ones in spain or france linking eta to the shooting. zapatero pledged that spain and france will \"maintain a relentless fight against the criminals of the terrorist gang eta.\" eta has killed more than 825 people since the late 1960s in its campaign for an independent basque state in northern spain and southwestern france .------associated press writer daniel woolls in madrid contributed to this report. © copyright 2010 associated press. all rights reserved. this material may not be published, broadcast, rewritten, or redistributed. more articles in europe"}]