[{"date": "2015-07-27", "url": "http://channelnewsasia.com/news/business/us-private-sector-vows-to/2011830.html", "content": "US private sector vows to ante up on climate finance - Channel NewsAsia US private sector vows to ante up on climate finance POSTED: 28 Jul 2015 05:35 Email A WASHINGTON: Some of the biggest U.S. corporate names on Monday offered their support: and billions of dollars in green financing pledges: to buttress the Obama administration's quest for a global agreement on combating climate change. Google, Apple, Goldman Sachs and 10 other well-known companies joined the White House in launching the American Business Act on Climate Pledge, a campaign that the White House said would inject US $140 billion in low-carbon investments into the global economy. Massive private sector commitments are seen by participants as essential to getting a global agreement on climate change in Paris in December. Emerging nations have demanded that any agreement include tens of billions of dollars in financing from developed nations to help their economies adapt to a low-carbon future. Although not all the corporate pledges represented new commitments, Monday's announcement showed the administration's ability to get private sector buy-in for international climate change financing. Mindy Lubber, president of environmental investor group Ceres, applauded the announcements but said the White House cannot rely solely on these pledges. \"Voluntary commitments alone will not get us the meaningful reductions we need,\" she said. \"Strong carbon-reducing policies are hugely important .\" None of the companies involved in Monday's announcement were from the fossil fuel sector of the economy, though the White House said there could be a second round of pledges in the fall ahead of the Paris conference. Other companies included General Motors, Bank of America, Microsoft and Coca Cola, many of which also announced measures to reduce their own greenhouse gas emissions and deploy more clean energy. The White House said the companies' promises would lead to at least 1,600 megawatts of new renewable energy being brought on line. Water-use intensity would be reduced by 15 percent and the companies would target zero net deforestation in their supply chains. Google, which claims to be the biggest corporate purchaser of renewable power globally, pledged to triple those purchases over the next decade. In a blog post on Google's website, CEO <mark>Eric Schmidt</mark> said while the private sector can play a leadership role on climate change, it needs political certainty to encourage companies to scale up their investments. \"We need the world's political leaders to confirm that investments in clean energy are sound, and that the laws and policies meant to enable such investment will be designed for the long term,\" <mark>Schmidt</mark> wrote. Among other elements of the plan, Apple, one of the 13 companies, pledged to bring nearly 300 MW of renewable energy online in five states and the Sichuan province in China. Berkshire Hathaway said it will retire 75 percent of its coal-fueled generating capacity in Nevada by 2019. Soft-drink manufacturers Coca Cola and Pepsi Co. vowed to reduce the carbon footprint of their businesses: Pepsi pledging to expand its sustainable farming initiative for its supply chain, and Coca Cola saying it would reduce the carbon footprint of the \"drink in your hand\" by 25 percent by 2020. Obama needs voluntary private sector participation because the Republican-controlled Congress, which has power over public financing, appears reluctant to authorize extensive spending on renewable energy investments. Secretary of State <mark>John Kerry</mark> is scheduled to host an event at the State Department on October 20-21 to \"highlight American leadership in climate investment and innovative solutions to our toughest climate finance challenges .\" (Reporting By Valerie Volcovici; Editing by Bruce Wallace) - Reuters", "articleID": "2015072721_00100776_W", "names": {"Eric Schmidt": ["Q30111617", "Q51888946", "Q92747"], "John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2015-07-28", "url": "http://timescolonist.com/business/province-shutters-mine-over-spills-1.2013568", "content": "Province shutters mine over spills Gordon Hoekstra / Vancouver Sun Previous Next The province has shut down the small Yellow Giant underground gold mine on Banks Island in northwest B.C. for spilling pollution on land and into creeks, lakes and a wetland. The B.C. environment ministry said the discharge reached the ocean through a creek, several beaver-dam-created wetlands and Banks Lake before entering the ocean at Surrey Bay, but it is not believed it will harm humans or animals. The Yellow Giant incident is the latest of several mine-waste spills--although much smaller in magnitude--since the catastrophic dam failure at Imperial Metals' Mount Polley gold and copper mine in August 2014. There have been small spills at the Myra Falls and Copper Mountain mines in the past year. First Nations and conservationists are concerned about the effect of this latest spill on animals and aquatic life, including salmon, at the island about 100 kilometres south of Prince Rupert. Pacific Wild executive director <mark>Ian McAllister</mark>, who lives in the area, visited the island on Sunday to get a first-hand look. Although he was blocked from the mine site by company personnel, a drone flight he carried out showed migrating salmon splashing in Banks Creek on their way to Banks Lake. There were also salmon jumping in the ocean at the mouth of the river, six to nine metres wide, he said, noting the area is rich in biodiversity, home to herring, a unique population of sandhill cranes and genetically distinct wolves. \"Whatever discharged into the system has gone into what appears to be a very productive salmon river,\" <mark>McAllister</mark> said. Gitxaala First Nation chief Clarence Innis said they will be launching legal action against Banks Island Gold and the province to ensure environmental damage caused by the spill is cleaned up. The area is an important salmon area for the Gitxaala, as well as for other foods such as seaweed gathering, he said. \"B.C. has to stop letting this industry essentially self-regulate themselves and start holding them accountable,\" Innis said Sunday, adding they plan to carry out their own assessment of the spill. Toxicity testing by a third-party laboratory on undiluted tailings effluent showed 100 per cent survival for rainbow trout and Daphnia magna (sometimes called a water flea), according to the environment ministry. \"Based on the toxicity test results, the distance to the ocean, the tendency for suspended sediments to settle out in wetlands, and dilution capacity of Surrey Bay, there is no reason to believe that there would be any risk to humans or animals,\" ministry spokesman David Karn said in a written statement. The environment ministry has ordered the company to clean up the spill, monitor its effects and come up with a long-term plan to ensure it does not happen again. The Yellow Giant mine, owned by Vancouver-based Banks Island Gold, went into commercial production in January. On July 15, the Ministry of Energy of Mines issued a shutdown order to the mine that did not become public until late last week. \"[The mine] is shut down until an updated water management plan (including all water sources from exploration sites), tailings management plan, and erosion and sediment control plans are provided and accepted by the chief inspector of mines,\" ministry spokesman Dan Gilmore said in a written statement Sunday. That shutdown order followed a July 10 order from the environment ministry for Yellow Giant to stop releasing pollution into the environment. The province said the company had \"unauthorized\" discharges of effluent in March and also effluent and tailings discharges in June and again in July. & copy; Copyright Times Colonist \"This should be not an election issue,...Jul 25, 2015 Get the day's top Times Colonist headlines emailed to you every day at 9 a.m. Markets The Times Colonist is looking for people to deliver flyers every Thursday...Your timescolonist.com", "articleID": "2015072812_00020766_W", "names": {"Ian Mcallister": ["Q16145493", "Q21455040", "Q5982242", "Q5982243"]}}, {"date": "2015-07-29", "url": "http://www.sanfordherald.com/news/x399480147/Creating-stronger-neighborhoods", "content": "Creating stronger neighborhoods Sanford prepares for National Night Out Jul. 29, 2015 @ 05:06 AM Kathryn Trogdon Login Subscribe or link to print subscription More Fewer photos SANFORD--The first of Sanford's 2015 National Night Out events will start at 5 p.m. on Tuesday, but before the night is over, 30 other events--full of food, fun and friendship--will get underway throughout Sanford. During Sanford's 22nd year participating in the nationwide event--now 32 years running--city council members, police officers and firefighters will circulate throughout the different celebrations. \"The purpose of the event is to bring Sanford together to reduce crime in our communities and create stronger neighborhoods,\" <mark>Kelly Miller</mark>, public information officer for Sanford, said. Out of the 31 events held on Tuesday, some of the locations, including St. Thomas Episcopal Church at 312 N. Steele St., will be open to everyone. Sanford resident Joann Thaxton, coordinator for the St. Thomas gathering, has participated in National Night Out for several years. \"I just think we have to keep up with our neighbors,\" she said. \"By doing it every year, at least we remind people that we are still neighborhood people, and that [it] is really nice to know who your neighbors are--even if you don't get to see them all the time .\" The Veterans of Foreign Wars Post 5631 at 1500 Webb St. will host its first National Night Out event, featuring food, a bouncy house, cornhole and water balloons. \"Part of our mission is to help the community, and we can help the community that we're in by providing that event for them,\" VFW Commander <mark>Craig Armstrong</mark> said. \"Hopefully, it will turn out to be a success this year .\" Next week's activities already have been promoted through several \"pre-events,\" including a tour of the Sanford Police Department, a self-defense class in Depot Park, a summer safety day in downtown Sanford and a tour of the Central Fire Station. <mark>Miller</mark> said a movie night also may be included as one of the \"pre-events\" next year. \"[This year's events] were a lot of fun,\" <mark>Miller</mark> said. \"We had a good time with our residents, and we had good cooperation from the police department, fire department, Partnership for Children and Black Belt Leadership Academy .\" Due to National Night Out, the Sanford City Council's regular meeting will be moved up to 1 p.m. Tuesday in the council chambers at the Sanford Municipal Government Center at 225 E. Weatherspoon St. National Night Out locations Woodbridge Forest/Cliffs Pool on Fernridge Drive--5-7 p.m. St. Thomas Episcopal Church at 312 N. Steele St.--5-7:30 p.m. Church of God of Prophecy at 628 Scott Ave.--5:30 -8 p.m. Walter H. McNeil Park on Pineland and Martin streets--5:30 -8:30 p.m. 300 block of Green Street--5:30 -8 p.m. Bridges Pond Subdivision--5:30 -8:30 p.m. Carbonton Heights Community Park on Knollwood Road--6-7:30 p.m. West Landing Pool Parking Lot on Westcott Circle--6-7:30 p.m. Utley Plaza Apartments on Winslow Drive (in the park)--6-8 p.m. Corner of Belford Drive and Mahogany Court--6-8 p.m. 110 12th St.--6-8 p.m. Monarch Lee PSR at 214 McIver St. 6-8 p.m. \"Circle\" at Hudson Avenue--6-8 p.m. VFW at 1500 Webb St.--6-8 p.m. Hawkins Run at the pool--6-8 p.m. Forest Hills at 322 Mayflower Circle--6-8 p.m. First Congregational Christian Church at 328 McIver St.--6-8 p.m. Carr Creek Subdivision at the park--6-8 p.m. 1022 S. Vance St.--6-8:30 p.m. 1101 S. 7th St.--6-8:30 p.m. 801 Stoney Brook Drive--6-8:30 p.m. Fairway Woods Subdivision at 600 Fairway Drive--6-9 p.m. Buffalo Presbyterian Church at 1333 Carthage St.--6-9 p.m. 281 Glendale Circle--6:30 -7:30 p.m. Spring Lane Assembly of God at 1715 Spring Lane--6:30 -8 p.m. Berkley Place Park at 1408 Hooker St.--6:30 -8 p.m. North Pointe Pool on Morningside Drive--6:30 -8 p.m. Eames Drive Apartments across from East Lee Middle--6:30 -8:30 p.m. 1602 Briarcliffe Drive--6:30 -9 p.m. 600 Valley Road--6:30 -9 p.m. 815 W. McIntosh St.--7-9 p.m. For a map of the site locations visit The Sanford Herald Facebook Page or bit. ly/1gkgcc5.", "articleID": "2015072909_00033156_W", "names": {"Craig Armstrong": ["Q5180699", "Q674456"], "Kelly Miller": ["Q1032247", "Q22110876", "Q3194908", "Q3194910", "Q58388238"]}}, {"date": "2015-07-31", "url": "http://www.vancouversun.com/Pete", "content": "Pete McMartin: Real estate and laundered money--If it's so prevalent, why aren't we catching it? Federal investigative agency won't say whether dirty money has been identified here and realtors are adamant they comply with the reporting rules By Pete McMartin, Vancouver Sun columnistJuly 30, 2015 Laundered offshore money is blamed by some for Metro Vancouver's high real estate prices. But until the federal agency that investigates such things shares its findings, we won't know whether there's any truth to it. Fotolia. Photograph by: Africa Studio - Fotolia, Africa Studio - Fotolia If Metro Vancouver's real estate market is awash in laundered offshore money, then where is the evidence of that? Where are the arrests and court cases attesting to its existence? Where are the press releases of successfully prosecuted cases? Where are government vows to crack down on it, or even recognize it as a problem? In other countries, the problem of foreign laundered money in real estate has been more visible. In New York, the influx of plundered money from Russia, China and despotic Third World countries buying up luxury properties has been well-documented, most notably in The New York Times. In Britain, Prime Minister <mark>David Cameron</mark> vowed this week to act against corrupt foreigners buying up high-end properties there through shell companies, a practice, he suggested, that was driving real estate prices. About $245 billion-worth of real estate in England and Wales is registered offshore now, most often to shell companies with addresses in the British Virgin Islands or Jersey. The difference between Britain and Canada is that in Britain, those real estate figures are readily available. Here, they aren't. This is not to say laundered and plundered money has not been flooding into the Canadian real estate market, especially here in Metro Vancouver. It may well be. But catching it is another matter. In Canada, the federal government's investigative arm of laundered money is Fintrac--the Financial Transactions and Reports Analysis Centre. Under its system, the responsibility to report suspicious transactions or those transactions over $10,000 rests with real estate agents and their brokerages. Paperwork must be filed, and the identification of the individual or company involved in the transaction must be obtained. Penalties for not doing so are stiff, with fines up to $2 million and/or five years in prison. Yet in Fintrac's 2014 annual report, it stated there was \"a lower level of compliance\" for reporting in the real estate industry. Penalties for non-compliance, however, have been few--only seven minor fines across all of Canada--and of the half-dozen real estate agents I interviewed here, including <mark>Scott Russell</mark>, president of the B.C. Real Estate Association, all were surprised at Fintrac's portrayal of the industry's compliance. All said they were careful to comply, despite the fact they felt it did little good in identifying laundered money. Several of them said they made out Fintrac reports on every transaction they made, despite the amount. Speaking of his own firm's procedures, <mark>Russell</mark> said: \"We will not pay out on a completed deal without a Fintrac form on every single transaction, and I can tell you most brokerages are like that. This office hasn't accepted cash since before 2000, and the reason why is that it's more of a security thing for us because we had (office staff) taking bags of money to the bank .\" And most offices don't (take cash). The (Fintrac) penalties are huge, and nobody wants to be offside. \"The tales of deals being done with suitcases full of cash, he said, were just that--tales. Most often, realtors never see cash, but bank drafts or registered cheques, and only then for down payment sums that are often below Fintrac's $10,000 cut-off figure for reporting. The big closing sums, all the realtors said, were handled by lawyers and notary publics. Due to a Supreme Court decision earlier this year, however, lawyers were ruled exempt from Fintrac reporting on the grounds it violated solicitor-client privilege. Additionally, Fintrac does not monitor leases and rental deals. Randall McCauley, vice-president of government and public relations for the Canadian Real Estate Association, has been negotiating with the federal government for the last seven years on how the real estate industry could best report to Fintrac. He was loathe, he said, to comment on Fintrac's effectiveness. Because of the confidential and sensitive nature of its investigations, he said, it may not be able to divulge its methods. But he did say that if a criminal was intent on avoiding Fintrac, there were ways to do it .\" It seems to me, \"McCauley said,\" that people with that level of money often deal with professionals like lawyers and banks and accountants, and some of them have to report and some of them don't. Big goes to big in my experience. If they were criminal and they knew what they were doing, I don't know that they'd easily run to a realtor. \"So it's an imperfect regime...If they are sophisticated criminals, and they do want to launder money through real estate in big markets, there are huge gaps where they can do that without ever talking to a realtor .\" Is there laundered money in Metro Vancouver's real estate? Possibly. Likely.", "articleID": "2015073118_00058194_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Scott Russell": ["Q1360222", "Q4353179", "Q7437173", "Q7437174"]}}, {"date": "2015-08-04", "url": "http://juneauempire.com/sports/2015-08-04/weldon-wins-judo-medals", "content": "Weldon wins judo medals Photos COURTESY PHOTO Juneau-Douglas High School junior Cody Weldon is shown with his Silver and Bronze medals won during the Summer Nationals in Indianapolis, Indiana, and the Junior Nationals in Fort Lauderdale, Florida. By Klas Stolpe JUNEAU EMPIRE Incoming Juneau-Douglas High School student Cody Weldon has added another top sport to his wrestling, skiing and track resume. Weldon, 16, is a purple belt and has been a member of the Capital City Judo Club for seven years. \"I like judo because of the discipline,\" Weldon said. That discipline took Weldon through a medal-winning summer. He participated in the 2015 Summer Nationals in Indianapolis, Indiana, on July 11, winning a Silver medal in the tournament as a 90-kg Juvenile Division competitor. Weldon then went to a camp in Fort Lauderdale, Florida, from July 14-16, taught by Cuba Olympic Judo members <mark>Israel Hernandez</mark> and Amarilis Savon. After that camp, Weldon participated in the 2015 U.S. Junior Opens on July 18-19, also in Fort Lauderdale, taking a bronze medal in the 90 kg Juvenile Division. This was an international tournament in which 22 countries were represented. Weldon fought against judoka from Mexico, Puerto Rico and multiple judoka from the United States. \"It was a really good experience,\" Weldon said. \"It was interesting to see all the different styles from all the different areas that the judoka were from .\" Capital City Judo Club sensei Jay Watts appreciates Weldon's work ethic. \"Over the past two years, he has become a serious student in the sport of judo,\" Watts said. \"Not only does he practice 2-3 days per week but he does weight training, conditioning and wrestles with the JDHS team. Everyone at Capital City Judo is very proud of Cody for his recent accomplishments .\" ", "articleID": "2015080415_00075038_W", "names": {"Israel Hernandez": ["Q5802760", "Q6086976"]}}, {"date": "2015-08-05", "url": "http://feeds.reuters.com/~r/reuters/INbusinessNews/~3/tJR9wI-q2m4/story01.htm", "content": "Standard Chartered halves dividend, new CEO says could raise capital LONDON A man walks past the head office of Standard Chartered bank in the City of London February 27, 2015. Reuters/Eddie Keogh/Files LONDON Standard Chartered (STAN. L) halved its dividend and said it would raise capital from investors if needed, as new chief Executive <mark>Bill Winters</mark> outlined his thoughts on reviving a bank hit by a 44 percent slump in first-half profit. Shares in the Asia-focused lender rose 4.5 percent to 994.9 pence on Wednesday as investors welcomed <mark>Winters</mark>' move to set a target to double return on equity to a minimum of 10 percent. That helped offset disappointment over the cut to the dividend for the first half of the year to 14.4 cents a share from 28.8 cents a year ago. The bank said it had \"rebased\" the payout to reflect its \"current earnings expectation and outlook\". As a result of the cut, StanChart said its common tier 1 equity position, a key measure of capital strength, had risen 80 basis points to 11.5 percent, six months ahead of target. <mark>Winters</mark>, who became CEO in June, did not rule out raising capital in future. \"If we decide we need capital for the long-term benefit of the group, we will raise capital,\" he said. The bank said its pretax profit in the first six months of the year fell to $1.82 billion, down 44 percent from a year ago. StanChart has suffered a troubled three years, hurt by problems including fines from U.S. regulators for misconduct, strained relations with top shareholders, plunging commodities prices and a weakened trading environment. On his first day in charge, <mark>Winters</mark> told investors the bank needed to strengthen its finances and simplify operations to increase shareholder returns. The lender has struggled to shake off concerns it will need to raise additional capital to bolster its balance sheet, especially if Asian economies that have traditionally served as the biggest drivers for its revenue growth continue to falter. The lender is aiming for cost savings of $1.8 billion by the end of 2018. Some analysts have said <mark>Winters</mark> needs to raise at least $5 billion from a rights issue and a dividend cut to strengthen the balance sheet and generate cash to grow lending and kick-start revenue growth. <mark>Winters</mark> has already shaken up the bank's management structure, streamlining its eight geographical regions into four units that will report directly to him. (Reporting by Steve Slater and Sinead Cruise; Editing by <mark>Mark Potter</mark>) Trending On Reuters", "articleID": "2015080509_00122108_W", "names": {"Bill Winters": ["Q19663112", "Q27958920"], "Mark Potter": ["Q6769304", "Q6769305"]}}]