[{"articleID": "2019102813_00196098_W", "names": {"John Collins": ["Q10387544", "Q20645386", "Q20984420", "Q22979302", "Q26254380", "Q28935742", "Q29438451", "Q30122510", "Q47504584", "Q51586365", "Q52154681", "Q57413181", "Q57437992", "Q6111740", "Q6226714", "Q6226717", "Q6226721", "Q6226723", "Q6226726", "Q6226733", "Q720921", "Q961079"]}, "date": "2019-10-28", "url": "http://www.wsbtv.com/sports/trae-young-wanted-to-start-the-season-off-strong-hes-done-that-and-more/1002277577?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Oct 28, 2019 - 9:30 AM Loading...Trae Young wanted to start the season off strong. He's done that and more. ATLANTA - Four days before the Hawks had even played an exhibition game this season, Trae Young had a fast start on his mind. In his rookie year, Young improved in the second half, making it a much tighter race for Rookie of the Year than most expected, though the Mavericks' Luka Doncic eventually took home the prize. Sure, <mark>John Collins</mark> had missed the first 15 games of last season with an ankle injury, and the chemistry he and Young developed upon his return was key for the Hawks, but Young wasn't buying that as an excuse. \"I just want to see myself start out better than I did,\" Young said Oct. 3. \"I think people judged my whole season off the way I started and so for me, I want to start better and just use that momentum that I had to end the season to begin it.\" Through two games, albeit a small sample size, Young has done just that, and in a historic fashion. As of Sunday, he's the NBA's leading scorer at 38.5 points per game, helping lead the Hawks to a 2-0 start. Young became the first NBA player to tally at least 38 points, seven rebounds and nine assists in each of his team's first two games of the year. Sustaining that pace is highly unlikely, but it's quite an accomplishment, especially this early in the season, and it's helped the Hawks start off on a better note than last year (they went 0-2 their first two games and were 3-16 by Nov. 23). Young had 38 points, seven rebounds and nine assists in the Hawks' season-opening win in Detroit Thursday, then followed it up with 39 points, seven rebounds and nine assists in their home opener Saturday, a 103-99 win over Orlando, a team that beat the Hawks four times last season (his banked-in 3-pointer with 26.2 seconds to play was the dagger, giving the Hawks a 102-97 lead). \"The stars shine brightest in those type of moments,\" Young said of his play in the final minutes. \"That's what makes the big-time players who they are. They step up in those moments for their team and it helps them win. So for me, it's just the mentality you have to have. And for me, I feel like I have it.\" Young attributes his strong start to work he put in during the offseason, and also growing more comfortable in the league in Year 2. \"I put in a lot of work this summer and just for me, going into my second year, I knew what to really work on,\" Young said. \"Going in as a rookie is kind of hard, you don't know what to expect. You just go in there with an open mind. But going into my second year I knew what I needed to get better at and I did it, and my hard work is paying off right now.\" Through two games, Young is shooting 58.7 percent from the field and 55 percent from 3-point range (taking an average of 10 per game). Again, it's likely his numbers will cool off a bit. As a rookie, Young shot 41.8 percent from the field and 32.4 percent from 3-point range. He shot 34 percent from 3-point range and in October but struggled from the perimeter in November, shooting 19.8 percent from 3 (taking an average of 5.4 per game). His 3-point shooting is the main difference second-year coach Lloyd Pierce identified when comparing the beginning of last season to the beginning of this one. \"We all know last year, this time, early in the season, he just wasn't, from the 3, he just wasn't making those shots,\" Pierce said. \"And because he is now, the lane just opens up even more. They've got to chase him over screens. Last year, at this time, they were going under everything.\" That forced Young to take some poor shots. Against Orlando, Pierce saw Young get into a rhythm early (his first shot was a floater), then when Young started sinking 3-pointers, the Magic had to start defending Young farther up the floor, which opened things up further for the Hawks. \"He's getting his rhythm just getting downhill and he's getting floaters, then eventually they've got to step their bigs up the floor and chase him over screens, and he gets going hitting one of those 3's, now he can pick his poison with getting downhill, shooting 3's, the defense collapsing, he can make passes to the weak side, but I thought his first three shots were all in rhythm, they were all floaters, they were all in the paint, he was attacking downhill, and it just opens up everything for us.\" Remaining the NBA's leading scorer certainly isn't the focus for Young. Whether it's 40 points or 40 assists required from him to get the win, he said, the end result is what matters to him. \"Hell nah,\" Young said when asked if being the league's leading scorer is his goal. \"That's not my goal. I don't care about all that. I'm just caring, focusing on winning.\" This article was written by Sarah K. Spencer, who covers the Hawks for The Atlanta Journal-Constitution. © 2019 Cox Media Group."}, {"articleID": "2011020417_00130977_W", "names": {"Daniel Paille": ["Q3014520", "Q764908"], "Mike Murphy": ["Q16105172", "Q18636626", "Q1933384", "Q1933388", "Q305109", "Q43435157", "Q6848141", "Q6848143", "Q6848146", "Q6848148", "Q6848150", "Q7484818"], "Colin Campbell": ["Q1108386", "Q1108388", "Q1108411", "Q1108531", "Q19414277", "Q22323626", "Q27345368", "Q43911673", "Q5144955", "Q5144956", "Q5144961", "Q55469116", "Q5601509", "Q5601513", "Q56380383", "Q56524218"], "Mike Brown": ["Q1102021", "Q16200455", "Q16213884", "Q17306282", "Q1933055", "Q1933070", "Q2757687", "Q298913", "Q3313242", "Q3857364", "Q41790047", "Q4274643", "Q437776", "Q458065", "Q6380458", "Q6846151", "Q6846155", "Q6846156", "Q6846157"], "Matt Martin": ["Q22096057", "Q3299518", "Q504365", "Q6789012", "Q6789013"]}, "date": "2011-02-04", "url": "http://thehockeynews.com/articles/38144-Bruins-forward-Daniel-Paille-suspended-four-games-for-blindside-hit.html", "content": "bruins forward <mark>daniel paille</mark> suspended four games for blindside hit 2011-02-04 12:20:00 toronto - boston bruins forward <mark>daniel paille</mark> was suspended four games by the nhl friday for delivering a blindside hit to the head, becoming the fifth player to receive a ban under rule 48 this season. <mark>paille</mark> hit dallas stars forward raymond sawada on thursday night and received a match penalty on the play. sawada suffered a broken nose and a shoulder sprain. the nhl's discipline review was conducted by senior vice-president of hockey operations <mark>mike murphy</mark> because league disciplinarian <mark>colin campbell</mark>'s son gregory plays for the bruins. \"<mark>paille</mark> delivered a lateral hit where the principal point of contact was his opponent's head,\" <mark>murphy</mark> said in a statement. \"additionally, the injury suffered by the dallas player was a factor in this decision.\" <mark>paille</mark> will forfeit us $23,118.28 in salary and is eligible to return feb. 15 against toronto. the rule 48 penalty for illegal checks to the head was brought in prior to the season and has been the subject of much debate. the other four players suspended this year for head hits are: toronto's <mark>mike brown</mark> (three games); islanders winger <mark>matt martin</mark> (two games); san jose's joe thornton (two games); and shane doan of the coyotes (three games). view all \"the ducks are one of the teams that i've been talking to. it goes both ways, right? i'm looking for a position for ray. there's some teams that have been receptive to discussing him, and they're one of them.\" "}, {"articleID": "2015020601_00042503_W", "names": {"Robert Siegel": ["Q2158822", "Q2855841", "Q7349789"]}, "date": "2015-02-05", "url": "http://wboi.org/post/red-notice-success-draws-treachery-tragedy-putins-russia", "content": "Interview: Andy Downs on Pence Administration's Proposed News Service Bill Browder crosses Red Square in 2004, at the height of the Hermitage Fund's success. Sergei Magnitsky, shown in 2008, was Browder's attorney. He investigated a 2007 incident in which Russian law enforcement officers raided Browder's offices and stole $230 million in taxes that Browder's companies had paid to the Russian government. He was arrested, tortured and, in 2009, beaten to death by eight guards in full riot gear. William Browder's new book, Red Notice, is named for the type of warrant the Russian government has sought from Interpol in hopes of capturing him. Hermitage Capital Management, a company he started in Russia in 1996. That, he says, drew the attention and machinations of a corrupt group of Russian officials. In an interview with NPR's <mark>Robert Siegel</mark>, Browder discusses Red Notice and his experiences in Russia - which he calls \"a place where lies reign supreme\" in his book - as well as why he made an unusual capitalist missionary to the post-Soviet nation. Interview Highlights On growing up as the grandson of a Communist Party USA leader When you come from a family of communists and you go through your teenage rebellion, what's the best way of rebelling from a family of communists? Well, I put on a suit and tie and became a capitalist...there was nothing I could do to upset my family more than that. What was most remarkable about it was that it involved just about everybody right up the chain of command, up to probably a Cabinet-minister level. So they applied for this illegal tax refund after stealing our companies. And they applied for it on the 23rd of December, 2007, and it was approved and paid out one day later - a $230 million tax refund, the largest refund in Russian history, paid out, with no questions asked ....And then the police go around to all of our banks looking for assets - but they didn't find anything there, because I had taken all the money out beforehand. We had $4 billion worth of assets and we sold every last penny and got it out of the country. Russia is an interesting place because they're extremely evil but they're not that good at implementing their evil. So they kicked me out in 2005 and it took 18 months before they actually started moving forward on their scam. As we learned about these raids and their frustration in not finding anything, I started to laugh because, I thought, all this effort...and they didn't get anything. On his lawyer Sergei Magnitsky Sergei was working with us on the investigation. And Sergei as I was laughing said: \"Bill, you shouldn't relax. And the reason you shouldn't relax is there's much more to the story. There's never a sort of clean and happy ending like you think.\" He was an idealist, a man of a new generation of Russians, and he thought that the country was a normal country. And so he thought, if police officers were involved in the theft of $230 million, that he would report that. And so he testified against a number of police officers involved, hoping that the good guys would get the bad guys. Instead, he was arrested in November of 2008. They put him in pretrial detention, and then they started to torture him to get him to withdraw his testimony. They put him in cells with 14 inmates in eight beds, left the lights on 24 hours a day to impose sleep deprivation. They put him in cells with no heat and no window panes in December in Moscow, so he nearly froze to death. They put him in cells with no toilet, just a hole in the floor where the sewage would bubble up ....They wanted to get him to withdraw his testimony against the police officers and sign a false confession to say that he stole the $230 million. And Sergei, in spite of this ever-increasing torture, refused to perjure himself. For him the idea of lying was worse than the idea of being tortured. And so the torture got worse and his health broke down. He ended up losing 40 pounds, getting very severe pains in his stomach and being diagnosed as having pancreatitis and gallstones, and needing an operation. And a week before the operation was due, they came to him again with this Faustian bargain of \"you sign a confession and then you can have your medical care.\" He refused to sign this false confession. He went into critical condition. He was supposed to be taken to a prison with a hospital, but instead they put him in an isolation cell, and eight riot guards with rubber batons beat him to death on Nov. 16, 2009. Encore Again At Trinity Episcopal Church"}, {"articleID": "2009111810_00132012_W", "names": {"Chris Walker": ["Q16196322", "Q21020894", "Q22811338", "Q2920788", "Q3675577", "Q42370515", "Q5108393", "Q5108394", "Q5108395", "Q5108396", "Q606715"]}, "date": "2009-11-18", "url": "http://shreveporttimes.com/article/20091118/SPORTS0202/911180310/McCluster-is-everything-LSU-wants-Shepard-to-be", "content": "your browser's security settings are preventing some features from appearing. mccluster is everything lsu wants shepard to be junior runs wildcat offense for ole miss. baton rouge - ole miss slash player dexter mccluster, who plays tailback/wide receiver/wildcat quarterback, is 5-foot-8 and 165 pounds. lsu slash player russell shepard, who plays tailback/wide receiver/wildcat quarterback, is 6-0 and 185 pounds. mccluster has 1,177 all-purpose yards for seventh in the southeastern conference - 755 rushing and 394 receiving - with eight touchdowns. shepard has 272 all purpose-yards - 248 rushing and 24 receiving - with two touchdowns. shepard is only a freshman. mccluster is a junior, and his numbers as a freshman were similar to that of shepard now as mccluster had 232 receiving yards and 68 yards rushing with two touchdowns. \"i think he's a very talented player,\" mccluster said of shepard on tuesday. \"his time will come. i had to wait for my chance.\" no. 10 lsu (8-2, 4-2 sec) and ole miss (7-3, 3-3 sec) will get to compare wildcat players saturday when they meet in oxford, miss., at 2:30 p.m. on cbs. there was no waiting by mccluster last saturday as he set the school record with 282 rushing yards on 25 carries with touchdown runs of 71, 32, 23 and 15 yards in a 42-17 win over tennessee. he added four catches for 42 yards to set the record for all-purpose yards at 324. the 282 yards broke the mark of 242 set by dou innocent in 1995, while the 324 yards broke deuce mcallister's record of 317 yards in 1999. the walter camp foundation named him the national player of the week. over ole miss' last three sec games, the largo, fla., native has totaled 787 yards. \"i've watched a lot of his film just in the last 24 to 48 hours,\" miles said on monday. \"and i can just tell you that he has great speed. he anticipated the cut. he's tough to touch, and he's a physical runner as well. he'll pound it up in there. he's a very talented runner.\" mccluster is averaging 7.1 yards per carry. shepard is averaging 7.1 yards per carry. miles said experience is what has kept shepard's touches down as he often struggles with his knowledge of the play and alignment. \"i would always be a little bit more ambitious for a quality player like russell shepard,\" miles said when asked if he thought shepard would have put up larger numbers by now. (2 of 2) \"what happens is experience is a very key component, and sometimes as coaches we go by that for talent,\" he said. \"i think it's fortunate that he's had the year that he's had, and then i think there is always the opportunity that he could certainly have done better. and we could certainly have done better with him. that being said, hopefully, we'll finish the remainder of these games where he gets a number of touches and continues to add to his experience.\" maybe all that film study of mccluster by miles will help shepard's cause. tennessee had not seen anything like mccluster's cluster of rushes in 113 seasons of football. the previous high rushing yards against the volunteers were 217 by both mike pritchard of colorado in 1990 and alabama's bobby humphrey in 1986. mccluster knew it was his day early on. less than two minutes into the game, he scored his first touchdown on a 15-yard run. the 23-yard touchdown followed with 1:20 to play in the period. \"oh yeah, definitely,\" he said. \"once i scored that second touchdown in the first quarter, i had a feeling it was going to be special for the rest of the day. they never really made any adjustments for me. i knew i was going to be featured going into the game, but once we got rolling they couldn't stop us. i know i can always make one guy miss, and we were able to do that all day. i'd love to get 30 touches on a day like that.\" tennessee coach lane kiffin counted more than one miss, and some of the misses were not even close. \"he set the school record for rushing yards, and we probably set a school record for missed tackles,\" kiffin said. \"guys had angles on him and never even touched him.\" the 71-yard touchdown was a simple play up the middle designed to get a first down, but mccluster never stopped. \"they have some good players at florida and at alabama, but he's the best player we've faced all year,\" tennessee defensive end <mark>chris walker</mark> said. \"the kid did what he wanted to do to us.\" lsu's players have been watching the same film that miles has seen. you must fill out the comment body in order to submit a comment. the comment you have entered is too long. please limit your post to {maxchars} characters or less. ole miss' dexter mccluster comes into the lsu game after setting a school rushing record last week. (ap)"}, {"articleID": "2017052504_00209065_W", "names": {"David Watkins": ["Q16751000", "Q27042011", "Q3018959", "Q3018961", "Q5240866", "Q5240867", "Q56596996"]}, "date": "2017-05-25", "url": "http://kdhnews.com/news/local/fire-destroys-unoccupied-house-near-belton-officials-say/article_ae8f3bfc-40f6-11e7-8c4c-2f9b84ecd8bf.html", "content": "BELTON--Thick smoke seen for miles across Bell County was the result of a blaze that destroyed an unoccupied house Wednesday evening. The fire occurred at about 7:15 p.m. at a house in the 7600 block of Sparta Road near Moon Rise Trail. An onlooker said he saw the smoke on Interstate coming from Jarrell. Bell County Fire Marshal Steve Casey was investigating the cause of the fire, which nearby residents said appeared to spread rapidly. \"It went up super fast,\" said <mark>David Watkins</mark>, 25, a next-door neighbor. \"We looked out the window, saw all this smoke and then fire trucks started showing up.\" The fire occurred about a mile from the Sparta Road headquarters of the Sparta Volunteer Fire Department. It was the first agency to respond, according to Pat Beard, president of the department's board. The charred remains of the house smoked for hours as the sun set on the rural Lake Belton neighborhood near Fort Hood. The house was unoccupied and was used for storage, neighbors said. Firefighters from Central Bell Fire & Rescue, and the Belton, Fort Hood, Salado and Morgan's Point Resort fire departments responded."}, {"articleID": "2017100107_00273519_W", "names": {"Air Chief Marshal": ["Q20558586", "Q28058490", "Q57628281", "Q58093922", "Q58111012", "Q58211999", "Q58375097"]}, "date": "2017-10-01", "url": "http://daijiworld.com/news/newsDisplay.aspx?newsID=474594", "content": "Ambala airbase gearing up for Rafale fighters Ambala airbase gearing up for Rafale fighters Sun, Oct 1 2017 12:26:24 PM By Anjali Ojha Ambala, Oct 1 (IANS): The Indian <mark>Air</mark> Force airbase here, one of IAF's oldest, is getting a slew of upgrades, including new hangars, tarmac and simulator for flight training, as it prepares to welcome the country's newest fighters, the French Rafale--the first new combat jet to be inducted in close to 20 years. A French team has already visited the airbase and a preliminary study has been completed. While some of the existing infrastructure will be used for the new Rafale squadron, additional infrastructure in the form of at least 14 new shelters, new hangars, new operating surfaces, a de-briefing room and a facility for simulator training will be created, for which Rs 227 crore ($35 million) has been sanctioned. \"The construction work for the new infrastructure will start in January or February 2018. The French team has given its requirements and the preliminary work has been completed,\" the Commanding Officer of the Ambala airbase, <mark>Air</mark> Commodore L.K. Chawla, told IANS, adding that the upgraded infrastructure is expected to last at least 40 to 50 years. The French team has promised a 70 percent serviceability factor for the Rafales and there is also a long-term contract for the supply of spares. Golden Arrows, 17 Squadron, will initially comprise four Rafales that are likely to arrive in September 2019, with the number being gradually ramped up to a full-strength of 18 by 2022. The squadron had seen action during the 1999 Kargil War with Pakistan when it flew MiG-21s under the command of the present Indian <mark>Air</mark> Force <mark>chief</mark>, <mark>Air Chief Marshal</mark> B.S. Dhanoa, then a Wing Commander. The frontline Ambala airbase, under the Western <mark>Air</mark> Command, is the principal guardian of the airspace over the national capital, a five minute flying distance away. The Pakistan border is just over 200 km away. Currently two squadrons of Jaguar fighter jets, and one squadron of MiG-21 Bisons are based in Ambala. The MiG-21s will be shifted to the Nal airbase in Rajasthan before the Rafales arrive. The second squadron of Rafales will begin arriving once Ambala is at full strength and these aircraft will be stationed at Hashimara in the east, close to the China border. India and France signed a 7.8 billion euros (Rs 59,000 crore / $8.7 billion) inter-government agreement for the purchase of 36 Rafale fighters, off the shelf, on September 23 last year. This was after prolonged negotiations over the price and other aspects of the deal, which was agreed upon during Prime Minister Narendra Modi's visit to France in April 2015. The deal includes an offset clause of 50 percent of the value of the aircraft and its weapons package will be discharged by the manufacturer through purchase from Indian firms. Leave a Comment Your Email address will not be published. Title: Ambala airbase gearing up for Rafale fighters Enter Your Name You have 2000 characters left. Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Hence, sending offensive comments using daijiworld will be purely at your own risk, and in no way will Daijiworld.com be held responsible. Security Validation"}, {"articleID": "2017051022_00815716_W", "names": {"Shelley Moore Capito": ["Q459618", "Q47506415"], "Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"], "Evan Jenkins": ["Q5415437", "Q56597319"]}, "date": "2017-05-10", "url": "http://www.eagletribune.com/news/trump-budget-would-slash-funds-from-opiate-fight/article_d1c0ac27-bbe9-5a1e-bf9f-7f5a6cd7d3a5.html", "content": "Trump budget would slash funds from opiate fight By Kery Murakami Washington Reporter 3 min ago Trump budget would slash funds from opiate fight By Kery Murakami Washington Reporter 3 min ago WASHINGTON--On a spring day in southern Kentucky two years ago, 200 worried residents gathered in rural Somerset's community center to hear police address the deadly opiate epidemic in the area. Some in the room had lost loved ones to the scourge, including Wanda Absher, whose son died of a heroin overdose. They wanted to know what the authorities were doing about it. Absher, safe schools coordinator for the Pulaski County Board of Education, helped organize the session with the help of a federal anti-substance abuse grant--the kind that President Donald Trump's recommended budget for the fiscal year starting Oct. 1 will likely eliminate. \"We can't just give people Naracan and think that's going to prevent addiction,\" she said. \"Drug prevention and education is the key to making an impact and getting to children earlier in age.\" Somerset schools have received roughly $500,000 in grants over the last five years to pay for workbooks and other materials teachers use in classrooms from kindergarten to grade 12 in their weekly discussions. Kindergarteners, for example, are warned not to assume tiny colorful pills are candy. Members of Congress representing communities ravaged by opioids have been quick to condemn Trump's budget plan to slash from $388 million to $24 million per year funding for the U.S. Office of National Drug Control Policy, and completely do away with drug-fighting grants for community groups and law enforcement agencies. \"Congress holds the purse strings for the federal government,\" said Congressman Hal Rogers, Kentucky Republican and member of the House Appropriations Committee, in a statement. \"We will ensure funding is sufficient to continue combatting the deadly drug abuse epidemic in the years ahead.\" More broadly, the concern over the sharp cuts to drug assistance programs has added to the discord between the Trump administration and Republicans in Congress over the president's spending priorities, particularly those reductions that would impact the rural areas Trump courted in his campaign. Trump wants to shift billions in spending from domestic programs to national security and projects like his Mexican border wall to stop illegal immigration. The president's preliminary budget plan released in March proposed crippling the drug policy office, cutting a number of agricultural grant programs and eliminating an agency designed to create jobs in 13 Appalachian states. Congress, though, signaled its resistance last week when it passed a short-term budget to fund the government to the end of the current fiscal year on Sept. 30. The approved measure didn't just preserve funding Trump wants to cut, including the Appalachian Regional Authority. It increased it. Sen. <mark>Shelley Moore Capito</mark>, R-W.V., in a statement Tuesday, said Congress made its feelings known it won't go along with eliminating programs it deems important to the public interest. \"Any proposal to eliminate them without a clear understanding of how their missions will be carried forth will not be considered and are not helpful to our efforts in fighting this (drug) scourge in our nation,\" she said. In the latest dispute, the Trump administration hasn't said why it is considering reducing anti-opioid funding; only that it wants to streamline government agencies. White House Budget officials have declined to comment in detail, saying it is still working on the president's budget before a final version is released later this month. But Deputy Press Secretary <mark>Sarah Sanders</mark> said last week that combatting the opioid epidemic is still a top priority for Trump. The drug policy office is seen as playing a crucial role in combating the opiate crisis. It makes sure federal agencies are on the same page in fighting addiction, administers grants and conducts research into how best to deal with the epidemic, according to the version of its website under former President Barack Obama's administration, a description that was removed when Trump took office. Also on the chopping block is the Drug-Free Communities Support Program, which provided $85.9 million in grants to 698 community groups, school districts, hospitals and others for local drug prevention efforts. The High Intensity Drug Trafficking Areas Program, which distributed $250 million in grants to local law enforcement agencies in high drug areas, is also being considered for elimination. No state is more concerned with plans to roll back federal drug assistance programs than West Virginia, where rising opioid and heroin addiction claimed 864 deaths last year, marking it as the state with the highest drug overdose death rate in the nation, according to U.S. Health and Human Services data. Sen. Joe Manchin, D-W.V., called cutting the drug policy office \"criminal\" in a statement. Manchin, a member of the Senate appropriations committee, vowed: \"I will do everything I can to prevent this from happening.\" Rep. <mark>Evan Jenkins</mark>, a West Virginia Republican, who announced Monday he is running for Manchin's seat in 2018, also opposed reductions in drug fighting efforts. \"While I can appreciate the president's desire to cut spending, the Office of National Drug Control Policy plays an important role in combating the drug crisis in West Virginia and across our nation,' said <mark>Jenkins</mark>, a member of the House appropriations committee.\" In particular, \"he added,\" the High Intensity Drug Trafficking Areas Program works hand in hand with law enforcement across West Virginia to keep dangerous drugs out of our communities. \"Kery Murakami is the Washington reporter for The Eagle-Tribune and its sister newspapers and websites."}, {"articleID": "2018011414_00967798_W", "names": {"Brad Wilson": ["Q16887049", "Q4954364", "Q4954365"]}, "date": "2018-01-14", "url": "http://www.rutlandherald.com/articles/otter-creek-solar-gets-contract-offer/", "content": "Developers have received a contract offer for one of two solar projects proposed for Windcrest Road in Rutland Town, they said Friday. The two projects would together generate more than 7 megawatts of power. FILE PHOTO The developers of the proposed Otter Creek Solar projects in Rutland Town said they have received a contract offer for the smaller of the two solar projects proposed for Windcrest Road. <mark>Brad Wilson</mark> of Ecos Energy, said Friday the two projects have yet to receive a certificate of public good from the Public Utility Commission. \"The projects have moved through the 248 process and now we're in the stage of waiting for a decision,\" <mark>Wilson</mark> said. <mark>Wilson</mark> is working for the Melone family of New York City which has several solar projects in Rutland and Bennington counties pending before the Vermont Public Utility Commission. The Otter Creek Solar project would be built on a 56-acre parcel, with the larger project on 17.5 acres, and the smaller one on 10.8 acres. The projects were split into two different projects in order to qualify for the state's renewable energy credits, which required any project to be smaller than 5 megawatts. When the projects were first proposed in 2016, Allco expected to have started construction in 2017. <mark>Wilson</mark> said recent statements at a public meeting last week in Rutland Town that the developers had pulled back from the project weren't correct. \"We are currently pursuing contracts for both,\" he said. Otter Creek Solar, a project of Allco Renewable Energy Ltd., has proposed two, side-by-side solar projects on 57 acres of forested land between Windcrest and Cold River roads. The larger of the two projects would generate 4.9 megawatts of power, and the smaller one less than half that, 2.2 megawatts. <mark>Wilson</mark> said the smaller project had received a contract offer and that Allco was currently evaluating the offer. According to a Dec. 14 order from the Public Utility Commission, it was moving the Otter Creek 2 project up on its list of project that qualify for the commission's \"standard offer' list, since a different solar project in northern Vermont had been disqualified. Power contracts are often considered key to winning approval from state regulators. In the December 14 order, the PUC said it was awarding the Otter Creek Solar 2 project a contract and was referring it to Vermont Electric Power Producers Inc. of Manchester, which administers the standard-offer process for the state. The order stated that the Otter Creek Solar 2 project was the\" least-cost proposal in this year's reserve group. \"\"The larger of the two projects does not currently have a contract,\" said <mark>Wilson</mark>, who denied that Allco was having trouble nailing down a project for the Rutland Town solar projects. The Public Utility Commission recently ordered a review of its standard-offer process, where energy developers are guaranteed a certain power rate in an effort to promote the development of alternative renewable power sources. More From Local & State Go To The Local & State Section Cornish-Windsor Covered Bridge closed due to ice jam Truck ends up in creek, driver missing Red Cross opens evacuation center in Swanton due to flooding"}, {"articleID": "2019062212_00225338_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-22", "url": "http://www.gamereactor.eu/?system=switch&sid=64ce64bcf57169d36065fdf229f95c39", "content": "Switch The golden age of kart racers continues as Crash joins Mario and Sonic on the starting line. Preview Written by Lisa Dahlgren on the 21st of June 2019 at 16:08 Capcom's classic action-slasher emerges from the depths of hell and onto the Switch next week. 0 Written by Lisa Dahlgren on the 21st of June 2019 at 15:06 The much-anticipated Bloodstained: Ritual of the Night is suffering from a potentially game-breaking bug. 0 CTR: Nitro-Fueled is on today's stream Written by <mark>Sam Bishop</mark> on the 21st of June 2019 at 14:35 Crash Team Racing is back in action, and <mark>Sam</mark> is here to show us exactly what the new game has in store. 0 FIFA 19 Global Series generates over 680 million mins watched Written by <mark>Sam Bishop</mark> on the 21st of June 2019 at 09 There's been an annual increase in viewership, which bodes well for the upcoming playoffs due to start next month. 0 Dead by Daylight headed to iOS and Android Written by Lisa Dahlgren on the 20th of June 2019 at 17:47 You'll be able to survive the Entity in Dead by Daylight on mobile devices later this year, developer Behaviour Interactive announced. 0 Rocket League Radical Summer \"biggest thing we've ever done\" Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 13:57 We talked with game director Scott Rudi about the summer event, which is bringing the '80s into Rocket League. 0 See how we get on playing as Shang Tsung in MK11 Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 12:50 The DLC fighter brings something new to the table, and we've got some footage of our time in his shoes. 0 Ninja signs a book deal to produce a guide to gaming Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 11:10 We're also getting a notebook and a graphic novel themed around the streamer, all of which is coming this year. 0 Sisters in Wolfenstein: Youngblood offered various challenges Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 15:46 Machine Games' Jerk Gustafsson talked to us at E3 about the decision to work with two female heroes in the co-op game. 0 Mike Bithell on John Wick Hex: \"we had to get the action right\" Written by Ben Kerry on the 19th of June 2019 at 14:41 We caught up with Mike Bithell at E3 for a chat about all things John Wick Hex related. 0 Wolfenstein: Youngblood Arkane partnership \"very rewarding\" Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 13:32 We spoke with executive producer Jerk Gustafsson at E3 last week to hear about how Arkane helped with this co-op shooter. 0 Doom's id Software: \"We're big believers in streaming\" Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 12:03 The studio's Marty Stratton spoke to us about Stadia and Orion at E3, and he believes \"the future's bright for gamers\" . 0 We share our impressions on Link's Awakening from E3 Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 11:30 At the show we got our hands on the upcoming Zelda remake, and this video gives our impressions on what's coming our way. 0 Doom Eternal's Battle Mode \"makes the Doom dance social\" Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 11:00 We talked to Marty Stratton and Hugo Martin at E3 about the recently-revealed multiplayer mode for the shooter. 0 Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 10:22 We've got a video preview from E3, where we got our hands on Nintendo's upcoming spooky adventure."}, {"articleID": "2019092009_00141104_W", "names": {"Harry Maguire": ["Q165772", "Q5670856"]}, "date": "2019-09-20", "url": "http://www.northwaleschronicle.co.uk/sport/national/17915933.manchester-united-boss-solskjaer-relaxed-rashfords-lack-goals/", "content": "Manchester United boss Solskjaer relaxed over Rashford's lack of goals By Press Association 2019 Manchester United v FC Astana--UEFA Europa League--Group L--Old Trafford 0 comment Ole Gunnar Solskjaer is not concerned by Marcus Rashford's recent lack of goals due to the Manchester United forward's hunger and determination to improve. Mason Greenwood saved his team-mates' blushes on Thursday night as the teenager secured an unconvincing 1-0 win against Astana in the Red Devils' Europa League opener. Things could have been so different had United capitalised on their bright start, with Rashford guilty of missing a number of opportunities against the champions of Kazakhstan. Important win to get us up and running. Refocus now for the weekend?? ⚪ ️ pic.twitter.com/t2bDVeRbFf--Marcus Rashford (@ MarcusRashford) September 19, 2019 Solskjaer has spoken of his desire for the 21-year-old to score more scrappy goals but is not worried by the fact that the academy graduate has netted just once from open play in eight appearances for club and country this season. \"He's getting the chances,\" the United boss said of Rashford, who scored two spot-kicks this term. \"Of course he could have had three today. The keeper made a few fantastic saves.\" I don't worry about that, no. Manchester United manager Ole Gunnar Solskjaer is not concerned about Rashford's form (Martin Rickett/PA) \"We're working every single day in training with Marcus. He wants to improve, wants to be better.\" He could've finished with his left instead of his right today. It's just one of those days. I thought their keeper was excellent. \"Asked if United need more goals from Rashford and fellow forward Anthony Martial, he said:\" All the goals we've scored have come from the forwards with Marcus and Anthony, and Dan James. I'm sure they'll chip in with many, many goals. \"He is still young, he'll improve. You won't hit your peak as a striker until you're 26 or 27. 3 points is what matters. Preparation for Sunday starts now. ❤ ️???? #mufc pic.twitter.com/x2mNO0PvF5--<mark>Harry Maguire</mark> (@ HarryMaguire93) September 19, 2019\" He's still learning what finishes to make in different circumstances. \"Martial will be unable to add to his tally at West Ham this weekend as Solskjaer expects the forward to miss the trip to the capital along with Paul Pogba and Luke Shaw. United could also be without Welsh flyer James, who missed the match against Astana with a knock sustained in the victory against Leicester.\" I don't know, \"Solskjaer said.\" He's not trained the last few days. Hopefully, but not sure. \"We'll have a recovery day with everyone tomorrow and we'll see on Saturday.\" A solid performance from Axel?? Here's his post-match verdict on a tight #UEL encounter. #MUFC #MUTV pic.twitter.com/Ew1HqNM889--Manchester United (@ ManUtd) September 19, 2019 Solskjaer said the likes of Axel Tuanzebe and Fred are knocking on the door to be in the starting line-up on Sunday, as is 17-year-old Greenwood after his display against Astana. \"It's always hard to keep players who perform well out of the team,\" the 46-year-old said. \"I remember when I came in here...and if he keeps scoring goals, he'll play.\" If he keeps scoring goals when he's on the pitch he'll get more minutes in the Premier League as well and he'll get his first start soon. \"A big night for @ NemanjaMatic...First tweet ✔ ️ First time as captain ✔ ️ Let's hear from the #MUFC midfielder?? https: //t.co/rk5LYYraHc pic.twitter.com/ftAE7GPNbs--Manchester United (@ ManUtd) September 19, 2019 United will be desperately hoping this trip to West Ham goes better than the one last September, when Jose Mourinho's side were soundly beaten 3-1 at the London Stadium. Paul Pogba's brace helped Solskjaer's side win the reverse fixture 2-1 in April and the Norwegian has underlined the importance of keeping the Hammers out this time around. United's porous defence has been their undoing during their rocky patch under the Norwegian, but he is not concerned by the winless away run that stretches back to the jaw-dropping victory at Paris St Germain in March.\" Why should we as coaches be concerned? We're looking forward to things, looking for solutions, \"Solskjaer said. Presenting our youngest-ever goalscorer in European competition: Mason Greenwood?? This is what it means to him! #MUFC #UEL pic.twitter.com/WKvWKLbMkf--Manchester United (@ ManUtd) September 19, 2019\" I've never been concerned about anything, really. I don't walk around and worry about things. Not at all. \"I'm looking what we can do to improve. I've never been a worrier.\" I think we should've won at Southampton, I think we should've won the Wolverhampton one. Both should be wins. \"It's still the same size pitch, green with white lines, some fans. You've got to block out the mental part and play as you would in the park.\" 0 comment"}]