[{"articleID": "2019011816_00385540_W", "names": {"Shane Lowry": ["Q2067337", "Q2736966"], "Richard Sterne": ["Q1772666", "Q52086302"], "Scott Jamieson": ["Q2662865", "Q516535"]}, "date": "2019-01-18", "url": "http://www.watfordobserver.co.uk/sport/national/17369435.shane-lowry-retains-lead-heading-into-final-round-in-abu-dhabi/", "content": "<mark>Shane Lowry</mark> remains at the head of the Abu Dhabi HSBC Championship leaderboard. 0 comments Ireland's <mark>Shane Lowry</mark> remains on course to claim the Abu Dhabi HSBC Championship as he tops the scoreboard heading into the final round. <mark>Lowry</mark>, who had hit a course record-equalling 62 on day one, followed that up with a second-round of 70 before hitting a five under-par 67 on Friday. That leaves him on 17 under and three shots clear of South Africa's <mark>Richard Sterne</mark>, who matched third-placed man Ian Poulter in carding a 69 for his third round. Leader by three ✍?? @ ShaneLowryGolf extends his lead heading into tomorrow's final round. #ADGolfChamps #RolexSeries pic.twitter.com/DIh2xSZMuq--The European Tour (@ EuropeanTour) January 18, 2019 Poulter is two shots further back, with Spaniard Pablo Larrazabal also in contention in fourth, six shots behind <mark>Lowry</mark>. As he had on Thursday, <mark>Lowry</mark> started slowly and dropped a shot on the fourth to momentarily lose his outright lead of the £ 5.4 million tournament. He recovered to birdie six, seven and eight but an eagle for <mark>Sterne</mark> on the par-five 10th kept him close enough to pounce if <mark>Lowry</mark> slips up on Saturday. After 54 holes at the #ADGolfChamps...#RolexSeries pic.twitter.com/arvGbC3HxI--The European Tour (@ EuropeanTour) January 18, 2019 Poulter, meanwhile, remains in with a slim chance of victory as he adjusts his preparations after a long-haul flight to the United Arab Emirates. \"I haven't hit any balls after the round and I haven't done what I would normally do,\" he told europeantour.com. \"So I've been resting up a lot and hopefully that helps tomorrow. To finish with a three is great and, you know, hopefully I can have a little run up the board tomorrow. Ian Poulter remains in the running after an impressive third round. (Owen Humphreys/PA)\" It was a good sleep last night. I haven't felt too bad so I think I've kind of got over most of the jet lag. \"While Poulter remains in the running, fellow Englishman Lee Westwood fired a round of 71 to drop out of contention on nine under overall, with Scotland's <mark>Scott Jamieson</mark> tied for fifth, one shot clear of Westwood. 0 comments"}, {"articleID": "2019120302_00152044_W", "names": {"George Lucas": ["Q1507803", "Q38222"]}, "date": "2019-12-02", "url": "http://screenrant.com/star-wars-new-hope-alec-guinness-hated-dialogue/", "content": "Star Wars: Why Alec Guinness Hated Working On A New Hope Comment Email Copy Link Copied Here's why Alec Guinness hated his experience filming. Back when <mark>George Lucas</mark> was first creating the now iconic franchise, no one knew what it would become. But, the movie took the world by storm and introduced everyone to the galaxy far, far away. In doing so, Star Wars launched the acting careers of Carrie Fisher, Mark Hamill, and Harrison Ford. A New Hope Amid this cast of newcomers though was Alec Guinness as the wise old Jedi, Obi-Wan Kenobi. He helped bring some early legitimacy to the project thanks to his extensive and acclaimed filmography. By this point in Guinness' career, he had already won an Academy Award for his performance in The Bridge on the River Kwai, was nominated for his work in The Lavender Hill Mob, and even received a nomination as a writer on The Horse's Mouth. He also was featured in a major role in Lawrence of Arabia. In many ways, his presence in the film helped bring a sense of believability to this new mythology <mark>Lucas</mark> created - but Guinness was not a fan. Related: Star Wars: Every Change <mark>George Lucas</mark> Made To Han Killing Greedo Guinness made for a great Obi-Wan in the original trilogy but did not enjoy his experience with A New Hope. He only took the role after his higher salary demands were met. But, his doubled pay did not keep him happy throughout the production process. As discussed in the latest Screen Rant video, Guinness hated working on the film and his chief complaint was <mark>Lucas</mark>' dialogue. He said in a since published letter that the writing was \"rubbish\" and was not pleased that \"none of it makes my character clear or even bearable .\" He is hardly the only actor to not like the movie he worked on though, so check out the video for more such examples. Although Guinness' top complaint about A New Hope was the constantly rewritten dialogue, there were other issues he had with the production. He lamented the conditions of filming in another letter, saying that the shoot was \"tedious to a degree - hot, boring and indecisive .\" Guinness also struggled to connect with his much younger co-stars. Despite all of his dissatisfaction for A New Hope, Guinness did not let any of it stop him from putting his best foot forward. He was rewarded in 1978 with another Academy Award nomination, this time for playing Obi-Wan - rubbish dialogue and all. While Guinness may have helped make <mark>Lucas</mark>' dialogue work, his complaint about the quality of it has been shared by other actors in the franchise. It's also no secret that dialogue is not <mark>Lucas</mark>' strong suit. He's proven to be an exceptional storyteller with a vision for the big picture and pushing the limits of technology, but he's just not as great with the dialogue. While <mark>Lucas</mark> wrote all on his own, Lawrence Kasdan was brought aboard to help fine-tune the sequels with <mark>Lucas</mark> passing directing duties to others. So, hopefully Guinness was happier with the dialogue he received in his future appearances. Star Wars: A New Hope Star Wars 9 / Star Wars: The Rise of Skywalker (2019) release date: Dec 20, 2019 Share Subscribe for the hottest movie, TV, and gaming news! I agree to let Screen Rant send me emails. ScreenRant.com values your privacy. We and our trusted partners use cookies and tracking technologies to create custom content for your enjoyment and to provide advertising in line with your interests. Screen Rant--Privacy Policy We respect your privacy and we are committed to safeguarding your privacy while online at our site. The following discloses the information gathering and dissemination practices for this Web site. This Privacy Policy was last updated on May 10, 2018. Legal Ownership Screen Rant (the \"Website\" ) is owned and operated by Valnet inc. (\"us\" or \"we\" ), a corporation incorporated under the laws of Canada, having its head office at 7405 Transcanada Highway, Suite 100, Saint Laurent, Quebec H4T 1Z2. Personal Data Collected When you visit our Website, we collect certain information related to your device, such as your IP address, what pages you visit on our Website, whether you were referred to by another website, and at what time you accessed our Website. We do not collect any other type of personal data. If you are accessing our website through a social media account, please refer to the social media provider's privacy policy for information regarding their data collection. Log Files Like most standard Web site servers, we use log files. This includes internet protocol (IP) addresses, browser type, internet service provider (ISP), referring/exit pages, platform type, date/timestamp, and number of clicks to analyze trends, administer the site, track user's movement in the aggregate, and gather broad demographic information for aggregate use. Cookies A cookie is a piece of data stored on the user's computer tied to information about the user. We and some of our business partners (for example, advertisers) use cookies on our Website. These cookies track usage of the site for security, analytics and targeted advertising purposes. We use the following type of cookies: Essential cookies: these cookies are essential to the provision of our Website. Functionality cookies: these cookies help us remember choices you have made while on our website, remember your preferences, and personalize your Website experience. Analytics and performance cookies: these cookies help us collect statistical and analytical usage to help up analyze website usage. Social media cookies: These cookies allow you to interact with content on certain social media platforms, such a \"liking\" our articles. Depending on your social media setting, the social media network will have record of this and may display your name or identifier in relation to this action. Advertising and targeted advertising cookies: these cookies track your browsing habits and location to provide you with advertising in line with your interests. Please see our \"advertisers\" section below for details. If you wish to disable cookies, you may do so through your individual browser options. For further information regarding cookies and how to manage them, please see http: //www.allaboutcookies.org/. Pixel tags We use pixel tags, which are small graphic files that allow us and our trusted third party partners to track your Website usage and collect usage data, including the number of pages you visit, the time you spend on each page, what you click on next, and other information about your Website visit. Advertisers We use third-party advertising companies to serve ads when you visit our Web site. These companies may use information (not including your name, address, email address or telephone number) about your visits to this and other Web sites in order to provide advertisements about goods and services of interest to you. If you would like more information about this practice and to know your choices about not having this information used by these companies, click here. Advertisers, as third-party vendors, use cookies to collect usage and demographic data in order to serve ads on our site. For example, Google's use of the DART cookie enables it to serve ads to our users based on their visit to our sites and other sites on the Internet. Users may opt out of the use of the DART cookie by visiting the Google ad and content network privacy policy. We have reviewed all of our advertising partners' policies to ensure that they comply with all applicable data privacy laws and recommended data security practices. We use the following advertisers:"}, {"articleID": "2010120901_00189493_W", "names": {"Bobby Rush": ["Q888599", "Q888655"], "John Kerry": ["Q22316", "Q6242998"], "Susan Collins": ["Q22279", "Q7647692"], "Tim Wu": ["Q27998922", "Q58651651", "Q7804525"]}, "date": "2010-12-09", "url": "http://thehill.com/blogs/hillicon-valley/technology/132825-overnight-tech-upton-meets-withs-telecom-subcommittee-contenders-chairmans-dinner-thursday-first-look-at-fsf-video-argument-pop-quiz", "content": "overnight tech: upton meets withs telecom subcommittee contenders; chairman's dinner thursday; first look at fsf video argument, pop quiz welcome back! see below for thursday's schedule, incentive auctions, and a pop quiz. email tips, suggestions, and complaints to this e-mail address is being protected from spambots. you need javascript enabled to view it. upton begins meeting with telecom subcommittee contenders: industry sources said rep. fred upton, the chairman-designate of energy and commerce, began meeting with prospective leaders of the telecom subpanel on wednesday. contenders include reps. cliff stearns (r-fla .), greg walden (r-ore .), and lee terry (r-neb .). upton said he will not decide the leaders of the remaining subcommittees, including the telecom panel, this week. \"no further decisions on subcommittees will be made until upton sits down with all members of the committee individually next week to discuss their legislative priorities,\" he said in a statement. exclusive-may urges completion of comcast-nbcu review, pans online video reg: randolph may, president of the free-market think tank free state foundation, has laid out his argument about the market for online video, a key consideration in the merger of review of comcast and nbc-universal. in a paper to be released on thursday, may urges caution with regulating the nascent market for online video and decries how this consideration has held up that merger review. \"does the fcc think that it is in a better position than the marketplace to determine whether comcast's (and other video distributors) contracts for content should be exclusive, and, if so, for how long?...if so, the agency is wrong, and should refrain from doing so .\" driving thursday-chairman's dinner: federal communications commission (fcc) chairman julius genachowski will deliver the speech at the annual chairman's dinner hosted by the federal communications bar association. he got laughs last year with a twitter gag; see post tech's write-up from last december here. congressional black caucus backs <mark>rush</mark> as top dem on telecom subpanel: the congressional black caucus has endorsed rep. <mark>bobby rush</mark> (d-ill .) to become the top democrat on the panel overseeing telecom issues. fcc bureau chief touts incentive auctions: bill lake of the media bureau reiterated the fcc's commitment to incentive auctions as a way to free up spectrum for mobile broadband while raising money for the treasury. he said the commission is waiting to get authority from congress to move on the effort. even though there is bipartisan support for the measure, with rep. cliff stearns (r-fla .) pledging to keep promoting it, passing a bill could be challenging (read more on that here: icymi, he also announced an effort on tv disputes: the fcc will alter retransmission consent rules, which govern fee negotiations between broadcasters and pay-tv providers. sen. <mark>john kerry</mark> (d-mass .) said he will not introduce legislation about this now that the commission plans to act. hackers attack mastercard, paypal over wikileaks: a group of hackers launched a series of cyber-attacks on wednesday aimed at companies such as mastercard, amazon.com and paypal, which have recently cut commercial services to wikileaks. carper touts cybersecurity bill: \"today's events, once again, underscore the necessity for more robust cybersecurity efforts in the united states?. legislation i've authored along with senators joe lieberman (id-conn .) and <mark>susan collins</mark> (r-maine), protecting cyberspace as a national asset act of 2010, does just that. this bipartisan bill is a vital tool that america needs to better protect cyber space .\" pop quiz: know your upton sweet talk which tech, telecom company or association issued which flattering comment about upton, the incoming chairman of the energy and commerce committee? answers below. options: a) u.s. telecom b) at & t, c) free press d) national association of broadcasters, e) verizon 1) \"representative upton is a veteran legislator who has a demonstrated ability to lead, a track record of accomplishments, and a well-earned reputation for getting things done .\" 2) \"[we look] forward to working with congressman upton on increasing the number of competitors in the broadband market, lowering prices and increasing choices for consumers and fostering diverse voices in local media .\" 3) \"with his extensive knowledge of telecommunications and his unwavering support for policies that foster investment and job growth, congressman upton's leadership will be invaluable in shaping our country's broadband future .\" 4) \"over the years, fred upton has served congress with class and integrity, and has shown a willingness to find meaningful solutions to real problems that confront the american people .\" 5) \"he is a leader with broad experience on telecommunications issues and a fair and balanced legislator .\" thursday's sked: - net neutrality advocate <mark>tim wu</mark>, the author of the master switch and a a professor at columbia law school, will do a twitter interview with tap. hashtag: #taptalk. 1 p.m. - a conference by the telecommunications policy & regulation institute kicks off and extends into friday. thursday speakers include fcc commissioner mignon clyburn, house energy and commerce gop counsel neil fried, senate commerce gop counsel david quinalty, senate commerce dem staffer <mark>john</mark> branscome, among others. republicans who support net neutrality caught between industry, tea party commerce secretary: threats to internet freedom increasing, can hamper growth house finance chairman \"not optimistic' about online gambling bill moving hud launches investigation into possible discriminatory loan practices subscriptions the hill 1625 k street, nw suite 900 washington dc 20006 | 202-628-8500 tel | 202-628-8503 fax"}, {"articleID": "2019120603_00100561_W", "names": {"Emily Robinson": ["Q26405870", "Q44226063"]}, "date": "2019-12-06", "url": "http://kait8.com/2019/12/06/uber-reports-more-than-sexual-assaults-rides/", "content": "Uber reports more than 3,000 sexual assaults on 2018 rides Uber reveals thousands of reports of sexual assaults By RACHEL LERMAN and BARBARA ORTUTAY | December 5, 2019 at 7:51 PM CST - Updated December 5 at 9:14 PM SAN FRANCISCO (AP)--Uber, as part of a long-anticipated safety report, revealed that more than 3,000 sexual assaults were reported during its U.S. rides in 2018. That figure includes 229 rapes across the company's 1.3 billion rides. The ride-hailing company noted that drivers and riders were both attacked, and that some assaults occurred between riders. The Thursday report, which the company hailed as the first of its kind, provides a rare look into the traffic deaths, murders and reported sexual assaults that took place during billions of annual rides arranged in the U.S. using Uber's service. It is part of the company's effort to be more transparent after years of criticism over its safety record. In 2017, the company counted 2,936 reported sexual assaults during 1 billion U.S. trips. Uber bases its numbers on reports from riders and drivers, meaning the actual numbers could be much higher. Sexual assaults commonly go unreported. \"I suspect many people will be surprised at how rare these incidents are; others will understandably think they're still too common,\" Uber CEO Dara Khosrowshahi tweeted about the report. \"Some people will appreciate how much we've done on safety; others will say we have more work to do. They will all be right .\" Uber's share price dropped more than 1% in after-hours trading. Uber and competitor Lyft have faced harsh criticism for not doing enough to protect the safety of their riders and drivers. Dozens of women are suing Lyft, claiming the company should have done more to protect them from driver assaults. A Connecticut woman sued Uber last month, claiming she was sexually assaulted by her driver. London refused to renew Uber's license to operate in the city in November after the company was plagued with safety issues including concerns about impostor drivers. Uber said it will appeal the decision. The companies have both formed partnerships with sexual assault prevention networks and other safety groups, and have touted their background check policies for drivers. But many say they haven't gone far enough to protect passengers and drivers, who are contract workers for the companies. \"Keeping this information in the dark doesn't make anyone safer,\" Uber said in a statement announcing the report. It plans to release its safety report every two years going forward. Lyft said last year it would also release a safety report. A company spokeswoman confirmed Thursday that it \"remained committed\" to releasing a report, but did not say when. Mike Bomberger, a lawyer representing more than 100 victims of sexual assault in lawsuits against Uber and Lyft, applauded Uber for releasing the numbers. \"One of the problems with both of these companies is that they have hidden and have tried to conceal the number of sexual assaults that occur in their vehicles,\" he said. In response, an Uber spokesperson pointed to the just-released report. Lyft called Bomberger's charge \"baseless .\" Bomberger said he believes 80% to 90% of the assaults in the Uber report could have been prevented by measures such as cameras in the cars recording rides and the companies reporting every assault they learn of to the police. The Rape, Abuse & Incest National Network said it appreciated Uber's transparency. \"This is an issue that affects every institution in America,\" RAINN press secretary <mark>Emily Robinson</mark> said in a statement. She added that organizations in every industry, including education, should \"make a similar effort to track and analyze sexual misconduct within their communities .\" The report stated that Uber rides were involved in 97 reported crashes in 2017 and 2018, resulting in 107 deaths. The company said the figure represents about half of the national rate for fatal crashes. Sexual assault in the report is defined broadly into categories including non-consensual kissing of a non-sexual body part, attempted non-consensual sexual penetration, non-consensual touching of a sexual body part, non-consensual kissing of a sexual body part and non-consensual sexual penetration. The company also said Uber rides were involved in nine murders during 2018, and 10 during 2017. Uber noted that the vast majority--99.9%--of its rides had no reported safety issues. Copyright 2019 Associated Press. All rights reserved. 55"}, {"articleID": "2019081406_00157868_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-08-14", "url": "http://www.gamereactor.eu/pubg/?sid=62944fff2a3671a3b18095c90871a035", "content": "PLAYERUNKNOWN'S BATTLEGROUNDS REVIEW. Written by <mark>Mike Holmes</mark> on the 28th of December 2017 at 11 \"You've got to take the rough with the smooth, but when it clicks it not only works, it's glorious .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 7th of August 2019 at 10:25 New features like the remade Erangel map have arrived, and we're seeing what's new this afternoon for a few hours. 0 ARTICLE. Written by <mark>Mike Holmes</mark> on the 26th of July 2019 at 14 After the launch of the new Event Pass and a big update to Erangel, we dived back into the battle royale shooter to see where it's at. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 25th of July 2019 at 16:00 It seems the lawsuit is behind the battle royale pair, as revealed by studio director Brian Corrigan. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 18th of July 2019 at 10:10 Erangel's map update takes centre-stage, although there are various other tweaks and content to see."}, {"articleID": "2019042323_00307607_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}, "date": "2019-04-23", "url": "http://feeds.thehollywoodgossip.com/~r/TheHollywoodGossip/~3/yAHBZq-Zj-Y/", "content": "Without any major battles scenes or surprising deaths on Game of Thrones Season 8 Episode 2, viewers really had just one thing to which they could respond with shock and awe on Sunday night: Maisie Williams...got...naked! Kind of. Sort of. We didn't really see any parts that were especiallty private when Williams, as the character of Arya Stark, stripped down to engage in her first-ever sexual experience with a truly stunned Gendry. The character figured she only had hours left to live, due to the impending arrival of the Night King's army, and wanted to know what intercourse felt like before she was crossed off someone else's list. A pretty understandable reaction to near-certain death, right? And the way Arya went about seducing Gendry (basically ordering him to take his clothes off and just do her already) was true to the strong woman she has become...... and yet a debate has been raging on the Internet over this sex scene. Was it empowering? Or was it uncomfortable and sort of gross? Those who take the side of \"Yech, disgusting!\" are reacting that way because Williams started on Game of Thrones when she was 14. We met Arya when the character was 11. So Arya is 18 years old now (of consenting age, we presume, in Westeros) and Williams is 22. Neither age is really too young for sex, yet many social media users have been complaining all week that the scene was \"weird\" or \"uncalled for .\" (These same people have been oddly silent about all the incest on the series. But let's not digress too far here .) Clearly aware of the backlash online, the actress took to Twitter on Tuesday and put an end to it as follows. This is what she wrote: \"if u feel uncomfortable just know that my mother and my step dad and my 2 sisters and my 4 brothers have all probably watched this too ahahakillmeehehe .\" HA! We love it. Previously, Williams admitted in an interview that she thought the Arya sex scene was written as a \"prank\" when she first read it in the script. But it was obviously very real. Said the star to Entertainment Weekly after the episode aired: \"This is something she's stayed away from, an emotion we've never really seen her engage with. [The series creators] were like,\" It's the end of the world, what else would you have her do?' \"This may be is a moment where Arya accepts death tomorrow, which she never does...\"So, it was that moment where she says,\" We're probably going to die tomorrow, I want to know what this feels like before that happens .' \"It's interesting to see Arya be a bit more human, speak more normally about things people are scared of .\" As you can see below, meanwhile, Williams' best friend on the show, <mark>Sophie Turner</mark>, definitely saw no problem at all with the scene: <mark>Sophie Turner</mark> on Maisie Williams Sex Scene We repeat: HA! \"In honor of Easter, I guess Game of Thrones wanted the storyline to have a little Easter bunny hop-hop-hopping into that pussy. And that's the tea,\" <mark>Turner</mark> says in the above video, punctuating the line with a sip of wine. Truly amazing. The question now turns to whether Arya will survive the battle on Game of Thrones Season 8 Episode 3. We've listed her odds for doing so below: Game of Thrones: Who's About to Die!? [Unofficial Rankings By Unofficial Odds] Start Gallery Edit Delete Share on Facebook Email"}, {"articleID": "2015111609_00051405_W", "names": {"Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"]}, "date": "2015-11-16", "url": "http://www.firstpost.com/politics/mobile-phone-is-dangerous-keep-off-it-unless-its-necessary-says-mulayam-2508296.html?utm_source=fp_hp", "content": "Mobile phone is dangerous, keep off it unless it's necessary, says Mulayam - Firstpost firstpost #Amitabh Thakur #lUCKNOW #Mobile phone #Mulayam Singh Yadav #Narendra Modi #NewsTracker #Pradeep Shukla #Shareworthy #Uttar Pradesh Lucknow: In an era when more and more public services and facilities are being offered as mobile application (or apps) for wider reach to the people for their use, the president of the ruling party in Uttar Pradesh Mulayam Singh Yadav has cautioned people in general to stay away from the mobile phone, terming it \"dangerous .\" Speaking at a function to release a book written by the daughter of an IAS officer accused in the NRHM scam in Lucknow recently, Mulayam cautioned his party leaders, women, girls and the people in general, to use mobile phones only when it was \"very necessary\". He said the mobile phone conversation could always be recorded and later misused. Mulayam Singh Yadav. PTI He went on to say that he was specifically telling this to girls and women, to beware of this gadget as \"a lot of indecent things\" happen due to this instrument. The book on orphaned children has been written by the daughter of Pradeep Shukla, who was accused and then jailed in the NRHM scam and is currently out on bail serving as a Principal Secretary to the government. Mulayam's statement gains significance in the backdrop of the allegation by an IPS officer Amitabh Thakur, currently under suspension, that the SP president had threatened him on phone in July. Mulayam alluded to this connection by saying that he himself had landed in a trouble due to the use of the mobile phone. \"Once I said something on the mobile phone and the conversation was recorded...It is good that the India is developing and technology like computer also growing. But mobile phone--it's a dangerous instrument,\" he said. He also added that he did not use mobile phone unless it was unavoidable. \"If somebody calls me on the mobile then I snub that person and ask him what prevents him from calling on the land line? One may call me on the mobile phone if I am away from home in a field in the village .\" The SP and its leaders have in the past too been particularly piqued at these gadgets. On 23 October senior minister Mohammad Azam <mark>Khan</mark> had blamed smart phones for the rise in crime against women. Referring to recent incidents in Delhi where two toddlers were raped and assaulted, <mark>Azam Khan</mark> had said pornographic material is easily accessible over smartphone to people even in villages which are ruining the growth of children and youth. Last year Mulayam had even laid the blame on computers and laptops for his party's defeat in the Lok Sabha election. He had said that he had cautioned his son Akhilesh not to distribute laptops to students, but these were distributed, \"and Modi had cleverly put his photos and speeches on the laptop,\" he had said. Although later he had also said at a function in the Press Club in Lucknow that the social media had its own uses and should be properly utilized. Later, reacting to Mulayam's statement, Amitabh Thakur said that the mobile phone was a \"wonderful\" instrument that had brought the people of the world closer to each other. \"Only those people need to be scared of it who use it for wrong or unlawful purposes. If we use it for the right purpose then why should we be scared?\" he asked. Amitabh Thakur and his wife Nutan have been alleging that the SP government has been hounding them ever since Nutan filed a complaint related to illegal mining against the mining minister Gayatri Prajapati. Amitabh has also filed a complaint that Mulayam had threatened Amitabh on telephone during a conversation on July 10. The police had initially failed to register even a complaint but later lodged it after Thakur moved court. Although the Hazratganj police in Lucknow has filed the final report in this case, the court has asked Thakur to present his arguments on November 19. The Uttar Pradesh government has introduced several mobile apps including those for police assistance and tourism information, and these are quite widely used as well. The offices of the Chief Minister and Chief Secretary have been highly active on the social media, and all government decisions are routinely and speedily flashed on social media. more in India"}, {"articleID": "2009120903_00075669_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}, "date": "2009-12-09", "url": "http://wbur.org/2009/12/08/capuano-concedes", "content": "rep. michael capuano walks up the steps to the podium to give his concession speech. (jesse costa/wbur) boston - rep. michael capuano spoke to a crowd of disappointed supporters at the fairmont copley hotel and said his campaign \"couldn't catch up\" to martha coakley's statewide operation. the crowd included u.s. sen. <mark>john kerry</mark>; gov. deval patrick's wife, diane patrick; and former gov. michael dukakis. capuano called the state's attorney general a \"pretty good candidate\" and promised to support her bid for the senate seat in january's general election. meantime, capuano's supporters were glum, if not despondent. \"we really thought we were going to do it,\" somerville mayor jim curtatone said. \"we did our best,\" said toni shelzi, who worked the phones from the cambridge campaign headquarters. \"we didn't have enough time. [coakley] started before teddy kennedy died .\" "}, {"articleID": "2010100100_00157072_W", "names": {"Tommy Hunter": ["Q2441011", "Q861479"], "Cliff Lee": ["Q5132668", "Q57413517", "Q978930"], "Nelson Cruz": ["Q1133784", "Q11957344", "Q6990454"]}, "date": "2010-09-30", "url": "http://mlb.mlb.com/news/article.jsp?ymd=20100930&content_id=15262666&notebook_id=15262672&vkey=notebook_tex&c_id=tex&partnerId=rss_tex", "content": "cantu, francoeur scratched because of illness arlington--a couple of different illnesses were impacting the rangers' clubhouse on thursday, less than a week out from the playoff opener against either tampa bay or new york. first baseman jorge cantu was not in the lineup because of a head cold and sore throat. mitch moreland started in cantu's place, giving the rookie a chance in a lefty-lefty matchup with angels starter scott kazmir. \"[cantu] is under the weather,\" said manager ron washington. \"that's why moreland is out there .\" outfielder jeff francoeur was also a late scratch from the lineup because of a stomach virus. rangers will opt for <mark>hunter</mark> over <mark>lee</mark> in game 4 arlington--the rangers have decided to include <mark>tommy hunter</mark> in their playoff rotation and not pitch <mark>cliff lee</mark> on three days' rest. the rangers originally planned to pitch <mark>lee</mark> in game 1 on wednesday and again in game 4 (if necessary) on oct. 10. but the rangers crunched some numbers and decided that would not be a good idea. \"the numbers didn't look good,\" said manager ron washington. \"we're going to use our whole pitching staff .\" <mark>lee</mark>, who normally pitches on four days' rest, has never pitched on three days' rest in his entire major league career. over the past eight years, there have been 51 instances of a pitcher starting a playoff game on three days' rest. their combined record is 13-20 with a 5.01 era, as opposed to a 4.18 era on four days' rest and a 3.80 era with five or more days off. there were six starts on three days' rest last year, and the pitchers' cumulative era was 6.30. the starter also averaged just five innings per start. \"we just decided not to push <mark>cliff</mark> out there on three days,\" washington said. so they'll go with <mark>hunter</mark>, if necessary. he would follow c.j. wilson in game 2 and colby lewis in game 3. the rangers initially announced that <mark>hunter</mark> would pitch out of the bullpen in the playoffs. \"it's a great opportunity,\" <mark>hunter</mark> said. \"it's something i've looked forward to since the beginning of the season--throw in the postseason. now i'm getting that opportunity .\" <mark>hunter</mark>, who is 13-4 with a 3.80 era in 21 starts and one relief appearance on the season, will make his final start on friday against the angels. lowe feels good after first inning with rangers arlington--reliever mark lowe said he was feeling good after his inning of work wednesday, the first time he'd pitched in a major league game since may 2, when he was on the mound for the mariners. \"just the normal soreness,\" lowe said. the plan for lowe is to pitch again friday and sunday. the rangers are possibly looking at lowe to be a part of their playoff bullpen, even though he was out for almost five months after back surgery. they will be looking on with great interest to see how he responds in his second appearance. lowe faced four batters, allowing one hit while striking out four. his fastball was around 95 mph. texas manager ron washington was asked if he was considering pitching lowe in back-to-back games, since games 1 and 2 and games 3 and 4 of next week's american league division series will be on consecutive days. \"he's not ready for that,\" washington said. washington said lowe's chances to be on the playoff roster won't be impacted by him not pitching on consecutive days. \"we're not going to push him on that,\" washington said. worth noting the rangers need to go 3-1 in their final four home games to match the club record for home wins in a season (52 in 1978). a 3-1 finish would also give the rangers their best home winning percentage since the '78 team played an extra home game ....research on baseball-reference. com by the rangers' media relations staff indicates that wednesday's walk-off win on a strikeout by <mark>nelson cruz</mark> was the sixth instance of that happening since 1950. mitch moreland scoring from first base on <mark>cruz</mark>'s strikeout was the only time that has occurred since 1950 .? 2001 - mlb advanced media, l.p. all rights reserved."}, {"articleID": "2009102118_00079593_W", "names": {"Karen Taylor": ["Q15072697", "Q20748800", "Q22568398"], "Eric Holder": ["Q312644", "Q3591180"]}, "date": "2009-10-21", "url": "http://timesheraldonline.com/ci_13607611?source=rss_viewed", "content": "<mark>karen taylor</mark>, of vallejo, filed a discrimination suit against travis air force base and is headed to washington, d.c., for a one-woman protest in an effort to speed up the wheels of justice. (chris riley/times-herald) two years after losing her job as a clerk at travis air force base, <mark>karen taylor</mark> of vallejo is taking her case to the president of the united states. or at least to his front yard. taylor said her health has suffered, and that her retirement, medical benefits and job seniority are at stake. she wants her day in court, and said if that means going to washington next week and standing with protest signs all day for four days in front of the white house then that's what she'll do. \"i'm six feet tall,\" taylor said. \"do you think if i stand out there with these signs held up, i won't be noticed?\" since her story ran in the times-herald in february 2007, taylor, now 45, said she has lost one wrongful termination court case, which is under appeal. there are several other cases related to her racial discrimination and harassment claims pending in federal court, she said. \"i'm going to washington and i'm going to stage a one-woman protest,\" she said. \"i already contacted attorney general <mark>eric holder</mark> to let him know i'm coming .\" no one from the obama administration has responded, she said. \"my job made me happy,\" she said of the employment she began on mare island at 16, before being transferred to travis when the shipyard closed. \"it allowed me to pursue my other interests--feeding the homeless in vallejo on thanksgiving, playing santa for the neighborhood kids at christmas .\" taylor said she has dozens of boxes filled with documentation on her case and wants to present her evidence to a jury. she said she is also fighting for other travis workers of color who may have given up. \"and this is not just for <mark>karen taylor</mark>,\" she said. \"this is for all the african americans on base, so they know they can stand up for what's right .\" no one from travis was immediately available to speak to the issue tuesday afternoon, but in 2007, a spokeswoman said that base officials take complaints of discrimination seriously. \"in 20 years, there have been two (equal employment opportunity) findings against the air force at travis, all revolving around the same case, around 2004,\" capt. vanessa hillman said at the time. \"our commander takes all eeo complaints seriously and, if received, thoroughly investigates .\" no further comment would be forthcoming for privacy reasons, she said. taylor says her problems began when she complained about her new supervisor's employment practices. she went on medical stress leave, and then, despite her doctor's letter assuring her supervisors she'd be well enough to return to work within a month or two, taylor was fired. the stated reason was her \"inability to maintain a regular work schedule,\" according to a termination letter she received. the letter says her firing was \"non-disciplinary in nature\" and that there \"has been no misconduct or delinquency\" on her part. the supervisor has since been promoted and transferred, something hillman said at the time was unrelated to any complaints from minority or female employees. taylor says she won some union grievances and that the previous newspaper article created some noise, but things have stalled. \"my life's on hold, and i don't want to wait until i'm 80 to get recognized,\" she said. \"i don't want them to wait until i'm dead to say,\" yes, we did miss taylor wrong .' \"taylor's former union vice president joel perry said that while it's been a long time, he recalls that she had suffered reprisals and that a settlement was reached for some back pay. he attributed her problems to a\" personality conflict \"and not race or gender, however, and his opinion hasn't changed. the union no longer represents taylor, he said .\" we haven't represented her in years, \"perry said .\" she left her employment and she didn't think we were doing enough for her, so she left us. \"vallejo trustees to get panel's list of schools suggested for ..."}]