[{"date": "2015-08-09", "url": "http://cjonline.com/sports/bowling/2015-08-08/kuhlkin-sweeps-finals-claim-first-pwba-crown", "content": "The bowling lanes at the west end of West Ridge Lanes don't look any different to the untrained eye than the rest of the center's 32 lanes. But, oh, how wonderful they looked to 21-year-old <mark>Liz</mark> Kuhlkin on Saturday during the PWBA Topeka Open presented by Prairie Band Casino & Resort. Kuhlkin, of Schenectady, N.Y., used lanes 29 and 30 during two rounds of match play Saturday morning and afternoon to earn a berth in the stepladder finals, and then won three matches Saturday night on lanes 25 and 26 to claim her first PWBA title and a $10,000 prize. Kuhlkin's Korner, the west end should be called. \"I definitely was not upset when I heard the finals would be on the high (numbered) end of the house,\" Kuhlkin said. \"I don't think I had many games above 200 on the low end. But I still had a tough go ahead of me .\" Entering the finals as the No. 3 seed, Kuhlkin, a three-time NCAA All-American at Nebraska and a 2015 graduate, ousted Clara Guerrero, 224-205, and <mark>Liz Johnson</mark>, 247-202, before stopping top qualifier Danielle McEwan, 241-203, for the championship. \"It's just amazing,\" said Kuhlkin, the 2015 NCAA Division I Player of the Year and the fifth-place finisher at the USBC Queens in May. \"I actually made a goal for myself this week to make the top 16, and I exceeded that, and then I made the stepladder finals, and to win is just incredible .\" That would be a good way to describe Kuhlkin's performance on lanes 29 and 30 during the tournament. Kuhlkin capped the first round of match play Saturday with a perfect game to move into contention, and then shot 267 in the final, position-round game of the second match play session to move from fifth to third and make the TV show (streamed live on Xtra Frame). \"Honestly, it felt like I was bowling league, and it wasn't like that for anybody else,\" said Kuhlkin, who rolled a 243 game earlier on 29-30, which means she shot 810 on the pair overall. \"It just felt like I had the entire right side. As long as I kept it right, it struck. I struck light, I struck high, I tripped fours. It was fortunate that I drew that pair .\" While Kuhlkin was working toward a big finish, the 23-year-old McEwan, of Stony Point, N.Y., was dominating the field throughout most of the event. She led by 36 pins after 12 games of qualifying Friday, by 99 pins after the first round of match play Saturday and, after overcoming a slow start, by 107 pins at the end of match play. But after waiting through the first two matches Saturday night, and opening the championship game with a pair of strikes, McEwan failed to strike again on the lane 25. Kuhlkin, who took the lead by opening with four strikes, doubled in the sixth and seventh and ninth and 10th frames to seal the victory. \"It did not go as planned at all,\" said McEwan, who was a three-time NCAA All-American at Fairleigh Dickinson and the 2012 and 2013 NCAA Player of the Year. \"I'd planned on striking a lot more, which I did on one lane, but I couldn't figure out the other one .\" If anything, when I was practicing, I was actually more comfortable on the left lane, and then they kind of flip-flopped at the start of the (championship) game. \"<mark>Johnson</mark>, 41, of Cheektowaga, N.Y., charged into the stepladder finals by opening the second round of match play with games of 245, 212, 244, 238 and 236 (she average 227.38 for the round), but struggled on the championship lanes, striking only three times in her loss to Kuhlkin. Guerrero, 33, of Pflugerville, Texas, and an 18-year member of the national team in her native Colombia, held on to earn the last spot in the finals, but could only strike on the left lane. She succumbed when Kuhlkin strung strikes in frames four through nine. McEwan took home $5,000 for finishing second, while <mark>Johnson</mark> earned $3,500 and Guerrero $3,000. The PWBA Tour moves to Kuhlkin's collegiate stomping grounds next week in Lincoln, Neb.. PWBA Topeka Open Results Saturday at West Ridge Lanes STEPLADDER FINALS Match one--<mark>Liz</mark> Kuhlkin, Schenectady, N.Y., def. Clara Guerrero, Pflugerville, Texas, 224-205 ($3,000 to Guerrero) Match two--<mark>Liz</mark> Kuhlkin def. <mark>Liz Johnson</mark>, Cheektowaga, N.Y., 247-202 ($3,500 to <mark>Johnson</mark>) Championship match--<mark>Liz</mark> Kuhlkin def. Danielle McEwan, Stony Point, N.Y., 241-203 ($10,000 to Kuhlkin; $5,000 to McEwan) STANDINGS AFTER 28 GAMES Note: Includes 12-game qualifying pinfall, eight-game pinfall and won-lost record for two match play rounds, total pinfall and tournament average through 28 games, overall won-lost record and prize money: 1. Danielle McEwan, Stony Point, N.Y.: 2,701; 1,744 / 7-1-0; 1,675 / 4-4-0; 6,450; 218.57; 11-5-0 2. <mark>Liz Johnson</mark> Cheektowaga, N.Y.: 2,576; 1,648 / 4-4-0; 1,819 / 6-2-0; 6,343; 215.82; 10-6-0 3. <mark>Liz</mark> Kuhlkin Schenectady, N.Y.: 2,548; 1,780 / 4-4-0; 1,655 / 5-3-0; 6,253; 213.68; 9-7-0 4. Clara Guerrero Pflugerville, Texas: 2,509; 1,711 / 5-3-0; 1,676 / 5-3-0; 6,196; 210.57; 10-6-0 5. Diana Zavjalova Beavercreek, Ohio: 2,579; 1,690 / 5-3-0; 1,649 / 4-4-0; 6,188; 211.3; 9-7-0; $2,000 6. Jodi Woessner Oregon, Ohio: 2,600; 1,701 / 6-2-0; 1,641 / 2-6-0; 6,182; 212.21; 8-8-0; $1,850 7. Kamilah Dammers, Aruba: 2,588; 1,584 / 6-2-0; 1,654 / 4-4-0; 6,126; 208.07; 10-6-0; $1,800 8. Kelly Kulick Union, N.J.: 2,665; 1,586 / 3-5-0; 1,617 / 5-3-0; 6,108; 209.57; 8-8-0; $1,750 9. Shannon Sellens Copiague, N.Y.: 2,651; 1,725 / 6-2-0; 1,454 / 3-5-0; 6,100; 208.21; 9-7-0; $1,700 10. Jennifer Higgins Westerville, Ohio: 2,570; 1,578 / 3-5-0; 1,629 / 5-3-0; 6,017; 206.32; 8-8-0; $1,650 11. Brandi Branka Momence, Ill.: 2,537; 1,601 / 3-5-0; 1645/4 -4 -0; 5,993; 206.54; 7-9-0; $1,550 12. Bryanna Caldwell, Red Rock, Ariz.: 2,534; 1,538 / 3-5-0; 1,639 / 4-4-0; 5,921; 203.96; 7-9-0; $1,500 13. Stefanie <mark>Johnson</mark>, Grand Prairie, Texas: 2,609; 1,552 / 3-5-0; 1,568 / 3-5-0; 5,909; 204.61; 6-10-0; $1,450 14. Sarah Lokker, New Baltimore, Mich.: 2,469; 1,552 / 1-7-0; 1,573 / 4-4-0; 5,744; 199.79; 5-11-0; $1,400 15. s-Carolyn Dorin-Ballard, Keller, Texas: 2,501; 1,530 / 3-5-0; 1,545 / 2-6-0; 5,726; 199.14; 5-11-0; $1,350 16. Diandra Asbaty, Chicago, Ill.: 2,487; 1,535 / 2-6-0; 1,492 / 4-4-0; 5,694; 196.93; 6-10-0; $1,300 300 game--<mark>Liz</mark> Kuhlkin s--senior", "articleID": "2015080903_00035832_W", "names": {"Liz Johnson": ["Q6660194", "Q6660196"]}}, {"date": "2015-08-09", "url": "http://www.illawarramercury.com.au/story/3262640/st-michaels-a-look-back-at-the-early-days/?src=rss", "content": "St Michael's Primary School in Thirroul is celebrating its 75th anniversary. JODIE DUFFY takes a look back at the school's early days. St Michael's class of 1940. St Michael's Thirroul 1955 sixth class girls in hats. It was not long after Sister Thecla Sullivan had taken her final vows that she established a Catholic primary school in Thirroul, 75 years ago. She had travelled by train with the slightly older Sister Alphonsa Jones, who was to be her boss and companion for the next five years. Together they were to be the founding nuns of St Michael's Catholic Parish Primary School. Sister Thecla was 24, and even in her dark brown, heavy habit, in the height of summer, you could tell she was an attractive woman. There was a kindness in her eyes and smile. Even long after her looks had faded and her habit had been replaced with more comfortable civilian clothing, at almost 100 years old she was still a striking woman. The nuns arrived in Thirroul two weeks before the start of the new teaching year in 1940 and were shocked to discover there was no school building, no teaching resources and no convent in which to live. There was also no warm welcome from the parish priest. While the northern suburbs Catholic community had rallied support for a new school, it appears Father <mark>John O'Farrell</mark> may have been less than enthusiastic about having two females in his realm. On January 28 he announced to his congregation that classes would begin inside the church for kindergarten to year 3 students. Older Catholic children would have to remain at the nearby Thirroul Public School or travel by train or bus to St Joseph's Convent School at Bulli. \"To our horror there was no school, but we were informed that we would teach in the church,\" wrote Sister Thecla just before her oak jubilee in 2014. \"We were given a quarter of the church with two blackboards on easels. That was the extent of the school's equipment .\" With no resources or money provided by the parish, Sisters Thecla and Alphonsa caught the train back to Sydney to purchase the basics with the & pound; 5 they had been given by their superior, Sister Marcellinus. The money stretched to buy chalk, dusters and a few textbooks. On their return they met with the school's 34 new students. The first intake lined up and stood tall against the outside northern wall of the church, eager to meet their new teachers. Pat Cadogan (nee Agnew) recalls that everyone was excited. St Michael's founder Sister Thecla Sullivan with a student on Holy Communion Day. Sister June Bath (middle row, second from left) at St Michael's Thirroul with a group of nuns. \"I remember the day we enrolled,\" says Pat. \"The nuns asked what year we were in. I put myself up a grade. Gave myself a bit of a promotion. They realised later and amended the error. But it was an exciting time. Our parents all wanted us to have a Catholic education. It was important to them .\" Inside the church a curtain was put up to divide the altar from the students and the pews were pushed aside to make way for desks. The \"neatly kept\" blackboards were the only division between the classes. \"The nuns battled on under trying conditions,\" explains Ron Tuckerman, a student from the first intake. \"In the beginning they had to go out and solicit donations to buy chalk .\" Another student, Arthur Martin, remembers that on the first day of the new school Father <mark>O'Farrell</mark> was reluctant to hand over the keys to the church. \"I remember we were all lined up on the first day outside the church waiting for the nuns to get the keys. Eventually they did but I think it would be fair to say that the parish priest didn't want the nuns in his church, at least to begin with,\" says Arthur. With not much room in the school grounds, Sister Thecla would walk her pupils to a nearby empty paddock to play rounders. Rolling up the sleeves of her habit she would join in the game using a fence picket as a bat. \"She loved it. She was very active and could really whack the ball,\" says Ron. \"She would roll up the sleeves to the elbows and run. Everyone always wanted to be on her side .\" During the war, air raid shelters were dug in the paddock and the nuns would plant religious medals and sprinkle holy water in there each Friday to protect their charges in the event of an enemy invasion. Also, at the end of each week, as a treat, Sister Thecla would share with them Australian stories like Blinky Bill and We of the Never Never. \"Sister Thecla was fantastic. We were all in love with her,\" adds Arthur. \"She was just so kind to everybody. Sister Alphonsa was the school principal and a bit more serious .\" By the end of the year more than 90 students had enrolled at St Michael's. \"The school was quite primitive,\" says Sister Tess, a Josephite nun and Sister Thecla's niece. \"It was a stark contrast to the beautifully built public school across the road. The irony of it was that the students came in droves to this poor little school with no proper facilities. I think the two nuns must have had some kind of charisma for that to have happened .\" While a cottage had been purchased near the church for a convent in 1927, the nuns did not move in until 1950. The parish rented it out to tenants. The nuns were forced to travel each day from the Sisters of St Joseph's Bulli convent, which was a hardship for them. Around mid-year Father <mark>O'Farrell</mark> was replaced by Father James Mullin. \"Initially the nuns believed that Father Mullin didn't support them,\" explains Ron. \"But he had been left with a difficult financial situation. When he arrived he had to replace furnishings in the presbytery. He was also left with a huge debt from the extensions to the church in 1939. So in the early years he was limited in how much he could support the nuns. They were tough times. But it didn't dampen the enthusiasm to start the school, and everyone wanted to see it succeed .\" The parish had attempted to buy land near the church to build the school but the Protestant owners refused to sell. In the end hotelier and entrepreneur Johanna Ryan came to the rescue, purchasing the land. She immediately handed it over to the parish with the provision that a Catholic school be built within 10 years of her death (a new school building was constructed in 1951). Mrs Ryan also provided a little stove for the nuns so they could cook their lunch in the sacristy and kept them in bread each day. A Catholic butcher in Thirroul donated meat. Each Friday the nuns would send one of their students, Tony Bolt, who later became a priest, to pick up fish and chips for their lunch. They often shared what was left with those students who would help clean up the church at lunchtime or after school. \"There was just the one learning area at the back quarter of the church,\" remembers Father Tony Bolt. \"We did not see anything strange about this crowding. The nuns managed crowd control very effectively. Noise was not a problem. The teachers were very much in charge .\" At the time Australia was a sectarian society divided between Catholics and Protestants. Mixed marriages were frowned upon and in some cases family members were disinherited. Catholics stuck together and the church and school community became the focus of life. Father Bolt says there was a sense that Catholics were the underdogs, with government funding for education going to public schools. \"We did not feel badly done by because the results in bursaries and scholarships came more frequently to us,\" he says. \"The dedication and interest of the sisters made all the difference .\" In the '40s and '50s life in the convent was strict. As she grew as a teacher, Sister Thecla would always be an advocate for fair play and justice, but she could also be daunting and forthright, says Sister Tess. She had a shadow side and was exacting about the proper way to do things. \"She had a strict code, a stern exterior and a heart of gold,\" says Sister Tess. Sister June Bath was also a student in the church in those early years. \"I remember my first day of kindergarten in the church,\" she says. \"I had Sister Alphonsa. I was five. She was very gentle and kind to us .\" Sister June was in year 6 when she decided to become a Josephite nun. She was 13 when she was sent to boarding school at Hunters Hill to begin her training as a nun. \"My father didn't want me to go. I know I was young but you've got to do what God wants you to do,\" she says. She became a postulant after her Leaving Certificate. Josephite nun Sister June Bath returns to St Michael's Catholic Primary School where she went to school in the 1940s and where she taught for a year in 1979. Past and present students and staff have celebrated the school's 75th anniversary all week. Picture: KIRK GILMOUR \"I liked the spirit of the Josephites. I had grown up with them. The nuns impressed me with the simple way they lived. The fact that they cared about people. That was the main thing. I liked how they didn't put themselves above other people. It's an Australian order, for the Australian people .\" Sister June returned to St Michael's in 1979 to teach year 2 for a year. \"I was pleased to be closer to my family [who lived at Austinmer],\" she says. \"But it was strange being at the school. When I walked into the classroom I could tell I had been to school with the parents of some of my students. I recognised them straight away .\" Both current and former students and staff have spent a week marking the 75th anniversary of St Michael's Catholic Parish Primary School. The celebrations coincide with the Feast Day of St Mary of the Cross MacKillop, the founder of the Order of the Sisters of St Joseph.", "articleID": "2015080911_00005328_W", "names": {"John O'Farrell": ["Q5018672", "Q6250876"]}}, {"date": "2015-08-09", "url": "http://news.sky.com/story/1532938", "content": "Play video \"Ferguson's Tribute To <mark>Michael Brown</mark>\" Video: Ferguson's Tribute To <mark>Michael Brown</mark> Share on Twitter Share on Facebook Share on Google + Share on Whatsapp Share by email By Sky News US Team Several hundred people have gathered in Ferguson, Missouri, to mark one year since the death of <mark>Michael Brown</mark>. Crowds of white and black people marched to remember the black teenager whose shooting by a police officer sparked a national debate on race and justice. They observed four-and-a-half minutes of silence at midday to represent the roughly four-and-a-half hours the 18-year-old's body lay in the middle of the street after he was shot. Two doves were released at the end. <mark>Michael Brown</mark>'s death spawned the Black Lives Matter movement The crowd then began a silent march from the spot where the unarmed <mark>Brown</mark> was fatally shot by Ferguson officer <mark>Darren Wilson</mark> on 9 August last year. A service commemorating the anniversary was held at a church in the St Louis suburb. Play video \"Activists Shove White House Hopeful\" Video: Activists Shove White House Hopeful Rallies were planned in other cities, including New York. Mr <mark>Brown</mark> Snr said his family is still grieving, but he believes his son's legacy can be seen in the increased awareness of police shootings. \"Everybody grieves differently,\" he told Sky News. \"I hurt every day .\" People know what happened was just wrong and all they are doing is just showing their respect and their love as for what has happened right here in this community. \"Mr <mark>Brown</mark> Sr also led a parade of several hundred people on Saturday. Some people in the parade wore T-shirts with likenesses of <mark>Brown</mark> or messages such as\" Hands up! Don't shoot! \"Play video\" Ferguson: How The Protests Grew \"Video: Ferguson: How The Protests Grew The slogan became a rallying cry after the shooting, even though witness claims that <mark>Brown</mark> had his hands up when he was shot were discredited by federal investigators. A grand jury and the US Department of Justice declined to prosecute <mark>Wilson</mark>, who resigned last November. But the shooting spawned the Black Lives Matter movement, which focuses on cases of unarmed young black men shot by police. Another name was added to that list on Friday when 19-year-old <mark>Christian Taylor</mark>, a black Texas college student, was shot dead by a white police officer responding to a burglary report. <mark>Brown</mark> had graduated from high school weeks before the shooting and planned to go to trade school to study to become an air conditioning technician. Relatives and friends described the 6ft 3in teenager as a gentle giant. Play video\" What Happened In Ferguson? \"Video: What Happened In Ferguson? But police said on the morning of his death <mark>Brown</mark> stole items from a store and shoved the owner who tried to stop him. Moments later, he and a friend were walking down the road when <mark>Wilson</mark> told them to move on to the pavement and the fatal confrontation ensued. Though the Justice Department cleared <mark>Wilson</mark>, it also cited racial bias and profiling in Ferguson's police and court system. Ferguson's city manager, police chief and municipal judge resigned within days. The new judge, interim city manager and interim police chief are all African American. By posting a comment you are agreeing to abide by our Terms & Conditions. See our House Rules and FAQs.", "articleID": "2015080918_00066017_W", "names": {"Christian Taylor": ["Q1751", "Q5110185", "Q5110187"], "Darren Wilson": ["Q17543917", "Q5225246", "Q5225247"], "Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"]}}, {"date": "2015-08-11", "url": "http://www.thisisanfield.com/2015/08/skrtel-and-lovren-are-rodgers-preferred-pairing-at-centre-half/", "content": "Share Tweet Martin Skrtel and Dejan Lovren linked up alongside each other for Liverpool's opening fixture against Stoke City on Sunday and are set to become <mark>Brendan Rodgers</mark> \"preferred centre-back pairing. It may not be the pairing that most supporters would go for--last week a poll on This Is Anfield suggested over 90% favoured a partnership of Skrtel and Mamadou Sakho--but it now looks like <mark>Rodgers</mark> has made his choice. Sakho was absent from the matchday squad on Sunday, but did travel to the Britanna Stadium. His absence was attributed to the fact he missed three days of training in the build up to the game after the birth of his second child. However, reports claim <mark>Rodgers</mark> had chosen Lovren ahead of Sakho regardless:\" <mark>Rodgers</mark> had already decided to start the season with Dejan Lovren alongside Martin Skrtel in central defence and the Croatia international responded with an assured display in the 1-0 victory, \"writes <mark>Andy Hunter</mark> in the Guardian. Despite most thinking the Frenchman is a far superior option to Lovren, he is now to be considered a back-up option by the manager. The Telegraph\" s Chris Bascombe explains in Tuesday's paper: \"Sakho must wait for his opportunity after <mark>Rodgers</mark> made it clear Dejan Lovren and Martin Skrtel are his preferred pairing at centre-half. Lovren responded to that show of faith with his most accomplished performance since joining Liverpool .\" Given that <mark>Rodgers</mark> had spoke in pre-season of wanting consistency in defence this season, it leaves Sakho's Liverpool future in doubt. Sakho joined Liverpool for & pound; 18 million from PSG in 2013, heralded at the time by <mark>Rodgers</mark> as the future of the Reds' defence, along with Tiago Ilori--who is yet to make a senior appearance for the club. \"Centre-halves are so hard to find. You look at some teams and they have ageing centre-halves because it's a struggle to get a really good one. We were fortunate in that two became available,\" said <mark>Rodgers</mark>. On Ilori, <mark>Rodgers</mark> said: \"He is 6ft 3ins tall, super quick, powerful and can jump. He just needs to adapt to the pace and physicality of the Premier League. He is one for the future, but he can be a really big talent .\" Sakho, the manager described: \"Sakho is also young, but he is an experienced player. He has senior international caps for France and looks an absolute monster in training. He's one who is ready for now and that's what we want .\" We had a chance to do that and protect the club for maybe the next 10 years and that is what we've done. \"Two years later and neither appear to have a future at the club. RELATED: Sakho is\" the best defender we have \", says former Liverpool striker ARCHIVE: Dispelling the myth that Sakho is clumsy (Part 2) Share Tweet More: <mark>Brendan Rodgers</mark>, Dejan Lovren, Mamadou Sakho, Martin Skrtel", "articleID": "2015081116_00139331_W", "names": {"Andy Hunter": ["Q1854083", "Q4207488", "Q526207"], "Brendan Rodgers": ["Q19973684", "Q310623"]}}, {"date": "2015-08-13", "url": "http://rockrivertimes.com/2015/08/13/new-state-law-bans-choke-holds-gives-guidelines-on-body-cameras/", "content": "Crime & Courts News State News August 13, 2015August 13, 2015 <mark>Shane Nicholson</mark> 86 Views 0 Comment By Mary Wisniewski Reuters CHICAGO--Illinois Governor Bruce Rauner signed a law on Wednesday to improve training for police officers, banning excessive use of force including choke holds and creating guidelines on using body cameras. Illinois is among the first states to pass police reform legislation since a fatal shooting of an unarmed black teen by a white police officer in Missouri last year sparked a national debate about police conduct. Other states to pass reform bills include Colorado, Connecticut, Maryland and California, but Illinois' law is one of the broadest and most comprehensive, said Rich Williams, policy specialist for the National Conference of State Legislatures. State Senator Kwame Raoul, a Chicago Democrat who sponsored the bill, said most officers are putting their lives on the line for the public, and this law will help them do their jobs better, while weeding out abuses. \"This is not just about police officer accountability, but restoring public confidence so police can do their jobs .\" - State Senator Kwame Raoul \"This is not just about police officer accountability, but restoring public confidence so police can do their jobs,\" Raoul said in an interview. \"You have a heightened level of cooperation when you have a heightened level of confidence .\" The Illinois bill establishes rules for racial sensitivity training and reporting requirements for officers who make stops and arrests. The body camera portion of the bill establishes standards on when officers need to have cameras on and how long recordings should be retained. The bill also calls for setting up a database to keep track of when a police officer quits while under investigation, so he or she is not hired by another department. The bill also makes clear that police officers cannot stop another person from recording them while they are performing their duties. \"Today we are taking steps to strengthen the relationship between our law enforcement officers and the public they protect,\" Rauner said in a statement.", "articleID": "2015081319_00211342_W", "names": {"Shane Nicholson": ["Q7488198", "Q7488199"]}}, {"date": "2015-08-14", "url": "http://www.thejakartapost.com/news/2015/08/14/badminton-chen-pushed-brink-axelsen-jakarta.html", "content": "Tokyo 2020 Olympic logo designer faces fresh plagiarism claims <mark>Chen Long</mark> fought off a stubborn Viktor Axelsen at the world championships Friday, with the plucky Dane pushing the top seed to the limit in an epic quarter-final showdown in Jakarta. <mark>Chen</mark> claimed the first game but the seventh-seeded Axelsen put up a dogged defense in the second, dragging the contest beyond an hour before succumbing 21-18, 30-29. \"I was starting to prepare for the third game, but luckily I got it,\" <mark>Chen</mark> told reporters via a translator. It's not the first time the 21-year-old Dane has punched above his weight against the Chinese champion, narrowly losing in a three-set battle for gold in the Australian Open in May. A devastated Axelsen said he struggled to find rhythm and get the best of his formidable opponent. \"I was so close to getting the second set, but <mark>Chen Long</mark> played better than me here,\" the young hopeful told reporters after the match. \"Of course when I look back in a few days I can be proud of my performance today...but when you are so close to winning it's pretty disappointing .\" <mark>Chen</mark> progresses to the semi-finals where he will face fourth seed Kento Momota, who dispatched Hong Kong's <mark>Wei Nan</mark> 21-6, 21-14. The 20-year-old Momota, who won the Indonesian Open in June, said he was hoping to face Axelsen but is determined to do his best against the defending champion. \"<mark>Chen Long</mark> is the number one seed, so I hope to prove myself against him,\" the Japanese star said through a translator. In the women's singles, world number one Carolina Marin appeared at her most confident as she charged past her toughest opponent yet, seventh seed <mark>Wang Shixian</mark> of China, 21-17, 21-19. The Spaniard showed no sign of the ankle injury she incurred on Thursday and kept her cool even as <mark>Wang</mark> put her through her paces in the second game. Marin will next face the winner of another quarter-final match scheduled later on Friday between ninth-seeded Korean Sung Ji-Hyun or India's P.V. Sindhu. \"I don't care if it's going to be Sung Ji-Hyun or Sindhu,\" a confident Marin said. \"We will see who wins .\" Indonesia's unseeded shuttler Lindaweni Fanetri upset Taiwan's Tai Tzu Ying, bouncing back from a slow start to defeat the fourth seed 14-21, 22-20, 21-12 before a roaring home crowd. Unseeded Japanese pair Naoko Fukuman and Kurumi Yonao, who dismissed the second-ranked Chinese pair on Thursday, continued their rampage in the women's doubles with a 25-23, 21-14 win over 13th seeded Indian pair Jwala Gutta and Ashwini Ponnappa. There were fewer surprises in the mixed doubles, with the top three pairs - two from China and one from Indonesia - progressing to the semi finals. Five-time world champion <mark>Lin Dan</mark> and second seed Jan O. Jorgensen go head-to-head later Friday in what is expected to be one of the tournament's fiercest contests to date. The winner of that match will likely face Malaysia's Lee Chong Wei who has returned from an eight-month doping ban guns blazing. The unseeded former world number one has already knocked off two seeded opponents in Jakarta, and is expected to do the same with Hong Kong's <mark>Hu Yun</mark> later Friday. (+ + +) Read also:", "articleID": "2015081410_00088843_W", "names": {"Chen Long": ["Q45375068", "Q45435348", "Q45441513", "Q45441731", "Q45449492", "Q45452930", "Q45464073", "Q45498661", "Q45552931", "Q45629509", "Q45641681", "Q715563"], "Hu Yun": ["Q45411652", "Q45497983", "Q45567421", "Q45580655", "Q45631951", "Q45724354", "Q45727059", "Q45727361", "Q45727422", "Q56064933", "Q933753"]}}]