[{"date": "2015-08-14", "url": "http://www.thejakartapost.com/news/2015/08/14/badminton-chen-pushed-brink-axelsen-jakarta.html", "content": "Tokyo 2020 Olympic logo designer faces fresh plagiarism claims <mark>Chen Long</mark> fought off a stubborn Viktor Axelsen at the world championships Friday, with the plucky Dane pushing the top seed to the limit in an epic quarter-final showdown in Jakarta. <mark>Chen</mark> claimed the first game but the seventh-seeded Axelsen put up a dogged defense in the second, dragging the contest beyond an hour before succumbing 21-18, 30-29. \"I was starting to prepare for the third game, but luckily I got it,\" <mark>Chen</mark> told reporters via a translator. It's not the first time the 21-year-old Dane has punched above his weight against the Chinese champion, narrowly losing in a three-set battle for gold in the Australian Open in May. A devastated Axelsen said he struggled to find rhythm and get the best of his formidable opponent. \"I was so close to getting the second set, but <mark>Chen Long</mark> played better than me here,\" the young hopeful told reporters after the match. \"Of course when I look back in a few days I can be proud of my performance today...but when you are so close to winning it's pretty disappointing .\" <mark>Chen</mark> progresses to the semi-finals where he will face fourth seed Kento Momota, who dispatched Hong Kong's <mark>Wei Nan</mark> 21-6, 21-14. The 20-year-old Momota, who won the Indonesian Open in June, said he was hoping to face Axelsen but is determined to do his best against the defending champion. \"<mark>Chen Long</mark> is the number one seed, so I hope to prove myself against him,\" the Japanese star said through a translator. In the women's singles, world number one Carolina Marin appeared at her most confident as she charged past her toughest opponent yet, seventh seed <mark>Wang Shixian</mark> of China, 21-17, 21-19. The Spaniard showed no sign of the ankle injury she incurred on Thursday and kept her cool even as <mark>Wang</mark> put her through her paces in the second game. Marin will next face the winner of another quarter-final match scheduled later on Friday between ninth-seeded Korean Sung Ji-Hyun or India's P.V. Sindhu. \"I don't care if it's going to be Sung Ji-Hyun or Sindhu,\" a confident Marin said. \"We will see who wins .\" Indonesia's unseeded shuttler Lindaweni Fanetri upset Taiwan's Tai Tzu Ying, bouncing back from a slow start to defeat the fourth seed 14-21, 22-20, 21-12 before a roaring home crowd. Unseeded Japanese pair Naoko Fukuman and Kurumi Yonao, who dismissed the second-ranked Chinese pair on Thursday, continued their rampage in the women's doubles with a 25-23, 21-14 win over 13th seeded Indian pair Jwala Gutta and Ashwini Ponnappa. There were fewer surprises in the mixed doubles, with the top three pairs - two from China and one from Indonesia - progressing to the semi finals. Five-time world champion <mark>Lin Dan</mark> and second seed Jan O. Jorgensen go head-to-head later Friday in what is expected to be one of the tournament's fiercest contests to date. The winner of that match will likely face Malaysia's Lee Chong Wei who has returned from an eight-month doping ban guns blazing. The unseeded former world number one has already knocked off two seeded opponents in Jakarta, and is expected to do the same with Hong Kong's <mark>Hu Yun</mark> later Friday. (+ + +) Read also:", "articleID": "2015081410_00088843_W", "names": {"Lin Dan": ["Q1390341", "Q45357783", "Q45370224", "Q45568304"], "Wang Shixian": ["Q443201", "Q45469412", "Q45473076", "Q45484720", "Q45494257", "Q45506435", "Q45525991", "Q45572498", "Q45586705", "Q45593361", "Q45643667", "Q45644600", "Q45669497"], "Wei Nan": ["Q15041093", "Q45525012", "Q45708293"]}}, {"date": "2015-08-14", "url": "http://arcadesushi.com/nintendo-employee-fired-for-podcast/", "content": "Nintendo Employee Fired for Speaking on Podcast EDIT Jon Ledford | an hour ago Nintendo A localizer at Nintendo has been fired for appearing on a podcast and giving honest opinions about his company's efforts to bring foreign titles to the West. Polygon reports that Nintendo localizer and Treehouse employee Chris Pranger was fired from the company after appearing on the Part-Time Gamers podcast. Nintendo of America's Treehouse division is often used to localize the company's Japanese games for the North American market, handling the English, French and Spanish translations of games that have more abundant amounts of Japanese audio and text in them compared to Nintendo's usual titles. Pranger revealed that he was fired on Twitter for appearing on the podcast and the comments he made there. In the interview, Pranger commented on the fans who were being critical of what Nintendo was (and wasn't) bringing overseas. \"It'll be like,\" Yeah, we do want money, which is why we know it's a colossal waste to localize that in this current market because look at you people. You don't make up a big enough group,' \"Pranger said on the podcast .\" You look at something like even Xenoblade Chronicles. People love that game, you know, within a certain group. That game is not the type of game that just pulls in enough to justify the costs on that. We got it in the States by luck, that [Nintendo] decided \"Oh, we'll take the bullet. We'll localize that .'\" \"And people are like\" Why do you guys hate money?' We don't. That's why you literally can't make everything. And people don't like finding out that their fanbase is actually too small to justify the costs of the thing they want. And they don't get that. \"Pranger also mentioned how fighting game enthusiasts got upset at Super Smash Bros. being geared towards a more casual fanbase. He explained that they are simply a niche group who don't make up enough of Nintendo's overall audience to be considered on how to develop such a widely popular game. On the topic of Uncharted 4, Pranger mentioned that he wasn't\" supposed to say nice things about our competitors, \"suggesting that Nintendo has some sort of guideline in place for either avoiding the topics of Sony and Microsoft or not openly praising them. Meanwhile, <mark>Phil Spencer</mark> has openly commended both Nintendo and Sony for their ventures on the E3 stage while millions of people were watching. To no surprise, the comments Pranger said about Nintendo weren't that bad, but they certainly weren't as sugarcoated as Nintendo would've liked. I've seen plenty of Xbox and PlayStation employees be more frank about their companies than Pranger has, and it's a shame that he lost his job for being honest. As some of you may have heard, yes, I was fired yesterday. Yes, it was ultimately my own fault. No, I did not see this coming .--Chris Pranger (@ TheChrisPranger) August 13, 2015 Even Sonic the Hedgehog feels for Pranger's termination: Dear @ Thechrispranger: Hang in there. We all make mistakes--we kissed a princess once. Things will get better. pic.twitter.com/SwHt1rVOlb--Sonic the Hedgehog (@ sonic_hedgehog) August 13, 2015 100 Video Game Facts You May Not Know Filed Under: Nintendo Categories: News Next Up The Legend of Zelda Redone as a Western Comments Leave A Comment", "articleID": "2015081416_00154593_W", "names": {"Phil Spencer": ["Q16207227", "Q16734485"]}}, {"date": "2015-08-15", "url": "http://thegazette.com/subject/opinion/blogs/lynda-waddington/binders-full-of-x2026-hypocrisy-20150815", "content": "Binders full of...hypocrisy Lynda Waddington, Exact Change August 15, 2015 | 7:00 am Pardon the dust, but it's time we brush off one of the Republican Party's binders full of women. And, no, I'm not talking about Mitt Romney's fictional debate binders, but the very real autopsy report commissioned by the Republican National Committee in the wake of the 2012 election. Romney garnered support from male voters, but experienced an 11-point deficit among female voters. And, when single women were singled out, the gap became a cavern of 36 percentage points. The report concluded women are not a \"coalition,\" and appealing to them should be integrated into all activities. GOP talkers \"need to use language that addresses concerns that are on women's minds in order to let them know we are fighting for them .\" Among the findings was that women voters are interested in hearing facts. \"Many of them run the economies of their homes and understand economics better than the men in their families .\" Give props to baby steps; maybe next time the RNC will notice women also dare to run businesses. Additional baby steps: \"They feel like they are smart, engaged and strong decision-makers, but that their opinions are often ignored .\" Acknowledging that women \"feel\" they have brains is a start, albeit a very small one. The report does not call for reconsideration of issue stances that led to the \"War on Women .\" Instead, Republicans are encouraged to point fingers, making sure \"feeling\" women understand Democratic positions also impact them. Psst: Next time, tell us something we don't know. Republicans, the report admonished, need to put women on the national stage, not only as candidates, but as spokeswomen because...wait for it...they \"are far better at connecting with these voters because they are more likely to understand them .\" The real kicker is that existing Republican officials and the 2016 field can't even be bothered to attempt to follow these meager and condescending recommendations. U.S. Sen. Joni Ernst, arguably a benefactor of the RNC report, reacted to secretly-recorded videos of Planned Parenthood staffers discussing how the organization engages in the legal practice of accepting reimbursement costs when supplying fetal tissue to researchers by sponsoring a bill prohibiting the flow of women's health care dollars to Planned Parenthood. Republican Mitch McConnell, who championed the law that opened the door on fetal tissue sales, was her co-sponsor. The measure held the same ick factor as <mark>Donald Trump</mark> telling women how pretty we look on our knees--you know, when we aren't bleeding out of our wherever. Ernst's proposal was not to ban fetal tissue use in research, or to change the reimbursement framework. It was not an attempt to end abortion, because the targeted funding provided birth control, STI testing and prenatal care. The RNC binder should have noted that even the breast-burdened understand the hypocrisy of launching a program, then demonizing those who play by your established rules. Having Ernst as the messenger makes no difference. Hypocrisy is like recently renovated Target toy aisles: gender neutral. • Comments: @ LyndaIowa, (319) 339-3144, lynda.waddington @ thegazette.com Have you found an error or omission in our reporting? Is there other feedback and/or ideas you want to share with us? Tell us here.", "articleID": "2015081512_00079141_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-08-17", "url": "http://timesofindia.indiatimes.com/business/international-business/Oil-prices-slide-further-in-Asia/articleshow/48508618.cms", "content": "The Times of India You are here: Home & raquo; Business & raquo; International Business Breaking News: More from The Times of India Recommended By Colombia Oil prices slide further in Asia The author has posted comments on this articleAFP | Aug 17, 2015, 09.59 AM IST ApnaCircle Oil prices resumed their decline in Asia on Monday as a global glut of crude supplies showed no signs of abating in the face of sluggish demand, analysts said. SINGAPORE: Oil prices resumed their decline in Asia on Monday as a global glut of crude supplies showed no signs of abating in the face of sluggish demand, analysts said. US benchmark West Texas Intermediate (WTI) for September delivery fell 63 cents to $41.87 a barrel in late-morning trade, the lowest since March 2009. Brent crude for October, a new contract, was down 65 cents to $48.54. WTI and Brent's September contract rose in New York on Friday after closing at their lowest level in six and a half years in the prior session. But oil came under renewed pressure in Asia after the latest data showing the number of rigs drilling for US oil increased last week, the sixth rise in seven weeks, analysts said. The news added to fears of a prolonged global surplus as output from the Organization of the Petroleum Exporting Countries and the US remains robust despite the tumbling prices. \"The combination of elevated stockpiles in the US and increasing production from OPEC, sluggish demand growth, and a stronger US (dollar) would continue to pressure oil prices,\" said Bernard Aw, market strategist at IG Markets in Singapore. The dollar strengthened in Asia on Monday after solid data boosted expectations of an imminent US rate rise, after China's shock devaluation of the yuan last week hurt Asia-Pacific currencies. As oil is traded in the US currency, a strong dollar makes it more expensive for international investors, dampening demand. \"The devaluation of the yuan by China led to the weakening of other emerging market currencies,\" said <mark>Sanjeev Gupta</mark>, who heads the Asia-Pacific oil and gas practice at professional services firm EY. Stay updated on the go with Times of India News App. Click here to download it for your device. From around the web", "articleID": "2015081705_00001421_W", "names": {"Sanjeev Gupta": ["Q23883128", "Q46585791"]}}, {"date": "2015-08-17", "url": "http://northjersey.com/news/river-edge-council-holds-hearing-on-funding-for-park-1.1393761", "content": "River Edge council holds hearing on funding for park August 17, 2015 Last updated: Monday, August 17, 2015, 11:42 AM By Stephanie Alberico Pages: 1 2> display on one page The borough's Recreation Commission is proposing to finish Cherry Blossom Park, located on Bogert Road near Cherry Hill School, with the help from a Bergen County Open Space Fund. The tree farm for the park was planted last summer. Conceptual plans have been in the works for some time, with a proposed park featuring the tree farm, gardens, storage sheds, benches, lighting, a stone wall, gazebo, pergola, a stone dust trail and an outdoor classroom. The borough purchased the land for the park in 2009 for $425,000 with a county Open Space grant. During a Borough Council work session on Aug. 3, the council discussed moving forward with the first two phases of the project. <mark>Thomas Miller</mark>, the consultant on the project, and Recreation Director Bobbi Conway presented bid options to the council. \"What we're looking at is a phase 2 application for Bergen County Open Space,\" Conway said, estimating that the subtotal for the entire project would be approximately $140,000. The grant from Bergen County for open space would be about $70,000, with the borough then responsible for the remaining $70,000, according to Conway. <mark>Miller</mark> said during the first phase, fencing right beside the school would be installed. The base items in the bid would include pole-mounted lighting, accessible parking spaces, irrigation systems and landscaping. Additional items for the park would include an entrance walkway overlay, pergola, low stone wall and a gazebo. <mark>Miller</mark> said although they considered including an outdoor classroom and storage shed in the original plan, the items were left out of the subtotal of the cost and considered additions to the project. These two items would cost an approximate additional $19,000. Councilman Edward Mignone said that officials could not guarantee that they would receive the $70,000 grant from the county and they should consider that when setting aside funding for the project. Mignone said that the approximate cost would turn out be higher, approximately $157,000 plus 10 percent contingency, permits and other fees. \"So we're probably looking at total costs of $200,000,\" he said. \"This is the issue: We're asking for $70,000 with a $70,000 match, but the allocations on the county level are down 40 percent this year. Last year the region got $464,000. This year our region is getting $290,000. So it's more likely we're going to get $25,000 instead of $70,000 .\" What I'm concerned about, and we ran into this problem with another project, is we're going to be proposing a $200,000 project, \"he continued .\" We're going to get $20,000 and we're going to commit ourselves to spending the full $200,000 and that money is not available. I'm not prepared to go for a $70,000 grant and then go and spend $200,000 plus on this project. \"Mayor Sandy Moscaritolo said that the council would take a vote on going out for the grant application with the understanding that the details and specifics of the park could be changed, if necessary .\" We can certainly complete the project in a third phase if we need to, \"he said .\" The matching fund will most likely come from the local open space fund that we've already established and we can always lower our expectations. \"Conway said she discussed it with the Recreation Commission and they approved the project and the estimate .\" Actually this is the only project that we have open to go out for open space for the county, \"Conway said .\" This is the only project that we're working on right now. \"The resolution endorsing the council to go for the next round of the open space application was passed. Mignone was the only dissenting vote. Councilman Anthony Cappola was not present at the meeting. Mignone said he voted\" no \"because the governing body does not know the full scope of the project and would be earmarking $70,000. The council also voted to accept the lowest bid for the first phase of the project.", "articleID": "2015081715_00181033_W", "names": {"Thomas Miller": ["Q1645605", "Q18810669", "Q2426140", "Q24706764", "Q7792461", "Q7792467"]}}, {"date": "2015-08-18", "url": "http://economictimes.indiatimes.com/articleshow/48524567.cms", "content": "Bihar polls: SP to fight polls with or without mahagathbandhan By Vithika Salomi, TNN | 18 Aug, 2015, 11.55 AM IST Post a Comment READ MORE ON & raquo; Samajwadi Party (SP) | samajwadi party | RJD president | <mark>Ram Chandra Yadav</mark> | <mark>Nitish Kumar</mark> | Nationalist Congress Party (NCP) | Kiranmoy Nanda <mark>Nitish</mark>, Lalu and Congress general secretary C P Joshi on August 12 announced the JD (U) and RJD would contest from 100 constituencies each. ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! PATNA: The rift in the JD (U) and RJD-led grand alliance did not seem to end with the Samajwadi Party (SP), which has not been allotted any seat by the alliance, declaring on Monday it would \"definitely' contest the coming Bihar election with or without the alliance. Much to the disappointment of CM <mark>Nitish Kumar</mark> and RJD president Lalu Prasad who have been trying to bring non-NDA parties on one platform, the Nationalist Congress Party (NCP) has also threatened to quit the grand alliance if the party is not given at least 12 seats. <mark>Nitish</mark>, Lalu and Congress general secretary C P Joshi on August 12 announced the JD (U) and RJD would contest from 100 constituencies each while Congress would fight for 40 seats. Three seats were left for NCP. At least 51 SP functionaries sat on indefinite hunger strike on August 14, demanding at least 17 of the 243 assembly seats from the alliance leadership. They called off their fast on Monday evening after SP national vice-president and Rajya Sabha MP Kiranmoy Nanda assured them that the party would contest the polls and that he was in talks with Lalu and <mark>Nitish</mark> over the issue .\" The party's aim is to defeat BJP in Bihar. I have already talked to Lalu-ji and he has agreed to discuss the issue. I will also talk to Nitish-ji, \"Nanda told TOI and added the SP would definitely contest the Bihar assembly polls. State SP president <mark>Ram Chandra Yadav</mark> said the party's parliamentary board would take the final decision on the matter .\" If the alliance leadership does not give us respectable number of seats, we will contest without the alliance, \"he said, claiming the party has 2 to 7% vote share in Bihar. However, CM <mark>Nitish Kumar</mark> on Monday ruled out any scope for redistribution of seats. He said the onus was on the NCP to decide whether they wanted to be a part of the alliance or not .\" The seats have already been distributed among the allies and there is no need to revise it, \"said <mark>Nitish</mark>, who is the CM candidate of the alliance. Stay on top of business news with The Economic Times App. Download it Now!", "articleID": "2015081806_00079543_W", "names": {"Nitish Kumar": ["Q122304", "Q7041330"], "Ram Chandra Yadav": ["Q14643701", "Q44820740"]}}, {"date": "2015-08-19", "url": "http://lebanondemocrat.com/article/wilson-county-fair/699286", "content": "Lebanon man brings home tractor at Great Giveaway <mark>John Hoffman</mark> selects <mark>John</mark> Deere Aug 18, 2015 A Lebanon man was the big winner Tuesday night at the annual Great Giveaway. <mark>John Hoffman</mark> selected the <mark>John</mark> Deere tractor as his prize. <mark>Hoffman</mark> said he \"probably had about 40 tickets .\" <mark>Hoffman</mark> lives on a small farm in Lebanon, so the tractor will be put to good use. He said this will be his first <mark>John</mark> Deere. \"I have Massey Ferguson's,\" he said. The winning ticket was handed out at the Lebanon Kroger.", "articleID": "2015081903_00157754_W", "names": {"John Hoffman": ["Q16106293", "Q16196063", "Q59247363"]}}]