[{"articleID": "2012082414_00093211_W", "names": {"Scott Daniels": ["Q1719941", "Q7436212", "Q7436213"]}, "date": "2012-08-24", "url": "http://futuresmag.com/2012/08/24/apple-counts-on-iphone-being-too-cool-for-us-to-ba?ref=rss", "content": "enewsletters complete coverage from the editors of apple inc. is counting on the popularity of its devices and political pressure to thwart efforts by google inc.'s motorola mobility to block imports of the iphone and ipad, two of the best-selling electronic devices in the u.s. the u.s. international trade commission in washington is scheduled to announce today whether iphones and other apple devices infringe motorola mobility patents and, if so, whether it will stop them from being imported into the u.s. from asia. as part of its review, the itc is weighing whether to limit use of import bans in disputes over patents that relate to industrywide standards. some members of congress, the u.s. federal trade commission and companies including intel corp. have urged such a step. \"i do not think, in the current legal and political climate, that there is any possibility that the iphone will be excluded from importation,\" said rodney sweetland, a patent lawyer with duane morris in washington who specializes in itc cases. motorola mobility says apple products infringe four patents, two of which relate to industry standards for 3g wireless and wi-fi technologies, and that apple has rebuffed offers to license the standard-essential patents. the other two patents aren't standard-essential, nor are the seven patents that are the subject of a new complaint motorola mobility filed aug. 17. apple denies infringing the patents and contends they're invalid. even if the commission finds a patent violation, apple says in filings that its devices shouldn't be stopped at the u.s. border. \"neat' products\" the commission is under some political pressure not to keep \"neat' products out of the country,\" said <mark>scott daniels</mark> of westerman hattori in washington, who does itc cases. \"normally, politics and congress have very little impact on commission rulings. in the case of something so central to the economy, there could be an impact.\" a trade judge in april said apple, which this week became the most valuable u.s. company in history, violated one patent that's essential to 3g. the commission is reviewing his findings. the iphone's $47.1 billion in sales and $20.4 billion in ipad sales together made up more than 62 percent of cupertino, california-based apple's fiscal 2011 sales, according to data compiled by bloomberg. the second standard-essential patent in motorola mobility's complaint also would cover mac computers, the ipod touch and apple tv. members of congress including house judiciary committee chairman lamar smith, a texas republican, wrote the itc in june saying the benefits of adopting standard technologies \"may be undermined\" if patent disputes threaten the ability to sell products in the u.s. the senate judiciary committee held a july 11 hearing on the issue. patent owners whose technologies are adopted as industry standards, such as specifications that let wireless phones communicate with one another, agree to charge fair and reasonable licensing fees. in those kinds of cases, the ftc urged the trade commission to take other steps, such as pushing for mediation of royalty amounts, before considering a ban on imports. blocking imports based on infringement of a standard - essential patent \"has the potential to cause substantial harm to u.s. competition, consumers and innovation,\" the ftc wrote in a june 6 filing with the agency. it said companies could be coerced into unreasonable licensing fees in a practice known as a \"patent holdup.\" motorola mobility says it fulfilled its obligation to make a reasonable royalty offer and apple refuses to negotiate. \"unwilling licensee'\" apple and others--without analyzing the facts of this case--point to the problem of \"hold up,'\" motorola mobility told the commission in a july 16 filing. \"but they ignore the counter problem of\" hold out'--an unwilling licensee being rewarded for its intransigence in a manner that will deprive patent owners of value and create disincentives for innovative companies from participating in standards setting. \"the case represents one battle in a broader global legal war over patents, including more than a dozen complaints at the itc over the past two years, as companies vie for increased shares of a smartphone market that grew 62 percent to $219 billion last year. apple, in one of the high-profile cases, is awaiting a california jury's verdict in a separate dispute claiming that samsung's android phones copied patented iphone features. in south korea today, the seoul central district court ruled that apple and samsung infringed each other's patents and told them both to stop selling some versions of their products in that country. google, based in mountain view, california, is counting on motorola mobility's long history with mobile phones--and its trove of 17,000 patents--to force apple into a settlement of the itc case that could also encompass handset makers using google's android operating system, including samsung electronics co. and htc corp. motorola mobility approached apple in 2007 about a patent license, demanding a royalty of 2.25 percent of the price of apple products. motorola mobility has said that's the standard offer it makes, and expects the figure to change during negotiations. apple and microsoft corp., which has its own legal fights with motorola mobility, said the demand was unreasonable. presidential review president barack obama could review a commission decision and reject any import ban on public policy grounds. in the past, patent owners have lost efforts to block imports for health - related products, for devices that reduced gasoline consumption during the 1970s oil crisis, and when the government was in the midst of trade negotiations. itc judge thomas pender, who presided over the trial, recommended that the agency issue an import ban on any product found to infringe the motorola mobility patents. he said apple should pay the 2.25 percent royalty rate during the 60-day presidential review period.\" extreme solution' qualcomm inc., which makes and designs chips for mobile phones and gets more than one-third of its revenue from licensing, said the ftc's suggestion for limiting import bans based on standard-essential patents is \"an extreme solution in search of a problem.\" the commission could say that an import ban isn't in the public interest, or delay imposing a ban to give apple and motorola mobility time to resolve their differences or to have other courts hear their cases, said david long, a patent lawyer with dow lohnes in washington. \"their challenge would be to create what relief they can if there is a violation,\" long said. \"it's up to congress to establish whether standard-essential patents are welcome at the itc, and congress hasn't done that.\" the case is in the matter of certain wireless communication devices, portable music data, processing data devices, computers and components thereof, 337-745, u.s. international trade commission (washington). apple inc. is counting on the popularity of its devices and political pressure to thwart efforts by google inc.'s motorola mobility to block imports of the iphone and ipad."}, {"articleID": "2019010818_00559664_W", "names": {"Marc Rubio": ["Q57610577", "Q5995382"]}, "date": "2019-01-08", "url": "https://www.commondreams.org/views/2019/01/08/instead-ending-shutdown-senators-plan-encourage-punishment-israel-boycotts?cd-origin=rss", "content": "In the middle of a government shutdown, the Senate leadership's first order of business in the 116th Congress is not legislation to reopen the government. Instead, and incredibly, the Senate is again trying to slip a measure intended to suppress protected political expression past public scrutiny. The bill is the \"Combatting BDS Act,\" which would express federal approval of state laws that place restrictions on boycotts of Israel and its settlements, as part of an effort to weaken the Boycott, Divestment, and Sanctions (BDS) movement against Israel. The bill is included in S. 1, which the Senate plans to vote on this week. On Monday, the ACLU sent a letter to senators expressing opposition to the bill. To their credit, Sens. Ben Cardin (D-Md .), Chris Van Hollen (D-Md .), and Bernie Sanders (D-Vt .) have urged the Senate not to consider any bills, other than those that would reopen the government, until the shutdown ends. We agree. The Combatting BDS Act represents yet another covert attempt by the Senate to enact legislation that would burden fundamental free expression rights without proper consideration on the heels of a failed attempt last month to pass a different law criminalizing boycotts of Israel. But moreover, voting on it now, amid a partial government shutdown, would be, as Sen. Cardin noted, \"a fundamental failure to govern.\" The Combating BDS Act would attempt to give legal cover to states that enact laws penalizing businesses and individuals who participate in boycott activities against Israel and Israeli-controlled territories. The Combating BDS Act would attempt to give legal cover to states that enact laws penalizing businesses and individuals who participate in boycott activities against Israel and Israeli-controlled territories. These state laws, dozens of which exist in many different forms, generally compel state contractors and any entity in which the state invests--for example, through a state-run pension, retirement, or endowment fund--to sign oaths promising not to boycott Israel as a requirement of maintaining their relationship with the state. However, as courts found in the McCarthy era, the government can't fire its employees or contractors just because they refuse to sign an oath promising not to engage in disfavored expression or association. And two federal courts have already held state requirements to swear not to participate in boycotts of Israel be unconstitutional. While we take no position on Israel boycotts, the BDS movement or the Israeli-Palestinian conflict, we do maintain that states should not be sanctioning businesses on the basis of First Amendment-protected expression and association. We have consistently--and successfully--argued this position in situations where government entities have threatened to boycott a company based upon its constitutionally protected speech and associational choices. This is especially true where the ideological position has no connection whatsoever with the business relationship at stake. Math teachers in Kansas and newspapers in Arkansas should not have to disavow participation in protected expression and association in order to do their jobs or engage in business relationships with the state. With the Combatting BDS Act, Congress would be approving state laws imposing such unconstitutional requirements. On Monday, Sen. <mark>Marc Rubio</mark> (R-Fla .), the lead sponsor of the bill, tweeted: This is a lie. My bill doesn't punish any political activity. It protects the right of local & state govts that decide to no longer do business with those who boycott #Israel. So boycotting #Israel is a constitutional right, but boycotting those participating in #BDS isn't? https: //t.co/kY9MSmBkkh--Marco Rubio (@ marcorubio) January 7, 2019 However, as we responded, the government, under the Constitution, does not have the right to punish people for their views. The First Amendment protects the people, not the government. Even setting aside our fundamental disagreement about the wisdom of the Combatting BDS Act, it is abundantly clear that the Senate should not be considering this legislation, or any other legislation, until it fulfills its first duty: maintaining a functioning government. The Senate should vote first to open the government and alleviate the pain of this interminable shutdown that disrupts people's lives and livelihoods every second that it continues."}, {"articleID": "2013050703_00020633_W", "names": {"David Welch": ["Q16193927", "Q27913581", "Q42174943", "Q5240945", "Q5240946", "Q5240947"], "Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2013-05-06", "url": "http://www.sys-con.com/node/2646233", "content": "May 6, 2013 / PRNewswire /--Stone Energy Corporation (NYSE: SGY) today announced financial and operational results for the first quarter of 2013. Some of the highlights include: Two deep water drilling rig contracts were secured for the Stone operated projects in the proximity of its Pompano platform. The Diamond Ocean Victory is scheduled to drill the Amethyst exploration prospect starting in September 2013 and an ENSCO 8500 series rig is anticipated to commence drilling the Cardona and Cardona South development wells starting in the first quarter of 2014. Production volumes slightly exceeded the upper end of first quarter guidance. In Appalachia, volumes have been substantially restored from the third party pipeline interruptions which affected production from January through April 2013. Stone Energy Corporation was awarded the prestigious Safety in Seas Award from the National Ocean Industries Association. Stone Energy was recognized for innovative safety leadership in pioneering a new decommissioning method which resulted in a four-fold increase in the volume of work with zero OSHA recordable incidents. Chairman, President and Chief Executive Officer <mark>David Welch</mark> stated, \"We have taken a significant step in our deep water efforts by securing the Diamond Ocean Victory rig and the ENSCO 8500 series rig. The rigs will be used to drill the Amethyst exploration prospect and the Cardona and Cardona South development wells. If successful, these wells will be produced through the Stone-operated Pompano deep water platform, with Cardona and Cardona South production projected for late 2014 and Amethyst production projected for 2015. In addition to our Stone-operated deep water program, we plan to accelerate our participation in non-operated deep water wells with 5-7 exploration prospects being drilled in 2013 and 2014. In our liquids rich Deep Gas area, initial production from the third well at La Cantera is projected by June 2013 and is expected to increase gross field volumes to over 100 MMcfe per day (over 25 MMcfe per day net). In Appalachia, third party pipeline repairs around our Mary field have been made, allowing Marcellus net volumes to reach over 60 MMcfe per day again. Our conventional shelf drilling program for 2013 will start in May with several low risk development wells scheduled in the second and third quarters. Finally, with over $400 million credit facility and cash flow from operations, we are well positioned to fund our 2013 capital program.\" Financial Results For the first quarter of 2013, Stone reported net income of $0.82 per share, on oil and gas revenue of $232.9 million, compared to net income of $51.0 million, or $1.04 per share, on oil and gas revenue of $244.1 million in the first quarter of 2012. Discretionary cash flow totaled $159.1 million during the first quarter of 2013, as compared to $175.1 million during the first quarter of 2012. Please see \"Non-GAAP Financial Measures\" and the accompanying financial statements for a reconciliation of discretionary cash flow, a non-GAAP financial measure, to net cash flow provided by operating activities. Daily production during the first quarter of 2013 averaged 40.1 thousand barrels of oil equivalent (MBoe) per day (241 million cubic feet of gas equivalent (MMcfe) per day), compared with daily production of 45.0 MBoe (270 MMcfe) per day in the fourth quarter of 2012, and daily production of 41.0 MBoe (246 MMcfe) per day in the first quarter of 2012. First quarter of 2013 production was negatively impacted by third party pipeline interruptions in Appalachia. First quarter of 2013 production mix was 46% oil, 6% natural gas liquids (NGL), and 48% natural gas. Prices realized during the first quarter of 2013 averaged $42.49 per barrel of NGLs and $3.17 per Mcf of natural gas. Average realized prices for the first quarter of 2012 were $67.26 per barrel of NGLs and $2.41 per Mcf of natural gas. Effective hedging transactions increased the average realized price of natural gas by $0.38 per Mcf and increased the average realized price of oil by $2.72 per barrel in the first quarter of 2013. Effective hedging transactions increased the average realized price of natural gas by $0.48 per Mcf and decreased the average realized price of oil by $3.13 per barrel in the first quarter of 2012. Lease operating expenses during the first quarter of 2013 totaled $14.70 per Boe or $2.45 per Mcfe), compared to $11.93 per Boe or $1.99 per Mcfe), in the first quarter of 2012. Depreciation, depletion and amortization (DD & A) on oil and gas properties for the first quarter of 2013 totaled $20.65 per Boe or $3.44 per Mcfe), compared to $22.48 per Boe or $3.75 per Mcfe), in the first quarter of 2012. Salaries, general and administrative (SG & A) expenses for the first quarter of 2013 were $3.87 per Boe or $0.64 per Mcfe), compared to $3.68 per Boe or $0.61 per Mcfe), in the first quarter of 2012. Capital expenditures before capitalized SG & A and interest during the first quarter of 2013 were approximately $14.9 million of plugging and abandonment expenditures. Additionally, $6.6 million of SG & A expenses and $10.0 million of interest were capitalized during the first quarter of 2013. May 6, 2013 we had no outstanding borrowings under our bank credit facility. In addition, Stone had letters of credit totaling $379.0 million available for borrowing based on a borrowing base of $400 million. The borrowing base was reaffirmed at April 30, 2013. Operational Update Mississippi Canyon 26 - Amethyst (Deep Water). Stone has contracted the Diamond Ocean Victory deep water drilling rig for Stone's Amethyst oil exploration prospect at Mississippi Canyon 26. The deep water Amethyst exploration well is currently scheduled to spud late in the third quarter of 2013. Stone is the operator of the well and currently holds a 100% working interest, although expects to reduce its working interest in the prospect. The well is estimated to take four months to drill. Pompano Area - Cardona and Cardona South Prospects (Deep Water). Stone has contracted an ENSCO 8500 series dynamically positioned deep water drilling rig for Stone's Cardona oil development program at Mississippi Canyon 29. Drilling on the Cardona well is expected to commence in the first quarter of 2014 followed by the drilling of the Cardona South well. Stone plans to tie back both wells to the 100% owned Pompano platform with production projected for late 2014. Stone holds a 65% working interest in the Cardona wells and will be the operator. Each well is estimated to take three to four months to drill. Mississippi Canyon 983 - San Marcos (Deep Water). The deep water San Marcos exploration well is currently scheduled to spud late in the third quarter of 2013. Stone currently holds a 25% working interest in the prospect, which is operated by Apache. The well is estimated to take four months to drill. Mississippi Canyon 555 - Guadalupe (Deep Water). The deep water Guadalupe exploration well is currently scheduled to spud in late 2013 or early 2014. Stone currently holds a 40% working interest in the prospect, which is operated by Apache. The well is estimated to take four months to drill. Deep Water). The deep water Taggert exploration well is currently planned to spud in the second half of 2013. Stone currently holds a 23% working interest in the prospect, which is operated by LLOG. The well is estimated to take two months to drill. Deep Water). The deep water Phinisi exploration well is now projected to spud either in the fourth quarter of 2013 or the first half of 2014. Stone currently holds a 20% working interest in the prospect, which is operated by ENI. The well is estimated to take four months to drill. La Cantera (Deep Gas). The third well in the La Cantera field, the Broussard #1 ST #1, has been successfully drilled to 18,000 feet and is currently in completion operations with first production expected by June 2013. Combined with the first two wells, gross production from this field is projected at over 100 MMcfe per day (over 25 MMcfe per day net) when the third well commences production. Stone holds a 34.6% non-operated working interest in the field. Appalachian Basin (Marcellus Shale). Stone drilled 9 and completed 8 horizontal wells in the first quarter, and plans to drill and complete 28 to 32 horizontal wells in Appalachia in 2013. First quarter net volumes were negatively impacted by approximately 20 MMcfe per day as a result of third party pipeline failures and unscheduled gas processing plant outage. The Williams pipeline has been repaired and production is being restored, although there remain some pressure restrictions on volumes. Production is expected to increase as 11 recently completed wells in the Heather field (50% working interest) are brought on production. Appalachia is currently producing approximately 60 to 70 MMcfe per day, net. Conventional Shelf. The ENSCO 81 jack-up rig is expected to begin drilling on a three to four well conventional shelf/deep gas drilling program in May 2013. Stone expects to drill the Hammerlock oil prospect located on South Timbalier 100, followed by the Taildancer and Coracle oil prospects located on Ship Shoal 113. The Parker 50B inland barge rig spudded the Stone-operated Hyena prospect in the Clovelly field in April 30, 2013. Stone holds a 94% working interest in the Hammerlock prospect and a 100% working interest in Taildancer, Coracle, and Clovelly prospects. Other Information Stone Energy has planned a conference call for Tuesday, May 7, 2013 to discuss the operational and financial results for the first quarter of 2013. Anyone wishing to participate should visit our website at www.StoneEnergy.com for a live web cast or dial 1-877-228-3598 and request the \"Stone Energy Call.\" If you are unable to participate in the original conference call, a replay will be available immediately following the completion of the call on Stone Energy's website. The replay will be available for one month. In addition, as previously announced, Stone Energy will hold its 2013 Annual Meeting of Stockholders on 10:00 a.m. Central Time at the Windsor Court Hotel, 300 Gravier Street, New Orleans, Louisiana. The Company proposes to elect ten directors, to ratify the appointment of Ernst & Young LLP as the Company's independent public accounting firm for the fiscal year ending December 31, 2013, to have a non-binding advisory vote on the compensation of the named executive officers (say on pay), and to transact such other business as may properly come before the meeting. The close of business on March 25, 2013 has been fixed as the record date for determination of stockholders entitled to receive notification of and to vote at the Annual Meeting. Non-GAAP Financial Measures In this press release, we refer to a non-GAAP financial measure we call \"discretionary cash flow.\" Management believes discretionary cash flow is a financial indicator of our company's ability to internally fund capital expenditures and service debt. Management also believes this non-GAAP financial measure of cash flow is useful information to investors because it is widely used by professional research analysts in the valuation, comparison, rating and investment recommendations of companies in the oil and gas exploration and production industry. Discretionary cash flow should not be considered an alternative to net cash provided by operating activities or net income, as defined by GAAP. Please see the \"Reconciliation of Non-GAAP Financial Measure\" for a reconciliation of discretionary cash flow to cash flow provided by operating activities. Forward Looking Statements Certain statements in this press release are forward-looking and are based upon Stone's current belief as to the outcome and timing of future events. All statements, other than statements of historical facts, that address activities that Stone plans, expects, believes, projects, estimates or anticipates will, should or may occur in the future, including future production of oil and gas, future capital expenditures and drilling of wells and future financial or operating results are forward-looking statements. Important factors that could cause actual results to differ materially from those in the forward-looking statements herein include the timing and extent of changes in commodity prices for oil and gas, operating risks, liquidity risks, political and regulatory developments and legislation, including developments and legislation relating to our operations in the Gulf of Mexico and Appalachia, and other risk factors and known trends and uncertainties as described in Stone's Annual Report on Form 10-K and Quarterly Reports on Form 10-Q as filed with the SEC. Should one or more of these risks or uncertainties occur, or should underlying assumptions prove incorrect, Stone's actual results and plans could differ materially from those expressed in the forward-looking statements. Estimates for Stone's future production volumes are based on assumptions of capital expenditure levels and the assumption that market demand and prices for oil and gas will continue at levels that allow for economic production of these products. The production, transportation and marketing of oil and gas are subject to disruption due to transportation and processing availability, mechanical failure, human error, hurricanes and numerous other factors. Stone's estimates are based on certain other assumptions, such as well performance, which may vary significantly from those assumed. Delays experienced in well permitting could affect the timing of drilling and production. Lease operating expenses, which include major maintenance costs, vary in response to changes in prices of services and materials used in the operation of our properties and the amount of maintenance activity required. Estimates of DD & A rates can vary according to reserve additions, capital expenditures, future development costs, and other factors. Therefore, we can give no assurance that our future production volumes, lease operating expenses or DD & A rates will be as estimated. Stone Energy is an independent oil and natural gas exploration and production company headquartered in Lafayette, Louisiana with additional offices in Houston and Morgantown, West Virginia. Our business strategy is to leverage cash flow generated from existing assets to maintain relatively stable GOM shelf production, profitably grow gas reserves and production in price-advantaged basins such as Appalachia and the Gulf Coast Basin, and profitably grow oil reserves and production in material impact areas such as the deep water GOM and onshore oil. For additional information, contact Published May 6, 2013 Copyright? 2013 SYS-CON Media, Inc. - All Rights Reserved. Niklas Bjorkman wrote: Firstly I agree with your conclusion. NewSQL takes the best of the traditional databases and NoSQL databases to combine the benefits of both worlds. I do not agree that NewSQL vendors focus on giving scale-out features to transactional data. The NewSQL market is focusing on giving true ACID support combined with extreme performance, stepping away from the traditional relational structures in databases. A lot of developers appreciate the ease of accessing data using SQL and I think we will see more and more databases supporting standard SQL. As you said - NewSQL databases often maintain the...Is Your Business 100% Ready for the New Era of Cloud Computing and Big Data? The Only Enterprise IT Event in 2013 Covering the Entire Scope of both Cloud & Big Data Come to New York and get yourself up to date with the Big Data revolution! As advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the Cloud Computing boom, Cloud Expo is the single most effective event for you to learn how to use you own enterprise data - processed in the Cloud - most effectively to drive value for your business. There is little doubt that Big Data solutions will have an increasing role in the Enterprise IT mainstream over time. Get a jump on that rapidly evolving trend at Big Data Expo, which we are introducing in June at Cloud Expo New York. Cloud Expo was announced on February 24, 2007, the day the term \"cloud computing\" was coined. That same year, the first C loud Expo t ook place in New York City with 450 delegates. Next June, Cloud Expo is returning to New York with more than 10,000 delegates and over 600 sponsors and exhibitors. \"Cloud\" has become synonymous with \"computing\" and \"software\" in two short years. Cloud Expo is the new PC Expo, Comdex, and InternetWorld of our decade. By 2012, more than 50,000 delegates per year will participate in Cloud Expo worldwide. The cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. But moving from theory into practice is where things get complicated, and this is where attending a top industry event like Cloud Expo comes in. No one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th International Cloud Conference & Expo on June 10-13, 2013 - is to ensure - through an intensive four-day schedule of keynotes, general and breakout sessions, and our bustling Expo Floor - that attending delegates leave the Javits Center with abundant resources, ideas and examples they can apply immediately to leveraging the Cloud, helping them to maximize performance, minimize cost and improve the scalability of their Enterprise IT endeavors. Delegates will leave Cloud Expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. Whether you're an enterprise or small to medium business, you'll soon be benefiting from the Cloud. Join your peers in New York City June 10-13, and maximize those benefits already in 2013. See you in New York City! Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday. Submit your speaking proposal for the upcoming Cloud Expo in New York City Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . Copyright? 1994-2013 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2019051117_00294801_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Michael Regan": ["Q21062491", "Q21459008", "Q58249666"]}, "date": "2019-05-11", "url": "http://scores.nbcsports.msnbc.com/en-xl/europe/europe-sport/neymar-scores-on-final-psg-game-before-ban/ar-AABdP4I?li=BBJGC65", "content": "Portals Navigation Outlook.com Skype Microsoft Store Facebook Twitter Office OneDrive Receive your emails here See your recent emails Send a quick email Manage your calendar with easy access Sign in with any Microsoft account: Outlook, Hotmail, MSN, Live What is a Microsoft account? SIGN IN Create Now Sign In Microsoft Store OFFICE 365 - Buy & Download directly from Microsoft UPGRADE TO WINDOWS 10 - Big savings on a huge selection of products Surface Windows Support Facebook Check News Feed See notifications View messages Confirm friend requests Get your Twitter Updates Sign In See your recent documents, or start one for free with Office Online. Sign in Sign in to your Microsoft account to see recent OneDrive contents. Sign in TRENDING TODAY Curtea De Arges / 17 ° C Change Close Set Default Location Search Display Temperature In Fahrenheit Celsius Done Make MSN my home page AFRICA ASIA AUSTRALASIA EUROPE LATIN AMERICA MIDDLE EAST NORTH AMERICA powered by Microsoft News Latest Stories TRENDING Polish far-right supporters protest Reuters Dramatic moment eagle seizes lamb Sky News Royal mothers with their children Photos Top Stories Putin falls on ice after hockey game Mirror Biggest Roman coins' hoard found Sky News Belarus on tainted oil's damages Reuters Seven everyday items that could be making you sick Daily Mail More news Crime kingpin Krejcir is \"suffering' Saturday Star Malta rescues 85 from sinking boat Reuters Sporadic clashes in French protest AFP Celebrities who died broke StarsInsider Best duos of the 2019 Met Gala Wonderwall Celebrity babies of 2019 Photos Celeb Buzz Hailey's heartfelt post for Bieber BANG Showbiz Priyanka's role at Sophie's wedding Cover Media <mark>Will Smith</mark> feels trapped by fame Cover Media Royal watch Archie's edge over other royal babies Mirror Kate & Meghan's royal milestones PopSugar Winnie the Pooh visits baby Archie US Weekly Most read in Europe Ancient\" Sphinx room' found The Independent Comedian found dead at home The Guardian Clooney on royal baby name snub Bang Showbiz Coffee-brewing an art in this Mexican city National Geographic FEATURES The family networks behind the Sri Lanka bombings BBC News Trump's Ukraine interest puzzles Kiev The Washington Post Botswana comes to the party! NewsDay MOST READ ON MSN Ronaldo speaks on Messi, Barca loss Goal.com Fake heiress jailed for 4-12 years Associated Press \"Fatherhood gave me new goal' The Telegraph Take a break Pool vs Billiards: The difference Mental Floss News in pictures Photos Video: Bad joke turns into crash BuzzVideos Sport Bottas claims Spanish GP pole Reuters Juve coach denies exit rumours AFP Herrera confirms Man U departure 90min Greatest frontmen in rock and roll history Purple Clover Travel Limits on visiting Machu Picchu AFP Travel troubles that are worth it Espresso Best budget hotels in Budapest The Independent Tallest, longest, deepest, largest things around the world Photos Health & fitness How to eat to get six-pack abs US News & World Report - Health The yoga pose to sleep in 5 minutes Well + Good Want to get happy? Exercise Houston Chronicle 30 foods you should never eat after age 30 Eat This, Not That! WEDDINGS Iconic movie wedding dresses Wonderwall How to calm pre-wedding jitters? PopSugar Guide to wedding guest dressing Evening Standard Tech & Science Most downloaded app on planet CBS News 2,624 years old tree found BGR Boeing shows off parachute test CNET Previous Slide Next Slide Ex-Nigerian football star shot dead by armed robbers Legit Beckhams pay $50M for full control of brand business The Guardian Security guard killed as gunmen storm Pakistan hotel Dawn Man charged in long-running Hollywood murder mystery Sky News In public for the first time: Celebrity couple debuts Photos Alvin Sargent, Spider-Man screenwriter, dies at 92 The Hollywood Reporter Indian party activist held over see-through dress meme AFP Penguin and seal poop gives life to Antarctica USA TODAY Islamic State claims\" province' in India Reuters Afghan official says female journalist shot dead in capital Associated Press Meet history's most unsinkable woman Ozy $1m allegedly hidden in car's fuel tank ABC News Europe Edit Remove Section Move Section Up Move Section Down Add Section Below Up to 70 drown after boat capsizes off Tunisia Associated Press Latvian athlete joins Olympians snared by doping retests AFP Poland's president to meet Trump at White House in June Associated Press Italian ferry towed to Croatia after problems in Adriatic Associated Press Giuliani urges Ukraine to investigate Democrats Associated Press UN begins hearing case of Ukraine sailors held by Russia Associated Press Serbia holds military parade amid tensions with Kosovo Associated Press Voters to pick successor of Lithuania's popular \"Iron Lady' Associated Press World Edit Remove Section Move Section Up Move Section Down Add Section Below Eyeing Iran, US sending more Patriot missiles to Middle East Reuters US to transfer $1.5 B to border wall Reuters Iran's lake Urmia revival continues Iran Daily Moderate quake hits Iran's west Associated Press World 5.3 magnitude quake strikes Iraq Armed trainees at Kenya MRC camp PIA losses have surged to Rs416B Sri Lanka blasts: IT worker held DCI: Kenya judges, drug lords collude UK holidaymakers cancel SL trips 3 held for raping teen in B'desh SL probes British bride's death Fiji stabbing victim NZ businessman Radio New Zealand Life Edit Remove Section Move Section Up Move Section Down Add Section Below Hailey's heartfelt post for Bieber BANG Showbiz Spider-Man screenwriter dies The Hollywood Reporter <mark>Will Smith</mark> feels trapped by fame Cover Media Britney Spears makes court appearance over conservatorship ETOnline Winnie the Pooh visits baby Archie US Weekly Life Jessie J laughs off misspelled tattoo Rihanna to launch her own luxury fashion brand Zendaya stuns on new Vogue cover Craig working on Bond 25 script Things to discuss before having kids One stretch everyone for desk job Royals' mental health initiative Seven incredible natural wonders Sport Edit Remove Section Move Section Up Move Section Down Add Section Below Juventus coach Allegri denies exit rumours AFP Neymar scores on final PSG game before ban AFP Bottas claims Spanish GP pole Reuters Herrera confirms Man U departure 90min Sport Klopp tells players to channel\" Rocky' Pochettino wants \"clear' Spurs plan Halep reaches Madrid Open final AFL star's surprise visit to old team Weber-led Chiefs edge Sharks Pogba's agent banned by FIFA MI take on CSK in IPL final Lucas still stunned by CL heroics Wanyama a doubt for Everton clash Goal.com Features Edit Remove Section Move Section Up Move Section Down Add Section Below The family networks behind the Sri Lanka bombings BBC News Sports pictures of the week Photos Tiger win electrifies PGA move, but <mark>will</mark> it boost golf? AFP The last surviving member of the first expedition to summit Everest National Geographic Video Edit Remove Section Move Section Up Move Section Down Add Section Below Paddle boarder has incredible encounter with blue whale Newsflare Downhill mountain biking fail BuzzVideos Meerkats fascinated by gorilla fight, try to get involved Rumble Bodybuilder falls attempting squat while lifting Dailymotion Trio of fox pups drag GoPro into their den Rumble Red van drives down the street upside down Dailymotion Alligator caught at front door attempting to ring doorbell BuzzVideos Little girl annoyed at virtual assistant Dailymotion Gorillas take cover from downpour Reuters Baby lies on top of guitar while dad strums Dailymotion Chipmunks hurdle race in toy running wheel Dailymotion Tiger has a fun day playing with water hose Rumble 66-year-old man shows impressive trampoline tricks BuzzVideos This tapir\" smiling' in slow motion is hilarious Newsflare Man films impressive dust devil in desert BuzzVideos Hulk statue withstands storm while Spiderman, Captain America get crashed Newsflare Photos Edit Remove Section Move Section Up Move Section Down Add Section Below In public for the first time: Celebrity couple debuts Photos 30 foods you should never eat after age 30 Eat This, Not That! Tallest, longest, deepest, largest things around the world Photos Greatest frontmen in rock and roll history Purple Clover Royal moms with their children Photos Celebs who changed names for fame Purple Clover 30 amazing parenting tips all moms should know Best Life Travel troubles that are worth it Espresso Best of Disney animated films Wonderwall Most famous baby births in history 24/7 Tempo Sport: Soccer> Championships: 5x UEF...\"src =\" http: //static-global-s-msn-com.akamaized.net/hp-neu/sc/9b/e151e5.gif \"title =\" 5. Cristiano Ronaldo - <mark>Michael Regan</mark> / Getty Images \"> Most successful athletes of the century 24/7 Tempo These stars hate taking selfies with their fans StarsInsider Prince Charles with sons William and Harry through the years Photos The most colorful destinations in the world Espresso Clever ways to instantly add value to your home Best Life Best duos of the 2019 Met Gala Wonderwall Click here for more"}, {"articleID": "2011081900_00024462_W", "names": {"Simon Evans": ["Q16040243", "Q16842808", "Q57015109", "Q7518705"], "Li Na": ["Q180446", "Q264230", "Q2722542", "Q436411", "Q45600304", "Q45640690", "Q460060", "Q707760"], "Svetlana Kuznetsova": ["Q192064", "Q21063641", "Q3978501", "Q4245117"]}, "date": "2011-08-19", "url": "http://au.sports.yahoo.com/news/article/-/10070265/grand-slam-winners-go-out-as-sharapova-advances/", "content": "grand slam winners go out as sharapova advances <mark>simon evans</mark>, reuters august 19, 2011, 9:31 am mason, ohio, aug 18 (reuters) - grand slam title holders <mark>li na</mark> and petra kvitova were knocked out of the cincinnati open on thursday while russia's maria sharapova and vera zvonareva moved into the quarter-finals. australia's samantha stosur defeated french open winner <mark>li</mark> for the second successive week with a 6-4 3-6 6-4 win to set up a last eight showdown with sharapova. stosur is hitting some good form in the run up to the u.s. open, where she reached the quarter-finals last year. the 10th seeded australian was runner-up in toronto last week and with the field wide open in cincinnati has a real chance at her third career wta title. \"it would be the biggest title i've ever won,\" stosur told reporters. \"it would be fantastic but there is still a fair way to go before that can happen.\" i guess making the final last week gives me good confidence going into this week. \"wimbledon champion kvitova fell to emerging german andrea petkovic, ranked 11th in the world, who enjoyed a 6-3 6-3 win in front of a smattering of fans on an outside court. at the same time, on centre court, sharapova was making quick work of her compatriot <mark>svetlana kuznetsova</mark> in a 6-2 6-3 victory.\" i felt really good considering i was playing a pretty tough opponent, \"said sharapova.\" we've had really tough matches in the past, usually three setters. so it was quite nice to get that win in two. \"she's someone who has a tremendous amount of experience and is a really solid player, always dangerous.\" world number two zvonareva crunched croatian qualifier petra martic 6-2 6-2."}, {"articleID": "2014111016_00036156_W", "names": {"Adam Clayton": ["Q175907", "Q2700669"], "Curt Smith": ["Q1916105", "Q5195431", "Q5195432", "Q924035"]}, "date": "2014-11-10", "url": "http://www.ocregister.com/articles/new-641474-kroq-album.html", "content": "News Many school buses still don't have seat belts Business Alternative mortgages making a comeback News Review finds parole agents swamped with sex offender caseloads News Whatever happened to driver's ed in high schools? U2, Linkin Park top Almost Acoustic Christmas lineup Wrong-way driver on freeway off-ramp arrested on suspicion of DUI Musicians The Edge, Bono, Larry Mullen Jr., and <mark>Adam Clayton</mark> of U2 perform onstage during the Oscars at the Dolby Theatre on March 2. 25th annual KROQ Almost Acoustic Christmas When: Dec. 13-14 Where: The Forum, 3900 W. Manchester Blvd., Inglewood Ticketmaster.com. It's that time again, boys and girls. Southern California's premiere rock station, KROQ/106 .7 FM, has revealed the lineup for its coveted annual two-day holiday fest, set for Dec. 13 and 14 and held for the first time at the newly revamped Forum in Inglewood. Since it is the 25th anniversary of Almost Acoustic Christmas, the station has mixed things up with old reliables, throwback performances and new favorites. KROQ mainstays Linkin Park, which released its sixth studio album, \"The Hunting Party,\" this year, will undoubtedly top the bill Saturday along with Rise Against, which also issued a new record, \"The Black Market,\" in July, Incubus, Fall Out Boy, System of a Down, Walk the Moon, Royal Blood and KROQ fest darlings, New Politics. U2, one of the biggest rock bands in the world, which shoved its new album, \"Songs of Innocence,\" down the throats of iTunes users this year, will top the bill Sunday along with Weezer, Imagine Dragons, Interpol, Modest Mouse, Smashing Pumpkins, Vance Joy, Alt J and Tears for Fears. Yes, Tears for Fears. That shouldn't be too shocking of a revelation, however, since Tears for Fears bassist-vocalist <mark>Curt Smith</mark> came out to sing \"Everybody Wants to Rule the World\" with Portugal. The Man at AAC last year at the Shrine Auditorium. Though Foo Fighters, with their new album, \"Sonic Highways,\" out this week, would have seemed an obvious headliner for one of the two dates, Dave Grohl & Co. will be in South Africa, making even a surprise appearance not feasible, so let's hold out for that at Weenie Roast 2015. Tickets go on sale at noon Friday for KROQ street team members at Join the conversation Comments are encouraged, but you must follow our"}, {"articleID": "2010072717_00156442_W", "names": {"Carlos Arroyo": ["Q2299855", "Q562471"]}, "date": "2010-07-27", "url": "http://totalprosports.com/2010/07/27/carlos-arroyo-slaps-opposing-player-video/", "content": "what did the five fingers say to the face? miami heat guard <mark>carlos arroyo</mark> asked and then answered that for an opposing player sunday in puerto rico's matchup against mexico in the central american and caribbean games. that right there is the \"i'd really rather haul off and deck you but i don't want to get in big trouble so i'll just slap you instead.\" it's too bad all the players stepped into the middle of their little fight. i could have watched those two scrappy point guards slap each other all day long. slapping is hilarious, especially when it's 2 grown men doing it to each other. the only thing more fun to watch would be check out these stories from around the web speak your mind tell us what you're thinking ..."}, {"articleID": "2016083021_00756611_W", "names": {"Jennifer Lee": ["Q16196127", "Q16957577", "Q24713009", "Q57905542", "Q5929198"]}, "date": "2016-08-30", "url": "http://komonews.com/news/business/us-consumer-confidence-in-august-highest-in-11-months", "content": "US consumer confidence in August highest in 11 months by MARTIN CRUTSINGER, AP Economics Writer AA WASHINGTON (AP)--U.S. consumer confidence rose in August to its highest level in 11 months, suggesting economic growth could pick up in the second half of the year. The Conference Board said Tuesday that its consumer confidence index rose to 101.1, up from 96.7 in July. It was the highest level for confidence since the index hit 102.6 last September. The gain reflected consumers' brighter views about current the economic situation and their expectations for the future. The percentage of those surveyed who saw business conditions as \"good\" increased from 27.3 percent to 30 percent. Those who viewed business conditions as \"bad\" remained virtually unchanged at 18.4 percent. Consumers who regarded jobs as \"plentiful\" increased from 23 percent to 26 percent, although those who felt jobs were \"hard to get\" also rose slightly from 22.1 percent to 23.4 percent. Economists said that the climb in confidence reflected stronger job gains seen in recent months, as well as strength in the stock market and home prices, which boost consumers' net worth. They expect the momentum in jobs to boost incomes and spur stronger consumer spending. That should help growth accelerate in the second half of this year, after four quarters of an anemic average growth rate of 1.2 percent. Many analysts believe gross domestic product will top 3 percent in the current quarter. \"Growth will be supported by consumer confidence and job growth,\" <mark>Jennifer Lee</mark>, senior economist at BMO Capital Markets, said in reaction to the consumer confidence report. The government will release the August jobs report on Friday. Many economists are looking for a gain of around 180,000 jobs. close"}, {"articleID": "2019111019_00048955_W", "names": {"Joe Gomez": ["Q17505113", "Q6210068"], "David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"], "Mike Riley": ["Q562522", "Q6848575", "Q6848576"], "Kevin De Bruyne": ["Q357984", "Q52835665"], "James Milner": ["Q191136", "Q57324227"]}, "date": "2019-11-10", "url": "https://www.manchestereveningnews.co.uk/sport/football/man-city-vs-liverpool-highlights-17219303", "content": "Sport Liverpool vs Man City LIVE highlights and reaction Fabinho, Salah and Mane pile misery on Guardiola amid handball controversy Live reaction from a costly Premier League defeat for Manchester City against Liverpool FC at Anfield. Share By Stuart Brennan <mark>Joe</mark> Bray Tyrone Marshall Updated 19:07, 10 NOV 2019 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Manchester City have been dealt a huge blow in their challenge to retain the Premier League title after a disappointing 3-1 defeat to Liverpool. City went into the game six points behind Liverpool in the title race, and that gap has now been extended to nine after goals from Fabinho, Mo Salah and Sadio Mane secured the result. Bernardo Silva scored City's consolation. City welcomed back Rodri to the starting XI and <mark>David Silva</mark> to the bench, but Ederson was out with injury. Benjamin Mendy was omitted from the matchday squad for tactical reasons. Liverpool took the lead through Fabinho, but City felt they should have been given a penalty at the other end for handball. Mo Salah's header shortly after made matters worse. Sadio Mane sealed the win after the break with a back-post header, before Bernardo Silva's late consolation for City. Follow below for post-match reaction from Anfield. Key Events All the reaction from Liverpool 3-1 City 18:56 Player Ratings 18:32 Bernardo gets one back 18:07 Mane makes it three 17:40 Salah scores 16:43 KEY EVENT All the reaction from Liverpool 3-1 City 19:07 Guardiola's verdict on the title race Guardiola has been speaking about City's title prospects after today's setback. He said: We showed many times. We have three teams in front who have more chances to be champions but we are going to try. I am so proud to see my team play in this stadium against this team. Can you win the league: I don't know. I'm not a magician. 19:03 Klopp's verdict on Liverpool's win Jurgen Klopp tells BBC Sport his side had to be perfect today to beat City: \"They were good. Oh they were good and we had to defend with all we had but we scored incredible goals.\" It was so tough to play, the intensity of the game was so clear. It was all worth it, really great. They pass the ball from outside, Sterling. How good did we defend him until then? Because you saw what happens when we don't defend him anymore. \"The boys were completely focused and concentrated. It was so good. It is the only way we can beat City, maybe other teams can do it a different way but this is the only way we can beat them.\" 18:57 Guardiola explains Mendy absence Guardiola tells Sky Sports Benjamin Mendy did not play for fitness reasons. He said: Mendy was two years injured and trained one game after the [Atalanta] game. Angelino showed quality and played a good game. 18:55 REPORT: What went wrong? 18:51 Guardiola: We showed why we are champions Pep Guardiola has praised his team at full time. He told Sky Sports: What happened today we show why we are champions. I'm so proud of my team more than ever. They are the strongest team in Europe and the way we played made me so proud. On the VAR decisions: Ask the referees. Ask the referees, please don't ask me. Ask <mark>Mike Riley</mark> and the guys on VAR. We try to do our job. Why City lost: I am the first to congratulate Liverpool. At the end, the boxes, it is similar like the Champions League. That's part of the game. We lost because they scored three goals and we scored one. We need to grow and play away on big stages. The last 10/15 mins of the first half we played so good. The performance was so good. We tried. We never give up. That's why we won back-to-back. We want to fight to the end. We drop points for our fault. It is what it is. Important to grow as a team, a club, a opposition. 18:44 Alexander-Arnold defends penalty decision The man at the centre of the VAR controversy surprisingly says it was not a penalty. 18:42 Standards slipping? 18:39 Guardiola's full-time reaction 18:32 KEY EVENT Player Ratings Read Stuart Brennan's player ratings on a disappointing afternoon at Anfield. FT - LFC 3-1 MCFC There's the whistle Full time. City slip to nine points behind Liverpool and remain fourth. (Image: PA) 90' - LFC 3-1 MCFC Four minutes added And City need two goals. 90' - LFC 3-1 MCFC Handbags It looks like <mark>Joe Gomez</mark> was brought on to cause trouble. Here, he gives away a foul against Raheem Sterling and then squares up to the City man to waste a bit of time. From the free kick, Gabriel Jesus heads over. (Image: PA) 86' - LFC 3-1 MCFC Final Liverpool substitute <mark>Joe Gomez</mark> is on for Mo Salah. 85' - LFC 3-1 MCFC Walker heads over Better from City, they build a move that ends in Kyle Walker heading an Angelino cross well over. 82' - LFC 3-1 MCFC Double penalty shout Raheem Sterling wants handball for a shot, before Gabriel Jesus is brought down as he races Alisson for the loose ball. Probably nothing in either call. 80' - LFC 3-1 MCFC So close! Raheem Sterling opts to square it in a great position but it's just behind Jesus. Missed opportunity. 78' - LFC 3-1 MCFC Firmino replaced Alex Oxlade-Chamberlain is on for Roberto Firmino. Jurgen Klopp is furious. He wanted that change made before City scored. 77' - LFC 3-1 MCFC KEY EVENT Bernardo gets one back About time! Bernardo scores as he converts Angelino's cut-back with slight help from a deflection. 76' - LFC 3-0 MCFC Nothing is working In the last couple of minutes, John Stones has driven pass well out of play, then <mark>Kevin de Bruyne</mark> completely overhits an attempted ball to Bernardo. Pep Guardiola looks exasperated. 71' - LFC 3-0 MCFC Heads have gone City are plugging away but their heads have gone. <mark>De Bruyne</mark> looks fed up with his team's performance, throwing his arms in the air when Stones' pass could only find Mane instead of the Belgian. Gundogan's attempted through ball to Sterling then was too heavy, but they still blamed each other for the lapse. 69' - LFC 3-0 MCFC Finally a City substitute Sergio Aguero is hooked for Gabriel Jesus. It's not been working in attack for a while, so this change is about 15 minutes too late. (Image: PA) 67' - LFC 3-0 MCFC Nearly a goal for Aguero How does Aguero not get a touch on this? <mark>Kevin de Bruyne</mark> is out on the left and his ball across the box is perfect for Aguero but the striker somehow misses the ball completely. (Image: PA) 65' - LFC 3-0 MCFC Sterling wants a penalty Raheem Sterling looks to be pushed over by Sadio Mane in the box and wants a penalty but the referee says no. Rodri gets a booking for protesting the decision. VAR back up the referee. 63' - LFC 3-0 MCFC City look beaten City just can't clear their lines, and every ball away is finding a Liverpool shirt. 60' - LFC 3-0 MCFC <mark>Milner</mark> comes on Jordan Henderson comes off, with former City man <mark>James Milner</mark> on to replace him. 60' - LFC 3-0 MCFC WATCH: Mane scores City's third Make your mind up who was at fault. Or was it just a brilliant cross from Henderson? 55' - LFC 3-0 MCFC Who's to blame for the third goal? 53' - LFC 3-0 MCFC So close! Raheem Sterling skips across the edge of the area, but the shot is deflected just over. 50' - LFC 3-0 MCFC KEY EVENT Mane makes it three Hammer blow. Sadio Mane squeezes in a header at the back post after good work from Jordan Henderson on the right. More On Liverpool FC Manchester City FC"}, {"articleID": "2019092113_00208842_W", "names": {"Michael Atkinson": ["Q4072107", "Q56100159", "Q56878045", "Q6828294", "Q6828295"], "Chris Murphy": ["Q1077594", "Q20022484", "Q2964809", "Q5107535", "Q5107536", "Q5107538", "Q56379834"]}, "date": "2019-09-21", "url": "https://www.wkbn.com/news/national-world/trump-says-he-had-perfectly-fine-call-with-ukraine-leader/", "content": "Trump says he had \"perfectly fine' call with Ukraine leader Trump is defending himself against the intelligence official's complaint, asserting that it comes from a\" partisan whistleblower' by: By JONATHAN LEMIRE, <mark>MICHAEL</mark> BALSAMO and LISA MASCARO, Associated Press Posted: Sep 21, 2019 / 09:48 AM EDT / Updated: Sep 21, 2019 / 09:48 AM EDT WASHINGTON (AP)--President Donald Trump urged the new leader of Ukraine this summer to investigate the son of former Vice President Joe Biden, a person familiar with the matter said. Democrats condemned what they saw as a clear effort to damage a political rival, now at the center of an explosive whistleblower complaint against Trump. It was the latest revelation in an escalating controversy that has created a showdown between congressional Democrats and the Trump administration, which has refused to turn over the formal complaint by a national security official or even describe its contents. Trump is defending himself against the intelligence official's complaint, asserting that it comes from a \"partisan whistleblower,\" though the president also says he doesn't know who had made it. The complaint was based on a series of events, one of which was a July 25 call between Trump and Ukrainian President Volodymyr Zelenskiy, according to a two people familiar with the matter. The people were not authorized to discuss the issue by name and were granted anonymity. In a tweet Saturday, Trump referred to \"a perfectly fine and routine conversation I had\" with Ukraine's leader. \"Nothing was said that was in any way wrong.\" Trump, in that call, urged Zelenskiy to probe the activities of potential Democratic rival Biden's son Hunter, who worked for a Ukrainian gas company, according to one of the people, who was briefed on the call. Trump did not raise the issue of U.S. aid to Ukraine, indicating there was not an explicit quid pro quo, according to the person. In an interview with Ukrainian outlet Hromadske that was published Friday evening, Ukrainian Foreign Minister Vadym Prystaiko said his country was not interested in taking sides in U.S. politics, but that Zelenskiy had the right to keep the contents of his conversation with Trump secret. \"I know what the conversation was about and I do not think there was any pressure\" from Trump, Prystaiko was quoted as saying. \"There was a conversation, different conversation, leaders have the right to discuss any existing issues. This was a long and friendly conversation that touched on a lot of issues, sometimes requiring serious answers.\" Biden said that if the reports are true, \"then there is truly no bottom to President Trump's willingness to abuse his power and abase our country.\" He said Trump should release the transcript of his July phone conversation with Zelenskiy \"so that the American people can judge for themselves.\" The U.S. government's intelligence inspector general has described the whistleblower's Aug. 12 complaint as \"serious\" and \"urgent.\" Trump dismissed it all Friday, insisting \"it's nothing.\" He scolded reporters for asking about it and said it was \"just another political hack job.\" \"I have conversations with many leaders. It's always appropriate. Always appropriate,\" Trump said. \"At the highest level always appropriate. And anything I do, I fight for this country.\" Trump was asked whether he knew if the whistleblower's complaint centered on the July 25 call with Zelenskiy. \"I really don't know,\" Trump said. When questioned whether he had brought up Biden in the call, Trump said, \"It doesn't matter what I discussed.\" But then Trump urged the media \"to look into\" Biden's background with Ukraine. There has yet to be any evidence of any wrongdoing by Biden or his son regarding Ukraine. Trump and Zelenskiy plan to meet on the sidelines of the U.N. General Assembly this coming week. The Wall Street Journal first reported that Trump pressed Zelenskiy about Biden. The standoff with Congress raises fresh questions about the extent to which Trump's appointees are protecting the Republican president from oversight and, specifically, whether his new acting director of national intelligence, Joseph Maguire, is working with the Justice Department to shield the president. Democrats say the administration is legally required to give Congress access to the whistleblower's complaint, and Rep. Adam Schiff of California has said he will go to court in an effort to get it if necessary. The intelligence community's inspector general said the matter involves the \"most significant\" responsibilities of intelligence leadership. House Democrats also are fighting the administration for access to witnesses and documents in impeachment probes. In the whistleblower case, lawmakers are looking into whether Trump lawyer Rudy Giuliani traveled to Ukraine to pressure the government to aid Trump's reelection effort by investigating the activities of Biden's son. During an interview Thursday on CNN, Giuliani was asked whether he had asked Ukraine to look into Biden. He initially said, \"No, actually I didn't,\" but seconds later he said, \"Of course I did.\" Giuliani has spent months trying to drum up potentially damaging evidence about Biden's ties to Ukraine. He told CNN that Trump was unaware of his actions. \"I did what I did on my own,\" he said. \"I told him about it afterward. Still later, Giuliani tweeted,\" A President telling a Pres-elect of a well known corrupt country he better investigate corruption that affects US is doing his job. \"Democrats have contended that Trump, in the aftermath of special counsel Robert Mueller's Russia investigation, may have asked for foreign assistance in his upcoming reelection bid. Trump further stoked those concerns earlier this year in an interview when he suggested he would be open to receiving foreign help. The inspector general appeared before the House Intelligence Committee behind closed doors Thursday but declined, under administration orders, to reveal to members the substance of the complaint. Schiff said Trump's attack on the whistleblower was disturbing and raised concerns that it would have a chilling effect on other potential exposers of wrongdoing. He also said it was\" deeply disturbing \"that the White House appeared to know more about the complaint than its intended recipient--Congress. The information\" deserves a thorough investigation, \"Schiff said.\" Come hell or high water, that's what we're going to do. \"Among the materials, Democrats have sought is a transcript of Trump's July 25 call with Zelenskiy. The call took place one day after Mueller's faltering testimony to Congress effectively ended the threat his probe posed to the White House. A readout of the call released from the Ukrainian government said Trump believed Kyiv could complete corruptions investigations that have hampered relations between the two nations but did not get into specifics. Sen. <mark>Chris Murphy</mark> of Connecticut, who in May called for a probe of Giuliani's effort in Ukraine, said in an interview on Friday it's\" outrageous \"the president has been sending his political operative to talk to Ukraine's new president. <mark>Murphy</mark> tweeted that during his own visit it was clear to him that Ukraine officials were\" worried about the consequences of ignoring Giuliani's demands. \"The senator tweeted that he told Zelenskiy during their August visit it was\" best to ignore requests from Trump's campaign operatives. He agreed. \"Letters to Congress from the inspector general make clear that Maguire consulted with the Justice Department in deciding not to transmit the complaint to Congress in a further departure from standard procedure. It's unclear whether the White House was also involved, Schiff said. Maguire has refused to discuss details of the whistleblower complaint, but he has been subpoenaed by the House committee and is expected to testify publicly next Thursday. Maguire and the inspector general, <mark>Michael Atkinson</mark>, also are expected next week at the Senate Intelligence Committee. <mark>Atkinson</mark> wrote in letters that Schiff released that he and Maguire had hit an\" impasse \"over the acting director's decision not to share the complaint with Congress. <mark>Atkinson</mark> said he was told by the legal counsel for the intelligence director that the complaint did not actually meet the definition of an\" urgent concern. \"And he said the Justice Department said it did not fall under the director's jurisdiction because it did not involve an intelligence professional. <mark>Atkinson</mark> said he disagreed with that Justice Department view. The complaint\" not only falls under DNI's jurisdiction, \"<mark>Atkinson</mark> wrote,\" but relates to one of the most significant and important of DNI's responsibilities to the American people. \"___ Associated Press writers Deb Riechmann, Eric Tucker, Alan Fram and Mary Clare Jalonick in Washington, D.C., and Matthew Bodner in Moscow contributed to this report. Related Content"}]