[{"date": "2015-08-20", "url": "http://www.msn.com/en-us/money/technologyinvesting/this-guy-turned-his-failure-on-shark-tank-into-a-dollar28-million-investment-from-richard-branson/ar-BBlScJ9?srcref=rss", "content": "10 States Where Taxes Are Going Up 19 longest-reigning CEOs & copy; Provided by Business Insider Inc IMG_7289. JPG Ring In September 2013, Jamie Siminoff went on ABC's \"Shark Tank\" in hopes of raising $700,000 for his company, DoorBot. He thought it was worth $7 million. His company made a video doorbell that connected to your smartphone, so you could remotely see and talk to the person at the door through your mobile device. The idea was largely based on the fact that burglars tend to ring the bell before breaking in. With DoorBot, you could see who's at the door, and even pretend you're at home when you're not, making it a convenient home security device. Siminoff was already making about $1 million in annual sales then, and he had high hopes of getting one of the \"sharks\" in as investors of his company. But the sharks weren't impressed. One by one, the sharks dropped out, leaving only Kevin O’Leary, also known as \"<mark>Mr. Wonderful</mark>,\" as the last potential investor. O’Leary's offer wasn't too enticing: he'd offer a $700,000 loan, then take 10% of all sales until the loan was paid off. After that, O'Leary wanted to collect a 7% royalty on all future sales, forever, plus 5% stake of the company's equity. Siminoff rejected the offer and walked away with nothing. \"It's that moment when I say you're dead to me, because you don't want to take my offer,\" <mark>Mr. Wonderful</mark> told him. You can watch Siminoff's appearance on \"Shark Tank\" below (it starts at 2:03): Youtube Embed: The most important thing that's ever happened to the business Going on \"Shark Tank\" doesn't guarantee you airtime. Siminoff says when you leave the set, the producers simply tell you, \"Someone will call you .\" \"It's like you literally have no way of contacting anyone when you leave that set that day,\" Siminoff told Business Insider. \"We were like,\" Ah, s--t.' So we just had to block it out as if it just never happened because that was a possibility. We were pretty significantly disappointed by not being able to raise money on the show. \"But DoorBot still had a pretty solid business and was growing fast. It had $250,000 in sales in the month before going on\" Shark Tank, \"all online. And after two months, Siminoff was able to raise $700,000 at a $7 million valuation (the exact amount he had offered the sharks). And a week after raising, he also received a call from the\" Shark Tank \"producers .\" It's going to air, \"they told him. The episode featuring Siminoff ended up airing in November 2013. And as soon as the show aired, DoorBot took off like crazy .\" We think we got at least $5 million of additional sales through the airing of \"Shark Tank,\" ' Siminoff said. \"It just absolutely throttled our revenue, awareness in the market from every level. Everything just popped after that .\" \"It was probably the most important thing that's ever happened to the business,\" he continued. \"It's almost like it gave us a free check .\" Richard Branson's call As the company grew, Siminoff wanted to create a more serious image, and so he changed the name of the company to Ring. His company's credibility went up too, and soon he was able to get into some of the world's top retailers, including Home Depot, Target, and BesetBuy. Now Ring's products are sold in 93 countries worldwide. Its wider reach also led to what Siminoff describes as a \"lucky break\" with one very prominent investor: Richard Branson, the founder of Virgin Group with a net worth of $4.8 billion. & copy; Provided by Business Insider Inc RBransonRing Siminoff says a Ring customer happened to be vacationing at Branson's island a couple months ago. He used Ring to talk to a UPS delivery guy who was at his home in San Francisco. Branson, who happened to be next to that person, saw the interaction and was immediately hooked by the product. In fact, Branson liked it so much, he asked for Siminoff's email address and soon started talking business with Siminoff. He wanted to invest in the product. \"I didn't even figure he'd invest,\" Siminoff said, who at the time was just about to close a Series B round. \"But then he was like,\" What if I send someone right now?' And then I got on with a couple of his guys from his team of investment the next day. \"In less than 48 hours, Branson agreed to join the round. And on Wednesday, Ring made it official: a $28 million funding that gives it a $60 million valuation. Other investors include: Shea Ventures, American Family Insurance, True Ventures, and multiple angels, including Sky Dayton .\" [Branson's team] was actually really careful with their due diligence. Probably more than any other investor we had, \"Siminoff said. Looking back, Siminoff says it's still hard to believe everything unfolded the way it has .\" It's like beyond surreal. I still can't believe it. \"But it also makes him feel pretty good about his business, especially after getting turned down in a public manner by some of the top celebrity investors .\" I think it's a little bit of redemption that I'll take a slight smile on, \"he said .\" But I got to get back to focus, get back to work now. \"NOW WATCH: All the incredibly useful things you didn't know your iPhone headphones could do Go to MSN Home Go to MSN Money Join the conversation Report inappropriate content Sorry! There was a problem. Please try again. Help us maintain a healthy and vibrant community by reporting any illegal or inappropriate behavior that violates Microsoft's Code of Conduct. Select a category Spam Child pornography or exploitation Profanity, vulgarity or obscenity Copyright infringement Harassment or threat Threats of suicide Other Who posted the inappropriate comment (Required) Please write a brief description (Optional) submit Leave your comment More in Money 8 great stocks to own when you retire Kiplinger 10 Things You're Paying Too Much For GoBankingRates 10 states to live in if you want low utility bills Depending on which state you live in, your monthly energy costs can vary widely. The Street The 25 Worst-Paying Cities for High School Teachers Teaching can often be a thankless job. In these 25 cities, high school teachers receive even less financial appreciation than their peers. FindTheBest.com 22 college majors with the highest starting salaries Payscale, the creator of the world's largest compensation database, recently looked at the starting pay for millions of professionals and sorted the results by college major. Here are the top 22. Business Insider How to live off $500 a month at Costco Stretch your budget with groceries from Costco. Cheapism More from Tech Insider Drone on a leash is the affordable flying camera you've been waiting for For most people, the average drone camera is overly complicated. Remote controls, apps, landing gear--it all sounds great until the drone makes a beeline into the nearest tree and the app controller suddenly isn't as precise as you'd like ....Tech Insider The 15 best apps for curing your forgetfulness <p> We all forget things. And sometimes it seems that the technology meant to make our lives easier just gives us more things to forget. </ p> Tech Insider Uber hired a convicted murderer who applied with a fake name, complaint claims *** ImagePlaceholder *** http: //static1.techinsider.io/image/55d5153edd0895f1048b4636-603-452/screen-shot-2013-09-25-at-11.20.39-am.png American Psycho screengrab Thanks to flaws in Uber's background checking system, 25 drivers with criminal records--including murder, child abuse, and assault--were allowed to drive for the car service app in San Francisco and Los Angeles, according a...Tech Insider Tech Insider View the full site", "articleID": "2015082006_00048169_W", "names": {"Mr. Wonderful": ["Q1388872", "Q190152"]}}, {"date": "2015-08-24", "url": "http://www.stuff.co.nz/taranaki-daily-news/news/71390094/Mayors-want-top-Kiwi-to-come-from-Taranaki", "content": "Mayors want top Kiwi to come from Taranaki HELEN HARVEY Last updated 16:10, August 24 2015 Sam Scannell South Taranaki mayor Ross Dunlop, left, New Plymouth district mayor Andrew Judd and Stratford district mayor Neil Volzke have joined together to encourage the region to vote for a Taranaki person to be New Zealander of the Year. Taranaki's mayors are pushing for the next New Zealander of the Year to be from their region. Mayors Andrew Judd, New Plymouth, Ross Dunlop, South Taranaki, and Stratford district's Neil Volzke, have challenged residents to make the 2016 New Zealander of the Year a Taranaki local. Previous winners of the New Zealander of the Year Award include Sir Stephen Tindall (2015), Dr <mark>Lance O'Sullivan</mark> (2014), Sir <mark>Richard Taylor</mark> (2012) and Sir Ray Avery (2010). Taranaki has had few mentions in those other big awards, the Queen's biannual honours, in recent years, receiving just three in 2014. With 2.4 per cent of the population and approximately 350 honours handed out annually, on a per capita basis Taranaki could expect to receive about eight honours a year. This has been blamed on the region's rural heritage and an attitude of \"just getting on\" with things. The homegrown New Zealander of the Year is said to be the ultimate recognition of people's service to New Zealand. And the three mayors are out to find the winner in Taranaki. Mayors see ordinary people doing exceptional things in the community every day, Judd said. \"Whether it's the volunteer, high-achiever, or someone who went the extra mile to help others--these are real people displaying real acts of kindness. These people are the pillars of our community. They represent the best of us and make Taranaki a much better place to live in .\" There are plenty of people in Taranaki who would be deserving recipients of the New Zealander of the Year Award, he said. \"It's time we honoured their deeds by showing the rest of New Zealand just how proud we are of them .\" Any member of the public can nominate an individual or community organisation for an award. Nominations for the prestigious award, and supporting categories, opened last month and will close on the September 30. - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next News story: Taranaki Iwi Trust to finalise $70m settlement with Crown Taranaki Daily News Homepage", "articleID": "2015082417_00022238_W", "names": {"Lance O'Sullivan": ["Q16733903", "Q6483500"], "Richard Taylor": ["Q15052265", "Q19814900", "Q201470", "Q23073042", "Q334322", "Q54596833", "Q56553128", "Q630767", "Q712170", "Q7329401", "Q7329402", "Q7329404", "Q7329409"]}}, {"date": "2015-08-22", "url": "http://www.nationalreview.com/corner/422938/marco-rubio-addresses-anger-gop-electorate-jim-geraghty", "content": "Marco Rubio Addresses the Anger in the GOP Electorate by August 22, 2015 3:22 PM Jim Geraghty If you're Marco Rubio, and you've launched your campaign on a theme of sunny optimism and cheery confidence that America's best days are ahead of it, how do you adjust when the GOP electorate seems to be eagerly embracing the mad-as-hell-and-not- gonna -take-it-anymore style of <mark>Donald Trump</mark>? You take it head on. \"People are rightfully angry and upset,\" Rubio said to \"yeah!\" responses here at the Americans for Prosperity Defending the American Dream Summit in Columbus, Ohio. \"It's good to let that anger motivate us, but we can't let that anger define us,\" Rubio said. \"We're not an angry nation. We're a hopeful nation. What nation would you trade places with? Where would you rather be? This is still a great nation. But we're just not living up to our potential .\" Rubio began by focusing on how \"the economy is changing faster than ever before. The largest retailer in America, Amazon, doesn't own any stores. One of the biggest transportation companies in America, Uber, doesn't own any cars. Our policies are outdated. Big government and more regulation have never worked--and they're a disaster in the twenty-first century .\" Rubio spent a good portion talking about education reform, from the need for a refocus on vocational training, \"We need to give people the skills for the best-paying jobs...I promise you this: A welder makes a lot more money than a Greek philosopher. The market for Roman philosophers has tightened significantly in the past 2,000 years, and our students need to know that .\" \"We don't need a common core curriculum to push that through that,\" Rubio continued, asserting that the education reform had to be directed at the state and local level, with the federal government working \"at the margins. I'm for curriculum reform, at the local and state level .\" He explained Washington money always comes with Washington control. Rubio criticized the \"monopoly on higher education\" where colleges and universities are inflexible to students who need to work, raise children, or have other competing constraints on their time. \"Their message is,\" You need to change to fit in with us, we're not going to change to fit in with you. \"'\" Of course, we still need four-year colleges and universities. How else would we have college football? \"Rubio quipped .\" Although I think the welders could probably field a good team. \"Rubio also spent significant time discussing foreign policy and the threats facing America .\" The Chinese can hack into our computers--one in particular, \"he said as the audience chuckled. Rubio called Vladimir Putin\" a gangster in Moscow is trying to not just divide Europe but destroy NATO. \"He noted ISIS is not just in Iraq and Syria, but in Libya, where he predicted the group will\" springboard across the Mediterranean into Europe. \"And he included North Korea in his list of five major threats:\" We have--I don't use this world lightly--a lunatic in North Korea who possesses dozens of nuclear weapons and missiles that can reach the West Coast. \"", "articleID": "2015082417_00037097_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-08-27", "url": "http://new-magazine.co.uk/latestnews/view/72154/Tom-Jones-cheers-on-Paloma-Faith-at-intimate-gig/", "content": "<mark>Tom Jones</mark> cheers on Paloma Faith at intimate gig Posted: Thursday 27 Aug 2015 SIR <mark>TOM JONES</mark> proved there are no hard feelings between him and singer PALOMA FAITH over her new job on THE VOICE by supporting her at an intimate gig in London. The It's Not Unusual hitmaker publicly shamed BBC bosses on social media for telling him he was fired as a judge on the show only the day before they announced Faith and Boy George as replacements, despite <mark>Jones</mark> declaring an interest in returning for a fifth year. However, he proved there is no bad blood with the new coach on Wednesday night (27Aug15) by cheering Faith on at a small gig for 500 fans at The Savoy Hotel in London. Faith rattled through her hits and performed covers of Sinead O'Connor's hit single Nothing Compares 2 U, <mark>Etta James</mark>' At Last, and River Deep, Mountain High by Ike and Tina Turner. She says, \"Performing tonight was an incredible experience - from the intimate crowd to the beautiful venue. I love performing in my home city, and it's always great to be able to do something special for some of my biggest fans. It was great to be able to create a jazz club atmosphere and perform songs that I wouldn't normally, in relaxed surroundings .\" The gig was part of MasterCard's Priceless Surprises drive. Faith teamed up with MasterCard bosses earlier this year (15) to put on a concert for just two fans in an underground bank vault in London.", "articleID": "2015082714_00092860_W", "names": {"Etta James": ["Q182725", "Q52601548"], "Tom Jones": ["Q16091498", "Q16730416", "Q180850", "Q23303147", "Q23683528", "Q2439753", "Q7816364", "Q7816370", "Q927200"]}}, {"date": "2015-08-28", "url": "http://velonews.competitor.com/2015/08/news/dan-martin-to-join-etixx-quick-step-in-2016_383049?utm_medium=whats-hot", "content": "<mark>Dan Martin</mark> will hop over to the Etixx-Quick-Step squad for next season. Photo: Tim De Waele | TDWsport.com <mark>Dan Martin</mark> has signed a two-year contract with Etixx-Quick-Step that will begin next season, it was announced Friday. <mark>Martin</mark>, who has ridden professionally for the Slipstream franchise since he began his career in 2008, specializes in both one-day and stage races. The 29-year-old's <mark>Martin</mark>'s best grand tour result is a seventh place in the 2014 Vuelta a Espana. As of Friday morning, <mark>Martin</mark> was third in the current Vuelta. \"The arrival of <mark>Dan Martin</mark> is an important moment for the team,\" Etixx-Quick-Step CEO Patrick Lefevere said. \"He's a guy who was able in the past to win one-day races, but also stage races. He has also been a GC contender at grand tours during his career. He is now 29 years old, so he is at the peak of his career. He had an unlucky 2015 early season, but it is clear in his most recent performances, even at La Vuelta, that he has a lot of spirit .\" For the team this is also a key addition because <mark>Martin</mark> can be a presence in the Ardennes Classics, alongside young French rider Julian Alaphilippe. His contributions can be two-fold for Julian. Julian can learn a lot from a seasoned veteran like him. At the same time, <mark>Martin</mark> is a guy who has proven he can win at the Ardennes. So the peloton respects his presence as a contender, and this alleviates some pressure for Julian. This can be a bit of an Ardennes \"dynamic duo .' <mark>Martin</mark> is a complete rider who is able to perform well in stage races, one-day-races, and grand tours, and we are excited to see what he can do with an Etixx--Quick-Step jersey on his back for the next two years .\" <mark>Martin</mark>, who won the 2013 Liège - Bastogne-Li ège and the 2014 Giro di Lombardia, said he'd like to take his career to the \"next step .\" \"I'm really excited to join the team, which has been a point of reference in cycling for years,\" <mark>Martin</mark> said. \"I hope to be able to take the next step in my career with Etixx-Quick-Step. I would like to improve even more and establish consistency with my performances. I think I am entering an important moment of my career at my age. I feel I am stronger than ever, mentally and physically. Of course my season will be built around the Ardennes Classics, where I can join forces with Alaphilippe. I hope to teach him some things and help him to evolve as a rider, while playing protagonist when I have the opportunity .\" I also would like to do well in the stage races, and maybe try again once in a grand tour for a good classification. I think I have potential to be a factor in the grand tours, whether it be stage hunting or in the overall classification. I am motivated to add to my top career performances, while proudly wearing the team colors of Etixx-Quick-Step for the next two years. \"FILED UNDER: News / Road TAGS: <mark>Dan Martin</mark>", "articleID": "2015082817_00154353_W", "names": {"Dan Martin": ["Q27989223", "Q5213940", "Q5213941", "Q5213943", "Q523444"]}}, {"date": "2015-08-29", "url": "http://appeal-democrat.com/spotlight/entertainment/national/music/latin-music-academy-protests-trump-s-immigration-proposals/article_ba34692d-6197-5a61-b03c-862c233157df.html", "content": "WASHINGTON (AP)--Republican presidential candidate <mark>Donald Trump</mark> is drawing protests from another Latino organization--this time, one based in the music industry. The organization that runs the Latin Grammys and promotes the genre around the world, the Latin Recording Academy, says that \"<mark>Trump</mark> needs a respectful reminder\" of the \"countless contributions Latinos make to American culture .\" Subscription Required An online service is needed to view this article in its entirety. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 ALL ACCESS $162.00 for 365 days $81.00 for 180 days $40.50 for 90 days $13.50 for 30 days Print 7 days a week + e-Edition + Online. Rates are for Carrier Delivery only. Please contact our circulation department for Mail rates at (877) 741-1313. 2 TOTAL DIGITAL $144.00 for 365 days $72.00 for 180 days $36.00 for 90 days $12.00 for 30 days e-Edition + Online Current print subscribers 1 PRINT SUBSCRIBER ACCESS - TOTAL DIGITAL $1.50 for 30 days e-Edition + Online Current print subscribers! Active your total digital access for only $1.50 per month. Once your current print subscription expires, make sure to renew with the ALL ACCESS subscription. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now. You must login to view the full content on this page. Screen Name or Email Password Forgot? Login Screen Name or Email Now I remember! Need an account? Create one now. kAm% CF> A 92D G @ H65 E @ 56A @ CE 6G6CJ @? 6 =: G:? 8:? E96 &] $]: = = 682 = = J [6 =:>:? 2E6 3: CE9C:89 E 4: E: K6? D9: A 2? 5 3F: = 5 2 H2 = = @? E96? 2E: @? VD D @ FE96C? 3 @ C56C E @ DE @ A: = = 682 = 4C @ DD:? 8D]% 96 3: ==: @? 2: C6 3FD:? 6DD> 2? VD AC @ A @ D2=D 92G6 5C2H? AC @ E6DED 7C @> 5 @ K6? D @ 7 {2E:? @ 25G @ 424J 8C @ FAD] k^Am kAm {2E:? #64 @ C5:? 8 p4256> J! C6D:56? E 2? 5 rt ~ v23C:6 = p32C @ 2 yC] D2JD% CF> AVD Q56?:2 = @ 7 {2E:? @ 4 @? EC:3FE: @? D 2? 5 E96 5: G: D: @?: E H: = = 4C62E6 42?? @ E 36 E @ =6C2E65] Qk^Am & copy; 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Thank you for reading 5 free articles on our site. You can come back at the end of your 30-day period for another 5 free articles, or you can purchase a subscription at this time and continue to enjoy valuable local news and information. If you need help, please contact our office at 530 - 749-4700. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 ALL ACCESS $162.00 for 365 days $81.00 for 180 days $40.50 for 90 days $13.50 for 30 days Print 7 days a week + e-Edition + Online. Rates are for Carrier Delivery only. Please contact our circulation department for Mail rates at (877) 741-1313. 2 TOTAL DIGITAL $144.00 for 365 days $72.00 for 180 days $36.00 for 90 days $12.00 for 30 days e-Edition + Online Current print subscribers 1 PRINT SUBSCRIBER ACCESS - TOTAL DIGITAL $1.50 for 30 days e-Edition + Online Current print subscribers! Active your total digital access for only $1.50 per month. Once your current print subscription expires, make sure to renew with the ALL ACCESS subscription. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now.", "articleID": "2015082903_00031436_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-08-30", "url": "http://www.winnipegsun.com/2015/08/28/letters-august-30-2015", "content": "Winnipeg SunFriday, August 28, 2015 03:22 PM CDT | Updated: Sunday, August 30, 2015 08:24 AM CDT Prime Minister <mark>Stephen Harper</mark> takes part in a news conference at Rideau Hall after asking Governor General <mark>David Johnston</mark> to dissolve Parliament, beginning the longest federal election campaign in recent history on Sunday. (Blair Gable/REUTERS) Report an error Who Needs Change? After all the gains Canada has made under <mark>Stephen Harper</mark>, after being transformed into the most admired nation in the world, the fickle Canadian voters are going to treat the election like buying a new hat--\"time for a change\" , not to be better, not to be as good, but just change for change's sake. And when the daft opposition taxes and spends us into a hole, who will they blame? Not themselves! Smarten up, Canada. We are doing well--it's the world causing the trouble. <mark>Harper</mark> is watching our wallets and keeping the freebees under control. If you want change, buy a new hat! TIM DEVLIN \"Out with the old, in with the new\" doesn't always work when electing governments. RAISING TAXES Re: \"Make taxes an election issue,\" Editorial, Aug. 27. Canadians currently pay more in a variety of taxes than buying food or running their households. Thus, when we hear NDP Leader Smiling Tom Mulcair saying he will balance the federal budget by raising taxes on corporations, Canadians should be alarmed, as this would then be passed on to them. Whatever province that has experimented with socialism / NDP governments, escalating taxes on everything has resulted. Manitoba is currently discovering this. With polls today showing Canada may well end up with Prime Minister Mulcair, Canadians better ask themselves how much more in taxes they can afford when casting their votes. LARRY COMEAU We think most people would say they can't afford any more taxes. DUFFY MONEY It was party money that was used to repay the Duffy indebtedness not taxpayers' money. Party money use, for other than the party's' advancement through ads etc, might be of concern to those whom contributed to the party. Other than that, I can't see why all other Canadian citizens must be coerced into believing that Mr. <mark>Harper</mark> used taxpayers' money to repay Duffy's misuse of the actual taxpayer money. DAN DRINKALL Don't think anyone is suggesting the repayment came from taxpayer money. CBC NEEDS TO GO I find it amazing that people are mad at the Tory government for cutting the funding to the CBC. The amount of waste and overspending is unbelievable. If it was not sponsored by our government, it would have had to declare bankruptcy years ago. Come on Canada! Not everyone likes <mark>Stephen Harper</mark> (although I think he has done more for Canada than anyone else) but get off the Liberal crying towel. The CBC needs to go. DAVE MAGNUS It should be forced to operate like every other station--not through handouts. WHERE'S EUROPE? Re: \"Heroes tell of desperate battle with train terrorist,\" Aug. 24. Thankfully the three young American men on the train were there and that they were military trained, otherwise a disaster could easily have happened. Which begs the question: How many more of these jihadists are there around? Why is the European Union not doing anything about migrants entering the mainland? No one seems to know who these people are. These people should be returned from where they came from, otherwise it could be a problem a few years down the road. TONY ROSE BOLTON", "articleID": "2015083014_00057202_W", "names": {"David Johnston": ["Q16730377", "Q21066672", "Q28102004", "Q3018164", "Q41564", "Q43132128", "Q43394930", "Q5235710", "Q5235711", "Q5235712", "Q5235713", "Q5235714", "Q58338670"], "Stephen Harper": ["Q206", "Q7609425"]}}]