[{"date": "2015-09-06", "url": "http://kwch.com/news/politics-elections/huckabee-compares-clerk-jailing-to-slavery-ruling/35132106?ver=139", "content": "Home Huckabee compares clerk jailing to slavery ruling Republican candidates rally around <mark>Kim Davis</mark> since she drew national headlines By Tom LoBianco CNN Justin Sullivan/Getty Images WASHINGTON (CNN) - Former Arkansas Gov. Mike Huckabee compared Rowan County clerk <mark>Kim Davis</mark>' refusal to issue marriage licenses to same-sex couples to conscientious objections to slavery Sunday. More from KWCH.com Opinion: <mark>Kim Davis</mark> jailed over gay marriage? Asked if <mark>Davis</mark>, who was jailed last week for refusing to issue the licenses, should be forced to obey the Supreme Court ruling on marriage, Huckabee cited the landmark Dred Scott decision. \"You obey it if it's right,\" Huckabee said on ABC's \"This Week .\" \"So I go back to my question. Is slavery the law of the land? Should it have been the law of the land because Dred Scott said so? Was that a correct decision? Should the courts have been irrevocably followed on that? Should Lincoln have been put in jail? Because he ignored it .\" Many Republican candidates have rallied around <mark>Davis</mark> since she drew national headlines for refusing issue the licenses and asked her deputies not to comply with the high court ruling. After she was arrested, the first license was issued to a gay couple. \"Do we have a check and balance system? Do we have three equal branches or do we have one supreme branch, not just the Supreme Court? That's the fundamental question,\" Huckabee said. Democrats who supported same-sex marriage rights before the Supreme Court ruling weren't jailed, Huckabee said. \"Gavin Newsom in San Francisco as mayor performed same-sex weddings even though it was illegal. Did he ever get put in jail? He most certainly did not,\" he said. \"You have Barack Obama and <mark>Eric Holder</mark>, when he was Attorney General. They ignored the rulings of (the Defense of Marriage Act). Did they get put in jail for ignoring the law? They most certainly did not .\" Ohio Gov. John Kasich, who is running strong in New Hampshire polling, said he did not believe <mark>Davis</mark> should be jailed, but also said the ruling is the law. The bigger problem, he told ABC's \"This Week,\" is that fights are turning off younger generations to Christianity. \"We have a lot of young people who sit on the fence on an issue like this. And they also think about their, you know, their belief in God,\" Kasich said. \"And when we see these kind of battles going on I get a little bit afraid that it turns people off to the idea of faith in God, what it means to be a Christian .\" Copyright 2015 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2015090616_00100638_W", "names": {"Eric Holder": ["Q312644", "Q3591180"], "Kim Davis": ["Q17386180", "Q20924746", "Q6408552"]}}, {"date": "2015-09-07", "url": "http://newsinfo.inquirer.net/720111/communities-ready-to-open-their-doors-after-popes-refugee-appeal", "content": "Communities ready to open their doors after pope's refugee appeal Communities ready to open their doors after pope's refugee appeal SHARES: 07:47 AM September 8th, 2015 Recommended September 8th, 2015 07:47 AM Pope Francis. AP FILE PHOTO VATICAN CITY, Holy See--Campaigners have warmly welcomed Pope Francis's call for every Catholic parish in Europe to take in a refugee family to help ease the continent's unprecedented migrant crisis. Francis, giving the Angelus blessing in Saint Peter's Square on Sunday, urged \"every parish, every religious community, every monastery, every sanctuary in Europe\" to take in migrants in need. Some see the proposal as over-ambitious but many groups called it a useful blueprint that draws on the formidable organizing skills of the Catholic Church. ADVERTISEMENT \"There are tens of thousands of parishes in Europe,\" said Father Peter Balleis, international director of the Jesuit Refugee Service (JRS). \"And in each one, hundreds of families are able to organize and take turns welcoming refugees .\" According to the UN refugee agency, it takes about six to eight months to process an asylum application in Europe, sometimes longer if legal issues arise. During this time, many refugees are in desperate need of a place to stay. Increasing efforts The JRS has already been working with refugees looking for a temporary home, and plans to expand its efforts. Five years ago the group launched a program in the Paris area called \"Welcome,\" under which around a hundred families and religious communities house refugee families for five weeks. The program has been successful in helping migrants integrate and is now being rolled out to several other French cities, as well as to other countries, such as Spain. JRS says the five-week time limit is to encourage the refugees to be independent--without leaving any of the refugees on the street. \"After a while, you need the person to enter into the society\" of the host country, said Jean-Marie Carriere, regional director of the JRS. Other European communities have also already welcomed thousands of asylum seekers and are preparing for more. Cardinal Angelo Bagnasco, chairman of the Italian bishops' conference, told the country's La Repubblica daily there was evidence \"of an important movement in all dioceses .\" Italy's Catholic organizations have already taken in between 15,000 and 20,000 asylum seekers. In Austria too, dioceses have offered thousands of places for migrants to stay and several have announced plans to do more. Pannonhalma Abbey in northwest Hungary, which is run by the Benedictine Order, has also opened its doors to Syrian families trekking across the country to western Europe, and said it is prepared to repeat the experience. Carlotta Sami, spokesperson in Italy for the UN refugee agency, said that the pope's calls to action supported the agency's goals. \"The pope's voice has helped us for years to strongly support the welcome of those fleeing war and violence,\" she said. Opportunity for interreligious dialogue One detail the pope didn't mention in his appeal is that the majority of the 336,000 migrants who arrived this year on Europe's shores are Muslim. Father Balleis saw it as a chance for foreign and local families to \"get to know and understand\" one another. The Catholic Church isn't the only church appealing for greater solidarity. The archbishop of the Finnish Lutheran Church, <mark>Kari Mäkinen</mark>, called Saturday for the country's parishes to open up their centers for retreats and summer activities to refugees. There has also been an outpouring of solidarity from groups with no religious affiliation, in Germany and elsewhere. In France, the Singa foundation said it had received more than 1,000 offers of accommodation in just a few days, and in the UK more than 2,000 residents have said they are ready to welcome refugees as well. RELATED STORIES", "articleID": "2015090800_00041926_W", "names": {"Kari Mäkinen": ["Q28789619", "Q5394527", "Q961480"]}}, {"date": "2015-09-08", "url": "http://wlox.com/story/29976956/us-israel-spat-over-iran-deal-may-sideline-palestinians", "content": "US-Israel spat over Iran deal may sideline Palestinians - WLOX.com - The News for South Mississippi US-Israel spat over Iran deal may sideline Palestinians - WLOX.com - The News for South Mississippi Member Center: Bounce US-Israel spat over Iran deal may sideline Palestinians (Menahem Kahana/Pool photo via AP). Israeli Prime Minister Benjamin Netanyahu chairs the weekly cabinet meeting at his office in Jerusalem, Sunday, Sept. 6, 2015. By DAN PERRY and JOSEF FEDERMANAssociated Press JERUSALEM (AP) - In recent months, many in the Middle East had assumed - some in hope, others with concern - that once the Iranian nuclear issue was resolved, the United States would make another push for peace between Israel and the Palestinians. But the opposite seems more likely. After a drawn-out confrontation with Prime Minister Benjamin Netanyahu over the Iranian nuclear deal, the White House seems to have little appetite for what would almost certainly be a new round of tensions with the Israeli leader over the terms of Palestinian statehood. With the odds of success slim and U.S. elections approaching, President Barack Obama seems more interested in repairing his tattered relationship with Israel, leaving the Palestinian issue to his successor. In recent comments, Obama has spoken of boosting security cooperation and providing upgraded military hardware to make up for Israeli misgivings over the nuclear deal. Speaking to the Jewish newspaper The Forward last week, he likened his differences with Israel to a disagreement inside a family and predicted relations would survive the test. \"I think it is important for everybody to just take a breath for a moment and recognize that people on both sides of the debate love the United States and also love Israel,\" Obama said. He made no mention of the Palestinian issue. A U.S. State Department official told The Associated Press that the U.S. is not planning any bold new diplomatic initiatives after the Iran deal makes its way through Congress. He spoke on condition of anonymity because he was not authorized to speak to the media. In Israel, there had been speculation that Obama might act otherwise. \"Now that President Barack Obama has got his Iran deal...he will likely also try, in the year and four months until the presidential elections, to turn his attention to other urgent regional issues, such as Syria, and the talks or lack thereof between Israel and the Palestinian Authority,\" Israeli commentator Avi Issacharoff wrote in the Times of Israel in July. The Palestinians have also said they have received vague assurances from the U.S. that they have not been forgotten. Several factors argue against another White House push to end Israel's half-century-old occupation of Palestinians. First is Obama's apparent eagerness to make amends after a period of startling acrimony symbolized by Netanyahu's controversial speech to Congress in March, when he railed against the emerging nuclear deal. Netanyahu has only stepped up his criticism since the deal was sealed in Vienna in July, having his ambassador to Washington lobby against the agreement in meetings with American lawmakers. Even after Obama secured the needed support in Congress to uphold the deal last week, Netanyahu vowed to continue fighting it. The U.S.-led deal gives Iran relief from economic sanctions in exchange for curbs on its nuclear program. Netanyahu, with widespread support among the Israeli public, believes Iran will use its newfound funds to promote violence in the region and says the deal will not prevent Iran from ultimately gaining the ability to produce nuclear bombs. Israeli media often depict Obama as naive or even hostile to the country. Netanyahu's conservative government, meanwhile, shows little patience for being cajoled into concessions. Netanyahu himself declared during Israel's election campaign in March that he would not allow a Palestinian state to be established on his watch, though he has since backtracked somewhat and said he is prepared to resume peace talks. The United States, for its part, is entering an election season in which Obama's Democratic Party can ill afford continued friction with Jewish Americans, a key base of support. And one factor may override all others: The problems dividing Israel and the Palestinians seem oddly resistant to negotiation and mediation, at least under current circumstances. Obama and his secretary of state, <mark>John Kerry</mark>, experienced this firsthand when they sponsored an ambitious round of talks that consumed much of their attention and collapsed in mid-2014 after nine months of quibbling and vexation. It might have come as no surprise. Intervention efforts by outside powers in the Middle East - whether attacks in Iraq or Afghanistan, Libya, Yemen or mediation efforts in Syria - have not fared well of late. But even compared to those quagmires, the century-old Israeli-Palestinian conflict may be truly a case apart. Two decades of on-again, off-again negotiations have strongly suggested the sides are genuinely unable to meet in the middle on a deal. The Palestinians seek all of the West Bank, east Jerusalem and the Gaza Strip - territories captured by Israel in the 1967 Mideast war - for an independent state. Many Israelis do seem to accept letting go of the Palestinians and allowing them have a state on most of the lands they seek. But many also insist on continued control of parts of the West Bank, citing security grounds or religious attachment to the territory. The idea of both countries sharing Jerusalem, and its sensitive holy sites, as a joint capital is a challenge, to say the least. And Israel has no intention of accepting the principle of a \"right of return\" of refugees who fled its territory in 1948 and their descendants, a combined designation that numbers in the millions. Creative efforts to get around the impasse have bedeviled negotiators and mediators for some two decades. Tellingly, opponents of Netanyahu can increasingly be heard yearning for outside pressure to move their fellow Israelis. This derives more from concern about the Palestinians than for them. The logic is that unless Israel finds a way to truly partition, its Jewish majority will be doomed by march of demography: Israel plus the West Bank and Gaza together have some 12 million people, equally divided between Jews and Arabs, with the Arab birthrate higher. It is ironic, many say, that Netanyahu's nationalists are the ones who are taking the Zionist project down this path. \"An honorable Israeli leadership, if there were one, would...find a solution to the Israeli-Palestinian conflict in partnership with the United States and Europe,\" said Shabtai Shavit, a former director of the Mossad intelligence service, addressing a counterterrorism conference on Monday. On the Palestinian side, the frustration is compounded by a sense that their moment may have passed as the world's attention moves on to the many other wars and crises across the Arab world. President <mark>Mahmoud Abbas</mark> has hinted in recent weeks at retiring or canceling the existing 1990s peace deals. Under those arrangements, he heads an autonomy government that governs parts of the West Bank and cooperates with Israel on security. Palestinian officials attribute the threats to a hope by <mark>Abbas</mark> that he can somehow spur the U.S. and international community into action. Indeed, Palestinian officials say U.S. Secretary of State <mark>John Kerry</mark> called <mark>Abbas</mark> over the weekend and promised to meet on the sidelines of the U.N. General Assembly at the end of the month. But skepticism abounds. \"There is no sign that the Americans will present anything new,\" said Nabil Shaath, a senior Palestinian official. \"They will keep saying that the only solution now is to make President <mark>Abbas</mark> (and) Netanyahu sit together. But we have been in this process for 22 years, and nothing has happened .\" Associated Press writer Aron Heller contributed to this report from Herzliya, Israel. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2015090806_00078709_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}}, {"date": "2015-09-09", "url": "http://willcoxrangenews.com/news/article_018a4a60-5682-11e5-af77-2b3ce6c756f9.html", "content": "Community Briefing - Arizona Range News: News Carol Broeder carol.broeder @ willcoxrangenews.com Third Annual Willcox Flyer Bike Ride Willcox's own Olympian, <mark>Mike Allen</mark>, led the family friendly eight-mile fun run during Saturday's \"Third Annual Willcox Flyer Bike Ride .\" <mark>Allen</mark> competed as part of the U.S. Olympic Road Cycling Team in the 1964 Olympics in Tokyo. Posted: Wednesday, September 9, 2015 12:00 pm Community Briefing 0 comments Willcox ADOC TRAINING EXERCISE: The Arizona Department of Corrections will be conducting training exercises in and around the community of Willcox using trailing hounds on Monday, Sept. 28 through Friday, Oct. 2. Trailing hounds and horses have been in use by the Department of Corrections for more than 20 years with great success. The trailing hounds are trained to detect human scent and provide a direction of travel for teams to follow. Trailing hounds are a vital resource to law enforcement used to trail and apprehend escapees and fugitives. They have also proven to be an invaluable resource to the community to locate lost and missing persons. As the training progresses you may see Arizona Department of Corrections Officers in the community using the trailing hounds for this training exercise. COWBOY HALL OF FAME TICKETS: Cowboy Hall Fame Dinner will be held Thursday, Oct. 1, 6--8 p.m. and is sponsored by the Willcox Chamber of Commerce & Agriculture. Tickets are $25 per person. Call the Chamber at 520-384-2272 or visiti 1500 N Circle I Rd.. Or visit Maid Rite Feeds, 225 S. Railroad Ave. for tickets. BOOTS \"N' BLING, the third annual fundraiser sponsored by Northern Cochise Community Hospital Foundation will be held Saturday, Sept. 12. Silent auction and no host bar begin at 6 p.m. and a prime rib dinner is at 7 p.m., followed by dancing. It will be held at the Elks Lodge, 247 E. Stewart St. For more information, call Kathy Cook, President at 520-384-3278 or Carol Dunagan at 520-374-4646 or Betty Thompson at 520-507-2576.", "articleID": "2015090919_00059872_W", "names": {"Mike Allen": ["Q3307988", "Q6845851", "Q6845854"]}}, {"date": "2015-09-10", "url": "http://www.mearnsleader.co.uk/council-pledges-to-help-refugees-1-3882053", "content": "Council pledges to help refugees Conservative MP's Members of project Maja visit the Syrian refugee camp Nizip Container camp just outside Gaziantep, Turkey, Friday, 10th January 2014. Picture by <mark>Andrew Parsons</mark> / i-Images 07:00 Thursday 10 September 2015 0 Have your say Aberdeenshire Council is committed to easing the plight of refugees seeking protection from persecution, its chief executive has said. Although the authority has so far not been directly involved in supporting those caught up in the humanitarian crisis, it is sympathetic and has been working with national Government to see how it can assist. Aberdeenshire Council Chief Executive Jim Savage It was recently represented at the UK Government's Refugee Summit by Cosla, the unbrella body for all Scottish councils. Although a small number of Syrian refugees have already been resettled in Scotland, councils are in discussions with the Home Office about accepting more. \"Over the last week, we have received a great deal of interest from members of our communities asking us what support we are able to provide, and how they can support the wider humanitarian crisis,\" said Aberdeenshire Council Chief Executive, Jim Savage. \"Officers from the council are speaking to colleagues in other agencies to consider a range of support including housing, education, and health. Our local response would involve working closely with our community planning partners, to ensure a co-ordinated response and provide all the necessary support for the refugees .\" The council Co-Leaders have indicated that the council is committed to playing its part in any government-led Syrian Resettlement Scheme. \"Scottish councils recognise the right of all people to seek protection from persecution and stand ready to play our part in alleviating this humanitarian crisis .\" We would urge any Aberdeenshire residents who wish to support the humanitarian crisis to do so through international charities like The British Red Cross which is experienced in international aid and crisis support. \"The scale of the crisis means local councils can only assist with the support of national governments at Holyrood and Westminster. Until more information is available from the UK Government on the numbers of refugees to be admitted to the country and how they will be distributed, Aberdeenshire Council will continue to monitor the situation and assist in any way it can.", "articleID": "2015091200_00053446_W", "names": {"Andrew Parsons": ["Q47537752", "Q4758215", "Q57427734"]}}, {"date": "2015-09-13", "url": "http://antiguaobserver.com/al-qaeda-chief-urges-lone-wolf-attacks-militant-unity/#respond", "content": "Latest: Baldwin Spencer to participate in meeting of OECS opposition leaders <a href = \"http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=addc1000 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src =\" http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=12 & cb=INSERT_RANDOM_NUMBER_HERE & n=addc1000' border =' 0' alt = \"/> </ a> <a href =\" http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a5e87b37 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src = \"http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=17 & cb=INSERT_RANDOM_NUMBER_HERE & n=a5e87b37' border =' 0' alt =\" /> </ a> Al Qaeda chief urges lone wolf attacks, militant unity September 13, 2015Reuters International No comments New Story A photo of Al Qaeda's new leader, Egyptian Ayman al-Zawahiri, is seen in this still image taken from a video released on September 12, 2011. Al Qaeda leader Ayman al-Zawahri called on young Muslim men in the United States and other Western countries to carry out attacks inside there and urged greater unity between militants. \"I call on all Muslims who can harm the countries of the crusader coalition not to hesitate. We must now focus on moving the war to the heart of the homes and cities of the crusader West and specifically America,\" he said in an audio recording posted online on Sunday, referring to nations making up the Western-led coalition in Iraq and Syria. He suggested Muslim youth in the West take the Tsarnaev and Kouachi brothers, who carried out the Boston marathon bombings and Charlie Hebdo shootings in Paris respectively, and others as examples to follow. It was not clear when the recording was made but references to former Taliban leader Mullah <mark>Mohamed Omar</mark> as being alive suggest it is at least two months old. <mark>Omar</mark>'s death was announced by Afghanistan's government in late July. Zawahri reiterated his position on Islamic State, repeating what he said in a recording posted on Wednesday--that he viewed the group's claim to be a caliphate as illegitimate but would join them in fighting Western and secular forces in Iraq and Syria. Former Egyptian doctor Zawahri urged unity between Islamist militant factions in Syria and Iraq, where a Western-led coalition is bombing Islamic State targets, but recognized it would he be difficult. He called for the formation of an independent sharia court to settle disputes.", "articleID": "2015091313_00001054_W", "names": {"Mohamed Omar": ["Q12240858", "Q130427"]}}, {"date": "2015-09-13", "url": "http://trentonian.com/sports/20150913/chip-kelly-wants-great-not-good-from-eagles", "content": "Philadelphia Eagles Chip Kelly wants great, not good from Eagles With Sam Bradford at the helm, hopes are high for Chip Kelly's Eagles as long as Bradford remains healthy. The Associated Press By Bob Grotz, bgrotz @ 21st-centurymedia.com, @ BobGrotz on Twitter Posted: The Eagles know they're good. Great, the goal of Chip Kelly's unconventional makeover is another thing. But it's safe to say the expectations at the starting gate are much like they were 11 years ago, when the Eagles went to the Super Bowl. Terrell Owens and Jevon Kearse helped put that 2004 team over the top. Byron Maxwell and Sam Braford are the new pieces the Eagles need to make this team special. \"I feel like we are a Super Bowl team,\" said Maxwell, who played in the last two NFL title games. \"Obviously you've got to put the work in. It's a long season. A lot of things can happen. But I definitely feel like we're in the mix. Most teams, they don't have a shot right away. We have a quarterback. And unless you have a quarterback, you can't win. So we've definitely got an opportunity .\" Advertisement Quarterback Bradford, acquired in a trade for Nick Foles, has shown glimpses of giving the Eagles a chance to be great. Bradford reads the game like a coach. He puts the ball in tight places as easily as some quarterbacks hand it off. He's also coming off back-to-back reconstructions of the ACL in his left knee. The Eagles acquired Bradford as is, which right now is healthy enough to play, but not so fit where each time he's driven into the ground you wonder if he's getting up. \"I just try to put that back in my mind and I haven't thought about it that much,\" said Bradford, sidelined all but seven games the past two seasons. \"I think more than any other season opener, I'm probably more excited than ever, just to get back on the field. It's something I've been waiting a long time for .\" If the Eagles keep Bradford healthy, Kelly's offense could become epic. The Eagles signed 220-pound running backs DeMarco Murray and <mark>Ryan Mathews</mark>, whose downhill style is a better fit for the Philly scheme than LeSean McCoy's north, south, east and west running. Third-down back Darren Sproles has been split out at receiver. With Kelly, the mismatches start at running back. North-south running backs and up-tempo equal misery for the opposition. \"I definitely think it's a positive,\" Murray said of the tempo. \"You don't get guys coming off the ball as hard. You get them in different looks. You get them confused. So I definitely think it's the upper hand for us. At the same time we've got to make sure we play with great tempo, great hand-eye coordination, all of the things that gives us an advantage. It's a lot of technique and being in great shape .\" Nelson Agholor was drafted in the first round to replace leading receiver Jeremy Maclin, who left in free agency. Jordan Matthews looks ready to take another big step and veteran Miles Austin is around if Michael Huff sputters. Tight end Zach Ertz still isn't all the way back from hernia surgery but veteran Brent Celek and Trey Burton are solid targets. The offensive line anchored by center Jason Kelce and tackles Jason Peters and Lane Johnson looks OK with Allen Barbre and <mark>Andrew Gardner</mark> stepping in as guards. The Eagles faded down the homestretch last season, losing three of their last four games and, despite 10 victories, failed to reach the playoffs. \"It's just unfinished business,\" Jordan Matthews said. \"We know we left a little bit on the table last year. We made a lot of changes. We've got a lot of hungry guys in this locker room. And I just love the focus. I mean you can tell when guys come in the building, there's a vibe, there's an electricity. Everybody's hungry and excited to be here but there's also a focus. Everybody knows that we've got to take care of business .\" The defense signed the ever-confident Maxwell, the top cornerback in free agency, to a six-year, $63 million contract. The signing of safety Walter Thurmond, another player with Seahawks pedigree, looks almost as helpful. Thurmond is a ball hawk who plays the angles and roams the back end like a knock-off of <mark>Ed Reed</mark>. Middle linebacker Kiko Alonso, acquired from Buffalo in the trade for McCoy, might not start the early portion of the season if veteran DeMeco Ryans is healthy. But Alonso and his legendary motor--\"That guy never gets tired,\" <mark>Brandon Graham</mark> said--will work in. Cornerback Nolan Carroll hopes to make Eagles fans forget that Bradley Fletcher started the past two years. The front seven is underrated with All-Pro Fletcher Cox, Pro Bowl linebacker Connor Barwin (14 1-2 sacks), <mark>Graham</mark> in a starting role and nose guard Bennie Logan. Kicker Cody Parkey says he's healthy after a groin injury and so are the special teams, which scored seven touchdowns last season, including two punt returns by Sproles and one kickoff return by Huff. The chemistry, at least at this early spot, is off the charts entering the season opener Monday night in Atlanta against the underdog Falcons. It's Chip Kelly's team. \"It's his team. It's our team, too,\" <mark>Graham</mark> said. \"He made the choices. We've just got to believe in it and I feel everybody believes that he made the right choices. Everything is coming together, man. I'm just excited, just like everybody else, just to see how everything comes together this weekend. I really feel like, man, we're going to get it done. People know that we're going to come to work. You're going to have some bad days, but we've got a lot of guys around here that are going to get you going and aren't scared to criticize you. And we've got a lot of people who can take it, too .\" It wasn't that way in Kelly's first two seasons when a personality here or a personality there seemed bigger than the team. And it hasn't been like that for, well, 11 years or so.", "articleID": "2015091317_00024352_W", "names": {"Andrew Gardner": ["Q2846608", "Q46997879"], "Brandon Graham": ["Q16215795", "Q3643702"]}}]