[{"articleID": "2012083114_00082196_W", "names": {"Ross Taylor": ["Q19325418", "Q26820844", "Q7369657", "Q7369663"]}, "date": "2012-08-31", "url": "http://zeenews.india.com/sports/cricket/india-vs-new-zealand-2012/we-ll-look-to-score-450-and-take-early-wickets-guptill_748235.html", "content": "bangalore: new zealand will look to score around 450 runs in their first innings tomorrow and pick a few early wickets to put the hosts under pressure in the second and final cricket test, opener martin guptill said today. after scoring 328 for six on day one of the second test match at chinnaswamy stadium here, guptill said his team would now look to exploit the conditions as the wicket had swing and seam on it. \"the contest from here on would be interesting if my team put 400-450 on the board and pick a few wickets early on because there is a bit of swing and seam on this wicket. if we do that it will be great,\" he told reporters at stumps here. guptill said the wicket looked good and hoped the team would be able to continue the positive way of play next morning. \"the wicket was a little flat and our positive intent paid off well,\" he added. guptill said the team came out with a positive frame of mind of attacking the indian bowlers. \"<mark>ross</mark> (<mark>taylor</mark>) showed some excellent footwork,\" he added. guptill said new zealand had always played positive cricket and luckily the plan worked out for the team which alleviated some of the pressure off the team. \"we got enough boundaries initially that took load of us,\" he said. asked if being aggressive cost them too many wickets, guptill said: \"you are going to give chances when you play positive. we got away with it sometimes and not on other occasions. that\" s the way cricket goes. on whether indian bowling was below par as compared to hyderabad test, guptill said the hosts are a good bowling side, but the bad balls which they bowled were punished and it put pressure on them. guptill said it was all about properly executing a shot against the spinners as each player scores differently. \"sometime you opt to go straight, ariel and may not get it right. that happens in cricket. franklin didn't get it in the middle. he got a leading edge. it's quite different for each player,\" he said. \"each player scores differently. i think they should go for the shots and they would continue to do well .\" guptill was a bit disappointed for not converting his starts, but said he is trying to make sure that doesn't happen in the next few test matches. \"it is a little bit frustrating but that is the way it goes. sometimes you go on to make a big score and sometimes you go only half way there,\" he added. guptill also praised his captain <mark>ross taylor</mark> for scoring a brisk 113 and said he is a class player and his presence in the middle makes things a lot easier for the next batsmen. \"it takes a bit of pressure off them,\" he said."}, {"articleID": "2018120619_00458250_W", "names": {"Sean Mcgrath": ["Q2849939", "Q56596974", "Q59560929", "Q7441236", "Q7459565"]}, "date": "2018-12-06", "url": "https://www.marketwatch.com/story/the-next-big-risk-to-your-security-is-your-kids-video-game-habit-2018-12-06", "content": "Be careful who you play with. Online gaming is a growing target for hackers, a new report from identity theft protection firm Experian EXPN, -2.12% found. Cyber criminals are increasingly posing as gamers to gain access to the computers and personal data of players, its 2019 Data Breach Industry Forecast predicted. \"We are not trying to imply all gamers are hackers, but they do live in an anonymous environment, have good computer skills, and are in an industry with billions in revenue,\" Michael Bruemmer, vice president of data breach resolution at Experian said. \"There is a unique opportunity for them to be able to profit .\" The gaming industry is worth more than $4 billion in annual revenue, according to industry analysis firm IBISWorld. Cyber criminals can easily pose as a gamer or take over an avatar to infiltrate games and communities, stealing personal and credit-card information and valuable game pieces and tokens, the report said. (The Entertainment Software Association, a trade group for video games, did not immediately respond to request for comment .) This puts responsibility on parents to educate their children about online security risks, said <mark>Sean McGrath</mark>, cybersecurity advocate at security service comparison site BestVPN.com. \"The old adage,\" Don't speak to strangers' can't really be applied in the online gaming world, but perhaps we can still aim for \"don't thoughtlessly trust strangers',\" he said. \"The old adage,\" Don't speak to strangers' can't really be applied in the online gaming world .'--<mark>Sean McGrath</mark>, cybersecurity advocate at security service comparison site BestVPN.com Others are less concerned. Hacking in the gaming world is a risk, said Chris Morales, head of security analytics at San Jose, Calif. cybersecurity solutions firm Vectra, but it's well-known and largely controlled. Hacking in the gaming world has \"occurred as long as online gaming has existed,\" he said. \"Gaming has always been an arena for hacking and attacks,\" he said. \"In the early days that meant cracking software licenses to play games for free. Today, in the highly competitive and financially lucrative gaming world, that means bypassing developer controls to gain a competitive advantage or to impose disruption on other players .\" Still, new sophisticated threats raise additional cause for concern, said Darrell Laffoon, chief technology officer of security firms EZShield and IdentityForce. In the past a hacker may take over a player's account to gain points, but today gaming consoles can be used as a gateway to access the person's entire device, whether desktop or mobile, and hack banking information and other accounts. Today gaming consoles can be used as a gateway to access the person's entire device, whether desktop or mobile, and hack banking information and other accounts. \"Games today are very social in nature,\" he said. \"Even if you are playing a single-player game, you are connected, and your information is a valuable resource to the cyber criminal .\" To lower the risk of hacking, gamers should use a password manager for all accounts, he said, and implement two-factor authentication where it is offered. Most major gaming apps, including Nintendo NTDOY, -1.46%, PlayStation SNE, -0.58%, Epic Games, Runescape, and Steam allow two-factor authentication. Be sure to only download gaming apps from trusted vendors to avoid installing malware on your computer, he said. Users should also avoid sharing information publicly even with online friends they think they know. \"Anything that is personally identifiable or non-public should not be shared,\" Laffoon said. \"Your date of birth and where you live can be used against you .\" Get a daily roundup of the top reads in personal finance delivered to your inbox. Subscribe to MarketWatch's free Personal Finance Daily newsletter. Sign up here. Also see: Did your doctor ask for your Social Security number? Think twice before saying yes Google's algorithms are keeping us in a political bubble, study finds FCC will vote next week to combat text-message spam and increase fines Kari Paul Kari Paul is a personal finance reporter based in New York. You can follow her on Twitter @ kari_paul. We Want to Hear from You Join the conversation Comment"}, {"articleID": "2014011518_00008899_W", "names": {"Ken Smith": ["Q10496058", "Q11301324", "Q18631625", "Q3814512", "Q55589856", "Q6388510", "Q6388511", "Q6388514", "Q6388515", "Q6388516", "Q6388517"]}, "date": "2014-01-15", "url": "http://livingstondaily.com/article/20140115/NEWS01/301150012/Benefit-aid-grieving-family", "content": "Babies gone, but not forgotten Members of a club they never wished to become part of say they're speaking out for the benefit of...A former movie house and almost a restaurant, the Howell Theater building is now for sale. A speech like the annual State of the State address can be a political smorgasbord. Blame the liberals, not Rogers John Hargenrader says, \"Let's assume the Affordable Care Act provides absolutely horrible results'...The start was eerily like the last time the Howell girls basketball team played in the Brighton...Howell rallies past Brighton in basketball; Fowlerville wins second straight Trailing by 13 at one point in the second half, Howell's boys basketball team rallied, scoring 19...No, those weren't UFOs monitoring downtown Howell on Sunday. Amy Poehler made out with Bono, Tina Fey mocked George Clooney's taste in women and Matt Damon...Lights in the night: Sky-lantern launch today at church in Howell <mark>Ken Smith</mark> did everything he could when his best friend and roommate dropped to the floor in their Gregory home. Albert Kendrick died Jan. 1 of a heart attack at age 45 .\" Nobody saw it coming, \"said <mark>Smith</mark>, who met Kendrick years ago through mutual friends .\" If there were any signs, he didn't tell us. \"Kendrick, who worked in construction for more than 20 years, suffered from fused vertebrae and had spinal issues that had left him without the ability to work for more than six years, according to <mark>Smith</mark>. His wife, Barbara, works in adult foster care to support their three children, 7, 10 and 14, but he said the family is struggling .\" He had a pretty hard life, \"said <mark>Smith</mark>, who shares a home with the Kendricks to help offset their costs. His fondest memories of Kendrick are their fishing trips and Kid Rock concert excursions, as well as his\" dry \"sense of humor .\" He was a hell of a good friend, and he loved his kids to death, \"<mark>Smith</mark> said .\" They're taking it real hard. \"To help the family before disability benefits are transferred, a <mark>Smith</mark> has planned a fundraiser Sunday at The Alley, 2830 Baker Road in Dexter. From 3-6 p.m., all-you-can-eat sloppy joes will be served, and attendees can participate in a 50/50 raffle. Prizes include a large tattoo from Inkwell Tattoos in Brighton and a spa package. The suggested donation to attend is $10 per plate. <mark>Smith</mark>, who himself is disabled from working in construction, said he's considering taking up employment to help the family .\" I don't want their bills to get behind, \"he said .\" The kids need clothes for school. \"Those who wish to provide additional monetary support can donate through Chelsea State Bank in Dexter under Barbara Kendrick's name. <mark>Ken Smith</mark> did everything he could when his best friend and roommate dropped to the floor in their Gregory home. Michigan House Envy: Mansion has waterfall, indoor pool, stalls for horses"}, {"articleID": "2016080913_00988745_W", "names": {"Andrew Franks": ["Q21066709", "Q48537534"]}, "date": "2016-08-09", "url": "http://www.lincolnshireecho.co.uk/fifty-home-development-planned-for-lincolnshire-village/story-29600468-detail/story.html", "content": "An extra 50 homes could be built at Irelands Field in Heckington if plans are given the go ahead Fifty home development planned for Lincolnshire village X Share Tweet Share Pin It Email Copy link to paste in your message / An extra 50 homes could be built at Irelands Field in Heckington if plans are given the go ahead Could temperatures top 30 degrees in Lincolnshire next week? 1 East West Link Road to open to traffic 1 Grieving mum told to remove graveside gifts due to...1 Comments (0) The village of Heckington is about to get bigger if plans for an extra 50 homes are given the go ahead. Plans have been submitted for the development at Irelands Field, Heckington - between Boston Road and Cobham close - to North Kesteven District Council. Permission for a different development of 50 homes at the site was granted in 2014 and this application, which has also been earmarked for approval, would bring the total up to 100 homes on the site. READ MORE: \"We care about them deeply' - donkey owner hits back at attacks The properties will be accessed from Boston Road and a pond and trees in an area of open space are also included in the application. The application also states 35 per cent of the development should be so-called affordable housing .\" Heckington is an area of identified housing need, \"a council report states .\" The affordable housing should be well integrated into the overall design of the development and not segregated or concentrated together, nor should it be visually or operationally distinguishable from the market housing in terms of details, build quality and materials. \"Twelve people have objected to the scheme, raising concerns about the impact on schools and doctors facilities, as well as expressing unease at noise, extra traffic and the impact the homes would have on the landscape of the village. And Lincolnshire County Council has said it has concerns about the impact the development. It said:\" This development would result in a direct impact on local schools. In this case just the secondary schools at Sleaford are projected, notwithstanding the proposed development, to be full in the future to the permanent capacity of the schools. \"A contribution is therefore requested to mitigate against the impact of the development at local level. The level of contribution sought in this case equates to & pound; 171,350 based on nine secondary places and one school-based sixth form places being required as a direct consequence of this development .\" However, business owners in the village have welcomed the plans - with many feeling it will bring more shoppers. Owner of Sylv's Coffee Shop and Cafe, Sylvia Matson, said she would like to see more cheap housing in Heckington. She said: \"We need more housing. There are not enough houses for everybody to go round and if some are affordable then I'm all for it .\" Kids coming through the system need somewhere to live, renting is really expensive and if there is affordable housing there then it's brilliant. \"The only concern would be whether the schools and doctors can cope .\" Owner of the Windmill Shop, <mark>Andrew Franks</mark>, agreed that it would be good to have more housing in the village. He said: \"It would be good for me as it would generate more footfall .\" The building wouldn't bother me. More houses would be good for trade. It's a sign of the times - we need more houses so people will build. \"A decision on the application will be made by the district council planning committee on August 16. Report this article"}, {"articleID": "2012051413_00070095_W", "names": {"Patrick Ryan": ["Q10346117", "Q7117326", "Q7143981", "Q7147572", "Q7147573", "Q7147574"], "Jim Mckenzie": ["Q1689153", "Q6196872"], "Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2012-05-14", "url": "http://sys-con.com/node/2276577", "content": "halifax, nova scotia--(marketwire)--05/14/12--ucore rare metals inc. (tsx venture: ucu) (otcqx: uuraf) (\"ucore\" or the \"company\" ) is pleased to announce the appointment of mr. <mark>patrick ryan</mark> to its board of directors, effective may 14, 2012. mr. <mark>ryan</mark> brings to ucore a broad range of experience and corporate leadership in industrial operations management, large scale manufacturing, and the supply side of the international automotive industry, facilitating significant long term supply contracts with automotive assembly concerns in north america, europe and the pacific rim. mr. <mark>ryan</mark> has a keen sense of global market supply stream logistics, routinely serving major automotive concerns including ford, general motors, toyota, nissan, hyundai and mercedes, among others. he is the founder of neocon international, an automotive oem design and lean manufacturing enterprise which he conceptualized in 1993 and continues to spearhead today. from the company's inception he has been the strategic architect responsible for raising capital, assembling and directing a team of r & d engineers, establishing niche product opportunities such as lighter weight and recyclable materials tapping into oem \"green\" initiatives, developing business plans for optimum market positioning, establishing efficient qa systems for complying with environmental and automotive process standards and procuring equipment and facilities to deliver to international markets. under mr. <mark>ryan</mark>'s leadership, neocon was acquired in 2002 by exco technologies, ltd., a publically traded tsx company. in recent years he has accepted awards on behalf of neocon as subaru's \"gold supplier\" of the year from 2008-2011, honda's \"outstanding supplier\" award in 2011, and nova scotia's top export award in 2008. he has been noted as \"inventor\" on numerous patents in north america and europe, working with notable industrial science firms such as dupont, exxon mobile and dow throughout his career. he is a p. eng, and recipient of the apens award from the atlantic provinces engineering society as the most likely to serve society in an ethical manner. \"we're very pleased to welcome mr. <mark>ryan</mark> to our board,\" said <mark>jim mckenzie</mark>, president and ceo of ucore. \"his background offers a unique blend of experience in large scale manufacturing, international trade, and strategic contracting in the transportation sector, a primary target of ucore's bokan product line. as our flagship heavy rare earth property at bokan matures, this background will be invaluable to assessing opportunities and negotiating relationships of greatest benefit to ucore shareholders .\" commensurate with his appointment, mr. <mark>ryan</mark> will be granted 250,000 stock options, subject to the approval of the tsx venture exchange. the options are exercisable at a price of $0.29 per share and will expire five years from may 14, 2012, the date of the grant. one third of the options will vest six months after the date of the grant, with an additional third to vest every six months thereafter until fully vested. about ucore rare metals inc. ucore rare metals inc. is a well-funded junior exploration company focused on establishing ree, uranium and other rare metal resources through exploration and property acquisition. with multiple projects across north america, ucore's primary focus is the 100% owned bokan - dotson ridge ree property in alaska. the bokan - dotson ridge ree project is located 60 km southwest of ketchikan, alaska and 140 km northwest of prince rupert, british columbia and has direct ocean access to the western seaboard and the pacific rim, a significant advantage in expediting mine production and limiting the capital costs associated with mine construction. the bokan properties are located in an area reserved for sustainable resource development with an existing road network providing access to the main target areas. ree mineralization at the bokan-dotson ridge project occurs in a well-demarcated vein system related to a mesozoic bokan peralkaline granitic complex. however, a number of other occurrences of ree mineralization are also located within, or at the margins of the complex. viewed in a geological and geophysical context, the bokan complex is a distinctive circular structure and is highly prospective for rare earths deposits. <mark>jim mckenzie</mark>, president and ceo this press release includes certain statements that may be deemed \"forward-looking statements\". all statements in this release, other than statements of historical facts, that address future exploration drilling, exploration activities and events or developments that the company expects, are forward looking statements. although the company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. factors that could cause actual results to differ materially from those in forward-looking statements include exploitation and exploration successes, continued availability of financing, and general economic, market or business conditions. neither tsx venture exchange nor its regulation services provider (as that term is defined in the policies of the tsx venture exchange) accepts responsibility for the adequacy or accuracy of this release. mr. <mark>jim mckenzie</mark> president and chief executive officer published may 14, 2012 copyright? 2012 sys-con media, inc. - all rights reserved. opening keynote | an enterprise cloud for business-critical applications day 2 keynote | the enterprise cloud tightrope - balancing for success enterprise cloud best practices - town hall - join the discussion? progressing toward the federated, automated and client-aware cloud identity driven security in the cloud cloud expo silicon valley: cto power panel cloud expo silicon valley: ceo power panel cloud expo silicon valley: cloud superstars panel dell & vmware deliver the enterprise hybrid cloud are financial services organizations risking security by avoiding cloud computing? from consolidation to enterprise private paas driving the transformation to next generation cloud data centers the inevitability of an open cloud war in the clouds: are you ready? cloud storage: myths and realities cloud expo new york: cto power panel cloud expo new york: ceo power panel cloud expo new york: cmo power panel is your business 100% ready for the new era of cloud computing and big data? the only enterprise it event in 2012 covering the entire scope of both cloud & big data come to new york and get yourself up to date with the big data revolution! as advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the cloud computing boom, cloud expo is the single most effective event for you to learn how to use you own enterprise data - processed in the cloud - most effectively to drive value for your business. there is little doubt that big data solutions will have an increasing role in the enterprise it mainstream over time. get a jump on that rapidly evolving trend at big data expo, which we are introducing in june at cloud expo new york. cloud expo was announced on february 24, 2007, the day the term \"cloud computing\" was coined. that same year, the first c loud expo t ook place in new york city with 450 delegates. next june, cloud expo is returning to new york with more than 10,000 delegates and over 600 sponsors and exhibitors. \"cloud\" has become synonymous with \"computing\" and \"software\" in two short years. cloud expo is the new pc expo, comdex, and internetworld of our decade. by 2012, more than 50,000 delegates per year will participate in cloud expo worldwide. the cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. but moving from theory into practice is where things get complicated, and this is where attending a top industry event like cloud expo comes in. no one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th international cloud conference & expo on june 11-14, 2012 - is to ensure - through an intensive four-day schedule of keynotes, general and breakout sessions, and our bustling expo floor - that attending delegates leave the javits center with abundant resources, ideas and examples they can apply immediately to leveraging the cloud, helping them to maximize performance, minimize cost and improve the scalability of their enterprise it endeavors. delegates will leave cloud expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. whether you're an enterprise or small to medium business, you'll soon be benefiting from the cloud. join your peers in new york city june 11-14, and maximize those benefits already in 2012. see you in new york city! register now! save $500 on your \"golden pass\" ! call 201.802.3020 or click here to register early bird expires friday. submit your speaking proposal for the upcoming cloud expo in new york city please call 201.802.3021 events (at) sys-con. com. <mark>carmen gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . copyright? 1994-2012 ulitzer, inc. all rights reserved. all marks are trademarks of ulitzer, inc. ."}, {"articleID": "2012052903_00047083_W", "names": {"Julie Smith": ["Q17489680", "Q18158041", "Q2083768", "Q3811121", "Q58317640", "Q6308521", "Q6308523"], "Keri Jones": ["Q6393873", "Q6393874"]}, "date": "2012-05-29", "url": "http://tiftongazette.com/local/x234172459/City-council-considers-establishing-citizens-academy", "content": "tifton - the tifton city council discussed offering a citizen's academy program to the community and having their own planning and zoning commission for the city, as well as voting on an employment package for city manager larry riner, at their recent workshop. councilwoman <mark>julie smith</mark> explained that the citizen's academy program is an outstanding program to move forward in tifton. \"it's a great way to get citizens involved and to develop leadership,\" she said. \"i really would like to move forward with this sooner than later. i think this would be great for our citizens .\" <mark>smith</mark> stated that citizens would be educated about city government and how they interact with the county and various organizations. \"it helps build educated citizens,\" she said. she stated that city department heads and the chamber would serve as the instructors. she mentioned that douglas has this program and is doing well with it. <mark>smith</mark> said the program will run for approximately eight weeks and then citizens would graduate. she would like to start the citizen's academy program in september in order to go ahead and graduate the first class of citizens. she noted that they would need sponsors for the program to provide light meals, etc. and also to fund the program. tifton mayor jamie cater told <mark>smith</mark> to contact douglas to gather information about the funding of the program. councilman chris parrott stated that he liked the idea of a citizen's academy and feels that they should offer it to the community; riner agreed. cater commented that the program should be dedicated to the late charles \"charlie\" henry howell, who served as city manager from 1996 to 2005. he told the gazette that it was howell's idea to start a program like this in tifton back when he was city manager. he said it was already in the plan but was never executed. cater said riner and <mark>smith</mark> had mentioned the program to the council, but they never got around to it. he said it means a lot to dedicate the program to howell. in other business, city attorney rob wilmot informed the council that over the past two months, he has worked with bert crowe, director of environmental management, on the land development code for the city, and they felt that the city should have their own planning and zoning amendment. wilmot stated that the amendment is designed to establish a planning and zoning for the city. he noted that the proposal calls for five members to serve on the board. he said aside from the city having its own planning and zoning commission, there are no changes. councilwoman marianna keesee asked if the proposal addresses a quorum as to how business will be conducted with a certain number of members. wilmot said that it should; he hadn't noticed it in the proposal but would look over it again. he also noted that the filling of positions for the board will be made by the council. also, after returning from executive session, the council voted on an employment package for riner's position as city manager. cater said all council members agreed with the package, which includes an annual salary of $137,500; $600 in car allowance; annual dues and conference expenses for state organizations; benefits; annual performance appraisal; and 12 months' severance pay if terminated without cause or return to position as director of operations. this agreement is renewed every year. cater noted that while serving as city manager, riner will also be filling four vacant positions - director of operations, street superintendent, public works director and director of water and sewage. \"he plans to continue those jobs,\" he stated. cater said the city does not have a contract with riner; he serves at the pleasure of the council from meeting to meeting on a day-to-day basis. other items discussed at the workshop:? city clerk rona martin discussed the board report. there still remain some vacancies. also, juanita taylor withdrew her application from the greater tift county planning and zoning commission, leaving that spot vacant. <mark>smith</mark> mentioned that <mark>keri jones</mark> has withdrew her application as well and pointed out that jan wise, who is interested in serving on the planning and zoning board, was willing to come to the workshop and would answer any questions. martin noted that there is a vacancy on the tifton tree board. parrott stated, \"we need more people to serve .\" ? riner addressed the downtown development authority board's recommendation to the council to decide if they want to accept ownership of the tift theatre. due to a question involving a conflict of interest, the council decided to discuss the matter later after wilmot researches the issue and looks into it more .? ricky hobby gave a report on the bid for a knuckle boom truck and loader for the sanitation department in the daily collection of residential yard debris. he informed the council that this unit is a replacement for unit #803, which is in need of extensive repairs, and that due to the age of the vehicle and loader, it is not feasible to make these repairs. hobby stated that the current unit is nine years old. he said the new unit will be purchased using funds from the solid waste capital replacement account. he stated that the lowest proposal offered that met specs was from consolidated disposal systems from smyrna. the amount was $116,686 .? also discussed were resolutions providing for the extension of senior garbage rates, alcoholic beverage license for citgo food mart on west seventh street and alcoholic beverage license for sam's grocery & grill on highway 41 north. to contact reporter latasha everson, call 382-4321."}, {"articleID": "2018091717_00241013_W", "names": {"Darren Lewis": ["Q5225019", "Q5225021"]}, "date": "2018-09-17", "url": "https://www.irishmirror.ie/sport/soccer/soccer-news/toby-alderweireld-kieran-trippier-left-13261727", "content": "Sport Toby Alderweireld and Kieran Trippier left out of Spurs squad for Inter Milan clash for \"technical reasons\" Both centre back Alderweireld and full-back Trippier have started all four of Spurs Premier League games so far this season Share By <mark>Darren Lewis</mark> 17:53, 17 SEP 2018 Updated 18:39, 17 SEP 2018 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe See our privacy notice Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email Mauricio Pochettino has taken a Champions League gamble by leaving Toby Alderweireld and Kieran Trippier out of his squad to face Inter Milan tonight. The Spurs boss maintained his move to axe his star defender and England's best player at the World Cup is a \"technical decision\" , not a punishment after defeat to Liverpool last Saturday. He said: \"It's a technical decision. You can look it up, find it in the dictionary. A technical decision .\" Tactical is on the pitch. Yeah maybe tactical is outside of the pitch too. But it's technical decision, tactical decision, it's a decision in the end. You cannot bring 25 players. You can only play 11 players with seven on the bench. That is the reason. \"(Image: REUTERS) Kieran Trippier will also not feature against Inter (Image: REUTERS) Hugo Lloris and Dele Alli are still out injured for Tottenham's opener but Pochettino added:\" I never punish players because you win and lose. The plan is to leave them and use different players. \"There's nothing behind it. Only that we will play with different players. We believe the best decision is to play with different players .\" But it has once more plunged the future of Alderweireld into doubt. Spurs fans have been hoping that the former Southampton and Atletico Madrid defender could be persuaded to commit his long-term future to the club after a summer in limbo. But now, with less than two years left on his current deal, Alderweireld could leave for just £ 25million during a two-week window next summer because of a clause in his contract. Mauricio Pochettino has revealed Spurs' team news (Image: AFP) The Belgian centre-back was frozen out of the Spurs team last season - only to play in six out of his country's seven games during the summer at the World Cup. He was priced out of a move to Manchester United where he would have been lining up against Young Boys tomorrow night but now finds himself out in the cold again. Pochettino insists Tottenham's supporters need not be worried about lining up against Inter - who return to the competition after a six-year absence - without two of his his key players. He added: \"Why would the fans be concerned? We win or we lose. Against Liverpool they play and we lose. The fans might be concerned because we didn't play Davinson Sanchez or Serge Aurier. It is wrong to think that way .\" After winning their first three Premier League games, Spurs have been beaten in their last two. Inter have won just one of their opening four games of the season. Like us on Facebook Follow us on Twitter Daily Newsletter irishmirrorsport Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe More On Internazionale Milano F.C. Premier League Champions League Tottenham Hotspur FC Toby Alderweireld Kieran Trippier UEFA Champions League Barclay's Premier League"}, {"articleID": "2019102806_00114860_W", "names": {"Matt Ryan": ["Q1751379", "Q1909267", "Q522373", "Q6789279", "Q984327"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"], "Chris Carson": ["Q21288666", "Q5106104"], "Andy Dalton": ["Q129605", "Q2849092"], "Jim Moore": ["Q16732815", "Q17378085", "Q22006996", "Q28444878"]}, "date": "2019-10-27", "url": "http://sports.mynorthwest.com/716023/seahawks-takeaways-tale-2-hawks-teams/", "content": "Stacy Rost Seahawks Takeaways: Win over Falcons tells tale of 2 Hawks teams Share By Stacy Rost October 27, 2019 at 11:26 pm Pete Carroll took blame for the Seahawks' second-half struggles in Sunday's win. (Getty) Seahawks coach Pete Carroll put it plainly Sunday afternoon. \"I didn't do a good enough job,\" he told reporters after Seattle held on for a 27-20 win over a struggling Atlanta Falcons team. \"I'm telling you. Obviously, they went out there and we looked like we were a totally different team .\" Seahawks 27, Falcons 20: Recap & photo gallery | Britt hurt The Falcons outscored the Seahawks 20-3 in the second half of their contest in Atlanta. After halftime, they outgained Seattle 346 to 82 in net yards and had 21 first downs compared to just three for the Seahawks. Quarterback Matt Schaub, who started for the first time since 2015 in place of an injured <mark>Matt Ryan</mark>, was 26 of 32 for 309 yards. Seahawks quarterback <mark>Russell Wilson</mark>--a leader in the league's MVP race--had just five pass attempts against an Atlanta defense that ranks near the bottom of the league against the pass. You'd hardly guess the Seahawks won by a touchdown. But they did, and they were able to keep the Falcons at bay and improve to 6-2 thanks to a stellar first half. Seattle pulled ahead 24-0 in what was a dominant performance on both sides of the ball. <mark>Wilson</mark> and the Seahawks' offense had 240 yards and converted on all three of their trips into the red zone. <mark>Wilson</mark> himself was 9 of 15 passing for two touchdown against a porous Falcons defense. Running back <mark>Chris Carson</mark> bulldozed through defenders for 86 yards and another touchdown. Cornerback Shaquill Griffin had two tackles and two passes defensed and the secondary held its own despite being short a starting corner (Tre Flowers). Linebacker Mychal Kendricks made his first interception as a Seahawk and pass rusher Jadeveon Clowney sacked Schaub in a play that also forced a fumble in the final seconds of the second quarter. The first-half Seahawks boasted a franchise quarterback who made jaw-dropping plays to a top-tier veteran receiver, a punishing running back who could drag defenders for additional yardage, a young corner who flashed promise and veteran savvy in the front seven. They stayed competitive despite losing their starting center. They looked like an NFC contender. The second-half Seahawks? That's a different story. What remains to be seen is whether it remains the story of Seattle's season. A showing from Schaub For the second time this season, the Seahawks allowed 400 or more yards by an opposing passer. Cincinnati's <mark>Andy Dalton</mark> threw for 418 yards and two touchdowns in the season opener (a total that led all quarterbacks in Week 1), and on Sunday it was the 38-year-old Schaub who threw for 460 yards, one touchdown and one interception. It was the most passing yards any Seahawks team has allowed by an opposing quarterback during Carroll's coaching tenure. The next closest is Ben Roethlisberger, who threw for 456 yards against Seattle in November 2015. That's not to say Schaub didn't make mistakes. In fact, maybe that's why he's yet another name on a very interesting list: Quarterbacks who have lost to the Seahawks while throwing 400-plus yards. It now totals seven, according to 710 ESPN Seattle's Danny O’Neil: Under Pete Carroll, #Seahawks are undefeated when allowing an opponent to throw for more than 400 yards! pic.twitter.com/BI4p2XersW--Danny O'Neil (@ dannyoneil) October 27, 2019 Wagner sets a new Seahawks record Sunday also brought a new franchise record. Linebacker Bobby Wagner has now registered more tackles than any other player in Seahawks history (985). \"He's got plenty of years left,\" Carroll said of the 29-year-old Wagner, who signed a three-year extension in July that keeps him under contract with Seattle through 2022. \"I don't know how anybody could ever break that record. I think he's going to own that forever. That's amazing that he's there already. But just a tribute to the unbelievable player that he is, his discipline, his toughness, his work ethic, everything. That's an incredible number .\" Follow 710 ESPN Seattle's Stacy Rost on Twitter. More Seahawks coverage: O’Neil's column | Gallant's take | 710 reacts Comments Share Top Stories Gallant: 2 reasons why Seahawks aren't more than above-average If Seahawks make another trade, what position needs the help? M's video: Who does and doesn't have a future in Seattle? Lydia Cruz's 2 Minute Minor: The ins and outs of shift changes Sponsored Articles BARK - An Original Podcast with <mark>Jim Moore</mark> Above & Beyond with Brock Huard"}, {"articleID": "2012090211_00001424_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2012-09-02", "url": "http://hometownlife.com/article/20120902/NEWS02/209020356/1019", "content": "on a hot summer evening aug. - 7:25 am ice sculptors, environmentalists, artists, car collectors, musicians and their fans have had a turn...royal oak - beaumont hospital, royal oak has spread its wings with a new tool in the fight to...sun-soaked crowd takes in full flavor of 2012 arts, beats and eats royal oak - steamy summer temperatures greeted the first wave of festival goers when arts,...sample the vine dine delights fine food and wine will be present in abundance at the ninth annual vine dine event presented by...fashion's night out thursday downtown birmingham joins the world's fashion capitals for the annual fashion's night out...sisters of the brush return to lawrence street gallery in ferndale, sept. 5-29. bountiful books carol pyke's grandson wondered why she works so hard on the american association of university...as mitt romney lays out his vision for america, jennifer killeen can take a little credit for helping to craft some of the conversation. the birmingham resident was flown to ohio last saturday, where she spent nearly 30 minutes in a private meeting with romney and rep. <mark>paul ryan</mark> as the pair prepared for a campaign stop in powell. killeen said she was randomly chosen for the meeting through an online contest that was posted on a romney website. \"it was like winning the lottery,\" said killeen, 41, who's married and works in advertising with universal mccann. \"i got a call at 5:30 p.m. friday from their campaign that i won, and by 9:30 p.m. i was on a plane to columbus to meet them .\" back home, killeen admitted tuesday she was pretty wound up about meeting the country's next possible president. \"right away i started researching what i wanted to talk about,\" she said. \"i keep up with politics. i'm looking for a leader who can help us grow the economy - that was the main thing i wanted to talk to them about .\" she also wanted to make sure part of romney's economic vision has a place for small businesses and women entrepreneurs. \"it's absolutely an important piece of the economy and i'm happy to say that gov. romney recognizes that,\" she said. \"on sunday when i got i home, my husband and i went up to the farmers market in birmingham. i walked up to three booths to check out what they were selling and all three booths were owned and operated by women. i think that's pretty impressive .\" killeen said she was picked up at her hotel early saturday morning and taken to a different hotel, where she was escorted around and introduced to part of the campaign staff. she was then escorted into a hotel conference room, where she sat down at a small table with romney and <mark>ryan</mark>. \"they were very personable, very down to earth,\" she said. \"gov. romney mentioned he was just in birmingham for the cbs interview with 60 minutes and that part of it took place at the birmingham 8 theatre, where he and ann used to go on dates. he then asked me where i lived in birmingham and he commented on different parts of the city that were special to him. he then mentioned he had gone to cranbrook and i told him and how my husband and i were recently married there .\" when killeen mentioned she grew up in the north end of texas, <mark>ryan</mark> noted his wife is from oklahoma and how they fly in to dallas to drive up to her family's house. he then recommended a good barbecue joint to her. \"i was impressed that someone from wisconsin knows his barbecue,\" she said with a smile. the three talked about the economy and the challenges professional women face in their career paths. killeen said she expects the topic to come up throughout the election. resident has private chat with romney and <mark>ryan</mark> as mitt romney lays out his vision for america, jennifer killeen can take a little credit for helping to craft some of the conversation."}, {"articleID": "2020040302_00146020_W", "names": {"Brendan Carr": ["Q25993038", "Q39073457", "Q4960828"]}, "date": "2020-04-02", "url": "https://www.news-gazette.com/news/nation-world/central-park-houses-hospital-ward-as-ny-races-to-add-beds/article_fd2bc90d-7abe-558e-be37-f1940375a895.html", "content": "Facebook Twitter WhatsApp SMS Email Listen to this article Facebook Twitter WhatsApp SMS Email Print Save NEW YORK (AP)--There is a coronavirus ward in tents in Central Park. A makeshift hospital has been set up in a Manhattan convention center. Over the next few weeks, spaces including pro tennis courts, college dorms and a cruise ship terminal are supposed to start housing patients as New York state races to roughly triple its hospital capacity. And still, officials worry whether the massive effort will be enough in the U.S. epicenter of the coronavirus pandemic. A recent state chart tallying the planned hospital beds ended with question marks about how much space might be found in nursing homes. Some hospital and city leaders have questioned whether too much temporary hospital space is being reserved for patients who don't have the virus that causes COVID-19, though there are now plans to shift one big temporary site's focus to caring for them. And officials underscore that beds alone can't solve a problem growing by more than 1,000 hospitalizations a day. \"Beds, we can find. Not easy, but we can find them. The harder components are the staff and the supplies,\" Gov. Andrew Cuomo said Thursday. As he spoke, over 13,300 coronavirus patients were hospitalized and more than 3,300 needed intensive care around the state, though mostly in New York City. The outbreak's expected peak was still seven to 30 days away, the Democrat said. When that happens, New York expects to need 140,000 hospital beds--compared to the 53,000 it had when the crisis began. So many seriously ill patients are anticipated that New York City is preparing to turn all its 20,000 permanent hospital beds into intensive care ones, while trying to add 65,000 temporary beds for other patients. For most people, the new virus causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with chronic health problems, it can cause more severe illness, including pneumonia, and can be fatal. It has killed over 2,300 people in New York state so far, according to the governor. The scramble for hospital space, staff and ventilators is intended to ward off a dire worst-case scenario: medical centers becoming so swamped that some people die whose lives could otherwise be saved. Even though they are working to squeeze in thousands of extra beds, some New York City facilities have been overloaded at times, transferring patients around the city and sometimes as far away as the Albany area. Emergency rooms at Mount Sinai Health System's Brooklyn and Queens hospitals started getting backed up over the weekend, emergency medicine chair Dr. <mark>Brendan Carr</mark> said. Patient transfers to larger Mount Sinai hospitals ultimately eased the crunch. But if not for that, \"two of our hospitals would be in terrible distress,\" he said Wednesday. \"That can't keep going. We're continuing to grow capacity at all these hospitals, but at some point, we run out of space,\" he said. Some relief is now in sight, even from the windows of Mount Sinai's flagship hospital in Manhattan. Across Fifth Avenue, white tents now cover much of Central Park's East Meadow. They form a 68-bed emergency field hospital for coronavirus patients that opened Wednesday. Nine patients were being cared for Thursday, according to Samaritan's Purse, the evangelical Christian relief group running the operation. The group's opposition to same-sex marriage sparked concern among some of New York's Democratic political leaders. The organization's CEO, the Rev. Franklin Graham, told Fox News on Monday that \"we're going to give the best health care we can to all New Yorkers--it doesn't matter who they are or what they are .\" State, city and federal officials say they have lined up--and in some cases, opened--dozens of additional spots for temporary hospitals around the metropolitan area. A Navy hospital ship, the USNS Comfort, is docked in Manhattan with 750 beds, three of them occupied as of Thursday, commanding officer Capt. Patrick Amersbach said in a telephone news briefing. The Javits Center, a glassy convention facility where such events as New York Comic Con and the New York International Auto Show usually take place, now houses a federally-run hospital, with 2,500 beds as of Thursday, according to Cuomo. Officials also are tapping colleges, the Aqueduct horse-racing track, a part of the tennis center that hosts the U.S. Open, a Brooklyn cruise terminal, and 20 hotels so far. Decisions on routing patients to the temporary hospitals are made from a state-run operations hub set up in the Javits Center, according to city Emergency Management Office spokesman Omar Bourne. A similar system has been used before during such disasters as Superstorm Sandy. Some facilities are intended for COVID-19 patients who need hospitalization, but not intensive care. Others, including the Comfort and the Javits Center, were designated for patients who don't have the virus but need care for other reasons--though President Donald Trump said Thursday evening that the Javits would switch to caring for coronavirus patients. New York officials and hospital leaders had urged a change in focus. \"You're only going to help if you take the patients that we need help with, which is COVID patients,\" Michael Dowling, CEO of Northwell Health, said before Thursday's announcement. \"If they don't relieve us of the pressure that we're under, then I'm not sure the utility .\" While scouring for temporary hospital space, state and city officials are also sounding even more urgent calls for ventilators, medical personnel and protective gear for them. Cuomo warned Thursday that the state's supply of breathing machines could be exhausted in six days if the current rate of critical COVID-19 illness continues. Democratic New York Mayor Bill de Blasio asked the federal government this week to supply 1,000 nurses, 150 doctors and 300 respiratory therapists by Sunday. \"The bed,\" he said, \"is only as good as the supplies, the equipment, and especially the people that go with it .\" ------Associated Press writers Michael R. Sisak in New York, Marina Villeneuve in Albany, New York, and Robert Burns in Washington contributed to this report. Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Facebook Twitter WhatsApp SMS Email Print Save Locations United States North America Albany New York Brooklyn New York City Manhattan"}]