[{"date": "2015-09-13", "url": "http://trentonian.com/sports/20150913/chip-kelly-wants-great-not-good-from-eagles", "content": "Philadelphia Eagles Chip Kelly wants great, not good from Eagles With Sam Bradford at the helm, hopes are high for Chip Kelly's Eagles as long as Bradford remains healthy. The Associated Press By Bob Grotz, bgrotz @ 21st-centurymedia.com, @ BobGrotz on Twitter Posted: The Eagles know they're good. Great, the goal of Chip Kelly's unconventional makeover is another thing. But it's safe to say the expectations at the starting gate are much like they were 11 years ago, when the Eagles went to the Super Bowl. Terrell Owens and Jevon Kearse helped put that 2004 team over the top. Byron Maxwell and Sam Braford are the new pieces the Eagles need to make this team special. \"I feel like we are a Super Bowl team,\" said Maxwell, who played in the last two NFL title games. \"Obviously you've got to put the work in. It's a long season. A lot of things can happen. But I definitely feel like we're in the mix. Most teams, they don't have a shot right away. We have a quarterback. And unless you have a quarterback, you can't win. So we've definitely got an opportunity .\" Advertisement Quarterback Bradford, acquired in a trade for Nick Foles, has shown glimpses of giving the Eagles a chance to be great. Bradford reads the game like a coach. He puts the ball in tight places as easily as some quarterbacks hand it off. He's also coming off back-to-back reconstructions of the ACL in his left knee. The Eagles acquired Bradford as is, which right now is healthy enough to play, but not so fit where each time he's driven into the ground you wonder if he's getting up. \"I just try to put that back in my mind and I haven't thought about it that much,\" said Bradford, sidelined all but seven games the past two seasons. \"I think more than any other season opener, I'm probably more excited than ever, just to get back on the field. It's something I've been waiting a long time for .\" If the Eagles keep Bradford healthy, Kelly's offense could become epic. The Eagles signed 220-pound running backs DeMarco Murray and <mark>Ryan Mathews</mark>, whose downhill style is a better fit for the Philly scheme than LeSean McCoy's north, south, east and west running. Third-down back Darren Sproles has been split out at receiver. With Kelly, the mismatches start at running back. North-south running backs and up-tempo equal misery for the opposition. \"I definitely think it's a positive,\" Murray said of the tempo. \"You don't get guys coming off the ball as hard. You get them in different looks. You get them confused. So I definitely think it's the upper hand for us. At the same time we've got to make sure we play with great tempo, great hand-eye coordination, all of the things that gives us an advantage. It's a lot of technique and being in great shape .\" Nelson Agholor was drafted in the first round to replace leading receiver Jeremy Maclin, who left in free agency. Jordan Matthews looks ready to take another big step and veteran Miles Austin is around if Michael Huff sputters. Tight end Zach Ertz still isn't all the way back from hernia surgery but veteran Brent Celek and Trey Burton are solid targets. The offensive line anchored by center Jason Kelce and tackles Jason Peters and Lane Johnson looks OK with Allen Barbre and <mark>Andrew Gardner</mark> stepping in as guards. The Eagles faded down the homestretch last season, losing three of their last four games and, despite 10 victories, failed to reach the playoffs. \"It's just unfinished business,\" Jordan Matthews said. \"We know we left a little bit on the table last year. We made a lot of changes. We've got a lot of hungry guys in this locker room. And I just love the focus. I mean you can tell when guys come in the building, there's a vibe, there's an electricity. Everybody's hungry and excited to be here but there's also a focus. Everybody knows that we've got to take care of business .\" The defense signed the ever-confident Maxwell, the top cornerback in free agency, to a six-year, $63 million contract. The signing of safety Walter Thurmond, another player with Seahawks pedigree, looks almost as helpful. Thurmond is a ball hawk who plays the angles and roams the back end like a knock-off of <mark>Ed Reed</mark>. Middle linebacker Kiko Alonso, acquired from Buffalo in the trade for McCoy, might not start the early portion of the season if veteran DeMeco Ryans is healthy. But Alonso and his legendary motor--\"That guy never gets tired,\" <mark>Brandon Graham</mark> said--will work in. Cornerback Nolan Carroll hopes to make Eagles fans forget that Bradley Fletcher started the past two years. The front seven is underrated with All-Pro Fletcher Cox, Pro Bowl linebacker Connor Barwin (14 1-2 sacks), <mark>Graham</mark> in a starting role and nose guard Bennie Logan. Kicker Cody Parkey says he's healthy after a groin injury and so are the special teams, which scored seven touchdowns last season, including two punt returns by Sproles and one kickoff return by Huff. The chemistry, at least at this early spot, is off the charts entering the season opener Monday night in Atlanta against the underdog Falcons. It's Chip Kelly's team. \"It's his team. It's our team, too,\" <mark>Graham</mark> said. \"He made the choices. We've just got to believe in it and I feel everybody believes that he made the right choices. Everything is coming together, man. I'm just excited, just like everybody else, just to see how everything comes together this weekend. I really feel like, man, we're going to get it done. People know that we're going to come to work. You're going to have some bad days, but we've got a lot of guys around here that are going to get you going and aren't scared to criticize you. And we've got a lot of people who can take it, too .\" It wasn't that way in Kelly's first two seasons when a personality here or a personality there seemed bigger than the team. And it hasn't been like that for, well, 11 years or so.", "articleID": "2015091317_00024352_W", "names": {"Ed Reed": ["Q1282460", "Q604393"], "Ryan Mathews": ["Q641173", "Q7384288"]}}, {"date": "2015-09-14", "url": "http://www.ctnow.com/hc-sacred-heart-ftma-film-festival-20150914-story.html", "content": "Orson Wells Double Feature Part Of FTMA Film Fest F is for Fake Janus Film \"F is for Fake\" is one of two Orson Welles films that will be shown as part of the FTMA film festival at Sacred Heart University. \"F is for Fake\" is one of two Orson Welles films that will be shown as part of the FTMA film festival at Sacred Heart University. (Janus Film) FTMA Film Festival at Sacred Heart University honors Kevin Nealon, <mark>Richard</mark> KindOrson Welles double feature, \"Bulworth\" part of Sacred Heart film fest Sacred Heart University in Fairfield celebrates its film and television program--the only graduate film-television program in the state--with its second annual FTMA Film Festival Thursday through Sunday, Sept. 17 to 20. The festival will include film screenings, a master class, a gala, a standup comedy show and after-parties, at the Fairfield campus and at Avon Theatre in Stamford. 0 Justin Liberman, a professor and one of the founders of the festival, said it was founded as a result of perceived shortfalls in the Fairfield County film scene. \"One of our real missions was to really cultivate a community and a culture of film,\" he said. \"We are recognizing that there is a thirsty community here. The festival is a way to\" throw the bat signal out,' in a way. \"Entertainment industry notables planning to attend the festival include actors Kevin Nealon and <mark>Richard Kind</mark>, screenwriter Brian Koppelman and Oscar-nominated screenwriter Jeremy Pikser. Here's a lineup: Thursday: Awards ceremony at which four award-winning student films will be shown, then a tribute to Koppelman, who wrote\" Rounders, \"\"Runaway Jury\" and \"Ocean's Thirteen .\" Avon Theater in Stamford, 7 p.m., followed by a reception. Friday: Screenwriting master class with Pikser, as well as a screening of his Oscar-nominated movie, \"Bulworth,\" which he co-wrote with Warren Beatty. Frank and Marisa Martire Business & Communications Center, Sacred Heart University, 11 a.m.; salute to Nealon (Class of' 75), with clip reel from his films, Martire Center, 7:30 p.m.; standup comedy show with Shul Egar, Keith Alberstadt and Nealon, Martire Center, 9 p.m. Saturday: Orson Welles double feature, \"A Touch of Evil\" and \"F is for Fake,\" followed by discussion on Welles by Dr. Sid Gottlieb, Martire Center, 10 a.m.; Sacred Heart student films, Martire Center, 6 p.m.; Sounds of Cinema concert, with songs from the movies of Wes Anderson, Martire Center, 9 p.m. Sunday: Award presentation for <mark>Kind</mark>, with clip reel from his films, including \"A Serious Man\" and \"Inside Out .\" Martire Center, 2 p.m. Admission is free to all events, but reservations are suggested and can be made at ftma.sacredheart.edu.", "articleID": "2015091416_00127921_W", "names": {"Richard Kind": ["Q2054112", "Q449959"]}}, {"date": "2015-09-14", "url": "http://dailykos.com/story/2015/09/14/1421210/-Donald-Trump-is-hoping-for-political-attacks-Everybody-who-attacks-me-is-doomed?detail=hide", "content": "<mark>Donald Trump</mark> is hoping for political attacks. \"Everybody who attacks me is doomed .' 23 Comments Republican presidential front-runner <mark>Donald Trump</mark> only has one formal position paper, on immigration. He has little in the way of campaign staff, and still less in the way of campaign staff with campaign experience or high-level policy advisers formally associated with the campaign .\" A lot of what I'm doing is by instinct, \"Mr. <mark>Trump</mark> said in one of several interviews .\" I assimilate a lot of information...and I believe in being strategic. \"Instead of surrounding himself with what he called\" political hacks, \"Mr. <mark>Trump</mark> said,\" I don't need an inner circle. \"His rationale: In an\" age of specialization, I am tapping phenomenal people in every field. \"Phenomenal people like Jack Jacobs, the retired Army colonel <mark>Trump</mark> cited as one of his go-to military advisers, only to have Jacobs say he was not advising <mark>Trump</mark> and in fact had never talked about policy with him? But don't worry, <mark>Trump</mark> will totally come up with a tax plan at some point, and possibly other positions outlined in more detail than whatever he blurts out on the stump. And in the mean time, he has nothing to worry about attacks from his political opponents anyway, saying\" I hope they attack me, because everybody who attacks me is doomed. \"If that's true, why even bother doing anything other than inviting people to attack him? Originally posted to Laura Clawson on Mon Sep 14, 2015 at 11:12 AM PDT. Also republished by Daily Kos. Tags", "articleID": "2015091422_00002541_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-09-14", "url": "http://www.news-mail.com.au/news/demi-lovato-nick-jonas-deserves-best/2774656/", "content": "BANG Showbiz Related Items Robert Pattinson only reads bad reviews <mark>Chris Brown</mark> forced into drug test during custody hearing Elle Fanning's transgender inspiration Zayn Malik sends naked pictures to Lily Allen Taylor Swift celebrates Emmy win for 360 degree video Schwarzenegger \"honoured' to host Celebrity Apprentice Show More Local Real Estate Cars For Sale DEMI Lovato thinks Nick Jonas\" deserves the best \". The\" Cool for the Summer' hitmaker would happily play matchmaker and \"hook\" her close pal up with someone if she thought they'd suit. She explained: \"People joke, but I also, like, I don't really take it seriously because sometimes the people that are joking just don't really have a chance .\" But if somebody actually was like \"hey,' and I thought he would be into them, I'd hook them up. He deserves the best .\" And regarding rumours about a possible romance between the 22-year-old singer and \"Good For You' hitmaker Selena Gomez, Demi refused to comment. She told Capital FM:\" I'm Switzerland! I have no opinion on that! Listen, if I have an opinion on something, I would say it. I want him to be happy. \"Meanwhile, Nick - who split from beauty queen Olivia Culpo in June - recently admitted he is still\" adjusting \"to single life. When asked how it feels to be single, he said:\" Interesting. It's still an adjustment, getting use to my life on my own is an interesting thing. \"I'm in a good place of being young and grow and do what I need to do right now .\" bang showbiz Read More Login to follow demi lovato Read More Login to follow nick jonas Read More Login to follow Topics: bang showbiz, demi lovato, nick jonas 0 0 PRINT Have your say Top Stories LNP toss Tony, turn to Malcolm amid poll fears Estranged husband of Sharon Edwards jailed' I was dying on the table': Chappy Dave tells of near death Join the Community. Get your local news, your way. Sign Up Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now", "articleID": "2015091422_00080681_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}}, {"date": "2015-09-15", "url": "http://leaderjournal.com/article/20150914/NEWS/150919448", "content": "Ferguson panel recommends police, court reform, transparency...Ferguson panel recommends police, court reform, transparency A reform panel formed after the Ferguson police shooting of <mark>Michael Brown</mark> is pushing for the consolidation of police departments and municipal courts in the St. Louis area, and decreasing the use of police force. Comment By JIM SALTER, Associated PressJIM SUHR, Associated Press Leader Journal - St. James, MO By JIM SALTER, Associated PressJIM SUHR, Associated Press Posted Sep. 14, 2015 at 1:17 PM By JIM SALTER, Associated PressJIM SUHR, Associated Press Posted Sep. 14, 2015 at 1:17 PMST. LOUIS A reform panel formed after the Ferguson police shooting of <mark>Michael Brown</mark> is pushing for the consolidation of police departments and municipal courts in the St. Louis area, and decreasing the use of police force. The Ferguson Commission, a 16-member panel appointed by Missouri Gov. Jay Nixon in November, released a copy of its 198-page report online Monday. Nixon and members of the commission planned to discuss the details at an afternoon news conference. The report acknowledges the commission has no power to enact any of the proposals, but Nixon has said the group has his office's full support. \"The law says all citizens are equal,\" the report's introduction states. \"But the data says not everyone is treated that way .\" The events in Ferguson raised concerns about police departments and municipal courts in that north St. Louis County town, and elsewhere in the region. The departments and courts have been accused of targeting minorities to raise revenue, leading to mistrust that was a key component of unrest following <mark>Brown</mark>'s death. <mark>Brown</mark>, 18, who was black and unarmed, was killed by Ferguson officer <mark>Darren Wilson</mark> during a confrontation in August 2014. A St. Louis County grand jury and the U.S. Department of Justice declined to prosecute <mark>Wilson</mark>, who is white, but the shooting spurred a national \"Black Lives Matter\" movement and led to protests and rioting in and around Ferguson. The report said the panel heard from many black residents \"who do not feel heard or respected when they interact with the police or the courts. They do not feel that they are treated in an unbiased way .\" Relations with police were strained in parts of the St. Louis region before the shooting, partly because of excessive force, the report said. \"The regular use of force has led many citizens to view the police as an occupying force in their neighborhoods, damaging community trust, and making community safety even more difficult,\" the report said. It suggested new use-of-force policies, officer training and a change in department culture. It also recommended establishment of a statewide database of use-of-force incidents and statistics. The report notes St. Louis County has 81 municipal courts and 60 municipal police departments--and recommends consolidating at least 18 of those departments into just three that would oversee different areas of north St. Louis County. The fragmentation \"is not only costly and a grossly inefficient use of taxpayer resources, but more importantly presents as an impediment to justice for many of our region's citizens,\" the report said. The commission also recommended a statewide plan to deal with mass demonstrations. Some observers were skeptical about the value of the report. Remy Cross, a criminologist and sociologist at Webster University in suburban St. Louis, isn't optimistic that it will lead to significant change. Page 2 of 2 - \"It's hard not to be cynical of these kinds of reports given the track record,\" Cross said. \"They (commissioners) are really not given any authority. Everybody agrees with the report, and nothing really comes of it because no one wants to pony up the money or get down to the brass tacks of the policy changes .\" Ferguson Mayor James Knowles III said his community has made several changes, including installing a new police chief and municipal judge. He was concerned that the name of the commission is misleading. \"One of the worst things they could have done is naming it\" The Ferguson Commission,' \"Knowles said .\" That's not what it's about. When you do that, it makes it real easy for other communities not feeling the pressure to ask, \"Why do we need to change? There wasn't a riot in our section of the region .'\" By JIM SALTER, Associated PressJIM SUHR, Associated Press Leader Journal - St. James, MO By JIM SALTER, Associated PressJIM SUHR, Associated Press", "articleID": "2015091500_00002003_W", "names": {"Darren Wilson": ["Q17543917", "Q5225246", "Q5225247"], "Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"]}}, {"date": "2015-09-16", "url": "http://clubcall.com/crystal-palace/dann-deal-thanks-to-cabaye-1781884.html", "content": "<mark>Scott Dann</mark> decided to pen a new deal with Crystal Palace as soon as the Eagles snapped up Yohan Cabaye from Paris Saint-Germain. Palace pulled off something of a coup when luring the France international to Selhurst Park in a deal worth & pound; 11million, and co-chairman <mark>Steve Parish</mark> says it was important the club made a statement of intent. Cabaye did not come cheap but <mark>Parish</mark> says he is worth it after <mark>Dann</mark> snubbed the likes of Everton to sign a new deal. \"Nothing about the Cabaye deal is a bargain. We paid full whack to the club, full whack to the player,\" he told the Guardian. \"But sometimes you just have to pay to take you to another level .\" There was no question about Yohan's pedigree, but it was also what it said about the club. The statement it made. \"<mark>Scott Dann</mark> was courted by other clubs this summer but, when we signed Yohan, he said to me:\" The clubs I'm being linked with aren't signing players of that calibre. They're not showing that ambition. Why would I go anywhere else?' \"", "articleID": "2015091614_00141473_W", "names": {"Scott Dann": ["Q16214802", "Q448074"], "Steve Parish": ["Q23301488", "Q7613543"]}}, {"date": "2015-09-21", "url": "http://www.thecourier.com.au/story/3362433/legislative-council-condemns-ballarat-rrl/?cs=12", "content": "The Legislative Council of the Victorian Parliament has agreed to Ballarat MP <mark>Josh Morris</mark>' motion condemning Labor's failed roll out of the Regional Rail Link. Ballarat MP <mark>Josh Morris</mark> and Opposition leader Matthew Guy at the Ballarat Train Station. The Victorian Parliament's Legislative Council has agreed to Ballarat MP <mark>Josh Morris</mark>' motion condemning Labor's failed roll out of the Regional Rail Link. The motion called on Minister for Public Transport Jacinta Allan to return the Ballarat line to the pre-roll out timetable and was agreed to on September 16. \"I'm glad that Jacinta Allan is being held to account for her poor performance and for subjecting Ballarat commuters to months of delays, overcrowding and cancellations,\" Mr <mark>Morris</mark> said.", "articleID": "2015092102_00054603_W", "names": {"Josh Morris": ["Q1354591", "Q19604839", "Q3185992"]}}]