[{"articleID": "2018010522_00587986_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Michael Wolff": ["Q1630670", "Q1929891", "Q20054125", "Q439955", "Q6835424", "Q6835425"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"]}, "date": "2018-01-05", "url": "http://commondreams.org/news/2018/01/05/trolling-trump-journalism-watchdog-hold-global-press-oppressor-awards-monday-500", "content": "Published on Friday, January 05, 2018 by Common Dreams Trolling <mark>Trump</mark>, Journalism Watchdog to Hold \"Global Press Oppressor Awards on Monday at 5:00'\" Subjects will cover Thinnest Skinned & Outrageous Use of Laws, in various categories for world leaders. \"by Julia Conley, staff writer 0 Comments The Committee to Protect Journalists calls attention to threats to free speech around the world, including President <mark>Donald Trump</mark>'s anti-press rhetoric. (Photo: Chris McGrath/Getty Images) In response to President <mark>Donald Trump</mark>'s announcement this week that he plans to hold an awards ceremony for dishonest media outlets, the Committee to Protect Journalists (CPJ) said Friday it was organizing its own event to honor anti-press world leaders. CPJ will be announcing THE GLOBAL PRESS OPPRESSORS AWARDS on Monday at 5:00 pm. Subjects will cover Thinnest Skinned & Outrageous Use of Laws, in various categories for world leaders. Stay tuned! #TheFakies #PressFreedom #PressOppressors https: //t.co/0r93ceV3HJ--CPJ (@ pressfreedom) January 5, 2018 CPJ documents threats to press freedom including cases of journalists being killed, injured and imprisoned while reporting as well as attacks on the media by <mark>Trump</mark> and other politicians. The group's announcement mirrored <mark>Trump</mark>'s earlier tweet saying that he would be holding\" THE MOST DISHONEST & CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o'clock. \"(sic)\" Subjects will cover Dishonesty & Bad Reporting in various categories from the Fake News Media, \"the president added. In December, capping off a year during which he regularly attacked the press for its coverage of his administration and policies, <mark>Trump</mark> sent an email to his supporters asking them to help him decide which media outlet should win the award for\" fakest news. \"A Rasmussen poll taken after the president first promoted his idea for an awards ceremony, in a November tweet, found that 40 percent of respondents believed Fox News, which has covered the <mark>Trump</mark> administration far more favorably than other cable networks, should win <mark>Trump</mark>'s\" Fakest News Trophy. \"CPJ's planned awards will follow their annual Press Freedom Awards, held in November. The group honored a journalist who has been jailed since 2015 for his reporting in Cameroon, and reporters who have been under threat for their coverage of human rights and politics in Mexico, Thailand, and Yemen. The group has also been sharply critical of <mark>Trump</mark>'s treatment of the press, partnering with several other organizations to run the U.S. Press Freedom Tracker, which catalogues threats to journalists including the president's anti-media rhetoric and actions. Most recently the tracker documented <mark>Trump</mark>'s attempt to stop the publication of <mark>Michael Wolff</mark>'s book about his first year in office, and the president's statement that an ABC News reporter\" should be immediately fired \"for incorrectly reporting on the timing of <mark>Trump</mark>'s conversations with former National Security Advisor <mark>Michael Flynn</mark> regarding Russia--a mistake that ABC quickly corrected.\" The United States has some of the strongest legal free speech protections in the world, and serves as a beacon for press freedom in a world where journalists are routinely censored, attacked, or imprisoned for their work, \"notes the U.S. Press Freedom Tracker's website.\" But the U.S. record is imperfect, and journalists and advocates must tirelessly defend the First Amendment in courts, in legislatures, and in the media. Constant vigilance and an honest accounting of the country's track record on press freedom are essential. \"This work is licensed under a Creative Commons Attribution-Share Alike 3.0 License Share This Article More in: U.S., Media, <mark>Donald Trump</mark>, Committee to Protect Journalists, Journalism, #NotNormal Top Comments (Click to see more comments or to join the conversation)"}, {"articleID": "2019061413_00126097_W", "names": {"Noel King": ["Q42914343", "Q7047049"], "Kevin Bacon": ["Q23823432", "Q3454165", "Q6395762", "Q6395763", "Q6395764"]}, "date": "2019-06-14", "url": "http://wcqs.org/post/aldis-hodge-30-year-acting-veteran-age-32-city-hill", "content": "Aldis Hodge, A 30-Year Acting Veteran At Age 32, On \"City On A Hill' By <mark>Noel King</mark> & Daniel Hajek • 6 minutes ago Share Tweet Email City on a Hill, Aldis Hodge plays Assistant District Attorney Decourcy Ward, who is new to the corrupt criminal justice system of 1990s Boston.\" href = \"https: //mediad.publicbroadcasting.net/p/shared/npr/styles/x_large/nprshared/201906/732447198.jpg\" > City on a Hill, Aldis Hodge plays Assistant District Attorney Decourcy Ward, who is new to the corrupt criminal justice system of 1990s Boston. \"> In City on a Hill, Aldis Hodge plays Assistant District Attorney Decourcy Ward, who is new to the corrupt criminal justice system of 1990s Boston. Eric Ogden / Showtime Listen Listening.../ Originally published on June 14, 2019 8:27 am A new TV show, set in Boston in the 1990s, centers on some action-packed armored-car robberies. A crime drama in Boston: You've heard this before. But City on a Hill, which premieres Sunday on Showtime, is aiming for distinction. It stars actor Aldis Hodge as a straight-and-narrow assistant district attorney working within a crooked justice system. He's new in town, and determined to take on these robbery cases.\" In order to do his job right, he has to kind of play their game and play kind of by their rules a little bit, \"Hodge says in an interview.\" So he's got to get his hands dirty. \"And that means teaming up with a corrupt, racist FBI agent, played by <mark>Kevin Bacon</mark>. The two form something like a buddy-cop duo--except they certainly aren't buddies.\" I keep saying that these guys are two titans in a ring, boxing it out, \"Hodge says. In an interview, he spoke about the racism in the world of the show, his\" disciplinarian \"mother and a career that began as a child actor on Sesame Street and in Die Hard with a Vengeance. Interview Highlights On the racism of <mark>Kevin Bacon</mark>'s character I remember talking to the director of the show when we did the pilot, and even the writers now, about the tone of how this character handles racism ....I grew up around racism. I grew up between New York and [New] Jersey. And most people didn't realize that there was a KKK presence in Jersey in the part of town where I grew up. So I grew up around it. So as far as it comes to dealing with our characters together, we play the honesty of it. And this is what we go through today. I've even been through it this year alone in New York...I've had a Caucasian man a couple of months ago call me the n-word ....To my face, yeah. I've had another Caucasian man in his 50s call me to my face, said,\" You're intimidating because you're black. \"I said,\" What? What did you say? \"And in that, I had to invoke my own power within myself to understand my value, because: I'm a human being. I'm not intimidating. And I know what I bring to the table, and I know how I treat people. I was brought up with respect, and in that, I mean I give respect because I see the value in other people. That's what my mother taught me. It's weird that people don't realize that we live in this reality continuously. Aldis Hodge stars opposite <mark>Kevin Bacon</mark> as unlikely collaborators in the period cop drama City on a Hill. Claire Folger / Showtime On his mother Both my parents were Marines; so they met in the Corps. My brother [Edwin Hodge, also an actor] and I were both born while they were in service. And moms--so she was a single parent; I was raised in a single-parent household--but moms was, she was no joke. She was not a game up in here! Oh man! My mother was very much a disciplinarian. On time is late, early is on time, that kind of thing. And us, even though we were in the business, back in Jersey and New York we were still poor. We've been homeless three different times. I believe the last time I was homeless was when we moved to LA--I think I was 10. We used to live in our car at a certain point and all that. And for everything, my mom was like: Education is your way out. So she was not playing about the education. My mom reinforced the value of who we were in us continuously. And she--you know, she sacrificed a lot so that we may pursue our dreams ....Look, she was very conscious of the fact that she's a single mom raising two black men in a world that would not be so kind to them. What happens when the acting goes south? What will you know? So with acting, she made us earn it. She said,\" Look, if you're not bringing home As and Bs, you ain't going to see no audition. I don't care what's happening. \"And you know, on set--my mom, she's from the South, she's from Florida--like, she'll snatch us up in front of anybody. You acting out, you gon' get your butt whooped here, now, today, in front of everybody, and you gon' go back...you gon' do your job, because you chose this. On having a 30-year acting career at age 32 I've had to reevaluate my relationship with this industry. Because when I was a teenager, all I was getting was, like, thug role auditions and athlete role auditions. And I remember, I was always a science nerd. I was like: Black people are more than this. Like, that's cool and all, but it has to have a purpose. It can't just be for the sake of\" this is all we see you as. \"Now, 30 years in the game, I've spent this entire time trying to figure out...what I'm doing here, and demanding more of this career for me. So I've made sacrifices. There are jobs I didn't take, auditions I didn't go on. It all amounts to where I am now. And you have to actively participate in your fate, in your future. So I got a mission. And make sure that when people see me, they see a man of content and moral fiber. And somebody who didn't sell out. And that's the path I hope to walk for the rest of my career. Jacob Conrad edited this interview for broadcast. Patrick Jarenwattananon adapted it for the Web. Copyright 2019 NPR. To see more, visit https: //www.npr.org. Share Tweet Email"}, {"articleID": "2018050101_00197576_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}, "date": "2018-04-30", "url": "http://triblive.com/usworld/world/13600551-74/jhoon-rhee-father-of-american-taekwondo-dies-at-age-86", "content": "Jhoon Rhee, \"father of American Taekwondo,' dies at age 86 The Associated Press | Monday, April 30, 2018, 9:42 p.m. Jhoon Rhee Sign up for one of our email newsletters. Updated 15 minutes ago ARLINGTON, Va.--Grandmaster Jhoon Rhee, the man known as the\" father of American Taekwondo, \"died Monday after a long illness. He was 86. His son, Chun Rhee, said his father died in hospice care in Arlington, Virginia, a suburb of the nation's capital. Jhoon Rhee was a 10th-degree black belt credited with popularizing taekwondo in the United States, especially around the nation's capital, after emigrating from Korea in the 1950s. He opened his first taekwondo school in Washington, D.C., in 1962. By the 1980s, Rhee had 11 schools in the Washington area. Rhee became friends with legendary martial artist and actor Bruce Lee and appeared in a 1973 movie titled\" When Taekwondo Strikes. \"He also befriended boxer <mark>Muhammad Ali</mark>. Chun Rhee said that during a 1976 sports awards ceremony, his father jokingly challenged <mark>Ali</mark> and basketball legend Wilt Chamberlain to a fight to settle which one of them was\" the greatest \"athlete.\" Martial arts was a way of life for him, \"Chun Rhee said. Chun Rhee said funeral arrangements have not yet been finalized. He said information about a memorial service will be posted later this week. TribLIVE commenting policy You are solely responsible for your comments and by using TribLive.com you agree to our Terms of Service. We moderate comments. Our goal is to provide substantive commentary for a general readership. By screening submissions, we provide a space where readers can share intelligent and informed commentary that enhances the quality of our news and information. While most comments will be posted if they are on-topic and not abusive, moderating decisions are subjective. We will make them as carefully and consistently as we can. Because of the volume of reader comments, we cannot review individual moderation decisions with readers. We value thoughtful comments representing a range of views that make their point quickly and politely. We make an effort to protect discussions from repeated comments either by the same reader or different readers We follow the same standards for taste as the daily newspaper. A few things we won't tolerate: personal attacks, obscenity, vulgarity, profanity (including expletives and letters followed by dashes), commercial promotion, impersonations, incoherence, proselytizing and SHOUTING. Don't include URLs to Web sites. We do not edit comments. They are either approved or deleted. We reserve the right to edit a comment that is quoted or excerpted in an article. In this case, we may fix spelling and punctuation. We welcome strong opinions and criticism of our work, but we don't want comments to become bogged down with discussions of our policies and we will moderate accordingly. We appreciate it when readers and people quoted in articles or blog posts point out errors of fact or emphasis and will investigate all assertions. But these suggestions should be sent via e-mail. To avoid distracting other readers, we won't publish comments that suggest a correction. Instead, corrections will be made in a blog post or in an article."}, {"articleID": "2015120916_00777964_W", "names": {"Bill Davis": ["Q16186209", "Q16197639", "Q16203810", "Q2903187", "Q29033571", "Q4908704", "Q4908706", "Q4908707", "Q4908709", "Q4912434", "Q862052"], "James White": ["Q15451493", "Q16018627", "Q16105007", "Q17141088", "Q19578234", "Q23760213", "Q2540459", "Q27831214", "Q38804225", "Q43915057", "Q50652502", "Q57572486", "Q6145405", "Q6145421", "Q6145425", "Q6145429", "Q6145434", "Q926014"], "Marcus Smith": ["Q16235030", "Q30122761", "Q59162330", "Q6758457", "Q6758458"]}, "date": "2015-12-09", "url": "http://www.goerie.com/PD-Eagles-Notebook-Eagles-Kiko-Alonso-Facing-Bills-will-be-fun-1209", "content": "THIS IS not going to be a fun week to be Kiko Alonso. The guy the Eagles got when they traded LeSean McCoy has not returned to the form that made him the NFL's defensive rookie of the year for Buffalo in 2013. In fact, to Eagles fans, that form might seem about as far away and as relevant as Nick Foles' 27 touchdown passes vs. two interceptions, the same year. \"The fact that I got traded for (McCoy) has no relevance at all,\" Alonso said Tuesday. \"It's really just, the guy's a great player. We're going to have to be on top of our game and run to the ball and play sound football to stop that guy.\" The Alonso that Eagles fans have seen missed five weeks after suffering an injury to his repaired left knee, which had cost him all of 2014, and he seemed to be playing in slow motion when he returned. Because they were in nickel and dime packages most of the New England game, the Eagles left Alonso on the field for 70 snaps, and both Eagles coach Chip Kelly and defensive coordinator <mark>Bill Davis</mark> felt the need to say they'd overextended Alonso, that they needed to balance the inside linebacker snaps more. Mychal Kendricks had 48 and DeMeco Ryans had 21. Kendricks and Ryans have missed time with hamstring issues this season and are struggling in space. \"It showed up very late in the game, where he was gassed,\" <mark>Davis</mark> said Tuesday. \"I think at the very end there, where Kiko had a couple plays where he fell or he was just exhausted, we should have made a switch there. But we are happy with Kiko and Mychal. We have to get some coverage things down techniquewise, but they're good athletes with good football awareness, and will play better and better as we go.\" Specifically, Alonso fell down and left Patriots running back <mark>James White</mark> open for a huge catch on fourth-and-12, helping lead to the touchdown that put New England within seven points. \"Naw, man, it's another week,\" Alonso said Tuesday, when asked if there might be anything different about playing McCoy and his old team. \"It'll be fun because, obviously, I know those guys,\" he said. Asked how he thought he played against the Pats, Alonso said, \"Good. I thought I gave up some plays, I made some plays.\" Alonso said he did not feel worn down by the end. Asked if things have gone the way he'd hoped here, Alonso said, \"Yeah.\" The way <mark>Davis</mark> talked about McCoy Tuesday, it was hard to envision why the Eagles would ever trade such a player. \"Shady's on top of it right now. He's playing the best you've seen him play,\" <mark>Davis</mark> said. All three of McCoy's 100-yard games this season have come in the last five outings. \"He's peaking right now, like he does a lot of times,\" <mark>Davis</mark> said. \"I think always in November and December, you've seen him be at his best. It looks like he's in great shape.\" They're feeding him the ball a lot. He's being Shady - he's making the cuts and stopping on a dime and changing directions and making plays when they aren't there. We're going to have our hands full, and we look forward to the challenge. We know he's going to be at his absolute best. He'll be the best blocker, the best runner and the best pass protector that you can be. He'll be fired up for this game, but so will we. \"<mark>Davis</mark> said having practiced against McCoy would be of limited value for his players.\" It's not the full speed. Shady is about full speed, \"<mark>Davis</mark> said.\" His start-and-stop and perimeter run is second to none, and he sees the field. You see him in one gear in practice, and then there's another gear to Shady that shows up in the game that we have to be ready for, and we will be. \"Means to an end The Eagles filled Miles Austin's roster spot with 26-year-old Steven Means, an outside linebacker signed off the Houston Texans' practice squad. Means, 6-3, 263, worked out for the Eagles in October, before going to Houston. He was drafted out of the University of Buffalo by Tampa Bay in the fifth round in 2013 and played in 10 games as a rookie. Cut in 2014, he played one game for Baltimore. It's late to teach anyone your offense or defense and really expect them to contribute. This is the time of year when teams sign players off other teams' practice squads with an eye toward next spring and summer.\" Similar defense when I was with the Ravens, and Houston was 3-4, \"said Means, who obviously would prefer to get on the field sooner rather than later. He was a 4-3 d-end in college and with the Bucs, but said he likes the 3-4 stand-up view. Going forward, it will be interesting to see if Means' presence affects 2014 first-round pick <mark>Marcus Smith</mark>'s status. Birdseed Defensive lineman Bennie Logan (knee) sat out practice Tuesday...Safety Malcolm Jenkins said LeSean McCoy\" has a specific skill set, \"which made Shady sound a bit like Liam Neeson...Asked if it felt like the Eagles have a\" second chance, \"now that they're tied at 5-7 with the Giants and Redskins, Jenkins said:\" I think we've had about five second chances, to be honest...However we got here, we are right where we want to be. Everything up until this point is really null and void. Our playoffs start this week. \"On Twitter: @ LesBowen Blog: ph. ly/Eagletarian\" \"\"\"\"\"& Acirc; & copy; 2015 the Philadelphia Daily News Visit the Philadelphia Daily News at www.philly.com Distributed by Tribune Content Agency, LLC. _____ Topics: t000046469, t000003194, t000003183"}, {"articleID": "2010092014_00155627_W", "names": {"Jeff Long": ["Q28672700", "Q3807785", "Q6174381"]}, "date": "2010-09-20", "url": "http://arkansasbusiness.com/article.aspx?aID=123849.54928.135992", "content": "the university of arkansas football program has its sights set on winning the southeastern conference championship and bcs national title this season. doing so would likely help football recruiting, provide additional athletic department revenue and boost national exposure to the athletic department and the ua at large. a championship also would bump the compensation of coach bobby petrino to more than $3 million. petrino, as is the trend with college coaches across the country in all sports, has performance-based incentive clauses built into his already substantial contract. winning a national championship and the sec title in the same year would net petrino a $250,000 supplement to his $2.7 million annual compensation package. (he also can receive $150,000 per year in deferred compensation as an incentive not to leave before the end of his contract .) obtained through the state's freedom of information act. bonuses built into petrino's contract are among the most lucrative of those offered to ua coaches, according to documents obtained through the state's freedom of information act. possible incentives range from a $500 attendance-based payout for women's basketball coach tom collen to the $1 million bonus men's basketball coach john pelphrey would collect for winning conference and national championships in the same season. proponents of such a system argue that remaining competitive in college athletics today calls for more than six - or seven-figure salaries when compensating coaches. incentive-laden contracts are the norm in the increasingly competitive world of major college athletics. schools in a power conference like the sec, where the average operating budget tops $75 million each year and the demands of coaching are at an all-time high, are required to pay handsomely for coaches. college athletic departments have adopted additional forms of compensation for top employees much like more traditional businesses. on top of a base salary coaches have a number of bonus tiers and other moneymaking opportunities built into their contracts. arkansas athletic director <mark>jeff long</mark> said schools must offer more than salary to attract top-level coaches. \"that's part of that evolution,\" <mark>long</mark> said \"you know, as the market changed, we deal in a marketplace for coaches and as that has changed and gotten more competitive there are different pieces that come along with contracts.\" it really has been an evolution. if you look elsewhere there have been evolutions in compensation packages, so we're not a whole lot different than in a lot of [businesses]. \"the university of arkansas football program has its sights set on winning the southeastern conference championship and bcs national title this season. doing so would likely help football recruiting, provide additional athletic department revenue and boost national exposure to the athletic department and the ua at large. economic impact arkansas paid out more than $117,000 in athletic achievement bonuses for 2009-10. that figure could easily reach seven figures if razorback programs begin to consistently compete for national championships. arkansas in tax dispute with nucor steel factory in blytheville poll shows mike beebe with 21-point lead over jim keet in governor's race"}, {"articleID": "2017120300_00237865_W", "names": {"Caleb Kelly": ["Q28095229", "Q5019263"], "Kenny Hill": ["Q17523843", "Q20090908", "Q6391078", "Q6391081"], "Gary Patterson": ["Q25189982", "Q5525722", "Q5525724"], "Mark Andrews": ["Q1408804", "Q18763812", "Q21557955", "Q21557956", "Q26000923", "Q3293985", "Q364746", "Q41790042", "Q55093469", "Q6766550"]}, "date": "2017-12-02", "url": "http://www.courant.com/sports/college/hc-college-fb-big-12-1203-20171202-story.html", "content": "ARLINGTON, Texas--Baker Mayfield and No. 2 Oklahoma were happy to have another game, even with the potential consequences. The Sooners definitely left no question about whether they will be in the playoff. Heisman Trophy front-runner Mayfield threw four touchdowns and the Sooners staked their playoff spot with a 41-17 win over No. 10 TCU in the return of the Big 12 championship game Saturday. \"The reason I came back was to play for a national title,\" Mayfield said. \"The most exciting thing about today is we control our destiny. That's all out in front of us.\" With their record 11th Big 12 title, the Sooners (12-1, No. 3 CFP) are a lock to be in the College Football Playoff for the second time in three seasons. They are the only Big 12 team to make the four-team playoff format that started in 2014. The Sooners probably would have made the playoffs even if the Big 12 hadn't played its first championship game since 2010. But a loss would have likely knocked the Sooners out of contention. \"I'm really proud of our group for not listening to all the noise on the outside and we've played pretty good ball here at the end,\" Sooners coach Lincoln Riley said. \"We knew there was going to be a championship game and that was just going to be part of our journey if we wanted to get to this place.\" Oklahoma jumped out to a quick 17-0 lead, including <mark>Caleb Kelly</mark>'s 18-yard fumble return for a touchdown after running back Kyle Hicks' turnover on the first offensive play by TCU (10-3, No. 11). <mark>Kenny Hill</mark> threw two TD passes to get the Horned Frogs within 24-17 at halftime, but Oklahoma scored twice on its first three offensive plays after the break. \"Big plays, we gave up a couple. Two plays basically in the second half,\" TCU coach <mark>Gary Patterson</mark> said. \"The worst thing that could happen in the third quarter happened.\" A week before the Heisman Trophy winner will be named, Mayfield finished 15-of-23 passing for 243 yards and take game MVP honors. The first two touchdowns were to tight end <mark>Mark Andrews</mark>. <mark>Hill</mark> opened the second half with three consecutive incompletions. On the first play after the punt, Mayfield hit Mykel Jones for a 55-yard catch-and-run score. On fourth-and-1 from the Oklahoma 41 on the next drive, <mark>Hill</mark> bootlegged to the right side. Big defensive end Ogbonnia Okoronkwo chased him toward the sideline before Parnell Motley delivered the crushing blow that kept TCU's quarterback from getting a first down. Two plays later, Marquise Brown made an impressive over-the-shoulder grab for a 52-yard TD and a 38-17 lead. <mark>Hill</mark> finished 27-of-37 for 234 yards passing, and led TCU with 51 yards rushing. The Takeaway TCU: The Horned Frogs had allowed only six points (two field goals) combined after halftime in their last seven games. Even Oklahoma was scoreless in the second half of its 38-20 home win over TCU three weeks ago. The 41 points are the most TCU has allowed this season. Oklahoma: The Sooners clinched their third straight Big 12 title, all since former Texas Tech transfer Mayfield took over as the starting quarterback. Their 11th Big 12 title overall was the first without Bob Stoops, the coach for their last national title in 2000 who resigned unexpectedly last summer. Riley, at 34 the youngest FBS head coach, is only the fifth coach in FBS history with no previous head coaching experience at a four-year college to win at least 12 games in his debut season. Title Games Oklahoma is 8-1 in Big 12 championship games, winning seven of them between 2000 and 2010, when the Sooners beat Nebraska in the league's last championship game until Saturday. TCU has previously won or shared conference titles in the old Southwest Conference, Conference USA, the WAC, the Mountain West and Big 12. But this was the Frogs' first conference title game. Up Next TCU: The Horned Frogs could still possibly make it into one of the New Year's Six bowl games, and if not likely will be the Big 12 representative in the Alamo Bowl. Oklahoma: The Sooners wait to find out who they will play and in which national semifinal game, the Rose Bowl or Sugar Bowl."}, {"articleID": "2010122813_00171064_W", "names": {"George Mueller": ["Q20676223", "Q21809594", "Q3821445"]}, "date": "2010-12-28", "url": "http://simplelivingak.wordpress.com/2010/12/28/gardasil-bombshell-travesty/", "content": "a picture is worth a thousand words! ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ we are now reading...<mark>george mueller</mark> ~ (he dared to trust keeping foods fresh old world techniques and recipes by ~ the gardeners and farmers of terre vivante ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ gardasil bombshell travesty december 28, 2010 - wilkinson4jesus here is a post to get the word out on the blessings gardasil researcher drops a bombshell harper: controversal drug will do little to reduce cervical cancer rates by susan brinkmann, for the bulletin sunday, october 25, 2009 comments (4) dr. diane harper, lead researcher in the development of two human papilloma virus vaccines, gardasil and cervarix, said the controversial drugs will do little to reduce cervical cancer rates and, even though they're being recommended for girls as young as nine, there have been no efficacy trials in children under the age of 15. dr. harper, director of the gynecologic cancer prevention research group at the university of missouri, made these remarks during an address at the 4th international public conference on vaccination which took place in reston, virginia on oct. 2-4. although her talk was intended to promote the vaccine, participants said they came away convinced the vaccine should not be received. \"i came away from the talk with the perception that the risk of adverse side effects is so much greater than the risk of cervical cancer, i couldn't help but question why we need the vaccine at all,\" said joan robinson, assistant editor at the population research institute. dr. harper began her remarks by explaining that 70 percent of all hpv infections resolve themselves without treatment within a year. within two years, the number climbs to 90 percent. of the remaining 10 percent of hpv infections, only half will develop into cervical cancer, which leaves little need for the vaccine. she went on to surprise the audience by stating that the incidence of cervical cancer in the u.s. is already so low that \"even if we get the vaccine and continue pap screening, we will not lower the rate of cervical cancer in the us.\" there will be no decrease in cervical cancer until at least 70 percent of the population is vaccinated, and even then, the decrease will be minimal. apparently, conventional treatment and preventative measures are already cutting the cervical cancer rate by four percent a year. at this rate, in 60 years, there will be a 91.4 percent decline just with current treatment. even if 70 percent of women get the shot and required boosters over the same time period, which is highly unlikely, harper says gardasil still could not claim to do as much as traditional care is already doing. dr. harper, who also serves as a consultant to the world health organization, further undercut the case for mass vaccination by saying that \"four out of five women with cervical cancer are in developing countries.\" ms. robinson said she could not help but wonder, \"if this is the case, then why vaccinate at all? but from the murmurs of the doctors in the audience, it was apparent that the same thought was occurring to them.\" however, at this point, dr. harper dropped an even bigger bombshell on the audience when she announced that, \"there have been no efficacy trials in girls under 15 years.\" merck, the manufacturer of gardasil, studied only a small group of girls under 16 who had been vaccinated, but did not follow them long enough to conclude sufficient presence of effective hpv antibodies. this is not the first time dr. harper revealed the fact that merck never tested gardasil for safety in young girls. during a 2007 interview with kpc news.com, she said giving the vaccine to girls as young as 11 years-old \"is a great big public health experiment.\" at the time, which was at the height of merck's controversial drive to have the vaccine mandated in schools, dr. harper remained steadfastly opposed to the idea and said she had been trying for months to convince major television and print media about her concerns, \"but no one will print it.\" \"it is silly to mandate vaccination of 11 to 12 year old girls,\" she said at the time. \"there also is not enough evidence gathered on side effects to know that safety is not an issue.\" when asked why she was speaking out, she said: \"i want to be able to sleep with myself when i go to bed at night.\" since the drug's introduction in 2006, the public has been learning many of these facts the hard way. to date, 15,037 girls have officially reported adverse side effects from gardasil to the vaccine adverse event reporting system (vaers). these adverse reactions include guilliane barre, lupus, seizures, paralysis, blood clots, brain inflammation and many others. the cdc acknowledges that there have been 44 reported deaths. dr. harper also participated in the research on glaxo-smith-kline's version of the drug, cervarix, currently in use in the uk but not yet approved here. since the government began administering the vaccine to school-aged girls last year, more than 2,000 patients reported some kind of adverse reaction including nausea, dizziness, blurred vision, convulsions, seizures and hyperventilation. several reported multiple reactions, with 4,602 suspected side-effects recorded in total. the most tragic case involved a 14 year-old girl who dropped dead in the corridor of her school an hour after receiving the vaccination. the outspoken researcher also weighed in last month on a report published in the journal of the american medical association that raised questions about the safety of the vaccine, saying bluntly: \"the rate of serious adverse events is greater than the incidence rate of cervical cancer.\" ms. robinson said she respects dr. harper's candor. \"i think she's a scientist, a researcher, and she's genuine enough a scientist to be open about the risks. i respect that in her.\" like be the first to like this post. and i support breastfeeding in public! it is a legal right! ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ be thankful in all things. give god praise all of your days! no matter what each day brings, be happy to serve him in all your ways! simply living to serve and to love, being thankful our treasure is above!"}, {"articleID": "2017030817_00618408_W", "names": {"Razia Khan": ["Q48798641", "Q7299554"]}, "date": "2017-03-08", "url": "http://uzomediangr.wordpress.com/2017/03/08/nigeria-to-cut-stake-in-oil-assets-under-buharis-growth-map-read-full-details/", "content": "proposes in a 2017-2020 economic blueprint to reduce the government's stake in joint-venture oil assets and other holdings. PHOTO: Bloomberg Nigeria plans to sell portions of its oil assets to help fund President Muhammadu Buhari's four-year program to lift the economy from its worst slump in a quarter century and create 15 million jobs. Buhari proposes in a 2017-2020 economic blueprint to reduce the government's stake in joint-venture oil assets and other holdings. Selling them will \"optimise their efficiency and reduce fiscal burden on the government,\" according to the proposal posted on the Ministry of Budget and National Planning's website. Lenders including the World Bank are awaiting the plan to conclude funding facilities for Africa's second-biggest oil producer. The proposed plan targets growth of 7 percent and inflation under 10 percent by 2020 by increasing oil output, opening up new farmland and boosting investment in power, roads and ports to diversify revenue. The economy shrunk 1.5 percent in 2016, the first full-year contraction since 1991, mainly due to a drop in prices and output of oil, the nation's biggest export, and the resulting foreign exchange shortage. The naira weakened after the central bank removed a peg in June, increasing the prices of imports from fuel to food, contributing to the inflation rate rising to the highest in more than a decade. Selling some oil assets \"will help unlock needed resources, so it's positive,\" <mark>Razia Khan</mark>, head of Africa macro research at Standard Chartered Plc in London, said by email. \"But we will have to look at the timeframe over which this is done. Should we expect a slew of quick privatisations, or will this be drawn out?\" Unlock Resources Nigeria has an average 55 percent stake in joint ventures run by Royal Dutch Shell Plc, Exxon Mobil Corp., Chevron Corp., Total SA and Eni SpA, which produce about 90 percent of its crude. The government also owns 49 percent of Nigeria LNG Ltd, a multibillion-dollar company which operates Africa's biggest liquefied natural-gas plant. The government has also hinted it may award concessions for airports. The government aims to increase oil output to 2.5 million barrels a day by 2020 from a low of 1.6 barrels daily in the 2016 third quarter when militants bombed pipelines. This is forecast to boost government revenue by 800 billion naira ($2.53 billion) annually. Some of the additional funds will be used to revamp domestic refineries to raise capacity to a level where the country will turn into a net exporter of refined fuel. \"Hidden' Debt The West African nation raised $1 billion in a Eurobond issuance last month and will probably tap the international bond market for a second time this quarter to raise $500 million. Nigeria will re-balance its debt portfolio to increase the proportion of foreign financing and\" make arrangements to pay off hidden federal government debt, \"according to the plan. The government wants to issue bonds and debt certificates for 2 trillion naira to pay outstanding bills to contractors, ministries, departments and agencies, and state governments, Budget Ministry spokesman Akpandem James said by phone from Abuja, the capital. The plan refers to\" hidden \"debt because some of the liabilities have to be verified before they are paid, he said. Nigeria will\" sustain a market-determined exchange rate \"and monetary policy will be\" aligned with other aspects of the federal government's macroeconomic program, \"according to the plan. The central bank has intervened since August to keep the naira at about 315 against the dollar, after abandoning the peg of 197-199 per dollar. The regulator has increased its key lending rate to a record 14 percent to fight inflation, despite calls from Finance Minister Kemi Adeosun to loosen policy to support the economy. The currency was 0.2 percent weaker at 315.5 by 6:18 a.m. in Lagos, the commercial capital. Power Prices The government will introduce cost-reflective power tariffs to encourage investment in a sector that's heavily indebted and struggling with cash flow. The Ministry of Power, Works and Housing said the government would, from January, guarantee 702 billion naira for state-controlled Nigeria Bulk Electricity Trading Plc to pay for electricity it receives from generating companies and sells to distributors. Nigerian power distributors paid only 27 percent owed to generators in 2017, according to data from the National Bureau of Statistics. The plan proposes reforms including increasing the value-added tax on luxury products to 15 percent in 2018 from 5 percent and improving compliance to add 350 billion naira to annual revenue collections. At least 100,000 hectares of additional arable land will be irrigated, farmers will have better access to fertiliser, a staple crop processing zones authority will be established, and the Bank of Agriculture will be recapitalized to increase loans. This is part of the nation's strategy to boost production to meet domestic demand and export products including rice, cashew nuts, groundnuts, cassava and vegetable oil by 2020. The plan\" ticks a lot of the key boxes and correctly identifies the problems that they have, \"John Ashbourne, an economist at London-based Capital Economics Ltd. said by phone.\" The real question is, will they follow through with this? \"Advertisements Rate this: Like this: Like Loading...Related"}, {"articleID": "2015082417_00037097_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-08-22", "url": "http://www.nationalreview.com/corner/422938/marco-rubio-addresses-anger-gop-electorate-jim-geraghty", "content": "Marco Rubio Addresses the Anger in the GOP Electorate by August 22, 2015 3:22 PM Jim Geraghty If you're Marco Rubio, and you've launched your campaign on a theme of sunny optimism and cheery confidence that America's best days are ahead of it, how do you adjust when the GOP electorate seems to be eagerly embracing the mad-as-hell-and-not- gonna -take-it-anymore style of <mark>Donald Trump</mark>? You take it head on. \"People are rightfully angry and upset,\" Rubio said to \"yeah!\" responses here at the Americans for Prosperity Defending the American Dream Summit in Columbus, Ohio. \"It's good to let that anger motivate us, but we can't let that anger define us,\" Rubio said. \"We're not an angry nation. We're a hopeful nation. What nation would you trade places with? Where would you rather be? This is still a great nation. But we're just not living up to our potential.\" Rubio began by focusing on how \"the economy is changing faster than ever before. The largest retailer in America, Amazon, doesn't own any stores. One of the biggest transportation companies in America, Uber, doesn't own any cars. Our policies are outdated. Big government and more regulation have never worked--and they're a disaster in the twenty-first century.\" Rubio spent a good portion talking about education reform, from the need for a refocus on vocational training, \"We need to give people the skills for the best-paying jobs...I promise you this: A welder makes a lot more money than a Greek philosopher. The market for Roman philosophers has tightened significantly in the past 2,000 years, and our students need to know that.\" \"We don't need a common core curriculum to push that through that,\" Rubio continued, asserting that the education reform had to be directed at the state and local level, with the federal government working \"at the margins. I'm for curriculum reform, at the local and state level.\" He explained Washington money always comes with Washington control. Rubio criticized the \"monopoly on higher education\" where colleges and universities are inflexible to students who need to work, raise children, or have other competing constraints on their time. \"Their message is,\" You need to change to fit in with us, we're not going to change to fit in with you. \"'\" Of course, we still need four-year colleges and universities. How else would we have college football? \"Rubio quipped.\" Although I think the welders could probably field a good team. \"Rubio also spent significant time discussing foreign policy and the threats facing America.\" The Chinese can hack into our computers--one in particular, \"he said as the audience chuckled. Rubio called Vladimir Putin\" a gangster in Moscow is trying to not just divide Europe but destroy NATO. \"He noted ISIS is not just in Iraq and Syria, but in Libya, where he predicted the group will\" springboard across the Mediterranean into Europe. \"And he included North Korea in his list of five major threats:\" We have--I don't use this world lightly--a lunatic in North Korea who possesses dozens of nuclear weapons and missiles that can reach the West Coast. \""}, {"articleID": "2018013015_00765528_W", "names": {"Tim Phillips": ["Q40249374", "Q59309816", "Q7804108", "Q7804110", "Q7804112", "Q7804113"], "Gary Lynch": ["Q21062326", "Q5525497"], "Mark Meadows": ["Q3956796", "Q6768847", "Q6768848"]}, "date": "2018-01-30", "url": "http://www.newdelhitimes.com/kochs-warm-to-trump-policies-not-behavior/", "content": "Kochs warm to Trump policies, not behavior By New Delhi Times Bureau on January 30, 2018 For the Koch brothers and their powerful donor network, the trouble with President Donald Trump isn't what he's doing. It's how he's doing it. Huddled at a private retreat in the California desert, the conservative movement's moneyed elite worried aloud this weekend that the Republican president's undisciplined behavior is clouding his achievements--and making it harder for the GOP to protect its grip on Congress heading into the 2018 midterms. \"President Trump is not helping get many Republicans elected,\" said Tom Shepherd, a Cincinnati-based businessman who joined roughly 550 Koch donors at a private retreat in the California desert this weekend. \"I think he's doing more harm than good because he's distracting people from the good work which is happening, which is either happening because of him or in spite of him.\" The frustration with the unorthodox president comes as the Kochs begin to implement their strategy to protect Republican majorities in the House and Senate this fall. The GOP has no more powerful ally than the vast political and policy network assembled by the Midwestern industrialist icons, long demonized by the left and revered by the right for their short - and long-term efforts to reshape American politics and culture. The Koch network's chief lieutenants renewed their vow this weekend to spend up to $400 million on politics and policy to shape November's midterm elections nationwide. That's more than the combined resources spent by the Republican National Committee, the National Rifle Association and the Chamber of Commerce in the 2016 election cycle. They outlined plans on Monday to spend big on political advertising now through the end of July on as many as 14 key Senate races and 15 gubernatorial elections. Their goal: Flood the airwaves with political messaging early to help shape voters' opinions long before the election season's final months. \"We need to be on offense starting now,\" said Emily Seidel, CEO of the Kochs' political arm, Americans for Prosperity. She said the network has already decided to play in Senate contests in Wisconsin, Indiana, Missouri and Florida--all seats held by vulnerable Democrats. They expect to be active in many more. And on governor's races, they're targeting Nevada, Wisconsin, Illinois, Michigan and Florida to start. The investment includes $20 million to help sell the recently adopted tax overhaul to a skeptical American public through a series of public rallies, phone banking and paid advertising. Despite the extraordinary investment, the men and women who filled the luxury resort outside Palm Springs for a three-day retreat that ended Monday acknowledged a difficult road ahead. Some blamed history more than the regular distractions from Trump. The party in the White House traditionally struggles in the first midterm election of a new presidency. \"It's a challenge regardless of the president,\" said <mark>Tim Phillips</mark>, president of Americans for Prosperity. But the donors who pledged at least $100,000 this year to the Koch network--there were an estimated 550 on hand this weekend--were less cautious when asked about the president's leadership Many opposed his candidacy before the 2016 election. The Kochs refused to endorse Trump, fearing that his style and policies might undermine conservative priorities. \"I didn't support him,\" said Frank Baxter, a retired investment banker from California who served as the ambassador to Uruguay under former President George W. Bush. \"The results are kind of changing my mind.\" Like others, he praised the tax overhaul, Trump's judicial appointments and regulatory cuts. He added, \"I still don't like what he says or does.\" <mark>Gary Lynch</mark>, whose Iowa livestock business employs roughly 700 people, said he and his business have benefited from the Republican tax overhaul. He said, however, that Trump's behavior \"doesn't help\" his party promote the benefits of the plan. \"He hasn't got it down yet,\" <mark>Lynch</mark> said of the president, noting that he doesn't mind Trump's style personally. Another former Trump critic, North Carolina-based donor Art Pope, said he's warming to the president as well. \"The policies of this administration have really benefited the American people,\" Pope said. He's still worried about the political climate heading into the midterms: \"It's going to be a tough election.\" Democrats need to pick up at least 24 seats nationwide this fall to claim the House majority for the last two years of Trump's first term. Recent Democratic wins in Alabama and Virginia, backed by Trump's low approval ratings, suggest the GOP is in trouble. When asked about his party's 2018 prospects, Rep. <mark>Mark Meadows</mark>, R-N.C., among a handful of elected officials who attended the Koch conference, acknowledged that the House majority is at risk. \"I can make the case for losing 18 seats and no more. I can make the case for 28 seats,\" he said. \"It's a long ways off. It depends what we do between now and November.\" As the White House and Republicans nationwide work to highlight the strong U.S. economy, Trump intensified a weekend feud with the rapper Jay-Z on Twitter. The musician said over the weekend the president's recent vulgar comments about African countries and Haiti were \"disappointing\" and \"hurtful.\" Trump punched back on Twitter, urging his followers to inform Jay-Z that \"because of my policies,\" unemployment among black Americans is at the \"LOWEST RATE EVER RECORDED!\" Back at the Koch retreat, prominent Trump donor Doug Deason said he enjoyed the president's social media habits, which allow him to speak directly to the American people. \"I don't think it helps. I don't think it hurts,\" Deason said. He noted that the Koch network would \"spend a lot of money\" to ensure the benefits of the tax overhaul aren't overshadowed by any distractions. \"Who gives a crap about Jay-Z?\" Deason asked. \"I don't.\" Credit: Associated Press (AP) | Photo Credit: (AP)"}]