[{"articleID": "2018010409_00071074_W", "names": {"Kate Hudson": ["Q169946", "Q6375550"]}, "date": "2018-01-04", "url": "http://www.fashion.ie/fabletics-demi-lovato-new-collaboration/", "content": "0 comments Fabletics and Demi Lovato team up for new collaboration. American singer, Demi Lovato has designed her third capsule collection for Fabletics. The \"Confident' beauty has teamed up with <mark>Kate Hudson</mark>'s label for the third time, and her latest range includes footwear and two athletic bags for the first time. Demi said:\" I was so excited when Fabletics asked me to come back to design another capsule collection with them! \"I've learned so much from working with the Fabletics design team the past year and really wanted to take it to the next level with this collection now that I'm more confident with the process .\" And the 25-year-old star thinks the collection--which features tops, shorts, sports bras and other layering pieces with bold straps, metallic and textured mesh details--is closer to her own style than ever before and reflects the needs and wants of her fans. She added: \"I think that this collection reflects my personal style more than ever .\" It was also very important to me to incorporate all of the feedback I've received from my supportive fans. I made sure to include different elements and details into the collection that were not only important to me but to them as well. \"And Fabletics executives are delighted with the results of Demi's latest foray into design. Felix del Toro, Senior Vice President, chief merchandise and design officer for the company, said in a statement:\" Demi's leveraging her creative abilities, and has become more confident as a designer. \"In approaching this collection she channeled what she and her fans are looking for in activewear pieces which support her life as a confident woman .\" Fashion. ie is a 100% owned Irish fashion website that offers the latest Celebrity News and Fashion News to our users. Fashion. ie also gives our users the opportunity to purchase selected, high quality goods directly from our wide range of fashion affiliates. An important note to remember is that Fashion. ie is an affiliate sales website that offers users, links to accredited fashion websites on the Internet. Fashion. ie takes no responsibility or liability for any transaction between user and each fashion vendor. It is the sole responsibility of each user to ensure they are completely happy to interact and trade with each on-line fashion vendor. Fashion. ie would also advise all users to check for the correct sizes of items as well as delivery and returns policy of each vendor prior to purchasing items from them. Don't forget to follows us on social media. If you enjoy shopping for Ladies fashion, Men's fashion, or Teenage fashion then look around our site and enjoy!. Fashion. ie features Fashion news, Irish fashion news, entertainment news, Celebrity news, Online shopping and Irish fashion. Fabletics and Demi Lovato team up for new collaboration."}, {"articleID": "2015012200_00003952_W", "names": {"Brian Lewis": ["Q16107026", "Q4964500", "Q912567"], "Nick Taylor": ["Q16195356", "Q18128640", "Q20190704", "Q30084790", "Q59569480", "Q7028023", "Q7028025"]}, "date": "2015-01-21", "url": "http://highschoolsports.mlive.com/news/article/5991375050680989442/jackson-northwest-senior-bowler-brian-lewis-fires-300-game-in-victory-over-jackson/", "content": "JACKSON--<mark>Brian Lewis</mark> stepped up in the fifth frame of the second game Wednesday, rolled his bowling ball at the pins and sent all 10 of them scattering for a strike. His Jackson Northwest High School bowling coach, Gerry Lobdell, responded by saying, \"About time .\" The well-timed joke drew a dry smirk from Lewis, who had a spare the frame prior--and 15 straight strikes before that. Lewis, a senior, rolled the first 12 strikes of the first game of a match against Jackson at Airport Lanes for a 300 game. He added three more strikes to start the second game before a solid 9-pin ended his bid at a second perfect game. But his first game had the place jumping and everybody buzzing when it was over. \"The 10th frame, it was pretty scary but a great feeling,\" said Lewis, who led his team to a 26-4 victory over Jackson. \"The first one was pretty good, the second one was pretty good and the last one got a little inside, but it held in there and got the job done .\" Lewis is the seventh high school boys bowler to roll a 300 game this season, as reported to the Michigan High School Bowling Association website. Lewis also joins a list of recent Northwest bowlers to record 300 games in high school matches, joining Sierra Lasky in 2014, Corey Daniels in 2012 and <mark>Nick Taylor</mark> in 2011. Teammate Trevor Simons had a 300 game in November during the Greater Jackson USBC youth city tournament at Brooklyn Lanes, bowling with Lewis and fellow seniors Chris Salkowski and Tyler Ockert. Lewis remembered the moment Simons got his perfect game. \"It was awesome to watch,\" Lewis said. \"I felt kind of proud, it was cool. I was like,' I want to go get one of those .'\" Bowling with a Roto Grip Hyper Cell he also used to shoot his previous high game of 289 during a Youth Masters tournament, Lewis packed the pocket 12 straight times in the first game. He showed no nervousness, even as the crowd went silent in the late-going. \"The 10th frame was when they really got bad,\" he said of the nerves. \"When I was going up for the last one, I thought I was having a seizure. I wasn't sure, but that's what it felt like. Up until then, it wasn't too bad .\" In the crowd for his feat were his parents, Terry and Nancy Lewis, his girlfriend, and a large gathering of Northwest supporters. He said picking up his first perfect game with his team was the way he would have drawn it up. \"It's awesome getting to celebrate with the guys,\" Lewis said. \"It's nice having their support .\" Lewis finished the second game with a 213 for a 513 two-game series for Northwest (3-1). Simons, incidentally, had a solid day on the lanes himself, firing scores of 258 and 243 for a 501 series. Rob Dunham added games of 205 and 243 for the victors. Jackson (4-3) was led by Drake Csage with games of 257 and 235 for a 492 series, Joseph Bleiler with 213 and 223 (436) and Jacob Oberst with 236 and 188 (422)."}, {"articleID": "2017050719_00872854_W", "names": {"Ramon Diaz": ["Q348557", "Q6099558"]}, "date": "2017-05-07", "url": "http://www.gulf-times.com/story/547180/Rayyan-face-make-or-break-clash-with-Saudi-s-Al-Hi", "content": "Rayyan face make-or-break clash with Saudi's Al Hilal May 07 2017 10:13 PM Al Rayyan coach Michael Laudrup. Text Size: A By Sports Reporter/Doha Al Rayyan face a tightrope situation when they take on already qualified Saudi giants Al Hilal in their Last Group D clash in the Asian Champions League in Doha today. A win will help Michael Laudrup's team top the group, while a loss, combined with a victory for Iran's Persepolis over the UAE's Al Wahda, will see them miss out on a spot in the last 16 of the lucrative continental championship. A draw will be helpful only if Persepolis go down to Al Wahda. With seven points from five matches, Al Rayyan are in second spot behind Al Hilal who have nine. Third placed Persepolis have six from five and Al Wahda have four. It's a peculiar situation that means even bottom-placed Al Wahda have a slim hope of making the knockouts. \"We have to ensure we win against Al Hilal and qualify on our own rather than depend on the other result,\" Al Rayyan coach Laudrup said yesterday. \"We are quite confident that we can overcome the challenge from Al Hilal,\" the Dane added. Al Rayyan last week booked their semi-final slot in the Emir Cup, but are still smarting from the 5-1 thrashing they suffered at the hands of Al Wahda that revived the UAE side's chances of a last 16 spot. Al Rayyan also lost to Al Hilal earlier in the group stage when when they went down 2-1 in Riyadh, the winning goal coming from a penalty in the sixth minute of second-half stoppage time. \"We were unlucky to concede a penalty then. Hope our luck changes this time,\" added Laudrup, who will be banking on their South American professionals to progress to the knockouts for the first time in history. Al Hilal, on the other hand, have better pedigree. The winners of several regional titles, they finished runners-up in the 2014 Asian Champions League but were champions in 1991 and 2000 when the tournament was called the Asian Club Championship. Unbeaten Al Hilal have posted two wins and three draws from their five games on the continent to book their place in the last 16 with a match to spare, but must gain at least a point against second-placed Al Rayyan to advance as table-toppers. They have several quality players in their line-up, including Yasser al-Shahrani, who is hoping that the memory of the 2014 defeat in the final to Western Sydney Wanderers can spur them on to greater heights this season. \"I can't describe exactly how I was feeling at the time,\" reflected defender Al Shahrani, who was just 22 when competing in his first and, to date, only AFC Champions League final. \"I was a very young player and even though I had the support of all the experienced players at Al Hilal, I felt the pressure because I wanted to compete well and put in a good performance .\" I think that the group did well to get to the final but I hope we can do that again this year because last time we didn't win it. \"The following year Al Hilal again performed admirably before ultimately being ousted in the semi-finals by the United Arab Emirates' Al Ahli, although last year's Round of 16 defeat to Lokomotiv failed to match expectations. <mark>Ramon Diaz</mark>'s side, though, are again likely to be among the strongest contenders from the West, having yet to taste defeat on their march to the knockout round and boasting a squad replete with Saudi internationals .\" Our players have good experience in the ACL as it's not the first time we have participated in it, \"added Al Shahrani, who has missed the previous two Group D games. Meanwhile, an exciting encounter is expected at Azadi Stadium in Tehran today as Persepolis host Al Wahda. Early pacesetters Persepolis have suffered a dip in form of late, picking up just two points from a possible nine, and must win to have any chance of progression. The Iranian champions welcome back captain Jalal Hosseini and Soroush Rafieitelgary from suspension for the crunch tie."}, {"articleID": "2019041122_00161251_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-04-11", "url": "http://www.gamereactor.eu/games/11347/Rainbow", "content": "RAINBOW SIX: SIEGE REVIEW. Written by Anders Mai on the 30th of November 2015 at 11 \"It's in competitive multiplayer where the game shines. The matches are short, intense and always surprising .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 9th of April 2019 at 12:19 The April Fools' event has clearly gone down well with fans, who now have more time to enjoy the colourful playlist. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 3rd of April 2019 at 09:51 The bright and sparkly event has landed to celebrate April Fool's, and we tried the special variant of Hostage with toy soldiers. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 2nd of April 2019 at 09:01 Rainbow is Magic introduces a new hostage situation in Plane to rescue a teddy bear, alongside some eccentric customisation items. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 27th of March 2019 at 09 Kaid, Maverick, Nomad, and Clash are getting skins, charms, headgear, and uniforms to celebrate the Pro League competition."}, {"articleID": "2018101819_00233314_W", "names": {"Qing Chen": ["Q57754358", "Q59452713", "Q59597636"]}, "date": "2018-10-18", "url": "http://thechronicleherald.ca/more/custom-content/a-bright-way-to-increase-sales-251417/", "content": "A bright way to increase sales Sponsored content Published: 35 minutes ago Updated: 1 minutes ago All of the lighting was replaced in July at Hometown Furniture & Mattress in Dartmouth, and they have already seen incredible savings in their monthly power bills. - Contributed Energy-efficient lighting boosts sales at Dartmouth furniture store After recently upgrading to energy-efficient LED lighting in his Dartmouth store, <mark>Qing Chen</mark> was thrilled to see his power bill go down--and his sales figures go up. \"We had the lighting replaced in July, and then we had record-breaking months in August and September because of it,\" says <mark>Chen</mark>, the owner of Hometown Furniture & Mattress. \"The old lighting made the store feel dark and not inviting. Now our furniture looks much better, and our customers are enjoying their shopping experience .\" <mark>Chen</mark> had been paying steep energy bills just to keep the lights on in his 10,000-square-foot store, and the ancient lights were dim and dreary. It was his friend--a fellow small business owner--who suggested he reach out to Efficiency Nova Scotia and inquire about their Small Business Program. \"When I heard I could switch to energy-efficient LED lighting and Efficiency Nova Scotia would cover up to 60 per cent of the cost, I couldn't believe it,\" says <mark>Chen</mark>. His business saw a savings of more than 13,000 kWh, which equates to an estimated savings of just over $1,200 per year--cutting the power bill nearly in half. <mark>Chen</mark>'s employees love the new lighting, too, since it makes for a more comfortable environment and allows them to work more safely. \"They thought I'd spent a lot of money to make everything so nice and bright,\" says <mark>Chen</mark>. \"They were so surprised to hear the new lights were actually saving us money, because the store has never looked better .\" He's so happy with Efficiency Nova Scotia that he's talking them up whenever he meets another small business owner. \"I went to a convenience store the other day and the owner and I got to talking about power bills,\" says <mark>Chen</mark>. \"He was paying what I used to pay, and his store is maybe 1,000 square feet and mine is 10,000 square feet. I said,\" That's not right. You have to call Efficiency Nova Scotia! \"' <mark>Chen</mark> is preparing to open a second Hometown Furniture & Mattress in Bayer's Lake, and he's already contacted Efficiency Nova Scotia to help with upgrades there, too. While he'll enjoy the savings on his energy bill, he says the most important reason for the upgrade is to make his store the best it can possibly be .\" It's so important for a store to have the right atmosphere, \"says <mark>Chen</mark>.\" You need to create a bright, welcoming environment so your customers want to browse and stay a while. \"More custom-content stories"}, {"articleID": "2017062321_00267549_W", "names": {"Matt Moore": ["Q1101172", "Q16221920", "Q2698927", "Q6789087"], "Boris Becker": ["Q76334", "Q893625"]}, "date": "2017-06-22", "url": "https://uk.news.yahoo.com/legalised-marijuana-linked-rise-auto-220519741.html", "content": "Marijuana dispensary More A new study found that states with legalized recreational use of marijuana have an increase in accident insurance claims. The study, conducted by the Highway Loss Data Institute looked at three states: Colorado, Oregon and Washington. According to the study, the number of vehicle collisions reported to insurance companies in the three states is at least 3% higher than what would have been expected if marijuana had not been legalised. However, the study did not indicate whether the increase in collisions were directly caused by drivers who were under the influence of marijuana. Trending: Luxury Kensington Row residents complain Grenfell Tower victims \"will lower house prices'\" We're concerned about what we're seeing, \"<mark>Matt Moore</mark>, the institute's senior vice president, said .\" We see strong evidence of an increase crash risk in states that have approved recreational marijuana sales. \"CNBC noted that the study also did not look at highway fatality rates in states where marijuana use is legal. Don't miss: Holocaust survivor stops Orthodox Jews demanding women move seats on El Al flights The institute compared collision claims before and after legalisation, with collision claim rates of comparable states where marijuana is still illegal, to determine whether collision rates are higher than they would be if recreational use was still illegal. The study found that collision claims following legalisation are up 16% in Colorado, 6.2% in Washington and 4.5% in Oregon. Most popular: <mark>Boris Becker</mark>'s\" five second sex' in a cupboard has cost him his fortune \"Colorado has had legal pot sales the longest and it is showing the greatest effect,\" <mark>Moore</mark> said. \"Meanwhile, Oregon has had pot sales for the shortest amount of time, so its increase is the lowest, but that could change over time .\" The study was released as more states consider legalising marijuana sale, CNBC reported. While questions regarding marijuana use and auto collisions have emerged in states that have approved of cannabis for recreational use, they are difficult to answer. CNBC reported that field sobriety tests to check drivers specifically for marijuana do not exist. <mark>Moore</mark> also noted that drivers who test positive for having THC often have alcohol in their systems too. \"We're concerned about impaired driving in general,\" <mark>Moore</mark> said. \"Marijuana just layers on top of other impairments like alcohol .\" Eight states, as well as Washington DC, have legalised recreational marijuana sales. You may be interested in: Michigan airport stabbing suspect tried to buy a gun but was rejected \"because he's not American' Canadian sniper kills Isis militant with\" world record-breaking 2 mile shot' F-16 pilot forced to eject from flaming plane in Texas Legalised marijuana linked to rise in auto collisions"}, {"articleID": "2018101214_00051834_W", "names": {"Billy Mcfarland": ["Q18044835", "Q4912992"], "Barry Jenkins": ["Q2383951", "Q26821227", "Q2885745"], "Ed Harris": ["Q104791", "Q16729663"], "Gordon Ramsay": ["Q15280", "Q22279905", "Q27557641"], "Mike Nelson": ["Q1933393", "Q3857428", "Q6848173"]}, "date": "2018-10-12", "url": "https://www.bizbash.com/october-12-2018-fyre-festival-organizer-sentenced-to-six-years-in-prison-inside-the-us-premiere-of-if-beale-street-could/new-york/story/36332", "content": "1. FYRE FESTIVAL ORGANIZER SENTENCED TO SIX YEARS IN PRISON: <mark>Billy McFarland</mark>, the organizer of the infamous Fyre Festival, was sentenced Thursday in Manhattan federal court to six years in prison for the disastrous event in 2017. Page Six: \"The 26-year-old scam artist, who pleaded guilty in two cases since his 2017 music fest he planned with Ja Rule fell apart, had faced up to 20 years at his sentencing .\" I'm sorry, I am deeply sorry for my mistakes,' <mark>McFarland</mark> told Judge Naomi Buchwald in court, where his father sat crying along with other family members .' I betrayed the trust of investors, family and even the court. I come from an incredible family--a loving environment, they [family] tried to teach me the value of family and friends,' added <mark>McFarland</mark>, who also faces a $26 million forfeiture order ....In March, <mark>McFarland</mark> copped to two counts of wire fraud for using bogus documents to lure investors to what was billed as a luxe festival on the island of Exuma island in April and May of 2017. About four months later, the Short Hills, New Jersey, native pleaded guilty to another fraud in a fake ticket-selling scheme he admitted to carrying out while he was out on bail. He earned about $100,000 by selling the bogus tickets to exclusive events such as the 2018 Met Gala and Burning Man. \"https: //pge.sx/2OZda20 2. INSIDE THE U.S. PREMIERE OF\" IF BEALE STREET COULD TALK' AT THE APOLLO THEATER: On Tuesday night, James Baldwin was celebrated in Harlem, his neighborhood of birth, as part of the 56th annual New York Film Festival. The U.S. premiere of If Beale Street Could Talk, <mark>Barry Jenkins</mark>' film adaptation of Baldwin's novel of the same name, took place at the historic Apollo Theater. The Atlantic: \"The significance of hosting the stateside premiere of Beale Street at the legendary Harlem auditorium was not lost on <mark>Jenkins</mark>.\" James Baldwin was born and raised in Harlem, this book is set in Harlem, it was filmed in Harlem,' the director said during a brief introduction preceding the screening. \"The first time it shows in the U.S. had to be in damn Harlem!' <mark>Jenkins</mark>, who directed the Oscar-winning 2016 picture Moonlight and the 2008 indie romantic drama Medicine for Melancholy, spoke with warmth as he introduced the cast of the film, whom he called\" the village of If Beale Street Could Talk .' As they gathered, the Liberty City, Miami--bred <mark>Jenkins</mark> turned the mic over to members of the Baldwin family. Standing onstage in the Harlem venue, several of Baldwin's relatives spoke about the writer's legacy and the film's place in it. Karim and Aisha Karefa-Smart, Clarence <mark>Harris</mark>, and Trevor Baldwin all shared their accounts before the film played ....At the after-party following the Apollo screening, held at the Lenox Avenue mainstay Red Rooster, cast members and crew drank and danced alongside audience members. Macaroni and cheese, hot honey chicken, cornbread madeleines, and grits nourished the filmgoers who'd been physically (and emotionally) spent. \"https: //bit.ly/2pQ4T2b 3. SALT LAKE COMIC CON SAYS COURT-ORDERED PAYMENT OF $4 MILLION IN TRADEMARK WAR WILL\" DESTROY' THE EVENT: The producers of the Salt Lake City comic convention fear for the event's future, and Utah's economy, after they were given a court order to pay $4 million in a trademark infringement war with San Diego Comic-Con. The Salt Lake Tribune: \"Dan Farr Productions, the company behind the FanX Salt Lake Comic Convention, filed an emergency motion with the U.S. 9th Circuit Court of Appeals on Wednesday, asking for a temporary postponement on the payment pending appeal in court. If the $4 million judgment is enforced, the company will be\" destroyed,' the motion states, costing Utah's economy \"millions of dollars .' But the court\" likely wouldn't harm' the other party--San Diego Comic-Con, by granting a stay. The California-based convention sued the event formerly known as Salt Lake Comic Con in 2014 about the use of \"comic con' in the Utah company's name. San Diego Comic-Con's legal team argued that even without the hyphen, those words infringed on its own trademark and confused people into thinking the events were associated. A federal jury sided with San Diego Comic-Con at the end of last year but found there had been no willful infringement and awarded FanX a slight break on attorney fees. The jury awarded $20,000 in damages to San Diego Comic-Con, which had originally sought $12 million, and $3.9 million in attorney fees and costs rather than the $5 million its lawyers had initially asked for. Still, the Utah-based company said in its motion Wednesday that the\" nearly $4 million award is wildly excessive .' The producers of FanX are also protesting a judgment that FanX stop using the phrase \"formerly known as Salt Lake Comic Con' in advertising and social media and delete any posts before the court ruling that refer to their event as\" comic con .' \"https: //bit.ly/2OlTNAF * INDUSTRY NEWS * AccorHotels has completed its acquisition of a 50-percent stake in Sbe Entertainment Group. Sbe founder and C.E.O. Sam Nazarian will control the remaining 50 percent. * LOCAL NEWS * ATLANTIC CITY: Caesars Entertainment has announced new restaurant concepts at its Atlantic City properties. Harrah's Atlantic City has debuted <mark>Gordon Ramsay</mark> Steak, which seats 280 guests; Caesars Atlantic City has debuted a bar and lounge called 2100 Bar & Lounge; and Bally's Atlantic City has debuted surf-inspired bar Bally's Beach Bar. CHICAGO: Viceroy Chicago hotel has launched\" Designer Doors for Charity, \"a monthlong installation that showcases doors on the fifth floor painted by eight local artists, each depicting an interpretation of the fight against breast cancer. A portion of revenue from each room booked on the floor throughout October will be donated to the Lynn Sage Cancer Research Foundation. AIC Hotel Group has announced plans to open a 100-key Nobu Hotel this spring in the city's Fulton Market district. That's in addition to Nobu Hotel Los Cabos, the brand's first property to open in Mexico, slated to open in early 2019. Chicago Children's Museum will unveil its renovated meeting and event spaces on October 16. LONDON: BMF Media Group has opened a London office to expand its global footprint. Craig MacIntyre will lead the London office and the continued expansion. LOS ANGELES: The inaugural Wellspring from Wanderlust Wellness Conference takes place October 26-28 at the Palm Springs Convention Center. The event will feature more than 200 workouts, lectures, workshops, and panels from Glennon Doyle, Marianne Williamson, Alicia Silverstone, and more. Hotel Indigo Los Angeles Downtown has partnered with Baron Hats to host a monthlong pop-up shop October 18 through the end of November. The shop will showcase Baron Hat creations, including those worn by Beyoncé during her Formation Tour, Sylvester Stallone in Creed, Harrison Ford in Indiana Jones, and <mark>Ed Harris</mark> in Westworld. Attendees will be able to purchase hat replicas and order a customized hat. For information on upcoming events in Los Angeles, visit Masterplanner: http: //www.masterplanneronline.com/losangeles NASHVILLE: Water and music attraction SoundWaves will open at Gaylord Opryland Resort in December. The venue will have 106,000 square feet of outdoor water attractions and 111,000 square feet of indoor attractions including lazy rivers, rock climbing, restaurants, and an adults-only indoor pool, bar, and lounge. NEW YORK: Lufthansa will host Fly Through Time, an interactive consumer pop-up, on Sunday at Duarte Square. The activation will feature a 1950s-theme Lufthansa terminal set; an interactive model of the 1958 Lufthansa Super Constellation\" Senator Service \"first class onboard lounge; an augmented-reality mirror where guests can virtually dress in vintage uniform and passenger styles; an A.R. model of the first-ever luxury transatlantic flight; and a life-like boarding scenario. The New York Civil Liberties Union (N.Y.C.L.U.) will host its 16th annual Broadway Stands Up For Freedom concert We The People on October 15 at Town Hall. Alan Cumming will receive the 2018 Freedom Award. The fourth annual Through Her Lens: The Tribeca Chanel Women's Filmmaker Program, in collaboration with Pulse Films and Tribeca Film Institute, will take place October 16-18. The three-day program provides mentorship, project support, and master classes for 10 emerging female filmmakers and awards $100,000 in grants. Meatpacking District's annual Harvest Fest will take place October 27. The event will feature bites from neighborhood restaurants including Fig & Olive, Santina, and Dos Caminos. For information on upcoming events in New York, visit Masterplanner: http: //www.masterplanneronline.com/newyork RALEIGH, NORTH CAROLINA: Visit North Carolina has named J Public Relations its PR agency of record. VANCOUVER: In Goop Health will have its first Vancouver edition October 27-28 at Stanley Park Pavilion. WASHINGTON, D.C.: Sage Hospitality has appointed <mark>Mike Nelson</mark> general manager and Portia Hood director of sales and marketing to the Alexandrian Hotel and Morrison House. YOUR NEWS: What are you doing? Tell us: tips @ bizbash.com. JOB BOARD: Post a job or find a job: http: //jobs.bizbash.com With contributions from Claire Hoffman in Los Angeles and Beth Kormanik, Michele Laufik, and Ian Zelaya in New York. BizBash Daily is the must-read digest of event industry news from BizBash.com. Feed the Sheet: tips @ bizbash.com Subscribe: www.bizbash.com/bizbashdaily Advertise with BizBash: n_peck @ bizbash.com"}, {"articleID": "2009091004_00087201_W", "names": {"Ryan Moore": ["Q1872114", "Q2162566", "Q27924819", "Q7384355", "Q7384356", "Q7384357", "Q7384365"]}, "date": "2009-09-10", "url": "http://the-leader.com/homepage/x507078374/Campbell-Savona-Jasper-Troupsburg-play-to-1-1-tie", "content": "campbell-savona, jasper-troupsburg play to 1-1 tie photo by jason cox | the leader campbell-savona's mitchell allen, left, collides with jasper-troupsburg's craig quick. \"> campbell-savona's mitchell allen, left, collides with jasper-troupsburg's craig quick. photo by jason cox | the leader jasper-troupsburg's evan cornell, left, and tyler van sickles, right, chase down campbell-savona's kyle knowles (8).\" > by the leader staff corning leader campbell, n.y. - a pair of steuben county foes each seeking its first win of the season wednesday had to settle for a tie. thomas knapp netted an unassisted goal in the first half to give campbell-savona the lead at the break, but jasper-troupsburg got the equalizer when zach prutsman scored on a penalty kick with 20 minutes remaining in the second half. following a pair of scoreless 10-minute sudden-death overtime periods, the panthers and wildcats left the field with a 1-1 tie. \"both teams played really hard and it was a physical game - we were unlucky,\" campbell-savona head coach mike eckstein said. \"my guys had a great passing game, we just couldn't capitalize on a lot of our shots .\" the panthers did, however, capitalize when knapp took a through-ball pass, trapped the ball and sent in a shot from just inside the 18 yard line. the wildcats knotted the contest at 1-1 when prutsman scored on a penalty kick in the second half. campbell-savona outshot jasper-troupsburg 12-7 and panthers' goalie caleb drumm made four saves, while brennan thurber turned back eight shots for the wildcats (0-1-2). \"brennan is a terrific goalie and he played well,\" eckstein said of thurber. eckstein also offered high praise for his own defense. \"<mark>ryan moore</mark> played really well at striker and my defense played really tough - they played phenomenal,\" eckstein said. the corning leader, 34 w. pulteney st., corning, ny 14830"}, {"articleID": "2009112110_00013886_W", "names": {"Kevin Johnson": ["Q16197018", "Q1740182", "Q18630838", "Q18921997", "Q203286", "Q25413017", "Q28806784", "Q39070237", "Q448375", "Q6396616", "Q6396617", "Q6396618", "Q6396620", "Q6396621", "Q6396622", "Q6396623"], "Glenn Howard": ["Q16194596", "Q5568877", "Q5568881"], "Paul James": ["Q1558855", "Q3898091", "Q503399", "Q53997267", "Q5827750", "Q7151541", "Q7151542", "Q7151543", "Q7151544", "Q7151545"]}, "date": "2009-11-21", "url": "http://philly.com/r?19=961&43=168421&44=70687427&32=3796&7=195227&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Fhigh_school%2Fnew_jersey%2F20091121_Paulsboro_stuns_Glassboro__35-0.html", "content": "the group 1 semifinal between paulsboro and glassboro was billed as a showdown between two perennial powerhouse teams. it should have just been billed as \"the <mark>kevin johnson</mark> show,\" and as a comedy instead of a suspenseful drama. <mark>johnson</mark>, the paulsboro quarterback, led his team to a 28-point halftime lead and the red raiders eased into the group 1 state championship with a shocking 35-0 upset over the two-time defending state champs last night. \"we knew we had to make a statement early,\" said <mark>johnson</mark> who, in the first half, rushed four times for 72 yards and a touchdown while completing five of six passes for 127 yards. \"we lost to this team in the playoffs two years in a row, so we came out and really wanted this win tonight and we got it .\" after a scoreless first quarter, paulsboro running back eric mcmullen scored on a 5-yard run 52 seconds into the second quarter. that touchdown, like every other paulsboro drive in the first half, was set up by a huge play from <mark>johnson</mark>. after completing a 45-yard pass to sean mcclain on his team's first scoring drive, <mark>johnson</mark> opened up his team's next drive with a 54-yard touchdown run, putting paulsboro ahead 14-0 with 9:48 left in the half. \"he was just fantastic,\" said paulsboro coach <mark>glenn howard</mark>. \"returning punts, running the ball, throwing the ball, what can you say? we thought we'd have some opportunities to make some big plays today and [<mark>johnson</mark>] proved us right .\" while <mark>johnson</mark> was torching the glassboro defense, the paulsboro defense had little trouble containing a lifeless glassboro offense. after recording a first down on its first drive, the bulldogs went three-and-out on four of their next five drives stretching into the third quarter. glassboro did not record its second first down until after the mercy rule had taken effect with paulsboro ahead, 35-0. \"our defensive plan was that we knew we had to shut down [glassboro running back <mark>paul james</mark>],\" <mark>howard</mark> said. <mark>james</mark> finished with 92 yards on 15 carries. \"he's an outstanding back, and he knew we had to contain him. that was our main concern,\" <mark>howard</mark> said. when <mark>johnson</mark> wasn't making big plays for the red raiders, running back aaron tilden was. tilden rushed 14 times for 70 yards and two touchdowns. paulsboro 0 28 7 0 - 35 glassboro 0 0 0 0 - 0 p: eric mcmullen 5 run (mike maccarone kick) p: <mark>kevin johnson</mark> 54 run (mike maccarone kick) p: aaron tilden 14 run (kick failed) p: aaron tilden 4 run (sean mcclain pass from <mark>kevin johnson</mark>) because your contributions are currently under review, no comments can be made at this time. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the \"report abuse\" button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. account update needed you must indicate according to our terms of service, you are not yet of legal age to be able to contribute to this site. thank you for registering! please note that your registration will not be considered fully complete until you confirm by following the link we have provided in a confirmation email that was just sent to"}, {"articleID": "2015122201_00196671_W", "names": {"Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}, "date": "2015-12-22", "url": "http://www.stuff.co.nz/entertainment/film/75372289/leonardo-dicaprio-praises-the-revenant-director-over-bear-attack-scene", "content": "Leonardo DiCaprio praises The Revenant director over bear attack scene Last updated 14:10, December 22 2015 20th Century Fox Leonardo Di Caprio put himself through a lot for his latest role including sleeping in an animal carcass. Leonardo DiCaprio has praised The Revenant director Alejandro Inarritu's work in creating a key scene so unsettling that sparked mischievous rumours it showed the actor's character being \"raped\" by a bear. \"People are talking about it because it's something incredibly groundbreaking...[they] are responding to it because it's unlike anything they've seen in cinema ever really,\" DiCaprio told ABC's 7.30 Report. \"[Inarritu allows] the audience to be in a very raw violent savage bear attack yet feel the intimacy of both man and beast, you feel the sweat and the heat coming off of the animal. Leonardo DiCaprio in The Revenant. READ MORE: * The Revenant: No, Leonardo DiCaprio is not raped by a bear, says Fox * Leo DiCaprio slept in an animal's carcass * Critic roasted for suggesting The Revenant\" not for women' * <mark>Tom Hardy</mark> tackled fear of horses for The Revenant \"I'm not at liberty to speak about exactly how [Inarritu] pulled this off but I will say that it involved months of rehearsal [and] watching 100 different bear attacks .\" On December 1 popular American news aggregation website The Drudge Report claimed of the pulsating scene: \"The bear flips Leo over and thrusts and thrusts during the explicit mauling. He is raped - twice!\". Several entertainment bloggers and social media followed suit. The bear scene from The Revenant. Fox studios denied the claims to The Hollywood Reporter: \"There is clearly no rape scene with a bear\". It also pointed out the attack happens because the female bear is protecting her cubs. The Revenant opens in New Zealand cinemas January 7. Ad Feedback - Sydney Morning Herald Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Film story: Star Wars whopping pay gap: Harrison Ford reportedly made 50x that of his co-stars Entertainment Homepage Comments"}]