[{"date": "2015-09-21", "url": "http://www.wehoville.com/2015/09/21/opinion-lets-not-turn-santa-monica-boulevard-into-rodeo-drive/", "content": "Mon, Sep 21, 2015 By Larry Block 2 Comments Perhaps you know me as the owner of BlockParty. It's the only place in town to get a West Hollywood tee shirt or magnet. It's a place of hometown Pride. Our lease expired a year ago and we have been month-to-month since. When I heard \"Flap Jack Johnnies\" --a Bible Belt pancake house--had signed a letter of intent to occupy my location I lamented the changes in our neighborhood. I've been fighting and fighting to protect WeHo's historic Boystown and honor its legacy by promoting the idea of an LGBT square at the corner of San Vicente and Santa Monica boulevards and lobbying for the rainbow flag on City Hall to protect what makes us so special as a city. But lets face it, landlords want maximum rent dollars and Triple-A rated tenants. Larry Block. As a local retailer concerned about the neighborhood, I wondered if the proposal by City Council members Lauren Meister and John Duran to limit chain stores from opening in West Hollywood was to protect a store like mine. If so, I wish either of them would have asked my thoughts or listened to my concerns these past few years. The proposal would ban or limit stores with more than 12 locations--what they are calling \"formula\" retailers--from opening in West Hollywood. The Subway store around the corner from you is probably a locally owned franchise with a national brand name. Is that a \"formula\" retailer that should be banned? And some Subway stores are also company-owned. How do Meister and Duran propose that we pick and choose among these? Or is this idea geared toward national chains such as Target or Best Buy or drugstore chains like CVS and Rite Aid? These national mass merchants bring low prices to local consumers through economy of scale. Do Meister and Duran want us all to shop outside West Hollywood's borders to save a buck so that we can afford to live here? A ban on chain stores is an assault on the free market system. If the federal government adopted rules like that, our form of government would no longer be free market capitalism. The staff report cites San Francisco and Malibu as examples of the ban on \"formula\" retailers. But those cities aren't like us. (Those cities didn't adopt a fur ban or ban short-term vacation rentals or ban the circus from coming to town .) West Hollywood is a little dot in the middle of Los Angeles. We are interdependent with our neighboring communities for most goods and services. Major restrictions or a ban on chain stores are not the way to protect the culture and integrity of our city. Forcing people on low incomes, or seniors and those with disabilities to travel outside our borders to meet their needs does not protect our community. Why not welcome a Staples or Office Depot to Movietown Plaza rather then have every dollar spent by a West Hollywood business on office supplies going outside our city boundaries. Millions of dollars in sales tax revenue lost--valuable money that could be used to increase our social services budget or fund mass transit. Local jobs for our residents can help to decrease commutes and ease traffic congestion. Let's consider one formula retailer \"Target' ed\" by this proposal. Target was a winner of our city's Disability Service Award. Target is a leader in hiring transgendered employees. John D’Amico has said many times: \"We export the culture that the world consumes .\" So why not welcome every chain to West Hollywood to help them implement a national push for gay and transgender rights in the workplace. Let's not build a wall between West Hollywood and our neighbors. Let's be open for business and welcome those who want to embrace our community. \"Formula\" store regulation adds political dynamite to opening a business within West Hollywood. Businesses that need permission to open here might find that a donation to a City Council member can win them an approval. It's a new way to pay for play in West Hollywood. Besides, are we going to have to hold a hearing on every store that applies to open in West Hollywood that is part of a chain? Banning chain stores with Triple-A bond ratings from opening in West Hollywood will kill development. Could that be the main goal behind Meister's proposal--to stop all development dead in its tracks? I'm not even sure she realizes the force behind this idea. Do Meister or Duran understand real estate financing? Remember hearing the initials MBS during the financial crisis? They stand for \"mortgage-backed securities\". Commercial mortgage-backed securities (CMBS) are a type of security backed by commercial mortgages rather than residential real estate mortgages. . Without the ability to lease to Triple-A tenants, property owners and developers will not be able to borrow at the lowest interest rates to raise the money to fund new projects or sell these projects to investors. The ban or restrictions on chain stores will create fear in those thinking of financing and building in West Hollywood. There are things we can do to protect and preserve the culture and integrity of our small business community--safe crosswalks, free parking such as <mark>Beverly Hills</mark> offers to welcome consumers. The city charges me special event permit fee of $180 to have a sidewalk sale--milking every little business promotion. Code enforcement will not allow my business to stay open 15 minutes after the bars close to sell a condom. The City Council has created some of the problems in the Boystown area that this proposal is seeking to cure. For one thing we can stop approving every retail space change of use into a bar or restaurant. We can encourage diversity in our retail. Good local business starts with ample parking, safe crosswalks and a business friendly City Council. As I talk to my neighbors and watch the turnover around me, I ask the question \"Is anybody listening?\" Perhaps they are listening, but I do not think either of these council members understands the ramifications of their proposal. I do not think that we want a city of expensive boutiques. I do not think the majority of us want to travel outside our borders to eat at Chipolte or go to Lenscrafters. That Dairy Queen belongs right here in West Hollywood! Plain and simple--national chains have the economy of scale and purchasing power to deliver value and convenience to our residents. Ban the chains and we are all forced outside our borders to shop. Larry Block, a candidate in this year's City Council election, is a licensed real estate agent and owner of the BlockParty store.", "articleID": "2015092117_00128439_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2015-09-21", "url": "http://atlantadailyworld.com/2015/09/21/poor-ciara-russell-wilsons-girl-gets-stomped-after-his-seahawks-lose-to-go-0-2/", "content": "Sep 21, 2015ByTerry Shropshire, National Correspondent About the same time that Ciara's ex-boyfriend Future and Drake were dropping the mixtape \"What a Time to be Alive,\" Ciara was getting roasted by Seattle Seahawks fans, getting the blame for quarterback <mark>Russell Wilson</mark> going 0-2 since they began dating. The Seahawks have suffered two extremely close losses and, coupled with some untimely <mark>Wilson</mark> mistakes, folks in the Great Northwest are getting restless and placing the blame on Ciara. Prior to meeting the sexy songtress, <mark>Wilson</mark> had taken his team to the Super Bowl in consecutive years, winning the title once and nearly winning the second time around. Now that <mark>Wilson</mark> and Ciara are an item, fans are rationalizing that he and the Seahawks cannot find their footing, as if the lithe lovely is single-handedly responsible for knocking the entire team off its pivot. But blame is what they are shooting at Ciara. And to make it worse, they are shoving Future's \"What a Time to be Alive\" mixtape in her face, to boot. Folks can be merciless. Take a look at the slander slung at Ciara because her boyfriend and his NFL team have yet to log a win in 2015. 1 2 3 4 5 6 7 8 9 Next page & raquo; Also On Atlanta Daily World:", "articleID": "2015092119_00215539_W", "names": {"Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"]}}, {"date": "2015-09-22", "url": "http://harwichandmanningtreestandard.co.uk/sport/national/13775319.World_Cup_officials_clarify_TMO_rules/", "content": "National Sport World Cup officials clarify TMO rules The opening round of the World Cup has been beset by delays involving Television Match Officials 0 comments World Cup chiefs have moved to clarify the role of television match officials following the controversial use of replays during the tournament's opening weekend. England's first match with Fiji last Friday lasted more than 100 minutes as referee Jaco Peyper referred six incidents to the TMO for closer inspection. The over-zealous use of the TV officials continued across the opening round of fixtures, with games involving Tonga and Georgia, Ireland and Canada as well as France's match-up with Italy all interrupted for lengthy periods as big calls were referred upstairs. That prompted a wave of criticism, with Ireland coach <mark>Joe Schmidt</mark> fearing it could spark a wave of injuries as players are left to cool down while they wait on a ruling. His Georgia counterpart Milton Haig warned a new generation of fans could be turned off the sport if the action was not speeded up. Former Australia fly-half Lynagh, a World Cup winner in 1991, criticised the length of time it is taking for decisions to be made, saying: \"It's taking too long. It's the process that's wrong. It's important to get decisions right on these big occasions, but let's work out how we can do that quickly, concisely and correctly .\" Other pundits have also called on match referees to show more courage in their decision-making and not rely on TV replays as back-up. But now World Cup bosses have released a statement explaining just what the TMO can and cannot interfere with. It said: \"The objective of the television match official system is to ensure accurate and consistent decisions are made on the field in a timely and efficient manner. The TMO is a tool to help referees and assistant referees with their on-field calls and the referee remains the decision-maker who is in charge of the process .\" Promoted stories The TMOs can only be used only for four areas - determining the grounding for a try and whether the players involved were in touch before the try was scored, to check whether a kick at goal was successful, to confirm if an infringement in the build-up to a try or scoring opportunity took place and to consider an act of possible foul play. Share article Chairman of the World Rugby Match Officials Selection Committee John Jeffrey said: \"The TMO is a part of the match official team and the fantastic technology available is a tool to be used in the making of key decisions during matches. The TMO process is used to make sure the correct calls are made to protect the integrity of the game .\" It's worth noting that just 28 per cent of stoppage time in the opening match of this Rugby World Cup was taken up by the TMO process but we are committed to reducing that time further while not compromising on accuracy. As such, all involved - referees, TMOs, technicians and television producers - are working together to achieve that. \"Promoted Stories", "articleID": "2015092209_00132686_W", "names": {"Joe Schmidt": ["Q284169", "Q6280152"]}}, {"date": "2015-09-23", "url": "https://ca.celebrity.yahoo.com/post/129676427063/azealia-banks-defends-using-homophobic-slur", "content": "Azealia Banks Defends Using Homophobic Slur Against Flight Attendant After Facing Backlash etonline-yahoopartner: Azealia Banks is firing back at the outrage. After the 24-year-old rapper was shown in a heated altercation on a Delta Airlines plane that led to her calling a flight attendant a \"fu * king fa ** ot\" in video obtained by TMZ, Azealia is defending her use of the homophobic slur on Twitter. \"I am bisexual. my brother is trans. My employees are all gay men. Nothing else to say,\" Azealia tweeted on Tuesday .--AZEALIABANKS (@ AZEALIABANKS) September 22, 2015 She also tweeted, \"Cause y' all KNOW, that they would've politely handed a white woman her bags and a spritzer. #whatever\" Cause yall KNOW, that they would've politely handed a white woman her bags and a spritzer. #whatever MORE: Azealia Banks on Nicki Minaj's Wax Figure: \"They Had to Put Her on All Fours?' In addition, the rapper has been retweeting fans who are supporting her through the controversy. However, many have been critical of Azealia on Twitter. One fan replied,\" You think because you associate with ppl of the LGBT community, that justify this negative things u do. You're the problem. \"\"@ AZEALIABANKS they would've given you your bags if you hadn't acted like a spoiled brat,\" another fan wrote. This is not the first time Azealia has found herself in hot water over use of a homophobic term. After the rapper was called out for calling Perez Hilton the slur in early 2013, Azealia defended her use of the word a year later, although she told The Guardian that she wouldn't be using it again. \"A lot of gay men are way more misogynistic than straight men,\" Azealia said at the time. \"The sh * t they say about women behind their backs, it's like,\" Wow, oh my God!' WATCH: <mark>Sam Smith</mark> Posts Homophobic Poem: \"This Genuinely Doesn't Offend Me'\" A f *** ot is anybody that hates women, \"Azealia claimed. One person who doesn't share Azealia's opinion of the slur is British singer <mark>Sam Smith</mark>, who in August, posted a picture of a homophobic poem written about him, while taking the opportunity to highlight homophobia in society .\" This genuinely doesn't offend me, coz I'm way too thick skinned when it comes to this kind of sh **, \"he wrote .\" BUT I just wanted to share this with everyone, so you can see how homophobia is still SO PRESENT in our society!! \"Watch below.", "articleID": "2015092301_00024809_W", "names": {"Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}}, {"date": "2015-09-24", "url": "http://mumbaimirror.com/sport/tennis/Pennetta-adds-to-CTL-star-power-this-year/articleshow/49083859.cms", "content": "Pennetta adds to CTL star power this year Mumbai Mirror | Sep 24, 2015, 05.37 AM IST My Saved articles Mirror Sports Bureau If Roger Federer and Novak Djokovic's presence in New Delhi last year for the International Tennis Premier League (IPTL) seemed servings from paradise, the likes of Jelena Jankovic and Sergi Bruguera in India for the Champions Tennis League, founded by Vijay Amritraj, only whetted our appetite for more. While the IPTL claimed it was a resounding success, the future of Amritraj's project appeared a touch uncertain after a low-key inaugural season in 2014. The Delhi franchise has pulled out of the CTL this year--Nagpur and Raipur have joined the league, with any of Bangalore, Pune and Chennai franchise likely to pitch for the sixth team. \"We give everyone the option to stay or opt out,\" Amritraj explained. He has enhanced the league's star power this year--never mind some of the retirees--contracting Marcos Baghdatis, Andreas Seppi, Fernando Verdasco, Ivo Karlovic, former Wimbledon champion Richard Krajicek, and Thomas Muster, the original king of clay before Rafael Nadal became the final word on red dirt. However, the biggest draw of the league this year has to be US Open champion Flavia Pennetta of Italy, who will represent Mumbai Masters. Drummers and Gera music (which has a touch of Samba) enlivened the players draft at a city hotel yesterday. Going by CTL's star galaxy this year, the action should be as gripping. Rules tweaked Amritraj explained that the league to be held from November 23 to December 6 has been tweaked to fit into the time slot of two-and-a-half hours to suit prime time viewing. \"Last year, when we had two matches per day and most of the matches were close, each day play got extended up to three and a half hours or more. So we had to make some changes so that this time around only one match (tie) will be held per day with a 7 PM start and an expected 9:30 -9:45 pm end,\" he said. \"Each match would comprise one set only (same as last year) but this year the set would be played to five games instead of six. Sets can be won from 5-0 to 5-4 and if it's 4-all a 9-point tie-break would be held,\" he said. The format remains the same: legends' singles, ATP players' singles, WTA players' singles, men's doubles and mixed doubles. Punjab Marshalls: Greg Rusedski (Australia), Marcos Baghdatis (ATP player, Cyprus), Elina Svitolina (WTA player, Ukraine), Saket Myneni (India) Hyderabad Aces: <mark>Thomas Johansson</mark> (Sweden), Ivo Karlovic (Croatia), Martina Hingis (Switzerland), Jeevan Nedunchezhiyan (India) Mumbai Masters: Richard Krajicek (The Netherlands), Andreas Seppi (Italy), Flavia Pennetta (Italy), Sriram Balaji (India) Team Nagpur: Alex Corretja (Spain), Feliciano Lopez (Spain), Jelena Jankovic (Serbia), Divij Sharan (India) Team Raipur: Thomas Muster (Austria), <mark>Kevin Anderson</mark> (South Africa), Alize Cornet (France), Ramkumar Ramanathan (India) Undecided Team: Rainer Schuettler (Germany), Fernando Verdasco (Spain), Heather Watson (Britain), Vishnu Vardhan (India) TEAM ROSTER You Might Also Like", "articleID": "2015092403_00031457_W", "names": {"Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"], "Thomas Johansson": ["Q19392386", "Q2371406", "Q2425118", "Q277802", "Q28002950", "Q48816303", "Q48995779", "Q51107870", "Q58324928", "Q5887950", "Q5887958", "Q5887973", "Q9358498"]}}, {"date": "2015-09-25", "url": "http://times-series.co.uk/leisure/national/13784361.Sam_Smith_s_new_Bond_song__The_lyrics_and_why_it_sounds_like_Michael_Jackson_s_Earth_Song/", "content": "-- <mark>SAM SMITH</mark> (@ samsmithworld) September 25, 2015 And then there are the lyrics, a few of which are: \"I'm prepared for this, I never shoot to miss,\" If I risk it all, Could you break my fall? \"How do I live? How do I breathe?, When you're not here I'm suffocating .\" But mostly people really think it has hints of the Earth Song in it: Anyone else think #WritingsOntheWall has an Earth Song sound to it in parts?", "articleID": "2015092510_00005389_W", "names": {"Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}}, {"date": "2015-09-27", "url": "http://www.pennlive.com/midstate/index.ssf/2015/09/pope_francis_homeless_philadel.html#comments", "content": "What happened to Philly's homeless while Pope Francis was in town? Comments This is a good, spiritual event, but you don't hear anyone talking about the homeless. \"Lanir Evans PHILADELPHIA--As Pope Francis prepared to take the podium at Independence Hall, a group of 15 men and women departed from Chosen 300 Ministries. They weren't tardy pilgrims making the last-minute trip. They set out on foot, guiding hand carts full of food and water across a mile of cracked pavement, over cement barriers and through the long line at a security checkpoint en route to the Benjamin Franklin Parkway. The group typically makes its deliveries via car .\" We've been doing this every Saturday for 19 years, \"said Executive Director <mark>Brian Jenkins</mark>, as he led the procession down an eerily vacant Broad Street .\" We're not going to miss a day. \"The parkway, a thoroughfare that runs from City Hall down to the Museum of Art, has become the epicenter of the pope's visit with key stops and a parade along its length. But it also has long housed a large contingent of Philadelphia's homeless population. In a city with a fraught history of dealing with its poorest citizens, preparations for dealing with the homeless during Pope Francis' visit began many months ago. It involved the relocation of homeless residents from the papal security zones, although they were allowed to re-enter certain areas--such as the parade route--on Friday morning. <mark>Jenkins</mark> and a number of the homeless themselves say Philadelphia displaced a group of people for whom the pope has become a strong advocate. City officials say their efforts were a necessary part of the Secret Service protocols and that they were particularly sensitive to the needs of the homeless .\" The city failed and they put the homeless last on the agenda, \"said <mark>Jenkins</mark>, whose group was one of four charities who successfully sued to block the city's ban on feeding the homeless in 2012. Marie Nahikian, the city's director of supportive housing, said the sweeps of the parkway and Independence Mall succeeded with some homeless individuals where previous outreach attempts had failed. In all, some 200 residents were directed to shelters and other resources made available during the pope's visit .\" We know many of those residents by name, \"she said .\" We've spent a lot of energy, with our nonprofit partners, making sure everyone understood what was going to happen. \"A number of those homeless residents accepted help from the teams for the first time during the lead-up to the pope's visit, Nahikian said. That was due, in large part, to the increased manpower funneled into the effort .\" Certainly, the additional resources helped, \"she said .\" People, by and large, don't want to be homeless. They just need to understand and trust that they can make a better choice. \"<mark>Sue Smith</mark>, vice president of residential and homeless programs for Project HOME, said the homeless were inconvenienced about as much as the average resident--no more or less. The nonprofit provides social services, including homeless outreach teams, through a contract with the city .\" So far, everyone sort of understands that these are strange times, \"she said .\" Whether you're homeless or not, you're going to be inconvenienced. \"Based on what she had seen, <mark>Smith</mark> said nobody was forced to do anything. In at least one case, she said, an individual with a shopping cart full of possessions was able to take them with her in a van. <mark>Smith</mark> said a normal late-night shift may have one or two outreach teams working citywide. Nahikian, meanwhile, said six teams were on the ground for the sweeps on Thursday and Friday. During the pope's visit on Saturday and Sunday, five teams and one back-up team were working to respond to any homeless individuals in distress. Adam Bruckner, another homeless advocate who has been critical of the city's past policies, said its plan for the papal visit looks good on paper. But it's too soon to judge how well it actually worked in practice, said Bruckner, who heads Philly Restart, a nonprofit that provides ID to homeless residents, among other programs .\" It has not been for lack of planning, \"he said .\" I think they're very aware that this is a big issue. They don't want to look to be against the homeless at the same time the pope is in town. \"The city has also distributed meal vouchers for the homeless to use during the pope's visit, although <mark>Jenkins</mark> said he's heard of many people who have yet to see them. Those who did reported that the vouchers were for eateries outside of the papal security zone. Eva Gladstein, who lead's Mayor Michael Nutter's Office of Community Empowerment and Opportunity, said she has not heard of any problems associated with the vouchers. The city meanwhile, had already reached an agreement that would allow <mark>Jenkins</mark>' group to distribute food within the security zone, Gladstein said. Even so, the process would still be difficult .\" Logistically, even finding the (distribution) site would be difficult given the number of people there, \"she said. <mark>Jenkins</mark> said the city's agreement allowed Chosen 300 to use a vehicle to haul the food. Unfortunately, he said, the parking spot was just three blocks closer to the parkway from the charity's headquarters. Homeless During Pope Francis Visit <mark>Brian Jenkins</mark>, of Chosen 300 Ministries, led a group of volunteers bringing food to homeless along the Pope Francis parade route. That ultimately prompted the group to make its journey across a mile of cordoned-off city streets to its usual spot near JFK Plaza along the parkway. At one point, the contents of the carts--chicken wings, potato salad, chips and water--had to be offloaded in order to get through concrete barriers .\" I wonder if (Pope Francis) knew what we were doing, would he really be down there? \"Jason Doctor, one of the volunteers, muttered as the group approached a checkpoint at 15 th Street and Cherry. Once the group arrived, they were detained as agents tried to determine whether they could pass through the checkpoint. A half-hour later, they were waved through. A group of people began to converge upon Chosen 300's impromptu food kitchen almost as soon as the carts were unloaded near JFK Plaza .\" He assured us he'd be here today and he is, \"said Russell Price, 62, who was driven to the streets after a fire destroyed his apartment two years ago. He has come to rely on <mark>Jenkins</mark>' group to help out. The presence of thousands of papal spectators lined up along the Benjamin Franklin Parkway, a short distance away, wasn't lost on Price and the others .\" The pope is supposed to be for these people, \"he said .\" Why is Bryan the only one out here? \"A similar sentiment came from Lanir Evans, 48, a former cook who was left homeless amid mounting medical bills related to blood clots found in his brain. His father recently helped pay for a room to keep him off the streets, but Evans still comes down to the open-air food line when his own pantry runs bare .\" This is a good, spiritual event, \"he said, motioning to the throngs of faithful around him,\" but you don't hear anyone talking about the homeless. \"", "articleID": "2015092701_00084532_W", "names": {"Brian Jenkins": ["Q4964201", "Q4964202", "Q4964204", "Q50365977"], "Sue Smith": ["Q15040075", "Q16150449", "Q21458567", "Q24809547", "Q530143", "Q57451503"]}}, {"date": "2015-09-28", "url": "http://economictimes.indiatimes.com/markets/stocks/policy/fresh-guidelines-for-exchanges-listing-soon-sebi/articleshow/49136674.cms", "content": "Fresh guidelines for exchanges' listing soon: Sebi By PTI | 28 Sep, 2015, 02.36 PM IST Post a Comment READ MORE ON & raquo; sebi | <mark>Rajeev Kumar</mark> Agarwal | <mark>Rajeev Kumar</mark> | MCX | Forward Markets Commission | finance | equities ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! MUMBAI: As its regulatory ambit widened with FMC's merger, capital markets watchdog Sebi today said it will put in place a new mechanism for entities desiring to operate in both equities and commodities segments. Besides, fresh guidelines would be put in place with regard to listing of the exchanges, U K Sinha said today after merger of the Forward Markets Commission (FMC) with the Securities and Exchange Board of India (Sebi). While the listing of stock exchanges has been hanging in balance for a long time, one commodity bourse MCX is already listed. \"Our immediate focus is to ensure stability and credibility in commodities markets and also to ensure that there are no disruptions in the way of functioning of commodity exchanges,\" he said. Sinha also said that new participants like banks and FPIs (Foreign Portfolio Investors) as well as more products would be allowed. \"These development measures will happen in few months. Right now, our focus would be on placing the regulators environment,\" he said. The Sebi chief said the regulator will come out with more guidelines for listing of exchanges in the context of commodities exchanges. \"We were waiting for the merger to happen first,\" he said. Sebi will also have a new mechanism for new entities who want to do business in both securities and commodity markets, he said, adding that the focus to ensure high quality physical delivery would be the starting point for the combined regulatory authority. Speaking at the event to mark the merger, Sebi's Whole Time Member <mark>Rajeev Kumar</mark> Agarwal said that the regulator will take stock of the NSEL matter subsequently. Sinha said it is a momentous day in regulatory architecture of India. \"This will have impact on regulatory area as also on the economy at large. It has taken almost 12 years for the merger but globally such steps have taken longer time. Except US and Japan, rest of the world has unified regulatory system so far as securities and commodities are concerned,\" he said. Giving credit to Finance Minister Arun Jaitley for navigating through the entire merger process in a timely effective manner, Sinha said, \"I was not sure that such position will be taken up so early and so fast .\" He added: \"With this merger, there are a lot of expectations from market players and participants. This merger is expected to ring in economies of scope and scale. It will encourage more competition and better price convergence .\" Our effort is that it should help bring simplicity in transaction. Most importantly it should provide a tool to hedge risks for all major stakeholders, \"he said. Sinha further said Sebi has made mistakes in the past but learnt from them .\" As far as commodity markets go, we will try to avoid making mistakes and avoid making any mis-steps. We will try for better convergence of prices from physical side, \"he said. Stay on top of business news with The Economic Times App. Download it Now!", "articleID": "2015092809_00060415_W", "names": {"Rajeev Kumar": ["Q17149113", "Q37839716", "Q50627950", "Q56945691", "Q57500308"]}}]