[{"articleID": "2010020907_00105973_W", "names": {"John Bulmer": ["Q21555532", "Q7333684"], "George Kerr": ["Q5541317", "Q927971", "Q956918"], "Marcus Adams": ["Q24005659", "Q6757982", "Q6757983"]}, "date": "2010-02-09", "url": "http://uk.buzz.yahoo.com/search?p=The%20Who&filter=168&srch_in=topstories", "content": "the government has the power, it could make us all pay into a green bank one thing lord browne knew better than most was that the toyota denies prius braking problem is a safety issue as recall crisis deepens stadium rockers with a dash of notoriety? they fit the event like a glove (er, sorry, wrong sport) they had to get <mark>john bulmer</mark>: a photographer who captured the north's true colours a new show exhibits luminous and delicate 1960s photographs by the 72-year-old scot who's won judo's highest accolade <mark>george kerr</mark> has been playing judo since he was eight; now he's one of only seven people in treasury flouted rules to conceal underwriting plan at the height of the banking crisis, according to report by mps unseen photographs reveal the girl who would be queen private portraits by society photographer <mark>marcus adams</mark> are set to go on show at windsor castle private portraits of queen elizabeth ii as a toddler that have come from who are the four parliamentarians facing criminal charges? profiles of labour mps elliot morley, david chaytor and jim devine, and tory peer lord hanningfield parliament has released the latest details of mps expenses claims. here's long live rock! the who at the super bowl arguably the most famous line the who's pete townshend ever wrote was \"hope i die before i get old\" on"}, {"articleID": "2013081502_00037584_W", "names": {"Willie Robertson": ["Q14755556", "Q16235773"], "Mike Adams": ["Q1394381", "Q1926746", "Q1933021", "Q2033463", "Q21004722", "Q30234135", "Q3857347", "Q6845832", "Q6845834", "Q6845836", "Q6845838"], "Michael Barone": ["Q16197964", "Q19865861", "Q6828446"]}, "date": "2013-08-14", "url": "http://townhall.com/news/entertainment/2013/08/14/rag--bone-inching-the-window-on-cool-success-n1664471", "content": "Duck Dynasty's <mark>Willie Robertson</mark> Stops By \"The Five' | Katie Pavlich Obligatory: Rodeo Clown Banned For Wearing an Obama Mask | Katie Pavlich Poll: 92 Percent of Federal Workers Don't Want Obamacare | Katie Pavlich The Illegal Alien Murderer of Vanessa Pham | Michelle Malkin Battle of the Sexes | John Stossel Energy Manipulation | Walter E. Williams Another Part of Obamacare Delayed Until 2015 | Katie Pavlich NEW YORK (AP) - Rag & Bone co-founders Marcus Wainwright and David Neville are no longer the cool newbies to the American fashion scene. They've graduated to be the even cooler tweens, with loyal followers and a path in front of them to expand their brand and be industry leaders. Growing up might have its challenges, but after 11 years, it's time, and they still see the window of opportunity they saw when it started. They've even inched it open a bit more .\" People wanted new fashion, \"says Wainwright .\" They wanted the new clothes they could wear and were coming out of New York. It was there for the taking and it is there for taking. \"Their look, offered for both men and women, is decidedly modern and downtown but built on classic menswear tailoring - not the kind of kooky styles that sometimes brand themselves\" downtown. \"Unlike some young guns who make a name for themselves with a dramatic style that few - if any - paying customers can pull off, Neville says they take a realistic approach to the delicate marriage between art and commerce. Commerce is the breadwinner, and it can very much appreciate art, he explains. Rag & Bone started in 2002, was a finalist in the Council of Fashion Designers of America's Vogue Fashion Fund contest in 2006 and won the CFDA's emerging talent award in 2007. Wainwright and Neville were named best overall menswear designers in 2010. Freestanding retail shops began opening in 2008, with flagships here and in Washington, Boston, London, Los Angeles, Tokyo and Seoul, South Korea. Their clothes are available in 39 countries. Earlier this summer, they were tapped by Vogue editor-in-chief Anna Wintour for a sort-of fashion ambassadorship to China. They traveled with the designers of Marchesa and Proenza Schouler to stage an oversized catwalk show that would help introduce the American aesthetic to consumers on the other side of the world. When they show during New York Fashion Week, it's a star-studded front row that's attracted Gisele Bundchen, Charlize Theron and Drew Barrymore, and the clothes are considered a bellwether of trends. Even now, though, when life should be a little more relaxed and a lot more glamorous, there are doses of reality. When needed, Wainwright says,\" I've airbrushed T-shirts, filled out UPS forms ....We can relate to struggles. \"Steven Kolb, CEO of the CFDA, has long been a fan, especially of the duo's commitment to mentoring new talent .\" Marcus and David are the same people today that they were when they were just starting out. They are still wide eyed and humble, \"says Kolb .\" Success hasn't gone to their heads. \"Kolb also is a personal fan of their youthful, tweaked take on gentlemanly style .\" I wear a lot of it. \"So do Wainwright and Neville, of course, but Wainwright makes allowances for his Nike sneakers and Neville wears the boxer shorts his mother sends him from Marks & Spencer. Life hasn't turned out quite as originally planned, or, maybe more accurately, unplanned. Even though they knew each other back in England, they didn't map this out. Nope: Wainwright, 38, had followed a girlfriend he had met bumming around Mexico to New York. (That girlfriend, Glenna Neece, became his wife .) He decided to start a fashion company and called upon Neville, 37, who was working as a banker, to be his partner .\" I was young enough and dumb enough to give it a go. It's worked out pretty good, \"says Neville, laughing. They keep duties fairly well divided now, with Wainwright designing and Neville handing the business side. They say they get along as well now as they did then .\" We wouldn't be sitting here if we didn't get on the way we do, \"says Neville, who is married to makeup artist Gucci Westman. The Rag & Bone office is bustling, with many more people inside than one would think could fit in an unmarked Meatpacking District building. It's important, they say, that the workplace, with upward of 300 employees, maintains an upbeat vibe .\" The general spirit of Rag & Bone is to be a good place to work, to come in on a Monday morning and be inspired, \"says Wainwright .\" If it's not fun, there's really no point in doing it. \"The old boarding-school friends share an office that's decorated with photos, including one of them on ad campaign shoot with Kate Moss and one of a real rag-and-bone man, which, they explain, was a 19th century traveler who'd collect rags and anything he thought he could sell along the way in the English countryside. He certainly was never rich or powerful, but, for the most part, he was considered honorable, Neville says. Neville and Wainwright have done pretty well for themselves - keeping a fridge in the office stocked with the Italian beer Peroni, mingling with models, and owning houses in the Hamptons, which is where, they say, they go with their families to enjoy any down time they might have. It's just a day here and a day there in this run up to the preview of the newest collection in September. Their broods are close, and often spend weekends together. Yes, one big happy family .\" It's pretty amusing. We had our first children a week apart in April 2007. Those two boys were born when we employed about 20 people. Obviously it was a huge coincidence, and a pretty interesting and amazing life experience to go through together, \"Neville says .\" My son was born and I took one week off work, and Marcus' son was born, and he took one week off work, and then we got back to it. The business was basically us, and it still is. \"___ Online: http: //www.ragandbone.com ___ Duck Dynasty's <mark>Willie Robertson</mark> Stops By\" The Five' DC Obamacare Exchange Grants $375,000 to Controversial Planned Parenthood Branch The News Isn't Good for Hillary Clinton Jesse Jackson Jr.. Receives 30 Month Prison Sentence MSNBC: Boston Bombers Not Radical Jihadists--They Are Far-Right Wing White Supremacists Revealing: NYT Exposes Clinton Foundation for Shady Financial and Business Deals and then Goes Offline Republican Parker on Hillary: \"If the world is ever going to be saved, women are going to do it\" Report: Two Journalists Killed in Egypt Lewis: Hillary Clinton is \"the Most Qualified Person in America to be President\" The Illegal Alien Murderer of Vanessa Pham Battle of the Sexes | John Stossel Energy Manipulation | Walter E. Williams Apology to Barney, Barack and Bernanke: I Forgot You're Exempt From Our Laws Levin to the Rescue | Brent Bozell So You're a Revolutionary? | <mark>Mike Adams</mark> Deja Cool: Zero People Attend Obama Climate Change Thing It's Time Conservatives Show Christie the Door Government Pensions Bankrupting Cities - and Individuals The Ed Morrissey Show: The Call-Out Edition Rand Paul on whether Ted Cruz is a natural-born citizen: I'm no Birther Planned Parenthood gets $375,000 from DC ObamaCare exchange Another nail in the Gasland coffin | Erika Johnsen Dem Congressman on ObamaCare: Hey, the Constitution had its problems, too Christians in the Military Barred from Expressing their Faith iPhone/Android Apps About Townhall.com Townhall.com is the leading source for conservative news and political commentary and analysis. Townhall is packed with breaking news headlines, political news, and conservative opinion with Townhall columnists including Ann Coulter, Michelle Malkin, <mark>Michael Barone</mark>, Star Parker, Dennis Prager, Thomas Sowell, and many more of your favorite conservatives. Political cartoons full of satire and political humor from editorial cartoonists including Michael Ramirez, Glenn McCoy, and Henry Payne. Townhall.com also features the latest news videos and pictures on the latest political hot topics including health care reform, the economy, immigration, government tax, President Obama, Sarah Palin, Mitt Romney, Herman Cain, Ron Paul, Iraq, immigration, politics, gay marriage laws, and many more big news issues."}, {"articleID": "2019100115_00430961_W", "names": {"David Evans": ["Q1174373", "Q1174375", "Q16106932", "Q17385895", "Q20732807", "Q20732808", "Q23611963", "Q23830915", "Q23988321", "Q25171969", "Q2913295", "Q29642639", "Q346480", "Q42263307", "Q43190963", "Q49757192", "Q5233451", "Q5233452", "Q5233453", "Q5233456", "Q5233457", "Q5233459", "Q5233462", "Q5233465", "Q5233468", "Q56187417", "Q56596945", "Q57727375", "Q714845"], "Richard Chang": ["Q48720120", "Q9137947"]}, "date": "2019-10-01", "url": "https://www.agriculture.com/markets/newswire/grains-soybeans-exceed-two-month-high-on-china-buying-us-inventory-shock", "content": "* Soybeans hit highest price since July 22 * USDA put U.S. soy, corn stocks below market expectations * CBOT wheat eases after rally on Monday (Updates with U.S. trading, changes byline, previous dateline PARIS/SYDNEY) By Tom Polansek CHICAGO, Oct 1 (Reuters) - U.S. soybean futures prices rose to the highest in more than two months on Tuesday, adding to gains from the previous session when further Chinese purchases and a lower-than-expected estimate of U.S. stockpiles buoyed prices. Corn also advanced after rallying 4% on Monday when a quarterly U.S. Department of Agriculture (USDA) grain stocks report pegged corn and soy inventories below traders' expectations. Most active soybean futures on the Chicago Board Of Trade were up 0.9% at $9.14-1 / 4 a bushel by 10:25 a.m. CDT (1525 GMT). The price was the highest since July 22. Most active corn futures were up 0.6% at $3.90-1 / 2 and reached the highest since Aug. 12. \"A lot of it is follow-through from yesterday,\" said Brian Hoops, president of U.S. broker Midwest Market Solutions. Chinese firms bought up to 600,000 tonnes of U.S. soybeans on Monday as part of a tariff-free quota allotted to the importers to buy up to 2 million tonnes this week, two sources with knowledge of the deals said. Traders hope the sales lead to Chinese firms buying more U.S. soybeans over the longer term, Hoops said, after China slashed imports during the ongoing U.S.-China trade war. Short covering helped support soybean and corn prices amid uncertainty about the size of the autumn U.S. corn and soy harvests, traders said. The harvests are off to a slower than normal start, after heavy rains and historic flooding delayed planting in the spring. \"Funds have been pushed to buy back their short positions,\" consultancy Agritel said. CBOT wheat futures eased in a turnaround from a seven-week high on Monday and were down 0.9% at $4.91-1 / 2 a bushel. \"Wheat must prove export demand will offset a larger crop than last year, which won't be easy,\" Farm Futures said in a note. (Reporting by Tom Polansek in Chicago; Additional reporting by Gus Trompiz in Paris and Colin Packham in Sydney; Editing by Uttaresh V, <mark>David Evans</mark> and <mark>Richard Chang</mark>) © Copyright Thomson Reuters 2019. Click For Restrictions - http: //about.reuters.com/fulllegal.asp"}, {"articleID": "2018120622_00477024_W", "names": {"James Stewart": ["Q16214641", "Q16236569", "Q21457696", "Q23618352", "Q2706595", "Q43394132", "Q43395260", "Q43911566", "Q4444819", "Q4444825", "Q6137399", "Q6143635", "Q6143644", "Q6143657", "Q6143663"]}, "date": "2018-12-06", "url": "https://www.cbc.ca/news/canada/windsor/local-444-women-violence-massacre-anniversary-1.4935681?cmp=rss", "content": "Unifor Local 444 honours women lost to violence on day of remembrance The women's committee at Unifor Local 444 held a memorial to remember women lost to violence on the National Day of Remembrance and Action on Violence Against Women. \"I don't know if our family will ever heal,' says Autumn Taggart's cousin CBC News · Posted: Dec 06, 2018 4:57 PM ET | Last Updated: December 6 Women's committee at Unifor Local 444 held its 19th annual memorial for women who have been victims of violence. (Dale Molnar/CBC) For the 19th year, the women's committee at Unifor Local 444 held its annual memorial for Mary Lou Turjeon-Lewenza (Hyjek), who was a Plant 6 worker when she was killed by her husband in 1998 .\" She was vibrant, loved life. It's been 20 years since she was stolen from us, \"said Pamela Turjeon-Miller, her sister. Man charged in Windsor mother homicide a Canadian citizen living in Michigan, police say The memorial is planned on the National Day of Remembrance and Action on Violence Against Women, which was marked since the massacre in Montreal where 14 women died at École Polytechnique in 1989. The committee also donated $2,000 to House of Sophrosyne and $2,000 to the Welcome Centre Shelter for Women as part of the commemoration. The memorial was held at the memorial stone for a former Plant 6 worker who was killed by her husband. (Dale Molnar/CBC) Lori Dupont, a Windsor nurse who was killed by her ex-boyfriend who worked at the same hospital in 2005, was also remembered at the memorial. As was Theresa Vince, a Chatham woman who was murdered by her boss in 1996. And more recently, Autumn Taggart, who was found dead in her apartment June this year. A 27-year-old man is charged with first-degree murder aggravated sexual assault in relation to Taggart's death. Unifor Local 444 members call for end to violence against women Her cousin, Amber Gelinas, said Taggart's death has had an\" astronomical \"impact on the family .\" I don't know if our family will ever heal, or if we'll ever feel like we're whole again, \"she said .\" Because a part of us has just been taken away and she was just so young, and she had so much of her life in front of her. \"Amber Gelinas, cousin of Autumn Taggart, says the family has been having an incredibly difficult time coping in the last six months. (Dale Molnar/CBC) Those names they're remembering are only several\" out of thousands \"who have faced violence, said <mark>James Stewart</mark>, secretary-treasurer at Local 444. He said men, including himself, need to question themselves on whether they're doing enough to end the problem .\" It starts with building a culture that's equitable, that's when violence will stop, \"said <mark>Stewart</mark>. Slain Windsor nurse often harrassed by doctor, colleague testifies According to Susan McKinnon, chairperson of the committee, one of the things they want to see is to have the provincial roundtable on violence against women reinstated .\" We're here to make sure we don't forget and we need to make sure we add action to our plans to move forward, \"she said. CBC's Journalistic Standards and Practices | About CBC News Report Typo or Error | Send Feedback Related Stories Man charged in Windsor mother homicide a Canadian citizen living in Michigan, police say"}, {"articleID": "2017092918_00053179_W", "names": {"Tim Hughes": ["Q2423645", "Q6828447", "Q7803682"], "Helga Schneider": ["Q3784531", "Q38473634"]}, "date": "2017-09-29", "url": "http://www.oxfordmail.co.uk/leisure/musics/15567743.A_different_beat__Radiohead_drummer_makes_music_for_a_film/", "content": "Making movies: Philip Selway has stepped out from behind the drum kit to work on the music for the film Let Me Go 0 comments Get the latest local news straight to your inbox every day Sign up doc Radiohead drummer Philip Selway tells <mark>Tim Hughes</mark> about his first film soundtrack CONSIDERING his place in one of the world's biggest, and certainly best, rock bands, Philip Selway is a modest soul. While less impressive artists brag and show off, the Radiohead drummer is the embodiment of cool. He speaks quietly and intelligently and is polite throughout. He is one of rock's few true gentlemen. You wouldn't think he had been headlining the Pyramid Stage at Glastonbury just three months ago. \"I'm back home in Oxfordshire, which is good,\" he chuckles. \"There's time to take stock of everything that's going on and also to do some writing .\" It's been a busy year, with an epic Radiohead tour culminating in that Glasto show, in front of more than 100,000 fans and millions more on TV worldwide. But it is his latest project which has got him excited, ranking as a highpoint in a glittering career for the father of three, who lives in rural west Oxfordshire. Again demonstrating his ability as a composer, he has stepped from behind the drum kit, this time to write his first film soundtrack. Called Let Me Go, the movie, which premiered this month in Leicester Square, stars Juliet Stevenson and up-and-coming talent Lucy Boynton, and was produced by Lizzie Pickering, from Lyneham, near Burford, and directed by BAFTA-nominated Oxford University alumnus Polly Steele. Based on the true story of <mark>Helga Schneider</mark>, whose mother abandoned her as a four-year old to become a guard at Auschwitz during the Second World War, the film is a thought-provoking story of mothers and daughters over four generations. A thoroughly Oxford project, the soundtrack was recorded at Nick Moorbath's Evolution Studio, in Osney Mead, west Oxford. Nick is the former owner of the Zodiac in Cowley Road, once partly owned by Radiohead and the location for the video to their anthem Creep. Let Me Go has already won an award for Best Ensemble at Geena Davis's Bentonville Film Festival, in the US, which supports women in film (as well as having a female director and producer and four strong female cast members more than half the crew were women). The soundtrack follows Philip's previous solo albums, 2010's Familial and 2014's Weatherhouse. So how did the process of writing a soundtrack differ? \"There are some parallels,\" he says. \"Working in Evolution with Nick also felt very familiar and was a fruitful process .\" Some of the pieces keyed into what I'd done with the band and my solo stuff, but obviously there's a thing of fitting into a whole creative project, and at the heart of it is <mark>Helga Schneider</mark>'s true story and Polly Steele's interpretation and screenplay. There were all these other elements to respond to cinematically and in the performances themselves. \"From the outset I was writing pieces from just the screenplay and knowing who's going to play what role, and that was a productive time. But I also knew I had to release a soundtrack album that could be convincing in its own right .\" The result is haunting, brooding and quite beautiful. \"It was an emotional, rather than physical journey,\" says Philip, who as part of Radiohead has sold well over 30 million albums and racked up multiple awards. \"The film was chiefly set in Vienna, which also feeds into the tone of the music .\" It also makes it a little gloomy, I suggest. \"Yeah,\" he agrees. \"It deals with some weighty issues and contrasts between light and dark. It is looking at how generational trauma plays out and what <mark>Helga Schneider</mark>'s role was in Auschwitz. These are all deeply disturbing and emotionally rich subjects and they lead you in a particular way musically .\" And he enjoyed working close to home. \"There's a wealth of talent in Oxford and to be able to benefit from that and highlight that is great,\" says the keen Oxford United fan. \"It was brilliant working with Nick Moorbath again too. I have known him for a long time, since he ran the Cold Room studios in Cumnor when we first started to put ourselves out as a band. Nick is so central to the growth of Oxford's music scene. At the heart of his studio is a lovely mixing desk, and the studio reflects his personality. He's very talented as a musician and engineer .\" The release of the film, which is screened at the Ultimate Picture Palace off Cowley Road on October 11 and 12, and the soundtrack, out on vinyl and CD on the Bella Union label on October 27, tops an extraordinary year for Philip, including that Radiohead Glastonbury set, which he says was one of the highlights of his career. \"We spent the year working towards that,\" he says. \"It was an amazing experience being on that stage and having the opportunity to go back and do it again 20 years after our first headline set in 1997 .\" It's a good indication of what we've done as a band in that time. \"Looking back over the years, what has been his highpoint with Radiohead?\" I don't think I can narrow it down to one thing, but as a band I'd say some of our playing this year. It hit a new level for us and to actually get to this point is brilliant. \"So with Oxford fans deprived of a local show since 2005's South Park triumph, might we finally see another homecoming concert?\" There are no plans at the moment--but as with everything we do, never say never! \"In the meantime there is the question of the next Radiohead album, and Oxford United's new season to think about\" They have shown so much progress, \"he laughs .\" They are a championship team in the making! \"Let Me Go is at the Ultimate Picture Palace, Oxford on October 11 & 12. Order Philip Selway's album at bellaunion.greedbag.com 0 comments"}, {"articleID": "2009092804_00050391_W", "names": {"Kirk Johnson": ["Q15598030", "Q21389026", "Q327230"], "Danny Williams": ["Q1164790", "Q16232516", "Q365772", "Q5220936", "Q5220937", "Q5220938", "Q5220939", "Q5220940", "Q5220941"], "Jim Lampley": ["Q10917065", "Q6196281"], "Mike Tyson": ["Q30122587", "Q6849116", "Q79031"], "James Kirkland": ["Q2394552", "Q3821154", "Q6137396"], "Dan Rafael": ["Q19867050", "Q58479350"], "Mike Miller": ["Q16185439", "Q16213405", "Q19667639", "Q2064643", "Q25190524", "Q380541", "Q6848025", "Q6848026", "Q6848027", "Q6848031"], "Ricardo Williams": ["Q16201923", "Q19578258", "Q346051", "Q58797372"], "Bernard Hopkins": ["Q531804", "Q74397"]}, "date": "2009-09-28", "url": "http://boxingscene.com/?m=show&id=22468", "content": "there are two types of tears: those for triumph, and those for tragedy. witness the contrast between two fighters on one night. floyd mayweather jr., the victor, dropping to his knees, crying out, \"god is great .\" arturo gatti, the vanquished, remaining on his stool, his eyes swollen shut, his head cradled by his trainer, just crying. there are two types of tears shed from tragedy: those that come from an outside force leaving one broken, and those that come from internal flaws rendering one brokenhearted. witness chris arreola, brokenhearted and broken, his internal flaws making him all the more vulnerable to external blows. the winner, vitali klitschko, stood tall, a statuesque 6-foot-7 figure raising his right glove high. the wounded, arreola, hunched over, his right glove covering his eyes. for 10 rounds, klitschko was better from head to toe, with a strategy that played to his strengths and exploited his opponent's weaknesses, with fists that found flesh 300 times in 30 minutes, with footwork that helped both to deliver harm and to deliver himself from it. for 10 rounds, arreola was all guts. after, there was no glory. \"i'm so sorry,\" arreola said afterward, attempting to hold back tears. \"i worked my ass off. f * ck .\" arreola is blue-collar, beer-drinking, belly bulging, brawling over boxing. he can be nothing beyond what he is. it is his character. it is his curse. \"sometimes i don't think he gives us the best chance to win,\" arreola's trainer, henry ramirez, said during the build-up to the fight. \"sometimes he comes in a little too far out of shape .\" \"michael phelps smokes weed. why can't i drink a beer?\" arreola said in the weeks before the fight. \"that guy's still setting records. why can't i have a beer?\" it's a problem, but at the same time it's not, \"arreola said of his lifestyle .\" i work hard. i'm going to play hard. \"his character. his curse. arreola had last fought in april, tipping the scales at 255 pounds for his knockout victory over jameel mccline. since then, his weight had risen in the vicinity of 290 pounds, held heavily on his 6-foot-3 frame. for the klitschko fight, arreola's trainer brought in conditioning coach darryl hudson .\" a lot of people use weight as a barometer for saying they're in a certain shape, \"hudson said .\" you can't go by weight. we're not training to lose weight. we're training to be in the best condition. so if the weight falls, it falls. \"as is customary for heavyweights, arreola stepped on the scale two days before his fight. other divisions have to make a certain weight and must do so the day before they step in the ring. arreola weighed 272 pounds. but he was smiling. he was wearing a weighted vest beneath his t-shirt. he took off both and got back on the scale. he was 251 pounds. by no means was he svelte. he weighed more than the 229 pounds he'd been about three years ago, when he made his hbo debut with a technical knockout of damian wills. he weighed more than the 239 pounds he'd been 15 months year ago, when he returned to hbo for a win over chazz witherspoon and the network began to market him as a potential challenger for the heavyweight championship. still, he was noticeably less tubby than in his previous three fights, when he weighed 255, 254 and 258.5 .\" he'll feel the strength, \"hudson said .\" he'll feel that his breathing is under control. he'll be able to do the things he did in the first round in the ninth round. \"it wouldn't be enough. arreola is a pressure fighter, coming forward behind combinations, roughing up his opponents into defenselessness or submission. the problem is that while his conditioning would allow him to continue to pressure, his weight would still inhibit his ability to land punches. it is a mistake so many have made when facing vitali or wladimir klitschko. to compensate for the brothers' height, weight and proportional strength, they pack on the pounds, believing that doing so will help. rather, they become slower targets in the ring with surprisingly agile men. vitali klitschko had harpooned several of these beached whales: <mark>kirk johnson</mark>, corrie sanders, <mark>danny williams</mark> and samuel peter. against arreola, however, he treated the match like a bullfight. arreola would move in, but klitschko would stab away, keeping him off with jabs, hooks and body shots, none with one-punch knockout power, all with enough force that arreola rarely got within range. klitschko would also pivot, jog a few steps away, and make arreola, like a drugged, slowed bull, reset for his next charge. klitschko kept his hands at his sides, knowing that arreola could neither catch him nor catch up with him. klitschko was far more active than the typical heavyweight, throwing 802 punches, or 80 per round, and landing 301, or 30 per round. half of his landed shots were jabs, half of them were power punches. arreola, who of the two of them was the one who usually overwhelmed opponents with activity, threw only 332 punches in the whole fight, landing 86. that was an average of less than nine landed punches and 33 thrown per three minutes. he landed only 24 power punches over the entire fight, staying in the single digits each stanza: one, two, one, two, three, five, two, four, four, and zero .\" he was fighting the fight he was supposed to fight. he ran when he was supposed to, \"arreola said afterward .\" he's just a smarter fighter. whatever i did, he found a way to counteract that. he just found a way to win. i found a way to lose. \"after that 10th round, when it became clear that all arreola had left to offer was his willingness to get off his stool and take more punishment, the fight was stopped. two of the three judges had given klitschko all but one round, scoring the eighth round for arreola. the third judge had it a shutout and had scored the 10th stanza 10-8 for klitschko in a round without a knockdown, seeing the action one-sided enough to warrant such a tally .\" i never wanted to quit, \"arreola said afterward .\" i wanted to go the full 12 rounds. i knew he was fucking me up. \"it is tempting to give arreola credit for courage, for staying upright. at least he had gotten in the ring with klitschko. that is more than could be said for david haye, the former cruiserweight champion who called out both wladimir and vitali upon his rise to the heavyweight division but then bailed on fights with each. arreola had been guided toward an eventual title shot, but despite his undefeated record, his professional experience was still that of a prospect, not a contender. his best wins had come against chazz witherspoon and travis walker, two heavyweights who had never beaten an upper-tier opponent, and against jameel mccline, a longtime contender who had since grown long in the tooth. arreola took the title shot that was offered to him. in an era when beltholders fight only two or three times a year, it was better to fight now rather than to get more experience and hope another shot would come. but arreola didn't help his chances at winning .\" these are 365-day-a-year guys, \"hbo blow-by-blow announcer <mark>jim lampley</mark> said of the klitschko brothers following the fight .\" somebody who thinks they can take 10 days off, have a party, drink and then come back to the gym and be on the same page is not going to beat a klitschko. \"michael phelps can smoke marijuana because he already has the gold medals. chris arreola must now understand that in the deep waters of the heavyweight division, the more one weighs, the quicker one sinks. if he wants to down a pint, he's going to need to drop some pounds. the 10 count 1. the sept. 19 pay-per-view featuring floyd mayweather jr. and his easy win over juan manuel marquez had a buy rate of 1 million. that's a fantastic number, one attributable to several factors. first, mayweather, whether you like him or not, is a star. some who are paying to see him are fans. others who pay are hoping to see him beat. once underappreciated despite his talent, he proclaimed himself a pay-per-view fighter before his june 2005 bout with arturo gatti and, like that, so he was. he had one more fight on\" regular \"hbo before headlining shows in 2006 against zab judah and carlos baldomir. none of those did anywhere near as much business as his record-breaking pay-per-view in may 2007 with oscar de la hoya. but mayweather was the b-side of the main event for the de la hoya bout, and, on the matter of ticket sales, he was the b-side when it came to drawing a crowd for his december 2007 win over ricky hatton. the buy rate for the marquez fight might have included a number of fans of mexican heritage who ordered to support marquez. may have. even if so, marquez never drew pay-per-view numbers like those from this most recent fight. mayweather's pay-per-view history served to build his fights, gradually, into appointment viewing. second, this year has not been as inundated with boxing pay-per-views as previous years had been. the first eight months of 2008 saw hbo put on five pay-per-views. hbo would finish the year with four more. the first eight months of 2007 also saw five pay-per-views broadcast or distributed by hbo. another three would come. this year, hbo had broadcast just one pay-per-view (ricky hatton vs. manny pacquiao) and distributed one other (the\" lightweight lightning \"quadruple-header). some promoters have put on smaller, independent pay-per-views. hbo only had two pay-per-view shows slated for the remainder of 2009: mayweather-marquez and miguel cotto-manny pacquiao. despite the clear mismatch, the mayweather-marquez card, then, wasn't going to be a hard sell for fans who had waited through the usual slow summer for big-time boxing. that didn't keep hbo from embarking on its usual hefty marketing effort. mayweather, who during his time away in the ring had stayed visible with appearances on\" dancing with the stars \"and world wrestling entertainment programming, got four episodes of hbo's\" 24/7 \"infomercial documentary series to sell the fight and, as important, himself. 2. ticket sales, however, told a different story. the live gate pulled in $6,811,300, according to usa today, with an attendance of 13,116. of those, 11,912 tickets were sold at face value, 94 tickets were sold at half price ($300 instead of $600), 895 tickets were either complimentary or given away, and 2,645 tickets went unsold. not that this is the first time a fight has done great on pay-per-view but so-so at the box office. the heavyweight extravaganza pitting lennox lewis against <mark>mike tyson</mark> in 2002 set a then-record for pay-per-view buys with 1.8 million. it failed to fill every seat in the house, however. promoters had claimed a sellout of 19,000 within hours of tickets going on sale, according to sports business daily. the actual attendance was 15,327. 3. following up on last week's uncertainty over whether the money mayweather owed the internal revenue service had been paid and whether the irs had intended to take money from mayweather's purse for the marquez fight, there's this from the associated press:\" floyd mayweather jr. agreed to pay $5.6 million in back taxes...the internal revenue service was poised to take the money from his purse after his saturday comeback fight against juan manuel marquez. \"the irs sent the nevada athletic commission a levy notice on sept. 4 ordering mayweather's unpaid taxes from 2007 to be deducted from his $10 million purse, commission executive director keith kizer told the associated press .\" kizer said the irs backed off one week later, after mayweather agreed to pay the money. \"consider mayweather 40-1. nobody beats the federal government. 4. boxers behaving badly update: <mark>james kirkland</mark> has been sentenced to two years in prison on a charge of being a convicted felon in possession of a firearm, according to court documents. federal sentencing guidelines for such a charge could have put <mark>kirkland</mark> away for 47 to 57 months; instead, the junior-middleweight prospect not only got a two-year sentence, but he will also be credited for the nearly six months he's already spent behind bars. credits for good behavior could shorten that time even further, and texas allows for the final six months of a sentence to be served in a halfway house, <mark>rafael</mark> wrote. <mark>kirkland</mark> will be on probation for three years and must pay a $5,000 fine and an additional $100\" special assessment, \"according to documents available online via the federal court pacer service. <mark>kirkland</mark> was already on probation for a 2003 armed robbery. in april, he was seen giving his girlfriend money to buy ammunition at a gun show in texas. police pulled him over later and discovered a loaded pistol in his vehicle. <mark>kirkland</mark>'s probation officer apparently was already going to revoke <mark>kirkland</mark>'s probation for another incident in which he allegedly threw a pistol under a vehicle, according to a report at the time in the austin american-statesman. 5. depending on your perspective, <mark>james kirkland</mark> is either very lucky or very fortunate. <mark>kirkland</mark>'s co-manager, <mark>mike miller</mark>, told <mark>dan rafael</mark> of espn.com that he believed the judge gave <mark>kirkland</mark> a lesser sentence based on the outpouring of support for the 25-year-old fighter, including testimony from his promoter, oscar de la hoya. as i noted earlier this year following <mark>kirkland</mark>'s arrest, his career is not necessarily over. other fighters have been able to return from stints behind bars, most notably <mark>mike tyson</mark> coming back to capture heavyweight belts. it's easier to compare <mark>kirkland</mark> to <mark>tyson</mark> than, say, to more contemporary examples in paul spadafora and <mark>ricardo williams</mark> jr. spadafora wasn't a power-puncher. he's still undefeated but is no longer in the title picture or being featured on television. <mark>williams</mark> was seen as a bust who had to rebuild even before he went to prison. <mark>kirkland</mark> was previously inactive for two-and-a-half years after the 2003 armed robbery. now the powers-that-be will consider the two strikes on his record before deciding whether it is safe or worthwhile to invest in him. <mark>kirkland</mark> is fan-friendly enough that such an investment seems likely. he's undefeated through 25 fights and has knocked out all but three of his opponents. he's been prominently featured on hbo and showtime and, before his arrest and incarceration, was on the verge of challenging for a world title. it doesn't hurt that he could be back in action no later than 2011. it also doesn't hurt that his promoter is de la hoya, who should have no problem persuading networks to once again put <mark>kirkland</mark> on the air. 6. boxers behaving badly: a former aspiring heavyweight who once said boxing gave him a second chance at life after years of being in a gang will spend the rest of his life in prison as a convicted murderer, according to the orange county (calif.) register. <mark>james</mark> d. shipp jr., 41, murdered a woman who was trying to keep him from raping a co-worker, according to the newspaper. the murder happened in 1998. shipp will never be eligible for parole. he was also sentenced to another life term on a kidnapping charge and another 119 years and four months for nine felony charges stemming from five other sexual assaults shipp committed between 1997 and 2001. shipp was 0-3 as a pro boxer, according to boxrec.com, losing a bout by knockout in 1992 and then losing two more by the same route in 1997. 7. as a news reporter, i look to the ap stylebook as essential reading, the answer to questions of spelling, capitalization and word choice. as a boxing writer, i look at one part of the ap stylebook as sorely out of date. here's why:\" the three major sanctioning bodies for professional boxing are the world boxing association, the world boxing council and the international boxing federation, \"it reads, omitting that the world boxing organization has long-since turned the number from three to four. even worse? under weight classes and titles, it lists the cruiserweight limit as 190 pounds. the limit has been 200 pounds for more than half this decade. 8. speaking of out of date, roy jones jr. and <mark>bernard hopkins</mark> have finally agreed to a rematch, which will be on pay-per-view at some point in the first three months of 2010, according to espn.com scribe <mark>dan rafael</mark>. the money will be split 50-50 between the two future hall of fame inductees, though a knockout or stoppage would give the winner 60 percent, the loser 40 percent. <mark>hopkins</mark> turns 45 on jan. 15. roy jones turns 41 the following day. they were much younger in may 1993, when jones, then a middleweight titlist, outpointed <mark>hopkins</mark> over 12 rounds. jones and <mark>hopkins</mark> jawed at each other about a rematch on a 2002 hbo broadcast. and then the bout seemed to be a go for march 2006, but it was called off. <mark>hopkins</mark> instead fought antonio tarver that june. 9. virgil hill-henry maske i - nov. 23, 1996. hill-maske ii - march 31, 2007. time between - 10 years, four months and eight days. hill was 43 years old. maske was also 43. azumah nelson-jeff fenech ii - march 1, 1992. nelson-fenech iii - june 24, 2008. time between - 16 years, three months and 23 days. nelson was nearly 50 years old. fenech was 44. roy jones-bernard <mark>hopkins</mark> i - may 22, 1993. jones-hopkins ii - early 2010. time between - nearly 17 years. <mark>hopkins</mark> will be 45. jones will be 41. 10. hollywood has remakes of old television shows, now movies with new actors. boxing has rematches of old fights, now with old fighters ..."}, {"articleID": "2017110717_00948027_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}, "date": "2017-11-07", "url": "http://www.firstpost.com/politics/narendra-modi-writes-to-people-of-gujarat-says-vote-for-bjp-and-save-state-from-casteism-4198311.html", "content": "Narendra Modi writes to people of Gujarat, says vote for BJP and save state from casteism Narendra Modi writes to people of Gujarat, says vote for BJP and save state from casteism Politics PTI Nov, 07 2017 22:35:07 IST Ahmedabad: Prime Minister Narendra Modi urged the people of Gujarat to vote for the BJP in the Assembly polls embracing its development agenda, and save the state by rejecting \"casteism, communalism and dynastic politics\". File image of Prime Minister Narendra Modi. Reuters. On the first day of the BJP's door-to-door outreach drive--Gujarat Gaurav Maha-Sampark Abhiyan--BJP workers and leaders, including its president <mark>Amit Shah</mark>, distributed copies of Modi's message-cum-appeal among people. In the written message addressed to the people of Gujarat, Modi urged them to remember what the state was before the BJP assumed power in 1995, and appealed to them to vote for his party to carry forward the \"journey of development\" that began 22 years back. \"Just compare what was Gujarat 22 years back and what it is now. Thanks to the good governance of the BJP governments, Gujarat has reached new heights of development, so much so that it is now known across the world,\" he said in the message. Modi said a young person of 22-25 years cannot even imagine what Gujarat was in the past when casteism and communalism \"destroyed\" it. \"Now, some power-hungry elements are playing the same dirty game. Now, it is our collective responsibility to save Gujarat from the evils of casteism, communalism and dynastic politics,\" the message read. Modi also slammed the Congress-led UPA governments, accusing them of having stalled the Narmada project. The prime minister said though the Congress-led central governments were not favourable to Gujarat, the state continued its journey of development. He reminded the people how his government got completed the Sardar Sarovar dam project quickly. Polling for the two-phase elections will take place on 9 and 14 December and votes will be counted on 18 December. Published Date: Nov 07, 2017 10:35 pm | Updated Date: Nov 07, 2017 10:35 pm New Zealand in India, 3 T20 International Series, 2017 IND Vs NZ New Zealand in India, 3 T20 International Series, 2017 IND Vs NZ New Zealand in India, 3 T20 International Series, 2017 IND Vs NZ Pakistan and Sri Lanka in UAE, 3 T20 International Series, 2017 PAK Vs SL Bangladesh in South Africa, 2 T20 International Series, 2017 SA Vs BAN New Zealand in India, 3 ODI Series, 2017 IND Vs NZ West Indies in Zimbabwe, 2 Test Series, 2017 ZIM Vs WI Pakistan and Sri Lanka in UAE, 3 T20 International Series, 2017 PAK Vs SL Pakistan and Sri Lanka in UAE, 3 T20 International Series, 2017 PAK Vs SL Bangladesh in South Africa, 2 T20 International Series, 2017 SA Vs BAN"}, {"articleID": "2018041213_00189110_W", "names": {"Jerry Richardson": ["Q27915159", "Q6184318"], "Desmond Tutu": ["Q43033", "Q48815071"]}, "date": "2018-04-12", "url": "https://www.channelstv.com/2018/04/12/winnie-mandelas-football-club-a-blot-on-her-legacy/", "content": "FILE COPY Willie Mandela Photo Credit: AFP \"Winnie Mandela was there. She is the one who started beating all of us. The rest followed, for at least one hour, if not two,\" said Thabiso Mono. He is still haunted by that night in December 1988 when he was kidnapped with three other anti-apartheid activists in an incident that has been at the centre of a debate about Winnie Mandela's legacy since her death earlier this month. \"I was surprised, I could not understand what was happening,\" Thabiso told AFP, strain audible in his voice. \"We thought that when we were around her we were very secure .\" Winnie Mandela died on April 2 at the age of 81 and is remembered by many South Africans for her courageous role in the fight against white rule and her 38-year marriage to Nelson Mandela. But in the late 1980s her bodyguards, dubbed Mandela United Football Club (MUFC) and easily identifiable by their yellow tracksuits, inflicted a reign of terror on the Soweto township near Johannesburg. MUFC had nothing to do with soccer. The gang was implicated in kidnappings, torture and murder in circumstances which remain mired in confusion. Before he was brutalised, Thabiso--then 19--was kidnapped in Soweto by the \"club\" along with three acquaintances--Stompie Seipei, whose murder became emblematic of the MUFC's violence, Pelo Mekgwe and Kenny Kgase. \"We went to Winnie's house in Diepkloof,\" a district of Soweto, said Pelo who is now an army sergeant. \"The beatings happened in her property, in a back room .\" \"I am not angry anymore' The youths were repeatedly struck with fists, bottles, sticks and whips .\" We had bruises all over the body, \"said Thabiso, now 48. Just days later the body of 14-year-old Stompie was found on a riverbank near Soweto. The other three were released after their ordeal. The group was targeted because Stompie was suspected of being an informant for the apartheid security services. The others were accused of having sexual relations with a white priest who lived in Soweto, Thabiso and Pelo recalled. A portrait of Stompie, along with an image of Nelson Mandela, greets visitors to the impoverished township where he was born in the central province of Free State. His tombstone is overgrown with wild grass and withered thistles. Nearby in the modest, tin-roofed family home, Stompie's mother has given several media interviews following Winnie Mandela's death .\" I am not angry anymore. The past is the past. I want to let it go, \"Mananki Seipei told AFP in her kitchen. Her fridge door is adorned with a black and white image of her son who she describes as her\" hero \". She recalled her late 1990s meeting with Winnie Mandela on the sidelines of the country's Truth and Reconciliation Commission (TRC) which was tasked with examining and exposing the political crimes and abuses of the apartheid era .\" Winnie asked for forgiveness and we made peace, \"said Mananki. In court, Winnie Mandela was sentenced on appeal to a suspended two-year prison term and a fine for her role in the kidnapping and violent treatment of Stompie and his three friends. <mark>Jerry Richardson</mark>, a prominent member of MUFC, was sentenced to life in prison for Stompie's murder .\" A shadow that has followed her' \"One has to say that something went wrong--horribly, badly wrong,\" said one of her most prominent supporters archbishop <mark>Desmond Tutu</mark> at the TRC which he chaired. The lingering pain is still felt by all three, who must weigh up Winnie's mixed legacy and the role she played in their lives. Both Mananki Seipei and Pelo Mekgwe will attend Winnie's state funeral this Saturday in Soweto. Thabiso is not planning to go but said: \"I think that we must all remember her for the sacrifices she made. She might have made mistakes like anybody could do .\" Pelo still wonders what motivated the sadistic violence of some members of MUFC. \"Some of them were...working for the security police,\" he speculated, a widely-held view among those who believe the apartheid regime would have stopped at nothing to discredit Winnie Mandela. Former security branch policeman Paul Erasmus, who was involved in efforts to subvert anti-apartheid groups, claimed this week that the \"entire soccer club was security branch, informers\". Whatever the loyalties of MUFC, their brutality \"is a shadow that has followed (Winnie) for the last 30 years\" , said Paul Verryn, the priest who was sheltering Stompie and his friends before they were abducted. She was \"just as bright as the sun\" but also \"dark (as) the night\" , added Verryn. \"(But) the real culprit was the violent repression we were living under where the boundaries and the filters that would be in a normal society had disappeared .\" AFP"}, {"articleID": "2018030200_00257560_W", "names": {"Frank Lloyd": ["Q28777471", "Q895500"], "Charles Moore": ["Q15444732", "Q1902544", "Q21068908", "Q425752", "Q5079370", "Q5081057"], "William Turnbull": ["Q325274", "Q41968214"]}, "date": "2018-03-02", "url": "https://archinect.com/news/article/150052507/christopher-hawthorne-s-frank-lloyd-wright-documentary-that-far-corner-frank-lloyd-wright-in-los-angeles-to-air-next-week", "content": "Christopher Hawthorne's <mark>Frank Lloyd</mark> Wright documentary \"That Far Corner: <mark>Frank Lloyd</mark> Wright in Los Angeles\" to air next week Follow Travis LaBella, director of photography for \"That Far Corner,\" at <mark>Frank Lloyd</mark> Wright's Ennis House in Los Feliz. Image: Jacqueline Reyno / KCET. Why focus on Wright, American architecture's equivalent of Abraham Lincoln, the giant who casts a shadow over his field big enough to blot out smaller and underrepresented figures? [...] Because the architect's brilliant if forbidding Southern California houses, the most important of which were designed in a burst of creative energy during the first few months of 1923, remain mysterious, their meaning and inspiration as opaque as their heavy, richly patterned concrete-block facades .--latimes.com Christopher Hawthorne's documentary, \"That Far Corner: <mark>Frank Lloyd</mark> Wright in Los Angeles\" , focuses on aspects of the infamous architect's work which remain enigmatic. Filming inside eight Wright buildings, the project interviews around 20 people to present new insights around these mysterious works. Hawthorne explains, \"My overarching goal was to bring some new, sustained attention to a group of houses that have lingered too long, given their importance to the American architectural canon, in the relative shadows .\" The title \"That Far Corner\" originates from a phrase Wright used to describe Southern California in his autobiography. As part of a new ARTBOUND season, the documentary airs next Tuesday March 6, at 9 p.m. ET/PT on KCET-TV. The episode will also stream online at KCET, as well as on Amazon, YouTube, Roku, and Apple TV following its broadcast. Tune in and decide what you make of Hawthorne's theory. As a bonus, several of the interviews occur inside residential designs by Rudolph Schindler, <mark>Charles Moore</mark> and <mark>William Turnbull</mark>, and Richard Neutra. Similar articles on Archinect that may interest you ..."}, {"articleID": "2016092809_00512614_W", "names": {"Thomas Cook": ["Q16205324", "Q47452628", "Q53952787"]}, "date": "2016-09-28", "url": "http://www.morningstar.co.uk/uk/news/AN_1475054874644950500/extra-britain-goes-on-holiday-after-brexit-vote-as-tui-bookings-rise.aspx", "content": "Add Your Note (Optional): LONDON (Alliance News) - Tour operator TUI Group on Wednesday said the summer 2016 holiday season is closing as expected, while winter 2016/17 also is trading in line with expectations, ahead of the close of its financial year, adding to positive updates provided by TUI's travel-industry peers earlier in the week. TUI said the summer 2016 season is 97% sold to date, with revenue and bookings up 1% year-on-year, driven by a strong performance in the UK business, where revenue and bookings are up 5%. Trading for the winter 2016/17 season is in line with the company's expectations as well, TUI said, with revenue up 11% on this time last year and bookings up 5%. TUI said this was driven in particular by UK long-haul growth. TUI added that it is confident of delivering between 12% and 13% growth in underlying earnings before interest, tax and amortisation in its full year which ends on Friday. \"This demonstrates the strength of our integrated business model and the success of our content centric strategy, as well as the continued delivery of our merger synergies,\" Chief Executive Friedrich Joussen said in a statement. TUI will release its full-year results on December 8. On Tuesday, rival <mark>Thomas Cook</mark> Group PLC had released a trading update saying its summer 2016 holiday season was closing as expected as well, while winter 2016/17 bookings were in line, although its summer bookings figures weren't as strong as TUI's. <mark>Thomas Cook</mark> said summer bookings fell by 4% overall, but would have grown by 8% excluding Turkey, which has suffered a reduction in demand over the past year due to the terrorist attacks and political turmoil plaguing the country. This was, however, in line with <mark>Thomas Cook</mark>'s expectations, with 89% of the summer programme sold, down from 92% the year before. Winter bookings, meanwhile, are up 8% so far. Like TUI, <mark>Thomas Cook</mark> maintained its full-year underlying earnings before interest and tax guidance, of GBP300 million, which will be down on the GBP310 million made the year before. On Monday, cruise operator Carnival PLC had reported growth in profit in the third quarter of its financial year to USD1 .47 billion from USD1 .25 billion the year before, as revenue rose to USD5 .10 billion from USD4 .88 billion. Carnival said it is on track to deliver 25% earnings growth in the full year. Shares in TUI were trading up 1.8% at 1,106.00 pence on Wednesday, while <mark>Thomas Cook</mark> shares were up 1.5% to 70.81 p and Carnival shares were up 1.6% at 3,787.00 p. By Karolina Kaminska; karolinakaminska @ alliancenews.com @ KarolinaAllNews Copyright 2016 Alliance News Limited. All Rights Reserved. Share via Email"}]