[{"date": "2015-09-28", "url": "http://www.nasdaq.com/article/kellogg-buys-egyptian-cereal-firm-in-emerging-market-expansion-drive-20150928-00198", "content": "Kellogg Buys Egyptian Cereal Firm in Emerging Market Expansion Drive By Dow Jones Business News, September 28, 2015, 06:33:00 AM EDTSubscribe By <mark>Ian Walker</mark> Breakfast cereal maker Kellogg Co. said Monday it is buying Egyptian cereal firm Mass Food Group for $50 million in cash, as it continues its expansion into emerging markets. Kellogg said it doesn't expect the deal to have a material impact on 2015 earnings. Mass Food, which makes Temmy's cereals and NutriFit cereal bars, was founded in 1996 and has grown annual sales to over $18 million. It also exports foods to more than 30 markets, including Europe, East Asia and Africa. \"Today's announcement builds upon significant progress against our emerging market growth strategy announced earlier this year,\" said <mark>John Bryant</mark>, chairman and chief executive, Kellogg Co. \"We are building a strong foundation for emerging market growth,\" he added. Earlier this year, Kellogg bought Bisco Misr, an Egyptian packaged biscuit company and more recently formed a joint venture with Tolaram Africa to develop snacks and breakfast foods for the West African market, as well as noodles across Africa, which are often eaten at breakfast. It has also bought 50% of Multipro, a premier sales and distribution company in Nigeria and Ghana. Emerging markets are growing in importance to cereal makers as more residents in those countries move to cities and have less time and inclination to make traditional warm breakfasts. Kellogg logged about one-third of its $14.6 billion in sales from outside the U.S. last year, with at least $2 billion coming from sales of cereal and other products in emerging markets. Its cereal sales by volume are rising by double-digit percentages in Asian emerging markets and in the 4% to 6% range in developing countries in Latin America, according to an investor presentation earlier this month. <mark>John</mark> Revill and Annie Gasparro contributed to this article Write to <mark>Ian Walker</mark> at ian.walker @ wsj.com Access Investor Kit for Kellogg's Visit http: //www.companyspotlight.com/partner? cp_code=P479 & isin=US4878361082 Subscribe to WSJ: http: //online.wsj.com? mod=djnwires (END) Dow Jones Newswires 09-28-150633ET Copyright (c) 2015 Dow Jones & Company, Inc.. This article appears in: Commodities", "articleID": "2015092810_00140504_W", "names": {"Ian Walker": ["Q30070066", "Q356378", "Q38589551", "Q57306591", "Q5983175", "Q5983179", "Q5983186"], "John Bryant": ["Q1699442", "Q20630634", "Q55825494"]}}, {"date": "2015-09-30", "url": "http://www.theblaze.com/contributions/this-gender-confused-boy-is-being-poisoned-and-abused-and-were-all-applauding/", "content": "This Gender-Confused Boy Is Being Poisoned And Abused, And We're All Applauding Sep. 30, 2015 2:19 pm <mark>Matt Walsh</mark> is a blogger, writer, speaker, and professional truth sayer. 0 Tweet This Email this story to a friend Yesterday I came across one of the most disturbing and heartbreaking videos I've ever seen in my life, and I say this as someone who watched all 10 undercover Planned Parenthood clips. It shows a mother surprising her healthy 14-year-old son with a gift: a package of estrogen patches. Her boy, Corey, decided with his mother's encouragement to start \"living as a girl\" when he was 11. Some five years before he's considered legally competent to drive or apply for a job, seven years before we trust him to vote or get a tattoo or purchase spray paint, a full decade before society judges him mature enough to consume a can of Miller Lite or gamble on a game of cards, and 15 entire years before health insurance companies will declare him an independent adult, the child decided to reject his biological identity and assume a false one for the rest of his life. When I was 11, I still hadn't given up hope of one day becoming an Avenger. When this boy was 11, his parents let him give up hope of ever becoming a man. It is nothing short of a travesty and an injustice. Want more from <mark>Matt Walsh</mark>? Follow <mark>Matt</mark> on Twitter Apparently, the young boy had already been given a \"puberty suppressing implant,\" and was eager to start a rigorous estrogen routine, which would stunt his physical maturation, infuse harmful chemicals into his growing body, interfere with his development, and create the synthetic facade of femininity. Estrogen is particularly important for (real) women because it thickens the lining of the uterus, enabling the implantation of fertilized eggs. Interestingly, no \"trans woman\" has ever, will ever, or can ever have eggs to fertilize or a uterus to implant them in. Men do have some estrogen naturally, but high levels of the hormone put them at a considerable risk for heart disease, cancer, obesity, diabetes, and other serious side effects. I guess that's a fatal chance Corey's mother and doctors are willing to take. This kind of hormone therapy is common for women who are menopausal or who struggle with fertility, but it's incredibly dangerous for a perfectly healthy teenage boy. Nobody knows what sort of physiological devastation this will wreak, but we do know something about the psychological toll; sadly, a vast number of \"transgender\" people fall into a deep despair and attempt suicide after \"transitioning .\" This boy has a tough, terrible road ahead of him. All we can do is pray for him. Corey Maison's mother surprised her transgender daughter with her first box of hormone treatments. (Image source: YouTube) But dangerous or not, the boy's quack doctors had no problem prescribing him medication usually taken by grown women. It was determined by all involved--mother, child, reckless medical professionals who should be fired and imprisoned--that Corey ought to be deprived of the opportunity to grow into a healthy man all because he likes to wear pink and play with dolls. His mother marked the happy occasion by giving him the women's hormones on camera for all the world to see. The boy still won't be able to buy DayQuil for another two years, but at least now he's legally ingesting medication meant to treat hot flashes in 55-year-old grandmas. Naturally, liberal outlets fawned over the footage. MTV called it \"life changing\" and declared the boy's mother \"mom of the year .\" The Daily Mail described it as \"moving\" and \"emotional .\" BuzzFeed wrote about it glowingly, noting that the family has received \"nothing but positive reactions .\" Huffington Post called it \"beautiful\" and \"wonderful .\" Cosmopolitan gushed that this \"was the emotional moment a mom changed her trans daughter's life .\" Other outlets squealed that it was \"special\" and \"the best gift ever .\" The comments threads under these articles have, as BuzzFeed accurately reported, been almost entirely celebratory. Something tells me these people wouldn't be celebrating if a mother filmed herself giving her effeminate son testosterone to be more manly. Magically, as soon as the video went viral, a crowdfunding page (I won't link to it) was set up to help the boy with \"medical expenses\" and college tuition. They don't specify what the expenses are exactly, or why his college tuition ought to be handled by charity, but one wonders if the money from the donors will eventually help pay for the day when this poor boy's genitals are removed. I would say it's unprecedented for the mutilation of a child to be funded by cheering strangers, but then I remember Planned Parenthood. Just think about it: the boy is being poisoned on camera, and virtually no one has offered even a word of protest. It makes me think back to a few weeks ago when a mother was filmed giving wine to a toddler. She was deservedly condemned and castigated by everyone, but that was nothing compared to this. Giving wine to a toddler is bad. Injecting high doses of estrogen into a 14-year-old boy is psychotic. I don't mean the boy is acting psychotically, I mean the adults in his life and in the medical community are. Corey is simply acting like an adolescent who's grown up in an environment utterly devoid of guidance and clarity. He is a victim, and not a single person has stood and spoken out for him. It's not his fault he's been abused by his parents and his doctors. It's not his fault nobody ever stepped up to teach him to love himself and seek and accept God's plan for his life. It's not his fault he'll be used as a stage prop by predators in the LGBT movement. It's not his fault his mother not only decided to poison him, but broadcast his personal torment all over the internet. It's not his fault our culture has legitimized the mental illness of gender confused people. Indeed, it's that last point I think we need to reflect upon. Corey's mom tells us he was \"always feminine .\" She says she \"just assumed [he] might be gay .\" Already we see how gender stereotypes are rigidly enforced by the very people pretending to break them down. Even if the boy was \"feminine,\" why must that automatically mean he's gay or a girl? I thought girls don't have to be feminine and boys don't have to be masculine? I mean, isn't that the whole point liberals have been making about gender for the past 40 years? Who's putting men and women into boxes here? Who's denying that men can be effeminate? It's certainly not me. I completely accept the notion that some boys are less boyish than others. I would never allow my son to dress up like a princess or run around wearing makeup and tutus, but I'm not so backwards as to think the makeup and tutu are medical symptoms. That's the anti-science LGBT perspective, not mine. I believe there's a wide range of ways in which a boy might express his masculinity. It is the gay agenda--not any \"conservative\" or Christian initiative--that really restricts children (and exploits them). Marchers walk down Fifth Avenue during the 2014 Gay Pride March on June 29, 2014 in New York City. (Photo by Eric Thayer/Getty Images) Corey's mother says he \"loved to wear high heels and dresses\" from a young age. Of course he did. When they're young enough, any child loves to wear anything. A 2-year-old sees a dress as just another fun, silly costume. Their affinity for the fabric means absolutely nothing, unless the parent gives it meaning. Moreover, a boy does not develop a consistent habit of wearing girl clothes on his own, anymore than a fifth grader could develop a drinking habit on his own. I realize you can't control everything your kid does, but if your 9-year-old son is regularly donning skirts and blouses, it's because you're letting him. You're tolerating it. You're encouraging it. If you decide to tolerate and encourage whatever weird, disordered behavior your child wants to indulge in, there's no telling what you'll end up with. If my parents weren't there to offer me even the basic, fundamental direction and instruction parents are meant to impart, I might still be crawling around on all fours and barking like a dog or darting around the house in my Batman cape. The point is, parents are supposed to guide children in the process of becoming themselves, not in becoming somebody else. But what struck me about Corey's tale is that, according to his mother, he decided he was \"transgender\" only after watching another YouTube video about a \"transgender\" boy who pretends to be a girl named Jazz. Corey, 11 years old at this point, didn't \"recognize his inner female identity\" until he saw a \"transgender\" propaganda video of the sort he would eventually star in himself. This was just a confused boy whose parents let him wear dresses--until he saw a video. Then he mystically became a girl. As Elite Daily records, \"...it wasn't until the fifth grade, when Maison watched a video by transgender YouTube star Jazz Jennings, that he realized he didn't just like girly things--he was a girl .\" WHAT? This is nonsense to its core, yet the whole country just goes along with this sort of thing. He saw a video and realized he was a girl? How so? How do you distinguish between a boy who \"likes girly things\" and a boy who \"is a girl,\" aside from the the obvious distinction that one is a physically impossible oxymoron? Is there some kind of medical test that detects when \"liking girly things\" crosses over into \"being a girl\" ? And, again, what is a \"girly thing\" ? I thought we're supposed to believe there's no such thing as a girly thing? Isn't that why Target went gender neutral? Does any of this make sense? I swear, everyday I feel like I'm sitting in a basement with the entire country and I'm the only one who isn't high on LSD. In any case, the important takeaway is that the perversions heralded by progressivism--\"transgenderism,\" homosexuality, etc.--can, in effect, spread. A person can indeed \"become\" gay or \"transgender,\" due to the heavy, almost suffocating influence society has on his sexual formation. A child, especially when he lacks proper parental guidance, is profoundly susceptible to the messages promoted through TV, movies, and music. He goes to the media and pop culture with his feelings and confusions, and these defacto counselors and parental figures interpret his feelings for him. \"Oh, you're wearing pink shorts? Well, maybe you're a girl!\" If that's a convincing argument to grown adults in this country, imagine how it sounds to a child. Corey was likely just a normal--if slightly more effeminate--boy. Had his parents steered him away from cross dressing, and had he existed in a culture that doesn't try so hard to normalize deviant behaviors, he'd be a well adjusted young man by now. One day he'd probably go on to become a husband and a father, and he'd live his life with his natural body and organic identity. He'd be fine. He'd be happy. He'd be true. Our culture took that from him. And as parents, that should terrify us. Even if we dedicate ourselves to \"training a child up in the way they should go\" (Proverbs 22:6), they are still living in a deeply depraved and wicked culture. Just this morning I read about the casting contract for a new HBO show debuting next year. It's going to be, maybe even more than \"Game of Thrones,\" hardcore porn airing at 8 or 9 on a Sunday night while your kids are still awake. The contract stipulates that performers on the program \"may be required to perform genital-to-genital touching, simulate oral sex with hand-to-genital touching, contort to form a table-like shape while being fully nude, pose on all fours while others who are fully nude ride on your back, [and] ride on someone's back while you are both fully nude .\" No doubt this will be another critically renowned smut-fest that quickly ingrains itself into the Zeitgeist. Another report tells us the next Oscars ceremony will likely be dominated by propaganda movies about \"transgenders\" and gays. And even if you steer your child away from premium cable and homosexual films, there's still some five or six shows on TV celebrating and normalizing gender confusion. And don't worry, if he flips past that, your kid might find a cartoon show where Jesus Christ has sex with a married woman, or commercials where half naked women sell hamburgers. Beyond movies and TV, the internet is obviously teaming with pornography and progressive sexual indoctrination, now branching into regularizing pedophilia. Of course, your child's public school won't be a shelter from such things, as more districts are taking it upon themselves to teach kindergartners how to have sex and masturbate. When you think about it all at once, you might see why I find politics so irrelevant. Go ahead and put a Republican in the White House. What good will that do when our society is fundamentally rooted in debauchery, and our children are raised from a young age to reject their true selves and rejoice at porn, sodomy, and violence against the unborn? Do you think lower taxes and border walls will save us from that? I only wish more Christians and \"conservatives\" would speak out loudly about our culture's descent into corruption and madness. This is where the real battle must be fought. While we're all talking about the presidential election, progressives have spent the last couple of days throwing parades for a mother who poisoned her son with medically unnecessary medication. Why? Because they know they win everything if they can convince society to accept their teachings about sex, gender, and the nature of human life. Nothing matters once that process is complete. Until the rest of us wake up to this reality and jump into the fight to save our culture from mass suicide, there's not much progress that can be made collectively. However, on an individual basis, we can keep our children close, pray with them every night, show them God, show them beauty, show them goodness, and equip them to venture out into the world and fight to the death for Truth. That's really the only hope we have. As for young Corey, I pray one day, with the Lord's help, he finds his way to the light. Hopefully that happens before it's too late .--TheBlaze contributor channel supports an open discourse on a range of views. The opinions expressed in this channel are solely those of each individual author.", "articleID": "2015093018_00081880_W", "names": {"Matt Walsh": ["Q2278533", "Q611871"]}}, {"date": "2015-10-05", "url": "http://heatworld.com/2015/10/the-x-factors-4th-impact-admit-theyve-never-been-kissed", "content": "By Anna Lewis Deputy Editor on Monday, 5 October 2015 at 11:32 They're the cutest thing to happen to The X Factor since Squiddly and Diddly, but girlband 4th Impact--previously 4th Power--have admitted that they've never been kissed. TOP NEWS The Vamps unveil Wake Up video starring BROOKLYN BECKHAM <mark>Tom Jones</mark> on leaving The Voice: \"They can go f ** k themsevles\" <mark>Sam Smith</mark> reveals video for Bond theme, Writing's On The Wall The sisters--Almira, 27, Irene, 25, Mylene, 23, and 19-year-old Celena Cercado--revealed to the Daily Mirror that they are all teetotal virgins who take their Filipino parents' strict Catholic rules VERY seriously. Irene told the newspaper: \"We have never kissed boys before. It is very strict in the Philippines, and so different to the UK. Our mum is very strict .\" I'm the only one who has ever had a boyfriend and we make sure Mum is there at all times. We are never on our own together. \"Almira added that the girls' mum (who is also their manager) and dad are worried about them living in the contestants' house with boys should they make it to the live shows. She giggled:\" Our mum is so worried about us living in a contestant house with boys, but we've promised to be well behaved. Some boys are good looking here, but we can't pay attention to them. \"That's right, girls--concentrate on the music. Watch the next episode of The X Factor on Sunday at 7pm on ITV.", "articleID": "2015100511_00142472_W", "names": {"Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"], "Tom Jones": ["Q16091498", "Q16730416", "Q180850", "Q23303147", "Q23683528", "Q2439753", "Q7816364", "Q7816370", "Q927200"]}}, {"date": "2015-10-05", "url": "http://kickoff.com/news/59432/clive-barker-gives-abia-nale-another-trial-at-maritzburg-united", "content": "<mark>Clive Barker</mark> gives Abia Nale another trial at Maritzburg United Posted: 5 October 2015 Time: 14:25 Print this article New Maritzburg United coach <mark>Clive Barker</mark> has handed Abia Nale another trial at the club. Aces decided against signing Nale last month as they. prioritised hiring a replacement for sacked coach Mandla Ncikazi However, <mark>Barker</mark> has now requested a second look at Nale, who he previously worked with at Mpumalanga Black Aces. \"I love Nale, he's a terrific player and he can play wide,\" says <mark>Barker</mark>. \"He has the ability to put a foot down on the ball and slow it down and quicken in it up .\" I wouldn't mind Nale coming in and playing for us and that will be fantastic. \"Nale, affectionately known as the\" Soul Provider', was in the stands when United beat Jomo Cosmos 2-1 in the Telkom Knockout last-16 at Harry Gwala Stadium on Friday night. <mark>Barker</mark> is currently reliant on the likes of Kurt Lentjies and on-loan midfielder Siyabulela Shai for creativity in the final third. Article by: Robin-Duke Madlala Terms of use: The comments posted do not reflect the views of KickOff.com. Users are reminded that no misuse of this comment facility will be tolerated. Any abusive, racist, inflammatory, defamatory, discriminatory comments or hate speech will be deleted and the user banned. If legally obliged we will hand over your information under the Protection of Information Act. Please report abusive posts to editor @ kickoff.com. Absa Premiership Editorial: +27 (0) 21 408 3839 Advertising: +27 (0) 11 505 5703", "articleID": "2015100512_00084155_W", "names": {"Clive Barker": ["Q298761", "Q3680861", "Q5134490"]}}, {"date": "2015-10-05", "url": "http://westhawaiitoday.com/news/nation-world-news/japan-keeps-lid-rice-us-sugar-trans-pacific-deal", "content": "Japan keeps lid on rice, US on sugar in Trans-Pacific deal Published October 5, 2015 - 9:47 am Updated: October 5, 2015 - 9:47 am By Alan Bjerga Bloomberg News Japan budged little on rice, the U.S. gave few concessions on sugar and Canada's dairy system stayed intact in the Trans-Pacific Partnership agreement reached by trade ministers of 12 nations Monday, with the toughest agriculture issues resolved by tinkering. The deal gives U.S. livestock producers new market access and simplifies inspection rules for fruits and vegetables while lowering taxes across farm goods, according to Darci Vetter, the U.S. Trade Representative's chief agriculture negotiator. While not reaching the ideals hoped for by domestic commodity groups, American agriculture benefits more than enough to line up behind the deal, Vetter said. \"The whole point of trade is that not every country's responsibilities are the same. Not everyone is focused on the same products,\" Vetter said in an interview before the final deal was announced. \"We have some wins in here .\" Negotiators in Atlanta wrapped up final agreements on agriculture, autos, drug patents and other thorny issues that have held up the TPP, a top priority of U.S. President Barack Obama. The deal includes nations that compose 40 percent of the world economy and create a regional trade bloc countering China's growing influence in Asia. U.S. farm exports topped $150 billion in 2014 and account for more than one-fifth of the country's agriculture production, according to government data. TPP will boost sales by \"billions,\" Vetter said, declining to make a specific estimate. Rice, sugar Tariffs and other barriers to farm goods, including rice, sugar and dairy, were among the final snarls that caused earlier talks in Hawaii to break off in July. U.S. negotiators touted agricultural opportunities they're gaining in growing Asian markets, where reductions in tariffs on U.S. goods would make products more competitive with Australia, New Zealand and other competitors, Vetter said. \"Our meat industry is a big winner,\" Vetter said, with pork duties going away in Vietnam and Japan capping tariffs on the meat at 50 yen per kilogram and making it easier for U.S. shippers such as Tyson Foods Inc. to target specific meat cuts for the Japanese markets. Pork was one of Japan's top-priority agricultural commodities heading into the TPP, along with beef, dairy, sugar, rice and other grains. On rice, Japan is establishing a new quota of 50,000 tons of U.S. imports, which will rise to 70,000 over 13 years, along with potential new opportunities for increased U.S. sales within quotas already created through the World Trade Organization. Less than hoped The quota was less than that hoped for by rice exporters in the U.S., the fifth-leading shipper of the grain after Thailand, India, Vietnam and Pakistan. Japan, where the grain has been culturally and economically important for millennia, imports almost none of its supply, thanks to high tariffs supported by JA-Zenchu, the nation's union of farmer cooperatives. While not as important culturally as rice to Japan, U.S. sugar access was another obstacle, with Australia wanting the U.S. to loosen a quota system that protects its own industry and protections that date to the Great Depression. Under TPP, the U.S. is establishing a new quota for Australia, with an option to raise that allotment in years when the domestic import need is greater, Vetter said. \"We're providing Australia with the same upfront quota as other nations,\" Vetter said. Dairy fight Dairy was the last major area to be resolved. Exporters Australia and New Zealand had called for greater access to the U.S. market, though the biggest criticisms were reserved for Canada, where a system of tariffs and supply management has insulated the country's 12,000 dairy farmers from the rest of the world. Dairy has emerged as an emotional issue in Canada's nationwide elections to be held later this month. Tractors converged on Ottawa, the nation's capital, earlier this week as farmers pressured the government to reject any TPP agreement. One of the final pieces of the deal to come together involved Canada's unique protections against imported dairy goods. In the end, Canada agreed to open--over five years--foreign quotas for 3.3 percent of its dairy market, 2.3 percent of its egg market, 2.1 percent of its chicken market, 2 percent of its turkey market and 1.5 percent of its broiler hatching eggs market. \"We obviously would have preferred that no additional market access be conceded in the dairy sector,\" Dairy Farmers of Canada President <mark>Wally Smith</mark> said in an e-mail. \"However, we recognize that our government fought hard against other countries' demands, and have lessened the burden by announcing mitigation measures and what seems to be a fair compensation package .\" To contact the reporter on this story: Alan Bjerga in Washington at abjergabloomberg.net To contact the editors responsible for this story: Jon Morgan at jmorgan97bloomberg. net Elizabeth Wasserman", "articleID": "2015100520_00045677_W", "names": {"Wally Smith": ["Q57829222", "Q7963493"]}}, {"date": "2015-10-07", "url": "http://www.denverpost.com/ci_28933921/jay-leno-revisits-tonight-monologue", "content": "Jay Leno revisits \"Tonight' for monologue The Associated Press Posted: 10/07/2015 08:27:44 AM MDT Updated: 10/07/2015 08:27:44 AM MDT NEW YORK (AP)--For a few minutes, it felt like old times back on NBC's\" Tonight \"show on Tuesday night. Jay Leno was telling jokes. Host Jimmy Fallon pretended to pull a hamstring during his monologue, calling for an emergency replacement--his predecessor. Leno, who left the show last year after two decades in charge, is busy promoting a new car-focused show for CNBC. Leno got rolling right away with political one-liners. He noted that presidential candidate Marco Rubio is being called the best communicator in the Republican Party,\" which is kind of like being the smartest Kardashian. \"If Democrat Bernie Sanders wins, Leno said,\" he'll be the first socialist elected president since 2008. \"And if the Republican race comes down to Jeb Bush against <mark>Donald Trump</mark>, it will be like\" the tortoise and the bad hair. \"Leno, looking slightly paunchier than when regular monologues kept him in fighting shape, even poked fun at neighbors of the former California-based\" Tonight \"show. Fallon moved the show to New York when he took over .\" The economy is so bad that parents in <mark>Beverly Hills</mark> are being forced to raise their own children, \"Leno said. Advertisement", "articleID": "2015100714_00142905_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-10-09", "url": "http://www.goupstate.com/article/20151008/wire/151009743", "content": "N. Charleston to pay $6.5 M settlement to family of man shot by cop <mark>BRUCE SMITH</mark> Published: Thursday, October 8, 2015 at 8:00 p.m.. Last Modified: Thursday, October 8, 2015 at 8:47 p.m. NORTH CHARLESTON--City officials in South Carolina approved a $6.5 million settlement Thursday with the family of an unarmed black man fatally shot by a white police officer who was captured on cellphone video firing at the man's back as he ran away. The North Charleston City Council approved the settlement by a 10-0 vote, and members of <mark>Walter Scott</mark>'s family were on hand when it was announced. Scott, 50, was shot April 4 by North Charleston officer Michael Slager while trying to run from a traffic stop. A bystander recorded the shooting in dramatic cellphone video. Slager was indicted on a murder charge in June and a judge refused to set bond last month, saying his release would \"constitute an unreasonable danger to the community .\" \"While nothing can replace having <mark>Walter</mark> in our lives, the City of North Charleston's historic action ensures that he did not die in vain,\" Scott's brother Anthony said, noting the settlement will provide for Scott's children. \"It was a bittersweet victory,\" he added. \"The family still wants justice for my brother and this was a step in the right direction .\" Anthony Scott said the family plans to donate some of the money from the settlement to disaster relief for victims of the recent floods in South Carolina. Mayor Keith Summey said he was pleased with the settlement. \"The family took steps to keep the community calm, and for that the city is thankful,\" he said. \"This is a very difficult period for the Scott family. I know they are glad to have this part behind them so their healing process can continue .\" The bystander's cellphone video showed Slager firing eight times as Scott ran. The shooting inflamed the national debate about how blacks are treated by law enforcement officers. After the video went public, the family called for peace and calm in the community. At least in part, the family's actions are believed to have prevented the kind of violence that erupted elsewhere in the nation following the deaths of black men following encounters with law enforcement. The mayor said that since the shooting, North Charleston police have been outfitted with body cameras. Slager was not wearing one. Summey also noted the police department will be working with a division of the Department of Justice that helps local communities resolve issues involving race, color, national origin or gender. City Attorney Brady Hair said Summey met with the family and their attorney several days after the shooting. Hair said both sides felt that it was in everyone's best interest to reach a resolution and avoid a lawsuit. While attorneys for the family said at the time they might sue, they never did. A mediator helped negotiate the settlement, which Hair said will be paid by the city's insurance carrier and from the city's reserve fund. He said how much would come from each has not been worked out. Attorney <mark>Chris Stewart</mark>, who represents the Scott family, said a number of issues had to be considered in reaching the $6.5 million figure. Noting that North Charleston is no New York, he remarked, \"There is no way this city could pay $50 million .\" He said attorneys also had to consider the damage a drawn-out legal battle might do to the city and its residents. Hair said the $6.5 million represents the largest settlement for such a case in the state's history. Slager was fired following his arrest on the murder charges and has been detained in solitary confinement. Before the video was brought to the attention of authorities, Slager had told investigators that Scott tried to grab his gun and Taser. But prosecutor Scarlett Wilson said Scott was running away and the only time Slager could be seen running was to go back, pick up the Taser and then drop it by Scott's body. Slager faces from 30 years to life in prison without parole if he is convicted of murder. There were no aggravating circumstances such as robbery or kidnapping, so the death penalty doesn't apply in the case, the prosecutor has said. Reader comments posted to this article may be published in our print edition. All rights reserved. This copyrighted material may not be re-published without permission. Links are encouraged.", "articleID": "2015100908_00017626_W", "names": {"Bruce Smith": ["Q18128176", "Q18379173", "Q20196149", "Q20985780", "Q4978299", "Q4978300", "Q4978301", "Q59223435", "Q952956"]}}]