[{"date": "2015-10-09", "url": "http://www.goupstate.com/article/20151008/wire/151009743", "content": "N. Charleston to pay $6.5 M settlement to family of man shot by cop <mark>BRUCE SMITH</mark> Published: Thursday, October 8, 2015 at 8:00 p.m.. Last Modified: Thursday, October 8, 2015 at 8:47 p.m. NORTH CHARLESTON--City officials in South Carolina approved a $6.5 million settlement Thursday with the family of an unarmed black man fatally shot by a white police officer who was captured on cellphone video firing at the man's back as he ran away. The North Charleston City Council approved the settlement by a 10-0 vote, and members of <mark>Walter Scott</mark>'s family were on hand when it was announced. Scott, 50, was shot April 4 by North Charleston officer Michael Slager while trying to run from a traffic stop. A bystander recorded the shooting in dramatic cellphone video. Slager was indicted on a murder charge in June and a judge refused to set bond last month, saying his release would \"constitute an unreasonable danger to the community .\" \"While nothing can replace having <mark>Walter</mark> in our lives, the City of North Charleston's historic action ensures that he did not die in vain,\" Scott's brother Anthony said, noting the settlement will provide for Scott's children. \"It was a bittersweet victory,\" he added. \"The family still wants justice for my brother and this was a step in the right direction .\" Anthony Scott said the family plans to donate some of the money from the settlement to disaster relief for victims of the recent floods in South Carolina. Mayor Keith Summey said he was pleased with the settlement. \"The family took steps to keep the community calm, and for that the city is thankful,\" he said. \"This is a very difficult period for the Scott family. I know they are glad to have this part behind them so their healing process can continue .\" The bystander's cellphone video showed Slager firing eight times as Scott ran. The shooting inflamed the national debate about how blacks are treated by law enforcement officers. After the video went public, the family called for peace and calm in the community. At least in part, the family's actions are believed to have prevented the kind of violence that erupted elsewhere in the nation following the deaths of black men following encounters with law enforcement. The mayor said that since the shooting, North Charleston police have been outfitted with body cameras. Slager was not wearing one. Summey also noted the police department will be working with a division of the Department of Justice that helps local communities resolve issues involving race, color, national origin or gender. City Attorney Brady Hair said Summey met with the family and their attorney several days after the shooting. Hair said both sides felt that it was in everyone's best interest to reach a resolution and avoid a lawsuit. While attorneys for the family said at the time they might sue, they never did. A mediator helped negotiate the settlement, which Hair said will be paid by the city's insurance carrier and from the city's reserve fund. He said how much would come from each has not been worked out. Attorney <mark>Chris Stewart</mark>, who represents the Scott family, said a number of issues had to be considered in reaching the $6.5 million figure. Noting that North Charleston is no New York, he remarked, \"There is no way this city could pay $50 million .\" He said attorneys also had to consider the damage a drawn-out legal battle might do to the city and its residents. Hair said the $6.5 million represents the largest settlement for such a case in the state's history. Slager was fired following his arrest on the murder charges and has been detained in solitary confinement. Before the video was brought to the attention of authorities, Slager had told investigators that Scott tried to grab his gun and Taser. But prosecutor Scarlett Wilson said Scott was running away and the only time Slager could be seen running was to go back, pick up the Taser and then drop it by Scott's body. Slager faces from 30 years to life in prison without parole if he is convicted of murder. There were no aggravating circumstances such as robbery or kidnapping, so the death penalty doesn't apply in the case, the prosecutor has said. Reader comments posted to this article may be published in our print edition. All rights reserved. This copyrighted material may not be re-published without permission. Links are encouraged.", "articleID": "2015100908_00017626_W", "names": {"Chris Stewart": ["Q1077782", "Q22254232", "Q30084424", "Q4068880", "Q5108164", "Q713526", "Q902651"], "Walter Scott": ["Q19788938", "Q21003959", "Q24007630", "Q27981542", "Q33692775", "Q43913865", "Q48814644", "Q7966090", "Q7966092", "Q7966094", "Q7966095"]}}, {"date": "2015-10-07", "url": "http://canberratimes.com.au/domain/domain-news/latest-news/werribees-first-apartment-tower-site-up-for-grabs-20151006-gk2zx3.html", "content": "Oct 7, 2015 Kirsten Robb Data Journalist Werribee Town Centre. There are plans to develop Werribee into a major city centre with high rise towers. Could this be the beginning of high rise living in Werribee? A double-block site, zoned to host a seven level apartment block, is piquing the interest of developers in Melbourne's outer west. If permits were issued, it would be the tallest residential apartment tower built in Werribee. The tallest building is currently a four storey serviced apartment block on Synnot Street in Werribee's town centre. The two properties at 41 and 43 Cottrell Street recently came on the market following the 2014 death of local identity and pharmacist Hinton Lowe, who owned one of the homes. Mr Lowe's neighbours saw the appeal of combining the site, after the area was re-zoned from residential to commercial use as a part of Werribee's Activity Centre Boundary. The land has been earmarked for mixed-use city development, with both state and local government encouraging higher density development in the area. Wyndham City Council has fast - racked the planning process, allowing potential developers to apply for permits along the area online. Domain understand there is currently one application for a seven level commercial building currently before the council. Wyndham Mayor Cr Peter Maynard said while nothing had yet been approved, high density living in the area had been welcomed by most residents. \"There is certainly a need for options for people, and we will try to tailor them to suit what we need,\" Cr Maynard said. The activity centre borders the 775 hectare old State Research Farm area in East Werribee, which the state government is currently reviewing tenders for. One of the bids included plans for 50-level skyscrapers amongst Melbourne's newest major education and employment hubs. Werribee City Centre and East Werribee are earmarked for enormous expansion and mixed-use city development. Photo: Wyndham City Council Brian Mark Real Estate agent <mark>Stephen Murphy</mark>, who is listing the sale of the Cottrell Street site via private treaty, said he had received significant interest in the site, particularly from overseas investors. \"We've spoken to developers from Indonesia and China, as well as a few local people,\" Mr <mark>Murphy</mark> said. Plans for the site will have to include commercial street frontage--such as ground floor offices, a restaurant or retail businesses--but can have apartments behind that frontage and on the upper floors, to a height of seven levels. The plans will see Mr Lowe's architectually-designed estate, at number 41, demolished. It had been crafted by well-known Melbourne architect <mark>Peter McIntyre</mark>, whose major projects include Melbourne's Parliament Station, The Jam Factory and the 1952 Melbourne Olympic Swimming Pool. The archictually designed home at 41 Cottrell Street, Werribee will likely be demolished to make way for an a high-rise apartments Photo: Supplied Mr <mark>Murphy</mark> said the of 2631 square-metre site on the Werribee River front was a rare opportunity, given the changing nature of Werribee. \"I can't imagine a better place to be buying something, in line with the what's happening with Werribee right now,\" he said. \"I'm personally very excited for my kids growing up, it will be the new city of the west out here, it's a very dramatic change .\" LJ Hooker Werribee director Adrian McEvoy said the news of the re-zoing had excited residents who believed they could cash in on developer hotspots. \"When you have zoning changes, it goes around like bushfire,\" Mr McEvoy said. \"All of sudden they have dollar signs in their eyes .\" He said many people were inquiring with agents, the council and architects about the possibilities their properties held and we starting to talk to thier neighbours about combining blocks. \"Real people are investigating and seeing what can and can't do, either on their own or by teaming up with their neighbours .\" Domain Home Price Guide Find out what your property's worth Find out now! Domain", "articleID": "2015100914_00153798_W", "names": {"Peter Mcintyre": ["Q40001085", "Q7175790", "Q7175792", "Q7175794"], "Stephen Murphy": ["Q16733036", "Q20745075", "Q21090563", "Q551440", "Q55367520", "Q7610061", "Q7610062", "Q7610063", "Q7610064"]}}, {"date": "2015-10-13", "url": "http://www.publicopiniononline.com/nation-world/ci_28962814/man-convicted-dallas-officers-2001-death-faces-execution", "content": "Man convicted in Dallas officer's 2001 death faces execution By Michael Graczyk Associated Press Updated: 10/13/2015 02:07:42 PM EDT HUNTSVILLE, Texas (AP)--The 19-year-old was already wanted in Dallas in the fatal shooting of a neighbor when he got involved in a brawl outside a club, pulled out a 9 mm semi-automatic handgun and opened fire on police as they tried to break up the fight. Licho Escamilla's bullets twice struck Christopher <mark>Kevin James</mark>, among four uniformed Dallas officers working off-duty security that 2001 Thanksgiving weekend, knocking him to the ground. Escamilla then calmly walked up to <mark>James</mark> and pumped three more shots into the back of his head before running and exchanging shots with other officers, witnesses said. A wounded Escamilla was arrested as he tried to carjack a truck. On Wednesday night, Escamilla is slated to become the 24th convicted killer put to death this year in the United States--with Texas accounting for half of the execution. The U.S. Supreme Court last week refused to review the 33-year-old's case, the Texas Board of Pardons and Paroles on Monday decided against a reprieve and recommending clemency and no new appeals were in the courts Tuesday. \"He's a really bad guy,\" trial prosecutor Fred Burns said Tuesday. \"I think what happened is the guy already committed one murder and figures that's what (officers) were coming after him for .\" Advertisement A warrant had been issued for Escamilla in the shooting death of a West Dallas neighbor nearly three weeks before <mark>James</mark>' death on Nov. 25, 2001. Escamilla's trial attorneys told jurors he was responsible for <mark>James</mark>' slaying but argued it didn't merit a death sentence because <mark>James</mark> was not officially on duty, meaning the crime didn't qualify as a capital murder. As the judge in October 2002 read his death sentence, Escamilla threw of pitcher of water at the jury, started kicking and hitting people and hid under the defense table until he was subdued by sheriff's deputies. \"It was a real scene,\" Wayne Huff, Escamilla's lead trial lawyer, said. \"I don't think there was any real doubt he was going to be found guilty .\" Testimony showed Escamilla bragged to emergency medical technicians who were treating his wounds that he had killed an officer and injured another and that he'd be out of jail in 48 hours. He also admitted to the slaying during a television interview from jail. <mark>James</mark>, 34, had earned dozens of commendations during his nearly seven years on the Dallas police force after graduating at the top of his cadet class. He was working the off-duty security job to earn extra money so he and his new wife could buy a house. A second officer wounded in the gunfire survived. According to court documents, Escamilla and some older brothers were involved in gang activities and sold and used drugs from an early age. He was involved in two high-speed police chases and an assault on an assistant principal in school, where he dropped out after the eighth grade.", "articleID": "2015101318_00071739_W", "names": {"Kevin James": ["Q22278351", "Q44561", "Q6396595", "Q6396597", "Q6396599", "Q6396601"]}}, {"date": "2015-10-15", "url": "http://kulr8.com/story/30270240/tester-introduces-new-bill-supporting-rural-education", "content": "Tester introduces new bill supporting rural education - KULR8. com | Local News, Weather & Sports | Billings, MT Tester introduces new bill supporting rural education - KULR8. com | Local News, Weather & Sports | Billings, MT Member Center: Tester introduces new bill supporting rural education Posted: BILLINGS - Thursday morning's WEA-WFT Conference at Skyview High School brought Senator Jon Tester to the Magic City. Tester spoke at the 8 a.m. educator's conference and introduced a new bill he says will encourage teachers to teach in rural America. That bill, the Rural Educator Support and Training (REST) Act, will provide scholarships to college students who commit to teach in a rural school for at least five years, as well as provide student loan forgiveness to teachers working in rural schools for five years or more. \"I think that this incentive will allow people to be able to go into rural areas in this country, and most of Montana is rural, to teach in some of those rural schools where we need more teachers,\" Tester said Thursday. Tester said the bill will also help this generation of students receive a better education in this economy. \"As with anywhere in the country, I think that public education is so critically important to our democracy and our economy,\" Tester said. Before Thursday's conference at Skyview, Senator Tester met with Wake Up Montana's Melinda Lee to discuss the bill he planned to introduce in the video above. Next, Tester said he plans to formally introduce the bill next week and hopes to gather co-sponsors. He said even if the bill is added as an amendment to another bill, the key is sparking discussion about education in rural America. \"As long as we get a good debate on the issue and talk about the challenges in rural America when it comes to education and teaching our kids, then I think we'll get a very positive outcome .\" Updated: Thursday, October 15 2015 2:19 PM EDT2015-10-15 18:19:16 GMTThursday morning's WEA-WFT Conference at Skyview High School brought Senator Jon Testor to the Magic City. Tester spoke at the 8 a.m. educator's conference and introduced a new bill he says will encourage teachers to teach in rural America. Thursday morning's WEA-WFT Conference at Skyview High School brought Senator Jon Testor to the Magic City. Tester spoke at the 8 a.m. educator's conference and introduced a new bill he says will encourage teachers to teach in rural America. Thursday, October 15 2015 1:00 PM EDT2015-10-15 17:00:42 GMTU. S. Rep. Ryan Zinke says he is considering running for House speaker. U.S. Rep. Ryan Zinke says he is considering running for House speaker. Updated: Thursday, October 15 2015 12:44 AM EDT2015-10-15 04:44:39 GMTCody's police chief is retiring. He's not going to another police job. He's going to do community service elsewhere. His work in northwest Wyoming went beyond enforcing the law. Cody's police chief is retiring. He's not going to another police job. He's going to do community service elsewhere. His work in northwest Wyoming went beyond enforcing the law. Updated: Wednesday, October 14 2015 11:50 PM EDT2015-10-15 03:50:46 GMTA judge has signed an arrest warrant for a woman who is accused of hitting a Montana daycare owner with a shovel. A judge has signed an arrest warrant for a woman who is accused of hitting a Montana daycare owner with a shovel. Updated: Wednesday, October 14 2015 11:26 PM EDT2015-10-15 03:26:43 GMTA woman is charged with assault with a weapon after a 36-year-old Montana State University student reported he was stabbed in the neck during an argument. A woman is charged with assault with a weapon after a 36-year-old Montana State University student reported he was stabbed in the neck during an argument. Updated: Wednesday, October 14 2015 8:08 PM EDT2015-10-15 00:08:22 GMTOvercrowding at the Yellowstone County Jail reached a new high this week, going into Tuesday they had 501 inmates. Overcrowding at the Yellowstone County Jail reached a new high this week, going into Tuesday they had 501 inmates. Wednesday, October 14 2015 8:06 PM EDT2015-10-15 00:06:04 GMTAn interpretive sign with information about the Clarks Crossing site in Billings is unveiled today. An interpretive sign with information about the Clarks Crossing site in Billings is unveiled today. Updated: Wednesday, October 14 2015 7:50 PM EDT2015-10-14 23:50:48 GMTToday is National Fossil Day and North America produces more fossils than anywhere else in the world. Today is National Fossil Day and North America produces more fossils than anywhere else in the world. Wednesday, October 14 2015 7:33 PM EDT2015-10-14 23:33:27 GMTA fire that started at a warehouse on Minnesota Ave. Wednesday afternoon is under investigation. A fire that started at a warehouse on Minnesota Ave. Wednesday afternoon is under investigation. Updated: Wednesday, October 14 2015 5:19 PM EDT2015-10-14 21:19:28 GMTThe state is proposing to exclude religious schools from benefiting from a new law that allows people to take tax credits for donating to public and private schools. The state is proposing to exclude religious schools from benefiting from a new law that allows people to take tax credits for donating to public and private schools. Updated: Wednesday, October 14 2015 11:26 PM EDT2015-10-15 03:26:43 GMTA woman is charged with assault with a weapon after a 36-year-old Montana State University student reported he was stabbed in the neck during an argument. A woman is charged with assault with a weapon after a 36-year-old Montana State University student reported he was stabbed in the neck during an argument. Updated: Wednesday, October 14 2015 12:59 AM EDT2015-10-14 04:59:12 GMTA Ronan daycare provider is hailed as a hero after putting herself in harm's way to ensure the safety of the children in her care. A Ronan daycare provider is hailed as a hero after putting herself in harm's way to ensure the safety of the children in her care. Updated: Wednesday, October 14 2015 11:50 PM EDT2015-10-15 03:50:46 GMTA judge has signed an arrest warrant for a woman who is accused of hitting a Montana daycare owner with a shovel. A judge has signed an arrest warrant for a woman who is accused of hitting a Montana daycare owner with a shovel. Updated: Thursday, October 15 2015 12:44 AM EDT2015-10-15 04:44:39 GMTCody's police chief is retiring. He's not going to another police job. He's going to do community service elsewhere. His work in northwest Wyoming went beyond enforcing the law. Cody's police chief is retiring. He's not going to another police job. He's going to do community service elsewhere. His work in northwest Wyoming went beyond enforcing the law. Updated: Wednesday, October 14 2015 6:40 PM EDT2015-10-14 22:40:07 GMTMissoula County authorities say one person died when a small plane crashed after taking off from the Missoula International Airport. Missoula County authorities say one person died when a small plane crashed after taking off from the Missoula International Airport. Updated: Wednesday, October 14 2015 10:31 PM EDT2015-10-15 02:31:40 GMTAuthorities in Missoula look for answers Wednesday night, after a fatal crash of a single-engine aircraft near Missoula International Airport. Authorities in Missoula look for answers Wednesday night, after a fatal crash of a single-engine aircraft near Missoula International Airport. Updated: Thursday, June 11 2015 3:22 PM EDT2015-06-11 19:22:44 GMTSPOKANE, Wash. - When you walk into the lobby of the Davenport Grand Hotel, the word \"grand\" suddenly seems fitting. The décor inside the 716-room hotel is bold and elaborate. A 6 by 9 foot piece of carpet at a convention in Las Vegas inspired Walt and Karen Worthy to design their hotel around it. They enjoyed the red, bold flower design so much, that they had it blown up into carpet that now covers the hallways on the main floors. SPOKANE, Wash. - When you walk into the lobby of the Davenport Grand Hotel, the word \"grand\" suddenly seems fitting. The décor inside the 716-room hotel is bold and elaborate. A 6 by 9 foot piece of carpet at a convention in Las Vegas inspired Walt and Karen Worthy to design their hotel around it. They enjoyed the red, bold flower design so much, that they had it blown up into carpet that now covers the hallways on the main floors. Updated: Monday, May 18 2015 6:24 PM EDT2015-05-18 22:24:14 GMTMOUNT ST. HELENS - It was 35 years ago that Mount St. Helens erupted. The blast took more than 1,300 feet off the top and rained volcanic ash for miles around. Eastern Washington was covered in volcanic ash, and the cloud drifted east across the United States in 3 days and encircled Earth in 15 days. Here are some more facts about the volcano, which remains active to this day. MOUNT ST. HELENS - It was 35 years ago that Mount St. Helens erupted. The blast took more than 1,300 feet off the top and rained volcanic ash for miles around. Eastern Washington was covered in volcanic ash, and the cloud drifted east across the United States in 3 days and encircled Earth in 15 days. Here are some more facts about the volcano, which remains active to this day. Updated: Thursday, October 15 2015 2:19 PM EDT2015-10-15 18:19:16 GMTThursday morning's WEA-WFT Conference at Skyview High School brought Senator Jon Testor to the Magic City. Tester spoke at the 8 a.m. educator's conference and introduced a new bill he says will encourage teachers to teach in rural America. Thursday morning's WEA-WFT Conference at Skyview High School brought Senator Jon Testor to the Magic City. Tester spoke at the 8 a.m. educator's conference and introduced a new bill he says will encourage teachers to teach in rural America. Thursday, October 15 2015 1:00 PM EDT2015-10-15 17:00:42 GMTU. S. Rep. Ryan Zinke says he is considering running for House speaker. U.S. Rep. Ryan Zinke says he is considering running for House speaker. Updated: Wednesday, October 14 2015 6:40 PM EDT2015-10-14 22:40:07 GMTMissoula County authorities say one person died when a small plane crashed after taking off from the Missoula International Airport. Missoula County authorities say one person died when a small plane crashed after taking off from the Missoula International Airport. Updated: Wednesday, October 14 2015 5:19 PM EDT2015-10-14 21:19:28 GMTThe state is proposing to exclude religious schools from benefiting from a new law that allows people to take tax credits for donating to public and private schools. The state is proposing to exclude religious schools from benefiting from a new law that allows people to take tax credits for donating to public and private schools. Updated: Wednesday, October 14 2015 11:29 AM EDT2015-10-14 15:29:12 GMTAgriculture is the biggest industry in Montana, and the biggest industry in agriculture is beef. For beef producers like <mark>Travis Brown</mark>, fall is both the busiest and most exciting time of year. Here's how <mark>Brown</mark> expects the beef industry to react after new USDA rules this year regarding beef trade and labels. Agriculture is the biggest industry in Montana, and the biggest industry in agriculture is beef. For beef producers like <mark>Travis Brown</mark>, fall is both the busiest and most exciting time of year. Here's how <mark>Brown</mark> expects the beef industry to react after new USDA rules this year regarding beef trade and labels. Updated: Wednesday, October 14 2015 1:46 AM EDT2015-10-14 05:46:30 GMTButte-Silver Bow county officials are beefing up their efforts to improve mental health and cut down suicide in the Mining City.Butte-Silver Bow county officials are beefing up their efforts to improve mental health and cut down suicide in the Mining City. Updated: Wednesday, October 14 2015 1:40 AM EDT2015-10-14 05:40:03 GMTWildlife officials say there has been a surge of bear deaths along Montana highways as more bears have been making their way down to river valleys in search of food ahead of their winter hibernation. Wildlife officials say there has been a surge of bear deaths along Montana highways as more bears have been making their way down to river valleys in search of food ahead of their winter hibernation. Updated: Wednesday, October 14 2015 12:59 AM EDT2015-10-14 04:59:12 GMTA Ronan daycare provider is hailed as a hero after putting herself in harm's way to ensure the safety of the children in her care. A Ronan daycare provider is hailed as a hero after putting herself in harm's way to ensure the safety of the children in her care. Updated: Tuesday, October 13 2015 5:47 PM EDT2015-10-13 21:47:39 GMTA Montana State University official says a student was stabbed and made his way to campus where he was found bleeding in the student union. A Montana State University official says a student was stabbed and made his way to campus where he was found bleeding in the student union. Updated: Monday, October 12 2015 4:53 PM EDT2015-10-12 20:53:25 GMTTwo grizzly bear cubs have been released near Yellowstone National Park after being captured near an Idaho town. Two grizzly bear cubs have been released near Yellowstone National Park after being captured near an Idaho town.", "articleID": "2015101519_00104699_W", "names": {"Travis Brown": ["Q7836210", "Q7836211", "Q7836212"]}}, {"date": "2015-10-15", "url": "http://mindentimes.ca/a-tough-way-to-earn-a-buck?id=870", "content": "A tough way to earn a buck By Jim Poling Sr.. New book releases are tumbling into book shops, book sites and libraries this fall almost as fast as the falling autumn leaves. As many as 20,000 to 25,000 new titles could be released in the United States during this fall's book season. The flurry of new books is so great that it is difficult to decide on a list of books you might want to read, let alone an individual book. The sheer numbers leave an impression among some people that authors who write them are taking in major dollars. Not exactly. The big names like <mark>Stephen King</mark>, Nora Roberts and <mark>James Patterson</mark> continue to pull in millions of dollars but the lesser lights are seeing diminishing incomes. The Authors Guild in the U.S. surveyed more than 1,400 full - and part-time writers this year and found that more than one-half of respondents earned less than $11,670 a year. That figure just happened to be the U.S. federal poverty level in 2014. \"No one likes to see the word\" poverty level' on a survey that has anything to do with people you know, \"says Roxana Robinson, Authors Guild president .\" You used to be able to make an absolutely living wage as a writer. You wrote essays and you published them in journals. You wrote magazine pieces and you got paid very well for those. And you wrote books and you got good advances. So being a writer, it didn't usually mean you would be rich, but it had meant in the past that you could support yourself. \"The Guild survey reported that the average income of a full-time writer has dropped to $17,500 a year, down from $25,000 in 2009. For the average part-time author the figure was $4,500 a year, down from $7,250 in 2009. The numbers for authors who win major book awards also are shocking. The Man Booker prize in the United Kingdom released its short list of nominees for the prize last month. Two of the Man Booker finalists each have sold only 15,000 to 20,000 hardcovers each of their books. One other finalist has sold 3,600 copies in the U.S., another only 3,000. Those numbers mean meagre money for authors who spend countless hours researching and writing these books. At least getting into the finals does provide more. The Man Booker winner gets $75,000 Canadian, while the runners-up get roughly $3,800 Canadian. Canadian writers' book earnings in most cases are small. However, they also receive small payments from the Public Lending Right based on how many libraries are carrying their books. The more of your books in the library, the higher the payment. Also, Access Copyright pays writers money from a fund collected from institutions that use writers' copyrighted work. The federal government passed a new copyright act not long ago which screwed writers out of an important source of income. Schools and other educational institutions, and even some government departments, now say they don't have to pay into the copyright fund for using writer's works anyway they wish. E-books have created new earnings opportunities for writers. More and more writers are self publishing digital books. There have been success stories. British author <mark>Mark Dawson</mark> is pulling down six figures a year from his series about an assassin published through the Amazon Kindle program. Self publishing through a digital platform is a simple way to get a book out. But the majority of those books go nowhere because moving the books to make some money is all up to the author. Hundreds of thousands of books are self-published and getting one noticed in that ocean of publishing is difficult no matter how good the book. The writer has to become an entrepreneur, which means weekends at flea markets, fairs and days and nights speaking to book clubs and any other groups willing to listen. Promoting, marketing and selling the book leaves little time for more writing. I mention all this because Haliburton County has a sizeable population of writers. They work hard with varying degrees of success and we hope they will continue and someday we'll see some county names on those lists of awards and bestsellers.", "articleID": "2015101519_00130110_W", "names": {"James Patterson": ["Q311671", "Q6141039", "Q6141040"], "Mark Dawson": ["Q27973746", "Q6767303", "Q6767304"], "Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}}, {"date": "2015-10-15", "url": "http://www.cp24.com/news/a-look-at-some-of-the-more-popular-facebook-posts-from-the-election-campaign-1.2611883", "content": "Talk Shows A look at some of the more popular Facebook posts from the election campaign Liberal leader Justin Trudeau, Green Party leader <mark>Elizabeth May</mark> and New Democratic Party leader Thomas Mulcair listen as Conservative Leader <mark>Stephen Harper</mark> take part in the first leaders debate Thursday, August 6, 2015 in Toronto. THE CANADIAN PRESS/Frank Gunn Chris Herhalt, CP24. com Published Thursday, October 15, 2015 6:09 PM EDT Videos and Facebook Q & A s dominate the list of leading posts by federal party leaders on Facebook during the 2015 campaign, according to the company's analysis. In no particular order, here are the posts that sparked public interest: Tom toasts his beer policy: On Aug. 7, International Beer Day, NDP leader Tom Mulcair's campaign posted an image of Mulcair toasting with a glass of beer. It touted the party's plan to offer tax credits to small brewers. <mark>Harper</mark>'s first interactive Facebook Q & A: On Sept. 8, Conservative leader <mark>Stephen Harper</mark> conducted a live question-and-answer session on his Facebook page. The first three questions people asked him revolved around the Conservatives plan to deal with the Syrian refugee crisis, their stance on Israel and what it is like to be prime minister. Trudeau releases campaign platform in Facebook livestream: On Oct. 5, Liberal leader Justin Trudeau released his party's 88-page campaign platform document via a live video broadcast, combined with a question-and-answer period on Facebook. <mark>Harper</mark> reiterates debate stance on Niqab: On Sept. 27, <mark>Harper</mark> posted an image with a quote reiterating a statement he made during a debate, where he said he would \"never tell my young daughter that a woman should cover her face because she is a woman. That's not our Canada .\" The niqab is a face-covering veil worn by a small minority of Muslim women. The niqab, it's admissibility at citizenship ceremonies and elsewhere has generated considerable debate and controversy during the campaign. Greens post Rick Mercer urging young Canadians to vote: The Green Party posted a Rick Mercer \"rant\" urging young Canadians to get off the couch and vote. It was viewed 495,000 times. Tom Mulcair hosts a Facebook Q & A: Mulcair hosted a Facebook question and answer session at the company's Toronto headquarters on Aug. 27. The first three questions he fielded concerned the cancelled women's issues debate, whether he was serious about repealing the Conservatives' counter-terrorism/surveillance legislation (Bill C-51), and his party's plans for the CBC. Justin Trudeau's Eid al-Adha message: A recorded video message released on Sept. 23 expressing greetings to Canadian Muslims on Eid al-Adha was viewed 423,000 times. Tom Mulcair expresses best wishes to Muslims celebrating Eid al-Adha: A recorded video message posted to Facebook on Sept. 26 from Mulcair wishing Canadian Muslims a special Eid al-Adha \"saw unusually high engagement,\" according to Facebook. It was viewed 282,000 times. <mark>Harper</mark> says armed intervention crucial to stopping ISIS: A clip of a speech <mark>Harper</mark> made in Markham posted to Facebook on Aug. 10 showed <mark>Harper</mark> arguing for continued airstrikes and training of local forces to combat the Islamic State. Trudeau pens a letter to <mark>Harper</mark> about Mike Duffy: A letter by Trudeau outlining his concerns about Senator Mike Duffy during his fraud trial in Ottawa rounds out the list of most significant posts by party leaders on Facebook. In the letter, Trudeau asks <mark>Harper</mark> when he knew about the arrangement for <mark>Harper</mark>'s former chief of staff <mark>Nigel Wright</mark> to repay Duffy's improperly claimed expenses, as well as whether <mark>Harper</mark> stayed in contact with <mark>Wright</mark> after <mark>May</mark> 2013.", "articleID": "2015101522_00065193_W", "names": {"Elizabeth May": ["Q16194189", "Q2289262", "Q42322461", "Q445620"]}}]