[{"articleID": "2019111615_00127480_W", "names": {"Abdul Hamid": ["Q3246667", "Q4665391", "Q46996242", "Q47118441", "Q938136"]}, "date": "2019-11-16", "url": "http://bernama.com/en/news.php?id=1790463", "content": "Police hunting down maid who disappeared with jewelry worth RM125,000 Last update: 16/11/2019 BUKIT MERTAJAM, Nov 16 - Police are hunting down an Indonesian maid for allegedly stealing RM127,600 worth of jewelry and cash from her employer in Bandar Perda today. Central Seberang Perai district police chief (ACP) Nik Ros Azhan Nik <mark>Abdul Hamid</mark> said the theft was only discovered at about 9am, after the 33-year-old houseowner and his family members returned from the Bukit Mertajam market to find the maid gone. \"They looked for the maid, known as Widya Wati, 31, but she was not home and checks revealed the lock of a wardrobe in one of the rooms was prised open and a bag containing jewelry was missing.\" In the bag were RM125,000 worth of jewelry which had been kept over the past 10 years including RM2,600 in cash, \"he said here tonight. The woman had been working for the family for three months, he added. Those with information on the woman are urged to contact the nearest police station to assist in investigations .--BERNAMA"}, {"articleID": "2020022403_00100241_W", "names": {"Ibrahim Babangida": ["Q333415", "Q35539224", "Q4521833"]}, "date": "2020-02-24", "url": "https://leadership.ng/2020/02/24/northern-leaders-fault-pandef-on-state-of-the-nation-comment/", "content": "Leaders from the Northern and the Southern part of the country have again clashed over the state of the nation. This is just as the Buhari Media Organisation (BMO), yesterday faulted the position ex-federal commissioner of Information and Elder statesman, Chief Edwin Clark over the state of affairs in Nigeria, noting that it was wrong to blame President Buhari for the reluctance to restructure the polity since it is a constitutional issue which falls within the purview of the National Assembly. Clark had in an interview titled ’N igeria sitting on a key of gunpowder,' with a national daily, (not LEADERSHIP) said, \"I fear that Nigeria is moving towards anarchy and if nothing is done and quickly too nobody is safe. The fear has also been expressed by many people, by other well meaning Nigerians. Let us not pretend, we must do the restructuring of this country.\" The elder statesman also said with regards to elections and court judgements, that \"president Buhari has not shown statesmanship given his actions. There is political deception and Nigeria has never been badly divided as it is today. Some people and groups are treated as scared cows as if they own Nigeria.... you cannot be sponsoring injustice and expect unity.\" The apex Igbo socio-cultural organisation, Ohaneze Ndigbo, while reacting to Clarks lamentations, said the elder statesman is too experienced not to know what he is talking about. Deputy national publicity secretary of Ohanaeze Ndigbo, Chuks Ibegbu, told LEADERSHIP that, \"Edwin Clark is too experienced to know what he is talking. I think he is concerned by the insecurity in Nigeria and the level of corruption and nepotism in the system.\" In same vein, the apex Yoruba socio-cultural organisation, Afenifere, said Clark was right on his views about the present state of the country, adding that only enemies of Nigeria would say things are fine. The spokesman of Afenifere, Mr Yinka Odumakin, who spoke in support of the Clark's disposition noted that the senate president, Ahmed Lawan, had also recently lamented the deplorable conditions in the country. \"The old man is damn right. It was the same observation that made the Senate President to say we have reached a tipping point. Only enemies of Nigeria would say things are okay.\" But the secretary general of Arewa Consultative Forum (ACF), Anthony Sani, while stating position of the Forum, noted that Nigeria's problems could not be solved by restructuring, adding that the country have been restructured several times. ACF said Nigerians need change of attitude and not restructuring or constitutional amendment. \"It is against these backdrops that we think our problems have to do more with our attitudes and how we do things than the structure, the form of government and economic models,\" Sani said. According to him, many believed that the Constitution review embarked upon by the National Assembly will give room for restructuring. \"But by way of examples, the country has been restructured several times politically, geopolitically or economically. Nigeria started with three regions under confederate arrangement and later moved to four regions and now have 36 states attained through gradual split from 12 states,19 states, 21states and 30 states.\" The country started with parliamentary system of government, went through military dictatorship which abolished the confederation in favour of unitary system, then followed by federalism which is a compromise between confederation with weak center and unitary system with very strong center. \"The current federalism is a situation where the national government is balanced by appropriate state level power. Even the economy has gone through several remodeling with indigenization tagged mixed economy.\" There was the International Monetary Fund (IMF's) inspired Structural Adjustment Programs tagged SAP under the former military president, <mark>Ibrahim Babangida</mark>, which sought to reduce government's hold of the economy. \"Nigeria also had former president, Olusegun Obasanjo's privatization which sold government holdings in the economy to private sector expected to drive the economy and bring about reduction of poverty that comes with employment with many Nigerians still left in difficult situation. Meanwhile, chairman of BMO, Niyi Akinsuju, who noted Clark's call for restructuring however said it is a constitutional matter which has its roots in the legislature. Speaking to LEADERSHIP, he decried an attempt by the elder statesman to hold President Muhammadu Buhari responsible for the national reluctance to restructure, saying such notion is misplaced. Akinsuju said,\" I understand the call for restructuring by Elder Statesman Edwin Clark in this context, but then, there seems to be a misalignment in the option he sustained for the realisation of his call for restructuring. \"Restructuring is primarily a constitutional issue, and to that extent, it has its roots in the legislature. I observe an attempt by the elder statesman to hold President Muhammadu Buhari responsible for the national reluctance to restructure but I submit that the sentiments is misplaced.\" There are many paths to commencing the process of legislation or constitution amendments, as the case may be, in the National Assembly which is the representation of the nation's legislative arm of government. \"\"The presidential system works in America, the parliamentary system is working well in Britain while a combination of the two works successfully in France with Nigeria left still guessing.\" America's constitution is few pages, Britain does not have a written constitution while Nigeria has a book in form of a constitution that is observed more in the breach. \"As to cost of government, America has about 25 ministers, Britain has about 17 while France has about 15 ministers while Nigeria has a crowd called government.\" In America, the vice president is the president of the senate which pundits say the drafters of the Constitution envisage it to be a way of reducing cost of governance. \"State capitalism works in China but Nigeria, haven tried many structures, forms of government that include military dictatorship and many economic models, pundits say the problems of Nigeria have more to do with collapse of national ideals and moral values that have affected the sense of what is right and what is evil.\" Those who hanker for resource control and yet agitate for return to 1963 constitution feign ignorance of the fact that Oil, Gas and Solid Minerals have been on the exclusive list of all our constitutions, \"Sani said. He added that,\" those who now say Nigeria should be restructured in such a way that each sections be allowed to develop at its own pace are those who wish Nigerians should live as if they are in different continents. \"This is inclusive of private members of the National Assembly and, of course, the President. I recall that the President had invited any Nigerian that feels strongly about restructuring to approach the National Assembly and commence the process there.\" Thankfully, the Senate recently inaugurated the Senator Ovie Omo-Agege Constitution Amendment Committee which in turn declared its intent to reference both the 2014 Constitutional Conference report and the Governor Nasir El-Rufai APC's report on restructuring even as the same committee called on Nigerians to come forward and submit their memoranda on areas they desired amended in the constitution. \"To me, this is how to go about the realisation of our passion for restructuring, in an orderly, constitutional and cost effective manner. I am sure Chief Clark is not suggesting another conference so I invite the respected Elder Statesman to avail himself of this Omo-Agege committee to present his thoughts on restructuring Nigeria.\" On Clark's reaction to the Buhari's disposition to elections and court judgements, Akinsuju said it was obvious that Chief Clark is determined to find a role for President Buhari in the sentiments he expressed. The BMO chair said the President had expressed and continue to show an insistence on not interfering in the electoral and judicial processes. He said, \"Nigerians are all witnesses to how judicial rulings, for the first time ever in the history of democracy in Nigeria, have taken away States won by the ruling party and directly gave them to the main opposition PDP. In another case, the ruling APC was barred from contesting in a statewide election.\" The President refused to intervene even where party members wondered why, in the normal Nigerian practice, he did not make to manipulate the process as the PDP would have done when they were in power at the Federal level. \"The truth of the matter is that this President is constant in his determination to build institutions rather than advancing selfish interests. The same way he is creating level playing ground for all Nigerians.\" Akinsiju states that if anybody is complaining of sacred cows in contemporary Nigeria, it's those that believed they used to own Nigeria and are now being sidelined in preference for the masses. He this current reality is exemplified by the \"recent employment of more than 1000 graduate trainees by the NNPC with testimonies by the employed testifying that they didn't know or have connections of any sorts with anybody in government.\" Before this NNPC's well applauded recruitment there was much commendation from Nigerians without contacts or connections that got selected into the NPower scheme. This is the new Nigeria we are talking about, the Nigeria where anybody is somebody and can access privileges of state without knowing any big man or woman anywhere, \"he said. VICTORY!! ABUJA MAN REVEALS (FREE) SECRET FRUITS THAT INCREASES MANHOOD & LASTING POWER IN 7DAYS...CLICK HERE TO GET IT RIGHT NOW!! Related Topics: Up Next Lagos Shuts Down 20 Sub-standard Health Centres Don't Miss CBN Clarifies Position On Operation Of Domiciliary Accounts Advertisement You may like MOST POPULAR HEALTH 22 hours ago 10 Reasons Why Coconut Oil Is A Must-have ARTS 22 hours ago Chimamanda Ngozi Adichie Makes History Again POLITICS 22 hours ago Edo: We Are Working Towards A Consensus Candidate--Ize-Iyamu SPORTS 20 hours ago JUST IN: Fury Batters Wilder, Reclaims World Heavyweights Title NEWS 9 hours ago I Didn't Forge My Certificate--Bayelsa Deputy Governor WORLD 22 hours ago Chinedu Echeruo--US-Based Nigerian Computer Scientist AFRICA 22 hours ago Africa's Female Ex-presidents NEWS 14 hours ago APC Alleges Plot To Swap NYSC Certificates Of Bayelsa Deputy Gov"}, {"articleID": "2019021411_00074403_W", "names": {"Paul Casey": ["Q10557500", "Q683113", "Q7149753", "Q7149754"], "Jason Day": ["Q24005613", "Q246992", "Q6162329", "Q6162331"], "Sam Saunders": ["Q7408118", "Q7408119"], "Patrick Reed": ["Q15905139", "Q57514710"]}, "date": "2019-02-11", "url": "http://www.espn.in/golf/story/_/id/25968850/phil-mickelson-brink-victory-pebble-beach-darkness-falls", "content": "Phil Mickelson on the brink of victory at Pebble Beach before darkness falls play Mickelson on the brink of victory at Pebble Beach (1:28) Phil Mickelson plays strong on Sunday, but he and <mark>Paul Casey</mark> were unable to finish their final rounds due to darkness. (1:28) print PEBBLE BEACH, Calif.--Phil Mickelson put himself on the brink of a fifth victory in the AT & T Pebble Beach pro-am by turning a 3-shot deficit into a 3-shot lead when a wild <mark>day</mark> of weather kept him from finishing Sunday. Mickelson was bogey-free with six birdies, and he made his big run starting with a 9-iron to a foot behind the cup on the par-4 ninth. That was start of a five-hole stretch when Mickelson made three birdies and <mark>Paul Casey</mark> had two bogeys. About the only thing that didn't go Mickelson's way was the timing. The final round started an hour late because of rain, and then it was delayed two more hours when sunshine gave way to a hailstorm in a matter of minutes, covering the putting greens in a sheet of white. Mickelson was at 18-under par through 16 holes. <mark>Casey</mark> had a 3-foot par putt on the same hole when Mickelson tried to lobby for them to finish, even in the dark. Phil Mickelson met with reporters in the twilight after play was halted Sunday at Pebble Beach. AP Photo/Eric Risberg \"I can see fine,\" Mickelson told a rules official. \"I don't want to put <mark>Paul</mark> in a bad spot.\" <mark>Casey</mark> was at 15 under, tied with Scott Stallings, who closed with a 66. Along with an outside chance at forcing a playoff, finishing alone in second instead of a tie is a difference of $152,000, along with world ranking points and FedEx Cup points. <mark>Casey</mark> and FedEx executive Don Colleran had a 1-shot lead in the pro-am. \"I don't see how we can finish,\" <mark>Casey</mark> said as they walked up the 16th fairway. \"We can't finish two holes in six minutes. I'd like to.\" Mickelson was standing on the 17th tee when he heard the horn sound to stop play, and he shook his head. The rest of his <mark>day</mark> was far better than the weather. Mickelson is on the verge of winning for the 44th time in his career and matching Mark O'Meara with five victories at a tournament he first played in 1995. It also would be his first victory on American soil since the Phoenix Open six years ago. He won The Open that summer in Scotland, and the Mexico Championship last year. His brilliant play still shared the stage with weather that was bizarre even by Pebble standards. Mickelson and <mark>Casey</mark> were waiting to tee off when clouds moved in quickly moved in, and rain turned into hail that pounded umbrellas, many of them held sideways to account for the wind. Greens quickly were covered by the tiny white pellets, and workers went from using squeegees for excess water to power blowers to remove the hail. <mark>Sam Saunders</mark>, whose grandfather Arnold Palmer was among the Pebble Beach owners, scooped up hail and tossed it like a snowball. <mark>Patrick Reed</mark>'s brother laid on his back and tried to make a snow angel. There was never a reasonable chance to finish in his pro-am format, with mostly foursomes across the golf course. Michael Madrid-USA TODAY Sports <mark>Casey</mark> has never won in three previous times he had a 54-hole lead on the PGA Tour, all of them by 2 shots or more, and he was holding his own against the relentless pursuit of Mickelson, who missed three straight birdie putts from the 12-foot range by the slimmest margins. <mark>Casey</mark> had great par saves, and then Mickelson took off. After his 9-iron into a foot at No. 9 to get within one shot, Mickelson holed a 12-foot birdie on the 10th with a drive that hugged the right side of the fairway and likely would have bounced into the ocean if not for conditions so soft from rain that balls plugged where they landed. <mark>Casey</mark> blinked first with a bogey on the 11th hole, and another on the par-3 12th when his tee shot came up short and into the bunker. Mickelson poured it on, showing his skills have not deteriorated a bit at age 48, controlling spin beautifully to back pin positions. He just didn't want to stay another <mark>day</mark>. \"I get where <mark>Paul</mark> is coming from,\" Mickelson said. \"We're going to have a good chance to come out on fresh greens. I have good vision, I can see fine and I wanted to continue. In all honesty, it's a good thing to play the last two holes in fresh conditions.\" Some players finished in the dark with no chance of winning, but showed the effect of playing without light. Scott Piercy had a 15-foot putt that was slightly uphill, and he still ran it 7 feet by the hole and three-putted for bogey. <mark>Jason Day</mark> closed with a 68 and was tied for fourth at 13-under 175 with Si Woo Kim (68)."}, {"articleID": "2017120215_00074689_W", "names": {"Anurag Kashyap": ["Q2839609", "Q56248257"]}, "date": "2017-12-02", "url": "http://www.firstpost.com/entertainment/padmavati-controversy-juhi-chawla-condemns-protesters-for-giving-death-threats-4238577.html", "content": "Padmavati controversy: Juhi Chawla condemns protesters for giving death threats Juhi Chawla, Aanand L Rai and <mark>Anurag Kashyap</mark> are the latest to speak in support of Padmavati, its director Sanjay Leela Bhansali, as well as its cast. Deepika Padukone in Padmavati poster (left); Juhi Chawla (right). Images via Facebook Juhi Chawla also opened up about the controversy in an interview to PTI. While she refrained from commenting on the film or the story line and did not get into the issue of the distortion of history, her prime concern remained the death threats that Deepika Padukone had received. She said that people should react to things with sensitivity and that tempers should not flare in this manner. \"I am not speaking for Padmavati the film but the threats were not right. You watch the same heroine in other films, go crazy for her, you love her so much, she has a tremendous fan following. Then, to threaten her like this, I didn't feel was right,\" she said. \"At the end of the day, films are made by directors, by the team [and] you're playing a part. Just for that reason, I'd say a little sensitivity is [needed] and people should have patience. Not flare up and say things like that, that too to a woman,\" she added. In a recent interview to PTI, Aanand L Rai said that there is a sense of fear in the industry. \"There is a lot of fear for all of us and not just makers,\" he said. Rai added that the trend of fighting threats is fading away, and that the courage filmmakers used to show before seems to be missing. \"And that is missing because of the kind of fear you, me, all of us, even the makers and everyone is facing,\" he added."}, {"articleID": "2015101918_00043987_W", "names": {"Mubarak Shah": ["Q28036606", "Q5412180"]}, "date": "2015-10-19", "url": "http://spacecoastdaily.com/2015/10/ucf-researchers-perform-worlds-first-automated-mass-crowd-count/", "content": "UCF Researchers Perform World's First Automated Mass-Crowd Count By UCF / / October 19, 2015 Computers have scanned aerial photographs and conducted the first automated mass-crowd count in the world, thanks to the work of researchers at the University of Central Florida. (Nick Russett, UCF Image) ORLANDO, FLORIDA (UCF.EDU)--Computers have scanned aerial photographs and conducted the first automated mass-crowd count in the world, thanks to the work of researchers at the University of Central Florida. Counting large-scale crowds (such as the Million Man March in Washington, D.C.) has been a long, tedious process involving people examining aerial photographs one at a time. Until now, each photograph had to be divided into sections and the examiners counted the number of heads per inch. But now, UCF's Center for Research in Computer Vision has created software that promises to automate the process and cut down the time dramatically, from up to a week to 30 minutes, giving organizers critical information when planning for events or responding to emergencies. UCF's test run was conducted in September. Thousands of demonstrators along a 3.2-mile stretch of Barcelona were calling for the independence of the Catalonia province from Spain. Using the new software, 67 aerial images of different sections were analyzed. Related Story: UCF To Conduct National Search For Athletic Director After O’Leary Stepped Down The software program came up with a total count for each of the images within 30 minutes. The images and calculations were then sent to Pompeu Fabra University in Spain, where statistics professor Albert Satorra led a team in reviewing the data. Using UCF results for the images, they concluded the count for the entire crowd at about 530,000. That number is well below the count claimed by rally organizers, said Haroon Idrees, a post-doctoral associate at the UCF center who conducted the analysis that was sent to Satorra. <mark>Mubarak Shah</mark> \"Automated computer analysis of such large-scale and dense crowds has never been done before,\" said <mark>Mubarak Shah</mark>, computer science professor and director of the center. \"We will continue to push the envelope of state-of-the-art in-crowd analysis so that it can by help the authorities and governments manage real-time safety of large crowds and perform post-event analysis of such gatherings.\" Crowd counts have been done digitally before, but not for large-scale crowds involving hundreds of thousands of people. The discipline is important because knowing the size of crowds can help organizers plan for events and can also help them have appropriate staffing available for emergencies. Dinesh Manocha \"This is a huge milestone in how mass crowds are counted,\" said Dinesh Manocha, a computer science professor at the University of North Carolina at Chapel Hill not involved in the project. \"UCF's computer-vision program has been the leading research group on developing computer-vision techniques for analysis of crowd videos and their research can have significant impact in terms of development of next-generation crowd-management technologies.\" "}, {"articleID": "2018071619_00192231_W", "names": {"John Ross": ["Q11727979", "Q1701610", "Q19661432", "Q21063323", "Q27925053", "Q43380308", "Q43911093", "Q56254622", "Q6255678", "Q6255693", "Q6255697", "Q7252813"]}, "date": "2018-07-16", "url": "http://www.chattanoogan.com/2018/7/16/372950/Khyree-Thompson-Denied-New-Trial-For.aspx", "content": "Khyree Thompson Denied New Trial For 2015 Motel Murder Monday, July 16, 2018 Khyree Thompson Khyree Thompson, 23, appeared in Judge Don Poole's courtroom Monday with a motion for a new trial. Thompson was sentenced to life in prison for the February 2015 murder of Reginald Ballard during a motel robbery. Attorney Donna Miller referenced close-up photos of the victim's wounds shown during trial, the introduction of \"allegations of the defendant's gang involvement,\" and instances of prejudicial error as some of the reasons behind Thompson's motion for a new trial. Judge Poole denied the motion, though Thompson still has 30 days to appeal. Khyree Thompson Denied New Trial For 2015 Motel Murder Khyree Thompson, 23, appeared in Judge Don Poole's courtroom Monday with a motion for a new trial. Thompson was sentenced to life in prison for the February 2015 murder of Reginald Ballard during a motel robbery. Attorney Donna Miller referenced close-up photos of the victim's wounds shown during trial, the introduction of \"allegations of the defendant's gang involvement,\" and...(click for more) State Route 68 To Be Closed In Rhea County On Wednesday And Thursday For Stabilization Project TDOT personnel and contract crews are nearing completion of a stabilization project on State Route 68 near log mile 5 in Rhea County. To expedite completion of the project, it will be necessary to completely close the road for a two-day period beginning on Wednesday, at 5 a.m. The closure was originally scheduled to begin on Monday, but has been postponed...(click for more) Here We Go Again With The Same Cummings Highway, 12th Street Flooding - And Response Here we go again with the same pitiful news reports about the Cummings Highway Interstate interchange with I-24 - Flooding yet again after a heavy rain. TDOT is derelict in not having repaired this years ago. How hard is it to get some excavators out there to dig up the collapsed drainage pipes which TDOT says are the cause of the flooding and replace them with...(click for more) Deal With The Graffiti Vandals I travel to other neat old cities and don't see nearly the graffiti vandalism as in Chattanooga. Why do we allow one or two or three repeat vandals to mar our venerable Walnut Street Bridge, the pillars to the Holmberg Bridge, the remodeled Chief <mark>John Ross</mark> Market Street Bridge, the walls along our multi-million-dollar Riverwalk, our sidewalks, street signs and our old limestone...(click for more) Lee Set To Begin Construction on New Baseball Stadium A new era will begin for the storied Lee University baseball program as construction began this month on a brand-new stadium for the Flames to call home with completion set for the upcoming spring 2019 season. The new venue, which will sit in the same location as Old Olympic Field, will be two levels and approximately 9,400 square feet. The stadium will feature chair back seating...(click for more) Local Tennis: The City Championships are July 19-22 The annual City Tennis Championships will be held July 19-22 at Manker Patten Tennis Club Open Division: The event will include the open division in men's and women's singles, doubles and mixed with prize money at $1000 for men's and women's singles winners and $500 for the runners-up and $250 for the semifinalists. NTRP Doubles Pla y: Doubles play...(click for more)"}, {"articleID": "2009062219_00007278_W", "names": {"Mike Mills": ["Q364864", "Q54305169", "Q724098"]}, "date": "2009-06-22", "url": "http://blogs.ajc.com/peachbuzz/2009/06/22/day-of-reckoning-is-here-for-rem-and-dave-fm/?cxntfid=blogs_peachbuzz", "content": "day of \"reckoning' is here for r.e.m. and dave fm june 22, 2009, by richard eldredge dave fm program director scott jameson got the atlanta rock radio station's exclusive interview with r.e.m .'s <mark>mike mills</mark> the old-fashioned way. he called up and asked. noting the looming 25th anniversary of the athens band's iconic album,\" reckoning, \"jameson rang r.e.m. hq up the atlanta highway. before he knew it, he was on his way to the band's old offices and current rehearsal studio on college avenue in athens for a 90-minute interview with the bassist to discuss the band's second full-length album. the interview, along with <mark>mills</mark> song-by-song remembrances of the\" reckoning \"recording sessions, will air all day tuesday from 9 a.m. to 8 p.m. of the experience, jameson tells buzz:\" it's a bit of vh1 meets npr. it's extremely insightful for the dave audience and it gives our listeners a very personal, one-on-one experience between the artist and their work. twenty five years ago, a lot of our current dave audience was blaring \"reckoning' in their college dorm rooms. it's an album that remains relevant.\" jameson let buzz eavesdrop on one particularly hilarious excerpt from <mark>mills</mark>' interview where he describes the band's penchant for playing absolutely anywhere back then."}, {"articleID": "2018073113_00138083_W", "names": {"Samantha Cole": ["Q7408640", "Q7608923"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-07-31", "url": "http://motherboard.vice.com/en_us/article/a3q744/where-did-shadow-banning-come-from-trump-republicans-shadowbanned", "content": "Illustration: Chris Kindred shadow ban | by <mark>Samantha Cole</mark> | Jul 31 2018, 1:00 pm Where Did the Concept of \"Shadow Banning' Come From? It's been called shadow banning, toading, being\" sent to coventry, \"and ghost banning--but where did it actually start? by <mark>Samantha Cole</mark> | Jul 31 2018, 1:00 pm SHARE TWEET Illustration: Chris Kindred On Thursday, <mark>Donald Trump</mark> tweeted:\" Twitter \"SHADOW BANNING' prominent Republicans. Not good. We will look into this discriminatory and illegal practice at once! Many complaints.\" The tweet, seemingly in response to a VICE News article posted last week, uses the phrase \"shadow banning,\" a term that has been co-opted by conspiracy theorists who say that Silicon Valley is discriminating against them. Since the early days of the web, a \"shadow ban\" has been a moderation technique used to ban people from forums or message boards without alerting them that they've been banned. Typically, this means that a user can continue posting as normal, but their posts will be hidden from the rest of the community. In this case, Twitter made changes to how it ranks its search results for accounts from what it considers to be \"bad-faith actors who intend to manipulate or divide the conversation,\" the company said. Twitter also had a bug that caused some accounts to not be auto-suggested in search results even when people were searching for their names. That means users couldn't see Pizzagate conspiracy theorist Mike Cernovich's account in their search results, but Twitter says that hundreds of thousands of accounts were impacted by this issue, and that it didn't impact users based on their political affiliation. The bug didn't prevent affected users' tweets from being seen or interacted with, but some conservatives still called it a Twitter \"shadow ban.\" Twitter says the bug was just that--a bug, which has since been fixed. But \"shadow banning\" continues to be a digital bogeyman, used to shoo away the nuances of social media platforms' increasingly complicated (and often opaque) content moderation strategies. The term has been used by Ted Cruz and Project Veritas's James O’Keefe to suggest an anti-conservative bias in Silicon Valley, and the term itself has recently become part of conspiracy theorists' vocabularies, much like \"crisis actor\" and \"the deep state.\" And while the term refers to a real and commonly implemented moderation technique used on countless internet forums over the years, using the term now often says something about a person's political beliefs. Shadow banning sounds nefarious, but the term has a much less controversial origin that I spent the last few days tracking down. Toading and Twit Bits Before there were \"shadow bans,\" there was \"toading.\" Early internet anthropologist and Motherboard contributor Claire Evans told me that a practice similar to shadow banning--not exactly a ban, but more of a muting--was happening on multi-user domains (MUDs), text-based Dungeons and Dragons - like chat rooms that were popular as early as the 70s. MUD users had \"toading,\" which was \"the act of metaphorically turning someone into a\" toad' as a punitive measure, \"Evans told me in an email. Toading someone removed\" the flag by which the system recognizes the player-object as a player, \"according to Yib's Guide to MOOing. This effectively made the player invisible to the system and other players.\" Another version of toading was kind of the opposite, moving the player to a public space in the game in order to humiliate them, \"Evans, the author of Broad Band said.\" Sunlight is the best antiseptic, etc. \"Read more: The Secret History of a Fleeting Pre-Internet Digital Media Channel Other shadow ban-like moderation tools evolved in the 1980s and 1990s. According to The Telecommunications Illustrated Dictionary, many bulletin board systems (BBS) server access control lists in the 80s (like mod privileges, but for everyone on your server) included flags for each user that admins could toggle individually, granting users access to things like chat, email, or downloads in the BBS. One of these flags was an early version of a shadow ban: The\" twit bit' is a flag that basically labels a user as a \"loser,\" in BBS parlance. In other words, the twit is someone who has been flagged for limited access because s/he exhibits immature behavior and can't be trusted with access to any of the powerful features. In this very thorough Metafilter thread users agree that the earliest concept of shadowbanning came from Citadel-derived BBS servers. User ricochet biscuit wrote: \"It was easy then to create a forum on a topic that would enrage a known troll and just set it so the only users who could see it were the troll and myself. I would post a single item and then watch him try to rabble-rouse and wonder aloud why no one was taking the bait.\" Someone claiming to be a former systems administrator of a Citadel BBS board said on the forum Simple Machine that they remember a feature called \"coventry,\" named after the idiom for ostracizing someone. Admins could set a coventry \"bit\" on a user and their messages, so that if they did happen to add something worthwhile to the conversation, individual messages could be taken out of coventry, so to speak. \"Most of the time, such users would get increasingly worse for a short period of time, then never come back again,\" user labradors wrote. \"In some cases, though, they realised that nobody would respond to their rants--only their helpful messages, and they would quiet down to become good, productive members of the board.\" Kill Files, * plonk * and MUDs At the same time BBS users were sending people out to coventry, people on Usenet newsgroups were managing their feeds with personalized filters. Philip Greenspun, an early internet entrepreneur and pioneer of online communities, alluded to a similar feature in 80s Usenet servers. Back then, \"it was possible to establish a\" bozo filter' to screen out messages from posters with a track record of being uninteresting, \"he wrote on his blog. Read more: Ten Years of' 2 Girls 1 Cup,' the Most Memorable Brazilian Shit on the Internet I asked Seth Morabito--a Unix programmer who worked at one of the biggest Silicon Valley startups in the 90s and has spent a lot of time in then-obscure online communities--whether he recalled seeing anything like a shadow ban on the forums he frequented. He told me in an email that the closest he could think of happened on Usenet newsgroups, where a decentralized conversation could take place. What he described sounds kind of like the\" bozo filter. \"If you were in a flame war, or if you were just acting like an asshole, you could be added to other another user's\" kill file. \"The kill file let users create a list of usernames and keywords they no longer wanted to see (similar to\" muting \"on Twitter .)\" People being people, folks very rarely put anyone into their kill file without letting the target KNOW that they were being put into a kill file, \"Morabito said. It became tradition to reply to the victim with a single word: * plonk, * surrounded by asterisks.\" It was more or less public shaming, letting both the target and the rest of the newsgroup know that your buttons had been pushed so hard that you were just going to outright ignore the troublemaker forever more, \"he said. The\" Shadow Ban \"Like so much other modern internet lingo, the\" shadow ban \"seems to have come from the humor website and forums Something Awful. Rich Kyanka, the creator of Something Awful, says that the site that spawned\" weird Twitter \"coined ubiquitous internet terminology including\" banhammer, \"\"spoiler alert,\" \"let's play,\" and \"AMA.\" (Ask Me Anything). He also says that Something Awful mods invented the term \"shadow ban\" in 2001. \"We would use it as a joke and only do it to people who were intentionally trying to troll others,\" Kyanka, who is regular-banned from Twitter these days, told me in an email. \"None of the moderators used it very often, and we got rid of it within a year, replacing it with simply banning the person.\" The banned user could easily tell if they were shadowbanned by logging out of their account and looking for their own posts. Kyanka is banned from Twitter for making jokes that the platform deemed against its community guidelines. Some of those jokes include telling far-right personality Baked Alaska that he \"should go to a room and the room should fill full of concrete,\" which Twitter deemed a death threat, and telling Nancy Pelosi to \"eat the children,\" which the platform considered hate speech. The term shadow banning has persisted in internet forums and subreddits until today. Message boards still have functionalities like this, including vbulletin's \"global ignore\" which adds a user to every other user's ignore list. There's a subreddit dedicated to figuring out whether you've been shadow banned, where a bot will give you the verdict. But even though platforms like Twitter claim they don't shadow ban users, there are still people who blame their voices not being heard on this real feature of other internet communities. The Birth of a Conspiracy Theory The idea that Silicon Valley giants use shadow banning to silence conservatives was popularized by far right publications over the last two years. In 2016, Breitbart published a story claiming that Twitter shadow banning is \"real and happening every day,\" citing a source inside the company. In January, Project Veritas published a selectively edited video of a former Twitter software engineer who explained the concept of shadow banning and how Twitter was using it. Sen. Ted Cruz repeated the claim from Project Veritas during a Senate hearing with Twitter's director of public policy Carlos Monje, who denied that Twitter was shadow banning users. In a blog post published Thursday, Twitter said unequivocally: \"We do not shadow ban.\" In the early days of the web, online communities were small, fractured, and came up with different ways to police themselves, which is why we have all these different, interesting terms like toading and kill files. Today, platforms like Twitter have to moderate millions of people--billions, in Facebook's case. Because of this scale, content moderation is significantly different. Moderators are rarely members of the communities they're moderating and are instead people who are paid to action content that is reported by users for violating a platform's rules or content that is surfaced by algorithms. Read more: How r/the _ <mark>donald</mark> Became a Melting Pot of Frustration and Hate The types of actions that can be taken against content are also far more sophisticated. Because very few social media sites use reverse-chronological timelines anymore, every piece of content is \"moderated\" automatically by a platform's algorithm in some way, making it more - or less-likely to show up in users' feeds. Though Facebook and Twitter can and do delete content and ban users for violating their rules, they also have more nuanced ways of moderating content that they believe to be problematic. In the case of Holocaust denial for example, Facebook will sometimes \"significantly reduce the distribution of content\" rather than outright ban it. Part of the current confusion about shadow banning is happening because conspiracy theorists are trying to prove an anti-conservative bias from some of the world's most powerful companies, and \"shadow banning\" sounds scary. But not all of this confusion is in bad faith: Social media companies have traditionally been terrible at explaining how they do moderate, and its timeline algorithms and rule-making processes are all black boxes that have not been sufficiently explained to the public. In fact, last month, the special rapporteur to the United Nations's Human Rights Council issued a 20-page report noting that social media companies \"must embark on radically different approaches to transparency at all stages of their operations, from rule-making to implementation and development of\" case law \"framing the interpretation of private rules.\" It would be a lot cleaner and easier to explain away why people aren't engaging with your social media posts on a platform purposefully deciding it wants to censor you, but the fact is that algorithms are making a lot of the decisions about what people see and don't see. Content moderation simply isn't as straightforward these days. \"I'd say one of the key advantages the old-school Internet has over today's platforms is that it you were much more likely to just get booted from a community if you didn't follow the rules,\" Evans said. SHARE TWEET Tagged: Twitter <mark>Trump</mark> moderation shadowbanning"}, {"articleID": "2017122303_00377787_W", "names": {"Steve Bullock": ["Q24015", "Q7612088", "Q7612089"]}, "date": "2017-12-23", "url": "http://www.ktvq.com/story/37130823/analysis-tax-bill-means-savings-for-most-montanans-lower-state-revenues", "content": "Analysis: Tax bill means savings for most Montanans, lower state - KTVQ.com | Q2 | Continuous News Coverage | Billings, MT Analysis: Tax bill means savings for most Montanans, lower state - KTVQ.com | Q2 | Continuous News Coverage | Billings, MT Member Center: Analysis: Tax bill means savings for most Montanans, lower state revenues Posted: Updated: By Jonathon Ambarian - MTN News HELENA - The vast majority of Montanans will pay less in federal income tax after the new Republican tax reform bill takes effect in January, according to new analysis from the state Department of Revenue. The agency analysis says more than three-quarters of the roughly 461,000 Montana households that file federal tax returns will receive an income tax cut of at least $50 a year and at least 2 percent of what they currently pay. About 20 percent of households will see a small change--an increase or decrease of less than $50 or 2 percent of their current taxes. Just over 1.5 percent will see a larger tax increase. Overall, Revenue estimates Montanans will save a total of more than $746 million in federal income tax next year. Just under half of that savings--about $356 million--will go to the top 10 percent of income earners. The average tax cut for a Montana household will be about $1,618 in 2018, but that will vary widely based on taxpayers' income levels. For the top third of income earners, those making more than $64,000, the average cut will be $3,881. It will be $945 for a household earning between $64,000 and $20,000, and $307 for those making less. President Donald Trump signed the sweeping tax reform into law Friday. Republican leaders have called it the most substantial change in the federal tax code in decades. The plan reduces the top income tax rate for individuals, adjusts the other individual tax brackets, significantly cuts the corporate tax rate and increases the standard deduction taxpayers can take, among other changes. In addition, it repeals the federal Affordable Care Act's requirement that individuals purchase health insurance or pay a tax penalty. Because the tax law goes into effect next year, people will start seeing changes next month in the amount withdrawn from their paychecks. However, there won't be any large changes in taxpayers' returns for 2017, which must be filed by April. Webb Brown, president and CEO of the Montana Chamber of Commerce, said his group supported tax reform as a way to make American businesses more competitive with those overseas. \"The bottom line here is almost three-quarters of a billion dollars will now stay in Montana, and stay in the economy here,\" he said. \"We're excited about what that will mean in increased economic activity.\" In addition to breaking down the tax bill's effect on individual Montanans, the Revenue Department analyzed what changes it could bring to the state budget. In a memo to Gov. <mark>Steve Bullock</mark>'s budget office, Revenue director Mike Kadas said provisions in the bill might reduce state revenues by millions of dollars. Kadas said the state could lose $29 million in individual income tax during the 2018 tax year. He said the biggest reason is a change to \"pass-through\" businesses, which do not file corporate taxes, but instead pass their income directly to the individuals who own them. The tax reform allowed many of those businesses to deduct up to 20 percent of that income from their taxes. Revenue also estimates Montana could receive $17 million less in corporate tax in 2018. Kadas said that would be mostly due to a change allowing businesses to deduct more of the costs for new equipment and other investments. Kadas' memo also highlighted the possibility that the tax bill could trigger automatic federal spending cuts--including $24 million a year in mineral leasing payments for Montana. That concern is based on a 2010 law that requires offsetting cuts if legislation would otherwise lead to an increase in the national deficit. However, congressional leaders have announced they intend to waive that law as part of a year-end spending agreement. Brown said the Montana Chamber is concerned both about the federal deficit and about the effects the tax reform could have on state revenues, especially after a budget crisis led to a special state legislative session last month. But he said the new law should be a positive change for Montana overall. \"We believe in the long run, this is beneficial,\" he said. \"So now we have to get to work on how we can make the adjustments in Montana.\" The Revenue Department's analysis is based on the tax year, which runs from January to December. The governor's budget office still has to make its own determination of what the changes mean for the state's financial picture. State budgeting is based on a fiscal year that runs from July to June. Kadas said Revenue has only begun to analyze the tax reform's effects on Montana. \"It's a 500-page bill that fits into several thousand pages of code,\" he said. \"I think everything that you see now is preliminary, and we have to have time to kind of work through the details of it.\" Montana's congressional delegation was split on the tax reform plan. Republican Sen. Steve Daines and Rep. Greg Gianforte both supported it, saying it would give Montana families a needed tax cut and provide a boost to the state's economy. Democratic Sen. Jon Tester voted against the plan, saying too much of the tax relief went to the wealthiest Montanans and criticizing the repeal of the individual health insurance mandate. WEATHER Posted: Wednesday, December 20 2017 10:53 AM EST 2017-12-20 15:53:35 GMT There has been a lot of talk about the existence of aliens and UFOs following reports that the Pentagon has researched them, but astrophysicist Neil deGrasse Tyson isn't convinced, or frankly, interested. There has been a lot of talk about the existence of aliens and UFOs following reports that the Pentagon has researched them, but astrophysicist Neil deGrasse Tyson isn't convinced, or frankly, interested. Friday, December 22 2017 2:13 PM EST 2017-12-22 19:13:18 GMT Vernelle Badbear (left) Freman Bends (right) (Photos from Facebook) More than a year after a man was found dead in Big Horn County, a Wyola woman has been charged with the murder. More than a year after a man was found dead in Big Horn County, a Wyola woman has been charged with the murder. Friday, December 22 2017 9:06 AM EST 2017-12-22 14:06:14 GMT The interview comes four months after the disappearance and death of Savanna Lafontaine-Greywind. The interview comes four months after the disappearance and death of Savanna Lafontaine-Greywind. Friday, December 22 2017 10:45 AM EST 2017-12-22 15:45:57 GMT Father James Csaszar / CBS CHICAGO An Ohio priest under investigation for questionable communications with a minor took his life in Chicago. An Ohio priest under investigation for questionable communications with a minor took his life in Chicago."}, {"articleID": "2019061122_00184011_W", "names": {"Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}, "date": "2019-06-11", "url": "http://thechronicleherald.ca/business/wall-street-treads-water-after-recent-rally-320985/", "content": "Wall Street treads water after recent rally Aparajita Saxena Updated: just now By Caroline Valetkevitch NEW YORK (Reuters) - U.S. stocks ended near flat and the Dow snapped a six-day winning streak on Tuesday, as investors paused following a run of gains and fresh worries emerged over the U.S. trade war with China. President Donald Trump said Tuesday he was holding up a trade deal with China and had no interest in moving ahead, unless Beijing agrees to four or five \"major points\" which he did not specify. Separately, Trump said he would impose more tariffs on Chinese imports if there was no progress in talks with Chinese President Xi Jinping at the Group of 20 summit later this month. Stocks were mostly higher in early trading amid lingering optimism over Trump's decision late on Friday to hold off import tariffs on Mexico. \"Trade sentiment is driving everything,\" said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance in Charlotte, North Carolina. \"What we're seeing today is the more pessimistic view on what might happen by the end of the month. Most selling in the month of May could be put down to China and Mexico.\" Investors also may be reluctant to push stocks higher without a fresh catalyst for support, some strategists said. Data showed U.S. producer prices increased solidly for a second straight month in May, in line with expectations of economists polled by Reuters, pointing to a steady pickup in underlying inflation pressures. Industrials and utilities indexes led the way lower Tuesday, with the S & P 500 industrial index falling 0.9%, weighed down by losses in United Technologies Corp and Raytheon Co.. The Dow Jones Industrial Average fell 14.17 points, or 0.05%, to 26,048.51, the S & P 500 lost 1.01 points, or 0.03%, to 2,885.72 and the Nasdaq Composite dropped 0.60 points, or 0.01%, to 7,822.57. Recent optimism over trade tensions and the prospect of an interest rate cut by the Federal Reserve had helped stocks rally in recent sessions. The benchmark S & P 500 is just 2% away from its early May all-time high. The market is betting the Fed will cut interest rates in July and cut two more times this year as Trump's hard bargaining on trade with Beijing and others could push the economy back into recession. United Technologies fell 4% and Raytheon shed 5.1%, a day after Trump gave mixed signals on whether he believed the $121 billion merger between the companies should go forward. On Monday, Raytheon edged higher while United Technologies lost 3.1%. The S & P utilities index on Tuesday was down 0.7%. Symantec Corp fell after Morgan Stanley downgraded the antivirus software maker's stock, citing increased competition. Advancing issues outnumbered declining ones on the NYSE by a 1.08-to-1 ratio; on Nasdaq, a 1.19-to-1 ratio favored decliners. The S & P 500 posted 53 new 52-week highs and three new lows; the Nasdaq Composite recorded 54 new highs and 88 new lows. Volume on U.S. exchanges was 6.76 billion shares, compared to about 6.92 billion average for the full session over the last 20 trading days. (Reporting by Caroline Valetkevitch; Additional reporting by Sinead Carew in New York and Aparajita Saxena and Shreyashi Sanyal in Bengaluru; Editing by Leslie Adler and <mark>Tom Brown</mark>) More Business stories"}]