[{"articleID": "2008090919_00011655_W", "names": {"Francis Harvey": ["Q3081481", "Q5481239"]}, "date": "2008-09-09", "url": "http://blog.myspace.com/index.cfm?fuseaction=blog.view&friendID=45627880&blogID=431544820", "content": "gender: male status: in a relationship age: 35 sign: gemini city: san diego news and politics great article from wired! link: mccain hits obama on army \"future'; took similar position in '06 back in 2006, john mccain lashed out at the army, for its wasteful, bloated future combat systems modernization program. earlier today, it appears the republican presidential nominee may have gone after his democratic rival--for opposing the very same program .\" during the primary [obama] told a liberal advocacy group that he'd cut defense spending by tens of billions of dollars, \"mccain said today. he promised them he would, quote,\" slow our development of future combat systems .' \"as blake hounshell notes (and as the obama campaign confirms) the illinois senator was\" referring to future combat systems (fcs), the controversial, $200 billion pentagon procurement program, rather than \"future combat systems' as a generic concept .\" mccain is, of course, extremely familiar with fcs, the army's effort to revamp soldiers' networks, robots, and fleets of ground vehicles. not only is it the biggest modernization project in the army's history. but in 2006, mccain held hearings on the program--specifically, on the shady deal between boeing and the army for fcs. somehow, the contract (then estimated to be worth a mere $128 billion), was put under the federal regulations that control the purchase of \"off-the-shelf\" items, like microsoft word. which meant next-to-no government oversight. the massive contract was being overseen by the contractors themselves--a classic case of the fox watching the henhouse. mccain tore into the deal, regardless--another example of the arizona senator's long, long history of exposing waste, corruption, and pork in the pentagon budget. he was warned that any changes to the contract might delay fcs. mccain pushed for 'em, anyway. \"the fcs system is being included in the fiscal '06 budget as a commercial off-the-shelf item. that means that they are relieved of the obligation to [give] cost and purchasing data to military auditors,\" sen. mccain told army secretary <mark>francis harvey</mark> during a march 3, 2006 senate armed services committee hearing. \"tell me, mr. secretary, where might i be able to purchase such a vehicle commercially?\" the regulations were eventually rewritten, thanks to mccain's pressure. \"we have taken the view that with hundreds of millions, or even billions, of dollars at stake, the taxpayer needs the protections built into the traditional procurement system,\" he said. fcs has gone through numerous changes since then. the army's latest plans, as i understand them, call for speeding certain parts of fcs up--while slowing down or killing others. no one is particularly excited about keeping the status quo."}, {"articleID": "2014110610_00056094_W", "names": {"Greg Baker": ["Q128830", "Q42913450"]}, "date": "2014-11-06", "url": "http://www.masslive.com/news/worcester/index.ssf/2014/11/worcester_seeks_input_for_spen.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to comments Worcester seeks input for spending plan for federal funds \"There's 199 apartments here. That's bigger than a lot of neighborhoods .\" WORCESTER - City officials got an earful of complaints and suggestions from residents of Lincoln Park Towers Wednesday. The residents felt that their neighborhood had a number of strengths, ranging from easy access to stores, transportation and medical facilities, to a quiet atmosphere away from the city's bars and night-time hot-spots, to an inclusive atmosphere with a lot of activities for the largely elderly population. However, there were also a number of areas the residents hope to see improved, from the most local level, like the slow elevators and slamming doors in the tall apartment buildings and the need for a dog park, to more broad concerns, such as the construction of roads and bridges and better coordination of traffic and pedestrian signals. Some even raised concerns about \"troublemakers\" in the buildings and a desire for an increased police presence in the area. The comments came during one in a series of community forums aimed at getting input from residents to inform the city's five-year plan for spending federal Community Development Block Grants (CDBG). The goal, said <mark>Greg Baker</mark>, the city director of Neighborhood Development, is to explore the issues of importance to residents in different parts of the city. The comments will help the city craft its requests for federal funding and keep the government informed of the overall goals for Community Development Block Grants - which <mark>Baker</mark> said totaled some $4 million to $6 million per year. \"Your feedback is very important and we take it very seriously,\" he told the group of more than 20 residents. Ed Moynihan, chairman of the Community Development Advisory Committee, said that although the process can be cumbersome at times it really provides good, needed insights into what residents really want and need. \"That's one of the strengths of the program,\" Moynihan said of the CDBG's requirement to solicit community involvement. \"It does force people to listen and the process makes people feel involved in making improvements, which they are .\" He added, \"Hopefully we'll get a nice good cross section\" from the forum and the others like it in the series. Another four more community forums are scheduled before the end of the month. However, Moynihan noted that some of the concerns, like the complaints about the towers having only two elevators, were almost certainly outside of the scope of projects the grants are allowed to address. \"Still, it's a concern,\" he said. \"But it doesn't really make the cut .\" One resident, Randell Ormo, who lives in the towers, noted that although the facilitators were encouraging participants to think about their neighborhood, everyone present lived in the building. When the big stories break, we'll send you an alert. Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 MassLive LLC. All rights reserved ("}, {"articleID": "2015120422_00026997_W", "names": {"Carmen Perez": ["Q30106075", "Q48700552", "Q5043536"]}, "date": "2015-12-04", "url": "http://newsday.com/long-island/garner-protestors-plan-acts-despite-23-arrests-1.11193854", "content": "Protest organizers vowed to step up citywide demonstrations to call for the \"immediate firing\" of NYPD police officer Daniel Pantaleo, who is accused of using an apparent chokehold that killed Eric Garner last year but was not indicted by a Staten Island grand jury. Twenty-three protesters were arrested Thursday night at Gracie Mansion after they blocked East End Avenue traffic for about 30 minutes. Police placed plastic handcuffs on them and moved them into police vans. The demonstrators were issued summons for disorderly conduct and refusing to disperse, according to police. They are scheduled to appear in summons court in January, said Susan Howard, executive director of the National Lawyer's Guild NYC, whose attorneys represent the demonstrators. advertisement | advertise on newsday <mark>Carmen Perez</mark>, executive director of the social media activist group Gathering for Justice, said \"a series of new protests\" are being organized since Police Commissioner William Bratton announced this week that the department will hold off on its internal review until a federal investigation is complete. Story Garner protesters arrested at Gracie Mansion Story Bratton: NYPD to decide on chokehold charges More coverage Eric Garner apparent chokehold case Federal prosecutors are investigating possible civil rights violations against Pantaleo, who has been placed on modified duty since Garner's death in July 2014. Garner died when police tried to arrest him for selling loose untaxed cigarettes in Staten Island. The arrest was caught on cellphone video and ignited a wave of police brutality protests across the city and nation last winter. \"We will hit the streets in the cold and snow like last year until we see justice,\" said <mark>Perez</mark>, whose group will join Garner's daughter Erica Garner in Staten Island to mark the one year anniversary when a Staten Island grand jury did not indict Pantaleo for the death of her father, 42. \"We will be showing up tonight (Friday night) at the 120th Precinct where Officer Pantaleo worked at the time when Eric Garner was killed,\" said <mark>Perez</mark>. \"A lot of organizations are coming together. People are feeling the energy .\" "}, {"articleID": "2015051215_00031221_W", "names": {"Joe Sutton": ["Q16885980", "Q19560871"]}, "date": "2015-05-12", "url": "http://ozarksfirst.com/story/d/story/two-police-officers-shot-dead-in-hattiesburg-miss/42082/Inh5a2yPJkC5Hv0YMmpuxQ", "content": "HATTIESBURG, Miss. (CNN)--Two police officers were shot dead in Mississippi late Saturday. It was the first time in 30 years that an officer was killed in the line of duty in Hattiesburg, the mayor said HATTIESBURG, Miss. (CNN)--Two police officers were shot dead in Mississippi late Saturday. It was the first time in 30 years that an officer was killed in the line of duty in Hattiesburg, the mayor said. Officers Benjamin J. Deen, 34, and Liquori Tate, 24, were making a traffic stop when they were shot, Mayor Johnny DuPree said. They were taken to a hospital, but did not survive. \"The men and women who go out every day to protect us, the men and women who go out every day to make sure that we are safe, were turned on tonight,\" DuPree said. Police have apprehended two suspects, Marvin Banks and Curtis Banks, he said. After the shooting, the suspects stole a police vehicle, which they used to flee. It was later found abandoned, according to CNN affiliate WDAM. The two men both have criminal records. Police also took a woman into custody who was with the suspects at the time of the shooting, WDAM reported. They have not said whether she was involved. DuPree told CNN a third suspect was taken into custody, but did not disclose the gender. Deen was named the city's officer of the year in 2012, according to The Clarion-Ledger in Jackson, Mississippi. Tate had recently graduated from the police academy. Deen leaves behind a wife and two children. Tate was not married and had no children, DuPree said. After visiting the crime scene, the mayor went to the hospital, where he tended to family members until early Sunday. \"You have to search for words you say to family members how much we love them; we are here to support them,\" he said. The city is making grief counselors available to the slain men's fellow officers. DuPree vowed that the perpetrators of the attack would face justice. Police in Oxford, Mississippi, sent out condolences in a tweet. \"Both Hattiesburg Police Officers have died. Terrible. Prayers to the entire community and families,\" it read. (<mark>Joe Sutton</mark> and Ben Brumfield, CNN)"}, {"articleID": "2011060221_00094607_W", "names": {"Jon Fitch": ["Q2480113", "Q6270709"], "Dos Santos": ["Q1378703", "Q56241895"], "Chris Cope": ["Q26253826", "Q47122063", "Q5106258"]}, "date": "2011-06-02", "url": "http://mmajunkie.com/news/23842/oddsmaker-says-ufc-137-line-could-continue-to-improve-for-nick-diaz.mma", "content": "oddsmaker says ufc 137 line could continue to improve for nick diaz following wednesday's announcement of an october super fight between ufc welterweight champion georges st-pierre (22-2 mma, 16-2 ufc) and strikeforce titleholder nick diaz (25-7 mma, 6-4 ufc), st-pierre opened as a healthy -365 favorite. that means st-pierre was given nearly an 80 percent chance of winning the fight. but as noted mma oddsmaker joey oddessa told mmajunkie.com (www.mmajunkie.com), the bettors' early money is coming in for diaz, and his underdog status could continue to diminish as the fight draws near. the pay-per-view title fight, which appears to be just for the ufc belt (though officials haven't clarified), takes place oct. 29 at the mandalay bay events center in las vegas. it's the first major ufc vs. strikeforce fight since ufc officials purchased their rival promotion in march. oddessa said some early, pre-announcement lines had st-pierre as much as a -450 favorite. however, that line was based on the belief that the fight would take place in st-pierre's home country of canada, part of a planned december show in montreal. now that it's officially slated for sin city, diaz is considered less of an underdog. and it's a trend that could continue. \"in the early hours after i opened (st-pierre) at -365, i saw a steady flow of support come in on nick diaz,\" said oddessa, who frequently appears on mmajunkie.com radio to preview fights and discuss betting lines. \"the line has been down to -340, and it's likely to continue its steady flow toward nick diaz if his strong fan base continues to bet rapid fire on the emotion and anticipation of nick's return to the ufc .\" with all the recent fight cancellations, bettors usually don't care to tie up money on future bouts unless they anticipate fairly large swings in the odds. the early money on diaz may be a strong indicator of where the betting line is headed. \"oddessa, who's the brain behind some of mma's most widely used betting lines, said this is somewhat unchartered territory for diaz. since leaving the ufc in april 2006, he's posted a 14-1 record in organizations such as pride, elitexc, strikeforce and dream. outside of a pride 33 meeting with takanori gomi that ended in victory (but was later changed to a no-contest due to a failed drug test), diaz has been an underdog just once: against frank shamrock in 2009. (diaz, of course, won that fight .) st-pierre, too, is used to the\" favorite \"status .\" nick diaz and george st-pierre have entered the ring and cage all but one time as the betting favorites dating back over five years, \"oddessa said .\" over that time period of a combined near 25 bouts, the average price on diaz and st-pierre in each outing was higher than -375, and more than often, most gamblers referred to each as the \"lock' on the card .\" white on \"tuf\" talk, pettis' future, edgar-maynard iii, lesnar's health, aldo, dark-era dvds white: champ st-pierre isn't fighting at ufc 140 in montreal, next challenger not set boxing promoter chargin: george st-pierre vs. nick diaz targeted for december promoter says nick diaz no longer set to box, dana white insists ufc bout not guaranteed poll result: which potential ufc vs. strikeforce matchup intrigues you the most? press release announces nick diaz to box jeff lacy, manager says gsp fight still possible cesar gracie: \"ultimate risk-taker\" nick diaz perfect for gsp - if the money's right georges st-pierre vs. nick diaz? hurdles exist, but ufc president open to idea white on \"tuf\" talk, pettis' future, edgar-maynard iii, lesnar's health, aldo, dark-era dvds white: champ st-pierre isn't fighting at ufc 140 in montreal, next challenger not set boxing promoter chargin: george st-pierre vs. nick diaz targeted for december ufc contender <mark>jon fitch</mark> says gsp, b.j. penn are only fights that make sense poll result: which potential ufc vs. strikeforce matchup intrigues you the most? poll results: following ufc 129, who is now the top pound-for-pound fighter in the world? cesar gracie: \"ultimate risk-taker\" nick diaz perfect for gsp - if the money's right ufc 129 medical suspensions: st-pierre, hominick, couture and brilz out 60 days \"the ultimate fighter 13\" ratings improve for regular-season finale (episode no. 10) ufc on versus 5 tickets on sale june 11, televised main card set tuf 14 finale, michael bisping vs. \"mayhem\" miller headliner slated for dec. 3 team <mark>dos santos</mark> blog: lew polley on \"the ultimate fighter 13,\" episode no. 10 mmajunkie.com radio: kenny florian, <mark>chris cope</mark> (in studio), kyle kingsbury spike tv confirms lineup for the ultimate fight 13 finale, five-fight main card \"ufc undisputed 3\" debuts in january, new enhancements announced team lesnar blog: <mark>chris cope</mark> on \"the ultimate fighter 13,\" episode no. 10 stuck in neutral, ufc 131's junior <mark>dos santos</mark> ready to continue heavyweight drive mmajunkie.com discussions to join the mmajunkie.com discussions with your fellow mma junkies, mma forums. rules: no spam. no fighter bashing. no insulting other posters. no disruptive posts. nothing \"not safe for work\" or illegal, including links to illegal videos. mmajunkie.com reserves the right to moderate all posts. mmajunkie.com promotes intelligent and respectful discussions, and registering for an account is a privilege, not a right. for the sake of those who follow the rules, offenders will be banned from the site with little or no warning. my a $$... diaz is gonna be a 6-to-1 favorite...anyone betting money on diaz is making a suckers bet...gsp pre matt serra was an interesting person to watch. yeah but safe fighting also brings longer careers. since when is gsp a hump fest on the ground. he is constantly looking to we could argue about who knows more about mma. you may know more than me but thats irrelevant. it is true from gsp's pov to fight smart is obviously smart. he has a good record and makes bank every fight. he wont make new fans though and will be remembered as the guy who fights smart but didnt exactly put on some amazing fights or killer kos. the way gsp fights now. we will never see a seagal kick to the face from the likes of as. what we see is gsp grappling with strikers and striking with grapplers. i dont know about you. but i was pretty pissed about the fight with him and shields. i have to admit i was excited and had high hopes. but it turned out to be a jab fest much like the gsp vs kos fight. he is good but i am pretty sure most wouldnt consider him the most entertaining fighter to watch. i love to see exciting fights as much as the next person does as well. all im saying is that gsp ground game isn't a hump fest is very active and one of the best at passing guards. just cuz he is unable to finish doesn't mean he is lnper. gsp is def the best ww out there whether he finishes or not. instead of being interested in gsp being more aggressive and finishing, anyone betting on nick has money they just want to throw away. nothing is 100% in a fight, but i'm sorry nick is not going to beat gsp outside of some fluke event. shields is better then nick and i think would beat him 9 out of 10 times in a fight. morons saying gsp got banged up by pillow hands discounting the guy couldn't see out of one eye are just blind haters who want him to lose. story of this fight is gonna be nick still has no tdd and will be taken down at will. on the ground gsp will gnp his way to victory. don't really see how the odds could get better in favor of diaz. its pretty obvious how this fight will go and there isn't much diaz will be able to do about it. lets see how good that bjj is since everyone claims that diaz has this sick jj from his back. my guess is its not gonna be so good against a very quality opponent like gsp. prolly no way does gsp taking nick down work out in favor of nick. his jj has never been tested by someone with awesome fights like this are loved by pro gamblers. for various reasons (many of them perfectly fair, but not rational) nick is hugely overrated by casual fans and his own diehard fans and so we might get to the point where gsp is like -250. once the odds get good enough those in the know will put their money on gsp. there's a reason he opened as a big favourite."}, {"articleID": "2018010914_00755022_W", "names": {"De Jesus": ["Q36553259", "Q5361013"], "Bob Price": ["Q18358850", "Q4933684"]}, "date": "2018-01-09", "url": "http://www.breitbart.com/texas/2018/01/09/guatemalan-gets-5-years-assaulting-border-patrol-agent/#disqus_thread", "content": "A Guatemalan man will spend five years in a U.S. prison after he assaulted a Border Patrol agent in Uvalde, Texas. The agent suffered a concussion after the man pounded his head against a train car. In November 2016, Border Patrol agents discovered two illegal immigrants near a train that recently crossed the border from Mexico. One fled the scene. The other, Elias <mark>de Jesus</mark> Gregorio <mark>de</mark> Paz, a 21-year-old Guatemalan national, began fighting with one of the agents. During the fight, <mark>de</mark> Paz slammed the agent's head, neck, and body into the train causing the agent to lose consciousness, according to court documents. The illegal immigrant fled the scene and disappeared for a few days. Border Patrol agents encountered <mark>de</mark> Paz on November 22, 2016, and placed him in custody. The injured Border Patrol agent was transported to the hospital--doctors determined he suffered a concussion from the assault. <mark>De</mark> Paz pleaded guilty to assaulting the agent in federal court on March 9, 2017. On January 8, U.S. District Judge Alia Moses sentenced the Guatemalan national to five years in prison. He also ordered <mark>de</mark> Paz to pay $5,767.28 to the Border Patrol agent for restitution to cover medical expenses and lost wages. \"This case demonstrates the great sacrifice Border Patrol Agents make every day, often risking their lives to protect our nation. Violence against Border Patrol Agents will not be tolerated,\" San Antonio Division FBI Special Agent in Charge Christopher Combs said in a written statement obtained by Breitbart Texas. To combat rising assaults against Border Patrol agents, Attorney General Jeff Sessions announced plans to increase the number of prosecutions. In a memo dated April 11, 2017, Sessions directed prosecutors to push for charges against anyone who assaults, resists, or impedes agents engaging in the performance of their official duties, Breitbart Texas reported. Despite this effort, assaults on Border Patrol agents continue to increase. During Fiscal Year 2017, assaults on Border Patrol agents increased by more than 70 percent over the prior year. A total of 786 agents were assaulted in 324 incidents over the period ending September 30, 2017. During the first two months of Fiscal Year 2018, 96 Border Patrol agents were assaulted in the line of duty. <mark>Bob Price</mark> serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @ BobPriceBBTX, Gab, and Facebook."}, {"articleID": "2015022221_00004950_W", "names": {"Fernando Alonso": ["Q10514", "Q20533356", "Q42393967", "Q42394430", "Q5444582", "Q5859158"], "Luke Smith": ["Q13512824", "Q16233583", "Q16853339", "Q17048712", "Q20713853", "Q22097885", "Q55621442"]}, "date": "2015-02-22", "url": "http://blackflag.jalopnik.com/alonso-crashes-in-f1-testing-airlifted-to-hospital-wit-1687327778", "content": "<mark>Fernando Alonso</mark> was airlifted to the hospital after crashing his McLaren in preseason testing at Barcelona earlier today. He went off at Circuit de Barcelona-Catalunya's Turn 3, smacking the right side of the car hard. McLaren race director Eric Boullier confirms that he was concussed in the accident. Autoweek reports that <mark>Alonso</mark> \"was conscious and spoke with the doctors\" according to the staff in the medical center at Catalunya, however, it was standard procedure to airlift him to the hospital for a wreck of this nature. <mark>Fernando Alonso</mark> airlifted to hospital following crash during F1 test in Barcelona <mark>Fernando Alonso</mark> airlifted to hospital following crash during F1 test in Barcelona <mark>Fernando Alonso</mark> airlifted to hospital following cr <mark>Fernando Alonso</mark> was taken to the hospital by helicopter after crashing in his McLaren during...Read more Read more According to NBC Sports reporter <mark>Luke Smith</mark>, <mark>Alonso</mark> will remain in the hospital overnight for observation. According to BBC Sport, medical scans found no signs of injury. <mark>Alonso</mark> concussed after test crash <mark>Alonso</mark> concussed after test crash <mark>Alonso</mark> concussed after test crash Read more Read more McLaren officials and the track have not given a reason for <mark>Alonso</mark>'s crash. No one is sure if something broke on the car or driver error was the cause. BBC Sport also reported that Sebastian Vettel had been following <mark>Alonso</mark> at the time and reported that the crash looked bizarre. \"The speed was slow - maybe 150kph [41 mph]. Then he turned right into the wall. It looked strange,\" he told them. #F 1 @ Alon_oficial to stay in hospital following crash during testing @ McLarenF1 @ SkySportsF1 http: //t.co/myZEfY2F10 pic.twitter.com/OaBemLKiBq - Optimum Sports Media (@ optimum_sports) February 22, 2015 Testing resumed at the track after a slight delay following a lunch break. McLaren, however, called it a day. Jenson Button was supposed to test out the car after <mark>Alonso</mark>, but opted not to throw it back together for today."}, {"articleID": "2017092205_00259842_W", "names": {"Ajay Singh": ["Q15734101", "Q20630466", "Q25991768", "Q4699657", "Q4699658", "Q4699660", "Q47126262", "Q57080992", "Q58483951"], "Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2017-09-22", "url": "http://www.financialexpress.com/world-news/north-korea-may-consider-hydrogen-bomb-test-in-pacific-kim-jong-un-calls-donald-trump-deranged/865720/", "content": "North Korea said on Friday it might test a hydrogen bomb on the Pacific Ocean after U.S. President Donald Trump vowed to destroy the country. (File Photo: Reuters) Top News After Ratan Tata, now Anand Mahindra backs Narendra Modi, says PM clearly communicating India's direction NDTV stock hits upper circuit, jumps 5% as Spice Jet's <mark>Ajay Singh</mark> all set to take command Tata Motors Nexon launched priced at Rs 5.85 lakh to take on Maruti Suzuki Vitara Brezza, Ford Ecosport North Korea said on Friday it might test a hydrogen bomb on the Pacific Ocean after U.S. President Donald Trump vowed to destroy the country, with leader <mark>Kim Jong Un</mark> promising to make a \"mentally deranged\" Trump pay dearly for his threats. <mark>Kim</mark>, who has traded ever-more heightened rhetoric with Trump, did not specify what his response would be. His comments were believed to be the first direct message ever issued by a North Korean leader. However, <mark>Kim</mark>'s foreign minister, Ri Yong Ho, said North Korea could consider a hydrogen bomb test of an unprecedented scale on the Pacific Ocean, South Korea's Yonhap news agency reported. Ri, who was talking to reporters in New York ahead of a planned address later this week, however also said he did not know <mark>Kim</mark>'s exact thoughts, according to the report. Japan, the only country ever to suffer an atomic attack, described the threat as \"totally unacceptable\". Trump said in his first address to the United Nations on Tuesday he would \"totally destroy\" North Korea, a country of 26 million people, if it threatened the United States and its allies, and called <mark>Kim</mark> a \"rocket man\" on a suicide mission. <mark>Kim</mark> said the North would consider the \"highest level of hard-line countermeasure in history\" against the United States and that Trump's comments had confirmed his own nuclear programme was \"the correct path\". Pyongyang conducted its sixth and largest nuclear test on Sept. 3 and has launched dozens of missiles this year as it accelerates a programme aimed at enabling it to target the United States with a nuclear-tipped missile. \"I will surely and definitely tame the mentally deranged U.S. dotard with fire,\" <mark>Kim</mark> said in the statement carried by the KCNA state news agency, referring to Trump. \"SLEEPWALKING INTO WAR\" Vipin Narang, an associate professor of political science at Massachusetts Institute of Technology, said he could not recall such a statement in the first person, authored and signed by <mark>Kim</mark>. \"I don't think it's happened before. That's something to take seriously alone,\" he said. The escalating rhetoric came even as U.N. Secretary-General Antonio Guterres called for statesmanship to avoid \"sleepwalking\" into a war. South Korea, Russia and China all urged calm. Also Watch: However, the rhetoric was starting to rattle some in the international community. French Sports Minister Laura Flessel said France's team would not travel to the 2018 Winter Olympic Games in South Korea if its security cannot be guaranteed. The 2018 Games are to be staged in Pyeongchang, just 80 km (50 miles) from the demilitarised zone between North and South Korea, the world's most heavily armed border. Asian stocks fell and the Japanese yen and Swiss franc gained on the possibility of a hydrogen bomb test in the Pacific. MSCI's broadest index of Asia-Pacific shares outside Japan handed back earlier gains and was down 0.4 percent after falling 0.7 percent the previous day. MORE TIME In his sanctions announcement on Thursday, Trump stopped short of going after Pyongyang's biggest trading partner, China, praising as \"tremendous\" a move by its central bank ordering Chinese banks to stop doing business with North Korea. The additional sanctions on Pyongyang, including on its shipping and trade networks, showed that Trump was giving more time for economic pressures to weigh on North Korea after warning about the possibility of military action on Tuesday. Asked ahead of a lunch meeting with the leaders of Japan and South Korea on Thursday if diplomacy was still possible, Trump nodded and said: \"Why not?\" Trump said the new executive order on sanctions gives further authorities to target individual companies and institutions that finance and facilitate trade with North Korea. It \"will cut off sources of revenue that fund North Korea's efforts to develop the deadliest weapons known to humankind\" , Trump said. The U.S. Treasury Department now had authority to target those that conduct \"significant trade in goods, services or technology with North Korea\". Trump did not mention Pyongyang's oil trade. The White House said North Korea's energy, medical, mining, textiles, and transportation industries were among those targeted and that the U.S. Treasury could sanction anyone who owns, controls or operates a port of entry in North Korea. \"ON NOTICE\" U.S. Treasury Secretary Steven Mnuchin said banks doing business in North Korea would not be allowed to also operate in the United States. \"Foreign financial institutions are now on notice that going forward they can choose to do business with the United States or with North Korea, but not both,\" Mnuchin said. The U.N. Security Council has unanimously imposed nine rounds of sanctions on North Korea since 2006, the latest this month capping fuel supplies to the isolated state. South Korean President Moon Jae-in, who addressed the U.N. General Assembly, said sanctions were needed to bring Pyongyang to the negotiating table, but Seoul was not seeking North Korea's collapse. \"All of our endeavours are to prevent war from breaking out and maintain peace,\" Moon said in his speech. He warned the nuclear issue had to be managed stably so that \"accidental military clashes will not destroy peace\". The United States and South Korea are technically still at war with North Korea because the 1950-53 Korean conflict ended with a truce and not a peace treaty. The North accuses the United States, which has 28,500 troops in South Korea, of planning to invade and regularly threatens to destroy it and its Asian allies."}, {"articleID": "2015061219_00022745_W", "names": {"David Wong": ["Q1177251", "Q5240254", "Q5241267", "Q5241268", "Q5241269", "Q7186568", "Q7930045", "Q8231513"]}, "date": "2015-06-10", "url": "http://www.foxnews.com/us/2015/06/10/nobody-heard-anything-prison-break-spotlights-code-silence-behind-bars/", "content": "Law enforcement officers question a woman, Wednesday, June 10, 2015, who lives near the prison in Dannemora, N.Y., as they searched houses near the maximum-security prison in northern New York where two killers escaped using power tools. State Police said the fifth day of searching will entail going from house to house in Dannemora, where David Sweat and Richard Matt cut their way out of the Clinton Correctional Facility. (AP Photo/Seth Wenig) Law enforcement officers walk the streets in Dannemora, N.Y., as they searched houses near the maximum-security prison in northern New York where two killers escaped using power tools, Wednesday, June 10, 2015. State Police said the fifth day of searching will entail going from house to house in Dannemora, where David Sweat and Richard Matt cut their way out of the Clinton Correctional Facility. (AP Photo/Seth Wenig) Other inmates at the state prison in Dannemora may have been in a position to see or at least hear two convicts making their escape using power tools to cut steel, break through bricks and slice open steam pipes. But in a world where snitching can get you killed, investigators ran all too predictably into a wall of silence. \"Nobody heard anything. Nobody saw anything,\" Gov. Andrew Cuomo said sarcastically this week about the questioning of inmates. \"They're all heavy sleepers .\" Prison experts and former inmates say breaking through that silence is tough but not impossible. And in a case as notorious as the weekend escape of two murderers from the maximum-security Clinton Correctional Facility in Dannemora, investigators may be willing to make deals. \"There's certainly a group of people in every prison or every jail who are just waiting to be snitches,\" said University at Buffalo Law School professor Charles Ewing, a forensic psychologist. \"But it needs to be done very discreetly .\" A prisoner wanting to talk might send an anonymous note to the warden offering information that can be valuable currency behind bars. It could be traded for a favorable parole recommendation, dismissal of disciplinary measures, a transfer to a prison offering \"easier time,\" or something as simple as extra bedsheets. Indeed, investigators are wary of snitches who make up information just to get benefits or settle a score. But the code of silence can be so strong that any rewards authorities can offer may be outweighed by the dangers of being branded an informant. Investigators coming through a prison may well hear inmates yelling to each other from behind bars: \"Make sure you mind your business!\" said Ronald Day, a former New York inmate who is now a vice president of the Fortune Society, which helps ex-prisoners. The search for the escaped inmates entered a fifth day Wednesday, with law enforcement officers in helmets and body armor going door to door in the Dannemora area. The 170-year-old, 3,000-inmate prison has a particularly notorious reputation, singled out in a watchdog report last year for a higher rate of violence among inmates than most New York state prisons. State Assemblyman Daniel O'Donnell, who is chairman of the Corrections Committee and visited Clinton last September, said he was astounded by the accounts of violence from inmates. He said any inmate who might have heard the power tools used in the escape wouldn't dare say anything. \"Let me be clear: That will get you killed. That's the kind of environment it is,\" O'Donnell said. \"You can't expect people to behave like Catholic school monitors .\" While investigators try to protect their prison sources, Day said word of any informants on a case as big as this one is likely to leak out. It took New York City private investigator Joseph Barry three years to persuade a group of convicts at the Dannemora prison to sign statements clearing fellow inmate <mark>David Wong</mark> in a deadly prison-yard stabbing. Barry showed up repeatedly, seeking to catch the inmate witnesses by surprise and in private. Over time, more than 10 met with him behind bars. Some were promised parole recommendations, transfers or other benefits, he said. But the ultimate factor in getting them to come forward? The fact that the inmate they implicated in the stabbing had died and couldn't retaliate, Barry said. \"Because you can't be looking over your shoulder all the time,\" he said. 1 AACP lends supports to local leader accused of misrepresenting herself as black 2 Prison worker smuggled tools, other items to escaped inmates that may have aided their break-out 3 Ex-candidate pleads guilty in New Mexico topless video extortion case 4 Prosecutor: Slain mom, girl were witnesses against suspect"}, {"articleID": "2019062121_00299909_W", "names": {"Justin Ryan": ["Q40742189", "Q55590271"]}, "date": "2019-06-21", "url": "http://www.abc57.com/news/mayor-pete-skips-campaign-events-for-march-in-south-bend", "content": "Mayor Pete skips campaign events for march in South Bend email To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video NOW: Mayor Pete skips campaign events for march in South Bend NEXT: Historic tornado month in Indiana, Ohio, U.S.; another active...SOUTH BEND, Ind.--South Bend Mayor Pete Buttigieg has cancelled a scheduled appearance in South Carolina Friday. Instead, the 2020 presidential candidate stayed in South Bend for a march for Eric Logan. Logan was killed by South Bend Police Sgt. <mark>Ryan</mark> O’Neill early Sunday morning. Political analyst say the timing of the shooting puts Mayor Pete's campaign in a bind. \"The timing really couldn't be worse,\" said Jake Colwell, a political analyst. \"It was a lose-lose situation. There's no way have tried to continue on the campaign trail when something like that was happening in his city. During his campaign, Buttigieg has struggled gaining support among black voters. Friday's event in South Carolina would have afforded him a chance to garner support among a key Democratic constituency .\" Since the beginning of his campaign, we've seen at his campaign rallies, the struggle he's had to attract black voters, \"said <mark>Justin Ryan</mark> Gomez, 2020 Presidential Campaign Reporter/Producer for ABC News. As the fallout from this shooting continues, both Gomez and Colwell agree that it was imperative that Buttigieg be seen in the city trying to calm tensions, instead of campaigning .\" The optics would have been pretty bad had he decided to keep on campaigning and just manage this over the phone. In that kind of situation, I think it was very important that he was in South Bend and back at home to manage this from the ground, \"said Gomez. Share this article:"}]