[{"date": "2015-10-15", "url": "http://www.cp24.com/news/a-look-at-some-of-the-more-popular-facebook-posts-from-the-election-campaign-1.2611883", "content": "Talk Shows A look at some of the more popular Facebook posts from the election campaign Liberal leader Justin Trudeau, Green Party leader <mark>Elizabeth May</mark> and New Democratic Party leader Thomas Mulcair listen as Conservative Leader <mark>Stephen Harper</mark> take part in the first leaders debate Thursday, August 6, 2015 in Toronto. THE CANADIAN PRESS/Frank Gunn Chris Herhalt, CP24. com Published Thursday, October 15, 2015 6:09 PM EDT Videos and Facebook Q & A s dominate the list of leading posts by federal party leaders on Facebook during the 2015 campaign, according to the company's analysis. In no particular order, here are the posts that sparked public interest: Tom toasts his beer policy: On Aug. 7, International Beer Day, NDP leader Tom Mulcair's campaign posted an image of Mulcair toasting with a glass of beer. It touted the party's plan to offer tax credits to small brewers. <mark>Harper</mark>'s first interactive Facebook Q & A: On Sept. 8, Conservative leader <mark>Stephen Harper</mark> conducted a live question-and-answer session on his Facebook page. The first three questions people asked him revolved around the Conservatives plan to deal with the Syrian refugee crisis, their stance on Israel and what it is like to be prime minister. Trudeau releases campaign platform in Facebook livestream: On Oct. 5, Liberal leader Justin Trudeau released his party's 88-page campaign platform document via a live video broadcast, combined with a question-and-answer period on Facebook. <mark>Harper</mark> reiterates debate stance on Niqab: On Sept. 27, <mark>Harper</mark> posted an image with a quote reiterating a statement he made during a debate, where he said he would \"never tell my young daughter that a woman should cover her face because she is a woman. That's not our Canada .\" The niqab is a face-covering veil worn by a small minority of Muslim women. The niqab, it's admissibility at citizenship ceremonies and elsewhere has generated considerable debate and controversy during the campaign. Greens post Rick Mercer urging young Canadians to vote: The Green Party posted a Rick Mercer \"rant\" urging young Canadians to get off the couch and vote. It was viewed 495,000 times. Tom Mulcair hosts a Facebook Q & A: Mulcair hosted a Facebook question and answer session at the company's Toronto headquarters on Aug. 27. The first three questions he fielded concerned the cancelled women's issues debate, whether he was serious about repealing the Conservatives' counter-terrorism/surveillance legislation (Bill C-51), and his party's plans for the CBC. Justin Trudeau's Eid al-Adha message: A recorded video message released on Sept. 23 expressing greetings to Canadian Muslims on Eid al-Adha was viewed 423,000 times. Tom Mulcair expresses best wishes to Muslims celebrating Eid al-Adha: A recorded video message posted to Facebook on Sept. 26 from Mulcair wishing Canadian Muslims a special Eid al-Adha \"saw unusually high engagement,\" according to Facebook. It was viewed 282,000 times. <mark>Harper</mark> says armed intervention crucial to stopping ISIS: A clip of a speech <mark>Harper</mark> made in Markham posted to Facebook on Aug. 10 showed <mark>Harper</mark> arguing for continued airstrikes and training of local forces to combat the Islamic State. Trudeau pens a letter to <mark>Harper</mark> about Mike Duffy: A letter by Trudeau outlining his concerns about Senator Mike Duffy during his fraud trial in Ottawa rounds out the list of most significant posts by party leaders on Facebook. In the letter, Trudeau asks <mark>Harper</mark> when he knew about the arrangement for <mark>Harper</mark>'s former chief of staff <mark>Nigel Wright</mark> to repay Duffy's improperly claimed expenses, as well as whether <mark>Harper</mark> stayed in contact with <mark>Wright</mark> after <mark>May</mark> 2013.", "articleID": "2015101522_00065193_W", "names": {"Nigel Wright": ["Q7032722", "Q7032726", "Q7032728", "Q7032729"], "Stephen Harper": ["Q206", "Q7609425"]}}, {"date": "2015-10-16", "url": "http://www.gameranx.com/updates/id/31033/article/valve-refuses-to-put-ads-on-steam/#disqus_thread", "content": "Why Valve Refuses to Put Ads on Steam Valve does not see any value in advertising commercial products in Steam's PC storefront. by Olga Lexell on 16th Oct, 2015 Follow @ gameranx Be it online, in-game, or somewhere inbetween, ads are a hot topic in the games community, particularly how much they are not wanted. One place you won't be seeing them any time in the future, though, is Steam. In fact, Valve's <mark>Erik Johnson</mark> believes that while it would boost revenue, implementing ads in the Steam PC storefront would be detrimental to the whole platform. \"We don't see a case for that ever getting user value,\" <mark>Johnson</mark> said in a GameSpot interview. \"I don't think that those ever work, either .\" <mark>Johnson</mark> went on to say that \"it would be a bad business decision, let alone just dumb\" to introduce ads to the storefront, believing it would ruin their customers' experience. This customer-oriented approach seems in-line with other recent company moves, such as Valve's promise to refund any games purchased on Steam. According to <mark>Johnson</mark>, the company would rather \"focus on long-term relationships .\" Valve's <mark>Robin Walker</mark> agreed, and re-iterated that one of the company's primary goals is to help users searching for games amidst all of the releases in their massive library. Indeed, Valve did prove their commitment to long-term relationships when they announced their partnership with GameStop and other retailers who plan to sell their hardware, which goes on sale in November. Stories from around the web", "articleID": "2015101619_00151767_W", "names": {"Erik Johnson": ["Q14874320", "Q16196083", "Q5388659", "Q58750433", "Q960577"], "Robin Walker": ["Q19668306", "Q263076", "Q57008521"]}}, {"date": "2015-10-17", "url": "http://dailyjournalonline.com/news/state-and-regional/blue-jays-encarnacion-to-play-hurt-in-game-of-alcs/article_40d8617f-afcd-54c2-b6f5-58ecb314faf5.html", "content": "Blue Jays' Encarnacion to play hurt in Game 2 of ALCS Saved 2015-10-17T13:40:22 ZBlue Jays' Encarnacion to play hurt in Game 2 of ALCSThe Associated PressThe Associated Press48 minutes ago (0) Comments KANSAS CITY, Mo. (AP)--Manager <mark>John Gibbons</mark> says Edwin Encarnacion is back in Toronto's lineup for Game 2 of the ALCS, determined to \"deal with the pain .\" Batting fourth as the designated hitter, Encarnacion was removed in the eighth inning of Kansas City's 5-0 win on Friday night when his left middle finger swelled up again. <mark>Gibbons</mark> said Encarnacion underwent an MRI before deciding to play on Saturday. \"A normal game, he wouldn't be in there,\" <mark>Gibbons</mark> said. \"But we need him, so he's in there. He'll battle through it .\" Encarnacion, who hit 39 home runs and had 111 RBIs for the East champs, has struggled with the finger much of the year, missing games in August and September. Justin Smoak pinch hit in the eighth inning and popped out with two runners on base. \"Edwin's a big part of our team,\" said Toronto outfielder Kevin Pillar. \"Any time he's in the lineup we're a better team. It's something he's dealt with throughout the year. He probably wouldn't be playing if it wasn't a postseason game. But Edwin is truly passionate and wants to win and he's going to do whatever it takes to get ready to play today .\" Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2015101719_00084069_W", "names": {"John Gibbons": ["Q19953474", "Q21557552", "Q27074107", "Q30122089", "Q3181578", "Q53552549", "Q55403007", "Q6235234"]}}, {"date": "2015-10-18", "url": "http://www.nj.com/mets/index.ssf/2015/10/will_chris_christie_go_with_the_mets_to_wrigley_fi.html", "content": "Will Chris Christie go with the Mets to Wrigley Field? Comments NEW YORK--Chris Christie was among the happy Mets fans exiting Citi Field after Game 1, still marveling at the dominant performance of starter <mark>Matt Harvey</mark> in a 4-2 victory over the Cubs, when he was asked if he would truly go all out to support his favorite baseball team in the NLCS. Coming to Citi Field on Sunday night for Game 2? That's a given. But what about on Tuesday night, when the series shifts to Chicago's famous Wrigley Field? Would the governor cut into a week of campaigning to take this show on the road? \"Probably not,\" he told NJ Advance Media as he made his way past the Mets clubhouse and out of the ballpark late Saturday night. \"I'm going to Iowa. I'll be close, but not close enough .\" It wouldn't have been the first time that Christie left the area to support one of his favorite teams. He flew to Green Bay to watch his beloved Cowboys lose a heartbreaker to the Packers at Lambeau Field last winter, and if anything, his Mets fandom is just as strong if not stronger. RELATED: <mark>Harvey</mark> was \"an animal\" in his memorable NLCS debut Christie told me a great story in 2010 about showing up at a book signing in Mendham--and, despite being governor, standing in line with everyone else until the organizers saw him--to meet Darryl Strawberry. \"In our house,\" Christie said then, \"it is absolutely mandatory that you're Mets fans. You're not allowed to be anything else .\" It's far too early to know what will happen in this series, but the 1-0 series lead means that the Mets could have a shot to clinch a World Series berth in Chicago. Maybe, if that's the case, Iowa won't be far enough to keep him from making the trip. Steve Politi may be reached at spoliti @ njadvancemedia.com. Follow him on Twitter @ StevePoliti. Find Steve on Facebook.", "articleID": "2015101815_00056650_W", "names": {"Matt Harvey": ["Q3299470", "Q6788770"]}}, {"date": "2015-10-18", "url": "http://columbiadailyherald.com/news/local-news/new-publisher-joins-daily-herald", "content": "New publisher joins The Daily Herald New publisher joins The Daily Herald Keith Ponder jbennett @ c-dh.net A veteran newspaper executive who spent the last 16 years in Kentucky has been named publisher of The Daily Herald. Keith Ponder, 53, will become publisher in Columbia effective Monday, with the retirement of longtime publisher <mark>Mark Palmer</mark>. Ponder most recently was publisher of the Glasgow Daily Times in southern Kentucky. While he was publisher in Glasgow, the newspaper achieved record highs in daily and Sunday circulation. It was named best small daily by the Kentucky Press Association in 2014. Ponder also helped relaunch the company's web site and convert the newspaper into a regional print site. He also was a regional vice president for Community Newspaper Holdings Inc., the Daily Times' parent company. \"I feel honored to be coming to Columbia as publisher,\" Ponder said. \"It is a strong newspaper that serves the community well, and my obligation is to continue to do the good work that <mark>Mark</mark> and the entire team have been doing for years .\" We want to be engaged in the community and want engagement from readers in every form, \"he added .\" We want to be one of the central connecting points in the community. \"Earlier in his career, Ponder worked in executive roles for Donrey Media Group and Stephens Media, previous owners of The Daily Herald. He was publisher in Oskaloosa, Iowa, and advertising director in Weatherford, Texas. The Daily Herald and Stephens Media were purchased in March by New Media Investment Group's GateHouse Media, which owns 126 daily newspapers and 550 community publications and operates in more than 460 markets in 32 states. <mark>Rick Martin</mark>, regional publisher for the group of GateHouse papers in which The Daily Herald will operate, said he conducted an extensive search after <mark>Palmer</mark> announced his retirement .\" We think Keith's experience and credentials make him a perfect fit in Columbia, \"<mark>Martin</mark> said .\" He has a collaborative style that will serve him well with the staff and the community. \"While in Kentucky, Ponder served on the boards of United Way of Southern Kentucky, Glasgow/Barren County Chamber of Commerce, Glasgow/Barren County Family YMCA, Glasgow Rotary Club and the Kentucky Press Association. He served as treasurer of the YMCA, president of the noon Rotary Club and for three years chaired First United Methodist Church's building program .\" I think being involved civically is an important part of a publisher's job, \"Ponder said. Ponder is a native of Newton, Iowa, and a 1984 graduate of Morningside College in Sioux City, Iowa. He and his wife, Sharon, are parents of two children: Abby, 21, a senior at Western Kentucky University, and Mitchell, 16, a junior in high school. Sharon is a preschool teacher .\" I have worked exclusively in markets about the size of Columbia, as a corporate executive and a publisher, \"Ponder said .\" That is where I am most comfortable and where I think there's greatest opportunity to serve readers and customers. I can't wait to get started. \"", "articleID": "2015101818_00052578_W", "names": {"Mark Palmer": ["Q17484236", "Q4995756", "Q6769145"], "Rick Martin": ["Q328789", "Q52895580"]}}, {"date": "2015-10-19", "url": "http://spacecoastdaily.com/2015/10/ucf-researchers-perform-worlds-first-automated-mass-crowd-count/", "content": "UCF Researchers Perform World's First Automated Mass-Crowd Count By UCF / / October 19, 2015 Computers have scanned aerial photographs and conducted the first automated mass-crowd count in the world, thanks to the work of researchers at the University of Central Florida. (Nick Russett, UCF Image) ORLANDO, FLORIDA (UCF.EDU)--Computers have scanned aerial photographs and conducted the first automated mass-crowd count in the world, thanks to the work of researchers at the University of Central Florida. Counting large-scale crowds (such as the Million Man March in Washington, D.C.) has been a long, tedious process involving people examining aerial photographs one at a time. Until now, each photograph had to be divided into sections and the examiners counted the number of heads per inch. But now, UCF's Center for Research in Computer Vision has created software that promises to automate the process and cut down the time dramatically, from up to a week to 30 minutes, giving organizers critical information when planning for events or responding to emergencies. UCF's test run was conducted in September. Thousands of demonstrators along a 3.2-mile stretch of Barcelona were calling for the independence of the Catalonia province from Spain. Using the new software, 67 aerial images of different sections were analyzed. Related Story: UCF To Conduct National Search For Athletic Director After O’Leary Stepped Down The software program came up with a total count for each of the images within 30 minutes. The images and calculations were then sent to Pompeu Fabra University in Spain, where statistics professor Albert Satorra led a team in reviewing the data. Using UCF results for the images, they concluded the count for the entire crowd at about 530,000. That number is well below the count claimed by rally organizers, said Haroon Idrees, a post-doctoral associate at the UCF center who conducted the analysis that was sent to Satorra. <mark>Mubarak Shah</mark> \"Automated computer analysis of such large-scale and dense crowds has never been done before,\" said <mark>Mubarak Shah</mark>, computer science professor and director of the center. \"We will continue to push the envelope of state-of-the-art in-crowd analysis so that it can by help the authorities and governments manage real-time safety of large crowds and perform post-event analysis of such gatherings .\" Crowd counts have been done digitally before, but not for large-scale crowds involving hundreds of thousands of people. The discipline is important because knowing the size of crowds can help organizers plan for events and can also help them have appropriate staffing available for emergencies. Dinesh Manocha \"This is a huge milestone in how mass crowds are counted,\" said Dinesh Manocha, a computer science professor at the University of North Carolina at Chapel Hill not involved in the project. \"UCF's computer-vision program has been the leading research group on developing computer-vision techniques for analysis of crowd videos and their research can have significant impact in terms of development of next-generation crowd-management technologies .\" ", "articleID": "2015101918_00043987_W", "names": {"Mubarak Shah": ["Q28036606", "Q5412180"]}}, {"date": "2015-10-20", "url": "http://www.huffingtonpost.com/2015/10/19/driver-swerves-hits-motorcyclist_n_8335616.html", "content": "Texas Driver Slams Into Motorcyclist, Then Says' I Don't Care' Motorist now facing charges of aggravated assault. Ed MazzaOvernight Editor, The Huffington PostPosted: 10/20/2015 03:56 AM EDT A driver was caught on video swerving into a motorcyclist, hitting the bike and knocking both the biker and his passenger onto the ground at high speeds in Texas on Saturday. Motorcyclist <mark>Eric Sanders</mark> suffered a cut on his arm and road burn in the crash. \"I've got a gouge in my elbow that is bone-deep,\" <mark>Sanders</mark> told WFAA, the ABC station in Dallas. His passenger, Debra Simpson, had to be airlifted to a hospital, where she was initially placed in intensive care. She suffered a broken wrist with deep arm lacerations, according to CBS DFW, but was transferred to a regular room on Monday. She is now in stable condition. When confronted about the incident, the motorist who hit them had just three words to say, all of which were caught on the video: \"I don't care .\" \"That's the worst thing, when I saw that dude saying,' I don't care, I don't care .' He says it four to five times,\" <mark>Sanders</mark> told WFAA. \"I've never seen this guy in my life. And he ran me over .\" Driver William Crum, 68, was charged on Monday with two counts of aggravated assault with a deadly weapon, according to The Associated Press. Each count has a maximum penalty of up to 20 years in prison if convicted. Footage recorded by another rider shows <mark>Sanders</mark> crossing the double-yellow line to pass Crum on a two-lane road in Granbury, about 70 miles from Dallas. Crum then swerves, hitting <mark>Sanders</mark>: After saying \"I don't care\" several times, Crum claims that he was stung by a wasp. He later told CBS DFW that he was bitten by a spider. \"It bit me right in the tendon, so right now I have a tendon that's hurting if I stand. If I walk off I'll limp,\" Crum said. Crum told WFAA he wished he could \"go back in time,\" but also indicated that while he'd apologize to the passenger, he had no apologies for <mark>Sanders</mark> \"because he was doing something illegal\" in trying to pass him. WFAA reports that <mark>Sanders</mark> was also cited for passing in a no-passing zone and driving with an invalid license. However, <mark>Sanders</mark> wrote on Facebook that he tried to pass despite the double yellow line because Crum had slowed to about 40 mph on a road where the speed limit was either 60 or 65 mph. While he's been getting plenty of messages of support, <mark>Sanders</mark> has also heard from some who blame him for the incident. \"I'm glad your woman lived,\" someone wrote to him in a post shared on Facebook. \"It's too bad you did .\" <mark>Sanders</mark> has set up a GoFundMe page, saying he and his girlfriend will be out of work for several weeks as a result of the accident.", "articleID": "2015102009_00003400_W", "names": {"Eric Sanders": ["Q3731522", "Q5387430", "Q5387431"]}}]