[{"articleID": "2010041107_00069643_W", "names": {"Zhao Yue": ["Q21017044", "Q45407237", "Q45453748", "Q45468296", "Q45470855", "Q45472212", "Q45473689", "Q45475462", "Q45507264", "Q45523835", "Q45528284", "Q45555514", "Q45573666", "Q45592285", "Q45596062", "Q45596786", "Q45606751", "Q45608807", "Q45612186", "Q45648080", "Q45653293", "Q45669953", "Q45672330", "Q45725796"]}, "date": "2010-04-11", "url": "http://in.news.yahoo.com/32/20100411/1067/twl-behind-the-bamboo-dome.html", "content": "shanghai, april 10--it remains one of the greatest human fossil discoveries of all time. the bones of a race of tiny primitive people, who used stone tools to hunt pony-sized elephants and battle huge komodo dragons, were discovered on the indonesian island of flores in 2004. india's blueprints requiring 15 km of bamboo stumped the shanghai engineers who expertly build skyscrapers of glass and steel. next door to india, saudi arabia spent 146 million dollars on a giant neon-lit steel spaceship that will be torn down after six months. a futuristic city built with chinese steel, raw materials and migrant labour is rising on shanghai's marshy huangpu riverfront. china has transformed a little-known trade fair called the world expo, last held in spain in 2008, into a bigger and costlier spectacle than the beijing olympics. diplomacy with rising china has forced over 200 nations including india to spend more than ever in the expo's 158-year history for the may-october event. india's symbol in shanghai will be the world's biggest bamboo dome topped with a windmill and solar panels that can produce power. saudi arabia's dhow-shaped spaceship dwarfs it, but india is being noticed in the sea of steel. communist officials of a boomtown in east china have demanded a replica for wuxi city. \"most chinese people have never been abroad but now they can see the world in their home,\" <mark>zhao yue</mark> ting, a senior engineer of the state-owned china jingye engineering corporation building india's pavilion, told the hindustan times, quoting a shanghai government propaganda line. \"you've seen the modern buildings in my country, all same,\" he said. \"this one is different and famous in china .\" china, the first developing nation to host an expo, has made the culture and trade fair a symbol of shanghai's urban miracles. the subway network was doubled to 420 km within just one year in 2009. a 45 billion dollar facelift includes a new airport terminal and runway. seven hundred million dollars were used to spruce up shanghai's waterfront bund as a rival of the champs elysees in paris. india's rs 40 crore budget - the biggest-ever and overshot - doesn't compare to germany's 67 million-dollar, france's 68 million-dollar and australia's 76 million-dollar temporary pavilions. the us, almost last to confirm entry, scraped together 61 million dollars through fundraisers. japan has stuffed a 140 million-dollar lilac silkworm cocoon with intelligent robots. as ht toured the 5.28 km world city, pedestrians clicked photographs of a military helicopter circling low. chinese staff stepped out of an infosys bus. etiquette volunteers in green and white uniforms with detachable sleeves and legs marched on roads smelling of tar. the dome stands opposite an 18,000-seat permanent culture centre where india will host a bollywood concert in july. \"the expo impact on indian industry will be limited. but once people understand a little more about indian culture, hopefully it will help improve our unbalanced trade with china,\" said j j shrikhande, who heads the india-china business forum in shanghai. the dome is more path breaking than it looks. the engineers had to design the first-ever bamboo construction code and get the chinese to approve it before building. \"this site was marshy reclaimed land so the foundation is as deep as the dome is high,\" d r naidu, vice-president of design c, a delhi-based company that conceptualised india's pavilion, told ht. he's a veteran of expo designs, but found the china's perfectionism for global events and complex rules (the bamboo must be fire and fungus-proof) most challenging. asian rivalries play out openly with all eyes on the neighbours' progress. china's oriental red pavilion is india's largest neighbour even on this site. pakistan's lahore fort - reportedly sponsored by china - stands in china's shadow with only minarets visible from india's pavilion. bhutan pulled out. jin chuan zhu, a worker at the indian site, said the expo is a window to \"what china is today .' but only five per cent of the expected 100 million visitors will be foreigners. the city gleams of fresh paint on high-rises along main avenues. one million volunteers and 300 miss etiquettes trained in manners and military marches will man shanghai for six months. volunteers coach residents not to walk out in pyjamas for the sake of shanghai's prestige. new security rules require shanghai's 20 million residents to produce identity proof to buy a kitchen knife or rat poison."}, {"articleID": "2017111001_00406697_W", "names": {"Carlos Ruiz": ["Q21555320", "Q441052", "Q475730", "Q5042595", "Q5042597", "Q54555383", "Q55281068", "Q9697328"]}, "date": "2017-11-10", "url": "http://www.nbcsports.com/philadelphia/phillies/roy-halladays-family-releases-statement-memorial-details", "content": "Roy Halladay's family releases statement, memorial details AP Images Fans have shared their memories and paid tribute to Roy Halladay after the former Phillie died Tuesday from a plane crash in the Gulf of Mexico. The outpouring of support has deeply touched his loved ones. On Thursday, the Halladay family released a statement on Roy's life, including memorial service details. A celebration of his life will be held Tuesday, Nov. 14, at 4 p.m. at Spectrum Field in Clearwater, Florida, and it is open to the public. Here is what the Halladay family had to say in memory of Roy: Our family is heartbroken in confirming that Roy passed away in a plane crash Tuesday afternoon. While many will remember him for his success as a major league pitcher, we remember him as an amazing father, loving husband and loyal friend. Roy had many accomplishments in his professional career, the memories of which we will cherish forever. He described each achievement as a team effort rather than an individual accomplishment, a true testament to his character and love for his teammates. Roy grew up with a passion for planes and always had the goal of becoming a pilot. Since retiring from baseball, he has been actively studying, accumulating the required flight hours and obtaining multiple pilot certifications and licenses. Just as he was known for his work ethic in baseball, he was also widely respected by those who knew him in the aviation community for his hard work, attention to detail and dedication to safety while flying. He treated his passion for aviation with the same joy and enthusiasm as he did his love for baseball. That passion was also expressed through his tireless dedication to helping his own children and so many others learn to love and respect the game of baseball. He was an amazing coach for many youth teams, always showing patience and encouragement while reminding each child that they all had a role to play, a way to contribute and add value to their team. His love for the game had no boundaries as we often saw him instructing and encouraging the players on opposing teams. Roy was selfless in every aspect of his life. While we mourn the loss of the core of our family, we choose to celebrate him and remember the man we knew privately on and off the field. We hope that he serves as an example of professionalism, integrity and hard work for all who knew him. For us, we will forever remember his unconditional love, humility and the sacrifices he made to provide for the family that meant the world to him. On behalf of our family we thank you for respecting our privacy during this time of overwhelming grief. We also ask that you respect the privacy of our extended family as well as the families and children who Roy has coached, taught or worked with. We are so fortunate and thankful for the outpouring of love and support we've received from across the world. The Halladay Family Remembering Roy Halladay, who died Tuesday at the age of 40 after his plane crashed in the Gulf of Mexico. Chase Utley seldom looks out of place on a baseball field. He is a preparation junkie, always in tip-top shape and runs out every play like it's his last. Then he met the surgeon on the mound. Roy Halladay, a competitor of Utley's ilk, was his match. In his career, \"The Man\" never logged an official at-bat against \"Doc\" --and for that, he considers himself fortunate. However...\"I believe I faced him in spring training and he made me look like a little leaguer out there,\" Utley said Wednesday on NBC Sports Philadelphia's Philly Sports Talk. \"And I think I might have faced him in the All-Star Game (2009), and I remember thinking,\" OK, I've heard a lot about him, first pitch I see that's going to be a strike, I'm going to try to put it in play .' I did and I was out. He was a man among boys out there. He truly was. \"Utley and Halladay, astoundingly alike in their baseball makeup and mindset, shared an incredible appreciation for one another, especially after they became teammates in 2010. Over the past two days, Utley has found himself sharing that appreciation in the wake of Halladay's death on Tuesday, a result of a tragic plane crash .\" Obviously this is terrible, my heart goes out to Brandy and his two boys (Ryan and Braden), \"Utley said .\" I know he was really involved in their athletic abilities. I did a camp for them, this was a few years ago, and he was a coach, he had all the gear on, and he was really into it. Words can't really describe...it's just not a good thing. But I think it's important to reflect on all the positive things that he not only did for Major League Baseball, but for the Phillies and his teammates. He really made his teammates better. \"Utley was made better by Halladay as the two pushed each other with their drive to be better than the day before. Utley offered a glimpse inside his own routine for spring training. And the day someone actually beat him to the ballpark. It was Halladay at 5:45 a.m.\" I heard a lot of good things about Roy prior to actually meeting him. Going back to the Instagram post that I put out [Tuesday], I thought I was a guy that got to the ballpark early to get a bunch of work done before the day really started, \"Utley said .\" I walked in, I think I was with Brian Schneider at the time, and Roy was sitting there in his workout gear, almost finished with breakfast, he was soaking wet. I assumed he had worked out, but I made a joke, \"Hey, man, was it raining when you walked into the ballpark?' He kind of looked at me, laughed [and said],\" No, I just finished my workout .' That's something that I'll never forget about him. Right then and there, I knew what he was all about--all the rumors, all the stories that I heard about him prior to that, I knew they were all real. \"Halladay captured the hearts of Philadelphia. A blue-collar city could tip its cap to a player with such dedication and determination. Utley said those traits resonated with his teammates, as well .\" He was obviously an important part of our ballclub and he rubbed guys the right way, he made guys around him better, he was the best pitcher in all of baseball, \"Utley said .\" Our pitching staff, even our position players, kind of watched what he did in between starts and I think a lot of them implemented that into what they did on a daily basis. Guys gravitated towards him. \"What he did, in the era that he did it, is truly remarkable. There's a reason he was so good. Obviously everyone is talking about how hard he worked between starts, and it was no joke. He was getting after it and it motivated me, it motivated a lot of guys to try to become the best player you could be. And he got the most out of everything .\" He was a once-in-a-lifetime player to be honest with you. \"Utley got a taste of it one steamy day in Chicago's Friendly Confines, where he was baptized with Halladay's unmatched intensity .\" I remember a game we were playing in Wrigley Field. And for some reason that day, it felt like it was 1,000 degrees on the field. There was no breeze, it was probably 105 degrees, but the heat index must have been much higher, \"Utley said .\" And he was working. As we all know, he was working hard out on the mound. \"I remember thinking,\" OK, he's working hard, it's super hot out here, I'm going to go to the mound and maybe give him a breather .' So I go to the mound, I think I pretend like I'm tying my shoes and he looked at me with like this evil look. I knew right then and there, he didn't need a break, he didn't need to take any time off. He wanted to get back to pitching, so I learned my lesson at that point to not bother him when he's doing his thing on the mound. \"That's because Halladay was as fierce as any when it came to winning. Utley mentioned the decisive Game 5 of the 2011 NLDS against the Cardinals. Halladay allowed a leadoff triple to Rafael Furcal, who a moment later scored what turned out to be the game's only run. Halladay finished with eight innings of one-run ball and seven strikeouts. The Phillies lost, 1-0, and the 102-win season was over way too early. Still, Utley looks back on that night in amazement of Halladay .\" You knew looking into his eyes after they scored that one run, that they were not going to score another run, \"Utley said .\" And they didn't. Unfortunately we were not able to squeeze a run across, but I remember him just sitting in the locker room after the game, as we all were disappointed. At that point, I just said, \"Doc, you did everything you could do, you need to hold your head high .' I think that picked him up a little bit, but he was all about winning, that's what he wanted to do on a daily basis .\" He accomplished plenty in Philadelphia. The perfect game, the postseason no-hitter, the 2010 NL Cy Young, the franchise-record 102 victories. All with class. \"One thing that I took from him was obviously he was a great pitcher, he had so much success with the Phillies, but after every game he pitched well, which was pretty much the majority of all of them, he would always kind of deflect the attention to somebody else as far as,\" Chooch (<mark>Carlos Ruiz</mark>) called a great game, Ryan Howard had the big home run, Jayson Werth made a great play in the outfield,' \"Utley said .\" That right there showed me what kind of person he was--he wasn't about himself, he was about the team and he was definitely all about winning. \"And, he somehow made a guy like Utley want to work even harder. Remembering Roy Halladay, who died Tuesday at the age of 40 after his plane crashed in the Gulf of Mexico. Cole Hamels looked up to Roy Halladay. The 6-foot-6 frame, the unrivaled work ethic, the mastery of his craft. Hamels saw it all. But he also appreciated something else in Halladay. Fatherhood. As he marveled at the qualities of his old teammate and friend just hours after learning Halladay had died in a plane crash, Hamels' voice grew shaky when family came to mind. (see story) Halladay was a loving father of two sons, Ryan and Braden. (see story) And that's what Hamels admired, what he learned and what he aspires to be, just as much as emulating the machine on the mound. When remembering Halladay on the tragic Tuesday, Hamels thought of his own sons, Braxton and Caleb .\" Now, I have two boys of my own, \"Hamels said .\" And I got to see what that meant to him every time he was able to bring them (Ryan and Braden) around the ballpark. That was something that really did leave an impression. Hopefully I'll be able to do what he was able to do for his boys. \"Halladay, already established and revered as one of the game's best pitchers, came to the Phillies in 2010. Hamels was recovering from a disastrous season in which he went from 2008 World Series MVP to career lows and mental exhaustion in 2009. Hamels, only 26 at the time, found a mentor in the 33-year-old\" Doc. \"Through example and experience, Halladay molded the skinny lefty from California. He exemplified the importance of approach and preparation. Hamels even recalls watching Halladay's tendencies when the big righty was with the Toronto Blue Jays in spring training, before he ever joined the Phillies in that transformational 2010 .\" In order to be great at something, you have to have mentors. You have to have great mentors, and he was one for me, \"Hamels said .\" I watched from afar with being here and him being in Dunedin for the Blue Jays, we got to see him pitch. Seeing him pitch in spring training and then watching him during the season, he was the greatest of that decade. He was the greatest pitcher. You wanted to watch him, see how he attacked hitters, what was he doing different that everybody else wasn't, why was he so great? \"And then to finally play catch with him and see that he had a purpose. Behind everything that he did, he had a purpose. And I think you come to realize that you have very small, short moments in life to be able to do something great, so you have to maximize it, you have to make the best of it--and he did .\" At times, Hamels felt like a kid watching in awe from the stands. \"A lot of us grew up watching Roy Halladay play. I was fortunate to be able to sit in the dugout and share a locker with him for some of the best years I've had,\" Hamels said. \"He's really given me such a way to perceive and to look at baseball and to try to improve and be the best at what I do. He was a man of few words, but you just sat back and you just watched him, you watched what he did, his work ethic was second to none. I mean, you couldn't beat him to the ballpark, and if you did, you were going to lose from there on out .\" You didn't miss those moments when he pitched. Baseball can be a long, grueling season, but when you had Roy Halladay on the mound, you didn't miss an inning, you didn't miss a pitch, you were watching every moment. And I know those are kind of the moments when you're playing this game and you look up in the stands, and there are people there to watch you and watch you perform--I was one of those people. I obviously had a closer seat and got to kind of talk to him a bit in between innings, but I was there to watch him perform. He raised my bar, he raised the game for me. \"He was also influential in developing Hamels' new, difference-making two-seam fastball .\" There was always times when I would be throwing it and it wouldn't be working very well, and I'd ask him and he would just tell me where to put the fingers, the placement and then obviously where to envision where to release it, \"Hamels said .\" He really did help me out with introducing that pitch. \"Hamels and Halladay remained close once the latter retired in December 2013. Hamels said their families had vacationed together and he would frequently text with Halladay throughout the busy baseball season. And Hamels knew well of his buddy's passion for flying planes .\" Knowing that his father was a pilot, I think that was right there, \"Hamels said .\" You look up to your dad always. \"Hamels looked up to Halladay. Not just the pitcher, but the father, too .\" We play this game and we love every minute of it, and then, it is over, \"Hamels said .\" And then you get to go to your family and spend time with your family. To see that it's cut short for somebody that was such a good, good person, to him and his wife Brandy, it's hard to think about what's really going to transpire. He means a lot to all of us and we're really, really going to miss him. \""}, {"articleID": "2010082105_00059371_W", "names": {"Chris Cooley": ["Q2964688", "Q5106256"], "Trae Williams": ["Q41674722", "Q7832385"], "Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"], "Howard Johnson": ["Q16730347", "Q16730348", "Q261884", "Q3141568", "Q5920011", "Q728013"], "David Hollander": ["Q5235092", "Q5235094"]}, "date": "2010-08-20", "url": "http://abcactionnews.com/dpp/news/state/florida-news-quiz%3A-prove-you-were-paying-attention", "content": "florida news quiz: were you paying attention? posted: 08/20/2010 last updated: 8 hours and 43 minutes ago you may have a nose for news, but were you really paying attention? take this week's florida news quiz. prove you're hotter than the heat index when it comes to knowing what's happening around the sunshine state. no googling or binging. shut down those search engines. the quiz starts now! question 1 polk county sheriff grady judd and his deputies made a huge bust with this week, arresting more than a dozen accused sex offenders. which website was used to lure in these men? 1. craigslist 2. facebook 3. amazon 4. findsexoffenders.com to see the answer go to the next page. - sheriff judd says they arrested 15 men that responded to an ad on the website. to read the full story click here. question 2 casey anthony's parents, cindy and george anthony, are looking for a new lawyer. what reason did their old attorney give for his resignation? 1. the anthonys can't afford to pay him. 2. casey anthony's attorneys made false accusations about him. 3. cindy anthony just nailed the lsat and wants to take over the defense. 4. the anthony case is too time consuming. to see the answer go to the next page. answer to question 2 2. casey anthony's attorneys made false accusations against him. - casey anthony's attorneys claim conway kept records about the search for caylee away from them. to read the full story click here. question 3 the florida primary elections are just days away. this week u.s. senate hopeful rep. kendrick meek got a powerful ally. who is now backing the congressman? 1. former president bill clinton 2. president barack obama 3. speaker of the house nancy pelosi 4. justin beiber go to the next page to see the answer. - clinton appeared at three events with meek. meek is taking on jeff greene in the democratic primaries. to read more about the race for the democratic nomination for the u.s. senate click here. question 4 if you're thinking of applying for a job with the city of largo there's an activity that may get you excluded from the list of prospects. what is it? 1. drinking alcohol during the work week 2. texting and driving 3. using tobacco products 4. random fist pumping \"jersey shore\" style go to the next page to see the answer. - the city's director of human resources says with this tough job market it makes sense to reduce the pool of 200 to 300 applicants by choosing tobacco free people. it saves the city money on healthcare. the policy is not in effect yet. to read about the potential tobacco free hiring policy click here. question 5 from south florida bull to tampa bay buc, which football standout did the buccaneers pick up this week? 1. matt grothe 2. george selvie 3. <mark>chris cooley</mark> 4. <mark>trae williams</mark> go to the next page to see the answer. 4. <mark>trae williams</mark> - the cornerback was considered one of the best in the big east during his 2008 season with usf. <mark>williams</mark> has spent time with the seattle seahawks and the pittsburg steelers. question 6 suing publix has two brevard county women in hot water. what did the women say happened at the grocery store that the company is disputing? 1. they found glass in their deli meat sample. 2. an employee sexually harassed them. 3. one of the women slipped and fell. 4. the store's easy listening music selections caused migraines. go to the next page to see the answer. 3. one of the women slipped and fell - the two women face charges for staging a slip and fall. surveillance video shows one of the women easing herself on to the grocery store floor. authorities say six people have been arrested following fake slip and falls at other brevard stores and gas stations in recent months. to read more about what police believe is an attempt to swindle businesses out of hundreds of thousands of dollars and see the surveillance video click here. question 7 a well known astronaut is in the news again. who was kicked out of the u.s. navy because of their behavior? 1. lisa nowak 2. sen. <mark>bill nelson</mark> 3. col. buzz aldrin 4. space commander buzz lightyear go to the next page to see the answer. 1. lisa nowak - best known for her diaper dawning drive from texas to florida, nowak, was arrested in 2007 for pepper spraying a fellow astronaut over a love triangle. a navy panel of three admirals voted unanimously late thursday to discharge nowak and downgrade her rank from captain to commander. to read the full story click here. question 8 two st. petersburg teenagers face charges for playing with their poop at one of the bay area's swankiest hotels. which hotel were they busted at? 1. marriott waterside tampa 2. renaissance vinoy resort and golf club 3. sand pearl resort 4. <mark>howard johnson</mark> downtown tampa go to the next page to see the answer. 2. renaissance vinoy resort and golf club - st. petersburg police spokesman mike puetz said video surveillance at the 5-star hotel captured images of two teenagers scaling the fences and entering the pool area. to read more about what these two men did once they got into the pool area click here. question 9 university of south florida marine researchers found disparaging data about the gulf oil spills affects on marine life. what are the marine organism they believe are being killed off by oil and oil dispersant? 1. gulf shrimp 2. phytoplankton 3. blastomussa coral 4. mrs. paul's fish sticks go to the next page to see the answer. 2. phytoplankton - a chemical oceanographer with usf's college of marine science dr. <mark>david hollander</mark> said, \"we did find that the subsurface waters appear to have a toxic response. there was repression in the phytoplankton .\" phytoplankton are marine plants and are the base of the food web. to read more about what usf researchers found on their two week trip in the gulf click here. question 10 a candidate in the florida republican primaries is now being backed by a republican powerhouse. who is sarah palin supporting for florida attorney general? 1. pam bondi 2. holly benson 3. bill mccollum 4. justin beiber go to the next page to see the answer. answer to question 10 1. pam bondi - former alaska governor sarah palin posted her endorsement of pam bondi on her facebook page wednesday. to read about the other republican powerhouses throwing their support for candidates in the august 24 primaries click here. thank you for taking our florida news quiz. don't forget to let us know how you did. tune in next week for another action packed edition."}, {"articleID": "2015071517_00093385_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}, "date": "2015-07-15", "url": "http://asia.eurosport.com/football/premier-league/2015-2016/arsene-wenger-chuba-akpom-has-chance-to-challenge-for-regular-game_sto4822353/story.shtml", "content": "Arsene Wenger: Chuba Akpom has chance to challenge for regular game By Desmond <mark>Kane</mark> via PA Sport Report ShareLast update 21 minutes ago - Published on 16/07/2015 at 01:06 By Desmond <mark>Kane</mark> via PA Sport Report - 21 minutes ago Arsenal manager Arsene Wenger has challenged Chuba Akpom to show he is ready for a regular place in the first team squad after the 19-year-old forward netted a hat-trick in the 4-0 win over a Singapore Select XI in the Barclays Asia Trophy. Akpom made a handful of appearances for the Gunners last season, before ending the campaign on loan at Nottingham Forest. The England youth international caught the eye during Wednesday's pre-season tour opener, putting Arsenal in front on 30 minutes. Arsenal's Chuba Akpom scores their third goal with a penalty - Reuters Midfielder Jack Wilshere scored a penalty on the hour, before Akpom also netted from the spot on 76 minutes then quickly completed his treble with a powerful header. \"It is down to performance and attitude. He has that grade to make between being a big talent and after an efficient talent week in, week out. That's of course the target,\" Wenger said, quoted on the club's official website, www.arsenal.com. \"That's up to him (on his role for the new season). How much (will he play)? I don't know, but I just believe that it's an encouragement to do well and to work even harder .\" He is a young player and it can lift his confidence. The confidence in the dressing room that you sense from the other players is important as well and that can help him. Let's not forget it's a friendly. He's a good talent, but he has to work and show that in [the big] games. \"\"I sent him out on loan last year because I thought he needed that. This pre-season, during the season I plan to keep him with us .\" Wilshere is another looking to get some much-needed game time following last season's injury problems, and was deployed in the number 10 role. Wenger said: \"He always had appetite Jack, but he was out for a long time. Already in the last two or three games of the season he has found his burst back with acceleration .\" He was injured last year early in the season and he missed five months. What you want at the top level today demands so much physically that to be [out] is a nightmare for the players. That's what he needs - continuity. After, we play so many games. \"We have a big squad, but not a massive one and I think the opportunities will be there for everybody .\" Wenger had rested 10 of his 27-man squad, including summer signing Petr Cech, while captain Mikel Arteta also watched on from the stands. The Arsenal manager was happy enough with the performance. \"Overall it was a positive game because we had a good resistance in the first game. We were tested against a very resilient, very dynamic, very mobile team, with a good collective attitude,\" Wenger said. \"I liked the fact that we kept a good team focus and as well that individually, every player had to dig deep. We suffered a little bit to get a good workout .\" Arsenal will face Everton in the final on Saturday after the Toffees defeated Stoke 5-4 on penalties earlier in the day after their game had ended goalless. Wenger said: \"I will rotate a bit because the week after we play two games again .\" For me at the moment the [objective is] to give competition to the players without overloading them and [for them] to be capable to work hard in training and to work on their fitness. If they play too many games, you cannot work in training. \"OUR VIEW With Yaya Sanogo apparently set to depart Arsenal for a season-long loan spell with Ajax, you might think opportunity knocks for young Akpom. Wenger certainly appears to be making encouraging noises about what the young forward could offer to the club in the season ahead. Wenger said the tour presented a chance for his younger players to impress, and the 19-year-old Akpom certainly appears to have been listerning. If he continues to score goals, he will be viewed as third in line behind Danny Welbeck and Olivier Giroud for a starting spot in the forward areas. Not a bad place to be for any young striker at the start of a season. As <mark>Harry Kane</mark> will testify. Share"}, {"articleID": "2014110900_00000363_W", "names": {"King James": ["Q17100723", "Q36159"], "Chris Bosh": ["Q201386", "Q5105938"], "Kevin Love": ["Q297221", "Q6396801"], "Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2014-11-09", "url": "http://wkrg.com/story/27330142/column-king-james-knows-cavs-a-work-in-progress", "content": "(AP Photo/Rick Bowmer). A Utah Jazz fan celebrates as Cleveland Cavaliers' LeBron James (23) waits during the second half of an NBA basketball game Wednesday, Nov. 5, 2014, in Salt Lake City. (AP Photo/Rick Bowmer). Cleveland Cavaliers' LeBron James (23) looks at the scoreboard in the second quarter during an NBA basketball game against the Utah Jazz, Wednesday, Nov. 5, 2014, in Salt Lake City. (AP Photo/Don Ryan). Cleveland Cavaliers forward LeBron James watches from the bench during the second half of the Cavaliers' NBA basketball game against the Portland Trail Blazers in Portland, Ore., Tuesday, Nov. 4, 2014. (AP Photo/Don Ryan). Cleveland Cavaliers guard Kyrie Irving, left, drives past Portland Trail Blazers center Robin Lopez during the first half of an NBA basketball game in Portland, Ore., Tuesday, Nov. 4, 2014. By PAUL NEWBERRY AP National Writer LeBron James is right. Everyone needs to RELAX. The Cleveland Cavaliers are going to be just fine. But it's going to take time. <mark>James</mark> and his latest version of the Big Three are still a work in progress, which was evident as they lost three of their first four games. Not surprisingly for a team that's already been anointed as the next NBA champion, the slow start sparked an immediate stream of conjecture over just what's wrong with the Cavs. The diagnosis ranged from <mark>James</mark> playing too passively as he adjusts to a new set of teammates (guilty as charged) to the <mark>King</mark> not getting along with point guard Kyrie Irving (a run-of-the-mill disagreement has surely been blown waaaaay out of proportion). <mark>James</mark> took to Twitter, hitting the all-caps button for emphasis. He, better than anyone, knows it's far too early to hit the panic button. Let's not forget: When <mark>James</mark> and <mark>Chris Bosh</mark> signed with Miami in 2010, joining Dwyane Wade to turn the Heat into a supposedly unbeatable juggernaut, that version of the Big Three lost eight of its first 17 games together. <mark>James</mark>, Irving and <mark>Kevin Love</mark> will likely take even longer to mesh. \"It's a message for everyone to understand how important the process is,\" <mark>James</mark> said, when asked about his tweet during Friday's shootaround in Denver. \"Everyone wants overnight success. It just doesn't happen when teams first come together .\" The most pressing issue for the Cavs was tightening up when they don't have the ball. Heading into Friday night's game at Denver, they had surrendered 101.5 points a game (23rd overall), not exactly the sort of defense expected from a championship-level team. Only two teams were allowing opponents to make a higher share of their shots than Cleveland, which was giving up a whopping 49.5 field-goal percentage. The Knicks made nearly 54 percent in their opening-night win at Cleveland; they were shooting less than 42 percent against everyone else. Utah knocked down more than half its shots (39 of 77) while beating the Cavaliers on Wednesday night, the first time the Jazz had eclipsed 50 percent in a game this season. The Portland Trailblazers shot significantly better while beating LeBron & Co. (49.3 percent) than they had against their other opponents (a cumulative 44.2 percent). <mark>James</mark> has long been one of the league's top defenders, but he must get some help from <mark>Love</mark> and Irving. If not, the Cavs are unlikely to get out of the Eastern Conference, much less win long-suffering Cleveland's first championship - in any sport - since the 1960s. Not to get too far ahead of ourselves, but the Cavaliers may have to go through a postseason disappointment or two before they finally win it all. That's usually the way it's done. Detroit had to get over a pair of excruciating defeats to Larry Bird and the Boston Celtics before the Bad Boys finally broke through to win the first of two straight titles in 1989. During both of those title runs, the Pistons knocked off <mark>Michael Jordan</mark> and the Chicago Bulls in the Eastern Conference finals. MJ, of course, used the motivation from those defeats to win a half-dozen championships. Even the Heat lost in their first trip to the finals with a Big Three, beaten by the Dallas Mavericks in 2011. <mark>James</mark>, Wade and <mark>Bosh</mark> closed out their four years together with a crushing loss to San Antonio in last season's championship round. Now, <mark>James</mark> is teamed with <mark>Love</mark> and Irving, who are undoubtedly two of the league's best players but don't have the same life experiences - not yet anyway - as the last Big Three. Wade already had a championship on his resume before he played a minute with <mark>King James</mark>. <mark>Bosh</mark> had appeared in a couple of playoff series for Toronto before he signed with the Heat. <mark>Love</mark> and Irving have never been to the playoffs. Never even played for a winning team. Irving spent his first three years as the top player on Cleveland squads that were a combined 74 games under .500. <mark>Love</mark> endured even more frustration during six seasons in Minnesota, essentially a one-man team as the Timberwolves struggled through 160 more losses than wins. Both are used to putting up gaudy numbers, with little feedback or criticism for the flaws in their games. Now they're playing with <mark>King James</mark>, who is the undisputed star. <mark>Love</mark> and Irving are the supporting players, and how quickly they adapt to less-glamorous duties - playing tough defense, pounding the boards, doling out assists - will go a long way toward determining how long it takes the Cavaliers to win a championship. Consider Wade and <mark>Bosh</mark>, whose strong play in the early going this season shows just how much of an ancillary role they played while LeBron was around. Irving, for instance, can't go through a stretch where he's taken 36 shots since his last assist (as was the case before Friday's game against the Nuggets). \"This team can be as good as it wants to be,\" <mark>James</mark> said. \"But we can't short-cut the process along the way .\" Maybe he should've added another word to his \"RELAX\" tweet. Patience. ___ Paul Newberry is a national writer for The Associated Press. Write to him at pnewberry @ ap.org or www.twitter.com/pnewberry1963 555 Broadcast Dr, Mobile AL 36606 Telephone:"}, {"articleID": "2017082108_00604303_W", "names": {"Jerry Lewis": ["Q294927", "Q472199", "Q6183975"]}, "date": "2017-08-21", "url": "http://in.reuters.com/article/britain-internet-hatecrime-idINKCN1B10QH?il=0", "content": "Britain to treat internet hate crime as seriously as offline offences Reuters TV Discover Thomson Reuters Trump eyes Afghanistan's elusive mineral riches <mark>Jerry Lewis</mark>: 1926-2017 Reuters TV United States August 21, 2017 / 8:21 AM / a few seconds ago Britain to treat internet hate crime as seriously as offline offences Reuters Staff 1 Min Read A man holds a laptop computer as cyber code is projected on him in this illustration picture taken on May 13, 2017. Kacper Pempel/Illustration/Files LONDON (Reuters) - Online abuse will be treated as seriously as offline offences, Britain's prosecution service said on Monday in new guidance on handling hate crimes. The rules - which included guidelines on helping disabled and bisexual victims - were meant to encourage more people to come forward and press courts to impose longer sentences, the Crown Prosecution Service said. \"This is a crime that's under-reported. Sometimes people feel that they just have to put up with it...That's absolutely not the case,\" Alison Saunders, the director of public prosecutions, told the BBC. The new advice was in response to the growth of social media, the CPS said. There have been several high-profile instances of successful prosecutions of people who had abused lawmakers and other public figures online. Reporting by Alistair Smout; Editing by Andrew Heavens 0: 0"}, {"articleID": "2014040104_00009579_W", "names": {"Alan Murray": ["Q3242508", "Q4707398", "Q58854651"], "Henry Ford": ["Q19865736", "Q52439758", "Q5721389"]}, "date": "2014-03-31", "url": "http://www.npr.org/2014/03/31/297261905/greyhound-racing-may-be-headed-for-the-finish-line?ft=1&f=2", "content": "hide caption Greyhound racing has been on a downward trend for decades. Greyhound racing has been on a downward trend for decades. On a weekday afternoon at the Mardi Gras Casino near Fort Lauderdale, Fla., most guests are inside at the relatively new card tables and slot machines. Outside, at the 5 p.m. post time, only about a dozen people are in the grandstand. This is what they're waiting for: The handlers lead out the greyhounds. The dogs are loaded into their starting boxes. Then eight greyhounds run in the first of 18 races. hide caption Concerned over animal treatment, the Humane Society of the United States and others support a Florida bill that would reduce the number of tracks racing greyhounds. Others say abuse is rare, and even hurts the owners' chances of winning a race. Concerned over animal treatment, the Humane Society of the United States and others support a Florida bill that would reduce the number of tracks racing greyhounds. Others say abuse is rare, and even hurts the owners' chances of winning a race. Greyhound racing, a sport in decline, is still hanging on, mostly in Florida. But a bill gathering steam in the Legislature may hasten its demise. Sponsored by Democratic state Sen. Maria Sachs, the bill has been gaining momentum, in part, because of support by groups such as the Humane Society of the United States, who are concerned about how greyhounds are treated. Between last May and February, 95 greyhounds died at tracks in Florida as a result of illness or injuries. \"The attendance has gone down,\" Sachs says of the sport. \"The treatment of the dogs, of course, has gone down as well because they're not making any money anymore .\" For most of the 80 years it's been in existence, the Mardi Gras Casino was known as the Hollywood Kennel Club, later as the Hollywood Greyhound Track. As a sport, greyhound racing's best days were probably 50 years ago, when, in most areas, horse and dog tracks were the only legal gambling outside of Las Vegas. In recent decades, many tracks have closed as states have banned greyhound racing over concerns about treatment of the dogs. Today, 13 of the remaining 24 tracks are located in Florida. Sachs' bill may soon reduce that number. For several years now, Florida has allowed most of the dog tracks to also run poker rooms. A few, like the Mardi Gras Casino and other tracks near Miami, also have slot machines. Sachs' bill would allow them to keep the slots and the card games even if they eliminate greyhounds. She says it just recognizes a fact that greyhound racing is a dying industry. \"I'd like to see the state of Florida come into the 21st century,\" Sachs says. There's not much dispute about the economic facts. In Florida, the amount bet on dog races is a third of what it was just a decade ago. Only a few tracks still make money on greyhounds, according to a consultant's report to the Legislature. For the rest, the dogs are a loss leader that allows them to continue operating their profitable card rooms and slot machines. At the Mardi Gras track, the first race has just run. Trainer <mark>Alan Murray</mark> is walking one of the racers. He's a brindled black and tan greyhound named Musical Chairs who is still panting from the race. \"He did well,\" <mark>Murray</mark> says. \"He ran third .\" That means he made money for his owners. <mark>Murray</mark> has a law license and an economics degree. He and his wife, a veterinary assistant, raise greyhounds. Like most in the industry, he angrily rejects charges that his dogs aren't treated well. Yes, as in any industry, there are bad apples, he says. But even with declining purses, <mark>Murray</mark> says there's no incentive for owners and trainers to cut corners when it comes to taking care of their greyhounds. \"If you're cutting corners, you're not making money,\" <mark>Murray</mark> says. \"You don't get paid unless your dog runs fourth or better. If you cut corners, then that guy next to you is going to whip your butt .\" Jack Cory, a lobbyist for the Florida Greyhound Association, believes the real issue is that some greyhound tracks want to become casinos. \"They think if they do away with live racing, then the Legislature will chip away and give them slot machines this year, table games next year,\" Cory says. \"And you will have 13 casinos operating in the state of Florida .\" At the Palm Beach Kennel Club, Vice President Joe Rooney says concerns that the bill may kill dog racing aren't warranted. Some tracks will close, he says, but his is one of three or four that will keep racing. \"I think actually you would just end up with better dogs, better kennels, better operators,\" Rooney says. \"We would still have plenty of dogs to meet our requirements .\" However, Rooney concedes that the days of greyhound racing appear to be numbered. In Florida, the Legislature is considering an overhaul of the state's gaming code, one that may open the way for big resort casinos in South Florida. Sports Freshmen Wildcats Step Easily Into Storied Tradition Hobie Alter, The <mark>Henry Ford</mark> Of Surboards, Dies At 80 Sports Greyhound Racing May Be Headed For The Finish Line Sign In / Register Please keep your community civil. All comments must follow the"}, {"articleID": "2010013005_00079388_W", "names": {"Jim Templeton": ["Q19519864", "Q7381718"]}, "date": "2010-01-30", "url": "http://timesfreepress.com/news/2010/jan/30/cold-weather-leads-potholes/", "content": "blame the bumpy commute to work on the freezing temperatures. areas that are always a little rough usually get worse when water seeps into cracks, freezes, then expands, highway officials say. \"during the cold winter months, keeping our interstates and state routes smooth is challenging,\" said tennessee department of transportation spokeswoman jennifer flynn. a handful of roads are suffering throughout the region. in addition to all the chilly weather lately, there has been a large amount of rain. a section of interstate 24 over missionary ridge in chattanooga is patched every spring. gaping potholes there are caused by the freezing and thawing conditions mixed with the thousands of vehicles that pass over it every day, ms. flynn said. georgia highway 337, south of menlo in chattooga county, washed out several weeks ago, officials said, and has yet to be repaired. georgia highway officials say that, on top of the freezing-thawing action, the chemicals used to keep roads ice-free also contribute to holes and wear-and-tear. \"the weather really does its trick on the roads, but so do the de-icing chemicals,\" said dr. mohamed arafa, a georgia department of transportation spokesman. highway crews usually use a mix of salt and small rocks to keep the roads clear, dr. arafa said. but when temperatures dip below 25 degrees, gdot adds calcium chloride, which can cause corrosion. chattanooga city workers also are battling the potholes across the city, said director of citywide services <mark>jim templeton</mark>. \"we're seeing the problem in areas all across the city,\" mr. <mark>templeton</mark> said. on top of that, it's harder to fix roads in the cold weather. the asphalt mixture works best in warm weather and cannot be applied at all in temperatures under 51 degrees, mr. <mark>templeton</mark> said."}, {"articleID": "2018053121_00224731_W", "names": {"Paul Goldschmidt": ["Q2792929", "Q3067488"]}, "date": "2018-05-31", "url": "https://www.mysanantonio.com/news/texas/article/Former-pitcher-Joe-Sambito-sues-agency-he-worked-12958286.php", "content": "Text \"NEWS' to 77453 for Alerts Father left with questions after son accused of shooting officer Workers sue Valero for gross negligence Driver pleads in fatal church bus crash https: //www.mysanantonio.com/news/texas/article/Former-pitcher-Joe-Sambito-sues-agency-he-worked-12958286.php Former pitcher Joe Sambito sues agency he worked for Updated 4:08 pm, Thursday, May 31, 2018 Photo: <mark>Paul</mark> Benoit, AP Image 1 of / 1 Caption Close Image 1 of 1 FILE - In this Tuesday, Oct. 21, 1986 file photo, dejected Boston Red Sox relief pitcher Joe Sambito holds a towel to his face as he sits in the dugout in the eighth inning after being pulled out of third game of the World Series against the New York Mets at Fenway Park in Boston, Mass.. Former major league pitcher Joe Sambito has sued Independent Sports & Entertainment, the company that employed him as an agent, claiming wrongful termination and age discrimination. Sambito filed the suit Wednesday, May 30, 2018 in California Superior Court in Orange County. less FILE - In this Tuesday, Oct. 21, 1986 file photo, dejected Boston Red Sox relief pitcher Joe Sambito holds a towel to his face as he sits in the dugout in the eighth inning after being pulled out of third game...more Photo: <mark>Paul</mark> Benoit, AP Former pitcher Joe Sambito sues agency he worked for 1 / 1 Back to Gallery SANTA ANA, Calif. (AP)--Former major league pitcher Joe Sambito has sued the company that employed him as an agent, claiming wrongful termination and age discrimination. Sambito filed the suit Wednesday in California Superior Court in Orange County against Independent Sports & Entertainment, ISE Baseball and ISE Chairman Ron Burkle along with a pair of predecessor companies. Sambito, who turns 66 next month, represented Arizona's <mark>Paul Goldschmidt</mark> before the first baseman left ISE for Excel Sports Management. Sambito alleges he was fired effective Feb. 1 and asks to be awarded $2 million. Among his other claims are fraud, unjust enrichment, breach of fiduciary duty, breach of contract and unlawful business practices. Local Channel Now Playing: Now Playing S.A. contractor accused of scamming elderly residents arrested San Antonio Express-News Off-duty police officer gunned down at strip club San Antonio Express-News Swerving driver causes head-on collision San Antonio Express-News 1 hospitalized after shooting near S.A. tourist hub San Antonio Express-News SWAT talks down man threatening to kill self after breakup San Antonio Express-News Strip club security guard shoots man Sunday morning on N.E. Side 21 Pro Video Power line crashes onto home, sparking fire San Antonio Express-News Motorcyclist hospitalized after smashing into SUV San Antonio Express-News Police find stabbing victim in Terrell Hills San Antonio Express-News Fatal pedestrian crash on San Pedro Jacob Beltran\" This lawsuit contains self-serving and meritless allegations, and Independent Sports & Entertainment will vigorously defend itself against this groundless suit, \"the company said in a statement. Sambito was 37-38 with a 3.03 ERA for Houston (1976-82,' 84), the New York Mets (1985) and Boston (1986-87). ___ More AP baseball: https: //apnews.com/tag/MLBbaseball Sign up for instant alerts from MySA by texting NEWS to 77453. Most Popular 1 Blue water temporarily invades Galveston Island beaches 2 SAPD: Man sexually assaulted 7-year-old boy in Santikos bathroom 3 Two more Schlitterbahn employees charged in decapitation death of 10-year-old boy at Kansas park 4 SAPD academy instructor allegedly shot by barber in NW Side parking lot identified 5 Father left with questions after son accused of shooting off-duty police officer in San Antonio 6 UTSA-area barber accused of shooting SAPD officer during road rage altercation at NW Side strip club 7 Boerne middle school locked down after ammunition found in hallway 8 How does Lakewood Church spend its millions? Here's a look at the budget 9 Teen set to receive $8M from parents arrested in dad's death 10 Lawyer attacks witness for role in burying S.A. man 11 San Antonio contractor accused of scamming elderly residents arrested 12 Gunman at large after opening fire during party on NE Side, injuring 1 13 Lower lanes of I-35 reopen after 18-wheeler crash near downtown 14 A son helped plan a\" fake robbery' of his father's guns, police say. He and his parents ended up dead. 15 Hardbodies dispels closure rumors, changes iconic name View Comments © 2018 Hearst Communications, Inc. ."}, {"articleID": "2013112915_00021825_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"], "James Arthur": ["Q1679964", "Q16958479", "Q19324892", "Q56884626", "Q717626"]}, "date": "2013-11-29", "url": "http://www.onenewspage.com/n/Celebrities/74w4fgdcq/Salman-Khan-and-Shahid-Kapoor-talk-about-their.htm", "content": "<mark>Salman Khan</mark> and Shahid Kapoor talk about their ex-girlfriends! Friday, 29 November 2013 (1 hour ago) <mark>Salman Khan</mark>, who at one stage used to date Katrina Kaif has once again spoken about her, \"Katrina and I are friends, were friends and will always be friends .\" Like [...] Shahid Kapoor: Priyanka Chopra and I will always be friends! Katrina Kaif, Kareena Kapoor Khan move on as Hrithik Roshan takes a break from films <mark>Salman Khan</mark> will talk about his personal life on \"Koffee With Karan'! After dating a Bollywood beauties like Aishwarya Rai, Katrina Kaif, Sangeeta Bijlani and Somi Ali, the Dabangg of Bollywood, <mark>Salman Khan</mark> is in search for a.. . Bollywood Celebden 3 days ago - Celebrities A Look Back at The Macy's THANKSGIVING Day Parades of Years Past\" NYC Housewife' Sonja Morgan Shares Her Last-Minute THANKSGIVING DAY This Disgusting MILEY CYRUS Turkey GIF Is Our Way of Saying \"Happy Thanksgiving!' HAPPY THANKSGIVING Weekend! Here's What Is New on Netflix Now Miley Cyrus beating EDWARD SNOWDEN, Pope in Time's Person of the Year poll The INTERNET doesn't want <mark>James Arthur</mark> anymore, Facebook group confirms it GALLERY: UNION J's JJ Hamblett and girlfriend Caterina Lopez's cutest pictures TAMERA FOSTER opens up about\" close' relationship with X Factor reject Sam Callahan. Now kiss! KISS. Ashish Rajvanshi Who is the best dancer in bollywood. .? 1. Hrithik Roshan 2. Shahid Kapoor 3. <mark>Salman Khan</mark> 4. Prabhudeva 5...http: //t.co/b45Rd2XouW @ stuntraviverma making it big in Bollywood with <mark>Salman Khan</mark>, Shah Rukh Khan & Shahid Kapoor projects. Best...http: //t.co/Vsgq1xcqSr Apni Aliya In love with Ranbir Kapoor's smile, Shahrukh Khan's dialogues, <mark>Salman Khan</mark>'s body, Shahid Kapoor's innocence, and your love Ashish Rajvanshi Who is the best dancer in bollywood. .? 1. Hrithik Roshan 2. Shahid Kapoor 3. <mark>Salman Khan</mark> 4. Prabhudeva 5...http: //t.co/kDSuPkZApN @ BeingSandesh_D nice to meet you sandesh!! see you're very fond of <mark>Salman Khan</mark>! I also love Shahid Kapoor Italian former prime minister Silvio Berlusconi expelled from parliament In defiance of a new Chinese air zone, US flies two B-52 bombers through it Discovery of ancient Buddhist shrine suggests earlier date for Buddha's birthday Xbox One sales surpass 1 million - but users report hardware problems China extends air defense zone over East China Sea covering islands also claimed by Japan"}]