[{"date": "2015-10-21", "url": "http://www.prnewswire.com/news-releases/schlafender-hase-inc-expands-its-presence-in-the-americas-300163292.html", "content": "Schlafender Hase Inc. expands its presence in the Americas The global leader in computer-drive proofreading Facebook Twitter Pinterest & times; The global leader in computer-drive proofreading Schlafender Hase GmbH, the maker of the Text Verification Tool & reg; (TVT) and the global leader in text verification for regulated environments, are expanding their presence in the Americas by offering more local services such as software installation, validation, training & support by adding new leadership & talent to their growing team. CAMBRIDGE, Mass., Oct. 21, 2015 / PRNewswire /--Schlafender Hase GmbH, the maker of the Text Verification Tool & reg; (TVT) and the global leader in text verification for regulated environments opened Schlafender Hase Inc. in North America just over a year ago. \"We have been very successful over the last year, and due to customer demand we've decided to offer more local services in the Americas,\" said Frank Hessler, CEO and President of Schlafender Hase. Additional local services now include software installation, validation, on-site training and support. Schlafender Hase Inc. has expanded its team to assist with this expansion. Heading up the Americas team as Managing Director, is <mark>Peter Muller</mark>. <mark>Peter</mark> is an industry veteran who is an expert on Proofreading technologies and how to apply software tools to solve Regulatory Affairs and Packaging challenges. \"TVT is the de facto global standard for text verification. Not only is it used by every major pharmaceutical and medical device company, it is used by Regulatory Authorities such as the EMA, BfArM and MHRA to ensure the accuracy and compliance of product packaging submissions,\" said <mark>Peter Muller</mark>. \"I am thrilled to be working with Schlafender Hase. We know we have the best product on the market but our challenge is to inform clients that they have a choice of local suppliers in the Americas .\" Schlafender Hase Inc. will be exhibiting at this year's RAPS Regulatory Convergence in Baltimore on October 24 th--28 th. The new team will be present and looking forward to meeting with customers. To learn more go to https: //www.schlafenderhase.com or contact the North American office at +1 617 607-4900 About Schlafender Hase: Schlafender Hase is the global leader in computer-driven proofreading. Our Text Verification Tool & reg; (TVT) is the international benchmark for accurate and user friendly text and graphic verification. TVT is currently used by the world's leading pharmaceutical and medical device companies as well as numerous regulatory bodies to ensure compliant, error-free and consistent packaging. TVT allows users to compare text and graphics with one solution. It is ISO 9001:2008 certified, 21 CFR Part 11 and Annex 11 compliant. Contact: Kindrie Eaton, 617-607-4900, marketing @ sh-p.com Logo - http: //photos.prnewswire.com/prnh/20151020/278782LOGO SOURCE Schlafender Hase RELATED LINKS http: //www.schlafenderhase.com My News Release contains wide tables. View fullscreen. See more news releases in Computer Electronics Computer Software Biotechnology Health Care & Hospitals Medical Equipment Medical Pharmaceuticals Corporate Expansion Personnel Announcements Trade Show News Journalists and Bloggers Visit PR Newswire for Journalists, our free resources for releases, photos and customized feeds. You can also send a free ProfNet request for experts. Custom Packages Browse our custom packages or build your own to meet your unique communications needs. Start today. PR Newswire Membership Fill out a PR Newswire membership form or contact us at (888) 776-0942. Learn about PR Newswire services Request more information about PR Newswire products and services or call us at (888) 776-0942. Site Preview Close Site Preview View Fullscreen", "articleID": "2015102115_00076180_W", "names": {"Peter Muller": ["Q1213408", "Q39071383", "Q7175983"]}}, {"date": "2015-10-22", "url": "http://fox8live.com/story/30329366/judge-orders-the-docks-prisoner-transport-facility-to-be-reopened", "content": "Judge orders \"the docks' prisoner transport facility to be reope - FOX 8 WVUE New Orleans News, Weather, Sports, Social Judge orders\" the docks' prisoner transport facility to be reope - FOX 8 WVUE New Orleans News, Weather, Sports, Social Member Center: Judge orders \"the docks' prisoner transport facility to be reopened Posted: Sources say securing the docks will require between 11 and 16 deputies. (FOX 8 Photo) NEW ORLEANS (WVUE) - It's been a month since the sheriff closed down a prisoner handling facility called\" the docks, \"prompting security concerns at Orleans Criminal Court. Now, a federal judge has ordered that the facility be reopened. Ever since the old parish prison closed, more than 200 inmates a day have brought to court by bus and offloaded in the sallyport. They are then escorted behind a makeshift fence into the old coroner's office, then transferred through a court hallway and a courtroom in session. And they are closely guarded by sheriff's deputies known at court as\" the men in black. \"\"Judges have told us they are concerned about security,\" said Simone Levine, with Court Watch Nola. Now, a federal judge has stepped in to say that the old docks facility in the rear of old parish prison must be reopened next week, in spite of staffing concerns expressed by the Sheriff's Office. \"The judge has ordered that the city pay for the manpower we need in order to safely transport inmates through the old parish prison building and into court,\" said counsel for the Sheriff's Office <mark>James Williams</mark>. \"At the end of the day, the city pays for everything. It's a matter of doing it the right way,\" Mayor Mitch Landrieu said. Sources say securing the docks will require between 11 and 16 deputies. But they say it's a much safer arrangement that won't inconvenience at least one judge whose court has been used as a prisoner walkway. The reopening of the docks is not considered to be the long-term solution, and the city is being required to explore other options. \"The sheriff doesn't have the responsibility to build a replacement. The city has the responsibility to build that,\" <mark>Williams</mark> said. \"We're not sure yet. We're not finished our negotiations,\" Landrieu said. After testimony from New Orleans Police Chief <mark>Michael Harrison</mark> on Thursday, one issue that appears to be off the table is using New Orleans police officers to transfer inmates. \"Superintendent <mark>Harrison</mark> testified about his concerns of doing that,\" <mark>Williams</mark> said. But all sides are confident that a safer prisoner transport system will be in place next week. Landrieu questions how the construction of a new jail did not include a new facility to get inmates into and out of court. He says all of these issues are part of ongoing negotiations. Copyright 2015. WVUE all rights reserved.", "articleID": "2015102221_00121080_W", "names": {"James Williams": ["Q12072953", "Q14951488", "Q18159187", "Q20738248", "Q22136730", "Q27983585", "Q47542009", "Q54556506", "Q6145626", "Q6145628", "Q6145639", "Q6145641", "Q6145646"], "Michael Harrison": ["Q17414590", "Q27926873", "Q29642898", "Q6830975", "Q6830976", "Q6830977"]}}, {"date": "2015-10-26", "url": "http://www.eurosport.com/rugby/world-cup/2015/welshman-owens-to-referee-world-cup-final_sto4966921/story.shtml", "content": "Welshman Nigel Owens to referee World Cup final By Reuters Last update 25 minutes ago - Published on 26/10/2015 at 15:58 By Reuters - 25 minutes ago Welshman Nigel Owens has been officially named as the referee for Saturday's Rugby World Cup final between Australia and New Zealand at Twickenham. The 44-year-old had been widely tipped for the role following his impressive displays throughout the tournament, with New Zealand legend Grant Fox actually breaking the news on Sunday - albeit unofficially. Owens, who was named \"Gay sports personality of the year\" in 2007 shortly after coming out, has won admirers on and off the pitch for his light touch and humour, as well as his rapport with the players. \"This is a huge honour and a privilege for me,\" Owens said on Monday ahead of what will be his 68th test. \"I am humbled to have been chosen. This is my third World Cup and I think it has been the best. It has been inspirational. The quality of rugby on display has been incredible in front of packed venues and so to be given the opportunity to referee the final match between the best two teams in the tournament is an amazing honour .\" I would like to thank World Rugby and the Welsh Rugby Union for their support over many years. There have been so many individual people throughout my career who have helped and supported me along the way and while I can't name everyone here, I will be thanking everyone personally in due course. \"I want to thank my friends and family for their ongoing support and for helping me through some rough times in my life .\" My dad, in particular, is always there for me and is delighted with this news--it's just a shame my mother is not here to see this as she was a pillar of strength for me. She passed away six years ago and I know she would have been very proud. \"Jerome Garces of France and England's Wayne Barnes will be the touch judges with Shaun Veldsman of South Africa taking the role of television match official. The referee for Friday's third place playoff between South Africa and Argentina at the Olympic Stadium will be <mark>John Lacey</mark> of Ireland. Share", "articleID": "2015102615_00153212_W", "names": {"John Lacey": ["Q16214484", "Q16237846", "Q21518264"]}}, {"date": "2015-10-26", "url": "http://globegazette.com/news/opinion/columns/doyle-mcmanus-ryan-s-fight-for-the-gop-s-soul/article_b2e002cc-ece3-5895-8365-7fb74c6143ee.html", "content": "Doyle McManus: Ryan's fight for the GOP's soul (TNS) | For apple lovers, this is the best time of the year. The markets are full of what seems to be an unending variety of apples, from Pink...Recent CEDAR FALLS | For the first time in weeks the University of Northern Iowa football team earned that extra inch, earned that extra yard in its...Recent PHILADELPHIA (AP)--The Liberty Medal has been presented to representatives of the Dalai Lama in recognition of his efforts to promote compass...Recent Doyle McManus: Ryan's fight for the GOP's soul Saved 2015-10-26T20:45:00 ZDoyle McManus: Ryan's fight for the GOP's soulMason City Globe Gazette46 seconds ago Enlarge Photo Less than a year ago, after Republicans rolled up big majorities in the 2014 congressional elections, their leaders set out to show the nation that conservatives were up to the challenge of governing. \"The logjam in Washington has been broken,\" declared House Speaker John A. Boehner, R-Ohio, and Senate Majority Leader Mitch McConnell, R-Kentucky. \"We will make it our job to prove the skeptics wrong .\" So far, alas, the skeptics have been right. The GOP's big majority in the House became a curse, not a blessing; little of the legislation that Boehner and McConnell sought has passed. Instead, the GOP's zealously conservative Freedom Caucus pushed Boehner out of office and blocked the rise of his chosen successor, Rep. <mark>Kevin McCarthy</mark> of California. \"We are not solving the country's problems; we are only adding to them,\" Rep. Paul D. Ryan, R-Wisconsin, acknowledged last week as he announced his decision to seek the speaker's chair. By all accounts, Ryan is likely to win the job easily. Last week, he won support from all three wings of the House's factionalized Republicans. That will give him a chance to start over. \"We can show the country what a common-sense conservative agenda looks like,\" he told his colleagues. Still, Ryan faces the same challenge that brought down Boehner and <mark>McCarthy</mark>: the Freedom Caucus, which not only spurns bipartisan compromises but has made its first goal to purge the GOP of its moderates. And amazingly, some Freedom Caucus members consider Ryan, a thoroughgoing conservative by any traditional definition, to be dangerously moderate. Ultras in the Freedom Caucus distrust Ryan because, as chairman of the House's tax-writing committee, he made a bipartisan budget deal to keep the government running in 2013. (Any deal had to be bipartisan because the Democrats had a majority in the Senate that year .) Others worry because he long supported bipartisan efforts for comprehensive immigration reform, even though he's abandoned that goal in the face of grassroots opposition. One even derided Ryan for wanting to preserve time to spend with his young family. \"It's like interviewing a maid for a job and she says,' I don't clean windows,'\" Rep. Matt Salmon, R-Arizona, told the Hill. Remarkably, Ryan met these truculent revolutionaries halfway, even though he was already the choice of most House Republicans. The Freedom Caucus demanded changes in House rules to reduce the speaker's power; Ryan agreed that the GOP conference should consider the idea. The caucus asked him to promise that he would never allow a floor vote on any measure unless a majority of Republicans supported it (the \"Hastert Rule\" ); Ryan agreed. And the Freedom Caucus rejected Ryan's proposal to change a rule that allows a single member to call for a vote to remove the speaker, a weapon it used against Boehner. Ryan agreed to postpone the issue. It was a remarkable process. The Freedom Caucus, with less than one-fifth of GOP members in its ranks, won concessions from a man most other Republicans considered their only viable candidate for the job. Still, beneath his show of flexibility, Ryan appeared to be pursuing a pragmatic strategy of divide and conquer, a course that might enable him to defuse the Freedom Caucus as a constantly ticking time bomb. Ryan has the suppor t of about two-thirds of the Freedom Caucus' members, a break from the group's customary unity. Until now, the group has maintained its influence by wielding an undivided bloc of about 40 votes, just enough to deprive Boehner or any other speaker of his working majority. But as my colleague Lisa Mascaro pointed out in The Los Angeles Times last week, that unity is showing signs of fraying. At least two members recently quit the caucus. If Ryan can co-opt half or more of the Freedom Caucus' members, the group's leverage will erode. A divided caucus won't be able to take Speaker Ryan hostage the way it tormented Boehner and <mark>McCarthy</mark>. But making that strategy work won't be easy. Ryan's House faces a series of daunting tests, the same tough fiscal issues that divided Republicans under Boehner. Congress must raise the federal debt limit by Nov. 3; Boehner may stay in office just long enough to engineer a bipartisan vote with Democratic support, relieving Ryan of a headache. But soon after that, Congress must pass a funding bill to keep the government running after Dec. 11. And then Congress turns to the budget, in search of a two-year deal that would last past the 2016 presidential election. All three measures will almost certainly need President Obama's signature to pass, which means GOP leaders will need to compromise somewhere. \"Whatever our differences, we're all conservatives,\" Ryan told House Republicans last week. His election as speaker may give his party a moment of unity, but it will also open a new phase in the unfinished battle over the GOP's soul. The members of the Freedom Caucus haven't promised him a honeymoon; only a truce. Doyle McManus is a columnist for the Los Angeles Times. Readers may send him email at doyle.mcmanus @ latimes.com. Copyright 2015 Mason City Globe Gazette. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2015102701_00065274_W", "names": {"Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"]}}, {"date": "2015-10-27", "url": "http://www.newindianexpress.com/nation/Eying-Assembly-Polls-Maneka-Kin-V-M-Singh-Announces-New-Party/2015/10/27/article3100224.ece", "content": "Email 1 LUCKNOW: Eying the 2017 Uttar Pradesh assembly polls, farmer leader V <mark>M Singh</mark> today announced that he would launch a new party on December 23, the 113th birth anniversary of former prime minister Chaudhary Charan <mark>Singh</mark>. \"The new organization has nothing to do with votes. It is for empowering farmers, who have been going through difficult times,\" he told PTI. <mark>Singh</mark>, a former MLA who has unsuccessfully contested Lok Sabha elections on several occasions, hoped that the new outfit named Kisan party will help farmers rise above caste and religion barriers. \"It will be a farmer-oriented party. It will not only help farmers but also farm labourers improve their condition .\" In an agrarian society where 70 per cent of people are from rural background, there is not a single party which is working for the upliftment of farmers. It will be the only party in which farmers will be supreme, \"he said. <mark>Singh</mark> said the farmers' plight prompted him to return to active politics .\" While SP supremo Mulayam <mark>Singh</mark> claims himself to be the dharti putra (son of the soil) and RLD chief <mark>Ajit Singh</mark> says he represents the legacy of Charan <mark>Singh</mark>, the farmers' plight is becoming bad to worse and they are committing suicide at the drop of a hat, \"he said. Asked about BJP MP Maneka Gandhi, who is related to him, <mark>Singh</mark> said,\" There can be no similarity between us. She protects animals while I hope to empower farmers. \"", "articleID": "2015102713_00035342_W", "names": {"Ajit Singh": ["Q1172625", "Q44751749", "Q4699804", "Q4699805", "Q57905434", "Q57986365", "Q58429220"], "M Singh": ["Q57321613", "Q57413863"]}}, {"date": "2015-10-29", "url": "http://dispatch.com/content/stories/sports/2015/10/29/dunlaps-maturation-helps-him-become-more-complete-player.html", "content": "CINCINNATI--The location of Carlos Dunlap's locker, next to a door leading to a hallway and nearby exit at <mark>Paul Brown</mark> Stadium, always has allowed the Bengals defensive end to be a wisp of smoke. Dunlap, a personable giant of a man at 6 feet 6 and 280 pounds, usually offers a few soft-spoken words to reporters gathered around him and then suddenly, poof, he's gone. So it seemed odd when Dunlap stood with media members for 20 minutes on Wednesday and discussed how his 6.5 sacks--tied for the NFL lead--have contributed to Cincinnati's first 6-0 start since the 1988 Super Bowl season. Dunlap said his improved production in his sixth season is a byproduct of the entire defense's play, but a veteran teammate noted a personal change--evident by ease with the media--as being at the root of success. \"Carlos is older,\" said defensive end <mark>Michael Johnson</mark>, who returned to Cincinnati as a free agent this season after one year in Tampa Bay. \"With age, you think differently. You understand yourself better, and understand everything that is going on better .\" Bengals quarterback <mark>Andy Dalton</mark>, the NFL's leading passer with a 116.1 rating, is receiving much of the attention as Cincinnati heads into a game at Pittsburgh on Sunday with a chance for the franchise to be 7-0 for the first time. Dunlap, however, is the defensive player at age 26 who exemplifies how the Bengals have grown into a veteran team primed for a franchise-record fifth consecutive playoff spot with a 21/2-game lead over the Steelers (4-3) in the AFC North. \"He does what we want to see much more often,\" Cincinnati coach Marvin Lewis said of Dunlap. \"He's matured as a man and a player. He tries to do things the right way. That's been the key for him .\" The Bengals knew they were acquiring freakish size and athleticism when they drafted Dunlap in the second round in 2010 out of Florida, where he helped the Gators win a second national title under Urban Meyer. Dunlap, who has a 7-foot wingspan and a vertical leap of 35 inches, flashed his raw ability as a rookie with 9.5 sacks. Still, it wasn't until Dunlap matured on and off the field that the Bengals were convinced to give him a five-year contract extension before the 2014 season, worth nearly $40 million with $11.7 million guaranteed. Now, financially secure with five seasons under his belt, Dunlap was able to look back at 2014 and decide that his eight sacks and career-high 66 tackles weren't enough. \"I trimmed down 10 pounds because I wanted to be quicker,\" Dunlap said. \"I felt like last year I was getting a lot of hits and hurries (on quarterbacks), but a lot of my hits and hurries were half a second late. I needed to figure out how to get there half a second quicker .\" Besides changing his diet, Dunlap said he's taking better care of his body with a weekly routine of massages, stretching, chiropractor treatments and weightlifting. \"I do a whole bunch of different things, and I feel it pays off. I feel like that's huge,\" Dunlap said. So, too, has been the return of <mark>Johnson</mark> and defensive tackle Geno Atkins regaining his All-Pro form that he played at before suffering a major knee injury in 2013. \"Having Geno back to playing at the elite level makes it easier on the edge rushers,\" Dunlap said. And Dunlap has helped himself with accrued wisdom. \"When you're a rookie or a young guy, you just study what you're doing so you don't have those mess-ups or mistakes,\" Dunlap said. \"Once you're a veteran, you understand what you're doing and you're able to look and see what (offenses) are trying to do to you. The extension of that is probably one of the bigger things contributing to my success .\" tjones @ dispatch.com @ Todd_Jones NEXT GAME Opponent: at Pittsburgh Steelers When: 1 p.m. Sunday TV: CBS (Ch. 10) Radio: WXZX-FM (105.7)", "articleID": "2015102909_00132696_W", "names": {"Andy Dalton": ["Q129605", "Q2849092"], "Michael Johnson": ["Q16195604", "Q16238908", "Q190924", "Q1928051", "Q20667583", "Q21458865", "Q21484117", "Q29456", "Q29964620", "Q3856198", "Q4896337", "Q496521", "Q54667230", "Q55313528", "Q56853023", "Q57056207", "Q57427460", "Q5889087", "Q6831672", "Q6831675", "Q6831677", "Q6831678", "Q6831679", "Q6831680", "Q6831682", "Q6831683", "Q6831685", "Q6831687", "Q6831690", "Q6831692", "Q898451"], "Paul Brown": ["Q16197784", "Q16212754", "Q18205667", "Q18921483", "Q19396015", "Q21462455", "Q22235645", "Q24033408", "Q29034170", "Q54727692", "Q55079049", "Q5587853", "Q7149543", "Q7149544", "Q7149545", "Q7149546", "Q7149547", "Q7149549"]}}]