[{"articleID": "2017022418_01171951_W", "names": {"Mehdi Hosseini": ["Q21621496", "Q452959"]}, "date": "2017-02-24", "url": "http://www.investors.com/news/technology/oled-tech-firm-universal-display-shines-bright-after-q4-beat/", "content": "Technology OLED Tech Firm Universal Display Hits Record High After Q4 Beat PATRICK SEITZ 10:23 AM ET Reprints Loading the player...Universal Display (OLED) shares jumped to a record high on Friday, a day after the provider of technology and materials for OLED displays and lighting, crushed Wall Street's Q4 targets. The Ewing, N.J.-based company late Thursday said it earned 55 cents a share, up 41% year over year, on sales of $74.6 million, up 20%, in the December quarter. Analysts polled by Thomson Reuters expected Universal Display to earn 42 cents a share on sales of $68.6 million. Universal Display, aka UDC, also announced that it will begin paying a quarterly cash dividend next month, starting at 3 cents a share. UDC stock was up over 19%, near 80.80, in morning trading on the stock market today. It topped its previous all-time high of 74.39, reached Aug. 1. IBD'S TAKE: Universal Display stock has an IBD Composite Rating of 75, meaning it has outperformed 75% of stocks in key metrics over the past 12 months. But it ranks No. 8 out of 40 stocks in IBD's Electronics-Miscellaneous Products industry group. To see which companies lead the group, visit the IBD Stock Checkup. Susquehanna Financial Group analyst <mark>Mehdi Hosseini</mark> reiterated his positive rating on UDC stock and raised his price target to 105 from 100. \"UDC should be viewed as a core holding in a small-cap portfolio, benefiting from multiyear, secular trends in display technology,\" <mark>Hosseini</mark> said in a report. Meanwhile, Needham analyst James Ricchiuti maintained his hold rating on UDC stock, citing a rich valuation. \"We would not chase the stock following what is likely to be a strong open and would look to become more constructive on a pullback,\" he said in a report. Oppenheimer analyst Andrew Uerkwitz concurred, saying UDC stock looks fully valued. He maintained his perform rating on the stock Friday. Canaccord Genuity analyst John Quealy also is cautious on UDC. He reiterated his hold rating, but raised his price target to 65 from 49. \"While we acknowledge the compelling market potential of OLED technology (TVs, mobile phones, VR headsets, etc.) in the near to medium term, monetization pathways for the company need to become further de-risked, in our view, to support a more attractive risk/reward,\" Quealy said in a report. Smartphone makers are beginning to switch to OLED, or organic light-emitting diode, displays from LCD, or liquid-crystal displays, because OLED provides better color reproduction and contrast and uses less power. The displays also are thinner and flexible, allowing for new hardware designs. Apple (AAPL) is rumored to be using OLED displays produced by Samsung in its upcoming iPhone 8 smartphone, which is expected to be released in September. As OLED manufacturing matures, analysts expect TVs and PC displays to shift to OLED from LCD screens as well. Other companies benefiting from the OLED adoption trend include display equipment vendors such as Applied Materials (AMAT) and Coherent (COHR), analysts say. RELATED: Stocks To Buy And Watch: Top IPOs, Big And Small Caps, Growth Stocks PATRICK SEITZ | Facebook | @ IBD_PSeitz Share this: Related news The Nasdaq and other major indexes were keeping their losses small Friday afternoon. (Erik Pendzich/REX/Shutterstock / Newscom) Stock Indexes Down, But Apple, Tesla, Nvidia Stage Bullish Reversals 1:32 PM ET Some leaders were getting hit again Friday, but others were erasing early losses. 1:32 PM ET Some leaders were getting hit again Friday, but others were...Warren Buffett Likely To Discuss Apple, Trump, Airlines In Saturday's Shareholder Letter Dow Threatens To End Win Streak As Apple, Goldman Weigh; Is Nvidia Reversing? OLED Tech Leader Universal Display Beats Q4 Goals, Will Pay Dividend HP Breaks Out On Q1 Beat; Fitbit Up On In-Line Q4 Apple Poised To Unveil New iPads Before Headquarters Opens This Spring 7 Stocks With Accelerating, Triple-Digit Earnings Growth Stocks Rally Broadly; Will These 5 Large Caps Turn Into Big Leaders? Apple, Broadcom Hit Highs As PTs Raised; Freeport, Marriott Downgraded Today's Spotlight MarketSmith Top Stocks 2016 Identify winners in 2017. Use our Top Stock 2016 to see last year's leaders and their winning traits. New York Traders Expo Join IBD for free investing workshops and get product training at our booth (2/26--2/28). Get Leaderboard Find winning stocks faster with Leaderboard. Get our proprietary stock analysis today. More News Google Plays Catch-Up In The Cloud With Amazon And Microsoft Week In Review: Dow Runs On Wal-Mart; Tesla Is On \"Edge'; Facebook? Oh, Snap Go Beyond Buy and Hold: See the advantages of Skoufis Capital Active Strategy over Growth ETF's and Mutual Funds Promoted Content By Skoufis Capital Management Special Report FANG Stocks News & Quotes: Facebook, Amazon, Netflix, Google Get the latest news, stock quotes and analysis of FANG stocks Facebook, Amazon, Netflix and Google-parent Alphabet. TRADING CENTER"}, {"articleID": "2018072100_00177914_W", "names": {"Joe Greene": ["Q505256", "Q6210111", "Q982412"], "Randy White": ["Q1849885", "Q2565823", "Q7292511", "Q7292512", "Q7292513", "Q7292514"]}, "date": "2018-07-20", "url": "http://saukvalley.com/2018/07/20/standard-man-guilty-of-sister-in-laws-death/at9rgsy/", "content": "Dave Cook/Shaw Media Caption Clifford A. Andersen Jr., 68, of Standard is wheeled away by a Putnam County deputy sheriff after a Putnam County jury found him guilty Friday of first-degree murder and the concealment of the homicidal death of Deborah Dewey, 62, of Ladd, in 2016. The jury deliberated most of Friday afternoon before announcing its verdict in the 8-day trial. HENNEPIN--A 68-year-old Standard man is guilty of bludgeoning his 62-year-old sister-in-law to death and burying her in a yard near his home, a Putnam County jury ruled late this afternoon. Clifford A. Andersen Jr., who bashed in 62-year-old Deborah Dewey's head, will be sentenced Aug. 23--the 2-year anniversary of her disappearance--for first-degree murder and concealment of her homicide. He faces a minimum of 20 years and up to life in prison with no possibility of parole. The Ladd woman was reported missing on Aug. 23, 2016; her body was found that Sept. 12 buried in the yard of a vacant home blocks from Andersen's, which he cared for. His DNA was mixed with hers in blood that was found inside the home. \"Justice for Debbie has been a long time coming,\" Dewey's niece, Sue Marshall, said this afternoon. The 2-week trial, presided over by Judge Stephen A. Kouri, featured 55 witnesses and more than 600 exhibits. Andersen, who gambled and had taken out numerous high-interest payday loans, was getting money from Dewey, who finally decided to cut him off. That, the prosecution said, was the motive for the killing. Standard man guilty of sister-in-law's death New law better protects DCFS workers Police reports for Friday, July 20, 2018 Dixon man sought in hit-and-run; two other felony cases pending Andersen admits to affair with murder victim Pro Football Weekly welcomes Brian Urlacher, Mean <mark>Joe Greene</mark>, Lawrence Taylor, Anthony Munoz, <mark>Randy White</mark> and Dan Hampton! get tickets now Tweets from https: //twitter.com/saukvalley/lists/svm-news-sports-staff Do you support or oppose the permanent income tax increase for individuals and corporations that the Illinois Legislature approved over Gov. Rauner's veto? I support it I oppose it Not sure No opinion Vote! Show results"}, {"articleID": "2010031805_00003633_W", "names": {"David Wood": ["Q1631653", "Q18162769", "Q19003417", "Q21453240", "Q27909754", "Q3019012", "Q42610330", "Q5241272", "Q5241273", "Q5241275", "Q5241279", "Q57044545"]}, "date": "2010-03-18", "url": "http://stltoday.com/stltoday/business/stories.nsf/story/E4869C703C55B6AD862576EA0011478C?OpenDocument", "content": "it was just one deer, but people are spooked. in late february, a single whitetail buck in central missouri tested positive for chronic wasting disease, a contagious, fatal brain infection. it was the state's first-ever case, found in one animal among the state's estimated 1.4 million deer. the discovery prompted a swift reaction. state and federal officials, preparing for this moment in missouri for years, quickly quarantined the high-fence shooting ranch in linn county where the sick deer was found. they hoped to quell the outbreak before it spread unchecked in the wild. \"we have to be aggressive,\" state veterinarian taylor woods said. \"this all boils down to credibility.\" outside the fence, worry consumed the people who breed deer and run hunting lodges - part of an estimated $4 billion a year industry in the united states. oklahoma closed its borders to missouri deer. so did illinois. then louisiana and indiana. one by one, states refused entry permits to people seeking to import deer from missouri. all because of one buck. \"it's sickening, the panic. what am i going to do?\" said <mark>david wood</mark>, who has been unable to move any deer from his breeding farm in linn county, mo., since the outbreak. afflicted deer eventually stagger, grind teeth and starve before death. but most of the animals now being discovered with the disease are outwardly healthy. researchers and industry officials say this is because they are looking more closely for outbreaks. although testing cannot be done on live animals, many states test dead animals. illinois found the disease in a single wild deer in 2002. kansas found it first in 2006, and again last week with 10 deer testing positive. \"if you do enough sampling, you're going to find it,\" said bill pittenger, head of the missouri whitetail breeders and hunting ranch association. missouri began its statewide surveillance for chronic wasting disease in 2002. it finally turned up at heartland wildlife ranches in ethel, mo., 200 miles northwest of st. louis. heartland is a high-end hunting operation, with a sprawling lodge set on 800 acres surrounded by 8-foot fences. hunters come from across the country to take aim at trophy animals such as whitetail deer, elk and zebra. a three-day hunt for water buffalo costs $4,000. the infected deer actually died last fall. months later, as part of the state's regular surveillance program, heartland sent a specimen sample along with other samples to a federal lab in iowa. on feb. 25, the test came back positive. \"i was disappointed. worried. surprised,\" said rob brasher of salt lake city, whose family has owned heartland for two decades. the positive test sent a shudder through missouri's 39 big-game hunting operations and 272 licensed deer breeders, whose operations provide hunters with so-called shooting bucks. the state's deer industry supports the testing program, pittenger said. but members also chafe at how regulators react to an outbreak. as one person complained on a deer hunter's message board, the disease \"is a lot like global warming,\" suggesting that the response was making the problem seem worse than it really is. but government officials say drastic actions are needed to halt the march of a little-understood disease. oklahoma's state veterinarian made no apologies for shutting out deer from missouri \"as soon as we found out\" about the positive test. \"because we don't have cwd in the state of oklahoma, we need to protect our cervid breeders and our native whitetail population,\" said dr. becky brewer. other states took similar action. most states, including oklahoma, have since eased those import restrictions to deer raised closer to heartland, either in a surrounding county or within a 25-mile radius. missouri officials are now trying to determine the size of the outbreak. the 4-year-old infected buck spent its entire life at heartland. the state agriculture department is running the investigation. last weekend, 50 deer were killed at heartland. specimens were sent for testing. results are expected friday or early next week. to see whether the infection jumped the fence line, another 150 wild deer are being culled in a five-mile radius around heartland by the state conservation department. \"it'll be interesting to see what comes with the second round of testing,\" said brasher, owner of heartland. but any test results - positive or negative - will be of little solace for <mark>wood</mark>, who runs the linn county deer farm just 17 miles from heartland. last year, the linneus, mo., machinist decided to step up his small breeding program. he said he spent his savings and borrowed some more to buy a sturdy buck and quality does. he knew it was a gamble. but a baby deer can sell for $4,000 to $8,000. some farmers have even turned to laparoscopic artificial insemination to generate deer herds. but after that one positive test, it no longer mattered that <mark>wood</mark> had taken part in the state's disease surveillance program since its inception. or that he de-wormed and vaccinated his deer. or that it would seem almost impossible for the infection to have spread to his animals. his deer farm was simply too close to heartland for cautious buyers and regulators. he was being blacklisted. \"there is no bright spot for me,\" he said. he thought about it for a moment."}, {"articleID": "2019030520_00575233_W", "names": {"Jessica Mendoza": ["Q19843119", "Q3130679"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"]}, "date": "2019-03-05", "url": "https://www.goldcoastbulletin.com.au/sport/espn-star-hired-by-major-league-team/news-story/b22e5a262463c9537f2818e5d0906058", "content": "social-email_circle American TV star <mark>Jessica Mendoza</mark> has been hired as an executive scout for the New York Mets in Major League Baseball. A day after the team announced it hired Al Leiter and John Franco as baseball operations advisers, the Mets added ESPN analyst <mark>Mendoza</mark> for the same role. The former softball player, who will keep her role with \"Sunday Night Baseball,\" will assist the Mets in \"areas of player evaluation, roster construction, technological advancement and health and performance,\" the Mets said in a statement Tuesday. Van Wagenen, a player agent until joining the Mets, pointed to his own hire by the team as an inspiration to take a chance on <mark>Mendoza</mark>. \"First, I was an outside-the-box hire and I have been a believer in getting new voices and fresh perspectives in the room, especially when you are making decisions,\" Van Wagenen said at First Data Field. \"And <mark>Jessica</mark> has a very high baseball IQ. She has aptitude to learn anything. And she knows the game. Like Al Leiter, like <mark>David Wright</mark>, like John Franco, she's a winner. She played the game at an extremely high level, an Olympic champion.\" But Van Wagenen said she also brought other attributes to the job, calling her \"a pioneer.\" \"She has clearly elevated herself to show she knows baseball inside and out,\" Van Wagenen said. media_cameraThe former softball star knows her stuff. Both <mark>Mendoza</mark> and Van Wagenen attended Stanford, although Van Wagenen went there before <mark>Mendoza</mark>. Van Wagenen said he got to know the 38-year-old <mark>Mendoza</mark> when she went to ESPN and hired CAA--the agency where Van Wagenen worked until leaving to join the Mets. Van Wagenen added he reached out to <mark>Mendoza</mark> for advice when he was weighing whether to interview for the GM spot. \"When I interviewed for this job, I had a list of people on my wish list that if we can bring in fresh perspectives and people that had talent and talent that can grow and evolve in the game, we should do that,\" Van Wagenen said. \"<mark>Jessica</mark> was in my first presentation to Mets ownership. I'm excited to be able to make it a reality.\" <mark>Mendoza</mark> is expected to be in Mets camp Friday. \"I am excited to work with Brodie and his team and am thrilled to be associated with the Mets and their storied history,\" <mark>Mendoza</mark> said in a statement released by the team. \"I've known Brodie and Jeff Wilpon for years now and I'm honoured to be a small part of the organisation. I would also like to thank ESPN and Disney for their understanding and confidence as I balance both tasks moving forward. Baseball is a passion of mine and I look forward to expanding on my love for the game.\" Van Wagenen said her job with TV allows <mark>Mendoza</mark> enough time early in the week to focus on the Mets. \"There will be physical time in which we are together and a lot of phone time,\" the GM said. As for potential conflicts of interest, <mark>Alex Rodriguez</mark>, who works alongside <mark>Mendoza</mark> on \"Sunday Night Baseball,\" also serves in a similar role with the Yankees. \"She has to remain professional in both jobs,\" Van Wagenen said. \"Clearly, there is a confidentiality agreement and understanding that anything she gleans from our operation she is not going to be sharing on her broadcast, and anything she gleans in her course of working other clubhouses she can't bring to us. She's a professional and knows the lines she has to keep.\" "}, {"articleID": "2012122806_00062519_W", "names": {"Brad Pitt": ["Q35332", "Q373912"], "Eric Smith": ["Q18145133", "Q21822473", "Q30122558", "Q3731526", "Q51745810", "Q5387537", "Q5387540", "Q5387541", "Q5387543", "Q57895239"], "Kyle Wilson": ["Q1122650", "Q1795072", "Q528667", "Q56254411", "Q6451515"], "Joe Mcknight": ["Q18749091", "Q6211275"]}, "date": "2012-12-28", "url": "http://nypost.com/p/sports/jets/special_career_tA1LDk89fgnxk7RNrSC52M?utm_medium=rss&utm_content=Jets", "content": "snippy snapper famed fotog david lachapelle - who has snapped vivid portraits of madonna,...bush in icu houston - former president george h.w. bush is being treated in the...\"dog\" ged search heartbroken author dennis lehane has promised to name a character in his...island stop <mark>brad pitt</mark> and angelina jolie have brought their brood to the caribbean for ...' 20/20' vision as speculation hits fever pitch over whom jeff zucker will woo next to try...jack black is entertaining guests at the swank four seasons in kona - by...buzzer beater phoenix - carmelo anthony is their mvp but j.r. <mark>smith</mark> is their miracle...about face at best it was a misunderstanding. at worst it was a conspiracy to make tim...jobs on the line when you play in a super bowl and win it, and a year later you are asked by...2013 resolutions 1. stop worrying kelly ripa, co-host of \"live! with kelly and michael\" \"i.. . fracking lacking i have to admit i was wrong about matt damon and john krasinski's anti...hair apparent rossini's\" the barber of seville \"packs up its brushes next week. happily,...jets blog sunday is the end for mike westhoff after 30 distinguished nfl seasons and more than 600 games as one of the most accomplished assistant coaches the league has ever seen. when westhoff walks off the field sunday at buffalo, where the jets' 2012 season will come to its merciful end, it will mark his last game as the jets special teams coordinator, a post he held for the last 12 years. it will be highly bittersweet considering the uncharacteristic calamity that has marred this season under westhoff's watch. there have been blocked punts returned for touchdowns, blocked field goals, punts and kickoffs returned for touchdowns and onsides kicks and fake punts successfully executed against the jets. end of an era: though his special teams struggled this season, mike westhoff's unit had a lot of strong seasons during his 12-season jets tenure. these are the game-changing plays westhoff's special teams units are usually inflicting on opponents.\" when you look back at his body of work it's so strong that i don't think his work can be defined by one year, \"cornerback <mark>kyle wilson</mark> said.\" mike has always been one of the top special teams coaches in the league and for this to be his last year is probably tough - to cap off his last year like this is probably frustrating, \"safety <mark>eric smith</mark> said.\" if he retires, it'll be strange not having him coming up to the huddle and in the meetings. \"westhoff, a 64-year-old bone-cancer survivor, does not completely rule out coaching again, but he said,\" i don't believe i want to do that right now. \"\"it's time for me to go,\" westhoff said yesterday. \"sometimes there is a shelf life and it is time for a change. i've been here 12 years. this is my 624th game and i'm proud of that. very few of us get to leave the game of our own volition.\" i share responsibility for what has gone on this year. i accept responsibility and accountability for this [season]. blame? that's semantics and will be decided by others at a later time. \"westhoff said his goal is to get into television, perhaps carving a niche as an analyst to explain the ins and outs of special teams. his son, john, an attorney in indianapolis, will be on the jets sideline with him during the game sunday, something he said\" will be a very special time for us. \"westhoff's players hope to send him off with a performance for him to remember sunday. it won't erase the pain and disappointment this season has brought him. but it would be a nice parting gift.\" we would like to send him off on a high note, \"linebacker nick bellore said.\" i want to send him off with a bang, \"running back <mark>joe mcknight</mark> said.\" that's going to be my mission. \"<mark>mcknight</mark> is a classic example of the many players whose careers westhoff has saved.\" coach westhoff has meant a lot to me, because when i wasn't doing well and not getting in on offense he was chewing me out letting me know he needs me on special teams, and if i was going to make it on this team i was going to have to play special teams, \"<mark>mcknight</mark> said.\" he just kept sticking with me. i appreciate the fact that he believed in me when nobody else did. \"that kind of coaching, more than any perfectly schemed blocked punts or kickoff returns for touchdowns, best defines westhoff's greatness.\" one of the best special teams coaches ever to coach this game, \"former jets and current cardinals kicker jay feely said. new york post is a registered trademark of nyp holdings, inc. ."}, {"articleID": "2012020810_00034534_W", "names": {"Chris Johns": ["Q2964748", "Q5107015", "Q5107016", "Q54257624"], "Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"]}, "date": "2012-02-08", "url": "http://efinancialnews.com/story/2012-02-08/2012-a-good-year-for-increased-emerging-market-exposure?mod=blogheadlines-home", "content": "emerging markets are back on the investment radar for 2012 after a poor run in the latter half of last year, state street global advisor's chief investment officer for fundamental equities said on tuesday at a round-table discussion. while investment in those markets was overheated a year ago, the investment climate has since improved. in a press discussion at the firm's canary wharf tower, <mark>chris johns</mark> said that given the appetite for investment in emerging markets a year ago, it was \"almost inevitable\" that 2011 would be a less-than-stellar year. today, however \"the secular drivers of growth are still there. it's a good time to think of increasing emerging market exposure,\" he said. the msci emerging markets index dropped to a year low of 824.39 in october of 2011 after reaching a high of 1,211.98 in late april, according to bloomberg data. the index reached a 2012 high of 1053.13 on monday. state street global advisors had $21.8 trn in assets under custody and $1.9 trn in assets under management at the end of last year. the firm as a whole took a less apocalyptic view of the markets overall than many of its peers last year, three of ssga's cios said during the discussion, though the firm still went short on the euro versus the dollar and yen. <mark>johns</mark> said that ssga currently is overweight in us equities even though those stocks were slightly expensive, adding that many us businesses had recovered more rapidly than commentators had given then credit for. <mark>johns</mark> predicted that cheap, large, high-beta stocks were a good pick for 2012. the high dividend-paying stocks that clients requested intensely a year ago, are now \"overcooked,\" he said. richard lacaille, the fund manager's chief investment officer and <mark>kevin anderson</mark>, global chief investment officer of fixed income and currency both said they were more optimistic about the european market in the new year after the european central bank's long term refinancing operation improved confidence in the region. <mark>anderson</mark> said european banks' deleveraging was reducing the efficiency of the loan market and pushing more institutions into the bond market. as institutions' appetite for risk improves, he said they were likely to look increasingly towards the european high-yield bond market rather than just the us market. valuation services analyst - duff & phelps corp. ."}, {"articleID": "2011041304_00085112_W", "names": {"Stephen Harper": ["Q206", "Q7609425"]}, "date": "2011-04-13", "url": "http://calgarysun.com/news/decision2011/2011/04/12/17973721.html", "content": "conservative party leader and prime minister <mark>stephen harper</mark> speaks in the english leaders' debate in ottawa, april 12, 2011. (reuters/chris wattie) ottawa--it was <mark>stephen harper</mark>'s debate to lose--and he did not. it was michael ignatieff's debate to win--and he did not. a poll done exclusively for qmi agency immediately after tuesday night's english-language debate shows that english-speaking canada was, by and large, unmoved by the two-hour duel among the four party leaders. asked who won the debate, 37% of those surveyed by leger marketing said <mark>harper</mark> was the victor. about 21% said ignatieff won. those numbers roughly mirror voter support in polls leger has done before and during the election campaign. \"for michael ignatieff, he was in it to win it. so he didn't win the debate, but it is impossible to say that he lost it, either,\" said christian bourque of leger marketing. \"it was not michael ignatieff's big night.\" in fact, among those who said the liberals were their first choice before the debate, just 54% said they thought ignatieff won the debate. one in five liberal supporters said layton was the winner. by contrast, 77% of those who said they were voting conservative thought <mark>harper</mark> won the debate. about 12% of tory supporters called layton as the winner. \"<mark>harper</mark>'s base was reassured. it was his to lose and he didn't,\" said bourque. leger polled 1,037 people selected from its online panel of 350,000 canadians. the pollster only quizzed those who said they watched the debate. the margin of error is comparable to 3.1 percentage points, 19 times out of 20. view/leave comment it's sad when saying nothing and \"simply\" disagreeing with everything your opponents claim is considered a win. statement from auditor general sheila fraser"}, {"articleID": "2012010601_00039407_W", "names": {"Tim Kennedy": ["Q3991364", "Q514532"], "Dan Henderson": ["Q19282274", "Q33120424", "Q548861"], "Ben Henderson": ["Q1349552", "Q4885824"], "Justin Wilcox": ["Q6318273", "Q6318274"]}, "date": "2012-01-06", "url": "http://mmajunkie.com/news/26834/strikeforce-eyes-new-champs-by-mid-year-but-woodley-kennedy-no-lock.mma", "content": "strikeforce eyes new champs by mid-year but woodley, <mark>kennedy</mark> no lock las vegas - with the defection of former strikeforce champs alistair overeem, nick diaz and <mark>dan henderson</mark>, the ufc's sister promotion finds itself a little short in the titleholder department. strikeforce ceo scott coker today said he hopes to rectify that by mid-2012. however, perhaps as part of the \"business as usual\" mantra of the promotion, coker declined to speculate on whether or not a few key names could be expected to figure into the picture. \"i think by mid-year, we'll have all titles pretty much filled in strikeforce's vacant divisions,\" coker said at thursday's \"strikeforce: rockhold vs. jardine\" pre-event press conference. one of those key welterweight matchups takes place at saturday's showtime-broadcast event in las vegas, as the undefeated tyron woodley (9-0 mma, 7-0 sf) meets canadian youngster jordan mein (23-7 mma, 1-0 sf). woodley has taken to calling himself the uncrowned champion at 170 pounds, and you won't find too many mma pundits willing to argue. while coker admitted woodley would seem a logical choice should he down mein, there was also no \"win and you're in\" guarantee. instead, the strikeforce boss pointed to matchmaker sean shelby for guidance on who would contend for the belt vacated by diaz. \"we're definitely going to keep our eyes on the fight,\" coker said. \"i mean,\" t-wood' has definitely proven himself. \"i know that in the next couple fights that we have, we're going to have some top welterweights fighting, but that's something that we're going to sit down with sean after this event and plan something out, just like we're going to plan out the light heavyweight division and get our champion in that division.\" one strikeforce division that does boast a champion is 185-pounds, and titleholder luke rockhold defends his belt against longtime veteran keith jardine in saturday's main event. jardine took a slot that was originally intended for 32-year-old <mark>tim kennedy</mark> (12-3 mma, 5-1 sf), who has dropped just one of his six career strikeforce outings. <mark>kennedy</mark> was forced to withdraw from the planned matchup with an undisclosed training injury, but that doesn't necessarily mean he's waiting in the wings to challenge the winner, according to coker. mmajunkie.com (www.mmajunkie.com). \"after this fight, let's see how the fights go, and then we can reevaluate from there and then get back to you on the next fight.\" in 2011, strikeforce officials declared the pearl at the palms casino resort in las vegas the permanent home of the promotion's \"challengers series\" events. however, when strikeforce and showtime partnered for another year of events on the premium-cable channel, the prospects-driven series was immediately scrapped. strikeforce is kicking off its 2012 schedule in sin city, but the company moved crosstown to the joint at hard rock hotel & casino. coker declined to speculate on the likelihood of a 2012 return to either venue but did say that the company would not be tied down to las vegas. \"it's nice to be in vegas,\" coker told mmajunkie.com. \"this is the home of zuffa and the headquarters of the family. there are tremendous resources here. but this was an event where we felt the free preview weekend would be a great opportunity to have a showcase for our talent, and we made a decision to pull this fight off in a relatively quick manner.\" we felt this was a great opportunity, and luckily the hard rock opened up their doors, and here we are. we're looking forward to putting on more events here in las vegas, but we're also going to go on the road. we're going to be a traveling show and going all over the country. \"the company is next expected to touch down in columbus, ohio, for a march 3 event. strikeforce's adlan amagov admittedly a bit starstruck by veteran opponent mmajunkie.com radio: keith jardine, jordan mein and kamal shalorus strikeforce's tyron woodley: rematch with tarec saffiedine not yet warranted strikeforce's jardine on champ rockhold:\" of course he doesn't want this fight' with limbless opponent unavailable, strikeforce's lawler settles for amagov strikeforce's mein promises improved wrestling will solve woodley riddle tyler stinson planning to demand a title shot at strikeforce's weekend show estevan payan replaces bobby green, completes \"strikeforce: rockhold vs. jardine' mmajunkie.com radio: strikeforce's tyler stinson (in studio), ufc 142's sam stout\" strikeforce: rockhold vs. jardine' adds lawler-amagov, lawal-larkin, saffiedine-stinson strikeforce's <mark>tim kennedy</mark> on spike tv's \"deadliest warrior\" tonight strikeforce's <mark>tim kennedy</mark> takes robbie lawler to task after decision win \"strikeforce: fedor vs. <mark>henderson</mark>\" results: <mark>henderson</mark> stops fedor in stunning rally \"strikeforce: fedor vs. <mark>henderson</mark>\" preview: fantasy matchmaking, guilty pleasure with tough training camp, strikeforce's <mark>kennedy</mark> \"sucks\" less ahead of lawler fight following jackson-winkeljohn sessions, strikeforce's <mark>kennedy</mark> confident for lawler mmajunkie.com radio: harris, bowling, voelker, cason, roufus, <mark>kennedy</mark> and jensen officials confirm \"strikeforce: fedor vs. <mark>henderson</mark>\" main card, five bouts featured strikeforce's tyron woodley: rematch with tarec saffiedine not yet warranted strikeforce's mein promises improved wrestling will solve woodley riddle strikeforce's tyron woodley hopes to put missouri mma on map with att evolution radio: <mark>ben henderson</mark>, k.j. noons, <mark>justin wilcox</mark>, tyron woodley, jorge patino, chris algieri jordan mein vs. tyron woodley added to \"strikeforce: rockhold vs. jardine' woodley vs. saffiedine likely to determine next strikeforce welterweight champ\" strikeforce: fedor vs. <mark>henderson</mark> \"results: <mark>henderson</mark> stops fedor in stunning rally\" strikeforce: fedor vs. <mark>henderson</mark> \"preview: fantasy matchmaking, guilty pleasure strikeforce's woodley: daley's incomplete game will lead to his demise strikeforce's adlan amagov admittedly a bit starstruck by veteran opponent mmajunkie.com radio: keith jardine, jordan mein and kamal shalorus strikeforce's tyron woodley: rematch with tarec saffiedine not yet warranted strikeforce's jardine on champ rockhold:\" of course he doesn't want this fight' with limbless opponent unavailable, strikeforce's lawler settles for amagov champ miesha tate vs. ronda rousey in the works for march strikeforce event strikeforce's mein promises improved wrestling will solve woodley riddle tyler stinson planning to demand a title shot at strikeforce's weekend show to join the mmajunkie.com discussions with your fellow mma junkies, mma forums. rules: no spam. no fighter bashing. no insulting other posters. no disruptive posts. nothing \"not safe for work\" or illegal, including links to illegal videos. mmajunkie.com reserves the right to moderate all posts. also, stinson has mad heart. dude showed up on junkie comments section last night to dispell some negativity. agree w/dragon. sf isn't dead yet. so what if it is not \"relevant\" ? it is still professional mma fights."}, {"articleID": "2016080822_00366847_W", "names": {"John Porter": ["Q21933529", "Q26898988", "Q3181414", "Q3182331", "Q55395742", "Q57438483", "Q6054159", "Q6253196", "Q6253204"], "Murray Smith": ["Q6939460", "Q6939462", "Q6939464"], "Christy Martin": ["Q4354099", "Q5113657"], "Angela Robinson": ["Q19666500", "Q29643520", "Q459542"], "Mike Scott": ["Q16216757", "Q1849355", "Q3313545", "Q582252", "Q6848743", "Q6848747", "Q6848748", "Q6848749"], "Chris Henderson": ["Q4116002", "Q489906", "Q5106859"], "Bruce Johnson": ["Q16269599", "Q18585998", "Q4977745", "Q4977748", "Q4977749", "Q4977751", "Q4977752"]}, "date": "2016-08-08", "url": "http://concordmonitor.com/Town-Crier-Master-List-3884485", "content": "Town crier for Aug. 7, 2016 Monday, August 08, 2016 ALLENSTOWNHelp plan senior activities The Red Hatters will meet Monday at 10:30 a.m. at the Allenstown Community Center at 8 Whitten St.. The Allenstown Public Library reading program will be Tuesday at 1:30 p.m. and will make paper plate visors. The final raffle and make your own trail mix will be Friday at 2 p.m. Join in the fun. The Suncook Senior Center will hold an activity planning meeting on Wednesday at 9 a.m. at the Allenstown Community Center and all are welcome. Bingo will be held Monday from 10:15 to 11:45 a.m and on Thursday from 10 a.m. to 11:45 a.m. at the Allenstown Community Center. The Ladies of St. Anne wishing to be on the float in the Old Home Day parade are required to sign up. You may sign up after Mass on Sunday at the back of the church. Contact Evelyn at 717-1188 or Judy at 485-4025 with any questions. St. <mark>John</mark> the Baptist Penny Sale and Harvest Bazaar will take place Oct. 21, 22 and 23. They could use some help so please consider volunteering some time during this fun weekend. Call 485-3113 to volunteer or more information. CLAUDETTE VERVILLE ANDOVERWatch film on melting ice A documentary, Chasing Ice, will be shown in the Andover Barn at the Highland Lake Inn on Monday at 7 p.m.. The widely acclaimed 2012 film follows a team of environmental photographers as they battle technical problems, camera malfunctions and health issues above the Arctic Circle in order to capture, via time-lapse photography, the impact of global warming on the polar ice cap. The Andover Fish and Game Club's annual \"Famous Beef Barbecue\" will be held Saturday from 5 to 6:30 p.m. at the Proctor Academy Field House. In addition to beef barbecue, the meal includes salads, rolls, homemade beans, corn on the cob, and strawberries and ice cream for dessert, all supervised by Chef <mark>Murray Smith</mark>. Adults are $12, kids under 12 are $5. Following the meal, there will be a re-organized Chinese auction. Deer pool and gun raffle tickets are also available at the event. Call Rich Gross at 735-5311 if you have questions. Calling all artists and crafters! The Andover Service Club is sponsoring a Fall Festival Art and Craft Fair on Oct. 8 at the Andover School. Request a registration form by emailing MaryO.ASClub @ live.com. Space is limited; the registration deadline is Sept. 14, and a reserved space costs $20. Parking spaces for vendors will be reserved. For more information, call 735-4101 after 10 a.m. SUSAN CHASE BARNSTEADSign up for health fair The Wall of Sound will play the Barnstead Parks and Recreation concert at the parade grounds Saturday at 6 p.m. Bring a friend, your favorite chair and a picnic. The Barnstead Farmers Market is sponsoring a health and wellness fair on Sept. 24. The Sanctuary Bodyworks and Sauna of Pittsfield will be offer information on how to strengthen the immune system before the flu season. The market is still seeking vendors for this event and encourages all health and wellness providers to apply. For an application or more information, please contact Lori Mahar at lorimahar @ tds.net or 269-2329. The Barnstead Area Community Farmers Market was developed to provide a venue for local area agricultural businesses to expand their consumer base and also to provide the local and surrounding area communities to have a one-stop shopping place for their consumables. It is located off Route 28, on Maple St. in Barnstead. LORI MAHAR BOSCAWENTwo free musical events Our town is holding two free music performances this week. Four Shillings Short will perform their Celtic, folk and world music tomorrow from 6 to 7:30 p.m. at the Boscawen Town Hall, below the Congregational Church. Enjoy the voices of <mark>Christy Martin</mark> and Aodh Og O’Tuama accompanied and many beautiful instruments. On Thursday, the Stuck in Time Band will be the last performance in the summer concert series. Bring your blankets and lawn chairs for a fun evening that the whole family can enjoy at the gazebo on the lawn of the town municipal offices at 116 N. Main St. A snack bar will be available. It's not too late to turn in your tracking sheets and enter your raffle tickets for the summer reading program. Raffle winners for some terrific prizes will be picked Monday at 5 p.m.. They include a Kindle, Amazon gift card, Books-a-Million gift card and gift cards to Alan's Restaurant, Kapelli's Restaurant, and Richardson's Ice Cream plus lots and lots of kids' prizes. Six lucky readers have won gift cards to Dunkin Donuts just by participating. Woodchucks is the topic of this week's segment of \"Grow It Green\" featuring the River Road farm of <mark>John Porter</mark>. It will be broadcast on WMUR in conjunction with the UNH Cooperative Extension. All shows air Saturdays at 7:20 a.m. and Tuesdays at 12:15 p.m. Plants for Native Pollinators will be aired Aug. 20 and 23. The art exhibit \"Balancing Acts: Exploration of the artful life in wax and encaustic\" is currently on display at Twiggs Gallery. It will run through Sept. 4. MARY ALLARD BOWGolf tourney set for Friday The Bow Rotary summer concert series continues tonight with the Freese Brothers Big Band from 6 to 8 p.m. at the town gazebo. This year's concert series will conclude Aug. 14 with Dimitry Botnar. Attendees are encouraged to bring blankets or lawn chairs. In case of rain the concerts will be held in the Community Building. The 20th annual Bow High School Falcons Booster Club Golf Tournament will take place Friday at the Stonebridge Country Club in Goffstown. The shotgun start will be at 8:30 a.m. preceded by registration and a continental breakfast at 7:30 a.m. Contact Betty Porath at 856-8118 or visit bowboosterclub.com for more information or to register. The next meeting of the Bow Garden Club will be held Sept. 12 at 6:30 p.m. at the Old Town Hall at 6 p.m. For more information, visit bowgardenclub.org. The Merrimack County Stamp Collectors will hold its monthly meeting at the Bow Mills United Methodist Church on Aug. 16 at 1 p.m. All who are interested in stamp collecting are welcome to attend. For more information, call Dan Day at 228-1154. There will be a Bow Democrats candidate night and ice cream social Wednesday from 6:30 to 8:30 p.m.. It will be held at the Old Bow Town Hall, with candidates for governor, executive council, state Senate and House present. The ice cream will be from the Puritan Backroom and the emcee will be Raymond Buckley. The Junior Service League of Concord is an all-women's organization founded in 1931 with the mission of supporting women and children in crisis, promoting volunteerism, and improving the community through civic service and leadership. Their mission is to bring the strength of women and the power of community to make a difference for those in need in the Concord area. Anyone interested in finding out more is invited to attend an informational gathering in Concord on Tuesday. Call Bridget at 496-0599 for information or to RSVP. JOYCE KIMBALL CANTERBURYJoin in for music, picnic Fiddlers Picnic on the green will be today in Canterbury Center. The music starts at 2 p.m. and a potluck meal begins after 4:30 p.m. in the Parish Hall. Call Teresa Wyman 783-9826 for more details. The Canterbury community farmers market will be Wednesday from 4 to 6:30 p.m. Come celebrate 10 years of the market and enjoy fresh local carrot cake while it lasts. Music will be by Just Because. The full schedule is at ccfma.net or Facebook. SNAP/EBT accepted. At the Elkins Public Library Zen Coloring will be Thursday from 1:30 to 3 p.m. with supplies and refreshments provided. Guided meditation with gentle stretching will be Aug. 19 at 6 p.m. Story Hour resumes Aug. 16 at 10 a.m. and Rock and Read on Aug. 23, also at 10 a.m. Toddler Jackpot and surprise activities will be Aug. 30 at 10 a.m. Any youth in Canterbury over eight years old by January is eligible to join 4-H. Enrollment takes place in September. Contact Laura Crockford at canterburyrascals4H @ gmail.com or 540-9877. Canterbury Shaker Village has new classes: Oval Box Making (Aug. 13 and 20), Shaker Broom Making (Aug. 13, Sept. 10, Oc. 15 or Nov. 12), Mushroom Walk (Aug. 27), Rugs in the Shaker Spirit (Sept. 24), Letterpress Printing (Sept. 24, Oct. 8, Oct. 29 or Nov. 5), Syrups for the Cold Season (Oct. 2), Cordials and Chocolates (Oct. 29), Do It Yourself Herbal Body Care Gifts (Nov. 12) or Christmas in the Shaker Spirit (Nov. 19). The Loudon Food Pantry has updated its website--visit LoudonFoodPantry.org. Macy ’s.com Shop For a Cause passes are $5 each; take them to Macy's on Aug. 26 through 28 and receive 25 percent off. The Food Pantry will also be at Loudon Old Home Days on Saturday LOIS SCRIBNER Fold your best airplane The adult and teen craft group will meet Monday at 6:30 p.m. at the library. The library board of trustees will meet Monday at 4 p.m.. This will be an open meeting for library users. Next month's book for The Book Club is The Ocean at the End of the Lane. Pick up a copy at the library. The August Memory Cafe will be held Friday at 2 p.m. at the Chichester Historical Society, 49 Main St. Lucille Noel will talk about the displays. Get ready for Saturday's Paper Airplane Flying Tournament, the finale to the summer reading program, at 7 p.m. at the Grange. First prize of $30! The Chichester Youth Association Board positions of president, secretary, equipment manager and softball commissioner are open. Please let someone on the current board know if you are interested. CYA meetings are held the second Sunday at the Grange Hall at 6 p.m. Kyle Mitchell, a scout with Troop 30, will hold a car wash Sunday at the Chichester Fire Station from 9 a.m. to 3 p.m. to raise money for his Eagle Scout project to add benches along the path and improve the picnic area at Carpenter Park. The School Budget Advisory Group is looking for new members. Contact Sally Kelly for information at SKelly @ sau53.org or call 798-5806. CAROL HENDEE DUNBARTONHear discussion on New England's towns The Dunbarton Historical Society will be hosting a program on \"The New England Town\" by Jere Daniell, a former Dartmouth College professor, on Aug. 16 at 7 p.m. at St. <mark>John</mark>'s Parish Hall. The public is welcome to attend. This is a Humanities Council Program. There will be a Contra Dance Aug. 18 at 6:30 p.m. at the library with Carolyn Parrott on the bandstand. Live music and traditional dances for all. Sips and Sweets will be a fun night for current and new PTO parents Aug. 18 from 7 to 9 p.m. at Countryside Golf Club, 20 Country Club Lane. RSVP to dunbartonpto @ gmail.com by Aug. 16. Coffee Chat at the library will be Aug. 19 from 9 to 10 a.m. NORA LEDUC EPSOMDon't miss Old Home Day events The Epsom Public Library will have a Teen Dance-Off on Aug. 17 at 6 p.m. Dress in comfortable clothes, bring a water bottle and join the fun. Dinner will be provided. Call Mrs. Benner at 736-9920 to sign up. On Wednesday at 1:30 p.m., the library will be showing My Big Fat Greek Wedding 2. This sequel to the 2002 film finds the Porrtokalos spending most of their time focusing on their teenage daughter while having to deal with another Greek wedding. Epsom Old Home Days will take place Saturday and Sunday at Webster Park. Bring your town spirit and enjoy the festivities. The library will have its lemonade stand and you will be able to order mums at its fall mum sale. Don't miss Lindsay and her Puppet Pals at 2:30 p.m. on Saturday at the bandstand. The parade starts at 10 a.m.. If you have any questions, call 857-205-2841 or Georgia Perry at 736-8802. For more information email epsomoldday @ yahoo.com or visit epsomnh.org. The Epsom Town band will be perform Saturday at 6:30 p.m. For more information, contact Penny Graham at 736-9044. Did you send in your letter for Citizen of the Year Award? If not, send to Georgia Perry, 190 North Road, Epsom 03234. If you have a child under 3 or you are pregnant, Early Head Start will have openings soon. Free for income-eligible families. Call 435-6611 to inquire. If you have a 3 or 4-year-old child, Head Start has openings. There is a five-day-a-week preschool program. Breakfast and lunch are included. Free for income-eligible families. Call Susan Ireland at 225-3295 for information. Save the date of Aug. 16 at 7 p.m. Ramblin Richard will present his beloved American songs and their amazingstories, a relaxing and fun evening of music at the Epsom Public Library. Summer crafts will take place Monday at 1 p.m.. A snack is included. Sign up at the circulation desk. On Wednesday at 6:30 p.m., the youth summer reading program finale with storyteller Simon Brooks will take place. Registration is required for this event. Sign up at the circulation desk. The Infant Program will be Monday at 10 a.m. at the library. Story time will be Tuesday at 1:30 p.m. and Thursday at 3:30 p.m. Lego Club will meet Thursday at 3:30 p.m. at the library. Epsom Public Library Historical Center will be open on Wednesdays from 6 to 8 p.m.. The trustees would appreciate volunteers for those hours. Call the library if you would be willing to help. The food pantry is in need of canned goods; suggestions are canned beets, carrots, and soups, including cream and tomato. The cemetery committee will meet Tuesday at 5 p.m. at the library. The planning board will meet Wednesday from 6:30 to 8:30 p.m. at the at town offices' meeting room. TERRY RIEL FRANKLINPick up fresh foods The free Concert in the Park at Odell Park Thursday at 6:30 p.m. will be Audrey Drake. Bring lawn chairs or blanket and enjoy music along the banks of the Winnipesaukee River. In case of rain, concerts will be held at Franklin Opera House. Franklin farmers market will be Tuesday from 3 to 6 p.m. at Franklin Regional Hospital. SNAP/EBT and credit/debit cards accepted. Call 934-2060, ext. 8369 with any questions. There will be a breakfast this morning at Meridian Lodge, 58 S. Main St., from 8 to 11 a.m. Each breakfast is made fresh to order. The cost will be $8 adults, $5 children 12 and under. There is a handicap entrance located at the rear of the building. Shop and lunch in Concord on Monday with the TRIP Center. The cost of transportation is $2. The bus leaves at 9:30 a.m. Call first thing Monday morning, 934-4151, to reserve space. The filing period for those wishing to run for open seats in city elections is Aug. 17 to 26. For information, call the city clerk at 934-3109. Elections will be Oct, 4. The final event of the summer reading program at Franklin Public Library will be Saturday. A Giant Game Day will be held from noon to 4 p.m. for kids of all ages. Celebrate 20 years of service by Health First Family Care Center, 841 Central St., from 10 a.m. to 2 p.m. with face painting, live animal show, games and more. The Franklin Area Children's Theater will present Willy Wonka Jr. on Aug. 19 and 20 at the Franklin Opera House. Tickets are available online at franklinoperahouse.org or call 934-1901. The registration deadline is Aug. 17 for co-ed teams age 13 and older to participate in the 23rd Annual Franklin Savings Bank Charity Softball Tournament scheduled for Sept. 14 to 24. Call 934-4445 or email mybanker @ fsbnh.com for information. The Congregational-Christian Church, Franklin's oldest church, will hold a neighborhood party and yard sale Saturday, rain or shine, from 8 a.m. to 2 p.m., free lunch from 11 to 1 p.m., and games, a raffle, quilt and art show, history booth and tours. JUDITH ACKERSON HENNIKERThe sound of music This year's Music on Main Street event will take place Oct. 1 and volunteers are needed to set-up from 6 to 9 a.m., traffic control from 6 a.m. to 4 p.m., run children's activities from 9 a.m. to 4 p.m. and clean-up from 4 to 5 p.m. To sign up, email Devin at musiconmainstreetvolunteers @ gmail.com. The JSU soccer league is hoping to have a few more girls sign up for the U9 team. We have five so far from Weare and Henniker. Hoping for just a few more. Born in 2008? Check out johnstarkunited.org. The Congregational Church is hosting Wildlife Encounters on Aug. 18 from 6:30 to 7:30 p.m. All the animal \"guests\" are unable to be released back into the wild due to injuries or because they were not born in the wild. Rusted Chrome will play Tuesday at 7 p.m. at the <mark>Angela Robinson</mark> Bandstand. The band plays country and rock hits. Flicka will be the family film shown at the bandstand at 8:15 p.m. on Friday. Actors between the ages of 7 and 107 are needed for an Aug. 19 to 20 film about Amy Beach and her early days in Henniker and later days in Hillsboro. Email dunn.t @ comcast.net or go to alchemistsworkshop.org for more information. This film will be shown online over the next year to help advertise the 150th birthday festival for Amy in 2017. TOM DUNN HILLSBORO / DEERINGLearn all about yoga Instructors from Bethel Farm Yoga will be at Fuller Public Library on Monday at 3 p.m. to talk about yoga for all ages. Trivia continues at the library Tuesday at 2 p.m.. Test the depth of your useless knowledge. Prizes awarded. The League of New Hampshire Craftsmen Fair trip will be Thursday. The GHSS bus will leave Shaw's for a fun day at beautiful Mt. Sunapee. The bus fare is $5 and fair admission is $12. Bring your AARP card for a possible discount. Call Marie Mogavero at 464-4726 or 724-5272 to sign up and get departure time. On Thursday, celebrate the end of the summer reading program at the library with a visit from Mystique the mini-horse from 2 to 4 p.m. On Friday, there will be a trip to Garden in the Woods in Framingham, Mass.. Join GHSS to see the beautiful botanic garden displays of native New England plants in a natural setting. The group will also check out the Garden Shop. The cost of transportation is $11. Admission is free for the day. Call Marie Mogavero at 464-4726 or 724-5272 to sign up and get departure time. A free summer fair will take place Saturday from 9 a.m. to 2 p.m. at Deering Community Church, Route 149 in Deering. Enjoy homemade jams, pies, granola, bean soup kits, Grafton cheese, honey and maple syrup. New this year: pickled eggs. There will also be jewelry, fine crafts, a café featuring home-baked muffins, and a hot dog stand. Enjoy live music, too. Visit deeringcommunitychurch.org for more information. The Hillsborough farmers market will be Saturday from 9 a.m. to noon at Butler Park. Hillsboro's annual Living History event will take place Aug. 20 and 21. Visit with Abigail Adams, Molly Pitcher, Annie Oakley and Laura Ingalls Wilder. Interact with period artisans with music by the 2nd South Carolina String Band. Follow a battle through the woods and see where President Pierce's parents are buried. For more information visit LivingHistoryEventNH.com, email LivingHistoryEvent @ gmail.com or call 464-5858. NANCY SHEE HOPKINTON / CONTOOCOOKGet ready to race The 15th annual Contoocook Carry Triathlon will take place Sept. 10 at 1:30 p.m., starting at Hopkinton High School. Dig out that old equipment for the two-mile run, the five-mile paddle with portage and the 14-mile bike ride. All ages and abilities and even four-legged friends are welcome to help raise funds for fuel assistance. There will be free T-shirts to the first 100 to register. For more information visit. contoocookcarry.org, or call 568-2783. Join in Saturday from 2 to 4 p.m. for a special tour of two homes located on Hopkinton's historic Sugar Hill Road. As part of the Historical Society's summer exhibit, two homeowners have graciously agreed to a tour of portions of their home and barn. Visit HopkintonHistory.org or call 746-3825 for additional information. There is a $5 suggested donation. The Carter Mt. Brass Band will perform in Contoocook at the gazebo in Riverway Park today at 3 p.m.. The band plays traditional American band music in solid brass. All concerts are free and open to the public. The rain location is the Slusser Center. The League of Women Voters of the Greater Capital Area will hold a public meeting for candidates running for New Hampshire Executive Council, District 2, on Aug. 24 at the Hopkinton Public Library. The session will be from 7 to 8:30 p.m. with doors open at 6:30 p.m. Audience members will be able to interact with the candidates as the four candidates rotate around the room answering questions. Candidates running in the primary election are Democrats Shawn Mickelonis of Rochester, <mark>John</mark> D. Shea of Nelson and Andru Volinsky ofConcord. Republican candidate Sam Cataldo of Farmington, will also participate. The League of Women Voters is a nonpartisan organization that provides voter information and does not support any candidate. The Contoocook Depot will host a dinner Saturday that will be served at the restored Train Depot and the Pullman Coach. Catered by the Everyday Café and Pub, there will be a choice of entrees. Dinner will be served from 5:30 to 7 p.m. Tickets are available at several local merchants in Hopkinton and Contoocook Village. The donation for tickets is $25 for adults and $12.50 for children under 12. Call Linda Ogden for more information or to order tickets at 856-4478. Thank you for celebrating the summer season with the Hopkinton Town Band at the Jane Llewellen Bandstand in Contoocook. The last concert will be Wednesday at 7 p.m.. In the event of rain, the concert will be held at the Maple Street Elementary School. For more information, contact band managers Lucy Gaskill and Melissa Mandrll at pertice_c @ comcast.net, or the band's conductor at wojewodajim @ gmail.com The Contoocook Farmers Market will be at the Train Depot on Saturday from 9 a.m. to noon. Join in for another great season of food, music and fun every week through October. The market features spring veggies, meat, jams, maple syrup, breads, pies and other baked goodies, botanical products. SNAP/EBT accepted. A local New Hampshire fish CSA is available. For more information, visit facebook.com/ContoocookFarmersMarket. Senior Center information is available at 746-2915. Senior lunch will be on Wednesday at noon at the Slusser Center. The suggested donation is $4. KATHLEEN BUTCHER PEMBROKEPig roast to aid kidney transplant A fundraiser pig roast with all the \"fixins\" will be held for Eric Cooper of Pembroke, who is awaiting a kidney transplant. American Legion Post 37, 5 Riverside St., Hooksett, is donating its facility for the event Saturday from 5 p.m. to midnight. There will be a DJ, karaoke and door prizes. Tickets are $20 in advance or $25 at the door. Call 485-8986. Please come and support Eric. The <mark>Mike Scott</mark> Band, a country band from Concord, will provide the music at the Concert in the Park on Saturday from 6 to 8 p.m. at Memorial Field. This free concert is sponsored by Olympus Pizza in conjunction with the Pembroke Recreation Department and is produced by <mark>Chris Henderson</mark>. Bring blankets and chairs and enjoy the music. JOCELYN CARLUCCI PITTSFIELDDonate for baskets The beautiful hanging flower baskets around town are maintained by a group of volunteers. If you would like to make a donation to the fund to help defray some of the costs, please send your check payable to Hanging Flower Baskets Fund to Donna Keeley, 256 True Road, Pittsfield 03263. The Pittsfield Balloon Rally's Frank H. Donovan 5K race will be held today at 9 a.m., starting from Drake Field. Race day registration is $25, cash only. There will be cash prizes for the top runners. For more information about the race and Balloon Rally, visit suncookvalleyrotary.org or contact Keith and Libby Kun at 505-1636 or frank5krun @ gmail.com. The annual Pittsfield Community Impact Awards, hosted by Pittsfield Listens, will be held Aug. 18 at 6 p.m. at Dustin Park followed by a barbecue and potluck (you are invited to bring a side dish or dessert to share). For more information, please contact info @ pittsfieldlistens.org. The Rev. Henry M. Frost of Loudon will conduct a worship service at the Friends Meeting House Quaker Church on Dowboro Road today at 1 p.m. Everyone is cordially invited to attend. On Tuesday at 10 a.m., there will be a crockpot cooking presentation at the Senior Center. Brittany Edgerly, a wellness representative from New Hampshire Interlocal Trust, will demonstrate how to cook quick, easy and low-cost meals using what is in your freezer while taste testing some of the items cooked. The presentation is made possible through a grant from Harvard Pilgrim Health in partnership with the Interlocal Trust. The parks and recreation commission will meet on Tuesday at 6:15 p.m. at the F.B. Argue Recreation Area. The Friday Night Kayak group meets each Friday night at a different local kayaking site. The paddling trips last just over an hour. Visit huffnpuff. info for information and location of the next trip or call Paul Oman at 435-7199. The food pantry is in need of a few volunteers. One person is needed to take orders of food and pick-up from USDA, N.H. for Bush and CAP. Volunteers are needed on Thursdays from 11 a.m to 2 p.m. to fill patron orders. If you can volunteer for either of these jobs please contact Ruth Strickhart at 435-6773 extension 19 or 435-7013. The Josiah Carpenter Library is pleased to host a new art exhibit called \"Photos by Nina.\" Most of her photos come from her adventures, exploring the back roads on her Harley and kayaking the various ponds and lakes in the New England area. The exhibit will be at the library through the month of August. Happy birthday wishes to JoAnne Ward, Andy Fries and Fred Hast. Happy anniversary wishes to Merrill and Diane Vaughan and to Sally and Jeff Wardwell. ANDREA RIEL SALISBURYCount down to Old Home Day festivities We are counting down to Salisbury's Old Home Days so mark your calendars. The theme this year is \"1966\" to coincide with Salisbury Historical Society's 50-year anniversary. The first events are Friday with an ice cream social from 6:30 to 7 p.m. and pet parade at 7 p.m., both at the Salisbury Town Green on Route 4. Beginning at 7:30 p.m., fireworks festivities (with sno-cones and hot dogs) will be held at Maplewood Ballfield; fireworks begin at 9 p.m. On Saturday, events begin at 8 a.m. on the Town Greens with the library food booth and bake sale from 9 a.m. to 2 p.m., Explorers food booth, farmers market, antiques, vendors, historical society museum will be open. At 10 a.m., there will be a Cemetery Walk and face painting. The parade will be at 11 a.m. Presentations for float judging, Citizen of Year and 1966 events will be at 11:30 a.m.; Lazy Boy Rockers will be from 11:30 a.m. to 2:30 p.m.; Karaoke in the White Tent will be 11:30 a.m. to 3 p.m.; Reptiles on the Move will be noon to 1 p.m.; church chicken barbecue will be noon to 5 p.m.; a horseshoe tournament will be at noon; registration for pie eating contest and Jello mold contest will be at 1 p.m.. At 3 p.m. at Maplewood Recreation Field, kids kickball, followed by the annual adult East/West Turnpike Softball Tournament. From 5:30 to 7:30 p.m., it's back to the Town Green, for Cruise Night. Come and enjoy the good times. It's the last week of summer reading at the Salisbury Free Library. On Thursday at 10 a.m., it's \"Race to the Finish!\" with books about racing and relay races plus raffle drawings. Thank you to everyone who helped make summer reading happen. Library staff are always happy to assist you in finding your next book to read. Ask at the desk for recommendations. The library is open Tuesday from 11 a.m. to 7 p.m., Thursday from 9 a.m. to 4 p.m., and Saturday from 10 a.m. to 2. pm. The Friends of the Salisbury Free Library will be at Old Home Days on Saturday selling hot dogs and baked goods. Don't forget the farmers market every Monday from 3 to 6 p.m. at the Salisbury Town Hall. Fresh produce goes very quickly, pies can be ordered and picked up the following Monday. There are also farm-fresh eggs, cut flowers, homemade jams and jellies, bluebird houses, bead jewelry, woven goods, antiques, soaps and lotions, mustards and ketchup, maple syrup, handmade knitted baby sweaters, mittens and more. KATHIE DOWNES WARNERTour area farms BookEnds BookGroup will meet tonight at 4 to discuss Harry Potter and the Cursed Child, which will be released today. Professor McGonagall will be there with her chocolate-dipped pretzel wands. The Sorting Hat will come as well. Get a copy of the book, read it, and come to the book group, which is open to adults and kids. The New Hampshire Telephone Museum will hold an Alzheimer's Cafe on Thursday from 9 to 11 a.m.. More information can be found at its website and Facebook page. Upcoming performances at the MainStreet Warner Stage include storyteller Simon Brooks on Tuesday from 7 to 8 p.m. and the Kearsarge Conservatory for the Performing Arts on Saturday from 5 to 7:30 p.m.. The Warner Historal Society will give a tour of Kearsarge Gore Farm on Aug. 15 at 5 p.m. and the Vegetable Ranch on Aug. 22 at 5:15 p.m.. It will have a church service at the Lower Warner Meeting House with the United Church of Warner on Aug. 28 from 10 a.m. to noon. There will be an open house following from 1 to 3 p.m.. The Warner Historical Society's Tory Hill Author Series will present nationally known authors at Warner Town Hall, 5 E. Main St. Tickets are $10 each or four for $32 and are available at MainStreet BookEnds, online or at the door. On Aug. 20, Tomie dePaola, children's author and illustrator, will speak. One of his newest books is The Magical World of Strega Nona: A Treasury. The Warner Historical Society Barn Sale will be open Tuesday from 1 to 4 p.m. and Saturday from 9 a.m. to noon. The Warner Area farmers market will be open Saturday from 9 a.m. to 1 p.m. on the town hall lawn with local food, art and music. For more information, call 456-2319. The United Church of Warner will hold a public supper Saturday from 5 to 6:30 p.m. with ham and summer salads. Cost is $10 for adults and $5 for children 5 to 12. NEIL NEVINS WEAREDonate books to library fundraiser Weare's Old Home Day committee is calling all crafters, vendors, businesses and nonprofits to be part of Weare's Old Home Day on Aug. 27. Call Heleen at 529-7253 or email hkurk @ gmx.com for a registration form and information. Join the photo contest at Weare's Old Home Day, organized by the Weare Historical Society. The theme is Animals in Weare. There are three categories: professional, amateur and youth (under 16 years old). Photos must be submitted by Aug. 15. For details email Sue at belangersue @ comcast.net. The Weare Farmers Market will be Friday from 3 to 6 p.m. at the middle school gazebo. Bingo, hosted by the nonprofit South Weare Improvement Society, will be Aug. 20, Sept. 17 and Oct. 15 at 7 p.m., at Osborne Memorial Hall. Bingo sheets, daubers, pull-tabs and refreshments are for sale. Proceeds benefit Osborne Memorial Hall renovations, so please do not carry in. No one under 18 is allowed. Osborne Hall is for rent for special events. Call Rad at 529-7282 for more information. The Friends of the Weare Public Library have been accepting clean used books for their Aug. 20 sale Mondays from 5 to 7 p.m. and Wednesdays from 2 to 4 p.m. at the back of the Weare Town Hall. The annual book and bake sale will take place Aug. 20 from 8 a.m. to 2 p.m. in the town hall at 16 N. Stark Highway. Homemade baked goods will also be available as well as tickets for a quilt raffle. All proceeds will benefit the Weare Public Library. Library passes purchased with last year's funds included the New England Aquarium, SEE Science Center, Squam Lake Science Center and The Fells. For information, call 529-2064 or email friendsofwearepl @ gmail.com. KATERI FITTS WEBSTERSummer reading ends Karen King is now a third Wednesday of the month volunteer at the Webster Free Public Library. Thank you, Karen, for offering your help. Dorothy Haskins has volunteered to staff the Swap Shop at the Transfer Station on Wednesday mornings for a few hours. It isn't hard work and she gets to visit with friends and is helping to keep the Swap Shop open at the same time. Cribbage Players are being hunted for to start cribbage games the first Thursday each month at the Webster Town Hall at 6:30 p.m. All are welcome. The select board will meet at the Old Meeting House on Aug. 15. All are invited. Old Home Day parade and other activities will take place Aug. 20 at the Pearson Memorial Park. The chicken barbecue will take place from 4:30 to 6 p.m. and the dance will follow at the town hall. On Aug. 21, bring your picnic lunch and a chair and enjoy music while you eat in the park. Also on Aug. 21, a church service will be held at the Webster Old Meeting House at 10 a.m.. There are also rumors that horse-drawn wagon rides will be given through the Cogswell Woods in the early afternoon. A nature walk will be led by Betsy Janeway on Wednesday at the Riverdale Natural Area at 6:30 p.m.. Many thanks to <mark>Bruce Johnson</mark> for your influence in keeping the children reading during the summer. Does one ever realize how many minutes of reading goes into this program? A thank you to all children that have been doing their reading. The summer reading program finale is Aug. 15. At 6:30 p.m., Malik the Magic Guy will entertain the children. Many thanks to the Webster Free Public Library for sponsoring the story time each Monday at 6:30 p.m. DOROTHY HASKINS"}, {"articleID": "2017102004_00200519_W", "names": {"Ricardo Ramos": ["Q26611940", "Q44070424", "Q7322783"], "Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Tom Lewis": ["Q15502240", "Q21061958", "Q2352807", "Q24578293", "Q3525352", "Q55999179", "Q7816580", "Q7816581"], "De Jesus": ["Q36553259", "Q5361013"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2017-10-20", "url": "http://www.mrt.com/news/world/article/What-Puerto-Rico-is-doing-to-get-the-power-back-12292552.php", "content": "http: //www.mrt.com/news/world/article/What-Puerto-Rico-is-doing-to-get-the-power-back-12292552.php What Puerto Rico is doing to get the power back after storm Ben Fox, Associated Press Updated 11:10 pm, Thursday, October 19, 2017 Photo: Ramon Espinosa, AP Image 1 of / 10 Caption Close Image 1 of 10 In this Friday, Oct. 13, 2017 photo, a resident tries to connect electrical lines downed by Hurricane Maria in preparation for when electricity is restored in Toa Baja, Puerto Rico. A month after the storm rolled across the center of Puerto Rico, power is still out for the vast majority. less In this Friday, Oct. 13, 2017 photo, a resident tries to connect electrical lines downed by Hurricane Maria in preparation for when electricity is restored in Toa Baja, Puerto Rico. A month after the storm...more Photo: Ramon Espinosa, AP Image 2 of 10 In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers stand on towers to restore lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said Whitefish was making progress on the line that carries about 230,000 volts to San Juan from the Aguirre power plant in the south, which will vastly increase the amount of power reaching the capital. less In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers stand on towers to restore lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said Whitefish was...more Photo: Ramon Espinosa, AP Image 3 of 10 In this Thursday, Oct. 19, 2017 photo, Ezequiel Rivera works with the Electric Energy Authority to restore distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The office of Gov. <mark>Ricardo</mark> Rossello said Thursday, Oct. 19 that about 20 percent of the island has service and he has pledged to get that to 95 percent by Dec. 31. less In this Thursday, Oct. 19, 2017 photo, Ezequiel Rivera works with the Electric Energy Authority to restore distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The...more Photo: Carlos Giusti, AP Image 4 of 10 In this Sunday, Oct. 15, 2017 photo, a helicopter from Whitefish Energy Holdings flies to power line towers for repairs after the passing of Hurricane Maria in Barceloneta, Puerto Rico. The storm's path was ideal for taking down the entire grid. less In this Sunday, Oct. 15, 2017 photo, a helicopter from Whitefish Energy Holdings flies to power line towers for repairs after the passing of Hurricane Maria in Barceloneta, Puerto Rico. The storm's path was...more Photo: Ramon Espinosa, AP Image 5 of 10 In this Thursday, Oct. 19, 2017 photo, a brigade from the Electric Power Authority repairs distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The storm struck after the Authority had filed for bankruptcy in July, put off maintenance and had finished dealing with outages from Hurricane Irma. less In this Thursday, Oct. 19, 2017 photo, a brigade from the Electric Power Authority repairs distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The storm struck after...more Photo: Carlos Giusti, AP Image 6 of 10 In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers restore power lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said previous work restoring transmission lines damaged by wildfires in the western U.S. has prepared them for the Puerto Rico contract. less In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers restore power lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said previous work restoring...more Photo: Ramon Espinosa, AP Image 7 of 10 In this Thursday, Oct. 19, 2017 photo, a resident walks by Electric Power Authority worker Ezequiel Rivera restoring distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. Without air-conditioning, many residents have resorted to using washboards to clean clothes and sleeping on their balconies for relief from daytime temperatures above 90 degrees. less In this Thursday, Oct. 19, 2017 photo, a resident walks by Electric Power Authority worker Ezequiel Rivera restoring distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto...more Photo: Carlos Giusti, AP Image 8 of 10 In this Monday, Oct. 16, 2017 photo, power lines lay broken after the passage of Hurricane Maria in Dorado, Puerto Rico. A month after the storm rolled across the center of the island, power is still out for the vast majority of people as the work to restore hundreds of miles of transmission and distribution lines grinds on. less In this Monday, Oct. 16, 2017 photo, power lines lay broken after the passage of Hurricane Maria in Dorado, Puerto Rico. A month after the storm rolled across the center of the island, power is still out for...more Photo: Ramon Espinosa, AP Image 9 of 10 In this Sunday, Oct. 15, 2017 photo, power lines stand at an angle surrounded by vegetation that was torn down by Hurricane Maria in Barceloneta, Puerto Rico. Hurricane Maria's onslaught was sufficient to knock down hundreds of transmission towers and thousands of distribution poles and lines. less In this Sunday, Oct. 15, 2017 photo, power lines stand at an angle surrounded by vegetation that was torn down by Hurricane Maria in Barceloneta, Puerto Rico. Hurricane Maria's onslaught was sufficient to knock...more Photo: Ramon Espinosa, AP Image 10 of 10 What Puerto Rico is doing to get the power back after storm 1 / 10 Back to Gallery BARCELONETA, Puerto Rico (AP)--Electrical linemen descend from helicopters, balancing on steel girders 90 feet high on transmission towers in the mountains of central Puerto Rico, far from any road. At the same time, crews fan out across the battered island, erecting light poles and power lines in a block by block slog. A month after Hurricane Maria rolled across the center of Puerto Rico, the power is still out for the vast majority of people on the island as the work to restore hundreds of miles of transmission lines and thousands of miles of distribution lines grinds on for crews toiling under a blazing tropical sun. And it won't get done soon without more workers, more equipment and more money, according to everyone involved in the effort. \"It's too much for us alone,\" Nelson Velez, a regional director for the Puerto Rican power authority, said as he supervised crews working along a busy street in Isla Verde, just east of San Juan, on a recent afternoon. \"We have just so many, so many areas affected.\" The office of Gov. <mark>Ricardo</mark> Rossello said Thursday that about 20 percent of the island has service and he has pledged to get that to 95 percent by Dec. 31. For now, though, most of the island's 3.4 million people suffer without air conditioning or basic necessities. Many have resorted to using washboards, now frequently seen for sale along the side of the road, to clean clothes, and sleeping on their balconies and flocking to any open restaurants for relief from daytime temperatures above 90 degrees. \"I thought we would we have power in the metro area by now,\" said <mark>Pablo Martinez</mark>, an air conditioning technician, shaking his head in frustration. Hurricane Maria, which caused at least 48 deaths on the island, made landfall on the southeastern coast near Yabucoa as a Category 4 storm, with maximum sustained winds of about 154 mph (248 kph). It passed out of the territory about 12 hours later near Barceloneta in the north, still with sustained winds of about 115 mph (185 kph). The onslaught was sufficient to knock down hundreds of transmission towers and thousands of distribution poles and lines. The storm's path was ideal for taking down the entire grid. Most of Puerto Rico's generating capacity is along the southern coast and most consumption is in the north around San Juan, with steel and aluminum transmission towers up to 90 feet (27 meters) tall running through the mountains in the middle. At least 10 towers fell along the most important transmission line that runs to the capital, entangling it with a secondary one that runs parallel and that lost about two dozen towers in a hard-to-reach area in the center of the island. \"It reminds me of a fireball that just burned everything in its path,\" said Brig. Gen. Diana Holland, commander of the Army Corps of Engineers unit working to clear debris and restore the grid, with nearly 400 troops on the ground. The storm also struck at a terrible time. The Puerto Rico Electric Power Authority filed for bankruptcy in July. It has put off badly needed maintenance and had just finished dealing with outages from Hurricane Irma in early September. \"You stop doing your typical deferred maintenance, and so you become even that much more susceptible to a storm like Maria and Irma coming and blowing down your towers, water coming up in your substations and flooding them,\" said <mark>Tom Lewis</mark>, president of the Louis Berger Group, which has been supplying generators in Puerto Rico to clients that include the Federal Emergency Management Agency. \"Everything becomes that much more sensitive to any kind of damage whether it be from wind or water.\" PREPA Director <mark>Ricardo Ramos</mark> said the authority is working with the Army Corps of Engineers and contractors to bring in more \"bucket trucks\" and other equipment. It already has about 400 three - to five-member repair crews and is trying to reach 1,000 within three weeks with workers brought in from the U.S. \"With this number of brigades we will be able to advance much more rapidly,\" <mark>Ramos</mark> assured reporters during a recent news conference. PREPA brought in a Montana company, Whitefish Energy Holdings, to help its crews restore the transmission and distribution lines across the island. It has a rolling contract and can bill up to $300 million for its work, said Odalys <mark>de Jesus</mark>, a spokeswoman for the power authority. It is a huge job for a young company, formed in 2015. Whitefish CEO Andy Techmanski said previous work restoring transmission lines damaged by wildfires in the western U.S. has prepared them for the Puerto Rico contract. \"We don't like easy,\" he said during a break at one of the company's base camps near Barceloneta. The camp buzzes with activity as helicopters come and go, taking linemen and equipment to the mountain towers, the pilots deftly navigating the lines and mountains to lower men and equipment to the steel-and-aluminum girds high above the trees. Whitefish had about 270 employees in Puerto Rico as of midweek, working both on transmission and distribution. It expects the number to double in the coming weeks if it can find sufficient lodging and transport to the island. Other contractors working in Puerto Rico include Fluor Corp., which was awarded a $336.2 million contract from the Army Corps of Engineers for debris removal and power restoration, and Weston Solutions, which is providing two generators to stabilize power in the capital for $35 million. Their efforts are to restore the system that was in place before the storm, not to build a better one, at least not yet. Gov. Rossello says the island needs to overhaul its power grid, make it less vulnerable and look at alternative sources. He welcomed a proposal by Elon Musk, CEO of electric-car company Tesla, to expand solar energy and has raised the issue of longer-term improvements with Washington. House Speaker <mark>Paul Ryan</mark> seemed to express at least a willingness to consider helping Puerto Rico build back better when he visited the island this month. \"If you going to put up a power line let's put up a power line that can withstand hurricane-force winds,\" he said. \"It makes no sense to put temporary patches on problems that have long term effects.\" Techmanski said Whitefish was making progress on the line that carries about 230,000 volts to San Juan from the Aguirre power plant in the south, which will vastly increase the amount of power reaching the capital. \"We're getting it done,\" he said. But, asked about the goal of getting 95 percent of power back by the end of the year, he wasn't sure: \"It is very optimistic at this point.\" ___ Associated Press writer Danica Coto contributed to this report. Stay Connected Top Jobs Latest News & Sports Video Latest Stories Former GOP chair to run for county judge Diamondback CEO joins list of industry leaders supporting road...JumBurrito offers free burrito for those who vote Appeals court grants Young stay of execution Democratic lt. gov. candidate says school finance relief is...Leach about road bond: \"I am for it' Concho's Leach in center of action at A & M Road bond campaign raises more than $61,000 during first period Most Popular 1 UPDATE: Emerson Elementary lockdown lifted 2 Massive North Texas ranch goes up for sale 3 MISD spokeswoman: Emerson student recants story about weapon 4 Appeals court grants Young stay of execution 5 Halloween and Fall Celebrations 6 More than 80 children saved and 120 traffickers arrested by...7 JumBurrito offers free burrito for those who vote View Comments © 2017 Hearst Communications, Inc. ."}]