[{"date": "2015-10-30", "url": "http://www.usmagazine.com/celebrity-news/news/katie-holmes-will-address-leah-remini-scientology-on-2020-20153010", "content": "<mark>Katie Holmes</mark> Will Address Leah Remini, Scientology on 20/20 - Us WeeklyUS Weekly Tweet ABC News revealed that <mark>Katie Holmes</mark> will speak out about ex-Scientologist Leah Remini during the King of Queen star's 20/20 special on Friday, Oct. 30. Credit: Jason Merritt/Getty Images Set those DVRs! ABC News revealed on Friday, Oct. 30, that <mark>Katie Holmes</mark>, former wife of famed Scientologist Tom Cruise, will speak out about ex-Scientologist Leah Remini during the King of Queen star's much-anticipated 20/20 special. PHOTOS: Tom Cruise and <mark>Katie Holmes</mark>' relationship <mark>Holmes</mark>--who divorced Cruise in June 2012 after nearly six years of marriage--has never before spoken about Remini, let alone anything related to Scientology. ABC News' <mark>Dan Harris</mark>, who conducted the interview with Remini, told <mark>Robin Roberts</mark> and the co-hosts of Good Morning America on Friday morning that the Dawson's Creek actress will make an appearance on the special. \"You're also going to hear from <mark>Katie Holmes</mark>, the former wife of Tom Cruise,\" <mark>Harris</mark> teased. \"[And] what she is now saying about Leah .\" PHOTOS: Celeb Scientologists <mark>Holmes</mark> left Cruise in 2012, but issues from their marriage--specifically involving Scientology and their daughter, Suri--surfaced in a 2013 deposition. At the time, the Mission Impossible star was involved in a $50 million lawsuit against Bauer Publishing Company after several of its magazines wrote that Cruise had \"abandoned\" Suri. In his taped deposition, the A-list actor was asked by a Bauer lawyer if one of the reasons why <mark>Holmes</mark> filed for divorce was \"to protect Suri from Scientology .\" \"Did she say that? That was one of the assertions, yes,\" Cruise replied in the deposition. Credit: Alberto E. Rodriguez/Getty Images) As revealed on Friday's GMA segment, Remini also claims in her interview that she was once disciplined and \"written up\" by a Scientology official for an incident involving Cruise and <mark>Holmes</mark>. \"He was like, forcibly kissing <mark>Katie</mark>,\" Remini recalled to <mark>Harris</mark>. \"And I said,\" Hey, get a freaking room .' And uh, well, I was written up for that. \"Credit: Splash News Online Remini's memoir, Troublemaker: Surviving Hollywood and Scientology, will hit shelves on Nov. 3. Her 20/20 interview--including <mark>Holmes</mark>--will air Friday, Oct. 30, at 10 p.m. on ABC.", "articleID": "2015103017_00014462_W", "names": {"Dan Harris": ["Q16225310", "Q18977889", "Q2556156", "Q5213645", "Q5213646"], "Katie Holmes": ["Q174346", "Q6377464"], "Robin Roberts": ["Q1185477", "Q2041541"]}}, {"date": "2015-10-30", "url": "http://on.aol.com/video/justin-bieber-storms-off-stage-519202209?context=PC:homepage:PL1944:1446226804888", "content": "Justin Bieber Storms Off Stage http: //on.aol.com/video/bieber-storms-out-of-oslo-gig-519202209 Justin Bieber Storms Off Stage (00:49) Justin Bieber Storms Off Stage http: //on.aol.com/video/bieber-storms-out-of-oslo-gig-519202209 6,673 views VIDEO DESCRIPTION: Justin Bieber took to his Instagram page to explain to shocked fans why he stormed out of a show in Norway after just one song. He apologizes for the incident, in which he says fans didn't listen to him as he was trying to wipe up spilled water. + 01:49 ABC \"<mark>Jimmy Kimmel</mark> Live!': Hey <mark>Jimmy Kimmel</mark>, I Told My Kids I Ate All Their Halloween Candy 2015 (01:49) 04:03 ABC\" <mark>Jimmy Kimmel</mark> Live!': Harrison Ford Talks About \"Star Wars: The Force Awakens\" in a Hotdog Costume (04:03) 01:32 ABCLate Night with Seth Meyers Seth's Nephew Derrick Has a New Hobby (06:30) 01:38 CNBC Justin Bieber Storms Off Stage (00:49) MORE Aid Group: \"Yemen Hospital Bombed' (00:58) MORE & copy; 2015 AOL Inc.. All Rights Reserved Add to My ListRemove from My List Added to My List Removed from My List Did you know? By signing up, you can access your watch list and history across your other devices including mobile, tablet and Connected TV. You can sign up here. It only takes a few seconds! Did you know? By signing up, you can access your watch list and history across your other devices including mobile, tablet and Connected TV. You can sign up here. It only takes a few seconds!", "articleID": "2015103017_00133123_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}}, {"date": "2015-10-31", "url": "http://www.freepressjournal.in/jabong-ropes-in-benettons-sanjeev-mohanty-as-ceo/", "content": "Home / Business / Headlines / Latest News / Jabong ropes in Benetton's Sanjeev Mohanty as CEO Jabong ropes in Benetton's Sanjeev Mohanty as CEO--By | Oct 31, 2015 05:29 pm PTI New Delhi: Online fashion marketplace Jabong today said it has appointed Sanjeev Mohanty as its CEO and Managing Director. Mohanty, whose appointment is effective early December this year, has over 20 years of experience in the fashion industry, the company said in a statement. Prior to this, he has worked with Benetton India for over 11 years, including 8 years as Managing Director. Mohanty will play a crucial role in reviving the company's business that has lost ground to rivals like Flipkart, Myntra and Amazon India. Prior to Benetton India, Mohanty was associated with Madura Garments as General Manager and Brand Head for SF Jeans. He has also worked at Levi Strauss as Product Manager for the top wear category. \"His strong leadership skills and deep understanding of fashion and the Indian consumer, coupled with the continued commitment from GFG's shareholders, will allow Jabong to further strengthen its position as the leading online fashion destination in India,\" Global Fashion Group (parent company of Jabong) CEO Romain Voog said. While Jabong has faced issues like senior-level exits, erosion in market share, mounting losses as well as speculations of a possible sell-out over the past few months, the new team under Nils Chrestin (CFO at GFG) has been working on turning around the company. The company recently appointed <mark>Saurabh Srivastava</mark> as its chief marketing officer (CMO). Last year, Jabong investors--Investment AB Kinnevik and Rocket Internet AG--had merged the Indian online fashion retailer with four other firms to create a new global fashion e-commerce group, GFG. GFG has raised about USD 1.5 billion in capital since 2011. \"There could be no better opportunity than Jabong given its scale and consumer brand recognition...we have identified a number of growth drivers that will allow us to deliver an unparallelled experience to delight our customers and suppliers,\" Mohanty said. Lorenzo Grabau, Chairman of GFG and CEO of Investment AB Kinnevik said India is a hugely exciting market. \"GFG's shareholders and management remain committed to building Jabong to the benefit of its customers, employees and partners. We look forward to supporting Sanjeev as the company starts a new chapter this Diwali,\" he added. Share this Post:", "articleID": "2015103112_00080995_W", "names": {"Saurabh Srivastava": ["Q27975219", "Q30668231"]}}, {"date": "2015-11-01", "url": "http://kdwn.com/2015/10/31/the-latest-conforto-homers-as-mets-lead-royals-2-0/", "content": "NEW YORK (AP)--The latest on the World Series, where the New York Mets will try to pull even with the Kansas City Royals in Game 4 on Saturday night (all times EDT):--9:10 p.m. Michael Conforto's leadoff home run in the third against <mark>Chris Young</mark> and a gaffe by Kansas City right fielder Alex Rios later in the inning gave the Mets a 2-0 lead. Conforto, a rookie who did not face <mark>Young</mark> during his relief outing in the 14-inning opener, pulled an 87 mph pitch 395 feet into the right field upper deck. Wilmer Flores singled, ending an 0-for-10 Series start, advanced on a wild pitch and was sacrificed to third by Mets starter Steven Matz. Curtis Granderson hit a 254-foot fly ball to right. Rios caught it and took a casual step toward Kansas City's dugout, apparently thinking it was the final out of the inning. In the middle of his second step, he threw to the plate, but not in time to get Flores coming home from third. Kansas City asked umpires to check whether Flores left third base early. After a video review of 2 minutes, 22 seconds, the safe call on the field was allowed to stand .--8:50 p.m. Toronto's Josh Donaldson, speaking at the Hank Aaron Award news conference, was asked how he came up with his \"BringerOfRain\" Twitter handle. \"It was actually a series called\" Spartacus: Blood and Sand, \"he said .\" And the main character's name, Spartacus, and he becomes a gladiator. To make a long story short, he's fighting this guy, his name is Theokoles. He's a legend in the ring. The story is he's been stabbed a thousand times. I mean, it's crazy. To say the least, Spartacus ends up defeating him and killing him, and their country was in a drought at the time. And after he was able to defeat him, the rain had been brought. So he was called Spartacus, \"Bringer of Rain .' I thought it was pretty neat, so I stole it .\" --8:30 p.m. Edinson Volquez remains scheduled to start Game 5 for the Royals following his father's death, pending a conversation with manager Ned Yost. The pitcher was in the dugout for Saturday evening's Game 4 at Citi Field. \"I've got to sit down and talk to Edi. But we're still planning on him pitching tomorrow,\" Yost said before the game. \"He'll be here tonight, yeah. He should be here anytime .\" Volquez started the Series opener Tuesday night, hours after his father died. Volquez said he learned about his father's death when he stepped off the mound after allowing three runs over six innings. He then flew home to the Dominican Republic. \"These are huge games. Edi's been with this team all year long. He's worked so hard to get to this point,\" Yost said. \"And it was like <mark>Chris Young</mark> when his dad passed away. <mark>Chris</mark> just knew how proud his dad was of him and that his dad would want him to carry on. His dad would want him to be on that mound and helping his team win. And I imagine that Edi's dad would want the same thing .\" Volquez's father, 63-year-old <mark>Daniel</mark> Volquez, died of heart failure .--8:27 p.m. Toronto's Josh Donaldson won the American League's Hank Aaron Award and Washington's Bryce Harper was voted the NL honor. The award, established in 1999, is given to the most outstanding offensive performer in each league as determined by fans and a panel of' Hall of Famers selected by Aaron. Donaldson hit .297 with 122 runs, 41 doubles, 41 homers and 123 RBIs as the Blue Jays reached the playoffs for the first time since winning the 1993 title. Harper batted .330 with 118 runs, 38 doubles, 42 homers and 99 RBIs .--8:17 p.m. Well, plate umpire <mark>Jim Wolf</mark> came out firing. Known for a good arm--his brother is big league pitcher Randy Wolf--he tried to fire a strike when Royals starter <mark>Chris Young</mark> took the mound to begin the bottom of the first inning. Instead, Wolf tossed it right past the 6-foot-10 righty. Wolf wound up again and his second throw was right on the money. <mark>Young</mark> and Wolf seemed to smile, enjoying the moment .--8:04 p.m. Starting pitchers Steven Matz and <mark>Chris Young</mark> are ready to throw. So is plate umpire <mark>Jim Wolf</mark>. Wolf is known around baseball for tossing sharp strikes back to the pitcher after foul balls. It makes sense--his brother is major league pitcher Randy Wolf. This is Wolf's first year working the World Series, and this is his first plate job. A former pitcher in college, the right-hander was set. \"If my elbow cracks on my first throw, I'm good,\" he said. \"I'm ready. I'm here, I got to try it out .\" --6:45 p.m. Ruben Tejada thinks Chase Utley's late slide that broke his right leg was dirty. Speaking about the play for the first time since Utley ended Tejada's season in Game 2 of the NL Division Series against the Los Angeles Dodgers, the Mets shortstop said he's no longer upset over it. Using a blue cane adorned with a Mets logo giving to him by the team's owners, Tejada hung out with teammates in the dugout before Game 4 of the World Series. He says he's come to terms with what happened, even though he never responded to the message Utley sent him through captain <mark>David Wright</mark>. Tejada may never respond to Utley. But he's not angry. \"I'm really happy we're here and he's home,\" Tejada said. Tejada said he needs to be in a walking boot for two more weeks, but vows he'll be ready for spring training .--6:40 p.m.. If the scouting report on <mark>David Wright</mark> was to go after him with hard stuff, <mark>Wright</mark> made the Royals pay for that approach in Game 3. The New York Mets' captain hit a two-run homer in the first inning on a 96 mph fastball from Yordano Ventura. According to Major League Baseball's PITCH f/x computer, that was the second home run on a pitch of 96 mph or greater that <mark>Wright</mark> hit since it began tracking data in 2007. The other was against Atlanta closer Craig Kimbrel in 2013. <mark>Wright</mark> added a two-run single on a 97 mph fastball from reliever Kelvin Herrera in the sixth .--6:30 p.m. Noah Syndergaard's high-and-tight fastball to Alcides Escobar was still a hot topic before Game 4. The rookie's first pitch Friday night for the Mets was a 97 mph heater just off the inside corner and above the head of a ducking Escobar. The ball sailed all the way to the backstop, and the Kansas City shortstop went down to the dirt on his rear end. Royals players shouted angrily at Syndergaard from the dugout. After the game, the <mark>young</mark> right-hander made it clear the pitch indeed had a purpose--to make Escobar and the rest of the Royals uncomfortable in the batter's box. Syndergaard had alluded Thursday to having \"a few tricks\" up his sleeve for the aggressive Escobar leading off the game. \"I didn't expect him to throw a strike, but I didn't expect him to throw it under his chin, either,\" Royals manager Ned Yost said. \"But we've got a few tricks up our sleeves, too .\" The 6-foot-6, 240-pound Syndergaard said he certainly wasn't trying to hit Escobar. \"If they have a problem with me throwing inside, then they can meet me 60 feet, 6 inches away. I've got no problem with that,\" he said. Yost said throwing near an opponent's head is too dangerous, even if the intent is not to hit him. \"You can end a player's career by not intentionally hitting them in the head,\" the manager said. Yost views the chest as the dividing line these days for what's acceptable when pitching inside. \"You've seen us at times with <mark>Daniel Murphy</mark> pitch in on him, but it's never been up and in,\" Yost said. \"It was an acceptable thing to be able to move guys away, up top. And we've kind of gotten away from that now .\" Mets manager Terry Collins thought Syndergaard's purpose pitch set a tone. \"Hey, look, we're in this World Series, too, and we're going to get after it,\" Collins said, adding it showed Syndergaard is \"not afraid of anybody .\" Collins called pitching inside \"a lost art\" and acknowledged \"guys take a huge offense to it .\" \"But I still think it's got to be part of the game,\" Collins said.", "articleID": "2015110102_00030486_W", "names": {"Chris Young": ["Q2964901", "Q2964905", "Q2964906", "Q47541480", "Q5108544", "Q952176"], "Daniel Murphy": ["Q3014492", "Q528318"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Jim Wolf": ["Q19958282", "Q6199020"]}}, {"date": "2015-11-01", "url": "http://www.wholehogsports.com/news/2015/nov/01/cornelius-is-back-in-ua-s-mix-20151101/", "content": "Cornelius is back in UA's mix Photo by Stephen B. Thornton Arkansas receiver Jared Cornelius is tackled during a game against Tennessee-Martin on Saturday, Oct. 31, 2015, at Razorback Stadium in Fayetteville. FAYETTEVILLE--Six weeks after Arkansas receiver Jared Cornelius suffered two fractures in his left arm, the sophomore was back catching passes and punts Saturday in the Razorbacks' 63-28 victory over Tennessee-Martin. More from WholeHogSports UA football trailblazer dies \"I thought I was out for the season for sure,\" Cornelius said of the injury he sustained when he was tackled against Texas Tech on Sept. 19. \"The training staff did a wonderful job of starting me at zero and working my way back. We were just really aggressive with it and didn't baby it that much coning back .\" Cornelius had 4 catches for 33 yards and a 33-yard punt return. \"I was just trying to get back into the offense,\" he said. \"I felt a little rust here and there. I ran a couple routes that were wrong .\" Arkansas Coach Bret Bielema said he was surprised by how well Cornelius played. \"You're always concerned when someone has been sitting out for so long, but he's been able to practice the last couple of weeks fairly well,\" Bielema said. \"Even when he wasn't officially cleared to play in a game, he'd been catching balls in team periods .\" Arkansas resumes SEC play at Ole Miss next week. \"I'm ready to go,\" Cornelius said. \"This game was kind of to move me back into the offense. Now that SEC play is here I've got to step it up .\" Injury report Arkansas receiver Drew Morgan left the game in the second half to have a shoulder injury evaluated, but Coach Bret Bielema said it was more of a precautionary move and Morgan should be ready to play at Ole Miss.. Bielema said Morgan injured the shoulder earlier this season and aggravated it Saturday. \"It was good for us to get him out of there,\" Bielema said. Cornerback Jared Collins sat out the game because of what Bielema called a \"turf toe\" injury. Bielema said he expects Collins to return to practice Tuesday. Starting offensive tackle Dan Skipper missed a few plays because of an apparent right arm injury, but he returned to the game. He had ice on his arm during the fourth quarter when the backups were playing. Fullback Kendrick Jackson played Saturday after missing last week's game against Auburn because of a concussion. Tailback Rawleigh Williams, who underwent season-ending neck surgery last week, watched Saturday's game from the Arkansas sideline. He wore a neck brace but was smiling as he walked off the field. Ramirez misses game Arkansas backup free safety Santos Ramirez missed the game for an undisclosed disciplinary reason. \"We made a decision this week he wasn't going to be with us,\" Coach Bret Bielema said. \"He will be full go next week .\" 2 Hogs released Bret Bielema said receivers Jojo Robinson and Kendrick Edwards are no longer on the team and have been given their scholarship releases so they can find new schools. Bielema said he won't release them to sign with teams the Razorbacks are playing in the future. \"The good news is they've got five official visits to take a look at some other programs,\" Bielema said. \"We'll do everything we can to help them so their story ends positive .\" Bielema has said previously Robinson and Edwards have been suspended for missing classes to the extent that it jeopardizes their eligibility at Arkansas. Senior award for Allen Arkansas quarterback <mark>Brandon Allen</mark> received the Crip Hall Award, as voted on by the media, for being the team's outstanding senior in the homecoming game. Allen completed 14 of 19 passes for 265 yards and 2 touchdowns without an interception. Pulley starts Freshman cornerback Ryan Pulley made his first career start and played throughout the first half. He started in place of junior D.J. Dean, who sat out because of a toe injury. In the third quarter nickel back Henre Toliver moved over to the outside in place of Pulley and <mark>Kevin Richardson</mark> played at nickel back. Pulley was back at cornerback in the fourth quarter. Half a million Tennessee-Martin's guarantee from Arkansas for Saturday's game against the Razorbacks will be $500,000, according to the Union City (Tenn.) Daily Messenger. Many firsts The Razorbacks had a lot of firsts Saturday, including: • Damon \"Duwop\" Mitchell scoring the first touchdown for the Razorbacks when <mark>Brandon Allen</mark> connected with him on a 49-yard pass play. • Backup quarterback Austin Allen throwing his first touchdown pass, 35 yards to tight end Jeremy Sprinkle. • Tailback Juan Day getting his first carries and gaining 17 yards on 4 attempts. Flag bearers Alex Collins carried the U.S. flag and Matt Emrich carried the Arkansas flag when the Razorbacks ran onto the field before kickoff. Benny back Former Arkansas center fielder Andrew Benintendi, who helped lead the Razorbacks to the College World Series last season, was presented with the Golden Spikes Award on the field during a break in the first quarter. The Golden Spikes Award was among several national honors of Benintendi, who also won the Dick Howser Trophy and was named player of the year by Baseball America and Collegiate Baseball magazines. Benintendi is playing in the minor leagues for the Boston Red Sox, who made him the seventh overall pick in last year's draft. Playing 54 games for Class A Short Season Lowell (Mass.) and Class A Greenville (S.C.) last season, Benintendi hit .313 with 11 home runs and 31 run batted in. High five Five former Razorbacks who were NFL Draft picks watched the game from the sideline: Trey Flowers, Martrell Spaight, Chris Gragg, Tevin Mitchel and Kiero Small. Flowers (New England), Spaight (Washington), Gragg (Buffalo) and Mitchel (Indianapolis) are with teams this season. Spaight and Mitchel are on injured reserve. Vs. big boys UT-Martin fell to 1-20 all-time against Football Bowl Subdivision teams, including 0-7 against the SEC. The Skyhawks' lone victory over an FBS team came in 2012 when they beat Memphis 20-17. Sports on 11/01/2015", "articleID": "2015110109_00034620_W", "names": {"Brandon Allen": ["Q14950651", "Q24005402", "Q936391"]}}]