[{"articleID": "2018031209_00054183_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}, "date": "2018-03-12", "url": "https://geektyrant.com/news/x-men-dark-phoenix-set-photo-shows-us-the-team-in-their-comic-accurate-costumes", "content": "X-MEN: DARK PHOENIX Set Photo Shows us The Team in Their Comic-Accurate Costumes Movie Photos X-Men: Dark Phoenix Marvel about a minute ago by Joey Paur A photo from the set of director Simon Kinberg's X-Men: Dark Phoenix has surfaced online and it gives us a glimpse at the young team of X-Men wearing their comic-accurate X-Men costumes. We saw the characters sporting a version of their X-Men costumes at the end of X-Men: Apocalypse that a lot of fans were happy with, but the new costume designs in Dark Phoenix are even more fan-friendly as they look like they are inspired Frank Quietly and Grant Morrison's New X-Men. A new photo from the set includes Cyclops (Tye Sheridan), Jean Grey (<mark>Sophie Turner</mark>), Quicksilver (Evan Peters), Storm (Alexandra Shipp), Nightcrawler (Kodi Smit-McPhee), Beast (Nicholas Hoult) and Mystique (Jennifer Lawrence). There are a few other characters in the photo wearing orange suits with their backs to us. The film is set in 1992, \"roughly a decade after Apocalypse and finds the X-Men dealing with being heroes. An unfortunate side effect is how that fuels Charles Xavier's (James McAvoy) ego. He starts sending the team on more dangerous missions, including one to space that ends with Grey going to some very dark places.\" What do you think of the new X-Men suit costume designs? X-Men: Dark Phoenix is set to be released in theaters on November 2nd, 2018. Quitley-ass looking X-Men in DARK PHOENIX pic.twitter.com/zpSL1X2sB4--Xavier Files (@ XavierFiles) March 9, 2018 Joey Paur--Co-Founder / Editor of GeekTyrant.com, and if you haven't noticed I write...a lot. Movies are my passion and I live and breathe all things geek. This site is part of my life's work, it's a part of me. I love what I do, and I enjoy sharing everything I can with you when it comes to movies and geekery. In my spare time I travel to the netherworlds to battle demons. @ JoeyPaur | joeypaur @ geektyrant.com Featured Posts on GeekTyrant Thanos Rips a Moon From Space in New Photos For AVENGERS: INFINITY WAR Netflix's LOST IN SPACE Looks Great! Watch The Adventurous Full Trailer Now! Johnny Lawrence Starts Teaching Karate in New Teaser Trailer For COBRA KAI STAR WARS REBELS Producer Dave Filoni Says a New Series Announcement is Coming Soon FOX is Developing a SILVER SURFER Movie With DAREDEVIL Writer Brian K. Vaughn This New \"Pure Imagination\" Trailer For READY PLAYER ONE is Filled with So Much Awesomeness! Back to GT Homepage"}, {"articleID": "2010012716_00082962_W", "names": {"Kelly Chen": ["Q19850015", "Q270688", "Q28413320"], "Wu Ba": ["Q45476160", "Q45605076"]}, "date": "2010-01-27", "url": "http://moviestudio.wordpress.com/2010/01/27/an-empress-the-warriors-2008/", "content": "\"a scenic beauty. a movie about love, patriotism and bravery!\" the story was set in ancient china before it's unification, during which countless kingdoms battle for supremacy. yen feier (played by <mark>kelly chen</mark>) is thrust on the throne when her father is killed in a battle. feier and her loyal murong xuehu (played by donnie yen) unite to defend the kingdom. but her ambitious cousion <mark>wu ba</mark> (played by guo xiaodong) sends assasins to kill her. a mysterious man duan lan-quan (played by leon lai) saves her. feier falls in love with duan who offers her another life. with the fate of her kingdom in the balance, feier must choose between her duty and her dreams. about moviestudio thanks for visiting moviestudio!! i'm roshan kolar. i love movies. i'm mad about movies, especially the way they are made - direction, special effects, acting, staging, lighting...blah blah! i watch movies everyday, and it really fascinates me. i get new ideas, themes, stories from them and those ideas help me a lot in my profession. i'm a creative engineer and i work on ideas, concepts, and on the web. i have a huge collection of movies, and i look forward for friends who can exchange their media with mine. i believe that movies widen the boundaries of \"reach'. learning cultures, countries, languages and people turned out to be so exiting through movies. i love korean and brazilian studios - they make damn real art!"}, {"articleID": "2017051514_00561032_W", "names": {"John Bond": ["Q16106872", "Q16186593", "Q1676381", "Q21259086", "Q3181095", "Q542345", "Q54323547", "Q6222420", "Q6222422", "Q6222426"]}, "date": "2017-05-15", "url": "http://www.maravipost.com/karonga-north-west-residents-want-undule-mwakasungula-mp/", "content": "Home \"\"\"Karonga north west residents want Undule Mwakasungula to be their MP World Top News 1 Karonga north west residents want Undule Mwakasungula to be their MP By Maravi Post correspondent / Monday, 15 May 2017 02:31 PM / Leave a Comment /, Steven Simsokwe, Undule Mwakasungula / 0 views Tags: <mark>John Bond</mark> Kamwamb Mwakasungula Traditional leaders and communities from the Karonga north west constituency, have asked Undule Mwakasungula, the former executive director of the Center for Human Rights and Rehabilitation (CHRR), to become their Member of Parliament (MP) through the 2019 elections. According to them, they are ready to give Mwakasungula enough support to win the 2019 general elections. They said they are regretting why they voted for the current MP, <mark>John Bond</mark> Kamwambi, who has done nothing despite being on the government side.\" Mwakasungula has been helping us in different ways, even before he joined the CHRR. He has a loving heart to this constituency, we therefore don't want to lose his work, \"some community members said. They said they have confidence in Mwakasungula, especially because he has demonstrated to be a good leader. In his response, Mwakasungula, who is now a pastor, said he needs to ask God first, before responding to the community's call.\" My response to this is that I have heard the people's demand, but I need to pray over it first. I need to ask God if this is a mission He wants me to pursue. But it's a great honour for me to have people's trust, that I can serve them better. I thank God for all this grace, \"Mwakasungula said. The Executive Director for Karonga Youths for Justice and Development (KYJD), Steven Simsokwe said the constituency needs a strong and educated person because it is near the district town.\" This is a big constituency, it really needs to be represented by someone who is strong and educated, \"Simsokwe said. Simsokwe, one of the norther region's fearless youth activists, said Mwakasungula deserves this because of his type of leadership and care for the community .:"}, {"articleID": "2019091411_00138438_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Andrew Yang": ["Q11118258", "Q28723576"], "Jimmy Carter": ["Q23685", "Q6199776"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2019-09-14", "url": "https://www.wkar.org/post/democrats-get-closer-serious-field-trump-challengers", "content": "Democrats Get Closer To Serious Field Of <mark>Trump</mark> Challengers By Ron Elving • 5 minutes ago Share Tweet Email Democratic presidential candidates former Vice President Joe Biden, South Bend, Ind., Mayor Pete Buttigieg and Sen. Bernie Sanders of Vermont participate in Thursday's debate in Houston. Win McNamee / Getty Images There was something different about the Democratic debate this week, compared to the earlier rounds this summer. Something was happening that was hard to pin down, but palpable. Not the contrast of night and day, but perhaps the difference between dusk and dawn. It's a critical difference and it comes at a crucial time. Because the <mark>Trump</mark> presidency these candidates are competing to truncate has reached what may be a critical juncture. But more of that in a moment. This week, the Democratic nomination fight once again took the form of a TV quiz show with too many contestants to fit onscreen at once. Once again, the candidates sounded a lot alike, peddling much the same wares as in June and July. And yes, three hours was too long. Yet something different happened. The debate left a clearer imprint. The effect was at least somewhat more energizing than the summer meetings, or perhaps just a bit less dispiriting. There were still 10 candidates on stage but at least they were the candidates most people wanted to see and--best of all--there was not the prospect of 10 more contestants doing it all over on the following night. That made a difference. The earlier affairs had the feel of the NFL exhibition season, this week felt more like playing for keeps. On the substantive side, the candidate's answers and thoughts seemed more fully formed and more clearly expressed. Some of this is just practice. Some of these candidates are new to the big leagues; and veterans such as former Vice President Joe Biden and Sen. Bernie Sanders are getting used to new roles. Some of the upgrade also seemed attributable to the ABC moderators, all four of whom were crisp. They had challenging questions and they probed in their follow-ups, but they did not intrude on the dynamic among the candidates. Like good referees, they pretty much let the players play--to the benefit of all. Benefiting most were the candidates who got the most airtime--Biden, Sanders and Sen. Elizabeth Warren. Much was made of it being the first time viewers had a chance to see Biden and Warren face off--with Sanders, the other candidate consistently in double digits, right there as well. It gave Democratic consumers their best chance for a taste test to date. Among the three, Warren seemed to make the most of it. She had the freshest energy on stage, and she is getting better at pressing a point. Her share of the airtime this week was nearly 17 minutes--second to Biden, but only by a few seconds. And she was showing passion on a range of outrages rather than intellectual irritation at the way things are. She also responded to questions and to the answers of her rivals with apparent spontaneity--even when she is recycling what may be a practiced response. Most observers gave Biden, the putative front-runner, middling marks. For some, he was just OK, a left-handed compliment at best. For others, he was good enough, which isn't much better. All seemed to agree he wasn't bad. It's hard to know how Biden, soon to be 77, would look to the Democratic electorate based solely on this debate performance, given how long he's been around. Even more of a factor is the defensiveness many Democrats feel about the guy they still think has the best chance of beating President <mark>Trump</mark>. But more of that in a moment. Sanders, who is already 77, came across as every bit his age and just as irascible as he was at just 73 and challenging Hillary Clinton for the last presidential nomination. He once again made a strong case for the national health care system he calls \"Medicare for All\" --a concept that now gets at least lip service from many of his rivals, as well as pushback from a few. Even though Sanders' goal is to make the famous health program available to everybody, it is for now still primarily associated with old folks. It's likely to be the Democratic Party vehicle for getting to national health care, sooner or later, so it could use---- and likely will have--more age-appropriate champions. Still, it was Biden's age that was called into question in this debate, when he had talked about who would qualify under his amendments to Obamacare. Julián Castro, at one end of the stage, objected to what sounded like Biden contradicting himself. When Biden interrupted with a denial, Castro fired back, \"Are you forgetting already what you said just 2 minutes ago?\" Without that word \"already,\" that question might have stood on its own. Instead, it seemed a shot at Biden's age and past lapses of memory. The audience reacted with a mix of groans and applause. They took it as a shot, and it played as such endlessly on broadcast highlights and in panel post mortems. Castro may have been the victim of his own need to distinguish himself from the pack, a problem shared by all but the three candidates at center stage. He was anchoring the end of the line-up because his polls and fundraising are barely meeting the criteria for inclusion. Also in endangered status was the candidate at the other far side of the stage, Minnesota Sen. Amy Klobuchar, who continues to emphasize her \"middle of the country\" roots and middle of the road positions. Her focus on the middle surely includes the early-caucus state of Iowa, her neighbor to the south, where she needs a break out showing. Just inside from the two ends onstage were two candidates who were expected to make more noise than either has to date: one was Cory Booker, the senator from New Jersey, a tall and commanding figure who got the night's best laugh and said many eloquent things on gun violence and the status of his fellow black Americans. The Booker campaign professes to be unworried, but it is hard to fathom why Booker has not broken through in the early states or the national polls. The same might be said of Beto O'Rourke, the former congressman from El Paso whose campaign has drawn new impetus from last month's massacre in that city. O'Rourke was saluted by his rivals for his strong stance, and he had a viral moment saying: \"Hell yes we're going to take your AR-15, your AK-47,\" referring to the military-style weapons used in many recent mass shootings. That promise, however, does not reflect the position of most of the other candidates, or of the Democratic caucus in the House or the Senate. Moving in toward the centerpiece trio one found Mayor Pete Buttigieg of South Bend, Ind.,, who used every chance he got to insert thoughtful answers with a fine-chiseled edge. He used his closing remarks to say how much it had meant to his life to come out as gay and marry his husband. The fact that his age, 37, may be more of a weight for his candidacy than his sexuality is one measure of how life in America has changed. In mirroring status across the stage stood <mark>Andrew Yang</mark>, a young entrepreneur making a splash with younger voters and casting a wider net with ideas for guaranteed federal income payments (in lieu of other programs) and 100 Democracy Dollars to supplant lobbyists' actual dollars. Which leaves us with Kamala Harris the one candidate who stood aside from the threesome at center-stage but was not part of the trio on either wing. The California senator tried a good-natured jab at Biden regarding his oft-repeated ties to President Obama. It worked in its way, especially with the crowd at Texas Southern University, a historically black school. But it didn't have nearly the bite of her June debate challenge to Biden for his opposition to busing for school integration in the 1970s. One thing Harris succeeded in doing was returning the debate, again and again, to the subject of <mark>Donald Trump</mark>. One after another, the candidates would acknowledge that beating <mark>Trump</mark> was everyone's ultimate goal, an existential necessity for the party and the over-arching unifying element in this contest. Sen. Kamala Harris, tech entrepreneur <mark>Andrew Yang</mark> and former Texas Rep. Beto O'Rourke participate in the third Democratic primary debate on Thursday night. Robyn Beck / AFP/Getty Images Yet, curiously, not one candidate mentioned the impeachment debate currently raging within the House of Representatives, where most Democrats now want a formal impeachment proceeding but Speaker Nancy Pelosi does not--at least yet. Neither did anyone in the debate mention the recession jitters that polls show many Americans feeling, if only because the length of the current expansion and indications it may be ending. That's important, because recessions beat incumbent presidents more often than the opposing party's nominee does. No incumbent lost between the Depression election of 1932 and 1976, when Democrat <mark>Jimmy Carter</mark> talked of an \"economic misery index\" in ousting Republican Gerald Ford. That same index was even worse when Ronald Reagan ousted <mark>Carter</mark> four years later. George H. W. Bush also lost as an incumbent in 1992, the victim of a brief recession and an independent candidate (Ross Perot) who got 19% of the popular vote. Since then, three incumbent presidents have been re-elected and none has lost, despite the efforts of well-known, well-financed and party-backed challengers (Robert Dole, <mark>John Kerry</mark> and Mitt Romney). That is largely why polls taken this week by CNN and by NPR/PBS NewsHour/Marist found a plurality of Americans expect <mark>Trump</mark> to win a second term, even though far fewer think he deserves it. <mark>Trump</mark>'s approval number is now among the lowest ever for presidents after 20 months in office. But some have come back from comparable low points, including Obama and Reagan (who came back to win 49 states). It's going to take more than good debate performances, and more than winning the nomination, for one of these Democratic contenders to defeat this incumbent. Only bad economics, or the actions of the incumbent himself, are likely to accomplish that. But to make themselves attractive as a reasonable option, the Democrats need to present coherent, clear alternatives in policy and persona. This week's debate was at least a longer step in that direction. Copyright 2019 NPR. To see more, visit https: //www.npr.org. Share Tweet Email View the discussion thread."}, {"articleID": "2013071711_00001591_W", "names": {"Tim Brown": ["Q1735158", "Q18808538", "Q245633", "Q50579797", "Q554239", "Q56798375", "Q57514683", "Q58455196", "Q724801", "Q7803232", "Q7803233"]}, "date": "2013-07-17", "url": "http://www.local8now.com/home/headlines/Man-nearly-beaten-to-death-over-loud-music-215769581.html", "content": "A Jefferson County man is out of the hospital after he was nearly beaten to death. <mark>Tim Brown</mark> was at his house when he was beaten with a baseball bat and a crowbar. Family say it was Browns girlfriend and her son, Shannon Green, who was charged with the assault. The family says <mark>Brown</mark> was attacked because of loud music. Browns younger brother, couldn't believe what happened. He says, \"I freaked out, I, I immediately freaked out. I didn't know what to do.\" Another family member told the brother that <mark>Brown</mark> had been beaten up. He says its a good thing someone said something. \"If someone hadn't come and told me, I don't know how we would've found him,\" says the brother, who didn't want to be identified. Partly sunny, hot, isolated storms Wednesday Crimetracker: Officer fires at suspect during foot chase in Old City WVLT VOLUNTEER TV 6450 Papermill Drive Knoxville, TN 37919 Phone - (865)? 450-8888; Fax - (865)? 450-8869"}, {"articleID": "2013090211_00066335_W", "names": {"Gordon Campbell": ["Q19560195", "Q21464957", "Q627888"], "David Shearer": ["Q22348643", "Q3456546"]}, "date": "2013-09-02", "url": "http://www.scoop.co.nz/stories/AK1309/S00040/council-in-strong-financial-position.htm", "content": "Council in Strong Financial Position Interim Year End Results Shows Council in Strong Financial Position The South Taranaki District Council is on track to deliver a healthy $12 million surplus for the 2012/13 year compared to a budgeted surplus of $1.57 million according to its Interim Annual Report presented at Monday's (2 September) Policy Development Meeting. STDC Chief Executive, Craig Stevenson says the result shows the Council is in a strong financial position. \"The bulk of the surplus comes from strong earnings from our Long Term Investment Fund. It performed extremely well over the course of the year which has returned almost $8 million more than what we had budgeted. This extra revenue will be returned to the fund to build it up for those years when it doesn't perform so well,\" says Mr Stevenson. \"The really pleasing result is the $1.74 million of operational savings. These savings are largely the result of reduced contractor costs and savings in energy costs,\" he says. \"They demonstrate our commitment to running a lean and efficient organisation and being prudent with every dollar spent,\" says Mr Stevenson. Asset Sale Petition Goes Through: Govt Must Run Referendum As Soon As Possible - Greens The Government has no mandate for their programme of selling profitable state owned assets, Green Party Co-leader Dr Russel Norman said today. The Keep Our Assets coalition, which includes the Green Party, were today informed by the Office of the Clerk that the petition against the sale of New Zealand's state owned assets has the numbers to trigger a citizens-initiated referendum. \"Now that the Keep Our Assets coalition has reached the numbers needed to trigger a referendum on the asset sales programme, the Government needs to organise a referendum as soon as possible,\" Dr Norman said. Wellington: National's Motorways Driving Us To A More Congested Future Conventional Wisdom: NZIER Report Shows Just 18 More Jobs From SkyCity Deal Work For Families: \"Government Discriminates Against Low-Income Children\" <mark>Gordon Campbell</mark>: On The Police Refusal To Prosecute The GCSB The last gift from <mark>David Shearer</mark> to the National Party was his resignation, which has happily diverted the media into weeks of speculation about his successor. In the process, this has taken the heat off Prime Minister John Key over the GCSB. No Action Over Illegal GCSB Spying - Police Letters to Russel Norman The Police Investigation into the GCSB? Legal Beagle? Public Address Ponzi schemer won't be sentenced as he didn't intend to break law Town Hall To Be Restored: Decisions From Christchurch Council Meeting Hagley Oval upgrade and lease approved...Correction of rates setting irregularities...Councillors unanimously agreed the Town Hall should be fully restored, with construction expected to begin in 2014. Botchulism: Contamination Was \"No Risk To Public\" - New MPI Tests Referendum to be held on asset sales; 327,000 voters' signatures on petition Long-haul flights from Paraparaumu and a high-speed train - Jack Yan's 30-year plan 30 peak-hour buses cancelled; \"we are not perfect,\" says Zane Fulljames NZ Bus deserves to lose its contract, says regional council candidate New-technology speed camera checking all lanes in Ngauranga Gorge More motorways will increase traffic congestion in Wellington - report from Opus \"Transformational\" At Hop card to be installed on all city buses in June Police officer among nine people arrested, charged with making and selling drugs PHOTOS: First look inside Auckland's new high-speed electric trains Air Tahiti Nui's revamped A340-300 makes first landing in Auckland Council claiming credit for taking 12,000 cars off Auckland roads every morning"}, {"articleID": "2017091816_01008960_W", "names": {"Carlos Brito": ["Q2199420", "Q5041861"]}, "date": "2017-09-18", "url": "http://www.cspdailynews.com/category-news/beverages/articles/ab-inbev-ready-turn-hostile", "content": "AB InBev Ready to Turn Hostile? CEO urges SABMiller stockholders to \"voice their views\" on takeover effort By, Editor in Chief, CSP Daily News Steve Holtz October 08, 2015 <mark>Carlos Brito</mark> LONDON & LEUVEN, Belgium--The possibility of Anheuser-Busch InBev purchasing SABMiller began to drift into hostile territory this morning as AB InBev CEO <mark>Carlos Brito</mark> urged stockholders of the coveted No. 2 beer brewer to \"voice their views\" and \"not allow the board of SABMiller to frustrate this process.\" The comments came in a brief statement from AB InBev expressing surprise over the SABMiller board of directors' swift rejection of an offer--AB InBev's third bid--to purchase the London-based company for £ 42.15 per share in cash ($64.51 per share U.S.). The offer values the company at $104 billion. \"AB InBev is surprised that the board of SABMiller (excluding the directors nominated by SABMiller's largest shareholder, Altria Group Inc., who dissented) continues to say that this proposal\" still very substantially undervalues SABMiller,' \"AB InBev wrote.\" This lacks credibility because the cash proposal represents a premium of approximately 44% to SABMiller's closing share price of £ 29.34 on Sept. 14 (being the last business day prior to renewed speculation of an approach from AB InBev); and Altria Group Inc., which owns 27% of SABMiller and has three representatives on the board, has publicly stated that it supports our proposal and \"urges SABMiller's board to engage promptly and constructively with AB InBev to agree on the terms of a recommended offer .'\" SABMiller, however, said the offer \"has been timed opportunistically to take advantage of SABMiller's recently depressed share price.\" \"SABMiller is the crown jewel of the global brewing industry, uniquely positioned to continue to generate decades of stand-alone future volume and value growth for all SABMiller shareholders from highly attractive markets,\" said Jan du Plessis, chairman of SABMiller. \"AB InBev needs SABMiller but has made opportunistic and highly conditional proposals, elements of which have been deliberately designed to be unattractive to many of our shareholders. AB InBev is very substantially undervaluing SABMiller.\" Some analysts believe AB InBev making its third offer publicly--two lower previous offers were handled quietly--was a first step at riling up shareholders, allowing them to see what they are missing. But certainly encouraging them to \"voice their views\" is an effort to create unrest. \"Notwithstanding our good faith efforts, the board of SABMiller has refused to meaningfully engage with us,\" <mark>Brito</mark> said today. \"Our proposal creates significant value for everybody. How long will it be before shareholders see a value of over £ 42 in the absence of an offer from AB InBev? If shareholders agree that we should be in proper discussions, they should voice their views and should not allow the board of SABMiller to frustrate this process and let this opportunity slip away.\" Based on British law, AB InBev has until Wednesday, Oct. 14, to make the deal happen or request an extension. Related Content"}, {"articleID": "2014090205_00036724_W", "names": {"Robert Wood": ["Q1265326", "Q15052600", "Q19325396", "Q21165763", "Q22098434", "Q24566698", "Q43915973", "Q51586292", "Q7351216", "Q7351217", "Q7351220", "Q9185475"]}, "date": "2014-09-02", "url": "http://overlawyered.com/2014/09/september-2-roundup-4/?utm_source=rss&utm_medium=rss&utm_campaign=september-2-roundup-4", "content": "Police have traced the crime wave to a single micro-neighborhood in the California capital [Sacramento Bee] \"Adam Carolla Settles with the Patent Trolls\" [Daniel Nazer/EFF, Reason, related eight days earlier and previously] eBay takes on Landmark in the E.D. of Texas [Popehat] Frank Furedi on law and the decline in childrens' freedom to roam [U.K. Independent] On \"ban the box\" laws re: asking about job applicants' criminal records, it's sued if you do, sued if you don't [Coyote] Fake law firm websites in U.K. sometimes parasitize the real ones [Martha Neil, ABA Journal] What C. Steven Bradford of the blog Business Law Prof reads to keep up (and thanks for including us on list); As applications to renounce U.S. citizenship mount, many related to FATCA, our government hikes fee for doing so by 422% [<mark>Robert Wood</mark>, Forbes] Tweet Tagged as: accolades, California, child protection, criminal records and hiring, Eastern District of Texas, eBay, patent trolls, United Kingdom"}, {"articleID": "2019110218_00099753_W", "names": {"Luis Suarez": ["Q26517", "Q270367"]}, "date": "2019-11-02", "url": "http://www.breitbart.com/news/barcelona-slip-to-shock-defeat-after-levante-goal-flurry/", "content": "Valencia (Spain) (AFP)--Lionel Messi scored again but was helpless to prevent Barcelona conceding three goals in seven minutes on Saturday as Levante stormed to a surprise 3-1 victory in La Liga. Messi converted a first-half penalty at the City of Valencia Stadium for his sixth goal in five games only for Levante to stun the defending champions with an incredible treble shortly after the hour. Jose Campana and Borja Mayoral scored in the 61st and 63rd minutes before Nemanja Radoja added a third in the 68th to finish Barca off and give Real Madrid the chance to move top of the table later on Saturday. Levante climb to eighth. \"Everything unravelled,\" said Barcelona coach Ernesto Valverde. \"We didn't start the second half well, we weren't creating chances and although they weren't either they suddenly scored two goals. The third one hurt us a lot.\" After seven consecutive wins in all competitions, Barcelona arrived in Valencia as overwhelming favourites to cement their place at the summit, particularly given the irresistable form of Messi. His goal here was the 500th of his career with his left foot and it looked likely to give Valverde's team another three points until bedlam ensued in the second half. \"Opponents always play us like it is one of the biggest games of the year,\" Valverde added. \"You have to have an answer.\" After any Barcelona defeat, Valverde's future is always a topic for discussion. Asked if he was surprised by his players or might consider resignation, he said: \"No, to both questions.\" To make matters worse, <mark>Luis Suarez</mark> was forced off in the 41st minute with an injury to his right calf and would now appear to be a doubt for Tuesday's Champions League game at home to Slavia Prague. Levante started well and Barcelona were fortunate to escape a ragged few minutes that included <mark>Suarez</mark> being booked for a foul committed by Arthur Melo. Referee Hernandez Hernandez corrected his error after being made aware by VAR. Barcelona settled, long periods of possession finding a successful outlet down the left where Nelson Semedo twice slipped Antoine Griezmann in behind right-back Jorge Miramon, who then conceded the penalty. This time it was Semedo who broke clear and Miramon clipped the defender's heal, allowing Messi to sweep the spot-kick high into the corner, even if replays suggested Griezmann had been offside .--Seven-minute blitz floors Barca--<mark>Suarez</mark>'s unfortunate half continued as he was replaced by Carles Perez and Messi might have made it two before half-time only for Miramon to restore some credit by clearing the finish off the line. Levante began the second half on the front foot but nobody could have predicted what was to follow as three goals turned the game on its head. First, Pique's under-hit clearance came straight back, as Mayoral and Jose Luis Morales shifted the ball quickly inside to Campana, who struck hard into the corner. Then a loose Perez header allowed Mayoral space and he did brilliantly to curl past the outstretched right hand of Marc-Andre ter Stegen. With the home fans still celebrating, Radoja made it three. Barcelona again failed to clear and Radoja's effort might have been saved had Sergio Busquets, on as a substitute, not shot out his right leg and caused a cruel deflection. Messi thought he had launched a comeback when he bundled through and scored but the goal was ruled out after Griezmann was spotted to have been offside. That seemed to kill Barca's belief and, if anything, Levante should have made it four late on. Gonzalo Melero had only Ter Stegen to beat but he shot wide."}, {"articleID": "2015092119_00215539_W", "names": {"Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"]}, "date": "2015-09-21", "url": "http://atlantadailyworld.com/2015/09/21/poor-ciara-russell-wilsons-girl-gets-stomped-after-his-seahawks-lose-to-go-0-2/", "content": "Sep 21, 2015ByTerry Shropshire, National Correspondent About the same time that Ciara's ex-boyfriend Future and Drake were dropping the mixtape \"What a Time to be Alive,\" Ciara was getting roasted by Seattle Seahawks fans, getting the blame for quarterback <mark>Russell Wilson</mark> going 0-2 since they began dating. The Seahawks have suffered two extremely close losses and, coupled with some untimely <mark>Wilson</mark> mistakes, folks in the Great Northwest are getting restless and placing the blame on Ciara. Prior to meeting the sexy songtress, <mark>Wilson</mark> had taken his team to the Super Bowl in consecutive years, winning the title once and nearly winning the second time around. Now that <mark>Wilson</mark> and Ciara are an item, fans are rationalizing that he and the Seahawks cannot find their footing, as if the lithe lovely is single-handedly responsible for knocking the entire team off its pivot. But blame is what they are shooting at Ciara. And to make it worse, they are shoving Future's \"What a Time to be Alive\" mixtape in her face, to boot. Folks can be merciless. Take a look at the slander slung at Ciara because her boyfriend and his NFL team have yet to log a win in 2015. 1 2 3 4 5 6 7 8 9 Next page & raquo; Also On Atlanta Daily World:"}]