[{"date": "2015-11-01", "url": "http://www.wholehogsports.com/news/2015/nov/01/cornelius-is-back-in-ua-s-mix-20151101/", "content": "Cornelius is back in UA's mix Photo by Stephen B. Thornton Arkansas receiver Jared Cornelius is tackled during a game against Tennessee-Martin on Saturday, Oct. 31, 2015, at Razorback Stadium in Fayetteville. FAYETTEVILLE--Six weeks after Arkansas receiver Jared Cornelius suffered two fractures in his left arm, the sophomore was back catching passes and punts Saturday in the Razorbacks' 63-28 victory over Tennessee-Martin. More from WholeHogSports UA football trailblazer dies \"I thought I was out for the season for sure,\" Cornelius said of the injury he sustained when he was tackled against Texas Tech on Sept. 19. \"The training staff did a wonderful job of starting me at zero and working my way back. We were just really aggressive with it and didn't baby it that much coning back .\" Cornelius had 4 catches for 33 yards and a 33-yard punt return. \"I was just trying to get back into the offense,\" he said. \"I felt a little rust here and there. I ran a couple routes that were wrong .\" Arkansas Coach Bret Bielema said he was surprised by how well Cornelius played. \"You're always concerned when someone has been sitting out for so long, but he's been able to practice the last couple of weeks fairly well,\" Bielema said. \"Even when he wasn't officially cleared to play in a game, he'd been catching balls in team periods .\" Arkansas resumes SEC play at Ole Miss next week. \"I'm ready to go,\" Cornelius said. \"This game was kind of to move me back into the offense. Now that SEC play is here I've got to step it up .\" Injury report Arkansas receiver Drew Morgan left the game in the second half to have a shoulder injury evaluated, but Coach Bret Bielema said it was more of a precautionary move and Morgan should be ready to play at Ole Miss.. Bielema said Morgan injured the shoulder earlier this season and aggravated it Saturday. \"It was good for us to get him out of there,\" Bielema said. Cornerback Jared Collins sat out the game because of what Bielema called a \"turf toe\" injury. Bielema said he expects Collins to return to practice Tuesday. Starting offensive tackle Dan Skipper missed a few plays because of an apparent right arm injury, but he returned to the game. He had ice on his arm during the fourth quarter when the backups were playing. Fullback Kendrick Jackson played Saturday after missing last week's game against Auburn because of a concussion. Tailback Rawleigh Williams, who underwent season-ending neck surgery last week, watched Saturday's game from the Arkansas sideline. He wore a neck brace but was smiling as he walked off the field. Ramirez misses game Arkansas backup free safety Santos Ramirez missed the game for an undisclosed disciplinary reason. \"We made a decision this week he wasn't going to be with us,\" Coach Bret Bielema said. \"He will be full go next week .\" 2 Hogs released Bret Bielema said receivers Jojo Robinson and Kendrick Edwards are no longer on the team and have been given their scholarship releases so they can find new schools. Bielema said he won't release them to sign with teams the Razorbacks are playing in the future. \"The good news is they've got five official visits to take a look at some other programs,\" Bielema said. \"We'll do everything we can to help them so their story ends positive .\" Bielema has said previously Robinson and Edwards have been suspended for missing classes to the extent that it jeopardizes their eligibility at Arkansas. Senior award for Allen Arkansas quarterback <mark>Brandon Allen</mark> received the Crip Hall Award, as voted on by the media, for being the team's outstanding senior in the homecoming game. Allen completed 14 of 19 passes for 265 yards and 2 touchdowns without an interception. Pulley starts Freshman cornerback Ryan Pulley made his first career start and played throughout the first half. He started in place of junior D.J. Dean, who sat out because of a toe injury. In the third quarter nickel back Henre Toliver moved over to the outside in place of Pulley and <mark>Kevin Richardson</mark> played at nickel back. Pulley was back at cornerback in the fourth quarter. Half a million Tennessee-Martin's guarantee from Arkansas for Saturday's game against the Razorbacks will be $500,000, according to the Union City (Tenn.) Daily Messenger. Many firsts The Razorbacks had a lot of firsts Saturday, including: • Damon \"Duwop\" Mitchell scoring the first touchdown for the Razorbacks when <mark>Brandon Allen</mark> connected with him on a 49-yard pass play. • Backup quarterback Austin Allen throwing his first touchdown pass, 35 yards to tight end Jeremy Sprinkle. • Tailback Juan Day getting his first carries and gaining 17 yards on 4 attempts. Flag bearers Alex Collins carried the U.S. flag and Matt Emrich carried the Arkansas flag when the Razorbacks ran onto the field before kickoff. Benny back Former Arkansas center fielder Andrew Benintendi, who helped lead the Razorbacks to the College World Series last season, was presented with the Golden Spikes Award on the field during a break in the first quarter. The Golden Spikes Award was among several national honors of Benintendi, who also won the Dick Howser Trophy and was named player of the year by Baseball America and Collegiate Baseball magazines. Benintendi is playing in the minor leagues for the Boston Red Sox, who made him the seventh overall pick in last year's draft. Playing 54 games for Class A Short Season Lowell (Mass.) and Class A Greenville (S.C.) last season, Benintendi hit .313 with 11 home runs and 31 run batted in. High five Five former Razorbacks who were NFL Draft picks watched the game from the sideline: Trey Flowers, Martrell Spaight, Chris Gragg, Tevin Mitchel and Kiero Small. Flowers (New England), Spaight (Washington), Gragg (Buffalo) and Mitchel (Indianapolis) are with teams this season. Spaight and Mitchel are on injured reserve. Vs. big boys UT-Martin fell to 1-20 all-time against Football Bowl Subdivision teams, including 0-7 against the SEC. The Skyhawks' lone victory over an FBS team came in 2012 when they beat Memphis 20-17. Sports on 11/01/2015", "articleID": "2015110109_00034620_W", "names": {"Kevin Richardson": ["Q249107", "Q253621", "Q3195790", "Q6397350", "Q6397351", "Q966909"]}}, {"date": "2015-11-01", "url": "http://www.deccanchronicle.com/151102/sports-cricket/article/labourer’s-son-india’s-‘fast-bowling-future’", "content": "Share Tweet Printer-friendly version Send by email Rajasthan pacer Nathu Singh was picked by Sandeep Patil to play for Board President's XI against South Africa in the tour match. Mumbai: He is fast and is described as India's fast bowling future by a legend. All of 20, a fast bowling son of a wire factory worker in Jaipur is making the right kind of noises in the domestic cricketing circle. Nathu Singh, a fast bowler from Rajasthan, was picked by chief selector Sandeep Patil in the Board President's squad for the two-day warm-up match against South Africa before the four-Test series starting November 5. Patil believed the boy had \"the X-Factor' that selectors always search for. And that spark in Nathu was also noticed by none other than Rahul Dravid. Nathu has picked up 12 wickets for Rajasthan in his four first-class matches. After his first match, he got the attention of Gautam Gambhir who mentioned to their coach Vijay Dahiya that\" after a long time he has seen a new India material, please make sure he is not ruined by over-bowling. \"Nathu was sent in to Surana Academy in Jaipur and he made a giant leap. From the academy, he was picked for Rajasthan's U-19 team in 2013. He made his first-class debut in the ongoing Ranji Trophy and stared it with 7 for 87 against Delhi. Within three years, he was bowling to the likes of Hashim Amla and AB de Villiers at the Brabourne Stadium in Mumbai .\" My life has changed a lot. I used to watch a lot of cricket on the television as a kid. And every time I watched a fast bowler run in, I would say to myself, \"I want to bowl like this one day',\" Nathu told bcci. tv. \"I loved watching <mark>Shoaib Akhtar</mark> bowl. He was so quick. I watched him and decided that I want to bowl so fast that I break his record. And for that I have to work really hard, for which I am absolutely prepared,\" he added. When asked to describe about his bowling, Nathu said: \"Everything about my bowling is natural .\" I still bowl the same way I used to when I started playing cricket. The only thing I have learned is to adjust my length according to the pitch and the match situation. \"I have a natural in-swinger and I get away swing with the same action and angle. I am not working on any aspect regarding swinging the ball. I am only focusing on getting my lengths right. I have a few variations as well, like the back-of-hand slower one and bouncer, and the cutters. I have learnt all these on my own, bowling with the tennis ball,\" he added. What makes Nathu different from the rest is that he knows his strengths and weaknesses - something you don't expect from an young man who has just stepped out of his teenage years. \"The one weakness I have is that I tend to go haywire with my line. I just want to improve on that,\" he said. \"When I bowled with the tennis ball, my run-up consisted of two to three steps. Once I started with the leather ball, I had to increase the length of my run-up to generate that force. It took me a lot of time to adjust to a long run-up .\" It was also a challenge to get control over my swing with the leather ball. Initially, it tended to swing too far across. The coaches would ask me to bowl with a crossed seam. Gradually as I practised more and more, I got the hang of it. \"Nathu is happy to get all the media glare but his modesty makes him sad too .\" It makes me feel really happy (that everyone is backing me to make it big) but at the same time it also scares me, \"Nathu said. Pages 1 2 next' last & raquo; Tags: sports Cricket India Nathu Singh Also Read 1st Test: Pacers skittle out New Zealand for a paltry 105 as India need 407 to win Hyderabad Cricket Association all set for pitched battle\" I want to learn from <mark>Harbhajan Singh</mark>,' says girlfriend Geeta Basra <mark>Mustafa Kamal</mark> lashes out at ICC, threatens to expose dark truth", "articleID": "2015110120_00218706_W", "names": {"Harbhajan Singh": ["Q11708624", "Q19667702", "Q9475"], "Mustafa Kamal": ["Q6943273", "Q6943274"], "Shoaib Akhtar": ["Q738330", "Q7499709"]}}, {"date": "2015-11-01", "url": "http://greenevillesun.com/news/ap_national_news/search-on-for-black-box-in-wreckage-believed-to-be/article_8ed25d88-5f64-5e0e-9551-b31a143fb452.html", "content": "MIAMI (AP)--Sonar indicates that the wreckage believed to be the cargo ship El Faro landed upright on the ocean floor, which may aid efforts to recover the ship's voyage data recorder, a National Transportation Safety Board spokesman said Sunday. \"The ship will certainly not be recovered; the ship is going to stay there. The containers are too deep to do any kind of recovery mission,\" said <mark>Peter Knudsen</mark>, NTSB spokesman. \"If human remains are encountered, an attempt would be made to recover them .\" Subscription Required An online service is needed to view this article in its entirety. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 Online Subscription Current print subscribers 1 Current Subscriber Access 6-days per week, print subscribers may click this option to gain access to the e-edition. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now. You must login to view the full content on this page. Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Need an account? Create one now. kAmx? G6DE:82E @ CD 2C6 DE: = = 2H2: E:? 8 G:56 @ 4 @? 7: C> 2E: @? E92E E96 HC64 <286 7 @ F? 5 $2EFC52J:? \"d [___ 766E @ 7 H2E6C 62DE @ 7 E96 q292> 2D: D E96 t = u2C @ [H9:49 H6? E>: DD:? 8 ~ 4E]\" 5FC:? 8 wFCC:42? 6 y @ 2BF:?] p = = bb 4C6H> 6> 36CD @? 3 @ 2C5 H6C6 = @ DE] k ^ Am kAmQ (92E E96J 56E64E65 H: E9 D @? 2C H2D 23 @ FE E96 D: K6 2? 5 D92A6 @ 7 E96 t = u2C @ [Q z? F5D6? D2:5 3J E6=6A9 @? 6 H: E9% 96 pDD @ 4:2E65! C6DD] k ^ Am kAm ~? 46 E92E: D 4 @? 7: C> 65 [2 C6> @ E6 = J @ A6C2E65 [566A @ 462? G69:4 = 6 42 = = 65 r & #' \\ a \"H: = = FD6: ED G:56 @ 42> 6C2 E @ 5 @ 4F> 6? E E96 HC64 <286 2? 5 563C: D 7:6 = 5 [2D H6 = = 2D 2EE6> AE E @ = @ 42E6 2? 5 C64 @ G6C E96 52E2 C64 @ C56C--E96 D9: AVD Q3 = 24 <3 @ I] Q% 92E C64 @ C56C H @ F=5 92G6 42AEFC65 E96 4C6HVD 4 @? G6CD2E: @? D @? E96 3C:586 2D H6 = = 2D:? 7 @ C> 2E: @? 23 @ FE E96 D9: AVD 6BF: A> 6? E [:? 4 = F5:? 8 6? 8:? 6 A6C7 @ C> 2? 46 2? 5 CF556C> @ G6> 6? ED] k ^ Am kAm% 96 C64 @ C56C H @ F=5 36 @? 564 <? 62C E96 fh_\\7 @ @ E D9: AVD H966=9 @ FD6 2C62 [2? 5: ED C64 @ G6CJ H @ F=5 36> @ C6 492 = = 6? 8:? 8:7 E96 D9: A 925 = 2? 565 FAD:56 5 @ H? [z? F5D6? D2:5] k ^ Am kAmQ (6 5 @ <? @ H E96 D9: A [7C @> E96 D @? 2C\\86? 6C2E65:> 286D [5 @ 6D 2AA62C E @ 36 FAC:89 E [D @ E92EVD 6? 4 @ FC28:? 8 [Q 96 D2:5] k ^ Am kAm% 96 C64 @ G6CJ @ A6C2E: @? D 4 @ F=5 E2 <6 FA E @\" d 52JD [56A6? 5:? 8 @? H62E96C 2? 5 D62 4 @? 5: E: @? D] k^Am kAm% 96 r & #' \\ a \": D 56D:8? 65 E @ H @ C <FA E @ 2> 2I:> F> 56AE9 @ 7 a _ [___ 766E @ 7 D62H2E6C [244 @ C5:? 8 E @ E96} 2GJ]% 96 t = u2C @ H2D C6A @ CE65>: DD:? 8 62DE @ 7 E96 q292> 2D [2? 5: E 2AA2C6? E = J 42> 6 E @ C6DE 2E 2 56AE9 8C62E6C E92? E96 7:? 2 = C6DE:? 8 A = 246 @ 7 E96%: E2?:4 [H9:49 =:6 D @ G6C\" a [d __ 766E 5 @ H?:? E96? @ CE9 pE = 2? E:4] k ^ Am kAmQxEVD G6CJ [G6CJ 492 = = 6? 8:? 8 2E E9 @ D6 56AE9D] x> 28:? 6 @ A6C2E:? 8 D @> 6E9:? 8 F? 56C 23 @ FE EH @ \\2? 5\\2\\92=7>: = 6D @ 7 H2E6C H: E9 F? 56CH2E6C 4FCC6? ED 2? 5 E @ E2= 52C <? 6DD]% 96? J @ F 92G6 E96 H62E96C 2E E96 DFC7246 E @ 244 @ F? E 7 @ C [Q D2:5 y:> $E2A = 6D [2 D9: A 42AE2:? 2? 5> 2C: E:> 6 4 @? DF=E2? E 32D65:?} @ CH6 = = [| 2DD249FD6EED] k ^ Am kAmx? G6DE:82E @ CD H: = = 36 = @ @ <:? 8 7 @ C 2? J D:8?:7:42? E D:8? D @ 7 52> 286 @ C G: D:3 = 6 4 = F6D 2D E @ H96E96C E96 4C6H 925 E:> 6 56A= @ J =:76 C27ED [96 D2:5] k ^ Am kAmQ% 96C6> 2J 36 2 E6 = = E2 = 6 D:8? =: <6 96C 324 <: D 3C @ <6? @ C E92E D96VD DA =: E:? 92 = 7 2? 5 E92E 42FD65 2 BF:4 <D:? <:? 8 [Q $E2A = 6D D2:5] k ^ Am kAm% 96 t = u2C @ VD 42AE2:? 42 = = 65:? 367 @ C6 E96 G6DD6 = 5: D2AA62C65 [D2J:? 8 E96 D9: A 925 = @ DE: ED 6? 8:? 6 A @ H6C 5FC:? 8: ED G @ J286 7C @> y24 <D @? G: ==6 [u= @ C:52 [E @ $2? yF2? [! F6CE @ #:4 @]% 96 42AE2:? [|:4926 = s2G:5D @? [D2:5 E96 D9: A H2D =: DE:? 8 [2? 5 E2 <:? 8 @? H2E6C] k ^ Am kAmp? 6IE6? D: G6 r @ 2DE vF2C5 D62C49 27E6C E96 t = u2C @ VD 5: D2AA62C2? 46 7 @ F? 5 @? = J 7= @ 2E:? 8 563C: D 2? 5 @? 6 3 @ 5J:? 2 DFCG: G2 = DF: E [H9:49 H2D? @ E C64 @ G6C65] k^Am kAm% 96 t = u2C @ H2D D4965F = 65 7 @ C C6E: C6> 6? E 7C @> r2C:3362? 5FEJ 2? 5 7 @ C? 6H C6EC @ 7: EE:? 8 7 @ C D6CG:46 36EH66? E96 (6DE r @ 2DE 2? 5 p = 2D <2 [4 @> A2? J @ 77:4:2 = D 92G6 D2:5] q @ E9 E96 t = u2C @ 2? 5: ED D: DE6C D9: A H6C6 D = 2E65 E @ 36 C6A = 2465 3J EH @? 6H D9: AD] p3 @ 2C5 H96?: E 5: D2AA62C65 H6C6 7: G6 6? 8:? 66CD 7C @>! @ = 2? 5 [H9 @ H6C6 H @ C <:? 8 @? E96 C6EC @ 7: EE:? 8 2D E96 D9: A D2: = 65 E @! F6CE @ #:4 @] k ^ Am kAm}% $q:? G6DE:82E @ CD 92G6 D2:5 s2G:5D @?:? E6? 565 E @ A2DD ed>: = 6D 7C @> E96 46? E6C @ 7 E96 DE @ C>--2 C: D <J 564: D: @? [244 @ C5:? 8 E @:? 56A6? 56? E> 2C: E:> 6 6IA6CED] k ^ Am kAm000k ^ Am kAm | 2C46 = @ 4 @? EC:3FE65 E @ E9: D C6A @ CE 7C @> q @ DE @?] k^Am & copy; 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Thank you for reading 12 free articles on our site. You can come back at the end of your 30-day period for another 12 free articles, or you can purchase a subscription at this time and continue to enjoy valuable local news and information. If you need help, please contact our office at 423-638-4181. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 Online Subscription Current print subscribers 1 Current Subscriber Access 6-days per week, print subscribers may click this option to gain access to the e-edition. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now.", "articleID": "2015110122_00085169_W", "names": {"Peter Knudsen": ["Q16633153", "Q27893614", "Q3900875"]}}, {"date": "2015-11-02", "url": "http://marinij.com/general-news/20151102/fbi-and-shrimp-boy-chow-set-to-clash-in-epic-sf-trial", "content": "News FBI and Shrimp Boy Chow set to clash in epic SF trial Tony Serra, defense attorney for Raymond \"Shrimp Boy\" Chow, holds a flier for a \"Free Shrimp Boy\" T-shirt last year outside the federal courthouse in San Francisco. (LiPo Ching/Bay Area News Group) By Howard Mintz, Bay Area News Group, @ hmintz on Twitter Posted: #Comments Leland Yee, the former state senator, leaves the federal courthouse in San Francisco in July after accepting a plea bargain in the corruption and gun trafficking investigation. (Laura A. Oda/Bay Area News Group) SAN FRANCISCO>> From the day last year that FBI agents swooped down on former state Sen. Leland Yee and dozens of other targets of the sprawling crime and corruption probe dubbed \"Operation Whitesuit,\" one central figure made it clear he would not go down easily. Raymond \"Shrimp Boy\" Chow. While Yee and every other defendant hunkered down and worked behind the scenes to cope with the U.S. Justice Department's sweeping racketeering indictment, Chow, the reputed head of San Francisco's Chinese crime syndicate, went public with his indignant claims of innocence. J. Tony Serra, a San Francisco defense lawyer famed for taking on the government, even held a news conference in his offices the week of the March 2014 arrests, handing out \"Free Shrimp Boy\" T-shirts to make his jailed client's case. This week, the collision course between Chow and federal prosecutors will finally reach its climax in federal court in San Francisco. Both sides will pick a jury for a trial that will decide racketeering charges against Chow ranging from gun trafficking to murder--and also serve as a referendum on the government's five-year undercover sting operation, which relied on wiretaps, informants, bags of cash and booze-filled meetings in fancy hotels and restaurants to snag the FBI's quarry, including Yee. \"It's all a gamble,\" said San Rafael resident Rory Little, a former federal prosecutor who is a professor at the University of California, Hastings College of the Law, in San Francisco. \"Until the play opens, you don't know how it will end. But when (Serra) makes these arguments, juries like him. If they like him, they hear him on how it's on the big, bad government .\" When the trial begins in earnest Nov. 9, jurors will certainly hear two competing stories. Federal prosecutors will depict Chow as a violent gang leader with a long history of overseeing Chinatown's crime scene. Chow's lawyers will try to sell him as a reformed criminal who turned straight only to be framed by federal agents trying to justify one of the longest and most expensive undercover probes in recent Bay Area history. And given that Yee and other key defendants in the case already have pleaded guilty to racketeering charges and await sentencing, it may be the public's only full glimpse of the government's operation. The \"Dragonhead' Federal prosecutors do have plenty of ammunition. In a sweeping federal indictment alleging dozens of crimes, prosecutors portray Chow as the leader, or\" Dragonhead, \"of an Asian organization called the Ghee Kung Tong that law enforcement agents say was involved in drug and gun trafficking and money laundering, as well as trafficking in stolen booze and cigarettes. Advertisement Charges added to the case in October also now link Chow to the murders of at least two alleged gang rivals, one gunned down in San Francisco in 2006 and the other found dead with his wife in Mendocino County two years ago. During the course of the undercover probe, Chow allegedly accepted thousands of dollars in cash for a variety of crimes from FBI agents posing as businessmen and gangsters, according to court papers. The 55-year-old Chow also has previously served federal prison time for racketeering and other crimes. He was sentenced to 24 years in federal prison in 2000, but served only three years after cooperating in the government's case against another reputed Asian organized crime figure .\" Dave' the FBI agent But defense lawyers plan to put the government itself on trial, particularly the lead undercover FBI agent, who met repeatedly with Chow, plying him with drinks and handing him envelopes of cash in posh spots such as the Hotel Nikko in San Francisco. The agent is only identified as \"Dave,\" denigrated in Chow's court papers as \"suffering from logorrhea and a generous dollop of Tourette's disorder as well .\" Defense lawyers say the recently added murder charges are a late, desperate move to bolster the government's case, relying on what they describe as dishonest informers who've cut deals with prosecutors. \"It is so far astray from legitimate law enforcement it doesn't make any sense,\" said Curtis Briggs, who is aiding Serra in the defense. \"It's a cops-and-robbers game gone wrong .\" The trial is unlikely to delve much into the political corruption allegations against Yee, who was charged with accepting bribes in exchange for political favors. But it is expected to touch on the origins of the investigation, which only stumbled upon Yee as the FBI probe into Chow's dealings connected the ex-legislator with a number of figures, including San Francisco political consultant <mark>Keith Jackson</mark>, who also has pleaded guilty to racketeering. The direct ties between Yee and Chow in the indictment are tenuous, other than an allegation the legislator agreed to back a resolution praising the Ghee Kung Tong organization for campaign cash, but <mark>Jackson</mark>'s involvement with Chow led the FBI to the senator--and the pursuit of the bribery aspect of the probe. \"A workable strategy' James Brosnahan, <mark>Jackson</mark>'s lawyer, said the Chow trial can shine a light on what he considers a wayward investigation that should be reviewed by the Justice Department. And Brosnahan believes a Bay Area jury may be receptive to Serra's fiery style of characterizing the government as worse than the crimes it is pursuing .\" It is a workable strategy, \"said Brosnahan, also a high-profile Bay Area defense lawyer .\" I've not seen a case where the government had a sting operation that lasted this long, cost this much money and went at people who otherwise would not be involved in this kind of thing. \"Little, however, cautions that Chow must do more than simply attack the government for the FBI's tactics .\" It's not a powerful argument to just say the government spent a lot of money, that they spent (many) years on this, \"he said .\" (Racketeering laws) were invented to prosecute Mafia bosses. The allegations here boil down to Shrimp Boy Chow being a Chinese gang Mafia boss. There is no question Shrimp Boy was the main target. \"", "articleID": "2015110214_00181439_W", "names": {"Keith Jackson": ["Q6384543", "Q6384545", "Q6384546"]}}, {"date": "2015-11-03", "url": "http://thedailyjournal.com/story/news/2015/11/03/1st-district-goes-all-democrat/75093702/", "content": "Share This Story! Let friends in your social network know what you are reading about FacebookEmail Twitter Google + LinkedIn Pinterest 1st District goes all Democrat 1st District Assembly race ends Post to Facebook 1st District goes all Democrat 1st District Assembly race ends Check out this story on thedailyjournal.com: http: //vineland.dj/1Nqbk2o {##} CancelSend Sent! A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CONNECT TWEET LINKEDIN COMMENTEMAILMORE The 1st Legislative District is moving back to full Democratic Party control as unofficial vote totals for Tuesday's election show Assemblyman <mark>Robert</mark> Andrzejczak and his first-time running mate, <mark>Robert Bruce</mark> Land, finishing in the top two spots. Land, who made his first political foray with his candidacy for the Assembly, said he was surprised and excited at the unofficial results declaring him a winner. \"It feels great,\" Land said. \"I didn't know what to expect but it's been a great ride. I'm excited--I'm ready to do this .\" Land added, \"I'm really going to enjoy working with Bob .\" Republican Assemblyman Samuel Fiocchi, in his first term as a state lawmaker, was the target of an extensive negative ad campaign that criticized his ethics as a businessman as well as a legislator. His running mate, Cumberland County Freeholder James Sauro, also caught part of the Democratic attack late in the campaign. \"What you saw in this election, you actually saw a party buy an election,\" Sauro said. \"I'm disappointed because seriously, when I look at our opponents, I really do believe they are not even close .\" State Sen. Jeff Van Drew had handpicked Andrzejczak, who first was appointed to an unexpired term in 2013, and Land, a retired state corrections department captain. Andrzejczak, a Middle Township resident, won his first full term later in 2013, the same year Fiocchi won. Senators did not have to run for election this year, but Van Drew was a strong presence in the race on both sides. The Assembly slate proudly ran as \"Team Van Drew\" while Republicans accused the senator of blocking legislative cooperation with Fiocchi. The 2015 race was unusual in that three of the four candidates were only are from the same county but the same city--Vineland. The district encompasses all of Cape May County and parts Cumberland and Atlantic counties. Like Andrzejczak in his first race, as well as this one, Land was introduced to voters with a heavy emphasis on his record as an Army combat veteran. Land saw action in the Vietnam War, escaping wounds but picking up numerous medals including two Bronze Stars. He grew up in Millville but has spent most of his adult life in Vineland. Andrzejczak, who also had not held office prior to becoming an assemblyman, lost a leg to an explosion while serving in Iraq. Fiocchi is a member of the family that built Lee Rain Irrigation, a firm well known in and out of New Jersey. He parted with that business but is active in others, including real estate. Sauro, who owns a second-generation plumbing business, has served widely spaced terms as a Cumberland County freeholder over the past decade and a half. He and Fiocchi briefly served as together on the freeholder board. Joseph P. Smith; (856) 563-5252; jsmith @ gannettnj.com CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //vineland.dj/1Nqbk2o", "articleID": "2015110403_00113306_W", "names": {"Robert Bruce": ["Q26265218", "Q30604152", "Q43393721", "Q43910743", "Q53475332", "Q7342438", "Q7342439", "Q7342441", "Q7342444", "Q7342446", "Q7342447"]}}, {"date": "2015-11-04", "url": "http://feeds.huffingtonpost.com/c/35496/f/677045/s/4b3b49ca/sc/28/l/0L0Shuffingtonpost0N0C20A150C110C0A40Cfirst0Elook0Efantastic0Ebeasts0Eand0Ewhere0Eto0Efind0Ethem0In0I84719120Bhtml/story01.htm", "content": "Here's Your First Look At The \"Harry Potter' Prequel\" Fantastic Beasts And Where To Find Them' Accio prequel! Cole DelbyckEntertainment Writer, The Huffington PostPosted: 11/04/2015 09:38 AM EST | Edited: 16 minutes ago Eat your heart out, Harry Potter. The film version of J.K. Rowling's \"Harry Potter\" prequel, \"Fantastic Beasts and Where to Find Them,\" has been shrouded in secrecy ever since the project was announced in 2013. That is, until now. Entertainment Weekly's newest cover star is Newt Scamander, the movie's protagonist and world renowned magizoologist (a person who studies magical creatures) played by Oscar-winner Eddie Redmayne, who sets out on an adventure in 1926 New York. Entertainment Weekly Things to note: Redmayne is sporting Scamander's signature briefcase and standing in the hallowed halls of the Magical Congress of the United States of America (or MACUSA), the magical governing body for the American witches and wizards. <mark>Colin Farrell</mark>, Samantha Morton, Ezra Miller and Katherine Waterston are also set to join Redmayne on the magical adventure. The official title design for \"Fantastic Beasts and Where to Find Them\" was released on Tuesday on the film's Instagram account with a mysterious caption that reads, \"Prepare yourself for the beasts are coming .\" ", "articleID": "2015110415_00058182_W", "names": {"Colin Farrell": ["Q11691305", "Q172035", "Q2982593", "Q5145080"]}}, {"date": "2015-11-05", "url": "http://www.morningstar.com/advisor/t/110745801/sotheby-s-auctions-a-377-million-portion-of-taubman-estate.htm", "content": "Sotheby's Auctions a $377 Million Portion of Taubman Estate Sotheby's Auctions a $377 Million Portion of Taubman Estate 11/05/2015 Sotheby's kicked off a major round of fall sales in New York Wednesday by auctioning a $377 million portion of the estate of its former owner, Michigan shopping-mall magnate A. Alfred Taubman. Sotheby's fought hard to win the consignment--guaranteeing the estate for a little over $500 million--and it heavily marketed the sale, the first of four to feature his holdings, as a memorial to Mr. Taubman's artistic taste. But spotty bidding and a few unsold pieces damped the mood in Sotheby's York Avenue saleroom, turning the night into a dogged jog more than a victory lap. The sale eked past the low bar of Sotheby's $375 million and $537 million expectations, but its total includes its fees, unlike its presale estimates. It remains to be seen whether the house will break even on its deal with Mr. Taubman's heirs, but Chief Executive Tad Smith said, \"We remain on track to cover most of the total guarantee .\" The star of the sale was \"Paulette Jourdain,\" Amedeo Modigliani's demure portrait of his dealer's housemaid and girlfriend, which sold to an Asian telephone bidder for $42.8 million, well over its $25 million estimate. Before the sale, dealer <mark>Helly Nahmad</mark> said the 1919 portrait looked like a bargain compared with some of the Italian modernist's other portraits that have sold for as much as $69 million. (Rival Christie's plans to ask $100 million for a Modigliani nude next Monday .) Sotheby's also sold a chartreuse-and-cherry-colored abstract by Willem de Kooning for $25 million, its low estimate. Mr. Taubman bought the work from a gallery a year after the artist painted it in 1976. Sotheby's also reset the auction high bar for Frank Stella when it sold his red geometric abstract, \"Delaware Crossing,\" for $13.7 million, over its $12 million high estimate. But a gray-black <mark>Jasper Johns</mark> abstract, \"Disappearance I,\" estimated to sell for $15 million didn't garner any bids, and no one wanted Edgar Degas's sensuous portrait of a nude woman brushing her red hair after taking a bath, \"Nude Woman, Back .\" It also carried $15 million estimate. Elsewhere in the sale, a pair of Mark Rothko abstracts met with so-so results: \"No. 6/Sienna, Orange on Wine\" selling for $17.6 million and \"Untitled (Lavender and Green)\" selling for $20.4 million. Both were estimated to sell for at least $20 million. What does Mr. Taubman's sale portend for the art market overall? Collectors and dealers will likely wait to see how Sotheby's fares Thursday with its impressionist and modern art sale before making any lasting rulings.", "articleID": "2015110506_00037065_W", "names": {"Helly Nahmad": ["Q18748764", "Q23759490"], "Jasper Johns": ["Q155057", "Q16236800"]}}]