[{"articleID": "2016093004_00581256_W", "names": {"Anthony Steen": ["Q14202166", "Q4773519"]}, "date": "2016-09-30", "url": "http://www.usatoday.com/story/sports/nfl/2016/09/30/dolphins-depleted-offensive-line-pushed-around-in-22-7-loss/91309300/", "content": "FacebookEmail Twitter Google + LinkedIn Pinterest Dolphins' depleted offensive line pushed around in 22-7 loss Miami's depleted offensive line had a tough time all around during a 22-7 loss to Cincinnati on Thursday night Post to FacebookDolphins' depleted offensive line pushed around in 22-7 loss Miami's depleted offensive line had a tough time all around during a 22-7 loss to Cincinnati on Thursday night Check out this story on USATODAY.com: http: //usat.ly/2dr8uLKCancelSend A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Dolphins' depleted offensive line pushed around in 22-7 loss AP12:33 a.m. EDT September 30, 2016Miami Dolphins quarterback Ryan Tannehill, center, is sacked by Cincinnati Bengals defensive tackle Geno Atkins (97) during the second half of an NFL football game, Thursday, Sept. 29, 2016, in Cincinnati. (AP Photo/Frank Victores) (Photo: The Associated Press) CINCINNATI (AP)--Geno Atkins simply shoved Dolphins guard Jermon Bushrod backward into Ryan Tannehill, knocking him down. The Bengals defense tackle then gently touched the quarterback down, one final indignity on a rough night. Miami's depleted offensive line had a tough time all around during a 22-7 loss to Cincinnati on Thursday night. And given the health of their blockers, the Dolphins (1-3) have a real challenge ahead. \"We've got to get it fixed and quick, and by that I mean Monday,\" Tannehill said. \"We're kind of in a dark spot right now. It's squarely on our shoulders.\" It was so bad that during the first three quarters, Bengals receiver A.J. Green had more yards than the entire Miami offense. Green piled up 166 yards on catches, while the Dolphins managed only 152 total yards. Tannehill was 15 of 25 for 189 yards with a touchdown, an interception, five sacks and a fumble. The Dolphins' running game--one of the NFL's worst--managed only 62 yards. \"Some of the plays were not ideal, as far as what we were doing,\" coach Adam Gase said. \"Some were busted protections. Ryan has to step up on the fumble. It's everybody taking their turn. I don't think it really mattered who was out right now. We couldn't get out of our own way.\" Tannehill had been a bright spot lately. He threw for 319 yards and three touchdowns during a win over Cleveland on Sunday, his second straight game with more than 300 yards passing. He had been sacked only one time in the last two games despite throwing 84 times. On Thursday, he threw a 74-yard touchdown pass to Kenny Stills on Miami's second play of the game, but did little else the rest of the way. Miami finished with 222 total yards. It wasn't all Tannehill's fault. The patchwork line had trouble giving him time. \"Not everybody was on the same page,\" Gase said. \"All of a sudden he looks like he doesn't know what he's doing.\" There was a reason for the problems--Miami had a lot of players in different positions. The Dolphins were missing four starting offensive linemen, two linebackers, running back Arian Foster and tight end Jordan Cameron. Left tackle Branden Albert and center <mark>Anthony Steen</mark> were inactive with sprained ankles suffered during the win over Cleveland. Center Mike Pouncey has missed all four games with a hip injury. \"We have to put it all together and figure out what we do well and start working on that a little more,\" Gase said. ___ CONNECTTWEETLINKEDINCOMMENTEMAILMORE Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2013082018_00021685_W", "names": {"Craig White": ["Q3526919", "Q47128766"]}, "date": "2013-08-20", "url": "http://advanced-television.com/2013/08/20/ezyflix-ott-debuts-in-australia/", "content": "OTT movie retailer Access Digital Entertainment has launched its EzyFlix video on demand and UltraViolet service in Australia, claiming to be the first Australian company to be able to offer viewers the ability to download movies from all of the major Hollywood studios. The service will compete with Quickflix, Telstra and the recently-launched JB Hi-Fi offering, among others. Up to five devices can be registered under one account, with users able to swap devices in and out, with the possibility of syncing in the future. \"When you buy a specially marked video file from EzyFlix, it will be added to your UltraViolet locker. What movies include this is determined by the studios, not EzyFlix, but it will soon include TV shows,\" advised EzyFlix CEO <mark>Craig White</mark> at the launch. The service will be contract free, with no monthly fees. Users can choose between streaming a movie as a rental or buying it and being able to download it for offline viewing. TV episodes can be bought individually, or an entire season can be purchased. New release movies will cost A $5.99 (? 4.06) to rent a standard definition version and A $6.99 for HD. Purchasing the SD file costs A $24.99, while the HD version will cost some A $29.99."}, {"articleID": "2010122718_00308982_W", "names": {"Mark Hollis": ["Q1389589", "Q17462827", "Q6768076", "Q6768078"]}, "date": "2010-12-27", "url": "http://mlive.com/spartans/index.ssf/2010/12/michigan_state_players_staff_c.html", "content": "michigan state players, staff comfy at capital one bowl despite 40-degree temperatures orlando, fla.--michigan state athletic director <mark>mark hollis</mark> said things are going smoothly for the 299 people, including 101 football players, who came in the official spartans travel party. \"this is old hat for us,\" <mark>hollis</mark> said. michigan state is playing a bowl game at citrus bowl stadium for the third time in four years. this time it's the capital one bowl against alabama on new year's day. \"everything is going smoothly,\" <mark>hollis</mark> said while sporting a new msu and capital one bowl logo pullover to ward off the wind and 40-degree temperatures at the spartans' practice today at freedom high school. \"it's supposed to warm up, but everybody still seems happy to be here.\" the spartans played in the champs bowl in 2007 and the capital one bowl here in 2008. the area around the team hotel and practice facilities are familiar, especially to the upperclassmen, including 17 seniors who will be playing their last game. the msu practice session had a very similar look as practices on campus at home, just with a few palm trees in the background. reporters from alabama marveled at the music that coach mark dantonio allows the team to listen to on a sound system during early sessions of practice and stretching. alabama coach nick saban apparently doesn't allow music at his practices. msu sports information personnel and players still were chuckling about quarterback kirk cousins and his arrival at practice on sunday when harsh winds whipped and the wind chills made it feel like it was 20 degrees outside. stories with the most comments in the last 7 days. michigan state stunned by texas in first non-conference home loss in 7 years michigan state left searching for identity after loss to texas ends non-conference play michigan state hosts texas in search of \"marquee win' before big ten play begins michigan state could benefit from harsh suspensions of ohio state's terrelle pryor, others? 2010 michigan live llc. all rights reserved. use of this site constitutes acceptance of our"}, {"articleID": "2017101214_00543931_W", "names": {"James Milner": ["Q191136", "Q57324227"], "Alberto Moreno": ["Q4712132", "Q4712133", "Q57542702"]}, "date": "2017-10-12", "url": "http://www.irishmirror.ie/sport/soccer/soccer-news/6-things-spotted-liverpools-training-11331836", "content": "Sport 6 things spotted from Liverpool's training session ahead of huge Manchester United clash The Reds have struggled recently in the league, winning only one of their last four games Share Comments Thomas Bristow 15:03, 12 OCT 2017 Updated 15:24, 12 OCT 2017 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email The international break is over and the majority of Liverpool's stars have returned to training - and just in time. Jurgen Klopp's side face a titanic clash against an unbeaten, in form Manchester United side at Anfield on Saturday. The Reds have struggled in the Premier League recently, winning just one from their last four games. However, it's not uncommon for form to go out the window in these sorts of games - and Liverpool will be desperate for a win over their bitter rivals. Here are six things we spotted in their training session leading up to the big clash. Nervous, Jurgen? How Klopp would love a win at Anfield over Mourinho (Image: Andrew Powell/Liverpool FC via Getty Images) Klopp enters the training ground with his band of merry men sporting something of a nervous smile. A victory over United would be the perfect way for his side to get back on track. The return of Firmino? The Brazilian could do with a confidence booster (Image: Andrew Powell/Liverpool FC via Getty Images) Firmino's poor form led him to being dropped against Newcastle last time out. Looking sharp in training, the Brazilian could well be back in the starting XI for Saturday's lunch-time clash. Matip the main man \"More of that, Matip!\" (Image: Andrew Powell/Liverpool FC via Getty Images) Liverpool's frail defence is by no means a secret and Romelu Lukaku and co will be looking to exploit it in any which way they can. Joel Matip will be heavily relied upon for Saturday and crunch tackles like the one above will be much appreciated by the Anfield faithful. He's SmilINGS Ings has been linked with a move to Newcastle (Image: Andrew Powell/Liverpool FC via Getty Images) The 25-year-old's Liverpool career has been blighted with injuries and he's recently been linked with a move to St. <mark>James</mark>' Park. All smiles in training, could Ings come back to rescue Klopp in his time of need? The perfect Daniel Sturridge photo? Did Sturridge waste his chance against Newcastle? (Image: Andrew Powell/Liverpool FC via Getty Images) Could there be a better photo representing Sturridge's current situation at Liverpool? The 28-year-old failed to make an impact against Newcastle and could find himself back on the bench against United. <mark>Moreno</mark>'s fine form continues <mark>Alberto Moreno</mark> has kept <mark>James Milner</mark> out of the Liverpool starting XI this season (Image: Andrew Powell/Liverpool FC via Getty Images) Unlike Sturridge, <mark>Alberto Moreno</mark> is having a brilliant time at Liverpool. The Spaniard even scored a scorpion kick in training. <mark>Moreno</mark>, whose Liverpool career looked to be over last season, has featured nine times for the Merseyside outfit this campaign. poll loading What's your prediction for Saturday? 1000 + VOTES SO FAR Liverpool win Man United win Draw for me, Jeff! Like us on Facebook Follow us on Twitter Daily Newsletter irishmirrorsport Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Premier League Manchester United FC Liverpool FC Barclay's Premier League"}, {"articleID": "2018041913_00367686_W", "names": {"Al Murray": ["Q4704500", "Q6000623"]}, "date": "2018-04-18", "url": "http://rss.cnn.com/~r/rss/edition_europe/~3/KH6z_cORxUY/index.html", "content": "Beyond the bars: How rugby is reforming Italian prisoners By Alan Dymock, for CNN Updated 1040 GMT (1840 HKT) April 18, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. Photos: Italian rugby's governing body, Federazione Italiana Rugby (FIR), has introduced rugby in 15 prisons across the country. Hide Caption 1 of 7 Photos: It's part of a wider social project to help reform certain reaches of society. The first game was played in 2010 and has been a huge success. Hide Caption 2 of 7 Photos: The project began with La Drola Rugby (in red) in Turin, with help from former Italy international player Walter Rista. Hide Caption 3 of 7 Photos: \"There were hundreds of spontaneous inmates requests to be included in the team--from Turin as well as from other penitentiaries around Italy,\" says Rista after the project was launched. Hide Caption 4 of 7 Photos: The values of respect, cohesion, and responsibility--all epitomized by rugby--are helping reform the inmates. Hide Caption 5 of 7 Photos: There are hopes in the future to grow the resources funding the program. This could improve players' access to medical treatment, better nutrition and training equipment. Hide Caption 6 of 7 Photos: In one Turin jail, the tendency to reoffend in rugby-playing inmates is about 25% compared with normal figures of about 70%. Hide Caption Alan Dymock is the Features Editor for Rugby World magazine. (CNN) They might live behind bars, but rugby has given prisoners in Italy a new-found freedom. A unique project has taken the sport into 15 jails across the country and its benefits are having a huge impact on inmates, both while in prison and when they are released. \"Rugby's values are perfectly fitting with inmates' needs for rehabilitation\" Stefano Cantoni, Italian Rugby Federation (FIR) In one Turin jail, the tendency to reoffend in rugby-playing inmates is about 25% compared with normal figures of about 70%, according to Ovale Olte le Sbarre (Rugby Beyond the Bars), which is behind the scheme. \"The aim is to contribute, through the concrete application of rugby's values--respect for the rules, for your adversary, for the referee, for the supporters--to the resocialization of detainees,\" says Stefano Cantoni of the Italian Rugby Federation (FIR), which is backing the project. Read More \"The results so far demonstrate the undoubted beneficial effects on the human relations within the prisons, through a new appreciation of each other. It also offers a new network that can be invaluable for inmates' reintegration into civil society.\" Photos: Hong Kong Sevens 2018 It's perhaps the biggest party in the world of sport...Hide Caption 1 of 11 Photos: Hong Kong Sevens 2018 The annual Hong Kong Sevens, which this year was held from April 6-8, is loved by rugby fans and players alike, regularly attracting as many as 120,000 spectators. Hide Caption 2 of 11 Photos: Hong Kong Sevens 2018 Asked about the key to enjoying the event, comedian <mark>Al Murray</mark> once said: \"You just have to hand yourself over and not worry about what time of day or night it might be.\" Hide Caption 3 of 11 Photos: Hong Kong Sevens 2018 No wonder there is a saying in Hong Kong: \"If you ever get bored of the sevens, you can turn around and watch the rugby.\" Hide Caption 4 of 11 Photos: Hong Kong Sevens 2018 The Hong Kong Sevens dates back to 1976, with Fiji boasting more wins than any other country. The island nation picked up a record fourth-straight victory at the 2018 tournament. Hide Caption 5 of 11 Photos: Hong Kong Sevens 2018 From small beginnings, it's now a truly global affair, with 28 teams in total at the ground this year. Hide Caption 6 of 11 Photos: Hong Kong Sevens 2018 \"What is incredibly special is that the city shuts down for it,\" says England sevens veteran James Rodwell, describing the sight of rugby-hungry fans in the stadium for three whole days as \"humbling.\" Hide Caption 7 of 11 Photos: Hong Kong Sevens 2018 World famous for the atmosphere it generates, the Hong Kong South Stand does not stop jumping all weekend. Hide Caption Photos: Hong Kong Sevens 2018 Fancy dress is a must. Hide Caption 9 of 11 Photos: Hong Kong Sevens 2018 With the 40,000 seater stadium a vibrant mix of color and noise, Hong Kong's atmosphere has set a precedent for other World Series tournaments, most notably London and Las Vegas. Hide Caption"}, {"articleID": "2019012416_00152399_W", "names": {"Kim Jones": ["Q25249302", "Q30122482", "Q6408927", "Q6408928", "Q6408929", "Q6408931", "Q6408932"], "Matthew Williams": ["Q11881525", "Q16214685", "Q1646990", "Q20795041", "Q24041573", "Q30317038", "Q3299581", "Q47813338", "Q48815671", "Q57424282", "Q6789527", "Q6789532", "Q6791433"], "Alexander Wang": ["Q251068", "Q705844"]}, "date": "2019-01-24", "url": "https://www.highsnobiety.com/p/purses-for-men/", "content": "The crowds outside menswear shows in Paris are always a good hint of what's going to be the talk of the industry in the months to come. Last week we saw plenty of great' fits, but Frank Ocean and his large green Celine bag were a particular show-stealer. Snapped outside Louis Vuitton, the sleek leather Phoebe Philo-designed tote contrasted against the singer's casual combo of bright orange puffer, jeans, and beanie. It showed how the attitude toward bags in menswear is changing. You don't have to look femme or overdressed to sport a sizable accessory traditionally associated with women's fashion. In recent years, bags for men have gone from something almost taboo to one of the hottest trends, and the biggest industry players are keen to jump on board. In Milan, Fendi presented men's versions of the label's signature Baguette and Peekaboo bags, and a collaboration with Japanese luggage expert PORTER. A hybrid of a side bag and handbag in red, blue, and champagne-colored nylon with a golden F clasp, the Baguette is certain to be a sought-after model. At <mark>Kim Jones</mark>' Dior in Paris, almost every outfit was complemented by a bag: the new cross-body men's version of Dior's Saddle bag in silky nylon; neck wallets and small hard-case tube-shaped bags; soft fur bags; and more understated messenger-style numbers with metal buckles by <mark>Matthew Williams</mark> of ALYX. Highsnobiety / Eva Al Desnudo 4 more Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Previous Next At Prada, meanwhile, there were already covetable black nylon backpacks, and Loewe had sleek crocodile clutch bags, large leather totes, and variations of the label's hit Puzzle bag. For Fall/Winter 2019, almost every major fashion house had an updated it-bag for men, but few had worked on theirs as thoroughly as Virgil Abloh. In less than a year at Louis Vuitton, he has given us numerous versions of the Keepall: glow-in-the-dark; iridescent; semi-transparent neon pink and yellow; soft gray, and oversized black monogram-embossed in puffer material. This season also also gave us medium and purse-like mini versions of Louis Vuitton's signature retro travel trunks. Historically, men and bags have had a complicated relationship. Google the two words together and you'll find anxiety-laden questions along the lines of \"Are man bags acceptable?\" \"Can a man carry a purse?\" \"How to wear a man bag?\" and \"What do you put in a man bag?\" In the past, the rigid idea of masculinity allowed a backpack, a briefcase, or ideally nothing at all, stuffing your essentials into one's pockets. In fact, the very term \"man bag\" is an awkward attempt at emasculation. Louis Vuitton 4 more Louis Vuitton Louis Vuitton Louis Vuitton Louis Vuitton Previous Next Attitudes started to shift a few years ago. That went hand in hand with the rise of streetwear and was influenced by street culture references and ’90s fashion. First fanny packs and then side bags became a menswear staple. It was a no-brainer, a combination of simple utilitarian design and practicality. The overwhelming success of outdoor and skate brands' versions were perhaps a turning point--think Patagonia, The North Face, Supreme, and Palace. It proved that in the menswear and streetwear markets, a bag can be a token of hype and obsession as much as the Birkin bag was for the Sex and the City generation of women. The side bag trend is still going strong, with the likes of Gucci, A-COLD-WALL *, and Burberry continuing to expand the range. The popularity of side bags was followed by the growing influence of even more masculine workwear and military designs: chest rigs (pioneered by ALYX), harnesses, and belt bags. The designs often played with fetish elements and added a bit of structure to relaxed sportswear silhouettes. The shift we witnessed on this season's runways, however, is bigger. Previously, men's bags were worn mostly as yet another garment and left hands-free, but now we're talking handbags and shoulder bags, styled and worn exactly as women do. As seen with Ocean's Celine tote, women's bags and purses are becoming more acceptable in men's wardrobes. Highsnobiety / Julien Tell 4 more Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Highsnobiety / Julien Tell Highsnobiety / Julien Tell Previous Next \"I can't believe men/guys/boys are wearing girly stuff and I actually couldn't be happier. We are in some fun times,\" photographer Mordechai Rubinstein wrote recently on Instagram. \"A while back I posted a guy wearing a women's LV purse cross body. He took the strap from any old bag and put it on his mother's old purse.\" As a major driving force in contemporary fashion expression, hip-hop culture plays an integral part in this process. Tyler, the Creator has been rocking classic Chanel purses for a couple of years (check out dusty pink here or pale blue here). It feeds into the broader gender-bending fashion experimentation happening in hip-hop right now--think A $AP Rocky's Gucci babushka scarf or Young Thug's frilly blouses. Hip-hop culture has come a long way in challenging toxic masculinity while continuously incorporating an obsession with luxury fashion labels. If rappers are carrying Chanel purses, it's going to end up on the street soon enough. At the same time, the rise of the men's it-bag is also simply business. Bags are one of the largest sources of revenue for global luxury labels, so the math is simple: get men to buys bags and you'll sell twice as many bags. With consumption habits increasingly shaped by the more gender-neutral space of streetwear, the younger generation is becomes more comfortable with genderless shopping when it comes to accessories. View this post on Instagram Fendi might have been founded by Adele Casagrande & Edoardo Fendi, but it was Karl Lagerfeld who created the iconic inverted Zucca (or Double F) that everyone recognizes today. \"I drew the Double F in 3 seconds,\" he recalls in a 2013 documentary. \"It became the acronym of the house.\" ??: @ asap__r1cky @ highsnobietystyle #hsfacts A post shared by HIGHSNOBIETY (@ highsnobiety) on Jan 15, 2019 at 9:25 am PST Today, labels are trying to grasp the shifting meaning of luxury. The gender binaries of luxury fashion are blurring, but that can mean a curious migration of status symbols from womenswear to menswear and back again. \"Last year, we argued that sneakers had replaced handbags as the biggest status symbol in women's fashion,\" wrote Highsnobiety senior staff writer Lia McGarrigle recently. \"Looking to flex? A hard-to-get pair of kicks will impress a lot more than an off-the-rack <mark>Alexander Wang</mark> bag. It's not crazy to think the opposite could soon become true for men.\" In these uncertain times, luxury is a fluid business. Sometimes it's about inventing something new, sometimes it's about picking up something old like a classic Chanel purse and giving it a new spin. It seems the only thing that's left is deciding what to call it. Subscribe a cold wall alyx asap rocky burberry fendi frank ocean Louis Vuitton porter tyler the creator 1232 Shares Share Tweet Email WhatsApp Comments Words by Anastasiia Fedorova anastasiia_f anastasiia_fedorova Anastasiia Fedorova is a writer and curator based in London, contributing to Dazed, i-D, 032c, GARAGE, BoF, SHOWstudio and The Guardian among other titles. Read Full Article"}, {"articleID": "2012061900_00069051_W", "names": {"Eric Holder": ["Q312644", "Q3591180"]}, "date": "2012-06-19", "url": "http://news4jax.com/news/education/UNF-9-other-universities-seek-max-tuition-hike/-/1877054/15149628/-/xco7w5/-/index.html", "content": "unf, 9 other universities seek max tuition hike in filings with the board, every institution except the university of florida asked the governors for the maximum increase allowed under the state's \"differential tuition\" law. uf decided to ask for a 9 percent increase after president bernie machen and some of the school's trustees expressed unease with going to the full 15 percent. the university of south florida initially told the board it would seek a 15 percent increase, but later trustees decided it will instead ask for an 11 percent increase. but the universities' requests also include forecasts that, without additional state funding, the schools will likely ask for 15 percent increases again in the 2013-14 and 2014-15 budget years, though those predictions are not binding and are tied to built-in assumptions about future state spending. the forecasts don't include uf, because its board voted on its request later than other universities. the board of governors is expected to vote on the recommendations thursday, at the end of three days of meetings that will include in-depth reviews of each university's plan for the next three years. many of the universities stressed the benefits of the additional tuition dollars they have received in recent years and the added funds they would draw down under the plans. florida a & m university, for example, said it was able to offer 859 classes that otherwise wouldn't have been offered during the 2011-12 school year without differential tuition dollars. florida international university wrote that it would use $13.3 million to hire undergraduate faculty with an eye on increasing graduate rates. that would be by far the lion's share of the money, with only $12.3 million earmarked for financial aid coming close. on the other hand, universities warned of dire consequences if the board doesn't approve their requests. \"there will be a significant negative impact on availability of required general education course sections, students' ability to obtain required courses, resulting in inability to continue education, larger class sizes, decreased graduation rates, increased time to degree and excess hours from taking unnecessary courses if required courses are not available,\" famu wrote. florida atlantic university said it would be forced to cut 75 faculty positions, nine advisors and 500 classes if the differential tuition increases aren't approved. and the university of central florida said its already-rising class size would increase even faster. \"without differential tuition, the university of central florida's ability to continue to provide high-quality access to undergraduate degrees is at risk,\" the request says. florida state raised the specter of an increasing exodus of faculty members, lured to other states by higher salaries. the requests from universities also show how the schools have used the 30 percent of the funding required to be devoted to need-based financial aid. in some cases, the amounts given to individual students vary widely, with 752 students at florida gulf coast university receiving anywhere between $50 and $6,482. the average award at fgcu was $1,847. the push comes at the same time that scott has pushed universities not to boost tuition. in a radio interview earlier this month, scott--who is set to meet with the board on tuesday--repeated his hesitance about increase the costs of college. \"we cannot continue to raise tuition constantly on the backs of our families,\" scott told 97.3 the sky radio in gainesville. \"they cannot afford it ....i'm against raising tuition.\" copyright 2012 by news service of florida and news4jax.com. all rights reserved. this material may not be published, broadcast, rewritten or redistributed. a new offer of justice department records from a botched gun investigation might not be enough to stop a motion to cite attorney general <mark>eric holder</mark> for contempt of congress, a house committee chairman said monday. obama and putin discuss syria, other topics during two-hour talk google: \"alarming' rise in censorship requests microsoft unveils surface tablet to rival ipad roger clemens found not guilty of perjury hospitalizations up for kids with hypertension late goal sends spain through with italy transcripts show zimmerman, wife discussing finances"}, {"articleID": "2014100519_00027021_W", "names": {"Juan Mata": ["Q168740", "Q41839093"], "Tony Hibbert": ["Q310040", "Q7822568", "Q7822569"]}, "date": "2014-10-05", "url": "http://www.navhindtimes.in/chelsea-dump-arsenal-united-edge-everton/", "content": "Chelsea dump Arsenal, United edge Everton LONDON: Chelsea went five points clear at the top of the Premier League after a 2-0 win at home to Arsenal in a fiery all-London clash on Sunday. Eden Hazard gave Chelsea a 27th-minute lead with a coolly-taken penalty after he had been brought down in the box by Gunners defender Laurent Koscielny. Diego Costa's ninth goal in seven Premier League games after an excellent lofted through-ball from former Arsenal favourite Cesc Fabregas sealed Chelsea's victory 12 minutes from time. Kick-off at Stamford Bridge was delayed by 15 minutes as officials slowed the entry of Arsenal fans into the away end after a flare was set off. There was a flare-up of a different kind when Arsenal manager Arsene Wenger clashed with Jose Mourinho on the touchline, the Frenchman pushing his Portuguese counterpart to one side before the feuding bosses were separated. Chelsea then saw goalkeeper Thibaut Courtois leave the field with suspected concussion following a collision with Arsenal's Alexis Sanchez. Victory saw Chelsea go five points clear of second-placed reigning champions Manchester City and meant Wenger was still left searching for his first win against a Blues side managed by Mourinho in what was his 12th attempt. This defeat, Arsenal's first in the Premier League this season, left the Gunners nine points off top spot. It also extended their miserable away record at their English title rivals, with the Gunners now having won six points from 21 league matches at the home grounds of top five clubs. Earlier, Radamel Falcao's first goal for Manchester United secured a 2-1 victory over Everton. Colombia striker Falcao-signed on loan for a reported 10 million euros (£ 7.8 million, $13.1 million) on transfer deadline day-marked his fourth United appearance by scoring from inside the box after getting on the end of Angel di Maria's long-range shot in the 62nd minute. Argentina midfielder di Maria had given Louis van Gaal's side a 27th-minute lead when he curled in a shot from just inside the penalty area after an excellent pass from <mark>Juan Mata</mark>. Everton could have equalised on the stroke of half-time after they were awarded a penalty when Luke Shaw brought down <mark>Tony Hibbert</mark>. But Leighton Baines's spot-kick was too close to David de Gea, who dived to his right to make a fine one-handed save-the first of several fine stops. However, Baines recovered his composure to whip in a superb cross from which Gary Naismith headed Everton level 10 minutes after the break. Stoppage-time saw de Gea preserve United's lead with two impressive saves to deny Everton substitutes Leon Osman and Bryan Oviedo. The result meant United had their first back-to-back successes under Dutch manager van Gaal following last week's 2-1 victory at home to West Ham. \"David de Gea was fantastic,\" van Gaal told the BBC. \"It was not easy for him because he had a lot of players in front of his view. Despite that he stopped good and speedy shots.\" Turning to his new goalscorer, the manager said: \"Falcao was forcing himself last week against West Ham. I told him to be satisfied about his performances and that the goals are coming. The goals are coming!\" Everton's defeat was compounded by John Stones being carried off on a stretcher late on-placing a question mark over the defender's participation in England's upcoming Euro 2016 qualifiers with San Marino and Estonia. \"John Stones has an ankle ligament problem. It's too early to know the extent of it but it must be something serious for him to come off,\" said Everton manager Roberto Martinez. Christian Eriksen's 40th-minute shot from the edge of the box was good enough to give Tottenham Hotspur a 1-0 win at home to high-flyers Southampton-the club Spurs manager Mauricio Pochettino left before moving to White Hart Lane in pre-season. Pak Taliban switches side; vows to send jihadists to help ISIS...33 mins ago ISIS document disclose plans to seize Iran's nuclear secrets ..."}, {"articleID": "2010012213_00106413_W", "names": {"Bill Richardson": ["Q15521863", "Q18737044", "Q311782", "Q4910632", "Q52904363"]}, "date": "2010-01-22", "url": "http://wcax.com/global/story.asp?s=11863873", "content": "new mexico attracts green building manufacturer by susan montoya bryan associated press writer santa fe, n.m. (ap) - a company that manufacturers sustainable building products for the construction industry is moving to the gallup area, which state officials claimed as proof they're making good on their word to bring more jobs to new mexico's rural areas. gov. <mark>bill richardson</mark> gathered economic development officials at the state capitol on thursday to announce that c/d2 enterprises is setting up shop north of gallup. the company plans to start manufacturing this spring and will hire about 40 workers over the next three years. \"these are exactly the kinds of jobs that we're working to attract to new mexico, especially in the more rural parts of the state,\" the governor said. \"our doors are open. new mexico is open for business.\" <mark>richardson</mark> used the opportunity to send a message to legislators meeting for a 30-day session to continue supporting tax credits and other incentives that attract companies and jobs. \"these are working, they're bringing jobs,\" <mark>richardson</mark> said of the incentives. \"let's not mess with these.\" despite the economic downturn and the state's budget woes, the governor said the state has announced 200 jobs for rural new mexico in recent weeks and plans to announce an additional 100 soon for southeastern new mexico. he declined tooffer additional details. <mark>richardson</mark>'s administration contends the incentives are responsible in part for creating jobs and keeping the state's unemployment rate below the national level. new mexico's unemployment rate was 7.8 percent in november, unchanged from the previous month but up from 4.6 percent a year ago. the national rate is around 10 percent. statistics from new mexico's labor department show, however, that job growth in new mexico has declined by 3 percent over the past year, representing a loss of more than 25,000 jobs. new mexico is not alone. all states have reported declines in job growth over the past year, the department said. state lawmakers are being cautious as they consider how to deal with a $600 million budget shortfall while being pressured by the administration and industry groups to continue providing tax credits and other incentives. sen. eric griego, d-albuquerque, said the state must ensure it is getting a return on its investment. \"the problem isn't whether or not these incentives work. the problem is...there is no way of quantifying how much the incentives are costing per job created and retained,\" he said. griego said the incentives are beneficial when companies pay a living wage, offer benefits and have a long-term commitment to staying in the community. when companies pay low wages and have no commitment, griego said: \"frankly, they're just using the taxpayer.\" the owners of c/d2 enterprises said their jobs will pay as much as $23 per hour and they are committed to the gallup community. the location near interstate 40 allows quick transport of their products to military bases and other customers in the southwest. state officials said the company is benefiting from more than $367,000 in job training funds, capital outlay money and high-wage tax credits."}, {"articleID": "2020013120_00077151_W", "names": {"Robert Stivers": ["Q18158878", "Q7350085"], "David Osborne": ["Q16733868", "Q57819678"]}, "date": "2020-01-31", "url": "https://www.seattletimes.com/business/company-looking-to-build-mill-embroiled-in-internal-dispute/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all", "content": "FRANKFORT, Ky. (AP)--An aluminum company planning to build a $1.7 billion plant in Appalachia announced a management shakeup as it tries to complete financing for a long-promised Kentucky project staked to millions in taxpayer money, but the company's top executive later disputed that he had stepped down. The boardroom drama began when Braidy Industries said Thursday that its chairman and CEO, Craig Bouchard, would step down from that role but remain a member of the company's board of directors. The company offered no reason for the change, which comes at a crucial time for efforts to build the mill near Ashland. Bouchard disputed the company announcement Friday, saying on social media that he did not authorize the company release and had not relinquished his job. The company said in the release that its current president, Tom Modrowski, had been named interim CEO and current board member Charles Price would serve as board chairman. The company didn't immediately respond to Bouchard's comments disputing the shakeup. Braidy said in the Thursday release that the shakeup comes as the company enters \"its final fundraising stage.\" \"Tom and the board will continue to focus our efforts on completing fundraising and planning for construction of the Ashland mill,\" Price said in the Thursday release. Advertising Despite those assurances, the Kentucky Senate's top leader expressed uncertainty Friday when asked if he remains confident the project will come to fruition. \"Until it gets built, you always have to have concerns,\" Senate President <mark>Robert Stivers</mark>, a Republican, told reporters. Bouchard had been the public point man for the project--long touted to bring a badly needed infusion of jobs to a struggling region. The company has said it will create 1,500 construction jobs and more than 650 full-time jobs once the plant starts production. The mill is to be built not far from where Ohio, Kentucky and West Virginia meet on the Ohio River. The Bluegrass State also has a financial stake in the project. In a rare move, former Republican Gov. Matt Bevin persuaded the state legislature to approve a $15 million investment in the project, making taxpayers partial owners of the planned mill. The state investment sparked a legal fight, led by the Courier-Journal, for records detailing the company's finances. Gov. Andy Beshear's administration recently released those records. Advertising Word of the company's shakeup brought responses from the top levels of state government. \"We were previously advised of these changes and it is our understanding they do not impact the current status of the project.\" Beshear spokesman Sebastian Kitchen said in a statement before Bouchard's social media post disputing the company announcement. The governor's office later said it didn't have any additional information to share. Beshear ousted Bevin in last year's election. Republican House Speaker <mark>David Osborne</mark> noted that local officials near the planned mill remain confident that the project is moving forward and will be completed. \"I know this governor's office is committed to seeing it through,\" the speaker said. \"It's a project that's going to mean generational change for that area.\" <mark>Osborne</mark> also spoke before Bouchard's social media comments. Braidy's Kentucky project drew widespread attention when the company forged a partnership with Russian aluminum giant Rusal, which previously faced U.S. sanctions for connections to a Russian oligarch. BRUCE SCHREINER"}]