[{"articleID": "2018060605_00077363_W", "names": {"Doug Parker": ["Q5300803", "Q5300806"]}, "date": "2018-06-06", "url": "http://www.chinchillanews.com.au/news/airfares-could-get-more-expensive-due-to-rising-fu/3434722/", "content": "Airfares may rise as airlines cope with the rising cost of crude oil, airline bosses say. Travel Airfares are about to get more expensive by Lauren McMah 6th Jun 2018 3:26 PM BAD news, budget travellers: the price of flights is about to get more expensive, according to the bosses of several major airlines. At an annual meeting of the International Air Transport Association (IATA) in Sydney this week, a hot topic for airline bosses and delegates has been the skyrocketing price of oil, which is at its highest since 2014 - and rising at a faster rate than ticket prices. With fuel making up around 25 per cent of an airline's costs, they will be forced to drive up the price of their fares to cope, American Airlines chief executive officer <mark>Doug Parker</mark> warned. He added that as carriers looked at ways to drive fuel efficiency, they may also consider reducing the capacity of their aircraft - which may mean there are fewer seats to pick from, Fortune reports. It's not the first time Mr <mark>Parker</mark>, who leads the world's largest airline, has warned about having to pass on the rising cost of fuel to passengers. \"Oil is our second-largest expense. So when it increases, the cost of air travel increases,\" he said in April. \"I would expect you would see higher fares to consumers over time.\" Air New Zealand chief executive Christopher Luxon echoed that warning in Sydney this week. \"At this point with rising fuel, you control costs, raise prices and you may have some fall off in demand and reduce capacity,\" Mr Luxon told Reuters. The boss of American Airlines has been warning for months that passengers may have to start wearing the skyrocketing cost of fuel. Picture: Lynne Sladky/Associated Press \"I think we are seeing pricing move up internationally and certainly yields come up as well.\" Brent crude is trading at around $99 a barrel, up nearly 50 percent from a year ago, Reuters reports. Some airline companies, such as China Eastern Airlines, have signalled plans to hedge oil while others, like Emirates and Delta, ruled it out. Aviation chiefs and economists at the IATA conference suggested hedging did not avoid the inevitable impact of rising fuel costs. \"Whilst most of us have hedging in place, that hedging eventually runs out or gets replaced by new positions you have got, and it is a question then of what do you do?\" Virgin Australia Holdings Ltd CEO John Borghetti told Reuters. \"If you look at history, typically some of that cost has to be passed on at some point because you just simply can't absorb it.\" Between mid-2014 and early 2015, lower oil prices ushered in an era of lower airfares and bigger growth for airlines. This year, the price of oil is expected to average more than $91.40 a barrel. The IATA had been expecting it to reach only $78.40. The association has now revised its estimated overall industry profits to $44.6 billion, which is 12 per cent lower than it originally forecast in December. \"We have seen a rise in the fuel cost now for almost 15 months,\" IATA chief executive officer Alexandre de Juniac said. \"Usually you see an impact on fares 10 to 12 months after, but for the moment I have to say the fuel increase has not been passed on in fares.\" Will it happen? Mr de Juniac said that was up to the airlines. \"It is also an individual decision by each airline to decide whether or not they want to increase the fares to reflect the increase in fuel costs,\" he said. The lower fuel prices of recent years also helped spur a higher-than-projected growth in passenger demand. That was also likely to change, said Peter Harbison, executive chairman of Sydney's CAPA Centre for Aviation. \"If they are forced to start raising prices, that traffic growth could very quickly disappear at the same time that profits disappear,\" he said. Airline bosses have also voiced concerns labour and infrastructure costs could also contribute to the end of a three-year run of unusually high returns for the airline industry. Still, the IATA expects passenger air travel to expand by 7 per cent in 2018. That rate is more sluggish than the 8.1 per cent growth recorded in 2017, but it's faster than the 20-year average of 5.5 per cent, for the sixth consecutive year. aeroplane Read More Login to follow editors picks Read More Login to follow fuel costs Read More Login to follow travel Read More Login to follow aeroplane editors picks fuel costs travel"}, {"articleID": "2010091317_00139747_W", "names": {"Craig Williamson": ["Q1138706", "Q58326116"], "Matt Smith": ["Q1882744", "Q20713866", "Q24809160", "Q27074050", "Q30123100", "Q312385", "Q3299556", "Q3852033", "Q40281443", "Q43091034", "Q54152850", "Q6789356", "Q6789357", "Q6789358", "Q6789359", "Q6789360", "Q6789363", "Q6789364", "Q6789365", "Q6789366", "Q6789367", "Q6789368", "Q6791245"]}, "date": "2010-09-13", "url": "http://stuff.co.nz/taranaki-daily-news/sport/4125040/Surf-gear-sale-to-send-team-to-champs", "content": "surf gear sale to send team to champs a garage sale of all things surfing will take place this month to fundraise for young taranaki surfers attending the national scholastic champs next month. \"it's going to be a surfboard-swap type of thing. people bring boards and we charge them $10 to sell it and then they get the money for it,\" team manager brian kettle said. the garage sale, which will run from 8am to 3pm on september 25 at the fitzroy hall on beach st, is not restricted to surfboards and people are also welcome to sell wetsuits and surf accessories. the money raised will help the 12-strong team get to gisborne for the week-long champs, which will cost each member about $3500. \"we would like to raise a million, but really a grand or two would be good,\" said kettle, who has two sons in the team. while taranaki is famous for its surf and has produced several national champions, the province has never won the teams event, which collates points from individual placings to find an overall winner. however, surfing taranaki executive officer <mark>craig williamson</mark> said the talent in this year's team could be enough to make the difference. \"i think we have a very strong team, with a good chance of coming in the top three, <mark>williamson</mark> said.\" we have a good shot at it [coming first]. \"the taranaki team is: under-14 girls, nam northcott (shgc); u-14 boys, toa mcdonald, te rapai barbarich-love, mahorahora mcleod (waitara high); u-16 girls, eloise stevens (shgc); u-16 boys, josh kettle, sean kettle (npbhs), eli mcdonald (waitara high); u-18 girls, kendra heartly (npghs), casey stevens (shgc); u-18 boys, toby watt (opunake high), <mark>matt smith</mark> (npbhs). blanton <mark>smith</mark> is a witt journalism student ad feedback"}, {"articleID": "2009012908_00017263_W", "names": {"Mark Evans": ["Q12795898", "Q14946841", "Q16194528", "Q16210885", "Q20090670", "Q358208", "Q43006927", "Q46585872", "Q57561127", "Q59219170", "Q6767546", "Q6767547", "Q6767549", "Q6767552"]}, "date": "2009-01-29", "url": "http://dailypost.co.uk/news/north-wales-news/2009/01/29/north-wales-mental-health-unit-won-t-hit-homes-bid-55578-22805478/", "content": "north wales mental health unit \"won't hit homes bid' mental health unit\" won't hit homes bid' a multi-million pound day hospital for older mental patients will not affect future housing developments, claim planners. wrexham maelor hospital wants to build a two-storey older adult mental health unit off the northern side of croesnewydd road, close to hospital residential accommodation. it will have 28 in-patient beds and a 16-place day hospital and therapy spaces and will go before wrexham county borough council's planning committee on monday for approval. the proposal includes minor amendments to the site plan already approved for the adult mental health unit which adjoins the site. but concerns have been raised that the plans may compromise the application for housing nearby by morris homes. objectors claim the proposals are \"unclear\" and the scale, mass, bulk and character of the multi-storey could compromise the adjacent land the suspended ramp to the car park is described as unconventional and may raise health and safety concerns and could compromise problems of flooding on adjacent land. the car park should be set back to ensure no risk of flooding. but wrexham planners said: \"the building is of a high quality design and existing and proposed landscaping will ensure it is not overly dominant.\" they say it is also environmentally friendly. highway engineers are also satisfied it will not make traffic congestion worse. \"a previous permission allowed a two tiered decking system and this proposal seeks to provide an additional four levels,\" say planners. \"concern has been expressed from owners/developers of adjoining land at maesgwyn road that the car park may impact on future development which is subject of a current application. given the height of the development, proposed and existing screening and the distances to proposed development, over 60m, the car park will not have any significant impact on future residential amenity or in the wider landscape,\" say planners. meanwhile full details of a proposal for a residential care home for 72 elderly mentally infirm residents, on the former jacques garage site off mold road, will also go before the council for approval subject to conditions. the site, close to wrexham general station, was previously approved for apartments. but with little interest in regenerating the site for housing, planners believe the scheme would be an ideal opportunity to develop a key site near wrexham's town centre. the report to councillors said: \"the current application is one of two outline applications for extra care and emi residential care home on the former jacques site.\" a partnership between pennaf housing group and the council has submitted a formal bid to the welsh assembly government to provide \"social housing grant' for the new extra care scheme.\" this bid is currently under consideration and it is anticipated funding will be approved this year. \"a key part of this scheme is the close relationship of the new extra care scheme and the care home is that certain aspects of the accommodation will be closely linked and shared between the two developments.\" keep up to date with the news. sign up for news alerts <mark>mark evans</mark> home with andrew lloyd webber ahead of eurovision final"}, {"articleID": "2009071205_00008931_W", "names": {"Michael Clarke": ["Q1428440", "Q16203034", "Q16227744", "Q57942480", "Q6829291", "Q6829292"], "Mahendra Singh": ["Q30602009", "Q52691317", "Q58460315"], "Sabyasachi Mukherjee": ["Q59189513", "Q7396501"]}, "date": "2009-07-12", "url": "http://blog.taragana.com/n/delhi-metro-bridge-collapse-three-killed-107013/", "content": "new delhi - at least three labourers were killed and seven others injured when an under-construction delhi metro rail corporation (dmrc) flyover collapsed in lajpat nagar area in south delhi early this morning. the incident was reported from near lady shri ram college in lajpat nagar around 5:00 am. according to sources, the under-construction bridge fell on a water pipeline, which led to some flooding in the area. july 12th, 2009 new delhi - five people were killed and 14 injured when an underconstruction bridge of the delhi metro collapsed in south delhi early sunday, officials said. the accident took place at around 5 a.m. july 12th, 2009 new delhi - an underconstruction bridge of the delhi metro collapsed in south delhi sunday, injuring at least 20 people, many of them critically, an official said. the accident took place at around 5 a.m. july 8th, 2009 new delhi - the delhi metro is building a special steel structure for putting up a bridge at dhaula kuan, one of the busiest intersections in the capital that is also a vip route, for the airport express line to ensure traffic is not disrupted. the dhaula kuan intersection in south delhi has eight roads. july 3rd, 2009 kharpokhra/bagaha - a railway bridge collapsed in kharpokhra in bihar, disrupting railway services. the bridge collapsed because of strong current of water in the gandak river over which the bridge was constructed. yamuna satyagraha activists protest against metro rail expansion in delhi new delhi - the activists of yamuna satyagraha here on sunday protested against the expansion of the delhi metro rail line touching the banks of river. the activists observed the opening day of the yamuna bank station as \"black day\" in protest against \"dmrc's continues encroachment on the yamuna's floodplain in the form of the yamuna metro complex\" . april 30th, 2009 new delhi - the delhi metro rail corporation (dmrc) thursday completed the construction of its deepest tunnel, built below the existing metro tunnel at rajiv chowk in the heart of the capital. \"the breakthrough achieved today (thursday) marked the completion of the deepest tunnel of the delhi metro, which has been built below the existing tunnel of central secretariat - vishwavidyalaya line at rajiv chowk,' a dmrc statement here said. april 30th, 2009 new delhi - the delhi metro rail corporation (dmrc) thursday completed the construction of its deepest tunnel, built below the existing metro tunnel at rajiv chowk in the heart of the capital.\" the breakthrough achieved today (thursday) marked the completion of the deepest tunnel of the delhi metro, which has been built below the existing tunnel of central secretariat - vishwavidyalaya line at rajiv chowk,' a dmrc statement here said. april 21st, 2009 new delhi - a minor fire tuesday evening at the pitampura metro station of line 1 (shahdara - rithala) in delhi caused disruption in metro train services, an official said. the fire erupted in an air conditioner in the signal room of the metro station around 5.40 p.m. march 7th, 2009 new delhi - a 50-year-old man committed suicide by jumping in front of a delhi metro train at the chawri bazaar station saturday, leading to disruption of services on the route for about 20 minutes. \"the man jumped in front of the metro train around 8.15 a.m. march 7th, 2009 new delhi - delhi metro services were disrupted saturday morning after a train ran over an unidentified person at the chawri bazaar station in what could be a case of suicide, an official said .' a metro train ran over a person at about 8.15 a.m. new delhi - bombardier transportation, a unit of germany-based bombardier inc, expects to get orders for 100 more metro coaches from delhi metro rail corp (dmrc), a company official said here thursday. the company has already bagged an order for 424 coaches from dmrc. case against lalu prasad, officials after bridge collapse in bihar patna - a case was filed in a bihar court tuesday against railway minister lalu prasad and five officials of indian railway construction corporation (ircon) following the collapse of a bridge under construction over a rail line in muzaffarpur district monday. three people were killed and four injured monday when the bridge under construction collapsed at amgola in the district, 70 km from the state capital. january 9th, 2009 new delhi - an ngo has taken the delhi metro to court alleging it had failed to provide drinking water and toilet facilities for commuters. a petition before the delhi high court, filed by voice of india, has said that it had last year sent a representation to the delhi government and delhi metro rail corporation (dmrc) seeking basic facilities in the metro trains but got no satisfactory reply from them. december 30th, 2008 new delhi - the delhi metro rail corporation (dmrc) will observe an awareness week jan 1-7 for safe use of elevators and escalators by its commuters across stations.\" watch your step as you get onto the escalator, hold the railing' - are some of the instructions found on the sign boards put at metro stations in the capital. india ravitwo watched the proposal last night. . no chemistry between bullock and reynolds. . but the movie should do well india. . nice bollywood masala. . churchspot welcome to zft church, india sunday morning live worship in tamil.sr pastor. rev. victor gnanaraj. (zftchurch live> rosemont india \\'s top twitterers. . are they following you or vice versa! mathrubhumieng foreign tourist arrivals go up in india eduitorg im getting distracted from my work at hand...pounding out the india perspective! for sept visit to india. . arg #e 3o lalithamahalaks i am an advocate in india superhappy i'd like to apologize for what i posted just now. amazon outsources its customer service to the philippines, not india. so let's bomb there. venky88 india is not for homosexuals!!!!!!!!!!! jazzjeet does anyone know if air india has a frequent flyer program?!:) souplantation24 i love india arie. she's pure talent. she has a beautiful voice and makes beautiful music:) flyinsider how the friendly skies turned turbulent for air india arjunkachru need all kinds of info about aol india pvt ltd india tushizap cochin, india - 400-year-old synagogue to be restored (vos iz neais) pederseglundaudio cycling to chakrata - delhi, delhi, india consiliera social networks and fashion trends - times of india - theblackbook cochin, india - 400-year-old synagogue to be restored jednews #ybusiness: nomura tie-up with india's largest life insurer allaboutcricket cricket-pakistan win the toss and bat in colombo - reuters india seanbailey i'm spending a saturday uploading videos of india to youtuve for my girlfriend. i'm so cool. washingtonpost india's second take on terror onurka every year; nearly upto 1000 guys in india do ccie; but the current count in india for ccie is 70. interesting stat. sethjenks guaranteed seo services, seo company india and best seo services - mcgeek anyone else viewing the total solar eclipse on july 22 in asia--india, tibet, shanghai, etc. we'll be on a boat near iwo jima. coffeebarchick kicked off the weekend in little india. i love the videos they play in the restaurants. intellibitz re: india's health minister on electrification intellibitz software & hardware support services, india: computer service in chennai: computer problems...contact us for. . intellibitz first moon mission memorabilia to go on sale - times of india intellibitz there are job and jobs listings all over india and asia intellibitz @ fubar69 we are miles apart, it's just 5.30 am here in scotland very early, what time is it in india intellibitz had an amazinngggg day! farmers market was amazing! hundreds of diff foods from panama, england, turkey, india, japan, potugal peru etc =) new delhi petrbuben xinhua: 5 killed in overbridge collapse in indian capital: new delhi, july 12 (xinhua)--five people wer. . intellibitz how terror came calling [hindustan times, new delhi] - tmcnet helenpickard new business news jet airways sacks 50 trainee engineers: march 24th, 2009 new delhi - leading. . intellibitz i'd love to adopt a girl: rajeev khandelwal: new delhi, july 12 (ians) television heartthrob rajeev khandelwal,. . clickindia \"the atrium bar, new delhi\" is getting popular in india jackerhack i'm starting a trip to new delhi today. budak on solo travel theres something exhilarating about being completely on your own, in a place, far from home.ï ¿ 1/2 i dont pretend that my travels are among the most extreme out there, but on a personal level its at the same time both thrilling and scary to be setting out by myself, not exactly sure how to get where im going, and certainly without any idea of what will happen between heading out and re clickindia \"authorized dealers for motorola mobile phones in new delhi\" is getting popular in india eventline <mark>michael clarke</mark> poses for new range of bonds boxer shorts | silver...intellibitz india hindu militants attack missionary school, christians say - new delhi, india (worthy news) staff of a missio...nasirjumani top 10 shopping hubs in new delhi intellibitz book on muslim culture in hindi cinema released: new delhi, july 11 (ians) a book on the depiction of musim cult. . intellibitz no harm if child artists work in tv serials: soni: new delhi, july 11 (ians) despite a ban by the maharashtra go. . celebritypaycut india blinks on emission caps: new delhi: has india blinked in the climate change negotiations this seems to be. . allaboutcricket cricket star dhoni wait for b.com degree prolongs: new delhi india: <mark>mahendra singh</mark> dhonis wait to become. . intellibitz random thoughts: <mark>sabyasachi mukherjee</mark> to make directorial debut: by shweta thakur and maanwi malik new delhi, o.. gfelondon delhi escorts new delhi female escorts russian female escorts...intellibitz pakistan says trial of mumbai terror suspects to start july 18 +: islamabad/new delhi, july 11 (ap) - (kyodo) pak. . clickindia \"super india packers and movers, new delhi\" is getting popular in india tomhimpe asian games to feature only 35 sports from 2014 | home>"}, {"articleID": "2015081715_00181033_W", "names": {"Thomas Miller": ["Q1645605", "Q18810669", "Q2426140", "Q24706764", "Q7792461", "Q7792467"]}, "date": "2015-08-17", "url": "http://northjersey.com/news/river-edge-council-holds-hearing-on-funding-for-park-1.1393761", "content": "River Edge council holds hearing on funding for park August 17, 2015 Last updated: Monday, August 17, 2015, 11:42 AM By Stephanie Alberico Pages: 1 2> display on one page The borough's Recreation Commission is proposing to finish Cherry Blossom Park, located on Bogert Road near Cherry Hill School, with the help from a Bergen County Open Space Fund. The tree farm for the park was planted last summer. Conceptual plans have been in the works for some time, with a proposed park featuring the tree farm, gardens, storage sheds, benches, lighting, a stone wall, gazebo, pergola, a stone dust trail and an outdoor classroom. The borough purchased the land for the park in 2009 for $425,000 with a county Open Space grant. During a Borough Council work session on Aug. 3, the council discussed moving forward with the first two phases of the project. <mark>Thomas Miller</mark>, the consultant on the project, and Recreation Director Bobbi Conway presented bid options to the council. \"What we're looking at is a phase 2 application for Bergen County Open Space,\" Conway said, estimating that the subtotal for the entire project would be approximately $140,000. The grant from Bergen County for open space would be about $70,000, with the borough then responsible for the remaining $70,000, according to Conway. <mark>Miller</mark> said during the first phase, fencing right beside the school would be installed. The base items in the bid would include pole-mounted lighting, accessible parking spaces, irrigation systems and landscaping. Additional items for the park would include an entrance walkway overlay, pergola, low stone wall and a gazebo. <mark>Miller</mark> said although they considered including an outdoor classroom and storage shed in the original plan, the items were left out of the subtotal of the cost and considered additions to the project. These two items would cost an approximate additional $19,000. Councilman Edward Mignone said that officials could not guarantee that they would receive the $70,000 grant from the county and they should consider that when setting aside funding for the project. Mignone said that the approximate cost would turn out be higher, approximately $157,000 plus 10 percent contingency, permits and other fees. \"So we're probably looking at total costs of $200,000,\" he said. \"This is the issue: We're asking for $70,000 with a $70,000 match, but the allocations on the county level are down 40 percent this year. Last year the region got $464,000. This year our region is getting $290,000. So it's more likely we're going to get $25,000 instead of $70,000.\" What I'm concerned about, and we ran into this problem with another project, is we're going to be proposing a $200,000 project, \"he continued.\" We're going to get $20,000 and we're going to commit ourselves to spending the full $200,000 and that money is not available. I'm not prepared to go for a $70,000 grant and then go and spend $200,000 plus on this project. \"Mayor Sandy Moscaritolo said that the council would take a vote on going out for the grant application with the understanding that the details and specifics of the park could be changed, if necessary.\" We can certainly complete the project in a third phase if we need to, \"he said.\" The matching fund will most likely come from the local open space fund that we've already established and we can always lower our expectations. \"Conway said she discussed it with the Recreation Commission and they approved the project and the estimate.\" Actually this is the only project that we have open to go out for open space for the county, \"Conway said.\" This is the only project that we're working on right now. \"The resolution endorsing the council to go for the next round of the open space application was passed. Mignone was the only dissenting vote. Councilman Anthony Cappola was not present at the meeting. Mignone said he voted\" no \"because the governing body does not know the full scope of the project and would be earmarking $70,000. The council also voted to accept the lowest bid for the first phase of the project."}, {"articleID": "2014052913_00074808_W", "names": {"Clint Eastwood": ["Q2979323", "Q43203"]}, "date": "2014-05-29", "url": "http://www.abc.net.au/local/photos/2014/05/29/4014918.htm", "content": "Running from death's door as dialysis patient aims for a triathlon Jervis Bay's <mark>Clint Eastwood</mark> is training to become Australia's first triathlete on dialysis. (ABC: Justin Huntsdale) <mark>Clint Eastwood</mark> has heard all the jokes about his movie star namesake, but you probably haven't heard about how he hauled himself out of a darkness that was set to claim his life, and started training to be Australia's first triathlete on dialysis. \"At Christmas time, things were bad health-wise - I was living on pain killers, my conditions were flaring up and I couldn't walk so I was sleeping all the time and in a wheelchair.\" I decided after going through [over 30 years of] this horrible stuff, I'd finally had enough and it had just become too much. \"So he drove to Melbourne to tell his family that he was throwing in the towel after a long and difficult fight with kidney failure. Just one week away from his blood cleaning dialysis machine would've been enough to end his life.\" I got to Melbourne and no one wants to deal with stuff like that, I mean, how do you tell your own mother you don't want to be here anymore? \"On the cusp having that conversation, he says he had a\" light bulb moment' and realised that instead of quitting on life, he would seize what he calls his last throw of the dice. He chose to become a triathlete, inspired by reading the story of American dialysis patient Shad Ireland who did the same thing. \"Reading his story ignited a spark in me, then seeing stuff on Facebook of kids with no legs, blind athletes, and paralympians, I wondered what the hell am I whinging about?\" To be fair, he has a right to whinge. Diagnosed with kidney failure at age three, he's had three failed kidney transplants, was told a fourth would kill him, and was also told he wouldn't make 40 years of age. He has trouble finding employment because his dialysis treatment forces him to be connected to a machine that cleans his blood in a hospital, three days a week for five hours per session. \"I do it myself - it's like part time work but without the pay.\" But remarkably he still has a sense of humour about it all, and that's probably been enhanced with his fitness kick. He left Melbourne early and drove back to the Shoalhaven of southern New South Wales and signed up at a gym before he went home. \"I've lost 17.5 kilograms since January and people have noticed a physical and mental change in me,\" he says. \"You only live once and whether you have a long time or a short time, it's about making the most of the time you have.\" Stop wasting time and sitting there thinking woe is me and enjoy what you've got, particularly up here [in Wollongong]. \"He's at the gym several times a week (around his dialysis treatment), has started surfing and has received sponsorship from local businesses to help pay for his fitness equipment.\" All I'm trying to do is be proud of something I've done."}, {"articleID": "2011052309_00051349_W", "names": {"Volen Siderov": ["Q12960523", "Q351040"], "Orhan Pamuk": ["Q241248", "Q53091976"]}, "date": "2011-05-23", "url": "http://novinite.com/view_news.php?id=128527", "content": "the nationalists' rally at a sofia mosque last friday quickly escalated to a serious clash. photo by the ethnic turkish party, movement for rights and freedom, dps, is going to inform all european institutions about the actions of the far-right, nationalist ataka party. the announcement was made by the dps parliamentary group deputy chair, yunal lyutvi, who spoke for the bulgarian national radio, bnr, saying the information is to reach the council of europe, the human rights agency at the european commission and the european parliament. last friday ataka staged a rally in front of the sofia's banya bashi mosque, protesting the fact it has loudspeakers that sound muslim prayers in the entire area around. the rally escalated to a fight with injured and detained people. ataka leader, <mark>volen siderov</mark>, claims those at the mosque are islamic extremists and terrorists. \"<mark>siderov</mark> is detrimental for bulgaria,\" lyutvi declared, adding the bulgaria might ban nationalist party \"ataka' for stirring hatred bulgarian pm on xenophobic outburst: don't worry, that's just campaigning! how significant do you take to be the incident in which activists of the nationalist and far-right right party ataka assaulted praying muslims in the banya bashi mosque in downtown sofia? the incident is a very grave foreboding of the overall situation religious and ethnic violence that can occur in bulgaria unless it is taken seriously by the state and society. one should not read too much into this incident because the attack was staged by several dozen far-right activists who are not representative of the bulgarian society. nobel prize winner <mark>orhan pamuk</mark> with highest bulgarian award why is bulgarian nationalist <mark>siderov</mark> not shouting? a: i am watching bulgarian nationalist leader <mark>volen siderov</mark> on tv right now, but i cannot hear him violently ranting against turks. something must be wrong! all rights reserved? novinite ltd., 2001-2011."}, {"articleID": "2019101509_00053201_W", "names": {"Thomas Cook": ["Q16205324", "Q47452628", "Q53952787"], "Peter Fankhauser": ["Q18686096", "Q23656762"]}, "date": "2019-10-15", "url": "http://northwalespioneer.co.uk/news/national/17969004.ex-thomas-cook-boss-deeply-sorry-firms-failure/", "content": "Ex-Thomas <mark>Cook</mark> boss \"deeply sorry' over firm's failure By Press Association 2019 <mark>Peter Fankhauser</mark> 0 comment The former boss of <mark>Thomas Cook</mark> has said he is\" deeply sorry \"for the travel firm's collapse. Ex-chief executive <mark>Peter Fankhauser</mark> told MPs that senior figures at the company regretted being unable to save the\" iconic brand \". Employees, customers and suppliers are among those affected by the failure of the firm. Mr <mark>Fankhauser</mark> is one of five senior <mark>Thomas Cook</mark> figures giving evidence to the Commons' Business, Energy and Industrial Strategy Committee. In his opening remarks, he said:\" You heard me probably say it already, but I really want to repeat it in front of the members of the select committee, how deeply sorry we are that we couldn't save this iconic brand and this company who has a long, long standing history in this part of the UK industry. Former <mark>Thomas Cook</mark> employees arrive at Westminster for the hearing (Victoria Jones/PA) \"I'm deeply sorry about this failure and I'm deeply sorry for the distress we caused to millions of customers who booked holidays with us and who were on holidays with us.\" I'm deeply sorry for our suppliers who were long-standing partners and who were loyal to us throughout this time. Former <mark>Thomas Cook</mark> bosses at the hearing (House of Commons/PA) \"I'm especially sorry for all my colleagues who worked extremely hard and tirelessly to make <mark>Thomas Cook</mark> a better company.\" But MPs were quick to call into question some of the accounting policies including the decision to include a £ 2.5 billion \"goodwill\" value on the business in 2018. They also asked the bosses why they based bonuses on profits that excluded one-off payments to pay for the restructuring. A total of £ 1.8 billion was written as \"exceptional\" costs over eight years. Committee chairwoman Rachel Reeves said: \"The proof of the pudding is somewhat in the eating and you failed to turn around this business. In the end you couldn't just hide these numbers (exceptionals) forever, they caught up with you.\" She also called the former <mark>Thomas Cook</mark> chairman Frank Meysman \"deluded\" over the collapse. Ms Reeves added: \"You can point to as many successes as you like but you have brought down a 178-year business with huge repercussions for customers, staff and taxpayers. You can point to the successes but I'll point to the failures and they hugely outweigh the successes you've spoken about. I think you're deluded Mr Meysman about the business you ran.\" 0 comment"}, {"articleID": "2016092400_00183968_W", "names": {"Keith Edwards": ["Q18165711", "Q6384307", "Q6384308", "Q6384309", "Q6384310"]}, "date": "2016-09-23", "url": "http://www.centralmaine.com/2016/09/23/two-indicted-on-attempted-murder-charges-following-augusta-wal-mart-parking-lot-shooting-incident/", "content": "AUGUSTA--Two men accused of shooting handguns at each other in the parking lot at Wal-Mart during an altercation that ended when armed bystanders intervened were indicted Friday on charges including attempted murder. Frankie Dejesus, 27, of Augusta, was indicted on charges of attempted murder, aggravated assault, and reckless conduct with a firearm. Reginald McBride, 45, of Harlem, New York, was indicted on charges of attempted murder, aggravated trafficking in scheduled drugs, reckless conduct with a firearm, and four counts of possession of a firearm by a prohibited person. The indictments stem from a June 26 shooting and fight a judge described as \"like an old Western shoot-out in the Wal-Mart parking lot.\" Frankie Dejesus Samantha Tupper Diana Davis REginald McBride Search photos available for purchase: Photo Store → Also indicted Friday, in connection to the same incident, were Samantha E. Tupper, 24, of Augusta, on charges of unlawful furnishing of scheduled drugs and hindering apprehension or prosecution, and Diana M. Davis, 29, of Rochester, New York, on a charge of aggravated assault. An indictment is not a determination of guilt, but it indicates that there is enough evidence to proceed with formal charges and a trial. Police say McBride and Dejesus fired guns at each other during a dispute about money in the parking lot of the Augusta Wal-Mart, though no one was struck by a bullet during the altercation. An affidavit by Augusta Police Detective Brian Wastella says Tupper had been driving in a Ford Taurus to Wal-Mart when she picked up McBride on Mount Vernon Avenue. A car with three women passengers in it, and Dejesus driving, approached them. Two of the women got out and got into Tupper's vehicle, and both vehicles went to Wal-Mart, parking side by side. All the people got out of both vehicles. Wastella said McBride, Tupper, Dejesus and Davis argued. McBride said Tupper and he got back into the Taurus when \"he observed Dejesus point a handgun out the driver's side of his vehicle at him. McBride stated in fear of being shot, McBride drew his handgun and began firing at Dejesus,\" Wastella wrote. Dejesus, meanwhile, told police McBride pulled the gun first and began shooting, so Dejesus began firing back. Wastella said McBride got out of the car when the shooting stopped and began fighting with Dejesus and Davis, with the two beating on him. Tupper told police Dejesus hit McBride with the butt of a gun while Davis held him. Then, according to police accounts of the incident, two bystanders, both legally armed with guns, broke up the confrontation, taking out their guns and telling the suspects to stop fighting. Tupper and McBride drove away before police arrived. Police later found them at Tupper's residence, on Mayflower Road. Wastella said police found 42 grams of heroin on McBride. The indictment for McBride notes he \"did intentionally or knowingly shoot at Frankie Dejesus,\" while Dejesus' indictment likewise states he \"did intentionally or knowingly shoot at Reginald McBride.\" McBride's indictment indicates, regarding the four counts of possession of a firearm by a prohibited person, that McBride was convicted of possessing cocaine with intent to distribute in Virginia in 1996. The indictment states McBride owned, possessed or controlled four firearms--two .22 caliber handguns, a .32 caliber handgun, and a 9 millimeter handgun. Davis' indictment states she caused bodily injury to McBride, with the use of a firearm. While no one was shot in the incident, McBride suffered lacerations to his head, which police said was from being hit by the butt of a gun during the fight that ensued after four shots were fired. <mark>Keith Edwards</mark>--621-5647 [email protected] Twitter: @ kedwardskj Share Read or Post Comments Were you interviewed for this story? If so, please fill out our accuracy form Send questions/comments to the editors."}, {"articleID": "2013083001_00044244_W", "names": {"James Caldwell": ["Q16106198", "Q3808317"], "Steve Austin": ["Q44313", "Q7611829", "Q7611831", "Q7611832"], "Kevin Nash": ["Q280793", "Q6397074"], "Scott Hall": ["Q16875363", "Q352713"], "Jim Ross": ["Q317724", "Q56558062", "Q6197876", "Q6197879", "Q6197881"], "Brock Lesnar": ["Q220556", "Q25421397"], "Jeff Hardy": ["Q44137", "Q6174013", "Q6174015"]}, "date": "2013-08-29", "url": "http://pwtorch.com/artman2/publish/WWE_News_3/article_73018.shtml", "content": "WWE NEWS: Stephanie McMahon responds to bullying question on WWE TV, P.R. expert takes issue with response By <mark>James Caldwell</mark>, PWTorch assistant editor WWE executive/on-air character Stephanie McMahon responded to a question about how WWE is able to promote their B.A. Star anti-bullying campaign while showing unanswered bullying on their WWE TV programming. Twitter Q: \"What do u say to those fans who say @ WWE is going against their own Anti-Bullying campaign w / showing HHH & Ryback bullying?\" Stephanie A: \"No diff than bullying in a movie, WWE is Entertainment @ beaSTARalliance is real.\" responded to Stephanie's answer on Twitter: \"That is utter nonsense and (bad) PR spin. How does she know that the kids can differentiate it? You cannot profess one thing, then show something else. Kids mimic what they see on TV, right or wrong. It's not the respective medium's fault, but if it's not there, there is nothing to mimic.\" Kids play cops and robbers because they see it on TV and movie. They also try to perform wrestling moves and sometimes people get hurt. Again, it's not the wrestling company's responsibility to be a parent, but it IS the company's responsibility not to be hypocritical. \"<mark>Caldwell</mark>'s Analysis: I would add that there are no consequences to the actions of Ryback and Triple H, which sends a message to kids that it's okay to bully because no one will do anything about it. Especially in the case of Ryback, who has bullied\" people beneath him \"such as scrub wrestlers, caterers, and backstage interviewers without any punishment doled out or wrestlers stepping up to fight him. (Of course, WWE has emasculated the roster the past two weeks, but that's another issue .) Ironically, the only response from the announcers - the\" voices and on-air representatives of WWE \"- has been Jerry Lawler's canned, dry line about Ryback\" not being a representative of the B.A. Star initiative. \"But, that's empty words, especially when the announcers simply sit there looking at each other before moving along and there are no authority figures in-place or wrestlers stepping up to tell Ryback that it's not right. WWE NEWS: Stephanie McMahon responds to bullying question on WWE TV, P.R. expert takes issue with response WWE NEWS: Raw quarter-hour TV ratings - Punk-Heyman delivers again, Bryan Gauntlet, how did A.J.'s promo fare?, more WWE NEWS: Prominent ESPN writer questions lack of pro wrestling off-season, draws attention to wrestler health THE TORCH REACHES MORE COMBAT ENTERTAINMENT FANS THAN ANY OTHER SOURCE PWTorch editor Wade Keller has covered pro wrestling full time since 1987 starting with the Pro Wrestling Torch print newsletter. PWTorch.com launched in 1999 and the PWTorch Apps launched in 2008. He has conducted\" Torch Talk \"insider interviews with Hulk Hogan, The Rock, <mark>Steve Austin</mark>, <mark>Kevin Nash</mark>, <mark>Scott Hall</mark>, Eric Bischoff, Jesse Ventura, Lou Thesz, Jerry Lawler, Mick Foley, <mark>Jim Ross</mark>, Paul Heyman, Bruno Sammartino, Goldberg, more. He has interviewed big-name players in person incluiding Vince McMahon (at WWE Headquarters), Dana White (in Las Vegas), Eric Bischoff (at the first Nitro at Mall of America), <mark>Brock Lesnar</mark> (after his first UFC win). He hosted the weekly Pro Wrestling Focus radio show on KFAN in the early 1990s and hosted the Ultimate Insiders DVD series distributed in retail stories internationally in the mid-2000s including interviews filmed in Los Angeles with Vince Russo & Ed Ferrara and Matt & <mark>Jeff Hardy</mark>. He currently hosts the most listened to pro wrestling audio show in the world, (the PWTorch Livecast, top ranked in iTunes) REACHING 1 MILLION + UNIQUE USERS PER MONTH PWTorch offers a VIP membership for $10 a month (or less with an annual sub). It includes nearly 25 years worth of archives from our coverage of pro wrestling dating back to PWTorch Newsletters from the late - '80s filled with insider secrets from every era that are available to VIPers in digital PDF format and Keller's radio show from the early 1990s. Also, new exclusive top-shelf content every day including a new VIP-exclusive weekly 16 page digital magazine-style (PC and iPad compatible) PDF newsletter packed with exclusive articles and news. The following features come with a VIP membership which tens of thousands of fans worldwide have enjoyed for many years...- New Digital PWTorch Newsletter every week -3 New Digital PDF Back Issues from 5, 10, 20 years ago - Over 60 new VIP Audio Shows each week - Ad-free access to all PWTorch.com free articles - VIP Forum access with daily interaction with PWTorch staff and well-informed fellow wrestling fans"}]