[{"date": "2015-11-05", "url": "http://sundayworld.com/news/child-rapist-who-fled-ireland-is-back-in-the-country", "content": "● News By Shuki Byrne Return: <mark>Ward</mark> fled the country during the summer Notprious child rapist <mark>Danny Ward</mark> has returned to Ireland after fleeing the country during the summer following a series of incidents in which he was targeted. <mark>Ward</mark> (35) was the subject of a number of vigilante attacks here before making the decision to flee the country in August. At the time he informed gardai he was leaving the country who in turn informed UK authorities he was intending to reside there for some time. He was spotted by a member of the public who took pictures of him aboard the Dublin to Holyhead ferry. Back in the country his movements are now being monitored at a secret location by gardai and the probation services. <mark>Ward</mark> had been attacked by vigilante groups a number of times in the months prior to leaving the country, and has had to be moved several times and protected by gardaí. In July he was chased and allegedly beaten by a group in Dún Laoghaire. It was reported that he was sleeping rough in the area at the time. <mark>Ward</mark> was set upon in Dun Laoghaire Garda Station. A man who has appeared in a video of the incident allegedly punching and kicking the sex offender has been arrested by appointment. Before that he was ran out of accommodation in north Dublin and Ringsend by angry locals. <mark>Ward</mark> had been drinking in a local pub when he was spotted by a man who recognised him from previous media coverage. <mark>Ward</mark> was said to be \"knocking back pints at the time\". It is understood that the man who spotted him called a few of his associates and <mark>Ward</mark> left the pub, but by this stage the other individuals arrived at the scene and <mark>Ward</mark> \"suffered a few thumps\". He then travelled to Wicklow Town hoping to go unnoticed but after he was spotted in the town gardai bundled him into a garda car and took him out of the area in fear a vigilante mob would attack him. Since his return to Ireland in recent weeks the 6ft 2in man has been under the supervision of the Probation Service and Gardai under its Offender Risk Assessment and Management Scheme (SORAM). Under the scheme he has to make his whereabouts known to gardai.", "articleID": "2015110508_00111233_W", "names": {"Danny Ward": ["Q19281946", "Q5220916", "Q645145"]}}, {"date": "2015-11-05", "url": "http://nbcnews.com/video/four-dead-in-shooting-in-central-maine-560236099944", "content": "Feedback advertisement advertisement NBC News Video Sponsored By LIVE NOW Follow NBC News Facebook Twitter Google Plus Newsletter More RSS Youtube Tumblr Instagram Sorry, this video needs JavaScript turned on Play Four Dead in Shooting in Central Maine Investigators are not yet sure what led 42-year-old Herman Derico to shoot and kill three housemates and then himself. A 4-year-old girl who also lived as the home was not hurt. Four Dead in Shooting in Central Maine Authorities now suspect explosive device caused Russian plane crash Expert: Russian jet crash now being investigated as \"intentional' Wife and son of cop who committed suicide are now under investigation <mark>Donald Trump</mark> still set to host SNL, amid controversy <mark>Donald Trump</mark> on why he's now running ads and his use of bankruptcy laws Quentin Tarantino doubles down on controversial remarks about police Kidnapped boy found safe in Cleveland after 13 years Marijuana Legalization Initiative Fails in Ohio Previous Next Your Playlist Expand Collapse advertisement Latest Most Popular Topics U.S. World Politics Investigation Health Tech Science Pop Culture Lifestyle Business Sports Latest Latest Most Popular U.S. World Politics Investigation Health Tech Science Pop Culture Lifestyle Business Sports Search for a video Search for a video Search for a video Mascot Too Sexy For This Town? Police: Shooting That Claimed Young Boy's Life May be on Tape Four Dead in Shooting in Central Maine\" You Don't Live in the Casino? \": Behind the Life of a Casino Worker Pennsylvania Cop on Trial for Murder:\" This Is Horrible For Me' NASA: Mars Atmosphere Blown Away by Solar Wind Police Rape Trial Underway Hear Thunder Snow Strike Nashville Council Member Shot Pope Francis Releases his First Album GOP Super PACs: A Failed Experiment Meet the Girl Who May Have 48 Siblings <mark>Paul Ryan</mark> on President Obama: \"We had a Couple Conversations on the Phone' Stabbing Hero Describes Attack British PM: Egypt Flight Changes Based on Intelligence Tourists in Egypt React to Flight Security Concerns Burglar Drops In For Lunch Jeb Bush Says Cheney Served Dad and Brother Well Dance party! KLG, Hoda bust a move on TODAY Deaf Customer, Barista in Viral Video Hope More Drive-Thrus Will Use Video Chat The Trail Tapes: Life as a <mark>Donald Trump</mark> Impersonator Marcela Valladolid makes creamy pumpkin cheesecake - with squash! Reindeer, lynx, beavers, oh my! Meet Dr. Dee's furry friends\" Are you serious?!' This mom can't believe her Ambush Makeover Deaf woman's sign-language exchange with Starbucks barista goes viral Bobbie's Buzz: See KLG and Hoda's Favorite Things Meghan Trainor, KLG, Hoda dance - and put her lyrics to the test Sweet sounds of success! The highest paid women in music are...Hoda was right! Blake Shelton and Gwen Stefani are dating KLG and Hoda's big morning out: We took the subway! Missing Alabama Boy \"Did Not Know' He Was Taken\" Brooklyn' star Saoirse Ronan: This film is \"my mom and dad's story' Halfway to healthy! '16 to' 16' challenge participants check in at Week 8 Missing Boy Found Alive 13 Years Later Just hit send: Google rolls out automated replies for Gmail Tourists gape at spectacular Northern Lights in Iceland Study: A child's self-esteem develops by kindergarten Kozy Shack is recalling thousands of cases of pudding Meet Bond women of\" Spectre': Monica Bellucci, Lea Seydoux, Naomie Harris First Victim of Metrojet Plane Crash Buried in Russia Shows Watch the day's top stories and analysis to help wrap up your day. Watch Chuck Todd interview newsmakers from around the world. Watch episodes of Dateline NBC, story-telling at its best. U.S. News Video Businesses Go After Customers Who Post Bad Online Reviews Business News Cop Who Fatally Shot Motorist in Back Cleared of Murder U.S. news Crooked Cop Tried to \"Put a Hit' on Town Worker: Police U.S. news Video of Barista Helping Deaf Customer Goes Viral, Inspires U.S. news Video Four Dead in Shooting in Central Maine U.S. news World News U.S. Gunship Shot Victims Fleeing Bombed Hospital: Charity World Video Mascot Too Sexy For This Town? Weird News What We Know About the Doomed Russian Jetliner Russian Plane Crashes in the Sinai Gallery Haunting Portraits of Sleeping Children Show Migrants' Plight World Video Russian Plane Crash 101: What Do We Know? 101 advertisement Get Breaking news updates Privacy Policy advertisement Follow @ NBCNews Tweets by @ NBCNews advertisement Follow NBC News NBC News advertisement", "articleID": "2015110521_00118061_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2015-11-08", "url": "http://theblaze.com/the-wire/36657245/good-not-spectacular-preliminary-ratings-for-trump-on-snl/", "content": "Good, not spectacular, preliminary ratings for <mark>Trump</mark> on SNL Nov. 8, 2015 2:22 pmNEW YORK (AP)--<mark>Donald Trump</mark> hadn't gotten far into his opening monologue before trouble occurred. An off-screen heckler interrupted with a cry of \"You're a racist!\" But the \"heckler\" was comedian Larry David, who before <mark>Trump</mark> arrived onstage had been seen impersonating Democratic presidential hopeful Bernie Sanders. \"Larry, what are you doing?\" <mark>Trump</mark> asked with a trace of exasperation. \"I heard if I yelled that, they'd give me $5,000,\" said David with a shrug, echoing an offer made publicly by one of the Hispanic groups protesting <mark>Trump</mark>'s appearance. \"As a businessman,\" <mark>Trump</mark> told him, \"I can fully respect that .\" <mark>Trump</mark>'s 90 minutes in the \"SNL\" spotlight followed weeks of growing anticipation, increasingly sharp criticism and mounting calls for him to be dropped from the show. But the Republican presidential candidate hosted Saturday's \"SNL\" as scheduled. And, at least in NBC's Studio 8H, there was no more unrest--orchestrated or otherwise. (Deport Racism, the group that made the $5,000 offer, tweeted that David would get the bounty, \"joke or not .\" ) Only hours after the broadcast, <mark>Trump</mark> was back on television and characteristically bullish about his performance, calling it \"very well received and probably got very good ratings, who knows .\" Very good, but not spectacular. Preliminary Nielsen ratings measuring households in 56 U.S. markets gave Saturday's \"SNL\" its highest rating only since January 2012. Basketball great <mark>Charles Barkley</mark> was host that night. Full results, including viewership figures, will be released Thursday, NBC said. <mark>Trump</mark> also told CNN's \"State of the Union\" that some sketches were cut because there were \"a little risque .\" He did not go into details. During his monologue, <mark>Trump</mark> promised his hosting appearance would be \"something special,\" while noting that many people had asked him why he accepted the gig. He said they had told him, \"You're brilliant, you're handsome, you're rich. The world is waiting for you to be president. Why?\" His answer: \"I had nothing better to do .\" \"But part of the reason I'm here,\" he added, \"is to show I can take a joke .\" In one sketch, <mark>Trump</mark> was willing to mock his penchant for tweeting insults about people with whom he differs. \"I hate to break it to you guys,\" he told viewers, \"but I'm not going to be in the next sketch .\" Instead, off-camera, he live-tweeted comments that were flashed on the screen about \"SNL\" cast members performing a skit: \"Cecily Strong is not a nice person .\" \"Kate McKinnon was born stupid .\" \"I love SNL...SNL loves me. But everyone in this sketch is a total loser who can bite my dust .\" Another sketch imagined <mark>Trump</mark> in the Oval Office in 2018--two years into his presidency--savoring his many successes. By then, Syria is at peace. China is borrowing money from the U.S. <mark>Trump</mark>'s real-life daughter, Ivanka, is the administration's secretary of the interior, and announces the Washington Monument will be covered with gold. Did it all sound too good to be possible? \"If you think that's how it's going to be when I'm president, you're wrong. It's going to be even better,\" <mark>Trump</mark> said, addressing the audience. \"I said to the writers of this sketch,\" Keep it modest .' \"His preference, he insisted, was to keep expectations low for his presidency and not overpromise. Until Saturday, just eight politicians had served as guest hosts in the NBC sketch comedy series' 40 years. Only one of those--the Rev. Al Sharpton, in 2003--was actively involved in a presidential bid at the time. (Hillary Rodham Clinton appeared in last month's season premiere, but not as the host .) The star turn granted <mark>Trump</mark> fanned the flames of outrage sparked in June when he announced his Republican candidacy for president and described some Mexicans who are in the United States illegally as criminals and rapists. Hours before the show's live broadcast, dozens of protesters marched from <mark>Trump</mark> Tower to NBC's studio in Rockefeller Plaza, chanting in both English and Spanish and carrying signs. In Spanish, they chanted:\" The people united shall never be defeated \"and signs declared SNL racist .\" I feel like they're giving him a platform, \"said Hazel Hernandez, 26, who emigrated from El Salvador and now lives in Brooklyn .\" I'm an immigrant myself, so I'm pretty outraged. I've been in this country for many years, and I'm outraged that they would let him host SNL. It's upsetting. \"<mark>Trump</mark>'s comments last summer spurred NBC to sever its Miss Universe ties with him while declaring he would never return to his\" Apprentice \"role. But leading up to Saturday's broadcast, NBC did not respond to accusations that it had reversed itself, or to the outcry against <mark>Trump</mark> that had built since\" SNL \"announced his host booking last month. Typically outspoken, <mark>Trump</mark> welcomed the controversy, predicting it would only boost his audience. It wasn't <mark>Trump</mark>'s first turn as guest host. The billionaire developer and media personality presided in April 2004, a few weeks after he debuted as host of NBC's\" The Apprentice. \"This time, while <mark>Trump</mark> demonstrated once again that he could take a joke, he was running for president. The sketches--both with and without him--seldom let the audience forget it. ___ Associated Press writers Kathleen Hennessey in Washington and Katie Park contributed to this report.", "articleID": "2015110819_00108566_W", "names": {"Charles Barkley": ["Q192707", "Q5077040"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-11-11", "url": "http://news.yahoo.com/several-smaller-daily-fantasy-sports-sites-close-shop-222134811--nfl.html", "content": "Several smaller daily fantasy sports sites close shop in NY BySuzanne Barlyn and Sarah N. Lynch 11 minutes ago  Done By Suzanne Barlyn and Sarah N. Lynch NEW YORK/WASHINGTON (Reuters) - Several smaller daily fantasy sports sites have stopped doing business in New York after the state's attorney general ordered market leaders FanDuel and DraftKings to stop taking bets there. DailyMVP and DraftOps said they stopped taking payments in New York after Attorney General Eric Schneiderman sought to shut down the business in the state by their larger competitors. In addition, European daily fantasy site Mondogoal also said it would cease taking money in the state for now. Schneiderman, in a letter to DraftKings and FanDuel on Tuesday, declared that the two daily fantasy sports sites were running an illegal gambling operation. The move jeopardizes a major market in the multi-billion dollar daily fantasy sports industry and leaves many smaller operators in limbo over their New York operations. Schneiderman's order is an edict for other daily fantasy sports sites in New York's market, said <mark>David Klein</mark>, a New York lawyer who advises daily fantasy sports sites on compliance issues. <mark>Klein</mark> immediately told his clients to stop doing business in the state because of the order, he said. \"To proceed otherwise is dangerous, to say the least, at this juncture,\" said <mark>Klein</mark>, who does not advise DailyMVP or DraftOps. In the games, fans pay to compete for daily cash prizes based on imaginary teams assembled from rosters of real players, which accumulate points based on how those players perform in actual games. This has enabled fans to spend money on the games with a frequency that critics say is akin to sports betting. Schneiderman was pleased by the smaller operators' decisions to cease operations in New York. \"We urge FanDuel and DraftKings to follow this example, by immediately meeting the terms of the Attorney General's letter, and by ending their illegal gambling enterprise--and the economic and public health harms that come with it--here in New York,\" spokesman Matt Mittenthal said. DraftKings and FanDuel have five business days to respond to Schneiderman's order and continue to take money from customers in the state. Both are working to fight the order. DailyMVP and DraftOps said they would wait and see how their larger competitors fare in contesting the order. \"While we disagree with this decision, we have determined to respect the order of the attorney general,\" a DailyMVP spokeswoman said. New York customers can continue to play games that are free, she said. DraftOps did not receive an order, but also wants to follow all laws and regulations in the places where it operates, said Marie Vozikis, Operations Manager, in a statement. (Reporting by Suzanne Barlyn and Sarah Lynch; Editing by Michael Erman and Alan Crosby) Eric Schneiderman", "articleID": "2015111122_00111951_W", "names": {"David Klein": ["Q1175006", "Q15699760", "Q16663864", "Q2902258", "Q30611708", "Q5236065", "Q5236067", "Q7066597"]}}, {"date": "2015-11-11", "url": "http://www.thestar.com/news/gta/2015/11/11/toronto-artists-creativity-flows-through-werkadaynov15.html", "content": "News / GTA Toronto artist's creativity flows through #werkadaynov 15 A group of Toronto artists are \"getting their creative juices going on a daily basis\" with the help of a hashtag, #werkadaynov 15. Share on Facebook With the added freedom of producing for herself, Janice Kun is experimenting with watercolours. By: Verity Stevenson Staff Reporter, Published on Wed Nov 11 2015 Photos View photos zoom When your hobby is your work, it can be tough to distinguish between the two. Some Toronto artists are \"getting their creative juices going on a daily basis\" with the help of a hashtag: #werkadaynov 15. The challenge is to submit a piece of \"werk\" a day on Instagram, for the illustrators to satisfy their own creativity aside from their commercial and editorial commissions. Clayton Hanmer--Fuzzy Rider @ claytonhanmer The Toronto illustrator says the inspiration for \"Fuzzy Rider' came to him on a visit to the petting zoo. Clayton Hanmer, a Toronto illustrator, says the inspiration for\" Fuzzy Rider \"came to him on a visit to the petting zoo at the annual Royal Winter Fair with his 8-month-old daughter. Janice Kun Janice Kun was at an art and tech conference when she attended a speech by a motion graphics designer who had been producing an illustration a day for the past 3,000 days .\" I figured if this guy can do 3,000, I can do a month, \"she said. With the added freedom of producing for herself, she's experimenting with watercolours. Her Nov. 7 #werkaday is loosely based on a photo from a past Halloween party. <mark>Steve Wilson</mark> @ 5_star_rating For #werkaday, Steven Wilson has been experimenting with watercolours. Like many illustrators, <mark>Steve Wilson</mark> devotes much of his time to making work for others. For #werkaday, he's been experimenting with watercolours, which he says are more\" instantaneous, \"which lends itself well to the equally instantaneous Instagram. <mark>Dan Turner</mark> - emojis @ 10th_degree_dan This is <mark>Dan Turner</mark>'s version of emoji: hand-drawn as opposed to digitally-rendered. Toronto illustrator <mark>Dan Turner</mark> is\" fascinated with our analogue lives before the digital revolution. \"This is his version of emoji: hand-drawn as opposed to digitally rendered, and objects or people that evoke what a thumbs-up could not. <mark>Dan Turner</mark>--<mark>Jack Nicholson</mark> @ 10th_degree_dan Illustrator <mark>Dan Turner</mark> said the 1974\" masterpiece of auteur cinema \"Chinatown with <mark>Jack Nicholson</mark> is one of his favourites .\" Forget it, Jake; it's Chinatown. \"Illustrator <mark>Dan Turner</mark> said the 1974\" masterpiece of auteur cinema, \"Chinatown with <mark>Jack Nicholson</mark>, is one of his favourites .\" In this case, his psychological wounds are manifested on the outside, \"he says of his Nov. 8 submission. Arv Slabosevicius--@ actionarv @ actionarv Arv Slabosevicius uses 3D software to model and render the illustrations, which take about six hours to make. Arv Slabosevicius creates animations and illustrations. He used 3D software to model and render the illustrations, for which he says he draws inspiration from Lithuanian art and Toronto. They take him about six hours to make. Hyein Lee - Wendigo @ hyeinpain Hyein Lee said her submissions have taken between three and eight hours to make, so she's tried to streamline them. Before coming to Canada from Korea 20 years ago, Hyein Lee explained, a tale in a book of horror stories stuck with her: the Algonquin legend of the Wendigo, which she later realized was born in Canada .\" I thought it was really scary, so I tried to imagine the Wendigo, \"Lee said of her Nov. 7 submission. She said the pieces take her between three and eight hours to make, so she's tried to streamline them by making a simpler one and working on a bigger one at the same time. Aaron Leighton--Nietzsche with Googly Eyes @ aal8n Aaron Leighton says he's a fan of philosophy and\" combining things that are ridiculous and sublime. \"Aaron Leighton says he's a fan of philosophy and\" combining things that are ridiculous and sublime. \"The natural result of those two affinities:\" Nietzsche with Googly Eyes, \"created with a marker and acryl gouache .\" Is nothing sacred? \"<mark>Steve Wilson</mark> (@ 5_star_rating) commented. Drew Shannon @ bonyfingers Drew Shannon is using the same three colours and follow supernatural and\" old fairytale \"themes. Though the project offered illustrators more creative freedom than they may be used to--save the time constraints--Drew Shannon gave himself parameters: He is to use the same three colours and follow supernatural and\" old fairytale \"themes, which match those of a book he is working on.", "articleID": "2015111200_00059302_W", "names": {"Dan Turner": ["Q18588465", "Q24006287", "Q24703003", "Q29001227", "Q5214516"], "Jack Nicholson": ["Q39792", "Q58917121"], "Steve Wilson": ["Q2347401", "Q26956113", "Q28543117", "Q7614324", "Q7614325", "Q7614326", "Q7614327", "Q7614329", "Q7614330", "Q7614332", "Q7614333"]}}, {"date": "2015-11-12", "url": "http://www.medicalnewstoday.com/releases/302544.php", "content": "Detailed results demonstrate baricitinib superiority to adalimumab in improving signs and symptoms of rheumatoid arthritis Published: Thursday 12 November 2015 at 6am PST Published: Thu 12 Nov 2015 at 6am PST email Adapted media release Eli Lilly and Company and Incyte Corporation have announced detailed data from the fourth Phase 3 study of baricitinib, RA-BEAM, at the American College of Rheumatology/Association of Rheumatology Health Professionals (ACR/ARHP) annual meeting in San Francisco. The findings demonstrated statistical superiority for investigational therapy baricitinib over adalimumab after 12 weeks based on several critical measures of rheumatoid arthritis (RA) disease activity, including ACR20, ACR50 and ACR70 response rates - composite scores that represent at least a 20 percent, 50 percent and 70 percent improvement in multiple measures of RA disease activity. Improvements in the mean number of swollen and tender joints and a reduction in pain were seen as early as week one for baricitinib versus placebo. At 52 weeks, baricitinib significantly improved all seven components of the ACR composite score compared to adalimumab, including reducing the number of tender and swollen joints, reducing patients' pain, and improving physical function. Patient-reported outcomes, including degree of tiredness and the severity and duration of morning joint stiffness, assessed daily for the first 12 weeks of the study, were all significantly improved with baricitinib compared to adalimumab. At week 52, structural changes in the joints, as measured by changes in the modified Total Sharp Score, were significantly improved for both baricitinib and adalimumab compared with placebo. Lilly and Incyte previously announced that the study met its primary objective of demonstrating superiority for baricitinib versus placebo based on ACR20 response rate after 12 weeks of treatment. \"Rheumatoid arthritis is a lifelong condition, but it can be managed with treatment to help control symptoms, including joint inflammation and fatigue, to slow the progression of the disease and improve a patient's quality of life,\" said <mark>Peter Taylor</mark>, M.A., Ph.D., F.R.C.P., study author and Norman Collisson chair of Musculoskeletal Sciences in the Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences at the University of Oxford. \"These findings suggest that the once-daily oral drug baricitinib, if approved, could provide another treatment option for those with insufficient response to current therapy .\" RA-BEAM was a 52-week trial of 1,305 patients who had active, moderate to severe RA, despite ongoing treatment with methotrexate. Patients were randomized to placebo once daily (n = 488), baricitinib 4 mg once daily (n = 487), or adalimumab 40 mg biweekly (n = 330). All patients received background methotrexate. At week 24, patients taking placebo were crossed over to baricitinib. \"This is the first Phase 3 study showing that a once daily, oral treatment significantly improved clinical outcomes compared with injectable adalimumab for patients with active RA who were also receiving treatment with methotrexate,\" said Dr Greg van Wyk, Senior Medical Director, Lilly UK. \"Lilly is committed to improving outcomes for patients living with this chronic condition .\" Serious adverse event rates were similar for baricitinib compared with placebo and lower for adalimumab, while serious infection rates were similar across groups *. There were no cases of gastrointestinal perforations. One event of tuberculosis was reported, in the adalimumab group. Four deaths occurred, one in the placebo arm, two in the baricitinib arm and one in the adalimumab arm. Two potential opportunistic infections occurred in the baricitinib arm; neither were considered serious. Temporary interruptions in treatment due to adverse events occurred with similar frequency across treatment groups. Lilly and Incyte announced top-line results in December 2014 for the first Phase 3 trial of baricitinib, RA-BEACON, in February 2015 for the second, RA-BUILD, in September 2015 for the third, RA-BEGIN and in October 2015 for the fourth, RA-BEAM. The companies will also share detailed results from the RA-BEGIN study at the American College of Rheumatology/Association of Rheumatology Health Professionals annual meeting this year, and plan to submit additional detailed data from all four studies for presentation in scientific meetings and publication in peer-reviewed journals in 2016. Detailed data from the long-term extension study, RA-BEYOND, will also be submitted for presentation in scientific meetings and publication in peer-reviewed journals in 2016. About Baricitinib Baricitinib is the only once-daily, oral, selective JAK1 and JAK2 inhibitor currently in late - stage clinical studies for inflammatory and autoimmune diseases. In December 2009, Lilly and Incyte announced an exclusive worldwide license and collaboration agreement for the development and commercialisation of baricitinib and certain follow-on compounds for patients with inflammatory and autoimmune diseases. About Baricitinib Phase 3 Trials Lilly and Incyte conducted four Phase 3 clinical trials of baricitinib in patients with moderately - to-severely active rheumatoid arthritis to support regulatory submission in most countries. The clinical trial program includes a wide range of patients including those who are methotrexate naïve, inadequate responders to methotrexate, inadequate responders to conventional disease - modifying anti-rheumatic drugs, or inadequate responders to TNF inhibitors. Patients completing any of the five Phase 3 studies can enroll in a long-term extension study. For additional information on this clinical trial program, please visit www.clinicaltrials.gov. Adapted by MNT from original media release Rate this article (click stars to rate) Detailed results demonstrate baricitinib superiority to adalimumab in improving signs and symptoms of rheumatoid arthritis Public / Patient:", "articleID": "2015111216_00037285_W", "names": {"Peter Taylor": ["Q20054080", "Q21064176", "Q21229966", "Q3056606", "Q323300", "Q403151", "Q47231522", "Q53784250", "Q54634454", "Q55629657", "Q57148484", "Q7177261", "Q7177262", "Q7177263", "Q7177264", "Q7177265"]}}]