[{"date": "2015-11-12", "url": "http://peninsulaclarion.com/arts-entertainment/2015-11-11", "content": "All about that bass: University Wind Ensemble concert highlights tuba Posted: November 11, 2015 - 3:44 pm | November 12, 2015 - 12:05 pm Updated: Photos Philip Hall/University of Alaska Anchorage <mark>Matt Murphy</mark> (center) and Seth Bodine (right) play in the bass section of the University of Alaska Anchorage Wind Ensemble. The group will make its annual stop in Kenai on Friday at Kenai Central High School. By ELIZABETH EARL Peninsula Clarion Most people don't see the tuba as a lead instrument. But on Friday, the University of Alaska Anchorage's Wind Ensemble plans to put the big brass horn in the spotlight. The ensemble will make its 11th annual stop at Kenai Central High School on Friday. The group, composed of woodwind instruments and brass, is mostly music students from the university, but some are students from other departments and members of the community, according to Dr. Mark Wolbers, the ensemble's conductor. \"If you think about orchestras, most of their repertoire is going to be 19th, 18th century pieces,\" Wolbers said. \"Their mainstay is Mozart, Beethoven and Brahms. When you do wind band conducting, you tend to be conducting more modern works that were composed within the last 100 years .\" The featured piece, \"Tuba Concerto,\" was written 61 years ago by British composer Edward Gregson and runs a hefty 19 minutes, Wolbers said. Because the tuba is a newer instrument--invented in the mid-19th century and still largely a support instrument--there are few pieces in the tuba's repertoire. Gregson's piece was considered the first concerto for tuba, Wolbers said. The music he selected for the ensemble, which tours Anchorage and the Kenai Peninsula in the fall, centers around a connection to British band music. Brass bands were common in the U.K. throughout the 20th century, forming the centerpiece for many communities. Some still exist today, Wolbers said. \"Even though our music comes from around the world--we have a piece from New Zealand--it was originally arranged for British brass band, and we have an Australian composer,\" Wolbers said. \"And a piece by Vaughan Williams...it all has the former British Empire kind of relationship .\" The band will play selections from the works of <mark>Peter Graham</mark>, Percy Grainger and Ralph Vaughan Williams as well as an American composer, Eric Whitacre. The tuba concerto will be anchored by Jeffrey Manley, an adjunct professor at UAA and former U.S. Air Force musician. Manley has toured the U.S. and most of Alaska, he said--including every single school in the Bering Strait School District in northern Alaska. \"In all those villages, the school is the central place,\" Manley said. \"It's where everything happens. When the plane lands and you're not from there, suddenly you become a minor celebrity. The whole village would turn out .\" The tuba has been a lifelong commitment, Manley said. The fifth of six siblings, he said he grew up watching his older sisters and brothers enter the band class and select instruments and knew the tuba was for him. He marched for five years with the Cavaliers Drum & Bugle Corp. in Chicago and served 20 years as an Air Force musician, playing in Tacoma, Washington and eventually in Anchorage. He primarily works at Alaska Music & Sound: Home of the Horn Doctor in Anchorage but took an adjunct position teaching applied music for the tuba at UAA. That was when Wolbers approached him with the idea of playing \"Tuba Concerto\" with the wind ensemble. \"A lot of people don't think of the tuba as a solo instrument, but we deserve the recognition,\" Manley said. Wolbers said the music scene has grown in Alaska since he began teaching at UAA in 1992. His first band class included six students; today, he teaches classes with ensembles of up to 40, he said. Even the community members come from other trades and play music on the side, he said. \"I think (the arts scene) has matured quite a bit,\" Wolbers said. \"You see that everywhere, even down on the peninsula. You think about the last 20 years, what's happened with the Kenai Peninsula Orchestra. It's quite different than what it was when I came here .\" The concert will be held at the Kenai Central High School Henderson Auditorium from noon to 1 p.m. on Friday. Admission is free.", "articleID": "2015111221_00089971_W", "names": {"Matt Murphy": ["Q137546", "Q16213156", "Q6789105", "Q6789106", "Q6789107", "Q6789108", "Q6789109"], "Peter Graham": ["Q13407646", "Q21463827", "Q371099", "Q7174323", "Q7174327", "Q7174328", "Q7174329", "Q7174330", "Q7174332"]}}, {"date": "2015-11-12", "url": "http://nyblueprint.com/judd-apatow-and-friends", "content": "Shabbat & Holidays Judd Apatow and Friends Judd Apatow is one of the most important comic minds of his generation. He wrote and directed the films \"The 40-Year-Old Virgin\" (co-written with Steve Carell), \"Knocked Up,\" \"Funny People,\" and \"This is 40,\" and his producing credits include \"Superbad,\" \"Bridesmaids,\" and \"Anchorman .\" Apatow is the executive producer of HBO's \"Girls .\" He also executive produced \"Freaks and Geeks,\" created \"Undeclared,\" and co-created the Emmy Award-winning television program \"The Ben Stiller Show .\" His latest film is \"Trainwreck .\" He recently released \"Sick in the Head: Conversations About Life and Comedy,\" a collection of intimate, hilarious conversations with the biggest names in comedy from the past thirty years that spent ten weeks on the New York Times Best Seller List. All proceeds go to 826, a charity which provides free tutoring and literacy programs for kids. Judd began performing stand up at the age of seventeen, appearing on the 1992 \"HBO Young Comedians Special\" hosted by Dana Carvey. After a 20 year hiatus, Apatow recently returned to the stand up stage and performed on \"The Tonight Show with Jimmy Fallon .\" Last year he created \"An Evening with Judd Apatow and Friends,\" a comedy show at Largo at The Coronet in Los Angeles which benefits various charities and has included guests such as Randy Newman, Fiona Apple, Louis CK, Tig Notaro, <mark>Ryan Adams</mark>, Jackson Browne, <mark>Kevin Hart</mark> and Bill Burr. Having grown up on Long Island, Judd is thrilled to perform at Carnegie Hall for the first time.", "articleID": "2015111306_00012585_W", "names": {"Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"], "Ryan Adams": ["Q27306062", "Q3453739", "Q437970"]}}, {"date": "2015-11-14", "url": "http://in.reuters.com/article/2015/11/14/hacking-indictment-outsourcing-idINKCN0T308B20151114", "content": "Hired-gun hacking played key role in JPMorgan, Fidelity breaches NEW YORK/SAN FRANCISCO | By Jim Finkle and Joseph Menn U.S. Attorney for the Southern District of New York Preet Bharara points to a chart during a news conference in New York November 10, 2015. Reuters/Shannon Stapleton NEW YORK/SAN FRANCISCO When U.S. prosecutors this week charged two Israelis and an American fugitive with raking in hundreds of millions of dollars in one of the largest and most complex cases of cyber fraud ever exposed, they also provided an unusual look into the burgeoning industry of criminal hackers for hire. The trio, who are accused of orchestrating massive computer breaches at JPMorgan Chase & Co and other financial firms, as well as a series of other major offences, did little if any hacking themselves, the federal indictments and a previous civil case brought by the U.S. Securities and Exchange Commission indicate. Rather, they constructed a criminal conglomerate with activities ranging from pump-and-dump stock fraud to Internet casino break-ins and unlicensed Bitcoin trading. And just like many legitimate corporations, they outsourced much of their technology needs. \"They clearly had to recruit co-conspirators and have that type of hacker-for-hire,\" said Austin Berglas, former assistant special agent in charge of the FBI's New York cyber division, who worked the JPMorgan case before he left the agency in May. \"This is the first case where it's that clear of a connection .\" Berglas, who now heads cyber investigations for private firm K2 Intelligence, said additional major cases of freelance hacking will come to light, especially as more people become familiar with online tools such as Tor that seek to conceal a user's identity and location. RENTED TIME This week's indictments accused a hacker referred to as \"co-conspirator 1\" of installing malicious software on the servers of multiple victims at the direction of Gery Shalon, the alleged mastermind of the scheme now under arrest in Israel. A second indictment charges a man referred to as <mark>John Doe</mark>, believed to be in Russia, for an attack on online trading firm E * Trade. Officials have not said if the co-conspirator and <mark>John Doe</mark> were the same person, or even if the FBI knows their true identities. Law enforcement and computer security officials say that outsourced cyber-crime services - including rented time on networks of previously compromised personal computers and custom break-ins - are most readily found on underground Russian-language computer forums, where skilled attackers advertise their services. The forums are tight-knit communities where newbies must be vouched for by multiple known members and pay membership fees that cost thousands of dollars, said <mark>Daniel Cohen</mark>, who oversees an undercover team at EMC Corp's RSA Security that monitors the forums. \"You can find anything you want for an operation. Hackers, servers, software, code writing. They are all available,\" said <mark>Cohen</mark>. Individuals hide their identities even from each other, making infiltration and arrests rare. In this case, the ringleaders are accused of hiring hackers to steal contact information and other data that they then used to help convince ordinary investors to buy little-regulated stocks. Prosecutors have not disclosed how the hackers were compensated. Fees vary greatly in the cyber underground, depending on the complexity of the assignment and supply of talent available to do a particular job. Elite hackers who pull off the most technically challenging attacks might get a percentage of profits, while others might earn an hourly rate or get paid a few thousand dollars for winning access to a target's network, researchers said.PUMP-AND-DUMP All three of those accused this week - Shalon, Joshua Samuel Aaron, who is at large, and Ziv Orenstein, who is also in jail in Israel--began promoting penny stocks before the hacks took place, according to U.S. government claims. They used websites including Pennystockdiscoveries.com and Stockcastle.com to send emails as part of a scheme in which they invested in penny stocks, spread false information to boost their prices, and then sold them to make windfall profits, according to an SEC suit filed in July. Orenstein's lawyer declined to comment, and Shalon's lawyer did not return messages seeking comment. In one case in early 2012, the SEC claims that they used the website Stockcastle.com to promote shares in Mustang Alliances Inc, reaping $2.2 million, the largest pump-and-dump cited in the regulator's lawsuit. In March of that year, the British Virgin Islands Financial Services Commission issued an alert warning that two entities tied to Stockcastle were falsely claiming to be registered in the territory. That same year, the enterprise began a massive hacking spree to get contact information for investors who might be good targets, according to prosecutors. By the end of 2013 they had ordered up six hacks that provided data on tens of millions of customers, prosecutors said. They hit the mother lode in 2014 when they attacked three other firms, and stole data on 83 million customers from JP Morgan alone, prosecutors said. In addition to JP Morgan and E * Trade, the firms attacked included the mutual fund giant Fidelity Investments, Scottrade, TD Ameritrade Holding Corp and News Corp's Dow Jones unit, the publisher of the Wall Street Journal, according to court documents and people familiar with the cases. \"To do a\" pump-and-dump' operation, you no longer need 30 people behind phones in a strip mall, \"said Shane Shook, a security consultant specializing in investigating financial breaches. All you need is to find a hacker on a\" Dark Web \"forum to provide addresses from customers of financial services firms like Fidelity or JPMorgan, then hire a spam service to push out promotional emails, he said. Shalon bragged about the stock manipulation scheme, telling the hacker known as co-conspirator 1 in a web chat message that it was\" a small step towards a large empire, \"according to the indictment. His plan, Shalon told the hacker, was to distribute\" mailers \"on stocks to those customers. The hacker asked if buying stocks was popular in America, the indictment said, prompting Shalon to reply:\" It's like drinking freaking vodka in Russia. \"Shalon ultimately made good on his promise to build an empire, according to the indictments. Profits from the pump-and-dump fed into a sprawling conglomerate including offshore Internet casinos and payment-processing services for other criminal operators, such as counterfeit pharmaceutical makers. Shalon also allegedly directed hackers to attack rival casinos, stealing customer data and temporarily bringing down their websites with denial-of-service attacks, which are easily commissioned online. BUTTERFLY AND HIDDEN LYNX While this week's indictments opened the first major criminal case involving outsourced hacking, there have been other substantial break-ins that researchers believe were contract jobs. Researchers at Symantec in July attributed a series of precision breaches at Apple, Facebook, Microsoft and Twitter in 2012 and 2013 to a sophisticated gang called Butterfly, which also attacked law firms and pharmaceutical companies. Computer security firm Symantec concluded that the group likely works for hire, either for a client looking for financial gain in the stock market or for competitors. How Butterfly gets hired remains unclear. Tech criminologist Marc Goodman, author of the book\" Future Crimes \", says another group, dubbed Hidden Lynx by Symantec, may consist of contractors moonlighting from jobs with the Chinese military. here\" It's crime as a service, \"\"Goodman said .\" They take all the pain out of it. \"(Reporting by Joseph Menn in San Francisco and Jim Finkle and Nate Raymond in New York; Additional reporting from Maayan Lubell in Jerusalem; Editing by Jonathan Weber and Martin Howell .) Trending On Reuters", "articleID": "2015111404_00093834_W", "names": {"Daniel Cohen": ["Q1835077", "Q3013863", "Q3013871", "Q5216825", "Q5216826", "Q53544958"], "John Doe": ["Q23727991", "Q3181360"]}}, {"date": "2015-11-16", "url": "http://www.firstpost.com/politics/mobile-phone-is-dangerous-keep-off-it-unless-its-necessary-says-mulayam-2508296.html?utm_source=fp_hp", "content": "Mobile phone is dangerous, keep off it unless it's necessary, says Mulayam - Firstpost firstpost #Amitabh Thakur #lUCKNOW #Mobile phone #Mulayam Singh Yadav #Narendra Modi #NewsTracker #Pradeep Shukla #Shareworthy #Uttar Pradesh Lucknow: In an era when more and more public services and facilities are being offered as mobile application (or apps) for wider reach to the people for their use, the president of the ruling party in Uttar Pradesh Mulayam Singh Yadav has cautioned people in general to stay away from the mobile phone, terming it \"dangerous .\" Speaking at a function to release a book written by the daughter of an IAS officer accused in the NRHM scam in Lucknow recently, Mulayam cautioned his party leaders, women, girls and the people in general, to use mobile phones only when it was \"very necessary\". He said the mobile phone conversation could always be recorded and later misused. Mulayam Singh Yadav. PTI He went on to say that he was specifically telling this to girls and women, to beware of this gadget as \"a lot of indecent things\" happen due to this instrument. The book on orphaned children has been written by the daughter of Pradeep Shukla, who was accused and then jailed in the NRHM scam and is currently out on bail serving as a Principal Secretary to the government. Mulayam's statement gains significance in the backdrop of the allegation by an IPS officer Amitabh Thakur, currently under suspension, that the SP president had threatened him on phone in July. Mulayam alluded to this connection by saying that he himself had landed in a trouble due to the use of the mobile phone. \"Once I said something on the mobile phone and the conversation was recorded...It is good that the India is developing and technology like computer also growing. But mobile phone--it's a dangerous instrument,\" he said. He also added that he did not use mobile phone unless it was unavoidable. \"If somebody calls me on the mobile then I snub that person and ask him what prevents him from calling on the land line? One may call me on the mobile phone if I am away from home in a field in the village .\" The SP and its leaders have in the past too been particularly piqued at these gadgets. On 23 October senior minister Mohammad Azam <mark>Khan</mark> had blamed smart phones for the rise in crime against women. Referring to recent incidents in Delhi where two toddlers were raped and assaulted, <mark>Azam Khan</mark> had said pornographic material is easily accessible over smartphone to people even in villages which are ruining the growth of children and youth. Last year Mulayam had even laid the blame on computers and laptops for his party's defeat in the Lok Sabha election. He had said that he had cautioned his son Akhilesh not to distribute laptops to students, but these were distributed, \"and Modi had cleverly put his photos and speeches on the laptop,\" he had said. Although later he had also said at a function in the Press Club in Lucknow that the social media had its own uses and should be properly utilized. Later, reacting to Mulayam's statement, Amitabh Thakur said that the mobile phone was a \"wonderful\" instrument that had brought the people of the world closer to each other. \"Only those people need to be scared of it who use it for wrong or unlawful purposes. If we use it for the right purpose then why should we be scared?\" he asked. Amitabh Thakur and his wife Nutan have been alleging that the SP government has been hounding them ever since Nutan filed a complaint related to illegal mining against the mining minister Gayatri Prajapati. Amitabh has also filed a complaint that Mulayam had threatened Amitabh on telephone during a conversation on July 10. The police had initially failed to register even a complaint but later lodged it after Thakur moved court. Although the Hazratganj police in Lucknow has filed the final report in this case, the court has asked Thakur to present his arguments on November 19. The Uttar Pradesh government has introduced several mobile apps including those for police assistance and tourism information, and these are quite widely used as well. The offices of the Chief Minister and Chief Secretary have been highly active on the social media, and all government decisions are routinely and speedily flashed on social media. more in India", "articleID": "2015111609_00051405_W", "names": {"Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"]}}, {"date": "2015-11-17", "url": "http://www.epmag.com/swiss-pumpmaker-sulzer-appoints-greg-poux-guillaume-ceo-827796", "content": "Swiss Pumpmaker Sulzer Appoints Greg Poux-Guillaume As CEO Reuters Tuesday, November 17, 2015 - 7:33 am Print Share this with others Log in to post comments Email this page Sulzer AG has hired Greg Poux-Guillaume as its new chief executive effective Dec. 1, the Swiss pumpmaker said on Nov. 17. \"He brings a comprehensive knowledge and broad understanding of many of our key markets, particularly in the oil and gas market and the power industry,\" Sulzer Chairman Peter Loescher said in a statement. Poux-Guillaume was president and CEO of Alstom Grid, acquired effective Nov. 2 by General Electric Co. (NYSE: GE) from Alstom, from 2011 to 2015, Sulzer said. He will take over from interim CEO <mark>Thomas Dittrich</mark> who will return full-time to his role as finance chief after taking temporary charge in August following the departure of Klaus Stahlmann.", "articleID": "2015111715_00038218_W", "names": {"Thomas Dittrich": ["Q41446983", "Q998839"]}}, {"date": "2015-11-17", "url": "http://rgj.com/story/news/education/2015/11/17/unr-military-interested-using-gumweed-jet-fuel/75928328/", "content": "<mark>Glenn Miller</mark> and Bishnu Neupane hold the final biofuel product based on the gumweed plant. The fluids in the tubes have been diluted at different levels and are being examined in the labs at the Applied Research Facility at the University of Nevada, Reno main campus. (Photo: Courtesy of Whip Villarreal) CONNECT TWEET LINKEDIN COMMENTEMAILMORE A University of Nevada, Reno professor is leading the way on converting a native roadside weed into fuel that could help the military. Glen Miller has been working to convert gumweed into a biofuel, which could be used as jet fuel for the military, UNR officials said in a news release on Monday. \"We are looking at breaking it down because it uses less water and it's already acclimated to Nevada conditions,\" Miller said in a statement. \"It would be beneficial generating this arid-land crop because it doesn't compete with food or animal feed .\" The primary resource for diesel fuel is soy beans and ethanol for corn which are always in direct competition with food. \"The final biofuel product could produce up to 122 gallons per acre on a biennial basis, attracting the U.S. Navy's interested in using it as jet fuel, Miller said in the news release .\" ...Gumweed is native in Nevada and grows on the side of freeways and, more importantly, is an arid land crop that requires less water than other substitutes like alfalfa, \"Miller said in the statement .\" Alfalfa takes five feet of water to grow while gumweed uses no more than a foot of water. \"Gumweed was planted at the UNR's Valley Road Field Laboratory and the Main Station Field Laboratory. After it grew and was harvested, it was broken down to a liquid that smells like tar, UNR officials said. The project received $500,000 in grant funding from the United States Department of Agriculture. It has the potential to supply up to 20 percent of fuel demand for the military, UNR officials said. Hongfei Lin is a professor of chemical and materials engineering, who is working with Miller on the project .\" It is estimated that if even 10 percent of sagebrush-covered lands in Nevada are used to grow gumweed for aviation biofuels, 400 to 600 million gallons per year of jet biofuels could be produced \", Lin, a College of Engineering collaborator, said in the news release .\" That's definitely incredible. There's lots of potential. \"Marcella Corona covers breaking news for the Reno Gazette-Journal. Contact her at 775-788-6340, online at mcorona @ rgj.com or follow her on Twitter at @ Marcella_Anahi or on Facebook at Facebook.com / Marcella.Anahi CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //on.rgj.com/1j5I0Bu", "articleID": "2015111717_00060986_W", "names": {"Glenn Miller": ["Q5568999", "Q57433120"]}}, {"date": "2015-11-25", "url": "http://www.peterboroughtoday.co.uk/cambridgeshire-police-launch-crackdown-on-rural-crime-1-7083387", "content": "Cambridgeshire police launch crackdown on rural crime The Police Tractor ENGANL00120120309110316 09:02 Wednesday 25 November 2015 3 Have your say As part of a crackdown on rural crime, Cambridgeshire police is holding a day of action to target criminals operating in rural areas of the county. The rural crime day of action, delivered in partnership with the National Farmers Union (NFU) and Countryside Watch, is being held today (Wednesday November 25) across Cambridgeshire. Chief Inspector <mark>James Sutherland</mark>, event organiser, said: \"Parts of Cambridgeshire are very rural areas which can often be targeted by criminals .\" While we have seen the number of rural crime incidents in the county reduce by about a third in the past year, we have seen a spike in hare coursing, which will be our focus during the day of action. \"Our intention is to target offenders through mobile patrols and stop checks and deal with offences where they are found. This will be done using a combination of regular serving police officers, members of the Special Constabulary and partnership agencies .\" A tractor has kindly been loaned to the force free of charge for the event by horticultural machinery dealer, Ben Burgess, and will be branded with the full police Battenberg. Ch Insp <mark>Sutherland</mark> added: \"I would like to thank Ben Burgess for their generosity in loaning us one of their tractors as this will play a key part in helping us engage with members of the public and raise awareness of rural issues, including safe driving around tractors .\" As well as having officers out conducting anti-hare coursing and poaching patrols, officers will be highly visible driving the tractor across the county in a bid to educate drivers about safety when tractors are being driven on the road. \"A number of\" barn meetings' will be held in conjunction with Cesar It, who will be on hand to install property marking systems on industrial machinery. The meets will be held at: & middot; Parkfield Sports and Social Club, Chapel Lane, Wimblington near March, at 7pm on Wednesday evening & middot; 7 Park Farm, Sandpit Road, Thorney, Peterborough, at 8.30 am on Thursday morning & middot; Abbots Ripton Village Hall, The Green, Huntingdon, at 12pm on Thursday afternoon & middot; Cole Ambrose Ltd, Harlocks Farm, Soham Road, Ely, at 3.30 pm on Thursday afternoon & middot; National Trust Wimpole Home Farm Café, Home Farm, Old Wimpole Road, Arrington, Royston, at 7pm on Thursday evening", "articleID": "2015112610_00042009_W", "names": {"James Sutherland": ["Q28728572", "Q29842917", "Q58219239", "Q59553587", "Q6143855"]}}]