[{"articleID": "2019032921_00859881_W", "names": {"Colin Wilson": ["Q1108757", "Q1708464", "Q20018732", "Q21465762", "Q358746", "Q368831", "Q505667", "Q5145685", "Q5145686", "Q5145687"]}, "date": "2019-03-29", "url": "https://denver.cbslocal.com/2019/03/29/colorado-avalanche-gabriel-landeskog-2/", "content": "Filed Under: Colorado Avalanche, Gabriel Landeskog By Brian Madden DENVER (CBS4)--The Captain returns tonight. Avalanche Head Coach Jared Bednar made it official Friday morning by declaring Gabriel Landeskog fit for action. \"Yeah, he's playing tonight,\" said Bednar. NEWARK, NEW JERSEY--OCTOBER 18: Gabriel Landeskog #92 of the Colorado Avalanche celebrates his hat trick goal at 16:38 of the third period against the New Jersey Devils at the Prudential Center on October 18, 2018 in Newark, New Jersey. The Avalanche defeated the Devils 5-3. (Photo by Bruce Bennett/Getty Images) Landeskog will lineup with Carl Soderberg and <mark>Colin Wilson</mark> against the Arizona Coyotes. His return will be a positive influence as the Avs battle for the final playoff position with the Coyotes. \"It's great to have him,\" said Avs center Nathan MacKinnon. \"He's our leader, just his presence in the room is going to be great for us tonight .\" The puck drops at Pepsi Center at 7 p.m. Friday as the Avs take on the Arizona Coyotes."}, {"articleID": "2017033121_00025463_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-03-31", "url": "http://dcist.com/2017/03/will_ferrell-themed_pop_up_bar_is_c.php", "content": "Will Ferrell-Themed Pop Up Bar Is Coming To H Street (Really) by Rachel Sadon in Food on Mar 31, 2017 4:46 pm Note: we're not sitting on a throne of lies here, April's Fools (observed) be damned. A new pop-up bar is coming from a group of people who love Will Ferrell as much as Ron Burgundy loves scotch. New York's famed Stay Classy Will Ferrell-themed tribute bar has taken its show on the road, with plans to open for at least a month on H Street NE starting in May. That means you can soon be sipping a glass of You're My Boy Blue, Smelly Pirate Hooker, A Whale's Vagina, or Glass Case Of Emotion while a Ron Burgundy impersonator bellows from behind an Anchorman desk. \"It's such a happy environment--people come and have a blast,\" says Stay Classy co-creator Zach Neil. \"It's like the fun bus has rolled into town .\" There are plenty of Elf references, but Neil and his partners are true Ferrell aficionados and you can expect some deep cuts and kitsch going all the way back to his SNL days. Given an official launch date on Cinco de Mayo, Neil notes it is the perfect opportunity to get in references to Casa de Mi Padre (one my personal favorites). They're even thinking about bringing in a live mariachi band. Unlike the original, Stay Classy's D.C. outpost will also offering food--giant, over-the-top burgers. The Ma's Meatloaf burger (a Wedding Crashers reference), for example, will see a toasted brioche bun brushed with honey garlic butter and then topped with a seasoned fried potato cake, two cuts of meatloaf, smoked cheddar cheese, tomato chutney sauce, and crispy onions straws. And they're flying in one of the nation's premiere Ferrell impersonators from Minnesota to sit behind a Channel 4 news set and read the \"news\" (read: half-priced shots). After a decade working in the music industry, Neil got involved in the bar and nightlife scene--owning a club in Pennsylvania and becoming a partner at a bar in Times Square. But at some point, he realized that most bars fall into predictable tropes--sports bars, Irish pubs, rowdy taverns--that are charging as much for cocktails as an entire bottle of liquor. \"There was nothing going on in the bar world that would make anyone my age want to go to a bar. So I thought, what if I just opened something I'm interested in,\" Neil says, and there are few things that give him greater joy than Will Ferrell movies. \"I tried to think of something in my life, no matter how bad my day was, something that could consistently cheer me up. Enter Buddy the Elf, Chazz Reinhold, Jacobim Mugatu, and Ricky Bobby. Neil thought to himself:\" Either it would the dumbest thing I've ever done, or it would fail miserably but I'd have a really great story...if I lost my money at least I'm doing it over the top and ridiculous .' After a bit of a slow start (he says the first few weeks were \"crickets,\" with bartenders making $4 in tips a night), word got out and there were soon lines around the Lower East Side location stretching for hours. They wound up staying for 14 months, closing only once interest started to wane. He's since turned to other concepts in New York, like a Tim-Burton themed bar called Beetle House, and taken Stay Classy on the road. They've brought the concept to Los Angeles and are settling in for a 10 day stay in Boston before heading to our fair city. But although D.C. once played host to an entire Anchorman exhibit, the District wasn't originally on Neil's radar. \"Ever since they elected <mark>Donald Trump</mark>, I didn't want to go near D.C.,\" he says. The owner of Mythology, a newly opened restaurant on H Street NE, actually gave the team a call and invited them to set up shop in a lounge space. Neil had a change of heart, realizing the Washingtonians need a dose of laughter more than anyone else. \"I was like, D.C. of all places needs some cheer and fun in their life. Let's come in to town and bring some cheer .\" Stay Classy is set to have a soft opening on May 3 and an official launch on May 5 at Mythology (816 H Street NE); it will stay open for a month, though they may choose to extend it. The bar will be first-come, first-served, but they plan to take reservations for dinner. More details will be available next week. Contact the author of this article or email tips @ dcist.com with further questions, comments or tips."}, {"articleID": "2011110502_00062071_W", "names": {"Bill Smith": ["Q17017840", "Q20273869", "Q4020151", "Q4400961", "Q4910910", "Q4910914", "Q4910916", "Q4910919", "Q4910920", "Q4910921", "Q4910925", "Q4910927", "Q56274191", "Q621106", "Q862469"], "Terry Ryan": ["Q23020633", "Q3518931", "Q4993791", "Q7704975", "Q7704976", "Q7704977"], "Brandon Phillips": ["Q2923776", "Q56254589"], "Josh Hamilton": ["Q641352", "Q716346"]}, "date": "2011-11-05", "url": "http://startribune.com/sports/133280168.html", "content": "joe christensen, star tribune updated: november 4, 2011 - 9:39 pm coming off a 99-loss season, the twins aren't planning a major front office shake-up, but they are working on some important tweaks. the team is close to rehiring former assistant general manager wayne krivsky, likely as a special assistant to gm <mark>bill smith</mark>. krivsky could have a deal with the twins by next week, people familiar with the discussions said friday. another priority is keeping vice president of player personnel mike radcliff. this week, the twins denied the orioles permission to interview radcliff for baltimore's vacant general manager job. citing an industry source, the mid-atlantic sports network reported friday that the twins denied permission \"because of internal reorganization and promotions that could be in the works .\" twins officials later explained that radcliff's title won't be changing--at least not now--but the plan is to have the former scouting director focus less on amateur scouting, allowing him to concentrate more on the major league club's specific needs. it's not clear whether radcliff had any interest in baltimore's job. he declined to comment friday, as did <mark>smith</mark>. twins president dave st. peter said, \"we are not going to comment on another team's staffing issue and/or executive search .\" the twins have enough on their own plate, trying to bounce back from a 63-99 season. it wasn't a good year for the front office, which raised the payroll to a franchise-record $115 million and sunk to last place. many recent trades--including wilson ramos to washington for matt capps, j.j. hardy to baltimore for jim hoey and delmon young to detroit for lester oliveros--have turned into duds for the twins and boons for the other team. under former gm <mark>terry ryan</mark>, the twins were often on the other side of lopsided deals, such as the one that sent a.j. pierzynski to san francisco for joe nathan, boof bonser and francisco liriano. krivsky was <mark>ryan</mark>'s top talent advisor for that 2003 trade, and others. after the 2005 season, krivsky left to become the reds gm. in cincinnati, he acquired future all-stars bronson arroyo, <mark>brandon phillips</mark> and <mark>josh hamilton</mark>, but his reds teams combined to go 161-184. in april 2008, reds owner bob castellini executed a squeeze play, replacing krivsky with walt jocketty. krivsky, 57, went on to become a special assistant for the orioles and mets, but he has told people he longs for a return to the twins. the twins have spoken with krivsky about a role that would return him to pro scouting--he was the team's top national league scout under <mark>ryan</mark>--and they would look to him for advice on trades and contract signings. the team's current inner circle includes <mark>smith</mark>, radcliff, assistant gm rob antony and <mark>ryan</mark>, who serves as a senior advisor. all worked with krivsky for years and would welcome him back into the fold. 11/6/11 12:00 pm kansas city 11/5/11 11:00 am (15) michigan state 11/5/11 11:00 am connecticut 11/5/11 11:00 am (24) west virginia 11/5/11 2:30 pm (7) oklahoma 11/5/11 2:30 pm oregon state 11/5/11 7:00 pm (3) oklahoma state 11/5/11 7:00 pm san diego st 11/8/11 7:00 pm bowling green 11/12/11 2:00 am (11) clemson 11/12/11 2:00 am (8) arkansas 11/12/11 2:00 am (18) georgia"}, {"articleID": "2010012220_00075556_W", "names": {"Stephen Harper": ["Q206", "Q7609425"]}, "date": "2010-01-22", "url": "http://canada.com/Buses+cash+radios+flow+amid+Haiti+rubble/2473756/story.html", "content": "buses, cash and radios flow amid haiti's rubble an american soldier distributes aid to a haitian boy at a refugee camp in port-au-prince, haiti. photograph by: hans deryk/reuters, np port-au-prince--cash became available and buses started running in haiti's rubble-clogged capital friday but there was still not enough food to feed desperate earthquake survivors who were expected to need emergency aid for months. \"we can do this 24 hours a day for the next six months and we still won't meet the need,\" said first sargent rob farnsworth, part of a u.s. army airborne unit handing out food packs at a squalid camp where survivors lived in the open air. up to 1.5 million haitians lost their homes in the jan. 12 earthquake that rocked the small caribbean country, devastated its capital port-au-prince and killed up to 200,000. relief agencies estimated one-third of haiti's nine million people would need emergency food, water and shelter for an extended period. haitians struggled to find food, water and medical care. even those whose homes withstood the magnitude 7 quake were too traumatized by aftershocks to sleep under a roof. there were signs of daily life resuming. taptaps, haiti's small, colorfully decorated private buses, circulated in port-au-prince, sharing streets with the earth-movers and digging machines clearing debris. banks were scheduled to reopen on saturday and money transfer agencies did brisk business after opening on friday. \"i want to get some cash sent by my family from canada. it's $500 but it's difficult. there are so many people,\" said businessman aslyn denis, 31, waiting in a line with hundreds of people, some of them jostling each other, outside a unitransfer office. the dead body of a young man lay in a street, his head swollen and bloody. residents said he tried to steal money and was stoned by a crowd. he wore socks but his shoes were gone and his pockets had been pulled out. edmond mulet, acting head of the u.n. peacekeeping mission in haiti, said coordination in delivering aid was getting better every day. the world food program distributed 1.2 million food rations to hospitals and orphanages on thursday and hoped to give out 10 million in the next week. \"we may be able to scale up even quicker,\" said josette sheeran, executive director of the u.n. world food program. \"we finally have supplies and food coming in from all over the world .\" the seaport in port-au-prince was repaired enough to partially reopen for cargo ships, while airstrips outside the capital and in the dominican republic received relief flights. but nearly 1,000 hungry people swarmed a u.s. military truck as an 82nd airborne company known as \"the beast\" handed out food and water at an encampment on a soccer field. overwhelmed, the troops pulled out after distributing 600 packaged meals, leaving 250 food packs still on the truck. a large supermarket, big star market, reopened in the petionville suburb on friday, selling everything from slabs of ham and goat meat to valentine's day chocolates. but the store manager said they had only a week or two of stocks left and had received no deliveries. haitians are realizing it could take months or years to regain some sense of normalcy. \"we want it to be over, but it's not finished yet, things are bad,\" said jeanette, a 53-year-old architect shopping at the market. \"i've lost my office. i've lost a whole year of work. we have no stability, no direction, we've been left to fend for ourselves. we can't plan for the future, we're just living day-to-day .\" the united nations counted nearly 450 encampments in port-au-prince alone where the homeless huddle, cook and sleep amid mounds of garbage. more than $1.2-billion has been pledged to help rebuild roads, government buildings and homes, but the world bank said much more would be needed to get haiti on its feet. \"my anticipation is that $1.2-billion is just the floor,\" the bank's director for the caribbean, yvonne tsikata, told france 24 television. the international monetary fund urged donors gathering in montreal next week to adopt a marshall plan for haiti, similar to the u.s. effort that helped rebuild europe after the second world war. \"it is not unrealistic to imagine that the country can be rebuilt as a prosperous nation. but it needs help over a prolonged period,\" imf managing director dominique strauss-kahn wrote on the huffington post. u.s. navy helicopters ferried in boxes of water to distribute to haitians lined up at a sprawling camp that covered a golf course. actor sean penn stopped by to deliver antibiotics, painkillers and water filters. \"the whole city has collapsed,\" he said. u.s. troops were giving away 50,000 solar - and crank-powered radios to help displaced haitians receive announcements telling them where aid was available. more than 13,000 u.s. military personnel are in haiti and on ships offshore, flying in supplies, evacuating the seriously wounded and protecting aid distribution points. the united nations is adding 2,000 troops and 1,500 police to its 9,000-member peacekeeping mission. but for many, life remained precarious. at another camp in port-au-prince, a woman tried not to moan in pain as a student doctor bandaged her badly-injured leg. in the dirty tent where he worked, cooking pots bubbled and a dog slept inches from the open wound. \"of course there is the risk of infection,\" said alexi guyto, 26. \"for the most part, we have lost the people who came with major traumas after the earthquake but we still have lots of head and other injuries .\" supplies from b.c. residents reaches haiti orphanage an american soldier distributes aid to a haitian boy at a refugee camp in port-au-prince, haiti. innocent man beaten by officers did not resist: vancouver police toyota recalls vehicles over accelerator problems conan o'brien reaches deal to leave nbc's tonight show prime minister <mark>stephen harper</mark>, speaking to his caucus on parliament hill, says \"canada is safer, stronger and better off\" after four years of conservative...federal ndp making gains at liberal, tory expense: poll byelection wins for tories \"another bad day' for liberals ignatieff would do worse in election than dion: poll"}, {"articleID": "2016071513_01077981_W", "names": {"Lars Bender": ["Q1354696", "Q152886"], "Robert Bauer": ["Q18412638", "Q19646574", "Q42059709", "Q56215720", "Q7341941"], "Julian Brandt": ["Q3189078", "Q5584957"], "Nils Petersen": ["Q159123", "Q23061415"]}, "date": "2016-07-15", "url": "http://www.football411.com/story/0,22162,14287_179211,00.html", "content": "Germany announce Olympic football squad Share: RSS Feed Germany have named a strong squad featuring Sven and <mark>Lars Bender</mark> for the Olympics set to take place in Rio de Janeiro next month. The 18-man squad was officially unveiled via the official German Football Association (DFB) website, with coach Horst Hrubesch highlighting the unique blend of players selected - from the u21 national team through to the senior national team. \"The anticipation ahead of the Olympics is huge. This is a unique experience that the players will be able to tell their grandchildren about .\" \"We have a good mix, from the current U-21 national team and the older players. The quality is absolutely great. We go to Brazil to win every game,\" Hrubesch told the DFB website. Germany are set to take part in their first Olympic football tournament since 1988 and begin their campaign against Mexico on 4 August. SQUAD IN FULL: Goalkeepers: Timo Horn (Cologne), Jannik Huth (Mainz) Defenders: <mark>Robert Bauer</mark> (Ingolstadt), Matthias Ginter (Borussia Dortmund), Lukas Klostermann (RB Leipzig), Philipp Max (Augsburg), Niklas Sule, Jeremy Toljan (Hoffenheim) Midfielders/Forwards: <mark>Lars Bender</mark> (Bayer Leverkusen), Sven Bender (Borussia Dortmund), <mark>Julian Brandt</mark> (Bayer Leverkusen), Max Christiansen (Ingolstadt), Serge Gnabry (Arsenal), Leon Goretzka, Max Meyer (Schalke), <mark>Nils Petersen</mark> (Freiburg), Grischa Promel (Karlsruher), Davie Selke (RB Leipzig) Standby list: Leonardo Bittencourt (Cologne), Christian Gunter, Sebastian Kerk (Freiburg), Eric Oelschlagel (Werder Bremen) Posted: 2016-07-15 14:54:44 Hull City win play-off final Mohamed Diame's stunning goal proved the difference as Hull recorded a 1-0 win over Sheffield Wednesday in the Championship play-off final...Varane ruled out of Euro 2016 France centre-back Raphael Varane has been ruled out of Euro 2016 with a thigh injury, the French Football Federation confirmed on Tuesday...Gunners top EPL earners"}, {"articleID": "2013072401_00035656_W", "names": {"Mayumi Nakamura": ["Q11365193", "Q11365856", "Q11365860"]}, "date": "2013-07-23", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/6506912", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. Bold stock picks, money-making trades and in-depth market analysis. PSP Children's Foundation's 2013 Summer Experience in Seattle July 23, 2013 / PRNewswire /--PSP Children's Foundation (PSPCF) is hosting eight children, who are survivors of the 2011 Tsunami in Japan, along with two teachers from Minami Sanriku-cho and Kesennuma, Miyagi, Seattle for ten days. This is the first official program offered since the organization's inception as a nonprofit in January 2013. PSPCF was established to provide programs and opportunities for children who are the victims of disasters. Its mission is to support children who suffered great losses in catastrophic disasters, such as the Great Eastern Japan Earthquake of 2011. One of the ways in which it does this is by sponsoring and running the Summer Experience in Seattle. The Summer Experience program began in the summer of 2012, when Pacific Software Publishing, Inc. (PSPINC) sponsored a homestay program in Seattle, Washington for eight junior high school students and two teachers from Kesennuma and Minami Sanriku-cho. The original group of students lost parents during the Tsunami, and they touched many hearts in In order to continue the program, PSPINC founded PSPCF as a nonprofit organization to administer and run the Summer Experience in the coming years. The Board of Directors includes members from many businesses in Japan as well as the program's partners in Japan. Their efforts have come to fruition this week as they prepare for the arrival of this year's group of students and teachers on This year's Summer Experience will include visits to several major businesses in the Seattle Metro area as well as excursions to several attractions and classroom sessions. Host families have donated their time and opened up their homes to house the students for the duration of their stay as well. \"Last year, this program not only provided opportunities for these children but also many lifetime lessons for all who participated in this program from volunteers, host families and others who had the opportunity to be touched by these children,\" said <mark>Mayumi Nakamura</mark>, President of both PSPCF and PSPINC. \"We strongly believe that this year's Summer Experience in Seattle will be equally successful in instilling hope for the future in this group of children. PSPCF believes hope is something we receive by giving it others, and we hope to continue to do so through program and others in years to come .\" PSPCF believes that hope is something we receive by giving it to others. Their mission for the future is to provide children affected by disasters with opportunities for hope through programs such as the Summer Experience in PSPINC is a web hosting and Internet solutions company located in Bellevue, WA. During the 1990s, its focus shifted from localization and \"double byte specialists\" to \"Internet specialists .\" In August 2000, PSPINC opened its first data center, providing superior reliability and security for clients. Now in 2013, PSPINC continues to expand and provide domain name, web, and email hosting, data storage and original software to over 38,000 companies in both the U.S. and Japanese markets. But while PSPINC provides expert service for companies large and small, they never forget that their real business is supporting customers. Learn more at Netflix, Inc. (NFLX): Content Is King, But Google Trends Show Throne Is At Risk Fortinet, Inc. (FTNT), Palo Alto Networks, Inc. (PANW) Could Be Potential Takeover Targets After Sourcefire Deal SHAREHOLDER ALERT: Law Office of Brodsky & Smith, LLC Announces Investigation of Harris Teeter Supermarkets, Inc.. Putnam Announces Multi-Class Distribution Rates for Open End Funds Missouri Collection Industry Leader Earns Prestigious International Designation Intel Corporation (INTC) Q2 EPS Preview: Tablets Killing The PC Falling Star Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein."}, {"articleID": "2017041918_00666865_W", "names": {"Jack Owens": ["Q16236423", "Q30122175"]}, "date": "2017-04-19", "url": "http://www.journal-news.com/sports/miami-lands-fourth-recruit-owens-first-class/R8zcoF2uXChdqcISMOfjcN/", "content": "0 Sports View Caption Hide Caption New Miami basketball coach <mark>Jack Owens</mark> was introduces himself during a public event at Millett Hall in Oxford, Thursday, Mar. 30, 2017. GREG LYNCH / STAFF Miami University men's basketball coach <mark>Jack Owens</mark> announced the signing of Dalonte Brown to a National Letter of Intent on Wednesday. A 6-foot-7 forward from Toledo, Brown was a four-year letterwinner for Bowsher High School, where he averaged a double-double as a senior and reached the 1,000 career point milestone. Brown averaged 22.1 points per game in 2016-17 and was named second team All-Ohio as well as the Toledo City Player of the Year. \"RELATED: Trotwood's Patton lists Miami among his top choices\" Dalonte provides this team with athleticism from the forward position, \"<mark>Owens</mark> said .\" He can play inside or out. He's a good rebounder with a high skill level. He brings something we needed in this class and we're excited that he's here. \"\"MORE: <mark>Owens</mark> rounds out his coaching staff Brown joins guards Jalen Adaway, Isaiah Coleman-Lands and Darrian Ringo as part of <mark>Owens</mark>' first recruiting class. View Comments 0"}, {"articleID": "2012080920_00016924_W", "names": {"L. Smith": ["Q16885749", "Q27597449", "Q54911965"]}, "date": "2012-08-09", "url": "http://wcti12.com/news/technology/Curiosity-causes-Internet-to-explode-with-joy/-/13530422/16034638/-/vr3ebh/-/index.html", "content": "curiosity causes internet to explode with joy rover garners lots of attention on facebook and twitter that's how the fans and followers around the web described the weekend's events to nasa's social media team. and while social media users are often portrayed as having short attention spans, the @ marscuriosity twitter account continues to receive about 1,000 new followers an hour since landing on the red planet early monday morning. the facebook page imploded from 30,000 to more than 200,000 fans. \"we were blown out of the water,\" stephanie <mark>l. smith</mark>, social media specialist at nasa, said about the response nasa and the jet propulsion lab's social team received on platforms including twitter, tumblr, reddit, facebook, instagram and google +. the social media strategy was something that was considered years before the landing. nasa-jet propulsion laboratory social media manager veronica mcgregor's first mission with mars was in 2008 when the phoenix rover landed. mcgregor began making plans for curiosity's big day back then. @ marsphoenix was the fifth most followed twitter account in 2008, she said. that account still has more than 200,000 followers. \"we knew there was a big audience out there on twitter,\" mcgregor said. the saturday before the landing, @ marscuriosity had 150,000 followers. it now has more than 818,000 and is growing at a rate of approximately 1,000 per hour, mcgregor estimates. she and two team members, courtney o'connor and <mark>smith</mark>, shape the voices behind many of nasa's social media accounts including @ nasajpl @ marscuriosity and @ asteroidwatch. although exact numbers aren't yet available they were astounded when they discovered their official \"landing tweet\" at 1:32 a.m. est on august 6 was retweeted 70,000 times around the world. a search of links, tweets and images including \"mars\" from saturday to tuesday surpassed 700,000. mcgregor and her team said they believe interest in space has always been high. social media simply allowed the community to find each other, mcgregor says. cnn commenters also responded enthusiastically, sharing the mars landing article to social media more than 26,000 times and leaving more than 4,900 comments. a cnn.com commenter known as explore wrote, \"at the very core of me is a desire to seek the unknown, a desire to look beyond the confines of this tiny little spec in the universe to the vastness that lies beyond. this is inherent to every one of us even though we may sometimes deny it because we can only see the here and now .\" and then there were the unexpected internet wins that the nasa social media team never expected to happen. bobak ferdowsi, a nasa engineer and flight director of the mars science laboratory curiosity mission, was quickly dubbed the \"nasa mohawk guy\" by twitter users who followed his updates at @ tweetsoutloud. internet memes showing a side view of ferdowsi's mohawk with captions including, \"becomes an internet sensation. too busy landing a robot on mars to notice,\" tumblrs about bobak and blog posts exploded across the web. he received several marriage proposals via twitter but probably hasn't seen them. mcgregor says ferdowsi has been on twitter \"a while\" but his account went from several hundred followers on saturday to more than 30,000 tuesday. as curiosity landed ferdowski tweeted, \"so incredible to be a part of this team and all that we've accomplished. impossible not to be an emotional wreck .\" a curiosity rover \"call me maybe\" mashup video surfaced on youtube. caley burke, an aerospace engineer with the kennedy space center created the video after being inspired by the u.s. olympic swim team's version. after closely listening to the lyrics for the first time burke said it made perfect sense. \"i knew we were only going to call if the rover actually landed,\" she said. youtube analytics show the video has been viewed 27,000 times, mostly by males between the ages of 45 and 50. there were viewing parties and thousands crowded into times square in new york city to watch the event unfold, snapping photos and sharing them with mcgregor and her team. it was an event that, judging by social media updates, connected science-loving strangers, restored people's hope in space exploration and elicited a sense of awe. since 2010 nasa has ranked at the top of public sector organizations in effectiveness of social media sites by experts from l2, a think tank for digital innovation. nasa hosted social media followers at seven field centers around the nation on august 3 and live streamed the event online. participants were also given the opportunity to be present when the first signal of the landing was detected by mission control. strategy aside, for some it was simply a moment in time to reflect on the amazing accomplishments of their fellow humans and science. no matter how they arrived, they walked away with much more than just curiosity. . all rights reserved. this material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2010072213_00455535_W", "names": {"Michael Newman": ["Q548925", "Q6833055", "Q6833057"]}, "date": "2010-07-22", "url": "http://waow.com/Global/story.asp?S=12852425", "content": "police: decomposed body is calif teen who went missing during walk home london (ap) - an irish republican who confessed to being involved in the 1992 killing of a british army recruiter was sentenced to life in prison on thursday declan duffy, 36, pleaded guilty to murder in stafford crown court in central england. he is a former leader of the irish national liberation army, which broke away from the irish republican army and was responsible for some of the most outrageous attacks in the northern ireland conflict before renouncing violence last year. duffy admitted his involvement in killing sgt. <mark>michael newman</mark> outside an army recruiting office in the central england city of derby. three men were allegedly involved inthe attack, and prosecutors say they don't know whether it was duffy or another suspect who fired the gun that killed <mark>newman</mark>. duffy, known as \"whacko,\" said last year he had decided to speak to police about the killing after he renounced his membership in the inla. \"i would never have spoken to the police in the past, but my war is over and there are things i have to get off my chest,\" duffy said in court. \"this man was a family man, and it is regrettable that he was killed. i would be happy to meet with any member of his family to explain to them the circumstances of why soldiers at that time were being targeted .\" judge julia macur set a minimum term of 24 years before duffy could be considered for release. inla member joseph magee, who said he was the driver for the gunman, was jailed in 2004 after admitting his role. he has since been released. another inla man, anthony gorman, is fighting extradition from the irish republic."}, {"articleID": "2019102812_00110873_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"], "Elton John": ["Q16209157", "Q2808"]}, "date": "2019-10-28", "url": "https://www.forbes.com/sites/stanphelps/2019/10/28/old-town-road-by-lil-nas-x-goes-diamond-and-you-should-too-in-business/", "content": "Old Town Road By Lil Nas X Goes Diamond And You Should Too In Business Stan Phelps, CSP is a keynote speaker and workshop facilitator on customer experience, employee engagement, technology, differentiation, and purpose at StanPhelpsSpeaks.com. Share to facebook Share to twitter Share to linkedin NEWARK, NEW JERSEY - AUGUST 26: Billy Ray Cyrus and Lil Nas X speak onstage during the 2019 MTV...[+] Video Music Awards at Prudential Center on August 26, 2019 in Newark, New Jersey. (Photo by <mark>Mike</mark> Coppola/Getty Images for MTV) Getty Images for MTV Old Town Road by Lil Nas X received Diamond Certification by the RIAA this week. It became the 33rd in history and the fastest to achieve the honor. Not bad for a song that was originally produced in Atlanta for less than $50. Diamond is 10 times platinum, when a single achieves the equivalent of 10 million units when combining sales and streaming. Here is a list of the 33 courtesy of Business Insider which includes three singles by both Eminem and Katy Perry. Diamond symbolizes the top honor in the recording industry, but it is also the new standard for achieving prosperity in business. Acting in accordance with the Diamond Rule is the next evolution of managing relationships and winning in sales. It's the 4.0 version that tops silver, golden and platinum approaches in business. Let's look at 1.0, 2.0, and the 3.0 versions for background: Version 1.0 - The Silver Rule The Silver Rule is \"do no harm .\" As stated by Zigong, a disciple of Confucius, in the book, \"What I do not wish others to do unto me, I also wish not to do unto others .\" The Silver Rule merely shares what not to do. It's not a bad start. Case in point, beginning in 2000, Google famously coined \"Don't be evil\" as part of the company's corporate code of conduct. The problem with Silver is that it's not prescriptive. It doesn't tell you how to treat others in business. Analects Version 2.0 - The Golden Rule Throughout nearly every culture and religion, the Golden Rule has become the gold standard of human dynamics. The Golden Rule is simply \"treating others the way you would like to be treated .\" If the Silver Rule deals in what not to do, the Golden Rule broadens it to all situations. In 2015 with the founding of Alphabet, Google revised its motto of \"Don't be evil\" to \"Do the right thing--follow the law, act honorably, and treat each other with respect .\" This approach by Google is more aligned with the Golden Rule. Marriott even has an entire advertising campaign around the Golden Rule. Unfortunately, in sales and managing relationships, the Golden Rule a bad rule. Here's why: In most sales organizations, an acceptable conversion rate is about 25 percent, which means that only one out of every four opportunities converts into a sale. Because you were taught to follow the Golden Rule, it's fair to assume you know what your clients want based on what you would want if you were them. Unfortunately, just looking at the conversion rates tells us that there's an issue. If anything else in our businesses was failing 75 percent of the time, we would immediately look for ways to improve. The Golden Rule leads to suboptimal results. This is because not everybody wants the same thing or to be treated the same way. We always assume that if something is good for us, then it must be good for everyone else. And, that if we want to be treated in a certain way, then that must be how everyone else wants to be treated. Turns out, that assumption couldn't be further from the truth. It leads to failed sales opportunities and strained client relationships all the time! NEW YORK - CIRCA 1961: Entertainer Perry Como rehearses on set of his TV show \"Perry Como's Kraft...[+] Music Hall\" in New York. (Photo by Donaldson Collection/Michael Ochs Archives/Getty Images) Getty Images FACT: Gold is worth significantly more per ounce than silver. It can be as much as 100 times more valuable. It is also the denser of the two metals, which makes a specified volume of gold worth far more than an equal volume of silver. The very first Gold Certification Award by the RIAA was earned in 1958 to Perry Como for his hit single. Catch A Falling Star Version 3.0 - The Platinum Rule The next level of the Golden Rule was popularized by Dr. Tony Alessandra in 1996. It simply is \"treating others the way that they want to be treated .\" Grounded in emotional intelligence, the Platinum Rule asks you to accommodate the feelings of others. Dave Kerpen outlines the shortcomings of the Golden Rule in his book. Kerpen writes, The Art of People \"The Golden Rule, as great as it is, has limitations, since all people and all situations are different. When you follow the Platinum Rule, however, you can be sure you're actually doing what the other person wants to be done and assure yourself of a better outcome .\" The Platinum Rule is more outward facing in its approach. The focus shifts from, \"this is what I want, so I'll give everyone the same thing\" to \"let me first understand what they want...and then I'll give it to them .\" One of the challenges when completely focusing on the other person is that we can overlook how we're feeling and reacting to a situation. For example, we may go into a meeting with the best of intentions to apply the Platinum Rule, but then something happens where we feel upset or disrespected or unheard, and then our capability to actually apply the Platinum Rule is interrupted. Therefore, while the Platinum Rule is aspirational, we must also be true to ourselves and neutralize our biology in order to be capable of addressing the needs of others. Considered one of the wealthiest Americans of all time, <mark>John</mark> D. Rockefeller, business magnate and philanthropist, clearly understood the intrinsic value of the Platinum Rule. He said that, \"the ability to deal with people is as purchasable a commodity as sugar or coffee and I will pay more for that ability than for any other under the sun .\" When you play the game of business by following the Platinum Rule, every game is an away game. You never have the home field advantage because success in the game is filtered through the needs and concerns of the other person. Your playbook focuses only on knowing how others want to be treated and what's important to them. Johnnie Taylor Photo Credit: Wikimedia Commons FACT: Platinum is more sought after than gold because it is rarer. Only 160 tons of platinum are mined annually around the world, as opposed to 1,500 tons of gold. Also, platinum is denser than gold; a platinum ring will weigh significantly more than a same-size ring in gold. Platinum is the new symbol of prestige. Think of the \"platinum credit card,\" which often has better benefits and privileges than the \"gold card .\" In the 1970's, the RIAA awarded the first Platinum Single Award. It was earned by Johnnie Taylor for the song. Disco Lady Version 4.0 - The Diamond Rule The Diamond Rule takes the Platinum Rule to the next level. The key here is understanding both our own biology as well as that of our prospects and customers. Treating someone the way they want to be treated is tricky enough under normal circumstances--but what happens when things start to get heated? In the immortal words of former boxing heavyweight champion, \"Everyone has a plan until they get punched in the mouth .\" <mark>Mike Tyson</mark> Pressure can trigger a biological response that causes us to act in an unpredictable and irrational manner. Under pressure, our brain activates a hard-wired survival strategy every time it detects a perceived threat. Why is the Diamond Rule so critical in sales and managing relationships? The answer is simple. A sales situation is inherently full of pressure. To quote the late artists David Bowie and Freddie Mercury in, \"Pressure pushing down on me. Pressing down on you .\" Pressure can make things unstable. In sales, you need to manage yourself and your prospect/client through these difficult situations. The Diamond Rule combines elements of both Gold and Platinum. Said simply, the Diamond Rule is \"the art of managing yourself under pressure and addressing the needs of others to avoid their triggers .\" Under Pressure Rooted in the understanding of our own behavioral style and the style of others, the Diamond Rule allows you to solve problems and achieve prosperity in the pressure-filled game of business. Practicing the Diamond Rule requires two elements: 1) you have to see your own predictable behavioral style when pressure hits, and 2) you need the capability to assess prospects/clients relative to four different, predictable behavioral styles based primarily on how people respond biologically to pressure. Since we all tend to be pretty strong in only one of the four styles of Control, Influence, Power or Authority, it's no surprise that we tend to connect with those whose style is similar to ours but find ourselves challenged to connect with those who have a different style. Therefore, when working outside of our own category, we may be less effective, leading to upwards of a 75 percent failure rate in sales conversion. Diamond Rule Behavior The Diamond Rule is the most advanced approach for working effectively with other people. As a combination of the Golden Rule and the Platinum Rule, it requires you to consider and satisfy your own instinctive concerns and needs while simultaneously addressing the needs of others. While it takes keen awareness and presence to pull this off, it is truly the \"Holy Grail\" of human dynamics. Diamond Rule behavior means effectively managing your identity (personal brand) with others even when your biology (survival response to pressure) is getting triggered (feeling under attack) in the game of business. When you adhere to the Diamond Rule, you rise above pressure, reaching an elevation that makes it easy to focus on solving client problems and reducing the pressure they feel. This makes you stand out as unique and better in the eyes of your client, dramatically increasing your ability to win business. A diamond is a symbol of wealth and wisdom. The more you mine for diamonds in your pursuits, the more success you will reap. Unlike Gold or Platinum which can be molded, you need to work with the natural elements of Diamonds and the natural reactions of human biology. Are you ready to go Diamond to win in sales and managing customer relationships? Singer <mark>Elton John</mark> performing a rewritten version of his song \"Candle in the wind' as a tribute to...[+] Diana, Princess of Wales, at her funeral. Over a million mourners lined the route of the funeral procession through London. (Photo by PA Images via Getty Images) PA Images FACT: Diamonds are crystals of pure carbon that have formed under a combination of high temperatures and extreme pressure in the Earth's mantle. Diamonds are not found on the Earth's surface, they must be mined with a pick-axe while tunneling deep in the ground. Given the process of sourcing diamonds and their value, they are much more precious and expensive than gold and platinum combined. CASE (S) IN POINT: It's no coincidence that Diamond Medallion is the highest status on Delta Airlines. Status has four levels: Silver, Gold, Platinum--and Diamond. To achieve Diamond Medallion status, you must travel 125,000 medallion qualifying miles a year. That's exactly the amount of Gold (50,000) and Platinum (75,000) combined. Candle in the Wind by <mark>Elton John</mark> was the first single to achieve Diamond certification status by the RIAA. Follow me on Twitter or LinkedIn. Check out my website or some of my other work here."}]