[{"date": "2015-11-28", "url": "http://www.irishexaminer.com/lifestyle/features/celebrities-pick-the-book-that-had-the-most-impact-on-their-lives-367295.html", "content": "Celebrities pick the book that had the most impact on their lives Saturday, November 28, 2015 By Ailín Quinlan What is the book that had the most impact on your life? Ailín Quinlan asks three well-known people from the worlds of poetry, literature and broadcasting. Plus we recommend the best books to buy this Christmas. NORAH CASEY There are days you never forget in your life. August 31, 1997 was one of those. We were living in London at the time and woke that Sunday to the news of the tragic death of Princess Diana. Richard was a news correspondent for the BBC and was immediately despatched to Balmoral where most of the royal family were staying, leaving me alone in a shell-shocked city. READ NEXT Christmas 2015: The top book picks of the season There was a lot of criticism of the Queen at the time for failing to capture the mood of a nation in mourning and it was widely expected that she would travel from Scotland to London with Princes Harry and William the following day. \"London was a strange place to be at that time. Our house is close to Westminster and the outpouring of grief and growing mountain of floral tributes outside Buckingham Palace and Kensington Palace was extraordinary and unsettling. The collective mourning of complete strangers over a woman the vast majority had never met or known other than through her media profile was profound .\" People were hugging each other, openly weeping as they queued for hours to sign books of condolence. It was impossible not to be captivated by the hysteria, even more so because Londoners are not known for expressing their emotions too readily. \"I returned home that Sunday afternoon after wandering through the sea of messages and flowers and couldn't settle. The television was showing an endless loop of the crash scene, her life, the crowds, the tears and worse the shock and abandonment that people felt at the loss of this one individual. Days earlier I had picked up a review copy of a book that had arrived into the newspaper. It held little promise for a lapsed Catholic. Anam Cara, a first book by an unknown author, John O’Donoghue .\" Even more off-putting it promised \"spiritual wisdom from the Celtic world. I had nothing else to distract me so I settled down to plough through a few pages. I think I finished my first read around 3am the following morning and it is the only book I have read several times (too often to count) since. It was a constant companion by my bedside when my father died suddenly in his sleep 18 months later and it was the one I reached for when Richard died a few years ago .\" John O’Donoghue's book became an unlikely bestseller that year, published on the day of Diana's death and reprinted 13 times. A former priest, poet, and philosopher, he received international acclaim for Anam Cara and the many insightful books her has written since. \"I could never do justice to the enlightenment contained within the pages of Anam Cara (which means Soul Friend) but it resonated strongly at a disconnected moment in time and the more I read it the more I get from it. He writes about love and friendship, about the bonds of two souls united, how solitude and silence soothes and reconnects us .\" His final chapter is on the serenity and peace of death and the fusion between those in the spiritual world who have left us, and our own. It is illuminating and comforting. John O’Donoghue was only 53 when he passed away suddenly in 2008 but his life and his writings have left a wonderful legacy. \"<mark>MICHAEL MURPHY</mark> The book for me is Walt Whitman's Leaves Of Grass, the poetry collection on which he worked all his life .\" Whitman first published it in 1855 at the start of his poetic career and kept adding to it and republishing throughout his life. \"These were revolutionary poems based on himself .\" He was a very modern poet--he was like the poetic version of Carl Jung and the wonderful thing about him, what really impressed me, was that he was stylistically innovative. \"He used ordinary language and abandoned the artificiality of rhyming patterns .\" It impacted very strongly on me as a budding poet. I came across the book when I was in my 20s on a JI Visa, working in New York. \"I picked up a copy of the book and could not put it down .\" It was saying everything I would have loved to say. I was writing poetry at the time and it transformed the way I did it. \"When I was younger, I thought that the way you write poetry was that everything rhymed .\" Then I suddenly realised that, many years before, a man had broken all the conventions. He was also obviously gay and wrote about sexuality. \"I realised this man had broken all the boundaries and was writing about nature, love and death and it opened my eyes in a good way .\" * <mark>Michael Murphy</mark> is a psychoanalyst, poet and RTÉ television producer/director and newscaster. He recently published his latest collection of poetry, A Chaplet of Roses. Published by Toga Books (€ 14.99), it is the second collection of poetry from the bestselling author. His highly acclaimed literary memoir, At Five in the Afternoon--My Battle with Male Cancer, was published in 2009, and was a number one bestseller. A sequel, The House of Pure Being, was published in 2013, and reached the top ten. The third and final part of that trilogy, Lemons and the Waning Moon, will be published in 2016. SEÁN O’ROURKE My book is Plain Speaking, by Merle Miller. \"It's an oral biography of Harry S Truman, and constitutes interviews with commentary .\" I first read it 30 years ago, and I've read it several times since, but there's one section that sticks with me. \"This particular passage is about an incident in which Truman fired General Douglas MacArthur, who had got above himself and had started making policy, which wasn't his job--he took it upon himself to usurp the authority of the President of the United States .\" For a while, Truman allowed himself to be talked out of firing General MacArthur, but eventually he did it--and he said he'd been wrong not to do it earlier. \"He says in the book:\" The only thing I learned out of the whole MacArthur deal is that when you feel there is something you have to do, and you know in your gut you have to do it, the sooner you get it over with the better off everybody is .' \"This is something I go back to; it's something I've drawn on--if I know there's something I have to face up to doing--just do it .\" Sometimes you put off what you know you have to do. \"The most recent thing for me was, that I had this lovely holiday home in Donegal .\" We bought it about 10 years ago, not knowing what would come in the way of recession and cutbacks, and it became a luxury we couldn't afford. \"Now I have decided to sell it. Even though it's in a gorgeous place near a beach and a golf course, my family never really bonded with it .\" I was asked if I'd sell it and to my amazement I said yes. \"My wife Caroline wanted to sell it years ago and I kept talking her out of it, but now it's at the Sale Agreed stage .\" Part of me feels that a bit of me has been amputated but I also feel it's the right thing for the family. \"I've loads of friends in Donegal and I'll never be stuck for a bed there, so I can still go there and enjoy the golf and the landscape .\" I've no regrets about getting the house in the first place, but I feel it's time to let it go. \"The MacArthur thing came to mind when I got the offer--we can spend a lot of time dodging what we have to do, but you have to face up to it in the end, and this applies to all parts of life, including family or work situations .\" * Journalist and broadcaster Seán O’Rourke currently presents the Today With Seán O’Rourke show every weekday morning on RTÉ Radio One. LOUISE O’NEILL I THINK the book that has most influenced me was a book given to me when I was in my teens by my English teacher Jo Keane. \"It was The Handmaid's Tale by Margaret Atwood .\" I remembering finishing that book and feeling as if the way I had looked at the world had changed in some way. \"So many facets of the world in which I lived, and the culture in which I was brought up, were so intrinsically patriarchal .\" I didn't have access to feminist theory, so that book was my first introduction to any idea of feminism. \"I feel it gave me the language in which to articulate myself and it radicalised me and made me a feminist .\" It was an incredibly important book for me and it changed my life. \"There are other books that made me want to be a writer but this made me politically aware and engaged with such issues--and more critical of the way the media presents women, and more aware of how we as a society and culture view women .\" The Handmaid's Tale was written the same year I was born--1985--and 15 years later when I read it, it still felt relevant. \"It is unfortunate that 30 years after it was published it is still so relevant .\" * Louise O' Neill is the author of Asking for It and Only Ever Yours", "articleID": "2015112801_00009694_W", "names": {"Michael Murphy": ["Q15460198", "Q21170748", "Q2746614", "Q47451216", "Q492789", "Q55086802", "Q600339", "Q6832969", "Q6832970", "Q6832974", "Q6832977", "Q6832985", "Q6832986", "Q7484818"]}}, {"date": "2015-11-29", "url": "http://www.sandiegouniontribune.com/news/2015/nov/28/back-story-community-policing/", "content": "Back story: Going deep on community policing By Union-Tribune | 6:11 p.m. Nov. 28, 2015 Assistant Police Chief <mark>Mark Jones</mark> (left) and other officers support Special Olympics qualifiers in Rancho Bernardo this month .--Charlie Neuman Assistant Police Chief <mark>Mark Jones</mark> (left) and other officers support Special Olympics qualifiers in Rancho Bernardo this month .--Charlie Neuman Share Photo ✉ Q: What was the origin for this story? A: I was working on a piece about a new training program for recent police academy graduates that included a special focus on community engagement, and was invited to sit in on a session for some lieutenants who were going to be making the training happen. Kind of suddenly, this surprisingly candid conversation about how the department had strayed from community-oriented policing started up. Officers, lieutenants and a captain chimed in. They were telling really compelling stories about how the shift affected them and how it came about. I knew I wanted to do a deep dive into what had happened. Q: Why did you think readers needed to know this? A: Community policing is a philosophy that both police departments and neighborhoods should care about because, if it's going to work, it takes time and commitment from residents and officers. The practice is about preventing crime, but it's also about building relationships between officers and communities. Q: What were the challenges? A: Putting it all together was probably the biggest challenge. It was fascinating delving into what turned out to be a nationwide struggle to make community policing happen. The philosophy itself has a pretty rich history, too, so I didn't want to shortchange that while I told San Diego's story. I thought the biggest challenge would be getting people to talk with me about what went wrong, but everyone knew departments had strayed from problem-oriented policing. I think the conversation was easier to have because so many wanted to see it flourish again. Q: What stood out for you in reporting and writing it? A: Probably learning how miserable officers had been. I don't often hear from officers about their personal experience on the job, so it was enlightening hearing how crappy they thought the whole situation was. I also thought it was interesting that the community's perception of officers was fairly two-faced. There's the neighborhood officer who's ready to work alongside you, and the officer on patrol who's too busy to be bothered. Also, the fact that everyone was committed to community-oriented policing, even though research hadn't definitively shown it reduced crime. Q: Was there any aspect you wanted to explore but could not find the time or space for? A: A lieutenant I talked with said \"back in the day\" if an officer wanted to be promoted, he or she better be a pro at problem-oriented policing. Then, at some point, that wasn't the case. As officers got busier, more emphasis was placed on other qualities, so they weren't making as much of an effort for community policing because it wouldn't propel them through the ranks like it used to. That also suggested leaders that did get promoted weren't the community-policing proponents their predecessors were, because they were being chosen for different strengths. For another story, perhaps. Q: Will you be writing other stories on this topic? A: Definitely. I'll also be doing pieces on other areas the department committed to work on following the federal audit, particularly the department's Early Identification & Intervention System. It's a computer-based system that's designed to zero in on problem behaviors early. It needs a serious overhaul, which could cost quite a bit, so I'd like to help people better understand what it does and why departments across the nation say it's a must-have tool. Q: Why do you like covering police and crime and public safety? A: Covering crime can be draining, but that's because it's compelling and full of emotion. Like Edna Buchanan, a legendary Miami Herald crime reporter, said: The beat \"has it all: greed, sex, violence, comedy and tragedy .\" I also think law enforcement, as a whole, is a really important topic to cover closely, especially as our nation continues to discuss ways police can better do their job and how communities can help them do that. -", "articleID": "2015112902_00057766_W", "names": {"Mark Jones": ["Q15072754", "Q15222722", "Q17523860", "Q22005690", "Q3294123", "Q3849506", "Q3849511", "Q6768275", "Q6768277", "Q6768278", "Q6768280", "Q6768281", "Q6768282", "Q6768283", "Q6768284", "Q6768285", "Q6768286", "Q6768287", "Q6768289", "Q934587"]}}, {"date": "2015-05-16", "url": "http://movies.mxdwn.com/reviews/movie-review-mad-max-fury-road/", "content": "A few months ago, after a string of mediocre-to-bad reviews of what I maintain were mediocre-to-bad schlocky action movies, I had a coworker accuse me of simply not liking action movies. I tried quickly to defend myself, saying no, it was just the beginning of the year and there weren't any good action movies which had come out recently. But it got me second guessing myself. Do I occasionally get annoyed with shallow characters, weak plots, and the waste of brilliant concepts? Yes. Maybe even more than \"occasionally .\" All it takes is a movie like Mad Max: Fury Road to put those sort of niggling criticisms out of mind. Yes, there are still some ways Fury Road occasionally lets itself down, but these are by far the exceptions to the rule. Mad Max: Fury Road is a great action movie, and one that does world building better than most any other movie in recent memory of any genre. Who cares if the plot is a massive excuse to make the characters go from point A to point B and back? That journey is way too much fun. Fury Road drops us into its post-apocalyptic landscape with hardly an iota of exposition. I've actually seen none of the previous Mad Max movies, but to the best of my knowledge I suffered not at all for the oversight. With a few minor--but notable--exceptions, director <mark>George Miller</mark> puts on a clinic for giving the audience just enough information to keep us abreast of world and story unfolding around us, while still leaving plenty to figure out as we go. The opening shot establishes a two-headed lizard only to have it quickly eaten by our main character (played by <mark>Tom Hardy</mark>), this only moments before he and his car are chased down by a murderous gang riding an assortment of cobbled together motor vehicles that are about what you'd imagine car zombies would look like. The food chain--and its immediacy in this world--are established, and we're whisked off to the main plot. The, ahem, driving forces in Fury Road are a warlord's thirst for control over what he considers to be his property and a group of women's thirst for freedom from this dictator. Charlize Theron plays the Imperator Furiosa, trusted vanguard of warlord Immortan Joe (Hugh Keays-Byrne), who is sent to trade with another warlord for a shipment of gasoline, now a precious resource in a post-nuclear winter world. Little does he know, Furiousa is escaping with his harem of wives, and soon Immortan Joe is hot in pursuit with his motorized army of fanatical War Boys. Max, kidnapped by War Boys in that opening scene, finds himself but a bystander to this initial action, nothing but the living blood bag for a wounded War Boy named Nux (Nicholas Hoult). And by the way, along with others like \"Max Rockansteady,\" \"Rictus Erectus,\" and \"Toast the Knowing,\" if you can't get a kick out of these names, you're just not living. This, by the way, is Immortan Joe Humor, in fact, is one of the most important qualities of Mad Max: Fury Road, or at least, the self-allowance to have fun within its semiabsurdist post-apocalyptic world is. The world of Max Max is one that is highly mechanical but largely devoid of precision. It's also one that's more car-obsessed than the Fast & Furious franchise. Combined, that means that war is waged only in small part by gunfire--guns absolutely exist and are utilized, but without reliable means (it would seem) to manufacture ammunition, bullets are always at a Why yes, that is a double-necked guitar that is also a flamethrower. premium. Instead, Fury Road takes full advantage of the wide open vistas of barren desert flats, setting nitrus-infused cars loose like war chariots upon the field of battle. Explosives are the weapon of choice, often strapped to the end of spears and flung at one another in close quarters. Wheel spikes, using cars as battering rams, and leaping from vehicle to vehicle are also common tactics. And of course, there's the military band to make sure the whole formation is well-marshalled. <mark>Miller</mark> does an amazing job of making sure the audience never forgets this world is just beyond the pale, yet still stained by the dirt and grime of a place imminently recognizable. A couple key tactics play into this. First, action scenes routinely drop frames to give them a hyper-real look. Things are undoubtedly moving faster than they should, but only barely. It makes car and foot chases alike all the more spectacular, while visually reinforcing just how actually-mentally-crazy everyone in frame is. Max, as he says himself, is a man who must obey the instinct to survive at all costs. He is by definition both animal and man, and it's a great duality. But back to <mark>Miller</mark>'s directing. While daytime scenes are an unyielding reddish-orangeish-brown that looks like a real desert, night is swathed in an otherworldly blue. The scenes taking place at night tend to be less extraordinarily proportioned than their daytime counterparts, but the forced blue hue maintains the haunted, almost sickly tone of the barren world. The illusion breaks a little when bright spots and shadows reveal just how clearly this is a color filter over a daytime shoot, but I appreciated the artistry that <mark>Miller</mark> was shooting for more than I was annoyed by the blunt instrument he used to achieve it. Most surprising, however, I think this is actually one of the rare movies that you really want to see in 3D. <mark>Miller</mark> and cinematographer John Seale's (Cold Mountain) framing is immaculate, and makes a brilliant show of the added depth of field. There's a predilection for skyboxes, which is perfectly fine considering how striking the landscape is, particularly with the movie almost always giving an eye for the horizon ahead. The camera does a wonderful job of reinforcing the twisted reality and charge-forward-on-a-fast-car mentality of the rest of the movie. A few bits do get left by the wayside. The plot, as mentioned, is little more than a series of excuses to make the characters do their best to flee from one point to another, then embark on a seeming suicide mission to get back to where they started. That's mostly ok, because, hey, more of some absolutely top-notch action, but a few links in the chain are noticeably weak, particularly a couple to do with Nux, who makes the biggest emotional and philosophical arc of any of the characters. The midpoint of the film, in particular, lags a bit because having achieved one goal, Max and Furiosa have trouble defining the next. It's also worth mentioning, on that note, that both characters could have done with a bit more depth (there's sort of a singular and largely unexplored motivator driving each). Still, there are some top-notch scenes on their way to discovering their mutual benefit in working together. It's worth mentioning again that the action here really is spectacularly imaginative, fitting perfectly with the film' s bizarro reality, and that's probably the biggest draw the movie has to offer. But one of the things that should give Fury Road some staying power is a surprisingly complex motif of women's empowerment. Furiosa is an obvious embodiment of physical prowess, but where <mark>Miller</mark> makes things particularly interesting is with Immortan Joe's wives. When they're first revealed, the wives are shown in a gaze that is decidedly male and culturally traditional--clothed in a few strips of linen each, they bathe in pure water, a living oasis in the middle of an ugly and lifeless plain. Moreover, they initially seem to be sheltered and without the skills that have perpetuated Max's or Furiosa's survival. It's an uncomfortable view of the women that hammers home just how much they were property in Joe's eyes. (Unfortunately, he also says this aloud a couple of times, so some of the poetry is lost .) But as the movie progresses, the different wives show themselves remarkably capable in a number of different ways, and it becomes impossible not to see them as fully embodied and independent people. And actually some of the events around that midpoint lull are most important to the completion of this arc. Also noteworthy, the only male characters who can be seen in a heroic light end up working with these women, not only protecting them, but being protected by them. And thematically, the movie has a lot to do with the reparation of wounds inflicted by the same men who first ruined the world, and the establishment of a new and equitable society. The Verdict: 5 out of 5 Here's the deal: Mad Max: Fury Road does have some problems when it comes to both its plotline and the development of its three main characters, Max Rockansteady (<mark>Tom Hardy</mark>), Imperator Furiosa (Charlise Theron), and Nux (Nicholas Hoult). But here's the other deal: the things it does well, it does so well that it doesn't matter if it's lagging a little in those areas. The plot and the characters are merely good, and they're surrounded by phenomenal world building, great design, wonderful direction from <mark>George Miller</mark>, quality thematic development, and a stellar score by <mark>Tom</mark> Holkanborg I haven't even had the chance to praise up until now because there is so much other stuff of quality in this movie worth talking about. \"Oh what a day! What a lovely day!\" ", "articleID": "2015113000_00188505_W", "names": {"George Miller": ["Q21166588", "Q23826617", "Q25171612", "Q28137208", "Q446960", "Q51584537", "Q5542479", "Q5542483", "Q5542484", "Q5542485", "Q670658", "Q966352"], "Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}}, {"date": "2015-11-30", "url": "http://www.jpost.com/Opinion/Our-World-The-American-war-against-the-Jews-435853", "content": "Our World: The American war against the Jews Our World: The American war against the Jews Opinion 11/30/2015 18:15 Our World: The American war against the Jews Despite the substantial funds that have been devoted to fighting anti-Israel forces on campuses, they have not been diminished. Anti-Israel demonstrators stage a rally outside New York City Hall. (photo credit: LUCAS JACKSON / REUTERS) Share on FacebookShare on Twitter The foundations of American Jewish life are under assault today in ways that were unimaginable a generation ago. Academia is ground zero of the onslaught. The protest movements on campuses are first and foremost anti-Jewish movements. For the past decade or so, Jewish communal leaders and activists have focused on just one aspect of this anti-Jewish campaign. Jewish leaders have devoted themselves to helping Jewish students combat the direct anti-Semitism inherent to the anti-Israel student movements. Despite the substantial funds that have been devoted to fighting anti-Israel forces on campuses, they have not been diminished. To the contrary, with each passing year they have grown more powerful and menacing. Consider a sampling of the anti-Jewish incidents that took place over the past two weeks. Two weeks ago, <mark>Daniel Bernstein</mark>, a Jewish student at University of California Santa Cruz and a member of the university's student government was ordered not to vote on a resolution calling for the university to divest from four companies which do business with Israel. <mark>Bernstein</mark> represents UCSC's Stevenson College at the university student government. He is also vice president of his college's Jewish Student Union. Ahead of the anti-Israel vote, <mark>Bernstein</mark> received a message from a member of his college's student council ordering him to abstain from the vote on Israel divestment. The student council, <mark>Bernstein</mark> was informed, had determined that he was motivated by \"a Jewish agenda,\" and therefore couldn't be trusted to view the resolution fairly. In the same message, <mark>Bernstein</mark>'s correspondent gave him a friendly \"heads up\" that his fellow students are considering removing him from office because he is a Jew supported by the Jewish community. To his credit, <mark>Bernstein</mark> ignored his orders. He voted to oppose the anti-Israel resolution. Following the incident <mark>Bernstein</mark> published a statement decrying the anti-Jewish discrimination and hatred now rampant on his campus. Among other things, he wrote, \"I wish that [my] being subjected to anti-Semitism was a shocking new occurrence. But the truth is that I'm not shocked. I'm not shocked because this hatred and ignorance has followed me everywhere. I'm not shocked because Jewish students have been targeted with this vile racism all over the [University of California] UC system for years, and especially since BDS became a major issue of discussion. Anti-Semitism...has...become an inseparable part of campus politics right here at UC Santa Cruz and across the UC system .\" Then there is the growing movement of professional associations that boycott Israel. Last week the National Women's Studies Association passed a resolution to join the BDS movement. The resolution, written in turgid, incomprehensible prose, proclaimed that the only state in the Middle East that provides full and equal rights to women is so evil that it must be singled out and boycotted, sanctioned and divested from. Whereas <mark>Bernstein</mark> was personally targeted, and the NWSA criminalizes Israel, at CUNY, on November 12, a group of protesters targeted the Jewish community as a whole. That day, as part of a national \"million student march,\" where students demanded free tuition, anti-Jewish students at CUNY rallied at Hunter college and introduced a new demand: the expulsion of all Israel supporters from campus. Congregating in the center of the campus, some 50 students chanted in unison, \"Zionists out of CUNY!\" Aside from an anodyne statement in favor of \"freedom of expression,\" CUNY administrators had nothing to say about the affair. For their part, Hunter's administrators issued a statement \"condemning the anti-Semitic comments,\" made by the rally participants. But no disciplinary measures were taken against any of them. Speaking to the Algemeiner, StandWithUs's northeast regional director Shahar Azani said that the Hunter incident \"is another example of the hijacking of various social causes by the anti-Israel movement .\" In making this claim, Azani was merely repeating the position taken by Jewish communal leaders and activists involved in the fight to defend Jews and Israel on university campuses. Unfortunately, this position is incorrect. According to the prevailing wisdom guiding Jewish communal responses to the onslaught against Jewish students on campuses, the anti-Israel and anti-Jewish movements are distinct from the wider anti-liberal forces now disrupting campus life throughout the US. As Jewish leaders see things, there is no inherent connection between the protesters embracing victimhood and demanding constraints on freedom of expression, inquiry and assembly (and free tuition), and those who seek to drive Jews out of the public sphere on college campuses. In other words, they believe that Zionists can be crybullies too. But they can't. The crybully movement, which demands that universities constrain freedom to cater to victim groups, is necessarily hostile to Jews. This is the reason that at the same time that \"victims\" from blacks to transgenders are coddled and caressed, Jews have emerged as the only group that is not protected. Indeed, the BDS movement requires universities to discriminate against Jewish students. The inherent conflict between the tenets of the \"progressive\" movement and Jewish rights is exposed in a guide to racial \"microaggressions\" published earlier this year by the University of California. Students and faculty must avoid committing these \"microagressions\" if they want to stay on the right side of campus authorities and the law. The UC defines \"microagressions\" as, \"brief, subtle verbal or non-verbal exchanges that send denigrating messages to the recipient because of his or her group membership (such as race, gender, age or socio-economic status).\" Transgressors can expect to be accused of engendering a \"hostile learning environment,\" an act that can get you expelled, fired and subjected to criminal probes. As law professor Eugene Voloch reported in last June, among other things, the list of offenses includes embracing merit as a means of advancing in society. A statement along the lines of \"I believe the most qualified person should get the job\" can destroy a person's academic career. So too, statements rejecting race as a significant factor in judging a person's competence are now deemed racist. For instance statements to the effect of, \"There is only one race, the human race,\" \"America is a melting pot\" or \"I don't believe in race\" can land a student or instructor in hot water. In a column last week, Dennis Prager noted that the list castigates as racism all the pillars of liberal society in America. The list, he wrote, shows that \"the American university is now closer to fascism than to traditional liberty .\" Prager is right, of course. But the fascist takeover of American academia will not affect all Americans equally. Jews are the greatest victims of this state of affairs. For the better part of the past hundred years, the upward mobility of American Jewry has been directly correlated with America's embrace of meritocratic values. The more Americans have looked past race and ethnicity and judged people by their talents, characters and professional competence, the higher Jews have risen. Conversely, where qualities other than competence, talent and professionalism have determined social and professional status, Jews have suffered. They have faced discrimination and their opportunities to advance have been limited. Academia is but a small component of American society. But to earn a place in America's middle, upper-middle and upper classes, you need at least an undergraduate degree. Moreover, university graduates go on to populate and head the state and federal governing bureaucracies, the business world, the entertainment sector and every other major area of human endeavor in American society. Academia's simultaneous rejection of core liberal principles and legitimization of anti-Semitic forces is not a coincidence. Jews are a constant reminder that human agency--rather than race and other group identities--has everything to do with a person's ability to excel in academics and beyond. For fascist principles to hold, Jews must be demonized and hated. The intrinsic link between anti-Semitism and fascism and their simultaneous embrace by a key American institution means that the equal rights and freedoms of Jews are far more threatened in America today than most Jewish leaders and activists have realized. The Jewish community's failure to date to successfully defeat the anti-Semitic forces on campuses owes at least in part to its failure to recognize or contend with the dual nature of the problem. The Washington PostShare on Facebook", "articleID": "2015113016_00041344_W", "names": {"Daniel Bernstein": ["Q5216558", "Q92865"]}}, {"date": "2015-11-30", "url": "http://www.todayszaman.com/world_leaders-of-warming-earth-seek-ways-to-cut-emissions_405727.html", "content": "Addressing the twin threats of global warming and extremist violence, the largest group of world leaders ever to stand together kicked off two weeks of high-stakes climate talks outside Paris on Monday, saying that by striking an ambitious deal to cut emissions they can show terrorists what countries can achieve when they are united. \"What greater rejection of those who would tear down our world than marshaling our best efforts to save it?\" US President Barack Obama asked his fellow world leaders. The gathering of 151 heads of state and government comes at a somber time for France, two weeks after militants linked to the Islamic State in Iraq and the Levant (ISIL) killed 130 people around Paris. Fears of more attacks prompted extra-high security and a crackdown on environmental protests--and threatened to eclipse longer-term concerns about rising seas and extreme weather linked to man-made global warming. \"The challenge of an international meeting has never been so great because it's the future of the planet, the future of life,\" French President Fran & ccedil; ois Hollande said after a moment of silence for attack victims in France, Lebanon, Iraq, Tunisia and Mali. He urged leaders to work toward a world free from both environmental destruction and extremist violence. A climate deal is by no means guaranteed. More than 180 countries have already submitted individual national plans, but that's just a foundation for a binding agreement that <mark>Jennifer Morgan</mark>, a climate policy expert at World Resources Institute, calls \"the international glue that puts them all together .\" Many of the leaders called for a binding agreement and emphasized the role of private funding. They said the world must keep the average temperature within 1 degree Celsius (1.8 degrees Fahrenheit) of current levels--and if possible to half that, to spare island nations threatened by rising seas. \"We just have 11 short days before us,\" French Foreign Minister Laurent Fabius said as he took over as president of the negotiations. \"Success is not yet assured, but it is within our grasp...The eyes of the world are upon us and there are great hopes .\" The world has already warmed nearly 1 degree Celsius since the beginning of the industrial age, and factories and cars continue to belch pollution around the world. Many of the leaders framed the problem as a generational issue, where current leaders owe it a liveable Earth to future generations. Britain's Prince Charles said: \"None of us should assume that for our today they should give up tomorrow .\" But while the relatively short speeches by world leaders pledged to do something about climate change, not all of them advocated ambitious worldwide action, perhaps giving a glimpse of sticking points to come in negotiations. Reviving the rich-poor differences that caused earlier climate talks to fail, Chinese President Xi Jinping said an eventual global climate deal must include aid for poor countries and acknowledge differences between developing and established economies. \"Addressing climate change should not deny the legitimate needs of developing countries to reduce poverty and improve living standards,\" he said. UN Secretary-General Ban Ki-moon, in his opening remarks, noted the rallies on Sunday in which hundreds of thousands of people around the world called on the leaders to make real progress at the talks. \"The future of the people of the world, the future of our planet, is in your hands,\" he told negotiators. \"We cannot afford indecision, half measures or merely gradual approaches. Our goal must be a transformation .\" Leaders called their attendance at the conference in Paris an act of defiance after the Nov. 13 attacks, some of which occurred near the airfield north of the city where the conference is taking place. Wide highways usually packed with commuters were cordoned off to clear the way for the VIPs. Riot police vans and plainclothes officers were stationed around the capital. People take part in a climate change protest around New York City Hall in Lower Manhattan, New York. (Photo: Reuters) Many of the leaders paid their respects at sites linked to the attacks. Obama, in a late-night visit, placed a single flower outside the concert hall where dozens were killed, and bowed his head in silence. \"We stand with Paris,\" UN climate change agency chief Christina Figueres said. \"The city of light, now more than ever, is a beacon of hope for the world .\" The conference is aimed at the most far-reaching deal ever to tackle global warming. The last major agreement, the 1997 Kyoto Protocol, required only rich countries to cut emissions, and the US never signed on. Among several sticking points is money--how much rich countries should invest to help poor countries cope with climate change, how much should be invested in renewable energy, and how much traditional oil and gas producers stand to lose if countries agree to forever reduce emissions. With that in mind, at least 19 governments and 28 leading world investors were announcing billions of dollars in investments to research and develop clean energy technology, with the goal of making it cheaper. Backers include Obama, Microsoft co-founder Bill Gates, Facebook founder Mark Zuckerberg, billionaires George Soros and Saudi Prince Alaweed bin Talal, and Jack Ma of China's Alibaba. Under the initiative, 19 countries pledge to double their spending on low - or no-carbon energy over the next five years. They currently spend about $10 billion a year, about half of that from the US.", "articleID": "2015113017_00017219_W", "names": {"Jennifer Morgan": ["Q29643302", "Q42413972"]}}, {"date": "2015-12-01", "url": "http://www.startribune.com/local/south/358974031.html", "content": "Rucki sisters headed to reunification program after shunning dad South Metro 358974031 Rucki sisters headed to family reunification program Saying the girls' \"life has become a circus,\" Judge <mark>Michael Mayer</mark> had to choose among three competing arguments of where Gianna, 16, and Samantha, 17, should go. By Brandon Stahl Star Tribune December 1, 2015--5:11 pm Jerry Holt, Star TribunePolice are searching a horse farm near Herman in the continuing efforts to find Gianna and Samantha Rucki, who went missing in April 2013. Wednesday November 18, 2015 in Herman, MN. Purchase: Order Reprint The runaway Lakeville sisters who had been missing for two and a half years will be sent to an intensive out-of-state reunification program after a Dakota County judge pulled them out of foster care Monday. The program aims to overcome the resistance of Gianna and Samantha Rucki to moving back in with their father, whom they still refuse to live with, less than two weeks after they were discovered on a western Minnesota horse farm. Saying the girls' \"life has become a circus,\" Judge <mark>Michael Mayer</mark> had to choose among three competing arguments of where Gianna, 16, and Samantha, 17, should go. Dakota County child protection thought they should stay in foster care. The couple who kept the runaway teens at the White Horse Ranch filed a petition on Monday saying the girls were best off with them. \"We love the children and believe we can provide them the best environment under these current circumstances,\" Doug and Gina Dahlen wrote in their motion. Before the girls ran away in April 2013, the teens repeatedly accused their father of abuse, but a court-appointed psychologist concluded that their mother, Sandra Grazzini-Rucki, had brainwashed them. Their father, David Rucki, was granted full custody of the children in November 2013 after a judge ruled that there was no credible evidence that the girls were abused. Case gone \"massively awry' Dakota County child protection placed the girls in a foster care home a few days after they were found and on Monday asked a judge to keep them there. The county argued that the girls were likely to flee again and needed to be in a safe and stable environment after refusing to live with their father. An attorney for the girls said they promised not to run away if they were allowed to remain in foster care. David Rucki objected, saying he is willing and able to care for the girls. The judge agreed, saying he had no jurisdiction to keep them under the county's supervision .\" I think I have a family law case that has gone massively awry, \"he said. <mark>Mayer</mark>'s decision gave full parental rights back to Rucki, who said he will put them in a reunification program. At the hearing, <mark>Mayer</mark> said he agreed with sending them to the program, which he described as lasting six to eight hours a day for about six to 10 weeks .\" The girls have indicated to me that they would run, \"<mark>Mayer</mark> said .\" I can't make them like their parents again. I can't make them love their parents again. But...I can give them the tools to make that happen. \"Rucki said after the hearing that he was\" elated \"by <mark>Mayer</mark>'s decision .\" I'm going to try to move forward now and get the girls the help they need, \"he said. Rucki said he was working on a plan to ensure the girls would not run away while being transported to the reunification program. Mom faces felony counts The girls' mother, Sandra Grazzini-Rucki, faces six felony counts of deprivation of parental rights, after Dakota County prosecutors alleged that she and another woman left the girls at the White Horse Ranch four days after they ran away. In a child protection petition filed last week, a Dakota County social worker said the girls told them that they were home-schooled and assisted with chores on the farm the last two years. One of the girls\" reported not having any contact with their mother \"in years' and assumed she was incarcerated .\" In their petition asking to intervene in that case, the Dahlens wrote that when the girls arrived, they had \"extreme personal fear, there was reasonable belief that they had been emotionally threatened with their life and physically abused .\" Over the next two and a half years, the Dahlens wrote, they helped the girls overcome some of their fears and grew to love the girls. \"We have provided the children with a home and shelter and all the necessities of life including food, clothing, health care, education, religious upbringing, love, support and companionship,\" the Dahlens wrote. \"The children developed friendships here and were a part of this community. The children have their ranch pets they have connected with and it has been therapeutic for them. The children indicated they wanted to stay at the ranch home .\" The judge's ruling effectively shut down that effort. <mark>Mayer</mark> noted that there were \"ongoing criminal investigations\" against the Dahlens. Outside the courtroom, the Dahlens declined to comment.", "articleID": "2015120123_00057331_W", "names": {"Michael Mayer": ["Q1611585", "Q1689106", "Q1928565", "Q1928566", "Q19964005", "Q2094087", "Q21458849", "Q47948992", "Q70378", "Q99282"]}}, {"date": "2015-12-02", "url": "http://parentherald.com/articles/13504/20151202/tom-cruise-katie-holmes-divorce-actress-reveals-she-has-no-regrets-talks-about-inspiration-your-children-are-what-drives-you.htm", "content": "Tom Cruise, <mark>Katie Holmes</mark> Divorce: Actress Reveals She Has No Regrets, Talks About Inspiration \"Your Children Are What Drives You' By Staff Reporter / Dec 02, 2015 07:00 AM EST Tags: <mark>Katie Holmes</mark>, Tom Cruise, divorce, Suri Cruise (Photo: Credit: Theo Wargo / Staff / Getty Images) Three years after her divorce with actor Tom Cruise, <mark>Katie Holmes</mark> said in an interview that she does not regret anything about her past. The former\" Dawson's Creek \"stunner, who lived a life as a Scientologist after marrying the star from\" Mission Impossible, \"had since moved on and is currently enjoying her time with daughter Suri Cruise .?\" I don't really regret anything that I've done, \"<mark>Holmes</mark>, who will turn 37 next month, confessed in a recent interview with Ocean Drive .\" I've learned from everything, and everything sort of leads you to the next place. I just keep going, \"she added. The actress said that she wouldn't be where she is now had she not learned from her past. <mark>Holmes</mark> will also be the magazine's cover girl this December. The\" Batman Begins \"star was in a high profile marriage with Cruise. However, according to a report relayed by US Weekly, <mark>Holmes</mark> said that her life these days is nothing but normal and added that she walks around New York with a cracked iPhone .\" I have a very normal life, and I happen to work in an industry that is abnormal, \"<mark>Holmes</mark> said .\" Daily life, I take a train and cab; it's just about getting from here to there, and I don't care how I do it. I have to get there. \"The New Yorker has been spotted applying makeup together with her daughter, a report by AOL stated. <mark>Holmes</mark> said that her daughter with Cruise has been her motivation to work hard. Suri, who remains in <mark>Holmes</mark>' custody after the marriage, has been her driving force .\" Being a parent also is a source of inspiration to just work really hard. You want to set an example-and, you know, [your kids] are what drives you. \"Living a down-to-earth life with Suri somewhat gives her a new outlook in life .\" If you're having a bad day, you just take a walk, and it's not only that you see people who are having a worse day than you, it's just that you're in life, \"<mark>Holmes</mark> told Ocean Drive .\" You suddenly can't be stuck in whatever problem you're in because you have to hail a cab or you have to get a subway ticket, \"she continued .\" There's more than just you. And I think the harsh winters give you a little bit of character. \"<mark>Holmes</mark> divorced Cruise in August 2012 after being married for five years. & copy; 2015 ParentHerald.com All rights reserved. Do not reproduce without permission. Sign UpParent Herald Newsletter Get the ultimate dish on the latest Parenting news, plus exclusive recipes, decorating ideas, videos and more - for free! Most Popular", "articleID": "2015120212_00025883_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"]}}, {"date": "2015-12-02", "url": "http://geo.tv/article-206092-Achakzai-for-foreign-policy-based-on-provinces-recommendations", "content": "Achakzai for foreign policy based on provinces' recommendations Posted: December 02, 2015 - 1930 PKT | Comment QUETTA: Pakhtunkhwa Milli Awami Party (PK-MAP) leader Mehmood <mark>Khan</mark> Achakzai on Wednesday said the country's foreign police should be based on recommendations put forth by all the four provinces. Addressing a rally on the occasion of nationalist leader <mark>Abdul Samad Khan</mark>'s death anniversary, the PK-MAP leader said the provinces should be given their basic rights. Achakzai linked completion of China-Pakistan Economic Corridor (CPEC) with peace in the region. He said peace cannot be achieved until the environment of distrust between Afghanistan and Pakistan is eliminated. \"Both the countries (Pakistan and Afghanistan) need peace,\" he added. He said the soil is dearest to Pashtun after the holy Quran and Kalima and the nation will not make any compromise on it. The PK-MAP leader said the people of Balochistan should also be given their basic rights. Print this story Tweet \"Previous Next' More from: PAKISTAN Sacrifices of security personnel in Karachi will not go in vain: Asif Chehlum Imam Hussain: Govt refuses to suspend mobile phone service in Karachi Indian External Affairs minister to visit Pakistan next week: reports Karachi operation will be expanded across Sindh: Chandio Comments Please enable JavaScript to view the comments.", "articleID": "2015120216_00041763_W", "names": {"Abdul Samad Khan": ["Q51200948", "Q59490523"]}}, {"date": "2015-12-02", "url": "http://feeds.theguardian.com/c/34708/f/663879/s/4bf31297/sc/7/l/0L0Stheguardian0N0Cworld0C20A150Cdec0C0A20Cnicolas0Ehenin0Evideo0Eisis0Esyria0Estrikes/story01.htm", "content": "Syria Former Isis hostage says airstrikes on Syria are a trap French journalist Nicolas Hénin, who was held by Mohammed Emwazi, begs international community not to bomb Islamic State Wednesday 2 December 2015 11.36 ESTLast modified on Wednesday 2 December 2015 12.42 ESTShare on WhatsApp A French journalist held hostage by Islamic State for 10 months, has made an impassioned plea against bombing Syria, saying it was a trap that would only benefit Isis. Nicolas Hénin, previously held hostage by Mohammed Emwazi, implored the international community to seek a political solution. Engaging with Syrians, not bombing them, was the surest way to bring about the collapse of Isis, he said. In a five-minute video said to have been recorded in the past few days in Paris and posted on YouTube by the Syria Campaign, Hénin said: \"Strikes on Isis are a trap. The winner of this war will not be the parties that have the newest, most expensive, most sophisticated weaponry, but the party that manages to have the people on its side .\" In his message, apparently timed to coincide with Wednesday's UK parliament debate on joining Syria airstrikes, he said: \"At the moment, with the bombings, we are more likely pushing the people into the hands of Isis. What we have to do, and this is really key, we have to engage the local people .\" As soon as the people have hope in the political solution, then Islamic State will just collapse. It will have no ground any more. It will collapse. \"Hénin was released along with other French hostages in April 2014. He had been held captive alongside <mark>James Foley</mark>, Steven Sotloff, <mark>David Haines</mark> and Alan Henning, who were all murdered by Emwazi .\" Mohammed Emwazi was one of my captors. He is the one who murdered my friends, \"said Hénin .\" I can't prevent myself from thinking for the six murders that he committed, face to camera, murders of westerners, how many Syrians did he kill, and who cares for them? \"Related: Mohammed Emwazi killed my friend, but his own death won't affect the war | Sulome Anderson He said the jihadis lived in a parallel world and a\" different matrix \". They believed in a\" mad prophecy \"that there would be a global confrontation between a coalition of\" 80 armies against an army of Muslims coming from all over the world \"and were\" a bit out of their mind \". Hénin said:\" Why are we making so many mistakes? Why are people so much misunderstanding the region? We are just fuelling our enemies, and fuelling the misery, the disaster for the local people. \"He said the radicalisation was the result of passivity by the international community, who failed to assist Syrian democrats\" as they were yelling for their freedom, and the Syrians were living in total despair \". He said:\" For every single Syrian killed since the beginning of this conflict by Islamic State, between seven and 10 have been killed by the Syrian regime. We have to understand that these two parallel disasters for the Syrian people, they depend one on the other, and one cannot fight one without fighting the other. \"Hénin said the summer refugee crisis had been a propaganda blow to Isis. Images of refugees fleeing the Muslim\" dreamland \"and being welcomed in the lands of\" unbelievers \"had given a lie to their message of western hatred towards Muslims, he said .\" And that is why they probably tried to manipulate the public during the Paris attack, to make us close our borders, and maybe, even more importantly, to close our minds. \"There was an easy way to make Islamic State\" lose ground at high speed \"he said .\" It would be for the international community to take the decision that all the Syrian regions that are held by the opposition are no-fly zones; no-fly zones for everybody. Not the coalition, not the Russians, not the regime. Nobody. So, actually to provide security to the people would be devastating for Isis and this is what the international community should focus on, \"he said.", "articleID": "2015120217_00099240_W", "names": {"David Haines": ["Q16205272", "Q17853904", "Q24300277", "Q42323097", "Q5234617"]}}]