[{"articleID": "2014042009_00036209_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2014-04-20", "url": "http://wabi.tv/2014/04/19/record-store-day-popular-bangor/?utm_source=rss&utm_medium=rss&utm_campaign=record-store-day-popular-bangor", "content": "Record Store Day Popular in Bangor Posted Saturday, April 19th, 2014 at 10:35 pm. It was 7 years ago today that Record Store Day came to life. The event was an idea from a Bull Moose employee, <mark>Chris Brown</mark>. He networked with independent record stores to start the day. Record Store Day is mean to celebrate records, record stores, and their loyal customers. Employees at the Bangor Bull Moose say it's a busy day for their store. \"It's basically like our Spring kickoff. You know, kinda like opening day in baseball...Opening day of Spring for records sort of deal,\" said Freeman Saunders, Bull Moose Employee."}, {"articleID": "2019062223_00121238_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2019-06-22", "url": "http://ctvnews.ca/world/kim-jong-un-receives-excellent-letter-from-trump-1.4478482", "content": "Published Saturday, June 22, 2019 6:27 PM EDT Last Updated Saturday, June 22, 2019 6:42 PM EDT PYONGYANG, Korea, Democratic People's Republic Of--U.S. President Donald Trump sent North Korean leader <mark>Kim Jong Un</mark> a letter, a government-controlled news agency reported Sunday. <mark>Kim</mark> \"said with satisfaction that the letter is of excellent content,\" the Korean Central News Agency reported. \"Appreciating the political judging faculty and extraordinary courage of President Trump, <mark>Kim Jong Un</mark> said that he would seriously contemplate the interesting content,\" the agency said. Nuclear talks between the U.S. and North Korea broke down after the failed summit between <mark>Kim</mark> and Trump in February in Vietnam. The U.S. is demanding that North Korea abandon its nuclear weapons entirely before international sanctions are lifted. North Korea is seeking a step-by-step approach in which moves toward denuclearization are matched by concessions from the U.S., notably a relaxation of the sanctions. Trump and <mark>Kim</mark> exchanged letters in 2018 after a summit in Singapore to discuss the nuclear issue. White House spokeswoman Sarah Huckabee Sanders said at the time that the letters addressed their commitment to work toward North Korea's \"complete denuclearization .\" In September 2018, Trump told a cheering crowd at a campaign rally in West Virginia that <mark>Kim</mark> \"wrote me beautiful letters and they're great letters. We fell in love .\" Related Stories"}, {"articleID": "2019021301_00170617_W", "names": {"Tom Fletcher": ["Q1051540", "Q16215254", "Q57438696", "Q7815809"], "Janet Austin": ["Q52159219", "Q57078351"], "John Horgan": ["Q16145291", "Q21175985", "Q331298", "Q6239861", "Q6239868", "Q6239870"]}, "date": "2019-02-12", "url": "https://www.merrittherald.com/b-c-government-aims-to-stop-concert-ticket-payday-loan-gouging/#respond", "content": "Home> News> B.C. government aims to stop concert ticket, payday loan gouging B.C. government aims to stop concert ticket, payday loan gouging By <mark>Tom Fletcher</mark> on February 12, 2019 Winter weather caused the traditional 15-gun salute and military inspection to be cancelled before B.C. Lt.-Gov. <mark>Janet Austin</mark> read the NDP government's speech from the throne, Feb. 12. (<mark>Tom</mark> Fletcher/Black Press). B.C. Premier <mark>John Horgan</mark> set the agenda for his government's spring session Tuesday with a throne speech packed with promises to hold down ferry and electricity costs, while promising legislation to regulate event ticket sales and payday lenders. Canada's high cellphone bills are another priority for the province, according to the speech read in the B.C. legislature by Lt. Gov. <mark>Janet Austin</mark>. But don't expect relief right away; changes this year include improving \"billing transparency\" and doing another of the NDP government's familiar consultation rounds, while federal law controls much of the wireless industry. \"Your government will give consumers the tools they need to get the least expensive possible service and encourage the federal government to deliver more affordable cellphone options for people,\" the speech says. New rules are on the way for live event ticket sellers, including a ban on mass ticket-buying software. Payday lenders will see a new cap on the fees they can charge. The latest review of money laundering and its effect on real estate is to be completed, with recommendations the speech says \"will provide a basis for immediate action to close loopholes and defend against criminal activity .\" Other goals for 2019 include establishing new Class A provincial parks and creating a Chinese-Canadian museum, along with an upgrade of the Royal B.C. Museum in Victoria. Land purchased on Vancouver Island, the Sunshine Coast, the Okanagan and Kootenays is to be given the province's highest park protection. A freeze on B.C. Ferries fare increases for major routes and discounts on minor and northern routes are to continue for a second year. The speech promises to carry on with rental market changes recommended late last year by an MLA task force. This could include legislation to prevent strata councils from banning rentals. Action is also promised to speed up new rental housing projects and deliver \"more efficient and effective project approvals .\" In industrial development, the speech promises legislative action to advance the LNG Canada project. Before that massive project can begin operation, a dispute with dissident hereditary chiefs of the Wet's uwet' en First Nation in northwest B.C. on the key natural gas pipeline route has to be resolved, and the province must remove the liquefied natural gas income tax put in place by the previous B.C. Liberal government. Mining is also promised help, including \"more support for innovation in mining and mineral exploration, and promoting Indigenous partnerships .\" "}, {"articleID": "2009112401_00046398_W", "names": {"Michael O'Brien": ["Q11778378", "Q16206383", "Q19604892", "Q19662601", "Q22279447", "Q2346461", "Q2375037", "Q29643362", "Q52356783", "Q53228661", "Q6830873", "Q6833120", "Q6833121", "Q6833123", "Q6833125", "Q6833128", "Q6833130", "Q6833131", "Q6833132"]}, "date": "2009-11-24", "url": "http://borderwatch.com.au/archives/5442", "content": "news / \"trade olympics' medals presented\" trade olympics' medals presented posted on november 24, 2009, 8:08 am south east \"tradie\" ben hooper took out dual gold in fitting and turning categories when medals were presented on friday night at tafe sa's mount gambier campus for the region's worldskills australia competition. dubbed the \"olympics for tradies\" , the south east event featured 13 categories, ranging from welding to hairdressing and information technology, run across the region from june to october. competitors came from across the limestone coast, including mount gambier, millicent, beachport, kingston se, penola, naracoorte, lucindale, bordertown and western victoria. project manager andrew knowles said 160 people, representing the trades, government, business and other sectors attended the presentation night, which featured guest speaker and past national gold medallist jodie taylor. gold, silver and bronze medals were presented in each category, which also included beauty, metal fabrication, machining, carpentry, electrical, construction and business services, gold medal winners will compete in the national championships in brisbane next year, with winners earning the chance to represent the nation as part of the \"skillaroos\" at the world championships in london against 50 other countries. ms taylor, who had success in the business services category, is from the south east, which has showed continued dominance in the sector with fellow regional entrant nikita block winning nationally last year and now on a scholarship in london. mr knowles said the competition gave people aged under 23 an opportunity to test their skills against their peers, with the challenges stepping up at national and world level. \"it gives a good indication of the health of our trades,\" he said, adding that 143 people competed in the regional heats. \"the regionals are a serious step-up from what they do in their normal learning and the intensity will be up again at the nationals for the 13 gold medallists who can now continue on - the world titles is obviously much bigger again .\" regional competitions are held every two years and mr knowles said the south east event had two additional categories this year and was expected to continue to grow, with up to 40 sections available. \"it depends on what we have in numbers to run competitions, but it is slowly building in the south east,\" he said. employment, training and further education minister <mark>michael o'brien</mark> said the competitions gave young people the opportunity to challenge themselves to excel in their particular field. news tip, submit article or photo do you have pictures or information"}, {"articleID": "2019082216_00256399_W", "names": {"Kate Hudson": ["Q169946", "Q6375550"], "Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2019-08-22", "url": "http://feeds.inquisitr.com/~r/google/yDYq/~3/G0EdPtwp0u0/", "content": "Rebecca Cukier The latest casting for Dancing with the Stars is all anyone can talk about. Supermodel legend Christie Brinkley is officially on-board as one of the upcoming season's faces, and it looks like she's been doing a little celebrating. The 65-year-old took to Instagram on Wednesday evening to mark joining the ABC series with a set of photos that sent the platform a reminder: this blonde might be a little more advanced in years, but she's still got it. Christie's snaps came straight from a red carpet moment backed by walls with the competition series' logo. Christie was photographed looking ready to bust some moves by virtue of her raised knee and stretched-out leg, but this update seemed to be more than just a reminder that Christie will be landing on screens in mid-September. The Sports Illustrated alum was flaunting her killer legs in a skimpy mini dress with polka dot motifs--suffice to say that this mother can pull off a floaty little number like the 20-somethings. The star's legs were looking sensational in a pair of strappy and glittery silver heels, with fans appearing to see as much muscle as they did style. A sense of humor is never amiss with Christie. Those paying attention to the model's caption will have picked up on her joking age reference. View this post on Instagram Hey Everybody! I just wanted to let you know I'm hoping to bust a move and not a hip on Dancing With The Stars!???????? Premieres September 16th on @ abctv at 8:00 7 Central Hope you will join me just for kicks on this latest fun adventure! @ dancingabc #DWTS my dress @ carolineconstas #greasethejoints A post shared by Christie Brinkley (@ christiebrinkley) on Aug 21, 2019 at 6:06 pm PDT Christie's update proved a hit, racking up over 9,500 likes. The same time frame brought over 456 fans into the post's comments section. Christie has already made a bit of a statement about her upcoming appearance, although once again, the epic sense of humor came out, in addition to an admission that she's a little unsure about joining the dance world. Speaking to ET Online, Christie aired her thoughts. View this post on Instagram These photos remind me of that old expression...\"is that a cucumber in your basket or are you just glad to see me?\" ???? #organic #garden #organicgardener???? A post shared by Christie Brinkley (@ christiebrinkley) on Aug 16, 2019 at 3:27 pm PDT \"I'm so excited! I think it's going to be so fun. I literally don't know how to dance. Seriously, it's true...I really don't have the moves. So I'm really excited to learn with the pros. It's a wonderful opportunity for me .\" Loading...\"I think whoever I get has his work cut out for him. I think they need to give me a really good one because I need a lot of work...All of the dancers on the show are incredible, really amazing,\" she added. View this post on Instagram I'm busy doing my part for #nationalproseccoday???????????? @ bellissimaprosecco #zerosugarprosecco @ bellasprizz #aperitivo #organicprosecco #veganprosecco #allnaturalprosecco A post shared by Christie Brinkley (@ christiebrinkley) on Aug 13, 2019 at 6:05 pm PDT Christie's Instagram following will likely shoot up because she is joining a mega-popular franchise. Christie's following right now isn't insignificant, though. The much-loved blonde has 522,000 followers. Her account is followed by celebrities including Kate Upton, <mark>Kate Hudson</mark>, plus The Real Housewives of <mark>Beverly Hills</mark> star Lisa Rinna, among others."}, {"articleID": "2018022509_00122580_W", "names": {"Howard Phillips": ["Q13569762", "Q22907741", "Q977175"], "William Stanley": ["Q17152417", "Q41755515", "Q8018729"]}, "date": "2018-02-25", "url": "http://lovecraft.wikia.com/wiki/Winifred_V._Jackson?diff=15118&oldid=15108", "content": "Revision as of 08:31, February 25, 2018 (edit) AVoraciousReader (wall | contribs) ← Older edit Latest revision as of 08:48, February 25, 2018 (edit) (undo) AVoraciousReader (wall | contribs) Line 1: Line 1: + {{realworld}} {{Infobox writer {{Infobox writer | name = Winifred Virginia Jackson | name = Winifred Virginia Jackson Latest revision as of 08:48, February 25, 2018 \"The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown .\" - H.P. Lovecraft This article is written on a topic in the real world and reflects factual information. Winifred V. Jackson Pseudonym (s) Elizabeth Berkley Birth Date 1876 Birthplace Maine Death Date 1959 Nationality United States Genre Horror, poetry, fantasy Spouse Horace Jordan (divorced 1919) Winifred V. Jackson was a collaborator with <mark>Howard Phillips</mark> Lovecraft on the short stories, The Green Meadow and The Crawling Chaos, under the name Elizabeth Berkeley. Details about her life are scarce, but there is speculation that she and Lovecraft were romantically involved during the period of their collaborations. Lovecraft was highly congratulatory of her work and praised her talent in his essay, Winifred Virginia Jackson: A \"Different\" Poetess. It is of note that she was married to an African-American man, Horace Jordan. This was a rarity in the era. Furthermore after her divorce and during her maybe-romance with Lovecraft, she was romantically involved with the African-American poet and critic <mark>William Stanley</mark> Braithwaite. Some of the remaining examples of her poems appear in his collections. This article is a stub. You can help the The H.P. Lovecraft Wiki by expanding it. Retrieved from \"http: //lovecraft.wikia.com/wiki/Winifred_V._Jackson? oldid=15118\" Categories: Articles written on real-world topics Article stubs Writers Cthulhu Mythos writers"}, {"articleID": "2010101705_00140830_W", "names": {"Mary Richards": ["Q56187740", "Q6780604"]}, "date": "2010-10-17", "url": "http://erictheblue.typepad.com/eric_the_blue/2010/10/having-finished-freedom-by-jonathan-franzen-my-haphazard-reading-habits-have-caused-me-to-pick-up-the-collected-stories-of.html", "content": "lydia davis, glenn gould & mary tyler moore having finished freedom, by jonathan franzen, my haphazard reading habits have caused me to pick up the collected stories of lydia davis, which more than caffeine has aroused my nervous system during midmorning, work-day coffee breaks. davis's \"fictions\" have been called crosses between stories, prose poems, and philosophic aphorisms. in an interview, she has said that she likes beckett for \"the plain, anglo-saxon vocabulary; the intelligence; the challenge to my intelligence; the humor that undercut what might have been a heavy message; and the self-consciousness about language .\" these are characteristics that one recognizes in davis's work, too. and another one that she did not mention, the bleak outlook. in a story called \"glenn gould,\" the narrator, a stay-at-home mother, makes a point of watching \"the mary tyler moore show\" whenever possible. it seems odd that one of my favorite tv shows plays a part in the last two books i've read. franzen's teen-aged patty emerson, watching at her home in westchester county, new york, is by way of this show introduced to my hometown of minneapolis, and to escape her affluent but damaged family of origin she accepts an athletic scholarship to the university of minnesota. davis's character, describing the attractions of the show, says: \"i want to stay in that other place, that other city that is a real city but one i have never visited .\" one feels that the language, here and almost everywhere in davis's work, is charged and allusive. the \"other place,\" \"that other city that is a real city but one i have never visited,\" is not really or just minneapolis, minnesota. it's where sane, grounded, decent, intelligent, mostly contented <mark>mary richards</mark> makes her home. that's the place the narrator hasn't been. she gives the impression that she regards \"the mary tyler moore show\" as a guilty pleasure and is therefore pleased to learn, in a letter from her friend mitch, that glenn gould, the great pianist she admires, is also a fan. in the course of the brief story (though, at nine pages, it's one of davis's longer ones), some of the pianist's characteristics are mentioned, and the movement is from the elevated (\"intelligent,\" \"high standards,\" \"articulate\" ) to the ominous (\"hypochondriac,\" \"excessively careful of his hands,\" \"was fond of a certain rather ugly female pop singer\" ). also, there is this: glenn gould did not have children. he was not married. the narrator is married and has a child. there is nothing in the story to indicate that either is a source of much satisfaction. the husband is barely in the story. when they eat dinner, they sometimes have little to talk about, so she will tell him about something funny from the last show. then, \"i can see that he is ready to laugh even before i tell it, though so often, in the case of other subjects, he is not terribly interested in what i say to him, especially when he sees that i am becoming enthusiastic .\" the sentence proceeds, clause by clause, to that final one: especially when he sees that i am becoming enthusiastic. that is all there is about the husband. her friend who tells her that glenn gould watches \"mary tyler moore\" is mitch but the husband is not named. one of the things the narrator mentions about glenn gould is that he \"was able to be selfish without hurting anyone .\" your comment could not be posted. error type: the letters and numbers you entered did not match the image. please try again."}, {"articleID": "2017060222_00225945_W", "names": {"Mark Avery": ["Q38023167", "Q59261371", "Q6766617"]}, "date": "2017-06-02", "url": "http://www.huffingtonpost.com/2017/05/30/15-times-brooke-shields-captured-the-highs-and-lows-of-motherhood_n_16925520.html", "content": "Neilson Barnard via Getty Images Brooke Shields has two daughters, Rowan and Grier. Brooke Shields is no stranger to the highs and lows of parenting. The actress and her husband, Chris Henchy, have two daughters, 14-year-old Rowan and 11-year-old Grier. Over the years, Shields has been incredibly open about her experiences as a mother--from her battle with postpartum depression (the subject of her 2005 memoir Down Came the Rain) to her parenting rules to her hopes for her children. In honor of her birthday this week, we've compiled some of her most honest and touching quotes about parenthood. On her fears as a mother \"I'm terrified that I'm not really understanding who they are, and that maybe one day they won't feel like they can come to me--that I will somehow fail them...I don't know if you overcome it. The way I try to get through it is by talking to other moms. Either someone will do something that's seemingly worse, and I'll think,\" At least I didn't do that,' but then someone will do something better and I think, \"I've gotta learn that, I've got to do that instead!\" ' On her advice for new parents \"Don't be afraid to ask for help and don't be too hard on yourself. If you think that everybody else has it figured out and you're the only one that's going crazy or yelling or feeling like you can't do it all...you're not alone .\" A post shared by Brooke Shields (@ brookeshields) on Apr 16, 2017 at 9:37 am PDT On living in the moment \"They're not going to remember Mom was tired. They're going to remember I did the weather chart or story time at school. So you just do it. And you're tired...It's the mundane stuff that is important .\" On playdates and raising grounded kids \"If you're not polite, you can't come to my house. Manners [represent] respect and kindness. I want people to like my kids, and if they're bratty, they'll have a harder time in life .\" On the beauty of parenthood \"Once you love someone that much, you think, god, why did I do this to myself? It's so heart-wrenching! And then you realize: It's so heart-wrenching. That's why I did it to myself .\" On her decision to speak out about her postpartum depression \"Because nobody was talking about postpartum depression, and women were suffering all the time. I wanted to educate women who were suffering and families of women who were suffering .\" <mark>Mark Avery</mark> / Reuters On being a celebrity parent \"You know, the only reason why it seems like it's more challenging is because it's in the public eye to a certain extent and it's scrutinized, but that is such a minor percentage. Really the challenges are just about being a mom. All moms have them, and nobody's exempt .\" On staying calm as a mother \"Every day there's a new challenge. My new thing is not screaming and not screaming back at them. I would engage in an absolute fight, and my husband would say,\" What's wrong with you? Why are you fighting with them?'...Chris, my husband, calls it FOFO--Find Out Before You Freak Out. So before I react, I'm now trying to just count to 10. \"On how becoming a mom changed her life\" It took having a child, for me to feel like I belong, that I'm normal. \"A post shared by Brooke Shields (@ brookeshields) on May 14, 2017 at 12:46 pm PDT On embracing imperfection as a parent\" I would have thought that I would have become one of those parents--just because it's my nature to be such a perfectionist--that anything falling short, I would have seen as a failure. But something has happened to me over the past few years--it's not Zen, believe me, I'm not at all Zen--but I'm so appreciative of even the chaos. It's not about being perfect; it's about being engaged. \"On work-life balance\" I had a moment where I realized I was spending all of my free time, which is so little, doing events and going to charities. I wasn't putting my kids to bed at all. When you're doing theatre it's almost impossible to put them to bed and it really threw me for a loop. I have to work so when I'm not working, it's easy to get caught up and say, oh, I'll do that charity or I'll do that thing for you. And your kids are with the babysitter and it's heartbreaking. \"On how having kids changed her attitude toward her career\" Being a mom puts the rejection of being an actress in perspective. \"Bruce Glikas via Getty Images On mom peers\" I get support from other moms and my therapist. It is only as important to connect with mom peers as it gives you comfort. If and when it gets competitive, it becomes toxic. \"On how parenthood shifts your priorities\" However, having my first daughter obliterated me. It took away all my power. All of a sudden I was experiencing something so foreign, which I had no response for. I had no resources to rely on. It was not simply about being the good girl, or being polite, or doing my job. A little human being was involved. \"On the joys of raising children\" What I love most is being able to wake up in the morning with these innocent and truthful little people. \"Suggest a correction Caroline Bologna Parents Editor, HuffPost MORE: U.S. News Arts And Entertainment Parenting Postpartum Depression Brooke Shields Close"}, {"articleID": "2017053007_00391172_W", "names": {"Chris Pratt": ["Q503706", "Q5107796"]}, "date": "2017-05-30", "url": "http://thecourierexpress.com/lifestyle/entertainment/geoffrey-rush-originality-has-been-key-to-pirates-of-the/article_9650c6f2-9985-5a97-a05b-ebf94562f1ce.html", "content": "Geoffrey Rush thinks the \"Pirates of the Caribbean' franchise was wise to avoid stereotypes. The 65-year-old actor - who stars as Hector Barbossa in the money-spinning movie series - has claimed the success of the\" Pirates' films can be linked to their unconventional characters, like Captain Jack Sparrow. He explained: \"Right from the beginning, we always talked about how pirate films were a bit dead in the water, maybe since the '50s with Errol Flynn and Burt Lancaster, certainly as a populist film. There's been\" The Princess Bride', and films like that. \"We were very low down on the summer release schedule. We were lost in the small print in the trades, under\" This is what's coming out, in the summer of 2003'. \"Jerry Bruckheimer timed it right. This was pre-Twitter and pre-social media. It really thrilling caught people's imaginations, and I think part of that was the originality of how Johnny [Depp] led the company and created a pirate that had none of the traditional tropes .\" Geoffrey thinks his on-screen co-star and his original way of thinking has been central to the success of the franchise. More from this section Review: \"Killers of the Flower Moon: The Osage Murders and the Birth of the FBI' by David Grann Nick Grimshaw starstruck by <mark>Chris Pratt</mark> Gregg Allman dies aged 69 The actor told Collider:\" [Depp] does have a tangential, warped, absurd, creative mind, and he looked at the idea that they all drank rum and they were always in the sun. \"He said,\" Geoffrey, man, their brains are fried!' And then, he talked about rock stars of the '60s and the flamboyant clothing. And he came up with this idea, which I thought was really, really clever, where he said, \"In the script, sometimes I'm on boats and sometimes I'm on land, and I just want to play around with never getting my sea legs and land legs in order,' and that gave him so much scope .\" And with Barbossa not having a parrot, but having a monkey, we tried to find archetypes and not stereotypes. \""}, {"articleID": "2018080219_00056215_W", "names": {"Ken Rice": ["Q37620027", "Q6388359", "Q6388360"]}, "date": "2018-08-02", "url": "http://www.kiro7.com/news/local/sprinklers-keep-arson-fire-in-check-at-suquamish-elementary-school/804440310", "content": "Sprinklers keep arson fire in check at Suquamish elementary school Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Sprinklers keep arson fire in check at Suquamish elementary school By: KIRO 7 News Staff Updated: Aug 2, 2018 - 12:04 PM Loading...Sprinklers keep arson fire in check at Suquamish elementary school SUQUAMISH, Wash. - North Kitsap Fire & Rescue crews responded to a fire at Squamish Elementary School at 11:51 p.m. Wednesday night that officials say was the result of someone setting a couch on fire just outside the school. Squamish Elementary School is part of the North Kitsap School district and is located at 8950 Park Blvd NE, Suquamish, WA 98392. Related Headlines Crews rescue dog, owner from embankment Arriving firefighter crews found heavy smoke at the scene, water flowing from the sprinkler system, but no flames. \"About 100 square feet of the building's exterior finish was blackened. School officials believe that the couch, which was destroyed in the incident, was dumped by unknown person (s) in or near the building's dumpster,\" North Kitsap Fire & Rescue said in a news release. A fire investigation of the Kitsap County Fire Marshal's Office responded to the scene and determined the fire was intentionally set. Officials say no firefighters or civilians were injured in the fire. Anyone with information about the incident is asked to call Deputy Fire Marshal <mark>Ken Rice</mark> at (360) 337-5777. More news from KIRO 7"}]