[{"date": "2015-12-02", "url": "http://feeds.theguardian.com/c/34708/f/663879/s/4bf31297/sc/7/l/0L0Stheguardian0N0Cworld0C20A150Cdec0C0A20Cnicolas0Ehenin0Evideo0Eisis0Esyria0Estrikes/story01.htm", "content": "Syria Former Isis hostage says airstrikes on Syria are a trap French journalist Nicolas Hénin, who was held by Mohammed Emwazi, begs international community not to bomb Islamic State Wednesday 2 December 2015 11.36 ESTLast modified on Wednesday 2 December 2015 12.42 ESTShare on WhatsApp A French journalist held hostage by Islamic State for 10 months, has made an impassioned plea against bombing Syria, saying it was a trap that would only benefit Isis. Nicolas Hénin, previously held hostage by Mohammed Emwazi, implored the international community to seek a political solution. Engaging with Syrians, not bombing them, was the surest way to bring about the collapse of Isis, he said. In a five-minute video said to have been recorded in the past few days in Paris and posted on YouTube by the Syria Campaign, Hénin said: \"Strikes on Isis are a trap. The winner of this war will not be the parties that have the newest, most expensive, most sophisticated weaponry, but the party that manages to have the people on its side .\" In his message, apparently timed to coincide with Wednesday's UK parliament debate on joining Syria airstrikes, he said: \"At the moment, with the bombings, we are more likely pushing the people into the hands of Isis. What we have to do, and this is really key, we have to engage the local people .\" As soon as the people have hope in the political solution, then Islamic State will just collapse. It will have no ground any more. It will collapse. \"Hénin was released along with other French hostages in April 2014. He had been held captive alongside <mark>James Foley</mark>, Steven Sotloff, <mark>David Haines</mark> and Alan Henning, who were all murdered by Emwazi .\" Mohammed Emwazi was one of my captors. He is the one who murdered my friends, \"said Hénin .\" I can't prevent myself from thinking for the six murders that he committed, face to camera, murders of westerners, how many Syrians did he kill, and who cares for them? \"Related: Mohammed Emwazi killed my friend, but his own death won't affect the war | Sulome Anderson He said the jihadis lived in a parallel world and a\" different matrix \". They believed in a\" mad prophecy \"that there would be a global confrontation between a coalition of\" 80 armies against an army of Muslims coming from all over the world \"and were\" a bit out of their mind \". Hénin said:\" Why are we making so many mistakes? Why are people so much misunderstanding the region? We are just fuelling our enemies, and fuelling the misery, the disaster for the local people. \"He said the radicalisation was the result of passivity by the international community, who failed to assist Syrian democrats\" as they were yelling for their freedom, and the Syrians were living in total despair \". He said:\" For every single Syrian killed since the beginning of this conflict by Islamic State, between seven and 10 have been killed by the Syrian regime. We have to understand that these two parallel disasters for the Syrian people, they depend one on the other, and one cannot fight one without fighting the other. \"Hénin said the summer refugee crisis had been a propaganda blow to Isis. Images of refugees fleeing the Muslim\" dreamland \"and being welcomed in the lands of\" unbelievers \"had given a lie to their message of western hatred towards Muslims, he said .\" And that is why they probably tried to manipulate the public during the Paris attack, to make us close our borders, and maybe, even more importantly, to close our minds. \"There was an easy way to make Islamic State\" lose ground at high speed \"he said .\" It would be for the international community to take the decision that all the Syrian regions that are held by the opposition are no-fly zones; no-fly zones for everybody. Not the coalition, not the Russians, not the regime. Nobody. So, actually to provide security to the people would be devastating for Isis and this is what the international community should focus on, \"he said.", "articleID": "2015120217_00099240_W", "names": {"James Foley": ["Q1680393", "Q17562199", "Q721389"]}}, {"date": "2015-12-03", "url": "http://au.news.yahoo.com/thewest/a/-/breaking/30262203/new-force-chief-ready-to-roll-up-sleeves/", "content": "New Force chief ready to roll up sleeves New Western Force chairman Tony Howarth says there is no room for complacency as the club rebuilds from the disastrous 2015 wooden spoon Super Rugby season. Coaches and players have plenty of work ahead and Howarth knows there are financial challenges to face in the RugbyWA boadroom. He is confident of returning a healthier balance sheet after posting three consecutive losses but warns there is no room for mediocrity on or off the field. \"The financial challenge is a strong one. There have been a couple of tough years,\" Howarth said. \"We want to make sure that we have a strong, healthy, financially viable club and we can't afford to be complacent .\" There are not a lot of discretionary funds about but with the renegotiation of the media rights (yet to be announced by the ARU), we are in a much better spot financially. \"A lot of money gets taken out of the town in terms of the two football teams (West Coast and Fremantle) and we want to make sure rugby has its fair share .\" At board level we can't afford to be complacent. We are always having to find ways of doing more with less without compromising the on field quality. \"For the third consecutive season the side will start without a major sponsor but naming rights for individual jumpers have again been sold .\" We would love to get a major sponsor. We're working with some people but in this environment major sponsors do not come easily, \"Howarth said .\" Rugby is a strong offer for sponsorship. It's a global game, it's a great product. It's just a little bit tougher in the west. \"Membership and season ticket sales are tracking towards last season's 16,230 but Howarth is realistic. He knows they are unlikely to ever again reach the heady first season when they signed up 21,000 members and averaged 28,000 a game. Last year's average gate was 11,000 .\" The Force had such a strong momentum when it first set up, then we had difficulties with the (Patersons) stadium and our competitiveness, \"he said .\" The best way to make sure we have a competitive Western Force is to have a really strong support base. That's the challenge for us. \"There is a feeling of optimism, but we have to play an entertaining style, one that people feel proud of and are emotionally involved in .\" We are absolutely committed to turning last season around but we cannot afford to be complacent in the style of rugby that we play. \"That's our focus on the field. We want to score tries .\" Howarth is happy with the off-season recruitment that includes former Springbok <mark>Peter Grant</mark>, Wallaby Ben Tapuai, and fly-half Jono Lance. \"We are pretty happy with recruitment. We have a stronger side than last year, a side that can score,\" he said. \"We've always had a great forward back but now we've got some really good inside back combinations and some capacity to score tries out wide .\" Share Share New Force chief ready to roll up sleeves - The West Australian Email Facebook Twitter Pinterest Tumblr", "articleID": "2015120306_00345046_W", "names": {"Peter Grant": ["Q19882721", "Q20027846", "Q27486091", "Q3067879", "Q3376624", "Q7174337"]}}, {"date": "2015-12-03", "url": "http://www.usatoday.com/story/life/music/2015/12/03/coldplay-a-head-full-of-dreams-album-of-the-week/76565784/", "content": "Coldplay's seventh album,' A Head Full Of Dreams,' arrives Friday. (Photo: None) CONNECT TWEET LINKEDIN EMAILMORE \"Conscious uncoupling\" doesn't always spell trouble. After Coldplay frontman <mark>Chris Martin</mark> and now-ex-wife Gwyneth Paltrow announced their split in March 2014, the British band released its sullen Ghost Stories just two months later: a sparse, muted breakup album which they didn't support on tour and was generally dismissed as a forgettable, phoned-in effort. USA TODAY \"Head Full of Dreams' finds Coldplay in a happy place But more than a year and a couple famous girlfriends (Jennifer Lawrence, Annabelle Wallis) later, <mark>Martin</mark> sounds reinvigorated and ready to move forward. On seventh (and possibly final) album A Head Full of Dreams, the wistful rockers are sonically adventurous and optimistic, even while occasionally offering more of the same. Dreams (*** out of four) starts with the euphoric title track, as <mark>Martin</mark> sings about his flights of fancy over a bright, throttling rush of drums and guitar. Birds is similarly urgent and uplifting in its lofty ambitions of escape and one day\" flying free, \"and like Dreams, could have fit right in on Coldplay's full-bore pop album Mylo Xyloto in 2011. But where the album truly takes off is on Beyoncé collaboration Hymn for the Weekend: a blistering duet on which she and <mark>Martin</mark> trade verses about feeling drunk and high on love over producer Stargate's lurching, vibrant beat. More than any Dreams cut, Hymn is poised to be a Top 40 staple next year and deservedly so. While the album's jaunty mood signals a new beginning for <mark>Martin</mark>, Paltrow's presence is felt in more ways than one. For starters, the actress/singer's faint vocals are heard on piano ballad Everglow, in which he sings that\" you're with me wherever I go. \"<mark>Martin</mark> is more blunt about their 10-year relationship on the Tove Lo-assisted Fun, saying that although it's over and done,\" don't say it was all a waste / didn't we have fun? \"Other lyrics will surely be picked over as fans scour for clues into the couple's demise (most intriguingly:\" I know it's over before she says / Now someone else has taken your place \"). Coldplay's <mark>Chris Martin</mark> performs during the American Music Awards late last month. (Photo: Getty Images) If Paltrow's cameo is slightly awkward, it at least shows that <mark>Martin</mark> has made peace as he moves into the next stage of his life. It's a point he drives home in the album's more overwrought second half through songs such as Amazing Day, Up & Up and Army of One, which brim with as many positive platitudes as their titles suggest (although Army's hip-hop leanings make it Dreams' most curiously enjoyable oddity). Perhaps the most telling song is not <mark>Martin</mark>'s at all, but a piano interlude called Kaleidoscope, which excerpts poem The Guest House by the philosopher Rumi. Suggesting that one must welcome joy, depression and meanness, and\" be grateful for whoever comes, \"the two-minute inclusion encapsulates <mark>Martin</mark>'s current zen, and sets the stage for his future creative endeavors, whether he's joined by his band or not. Download: Hymn for the Weekend, Fun, Army of One CONNECT TWEET LINKEDIN EMAILMORE Read or Share this story: http: //usat.ly/1Qi629H", "articleID": "2015120319_00185772_W", "names": {"Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"]}}, {"date": "2015-12-04", "url": "http://counton2.com/ap/arizona-couple-convicted-of-imprisoning-daughters/", "content": "Arizona couple convicted of imprisoning daughters ASTRID GALVAN, The Associated Press Published: December 4, 2015, 2:14 pm Updated: December 4, 2015, 2:24 pm Click to share on Twitter (Opens in new window) Click to share on Google + (Opens in new window) Share on Facebook (Opens in new window) Click to share on Pinterest (Opens in new window) TUCSON, Ariz. (AP)--A jury convicted an Arizona couple Friday of kidnapping and child abuse charges for imprisoning their three daughters, monitoring them through video feeds and forcing them to urinate and defecate in their closets. The jury found Fernando and Sophia Richter guilty on three counts each of kidnapping and child abuse. Fernando Richter was also convicted of two counts of aggravated assault with a deadly weapon. The girls testified to having been physically abused, taken out of school and held captive for several months before the two younger girls escaped through a window in November 2013. Police rescued the oldest girl, who was held in a different room. They were 12, 13 and 17 at the time. The Associated Press does not generally name minors who authorities say are victims of crimes. All three testified in the trial that began over two weeks ago. They described months of abuse and bizarre rules imposed by their parents. The girls were forced to wake up at 2 a.m. every day to march in place, sometimes for so long that their legs ached, they said. They said they were fed rancid food and forced to overeat or face punishment. The youngest said Fernando Richter made her recite the dictionary at all hours and beat her if she mispronounced words. She described being moved around from bedroom to hallway to closet before her parents let her live in a room with her older sister. The oldest said she was not allowed to leave her bed, had to listen to a loud radio at all hours and hadn't seen her sisters in months when she was rescued. Authorities say the abuse began in a house in Catalina in nearby Pinal County, where the Richters face separate criminal charges. They pleaded not guilty in both cases. The defense said prosecutors didn't have enough evidence and that the girls were free to roam about the house. Sophia Richter testified in court on Tuesday that the girls were free to leave their rooms and were fed properly. She denied all of the accusations against her, including that she force fed the girls a rancid pasta-type meal. \"They had fruit daily, they had snacks daily. They were never without. I always had fruit for them,\" she said. The Richters moved to a Tucson house about four months before the girls escaped. Police officers who testified described a house that smelled so bad of urine and feces they had to open all the windows to conduct their investigation. The girls said they were rarely allowed bathroom breaks, forcing them to urinate and defecate in their bedroom closets. The oldest sister described the plastic water jugs they were given as moldy and the meals they were fed twice a day as rancid. \"It was nasty. Gagging nasty,\" she testified. \"We would have to lick our plates if we wanted them clean and if not my mom would just throw more food on it if I didn't lick it .\" Share this: Share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Google + (Opens in new window) Click to share on Reddit (Opens in new window) Click to email this to a friend (Opens in new window) Click to print (Opens in new window) More Click to share on Pinterest (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Tumblr (Opens in new window) Click to share on Pocket (Opens in new window) Click to send this to your Kindle device (Opens in new window) Advertisement More Headlines Previous post in this category High court takes up Puerto Rico debt restructuring case News Next post in this category Germany Oks military mission against Islamic State group News blog comments powered by Disqus Advertisement Trending on WCBD.com More Headlines from counton2. com San Bernardino shooting: Attacker pledged allegiance to ISIS, officials say San Bernardino Shooter was \"bad person,' not radical: brother-in-law Vice President Biden honors Mayor <mark>Joe Riley</mark>;\" Led with the conscience of a saint & heart of a lion \"I-Team: Lawmaker files 5 bills on gun control Defense, state at odds over trial date in ex-officer's trial Garth Brooks World Tour adds 3 more shows due to huge demand Advertisement Advertisement Advertisement", "articleID": "2015120419_00104637_W", "names": {"Joe Riley": ["Q22937276", "Q30122025", "Q4205834"]}}, {"date": "2015-12-04", "url": "http://newsday.com/long-island/garner-protestors-plan-acts-despite-23-arrests-1.11193854", "content": "Protest organizers vowed to step up citywide demonstrations to call for the \"immediate firing\" of NYPD police officer Daniel Pantaleo, who is accused of using an apparent chokehold that killed Eric Garner last year but was not indicted by a Staten Island grand jury. Twenty-three protesters were arrested Thursday night at Gracie Mansion after they blocked East End Avenue traffic for about 30 minutes. Police placed plastic handcuffs on them and moved them into police vans. The demonstrators were issued summons for disorderly conduct and refusing to disperse, according to police. They are scheduled to appear in summons court in January, said Susan Howard, executive director of the National Lawyer's Guild NYC, whose attorneys represent the demonstrators. advertisement | advertise on newsday <mark>Carmen Perez</mark>, executive director of the social media activist group Gathering for Justice, said \"a series of new protests\" are being organized since Police Commissioner William Bratton announced this week that the department will hold off on its internal review until a federal investigation is complete. Story Garner protesters arrested at Gracie Mansion Story Bratton: NYPD to decide on chokehold charges More coverage Eric Garner apparent chokehold case Federal prosecutors are investigating possible civil rights violations against Pantaleo, who has been placed on modified duty since Garner's death in July 2014. Garner died when police tried to arrest him for selling loose untaxed cigarettes in Staten Island. The arrest was caught on cellphone video and ignited a wave of police brutality protests across the city and nation last winter. \"We will hit the streets in the cold and snow like last year until we see justice,\" said <mark>Perez</mark>, whose group will join Garner's daughter Erica Garner in Staten Island to mark the one year anniversary when a Staten Island grand jury did not indict Pantaleo for the death of her father, 42. \"We will be showing up tonight (Friday night) at the 120th Precinct where Officer Pantaleo worked at the time when Eric Garner was killed,\" said <mark>Perez</mark>. \"A lot of organizations are coming together. People are feeling the energy .\" ", "articleID": "2015120422_00026997_W", "names": {"Carmen Perez": ["Q30106075", "Q48700552", "Q5043536"]}}, {"date": "2015-12-04", "url": "http://www.abqjournal.com/686236/news/ex-officers-charged-in-nm-shooting-death-ask-to-move-trial.html", "content": "............................................................................................................ALBUQUERQUE, N.M. (AP)--The trial for two former Albuquerque police officers charged with second-degree murder in the shooting death of a homeless man should be moved to another city because of the high volume of media attention the case has received, defense attorneys said Friday in court documents. Attorneys for Keith Sandy and Dominique Perez want the trial, set for August 2016, to be moved from Bernalillo County, which includes Albuquerque, to Las Cruces in Dona Ana County, according to the court filing. Las Cruces is about 200 miles south of Albuquerque. Sandy and Perez shot <mark>James Boyd</mark> after an hours-long standoff in March 2014. In police video footage, the 38-year-old homeless man has two knives in hand but appears to be turning away from officers when gunfire erupts and he is shot. The footage released amid a U.S. Justice Department investigation into a pattern of excessive force within the Albuquerque Police Department sparked extensive local protests, including one in which demonstrators shut down City Hall during a council meeting. \"Not only will nearly every single potential juror know about the case, but also, each one will already have a fixed opinion--whether it is pro- or anti-Albuquerque police,\" the motion states. \"The community is divided .\" Both Sandy and Perez have pleaded not guilty to second-degree murder and assault charges in the shooting death of <mark>Boyd</mark>, who authorities say suffered from mental illness. <mark>Boyd</mark> had been camping illegally in the foothills on the east side of New Mexico's largest city. The incident preceded a broader national debate about police shootings and officers' use of force. \"At the inception of the shooting, there was uproar from local demonstration groups, demanding that Officer Perez and Detective Sandy be charged criminally,\" the motion states. The motion cites more than 250 media reports among several outlets in the Albuquerque area compared to a handful in Las Cruces. Defense attorneys argue the news coverage has \"harshly criticized\" Perez and Sandy, with headlines that read \"Charges keep police accountable...\"and\" No wonder Albuquerque Police Dept. has difficulty in finding recruits. \"In August, a judge ruled there was probable cause for the officers' case to go to trial after a two-week preliminary hearing in which Special Prosecutor Randi McGinn argued <mark>Boyd</mark> couldn't have posed a threat to officers when he was killed because he was shot in the side and back. Defense attorneys contend <mark>Boyd</mark> presented a danger and had threatened officers, leaving them no choice but to shoot as their training had taught them. Since the shooting, Sandy was allowed to retire from the force and Perez was released in October under a policy indicating the department may take disciplinary action upon indictment of an officer or a formal criminal charge. Perez and Sandy could face up to 15 years in prison if convicted of second-degree murder. A voluntary manslaughter conviction carries a term of up to three years. They remain free on their own recognizance as they await trial.", "articleID": "2015120423_00103798_W", "names": {"James Boyd": ["Q16588788", "Q43918632", "Q56421215", "Q6130075"]}}, {"date": "2015-12-07", "url": "http://sbsun.com/general-news/20151206/inland-empire-leaders-react-to-obamas-san-bernardino-shooting-address", "content": "Inland Empire leaders react to Obama's San Bernardino shooting address and Ryan Hagen, The Sun Posted: #Comments SAN BERNARDINO>> Less than a mile from where 14 people were murdered four days earlier, Inland Empire leaders listened intently in Rep. Pete Aguilar's Congressional office as President Barack Obama gave the third Oval Office address of his presidency. The main points of Obama's speech--that this was an act of terrorism, that the United States will overcome ISIS, that more gun control was necessary and that Muslims should not be scapegoated--hit the right note, said the group of 20 people invited by Aguilar's staff. Aguilar, D-San Bernardino, himself said in an interview afterward that he wished the president had gone into more details and was hesitant to send \"too many\" American troops to fight the extremist group, but largely applauded the plan. Obama called on Congress to increase restrictions on who can legally buy a gun--again singling out those on the \"no fly list,\" who aren't currently restricted from firearms access--and Aguilar said those steps should get broad support. \"My friends who own guns also think background checks are important when we're talking about our safety,\" Aguilar said. \"Even before this tragedy, San Bernardino has had a problem with gun violence, and this is an important step to prevent that .\" Aguilar was joined by other community and elected leaders, including Mark Takano, D-Riverside, who said he wholeheartedly agreed with what Obama said. \"I was choked up, especially when he spoke about living with our friends and neighbors,\" said Takano, whose district includes the homes of two victims of the attack and a mosque Syed Farook attended. \"I think the American people respond to a leader who challenges us to hold fast to our ideals .\" Takano's family had been sent to internment camps during World War II, and it was important to avoid targeting innocent Muslims now, Takano said. Some sitting and some standing, taking notes or nodding and murmuring, the group was mostly restrained and somber as Obama spoke. Vernon Lambert, pastor at Living by Faith in Redlands, reacted more passionately, agreeing aloud from time to time. \"This is an important message and one I hope people, including my congregation, listen to,\" Lambert said afterward. \"Yes, we need more gun control, and yes, we need to respect all of our rights .\" San Bernardino City Councilwoman Virginia Marquez was the only city official at Aguilar's office, and she said the attack had demonstrated the city's resiliency. Advertisement \"As soon as it happened, I went into gear, and the whole community responded flawlessly,\" Marquez said, while declining to comment on the speech. \"This is a challenge, but San Bernardino is strong and it's getting stronger .\" Other local leaders demurred when offered the chance to comment, including San Bernardino Mayor Carey Davis, Assemblyman Marc Steinorth, R-Rancho Cucamonga, and San Bernardino County Sheriff <mark>John McMahon</mark>. State senator <mark>Mike Morrell</mark>, R-Rancho Cucamonga, could not be reached for comment. Rep. Adam Schiff, D-Burbank, applauded Obama's call to make it illegal for those on the government's \"no fly\" list to own firearms and his desire to curb access to \"assault weapons .\" \"Ultimately, ISIS must be defeated on the ideological battlefield as well as militarily. And in this facet of the struggle--as the president pointed out--the Muslim community at home and abroad must be our chief ally,\" Schiff, the ranking member of the House Permanent Select Committee on Intelligence, is quoted as saying in a press release issued after the president's speech. \"We will continue to work closely with the Islamic community in the United States to identify those at risk of radicalization and must do far more with the community abroad to counter the pernicious bastardization of the faith that urges the slaughter of innocents .\" He also said he agrees with the president's intention to take the fight to ISIS and al-Qaida, saying he and his staff have been working on new legislation that would authorize the presidential use of force against both groups. \"We are confronting a pernicious enemy that we will fight and defeat,\" Schiff's press release concludes. \"And as we do, and even as we are vigilant, we will hold true to our principles and values by celebrating our freedoms, treating others with respect, and giving refuge to those in need .\" About the Authors Beau Yarbrough covers education and politics for The Sun and the Inland Valley Daily Bulletin. Reach the author at Beau.Yarbrough @ langnews.com or follow Beau on Twitter: @ lby3.", "articleID": "2015120705_00052950_W", "names": {"John Mcmahon": ["Q27915237", "Q27915238", "Q6248117", "Q6248119", "Q6248121"], "Mike Morrell": ["Q55375276", "Q6848113"]}}, {"date": "2015-12-07", "url": "http://yallpolitics.com/index.php/yp/post/gov._phil_bryant_appoints_justice_david_chandler_to_dfc_director_-_creates_/", "content": "Gov. Phil Bryant appoints Justice <mark>David Chandler</mark> to DFC director - creates MSSC vacancy <mark>Chandler</mark> named Division of Family and Children's Services Executive Director Governor Phil Bryant announced today that he has named Mississippi Supreme Court Justice <mark>David Chandler</mark> the Executive Director of The Division of Family and Children's Services. The appointment is effective immediately. <mark>Chandler</mark> will vacate his seat on the court. In his post, <mark>Chandler</mark> will oversee the state's child welfare and foster care systems. This is the first time the DFCS Executive Director will be a cabinet-level position that reports directly to the Governor. This change is the result of a recent court order in long-running federal litigation. \"I deeply appreciate the trust and confidence Governor Bryant has shown in me by appointing me to this important position,\" <mark>Chandler</mark> said. \"It is a distinct honor, and I gladly accept the appointment. It is also a tremendous responsibility. Our Mississippi children who are placed in the care of the state are some of our most precious citizens. They find themselves without a family through no fault of their own, and we must do everything in our power to keep them safe and see that they are afforded proper food, shelter and clothing. We must pursue every avenue available to us to help them find the family that is meant for them. I promise you that this will be my goal and I will work as hard as I know how to accomplish it. I know the Governor is committed to the same .\" <mark>Chandler</mark> was born in Kosciusko and moved with his family to Weir just before his first year of school. He graduated from Weir High School and then attended Mississippi State University, where he earned his bachelor's, master's and doctoral degrees in education. <mark>Chandler</mark> earned his Juris Doctorate from the University of Mississippi School of Law and his Master of Laws in the Judicial Process from the University of Virginia School of Law. \"I am extremely pleased that Justice <mark>Chandler</mark> is taking on this critical role,\" Governor Bryant said. \"His experience and ability will be invaluable in making sure our foster care system operates safely and efficiently .\" <mark>Chandler</mark> spent the first 20 years of his professional career in education. For approximately 10 years, he served as a teacher, counselor, school psychometrist and administrator with the Choctaw County public schools. <mark>Chandler</mark> then moved to the college level, where he served as a research and curriculum specialist at Mississippi State University. In this capacity, he directed the development of curriculum material for secondary and post-secondary work force training programs. His work was designed to provide a more skilled workforce in order to attract business and industry to Mississippi. Following law school, <mark>Chandler</mark> practiced law in Tupelo. In January 2000, his law firm opened a branch office in Choctaw County, where he served as the attorney for the Board of Supervisors, a position he held until beginning his service on the Mississippi Court of Appeals in January 2001. He also served as municipal judge for his hometown of Weir from 1999 until beginning work on the appellate court. <mark>Chandler</mark> was elected to the Mississippi Court of Appeals in November 2000, and re-elected, without opposition, in 2006. After serving as a judge on the Court of Appeals for eight years, he was elected to the Mississippi Supreme Court. He commenced his duties as a Supreme Court justice on January 1, 2009. <mark>Chandler</mark> has served on numerous committees, including chairman of the Court of Appeals Rules Committee and co-chairman of the Professionalism Committee of the Mississippi Bar, as well as serving as a member of the Supreme Court Committee on Administrative and Related Matters. He presently serves as chair of the Mississippi Continuing Judicial Education Committee. He serves as adjunct professor at Mississippi College School of Law, where he teaches judicial administration, and he is a member of the <mark>Charles Clark</mark> Inns of Court. He was named the 2010 Alumnus of the Year by the Mississippi State University College of Education. Throughout his career, <mark>Chandler</mark> has authored professional articles in the field of education as well as in the legal field. In July 2007, <mark>Chandler</mark> had published an article in the professional journal for Mississippi Bar members. The article addressed methods of improving professionalism among lawyers. His thesis for his LLM degree consisted of a comprehensive analysis of Mississippi statutory law pertaining to acts of violence committed on school property. Since becoming a member of the appellate courts of Mississippi, <mark>Chandler</mark> has authored well over 600 opinions. <mark>Chandler</mark> is a member of the Tupelo Bar Association, the Mississippi Bar and the American Bar Association. He and his wife, Glenda, reside in Louisville, where they are members of First United Methodist Church. <mark>Chandler</mark> will start serving on the church's board of directors in January. He is the proud father of two sons. Gov. Phil Bryant Press Release 12/7/15", "articleID": "2015120715_00077102_W", "names": {"Charles Clark": ["Q2958739", "Q29613595", "Q5076287"], "David Chandler": ["Q22574995", "Q51686959", "Q5232289", "Q56855054"]}}]