[{"articleID": "2017092522_00259784_W", "names": {"Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"], "Donald Trump": ["Q22686", "Q27947481"], "Michael Bennett": ["Q1176654", "Q18022004", "Q21458629", "Q21458633", "Q27922506", "Q5570630", "Q6828576", "Q6828577", "Q7330923"], "Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}, "date": "2017-09-25", "url": "http://ijr.com/the-declaration/2017/09/982981-last-season-qb-russell-wilson-gave-bold-reason-stands-flag-sunday-locker-room/", "content": "Share on Facebook Share on Twitter Share via email Discuss The Declaration Last Season, QB <mark>Russell Wilson</mark> Gave Bold Reason Why He Stands for Flag. Sunday, He Was in Locker Room By Victoria Taft 34 minutes ago Share on Facebook Discuss Last football season, Seattle Seahawks quarterback <mark>Russell Wilson</mark> explained why he wouldn't take a knee while the national anthem played. <mark>Wilson</mark> always stood with his hand over his heart: Grateful to live in a place where freedom is a right. #Proud 2BeAnAmerican A post shared by <mark>Russell Wilson</mark> (@ dangerusswilson) on Jul 4, 2016 at 2:08 pm PDT In 2016, after former San Francisco 49ers quarterback Colin Kaepernick began kneeling during the anthem and presentation of the colors to protest police shootings, <mark>Wilson</mark> was asked why he stood. IJR reported his comments at the time: \"For me, I love the flag. I love the national anthem because it's an emotional time for me because I'm so grateful I get to play on the football field. And every time I get to put my hand on my heart, it's truly an honor--you know, the military, for me I think about my family members who have served, and friends--I train down in San Diego all the time, so I'm around the Navy and I see those guys around. [...] And all they do for our country and the people in Afghanistan and all these people fighting. So that's why I stand and put my hand on my heart.\" So for <mark>Wilson</mark> at that time, the issue was respect for the country and the sacrifices of those who fight for it. But this time, that message of unity was apparently lost in the weeds. <mark>Wilson</mark> acknowledged that the entire team made a \"quick\" decision to stay in the locker room in solidarity \"against injustice\" while the \"Star-Spangled Banner\" was sung by \"The Voice\" contestant Meghan Linsey, who herself knelt on the field. But what it really smacked of was a political statement against the president after <mark>Donald Trump</mark> said at a rally in Alabama on Friday: \"We're proud of our country. We respect our flag. Wouldn't you love to see one of these NFL owners when somebody disrespects our flag to say\" get that son of a b *** h right off the field right now. Out. He's fired. \"And then the president doubled down on his sentiments with a couple of tweets: If a player wants the privilege of making millions of dollars in the NFL, or other leagues, he or she should not be allowed to disrespect ...--Donald J. Trump (@ realDonaldTrump) September 23, 2017...our Great American Flag (or Country) and should stand for the National Anthem. If not, YOU'RE FIRED. Find something else to do!--Donald J. Trump (@ realDonaldTrump) September 23, 2017 <mark>Wilson</mark> said he saw the president's comments while flying on the Seahawks jet to Tennessee Friday and grimaced. Screenshot / Seattle Seahawks The president's comments were also panned by several NBA players who weighed in. And by Sunday, the Seahawks were planning to skip the national anthem as a show of\" unity. \"At his news conference after the Seahawks' loss to the Tennessee Titans on Sunday, <mark>Wilson</mark> acknowledged that the decision to stay in the locker room as a protest was\" quickly decided \"because he believed that the issue of\" injustice \"is taken too\" lightly \":\" I know that the guys in the National Football League are trying to do right and trying to make a change. We're a team that really want to make a change and it was pretty sad to see and we were on the plane and I saw that and you think about people that have gone through stuff and the people that have from our team...<mark>Michael Bennett</mark>... to people that have gone through all kinds of stuff through the country. It's a serious issue and can't be taken lightly. I feel that honestly it's being taken lightly. And I think that we have to do something about it and be able to communicate and show love and make a difference in our world. And I think it starts from the top and in our communities, too. \"<mark>Bennett</mark> was handcuffed by police when they say he ran away when police ordered patrons to get down in response to an active shooter situation at a Las Vegas club. The incident is under review. He says he was mistreated by police because he's black. Equality. pic.twitter.com/NQ4pJt94AZ--<mark>Michael Bennett</mark> (@ mosesbread72) September 6, 2017 <mark>Bennett</mark> hired a civil rights attorney to bring action against Las Vegas police. Because of that incident and others to which <mark>Wilson</mark> alluded, the Seahawks quarterback said that the team wanted to do something together to protest. It was decided that they'd stay in the locker room to protest:\" We wanted to do something as a team. We're such a tight knit group and our thought was we want to--you know, last year we did something. We locked arms. And that was very good and stuff and then we thought \"how can we do something as a whole team collectively to show that, you know, the injustice in America, you know for people needs to be fixed.\" There have been many high-profile police shootings in years past protested by groups such as Black Lives Matter and highlighted by Colin Kaepernick. Police have made mistakes. But in the overwhelming number of cases, police are found to have acted within the boundaries of their training in such shootings. Local, state and federal investigations, for example, showed that the <mark>Michael Brown</mark> shooting was justified because he attacked the police officer. The claims that <mark>Brown</mark> pleaded with the officer that he had his \"hands up, don't shoot\" were also found to be untrue. The Washington Post database shows there have been 730 police shootings so far this year. Most of the people shot were white and most were armed with a weapon. Share on Facebook Share on Twitter Share via email View Comments (0 comments) Trending 24 Steelers QB Roethlisberger Could No Longer Stay Silent About Team Staying in Tunnel During Anthem 2 hours ago <mark>Sarah Sanders</mark> Was Asked if National Anthem Protest Was \"Appropriate .' Her Response Silences the Room 3 hours ago 112k views 64 The NFL Ratings Are in After Day of Mass Anthem Protests...5 hours ago 141.3 k views 47 The Patriots Kneeled for the Anthem, But It's What the Fans Did That's Turning Heads 19 hours ago Mattis Was Asked About the National Anthem Protest--His Next 4 Words Define American Patriotism 44 minutes ago You might like 1.2 m views 181 NASCAR Just Joined in on the National Anthem Drama, But They're Taking a Totally Different Approach a day ago 712.3 k views 78 Only Steeler to Show Up for National Anthem Issued a Bold Message to Kaepernick and Protesters a day ago 169.4 k views 90 While Everyone Wonders Who Will #TakeAKnee on Sunday, Some Remember One Hero Who Never Would 2 days ago"}, {"articleID": "2019100717_00408405_W", "names": {"Mr. Mike": ["Q16214090", "Q1951427"]}, "date": "2019-10-07", "url": "http://www.keyt.com/lifestyle/south-african-student-fights-animal-poaching-using-wildlife-photos/1129828096", "content": "South African student fights animal poaching using wildlife photos Photo of rhino dehorning wins awards By: Posted: Oct 07, 2019 10:45 AM PDT Updated: Oct 07, 2019 10:45 AM PDT Student Neville Kgaugelo Ngomane has won awards for his startling images of a rhino having its horn removed and he's now using photography to highlight the dangers to wildlife caused by poaching. Neville Kgaugelo Ngomane via CNN Student Neville Kgaugelo Ngomane has won awards for his startling images of a rhino having its horn removed and he's now using photography to highlight the dangers to wildlife caused by poaching. Related content Rhinoceros DNA database helps nail poachers, traffickers (CNN) - It's a shocking image: A huge rhinoceros pinned to the ground while a grimacing man shreds a power saw through its horn, white shards shooting off in a blur of high speed. The photograph, taken by 20-year-old student Neville Kgaugelo Ngomane, shows the radical lengths that are now being taken to protect vulnerable rhinos from the poachers who hunt them down for their horns. Though it seems cruel, this is now a standard practice in some parts of Africa to keep rhinos alive. Robbed of the horns that fetch high prices in illegal trade, the rhinos will be left alone. The dramatic photo won Ngomane the Young Environmental Photographer of the Year Award in the International Chartered Institute of Water and Environmental Management (CIWEM) photography competition in September. Out of more than 4,000 entries for the competition, Ngomane's titled \"Desperate Measures\" was picked by judges alongside thirteen others as winners for the competition. Ngomane, born in Mpumalanga, in eastern South Africa, said the rhino dehorning was \"not easy to watch,\" but he hopes the graphic image will contribute to the preservation of these powerful beasts. \"I wanted to use the photo to show people that they should stop poaching, to be aware of its dangers,\" he says. \"And I became so excited when I heard that I had won. To be picked among more than 4000 entries, it is a big deal.\" Poaching is a serious business in South Africa. In 2018, there were a total of 1,873 poaching incidents in different parks across the country, according to a report from South Africa's Department of Environment Affairs. As a child, Ngomane spent a lot of his time watching documentaries about wildlife conservation. He learned to use a camera in 2014 by watching tutorials online but says he could not capture wildlife because he did not have money to pay to get into the national parks where the animals roam freely. \"When I was in the ninth grade, one of my teachers brought a camera to school and he used to let me take it home for the weekend,\" he said. \"But it was hard for me to photograph wildlife because I had no money to pay to go to the reserves. So, I just settled for taking pictures of events,\" he added. Things changed for Ngomane in 2017 when he stumbled on Wild Shots Outreach, a not-for-profit organization with a focus on teaching photography. Based in Hoedspruit, north of South Africa, Wild Shots Outreach trains students and unemployed youths from disadvantaged communities to photograph wildlife and the environment. \"I saw some of their works on Facebook so I started sending messages like every three weeks,\" Ngomane said. \"I wanted the founder to come to my school to teach us how to photograph wildlife.\" <mark>Mike</mark> Kendrick, director of Wild Shots Outreach met with a school group led by Ngomane in 2018 and taught them to shoot videos and stilt photos for free. \"Sometimes I find young people within the school groups who have a real passion and talent for photography, and I am able to give them a second-hand camera,\" Kendrick told CNN. \"I was able to give him (Ngomane) a camera that works well, which is the one he used to take that photo of the rhino dehorning,\" he added. In partnership with Canon South Africa, Kendrick was also able to get experts from Canon to give Ngomane's group advanced training on how to take complex shots. Ngomane says meeting Kendrick allowed him to visit the parks and wildlife reserves he missed out on as a child. According to him, he has now taken hundreds of animal photos. \"At first I didn't want to share my photos but <mark>Mr. Mike</mark> encouraged me to. That's how I registered for the competition and won too,\" he said. Ngomane has also learned how to edit videos. He plans to shoot documentaries on the need for wildlife conservation. \"I want to get outside, be in the busy anywhere in Africa. I want to keep on taking pictures and making videos that show environmental awareness,\" he said. The-CNN-Wire"}, {"articleID": "2012082609_00028742_W", "names": {"Michael Adams": ["Q16030732", "Q16149538", "Q17411033", "Q1926746", "Q1926749", "Q2342516", "Q2779366", "Q299636", "Q57869604", "Q58680826", "Q6828116", "Q6828119", "Q6828120"]}, "date": "2012-08-26", "url": "http://independentmail.com/news/2012/aug/26/college-football-preview-how-safe-is-mark-richt/?partner=RSS", "content": "once the final horn sounded on south carolina's wild 45-42 victory over georgia last september in athens, mark richt's fate with the bulldogs seemed sealed. he entered the season on the hot seat after uga stumbled to a 6-7 record in 2010, and an 0-2 start in 2011 was a harbinger of his doom. about the only thing that could save him would be some unlikely turnaround that allowed the dawgs to win the sec east. ten victories in a row, coupled with a pair of league losses for usc, helped avert a doomsday scenario for the coach. he ended his 11th year between the hedges with a 10-4 mark, east crown and trip to the sec championship game. it was a job-saving performance for sure, and even led to richt getting a contract extension through 2016. but richt can't get too comfortable just yet. you've heard of a trap game? this could be a trap season for the top dog. unlike 2011, when fans and pundits alike cast a wary eye toward uga's gridiron prospects, the expectations are clear this fall. simply put, if the no. 6 bulldogs don't win the sec east, the campaign will be a disappointment. and if georgia loses three or four games, just how safe will richt really be? there was a time when contracts and contract extensions could be taken at face value but that time has passed. just because a coach gets a new deal doesn't mean the deal is done. after leading alabama to 10 wins and an sec championship in 1999, mike dubose - fresh from being named sec coach of the year - was given a two-year contract extension that december. ten months later he was invited to resign after the tide won only three games. \"what have you done for me lately\" is a tired old expression but it very much applies to coaches who ply their trade in modern college football. i'm not sure if it's telling or not but when the financial terms of richt's contract were released earlier this summer, his salary was largely unchanged. it still falls in the $2.8 million per year range. on the other hand it was laden with incentives. if, for example, richt can guide the dawgs to both an sec and national championship, his combined bonuses will hit seven figures. does richt have to win the sec championship game this year to keep his job? of course not. but his team better be a contender from wire to wire. some are already conceding a loss to usc in columbia, but even so those same people figure the gamecocks will lose two sec games (they have to play at lsu and face arkansas). another loss to usc - which would make three in a row for georgia - would sting, but not necessarily derail the red and black from a trip to atlanta in december. and a spot in the league's title tilt is almost a must for richt if he wants to stay in the good graces of bulldog nation. whether you blame him or not for the rash of suspensions and arrests of bulldog players, they've occurred under his watch and cast the school in a poor light. that can't make athletics director greg mcgarity or school president <mark>michael adams</mark> happy. and while the sec has claimed the last six bcs national championships, six seasons have passed since georgia last topped the league. there are grand opportunities ahead of both richt and his football team this fall. college football preview: bulldogs ready to put it all together anderson's chili cook-off canceled this year to make way for new event proposed $30 million honea path nursing home denied state approval anderson's chili cook-off canceled this year to make way for new event anderson mayor: city reviewing officers' concerns as police chief placed on leave gov. haley in anderson for opening of electrolux research center end of summer 10/19/11 6:58 p.m. end of summer 10/19/11 6:58 p.m. end of summer 10/19/11 6:57 p.m. check out the latest on your favorite high school teams at gofridayfootball.com"}, {"articleID": "2013070502_00051507_W", "names": {"Michael Gordon": ["Q2779402", "Q3308220", "Q47542706", "Q651955", "Q6830684", "Q6831376"]}, "date": "2013-07-04", "url": "http://au.news.yahoo.com/a/-/sport/17875671/gallen-woes-could-help-sharks-flanagan/", "content": "Gallen woes could help Sharks: Flanagan Steve Jancetic, AAP July 5, 2013, 5:04 am Cronulla coach Shane Flanagan believes Paul Gallen's injury-plagued season could translate into the secret ingredient that catapults the Sharks into genuine NRL premiership contenders. For so long the workhorse which the Sharks have lent on to carry them into a finals berth, Cronulla have this year been forced to get by largely without their inspirational skipper due to a litany of injuries and representative commitments. Currently nursing a torn ligament in his foot, the best case scenario is for Gallen to return to the Sharks line-up for the round 19 encounter against Sydney Roosters, three days after State of Origin III. Flanagan just wants the Sharks - sixth heading into Friday night's home game against Wests Tigers - to keep their head above water until their captain returns, believing a fresh Gallen could make all the difference come September. \"The way I see it, after this injury and he gets through Origin III, Gal will be fresh mentally because he hasn't played a lot of football for us,\" Flanagan told AAP. \"He's only played eight out of 16 games, he's only played half a season for us.\" It's going to be a really good opportunity for Gal to be really fresh and lead us into the semis. \"Never was this more evident than last year, when both Gallen and playmaker Todd Carney - who had also endured an Origin campaign - limped into the finals. Gallen was little more than a punching bag for fired-up Canberra second-rower Josh Papalli - the Sharks leader with the will but not the way to return serve as Cronulla meekly bowed out of the finals. It's why Flanagan went in search of some more class to put alongside Gallen and Carney - with the likes of Penrith duo Luke Lewis and <mark>Michael Gordon</mark> recruited to boost a star-deprived roster. And it is also why Flanagan is happy to take some pain in June and July by having his stars engaged with Origin if it translates to success in the big end of season games.\" We're heading in the right direction in the number of rep players we have, \"Flanagan said,\" The more rep players you have, unfortunately you've got to deal with it during that rep period."}, {"articleID": "2020011708_00123785_W", "names": {"Liam Williams": ["Q19578254", "Q23306997", "Q56421819", "Q6539846"], "Michael Rhodes": ["Q16735162", "Q42225233", "Q55085840", "Q6833829"]}, "date": "2020-01-17", "url": "http://nwemail.co.uk/sport/national/18167695.saracens-facing-premiership-relegation-break-salary-cap---reports/", "content": "Sport National Sport Saracens facing Premiership relegation if they break salary cap again--reports By Press Association 2019 Saracens are facing relegation from the Premiership, according to a report 0 comment Saracens are set to be relegated from the Gallagher Premiership unless they can prove they will not break the salary cap again this season, it was reported on Friday. According to reports in a number of national newspapers, the defending champions were issued the ultimatum following a summit of Premiership Rugby Limited chief executives in London on Tuesday. Saracens were docked 35 points and dealt a £ 5.36 million fine last November after they were found to have broken the £ 7million salary cap for the past three seasons. Saracens could be relegated from the Premiership, according to reports (Tess Derry/PA) The same report indicates that the Hertfordshire club are also struggling to keep within the salary cap this season. The club, however, are working to find a solution. Ed Griffiths has been re-appointed chief executive to oversee the necessary changes and he will be assisted by Neil Golding, who has taken over as non-executive chairman. Golding is described as a \"highly experienced and respected lawyer\" and specialises in disputes, litigation and arbitration at Freshfields Bruckhaus Deringer. \"I am joining the club at a time of significant change,\" said Golding earlier this month. <mark>Liam Williams</mark> is one player who is set to leave Saracens as they bid to cut their wage bill (David Davies/PA) \"We, as a board, are strongly committed to introducing new robust processes and working together with other Premiership Rugby stakeholders in the best interests of Saracens and English rugby.\" Griffiths has confirmed that Saracens must reduce their wage bill and, alongside director of rugby Mark McCall, is identifying players to be trimmed from the squad. Wales full-back <mark>Liam Williams</mark>' departure for Scarlets that is due to happen at the end of the season is set to be brought forward, while Richard Wigglesworth, George Kruis, Juan Figallo and <mark>Michael Rhodes</mark> face uncertain futures. Saracens host Racing 92 in the Champions Cup at the Allianz Arena on Sunday. 0 comment"}, {"articleID": "2013121813_00031760_W", "names": {"Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"]}, "date": "2013-12-18", "url": "http://www.bendigoadvertiser.com.au/story/1981023/jacinta-and-yorick-welcome-a-son/?src=rss", "content": "Jacinta Allan with daughter Peggy at the opening of Lightning Reef Primary School early this year. MEMBER for Bendigo East Jacinta Allan has given birth to a son. Ms Allan and husband Yorick Piper welcomed Cormac Kevin into the world on December 17, weighing a healthy 4.2 kg. Cormac is a little brother for 21-month-old Peggy Marie. \"Yorick, Peggy and I are thrilled with the safe arrival of Cormac,\" Ms Allan said. \"He is a healthy 4.2 kg and is a happy, content and delightful boy.\" Thanks to everyone for their thoughts and well wishes. \"Jacinta has represented Bendigo East for the ALP since 1999. <mark>Paul Walker</mark>, Cory Monteith and royal baby top Google searches in 2013"}, {"articleID": "2014051423_00051141_W", "names": {"David Lee": ["Q138121", "Q16194155", "Q18233288", "Q19831925", "Q19948577", "Q201853", "Q21095541", "Q22077814", "Q22670605", "Q2812455", "Q28417343", "Q463212", "Q5229168", "Q5236417", "Q5236418", "Q5236419", "Q5236420", "Q5236421", "Q5236424", "Q5236425", "Q5236426", "Q5236427", "Q5236428", "Q5236431", "Q5236432", "Q5236433", "Q5236434", "Q5236436", "Q5236437", "Q5236438", "Q57056433", "Q57439723", "Q8995743"]}, "date": "2014-05-14", "url": "http://techcrunch.com/2014/05/14/sift-science-raises-18m/?ncid=rss", "content": "Rebtel Spins Out Sinch, With $12M In Funding, To Offer Communications Tools To Developers Flipps, Metrekare, Tjobs Are The First To Get Backing From Earlybird's New CEE Fund Qriously Raises $3.5 Million Led By Spark Capital For Its Question-Based Mobile Ad Network Boston-Based VC Firm And Early Twitter Investor Spark Capital Raises $450M For Fourth Fund Electric Cruisebeast Creator Elon Musk Tells The Oatmeal He's \"Happy To Help\" Fund Tesla Museum Sift Science, a credit card fraud prevention company, has closed an $18 million Series B round of funding led by Spark Capital, with participation from Union Square Ventures, Max Levchin, and First Round Capital. But what exactly is Sift Science? If you own a credit card, you probably understand the pains of having your credit card information stolen and used fraudulently. But, if possible, put yourself in the shoes of the vendor or merchant making that sale. When someone fraudulently buys a television from Bestbuy.com, the company not only loses a television, but they lose the $1,000 that was paid for the television, as it's eventually returned to your account from their own account. And to top it all off, if more than one percent of a merchant's online transactions are considered fraudulent, they're added to a penalty box list by the credit card companies which could threaten their very ability to process transactions online. It's a lose-lose-lose. Sift Science can help, though. The company pairs a smart UI with machine learning to detect fraudulent charges as they're happening. The industry standard currently is around 50-80 percent false positives, meaning that whomever is in charge of fraud detection is wasting 50 to 80 percent of their time on false alarms. Through machine learning and the ability to see fraudulent activity across a whole network of merchants, Sift Science is able to bring that number down to seven percent or less. \"Most fraud detection systems are based around rules,\" said founder Jason Tan. \"If the charge is more than $5,000, and from a Nigerian IP address, and the card has been rejected three times before, then the company won't process the transaction. But we say\" no rules, all data .' \"By forgetting about rules to detect fraud, Sift Science can simply use the speed of machine learning and the intuition of the human brain to provide the clearest data possible around fraudulent transactions in real time. charges nothing for the first 10,000 transactions per month, for every client, and then the price rounds out to about one cent per transaction after that. There are no annual contracts. Qriously Raises $3.5 Million Led By Spark Boston-Based VC Firm And Early Twitter Linkwell Lands $11M From WellPoint, Spark <mark>David Lee</mark> From SV Angel:\" Foursquare Is One Rebtel Spins Out Sinch, With $12M In Funding, Flipps, Metrekare, Tjobs Are The First To Get To Battle Yammer, Slack And Hipchat, Convo Heroku And Salesforce Make Powerful Customer Senior Software Engineer GrubHub, Inc.. Full Stack Software Engineers Meetup Senior Systems Engineer Nickelodeon Marketing Technologist Freed Associates"}, {"articleID": "2018092705_00034086_W", "names": {"Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"], "Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2018-09-27", "url": "https://www.scotsman.com/news/opinion/bill-jamieson-an-snp-labour-coalition-at-westminster-is-not-impossible-1-4805700", "content": "Bill Jamieson: An SNP-Labour coalition at Westminster is not impossible Published: 06:00 Thursday 27 September 2018 Share this article Sign Up To Our Daily Newsletter Sign up Have your say Ahead of us, an impasse: Brexit negotiations as good as paralysed; a Prime Minster trapped in a hole of her own making; a deeply divided Conservative Party; a Labour opposition pledged to oppose Chequers; Brexiteers equally opposed; and growing calls for a second referendum--possibly with the option to abandon Brexit and stay in the EU: if you thought politics was the art of the possible, today it is about making the impossible a reality. The impasse we face looks grim. Tomorrow looks little better. We are trapped in a politics of exasperation. But the day after tomorrow? How about this \"impossibility\" ? Few would rule out a general election over the next year. With Tories and Labour neck and neck, another minority government is no remote outcome. And in that event, how about the \"impossibility\" of a Labour-SNP coalition? Fanciful, you may think. The two parties are not just opposed--they can't stand each other. They would no more sit together than buddy up to Jacob Rees-Mogg at a monarchist rally. And has not Scotland's Labour leader <mark>Richard Leonard</mark> this week ruled out support for a second independence referendum? But note also this: Scotland should have major land reform with new rules to tax foreign and absentee landlords; an extra £ 3.7 billion for public services through a \"windfall' tax on the richest 10 per cent in Scotland to combat income and wealth inequality; ring-fencing of hundreds of millions of pounds of state aid funding for foreign-owned businesses and redirect it towards Scottish companies to re-train staff and save manufacturing jobs. Some £ 222 million has been handed out since 2007 in Regional Selective Assistance (RAS) to foreign-owned companies, compared to £ 140.7 million that has gone to Scottish-owned firms. The total amount of RAS has also fallen by 80 per cent since 2007. Such a programme would bring an SNP conference to its feet with cheers and stamping of feet. But these were not pronouncements from the SNP. They came from the same <mark>Richard Leonard</mark> at the Labour conference this week--the one in which the Shadow chancellor also pledged that rail, energy and mail services would join Scottish Water in public ownership, that the bosses of these companies should be made to seek re-election and their bumper pay packets substantially cut. There would be tough penalties for tax evasion and a new employees' share scheme giving workers dividends of up to £ 500. What SNP heart would not warm to such a programme? It is, after all, an unarguably Left-leaning party, a passionate advocate of bigger government, higher taxes on the wealthy, achingly liberal in social policy, and avowedly anti Brexit. As for economic policy, former SNP MP George Kerevan, the Antonio Gramsci of the party's economic gurus, would love it. And the Green Party MSP Andy Wightman would be doing cartwheels: would this not bring him closer than he has ever been to achieving his land reform dreams? But what of <mark>Leonard</mark>'s opposition to a second indyref? Would not this stand in the way of some form of coalition pact that would put Jeremy Corbyn in Downing Street? Yet how intoxicating is the nectar of political power when close to the olfactory senses: the nearer the deal-brokers approach, the more powerful it becomes. Is it really beyond the art of the possible that some contrivance of words could be constructed with which both sides could live -\" plausible ambiguity \"in Brexit parlance? Here, indeed,\" the art of the possible \"comes into its own. And after all, if Labour can be so cavalier in dropping its earnest protestations that it would\" respect \"(sic) the outcome of the 2016 EU referendum, who could rule out a similar somersault on its views on a second indyref? Is our paralysed politics today not truly entering the realms of the surrealist writer Peter Pomerantsev where\" Nothing Is True and Everything Is Possible \"? It is in this spirit that we should view the declaration this week of shadow chancellor <mark>John McDonnell</mark>:\" The greater the mess we inherit, the more radical we have to be; the greater the need for change, the greater the opportunity we have to create that change and we will. \"In time-honoured political tradition, words can be made to mean whatever the speaker wants them to mean--and which may be quite different from what the audience hears them to mean. Take Mr <mark>McDonnell</mark>'s declaration about share ownership by employees. He invoked the example of the <mark>John Lewis</mark> Partnership. But that is not what is on offer. The shares would not be given to the employees but would be held by a state-mandated committee which would distribute up to £ 500 of any share dividend to each employee. The committee would hold the rest and pass it back to the Treasury--Corporation Tax by another name. Who would exercise the voting rights? Employees would not enjoy a sense of direct equity participation in the affairs of the company, and no direct holding over which they had control to build on or sell as they wished. As such, it is a poor substitute for the scheme introduced by former Labour chancellor <mark>Gordon Brown</mark>--the\" All Employee Share Ownership Plan' or Share Incentive Plan. This provided a stronger basis for individual employee participation and retention of capital value, and is the most tax efficient UK investment plan in existence (more so than personal pensions). Perhaps Tory chancellor <mark>Philip Hammond</mark>, to spike Labour's guns, could unveil an updated and extended model in his November budget. But the Conservatives have already surrendered ground to the Left - on tax, health spending and social housing policy. It is in ideological disarray. A Labour-SNP coalition is thus by no means impossible--indeed it increasingly looks a plausible runner. And in the absence of an inspiring electoral alternative, what could possibly stymie it? Perhaps this: the prospect of a raucous whooshing sound as capital and people start heading for the exits. Hard Labour, asset seizure, higher tax and a grasping state: not at all \"impossible\" once the populist wagons roll. Follow Us On"}, {"articleID": "2015010704_00034309_W", "names": {"Karen Koster": ["Q59195342", "Q6369788"], "Martin King": ["Q18822346", "Q59459475", "Q6775888", "Q6775889", "Q6775890"]}, "date": "2015-01-07", "url": "http://www.herald.ie/sport/soccer/dyke-welcomes-ali-call-30887078.html", "content": "07 January 2015 03:00 AM ENGLISH Football Association chairman Greg Dyke has welcomed the decision by Prince Ali Bin Al Hussein of Jordan to challenge Sepp Blatter for the FIFA presidency in May. Kick It Out: Football is still \"male and pale' QPR agree loan deal for Hammers' Zarate Vokes will help Long on comeback trail Prince Ali, a FIFA vice-president and head of the Jordanian FA, is the first credible challenger to emerge and his announcement has also been welcomed by UEFA president Michel Platini. Dyke, who has previously called for Blatter not to run again, said:\" Personally I welcome Prince Ali's decision to stand for the FIFA presidency. It is very important that there is a credible candidate standing against Mr Blatter and Prince Ali is certainly that. \"Platini added:\" I know Prince Ali well. He has all the credibility required to hold high office. We now await his proposals and his programme for the future of football. \"Over € 20k stolen in daylight raid on city cash van City pub is slammed over\" disgusting' booze promo \"No record' of prince's sex abuse claim woman ever meeting Queen, says palace Fergie stands by her ex-husband Prince Andrew, as underage sex allegations refuse to go away Rogue cyclists set to face € 50 on-the-spot penalties for breaking red lights Over € 20k stolen in daylight raid on city cash van City pub is slammed over\" disgusting' booze promo \"No record' of prince's sex abuse claim woman ever meeting Queen, says palace Fergie stands by her ex-husband Prince Andrew, as underage sex allegations refuse to go away In the not so distant past, we Irish were seen by many of our neighbours as a dirty old place. In the not so distant past, we Irish were...Cinema takings hit 25-year low but Star Wars is 2015's big hope Staying in tonight? Here's what to watch on the box While you're nursing that horrific credit card bill...Pat Stacey on TV: Do fact-based dramas have to be 100pc true? A few years ago, it would have been hard to imagine James Corden taking a pragmatic and modest attitude towards cracking...Reunited and it feels so good as Jenny's back on the air with hubby Ray I can't wait, says Angela as she lands plum role on the Voice UK <mark>Karen Koster</mark>'s newborn baby Finn may only be nine...EastEnders will finally reveal how its character...Pat Stacey review: And now, the UTV Ireland news: nothing to see here Luther <mark>King</mark> was inspiration for\" stage name', reveals TV3 weatherman <mark>Martin King</mark> By using this website you consent to our use of cookies. For more information on cookies see our"}, {"articleID": "2015071718_00025714_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Rick Wilson": ["Q16186444", "Q16196773", "Q28421760", "Q3431613", "Q605482", "Q7331863", "Q7331864"], "Jay Rosen": ["Q1378510", "Q554143"], "James Warren": ["Q3806756", "Q6145155", "Q6145156", "Q6145157"]}, "date": "2015-07-17", "url": "http://local10.com/news/money/huffington-post-to-cover-trump-as-an-entertainer-not-a-politician/34219736", "content": "Home HuffPo to cover <mark>Trump</mark> as entertainer, not politician Editors: \"<mark>Trump</mark>'s campaign is a sideshow' Author: By Tom Kludt Andrew H. Walker/Getty Images NEW YORK (CNNMoney) - The Huffington Post will continue to cover <mark>Donald Trump</mark>, but the popular news site is done treating him like a legitimate presidential candidate. In a note to readers on Friday, two top editors for HuffPost said that coverage of the brash billionaire's campaign will be a part of the site's entertainment section.\" Our reason is simple: <mark>Trump</mark>'s campaign is a sideshow, \"wrote Washington bureau chief Ryan Grim and editorial director Danny Shea.\" We won't take the bait. If you are interested in what The <mark>Donald</mark> has to say, you'll find it next to our stories on the Kardashians and The Bachelorette. \"Quick Clicks <mark>Donald Trump</mark>'s Miss USA back on TV: Reelz channel steps in In a separate statement, Grim said that the site had\" erroneously been covering [<mark>Trump</mark>] as an actual presidential candidate. \"\"Now, the impact he's having on the Republican Party and the immigration debate is itself a real thing, and we'll cover that as substance, but anything that tumbles out of his mouth will land on the Entertainment page,\" Grim said. HuffPost trumpeted the announcement on its homepage with a headline that borrowed <mark>Trump</mark>'s signature line from \"The Apprentice\" : \"You're fired!\" The decision comes a day after a reporter for the site interviewed <mark>Trump</mark> on the campaign trail in New Hampshire. That story was published Friday in the entertainment section. The move also comes as the real estate mogul and reality television star is leading most of his Republican rivals in the polls. In fact, <mark>Trump</mark> touted his top spot on HuffPost's own polling aggregator just a couple weeks ago. \"We believe he's partly the media's creation,\" said Arianna Huffington, the HuffPost's editor in chief and co-founder. She said the site's editors have been having a \"lot of internal conversations about how to cover <mark>Trump</mark>.\" It also came up when Huffington met with outgoing Bloomberg Digital editor Josh Topolsky. She said Topolsky asserted that <mark>Trump</mark> coverage should be relegated to the entertainment section. When Huffington had a subsequent meeting with her lieutenants, they all supported the idea, she said. <mark>Trump</mark> wouldn't be the first celebrity to pull off an unlikely electoral triumph. Just ask voters in Minnesota and California, where former pro wrestler Jesse \"The Body\" Ventura and actor Arnold Schwarzenegger served as governors. The liberal site drew applause from some conservatives and Republicans for the move. \"I don't always agree with the [Huffington Post] but today, I salute them,\" tweeted <mark>Rick Wilson</mark>, a GOP media consultant. The reaction in the media world, however, was mixed. <mark>Jay Rosen</mark>, who teaches journalism at New York University, called the decision \"brilliant\" and said that HuffPost moved \"against automatic thinking and herd behavior in campaign coverage.\" Washington Post media critic Erik Wemple called the decision a \"Trumpian stunt\" by the Huffington Post. <mark>James Warren</mark>, the chief media critic for the Poynter Institute for the Media Studies, said that HuffPost had erred in its decision. \"You might think <mark>Trump</mark> is a buffoon,\" <mark>Warren</mark> wrote. \"But he may have, for the moment at least, touched some nerve of dissatisfaction, perhaps partial explanation of his decent showing in some early Republican polls.\" One person who hasn't weighed in yet is <mark>Trump</mark>, who has a penchant for media criticism. A spokesperson did not respond to a request for comment. CNNMoney's Brian Stelter contributed to this report Copyright 2015 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}]