[{"articleID": "2013061219_00090440_W", "names": {"Danny Green": ["Q1164622", "Q5220400", "Q5220401", "Q555436"], "Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"]}, "date": "2013-06-12", "url": "http://www.npr.org/blogs/thetwo-way/2013/06/12/190940465/spurs-blow-out-the-heat-take-2-1-lead-in-nba-finals?ft=1&f=", "content": "The Spurs were red hot Tuesday night, not the Heat. San Antonio blew out Miami in Game 3 of the NBA finals, winning 113-77 and taking a 2-1 lead in the best-of-seven series. i The San Antonio Spurs' Manu Ginobili (left) congratulates teammate Gary Neal on his three-pointer during Tuesday night's game. Al Diaz / Miami Herald / MCT / Landov The San Antonio Spurs' Manu Ginobili (left) congratulates teammate Gary Neal on his three-pointer during Tuesday night's game. Led by <mark>Danny Green</mark> and Gary Neal, the Spurs went on a tear?? \"hitting a Finals record 16 shots from beyond the three-point arc. As NPR's Tom Goldman said on Morning Edition,\" Miami melted into the hardwood like the wicked witch of the west \"as San Antonio hit shot after shot. As often happens, though, the winners do have something to worry about. Point guard <mark>Tony Parker</mark>, who drives San Antonio's offense, has a right hamstring injury. He's due to be examined Wednesday. USA Today Sports thinks that if <mark>Parker</mark> can't play in upcoming games,\" there's simply no way the Spurs can finish this job and win their fifth title. \"Game 4 is set for Thursday in San Antonio. Game time: 9 p.m. ET. ABC-TV is the broadcaster. For some background on what to watch for in the finals, see our earlier post: Experts Doubt NSA Leaker's Claim About Wiretaps Top Stories: NSA Wiretap Doubts; Spurs Crush Heat In NBA Finals Sports Spurs Blow Out The Heat, Take 2-1 Lead In NBA Finals News Experts Doubt NSA Leaker's Claim About Wiretaps Sign In / Register Please keep your community civil. All comments must follow the"}, {"articleID": "2018110106_00013516_W", "names": {"Marco Silva": ["Q20118419", "Q57025699", "Q6757714"]}, "date": "2018-10-31", "url": "http://www.msn.com/en-gb/lifestyle/style/this-is-the-real-reason-your-jeans-have-those-studs-on-the-pockets/vi-BBPchHb?srcref=rss", "content": "SETTINGS OFF HD HQ SD LO Southern Living The reason your jeans have those studs on the pockets Duration: 01:12 9 hrs ago SHARE SHARE TWEET SHARE EMAIL This Is The Real Reason Your Jeans Have Those Studs On The Pockets UP NEXT NOW PLAYING: Style The reason your jeans have those studs on the pockets Southern Living UP NEXT Video: Rangers v Kilmarnock in pictures - 13514401 Daily Record Phil interviews woman's ghost fiancee Daily Record Squirrel Tries on Ghost Mask Dailymotion Non-guilty pleasure! Chocolate fashion show opens Salon du Chocolat in Paris Dailymotion Royal Blue: Can <mark>Marco Silva</mark> afford to give Kevin Mirallas another chance? Liverpool Echo \"Bar Rafaeli removes niqab in controversial Hoodies advert\" Evening Standard Billie Faiers reveals how to apply false nails Closer Bhutan: What it means to be happy in the \"happiest country' Dailymotion Video: Outlander - Season 4 Official Trailer - STARZ - Full Trailer Daily Record Makeup Artist Does Human to Zombie Transformation Dailymotion Why forcing cyclists to wear helmets will not save lives The Guardian Video: Dundee v Celtic in pictures - 13514411 Daily Record Soldier Mom Makes Surprise Visit to Daughter's School Dailymotion"}, {"articleID": "2018042509_00031267_W", "names": {"Jack White": ["Q10539822", "Q24073723", "Q272031", "Q6115762", "Q70713"], "Ty Walker": ["Q15926177", "Q3542640"]}, "date": "2018-04-25", "url": "http://blogs.dallasobserver.com/music/jack-white-and-the-ticket-will-face-off-in-a-game-of-baseball-at-reverchon-park-10618753", "content": "Lee Ann Womack Returns Home to Texas for Album Recording and Dallas Concert \"I listened to it again, and it sounded so telegraphed,\" he says. \"Which is kind of funny, because people often accuse us of scripting our show, and nothing could be farther from the truth, but this was predetermined, like wrestling .\" Although the game is free to the public, donations are encouraged. The money raised will go to Texas Scottish Rite Hospital for Children, which is next to the park. <mark>White</mark> is the co-owner of the baseball bat company Warstic, based out of Deep Ellum, along with former Texas Ranger Ian Kinsler and native Texan Ben Jenkins. With <mark>White</mark> playing a venue that's not too far from the Warstic building, which doubles as a retail space and a manufacturing shop, this baseball game makes plenty of sense. <mark>White</mark> has not announced who will be on his team, but several Ticket hosts have been announced for the Ticket Timbers. Personalities from The Musers, BaD Radio and The Hardline will be on the field. Brothers Cash and Mike Sirois will join Mike Rhyner, Corby Davidson, <mark>Ty Walker</mark>, David Mino, Balis, Dan McDowell and Jake Kemp, as well as former Hardline board op Michael \"Grubes\" Gruber. For the Ticket Timbers, there are no plans for practicing ahead of time. \"I'm probably the most athletic guy at the Ticket .\" --Dan McDowell email \"As far as I know, the plan is going to be show up and just kinda use our natural talents,\" McDowell says. \"We talk about baseball a lot, so I'm sure it's going to be very easy to play .\" The last time many of the Ticket Timbers played baseball was the Ticket Great Game in the summer of 2010. \"We played college baseball women, and I struck out and got hit by a pitch,\" Balis says. \"I'm pretty terrible at this game .\" Gruber played baseball in high school when he was a student at Jesuit, but it's been a while. \"I just want to survive,\" Gruber says. \"It's been eight years since I last played any sort of competitive baseball. I'm not sure how many catcher's squats my stubby legs have in them now .\" <mark>Walker</mark> has played slow-pitch softball for a while, but he hasn't played baseball since the 2010 Great Game. He's up for the challenge, though. \"While I'd like to see a close game, part of me thinks the Warstic guys believe they're gonna blow us out,\" he says. \"I'd like to prove them wrong .\" McDowell has coached softball for years in addition to playing baseball. \"I'm very versatile,\" he deadpans. \"I'm probably the most athletic guy at the Ticket .\" The players say they're not scared. \"I believe we would expect to win,\" McDowell says. \"That's kind of the way we face everything, whether it comes to radio or whatever it is .\" McDowell thinks about what the hardcore Ticket fans, known as the P1's, will want to see. \"I don't think anyone wants to see <mark>Jack White</mark> win,\" McDowell says. \"Now, if we were in some kind of musical competition, I would think he would be favored. But this is a sports competition, and we are sports guys .\" The mental game is strong with the Timbers. \"When I think of <mark>Jack White</mark> rocking, it's a beautiful thing,\" Mike Sirois says. \"When I think of <mark>Jack White</mark> and baseball, all I picture is that meme when he was at that Cubs game a few years ago. That person I am not afraid of .\" Kemp just hopes no one gets hurt. Well, no one famous. If you like this story, consider signing up for our email newsletters. SHOW ME HOW X SUCCESS! You have successfully signed up for your selected newsletter (s) - please keep an eye on your mailbox, we're movin' in! \"And if they do, that I am not responsible for their injury,\" Kemp says. \"I do not have the money to get myself good representation in a civil suit against any of these people .\" Nobody wants to see anyone get hurt, but if <mark>White</mark>'s team loses, it could change how <mark>White</mark>'s second show goes. \"We want Sunday's show to be all slow ballads and all the sad songs that he has,\" Sirois says. \"So hopefully, if we put a good crushing on him and his team, that will be the case .\" The Sandlot War will be at 6 p.m. Saturday at Reverchon Park. Eric Grubbs is a Dallas-based writer who has published two books, Post: A Look at the Influence of Post-Hardcore 1985-2007 and When We Were the Kids. His writing has been featured in Punk Planet, Popdose, Fort Worth Weekly, The Dentonite and LA Weekly. He supports Manchester City and will never root for Manchester United. Contact:"}, {"articleID": "2017042717_00344543_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-04-27", "url": "https://www.joe.co.uk/sport/wladimir-klitschko-rubbishes-eye-injury-rumour-and-explains-point-of-memory-stick-123450", "content": "5 shares Wladimir Klitschko rubbishes eye injury rumour and explains point of memory stick By Darragh Murphy Sport | 6 minutes ago Boxing Playing those mind games 5 shares Wladimir Klitschko rubbishes eye injury rumour and explains point of memory stick By Darragh Murphy Wladimir Klitschko is not one to engage in trash talk all that often but that's not to say that he won't indulge in a subtle mind game or two. Once revered as the most dominant force in boxing's heavyweight division, Klitschko will have to prove that there's some fight left in the old dog yet as he aims to yank the brakes on a hype train of unparalleled momentum in the form of Anthony Joshua. One of the most intriguing fights in recent heavyweight history takes place on Saturday night as Wembley Stadium hosts Joshua vs. Klitschko, with the IBF, vacant WBA (Super) and IBO heavyweight titles on the line. Respect has dominated the build-up to the in-ring collision of past and future but Klitschko has tried, on occasion, to get under the skin of the humble \"AJ'. Earlier in the month, he referred to Joshua as\" a wannabe billionaire \"in an out-of-character swipe at his upcoming opponent. But Joshua didn't bite. Where the hell did this come from? Klitschko gives it both barrels https: //t.co/e8Qm1tly8P--JOE. co. uk (@ JOE_co_uk) April 10, 2017 And with just days to go until nothing but a referee separates the fighters, we saw more attempted mind games from the Ukrainian. During Thursday's press conference, Klitschko reached into his pocket and pulled out a memory stick, where his confident prediction for this weekend's clash is stored. Advertisement The 41-year-old intends to auction off the robe he will wear to the ring, which will come with his pre-fight prediction included, and the proceeds will go to his charity .\" On this stick, I recorded a video last week and I gave my prediction, \"Klitschko explained .\" This stick is going to be integrated into my robe. \"Do not ask me, after that fight, what is on the stick. The only person who is going to be able to open it up and watch it is the person who buys this robe, with all the money going to the Klitschko Foundation .\" Rumours of an eye injury to Klitschko have circulated in recent days but he gave short shrift to any talk of the fight being in jeopardy by pulling a line right out of <mark>Donald Trump</mark>'s arsenal. \"Fake news!\" Klitschko assured. There's not long to go now! Read more about: Boxing, Anthony Joshua, Wladimir Klitschko 5 shares Share"}, {"articleID": "2017042615_00037130_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-04-26", "url": "https://sg.finance.yahoo.com/news/family-trumps-potent-mix-blood-business-074206201--politics.html", "content": "View photos FILE - In this March 3, 2017, file photo, President <mark>Donald Trump</mark> and his family, daughter Ivanka Trump, her husband senior adviser Jared Kushner and their children Arabella Kushner and Joseph Kushner walk out of the Oval Office of the White House in Washington. Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law to head the Peace Corps has a president leaned as heavily on his family as has <mark>Donald Trump</mark>. (AP Photo/Pablo Martinez Monsivais, File) More WASHINGTON (AP)--Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law as director of the Peace Corps has a president leaned so heavily on his family. Even <mark>Donald Trump</mark>'s 5-year-old granddaughter Arabella has pitched in. As the administration nears its 100-day mark, Trump has established a White House operation with such an unusual commingling of blood, business and government that it has surprised even his own family. Ivanka Trump, who once said she'd stick to the role of daughter, now has a West Wing office and the title of assistant to the president after she discovered that \"having one foot in and one foot out wouldn't work .\" Her effort to walk a fine line has not always been easy. During an appearance Tuesday at a women's empowerment conference in Germany, she drew hisses and groans as she defended her father's track record. Her husband Jared Kushner is a senior adviser to the president with a bulging and growing portfolio that includes everything from brokering Mideast peace to restructuring the federal government. And there was the president's son Eric, in the unofficial role of spokesman, declaring his father would stand up to North Korea's provocations. In an interview, at the White House Easter egg roll no less, saying on behalf of the president: \"You don't want there to be death and destruction and turmoil around the world but, again, you have to have massive backbone when it comes to dealing with awful, awful dictators .\" Another Trump son, Don Jr., enhanced his profile during the campaign and early months of his father's presidency to such an extent that there is speculation he'll make his own run for office. And he's leaving that door open, saying the New York governor's seat could be a tempting destination at some point. The president's wife, Melania, meanwhile, has been a largely distant presence so far, remaining in New York for the most part while their 11-year-old son Barron finishes out the school year. But she is gradually spending more time in Washington and did give her husband a gentle nudge to put his hand on his heart during the playing of the national anthem at the Easter egg roll. Little Arabella chimed in to the Trump team effort by charming Chinese President Xi Jinping by singing a tune in Mandarin during the leaders' recent meeting at Mar-a-Lago. There are both pros and cons in staffing up from within one's own family, as Trump is learning. The family dynamic has added extra intrigue to the jockeying between rival power centers that is typical in the early days of any White House. The more moderate contingent led by Kushner and Ivanka Trump appears to be ascendant in recent days over those allied with senior strategist Steve Bannon, the former media executive and radio host who's a favorite of conservatives. Princeton historian Julian Zelizer says family members may be able to give a president a tough assessment that other staff members would shrink from providing, but they also can become \"so enmeshed in the identity of their family and protecting their father that they can't give honest advice or can't even see problems as they emerge .\" Ivanka Trump has been criticized for not speaking out more forcefully when she disagrees with her father. But that doesn't necessarily mean she's not making her views heard. \"I would say not to conflate lack of public denouncement with silence,\" she said earlier this month. During her appearance this week in Berlin, she said she's still \"rather unfamiliar\" with her new role as first daughter and presidential adviser but hopes to bring advice and feedback \"back to both my father and the president--and hopefully that will bring about incremental, positive change .\" Her husband, meanwhile, has traveled to Iraq with the chairman of the Joint Chiefs of Staff and has been advising the president on relations with the Middle East, Canada and Mexico. The extent of Ivanka Trump's sway with her father is suggested by Eric Trump's recent comment that she likely weighed in before the president decided to bomb Syria in retaliation for a chemical weapons attack. Eric Trump told London's Daily Telegraph: \"She has influence. I'm sure she said,\" Listen, this is horrible stuff .' \"The blurry line between the Trump family's business interests and its government connections is another unusual complication of this presidency. Even with sons Don Jr. and Eric tasked with running the Trump businesses while Kushner and Ivanka Trump tend to government affairs, the continuing public-private overlap has generated lots of questions about conflicts of interest. Read More The separation between business and government is\" totally artificial, \"says Zelizer. Eric Trump's admission to Forbes magazine in February that\" nepotism is kind of a factor of life \"in the Trump family didn't help dispel the impression of an insider's clan, although he stressed that\" if we didn't do a good job, if we weren't competent, believe me, we wouldn't be in this spot. \"For all the questions about Trump's reliance on family, some see it as a net positive. The value of having a son or daughter on the inside\" is honesty and love, \"says former George H.W. Bush administration staffer Doug Wead, author of books on presidential children and the 2016 campaign .\" They care if your shirt-tail is hanging out. If your hair is messed up, they'll tell you. When everybody else is trying to hide from you, they're going to let you know. \"The power--and peril--of Kushner's place in Trump World is hinted at by Washington graybeard Henry Kissinger in a write-up for Time's list of 100 most influential people. Kissinger said Kushner's broad education and business background\" should help him make a success of his daunting role flying close to the sun. \"___ Follow Nancy Benac on Twitter at: http: //twitter.com/nbenac"}, {"articleID": "2014112018_00001021_W", "names": {"King Kong": ["Q2171232", "Q22278621", "Q6411824"]}, "date": "2014-11-20", "url": "http://www.modernghana.com/news/582121/1/stephen-akwetey-to-invest-gh1-million-into-health-.html", "content": "The Former Greater Accra Regional Chairman Aspirant of the National Democratic Congress NDC, Stephen Akwetey has reiterated commitment to invest in the ongoing project he outlines, as part of the promises he made towards the campaign. At a news conference in Accra, he stated that since health and education plays a vital role towards the development of Ghana an amount of Gh 1 million has been allocated to these sectors because this fund is meant to care for the needs of brilliant but the poor party activists and their dependents. The funds which operate independent of the leadership of the region, he said will be managed by a board which be out - doored and inaugurated soon. Followed by a comprehensive training seminar for all constituency executives in the order to properly orient all stakeholders on the utilization of the fund. He touched on the ongoing construction of the constituency offices with respect to the current Shai-Osudoku site, inasmuch as the Obom-Domeabra site has received building equipment to begin work with land title and other necessary documentation for the other constituencies are being processed. Stephen Akwetey emphasized on the one thousand acres of land for Agriculture business which is intended to offer the constituencies the opportunity to raise funds for the running of their offices and the party's activities. He stressed on the need to create more jobs for party activists in all constituencies though there is ongoing registration of business entities for the purpose also giving respectable incomes to the people. Again as part of his project which is the youth and women movement agenda as a programme intended to into the collective energies of all constituency and branch youth organizers and their colleague branch and constituency women organizer to create a mass, vibrant and influential youth and women movement. On the integration of TEIN members into constituency activities, he said this programme aims at ensuring that the members of the Tertiary Educational Institutions Network (TEIN) of the NDC on various campuses are properly drafted and integrated into their respective constituencies and branches after their courses of study. \"That notwithstanding, let me assure all members of the NDC in the Greater Accra region that for the first in our political history, I, Comrade Stephen Akwetey will continue with all the projects I have started, even though I did not win the election\" He, therefore, called on ranking members and all to fully lend their support and commitment to the president, his excellency John Dramani Mahama as he embarked upon the Better Ghana Agenda to improve the socio-economic conditions of the people in the these country. 20-11-2014 We Need To Be Disciplined - Lee Ocran Charges Ndc Members 19-11-2014 Minority Walked Out Of Parliament Over 17.5% Petroleum Tax 19-11-2014 Everybody In Mahama's Government Is A \"<mark>king Kong</mark>' - Kwesi Pratt 19-11-2014 2015 Budget: A Lame Duck Budget From A Lame Duck Gov' t - cpp 19-11-2014 Minority Vows To Resist 17.5% Petroleum Tax 19-11-2014 Npp Borrowed $5.5 bn In 8yrs, Ndc $27bn In 6yrs - Bawumia Stokes Debt Debate 19-11-2014 Cocaine Bust Saga: Npp Will Politicize Issue, Expose Ndc Drug Barons--Agyarko 19-11-2014 Northern Npp Youth Caucus Congratulates Mustapha Salam 18-11-2014 Speaker, Mps Isolate Daboya Mp Over\" alomo Jata' Comment 18-11-2014 Daboya Mp's Comment Is An Act Of Terror - 31st Dwm 18-11-2014 Npp Borrowed $5.5 bn In 8yrs, Ndc $27bn In 6yrs - Bawumia 18-11-2014 Afari-gyan Should Be Allowed To Supervise 2016 Elections - kennedy Agyepong 18-11-2014 Ade Cokers Incompetence Hurting Ndc - former Lekma Mce 18-11-2014 Daniel Amartey Suspects foul Play In Ndc Election Defeat 18-11-2014 Ndc Needs Kofi Adams To Restore lost Integrity - rawlings 18-11-2014 Rawlings Still Relevant To Ndc - lecturer Argues 18-11-2014 New Npp Appointments: Nana Akomea Made Director Of Communications Again 18-11-2014 Tawiah Boateng Elected E/r Ndc Chair; Oliver-kevor Gets Secretary 18-11-2014 General Mosquito Defends $20m Ndc Office 18-11-2014 Ndc Boys Chase Ministersoldiers, Police Rescue 17-11-2014 Divisive Tactics Might Cost The Npp - Concerned Npp Youth 16-11-2014 Ndc Tamale Organiser Assaulted Me - Minister 16-11-2014 Angry Ndc Youth In Tamale Demand Removal Of Regional Minister 15-11-2014 Allotey Jacobs Wins; Ade Coker Retained In Ndc Regional Elections"}, {"articleID": "2019060419_00105514_W", "names": {"Ronald Krauss": ["Q25212076", "Q7365031"]}, "date": "2019-06-04", "url": "http://www.live5news.com/2019/06/04/red-meat-white-meat-study-says-it-really-doesnt-matter/", "content": "Red meat? White meat? Study says it really doesn't matter Eat nonmeat proteins to cut cholesterol A new study published this week in the American Journal of Clinical Nutrition shows red and white meats are equally bad for cholesterol. (Source: Achim Bongard from Pexels) By | June 4, 2019 at 1:29 PM EDT - Updated June 4 at 3:15 PM Ed Payne (Gray News)--Conventional wisdom says to eat white meat and shun the red. During the last few decades, red meat's association with increased heart disease made it an unpopular choice for many. Government dietary guidelines encouraged the consumption of poultry as a healthier alternative. A new study published this week in the American Journal of Clinical Nutrition shows red and white meats are equally bad for cholesterol, one of the risk factors for heart disease. \"When we planned this study, we expected red meat to have a more adverse effect on blood cholesterol levels than white meat, but we were surprised that this was not the case--their effects on cholesterol are identical when saturated fat levels are equivalent,\" said the study's senior author <mark>Ronald Krauss</mark>, professor of medicine at University of California--San Francisco. Randomized controlled trial: Effects of red meat, white meat, and nonmeat protein sources on atherogenic lipoprotein Conclusion: White meat has the same negative effect as red meat. @ PlantDietitian https: //t.co/14iRp79tqC @ VeganHeartDoc"}, {"articleID": "2018072718_00195505_W", "names": {"Julie Miller": ["Q25190310", "Q2569812"]}, "date": "2018-07-27", "url": "https://www.vanityfair.com/hollywood/2018/07/cbs-les-moonves-sexual-misconduct-allegations", "content": "By Taylor Hill/FilmMagic. On Friday morning, the CBS board of directors announced that it will investigate sexual misconduct claims made against Les Moonves, the network's C.E.O. \"All allegations of personal misconduct are to be taken seriously,\" the board stated in a press release. \"The Independent Directors of CBS have committed to investigating claims that violate the Company's clear policies in that regard. Upon the conclusion of that investigation, which involves recently reported allegations that go back several decades, the Board will promptly review the findings and take appropriate action .\" The announcement arrived hours before The New Yorker was reportedly set to publish an exposé from Ronan Farrow, the Pulitzer Prize--winning journalist whose reporting on Harvey Weinstein helped fell the Hollywood mogul and crystalize the current Time's Up and #MeToo movements. Farrow's forthcoming report, according to The Hollywood Reporter, is said to accuse Moonves of \"unwanted kissing and touching that occurred more than 20 years ago, as well as numerous claims that occurred more recently .\" (The CBS board's statement did not mention Moonves by name, but did reference a pending New Yorker article .) CBS also noted the timing of the new claims--as arriving \"in the midst of the Company's very public legal dispute .\" This past May, Vanity Fair's William D. Cohan reported that the battle between Moonves and Shari Redstone, whose family currently controls both CBS and Viacom, for command over the network had gone \"nuclear\" --with CBS attempting to wrest voting power away from the Redstones. Shari, the heir apparent to father Sumner Redstone's media kingdom, has been hoping to merge the companies that her father split into two publicly traded corporations. Moonves and the CBS board sued Shari in hopes of preventing the merger. The suit is set to be argued in court in October. Get Vanity Fair's HWD Newsletter Sign up for essential industry and award news from Hollywood. E-mail Address Subscribe Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement. Share Email Facebook Twitter <mark>Julie Miller</mark> <mark>Julie Miller</mark> is a Senior Hollywood writer for Vanity Fair's website."}, {"articleID": "2015121723_00115852_W", "names": {"Dylan Thomas": ["Q30903334", "Q57375199"], "Russell Davidson": ["Q30069168", "Q57085608"]}, "date": "2015-12-17", "url": "https://www.tapinto.net/articles/boys-basketball-vass-ready-to-lead-new-providenc", "content": "Photos By TIM LECRAS December 17, 2015 at 5:27 PM NEW PROVIDENCE, NJ--For the first time in Pioneer senior point guard Kevin Vass's basketball career, he will be the show. No longer does Vass have the comfort of <mark>Dylan Thomas</mark>, Bryan Joyve or Kevin Haggerty on his side. Instead, its him and a wealth of new players tasked with leading the Pioneers into a new form of glory, Central Jersey, Group 2. New Providence head coach Art Cattano said with all the work Vass put in during the summer, he is more than capable of stepping up as a leader on and off the floor. Sign Up for E-News \"He's got to be on the court as much as possible, if not all the time,\" Cattano said, \"just because of the fact that he's a very good point guard and can run the show. He just makes everybody else better when he's in there. I'd say there is a lot on him .\" Vass will be tasked with being every bit of a leader that <mark>Thomas</mark>, Haggerty and the rest of last year's senior class were combined. However, he won't be doing it alone. Joining Vass is senior football standout <mark>Russell Davidson</mark>, who could be the Pioneers' biggest surprise. The all-conference defensive lineman is relatively new to basketball, but because of his work ethic and natural leadership abilities, has stepped up to be a major part of Cattano's plan. \"Here is a kid with not a lot of basketball experience, but football wise, his presence, he's just that type of kid,\" Cattano said. \"He's developed that from being a captain on the football team. He really works hard. I'm very pleased with him. I didn't know what to expect from him. He's into basketball and he really likes it. He's certainly a big help .\" Sophomore Jack Barletta has also propelled himself into the starting lineup. His pure athleticism doesn't go unnoticed, as both Cattano and Vass expressed their desire to see Barletta exceed on the hardwood. \"He's just really athletic,\" Vass said. \"He's fast and can get to the rim. He's going to be a good player .\" The biggest question facing the Pioneers this year is who else will step up until Sean Cole returns later in the season. Jason DiBenedetto and Jon Munroe are both expected to see significant playing time this year, however after that, the rest is a big question mark. \"I'm looking forward to see who steps up on the team,\" Vass said. \"Its going to be a whole new team this year with the exception of me. I want to know who can step up and fill the roles of players from last year .\" The Pioneers tip-off their season on Friday night, and right off the bat will be forced into highly competitive games against rivals Oratory Prep and Jonathan Dayton before making their annual appearance in the Chatham Cougar Classic. With a jump up to Central Jersey, Group 2 for states, Cattano is hoping that New Providence's early season strength of schedule will give his squad enough experience to get ready for a strong push in January, February and March. \"We play some pretty good schools in our season,\" Cattano said. \"Forget about our league, we play Summit, Caldwell, Chatham, Hanover Park. We play Summit, Hanover Park and Chatham just in the holiday tournament. Its brutal, but its good for us. Its very good competition .\" Tip-off for Friday's season opener at Oratory Prep is scheduled for 7 p.m."}, {"articleID": "2015031218_00007123_W", "names": {"Joseph Sanchez": ["Q11728477", "Q6286816"], "Larry Walker": ["Q11752886", "Q22337579", "Q3218116"], "Chris Drury": ["Q2495654", "Q471491"], "Matt Miller": ["Q16732613", "Q20680269", "Q32945388", "Q6788873", "Q6789069", "Q6789071", "Q6789072", "Q6789073", "Q6789074", "Q6789075"]}, "date": "2015-03-12", "url": "http://www.heyreverb.com/blog/2015/03/12/remember-remember-garth-brooks-was-in-denver/101377/", "content": "In this Jan. 25, 2008 file photo, country singer Garth Brooks performs during a charity concert in Los Angeles, to benefit the Southern California 2008 Fire Intervention Relief Effort (F.I.R. E). Brooks is going to be very busy in December. Brooks sold more than 140,000 tickets Saturday morning, Nov. 6, 2010, and his benefit concert for Nashville, Tenn., flood relief ballooned from one show to nine. (AP Photo/Mark J. Terrill, File) Garth Brooks took the stage with a beeper clipped to his belt. It was the year 1996 and Brooks and his then-wife Sandy Mahl were expecting their third child. Mahl was due any moment, her contractions were four minutes apart that day and the beeper was there to notify Brooks if his third child was coming. \"If this beeper goes off, I'm out of here,\" Brooks said before the show at McNichols Arena - his first of three-night sold out run. \"I've got a plane here ready to go .\" Lucky for Denver fans, Brooks' daughter (Allie Colleen Brooks) was born a week later and the country star made it through his string of McNichols shows. When Brooks returns on March 18 for his first Colorado concert since the McNichols run, Allie Brooks will be nearing her 18th birthday. Babies have become adults, the McNichols building has been demolished, Brooks has retired, returned from retirement and has released three more albums in the time it took him to make his way back to play a proper show in Colorado. That Colorado fans have waited nearly two decades to see the country superstar was only half the excitement when he announced his return in January. Brooks will be playing nine shows at Denver's Pepsi Center from March 18-24. It's a record breaking tour stop in the region: with 120,000 tickets up for grabs, Brooks has sold more tickets than any artist with consecutive shows at one venue in Colorado. While he hasn't played a proper show since 1996, Brooks has made two appearances in the state for charity events in the past few years. April 24, 2010 - Brooks attends the opening of Child Life Zone The Garth Brooks Teammates for Kids Foundation and the Troy Aikman Foundation built the $2 million therapeutic and education play area at Denver Health Medical Center. Brooks himself appeared for the grand opening. \"Trust me, you're gonna be very happy what it does for our kids,\" country singer Brooks told a large and cheering audience made up of hospital administrators, doctors, nurses, support staff, children, parents, politicians and members of both Broncos and Avalanche teams. June 8, 2000 - Baseball in field boots: Brooks was one of the celebrities on the roster for the Evening of Stars and Fireworks, a celebrity softball game featuring members of the Rockies, the Rapids, the Broncos, the Avalanche and the Nuggets. As the Denver Post's <mark>Joseph Sanchez</mark> wrote of the evening: \"It was country music star Garth Brooks, in farmhand field boots, trying to tackle <mark>Larry Walker</mark> of the Colorado Rockies in the pregame introductions at home plate...For the record, <mark>Walker</mark>'s Blue Stars defeated Brooks' Gray Stars 27-26 when Jon Klemm of the Avs slapped a Griese pitch over the centerfield fence in the bottom of the sixth inning, scoring Avs teammate <mark>Chris Drury</mark> ahead of him .\" And what about previous shows before his lengthy absence in Colorado? June 2, 1992 - McNichols Arena: As the Denver Post described the scene of Brooks' Colorado tour just before the release of his fourth studio album, \"The Chase\" : \"With his now familiar headset microphone, Brooks paced the length of the stage like a caged panther, using the ramps to work the audience along the sides and back of the arena. He played little guitar, opting to shake hands and hug members of the audience like a politician. Three songs into the set Brooks told the screaming throng:\" Six and a half months off and it took me one second tonight to figure out that this is where I belong .' Sept. 6, 1993 - Pueblo State Fair: Brooks headlined the Pueblo State Fair in 1993, where he accepted a rain of flowers from the fans. He even made a special request for crews to work non-stop to build a stage lower to the ground and closer to the crowd. \"It paid off,\" The Denver Post wrote. Google +. Or send us a telegram. Reverb Managing Editor <mark>Matt Miller</mark> has a really common name so please use these links to find his Google + page. Or just send him an email to mrmiller @ denverpost.com. Talib Kweli on the academics of hip-hop: \"When you have knowledge, you'll do better\" "}]