[{"date": "2015-12-08", "url": "http://www.aikenstandard.com/article/20151207/AIK0101/151209508/1002/AIK01/night-of-1000-lights-in-aiken-set-for-thursday", "content": "Night of 1,000 Lights in Aiken set for Thursday - Aiken Standard Night of 1,000 Lights in Aiken set for Thursday Email @ @ ChristinaNCleve Dec 7 2015 8:18 pm Aiken Standard File photo Luminaries light up downtown during a previous Night of 1,000 Lights. The event this year will be on Thursday. Thousands of lights will glow in downtown Aiken on Thursday for the annual Night of 1,000 Lights. Luminaries, weighed down by cans provided by Golden Harvest Food Bank, will line the streets and several shops will stay open later for downtown shoppers. Santa Claus and his elves will also be present at the event, which is hosted by the Aiken Downtown Development Association, or ADDA. \"It's just a fun, festive evening downtown,\" said Avery Spears-Mahoney, executive director of the ADDA. \"There's hundreds of people shopping and having dinner and it just kind of kicks off the season as far as the holiday shopping and enjoying all the downtown has to offer .\" Luminaries can be found along many of the streets downtown Thursday including The Alley, Laurens Street and Richland Avenue and participating shops will decorate their windows for a window decorating contest in between activities, Spears-Mahoney said. Gift wrapping will be set up outside, and area nonprofits are expected to offer sweets from cookies to hot chocolate and cider to patrons. The event runs from 6 to 8 p.m., though the shops stay open throughout the day and evening. <mark>Dan Smith</mark>, co-owner of Lionel Smith Ltd., is one of dozens of store owners who will extend their hours and said the men's clothing store participates each year. \"We have a lot of people walk in because it's beautiful downtown--a very\" Christmas-y,' old-town and nostalgic feeling, \"Smith said .\" Some people buy, not everyone purchases, some may come in later and buy (and) they generally use that night to come and look around. \"For those who are ready to purchase at the store Thursday, there will be an incentive .\" We do a Santa pick of the night and Santa will come through Wednesday night after we're closed and Thursday we'll have an item that might be discounted, \"Smith said .\" But we don't know what it is--Santa's elves do all of that work. \"3 Monkeys Fine Gifts will also offer special holiday deals, which were still in the works as of last week. Co-owner Kathy Reynolds said Night of 1,000 Lights is great for the community and business .\" It's a huge night for us, \"Reynolds said .\" It's a festive evening, brings out people from all over and it's always been well attended. It's a good night for us business-wise. We have great foot traffic and sales ....People of all ages are out on the street, and the entire downtown has a festive feel with the music and holiday activities. \"For more information on this year's Night of 1,000 Lights and participating businesses, visit www.downtownaiken.com or www.aikenismagical.com. Christina Cleveland is a general assignment reporter. Follow her on Twitter @ ChristinaNCleve. Keywords", "articleID": "2015120801_00340324_W", "names": {"Dan Smith": ["Q15906708", "Q16206931", "Q17579939", "Q5214397", "Q5214399", "Q5214400", "Q5214401", "Q5214402", "Q5214403", "Q5214404", "Q5214405", "Q5214407", "Q56404422", "Q9201145"]}}, {"date": "2015-12-08", "url": "http://juniorminingnetwork.com/junior-miner-news/press-releases/736-tsx-venture/elo/14489-eloro-resources-appoints-chief-technical-advisor-grants-stock-options.html", "content": "Market Data Eloro Resources Appoints Chief Technical Advisor, Grants Stock Options TORONTO, ONTARIO--(Marketwired - Dec. 8, 2015) - Eloro Resources Ltd. (TSX VENTURE: ELO) (FRANKFURT: P2Q) (\"Eloro\" or the \"Corporation\" ) is pleased to announce that the Corporation has appointed Dr. William N. Pearson (\"Bill\" ), P. Geo ., as Chief Technical Advisor to the Corporation. Dr. Pearson's role will be to provide valued independent oversight on all exploration, development, and potential mining on the Corporation's earn-in interest in the La Victoria Gold/Silver Property, Huandoval District, Pallasca Province, Ancash Department, Peru. Dr. Pearson has over 40 years of direct experience in global mineral exploration and production, and has played an integral role in creating the value in mining projects that has led to successful acquisitions. Key among these accomplishments were the roles he played as Vice President, Exploration of Desert Sun Mining Corp. (owner of the Jacobina Mine in Brazil) which was acquired by Yamana Gold Inc. for C $735 million in 2006; and as Executive Vice President Exploration of Central Sun Mining in its acquisition by B2 Gold in 2009. The Nicaraguan assets pioneered by Central Sun Mining have helped B2 Gold build a current market capitalization of C $1.4 billion. \"We are delighted to have Bill on board as Chief Technical Advisor,\" said Eloro Chairman and C.E.O.. Mr. <mark>Tom Larsen</mark>. \"As one of the most respected geologists in the industry today, Bill brings valued knowledge and experience relevant to everything we're doing at the La Victoria Gold/Silver Project in Peru .\" Dr. Pearson was the founding President and was directly responsible for the creation of the Association of Professional Geoscientists of Ontario, the licensing and regulatory body for all Geoscientists in Ontario, now numbering almost 2,000 registered Professional Geoscientists. He is also a recipient of the Distinguished Service Award of the Prospectors and Developers Association of Canada in 2015. The Corporation also announces the grant of stock options to an officer and an arm's length consultant to purchase 200,000 common shares of Eloro, exercisable at $0.12 per shares at any time on or before December 7, 2020. The grant is subject to TSX Venture Exchange acceptance and was made in accordance with and subject to the terms of Eloro's stock option plan. In accordance with securities regulatory requirements, any shares issued pursuant to the exercise of such options will be subject to a resale restriction for a period of four months from the date of the grant. About Eloro Resources Ltd.. Eloro is an exploration and mine development company with a portfolio of gold properties in Peru and base-metal properties in northern and western Quebec. Eloro has been granted an option to acquire a 60% interest in La Victoria property, located in the North-Central Mineral Belt of Peru. The La Victoria Property is free of royalties and consists of two adjacent, but not contiguous, properties totalling eight mining concessions encompassing approximately 35 square kilometres. The La Victoria Property is within 50 kilometres of several producing mines, with three producers visible from the property, which has good infrastructure with road-access and nearby sources of water and electricity. Information in this news release may contain forward-looking information. Statements containing forward-looking information express, as at the date of this news release, the Corporation's plans, estimates, forecasts, projections, expectations, or beliefs as to future events or results and are believed to be reasonable based on information currently available to the Corporation. There can be no assurance that forward-looking statements will prove to be accurate. Actual results and future events could differ materially from those anticipated in such statements. Readers should not place undue reliance on forward-looking information. Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release. Eloro Resources Ltd. .", "articleID": "2015120812_00431619_W", "names": {"Tom Larsen": ["Q12006643", "Q12343243"]}}, {"date": "2015-12-08", "url": "https://www.trunews.com/activists-try-to-silence-global-warming-skeptics-at-un-summit/", "content": "Activists Try To Silence Global Warming \"Skeptics' At UN Summit Home> Earth Changes> Activists Try To Silence Global Warming\" Skeptics' At UN Summit Activists Try To Silence Global Warming \"Skeptics' At UN Summit By Reuters on December 8, 2015 Pin It Environmentalists are trying to marginalize and intimidate skeptics attending the United Nations global warming summit in Paris. Competitive Enterprise Institute senior fellow Chris Horner was strolling the streets of Paris around the U.N. conference when he saw a wanted poster with his headshot on it. The poster, from the environmental group Avaaz, labels Horner a\" Climate Criminal \"who is a lobbyist for the\" carbon industry \"who's a\" climate skeptic. \"\"Having bragged about the honor on my first book's cover nearly nine years ago, I'd say it's getting a little long in the tooth,\" Horner tells The Daily Caller News Foundation. \"If memory serves they first broke out the wanted-poster motif at the Montreal COP; <mark>Lisa Jackson</mark> /' Richard Windsor' somewhat hysterically decried my FOIA efforts as\" criminal. \"'\" Left unmentioned is the FOIA work is mere flattery of Greenpeace's, following in its footsteps from the University of Virginia to the Smithsonian and elsewhere, \"Horner says. Horner's unfazed by the poster, but it's just another example of how environmental activists are trying to silence skeptics attending the U.N. summit--a summit being hailed as the\" last chance \"to save the planet from environmental catastrophe. Environmentalists recently called for the U.N. to eject all skeptics from the Paris talks. Activists were furious that the Heartland Institute, an American conservative group, showed a new documentary called\" Climate Hustle \"that debunks claims made by environmentalists sounding the alarm on global warming .\" One notorious oil industry-funded climate denier is debuting a documentary film full of lies and misinformation, \"the activist group SumOfUs says in a fundraising letter .\" Some of the \"world's most notorious climate deniers' had crashed the French proceedings\" in a last-minute & shy; attempt to derail the whole thing'. \"While it's not true that\" Climate Hustle \"is funded by the oil industry--it's funded by 1,500 citizen supporters--it shows just how far environmentalists are willing to go to trash global warming skeptics .\" We are even hearing that James Inhofe--the US senator who wrote a book calling global warming the \"greatest hoax ever perpetrated'--is on his way,\" SumOfUS says. Left-wing politicians and their environmentalist allies are desperate to get countries to agree to a successor to the Kyoto Protocol in Paris. Expectations are high for a global agreement to cut carbon dioxide emissions, but even if such a deal is struck it's unclear if it will be enforceable. The U.S. and Europe called for conflicting visions of what a U.N. climate deal will look like. Europeans want a legally binding treaty on CO2 emissions, but U.S. leaders have sent conflicting messages on what they want from a treaty. Secretary of State <mark>John Kerry</mark> says a U.N. treaty will not be legally binding so it won't have to go before a Republican-controlled Senate where it will certainly be voted down. <mark>Kerry</mark> did walk back his comments a bit, and President Barack Obama has called for a treaty to be legally binding. Read more: http: //dailycaller.com/2015/12/07/activists-make-wanted-posters-of-skeptics-paris-climate-summit/ #ixzz3tlpK1m3a global warming slider ticker UN About Reuters Thomson Reuters is the world's leading source of intelligent information for businesses and professionals and is affiliated with TruNews. We combine industry expertise with innovative technology to deliver critical information to leading decision makers in the financial and risk, legal, tax and accounting, intellectual property and science and media markets, powered by the world's most trusted news organization. Thomson Reuters shares are listed on the Toronto and New York Stock Exchanges (symbol: TRI).", "articleID": "2015120822_00550063_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "Lisa Jackson": ["Q16218554", "Q27469861", "Q445734", "Q476660", "Q6557964", "Q8927305"]}}, {"date": "2015-12-08", "url": "http://chicago.suntimes.com/baseball/7/71/1165768/cubs-build-pitching-depth-radar-moves", "content": "Cubs build pitching depth with under-the-radar moves Cubs build pitching depth with under-the-radar moves Written By Gordon Wittenmyer Posted: 12/08/2015, 11:31 pm Sign-up for Chicago Sun-Times newsletters. Breaking News Alerts The Cubs acquired <mark>Adam Warren</mark> from the Yankees for Starlin Castro Tuesday night. NASHVILLE, Tenn.--It didn't take the Cubs long splashing around in the deep end of the off-season pitching pool to decide on some different strokes for accomplishing their pitching goals this winter. Whether it leads to the division-championship season they have in mind for 2016, they've at least preserved immediate payroll flexibility and potential flexibility for the next two or three years during a period of relatively limited resources. \"As we looked into the starting pitching markets aggressively, both the free agent market and the trade market, we really came to feel like the <mark>price</mark> of poker was very high to acquire starting pitching,\" team president Theo Epstein said. That's why the Cubs struck as swiftly as they did to sign veteran John Lackey to the two-year, $32 million deal that was struck Friday and became official Tuesday--a deal that might have been impossible to get done if it hadn't been finalized before Zack Greinke's record-setting $34.4 million-a-year deal was reached with the Diamondbacks. That's also why right-hander <mark>Adam Warren</mark> looked especially attractive in Tuesday's salary-driven trade of Starlin Castro to the Yankees. <mark>Warren</mark>, 28, is a first-year arbitration-eligible player who has a 3.39 career ERA, mostly as a reliever, and a fastball that touches 95 mph out of the bullpen (92-93 when he starts). He went 7-7 with a 3.29 ERA in a 2015 season that included 17 starts. And he quickly became a modestly priced, controllable player for a Cubs staff that is starting to look thick with effective, versatile pitchers--if not the marquee Greinke and <mark>David Price</mark> types. \"Years and dollars were really significant for starters of note in free agency and came with a significant amount of risk, frankly, that we weren't completely comfortable with,\" Epstein said. \"And in the trade market we felt like in a lot of cases we would have liked to pay like two dollars on the dollar almost in return .\" That was especially true of talks with the Braves over starter Shelby Miller. Sources say the <mark>price</mark> for Miller seemed to get steeper the longer the Cubs talked with the Braves--who eventually got an eye-popping haul for Miller on Tuesday from the Diamondbacks, including shortstop prospect Dansby Swanson, this year's No. 1 overall draft pick. The Cubs have a top four in the rotation of Jake Arrieta, Jon Lester, Lackey and Jason Hammel. They have potential fifth starters in <mark>Kyle Hendricks</mark> and <mark>Warren</mark>, or possibly Clayton Richard or Trevor Cahill. And they're on the way to a power-pitching bullpen with a left-right balance and versatile long and/or situational pitchers. \"You can have impact pitching without necessarily having all household names, sort of bona fide, top-of-the-rotation guys,\" Epstein said. \"We still have to go out and accomplish it, but if you have a staff where there's no negative contributors, no replacement-level pitchers, but all solid, contributing pitchers who throw strikes and can follow a game plan and miss bats and be effective, that in and of itself can make you one of the best pitching staffs .\" I like to think if everyone pitches up to their potential next year we're getting close to that ideal. \"National & World News", "articleID": "2015120905_00385418_W", "names": {"Adam Warren": ["Q2824023", "Q4679945", "Q4679946", "Q901842"], "David Price": ["Q1176177", "Q16063598", "Q20804677", "Q20973688", "Q332804", "Q37830471", "Q5238707", "Q5238709", "Q5238711", "Q5238712", "Q5238713", "Q5238714", "Q5238716", "Q56072488", "Q56952850", "Q634326", "Q984010"], "Kyle Hendricks": ["Q17182882", "Q17198188"]}}, {"date": "2015-12-09", "url": "http://www.goerie.com/PD-Eagles-Notebook-Eagles-Kiko-Alonso-Facing-Bills-will-be-fun-1209", "content": "THIS IS not going to be a fun week to be Kiko Alonso. The guy the Eagles got when they traded LeSean McCoy has not returned to the form that made him the NFL's defensive rookie of the year for Buffalo in 2013. In fact, to Eagles fans, that form might seem about as far away and as relevant as Nick Foles' 27 touchdown passes vs. two interceptions, the same year. \"The fact that I got traded for (McCoy) has no relevance at all,\" Alonso said Tuesday. \"It's really just, the guy's a great player. We're going to have to be on top of our game and run to the ball and play sound football to stop that guy .\" The Alonso that Eagles fans have seen missed five weeks after suffering an injury to his repaired left knee, which had cost him all of 2014, and he seemed to be playing in slow motion when he returned. Because they were in nickel and dime packages most of the New England game, the Eagles left Alonso on the field for 70 snaps, and both Eagles coach Chip Kelly and defensive coordinator <mark>Bill Davis</mark> felt the need to say they'd overextended Alonso, that they needed to balance the inside linebacker snaps more. Mychal Kendricks had 48 and DeMeco Ryans had 21. Kendricks and Ryans have missed time with hamstring issues this season and are struggling in space. \"It showed up very late in the game, where he was gassed,\" <mark>Davis</mark> said Tuesday. \"I think at the very end there, where Kiko had a couple plays where he fell or he was just exhausted, we should have made a switch there. But we are happy with Kiko and Mychal. We have to get some coverage things down techniquewise, but they're good athletes with good football awareness, and will play better and better as we go .\" Specifically, Alonso fell down and left Patriots running back <mark>James White</mark> open for a huge catch on fourth-and-12, helping lead to the touchdown that put New England within seven points. \"Naw, man, it's another week,\" Alonso said Tuesday, when asked if there might be anything different about playing McCoy and his old team. \"It'll be fun because, obviously, I know those guys,\" he said. Asked how he thought he played against the Pats, Alonso said, \"Good. I thought I gave up some plays, I made some plays .\" Alonso said he did not feel worn down by the end. Asked if things have gone the way he'd hoped here, Alonso said, \"Yeah .\" The way <mark>Davis</mark> talked about McCoy Tuesday, it was hard to envision why the Eagles would ever trade such a player. \"Shady's on top of it right now. He's playing the best you've seen him play,\" <mark>Davis</mark> said. All three of McCoy's 100-yard games this season have come in the last five outings. \"He's peaking right now, like he does a lot of times,\" <mark>Davis</mark> said. \"I think always in November and December, you've seen him be at his best. It looks like he's in great shape .\" They're feeding him the ball a lot. He's being Shady - he's making the cuts and stopping on a dime and changing directions and making plays when they aren't there. We're going to have our hands full, and we look forward to the challenge. We know he's going to be at his absolute best. He'll be the best blocker, the best runner and the best pass protector that you can be. He'll be fired up for this game, but so will we. \"<mark>Davis</mark> said having practiced against McCoy would be of limited value for his players .\" It's not the full speed. Shady is about full speed, \"<mark>Davis</mark> said .\" His start-and-stop and perimeter run is second to none, and he sees the field. You see him in one gear in practice, and then there's another gear to Shady that shows up in the game that we have to be ready for, and we will be. \"Means to an end The Eagles filled Miles Austin's roster spot with 26-year-old Steven Means, an outside linebacker signed off the Houston Texans' practice squad. Means, 6-3, 263, worked out for the Eagles in October, before going to Houston. He was drafted out of the University of Buffalo by Tampa Bay in the fifth round in 2013 and played in 10 games as a rookie. Cut in 2014, he played one game for Baltimore. It's late to teach anyone your offense or defense and really expect them to contribute. This is the time of year when teams sign players off other teams' practice squads with an eye toward next spring and summer .\" Similar defense when I was with the Ravens, and Houston was 3-4, \"said Means, who obviously would prefer to get on the field sooner rather than later. He was a 4-3 d-end in college and with the Bucs, but said he likes the 3-4 stand-up view. Going forward, it will be interesting to see if Means' presence affects 2014 first-round pick <mark>Marcus Smith</mark>'s status. Birdseed Defensive lineman Bennie Logan (knee) sat out practice Tuesday...Safety Malcolm Jenkins said LeSean McCoy\" has a specific skill set, \"which made Shady sound a bit like Liam Neeson...Asked if it felt like the Eagles have a\" second chance, \"now that they're tied at 5-7 with the Giants and Redskins, Jenkins said:\" I think we've had about five second chances, to be honest...However we got here, we are right where we want to be. Everything up until this point is really null and void. Our playoffs start this week. \"On Twitter: @ LesBowen Blog: ph. ly/Eagletarian\" \"\"\"\"\"& Acirc; & copy; 2015 the Philadelphia Daily News Visit the Philadelphia Daily News at www.philly.com Distributed by Tribune Content Agency, LLC. _____ Topics: t000046469, t000003194, t000003183", "articleID": "2015120916_00777964_W", "names": {"Bill Davis": ["Q16186209", "Q16197639", "Q16203810", "Q2903187", "Q29033571", "Q4908704", "Q4908706", "Q4908707", "Q4908709", "Q4912434", "Q862052"], "James White": ["Q15451493", "Q16018627", "Q16105007", "Q17141088", "Q19578234", "Q23760213", "Q2540459", "Q27831214", "Q38804225", "Q43915057", "Q50652502", "Q57572486", "Q6145405", "Q6145421", "Q6145425", "Q6145429", "Q6145434", "Q926014"], "Marcus Smith": ["Q16235030", "Q30122761", "Q59162330", "Q6758457", "Q6758458"]}}]