[{"date": "2015-12-10", "url": "http://poststar.com/entertainment/national/nkorea-s-kim-jong-un-sends-all-female-band-to/article_5493307d-6da3-5409-8404-54cb027d5dfb.html?comment_form=true#comments", "content": "NKorea's <mark>Kim Jong Un</mark> sends all-female band to sing in China Agreement has been hard to come by in Hollywood's awards season, even when it comes to who's in the hunt for what. Recent Tonight, for my family's dining pleasure, we will be enjoying a large plate of fluffy scrambled eggs with a tempting side of toasted hamburger buns. Recent NKorea's <mark>Kim Jong Un</mark> sends all-female band to sing in China Saved 2015-12-10T01:41:19 ZNKorea's <mark>Kim Jong Un</mark> sends all-female band to sing in ChinaThe Associated PressThe Associated Press1 hour ago (0) Comments BEIJING (AP)--An all-female band formed by <mark>Kim Jong Un</mark> will perform behind closed doors at Beijing's iconic performing arts center Thursday on a visit to cultivate better ties with China. The Moranbong Band, a group of women who sing and play instruments including violins, electric guitars and keyboards in short dresses and high heels, was set up by the North Korean leader in 2012. Its look is similar to pop bands from the North's hated rival, South Korea, but it has performed on stages in front of a giant screen showing various images of <mark>Kim Jong Un</mark> and a missile launch. The band will play alongside another North Korean musical troupe, the State Merited Chorus, at the National Center for Performing Arts for three nights starting Thursday. The performances are not open to the public, according to various people reached at the center who could give no details on who was invited. North Korea's state news agency, Korean Central News Agency, said the trip was a \"friendship visit .\" It said the Moranbong Band has played an ideological and cultural role in North Korea, \"arousing all the service personnel and people .\" Relations between China and North Korea have been strained since the accession in 2011 of <mark>Kim Jong Un</mark>, who seems to have focused on domestic politics to the detriment of relations with its traditional ally, China. The North Korean leader still has not visited Beijing. Chinese Foreign Ministry spokeswoman Hua Chunying said Wednesday that China would like to continue to developing friendly ties with its neighbor. \"Whether it's North Korea, Japan or any other country, we believe any form of civilian exchange and cooperation will boost understanding and friendship among the people,\" Hua said. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. No Comments Posted. RULES FOR COMMENTING ONLINE 1) Comments must be contained to the topic of the articles only. Comments that stray from the direct subject of the article will be deleted. 2) Readers are free to comment on and debate other readers' comments, but comments must specifically address the issue (s) raised. Comments containing personal insults directed toward another reader in any form will be deleted. 3) Comments must be civil in tone, and there will be no name calling of any kind. Uncivil or inappropriate comments will be deleted, as will any comment containing profanities. 4) Comments critical of crime or accident victims will be deleted. 5) Comments that are potentially libelous, including those that contain accusations not supported by facts, will be deleted. Commenters who abuse these policies will have their e-mail registrations revoked.", "articleID": "2015121007_00577369_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2015-12-10", "url": "http://stamfordadvocate.com/news/crime/article/For-police-shootings-reinforce-need-for-6687070.php", "content": "http: //www.stamfordadvocate.com/news/crime/article/For-police-shootings-reinforce-need-for-6687070.php For police, shootings reinforce need for military-style gear <mark>Michael</mark> Kunzelman, Associated Press Updated 10:39 pm, Wednesday, December 9, 2015 Photo: Charlie Riedel, AP Image 1of/2 Caption Close Image 1 of 2 FILE - In this Aug. 17, 2014 file photo, a law enforcement officer watches from an armored vehicle after a device was fired to disperse a crowd during a protest for <mark>Michael Brown</mark>, in Ferguson, Mo.. Law enforcement officials have lobbied to protect federal programs that have funneled billions of dollars in high-powered weapons and other military-style equipment to state and local police forces, calling the equipment critical in this era of terror threats and the all-too-frequent mass shootings that demand a swift and effective response. FILE - In this Aug. 17, 2014 file photo, a law enforcement officer watches from an armored vehicle after a device was fired to disperse a crowd during a protest for <mark>Michael Brown</mark>, in Ferguson, Mo.. Law...more Photo: Charlie Riedel, AP Image 2 of 2 FILE - In this Wednesday, Aug. 13, 2014 file photo, protesters raise their hands in front of police atop an armored vehicle in Ferguson, Mo.. The use of such vehicles has raised an essential question: How much is too much for officers to use in policing American streets? Law enforcement officials have lobbied to protect federal programs that have funneled billions of dollars in high-powered weapons and other military-style equipment to state and local police forces, calling the equipment critical in this era of terror threats and the all-too-frequent mass shootings that demand a swift and effective response. FILE - In this Wednesday, Aug. 13, 2014 file photo, protesters raise their hands in front of police atop an armored vehicle in Ferguson, Mo.. The use of such vehicles has raised an essential question: How much...more Photo: J.B. Forbes, AP For police, shootings reinforce need for military-style gear 1 / 2 Back to Gallery Backlash over the images of protesters in Ferguson, Missouri, clashing with officers in combat gear drove an ongoing national push to scale back the militarization of police--an effort that has mostly steamrolled over concerns among law enforcement that they're losing equipment they need. In the span of six days, police suddenly have a pair of poster cases for the use of military-style equipment: In San Bernardino, California last week, police officers deployed armored vehicles at the scene of a shootout with a married couple who had killed 14 people at a holiday party. Just days before the California attack, officers in Colorado Springs, Colorado, used armored vehicles to rescue people from the area around a Planned Parenthood clinic where a gunman killed three people, including an officer. It's too soon to say whether the California and Colorado cases will be enough to quiet calls for demilitarization, but they have brought back the essential question: How much is too much for officers to use in policing American streets? The scene in San Bernardino, captured live on television, showed officers in tactical gear using two armored trucks and an armored tractor equipped with a shield to box in the SUV carrying Syed Farook and his wife, Tashfeen Malik, after the shootout ended. The couple had fired 76 rounds but were countered by 380 rounds fired by officers, authorities said. \"This type of equipment is critical for us to protect our officers,\" San Bernardino County Sheriff <mark>John McMahon</mark> told The Associated Press. Colorado Springs relied on their armored personnel carrier and a second, bigger one belonging to the El Paso County Sheriff's Office to rescue the wounded and others in the line of fire during the Nov. 27 mass shooting there, Police Chief Pete Carey told council members Monday. The vehicles \"both sustained pretty severe damage as a result of that,\" Carey said. \"They took a lot of rounds .\" Missouri State Sen. Maria Chappelle-Nadal, whose district includes Ferguson, said it's difficult to compare the police tactics she has seen on television after the recent mass shootings with what she witnessed during the 2014 protests over the police killing of unarmed black teen <mark>Michael Brown</mark>. \"They're not the same at all,\" said Chappelle-Nadal, who said she was tear-gassed during the Ferguson riots. \"There's a distinction between national security and social and economic inequality .\" The gear that looked jarringly out of place in Ferguson can be essential tools for properly trained officers who know when they are appropriate to deploy, said Norm Stamper, a retired Seattle police chief who has become a prominent voice for restrained use of such equipment since his department's widely criticized handling of protests at the 1999 World Trade Organization meeting. \"It's also terribly important that the police not overreact to everyday situations by trotting that equipment out,\" he said. Fallout from Ferguson led to some restrictions on federal programs that have funneled billions of dollars in high-powered weapons and other military-style equipment to state and local police forces. In May, President Barack Obama ordered a halt in transferring certain types of surplus military equipment to law enforcement agencies enrolled in a popular Defense Department giveaway known as the 1033 program. More recently, federal officials have ordered departments to surrender some property already in their possession--most notably, vehicles with tracks, such as tanks. The moves have angered police officials, who say they're losing an affordable pipeline to equipment that can save lives. Several Republican congressmen and at least one U.S. senator also denounced the program changes in the wake of San Bernardino. \"As I watched the tragedy in San Bernardino unfold last week, I noticed the equipment that local and other law enforcement agents used to track and ultimately neutralize the murderers,\" U.S. Sen. Richard Shelby, R-Alabama, wrote in a letter to the president Monday. \"Like all Americans, I was glad to see that those local agents relied on ballistic armored vests, helmets, and vehicles to prevent injury and the loss of life to officers and the community they were protecting .\" The armored vehicles used in San Bernardino belong to a regional SWAT team, which was called in to safely remove the slain gunmen from their vehicle. The vehicles were purchased with a mix of Department of Homeland Security grant money and funds from a federal program that allows police to share proceeds from asset seizures, said Rialto Police Capt. Andrew Karol, whose department is part of the team. The same DHS grant program also allowed the El Paso County Sheriff's Office to acquire an armored vehicle used at the Planned Parenthood shooting. As of Tuesday, the Defense Department's Defense Logistics Agency has taken back 52 of 126 tracked armored vehicles, 46 of 138 grenade launchers and 556 of 1,820 bayonets it had ordered returned, according to agency spokeswoman Michelle McCaskill. In Oakland County, Michigan, Sheriff <mark>Michael</mark> Bouchard had to surrender a tracked armored vehicle along with about a dozen bayonets that his department used for funerals and honor guards. Bouchard said he traveled to Washington several times to meet with Obama administration officials when they were reviewing the programs. \"They had a preconceived notion and were going to drive to that destination with or without our consent,\" Bouchard said. \"The whole thing seems to be driven by perception and not reality .\" The California and Colorado shootings haven't softened activist Zaki Baruti's views on the perils of militarized police forces. Baruti said he was stunned to see camouflage-wearing officers atop armored vehicles point rifles at protesters during the marches he helped organize in Ferguson. \"It looked like we were in Iraq,\" he recalled. \"The looks on their faces were saying,\" Do something so we can use this .' \"Stamper, the retired Seattle chief, said the equipment itself isn't the problem .\" It's the misuse of the equipment, \"he said .\" I think, through mission creep, we have allowed almost anything to be identified as high risk. If almost anything looks like a nail, you're going to bring out a hammer. \"___ Kunzelman reported from Baton Rouge, Louisiana. Follow him on Twitter at https: //twitter.com/Kunzelman75. His work can be found at http: //bigstory.ap.org/content/michael-kunzelman. Associated Press writer Sadie Gurman in Denver contributed to this report. Follow her at https: //twitter.com/sgurman. Her work can be found at http: //bigstory.ap.org/journalist/sadie-gurman. View Comments & copy; 2015 Hearst Communications, Inc. .", "articleID": "2015121016_00627103_W", "names": {"John Mcmahon": ["Q27915237", "Q27915238", "Q6248117", "Q6248119", "Q6248121"], "Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"]}}, {"date": "2015-12-10", "url": "http://hawaiinewsnow.com/story/30712814/the-latest-new-climate-draft-shows-headway-on-key-issues", "content": "The Latest: New climate draft shows headway on key issues - Hawaii News Now - KGMB and KHNL The Latest: New climate draft shows headway on key issues - Hawaii News Now - KGMB and KHNL Member Center: EEO Public File Reports 2015 The Latest: New climate draft shows headway on key issues (AP Photo/Francois Mori). A participant holds a poster amid NGO representatives staging a sit-in protest closed to the plenary session to denounce the first draft COP21 Climate Conference agreement, and put pressure to reach an international agreement...LE BOURGET, France (AP) - The latest news related to the U.N. climate conference outside Paris, which runs through Dec. 11. All times local: 10:30 p.m. French Foreign Minister Laurent Fabius has presented a new draft of a global climate accord showing governments have made progress on some crunch issues but still disagree on others. The 27-page draft released late Thursday - two pages shorter than a previous version - suggested negotiators have settled on a long-term goal of keeping global warming \"well below\" 2 degrees Celsius (3.6 degrees F), while pursuing efforts to limit the temperature rise to 1.5 degrees C. The draft says governments \"aim to reach the peaking of greenhouse gas emissions as soon as possible .\" Previous drafts included stronger options with more specific timeframes. The draft still contained competing options on the key issue of transparency - making sure countries follow through on their emissions targets. The text included an option asking for different rules for rich and poor countries, which the former have said is unacceptable. Negotiators were given two hours to review the draft and then to come back and continue the talks. \"I think, I hope that by the end of this night we'll have a draft of the final text,\" Fabius said. \"We are much closer .\" 9:10 p.m. President Barack Obama and French President Francois Hollande (frahn-SWAH' oh-LAWND') are reviewing what progress has been made toward completing a global climate agreement. Obama and Hollande spoke by phone on Thursday about the status of the talks. The White House says both leaders underscored their \"firm commitment\" to cooperating to reach an ambitious and sustainable pact. Negotiators have been struggling to narrow down a 29-page draft of the sweeping deal to try to slow global warming. But countries remain at odds on critical issues. The deadline to finish the deal is Friday, although the talks could be extended beyond the deadline. The White House says Obama also thanked Hollande for sending France's aircraft carrier to the Persian Gulf to help in the fight against the Islamic State group. 4:45 p.m. International migration officials want a global climate accord under discussion to address the growing risk of migration because of extreme weather. The director of the International Organization for Migration, William Lacy Swing, said the planet is seeing more forced migration today than any time since World War II, and seeing what he called \"unprecedented anti-immigration sentiment .\" \"If we add the effect of climate change...you really have the elements of a perfect storm,\" he said on the sidelines of the Paris climate talks \"We are here...to find out how to weather that storm .\" Jan Egeland, head of the Norwegian Refugee Council, said \"every second, a person is forced to flee because of an extreme weather event .\" At least 19.3 million people worldwide were driven from their homes by natural disasters last year, most related to weather events, according to the Geneva-based Internal Displacement Monitoring Center. 4:30 p.m.. The chief United Nations environment officer is still optimistic that a deal will be hammered out soon. \"We're now down to some of the so-called red line issues, some of the defining issues in the convention that have to do with principles,\" said Achim Steiner, United Nations Environment Program director. \"I think the fact that we are now essentially left with maybe 3 or 4 issues that need to have a political compromise negotiated and formulated should give us courage and hope that we are actually moving to an agreement .\" Steiner said he thinks the final issue will be differentiation between rich and poor nations, calling it \"one of the defining principles of where the convention began its journey .\" Steiner said he is still hoping to end talks Friday night as the French have promised. 3:35 p.m. Europe's top representative at U.N. climate talks has accused China of blocking proposals for countries to update their carbon pollution targets every five years, which he called critical for a deal in Paris. EU Climate Commissioner Miguel Arias Canete told reporters Thursday \"without the five-year cycles, the agreement is meaningless .\" Canete said Chinese negotiators are opposed to making five-yearly updates a requirement in the agreement even though they agreed to such reviews before the Paris talks. More than 180 countries have presented emissions targets for after 2020, when the envisioned deal is supposed to take effect. Scientific analyses show those targets won't be enough to limit global warming to 2 degrees Celsius compared with pre-industrial times, the overarching goal of the climate talks. Canete says \"unless you come back every five years to update your targets, you can never reach the long-term goal .\" China, the world's biggest carbon polluter, has pledged to peak its emissions \"by approximately 2030 or sooner .\" 3:05 p.m. U.N. Secretary-General Ban Ki-moon says he is \"reasonably optimistic\" that countries will reach a strong agreement to slow global warming at Paris talks scheduled to finish Friday. Ban met Thursday at the climate conference with former U.S. Vice President Al Gore and non-governmental organizations seeking a robust deal. Calling this a \"a very critical moment,\" Ban said \"I am hopeful and I'm reasonably optimistic that we will be able to have for the first in the history of the United Nations a universal and very ambitious climate change agreement, which will make our human beings lives healthier and more prosperous .\" The last global accord on global warming, the 1997 Kyoto Protocol, only required rich countries to cut emissions. The climate change accord currently under negotiation would require all countries to pitch in. 2:10 p.m. Activists have a new way of trying to increase pressure on negotiators at the Paris climate talks - with caricatures of big-headed world leaders and piped-in voices from people around the world who want a robust agreement to fight global warming. Advocacy group Oxfam performed a skit Thursday at the talks with protesters wearing oversized \"big head\" masks representing world leaders. The big heads slept as an alarm clock rang, trying to rouse them to act to slow down climate change - but the heads stayed asleep. Nearby, a pyramid of boxes and speakers broadcast voices recorded by activist group Avaaz. A cacophony of languages and pleas resonated in an effort to remind negotiators of concerns of people from countries vulnerable to rising seas and increasingly extreme weather caused in part by man-made carbon emissions. Many activist groups want the Paris accord to call for an end to fossil fuel use in the long term and to back firm pledges by rich countries to help poor countries pay for future damages caused by climate change. 2 p.m. U.S. Secretary of State <mark>John Kerry</mark> says Paris climate talks are \"getting down to the critical stage,\" as he meets negotiators from developing countries at the high-stakes conference. Meeting Indian Environment Minister Prakash Javadekar, <mark>Kerry</mark> said \"we need to work on language and that's what most of today and tonight will be .\" He and Javadekar didn't elaborate on differences in their positions. Many sticking points remain among delegations over which countries should take the most responsibility for fighting man-made global warming. Javadekar said, \"We have discussed all issues and whatever the differing views on different positions and we are working toward...because we want Paris to succeed. We want future generations to get a right and good deal from Paris and to that end we work, and I think today's meeting was a productive meeting .\" <mark>Kerry</mark> is also meeting negotiators from Brazil and Malaysia on Thursday, and will meet later with talks host, French Foreign Minister Laurent Fabius. 11:30 a.m. U.S. Secretary of State <mark>John Kerry</mark> is meeting with the environment ministers of two of the largest developing nations as negotiators try to hammer out details of a global accord on climate change by the end of the week. <mark>Kerry</mark> was holding talks at the Le Bourget conference site outside of Paris on Thursday with the environment ministers of Brazil and India, according to the State Department. No details of the meetings were immediately available but Brazil and India are among the biggest nations demanding that richer countries pay and do more to reduce carbon emissions. <mark>Kerry</mark> is expected to meet with numerous other negotiators who produced a 29-page draft agreement on Wednesday. Much more remains to be resolved to get a final deal by Friday's self-imposed deadline. 11:05 a.m. Diplomats and climate negotiators worked almost until dawn and have now resumed talks, narrowing down options in a 29-page draft of a global accord to tackle climate change a day before a self-imposed deadline for the unprecedented agreement. A French diplomat said talks outside Paris continued until about 5 a.m. Thursday (0400 GMT, 11 p.m. EST Wednesday) before resuming midmorning. The diplomat said a new draft of the accord is expected to be released sometime Thursday. He spoke on condition of anonymity because he wasn't authorized to speak publicly about the negotiations. The French organizers of the two-week talks want a final agreement by Friday night, though U.N. climate conferences rarely end on time. The draft released Wednesday left major issues unresolved. By Angela Charlton Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2015121023_00051578_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2015-12-09", "url": "http://www.mercurynews.com/eat-drink-play/ci_29199998/weekend-getaway-arty-ojai?source=rss", "content": "Weekend getaway to arty Ojai By Amber Turpin Posted: 12/08/2015 12:00:00 PM PST Updated: 12/09/2015 02:48:25 PM PST The rosy wash of the setting sun illuminates the Topatopa Mountains near Ojai, where residents call the stunning phenomenon \"the pink moment .\" (Michael McFadden/Ojai Visitors Bureau) OJAI--It was on a recent trek to this artists colony just east of Santa Barbara that I experienced my first pink moment. The fading sunlight washed across the Topatopa mountain range, setting it ablaze with rosy light. It's a stunning natural phenomenon, and one fitting for a town so rich in sensory appreciation. Ojai has long attracted artists, writers and others interested in delving deep into the creative side of life, and the town continues to evolve, offering new ways for visitors to discover their own artistic souls. Sensory blending takes many different forms here, where art infuses everything, from galleries and studios to the farmers market and cocktail bar. Ojai's historic post office tower is illuminated by the setting sun. (Joe Virnig/Ojai Visitors Bureau) Tucked away in the center of the luxe Ojai Valley Inn & Spa, you will find the Artist Cottage & Apothecary. This distinctive hideaway offers guests experiential art exploration classes, from basic drawing to Japanese paper-folding and dyeing. I'm here for the very popular tile-painting class, where instruction, supplies and even a nice cup of local Zhena's tea all are provided. I just have to decide what to paint. It's tempting to try to replicate the wonder of the pink moment, but more than a tad overreaching. Instead, I opt for a freehand zigzag pattern. Advertisement But my attention is soon diverted by what's happening in the adjoining apothecary, where more than 40 base scents, from lavender and rose to sandalwood, are on display, and you can concoct a custom perfume in the aroma-blending class. They even keep a database of sorts, so your carefully chosen scent portfolio stays on file, in case you want to get another bottle down the road. Day two brings me to dabbling in zigzags of a different type. \"A mandala is made to center you, to focus you,\" says teacher Bernadette DiPietro, explaining the geometric designs within Buddhism that symbolize the entire universe, and are often used in meditation. DiPietro teaches interactive art classes, including a make-your-own mandala class, in her studio off a downtown side street. Her space is adorned with inspiration from her vast travels--she teaches art on a cruise ship for several months each year--as well as a lifetime of work grounded in this region. DiPietro has lived and worked here since 1971 when, she says, the \"sunshine brought me\" from the East Coast. I'm stationed at my own little desk with a single piece of white paper, blank except for a small blue - and pink-feathered focal point. This design called to me more than the others--DiPietro instructed us to choose the one that beckons the most--and is the kickoff point for creating my own unique mandala. After stocking up on a variety of supplies--colored pencils, glitter pens, stencils and round tracing objects--the embellishment begins. The calm that comes over the room as we contemplate mandala patterns is palpable. It's evidence, DiPietro says, of why \"adult coloring books are really big right now .\" We essentially are making our own mandala-themed coloring page that we can revisit as much as we desire. It's a work in progress and can be a tool to finding quiet reconnection. But creativity isn't always quiet. Every Sunday at Heather Stobo and Lisa Casoni's aptly named Porch Gallery, a contemporary art gallery in what was once the town funeral home, local musician <mark>Dave Palmer</mark> drops by to play the piano. Music wafts over to the farmers market next door, inspiring shoppers to grab some food and head for the gallery's wraparound porch, where they can nibble and sip coffee as they listen and linger. As I revel in the artful atmosphere, a small, bright red pop of color catches my eye. It's from the gallery's \"Rock the Glass\" cocktail glassware series, which includes Tomatomania! pint glasses with hand-drawn crimson icons by artist Sam Hamann--and a recipe for a tequila-based Tomato Sunrise. \"The concept is that we are pairing mixologists and artists,\" Stobo says. The result, Casoni adds, is \"all kinds of cross tie-ins .\" Folks have been having fun with the glassware project, celebrating thematic events--such as the Kentucky Derby with mint juleps served in artist Katie Van Horne's horse-themed glasses--and bringing a community together, quite literally, over drinks. On the lawn outside, a huge chalkboard--with the prompt \"Before I Die...\"--coaxes some soulful contributions from the public. I fish out a fuchsia-toned piece of chalk and, without hesitation, add the words:\" Watch another pink moment. \"If You Go", "articleID": "2015121100_00254381_W", "names": {"Dave Palmer": ["Q15919849", "Q5229518"]}}, {"date": "2015-12-12", "url": "http://www.latimes.com/la-greatreads-html-20151212-htmlstory.html", "content": "Great Reads: Of love and loss, of hawks and holidays Robyn Hey there. I'm Kari Howard, and I edit the Great Reads (a.k.a. Column Ones) for the Los Angeles Times. Two of my biggest loves are narrative journalism and music, and I'm lucky that my days are filled with both: When reading the stories, I get inspired by songs I think fit the article's theme--a soundtrack. This week, much of the staff is still devoting its talents and resources to the aftermath of the San Bernardino shootings, and only one Great Read ran. So here's an abbreviated newsletter, focusing on a few of my favorite things outside the lovely world of the L.A. Times. Subscribe to the newsletter She decided she didn't want to be a \"white madam\" anymore I've been to South Africa three times now, and I've loved it deeply while at the same time been made deeply uneasy by its inequality. Its racist privileges may no longer be mandated by the government, but they linger poisonously on. This story by the wonderful Robyn Dixon tells of a terrifying home invasion, and how it changed one woman in unexpected, and inspiring, ways. Tracey Lomax was a liberal white lawyer, known for taking on pro bono work for poor blacks. Yet during the attack, she found herself, instantly and uneasily, assuming the apartheid-era role of the \"white madam\" : calm, firm, in control and used to telling black people what to do, even if they had guns. As the ordeal wore on, the most aggressive of the gunmen forced her into the master bedroom. \"He threw me down on the bed and said,\" If you don't give me jewelry now, I'll stick you .' I knew he meant rape. \"She replied firmly,\" We don't behave like that. We're not savages. \"After that night five years ago, Lomax decided she didn't want to be that person anymore .\" Your instinctive reaction is to lock your windows and recoil and yell, but if I'd gone that way I'd have ended up a very bitter person, \"she said .\" I started keeping my car window open when hawkers and beggars came up. I started greeting them and asking them how they were. I started reaching out to people of color in a way I hadn't before. \"Tracey Lomax, a South African lawyer, with daughter Jaime at their cottage home, where the family moved after a terrifying home robbery five years ago outside Johannesburg. (Robyn Dixon / Los Angeles Times) The soundtrack:\" Never Goin' Back, \"by Spiritualized. I've probably used Spiritualized for more soundtracks than any other band. They just speak to me, somehow. Pain and redemption and vulnerability and joy. What I'm reading online When was the last time you went to an old-fashioned newsstand? Not one inside a bookstore, or, worse, an airport. No, I mean one with the word\" News \"in its name, the kind where you walk in and are hit by the smell of ink and paper. My favorite one, Bungalow News in Pasadena, died a slow death years ago. My replacement newsstand was in the Montrose neighborhood, and it too endured a painful descent marked by thinning shelves and late-arriving issues. Still, its death was a shock. I remember the day I found out--I always parked behind the shop and came in the back way. On that Sunday morning, the back door was locked, and I thought the owner must have forgotten it when she opened up. I walked around to the front and saw that the shop was empty, like the Grinch had swept in and taken even the last crumb. For years I had coveted the vintage tin L.A. Times sign inside, and always intended to buy it from the owner if I ever left the paper. I felt a strange loss when I knew that would never be. All of this flitted through my mind when I read the Columbia Journalism Review piece headlined,\" Print is the new \"new' media .\" Everyone who has bought a magazine just because it feels good in your hands will love this piece. It even name-checks a magazine I've done just that with: Kinfolk (ahh, that thick, uncreasable paper). \"Old people like it because they're nostalgic,\" one back-to-the-future maverick says, and hipsters \"swarm all over it like they just found this new, trendy, nostalgic thing .\" Print--it's the new vinyl. What's on my bedside table Loss and love and endings and beginnings have been on my mind lately, so I started reading a book that had long been on my wish list: \"H Is for Hawk\" by <mark>Helen Macdonald</mark>. Written after her father died suddenly of a heart attack, this book is a meditation on all of those things. This passage near the beginning of the book captures the feeling of love through the flight of two hawks: They were loving the space between each other, and carving it into all sorts of beautiful concentric chords and distances. A couple of flaps, and the male, the teircel, would be above the female, and then he'd drift north of her, and then slip down, fast, like a knife-cut, a smooth calligraphic scrawl underneath her, and she'd dip a wing, and then they'd soar up again. And loss: Here's a word. Bereavement. Or, Bereaved. Bereft. It's from the Old English bereafian, meaning \"to deprive of, take away, seize, rob .\" Robbed. Seized. It happens to everyone. But you feel it alone. Shocking loss isn't to be shared, no matter how hard you try. I'm a third of the way through the memoir, and it's impossibly, impossibly lovely. The soundtrack: I don't usually offer a soundtrack to a book I'm reading, but a lyric from the Nada Surf song \"When I Was Young\" has been circling in a loop through my head with \"H Is for Hawk\" : \"And my aimless dreaming has found a target .\" The line is about love, but it fits with <mark>Macdonald</mark>, and finding her purpose, after loss, in a goshawk named Mabel. What's on my turntable Although I spend most of my time listening with headphones to Spotify, sometimes I want to hear the needle touching down on vinyl. That's why I have a turntable in my office--and two at home (one inside, and a battery-powered one outside when the weather's fine--which it usually is in Southern California). This week's vinyl: \"To Wish You a Merry Christmas,\" by Harry Belafonte. My latest thrift store purchase (along with \"A Swedish Christmas,\" which may be unlistenable but has an irresistible cover). I haven't felt the holiday vibe yet this year, but Belafonte is so easy on the ears--and the eyes--he seemed like a good place to start. Want to chat? Have a great idea for a Great Read? I'm @ karihow on Twitter and kari.howard @ latimes.com on email.", "articleID": "2015121212_00180092_W", "names": {"Helen Macdonald": ["Q18921880", "Q5702738", "Q5702741"]}}, {"date": "2015-12-12", "url": "http://www.dddnews.com/story/2258709.html", "content": "BRPEDC meeting leads to a new \"kettle of fish' Saturday, December 12, 2015LAURA FORD Daily Dunklin Democrat What started out as a regular monthly Bootheel Regional Planning and Economic Development Commission meeting in October, later turned into a political fish fry in November for Hornersville Mayor William\" Bub \"Foresythe and a real catch for his community. According to Foresythe, the group originally met on Oct. 19 for its regular meeting in Dexter .\" At that time we talked with Caroline Yielding, who is out of Roy Blunt's office in Cape Girardeau, \"said Foresythe .\" She came down because we didn't qualify for the U.S.D.A. grant that we applied for, so she wanted to come and look at our streets, our equipment, our fire truck, and look at our town to see what shape we were in. \"Yielding said she would be in Hornersville around 11:30 on Monday, Nov. 9 .\" That was when I asked her if she liked barbeque or fish, \"he said and smiled .\" She said that she liked American made fish. \"Several individuals from MoDOT were standing nearby and overheard the conversation, and said they liked fish and asked if they could come .\" That's when David Blaylock, the new guy from Bootheel Regional said he liked fish as well and asked if he could come too. \"Foresythe told them that they were all invited to a good old fashioned fish fry at the Hornersville Community Building. On the day that Yielding came to Hornersville, an entourage of area committee representatives and politicians followed her. Among those at the fish fry were State Rep. Andrew McDaniel, along with his wife and their son; David Blaylock; Dustin Boatwright with Little River Drainage; Max <mark>Ray Moore</mark>, Hornersville resident and liaison for the city's drainage; State Rep. Don Rone; Jake Fisher; <mark>Tim Davis</mark>, general manager of Pemiscot-Dunklin Electric Cooperative; Karen Vandiver, Dunklin County assessor; Kent Hampton, Dunklin County clerk; and Senator Doug Libla. City Aldermen <mark>Mike James</mark> and <mark>Ronnie Brown</mark>, who had both been to the meeting in Dexter, cooked the fish for the group .\" <mark>Mike</mark> and <mark>Ronnie</mark> were excited about going to the meetings in Dexter, \"said Foresythe .\" They were especially excited about what was talked about at the meetings and what programs we could pursue in order to help our community. \"Dustin was going to talk to the group that day about what Little River Drainage has done on the river, but during the middle of the talk, he received a call that his wife had been in a wreck in Cape Girardeau, so he had to leave,\" he said. \"But, Max <mark>Ray</mark> took over and spoke about the drainage work and about what we have accomplished .\" Libla commented on the good relationship that the city had with both the Corp of Engineers and Little River Drainage. Foresythe said that from the meeting, he found that the ability to improve a community has a lot to do with not only the people you know within the community, but it also has a lot to do with the contacts you have outside the community as well. \"Everyone had a chance to talk, and as a result of that meeting, we are now receiving emails from Caroline about our earlier meeting with MoDOT regarding getting the airport sealed and recoated,\" he said. \"It looks like we will be getting that done soon. We are looking at another grant that we were not even aware of that could help us in getting a new fire truck and fire equipment .\" The mayor also said that since the $500,000 grant that the Bootheel Regional Planning Commission wrote did not work out for the city, the commission was now looking at other options that could help the town. Other needed improvements are fire equipment and a new police car, as well as tearing down some old buildings, including the old city hall. \"We had a really good turnout, and we were really pleased with the results,\" he said. \"All of this stemmed from that one Bootheel Regional meeting in Dexter, and we are just trying to put Hornersville on the map. All these years we just didn't believe in asking for help when we could do it ourselves. It may have put us a little behind the eight ball at times, but we still have one of the safest little towns in the area, and we have people from Kennett who want to move here .\" He added that if the meeting could get even one of the improvements needed on their list completed, then it was well worth it. \"It would be nice to be able to bring more politicians into the community to visit,\" he said. \"I have met a lot of people since I've been working with the coop (Pemiscot-Dunklin Electric Cooperative), and I thought it would be good to ask them to Hornersville .\" Foresythe would like to make the fish fry an annual event with Bootheel Regional. Foresythe explained that the Bootheel Regional Planning Commission is an association of local governments like Kennett, Dexter, Hayti that meets once a month to discuss issues and problem solving projects. Foresythe said that the city wants to become more involved with the commission, and since they now have some aldermen who want to be more involved, they are \"going to stay on it and see what they can offer other towns as well as other towns offer them .\" According to Foresythe, city officials also want to work more with conservation and restoring the park and the road that leads to it. \"Max <mark>Ray</mark> is concerned about one area near the bridge being lower than everything else,\" he said. \"After the meeting, Dustin said that they would be partnering with the Corp (of Engineers) to fix that area, so that will be taken care of .\" He added that it may take awhile for the park restoration, but at least the town will not have to worry about the flooding. \"In time, I believe Hornersville has a chance to grow, but we are going to have to make it to where our children will want to stay and be city leaders here,\" he said. \"We need to make it a safe and beautiful place to raise your kids .\" ", "articleID": "2015121216_00331591_W", "names": {"Mike James": ["Q14918262", "Q3313377", "Q6847383", "Q6847384", "Q948453"], "Ray Moore": ["Q30605431", "Q59201669"], "Ronnie Brown": ["Q3441777", "Q7365811"], "Tim Davis": ["Q27688782", "Q7803411", "Q7803412", "Q7803413"]}}]