[{"articleID": "2018090315_00086146_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "Steve Baker": ["Q10379857", "Q15973457", "Q1991602", "Q2346812", "Q260111", "Q6380444", "Q7611849", "Q7611850", "Q7611852", "Q9345785"], "David Davis": ["Q1174175", "Q1174177", "Q13471238", "Q16206936", "Q28037658", "Q300023", "Q41256031", "Q4710588", "Q56596944", "Q843907"]}, "date": "2018-09-03", "url": "http://www.irishnews.com/news/brexit/2018/09/03/news/boris-johnson-offering-no-new-brexit-ideas-sasy-downing-street-1423757/", "content": "Boris Johnson offering no new Brexit ideas, says Downing Street <mark>Theresa May</mark> hit back over Boris Johnson's criticism of how she is handling Brexit. Picture by Stefan Rousseau/PA Wire Andrew Woodcock, Press Association 03 September, 2018 16:20 Downing Street has delivered a stinging slapdown to former Briitsh foreign secretary Boris Johnson, saying he has produced \"no new ideas\" on Brexit. In a barely-veiled rebuff to Mr Johnson's ambitions to become prime minister, <mark>Theresa May</mark>'s official spokesman told reporters that the country needed \"serious leadership with a serious plan\" which was being provided by the current premier. The comments came after Mr Johnson used his regular Daily Telegraph column to launch a scathing attack on Mrs <mark>May</mark>'s Brexit strategy, branding it a \"fix\" that can only lead to victory for the EU. In what was seen by many at Westminster as an opening sally in a bid to oust the British prime minister, the ex-foreign secretary insisted the UK was \"lying flat on the canvas\" in withdrawal talks. Britain has \"gone into battle with the white flag fluttering over our leading tank\" due to Mrs <mark>May</mark>'s Chequers proposals to align UK standards on goods to the EU, Mr Johnson said. But Mrs <mark>May</mark>'s spokesman insisted that the plans set out in the British government's Brexit White Paper were \"the only credible and negotiable plan which has been put forward\". And the spokesman added: \"Boris Johnson resigned over Chequers. There's no new ideas in this article to respond to .\" What we need at this time is serious leadership with a serious plan and that's exactly what the country has with this prime minister and this Brexit plan. \"Writing in the Telegraph, Mr Johnson compared withdrawal negotiations between Brexit Secretary Dominic Raab and the EU's chief negotiator Michel Barnier to a rigged wrestling match .\" The fix is in, \"said the former foreign secretary .\" The whole thing is about as pre-ordained as a bout between Giant Haystacks and Big Daddy; and in this case, I am afraid, the inevitable outcome is a victory for the EU, with the UK lying flat on the canvas and 12 stars circling symbolically over our semi-conscious head. \"Mr Johnson accused\" some members \"of the Briitsh government of deliberately using the Irish border question to\" stop a proper Brexit \"and effectively keep Britain in the EU. He said that the real\" scandal \"was\" not that we have failed, but that we have not even tried \"on Brexit .\" The UK has agreed to hand over £ 40 billion of taxpayers' money for two-thirds of diddly squat, \"he said. Under the Chequers plan,\" we will remain in the EU taxi, but this time locked in the boot, with absolutely no say on the destination \". But <mark>Theresa May</mark>'s spokesman retorted:\" The Chequers proposals are the only credible and negotiable plan which has been put forward and which will deliver on the will of the British people. \"And Home Secretary Sajid Javid said Tories should unite behind Mrs <mark>May</mark>'s blueprint, pointedly adding:\" For those who think there is a different way then they need to properly set out what alternatives there might be. \"Mr Johnson's intervention won the backing of leading Tory Brexiteers <mark>Steve Baker</mark>, who described it as\" superb \"and Owen Patterson, who said it offered a clear articulation of the\" myths \"surrounding the Irish border. It came as Mrs <mark>May</mark> faced growing opposition on Tory benches to the compromise deal agreed by the Cabinet at her country residence in July, with Brexiteers warning it will be voted down if it comes before the House of Commons. With Parliament returning from recess on Tuesday, the PM is expected to face a coordinated effort from Tory hardline Brexiteers to abandon her exit agenda amid reports that election strategist Sir Lynton Crosby is involved in a\" chuck Chequers \"campaign. And the viability of the Chequers model was also coming under question in Brussels, with Mr Barnier telling a German newspaper that he is\" strongly opposed \"to elements of the plan. Mrs <mark>May</mark>'s proposals, which would see the UK remain in a free trade area for goods while ending freedom of movement, would involve\" insane and unjustifiable bureaucracy \", said Mr Barnier. The PM's spokesman insisted that the Chequers plan had received\" a positive response \"from a number of EU leaders and said that Number 10 believes it\" can carry the support of the House of Commons \".\" We want the EU to engage in these negotiations with energy and imagination, \"said the spokesman .\" Michel Barnier has said a lot of things in recent weeks. The negotiations between the secretary of state and Michel Barnier are ongoing. You can expect some to be taking place in the coming days. \"It's very clear that the Chequers proposals are being taken seriously...What you've seen over the summer from a series of European leaders is a positive response to the Chequers proposals .\" Despite warning that the PM had declared \"open sesame\" for further concessions to Brussels, former Brexit secretary <mark>David Davis</mark> rejected suggestions she should be replaced. In what appeared to be a veiled attack on Mr Johnson - who walked out of the Cabinet hours after his own resignation over Chequers - Mr <mark>Davis</mark> told ITV1's Good Morning Britain it was not the time for \"personality politics\". Asked if it would be better if Mrs <mark>May</mark> stood down, Mr <mark>Davis</mark> said: \"No, we don't need any more turbulence right now .\" What matters in all of this is not the personality politics, it's the outcome at the end. \"Asked if he thought the Chequers deal was in tatters, Labour leader Jeremy Corbyn said:\" It sounds like it is and it sounds like Boris Johnson, having spent two years as Foreign Secretary, has achieved nothing and now says it's all off. \"Well surely, it's time for some serious people to take over the negotiations? The Tories have had two years since the referendum and made no progress at all .\" Enjoy reading the Irish News? Subscribe from just £ 1 for the first month to get full access Subscribe Topics brexit <mark>Theresa May</mark> boris johnson Michel Barnier Categories Brexit 03 September, 2018 16:20 Brexit"}, {"articleID": "2018120611_00390505_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"], "Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"], "William Nelson": ["Q18601511", "Q54093519", "Q8016066"], "Magic Man": ["Q23928996", "Q2654402"], "Jim Manley": ["Q16105372", "Q48976990", "Q6196608"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2018-12-06", "url": "http://thehill.com/homenews/senate/419970-manchins-likely-senior-role-on-key-energy-panel-rankles-progressives", "content": "Sen. Joe Manchin Joseph (Joe) Manchin Overnight Health Care: Manchin pitched <mark>Trump</mark> on reviving bipartisan ObamaCare fix | 4 in 10 don't plan to get flu shots | Survey finds more than a quarter have pre-existing conditions Overnight Energy: Senate advances <mark>Trump</mark> energy pick | Manchin votes \"no' in surprise | Carbon emissions on track for record | EPA targets another Obama coal rule Senate advances <mark>Trump</mark> energy pick after Manchin flips MORE (D-W. Va.) is likely going to be the top-ranking Democrat on a powerful energy committee in the next Congress--and that is not sitting well with various voices on the left. The West Virginia centrist narrowly won his midterm election by championing the coal industry and emphasizing his relationship with President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> Napolitano: <mark>Trump</mark> Jr. thinks he will be indicted by Mueller Dems cry foul in undecided N.C. race On The Money: <mark>Trump</mark> touts China actions day after stock slide | China\" confident' on new trade deal | GM chief meets lawmakers to calm anger over cuts | Huawei CFO arrested MORE. He is favored to be the ranking member on the Energy and Natural Resources Committee, which oversees the Department of Energy and Interior Department. But progressive politicians including Rep.-elect Alexandria Ocasio-Cortez Alexandria Ocasio-Cortez Ocasio-Cortez confirms she will pay interns \"at least' an hour WaPost fact checker gives Ocasio-Cortez four Pinocchios for Pentagon claim Ocasio-Cortez: Fighting climate change will be\" the civil rights movement of our generation' MORE (D-N.Y.) and potential 2020 hopeful Washington Gov. Jay Inslee (D) want Senate Democratic leaders, namely Senate Minority Leader Charles Schumer Charles (Chuck) Ellis Schumer The Hill's 12:30 Report--Latest on Dem leadership votes | <mark>Trump</mark> threatens new auto tariffs | Senators briefed on Khashoggi Schumer welcomes his first grandchild No, it's not a gamble for Dems to back Beto for president MORE (N.Y.), to override the rules to circumvent Manchin. \"At this moment it is simply intolerable and unacceptable for the U.S. Senate to have a senator who is unalterably opposed to the cap-and-trade system and other measures that we worked so hard to advance as climate policy against climate denial,\" Inslee told The Hill. Inslee, who backed his state's ballot initiative that would have instituted the nation's first carbon tax, called on the Senate to find a way to intervene, regardless of Senate protocol. He launched a petition drive Wednesday asking Democratic leaders to stop Manchin. \"The fundamental thing I'm saying is the fate of the planet right now has got to <mark>trump</mark> any seniority system of the U.S. Senate,\" he said. Ocasio-Cortez, who hails from Schumer's home state, has introduced her own \"Green New Deal\" plan to transition the country to run solely on renewable energy sources for electricity. Asked about Manchin's possible position on the panel, Ocasio-Cortez on Friday responded, \"I have concerns because I don't think we should be financed by the industries that we are supposed to be legislating and regulating .\" While the Energy Committee doesn't have a direct say on issues like climate change, it plays important roles in areas like federal land and energy policy. The ranking member is expected to try to stop objectionable nominees, attempts to waive environmental laws for logging or oil drilling and perform other tasks. \"The ranking member is a backstop to extreme measures,\" said a former committee aide. \"Some of the concern would be, if no one is pushing back, then it's like there's no minority power .\" Manchin frequently sides with the GOP on the energy panel. He has backed the <mark>Trump</mark> administration, for example, in its ongoing attempts to aid the coal and nuclear power industries, despite nearly unified Democratic opposition. ADVERTISEMENT In a committee vote last month, he supported Bernard McNamee, <mark>Trump</mark>'s nominee to the Federal Energy Regulatory Commission, who worked at the Energy Department in support of the coal efforts. But he flipped on Wednesday and voted against limiting debate on McNamee in the full Senate. With Senate committee leadership established by seniority, Manchin could only feasibly be denied the position in two ways: another senior senator vies for the job or Schumer disregards the rules and appoints someone else. But the four Democrats who would be eligible to fill the position aren't interested. The list includes Sen. Bernie Sanders Bernard (Bernie) Sanders Andrew Gillum met with Obama during DC visit: report Deval Patrick telling staff he'll pass on 2020 White House bid: report The Hill's Morning Report--Presented by T-Mobile--What the <mark>Michael Flynn</mark> news means MORE (I-Vt .), a possible 2020 presidential candidate who supports climate change legislation, and who said he wants to remain ranking member of the Budget Committee. \"I'm with Budget,\" he told The Hill. The Budget Committee oversees the Congressional Budget Office, sets high-level numbers for government spending and works to ensure that the Senate doesn't violate budgetary rules. Sen. Debbie Stabenow Deborah (Debbie) Ann Stabenow This week: Lawmakers return to mourn George H.W. Bush George H.W. Bush remembered at Kennedy Center Honors GOP lawmakers say <mark>Trump</mark> should tamp down trade rhetoric MORE (D-Mich .) confirmed Wednesday that she is committed to heading the minority on the Senate Agriculture Committee and offered support for Manchin heading Energy. \"I think that Joe understands the difference between representing your state as a member and the responsibility to the caucus as a ranking member, and so I think he has a larger responsibility in that role,\" Stabenow said Wednesday. \"I think at this point if he is next up in seniority than I think that's the way the process works .\" Sen. Maria Cantwell Maria Elaine Cantwell Senate advances <mark>Trump</mark> energy pick after Manchin flips Senate panel advances <mark>Trump</mark>'s energy nominee despite Dem objections Privacy legislation could provide common ground for the newly divided Congress MORE (D-Wash .), the current ranking member, is seen as likely to take the top spot on the Commerce, Science and Transportation Committee. That position is open because Sen. <mark>Bill Nelson</mark> Clarence (<mark>Bill</mark>) <mark>William Nelson</mark> Rick Scott delays Senate swearing-in ceremony Races Dems narrowly lost show party needs to return to Howard Dean's 50 state strategy Scott suspends Broward County official Brenda Snipes over \"widespread issues with voting' MORE (D-Fla .) lost his reelection bid last month. Cantwell is the next most senior senator available for the spot. She has avoided saying publicly whether she'll take it, and didn't answer a question about it Wednesday. Sen. Ron Wyden Ronald (Ron) Lee Wyden Marriott breach spurs new privacy law push Overnight Health Care: Top biotech lobbyist sees industry under\" greater threat' than ever | Senators offer bipartisan drug pricing <mark>bill</mark> | 5.1 M pounds of beef added to salmonella recall Bipartisan senators introduce new drug pricing <mark>bill</mark> MORE (D-Ore .) also has more seniority than Manchin. But the Finance Committee, where he is currently the top Democrat, is one of the most prestigious in the Senate, and he's given no indication that he would give up the position. Manchin is committed to taking over the job. He told reporters Wednesday that since Senate Democrats have historically handed out ranking memberships based on seniority, he deserves the post. \"I think you all have been around here long enough to understand the system, don't you? Seniority is what it is. So we'll see what happens,\" Manchin said. With other possibilities appearing exhausted, critics of Manchin said the best way to stop him is for Schumer to sidestep Manchin's appointment for a nonsenior candidate. Sen. Martin Heinrich Martin Trevor Heinrich Senate panel advances <mark>Trump</mark>'s energy nominee despite Dem objections Dems wonder if Sherrod Brown could be their <mark>magic man</mark> Heinrich wins reelection to Senate in New Mexico MORE (D-N.M.) would be the next in line. \"The first thing is, Joe Manchin is categorically unacceptable as ranking member and the second thing is that Chuck Schumer Charles (Chuck) Ellis Schumer The Hill's 12:30 Report--Latest on Dem leadership votes | <mark>Trump</mark> threatens new auto tariffs | Senators briefed on Khashoggi Schumer welcomes his first grandchild No, it's not a gamble for Dems to back Beto for president MORE can fix this,\" said Lukas Ross, senior policy analyst at Friends of the Earth. \"This is truly a question of moral courage and leadership--it is within his power to waive the seniority rules .\" But doing so would be extremely rare, and could be politically risky--especially considering rumblings that Manchin in the past has considered flipping parties. Senate Democrats take seniority seriously, and could see exceptions as a threat. Schumer's staff would not comment on the record. \"I can't think of instances where it happened. I can think of instances where people agitated for it to happen,\" said a former Democratic leadership aide. \"Everybody just feels like it won't be done,\" said another former staffer. Furthermore, Manchin serves on Schumer's leadership team and the two senators enjoy a close working relationship. \"There's not a snowball's chance in hell that Schumer would push him off for somebody more junior,\" said <mark>Jim Manley</mark>, a Democratic strategist who worked for former Senate Majority Leader <mark>Harry Reid</mark> Harry Mason Reid Water wars won't be won on a battlefield Poll finds most Americans and most women don't want Pelosi as Speaker Schumer walking tightrope with committee assignments MORE (D-Nev .). <mark>Manley</mark> added that Schumer and Manchin have a strong alliance, due largely to Schumer's long-standing refusal to criticize Manchin's more conservative positions. \"I can assure you they have a great relationship,\" he said. That relationship could work to Schumer's advantage. \"If Manchin does ascend to the ranking membership, he has to be attentive to what the Democratic leader's priorities and concerns are, and I would hope that that is actually the case,\" the former aide said. \"Not that there won't be tensions and issues that give the Republicans an opportunity to put the Democrats on the committee in a difficult position, but hopefully with communication and some leadership, they'll figure out how to navigate those situations .\" Tags Alexandria Ocasio-Cortez Debbie Stabenow Martin Heinrich Charles Schumer Bernie Sanders Maria Cantwell Chuck Schumer <mark>Donald Trump</mark> Joe Manchin <mark>Bill Nelson</mark> <mark>Harry Reid</mark> Ron Wyden"}, {"articleID": "2014100313_00045035_W", "names": {"Graham Turner": ["Q21465447", "Q21557314", "Q2313039"], "Hugh O'Neill": ["Q21165090", "Q5932150", "Q5932158"], "Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"], "John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"]}, "date": "2014-10-03", "url": "http://feeds.theguardian.com/c/34708/f/663841/s/3f169732/sc/13/l/0L0Stheguardian0N0Ceducation0C20A140Coct0C0A30Ccatholic0Eschool0Est0Ebenedicts0Ebury0Est0Eedmunds0Ebreach0Etrojan0Ehorse0Eofsted0Erules/story01.htm", "content": "A Catholic school in Bury St Edmunds fell foul of Ofsted rules. Photograph: <mark>Graham Turner</mark> for the Guardian A Catholic state school has fallen foul of controversial rules on promoting British values and guarding against extremism and radicalisation, introduced in the wake of Birmingham's Trojan Horse affair. The Ofsted report, which followed a snap inspection but was withdrawn within hours, claimed that younger pupils at St Benedict's secondary school in Bury St Edmunds, Suffolk, \"show less awareness of the dangers of extremism and radicalisation\". It questioned whether the school prepared pupils \"for life and work in modern Britain\" - with the language Ofsted said on Friday morning that the report was on hold for review by its east of England regional director, Sean Harford, after St Benedict's released what appeared to be the final version of the document on its website. The report was the result of a no-notice inspection of St Benedict's by Ofsted last month, only a few days into the start of the school year, because the school website failed to include details of its citizenship teaching. Ofsted's snap inspections were introduced after the investigations in Birmingham. The inspectors recommended \"making clearer the contribution to students' preparation for life and work in modern Britain and the dangers of extremism\". The Ofsted team also complained that the school's \"delivery of citizenship education is not made clear, or how the school teaches students about the dangers of extremism and radicalisation\". St Benedict's is a voluntary-aided Catholic faith secondary school with more than 600 pupils, around two-thirds of whom are Catholics. It boasts excellent A-level results, and in 2014, 70% of its pupils passed GCSEs with five or more A * - C grades, including English and maths, well above the government's minimum of 45%. <mark>Hugh O'Neill</mark>, the school's headteacher, said: \"We accept that Ofsted has a job to do, and there are reasons why they regard no-notice inspections as a valid form of inspection. We will follow whatever guidance the eventual Ofsted report that we receive asks us to follow .\" I've been gratified, as have the staff, by the number of messages we've had from colleagues, parents and students, who have all said they regard the school as excellent and don't feel the Ofsted report reflects their view of the school at all. That's been universal with everyone I've spoken to. \"The inspectors also found fault with the school's teaching and pupil progress regarding disadvantaged, disabled students - and lowered its grade from\" good \"to\" requires improvement, \"the second-lowest rating. <mark>O'Neill</mark> said Ofsted's report had come at a bad time, with parents visiting open days before making their final choices for secondary school applications this month. The school's previous inspection took place last year, and praised the pupils' moral, social and cultural development. Ofsted said that the regional director had decided to delay publication of the report\" to allow further quality assurance checks to take place \". Student rewards such as cash and free trips fail to improve GCSE results <mark>Tom Hardy</mark> in Peaky Blinders Preview of <mark>Hardy</mark> as Camden gangster Alfie Solomons Finally, the flying car may have landed Ebola isn't the big one. So what is? And are we ready for it? US Ebola patient's friends quarantined under armed guard Violent clashes break out in Hong Kong after counter-protesters storm sit-in <mark>John Lewis</mark> boss:\" France is sclerotic, hopeless and downbeat...it's finished '"}, {"articleID": "2014012111_00002265_W", "names": {"Jack Sanders": ["Q11977805", "Q31280199"]}, "date": "2014-01-20", "url": "http://whattheythink.com/news/66944-sonoco-dedicates-75-million-biomass-boiler-facility/?utm_source=whattheythink&utm_medium=rss&utm_campaign=rss", "content": "Sonoco Dedicates $75 Million Biomass Boiler Facility Monday, January 20, 2014 Press release from the issuing company HARTSVILLE, S.C. - Sonoco, a global provider of industrial products, consumer packaging, protective solutions and packaging services, today dedicated the new biomass facility at its Hartsville, S.C., plant. The biomass boiler is part of a $100 million investment in the Darlington County compound. \"A key part of Sonoco's culture is our commitment to sustainability, including our dedication to improving the environment and our contributions to the future of the communities in which we operate,\" said Sonoco President and Chief Executive Officer <mark>Jack Sanders</mark>. \"This boiler is proof of that commitment .\" \"We took more than two years to complete final engineering, fabricate the boiler, put together the infrastructure and complete construction of what we believe to be one of the nation's most state-of-the-art biomass co-generation boiler systems .\" In 2011 Sonoco committed to a $75 million investment to replace two aging, coal-fired boilers and add the new biomass boiler at its plant in Hartsville. The new boiler is fueled primarily by woody biomass from regional logging activity, but can also run on natural gas. The boiler will produce about 16 megawatts of green energy that will be consumed by the manufacturing complex, as well as steam that is used in the paper making process. \"South Carolina is being called the fastest growing economy in the Southeast,\" said Governor Nikki Haley. \"One of the reasons is because of innovative projects like Sonoco's biomass boiler. Advancements like this help businesses grow and succeed, attract new customers and bring talent and high-paying jobs to the State .\" \"This is a great day for Hartsville, my entire Senate District, the State of South Carolina and the entire reach of this Company. The investment and jobs that are created here will benefit our entire region. Sonoco, as a company and partner, has made it clear that they are committed to the present and also the future. Conservation and sustainability are the foundation of the Biomass Boiler,\" said Senator Gerald Malloy, District 29. \"This announcement marks the conclusion of an event that's taken two years to come to fruition. Two years, $100 million and countless hours. It also marks an important moment for Sonoco, one of the great stewards of our region. Sonoco is known as one of the world's top manufacturing companies, but they're much more than that. This investment is more than just dollars being put into their plant. It's symbolic of their dedication to our area and what the company means to the citizens of the NESA region,\" said Jeff McKay, executive director of the North Eastern Strategic Alliance (NESA). Why \"Green\" Still Matters on Direct Mail and Packaging (Digital Nirvana) Major Update to Adobe Photoshop CC Brings 3D Printing to the Design World Sonoco Display and Packaging Receives Five Awards at 2013 Design of the Times Competition Sonoco Listed on Dow Jones Sustainability World Index for Fifth Consecutive Year Estimating Specialist at Fineline Printing Group in Indianapolis, Indiana Software Developer - Print MIS at Avanti Computer Systems Limited in Toronto (or remote) Channel Development Manager at Avanti in USA or Canada (flexible - home office) Customer Service Representative at manroland, Inc in Westmont IL Department Chair at Clemson University Department of Graphic Communications in Clemson, SC Why \"Green\" Still Matters on Direct Mail and Packaging (Digital Nirvana) The USPS Sneaks a Rate Increase on Christmas Eve; Media Irrelevance Must be Their Objective (Dr. Joe) Join the thousands of printing executives who are already part of the WhatTheyThink Community."}, {"articleID": "2009030420_00086357_W", "names": {"Fernando Alonso": ["Q10514", "Q20533356", "Q42393967", "Q42394430", "Q5444582", "Q5859158"], "Lewis Hamilton": ["Q6536656", "Q9673"], "Mark Webber": ["Q1378842", "Q6770266", "Q82667"]}, "date": "2009-03-04", "url": "http://sportinglife.com/formula1/news/story_get.cgi?STORY_NAME=formula1/09/03/04/AUTO_Jerez.html", "content": "click here for more f1 news <mark>fernando alonso</mark> blew away his test rivals, notably <mark>lewis hamilton</mark>, on a day when the latest session was hampered by gusting winds. the formula one teams have had to cope with sandstorms and heavy rains during the past few weeks in the build-up to the new season as the elements have seriously hampered their programmes. on the fourth day of five at the jerez circuit in southern spain, it was strong gales that caused the problems on this occasion. former double world champion <mark>alonso</mark>, though, emerged on top with a time of one minute 19.945 seconds - the third best overall this week - set on the 13th of his 130 laps overall. the spaniard's time was 1.357 secs quicker than <mark>hamilton</mark>, who could only finish seventh of eight overall on his return to the track. <mark>alonso</mark> said: \"i'm very happy with the result from this test as we had two trouble-free days, a very consistent car and the work we have done has been very useful .\" kimi raikkonen was second quickest in his ferrari, but just over three tenths of a second down, followed by nick heidfeld for bmw sauber and toyota's jarno trulli, both 0.5 secs off the pace. explaining the difficulties, veteran trulli said: \"that was a difficult day for us because our programme was disrupted .\" the main problem throughout the day was the wind. it was gusting and making it hard to make the comparisons we were looking for. \"we did set-up work in the morning and we attempted a race distance in the afternoon, until we had a problem with the fuel rig .\" we still put in a lot of laps, with our best later than most teams in the day, so we can be optimistic about that, but overall today was hard work. \"red bull's <mark>mark webber</mark> and the williams of kazuki nakajima also finished ahead of <mark>hamilton</mark>, who only managed a day low of 70 laps, primarily due to a technical issue in the morning. force india's adrian sutil was last of the eight, finishing 1.466 secs off <mark>alonso</mark>, primarily as the german suffered with graining to his tyres. fantasy football----------------------------------------------------------------"}, {"articleID": "2011102707_00028297_W", "names": {"David Alan Grier": ["Q16866341", "Q562596"]}, "date": "2011-10-27", "url": "http://philly.com/r?19=961&43=168041&44=132667238&32=3796&7=195357&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fentertainment%2F20111027_Audra_McDonald_takes_controversy_in_stride.html", "content": "audra mcdonald takes controversy in stride the debate on the reworked \"porgy and bess\" has even shown itself in her song choices for her concert tour. new york - as deliberate as audra mcdonald is about picking songs for her concerts, what she says in between singing them is anything but considered. \"i just talk, which sometimes is good, and sometimes is not good at all,\" she says, laughing. \"i find that keeps me at my most honest, which then keeps me in the right frame of mind for each song .\" the four-time tony award winner has even surprised herself by suddenly talking about shoes or what she ate for lunch. \"for some people, it's like,\" oh, dear. i didn't know all that about you, and i didn't want to hear all that about you. i just wanted to hear your voice .' \"that voice is currently in the middle of her first concert tour in four years, which landed in new york's carnegie hall last week and then takes mcdonald to michigan, florida, georgia, alabama, and tennessee. she is set to appear nov. 30 at the kimmel center. after that, mcdonald will be heading to catfish row to help restart a new production of porgy and bess on broadway. the reworked opera, now called the gershwins' porgy and bess, had a controversial out-of-town tryout this fall in boston. directed by the american repertory theater's diane paulus and adapted by suzan-lori parks and deidre l. murray, the show generated headlines when stephen sondheim complained that an american masterpiece was being violated. mcdonald, who will play bess opposite norm lewis as porgy and <mark>david alan grier</mark> as sporting life, has taken the controversy in stride .\" people have such passionate feelings about this piece, \"she says .\" it's been part of our cultural language forever, and it's just one of those things that everybody feels a bit of ownership in their own way. and god bless them all, as far as i'm concerned. seriously. \"paulus says mcdonald has thrown herself into the role of bess with every fiber of her being .\" audra is the kind of actress who investigates every moment she is living on stage - and she is relentless in her search for truth on stage. \"the controversy has shown itself in mcdonald's song selections for her concert, which usually include show tunes, classic songs from movies, and pieces written expressly for her. but she won't be singing hits from porgy and bess, such as\" summertime \"and\" it ain't necessarily so, \"because most of bess' songs are duets. one song that mcdonald, 41, has picked is\" go back home \"from the scottsboro boys, a musical that closed abruptly in december after playing just 49 performances following protests from people who never saw it. the john kander and fred ebb musical frames as a minstrel show the 1930s-era story of nine black teenagers wrongfully put on death row, but then immediately subverts it by having an all-black cast. some performances of the show drew protesters who refused to see it and claimed the musical was actually embracing the minstrel convention. she also plans to sing a sondheim song,\" moments in the woods \"from into the woods, after discussing it with the composer, a sign that their relationship hasn't been destroyed over porgy and bess .\" i know how passionate he is about that particular piece. that's no surprise to anybody, \"she says. the creative team, she says, has condensed the four-hour opera into a 21/2-hour musical, eliminated a lot of the repetitiveness, and tried to deepen the characters .\" for me in the end, if people are talking about theater, that's a great thing. \"the opera-turned-musical tells the story of porgy, a beggar from the slums, who tries to rescue bess from her violent lover, crown, and a drug dealer, sporting life. to play bess, mcdonald has researched drug addiction and the life of women during the 1930s in south carolina, where the writers based their work. she and paulus have talked a lot about bess' past, what gives her joy, and why she falls in love with porgy. two books also have helped: zora neale hurston's their eyes were watching god, which follows the fortunes of a black woman living in a small florida town; and the dubose heyward novel on which the opera is based and which mcdonald often consults. raised in fresno, calif., and trained at the juilliard school, mcdonald is the older of two daughters and is one of those performers who earns raves for whatever she touches. she won three tony awards before the age of 30 - for carousel, master class, and ragtime - and a fourth in 2004 for a raisin in the sun. she has two grammy awards, four albums (she's thinking of a fifth), and two emmy award nominations, and has just finished four seasons on tv playing dr. naomi bennett on the abc series private practice. she also appears in the new woody harrelson film rampart, playing a barfly with a thing for cops who has a steamy love scene with harrelson .\" it was fun to step out of my comfort zone, \"she says. the commute from new york to the set of private practice in los angeles was punishing, and mcdonald estimates that she covered 720,000 miles flying back and forth. ultimately, the long days away from her 10-year-old daughter, zoe madeline, became too much. the death of mcdonald's father in a 2007 plane crash has also put her in a reflective mood. because your contributions are currently under review, no comments can be made at this time. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the\" report abuse \"button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. according to our terms of service, you are not yet of legal age to be able to contribute to this site. thank you for registering! please note that your registration will not be considered fully complete until you confirm by following the link we have provided in a confirmation email that was just sent to 21st-century robin hood advocates higher riches for poor to help middle class yes, dozens of reversals over flawed lawyering waste time and money no, poor defendants get what they deserve"}, {"articleID": "2019012215_00360958_W", "names": {"Angus Reid": ["Q4764230", "Q4764232"]}, "date": "2019-01-22", "url": "https://ivebeenmugged.typepad.com/my_weblog/2019/01/google-eu-privacy-canada.html", "content": "Google To EU Regulators: No One Country Should Censor The Web Internationally. Poll Finds Canadians Support \"Right To Be Forgotten' Tuesday, January 22, 2019 For those watching privacy legislation in Europe, MediaPost reported:\" ...Maciej Szpunar, an advisor to the highest court in the EU, sided with Google in the fight, arguing that the right to be forgotten should only be enforceable in Europe--not the entire world. The opinion is non-binding, but seen as likely to be followed. \"For those unfamiliar, in the European Union (EU) the right to be forgotten:\" ...was created in 2014, when EU judges ruled that Google (and other search engines) must remove links to embarrassing information about Europeans at their request...The right to be forgotten doesn't exist in the United States...Google interpreted the EU's ruling as requiring removal of links to material in search engines designed for European countries but not from its worldwide search results...In 2015, French regulators rejected Google's position and ordered the company to remove material from all of its results pages. Google then asked Europe's highest court to reject that view. The company argues that no one country should be able to censor the web internationally. \"No one corporation should be able to censor the web internationally, too. Meanwhile, Radio Canada International reported:\" A new poll shows a slim majority of Canadians agree with the concept known as the \"right to be forgotten online .\" This means the right to have outdated, inaccurate, or no longer relevant information about yourself removed from search engine results. The poll by the <mark>Angus Reid</mark> Institute found 51 percent of Canadians agree that people should have the right to be forgotten...\"Consumers should have control over their information. If that control is limited to only the country of their residence, then the global nature of the internet means that control is very limited--and probably irrelevant. What are your opinions? Posted at 10:15 AM in Canada, Europe, Government, Legislation, Privacy, Surveys | Permalink | Comments (0) Reblog (0)"}, {"articleID": "2008101510_00026172_W", "names": {"Steve Gardner": ["Q1340522", "Q7612624"]}, "date": "2008-10-15", "url": "http://prnewswire.com/cgi-bin/stories.pl?ACCT=109&STORY=/www/story/10-15-2008/0004904222&EDATE=", "content": "sabor latino! jetblue airways expands to south america with daily service to bogota, colombia - now offering service to 52 cities in eight countries - - fares start at us $99 (a) each way - orlando, fla., oct. 15 / prnewswire-firstcall /--jetblue airways (nasdaq: jblu), america's leading value airline, today announces plans to begin flights to its first-ever destination in south america, bringing the airline's signature low fares and sense of style to the skies of colombia. daily nonstop service between bogota and orlando, florida, will begin january 29, 2009, with fares beginning at just us $99 (a) each way. flights will originate at new york's john f. kennedy international airport, providing convenient one-stop, same-plane service between bogota and new york. seamless connections to other cities including boston, newark, and washington are also available. service is subject to receipt of operating authority from the colombian government, and until final government approval is received, all travel must be purchased and originate in the united states only. itineraries that originate in bogota will be available for sale at a later date after receipt of colombian government approval. \"we're thrilled to introduce jetblue's renowned service to the people of bogota as we begin the only nonstop flights between colombia and orlando,\" said jetblue ceo dave barger. \"this new direct link connecting one of the most vibrant cities in the americas to the varied attractions of central florida is great news for consumers. with low fares, comfortable leather seats with lots of legroom, free snacks and drinks, plus jetblue's friendly crewmembers, we're sure that bogotanos will quickly come to love the jetblue experience .\" customer-friendly jetblue's new year-round route to the thriving colombian capital is the latest in a string of new services to latin america and the caribbean from the airline's orlando focus city. the airline now offers daily service between orlando and cancun, mexico; santo domingo, dominican republic; and aguadilla, ponce and san juan, puerto rico, plus flights to 14 additional cities on the u.s. mainland. jetblue's schedule between bogota and new york via orlando: depart new york (jfk) 1:20 p.m. arrive orlando (mco) 4:08 p.m. depart orlando (mco) 5:55 p.m. arrive bogota (bog) 9:48 p.m. operates daily effective january 29, 2009 depart bogota (bog) 10:00 a.m. arrive orlando (mco) 2:01 p.m. depart orlando (mco) 3:31 p.m. arrive new york (jfk) 6:10 p.m. operates daily effective january 30, 2009 consistently noted as a leader in customer service and customer satisfaction, jetblue will operate service to bogota's el dorado international airport with its comfortable 150-seat airbus a320, which offers seatback televisions (including programming en espanol), all-leather seating, the most legroom in coach of any u.s. airline, and unlimited free snacks and beverages. \"the selection of orlando international by jetblue to launch their first nonstop flight to south america is further evidence of a commitment by jetblue to central florida and our community. the daily service is a welcomed addition that further expands our international capacity,\" said <mark>steve gardner</mark>, executive director of the greater orlando aviation authority. \"we're excited about jetblue's new direct flight between bogota and orlando,\" said ray gilley, president & ceo of the metro orlando economic development commission. \"this is great news for both leisure and business travelers as it creates a commercial bridge between our areas, helping to enhance the existing trade that takes place between colombia and florida, and helps to create new business opportunities .\" about jetblue airways new york-based jetblue airways has created a new airline category based on value, service and style. known for its award-winning service and free tv as much as its low fares, jetblue is now pleased to offer customers lots of legroom and super-spacious even more legroom seats. jetblue introduced complimentary in-flight e-mail and instant messaging services on aircraft \"betablue,\" a first among u.s. domestic airlines. jetblue is also america's first and only airline to offer its own customer bill of rights, with meaningful and specific compensation for customers inconvenienced by service disruptions within jetblue's control. visit for details. jetblue currently serves 51 cities with 500 daily flights. with jetblue, all seats are assigned, all travel is ticketless, all fares are one-way, and an overnight stay is never required. for information or reservations in english or spanish call 1-800-jetblue (1-800-538-2583) or visit roll over the links at left to see what's included on each page, then click the link to get there. • airlines & aviation • automotive roll over the links at left to see what's included on each page, then click the link to get there. banking & financial services includes: • banking & financial svcs • financing agreements roll over the links at left to see what's included roll over the links at left to see what's included on each page, then click the link to get there. • entertainment • film & motion pictures roll over the links at left to see what's included on each page, then click the link to get there. • corporate social responsibility • economic news & analysis • education roll over the links at left to see what's included on each page, then click the link to get there. roll over the links at left to see what's included roll over the links at left to see what's included on each page, then click the link to get there. • conference calls • contracts • earnings • earnings projections • mergers, acquisitions & takeovers • mutual funds • otc & smallcap roll over the links at left to see what's included roll over the links at left to see what's included on each page, then click the link to get there. • asian-american • children related • lesbian/gay/bisexual • native american roll over the links at left to see what's included roll over the links at left to see what's included roll over the links at left to see what's included on each page, then click the link to get there. • consumer electronics • design automation • internet • multimedia & internet roll over the links at left to see what's included on each page, then click the link to get there. roll over the links at left to see what's included on each page, then click the link to get there. roll over the links at left to see what's included on each page, then click the link to get there. business services & consultancy includes: roll over the links at left to see what's included roll over the links at left to see what's included on each page, then click the link to get there. roll over the links at left to see what's included on each page, then click the link to get there. issuers of news releases and not pr newswire are solely responsible for the accuracy of the content. terms and conditions, including restrictions on redistribution, apply."}, {"articleID": "2012091708_00053297_W", "names": {"Danny Rose": ["Q5220782", "Q5220783", "Q5220785", "Q83498"], "Martin O'Neill": ["Q16733787", "Q310263"], "Adam Johnson": ["Q11283718", "Q21562906", "Q37877972", "Q4679300", "Q4679301", "Q4679309", "Q51541051", "Q71239"], "Steven Fletcher": ["Q150238", "Q3499223", "Q6379374"], "Luis Suarez": ["Q26517", "Q270367"], "John O'Shea": ["Q13157342", "Q16733883", "Q306351", "Q3809517", "Q6251030"]}, "date": "2012-09-17", "url": "http://shieldsgazette.com/sport/football/sunderland-afc/rose-hopes-to-make-permanent-switch-from-spurs-to-sunderland-1-4928652", "content": "sign up for newsletter now daily news delivered direct to your inbox rosy future...sunderland loan star <mark>danny rose</mark>. published on monday 17 september 2012 09:20 debutant <mark>danny rose</mark> hopes his loan switch to sunderland will result in a permanent move to the stadium of light. england under-21 left-back <mark>rose</mark> made his black cats bow in saturday's 1-1 draw with liverpool after arriving on a season-long loan from spurs on transfer deadline day. the loan deal has no clause regarding a permanent transfer, and <mark>rose</mark> has not been given any indication from sunderland boss <mark>martin o'neill</mark> that he sees him as part of his long-term plans. but the doncaster-born playing is already looking to stay on wearside by impressing <mark>o'neill</mark> after seeing sunderland's ambition in the transfer market this summer. <mark>rose</mark> told the gazette: \"if there was a chance that i could move here permanently, i'd snatch it with both hands .\" nothing has been said of that kind. i'm just here on loan for the season, and anything after that would be a bonus. \"the gaffer just asked me to come here on loan and said i'd play more games here than i would at spurs, which is right .\" i've just got to take it game by game, and see where it takes me. \"i had interest from a couple of clubs, but once i saw the signings that sunderland had made, it was a no-brainer, and with being closer to my family as well, that helps .\" <mark>adam johnson</mark> has come from man city. he could have gone to a host of premier league clubs, but he came here. \"louis saha i was with last season, and they paid big money for <mark>steven fletcher</mark>. it just shows sunderland's intent for the season .\" <mark>rose</mark> underwent treatment on a groin strain at the academy of light yesterday - an injury which proved costly to sunderland's hopes of recording a first league victory of the campaign. the 22-year-old was struggling with the problem for several minutes before he was beaten by liverpool winger raheem sterling on the right-hand touchline, who crossed for <mark>luis suarez</mark> to level for the visitors. <mark>rose</mark> was honest enough to admit he was at fault for the goal, but says liverpool merited a point after piling on the pressure in the second half following <mark>fletcher</mark>'s third in two games for the black cats. \"just before the goal, i told <mark>john o'shea</mark> i was struggling with my groin,\" said <mark>rose</mark>. \"i said i'd give it five more minutes and look what happened .\" i don't think it's too bad, it just seems tight. i might have over-stretched for a ball, i don't know. \"hopefully when everything settles down with my body, we can assess it .\" he added: \"i was a bit disappointed with the goal which was my fault .\" i should have done better out wide and it's ricocheted off titus (bramble) and he's (<mark>suarez</mark>) tapped it in. \"it just shows at this level that you let your opponent get the better of you once, he puts it in the box and liverpool scored .\" liverpool did dominate if i'm honest. they play good football. \"obviously they've been a big unlucky with their results so far, but they dominated and we were happy with a point. transfer rumours: sunday september 9: man united, cristiano ronaldo, arsenal, theo walcott, chelsea, swansea, liverpool temperature: 7 c to 16 c wind speed: 21 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. shields gazette provides news, events and sport features from the south shields area. for the best up to date information relating to south shields and the surrounding areas visit us at shields gazette regularly or bookmark this page. can i opt out of receiving cookies? cookies are small data files which are sent to your browser (internet explorer, firefox, chrome etc) from a website you visit. they are stored on your electronic device. this is a type of cookie which is collected by adobe flash media player (it is also called a local shared object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. however, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. the types of cookies we, our ad network and technology partners use are listed below: a tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. to opt out of this type of targeting you can visit the\" your online choices' website by clicking here. google ads? our sites contain advertising from google; these use cookies to ensure you get adverts relevant to you. you can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"your online choices' website by clicking here. webtrends / google analytics? this is used to help us identify unique visitors to our websites. this data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. dart for publishers? this comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. this information is not used by us for any other type of audience recording or monitoring. comscore? comscore monitor and externally verify our site traffic data for use within the advertising industry. any data collected is anonymous statistical data and cannot be traced back to an individual. local targeting? our classified websites (photos, motors, jobs and property today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. these cookies store no personally identifiable information. grapeshot? we use grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. grapeshot stores the categories of story you have been exposed to. their privacy policy and opt out option can be accessed here. subscriptions online? our partner for newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. add this? add this provides the social networking widget found in many of our pages. this widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. temperature: 5 c to 13 c wind speed: 20 mph temperature: 6 c to 14 c wind speed: 17 mph temperature: 5 c to 14 c wind speed: 14 mph temperature: 6 c to 12 c wind speed: 12 mph"}, {"articleID": "2015082714_00092860_W", "names": {"Tom Jones": ["Q16091498", "Q16730416", "Q180850", "Q23303147", "Q23683528", "Q2439753", "Q7816364", "Q7816370", "Q927200"], "Etta James": ["Q182725", "Q52601548"]}, "date": "2015-08-27", "url": "http://new-magazine.co.uk/latestnews/view/72154/Tom-Jones-cheers-on-Paloma-Faith-at-intimate-gig/", "content": "<mark>Tom Jones</mark> cheers on Paloma Faith at intimate gig Posted: Thursday 27 Aug 2015 SIR <mark>TOM JONES</mark> proved there are no hard feelings between him and singer PALOMA FAITH over her new job on THE VOICE by supporting her at an intimate gig in London. The It's Not Unusual hitmaker publicly shamed BBC bosses on social media for telling him he was fired as a judge on the show only the day before they announced Faith and Boy George as replacements, despite <mark>Jones</mark> declaring an interest in returning for a fifth year. However, he proved there is no bad blood with the new coach on Wednesday night (27Aug15) by cheering Faith on at a small gig for 500 fans at The Savoy Hotel in London. Faith rattled through her hits and performed covers of Sinead O'Connor's hit single Nothing Compares 2 U, <mark>Etta James</mark>' At Last, and River Deep, Mountain High by Ike and Tina Turner. She says, \"Performing tonight was an incredible experience - from the intimate crowd to the beautiful venue. I love performing in my home city, and it's always great to be able to do something special for some of my biggest fans. It was great to be able to create a jazz club atmosphere and perform songs that I wouldn't normally, in relaxed surroundings .\" The gig was part of MasterCard's Priceless Surprises drive. Faith teamed up with MasterCard bosses earlier this year (15) to put on a concert for just two fans in an underground bank vault in London."}]