[{"articleID": "2014051005_00038930_W", "names": {"Dan Jones": ["Q16730398", "Q16730399", "Q20127891", "Q21466301", "Q21621611", "Q5213766", "Q5213767", "Q5213769"]}, "date": "2014-05-09", "url": "http://www.cleveland.com/metro/index.ssf/2014/05/cleveland_metroparks_zoos_caro.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to CLEVELAND, Ohio--The carousel has landed. hand-crafted wonder that the Cleveland Metroparks Zoo has awaited for more than a year is here. It is expected to open by the end of the month. Carousel Works began installing the animals Friiday - 64 in all. The company made eight that have never been produced for another zoo, including a fossa, emperor penguin, cardinal tetra fish, ocelot and ring-tailed lemur. <mark>Dan Jones</mark>, co-founder of the company, said the zoo insisted that no animal could have a traditional saddle. \"But people still need a place to sit,\" he said, and Carousel Works artisans had to come up with comfortable forms. Thus, a seahorse sports a sea shell on its back. Each animal starts as blocks of basswood, that are shaped on a machine similar to the devices that duplicate car keys. They are hand carved, hand sanded, primed, painted and varnished. Each of those processes takes place in different parts of the Mansfield factory. <mark>Jones</mark> said each figure takes up to a month, but there are enough in the production pipeline that five to seven are ready to go each week. first quarter of 2013. It is 54 feet in diameter, with 16 rows containing four animals apiece. There are also two ADA-accessible chariots. <mark>Jones</mark> said the company made one for the Bronx Zoo and all of the critters were bugs. It had 18 rows of animals. When a rival zoo ordered one, he said, they demanded more than the Bronx Zoo. On Friday, as the Mansfield team worked inside the carousel's shelter, other crews were outside completing the new Nature Discovery Ridge play area. The zoo describes it as an area designed \"to engage children's imaginations and inspire them to come out and play through the use of wild habitats and natural elements like rocks, water and trees .\" Christine Korhnak of the zoo's education division described it with elegant simplicity: \"It's the best backyard ever .\" As she spoke, Rick Pratt of Around the Bend Furniture was assembling a tent-like structure out of small logs. Pratt's specialty is making furniture our of willow branches and trunks. There are several structures in the play area that he has woven out of willow, including a conical thing somewhat like a teepee. No Reservation? No Worries: Last-minute Mother's Day suggestions for Cleveland Get the latest news delivered to your inbox plus breaking news when it happens Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy cleveland.com is powered by Plain Dealer Publishing Co. and Northeast Ohio Media Group. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Northeast Ohio Media Group LLC."}, {"articleID": "2018080113_00080676_W", "names": {"Shane Jones": ["Q3959109", "Q7488117"]}, "date": "2018-08-01", "url": "https://www.newburytoday.co.uk/news/home/25032/mammoth-wasps-nest-uncovered-in-newbury.html", "content": "Mammoth wasps' nest uncovered in Newbury <mark>Shane Jones</mark> made the extraordinary find, which contained around 10,000 wasps Fiona Tomas Contact: 01635 886639 A PEST controller who filmed the moment he uncovered a gigantic wasp nest at a house in Newbury has gone viral. <mark>Shane Jones</mark> from RIDTEK Pest Control discovered the monster nest--which was two to three feet in size--in a garage cupboard last week. The 49-year-old pest expert was alerted to the nest after the resident opened the cupboard, which had remained shut for some time. The owner reportedly \"screamed and ran\" before picking up the phone to call RIDTEK--an independent family owned pest control business which Mr <mark>Jones</mark> has been running for five years. Mr <mark>Jones</mark>, who relocated to Basingstoke from his native Australia, said he decided to film the huge nest as he didn't want to miss out on such an extraordinary find. He said: \"Last year we found a pretty big one in a loft in Tadley, but we didn't take a video of it .\" You don't come across these often. \"We deal with so many wasps nests every day, but we never really know what we're going to find - it was a good one .\" Mr <mark>Jones</mark> said this summer's hot weather has led to more queen wasps surviving in hibernation for longer, which has resulted in larger nests. \"All pest controllers are having a fantastic wasp season--it's a really big thing for us .\" This year, we are having an exceptional summer--which means there are a lot of other insects for wasps to eat. \"The whole point is that the queen wasp stays a lot longer in hibernation .\" Mr <mark>Jones</mark>, who used to work as a tour guide for crocodile and snake cruises in North Queensland, followed the normal procedure in discarding the wasp nests--by simply incinerating it. \"A wasp nest is rather fragile--it looks like they're made from paper,\" he said. \"If you touch them, they kind of crumble and collapse .\" Mr <mark>Jones</mark> said that had the nest not been found, it would have grown to a certain point before it dies. The nest was successfully removed from the cupboard and the insects released safely. Photo and video supplied by <mark>Shane Jones</mark>"}, {"articleID": "2012100903_00008976_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"], "Willie Jackson": ["Q8021593", "Q8021594", "Q8021595", "Q8021596"]}, "date": "2012-10-09", "url": "http://odt.co.nz/news/national/229554/tyson-renews-bid-visa", "content": "<mark>mike tyson</mark> immigration officials have received a second visa application for <mark>mike tyson</mark> to perform his one-man show in new zealand. associate immigration minister kate wilkinson last week revoked a visa granted to <mark>tyson</mark>, a convicted rapist, when it was revealed the life education trust, which would have been a charitable beneficiary of <mark>tyson</mark>'s appearance, did not back his visit. maori leader and broadcaster <mark>willie jackson</mark> then stepped in to offer the manukau urban maori authority's backing for <mark>tyson</mark>'s visit to new zealand. <mark>jackson</mark> wrote a letter of support which he passed on to event promoter max markson. a spokesman for ms wilkinson today confirmed her office had received a new application. the application had been passed to immigration new zealand officials, who would advise ms wilkinson before she made a decision. ms wilkinson last week would not speculate on what decision she might make. \"every situation is different with immigration matters, so i won't hypothesise .\" <mark>tyson</mark> was due to arrive on november 15 for a 20-hour visit including his appearance at auckland's vector arena. he had been granted a visa despite serving three years of a six-year sentence for raping an 18-year-old woman in 1992. anyone with a conviction of more than five years' imprisonment cannot gain a new zealand visa."}, {"articleID": "2009072109_00074904_W", "names": {"David Mitchell": ["Q16732686", "Q18719365", "Q20641188", "Q21997614", "Q24804720", "Q30347996", "Q40479", "Q43912296", "Q457134", "Q5237616", "Q5237619", "Q5237621", "Q5237622", "Q5237623", "Q5237624", "Q5237625", "Q5237626", "Q5237629", "Q52422545"]}, "date": "2009-07-21", "url": "http://itpro.co.uk/612961/microsoft-moves-into-the-shop-next-door", "content": "printed from www.itpro.co.uk register to receive our regular email newsletter at. apple's well known and sleekly designed stores have embodied the company for some time. now microsoft wants to give it a go. comment: so whilst we were all busy focusing on the fight breaking out between google and microsoft, we forgot about the existing and ongoing battle between the mac and the pc. you may want to forget the low point of <mark>mitchell</mark> and webb's career but don't pretend you can't remember the advert showing those who bought microsoft pcs as portly, dull, radio four listening <mark>david</mark> types whilst those who choose apple's macs as funky, fun, trendy robert types. got their own back with its \"i'm a pc\" range of adverts, knocking mac for its prices and essentially saying \"look buddy, we are a massive global force. don't mess with us .\" now it seems it is going one step further, trying to push apple out of its tree, by launching its own shops...next door to the apple stores. genius! what is cooler than having a massive shop on regents street? what is better than letting people actually come in and see your shiny products or enjoy the sensation of queuing for the latest release? my problem is that it is not what microsoft is about is it? i am a pc, not a mac fan. always have been and always will be to the dismay of both my boyfriend, sister and the vast majority of my colleagues. but i have never for one second seen it as the cool kids' option. it works - ok, exclude vista from this description - it does its job, is solid, safe and comfortable. perhaps it is like <mark>david mitchell</mark>, but guess what? i like him and radio 4 for that matter! apple to me is all about the presentation. the sleek macbook air, the trend-setting ipod, the record breaking iphone, that god awful clinical white colour that adorns most of its products. the shop sticks to the same style and that is why it works - it is for show. microsoft is about the product. the operating system, the browser and now the slightly cooler search engine. but i am not going to be queuing up around the block want more background on today's hottest it trends? for more on virtualisation, encryption and other topics. you'll get exclusive member benefits including free whitepapers, downloads, webinars and weekly newsletters"}, {"articleID": "2014091006_00014977_W", "names": {"Ray Rice": ["Q1523516", "Q23823439"]}, "date": "2014-09-10", "url": "http://staradvertiser.com/news/breaking/20140909_domestic_violence_victims_often_in_denial_experts_say.html", "content": "Domestic violence victims often in denial, experts say Janay <mark>Rice</mark> listened as her husband, Baltimore Ravens running back <mark>Ray Rice</mark>, spoke during a May 23 news conference at the team's practice facility in Owings Mills, Md. (AP Photo/Patrick Semansky, File) \"I woke up this morning feeling like I had a horrible nightmare, feeling like I'm mourning the death of my closest friend. But to have to accept the fact that it's reality is a nightmare itself. No one knows the pain that the media & unwanted (opinions) from the public has caused my family,\" said the woman who was punched unconscious by the semifamous football player, then her fiance, now her husband. \"To take something away from the man I love that he has worked his a--off for all his life just to gain ratings is horrific. THIS IS OUR LIFE! What don't you all get. If your intentions were to hurt us, embarrass us, make us feel alone, take all happiness away, you've succeeded on so many levels .\" \"No,\" said Nikki Daniels, a therapist in Tampa who works with survivors of trauma and abuse. \"No,\" said Rod Reder, the vice president of the Tampa-based National Institute of Crime Prevention. \"Not at all,\" said Douglas Covington, the head of misdemeanors, including domestic violence, at the Hillsborough County State Attorney's Office. \"I would be surprised if she had said anything else,\" said Teresa Drake, a national lecturer on domestic violence from the University of Florida's Levin College of Law. This started in an elevator in a casino in Atlantic City, N.J., on Feb. 15, when <mark>Ray Rice</mark>, a well-regarded running back for the NFL's Baltimore Ravens, hit Janay Palmer, the mother of his young daughter. A first video clip - released a few days later - showed only the woozy, rag-doll aftermath. A second video clip - released this week - showed the actual act, a left cross to the face, her head banging off a railing as her body fell heavy to the floor. In the not-quite-seven months in between, <mark>Rice</mark>'s attorney said that \"when this matter is fully tried and completed, you'll have a better understanding of what happened,\" his coach called him a \"heck of a guy,\" and many of his fans continued to wear replicas of his jerseys, saying his wife had forgiven him and he was \"still a good man .\" He married the woman he hit, whom he has known since 10th grade, telling her, \"Love is patient, and love is kind, and we made it,\" in a ceremony a day after he had been charged with aggravated assault. He pleaded not guilty and entered a lenient program for first-time offenders. The NFL suspended him for two games. He apologized at a news conference for \"the situation my wife and I were in .\" She apologized at the same news conference for her \"role in that night .\" Only after the second, even more ghastly clip did the Ravens release him, and his five-year, $40 million contract, and did the NFL suspend him indefinitely, prompting Janay <mark>Rice</mark> to get on Instagram and say what she said. Her comments, said Tara N. Richards, an assistant professor at the criminal justice school at the University of Baltimore, \"may seem counterintuitive to how people think a victim\" should' think or feel. But research demonstrates that victims of domestic violence often do not identify as victims, that they often blame themselves for the violence, and they often want the violence to stop, but not necessarily the relationship. \"\"Sometimes,\" Tampa police Detective Paul Northrop said, \"it's hard to convince a victim they are truly a victim .\" \"It's embarrassing and humiliating to be a victim,\" said Reder, from the National Institute of Crime Prevention. An assault of this sort, caught by a camera or not, and most are not, is seldom an aberration. Almost always, the experts say, it is a portion of a pattern of coercion and control. \"I'm sure right now she believes this is us against them,\" said Drake, from UF's law school. \"I'm sure it's how he's positioned it. Batterers can be very manipulative .\" If she had Janay <mark>Rice</mark> in her office in Gainesville, she said, she would show her the so-called power and control wheel, a visual highlighting the threats, the isolation, the intimidation, the economic abuse, the emotional abuse. \"You don't deserve that,\" she said. \"You deserve better than that .\" (3) You must be subscribed to participate in discussions By participating in online discussions you acknowledge that you have agreed to the check out gavin de beaker's \"gift of fear\" book for information on how to detach from violent stalkers, partners and abusers."}, {"articleID": "2018041721_00381670_W", "names": {"Robert Murray": ["Q16149751", "Q16193097", "Q43910843", "Q7347885", "Q7347887", "Q7347888", "Q7347889", "Q7350719"], "Bill Johnson": ["Q16204402", "Q17385655", "Q17626755", "Q21585452", "Q24817767", "Q2903258", "Q30717048", "Q3366808", "Q339036", "Q48645040", "Q4909622", "Q4909623", "Q4909624", "Q4909626", "Q56558077", "Q720797", "Q862215", "Q862229"], "Kevin Mcintyre": ["Q6396944", "Q6396945"]}, "date": "2018-04-17", "url": "https://thinkprogress.org/ohio-lawmaker-tells-ferc-coal-ceo-robert-murray-is-unhappy-ac7f2fce7385/", "content": "Ohio lawmaker tells federal regulators that <mark>Murray</mark> Energy's CEO is unhappy with them Coal industry interests have financed Rep. <mark>Bill Johnson</mark>'s campaigns. SHARE Facebook Twitter Email SMS WhatsApp Share Rep. <mark>Bill Johnson</mark>, R-Ohio, questioned FERC commissioners on April 17, 2018, about their decision to reject a DOE proposal to subsidize coal and nuclear plants. CREDIT: Tom Williams/CQ Roll Call An Ohio congressman who receives a large portion of his campaign contributions from coal industry interests informed members of the Federal Energy Regulatory Commission (FERC) on Tuesday that one of his most important constituents--<mark>Murray</mark> Energy CEO <mark>Robert Murray</mark>--is not happy with their decision to reject a Trump administration proposal to subsidize coal and nuclear power plants. Rep. <mark>Bill Johnson</mark> (R-OH), who represents the small Ohio town where <mark>Murray</mark> Energy is headquartered, told the regulators at a House committee hearing: \"I take notice when major employers in my district speak out on this issue. For instance, the CEO of <mark>Murray</mark> Energy recently stated that FERC did not do its job when it rejected this proposal .\" Advertisement <mark>Murray</mark> has been highly critical of the commission's decision in January to vote down Energy Secretary Rick Perry's proposed taxpayer bailout of coal and nuclear power. He has accused the agency's two Democratic commissioners, Richard Glick and Cheryl LaFleur, of political bias, saying they will never support coal or nuclear power. Two of the three Republicans who voted against Perry's proposal, Chairman <mark>Kevin McIntyre</mark> and Commissioner Robert Powelson, \"are wrong in their decision and it needs to be overturned,\" the coal executive told CNBC in January. Filthy Five: New House Energy Committee Members Ignore Climate While Taking $1.7 Million From Fossil Fuels All five FERC commissioners were present at the House Energy and Commerce Energy Subcommittee hearing on Tuesday, where they discussed the agency's fiscal 2019 budget and the agency's top priorities. Advertisement <mark>Johnson</mark>, who has received $13,040 from <mark>Murray</mark> Energy PACs and individuals during the current election cycle, kicked off his questioning by telling the commissioners he's been closely following the discussion surrounding the Department of Energy's proposed rule. \"These issues hit especially close to home,\" <mark>Johnson</mark> said, referring to the heavy amount of coal mining and natural gas production that occurs in his congressional district. <mark>Johnson</mark> has represented the 6th district of Ohio since 2011. Over that time, he has gained a reputation as one of the most right-wing members of Congress. In 2016, <mark>Johnson</mark> called the Environmental Protection Agency \"un-American\" and accused it of \"draining the lifeblood out of our businesses .\" <mark>Johnson</mark>'s district runs along the southeast of Ohio, bordering Kentucky, West Virginia, and Pennsylvania. He has said that because he \"is a scientist\" (he has a degree in computer science), he does not accept the science of human-caused climate change. \"I am not an alarmist that believes that greenhouse gas emissions coming from the coal industry are causing major problems,\" he said in 2011. House Hearing On EPA Rule Turns Ugly As Rep Calls Regulations \"Un-American' In late September, Perry sent the proposal to FERC--called a grid reliability and resilience pricing plan--that would subsidize struggling coal and nuclear plants in the name of keeping power grids dependable. Many viewed the proposal as an unprecedented and unnecessary intrusion by an administration into the operations of an independent federal agency. Advertisement FERC, by a vote of 5-0 in January, didn't buy Perry's reasoning. The unanimous vote is especially notable since 3 of the 5 commissioners are Trump appointees. <mark>Murray</mark> told Bloomberg News at the time that four of the five members\" defaulted \"on their duties by refusing to support the plan and should be fired. Meanwhile, according to <mark>Murray</mark>, FERC Commissioner Neil Chatterjee, who also voted to reject the plan, should not be fired because he was\" overwhelmed \"by the other four. Chatterjee sounded apologetic when he explained to <mark>Johnson</mark> during Tuesday's hearing why he voted against Perry's proposal .\" While I have deep sympathy for the sentiments that Mr. <mark>Murray</mark>, the folks in your community are expressing and the concerns they have about the economic impact, the job impact, the cultural impact of these [plant] shutdowns, from the seat I sit in now, our record simply didn't support taking action at that time, \"he said. <mark>Johnson</mark> specifically targeted Commissioner Robert Powelson for comments he made on Twitter about the coal CEO's criticism of FERC. Here's the now-deleted Tweet...pic.twitter.com/ZLeFgKsEwa--Sam Mintz (@ samjmintz) April 10, 2018 Last week, in a tweet, Powelson noted that <mark>Murray</mark> blamed the\" feckless \"FERC for not approving the plan to boost coal and nuclear plants .\" I challenge Mr. <mark>Murray</mark> to a debate on CNBC or Fox News, \"he wrote in the tweet. Advertisement <mark>Johnson</mark>, in reference to the tweet, said:\" Commissioner Powelson, I believe you recently made some comments indicating that you disagree with Mr. <mark>Murray</mark>. Can you expound on that? \"\"I take offense to the word feckless being used to [describe] colleagues who I serve with here,\" Powelson responded. However, the commissioner added he realized his tweet, which he later deleted, was \"inappropriate\" and \"I dialed it back rather quickly .\" "}, {"articleID": "2016092216_00077593_W", "names": {"Krishna Rao": ["Q16734981", "Q16963271", "Q47100421", "Q6437482"]}, "date": "2016-09-22", "url": "http://www.rediff.com/business/report/mallya-saga-ex-kingfisher-cfo-sent-to-prison-for-18-months/20160922.htm", "content": "Rediff.com & raquo; Business & raquo; Ex-Kingfisher CFO sent to prison for 18 months Ex-Kingfisher CFO sent to prison for 18 months September 22, 2016 21:09 IST A total of 17 cases have been filed against Kingfisher Airlines in different courts over outstanding amount of Rs 22.5 crore, which it owes to GMR A Hyderabad court, on Thursday, sentenced A Raghunathan, former CFO of Kingfisher Airlines Ltd, to 18 months imprisonment in connection with two cheque bounce cases filed against him and businessman Vijay Mallya by GMR Hyderabad International Airport Ltd.. Third Special Court Magistrate M <mark>Krishna Rao</mark> also imposed Rs 20,000 fine in each case on Raghunathan after the latter appeared before the court. Earlier, on several occasions, the order on quantum of punishment had got adjourned as the warrant issued against Raghunathan was still pending. The court had on April 20 convicted Kingfisher Airlines, Mallya and Raghunathan, in connection with two cheque bounce cases involving Rs 50 lakh each, under relevant sections of the Negotiable Instruments Act. The matter relates to cheques issued by Kingfisher Airlines Ltd to GMR Hyderabad International Airport Ltd (GHIAL), which operates Rajiv Gandhi International Airport, towards charges for using the facilities at the airport for Kingfisher Airlines flights. During arguments today, GHIAL counsel G Ashok Reddy submitted that it was after five months Raghunathan had finally appeared before this court. He further informed that Vijay Mallya is absconding and is out of the country, and sought the court to proceed with sentence order against Raghunathan. R aghunathan's counsel said that several warrants were issued by different courts and he was unable to appear before this court. He sought for splitting the case against Raghunathan. He had appeared before other courts in the past few days in connection with NBWs issued against him after he had moved the high court, and got the warrants recalled. Reddy argued that the high court in its order (for recall of NBWs) had \"made it clear that its order will not stand in way when the matter reached at the stage of judgement, pronouncement of sentence or conviction of the accused in the case\". The court had earlier issued non-bailable warrants against Kingfisher Airlines, its chairman Mallya and Raghunathan on the ground of dishonouring the two cheques. It had earlier said that before imposing the quantum of punishment, it would hear the plea of the convicts (Mallya and others, who had so far not appeared/attended the court), and then pass its order with regard to sentencing them or imposing fine or both. As per the GMR counsel, a total of 17 cases have been filed against Kingfisher Airlines in different courts over outstanding amount of Rs 22.5 crore, which it owes to GMR. The cases are in different stages of trial. T he magistrate told Raghunathan that he has been found guilty under relevant sections of Negotiable Instruments Act. Raghunathan told the court that \"I was only an employee of United Spirits Limited. I was on rolls of United Spirits. My services seconded to Kingfisher Airlines Limited. I was always an employee of United Spirits and retired in July 2013 .\" The magistrate, in his order, sentenced Raghunathan to undergo one year and six months imprisonment and also imposed a fine of Rs 20,000 in each case. The magistrate further said Raghunathan can file appeal against the judgement of this court in the case. Ashok Reddy, citing certain court rulings, submitted that this court can pass sentence against the company and also against Vijay Mallya. \"One of the accused is present in the court and the court is requested to also sentence Kingfisher Airlines and Vijay Mallya, to avoid delay. Not withstanding absence of Vijay Mallya, the court can sentence and impose fine against Vijay Mallya,\" Reddy submitted. \"Entire country knows where he (Mallya) is staying...he may not come back. It will take years to bring him back to India. At least fine can be imposed against the company,\" he further said. Photograph: Vivek Prakash/Reuters & copy; Copyright 2016 PTI. All rights reserved. Republication or redistribution of PTI content, including by framing or similar means, is expressly prohibited without the prior written consent."}, {"articleID": "2018090320_00247166_W", "names": {"Steve Saunders": ["Q11950377", "Q42421831", "Q7613853"]}, "date": "2018-09-03", "url": "http://www.lightreading.com/messages.asp?piddl_msgthreadid=76958&piddl_msgid=289795&piddl_msgtocontent=yes#msg_289795", "content": "21st Century Networking? Welcome to the Lock-In From the Founder <mark>Steve Saunders</mark>, Founder, Light Reading 2/20/2018 Comment (24) Login 100% 0% Tweet Industry pundits are fond of saying that the communications market is in the middle of \"unprecedented\" innovation. Not true. We've actually seen this level of creativity before--way back in the 1970s. That was the era when developments in microprocessors set off a huge explosion in computing. And yet it was also when success was constrained by the proprietary nature of the technology. As the customer, you bought your computer from IBM, DEC, Wang (heh), Honeywell or whoever, and you used the code (today we call them \"applications\" ) that the manufacturer sold with their massive computer box thingy. It was the first and biggest technology \"user lock-in\" that the computer tech industry had seen. And customers paid the price--figuratively and literally. Today, it looks like we're heading back to that proprietary environment. And the effect on end users--enterprises and service providers--will be the same: Paying more money for less choice. Want to learn more about 21st Century networking? Join me at Light Reading's Automation Everywhere on April 4 in Dallas. We will be tackling the business and technology challenges behind driving network automation. The event is free for communications service providers--register today! Why is this happening? Back in the 1970s the proprietary nature of computing triggered a visceral reaction in the adjacent world of communications, as standards bodies such as the International Telecommunication Union (ITU) and Institute of Electrical and Electronics Engineers Inc. (IEEE) took a stand to make sure that technologies that were vital to the growth of the global economy couldn't be co-opted by a single vendor. Vendors took these standards seriously, for very good reason, knowing that if they didn't comply they'd be left on the outside of a free market technology economy/ecosystem comprising a bunch of standards-compliant competitors. But then, somewhere in the first decade of the 21st century, our industry forgot about the importance of standards. Oops. Partly this was because of the undeniable appeal of \"open source .\" It's not hard to see why, with so many instances of open source code being successfully deployed in telcos around the world, our industry thought the same approach could work when virtualization became the \"next big thing .\" In the case of SDN virtualization, to a certain extent it has. But with the exponentially more complicated world of network functions virtualization (NFV), it has been a disaster. In fact, in my view, far from being \"open,\" the work on NFV has turned out to be both proprietary--nothing more than a giant production line of poorly thought-out and utterly incompatible code--and massively political (think Brussels bureaucracy, but for computers). The result is that, as an industry, we've spent the past five years making an utter balls-up of determining the new software-based infrastructure that will form the underlying foundation for all applications and services in the future. Instead of a clearly defined network layer, we now have a jumble of incompatible approaches to NFV, none of which work together without a huge lift involving lots of expensive lab work. Indeed, more than five years after NFV first became a \"thing\" in telecoms, Heavy Reading surveys of the world's major operators show that interoperability and the integration of virtualization technology with legacy technology is still the biggest barrier to successful NFV implementation. Network operators will struggle to find a \"Get out of lock-in free!' card once they're trapped behind vendor bars. Ironically, recent industry efforts to demonstrate NFV interoperability have actually shown how hard it still is to get virtualization products from different vendors to work together. Participants at ETSI's most recent NFV Plugfest event in January this year say the only way to get products from 24 of the 25 participants to\" talk \"to each other was by manually hard-coding the buggers--a process that does little more than allow vendors to feel a bit better about themselves and be able to claim some sort of interop success. (Note: The one exception to this manually-intensive exercise at the Plugfest was EnterpriseWeb, a company that has developed middleware that provides interconnectivity between different products without the need for hard coding and which, according to testimony seen by Light Reading, delivered on its promises. Disclosure: I am an advisor to EnterpriseWeb .) This is not how technology in the 21st century is supposed to work! No simple, plug-and-play interoperability = No falling prices = No free-market-technology-economy-soup for you! This doesn't mean we don't have innovation galore in the industry right now. The cost of entry for companies that want to code new and exciting applications and services is, as the US President is want to say, a small loan of a million dollars. That's literally all it costs to put together the software engineering team and servers that are required. What it does mean is that the software they produce won't work over the networks for which it's designed without a ridiculous amount of trial and error. And expense. My suspicion is that a lot of the incumbent vendors aren't so unhappy about how things have played out. If you're a company caught in the crosshairs of a rapidly shifting and increasingly unpredictable market, such as Ericsson or Nokia, for example, and the comms market isn't delivering the revenues you thought it would, the idea of jumping into a time warp--Weeeee!!!--back to a world where you can charge more and the customer has fewer options probably sounds, well, brilliant! But I'll tell you who isn't thinking like that, though--the Chinese. When the New IP Agency (NIA), a not-for-profit organization that I help run, recently announced the industry's first and only independent, open, NFV interoperability certification, designed to clear up the current miasma, Huawei and ZTE were the ones that signed up to be certified first. (See NIA to Tackle NFV's Ball & Chain: Interoperability .) These companies understand that having virtualization technology that is proven to work with code from third parties--yes, even from their competitors--and then have the results and methodologies made public so they can be accessed and referenced, is the only way to assuage the concerns of service providers and light a fire under the virtualization market. And if vendors in the rest of the world don't follow the example of the Chinese--and soon--we are going to end up with a situation where the Chinese beat them at a game that the West invented (successful, interoperable, standards-based technology). Last week I was visiting an enterprise organization in North America that is deploying one of the most advanced networks in the world--a software-based, virtualized architecture with analytics and automation capabilities. The. Whole. Nine. Yards. I asked them if they weren't worried about the fact that today's next-gen applications aren't readily interoperable with the virtualization infrastructure from third-party suppliers .\" Oh no, \"came the answer .\" We're a Cisco shop. \"From that statement, it's just a short hop to\" no one ever got fired for buying IBM. \"And then getting fired for buying IBM .--<mark>Steve Saunders</mark>, Founder, Light Reading (24) | Comment | Print | RSS"}, {"articleID": "2017051109_00347436_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "Luis Suarez": ["Q26517", "Q270367"]}, "date": "2017-05-11", "url": "https://www.thisisanfield.com/2017/05/iago-aspas-failed-liverpool-career-ending-man-uniteds-europa-league-hopes/", "content": "Ex-Liverpool striker Iago Aspas has no problems with his troubled campaign on Merseyside in 2013/14, having recaptured his form at Celta Vigo. Aspas spent two short years on the books at Anfield, but only one season with the Reds, making 15 appearances during their ill-fated title challenge. The Spaniard scored just one goal, laying on another, with the enduring memory of his time with the club a weak attempted corner in an eventual 2-0 loss to Chelsea at Anfield. Aspas left to join Sevilla on loan in 2014, finally ending up back with Celta a year later. There, he has revived his career, scoring 42 and assisting 13 in 85 appearances so far, as well as a sensational goal on his debut for Spain against England in November. Thursday night gives Aspas the chance to prove himself again to a wider audience, when Celta take to Old Trafford for the second leg of their Europa League semi-final clash with Man United. And Aspas is eager to put Jose Mourinho's side to the sword, to repay Liverpool supporters after his failure in the Premier League. ▼ Article continues below ▼ \"It was a great season for Liverpool...I just wish I could have played a bigger part,\" he told the Mail. \"The corner is the last memory they have of me but football always gives you another chance .\" Let's hope the new lasting memory of me in England is knocking Manchester United out of Europe, for the sake of Celta Vigo, and for the happiness it would bring to Liverpool supporters too. \"Aspas has previously been criticised for his failure to integrate at Liverpool, often resembling a spare part in <mark>Brendan Rodgers</mark>' formidable squad. This saw him play just 468 minutes in all competitions, but the striker believes there are mitigating factors behind his struggle: chiefly, the form of <mark>Luis Suarez</mark> and Daniel Sturridge .\" Sturridge scored 22 league goals, I think, and <mark>Luis</mark> 31, so it's normal that I didn't get many chances, \"he explained. ▼ Article continues below ▼\" It didn't annoy me; I understood that I couldn't play with them at that level. \"There was also a culture shock for Aspas, who left Liverpool unable to speak English, having travelled over with his family and spoken to <mark>Rodgers</mark> in his native tongue. All that matters now, however, is victory over United, and Aspas will have the backing of his old supporters on Thursday .\" I know that Liverpool fans want Manchester United to lose just as United fans wanted Liverpool to be beaten by Sevilla in last year's Europa League final, \"he said .\" We have to play with no fear; only a win will do so we have to go for it. \""}, {"articleID": "2018102116_00114960_W", "names": {"George David": ["Q5535947", "Q5538395"]}, "date": "2018-10-20", "url": "http://www.sailingscuttlebutt.com/2018/10/20/grand-harbour-releases-rolex-middle-sea-race/", "content": "News Grand Harbour releases Rolex Middle Sea Race Published on October 20th, 2018 Valletta, Malta (October 20, 2018)--The 50th anniversary Rolex Middle Sea Race is underway as a record fleet of 130 yachts waved its way by large crowds filling the bastions of Valletta and the Three Cities, and other vantage points. Grand Harbour is a magnificent location in its own right. Each year, the lily is gilded by an intrepid fleet of Corinthian and professional sailors, adventurers and voyagers, all determined to take on the challenge presented by this classic 606nm offshore race. By 17:00 CEST, the majority of the fleet was hard on the wind heading for Capo Passero on the southern tip of Sicily. The heavier displacement boats are enjoying the upwind conditions. Strategic decisions are beginning to play out, with most staying north of the rhumb line. Approaching the land, the breeze looks to be shifting and fading. Staying in the best pressure to round the cape will be the common goal. <mark>George David</mark>'s Maxi American Rambler 88 is leading the charge in the monohull fleet, with their closest rivals on the water two miles behind: Dieter Schön German Maxi72 Momo, and the 115ft Baltic Nikata. In the Multihull fleet, Giovanni Soldini's Maserati and the Ned Collier Wakefield skippered PowerPlay were in close combat just off the coast of Sicily, locked in a duel, having blasted close to 70 miles upwind in just four hours. Just before going to press, Maserati reported suffering damage to the starboard rudder. She continues to race and the extent of the problem is being examined. The start line between the Saluting Battery on the Valletta side and Fort St. Angelo, on Birgu, is an intimidating setting. Atmosphere and tension within the crews is heightened by the crash of cannon fire for each of the seven starts. A 15 knot north-easterly developed a building sea-state outside the breakwater, but importantly meant each start was able to get away in breeze. First away was the four boat Multihull class. Two pairs of contrasting boats making up this compact, but nevertheless impressive-looking division. PowerPlay got the better of Maserati in the battle of the MOD70 racing trimarans, while Allegra was quicker off the mark than R-Six. Tacking a multihull is tricky at the best of times, within the gusty confines of the starting arena it becomes an art-form. PowerPlay's on-the-money start allowed her to choose her lanes and she led the class out of the harbour. For the considerably more numerous monohull contingent, the starts come in size order with the smallest and slowest going first. Class Six was marked by a number of double-handed crews, including the Austrian entry 2Hard, British yacht Jangada and the 2017 Overall Winner, Bogatyr. Having won the race fully-crewed last year, the owner, Igor Rytov, has chosen to take on the course short-handed. Few would bet against him pulling off another remarkable achievement given his early commitment. The Russian's competitive edge got the better of him at the start, with Bogatyr over the line early requiring a frustrating turnabout to restart. Rytov, though, then lit the afterburners and by the turning mark off Dragonara was back amongst his classmates. Seawolf looked to have the best start, but by the harbour entrance Timofey Zhbankov's Rossko was out in front. The last start was reserved for most powerful yachts in the fleet. The eight-boat class was one of contrasts. The mammoth 115-foot Nikata, the largest yacht ever to start the Rolex Middle Sea Race, towering over the likes of the 60-footers Wild Joe and Oz, at almost half the length. Rambler 88, the three-time Line Honours winner, with her all-star crew led by owner <mark>George David</mark>, with Brad Butterworth and Silvio Arrivabene providing tactical advice and navigational input, was handed a lesson off the line by the Maxi 72 Momo. Just past the harbour entrance turning mark, normal order resumed with Rambler broadening her sailing angle and using her performance-enhancing assets to rapidly reel in and overtake the German pretenders. The starts sandwiched between these two were just as dramatic, just as exciting. The breath-taking amphitheatre offered by Grand Harbour provides a start environment the equal of any other 600nm offshore classic. Sir Robin Knox-Johnston, one of the race's guests of honour, may have seen it all over the years, but even he was enthralled, admiring the scene from the Saluting Battery: \"It's a truly impressive spectacle; what a place to start a race .\" Ahead of race start, crews made their last-minute preparations. Loading provisions, checking personal kit, saying their goodbyes to loved ones. The anticipation for the adventure ahead was tangible. Italian sailor, Andrea Iacopini, racing aboard Amapoula, is taking part for the fourth time. Uncertain of the weather, he was clear in his appreciation of the course: \"It's the most incredible race I've done. Volcanoes, islands, currents, tides, wonderful colours. It is definitely the most beautiful race in the world .\" Even professional crew, like Laurent Pages sailing on Eric de Turckheim's Teasing Machine in his third Rolex Middle Sea Race, are able to look beyond the immediate tactical battles to appreciate the race environment: \"The attraction of this race is a combination of things: technically it's very intense, from the start in Grand Harbour to the strength of the fleet, which always makes it a real challenge. And, the course that goes around Sicily, so Etna, Messina Strait, Stromboli and all the other spots is simply quite amazing. Nicolas Ibanez Scott, owner of Chilean yacht Anita, took part for the first-time last year. Back again for another go despite the beating given by the weather conditions in 2017, Ibanez was looking forward to the race ahead:\" Last year it was rough, it was tough, the weather was hard. We are enthused to be going again. There are great teams out there and we hope to enjoy a fine race, with better winds. In terms of strategy, we have a much clearer view of what we should do and should try to avoid. We feel better prepared, but that doesn't mean it will be any easier. It's fascinating and a privilege to be a part of this great race. \"Royal Malta Yacht Club Principal Race Officer, Peter Dimech, was delighted to have got the full fleet away on time and without issue:\" It went like clockwork with all starts on time. Although the fleet had at least one tack in harbour, it all went smoothly and they cleared the harbour without any incident. \"CLASS ANALYSIS AT 17:00 CEST: IRC Two: the Andrea Calabria skippered Swiss Swan 82, 2nd Chance, is revelling in the upwind conditions, Vadim Yakimenko's TP52 Freccia Rossa is going well after a cracking start, as is Eric de Turckheim's French NM54 Teasing Machine, and Vincenzo Addessi's Italian Mylius 60, Fra Diavolo. IRC Three: Dominique Tian's French Ker 46, Tonnerre de Glen, leads on the water by two miles from Vittorio Biscarini's Ars Una. Ramon Sant Hill & Jonas Diamantino's Maltese Farr 45, Comanche Raider III, has made an impressive start and is in the mix with the leaders. IRC Four: Swan 651 Lunz Am Meer, skippered by Riccardo Genghini, has been in her element upwind. Philippe Franz's NM43 Albator is holding on to their bigger rival, just ahead of Frank Werst's Swan 53 Silveren Swaen. The Podesta family racing the Maltese First 45, Elusive 2, is among the front-runners, and holding off their local rivals, Josef Schultheis & Timmy Camilleri on the Xp-44, XP-ACT. IRC Five: Jonathan Gambin's Maltese Dufour 44, Ton Ton Maltacharters, leads on the water from two well-sailed French teams: Géry Trentesaux's JPK 11.80 Courrier Recommandé and Yves Grosjean's J/133 Jivaro. IRC Six: Rossko, skippered by Timofey Zhbankov, holds lead from a trio of boats just a mile astern: Gerard Ludovic's Solenn, Igor Rytov's Bogatyr, and Piercarlo Antonelli's Bora Fast. Event Details--Entry List--Tracker--Facebook 606 nautical mile course Source: Royal Malta Yacht Club Tags: Rolex Middle Sea Race Related Posts Blown away by the Rolex treatment → Record fleet for Rolex Middle Sea Race → Fifty Years of Middle Sea Race → Middle Sea Race Celebrates Milestone →"}]