[{"date": "2015-12-13", "url": "http://www.csnmidatlantic.com/football-baltimore-ravens/talk/harbaugh-worst-game-weve-played-all-year", "content": "<mark>Harbaugh</mark>: \"Worst game we've played all year' Submitted by Anonymous (not verified) on Sun, 2015-12-13 17:18 Your browser does not support iframes. <mark>Harbaugh</mark>:\" Worst game we've played all year' December 13, 2015, 4:45 pm Share This Post Comments BY ERIC GARLAND, CSNmidatlantic.com Ravens head coach <mark>John Harbaugh</mark> didn't mince words during his postgame press conference, calling his team's blowout loss to the Seahawks \"the worst game we've played all year .\" \"We had assignment issues, we had technique issues, we didn't match up correctly, it was bad,\" he said of the team's 35-6 loss to Seattle. Seahawks quarterback <mark>Russell Wilson</mark> crushed the Ravens secondary, throwing for 292 yards and five touchdowns, but <mark>Harbaugh</mark> wouldn't call out any specific player despite the poor outing. \"It's no individual guy's fault, it's just not as good as it needs to be,\" <mark>Harbaugh</mark> said. \"I'll take responsibility for that. We've got to play way, way better pass defense .\" The offensive side of the ball wasn't much kinder to the Ravens, with fill-in quarterback Jimmy Clausen throwing a pick and having no touchdown passes. The Ravens also only gained 17 yards on the ground as a team. \"We just have to find a way to play better as a football team,\" <mark>Harbaugh</mark> said. Watch <mark>Harbaugh</mark>'s full press conference in the video above.", "articleID": "2015121322_00324636_W", "names": {"John Harbaugh": ["Q2412102", "Q29344932"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"]}}, {"date": "2015-12-14", "url": "http://wjcl.com/news/national-international/sleeping-polar-bear-cub-captures-hearts/110369445/story", "content": "Published 12/14/2015 02:53 AM EST Updated 12/14/2015 02:53 AM EST (CNN) A sleepy polar bear cub and her stuffed moose pal are making observers at Columbus Zoo and Aquarium in Ohio say \"Awww .\" The zoo posted a video update Friday to its Facebook page featuring the 5-week-old cub, who can't completely open her eyes yet but has hearts aflutter with her sleepy purring and lolling tongue. \"The care staff says the sound that she makes in the video is of contentment,\" the zoo's Facebook post says. The video is providing viewers several moments of contentment too, as they take in the mega-cuteness of the cub cuddling with a stuffed animal and snoozing. The cub, which weighs 4 pounds and is 16 inches long, is doing well, zoo officials say. \"Her motor skills are improving each day and she has started trying to stand up on all fours, especially when she's ready for her next meal!\" The cub was born to Aurora, one of three adult polar bears living at the zoo, on November 6. A second cub delivered by Aurora did not survive. The surviving cub was pulled from her mother's den a week after birth because Aurora began only sporadically caring for the newborn. Zoo staff have been monitoring the cub's progress around the clock, as polar bear cubs are delicate and many don't survive the first few weeks. \"Polar bears, much like giant pandas, are highly specialized animals that give birth to very small babies which makes them fragile during their first year of life,\" <mark>Jennifer Wilson</mark>, the zoo's director of communications, said in a press release. \"Survival rates in human care are around 50 percent which is similar to that of wild bears .\" Copyright 2015 Cable News Network/Turner Broadcasting System, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2015121408_00185101_W", "names": {"Jennifer Wilson": ["Q3177119", "Q6178946"]}}, {"date": "2015-12-15", "url": "http://www.adweek.com/fishbowldc/weta-and-wbal-win-dupont-awards/152281", "content": "Washington public television station WETA and Baltimore's WBAL are among the 16 winners of the Alfred I. duPont-Columbia University Awards, announced this morning by NBC News special correspondent Tom Brokaw. The annual award recognizes broadcast, documentary and digital works that are well-crafted, well-reported and serve the public interest. WETA wins for a <mark>Ken Burns</mark> - produced, Barak Goodman - directed documentary series that examines the history, science and politics of cancer, as well as the lived experience of the people and families it affects. The series takes its name and inspiration from Siddhartha Mukherjee \"s book The Emperor of All Maladies. WBAL is honored for its breaking news coverage following the death of Baltimore resident Freddie Gray from injuries sustained under police custody .\" Investigative reporter Jayne Miller led the way locally and nationally on the investigation into what happened to Freddie Gray. Gray was arrested and injured on April 12, 2015. Miller immediately started questioning the official story, \"reads the citation .\" Her exemplary reports raised important questions about probable cause, police policy, and accountability. Miller asked probing, smart questions and followed up with clear analysis of a fast changing story. \"This year the committee also handed out its first ever award to a podcast, to WBEZ and This American Life for the first season of\" Serial. \"The Jan. 19, 2016 awards ceremony will take place in New York at Columbia University, hosted by Tom Brokaw and ABC News Nightline anchor Juju Chang. A livestream will also be available.", "articleID": "2015121519_00351577_W", "names": {"Ken Burns": ["Q1106967", "Q616886"]}}, {"date": "2015-12-15", "url": "http://www.vulture.com/2015/12/fargo-season-three-2010-selfie-culture.html", "content": "On Tuesday, FX president John Landgraf and Fargo executive producers Noah Hawley, Warren Littlefield, and <mark>John Cameron</mark> held a Q & A with the press that covered everything from the third season of the anthology series to, yes, those UFOs. Co-creator Noah Hawley said he has already written the first episode of the next season and is currently working with his writing staff on outlining the rest of the episodes. Because the series is set in the winter, production will begin next November in Alberta, Canada, and the series won't premiere until spring 2017. Read on for more from Hawley on season three, and some closure on season two. The third season will move forward to 2010 and deal with our \"selfie-oriented culture .\" \"It's a more contemporary story, and I think that's exciting. Our first year was set in 2006, but we didn't really deal with what it was like to be in that region in a more contemporary world. I like the idea that we're now living in a very selfie-oriented culture where people photograph what they're eating and put it up for other people to see. It feels like a social dynamic that is very antithetical to the Lutheran pragmatism of the region. So many of our crime stories are based on the difficulty that people have expressing themselves and communicating. In a lot of ways, the tragedies that are at the heart of these crimes could all be averted if Jerry Lundegaard (William H. Macy) could have asked his father-in-law for the money or if Lester (Martin Freeman) could have been honest about who he was, or Peggy (Kirsten Dunst) as well. I like the idea of setting up these pragmatic and humble people against the culture of narcissism and [seeing] what that generates for us, story-wise .\" The main characters from season one will not be in the third season. \"None of the main characters from our first year will be back for our third year. The risk we take, obviously, is that we say at the beginning it's a true story. It's what Joel and Ethan Coen did in the movie, and what made the movie so powerful and poignant is that it ended. The danger of bringing them back and putting them through their paces for another crazy case [is] the artifice of the whole thing becomes too clear. That's not to say one of our stories might not intersect with characters we've seen before for a certain period of time .\" In the first season, Lou Solverson (Keith Carradine) told his daughter about the 1979 Sioux Falls massacre, which became the story line for the second season. The writers did not plant clues for the story of the third season in season two. \"We didn't really tee up the story of season three within the body of season two. That said, it's very exciting to now think once more, what else can you do with Fargo? What other kind of movie can it be? It proved in its first year it could be a similar but different story to the actual film. And in the second year, it proved that it could be a much larger epic that somehow managed to turn 1979 into a crime story. And then in the third year, the question becomes, structurally and stylistically, what's left to say, what do we do that feels similar but is different so we're not repeating ourselves? That said, we're always looking for connections and things that fit into the larger body of work that we're building .\" The last time we saw Charlie Gerhardt in season two, he was in jail--but he didn't stay there long. \"I think he served about four years in prison and got out as the sole surviving Gerhardt and had to make a life for himself. On a lot of levels, he's left behind as the last man standing of the Gerhardt family. I'm sure he took a long hard look at himself and his nature, which was much more gentle and in conflict with his upbringing .\" And about those aliens...\"As we used it in the ninth hour--at the point [where] the violence and chaos of our story and of the period became both so deadly and absurd on a real level--the UFO manifests that kind of absurdity in our story. There are two things that I felt gave me permission to use it: The Coens had used a UFO as a conceit in The Man Who Wasn't There. A lot of the imagery had been there. That movie, of course, took place in a much earlier time period. But also the fact that in 1979, two years after Close Encounters of the Third Kind and Star Wars, it was very much in the Zeitgeist--after the kind of crazy political upheavals of the '70s where everyone realized that the conspiracy really did go all the way to the top, and that sense of paranoia in American life was so heightened. It literally felt like you couldn't trust anything, even the skies .\" ", "articleID": "2015121520_00565823_W", "names": {"John Cameron": ["Q10468938", "Q1699530", "Q18164439", "Q24817361", "Q56718151"]}}, {"date": "2015-12-16", "url": "http://www.morningstaronline.co.uk/a-ad18-Yemen-peace-talks-begin-as-air-strikes-end/", "content": "Yemen peace talks begin as air strikes end posted by in Morning Star World Houthis and government meet in Switzerland by Our Foreign Desk UN-BROKERED peace talks between the internationally recognised government and Shi’ite Houthi rebels began in Switzerland yesterday as the ferocious air raids launched by a Saudi-led coalition finally ended. Although the UN has not stipulated a venue for the negotiations, Swiss public radio identified the village of Macolin, near the town of Biel, as the location. The ceasefire had been supposed to take effect just before midnight on Monday, but the Saudis stepped up military activity in response to a setback in Taiz province. Saudi Colonel Abdullah Mohammed al-Sahyan and United Arab Emirates officer Sultan <mark>Mohammed Ali</mark> al-Ketb were among dozens of pro-government troops killed when Houthi forces fired a long-range missile at a secret military headquarters near the strategic strait of Bab al-Mandab. The official Saudi news agency announced a postponement of the ceasefire on Monday night, saying that their coalition forces would only stop fighting at noon yesterday. Yemen has been torn apart by armed conflict pitting the Houthi rebels and army units loyal to former president Ali Abdullah Saleh against the internationally recognised government, backed by the Saudi-led coalition and supported by the US, along with southern separatists, religious extremists and other militants. UN special envoy for Yemen Ismail Cheikh Ahmed voiced hope yesterday that the talks would \"mark the end of military violence in Yemen .\" According to the UN, the war has so far killed at least 5,878 people since March, when the fighting escalated after the Saudi-led coalition began launching air strikes targeting the rebels. Past efforts to end the violence have failed, as the government insisted on Houthi compliance with a UN resolution requiring them to return seized weapons and territory that they have captured over the past year.", "articleID": "2015121615_00392170_W", "names": {"Mohammed Ali": ["Q16002506", "Q6854083"]}}, {"date": "2015-12-17", "url": "http://www.prnewswire.com/news-releases/accountantsworld-shortlisted-for-2015-16-cloud-awards-program-300194654.html", "content": "& times; AccountantsWorld logo HAUPPAUGE, N.Y., Dec. 17, 2015 / PRNewswire /--AccountantsWorld is a finalist in the 2015-2016 Cloud Awards Program in the category Best HR / Payroll Solution. With awards for excellence and innovation in cloud computing, the Cloud Computing awards program accepts entries from across the globe, including the US,, Australasia and EMEA. Entries are accepted from organizations of any size and include start-ups and government bodies. The program is now in its fifth year. Canada \"It's a special honor for AccountantsWorld to be recognized in the 2015-16 Cloud Awards. To make the shortlist against such competition illustrates the level of service and commitment to our customers we strive for and achieve,\" said Dr., AccountantsWorld CEO and co-founder. \"We are excited to continue to support the accounting profession by providing accountants with innovative tools and resources to better serve their clients and make their practices more rewarding and profitable .\" Chandra Bhansali \"In our fifth year of recognizing the best of the best--not just the monoliths within the space, but all of the cloud organizations which offer real innovation and value to their users--we are still delighted to find new names pushing hard, and established names responding by pushing the envelope still harder,\" said, Cloud Awards organizer. \"The Cloud is all about adding value in a lean, cost-effective way, utilizing the latest technologies and methodologies to benefit the end user. That's what we were continuing to see in 2015 .\" <mark>Larry Johnson</mark> \"What's even more exciting is that we're still seeing more applicants in 2015 from beyond the--,, the UK,, and. It's an exciting time - as one of the oldest and best-established recognition platforms for innovation and excellence in the cloud, this is the place to be. We have a tireless quest to throw light on best-of-breed cloud performers. Watch this space to see who our judges have selected as the winners, but know that every organization on the shortlist is worthy of your time,\" said, Cloud Awards organizer. USAEuropeCanadaAustraliaAsiaLarry <mark>Johnson</mark> Over 300 organizations entered, with entries coming from across the globe, covering the Americas,, and the. AustraliaEuropeMiddle East Final winners will be announced on Thursday, January 28, 2016. The Cloud Awards (http: //www.cloud-awards.com/) will return with a new program in 2016 to continue its recognition of excellence in cloud computing. Notes for editors About the Cloud Awards The Cloud Awards is an international program which has been recognizing and honoring industry leaders, innovators and organizational transformation in cloud computing since 2011. The awards are open to large, small, established and start-up organizations from across the entire globe, with an aim to find and celebrate the pioneers who will shape the future of the Cloud as we move into 2016 and beyond. Categories include the Software as a Service award, Most Promising Start-Up, and \"Best in Mobile\" Cloud Solution. Finalists were selected by a judging panel of international industry experts. For more information about the Cloud Awards please visit http: //www.cloud-awards.com/. About AccountantsWorld At AccountantsWorld, we put accountants first. Our focus is on supporting accountants and revitalizing the accounting profession to make accounting practices more rewarding and profitable. Unlike most solution providers to accountants, we never compete with accountants by selling products or services directly to their clients. To help accountants capitalize on the billions of dollars' worth of opportunities created by the cloud, we've created a complete suite of seven highly innovative cloud solutions for accountants. These solutions have changed the landscape of two core services - payroll and accounting. We put accountants back in the driver's seat to regain control of client accounting and work collaboratively with their clients. Our breakthrough model benefits both accountants and their clients, enabling accountants to better serve their clients while raising their own practices' bottom line. Visit www.AccountantsWorld.com to learn more. For the full shortlist, please visit: http: //www.cloud-awards.com/previous-winners/2015-shortlist/", "articleID": "2015121717_00448689_W", "names": {"Larry Johnson": ["Q18586008", "Q2334039", "Q3445677", "Q3827149", "Q43132113", "Q463635", "Q6490580", "Q6490581", "Q6490583", "Q6490584", "Q6490586"]}}, {"date": "2015-12-17", "url": "https://www.tapinto.net/articles/boys-basketball-vass-ready-to-lead-new-providenc", "content": "Photos By TIM LECRAS December 17, 2015 at 5:27 PM NEW PROVIDENCE, NJ--For the first time in Pioneer senior point guard Kevin Vass's basketball career, he will be the show. No longer does Vass have the comfort of <mark>Dylan Thomas</mark>, Bryan Joyve or Kevin Haggerty on his side. Instead, its him and a wealth of new players tasked with leading the Pioneers into a new form of glory, Central Jersey, Group 2. New Providence head coach Art Cattano said with all the work Vass put in during the summer, he is more than capable of stepping up as a leader on and off the floor. Sign Up for E-News \"He's got to be on the court as much as possible, if not all the time,\" Cattano said, \"just because of the fact that he's a very good point guard and can run the show. He just makes everybody else better when he's in there. I'd say there is a lot on him .\" Vass will be tasked with being every bit of a leader that <mark>Thomas</mark>, Haggerty and the rest of last year's senior class were combined. However, he won't be doing it alone. Joining Vass is senior football standout <mark>Russell Davidson</mark>, who could be the Pioneers' biggest surprise. The all-conference defensive lineman is relatively new to basketball, but because of his work ethic and natural leadership abilities, has stepped up to be a major part of Cattano's plan. \"Here is a kid with not a lot of basketball experience, but football wise, his presence, he's just that type of kid,\" Cattano said. \"He's developed that from being a captain on the football team. He really works hard. I'm very pleased with him. I didn't know what to expect from him. He's into basketball and he really likes it. He's certainly a big help .\" Sophomore Jack Barletta has also propelled himself into the starting lineup. His pure athleticism doesn't go unnoticed, as both Cattano and Vass expressed their desire to see Barletta exceed on the hardwood. \"He's just really athletic,\" Vass said. \"He's fast and can get to the rim. He's going to be a good player .\" The biggest question facing the Pioneers this year is who else will step up until Sean Cole returns later in the season. Jason DiBenedetto and Jon Munroe are both expected to see significant playing time this year, however after that, the rest is a big question mark. \"I'm looking forward to see who steps up on the team,\" Vass said. \"Its going to be a whole new team this year with the exception of me. I want to know who can step up and fill the roles of players from last year .\" The Pioneers tip-off their season on Friday night, and right off the bat will be forced into highly competitive games against rivals Oratory Prep and Jonathan Dayton before making their annual appearance in the Chatham Cougar Classic. With a jump up to Central Jersey, Group 2 for states, Cattano is hoping that New Providence's early season strength of schedule will give his squad enough experience to get ready for a strong push in January, February and March. \"We play some pretty good schools in our season,\" Cattano said. \"Forget about our league, we play Summit, Caldwell, Chatham, Hanover Park. We play Summit, Hanover Park and Chatham just in the holiday tournament. Its brutal, but its good for us. Its very good competition .\" Tip-off for Friday's season opener at Oratory Prep is scheduled for 7 p.m.", "articleID": "2015121723_00115852_W", "names": {"Dylan Thomas": ["Q30903334", "Q57375199"], "Russell Davidson": ["Q30069168", "Q57085608"]}}, {"date": "2015-12-18", "url": "http://www.statesboroherald.com/section/76/article/71781/", "content": "Tough immigration plans not a must Poll shows GOP voters more concerned about terrorists, border security Text Size: Small Large Medium This Aug. 28, 2014 file photo shows demonstrators being arrested in front of the White House during a protest on immigration reform. For all of the ferocity and double-speak over immigration reform at the GOP debate, most Republicans say the issue isn't a decisive factor in their vote for president according to a new AP-Gfk Poll. deeply unpopular within their party. More broadly, more Americans, regardless of their political affiliation, favor than oppose a pathway to citizenship for immigrants who are in the United States illegally, the poll shows. By LAURIE KELLMAN and EMILY SWANSONAssociated Press WASHINGTON--Retired postal clerk <mark>Jerry Wilson</mark> likes what he hears from GOP presidential hopefuls about overturning President Barack Obama's executive order easing deportation policies against people in the U.S. illegally. But he'll choose a Republican presidential nominee based on other issues--keeping American companies from moving overseas, for one. Keeping would-be attackers out of the country, for another. \"America comes first when you're the president of the United States,\" the Batavia, Ohio, resident, 67, said. \"You do everything you can to keep America safe. What about migrants, people who are already here illegally? That's not a do-or-die issue to me .\" For all of the ferocity and double-speak on immigration reform at the GOP debate, most Republicans like <mark>Wilson</mark> say the issue isn't a decisive factor in their vote for president, according to a new AP-GfK poll. Even among conservative Republicans, more than half--56 percent--say they either prefer a candidate who would keep Obama's immigration action in place or that they can imagine voting for a Republican presidential hopeful who would. The survey shows that Obama's immigration actions last year, which allowed some immigrants to apply for temporary legal status, are a particular sticking point for Republicans. Seventy-three percent of them say they prefer to support the candidate who would undo those steps taken by this president, who is deeply unpopular within their party. More broadly, more Americans--regardless of their political affiliation--favor than oppose a pathway to citizenship for immigrants who are in the United States illegally, the poll shows. Even among Republicans--4 in 10 of whom oppose making citizenship an option for people in the country illegally--it doesn't seem to be a make-or-break issue in their choice for president. Four in 10 conservative Republicans and 3 in 10 tea party Republicans favor a path to citizenship for immigrants already in the country illegally. Notably, the results from the Dec. 3 through Dec. 7 survey are unchanged since the questions were last asked in April--even after months of strong rhetoric by Republican presidential candidates, including front-runner <mark>Donald Trump</mark>, who proposes deporting the 11.5 million people in the country illegally. The survey results are powerful data points for the GOP candidates with little more than six weeks to go before the first votes are cast in Iowa. Republican Sens. Marco Rubio and Ted Cruz, both children of Cuban immigrants, are locked in an extraordinary battle for second place in the nomination fight, in large part over their positions on immigration. Rubio's rivals had used his 2013 comprehensive immigration reform bill to cast him as a supporter of a path to citizenship for those here illegally. He hasn't backed off that idea but has abandoned the notion of comprehensive reform on the complex issue and emphasizes border security first. Cruz, meanwhile, is casting himself as an opponent to \"legalization .\" He proposed amendments to Rubio's bill that would have massively increased legal immigration--but mostly, he says, to try to kill Rubio's legislation. While illegal immigration may not be a deal-breaker for Republicans on a national scale, few issues are more hotly contested on the ground in early voting states like Iowa and New Hampshire. Some GOP conservatives often lash out at allowing people to stay in the U.S. illegally, producing an environment where Republican candidates like Rubio and Bush have been forced to distance themselves from their own more forgiving policies in the past. But the poll shows immigration may not be the most pressing issue on Americans' minds once voting begins in the GOP primary contest. \"No candidate fits everybody's view,\" said Terry Arnell of Tower Lakes, Ill., a retired insurance company manager who right now likes <mark>Trump</mark>. So, what will be Arnell's priorities come election day? \"Gun rights. Securing our borders and certainly, securing as much as we can within our borders,\" Arnell, 63, said. \"I think it's very important that we secure our borders now. Then, we can worry about the other illegals here .\" The AP-GfK Poll of 1,007 adults was conducted online Dec. 3-7, using a sample drawn from GfK's probability-based KnowledgePanel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 3.4 percentage points.", "articleID": "2015121802_00224030_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]