[{"articleID": "2011090723_00043465_W", "names": {"Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "David Murphy": ["Q16733028", "Q43074325", "Q467041", "Q5237824", "Q5237825", "Q5237826", "Q5237828", "Q5237829", "Q5237830", "Q55879902", "Q861705"]}, "date": "2011-09-07", "url": "http://philly.com/sports?altcast_code=8fca60bcd5", "content": "michael vick, <mark>andy reid</mark> and the eagles are super bowl contenders, but not favorites. (<mark>david</mark> maialetti/staff photographer) john smallwood: while expectations are in the stratosphere, the eagles aren't the on-paper favorite to win the super bowl, and they should not be. the saints and packers are the favorites right now. the daily news' sam donnellon, paul hagen, and <mark>david murphy</mark> discuss which ace should start game 1 in the postseason in the latest episode of \"that's baseball.\" danny watkins won't start after all in st. louis on sunday. (yong kim/staff photographer) rookie right guard danny watkins won't be starting after all in week 1. instead, kyle devan, the former colts guard the birds picked up on waivers this week, will take his place. andy talley and the villanova wildcats could end up leaving the big east for a super-conference. (ron cortes/staff file photo) sam donnellon: ryan howard strikes out a ton, struggles against lefties, has a contract worth over $145 million, and his home run pace is declining. here's a 6-4, 242-pound dose of reality. phil sheridan: once the phillies have clinched all they can clinch, then maybe charlie manuel will spread some days off around. until then? \"we're going to keep right on playing,\" manuel said."}, {"articleID": "2015012907_00026041_W", "names": {"Larry Jones": ["Q16227670", "Q16730409", "Q6490591", "Q6490592", "Q742049"]}, "date": "2015-01-28", "url": "http://www.multihousingnews.com/cities/indianapolis/teagan-development-to-redevelop-historic-industrial-complex-in-indianapolis-2/1004114107.html", "content": "Jan. 28, 2015 Teagan Development to Redevelop Historic Industrial Complex in Indianapolis A vacant portion of a massive industrial property at 1125 Brookside Avenue in downtown Indianapolis could soon be converted into a mixed-use structure with retail, restaurant and small manufacturing space. Indianapolis Business Journal, Teagan Development, Inc. is planning to buy the 539,000-square-foot Circle City Industrial Complex from the National Bank of Indianapolis, which took control of the property about four years ago from previous owner E & E Realty LLC. The complex dates back to the early 1920s, when it served as a factory for the Schwitzer Corp.. Located in the Windsor Park neighborhood, in an area which serves as the entrance to the Cottage Home neighborhood, the building now hosts a mix of about 50 tenants, including not-for-profit RecycleForce. At its southern end, the property also includes a vacant portion of about 120,000 square feet that holds the highest redevelopment potential. Plans call for approximately 40,000 square feet of retail and restaurant space, 30,000 square feet of incubator space to be used for small manufacturing, while the remaining 50,000 square feet would be demolished to make way for the construction of a parking facility and an access drive to link Brookside and Massachusetts avenues. \"This building and this location have the bones for what I call the next overnight sensation,\" <mark>Larry Jones</mark>, the company president, told the newspaper. \"It's an area where the residents of Cottage Home have put 25-plus years into turning that neighborhood around.\" The area is currently going through a revitalization phase, thanks to a number of residential developments, including Stenz Corp.'s Hillwood Investment Moving Ahead with $165M Legacy Park; Tennessee Receives $28M in CDBG"}, {"articleID": "2019021314_00063165_W", "names": {"Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}, "date": "2019-02-13", "url": "https://www.oann.com/u-s-seeks-to-increase-pressure-on-iran-at-warsaw-meeting/", "content": "U.S. Secretary of State Mike Pompeo speaks at a news conference at Lazienki Palace in Warsaw, Poland February 12, 2019. REUTERS/Kacper Pempel February 13, 2019 By Lesley Wroughton and Joanna Plucinska WARSAW (Reuters)--Foreign ministers and senior officials from 60 nations gather in the Polish capital Warsaw on Wednesday where the United States hopes to ratchet up pressure against Iran despite concerns among major European countries about heightened tensions with Tehran. The absence of foreign ministers from major European powers, Germany and France, highlights festering tensions with the European Union over U.S. President Donald Trump's decision last year to withdraw from a 2015 nuclear deal with Iran and reimpose sanctions. EU policy chief, Federica Mogherini, who was a key player in the Iran nuclear deal, will also not attend the two-day conference due to scheduling issues, an EU official said, although U.S. Secretary of State Mike Pompeo will travel to Brussels on Friday to meet with her. Pompeo, who will be joined by U.S. Vice President Mike Pence in Warsaw, played down the absence of leading European ministers at the event during a brief stop in the Slovak capital Bratislava on Tuesday, before he headed to Warsaw. \"Some countries are having their foreign ministers come. Other countries are not. That's their choice,\" he told a news conference. \"We think we will make real progress. We think there'll be dozens of nations there seriously working towards a better, more stable Middle East, and I'm hoping by the time we leave on Thursday we'll have achieved that,\" he added. While countries such as France, Germany and Britain have opened a new channel for non-dollar trade with Iran to avert U.S. sanctions and keep the nuclear deal afloat, they have criticized Tehran's ballistic missile program. \"There will be discussions about Iran's influence in the Middle East, what we can do to help get Iran on a more helpful footing that it has been, to collectively push back on some of its malign behavior in the region,\" a senior U.S. official said of the Warsaw agenda. New U.S. sanctions, mainly targeted at cutting off revenue from Iran's oil sector, have largely succeeded in persuading European companies to abandon business with Iran. Iran has threatened to pull out of the deal unless the European powers enable it to receive economic benefits. The Europeans have promised to help companies do business with Iran as long as it abides by the deal. In other policy differences, Washington's European allies have also voiced concern over Trump's decision to withdraw U.S. troops from Syria. ATTENDANCE QUESTIONS The conference will also hear from White House adviser Jared Kushner, who is Trump's son in law, over plans by the United States for peace between Palestinians and Israelis. While Kushner is not likely to divulge too many details of the plan, it will be one of the first occasions he will publicly discuss the U.S. efforts. Palestinian officials have said they will not attend the Warsaw conference because of Washington's decision to move the U.S. embassy to Jerusalem. Israeli Prime Minister Benjamin Netanyahu will, however, attend, alongside several officials from Gulf states. It was unclear which ministers would be attending since organizers refused to release the list of participants ahead of Wednesday's meeting. Hosting the event is a chance for Poland's conservative government to bolster its ties with Washington at a time when it faces mounting isolation within the EU amid a dispute over its adherence to rule of law standards. \"It's a clear effort to underline their desire to please Washington,\" said Piotr Buras, a director of the Warsaw office of the ECFR think tank. \"The goals of the conference are also defined by the U.S., not by Poland. Poland is just the implementer.\" But Polish Foreign Minister Jacek Czaputowicz said transatlantic cooperation was necessary to resolve problems in the Middle East. \"The European Union alone does not, in my opinion, carry sufficient political weight to try to really influence the situation in the Middle East,\" he told reporters in Warsaw. \"Only working together with the United States, and broadly speaking the community of democratic countries, can we have a positive influence and achieve peace and the stabilization of the situation in the Middle East,\" he added. Michal Baranowski, who heads the Warsaw office of the German Marshall Fund, said the outcome of the conference could either showcase divisions or more agreement over Iran. \"The proof is very much in the pudding whether this conference is something that will show great consensus or whether it will show greater division,\" he said. (Additional reporting by Alan Charlish in Warsaw; editing by Justyna Pawlak and <mark>Tom Brown</mark>)"}, {"articleID": "2017042721_00133342_W", "names": {"John Christensen": ["Q5608314", "Q6226001", "Q6226002"], "Jeffrey Gold": ["Q3176695", "Q42708202"]}, "date": "2017-04-27", "url": "http://www.omaha.com/news/education/after-uno-chancellor-search-is-put-on-hold-unmc-s/article_b2e8e5e2-2b5a-11e7-9c9b-1399ac129841.html", "content": "<mark>John Christensen</mark>, UNO chancellor After UNO chancellor search is put on hold, UNMC's Gold expected to lead both campuses through next 2-year budget cycle Buy Now MATT DIXON/THE WORLD-HERALD University of Nebraska President Hank Bounds, left, and University of Nebraska Medical Center Chancellor Chancellor <mark>Jeffrey Gold</mark> at the press conference discussing the UNO chancellor search. Buy Now MATT DIXON/THE WORLD-HERALD University of Nebraska President Hank Bounds speaks at a press conference about the search for a new UNO chancellor. REBECCA S. GRATZ/THE WORLD-HERALD Dr. <mark>Jeffrey Gold</mark>, UNMC chancellor University of Nebraska Medical Center Chancellor <mark>Jeffrey Gold</mark> may add the title of interim chancellor of the University of Nebraska at Omaha for two years or more. NU President Hank Bounds announced Thursday that the search for a replacement for UNO Chancellor <mark>John Christensen</mark> was on hold because the right person hadn't been found. Bounds said he expected Gold to lead both UNMC and UNO through the next two-year budget cycle. Bounds said in comments at UNO that the plan could change if the situation isn't working out for UNMC, UNO or Gold himself. Bounds and Gold said the decision would help increase collaboration and find efficiencies between the two universities, both situated in Omaha. The duration of Gold's interim position and the many mentions of collaboration raised questions about the degree to which UNO and UNMC might merge for the long term. Dale Eesley, a UNO faculty member, posed that question to Bounds and Gold when they met with faculty and staff early Thursday afternoon at UNO's Strauss Performing Arts Center. After the session, Eesley received compliments from at least three UNO faculty members for having asked the question. Bounds declined to say that merger wasn't a possibility in a brief interview after meeting with faculty members. \"I can't give you an iron-clad guarantee on anything,\" Bounds said. \"You're asking me to totally preidict the future. I can't do that.\" But he also characterized a reporter's questions about merger as an effort to \"make news.\" <mark>Christensen</mark>, who announced last year that he would step down in mid-2017, said in an interview: \"Hank said from the very beginning this was an interim postiion. That's really where this thing is at at this moment. Now who knows what happens as this thing goes forward?\" Gold said he was excited about the opportunity to bring the two institutions closer together. \"I'm truly humbled and excited about this opportunity,\" Gold said at a press conference at UNO. He said he talked this possibility over with his wife. \"Her comment was,\" Go for it,' \"Gold said. The search for UNO chancellor was put on hold because the right person hasn't been found, the NU system announced Thursday. Gold will take on the interim chancellor role at UNO, beginning May 8. The interim appointment is expected to be confirmed by the NU Board of Regents on June 1. UNO Chancellor <mark>John Christensen</mark>, 68, said late last year that he would step down in mid-2017 after about 10 years of leading the campus. Bounds said in a statement that the search was a struggle because there were so many president and chancellor openings nationwide. He also said the state's financial difficulties compelled some candidates to hesitate to pursue the UNO position. Theresa Barron-McKeagney, a UNO associate dean and co-chairwoman of the search committee, said her committee worked hard.\" Our goal was to find the right person who could pick up where Chancellor <mark>Christensen</mark> will leave off and continue UNO's momentum, \"Barron-McKeagney said.\" While the position attracted interest from across the country, ultimately none of the candidates was the right mutual fit. We're excited to have Dr. Jeff Gold lead our campus forward. \"Bounds oversees the campuses in Omaha, Lincoln and Kearney. Gold became UNMC's chancellor three years ago. Before coming to UNMC, Gold, a heart surgeon, was chancellor and executive vice president of biosciences and health affairs at the University of Toledo. Bounds gave no date for resuming the UNO chancellor search but indicated that would happen eventually. Gold was not part of the candidate pool for the chancellorship, the statement said. But Bounds said Gold's interim appointment is logical because the university's financial state will require more shared operations between the Omaha campuses. Gold's appointment also will deepen collaboration between the two institutions, the statement said.\" Jeff is the right person, at the right time, to lead UNO into the future, \"Bounds said. Gold is paid $814,234 a year as UNMC's chancellor and won't be paid more for his new duties, an NU spokeswoman said. Gold, 64, praised <mark>Christensen</mark>'s leadership and said through a statement that he has been\" impressed and inspired by the work being done \"at UNO.\" Our campuses have a long record of collaboration, and I am humbled and honored to get to know UNO and its people even better in the months head, \"Gold said.\" This is an opportunity to work together to change the world--and we will. \""}, {"articleID": "2012030401_00039153_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"]}, "date": "2012-03-04", "url": "http://lep.co.uk/news/national/cut-price-staycations-for-2012-1-4311071", "content": "saturday 3 march 2012 01:17 holidaymakers will be offered discounts on uk breaks in a major tourism drive aimed at cashing in on the olympic year. culture secretary <mark>jeremy hunt</mark> is unveiling a \"staycation\" campaign on wednesday that will see companies slash \"20.12%\" off bills. tourists will be able to take advantage of the discount by using a dedicated website before the end of the paralympics on september 9 to make bookings for this year and 2013. government officials said more than three million hotel rooms were already lined up under the project, which is being backed by a range of companies including butlins. attractions, such as the london eye and alton towers, are also taking part. mr <mark>hunt</mark> said: \"with the diamond jubilee and the 2012 olympic games, this year is the perfect opportunity for more of us to holiday in the uk.\" with so much going on, and this fantastic new 20.12% discount scheme, it's a great opportunity to see what britain has to offer. \"temperature: 4 c to 7 c wind speed: 23 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 1 c to 8 c wind speed: 20 mph temperature: 7 c to 9 c wind speed: 18 mph temperature: 5 c to 10 c wind speed: 32 mph temperature: 8 c to 10 c wind speed: 26 mph"}, {"articleID": "2017120804_00072196_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Roy Moore": ["Q17466511", "Q27924997", "Q5302905"]}, "date": "2017-12-08", "url": "http://www.krmg.com/news/national/foo-fighters-fans-were-treated-impromptu-nirvana-reunion/qtPkynL69lAbrEeuTdIZaP/", "content": "Foo Fighters fans were treated to an impromptu Nirvana reunion Photo Credit: Ian Gavan/Getty Images Dave Grohl of Foo Fighters (Photo by Ian Gavan/Getty Images) Foo Fighters fans were treated to an impromptu Nirvana reunion By: Rare. us December 07 2017 10:00 PM EUGENE, Ore. - Nirvana fans can rejoice! The surviving members of the band Dave Grohl, Krist Novoselic and touring member Pat Smear briefly reunited for a rendition of the Foo Fighters song \"Big Me\" at a concert in Eugene, Ore.>> Read more trending news \"I love you Krist,\" Grohl says as Novoselic leaves the stage. \"No! That's a new one,\" he yells as the bass player pretends to smash his instrument to smithereens, just like the old days. \"You just got it!\" Don McClean would have you believe that Feb. 3, 1959, was \"the day the music died\" but for gen-Xers, that day is April 5, 1994 the day Kurt Cobain took his own life and left legions of adoring fans in tears or worse. In the wake of Cobain's suicide, Dave Grohl, the drummer who played with Cobain in Nirvana, went on to have a long and successful career after he formed your dad's favorite band, Foo Fighters, with guitarist Pat Smear who was never a full-fledged member of Nirvana, but he played rhythm guitar at a lot of their live shows. But what happened to the other guy? Nirvana's bassist Krist Novoselic dabbled in a few post-Nirvana musical projects, but none of them really took off like Grohl's did. Grohl actually asked Novoselic to join Foo Fighters as a full time band member, but he declined. Believe it or not, this isn't the first time the three musicians have jammed together since Nirvana ceased to exist. During the filming of Grohl's 2013 documentary \"Sound City,\" the trio teamed up with rock god Paul McCartney and recorded a new track titled \"Cut Me Some Slack,\" which they played live a few times in 2013. they also reunited for Nirvana's induction into the Rock And Roll Hall Of Fame the following year, where they rocked out with Lorde, St. Vincent and Joan Jett because they love rock and roll! Recently, Grohl was the guest host for the Oct. 31 edition of \"<mark>Jimmy Kimmel</mark> Live.\" And he completely nailed the Halloween theme by showing up in a terrifyingly accurate David Letterman costume. \"I'm Dave Grohl dressed as Dave Letterman sitting in for <mark>Jimmy Kimmel</mark>. It's confusing, I get it, especially if you're home watching right now stoned to the bone,\" the guest host said. He went on to perform a rocking version of \"Do You Want To Build a Snowman\" from the movie \"Frozen\" with one of its stars, Kristen Bell who was dressed up as Tom Selleck's ’80s TV icon Magnum P.I. \"If I were to jam a song with you, I would become like the coolest dad,\" Grohl admitted, after informing Bell that his kids were huge \"Frozen\" fans. Read More VIEW COMMENTS Another date set for a special session Governor Mary Fallin called lawmakers to return to the State Capitol for a special session to address the shortfall in the current fiscal year budget. This will be the second special session this year. Gov. Fallin scheduled the next session on Monday, Dec. 18. \"I wanted to give legislators enough notice as possible about when they should return to the Capitol,\" said Fallin. Fallin didn't file an executive order, or an official call, for the special session. She says she'll do that at a later date. \"Before the session begins, I intend to make specific recommendations on how we can balance the budget and meet our immediate needs.\" The current 2018 fiscal year budget includes $509 million of one-time funds and future obligations of at least $180 million not included in the 2018 fiscal year budget. Sexual misconduct claims force two in Congress to resign, another into ethics probe In a head shaking series of events, a tide of sexual misconduct allegations continued to sweep across Capitol Hill on Thursday, as one Senate Democrat and one House Republican announced their resignations, while another House GOP lawmaker became the subject of an ethics review over a sexual harassment case that has already resulted in a taxpayer funded settlment. Sen. Al Franken (D-MN) began the highly unusual day on Capitol Hill, taking the Senate floor just before lunch to announce his resignation \"in coming weeks,' but denying any wrongdoing. Hours later, the House floor suddenly was in the spotlight, as Rep. Trent Franks (R-AZ) surprised colleagues by announcing he would resign effective at the end of January. A group of fellow Republicans just prayed on the House floor with Rep. Trent Franks (R-AZ), who @ PoliticsReid reports is resigning. Everyone stone-faced .--Cristina Marcos (@ cimarcos) December 7, 2017 About the same time, the House Ethics Committee announced it had formed an investigative panel to review allegations of sexual harassment against Rep. Blake Farenthold (R-TX), who has already acknowledged having the taxpayers pay $84,000 to a former employee to settle a sexual harassment case. All those developments came amid talk in the halls of the Capitol of possibly more stories emerging about lawmakers, mirroring the public rush of sexual misconduct allegations nationally.\" Every one of these claims, whether it's in business, industry, or in Congress, has to be taken very seriously, \"said House Speaker <mark>Paul Ryan</mark>, hours before <mark>Ryan</mark> said he had asked Rep. Franks to resign. The Speaker's office put out this background on the Franks case:\" Last Wednesday, the speaker was briefed on credible claims of misconduct by Rep. Trent Franks. He found the allegations to be serious and requiring action, \"read a statement put out by the Speaker's office. The Speaker's statement was much different than the explanation put out by Franks, who said he had discussed the issue of having a child by a surrogate with two former female staffers.\" Rather than allow a sensationalized trial by media damage those things I love most, this morning I notified House leadership that I will be leaving Congress as of January 31st, 2018, \"Franks said in a statement. Meanwhile, pressure increased on Rep. Blake Farenthold (R-TX), who admitted this week that he had used taxpayer dollars to pay an $84,000 sexual harassment settlement with a former employee on Capitol Hill. On CNN Thursday evening, Rep. Mia Love (R-UT) said she thought Farenthold needed to move on.\" I think that he should voluntarily resign, \"Love said, becoming the second GOP lawmaker to call for Farenthold to quit, along with Rep. Barbara Comstock (R-VA). Farenthold is now facing a full investigation by the House Ethics Committee, which was announced at about the time that Rep. Franks announced his resignation. Meanwhile, Rep. Ruben Kihuen (D-NV), was resisting calls for his resignation, over claims of sexual misconduct during his 2016 run for Congress.\" We have a responsibility to uphold the dignity of the House of Representatives, \"said House Democratic Leader Nancy Pelosi, who has publicly urged Kihuen to leave the Congress. State revenue collections rise in November State Treasurer Ken Miller announced that the November Gross Receipts to the Treasury are more than 12 percent higher than the same month of last year. Oklahoma has had eight consecutive months with year-over-year growth. The last time monthly gross receipts grew by more than 12 percent was in February 2012.\" Gross Receipts to the Treasury, insomuch as they indicate general economic activity, paint an encouraging picture as we enter the holiday period, \"Miller said.\" Sales tax collections, a measure of consumer confidence, are up by double-digits and the bulk of holiday shopping including Black Friday is not yet measured with this report. \"The three other major revenue streams--gross income, gross production, and motor vehicle taxes--also increased during the month compared to November of last year. Sen. Al Franken D-MN says he will resign over sexual misconduct allegations Accused by multiple women of unwanted sexual advances, Sen. Al Franken (D-MN) announced on the floor of the U.S. Senate Thursday that he would resign his seat\" in the coming weeks,' even as he denied the veracity of the charges leveled against him in the last three weeks. \"Some of the allegations against me are simply not true,\" Franken said. \"Others I remember very differently.\" Even as he announced he would leave the Senate, Franken took a shot at both President Donald Trump, and Alabama GOP Senate candidate <mark>Roy Moore</mark>, as Franken said it is ironic that he is leaving, while the other two men are dealing with accusations of sexual misconduct. Sen. Al Franken: \"There is some irony in the fact that I am leaving while a man who has bragged on tape about his history of sexual assault sits in the Oval Office .' https: //t.co/Dg1QIytmqP pic.twitter.com/ZlT2Fs50Fw--ABC News Politics (@ ABCPolitics) December 7, 2017 BREAKING: Minnesota Sen. Al Franken, once a rising star in Democratic Party, is resigning amid sexual misconduct allegations .--AP Politics (@ AP_Politics) December 7, 2017 Franken's decision came after a wave of calls on Wednesday from fellow Democratic Senators for his resignation, as the number of women accusing the Minnesota Democrat of unwanted sexual advances continued to rise this week. I expect that Senator Franken will announce his resignation tomorrow. It is the right thing to do given this series of serious allegations .--Ron Wyden (@ RonWyden) December 6, 2017\" I agree the time has come for Senator Franken to step aside, \"said Sen. Sherrod Brown (D-OH). The resignation of Franken will now allow the Governor of Minnesota--former U.S. Senator, and Democrat, Mark Dayton--to fill the vacancy. Franken's term runs out after the 2020 election, so there would be a short-term appointment made by the Governor, and then an election to fill the rest of his term. FRANKEN--WHAT HAPPENS NOW:--MN's Gov. appoints a temp senator. (Gov. Dayton = Dem .)--The state holds a special election Nov. 2018 .--That means both MN Senate spots will be on the ballot next year. (Klobuchar up for reelex .)--Lisa Desjardins (@ LisaDNews) December 7, 2017"}, {"articleID": "2017071722_00536833_W", "names": {"Tony Tse": ["Q5541244", "Q58077300"]}, "date": "2017-07-17", "url": "http://magicvalley.com/business/sushi-lovers-rejoice-sushi-tokyo-reopens-months-after-fire/article_215c6b88-33b9-57c8-9a63-1799a35ee408.html", "content": "TWIN FALLS--Sushi Tokyo opened its doors Monday after fire damage closed the business for more than nine months. Owner <mark>Tony Tse</mark> said the newly remodeled restaurant is open 11:30 a.m. to 9 p.m. Monday through Thursday and 11:30 a.m. to 9:30 p.m. Friday and Saturday. \"We're opening all day now,\" he said. Sushi Tokyo had previously closed for several hours after the lunch rush. Customers can expect to see many of the same faces serving them--as well as the same menu, <mark>Tse</mark> said. Sushi Tokyo, 1111 Blue Lakes Blvd.. N., Suite B, closed in October after crumbs from the deep fryer spontaneously combusted in a garbage can in the pantry. The restaurant was heavily damage, requiring extensive remodeling that took longer than originally projected. \"It feels good, but it feels stressful,\" <mark>Tse</mark> said about reopening. Also open: Epic Corals Another business that opened this month caters to a different kind of fish love. Saltwater aquarium owners have a new local option for fish, plants and supplies. Epic Corals opened in early July at 639 Washington St. N., Suite B. The business offers saltwater fish, aquariums and supplies and live corals. \"We lease fish tanks. We sell fish tanks. We maintain them, service them,\" co-owner Marty Summers said. Customers can place special orders. Summers co-owns the business with Ethan Pinch. Epic Corals is open 1 p.m. to 8 p.m. Monday through Saturday. Information: Call 733-3775."}, {"articleID": "2016070402_00607283_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2016-07-04", "url": "http://economictimes.indiatimes.com/industry/telecom/government-woos-apple-to-set-up-stores-in-india-by-changing-sourcing-norms/articleshow/53038769.cms", "content": "Government woos Apple to set up stores in India by changing sourcing norms By Ruchika Chitravanshi, ET Bureau | Jul 04, 2016, 07.49 AM IST Post a Comment READ MORE ON & raquo; <mark>Tim Cook</mark> | Sourcing norms | Narendra Modi | iPhone | Devices | Apple Apple has been informed about the changes in sourcing conditions. \"It now needs to tell us if it wants to enter India under the new norms,\" said a government official. NEW DELHI: India has reached out to Apple on renewing its application to set up wholly-owned stores in the country after having been rebuffed the first time round over local-sourcing exemptions that the company had sought, officials said. With the rules for single-brand retail having since been tweaked, the company has a better chance of getting those exclusions, albeit for a three-year period. Apple has been informed about the changes in sourcing conditions relating to \"cutting edge technology' in single-brand retail, the officials told ET.\" The policy is in the public domain for anyone to access. However, a call was made to the company...Apple now needs to tell us if it wants to enter India under the new norms, \"said a senior government official who did not wish to be named. Apple couldn't immediately bereached for comment. The iPhone maker's application to set up its iconic stores was approved last month but the government did not relax the domestic sourcing condition. Under the changes made last month, single-brand retailers selling\" state of the art' or \"cutting edge technology' products will not have to meet this condition for up to three years from the commencement of operations. Following that, the rules will apply to them. This stipulates that for the first five years, average domestic sourcing has to be at 30% and subsequently the rule will have to be met annually. The government feels this is incentive enough for Apple to start retailing in India, which is seen as crucial for the company as markets elsewhe-re get saturated. India was among the few bright spots for the US-based company after global quarterly sales slumped for the first time in 13 years in quarter ended March. Apple won't need to submit a fresh application if it wants to avail of the exemption from sourcing for the three-year period, two senior officials said. It will, however, need to convey its request formally to the government. Apple currently sells its products in India through a network of franchisee-owned stores. Domestic sales crossed the $1billion mark in FY15. CEO <mark>Tim Cook</mark> is said to have discussed manufacturing and retailing of Apple products in India with PM Narendra Modi on a recent visit. <mark>Cook</mark> told Apple's India team during the trip that setting up company-owned stores is vital for Apple's longterm plans since these would set benchmarks in sales and services. In the FDI norms announced in November 2015, the Department of Industrial Policy and Promotion (DIPP) had announced a waiver of the sourcing condition for singlebrand retailers that introduce cutting edge technology. A three-member panel including the DIPP secretary, a member of the Niti Aayog and a representative of the administrative ministry had backed Apple's case for exemption. However, it was felt that such exemptions cannot be made for companies unless the term\" cutting edge' was clearly defined or there were conditions attached to the term and the finance ministry had denied the exemption. Under the rules, any foreign investment beyond 51% in single-brand retail requires 30% of the value of goods to be sourced from India, preferably from micro, small and medium enterprises, village and cottage industries, artisans and craftsmen. The government had allowed 100% foreign direct investment in single brand retail in January 2012. Stay on top of business news with The Economic Times App. Download it Now!"}, {"articleID": "2019111601_00005815_W", "names": {"Andrew Harris": ["Q16209408", "Q4757239", "Q4757241", "Q4757242", "Q4757244", "Q4760774", "Q58055458"], "Mike O'Shea": ["Q16212555", "Q20022451", "Q6848254"], "Matt Smith": ["Q1882744", "Q20713866", "Q24809160", "Q27074050", "Q30123100", "Q312385", "Q3299556", "Q3852033", "Q40281443", "Q43091034", "Q54152850", "Q6789356", "Q6789357", "Q6789358", "Q6789359", "Q6789360", "Q6789363", "Q6789364", "Q6789365", "Q6789366", "Q6789367", "Q6789368", "Q6791245"]}, "date": "2019-11-16", "url": "https://www.winnipegfreepress.com/sports/football/bombers/its-blue-vs-bombers-565007712.html", "content": "Winnipeg Free Press Previous Article Next Article It's Blue vs. Bombers Resilient bunch proved last week reports of their demise were dead-wrong; stay out of their own way in Regina and \"Riders are roadkill en route to CFL salvation Email Opinion REGINA--First, they made it look easy. Too easy, in fact. Then came some adversity. Plenty of it. Suddenly it didn't look so easy anymore. But not only did the Winnipeg Blue Bombers weather the mid-season storm and live to tell the tale, they're now on the verge of writing a pretty epic last chapter, one they hope has a fairy-tale ending next weekend. There's only one remaining obstacle standing in their way, and that's the Winnipeg Blue Bombers. No, not the Saskatchewan Roughriders, their opponent Sunday in the West Division Final at Regina's Mosaic Stadium. And not the Edmonton Eskimos or Hamilton Tiger-Cats, who will battle it out earlier in the day in the East Division Final. REGINA--First, they made it look easy. Too easy, in fact. Then came some adversity. Plenty of it. Suddenly it didn't look so easy anymore. But not only did the Winnipeg Blue Bombers weather the mid-season storm and live to tell the tale, they're now on the verge of writing a pretty epic last chapter, one they hope has a fairy-tale ending next weekend. There's only one remaining obstacle standing in their way, and that's the Winnipeg Blue Bombers. No, not the Saskatchewan Roughriders, their opponent Sunday in the West Division Final at Regina's Mosaic Stadium. And not the Edmonton Eskimos or Hamilton Tiger-Cats, who will battle it out earlier in the day in the East Division Final. Last week's dominating takedown of the Calgary Stampeders--in enemy territory, no less--showed they have the talent, the depth and, yes, the coaching, to go all the way. They slayed the proverbial dragon and exorcised some recent demons, all in one fell swoop. Not to mention that there appears to be a certain\" je ne sais quoi \"about this year's team, an intangible that's hard to put a finger on, or even describe, but is most certainly there. Zach Collaros is now 2-0 in blue and gold as the team's starting quarterback. (Jeff McIntosh / The Canadian Press files) We saw it when the Bombers roared out to a 5-0 start, looking like they were going to lap the CFL field. I wrote at the time that they don't hand out Grey Cups in mid-July, and that's certainly true. And when things suddenly went south--starting quarterback Matt Nichols suffering a season-ending injury, running back <mark>Andrew Harris</mark> sentenced to sit out two games after being caught with a banned performance-enhancing drug in his system--it began to look like a 28-year championship drought would, most certainly, become a 29-year-old championship drought. But a funny thing happened on the way to what seemed to be an inevitable collapse. There wasn't one. Sure, they came back down to Earth, no longer running away with the division and ultimately settling for a third-place finish in the ultra-tough West, meaning they'd have to win not once, but twice, on the road to get to the Promised Land. That might have actually been the best thing that could have happened to this group, which I still maintain is the most skilled that's been assembled around these parts in years. Along the way, they learned that things were no longer going to come easy, that they'd have to work their tails off. And they did. They sure did.\" It's always important that you have to face adversity throughout the season. You don't want your first adverse situation to come in playoffs and not know how you might respond, \"linebacker Adam Bighill told me Friday.\" You want to be able to have to learn from things the hard way during the season. You have to be able to understand how to close games out, how did we let that slip away? We can't let that happen again, how do we finish this drive? How do we deal without this player on our roster? \"The Bombers became battle-tested, their resolve strengthened. And they seem, collectively, to be carrying a massive chip on their shoulders, a product of being written off and counted out in some quarters. A product of their most explosive offensive weapon in <mark>Harris</mark> denying any wrongdoing and then getting snubbed in post-season awards voting, which only seems to have poured more gasoline on the fire that was already burning. Quarterbacks Zach Collaros and Chris Streveler proved to be a great one-two punch in Calgary last weekend. (Jeff McIntosh / The Canadian Press files) There's a determination bordering on sheer desperation to get the job done, with a veteran-heavy group that is mostly intact from last year, when a promising season ended with a thud by losing the West Final to the Stampeders.\" The feeling that, man, if we're back next year we're going to do this thing, \"Bighill said wistfully. You saw all of that on full display when they went into Calgary last weekend as considerable underdogs, with major question marks about who was even going to play quarterback, and came away from a place that has always been a proverbial house of horrors with a 35-14 victory over Bo Levi Mitchell and the Stampeders. It was one of the most impressive overall performances in recent Bombers history--from the two-headed monster behind centre in Zach Collaros and Chris Streveler, the defensive scheme from the much-maligned Richie Hall, the offensive game plan from Paul LaPolice and all the right buttons being pushed by head coach <mark>Mike O'Shea</mark>, who saw his players rise to the occasion. And you know what? They do hand out Grey Cups in late November, and I fully expect to see the Blue & Gold raising the trophy next Sunday night at McMahon Stadium, where they vanquished the Stamps. Unless they get in their own way. Sure, it could happen. One of the great things about professional sports is how unpredictable they can be.\" Any given Sunday, \"as the saying goes. But if you aren't at least reasonably confident in Winnipeg's chances at this point, then you haven't been paying attention. Saskatchewan Roughriders quarterback Cody Fajardo hasn't played since Oct. 30 when he injured an oblique muscle in practice but will be the starter on Sunday. (<mark>Matt Smith</mark> / The Canadian Press files) Considering the stage--not to mention the consequences of what a loss might have meant to the franchise--last week might have been the biggest victory since the 50-11 triumph over Edmonton way back on Nov. 25, 1990, at the 78th Grey Cup. Now comes a legitimate shot at the 107th edition, provided they can pull off two more wins. First up is a Saskatchewan team that will be relying on banged-up quarterback Cody Fajardo, a stifling defence and what they hope will be a raucous home-field advantage. The Bombers were pumping in the crowd noise at ear-splitting levels during their closed practice Friday morning at IG Field.\" We don't think too far ahead. At the end of the day we're always going to say the Grey Cup's our goal, but we're not going to go the Grey Cup if we don't take care of business this week, \"receiver Nic Demski said. Want more great journalism? I agree to the Terms and Conditions, Cookie and Privacy Policies, and CASL agreement.\" Last year we came up short to our ultimate goal. To bring in the crop that we did this year and add a couple pieces, it just makes it that much more clearer that we do have the talent to take this team to the next level. \"As for all those hurdles they've encountered this year? Just part of the journey, one that shows no sign of ending this weekend.\" It definitely builds toughness. It shows who wants to be here through the thick and thin. If everything's pretty, obviously everybody's going to want to come along for the ride. When things get hard that's when you see people's true colours. Everybody stuck together. We knew what we wanted to do in this room. Everybody stuck together and we're making it work. We just gotta go out there and keep fighting, \"said Demski. A real page-turner, these Bombers. mike.mcintyre @ freepress.mb.ca"}, {"articleID": "2016081416_00393376_W", "names": {"Rick Ross": ["Q297831", "Q431969", "Q606032"], "Dj Premier": ["Q30122010", "Q380639"]}, "date": "2016-08-14", "url": "http://www.xxlmag.com/rap-music/new-music/2016/08/the-lox-rick-ross-feel-my-pain/?trackback=blogroll_widget-bangers", "content": "The LOX and <mark>Rick Ross</mark> Join Forces on \"Feel My Pain\" By C. Vernon Coleman II August 14, 2016 9:51 AM SHARE TWEET EMAIL REDDIT EMAIL REDDIT Subscribe to XXL on It's been over a decade and a half since The LOX put out a full length LP. Sixteen years to be exact. Though they have remained active as a group and on the solo tip, fans are still fiending for the illusive We Are The Streets 2. Evidence might be pointing to that project being put in motion as the Yonkers trio puts out their second track in two weeks with the <mark>Rick Ross</mark> - assisted banger \"Feel My Pain.\" The laid back single is a reflective one with the top tier lyricists taking their life experiences into perspective. Styles P takes the second verse spitting, \"Told my mother if I die today I live like a king/I ain't sleep a lot but I lived out my dreams/Came from the streets with the dealers and the fiends/Couple people thought I wouldn't outlive my teens/Now I'm flyin' places, balconies and fireplaces/I ain't shootin' like the Uzi broke/Lookin' clean, eat cuisine with the bougie folks/Got diamonds but I still want rubies though/Classic like the book but we still make a movie though.\" <mark>Rick Ross</mark> joins the fold, sprinkling in his signature kingpin anecdotes. \"Ain't no love, my mind up, I shed my last tear/Street sweepin' these corners made me a cashier/A nigga's swag kept me sack like a quarterback/That type of paper made my ass never wannarap/Virgin, I had golden eagle kilos all in my lair/I see no evil, no witness, God bless these Cartiers,\" he spits. Even more reason for excitement for LOX fans, earlier this week, news broke that the trio has been heavy in the lab with A-list producers Just Blaze, <mark>DJ Premier</mark> and Timbaland. Over the past week, Styles P has taken to Instagram for three separate posts announcing that the group is working with the aforementioned esteemed beatmakers. 34 Rappers Going Platinum in 2016 Image of Subscribe to XXL on Filed Under: Bangers | <mark>Rick Ross</mark> | The LOX Category: Music | New Music SHARE TWEET EMAIL REDDIT More Leave a comment EMAIL Print this page Pin it! REDDIT Share on Tumblr!"}]