[{"date": "2015-12-18", "url": "http://www.statesboroherald.com/section/76/article/71781/", "content": "Tough immigration plans not a must Poll shows GOP voters more concerned about terrorists, border security Text Size: Small Large Medium This Aug. 28, 2014 file photo shows demonstrators being arrested in front of the White House during a protest on immigration reform. For all of the ferocity and double-speak over immigration reform at the GOP debate, most Republicans say the issue isn't a decisive factor in their vote for president according to a new AP-Gfk Poll. deeply unpopular within their party. More broadly, more Americans, regardless of their political affiliation, favor than oppose a pathway to citizenship for immigrants who are in the United States illegally, the poll shows. By LAURIE KELLMAN and EMILY SWANSONAssociated Press WASHINGTON--Retired postal clerk <mark>Jerry Wilson</mark> likes what he hears from GOP presidential hopefuls about overturning President Barack Obama's executive order easing deportation policies against people in the U.S. illegally. But he'll choose a Republican presidential nominee based on other issues--keeping American companies from moving overseas, for one. Keeping would-be attackers out of the country, for another. \"America comes first when you're the president of the United States,\" the Batavia, Ohio, resident, 67, said. \"You do everything you can to keep America safe. What about migrants, people who are already here illegally? That's not a do-or-die issue to me .\" For all of the ferocity and double-speak on immigration reform at the GOP debate, most Republicans like <mark>Wilson</mark> say the issue isn't a decisive factor in their vote for president, according to a new AP-GfK poll. Even among conservative Republicans, more than half--56 percent--say they either prefer a candidate who would keep Obama's immigration action in place or that they can imagine voting for a Republican presidential hopeful who would. The survey shows that Obama's immigration actions last year, which allowed some immigrants to apply for temporary legal status, are a particular sticking point for Republicans. Seventy-three percent of them say they prefer to support the candidate who would undo those steps taken by this president, who is deeply unpopular within their party. More broadly, more Americans--regardless of their political affiliation--favor than oppose a pathway to citizenship for immigrants who are in the United States illegally, the poll shows. Even among Republicans--4 in 10 of whom oppose making citizenship an option for people in the country illegally--it doesn't seem to be a make-or-break issue in their choice for president. Four in 10 conservative Republicans and 3 in 10 tea party Republicans favor a path to citizenship for immigrants already in the country illegally. Notably, the results from the Dec. 3 through Dec. 7 survey are unchanged since the questions were last asked in April--even after months of strong rhetoric by Republican presidential candidates, including front-runner <mark>Donald Trump</mark>, who proposes deporting the 11.5 million people in the country illegally. The survey results are powerful data points for the GOP candidates with little more than six weeks to go before the first votes are cast in Iowa. Republican Sens. Marco Rubio and Ted Cruz, both children of Cuban immigrants, are locked in an extraordinary battle for second place in the nomination fight, in large part over their positions on immigration. Rubio's rivals had used his 2013 comprehensive immigration reform bill to cast him as a supporter of a path to citizenship for those here illegally. He hasn't backed off that idea but has abandoned the notion of comprehensive reform on the complex issue and emphasizes border security first. Cruz, meanwhile, is casting himself as an opponent to \"legalization .\" He proposed amendments to Rubio's bill that would have massively increased legal immigration--but mostly, he says, to try to kill Rubio's legislation. While illegal immigration may not be a deal-breaker for Republicans on a national scale, few issues are more hotly contested on the ground in early voting states like Iowa and New Hampshire. Some GOP conservatives often lash out at allowing people to stay in the U.S. illegally, producing an environment where Republican candidates like Rubio and Bush have been forced to distance themselves from their own more forgiving policies in the past. But the poll shows immigration may not be the most pressing issue on Americans' minds once voting begins in the GOP primary contest. \"No candidate fits everybody's view,\" said Terry Arnell of Tower Lakes, Ill., a retired insurance company manager who right now likes <mark>Trump</mark>. So, what will be Arnell's priorities come election day? \"Gun rights. Securing our borders and certainly, securing as much as we can within our borders,\" Arnell, 63, said. \"I think it's very important that we secure our borders now. Then, we can worry about the other illegals here .\" The AP-GfK Poll of 1,007 adults was conducted online Dec. 3-7, using a sample drawn from GfK's probability-based KnowledgePanel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 3.4 percentage points.", "articleID": "2015121802_00224030_W", "names": {"Jerry Wilson": ["Q19586557", "Q20642537", "Q44746059", "Q6184664", "Q6184666"]}}, {"date": "2015-12-18", "url": "http://tdworld.com/blog/platte-river-equity-acquires-jameson-tools", "content": "Platte River Equity Acquires Jameson Tools Comments 0 Platte River Equity announced today that it has acquired Jameson, LLC, a leading manufacturer of quality tools and lighting solutions for professionals across industrial end markets worldwide. Denver, CO - Platte River Equity announced today that it has acquired Jameson, LLC, a leading manufacturer of quality tools and lighting solutions for professionals across industrial end markets worldwide. Platte River Equity will combine Jameson with its existing portfolio company, Huskie Tools, LLC, a leading independent provider of professional-grade, battery-operated hydraulic hand tools, hoists and related accessories, thereby creating a diversified entity focused on the industrial tools sector. \"For more than 50 years, Jameson has provided professionals worldwide with quality tools and lighting solutions,\" said <mark>Dan Miller</mark>, CEO of Jameson and, going forward, of the combined entity. \"With the strong reputation enjoyed by both companies, we are excited for the opportunity to enter new markets and accelerate the pace of new product development across both brands. We look forward to a union with Huskie Tools that is centered on growth, high-quality customer service and continued product innovation .\" The combined holding company will be headquartered in Glendale Heights, Illinois, and the senior leadership teams of both entities remain committed to the new platform. Huskie Tools and Jameson will maintain existing operations in Glendale Heights, Illinois and Clover, South Carolina, respectively. The companies will also retain their respective workforces. \"We are excited to unite two leading brands in the industrial tool market,\" said Roger Richter, Vice President of Operations of Huskie Tools. \"Jameson, known for its high-quality products and customer service, brings a broad suite of trusted products that we can offer to our customers, utilizing our combined marketing and sales channels. The combination of Huskie Tools and Jameson meaningfully enhances product offerings to customers in the utility, telecom and industrial tool markets .\" About Jameson Tools Established in 1956, Jameson is a manufacturer and provider of quality tools and lighting solutions for professionals across industrial end markets worldwide. Jameson's line-up of high quality, professional-grade products are utilized in lighting applications, inside wiring, underground cabling and locating, aerial cabling, line clearance and tree trimming. For more information, visit www.jamesonllc.com. About Huskie Tools, Inc.. Established in 1976, Huskie Tools is a leading independent provider of professional-grade, battery-powered hydraulic cutting and compression tools, hoists, and related accessories that are used by electric utilities and industrial companies. In 1989, Huskie Tools pioneered the industry when it introduced the first battery-operated, hydraulic compression tool in North America. Huskie Tools has become the brand of choice for electric utility linemen and industrial tradesmen. For more information, visit www.huskietools.com. About Platte River Equity Based in Denver, Colorado, Platte River Equity is a private equity firm that invests in lower middle market operating companies with enterprise values generally between $20 million and $250 million. The firm focuses on targeted industry sectors where it has deep operating and investing experience including aerospace and transportation; energy and industrial products and services; and chemicals, metals, minerals and agriculture. Platte River Equity has raised funds with committed capital in excess of $700 million. For more information, visit www.platteriverequity.com. CONTACT:", "articleID": "2015121816_00228940_W", "names": {"Dan Miller": ["Q1159124", "Q1159125", "Q15379140", "Q3013140", "Q3013142", "Q3015284", "Q37821129", "Q4293492", "Q5214024", "Q5214025", "Q5214029"]}}, {"date": "2015-12-21", "url": "http://www.mercurynews.com/crime-courts/ci_29292125/investigation-reveals-us-power-grid-vulnerable-foreign-hacks", "content": "Investigation reveals US power grid vulnerable to foreign hacks By GARANCE BURKE and JONATHAN FAHEY Associated Press Posted: 12/21/2015 06:01:43 AM PST Updated: 12/21/2015 06:01:47 AM PST SAN JOSE--Security researcher Brian Wallace was on the trail of hackers who had snatched a California university's housing files when he stumbled into a larger nightmare: Cyberattackers had opened a pathway into the networks running the United States power grid. Digital clues pointed to Iranian hackers. And Wallace found that they had already taken passwords, as well as engineering drawings of dozens of power plants, at least one with the title \"Mission Critical .\" The drawings were so detailed that experts say skilled attackers could have used them, along with other tools and malicious code, to knock out electricity flowing to millions of homes. Wallace was astonished. But this breach, The Associated Press has found, was not unique. About a dozen times in the last decade, sophisticated foreign hackers have gained enough remote access to control the operations networks that keep the lights on, according to top experts who spoke only on condition of anonymity due to the sensitive nature of the subject matter. The public almost never learns the details about these types of attacks--they're rarer but also more intricate and potentially dangerous than data theft. Information about the government's response to these hacks is often protected and sometimes classified; many are never even reported to the government. These intrusions have not caused the kind of cascading blackouts that are feared by the intelligence community. But so many attackers have stowed away in the systems that run the U.S. electric grid that experts say they likely have the capability to strike at will. Advertisement And that's what worries Wallace and other cybersecurity experts most. \"If the geopolitical situation changes and Iran wants to target these facilities, if they have this kind of information it will make it a lot easier,\" said Robert M. Lee, a former U.S. Air Force cyberwarfare operations officer. \"It will also help them stay quiet and stealthy inside .\" In 2012 and 2013, in well-publicized attacks, Russian hackers successfully sent and received encrypted commands to U.S. public utilities and power generators; some private firms concluded this was an effort to position interlopers to act in the event of a political crisis. And the Department of Homeland Security announced about a year ago that a separate hacking campaign, believed by some private firms to have Russian origins, had injected software with malware that allowed the attackers to spy on U.S. energy companies. \"You want to be stealth,\" said Lillian Ablon, a cybersecurity expert at the RAND Corporation. \"That's the ultimate power, because when you need to do something you are already in place .\" The hackers have gained access to an aging, outdated power system. Many of the substations and equipment that move power across the U.S. are decrepit and were never built with network security in mind; hooking the plants up to the Internet over the last decade has given hackers new backdoors in. Distant wind farms, home solar panels, smart meters and other networked devices must be remotely monitored and controlled, which opens up the broader system to fresh points of attack. Hundreds of contractors sell software and equipment to energy companies, and attackers have successfully used those outside companies as a way to get inside networks tied to the grid. Attributing attacks is notoriously tricky. Neither U.S. officials nor cybersecurity experts would or could say if the Islamic Republic of Iran was involved in the attack Wallace discovered involving Calpine Corp., a power producer with 82 plants operating in 18 states and Canada. Private firms have alleged other recent hacks of networks and machinery tied to the U.S. power grid were carried out by teams from within Russia and China, some with governmental support. Even the Islamic State group is trying to hack American power companies, a top Homeland Security official told industry executives in October. Homeland Security spokesman SY Lee said that his agency is coordinating efforts to strengthen grid cybersecurity nationwide and to raise awareness about evolving threats to the electric sector through industry trainings and risk assessments. As Deputy Secretary Alejandro Mayorkas acknowledged in an interview, however, \"we are not where we need to be\" on cybersecurity. That's partly because the grid is largely privately owned and has entire sections that fall outside federal regulation, which experts argue leaves the industry poorly defended against a growing universe of hackers seeking to access its networks. As Deputy Energy Secretary Elizabeth Sherwood Randall said in a speech earlier this year, \"If we don't protect the energy sector, we are putting every other sector of the economy in peril .\" ------THE CALPINE BREACH The AP looked at the vulnerability of the energy grid as part of a yearlong, AP-Associated Press Media Editors examination of the state of the nation's infrastructure. AP conducted more than 120 interviews and examined dozens of sets of data, government reports and private analyses to gauge whether the industry is prepared to defend against cyberattacks. The attack involving Calpine is particularly disturbing because the cyberspies grabbed so much, according to interviews and previously unreported documents. Cybersecurity experts say the breach began at least as far back as August 2013, and could still be going on today. Calpine spokesman Brett Kerr said the company's information was stolen from a contractor that does business with Calpine. He said the stolen diagrams and passwords were old--some diagrams dated to 2002--and presented no threat, though some outside experts disagree. Kerr would not say whether the configuration of the power plants' operations networks--also valuable information--remained the same as when the intrusion occurred, or whether it was possible the attackers still had a foothold. According to the AP investigation, the hackers got:--User names and passwords that could be used to connect remotely to Calpine's networks, which were being maintained by a data security company. Even if some of the information was outdated, experts say skilled hackers could have found a way to update the passwords and slip past firewalls to get into the operations network. Eventually, they say, the intruders could shut down generating stations, foul communications networks and possibly cause a blackout near the plants .--Detailed engineering drawings of networks and power stations from New York to California--71 in all--showing the precise location of devices that communicate with gas turbines, boilers and other crucial equipment attackers would need to hack specific plants .--Additional diagrams showing how those local plants transmit information back to the company's virtual cloud, knowledge attackers could use to mask their activity. For example, one map shows how information flows from the Agnews power plant in San Jose, California, near the San Francisco 49ers football stadium, to the company headquarters in Houston. Wallace first came across the breach while tracking a new strain of noxious software that had been used to steal student housing files at the University of California, Santa Barbara. \"I saw a mention in our logs that the attackers stored their malware in some FTP servers online,\" said Wallace, who had recently joined the Irvine, Calif.-based cybersecurity firm Cylance, Inc., fresh out of college. \"It wasn't even my job to look into it, but I just thought there had to be something more there .\" Wallace started digging. Soon, he found the FTP servers, typically used to transfer large numbers of files back and forth across the Internet, and the hackers' ill-gotten data--a tranche of more than 19,000 stolen files from thousands of computers across the world, including key documents from Calpine. Before Wallace could dive into the files, his first priority was to track where the hackers would strike next--and try to stop them. He started staying up nights, often jittery on Red Bull, to reverse-engineer malware. He waited to get pinged that the intruders were at it again. Months later, Wallace got the alert: From Internet Protocol addresses in Tehran, the hackers had deployed TinyZbot, a Trojan horse-style of software that the attackers used to gain backdoor access to their targets, log their keystrokes and take screen shots of their information. The hacking group, he would find, included members in the Netherlands, Canada, and the United Kingdom. The more he followed their trail, the more nervous Wallace got. According to Cylance, the intruders had launched digital offensives that netted information about Pakistan International Airlines, the Mexican oil giant Pemex, the Israel Institute of Technology and Navy Marine Corps Intranet, a legacy network of the U.S. military. None of the four responded to AP's request for comment. Then he discovered evidence of the attackers' most terrifying heist--a folder containing dozens of engineers' diagrams of the Calpine power plants. According to multiple sources, the drawings contained user names and passwords that an intruder would need to break through a firewall separating Calpine's communications and operations networks, then move around in the network where the turbines are controlled. The schematics also displayed the locations of devices inside the plants' process control networks that receive information from power-generating equipment. With those details, experts say skilled hackers could have penetrated the operations network and eventually shut down generating stations, possibly causing a blackout. Cylance researchers said the intruders stored their stolen goods on seven unencrypted FTP servers requiring no authentication to access details about Calpine's plants. Jumbled in the folders was code that could be used to spread malware to other companies without being traced back to the attackers' computers, as well as handcrafted software designed to mask that the Internet Protocol addresses they were using were in Iran. Circumstantial evidence such as snippets of Persian comments in the code helped investigators conclude that Iran was the source of the attacks. Calpine didn't know its information had been compromised until it was informed by Cylance, Kerr said. Iranian U.N. Mission spokesman Hamid Babaei did not return calls or address questions emailed by AP. Cylance notified the FBI, which warned the U.S. energy sector in an unclassified bulletin last December that a group using Iran-based IP addresses had targeted the industry. Whether there was any connection between the Iranian government and the individual hackers who Wallace traced--with the usernames parviz, Alireza, Kaj, Salman Ghazikhani and Bahman Mohebbi--is unclear .------A \"LUCRATIVE' TARGET Cyberattacks designed to steal information are steadily growing in scope and frequency; there have been high-profile hacks of Target, eBay and federal targets such as the U.S. Office of Personnel Management. But assaults on the power grid and other critical infrastructure aim to go a step further. Trained, well-funded adversaries can gain control of physical assets--power plants, substations and transmission equipment. With extensive control, they could knock out the electricity vital to daily life and the economy, and endanger the flow of power to mass transportation, military installations and home refrigerators. In the summer of 2014, a hacker of unknown origin, using masking software called Tor, took over the controls of a large utility's wind farm, according to a former industry compliance official who reviewed a report that was scrubbed of the utility's name. The hacker then changed an important setting, called the automatic voltage regulator, from\" automatic \"to\" manual, \"he said. That seemingly simple change to any power plant can damage the generator and destabilize parts of the nearby grid if the plant's output is high enough. Last year, Homeland Security released several maps that showed a virtual hit list of critical infrastructure, including two substations in the San Francisco Bay area, water and gas pipelines and a refinery. And according to a previously reported study by the Federal Energy Regulatory Commission, a coordinated attack on just nine critical power stations could cause a coast-to-coast blackout that could last months, far longer than the one that plunged the Northeast into darkness in 2003 .\" The grid is a tough target, but a lucrative target, \"said <mark>Keith Alexander</mark>, the former director of the National Security Agency who now runs a cybersecurity firm. The number of sophisticated attacks is growing, he said .\" There is a constant, steady upbeat. I see a rising tide. \"No one claims that it would be easy to bring down the grid. To circumvent companies' security, adversaries must understand the networks well enough to write code that can communicate with tiny computers that control generators and other major equipment. Even then, it's difficult to cause a widespread blackout because the grid is designed to keep electricity flowing when equipment or lines go down, an almost daily occurrence that customers never see. Because it would take such expertise to plunge a city or region into darkness, some say threats to the grid are overstated--in particular, by those who get paid to help companies protect their networks. Still, even those who said the risks of cyber threats can be exaggerated agree it is possible for cyberattackers to cause a large-scale blackout. And nearly everyone agrees that there are weaknesses that open the door to malefactors. Traditional central power stations and transmission systems include equipment that is decades old and physically unable to handle electronic threats. Some run on machines that use software that is so old that malware protections don't exist, such as Windows '95 and FORTRAN, a programming language developed in the 1950s. At the Tennessee Valley Authority, a corporation owned by the federal government that powers 9 million households in the southeastern U.S., a former operations security expert said in recent years he saw passwords for some key operating systems stored on sticky notes .\" Some of the control systems boot off of floppy disks, \"said <mark>Patrick Miller</mark>, who has evaluated hydroelectric dam cybersecurity for the U.S. Bureau of Reclamation and Army Corps of Engineers .\" Some dams have modeling systems that run on something that looks like a washing machine hooked up to tape spools. It looks like the early NASA stuff that went to the moon. \"The rush to tie smart meters, home programmable thermostats and other smart appliances to the grid also is causing fresh vulnerabilities. About 45 percent of homes in the U.S. are hooked up to a smart meter, which measures electricity usage and shares information with the grid. The grid uses that information to adjust output or limit power deliveries to customers during peak hours. Those meters are relatively simple by design, mostly to keep their cost low, but their security is flimsy. Some can be hacked by plugging in an adapter that costs $30 on eBay, researchers say. FERC recently raised concerns about another area that is not covered by federal cybersecurity rules: contractors that sell energy companies software and equipment. As is evident from the Calpine incident, attackers have used outside companies to pull off hacks against energy companies .\" We've got these vulnerable systems out there that are old and never had security built into them, and now we're exposing them to a wider audience, \"said Justin Lowe, a utility cybersecurity expert at PA Consulting Group .\" That wider audience is getting much more hostile. \"------DEFENDING THE GRID The full extent of the attacks on the grid is not public knowledge. A Freedom of Information Act request by the AP for information regarding any FBI investigations of such hacks was not fulfilled. The Department of Justice said that agency kept no record of how often any such cases had been prosecuted. The North American Electric Reliability Corporation, which oversees the reliability of the electrical sector, collects information about cyber incidents involving utilities and other users, owners, and operators of the bulk power system--but it is scrubbed of identifying information and details are confidential and exempt from disclosure under FOIA. Authorities say they take the threat seriously. In response to a FOIA request, Homeland Security said it had helped more than 100 energy and chemical companies improve their cyber defenses, and held both classified and unclassified briefings in June 2013 and late 2014 on threats to companies associated with power grid operations. A small DHS team compiles statistics about hacks and vulnerabilities on control systems powering the grid and other public infrastructure, and responds to some attacks. But former federal employees who spoke on the condition of anonymity because the information was sensitive said government red tape kept the team from thoroughly responding to the smaller municipal and rural utilities that most needed their help, and that the statistics overstated the agency's grasp of the problem. The companies themselves say they are vigilant--though they caution no fortifications are foolproof. Early this year, an operations supervisor in Virginia for a subsidiary of American Electric Power--the nation's largest power grid operator, with operations in 38 states--opened a personal email on a company laptop and unwittingly downloaded a piece of malware called CryptoLocker. Known as\" ransomware, \"CryptoLocker is a relatively common type of malware that reaches to outside servers, usually overseas, and downloads encryption instructions that scramble a computer's contents, making them inaccessible to anyone without a specific\" key. \"The malware then moves through a computer--and computer network--and encrypts all the files it can, keeping users from accessing anything. In exchange for a fee, the hackers provide the victim a key that allows the files to be unlocked. Members of AEP's cyber-security team--housed in the company's Columbus, Ohio, headquarters behind an unmarked door that unlocks with a fingerprint scanner--saw the strange network behavior as soon as it started .\" When you see this (code) attempting to hit thousands of systems outside of the AEP network, that's a \"holy crap' moment,\" said Sean Parcel, AEP's lead cyberinvestigator. Had CryptoLocker wormed its way into AEP's system, the business and operations networks could have locked up, experts say. But Parcel said AEP's cyberteam already had blocked the foreign addresses that the malware needed to reach to start encrypting files, part of a policy of systematically blocking hundreds of Internet Protocol addresses each week to keep employees from inadvertently downloading malicious code. AEP said the team remotely isolated and erased the supervisor's computer before its systems were affected. Like most big utilities, AEP's power plants, substations and other vital equipment are managed by a network that is separated from the company's business software with layers of authentication, and is not accessible via the Internet. Creating that separation, and making sure that separation is maintained, is among the most important things utilities can do to protect the grid's physical assets. But cybersecurity experts say the protective gaps between computer systems that manage utilities' business operations and machines that manage their grids are not always as wide or as unbridgeable as utilities say they are. And even the utilities' own experts, who maintain it would be extraordinarily difficult for a hacker to knock out power to customers, admit there is always a way in. \"If the motivation is high enough on the attacker side, and they have funding to accomplish their mission,\" Parcel said, \"they will find a way .\" ---- --", "articleID": "2015122114_00398887_W", "names": {"Keith Alexander": ["Q1360488", "Q1385942", "Q6383962", "Q6383966"], "Patrick Miller": ["Q16228480", "Q2057815", "Q7147222"]}}, {"date": "2015-12-22", "url": "http://www.stuff.co.nz/entertainment/film/75372289/leonardo-dicaprio-praises-the-revenant-director-over-bear-attack-scene", "content": "Leonardo DiCaprio praises The Revenant director over bear attack scene Last updated 14:10, December 22 2015 20th Century Fox Leonardo Di Caprio put himself through a lot for his latest role including sleeping in an animal carcass. Leonardo DiCaprio has praised The Revenant director Alejandro Inarritu's work in creating a key scene so unsettling that sparked mischievous rumours it showed the actor's character being \"raped\" by a bear. \"People are talking about it because it's something incredibly groundbreaking...[they] are responding to it because it's unlike anything they've seen in cinema ever really,\" DiCaprio told ABC's 7.30 Report. \"[Inarritu allows] the audience to be in a very raw violent savage bear attack yet feel the intimacy of both man and beast, you feel the sweat and the heat coming off of the animal. Leonardo DiCaprio in The Revenant. READ MORE: * The Revenant: No, Leonardo DiCaprio is not raped by a bear, says Fox * Leo DiCaprio slept in an animal's carcass * Critic roasted for suggesting The Revenant\" not for women' * <mark>Tom Hardy</mark> tackled fear of horses for The Revenant \"I'm not at liberty to speak about exactly how [Inarritu] pulled this off but I will say that it involved months of rehearsal [and] watching 100 different bear attacks .\" On December 1 popular American news aggregation website The Drudge Report claimed of the pulsating scene: \"The bear flips Leo over and thrusts and thrusts during the explicit mauling. He is raped - twice!\". Several entertainment bloggers and social media followed suit. The bear scene from The Revenant. Fox studios denied the claims to The Hollywood Reporter: \"There is clearly no rape scene with a bear\". It also pointed out the attack happens because the female bear is protecting her cubs. The Revenant opens in New Zealand cinemas January 7. Ad Feedback - Sydney Morning Herald Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Film story: Star Wars whopping pay gap: Harrison Ford reportedly made 50x that of his co-stars Entertainment Homepage Comments", "articleID": "2015122201_00196671_W", "names": {"Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}}, {"date": "2015-12-25", "url": "http://www.inquisitr.com/2656933/justin-bieber-could-have-died-bombshell-from-scooter-braun-reveals-biebers-darkest-moment-what-saved-him/", "content": "Meet Scooter Braun, the man behind the pop idol phenomenon known as Justin Bieber. Now 21, Bieber recently underwent a dramatic transformation that changed his persona and the public's perception of the pop star. But reflecting on the past of his protegee and client, Scooter reveals that Justin could have died at one point, revealed the Mirror. Braun has managed Bieber for years, but only now is the pop idol's manager ready to share the struggles that, during one particularly dark period, were life-threatening. How serious were those past problems? Scooter shared that after a tidal wave of bad publicity that hit Justin hard, Braun would not allow his client to tour. That ban occurred in 2013, following the release of the Journals album. Scooter Braun and Justin Bieber are pals as well as manager and client. [Photo by Jemal Countess/Getty Images] \"I was not going to let him work. He wanted to tour, and I honestly at that time felt, if he toured, he could die,\" Braun said. Scooter admits that the outside world had no idea what was going on in Bieber's life. Braun also made it clear that he won't tell the full story because he's waiting for Bieber to share when he's ready. \"The outsiders don't really know what was happening. It was far worse than people realize. and when he is ready, he will tell what he was going through. But it's a hard thing to watch someone you care and genuinely love go through that. I'm really, really happy that's over,\" emphasized Scooter. Justin Bieber and Scooter Braun share a sense of humor. [Photo by Eugene Gologursky/Getty Images for Dolce & Gabbana] In addition, Braun recalled a turning point in the career of his client, crediting an intern in his office for coming up with the milestone event. It happened when Scooter held a staff meeting, encouraging his employees to suggest ideas for a thorough interview. Although Braun suggested famous talk show hosts such as Oprah Winfrey and Katie Couric, a 21-year-old Ava Coleman, then an intern, suggested something very different. \"I just think my generation doesn't care about that,\" said Ava in response to the suggestions of Oprah and Katie. \"I think if you want people to see that he's for real, he should do a Comedy Central roast .\" Scooter proclaimed it a genius concept, and just one day later engaged Comedy Central in a phone conversation. With <mark>Kevin Hart</mark> taking on the role of host and utilizing his comedic talents, the Comedy Central roast proposed by that intern and embraced as a great idea by Scooter proved to be the turning point that saved Bieber's career by revealing his humility and sense of humor. The pop idol changed his life at the Comedy Central Roast of Justin Bieber. [Photo by <mark>Kevin</mark> Winter/Getty Images] As to what caused those dark times and damaging reports? Braun did not go into detail himself just yet, noted the Daily Mail. Just like his client, Scooter is modest. Braun admitted that he feels in some ways he failed when it came to helping the young pop star turn around his life. Scooter recognizes that the intense marketing program has made an impression, but he praises the 21-year-old for making the decision to undergo a life-changing--and potentially life-saving--transformation. \"I know people have seen the marketing and the A & R and everything we put together, and they're like,\" Wow, great job!' But I want to be really clear: I was trying to do that job for a year and a half, and I failed every single day. It wasn't until something happened that it clicked for him. He made the conscious decision as a young man: \"I need to make a change in my own life .'\" Braun also maintains an active Twitter account, sharing tidbits from his life as well as those of the clients he manages and, as shown with Bieber, genuinely cares about. And his mini-bio on Twitter reveals that Braun believes in the importance of family and friends. \"Family and friends are everything. I live life and try and smile as much as possible. Inspire the world to try!\" urges Scooter. [Photo by Jemal Countess/Getty Images]", "articleID": "2015122519_00456809_W", "names": {"Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"]}}, {"date": "2015-12-27", "url": "http://www.mtv.com/news/2718017/artists-left-us-hanging-2015/", "content": "by Madeline Roth 59m ago Every year, music lovers dive into a barrage of year-end lists recapping the songs we couldn't stop singing, the artists who demanded our attention and the albums that merited heavy rotation. 2015 surely gave us so much to be excited about, but (sorry to be a Debbie Downer), it also left us in a funk over what could've been. Because for every Dr. Dre and Justin Bieber who graced us with long-awaited new releases, there was a Rihanna and Frank Ocean who left us hanging. Assuming none of these 10 artists pull a Beyoncé and go for a buzzer-beater album drop before the calendar flips this week, consider them the year's biggest teasers and heartbreakers. Hopefully it'll all be worth the wait in 2016. And if not, well, at least Adele came through with an album for us to sob to. Rihanna Getty Images Remember on Jan. 24, when Rihanna released \"FourFiveSeconds,\" the twang-tinged supposed \"first single\" for her next album? LOLOLOLOL, what fools we were to think she'd be so predictable with LP No. 8. She followed up with a pair of new tracks (\"Bitch Better Have My Money\" in March and \"American Oxygen\" in April), an album title and cover art announcement, AND a lineup of world tour dates--basically, everything except the actual album. So while the wait for ANTI ticks on, we're left trying in vein to decipher clues from that hella mysterious Samsung campaign. But at least we can do so in some dope socks and Pumas. Kanye West Getty Images The-album-that-may-or-may-not-be-called - Swish is Kanye's seventh full-length LP and the one that's most ruffling fans' feathers. Yo \"Ye, how ya gonna tease us with the rowdy\" All Day, \"the Paul McCartney-assisted lullaby\" Only One, \"and that Sia and Vic Mensa collab\" Wolves, \"and then leave us empty-handed for this week's calendar flip?! DO IT FOR THE KIDS, BRO. On the one hand, Kanye's had a busy year, between his new dad duties, presidential announcements and fashion empire-building. On the other hand, we're just selfish and we want this album more than sneakerheads want custom Yeezy Boosts. Luckily,\" Ye seems to be in full-on creative mode now--he took to Twitter earlier this month to effectively tell the world to leave him alone until the album's finished. Thank Yeezus for that .?? Macklemore Getty Images Jan. 1, 2015: The date was ripe with declarations of self-improvement and promises for the year ahead. So on that New Years Day, Ben Haggerty, a.k.a. Macklemore, optimistically tweeted a response to a fan who asked when he can hear the follow-up to 2012's The Heist. \"You will this year. Believe that,\" the MC wrote, delivering six little words and one big lie. OK, OK, so it's not like Haggerty and partner-in-rhyme Ryan Lewis have been twiddling their thumbs all year. In August, they debuted \"Growing Up (Sloane's Song),\" a sunny, Ed Sheeran-assisted tune dedicated to Macklemore's baby daughter. Then the duo livened up the VMAS later that month with their performance of \"Downtown,\" the most soulful foot-stomper since \"Uptown Funk .\" Clearly, 2016's shaping up to be a huge year for hip-hop, and Macklemore will hopefully contribute their own LP to the lot. Radiohead Getty Images Radiohead's really been dragging their canvas-sneakered feet on their ninth album, the follow-up to 2011's The King of Limbs. Producer Nigel Goodrich stirred up hopefulness in December 2014 when he tweeted a pic of singer Thom Yorke and guitarist Jonny Greenwood in the studio. And a new Radiohead LP appeared on many of the \"most anticipated albums of 2015\" lists at the top of the year. But we have yet to hear a projected release date, though Greenwood said in October that \"lots has been recorded .\" Even though we're now stuck in the longest-ever stretch of time between Radiohead records, the band did gift fans a surprise stocking stuffer earlier this week by releasing \"Spectre,\" their unused theme song for the latest <mark>James Bond</mark> film. And 007's reject is a Radiohead fan's ear candy. Gwen Stefani Getty Images Way back in October 2014, Gwen Stefani said during a Twitter Q & A that her third studio album would be arriving in December. But that December came and went. And now this December's basically come and gone. So what gives? Turns out, the delay may actually prove to be a great thing. In August, Stefani and Gavin Rossdale, her husband of 13 years, announced their divorce. And as painful as breakups are, they can also do amazing things for an artist's creativity. Indeed, Stefani told Entertainment Weekly in October that she'd scrapped an entire album's worth of material and was instead using her shattered relationship as inspiration for her new music. She released a new track, \"Used To Love You,\" shortly after, giving us a good idea of what may be in store for her first solo album in a decade, which will likely (hopefully) release next year. Frank Ocean Getty Images Do you ever just wake up in a cold sweat and wonder if Frank Ocean was ever real or just a figment of your imagination? Same. In 2012, he came to us in a hazy dream, dropped channel ORANGE, and then practically disappeared until one fateful day in April 2015, when he announced he'd release a new album in July. A rep for Ocean confirmed to Billboard that a joint album/magazine project were due for July, and the wait was on...and it still is. His last-minute cancellation at FYF Fest in Los Angeles over the summer didn't ease fans' frustration, and we've gotten exactly zero progress reports since then. I mean...he said July, but he didn't say what year...<mark>James Blake</mark> Getty Images There's been an unsettling shadow surrounding the English producer and singer-songwriter's next album--which is only fitting for a project reportedly titled Radio Silence. After revealing in June 2014 that his next album was halfway done, <mark>Blake</mark>'s next progress report came that November, when he said it would arrive in \"about five months .\" Which would mean April 2015. Which was eight whole months ago. Still, the follow-up to 2013's Overgrown is rumored to feature collaborations from Kanye West and Bon Iver's Justin Vernon, so it's bound to be worth the wait. (Repeat that as many times as necessary .) Young Thug Getty Images Young Thug's one of the most exciting new MCs today, but DAMN, it's been a long wait for HiTunes (stylized as Hy! & pound; UN35). Originally slated for release on Aug. 28, Thugger's debut LP was pushed back to Sept. 24, then pushed back AGAIN after he postponed several dates on his headlining tour. Nevertheless, Thug managed to have an impressive year by releasing not one, not two, but three mixtapes: Barter 6, Slime Season and Slime Season 2, all of which are only heightening the hype for HiTunes. Get on it, 300 Entertainment. HAIM Getty Images There aren't enough Este bassface GIFs in the world to cheer up HAIM fans who were hoping for a new album this year. In June 2014, the sister trio told BBC 6 Music that their Days Are Gone follow-up is \"coming very soon .\" Eighteen months later, though, we haven't heard so much as a new single, though HAIM told Zane Lowe in October that they're working on the LP \"every day .\" Plus, they scored their own Beats 1 show this year, so technically you can hear them on the radio. Grasp those straws. Grasp them tight. Drake Getty Images To say that Drake left us hanging in 2015 is both justifiable and laughable at the same time. Between his stellar mixtapes, his brutal, Grammy-nominated beatdown of Meek Mill and his ability to single-handedly make a turtleneck look cool again, the dude essentially had this year in a chokehold. AND YET, Views From the 6--the album he's been teasing for more than a year--is nowhere in sight. Rumors about a Sept. 24 release date proved fallacious, but the current theory is that it'll drop in January (that's taken from a casual line in his \"30 for 30\" freestyle: \"But just know it will be January in no time\" ). Whatever the case may be, his February mixtape If You're Reading This It's Too Late arrived without warning or promotion and managed to break records and spawn his biggest hit to date--so it's exciting to imagine the possibilities behind a proper album release. The 6ix Gawd is watching, and we're watching too. Madeline Roth @ madfitzroth", "articleID": "2015122800_00290815_W", "names": {"James Blake": ["Q350362", "Q53333"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"]}}, {"date": "2015-12-29", "url": "http://blogs.wsj.com/washwire/2015/12/29/super-pac-backing-jeb-bush-attacks-marco-rubio-in-ad-airing-in-iowa/", "content": "Article Comments (1) 2016 2016 Election Ads Iowa Jeb Bush Marco Rubio Right to Rise PAC By Rebecca Ballhaus @ rebeccaballhaus rebecca.ballhaus @ wsj.com Biography CONNECT @ rebeccaballhaus rebecca.ballhaus @ wsj.com Biography Marco Rubio and <mark>Donald Trump</mark> shake hands as Jeb Bush looks on during the Republican presidential debate in Milwaukee Nov. 10, 2015. Morry Gash/Associated Press The super PAC backing Republican Jeb Bush is airing a new ad in Iowa criticizing rival Marco Rubio for skipping his U.S. Senate duties while running for president. The campaign, which will run for two weeks and cost $1.4 million, is the latest chapter in Bush backers' efforts to portray Mr. Rubio as overly devoted to campaign fundraising. More In 2016 5 New Year's Resolutions for <mark>Trump</mark>, Clinton and Other 2016 Campaigns Video: Ted Cruz Is Loathed in Washington but Loved in Iowa For Obama, 2015 Was a Mixed Year in Foreign Policy Capital Journal Daybreak: <mark>Trump</mark>'s Strength Points to New Dynamic in New Hampshire, More Seib Video: Three Things to Watch for Next Year in Politics \"Days after the Paris attacks, senators came together for a top-secret briefing on the terrorist threat,\" the narrator intones, referring to the terrorist attacks in Paris last month that left more than 120 people dead. \"Marco Rubio was missing, fundraising in California instead .\" With an image of an empty seat, the ad also knocks Mr. Rubio for missing a similar briefing following the attacks in San Bernardino, Calif., earlier this month. The ad also notes that Mr. Rubio has missed \"more total votes than any other senator,\" repeating a line that many of Mr. Rubio's rivals have used against him. Mr. Rubio's campaign on Tuesday pushed back on the super PAC's criticism. \"Bush's team dishonestly omits that Marco is on the Senate's Intelligence Committee, where he attended the highest level briefings on the Paris attacks,\" Alex Conant, Mr. Rubio's spokesman, said in a statement emailed to reporters. \"No other candidate for president has received more classified Intelligence briefings or better understands the threats facing our nation today than Marco. It's sad to see Jeb's\" joyful' campaign reduced to such intellectual dishonesty. \"The pro-Bush super PAC, Right to Rise USA, raised $103 million in the first half of the year--far more than any other candidate's allied super PAC--and has spent more than $30 million on TV ads. But despite spending considerably more than Mr. Bush's rivals, the super PAC has failed to move the needle for the former Florida governor. Mr. Bush is in sixth place among Republican primary voters, with 4.4% support, according to a Real Clear Politics average of recent national polls. In Iowa, which holds the first-in-the-nation caucus Feb. 1, Mr. Bush is in fifth place, with 4.8%, according to Real Clear Politics. Earlier this month, Right to Rise aired an ad campaign nationally and in four early states knocking Republican front-runner <mark>Donald Trump</mark> as\" impulsive and reckless \"and criticizing votes by Texas Sen. Ted Cruz that it said would\" dramatically weaken counter-terrorism surveillance. \"That ad also went after Mr. Rubio for skipping his Senate duties\" just to campaign. \"______________________________________________________ 2016 Election Calendar | WSJ/NBC Polls | 2016 Poll Standings Politics Alerts: Get email alerts on breaking news and big scoops. Capital Journal Daybreak Newsletter: Sign up to get the latest on politics, policy and defense delivered to your inbox every morning. For the latest Washington news, follow @ wsjpolitics For outside analysis, follow @ wsjthinktank Recommended post x 2015: Top 10 Most-Read Capital Journal Stories", "articleID": "2015122916_00671781_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2015-12-30", "url": "http://queenstribune.com/a-lifetime-of-public-service-from-a-young-age-katz-heard-the-call-to-serve/#comments", "content": "By Domenick Rafter Editor in Chief Melinda Katz was first elected to office in a special election in 1994 at the age of 28. Running on the Liberal Party line, she defeated both a Democrat and a Republican to be elected to the State Assembly representing a district centered in her native Forest Hills that also included Rego Park and parts of Glendale and Middle Village. She won the Assembly seat vacated by Alan Hevesi, who had been elected City Comptroller several months earlier. In the Assembly, Katz--as the youngest woman in the body at the time--had a special focus on women's issues, authorizing legislation that required HMOs to provide gynecological care to women without forcing them to see a primary care physician first--a law that later went national. Katz sat in the Democratic caucus and was reelected in November 1994 to a full term and again in 1996. But she gave up her seat in 1998 to run for higher office. She set her eyes on Congress, seeking the sprawling Brooklyn and Queens seat vacated by Chuck Schumer for his successful run for Senate. Then-Assemblywoman Melinda Katz with then-First Lady Hillary Clinton. In a district that included heavily Jewish neighborhoods of Brooklyn, such as Brighton Beach, Midwood, Sheepshead Bay and Mill Basin, as well as the Rockaways, Howard Beach, Woodhaven, Middle Village, Corona and Forest Hills in Queens, Katz was one of four Democrats who faced off for the nomination in the very Democratic district. She was the only candidate from Queens and the only woman. Though her three Brooklyn opponents did split the vote, Katz fell less than 500 votes short of then-Councilman Anthony Weiner, a protégé of Schumer's. Katz remained on the Liberal Party's line in November of that year, but only garnered just over five percent of the vote. After her defeat, Katz went to work for Borough President Clare Shulman in Borough Hall as director of community boards. In addition, she assisted the Borough President in proposing sites for city facilities and creating a strategic plan for the economic development of Queens. \"I took a lot from her administration,\" Katz said. \"It was my first view of city government and my first view of an executive, and someone who can call all the players to the table, and I took that from her .\" In 2001, Katz sought elected office again, running for the City Council seat vacated by Karen Koslowitz, again based in Forest Hills, but also including Kew Gardens, Rego Park and parts of Elmhurst, Maspeth and Richmond Hill. She won the primary and general election handily and served eight years in City Hall. In the Council, Katz chaired the powerful Land Use Committee, where she was the council's point person in many of the Bloomberg-era zoning proposals, including Hudson Yards on the West Side of Manhattan and numerous neighborhood rezoning plans in Queens including Forest Hills, Rego Park, Middle Village, Glendale, Woodhaven, Richmond Hill and Cambria Heights. Term limited in 2009, Katz decided to seek citywide office, running for City Comptroller in a four-way Democratic primary that included two other candidates from Queens; her Council colleagues <mark>John Liu</mark> and David Weprin. Though she won her own former Assembly district--as well as one in Staten Island--and finished second in Queens, she failed to make the runoff, which was eventually won by <mark>Liu</mark>. Katz getting sworn in for her first elected office, State Assembly, in 1994. Katz then went back to private practice, as a lawyer, for several years, but opted to make a second political comeback in 2013, running for Queens Borough President. Facing a crowded Democratic primary that dwindled to three candidates, Katz won a 44 percent plurality and went on to defeat her Republican opponents with 80 percent of toe vote to be elected Queens' 19th borough president, and third consecutive woman. As far as her political future, Katz isn't ruling anything out. Political pundits and historians will be quick to point out the borough presidency has not necessarily been a road to higher officer for others. Of the 90 people who have served at the helm of the five boroughs since 1898, only four: Manhattanites <mark>Robert Wagner</mark>, David Dinkins, Scott Stringer and Bronx's Robert Abrams have won election to citywide or statewide office. Nevertheless, at age 50, Katz is still young and has a resume that has led to her name being thrown around for various higher positions, including mayor and governor. But for now, Katz said she's content in her current job, where she would be term limited in 2021 providing she runs and wins a second term in 2017.", "articleID": "2015123016_00411490_W", "names": {"John Liu": ["Q43380304", "Q6244999"]}}]