[{"articleID": "2013111101_00033483_W", "names": {"Chad Smith": ["Q1058609", "Q17303653", "Q269500", "Q5066355", "Q5066356", "Q5066358"]}, "date": "2013-11-10", "url": "http://feeds.theguardian.com/c/34708/f/663860/s/3384abd9/sc/38/l/0L0Stheguardian0N0Cfootball0C20A130Cnov0C10A0Cred0Ehot0Echili0Epeppers0Edrummer0Ewiping0Eflamengo0Eshirt/story01.htm", "content": "Red Hot Chili Peppers drummer sorry for wiping backside on Flamengo shirt <mark>Chad Smith</mark>, the drummer for the US rock band Flamengo fans after he caused outrage in Brazil by wiping his backside with the club's shirt. <mark>Smith</mark> made the gesture - which was filmed and went viral on the internet - at a drum clinic in Belo Horizonte last week. The band played there as part of a South American tour, before moving on to Rio, home to Flamengo, where they played on Saturday evening. Fans of Flamengo, who claim to be the best-supported club in Brazil with more than 30m fans, were outraged by the incident and forced <mark>Smith</mark> to quickly backtrack. \"I want to apologise for my inappropriate antics at the drum clinic, my joke about team rivalries went too far,\" <mark>Smith</mark> said on twitter. \"Flamenco (sic) fans...I'm sorry .\" Red Hot Chili Peppers drummer sorry for wiping backside on Flamengo shirt More shocking revelations from the mysterious \"Secret Footballer'. Tim Krul inspires Newcastle United to three points at Tottenham Hotspur Robot trade fair in Japan Tokyo's international robot exhibition (iREX) Teenagers say goodbye to Facebook and hello to messenger apps Aid efforts begin after typhoon Haiyan kills 10,000 in Philippines: live updates Manchester United v Arsenal - live! Sunderland v Manchester City - as it happened Homosexuality illegal in 41 out of 53 Commonwealth countries - report Bradley Wiggins capped his remarkable sporting year by taking home the big prize at the ceremony in London A glass of wine with a rough sleeper, Santa in trunks, a thousand partying Muscovites...in a My Best Shot special, top photographers pick the image that sums up winter for them"}, {"articleID": "2020030421_00014624_W", "names": {"President Bush": ["Q207", "Q23505"], "John Kerry": ["Q22316", "Q6242998"], "Gary Cohn": ["Q5524866", "Q5524867", "Q5524868"]}, "date": "2020-03-04", "url": "http://townhall.com/columnists/anncoulter/2020/03/04/bernie-is-still-trumps-nightmare-n2563214", "content": "Bernie Is Still Trump's Nightmare Share The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com. Source: AP Photo/Charles Krupa The Democrats' sudden discovery of 77-year-old éminence grise Joe Biden has the electric feeling of Republicans settling on George H.W. Bush in 1992. (The Iowa Republican Party actually canceled the caucuses that year so as not to embarrass President <mark>Bush</mark>.) It's Democrats convincing themselves in 2004 that <mark>John Kerry</mark> was the \"safe\" choice. Proposed Biden campaign slogan: OK, I Guess He'll Do. This is good news for Trump. Bernie Sanders is his greatest nightmare. True, the media, the donors and the Democratic Party are convinced that Sanders is a sure loser--just as, four years ago, Fox News, the donors and the Republican Party knew that Trump was a sure loser. What made both Trump and Sanders unique in their respective primaries was their voluble opposition to Wall Street, war and immigration. I'm beginning to suspect that Americans hate Wall Street, hate war and hate mass, low-wage immigration. I take no position on these preferences. I am simply stating facts. Recall that, in 2016, Trump and Sanders were the only presidential candidates opposed to the mass importation of low-wage workers immiserating our working class. Sadly, they both moved left on the issue at about the same time: Bernie when he went from being a Socialist to a Democrat, and Trump when he went from the campaign to the White House. On war, Sanders is certainly consistent. Good war, bad war, necessary war, stupid war--he's against 'em all! As he recently tweeted about Trump's assassination of Iranian Maj. Gen. Qassem Soleimani, raising the prospect of war with Iran: \"I was right about Vietnam. I was right about Iraq. I will do everything in my power to prevent a war with Iran. I apologize to no one .\" At this moment in time, 20 years into a war without end in Afghanistan--unless Trump really does end it in the fourth year of his presidency--with foreign policy experts constantly demanding military intervention against some faraway tribe, Sanders' anti-war sentiments are a balm to the country's weary soul. Four years ago, Bernie probably beat Hillary Clinton--minus the finagling of the Democratic National Committee--by slogging her for her Iraq War vote. Also, four years ago, Trump destroyed Jeb! <mark>Bush</mark> during a debate in the most pro-military state in the union, South Carolina, by calling the Iraq War a \"big, fat mistake\" and saying Jeb!'s brother had \"lied\" us into it. The media heralded this as another Trump gaffe, \"his riskiest departure from the party line,\" as Fortune magazine put it. A week later, Trump swept the South Carolina primary, walking away with all 50 delegates. Trump bragged so much about his opposition to the Iraq War that media \"fact-checkers\" worked overtime to prove that he was an Iraq War supporter. I think they were wrong and Trump was right, but the point is: Both Trump (the candidate) and the media knew that the anti-war position was wildly popular with voters. Then Trump became president, and the only people working overtime on his war stance became his own voters, constantly on edge that he's about to start a war with Syria or Iran. Sanders has also shown remarkable consistency in his contempt for Wall Street. (There's a reason poor Mike Bloomberg was running .) To great acclaim, Sanders says things like, \"The billionaire class is scared and they should be scared .\" He vows to break up banks and impose a wealth tax. \"We're prepared to be their worst nightmare,\" he says. Similarly, back when he was running, Trump alone among Republicans kept harping about the absurd carried interest tax break that allows hedge fund managers (and private equity and venture capital managers) to pay a tax rate of 20 percent on their income, rather than the 39.6 percent the rest of us pay. Trump complained endlessly about the loophole, saying, \"the hedge fund guys are getting away with murder .\" He said some of these people \"are making a tremendous amount of money and paying virtually no tax, and I think it's unfair .\" Clueless as ever, a shocked New York Times reported: \"Defying Republican political gravity, after his heresy of proposing a tax increase, Mr. Trump's popularity among Republicans rose .\" The sad ending to this story is that then Trump became president and hired half of Goldman Sachs. More Goldman Sachs employees work in the Trump administration than worked for Presidents Obama and <mark>Bush</mark> combined. <mark>Gary Cohn</mark>, one of these patriotic, salt-of-the-earth Goldman guys, told Trump not to eliminate the carried interest loophole, so he didn't. And Warren Buffett continues to pay a lower tax rate than his secretary. Maybe a Fidel-admiring revolutionary was never the best champion of even the most popular ideas--just as a vulgar reality TV star wasn't. Maybe Bernie is dead. But the universal popularity of hating Wall Street, war and immigration will never die. It could be that a \"safe\" choice is all the Democrats need. But I think Trump just dodged a bullet."}, {"articleID": "2013040316_00040210_W", "names": {"Ray Wilkins": ["Q352820", "Q55586927"]}, "date": "2013-04-03", "url": "http://thesun.co.uk/sol/homepage/sport/football/4871917/Chelsea-manager-Rafa-Benitez-Ray-Wilkins-is-an-April-fool.html?OTC-RSS&ATTR=Football", "content": "<mark>wilkins</mark> is an april fool rafa hits out over cole comment rafa benitez has dismissed former chelsea assistant manager <mark>ray wilkins</mark> as an april fool. <mark>wilkins</mark> claimed on monday that blues left-back ashley cole suffered a hamstring injury against manchester united on monday due to not playing against southampton on the weekend. speaking about the england left-back, <mark>wilkins</mark> said: \"he is one of these machines. you have to keep it well oiled and it will fly .\" had he played on saturday, he wouldn't have done that yesterday. \"but spanish tactician benitez has today dismissed the assessment, saying:\" april 1. you cannot take the comment seriously. it was april 1. rafa benitez: <mark>ray wilkins</mark> comment an april fool football chelsea boss insists club's former no2 is not right in saying ashley cole has played too many games interim manager benitez hopes to be employed by a leading club next season but first plans to satisfy his thirst for silverware at stamford bridge. the blues advanced to the fa cup semi-finals and play rubin kazan in the first leg of their europa league quarter-final tomorrow - their third of six games in 16 days. benitez's appointment in november until the end of the season was prompted by the champions league winners' group-stage elimination from the same tournament. and a top-four premier league place is imperative to return to the competition next term. the spaniard, an unpopular appointment, declined to look too far beyond winning the next game. he added: \"if we can achieve trophies and finish in the top three, fantastic .\" everybody will be happy. that is my aim at the moment. \"? news group newspapers limited registered in england no. 679215 registered office: 3 thomas more square, london e98 1xy .\" the sun \",\" sun \",\" sun online \"are registered trademarks or trade names of news group newspapers limited. this service is provided on news group newspapers' privacy & cookie policy. to inquire about a licence to reproduce material, visit our syndication site. view our online press pack. for other inquiries, contact us. to see all content on the sun, please use the site map. the sun website is regulated by the"}, {"articleID": "2016042522_00467694_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2016-04-25", "url": "http://azfamily.com/story/31766945/young-woman-adopts-six-children", "content": "Young woman adopts six children - azfamily.com 3TV | Phoenix Breaking News, Weather, Sport Young woman adopts six children - azfamily.com 3TV | Phoenix Breaking News, Weather, Sport Member Center: Young woman adopts six children Posted: Updated: A single woman adopted six sisters from foster care. (Source: KFSN/CNN) FRESNO, CA (KFSN/CNN) - Selfless love is being demonstrated by a young, single California woman raising six sisters she adopted from foster care. Five years ago, Lacey Dunkin was single, in her mid-20s, and far from having children of her own. \"You don't set out to have six little girls,\" she said. \"I'm glad that it happened. I'm so blessed .\" Dunkin always knew she wanted to be a mom, and she set out to be certified as a foster parent in 2011. Late one night in September, she got the call to take on four little girls ages 1 to 5. \"And I said yes,\" she said, \"like before she could finish talking .\" In the next few years, her family would grow but also endure separation. The girls' biological mother had another baby, and all the kids went back. A month later, Dunkin regained custody. Then in 2013 the birth mother had a sixth child. The future become uncertain again. \"Their first reaction was like...but not us,\" Dunkin said. \"This is home. We can't go anywhere, right. I didn't even realize that was so important to them .\" Dunkin put those worries to rest by adopting all six girls. \"I just really wish people didn't think that they were bad,\" Dunkin said. \"It's not their fault that they are in the system .\" Foster kids may come into a family looking for love, but Dunkin says they give much more than she thought she could receive. \"You're able to love them because they love you, and your heart just grows more and more,\" she said. Dunkin and the girls live with her parents. Dunkin said that without the support of her support, none of this could have been possible. Copyright 2016 KFSN via CNN. All rights reserved. Raycom reportsRaycom reportsMore>> Updated: Monday, April 25 2016 5:58 PM EDT2016-04-25 21:58:46 GMT Apple CEO <mark>Tim Cook</mark> predicted in January that iPhone sales would fall for the first time since the smartphone debuted nearly a decade ago. But iPad sales are also predicted to shrink while demand for Macs remained unchanged. Updated: Monday, April 25 2016 5:31 PM EDT2016-04-25 21:31:46 GMT A new study finds bedbugs are attracted to certain colors more than others. It turns out the insects really dig dark red and black, and are less into dazzling white and bright yellow. Updated: Monday, April 25 2016 5:29 PM EDT2016-04-25 21:29:14 GMT In the past five years, the DEA has destroyed more than 5.5 million pounds of unused prescription drugs. Updated: Monday, April 25 2016 5:17 PM EDT2016-04-25 21:17:41 GMT North Korean officials say they would only consider stopping their missile program if the U.S. stops its annual war games with South Korea. The United Nations has placed additional economic sanctions on North Korea following a series of arms tests. More tests are suspected."}, {"articleID": "2010083006_00405632_W", "names": {"Chris Johnson": ["Q1077381", "Q1077389", "Q14849826", "Q22296293", "Q24006944", "Q2455991", "Q28203608", "Q2964750", "Q3662449", "Q47077990", "Q47847286", "Q4957157", "Q5107017", "Q5107019", "Q5107020", "Q5107021", "Q5107022", "Q5107024", "Q58149026", "Q766879"], "Michael Roos": ["Q16224845", "Q27530847", "Q3856253"], "Derrick Morgan": ["Q1936730", "Q3705892"], "Jeff Fisher": ["Q1757363", "Q18585355", "Q3176484"], "Tony Brown": ["Q1178830", "Q1378254", "Q16229847", "Q17279916", "Q2412286", "Q27927614", "Q3531701", "Q3993203", "Q53709768", "Q7821961", "Q7821962", "Q7821964", "Q7821965", "Q7821967", "Q7821968", "Q7821969", "Q7821970", "Q971106"], "Lance Armstrong": ["Q2172", "Q6483312"]}, "date": "2010-08-29", "url": "http://channel3000.com/news/24805673/detail.html", "content": "titans focus on defense's play in carolina loss teresa m. walker, ap sports writer posted: 5:01 pm cdt august 29, 2010 nashville, tenn.--vince young was sacked four times in two quarters, all pro <mark>chris johnson</mark> found himself stymied and left tackle <mark>michael roos</mark> banged his right knee in an ugly preseason loss. at least the tennessee titans can console themselves with how well the defense played. a unit so woeful in 2009 giving up an average of 25.1 points per game was the only bright spot in the titans' 15-7 loss at carolina on saturday night. top draft pick <mark>derrick morgan</mark> finally made his nfl debut, and the titans kept a carolina squad looking for its first touchdown this preseason out of the end zone despite the panthers' first team playing three quarters. \"defensively, we kept things basic and played hard and played well,\" coach <mark>jeff fisher</mark> said sunday. \"we tackled well, we rushed well, we covered well, so i thought we had a pretty good day defensively against an offense that was trying to score points .\" the titans (1-2) were playing their second game in six days, not counting a joint practice with arizona midweek. they also played without starting tackle <mark>tony brown</mark>, who remains on the physically unable to perform list, or cornerback cortland finnegan, who has missed the first three preseason games because of a strained groin. tennessee limited carolina to 241 yards through three quarters and 51 yards rushing. deangelo williams had a meager 13 yards on nine carries. carolina had to settle for two field goals, the last in the opening seconds of the fourth quarter with the titans already having subbed into their third-team defensive players. <mark>morgan</mark> was the highlight, playing 15 snaps after having missed all but the final day of training camp because of a strained calf. the 16th pick out of georgia tech strung together four straight plays in which he barely missed his first sack, enough in his debut to excite defensive line coach jim washburn. \"needless to say, he was quite impressive with his first four considering the fact that this was the first time he had full pads on since last january against iowa,\" <mark>fisher</mark> said. \"i thought his first outing was pretty impressive, if you take into consideration he is rushing against a starting nfl tackle as well .\" <mark>morgan</mark> got out on the field during the titans' opening defensive series, and <mark>fisher</mark> said they saw the strength, power and good hands that convinced the team to draft him. \"he had two hits on the quarterback and had an assist and a tackle for loss in the first four plays and was equally as effective in the other 11,\" <mark>fisher</mark> said. the titans also have yet to decide who starts opposite finnegan. jason mccourty and rookie alterraun verner are in a tight battle, and <mark>fisher</mark> isn't giving any hints. \"nothing says i can't play them both in the regular season,\" the coach said. <mark>fisher</mark> expects <mark>brown</mark> back this thursday night when the titans host the defending super bowl champion new orleans saints (2-1) to wrap up the preseason. it's another short week with little time to work on an offense that looked very inept in carolina. tennessee managed only 50 yards in the first half on 25 plays. <mark>johnson</mark> ran eight times for only 10 yards. young was 6 of 9 for 48 yards. but the titans got only four first downs, just as many times as the panthers sacked young, as they went through their first preseason game without scoring at least one touchdown. young, sacked all of nine times in his 12 appearances in 2009, already has been sacked five times this preseason. the panthers took him down four times saturday night, keeping offensive line coach mike munchak busy on the sideline reacting to fronts they hadn't practiced against. <mark>fisher</mark> insisted he wasn't concerned about his offense, especially not after seeing all the panthers did defensively on tape. \"we kept things basic and simple, and we just wanted to let players play. we didn't scheme or come into the game with much of a game plan,\" he said. notes: <mark>fisher</mark> said <mark>roos</mark> will not need any examinations on his knee. he has started 80 straight games in the regular season, third among all tackles ....rookie damian williams dislocated his right shoulder when he was hit and fumbled on a punt return. but he returned and played wide receiver in the second half. the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed. photos of \"ride the drive' with <mark>lance armstrong</mark> see images from two separate madison bomb scares"}, {"articleID": "2016052919_00182141_W", "names": {"Corey Parker": ["Q2997266", "Q5170422"], "Josh Mcguire": ["Q3810347", "Q6289170"], "Matt Scott": ["Q17017894", "Q6789302", "Q6789303", "Q6789304"], "Michael Morgan": ["Q105866", "Q29034109", "Q29643298", "Q3305171", "Q37668416", "Q3856229", "Q42889395", "Q43003052", "Q55362615", "Q57819952", "Q59196728", "Q6832903", "Q6832905", "Q6832906"], "Ben Hunt": ["Q2895471", "Q4885884", "Q4885885"], "Aaron Woods": ["Q17403280", "Q4662556"], "Wayne Bennett": ["Q21463799", "Q3566816", "Q7975989"]}, "date": "2016-05-30", "url": "http://feeds.theroar.com.au/~r/theroar/~3/aK_xteycYKk/", "content": "Why State of Origin is great for the premiership competition The Tigers defeated the Origin-affected Broncos. (AAP Image/Action Photographics, Colin Whelan) Related coverage 2016 NRL ladder news Both the Broncos versus Tigers and Dragons versus Cowboys clashes reminded us on the weekend of the invaluable influence that Origin has on the premiership competition. On Friday night we witnessed a courageous Wests outfit clinch victory over a depleted Brisbane side lacking the outs of six Origin stars. Darius Boyd, Corey Oates, Sam Thaiday, Matt Gillett, <mark>Corey Parker</mark> and <mark>Josh McGuire</mark> were all missed in the Broncos' 18-19 loss. It was their forward pack that took the biggest battering, losing the metres gained battle 1398 to 1714 after having dominated in this area in their crushing 26-0 win over the Red V in Round 6. On the following night we saw a dogged St George side beat North Queensland 14-10. The visitors were without Origin superstars Johnathan Thurston, <mark>Matt Scott</mark>, <mark>Michael Morgan</mark> and James Tamou and subsequently recorded their lowest score for the year to indicate a lack of firepower in attack. At Lang Park it was a tale of Brisbane vying for its ninth win for the season hosting a side looking for just win number five and a club that not long ago had been thrashed 60-6 at the hands of the Raiders. South of the Tweed River, we then saw a side looking for its sixth win play host to a Cowboys outfit shooting for win number nine on the march to defend a premiership. The fact that in both games the competition underdogs came up trumps shows that Origin is great for the premiership competition as it serves to level-out team line-ups during the Origin period. Despite the salary cap, there is a clear discrepancy in talent across club rosters in the NRL. Brisbane, North Queensland and the Roosters all boast both a richness and depth of talent more impressive than all other clubs and head and shoulders above the rosters of Newcastle, Gold Coast and St George. The fact that six Brisbane players will run out for the opening Origin clash this Wednesday night, a number no other club equals, is a striking indication of the Broncos' unmatched squad. As equally as telling is that eight Brisbane stars were named for the Anzac Test early in May, likewise more than any other club. Playmakers <mark>Ben Hunt</mark> and Anthony Milford are also dominating the competition, the halfback leading in try assists and Milford a joint-first for leading try-scorer. Oates is also a top-five try-scorer and is running third in total line-breaks, while <mark>Parker</mark> is in the top five for total hit-ups. Although Wests are blessed with arguably the league's most promising crop of young, upcoming talent given the likes of fullback James Tedesco, halves Mitchell Moses and Luke Brooks, prop <mark>Aaron Woods</mark> and a wealth of exciting outside backs, it's a squad at this stage well behind that of <mark>Wayne Bennett</mark>'s boys and other clubs. If it wasn't for the competition-leveller that the Origin period is, the Tigers would have returned home winless on Friday night and we would have witnessed a thumping win to JT and clan at WIN Stadium on Saturday. <mark>Bennett</mark> has for a long time strongly opposed Origin in its current format and again didn't hold back in a recent press conference in the build-up to the series. \"If you look at the record books with the Broncos, nearly every season that I've coached here, we are somewhere where we are now and look at where we finish after Origin. We're all over the shop,\" <mark>Bennett</mark> said. The super-coach criticised the interstate rivalry despite admitting to his side being blessed with the best players in the competition. \"During the Origin period, we have to play Melbourne and be in Sydney and Auckland,\" he said. \"We are talking about the best players in the game, the best players in our team, not the second and third best players, our best players .\" The toll that Origin has on star-studded line-ups such as Brisbane's is huge, but it's exactly that which makes the three-game series great for the premiership competition. If the salary cap doesn't do a sufficient job of leveling the playing field, something else needs to stand up. Origin does when it starts to reel in the competition's high-flyers come the end of May every year. Cheer, cheer the underdogs."}, {"articleID": "2010010804_00077911_W", "names": {"Michael Taylor": ["Q14950779", "Q15052960", "Q15145477", "Q17161464", "Q21459132", "Q21779153", "Q24007341", "Q26742210", "Q3068404", "Q38917715", "Q43138659", "Q51817126", "Q56381133", "Q58417848", "Q58716780", "Q6125086", "Q6834808", "Q6834809", "Q6834811", "Q6834813", "Q6834814", "Q6834815", "Q6834816", "Q6834818", "Q6834819", "Q6834820"]}, "date": "2010-01-08", "url": "http://timesreporter.com/homepage/x1377001113/Snowstorm-blankets-Tuscarawas-Valley", "content": "as tuscarawas valley residents continue digging out from under thursday's new snow, they might as well prepare today for yet another 2 to 4 inches. the winter weather advisory issued wednesday by the national weather service at pittsburgh in anticipation of thursday's snowstorm remains in effect until saturday at 6 a.m. that means that periods of snow throughout today and tonight will cause travel difficulties. although classes in most districts were canceled today - eliminating bus and most other school-related traffic - the nws urged motorists to use caution while driving and to be prepared for snow-covered roads and limited visibility. area road conditions began turning snow-covered and slippery thursday afternoon, but road crews were out in full force and only a few non-injury traffic crashes were reported. motorists traveling to dover on s. wooster ave. encountered some noticeable traffic backup and slow driving conditions thursday afternoon, and while weather may have been a factor, the actual cause remains unknown. rick young, dover's general services superintendent, said the backup lasted about two hours, and he believes it was because of unusually heavy northbound traffic from new philadelphia. young surmised that many motorists who normally use the hilly 7 mile dr. (rt. 416) from new philadelphia to rt. 800 might have driven through dover because they believed it would be the safer route. police noted that s. wooster ave. typically during the morning and afternoon rush periods has been carrying an overwhelming amount of traffic since the s. tuscarawas ave. bridge was closed in october. the bridge was removed and is to be replaced by a new bridge within about a year, with traffic diverted to s. wooster ave. during that time. only one crash related to weather conditions was reported in dover. it occurred thursday at 4:55 p.m. when a motorist was driving too fast for road conditions, and her car slid through the s. tuscarawas ave. at harger st. intersection. the car went left of center, crossed the northbound lane into the curb strip and hit a guy wire and a cement barrier. the driver was not injured, and no citations were issued. young said his road crews were out from the time the snowfall began at about 2 until about 10 p.m. he said the crews would return to duty today at 4 a.m. and continue treating the streets as necessary. police in new philadelphia said there were no road related problems because of thursday's weather, and that the snow parking ban for major thoroughfares had not been implemented. mayor <mark>michael taylor</mark> said the snow parking ban wasn't implemented thursday because street crews were able to keep up with snow and ice removal efforts during the storm. \"when they first got out with salt and the plows, the driving lanes went to wet and stayed there,\" he added. the mayor, who is responsible to implement the ban, said thursday night he couldn't predict whether it will be implemented today. \"it's a tool we will try to use if necessary,\" he said. fred neff, new philadelphia's general services superintendent, said the city's salt trucks and snowplows were sent out thursday at about 3 p.m., and some would be out around the clock. however, the city would reduce the number of trucks out from midnight to 5 a.m. then resume its full complement of trucks and drivers in time for the morning commute. neff said thursday's crews hadn't encountered any problems and noted that the city's salt supplies still were adequate. but he said he intends to order more salt today, as \"it looks like this is going to be a winter where we're going to need a bunch .\" tuscarawas county engineer joe bachman said that county salt crews would run their full 17 routes until 7 or 8 p.m. thursday night then the department would reduce its manpower to about four skeleton crews to cover the county through the night until today at 4 a.m. when all crews would return to duty."}, {"articleID": "2019022511_00330611_W", "names": {"Richard Wagner": ["Q3431309", "Q42306860", "Q62559"], "Stan Lee": ["Q16194157", "Q181900", "Q7597756"]}, "date": "2019-02-25", "url": "http://verilymag.com/2019/02/northern-spirit-winter-survival", "content": "Enjoy the special wonder that winter can inspire It lifts existence on a plane of snow One level higher than the earth below...~ Robert Frost, \"A Winter Eden\" Many winters ago, when I was perhaps seven or eight, my parents and I traveled to St. Paul, MN in early November to celebrate the traditional German holiday of St. Martinstag, or the Feast of St. Martin. Along with dozens of other families, we made lanterns out of paper and walked with them under the stars up to the steps of a cathedral, where the legend of Saint Martin was reenacted. As the story goes, Martin, a Roman soldier, came across a poor beggar freezing with cold during a snowstorm. Moved to compassion, Martin took his own cloak and sliced it in half with his sword to share with the poor man. ADVERTISEMENT Thanks for watching! Visit Website As we watched the story unfold and held our lanterns, the sky beyond the church began to glow and flicker with faint colors. I had never seen the Aurora Borealis before, and it enchanted me. That moment--the lanterns, the stars, the beautiful story, and the Northern Lights--is perhaps the first time I ever felt the special wonder that winter can inspire. I felt it again when I was an exchange student in Austria many years ago. My host family and I were staying in their grandparents' cabin in the Alpine foothills. As we all got ready for bed after watching a beautiful fantasy movie, I stepped outside for a breath of fresh air and was transfixed by the vista in front of me: silver stars in the blue heavens, sparkling over the snowy mountains around me. The beauty of the view, combined with the magic and adventure of the story we had just seen, created an unforgettable moment. In that moment, I wasn't thinking of the ice I had to skid over on my way to school, or the draft from my window, or any of winter's other inconveniences. That pristine, starry moment has stayed with me for years. ADVERTISEMENT Thanks for watching! Visit Website ADVERTISEMENT Thanks for watching! Visit Website Moments like these helped me to realize the key to making winter more than just a series of bland, house-bound days is connecting the wonderful with the mundane. It is all too easy to get caught up in the wearisome, everyday aspects of winter. Scraping ice off the car in the frigid pre-dawn darkness, tracking dirty snow in the house, and fender-benders at icy intersections (with accompanying dents and scratches) often dominate our impressions of this season. But, as I learned on those nights in St. Paul and the Alps and on many winter days since, the wonder, mythology, and lore of winter is rich, vibrant, and uniquely powerful. If we immerse ourselves and our imaginations in it, then the winter we face outside our doors will assume some of that enchantment. Especially during the post-Christmas winter months when there seems to be no lively holiday or novel excitement to look forward to, we can bring our imaginations to bear on the cold outside our doors to transform our experience. Elevating our imaginations and connecting the wondrous and magical world we can imagine to the world that we see around us can be a powerful way to stave off the winter doldrums. When we're looking for wonder in winter, it makes sense to turn to the original experts at Northern imagination: the Scandinavians. Although known today mostly for their hygge lifestyles, thoughtful aesthetic, and amazing interior design, the Nordic countries have a rich history and mythology going back centuries. That mythology has influenced countless thinkers and writers: J. R. R. Tolkien, <mark>Richard Wagner</mark>, <mark>Stan Lee</mark>, Neil Gaiman, and Edith Pattou have all been inspired to create beautiful and immensely popular work based on these stories. To add some childlike wonder to these cold months, go back to the source and look up some Norse legends about the great gods and heroes of old. My childhood (and perennial) favorite book of these stories is D’Aulaires Book of Norse Myths, a richly illustrated compendium of the classic Norse mythology. Light a candle, snack on some krumkaker, and let the stories of magic, war, tragedy, and romance evoke wonder in your mind. From here, it's natural to branch out to books like Tolkien's Lord of the Rings and Neil Gaiman's American Gods. If you're looking for an intense cure for the winter doldrums, challenge yourself and some friends to make it all the way through <mark>Wagner</mark>'s epic Ring Cycle, a series of four operas chronicling a multi-generational struggle between gods and mortals for ultimate power, inspired by German and Norse sagas. And the Norse gods and warriors aren't the only inspiration for a healthy winter imagination. My favorite fairy tale is \"East of the Sun, West of the Moon\" (retold by Edith Pattou in her novel East), in which a young woman goes on an epic quest to save her love from a dark fate in the Arctic lands. Then there are the beautiful stories of St. Lucia and Good King Wenceslas, remembered in songs, and Jack London's books, such as White Fang or The Call of the Wild, great for evoking the wildness and freedom of the American north. Poetry is especially welcome at this time of year--the quiet joy of Robert Frost's \"A Winter Eden\" or the awakening anticipation of Hilaire Belloc's \"February\" have helped me see the world around me in new ways. Sharing the winter experience with other people can also help cultivate the imagination needed to relish the short days and long nights of winter. One of my most precious memories is spending a week in remote northern Manitoba with my family and some friends in the deep winter in a cabin with no heat, electricity, or plumbing. Although that may sound cold and remote, we were actually in constant contact with fire. Cooking, bathing, heating our rooms, and illuminating our evenings all required building fires and maintaining them constantly. This kept us all busy, and when we weren't building fires, we were gathered around them, reading, drawing, telling stories, or playing fierce games of Canasta. The nights we spent next to the frozen lake were illuminated by the stars and Aurora Borealis, unpolluted by any artificial light, and the sobering thrill of finding actual wolf tracks near our cabin still haunts me. Ever since, when I feel low because of the oppressive darkness of early sunset, I light a fire, even if it's just a candle or a match. That small act reminds me not only of the fun adventures I had with my friends in Canada, but also of all I share with every person who has endured winter before me. Human beings have long gathered around fire to seek light and warmth during the winter. If we strengthen and elevate our imaginations to embrace the winter season, then the legends, songs, and natural wonders around us will help us find bright joy in even the darkest winter nights. Tags terms: Winter Winter Survival Guide books By Margaret Handel"}, {"articleID": "2018112203_00293038_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2018-11-22", "url": "http://www.bigcountryhomepage.com/news/national/authorities-probe-mansion-fire-that-killed-4-family-members/1611030145", "content": "Posted: Nov 21, 2018 09:39 PM CST Updated: Nov 21, 2018 09:39 PM CST COLTS NECK, N.J. (AP) - A family of four whose remains were found at the burned-down ruins of their New Jersey mansion was slain before the home was set ablaze, authorities said Wednesday, hours after the mansion owner's brother was arrested on suspicion of arson at his own house. Prosecutors sought to reassure the public that a random killer was not on the loose in the affluent community of Colts Neck, which is also home to some celebrities. \"We believe that this family in some form or fashion was targeted,\" Monmouth County Prosecutor Christopher Gramiccioni said. Paul Caneiro, 51, was charged with setting fire to his home Tuesday in Ocean Township. Less than eight hours later, the fire that destroyed his brother's home was reported about 80 miles (129 kilometers) away in Colts Neck, authorities said. Gramiccioni said he could neither confirm nor deny that Paul Caniero was a suspect in the slayings. At the mansion, Keith Caniero, 50, was found shot to death on the lawn. Inside, authorities found the remains of his 45-year-old wife, Jennifer Caniero, and their children, 11-year-old son Jesse and 8-year-old daughter Sophia. The bodies of the mother and children were badly burned. Medical examiners had not determined causes of death for them as of Wednesday afternoon. It was not immediately known if Paul Caniero had retained an attorney. He was charged with aggravated arson and was scheduled to make a first appearance in court next Wednesday. Paul Caneiro was accused of using gasoline to set his home on fire while his wife and two daughters were inside. No one was hurt in that blaze, which was reported at 5 a.m. Tuesday, about 7 1/2 hours before the Colts Neck fire was reported. Keith and Paul Caneiro were partners at a technology firm in Asbury Park called Square One. All four members of Keith Caniero's family were \"victims of homicidal violence,\" the prosecutor said, adding that there was no indication of suicide. The community held a vigil for the family Wednesday night. Colts Neck Mayor J.P. Bartolomeo said the Caneiros were well known in town and often seen at local shops or school sporting events. Colts Neck, about 50 miles (80 kilometers) south of New York City, is home to a number of celebrities, including Bruce Springsteen. Former \"Daily Show\" host <mark>Jon Stewart</mark> and his wife operate an animal sanctuary there. Queen Latifah sold her mansion there in 2015. Current and former members of the band Bon Jovi have also called it home. ___ Follow Wayne Parry at http: //twitter.com/WayneParryAC Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. More Stories CHICO, Calif. (AP) - Amy Sheppard packs her belongings into a plastic...21 hours ago LOS ANGELES (AP) - Ray Chavez, the oldest U.S. military survivor of...2 hours ago SEATTLE (AP) - John Allen Chau spent summers alone in a California...4 hours ago"}, {"articleID": "2009101618_00004703_W", "names": {"David Lewis": ["Q143572", "Q16105402", "Q18542401", "Q20127389", "Q21518777", "Q4647694", "Q50350768", "Q51879835", "Q5232028", "Q5232030", "Q5235461", "Q5236553", "Q5236555", "Q5236558", "Q5236559", "Q5236560", "Q5236562", "Q5236564", "Q5236565", "Q5236570", "Q5236571", "Q5238831", "Q56550389", "Q56596965"]}, "date": "2009-10-16", "url": "http://morningstaronline.co.uk/index.php/britain/Under-threat-900-jobs-may-go-at-car-plant", "content": "there comes a point in difficult relationships where, if they are to survive at all, the partners in that relationship have to cease evasions and prevarications and tell each other the plain, unvarnished truth. dahr jamail how half-truths and glorification of the inglorious are used to justify us \"full-spectrum dominance' today jeremy corbyn how public assets are to go for an old song up to 900 jobs could be lost if the struggling bosch car parts factory near cardiff closes, unions warned on friday. a 90-day consultation is under way at the plant in miskin which makes alternators for the motor industry. the company is considering two options: shedding about 300 jobs next year and carrying on with a smaller operation; or closing the plant in 2011 if no commercially viable new business is found. the plant has been in operation for 20 years and has made more than 500 job cuts since announcing redundancies needed to be made in september 2008. unite union regional officer <mark>david lewis</mark> said the union was\" disappointed but not shocked \"by the announcement, and needed to explore in greater detail the possibility of the company continuing operations with\" new additional business. \"\"it's difficult to assess what the announcement means fully. we have a highly skilled workforce at the plant and we don't want to lose them or bosch,\" he said. \"we have 90 days' consultancy and our job is to see what we can do to mitigate for our members. there will be redundancies, but we must try and cushion it as best we can in terms of the redundancy package .\" mr <mark>lewis</mark> said he would meet with unite members at some point over the weekend and the first of the consultation meetings would be next tuesday. plaid cymru am leanne wood said it was devastating news for llantrisant and the surrounding valley areas, which have seen hundreds of job losses in the last year."}]