[{"date": "2015-12-30", "url": "http://queenstribune.com/a-lifetime-of-public-service-from-a-young-age-katz-heard-the-call-to-serve/#comments", "content": "By Domenick Rafter Editor in Chief Melinda Katz was first elected to office in a special election in 1994 at the age of 28. Running on the Liberal Party line, she defeated both a Democrat and a Republican to be elected to the State Assembly representing a district centered in her native Forest Hills that also included Rego Park and parts of Glendale and Middle Village. She won the Assembly seat vacated by Alan Hevesi, who had been elected City Comptroller several months earlier. In the Assembly, Katz--as the youngest woman in the body at the time--had a special focus on women's issues, authorizing legislation that required HMOs to provide gynecological care to women without forcing them to see a primary care physician first--a law that later went national. Katz sat in the Democratic caucus and was reelected in November 1994 to a full term and again in 1996. But she gave up her seat in 1998 to run for higher office. She set her eyes on Congress, seeking the sprawling Brooklyn and Queens seat vacated by Chuck Schumer for his successful run for Senate. Then-Assemblywoman Melinda Katz with then-First Lady Hillary Clinton. In a district that included heavily Jewish neighborhoods of Brooklyn, such as Brighton Beach, Midwood, Sheepshead Bay and Mill Basin, as well as the Rockaways, Howard Beach, Woodhaven, Middle Village, Corona and Forest Hills in Queens, Katz was one of four Democrats who faced off for the nomination in the very Democratic district. She was the only candidate from Queens and the only woman. Though her three Brooklyn opponents did split the vote, Katz fell less than 500 votes short of then-Councilman Anthony Weiner, a protégé of Schumer's. Katz remained on the Liberal Party's line in November of that year, but only garnered just over five percent of the vote. After her defeat, Katz went to work for Borough President Clare Shulman in Borough Hall as director of community boards. In addition, she assisted the Borough President in proposing sites for city facilities and creating a strategic plan for the economic development of Queens. \"I took a lot from her administration,\" Katz said. \"It was my first view of city government and my first view of an executive, and someone who can call all the players to the table, and I took that from her .\" In 2001, Katz sought elected office again, running for the City Council seat vacated by Karen Koslowitz, again based in Forest Hills, but also including Kew Gardens, Rego Park and parts of Elmhurst, Maspeth and Richmond Hill. She won the primary and general election handily and served eight years in City Hall. In the Council, Katz chaired the powerful Land Use Committee, where she was the council's point person in many of the Bloomberg-era zoning proposals, including Hudson Yards on the West Side of Manhattan and numerous neighborhood rezoning plans in Queens including Forest Hills, Rego Park, Middle Village, Glendale, Woodhaven, Richmond Hill and Cambria Heights. Term limited in 2009, Katz decided to seek citywide office, running for City Comptroller in a four-way Democratic primary that included two other candidates from Queens; her Council colleagues <mark>John Liu</mark> and David Weprin. Though she won her own former Assembly district--as well as one in Staten Island--and finished second in Queens, she failed to make the runoff, which was eventually won by <mark>Liu</mark>. Katz getting sworn in for her first elected office, State Assembly, in 1994. Katz then went back to private practice, as a lawyer, for several years, but opted to make a second political comeback in 2013, running for Queens Borough President. Facing a crowded Democratic primary that dwindled to three candidates, Katz won a 44 percent plurality and went on to defeat her Republican opponents with 80 percent of toe vote to be elected Queens' 19th borough president, and third consecutive woman. As far as her political future, Katz isn't ruling anything out. Political pundits and historians will be quick to point out the borough presidency has not necessarily been a road to higher officer for others. Of the 90 people who have served at the helm of the five boroughs since 1898, only four: Manhattanites <mark>Robert Wagner</mark>, David Dinkins, Scott Stringer and Bronx's Robert Abrams have won election to citywide or statewide office. Nevertheless, at age 50, Katz is still young and has a resume that has led to her name being thrown around for various higher positions, including mayor and governor. But for now, Katz said she's content in her current job, where she would be term limited in 2021 providing she runs and wins a second term in 2017.", "articleID": "2015123016_00411490_W", "names": {"Robert Wagner": ["Q18710901", "Q2920078", "Q310493", "Q37382596", "Q4102226", "Q43139753", "Q471707", "Q48688879", "Q57119081", "Q698868"]}}, {"date": "2016-02-13", "url": "http://buffalonews.com/city-region/town-of-tonawanda/town-of-tonawanda-to-receive-160000-in-federal-funding-20160212", "content": "Tweet ADVERTISEMENT WASHINGTON--The Town of Tonawanda has won a $160,000 federal grant to come up with a plan to deal with the pending closure of the Huntley Generating Station. The Economic Development Administration grant will allow the town, in conjunction with the University at Buffalo's Regional Institute, to develop a long-term plan to address what should be done with the facility, and what should be done to cope with the loss of tax revenue from the plant. Sen. Charles E. Schumer, D-N.Y., and Rep. <mark>Brian Higgins</mark>, D-Buffalo, announced the grant. \"What Tonawanda needs now is a comprehensive economic plan to determine its future--and this significant federal Economic Development Agency investment will allow the town to do just that,\" Schumer said. NRG Energy, which owns the out-of-date and pollution-producing coal-fired power plant, has announced plans to begin laying off its 75 employees in March, but <mark>Higgins</mark> said that's just part of the impact of the closing. \"The loss of Huntley Plant tax revenue is leaving a huge hole in the Town of Tonawanda and Ken-Ton school budgets, raising serious concerns about the ability to maintain a level of service that residents, parents, teachers and students deserve,\" said <mark>Higgins</mark>. \"This federal funding will help to develop creative strategies that can help minimize the impact of this loss .\" ", "articleID": "2016021301_00084063_W", "names": {"Brian Higgins": ["Q4964039", "Q4964044", "Q505581"]}}, {"date": "2016-02-16", "url": "http://kcci.com/politics/ted-cruz-picks-up-another-freedom-caucus-endorsement/38029282", "content": "Text Size: ASmall Text AMedium Text ALarge Text Another member of the conservative House Freedom Caucus endorsed Ted Cruz on Tuesday, as he continues to hold support from the group known for giving Republican leadership headaches. Other Stories Obama takes on <mark>Donald Trump</mark> Obama: SCOTUS nominee will be...GOP candidates at war in SC Cruz aims to put <mark>Trump</mark> on defensive...<mark>Trump</mark> keeps hitting Cruz over Coburn Kansas Rep. Tim Huelskamp endorsed Cruz on Tuesday, the Texas senator's rapid response director <mark>Brian Phillips</mark> tweeted. \"Ted Cruz is a full spectrum conservative that the people of Kansas should rally behind,\" said Huelskamp in a statement. Huelskamp's endorsement makes 12 members of the Freedom Caucus that have supported Cruz, the most of the group behind any candidate, according to FiveThirtyEight's endorsement tracker. A number of the lawmakers had endorsed Kentucky Sen. Rand Paul, another libertarian, anti-establishment Republican, who dropped out of the race after failing to gain momentum. The group is known for causing trouble for House Republican leadership, especially during the reign of former House Speaker John Boehner. Their opposition was part of why Boehner stepped down from his role and resigned from Congress, and they also stood against his first heir apparent, Majority Leader <mark>Kevin McCarthy</mark>, causing the Californian to withdraw his name from contention and convincing now-Speaker <mark>Paul Ryan</mark> to run for the job. Tweet Tweet Copyright 2016 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags Politics Comments () Print Recommended Comments The views expressed are not those of this site, this station or its affiliated companies. By posting your comments you agree to accept our terms of use. KCCI offers readers the ability to comment on stories with the understanding that these comments may be reprinted elsewhere on the site or used on KCCI newscasts. We ask that you refrain from profanity, hate speech, comments that don't relate to the story and any personal remarks. THIS IS IMPORTANT: KCCI does not edit user submitted statements and we cannot promise that readers will not, at times, find offensive or inaccurate comments posted in this area. If you find a comment that is objectionable or offensive, click the flag that appears in the upper right corner when you hover over a comment. Flagged comments may be automatically hidden from comment threads. For comments to appear on the website and/or the mobile app, email addresses must be verified through Disqus. We ask the community to monitor this forum with the knowledge that KCCI does not regularly monitor these comments. Please enable JavaScript to view the comments powered by Disqus. blog comments powered by Disqus", "articleID": "2016021701_00033508_W", "names": {"Brian Phillips": ["Q21461057", "Q21553548", "Q4965038", "Q4965039", "Q56885961"], "Donald Trump": ["Q22686", "Q27947481"], "Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2016-02-17", "url": "http://www.gossipcop.com/dalton-rapattoni-rebel-yell-american-idol-video-top-24-performance-watch-youtube/", "content": "VIDEO (Fox) Dalton Rapattoni gave a \"tremendous\" performance of \"Rebel Yell\" during Wednesday's \"American Idol .\" Watch below! As Gossip Cop reported, Rapattoni was welcomed into the season 15 Top 24 earlier this month, with the judges praising the unconventional twists he puts on songs. Now with hopes of making it into the Top 14, he continued to show his punk side with Billy Idol's \"Rebel Yell .\" The 20-year-old vocal coach had <mark>Jennifer Lopez</mark> bouncing in her seat, Keith Urban singing along with a smile, and Harry Connick, Jr., well, staring intently. <mark>Lopez</mark> couldn't stop screaming afterward at first, and the exclaimed, \"Dalton! You know, I don't care about anything except that made me feel something. First of all, you're pretty as can be. I can't with him .\" She added more seriously, \"Beyond that, it was a great performance...I loved it .\" Connick told Rapattoni, \"It was absolutely a phenomenal performance. It was a great interpretation of that song. You sang the lyrics. It was powerful. I thought it was absolutely tremendous .\" And Urban said to the aspiring star, \"You never disappoint. That's what I love about you. I know you're gonna do something with a song that we know, but you're gonna make it--you're gonna Dalton-ize it...I love that you got your own genre. It's very cool .\" It will be revealed on Thursday's results show who from Rapattoni's group of 12 will join last week's safe contestants to make up the Top 14. With five at risk of elimination, he'll have to be among the seven who make the cut. Gossip Cop will have full video of his performance shortly, but check out the clip below in the meantime! Enter your email address here to receive daily news updates from us. Use the LIKE button below to see GossipCop notifications in your Facebook news feed! Got Tips", "articleID": "2016021802_00460868_W", "names": {"Jennifer Lopez": ["Q40715", "Q6178557"]}}, {"date": "2016-02-18", "url": "http://www.atlasobscura.com/articles/why-the-science-of-salt-is-as-polarized-as-politics", "content": "Why the Science of Salt is as Polarized as Politics Close your eyes and spin the globe. what: (Photo: Dubravko Sorić / Flickr) To salt or not to salt is a question most humans think about at least a few times a day, even if we remain puzzled over the health effects. And if you think you've seen conflicting studies on whether salt is killing you, you're not imagining things. Researchers reviewing over 35 years of academic reports and studies said Thursday that the community of scientists studying salt intake among humans is sharply divided, and unlikely to come to any definitive conclusions soon. While the scientific literature is slightly in favor of people reducing salt intake--around 54 percent of reports said humans would probably be healthier if we did--another third said it may not matter, while a handful more were inconclusive, researchers said. Worse, they found that the scientists who disagree hardly ever collaborate, instead citing papers that tend to square with their point of view. Much of the research also had a strong bias toward the status quo. \"There are two almost distinct bodies of scholarship--one supporting and one opposing the claim that salt reduction in populations will improve clinical outcomes,\" says <mark>David Johns</mark>, who co-authored an article outlining the findings in the International Journal of Epidemiology. \"Each is driven by a few prolific authors who tend to cite other researchers who share their point of view, with little apparent collaboration between the two sides .\" Scientists also can't agree on what counts as evidence, while a number of the observational studies were hurt by methodological defects. In other words, the jury's still out on salt, and we probably shouldn't expect a definitive answer anytime soon. \"We pay quite a bit of attention to financial bias in our work,\" says <mark>Sandro Galea</mark>, another article co-author. \"We seldom pay attention, however, to how long-held beliefs bias the questions we ask and the results we publish, even as new data become available .\" ", "articleID": "2016021821_00726288_W", "names": {"David Johns": ["Q1174880", "Q20746766", "Q5235686", "Q56107493"], "Sandro Galea": ["Q18062123", "Q55471743"]}}, {"date": "2016-02-21", "url": "http://dhakatribune.com/world/2016/feb/22/gop-candidates-offer-stark-contrast-visions-field-thins", "content": "today's paper>> world>> published: 00:41 february 22, 2016 GOP candidates offer stark contrast in visions as field thins Reuters As the presidential field winnows after <mark>Donald Trump</mark>'s commanding victory in South Carolina's nominating contest, US Republican voters face a choice that grows starker by the day. Do they back the rage-infused, turn-back-the-clock tone of <mark>Trump</mark>, or perhaps his conservative, evangelical rival, Ted Cruz? Or do they favour the sunnier, more inclusive appeals of emerging establishment favourite Marco Rubio or Ohio Governor John Kasich. Not only will the answer decide the Republican nominee, it may well change what it means to be a Republican. The party is enduring a schism between those who want to work within the system and those want to tear it down. \"The GOP is broken may not be salvageable,\" said Juleanna Glover, a Republican consultant in Washington who had supported Jeb Bush, who dropped out of the race on Saturday after a poor showing in South Carolina. <mark>Trump</mark>'s support, she said, shows that one-third of the party's voters \"want out .\" Bush, the former Florida governor, had been part of that camp of Republican establishment optimists. Ben Carson, the right-wing retired neurosurgeon, was never a factor in South Carolina and could be the next to exit. That leaves a Final Four, of sorts, as the campaign maintains a southern focus for a string of contests on March 1 that include Georgia, Texas, and Virginia. <mark>Trump</mark> and Cruz will be the favourites in many of them, with Rubio, a senator from Florida, and Kasich seen struggling until the primary schedule shifts to more hospitable regions, including their home states. Rubio finished in a near tie for second in South Carolina with Cruz, rebounding strongly from his stumble in New Hampshire, where he finished fifth and was criticised for being overly scripted. He stands to benefit the most from Bush's departure as the perceived establishment standard-bearer. Kasich trailed well behind, managing fewer votes than Bush. Going to extremes Billionaire real estate developer <mark>Trump</mark> has racked up wins in two of the three early-voting states by channeling the disillusionment many Americans, especially the white working-class, feel with stagnant wages, globalisation, the influence of corporate money in politics, and a gridlocked government. Cruz, a senator from Texas, has courted libertarian and religious voters who believe their values are under assault. Both strike a tone of alarm, largely about the porous US southwest border and the threat of Dae's h. And both often offer a paean to the past, asking voters to envision a time when the country appeared to be more prosperous and homogenous. Some Republicans fear that the appeal of either candidate will simply be too narrow. Alternatively, Rubio and Kasich bill themselves as healers of America's fractured politics. On the stump, Rubio speaks of uniting the quarrelsome factions of the Republican Party, and has embraced diversity in a way that his competitors have not. Rubio has vowed to grow and unite the party and broaden its appeal among younger Americans. The contrast between Rubio's events Friday and those of <mark>Trump</mark> and Cruz was vivid. <mark>Trump</mark>, just a day after getting into public spat with Pope Francis, told an apocryphal story about a general who executed Muslims using bullets dipped in pig blood. Cruz's rally featured Phil Robertson, star of the reality show \"Duck Dynasty\" who has condemned homosexuality as sinful. But some Republican voters worry that Rubio, who, like Cruz, is a first-term senator, and Kasich, who has labeled himself \"the prince of light and hope\" , aren't tough of enough to usher in the radical change they crave.", "articleID": "2016022119_00774204_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]