[{"date": "2016-04-20", "url": "http://www.nwaonline.com/news/2016/apr/20/parts-of-houston-still-closed-by-floodi/", "content": "Parts of Houston still closed by flooding By DEMOCRAT-GAZETTE STAFF AND WIRE REPORTS Posted: April 20, 2016 at 3:48 a.m. Updated: April 20, 2016 at 3:48 a.m. DAVID J. PHILLIP Credit: AP Residents are evacuated from a retirement and assisted-living complex as floodwaters rise Tuesday in Spring, Texas. HOUSTON--As more than a foot of rain deluged the nation's fourth-largest city, inundating homes, shutting down highways and leaving at least six people dead, Houston's mayor said there was no immediate solution. Residents are evacuated from their apartment complex Tuesday in Houston. Storms have dumped more than a foot of rain in the a.. . (By: DAVID J. PHILLIP) Louis Marquez carries his dog Chocolate through floodwaters Tuesday after rescuing the dog from his flooded apartment in Hous...(By: DAVID J. PHILLIP) (Credit: AP) Flash flooding and a 50 percent chance of more rain were possible after nearly 18 inches fell in 24 hours. The National Weather Service had the area under a flash flood watch through this morning. \"A lot of rain coming in a very short period of time, there's nothing you can do,\" Mayor Sylvester Turner said Monday. Scores of subdivisions were flooded, and most schools remained closed, although the city itself was returning to normal Tuesday. Municipal offices reopened Tuesday, and by midmorning, fewer than 10,000 CenterPoint Energy customers were without power, an improvement from 24 hours earlier when electricity failures topped 100,000. Houston's Metropolitan Transit Authority resumed service, and most highways within the city were open. Outside the city and into the suburbs of northwest Harris County, runoff from Monday's rains pushed creeks over their banks and forced more people to evacuate their homes overnight. In addition to its location, Houston's \"gumbo\" soft soil, fast-growing population and building boom that has turned empty pastures into housing developments all over the city's suburbs make it vulnerable to high water. Harris County has seen a 30 percent jump in population since 2000. Its surrounding counties have grown by nearly 10 percent since 2000, according to the Greater Houston Partnership, a business group. Some of the resulting developments include adequate greenspace for water runoff, but not all of them do, said Philip Bedient, an engineering professor at Rice University. \"Could we have engineered our way out of this?\" Bedient asked. \"Only if we started talking about alterations 35 or 40 years ago .\" Rainstorms last year over Memorial Day weekend caused flooding that required authorities to rescue 20 people, most of them drivers, from high water. Drivers abandoned at least 2,500 vehicles, and more than 1,000 homes were damaged by flooding. The year before, flash flooding in Houston and suburban counties left cars trapped on highways. Still, those storms pale in comparison with the devastation from Hurricane Ike in 2008 and Tropical Storm Allison in 2001. Allison left behind $5 billion in damage and flooded parts of downtown and the Texas Medical Center, which sits near the Brays Bayou, a key watershed. <mark>Jeff Evans</mark>, the National Weather Service's chief meteorologist for Houston, said Monday's soaking and the 2015 Memorial Day deluge were the second - and third-biggest rain events on record after Allison, which dumped more than 30 inches of rain on parts of the city over two days. He said the El Nino weather phenomenon, caused by heightened surface temperatures in the eastern Pacific, could \"be a player in why we've had so many big rain events this year .\" <mark>Evans</mark> said rain fell in some places Monday at a rate of 3-4 inches per hour. \"No matter what drainage system you build, anything will struggle with that kind of volume in that short a time,\" he said. Bedient has worked with the Texas Medical Center on better preparing its facilities for large rainfalls. Those preparations include the use of a sophisticated weather alert system that gives the medical center extra time to activate gates and doors that block excess rainwater. Improving the monitoring of specific watersheds and flood-prone areas might give affected residents the extra bit of time they need to save lives and take protective measures. \"We can't solve this flood problem in Houston,\" Bedient said. \"All we can do is a better job warning .\" The upper-level low that took heavy rain to Texas will pump moisture into Arkansas, although National Weather Service forecasters say the state will not see the deluge that Houston and Dallas saw. Weather service meteorologist Charles Dalton of North Little Rock said the state should see \"garden-variety\" showers and light thunderstorms through Thursday evening. No severe weather is expected, he said. \"There are no signals of strong convection or heavy rain in this,\" he said. \"We could see some impulses sparking off a few thunderstorms, but nothing severe .\" Rain entered Arkansas late Monday and will move slowly east across the state. The southern half of the state should see more rainfall, although accumulations may not top 1-2 inches total, he said. Dalton said remnants of the system should cross the Mississippi River by Friday. He said meteorologists are watching another system that could bring heavier storms to the state by midweek next week. Information for this article was contributed by Michael Graczyk, Nomaan Merchant and Frank Bajak of The Associated Press; and by Ken Heard of the Arkansas Democrat-Gazette. A Section on 04/20/2016", "articleID": "2016042009_00019010_W", "names": {"Jeff Evans": ["Q17385896", "Q6173783"]}}, {"date": "2016-04-22", "url": "http://www.wsws.org/en/articles/2016/04/22/spai-a22.html", "content": "World Socialist Web Site Published by the International Committee of the Fourth International (ICFI) Podemos pleads with Socialist Party to form a government in Spain By <mark>Paul Mitchell</mark> 22 April 2016 Attempts to form a new government in Spain have stalled, raising the possibility of fresh elections being called. The breakup of the decades-long two-party system in the general election in December left a hung parliament divided among four main parties, the Popular Party (PP), Socialist Party (PSOE), Podemos and Ciudadanos (Citizens). Attempts to cobble together a coalition have repeatedly failed--the most recent being that between the PSOE and Citizens. That pact required the support of Podemos, but to be seen to be cooperating with Citizens would have totally exposed the political pretensions of the pseudo-left party. King Felipe VI is to hold a new round of consultations beginning April 25. Podemos is making a last ditch attempt with pleas to the PSOE to form a so-called \"Government of Change\" that would include the Communist Party-led United Left (IU) and Valencian nationalist Compromis and require the support or abstention of Catalan and Basque nationalists. If a power-sharing agreement is not reached by May 2, new elections will be held on June 26. Polls suggest the voting will be similar to that in December, although the situation is volatile and difficult to predict as 40 percent of voters are still undecided. On Monday, Podemos announced the results of a referendum that was held last week after three-way talks with the PSOE and Citizens broke down. Podemos members were asked two questions: Do you want a Government based on the PSOE-Citizens pact? Do you agree with our proposal for a Government for Change with Podemos, En Comú Podem (Podemos in Catalonia), and En Marea (a coalition in Galicia involving Podemos, the Anova-Nationalist Brotherhood, the IU and various municipal alliances)? Both options were variants on a coalition with the PSOE. Announcing the results, Podemos Organisation Secretary, Pablo Echenique, declared that of the party's 393,538 registered members just 149,513 (37 percent of the total) voted. Some 88 percent opposed the PSOE-Citizens pact and 92 percent backed the Government of Change proposal. That so few bothered to vote in such a critical decision reveals the true level of commitment among Podemos members, or more properly what its real membership is. Echenique attempted to downplay the low turnout, claiming that the voting registration system was changed so that only those who had \"regular involvement\" with the party could participate. After the result was announced Podemos number two and Political Secretary Inigo Errejón declared, \"The results are clear and the popular mandate will guide the next steps .\" One of the party's co-founders and Secretary of Political and Social Analysis, Carolina Bescansa, warned the PSOE that if it did not \"take the hand we are holding out for a coalition government\" it would have \"many difficulties\" in an election campaign. Podemos mayor of Madrid, Manuela Carmena, called on \"all persons able to reach an agreement\" to enable the formation of a \"government of change\" in order to prevent a new election and end the \"cycle\" of the PP in power. \"One of the things I like best is how in this city municipal government, we are in the minority [but] we achieved agreements,\" Carmena explained, adding that \"My view is moving away from the use of political parties as instruments of representation in representative democracy. I orient more to the establishment of broad fronts...\"--that is, power at any cost. The referendum was a manoeuvre by the Podemos leadership to shield itself from the charge that it was responsible for new elections should they be called and bolster its negotiations with the PSOE. This week, Podemos leader Pablo Iglesias called on PSOE leader <mark>Pedro Sánchez</mark> to ballot his members on Podemos'\" Government of Change \"proposals. Central to the proposals were what Iglesias called 20\" concessions \"to the PSOE that he had made with\" terrible pain \". They represent a wholesale capitulation to the austerity regime demanded by the European Commission, International Monetary Fund and European Central Bank and reveal the fraudulent nature of Podemos' claim to be an anti-austerity party. In reply to those who called the concessions a betrayal of Podemos' principles, a party spokesperson was forced to state with unparalleled cynicism,\" We will continue in our line. Yield, yield and yield. But yielding without betraying the backbone of our national project. \"In the event, Podemos's pleas for a deal were rejected with Iglesias declaring,\" On the part of the PSOE we received an explicit refusal to explore the possibility...They were very clear in telling us their framework is the only possible, as they are firmly tied to Citizens. \"However, PSOE Congress spokesman Antonio Hernando, revealed that of Podemos' 20 proposals the PSOE was happy with 70 percent of them. This statement alone is ample evidence that the political differences between Podemos and the PSOE, a right-wing party that for decades has proven in practice its pro-capitalist, anti-working class credentials, are minimal. A last-minute agreement is entirely possible, as was shown in Greece where last year Podemos' ally Syriza formed a government with the far-right Independent Greeks in order to impose savage austerity measures. Like Syriza, Podemos is a bourgeois party that is hostile to the working class and supports the framework of war and austerity imposed by the European Union. It reflects the interests of upper middle class layers of entrepreneurs, professionals, and academics who will implement whatever is required to get a shot at state power. However, <mark>Sánchez</mark> is in the grip of a serious dilemma. On the one hand, the PSOE faces the possibility of electoral annihilation should there be any rapprochement with the PP--which was thrown into deeper crisis over the resignation last Friday of José Manuel Soria from his positions as Congress deputy, Industry Minister and PP regional chairman in the Canary Islands after his name appeared in the Panama Papers. On the other, the majority of the PSOE leadership, led by the president of Andalusia, Susana Diaz, have been vehemently opposed to any alliance with Podemos and would prefer one with the PP. This week acting deputy PP prime minister, Soraya Sáenz de Santamaría, warned <mark>Sánchez</mark> that\" all his left-wing aspirations \"had failed and demanded he drop his opposition to talks with the PP. The PP number three, <mark>Fernando Martínez</mark> - Maillo, said,\" We are going to keep until the last day our proposal for a grand coalition. \"", "articleID": "2016042206_00147876_W", "names": {"Fernando Martínez": ["Q18729811", "Q23641785", "Q26267550", "Q3069494", "Q43107614", "Q43654480", "Q5444819", "Q57834387"], "Paul Mitchell": ["Q20706988", "Q27922634", "Q28819608", "Q30121955", "Q7152553", "Q7152554", "Q7152555", "Q7152556", "Q7152561"], "Pedro Sánchez": ["Q25414599", "Q6070218"]}}, {"date": "2016-04-24", "url": "http://ap.stripes.com/dynamic/stories/L/LT_MEXICO_MISSING_STUDENTS?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2016-04-24-18-44-31", "content": "MEXICO CITY (AP)--There is strong evidence that Mexican police tortured some of the key suspects arrested in the disappearance of 43 students, according to a report released Sunday by an outside group of experts. The Inter-American Commission on Human Rights expert group says that a study of 17 of the approximately 123 suspects arrested in the case showed signs of beatings, including, in some cases, dozens of bruises, cuts and scrapes. One suspect said he was nearly asphyxiated with a plastic bag, and medical studies showed another had been slapped on the ears so hard his eardrums broke and his ears bled. The Mexican government recently released documents suggesting investigations had been opened against police and military personnel, but authorities have not answered requests about whether anyone has been arrested or charged. The 43 students at the radical teachers' college of Ayotzinapa have not been heard from since they were taken by local police in September 2014 in the city of Iguala, Guerrero state. Family members and supporters of the missing students chanted \"They took them away alive, we want them back alive!\" at the news conference where the report was presented. No high-ranking officials attended the presentation of the report, which called the government's investigation flawed and incomplete. But President Enrique Pena Nieto wrote in his Twitter account that the federal attorney general's office \"will analyze the whole report, to aid in its investigations .\" Mexico's deputy attorney general for human rights, Eber Betanzos, said authorities were investigating complaints filed by 31 people who said they had been tortured; he said six criminal cases had been opened, and had that three involved employees of the attorney general's office. Betanzos called the case \"the most exhaustive investigation in the history of Mexican law enforcement .\" But the allegations of torture could endanger any chance of convictions in one of the highest-profile human rights cases in Mexican history, especially because the government's version of events - that corrupt police handed the students over to drug gang members who killed them and burned their bodies at a trash dump - hangs in large part on the testimony of some drug gunmen who now say they were tortured into confessing. \"It is a lie the way they said they caught us,\" Patricio Reyes Landa said in testimony made public by the experts' report. \"They went into the house, beating and kicking. They hauled me aboard a vehicle, they blindfolded me, tied my feet and hands, they began beating me again and gave me electric shocks, they put a rag over my nose and poured water on it. They gave me shocks on the inside of my mouth and my testicles. They put a bag over my face so I couldn't breathe. It went on for hours .\" Mexican judges are instructed to throw out confessions based on torture; Betanzos said the government's case was not solely based on confessions. The group of experts complained the government was slow to deliver some of the evidence it had asked for; it criticized government prosecutor's investigations as flawed and incomplete, and suggested that the government wanted to stick to its version, without investigating possible involvement by federal police and the army. For example, the report said, the roadblocks set up on local highways around the city of Iguala on the night of the disappearances were far more extensive than previously thought. The roadblocks were apparently coordinated by the Guerreros Unidos drug cartel to trap rivals; the gang may have thought the students were part of a rival cartel. The report criticized the forensics investigations of human remains and evidence of fire at the garbage dump in the town of Cocula, Guerrero, saying that prosecutors had provided little evidence there ever could have been a fire a big enough at the site. \"It is clear that there was a latent rejection of any version other than the burning of the students at the Cocula dump, and they turned back to that scenario time after time, without investigating other police forces or state actors,\" the group said in its final report. Its mandate expires at the end of this month, and it leaves Mexico with the crime still largely unresolved; only one student has been identified from charred bone fragments found in a river near the dump. The foot-dragging by prosecutors \"cannot be seen as partial or improvised obstacles,\" said the report. \"These different situations aren't casual barriers, they are structural barriers to the investigation .\" The report also found that one student sent a message to his parents from his cellphone hours after he had supposedly been killed. But the \"significant evidence of torture and abuse\" of the suspects was the report's most damning element. For example, the medical reports on one suspect whose testimony was key for the government's case, <mark>Agustin Garcia</mark> Reyes, claimed he had one injury, a bruise, after marines took him into custody. But hours later when he was turned over to civilian prosecutors, they said he had 30 bruises, scrapes and scabs. \"There seems to be no limit to the Mexican government's utter determination to sweep the Ayotzinapa tragedy under the carpet,\" wrote Amnesty International's Americas director Erika Guevara-Rosas. Daniel Wilkinson, deputy director of Human Rights Watch's Americas division, wrote that while the experts had been critical of the government investigation before, the new report \"goes much further in presenting evidence of obstruction, of manipulation of evidence and even torture .\" \"Based on all the ways the government has obstructed the work of the group it seems clear that the reason they brought them in was never to solve the case, but rather to do PR, to do damage control in the face of the public outrage at their handling of the case,\" Wilkinson wrote. \"If that was the calculation, clearly they miscalculated .\" ", "articleID": "2016042422_00546985_W", "names": {"Agustin Garcia": ["Q3606942", "Q57772736", "Q9142689"]}}, {"date": "2016-04-25", "url": "http://reason.com/blog/2016/04/25/chris-christie-urges-lawmakers-to-rewrit", "content": "dashcamGov. Chris Christie (R-N.J.) is leaving the door open for his support of a bill requiring police departments to equip their vehicles with dashboard cameras, after that law was ruled an unfunded mandated by the Council on Local Mandates. \"I signed it the last time so I'm certainly willing to look at it,\" Christie said, \"but look at it in light of the new costs .\" The dashcam bill, first introduced in 2014, included a $25 surcharge on DWI offenses as a method of paying for the dashcams. Christie has not been shy to support increased fines as a method of paying for government mandates before. In 2013, he signed a bill into law that increased penalties for failure to keep right from the $50 to $200 range to the $100 to $300 range, including a $50 surcharge to pay for \"keep right\" sign. While the dashcam bill's sponsor argues that the Council on Local Mandates doesn't have the power to review partially funded mandates and asked Christie to appeal the decision, Christie agreed with the council that its decisions were not reviewable. The New Jersey Constitution calls the council's decisions \"political and not judicial determinations .\" The Constitutional provision about the Council on Local Mandates does offer a number of other ways legislation can avoid review by the council, including laws, rules, or regulations \"which implement the provisions of this Constitution,\" something the bill's sponsors perhaps could have argued the dashcam law did, but didn't argue. Another provision exempts laws, rules, or regulations \"which are required to comply with federal laws or rules or to meet eligibility standards for federal entitlements .\" There are no federal rules tying federal funding of local and state law enforcement to transparency measures like installing dashboard cameras or using body cameras. I've previously suggested a tax on police associations and unions to pay for the dashcam, but suspect that's an idea that would be met in the New Jersey legislature with bipartisan opposition. Photo Credit: dashcam Friday Funnies: Chris Christie & <mark>Donald Trump</mark> Chip Bok | 3.04.16 The Sad, Embarrassing Spectacle of Chris Christie's <mark>Donald Trump</mark> Endorsement Peter Suderman | 3.02.16 Chris Christie's <mark>Trump</mark> Endorsement Proves He's an Authoritarian Who Never Really Cared About Entitlement Reform Peter Suderman | 2.26.16 VIEW COMMENTS (3) | LEAVE A COMMENT Editor's Note: We invite comments and request that they be civil and on-topic. We do not moderate or assume any responsibility for comments, which are owned by the readers who post them. Comments do not represent the views of Reason.com or Reason Foundation. We reserve the right to delete any comment for any reason at any time. Report abuses. On select articles, Reason is testing a new comment promotion feature developed by SolidOpinion. Commenters can purchase points and bid to promote their comments and/or the comments of others. Winning comments are displayed at the top of the comment thread for each article, and are identified as \"promoted comments .\" Point purchases and bidding are handled SolidOpinion. Please send any questions and feedback to promoted-comments @ reason.com. Please enable JavaScript to view the comments powered by Solidopinion. Tonio | 4.25.16 @ 11:07 AM | #Yo, fuck Chris Christie. / xeones reply to this log in or register to reply Radioactive | 4.25.16 @ 11:10 AM | #not even with someone else's dick reply to this log in or register to reply Hyperion | 4.25.16 @ 11:11 AM | #I really don't know what good the dash cams are doing. I mean, sure it's spreading awareness. But you can show the boot lickers 100 videos of cops murdering unarmed people who are in no way resisting and they'll still say something like \"well, that guy had to be doing something wrong'. I think that before something changes, a majority of people will have to be outraged, so I think the cops are safe for the foreseeable future, unfortunately. reply to this log in or register to reply Leave a Comment * COMMENT: You must have an account and be logged in to comment. Click here to register, or here to login if you already have an account * COMMENT:", "articleID": "2016042515_00198615_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-04-25", "url": "http://azfamily.com/story/31766945/young-woman-adopts-six-children", "content": "Young woman adopts six children - azfamily.com 3TV | Phoenix Breaking News, Weather, Sport Young woman adopts six children - azfamily.com 3TV | Phoenix Breaking News, Weather, Sport Member Center: Young woman adopts six children Posted: Updated: A single woman adopted six sisters from foster care. (Source: KFSN/CNN) FRESNO, CA (KFSN/CNN) - Selfless love is being demonstrated by a young, single California woman raising six sisters she adopted from foster care. Five years ago, Lacey Dunkin was single, in her mid-20s, and far from having children of her own. \"You don't set out to have six little girls,\" she said. \"I'm glad that it happened. I'm so blessed .\" Dunkin always knew she wanted to be a mom, and she set out to be certified as a foster parent in 2011. Late one night in September, she got the call to take on four little girls ages 1 to 5. \"And I said yes,\" she said, \"like before she could finish talking .\" In the next few years, her family would grow but also endure separation. The girls' biological mother had another baby, and all the kids went back. A month later, Dunkin regained custody. Then in 2013 the birth mother had a sixth child. The future become uncertain again. \"Their first reaction was like...but not us,\" Dunkin said. \"This is home. We can't go anywhere, right. I didn't even realize that was so important to them .\" Dunkin put those worries to rest by adopting all six girls. \"I just really wish people didn't think that they were bad,\" Dunkin said. \"It's not their fault that they are in the system .\" Foster kids may come into a family looking for love, but Dunkin says they give much more than she thought she could receive. \"You're able to love them because they love you, and your heart just grows more and more,\" she said. Dunkin and the girls live with her parents. Dunkin said that without the support of her support, none of this could have been possible. Copyright 2016 KFSN via CNN. All rights reserved. Raycom reportsRaycom reportsMore>> Updated: Monday, April 25 2016 5:58 PM EDT2016-04-25 21:58:46 GMT Apple CEO <mark>Tim Cook</mark> predicted in January that iPhone sales would fall for the first time since the smartphone debuted nearly a decade ago. But iPad sales are also predicted to shrink while demand for Macs remained unchanged. Updated: Monday, April 25 2016 5:31 PM EDT2016-04-25 21:31:46 GMT A new study finds bedbugs are attracted to certain colors more than others. It turns out the insects really dig dark red and black, and are less into dazzling white and bright yellow. Updated: Monday, April 25 2016 5:29 PM EDT2016-04-25 21:29:14 GMT In the past five years, the DEA has destroyed more than 5.5 million pounds of unused prescription drugs. Updated: Monday, April 25 2016 5:17 PM EDT2016-04-25 21:17:41 GMT North Korean officials say they would only consider stopping their missile program if the U.S. stops its annual war games with South Korea. The United Nations has placed additional economic sanctions on North Korea following a series of arms tests. More tests are suspected.", "articleID": "2016042522_00467694_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}, {"date": "2016-04-27", "url": "http://www.latimes.com/socal/the818now/tn-gnp-crescenta-valley-girls-lacrosse-outlasts-westridge-for-double-overtime-win-20160427-story.html", "content": "Crescenta Valley girls' lacrosse outlasts Westridge for double-overtime win Charles Rich Contact Reporter PASADENA--Lizzy Hales had a brief moment to make an observation. With an opportunity to win a back-and-forth match, the Crescenta Valley High freshman girls' lacrosse player studied the opposing goalkeeper before launching an eight-meter shot. Hales scored with 2:23 left in double-overtime to lift visiting Crescenta Valley to a 9-8 nonleague win against Westridge on Wednesday. \"I wanted to score by shooting through the goalkeeper's legs,\" said Hales, a midfielder who finished with two goals. \"I was thinking to myself that I had to make the shot or else we keep on playing .\" It turned out to be a nerve-wracking game that we were able to win. I'm just going out there trying to live up to my expectations. You put it all on the line and I love the sport. \"It marked the second time this season that Hales scored on an eight-meter shot. Crescenta Valley (8-4) defeated Westridge (7-6) for the second time this season. The Falcons picked up a 7-4 home win in the first meeting April 6. Crescenta Valley finished second in the Pacific League behind Chaminade after tying for third with La Ca & ntilde; ada last season. The Falcons qualified for the USA Lacrosse Southern Section North Division playoffs. Playoff pairings are set to be unveiled Sunday. However, Crowther said he would make a decision as to whether the Falcons will participate in the postseason since several players have Advanced Placement testing that could conflict. The Falcons and Tigers have had a brief history of playing overtime matches. The teams played two overtime tilts last season .\" It's an exciting game, except for me as the coach, \"Crescenta Valley Coach Boz Crowther said .\" We seem to be on paper a marginally better team than Westridge. When we play Westridge, you can throw away the paper because we always seem to go to overtime against them. \"We train our players to watch the tendencies of the goalkeeper. Lizzy saw something to her liking and made a nice shot to win it .\" The Falcons, who finished second in the Pacific League behind Chaminade after tying for third last season with La Ca & ntilde; ada, tied it at 8 on a goal by Madeline Heeg with 7:54 left in the second half. Heeg's goal came a little more than five minutes after Rachel Dillman gave the Tigers an 8-7 lead. Crescenta Valley held a 7-5 halftime advantage. Abby Sheklow scored two goals in a 50-second span late in the first half. Sheklow, a junior attacker, finished with a team-high three goals. \"We went up against a Westridge team that worked so hard,\" Sheklow said. \"They played a great game .\" We wanted it so much in the end. Lizzy made a great shot to win it and we're so proud of her. There's a lot of skill on our team and we are trying to get better. \"Crescenta Valley received 10 saves from goalkeeper <mark>Sabrina White</mark>, including two in the first overtime. Dillman and Quincy Foster had two goals each for Westridge. Dillman's first goal gave the Tigers a 2-0 lead with 23:34 left in the first half. Sheklow knotted it at 3 with 8:49 to go. Crescenta Valley will participate in a nonleague home match at 3:30 p.m. Friday against West Ranch.", "articleID": "2016042803_00309450_W", "names": {"Sabrina White": ["Q1517525", "Q52159455"]}}, {"date": "2016-04-29", "url": "http://irishexaminer.com/sport/gaa/hurling/kilkenny-must-consider-sweeper-admits-tj-reid-395702.html", "content": "Kilkenny must consider sweeper, admits TJ Reid Friday, April 29, 2016 It's not even three months since Brian Cody vowed \"never' but TJ Reid has suggested it may be time now for Kilkenny to bow to pragmatism and consider deploying a sweeper. Ambassadors TJ Reid and <mark>James McCarthy</mark> with the Cúl Heroes mascots. Picture: Sam Barnes Cody, Kilkenny's 11-time All-Ireland winning manager, has traditionally set his team up in orthodox fashion and as recently as February stated that,\" personally, whatever team I'd be involved with, with the club or Kilkenny, I could never see myself employing an actual sweeper'. However, the use of a sweeper has been a key part of Waterford's resurgence at the top level and they will challenge this weekend for back to back Allianz League titles. Waterford manager <mark>Derek McGrath</mark> suggested this week that a number of other counties have gone down the same avenue of playing at least seven outfield defenders. READ NEXT Davy Fitzgerald warns Sunday's Division 1 final may not be a day for the purists As for MacCarthy Cup holders Kilkenny, their defence was cut asunder by Clare who, playing with a sweeper, struck four goals in the semi-final of the league, prompting Hurler of the Year Reid to nod when asked if his team may have to compromise on their principles and do likewise. \"We'll have to definitely look at it, yeah,\" said Reid. \"We've never had a sweeper and even against a strong breeze we've never had a seventh defender. But yeah, I definitely think it's something we'll have to implement in training, just to get our heads around it, just to try and have a game plan, to make sure we're not hit for that seventh defender and we're not looking around asking questions. Sunday's league decider between Waterford and Clare is expected to be one of the most tactical finals yet and Reid described it as a fascinating prospect .\" The middle third is going to be very congested because they tend to bring out everyone to try and crowd that middle third, \"he said of Clare .\" I think whoever's tactics work on the day will win. Waterford are going well as well but going on the performance against us, I probably would be going slightly with Clare. \"Reid admitted that Kilkenny didn't do as much preparation work on Clare before the league semi-final as they would normally do for a championship game. But he denied that the Cats weren't overly bothered to lose the tie or that they were content to sign off on the league campaign .\" They were driven and persistent all over the field, \"said Reid .\" They got a lead on us, we got to grips in the second-half, but they just tipped on. I think in the 53rd minute they got a goal to move them on again. We just couldn't get close to them, they kept tipping away with points and scores. \"On the day they beat us, fair and square, we have no question marks over it. On the day, we weren't good enough but we were missing five starting figures; <mark>Paul Murphy</mark>, Mick Fennelly, Conor Fogarty, Colin Fennelly and Eoin Larkin. Five big players to be missing against a good Clare team. If we had those players, it could have been a different scoreline .\" I think on the day we were still at league pace, Clare were at championship pace. All over the field they seemed to be winning breaking ball and were a lot hungrier on the day. Their intensity was a lot higher too. \"Maybe they've more work done than us. That is the way it seemed to me. We seemed to be at league pace. We haven't really found that gear yet. Hopefully we are saving it for the championship .\" Kilkenny are set to be without former All Star midfielder <mark>Michael Rice</mark> and defender <mark>Brian Kennedy</mark> who have been released from Cody's panel. \"<mark>Michael</mark> was a top class hurler, sad to see him go,\" said Reid. \"He wanted to come back this year and settle a few scores but just injuries have really plagued him. If we had <mark>Michael</mark> flying this year in midfield, half-forward, he'd be a great addition to us but just couldn't get back right from that cruciate knee ligament injury that he had last year. Sad to see him go .\" Here's a little extra sport. Watch the latest BallTalk for the best sports chat and analysis: An alternative Premier League team of the season", "articleID": "2016042823_00313369_W", "names": {"Brian Kennedy": ["Q17385682", "Q17386167", "Q28924901", "Q30122228", "Q4964327", "Q4964330", "Q4964335", "Q685603"], "Derek Mcgrath": ["Q16215929", "Q3023744", "Q5262185", "Q5262186"]}}]