[{"date": "2016-04-29", "url": "http://irishexaminer.com/sport/gaa/hurling/kilkenny-must-consider-sweeper-admits-tj-reid-395702.html", "content": "Kilkenny must consider sweeper, admits TJ Reid Friday, April 29, 2016 It's not even three months since Brian Cody vowed \"never' but TJ Reid has suggested it may be time now for Kilkenny to bow to pragmatism and consider deploying a sweeper. Ambassadors TJ Reid and <mark>James McCarthy</mark> with the Cúl Heroes mascots. Picture: Sam Barnes Cody, Kilkenny's 11-time All-Ireland winning manager, has traditionally set his team up in orthodox fashion and as recently as February stated that,\" personally, whatever team I'd be involved with, with the club or Kilkenny, I could never see myself employing an actual sweeper'. However, the use of a sweeper has been a key part of Waterford's resurgence at the top level and they will challenge this weekend for back to back Allianz League titles. Waterford manager <mark>Derek McGrath</mark> suggested this week that a number of other counties have gone down the same avenue of playing at least seven outfield defenders. READ NEXT Davy Fitzgerald warns Sunday's Division 1 final may not be a day for the purists As for MacCarthy Cup holders Kilkenny, their defence was cut asunder by Clare who, playing with a sweeper, struck four goals in the semi-final of the league, prompting Hurler of the Year Reid to nod when asked if his team may have to compromise on their principles and do likewise. \"We'll have to definitely look at it, yeah,\" said Reid. \"We've never had a sweeper and even against a strong breeze we've never had a seventh defender. But yeah, I definitely think it's something we'll have to implement in training, just to get our heads around it, just to try and have a game plan, to make sure we're not hit for that seventh defender and we're not looking around asking questions. Sunday's league decider between Waterford and Clare is expected to be one of the most tactical finals yet and Reid described it as a fascinating prospect .\" The middle third is going to be very congested because they tend to bring out everyone to try and crowd that middle third, \"he said of Clare .\" I think whoever's tactics work on the day will win. Waterford are going well as well but going on the performance against us, I probably would be going slightly with Clare. \"Reid admitted that Kilkenny didn't do as much preparation work on Clare before the league semi-final as they would normally do for a championship game. But he denied that the Cats weren't overly bothered to lose the tie or that they were content to sign off on the league campaign .\" They were driven and persistent all over the field, \"said Reid .\" They got a lead on us, we got to grips in the second-half, but they just tipped on. I think in the 53rd minute they got a goal to move them on again. We just couldn't get close to them, they kept tipping away with points and scores. \"On the day they beat us, fair and square, we have no question marks over it. On the day, we weren't good enough but we were missing five starting figures; <mark>Paul Murphy</mark>, Mick Fennelly, Conor Fogarty, Colin Fennelly and Eoin Larkin. Five big players to be missing against a good Clare team. If we had those players, it could have been a different scoreline .\" I think on the day we were still at league pace, Clare were at championship pace. All over the field they seemed to be winning breaking ball and were a lot hungrier on the day. Their intensity was a lot higher too. \"Maybe they've more work done than us. That is the way it seemed to me. We seemed to be at league pace. We haven't really found that gear yet. Hopefully we are saving it for the championship .\" Kilkenny are set to be without former All Star midfielder <mark>Michael Rice</mark> and defender <mark>Brian Kennedy</mark> who have been released from Cody's panel. \"<mark>Michael</mark> was a top class hurler, sad to see him go,\" said Reid. \"He wanted to come back this year and settle a few scores but just injuries have really plagued him. If we had <mark>Michael</mark> flying this year in midfield, half-forward, he'd be a great addition to us but just couldn't get back right from that cruciate knee ligament injury that he had last year. Sad to see him go .\" Here's a little extra sport. Watch the latest BallTalk for the best sports chat and analysis: An alternative Premier League team of the season", "articleID": "2016042823_00313369_W", "names": {"James Mccarthy": ["Q529013", "Q55643105", "Q6139191", "Q6139195"], "Michael Rice": ["Q22710618", "Q57440368", "Q6833833"], "Paul Murphy": ["Q15972994", "Q16186391", "Q16228602", "Q16919574", "Q18098677", "Q2061382", "Q333828", "Q616919", "Q7152657", "Q7152658"]}}, {"date": "2016-04-28", "url": "http://www.ottawasun.com/2016/04/28/capitals-need-overtime-to-beat-penguins-in-game-1?channelColor=sports", "content": "Capitals need overtime to beat Penguins in Game 1 By Mike Zeisberger, Toronto Sun First posted: Thursday, April 28, 2016 11:33 PM EDT | Updated: Friday, April 29, 2016 12:41 AM EDT Article WASHINGTON - Upon further review, the puck was over the goal line by the width of a stick blade. That's what differentiated these victorious Washington Capitals and the downtrodden Pittsburgh Penguins on this night. Mere centimetres. A sliver of white ice between the red goal line and the black puck that needed to be reviewed via video to be acknowledged as a goal. The winning goal. The overtime goal. T.J. Oshie's hat trick goal. The goal that gave the host Capitals a 4-3 victory over the Penguins in Game 1 of this best-of-seven second round playoff series that has all the makings of a classic. Coming into this matchup, there was little to choose from between these star studded teams. To that end, they didn't disappoint. On this drizzly Thursday evening, the only thing that separated the Penguins and Capitals was an Oshie wraparound that barely squeezed between the post and the pad of Penguins goalie <mark>Matt Murray</mark>. \"The way their\" tender plays, he's a big guy and plays aggressive, we thought we might have a chance if we tried to go to the far post, \"Oshie said, referring to <mark>Murray</mark>. For his part, <mark>Murray</mark> initially protested that the puck had not gone in. Asked if he thought he had stopped it, <mark>Murray</mark> replied:\" Yeah I did, to be honest. The ref called it a goal on the ice. I don't know how he could have possibly seen it from his angle. But I thought I had it, to be honest. \"I knew it was close but I thought it never fully crossed the line. I thought it was close enough that it would be inconclusive. But I'm not going to go any further than that .\" This series has been billed as Crosby-Ovechkin II with good reason, given that the NHL's two poster boys are clashing in the playoffs for only the second time in their post-season careers. Of course, when an event is hyped up like this, it often does not live up to expectations, instead disappointing with a resounding plop. Think many heavyweight fights. Think many Super Bowl blowouts. That wasn't the case on Thursday night in Washington, however. On a drama-filled evening full of storylines, it was one of Ovechkin's understudies--Oshie--who stole the show. In a script right off the pages of a Hollywood screenwriter, Oshie completed his three goal perforamnce with the winner at 9:33 of overtime. Game 2, which goes Saturday night here in Washington with the Capitals leading the series 1-0, will be shown to a national TV audience south of the border on NBC. And if it proves to be anywhere near as riveting as the opener, it will be an outstanding selling point for the league of just how exceptional the product can be at this level. While Ovechkin was a force, Crosby certainly could have been better. In fact, the Penguins best player was Nick Bonino, who had a goal and an assist. Andre Burakovsky scored the other Capitals goal while Bonino, Ben Lovejoy and Evgeni Malkin replied for the Penguins. <mark>Murray</mark> appeared to favour his right leg after stopping an Ovechkin breakaway in the third period but was able to continue. Meanwhile, count on the league to review a knee-on-knee hit delivered by the Caps' <mark>Tom Wilson</mark> on the Pens' Conor Sheary in the third period. As bad as the play looked, no penalty was called, leaving the Penguins livid. In the first 10:37 of this series, the teams combined for 17 shots, an Burakovsky goal, a Chris Kunitz effort that pinballed off the post and a partial Ovie breakaway. Other than that...And so, the Caps hold the upper hand. So, what can we expect for an encore in Game 2? \"Games like that with teams with that amount of skill, anytime you give them time and space, it seems that they can make some plays,\" Capitals goalie Braden Holtby said. \"We did a pretty good job most of the game taking it away, but it happened once or twice and they can burn you .\" You have to be ready to focus on every single play and execute it. That's one thing we're going to get better at. \"One thing is for sure: this series is going to be fun. It already is. By Mike Zeisberger, Toronto Sun First posted: Thursday, April 28, 2016 11:33 PM EDT | Updated: Friday, April 29, 2016 12:41 AM EDT Upon further review, the puck was over the goal line by the width of a stick blade. That's what differentiated these victorious Washington Capitals and the downtrodden Pittsburgh Penguins on this night. Mere centimetres. A sliver of white ice between the red goal line and the black puck that needed to be reviewed via video to be acknowledged as a goal. The winning goal. The overtime goal. T.J. Oshie's hat trick goal. The goal that gave the host Capitals a 4-3 victory over the Penguins in Game 1 of this best-of-seven second round playoff series that has all the makings of a classic. Also in this article", "articleID": "2016042904_00597002_W", "names": {"Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"], "Tom Wilson": ["Q17859713", "Q25352557", "Q30121988", "Q542781", "Q56462160", "Q7818076", "Q7818077", "Q7818079", "Q7818080", "Q7818081", "Q7818083"]}}, {"date": "2016-04-30", "url": "http://www.dailystar.co.uk/sport/football/512041/Leeds-Transfer-News-Steve-Evans-Massimo-Cellino", "content": "Leeds set major transfer plans ahead of busy summer: Fans will love this ArsenalAston VillaBournemouthChelseaCrystal PalaceEvertonLeicester CityLiverpoolManchester CityManchester UnitedNewcastle UnitedNorwich CitySouthamptonStoke CitySunderlandSwansea CityTottenham HotspurWatfordWest Bromwich AlbionWest Ham Leeds set major transfer plans ahead of busy summer: Fans will love this LEEDS boss <mark>Steve Evans</mark> also promised to secure a play-offs spot finish next season - if the club spend big in the summer. GETTYIN THE MARKET: <mark>Evans</mark> wants Leeds to spend big this summer <mark>Evans</mark> wants the Elland Road giants to sign up to six quality players in the transfer window to mount a serious promotion charge next term. Leeds are currently 12th in the Championship and lost 2-1 at home to already relegated Charlton today. <mark>Evans</mark> said: \"I believe we need between four and six quality players .\" I believe we need between four and six quality players \"<mark>Steve Evans</mark>\" If that happens I will deliver the play-offs next season, given the opportunity, and I know the supporters deserve better players to represent them. \"<mark>Evans</mark> also expects his future at the club to be sorted out by controversial owner Massimo Cellino before their final game of the season against Preston next Saturday. He added:\" I had a very good meeting with the president yesterday and it went very well. \"There were a lot of positive, constructive things said about myself .\" I gave my views on what we need to win promotion next season and he gave his. \"Time beat us yesterday but the decision on my future may come sooner than the Preston game. I think Mr Cellino is ready to make his decision .\" Related articles", "articleID": "2016043019_00620195_W", "names": {"Steve Evans": ["Q16213945", "Q3498920", "Q43239745", "Q7612499", "Q7612500", "Q7612502", "Q7612503"]}}, {"date": "2016-05-02", "url": "http://supersport.com/cricket/more-cricket/news/160502/Thought_I_was_dying_says_Taylor", "content": "Thought I was dying, says <mark>Taylor</mark> 02 May 2016, 18:59 Tweet Former England batsman <mark>James Taylor</mark> said he thought he was going to die during a pre-season match for Nottinghamshire last month as a heart condition that forced his early retirement from cricket flared up. \"My heart was going wild at a funny rhythm. It was probably only about four degrees, really cold, and I got inside. Sweat from me is hitting the ground hard so I knew I wasn't right,\" he said of the match against Cambridge University. \"That's when I thought I was going to die .\" <mark>Taylor</mark>, 26, thought he was suffering from a viral infection but scans showed he had a heart condition known as Arrhythmogenic Right Ventricular Arrhythmia (ARVC), the same condition that almost killed former Bolton Wanderers footballer Fabrice Muamba. The middle-order batsman played seven tests and 27 one-day internationals for England and captained the side against Ireland in May last year. Speaking to the BBC, <mark>Taylor</mark> said he had no inkling of the heart complaint as the new season loomed and was \"in hysterics\" when doctors first told him he would have to retire. \"I was feeling good as gold, in fact my lead up to this season was probably the best I've ever felt, mentally and technically,\" he said. \"When the doctor told me I was in hysterics at first .\" But then he told me that the majority of these cases are only found out in the post-mortem. I almost stopped crying at that point and felt more lucky that I'm in a position to tell this story now, \"added <mark>Taylor</mark>.", "articleID": "2016050217_00093057_W", "names": {"James Taylor": ["Q11075364", "Q1168698", "Q16561148", "Q17092246", "Q17140631", "Q18218071", "Q20631287", "Q21064423", "Q21996614", "Q23618920", "Q24005465", "Q25190090", "Q2536187", "Q28465652", "Q30362443", "Q310300", "Q39073622", "Q42322786", "Q43910676", "Q56885192", "Q58492697", "Q59162274", "Q6128460", "Q6128651", "Q6141741", "Q6144041", "Q6144043", "Q6144049", "Q6144051", "Q6144058"]}}, {"date": "2016-05-02", "url": "http://www.rediff.com/news/special/did-the-timber-mafia-cause-the-forest-fires/20160502.htm", "content": "\"The kind of losses the nation is facing are incalculable .' Rashme Sehgal reports for Rediff.com on how fires are blazing across Jammu and Kashmir, Uttarakhand and have reached the doorstep of Himachal Pradesh's capital city Shimla. The Himalayas have turned into a veritable inferno. Fires are blazing across Jammu and Kashmir, Uttarakhand and have reached the doorstep of Himachal Pradesh's capital city Shimla. The rare oak forest stretching from the verdant hills of Mashobra to Anandpur in Himachal are ablaze and though desperate municipal corporation officials of Shimla have pressed the fire brigade into service, acute water scarcity has rendered the fire tenders ineffective .\" I brought my family to Shimla for a vacation. We came here to escape the heat of the plains and now we find ourselves trapped in this situation made worse by the erratic wind patterns and rising temperatures, \"says chartered accountant Harish Malhotra who had booked himself and his family into a hotel in Anandpur facing Shimla. The situation is even worse in Uttarakhand where the Char Dham Yatra is at its peak between the months of April to end June when the rains start. This year, lack of winter rains had seen forest fires start as early as the month of February. The state administration's failure to take effective action has seen this wall of fire stretch from Rudraprayag, Pauri, Almora, Chamoli, Nainital, Chakrata and Dehra Dun districts. The situation is so alarming that these fires have stretched to the sparsely populate remote hill areas which lack accessibility and where the local population is not in a position to tackle such a major fire. A thick pall of smog has spread across these districts right down to Rishikesh frightening thousands of tourists who are in the process of cancelling their visit to the shrines of Badrinath and Kedarnath right up to Gaurinath. Tour operators warn of heavy cancellations by tourists triggered by reports of the devastating fires .\" These forest fires are bound to impact tourism at a time when we were hoping that we would see a much larger footfall, \"says C Ravishankar, managing director, Garhwal Mandal Vikas Nigam which oversees tourism in this state. Already, over 3,000 hectares of pristine forest comprising deodars, chir trees and oak have been destroyed. Along with this, an entire eco-system of rare medicinal plants have been lost. The impact of these fires will be felt on the fragile water systems of these hills which provide the catchment area for all our major rivers. If this was not enough bad news, the forest department of Jammu and Kashmir has confirmed that the fires have spread to the state's Rajouri district with fires having erupted in and around Bathuni and Gambhir areas. With no chief minister to take responsibility for the situation, Uttarakhand Governor K K Paul has reviewed the rescue efforts through video conferencing with officials in the field. Union Environment Minister Prakash Javadekar, who is also in charge of forests, told the media on Sunday that the Centre and he were taking the issue of controlling these fires\" very seriously .' \"Over 6,000 people are presently deployed fighting these fires. We have also granted Rs 5 crore (Rs 50 million) to the state,' said Javdekar who had not visited the areas at the time of filing this report. The environment ministry also started trial runs Sunday for a pre-fire alert system that will issue warnings via SMS regarding the location of a fire to every state government, the Met department and other concerned organisations. Javadekar also pointed out that the Union government would study the reasons behind such major fires and prepare an action plan on how to control such fires in the future. The home ministry has deployed three National Disaster Response Force contingents, army jawans and officers and two Indian Air Force Mi-17 helicopters to help douse the fires, but the thick layer of smog is causing a major visibility problem not allowing the choppers to function. Ecologist Dr Yogesh Gokhale of The Energy and Resources Institute believes the state governments have failed to follow simple management practices including the cleaning up of the forest floors of the accumulated pine needles. This, Dr Gokhale pointed out, is highly combustible material and if it had been cleared by the local people themselves, this problem would not have arisen. These pines can be used for a variety of purposes including preparing biomass briquettes and so provide an incentive for the local people to use them. Dr <mark>Anil Joshi</mark>, who heads the Himalayan Environmental Studies and Conservation Organisation, believes the time has come to revoke the Forest Conservation Act 1980 .\" Earlier, the local communities in a spirit of collective responsibility were in the forefront of controlling the fires, \"Dr <mark>Joshi</mark> said .\" This was because they had a stake in the forests. But after the passing of this Act, the forests have been handed over to the ministry of environment and forests, thereby not allowing the local people to enter these reserved forests. \"The MoEF, Dr <mark>Joshi</mark> maintained, lacks the resources to handle the situation on the ground .\" Under the present regime, there is a forest guard posted after every 80 km and there is also a fire watcher who issues an alert in case of a fire. But the local guys hired to be fire watchers in 2015 have not been paid their emoluments to date, so what motivation would they have to give alerts or to put out the fire? \"Dr <mark>Joshi</mark> did concede that the cause of these devastating forest fires could be the handiwork of either the timber mafia or the lack of rain during two successive winters, which have resulted in a lack of moisture both in the soil and in the air. Environmentalists agree about the role of the timber mafia. Uttarakhand's Forest Development Corporation is entitled to auction trees which have dried up or are dead .\" They now have crores worth of dried trees which can be auctioned and from which they can earn a lot of money, \"an environmentalist pointed out on condition of anonymity .\" This huge fire shows a complete lack of preparedness on the part of the administration who should have played a much more pro-active role, \"felt Dr Ravi Chopra, director, Dehra Dun People's Institute .\" Till 30 years ago, \"he added,\" there was an intense relationship between the community and the forest land. Today the alienation is so high that I have seen villagers living at the edge of a forest who will make no effort to douse a fire. They say the land belongs to the forest department so let them put out the fire. \"\"We need to get local communities involved with forests as was the case 150 years ago,\" Dr Chopra said. Peter Smetacek, the Bhimtal-based lepidopterist who is a member of the Uttarakhand State Wildlife Advisory Board, has warned that these fires would have destroyed an entire ecosystem of insects, butterflies, reptiles and thousands of larger animals. \"In 2009,\" Smetacek said, \"we were witness to a major fire and it took two to three years for the population of insects and butterflies to recover. But this time, the situation is much worse and this will have terrible consequences because we all belong to one ecosystem .\" Dr Chopra pointed out how in 1991, he along with other environmentalists had calculated the worth of a forest in Jharkhand. \"We found that the net present value of a typical tree was between Rs 500 and Rs 1,000. And this did not include the worth of its timber. Today, the cost of each tree in these forests would have multiplied several fold so the losses caused by this fire run into thousands of crores of rupees .\" \"Even worse is that this fire will result in the soil becoming very dry. Climate change is resulting in fewer spells of heavier rainfall which will see huge amounts of soil erosion,\" Dr Chopra added. \"All this eroded soil is going to end up in our rivers and dams,\" he warned. \"This will reduce the life span of our dams including the Tehri Dam. The kind of losses the nation is facing are incalculable .\" ", "articleID": "2016050310_00441503_W", "names": {"Anil Joshi": ["Q16148280", "Q2722277"]}}, {"date": "2016-05-03", "url": "http://www.fightnews.com/Boxing/briggs-dimitrenko-is-official-336073", "content": "Hayemaker Promotions today confirmed that former WBO Heavyweight World Champion Shannon Briggs will face 6' 7 former European heavyweight champion Alexander Dimitrenko (38-2, 24 KOs) at Haye Day on May 21 at the O2, London. Briggs (59-6-1, 52 KOs) needs a victory to set-up a much anticipated fight with David \"The Hayemaker' Haye later this year. Shannon Briggs said,\" I don't care if this guy is tipped for a future world title, I am going to take him down in London. I don't care if this guy is younger than me, taller than me or hits harder than me. I'm in the best shape of my life and have the experience to take this guy down. I was beating George Foreman when this guy was still learning to read! Once I've knocked him out, I'll focus on taking David Haye down in his home town! \"I'm excited to put on a show for all my fans in the UK. It will be my first time fighting in this great country and the fans really embraced me when I was here earlier this month. This fight is just the warm up. I'll finish Dimitrenko and I'll celebrate, but then I'll be back to finish the Hayemaker! He won't be able to duck me any longer. Let's go champ!\" Dimitrenko stated, \"Brigg's is a loud fool, I will do my talking in the ring and he won't know what's hit him. The fight will see a former world champion lose in epic style to a future world champion. He is now the champ of Instagram but that's where his reign ends. Brigg's is going to learn first-hand what a hard hitter I am!\" Haye, who will fight undefeated Arnold \"The Cobra' Gjerjaj (29-0, 21 KOs) said,\" I'm thrilled to say that we've got another quality fighter appearing on the Haye Day undercard. Alexander Dimitrenko is a big guy and a heavy puncher and a real challenger for a world title--I think he'll cause Briggs some serious problems. If The Cannon does managed to walk away victorious, I'll be surprised, but at the same time he'll have proved his worth. It just means I get to be the one to knock him out--which is even better. \"The fans are in for a treat on May 21. We've put together a really strong card that I'm sure will get people pumped for the main event of the evening--my knockout win against\" The Cobra'. Entertainment and excitement is guaranteed. \"Also fighting on the night is Sheikh Fahad Bin Khalid Al Thani, a member of the ruling family of Qatar. He is the country's first ever professional boxer and he will make his debut on the undercard at The O2. He joins an undercard with\" Smokin' Joe Mullender taking on Lee \"Banjo' Markham for the English middleweight title as chief support, with a host of young Brits also in action including; lightweight Floyd Moore, light welterweight Kay Prospere, light heavyweight Ollie Patterson and heavyweight <mark>Nick Webb</mark> all set to fight on the night. Tickets to Haye Day at The O2 on May 21 are available on general sale now via www.theo2.co.uk", "articleID": "2016050310_00556799_W", "names": {"Nick Webb": ["Q10436294", "Q7028126"]}}, {"date": "2016-05-03", "url": "http://comicbook.com/2016/05/03/captain-america-civil-war-directors-say-strong-chance-of-lgbt-ch/", "content": "(Photo: Marvel Comics) The latest salvo in Marvel Studio's arsenal is the much-anticipated Captain America: Civil War, and while the newest installment is receiving heavy praise, that doesn't mean there isn't room to improve the Marvel Film Universe as a whole. Please enable Javascript to watch this video mce_marker \"data-mce-type =\" bookmark \"> È One such aspect is the absence of a LGBT character. While they are represented in the comics, they have yet to make the jump to the big screen. When Collider sat down with The <mark>Russo</mark> Brothers, the Directors hinted that it is an issue they hope to address. <mark>Joe Russo</mark> addressed the issue first .\" I think the chances are strong. I mean, it's incumbent upon us as storytellers who are making mass-appeal movies to make mass-appeal movies, and to diversify as much as possible. It's sad in the way that Hollywood lags behind other industries so significantly, one because you think that it would be a progressive industry, and two it's such a visible industry. So I think it's important that on all fronts we keep pushing for diversification because then the storytelling becomes more interesting, more rich, and more truthful. \"With Marvel continuing to meet enormous success with its films, there is a certain amount of leeway that it earns in regards to debuting characters that don't have the name recognition of some of their mainstream heroes. <mark>Anthony Russo</mark> addressed this and laid out how that can affect the choices they make in future films .\" I think this is a philosophy of Marvel, in success, it becomes easier to take risks. There's a lot of unconventional ideas in Civil War in terms of what people's expectations of a superhero movie are, but I think we were able to do that because Winter Soldier worked and Marvel's been working in general, so there's more of a boldness in terms of what you can try and where you can go. So I think that's very hopeful for all of us moving forward that bolder and bolder choices can be made. \"Unfortunately for Marvel, some of their LGBT characters reside in the X-Universe, which rights-wise is still held by Fox. Still, they have a variety of characters that they could introduce into the film universe, like Hulkling, Wiccan, Miss America, Moondragon, Phyla-Vell, etc.. Hopefully Avengers: Infinity War or Guardians of the Galaxy Vol. 2 will result in this void finally being filled.", "articleID": "2016050321_00265578_W", "names": {"Anthony Russo": ["Q18018415", "Q4773392", "Q4773395", "Q4773397"]}}]