[{"date": "2016-05-03", "url": "http://comicbook.com/2016/05/03/captain-america-civil-war-directors-say-strong-chance-of-lgbt-ch/", "content": "(Photo: Marvel Comics) The latest salvo in Marvel Studio's arsenal is the much-anticipated Captain America: Civil War, and while the newest installment is receiving heavy praise, that doesn't mean there isn't room to improve the Marvel Film Universe as a whole. Please enable Javascript to watch this video mce_marker \"data-mce-type =\" bookmark \"> È One such aspect is the absence of a LGBT character. While they are represented in the comics, they have yet to make the jump to the big screen. When Collider sat down with The <mark>Russo</mark> Brothers, the Directors hinted that it is an issue they hope to address. <mark>Joe Russo</mark> addressed the issue first .\" I think the chances are strong. I mean, it's incumbent upon us as storytellers who are making mass-appeal movies to make mass-appeal movies, and to diversify as much as possible. It's sad in the way that Hollywood lags behind other industries so significantly, one because you think that it would be a progressive industry, and two it's such a visible industry. So I think it's important that on all fronts we keep pushing for diversification because then the storytelling becomes more interesting, more rich, and more truthful. \"With Marvel continuing to meet enormous success with its films, there is a certain amount of leeway that it earns in regards to debuting characters that don't have the name recognition of some of their mainstream heroes. <mark>Anthony Russo</mark> addressed this and laid out how that can affect the choices they make in future films .\" I think this is a philosophy of Marvel, in success, it becomes easier to take risks. There's a lot of unconventional ideas in Civil War in terms of what people's expectations of a superhero movie are, but I think we were able to do that because Winter Soldier worked and Marvel's been working in general, so there's more of a boldness in terms of what you can try and where you can go. So I think that's very hopeful for all of us moving forward that bolder and bolder choices can be made. \"Unfortunately for Marvel, some of their LGBT characters reside in the X-Universe, which rights-wise is still held by Fox. Still, they have a variety of characters that they could introduce into the film universe, like Hulkling, Wiccan, Miss America, Moondragon, Phyla-Vell, etc.. Hopefully Avengers: Infinity War or Guardians of the Galaxy Vol. 2 will result in this void finally being filled.", "articleID": "2016050321_00265578_W", "names": {"Joe Russo": ["Q1691583", "Q20675767", "Q24734137"]}}, {"date": "2016-05-04", "url": "http://mysinchew.com/node/113991?tid=10", "content": "Chanel glitz comes to Havana, Cubans watch from afar 2016-05-04 16:13 By Hector Velasco Havana (AFP)--French fashion house Chanel staged its first Latin American catwalk show in newly trendy Havana Tuesday, but ordinary Cubans were left watching the glitz from afar. International celebrities and Cuban bigwigs graced the red carpet as Karl Lagerfeld showed his latest collection, which the German designer infused with the styles and colors of the Caribbean island. Cubans without an invitation to the exclusive event meanwhile packed the balconies of old Havana or lined the police cordon outside, straining to catch a glimpse of the beauties in the distance. \"What a sight. But I would have liked to be closer to the models,\" said 52-year-old Mireya Correoso, who told AFP she had never seen so much luxury and showbiz in one place. It was the latest in a stream of international cultural events on the communist island as it opens up its diplomatic and commercial relations. \"The world is finally opening up to Cuba. Everyone wants to come taste the forbidden fruit. Everyone wants to discover it, savor it, enjoy it, explore it,\" said <mark>Mariela Castro</mark>, the daughter of President Raul Castro and a prominent gay-rights activist on the island. Other high-profile attendees included Hollywood stars Vin Diesel, Tilda Swinton and Geraldine Chaplin. Diesel is in town shooting the latest \"Fast and Furious\" action movie. Among the parade of visiting celebrities and top officials, the Rolling Stones also played a concert here last month after a visit by US President Barack Obama. Obama and Castro's December 2014 announcement of a rapprochement between their two countries has kindled new interest in Cuba, long isolated by a US embargo and its status as one of the last bastions of communism. In announcing the show, Chanel said that \"the cultural richness and the opening up of Cuba to the world have turned it into a source of inspiration .\" The show took place on an open-air catwalk on the Paseo del Prado, a long seaside boulevard in a scruffy neighborhood that got a deep makeover for the occasion. The opulence inside the tightly guarded venue stood in stark contrast with the poverty of the ordinary Cubans dressed in shorts and T-shirts peering in. The half-hour show ended with a brief appearance by Lagerfeld, dressed in his trademark gloves and a sequin jacket, who received a burst of applause and conga drums. \"Too nostalgic' The show was not entirely to local designer Idania del Rio's liking, however .\" It was very interesting and maybe too nostalgic. A lot of Cuban cigars, colors and hats from another era. It represented a Cuba that doesn't interest me right now, because today's Cuba is another, more contemporary Cuba, \"said the 33-year-old entrepreneur. For years, the communist principles that ruled in Cuba after revolutionary Fidel Castro won power in 1959 insisted on equality, even in clothing. Foreign brands were not available until the 1990s, when the market started to open up gradually. Cuba entered a crisis after the Soviet Union, which had financially supported its communist government, fell in 1991. Cubans had to wear imported second-hand clothes from state-run stores. Authorities called it\" recycled clothing \"but ordinary Cubans referred to their trips to the official shops as\" rag-shopping. \"With its cabarets and casinos frequented by US film stars and gangsters, pre-revolutionary Cuba had a thriving fashion scene. The end of the Soviet era encouraged a rebirth. The future of fashion will depend on if and when US lawmakers end the 54-year-old embargo--still in place despite the diplomatic thaw .\" When we become a normal country, without the embargo, we will be leaders of fashion, \"said Cuba's best-known living designer, Raul Castillo.", "articleID": "2016050408_00404421_W", "names": {"Mariela Castro": ["Q253736", "Q58031633"]}}, {"date": "2016-05-04", "url": "http://tewkesburyadmag.co.uk/news/14470423.Drive_to_recruit_more_firefighters_at_Pershore_Fire_Station/", "content": "Drive to recruit more firefighters at Pershore Fire Station On-call firefighter <mark>James Smith</mark>, checks equipment on a fire appliance / Vivien Mason, senior reporter / @ VivienMasonWN Share: 0 comments ON-call firefighters are being sought for Pershore Fire Station to provide cover both at the weekend and during the week. Hereford and Worcester Fire and Rescue Service will be holding an awareness session at the station on Tuesday May 10 for anyone interested in finding out more about the role. The session will be held at 6.30 pm. More information about the role can be obtained by registering an interest online through the fire service's latest vacancies section and then by coming along to the session. On-call firefighters must live or work within five minutes (actual travel time) of their local fire station and all recruits must be 18 or over at the date of joining. Station Commander Phil Berry said: \"We welcome interest from men and women who can get to the station within five minutes of being called and respond to an emergency. The role is a challenging yet extremely rewarding one which provides the local community with a vital service .\" Furthermore, it's also a chance to learn a range of new skills, such as accident prevention and first aid, which can be of real benefit in other areas of your life, whether at home or at work. \"<mark>James Smith</mark> has been an on-call firefighter at Pershore Fire Station for seven months. He said:\" ' I enjoy working as part of a team - it is great for your self confidence. \"Trainee on-call firefighters receive an annual retainer of between & pound; 1,651 to & pound; 2,202 plus extra pay for attending emergency call outs, and when fully trained can earn up to & pound; 8,000 a year, depending on the level of cover provided and the number of call-outs. Further details about the role of on-call firefighters can be found on the HWFRS website at www.hwfire.org.uk. Share: 0 comments", "articleID": "2016050413_00526200_W", "names": {"James Smith": ["Q1027519", "Q10464386", "Q16534411", "Q16885746", "Q20738160", "Q2389622", "Q37615128", "Q3808437", "Q39395048", "Q39502042", "Q43911922", "Q52440", "Q54557216", "Q56724422", "Q57903671", "Q5925871", "Q6143308", "Q6143312", "Q6143324", "Q6143330", "Q6143331", "Q6143337", "Q6143352", "Q6201315"]}}, {"date": "2016-05-04", "url": "http://www.bclocalnews.com/news/378152541.html#storyComments", "content": "Comox Valley community cleaned up well posted May 4, 2016 at 12:00 PM <mark>Terry Farrell</mark> Record staff The Comox Valley Community Clean-Up grew in 2016, not only in participation size, but also in the collective haul. Simultaneous clean-ups at various locations in the Valley accounted for a total of more than 33,000 pounds of trash being hauled to the dump, and accepted, free of charge. The inaugural Pick A Park aspect of the day was a great success, with dozens of people helping out at different locations, from the waterfront along Lazo Road (Point Holmes Recreation Association), to areas on Lake Trail Road (thanks to Comox Valley Land Trust and Morrison Streamkeepers), and many points in between. The Comox Valley Chamber of Commerce tidied Standard Park. The Comox Valley Pickleball Association adopted the Highland Park area. We Are Wildness, and Kindred Custom Snowboards converged on Farnham Road to clean that area together. We had neighbourhood groups cleaning up their areas (residents along Minto Road were responsible for gathering nearly a ton of garbage), and others who took on popular pathways, such as the Royston Trail (600 pounds picked up there). A crew of volunteers tackled a couple of troublesome spots along Piercy Road, picking up everything from couches to the burned out shell of a boat. Schools even got into the spirit of the event. Saltwater Waldorf School spent a day earlier in the week cleaning up an area west of the Comox Lake Dam. One group that did an outstanding job was the crew from the Fanny Bay area, as organized by James Barth and his Facebook group \"Stop Comox Valley Illegal Dumping .\" Approximately 20 people took ownership of an area at the end of Cook Creek Road and collected 9,900 pounds of garbage in just over four hours of work. Barth acknowledged members from the Comox Valley ATV Club, the Fanny Bay Community Association and even a group from Campbell River that came to lend a hand. \"I help them and they help me,\" Barth said of the Campbell River crew, members of a Facebook group called \"Keep Our Region Beautiful - Help Prevent Illegal Dumping .\" We had a bin supplied by B & D (Containers) - they dropped it off, they picked it up, driver was excellent to deal with, \"said Barth .\" And the CVRD was definitely a help, giving me tips on how to get it all done - that would have been Stephanie. So it went across very well. \"Barth said despite being familiar with the area, the amount of garbage picked up surprised him .\" I had absolutely no idea, \"he said .\" Within two hours, half the bin was full. It blew me away - just blew me away. \"Not to be outdone were the 39 Courtenay and District Fish and Game Protective Association members, who sent 22,500 pounds of garbage to the dump .\" One of the nice things that a lot of people noticed, is many of the areas that have been problem areas in the past weren't problems this year, \"said Courtenay and District Fish and Game Club caretaker Dave Munk. J.R. Edgett Excavating Ltd., donated a backhoe and truck, with drivers, for the day and Gary Marcus Trucking also supplied a truck and a backhoe, for the heavy lifting. Dim's Bins supplied a bin on-site at the F & G, free of charge, for easy dumping access, and Thrifty Foods went above and beyond, supplying free lunch for everyone who showed up at the Fish and Game clubhouse afterwards. We encourage an open exchange of ideas on this story's topic, but we ask you to follow our guidelines for respecting community standards. Personal attacks, inappropriate language, and off-topic comments may be removed, and comment privileges revoked, per our Terms of Use. Please see our FAQ if you have questions or concerns about using Facebook to comment.", "articleID": "2016050419_00576080_W", "names": {"Terry Farrell": ["Q15294046", "Q258612", "Q458881"]}}, {"date": "2016-05-06", "url": "http://illawarramercury.com.au/story/3891806/will-austinmer-stop-stay/?cs=300#disqus_thread", "content": "It is still unclear if Austinmer station will become a permanent stop on the South Coast rail timetable. It is still unclear if Austinmer station will become a permanent stop on the South Coast rail timetable. On March 7, Transport for NSW started a three-month trial of an extra stop at Austinmer station for 10 express services--five in the morning and five in the evening. That trial--which came after much pushing from Parliamentary Secretary for the Illawarra <mark>Gareth Ward</mark> - is due to end early next month. The signs are that the trial has been a success--the once-empty car park at Austinmer is now full on weekdays and there are reports of more than 40 people on the platform waiting for a train. In Friday's Mercury Keira MP Ryan Park praised the Austinmer trial but said the public needed to be told what will happen come June. \"The government has monitored car parks and this [trial] has proven to be a great success,\" Mr Park said. \"Opal ticketing and load factors have also been tracked. The Minister is aware that the load factors on our trains are well above capacity during peak periods .\" Anyone who has anything to do with public transport knows that. We want an update on how the trial is progressing and an announcement that the change will remain in place. \"A Transport for NSW spokeswoman declined to release any information it was using to determine the future of the Austinmer stop .\" We are analysing the data and feedback available and look forward to updating the community in due course, \"the spokeswoman said .\" A thorough assessment process will be carried out before any permanent changes are considered. \"Mr Park also suggested Transport for NSW could look at trialling a stop at another station--the Keira MP put forward Woonona. Comments from the Transport for NSW spokeswoman seem to indicate any trials of other stations was unlikely .\" Austinmer station is the best option for an extra stop on selected peak period services considering operational factors such as timetabling feasibility, journey times, and connectivity, \"she said.", "articleID": "2016050605_00378607_W", "names": {"Gareth Ward": ["Q5522990", "Q59259843"]}}, {"date": "2016-05-06", "url": "http://antiguaobserver.com/lara-says-return-of-bravo-pollard-vital-for-tri-nations/#respond", "content": "Latest: Plant Protection Unit makes another attempt at money for snail eradication <a href = \"http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a929a526 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src =\" http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=12 & cb=INSERT_RANDOM_NUMBER_HERE & n=a929a526' border =' 0' alt = \"/> </ a> <a href =\" http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a6763b0a & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src = \"http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=29 & cb=INSERT_RANDOM_NUMBER_HERE & n=a6763b0a' border =' 0' alt =\" /> </ a> <a href = \"http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a5e87b37 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src =\" http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=17 & cb=INSERT_RANDOM_NUMBER_HERE & n=a5e87b37' border =' 0' alt = \"/> </ a> Lara says return of Bravo, Pollard vital for Tri-Nations May 6, 2016CMC The Big Scores No comments New Story Batting legend Brian Lara wants to see the return of the likes of Kieron Pollard and Dwayne Bravo, for next month's Tri-Nations Series involving Australia and South Africa. Both players have been overlooked by selectors for One-Day Internationals since the controversial abandoned limited overs tour of India two years ago, but Lara said having them involved in Twenty20 Internationals alone was a backward step .\" In terms of the Tri-Nations, I think it's going to be a pretty exciting Tri-Nations series, \"the former West Indies captain said .\" And hopefully we can have the likes of Pollard and Bravo--some guys who have not played that form of the game [recently]--back in the team because they are integral to any West Indies team. \"Just to have them for the T20 version, I think, is doing a disservice to West Indies cricket .\" The non-selection of Pollard and Bravo have resulted in controversy over the last year, and was at the heart of an outburst by West Indies coach <mark>Phil Simmons</mark>, who claimed there was \"outside influence\" on selectors, in keeping them out of the squad. Bravo is a veteran of 164 ODIs, and is just 32 runs short of 3,000 runs and one wicket shy of 200 scalps in the format. Pollard, meanwhile, has struck three centuries in 91 ODIs, and taken 44 wickets with his slow medium. Under West Indies Cricket Board regulations, neither player is eligible for the tournament after failing to participate in January's Regional Super50. The Tri-Nations Series, which runs from June 3-26 in Guyana, St Kitts and Nevis and Barbados, will act as a precursor to a four-Test series against the powerful Indians starting in July. And Lara, who plundered 11,953 runs from 131 Tests, believes West Indies will have to be at their best against an in-form India side, despite having the advantage of home conditions. \"You saw their (India) performances against Australia...and not just in India, but also playing away from home; there have been great performances,\" Lara noted. \"I do believe that playing in home conditions is a slight advantage. I'm hoping that <mark>Phil Simmons</mark> is doing his homework [and] getting his players ready to play good Test cricket .\" For us, West Indians, we're not too disappointed if we get defeated playing hard cricket. I think what is very disappointing is when the team falls apart and we look like we don't know anything about cricket at all. \"West Indies are coming off their capture of the Twenty20 World Cup in India last month, where they beat England in the final to win the tournament for the second time in five years.", "articleID": "2016050609_00091886_W", "names": {"Phil Simmons": ["Q47434073", "Q6827914"]}}, {"date": "2016-05-06", "url": "http://abc7.com/news/what-aprils-jobs-report-means-for-college-grads/1326670/", "content": "NEWS What April's Jobs Report Means for College Grads ABCNews SUSANNA KIM Friday, May 06, 2016 09:05 AM Hiring in the U.S. slowed last month as employers added significantly fewer jobs than expected in April, but college grads are still about to enter the best job market in a decade. Employers added only 160,000 jobs in April, lower than the 200,000 many economists had predicted. The unemployment rate held steady at 5 percent, the Labor Department said today. Over the past three months, job gains have averaged 200,000 per month, with April's gains the weakest since last September. The Labor Department also revised down its employment figures in February and March by a combined 19,000. While the report may worry some economists, college grads entering the labor force can still remain optimistic. The unemployment rate for college graduates ages 25 and over as of April was 2.4 percent, the lowest level since June 2008. \"This year's graduating college seniors aren't looking at the monthly numbers so much, or the story of the day,\" said Mark Hamrick, Bankrate.com senior economic analyst. The addition of an average of 224,000 jobs per month over the past year is \"far above\" what is needed to keep up with normal growth in the labor force, said Gus Faucher, PNC deputy chief economist. Wage growth is also picking up as the job market tightens, which means higher starting pay, he explained. Students graduating with degrees in science, technology, engineering or business, should fare even better in the job market, Hamrick said. Labor force participation in April edged down a bit to 62.8 percent. \"That's not what we want to see, but also not a huge surprise,\" Hamrick said. On the positive side, there was a modest rise in wage growth with average hourly earnings up 2.5 percent over the past year. \"That's not a jackpot for American workers, but it is progress,\" he said. PNC chief economist Stuart Hoffman pointed out that there has been noteworthy job increases in nearly every sector but energy-related ones. He is upbeat on graduates entering the financial services industries, such as accounting, as well as those with science and engineering degrees. \"If your major is engineering in mining, obviously it's not a good time, but still those skills are applicable in a lot of industries,\" Hoffman said. Health care fields are another bright spot for graduating seniors. \"Four or five yeas ago, that was really tough job market particularly for younger people out of school. It's a much more hospitable, but not to say easy job market for recent or soon-to-be graduates,\" Hoffman said. \"I wouldn't take the April jobs report to be a bummer .\" Hoffman also expects the number of job listings to reach a record high. He added, \"I would say for graduating college and technical high school seniors, this is a promising job market to get started on their career .\" Related Topics: news abc news national (Copyright & copy; 2016 ABC News Internet Ventures .) Load Comments Please enable JavaScript to view comments. NEWS Newt Gingrich's Most Out-of-This-World Ideas Afghan Commandos Rescue 60 Hostages Held By Taliban Suspect dead following barricade in South Gate garage ANALYSIS: <mark>Paul Ryan</mark> Battling Trump for Soul of GOP More News Top Stories Attempted murder suspect smoked out after hours-long 91 Fwy standoff Stretch of 5 Fwy to be renamed for slain Downey officer Man's body found inside burning Fullerton home Suspect dead following barricade in South Gate garage Many without services after Frontier Communications takes over Verizon landlines Residents discuss 91 Freeway expansion project in Corona Man charged with stabbing 2-year-old girl to death Show More US employers added 160K jobs in April Lonnie Franklin Jr. found guilty in \"Grim Sleeper' case Arsenio Hall suing Sinead O'Connor over claims he supplied drugs to Prince Tow truck driver refuses to help Bernie Sanders supporter Homeless crisis growing in Los Angeles County, data shows More News Photos PHOTOS: 2016 Met Gala red carpet fashion PHOTOS: Monuments light up in purple to honor Prince See photos of Queen Elizabeth through the years in honor of her 90th birthday PHOTOS: Opening Day means new food at Dodger Stadium More Photos", "articleID": "2016050616_00137254_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2016-05-07", "url": "http://www.telegraph.co.uk/fashion/people/shane-watson-ott-red-carpet-dressing-only-works-if-youre-famous/", "content": "<mark>Shane Watson</mark>: \"OTT red carpet dressing only works if you're famous\" It takes a celeb like Sarah Jessica Parker to carry off a shorts suit on the red carpet Credit: Getty <mark>Shane Watson</mark> 7 May 2016 • 7:00 am This was the week of the Met Gala--the star-studded party hosted by American Vogue's Anna Wintour, which has become the most competitive red-carpet event in the social calendar. The theme was \"Fashion in an age of technology\" , a good excuse--if any were needed--for laser-cut-out dresses, metallic beading, nude panelling and very long trains. But the real theme, this year and every year, is \"Look and marvel, but don't even think of trying any of this yourself\". There were a lot of fashion tricks on display on the night that civilians might be tempted to incorporate in their own special occasion looks but that would--with about three exceptions--be a seriously bad idea. Here are the top 10 Do Not Try This At Homes. \"Never wear a shorts suit. Especially not at night .\" <mark>Shane Watson</mark> 1. Never wear gladiator sandals under any circs. I should know. I have not once, but twice, invested in them over the years only to discover that there is no occasion for which you can't find a better option. They look weird. They're not flattering (sometimes the flat suede ones, in a picture, with shorts, but when is that ever happening?). Not only that but they are a major faff to put on. You'll have missed the party before you've got it sorted out. Gladiator boots like Taylor Swift's are hard to pull off Credit: Getty 2. Cutouts, otherwise known as strategic holes in your clothes, should be great if you have the figure for them--but they are the opposite of elegant. Great for the beach, not for the ball. 3. Never wear a shorts suit. Especially not at night. You can wear a regular tuxedo, but it had better be amazing, and frankly spring is not the best time for it. 4. Trains and integral capes are ageing and peculiar and a bit Florence Foster Jenkins. A little pooling fishtail of a thing, maybe. \"If we never saw another leg jutting from a thigh split it would be too soon .\" <mark>Shane Watson</mark> 5. Beading makes you look fat. Always. It's similar to crochet like that. And it's hot and heavy, like wearing one of those lead tabards they put you in when X-raying you at the dentist. Excellent for parties in tents when there's snow on the ground, mind you. 6. Boots for evening, any boots, are, just as your mother always said, not suitable for evening wear and liable to make you look a bit \"working girl\". 7. The thigh-high split has been overdone and now it's just boring, especially as the wearer always feels obliged to get their money's worth and stick that leg out. If we never saw another leg jutting from a thigh split it would be too soon. Even celebs like Kim Kardashian should resist sticking their leg out of a thigh-high split on the red carpet Credit: Getty 8. At a black-tie do, short is the least attractive option. 9. Yellow is not the easiest colour at night, though Kate Moss's chiffon lemon yellow dress is our favourite thing she ever wore. 10. A few strips of nude panelling (to break up beaded armour) is fine. A lot of nude panelling makes everyone nervous and invites people to stare in the hope of slippage. Just don't do as they do, is the safest rule. READ MORE ABOUT: Met Gala Kate Moss Anna Wintour Florence Foster Jenkins Show more Don't Miss Gallery 07 May 2016, 7:15 am Gallery: 10 head-turning hats for every summer event you've got this season 07 May 2016, 7:05 am The 5 best things to buy this weekend 07 May 2016, 6:30 am Flower power! Why chintz is back in fashion 07 May 2016, 6:00 am Mrs Missoni: \"How I turned my family business into a & pound; 130million empire' 07 May 2016, 5:30 am Dolce & Gabbana takes #DGFamily to the London streets 06 May 2016, 3:14 pm\" You have to moisturise so it slips on \": Meet the woman behind Beyonce's latex dress 06 May 2016, 2:51 pm Dree Hemingway shows us how to wear a band t-shirt the grown-up way Gallery 06 May 2016, 1:59 pm Gallery: Basket bags: the summer staple that will make you feel like a Cannes film star", "articleID": "2016050707_00059061_W", "names": {"Shane Watson": ["Q2732224", "Q7488319"]}}, {"date": "2016-05-08", "url": "http://www.reuters.com/article/us-france-economy-moscovici-idUSKCN0XZ0O6", "content": "Markets | Sun May 8, 2016 12:48 pm EDT EU Commission likely to raise France growth forecast: Moscovici European Commissioner for Economic and Financial Affairs Pierre Moscovici speaks during a news conference with Portugal's Finance minister Mario Centeno (not pictured) in Lisbon, Portugal March 10, 2016. Reuters/Rafael Marchante PARIS The European Commission will probably raise its growth forecast for France from the 1.3 percent it predicted last week, European Economic and Monetary Affairs Commissioner Pierre Moscovici said on Sunday. \"There are improvements in terms of growth, it is slow, we had 1.2 percent in 2015, we have 1.3 percent for 2016, we have 1.7 percent for 2017, and the truth is we will probably adjust 2016 higher because the first quarter was better than the figures we incorporated in our initial forecast,\" he said, speaking on BFM TV. The euro zone as a whole is expected to grow 1.6 percent this year and 1.8 percent next year, after 1.7 percent in 2015, according to the figures published on Tuesday. The French economy grew a faster-than-expected 0.5 percent in the first quarter of the year, according to figures published by the INSEE national statistics agency on April 29. (Reporting by <mark>James Regan</mark> and Chine Labbe; Editing by Angus MacSwan)", "articleID": "2016050817_00302633_W", "names": {"James Regan": ["Q16225304", "Q6141937", "Q6141939"]}}, {"date": "2016-05-09", "url": "http://wgrz.com/news/nation-now/allen-penguins-must-return-fleury-to-net-for-game-6/180763144", "content": "<mark>Allen</mark>: Penguins must return Fleury to net for Game 6 <mark>Kevin Allen</mark>, USA TODAY Sports, WGRZ6:49 PM. EST May 08, 2016CONNECTTWEETLINKEDINGOOGLE + PINTEREST Rookie goalie <mark>Matt Murray</mark>'s .937 save percentage and 1.96 goals-against average have dramatically exceeded expectations in these playoffs and yet he isn't the Pittsburgh Penguins' best option in net. Veteran Marc-Andre Fleury should receive the start in Game 6 of the Penguins' series against the Washington Capitals. Pittsburgh leads the series 3-2 but returns home on Tuesday following a 3-1 loss. Coach <mark>Mike Sullivan</mark> hasn't said who will play, and went out of his way Sunday to praise <mark>Murray</mark>'s performance. \"(<mark>Murray</mark>) has provided the timely save for us throughout this playoff series,\" <mark>Sullivan</mark> said. \"We feel strongly that he gives us a chance to win .\" Although <mark>Murray</mark> gave up three goals on 19 shots against Washington in Game 5 on Saturday, it was not his fault that the Penguins lost. At 21, <mark>Murray</mark>'s poise and polish have been impressive. But there's more to consider. <mark>Murray</mark> has played 21 games in his NHL career. Fleury has appeared in more than 700. Fleury was 35-17-6 and had won nine of 10 starts before he went out with an injury. Fleury carried the Penguins when they were not playing well early this season. Fleury has 53 won playoff games in his career, and most important, one Stanley Cup championship. <mark>Murray</mark> doesn't deserve to sit. It's that Fleury deserves to play. This is still a veteran's league and veterans understand what needs to be done to close out a series. Leading 3-2 in the best-of-seven series, the Penguins need to put away the Capitals on Tuesday and not risk returning to Washington for Game 7. The Capitals looked quite dangerous on Saturday. They played with great energy. Alex Ovechkin showed determination. This is a team that feels as if they own the momentum now. If Fleury skates into that net in Game 6, the Penguins will get a lift. He's always been a popular player in Pittsburgh's dressing room. The only question Fleury is whether his game has rust after sitting out for 38 days. In the first round, when both Fleury and <mark>Murray</mark> were out, third-string goalie Jeff Zatkoff started his first game in 51 days and made 35 saves to lead the Penguins to a victory against the New York Rangers. While benching <mark>Murray</mark> may seem unfair after he has brought the team to within one victory of the Eastern Conference final, it's also unfair for an established player such as Fleury to lose the No. 1 job to an injury. In the near future, when the expansion draft is expected, the Penguins are going to have to choose between <mark>Murray</mark> and Fleury. Since <mark>Murray</mark> is 10 years younger and much cheaper, he will likely be the goalie they keep. <mark>Murray</mark> is their goalie tomorrow, but Fleury should still be their goalie today. GALLERY: BEST OF SECOND ROUND", "articleID": "2016050900_00158378_W", "names": {"Kevin Allen": ["Q28421808", "Q28556645", "Q561356", "Q6395712", "Q6395714", "Q6395715"]}}]