[{"date": "2016-05-09", "url": "http://wgrz.com/news/nation-now/allen-penguins-must-return-fleury-to-net-for-game-6/180763144", "content": "<mark>Allen</mark>: Penguins must return Fleury to net for Game 6 <mark>Kevin Allen</mark>, USA TODAY Sports, WGRZ6:49 PM. EST May 08, 2016CONNECTTWEETLINKEDINGOOGLE + PINTEREST Rookie goalie <mark>Matt Murray</mark>'s .937 save percentage and 1.96 goals-against average have dramatically exceeded expectations in these playoffs and yet he isn't the Pittsburgh Penguins' best option in net. Veteran Marc-Andre Fleury should receive the start in Game 6 of the Penguins' series against the Washington Capitals. Pittsburgh leads the series 3-2 but returns home on Tuesday following a 3-1 loss. Coach <mark>Mike Sullivan</mark> hasn't said who will play, and went out of his way Sunday to praise <mark>Murray</mark>'s performance. \"(<mark>Murray</mark>) has provided the timely save for us throughout this playoff series,\" <mark>Sullivan</mark> said. \"We feel strongly that he gives us a chance to win .\" Although <mark>Murray</mark> gave up three goals on 19 shots against Washington in Game 5 on Saturday, it was not his fault that the Penguins lost. At 21, <mark>Murray</mark>'s poise and polish have been impressive. But there's more to consider. <mark>Murray</mark> has played 21 games in his NHL career. Fleury has appeared in more than 700. Fleury was 35-17-6 and had won nine of 10 starts before he went out with an injury. Fleury carried the Penguins when they were not playing well early this season. Fleury has 53 won playoff games in his career, and most important, one Stanley Cup championship. <mark>Murray</mark> doesn't deserve to sit. It's that Fleury deserves to play. This is still a veteran's league and veterans understand what needs to be done to close out a series. Leading 3-2 in the best-of-seven series, the Penguins need to put away the Capitals on Tuesday and not risk returning to Washington for Game 7. The Capitals looked quite dangerous on Saturday. They played with great energy. Alex Ovechkin showed determination. This is a team that feels as if they own the momentum now. If Fleury skates into that net in Game 6, the Penguins will get a lift. He's always been a popular player in Pittsburgh's dressing room. The only question Fleury is whether his game has rust after sitting out for 38 days. In the first round, when both Fleury and <mark>Murray</mark> were out, third-string goalie Jeff Zatkoff started his first game in 51 days and made 35 saves to lead the Penguins to a victory against the New York Rangers. While benching <mark>Murray</mark> may seem unfair after he has brought the team to within one victory of the Eastern Conference final, it's also unfair for an established player such as Fleury to lose the No. 1 job to an injury. In the near future, when the expansion draft is expected, the Penguins are going to have to choose between <mark>Murray</mark> and Fleury. Since <mark>Murray</mark> is 10 years younger and much cheaper, he will likely be the goalie they keep. <mark>Murray</mark> is their goalie tomorrow, but Fleury should still be their goalie today. GALLERY: BEST OF SECOND ROUND", "articleID": "2016050900_00158378_W", "names": {"Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"], "Mike Sullivan": ["Q14950026", "Q1933555", "Q3313555", "Q6848980", "Q6848981", "Q6848982", "Q6848983", "Q6848986", "Q882921"]}}, {"date": "2016-05-09", "url": "http://www.independent.ie/sport/soccer/premier-league/irelands-harry-arter-hits-back-at-tony-pulis-claims-he-should-have-saw-red-against-west-brom-34697842.html", "content": "Independent. ie Monday 9 May 2016 Ireland's Harry Arter hits back at Tony Pulis' claims he should have saw red against West Brom EmailBournemouth's Harry Arter put in a combative display against West Brom on Saturday Republic of Ireland international Harry Arter has slammed Tony Pulis for claiming that he should have been sent off during Bournemouth's 1-1 draw with West Brom on Saturday. Share Comments The Baggies boss claimed Arter should have received two yellow cards and one red for three separate incidents in the game. The 26-year-old reacted angrily after being caught high in the leg by <mark>Gareth McAuley</mark> in the first half of the game and pushed the centre-half to the floor. Pulis also claimed that he should have saw yellow for a handball in the second period and red for a late challenge on <mark>Darren Fletcher</mark>. \"Harry Arter's a lucky boy tonight,\" Pulis said \"His push on <mark>McAuley</mark> first half was really a yellow card, the handball second half that stops us breaking was a yellow card, and his tackle on <mark>Fletcher</mark> is a straight red card but we finished the game 11 against 11 .\" Arter was clearly unimpressed with the comments and told the Bournemouth Echo: \"He should see the stud marks on my leg and he would probably think his player should have been sent off first .\" Mark Clattenburg said he would look at the footage because he wasn't sure if there had been a high foot. \"Their player apologised to me after the game because he said he caught me so maybe he (Pulis) should speak to his players before he comes out and speaks out loud .\" Arter will be hoping to be a part of <mark>Martin O'Neill</mark>'s squad for the upcoming friendly against the Netherlands on May 27 when it's announced on Thursday. Online Editors", "articleID": "2016050910_00275383_W", "names": {"Darren Fletcher": ["Q172792", "Q30122681"], "Gareth Mcauley": ["Q55362512", "Q933750"], "Martin O'Neill": ["Q16733787", "Q310263"]}}, {"date": "2016-05-10", "url": "http://northernpublicradio.org/post/us-attitudes-change-some-evangelicals-dig-others-adapt", "content": "As U.S. Attitudes Change, Some Evangelicals Dig In; Others Adapt By Tom Gjelten • 27 minutes ago Share Twitter Facebook Google + Email VIEW SLIDESHOW 1 of 2 The audience at last month's Together for the Gospel conference in Louisville, Ky.. cvi photography VIEW SLIDESHOW 2 of 2 Albert Mohler, president of the Southern Baptist Theological Seminary, is urging conservatives to put the \"protest\" back in Protestantism. Emil Handke / Southern Baptist Theological Seminary America's culture war, waged in recent years over gender roles, sexuality and the definition of marriage, is increasingly being fought inside evangelical Christian circles. On one side are the Christians determined to resist trends in secular society that appear to conflict with biblical teaching. On the other side are the evangelicals willing to live with those trends. For Albert Mohler, president of the Southern Baptist Theological Seminary in Louisville, Ky., the key question is \"whether or not there is a binding morality to which everyone is accountable .\" Mohler is a cofounder of the biannual Together for the Gospel conference, which brought together thousands of evangelicals last month at a sports center in Louisville, a few miles from the Southern Baptist campus. Electronic signs around the top of the arena carried such messages as \"We Were Born Out of Protest\" and \"We Stand On Scripture Alone, Not Man's Wisdom .\" \"Our theme for this year is,\" We Protest,' \"Mohler tells NPR .\" You might say [it's] putting the \"protest' back in Protestantism .\" He and his fellow conservative leaders urge Christians to take a \"biblical\" stand against such things as no-fault divorce, extramarital sex, transgenderism, and gay marriage. His new book is We Cannot Be Silent: Speaking Truth to a Culture Redefining Sex, Marriage, & the Very Meaning of Right & Wrong. Mohler and other conservatives are pushing against strong headwinds, however. Survey data show that the number of Americans who think divorce is morally acceptable has increased significantly in recent years, while disapproval of homosexuality and same-sex marriage has declined sharply. [Click to see changing attitudes on homosexuality and same-sex marriage by religion .] The latter holds true even for white evangelicals, among the groups most resistant to LGBT rights. For church leaders like Mohler, the challenge is unmistakable. \"Conservative Christians in America are undergoing a huge shift in the way we see ourselves in the world,\" Mohler says. \"We are on the losing side of a massive change that's not going to be reversed, in all likelihood, in our lifetimes .\" In his view, Christians must adapt to the changed cultural circumstance by finding a way \"to live faithfully in a world in which we're going to be a moral exception .\" (It is this goal, Mohler says, that explains the passage of \"religious liberty\" laws to protect people who want to express their opposition to same-sex marriage or transgenderism .) \"At Odds With What Everyday People Believe' Living as the moral exception was the prospect facing the Together for the Gospel attendees. Most were young men, training to be pastors in Southern Baptist churches. The Southern Baptists are one of the Protestant denominations that do not ordain women, even as church deacons. Some Southern Baptist congregations do not even allow divorced men to serve as pastors. Many in their millennial generation may reject conservative thinking on social issues, but the young men who choose to be Southern Baptist pastors have full knowledge of the church teachings. Their church mandate is somewhat limited: not to persuade the broader culture of new moral truths but rather to help their own congregants live their lives as a\" moral exception \"to the rest of society .\" The Bible makes claims about what is right and wrong, and those claims are often at odds with what everyday people believe, \"says Southern Baptist seminary student Joshua Van der Merwe, 24, of Louisville, during a break between conference sessions .\" Christians are called to protest and to witness to what the Bible claims to be right and wrong. \"An insistence on strict Bible-based standards of morality may exclude some of those everyday people, however. For them, one alternative is Ridgewood Baptist Church in a working-class suburb of Louisville. The pastor, <mark>Matt Johnson</mark>, grew up as a Southern Baptist, but his church is one of a group that broke from the Southern Baptist Convention about 25 years ago. It now serves a diverse congregation, and the men and women who make up <mark>Johnson</mark>'s lay advisory\" Dawnings \"committee advocate that it opens doors to everyday people .\" Let's offer words of hope, \"<mark>Johnson</mark> prayed at a recent Dawnings meeting .\" Hope for the future of what could happen here, who could come here and find a place to belong. \"The committee members included Janney Gilbert, a medical office manager whose son is gay, Estelle Power, a retired former deacon who became involved in the church after a painful divorce, and Janelle Perry, whose mother was the first female deacon at Ridgewood and who now serves as the church's youth director .\" I've been here all my life, and Ridgewood is not the same church we were 40 years ago, \"Perry says .\" Everyone can come. Some people are taken aback by that--[and] women deacons. And we'll let most anybody attend ....We're just open-armed. \"It is not that the church serves highly educated liberals who might be expected to support a progressive agenda. The surrounding community, according to <mark>Johnson</mark>, is\" a conservative area, with a lot of folks who feel disenfranchised. I'd say it represents the new face of poverty. \"The Role Of Women Economic stress can be hard on marriages, and Ridgewood's membership includes several people who have been divorced .\" I don't know what I would have done without this church, \"Power says .\" I felt I was the only person in the world that was going through a divorce. \"Now 76, Power says she has found others at Ridgewood whose lives didn't necessarily fit a church ideal. She can relate to them, she says, because of her own experience .\" I've made some friends, just saying hello, \"she says,\" and somebody would say, \"You're so kind .' I said,\" No, I'm just who I am .' But I do think that it makes you a little more humble when you go through something. \"Power grew up in rural Kentucky with divorced parents. Her father drank too much, but listened faithfully to Baptist preachers on the radio. Having heard bad things all her life about women who divorced, she welcomed the less judgmental attitude at Ridgewood .\" There are people who have stopped going to church because they think that all that church is is a place where you're being condemned, \"<mark>Johnson</mark> says,\" and where you're just told, \"This is what you have to think .'\" Such people, he says, are among those whom he now hopes to reach with his own ministry. The church's rupture with the Southern Baptist Convention was in a dispute over the role of women. Southern Baptists believe that men and women \"complement\" each other but are not interchangeable, which is why women are not allowed to serve in prominent church leadership roles. Mohler says the church position on complementary gender roles may seem outdated but comes straight from the Bible. \"It's an entire pattern of complementarity that we see woven throughout the account of scripture,\" he says, \"from Genesis 1:26 -28 all the way to the Book of Revelation. So it's not a minor matter to suggest that the church can somehow just update its understanding of gender. This is where we must be found faithful, regardless of the cultural understanding around us .\" More than 15 million Americans attend Southern Baptist churches. Many Christians yearn for the certainty and direction that come with a life based on a strict reading of the Bible. With the culture rapidly changing around them, however, the future of conservative evangelical Christianity is not clear. By contrast, the more moderate Baptist churches would seem to have an ever-growing market. On the other hand, some of the people who have soured on the Southern Baptist approach now reject church altogether. The evangelical Protestant share of the U.S. population is declining, so the growth prospects for a congregation like Ridgewood Baptist are also unclear. From the outside, with a cross prominently placed on the plain brick front, it looks like any other Baptist church in Louisville. <mark>Nick Wilson</mark>, the church pianist and most prominent gay member, says he would never have approached Ridgewood had he not heard it was a welcoming church. \"Driving by, seeing Ridgewood Baptist Church, I would not stop,\" he says. \"I would just assume that I already know what's going on inside those doors, and I'm not welcome, or I don't want to be part of it, and would go on .\" <mark>Nick Wilson</mark>'s story on being Baptist and gay will air on All Things Considered and publish online later today. Copyright 2016 NPR. To see more, visit NPR. View the discussion thread.", "articleID": "2016051009_00530807_W", "names": {"Matt Johnson": ["Q16227645", "Q1909207", "Q19874778", "Q21280798", "Q21621607", "Q25209047", "Q3299487", "Q3299489", "Q3299490", "Q3852014", "Q42116160", "Q43132123", "Q45293540", "Q6788852", "Q6788855", "Q6788856", "Q6788858"], "Nick Wilson": ["Q18631174", "Q2278624"]}}, {"date": "2016-05-10", "url": "http://cpapracticeadvisor.com/news/12206097/the-irs-is-hiring-agency-wants-700-more-agents-for-tax-enforcement", "content": "The IRS Is Hiring: Agency Wants 700 More Agents For Tax Enforcement <mark>Ken Berry</mark>, J.D. - CPA Practice Advisor Tax Correspondent On May 10, 2016 | Share | Share | Share Taxpayers may want to tread a little more carefully. After years of cutbacks, the IRS plans to add as many as 700 new staffers this year to chase after tax cheats. \"As we continue to operate with a constrained budget, an area of concern for all of us remains the significant decline in the number of employees across the IRS,\" said IRS Commissioner John on May 4 in an internal memo initially reported by the Wall Street Journal. \"With our budget down more than $900 million since 2010, there are unmet needs across the IRS and there have been few opportunities to hire new employees during the last six years .\" The numbers bear him out. Going back to Fiscal Year 2010 (FY2010), the number of revenue officers responsible for placing liens on taxpayer properties and forcing them to pay up has been slashed by 15 percent. Similarly, the workforce including revenue agents, who conducts audits of individual and business taxpayers, suffered a 16 percent reduction during the same time period. Furthermore, the audit rate for individuals dropped to 0.84 percent last year, its lowest level in more than a decade last year. This was the third consecutive year showing an audit rate of less than one percent. It's not like Congress hasn't been giving the IRS any money to operate, but the agency is constantly being pulled in different directions. Following five years of budget cuts, Congress upped the ante for FY2016 by $290 million, providing a total budget of $11.23 billion. However, most of those extra funds were earmarked for other uses, including improving taxpayer services and ID theft and security measures. Also, the IRS was recently tasked with enforcing penalties under the Affordable Care Act (ACA). In the memo, Koskinen said that the IRS reassessed its resources halfway through this fiscal year. It found that it had enough left in the coffers to hire between 600 and 700 new employees in the enforcement areas. \"Our first priority for hiring this year was to address taxpayer service,\" he noted. \"We were able to add more than 1,000 W & I employees to our taxpayer phone lines after Congress provided $290 million specifically for taxpayer service, identity theft and cybersecurity .\" The decision to hire many revenue officers and agents also factored in other aspects, including retirements and other employee departures. \"In previous years, job losses across the agency have helped us absorb the funding cuts we have received, but left us with large gaps in various areas across the agency,\" said Koskinen. \"This year, we've determined that we have the resources available to hire these employees as a result of the rate of attrition in enforcement and your continuing dedication to find efficiencies to help us with the budget .\" The IRS Commissioner claims that every dollar invested in the IRS returns at least $4 to the Treasury. He says the number is even higher when it involves enforcement. The first group of new-hires is expected to be announced in several weeks. The employees will be assigned to the department with oversight of self-employed taxpayers and small business owners. Other high-level enforcement positions will be filed later in the year. The news about the IRS hiring was met with mixed reactions. Some of our nation's lawmakers even questioned how the IRS was able to suddenly come up with the cash. \"It was only weeks ago that they were saying they did not have the money [to hire more employees] and today they do have the money?\" said House Oversight Committee Chairman Jason Chaffetz (R-UT) in an interview with FoxNews.com. Chaffetz said he will be sending a letter to Koskinen requesting a complete accounting of the matter.", "articleID": "2016051020_01682626_W", "names": {"Ken Berry": ["Q1609903", "Q1738578", "Q6387317"]}}, {"date": "2016-05-12", "url": "http://duluthnewstribune.com/news/4031539-benefit-be-held-superior-family-after-tragic-car-crash", "content": "Benefit to be held for Superior family after tragic car crash Benefit to be held for Superior family after tragic car crashDuluthMinnesota424 W. First St. 55802 A benefit will be held Sunday for the <mark>Jacinto</mark> family, owners of Guadalajara Mexican Restaurant in Superior. <mark>Juan Jacinto</mark> and his mother-in-law lost their lives in a car accident March 11 in Mexico. His wife, Maria, and their daughter, Jessica, were seriously injured. Money raised will help defray the family's medical and related expenses. Recommended for you Homeless youth on the rise in Duluth schools The event will run from 2:30 -5:30 p.m. at the restaurant in the Mariner Mall, 69 N. 28th St. According to Amigos de <mark>Juan Jacinto</mark>, a group of local residents are organizing the benefit, Maria suffered a spinal injury that required surgery. She has begun physical therapy and is able to move her fingers, hands and feet, but not her legs. Jessica broke both legs, her hip and collarbone. She is now out of her cast, according to group member Mark Androsky, but isn't walking unaided yet. The event is a time to remember a friend, Androsky said, and to help his family, which includes two teen sons living in Superior. \"I've been going to the restaurant for 10 years,\" Androsky said. \"My kids kind of grew up there .\" <mark>Juan Jacinto</mark> always greeted him as \"Se & ntilde; or Marco\" with a big smile, and took time to visit and show them around the business. \"He just worked all the time,\" Androsky said. \"He put his heart, soul and life into the restaurant .\" The business owner had a heart like a teddy bear and would give you the shirt off his back, he said. The community has responded in kind, with an outpouring of support and more than 25 silent auction prizes. The Amigos group hopes to double the number of prizes; additional silent auction items can be brought to the restaurant or mall office during business hours by Saturday. Sunday's event will begin with a prayer service and dedication at 2:30 p.m., followed by $1 tacos and a silent auction 3-5 p.m. Those unable to attend--but who would still like to help--can direct donations to Superior Choice Credit Union, Attn: <mark>Jacinto</mark> Family Benefit, 2817 Tower Avenue, Superior, WI 54880. Find more information on the Amigos de <mark>Juan Jacinto</mark> Facebook page. Recommended for you", "articleID": "2016051223_00544891_W", "names": {"Juan Jacinto": ["Q16218552", "Q6300054"]}}, {"date": "2016-05-13", "url": "http://www.post-gazette.com/news/world/2016/05/13/US-establishes-Libyan-outposts-with-eye-toward-offensive-against-Islamic-State/stories/201605130135", "content": "U.S. establishes Libyan outposts with eye toward offensive against Islamic State May 13, 2016 12:00 AM Abdullah Doma/AFP/Getty Images Col. Ahmed al-Masmari, spokesperson for the Libyan Armed Forces, gives a press conference in the eastern Libyan city of Benghazi on Wednesday. By Missy Ryan / The Washington Post American Special Operations troops have been stationed at two outposts in eastern and western Libya since late 2015, tasked with lining up local partners in advance of a possible offensive against the Islamic State group, U.S. officials said. Two teams totaling fewer than 25 troops are operating from around the cities of Misrata and Benghazi to identify potential allies among local armed factions and gather intelligence on threats, according to the officials, who spoke on the condition of anonymity. The insertion of a tiny group of U.S. personnel into a country rife with militant threats was viewed as reflecting the Obama administration's worries about IS's powerful Libyan branch and the widespread expectations of an expanded campaign against it. For months, the Pentagon has been developing plans for potential action against the group, which has at least several thousand fighters in the coastal city of Sirte and other areas. And the U.S. personnel, whose ongoing presence had not been previously reported, is a seen as sign of the acceleration toward another military campaign in Libya. The mission is also an illustration of President Barack Obama's reliance on elite units to advance counterterrorism goals in low-visibility operations. The activities of the American \"contact teams,\" as they are known, take place in parallel to those of elite allied forces from France and other European nations in the same areas, U.S. and Libyan officials said. Officials hope the special operators will ultimately have an outsize impact on the effectiveness of local forces. Special Operations forces in Syria, for instance, have been trying to guide opposition operations and help them capitalize on foreign air power as they advance on IS. \"These types of activities can be the difference between success and failure in what the administration refers to as areas outside of active hostilities,\" said William Wechsler, who was a senior Pentagon official overseeing Special Operations activities until last year. \"You're mapping local networks, both friendly and unfriendly .\" The U.S. troops, who began making visits to Libya last spring and established their twin outposts six months later, have been cultivating relationships among forces that are mobilizing for a possible assault against IS in its Sirte stronghold. Pentagon spokesman <mark>Peter Cook</mark> declined to provide specific information about the U.S. assessment teams. But he said that military personnel had been meeting periodically with a variety of Libyans \"in an effort to help them re-establish a safe and secure environment .\" The effort is part of a larger Obama administration strategy to bring Libya's feuding factions together behind a fragile new unity government, which officials believe is best positioned to combat IS. In Libya, a key element of the mission is identifying which factions will align themselves with the unity government. Since a civil conflict erupted in 2014, Libya has been dominated by two rival governments in the country's east and west. The Obama administration and its European allies are hoping the unity government, installed after U.N.-brokered peace talks, can end Libya's partition, which opened the door to extremists and plunged the oil-rich country into economic crisis. The troops also are assessing security conditions so that, if a broader mission takes place, the United States can move in additional personnel more safely. \"How do you avoid Libya becoming like Syria?\" said Paul Scharre, a former Army Ranger and Defense Department official who is now at the Center for a New American Security. \"This is one of the tools in your toolbox to stave that off .\" While IS is far smaller in Libya than its parent organization in Iraq and Syria, the group has used similar tactics to enforce its brutal version of Islam, including mass executions, and has launched attacks across the North African nation. \"We're obviously watching the threats very closely,\" a senior administration official said, also speaking on the condition of anonymity. If the White House does authorize a broader campaign in Libya, it is expected to be on a smaller scale than operations in Iraq and Syria. Apart from the ongoing air campaign against IS, the U.S. now has more than 5,000 troops on the ground in Iraq, and Mr. Obama recently expanded the Special Operations force in Syria. The U.S. has launched two airstrikes against IS targets in Libya since late 2015, but Pentagon officials have said they have identified dozens of other targets that might be hit if a more sustained operation takes place. An expanded mission in Libya will be forced to grapple with the same internal divisions that have undermined other foreign attempts to foster stability since 2011. In an illustration of those tribal and political fissures, the two forces preparing to advance on IS--militia forces loyal to Misrata and army troops under Gen. Khalifa Hifter--have clashed with each other. The Misratan forces recognize the unity government in Tripoli; those loyal to Gen. Hifter do not. Likewise, three separate factions have established separate command centers to oversee an offensive against IS in Sirte, including Gen. Hifter; the unity government; and an alternate prime minister in Tripoli, who continues to assert his authority. American officials fear that uncoordinated offensives will only afford IS an opportunity to grow stronger. At the same time, some officials privately complain that foreign support for eastern forces loyal to Gen. Hifter--including from U.S. allies France and Egypt--makes consolidation of the unity government's power more difficult. \"We have been working with our allies to urge focus on [IS] and not fueling rivalries across the country,\" a senior U.S. official said. Local factions are being asked to do the same, and \"as the [IS] threat becomes clearer and clearer, it becomes easier to find Libyans who are prepared to do that .\" The French Embassy in Washington, D.C., declined to comment on French military activity in Libya. \"Our priority in Libya is full support to the government and not support to a particular force,\" a French diplomatic official said. A spokeswoman for the Egyptian Embassy in Washington did not immediately respond to a request for comment. Military officials have sought to keep the ongoing presence of U.S. personnel quiet, in part because of Libyans' sensitivities about foreign troops and also because of the vulnerability of small teams operating in a country gripped by lawlessness. Benghazi was the site of the 2012 attacks that killed four Americans, including the U.S. ambassador. Last December, a visit by one team of special operators to far western Libya was made public when local militia forces took photos of the Americans with their assault rifles, grenade launchers and GPS devices. The U.S. personnel promptly departed. The Pentagon is seeking to enhance protection of its advance force from the sky. This year, Italy granted the U.S. permission to use Italian airfields to launch armed drone flights over Libya for defensive purposes. Mr. Wechsler said the Pentagon had been willing to accept the dangers faced by such teams because of the value they provided to subsequent military operations. \"When the military is dropping Hellfires from a drone, there is by design a zero percent chance of an American getting killed,\" Wechlser said. \"But when you're trying to do the important work to understand the human terrain and build up surrogates, the risk...can never be mitigated down to zero .\" ", "articleID": "2016051304_00120832_W", "names": {"Peter Cook": ["Q1249215", "Q18200544", "Q22996261", "Q30603187", "Q7173371", "Q7173373"]}}]