[{"date": "2016-05-13", "url": "http://www.whitsundaytimes.com.au/news/team-motivated-to-secure-victory-by-lifetime-membe/3025721/", "content": "The Foundation Cup Slade Point and Cities will play for. Popular Stories VOTE: Whitsundays on track for solar farm Is that a knife in your pants? Man charged in Airlie Beach Mayor declares conflict of interest over marina Local Real Estate Cars For Sale RUGBY UNION: It's set to be a clash between the titans in the forward packs during tomorrow's Mackay Rugby Union game. That's the opinion oft Mackay Cities assistant coach <mark>Ryan Turner</mark> thinks. Cities playing Slade Point in the first match of a three game series for the Foundation Cup (right). \"Last night at training our head coach Bruce Heggie brought out the Foundation Cup,\" <mark>Turner</mark> said. \"He spoke passionately about what it means to him and to us and to Slade Point as the two founding clubs .\" Bruce is a life member of Cities. He also arrived in Mackay a few years after the start of the competition started. \"This makes him one of the longest serving members in Mackay Rugby Union .\" The cup is between the two founding teams of the competition. <mark>Turner</mark> is confident the game will be decided by both team's forward packs. \"They have a big and strong forward pack and we have one to match,\" he said. \"So we will let the big boys battle it out for awhile before letting the backline come into the game .\" <mark>Turner</mark> believes experience in the backline will be a defining factor in the game. \"Slade Point has a young backline and they are talented,\" he said. \"I just think our boys have the experience to get the edge over them .\" Cities are coming off their first loss of the season, losing 18-7 to the Whitsunday Raiders. \"We don't take losses well,\" <mark>Turner</mark> said. \"Therefore we will be looking to bounce back .\" Game times Bowen Mudcrabs v Kuttabul Camelboks at Bowen at 3.30 pm Brothers v Whitsunday Raiders at Whitsunday at 4.30 pm Mackay Cities v Slade Point at Cathy Freeman Oval at 3.30 pm cathy freeman oval Read More Login to follow citites Read More Login to follow foundation cup Read More Login to follow mackay Read More Login to follow rugby union Read More Login to follow slade point Read More Login to follow sport Read More Login to follow Topics: cathy freeman oval, citites, foundation cup, mackay, rugby union, slade point, sport 0 PRINT Join the Community. Get your local news, your way. Sign Up Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now", "articleID": "2016051306_00638534_W", "names": {"Ryan Turner": ["Q28857180", "Q7384602"]}}, {"date": "2016-05-16", "url": "http://uk.reuters.com/article/us-health-who-glyphosate-idUKKCN0Y71HR", "content": "U.N. experts find weed killer glyphosate unlikely to cause cancer File photo of Monsanto's Roundup weedkiller atomizers seen on sale at a garden shop at Bonneuil-Sur-Marne near Paris, France, June 16, 2015. Reuters/Charles Platiau/Files LONDON May 16 The pesticide glyphosate, sold by Monsanto in its Roundup weed killer product and widely used in agriculture and by gardeners, is unlikely to cause cancer in people, according to a new safety review by United Nations health, agriculture and food experts. In a statement likely to intensify a row over its potential health impact, experts from the U.N.'s Food and Agriculture Organization (FAO) and World Health Organization (WHO) said glyphosate is \"unlikely to pose a carcinogenic risk to humans\" exposed to it through food. It is mostly used on crops. Having reviewed the scientific evidence, the joint WHO/FAO committee also said glyphosate is unlikely to be genotoxic in humans. In other words, it is not likely to have a destructive effect on cells' genetic material. Diazinon and malathion, two other pesticides reviewed by the committee, which met last week and published its conclusions on Monday, were also found to be unlikely to be carcinogenic. \"In view of the absence of carcinogenic potential in rodents at human-relevant doses and the absence of genotoxicity by the oral route in mammals, and considering the epidemiological evidence from occupational exposures, the meeting concluded that glyphosate is unlikely to pose a carcinogenic risk to humans from exposure through the diet,\" the committee said. Glyphosate is also \"unlikely to be genotoxic at anticipated dietary exposures\" , it added. The group reaffirmed an acceptable daily intake (ADI) of up to 1 milligram of glyphosate for every kilogram of body weight. CONTRADICTORY? The conclusions appear to contradict a finding by the WHO's Lyon-based International Agency for Research on Cancer (IARC), which in March 2015 said glyphosate is \"probably\" able to cause cancer in humans and classified it as a \"Group 2A' carcinogen. Seven months after the IARC review, the European Food Safety Authority (EFSA), an independent agency funded by the European Union, published a different assessment, saying glyphosate is\" unlikely to pose a carcinogenic hazard to humans \". The United States' Environmental Protection Agency (EPA), which first assessed glyphosate in 1986 and has reviewed it several times since then, had also previously concluded it has\" low toxicity for humans \". The differing findings thrust glyphosate into the centre of a row involving EU and U.S. politicians and regulators, the IARC experts, the WHO and environmental and agricultural scientists. The EU's pesticides committee is due to meet later this week to decide whether to re-license glyphosate. The U.S. EPA is being investigated for withdrawing a report saying the chemical is probably not carcinogenic. In a question-and-answer document issued alongside the joint FAO/WHO statement, the WHO denied that the conclusions by the joint group and by IARC were contradictory. It said they were\" different, yet complementary \", with the IARC assessment focussed on hazard while the other looked at risk .\" IARC reviews published studies to identify potential cancer hazards, \"the WHO said .\" It does not estimate the level of risk to the population associated with exposure to the hazard. \"In contrast, it said, the joint FAO/WHO committee looks at published and unpublished studies to assess the health risk to consumers from dietary exposure to pesticide residues in food. (Editing by <mark>Gareth Jones</mark>) More from Reuters Newsletters | Mobile Apps News and Media Division of Thomson Reuters Thomson Reuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on Reuters.com, video, mobile, and interactive television platforms. Thomson Reuters journalists are subject to an Editorial Handbook which requires fair presentation and disclosure of relevant interests. NYSE and AMEX quotes delayed by at least 20 minutes. Nasdaq delayed by at least 15 minutes. For a complete list of exchanges and delays, please click here. & copy; 2016 Reuters All Rights Reserved", "articleID": "2016051616_00447608_W", "names": {"Gareth Jones": ["Q15990091", "Q16194126", "Q25189125", "Q28766870", "Q304629", "Q30505322", "Q5522881", "Q5522882", "Q5522883", "Q5522885", "Q5522889", "Q57245256"]}}, {"date": "2016-05-17", "url": "http://skynews.com.au/news/world/asiapacific/2016/05/17/top-chinese-official-to-hear-hk-demands.html", "content": "A top-ranked Chinese official has begun a rare visit to Hong Kong vowing to listen to residents' political concerns, seeking to address increasingly strident calls in the city for greater autonomy or even independence from the mainland. The visit by Zhang Dejiang, the first by a senior Chinese figure since the 2014 Occupy democracy protests, was officially to attend an economic summit. However, his first comments addressed the hot button political issue of Hong Kong's relationship with China, a topic that has sparked fierce debate in the Asian financial hub. \"(I will listen to) all sectors of society's suggestions and demands on how...the country and Hong Kong should develop,\" Zhang told reporters at Hong Kong airport on Tuesday. Following the unsuccessful Occupy protests of 2014, a handful of activists have been calling for an outright breakaway from China, a move some say would imperil Hong Kong's economic and political future. \"These young people have no idea that they could be putting Hong Kong on a potentially dangerous collision course with the motherland and bringing an unmitigated disaster,\" wrote former top Hong Kong security official Regina Ip in a recent editorial in the state-run China Daily. Tensions in the city are high, with thousands police mobilised for Zhang's visit. Local media reported pavement bricks were being glued down to quell the prospect of violent protests while police were camping atop a mountain where a pro-democracy banner was hung two years ago. A banner demanding \"true universal suffrage\" was hung on a different mountaintop on Tuesday morning. \"(We) are facing a very great threat from China: Our culture, our language, our people...we are dying!\" Chan Ho-tin, the head of the newly-formed National party, told Reuters. \"Do (Hong Kong people) want to be a Chinese city or do they want to be an independent country? There are only two choices,\" said Chan, whose party is expected to contest legislative elections in September. <mark>Joshua Wong</mark>, another prominent young activist who launched a new political party called Demosisto this year, wouldn't rule out taking an independence line in upcoming campaigns. \"The problem with young people is that they are not 100 per cent preoccupied with economic considerations,\" said Michael Tien, a Hong Kong delegate to China's parliament, the National People's Congress, which Zhang heads. \"A lot of young people saying they don't want development, they want a better environment, they want better work-life balance, they want better quality of life .\" Authorities haven't ruled out taking action against pro-independence activists. \"Any suggestion that (Hong Kong) should be independent or any movement to advocate such independence...would be inconsistent with the legal status of Hong Kong,\" the Department of Justice told Reuters. The DOJ said it was watching for \"possible criminal activities\" and would \"closely monitor the situation, maintain close liaison with the relevant law enforcement agencies, and take such action as may be necessary\". Hong Kong authorities said the \"counter-terrorism security measures\" were needed to ensure the safety of dignitaries during the visit. Observers with close ties to Chinese officials say one of Zhang's priorities will be establishing relations with more moderate democrats to lower the heat. Reuters", "articleID": "2016051707_00663517_W", "names": {"Joshua Wong": ["Q12688635", "Q56320576", "Q9455382"]}}, {"date": "2016-05-17", "url": "http://www.dailypost.co.uk/news/north-wales-news/crash-left-freerunner-jack-bellis-11344512", "content": "A teenager famous for his free running, dare-devil stunts was left with potentially permanent brain damage after a car crashed while his best friend was at the wheel. <mark>Jack</mark> Bellis, 19, who has been pulling off stunts including scaling Chester Cathedral since he was 13, had to be sectioned under the Mental Health Act at one stage because his injuries had caused a personality disorder. Today, as the youth driving the vehicle - 19-year-old Jonathan <mark>Jack Williams</mark> - was sentenced to 28 months youth detention - his family spoke of their heartbreak at <mark>Jack</mark>'s ordeal. In a victim impact statement read to Mold Crown Court <mark>Jack</mark>'s mother said that it was difficult to know to what extent her son might improve, which was heart-breaking. She had found it very difficult to deal with the prospect of her son having changed for ever. In her statement, read by prosecutor David Mainstone, she said she had to come to terms with the realisation that he might not well get back to the way he was before the crash occurred. Stacey Oliver <mark>Jack</mark> Bellis suffered serious injuries in a head-on crash in Tanyfron in Wrexham He had started to improve and the family were also trying to come to terms with the possibility that his recovery would be a very long term proposition. It had been very difficult to see him on life support at Stoke, she travelled there every day and it had been easier for family to visit when he was transferred to Wrexham. She said that it had been upsetting for <mark>Jack</mark> himself to be in a mental health unit. He had been sectioned because he refused to co-operate. READ: WATCH: Freerunner <mark>Jack</mark> Bellis's incredible street acrobatics He had begun to talk and while his family could understand him it was difficult for other people to understand him. The effect of the crash had a massive impact on the family, she explained. <mark>Williams</mark>, of Bryn Awel, New Broughton, previously admitted causing serious injuries by driving his Ford Fiesta dangerously, as well as driving above the legal cannabis limit, having no insurance, licence or MOT. The crash happened on November 26 last year, when the Fiesta ran head-on into another vehicle on Heritage Way in Tanyfron, Wrexham. \"You very nearly killed him' Gareth Morris was driving properly on the correct side of the road when he saw the on-coming headlights of a car weaving from side to side. The car then crashed head-on into him causing serious injuries to all three. Both vehicles suffered\" catastrophic \"damage. It turned out that <mark>Williams</mark> had been smoking cannabis and had a level of 5.7 microgrammes compared to the legal limit of two. <mark>Jack</mark> Bellis had suffered severe injuries including an organic brain injury and spent five at the regional trauma unit at Stoke before being returned to the Wrexham Maelor Hospital where he was still an in-patient. He had been sectioned and was being treated at a specialist unit. Mr Mainstone said that it was very difficult to know the long term prognosis in view of the severity of the initial injury. He suffered a fractured spleen and other injuries. The court heard the two had grown up together, were firm friends and remained so, and the defendant continued to visit him. Mr Morris had difficulty sleeping and suffered flash-backs, and was thousands of pounds out of pocket following the crash. Judge Rowlands said that the case should serve as a lesson of the dangers of drug driving, which could have very serious consequences. <mark>Williams</mark> would have to live with the fact that he caused such dreadful injuries to <mark>Jack</mark> Bellis that night as a result of his irresponsibility .\" You very nearly killed him, \"the judge said .\" He suffered life-changing injuries. \"\"Guilt will stay with you for rest of your life' The view captured by <mark>Jack</mark> Bellis from the top of Rhyl's SkyTower during one of his stunts Judge Rowlands said that judging from the photographs of the vehicles after the collision\" it was the greatest good fortune that the injuries were not worse, if not fatal, for all three involved, \"he said .\" This is an extremely serious offence when you caused serious injury by driving dangerously when you were not in a fit state because you had smoked cannabis and were over the limit for doing so, \"he explained. Peter Barnett, defending, said that his client and <mark>Jack</mark> Bellis had been friends most of their lives and had bought the Fiesta together in order to do up and make some money. READ: WATCH: Daredevil Wrexham teen slammed after filming himself scaling 120ft cathedral tower Both went out that night, it was by chance that <mark>Williams</mark> was behind the wheel. It was aggravated by the fact that he had smoked cannabis and by the condition of the vehicle. An investigation showed the road surface was inadequate and there had been several collisions due to its condition - but his client accepted his responsibility. There was no excessive speed, the combined impact speed was between 40 and 50 mph. The collision caused catastrophic damage which had severe consequences, his friend had been left with brain damage, the other driver was injured, and his own client had received broken bones and other injuries, had been in hospital eight weeks and now still used a crutch. He himself had effectively been a prisoner in his own home and slept on a bed in the living room because of his own mobility problems. The fact that he had caused his friend such serious injuries would be with him for the rest of his life. He was not particularly mature, was naive and probably at the time of the offence he probably did not appreciate the danger he was putting himself and his best friend in, Mr Barnett said.", "articleID": "2016051712_00379082_W", "names": {"Jack Williams": ["Q21063370", "Q21665118", "Q39078979", "Q55362692", "Q57887052", "Q6115801", "Q6115805"]}}, {"date": "2016-05-17", "url": "http://out.com/hit-list/2016/5/17/pop-sisters-tegan-sara-break-new-queer-ground", "content": "Pop Sisters Tegan & Sara Break New (Queer) Ground The duo has left moody alt-rock behind for greener pastures: mainstream pop By Steven J. Horowitz Tue, 2016-05-17 10:27 Photography by Benedict Evans. Styling by <mark>Alison Brooks</mark>. Tegan (left) and Sara Quin. Sara: Shirt by <mark>Tony Ward</mark> available at Church Boutique LA.. Jacket by <mark>Marc Jacobs</mark>. Tegan: Shirt by <mark>Tony Ward</mark> available at Church Boutique LA.. Jacket by JET available at John Eshaya. Left: Tegan: Shirt by Rag & Bone. Forging a career that transgresses the boundaries of alternative rock and dives into infectious pop is new ground for Tegan and Sara. Often pegged to their labels--lesbians, identical twins, Canadian--the duo have spent nearly 20 years eclipsing what's on the surface by focusing on their sound and message, gradually progressing from bedroom four-trackers to moody indie blowouts to their most ambitious incarnation yet: candy-striped, ’80s - indebted, queer-leaning New Wave that, instead of fetishizing sexuality, normalizes it. On their eighth album, Love You to Death, the duo take the rocky experiences from real-life relationships and send them up the flagpole in the hopes of finally cracking the mainstream. Though they're the most prominent contemporary gay female act to scale the charts (their 2013 album, Heartthrob, debuted at number 3 on the Billboard 200), the 35-year-old songwriters have still spent most of their career as outsiders. But proud ones. Female artists such as Lady Gaga, Halsey, and Nicki Minaj have bent the spectrum of sexuality in pop culture but limited it to just one facet of their public persona. Tegan and Sara Quin have become torchbearers forpost -' 00s queerdom in music. Where the Calgary, Alberta, natives have excelled is in their readiness to take anecdotes from their personal lives and push them to the forefront, something they've done since signing to <mark>Neil Young</mark>'s Vapor Records in 1999. \"A lot of our career, it felt really natural to be open about the fact that I was queer,\" says Sara. \"I don't have to think very hard about relating to a song about a straight man. I don't understand why the world can't relate to a song written by a queer woman. I'm writing about the same shit everyone is writing about. I just happen to be a girl who identifies as queer .\" With Love You to Death, out June 3 on Vapor/Warner Bros., their openness takes on added dimensions. Having invited superproducer Greg Kurstin (Adele, Sia) to partake in the recording process for the whole album--a first for the pair--they tackle a complex kaleidoscope of relationships, particularly the one they share as twins. Until now they've been relatively private about the friction between them, which nearly tore the duo apart around the release of 2007's The Con (their fifth album and first to chart) and led to literal blows and long stretches when they wouldn't speak to each other. \"I think Sara and I spent a lot of years compromising, and I think that fueled a lot of the anger and resentment and frustration and isolation that we experienced in our band,\" says Tegan. The song on Love that addresses the ripples in their sisterhood most explicitly is \"100x,\" a stark piano ballad written by Sara: \"It was cruel of me to do what I did to you / It was wrong of me to hurt such a big part of you,\" they harmonize. Pants by Veronica Beard available at Saks Fifth Avenue. Jacket available at Church Boutique LA.. Sara: Shirt by Rag & Bone. Pants by Sandro available at Bloomingdale's. Jacket by Mossimo for Target. \"We are doing much better, but old habits die hard,\" says Sara. They went to therapy at one point and are finally at a place where they can listen to each other before reacting. \"There are days where I imagine opening the car door and pushing Tegan out, but I just think to myself, We're 35 and grown-ups, and we've acquired skills, in our personal and romantic relationships as well as our professional relationships. Now that we've put that era behind us, I think it's actually quite healing to talk about it .\" Their improved communication has also freed them to focus more on staking uncharted sonic territory. Just two albums ago, with 2009's Sainthood, they inhabited a space in alternative music where people often crassly exoticized their otherness: \"People asked us if we were incestuous,\" recalls Sara. With that record's follow-up, Heartthrob, they kept their approach to lyricism the same but shifted the tone, working mostly with Kurstin to tighten its pop structures and fold in synthetic sounds. On Love they're making a bid for a bigger fan base, something they've been edging toward for years. \"We deserve to be there,\" says Tegan. \"We're working just as hard as everybody else, and I want to blow that fuckin' door open, just like so many artists before us did .\" Many have already embraced them. In 2014 they opened for Katy Perry on her Prismatic tour, and last year they performed their song \"Everything Is Awesome\" (from The Lego Movie) at the Academy Awards with Andy Samberg's band, the Lonely Island, and Questlove. Their hummable, Windex-wiped new single \"Boyfriend\" is about dating a woman who's never been with another woman, inspired by the beginning of Sara's romance with her current girlfriend--and it's just as capable of being slotted into a radio playlist as anything from Taylor Swift. While queer male pop stars like <mark>Sam Smith</mark>, Troye Sivan, and Years and Years's Olly Alexander have seamlessly won over large swaths of pop fans with their confessional same-sex love songs, Tegan and Sara are hoping to level the playing field and do the same. \"If Katy Perry can open the door for artists like us, then we can open the door for some of those <mark>young</mark> kids to start to think about their gender and their sexuality,\" says Tegan. \"That feels really important .\" Tegan and Sara will release their new album, Love You to Death, on June 8. Like what you see here? Subscribe and be the first to receive the latest issue of OUT. Subscribe to print here and receive a complimentary digital subscription.", "articleID": "2016051714_00549156_W", "names": {"Alison Brooks": ["Q13033980", "Q4727039"], "Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"], "Neil Young": ["Q1361496", "Q16104585", "Q1974908", "Q48841251", "Q6265210", "Q633", "Q6989513", "Q6989515"], "Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"], "Tony Ward": ["Q18353292", "Q2577525", "Q3531929", "Q7823646", "Q7823647", "Q7823648"]}}, {"date": "2016-05-17", "url": "http://boltsbythebay.com/2016/05/17/tampa-bay-lightning-andrei-vasilevskiy-stood-strong-despite-loss/", "content": "Tampa Bay Lightning G Andrei Vasilevskiy Has Stood Strong Despite Loss Comment Despite losing Game 2 of the Eastern Conference Final to the Pittsburgh Penguins, Tampa Bay Lightning goaltender Andrei Vasilevskiy has stood strong in net. The Tampa Bay Lightning may have come up short in Game 2 of the Eastern Conference Final against the Pittsburgh Penguins, but it certainly was not for a lack of effort by Lightning goaltender. If anything, he is the one who consistently stood strong and really came up big when his team needed him. Andrei Vasilevskiy Andrei Vasilevskiy had a rocky start to the 2015-16 season. Just before the preseason started, Andrei Vasilevskiy was diagnosed with a blood clot near his collarbone, the same injury currently plaguing Lightning captain, which required him to have surgery and miss the whole of the preseason and the first full month of the regular season. Steven Stamkos Vasilevskiy didn't see near as many starts this season as Lightning goaltender, but in order to keep away the rust, the 21-year-old Russian netminder was sent down to the Tampa Bay Lightning's American Hockey League affiliate, the Syracuse Crunch, in order for him to get some playing time. <mark>Ben Bishop</mark> More News at Bolts by the Bay In the 24 games he was able to play in with the Tampa Bay Lightning this season, he maintained a record of 11-10-0 with a Goals Against Average of 2.76 and a Save Percentage of .910. These may not look like spectacular numbers. Being honest, they really aren't; however, there were a number of games where the Lightning came up short and the onus of the loss did not fall on the goaltender. This brings us to the postseason. Vasilevskiy has only taken the ice for three games thus far in the postseason. The second of those games came after the entire Tampa Bay Lightning fan base ceased to breathe for a few minutes when Lightning goaltender <mark>Ben Bishop</mark> was injured in the latter moments of the first period of Game 1 against the Pittsburgh Penguins at the Consol Energy Center in Pittsburgh. In relief of <mark>Ben Bishop</mark>, Vasilevskiy only allowed one goal to get past him and into the back of the net. This was the power play goal scored by Penguins right wing in the final minute of the second period. Andrei Vasilevskiy was able to stop 25 of the 26 shots brought against him, giving Vasilevskiy a Save Percentage of .962. Patric Hornqvist Now, we find ourselves on Monday night when the Lightning would once again make their way into the Consol Energy Center in order to take on the Pittsburgh Penguins in Game 2 of the Eastern Conference Final. As expected, <mark>Ben Bishop</mark> would sit this game out while he allowed his injury to heal a little bit more. This would give Vasilevskiy the start. After a pretty intense first period, which saw the Lightning and the Penguins score two goals apiece, the Tampa Bay Lightning seemed to fall flat, allowing the Penguins to walk right into the offensive zone unopposed and failed to capitalize on a number of good scoring chances. The Lightning would be able to push the Penguins into overtime. Unfortunately, a defensive miscue allowed Penguins captain to score his first career postseason overtime goal and split the series down the middle. It was quite clear when the goal horn sounded that Vasilevskiy wasn't pleased and he quickly made his way off the ice and down the tunnel to the Tampa Bay Lightning locker room. Sidney Crosby More lightning: The Jersey Restriction Argument Is In Full Force Again Being completely honest, we can't blame Vasy for being upset. For a good portion of the game, he had next to no help in front of the net. This was noticeably strange given the way the Tampa Bay Lightning defense has improved over the course of the season. While the Tampa Bay Lightning only brought a total of 21 shots against Penguins goaltender over the course of the game, the Penguins bombarded Andrei Vasilevskiy with 41 shots on goal, of which he was able to turn away 38 of those shots. <mark>Matt Murray</mark> Here is a look at one of the amazing saves Vasilevskiy made against the Penguins on Monday night. It involved the young Russian netminder sliding clear across the crease in order to rob Sidney Crosby on a backhander that went right into the glove of Vasilevskiy. Andrei Vasilevskiy's 38 save night gave him a Save Percentage of .927. Adding these numbers into his postseason totals, Vasilevskiy now has a Goals Allowed Average of 1.74 and a Save Percentage of .947. These numbers put him in league with goaltenders like Washington Capitals netminder Braden Holtby. Unsurprisingly, it is more than just Tampa Bay Lightning fans who are showering Vasilevskiy with praise. <mark>Joe Smith</mark> of the Tampa Bay Times had an opportunity to speak with Tampa Bay Lightning Head Coach <mark>Jon Cooper</mark> after the game. <mark>Cooper</mark> had nothing but good things to say about his 1A plus goaltender. \"You never want to lose your No 1 guy in Bish. But we've got 1A + behind him. He was outstanding tonight .\" <mark>Cooper</mark> said via <mark>Smith</mark>. \"He was probably the reason the game went into overtime in the first place .\" also via <mark>Joe Smith</mark>. Coach <mark>Cooper</mark> wasn't the only one showering praise on the young Russian netminder. Recently returned Lightning defenseman has nothing put positive things to say about his teammate. Anton Stralman \"He was tremendous. He played like he's done nothing else but play in playoff games. It was fun to see .\" Stralman told <mark>Joe Smith</mark>. The Tampa Bay Lightning have a long road ahead of them. The last time these two teams met in the postseason it took all seven games to decide a victor. Given the way this series has started out, there is a good chance the Lightning will be faced with the same challenge. The good news is, the next two games will be played right here in the Bolts Nation. <mark>Ben Bishop</mark> is currently listed as day-to-day. There is a chance he may be ready to go when the Lightning take the ice for Game 3 of the Eastern Conference Final. On the bright side, if <mark>Bishop</mark> isn't quite ready to go, at least Lightning fans know they have someone like Andrei Vasilevsky in net who can stand up to players like Sidney Crosby and. Evgeni Malkin Next: Lightning Look To Regain Momentum In Game 3 As we mentioned before, the Tampa Bay Lightning will be back in action on Wednesday night at the Amalie Arena in Tampa. The puck is scheduled to drop at 8:00 p.m.. If you can't make it to the game, you can always catch the live broadcast of the encounter on the NBC Sports Network. Should you desire to listen to Dave Mishkin make the call instead, all you need to do is tune into 970WFLA. More NHL coverage from FanSided: Top Stories", "articleID": "2016051716_00747971_W", "names": {"Ben Bishop": ["Q12956342", "Q816445"]}}]