[{"date": "2016-05-17", "url": "http://boltsbythebay.com/2016/05/17/tampa-bay-lightning-andrei-vasilevskiy-stood-strong-despite-loss/", "content": "Tampa Bay Lightning G Andrei Vasilevskiy Has Stood Strong Despite Loss Comment Despite losing Game 2 of the Eastern Conference Final to the Pittsburgh Penguins, Tampa Bay Lightning goaltender Andrei Vasilevskiy has stood strong in net. The Tampa Bay Lightning may have come up short in Game 2 of the Eastern Conference Final against the Pittsburgh Penguins, but it certainly was not for a lack of effort by Lightning goaltender. If anything, he is the one who consistently stood strong and really came up big when his team needed him. Andrei Vasilevskiy Andrei Vasilevskiy had a rocky start to the 2015-16 season. Just before the preseason started, Andrei Vasilevskiy was diagnosed with a blood clot near his collarbone, the same injury currently plaguing Lightning captain, which required him to have surgery and miss the whole of the preseason and the first full month of the regular season. Steven Stamkos Vasilevskiy didn't see near as many starts this season as Lightning goaltender, but in order to keep away the rust, the 21-year-old Russian netminder was sent down to the Tampa Bay Lightning's American Hockey League affiliate, the Syracuse Crunch, in order for him to get some playing time. <mark>Ben Bishop</mark> More News at Bolts by the Bay In the 24 games he was able to play in with the Tampa Bay Lightning this season, he maintained a record of 11-10-0 with a Goals Against Average of 2.76 and a Save Percentage of .910. These may not look like spectacular numbers. Being honest, they really aren't; however, there were a number of games where the Lightning came up short and the onus of the loss did not fall on the goaltender. This brings us to the postseason. Vasilevskiy has only taken the ice for three games thus far in the postseason. The second of those games came after the entire Tampa Bay Lightning fan base ceased to breathe for a few minutes when Lightning goaltender <mark>Ben Bishop</mark> was injured in the latter moments of the first period of Game 1 against the Pittsburgh Penguins at the Consol Energy Center in Pittsburgh. In relief of <mark>Ben Bishop</mark>, Vasilevskiy only allowed one goal to get past him and into the back of the net. This was the power play goal scored by Penguins right wing in the final minute of the second period. Andrei Vasilevskiy was able to stop 25 of the 26 shots brought against him, giving Vasilevskiy a Save Percentage of .962. Patric Hornqvist Now, we find ourselves on Monday night when the Lightning would once again make their way into the Consol Energy Center in order to take on the Pittsburgh Penguins in Game 2 of the Eastern Conference Final. As expected, <mark>Ben Bishop</mark> would sit this game out while he allowed his injury to heal a little bit more. This would give Vasilevskiy the start. After a pretty intense first period, which saw the Lightning and the Penguins score two goals apiece, the Tampa Bay Lightning seemed to fall flat, allowing the Penguins to walk right into the offensive zone unopposed and failed to capitalize on a number of good scoring chances. The Lightning would be able to push the Penguins into overtime. Unfortunately, a defensive miscue allowed Penguins captain to score his first career postseason overtime goal and split the series down the middle. It was quite clear when the goal horn sounded that Vasilevskiy wasn't pleased and he quickly made his way off the ice and down the tunnel to the Tampa Bay Lightning locker room. Sidney Crosby More lightning: The Jersey Restriction Argument Is In Full Force Again Being completely honest, we can't blame Vasy for being upset. For a good portion of the game, he had next to no help in front of the net. This was noticeably strange given the way the Tampa Bay Lightning defense has improved over the course of the season. While the Tampa Bay Lightning only brought a total of 21 shots against Penguins goaltender over the course of the game, the Penguins bombarded Andrei Vasilevskiy with 41 shots on goal, of which he was able to turn away 38 of those shots. <mark>Matt Murray</mark> Here is a look at one of the amazing saves Vasilevskiy made against the Penguins on Monday night. It involved the young Russian netminder sliding clear across the crease in order to rob Sidney Crosby on a backhander that went right into the glove of Vasilevskiy. Andrei Vasilevskiy's 38 save night gave him a Save Percentage of .927. Adding these numbers into his postseason totals, Vasilevskiy now has a Goals Allowed Average of 1.74 and a Save Percentage of .947. These numbers put him in league with goaltenders like Washington Capitals netminder Braden Holtby. Unsurprisingly, it is more than just Tampa Bay Lightning fans who are showering Vasilevskiy with praise. <mark>Joe Smith</mark> of the Tampa Bay Times had an opportunity to speak with Tampa Bay Lightning Head Coach <mark>Jon Cooper</mark> after the game. <mark>Cooper</mark> had nothing but good things to say about his 1A plus goaltender. \"You never want to lose your No 1 guy in Bish. But we've got 1A + behind him. He was outstanding tonight .\" <mark>Cooper</mark> said via <mark>Smith</mark>. \"He was probably the reason the game went into overtime in the first place .\" also via <mark>Joe Smith</mark>. Coach <mark>Cooper</mark> wasn't the only one showering praise on the young Russian netminder. Recently returned Lightning defenseman has nothing put positive things to say about his teammate. Anton Stralman \"He was tremendous. He played like he's done nothing else but play in playoff games. It was fun to see .\" Stralman told <mark>Joe Smith</mark>. The Tampa Bay Lightning have a long road ahead of them. The last time these two teams met in the postseason it took all seven games to decide a victor. Given the way this series has started out, there is a good chance the Lightning will be faced with the same challenge. The good news is, the next two games will be played right here in the Bolts Nation. <mark>Ben Bishop</mark> is currently listed as day-to-day. There is a chance he may be ready to go when the Lightning take the ice for Game 3 of the Eastern Conference Final. On the bright side, if <mark>Bishop</mark> isn't quite ready to go, at least Lightning fans know they have someone like Andrei Vasilevsky in net who can stand up to players like Sidney Crosby and. Evgeni Malkin Next: Lightning Look To Regain Momentum In Game 3 As we mentioned before, the Tampa Bay Lightning will be back in action on Wednesday night at the Amalie Arena in Tampa. The puck is scheduled to drop at 8:00 p.m.. If you can't make it to the game, you can always catch the live broadcast of the encounter on the NBC Sports Network. Should you desire to listen to Dave Mishkin make the call instead, all you need to do is tune into 970WFLA. More NHL coverage from FanSided: Top Stories", "articleID": "2016051716_00747971_W", "names": {"Joe Smith": ["Q16094198", "Q20981949", "Q22670690", "Q23662319", "Q3180189", "Q3808717", "Q42715286", "Q511111", "Q6212404", "Q6212410", "Q6212412", "Q6212415"], "Jon Cooper": ["Q16196878", "Q3183185"], "Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"]}}, {"date": "2016-05-19", "url": "http://timesunion.com/tuplus-sports/article/Rain-could-benefit-Nyquist-s-challenger-in-7669621.php", "content": "http: //www.timesunion.com/tuplus-sports/article/Rain-could-benefit-Nyquist-s-challenger-in-7669621.php Rain could benefit Nyquist's challenger in Preakness Exaggerator, second in the Kentucky Derby, has proven he can win on a sloppy track By Tim Wilkin Updated 8:18 pm, Wednesday, May 18, 2016 Photo: <mark>Patrick</mark> Semansky Image 1of/36 Caption Close Image 1 of 36 A groom washes Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) A groom washes Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Photo: <mark>Patrick</mark> Semansky Image 2 of 36 BALTIMORE, MD - MAY 18: Preakness contender Laoban is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less BALTIMORE, MD - MAY 18: Preakness contender Laoban is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 3 of 36 BALTIMORE, MD - MAY 18: Exaggerator trainer Keith Desormeaux looks on after watching a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less BALTIMORE, MD - MAY 18: Exaggerator trainer Keith Desormeaux looks on after watching a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore,...more Photo: <mark>Patrick Smith</mark> Image 4 of 36 Preakness Stakes hopeful Collected is led to the track for a morning jog by assistant trainer Jimmy Barnes at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. Exercise rider George Alvarez is in the saddle. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) less Preakness Stakes hopeful Collected is led to the track for a morning jog by assistant trainer Jimmy Barnes at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. Exercise rider George Alvarez is in the...more Photo: <mark>Garry Jones</mark> Image 5 of 36 BALTIMORE, MD - MAY 18: Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less BALTIMORE, MD - MAY 18: Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in...more Photo: <mark>Patrick Smith</mark> Image 6 of 36 A horse is bath in the barn area days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) A horse is bath in the barn area days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) Photo: <mark>Patrick Smith</mark> Image 7 of 36 A man walks through rows of empty seats during a training session days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. A man walks through rows of empty seats during a training session days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. Photo: <mark>Patrick Smith</mark> Image 8 of 36 Preakness contender Collected is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Preakness contender Collected is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 9 of 36 A horse trains in front of a \"Preakness' sign days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. A horse trains in front of a\" Preakness' sign days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. Photo: <mark>Patrick Smith</mark> Image 10 of 36 Gary Sherlock, who trains Preakness Stakes hopeful Uncle Lino, listens to a story outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) MDGJ101 less Gary Sherlock, who trains Preakness Stakes hopeful Uncle Lino, listens to a story outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled...more Photo: <mark>Garry Jones</mark> Image 11 of 36 Horses walk in front of row-homes as they train on track days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Horses walk in front of row-homes as they train on track days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 12 of 36 Trainer Keith Desormeaux, who will saddle Exaggerator in the 141st Preakness Stakes, shares a laugh outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016 in Baltimore. The Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) less Trainer Keith Desormeaux, who will saddle Exaggerator in the 141st Preakness Stakes, shares a laugh outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016 in Baltimore. The Preakness Stakes is...more Photo: <mark>Garry Jones</mark> Image 13 of 36 Trainer Keith Desormeaux walks Preakness Stakes hopeful Exaggerator in the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore following a morning jog. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) less Trainer Keith Desormeaux walks Preakness Stakes hopeful Exaggerator in the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore following a morning jog. The 141st Preakness Stakes is...more Photo: <mark>Garry Jones</mark> Image 14 of 36 Assistant trainer Jimmy Barnes holds Preakness Stakes hopeful Collected during a morning bath at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) ORG XMIT: MDGJ105 less Assistant trainer Jimmy Barnes holds Preakness Stakes hopeful Collected during a morning bath at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled for Saturday,...more Photo: <mark>Garry Jones</mark> Image 15 of 36 Kentucky Derby winner Nyquist is walks in the barn after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is walks in the barn after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark>... more Photo: <mark>Patrick Smith</mark> Image 16 of 36 Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 17 of 36 Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 18 of 36 Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 19 of 36 Grooms wash Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) ORG XMIT: MDPS102 less Grooms wash Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) ORG XMIT:...more Photo: <mark>Patrick</mark> Semansky Image 20 of 36 Nyquist trainer Doug O'Neill walks at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Nyquist trainer Doug O'Neill walks at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Photo: <mark>Patrick</mark> Semansky Image 21 of 36 An apron for Laoban hangs in a barn as he is washed at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) An apron for Laoban hangs in a barn as he is washed at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Photo: <mark>Patrick</mark> Semansky Image 22 of 36 Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 23 of 36 Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 24 of 36 Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 25 of 36 Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 26 of 36 Kentucky Derby winner Nyquist is walked by exercise rider Jonny Garcia on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is walked by exercise rider Jonny Garcia on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore,...more Photo: <mark>Patrick Smith</mark> Image 27 of 36 Kentucky Derby winner Nyquist trains on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist trains on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark>... more Photo: <mark>Patrick Smith</mark> Image 28 of 36 Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 29 of 36 Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on back to the barn with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on back to the barn with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico...more Photo: <mark>Patrick Smith</mark> Image 30 of 36 Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 31 of 36 Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 32 of 36 Buy photo Kentucky Derby winner's trainer Doug O'Neill smiles at receiving the #3 post position for his charge at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) less Kentucky Derby winner's trainer Doug O'Neill smiles at receiving the #3 post position for his charge at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip...more Photo: SKIP DICKSTEIN Buy this photo Image 33 of 36 Buy photo The Preakness winner's Trophy is on display for all to see at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) The Preakness winner's Trophy is on display for all to see at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) Photo: SKIP DICKSTEIN Buy this photo Image 34 of 36 Buy photo Kentucky Derby winner Nyquist's trainer Doug O'Neill is joined by owner J. Paul Reddam, left and jockey Mario Guiterrez, center seem calm at receiving the #3 post position for Nyquist at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD.. The 141st running of the Preakness will be held Saturday. (Skip Dickstein/Times Union) less Kentucky Derby winner Nyquist's trainer Doug O'Neill is joined by owner J. Paul Reddam, left and jockey Mario Guiterrez, center seem calm at receiving the #3 post position for Nyquist at the Post Position Draw...more Photo: SKIP DICKSTEIN Buy this photo Image 35 of 36 Buy photo The starting gate positions are set for Saturday's 141st running of the Preakness at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) The starting gate positions are set for Saturday's 141st running of the Preakness at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) Photo: SKIP DICKSTEIN Buy this photo Image 36 of 36 Rain could benefit Nyquist's challenger in Preakness 1 / 36 Back to Gallery Baltimore, Md.. Two things look to be definite on Saturday. Kentucky Derby champion Nyquist will be the favorite for the 141st running of the Preakness, and the weather is going to be lousy. Recent weather reports call for a chilly day, with temperatures in the 50s, and a 100 percent chance for rain. Is that good for Nyquist? The unbeaten champ has run on an off track only once in his eight-race career, when he romped to a 31/4-length win in the Florida Derby on a Gulfstream Park track labeled \"good .\" \"We've seen that Nyquist can handle a bit of weather at Churchill Downs,\" trainer Doug O'Neill said, referring to a hard rain an hour and a half before the Kentucky Derby. \"The Florida Derby, it rained pretty good, too. He is a sure-footed horse. Whatever the weather will be, I think he'll show up and run his race .\" One horse who should relish an off track is Nyquist's arch-rival, Exaggerator. The Keith Desormeaux - trained colt has won two of his three career starts on an off track. Exaggerator was most impressive in his latest trip on a sloppy track. That was the April 9 Santa Anita Derby, at which he sloshed to a 61/4-length win and earned the highest speed figure (103) of his career. Nyquist was not in the field that day. Exaggerator has faced Nyquist four times this season and finished second twice. Exaggerator was a fast-closing second in the Derby, beaten by 11/4 lengths. Desormeaux was not working on a victory speech after finding out about the weather forecast. A sloppy track doesn't guarantee that Exaggerator will turn the tables on Nyquist. \"I don't know if it's a matter of our horse moving up on an off track,\" Desormeaux said. \"It's more of the fact that my horse handles it so well, whereas other horses have not run in the slop. The track we ran on at Santa Anita was a quagmire. The fact that he got over it so well gives me an advantage, but I don't know if it moves me up .\" twilkin @ timesunion.com • 518-454-5415 • @ tjwilkin This is a TU + story. Click for more information. Today's Premium Content - - - - - - - - - - - - - - - - - - - - - - - - - - Tech Valley students learn how to run their own utility from National Grid Adirondack tourist railroad seeks to block state trail conversion plan Outgoing Adironack Park board member blasts Cuomo tactics Editorial: The <mark>Donald Trump</mark> show <mark>Eugene Robinson</mark>: <mark>Trump</mark> and his fictional characters Jo Page: The rituals in our lives can fill us with a sense of hope Layoff responsible for growth Congress must take a stand on war View Comments & copy; 2016 Hearst Communications, Inc. .", "articleID": "2016051901_00073191_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Eugene Robinson": ["Q5407694", "Q5407695"], "Garry Jones": ["Q16145331", "Q17466273"], "Patrick Smith": ["Q15459993", "Q43392916", "Q43911120", "Q51933768", "Q7147663", "Q7147670"]}}, {"date": "2016-05-19", "url": "http://www.mprnews.org/story/2016/05/19/twin-cities-archdiocese-readies-post-bankruptcy-plan", "content": "Next mission for Twin Cities archdiocese: life after bankruptcy Religion Martin Moylan & middot; St. Paul & middot; May 19, 2016 The Archdiocese of St. Paul and Minneapolis is about to move a step closer to emerging from bankruptcy. By the end of the month, the archdiocese will file a bankruptcy reorganization plan detailing how it expects to remain a financially viable organization while providing compensation for victims of clergy sex abuse. The proposal will likely be controversial. • Full coverage: Betrayed by Silence The archdiocese has been in bankruptcy for about 16 months and insurers, parishes, abuse victims and other parties have been in mediation during most of that time. The parties involved were told to keep talks confidential. But there are indications that critical matters, especially insurance coverage, remain unresolved. At a late March court hearing, archdiocese attorney <mark>Richard Anderson</mark> told a federal judge that a plan would include financial contributions from the archdiocese and insurers. But he didn't offer details and said the church could file a plan without first securing the support of sex abuse victims. That did not sit well with Mike Finnegan, an attorney for many of the victims. \"We would not look favorably at all on a plan that was filed without the survivors' approval and definitely without the survivors being able to see it first,\" he said. \"If it is something that the survivors agreed to or that they thought we were going to agree, they would show it to the survivors first .\" The roughly 430 abuse survivors who've filed claims against the archdiocese survivors will decide whether a reorganization proposal is approved. They account for the vast majority of claimants who'll vote to approve or reject the proposal. The archdiocese has about $26 million in net assets. But much of that would not be available to abuse survivors and other creditors because of donor conditions and other restrictions. The church has raised $8 million through the sale of the archbishop's Summit Avenue residence and other property. But that's about what the church has spent on legal and related costs of the bankruptcy. If there's substantial money for victims, it'd likely have to come from insurance. But insurers have contested their obligation to pay claims for abuse that occurred because of the church's negligence. \"The insurers might have a very valid defense to the archdiocese claims on the policies,\" said University of Minnesota law professor Christopher Soper. Rather than contest their liability, he added, insurers might agree to significant payouts if that resolves existing cases, but they would want guarantees there'll be no more insurance claims from the archdiocese and parishes for past clergy sex abuse cases. The insurance companies would rather resolve all the policies all their outstanding liabilities to both the archdiocese and the parishes. That's worth some money, but how much? The archdiocese better have a firm idea when it presents a plan to the bankruptcy court, said Temple University law professor Jonathan Lipson. \"A court told,\" We think we can get X dollars in insurance but we really don't know' might be concerned about something called feasibility, \"Lipson said .\" If you say, \"I'm going to fund the plan with X dollars from insurance, you better be pretty sure that that money is really going to come in .\" The church could also face demands top tap local Catholic foundations, charities, schools, parishes and other entities to compensate abuse victims. But church leaders have long argued those are separate legal organizations, meaning their assets should not be touched by archdiocese creditors. Creditors committee attorney Rob Kugler is asking the court to authorize the hiring of an accounting firm to hunt down assets inside and outside the archdiocese that should be available to creditors. \"They've said a lot of it entities are supposed to be separate,\" Kugler said. \"The ones that we think there might be some question on, we've looked at. We have looked under every viable rock that we can look under so far .\" Money isn't the only thing abuse victims will want out of a reorganization. \"They would like to see the archdiocese files opened on abuse cases. They'd like the world to see what the archdiocese knew and when they knew it,\" said Charles Zech, director of the Center for Church Management and Business Ethics at Villanova University. But those files generally remain closed, he acknowledged, making that kind of relief harder to get than money. The news on your schedule from MPR News Update Email Address *", "articleID": "2016051909_00128466_W", "names": {"Richard Anderson": ["Q3934757", "Q52621684", "Q7323733", "Q932647"]}}, {"date": "2016-05-19", "url": "http://home.nzcity.co.nz/nl.aspx?3582790", "content": "Helen Twose Personal finance and KiwiSaver columnist at the NZ Herald Open strategy the answer to building trust 8:45 AM Friday May 20, 2016 Not saved Facebook 0 Twitter 0 LinkedIn 0 Google + 0 Email Print Investment Companies Work Life Accessibility is vital, says CEO. <mark>Richard Keys</mark> became Abano's chief financial officer at the age of 33. Photo / Doug Sherring If you want to get hold of Abano Healthcare's chief executive <mark>Richard Keys</mark>, just give him a call - the number's on the company website, alongside his personal email. When he gets the occasional phone call from a shareholder, says <mark>Keys</mark>, they're genuinely taken aback to be speaking directly to the boss rather than his PA.. The 45-year-old says having calls filtered through a gatekeeper is not what Abano is about. \"We want shareholders to invest in our group and the best way to do that is if they understand the strategy, they understand what we're doing and it builds up trust, so the more information we can give them, the more they can use that information to make a proper informed decision to know what they're buying .\" That approach to open communication has been recognised by Abano's corporate peers at the annual Infinz finance industry awards. A finalist each year since it first entered the Infinz Emerging Leaders Best Corporate Communicator category in 2013, Abano took the honour that year and last year. \"Abano is about no surprises - that's key for us,\" says <mark>Keys</mark>. \"No one likes surprises and if there is a surprise it is how you deal with it, so we like to be open, transparent and accessible .\" The trust that comes with good communication is earned, not automatic, says <mark>Keys</mark>, and has resulted in very loyal shareholders who provide the support needed when divestment and acquisition opportunities arise. As well as shareholders, current and future, <mark>Keys</mark> needs to be talking to banks, analysts, brokers, fund managers, customers and most importantly, he says, his staff. Continued below. Related Content Andy Symons: How can big businesses become innovation leaders? The art of networking: Liam Dann meets the queen of connectivity Driving environmentalism through competition He liked the way former Air New Zealand chief executive Rob Fyfe kept staff in the loop with personable communication, and he rates compassion and listening as key leadership traits. \"You can't be on a pedestal,\" says <mark>Keys</mark>. \"You need to do that because otherwise you'll find that they'll tell you what you want to hear, not what you need to hear .\" <mark>Keys</mark> has been officially heading the firm for a little over six months, taking over from Alan Clarke, who finished up after 15 years to take the top job at Hellaby Holdings. In the background, <mark>Keys</mark> - previously Abano's chief financial office and chief operating officer - and Clarke had operated interchangeably to cover each other. <mark>Keys</mark> compares it to playing in a rugby team. \"If Alan had the ball, he didn't need to look to the left because he could just pass it and know I was there .\" It made for an easy transition to the top job without the burden of a period of uncertainty. \"If the board wanted a revolution rather than evolution they wouldn't have appointed me .\" <mark>Keys</mark> says he did ensure he put himself in the frame for the chief executive's role, including a leadership programme in 2013 at the INSEAD business school in France. It was professional director and former Abano chair Dame <mark>Alison Paterson</mark> who suggested the course to <mark>Keys</mark>, having seen the impact the residential programme had on several chief executives she knew. Not only did the course provide the leadership smarts he needed to move into the CEO role, it had him sitting alongside 20 international executives, many in charge of multi-billion-dollar businesses, who he now counts as confidants and friends. No one likes surprises and if there is a surprise it is how you deal with it. <mark>Richard Keys</mark> It's one of several points in his career where <mark>Keys</mark> says he has challenged himself to take a step up. In his mid-20s, <mark>Keys</mark> binned a dream job offer from a New York consultancy when the late Graham Collins, a former client from his time at accounting firm Ernst and Young, offered him the job of chief financial officer of his retirement village business, Primecare. A few years later it was Clarke who was calling <mark>Keys</mark>, to pick his brains about an issue at Abano, then known as Eldercare. <mark>Keys</mark> joined Clarke for a special project, taking on the CFO role as a 33-year-old in 2002 before adding the chief operating officer title in 2011. \"Each of the opportunities that have been given to me have been fantastic opportunities .\" You have to say that I had confidence to deliver on them but there was also nervousness, there's big expectations and I guess I've been very fortunate to be given opportunities, which I've just grabbed and ran with. \"<mark>Keys</mark> says he has been privileged throughout his career to have strong people in his life - his family, teachers and business leaders - providing advice and inspiration. It's support he's keen to give others within his own company and the wider business community .\" I don't judge a person if they make a mistake if their intention was good, \"he says .\" If they make a mistake we'll sit down and go \"OK, what did we expect and why did it not pan out? What did we learn about it?', because I judge a person on how they react to things, not that they've made a mistake .\" Clearly if it happens again it's a different issue but if we're going to stop people trying things we're going to stop growth. \"- NZ Herald Read more by Helen Twose Email Helen Twose Email Print Get the news delivered straight to your inbox Receive the day's news, sport and entertainment in our daily email newsletter SIGN UP NOW Loading Currency Compare and convert world currencies. Discover more Loading Loading", "articleID": "2016051921_00655933_W", "names": {"Alison Paterson": ["Q43393986", "Q47482413"], "Richard Keys": ["Q21555285", "Q7327063"]}}]