[{"date": "2015-06-29", "url": "http://www.justjared.com/2015/06/28/bet-awards-2015-complete-winners-list/", "content": "The 2015 BET Awards just wrapped up and it was a night filled with amazing music and performances. Big winners of the night include Nicki Minaj, <mark>Chris Brown</mark>, and more! Janet Jackson and Smokey Robinson were both honored during the show, and tons of celebs took the stage to perform throughout the evening. In case you missed it, check out JustJared.com \"s full coverage of the BET Awards right here! Click inside to see the full list of winner' s from the 2015 BET Awards...Best New Artist Dej Loaf Fetty Wap Rae Sremmurd <mark>Sam Smith</mark>--WINNER Tinashe Best Female Hip-Hop Artist Azealia Banks Nicki Minaj--WINNER Tink Iggy Azalea Trina Dej Loaf Best Male Hip-Hop Artist <mark>J. Cole</mark> Drake Common Kendrick Lamar--WINNER Big Sean Wale Best Female R & B/Pop Artist Beyoncé--WINNER Janelle Monáe Jhené Aiko Ciara Rihanna K. Michelle Best Male R & B/Pop Artist The Weeknd John Legend Trey Songz Usher August Alsina <mark>Chris Brown</mark>--WINNER Best Group A $AP Mob Migos Rae Sremmurd--WINNER Rich Gang Young Money Jodeci Best Collaboration <mark>Chris Brown</mark>--\"Loyal (feat. Lil Wayne & Tyga)\" Big Sean--\"I Don't F ** k with You (feat. E-40)\" August Alsina--\"No Love (Remix) [feat. Nicki Minaj]\" Common & John Legend--\"Glory\" --WINNER <mark>Chris Brown</mark>--\"New Flame (feat. Usher & <mark>Rick Ross</mark>)\" Mark Ronson--\"Uptown Funk (feat. Bruno Mars)\" Best Actress Gabrielle Union Kerry Washington Taraji P. Henson--WINNER Tracee Ellis Ross Viola Davis Best Actor <mark>Anthony Anderson</mark> Idris Elba Jussie Smollett <mark>Kevin Hart</mark> Terrence Howard--WINNER Youngstars Award Jacob Latimore Jaden Smith Mo’Ne Davis--WINNER Quevenzhané Wallis Zendaya Best Movie Annie Beyond the Lights Selma--WINNER Think Like a Man Too Top Five Best Gospel Artist Deitrick Haddon <mark>Erica Campbell</mark> Fred Hammond Lecrae--WINNER Mali Music <mark>Michelle Williams</mark> Video of the Year Beyoncé--\"7/11 ″--WINNER <mark>Chris Brown</mark>--\"New Flame (feat. Usher & <mark>Rick Ross</mark>)\" <mark>Chris Brown</mark>--\"Loyal (feat. Lil Wayne & Tyga)\" Big Sean--\"I Don't F ** k with You (feat. E-40)\" Nicki Minaj--\"Anaconda\" Common & John Legend--\"Glory\" Video Director of the Year Benny Boom Beyoncé, Ed Burke & Todd Tourso--WINNER <mark>Chris Robinson</mark> Fatima Robinson Hype Williams Sportswoman of the Year Brittney Griner Candace Parker Serena Williams Skylar Diggins Venus Williams Sportsman of the Year <mark>Chris Paul</mark> Floyd Mayweather, Jr.. Lebron James Marshawn Lynch <mark>Stephen Curry</mark>--WINNER Coca-Cola Viewers' Choice Award Beyoncé--\"7/11 ″ Dej Loaf--\"Try Me\" Kendrick Lamar--\"i\" Nicki Minaj--\"Only feat. Drake, Lil Wayne & <mark>Chris Brown</mark>)\" --WINNER Rae Sremmurd--\"Throw Sum Mo (feat. Nicki Minaj & Young Thug)\" The Weeknd--\"Earned It\" Centric Award Avery Sunshine--\"Call My Name\" Jazmine Sullivan--\"Dumb (feat. Meek Mill)\" Mark Ronson--\"Uptown Funk (feat. Bruno Mars)\" <mark>Sam Smith</mark>--\"Stay with Me (feat. Mary J. Blige)\" The Weeknd--\"Earned It\" - WINNER", "articleID": "2016052005_00860440_W", "names": {"Anthony Anderson": ["Q16148910", "Q19938265", "Q313918", "Q4771995", "Q4771998"], "Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"], "Chris Robinson": ["Q1077712", "Q1077723", "Q3675561", "Q5107898", "Q5107900", "Q5107901", "Q5107905"], "Erica Campbell": ["Q22338517", "Q242883"], "J. Cole": ["Q204018", "Q56604513", "Q6105158"], "Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"], "Michelle Williams": ["Q156796", "Q229153", "Q23893381"], "Rick Ross": ["Q297831", "Q431969", "Q606032"], "Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}}]