[{"date": "2015-06-29", "url": "http://www.justjared.com/2015/06/28/bet-awards-2015-complete-winners-list/", "content": "The 2015 BET Awards just wrapped up and it was a night filled with amazing music and performances. Big winners of the night include Nicki Minaj, <mark>Chris Brown</mark>, and more! Janet Jackson and Smokey Robinson were both honored during the show, and tons of celebs took the stage to perform throughout the evening. In case you missed it, check out JustJared.com \"s full coverage of the BET Awards right here! Click inside to see the full list of winner' s from the 2015 BET Awards...Best New Artist Dej Loaf Fetty Wap Rae Sremmurd <mark>Sam Smith</mark>--WINNER Tinashe Best Female Hip-Hop Artist Azealia Banks Nicki Minaj--WINNER Tink Iggy Azalea Trina Dej Loaf Best Male Hip-Hop Artist <mark>J. Cole</mark> Drake Common Kendrick Lamar--WINNER Big Sean Wale Best Female R & B/Pop Artist Beyoncé--WINNER Janelle Monáe Jhené Aiko Ciara Rihanna K. Michelle Best Male R & B/Pop Artist The Weeknd John Legend Trey Songz Usher August Alsina <mark>Chris Brown</mark>--WINNER Best Group A $AP Mob Migos Rae Sremmurd--WINNER Rich Gang Young Money Jodeci Best Collaboration <mark>Chris Brown</mark>--\"Loyal (feat. Lil Wayne & Tyga)\" Big Sean--\"I Don't F ** k with You (feat. E-40)\" August Alsina--\"No Love (Remix) [feat. Nicki Minaj]\" Common & John Legend--\"Glory\" --WINNER <mark>Chris Brown</mark>--\"New Flame (feat. Usher & <mark>Rick Ross</mark>)\" Mark Ronson--\"Uptown Funk (feat. Bruno Mars)\" Best Actress Gabrielle Union Kerry Washington Taraji P. Henson--WINNER Tracee Ellis Ross Viola Davis Best Actor <mark>Anthony Anderson</mark> Idris Elba Jussie Smollett <mark>Kevin Hart</mark> Terrence Howard--WINNER Youngstars Award Jacob Latimore Jaden Smith Mo’Ne Davis--WINNER Quevenzhané Wallis Zendaya Best Movie Annie Beyond the Lights Selma--WINNER Think Like a Man Too Top Five Best Gospel Artist Deitrick Haddon <mark>Erica Campbell</mark> Fred Hammond Lecrae--WINNER Mali Music <mark>Michelle Williams</mark> Video of the Year Beyoncé--\"7/11 ″--WINNER <mark>Chris Brown</mark>--\"New Flame (feat. Usher & <mark>Rick Ross</mark>)\" <mark>Chris Brown</mark>--\"Loyal (feat. Lil Wayne & Tyga)\" Big Sean--\"I Don't F ** k with You (feat. E-40)\" Nicki Minaj--\"Anaconda\" Common & John Legend--\"Glory\" Video Director of the Year Benny Boom Beyoncé, Ed Burke & Todd Tourso--WINNER <mark>Chris Robinson</mark> Fatima Robinson Hype Williams Sportswoman of the Year Brittney Griner Candace Parker Serena Williams Skylar Diggins Venus Williams Sportsman of the Year <mark>Chris Paul</mark> Floyd Mayweather, Jr.. Lebron James Marshawn Lynch <mark>Stephen Curry</mark>--WINNER Coca-Cola Viewers' Choice Award Beyoncé--\"7/11 ″ Dej Loaf--\"Try Me\" Kendrick Lamar--\"i\" Nicki Minaj--\"Only feat. Drake, Lil Wayne & <mark>Chris Brown</mark>)\" --WINNER Rae Sremmurd--\"Throw Sum Mo (feat. Nicki Minaj & Young Thug)\" The Weeknd--\"Earned It\" Centric Award Avery Sunshine--\"Call My Name\" Jazmine Sullivan--\"Dumb (feat. Meek Mill)\" Mark Ronson--\"Uptown Funk (feat. Bruno Mars)\" <mark>Sam Smith</mark>--\"Stay with Me (feat. Mary J. Blige)\" The Weeknd--\"Earned It\" - WINNER", "articleID": "2016052005_00860440_W", "names": {"Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}}, {"date": "2016-05-24", "url": "http://ca.rd.yahoo.com/sports/rss/mls/SIG=12js7f754/*https://ca.sports.yahoo.com/news/union-orlando-city-preview-172904454--mls.html", "content": "Union-Orlando City Preview   Richie Marquez's first MLS goal vaulted the Philadelphia Union into first place in the Eastern Conference. To add three points to their lead, the Union will have to snap Orlando City's lengthy home unbeaten streak Wednesday night. Marquez's stoppage-time score lifted Philadelphia to a 1-0 win against visiting D.C. United on Friday and pushed the Union one point ahead of New York City FC. It also extended their unbeaten streak to five matches (2-0-3). \"There's a belief in the group, I think it is clear, even when it is not our best night we can win a one-nothing game roll up our sleeves and fight,\" coach Jim Curtin told the team's official website. \"We can win in a lot of ways. We can win pretty, we can win when we are a little off and we can win on a restart. I think it's a testament to the group .\" Philadelphia, 5-3-3 overall, is 1-3-1 away from home and earned that lone win March 12 against Columbus. The Union are 2-0-1 all-time against Orlando City (3-3-5) after a 2-1 victory April 8. Tranquillo Barnetta provided the go-ahead goal in the 90th minute. Orlando heads into this matchup 6-0-6 at home since the beginning of August and 2-0-4 there this season. The club ended a six-game winless streak with a 2-1 victory over visiting Montreal on Saturday. Cyle Larin netted both goals, giving him a team-best six this season, and tallied the winner in the 87th minute. \"Let's hope it's the turning point in the season,\" coach Adrian Heath said. \"We got a win tonight, and I think the confidence will set up nicely for Wednesday ....I have got great faith with this group of players. We will keep going and not give in .\" Larin (hamstring), midfielder Brek Shea (suspension) and defender Tommy Redding (concussion) sat out the loss in Philadelphia. Orlando won't have a pair of defenders in this match. Seb Hines (knee) and <mark>Rafael Ramos</mark> (hamstring) are expected to join Darwin Ceren (ankle) and <mark>Pedro Ribeiro</mark> (back) on the sidelines. It's unclear when Union defender Anderson Conceicao will return from a dislocated right shoulder. Philadelphia and Orlando City played to a scoreless draw in their only previous game in Florida on Aug. 8. Adrian Winter scored Orlando's only goal in the three overall matchups in April. C.J. Sapong found the net just two minutes into that match for one of his team-best five goals. Sebastien Le Toux's penalty kick provided a 1-0 win over Orlando City on Oct. 25. Sports & Recreation <mark>Conte</mark>: Pirlo and Giovinco paying price for playing in MLS Andrea Pirlo and Sebastian Giovinco paid the price for choosing to play in Major League Soccer according to Italy coach <mark>Antonio Conte</mark>, who left the duo out of his preliminary 30-man squad for the European Championship. Giovinco has impressed since...More & raquo; AP - Sports - 13 minutes ago Toronto FC's coach and players have expressed surprise and more than a little irritation at teammate Sebastian Giovinco being left off the Italian team for the European Championship. Some of their ire was directed at Italian coach <mark>Antonio Conte</mark>,...More & raquo; The Canadian Press - 14 minutes ago Louis van Gaal's attention to detail triggers his success, but it also causes him to fall out with people ....More & raquo; FC Yahoo - 27 minutes ago Richie Marquez's first MLS goal vaulted the Philadelphia Union into first place in the Eastern Conference. To add three points to their lead, the Union will have to snap Orlando City's lengthy home unbeaten streak Wednesday night. Marquez's...More & raquo; AP - Sports - 29 minutes ago LONDON (AP)--Arsenal received the most Premier League prize money last season despite finishing behind champion Leicester ....More & raquo; AP - Sports - 1 hour 12 minutes ago Cristiano Ronaldo OK after injury scare in Madrid practice Cristiano Ronaldo left Real Madrid's training session early after an injury scare on Tuesday, but doctors said the forward is not at risk of missing the Champions League final. Ronaldo hurt his left leg after colliding with reserve goalkeeper Kiko...More & raquo; AP - Sports - 1 hour 24 minutes ago LIVERPOOL, England (AP)--Liverpool has signed goalkeeper Loris Karius from German club Mainz for $7 million ....More & raquo; AP - Sports - 1 hour 27 minutes ago NICE, France (AP)--Lucien Favre has been appointed as Nice's new coach on Tuesday, a few hours after the Riviera club surprisingly parted ways with Claude Puel ....More & raquo; AP - Sports - 1 hour 30 minutes ago * Everbright Securities, Beijing Baofeng buy 65 percent stake * Deal values MP & Silva at $1 bln - sources * Company founders to keep important roles (Adds comment from CEO, advisers) By Elvira Pollina and Adam Jourdan MILAN/SHANGHAI, May 24...More & raquo; Reuters - 1 hour 35 minutes ago PARIS (Reuters) - Nice have appointed former Borussia Moenchengladbach coach Lucien Favre as successor to Claude Puel. \"Our collaboration is ending today,\" Ligue 1 club Nice and Puel said in a joint statement on Tuesday. Nice later added that they...More & raquo; Reuters - 1 hour 45 minutes ago British police say French authorities plan to impose 24-hour alcohol bans in the center of Lens when the city hosts European Championship games. The northern French city will stage four games next month, including the British derby between England...More & raquo; AP - Sports - 1 hour 59 minutes ago As Man U aura fades, Mourinho can make club box office again The stability Alex Ferguson fostered over more than 26 years at Old Trafford has eroded in the three years since his retirement. Manchester United often seems like just any other team, shorn of its aura of superiority and orderly calm while...More & raquo; AP - Sports - 2 hours 17 minutes ago REUTERS - Swansea City are selling striker Eder to French side Lille for an undisclosed fee, the Premier League club said on their website (www.swanseacity.net) on Tuesday. The 28-year-old, who joined the Welsh club in 2015 from Portuguese side...More & raquo; Reuters - 2 hours 19 minutes ago Zidane says Atletico is good at more than just defending Although it will be Real Madrid's powerful attack against Atletico Madrid's notoriously tough defensive setup on Saturday in the Champions League final, Madrid coach Zinedine Zidane said his team will have to be prepared to play well on both sides...More & raquo; AP - Sports - 2 hours 21 minutes ago Newcastle United should look to champions Leicester City as they try to get back into the Premier League under manager Rafael Benitez, Newcastle midfielder Georginio Wijnaldum has said. Leicester finished 10 points ahead of second-placed Arsenal in...More & raquo; Reuters - 2 hours 38 minutes ago Striker Sandro to leave Barcelona Barcelona striker Sandro Ramirez is set to leave the club, the La Liga champions' technical director <mark>Robert Fernandez</mark> said on Tuesday. Barca have not exercised the option to offer Sandro a new contract in order to allow the 20-year-old forward to...More & raquo; Reuters - 2 hours 43 minutes ago Liverpool and Manchester United have been fined by UEFA over a variety of charges, including illicit chanting, during their Europa League last-16 tie. The Premier League clubs were fined 40,000 euros ($44,604) each for the chants by their fans,...More & raquo; Reuters - 2 hours 51 minutes ago PHOTOS: Intra-national finals a feature of Champions League For the second time in three seasons, city rivals Atletico Madrid and Real Madrid will meet in the Champions League final - the sixth time Europe's most prestigious soccer competition will be contested by teams from the same country. All three have...More & raquo; AP - Sports - 3 hours ago The midfielder has agreed to join the newly-promoted Glasgow club ....More & raquo; TheJournal. ie - 3 hours ago Romanian Lucescu takes over as Zenit coach Former Shakhtar Donetsk manager Mircea Lucescu has taken over as the head coach of Zenit St. Petersburg, the Russian club said on Tuesday. The 70-year-old Romanian, who spent 12 years in charge of Shakhtar, has signed a two-year contract with...More & raquo; Reuters - 3 hours ago", "articleID": "2016052417_00910476_W", "names": {"Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"], "Pedro Ribeiro": ["Q10347723", "Q10347724", "Q16466585", "Q33690839", "Q57412729"], "Rafael Ramos": ["Q10357059", "Q17612777", "Q21622777", "Q7282275"], "Robert Fernandez": ["Q21284941", "Q59379609"]}}, {"date": "2016-05-24", "url": "http://www.dailymercury.com.au/news/melinda-does-doris/3033060/", "content": "Melinda Does Doris will show at the Mackay Entertainment and Convention Centre on June 9. Contributed Related Items Graeme Connors to perform in Mackay after new album release MECC turns their focus to attracting more business events Local Real Estate Subscribe Now AUSTRALIAN country singer Melinda Schneider is the ideal woman to pay tribute to American screen icon Doris Day. They share a love of dogs and a career in the spotlight. Both are blonde singers, born into German Catholic families. They both - in Schneider's words - have \"chosen a few shockers of men\" in their time. It's fitting that Schneider has co-written (with <mark>David Mitchell</mark> of Dusty and Shout! fame) a stage show tribute to pay tribute to the iconic actress and singer, who is now in her 90s. Schneider will bring Melinda Does Doris to Mackay next month. Schneider was seven or eight years old when she first saw Day on screen, starring in the film Calamity Jane. \"I just fell in love with her in that role,\" she said. \"I just loved her as a personality - she was a great singer, great dancer, wonderful comedian .\" Being born into a country music family, that film resonated with me because of the Western theme. \"What Schneider loves best about Day is that she is a\" survivor \".\" She's survived four tumultuous marriages, her third husband lost all of her money so she went bankrupt, \"she said .\" She even had a brush with Charles Manson. \"In researching the show, Schneider read many biographies and got to know some of Day's friends, who live in Sydney. Schneider said the Melinda Does Doris show she was bringing to Mackay next month was a smaller,\" more intimate \"version of her full theatre show of the same name .\" That version of the show was like a mini-musical, with big sets, an eight-piece band, horns and two dancing boys, \"she said. Budgeting restraints made the show difficult to tour regionally, so Schneider has adapted it .\" (<mark>Mitchell</mark> and I) came up with the idea to strip it back, do it with a little jazz trio, make it a more intimate show, \"she said .\" It's 26 songs, and I tell all the same amazing stories of Doris' life. \"Melinda Does Doris will show at the Mackay Entertainment and Convention Centre (MECC) Auditorium on Thursday, June 9 at 7.30 pm. Tickets are $49 for adults, $39 for pensioners and $29 for children under 14. To purchase, visit http: //www.mackaytix.com.au or phone the MECC on (07) 4961 9777. doris day Read More Login to follow entertainment Read More Login to follow mackay entertainment and convention centre Read More Login to follow melinda schneider Read More Login to follow music Read More Login to follow pulse Read More Login to follow Topics: doris day, entertainment, mackay entertainment and convention centre, melinda schneider, music, pulse 0 PRINT Have your say Recommended Reading Man jailed for Wolf Creek style backpacker attack Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now", "articleID": "2016052507_00319771_W", "names": {"David Mitchell": ["Q16732686", "Q18719365", "Q20641188", "Q21997614", "Q24804720", "Q30347996", "Q40479", "Q43912296", "Q457134", "Q5237616", "Q5237619", "Q5237621", "Q5237622", "Q5237623", "Q5237624", "Q5237625", "Q5237626", "Q5237629", "Q52422545"]}}, {"date": "2016-05-28", "url": "http://northjersey.com/arts-and-entertainment/how-big-is-too-big-some-theme-park-riders-fear-small-seats-and-the-walk-of-shame-1.1606731", "content": "& copy; 2016 North Jersey Media Group May 28, 2016, 3:00 AM How big is too big? Some theme park riders fear small seats and' the walk of shame' STAFF AND WIRE REPORTS | Wire Service It's an uncomfortable scene familiar to anybody who has ever visited a theme park, including North Jersey-area amusement parks: The overweight rider becomes increasingly embarrassed as the ride attendant pushes and shoves with all his might on the over-the-shoulder restraint that stubbornly refuses to click closed. Everybody waiting in line knows what comes next: the \"walk of shame .\" Mark Boster/Los Angeles Times Buckling in on the Harry Potter and the Forbidden Journey ride at Universal Studios, Hollywood. \"The walk of shame is an embarrassing experience,\" said Mike Galvan, who penned the \"Big Boy's Guide to Roller Coasters .\" \"I've been there many times. It's disheartening .\" For instance, Galvan likens the straight back and flat seat on Universal's new Harry Potter and the Forbidden Journey attraction in Hollywood to an \"old wooden chair\" that provides little wiggle room for larger riders. \"When the over-the-shoulder restraint comes down, if part of you is hanging over, whether it be your gut, your thighs or your shoulders, you're going to be very uncomfortable,\" Galvan said. While there are no height or weight maximums for Forbidden Journey, the safety restraints must be able to close properly for guests to ride, Universal officials said. Like many theme park attractions, Forbidden Journey has a tester seat near the entrance for visitors who might be worried they won't fit on the ride. But as big and tall riders will tell you, those tester seats often can be misleading. \"I do not trust the accuracy of the test seats, no matter the park,\" Galvan said. \"I can only suspect that the seat belts on the test seats are intentionally short to minimize the potential of riders getting the\" walk of shame' at the station. I've also had the opposite happen, where I made the test seats but was rejected from the actual ride. \"Galvan, 31, is a regular contributor to SFGAmWorld, a fan site for Six Flags Great America outside Chicago. In 2007, he was so overweight that he stopped going to theme parks because he no longer could fit on the rides. Over the next three years, he lost more than 130 pounds so he could return to his passion: roller coasters. Anybody who has ever been kicked off a ride because he or she was too big will tell you that theme park attractions are not designed for people who are heavier or taller than average. All theme parks have euphemistic names for those who are too fat or too tall to fit safely in an attraction seat--\"exceptional sized riders\" or \"guests of larger size,\" for example. Some ride makers even try to make accommodations with \"big boy seats .\" So how big is too big? At Six Flags Great Adventure & Safari in Jackson, there are no set maximum measurements for riders, as each ride has different types of restraints, a spokeswoman said. But the Safety & Accessibility Guide on the park's website also warns, \"Due to the design of the seating safety device on this ride, exceptionally large or tall people may not be able to ride\" for a number of popular \"high thrill\" rides such as Batman: The Ride, El Diablo, <mark>El Toro</mark>, Green Lantern, Kingda Ka, Nitro, Runaway Mine Train, Superman: Ultimate Flight, The Dark Knight and The Twister, though most of these have test seats in front of the ride's entrance for guests to see if they will fit before attempting to get on the ride. The Bizarro coaster also has \"a special seat in Row 5 of each train to accommodate guests with larger body proportions,\" the site says. Similarly, at Hersheypark in Hershey, Pa., each ride has different height and weight limitations. However, guests approaching 300 pounds may have difficulty on a number of roller coasters, aerial and swinging rides, according to Laura Woodburn, director of ride operations. As at Six Flags, many of these rides have a test seat at the front of the lines and a sign at the entrance reading: \"This ride may not accommodate guests of a larger size (height and/or weight) due to the configuration of the safety system .\" The signs allow guests to make a decision about whether to ride prior to waiting on line and, Hersheypark hopes, prevents guests from being \"embarrassed or disappointed,\" Woodburn said. Cedar Fair, the parent company of Knott's Berry Farm in Buena Park, Calif., and 10 other amusement parks, offers very specific size requirements for \"guests of larger size .\" Cedar Fair warns that men over 6 foot 2 inches or 225 pounds with a 40-inch waistline or 52-inch chest \"may not be accommodated on some of our rides .\" The park operator says women over 200 pounds who wear a size 18 or larger could have trouble fitting on some rides. At Ohio's Cedar Point, some coasters such as Millennium Force, Top Thrill Dragster and GateKeeper have a 6-foot-6-inch height maximum. Ohio's Kings Island institutes height maximums for a number of rides, including Firehawk (6-foot-9), Invertigo (6-foot-6) and Delirium (6-foot-4). Tennessee's Dollywood has 6-foot-6-inch height maximums on a number of rides, including the Wild Eagle wing coaster. The Green Lantern: First Flight at Six Flags Magic Mountain in Valencia, Calif., has a height maximum of 6 foot 5 inches. Busch Gardens Williamsburg in Virginia sets aside two rows of seats on the Alpengeist and Griffon coasters for riders with \"chest measurements exceeding 52 inches .\" Splashin' Safari water park at Holiday World in Indiana uses a walk-on scale to ensure the maximum weight on the six-passenger Mammoth rafts doesn't exceed 1,050 pounds. Disney parks have no height or weight maximums on any attractions, according to officials. Disneyland famously replaced the 1964 boats on It's a Small World because the increasing waistlines of Americans were causing them to run aground--an assertion reported by MiceChat and vigorously denied by Disney officials. Theme park officials typically respond with prepared statements when asked about making accommodations for \"riders with unique physical attributes\" (such as this one from Six Flags): \"We work closely with ride manufacturers to incorporate safety systems that are designed to accommodate people of average physical stature and body proportions. We require that all seat belts, lap bars and shoulder harnesses be positioned and fastened properly. Because of the rider restraint system, guests of a larger size may not be accommodated on some rides .\" As has been well documented, Americans are getting fatter. The average weight for adult men has risen from 166 pounds in 1960 to 195 pounds in 2012, according to the Centers for Disease Control and Prevention. The average weight for women increased from 140 to 166 pounds during the same period. Addressing the issue is complicated for ride makers in part because every rider carries weight differently--with problem areas ranging from the hips, waist and stomach to the chest and shoulders. For big riders, coaster \"rideability\" varies from park to park. One of the biggest concerns for larger riders is what Galvan calls the \"seat belt lottery .\" \"It's absolutely amazing how from one row to another, the length of the seat belt will vary,\" he said. \"The only reason I can think for this irregularity would be off-season maintenance. Some rides are more egregious than others in this department .\" Older coasters by Arrow Dynamics and Schwarzkopf tend to be the easiest to ride for larger riders, according to Galvan's \"Big Boy's Guide to Roller Coasters .\" Some Bolliger & Mabillard rides can be tight fits, while others offer rows with larger seats, Galvan said. Vekoma, Gerstlauer and Mack Rides typically present few problems, while Premier and Intamin often prove difficult for bigger riders, he said. Intamin's suspended launch coasters such as Wicked Twister at Cedar Point and Volcano at Virginia's Kings Dominion cause the most problems for big riders, he said. \"The issue with these rides is the seat belt and the lack of an audible\" click' when pulling the restraint down, \"Galvan said .\" Not to mention that you have the seat several feet off the ground, so you have to tippy-toe or jump up to get into the seat. Depending on your body dimensions, you might not be able to maneuver yourself to get into the seat properly. \"There are no industry standards among ride makers and amusement parks when it comes to accommodating bigger riders. Some parks require two locking clicks to secure a lap bar or over-the-shoulder restraint on a ride, while others insist on three clicks. Seat belt lengths can vary from ride to ride and row to row .\" Most manufacturers, if not all, hoping to do business in the U.S. are now offering optional \"jumbo' seats to buyers to fit larger adults,\" said Bob Dean of Florida-based Leisure Labs, which represents Mack Rides, Great Coasters International and Mondial. Los Angeles Times writer Brady MacDonald and Record staff writer Sophia F. Gottfried contributed to this report.", "articleID": "2016052807_00072750_W", "names": {"El Toro": ["Q5428175", "Q767616"]}}, {"date": "2016-05-29", "url": "http://www.statesman.com/news/news/national/marker-honors-revolutionary-war-soldier/nrWrg/", "content": "Explore SIGN UP FOR NEWSLETTERS Want more news? Sign up for free newsletters to get more of the Statesman delivered to your inbox. A Revolutionary War soldier's memory will endure with the dedication of a new gravestone. A special ceremony honoring William Henry Brandenburg, Jr. in New Carlisle Cemetery capped the annual New Carlisle Memorial Day parade and service Saturday. The ceremony included contributions from members of the New Carlisle Historical Society, <mark>George Rogers</mark> Clark Chapter of the Sons of the American Revolution, Lagonda Chapter of the Daughters of the American Revolution, New Carlisle Boy Scout Troop 27 and the American Legion/Veterans of Foreign Wars Honor Guard. Brett Turner Randy Young of the <mark>George Rogers</mark> Clark Chapter of the Sons of the American Revolution lays a wreath after the unveiling of the new gravestone of Revolutionary War soldier William Henry Brandenburg Jr. at New Carlisle Cemetery on Saturday, May 28. Contributed photo by Brett Turner Historical Society members Scott Suther, Dave McWhorter and Hugh Schiller collaborated to see Brandenburg's marker was restored. \"We like to keep track of the soldiers who served,\" Suther said. \"We needed to see what we could do for Brandenburg .\" They do readings of the various sections of the cemetery and keep track of the Revolutionary War soldiers. While markers for Adam McPherson, Thomas Wallace and John Boltenhouse are easily identifiable, Brandenburg's wasn't. The Brandenburg family's markers had fallen and were worn; the only one clearly marked was his son, Frederick. \"It's a process,\" McWhorter said. \"We want to acknowledge these soldiers and what they've done .\" Brandenburg was born Oct. 8, 1758 and joined the Continental Army in 1781, and served in several regiments. He pursued the Tories, those who remained loyal to the British during the war, and guarded British prisoners of war. Brandenburg and family moved to Montgomery County in 1816, then to Bethel Township. A cholera outbreak claimed Brandenburg and several family members in 1834. He died on Aug. 17 of that year. One of the things the new stone corrects is the year of the family's passing. Two of the remaining markers incorrectly indicate 1831 as the year of death. Suther was surprised how quickly the plan for the new marker happened. They worked with the Department of Veterans Affairs, which paid for the new marker and had it by December. In addition, Frederick's stone and another, possibly Brandenburg's wife, have been reset in new concrete flanking Brandenburg's new marker. The city of New Carlisle dedicated the new concrete to support the markers. The Memorial Day weekend seemed to be the perfect time for the ceremony. Brandenburg is the great-great-great-great uncle of Sharon Maingi of Tipp City, who attended the ceremony. \"I was so impressed with the turnout. It was above expectations,\" she said. Maingi described herself as a patriot and was inspired to join the Daughters of the American Revolution and awaiting her confirmation. \"It's part of who I am; he set an example for me,\" Maingi said. \"I'm hopeful the younger generation will realize what a wonderful heritage we have .\" Other Brandenburg descendants sent emails applauding the honor, which Suther shared at the ceremony. While there are currently four known Revolutionary War soldiers identified in New Carlisle Cemetery, a fifth's grave location is still undetermined. William Serviss is being sought next by the historical society. \"I live at the library on the weekend,\" Suther said, smiling. McWhorter had reassurance of the Brandeburg effort when he met a Vietnam veteran before Saturday's ceremony. \"He talked about how important it was for him to witness the ceremony, and as a combat veteran he had appreciation for what they went through and what an honor it was to be here,\" McWhorter said. \"It makes me feel good we can honor military heroes of all eras .\" ", "articleID": "2016052905_00058675_W", "names": {"George Rogers": ["Q16192904", "Q21166625", "Q3101881", "Q53794163", "Q5543996"]}}, {"date": "2016-05-29", "url": "http://columbiatribune.com/news/local/salute-to-veterans-air-show-brings-out-families-friends/article_7ddb5ee6-aff4-5854-bdf5-b5ab76426137.html?comments=focus", "content": "Given the number of families in attendance Saturday at Columbia Regional Airport, it would be safe to call the Salute to Veterans air show a family-friendly event. The annual air show started Saturday and continues from 9 a.m. to 4 p.m. Sunday. It's the 28th year for the event. Related collection: Salute to Veterans Air Show 2016 article: Memorial Day parade taking new route Monday Subscription Required An online service is needed to view this article in its entirety. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Login Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Or, use your facebook account: facebook Need an account? Create one now. Choose an online service. 1 Online $13.00 for 30 days Unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. 2 Online (Previously Online + Webapp) $13.00 for 31 days Unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone, as well as the Web App on your computer or iPad. 3 7 Day Home Delivery $16.46 for 30 days Home delivery of the print edition every day *, unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. 4 Print Only $14.28 for 28 days Home delivery of the print edition *, including coupons, specials from major retailers and expanded news and analysis. Includes online. 5 Add online to print subscription Free! Your bill will be updated to include online as of this date. 6 MU Student Subscriptions Free! Online Student Access to the ColumbiaTribune.com 7 16 weeks for $20 Online and Print $21.36 for 112 days Home delivery of the print edition every day, unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone, as well as the Web App on your computer or iPad. 8 13 for $13 | Wednesday + Sunday Home Delivery $14.10 for 91 days Get 13 weeks of our Sunday and Wednesday paper delivered to your home or office for just $1 per week. 9 16 Weeks for $16 Print Home Delivery $17.36 for 112 days Get 16 weeks of home delivery for just $1 a week. 10 26 for $26 | 7-Day Home Delivery $28.20 for 182 days Get 26 weeks delivered to your home every day for just $1 per week. 11 26 weeks for $26 | 7-Day Home Delivery $28.20 for 182 days Get 26 weeks of home delivery for just $1 a week and save 71% off the regular home delivery subscription rate. 12 7-Day Home Delivery (1 Year) $211.53 for 365 days Home delivery of the print edition every day *, unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. Paid in advance for a year, for your convenience. 13 Special: 13 weeks for $20 | Wed, Sat, Sun $21.70 for 91 days Get 13 weeks of our weekend home delivery with expanded pro, college and prep sports coverage. Delivered to your home or office at 38% off the regular home delivery subscription rate. 14 Wed-Sat-Sun Home Delivery $11.75 for 31 days Home delivery of the print edition on Wednesday, Saturday and Sunday. Unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. Monthly recurring. None of these apply to you? Back Need an account? Create one now. You must login to view the full content on this page. Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Or, use your facebook account: facebook Need an account? Create one now. Shannon Hackett was in attendance with her husband, Zach Hackett, daughter Allison, 7, and sons Jackson, 10, and Jordan, 9 months. The family traveled all the way from Russellville for the air show. Shannon said the trip was Jackson's idea. \"I like planes,\" Jackson said. Sharon Hackett said the air show was a perfect family outing for Memorial Day weekend. The clear, sunny weather was a nice bonus, she said. \"It's wonderful that it's free,\" she said. \"This is our first time. It's been fun so far .\" The Hackett children spent some time exploring an A-10 Warthog. Luke Gabriel, a senior airman in the U.S. Air Force, said the plane is used for ground support and that its 30 mm gun can fire 30 rounds per second. He said the gun can only fire two - to three-second bursts before it overheats. Dorothy and <mark>George Robertson</mark> traveled to the air show from Vienna, Mo. \"We got up this morning and thought we would drive up here,\" she said. \"It's a nice day, so we thought we would check it out .\" Levi Clark, 7, talked with members of the Canadian Armed Forces SkyHawks parachute team after they landed. He posed with the team as his mom, Lisa Clark, snapped a photo. \"I thought they were good,\" Levi said. Asked if he might jump out of airplanes one day, he said he might consider it. Lisa Clark said their family enjoyed celebrating Memorial Day in a unique way. \"It's a really amazing tribute to our country,\" she said. Nic Thompson of Columbia went to the air show with his wife, Ashley, and his father-in-law, Dan Steuerwald. Thompson, a Marine Corps veteran, discussed the features of a World War II-era B-25 bomber that was on display. \"World War II fascinates me,\" he said, noting how amazed he was by the capability of a plane the size of the B-25. Not everyone attended the air show as a family affair. David You, a doctoral student in economics at the University of Missouri, came with a group of fellow students. With classes finished for the year, he said the air show provided a nice way to unwind. \"We just heard there's an air show,\" he said. \"I'm kind of a fan of these kind of aircraft .\" You said he missed the air show last year but that he thinks it's worth a return trip next year. \"The skydiving really impressed me,\" he said. The U.S. Army Golden Knights parachute team and the Skyhawks appeared to be the crowd favorites among the morning performances. The Golden Knights prepared for an afternoon jump, which was set to feature a mass formation. They even rehearsed the jump on the ground in what they called a \"dirt dive .\" High winds Saturday afternoon ultimately forced the team to cancel the afternoon jump. Sgt. 1st Class Jonathan Clevenger, a member of the Golden Knights, said the team averages about 500 jumps a year, with performances at different air shows or events almost every weekend. Clevenger said he has completed 1,727 jumps. Deputy City Manager Tony St. Romaine was set to be part of a tandem jump with the Golden Knights, but those plans were delayed until Sunday because of the cancellation. St. Romaine said the team offered him the opportunity to jump in appreciation for all the work he does coordinating the air show. \"I've been looking forward all day to this,\" he said. \"I'm very hopeful we can jump on Sunday .\" St. Romaine said he was looking forward to the 13-second free fall from 13,500 feet. & copy; 2016 Columbia Daily Tribune. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Thank you for visiting ColumbiaTribune.com You have viewed your 10 free stories. You can come back at the end of your 30-day period for another 10 free articles, or you can purchase a subscription and enjoy unlimited access to local news, sports, photos and thoughtful analysis to help make sense of it all. If you need help, please contact our customer service office at 573-815-1600. Have an online subscription? Log in Now Need an online subscription? Subscribe Login Username or Email Address Password Forgot? Remember me on this computer Username or Email Address Now I remember! Log in to comment with Facebook account: facebook Need an account? Create one now. None of these apply to you? Back Close Window [x]", "articleID": "2016052914_00523282_W", "names": {"George Robertson": ["Q27918263", "Q55362564", "Q5543953", "Q56597390"]}}, {"date": "2016-05-30", "url": "http://feeds.theroar.com.au/~r/theroar/~3/aK_xteycYKk/", "content": "Why State of Origin is great for the premiership competition The Tigers defeated the Origin-affected Broncos. (AAP Image/Action Photographics, Colin Whelan) Related coverage 2016 NRL ladder news Both the Broncos versus Tigers and Dragons versus Cowboys clashes reminded us on the weekend of the invaluable influence that Origin has on the premiership competition. On Friday night we witnessed a courageous Wests outfit clinch victory over a depleted Brisbane side lacking the outs of six Origin stars. Darius Boyd, Corey Oates, Sam Thaiday, Matt Gillett, <mark>Corey Parker</mark> and <mark>Josh McGuire</mark> were all missed in the Broncos' 18-19 loss. It was their forward pack that took the biggest battering, losing the metres gained battle 1398 to 1714 after having dominated in this area in their crushing 26-0 win over the Red V in Round 6. On the following night we saw a dogged St George side beat North Queensland 14-10. The visitors were without Origin superstars Johnathan Thurston, <mark>Matt Scott</mark>, <mark>Michael Morgan</mark> and James Tamou and subsequently recorded their lowest score for the year to indicate a lack of firepower in attack. At Lang Park it was a tale of Brisbane vying for its ninth win for the season hosting a side looking for just win number five and a club that not long ago had been thrashed 60-6 at the hands of the Raiders. South of the Tweed River, we then saw a side looking for its sixth win play host to a Cowboys outfit shooting for win number nine on the march to defend a premiership. The fact that in both games the competition underdogs came up trumps shows that Origin is great for the premiership competition as it serves to level-out team line-ups during the Origin period. Despite the salary cap, there is a clear discrepancy in talent across club rosters in the NRL. Brisbane, North Queensland and the Roosters all boast both a richness and depth of talent more impressive than all other clubs and head and shoulders above the rosters of Newcastle, Gold Coast and St George. The fact that six Brisbane players will run out for the opening Origin clash this Wednesday night, a number no other club equals, is a striking indication of the Broncos' unmatched squad. As equally as telling is that eight Brisbane stars were named for the Anzac Test early in May, likewise more than any other club. Playmakers <mark>Ben Hunt</mark> and Anthony Milford are also dominating the competition, the halfback leading in try assists and Milford a joint-first for leading try-scorer. Oates is also a top-five try-scorer and is running third in total line-breaks, while <mark>Parker</mark> is in the top five for total hit-ups. Although Wests are blessed with arguably the league's most promising crop of young, upcoming talent given the likes of fullback James Tedesco, halves Mitchell Moses and Luke Brooks, prop <mark>Aaron Woods</mark> and a wealth of exciting outside backs, it's a squad at this stage well behind that of <mark>Wayne Bennett</mark>'s boys and other clubs. If it wasn't for the competition-leveller that the Origin period is, the Tigers would have returned home winless on Friday night and we would have witnessed a thumping win to JT and clan at WIN Stadium on Saturday. <mark>Bennett</mark> has for a long time strongly opposed Origin in its current format and again didn't hold back in a recent press conference in the build-up to the series. \"If you look at the record books with the Broncos, nearly every season that I've coached here, we are somewhere where we are now and look at where we finish after Origin. We're all over the shop,\" <mark>Bennett</mark> said. The super-coach criticised the interstate rivalry despite admitting to his side being blessed with the best players in the competition. \"During the Origin period, we have to play Melbourne and be in Sydney and Auckland,\" he said. \"We are talking about the best players in the game, the best players in our team, not the second and third best players, our best players .\" The toll that Origin has on star-studded line-ups such as Brisbane's is huge, but it's exactly that which makes the three-game series great for the premiership competition. If the salary cap doesn't do a sufficient job of leveling the playing field, something else needs to stand up. Origin does when it starts to reel in the competition's high-flyers come the end of May every year. Cheer, cheer the underdogs.", "articleID": "2016052919_00182141_W", "names": {"Aaron Woods": ["Q17403280", "Q4662556"]}}]