[{"articleID": "2010120713_00040239_W", "names": {"Mike Hill": ["Q1498629", "Q16192754", "Q27043626", "Q30164739", "Q484948", "Q5805741", "Q6847237"]}, "date": "2010-12-07", "url": "http://record-eagle.com/local/x1199047916/Slippery-walk-for-schools-staff", "content": "by lindsay vanhulle lvanhulle @ record-eagle.com traverse city - slippery conditions at traverse city east middle school caused some staff members to slip and fall on their way into the building amid a lake-effect snow system. at least one person, believed to work for the traverse bay area intermediate school district, had to be checked by medical personnel. tbaisd superintendent <mark>mike hill</mark> could not be reached monday afternoon for more information. school was not canceled due to weather monday for any of traverse city area public schools. east principal cathy meyer said she told administrators at the district's central office about the slick conditions and a custodian continued to monitor it throughout the day. \"i was wondering why it was that slippery,\" she said. tcaps staff members were ok and finished the school day, she said. the district contracts with companies to plow the parking lots before school starts each day, and custodians are supposed to lay sand for traction, said paul soma, chief financial officer and operations executive director. the contractor, s basch & son inc., is new to the school this year. soma said plowing was delayed monday morning. \"i hope that's not what led to this,\" he said. steve basch, the company's owner, said he asked soma if the school could put down more salt and sand after the lot was cleared. surface conditions are slick now because the ground hasn't frozen. \"it is so icy after you plow,\" basch said, adding that he began clearing the lot before school started. \"it snowed so hard between 4 and 7 (a.m.).\" "}, {"articleID": "2018022221_00356184_W", "names": {"Dean Robinson": ["Q16735312", "Q21285506"]}, "date": "2018-02-22", "url": "http://www.ithaca.edu/news/releases/k-i-s-s-i-n-g-comes-to-the-ithaca-college-stage-49489/", "content": "Lenelle Möise's \"K-I-S-S-I-N-G' Comes to the Ithaca College Stage Ryan Dickson, 2/22/2018 Ithaca College Theatre presents\" K-I-S-S-I-N-G, \"a play about teenagers navigating emotional baggage and economic inheritances written by Ithaca College alumna Lenelle Moïse' 02. The play will be performed at Ithaca College's McCarroll Studio Theatre on February 23 and 24, and March 2 and 3 at 8:00 p.m., and on February 24 and 25 and March 3 at 2:00 p.m. Tickets are free and must be picked up at the entrance to the McCarroll Studio Theatre on the ground floor of Dillingham Center 15 minutes before the scheduled start of the performance. Reservations are recommended and can be made on Facebook or by emailing icstudio2tam @ gmail.com. Audiences are advised that this production includes mature content.\" K-I-S-S-I-N-G \"opens February 23 in the McCarroll Studio Theatre.\" K-I-S-S-I-N-G \"tells the story of Lala, an\" around-the-way-girl \"who meets the brainy and affluent Dani. Their instant flirtation grows into an inseparable season of firsts. The pair's playful debates about everything from visual art to old-school music seem romantic. So why haven't they started K-I-S-S-I-N-G? Moïse is an award-winning poet, playwright, composer and performance artist. With humor, charm and power, her solo performances address intersectional feminism, LGBTQ identities, black history, Haitian-American culture, immigration and inclusion. She is the author of the poetry collection\" Haiti Glass, \"a Lambda Literary Award finalist and winner of the 2015 PEN Oakland Josephine Miles Literary Award, and her poems and essays have appeared in numerous publications. Her plays include\" Merit, \"winner of the 2011--12 Ruby Prize, the off-Broadway hit\" Expatriate \"and\" The Many Faces of Nia. \"Moïse has returned to campus several times to speak and perform since graduating from Ithaca College in 2002 with a planned studies degree in\" women in storytelling. \"She is currently the college's playwright-in-residence, sponsored by the Department of Theatre Arts and the women's and gender studies program. She also hold an MFA in playwriting from Smith College, and was a Huntington Theatre Company Playwriting Fellow and a Next Voices Fellow at New Rep Theatre. Moïse leads energetic writing and movement workshops for students and creative adults. The cast of\" K-I-S-S-I-N-G \"includes Tyler Sapp' 18, Mariah Lyttle' 19, Dharon Jones' 20, Kellik Dawson' 20, Erin Lockett' 20, Drew Nauden' 20, Jahmar R. Ortiz' 21, Maya Jones ’20 and Jake Forehlich' 19. The production is directed by Ithaca College associate professor <mark>Dean Robinson</mark> and assistant directed by Devin Gatlet' 19. The design team includes scenic/costume designer Brock Viering' 19, lighting designer Shane Hennessy' 19, sound designer Ron Ziomek ’19 and art curator/movement consultant x rance' 18. The stage manager is Karley Davis ’19 and the dramaturg is Vanessa Reyes' 18. A nationally recognized professional theatre-training program, the Department of Theatre Arts attracts students from across the globe. Throughout the school year, undergraduate students present all aspects of theatre in a professional model. Follow Ithaca College Theatre on Facebook and on Twitter and Instagram at @ ICTheatreArts. Dillingham Center proudly accommodates all patrons. Individuals with special needs are asked to contact 607-274-3224 or email icstudio2tam @ gmail.com to request accommodations as soon as possible."}, {"articleID": "2018091115_00073286_W", "names": {"Michael Fink": ["Q18025929", "Q1927414", "Q19596670", "Q683541"]}, "date": "2018-09-11", "url": "http://lalouvedesmers.wordpress.com/2018/09/11/why-is-it-good-for-children-to-play-freely/", "content": "Free playtime is something I would qualify as a \"basic\" in my professionnal practice. It doesn't mean that I let the children playing alone during I share gossips with my coleagues, absolutely not. We call free playing also \"free activity\" which shows more the \"active\" side of it. What is it about? Concretely, you can set up a room with some toys, all reachable easily by the kids, and let them act as they want (as part as the house's rules, thought by the team!). And that's it? Actually not. To go further, I'll quote Anna Tardos (psychologist) describe it more in her article Une vie active (\"An active life\" , from Association Pikler-Lóczy de France, n ° 43, not translated in English). For her, there are some factors which help the child to have a better quality of playing: A physical and psychological wellness A long enough duration of playtime, and a regularity for it A big enough place to play, where the child can feel secure Some things to play which stimulate his activity The behaviour from the adults: being patient and letting the time for the children to act with independence With these elements, the child can use his energy to learn a lot of new capacities. Why is it interesting for children? Because it is part of their life! They actually learn so much without any free from adults' instructions. Playing is serious. \"We cannot suppose at first, how much he [a child] can learn while he handles something. He is not only learning to know himself, with his hands and feet, he is not only learning to use, to position his hands, to take things and to become more skilled, but he exercices also his attention, to stay focused and to discover what is around him. He learns that difficulties can be overcome and that one can conquer them by persistence. His success gives him the pleasure of discovering. He is learning how to learn. Most of us think that\" playing \"is something frivolous, only to get a child rid of boredom and so a waste of time. However, a child's first activity is to play: the baby is playing putting something in his mouth, touching, observing and manipulating the objects around him...but in the same time he is learning about the different textures, the colours, the tastes, to compare the sizes and the shapes...his curiosity will lead him to learn and master new concepts and movements. If we go further, he learns also some universal laws (like the gravity, probability, ...) and he learns function of his needs and interests, that makes it more efficient. So, during the firsts months, we can mostly observe manipulations games, and then, when the child is a bit more intellectually mature,\" Pickaboo \"games linked with the situations of separations he lives. Later, we will see more role-playing games, to play daily life scenes or other special moments thats chocked him, to be able to appropriate them and make them easier to tolerate. But this is not a rule, I summarize a lot! Free-playing, an activity that support children'S developpment Photo by Markus Spiske on Unsplash As I explained before, to play is connected with the child's development. Actually a child who can play freely will: Developp his motricity in his way and feel confident and strong Discover the world Start to learn school skills Developp his creativity and imaginaition Improve his social skills Developp a strong self-esteem, which looks at his own difficulties without dip into his self confidence...And so much more! I think it's important to instist on the ability of children to do it alone, I mean, an adult doesn't need to inerfere directly and to show how to do. That leads children to be more self-confident and to know themselves better, and also to feel comfortable in a group and with his interactions with others. Doing alone, a child feels that he is able to try new things and doesn't have a fear of failure...which becomes the opportunity to try again and learn. What are the adults suppose to do then? Their role is so important! He stays further back but must be watchful: he has to observe carefully children, and that is the basis of his role. He must act only if necessary and mostly to comment an action, to put a feeling in words, to explain a situation to a child who doesn't understand He will act physically only in case of danger for a child. The adult will show interest for a child's activity looking at him, giving sense to it with some words. His observations will be very useful too: it helps to know each child better, and so to better know his needs and understand more why is he acting in a certain way. Then the adult can offer other toys and objects that respond better to children's need in the group, reorganize the playing room. He is not passive at all because he will lead children with the choice of toys he gives, and his way of speaking with them, asking sometimes well-choose questions...Which kind of toys for a free-playtime? Absolutely everything if it fits with children's needs and capacities! For my, less oriented is a toy to a type of game, better it is. I would say also that all toys that put children in a passive state (like babies' computers, tablets, smartphones or every noisy -\" pedagogic \"- things). With an\" open \"toy, which gives a plenty of possibilities to play with, a child can imagine an infinity of games, developp his creativity, and make new discoveries with only one object. For example, these toys with rings in different size that we can put in the size's order on a stick: it's obviously possible to rank them from the smaller to the bigger, a child can also manipulate and discover what is the particularity of this shape, to make it roll, or turn on itself, to mix it with other toys to do something new...Another example: these cubes that can be integrated one into another, like Russian dolls. It is possible to make a tower with it, to rank them, discover their shape, to hide other things insid and to learn about their capacity by fulling them...But so many other toys are insterstings: small cars, dolls, doll's tea...most of everything as long as we let children playing by themselves. Adults doesn't have to intervene and say\" You should do it like this...\"or\" No like this it doesn't work! Look, I show you. \"or everything that could influence a child's game. Antje Bostelmann and <mark>Michael Fink</mark> describe 10 types of spontaneous games that we can observe with children (until 3 years old) playing freely) in the book Elementare-spielhandlungen von Kinder under 3: Erkennen, Begleiten, Fördern (not translated in English). They distinguish: Photo by Alexander Dummer on Unsplash The things to hide To investigate how things fall down To investigate the sound of the things To reach behind the surfaces To move things To connect things To rank things To change and alternate the perspectives To mark and create new places To experiment the balance This is only an example of categorization but I find it useful to start to observe children playing. But as each individual is different and that so many elements of context can influence a situation, I think that it is restrictive to only be based on a list with types of games. But let's notice the use of the word\" Thing \"(\"Ding\" in German) instead of \"Toy\" (\"Spielzeug). That's underline that a child uses first objects, not toys to play...So actually, almost everithing can be used! So, be creative! Do you ever see a child who just received a present, playing with the gift wrap, and forgot the new toy? To go further...If you are curious, please, take a look to that we call\" alternative pedagogies \", particulary Emmi Pikler. Her pedagogy is actually based on the free-play and free-motion, mostly in direction of children under 3 years old. The association exists in different countries and offers trainings in diverse topics about the young child. In the UK: http: //www.pikler.co.uk/ In the USA: https: //pikler.org/ The Hungarian Website (but offers the books and trainings in many other languages, like German en Spanish): https: //www.pikler.hu/ About how to speak to children, as a French, I can advice you the Françoise Dolto's books like The Cause of Children, Underlying Stages of Childhood, and Everything is Language. But in the same topic, you can also find interesting books from the Pikler Institute. And for the German speakers, I will recommend you the book I mentioned before: Elementare-spielhandlungen von Kinder under 3: Erkennen, Begleiten, Fördern from Antje Bostelmann andMichael Kink, which is a good tool to begin with children's observation. Photo by Yasmin Dangor on Unsplash Advertisements Like this: Like Loading...Related"}, {"articleID": "2018032315_00204900_W", "names": {"Adam Taylor": ["Q4679884", "Q47127244"], "Terry Lewis": ["Q18217487", "Q20202280", "Q28869484", "Q7701944", "Q7704684"]}, "date": "2018-03-23", "url": "http://www.heraldtribune.com/news/20180323/morales-tapped-to-be-interim-north-port-police-chief", "content": "Morales tapped to be interim North Port Police Chief Friday Mar 23, 2018 at 11:33 AM Mar 23, 2018 at 11:38 AM Earle Kimel Staff Writer @ earlekimel NORTH PORT--North Port Police Capt. Christopher Morales will become the interim police chief of the agency, effective April 1, following current Police Chief Kevin Vespia's retirement at the end of this month. North Port City Manager Peter Lear named Morales, 39, to the post Thursday afternoon, following a day of rank-and-file promotions in the police department, with officers Pam Jernigan and Joe Fussell being promoted to the rank of commander and Ryan Curry, Kevin Lyon and <mark>Adam Taylor</mark> elevated to sergeant. Assistant Police Chief Mike Pelfrey was placed on paid leave of absence, while the agency investigates an unspecified complaint filed against him. Morales has more than 18 years of experience with the North Port Police Department. Prior to being hired as an officer in 2000, he was a North Port Police Explorer and Sarasota County sheriff's corrections officer. In February 2011, he was promoted to sergeant, assigned to road patrol, and was later reassigned to the Criminal Investigations Division as the detective sergeant over the Person Crimes Unit. As a captain, Morales has had a hand in creating the police department's computer forensic lab, narcotics unit, special response team and traffic unit. He currently oversees the patrol bureau which, among other things, includes civilian community service aides, the K-9 program and special enforcement and response teams. Morales is a a graduate of the FBI National Academy 264th Session and has obtained the Leadership Trilogy status through the FBI-LEEDA program. He is also the recipient of the 2014 Command Officer of the Year Award for the Southwest Florida Police Chiefs' Association. Lear announced Morales' appointment in an email to city staff that was accompanied by a statement from Morales that read: \"I have a strong commitment to my family, as I currently coach both my kid's soccer teams in our community. I do understand the commitment involved with being a Police Chief; however, I also want to ensure I am also available to my family, which is why I agree to serve only on an interim basis.\" Once a new Chief of Police is selected for the Department, I look forward to returning to my current position, where I can assist the chief with the implementation of his/her visions and mission. \"Vespia said in an email to North Port police officers that he was confident in Morales as interim chief. It could take another six months for the city to find a new police chief. Earlier this month, Lear rejected all four applicants from a previous search to succeed Vespia, an 18-year veteran of the North Port department, saying that while all four candidates were very good,\" the community deserves better than a good candidate. \"Morales' statement suggests that he is not interested in applying for the top job at this time. If so, that would break a string of recent top jobs in North Port being filled internally by interim appointees. Both Lear and City Attorney Amber Slayton were promoted into their roles after serving in an interim capacity. Vespia was named chief in February 2011, after serving as interim. He was the first North Port police chief to ascend through the ranks to the top job. He was appointed interim chief by <mark>Terry Lewis</mark>, who left that role to become city manager. Morales was the lead detective in the abduction and murder of Denise Amber Lee in 2009. In 2006, he was part of the team of detectives to work on the 2006 murder of 6-year-old Coralrose Fullwood. Information from Herald-Tribune archives was used in this story."}, {"articleID": "2019082107_00145751_W", "names": {"Prem Singh": ["Q28058336", "Q28419672", "Q7240178"]}, "date": "2019-08-21", "url": "http://telegraphindia.com/india/chidambaram-seeks-papers-from-company-demanding-rs-10-000-crore-damages/cid/1699302", "content": "India Chidambaram seeks papers from company demanding Rs 10,000 crore damages The company, 63 Moons Technologies, has alleged that it was targeted as part of a \"conspiracy\" hatched by Chidambaram and two others By PTI in Mumbai Chidambaram in New Delhi on Tuesday. Picture by <mark>Prem Singh</mark> Former Union finance minister P. Chidambaram, who is facing a summons from Bombay High Court in a suit filed by a technology company seeking Rs 10,000 crore in damages, has sought a copy of the complaint and other relevant documents from the firm. The high court on July 24 directed Chidambaram and two bureaucrats to remain present in person or through their lawyers on October 15 to respond to the claims made by the company, 63 Moons Technologies, formerly known as Financial Technologies Ltd.. On August 14, Chidambaram's lawyer Nitesh Jain sought a copy of the complaint and all documents that the company had relied upon. \"The summons was not accompanied by a copy of the plaint or any other annexures, hence the summons is in non-compliance with relevant provisions of the Code of Civil Procedure,\" the letter by Chidambaram's lawyers said. The company's lawyer, Bhavesh Thakur, on Tuesday said after receiving the letter, a copy of the suit and other relevant documents were sent to Chidambaram. 63 Moons Technologies filed the suit on June 12 against Chidambaram, ministry of skill development secretary K.P. Krishnan and former Forward Markets Commission (FMC) chairman Ramesh Abhishek. The company alleged that it was facing continuous \"targeted and malafide actions\" in the wake of an \"engineered payment default crisis\" at one of its subsidiaries, the National Spot Exchange Limited (NSEL). It claimed that the probe by multiple agencies did not find any money trail reaching NSEL, 63 Moons and its founder Jignesh Shah. However, the group was targeted as part of a \"conspiracy\" hatched by Chidambaram, Krishnan and Abhishek, the suit alleged. Tags"}, {"articleID": "2019013002_00251294_W", "names": {"Peter Lyons": ["Q16731736", "Q42763596"]}, "date": "2019-01-30", "url": "https://www.nzherald.co.nz/opinion/news/article.cfm?c_id=466&objectid=12198612&ref=rss", "content": "Political Roundup: KiwiBuild - fix it or ditch it? 30 Jan, 2019 2:03 pm Share on Reddit reddit COMMENT: Given the ongoing problems with the Government's flagship housing policy, it seems inevitable that a major change of direction is required for KiwiBuild. A consensus is growing that the policy either needs to be revamped or replaced with something more effective and ambitious. Today the New Zealand Herald has called for the Government to \"think again about KiwiBuild\" --see its editorial: KiwiBuild not only weapon in armoury. Advertisement Advertise with NZME. The newspaper emphasises that there are other options for dealing with the housing crisis, some of which the Government has already been successfully utilising: \"Tax proposals, tenancy laws, banning foreign buyers, state house building and infrastructure bonds were all just as important.\" The problem with KiwiBuild lies at its very core, as it has not been well thought out: \"Not much market research appears to have been done before KiwiBuild was adopted. Some should be done if the Government is determined to press on with the programme.\" For the most rigorous and important ideas about fixing KiwiBuild, it's worth looking at what economist Shamubeel Eaqub proposes. He wrote the original book, \"Generation Rent\" , about the housing crisis, and especially how it's impacting on those at the bottom. Two days ago, his strong views about how \"KiwiBuild is not fit for purpose\" were published in Catherine Harris and Bonnie Flaws' article, Kiwibuild should build more rental properties economist Shamubeel Eaqub says. Eaqub argues that it's time for the Government to shift to building rental properties--and perhaps even more state housing. He claims that KiwiBuild's core focus on increasing home ownership is simply misguided, especially given that the Labour-led Government isn't willing to adequately fund the programme. The economist says that even if KiwiBuild meets its target of 100,000 houses, and if the private market also builds 250,000 homes, New Zealand will still be short of 200,000 homes. So however you look at it, the Government's current plans are inadequate: \"Not only are we not keeping up with population growth we are not even meeting current need. We need to much more ambitious about scaling it up massively.\" Related articles: Quick Read Rental housing has traditionally been the best way to deal with a housing crisis according to Eaqub: \"The reason why I think build to rent has to be the answer is because that is how they solved the housing crisis post-war in Europe.\" To achieve a big increase in rental housing, the Government has to go beyond the current KiwiBuild plans: \"Eaqub said that the problem is too big to be able to fix with $2 billion, the size of KiwiBuild's fund. Instead he said we could partner with institutional investors to build rental properties or use the deep pool of money in Kiwisaver.\" Back in December, Eaqub also made the case for the Government to move more into providing rental accommodation rather than the less-affordable KiwiBuild houses, saying that the market doesn't have the capacity to provide much social housing. \"At the moment there is no one who can really do that, but if the Government says we're in the market to essentially procure X thousand units of\" build to rents,' and we're going to underwrite the rent at some kind of indexation, the stuff would be built \"--see Catherine Harris' Kiwibuild could\" underwrite rental and social housing'. For further critiques of KiwiBuild by Eaqub, see Dan Satherley's KiwiBuild: Government \"recalibrating' targets for under-fire housing scheme. In this, the economist argues that KiwiBuild is currently the wrong solution to the problem. He says it was\" never going to fix the underlying problems of the housing market \", which include\" planning rules, infrastructure and funding for local government \". Phil Twyford announcing new housing policy at the home of Stephanie Belcher in Tamatea, Napier. Share on Reddit reddit He reiterates that just trying to get prospective homeowners into brand new houses is the wrong approach:\" The new houses are expensive. In reality, what we really want to do is increase the supply of rental stock. That's what New Zealand desperately needs--good quality rental stock that's owned by institutions and well-managed. \"Also questioning the focus on brand new houses is Massey University economist Oscar Lau, who says:\" Why do the homes have to be brand sparkling new? New properties inevitably attract high bids and poorer families who just want to own a modest home will miss out. Instead of building new homes, the Government could buy a wide range of existing properties of different sizes, ages and in different neighbourhoods--and auction them off to qualified buyers \"--see: An alternative to KiwiBuild that makes economic sense. Therefore, KiwiBuild could be selling existing homes rather than building new ones, and leave the expensive new homes to the private market. Lau explains further:\" This way the Government doesn't need to meddle in property development. It doesn't need to struggle with construction schedules. To avoid exciting the market, it would need to buy gradually and orderly, rather than splurge. More importantly, it could release some KiwiBuild land to the market for development, so new supply will balance its purchases. \"If the Government is determined to focus on home ownership, then it's going to have to get more ambitious, and find some bigger and better ways of delivering. One such way is to use mass prefabrication, which the Government has so far been reluctant to invest in with KiwiBuild, probably because of the initial cost outlays. How it works overseas Other countries have, however, successfully used mass prefabrication to solve housing crises. For the best outline of this, see Catherine Harris' The key to Sweden's million houses target--and Kiwibuild's. Here's the key part of the article:\" If you think the Government's KiwiBuild target to fix the housing shortage is overly ambitious, just look at Sweden. In 1965, with a population of 8 million, the Nordic country began its \"Million Homes' plan to build 10 times as many houses as New Zealand's target within 10 years. By the end of 1974, it had exceeded its target by 6000...How did they do it? Largely through prefabrication.\" In this story Harris says, \"Research suggests offsite manufacturing can slash 15 per cent off the cost of building and speed up the time it takes by 60 per cent.\" One person with an interest in this is The Warehouse founder Sir Stephen Tindall, who says \"You can construct houses for almost half the price that they cost here\" --see the Herald's If anyone can bring house prices down, it's him: REINZ welcomes Tindall's KiwiBuild interest. According to this story, \"The Real Estate Institute has backed Warehouse founder Sir Stephen Tindall's interest in KiwiBuild, indicating that if anyone can bring down house prices in this country, it's him. Bindi Norwell, REINZ chief executive, welcomed Tindall's announcement that he was assisting one of the 102 off-site manufacturing KiwiBuild tender parties\" . Perhaps, therefore, the Government just needs to contract one big company to progress KiwiBuild. This is the view of \"construction industry expert\" John Tookey, who is reported as arguing that KiwiBuild \"would have been more efficient to award a large scale contract to one company\" --see Emma Hatton's Building industry not surprised KiwiBuild won't hit target. The same article also suggests that the current KiwiBuild bureaucratic processes need streamlining. Property Council chief executive Leonie Freeman is reported explaining why developers haven't been more involved in KiwiBuild: \"Some of the feedback we've received is that from then on the process has been slow and very bureaucratic.\" Others in the construction industry are forecasting some big changes to KiwiBuild. For example, Property Institute chief executive Ashley Church outlines expected alterations: \"This will take the form of changes to eligibility criteria, a coordinated Government\" charm offensive' to private developers, or some form of state subsidisation or delayed payment, or any combination of these \"--see Catherine Harris and Bonnie Flaws' article, Kiwibuild should build more rental properties economist Shamubeel Eaqub says. The same article also draws attention to the Government's progress on establishing Urban Development Authorities (\"UDAs have the power like the NZ Transport Authority to use the Public Works Act if necessary to confiscate land\" ), and the promise to establish some sort of \"shared equity scheme\" for new home buyers. In terms of possible rent-to-own schemes, it's worth reading Stephen Forbes' The Labour-Greens confidence & supply agreement promotes \"progressive' housing ownership models. Here's the key part:\" Under the confidence and supply agreement between the Greens and Labour, both parties agreed to develop a rent-to-own scheme, or a similar progressive ownership model, as part of the KiwiBuild programme. Despite comments from minister for housing and urban development Phil Twyford last year that the Government was looking at the feasibility of shared equity housing, no details have been officially announced to date. \"But is the problem of the housing affordability crisis even one of supply? This is apparently what KiwiBuild is predicated on, and <mark>Peter Lyons</mark> challenges this in his column, Housing issue more complex than Govt might have thought. Finally, is the Labour-led Government even inclined to fix KiwiBuild? Chris Trotter has written an extensive and insightful column about how the KiwiBuild scheme was created specifically within Labour to uphold neoliberal or conservative policy settings, and therefore there will be little appetite amongst the\" Labour right \"to bring about a housing programme based on\" transformation \"or\" kindness \"--see: On how middle class housing subsidies overwhelmed the social housing priorities of the Labour Party's rank-and-file members."}, {"articleID": "2009122006_00072869_W", "names": {"Zheng Zhou": ["Q45497032", "Q45533120", "Q45536971", "Q45538389"]}, "date": "2009-12-20", "url": "http://nst.com.my/articles/20091220141812/Article/index_html", "content": "china: climate talks yielded \"positive' results - the associated press new afghan cabinet list draws ire from legislators - the associated press legislature to consider end to death penalty - kansas city star faith the two-legged dog to be reunited with rescuer - los angeles times (blog) shuib on sunday: a tall order she's not 2009/12/20 shuib taib cassandra patrick has no qualms having appointments early in the morning. the former first runner-up of both miss malaysia/world 2006 and miss malaysia/universe 2009 not only turned up on time, she came fully made-up and prepared. as she has taken part in several beauty pageants and worked as a model, she only knows too well that to be successful in any field, one has to have discipline. but cassandra has more than just that. meeting her for the first time, i was instantly struck by her beauty. you see, cassandra has a rich and varied her itage. her dad is part punjabi and dusun from sabah. her mum is scottish and kadazan while her late grandfather was part indonesian. hence her exotic looks. standing at 5' 10\" (minus the heels mind you!), cassandra said ever since she was a child, she had always wondered what it was like to be a beauty queen. \"watching the girls clad in beautiful gowns and looking so poised and all, i've always wanted to be in their shoes or their gowns! so i decided to enter some beauty contests just to see what it's like,\" said cassandra, whose grandmother, mother and aunts were all winners of local beauty pageants in their heyday. \"when i joined the 2006 miss malaysia/world, i was very naive. i was pretty bad in fashion and hated high heels. but then i read magazines and learnt how to do make-up and hair from industry experts. i was also lucky to have people like marina suwendy (a successful local model now based in new york) teaching me everything i needed to know about this industry.\" suwendy was so graceful that when she walked, everyone will watch. i was the total opposite! \"still, when she represented the country at miss tourism queen international in <mark>zheng zhou</mark>, china, last august, cassandra made it to the top 20 in a field of 98 contestants.\" my chaperon told me, \"this is a competition, so you better absorb it like a sponge\" . she also said the judges were not looking at our body alone but what's inside. i'm also grateful to my trainer, simone teh (a former model), who taught me to walk right. \"the experience was amazing. we went for tours and learnt some basic chinese martial arts like kung fu and tai chi. but what i like most about china is that the people are very proud of their country. we should emulate that spirit.\" cassandra, born in the united states but raised in sabah, started modelling at the age of 15. her parents made sure that both their daughters received the best education. \"i modelled for several years during my teens but had to stop because of my studies. my dad holds two masters, so naturally, he wanted us to follow in his footsteps. model and former beauty queen cassandra plans to release her single next year. when my sister earned a government scholarship to pursue her studies, my mum was so fired up that she pushed me to do the same.\" after finishing school, i went to br itain to do my a-levels and came back to do my stpm. i don't come from a rich family, so i studied in a government school for my stpm because it was cheaper. after i had completed my stpm, i enrolled in kdu to read law. \"due to financial problems, she defer red her studies but plans to complete them once she is able to do so. in the meantime, the lass wants to give singing a shot.\" i come from a musically-inclined family. my dad plays the guitar and keyboard and has a band of his own. he also sings and he does remind me of ole' blue eyes, frank sinatra, when he wakes us up in the morning with his singing! \"my mum also sings. when i was a kid, my dad always put me out there at family gatherings to entertain the crowd. i gladly obliged and would give my best rendition of leann rhymes' how do i live. it's the song i sang at school auditions to get into the choir,\" she remembers with a laugh. by the way, she did get into the school choir. by next year, we should be able to sample what exotic cassandra has to offer as she is working on her first single. what is it going to sound like? \"for now, all i can tell you is that the song is going to be a pop number,\" said cassandra. although she stands at a commanding height, it is hard to believe that the industry hasn't really noticed this down-to-earth personality. cassandra, who speaks malay, english, kadazan, dusun and a smattering of hindi (\"my late grandpa used to make me watch all the bollywood movies while my mum loved any p. ramlee flick\" ), is also adept at hosting. \"local designer syeba yip was the one who pushed me into doing it. thanks to her, i hosted mifa (malaysia international fashion week) two years in a row now. i am now not as jittery as before. it's good to know that i have built some self-confidence.\" cassandra is afraid she would have nothing to fall back on should she not make it in show business. but then again, this typical leo, who describes herself as \"tough but loving\" , is intent on marching forward with her plans. \"life is full of challenges and i thrive on that. life can also be simple, so why make it difficult, right?\" i couldn't agree with you more! singing * sports car or suv? sports car, especially the luxurious aston martin. i love speed! * manchester united, liverpool, chelsea or arsenal? used to be an mu fan but arsenal is pretty cool. watches, they are more personal. * country, pop, rock or hip hop? kampung music (keyboard and vocals) can ah? i'll probably go for rock! * beach or mountain holiday? how can you compare anything to beaches? i want to go back to sabah! * dream holiday destination? either tahiti, maldives, mauritius or seychelles! * sabahan, chinese, japanese or french food? sabahan food, especially hinava (raw fish with squeezed lemon). now you are making me hungry! * favourite local and international singer? sheila majid and whitney houston. * favourite band? face-to-face with jaclyn when i was asked to interview jaclyn victor, i was ecstatic. i'd never interviewed a...foodie tour of penang some foods just taste better in penang, like char kway teow, cendol, nasi kandar and fruit rojak. ..."}, {"articleID": "2017111608_00492452_W", "names": {"Ben Spencer": ["Q15623878", "Q16235043"]}, "date": "2017-11-16", "url": "http://www.tribtown.com/2017/11/16/fire_hits_recycling_center/", "content": "Firefighters from several volunteer fire departments continued to try to put out a blaze Wednesday afternoon that began as a large structure fire more than 12 hours earlier. No one was injured in the fire on the 19-acre site owned by Charlotte W. Helt, who once operated the recycling center with her late husband, Roger W. Helt. Charlotte still lives in a home on the property at 10770 E. County Road 125S. The fire was first reported at the former Helt Enterprises-Recycling site south of Seymour to the Jackson County Sheriff's Department at 10:56 p.m. Tuesday. Firefighters from several departments extinguished the blaze, but it rekindled about two hours later and was still burning Wednesday afternoon. Story continues below gallery 1 of 4 20171116st recycling center fire 02ajp Tribune photo by Aaron Piper / Firefighters respond to a fire at a former private recycling collection site in Jackson County on Wednesday. AARON PIPER | THE TRIBUNE Tribune submitted photo by Hamilton Township Fire Department / Firefighters respond to a fire at a former private recycling collection site in Jackson County on Wednesday. Tribune submitted photo / Firefighters respond to a fire at a former private recycling collection site in Jackson County on Wednesday. Tribune photo by Aaron Piper / Firefighters clean up a fire at a former private recycling collection site in Jackson County on Wednesday. Crothersville-Vernon Township Fire Chief <mark>Ben Spencer</mark> said the cause of the fire remained under investigation Wednesday afternoon. \"We're working closely with the Indiana State Fire Marshal's Office to determine the cause of the fire,\" he said. He said he expected it to burn into the evening. The fire was difficult to extinguish because of the materials involved, which included plastic, tires, pallets and other materials, he said. The water firefighters sprayed on the burning plastic cooled it, which was essentially creating a shield for the flames burning underneath. That's the type of fire that fire officials consider \"deep-seated fires,\" <mark>Spencer</mark> said. One solution <mark>Spencer</mark> and other firefighters were exploring Wednesday afternoon was the use of an excavator to move the piles around so water could reach the flames. \"There are residences nearby, and that's why we're doing what we're doing trying to put this fire out,\" he said. <mark>Spencer</mark> said the fumes from the plastic burning was the primary concern of fire officials, and representatives from the Indiana Department of Environmental Management and Jackson County Health Department were on scene. \"We have a gas meter out to monitor the levels and are looking at that,\" he said, adding the situation seemed to improve as firefighters contained the fire. \"We're seeing a lot of steam now, but when we were first here, it was heavy black smoke.\" The rural site is at the edge of a wooded area, but firefighters were able to stop the fire from spreading to that area. Rainy conditions in the morning and afternoon also helped keep the fire contained. \"It's helped, but it has hampered some of our guys,\" <mark>Spencer</mark> said, adding many had been on site since the fire was first reported. This is not the first fire on the property. A fire was reported in April 2000 when the site still operated. That fire involved similar materials and included one minor injury of an employee. The Seymour Fire Department and Grassy Fork, Jackson-Washington, Brownstown, Redding and Hamilton township volunteer fire departments assisted with the fire."}, {"articleID": "2014022800_00086728_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Dan Shaughnessy": ["Q27891420", "Q5214372"], "Michael Barrett": ["Q16028043", "Q17093945", "Q19876367", "Q55594034", "Q56762153", "Q6828461"], "David Brown": ["Q1173842", "Q1173844", "Q16105866", "Q16196848", "Q18350546", "Q19596609", "Q21005198", "Q25412997", "Q26760987", "Q27830823", "Q3529051", "Q369175", "Q43910707", "Q5231797", "Q5231801", "Q5231803", "Q5231808", "Q5231809", "Q5231810", "Q5231811", "Q5231813", "Q5231814", "Q5231816", "Q5231817", "Q5231820", "Q5231821", "Q5231822", "Q5231996", "Q55854088", "Q55946414", "Q56253122", "Q56558031", "Q57850670", "Q58271225", "Q58481949"]}, "date": "2014-02-27", "url": "http://ca.sports.yahoo.com/blogs/mlb-big-league-stew/j-pierzynski-rod-took-over-most-hated-major-163544778--mlb.html", "content": "(Getty) Finally, some shade for A.J. Pierzynski, long-reputed to be the most-hated player in Major League Baseball: It's A-Rod's turn now. Even though he's sitting out the 2014 season because of his Biogenesis suspension, slugger <mark>Alex Rodriguez</mark> has eclipsed Pierzynski as the least-liked guy in MLB. At least that's Pierzynski's view, judging by an interview with columnist <mark>Dan Shaughnessy</mark> in the Boston Globe: According to a 2012 Men's Journal poll, Pierzynski is the Most Hated Player in Baseball. \"I just laugh at it,\" he said. \"I think it's cool. I've won it a bunch of years in a row. They just change the title around. They change a couple of words.\" True. In various other polls, Pierzynski has been cited as \"Player You Would Most Like To See Beaned\" and \"Meanest Player\" in baseball. \"I think I've won it before so it's just an easy answer,\" he added. \"But I think A-Rod took over for me this year.\" Is there a trophy that comes with the coveted \"most hated\" distinction - something that gets passed along from year to year like the Stanley Cup? \"No,\" said Pierzynski. \"You just get awkward questions by media people every day.\" Awkward, my Aunt Fannie. Pierzynski has loved the attention, he's sought it, he's cultivated his image to reflect it. He even plays into it on the baseball field. If he could bring a folding chair onto the field and whack somebody with it, like a pro wrestler, he would. He's a professional irritant, as <mark>Shaughnessy</mark> notes Tom Verducci having said. Pierzynski is an adult Dennis the Menace, but with a mean streak. And yet, it does ring true that A-Rod is more hated now. Heck, the some of his colleagues practically expressed how much they wanted to beat him up after <mark>Rodriguez</mark> sued the players union. Remember when <mark>Michael Barrett</mark> actually did punch Pierzynski in the face? He was living many an opponent's and fan's dream. Still, with A-Rod being sidelined for the season, Pierzynski still might be the most hated active player in the majors. He's still got that going for him, which is nice. Overall, <mark>Shaughnessy</mark>'s column is entertaining. He compares Pierzynski to Danny Ainge, which really is sort of perfect - even though everything doesn't have to do with Boston, you know? But it's also dead-on. He's the guy you least want to lose to. - - - - - - - <mark>David Brown</mark> edits Big League Stew on Yahoo Sports. Have a tip? Email him at rdbrown @ yahoo-inc.com and follow him on Twitter! Follow @ AnswerDave"}, {"articleID": "2016071215_01046295_W", "names": {"Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"]}, "date": "2016-07-12", "url": "http://krcrtv.com/news/politics/house-republicans-grill-loretta-lynch-over-clinton-emails/40469788", "content": "Home House Republicans grill Loretta Lynch over Clinton emails Republicans have asked DOJ to investigate Clinton for perjury By Eugene Scott CNNPOSTED: 49 mins UPDATED 42 minsText Size: Would you like to continue watching? Yes LIVE: House Judiciary / DOJ Oversight hearing WASHINGTON (CNN) - Attorney General Loretta Lynch testified Tuesday before a congressional subcommittee where House Republicans were eager to grill her about the decision not to pursue charges against Hillary Clinton over her use of a private email server. Related Gen. <mark>Michael Flynn</mark>, possible Trump VP pick Lynch defended her actions, saying she was accepting the recommendation of the FBI. \"Their unanimous recommendation was that the matter be resolved in the way in which we announced, and I accepted that recommendation,\" Lynch said. House Judiciary Committee chairman Bob Goodlate, a Virginia Republican, rejected the FBI's conclusion, saying, \"the FBI's conclusion leaves many more questions than answers.\" \"The American people also expect government officials to abide by the law just like everyone else and to be reprimanded when they break the law, just like everyone else,\" Goodlatte said. Lynch also began her hearing highlighting the tension between African-Americans and law enforcement that shook the nation last week. \"As we grapple with the aftermath of these events, the Department of Justice will continue to do everything in our power to build bonds of trust and cooperation between law enforcement and the communities we serve. That work has never been more difficult--or more important,\" she said. Republicans grilled FBI director James Comey on the same subject last Thursday. Copyright 2016 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}]