[{"date": "2016-05-30", "url": "http://feeds.theroar.com.au/~r/theroar/~3/aK_xteycYKk/", "content": "Why State of Origin is great for the premiership competition The Tigers defeated the Origin-affected Broncos. (AAP Image/Action Photographics, Colin Whelan) Related coverage 2016 NRL ladder news Both the Broncos versus Tigers and Dragons versus Cowboys clashes reminded us on the weekend of the invaluable influence that Origin has on the premiership competition. On Friday night we witnessed a courageous Wests outfit clinch victory over a depleted Brisbane side lacking the outs of six Origin stars. Darius Boyd, Corey Oates, Sam Thaiday, Matt Gillett, <mark>Corey Parker</mark> and <mark>Josh McGuire</mark> were all missed in the Broncos' 18-19 loss. It was their forward pack that took the biggest battering, losing the metres gained battle 1398 to 1714 after having dominated in this area in their crushing 26-0 win over the Red V in Round 6. On the following night we saw a dogged St George side beat North Queensland 14-10. The visitors were without Origin superstars Johnathan Thurston, <mark>Matt Scott</mark>, <mark>Michael Morgan</mark> and James Tamou and subsequently recorded their lowest score for the year to indicate a lack of firepower in attack. At Lang Park it was a tale of Brisbane vying for its ninth win for the season hosting a side looking for just win number five and a club that not long ago had been thrashed 60-6 at the hands of the Raiders. South of the Tweed River, we then saw a side looking for its sixth win play host to a Cowboys outfit shooting for win number nine on the march to defend a premiership. The fact that in both games the competition underdogs came up trumps shows that Origin is great for the premiership competition as it serves to level-out team line-ups during the Origin period. Despite the salary cap, there is a clear discrepancy in talent across club rosters in the NRL. Brisbane, North Queensland and the Roosters all boast both a richness and depth of talent more impressive than all other clubs and head and shoulders above the rosters of Newcastle, Gold Coast and St George. The fact that six Brisbane players will run out for the opening Origin clash this Wednesday night, a number no other club equals, is a striking indication of the Broncos' unmatched squad. As equally as telling is that eight Brisbane stars were named for the Anzac Test early in May, likewise more than any other club. Playmakers <mark>Ben Hunt</mark> and Anthony Milford are also dominating the competition, the halfback leading in try assists and Milford a joint-first for leading try-scorer. Oates is also a top-five try-scorer and is running third in total line-breaks, while <mark>Parker</mark> is in the top five for total hit-ups. Although Wests are blessed with arguably the league's most promising crop of young, upcoming talent given the likes of fullback James Tedesco, halves Mitchell Moses and Luke Brooks, prop <mark>Aaron Woods</mark> and a wealth of exciting outside backs, it's a squad at this stage well behind that of <mark>Wayne Bennett</mark>'s boys and other clubs. If it wasn't for the competition-leveller that the Origin period is, the Tigers would have returned home winless on Friday night and we would have witnessed a thumping win to JT and clan at WIN Stadium on Saturday. <mark>Bennett</mark> has for a long time strongly opposed Origin in its current format and again didn't hold back in a recent press conference in the build-up to the series. \"If you look at the record books with the Broncos, nearly every season that I've coached here, we are somewhere where we are now and look at where we finish after Origin. We're all over the shop,\" <mark>Bennett</mark> said. The super-coach criticised the interstate rivalry despite admitting to his side being blessed with the best players in the competition. \"During the Origin period, we have to play Melbourne and be in Sydney and Auckland,\" he said. \"We are talking about the best players in the game, the best players in our team, not the second and third best players, our best players .\" The toll that Origin has on star-studded line-ups such as Brisbane's is huge, but it's exactly that which makes the three-game series great for the premiership competition. If the salary cap doesn't do a sufficient job of leveling the playing field, something else needs to stand up. Origin does when it starts to reel in the competition's high-flyers come the end of May every year. Cheer, cheer the underdogs.", "articleID": "2016052919_00182141_W", "names": {"Ben Hunt": ["Q2895471", "Q4885884", "Q4885885"], "Corey Parker": ["Q2997266", "Q5170422"], "Josh Mcguire": ["Q3810347", "Q6289170"], "Matt Scott": ["Q17017894", "Q6789302", "Q6789303", "Q6789304"], "Michael Morgan": ["Q105866", "Q29034109", "Q29643298", "Q3305171", "Q37668416", "Q3856229", "Q42889395", "Q43003052", "Q55362615", "Q57819952", "Q59196728", "Q6832903", "Q6832905", "Q6832906"], "Wayne Bennett": ["Q21463799", "Q3566816", "Q7975989"]}}, {"date": "2016-04-09", "url": "http://college.usatoday.com/2016/04/09/chalking-pro-trump-messages-set-off-storms/", "content": "Supporters in Madison, Miss., on March 7, 2016. (Photo: Justin Sellers, The Clarion-Ledger) If three is officially a trend, chalking is now a trendy--and highly controversial--way for <mark>Donald Trump</mark> fans to show their love. This week, two schools--the University of Illinois at Urbana-Champaign and the University of Tennessee at Chattanooga--jumped into the chalking fray, joining the headlines made in March at Emory University with pro-Trump messages scrawled on campus grounds. Following a now-familiar timeline, the chalked messages appeared and the storms followed. At UTC, it hit the student government. Hailey Puckett, a member of a UTC student government coalition called Empower UTC who chalked \"<mark>Trump</mark> 2016\" on April 5, was asked to resign by fellow coalition members. pic.twitter.com/qjcJUAvRuO--EMPOWER UTC (@ EMPOWER_UTC) April 6, 2016 Empower' s stance did not go over well with some students, who responded along the lines of this tweet. I am personally calling for the impeachment of @ UTCSGA PRESIDENT @ EMPOWERPhillip after his blatant violation of free speech and civil rights--Austin Sanders (@ ASanders_22) April 6, 2016 The next day, EMPOWER UTC members Phillip Stubblefield and Mikayla Long posted apologies. Stubblefield noted that his words had been poorly chosen. \"I fully support every individual' s First Amendment rights and the senator-elect has every right to support any candidate of her choosing,\" he wrote. I feel that I have to express my honest opinions and that I have to represent all students. pic.twitter.com/m7JxhpM3HF--Phillip Stubblefield (@ EMPOWERPhillip) April 6, 2016 Long apologized and noted that \"Hailey was asked by EMPOWER to resign from SGA because she disregarded her responsibility as an elected senator to represent the students that elected her. Her statement,\" Super proud of our art work, but I have a feeling half of UTCs campus is going to hate it' does not show that she is currently prepared to represent students effectively. That is the sole reason we asked her to resign. \"Regarding recent events: pic.twitter.com/xITD8o1SxH--Mikayla Long (@ mikaylasheaIong) April 6, 2016 Puckett' s message was later washed off by students who then chalked the message,\" Black UTC supports unity \"in its place, reports student newspaper The University Echo. Since, then, the newspaper says, other messages have been chalked, ranging from\" Power C 4 <mark>Trump</mark>, \"to\" UTC supports Hailey, \"\"UTC supports Black UTC\" to a \"<mark>Trump</mark> 2016 .\" The school has released a statement saying in part, \"Diversity--including diversity of thought--is a core value of the University of Tennessee at Chattanooga. This idea was put to the test when a question of free speech developed between several groups of students ....The heated dialogue that resulted was unfortunate but serves as a teachable moment for our students and the incoming student government leadership .\" The UTC administration has not played a role in this debate. \"Also on April 5, chalk messages were written on the University of Illinois at Urbana-Champaign campus. They included,\" They have to go back #Trump, \"\"Build the Wall\" and \"<mark>Trump</mark> Deportation Force .\" The messages appeared near the campus' Latina/Latino Studies building. In an email sent to the school community and obtained by USA TODAY College, the school said in part, \"We value discourse while also recognizing that offensive speech is protected by the First Amendment. The best recourse to speech with which we disagree is more speech .\" In a statement to the campus, Jonathan Inda, chair of the Department of Latina/Latino Studies, called the chalking \"unacceptable .\" \"It is no coincidence that a\" <mark>Trump</mark>' message was scrawled in front of the Department of Latino/Latina Studies building. Such a message was not intended to advance political dialogue, but to psychologically wound, breed intolerance, and create an atmosphere of insecurity for Latina/os on campus, \"he said. At Emory, students claimed they were\" in pain \"after seeing\" <mark>Trump</mark> 2016 \"tagged on campus. The drawings led a few dozen students to protest the school's administration building, The Emory Wheel reported. RELATED: Emory students protest pro-Trump slogans, say they don' t feel safe Emory University Students Afraid Of This And It Proves Millennials R Pansies | RedState https: //t.co/iCilyeF7DS pic.twitter.com/0DGsjB96jQ--Elisabeth (@ 10thAmendment) March 24, 2016 Students at various schools have expressed their concerns with the drawings Just came out of lunch and there' s\" <mark>trump</mark> \"written in chalk all over my school nice--Cam ✘ (@ qc_cam) April 7, 2016 Hearing that someone supports <mark>Donald Trump</mark> is like hearing nails on a chalk board .:))))))--Ethan' s girl ❤ ️ (@ AbbyMcGuire31) April 7, 2016 The <mark>trump</mark> wars are getting out of hand on campus y' all. The chalk art is just getting outrageous--Keimi Elizabeth (@ keimibeth) April 7, 2016 Someone wrote <mark>Trump</mark> 2016 all big in chalk in the yard--sydney jetmore (@ liilTokyo) April 7, 2016 Alexandra Samuels is a student at University of Texas at Austin and a USA TODAY College breaking news correspondent. Filed under: News Tagged: Alexandra Samuels, backlash, chalking, <mark>Donald Trump</mark>, universities", "articleID": "2016070114_00696655_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-07-01", "url": "http://www.montrealgazette.com/news/world/offers", "content": "Russian Defense Minister Sergei Shoigu, third left, visits the Hemeimeem air base in Syria, Saturday, June 18, 2016. Syrian President Bashar al Assad shakes hands with Russian Defense Minister Sergei Shoigu in Damascus, Syria, Saturday, June 18, 2016. Share Adjust Comment Print The Obama administration has offered to help Russia improve its targeting of terrorist groups in Syria if Moscow will stop bombing civilians and opposition fighters who have signed on to a ceasefire and use its influence to force Syrian President Bashar al-Assad to do the same. The offer early this week of what one administration official called \"enhanced information sharing\" does not include joint military planning, targeting or coordination with U.S. airstrikes or other operations in Syria. But it would expand cooperation beyond the \"deconfliction\" talks the U.S. and Russian militaries began last year to ensure their planes do not run into each other in Syria's increasingly crowded airspace. DefenCe Secretary Ashton Carter, who has long opposed any additional cooperation, said Thursday that if Russia would \"do the right thing in Syria--that's an important condition--as in all cases with Russia, we're willing to work with them .\" \"The Russians got off on the wrong foot in Syria,\" Carter said. The stated purpose of airstrikes Russia began last fall was \"to fight ISIL and...assist the political transition in Syria towards a post-Assad government .\" \"They haven't done either of those things,\" he said. Senior administration officials declined to discuss details of the proposal, saying that publicizing the content of diplomatic talks would undermine their possible success. \"We've made no bones about the fact that if the Russians, with their military presence in Syria, proved to be willing to focus those efforts against Daesh, then that's a conversation we would be willing to have,\" State Department spokesman <mark>John Kirby</mark> said. \"There have been proposals offered by multiple parties,\" he said. \"We're certainly not going to start laying those out publicly .\" The United States and Russia, while backing opposing sides in Syria's civil war, co-chair an international task force that agreed early this year--along with Assad and the opposition--to support a \"cessation of hostilities\" and begin negotiations for a political solution that would allow the international community to turn its full attention to the fight against ISIL. More than 400,000 Syrians have died in the civil war, which has also displaced half the population, with millions fleeing to neighboUring countries and beyond. The Islamic State of Iraq and the Levant and Jabhat al-Nusra, al-Qaeda's Syrian affiliate, are not parties to the truce. The administration has charged that Russia and Assad's forces have violated it by continuing to launch airstrikes and other attacks on the anti-Assad opposition and civilians, under the guise of targeting the terrorist groups. \"What has prevented us from being able to more effectively coordinate militarily is that what the Russians have been militarily doing is propping up Assad and not going after ISIL,\" White House press secretary Josh Earnest said. Russia has defended its actions, and those of Assad, by saying that U.S.-backed opposition fighters are interwoven with Jabhat al-Nusra forces, especially around the northwestern Syrian city of Aleppo. While violations of the truce have escalated throughout Syria's populated western third, Aleppo has become the epicenter of fighting. Jabhat al-Nusra forces are principally massed to the south of the city. While the administration has acknowledged some overlap in opposition-held areas to the north, officials charge that Russia's principal interest in bombing there is to help Assad's forces close rebel and humanitarian supply lines across the nearby Turkish border. The advance of ISIL fighters to areas close to Aleppo and other populated areas has also brought U.S. and Russian aircraft into closer proximity over the complicated Syrian battlefield. ISIL has rarely clashed with Assad. In early May, as the cease-fire and U.N.-shepherded peace talks headed toward collapse, Secretary of State <mark>John Kerry</mark> and Russian Foreign Minister Sergei Lavrov agreed to send senior military officers to \"sit at the same table\" in Geneva, where they set up a center to monitor violations. Weeks later Russia--which has long sought more coordination with the West in Syria--proposed joint airstrikes against Jabhat-al-Nusra with the U.S.-led coalition that is bombing ISIL positions. Although U.S. officials were dismissive, the proposal unsettled U.S.-backed opposition representatives, who feared a backroom U.S.-Russia deal. They have said they will not return to the negotiating table until the violence abates. <mark>Kerry</mark> and other U.S. officials have remained in close contact with their Russian counterparts, trying out a series of possible initiatives to revitalize the cease-fire, including the new offer of increased intelligence sharing on terrorist positions. <mark>Kerry</mark> is \"fixated\" on the Syria issue, \"and he will stay so,\" <mark>Kirby</mark> said. <mark>Kerry</mark> has long advocated a more robust U.S. strategy to help the anti-Assad opposition, including additional weapons systems and the possible bombing of Assad's military assets. Internal unhappiness with the current strategy, and the humanitarian disaster the war has brought to Syria, led 51 U.S. diplomats last month to write an internal \"dissent channel\" appeal for U.S. military action. While President Barack Obama has steadily increased U.S. attacks against ISIL in Syria, he has rejected entreaties for more direct involvement in the civil war, saying that he does not see how it would improve the situation. But Obama has blessed efforts to persuade Russia to change its policies, including the intelligence offer. Administration officials believe that the Russians have no deep attachment to Assad himself but fear his removal would spark a collapse of Syrian institutions and allow terrorist expansion--something the Obama administration has said will happen if Assad remains. In an address Thursday to Russian ambassadors gathered in Moscow from across the world, President Vladimir Putin said that he was \"prepared to work with any future president\" and was interested in closer cooperation with the United States in international affairs. \"However, we consider unacceptable the approach on the part of the American establishment, which believes that they can decide in what issues they will cooperate with us,\" Putin said. Comments We encourage all readers to share their views on our articles and blog posts. We are committed to maintaining a lively but civil forum for discussion, so we ask you to avoid personal attacks, and please keep your comments relevant and respectful. If you encounter a comment that is abusive, click the \"X\" in the upper right corner of the comment box to report spam or abuse. We are using Facebook commenting. Visit our FAQ page for more information.", "articleID": "2016070119_00068702_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"]}}, {"date": "2016-07-04", "url": "http://economictimes.indiatimes.com/industry/telecom/government-woos-apple-to-set-up-stores-in-india-by-changing-sourcing-norms/articleshow/53038769.cms", "content": "Government woos Apple to set up stores in India by changing sourcing norms By Ruchika Chitravanshi, ET Bureau | Jul 04, 2016, 07.49 AM IST Post a Comment READ MORE ON & raquo; <mark>Tim Cook</mark> | Sourcing norms | Narendra Modi | iPhone | Devices | Apple Apple has been informed about the changes in sourcing conditions. \"It now needs to tell us if it wants to enter India under the new norms,\" said a government official. NEW DELHI: India has reached out to Apple on renewing its application to set up wholly-owned stores in the country after having been rebuffed the first time round over local-sourcing exemptions that the company had sought, officials said. With the rules for single-brand retail having since been tweaked, the company has a better chance of getting those exclusions, albeit for a three-year period. Apple has been informed about the changes in sourcing conditions relating to \"cutting edge technology' in single-brand retail, the officials told ET .\" The policy is in the public domain for anyone to access. However, a call was made to the company...Apple now needs to tell us if it wants to enter India under the new norms, \"said a senior government official who did not wish to be named. Apple couldn't immediately bereached for comment. The iPhone maker's application to set up its iconic stores was approved last month but the government did not relax the domestic sourcing condition. Under the changes made last month, single-brand retailers selling\" state of the art' or \"cutting edge technology' products will not have to meet this condition for up to three years from the commencement of operations. Following that, the rules will apply to them. This stipulates that for the first five years, average domestic sourcing has to be at 30% and subsequently the rule will have to be met annually. The government feels this is incentive enough for Apple to start retailing in India, which is seen as crucial for the company as markets elsewhe-re get saturated. India was among the few bright spots for the US-based company after global quarterly sales slumped for the first time in 13 years in quarter ended March. Apple won't need to submit a fresh application if it wants to avail of the exemption from sourcing for the three-year period, two senior officials said. It will, however, need to convey its request formally to the government. Apple currently sells its products in India through a network of franchisee-owned stores. Domestic sales crossed the $1billion mark in FY15. CEO <mark>Tim Cook</mark> is said to have discussed manufacturing and retailing of Apple products in India with PM Narendra Modi on a recent visit. <mark>Cook</mark> told Apple's India team during the trip that setting up company-owned stores is vital for Apple's longterm plans since these would set benchmarks in sales and services. In the FDI norms announced in November 2015, the Department of Industrial Policy and Promotion (DIPP) had announced a waiver of the sourcing condition for singlebrand retailers that introduce cutting edge technology. A three-member panel including the DIPP secretary, a member of the Niti Aayog and a representative of the administrative ministry had backed Apple's case for exemption. However, it was felt that such exemptions cannot be made for companies unless the term\" cutting edge' was clearly defined or there were conditions attached to the term and the finance ministry had denied the exemption. Under the rules, any foreign investment beyond 51% in single-brand retail requires 30% of the value of goods to be sourced from India, preferably from micro, small and medium enterprises, village and cottage industries, artisans and craftsmen. The government had allowed 100% foreign direct investment in single brand retail in January 2012. Stay on top of business news with The Economic Times App. Download it Now!", "articleID": "2016070402_00607283_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}]