[{"date": "2016-07-04", "url": "http://www.smh.com.au/comment/column-8/column-8-20160704-gpxxt6.html", "content": "Column 8 Reprints & permissions As there is to be a census in August, is there a legal or philosophical reason we could not have the same sex marriage question asked then? Would this not save the country a much needed $160 million, \"ponders Geoff Spicer in Lane Cove .\" Is there a reason why there seems to be more death and funeral notices in the Herald on Saturdays compared with weekdays? \"asks Allan Gibson, of Cherrybrook .\" Also during the week Wednesdays seem to reveal more notices than the other four days. Surely someone out there just dying (sorry unfortunate pun) to qualify for a C8Phd can bring life to this grave concern. \"\"It used to take me half my lunchtime to find the end of the cling wrap to get at my sandwiches. Putting the apple sticker under the last corner as I wrapped them solved that problem. And once you have found a use for the sticker it is no longer an annoyance,\" says Jock Brodie of Epping. \".. when did Um...You know...and I mean...become part of the Australian language? If you listen to people speaking on radio (Radio National is the worst) most interviewees cannot put a sentence together without saying at least four or five\" ums \", two or three\" you knows \"and in some cases\" I mean \". A couple of months ago a women on RN began each sentence with\" Um...you know...I mean...\"I had to turn it off. Surely these people know the subject before agreeing to be interviewed? Am I being too harsh?\" asks Greg Dark in Port Macquarie. Tidying up to Brexit TV (C8). \"It's not just that The ABC is screening 30 + years old episodes of The Bill that's a worry, <mark>John</mark> Rand; it's the amazing racism of the time being portrayed. That they are being screened in young children's viewing time in 2016 suggests that those responsible at the ABC haven't twigged yet what vile content some of these episodes contain,\" says Col Jackman in Bilgola Plateau. \"Far be it for Brexit to justify the removing of the old episodes of The Bill,\" says <mark>John Munro</mark> up in Middle Ridge, Qld. \"Let's hope we can look forward to reruns of Minder, The Avengers and Keeping Up Appearances, not to mention Are You Being Served and The Young Ones. Bring 'em all back .\" Brawl erupts at Melbourne Central Fists fly as security guards tackle teen skateboarder. (Video courtesy Seven News Melbourne) PT1M6S300169Mon Jul 04 09:12:01 UTC 2016", "articleID": "2016070411_00527369_W", "names": {"John Munro": ["Q23416422", "Q33127369", "Q43910966", "Q6249828"]}}, {"date": "2016-07-07", "url": "http://vindy.com/news/2016/jul/07/gingrich-joins-trump-for-rally-near-cinc/", "content": "Gingrich joins <mark>Trump</mark> for rally near Cincinnati news @ vindy.com SHARONVILLE Presumptive Republican presidential nominee <mark>Donald Trump</mark> used a stop in southwestern Ohio Wednesday night to call Democrat Hillary Clinton \"crooked .\" But <mark>Trump</mark> had nice things to say about his grandchildren, Republican U.S. Sen. Rob Portman and golf legend [and Ohio native] Jack Nicklaus. He touted his policy proposals to boost U.S. trade, bolster the military and set the stage for job creation. And he reiterated his plans to clamp down on immigration, particularly from countries that harbor terrorists, and to build a wall along the U.S. border with Mexico. \"And every time they fight us on that wall, it gets 10 feet higher,\" the billionaire businessman said to cheers from the hundreds of supporters who packed a suburban Cincinnati convention center. He added later, \"I'm going to keep our country safe .\" <mark>Trump</mark> didn't break much new ground. His comments were similar to speeches he's offered elsewhere in Ohio--\"We have a rigged system,\" he said. \"We have a crooked system ....The politicians aren't listening .\" A group of protesters and Hillary Clinton supporters also held signs and spoke to reporters across the street of the venue before the doors opened, calling <mark>Trump</mark> a \"Job Creator in Mexico, China, India [and] Singapore .\" <mark>Trump</mark>'s visit came about a week after Clinton and Massachusetts Sen. Elizabeth Warren, a potential running mate, spoke in Cincinnati. <mark>Trump</mark> arrived in southwestern Ohio Wednesday with former U.S. House Speaker Newt Gingrich, whose name has been mentioned as a possible vice president on the Republican ticket. \"Newt has been my friend for a long time,\" <mark>Trump</mark> said. \"And I'm not saying anything...but I can tell you, in one form or another, Newt Gingrich is going to be involved with our government .\" And both slammed Clinton, a day after the head of the FBI recommended no criminal charges against the former secretary of state for her use of a separate server to send governmental emails, some of which were confidential. \"Say lie, lie, lie, lie, lie--dirty rotten liar,\" <mark>Trump</mark> said, recounting comments Clinton made in the past compared with the FBI's findings. \"When you look at her decisions, when you look at the fact that she has gotten such bad decision-making ability ....She has got bad judgment .\" Other stories of interest", "articleID": "2016070705_00083543_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-07-07", "url": "http://kcbd.com/story/32388728/warning-for-children-surfing-the-web-this-summer", "content": "Warning for children surfing the web this summer - KCBD NewsChannel 11 Lubbock Warning for children surfing the web this summer - KCBD NewsChannel 11 Lubbock Member Center: Warning for children surfing the web this summer 2016-07-07T03:03:51 ZSource: KFDA NewsChannel 10Source: KFDA NewsChannel 10 AMARILLO, TX (KFDA) - Just like when we were told not talk to strangers as children, the same can be said online. In the ever-changing online world, it's possible for kids to come across something or someone that could do them harm. Police say it happens far too often and want parents to be more aware. Facebook, SnapChat, Instagram and Twitter are used multiple times every day. Kids are social and are using these apps and sites to share with each other. \"I think there's so many things out there now,\" said local parent, Craig Vaughn. \"When I was growing up all we had were encyclopedias. That was about all the technology we had .\" Vaughn has two kids, one of them a teenage girl who he tries to protect from potential online predators. \"Our computer is in the living room. If you wannause the main computer or lab top, it's in the living room,\" said Vaughn. \"So, everybody knows what you're doing .\" But the hardest thing to monitor are the smart phones. \"The kids have the computer in their pocket. You can't put it in a room where you can supervise them,\" said Sergeant Brent Barbee with the Amarillo Police Department. \"So, protecting them from predators and bad influences online has become more difficult .\" Barbee says the first step in protection starts with the parent. \"Sitting down with the children and having some really clear, frank discussion about ground rules,\" said Barbee. \"Rules like don't go to websites that other people tell you about, don't have contacts or conversations with people that you don't know in real life .\" Teach children to be smart while online--share with caution, that goes for pictures and details about their life. \"So often, very small things can turn into a lot of threat for a kid,\" said Barbee. Barbee also says parents should teach kids to be nice to others online and if your kids have a cell phone, know their apps. Check their privacy settings and make sure their information doesn't get in the wrong hands. All good advice for parents just like Vaughn. \"You might be saving your kid from big problems in the future,\" said Vaughn. Parents should also check the ratings and reviews of video games kids are playing. If they chat with other players online, make sure the child knows not to give out personal information. Copyright 2016 KFDA. All rights reserved. Local News on KCBD.com NewsMore>> Thursday, July 7 2016 10:04 AM EDT2016-07-07 14:04:31 GMTUpdated: Thursday, July 7 2016 10:04 AM EDT2016-07-07 14:04:31 GMT <mark>Donald Trump</mark> is paying his first visit to rank-and-file congressional Republicans, appearing Thursday morning at closed-door meetings of the House and Senate GOP caucuses. <mark>Donald Trump</mark> pledged adherence to basic Republican Party goals Thursday as he sought to win over rank-and-file GOP lawmakers skeptical he can beat Democrat Hillary Clinton in the fall. Thursday, July 7 2016 12:58 AM EDT2016-07-07 04:58:27 GMTUpdated: Thursday, July 7 2016 9:46 AM EDT2016-07-07 13:46:28 GMT A Facebook Live video captured the chaotic aftermath of the fatal police shooting of Philando Castile in Minnesota. As word of the shooting spread, protestors gathered at the governor's mansion in St. Paul, chanting, \"No justice, no sleep .\" A Facebook Live video captured the chaotic aftermath of the fatal police shooting of Philando Castile in Minnesota. As word of the shooting spread, protestors gathered at the governor's mansion in St. Paul, chanting, \"No justice, no sleep .\" Thursday, July 7 2016 9:38 AM EDT2016-07-07 13:38:53 GMT (Source: KCBD Graphic) Lubbock police will be closing northbound I-27 between 19th Street and the Marsha Sharp Freeway on Thursday to conduct an investigation regarding a crash that happened on Monday night. Lubbock police will be closing northbound I-27 between 19th Street and the Marsha Sharp Freeway on Thursday to conduct an investigation regarding a crash that happened on Monday night. Thursday, July 7 2016 9:13 AM EDT2016-07-07 13:13:36 GMT (Source: KCBD) A U.S. Air Force Airman from the 27th Special Operations Wing was found dead in his Clovis home around 2:45 p.m. July 6. A U.S. Air Force Airman from the 27th Special Operations Wing was found dead in his Clovis home around 2:45 p.m. July 6. Thursday, July 7 2016 6:44 AM EDT2016-07-07 10:44:26 GMTUpdated: Thursday, July 7 2016 6:44 AM EDT2016-07-07 10:44:26 GMT By The Associated Press Your daily look at late-breaking news, upcoming events and the stories that will be talked about today: By The Associated Press Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:", "articleID": "2016070714_00807122_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-07-07", "url": "http://sunstar.com.ph/cebu/sports/2016/07/07/focus-asia-483988", "content": "Time to read 2 minutes Share Print a - a + Read so far Final Game. Jayson Castro tries to find an open man in Gilas Pilipinas' loss to New Zealand. Castro said after the game that he is planning to retire from international competition. (AP Foto) MANY Cebuanos were disappointed over the \"bad\" performance of the Gilas Pilipinas in the 2016 Rio Olympics qualifying tournament, exiting early after losing their first two games at the Mall of Asia Arena. But while many were frustrated at the way coach Tab Baldwin shuffled his players, some believed that the Philippines still has a long way to go. \"Forget international basketball. Train our sight on Asia. To SBP, huwag ninyo bilogin ang ulo ng mga Pinoy that we will make it in the international level. It seem that the objective of the Gilas program is marketing, not as what they have told us,\" said Philippine Sports Commission's <mark>Ramon Fernandez</mark>, a member of the 1974 Fiba World Cup Philippine team and a PBA 4-time MVP. <mark>Fernandez</mark>'s statement came at the heels of Gilas' frustrating loss to the Tall Blacks of New Zealand, 89-80, last Wednesday that ended the Philippines' hope of making it back to the quadrennial Summer Games slated in Rio de Janeiro, Brazil in August. The Philippines made a total of seven appearances in the Summer Olympics, the first was in 1936 in Berlin, Germany and the last time in Mexico, 1968. For Cebu City Sports Commission commissioner and sportsman Lorenzo \"Chao\" Sy, Gilas' lack of experience in international competitions was one of the reasons the team fell short. \"Their performance is okay. They entertained us, they fought hard, Gilas just lack international experience. I guess everybody was satisfied with their performance especially those who bought tickets to watch the game live at MOA Arena, even our president (Rodrigo Duterte) enjoyed the game,\" Sy said. What Sy saw was the lack of shooters and the tendency of the Gilas players to play as individuals. \"They should not disband that team, just add more shooters, size and ceilings. More training and exposure abroad, maybe that's what they needed,\" said Sy. Lawyer Baldomero Estenzo, the Dean of the University of Cebu College of Law and Junemar Fajardo's legal adviser, also admitted Gilas' too much dribbling and lack of defense was the cause of their defeats. \"It's either they were not lucky on their shots or the defense of New Zealand was good that Gilas had difficulty making their shots. Also, there was too much dribbling on the part of Gilas which led to many turnovers. Gilas' defense also left much to be desired. Finally I think there was too much reliance on the MVP (Manny V. Pangilinan) players to the dismay of many. But it was the coach's call and prerogative,\" Estenzo said. For Estenzo, to become a better team, our national team should be a selection of the best players and must have a longer preparation. \"Maybe it would be better if the champion team in the All-Filipino Conference will represent the country (to international competition) with privilege to get players from the other team that it needs. (In this case) teamwork is already there. Yeng Guiao can be the coach,\" Estenzo said. Veteran coach Jun Noel of the University of San Jose-Recoletos observed that Gilas was not prepared. \"Gilas was not ready for the tournament and the new players were still adjusting to the system. That is why their defense was too loose because of the poor rotation of the players, especially the new ones,\" Noel said. UV Green Lancers head coach Gary Cortes said Gilas wasted too much time dribbling, resulting to hurried and poor shot selections. Published in the Sun. Star Cebu newspaper on July 08, 2016. Latest issues of Sun. Star Cebu also available on your mobile phones, laptops, and tablets. Subscribe to our digital editions at epaper.sunstar.com. ph and get a free seven-day trial. DISCLAIMER: Sun. Star website welcomes friendly debate, but comments posted on this site do not necessary reflect the views of the Sun. Star management and its affiliates. Sun. Star reserves the right to delete, reproduce or modify comments posted here without notice. Posts that are inappropriate will automatically be deleted. Forum rules: Do not use obscenity. Some words have been banned. Stick to the topic. Do not veer away from the discussion. Be coherent and respectful. Do not shout or use CAPITAL LETTERS! Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2016070715_00095340_W", "names": {"Ramon Fernandez": ["Q3418520", "Q7289826"]}}, {"date": "2016-07-08", "url": "http://www.qt.com.au/news/gallen-deserves-proper-send-off-says-thurston/3058953/", "content": "LAST HURRAH: Paul Gallen of the Blues is tackled by <mark>Cameron Smith</mark> and Matthew Gillett of the Maroons during State of Origin game one. DEAN LEWINS Popular Stories Why police had to issue warning to \"Pokémon trainers' Greyhound move to Bundamba will be a winning trifecta Driver hurt in two-vehicle crash at Redbank Plains check it out! Subscribe Now HIGHLY decorated Queenslander Johnathan Thurston says it will be very sad if New South Wales captain Paul Gallen plays his last Origin match in front of only 60,000 fans at ANZ Stadium on Wednesday night. While Queensland doesn't care how many Blues fans turn out for game three, having already wrapped up the series 2-0 for the 10th time in 11 years, Thurston said Gallen deserved better than to play his 23rd Origin, the most by any NSW forward, in front of a half-empty stadium. The Blues haven't pulled a crowd of less than 80,000 at home since 2010 when 61,259 fans turned out to see Queensland complete Origin's last clean sweep. NRL officials are worried the crowd may struggle to top 60,000 and are urging rugby league fans to say farewell to Gallen .\" It will be a real shame if their captain runs out in front of 60,000, \"Thurston said .\" He's played over 20 Origin games for them, it would be sad, I think. \"Regardless, Thurston said he expected the Blues to come out all guns blazing .\" It's Gal's last game and apparently Robbie's (Farah) last game, so they'll come out fired up and play well, which will be a real challenge for us, \"he said .\" I've only been part of one whitewash (2010) and we have all got a chance to be part of something special on Wednesday night. \"They've got a lot to play for too. The pressure is on them, they're under the pump .\" Thurston said whoever coach Laurie Daley picked opposite him in the No. 6 jumper--Matt Moylan or Jack Bird--they would be \"dangerous\". \"Matt is more of a ball player while Jack is a ball runner,\" Thurston said. With <mark>Corey Parker</mark> the latest member of the team to retire on Wednesday night, Thurston admitted it felt like his own Origin career was winding down. \"It seems like it is starting to come to an end but I am still loving it like my first series. It's quite special and I know I will miss it when that day comes,\" he said. \"Cozza (<mark>Parker</mark>) hasn't said anything to the boys and those that know him know he won't. He'll just go about his business .\" The best way for us to send him out the way he deserves is to prepare the best we can and play the best we can. \"johnathan thurston Read More Login to follow new south wales blues Read More Login to follow origin2016 Read More Login to follow paul gallen Read More Login to follow Topics: johnathan thurston, new south wales blues, origin2016, paul gallen 0 PRINT Have your say", "articleID": "2016070806_00552833_W", "names": {"Cameron Smith": ["Q27840142", "Q27840143", "Q28343824", "Q2934778", "Q44614454", "Q5026380"], "Corey Parker": ["Q2997266", "Q5170422"]}}, {"date": "2016-07-08", "url": "http://naharnet.com/stories/en/212762-us-state-department-to-reopen-clinton-emails-probe", "content": "Tweet The US State Department said Thursday it will reopen its internal investigation into whether Democratic White House hopeful Hillary Clinton's use of a private email account and server compromised her handling of classified material. \"We will aim to be as expeditious as possible, but we will not put artificial deadlines on the process,\" department spokesman <mark>John Kirby</mark> said, noting that the internal review could proceed now that the Justice Department investigation wrapped up with no charges filed against the former secretary of state. The FBI advised earlier in the week that no charges be brought over Clinton's use of a private email account and homebrew server during her time as secretary of state from 2009 to 2013, a recommendation that the Justice Department then followed. Although the announcement took a huge weight off the presumptive Democratic nominee, FBI chief James Comey nonetheless said Clinton and her staff were \"extremely careless in their handling of very sensitive, highly classified information .\" Republicans, including Clinton's White House rival <mark>Donald Trump</mark>, have cried foul over the lack of charges, alleging that Clinton's influence as a prominent politician helped her escape criminal proceedings. <mark>Trump</mark>, who polls show faces an uphill battle against Clinton in November, has repeatedly accused Clinton of masking her involvement in illegal activity by deleting more than 30,000 emails she claimed were personal and not related to her job as top US diplomat. On Thursday, Comey was forced to vigorously defend his recommendation before the House Committee on Oversight, which summoned him to testify. Despite tense moments, Comey, a Republican former prosecutor, maintained his cool throughout the marathon grilling that lasted four hours and 40 minutes. Although <mark>Kirby</mark> declined to provide specific information about the State Department's latest review, he said it would aim to be \"as transparent as possible about our results, while complying with our various legal obligations .\" Of some 30,000 emails Clinton turned over to the FBI, Comey said 110 contained classified information--Clinton had said none was classified at the time they were sent. Another 2,000 emails were later \"up-classified\" to confidential.", "articleID": "2016070809_00520710_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"]}}, {"date": "2016-07-08", "url": "http://www.thehindubusinessline.com/specials/pulse/why-it-is-difficult-to-cut-out-organ-blackmarketers/article8824813.ece?homepage=true", "content": "Why it is difficult to cut out organ black-marketers PT Jyothi Datta Catch them young India requires about two lakh kidneys but only 2 per cent of this demand gets met Sophisticated fraudsters continue to sell body-parts, despite stringent laws. Can the Israel or Singapore models work? It was during a visit to a Chennai colony over 20 years ago that one became painfully aware of the disturbing practice of organ trade. The vulnerable residents there, largely living with leprosy, were targeted by middle-men to sell their kidney to individuals who desperately needed one. Soon enough, the government stepped in and put in place stringent laws to stop the commercial trade of organs. After all, the reputation of doctors, the state and eventually the country itself was at stake here. It is for this very same reason that the kidney racket reported from Delhi's Indraprastha Apollo Hospital last month needs to ring alarm bells. The incident did not happen in a back alley in a remote part of the country, but in the national capital, seat of both the Delhi State and Union Governments. As investigating agencies unravel how deep the rot may have spread in the Delhi case, doctors complain that it is becoming increasingly difficult to call the bluff of scamsters. Despite approval committees at State and hospital levels that assess every organ donor and \"related\" recipient, frauds seem to happen. And it's not always because there are black sheep in the medical fraternity, says a doctor unwilling to be named. In some cases, the donors and recipients are able to furnish fake Aadhaar cards and documents to prove they are related, there is no way even a committee of doctors can spot the fraud here, says the doctor. Future committees may need to include forensic experts and interrogators to sniff out such frauds, he says. <mark>Sunil Shroff</mark>, Managing Trustee with Chennai's Mohan Foundation, echoes these views. \"Doctors cannot police each case,\" he says, adding that passports and ration cards are fabricated to prove that the organ donor and the recipient are related (as mandated by law). As a kidney surgeon himself, <mark>Shroff</mark> says, despite having stringent procedures to weed out fraudsters, \"later we (have) realised we were duped\". The case involved a woman and a person who was supposedly her son. Such incidents can take place even in the best of institutions, he says, admitting that in some cases it could involve bad eggs in the profession. The Transplantation of Human Organs Act, 1994 and subsequent amendments have brought in checks, punishment and penalties on frauds. A huge deterrent is the fact that the doctor's image can get tarnished if he or she is linked to such frauds, he says. Go public Amar Jesani, Editor with the Indian Journal of Medical Ethics, observes that a hospital cannot absolve itself from an incident of fraud happening in its portals, as every organ transplant is overseen by a committee of doctors including those not involved with the surgery, such as psychiatrists. The Apollo incident provides a unique opportunity to bring in greater regulatory governance, says Jesani. The system needs to be made more transparent and the process, transplant decisions, minutes, etc., need to be in public domain, he says, even as patient names are kept confidential. Donor initiatives <mark>Shroff</mark> says that frauds can be plugged if the donor-recipient shortage is addressed, and the number of voluntary organ donations increases substantially. At any given point in time, India reportedly requires about two lakh kidneys but only 2 per cent of this demand gets met. Israel and Singapore encourage people to become donors by promising to prioritise their case if they ever need an organ later. Those not interested in volunteering can opt out. Another more debatable initiative exists in Iran, where a donor is legally paid, but under the government's watch. But Iran is set to review it, says <mark>Shroff</mark>. As the demand increases for organs (kidney, liver, heart, other tissues), a key method to outlaw the commercial trade of organs is by increasing voluntary supplies. And for that much greater awareness is needed. Last year, Prime Minister Narendra Modi's Mann ki Baat spoke of voluntary organ donation. And earlier this week, Apple said that iPhone users would be able to sign up for organ donation though an app. Its initiative was a recognition of the \"excruciating\" wait no less than Steve Jobs had to go through for a liver transplant in 2009. (This article was published on July 8, 2016)", "articleID": "2016070817_00858692_W", "names": {"Sunil Shroff": ["Q17074754", "Q57317610"]}}, {"date": "2016-07-09", "url": "http://www.silverandblackpride.com/2016/7/8/12134324/thank-you-jsnoop61#comments", "content": "Thank You JSNOOP61  TweetShare on Twitter  ShareShare on Facebook  PinPinterest + Comments Raider Nation, As I write this I am watching a replay of \"A Football Life: <mark>Al Davis</mark>\" on the NFL Network. Some time ago I wrote a post when it originally aired, \"Why Are We Raiders?\" It prompted me to revisit that post and among the comments I found a response from JSNOOP61 that far outshines my original post. It deserves to stand alone. Raider Nation Forever. Ok, I have been a Raiders fan since the late 60s when I was still in my single digits...I went to a black college, Tennessee State Univ in 1978...Interestingly, head coaches and coaching staffs at black colleges loved two teams: the Raiders and Chiefs, because <mark>Al Davis</mark> and Lamar Hunt were color blind. When the NFL had an unwritten policy that a team couldn't have more than 5 or 6 black players on a team, the AFL was different and the Raiders & Chiefs were more different. They had scouts travel the Southeast and East Coast, where most black colleges were located, looking for talent. And that's one of the reasons <mark>Al Davis</mark> got his reputation as a maverick. Even AFL owners tried to come up with an unwritten policy of a limited number of black players, but <mark>Al</mark> bucked the system, along with Lamar Hunt. Not many people can tell you the colleges Gene Upshaw (Texas A & I) and Art Shell (Maryland State) attended. These were obscure colleges back in the day, and their glory days were back in the 60s, but still, they were fairly unknown colleges that were on the Raiders radar & only the Raiders. Before the Bear Bryants & Joe Paternos got smart and got their heads out of their asses, it was guys like <mark>Eddie Robinson</mark> & John Merritt who were supplying black ballplayers to the AFL & NFL. And in many ways, <mark>Al Davis</mark> was the leading opportunist who opens the flood gates for black players. If Walter Payton & Jerry Rice were coming up today, no way they would attend or play for a Jackson State or Mississippi Valley State. No way <mark>Doug Williams</mark> attend a Grambling State. <mark>Al Davis</mark> brought a lot of focus to the black athlete on both the professional & college level. The man was great. His last 10 years or so he wanted to go to the Super Bowl again before he died. I hate the fact those are the years he will be remembered for vs. everything he done for the AFL & NFL. He & Lamar Hunt deserves way more credit than Pete Rozelle & definitely way more than a Roger Goodell. Those guys will forever receive credit, but the true innovators were guys like <mark>Al</mark>, Hunt, Sid Gillman, etc.. Why Am I A Raider? Because of the great innovator, the man who believed in giving others opportunities that other owners wouldn't--<mark>Al Davis</mark>. And I hate the fact that <mark>Al</mark> would never receive credit for giving Art Shell & Tom Flores an opportunities to be head coaches when no other owner would. And everyone plays it down, because it was only <mark>Al Davis</mark>, a maverick. Give the man credit! Up until the last decade or so, the Raiders were truly the team of the Decades, and the team of opportunity.", "articleID": "2016070906_00319891_W", "names": {"Al Davis": ["Q1389376", "Q16151684"]}}]