[{"date": "2016-07-11", "url": "http://www.politico.com/tipsheets/massachusetts-playbook/2016/07/equal-pay-bill-incoming-mind-those-budget-earmarks-happy-birthday-ed-markey-215241", "content": "The fights before the convention fight in Cleveland Christie builds his case for <mark>Trump</mark>'s VP Why <mark>Paul Ryan</mark> won't accept--or dismiss--<mark>Donald Trump</mark> The Year the Veepstakes Really Mattered An Unfair Tragedy for Unlucky Dallas Politico Massachusetts Playbook Lauren Dezenski's must-read rundown of what's up on Beacon Hill and beyond. Subscribe Shares Facebook Twitter Google + Email Comment Print EQUAL PAY bill incoming--Mind those BUDGET earmarks--Happy Birthday ED MARKEY 07/11/16 07:02 AM EDT By Lauren Dezenski (ldezenski @ politico.com; @ laurendezenski) GOOD MORNING, MASSACHUSETTS. Welcome to Monday. And welcome to the world, Playbook 2.0, featuring Anna Palmer, Jake Sherman, and MA's own Daniel Lippman! Sign up here for the revamped Playbook out of DC--http: //politi.co/29sx4tx Story Continued Below Also, Happy 7 Eleven day. What's in it for you? A Slurpee. TODAY--Attorney General Maura Healey, Boston Mayor Marty Walsh, Senate President Stan Rosenberg, and House Speaker <mark>Robert DeLeo</mark> celebrate the transgender public accommodations bill being signed into law on the steps of the State House. In a little #mapoli Friday news dump, Gov. <mark>Charlie Baker</mark> put pen to paper with the trans bill as well as the FY17 state budget--Gov. <mark>Charlie Baker</mark> won't be at the celebration at the State House steps but he and Boston Mayor Marty Walsh will be in Dorchester for the groundbreaking of a new TOD building near Ashmont Station at noon--Boston Public Schools hosts a public feedback meeting on Superintendent <mark>Tommy Chang</mark>'s strategic implementation plan in Eastie tonight HOW MANY DAYS UNTIL THE END OF SESSION? 20. COMING THIS WEEK: EQUAL PAY LEGISLATION--Debate and a likely vote on the House's take on equal pay legislation which passed the Senate unanimously is expected to appeal to all sides thanks to tweaks from the House. More from yours truly in POLITICO Massachusetts--\"While the House language was not yet available late last week, those involved with negotiations say the bill will be amenable to all parties. It is currently being tweaked in the House Committee on Ways and Means .\" ...\"\"I would say that it's similar to the Senate version,' said Rep. Patricia Haddad, a Somerset Democrat. The main difference, she said, is that the House worked more closely with Associated Industries of Massachusetts in developing the legislation .\" ...\"In January, the Senate unanimously passed legislation to shrink the gap between men and women's wages by prohibiting potential employers from asking about salary history and establishing a definition for\" comparable work. \"'\" Associated Industries of Massachusetts, or AIM, was critical of the Senate's language. The group's president, Rick Lord, confirmed that his team has been closely working with House leadership as well as the Attorney General's office \"to hopefully come up with a bill out of the House that we would support .\" '...\"The Massachusetts High Tech Council, another group pushing back against the Senate proposal, sent a similar signal .\" Based on the conversations we've been having, we're optimistic about the House-produced bill. It will be an improvement over what the Senate did,' said public policy and communications executive vice president Mark Gallagher. \"READ ON--http: //politi.co/29ssPOE Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for the Playbook? Get in touch: ldezenski @ politico.com. ** A message from HydroTruthMA: Want to raise Massachusetts electric prices by $10 billion dollars over the next 20 years? NO. . The Massachusetts Hydro Plan threatens local jobs and there are serious questions about the cost and reliability of government-owned Canadian hydro power. Learn more: bit. ly/2928S3h ** ICYMI--THE BUDGET IS FINALIZED AND SIGNED--\"<mark>Baker</mark> skims $265M from final $38.92 B budget,\" by Lauren Dezenski, POLITICO Massachusetts: \"Gov. <mark>Charlie Baker</mark> signed the 2017 fiscal year budget into law Friday. He also used his signature to veto $265 million in outside and one-time spending from the final $38.92 billion measure ....The bulk of the vetoes came from health and human services, $72 million, as well as $59 million from administration and finance, $33 million from education and $20 million from public safety .\" http: //politi.co/29suiEA WHAT EARMARKS LIVE WHAT DIES WHO TELLS THEIR STORY: HERE COMES THE MASS BUDGET BOT!--\"Despite Belt-Tightening, Hundreds Of Earmarks Made It To Gov's Desk\" by Isaiah Thompson, WGBH: \"But an analysis of the finalized budget by WGBH News found roughly five hundred earmarks--defined as specific sums of money directed to specific recipients outside of state government--in the budget submitted to Governor <mark>Baker</mark>.\" http: //bit.ly/29uCaFh SORRY KIDS--\"Students at state's public colleges gird for higher tuition,\" by Laura Krantz, Boston Globe: \"The price for in-state students to attend Massachusetts' nine state universities is going up by as much as 7.8 percent in the coming academic year, according to preliminary figures from the campuses. The increase for students attending the 15 community colleges will be as much as 10 percent .\" http: //bit.ly/29syvs1 EDUCATION MATTERS--\"Declining prekindergarten enrollment worries Worcester education officials,\" by Scott O’Connell, Worcester Telegram: \"Since reaching a high of 1,624 students in 2012, the city's preschool population has dipped to 1,264 in the past school year, a decline of about 22 percent. The trend makes Worcester an outlier among similar-size cities around the state, as programs in systems like Boston and Springfield have added dozens to hundreds of students over the same period .\" http: //bit.ly/29yRxyB WHEN BANS DON'T WORK--\"Lowell: Don't give money to panhandlers,\" by Grant Welker, Lowell Sun: \"City officials will start a public-awareness initiative to tell residents and visitors that giving money to panhandlers isn't what's best for those asking for money ....The campaign is the latest effort by the city after a judge blocked a previous plan to make panhandling illegal. Now, instead of trying to stop the panhandlers, the city is trying to stop people from giving money to them .\" http: //bit.ly/29GQrmG ALSO ICYMI--\"<mark>Baker</mark> signs trans bill into law,\" by Lauren Dezenski, POLITICO Massachusetts: \"As expected, Gov. <mark>Charlie Baker</mark> has signed the transgender public accommodations bill into law, his office announced Friday afternoon ....Under the law, effective immediately, transgender individuals are included as a class protected from discriminatory advertising .\" http: //politi.co/29swzQ7 SEVEN DAYS UNTIL CLEVELAND--\"House leader's streak of consecutive GOP conventions to end,\" by <mark>Michael Norton</mark>, State House News Service: \"After attending three straight Republican national conventions, House Majority Leader <mark>Brad Jones</mark> does not plan to visit Cleveland next week for the 2016 convention, and he's not alone among GOP lawmakers ....Only three of the 34 House Republicans plan to attend the convention and none of the Senate's six Republicans plan to be there, aides told the News Service when asked about attendance plans. Rep. Geoff Diehl of Whitman, who has been actively supporting <mark>Donald Trump</mark>'s campaign, plans to attend, as well as Reps. Paul Frost of Auburn and Keiko Orrall of Lakeville, who will take over for Chanel Prunier as one of the state's two Republican National Committee members after the convention .\" http: //bit.ly/29svs2U FOLLOWING UP WITH A STORY ABOUT A STORY ABOUT A STORY--\"The HuffPost Story That Bizarrely Rocked Boston,\" by Daniel Marans and <mark>Ryan</mark> Grimm, Huffington Post: \"The Huffington Post raised the issue Wednesday of the Boston media's failure to report on the questionable record of Carmen Ortiz, the top federal prosecutor in Massachusetts ....As if working to prove the point, Boston media promptly turned its guns on the mayor and HuffPost in response .\" http: //bit.ly/29GOyX5 WIN THE MORNING. OWN THE DAY. GET THE NEW PLAYBOOK. Anna Palmer and Jake Sherman, along with Daniel Lippman, tell you what's really going on in Washington and beyond--with more big scoops, must-read intel, and backstage reporting on politics and power. Sign up here: http: //politi.co/29ta4fR WOOD WAR--Herald: \"I STAY PRAYED UP\" --Globe: \"MESSAGE OF HARMONY IN BOSTON,\" \"Police say Dallas gunman was planning wider attacks,\" \"Prices rising at state schools,\" \"Praise, doubts on Clinton's tuition plan,\" \"US refuge for Central Americans urged,\" \"Duck boat hits woman; safety please resurface .\" INBOX (from Friday)--\"<mark>Clark</mark> bills incorporated in passage of Congress' opioid reform package,\" from the office of Rep. <mark>Katherine Clark</mark>: \"Today, the U.S. House passed the Comprehensive Addiction and Recovery Act (CARA), Congress' opioid crisis response package that incorporates 3 of Congresswoman <mark>Katherine Clark</mark>'s bills. In May, the U.S. House unanimously passed <mark>Clark</mark>'s bills, the Reducing Unused Medications Act, the Infant Plan of Safe Care Improvement Act, and Lali's Law. The bills are aimed at reducing the amount of unused and unwanted pain medications, ensuring safe care plans for families with infants suffering from opioid exposure, and increasing access the availability of the overdose antidote Narcan. While the package passed with a bipartisan majority, <mark>Clark</mark> and other Democrats were critical of the minimal funding resources Republicans allowed in the bill. President Obama called for $1.1 billion in emergency funding to expand addiction treatment services and support overdose prevention programs. The bill passed by the House today contains only $181 million in new authorized funding .\" SIGN OF THE TIMES--\"Boston marches in protest,\" by Jack Encarnacao and Antonio Planas, Boston Herald: \"Black Lives Matter demonstrators continued to hit the streets in Boston and across the nation yesterday as President Obama admonished people to\" listen to each other \"ahead of his planned address at a memorial service tomorrow for five slain Dallas police officers .\" DATELINE HOLYOKE--\"Holyoke Black Lives Matter protest held after 5 police officers, 2 black men killed in week of national violence,\" by Jeannette DeForge, Masslive.com: But the goal of holding a non-violent protest was met. About 100 people gathered in the middle of the park off Maple Street, holding hand-made signs and listening to speeches, occasionally chanting \"Black Lives Matter' and\" We've got to do better. \"' http: //bit.ly/29GP2wk PROCESSING--\"Violence across the country touches many in Boston,\" by <mark>Adrian Walker</mark>, Boston Globe: \"So when Dallas explodes, Dudley Square protests. It's both a cry for justice and a plea for safety. At a time of deep anguish, there was healing in proclaiming that black lives matter .\" http: //bit.ly/29sw0WI WHAT THE DUCK--\"After 2nd duck boat crash this year, a renewed call for change,\" by Jan Ranson, Trisha Thadani, and Nicole Fleming, Boston Globe: \"A woman walking in the Back Bay was struck by a duck boat shortly before noon Sunday afternoon, prompting renewed calls for legislation providing safeguards to prevent more accidents involving the lumbering amphibious vehicles .\" http: //bit.ly/29sxGzC RISE UP--\"To Xfinity And Beyond: One Town In Western MA Took On Comcast, And Won,\" by Callie Crossley, WGBH: \"How did this small Western Massachusetts town have the wherewithal to go rogue against the internet behemoth? It started 5 years ago when city officials began looking for a solution to the poor service, so iffy that some still used dial up. So bad that 40 percent of residents opted not to be online. There's no wave of a magic wand to erase their daily frustration of trying to get and stay connected .\" http: //bit.ly/29svkkb CHEERS--\"Drink app founders want to change Mass. law,\" by Kerry J. Byrne, Boston Herald: \"A pair of local entrepreneurs are working to bring happy hour back to the Bay State and they have an online petition (happyhourboston.com) with more than 8,000 signatures that they're hoping to leverage into support from Mayor Martin J. Walsh's late-night task force and other state officials .\" http: //bit.ly/29GNYIZ ONE LAST TIME--\"Lin-Manuel Miranda's Final Bows in\" Hamilton' on Broadway, \"by Joshua Barone, New York Times:\" Lin-Manuel Miranda's final bows for his farewell performance in \"Hamilton\" on Saturday night seemed routine, if overly humble for the departure of the show's star and mastermind. He even shared his bows with the other cast members also exiting the show, including Phillipa Soo and the Tony winner Leslie Odom Jr....But then the theme song to \"The West Wing\" kicked in from the orchestra pit. \"http: //nyti.ms/29svTdA HAPPY BIRTHDAY--To Sen. Ed Markey, who turns 70 today and WBUR's Jack Lepiarz. DID THE HOME TEAM WIN?--Yes! The Sox beat the Rays 4-0. HEY NERDS--For those who have to catch\" em all on Pokemon GO before the end of session: There are multiple Pokestops at the State House (and that's saying nothing of the Common), according to an independent analysis conducted by Politico Massachusetts. Happy playing. SEE YOU TOMORROW--\"WGBH'S\" The Scrum' Live! Transit Edition \"--\"The Scrum heads to Somerville's Union Square, one of the key spots set to be revitalized by the MBTA's Green Line Extension project. But decades of promises to Somervillains were almost dashed by the T's fiscal woes when the project came close to cancellation ....When the MBTA hurts, Greater Boston hurts. Join WGBH News's Adam Reilly, Peter Kadzis and Mike Deehan - along with a rotating cast of transit experts and advocates - as the Scrum dives in to all things transit ....They don't serve nachos, so I guess we'll all have to order conch fritters instead .\" Fun starts at 6:30 p.m. at the Brass Union. RSVP to the Facebook event: http: //bit.ly/29GQSNE ** A message from HydroTruthMA: Since 1990, carbon emissions from MA power plants have dropped 51% according to the U.S. Department of Energy. Massachusetts has one of the cleanest and lowest carbon-producing power generation systems in the nation. In fact, transportation today represents twice the carbon emissions of power plants in the Commonwealth. And despite talk of an \"energy cost crisis,\" the last two years have seen the lowest electricity prices in more than a decade. The energy plan being pushed on Beacon Hill, however, puts all this progress at risk by outsourcing up to a third of our electricity market to government-owned Canadian utilities and locking consumers into decades-long hydro contracts. If passed by the legislature, energy bills are estimated to increase by up to $777 million each year for Massachusetts families and businesses. Government-owned Canadian hydro is expensive, unreliable and not the solution for Massachusetts. Learn more: bit. ly/2928S3h ** Want to make an impact? POLITICO Massachusetts has a variety of multi-platform solutions available to reach and activate the most influential people in the Bay State. Have a petition you want signed? A cause you're promoting? Share your message with our influential readers to increase awareness and drive action. Contact Chris Falls to find out how: cfalls @ politico.com. FOR MORE political and policy news from Massachusetts, check out: http: //politi.co/1qNSlWx SUBSCRIBE to the Playbook family: POLITICO Playbook: http: //politi.co/1phAeAC...New York Playbook: http: //politi.co/1ON8bqW...Florida Playbook: http: //politi.co/1JDm23W...New Jersey Playbook: http: //politi.co/1HLKltF...Massachusetts Playbook: http: //politi.co/1Nhtq5v...Illinois Playbook: http: //politi.co/1N7u5sb...California Playbook: http: //politi.co/1N8zdJU and our friends at POLITICO Brussels Playbook: http: //politi.co/1FZeLcw...All our policy and political tipsheets http: //politi.co/1M75UbX & laquo; View Archives This story tagged under: Massachusetts Clinton's new friend--and maybe VP <mark>Donald Trump</mark>'s God whisperer Massachusetts Playbook - POLITICO Archive Monday, 7/11/16 Friday, 7/8/16 Thursday, 7/7/16 Wednesday, 7/6/16 Tuesday, 7/5/16 View the Full Massachusetts Playbook Archives & raquo; Politico Magazine Measuring the Backlash Against the Muslim Backlash By Shibley Telhami Hillary Clinton's Press Conference Phobia By Jack Shafer How the World Fell Out of Love with Obama By Nahal Toosi Mike Huckabee: If You Can't Support <mark>Trump</mark>, You Don't Deserve a Microphone By Mike Huckabee", "articleID": "2016071111_00077944_W", "names": {"Robert Deleo": ["Q7343448", "Q924486"], "Tommy Chang": ["Q19560219", "Q7819296"]}}, {"date": "2016-07-11", "url": "http://www.morningstar.co.uk/uk/news/AN_1468248204011689400/theresa-may-to-be-next-uk-pm-as-leadsom-bows-out.aspx", "content": "<mark>Theresa May</mark> To Be Next UK PM As Leadsom Bows Out VIENNA (Alliance News) - Britain is set to have a new female Prime Minister as Home Secretary...Alliance News 11 July, 2016 | 3:43 PM Share via Email Add Your Note (Optional): VIENNA (Alliance News) - Britain is set to have a new female Prime Minister as Home Secretary <mark>Theresa May</mark> is the only contender left in the Tory Leadership race, after Energy Minister Andrea Leadsom withdrew on Monday. Graham Brady, the chair of the 1922 Committee that oversees the election, said <mark>May</mark> was the only remaining candidate to become Tory leader. She will be confirmed as the new Conservative Party leader after consulting the board, Brady said. The contest will not re-open, he added. In a speech earlier on Monday, <mark>May</mark>, 59, a remain-campaigner, reiterated that there will not be a second referendum on EU membership. \"Brexit means Brexit and we are going to make a success of it\" , she said. In the June 23 referendum, 52% Britons voted to leave the EU in a surprise and historic move. It remains unclear whether the confirmation will come by the end of Monday or this week. After party confirmation, <mark>May</mark> must meet the Queen, who will return to London only tomorrow or Wednesday. <mark>May</mark> will likely meet the Queen during teatime. The final result of the Tory leadership election was set to be announced on September 9. Brady suggested that now it will not take that long for the announcement. While announcing his resignation in the aftermath of the \"Brexit\" vote, Prime Minister <mark>David Cameron</mark> had said he will continue until October and that the exit talks with the EU should continue under the new PM. Reports suggest that <mark>Cameron</mark> will take his last Prime Minister's Questions on Wednesday, and hand over the role to <mark>May</mark> afterwards. <mark>May</mark> is a known face for the EU. In her campaign manifesto, she said the Article 50, which governs the EU exit process, will not be triggered this year. She has also ruled out a general election before 2020 and abandoned the target of achieving a budget surplus by that year. Her stance on the status of EU nationals living in the UK has attracted criticism. She has only said that they will be part of the \"Brexit\" negotiations, refusing to guarantee that they can remain in the country. Earlier on Monday, Leadsom bowed out from the race, saying she lacked \"sufficient support to lead a strong and stable government\". She had less than 25% backing of MPs. She also said that it was in the interests of the country that a new strong PM is appointed immediately. \"A nine-week leadership campaign at such a critical moment for our country is highly undesirable,\" she said. With over 60% of Tory MPs' backing, <mark>May</mark> is \"ideally placed to implement\" Brexit \"on the best possible terms for the British people and she has promised that she will do so\" , the energy minister said. Leadsom's withdrawal came after she faced severe criticism for her comments in an interview in the Times last week, which implied that being a mother gave her a \"real stake\" in Britain's future. <mark>May</mark> is childless and Leadsom texted an apology to her on Monday, reports said. Responding to Leadsom's withdrawal, <mark>May</mark>'s campaign manager Chris Gayling said her statement showed she is a \"true public servant\" and a decent person. <mark>May</mark> is set to make a statement later on Monday. Prominent \"Leave\" campaigner Boris Johnson called for quick transition of the PM role to <mark>May</mark>. The former London mayor had quit the Tory leadership bid after his close ally Michael Gove launched a surprise bid. Gove, who was eliminated from the race last week, also sought a quick handover of the leadership to <mark>May</mark>. Following the Tory news, Labour called for a general election. \"It is crucial, given the instability caused by the Brexit vote, that the country has a democratically elected prime minister,\" Labour's Election Coordinator Jon Trickett said. \"It is time for the Labour party to unite and ensure the millions of people in the country left behind by the Tories' failed economic policies, have the opportunity to elect a Labour government .\" However, unity in the Labour party seems a distant prospect for now. Leadsom's announcement coincided with Labour MP Angela Eagle's launch of her bid for the Labour Party leadership. \"These are dark times for Labour,\" Eagle said in a statement announcing her formal challenge to Jeremy Corbyn leadership. \"And they are dangerous times for our country .\" Corbyn had publicly declared that he will remain as the Labour Party leader \"come what <mark>may</mark>\" , allowing crucial talks with unions to find a solution to the crisis fall apart. \"Jeremy Corbyn is unable to provide the leadership this huge task needs,\" Eagle said. \"I believe I can .\" Labour Party General Secretary <mark>Iain McNicol</mark> confirmed that there will be a contest for the leadership position. Like the Conservatives, the main UK opposition party has also witnessed chaos after the surprise \"Brexit\" vote. Several members of the shadow cabinet, including Eagle, quit in a revolt against Corbyn leadership. The crisis also led to a no-confidence move against Corbyn that he lost. Eagle, 55, has been the MP for Wallasey. She is openly gay and has championed social causes such as smoking bans, hunting ban and same sex marriages. She had campaigned for the UK to remain in the EU. Copyright RTT News/dpa-AFX", "articleID": "2016071114_01033293_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Iain Mcnicol": ["Q29643248", "Q5980556"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2016-07-12", "url": "http://blackburnnews.com/bri-national/2016/07/12/deluge-leaves-saskatchewan-city-awash-with-runoff/", "content": "Southern Saskatchewan warned of soggy week By The Canadian Press July 12, 2016 1:54 am ESTEVAN, Sask .--Parts of southern Saskatchewan have been warned that heavy rain--possibly as much as 100 millimetres--could bring flooding. A rainfall warning was in place Monday from Prince Albert, south to the U.S. border. Environment Canada said heavy downpours could cause flash floods, water pooling on roads and flooding in low-lying areas. And even parts of northern Saskatchewan have been hit, with a secondary highway near La Ronge being washed out, and a state of emergency being declared in Carrot River. Saskatchewan emergency management commissioner Duane McKay said communities should be prepared. \"Obviously, some of these issues will impact individuals, so we've notified our provincial disaster assistance team and they are ready to go with any help that municipalities might require there as well,\" McKay said Monday in Saskatoon. McKay also said there's a large cache of flood equipment, such as barriers and pumps, in southern Saskatchewan from flood responses in 2011, 2012 and 2014. \"The province is well provisioned in terms of making sure that, in the event of a flood in any community that requires equipment, the entire equipment from start to finish would be available. And it's on trailers, so it could be rapidly deployed to particular areas .\" Humboldt saw flooding on Sunday and a state of emergency was declared in Estevan when roads and basements were left under water by storm sewers unable to handle at least 130 millimetres of rain that fell in just over two hours. McKay said he hopes the worst is over for Estevan. \"All of the infrastructure, although it was overwhelmed, seems to be keeping up with the removal of the water through lift stations and so on,\" he said. \"So although it's very dramatic when you see the photos of rivers where streets should be, the systems are working and are beginning to clear that water out of that area. Most of the water in those low-lying areas will cause some damages .\" On Monday morning, the sky was blue as friends of Brooke White, who lives in an Estevan trailer court that was badly flooded, ferried in supplies for her in an inflatable dinghy. But by supper time, storm clouds started moving in again, and people were nervously watching the sky. The Red Cross has provided 300 cleanup kits to Estevan, which includes a mop, sponges, brooms, gloves and supplies to safely clean flood-damaged homes and property. Estevan resident Janet Foord, who was returning home when she was caught driving in the storm, said intersections were flooded and vehicles had water up to their mirrors. \"It took me about 20 minutes to get from the highway to my house, which usually takes about four minutes, just because I couldn't find a dry spot or a high spot to go down without stalling our vehicle,\" said Foord. Foord said her neighbours' homes are flooded and the underground parking garage in a condo behind her house is filled with water. \"You could see stuff floating as I walked by .\" People trying to get water out of their basements also faced a challenge when the power went out Sunday, because they needed generators to run their sump pumps, Foord said. SaskPower spokesman <mark>Jonathan Tremblay</mark> said the storm took out a transformer for about half the city's 11,000 residents. Most of the power was restored in about 4 1/2 hours, <mark>Tremblay</mark> said. But as of Monday there were still outages \"here and there\" because poles were in water or lines were knocked down by branches. \"It's slow going to send crews out and safely repair those things, especially with all the water on the ground,\" said <mark>Tremblay</mark>. Some roads also flooded in several other communities, including Lloydminster and Yorkton. Alan Cayford, Lloydminster's director of public works, says the official amount recorded at the airport weather station was 63 millimetres. \"It was a pretty intense and tight-web system that did this to us,\" said Cayford. Yorkton Mayor Bob Maloney said his city got about 51 millimetres of rain Sunday night and water pooled on some streets. Yorkton isn't covered by the rainfall warning, but Maloney was apprehensive. \"If we get more rain on top of what we had yesterday, we could have issues,\" said Maloney. Yorkton improved drainage from downtown after some 1,000 homes damaged when heavy rain floods basements and turns streets into canals in 2010. Maloney says since 2010, there have been three or four storms \"where it just doesn't stop raining\" and residents are leery. \"We have bad memories. When it rains at night, I swear to God everybody in Yorkton gets up and looks out the window. We're scarred .\" --By Jennifer Graham in Regina, with files from CTV Saskatoon", "articleID": "2016071206_00343171_W", "names": {"Jonathan Tremblay": ["Q3183483", "Q3183486"]}}, {"date": "2016-07-12", "url": "http://krcrtv.com/news/politics/house-republicans-grill-loretta-lynch-over-clinton-emails/40469788", "content": "Home House Republicans grill Loretta Lynch over Clinton emails Republicans have asked DOJ to investigate Clinton for perjury By Eugene Scott CNNPOSTED: 49 mins UPDATED 42 minsText Size: Would you like to continue watching? Yes LIVE: House Judiciary / DOJ Oversight hearing WASHINGTON (CNN) - Attorney General Loretta Lynch testified Tuesday before a congressional subcommittee where House Republicans were eager to grill her about the decision not to pursue charges against Hillary Clinton over her use of a private email server. Related Gen. <mark>Michael Flynn</mark>, possible Trump VP pick Lynch defended her actions, saying she was accepting the recommendation of the FBI. \"Their unanimous recommendation was that the matter be resolved in the way in which we announced, and I accepted that recommendation,\" Lynch said. House Judiciary Committee chairman Bob Goodlate, a Virginia Republican, rejected the FBI's conclusion, saying, \"the FBI's conclusion leaves many more questions than answers .\" \"The American people also expect government officials to abide by the law just like everyone else and to be reprimanded when they break the law, just like everyone else,\" Goodlatte said. Lynch also began her hearing highlighting the tension between African-Americans and law enforcement that shook the nation last week. \"As we grapple with the aftermath of these events, the Department of Justice will continue to do everything in our power to build bonds of trust and cooperation between law enforcement and the communities we serve. That work has never been more difficult--or more important,\" she said. Republicans grilled FBI director James Comey on the same subject last Thursday. Copyright 2016 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2016071215_01046295_W", "names": {"Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"]}}, {"date": "2015-07-11", "url": "http://rare.us/story/conservatives-have-an-empathy-problem/", "content": "<mark>Donald Trump</mark> has captured headlines this week for refusing to apologize for calling Mexicans \"rapists\" during his campaign announcement last month. In many ways, this behavior should be expected of \"the <mark>Donald</mark>,\" who has been well-known for his overinflated ego and bombastic statements for years. However, what what less expected is that other, more serious Republican presidential contenders would defend him. From Mother Jones: During an appearance on Meet the Press on Sunday, Sen. Ted Cruz (R-Texas) said, \"I salute <mark>Donald Trump</mark> for focusing on the need to address illegal immigration .\" ...Rick Santorum also came out on #teamtrump. The former senator told CBS' Face the Nation on Sunday that he did not like <mark>Trump</mark>' s \"verbiage,\" but said that <mark>Trump</mark> \"focused on a very important issue for American workers, and particularly legal immigrants in this country .\" Referring to the storm that followed <mark>Trump</mark>' s remarks, Ben Carson contended that political correctness was overshadowing the debate about immigration reform. \"It' s the P.C. police out in force,\" Carson told the Daily Caller. \"They want to make very clear that this is a topic you' re not supposed to bring up .\" Naturally, these more seasoned politicians would make <mark>Trump</mark>'s statements more palpable by reverting to talking points about immigration, but that's not what he was talking about. He explicitly called Mexican immigrants rapists. It should come as no surprise that the so-called \"PC Police\" would be upset when painting an estimated 11.6 million people with such a broad and dark stroke with the only qualification that \"some, I assume, are good people .\" Sadly, <mark>Trump</mark>'s ignorant statements have not just been rewarded by his fellow presidential contenders but the voters as well. The <mark>Donald</mark> leading the latest Economist/YouGov poll at 15 percent, which seems to confirm a popular talking about the American right: conservatives lack empathy. Is this really how we talk about our fellow man in 2015? Calling strangers rapists for trying to make a better life for their family? Or what about calling a teenager a \"thug\" for attending a pool party? All policy aside, conservatives need to start acknowledging the humanity of their neighbors before rushing to judgement about their actions. As <mark>Jack Hunter</mark> put it at The Daily Beast last month, \"Putting people before an agenda or broad prejudices puts us all in a much better place .\" ", "articleID": "2016071403_00037658_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Jack Hunter": ["Q13584053", "Q21621514"]}}, {"date": "2016-07-14", "url": "http://bworldonline.com/content.php?section=TopStory&title=impact-seen-muted-for-nickel-amid-phl-review&id=130456", "content": "Impact seen muted for nickel amid PHL review Posted on July 15, 2016 MANILA/LONDON--An environmental crackdown on Philippine mines, which helped drive nickel prices to eight-month highs, is likely to have only a muted impact on exports to China in the short term because the biggest mines have met guidelines, experts said. RELATED STORIES Philippines' top nickel ore producer sees flat shipments, better prices this year The Philippines is the biggest exporter to top metals consumer China of nickel ore, used to make stainless steel. A smattering of smaller mines are likely to be affected in coming months and new mines will probably face tough going in the future, but the review of the mining sector is not likely to result in a quick drop in shipments. \"The Chinese think the Philippines will continue exporting ore to China and only some small mines will be affected. They're not worried about the situation at the moment,\" said Peter Peng, analyst at CRU consultancy in Beijing. The biggest Philippine producer, Nickel Asia Corp., which has already complied with international mining standards, accounted for close to 40% of Philippine nickel ore production last year, according to analyst <mark>David Wilson</mark> at Citi in London. Three other major miners also say they have approvals, while small-scale miners only accounted for about 11% of ore produced last year, he added. \"We therefore suspect that the impact of environmental license suspension may be more limited than initially feared, and believe the recent rally will run out of steam,\" he said in a note. Of the 40 operating mines, 21 have obtained their ISO 14001 certification, said Ronald S. Recidoro, Legal & Policy vice-president of the Chamber of Mines of the Philippines. POPULAR ANGER Benchmark nickel prices on the London Metal Exchange have rallied a fifth to eight-month highs since June 4 when incoming President Rodrigo R. Duterte warned mining companies to \"shape up\". What remains unknown is how tough the mining minister, Regina Paz \"Gina\" L. Lopez, a committed environmentalist, will be in enforcing environmental and social responsibility rules. Days after she assumed office on June 30, a review of all mines was launched and two small mines were suspended. Analyst Jim Lennon, a consultant for Macquarie, said politicians in the Philippines were responding to public anger at damaging practices in the small-scale mining sector. \"Small miners are stripping away the overgrowth and the forestry and mining down 5-10 meters (yards), but don't bother replacing the overburden and replanting,\" Lennon said. Philippine nickel ore exports to China were already down this year before the crackdown, due to low prices and as some mines ran out of ore. \"Exports are down 25% in the first half anyway, because of the price and reserve exhaustion, so if any of the mines were to be shut down, there's still plenty of capacity,\" Mr. Lennon said. \"So my feeling is that there will be more of an impact on new mines because I think there will be a much more extended environmental approval process .\" The Philippine government has halted permits to develop new mines since 2012 while it works out ways to get more revenue from the sector, but such efforts in Congress have stalled .--Reuters E-mail |", "articleID": "2016071415_00910319_W", "names": {"David Wilson": ["Q11320682", "Q167028", "Q16849502", "Q19594138", "Q21453228", "Q26329468", "Q2642471", "Q27683615", "Q28914261", "Q29033812", "Q29643806", "Q30122994", "Q3018168", "Q3019005", "Q3703375", "Q39071263", "Q39073912", "Q42841755", "Q5234991", "Q5241195", "Q5241198", "Q5241199", "Q5241202", "Q5241203", "Q5241205", "Q5241209", "Q57025576", "Q676969"]}}]