[{"date": "2016-07-13", "url": "http://weatherforddemocrat.com/opinion/letters_to_the_editor/a-vote-for-trump-makes-salt-tasteless/article_0e98d26a-e39e-5ce2-99c3-2771fe45ef50.html", "content": "Letters to the Editor A few passing clouds. Low 74F. Winds SSE at 10 to 20 mph. Updated: July 14, 2016 @ 7:53 pm NICE, France (AP)--The Latest on a truck that drove into the crowd in Nice (all times local): More Headlines OKLAHOMA--Parker County's Kambria McDougal and Skylar Southerland competed in barrel racing at the International Finals Youth Rodeo earlier this week. More Headlines Daniel and Candice <mark>Walker</mark> are proud to announce the birth of their son, Benjamin <mark>Michael Walker</mark>, born on May 19, 2016 at Huntsville Memorial Hospital. Benjamin weighed 8 lbs ., 13 oz. and measured 21 inches long. More Headlines A Vote for <mark>Trump</mark> Makes Salt Tasteless Jul 13, 2016 <mark>Trump</mark> not the answer Dear Editor: Remember from 2nd Kings Chapter Two, the three Captains and their 50 men whom the King had sent to recall Elijah? The first two captains and their men were killed by fire from heaven because God was not in their hearts although they said, \"Man of God .\" It is not what you say but how you act. \"The third captain went up and fell on his knees before Elijah,\" Man of God \", he begged,\" please have respect for my life and the lives of these 50 men, your servants. \"God let them live. Effective living begins with the right attitude towards God. Let respect, humility, and servanthood characterize your attitude toward God and others. Story continues below video <mark>Donald Trump</mark> has little respect, no humility, and has no servant-like characteristics. Dr. Moore, the Moral and Ethics leader of the Southern Baptist Convention, says,\" <mark>Trump</mark> is against everything Christians believe. \"Listen carefully, because it's important. Why? Because Christians are called to be salt and light of the world. If we become tasteless, we have lost our influence. We cannot compromise our values and vote for a man who does not need to repent because he doesn't sin. If we do, we become tasteless and are no longer salt and light. We need to be light. When light is dim, it's hard to see. We have to be the bright light. Let your light shine so they can see your good works. Let your good deeds reveal the beauty of Jesus. <mark>John Murray</mark>", "articleID": "2016071501_00305960_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Murray": ["Q14248464", "Q15456175", "Q20621123", "Q43912232", "Q6249920", "Q6249923", "Q6249930", "Q6249931", "Q6249935", "Q6249937", "Q6249946", "Q6249951", "Q6249963", "Q8837082"], "Michael Walker": ["Q11255929", "Q3308568", "Q52568899", "Q59395459", "Q6012908", "Q6835179", "Q6835180", "Q6835181", "Q6849193", "Q6849194", "Q6849195", "Q992668"]}}, {"date": "2016-07-14", "url": "http://corsicanadailysun.com/sports/mlb-even-after-reeling-rangers-exit-break-as-al-s/article_7912dd8a-4a1b-11e6-843d-e726c43ce5f6.html", "content": "MLB: Even after reeling, Rangers exit break as AL's best, Yu back The Texas Rangers went into the All-Star break reeling, with nine losses their last 12 games and three-fifths of their starting rotation still on the disabled list. But they still had the best record in the American League. More Headlines Scott and <mark>Lisa White</mark> of Corsicana are excited to announce the engagement and upcoming wedding of their daughter, Stephanie Marie <mark>White</mark> to Jacob Hunter Brock, son of David and Sharon Brock of Beach City. More Headlines Guest Commentary I read with interest the article in today's Daily Sun about housing remaining a hot topic in Corsicana. Since I moved here almost 18 years ago, the problem has remained and has gotten worse--limited, old housing stock in poor condition and overpriced. It was identified as a serious problem in United Way's community needs assessment in 2007. Both commercial and residential properties in our city generally suffer from a lack of pride of ownership and insufficient city resources to enforce codes. A study by Kelly Cofer with the Retail Coach a number of years ago gave our city a \"D\" in appearance and cited it as a major deterrent to new business. More Headlines MLB: Even after reeling, Rangers exit break as AL's best, Yu back By STEPHEN HAWKINS AP Sports Writer 2 hrs ago ARLINGTON--The Texas Rangers went into the All-Star break reeling, with nine losses their last 12 games and three-fifths of their starting rotation still on the disabled list. Their last game was a 10-run loss at home to the team with the American League's worst record. \"We went through a stretch where we didn't play good as a team,\" third baseman Adrian Beltre said. \"We understand we're going to go through highs and lows and I assume this is our low .\" As bad as that stretch was--that 15-5 loss to Minnesota was the fifth time in nine games they allowed at least 10 runs--the Rangers go into Wrigley Field this weekend still with the AL's best record (54-36) and a 5 1/2 - game division lead over the Houston Astros. That is the largest AL West lead Texas has ever had coming out of the midsummer break, but it had been as big as 10 games in late June. \"We have the right team to get in the postseason, and after getting in the postseason, we have enough talent and experience to keep moving on,\" shortstop Elvis Andrus said. Right-hander Yu Darvish is scheduled to return from the disabled list and rejoin the rotation Saturday for the second of three games against the Chicago Cubs. With All-Star lefty Cole Hamels set for the series finale, it will be only the fourth time this season Texas' top aces pitch in back-to-back games. Here are some things that went right before the break and others second-year manager Jeff Banister and the Rangers have to watch over the final 72 games when trying to win another AL West title: SURPRISE ALL-STAR: Ian Desmond was a career shortstop his seven seasons with Washington, but turned down a deal to stay with the Nationals. He was unsigned until after the start of spring training, when he went to Texas and switched to left field to replace injured slugger <mark>Josh Hamilton</mark>. By mid-May, Desmond was the everyday center fielder and this week was the only Texas position player at the All-Star game. \"No doubt, he's been our best player,\" Beltre said. \"We found a center fielder...one of the premier center fielders in the American League as far as you put the whole package together,\" Banister said. \"He was a National League shortstop last year. That in itself is just phenomenal .\" Desmond is hitting .322 with 15 home runs and 55 RBIs. HURTING HURLERS: Darvish last pitched for the Rangers on June 8, only his third start for them since missing 2015 because of Tommy John surgery. He then went back on the DL with shoulder discomfort. Colby Lewis (strained lat muscle) and <mark>Derek Holland</mark> (shoulder inflammation) both headed to the DL on the same day in late June. Lewis (6-1, 3.21 ERA) is on the 60-day DL and can't return until at least late August, having made only one shortened start since his near perfect game June 16 at Oakland. <mark>Holland</mark> (5-5, 5.20) started playing catch again in the last week. ON THE ROAD AGAIN: The Rangers are in a span of playing 19 of 23 games on the road, making them the first MLB team since the 2004 Tampa Bay Rays with four home games or fewer in a span of 28 games or more in the regular season. Texas plays its next nine games on the road. Before four home games against Minnesota going into the All-Star break, the Rangers had played 10 in a row away from Arlington. CLOSING IT DOWN: Sam Dyson has 16 saves in two months since taking over as the Rangers' closer, including an MLB-best 10 saves in June. The right-hander got some needed rest, with only three appearances in 11 days before the break. Shawn Tolleson had 35 saves in 2015, and 11 more this season, when he his four blown chances included consecutive appearances in mid-May. ONE GOAL: Beltre's sole goal in his 19th major league season is to finally win the World Series. \"I don't have a lot of time to basically be comfortable with just getting to the playoffs,\" said Beltre, the 37-year-old third baseman signed through 2018. \"That's not enough for me. I'm here to push this thing to win the World Series .\" Sign Up / Sign In", "articleID": "2016071501_00391780_W", "names": {"Derek Holland": ["Q1047687", "Q21453740", "Q5262047", "Q5262049"], "Josh Hamilton": ["Q641352", "Q716346"], "Lisa White": ["Q27655897", "Q30121983"]}}, {"date": "2016-07-15", "url": "http://www.football411.com/story/0,22162,14287_179211,00.html", "content": "Germany announce Olympic football squad Share: RSS Feed Germany have named a strong squad featuring Sven and <mark>Lars Bender</mark> for the Olympics set to take place in Rio de Janeiro next month. The 18-man squad was officially unveiled via the official German Football Association (DFB) website, with coach Horst Hrubesch highlighting the unique blend of players selected - from the u21 national team through to the senior national team. \"The anticipation ahead of the Olympics is huge. This is a unique experience that the players will be able to tell their grandchildren about .\" \"We have a good mix, from the current U-21 national team and the older players. The quality is absolutely great. We go to Brazil to win every game,\" Hrubesch told the DFB website. Germany are set to take part in their first Olympic football tournament since 1988 and begin their campaign against Mexico on 4 August. SQUAD IN FULL: Goalkeepers: Timo Horn (Cologne), Jannik Huth (Mainz) Defenders: <mark>Robert Bauer</mark> (Ingolstadt), Matthias Ginter (Borussia Dortmund), Lukas Klostermann (RB Leipzig), Philipp Max (Augsburg), Niklas Sule, Jeremy Toljan (Hoffenheim) Midfielders/Forwards: <mark>Lars Bender</mark> (Bayer Leverkusen), Sven Bender (Borussia Dortmund), <mark>Julian Brandt</mark> (Bayer Leverkusen), Max Christiansen (Ingolstadt), Serge Gnabry (Arsenal), Leon Goretzka, Max Meyer (Schalke), <mark>Nils Petersen</mark> (Freiburg), Grischa Promel (Karlsruher), Davie Selke (RB Leipzig) Standby list: Leonardo Bittencourt (Cologne), Christian Gunter, Sebastian Kerk (Freiburg), Eric Oelschlagel (Werder Bremen) Posted: 2016-07-15 14:54:44 Hull City win play-off final Mohamed Diame's stunning goal proved the difference as Hull recorded a 1-0 win over Sheffield Wednesday in the Championship play-off final...Varane ruled out of Euro 2016 France centre-back Raphael Varane has been ruled out of Euro 2016 with a thigh injury, the French Football Federation confirmed on Tuesday...Gunners top EPL earners", "articleID": "2016071513_01077981_W", "names": {"Julian Brandt": ["Q3189078", "Q5584957"], "Lars Bender": ["Q1354696", "Q152886"], "Nils Petersen": ["Q159123", "Q23061415"], "Robert Bauer": ["Q18412638", "Q19646574", "Q42059709", "Q56215720", "Q7341941"]}}]