[{"date": "2016-07-18", "url": "http://home.nzcity.co.nz/nl.aspx?3639672", "content": "Rugby: Unknowns in road to the finals By Campbell Burnes 5:00 AM Tuesday Jul 19, 2016 Not saved Facebook 0 Twitter 0 LinkedIn 0 Google + 0 Email Print Highlanders Rugby Team Rugby Super Rugby Hurricanes coach <mark>Chris Boyd</mark> suggests things are not as cut and dried as some pundits say. Photo / <mark>Mark Mitchell</mark> <mark>Chris Boyd</mark> is not so sure that the chances of four New Zealand sides reaching the semifinals are as cut and dried as many pundits and the form book would suggest. \"The sides are close enough together for travel to be a factor, but it's not going to be the factor. I think sides can win this competition home and away,\" says the Hurricanes coach, reflecting on his charges' top billing heading into the Super Rugby playoffs. \"The Stormers are an unknown because no New Zealand side has played them this year. It's very hard to get a handle on just how strong the Stormers are, but they'll be hard to beat at Newlands. A very well rested Lions side will be tough to beat in Jo\" burg. The Brumbies are capable on their own patch as well. \"<mark>Boyd</mark> noted how tough the Crusaders' travel schedule is, given they did not depart for the Republic until today .\" I wouldn't like to say there are going to be four Kiwi sides [in the semis]. I hope there are. \"While he acknowledged the Sharks will have a long travel haul to come to the capital and face a side riding high and smarting from the 32-15 reverse they suffered in Durban in May, that will not alter the Hurricanes' mindset or preparation this week .\" That performance is a long time ago now and we've got some reasonable momentum at the moment, so we just have to make sure we get our preparation right and tick the boxes. We've found with this side that our preparation is crucial to our performance, so we need to make sure it's nice and tidy this week, and enjoy the fact that we can come out and play a quarter at home, where we probably didn't think that would happen, even though that was always the goal, \"says <mark>Boyd</mark>. One shift in mindset is that the Hurricanes no longer have to go all-out in search of a bonus point. They can play percentage rugby if that is required. Beauden Barrett did, however, kick the ball 12 times against the Crusaders, so expect something similar on Saturday night, especially if things get gnarly in the packs. And expect Barrett to have more penalty shots at goal than he had against the Crusaders, where he had none. <mark>Boyd</mark> may have selection puzzles in his front-row if Reggie Goodes does not fully recover from a head knock. He will need to train fully by Thursday, leaving the\" Tongan Bear \"Loni Uhila to make another big impact off the bench. Midfielders Vince Aso and Matt Proctor are likely to be available, though it would be a tough call on Willis Halaholo if he was demoted. <mark>Boyd</mark> can reflect on a solid 11-4 regular season:\" We've dropped four games, two of them by a point, to the Highlanders and Chiefs, and had two blowouts, in round one [against the Brumbies] and then against the Sharks, \"he says. It looks like he has the making of a champion team, and one that was ranked seventh on the table before the dramatic victory last weekend .\" On paper, it's possibly not even the best side in the playoffs, but it's a good team. \"- NZ Herald Read more by Campbell Burnes Email Campbell Burnes Email Print Get the news delivered straight to your inbox Receive the day's news, sport and entertainment in our daily email newsletter SIGN UP NOW 00 days 00 hours 00 minutes--V. view match---- Loading Olympics 18 Since NZ sent its first official team in 1920, the country has twice failed to secure a medal: At London in 1948 and Moscow in 1980. Loading Is this what Milf means? Breakfast has all the answers! Late Night Big Breakfast - Men's Panel Best Bits EP .16 Coach Steve - Gotta Catch 'Em All! EP .8 watchme. co. nz & raquo;", "articleID": "2016071817_00368786_W", "names": {"Chris Boyd": ["Q15229743", "Q21464160"], "Mark Mitchell": ["Q16228506", "Q18217067", "Q18217753", "Q1900287", "Q20190581", "Q22006951", "Q28939744", "Q6768909", "Q6768910", "Q6768911"]}}, {"date": "2016-07-19", "url": "http://businesstimes.com.sg/government-economy/new-uk-finance-minister-hammond-says-to-work-with-boe-on-brexit-response", "content": "The Business Times New UK finance minister Hammond says to work with BoE on Brexit response Jul 19, 2016 7:26 PM [LONDON] British finance minister <mark>Philip Hammond</mark> said on Tuesday he would work closely with the Bank of England to help steer the economy through the shock of last month's referendum vote to leave the European Union. Mr Hammond, who was named as chancellor of the exchequer by Prime Minister Theresa May last week to replace <mark>George Osborne</mark>, said the immediate response to Brexit slowdown lay with the BoE while he would spell out his fiscal plans in the autumn. \"The initial response to this kind of a shock must be a monetary response delivered by the Bank of England,\" Mr Hammond told lawmakers. \"And the governor, in announcing that interest rates were not to be lowered last week, did make it clear that the Bank is developing a monetary package that it will announce in due course .\" The BoE said on July 14 it was working on a possible package of measures to be announced on Aug 4 to cushion the expected blow from the referendum result to Britain's economy. Many economists expect it will halve its already record low Bank Rate to 0.25 per cent and possibly revive its bond-buying programme. Some have also speculated that the BoE might buy bonds issued specifically to fund infrastructure spending. In his comments to parliament on Tuesday, Mr Hammond said Britain needed a new framework to address its budget deficit, which he said was \"very large\" and needed to be addressed. Britain's budget deficit stands at around 4 per cent of gross domestic product, down from more than 10 per cent in 2010 but still among the largest of rich nations around the world. Mr Hammond reiterated his aim of protecting Britain's huge financial services industry from the Brexit fallout by securing its continued ability to provide services across the EU, and he said Britain would not be open to \"asset strippers\" seeking to buy companies in the country. REUTERS", "articleID": "2016071911_00438253_W", "names": {"George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Philip Hammond": ["Q18388174", "Q332987"]}}, {"date": "2016-07-19", "url": "http://atimes.com/2016/07/travel-hallelujah-mountains-on-earth/", "content": "Travel In all probity, you have watched the blockbuster \"Avatar\" once, if not multiple times. You're also probably familiar with \"Pandora\" and \"unobtanium\" by now and were blown away by the hallucinatory floating mountains of the <mark>James Cameron</mark> film. What if those Hallelujah (floating) mountains are on Earth? Well, come to Hubei (Hu-bay) Province of Central China for such an out-of-the-world experience. Hubei's capital Enshi is home to China's Grand Canyon. Its soaring mountains, deep canyons, meandering rivers, heavenly waterfalls and the beauty that they exhibit can give you a feel of being in Pandora's misty and mythical mountains. Enshi proudly displays the peaks and valleys of what is known today as China's Grand Canyon. A Daily Mail report had stated that the Hallelujah (floating) mountains were inspired from such Chinese mountains and <mark>James Cameron</mark>'s film came after a Hollywood photographer spent time shooting in Southern Hunan in 2008. As film fans started to flock to see the mountain columns, the column was officially named as the \"Avatar Hallelujah Mountain .\" Zhangjiajie branch of China International Travel Service Corp offers tourists two packages: \"Magical tour to Avatar-Pandora\" or a \"Miracle tour to Avatar's floating mountain .\" Visit www.citszjj.com for more details. Share this:", "articleID": "2016071919_00818371_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}}, {"date": "2016-07-22", "url": "http://11alive.com/news/politics/national-politics/trump-declares-himself-voice-of-the-people/279383673", "content": "Trump declares himself \"voice' of the people <mark>David Jackson</mark>, USA TODAY, WUSA11:05 PM. EDT July 21, 2016Donald Trump delivers his acceptance speech for the GOP nomination during the Republican National Convention on July 21, 2016. (Photo: <mark>Robert Deutsch</mark>, USA TODAY) CONNECTTWEETLINKEDINGOOGLE+PINTEREST CLEVELAND--Completing his historic drive to the Republican presidential nomination, <mark>Donald Trump</mark> told a divided Republican Party Thursday he will be the\" voice \"for frustrated Americans who have been let down by government and the\" elites \"who run it .\" So to every parent who dreams for their child, and every child who dreams for their future, I say these words to you tonight: I'm with you, I will fight for you, and I will win for you, \"Trump plans to proclaim Thursday night in his acceptance speech at the GOP convention, according to an advance text. After ascending the stage to the theme from the action film Air Force One, Trump said he\" humbly and gratefully \"accepted the Republican nomination to the presidency, then launched into a prepared Teleprompter speech peppered with caustic asides about career politicians. In addition to promoting his own qualifications for the job, Trump's speech was aimed at uniting a convention in which the runner-up in the primary campaign refused to endorse him, critical delegates staged a noisy floor fight over the rules and a string of high-profile Republicans boycotted the entire event. Trump argued that the United States is in decline under the Obama administration, citing a litany of grim statistics about crime and violence, terrorism and national security, and the rising number of Americans who have stopped looking for work. Election opponent Hillary Clinton and other Democrats are to blame for many of the nation's ills, Trump said, and\" the problems we face now--poverty and violence at home, war and destruction abroad--will last only as long as we continue relying on the same politicians who created them. \"Hitting the former secretary of State for foreign policy problems ranging from Libya to the Islamic State, Trump said that Clinton's legacy is one of\" death, destruction, terrorism and weakness. \"The candidate brought the crowd to its feet when he said of Clinton,\" let's defeat her in November. \"Citing the recent spate of police killings and terrorism, the businessman who has never held public promised that\" the crime and violence that today afflicts our nation will soon--and I mean very soon--come to an end...Beginning on January 20th 2017, safety will be restored. \"Echoing promises he has made since hitting the campaign trail 13 months ago, Trump said he will stop illegal immigration with a wall along the U.S.-Mexico border, and change trade agreements that he claims have sucked manufacturing jobs out of the United States to foreign countries. Throughout the day, the Clinton campaign and other Democratic groups sent out statements denouncing various Trump polices as ineffectual, divisive or simply wrong-headed, and accusing him of distorting Clinton's records. They also cited Republican infighting over Trump, including the refusal of many high-profile Republicans to endorse the party's new standard-bearer. Trump's week-long convention in Cleveland has been plagued with problems, one of which surfaced just hours before he was to take the podium: The pro-Clinton group Correct The Record got a hold of a Trump speech draft and distributed it to reporters. In his remarks, Trump recited a string of slogans he used at rallies across the country in the past year, including\" Law and Order, \"\"America First,\" a \"rigged system,\" and--the original campaign theme--\"Make America Great Again .\" The crowd responded with repeated ovations and chants like \"build that wall!\" and \"U-S-A!\" Mocking the pro-Clinton slogan--\"I'm With Her\" --Trump told delegates: \"I'm with you, the American people: I am your voice .\" And as in previous rallies, Trump had to pause at one point as a protester heckled him and had to be removed by security. As Trump put the final touches on his speech and did a walk-though of the stage set-up, the Republican nominee took to Twitter to proclaim the convention a success. \"Other than a small group of people who have suffered massive and embarrassing losses, the party is VERY united,\" Trump said. \"Great love in the arena!\" Other than a small group of people who have suffered massive and embarrassing losses, the party is VERY united. Great love in the arena!--Donald J. Trump (@ realDonaldTrump) July 21, 2016 Daughter Ivanka Trump introduced her father to the noisy crowd that packed Cleveland's basketball arena, telling them he is a \"fighter\" who became \"the people's nominee .\" As with other speakers throughout the week, Trump is expected to seek Republican unity by going after Clinton. Republican delegates have attacked Clinton in extraordinary ways throughout the week, including convention hall chants to \"lock her up!\" Trump prepared for his big night amid another flap over his commitment to U.S. military alliances, including NATO. <mark>Donald Trump</mark> walks on stage to greet his running mate, Mike Pence, after Pence addressed the audience during the 2016 Republican National Convention in Cleveland on July 20, 2016. (Photo: <mark>Robert Deutsch</mark>, USA TODAY) When The New York Times asked the candidate about the prospect of a Russian attack on NATO allies in the Baltic States, Trump said he would authorize help only after deciding whether those countries \"have fulfilled their obligations to us .\" Republicans who have questioned Trump's grasp of foreign policy reacted with indignation. Sen. Lindsey Graham, R-S.C., said Trump \"is essentially telling Russians/other bad actors\" that the United States \"is not fully committed to supporting NATO alliance .\" Trump's convention ends a day after a former primary rival, Sen. Ted Cruz of Texas, pointedly refused to endorse the party's nominee during his convention speech, inciting a chorus of boos and catcalls from pro-Trump delegates. Cruz stuck to his non-endorsement Thursday, reminding a meeting of the Texas delegation that Trump has criticized his wife's looks and all but accused his father of participating in a plot to assassinate President John F. Kennedy. \"I wasn't going to come like a servile puppy dog and say\" Thank you very much' for maligning my wife and father, \"Cruz told angry pro-Trump delegates from the Lone Star State. On Monday, the convention's opening day, a group of anti-Trump delegates that included Cruz backers tried to force a roll call on convention rules in a bid to force an\" open convention \"in which they could vote for any candidate they wanted. When GOP leaders blocked that effort, the anti-Trump delegates staged a noisy protest on the floor. As Trump prepared to close out the convention on Thursday, his remarks have been vetted via software that ferrets out plagiarism, seeking to avoid the kinds of problems that followed wife Melania Trump's speech on Monday. During his walk through at the Quicken Loans Arena, Trump tested the sound system by mocking another likely target of tonight's speech: the media\" I love the media, \"Trump joked .\" They're so honest...They're such honorable people...It's about time I said that, right? \"", "articleID": "2016072203_00105909_W", "names": {"David Jackson": ["Q1174850", "Q16215837", "Q18706415", "Q19560836", "Q25171864", "Q3018141", "Q42889647", "Q46585740", "Q5235533", "Q5235534", "Q5235535", "Q53104720", "Q8354128", "Q9202628", "Q9202630"], "Donald Trump": ["Q22686", "Q27947481"], "Robert Deutsch": ["Q23761554", "Q28971235"]}}, {"date": "2016-07-22", "url": "http://www.nj.com/hudson/index.ssf/2016/07/cops_nab_man_they_say_robbed_3_north_jersey_banks.html", "content": "Cops nab man they say robbed 3 North Jersey banks 035. JPG <mark>John Walsh</mark>, 37, is placed under arrest Wednesday, July 19, 2016 after allegedly carrying out three bank robberies in Jersey City, Maplewood and Summit, police said. Joe Shine | For The Jersey Journal commentsJersey City police, State Police and members of the FBI responded to 98 Bright St. in Jersey City where a 37-year-old man was arrested on robbery charges, cops said. Joe Shine | For The Jersey Journal Law enforcement arrested a 37-year-old Jersey City man they say carried out three bank robberies throughout North Jersey, police said. <mark>John Walsh</mark>, of Bright Street, was charged with robbery in connection to bank robberies in Jersey City, Maplewood and Summit, Jersey City spokeswoman Jennifer Morrill said. Just after 12:30 p.m. July 15, <mark>Walsh</mark> entered the Wells Fargo Bank on Central Avenue wearing sunglasses and a black tee shirt, and approached the teller window. He passed a note that read \"give me all your $50 and $100 bills and don't press the alarm .\" The teller gave him $250, Morrill said. The robber then left the bank with the money and the note. The Jersey City Major Case Squad was notified and responded to handle the investigation, the city spokeswoman said. On Wednesday, Violent Crimes Commander Capt. Michael Gajewski was notified by the FBI that a male matching the description from the Wells Fargo robbery had just robbed a bank in Summit, as well as one in Maplewood. Further investigation by Major Case Detectives led to a positive identification of <mark>Walsh</mark> as the suspect, Morrill added. Gajewski, Jersey City Police Lt. Mark Conroy and detectives from the Major Case Squad responded to 98 Bright St. with FBI agents and State Police, and placed <mark>Walsh</mark> under arrest. A search of <mark>Walsh</mark>'s residence and vehicle led to the recovery of evidence further linking the actor to the three bank robberies, Morrill said. Most Read", "articleID": "2016072219_00045972_W", "names": {"John Walsh": ["Q17123667", "Q18385563", "Q29436093", "Q54321922", "Q58040597", "Q6262859", "Q6262861", "Q6262863", "Q6262867", "Q6262872", "Q6262874", "Q6262876", "Q6262884"]}}, {"date": "2016-07-23", "url": "http://www.breitbart.com/news/munich-gunmans-spree-linked-to-breivik-not-is-group/", "content": "SIGN UP FOR OUR NEWSLETTER Munich (Germany) (AFP)--A teen gunman who killed nine people in a rampage in Munich was \"deranged\" , police said Saturday, linking his actions to Norwegian far-right mass murderer Anders Behring Breivik rather than Islamic State jihadists. SIGN UP FOR OUR NEWSLETTER Europe reacted in shock to the third attack on the continent in just over a week, after the black-clad gunman went on a shooting spree at a shopping mall on Friday evening before committing suicide. \"There is absolutely no link to the Islamic State,\" Munich police chief Hubertus Andrae said. He describing the attack as a \"classic act by a deranged person\" and described an individual \"obsessed\" with mass shootings. Andrae added: \"The link is evident\" with Breivik's massacre of 77 people, which took place exactly five years ago to the day. Munich prosecutor Thomas Steinkraus-Koch said the 18-year-old German-Iranian--whose name has been withheld for the time being--had suffered depression and reportedly undergone psychiatric treatment. Grieving Munich residents laid roses and lit candles in memory of the victims, with one placard bearing the simple plea: \"Why?\" \"Bloodbath in Munich,\" was the headline on the best-selling Bild newspaper as Germany struggled to come to terms with the killings. The attack had sent Germany's third largest city into lockdown as police launched a massive operation to track down what had initially been thought to be up to three assailants. Chancellor Angela Merkel was to convene her security council on Saturday to address the shooting. The incident occurred four days after an axe rampage on a train in the same German state of Bavaria and eight days after a truck attack in the French Riviera city of Nice that killed 84 people. Both assaults have been linked to jihadism. Armed with a handgun, the attacker opened fire at a McDonald's restaurant and continued along the street before entering the mall. A police patrol shot and wounded the gunman but he managed to escape before police found the body of what they believed was the \"only shooter .\" Among the nine killed were three Kosovans, according to the foreign ministry in Pristina, while Munich police said the injured included children .--Scenes of panic--A video posted on social media appeared to show a man in black walking away from a McDonald's while firing repeatedly on people as they fled screaming. Survivors described terrifying scenes as shoppers rushed from the area, some carrying children in their arms. \"We entered McDonald's to eat...then there was panic, and people ran out,\" one woman told Bavarian television. Another video appeared to show the gunman on a car park roof exchanging a tirade of insults with a man on a nearby balcony. \"I'm German, I was born here,\" the assailant replies after the man fired off a volley of swear words, including an offensive term for foreigners. Police initially believed there could be up to three assailants. But Andrae later said two others had \"absolutely nothing to do\" with the attack--and that they were simply fleeing the scene. Munich's main train station was evacuated and metro and bus transport suspended for several hours while residents were ordered to stay inside, leaving the streets largely deserted .--\"Europe stands united'--President Joachim Gauck said he was horrified by the\" murderous attack \", while US President Barack Obama voiced staunch support for Washington's close ally .\" Our thoughts are with the victims, their families, and all German people. Europe stands united, \"EU foreign policy chief Federica Mogherini said on Twitter. Europe has been on high alert for terrorism after a string of attacks in neighbouring France and Belgium claimed by IS. The attack came just days after a 17-year-old asylum seeker went on a rampage with an axe and a knife on a train on Monday near Wuerzburg, also in Bavaria, injuring five people. Interior Minister Thomas de Maiziere had said that assailant was believed to be a\" lone wolf \"who appeared to have been\" inspired \"by IS but was not a member of the jihadist network. On July 14, 31-year-old Tunisian Mohamed Lahouaiej Bouhlel used a truck to mow down 84 people, including children, after a Bastille Day fireworks display in Nice, the third major attack on French soil in the past 18 months. Friday's massacre spurred many in Munich to think the unthinkable .\" It has reached us. People in Munich have long had a queasy feeling. Fears grew with every attack in Paris, Istanbul or Brussels, \"said the Abendzeitung newspaper's editor-in-chief <mark>Michael Schilling</mark>.\" There were particular concerns about the Oktoberfest. But since Friday it is clear that there can be no security anywhere, not even in the safest German city. \"The train attack had already triggered calls by some politicians to impose an upper limit on the number of refugees coming into Germany, which accepted a record 1.1 million migrants and refugees last year, many through Bavaria.", "articleID": "2016072311_00823698_W", "names": {"Michael Schilling": ["Q23060283", "Q28006965"]}}]