[{"date": "2016-07-24", "url": "http://www.getsurrey.co.uk/news/surrey-news/developers-vow-make-guildford-the-11646853", "content": "Developers vow to make Guildford \"the Hollywood of gaming' 16:06, 24 Jul 2016 The second G3 Futures event brought together a range of leading lights from Guildford's thriving gaming industry SharesThe video will start in 8s Cancel Click to playTap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video More than 150 developers and specialists attended the second G3 Futures event, aimed at galvanising the Guildford games industry. The town is often described as the\" Hollywood of the games industry \", home to EA Games, Hello Games (the creator of No Man's Sky) and the\" godfather of Guildford gaming \"Peter Molyneux. Organised by the University of Surrey, UK Interactive Entertainment trade body (UKIE) and technology law specialist <mark>Charles Russell</mark> Speechlys, the purpose of the event was to provide an opportunity for local gaming companies to network, share ideas and learn about the latest innovations and industry issues. Jo Twist, chief executive of UKIE, delivered the first of two keynote speeches. She highlighted the increasing importance of collaboration post-Brexit and of maintaining access to more than 500 million customers across Europe. Dr Twist highlighted her mission to enhance the profile of the games industry, positioning it alongside film, theatre and other cultural mediums. The second keynote speech was given by Ian Baverstock, chief executive of Chilled Mouse, who talked about\" what makes gaming great in Guildford \". He concluded that the cluster of people in successful gaming companies in the town has attracted other developers over the years, resulting in a thriving community that continues to go from strength to strength:\" It's a great place to live and we make great games, \"he said. Nick Hurley, partner at <mark>Charles Russell</mark> Speechlys and co-host at the event, said:\" Our second G3 Futures event was a real success as it pulled in even more indie developers and people from the industry, making the event relevant and authentic. \"A number of delegates told me how energised they felt by the G3 conference .\" Keeping the creative and developer focus in the Guildford area is critical for the South East's continued success in the technology sphere, so we will continue to put all our efforts into supporting this important and vibrant community as it cements its reputation on a world stage. \"Co-host John Collomosse, an academic in the University of Surrey Centre for Vision for Speech and Signal Processing, said:\" G3 is a fantastic opportunity to forge further links between the university and local games sector. \"The university is heavily invested in the creative industries through degree programmes such as the Digital Media Arts, and its research in 5G mobile technology, spatial audio and performance capture, all of which were showcased .\" ", "articleID": "2016072415_01143350_W", "names": {"Charles Russell": ["Q25536336", "Q5082285", "Q725006"]}}, {"date": "2016-07-25", "url": "http://wbtw.com/ap/ap-source-yanks-discussing-deal-to-send-chapman-to-cubs/", "content": "AP source: Yanks discussing deal to send Chapman to Cubs RONALD BLUM, The Associated Press Published: July 24, 2016, 9:28 pm Updated: July 24, 2016, 9:38 pm NEW YORK (AP)--Aroldis Chapman and the rest of the New York Yankees dressed in their Sunday best for a flight to Houston following a 5-2 win over the San Francisco Giants that completed a 6-4 homestand. Who returns in 10 days is unclear. New York was discussing a trade that would send Chapman to the Chicago Cubs as part of a swap that would bring 19-year-old shortstop prospect Gleyber Torres to the Yankees, a person familiar with the discussions told The Associated Press. The person spoke to the AP on condition of anonymity because talks were ongoing and New York owner Hal Steinbrenner had not made any final decision. Nathan Eovaldi (9-6) pitched shutout ball into the seventh inning, <mark>Carlos Beltran</mark> and Mark Teixeira hit early solo home runs of Jeff Samardzija (9-6) and <mark>Chad Green</mark> pitched 2 1/3 scoreless innings. \"We're very much in this,\" Brett Gardner said. \"There's no point in me sitting here campaigning for us to stay together .\" But the Yankees (50-48), who matched their season high of two games over .500, may have shown their management too little, too late to prevent a selloff of veterans ahead of the Aug. 1 deadline for trades without waivers. New York trails AL East-leading Baltimore by 7 1/2 games and is 4 1/2 games behind Toronto for the league's second wild card, with the Astros and Detroit also ahead. Chapman has 20 saves in 21 chances and his fastball, at up to 105.1 mph, has entertained fans focusing on the scoreboard velocity of every pitch. \"It's tough. I feel comfortable here. I feel like part of the family here,\" he said through an interpreter, adding that the Yankees have been talking to his agent. Chapman has formed the Yankees' No Runs DMC bullpen trio with Dellin Betances and <mark>Andrew Miller</mark>, which has 203 strikeouts in 123 2/3 innings. Chapman, pitcher Ivan Nova, <mark>Beltran</mark> and Teixeira are eligible for free agency at the end of the season; <mark>Miller</mark>, signed through 2018 at $9 million, also is of interest to contenders. \"We don't want to see him go,\" Teixeira said of Chapman. \"We're trying to win games, and he's a big part of that .\" Chapman maintained he could be dealt and still re-sign with the Yankees as a free agent during the offseason. \"Oh yeah, if there's a possibility, and God willing, yes,\" he said. Torres was scratched from the starting lineup of the Class A Myrtle Beach Pelicans on Sunday. <mark>Beltran</mark> hit his team-best 21st home run in the first and Teixeira doubled the lead on the second with his 200th home run for the Yankees, his sixth in 20 games since returning from the disabled list. Teixeira and Jacoby Ellsbury wore white Ken Griffey Jr.. Nike Swingman spikes with gold soles as a tribute to Junior's induction Sunday into baseball's Hall of Fame. New York chased Samardzija in the sixth, when Ellsbury grounded into a run-scoring double play, Starlin Castro singled in a run and Didi Gregorius hit an RBI double. Making his second start following a brief bullpen banishment, Eovaldi used a new cutter for the second time in the homestand. He escaped bases-loaded, one-out trouble in a 33-pitch fourth inning when Mac Williamson fouled out and Ramiro Pena grounded out. Eovaldi left after Angel Pagan's two-out double on his 118th pitch, two shy of his career high. With the No Runs DMC trio unavailable after two days of heavy use, Chasen Shreve came in and loaded the bases with a walk to Brandon Belt, and Buster Posey poked an opposite-field, two-run single to right against <mark>Green</mark>, who then retired Brandon Crawford on a groundout. After losing the first two games of the homestand to Boston, the Yankees won six of eight against the Red Sox, Orioles and Giants. \"We've told our players, and it includes me, you have to stay away from the noise, what you're hearing and rumors and things that might be going on,\" Yankees manager Joe Girardi said. <mark>Beltran</mark>, traded in midseason from Kansas City to Houston in 2004 and from the New York Mets to San Francisco in 2011, knows not to think too far ahead. \"I've been in this situation before,\" the 39-year-old said. \"For me it's day by day .\" WEB GEM New York turned a spectacular 4-1-5 inning-ending double play in the eighth. Pena grounded past a diving Teixeira at first but Castro slid on his stomach to come up with the ball on the outfield grass between first and second, and from his knees threw to <mark>Green</mark> covering first. The pitcher made a one-hop throw to third, where Chase Headley tagged a sliding Williamson. \"That's a play we work on a lot in spring training,\" <mark>Green</mark> said. UP NEXT Yankees: RHP Michael Pineda (4-9) starts Monday and LHP Dallas Keuchel (6-9), the AL Cy Young Award winner, goes for the Astros. Opponents are hitting .181 in Pineda's last five starts. Advertisement More Headlines Previous post in this category Texas League Sports Please enable JavaScript to view the comments powered by Disqus. Leave a Reply Cancel reply Enter your comment here...Please log in using one of these methods to post your comment: Email (required) (Address never made public) Name (required) Website You are commenting using your WordPress.com account. (Log Out / Change) You are commenting using your Twitter account. (Log Out / Change) You are commenting using your Facebook account. (Log Out / Change) You are commenting using your Google + account. (Log Out / Change) Cancel Connecting to% s Notify me of new comments via email. Notify me of new posts via email. Advertisement Advertisement Advertisement Advertisement", "articleID": "2016072501_00616436_W", "names": {"Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"], "Carlos Beltran": ["Q1042743", "Q5041829"], "Chad Green": ["Q24548598", "Q3427247"]}}, {"date": "2016-07-24", "url": "https://www.washingtonpost.com/sports/nationals/bryce-harper-understands-his-slump-better-than-anyone-and-hes-determined-to-fix-it/2016/07/24/643745e6-51e0-11e6-88eb-7dda4e2f2aec_story.html", "content": "Bryce Harper understands his slump better than anyone. And he's determined to fix it. The inside track on Washington politics. Be the first to know about new stories from PowerPost. Sign up to follow, and we'll e-mail you free updates as they're published. You'll receive free e-mail news updates each time a new story is published. You're all set! ByThomas BoswellJuly 24 at 9:15 PM Follow @ ThomasBoswellWP Bryce Harper would appreciate it if everybody would just shut the heck up with all the well-intentioned advice and the high-baseball-IQ analysis about how to get out of his three-month slump. He doesn't want to hear about how fast his front foot does (or does not) stride, or why he flies open with his right shoulder and doesn't keep his bat through the hitting zone as long as he did last year. Harper knows he looks as if his timing is off, that he's in-between on every pitch and drips frustration. \"It's like quicksand. The harder you fight, the deeper you sink,\" said Harper, the 23-year-old reigning National League MVP who is now hitting .24 4 and is in a 5-for-45 nosedive. [Papelbon allows four runs in the ninth as Nats fall to Padres] Harper doesn't want to hear about the pitch sequences that are getting him out or the areas within the strike zone, like up-and-in, where he's done little damage and shown no power all year. If you think you know why he crushed curveballs last year, but not this, keep it to yourself. Trust Bryce on this; he's noticed. There isn't even any consolation in the hard, objective fact that he's had tough luck all year while teammates, for whom he's happy, have gotten the balls-with-eyes and the blessed bloops. \"Everybody means well, but when this guy or that person says something, it's going to get in there in your head. You remember it,\" said Harper, who was benched Sunday for a mental day of rest, before a scheduled off-day for the Nats on Monday, so that his mind could unwind. However, by the bottom of the eighth inning of a 6-6 game, the Nats had men on the corners with only one out and Harper's replacement-for-the-day, Chris Heisey due to hit. It was time to win the game, perhaps with as little as a sacrifice fly. If, for example, in that spot, you had <mark>Ken Griffey</mark>. Jr., who went into the Hall of Fame on Sunday, ready on your bench, wouldn't you use him, no matter what? But this is how badly Harper is going, and how long he has been doing so: Baker kept him out when the game was on the line. \"The only thing is, Bryce hasn't had much success against [Padres reliever Ryan] Buchter,\" Baker said. \"And he was coming off the bench cold. Heisey's a good fastball hitter. And Buchter's left-handed. Bryce hasn't had...or, for that matter, any left-hander hasn't had much success versus Buchter .\" [As trade deadline nears, Nats should go all-in on Chapman] Heisey popped out weakly in foul territory. Baker didn't pinch-hit Harper for the next man, either--strikeout-challenged <mark>Michael A. Taylor</mark>--because the Padres could simply have pitched around Harper to load the bases and get to Danny Espinosa. \"There was never the right spot,\" Baker said. For the Harper of' 15, every spot was the right spot. For the Harper of' 16, at least since April, not so much. <mark>Taylor</mark> chased a high fastball to strike out and kill the rally. The roof (and four runs) fell on Jonathan Papelbon after he'd gotten two outs in the ninth inning, and the Nats lost, 10-6. Their NL East lead remained at 4 & frac12; games as they headed on a nine-game trip. But the game ended on a sour irony as Harper actually did get in the game--after it was too late. Harper replaced Heisey--yes, Heisey--in right field in a double switch to start the ninth. In the bottom half, Harper popped out. Many things went well for Harper last season. But one of them was the presence of former manager <mark>Matt Williams</mark> as a personal day-to-day hitting collaborator. Not a technical coach. They were more mind-meld. They'd talk about the day's pitcher or what sequence to anticipate or, over and over, not to try for monster homers when 390 feet would do. <mark>Williams</mark> made his blunders and had his detractors, but he clicked with Harper. Davey Johnson and Baker both have Harper's respect as managers. But special is special, and who knows exactly why? \"The biggest thing about <mark>Matt</mark> was that he'd tell people to stay the hell away from me .\" He'll get out of his rut,' \"recalled Harper, who has, clearly, been bombarded with counsel from all directions in recent weeks .\" In baseball, it's easy to get voices from everywhere. You hear them. You can't help it. Some of it sticks there. <mark>Matt</mark> would wait until I came to him and say, \"<mark>Matt</mark>, what do you think?' He'd say,\" Well, what do you think?' Usually, I'd answer myself. It was easy. \"And now? [<mark>Aaron Barrett</mark> suffers right elbow fracture during rehab] Just as Harper would do without too much advice, he also doesn't need anybody's sympathy. He talks beside his locker about all the hits that fell in for him last year, the grounders that found holes, when he hit .330, far above any other season in his five years .\" I was able to do that last year, \"Harper said. Then, grinning again, he looks at <mark>Daniel Murphy</mark> being interviewed because he's had another great day .\" Murph's getting some of the hits I got last year, \"Harper said .\" That's why it's so good to be on a great team. We all enjoy [each other's good fortune]. I know I help this lineup. And...\"Harper pauses. Every hitter thinks they are close to the breakout. And Harper has always gotten hot again, his whole baseball life. Others might see the past 99 games; he sees the next 63 .\" October, \"he says, meaning when the totals are finally added up .\" Twenty homers, 60 RBI, \"he says with an ambiguous look. Does he mean the 20 bombs and 55 RBI he already has, or what might still be to come? For Harper, every season, and every part of that season, is just part of a larger work-in-progress that is never finished .\" No amount of production will ever be what I want. Last year wasn't enough, \"he says .\" I'm still trying to learn, still evolve. \"As just one example, in anticipating pitch sequences,\" I'm trying to work off the catcher. There's a big difference between what a young catcher calls and Yadi [Molina] or Buster [Posey] is going to call? I'll think, \"What would Yadi call in this situation to get himself out?'\" Then you have [pitchers like] Max Scherzer who calls his own game, \"Harper said .\" You try to figure out their \"book' on you. And then when they\" flip the book .' \"Harper starts remembering individual recent at-bats that almost were, but were not, what he'd hoped. That 475-foot third-deck homer last week is almost forgotten. But the pitch on Saturday night when he struck out? On that he was\" just out in front...back it up. \"The bombs and the K's, they look so different from the stands. They feel so close together in the batter's box--well, if Harper is the person in that box .\" You want to be so good. Someday, maybe I'll have all the books [on me], \"he said, half-joking as he gets his dress suit just right and his tie the way he wants it. Then it'll be,\" You got me last time. But you won't get me this time .' \"Harper heads for the Nats team bus. Who knows how he does it, but he looks as confident, as optimistic that he'll figure a way out of the quicksand, as he always does. The stat sheet says .245, but Harper walks away like his feet won't be in a quagmire, his fanny benched against a lefty, for too much longer. For more by Thomas Boswell, visit washingtonpost.com/boswell. sports Get 2016 Olympics updates by email Our best news and analysis from Rio, delivered to your inbox. post_newsletter333", "articleID": "2016072502_00064976_W", "names": {"Aaron Barrett": ["Q16198187", "Q4661830"], "Daniel Murphy": ["Q3014492", "Q528318"], "Ken Griffey": ["Q5365718", "Q536900"], "Matt Williams": ["Q16214685", "Q17198892", "Q18067694", "Q1909625", "Q20710880", "Q3299581", "Q3299589", "Q39072103", "Q47813338", "Q6789525", "Q6789526", "Q6789527", "Q6789528", "Q6789529", "Q6789530", "Q6789531", "Q6789532"], "Michael A. Taylor": ["Q14950779", "Q17161464", "Q30533680"]}}, {"date": "2016-07-27", "url": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/qw7sqDmAvkY/", "content": "Comment Share Tweet Stumble Email President Obama on Tuesday didn't rule out the idea that the Russians hacked into internal emails at the Democratic National Committee in order to influence the U.S. presidential election this November. \"Anything's possible,\" Mr. Obama said in an interview with NBC News' Savannah Guthrie. In depth: Democratic convention 2016 The 2016 Democratic convention - live updates The president pointed out that the FBI is still investigating the breach, which resulted in the disclosure of more than 19,000 DNC emails, and he also acknowledged that experts are pointing to the Russians. Play Video CBSN Was Russia behind hack on DNC email servers? CBS News' Jeff Pegues and Michael Isikoff, chief investigative reporter for Yahoo News, discuss the DNC email leak. \"What we do know is the Russians hack our systems, not just government systems, but private systems,\" he said. \"But what the motives were in terms of the leaks and all that, I can't say directly, but what I do know is that <mark>Donald Trump</mark> has repeatedly expressed admiration for Vladimir Putin .\" Asked if the president was suggesting that Putin is motivated to prefer <mark>Trump</mark> in the White House, Mr. Obama said, \"I am basing this on what Mr. <mark>Trump</mark> himself has said. And I think that <mark>Trump</mark>'s gotten pretty favorable coverage back in Russia .\" On Tuesday, U.S. officials confirmed to CBS News that they believe that people working for the Russian government are behind the hack. In an interview with CBS's Miami affiliate, <mark>Trump</mark> denied that he has any ties to Russia and that its government is trying to help him win this election. \"I don't know anything about it. I can tell you, I think if I came up with that, they'd say,\" Oh, it's a conspiracy theory,' it's ridiculous. I mean I have nothing to do with Russia. I don't have any jobs in Russia. I'm all over the world but we're not involved in Russia. \"Mr. Obama is set to deliver remarks at the Democratic convention in Philadelphia Wednesday night. & copy; 2016 CBS Interactive Inc.. All Rights Reserved. Comment Share Tweet Stumble Email Rebecca Shabad Rebecca Shabad is a video reporter for CBS News Digital.", "articleID": "2016072715_00239660_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]