[{"date": "2016-07-27", "url": "http://portsmouth-dailytimes.com/news/9483/2500-raised-for-animals-in-need", "content": "Musician Henry Gross, an animal-lover and no stranger to heartache, teamed up with Sierra's Haven to put on the \"Cause for Paws' concert held last Thursday. Last Thursday, July 21, music-lovers and animal aficionados gathered for a concert at Port City Cafe and Pub to support Sierra's Haven for New and Used Pets. The second annual\" Cause for Paws,' concert raised over $2,500 dollars for Sierra's Haven. \"It was a really great evening,\" said Shawnee Animal Clinic's Dr. Gail Counts. \"We sold over 70 tickets and overall it was a great night .\" The shelter was founded in memory of Counts' brother Bernie. Bernie Counts, Jr. was the brother of Dr. Gail Counts, who serves as the President and Executive Director of Sierra's Haven. He died at the age of 42 of a heart attack. Sierra, his cat, stayed by his side until he was found by a neighbor. Sierra has since passed away, but both Sierra's and Bernie's memories will live forever in the work being done at Sierra's Haven. The concert, was a performance by Henry Gross, an American singer-songwriter best known for his association with the group Sha Na Na and for his hit song, Shannon. In 1976 when Shannon was climbing the charts, few knew that Gross was singing from a broken heart. The power ballad that sold a million records and was a top 10 hit, was about the death of Beach Boys member <mark>Carl Wilson</mark>'s Irish Setter and the pain we all feel after losing a pet. \"Henry did an amazing job and everyone really enjoyed the show,\" explained Counts. \"This was the second year we've done the show and we're going to make it an annual event. It just continues to grow every year. We're really grateful to Henry for agreeing to do this and to <mark>Steve Hayes</mark> for helping promote and organize the concert. We're also so glad that Port City provides us with a space to do this as well as the food and the drinks for the evening. And of course, we're grateful for the continual support of the community .\" Sierra's Haven is a no-kill animal shelter, staffed by a dedicated group of volunteers working together to help find safe, loving homes for adoptable pets. Whether strays, drop - offs or animals in need of medical attention, Sierra's has opened their doors to thousands of animals and saving their lives. For more information, you can visit Sierra's Haven wesbite at www.sierrashaven.org, and on Facebook \"Sierra's Haven for New and Used Pets .\" Musician Henry Gross, an animal-lover and no stranger to heartache, teamed up with Sierra's Haven to put on the \"Cause for Paws' concert held last Thursday. http: //portsmouth-dailytimes.com/wp-content/uploads/2016/07/web1_Henry-Gross-RECAP.jpgMusician Henry Gross, an animal-lover and no stranger to heartache, teamed up with Sierra's Haven to put on the\" Cause for Paws' concert held last Thursday. By Ciara Conley [email protected] Reach Ciara Conley at 740-353-3101 ext. 1932, Facebook \"Ciara Conley--Daily Times,\" and Twitter @ PDT_Ciara Portsmouth Daily Times Reach Ciara Conley at 740-353-3101 ext. 1932, Facebook \"Ciara Conley - Daily Times,\" and Twitter @ PDT_Ciara Please enable JavaScript to view the comments powered by Disqus. comments powered by Disqus", "articleID": "2016072717_01022652_W", "names": {"Carl Wilson": ["Q19360696", "Q28873143", "Q29033805", "Q5040973"], "Steve Hayes": ["Q16193141", "Q31381382", "Q7612798", "Q7612799", "Q767363"]}}, {"date": "2016-07-27", "url": "http://www.mirror.co.uk/sport/football/news/brian-reade-column-forget-england-8505325", "content": "Compared to the summer of 50 years ago, this one hasn't exactly been a classic for English football, has it? Realising your national side isn't as good as Iceland's and that the best available choice to lead it into a bold, new era is Sam Allardyce fills an England fan with the kind of confidence a sixth-former has going to a disco with a cold-sore moustache. But a new Premier League season is now just around the corner--when football addicts from Khartoum to Kuala Lumpur will be crowding outside the windows of TV shops to watch the Greatest Show On Earth (copyright Richard Skydamore). Action Images via Reuters / Andrew Couldridge But anyway...let's focus on the new Premier League season So let's look past the ugly sights of next season--Norwich's third kit, Gary Lineker in his undies, Jose Mourinho whining about this new-fangled competition called the Europa League that has been designed solely to punish him--and focus on the positives. Read More David Beckham's Sky ad for the new season will make you ridiculously excited Here, in a bid to lift the spirits, I offer fans of all Premier League clubs three reasons to be cheerful: LEICESTER You are the champions. So far you've only lost N'Golo Kante. And you're looking at the prospect of watching Barcelona, Real Madrid or Juventus walk on to your pitch while you bang your plastic clackers together in time to the Champions League anthem. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video ARSENAL You may have missed out on Jamie Vardy, Zlatan Ibrahomivic and every other decent striker, but look at the plusses. Piers Morgan now lacks the will to keep up his \"Wenger Out\" rants. So enjoy your ascent to the top of the table. And then the fury of the downfall. Read More Ivan Gazidis insists Arsenal \"can't afford to outgun competitors\" TOTTENHAM That shocking run at the end of last season is history. Those young stars will be a year older and wiser. You're back in the Champions League, meaning you might be welcoming Real Madrid's Gareth Bale and Luka Modric back to London for a good pasting. Action Images / Matthew Childs These two could return to face their old club one midweek night before Christmas MANCHESTER CITY You're seeing Pep Guardiola on the training ground and the touchline. You're seeing Pep Guardiola at press conferences. Less than a decade ago, you were seeing Stuart Pearce in those places. MANCHESTER UNITED Louis van Gaal's clipboard has gone. Ibrahimovic and Mourinho are in place. Meaning Wayne Rooney will finally have to justify his & pound; 300,000-a-week wages or he'll be back on a plane to China--this time to play. Man Utd via Getty Where will Jose Mourinho deploy Wayne Rooney--and how often? SOUTHAMPTON You've lost your best players and your manager. But that happens every year and you cope. Do it again and you'll have the added pleasure of making me look a fool for saying this is the time you get sussed. WEST HAM Your Tory board managed to wangle the Olympic Stadium off a Tory government for two bob. You've got the star player of the Euros, Dimitri Payet, and the star pundit, Slaven Bilic. You're back in Europe--and good enough to take it seriously. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video LIVERPOOL Jurgen Klopp is ruthlessly moving on the dead-wood. He's also bringing in midfielders who look like they might be able to score. And you'll be able to watch them do so in a rebuilt Anfield, not some plastic Subbuteo stadium in Stanley Park. STOKE <mark>Mark Hughes</mark>, not Tony Pulis, is in charge, meaning decent football not rugby. You've convinced exotic names such as Shaqiri, Bojan, Arnautovic and Afellay to remain in The Potteries. And you've just added The Welsh Xavi. Twitter/Stoke City FC <mark>Joe Allen</mark> has joined Stoke's talented squad after shining for Wales at the Euros CHELSEA With new boss <mark>Antonio Conte</mark>, the words \"player power\" will be a thing of the past. Eden Hazard can't be as bad as last season. And your \"Captain, Leader, Legend\" will still be wearing a full Chelsea kit...when he bunks in on any laps of honour. EVERTON By hiring Ronald Koeman and <mark>Steve Walsh</mark>, new major shareholder <mark>Farhad Moshiri</mark> has shown brains and nous. Romelu Lukaku will probably stay, and be joined by players bought for unheard-of fees. And <mark>Bobby Brown</mark> Shoes will no longer state the opposite of what you've just seen. Tony McArdle/Everton FC via Getty Images Ronald Koeman and <mark>Steve Walsh</mark> have the job of making Everton contenders again SWANSEA Andre Ayew and Gylfi Sigurdsson are still there. You've got a couple of Dutchmen in and there's talk of a bid to bring Wilfried Bony back. And this is your sixth season in the Premier League--to Cardiff's one. WATFORD You've kept those two lethal strikers Troy Deeney and Odion Ighalo. You've lost a decent manager but in Walter Mazzarri gained one with a fine pedigree at the highest level in Italy. And you've bought a striker called Success. Which bodes well. Getty Watford have strengthened their attack by signing the brilliantly named Isaac Success WEST BROM Tony Pulis may bore you, but he'll bore you to safety. The Saido Berahino saga is surely about to end. You could be taken over by the richest man in China, meaning the financial shackles may soon come off. CRYSTAL PALACE Christian Benteke will no doubt end up getting on the end of Andros Townsend's crosses. The loudest of fans will cheer them on. Which could see a flying start that has Alan Pardew grinding his groin into the cameras in woefully premature celebration. Pardew's FA Cup final dance moves when Palace took the lead backfired on him BOURNEMOUTH You're still mixing it with the big boys and can open the season by beating Mourinho's Man United at home. Eddie Howe was not nicked by England. In Jordon Ibe and <mark>Brad Smith</mark> you've bought the cream of Liverpool's young talent. Sort of...SUNDERLAND The boss who sees narrowly avoiding relegation as a \"big achievement\" has gone. Replaced by one who, in his last seven seasons at Everton, averaged a sixth-placed finish on a net spend of & pound; 850,000. Newcastle went down. Getty David Moyes' arrival promises more ambitious goals than mere survival at Sunderland BURNLEY Back in the Premier League at the first attempt with your manager and players all the stronger for it. Last season's 40-goal strike partnership of Andre Grey and Sam Vokes is still there. As are Blackburn--in the Championship. MIDDLESBROUGH After seven years in exile, you're back where you belong. Neven Subotic almost joined. Alvaro Negredo and Victor Valdes did, reminding you of the days you could attract stars like Ravanelli and Juninho. Albeit today's stars are a decade older. HULL Right now, you've got 13 fit players. Plus no manager. So surely, things can only get better? Poll loading ...", "articleID": "2016072719_00098293_W", "names": {"Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"], "Bobby Brown": ["Q16091730", "Q16186597", "Q18631694", "Q2907929", "Q311241", "Q4934816", "Q4934817", "Q4934818", "Q4934821", "Q82004", "Q888468", "Q888471"], "Brad Smith": ["Q15477554", "Q16218831", "Q23664265", "Q24084114", "Q2923428", "Q4954263", "Q4954264", "Q4954266", "Q4954267", "Q4954269", "Q4954270", "Q50300377"], "Farhad Moshiri": ["Q3066849", "Q861168"], "Joe Allen": ["Q313250", "Q6208327", "Q641139"], "Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"], "Steve Walsh": ["Q24060240", "Q3499152", "Q4111257", "Q583470", "Q7614221"]}}, {"date": "2016-07-27", "url": "http://www.nytimes.com/2016/07/31/books/review/editors-choice.html", "content": "Book Review Editors' Choice JULY 27, 2016 Continue reading the main story Share This Page Nine new books recommended by the editors of The New York Times Book Review this week. Photo HEROES OF THE FRONTIER, by Dave Eggers. (Knopf, $28.95 .) In Eggers's funny, empathetic novel about learning to survive, a woman flees her crumbling life in Ohio and takes her two children on a road trip to a dystopian Alaska. BUSH, by Jean Edward Smith. (Simon & Schuster, $35 .) \"Rarely in the history of the United States has the nation been so ill-served,\" Smith writes in his readable critical biography of George W. Bush. CHRONICLE OF A LAST SUMMER, by Yasmine El Rashidi. (Tim Duggan, $22 .) A perceptive novel about the political coming-of-age of an Egyptian woman, ending with the 2011 revolution. WE ARE NOT SUCH THINGS: The Murder of a Young American, a South African Township, and the Search for Truth and Reconciliation, by Justine van der Leun. (Spiegel & Grau, $28 .) A 1993 killing sheds light on the complexities of modern South Africa. MISS JANE, by <mark>Brad Watson</mark>. (Norton, $25.95 .) <mark>Watson</mark> imagines the life of a relative with a genital birth defect in early-20th-century Mississippi in this ambitious, touching novel. Book Review Newsletter Sign up to receive a preview of each Sunday's Book Review, delivered to your inbox every Friday. BRAZILLIONAIRES: Wealth, Power, Decadence, and Hope in an American Country, by Alex Cuadros. (Spiegel & Grau, $28 .) A deeply reported account of Brazil's outsize collection of tycoons. THE GAMES: A Global History of the Olympics, by <mark>David Goldblatt</mark>. (Norton, $29.95 .) An exhaustively researched account of the modern Olympic movement, warts (there are many) and all. THE HEAVENLY TABLE, by Donald Ray Pollock. (Doubleday, $27.95 .) This old-fashioned yarn is also a rollicking satire on our faith in modernity. THE VEINS OF THE OCEAN, by Patricia Engel. (Grove, $25 .) A Colombian-American woman flees the demons of her past in this sumptuous novel. A version of this list appears in print on July 31, 2016, on page BR26 of the Sunday Book Review. Order Reprints | Today's Paper | Subscribe Continue reading the main story We're interested in your feedback on this page. Tell us what you think.", "articleID": "2016072723_00048945_W", "names": {"Brad Watson": ["Q4954344", "Q4954347"]}}]