[{"date": "2016-07-27", "url": "http://www.nytimes.com/2016/07/31/books/review/editors-choice.html", "content": "Book Review Editors' Choice JULY 27, 2016 Continue reading the main story Share This Page Nine new books recommended by the editors of The New York Times Book Review this week. Photo HEROES OF THE FRONTIER, by Dave Eggers. (Knopf, $28.95 .) In Eggers's funny, empathetic novel about learning to survive, a woman flees her crumbling life in Ohio and takes her two children on a road trip to a dystopian Alaska. BUSH, by Jean Edward Smith. (Simon & Schuster, $35 .) \"Rarely in the history of the United States has the nation been so ill-served,\" Smith writes in his readable critical biography of George W. Bush. CHRONICLE OF A LAST SUMMER, by Yasmine El Rashidi. (Tim Duggan, $22 .) A perceptive novel about the political coming-of-age of an Egyptian woman, ending with the 2011 revolution. WE ARE NOT SUCH THINGS: The Murder of a Young American, a South African Township, and the Search for Truth and Reconciliation, by Justine van der Leun. (Spiegel & Grau, $28 .) A 1993 killing sheds light on the complexities of modern South Africa. MISS JANE, by <mark>Brad Watson</mark>. (Norton, $25.95 .) <mark>Watson</mark> imagines the life of a relative with a genital birth defect in early-20th-century Mississippi in this ambitious, touching novel. Book Review Newsletter Sign up to receive a preview of each Sunday's Book Review, delivered to your inbox every Friday. BRAZILLIONAIRES: Wealth, Power, Decadence, and Hope in an American Country, by Alex Cuadros. (Spiegel & Grau, $28 .) A deeply reported account of Brazil's outsize collection of tycoons. THE GAMES: A Global History of the Olympics, by <mark>David Goldblatt</mark>. (Norton, $29.95 .) An exhaustively researched account of the modern Olympic movement, warts (there are many) and all. THE HEAVENLY TABLE, by Donald Ray Pollock. (Doubleday, $27.95 .) This old-fashioned yarn is also a rollicking satire on our faith in modernity. THE VEINS OF THE OCEAN, by Patricia Engel. (Grove, $25 .) A Colombian-American woman flees the demons of her past in this sumptuous novel. A version of this list appears in print on July 31, 2016, on page BR26 of the Sunday Book Review. Order Reprints | Today's Paper | Subscribe Continue reading the main story We're interested in your feedback on this page. Tell us what you think.", "articleID": "2016072723_00048945_W", "names": {"David Goldblatt": ["Q16196023", "Q51053608", "Q569669"]}}, {"date": "2016-08-01", "url": "http://www.fool.com/investing/2016/08/01/forex-dents-kimberly-clark-corp-earnings.aspx?source=iedfolrf0000001", "content": "Data source: Kimberly-Clark Q2 2016 Earnings Press Release. What happened with Kimberly-Clark this quarter? Organic sales grew 3%, driven by a 4% increase in volume. However, net sales decreased 1.2% to $4.6 billion, as these gains were more than offset by a 4% negative impact from foreign exchange. Adjusted operating profit--which excludes restructuring costs, pension settlement charges, and other nonrecurring items--rose 5% to $828 million, as cost savings related to Kimberly-Clark's FORCE (Focused on Reducing Costs Everywhere) program and lower raw-material costs boosted results. All told, adjusted net income, which benefited from a lower effective tax rate, increased 7.8% to $556 million. And adjusted earnings per share, aided by share buybacks, rose 8.5% to $1.53. What management had to say \"We delivered a good quarter of results in a challenging environment while we continue to execute our long-term Global Business Plan strategies,\" said chairman and CEO <mark>Thomas Falk</mark> in a press release. \"In the second quarter, we achieved a 4 percent increase in sales volumes, with benefits from targeted growth initiatives and product innovations. We also delivered $110 million of cost savings, which helped improve our profitability and increase our adjusted earnings per share .\" Cash flow and capital returns Second-quarter operating cash flow rose 11% to $860 million, due to Kimberly-Clark's higher cash earnings and improved working capital, and free cash flow jumped 29% to $683 million. Management remains committed to passing on this cash flow to Kimberly-Clark's investors via dividends and stock buybacks, with the company repurchasing 1.1 million shares at a cost of $150 million in the second quarter. The quarterly dividend is $0.92 per share. Looking forward Kimberly-Clark reiterated its full-year adjusted EPS forecast of $5.95 to $6.15. However, the company now expects its organic sales growth to be at the low end of its prior guidance of 3% to 5%, which is likely to be offset by a 4% to 5% negative impact from foreign exchange. \"Cash flow was strong in the quarter and we continued to allocate capital in shareholder-friendly ways,\" added <mark>Falk</mark>. \"Half way through the year, we are broadly on track with our plans and are confirming our bottom-line earnings guidance for 2016 .\" Joe Tenebruso has no position in any stocks mentioned. The Motley Fool recommends Kimberly-Clark. Try any of our Foolish newsletter services free for 30 days. We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy. Author", "articleID": "2016080123_00359263_W", "names": {"Thomas Falk": ["Q7789507", "Q7791054"]}}, {"date": "2016-07-31", "url": "http://kckingdom.com/2016/07/31/kansas-city-chiefs-eric-fisher-gets-his-deal/", "content": "Kansas City Chiefs: <mark>Eric Fisher</mark> Gets His Deal Comment Kansas City Chiefs offensive tackle <mark>Eric Fisher</mark>--Mandatory Credit: Troy Taormina-USA TODAY Sports The Kansas City Chiefs signed offensive tackle <mark>Eric Fisher</mark> to a four year contract extension worth $48 million, with $40 million guaranteed. The Kansas City Chiefs made an investment in their offensive line by locking up offensive tackle <mark>Eric Fisher</mark> to a four year contract extension worth up to $48 million. The deal includes $40 million in guaranteed money. It comes on top of <mark>Fisher</mark>'s current deal and his 5th year option in 2017. <mark>Fisher</mark> is the second player the team has re-signed from the 2013 NFL Draft. This deal, along with the signing of Mitchell Schwartz earlier this offseason, gives the Kansas City Chiefs their bookend offensive tackles for the next five years. This is an important investment for the team as it sets the basis for how the offensive line will look. In a lot of ways, that sets the tone for the team as a whole. With the announcement of <mark>Fisher</mark>'s new deal, General Manager John Dorsey told reporters: \"In three seasons he's grown significantly as a football player in our system. He's a tough, physical presence and a leader on our offensive line. We look forward to keeping him as a part of our organization and community .\" When <mark>Andy Reid</mark> and John Dorsey first came to Kansas City, they expressed to the fan base that they intended to build the team through the offensive line. Since then they have drafted six linemen over the past four drafts and have signed or traded for numerous veterans. Unfortunately, many of those moves have no panned out...which is what makes <mark>Fisher</mark>'s new contract truly important. \"In three seasons (<mark>Eric Fisher</mark>) has grown significantly as a football player in our system .\" ~ Chiefs GM John Dorsey <mark>Eric Fisher</mark> is the second Chiefs offensive lineman to get a second contract from the team (Jah Reid was given a second deal earlier this offseason). As the team's 2013 1st round pick, number one overall in the draft, it is important that the team felt comfortable in their investment in him. <mark>Fisher</mark> has been a favorite target for fan ire ever since his rookie season. His early struggles in the NFL have been well-documented. However, <mark>Fisher</mark> took a clear step forward in 2015 that was highlighted with the much-loved (in Chiefs Kingdom anyways) shot of him delivering a clean up shot to JJ Watt in the AFC Wild Card game. While that play was just one in a long season, it was indicative of the improvements <mark>Fisher</mark> made. The mean streak that was talked about when he was a draft prospect finally showed up last year. He also showed the ability to stick with opposing pass rushers, and set himself up as a force in the running game. His ability to perform those two aspects of the game are why he's got a new contract. Next: Kansas City Chiefs Training Camp Recap Day Three Want your voice heard? Join the KC Kingdom team! The Chiefs are investing in their future, and that's big news. It shows a level of faith by the front office, not just in one player, but in the direction of the franchise in general. They aren't cutting bait with their talented players, which means they are continuing to build on their current success. That's what the best franchises in the league do. Top Stories", "articleID": "2016080123_00441090_W", "names": {"Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "Eric Fisher": ["Q30075239", "Q5386483"]}}, {"date": "2016-08-04", "url": "http://au.sports.yahoo.com/league/a/32241906/benji-marshalls-contract-hopes-suffer-blow/", "content": "Matt Encarnacion - AAP on August 5, 2016, 8:02 am Replay Video will begin in STOP UP NEXT Video Broncos hold out Dragons in the wet Share Tweet Whatsapp Email Share Benji Marshall s contract hopes suffer blow - Yahoo7 Pinterest Tumblr Benji Marshall's chances of earning a new NRL contract took another blow after suffering a rough outing with the ball in St George Illawarra's loss to Brisbane on Thursday. While the veteran playmaker tried hard to spark his team's spluttering attack, he committed five of his team's nine errors, including two fumbles in attacking opportunities and one kick out on the full. Summing up his night was a crucial turnover late in the game, when he was caught on the sixth tackle with the Dragons searching for a game-winning play. Marshall opted not to talk following the match, while Dragons coach <mark>Paul McGregor</mark> declined to comment on Marshall's performance post-game. \"I'm not here to talk about individuals. It's a team sport and it's no good sitting in front of anyone talking about individual players,\" he said. However <mark>McGregor</mark> did concede that the Broncos' kicking game was a major factor in the Dragons falling to their fifth straight defeat, all but ending their finals ambitions. Marshall took 14 of the Dragons' kicks, while halves partner Gareth Widdop hit nine. \"You have a look at the game, where we started play one and where they started play one...Our kick placement wasn't where it needed to be,\" he said. <mark>McGregor</mark> also admitted he has grown tired of the constant speculation surrounding his off-contract players, particularly Marshall and hooker Mitch Rein. \"Since November there's been a lot of talk about contracts at the club and it's been a real unstable environment because of that,\" he said. \"I've just been answering every media session all year and every time about certain players .\" They know my feelings, the players. So now it's time for the recruitment guys to do their job and step up and answer the questions that you write about who's here and who's not here next year. \"Share Tweet Whatsapp Email Share Benji Marshall s contract hopes suffer blow - Yahoo7 Pinterest Tumblr", "articleID": "2016080423_00334695_W", "names": {"Paul Mcgregor": ["Q7152359", "Q7152360"]}}, {"date": "2016-08-05", "url": "http://www.bclocalnews.com/news/389310611.html#storyComments", "content": "News Falun Gong brings protest to Penticton Jing Trien (right) along with Vera Sun and Joy Wang are Falun Gong practitioners who were recently in Penticton to raise awareness of human rights abuses against Falun Gong in China .--image credit: Mark Brett/Western News posted Aug 5, 2016 at 10:00 AM Jing Trien is one of the lucky ones. The 37-year-old Vancouver resident and Falun Gong practitioner managed to escape her captors and her home country of China but left with some very deep emotional scars. Trien was a member of a group of touring Falun Gong proponents who were in Penticton recently to raise awareness and support for their cause. In particular, they want an end to what they say is the mass killings and the state-sponsored crime of forced organ harvesting of its members in China. Trien was in prison with other family members including her sister, brother and mother. \"Jing says she is so fortunate and lucky because her mother was persecuted and then blinded and then died,\" said Vera Sun who translated Trien's statement. \"She knew another woman in the prison with her, after being persecuted to death and when the family came to check the body they found holes at the waist where they took the organs .\" Trien was eventually able to escape to Thailand and made her way to Canada in 2009. Her brother also escaped but is still in Thailand. During her incarceration Trien had numerous physical check ups and now believes her poor medical condition was part of the reason she escaped organ harvesting. \"Millions more are not so lucky,\" said Sun. \"That is why all of us volunteers are doing this, to simply raise awareness of what's going on .\" We are urging Canadians to condemn the horrific crime of forced organ harvesting from Falun Gong practitioners in China and to help stop the ongoing campaign of persecution and mass killings of practitioners. \"Falun Gong is a traditional, spiritual discipline whose adherents follow the principles of truthfulness, compassion and tolerance .\" I think it's human nature of the communist party they are afraid of people being empowered by anything other than their ideology, \"said Joy Wang of Penticton who is travelling with the group .\" I learned the truth about Falun Gong after I left China 15 years ago. Since I started practising my problems have disappeared and I've become much calmer. \"She has started a local class which meets weekly near the SS Sicamous and is becoming increasingly popular. A number of countries including the U.S. along with the European parliament have condemned the practice. In June, a report released by Canadian human rights lawyer David Matas, former Canadian secretary of state <mark>David Kilgour</mark> and investigative journalist <mark>Ethan Gutmann</mark> indicated up to 1.5 million Falun Gong practitioners have been killed since 2001 .\" We call on the federal government to warn Canadians not to go to China for a new organ since they may be unknowingly become complicit in this crime and we urge Prime Minister Justin Trudeau to raise these issues during his upcoming visit to China, \"said Sun. We encourage an open exchange of ideas on this story's topic, but we ask you to follow our guidelines for respecting community standards. Personal attacks, inappropriate language, and off-topic comments may be removed, and comment privileges revoked, per our Terms of Use. Please see our FAQ if you have questions or concerns about using Facebook to comment.", "articleID": "2016080518_00262775_W", "names": {"David Kilgour": ["Q5236003", "Q872073"], "Ethan Gutmann": ["Q18977963", "Q58040087"]}}, {"date": "2016-08-06", "url": "http://www.nydailynews.com/sports/football/roger-goodell-1st-10-years-marked-growth-controversy-article-1.2741061", "content": "Happy Anniversary Roger Goodell, just don't expect to be receiving chocolate covered strawberries from <mark>Tom Brady</mark>, DeMaurice Smith, <mark>James Harrison</mark>, Bill Belichick, Drew Brees, <mark>Richard Sherman</mark>, Sean Payton and...get in line. Monday marks the 10-year anniversary of Goodell being promoted from chief executive officer of the NFL in the Paul Tagliabue administration to the most powerful job in sports. The NFL is the only place Goodell has been employed since graduating college in the early \"80s and he worked his way up from his first job as an intern in the public relations department to the commissioner's office 24 years later. Roger Goodell (<mark>Al</mark> Messerschmidt/Al Messerschmidt/WireImage. com) The seven-year contract extension he signed in January of 2012 expires in March of 2019. He has not yet addressed if he will seek or be receptive to another extension--he is 57 years old--and there is no talk of any owners wanting to push him out. But if Goodell decides walk away in less than three years, there is little doubt the next commissioner will be a businessman who will focus on continuing to grow the league financially in the digital era and be less concerned than Goodell has been with the football part of the job. In 10 years, here's what we've learned about Goodell: - The owners love him because he has made some of the wealthiest people in the country even wealthier. The league now brings in about $13 billion a year in revenue. When Goodell officially took office on Sept. 1, 2006, the NFL was pulling in $6 billion a year. His goal is to reach $25 billion by 2027. All the extra loot has allowed Goodell to survive crucial mistakes: Not suspending Belichick in Spygate, Tagliabue reversing most of the severe player punishment Goodell handed out in Bountygate, the <mark>Ray Rice</mark> nightmare, the over-the-top discipline of <mark>Brady</mark>, and the concussion crisis, which he inherited but didn't act quickly enough by putting in measures to educate and protect players. - If the players were polled, they probably would not want to invite Goodell to their birthday party. But also look at it this way: If so many players weren't knuckleheads and always testing NFL rules and the legal system, Goodell would be far less controversial. He comes off as the bad guy, and often seems to embrace the role, but too many players take it for granted that their talent makes them immune to punishment. It's the union's fault for allowing Goodell to keep the role as appeals officer for his own disciplinary decisions. Smith caved in during the 2011 CBA negotiations. It's been the commissioner's job since the first CBA in 1968. - Goodell often talks about how much he cares about the fans and I think that's genuine. But the fans are not buying it and giving him back the love. His appearances at the draft have become embarrassing. In the last few years at Radio City and the two years in Chicago, he was heavily booed each time he walked on stage to announce a pick. Imagine what the reception is going to be like in Philadelphia next year--the likely site of the draft. It's not exactly a city known for its warmth. Goodell was elected commissioner at a special league meeting at a hotel in Northbrook, Ill.. It took Pete Rozelle 23 ballots to get elected in 1960 and Tagliabue 12 ballots in 1989. It took Goodell five ballots to get the two-thirds vote--22 out of 32--when he picked up 23 on the fifth try. The other finalist was NFL outside counsel Gregg Levy. On the first ballot it was Goodell 15, Levy 13 with three other finalists combining for three votes. Oakland's <mark>Al Davis</mark> abstained on every ballot until Tagliabue asked the owners to make it unanimous once Goodell had the required votes. QB WORRIES IN BIG D The best thing the Giants have going for them in the NFC East race is that <mark>Jerry Jones</mark> insists on being the general manager of the Cowboys when he should concentrate on doing what he does best--making money. He has a fragile starting quarterback and was trying to get by with the little lefty Kellen Moore as the backup? Now look at the mess the\" Boys are in. Tony Romo missed seven starts after breaking his left collarbone last year in Week 2 and Dallas was 0-7. He returned and broke it again in his second game back and missed the final five games. Dallas was 1-4. Romo was 3-1 in the Cowboys' 4-12 season. They were 1-11 without him. He is 36 years old and has broken his left collarbone three times in the last six seasons. The first time was against the Giants in 2010. Matt Cassel was 10-5 in games he started for the Patriots replacing <mark>Brady</mark> in 2008, was only 1-6 starting for the Cowboys. He is now with the Titans. A savvy general manager who also didn't own the team might have felt obligated to get veteran protection behind Romo to avoid the season being a waste if he goes down early again. Instead, <mark>Jones</mark> was trying to get by with Moore. He was 0-2 starting the last two games last season after coming in early in the second quarter of a loss to the Jets and tossing three interceptions. Moore broke his right fibula in practice last week and is out 3-4 months. <mark>Jones</mark> drafted Zak Prescott in the third round but now he's scrambling for a veteran backup. When the Rams released Nick Foles on July 27, <mark>Jones</mark> was adamant the Cowboys had no interest. They wanted Foles after Moore was injured, but he elected to sign with the Chiefs. The Cowboys' earlier comments could not have won them again points with Foles when he was deciding where to sign. Chiefs coach <mark>Andy Reid</mark> drafted Foles in Philadelphia in 2012 although he had his great season (27 TDs, 2 INTs) playing for Chip Kelly in 2013. Where does <mark>Jones</mark> go now to get a backup? Cleveland coach Hue Jackson says there's nothing to rumors about trading Josh McCown, who is 38 years old and losing the battle for the starting job to RG3. Michael Vick is a free agent. There's been speculation about Tampa making Mike Glennon available ever since they drafted Jameis Winston first overall last year. Don't forget Tim Tebow is still available. If Romo gets hurt this summer, the only QBs currently on the roster to start the season opener Sept. 11 against the Giants are Prescott and Jameill Showers. ON <mark>BRADY</mark> <mark>Brady</mark>, who turned 39 last week, is still pretty good. He was 25-for-25 in an intrasquad scrimmage on Friday. He said it was a \"personal decision\" to surrender in the Deflategate fight and accept the four-game suspension. <mark>Brady</mark> doesn't like giving up first-team snaps in practice, so having to watch Jimmy Garoppolo do his job for the first month of the season is going to be unbearable. \"I'll deal with it when it comes,\" he said. <mark>Brady</mark> never plays all that much in the preseason games, but it will be interesting to see if Belichick starts Garoppolo to get him accustomed to playing with the first unit right from the beginning of the game or whether he plays <mark>Brady</mark> one series with the starters. Belichick can't afford the injury risk of allowing <mark>Brady</mark> to play with the second string offensive line. The Patriots open the preseason Thursday night at home against the Saints after practicing against them Tuesday and Wednesday in Foxborough. When Belichick was asked Wednesday if he had anything special planned that day for <mark>Brady</mark>'s birthday, his answer displayed his warmth. \"Practicing,\" he said. BOILING <mark>BRANDON</mark> <mark>Brandon Marshall</mark> sure had an interesting week in training camp, punting a football over the bleachers in frustration and then getting into a fight with Darrelle Revis. Between them, Revis ($17 million) and <mark>Marshall</mark> ($9.5 million) are making $26.5 million and they're the Jets' two best players. So that was a foolish scuffle. It's a good thing the only thing they hurt was each other's feelings. DEBATE DEBACLE <mark>Donald Trump</mark> is concerned about two of his debates with Hillary Clinton going up against NFL prime time games. And he should be. The first debate is Monday, Sept. 26, which is Atlanta at New Orleans, 10 years and one day after the Saints' first game back in the Superdome following the devastation of Hurricane Katrina. It was highlighted by Steve Gleason's blocked punt recovered for a TD by the Saints. Gleason, who suffers from ALS, is the subject of a compelling documentary out in theaters now. The second debate is Sunday, Oct. 9, and it goes up against the Giants at Green Bay. The rating of the debates vs. the football games? Never bet against the power of the NFL...The top first-time eligible players for the Pro Football Hall of Fame in 2017 are LaDainian Tonlinson, who played his final two years with the Jets (2010-11), and <mark>Jason Taylor</mark>, who played one year with the Jets (2010) before returning to Miami for one final season. If they both get in to join Brett Favre, it will make three players with Jets connections in the HOF in a two-year span. Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2016080621_00026974_W", "names": {"Al Davis": ["Q1389376", "Q16151684"], "Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "Brandon Marshall": ["Q3643713", "Q898156"]}}]