[{"date": "2016-08-06", "url": "http://www.nydailynews.com/sports/football/roger-goodell-1st-10-years-marked-growth-controversy-article-1.2741061", "content": "Happy Anniversary Roger Goodell, just don't expect to be receiving chocolate covered strawberries from <mark>Tom Brady</mark>, DeMaurice Smith, <mark>James Harrison</mark>, Bill Belichick, Drew Brees, <mark>Richard Sherman</mark>, Sean Payton and...get in line. Monday marks the 10-year anniversary of Goodell being promoted from chief executive officer of the NFL in the Paul Tagliabue administration to the most powerful job in sports. The NFL is the only place Goodell has been employed since graduating college in the early \"80s and he worked his way up from his first job as an intern in the public relations department to the commissioner's office 24 years later. Roger Goodell (<mark>Al</mark> Messerschmidt/Al Messerschmidt/WireImage. com) The seven-year contract extension he signed in January of 2012 expires in March of 2019. He has not yet addressed if he will seek or be receptive to another extension--he is 57 years old--and there is no talk of any owners wanting to push him out. But if Goodell decides walk away in less than three years, there is little doubt the next commissioner will be a businessman who will focus on continuing to grow the league financially in the digital era and be less concerned than Goodell has been with the football part of the job. In 10 years, here's what we've learned about Goodell: - The owners love him because he has made some of the wealthiest people in the country even wealthier. The league now brings in about $13 billion a year in revenue. When Goodell officially took office on Sept. 1, 2006, the NFL was pulling in $6 billion a year. His goal is to reach $25 billion by 2027. All the extra loot has allowed Goodell to survive crucial mistakes: Not suspending Belichick in Spygate, Tagliabue reversing most of the severe player punishment Goodell handed out in Bountygate, the <mark>Ray Rice</mark> nightmare, the over-the-top discipline of <mark>Brady</mark>, and the concussion crisis, which he inherited but didn't act quickly enough by putting in measures to educate and protect players. - If the players were polled, they probably would not want to invite Goodell to their birthday party. But also look at it this way: If so many players weren't knuckleheads and always testing NFL rules and the legal system, Goodell would be far less controversial. He comes off as the bad guy, and often seems to embrace the role, but too many players take it for granted that their talent makes them immune to punishment. It's the union's fault for allowing Goodell to keep the role as appeals officer for his own disciplinary decisions. Smith caved in during the 2011 CBA negotiations. It's been the commissioner's job since the first CBA in 1968. - Goodell often talks about how much he cares about the fans and I think that's genuine. But the fans are not buying it and giving him back the love. His appearances at the draft have become embarrassing. In the last few years at Radio City and the two years in Chicago, he was heavily booed each time he walked on stage to announce a pick. Imagine what the reception is going to be like in Philadelphia next year--the likely site of the draft. It's not exactly a city known for its warmth. Goodell was elected commissioner at a special league meeting at a hotel in Northbrook, Ill.. It took Pete Rozelle 23 ballots to get elected in 1960 and Tagliabue 12 ballots in 1989. It took Goodell five ballots to get the two-thirds vote--22 out of 32--when he picked up 23 on the fifth try. The other finalist was NFL outside counsel Gregg Levy. On the first ballot it was Goodell 15, Levy 13 with three other finalists combining for three votes. Oakland's <mark>Al Davis</mark> abstained on every ballot until Tagliabue asked the owners to make it unanimous once Goodell had the required votes. QB WORRIES IN BIG D The best thing the Giants have going for them in the NFC East race is that <mark>Jerry Jones</mark> insists on being the general manager of the Cowboys when he should concentrate on doing what he does best--making money. He has a fragile starting quarterback and was trying to get by with the little lefty Kellen Moore as the backup? Now look at the mess the\" Boys are in. Tony Romo missed seven starts after breaking his left collarbone last year in Week 2 and Dallas was 0-7. He returned and broke it again in his second game back and missed the final five games. Dallas was 1-4. Romo was 3-1 in the Cowboys' 4-12 season. They were 1-11 without him. He is 36 years old and has broken his left collarbone three times in the last six seasons. The first time was against the Giants in 2010. Matt Cassel was 10-5 in games he started for the Patriots replacing <mark>Brady</mark> in 2008, was only 1-6 starting for the Cowboys. He is now with the Titans. A savvy general manager who also didn't own the team might have felt obligated to get veteran protection behind Romo to avoid the season being a waste if he goes down early again. Instead, <mark>Jones</mark> was trying to get by with Moore. He was 0-2 starting the last two games last season after coming in early in the second quarter of a loss to the Jets and tossing three interceptions. Moore broke his right fibula in practice last week and is out 3-4 months. <mark>Jones</mark> drafted Zak Prescott in the third round but now he's scrambling for a veteran backup. When the Rams released Nick Foles on July 27, <mark>Jones</mark> was adamant the Cowboys had no interest. They wanted Foles after Moore was injured, but he elected to sign with the Chiefs. The Cowboys' earlier comments could not have won them again points with Foles when he was deciding where to sign. Chiefs coach <mark>Andy Reid</mark> drafted Foles in Philadelphia in 2012 although he had his great season (27 TDs, 2 INTs) playing for Chip Kelly in 2013. Where does <mark>Jones</mark> go now to get a backup? Cleveland coach Hue Jackson says there's nothing to rumors about trading Josh McCown, who is 38 years old and losing the battle for the starting job to RG3. Michael Vick is a free agent. There's been speculation about Tampa making Mike Glennon available ever since they drafted Jameis Winston first overall last year. Don't forget Tim Tebow is still available. If Romo gets hurt this summer, the only QBs currently on the roster to start the season opener Sept. 11 against the Giants are Prescott and Jameill Showers. ON <mark>BRADY</mark> <mark>Brady</mark>, who turned 39 last week, is still pretty good. He was 25-for-25 in an intrasquad scrimmage on Friday. He said it was a \"personal decision\" to surrender in the Deflategate fight and accept the four-game suspension. <mark>Brady</mark> doesn't like giving up first-team snaps in practice, so having to watch Jimmy Garoppolo do his job for the first month of the season is going to be unbearable. \"I'll deal with it when it comes,\" he said. <mark>Brady</mark> never plays all that much in the preseason games, but it will be interesting to see if Belichick starts Garoppolo to get him accustomed to playing with the first unit right from the beginning of the game or whether he plays <mark>Brady</mark> one series with the starters. Belichick can't afford the injury risk of allowing <mark>Brady</mark> to play with the second string offensive line. The Patriots open the preseason Thursday night at home against the Saints after practicing against them Tuesday and Wednesday in Foxborough. When Belichick was asked Wednesday if he had anything special planned that day for <mark>Brady</mark>'s birthday, his answer displayed his warmth. \"Practicing,\" he said. BOILING <mark>BRANDON</mark> <mark>Brandon Marshall</mark> sure had an interesting week in training camp, punting a football over the bleachers in frustration and then getting into a fight with Darrelle Revis. Between them, Revis ($17 million) and <mark>Marshall</mark> ($9.5 million) are making $26.5 million and they're the Jets' two best players. So that was a foolish scuffle. It's a good thing the only thing they hurt was each other's feelings. DEBATE DEBACLE <mark>Donald Trump</mark> is concerned about two of his debates with Hillary Clinton going up against NFL prime time games. And he should be. The first debate is Monday, Sept. 26, which is Atlanta at New Orleans, 10 years and one day after the Saints' first game back in the Superdome following the devastation of Hurricane Katrina. It was highlighted by Steve Gleason's blocked punt recovered for a TD by the Saints. Gleason, who suffers from ALS, is the subject of a compelling documentary out in theaters now. The second debate is Sunday, Oct. 9, and it goes up against the Giants at Green Bay. The rating of the debates vs. the football games? Never bet against the power of the NFL...The top first-time eligible players for the Pro Football Hall of Fame in 2017 are LaDainian Tonlinson, who played his final two years with the Jets (2010-11), and <mark>Jason Taylor</mark>, who played one year with the Jets (2010) before returning to Miami for one final season. If they both get in to join Brett Favre, it will make three players with Jets connections in the HOF in a two-year span. Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2016080621_00026974_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "James Harrison": ["Q1379040", "Q2086893", "Q28421741", "Q37379040", "Q57911076", "Q6135633"], "Jason Taylor": ["Q16213806", "Q1684006", "Q24738395", "Q2786087", "Q6163606", "Q6163608"], "Jerry Jones": ["Q1280022", "Q16643824", "Q25190360"], "Ray Rice": ["Q1523516", "Q23823439"], "Richard Sherman": ["Q16205086", "Q2947411"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}}, {"date": "2016-08-08", "url": "http://www.environmentalleader.com/2016/08/08/workplace-safety-laws-take-centerstage-in-presidential-race/", "content": "Feature Workplace safety rules in the coal mining sector are coming up for air and are taking centerstage in the presidential race. The issue comes on the heels of the conviction and the imprisonment of a former coal mining boss accused of violating those laws. And it comes in the midst of major coal mining job losses, which is the culmination of a fierce competition for cleaner fuels, tougher federal regulations and thinning coal seams. At the epicenter of the discussion is the federal prosecution of Don Blankenship, who had been the chief executive of Massey Energy and who was sentenced in April to a year in prison--all tied to an underground mine explosion that killed 29 people in April 2010. Former Secretary of State Hillary is weighing in, saying that the penalty does not fit the crime and that she would work with Congress to update workplace safety laws that would enhance compliance. \"After 29 miners died at the Upper Big Branch Mine, our worst mining disaster in 40 years, prosecutors charged and convicted (Blankenship) for conspiracy to violate the Mine Safety and Health Act,\" Clinton writes, in her. \"Blankenship received only one year in jail, however, because violations of the (act) are only misdemeanor charges .\" position paperThe overarching premise of Clinton's view is that while environmental and workplace safety violations can happen in any town across America, they are more likely to occur in the poorest areas least able to defend themselves. The concerns are especially acute in southern West Virginia, which has been heavily dependent on coal and the wealth that it has created. Now, though, the region is ravaged with, leaving citizens there desperate for any economic opportunity. poverty and drugsWithout question, everyone abhors the deaths of 29 in an underground explosion. But Blankenship and his defense team have maintained that the tragedy was an accident caused by natural circumstances, not by a willful attempt to sidestep safety laws. Just the opposite, they add: he had written several memos stressing the need for better compliance. The Republican nominee <mark>Donald Trump</mark> has said that the coal industry is suffering because of the undue burdens put upon it by by federal regulations that unfairly clamp down on carbon releases, among other emissions regulated under the Clean Air Act of 1990. His advocates have said that those rules single out coal because the only technology that would make coal acceptable under those conditions is carbon capture and burial--and it is not yet commercialized or cost effective. \"I have friends that own the mines. I mean, they can't live, they can't eat,\" said <mark>Trump</mark>, as reported by E & E. \"The restrictions, environmentally, are so unbelievable, where inspectors come two and three times a day, and they can't afford it any longer...We make these environmental deals where we have to adhere here immediately and China doesn't kick in for 25 years. Great. Great negotiating, fellas .\" But the mine workers, which are certainly on the side of the coal companies when it comes to environmental laws, say that <mark>Trump</mark> is conflating the federal environmental rules cover carbon with the work place safety laws that protect miners from serious accidents. The two are mutually exclusive, they say. Whose side is Mr. <mark>Trump</mark> on? \"The notion of reducing mine inspections because coal operators are going hungry is preposterous,\" said <mark>Phil Smith</mark>, spokesman for the United Mine Workers of America, in a story by SNL Energy. \"It demonstrates a complete lack of understanding of the difference decades of progress in mine health and safety has made for miners. The most precious thing to come out of a coal mine every day isn't the coal, it's the coal miner. Reducing safety inspections puts miners at greater risk, plain and simple .\" In an earlier talk with this writer, <mark>Murray</mark> Energy Chief Executive <mark>Robert Murray</mark> said he remains especially critical of the Obama administration, which he says is responsible for the bankruptcies of dozens of coal companies and thousands of coal mining job losses. He refers to global warming as \"global goofiness .\" He has also labeled the prosecution of Don Blankenship as \"political,\" saying that if authorities spend enough time and money pursuing any business leader, they could find something. \"No question: The Blankenship case has hurt the coal industry,\" he says. \"But this case does not represent the coal industry or how it does business .\" The families of the fallen miners don't think the prosecution of the former coal mining boss was political. They say it has been necessary, although they are generally displeased with the ultimate misdemeanor verdict and the one-year prison sentence. They told this reporter after the Blankenship sentencing in April of this year that Congress needs to stiffen the penalties for workplace safety crimes; Blankenship reported a month later, in May. But measures to achieve such standards have long languished on Capitol Hill. For their part, business leaders don't want to wind up in jail for workplace safety violations that they had either tried to address or could not have foreseen. Workers, though, want reasonable assurances that corporate leaders have taken all steps to ensure that they are able to return safely to their families. On this one, Mrs. Clinton would be appear to be the conspicuous choice among mine workers, favoring revised work place laws and criticizing Mr. Blankenship's treatment of workers. But odds are she won't get their votes, as the men and women in the coal communities have related to Mr. <mark>Trump</mark> and have vowed their support to him. As to whether he would buck business and push for more aggressive work place safety laws, though, remains unknown.", "articleID": "2016080814_00169028_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Phil Smith": ["Q16018910", "Q21598350", "Q7182421"], "Robert Murray": ["Q16149751", "Q16193097", "Q43910843", "Q7347885", "Q7347887", "Q7347888", "Q7347889", "Q7350719"]}}]