[{"articleID": "2015120212_00025883_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"]}, "date": "2015-12-02", "url": "http://parentherald.com/articles/13504/20151202/tom-cruise-katie-holmes-divorce-actress-reveals-she-has-no-regrets-talks-about-inspiration-your-children-are-what-drives-you.htm", "content": "Tom Cruise, <mark>Katie Holmes</mark> Divorce: Actress Reveals She Has No Regrets, Talks About Inspiration \"Your Children Are What Drives You' By Staff Reporter / Dec 02, 2015 07:00 AM EST Tags: <mark>Katie Holmes</mark>, Tom Cruise, divorce, Suri Cruise (Photo: Credit: Theo Wargo / Staff / Getty Images) Three years after her divorce with actor Tom Cruise, <mark>Katie Holmes</mark> said in an interview that she does not regret anything about her past. The former\" Dawson's Creek \"stunner, who lived a life as a Scientologist after marrying the star from\" Mission Impossible, \"had since moved on and is currently enjoying her time with daughter Suri Cruise .?\" I don't really regret anything that I've done, \"<mark>Holmes</mark>, who will turn 37 next month, confessed in a recent interview with Ocean Drive .\" I've learned from everything, and everything sort of leads you to the next place. I just keep going, \"she added. The actress said that she wouldn't be where she is now had she not learned from her past. <mark>Holmes</mark> will also be the magazine's cover girl this December. The\" Batman Begins \"star was in a high profile marriage with Cruise. However, according to a report relayed by US Weekly, <mark>Holmes</mark> said that her life these days is nothing but normal and added that she walks around New York with a cracked iPhone .\" I have a very normal life, and I happen to work in an industry that is abnormal, \"<mark>Holmes</mark> said .\" Daily life, I take a train and cab; it's just about getting from here to there, and I don't care how I do it. I have to get there. \"The New Yorker has been spotted applying makeup together with her daughter, a report by AOL stated. <mark>Holmes</mark> said that her daughter with Cruise has been her motivation to work hard. Suri, who remains in <mark>Holmes</mark>' custody after the marriage, has been her driving force .\" Being a parent also is a source of inspiration to just work really hard. You want to set an example-and, you know, [your kids] are what drives you. \"Living a down-to-earth life with Suri somewhat gives her a new outlook in life .\" If you're having a bad day, you just take a walk, and it's not only that you see people who are having a worse day than you, it's just that you're in life, \"<mark>Holmes</mark> told Ocean Drive .\" You suddenly can't be stuck in whatever problem you're in because you have to hail a cab or you have to get a subway ticket, \"she continued .\" There's more than just you. And I think the harsh winters give you a little bit of character. \"<mark>Holmes</mark> divorced Cruise in August 2012 after being married for five years. & copy; 2015 ParentHerald.com All rights reserved. Do not reproduce without permission. Sign UpParent Herald Newsletter Get the ultimate dish on the latest Parenting news, plus exclusive recipes, decorating ideas, videos and more - for free! Most Popular"}, {"articleID": "2016042823_00313369_W", "names": {"James Mccarthy": ["Q529013", "Q55643105", "Q6139191", "Q6139195"], "Derek Mcgrath": ["Q16215929", "Q3023744", "Q5262185", "Q5262186"], "Paul Murphy": ["Q15972994", "Q16186391", "Q16228602", "Q16919574", "Q18098677", "Q2061382", "Q333828", "Q616919", "Q7152657", "Q7152658"], "Michael Rice": ["Q22710618", "Q57440368", "Q6833833"], "Brian Kennedy": ["Q17385682", "Q17386167", "Q28924901", "Q30122228", "Q4964327", "Q4964330", "Q4964335", "Q685603"]}, "date": "2016-04-29", "url": "http://irishexaminer.com/sport/gaa/hurling/kilkenny-must-consider-sweeper-admits-tj-reid-395702.html", "content": "Kilkenny must consider sweeper, admits TJ Reid Friday, April 29, 2016 It's not even three months since Brian Cody vowed \"never' but TJ Reid has suggested it may be time now for Kilkenny to bow to pragmatism and consider deploying a sweeper. Ambassadors TJ Reid and <mark>James McCarthy</mark> with the Cúl Heroes mascots. Picture: Sam Barnes Cody, Kilkenny's 11-time All-Ireland winning manager, has traditionally set his team up in orthodox fashion and as recently as February stated that,\" personally, whatever team I'd be involved with, with the club or Kilkenny, I could never see myself employing an actual sweeper'. However, the use of a sweeper has been a key part of Waterford's resurgence at the top level and they will challenge this weekend for back to back Allianz League titles. Waterford manager <mark>Derek McGrath</mark> suggested this week that a number of other counties have gone down the same avenue of playing at least seven outfield defenders. READ NEXT Davy Fitzgerald warns Sunday's Division 1 final may not be a day for the purists As for MacCarthy Cup holders Kilkenny, their defence was cut asunder by Clare who, playing with a sweeper, struck four goals in the semi-final of the league, prompting Hurler of the Year Reid to nod when asked if his team may have to compromise on their principles and do likewise. \"We'll have to definitely look at it, yeah,\" said Reid. \"We've never had a sweeper and even against a strong breeze we've never had a seventh defender. But yeah, I definitely think it's something we'll have to implement in training, just to get our heads around it, just to try and have a game plan, to make sure we're not hit for that seventh defender and we're not looking around asking questions. Sunday's league decider between Waterford and Clare is expected to be one of the most tactical finals yet and Reid described it as a fascinating prospect .\" The middle third is going to be very congested because they tend to bring out everyone to try and crowd that middle third, \"he said of Clare .\" I think whoever's tactics work on the day will win. Waterford are going well as well but going on the performance against us, I probably would be going slightly with Clare. \"Reid admitted that Kilkenny didn't do as much preparation work on Clare before the league semi-final as they would normally do for a championship game. But he denied that the Cats weren't overly bothered to lose the tie or that they were content to sign off on the league campaign .\" They were driven and persistent all over the field, \"said Reid .\" They got a lead on us, we got to grips in the second-half, but they just tipped on. I think in the 53rd minute they got a goal to move them on again. We just couldn't get close to them, they kept tipping away with points and scores. \"On the day they beat us, fair and square, we have no question marks over it. On the day, we weren't good enough but we were missing five starting figures; <mark>Paul Murphy</mark>, Mick Fennelly, Conor Fogarty, Colin Fennelly and Eoin Larkin. Five big players to be missing against a good Clare team. If we had those players, it could have been a different scoreline .\" I think on the day we were still at league pace, Clare were at championship pace. All over the field they seemed to be winning breaking ball and were a lot hungrier on the day. Their intensity was a lot higher too. \"Maybe they've more work done than us. That is the way it seemed to me. We seemed to be at league pace. We haven't really found that gear yet. Hopefully we are saving it for the championship .\" Kilkenny are set to be without former All Star midfielder <mark>Michael Rice</mark> and defender <mark>Brian Kennedy</mark> who have been released from Cody's panel. \"<mark>Michael</mark> was a top class hurler, sad to see him go,\" said Reid. \"He wanted to come back this year and settle a few scores but just injuries have really plagued him. If we had <mark>Michael</mark> flying this year in midfield, half-forward, he'd be a great addition to us but just couldn't get back right from that cruciate knee ligament injury that he had last year. Sad to see him go .\" Here's a little extra sport. Watch the latest BallTalk for the best sports chat and analysis: An alternative Premier League team of the season"}, {"articleID": "2018092115_00057715_W", "names": {"Karen Middleton": ["Q6369885", "Q6369887", "Q6369888"], "Margaret Stone": ["Q6759926", "Q6759927"], "Julia Gillard": ["Q41563", "Q59400153"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-09-21", "url": "http://thesaturdaypaper.com.au/news/law-crime/2018/09/22/new-domestic-intelligence-powers/15375384006887", "content": "Edition No. 223 September 22--28, 2018 News A new Office of National Intelligence will have increased powers to access personal information and scrutinise online activities. But who will monitor the monitor? By <mark>Karen Middleton</mark>. New domestic intelligence powers Australia's intelligence community is set to increase its monitoring of Australian citizens and bypass privacy laws blocking access to personal information, with its focus also expanding to domestic political activity for the first time since the 1970s. As part of the overhaul of national security architecture, prompted by last year's independent intelligence review, the new Office of National Intelligence (ONI) within the prime minister's department becomes the senior agency and central coordinating body for Australia's intelligence agencies, now expanding from six to 10. In replacing the Office of National Assessments, ONI's remit will be extended from collecting only international open-source information and preparing assessments on how overseas developments affect Australia, to collecting domestic information, too, scanning social media and other online material for local activity that could threaten national security. They will be partially exempted from the Privacy Act to enable disclosure of personal information to ONI. ONI will also have access to personal information that other government agencies have collected for other purposes and may be able to access private social media accounts. Legislation to establish the new office confirms four more organisations will be designated as intelligence agencies--the departments of Home Affairs and Defence, the Australian Federal Police and the Australian Transaction Reports and Analysis Centre (AUSTRAC), which tracks suspect financial transactions. They will be partially exempted from the Privacy Act to enable disclosure of personal information to ONI. Other departments and agencies right across government will be enabled to effectively sidestep privacy laws and provide Australians' personal information to ONI voluntarily, apparently without a warrant being required. The watchdog parliamentary joint committee on intelligence and security is currently examining the ONI legislation. Security experts have told The Saturday Paper that rapidly changing technology and terrorist methods mean greater sharing of information between government agencies is both essential and inevitable. But they say there must be adequate protections and stronger oversight built in to prevent the system being abused. The ONI legislation also broadens the definition of public information, allowing ONI to collect some online data that Australians might generally assume to be private. It describes this as \"information relating to matters of political, strategic or economic significance to Australia that is accessible to any section of the public\". It appears the phrasing may allow it to include accounts on social media sites such as Facebook, even if they are set to private. In a submission to the committee, the inspector-general of intelligence and security (IGIS), <mark>Margaret Stone</mark>, has confirmed this could include \"activities in closed forums where membership must be approved by an administrator and/or requires payment of a fee, or where membership is limited to those with specialist skills, knowledge or access to technology\". \"Assessing whether information is accessible to\" any section of the public' is more difficult than it may seem, \"<mark>Stone</mark> noted, saying she would scrutinise ONI's collection activities. The Department of the Prime Minister and Cabinet and the current Office of National Assessments have taken the unusual step of also making a submission to the parliamentary committee, known as the PJCIS. Attached to it is a privacy assessment from the Australian Government Solicitor that says the bill's wording will create what is described legally as\" a relevant exception \"to the law that usually prevents individual personal information being used or disclosed for a secondary purpose without consent .\" One such exception is where the use or disclosure of the information is \"required or authorised by or under an Australian law',\" it says. It says the ONI bill \"will enable Commonwealth authorities to voluntarily disclose personal information obtained for the purposes of their own functions to the ONI on the basis the disclosure will be\" required or authorised by law'. \"To obtain the information, the ONI director-general, Nick Warner--former head of the Australian Secret Intelligence Service--will have to first consult the agency and then make the request in writing. While the Australian Government Solicitor assessment acknowledges ONI's scope to collect information will widen, it says what it can do with it will be more restricted and there will be\" a stronger and more transparent regime for the handling and protection of personal information than currently exists for ONA \". The prime minister will be required to draft new privacy rules governing its handling and use. The inspector-general of intelligence and security said the rules should be made public, as for those applying to other agencies. A spokesman for the Department of the Prime Minister and Cabinet told The Saturday Paper they would be, except for any parts that could identify a classified capability. In the only other submission to the inquiry, the Law Council of Australia said the privacy commissioner should be consulted. The council says the ONI legislation should include privacy protection measures, such as requiring privacy impact assessments and yearly compliance audits, appropriate training and public reporting on the number of instances in which information is disclosed or used inconsistent with the privacy rules. The PM & C and ONA submission confirms the new ONI's role will reach beyond foreign intelligence assessments to also\" prepare strategic-level intelligence assessments on other matters of political, strategic or economic significance to Australia \". Combined with new laws on foreign interference, espionage and foreign influence, the arrangements also herald a new scrutiny of domestic political activity. The joint submission seeks to allay fears about ONI's role .\" In performing this function, ONI may have access to a greater amount of personal information [relating] to Australians, however, ONI's assessment focus will remain at the strategic, rather than the individual, level. \"The change reintroduces a focus on subversion absent from the remit of disrupting agencies such as the Australian Security Intelligence Organisation since the first Hope royal commission condemned its heavy-handedness in 1974. To date, the guidelines governing ASIO's work have limited its reach and effectively entrenched the right to peaceful protest and other lawful political activity in Australia. Those guidelines are being reviewed. ASIO remains a statutory authority but has moved from the Attorney-General's Department to Home Affairs. The head of the Strategic and Defence Studies Centre at the Australian National University, Professor John Blaxland, says the powers of the inspector-general of intelligence and security and the PJCIS need boosting to guarantee accountability in the new regime .\" Power can corrupt, and to avoid the people who are operating in a very secretive space from abusing that power, the checks on that power need to be robust, \"he said. Blaxland, who co-wrote the official history of ASIO, says the provisions of the Intelligence Services Act requiring warrants for actions against Australian citizens should be explicitly added to the ONI legislation but that the warrant system should also be updated. He says the inspector-general's expanded remit to cover the actions of all 10 agencies must also be explicit, to ensure her office is properly funded and resourced. Blaxland says that with the boundaries of illegal activity blurring, powers to let federal and state agencies interact and share information must also be spelt out. He echoed the argument that prompted the system overhaul--that without more cooperation, agencies can't keep ahead of national security threats .\" It's in that space between finding out something's wrong and getting the warrant and acting on the warrant that things can go pear-shaped, \"Blaxland says .\" That's what's leading intelligence practitioners to say this isn't fast enough. \"Centre Alliance senator Rex Patrick has drafted a private member's bill aimed at expanding the PJCIS's role beyond just scrutinising legislation and the intelligence agencies' administration and spending to include their operations--something now only open to the IGIS, who has the powers of an enduring royal commission. He says parliament should be wary of agencies' reach extending into ordinary Australians' political and private lives. Patrick says both the IGIS and PJCIS should be strengthened, pointing to Australia's international security partners--especially Canada--where legislatures play stronger watchdog roles .\" If the intelligence community won't trust elected members of parliament to examine their operations, at home and abroad, how can the parliament and public be fully confident that these very powerful agencies won't one day be turned to partisan advantage by the government of the day in what could amount to a high-tech police state? \"Former ONA analyst and now independent MP Andrew Wilkie is similarly concerned .\" I have a natural suspicion of anything in Australia that extends the power of the security services--the power of the state--because I believe Australia has already reached what I call a pre-police state, \"he says. But Wilkie takes\" zero comfort \"from calls to beef up the PJCIS, saying it has too few critical voices and tends to be\" hawkish \". Other security sources say the IGIS's power is appropriately greater. Wilkie is the only non-major-party MP to have served on the committee, after the Greens insisted then prime minister <mark>Julia Gillard</mark> appoint him as part of their minority government agreement. He is no longer a member and the committee again consists only of Liberal and Labor members, with governments believing minor parties and independents would undermine bipartisanship. Another former analyst, Clinton Fernandes, now professor of International and Political Studies at the University of New South Wales, says the various new laws may mean agencies more closely monitor the activities of environmental and other protest organisations. But he says ONI's central role as the new\" tsar \"of Australian intelligence is appropriate and suggests Wilkie is being\" a bit alarmist \".\" I would avoid the words \"police state',\" Fernandes says. \"The term he's looking for is\" surveillance state', or \"intelligence state'...The effect of this is to give ONI the ability to reach down and get any information they want .\" He says renewed monitoring for subversion made parliamentary oversight even more important. The PM & C spokesman said the government was still considering further oversight measures recommended in last year's review. The government is also introducing other security legislation that would sidestep privacy restrictions, to permit telecommunications and technology companies to hand over so-called backdoor access keys to their customers' encrypted information. The Assistance and Access Bill would allow the companies to enable access to encrypted sites, devices and applications voluntarily. It would also enable security agencies to force them to create and provide access if they refused, under threat of jail. And it gives ASIO the power to seek a warrant to demand passwords, PIN codes or fingerprints to unlock personal smartphones, either from the phone's user or from an associate with the information, with refusal punishable by up to five years' jail. After what the digital civil liberties group Digital Rights Watch calls \"a ridiculously short\" public consultation period in which 15,000 submissions were nevertheless lodged, the Coalition's party room approved the bill this week. The Greens are among those raising privacy concerns, warning it also creates a greater risk of hacking and will allow the information to be shared with Australia's \"Five Eyes\" partners--the US, Britain, Canada and New Zealand. \"It is akin to opening your mail, and allowing <mark>Donald Trump</mark> to read it over your shoulder,\" says Greens senator Jordon Steele-John. While the government dismisses the concerns, it's a prospect that might make even more people sit up and take notice. This article was first published in the print edition of The Saturday Paper on Sep 22, 2018 as \"Information overlord\". Subscribe here."}, {"articleID": "2012021321_00016852_W", "names": {"John Cleland": ["Q3181241", "Q43914371", "Q44931654"]}, "date": "2012-02-13", "url": "http://npr.org/blogs/thetwo-way/2012/02/13/146821597/judge-rules-jerry-sandusky-can-receive-visits-from-most-grandchildren?ft=1&f=1001", "content": "jerry sandusky, a former penn state assistant football coach charged with sexually abusing boys, pauses while speaking to the media at the centre county courthouse. jerry sandusky, a former penn state assistant football coach charged with sexually abusing boys, pauses while speaking to the media at the centre county courthouse. a pennsylvania judge eased some restrictions on jerry sandusky's house arrest today. judge <mark>john cleland</mark> said today that sandusky will be allowed visits by most of his 11 grandchildren, as well as be allowed to walk out onto his porch and in some cases leave his house to assist in his defense. cnn reports that the judge said sandusky can visit with eight of his grandchildren. he deferred a decision on three of them to another judge, because their mother \"has strongly objected to them having contact with sandusky .\" cnn adds: \"state attorney general linda kelly had blasted sandusky's request to see his grandchildren, saying in a motion earlier this month that sandusky was fortunate to be granted house arrest when\" he is alleged to have committed 52 sexual offenses .' \"kelly also argued that sandusky should be required to stay indoors during his house arrest because of fears among neighbors and teachers at a nearby elementary school .\" <mark>cleland</mark> denied that request monday, ruling that prosecutors did not present any evidence showing that sandusky had tried to contact children at the school. \"the patriot news reports that sandusky was relived by the judge's decision. sandusky will be allowed out of the house to assist a private investigator working on his defense. this is npr's news blog. it's a place to come for breaking news, analysis and for stories that are just too interesting - or too entertaining - to pass up. it's also a place for conversation about the news; we're counting on you to keep us honest. but please read the"}, {"articleID": "2011092211_00056178_W", "names": {"Kevin Bailey": ["Q25711398", "Q6395768", "Q6395769"]}, "date": "2011-09-21", "url": "http://greenun24.co.uk/cresswell_too_old_for_england_by_16_days_1_1029345", "content": "cresswell too old for england - by 16 days wednesday, september 21, 2011 2:14 pm to send a link to this page to a friend, simply enter their email address below. the message will include the name and email address you gave us when you signed up. to send a link to this page to a friend, you must be logged in. but the left-back's starring role in the blues' 3-0 win over coventry city will not be enough to earn him an england under-21 call-up. the england u-21 boss was among the crowd at portman road - but unfortunately cresswell is too old to play for the age group by an agonising 16 days. we can reveal that an impressed pearce enquired about cresswell during half-time on monday night after the young defender's starring role in town's best performance of the season. but a spokesman for the fa yesterday confirmed the full-back was too old to be eligible for pearce's squad. \"to be able to play for the under-21s during the 2011 to 2013 season, which ends with the european championships, you have to be born no earlier than january 1, 1990,\" the spokesman explained. but cresswell's performance, which saw him set up the blues' opener and clear off the line an amazing three times, has certainly put him on the radar of both the england set-up and the whole country. and the 21-year-old revealed that the origins of the vital victory came directly from the training ground. he said: \"all week, we have done 11 v 11 in training working on me and carlos getting forward, and covering round when one goes forward and vice versa. that helped us massively against coventry .\" i felt the formation did well for us. it allowed me and carlos a lot more freedom to get forward and we got balls in the box and scored from them. \"and cresswell had special praise for grant leadbitter after the skipper's inspirational performance which came after some calls for him to be rested. might be better scouting recruits for the over 31 team at portman rod nowadays. rob steroo wednesday, september 21, 2011 is anyone seriously interested in a great britain olympic football team? its the euro championships next year, surely that's enough. we need our players resting in the summer, not playing in a meaningless matches. jungle boy wednesday, september 21, 2011 the season lost or made after 10 games <mark>kevin</mark>. are you joking? redhotitfc wednesday, september 21, 2011 redhotitfc wednesday, september 21, 2011 i agree, leadbitter was dreadful against peterborough, the worst performance i can ever recall by an ipswich captain. really good to see him playing well against coventry. a good 4 games, and we will be in the mix, a poor 4 games and another season lost. so let's all hope for the former! <mark>kevin bailey</mark> wednesday, september 21, 2011 audio optional - mp3 files only not a member yet? register to create your own unique green un account for free."}, {"articleID": "2011032215_00092299_W", "names": {"David Backes": ["Q1173622", "Q5231027"], "Andy Mcdonald": ["Q23011622", "Q4761018", "Q526689"], "Ray Whitney": ["Q1342855", "Q7298285"]}, "date": "2011-03-22", "url": "http://thegame730am.com/news.asp?c=803361&url=http%3A%2F%2Fwww%2Esportsnetwork%2Ecom%2Fmerge%2Ftsnform%2Easpx%3Fc%3Dcitadel%26page%3Dnhl%2Fnews%2Fnewstest%2Easpx%3Fid%3D4391237", "content": "(sports network) - playing seven of their final nine games at home should work in the coyotes' favor, but what head coach dave tippett feels was a questionable call prevented them from starting that span with a victory. after having a five-game winning streak halted over the weekend, phoenix will look to rebound tonight versus the fading st. louis blues at jobing.com arena. the coyotes opened a six-game homestand on sunday against the defending stanley cup-champion blackhawks, but ended up on the wrong end of a 2-1 decision after chicago's chris campoli scored a power-play goal in the third period. the game-winner came with shane doan in the box for holding midway through the frame. tippett didn't like the call in such a meaningful game for both teams. \"i've watched it about 20 times,\" tippett said. \"just finished watching it just as i walked in the door here. i don't understand it. i don't understand it at all. to me there's no hold whatsoever there. it's disappointing that a call can have an impact like that in a very competitive game in a very tight playoff race .\" eric belanger scored and ilya bryzgalov ended with 26 saves for the coyotes, who had been 6-0-1 in their previous seven games and sit fourth overall in the western conference, just one ahead of the kings. phoenix also trails san jose by three points for first place in the pacific division and though it has played one more game than the sharks, the two clubs will meet three more times this season. that includes a visit from the sharks on saturday as part of this homestand. first, the coyotes will deal with a blues club that has lost three of its last four and sits 13th in the west with 73 points. st. louis is 12 back of a playoff spot with 10 games to play, but would also have to leap past five clubs to get into the eighth spot. st. louis fell behind early to san jose on saturday and never recovered in a 5-3 loss. jaroslav halak was pulled after yielding three goals on 10 shots to open the game, while ty conklin made 22 saves in relief. \"they've found their game. they've got really good balance through their lineup,\" blues head coach davis payne said of the sharks. t.j. hensick scored his first goal since nov. 8 of last season, while <mark>david backes</mark> and <mark>andy mcdonald</mark> also scored. the blues fell to 1-2 on a four-game road trip, but could have center philip mcrae back on the ice for the swing's finale. mcrae has been out since feb. 25 because of a lower-body injury. the coyotes have won two of three versus the blues this year, including a 5-3 victory when the clubs last met in phoenix way back on nov. 13. <mark>ray whitney</mark> netted a hat trick and had five points in the 5-3 triumph."}, {"articleID": "2019031323_00265893_W", "names": {"Mark Watson": ["Q16244723", "Q612493", "Q6770249", "Q6770250", "Q6770253", "Q6770254", "Q6770257"]}, "date": "2019-03-13", "url": "https://www.fifetoday.co.uk/news/driver-jailed-for-mowing-down-rival-outside-fife-pub-1-4888525", "content": "Driver jailed for mowing down rival outside Fife pub Ian Walle drove at speed into <mark>Mark Watson</mark> outside the pub. Picture: Google Published: 11:51 Wednesday 13 March 2019 Share this article Sign Up To Our Daily Newsletter Sign up A driver, who accelerated his car at high speed hitting a man on the road outside a Fife pub, has been jailed. Ian Walle (36) took revenge after becoming involved in a dispute in the bar earlier that night. The victim was sent flying over the bonnet, hitting the windscreen and falling on to the road. Walle, of Groban, Leven, appeared for sentencing at Dunfermline Sheriff Court. He previously admitted that on May 13 last year at Methil Brae, Methil, he assaulted <mark>Mark Watson</mark> by driving a car at him whereby he was struck, went on to the bonnet and fell to the ground, all to his injury and to the danger of his life. The incident occurred outside the Kirkland Bar where both men had been earlier. The court heard there was a dispute between Walle and Mr <mark>Watson</mark>'s son over a debt. Depute fiscal Sarah Lumsden previously told the court that Mr <mark>Watson</mark> had been in the pub with friends on the night of the incident. Another customer was outside having a cigarette and saw Walle, who had been in the bar earlier, in a grey BMW parked across the road. Walle then asked this man to go into the bar and pass on a message to Mr <mark>Watson</mark> for him to go outside. \"The accused then accelerated away with his tyres screeching,\" said the depute. He drove along the road then stopped and turned so that he was facing towards the bar. He then \"drove at high speed with no effort to slow down\" towards Mr <mark>Watson</mark> who was standing on the road outside the bar by this time. \"Mr <mark>Watson</mark> was thrown on to the bonnet and rolled off on to the road. The car had a cracked windscreen and the accused drove off,\" added Ms Lumsden. Video: Kirkcaldy residents told of £ 500,000 windfall on film The police were called and Mr <mark>Watson</mark> was on his feet outside the bar when the officers arrived. Officers later saw the BMW on fire in another part of Methil. The fire service had been called to the scene. The victim sustained a grazed shoulder and a bump to the head. He was treated by paramedics but did not have to attend hospital. The court was previously told by defence solicitor Gordon Martin that his client's position was that he had been assaulted in the pub toilet by Mr <mark>Watson</mark>. His solicitor at sentencing Emma Farmer said Walle had run up drugs debts because of a cocaine habit. Sheriff Charles MacNair told Walle: \"The use of a motor car as a weapon is extremely serious. It is only by the greatest of good fortune that the injuries were relatively minor and you also have a record of violence .\" The sheriff jailed Walle for nine months. He also banned him from driving for 28-and-a-half months. Get in touch and tell us your story Two in hospital after police car in three-car crash Gallery: Do you remember Fife in the 90s? In Pictures: Your World Book Day kids Care home worker struck off for \"rough treatment' of elderly resident £ 100,000 of drugs seized in Kirkcaldy raid The Essentials"}, {"articleID": "2018042714_00285576_W", "names": {"Joe Cooper": ["Q16236053", "Q17484134", "Q17484135", "Q592854"], "Graham Norton": ["Q19154", "Q5593104"]}, "date": "2018-04-27", "url": "http://www.femalefirst.co.uk/celebrity/orlando-bloom-finds-hard-impress-son-1140914.html?f=rss", "content": "Orlando Bloom finds it hard to impress his son Orlando Bloom finds it \"very hard to impress\" his seven-year-old son Flynn. STUMBLE SHARE SHARE TWEET PIN 27 April 2018 Orlando Bloom finds it \"very hard to impress\" his seven-year-old son. Orlando Bloom The \"Pirates of the Caribbean' star has revealed Flynn - who he has with his ex-wife Miranda Kerr - is one of his biggest critics and is difficult to please. He said:\" He definitely won't be seeing \"Killer <mark>Joe</mark>' but he has seen some of\" Pirates of the Caribbean'. It's very hard to impress him but he liked it. \"And the 41-year-old actor - who is currently dating Katy Perry - loves the\" massive adrenalin rush \"he has got from starring in a play. Speaking on The <mark>Graham Norton</mark> Show, he added:\" It's fantastic and although it's 17 years old, it feels very current. Most people would not think of me in this role after \"Will Turner' and\" Legolas'. It has sensitive material and is quite dark, shocking and challenging. The appeal of the theatre is the response from the audience. It's like free-falling and a massive adrenalin rush. \"Meanwhile, Orlando previously confessed he will be studying animals at the zoo to prepare for his gritty return to the West End in black comic thriller\" Killer <mark>Joe</mark>'. Speaking about how he'll work on the part of detective <mark>Joe Cooper</mark> - who has a side job as a contract killer - he shared: \"This play is particularly interesting at this time. It's about the disenfranchised American dream. But it's funky and provocative and visceral. It's everything I go to the theatre for...I will start to look at animals - I'll go to the zoo. I like to find an animal, some kind of creature that helps me to inhabit the character - their rhythm, beat and pace. I'm quite physical as a person .\" The <mark>Graham Norton</mark> Show airs on BBC One on Friday (April 27) at 10.35 pm. Tagged in Katy Perry Orlando Bloom STUMBLE SHARE SHARE TWEET PIN"}, {"articleID": "2009030820_00062189_W", "names": {"Brad Jones": ["Q26834399", "Q2923402", "Q299228", "Q4954040", "Q4954041", "Q4954042", "Q56280650", "Q896802"], "Tim Howard": ["Q16226269", "Q200785", "Q7803679"]}, "date": "2009-03-08", "url": "http://us.rd.yahoo.com/dailynews/rss/europe/*http://news.yahoo.com/s/afp/20090308/sp_wl_afp/fblengfacup", "content": "afp - everton's french forward louis saha celebrates after scoring the team's second goal during their...david moyes's tactical switch pay dividends by sealing everton's passage into the with the winning goal after coming off the bench in a 2-1 win over manchester united striker saha, a free transfer signing from last august, won the tie for everton with a glancing header past boro keeper <mark>brad jones</mark> in the 56th minute. david wheater's first-half opener for boro, but saha's goal ensured everton can now look forward to visiting the new wembley for the first time in next month's semi-final. manchester united. \"it's great, we're all happy,\" said. \"the first-half was one of the poorest performances of our season .\" in the second half we showed the real everton and we're not just going to the semi-final now, we want to actually win the trophy and that's been our aim right from the word go - we want to go all the way. \"everton manager moyes revealed there had been harsh words in the home dressing-room during the break .\" after a talking to at half-time by the staff members, the players showed what they were really about in the second half with the two goals, \"he said .\" (what was said) certainly couldn't be talked about here. we just needed them livened up. \"premier league table compared to everton's sixth place now just have a grim battle for top-flight survival to look forward to in the closing weeks of the season .\" that's all we have left to focus on, \"said boro manager .\" we've seen today why we are where we are, because we can't see matches through when we're ahead. \"we knew we'd have a bombardment second half and we feel we've got the players to deal with it - in actual fact for that five-minute spell we didn't,\" the former england central defender added. \"that sums us up this season so far .\" everton had been strong favourites to beat boro and book their first since 1995 - the year they last won the cup - but their first-half performance highlighted the nerves and tension within manager moyes's squad. middlesbrough since the opening day of the season - southgate's team had twice gone close through french forward jeremie aliadiere. everton, without a recognised striker in their starting line-up, lacked pace and penetration up-front with once again deployed as a makeshift lone forward. the home side's goal threat was limited to headers from belgian midfielder fellaini who, despite his height, failed to take advantage, although he did have one effort cleared off the line by. everton were punished for their poor first-half, though, when wheater beat goalkeeper <mark>tim howard</mark> with a close-range header seconds before the interval. a failure to clear a free-kick properly allowed bates to cross for the boro centre-half, who outjumped the everton defence. moyes made a key change at the interval, however, by introducing saha in place of young midfielder and the switch instantly upped everton's attacking threat. and the everton boss was rewarded for his positive change five minutes into the second-half when fellaini equalised with a header from cahill's cross. fellaini's goal put everton firmly in control of the game and they proceeded to pour forward in an attempt to capitalise on their second-half dominance. sports video: fantasy mlb: fantasy downgrades royals notebook: a-rod's injury fuels rumors of yankees' interest in teahen aaa moving & delivery inc your local moving company (va dc md), professional movers & packers. reed switches inexpensive, high quality, imported, magnetically operated reed switches. photos: crufts dog shownearly 28,000 dogs are competing in the crufts show in england. surprising job growththese hot industries are thriving in this economy. find out who is still hiring."}, {"articleID": "2014111806_00005734_W", "names": {"John Tavares": ["Q537353", "Q6260293"], "Tyler Johnson": ["Q17489372", "Q30122141", "Q57423105", "Q7585450", "Q7860052"], "Ben Bishop": ["Q12956342", "Q816445"]}, "date": "2014-11-18", "url": "http://islanders.nhl.com/club/news.htm?id=739604&cmpid=rss-wright", "content": "Game Preview: Islanders vs. Lightning The Islanders wrap up a home and home series with Tampa Bay at Nassau Coliseum. Three days after their first loss in six games, all the New York Islanders want to do is get back on the ice to make amends. They may have had to wait a few days for a second crack at the Tampa Bay Lightning, but the Islanders will get their chance at revenge tonight at 7 p.m. at Nassau Coliseum. \"I thought we played a pretty good game in Tampa. We stayed right with them,\" Head Coach Jack Capuano said. \"We had a couple of breakdowns and that was the difference in the game I know this team and the more we play, the better we are .\" The Islanders played the Lightning in the second game of a back-to-back set Saturday, but the tables are turned tonight, as the Isles are rested, while the Bolts play their second game in two nights. \"Rested\" teams (teams that did not play the night before) hold a 39-16-13 record when facing teams who played the previous night. The Islanders hope to use that statistic - and fresh legs - to their advantage tonight. \"We get them on the back-to-back this time and we just want to be ready to play,\" Islanders captain <mark>John Tavares</mark> said. \"[We have to] just try to be a little bit more physical on the offensive side, on the fore check, be a little bit harder on them and try to generate a little more on our cycle .\" Capuano said he'll be adjusting the top power-play unit to bust out of a 1-for-16 slump. The coach had Johnny Boychuk and Frans Nielsen practicing on the top unit. While the Islanders are a top-10 team in goals (54), the Lightning counter with the NHL's most potent offense, with 71 goals (including shootout winners) in 19 games (3.7 per game). \"We have to make sure that we buckle down defensively,\" Capuano said. \"We're not looking to get into a track meet with them, we're looking to play our game .\" While most conversations about the Tampa Bay offense begin with Steven Stamkos, the Lightning boast a well-balanced attack. Sophomores <mark>Tyler Johnson</mark>, Nikita Kucherov and Ondrej Palat have all stepped up after impressive rookie campaigns. <mark>Johnson</mark> is second in team scoring with 21 points (six goals, 15 assists), Palat has 14 points (four goals, 10 assists) in 19 games and Kucherov (seven goals, nine assists) is two points shy of matching his output from last season in a fraction of the games. \"[Nikita] Kucherov is a real tricky player,\" <mark>Tavares</mark> said. \"He's got some great hands. He's very creative. [<mark>Tyler</mark>] <mark>Johnson</mark> is just a very underrated, smart player. He always seems to be in the right spot, very high hockey IQ and, obviously, can produce. Those couple guys can make a lot of plays and on their back end, they just have guys with a lot of size who move the puck well .\" The Lightning are still without top defenseman Victor Hedman and it is unclear which of their two goaltenders will play Tuesday. <mark>Ben Bishop</mark> played last night against the Rangers, potentially opening the door for former Islander Evgeni Nabokov to play at the Coliseum. The Islanders and Lightning face off at 7 p.m. 11-6-0 (22 points - 2nd in Metropolitan Division, 4th in Eastern Conference) 4-2-0 home Tampa Bay Lightning 13-4-2 (28 points - 2nd in Atlantic Division, 2nd in Eastern Conference) 7:00 p.m. Nassau Veterans Memorial Coliseum What's Happening at the Coliseum: Josh Bailey - Forward Josh Bailey hasn't missed a beat since returning from an eight-game absence, notching a goal and an assist in his first two games back. The Bowmanville, ON, native scored the Islanders second goal against the Lightning on Saturday and has points in four straight games (one goal, three assists), dating back before his hand injury. Bailey has six points (three goals, three assists) in nine games this season. Tampa Bay Lightning previous game lines 51 Valtteri Filppula - 91 Steven Stamkos - 24 Ryan Callahan 18 Ondrej Palat - 9 <mark>Tyler Johnson</mark> - 86 Nikita Kucherov 27 Jonathan Drouin - 90 Vladislav Namestnikov - 17 Alex Killorn 10 Brenden Morrow - 11 Brian Boyle - 13 Cedric Paquette Defensemen 6 Anton Stralman - 25 Matt Carle 5 Jason Garrison - 7 Radko Gudas 8 Mark Barberio - 62 Andrej Sustr By Adam Kimelman Monday, 11.17.2014 / 1:44 PM"}]