[{"date": "2016-08-09", "url": "http://cartermatt.com/216689/bachelor-paradise-3-spoilers-one-potential-nick-viall-amanda-stanton-josh-murray-tease/", "content": "\"Bachelor in Paradise 3' spoilers: One potential Nick Viall--Amanda Stanton--Josh Murray tease August 9, 2016 by Leave a Comment The third season of\" Bachelor in Paradise \"is off to a chaotic start, and it could open become even more so as it gets further and further into this season. For more of episode 2, we saw the main point of contention be the arrival of Josh Murray, where he in turn ended up taking Amanda Stanton on a date. This upset Nick Viall greatly, given that he was already starting up a relationship with her. He now feels like he's lost her, and he has to figure out what happened. What could he do to ensure that he figures all of this out? The synopsis below offers up a few clues--it's not confirmed that it is about Nick, but at the same time there aren't many other candidates at present it could be in reference to unless someone starts to date Carly Waddell in the near future after she spent time with Evan Bass:\" When one bachelor knows he is going home since he was recently dumped, he plants a fake date card addressed to him so he can tell his original love interest how he feels. The only glitch is the beauty is very much taken and is making out with her hunky guy when the desperate guy approaches. What will the notorious bachelor do when his woman is stolen from him mid-makeout? Will the underdog prevail? \"Ultimately, we think the words\" notorious bachelor \"are the biggest clue that this is Josh. What else makes sense? If you want to get some other news when it comes to\" Bachelor in Paradise, \"or in particular its\" After Paradise \"show following it up? Then be sure to head over to the link here! Also, sign up over here to secure some other TV news on all we cover, sent right over to you via our official CarterMatt Newsletter. (Photo: ABC .) Filed Under: Reality TV Tagged With: Bachelor in Paradise Related Post\" After Paradise' spoilers: <mark>Sean Lowe</mark>, <mark>Chad Johnson</mark>, <mark>Michelle Collins</mark>, more appear in premiere Follow Us Follow @ MattCarterMedia Follow @ DangerGirl101", "articleID": "2016080918_00234376_W", "names": {"Sean Lowe": ["Q17523875", "Q7441167"]}}, {"date": "2016-08-09", "url": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-star-plaza-raze-st-0810-20160809-story.html#nt=oft06a-4li2", "content": "Merrillville's Star Plaza Theatre, Radisson Hotel to close Five for Valentines Philip Potempa / Post-Tribune The waterfall in the lobby of the Radisson Hotel at Star Plaza soon will splash no more. Hotel officials said the hotel and adjacent Holiday Star Theatre would be razed and replaced by a new upscale hotel. The waterfall in the lobby of the Radisson Hotel at Star Plaza soon will splash no more. Hotel officials said the hotel and adjacent Holiday Star Theatre would be razed and replaced by a new upscale hotel. (Philip Potempa / Post-Tribune) Michelle L. Quinn Post-Tribune Northwest Indiana's Star Plaza Theatre will be demolished next year, turning to rubble one of the region's main entertainment venues that's been in operation for nearly four decades. Merrillville based White Lodging Services Corp. announced Tuesday it will close the Radisson Hotel in January and the adjacent Star Plaza Theatre in May 2017. The 330-room hotel will make way for a 250-room, higher-end hotel with some meeting and banquet space, but there are no plans to rebuild the theater. The theatre's booking company, Star Productions, meanwhile, will expand its services to other venues, according to the release. Events will continue through the spring. Charlie Blum, CEO of Star Productions, said in the release that as White Lodging surveyed the hotel for renovations, it concluded the aging building and theater wouldn't be able to structurally accommodate its plans. \"It is with a heavy heart that we have come to the conclusion that the Star Plaza, which has been a cultural mecca for Northwest Indiana and Chicago area residents since 1979, must close its doors,\" Blum said in the release. \"We all recognize what the theater means to our community and, of course, it has played a huge role in my life and the lives of my dedicated, hard-working staff .\" White Lodging Services Corp.. Founder Bruce White, who also serves as Chairman of the Board, said in a statement that he was \"saddened\" by the pending closing of The Star Plaza Theatre and noted that it's still successful. \"The theater has always been successful, thanks to the hard work of Charlie and his team, and in fact, this most recent season was one of our most successful in our history, which makes this decision to raze the building even harder,\" White said in the statement. \"I know how much it has meant to the community, our patrons from throughout the Midwest, and so many in the entertainment industry during its 37 years of operation, and I personally have spent countless hours enjoying incredible performances at the theater .\" South Shore Convention and Visitor Authority CEO Speros Batistatos said he had \"mixed feelings\" about the closing. \"That theater launched many a career in Northwest Indiana in hospitality, mine and others,\" Batistatos said. \"But (razing the facility) is long overdue. You're looking at a Holidome Holiday Inn built in the 1970s, and there comes a point where you can throw a bunch of money at something, and no amount of carpeting or new curtains or bedding is going to help. We understand the decision .\" While Batistatos is concerned that Northwest Indiana will be losing at least 100 hotel rooms in the next 18 months, what concerns him even more is that the area will be losing between 20,000 and 30,000 square-feet of convention space when the Radisson is torn down. \"This opens the door to have a much-needed conversation about a public-private partnership to build a convention and meeting space that we've been talking about for years,\" he said. \"This conference space (in the Radisson) is gone, and they're not replacing it. This is what happens when a private company says,\" We're done .' \"Nevertheless, Batistatos said it could turn out to be a benefit for the area .\" This is a fork in the road, and it's going to take some work, but do we want to step up? We can make the argument that we can change the look of the region for the next 40 or 50 years, \"Batistatos said .\" This could be a real platinum-lined cloud if we have the willingness to do it. \"White Lodging Communications Director Kathleen Sebastian said the company is still determining what will happen with the Radisson's employees as well as any events customers have booked with the hotel past its closing date. The Star Plaza opened in 1979 as the Holiday Star Theatre with a concert by Donna Summer and has been in continuous operation since. It was renamed the Star Plaza Theatre when the hotel converted to a Radisson property. It has played host to many entertainment giants, including legendary Sammy Davis, Jr., Whitney Houston, Christina Aguilera, ZZ Top, Alice Cooper, Diana Ross, Garth Brooks, Jamie Foxx, Luther Vandross, Bette Midler, Barry Manilow, Crosby, Stills and Nash, Tina Turner, Miles Davis, Patti LaBelle, <mark>Phil Collins</mark>, <mark>Ray Charles</mark>, Reba McEntire, Tim McGraw, <mark>Tony Bennett</mark>, BB King, Night Ranger, Kenny Chesney and Aretha Franklin. Michelle Quinn is a freelance reporter for the Post-Tribune.", "articleID": "2016081000_00396002_W", "names": {"Phil Collins": ["Q144622", "Q7181796", "Q7181800"], "Ray Charles": ["Q7297319", "Q872846"], "Tony Bennett": ["Q19946119", "Q23048751", "Q296729", "Q3993198", "Q4772102", "Q7821881", "Q7821882", "Q7821883"]}}, {"date": "2016-08-12", "url": "http://desertsun.com/story/news/health/2016/08/12/california-senate-asks-obama-end-gay-blood-donation-ban/88609834/", "content": "Buy Photo (Photo: Richard Lui/The Desert Sun) Buy Photo CONNECT TWEET LINKEDIN COMMENTEMAILMORE California state lawmakers are asking President Barack Obama to end policies that still make it extremely difficult for gay and bisexual men to donate blood. The state Senate on Thursday approved a resolution, 34-0, asking the president to push the Department of Health and Human Services to repeal current blood donations and instead \"direct the FDA to develop science-based policies such as criteria based on risky behavior in lieu of sexual orientation .\" The Food and Drug Administration took a step last year to relax a complete ban on blood donations from men who had ever had sex with another man since the earliest years of the AIDS crisis. The new policy instead banned donations from men if they've had sex with another man in the previous year. DESERT SUN FDA eases restrictions on blood donations from gay men LGBT advocates strongly criticized the new rules when they were introduced last year, and again following the July mass shooting at the Pulse gay nightclub in Orlando, where 49 people were killed and dozens more were injured. \"When so many otherwise eligible gay and bisexual men who wanted to donate blood after the recent tragedy in Orlando were turned away, the need to reform the FDA's outdated policy on blood donation once again became painfully clear,\" Rick Zbur, executive director of Equality California, said in a statement Thursday regarding the California Senate vote. Equality California is supporting the resolution. The resolution, which has no direct effect on policy, has bipartisan support from state lawmakers. Its co-authors include Republican Assemblyman Chad Mayes of Yucca Valley, whose district includes Palm Springs, and Democratic Assemblyman <mark>Eduardo Garcia</mark> of Coachella. \"America is facing a critical blood supply shortage. Many healthy men want to donate blood, yet are being denied due to an outdated, discriminatory policy. This is wrong,\" Mayes, the Assembly's Republican Leader, said in the news release from Equality California. \"No healthy person should be turned away when they want to help save people's lives .\" Health reporter Barrett Newkirk can be reached at (760) 778-4767, barrett.newkirk @ desertsun.com or on Twitter @ barrettnewkirk. DESERT SUN Zika virus: What the Coachella Valley needs to know CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //desert.sn/2bcbpHX", "articleID": "2016081215_00172740_W", "names": {"Eduardo Garcia": ["Q1290941", "Q17183066", "Q18686283", "Q5340616", "Q5819236", "Q5819238"]}}, {"date": "2016-08-13", "url": "http://mlb.mlb.com/news/article/pit/pirates-miss-out-on-several-offensive-chances?ymd=20160813&content_id=195434476&vkey=news_pit", "content": "Full Game Coverage \"They were out there. We couldn't get them in,\" manager Clint Hurdle said. \"I don't think we were trying to do anything but fight, scratch, claw our way back into the game .\" Gerrit Cole allowed a career-high 12 hits, the defense committed three errors--two of them by Jung Ho Kang on one play--and their pitching staff didn't put a zero on the scoreboard until <mark>Jeff Locke</mark>'s scoreless seventh. Still, the Pirates had plenty of chances to win and solidify their standing in the National League Wild Card race. They totaled 10 hits and 11 walks. They batted with the bases loaded six times, five of them in the first two innings and three of them against a starter, Brandon McCarthy, with wayward command. John Jaso walked with the bases loaded in the first, and Gregory Polanco did so to drive in another run in the second. But they could have used a hit or two in the middle of one of those rallies. Marte scores in the 1st PIT @ LAD: Marte opens the scoring on Jaso's walk Starling Marte crosses home for the first run of the game on John Jaso's walk, giving the Pirates an early 1-0 lead in the 1st \"A ball in the gap would have been nice. We didn't get it,\" Hurdle said. \"We got a couple walks, plated a couple runs, kept stretching things out. We just weren't able to score .\" The Pirates stranded 18 runners for just the third in a nine-inning game. The others were not exactly recent history: June 5, 1951, against the Boston Braves; and Sept. 8, 1905, against the Reds. Kang recorded their lone hit with men in scoring position, a second-inning RBI single off reliever <mark>Josh Fields</mark>. The Pirates didn't score again until the eighth, when Kang went deep for the first time since June 24, ending the longest homerless drought of his two-year career. \"He wasn't chasing. He stayed stubborn with his approach,\" Hurdle said of Kang, who reached base a season-high four times. \"That can be the start of something good, something real good .\" Kang's solo tater PIT @ LAD: Kang connects for a solo homer to left Jung Ho Kang narrows the Pirates' deficit to 8-4 in the 8th, as he clubs his 12th long ball of the season to left field The Pirates became the fourth team this season to rack up double-digit hits and walks and lose. Still, they had a chance in the ninth. Josh Harrison walked with one out, and <mark>Eric Fryer</mark> drew a two-out walk. The save situation led the Dodgers to call on closer Kenley Jansen, who struck out Polanco to strand runners Nos. 17 and 18. \"I spent eight years [coaching and managing] at Coors Field, so this really doesn't wrinkle me too much. We saw a lot of games at Coors Field. There's a lot of baserunners,\" Hurdle said. \"But this is somewhat of an outlier here, there's no doubt. It's a park that's seen a lot of good pitching, a lot of low-scoring games. There was a lot of traffic out there .\" <mark>Adam Berry</mark> has covered the Pirates for MLB.com since 2015. Follow him on Twitter at. This story was not subject to the approval of Major League Baseball or its clubs. @ adamdberry Share This", "articleID": "2016081402_00697440_W", "names": {"Adam Berry": ["Q23542551", "Q348765", "Q39073627"], "Eric Fryer": ["Q3056272", "Q5386537"], "Jeff Locke": ["Q12118813", "Q3176534"], "Josh Fields": ["Q3185962", "Q6288855"]}}, {"date": "2016-08-14", "url": "http://www.xxlmag.com/rap-music/new-music/2016/08/the-lox-rick-ross-feel-my-pain/?trackback=blogroll_widget-bangers", "content": "The LOX and <mark>Rick Ross</mark> Join Forces on \"Feel My Pain\" By C. Vernon Coleman II August 14, 2016 9:51 AM SHARE TWEET EMAIL REDDIT EMAIL REDDIT Subscribe to XXL on It's been over a decade and a half since The LOX put out a full length LP. Sixteen years to be exact. Though they have remained active as a group and on the solo tip, fans are still fiending for the illusive We Are The Streets 2. Evidence might be pointing to that project being put in motion as the Yonkers trio puts out their second track in two weeks with the <mark>Rick Ross</mark> - assisted banger \"Feel My Pain .\" The laid back single is a reflective one with the top tier lyricists taking their life experiences into perspective. Styles P takes the second verse spitting, \"Told my mother if I die today I live like a king/I ain't sleep a lot but I lived out my dreams/Came from the streets with the dealers and the fiends/Couple people thought I wouldn't outlive my teens/Now I'm flyin' places, balconies and fireplaces/I ain't shootin' like the Uzi broke/Lookin' clean, eat cuisine with the bougie folks/Got diamonds but I still want rubies though/Classic like the book but we still make a movie though .\" <mark>Rick Ross</mark> joins the fold, sprinkling in his signature kingpin anecdotes. \"Ain't no love, my mind up, I shed my last tear/Street sweepin' these corners made me a cashier/A nigga's swag kept me sack like a quarterback/That type of paper made my ass never wannarap/Virgin, I had golden eagle kilos all in my lair/I see no evil, no witness, God bless these Cartiers,\" he spits. Even more reason for excitement for LOX fans, earlier this week, news broke that the trio has been heavy in the lab with A-list producers Just Blaze, <mark>DJ Premier</mark> and Timbaland. Over the past week, Styles P has taken to Instagram for three separate posts announcing that the group is working with the aforementioned esteemed beatmakers. 34 Rappers Going Platinum in 2016 Image of Subscribe to XXL on Filed Under: Bangers | <mark>Rick Ross</mark> | The LOX Category: Music | New Music SHARE TWEET EMAIL REDDIT More Leave a comment EMAIL Print this page Pin it! REDDIT Share on Tumblr!", "articleID": "2016081416_00393376_W", "names": {"Dj Premier": ["Q30122010", "Q380639"]}}]