[{"date": "2016-08-14", "url": "http://www.xxlmag.com/rap-music/new-music/2016/08/the-lox-rick-ross-feel-my-pain/?trackback=blogroll_widget-bangers", "content": "The LOX and <mark>Rick Ross</mark> Join Forces on \"Feel My Pain\" By C. Vernon Coleman II August 14, 2016 9:51 AM SHARE TWEET EMAIL REDDIT EMAIL REDDIT Subscribe to XXL on It's been over a decade and a half since The LOX put out a full length LP. Sixteen years to be exact. Though they have remained active as a group and on the solo tip, fans are still fiending for the illusive We Are The Streets 2. Evidence might be pointing to that project being put in motion as the Yonkers trio puts out their second track in two weeks with the <mark>Rick Ross</mark> - assisted banger \"Feel My Pain .\" The laid back single is a reflective one with the top tier lyricists taking their life experiences into perspective. Styles P takes the second verse spitting, \"Told my mother if I die today I live like a king/I ain't sleep a lot but I lived out my dreams/Came from the streets with the dealers and the fiends/Couple people thought I wouldn't outlive my teens/Now I'm flyin' places, balconies and fireplaces/I ain't shootin' like the Uzi broke/Lookin' clean, eat cuisine with the bougie folks/Got diamonds but I still want rubies though/Classic like the book but we still make a movie though .\" <mark>Rick Ross</mark> joins the fold, sprinkling in his signature kingpin anecdotes. \"Ain't no love, my mind up, I shed my last tear/Street sweepin' these corners made me a cashier/A nigga's swag kept me sack like a quarterback/That type of paper made my ass never wannarap/Virgin, I had golden eagle kilos all in my lair/I see no evil, no witness, God bless these Cartiers,\" he spits. Even more reason for excitement for LOX fans, earlier this week, news broke that the trio has been heavy in the lab with A-list producers Just Blaze, <mark>DJ Premier</mark> and Timbaland. Over the past week, Styles P has taken to Instagram for three separate posts announcing that the group is working with the aforementioned esteemed beatmakers. 34 Rappers Going Platinum in 2016 Image of Subscribe to XXL on Filed Under: Bangers | <mark>Rick Ross</mark> | The LOX Category: Music | New Music SHARE TWEET EMAIL REDDIT More Leave a comment EMAIL Print this page Pin it! REDDIT Share on Tumblr!", "articleID": "2016081416_00393376_W", "names": {"Rick Ross": ["Q297831", "Q431969", "Q606032"]}}, {"date": "2016-08-15", "url": "http://www.freshplaza.com/article/161944/Ecuador-and-Peru-lifted-the-suspension-of-10-agricultural-products", "content": "They resume importsEcuador and Peru lifted the suspension of 10 agricultural products Ecuador and Peru lifted the suspension of imports to 10 products, 5 of Peruvian origin (watermelon, citrus, peaches, grapes and corn kernels), and 5 from Ecuador: dry cane, beans, cocoa beans, papaya, and fresh flowers. The decision was made last Tuesday, after a bilateral videoconference between authorities of the Ecuadorian Agency for Quality Assurance Agro (Agrocalidad) and Peru's National Agrarian Health Service (Senasa). The provincial director of Agrocalidad, Alfredo Icaza, announced the decision to lift the suspension of Phytosanitary Import Permits (PFI) for 10 products from Ecuador and Peru. \"Importers who are already registered in the system can request the respective permits if they meet the phytosanitary import requirements,\" said Icaza. Ecuador decided to suspend the issuance of phytosanitary import permits last April 13 to update phytosanitary requirements; while Peru suspended them on the 27 of the same month. \"This agreement mainly benefits the border areas and will help us control contraband,\" said <mark>Carlos Zambrano</mark>, governor of El Oro. The measure became effective starting Thursday August 11. The authorities will meet again in the city of Tumbes on September 20 to see if they lift the suspension of other products, such as onion and apple in the case of Ecuador, and pineapple and banana in the case of Peru. Source: eltelegrafo.com. ec", "articleID": "2016081512_00797747_W", "names": {"Carlos Zambrano": ["Q16223566", "Q2939511", "Q440277"]}}, {"date": "2016-08-15", "url": "http://artforum.com/news/id=62917", "content": "NYC's P! to Present Final Season of Exhibitions Installation view of \"O / U,\" 2016, featuring Aaron Gemmill, Julie Ault & <mark>Martin Beck</mark>, Brian O'Doherty (Patrick Ireland), Matthew Schrader, and <mark>Amy Yao</mark>. Photo: Sebastian Bach P!, an arts venue located in Chinatown that calls itself a project space, commercial gallery, and Mom-and-Pop Kunsthalle, has announced that after five years of experimental programming it will launch its final season of exhibitions this fall. From September 2016 to May 2017, P! will present five exhibitions, including \"<mark>Karel Martens</mark>: Recent Work,\" which is the artist's first solo exhibition in North America; \"The Stand,\" a show that will tie <mark>Stephen King</mark>'s 1978 eponymous novel about post-apocalyptic America with the nation's current political state; and Céline Condorelli: Epilogue, \"the UK-based artist's new body of work and the final show at the gallery. P! describes its last season as a group of shows that will engage with questions surrounding display strategies, curatorial models, identity hijinks, conflictual processes, and financial structures. Founded in 2012 by New York--based designer and curator Prem Krishnamurthy, P! has organized over forty exhibitions and offsite projects from its location at 334 Broome Street. Even though the experimental exhibition space is closing its physical location, Krishnamurthy said the organization will still be\" an exhibition-making machine. \"In 2018, P! will reinvent itself by expanding its mission, which will focus on organizing offsite exhibitions at venues in the US and abroad, developing publications with artists, and collaborating with institutions.", "articleID": "2016081519_00335609_W", "names": {"Amy Yao": ["Q40138088", "Q56254225"], "Karel Martens": ["Q22691458", "Q3193071"], "Martin Beck": ["Q1466639", "Q38326473", "Q42581262", "Q6774971"], "Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}}, {"date": "2016-08-16", "url": "http://extramustard.si.com/extra-mustard/2016/08/16/la-rams-william-hayes-mermaids-hard-knocks-video", "content": "Extra Mustard Rams DE was excited about moving to LA because he'd be closer to mermaids Share facebook twitter Dan Gartland 2 hours ago Rams defensive end <mark>William Hayes</mark> made people scratch their heads last season when he said that he believes mermaids are real and dinosaurs never existed. A year later, he's sticking to his guns on at least one of those theories. Head coach <mark>Jeff Fisher</mark> was asked about <mark>Hayes</mark>'s unusual beliefs for HBO's Hard Knocks and confirmed that he still very much believes in mermaids. Not only that, <mark>Hayes</mark> was excited about the franchise's move to Los Angeles because it meant he'd have a better chance of seeing one. \"Will <mark>Hayes</mark> absolutely believes and is totally convinced, that there are mermaids and they do exist .\" #HardKnocks https: //t.co/AiDetIsXar--NFL (@ NFL) August 16, 2016 What, there aren't any mermaids in the Mississippi River? Tags la rams will <mark>hayes</mark> mermaids hard knocks video la rams <mark>William Hayes</mark> <mark>william hayes</mark> rams <mark>william hayes</mark> mermaids <mark>william hayes</mark> dinosaurs <mark>william hayes</mark> hard knocks Hard Knocks hbo hard knocks rams hard knocks", "articleID": "2016081619_01133591_W", "names": {"Jeff Fisher": ["Q1757363", "Q18585355", "Q3176484"], "William Hayes": ["Q16205974", "Q18603380", "Q55088372", "Q56876827", "Q8011060", "Q8011061", "Q863134"]}}, {"date": "2016-08-17", "url": "http://www.philstar.com/sports/2016/08/17/1614432/mayweather-rio-roots-us-olympic-boxing-prospect", "content": "Sportshub (Leaderboard Top), pagematch: 1, sectionmatch: 1 Mayweather in Rio, roots for US Olympic boxing prospect By Dan Gelston (Associated Press) | Updated August 17, 2016 - 2:25 pm Floyd Mayweather Jr., left, poses for picture with Shakur Stevenson after Stevenson won a men's bantamweight 56-kg quarterfinals boxing match against Mongolia's Tsendbaatar Erdenebat at the 2016 Summer Olympics in Rio de Janeiro, Brazil, Tuesday, Aug. 16, 2016. | AP Photo/Dan Gelatin RIO DE JANEIRO--His focus seemingly unflappable, Shakur Stevenson was briefly distracted when he heard a familiar voice as he walked out for his Olympic bout. \"Augie! Augie!\" Floyd Mayweather Jr. was in the house and shouting at US boxing assistant coach Augie Sanchez. Stevenson had been bummed out when he was told Mayweather had left the Rio de Janeiro Games. Turned out, the rumor was false and one of Stevenson's biggest fans had the best seat in the arena to watch the top US prospect continue his medal run. \"I got a little more nervous again,\" Stevenson said. Stevenson, who is from Newark, New Jersey, calmed his nerves and made a lasting impression on Mayweather with a convincing win over Mongolian fighter Tsendbaatar Erdenebat. The retired, undefeated Mayweather went wild for the 19-year-old Stevenson in a unanimous decision victory that guaranteed him a medal. Sportshub (Article MRec), pagematch: 1, sectionmatch: 1 And why not? Mayweather saw Stevenson fight with a style in the ring that reminded him of another great fighter. \"I see the next Floyd Mayweather,\" Mayweather said. \"If anybody can break my records, this young kid right here can do it. I truly believe in him .\" Mayweather believed in Stevenson (24-0 in international competition) so much that he expected more than gold for Stevenson--Money May wanted the prized prospect on his blossoming Mayweather Promotions roster. Of course, he'll have to compete with other promoters to grab the best US amateur. \"When I saw him at my gym, I said,\" Who is this guy?' I want to sign him instantly, \"Mayweather said .\" I thought he was a professional. They said he was an amateur but he's got a professional style. He's the No. 1 guy, of course, that I'm interested in. \"All eyes were on Mayweather more than any fighter in the ring. Mayweather is still the undisputed top attraction at the boxing tournament in what was at least his third visit to the venue. The US bronze medalist at the 1996 Atlanta Games smiled when he was shown and introduced on the big screen to a roaring ovation. Dozens of fans hurried his way for selfies. He never removed the earbuds attached to his mobile phone when he posed for a few fans. They were quickly shooed away and blocked off by members of Mayweather's friends known as TMT: The Money Team. Mayweather invited Popo Freitas, a former Brazilian boxing world champion, down to his seat for a quick chat. Mayweather enjoyed the fights, first from the front row of the corner of the bleacher seats, then he moved to dead center for the two American bouts. The 39-year-old Mayweather retired last year after a 49-0 career. The International Boxing Association (AIBA) changed its rules this year to allow professionals to fight at the Olympics, but Mayweather had no interest. He also ruled out a comeback .\" I'm an old man, \"he said, laughing .\" I'm treating my body good, being smart. I was still able to compete at the top level for 20 years. I've done a lot in boxing. I just want to give back to young champions right here. \"Stevenson (wearing a\" Team Shakur \"shirt) and some friends and family joined Mayweather in the stands and posed for even more pictures. But Mayweather's A-list pull might not be enough to convince Stevenson to join the team. Stevenson is widely expected to sign a professional contract in the fall with Top Rank Boxing. Stevenson's grandfather, Wali Moses, began teaching him how to box when he was 5, and he has barely lost since he won his first fight at 8. Stevenson's mother, Malikah, named him after Tupac Shakur, the rapper and social activist who died nine months before her first son was born. Stevenson mostly avoided trouble on Newark's tough streets, and his grandfather's steady influence kept him devoted to his sport. Stevenson remains the brightest candidate to win the first men's gold medal in 12 years from once-proud USA Boxing. Andre Ward was the last American man to claim the top prize with at the 2004 Athens Games, and the London men's team failed to win any medals. Kansas fighter Nico Hernandez snapped the medal drought last week with a bronze. Stevenson has Russian fighter <mark>Vladimir Nikitin</mark> up next and the winner goes for gold. He was all smiles Tuesday when he had Mayweather by his side as they fought through a mob to escape the arena. It's even better for Mayweather to have his back .\" It's everything, \"Stevenson said .\" That's the greatest of all time. \"Sportshub (Article MRec), pagematch: 1, sectionmatch: 1", "articleID": "2016081708_00066480_W", "names": {"Vladimir Nikitin": ["Q15411436", "Q2522628", "Q4319735", "Q4319736"]}}, {"date": "2016-08-17", "url": "http://www.patheos.com/blogs/friendlyatheist/2016/08/17/david-barton-claims-you-just-dont-find-atheists-living-in-the-countryside/", "content": "At an Arkansas Tea Party conference last weekend, Christian pseudo-historian <mark>David Barton</mark> said that you don't find any atheists in the rural parts of America because, if we lived in the country, we would totally believe in God since evidence of His creation would be all around us. \"Do you know how hard it is to find an atheist in the country?\" <mark>Barton</mark> asked. \"You find atheists in the city. You find atheists in areas that don't get to see God. If you spend time looking at creation, you just don't find atheists out there .\" It's a strange statement for a number of reasons, the least of which is that we know atheists exist everywhere. If there are atheists in Saudi Arabia, I promise you it wouldn't be that hard to find them on a farm. Hell, you'd expect to find some atheists in rural areas given how much science is involved in agriculture and raising animals. <mark>Barton</mark> is also suggesting that evidence of God doesn't exist in big cities. I guess the diversity of people, and the incredible architecture, and the beautiful lakefronts don't count. If I were a pastor, it would be easy to point to examples of God's Creation in the city. <mark>Barton</mark> seems to think God limits himself to farmland and animals and open skies...which is an odd thing to hear from a cheerleader for Christ. <mark>Barton</mark> made a similar claim in 2014, and I'll paraphrase what I said then: If there are more religious people in the countryside, one reason for that could be that when you're more isolated from the world, as farmers tend to be, you're much less likely to encounter people whose different ideas may challenge you and cause you to change your mind. In the city, you come face to face with other opinions all the time. You live and work with people who disagree with you. It's a lot harder to be anti-gay in an urban area, for example, because you'll inevitably meet and know gay people and realize there's nothing to worry about. But none of that suggests you won't find devout Christians in big cities or atheists in the country. (via Right Wing Watch)", "articleID": "2016081718_00049434_W", "names": {"David Barton": ["Q1173662", "Q19560044", "Q42354512"]}}]