[{"date": "2016-08-18", "url": "http://www.stuff.co.nz/business/farming/83343715/Overseas-drinkers-quaff-New-Zealand-wines", "content": "Overseas drinkers quaff New Zealand wines GERARD HUTCHING Last updated 10:27, August 19 2016 Wine exports are on track for $2 billion in earnings by 2020. Overseas consumers' taste for New Zealand wine has lifted exports to just under $1.6 billion for the last year, up 10 per cent on the year before. The United States market jumped by 23 per cent, from $372 million in 2015 to $460m to the end of June 2016. Other leading export destinations include the United Kingdom ($381m), Australia ($361m), Canada ($107m), and the Netherlands ($44m). China, which has grown from practically nothing 10 years ago, is now worth $27.5 m, although it slipped in value slightly from the year before. Hong Kong, regarded as a separate market, recorded $17m in exports. New Zealand Winegrowers chairman <mark>Steve Green</mark> said this year marked the 21st in a row that wine exports had grown, and the industry was on target to reach its goal of $2b by 2020. \"This continued strong performance is testament to underlying market and consumer demand for our wines in key markets,\" <mark>Green</mark> said. Export volumes are expected to rise by a further 10 per cent over the next 12 months, following the 2016 grape harvest of 436,000 tonnes, 34 per cent higher than last year. By volume of variety, sauvignon blanc is by far the leader at 303,000 tonnes, followed by pinot noir (35,000 tonnes), chardonnay (29,000 tonnes), pinot gris (25,000 tonnes), and merlot (9000 tonnes). The total vineyard area is 36,000 hectares, predicted to grow to about 40,000 ha over the next four years. Wine is now New Zealand's sixth largest export good by value. Ad Feedback - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Farming story: Old school thinking stunts export gains Business Homepage", "articleID": "2016081823_00090353_W", "names": {"Steve Green": ["Q16729431", "Q281452", "Q3973339", "Q3973340", "Q41773462", "Q43273454", "Q7612708", "Q7612709"]}}, {"date": "2016-08-23", "url": "http://www.indiaglitz.com/srk-shares-on-location-pic-from-dear-zindagi-hindi-news-165605.html", "content": "Jacqueline Fernandez keen to work with SRK, Aamir Khan Shah Rukh <mark>Khan</mark> recently shared an on-location pic from his much talked film by <mark>Imtiaz Ali</mark>, \"Dear Zindagi'. The <mark>King Khan</mark> is seen with a red flag against the backdrop of a beautiful tower, apparently a bridge. Sharing the pic on Instagram, SRK wrote,\" <mark>Imtiaz</mark> said I could post this picture from the sets...& promised there will be some close ups of me in the film too! \"", "articleID": "2016082222_00306208_W", "names": {"Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"], "King Khan": ["Q6411794", "Q9535"]}}, {"date": "2016-08-23", "url": "http://www.businessinsider.in/Idea-rebuff-mergertalks-with-Vodafone/articleshow/53829543.cms#commentHash", "content": "Idea rebuff merger talks with Vodafone Reuters Aug 23, 2016, 07.25 PM Facebook Linkedin Twitter Google + Reddit Continue reading India's No. 3 mobile phone carrier, Idea Cellular, strongly denied a news report on Tuesday that it was in exploratory talks about a merger with larger rival Vodafone India. A spokeswoman for Idea's parent, conglomerate Aditya Birla, called the CNBC TV18 report of talks between Idea and Vodafone \"baseless and absolutely false\". \"This is absolutely untrue and preposterous,\" she said in an email. \"There is no such intent .\" Shares in Idea closed 6.9 percent higher on Tuesday after the TV channel said the two sides were in talks, citing unnamed sources. A spokesman for Vodafone India, India's No. 2 operator by market share and the local arm of Britain's Vodafone Group Plc, declined to comment on the report. India is the world's second-biggest mobile phone market by subscriptions, behind China, but high competition in the crowded market has kept profits under pressure. Adding to the competition, Reliance Jio - a telecom venture backed by India's richest man Mukesh Ambani - is set to launch commercial operations in the coming months. \"Both of them are struggling with their data revenue market share and ahead of a big competitive change in the industry they might want to get bigger,\" IDFC securities analyst <mark>Abhishek Gupta</mark> said of Idea and Vodafone India. Any such deal would also face tough regulatory scrutiny and analysts say approvals would be unlikely, as the companies would breach the 50 percent revenue market share limit in many regions of the country if they did try to merge. \"It's very unlikely,\" PhillipCapital (India) analyst Naveen Kulkarni said, citing the regulatory hurdles. \"I'm doubtful whether this can go through but there could be some other form of merger, such as spectrum-sharing deals,\" he added. Follow Business Insider on facebook Like twitter Follow gplus Follow More from this author Say hello to Uber's self-driving car Venezuela just crushed 2,000 guns in public, but t.. . Cisco plans to announce its biggest layoff in hist...Lowe's sinks after sales miss expectations China wants everyone to chill out about its worryi...Related Stories Aditya Birla Group is reaching new heights. Here i.. . Now Aditya Birla Group joins the Defence equipment...Reliance Jio Infocomm Signs Telecom Tower Sharing...Reliance Jio Signs Tower-sharing Deal With BSNL Reliance Jio Raises $1.5 Billion To Refinance Loans Amitabh Jaipuria quits Reliance Jio right before 4...Reliance Jio wants legal action against top telcos Now, Aditya Birla Group joins the bad world of e-c...More: Vodafone Group Plc Reliance Jio Naveen Kulkarni Idea Cellular Aditya Birla", "articleID": "2016082314_00204977_W", "names": {"Abhishek Gupta": ["Q27951640", "Q42287900", "Q53294409"]}}, {"date": "2016-08-23", "url": "http://wdiy.org/post/terror-years-traces-rise-al-qaida-and-isis", "content": "\"The Terror Years' Traces The Rise Of Al-Qaida And ISIS By NPR Staff • 4 minutes ago Share Twitter Facebook Google + Email Listen Listening.../ Author <mark>Lawrence Wright</mark> was a conscientious objector during the Vietnam War, which meant he was required to do two years of what was called\" alternative service. \"He ended up in Egypt, teaching at the American University in Cairo. And it was there that the man from Texas started his obsession with the Middle East. Since then, <mark>Wright</mark> has written a lot about the region and about terrorism as a staff writer for The New Yorker. Now, he has compiled his many New Yorker essays into a new book called The Terror Years: From al-Qaeda to the Islamic State. But his interest in terrorism stretches back to well before his New Yorker job...back to a screenwriting gig in the 1990s. He tells NPR's Kelly McEvers that the 1998 film The Siege asked\" what would happen if terrorism came here? As it already had in, say, London and Paris, you know, how would we react if it happened in New York? \"Interview Highlights On people's reactions to The Siege after the Sept. 11 attacks It was the most rented movie in America after 9/11...I think there were two things--one was, it explained and looked at the problem of terrorism. But the other thing is, the movie has a happy ending, and after 9/11, people weren't sure how this movie was going to end. On his piece about <mark>John O'Neill</mark>,\" The Counter-Terrorist \"If you recall, the planes were all grounded [after the attacks], and I lived in Austin, so I was unable to get to New York for several days, and I was desperate to get involved in this. I didn't know how to reduce this vast tragedy to a human scale. So I was combing through obituaries streaming online, and on this Washington Post site, I found <mark>O'Neill</mark>'s obituary. And it made him out to be something of a disgrace. He had been the head of counterterrorism in New York, and he'd been washed out of the [FBI] because he'd taken classified information out of the office. And then he wound up getting a job as head of security at the World Trade Center. You know, his job was to get Osama bin Laden, and instead bin Laden got him. And I thought at the time it was ironic. But I don't see it that way anymore. He took that job because he knew that al-Qaida would come and try to finish the job on the World Trade Center--they had bombed it once before in 1993--so he instinctively put himself at ground zero...it was <mark>O'Neill</mark> and a handful of people that really realized the peril that America was in. On the Americans held captive and killed by the Islamic State, and what might have been done differently I'm not saying that they might have been able to survive. Unless the American government had taken the same policy as the Europeans, which was simply to pay off the kidnappers. But the American government opposes that, and also at the time opposed any Americans, even the parents of these individuals, paying to ransom their child. So essentially, the parents were left by themselves. They had no idea how to deal with ISIS, and they got very little help from the State Department or the FBI...there was rarely any moment when the FBI or the State Department shared information or offered to help in any meaningful way. On the relevance of al-Qaida in the age of ISIS Well, al-Qaida is the parent, with all the progeny that has multiplied all over the world. If you call it al-Qaida or bin Ladenism or jihadism, whatever you call it, it's proliferated. So yes, the mother organization has been reduced--it's not extinct, but it has certainly been confined. But the idea that they have put forward is alive in the world and spreading rapidly, unfortunately. On how we've changed in America Well, I was reflecting about how, when I was in high school, I took a date to Love Field in Dallas. That was actually the name of the airport, but it was where a lot of dates went when you didn't have any money. And I remember that we climbed into this airliner that had just come from some European place--we decided it must have been Paris--and we sat in the first class compartment, and the stewardesses, as you called them then, brought us a snack, and we pretended we were really cosmopolitan. And then we went up in the FAA tower,\" Come on in, kids! \"So we sat down and watched these airplanes land. And that was America. And I'm so struck, just going into an office building where you have to be photographed. In Philadelphia, you go visit the Liberty Bell and you have to take off your shoes and your belt. These impingements on ordinary liberty--the kinds of things we took entirely for granted, those are gone. But if they're forgotten they'll be permanently gone. And I think that it's important that we keep in our minds the idea of that kind of freedom, and if we lose that, then I think terrorism really will have won. Copyright 2016 NPR. To see more, visit http: //www.npr.org/. Related Program: All Things Considered View the discussion thread.", "articleID": "2016082323_00049226_W", "names": {"John O'Neill": ["Q16122131", "Q2628718", "Q53536543", "Q54771468", "Q6250976", "Q6250980", "Q6250982", "Q6250984", "Q6250987", "Q6250991", "Q6250993", "Q6250995", "Q6251003"], "Lawrence Wright": ["Q18706520", "Q353893", "Q6504763", "Q6504767"]}}, {"date": "2016-08-24", "url": "http://abcnewspapers.com/2016/08/24/minnesota-educators-offer-back-to-school-advice/", "content": "Five major suggestions emerged from 38 Minnesota educators who responded to a request about brief \"back to school\" advice for families. I asked them what they recommend families do to help youngsters get ready for school. These educators offered specific, practical advice. Virtually nothing these educators suggested requires spending money. Joe Nathan The most frequently cited ideas involved: - Moving back into a school year sleep schedule. - Encouraging and helping young people set goals. - Talking positively about the value of learning and schooling. - Developing or reconfirming a positive relationship with educators. - Model the kind of actions, attitudes and behaviors that you want young people to develop. Here's what educators in this area suggested: <mark>David Law</mark>, Anoka-Hennepin superintendent, recommends that families \"Create open lines of communication early and assume positive intentions. Many bumps in the road can be avoided by working with the school and assuming the school is working on your student's behalf .\" Peter Wieczorek, director, Northwest Passage High School wrote: \"For parents of high school students my advice would be talk to your students about the importance of attending school everyday. When students get older it is easier to let then decide if they are going to miss school, but research shows and teachers will tell you that students who miss even a few days a quarter are less likely to graduate .\" Tony Simons, executive director, PACT charter wrote: \"I would tell parents to have the\" Back to School Talk' a couple of weeks before school starts. I have four kids of my own who are now grown and we had this conversation with our kids. \"Simons also recommended the following: 1. Schedules--younger children need to start getting back into their\" school schedule \"a couple of weeks before school starts. This would include bathroom schedules, breakfast options, transportation, and what time school starts. 2. Go over academic and behaviors expectations and the school rules with your children. How you act and talk in the summer sometimes doesn't meet the school standard. If it is a problem get it cleaned up. 3. Challenge your child to make school the most positive experience it can be. A major piece of advice I give is be cooperative with all the adults at school. That means teachers, administration, para-educators, bus drivers, food service workers, supervisors, custodial staff and OTHER STUDENTS. There a lot of kids at school and to get something done academically we all need to cooperate. Brandon Wait, executive director of Paladin Career and Technical High School wrote:\" Routine is key. Sleep is the answer. At school, we see way too many students absent from school or come to school exhausted and lacking sleep. Setting an example or creating a routine of going to sleep at a reasonable time and getting up early will help tremendously with the shock of the early hours the first few weeks of school brings. I think the saying goes, it takes 21 times to form a new habit, so now is the time! Encourage your students to take healthy risks. Try out for a team, audition for a production, run for student government, join a school club or take advantage of school trips. We see so many students come back and say that the enjoyment of high school or best memories come from those formed by the meaningful experiences that happened outside of the classroom. \"Denise Specht, president of Education Minnesota suggests:\" Use the final weeks of summer to ease back into school routines by setting aside a time and place for homework and enforcing a steady schedule of bedtimes and wake-up times. Once school starts, communicate with your child's teachers and learn the best ways to contact them and so you can learn about what is happening in the classroom. Always remember you are your child's learning role model. Show you like to read, write and know how to use technology appropriately. \"Like families, these educators are committed to students' success. It doesn't take a lot of time, and no money is needed to follow these five recommendations. But time, thought and effort are required. However, following these suggestions will have real, positive results. Joe Nathan, formerly a Minnesota public school teacher, administrator and PTA president, is a former director and now senior fellow at the Center for School Change. Reactions are welcome at [email protected].", "articleID": "2016082418_00943019_W", "names": {"David Law": ["Q39089787", "Q57983265"]}}, {"date": "2016-08-26", "url": "http://wspa.com/ap/illinois-redistricting-referendum-wont-appear-on-ballot/", "content": "Illinois redistricting referendum won't appear on ballot SOPHIA TAREEN, The Associated Press Published: August 25, 2016, 9:22 pm CHICAGO (AP)--A divided Illinois Supreme Court narrowly ruled Thursday that a voter referendum seeking to change how Illinois draws political boundaries is unconstitutional, making it ineligible to appear on the November ballot. The high court, in a 4-3 decision, affirmed the ruling by a Cook County judge who determined the ballot initiative seeking to give legislative mapmaking power to an independent commission instead of lawmakers didn't meet constitutional muster. It's the second failed attempt to overhaul redistricting by petition in two years. The ruling in the high-stakes case--falling the day before an election deadline to certify fall ballots--had the potential to alter Illinois' political power dynamic, where elected officials in the Democratic-leaning state run the once-a-decade process. But in a 63-page ruling the majority justices said the measure didn't meet narrow constitutional requirements. \"The intent demonstrated by both the plain constitutional language and this court's prior case law imposes clear restrictions on the scope of permissible ballot initiatives,\" Chief Justice <mark>Thomas</mark> Kilbride wrote for the majority. \"We may not ignore our mandate by simply deferring to the redistricting approach proffered by a particular ballot proposal, no matter how appealing it may be .\" The legal arguments in the case have largely centered on whether the ballot measure met the constitutional scope of being \"structural and procedural\" to the state's Legislature. It's a high bar. Only one other petition-driven measure has made it to the ballot. Justices were sharply divided. Dissenting Justice <mark>Robert Thomas</mark> blasted the majority decision as \"nothing less than the nullification of a critical component\" of the constitution with \"particularly unfortunate\" timing. \"In Illinois, as throughout the United States, there is a palpable sense of frustration by voters of every political affiliation that self-perpetuating institutions of government have excluded them from meaningful participation in the political process,\" he wrote. Backers of the measure--called the Independent Maps coalition--said they would consider whether to seek a rehearing. They collected about 563,000 signatures for the ballot measure, claiming the current mapmaking process is too political. They wanted voters to endorse a complex new system that would include an 11-member bipartisan commission, the state auditor general and a random drawing. \"Mapmaking by legislators--the very people whose re-elections depend on partisan maps--has led to a decline in competitive elections and voter dissatisfaction,\" said Dennis FitzSimons, the group's chairman. \"Drafters of the Illinois Constitution would not recognize the interpretation made by the Supreme Court majority .\" The ballot measure was challenged through a lawsuit brought by an attorney who has long represented top Democrats, including the leader of the state party, House Speaker Michael Madigan. The complaint was filed on behalf of minority business and community leaders called the People's Map who claimed a new process would diminish minority representation. However, those arguments weren't addressed in court. \"Any attempt to weaken the rights of minority voters is an attack on democracy itself, making today's ruling a victory for a fair and truly accountable electoral process,\" People's Map chairman John Hooker said in a statement. Independent Maps, whose members included Republican former Gov. Jim Edgar and former White House chief of staff Bill Daley, dismissed the lawsuit as the work of \"entrenched\" interests. Democratic leaders have said they weren't involved in the lawsuit. Independent Maps attorneys had argued that since legislative districts are the \"building blocks of the General Assembly,\" redistricting is by its nature structural and procedural. In briefs to the high court, they addressed the intent of the Illinois Constitution, last rewritten in 1970, and argued that not reversing the Cook County judge's ruling would \"eviscerate the constitutional right\" to directly propose reforms. Gov. Bruce Rauner, the state's first GOP governor in over a decade, supported a 2014 redistricting effort as part of his gubernatorial run. A Cook County judge rejected that attempt. \"Fair maps create fair districts,\" Rauner said in a statement. \"The system is broken and controlled by career politicians,\" State election officials had already determined the measure appeared to have enough valid signatures ahead of Friday's deadline to certify ballots. ___ Follow Sophia Tareen at http: //twitter.com/sophiatareen. Advertisement & laquo; Previous Story Please enable JavaScript to view the comments powered by Disqus. Leave a Reply Cancel reply Enter your comment here...Fill in your details below or click an icon to log in: Email (required) (Address never made public) Name (required) Website You are commenting using your WordPress.com account. (Log Out / Change) You are commenting using your Twitter account. (Log Out / Change) You are commenting using your Facebook account. (Log Out / Change) You are commenting using your Google + account. (Log Out / Change) Cancel Connecting to% s Notify me of new comments via email. Notify me of new posts via email. Advertisement More Stories on WSPA SC Democratic Party Defending Decision to Rename Jefferson-Jackson Dinner - COLUMBIA, S.C. (WSPA)--The South Carolina Democratic Party has decided to rename its annual Jefferson-Jackson Dinner, dropping the names of...Football practice causing more head injuries than actual games, research shows - New research is helping to pinpoint when and why younger football players get head injuries. 1 on the run, 2 in custody after police chase in Anderson - Two people are in custody and another is on the run after a police chase in Anderson. Sheriff's deputy shot in TN, suspect in custody - A Blount County deputy was shot Thursday afternoon near Maryville, Tennessee. The suspect is in custody. \"Game changing\" diabetes test created by Clemson researchers - A better test for diabetes could be on the way, thanks to two Clemson researchers. It's not just helping man, but also man's best friend. Man exposes himself to Byrnes HS students in front of school - Duncan Police have arrested a man they say exposed himself to two Byrnes High School students near the school on Monday. 11 without a home after fire in Oconee Co. - A house fire has left 11 people without a home in Oconee County. Upstate Boy Scout Councils Pilot Kindergarten Programs - Even younger boys will be able to get involved with Boy Scouts. A new pilot program called \"Lions\" will allow the Cub Scouts to include kind...Cherokee Co. deputies search for \"kind robber\" - Cherokee County Deputies are investigating a string of armed robberies in Blacksburg off of Interstate 85. Car fire closes lane on I-85 S near Exit 54 (Pelham Rd.) - Traffic is backed up on I-85 southbound due to a car fire that has closed the right lane near Exit 54 (Pelham Road). Advertisement Advertisement Advertisement", "articleID": "2016082601_00417550_W", "names": {"Robert Thomas": ["Q18158780", "Q30689603", "Q3938440", "Q42765313", "Q56598167", "Q7350339"]}}, {"date": "2016-08-27", "url": "http://thestar.com/news/world/2016/08/27/who-would-miss-the-daily-mails-patent-misogyny-mallick.html", "content": "World Who would miss the Daily Mail's patent misogyny?: Mallick The lawyer that toppled Gawker is now targeting the for repeating Melania Trump rumours. But don't start cheering for the death of the Daily Mail just yet. A lawyer for Melania Trump said Monday he has informed several news organizations, including the Daily Mail, that they could face legal action for publishing articles that Trump contends were defamatory. (ERIC THAYER / The New York Times) ByHeather MallickColumnist Sat ., Aug. 27, 2016 The lawyer behind the Hulk Hogan sex-tape lawsuit that bankrupted Gawker is planning to sue Britain's Daily Mail on behalf of Melania Trump for repeating \"100 per cent false\" rumours that she worked as an escort in the 1990s. It was a story about those confused years when she was striving to reach American shores. It's a strange lawsuit because the lawyer, Charles Harder, who was backed by billionaire <mark>Peter Thiel</mark> in the Gawker case, said the Mail story \"exceeds all bounds of...human decency .\" Thanks to Trump's husband, I no longer know what those bounds are. Thrashingly, chaotically free speech leaves many orphans in its wake. The Daily Mail exceeds moral bounds often. After all those \"what we lost when we lost Gawker\" journalistic analyses--the answer is not a whole lot, frankly--I wonder what we'd lose in the Daily Mail were it to close, which I assume DMG Media will not permit. The thing is eternal; cockroaches will read it long after humans vanish. It's the only mainstream website I formally avoid as a health hazard--Twitter, you're next--but there remains something wonderful about it. Its genius is that it is unfailingly interesting (a quality that Canadian newspapers will evade unto death), I suspect because its editor, Paul Dacre, terrifies people. I get frightened all over again when I watch video of him at the 2012 Leveson inquiry into phone hacking. Dacre has said he \"would die in a ditch\" to defend a columnist's freedom of speech but as I typed his name, the knuckles vanished from my hands and appeared inside my fingers. The room grew cold; I could see my breath. The lead story on the Daily Mail's home page was a 30-kilometretraffic jam on the M5 motorway caused by police talking a suicidal woman off a bridge. So why did it take two hours to arrest her, the Mail headline asks angrily/chattily. Women. If they're not blocking traffic, they're a bloody smear on the public junctions, and take hours to clean up. Article Continued Below Oh no, they've sent columnist Katie Hopkins to the Calais \"Jungle\" migrant camp across the Channel in France. \"Calais is bandit country. Lawless. Ungodly .\" Note: partial sentences are every bad writer's spare change. They dispense them. One. By one. The Daily Mail offers the purest misogyny in existence, 4chan has nothing on them, and after two hours of study, dear readers, I've decided I don't like women much either. The Sidebar of Shame running down the right hand side contains one, two, oh 40 photos of us in action before I tired of counting because I am not aroused by strumpets who are all wrong for me. Action verbs flow: \"defends bikini body, puts on smoking hot display, flashes her pert derrière, flaunts her toned torso, showcases her ace figure, shines in gold nightie top, dies, shows off her taut tummy, opts for sexy look, puts on a leggy display, flaunts her peachy posterior, cries, struggles to contain her womanly curves .\" Shift eyes back to the news and scroll down the longest tale of woe you will ever know, it's like a dragon's tail or the surgical packing in a deep wound. Britain's economy is \"booming\" while Germany's is \"wobbling .\" Nearly three out of 10 babies in England and Wales are born to foreign mothers, over 75 per cent in parts of London with \"Poles overtaking Indians .\" Note: never trust Daily Mail stats. If you're a foreigner, 100 per cent of infants born in your hospital room will be yours. It all depends how you define \"parts of London .\" Seven stories on bloody migrants. Five foreigners drown all at once, which is suspicious. A child reaches puberty at age 6, which is concerning. A mysterious \"rock\" on the surface of Mars looks like someone's \"lost shoe,\" and a take-no-chances bomb squad blows up a pesto sandwich on London Bridge. Here's photos of a python vomiting up an entire antelope. Daily Mail fear alert: rubble, pythons, shortage of bungalows, old cookies. Daily Mail advice: DO rub Vaseline on your teeth/split ends/behind ears as it gives skin \"a dewy glow .\" DON'T blacken eye walking into rolling stepladder outside Marks & Spencer as staff will laugh at you and \"fallout will shake your faith in the mainstay brand .\" DON'T get drunk and wake up to find you bought a & pound; 30,000 bus on eBay. In literary news, Sue Townsend dies and Gabriel Garcia Marquez is admitted to hospital with a urinary tract infection (both died in 2014). Ask the Daily Mail doctor: Should I take turmeric pills for my arthritis? \"No .\" Daily Mail question: How long do YOU want to live for? The Daily Mail recipe is Freudian (sex, death), paranoia (bloody foreigners), disgusting personal ailments (people squeezing the unlikeliest things), wacky animals (mainly ferrets) and people who don't deserve nice things (foreigners). It's riveting. And that's the problem. Hours pass. Your head has gone nasty. I oppose censorship, sympathize with Melania Trump (imagine what the woman endures) and thanks to the Daily Mail, wish to insert myself into a large protective non-flammable glove away from the wider world. But I made that choice. I read the thing. Don't read it. But you will. Will you wish you still could?", "articleID": "2016082712_00594352_W", "names": {"Peter Thiel": ["Q39141069", "Q705525"]}}, {"date": "2016-08-28", "url": "http://jg-tc.com/entertainment/italy-probes-to-see-if-criminal-negligence-raised-quake-toll/article_2cc68bc5-4113-502c-af66-9aee98fa8547.html", "content": "1of 19 Andrew Medichini The sun sets behind collapsed houses in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini Firefighters operate a drone to survey damages in the church of the village of Cossito, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini Paintings hang on the walls of the severely damaged church in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini A man walks past collapsed houses in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini Firefighters operate a drone to survey damaged constructions in the village of Cossito, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini The remains of the church of the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini A man walks by rubble in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini A painting hangs on a wall of the severely damaged church in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Antonio Calanni A rescuer and a sniffer dog stand atop rubble in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Antonio Calanni Firefighters recover paintings from a collapsed house in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Antonio Calanni) Antonio Calanni An Italian army soldier walks past rubble in Villa San Lorenzo, near Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Antonio Calanni) Antonio Calanni A view of a collapsed house in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Antonio Calanni Firefighters recover paintings from a collapsed house in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Antonio Calanni Firefighters work outside the Hotel Roma in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, second from right, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini People attend a mass celebrated by the bishop of Ascoli Piceno, Giovanni D'Ercole, in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) AP Italy probes to see if criminal negligence raised quake toll By VANESSA GERA and HAKAN KAPLAN Associated Press Updated0 Andrew Medichini The sun sets behind collapsed houses in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini Firefighters operate a drone to survey damages in the church of the village of Cossito, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini Paintings hang on the walls of the severely damaged church in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini A man walks past collapsed houses in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini Firefighters operate a drone to survey damaged constructions in the village of Cossito, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini The remains of the church of the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini A man walks by rubble in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Andrew Medichini A painting hangs on a wall of the severely damaged church in the village of Santi Lorenzo e Flaviano, central Italy, Saturday, Aug. 27, 2016. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Andrew Medichini) Antonio Calanni A rescuer and a sniffer dog stand atop rubble in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Antonio Calanni Firefighters recover paintings from a collapsed house in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Antonio Calanni) Antonio Calanni An Italian army soldier walks past rubble in Villa San Lorenzo, near Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. Italians bid farewell Saturday to victims of the devastating earthquake that struck a mountainous region of central Italy this week. (AP Photo/Antonio Calanni) Antonio Calanni A view of a collapsed house in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Antonio Calanni Firefighters recover paintings from a collapsed house in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Antonio Calanni Firefighters work outside the Hotel Roma in Amatrice, central Italy, Saturday, Aug. 27, 2016 where a 6.1 earthquake struck just after 3:30 a.m., Wednesday. As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake. (AP Photo/Antonio Calanni) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, second from right, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini People attend a mass celebrated by the bishop of Ascoli Piceno, Giovanni D'Ercole, in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) Andrew Medichini The bishop of Ascoli Piceno, Giovanni D'Ercole, celebrates mass in a tent camp set in Pescara del Tronto, near Amatrice, central Italy, Sunday, Aug. 28, 2016. Hundreds of people have been left homeless by the quake, with many spending their nights in tent cities and a gym in Amatrice, where volunteers are working to provide basic amenities. (AP Photo/Andrew Medichini) AMATRICE, Italy (AP)--Bulldozers with huge claws and other heavy equipment rolled through Italy's quake-devastated town of Amatrice on Sunday, pulling down dangerously overhanging ledges and clearing rubble as investigators tried to figure out if negligence in enforcing building codes added to the quake's high death toll. Investigations will focus on a number of structures, including an elementary school in Amatrice that crumbled when the quake hit Wednesday. The school was renovated in 2012 to resist earthquakes at a cost of 700,000 euros ($785,000). Questions also surround a bell tower in Accumoli that collapsed, killing a family of four sleeping in a neighboring house, including a baby of 8 months and a 7-year-old boy. That bell tower also had been recently restored with special funds allocated after Italy's last major earthquake in L'Aquila in 2009. The quake early Wednesday killed 291 people and injured hundreds as it flattened three medieval towns in central Italy. Giuseppe Saieva, the prosecutor in the regional capital of Rieti, said the high human death toll \"cannot only be considered the work of fate .\" He said for now, police investigators remained focused on recovery efforts but once that emergency phase has passed, they will concentrate on the investigations. Italy's state museums, meanwhile, embarked on a fundraising campaign, donating their proceeds Sunday to relief and reconstruction efforts in the earthquake zone. Wednesday's 6.2 magnitude quake destroyed not only private homes but also churches and other centuries-old cultural treasures. The idea is to use art for art--harnessing the nation's rich artistic heritage to help recover and restore other objects of beauty in the hard-hit towns. Culture Minster Dario Franceschini had appealed to Italians to \"go to museum in a sign of solidarity with people affected by the earthquake .\" On Twitter, the appeal came along with the hashtag #museums 4italy. It's one of several efforts that have sprung up to help the towns rebuild--restaurants in Italy and elsewhere are also serving up pasta Amatriciana, the region's most famous dish, in another fundraising effort. Amatrice bore the brunt of destruction with 230 fatalities and a town turned to rubble. Eleven others died in nearby Accumoli and 50 more in Arquata del Tronto, 10 miles (16 kilometers) north of Amatrice. Overnight was relatively calm, the first since the quake struck without strong aftershocks. In all, the region has seen 1,820 aftershocks, according to the National Institute of Geophysics and Volcanology. On Saturday, mourners prayed, hugged, wept and even applauded as coffins carrying earthquake victims passed by at a state funeral in the town of Ascoli Piceno. The caskets of 35 people had been brought to a community gym--one of the few structures in the area still intact. The local bishop, Giovanni D'Ercole, celebrated Mass beneath a crucifix he had retrieved from one of the damaged churches. Emotions that had been dammed up for days broke in a crescendo of grief. One young man wept over a little girl's white coffin. Another woman gently stroked another small casket. Many mourners were recovering from injuries themselves, some wrapped in bandages. \"It is a great tragedy. There are no words to describe it,\" said Gina Razzetti, a resident at the funeral. \"Each one of us has our pain inside. We are thinking about the families who lost relatives, who lost their homes, who lost everything .\" As all of Italy observed a day of national mourning, Bishop D'Ercole urged residents to rebuild their communities.", "articleID": "2016082811_00663229_W", "names": {"Matteo Renzi": ["Q47563", "Q49661315"]}}]