[{"date": "2016-08-29", "url": "http://www.huffingtonpost.com/2016/08/29/aziz-ansari-didnt-think-his-ny-times-op-ed-about-trump-would-affect-so-many-people_n_11761796.html", "content": "GP Images via Getty Images Aziz Ansari attends Master of None cast panel at Just for Laughs Comedy Festival held on Jul. 29, 2016 in Montreal, Canada. Aziz Ansari brilliantly called out <mark>Donald Trump</mark>'s xenophobic rhetoric in a scathing op-ed for the New York Times this past June. The \"Master of None\" writer, actor and director spoke about the article, which quickly went viral, in a new interview with The Daily Beast. \"You know, I put out that article and I thought like,\" Maybe this will resonate with other brown people, \"' Ansari said .\" But it ended up being like the most-emailed, most-viewed article on the site for a couple of days. People come up to me of all different races, all different religions like, \"That's really cool that you wrote that. I really liked that article .\" ' In the op-ed, Ansari spoke about his parents, who are from India, and his family's Muslim faith. The actor started it off with an anecdote, telling his mother not to go near a mosque out of fear she would be hurt, thanks to the sort of hate Trump believes in. \"Today, with the presidential candidate Donald J. Trump and others like him spewing hate speech, prejudice is reaching new levels,\" the actor wrote. \"It's visceral, and scary, and it affects how people live, work and pray. It makes me afraid for my family. It also makes no sense .\" As Ansari explains in his interview with The Daily Beast, Trump's xenophobic comments are a result of the GOP candidate's fear of anyone who doesn't look exactly like his tiny handed, spray-tanned self. \"Blaming them for something, misrepresenting them, making them some sort of strange character that they're not, not giving them the depth that he would give other white people,\" Ansari said, adding, \"What gives me hope is that I think sometimes the people that are more negative, kind of troll-y type people, they're very loud, but I think they're a loud minority. It's a strange juxtaposition, but I think there are still plenty of good people. I have hope .\" To read the rest of Ansari's interview with The Daily Beast, head here. Editor's note: <mark>Donald Trump</mark> regularly incites political violence and is a serial liar, rampant xenophobe, racist, misogynist and birther who has repeatedly pledged to ban all Muslims--1.6 billion members of an entire religion--from entering the U.S.. More: <mark>Donald Trump</mark> Aziz Ansari Suggest a correction Comments Close", "articleID": "2016082916_00565849_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-08-29", "url": "http://cnbc.com/2016/08/29/clinton-camp-dismisses-trump-challenge-on-health-records.html", "content": "<mark>Donald Trump</mark> on Sunday challenged Hillary Clinton to release more detailed medical records, but a Clinton aide said the Republican nominee should provide a \"legitimate\" and \"detailed\" letter beyond the brief note he has previously released. <mark>Trump</mark> Sunday afternoon Tweeted: \"I think that both candidates, Crooked Hillary and myself, should release detailed medical records. I have no problem in doing so! Hillary?\" Tweet 1 A Clinton aide said the campaign will not be releasing any more records. Clinton, 68, released a two-page letter last month from her doctor that said the Democratic nominee is in \"excellent physical condition and fit to serve as President of the United States .\" The Clinton campaign points out that the letter Clinton released has much more detail and specifics, like cholesterol levels, medical history and medications, and they argue there is no comparison to the letter <mark>Trump</mark> released and that <mark>Trump</mark> has not disclosed any meaningful medical information. More from NBC News: Clinton's \"right-wing conspiracy' comes full circle with <mark>Trump</mark> shake up <mark>Trump</mark> ad credits tax plan he doesn't support Wasserman Schultz looks to hold line in Sanders proxy war <mark>Trump</mark> in December released a four-paragraph letter from Dr. Harold Bornstein that called <mark>Trump</mark>'s health\" astonishingly excellent \"and claimed the 70-year-old would be\" the healthiest individual ever elected to the presidency. \"Bornstein--who says he has been <mark>Trump</mark>'s physician since 1980--told NBC News Friday that he wrote the letter in just 5 minutes while a limo waited outside his office, but the doctor said he had been thinking about the letter all day. Neither candidate has released the same amount of medical information that other presidential candidates of both parties have in the past. <mark>Trump</mark>'s challenge Sunday mirrors the response from his campaign spokesman on Friday after the NBC interview with Bornstein aired. Medical records have been an unusual source of controversy in a presidential race that has had plenty of them. <mark>Trump</mark> has claimed Clinton\" lacks the mental and physical stamina \"to be president. Others have raised unsubstantiated or debunked claims about Clinton. Fox News' Sean Hannity raised questions about whether Clinton suffered a stroke in the past and the Drudge Report used old photos to suggest she has trouble walking. Both theories have been debunked by news outlets. And fringe outlets have used a photo to question whether her body guard is secretly a doctor who carries a device to deliver anti-seizure injections. The Secret Service said the device in question is a standard flashlight. Clinton aides have called the rumors and claims\" deranged conspiracy theories. \"", "articleID": "2016083000_00763083_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-08-30", "url": "http://www.yorkshirepost.co.uk/sport/football/hull-city/hull-city-s-triple-raid-to-land-david-marshall-ryan-mason-and-will-keane-1-8096118", "content": "Hull City's triple raid to land <mark>David Marshall</mark>, Ryan Mason and Will Keane Cardiff City's goalkeeper <mark>David Marshall</mark> is set to join Hull City Richard Sutcliffe 15:03 18:51 Tuesday 30 August 2016 1 Have your say HULL CITY'S protracted summer recruitment search has finally paid dividends with the capture of Cardiff City goalkeeper <mark>David Marshall</mark> and Tottenham midfielder Ryan Mason for a record fee, The sum they will pay Tottenham for the 25-year-old midfielder remains undisclosed, but is believed to be & pound; 10m and it is a new record. Mason will further strengthen their squad following the earlier signing of goalkeeper <mark>David Marshall</mark> from Cardiff, and becomes the latest to leave White Hart Lane for East Yorkshire, following Tom Huddlestone, Jake Livermore and <mark>Michael Dawson</mark>. For City, <mark>Marshall</mark>'s arrival brings to an end a seven-month wait to make a signing - comfortably the longest in the country. A Scotland international, the 31-year-old has signed a three-year deal at the KCOM Stadium after joining in a & pound; 5m transfer. \"Having spoken to the people up here, I didn't need any convincing,\" said <mark>Marshall</mark>. \"It's all about having that new, fresh challenge to look forward to .\" I feel that this is a club that is going places, especially when you look at the start they have made to the Premier League season. \"There are only four or five goalkeepers in this division who can categorically say that they are their club's number one (goalkeeper).\" Of course I anticipate a battle for the jersey. You can't take anything for granted and I'm here to fight for a place. \"First choice goalkeeper Allan McGregor is on the long-term injury list so <mark>Marshall</mark> will battle it out with Eldin Jakupovic to face Burnley when the Premier League resumes on September 10. Mason's arrival for a medical follows Sunderland's late attempt to hijack the deal, The 24 year-old, capped by England as recently as 18 months ago, has been on City's radar for some time with former manager Steve Bruce revealing the club's interest back in early July. He has signed a three-year contract after costing the club in excess of the & pound; 10million paid to recruit <mark>Abel Hernandez</mark> in 2014, and told their official website of his arrival:\" I can't wait to get started and I see this as a massive opportunity for me. \"I'm delighted and excited to be here .\" Hull later confirmed their third arrival of the day - striker Will Keane from Manchester United. The 23-year-old, who worked with Phelan during the latter's time as assistant manager, has signed a three-year contract having also arrived for an undisclosed fee. \"I'm delighted to move here,\" he told Hull's official website. \"It's a fresh start and a new challenge for me, so I'm really looking forward to getting things underway .\" ", "articleID": "2016083017_00934540_W", "names": {"Abel Hernandez": ["Q318456", "Q5654899"], "David Marshall": ["Q19663750", "Q21467267", "Q5237157", "Q5237158", "Q5237160", "Q5237162", "Q57420834", "Q947204"], "Michael Dawson": ["Q15835011", "Q43153045", "Q47091636", "Q59192", "Q6829755", "Q6829756"]}}, {"date": "2016-08-30", "url": "http://komonews.com/news/business/us-consumer-confidence-in-august-highest-in-11-months", "content": "US consumer confidence in August highest in 11 months by MARTIN CRUTSINGER, AP Economics Writer AA WASHINGTON (AP)--U.S. consumer confidence rose in August to its highest level in 11 months, suggesting economic growth could pick up in the second half of the year. The Conference Board said Tuesday that its consumer confidence index rose to 101.1, up from 96.7 in July. It was the highest level for confidence since the index hit 102.6 last September. The gain reflected consumers' brighter views about current the economic situation and their expectations for the future. The percentage of those surveyed who saw business conditions as \"good\" increased from 27.3 percent to 30 percent. Those who viewed business conditions as \"bad\" remained virtually unchanged at 18.4 percent. Consumers who regarded jobs as \"plentiful\" increased from 23 percent to 26 percent, although those who felt jobs were \"hard to get\" also rose slightly from 22.1 percent to 23.4 percent. Economists said that the climb in confidence reflected stronger job gains seen in recent months, as well as strength in the stock market and home prices, which boost consumers' net worth. They expect the momentum in jobs to boost incomes and spur stronger consumer spending. That should help growth accelerate in the second half of this year, after four quarters of an anemic average growth rate of 1.2 percent. Many analysts believe gross domestic product will top 3 percent in the current quarter. \"Growth will be supported by consumer confidence and job growth,\" <mark>Jennifer Lee</mark>, senior economist at BMO Capital Markets, said in reaction to the consumer confidence report. The government will release the August jobs report on Friday. Many economists are looking for a gain of around 180,000 jobs. close", "articleID": "2016083021_00756611_W", "names": {"Jennifer Lee": ["Q16196127", "Q16957577", "Q24713009", "Q57905542", "Q5929198"]}}, {"date": "2016-09-01", "url": "http://pantagraph.com/looking-for-something-to-do-this-weekend/article_7d6bb22a-0642-50fc-8679-cb2426889273.html", "content": "For The Pantagraph Buddy Guy Special events Bloomington-Normal Festival ISU; 10 a.m.-3 p.m. Sept. 1, ISU quad; information on 300 student organizations, food, entertainment, more; free; 309-438-8814. Light the Night; 4-8 p.m. Sept. 1, uptown Normal; bike safety event with free LED lights for cyclists, bike repair stations and information, contests, prizes, live music; free; 309-454-9557. Terrorism on Screen; 7 p.m. Sept. 1-4, ISU Capen Auditorium; terrorism-themed film fest with post-film discussions; free. Schedule: \"Battle of Algiers\" (1966), Sept. 1; \"The Terrorist\" (1998), Sept. 2; \"Paradise Now\" (2005), Sept. 3; \"Bear Story\" (2014) and \"I Wonder What You Will Remember of September\" (2004), Sept. 4. Children's Art Show Installation; 6 p.m. Sept. 2, Grey Dove Gallery & Wings Studio, 105A-B W. Monroe St., Bloomington; installation of gallery's annual kids' art show with surprise theme; free; 309-830-3481. +3 CARLOS T. MIRANDA, Pantagraph file photo First Friday; 5-8 p.m. Sept. 2, various downtown Bloomington restaurants, shops and galleries; extended hours, live entertainment, gallery events and more; www.downtownbloomington.org. Route 66 Haunted Bloomington-Normal Ghost Walk; 7 p.m. Sept. 2, downtown Bloomington; $15, with reservations at www.spiritsofbloomington.com. Downtown Bloomington Farmers Market; 7:30 a.m.-noon Sept. 3, downtown Bloomington square; fresh produce, meats, cheeses, baked goods, art, live music, more; free admission; 309-829-9599. Bloomington-Normal Labor Day Parade; 10 a.m. Sept. 5, Front and Center streets in downtown Bloomington to Miller Park; floats, marching bands, more; free; 309-828-8813. +3 LORI ANN COOK-NEISLER, Pantagraph file photo Central Illinois Gail's Pumpkin Patch; noon-5:30 p.m. Sun.-Fri ., 10 a.m.-5:30 p.m. Sat ., Sept. 1-Oct. 31, 1709 2000 Ave., Beason; pumpkin patch, baked goods, crafts, toddler maze, displays, special weekend events, more; 217 - 447-3409. Delavan Fall Festival; 6-10 p.m. Sept. 2, 8 a.m.-10 p.m. Sept. 3, 10:45 a.m.-10 p.m. Sept. 4, 6:30 a.m.-5:30 p.m. Sept. 5, downtown Delavan; parade (10:30 a.m. Mon.), carnival, entertainment, food, games, more; free; www.delavanfallfestival.com. Roamer Cruise Night & Car Show; 10 a.m.-10 p.m. Sept. 3, downtown Streator; 1917 Roamer car displays, food, music and more; free. Twin City Amateur Astronomers Public Viewing Sessions; 8-10 p.m. Sept. 3, Sugar Grove Nature Center at Funks Grove; open telescope viewing on topic of \"The Heart of the Milky Way Galaxy\" ; free; 309-830-4085. DuQuoin State Fair; 8 a.m.-midnight Sept. 3-5; harness racing, nightly grandstand shows and more; 618-542-1515. +3 LORI ANN COOK-NEISLER, Pantagraph file photo Grape Stomp & Harvest Festival; noon-6 p.m. Sept. 4, Mackinaw Valley Vineyard, Mackinaw; live entertainment, harvest activities, grape stomp, \"Lucy' look-alike contest, kids' activities, more; $5, under 13 free; 309-359-9463. Jewelweed & Winged Jewels; noon-4 p.m. Sept. 4, Chautauqua Picnic Area at Weldon Springs State Park, Clinton; hummingbird viewings and program; free; 217-935-0373. Peoria Labor Day Parade; 10 a.m. Sept. 5, downtown Peoria; free; 309-681-0696. Streator Labor Day Parade; noon Sept. 5, downtown Streator; floats, bands, more; free; 815-672-2921. National Stearman Fly-In; 10 a.m.-6 p.m. Sept. 5-11, Galesburg Municipal Airport, Galesburg; World War II-era Stearman biplane fest, with displays, shows, more; $1; www.stearmanflyin.com. Downs Village Market; 4-6 p.m. Sept. 7, southwest edge of Downs, off I-74; fresh local produce, baked goods, plants and flowers, crafts, more; free admission; 309-378-4396. Music Bloomington-Normal The Junior Varsity, Alex and the XO's, Mammoth Cannon and Movies About Animals; 7:30 p.m. Sept. 1, Castle Theatre, 209 E. Washington St., Bloomington; rock groups; $15; 309-820-0352. Loungeabout the Roundabout: Unemployed Architects; 6:30 p.m. Sept. 1, Uptown Circle, Normal; rock group; free; 309-454-9557. Sweetwater; 5:30 p.m. Sept. 1, Connie Link Amphitheater, Normal; pop-rock group; free; 309-454-9540. Mark Babbitt; 8 p.m. Sept. 2, ISU Kemp Recital Hall; ISU faculty trombonist, with guest pianist John Orfe; free. Whiskey Myers and Bogart Jones Band; 7:30 p.m. Sept. 2, Castle Theatre, 209 E. Washington St., Bloomington; rock-blues groups; $12 - $15; 309-820-0352. Central Illinois Bement Country Opry; 7 p.m. Sept. 2, Monticello Community Ballroom, 201 State St., Monticello; country music shows with Bement Country Opry band and guest <mark>Eric Gordon</mark>; $10; 217-377-0550. Heyworth Country Opry; 6 p.m. Sept. 3, Heyworth VFW, 203 E. Main St., Heyworth; country music shows with Steve Hargis & Friends; $10, under 10 free; 217-949-5311. Kentuckiana Opry; 8 p.m. Sept. 3-4, Kentuckiana Kampground, Hopedale; country music shows with Kentuckiana Opry Band and guest Ken Honecker (Sat .) and Rock 'n' Roll Show (Sun .); adults $8, children $2; 309-449-3274. Peoria Blues & Heritage Music Festival (formerly Budweiser Illinois Blues Festival); 6 p.m.-midnight Sept. 2, noon-midnight Sept. 3, Riverfront Festival Park, downtown Peoria; blues fest with two performance stages, headliners (Buddy Guy, O.A.R., Mavis Staples, Coco Montoya, Here Come the Mummies, more), food and beer, workshops, vendors, more; $25 Fri., $30 Sat ., $45 weekend pass; 800-514-ETIX. Rachel Barton Pine; 7 p.m. Sept. 7, Eureka College Becker Auditorium, Eureka; classical violinist; general $20, students $5; tickets at the door. Theater Bloomington-Normal Boeing Boeing; pay-what-you-can preview, 7:30 p.m. Sept. 1; regularly ticketed, 7:30 p.m. Sept. 2-3 and Sept. 9-10, and 2:30 p.m. Sept. 4 and 11, Community Players Theatre, 201 Robinhood Lane, Bloomington; comedy; $7 - $15; 309-663-2121. Central Illinois Memphis; 7:30 p.m. Sept. 1-3, Corn Stock Theater, Upper Bradley Park, Peoria; musical; $12 - $20; 309-676-2196. Nightlife Bloomington-Normal Noah's Back Alley Blues Band; 8 p.m. Sept. 1, Jazz UpFront; blues; no cover. Karaoke; 8:30 p.m. Sept. 1, 4 and 7, Shooters Lounge; no cover. Ezra Casey & Friends; 8 p.m. Sept. 2, Jazz UpFront; jazz; $5. Mark & Melisa; 7 p.m. Sept. 2, Bloomington Eagles; country-rock; $5. Patrick Campbell; 6 p.m. Sept. 2, Hyatt Place patio; solo piano; no cover. Tom Ricker; 6 p.m. Sept. 2, Maguire's; acoustic variety; no cover. J.B. and <mark>Tim Barnes</mark>; 5:30 p.m. Sept. 2, 8:30 p.m. Sept. 3 and 6 (<mark>Barnes</mark> only), Shooters Lounge; DJs; no cover. Back @ Cha; 6:30 p.m. Sept. 3, Baxter's American Grille; rock; no cover. Heroso; 9 p.m. Sept. 3, Winners; rock-pop; $3. Jim Vasilou & Trefan Owen; 7 p.m. Sept. 3, Dr. McKay's; acoustic rock; no cover. Joe Metzka and Rusty Hall; 8 p.m. Sept. 3, Jazz UpFront; jazz; $5. Kevin Stearns; 7 p.m. Sept. 3, Schooners; acoustic pop; no cover. Mongolian Death Wyrm; 8:30 p.m. Sept. 3, The Bistro; progressive boogie; no cover. Who Cares; 6 p.m. Sept. 3, Copper Top Lounge parking lot; classic rock; no cover. Candy Foster & The Shades of Blue; 8 p.m. Sept. 4, Jazz UpFront; blues; $5. Comedy Showcase; 8 p.m. Sept. 7, Jazz UpFront; comedy; no cover. Central Illinois Silver Foxes; 6:30 p.m. Sept. 1, American Legion, Heyworth; country; no cover. Miles Nielsen & The Rusted Hearts; 9 p.m. Sept. 2, Kemp's Upper Tap, Lexington; rock; no cover. Jammsammich; 7 p.m. Sept. 3, Mackinaw Valley Vineyard, Mackinaw; jam rock; $5. Jury's Out, Andy Morrelion and Jack Dupp; 5 p.m. Sept. 3, Lake Road Inn parking lot, Hudson; rock-variety; $5 (kids free). Rockin' Johnny Burgin and Tom Irwin; 3 p.m. Sept. 5, TailGaters Pub, LeRoy; blues; no cover. Stewart's Goose; 1:30 p.m. Sept. 5, Mackinaw Valley Vineyard, Mackinaw; acoustic; no cover. For kids Bloomington-Normal Children's Discovery Museum; 9 a.m.-5 p.m. Tue.-Wed. and Fri.-Sat ., 9 a.m.-8 p.m. Thu., 1-5 p.m. Sun .; 101 E. Beaufort St., Normal; exhibit gallery, paint wall, two-story climber, AgMazing exhibit, educational programs, more; $7, under 2 free; 309-433-3444. Astronomy: 3,000 Years of Stargazing; 7:30 p.m. Sept. 2-3, 2:30 p.m. Sept. 3, ISU Planetarium; planetarium show on major astronomical milestones of last 3,000 years; $2 - $4; 309 - 438-5007. Follow Dan Craft on Twitter: @ pg_dcraft Tags Sweeps Bloomington Blues Rock Live Music Exhibit Normal Country Music More from pantagraph.com & times; Post a comment Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment & times; Report Cancel Report Abuse & times; Watch this discussion. Stop watching this discussion. Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching", "articleID": "2016090119_00369066_W", "names": {"Eric Gordon": ["Q360993", "Q4696499", "Q5386598", "Q57957977"], "Tim Barnes": ["Q7803126", "Q7803127"]}}, {"date": "2016-09-02", "url": "http://www.ibtimes.com/big-bang-theory-star-kaley-cuoco-exposes-breasts-shocking-snapchat-photo-2410631", "content": "\"Big Bang Theory\" star Kaley Cuoco was feeling cheeky on Wednesday when she revealed her chest while playing around with her friend's Snapchat. The actress had been trying out different Snapchat filters and voice modifications on stylist Brad Goreski's phone, including one with adorable fox ears. In one photo, Goreski sported the creepy grandpa filter, complete with round-frame glasses and a checkered hat, while pointing at Cuoco's breast, which she exposed by unbuttoning her white shirt, according to Entertainment Tonight. But don't worry, the actress' assets were covered with a giant heart emoji. Cuoco, who does not have a public Snapchat account, also shared a video on her own Instagram account, showing her hanging out with boyfriend Karl Cook, Goreski and other friends. \"Killing the game today #squadgoals,\" she captioned the clip, which showed her sitting on Cook's lap and pressing several kisses on his cheek. Cuoco has been showing a lot of love for her equestrian boyfriend on social media lately. Last week, she shared a sweet photo of them kissing on Instagram, which she captioned, \"I miss this face already .\" Meanwhile, Cuoco is busy filming the upcoming season of \"The Big Bang Theory\" with co-stars Johnny Galecki, <mark>Jim Parsons</mark>, Simon Helberg, Mayim Bialik, Kunal Nayyar and Melissa Rauch. It was announced in July that Katey Segal, who played Cuoco's character's mother in \"8 Simple Rules,\" has been also cast as her mom in the CBS series. Cuoco, of course, immediately took to social media to share how excited she is to be working with Segal again. Related Stories Johnny Galecki, Kaley Cuoco Cuddle On \"The Big Bang Theory' Set Kaley Cuoco Shuts Down Marriage Rumors On Instagram Kaley Cuoco Shares Sweet Instagram Photo With Boyfriend Karl Cook\" Yes yes yes yes!!! Once my tv mom, always my tv mom love you @ kateylous!!!!! #fullcircle @ thebigbangtheory__, \"Cuoco captioned an Instagram pic with Segal. Catch Cuoco and the rest of the cast when\" The Big Bang Theory \"Season 10 returns with brand new episodes on Monday, Sept. 19 on CBS. Kaley Cuoco recently bared her chest in a Snapchat post. Pictured: Cuoco poses backstage with her award for Favorite Comedic TV Actress during the 2015 People's Choice Awards in Los Angeles, Calif., on Jan. 7, 2015. Photo: Reuters/Danny Moloshok", "articleID": "2016090209_00244539_W", "names": {"Jim Parsons": ["Q190972", "Q30605776"]}}, {"date": "2016-09-02", "url": "http://www.thevalleydispatch.com/ci_30321674/guest-list-party-at-center-dcr-scandal-full", "content": "Guest list for party at center of DCR scandal full of VIPs The Lowell Sun Posted: 09/02/2016 03:23:20 PM EDT Roy Sun staff photos can be ordered by visiting our SmugMug site. By Colin A. Young STATE HOUSE NEWS SERVICE BOSTON--The list of guests invited to the July 3 bash thrown by two top Department of Conservation and Recreation officials using state resources is a veritable who's who of the executive branch and the state Republican Party--including cabinet secretaries, department heads, senior advisors and political big wigs. It is unclear who on the invite list--which the Executive Office of Energy and Environmental Affairs provided to the News Service on Friday--actually attended the party, which has landed DCR Commissioner Leo Roy and Deputy Commissioner Matthew Sisk in hot water and suspended from their jobs for a week without pay. Roy and Sisk have paid the state back more than $800 for the state resources they used to plan and host the party, which coincided with the Boston Pops Independence Day dress rehearsal concert at the Esplanade's Hatch Shell, a DCR property. The party was held at a condo owned by Ron Kaufman, the state's Republican national committeeman. Among those invited to the party were: Secretary of Energy and Environmental Affairs Matthew Beaton, Administration and Finance Secretary Kristen Lepore, Revenue Commissioner <mark>Michael Heffernan</mark>, state GOP chairwoman <mark>Kirsten Hughes</mark>, <mark>Baker</mark> Deputy Chief of Staff <mark>Michael</mark> Vallarelli, <mark>Baker</mark> Senior Advisor Tim Buckley, Legislative Affairs Director Ryan Coleman, Deputy Chief of Community Relations and Constituent Affairs Mindy d'Arbeloff, Commissioner of the Department of Energy Resources Judith Judson, Department of Environmental Protection Commissioner Martin Suuberg and 173 others. Advertisement The list provided contains a number of misspellings of people's names, and does not identify invitees by job title. Roy and Sisk used DCR-rented golf carts driven by DCR employees working at the Esplanade to ferry guests from the party to the Hatch Shell for a Boston Pops Independence Day dress rehearsal concert, according to a DCR memo. Earlier this week, Gov. <mark>Charlie Baker</mark> said he was not invited to the party, and said he did not learn of the bash until Beaton reported the misuse of state resources to him, according to an interview transcript provided by the governor's office. \"Let's face it, the most important thing we need to do as an administration, is to retain and manage public trust. And a big part of public trust is ensuring that we're playing by the same rules everyone else plays by,\" <mark>Baker</mark> said, according to the transcript. \"I think the fact they self-referred to the ethics commission, they've paid back any taxpayer funds sends a good message. But I also think the fact that the Secretary suspended them for a week without pay sends exactly the right type of message, which is that this is not the kind of behavior we support and we don't condone it .\" Groups representing both Democrats and Republicans have called on <mark>Baker</mark> to go beyond the one week unpaid suspension handed out to Roy and Sisk and fire both employees. But Democratic Attorney General Maura Healey said she thinks <mark>Baker</mark> has done enough to discipline Roy and Sisk, saying she does not \"think this was an issue of crimes .\" \"I think the administration took the right action. You've got to take swift immediate action. That is intolerable, unacceptable and I'm glad the administration took the action that it took,\" Healey told reporters Thursday at an event in Roxbury. \"The administration took the appropriate action, it appears. I don't know all the specifics of the matter .\" ", "articleID": "2016090219_00699553_W", "names": {"Charlie Baker": ["Q28051620", "Q5076629", "Q5084482", "Q56254750"]}}]