[{"date": "2016-09-02", "url": "http://www.thevalleydispatch.com/ci_30321674/guest-list-party-at-center-dcr-scandal-full", "content": "Guest list for party at center of DCR scandal full of VIPs The Lowell Sun Posted: 09/02/2016 03:23:20 PM EDT Roy Sun staff photos can be ordered by visiting our SmugMug site. By Colin A. Young STATE HOUSE NEWS SERVICE BOSTON--The list of guests invited to the July 3 bash thrown by two top Department of Conservation and Recreation officials using state resources is a veritable who's who of the executive branch and the state Republican Party--including cabinet secretaries, department heads, senior advisors and political big wigs. It is unclear who on the invite list--which the Executive Office of Energy and Environmental Affairs provided to the News Service on Friday--actually attended the party, which has landed DCR Commissioner Leo Roy and Deputy Commissioner Matthew Sisk in hot water and suspended from their jobs for a week without pay. Roy and Sisk have paid the state back more than $800 for the state resources they used to plan and host the party, which coincided with the Boston Pops Independence Day dress rehearsal concert at the Esplanade's Hatch Shell, a DCR property. The party was held at a condo owned by Ron Kaufman, the state's Republican national committeeman. Among those invited to the party were: Secretary of Energy and Environmental Affairs Matthew Beaton, Administration and Finance Secretary Kristen Lepore, Revenue Commissioner <mark>Michael Heffernan</mark>, state GOP chairwoman <mark>Kirsten Hughes</mark>, <mark>Baker</mark> Deputy Chief of Staff <mark>Michael</mark> Vallarelli, <mark>Baker</mark> Senior Advisor Tim Buckley, Legislative Affairs Director Ryan Coleman, Deputy Chief of Community Relations and Constituent Affairs Mindy d'Arbeloff, Commissioner of the Department of Energy Resources Judith Judson, Department of Environmental Protection Commissioner Martin Suuberg and 173 others. Advertisement The list provided contains a number of misspellings of people's names, and does not identify invitees by job title. Roy and Sisk used DCR-rented golf carts driven by DCR employees working at the Esplanade to ferry guests from the party to the Hatch Shell for a Boston Pops Independence Day dress rehearsal concert, according to a DCR memo. Earlier this week, Gov. <mark>Charlie Baker</mark> said he was not invited to the party, and said he did not learn of the bash until Beaton reported the misuse of state resources to him, according to an interview transcript provided by the governor's office. \"Let's face it, the most important thing we need to do as an administration, is to retain and manage public trust. And a big part of public trust is ensuring that we're playing by the same rules everyone else plays by,\" <mark>Baker</mark> said, according to the transcript. \"I think the fact they self-referred to the ethics commission, they've paid back any taxpayer funds sends a good message. But I also think the fact that the Secretary suspended them for a week without pay sends exactly the right type of message, which is that this is not the kind of behavior we support and we don't condone it .\" Groups representing both Democrats and Republicans have called on <mark>Baker</mark> to go beyond the one week unpaid suspension handed out to Roy and Sisk and fire both employees. But Democratic Attorney General Maura Healey said she thinks <mark>Baker</mark> has done enough to discipline Roy and Sisk, saying she does not \"think this was an issue of crimes .\" \"I think the administration took the right action. You've got to take swift immediate action. That is intolerable, unacceptable and I'm glad the administration took the action that it took,\" Healey told reporters Thursday at an event in Roxbury. \"The administration took the appropriate action, it appears. I don't know all the specifics of the matter .\" ", "articleID": "2016090219_00699553_W", "names": {"Kirsten Hughes": ["Q16729963", "Q6416087"], "Michael Heffernan": ["Q16209596", "Q55622979"]}}, {"date": "2016-09-03", "url": "http://heraldscotland.com/opinion/14721998.Iain_Macwhirter__The_timing_of_the_referendum_is_the_biggest_decision_Nicola_Sturgeon_will_ever_make/", "content": "Iain Macwhirter: The timing of the referendum is the biggest decision Nicola Sturgeon will ever make STIRLING, SCOTLAND - SEPTEMBER 02: SNP leader and First Minister of Scotland, Nicola Sturgeon, delivers a speech to party members at the launch of a listening exercise to gauge support for a second referendum on September 2, 2016 in Stirling, Scotland. I / Iain Macwhirter, Political Editor 0 comments IT could be the best of times, or it could be the worst of times. In the next few months, Nicola Sturgeon must make the most difficult decision she will probably ever face in her political career: deciding when to hold the next independence referendum. If she gets it wrong, the cause could be set back a generation or two. It makes the decision over Article 50 look a doddle. If she goes too early, and there's another No, then the referendum route to independence may itself be finished. If she delays too long, and loses office, then the party may never again enjoy the kind of political authority it needs to force a referendum on a reluctant Westminster. It's either a chance that won't come again, or a referendum too far Few doubt that there will be another independence referendum at some stage. The material circumstances have clearly changed since 2014, following Brexit, and Scotland and England are moving further and further apart politically--not least because of Labour's civil war which could leave the Tories dominating Westminster for the next decade. Some, like Alex Salmond's former chief of staff, Geoff Aberdein, are confidently predicting that there must and will be an independence referendum \"within the year\". Others, some of them very close to the First Minister, are predicting precisely the reverse--that she has no thoughts of going for broke until the Brexit fog clears. Loading article content The pro-independence camp, which includes prominent Yessers like the writer/musician Pat Kane and 10s of thousands of activists, believe there will never be a better moment than right now. Brexit has shredded the unionist argument that a vote for independence is a vote for isolation--from Europe and the UK. Scotland is being dragged unwillingly out of the EU with untold economic consequences. There is no \"caring, sharing\" unionist status quo any longer. <mark>Gordon Brown</mark>, who was back last week proposing another round of devolution, seems like a figure from history. Support for the SNP is at historic levels--the latest YouGov poll on Friday had the SNP back up to 52 per cent on the constituency vote. But many activists fear that it can only fall in future through the laws of political gravity, the longer the party is in office. Support for independence is up also on 2014, marginally, at around 47 per cent Yes, to 53 per cent No, according to Professor John Curtice. And while this may not be \"clear and sustained evidence that independence has become the preferred option of most Scots\" --as Sturgeon put it in May--it is headed in the right direction. Look how much support for independence increased during the last independence referendum campaign, say the go-for-it tendency. The iron is still hot: strike it. Others, like the former SNP cabinet minister, <mark>Alex Neil</mark>, want them to cool off. Staging a referendum while the nation is still confused and perplexed by Brexit is foolhardy. Asking people to cut off from the UK, when they have yet to learn what breaking from the EU means, is to invite a negative response from scunnered voters. People are fed up with referendums--two in two years--and need a moment to reflect on where they are--and where the hard borders will be. Once it sinks in that Brexit really does mean that Britain is leaving the EU, voters may be much more receptive to the argument that independence is the only way back into Europe. Moreover, you don't have to accept the GERS methodology to realise that the Scottish economy currently is in a bad way because of the collapse of the oil industry. It's not the end of the world, and many small countries do extremely well without any oil at all--and cope with large deficits. But there is a profound structural change taking place in the Scottish economy right now which makes it very difficult to frame a convincing economic case for independence. Nor is this uncertainty helped by the fact that the Scottish National Party is undergoing a review of its policy on the currency of an independent Scotland--the key issue on which the 2014 referendum turned. History is going the SNP's way, say the ca' canny tendency: don't blow it. Those counselling caution seem to be winning the First Minister's ear right at the moment. But the Scottish National Party is not one that thrives on caution and baby steps. It is a movement that wants to change history, and thrives on bold initiatives that get the blood going. The independence referendum campaign was, for many thousands of people in the Yes campaign, a transformative experience--politically and psychologically. It was an almost revolutionary moment that ignited the fire of political imagination and after which anything seemed possible. Voter registration at 97 per cent: the highest turnout in electoral history. Who wouldn't want to relive that experience? Never before in Scottish history has there been an independence movement like it. Almost overnight, 1.6 million people in Scotland decided that they weren't going to listen to Project Fear. Scotland surprised itself in 2014. It realised that it wasn't just a region of a declining post-imperial power, but a nation in its own right with new possibilities. The centre of gravity of Scottish politics shifted from a default if reluctant unionism, to an assertive, if strictly civic, nationalism. The aftershock was the Tsunami general election of 2015, when the unionist parties were obliterated. Scots already are, to use the cliché, \"independent in the mind\". But it is quite possible to be confident about Scotland's future independence and still be highly cautious about the process of becoming independent. Scotland is a nation with a very long and turbulent history and Scots know from bitter experience that when they indulge in confrontation with their more powerful neighbour they are inclined to come off worst. This has not been an issue for most of the last 300 years because he Union--whatever people think of it now--was in its time an achievement of Enlightenment statesmanship. The Union ended 400 years of almost constant warfare by giving Scotland--or at any rate the Scottish elite--a stake in the emerging British Empire. That's history now. The alliance of convenience between Scotland and England in the Union no longer accords with either nation's interests. Yet Scotland finds itself left umbilically linked to a post-imperial and increasingly isolationist UK defined by financial interests in the City of London and by a Conservative-dominated Westminster. The process of disengagement from the UK is already advanced. The policy of incremental independence begun by Alex Salmond in the 1990s has been extremely successful. Scotland has already gone most of the way to independence without a hint of violence or civil unrest. A major step was the formation of the Scottish Parliament in 1999, which largely restored political autonomy, at least in terms of domestic legislation. Since then, Holyrood has acquired a range of economic powers which fall far short of economic autonomy, but could have provided the basis for a functionally independent Scotland located within the UK. But Brexit threw a spanner in the works. The SNP's over-arching policy of independence in Europe presupposed that the UK would remain in the European Union. Within that context, Scotland could have attained a form of independence through evolution, which would have allowed it to remain both part of the UK and part of Europe. That project, outlined in the 2013 White Paper On Independence, may no longer be viable. Indeed, incrementalism--independence by stealth--may have reached its limits. Of course, this doesn't mean a full-frontal assault is the only way. What may be needed is a re-engineering of the independence project. In addition to the bedrock economic argument, the SNP needs to work through its attitude to globalisation to redefine independence. The extraordinary events in Ireland, where the government has had to appeal against receiving & pound; 11bn in back taxes from Apple, shows the problems faced by small countries dancing with big business. Should Scotland emulate Ireland as some neo-liberals propose, and become a kind of Caledonian tax haven? Or should it continue to emulate the social democratic Scandinavian model, complete with high personal taxation and a big state? Should Scotland automatically seek to return to the European Union, which doesn't appear to be very interested in the welfare of small countries, like Greece, with large deficits? A broader question which the SNP listening cadre will hear asked on the doorstep is whether independence should take precedence over addressing Scotland's lingering social ills, revealed so starkly last week by the Scottish Index of Multiple Deprivation. Last year saw the biggest annual increase in mortality figures in Scotland since the Second World War: 8.5 per cent. Is the NHS sound enough to cope with the shock of independence? With all these questions swirling around, Nicola Sturgeon could be forgiven for having sleepless nights. Fortunately, she isn't. The one thing we know about the First Minister is that she has an astonishing capacity to sustain pressure, as we saw during the independence referendum and the UK general election when she was subject not only to abuse on social media but sustained attack from the combined forces of the UK media and political parties. One thing she isn't going to do is be bulldozed by over-zealous party activists into making a futile if glorious bid for national freedom. She is a utilitarian nationalist, and doesn't go in for romantic consolations of heroic defeat. Nicola Sturgeon's listening exercise--the biggest consultation in the party's history--is of course a delaying tactic: something to keep the activists engaged without actually committing them to a full-scale campaign. The consultation, announced last week, will expose the more gung-ho nationalists, who largely exist in a social media echo chamber, to the large number of Scots who don't want independence, at least not yet. But the new national conversation isn't an exercise in time-wasting. The SNP is very good on the doorsteps, as anyone who has followed them canvassing can confirm. They have a legion of 120,000 motivated and highly persuasive members who will be putting the case for self-government directly to the people who are most in need of persuasion: the older and more middle-class Scottish voters who avoid social media, think JK Rowling is a national treasure and believe the SNP are a bunch of mad cybernats. They will be doing so against the background of Britain's chaotic disengagement from the European Union led by mad Brexiteers. My own view is that the opinion polls underestimate the extent to which Scots of all classes have begun to take independence seriously as a practical project. The euthanasia of the status quo has changed the game. Brexit has all the makings of an historical watershed. A UK dominated by rightwing anti-Europeans, obsessed with immigration and deluded by echoes of empire, has undermined lingering moral attachments to the Union. The process of disengagement from Europe will be a long and trying one in which Scotland's interests will be repeatedly set aside. There is no downside here for the independence movement and no conceivable political threat from Labour or the Tories. So this is probably not be the time for an early referendum. Then again, it very well could be. 0 comments", "articleID": "2016090323_00238475_W", "names": {"Alex Neil": ["Q1515752", "Q1828808"], "Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"]}}, {"date": "2016-09-04", "url": "http://mysanantonio.com/news/article/3M-snow-melt-system-an-option-for-downtown-9202264.php", "content": "http: //www.ourmidland.com/news/article/3M-snow-melt-system-an-option-for-downtown-9202264.php $3M snow-melt system an option for downtown Midland Jessica Haynes, jhaynes @ mdn.net Published 7:30 am, Sunday, September 4, 2016 Midland's Downtown Development Authority is exploring the option of a potential $3 million snow-melt system for the streetscape redevelopment design plan. The DDA's Streetscape Committee recently met to look over the final designs, presented by project managers SmithGroupJJR, MKSK and DLZ of Michigan. While the streetscape features changes such as turning the one-way streets of Ashman and Rodd into two-ways and replacing traffic signals along Main Street with four-way stops in order to make downtown more walkable and less confusing for visitors, the committee is looking to add another pedestrian-friendly feature in the form of a snow-melt system. It is an idea that some downtown business and property owners have indicated interest in, said Selina Tisdale, community affairs director, and prompted some research into cities like Holland and Grand Haven that utilize the system. \"We realize that with the festival streets, we're adding quite a bit of sidewalk width,\" Tisdale said. That extra sidewalk could mean extra work for business owners clearing paths for customers who brave the elements to shop downtown. The snow-melt system is still under review, and is not part of the final design plan as of yet, Tisdale said. The biggest factor is cost: she estimated it could be anywhere from $1.1 to $3 million to install the system, not counting operating and maintaining it through the years. \"We know that won't be an element provided by the foundation support,\" Tisdale said, referring to multiple philanthropic organizations that have indicated funding interest in the streetscape design plan. \"We're keeping it on the table, continuing to explore it, but we know the funding has to come from somewhere and that's still a question at this point .\" She noted a snow-melt system could set downtown Midland apart. Another hot topic for the committee was parking, Tisdale said. It was a subject brought up numerous times by concerned residents, and has resulted in 2.5 blocks of Main Street transitioning to parallel parking. It also means the loss of six parking spaces along the downtown roadway, a decision that Tisdale said the streetscape committee took seriously, weighing the positives and negatives. \"At first we thought it would be a lot more than that,\" Tisdale said. \"We support this design from a parking perspective .\" It is also supported from a traffic perspective, and backed by statistics by Wes Butch from DLZ of Michigan. He was at the committee meeting, and said traffic would need to be 2.5 times heavier than current levels in order to warrant signalized intersections along Main. \"All of these elements, even though they are change, are better for the pedestrians,\" Tisdale said. \"That's the feel the streetscape committee wants for the downtown based on the original community input .\" The next steps for the streetscape design plan include approval by the DDA, and a workshop scheduled for 3 p.m. on Monday, Oct. 3, at City Hall where Midland City Council will have the opportunity to hear about the final design draft and ask questions of the project designers. The workshop is open to the public. \"We really thought this would be a better setting than a council meeting, when they have lots of items to get to on their agenda,\" Tisdale said. The final design draft would then be forwarded to the city council for formal approval at either its regular meeting on Oct. 10 or 24, where the DDA will seek approval to fund the next step: the engineering design phase, estimated at $500,000 to be paid by the DDA. As for the cost of the entire streetscape project, a previous estimate of $7 million is now closer to $9 million and would increase if the snow-melt system is included. Construction could begin as early as spring 2017, and the DDA is hopeful it could be done in one phase of construction. \"We're focused and committed to making this as painless as possible for downtown businesses. They want what's coming down the pike,\" Tisdale said. For Tisdale, the streetscape project is a way to continue the legacy of people who worked hard to bring downtown back from the brink in the early 1990s. \"We have to continue to make Midland forward-moving, forward-thinking,\" Tisdale said. \"A place where people continue to come, where businesses want to continue to be .\" The Next Story Hawaii tourists salvage vacations during hurricane threats Texans activate J.J. Watt Rick Porcello tosses gem, Red Sox rout Athletics once again Last-minute touchdown lifts Western to season-opening victory Oak Ridge outlasts Elkins State court hands Houston cop killer a stay weeks before...Conner stars in return from cancer, Pitt tops Villanova 28-7 3 & out: Takeaways as Jake Browning, <mark>John Ross</mark> lead Huskies'...Astros' Brady Rodgers has rough outing in MLB debut UTSA notepad: Wilson impressed by Spirit Walk Today's Deals Powered by SHOP NOW Ozark Trail 10x10-Foot Gazebo w /...WalmartPosted 1 day 13 hr ago SHOP NOW Mainstays Essential True Colors Wash.. . WalmartPosted 1 day 9 hr ago SHOP NOW Google Chromecast Audio Media Player...WalmartPosted 3 days 6 hr ago SHOP NOW Refurb Garmin Forerunner 620 Watch...WalmartPosted 1 day 1 hr ago View Comments & copy; 2016 Hearst Communications, Inc. .", "articleID": "2016090412_00384483_W", "names": {"John Ross": ["Q11727979", "Q1701610", "Q19661432", "Q21063323", "Q27925053", "Q43380308", "Q43911093", "Q56254622", "Q6255678", "Q6255693", "Q6255697", "Q7252813"]}}, {"date": "2016-09-07", "url": "http://www.slashfilm.com/avatar-sequels-family-saga/", "content": "The \"Avatar' Sequels Will Be A Family Saga About Jake, Neytiri And Their Children Posted on Wednesday, September 7th, 2016 by Peter Sciretta We have four sequels coming over the next seven years, with the first movie hitting theaters in 2017. Writer/Director <mark>James Cameron</mark> has revealed new details about Avatar 2 and the other Avatar sequels. Find out the details, after the jump. Avatar In a new interview with Variety, Avatar series writer/director <mark>James Cameron</mark> reveals that the Avatar sequels will actually be a family saga:\" The storyline in the sequels really follows Jake and Neytiri and their children. It's more of a family saga about the struggle with the humans. \"We had heard earlier rumors (which we did not report) that suggested that Jake Sully (Sam Worthington) would marry Neytiri (Zoe Saldana) and become the new chief of the tribe and that the story would partly follow the struggle of the war with the humans which threatens to tear their family apart. It seems like those rumors might have been on the money with the Sully family being set-up to be the Skywalkers of the Avatar franchise. And is still scheduled to hit theaters in Christmas 2018, but <mark>Cameron</mark> warns that could change (again): Avatar 2\" We haven't moved that target yet, but we will if we need to. The important thing for me is not when the first one comes out but the cadence of the release pattern. I want them to be released as close together as possible. If it's an annual appointment to show up at Christmas, I want to make sure that we're able to fulfill on that promise. \"The new interview with <mark>Cameron</mark> it to promote Cirque du Soleil's stadium show that opened in Montreal in November of last year and is now touring North America. I have tickets to see the production when it comes to Los Angeles later this year. Toruk--The First Flight <mark>Cameron</mark> admits that while doesn't directly connect with the upcoming Avatar sequels, thematically the show\" manages to land very very closely to the feeling of where the sequel stories are going. \"He says that\" some of the costumes and hairstyles \"might\" create a resonance \"so that\" you actually see some of the things that you see in Toruk come into the design of the films, \"whatever that means. <mark>Cameron</mark> gave Cirque\" full rein to just riff on what they had seen in the Avatar world from the first film \"but he\" chimed in to make sure the project didn't steer too far afield from his central vision for the films,' giving the example: Toruk \"There's a tendency sometimes to go a little beyond the spiritual mysticism in the movie into actual magic. They can't have any actual magic, because it's not a universe that allows for true magic. But it definitely exists in a kind of a mystical, spiritual realm. The films do, and the show definitely does as well. It was that kind of creative conversation .\" This statement is interesting especially since the world of Pandora contains shamans. This gives us an idea of where the Avatar sequels won't be headed. Previously we have been told that all of the films will be stand-alone movies that continue the ongoing story of this world (in other words sequels that have a beginning middle and end). The story will have both bad and good humans, and bad and good Na' vi, and will give us a look at Pandora's other environments, most notably the world we have yet to see under the water. The films will feature many of the original cast reprising their roles, including Stephen Lang as Colonel Quaritch and Sigourney Weaver as Dr. Grace Augustine.", "articleID": "2016090723_00250915_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}}, {"date": "2016-09-08", "url": "http://www.canindia.com/n-korea-rejects-un-censure-of-missile-test/", "content": "Pyongyang, Sep 8 (IANS) North Korea on Thursday strongly criticised the UN Security Council's condemnation of its latest ballistic missiles test. <mark>Kim Jong-un</mark>'s regime said it \"categorically rejects\" the declaration and considers it \"an intolerable act of encroaching upon its dignity, right to existence, sovereignty and right to self defence\" , EFE news cited KCNA as saying. The UN executive body on Tuesday released a unanimous declaration by all member countries, strongly condemning the latest ballistic missile tests by North Korea. It also urged Pyongyang to stop violating UN resolutions that prohibit the country from developing or testing ballistic missile technology. North Korea on Monday test-fired three ballistic missiles from Hwangju in North Hwanghae province at around 12.14 p.m.. The launch was the first since the successful firing of a submarine-launched missile on August 24. It said the recent launch was conducted successfully without harming the security of neighbouring countries or the international waters. In its declaration, the UN also urged all countries to \"redouble their efforts\" to ensure that the existing sanctions against North Korea are fully implemented and warned of the possibility of fresh sanctions against Pyongyang. The UN Security Council imposed strong sanctions against North Korea in March, following nuclear and long-range missile tests by the country in January and February, respectively .--IANS ss/dg Tags countries country North Korea right", "articleID": "2016090807_00095250_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}}, {"date": "2016-09-08", "url": "http://www.espn.com/blog/nflnation/post/_/id/213422/sam-bradfords-task-with-vikings-is-like-learning-a-new-language", "content": "comment MINNEAPOLIS--Deciding whether Sam Bradford will start at quarterback for the Minnesota Vikings on Sunday appears to depend on how quickly he can run the team's offense at a workable level. There's not much mystery about whether the Vikings want to put Bradford on the field soon. As Tennessee Titans coach Mike Mularkey said Wednesday, like a man calling the bluff of a card player across the table, \"They wouldn't give up a [No .] 1 and a [No .] 4 [draft pick] to have him sit very long .\" But what the Vikings want to do and what they can manage in the days before their season opener at Tennessee are different things. It seems, then, that we should spend a minute or two discussing what NFL teams mean when they talk about the challenge of learning a system. At a base level, there's plenty of shared material in different playbooks; there are only so many routes an NFL team can run. The minutiae behind those routes, though--the language used to call them, the depth at which they're run and the adjustments they take on against different coverages--is the secret sauce that make one team's offensive recipe different from another. And those are the things that take time to learn. Wide receiver <mark>Charles Johnson</mark> said \"how things are called\" is the biggest difference between systems. \"Some people have concept-based systems. We've got numbers, with a little bit of concepts here,\" he said. \"I'm sure Sam has been in both styles of offense. He's picked it up well so far .\" What does <mark>Johnson</mark> mean by numbers versus concepts? It has to do with how routes are communicated in a play call. In the Air Coryell system that Vikings offensive coordinator Norv Turner has used to great effect in his career, routes are assigned a number from 0-9, with larger numbers generally corresponding to routes that break farther down the field. A \"9\" route is a go route. An \"8\" route--as in the famous \"Bang 8\" play from Turner's days as Dallas Cowboys offensive coordinator--refers to a post route. A \"7\" route is a corner route. And so on. The other popular school of thought, usually associated with the West Coast offense, generally requires quarterbacks to call out each route concept by name in a play call, which leads to more terminology and requires more memorization. As <mark>Johnson</mark> said, the Vikings primarily use numbered routes, but they have a few wrinkles that include names of route concepts. Bradford is on his fifth coordinator in his seventh season in the league, and he has played in everything from Air Coryell and West Coast schemes to Chip Kelly's spread offense. On some level, he has a broad enough exposure to different ideas that he won't encounter much that is new to him. The presence of Pat Shurmur--Sam Bradford's offensive coordinator in St. Louis and Philadelphia--on the Vikings' staff has been comforting to the recently arrived QB. AP Photo/Jeff Roberson \"Sam's been in this league a long time,\" <mark>Johnson</mark> said. \"I say it all the time: The NFL is a copycat league. If you've seen somebody run a' 4' route, it's a' 4' route. You know what a curl route looks like. He's been around football long enough. He knows what a curl route looks like. He's just got to get used to how we call the plays, our depths, all that kind of stuff .\" One thing <mark>Johnson</mark> mentioned, though, can only be mastered with repetitions in practice: NFL teams tell receivers to break on their routes at different yardage markers, which means quarterbacks have to develop a feel for the specific timing with each receiver on each route. It's why you often hear QBs talk about the value of offseason work with their receivers, and why Bradford's task this week is as much art as it is science. \"Obviously, it's not ideal,\" Bradford said. \"Normally you have an offseason. You have a summer to at least work on some of that timing, but I just think that means that every rep we get in practice is more important. We've got to be focused. I've got to be focused. We've got to take advantage of every throw in practice, get throws after practice and make sure that we're all on the same page .\" The presence of Vikings tight ends coach Pat Shurmur, who was Bradford's offensive coordinator in both St. Louis and Philadelphia, has helped some, Bradford said. \"He's not the quarterback coach here, so it's a little bit of a different role, but just having that familiar face--someone that, if I do have questions and I need to refer to an old language, I can go up to Shurm and say,\" Hey, can you kind of explain this in terms that we've done in the past?' \"Bradford said .\" In that regard, Shurm's been awesome. \"All of this explains why Bradford's task is so tall this week. In addition to learning the Vikings' playbook and developing timing with his receivers, he has had to get a grasp of protection calls, checks at the line of scrimmage and variations his receivers might run based on the coverage they see. It's not so much akin to quantum physics as it is something more practical, like becoming at least conversational in a foreign language. In a week .\" Normally, when you go into a game week, you already have a pretty good grasp of what you're doing offensively, \"Bradford said .\" You spend a lot of time studying the opponent and what they're doing on defense. It's been a little more difficult than it normally is, because as much as I'm trying to study Tennessee, I'm probably studying even more of our playbook, making sure I'm comfortable with what we're doing offensively. \"", "articleID": "2016090811_00083275_W", "names": {"Charles Johnson": ["Q11318333", "Q14918507", "Q16222225", "Q18001378", "Q41384499", "Q5079554", "Q5079555", "Q5079557", "Q5079558"]}}, {"date": "2016-09-09", "url": "http://silverscreen.in/tamil/tamil/vaaimai-review-beyond-jurisdiction-rhyme-reason/", "content": "Vaaimai Review: Beyond The Jurisdiction Of Rhyme Or Reason Distraction Free Reading Advertisement A Tamil film inspired by the Hollywood classic 12 Angry Men, is a big stretch for the imagination. The first fail is the whole premise of the film--there is no jury system in Indian courts. Not since the Nanavati case. And no amount of adaptation would get us past this stumbling block. ***** Vaaimaai, written and directed by <mark>Senthil Kumar</mark>, that had been lying around in the cans for quite a few years is finally out. Once open, the contents of this Pandora's Box cannot be unseen. Its \"star cast' boasts an array of retired actors: Thiagarajan, Giundamani, Ramki, Manoj Bharathi, Poornima Bhagyaraj (and Shanthanu Bhagayaraj, another important member of the cast, not belonging to this category is unfortunate). Prithvi Pandiarajan plays Velan, a daily-wage worker who is sentenced to death for killing a politician. His mother, played by Poornima Bhagyaraj, is also arrested for allegedly assisting him in the murder. And since she doesn't have an alibi, the\" nation feels' that she must be hanged too. There are people chanting \"Eye for Eye, Die for Die\" --taking poetic license with grammar, the legal discourse, justice, and what should or shouldn't be their business, to name a few things--outside the court. Then, the judge orders a jury to take a decision on the issue. This metamorphosis of the Indian legal system, however, isn't exactly poetic. ***** Then come the mindboggling members of the jury, introduced by Vijay Sethupathi's voice: Thiagarajan as Gen. Dheenadhayalan, under whose leadership India won the Kargil War (but that matters least compared to his other attribute as the voice insists, \"he has a good dressing sense\" ); Manoj Barathiraja, who is a great actor and writer; Goundamani as a neurologist named Benny Quick (or Penniquick--we have stopped caring). ***** The jury confronts evidence that is elementary even for a 10-year-old, but not so for the judge. And as the jury is in conference, the judge sits on the roof of the court reading the newspaper (because current affairs cannot wait?). The music seems to have been provided by the Demo function on Casio keyboards for kids. The music director has also randomly pushed the \"special' keys for noises of airplanes, exploding bombs etc. (because it is there?). ***** The only redeeming quality about the film is that it is 95 minutes long--it could have been 96! ***** The Vaaimai Review is a Silverscreen original article. It was not paid for or commissioned by anyone associated with the movie. Silverscreen. in and its writers do not have an advertising relationship with movies that are reviewed on the site.", "articleID": "2016090907_00383560_W", "names": {"Senthil Kumar": ["Q14931905", "Q6323469"]}}, {"date": "2016-09-10", "url": "https://politicslk.wordpress.com/2016/09/10/ban-ki-moons-lament/", "content": "Did the United Nations Secretary General Ban Ki Moon commit a Hanuman when he spoke of the Ruwanda and Srebrenica massacres with our war against terrorism in the same breath? The Joint Opposition believes our country's image was deliberately tarnished--especially ahead of the upcoming war crimes probe proposal. Skills Development and Vocational Training Minister Mahinda Samarasinghe, in a special media briefing, insisted that the media had got it wrong. The UNSG, he stated, never compared Sri Lanka to the aforementioned massacres, but mentioned situations that had been far worse than in Sri Lanka. The UN Spokesperson Farhan Haq however simply stated that the UNSG's words spoke for itself. Ban's exact words were, \"Something more terrible, serious happened in the past. In 1994, in Rwanda, there was a massacre. More than one million people were massacred. United Nations felt responsible for that .\" Of course, it was their war and massacres. But the United Nations was not able to act on it. We said repeatedly, \"Never again, never again'. It happened just one year after in Srebrenica .\" Again, many people were massacred when they were not fully protected by the United Nations Peacekeeping Operations. So we repeated again, \"Never again' .\" How many times should we repeat never, never again? We did again in Sri Lanka. We have to do much more not to repeat such things in Sri Lanka, Yemen and elsewhere. \"Interestingly, the UN.org skips over this contentious quote and highlights that while Ban\" commended efforts to move forward on a comprehensive transitional justice agenda and on a constitutional reform process, as well as symbolic steps such as the decision to sing the National Anthem in Sinhala and Tamil on the country's Independence Day last February, he had said, \"These steps have built confidence and trust, and strengthened transparency and accountability. But more can and should be done to address the legacy of the past and acknowledge the voices of the victims...There is still much work to be done in order to redress the wrongs of the past and to restore the legitimacy and accountability of key institutions, particularly the judiciary and the security services' .\" UN.org also highlights from Ban's speech, \"Here in Sri Lanka, the world's work for human rights faced one of its most difficult tests. The decades-long civil war saw terrible violence, terrorism, the use of human shields and other grievous violations of human rights and humanitarian law. In the conflict's decisive final stages, tens of thousands of civilians perished. The war was ended--an unquestionable good for Sri Lanka, the region and the world. But we also know that even in its ending, the price was high .\" I again commend Sri Lankans for examining the difficult period you have now begun to leave behind. I am sure those efforts will continue to generate important lessons for the international community that can save many lives in many places. \"It is very interesting how Ban came to the conclusion that\" tens of thousands of civilians perished \". He is beholden to expose his source that other respective official reports had not had access. It is also very interesting how Sri Lankans examining this\" difficult period \"will\" generate important lessons for the international community that can save many lives in many places \". Be that as it may, disputing the JO Leader Dinesh Gunwardena interpretation of Ban's remarks, Acting Foreign Minister Dr <mark>Harsha de Silva</mark> opinionated in Parliament that Ban's visit and remarks improved Sri Lanka's image overseas. On that note, it is pertinent to visit the Ruwanda and the Srebrenica massacres that were subsequently ruled as those constituting genocide. The Rwandan Genocide The majority Hutu aimed to totally cleanse the minority Tutsi from Rwanda in 1994. From April 7 to mid-July, it is estimated that as many as 70 percent of the Tutsi and 20 percent of the Rwandan population perished. Hutu, Tutsi and Twa are the main groups in Rwanda, sharing the common language Banyarwanda. Hutu and Tutsi were of the same ethnicity, but of different castes. Traditionally, Tutsi herded cattle while Hutu farmed the land. Since 18th century, Tutsi became the more dominant and in a corvee system Hutu were forced to work for Tutsi Chiefs. The colonial era did not improve Hutu. s situation. Their traditional land was privatized, but were hardly compensation. Though the Belgians modernized Rwanda with large scale projects in health, education, agriculture and public works, Hutu were disenfranchised and subject to large scale forced labor. After World War II, Hutu began to agitate for their freedom. Tutsi also began to agitate for independence on their own terms. In the resulting clashes, the Belgian administration sided with Hutu and Rwanda regained its independence in 1964 with a Hutu dominated republic. To avoid Hutu reprisals, more than 300,000 Tutsi fled to neighboring countries and remained in exile for three decades. Tutsi refugees formed armed groups and frequently attacked Rwandan territory, which led to a cycle of further reprisals on Tutsi and more exiles. With President Juvenal Habyarimana ascending to power in 1973, violence against Tutsi reduced somewhat. However, Tutsi refugees continued to seek a military intervention. Chiefly, the Rwandan Patriotic Front with the backing of Uganda engaged in a guerrilla warfare. After the second peace negotiation attempt, in 1993 the two parties agreed on the Arusha Accords. It accommodated RPF in the Broad-Based Transitional Government as well as in the national army. The peacekeeping force, United Nations Assistance Mission for Rwanda arrived and the RPF were given room in the national parliament building for use during the setting up of the BBTG. These peace negotiations earned Habyarimana enemies from both his government and military. This also saw the rise of several radical youth militia. Many of them were trained and armed with machetes and so on by the army during the early ’90s to combat RPF led terrorism. There was also a concentrated racist propaganda against Tutsi's. In 1993, Burundi's first ever Hutu president was assassinated by Tutsi army officers. This further exacerbated the feelings of mistrust and reinforced Tutsi as the enemy. On January 11, 1994, UNAMIR commander, General Romeo Dallaire, warned UN headquarters that plans were afoot for Hutu militia to kill Belgium members of UNAMIR to force their withdrawal. Though the commander requested permission to protect his source and his family, the then UNSG Kofi Annan refused the operation--even after the commencement of the genocide. His reasons are unclear as the UNAMIR was established with the consent of both parties to the conflict. Thus the intervention would have been by the UN and not a member state. Then, UNAMIR could not be charged with intervening as it was requested and consented by both parties and authorized by the UN Security Council. On April 06, President Habyarimana was assassinated. The crisis committee that formed refused to allow PM Agathe Uwilingiyimana to take over--even though Dallaire insisted. When 10 Belgium soldiers from UNAMIR escorted her to Radio Rwanda to address the nation, soldiers and civilians overwhelmed her escort and forced them to surrender their weapons. They were then tortured and killed. PM and her husband too were killed. That night and the following day, prominent politicians and journalists were hunted down and killed. Dallaire notes, by April 07 noon, the political leadership was either dead or hiding. Anarchy and genocide followed. The military hierarchy blamed the RPF for the president's assassination and ordered the Hutu to\" begin their work \"and spare none--not even babies. In villages where families knew each other, Tutsi were easily identified and killed. In towns, roadblocks were set and Tutsi identified by their identity cards. They were then summarily executed. HIV-infected men were formed into\" rape squads \". Tutsi women and even Hutu women who were married to Tutsi men or harbored Tutsi were raped. In the aftermath, many survivors were infected with HIV and/or with unwanted pregnancies. It is estimated that in the first six weeks, as many as 800,000 Rwandans were killed. Yet, except for the advancing RPF, there was no other counterforce. UNAMIR were expressly forbidden to intervene, except in self defense. On June 23, a French-led UN force of about 2,500 soldiers entered Rwanda. That humanitarian mission went awry when the genocidal authorities also displayed the French flag on their vehicles, luring Tutsi from their hiding. Interestingly, at the beginning, the French launched a military operation with Belgians' and UNAMIR's assistance to evacuate expatriates from Rwanda. They however separated Tutsi spouses and only evacuated their families of foreign nationality. Those who boarded the evacuation trucks were forced off at checkpoints, where they were killed. The French, who were close to Habyarimana and regarded the RPF as a threat to their influence, however rescued several high profile members of Habyarimana's government. As RPF slowly gained control, Hutu en masse, fearing reprisals, fled to neighboring countries. By July 18 the genocide was officially over. The Srebrenica Genocide Following WWI, Bosnia was incorporated into the South Slav kingdom of Serbs, Croats and Slovenes, which together was named Yugoslavia. As Yugoslavia began to disintegrate, a referendum for independence was held on February 29, 1992. At the time, the Bosnian multiethnic composition comprised 44 percent Bosniaks, 31 percent Orthodox Serbs and 17 percent Catholic Croats. Bosnian Serbs firmly rejected the results, which was in favor of independence. However, the European Community (former European Union) and America formally recognized the Republic of Bosnia and Herzegovina. Bosnian Serbs, with the support of Serbian Government of Slobodan Milosevic and the Yugoslav People's Army (JNA), attacked the newly formed republic to unify and secure Serb territory. The region around Srebrenica (Central Podrinje), a predominantly Bosniak area was of primarily strategic importance to Serbs. Without it, their new political entity, Republika Srpska had no territorial integrity. Therefore, they engaged in ethnic cleansing of Bosniaks from Bosniak ethnic territories in eastern Bosnia and Central Podrinje. In the bitter conflict for territory, Srebrenica remained isolated in the Serb-controlled territory. Their only link to the Bosnian controlled land was Zepa. The advancing Serb military cut off this link and reduced the Srebrenica enclave to 150 square kilometers. As residents of these outlying areas sought refuge in the Srebrenica town, its population swelled to 50,000-60,000. When Commander of the UN Protection Force (UNPROFOR), General Philippe Morillon of France visited Srebrenica in 1993, the town was overcrowded and under siege. There was no running water as the Serbs had destroyed the water supplies, proper electricity and scarcity in food, medicine and other essentials. He assured the panicked residents that they were now under the UN protection and would never be abandoned. The UN High Commissioner for Refugees (UNHCR) began to evacuate thousands of Bosniaks. The Bosnian Government however opposed the move. They pointed out, it would contribute to the ethnic cleansing. Even after Serbs warned via UNHCR that the town would be attacked in two days unless Bosniaks surrendered and agreed to be evacuated, Bosniaks refused. From 1992-1995 the besieged population was deliberately starved. The world attention was centered on the fight for Sarajevo and the peace process. Srebrenica, located in eastern Bosnia was far removed geographically from Sarajevo. Thus, its rapidly deteriorating plight rarely came to focus. Only Dutchbat--the fourth tier in the UNPROFOR command chain--was assigned responsibility for the Srebrenica Safe Area. While Dutchbat was dependent on UNPROFOR for crucial supplies as fuel, it was largely expected to obtain its supplies from the Netherlands. On April 16, 1993, the UN Security Council passed the resolution demanding that Srebrenica and its surrounding areas be considered a safe area and free from all hostile acts. On May 8, it was agreed to demilitarize Srebrenica. The Bosniak forces within the enclave were to handover their weapons, ammunition and mines to UNPROFOR. Serbs would then to withdraw their heavy weapons and units. This safe area agreement was violated by both parties. The Bosnian Government Forces used the safe area as a convenient base to launch counter offensives and UNPROFOR failed to prevent. The Serb Forces prevented Dutchbat personnel, equipment and ammunition from getting through to Srebrenica. UN headquarters issued specific instructions to UNPROFOR not to be zealous in searching for Bosniak weapons and that the Serbs must withdraw their heavy weapons before Bosniaks gave up their weapons. The Serbs did not withdrew their weapons. By early 1995, fewer supply convoys made it through to the enclave and even the UN forces started running dangerously low on the essentials. On July 06, Serb offensive began in earnest and UNPROFOR posts rapidly fell. The Dutch soldiers either retreated in to the enclave or surrendered. NATO bombers could not attack VRS artillery positions due to poor visibility. Then it was cancelled altogether when VRS threatened to kill Dutch and French military hostages and attack locations with 20,000-30,000 civilians took refuge. That evening, Dutchbat commander was captured on film, drinking a toast with General Mladic. In the following days and months to come, as Dutchbat failed to protect Srebrenica from capture, boys and men, mostly but not necessarily of fighting age, were systematically rounded and mowed down en masse. Girls as young as nine were gang raped and infants who cried had their throats slit. Though 25,000-30,000 women, children and elderly were forcibly transferred, it is charged that not all buses reached safety. It is baffling how Sri Lanka came out smelling of roses when Ban laments that the UN failed in Rwanda, Srebrenica and again in Sri Lanka. This government insists that the international community is good with Sri Lanka. However, Ban grouping Sri Lanka with these carnage indicates otherwise. Hence, it is imperative for the government to stop playing politics with national security and immediately rectify this misconception. After all, our war was not one without witnesses as India, America and other prominent diplomatic bodies played a significant role in bringing humanitarian aid to the civilians held hostage by the terrorists. Like this: Like Loading...Related", "articleID": "2016091005_00478380_W", "names": {"Harsha De Silva": ["Q56254066", "Q5673820"]}}]