[{"date": "2016-09-09", "url": "http://stv.tv/sport/football/1366542-kilmarnock-boss-hails-kris-boyd-s-courage-following-brother-s-death/", "content": "Kilmarnock boss hails Kris Boyd's courage following brother's death PA 9 September 2016 Share via email Share via Facebook Share via Twitter Share via Whatsapp Striker made emotional speech to squad after Scott Boyd, 27, was found dead at his home. Respect: <mark>Lee Clark</mark> says Kris Boyd will receive whatever support he needs after his brother's death. SNS <mark>Lee Clark</mark> has revealed Kris Boyd delivered an emotional speech to the Kilmarnock squad following the death of his younger brother. Scott Boyd, 27, was found dead at his home in the Ayrshire village of Auchinleck on Wednesday. Manager <mark>Clark</mark> expressed his condolences to Boyd and his family following the tragedy and says he will let the striker make his own decision over featuring against Dundee on Saturday. \"It has been tough for the football club since we learned the news on Wednesday morning,\" he told Press Association Sport. \"Our supporters, the board and everyone connected with the football club send their deepest condolences to Kris and his family .\" I addressed the players on Wednesday and Kris came in today and addressed the players. \"It was emotional for everybody. It was emotional for me, the staff, for the players because we are very close .\" It was a delivery of a speech from a very strong character, a very experienced man. \"Him and his family have had an horrendous few days and it was very emotional but it shows me that the group has a tremendous togetherness and we will stay strong for him .\" Whatever Kris needs, we will support. We will be there every step of the way, whatever is needed. \"I have been speaking to Kris since the horrendous news and it will be left up to him, it is his decision, whether playing or training. I will be guided by him .\" The best tribute to Kris, his family and his late brother, that we can go there (Dundee), put on a performance and get the win. \"Midfielder Greg Kiltie could miss the next month after a hamstring injury suffered earlier this season, flared up again. Share this article Share via email Share via Facebook Share via Twitter Share via Whatsapp", "articleID": "2016091011_00581610_W", "names": {"Lee Clark": ["Q2608437", "Q6513299"]}}, {"date": "2016-09-12", "url": "http://ctpost.com/business/article/Culinary-incubator-finds-fast-success-in-Stamford-9217902.php", "content": "http: //www.stamfordadvocate.com/business/article/Culinary-incubator-finds-fast-success-in-Stamford-9217902.php Culinary incubator finds fast success in Stamford By Paul Schott Published 3:56 pm, Monday, September 12, 2016 Photo: Paul Schott / staff Photo Image 1of/3 Caption Close Image 1 of 3 In the Flavorism culinary incubator at 207 Greenwich Ave., Puebla Grill chefs Adlin Fleurancy, left, and Plinio <mark>Lopez</mark>, right, prepare orders, while Flavorism culinary director Wayne Homsi looks on. In the Flavorism culinary incubator at 207 Greenwich Ave., Puebla Grill chefs Adlin Fleurancy, left, and Plinio <mark>Lopez</mark>, right, prepare orders, while Flavorism culinary director Wayne Homsi looks on. Photo: Paul Schott / staff Photo Image 2 of 3 Image 3 of 3 Mason/Dixon Smokehouse co-owners <mark>Alejandro Lopez</mark> and Nestor Laracuente stand in front of their meat smoker, in their space at the Flavorism culinary incubator at 207 Greenwich Ave. Mason/Dixon Smokehouse co-owners <mark>Alejandro Lopez</mark> and Nestor Laracuente stand in front of their meat smoker, in their space at the Flavorism culinary incubator at 207 Greenwich Ave. Photo: Paul Schott / staff Photo Culinary incubator finds fast success in Stamford 1 / 3 Back to Gallery STAMFORD--The table was already set for the chefs when they arrived this summer to start their enterprises at 207 Greenwich Ave. They would walk into a refurbished South End building that included a commercial kitchen and a dish room. They would have a website ready to take orders and a fleet of delivery drivers prepared to transport their food. All they would have to do is cook and handle personnel matters in this culinary incubator launched last month by the Stamford startup Flavorism. \"What we're trying to do is save all these operators money so that they focus more of their revenues on ingredients and labors,\" said <mark>Jon Brennan</mark>, Flavorism's marketing director. Flavorism operates as an online, delivery-only service for local gourmands, who can pick out and combine dishes in one order from the various menus from flavorism.com, in the same way that they would shop for a range of brands on Amazon. The Flavorism kitchen delivers to customers in Stamford, Greenwich and Darien. Even in a crowded and competitive culinary market like Stamford, Flavorism can stand out, <mark>Brennan</mark> said. More Information For more information about the culinary incubator Flavorism, visit www.flavorism.com \"When they design a menu, it's designed specifically for delivery,\" <mark>Brennan</mark> said. \"It completely changes how the food is prepped, even what ingredients they're using, the menu content .\" Three startups based in the Flavorism complex are already taking orders: TBC Pizza Co.; Puebla Grill, which makes Mexican cuisine; and Fahrenheit 760, which uses a wood-fired oven and features a menu with French-Canadian influences. Fahrenheit 760's owner Wayne Homsi also serves as Flavorism's culinary director, a position that involves advising the other chefs in the Flavorism kitchen. The shared space encourages the chefs to share ingredients and ideas, he said. \"I'm here as a sounding board for other people,\" Homsi said. \"We're working in the same place, but we're a team. Everybody can learn from everybody else .\" Other chefs who work in the hub said that they have thrived in the new space. \"It's a good environment,\" said Puebla Grill chef Adlin Fleurancy. \"It's somewhere you get new ideas every day .\" Mason/Dixon Smokehouse is the sole enterprise in the Flavorism building that has its own brick-and-mortar restaurant. The new barbecue restaurant is scheduled to next month replace Gastro Bar at 78 West Park Place. The owners said that they needed an off-site location for their meat smokers because they said their landlord would not let them keep the apparatus at the downtown property. \"We couldn't have asked for a better place,\" said Nestor Laracuente, a Mason/Dixon co-owner and the restaurant's pitmaster. \"You would think this guy built this spot just for us. So far, it's been working out really well. I feel we complemented each other in a bunch of different ways .\" The owners of the startups pay a lease to operate in the Flavorism center. Flavorism takes a cut of the income from the orders, a share that amounts to about 7 percent of all revenues, according to <mark>Brennan</mark>. The next two brands in the Flavorism network, Aji Ramen and Farmers Palette, are set to launch within the next few weeks. Flavorism executives are eyeing an expansion beyond the Stamford kitchen, which formerly served as a local base for Airgas. The company is developing plans for incubators in Fairfield and Brooklyn, N.Y.. But Flavorism's focus remains its Stamford hub, in which it has invested about $500,000. The Greenwich Avenue complex could eventually host 20 brands, <mark>Brennan</mark> said. \"We're going to fill the building with a mix of cuisines,\" <mark>Brennan</mark> said. \"My goal is to have the most diverse group of people, because they'll all benefit from each other .\" pschott @ scni.com; 203-964-2236; twitter: @ paulschott Today's Deals Powered by SHOP NOW Athletic Works Men's Active Tee for...WalmartPosted 21 hr 35 min ago SHOP NOW Walmart Dare To Compare Sale WalmartPosted 6 days 10 hr ago SHOP NOW Hyper-Tough 57-Piece Plumber Tool Set...WalmartPosted 8 hr 50 min ago SHOP NOW Refurb HP Probook Intel i5 Dual 14 \"...WalmartPosted 5 days 2 hr ago Most Popular 1 Man murdered Saturday night in Bridgeport 2 Motorcycle crash disrupts 9/11 ride in Fairfield 3 Sources: Bar cars returning to New Haven Line trains on Metro...4 Woman arrested after alleged poolside assault 5 Man accused of blocking exit 6 TLC star arrested on child rape charge 7 Police: Fairfield man says friendly escort stole $500 View Comments & copy; 2016 Hearst Communications, Inc. .", "articleID": "2016091220_00741741_W", "names": {"Alejandro Lopez": ["Q4714585", "Q4714587"], "Jon Brennan": ["Q59316526", "Q6270439"]}}, {"date": "2016-09-13", "url": "http://k2radio.com/councilman-fights-to-legalize-skateboarding-in-downtown-cheyenne/", "content": "Councilman Fights to Legalize Skateboarding in Downtown Cheyenne By Joy Greenwald September 13, 2016 8:19 AM Share on Facebook Share on Twitter Thinkstock Cheyenne City Councilman <mark>Richard Johnson</mark> is working to repeal a section of city code which prohibits skateboarding in the downtown area. \"I've been fighting this battle since 1988 when I was 14 years old,\" said <mark>Johnson</mark>. \"I've basically had this argument with almost three different mayors .\" <mark>Johnson</mark>, who started skateboarding in 1985, says he understands some downtown business owners may be reluctant to get on board with the idea. \"One thing people don't seem to realize about skateboarders is they want to be left alone, so they go seek places that there's not a lot of traffic,\" said <mark>Johnson</mark>. \"They don't want to be bothered, just like they don't want to bother downtown business owners .\" <mark>Johnson</mark> says even if skateboarding becomes legal downtown, it would still be illegal to skate in places that have \"No Skateboarding' signs, like the Depot Plaza .\" Anywhere that there's a \"No Skateboarding' sign, even if it's not on the books, it basically could still be classified as a trespassing charge,\" said <mark>Johnson</mark>. <mark>Johnson</mark> says while there is a skate park in Brimmer Park, it's not a convenient location for many teens. \"Say you live over by the base or say you live in Sun Valley or Saddle Ridge or even up north,\" said <mark>Johnson</mark>. \"If your skateboard is your only means of transportation, you literally have to skate several miles to reach the central facility .\" The City Council's Public Services Committee will take up the issue when it meets on Tuesday, September 20 at noon. \"I didn't go fish for votes, this is just something I'm passionate about,\" said <mark>Johnson</mark>. \"Fifteen-year-old <mark>Richard</mark> would really be upset with 42-year-old <mark>Richard</mark> if he was elected to City Council and didn't do anything about this .\" Category: Casper News Share on Facebook Share on Twitter More Leave a comment Send to a friend! Print this page Pin it! Reddit This! Share on Tumblr!", "articleID": "2016091314_00787619_W", "names": {"Richard Johnson": ["Q14951100", "Q15485938", "Q166422", "Q1700677", "Q48742884", "Q6584097", "Q7326891", "Q7326893", "Q7326895", "Q7326896", "Q7326897", "Q7326900", "Q7326902", "Q7326904", "Q7326905", "Q7326907", "Q7328820"]}}, {"date": "2016-09-14", "url": "http://wjtv.com/ap/leaked-colin-powell-emails-show-loathing-for-trump/", "content": "Leaked <mark>Colin Powell</mark> emails show loathing for <mark>Trump</mark> JEFF HORWITZ, The Associated Press Published: September 14, 2016, 7:30 am WASHINGTON (AP)--Former Secretary of State <mark>Colin Powell</mark>--in newly leaked emails--calls <mark>Donald Trump</mark> \"a national disgrace,\" and <mark>Powell</mark> laments Hillary Clinton's attempt to equate her email practices with his. The emails were first reported by Buzzfeed News. <mark>Powell</mark> is a respected retired general who served under Republican presidential administrations. He tells BuzzFeed that he doesn't deny the emails' authenticity. And in a later statement to NBC News, <mark>Powell</mark> says \"the hackers have a lot more\" of his emails. Related Advertisement & laquo; Previous Story Please enable JavaScript to view the comments powered by Disqus. Leave a Reply Cancel reply Enter your comment here...Fill in your details below or click an icon to log in: Email (required) (Address never made public) Name (required) Website You are commenting using your WordPress.com account. (Log Out / Change) You are commenting using your Twitter account. (Log Out / Change) You are commenting using your Facebook account. (Log Out / Change) You are commenting using your Google + account. (Log Out / Change) Cancel Connecting to% s Notify me of new comments via email. Notify me of new posts via email. Advertisement Weather Conditions change location Vicksburg 72 & deg; F 0 N Wind 70 & deg; Dewpoint 94% Humidity 30.07 \"Barometer 6:47 am Sunrise 7:09 pm Sunset change location Jackson, Miss.. 72 & deg; F 4 NE Wind 69 & deg; Dewpoint 91% Humidity 30.09\" Barometer 6:44 am Sunrise 7:06 pm Sunset Sponsored By: Cannon Nissan change location Brookhaven n/a F 0 N Wind n/a Dewpoint n/a Humidity 30.09 \"Barometer 6:45 am Sunrise 7:07 pm Sunset Vicksburg 72 & deg; Jackson, Miss.. 72 & deg; Brookhaven n/a More Stories Gov. Bryant comments on NCAA decision on removal of games AKA unveils new community garden Egg Bowl will be played on Thanksgiving in 2017 Advertisement Advertisement Advertisement", "articleID": "2016091412_00537469_W", "names": {"Colin Powell": ["Q150851", "Q5145485"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-09-15", "url": "http://www.springfieldnewssun.com/news/sports/wittenberg-quarterback-ready-for-second-start/nsYLh/", "content": "SPRINGFIELD--The Wittenberg Tigers started with a junior or senior at quarterback for eight straight seasons. Aaron Huffman earned the job as a freshman in 2006 and held it for four years. When Huffman left, junior Ben Zoeller grabbed the reins and started for two seasons. Reed Florence followed Zoeller, starting as a junior and senior. It was the same story with Zack Jenkins, who started in his final two seasons, 2014 and 2015. The Tigers began the 2016 season, however, with a sophomore. Jake Kennedy, a 6-foot-1, 200-pound graduate of Bellefontaine High School, completed 21 of 31 passes for 291 yards and two touchdowns Sept. 3 in a 34-0 victory over Capital. He threw one interception and rushed 12 times for 55 yards and a touchdown. \"It was definitely crazy,\" Kennedy said Wednesday before practice. \"I hadn't (started) in two years since high school. It was so fun. It was like I forgot how fun football was. I'm having a good time. The guys are taking me under their wing and showing me along .\" The Tigers (1-0) had their one off week last Saturday and return to action at 7 p.m. Saturday at Ohio Wesleyan. It's the first of nine straight North Coast Athletic Conference games. \"It's another huge challenge for a young quarterback,\" offensive coordinator Kevin Hoyng said. \"It was good for us to get back and have the week off and really hone on some of the mistakes he made and get back into camp mode .\" Kennedy is eager to improve on his first performance. \"I was happy with how the team did, but there were a few throws I wish I could take back,\" he said. \"I'm not looking to play perfect. The game of football is not that easy, especially being a sophomore. I should have done better, but overall I was pleased with my first performance .\" Kennedy comes from a family of football players. His uncle, Dal McDonald, played linebacker at Bowling Green. His cousin, Dax Notestine, a Bellefontaine graduate, played on the defensive line at Ohio University and is now the director of strength and conditioning there. Kennedy's mom's dad was an offensive lineman at Texas Tech. Kennedy finished his high school career as Bellefontaine's all-time leader in passing yards and touchdown passes. He played his final two seasons under coach <mark>Toby Smith</mark>, a Wittenberg graduate. \"He just had my back where I wanted to go,\" Kennedy said, \"but I think deep down he wanted me to go here just because him and Coach (Joe) Fincham are really tight. I wanted to be close to home. The tradition here speaks for itself. I couldn't get this experience anywhere else .\" ", "articleID": "2016091500_00115592_W", "names": {"Toby Smith": ["Q3992120", "Q7811889"]}}, {"date": "2016-09-15", "url": "http://4029tv.com/national/urgent-russia-says-us-not-fulfilling-syria-ceasefire-obligations/41676220", "content": "Text Size: ASmall Text AMedium Text ALarge Text (CNN)--Russia's Defense Ministry said Thursday that the US is not fulfilling its obligations under the Syrian ceasefire agreement, while denying accusations that its own forces have violated the pause in the conflict. In a statement, the Ministry said that US-led \"moderate opposition forces\" had increased the \"number of attacks on residential neighborhoods .\" Related The woman who saved her country from...Russian hackers release data on 25...<mark>Colin Powell</mark>: Trump is' a national...Will refugees bring Europe's terror...Typhoon Meranti makes landfall in China Tweet Tweet Copyright 2016 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags International Comments () Print Recommended Comments The views expressed are not those of this site, this station or its affiliated companies. By posting your comments you agree to accept our terms of use. Please enable JavaScript to view the comments powered by Disqus. blog comments powered by Disqus", "articleID": "2016091511_00063250_W", "names": {"Colin Powell": ["Q150851", "Q5145485"]}}, {"date": "2016-09-16", "url": "http://www.bloomberg.com/news/articles/2016-09-16/brexit-proves-springboard-for-eu-27-restart-to-avert-collapse", "content": "Bloomberg the Company & Its Products Bloomberg Anywhere Remote LoginBloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Customer Support Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Customer Support French President Francois Hollande, left, and German Chancellor Angela Merkel leave after delivering a joint statement after the European Union Summit of 27 Heads of State or Government in Bratislava, on Sept. 16, 2016. Photographer: Stephane de Sakutin/AFP via Getty Images First summit without the U.K. promises concrete \"roadmap' Italy's <mark>Renzi</mark> brands migration progress a\" flight of fantasy' Share on LinkedIn Share on Reddit Share on Google + E-mail Share on Twitter Share on WhatsApp The U.K.'s impending exit from the European Union provided a kick start for the rest of the 28-nation bloc as leaders identified measures they hope will re-engage EU citizens and avert further disintegration. During an eight-hour meeting in a hilltop castle in the Slovak capital Bratislava, EU heads attending their first summit without Britain discussed national gripes about the bloc and tried to work out how to mesh them into a coherent and common way forward. The result was a \"roadmap\" of concrete steps toward closer cooperation on defense, spurring economic growth and bolstering security both internally and on the EU's external borders, with Brexit cited as the impetus to overhaul the way the EU works. \"Although one country has decided to leave, the EU remains indispensable for the rest of us,\" leaders said in a declaration after the summit. \"We need the EU not only to guarantee peace and democracy but also the security of our people .\" Having emerged from the embers of World War II, the EU is confronting the greatest ever threat to its existence. The U.K.'s vote to quit the club it joined in 1973, terrorist attacks in the EU's major cities, a wave of migration from outside its borders that's frayed the fabric of social cohesion and a jobless rate twice that of the U.S. have combined to strangle Europe's confidence and raise question about the bloc's force for good. \"Dislocation' Risk\" The risk of Europe's dislocation has never been this great, \"French President Francois Hollande said in a stark statement published on Facebook during the summit discussions .\" I'm really talking about a separation, and that means a return to borders, the end of free movement, the end of solidarity, the abandonment of the euro. \"With elections in France, Germany and the Netherlands next year and with anti-EU populists seizing on the bloc's difficulties to present their alternative view of the future, leaders know they are in a race against time to come up with solutions radical enough to win back support from voters. Leaders broadly fell into three camps at the summit, according to an EU official. Some want the bloc to focus on improving its response to migration and bolstering its external borders; another group wants more to be done to tackle youth unemployment that's nudging 50 percent in Spain and Greece; and a third set is mostly concerned about stopping the growing terrorist threat. <mark>Renzi</mark> Apart While the prevailing mood was one of unity, bad feeling boiled over into public as Italian Prime Minister <mark>Matteo Renzi</mark> said he was unable to hold a joint press conference with Hollande and German Chancellor Angela Merkel because he disagreed with them. For <mark>Renzi</mark>, who faces a crunch referendum of his own at a time when his country has the second-highest debt load in the euro area and stands on the front line for arrivals of refugees from Africa, the summit failed to live up to his hopes for an end to the EU's obsession with austerity and for ways cope with the migrant influx .\" I am not satisfied with the conclusions \"of the summit\" on growth and on migration \"and for that reason\" I cannot hold a news conference with Merkel and Hollande, not sharing the conclusions as they do, \"he said shortly after the summit finished. To say progress was made on migration\" is a flight of fantasy. \"EU President Donald Tusk set out leaders' targets for the months ahead, including guarantees to ensure full control of borders, continued work with Turkey and African countries on migration, intelligence-sharing to fight terrorism and exploring ways to cooperate in defense .\" We are determined to correct past mistakes, \"he said. What wasn't on the official agenda was the EU's future relationship with the U.K. post-Brexit, although Tusk reiterated that leaders have made clear they won't enter into negotiations with <mark>Theresa May</mark>'s government until formal notification of Britain's is posted. The period of EU introspection will continue at follow-up gatherings in Malta and Italy in the first three months of next year .\" Bratislava is not the magic moment where we'll wake up tomorrow to find Europe has been revolutionized, \"Belgian Prime Minister <mark>Charles Michel</mark> said after the summit .\" It's a process. \"Before it's here, it's on the Bloomberg Terminal. LEARN MORE", "articleID": "2016091620_00590092_W", "names": {"Charles Michel": ["Q5080932", "Q56084814", "Q950958"], "Matteo Renzi": ["Q47563", "Q49661315"]}}]