[{"date": "2016-09-16", "url": "http://www.bloomberg.com/news/articles/2016-09-16/brexit-proves-springboard-for-eu-27-restart-to-avert-collapse", "content": "Bloomberg the Company & Its Products Bloomberg Anywhere Remote LoginBloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Customer Support Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Customer Support French President Francois Hollande, left, and German Chancellor Angela Merkel leave after delivering a joint statement after the European Union Summit of 27 Heads of State or Government in Bratislava, on Sept. 16, 2016. Photographer: Stephane de Sakutin/AFP via Getty Images First summit without the U.K. promises concrete \"roadmap' Italy's <mark>Renzi</mark> brands migration progress a\" flight of fantasy' Share on LinkedIn Share on Reddit Share on Google + E-mail Share on Twitter Share on WhatsApp The U.K.'s impending exit from the European Union provided a kick start for the rest of the 28-nation bloc as leaders identified measures they hope will re-engage EU citizens and avert further disintegration. During an eight-hour meeting in a hilltop castle in the Slovak capital Bratislava, EU heads attending their first summit without Britain discussed national gripes about the bloc and tried to work out how to mesh them into a coherent and common way forward. The result was a \"roadmap\" of concrete steps toward closer cooperation on defense, spurring economic growth and bolstering security both internally and on the EU's external borders, with Brexit cited as the impetus to overhaul the way the EU works. \"Although one country has decided to leave, the EU remains indispensable for the rest of us,\" leaders said in a declaration after the summit. \"We need the EU not only to guarantee peace and democracy but also the security of our people .\" Having emerged from the embers of World War II, the EU is confronting the greatest ever threat to its existence. The U.K.'s vote to quit the club it joined in 1973, terrorist attacks in the EU's major cities, a wave of migration from outside its borders that's frayed the fabric of social cohesion and a jobless rate twice that of the U.S. have combined to strangle Europe's confidence and raise question about the bloc's force for good. \"Dislocation' Risk\" The risk of Europe's dislocation has never been this great, \"French President Francois Hollande said in a stark statement published on Facebook during the summit discussions .\" I'm really talking about a separation, and that means a return to borders, the end of free movement, the end of solidarity, the abandonment of the euro. \"With elections in France, Germany and the Netherlands next year and with anti-EU populists seizing on the bloc's difficulties to present their alternative view of the future, leaders know they are in a race against time to come up with solutions radical enough to win back support from voters. Leaders broadly fell into three camps at the summit, according to an EU official. Some want the bloc to focus on improving its response to migration and bolstering its external borders; another group wants more to be done to tackle youth unemployment that's nudging 50 percent in Spain and Greece; and a third set is mostly concerned about stopping the growing terrorist threat. <mark>Renzi</mark> Apart While the prevailing mood was one of unity, bad feeling boiled over into public as Italian Prime Minister <mark>Matteo Renzi</mark> said he was unable to hold a joint press conference with Hollande and German Chancellor Angela Merkel because he disagreed with them. For <mark>Renzi</mark>, who faces a crunch referendum of his own at a time when his country has the second-highest debt load in the euro area and stands on the front line for arrivals of refugees from Africa, the summit failed to live up to his hopes for an end to the EU's obsession with austerity and for ways cope with the migrant influx .\" I am not satisfied with the conclusions \"of the summit\" on growth and on migration \"and for that reason\" I cannot hold a news conference with Merkel and Hollande, not sharing the conclusions as they do, \"he said shortly after the summit finished. To say progress was made on migration\" is a flight of fantasy. \"EU President Donald Tusk set out leaders' targets for the months ahead, including guarantees to ensure full control of borders, continued work with Turkey and African countries on migration, intelligence-sharing to fight terrorism and exploring ways to cooperate in defense .\" We are determined to correct past mistakes, \"he said. What wasn't on the official agenda was the EU's future relationship with the U.K. post-Brexit, although Tusk reiterated that leaders have made clear they won't enter into negotiations with <mark>Theresa May</mark>'s government until formal notification of Britain's is posted. The period of EU introspection will continue at follow-up gatherings in Malta and Italy in the first three months of next year .\" Bratislava is not the magic moment where we'll wake up tomorrow to find Europe has been revolutionized, \"Belgian Prime Minister <mark>Charles Michel</mark> said after the summit .\" It's a process. \"Before it's here, it's on the Bloomberg Terminal. LEARN MORE", "articleID": "2016091620_00590092_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2016-09-17", "url": "http://www.cnbc.com/2016/09/17/reuters-america-update-2-russia-us-tensions-spill-over-at-un-meeting-on-syria.html", "content": "(New throughout, adds details) UNITED NATIONS, Sept 17 (Reuters) - The United States accused Russia of grandstanding on Saturday by calling a U.N. Security Council meeting over U.S.-led coalition air strikes in Syria, as Russia said the attacks killed dozens of Syrian soldiers and could endanger a truce deal between Moscow and Washington. The 15-member council met for an hour on Saturday evening after Russia and a war monitoring group said coalition jets bombed a Syrian army position near Deir al-Zor airport. U.S. Ambassador to the United Nations, Samantha Power, said Washington was investigating the air strikes and \"if we determine that we did indeed strike Syrian military personnel that was not our intention and we of course regret the loss of life .\" She said Russia's decision to call a council meeting was \"cynical and hypocritical\" as Moscow had never expressed such outrage at the killing of civilians by Syrian government forces during more than five years of conflict. \"Russia really needs to stop the cheap point scoring and the grandstanding and the stunts and focus on what matters, which is implementation of something we negotiated in good faith with them,\" Power told reporters. The deal reached last Saturday aims to put Syria's peace process back on track. It included a fragile nationwide truce, improved humanitarian aid access and joint military targeting of banned Islamist groups. When asked if Saturday's air strikes spelled the end of the deal, Russian U.N. Ambassador <mark>Vitaly Churkin</mark> said: \"This is a very big question mark .\" \"I would be very interested to see how Washington is going to react. If what Ambassador Power has done today is any indication of their possible reaction then we are in serious trouble,\" <mark>Churkin</mark> told reporters. <mark>Churkin</mark> said it was a crucial time in the efforts to bring peace to Syria and the fight against terrorism. He said the United States could have waited until Moscow and Washington were to start joint military cooperation in two days instead of carrying out a \"reckless\" operation. \"Who is in charge in Washington? Is it the White House or the Pentagon? Because we have heard statements from the Pentagon which simply fly in the face of what we have heard from President Obama and Secretary Kerry,\" he said. Both parties to the Syrian conflict have accused each other of being responsible for aid deliveries being stuck far from Aleppo. \"All the permissions the Syrian government was supposed to give have been given for humanitarian supplies to reach people in need in various parts of Syria and that the humanitarian convoy to eastern Aleppo is supposed to leave tomorrow morning,\" <mark>Churkin</mark> said. (Reporting by Michelle Nichols; Editing by Paul Simao)", "articleID": "2016091801_00252030_W", "names": {"Vitaly Churkin": ["Q1394102", "Q27524216"]}}, {"date": "2016-09-20", "url": "http://10thousandcouples.com/2016/09/gas-shortage-wilmington-feeling-the-effects-of-colonial/", "content": "Gas shortage: Wilmington feeling the effects of Colonial Pipleline leak Gas shortage: Wilmington feeling the effects of Colonial Pipleline leak by Terry Joseph | September 20, 2016 | 22:08 Most Jacksonville stations were at $1.98 a gallon Monday. A pipeline leak in Alabama is pushing gas prices higher in the southeast part of the United States. Alabama, South Carolina, North Carolina, Tennessee and Virginia also saw prices climb since Monday, AAA reported Tuesday. While there is no problem at most gas stations in the Mid-South, there has been panic at the pump stretching from middle Tennessee to Atlanta. \"While there are pockets of service stations that have experienced temporary shortages, many have received supplies and others have them scheduled for Monday\". Gasoline prices are increasing across the South following a pipeline break in Shelby County, Ala.. Colonial Pipeline, the company with owns the line, said in a statement Monday that it has rerouted the fuel that would have been sent down the leaking line to its second mainline, which normally carries distillates, in order to keep supply moving to the affected areas. \"Upon completion of the bypass, it will take a day to test and get the line back in operation\" , the statement from McCrory's office said. As a result of the leak and downtime for the fix, Colonial Pipeline announced over the weekend that it would construct a temporary pipeline to bypass the section of the line that is damaged. Around 8 p.m. central time on September 9, the Pelham Fire Department determined the benzene and gasoline fumes near the assumed site of the leak had reached unsafe levels, and \"suspended all activity and evacuated all persons\" from the assumed leak site and a nearby retention pond, Pond 2, that collected much of the spilled gas. Still, GasBuddy.com's live average of 704 gas stations in Hampton Roads shows that gas prices increased 6 cents from $1.98 Sunday to $2.04 by 4:30 p.m. Monday. In North Carolina, Attorney General <mark>Roy Cooper</mark> urged North Carolina consumers to report gas prices that seem unreasonably high. Georgia Gov. Nathan Deal also signed an executive order forbidding price-gouging Monday. With the spike in gas prices and reports of dry gas station pumps, drivers could see the situation get worse before it gets better, Keen said. At least 252,000 gallons of gasoline spilled from the pipeline into a pond. Governor Robert Bentley toured the incident command center for the Colonial Pipeline gasoline spill that has been blamed for gasoline shortages and gas price increases in the South. The gas will need to get to the Atlanta market, go to the terminals, then onto delivery trucks, and then go to the stations for drivers. The Colonial Pipeline does supply his store, but Patel's confident it will be fixed this week. It's unclear when the spill actually started. The average price of regular gas in Georgia a week ago was around $2.10, AAA reported. According to a preliminary report, it wasn't possible to immediately pinpoint the leak, partly because highly flammable benzene and gasoline vapors hung in the air and prevented firefighters, company officials and anyone else from being near the site for more than three days. Related Articles <mark>Trump</mark> \"bets' terror suspect not on a watch list because he's litigious Initially, a garbage can explosion at a Marine Corps charity race in Seaside Park, New Jersey, seemed to be an isolated incident. After an officer arrived and recognized Rahami, Rahami shot the officer, who was saved by his bulletproof vest, authorities said. 20 September 2016 New Jersey congressman: Bomb suspect asked for visa help No one was injured in the other blasts .\" We all have a role to play as citizens to make sure we don't succumb to that fear \". Investigators believe more people were involved in the NY and New Jersey bombing plots, two USA officials told Reuters. 20 September 2016 JPMorgan nudges Wells Fargo off perch as most valuable US bank In fact, a lawsuit filed by Los Angeles against Wells Fargo in May 2015 says that the bank was consumed by this goal. It's the first time in over three years Wells Fargo hasn't been able to call itself America's most valuable bank. 20 September 2016 Manchester United boss Jose Mourinho\" to rest trio for EFL Cup tie' United lost the derby to Manchester City last weekend and were then beaten by Feyenoord in their midweek Europa League clash. But even at 25 metres, you have to jump and go and press, but no, we wait. \"This is a tactical but also a mental attitude\". 20 September 2016 Clinton had been sidelined for most of this week after coming down with a form of pneumonia. The message, Clinton said, was, \"\"Please don't think. 20 September 2016 Doctor says <mark>Donald Trump</mark> in\" excellent physical health' In discussing his campaign positions, <mark>Trump</mark> told Oz that women should be able to obtain birth control without a prescription. Mr <mark>Trump</mark> had avoided referring to Mrs Clinton's medical problems but on Wednesday night made a veiled attack on her health. 20 September 2016 Mike Zimmer: \"It's going to be another miserable Tuesday' Coach <mark>Ron Rivera</mark> revealed to reporters running back <mark>Jonathan Stewart</mark>'s hamstring injury could keep him out at least a week or two. Bank Stadium on crutches after an NFL football game against the Green Bay Packers Sunday, Sept. 18, 2016, in Minneapolis. 20 September 2016 Authorities were also investigating the stabbings of nine people at a Minnesota mall as a possible act of terrorism. <mark>Trump</mark> blamed the President Barack Obama's administration for letting in too many refugees. 20 September 2016 People stand near burning debris during election protests in Kinshasa, Democratic Republic of Congo, Monday, Sept. 19, 2016. Human Rights Watch said in a statement on Monday that the clashes were preceded by intensified government repression. 20 September 2016 Authorities believe the\" main guy \"has been caught, but the investigation continues to determine if Rahami had help. He thanked the police for arresting Ahmad Khan Rahami, the man suspected in bombings in NY and New Jersey. 20 September 2016 Tulsa Shooting Video of Cops Killing Unarmed Man Crutcher's death is the latest in a string of police shootings against black men .\" We're going to stop it right here \", she said. In the video, Crutcher approaches the driver's side door before dropping to the ground after being shocked with a stun gun. 20 September 2016", "articleID": "2016092019_00173776_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Jonathan Stewart": ["Q14951008", "Q3809956"], "Ron Rivera": ["Q1991889", "Q7364319"], "Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"]}}, {"date": "2016-09-20", "url": "http://weblogs.sun-sentinel.com/news/nationworld/ct-black-lives-matter-protest-las-vegas-court-20160920-story.html#nt=oft13a-23gp1", "content": "A defense attorney touched off a protest Tuesday about race and free expression in a Las Vegas courtroom when she refused to remove a \"Black Lives Matter\" button from her blouse despite a judge's request not to demonstrate what he called \"political speech .\" Clark County District Court Judge Douglas Herndon asked Erika Ballou, a deputy public defender who is black, to remove the button or leave the courtroom and turn the case she was handling over to another lawyer. \"I'm asking the same thing of defense attorneys that I ask of anybody else,\" the judge said. \"Please leave any kind of political or opinion protest statements outside the courtroom .\" Ballou, with Clark County Public Defender Phil Kohn standing at her side and about a dozen defense attorneys in the audience to show their support, insisted that she had a First Amendment right to demonstrate her opinion. She also refused to remove herself from her client's case, which the judge postponed to Thursday. Several supporters wore a similar lapel button: Black, about the size of a silver dollar, with white letters. Attorney Jonathan MacArthur said he'll wear it again to Herndon's courtroom on Thursday. \"This is an issue about criminal justice,\" Ballou told the judge. She noted that some deputy district attorneys wear small office badge-type lapel pins, and that uniformed court officers are allowed to wear symbolic black bands on their badges to mourn police officers killed on duty. Eagles players protest during national anthem at Soldier Field Phil Rosenthal Birds of a feather don't necessarily flock together. While the rest of the Philadelphia Eagles stood along the sidelines during singer Jim Cornelison's performance of the national anthem before Monday night's kickoff against the Bears at Soldier Field, Eagles safety Malcolm Jenkins, defensive end...Birds of a feather don't necessarily flock together. While the rest of the Philadelphia Eagles stood along the sidelines during singer Jim Cornelison's performance of the national anthem before Monday night's kickoff against the Bears at Soldier Field, Eagles safety Malcolm Jenkins, defensive end...(Phil Rosenthal) \"This is not political speech. It is not supporting a particular candidate,\" she said of her pin. \"I believe a courtroom is the proper place .\" Ballou, a public defender for 11 years, said outside court that she took her stand after the head of the Las Vegas police union sent a letter last week to the chief state district court judge, <mark>David Barker</mark>, complaining that what the union executive termed \"\"Black Lives Matter' propaganda\" had no place in courtrooms. \"We are certain that the courts would not allow similar public displays from citizens who believe that killers should be sentenced to death or that sexual predators should be castrated,\" Las Vegas Police Protective Association director Steve Grammas wrote. \"While we embrace the First Amendment, we do not believe that such statements should be made in the halls of justice .\" Grammas said in a brief email that he raised the issue at the request of a union member, who was \"satisfied to have the issue addressed .\" Grammas didn't immediately respond to follow-up questions. <mark>Barker</mark> was in court hearings and unavailable to immediately respond to messages. Lawyers for Terence Crutcher say drug discussion is a distraction in Tulsa police shooting Tribune news services Investigators found the drug PCP in the vehicle of an unarmed black man fatally shot by a white officer, according to Oklahoma police, but attorneys for the slain man's family say discussion of drugs distracts from questions about the use of deadly force. Tulsa Sgt. <mark>Dave Walker</mark> told the Tulsa World...Investigators found the drug PCP in the vehicle of an unarmed black man fatally shot by a white officer, according to Oklahoma police, but attorneys for the slain man's family say discussion of drugs distracts from questions about the use of deadly force. Tulsa Sgt. <mark>Dave Walker</mark> told the Tulsa World...(Tribune news services) A court spokeswoman, Mary Ann Price, pointed to court rules of conduct making judges responsible for applying rules of decorum, proper attire and dignity. Herndon, who earlier asked court spectators to cover T-shirts they'd worn to support victims in another case, told Ballou he tries to keep his courtroom free of outside influences. The pin, the judge said, \"is making a political statement, that,' I wear this in protest of how the court is treating minority defendants .'\" \"Wear it in the hallway. Wear it in front of the courthouse,\" Herndon added. \"Demonstrate. Protest. Use your voice. But that's not what dealing with justice on an individual case is about .\" Ballou, a self-described \"middle-aged, middle-income\" woman, said she feared for her life when she was surrounded by four Nevada Highway Patrol officers during a traffic stop for a driving infraction last July 4. \"People are getting killed in the streets every day. People who look like me,\" she said. \"Black Lives Matter is not a protest against police. It is a protest against police brutality .\" She said she was moved to wear the pin after hearing about the police union letter, amid a backdrop of high-profile police shootings of black men across that have ignited protests and a national dialogue about race in America. Ballou also invoked recent national anthem protests by San Francisco 49ers quarterback Colin Kaepernick over racial injustice, including comments he made to the media that \"people don't realize what's really going on .\" <mark>Trump</mark>, in town named after man whose family owned slaves, says blacks in \"worst shape' ever Jose A. DelReal <mark>Donald Trump</mark> faced a swift backlash Tuesday after declaring that African-Americans are\" in the worst shape they've ever been \"during a campaign event here .\" We're going to rebuild our inner cities because our African-American communities are absolutely in the worst shape they've ever been in before...<mark>Donald Trump</mark> faced a swift backlash Tuesday after declaring that African-Americans are \"in the worst shape they've ever been\" during a campaign event here. \"We're going to rebuild our inner cities because our African-American communities are absolutely in the worst shape they've ever been in before...(Jose A. DelReal) In Las Vegas, race in criminal justice has been a controversial issue in recent years. The Las Vegas Metropolitan Police Department drew scrutiny from the U.S. Justice Department's office of Community Oriented Policing Services and began in 2013 to change a range of policies after a review of officer-involved shootings over several years. The seven-month COPS review looked at 87 cases of police use of deadly force from 2007 to 2012. Of those, 10 involved unarmed people, including seven who were African-American. Associated Press", "articleID": "2016092101_00096540_W", "names": {"Dave Walker": ["Q1167952", "Q11693064", "Q172091", "Q24279373", "Q27674957", "Q5230057"], "David Barker": ["Q15710330", "Q15994282", "Q21466672", "Q3017446", "Q38804743", "Q5231130"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-09-21", "url": "http://stardem.com/life/article_edf32df8-6453-5231-b70b-4460baf2577a.html", "content": "Close CONTRIBUTED PHOTO Pastor <mark>John Wesley</mark> Moore is pictured with a rare 1962 Wocekiye Wowapi, the Episcopal Church's 1962 Dakota Sioux translation of \"The Book of Common Prayer,\" which is among the recently presented collection Moore gave to The Oaks of Mamre Interfaith Library and Graduate Center. The Oaks receives <mark>John Wesley</mark> Moore Collection of American Plains Spirituality 39 min ago0 CONTRIBUTED PHOTO Pastor <mark>John Wesley</mark> Moore is pictured with a rare 1962 Wocekiye Wowapi, the Episcopal Church's 1962 Dakota Sioux translation of \"The Book of Common Prayer,\" which is among the recently presented collection Moore gave to The Oaks of Mamre Interfaith Library and Graduate Center. EASTON--The Oaks of Mamre Interfaith Theological Library and Graduate Center has received The <mark>John Wesley</mark> Moore Collection of American Plains Indian Spirituality in a recent ceremony in Easton, which was attended by invited guests, several of Native American descent. The Oaks President Bishop Joel <mark>Marcus Johnson</mark> presided. The Rev. Moore, the benefactor, is the recently retired pastor of Talbot County's Riverview Charge of the United Methodist Church. Moore, who is of Oglala Lakota and Irish descent from his father, and Kogui Kiowa and Scottish descent from his mother, is a son of The Pine Ridge Reservation of South Dakota. A lifelong scholar of his Plains Indian heritage, he has collected memorabilia, such as rare translations of the Bible, prayer books and hymnals from native tongues, as well as social and political histories, and native artisanal studies. Among the rarest volumes presented in the ceremony was the 1962 Niobrara Service Book, the translation into Dakota of the Episcopal Church's Book of Common Prayer, titled \"Wocekiye Wowapi,\" literally translated as \"one who cries out for help .\" Other rare volumes include the Dakota Episcopal Hymnal of 1949, and historical works of Walker, Rice and the Deloria family. To signify the inter-cultural nature of Plains Indian Christianity, the ceremony concluded as <mark>Johnson</mark> gave the Hebrew Aaronic blessing from the Book of Numbers, and Moore sang a native Dakota hymn of blessing. \"This large, momentous collection is of great importance, as it serves to encourage members and scholars of other native tribes and nations also to participate in preserving their spiritual traditions and histories. The Oaks welcomes these good people,\" <mark>Johnson</mark> said. The Oaks of Mamre began this year under the tax exempt auspices of the Mid Shore Community Foundation. Its purpose is to promote peace and harmony among the world's great religions through academic seminars and symposia. For more information, email <mark>Johnson</mark> at oaksofmamre @ goeaston.net. Tags", "articleID": "2016092116_00677409_W", "names": {"John Wesley": ["Q1425302", "Q353305", "Q971854"]}}]