[{"date": "2016-09-21", "url": "http://stardem.com/life/article_edf32df8-6453-5231-b70b-4460baf2577a.html", "content": "Close CONTRIBUTED PHOTO Pastor <mark>John Wesley</mark> Moore is pictured with a rare 1962 Wocekiye Wowapi, the Episcopal Church's 1962 Dakota Sioux translation of \"The Book of Common Prayer,\" which is among the recently presented collection Moore gave to The Oaks of Mamre Interfaith Library and Graduate Center. The Oaks receives <mark>John Wesley</mark> Moore Collection of American Plains Spirituality 39 min ago0 CONTRIBUTED PHOTO Pastor <mark>John Wesley</mark> Moore is pictured with a rare 1962 Wocekiye Wowapi, the Episcopal Church's 1962 Dakota Sioux translation of \"The Book of Common Prayer,\" which is among the recently presented collection Moore gave to The Oaks of Mamre Interfaith Library and Graduate Center. EASTON--The Oaks of Mamre Interfaith Theological Library and Graduate Center has received The <mark>John Wesley</mark> Moore Collection of American Plains Indian Spirituality in a recent ceremony in Easton, which was attended by invited guests, several of Native American descent. The Oaks President Bishop Joel <mark>Marcus Johnson</mark> presided. The Rev. Moore, the benefactor, is the recently retired pastor of Talbot County's Riverview Charge of the United Methodist Church. Moore, who is of Oglala Lakota and Irish descent from his father, and Kogui Kiowa and Scottish descent from his mother, is a son of The Pine Ridge Reservation of South Dakota. A lifelong scholar of his Plains Indian heritage, he has collected memorabilia, such as rare translations of the Bible, prayer books and hymnals from native tongues, as well as social and political histories, and native artisanal studies. Among the rarest volumes presented in the ceremony was the 1962 Niobrara Service Book, the translation into Dakota of the Episcopal Church's Book of Common Prayer, titled \"Wocekiye Wowapi,\" literally translated as \"one who cries out for help .\" Other rare volumes include the Dakota Episcopal Hymnal of 1949, and historical works of Walker, Rice and the Deloria family. To signify the inter-cultural nature of Plains Indian Christianity, the ceremony concluded as <mark>Johnson</mark> gave the Hebrew Aaronic blessing from the Book of Numbers, and Moore sang a native Dakota hymn of blessing. \"This large, momentous collection is of great importance, as it serves to encourage members and scholars of other native tribes and nations also to participate in preserving their spiritual traditions and histories. The Oaks welcomes these good people,\" <mark>Johnson</mark> said. The Oaks of Mamre began this year under the tax exempt auspices of the Mid Shore Community Foundation. Its purpose is to promote peace and harmony among the world's great religions through academic seminars and symposia. For more information, email <mark>Johnson</mark> at oaksofmamre @ goeaston.net. Tags", "articleID": "2016092116_00677409_W", "names": {"Marcus Johnson": ["Q16730362", "Q3846690", "Q39075998"]}}, {"date": "2016-09-22", "url": "http://www.rediff.com/business/report/mallya-saga-ex-kingfisher-cfo-sent-to-prison-for-18-months/20160922.htm", "content": "Rediff.com & raquo; Business & raquo; Ex-Kingfisher CFO sent to prison for 18 months Ex-Kingfisher CFO sent to prison for 18 months September 22, 2016 21:09 IST A total of 17 cases have been filed against Kingfisher Airlines in different courts over outstanding amount of Rs 22.5 crore, which it owes to GMR A Hyderabad court, on Thursday, sentenced A Raghunathan, former CFO of Kingfisher Airlines Ltd, to 18 months imprisonment in connection with two cheque bounce cases filed against him and businessman Vijay Mallya by GMR Hyderabad International Airport Ltd.. Third Special Court Magistrate M <mark>Krishna Rao</mark> also imposed Rs 20,000 fine in each case on Raghunathan after the latter appeared before the court. Earlier, on several occasions, the order on quantum of punishment had got adjourned as the warrant issued against Raghunathan was still pending. The court had on April 20 convicted Kingfisher Airlines, Mallya and Raghunathan, in connection with two cheque bounce cases involving Rs 50 lakh each, under relevant sections of the Negotiable Instruments Act. The matter relates to cheques issued by Kingfisher Airlines Ltd to GMR Hyderabad International Airport Ltd (GHIAL), which operates Rajiv Gandhi International Airport, towards charges for using the facilities at the airport for Kingfisher Airlines flights. During arguments today, GHIAL counsel G Ashok Reddy submitted that it was after five months Raghunathan had finally appeared before this court. He further informed that Vijay Mallya is absconding and is out of the country, and sought the court to proceed with sentence order against Raghunathan. R aghunathan's counsel said that several warrants were issued by different courts and he was unable to appear before this court. He sought for splitting the case against Raghunathan. He had appeared before other courts in the past few days in connection with NBWs issued against him after he had moved the high court, and got the warrants recalled. Reddy argued that the high court in its order (for recall of NBWs) had \"made it clear that its order will not stand in way when the matter reached at the stage of judgement, pronouncement of sentence or conviction of the accused in the case\". The court had earlier issued non-bailable warrants against Kingfisher Airlines, its chairman Mallya and Raghunathan on the ground of dishonouring the two cheques. It had earlier said that before imposing the quantum of punishment, it would hear the plea of the convicts (Mallya and others, who had so far not appeared/attended the court), and then pass its order with regard to sentencing them or imposing fine or both. As per the GMR counsel, a total of 17 cases have been filed against Kingfisher Airlines in different courts over outstanding amount of Rs 22.5 crore, which it owes to GMR. The cases are in different stages of trial. T he magistrate told Raghunathan that he has been found guilty under relevant sections of Negotiable Instruments Act. Raghunathan told the court that \"I was only an employee of United Spirits Limited. I was on rolls of United Spirits. My services seconded to Kingfisher Airlines Limited. I was always an employee of United Spirits and retired in July 2013 .\" The magistrate, in his order, sentenced Raghunathan to undergo one year and six months imprisonment and also imposed a fine of Rs 20,000 in each case. The magistrate further said Raghunathan can file appeal against the judgement of this court in the case. Ashok Reddy, citing certain court rulings, submitted that this court can pass sentence against the company and also against Vijay Mallya. \"One of the accused is present in the court and the court is requested to also sentence Kingfisher Airlines and Vijay Mallya, to avoid delay. Not withstanding absence of Vijay Mallya, the court can sentence and impose fine against Vijay Mallya,\" Reddy submitted. \"Entire country knows where he (Mallya) is staying...he may not come back. It will take years to bring him back to India. At least fine can be imposed against the company,\" he further said. Photograph: Vivek Prakash/Reuters & copy; Copyright 2016 PTI. All rights reserved. Republication or redistribution of PTI content, including by framing or similar means, is expressly prohibited without the prior written consent.", "articleID": "2016092216_00077593_W", "names": {"Krishna Rao": ["Q16734981", "Q16963271", "Q47100421", "Q6437482"]}}, {"date": "2016-09-23", "url": "http://wdtimes.com/sports/state_national_sports/article_33baa233-86f6-5ee0-91ea-58916239e8f4.html#user-comment-area", "content": "No. 12 Georgia, No. 23 Mississippi meet in Top 25 showdown - Watertown Daily Times Online: State National Sports MIAMI (AP)--Police in South Florida say they have a \"person of interest\" in the theft of a naked <mark>Donald Trump</mark> statue. Updated: 6:16 am OXFORD, Miss. (AP)--Georgia first-year coach Kirby Smart gets a second crack at trying to slow down Mississippi quarterback Chad Kelly. posted: September 23 FORT ATKINSON--Badger Bank has announced the promotions of Leanne Lehmann and Gina Gehring. Updated: August 30 Rogelio V. Solis Top-ranked Alabama rallies, beats No. 19 Ole Miss 48-43 Mississippi quarterback Chad Kelly (10) attempts a pass against Alabama in the first half of an NCAA college football game, Saturday, Sept. 17, 2016 in Oxford, Miss. (AP Photo/Rogelio V. Solis) Posted: Friday, September 23, 2016 7:01 am OXFORD, Miss. (AP)--Georgia first-year coach Kirby Smart gets a second crack at trying to slow down Mississippi quarterback Chad Kelly. He knows from experience it won't be easy. \"He's a little bit like a rodeo bull rider,\" Smart said. \"This guy will do anything and he's good at it. Trust me, I know from experience. He's good .\" The 12th-ranked Bulldogs (3-0, 1-0 Southeastern Conference) are the higher-ranked team in this matchup, but will still be about a touchdown underdog when they travel to face the 23rd-ranked Rebels (1-2, 0-1) on Saturday. Georgia has won 10 straight games in the series dating back to 1996. Smart was Alabama's defensive coordinator last season when Kelly torched the Tide for 341 yards passing, three passing touchdowns and one rushing touchdown in a 43-37 victory for the Rebels. Now Smart is ready for round two. He said the goal is to keep Kelly off balance, and used a baseball metaphor to illustrate the Bulldogs' plan. \"You've got to be able to pitch,\" Smart said. \"You've got to throw the fastball, you've got to throw a curveball. You've got to be able to change it up and you've got to throw the slider. You can't do the same thing all the time .\" It is obvious Smart has a lot of respect for Kelly. The Ole Miss quarterback said the feeling is mutual when it comes to Georgia's defense. \"They're big and athletic. They play really smart,\" Kelly said. \"I think that's a compliment to their head coach and their defensive coordinator. They do a really good job of staying in the right place. We have to make sure we play hard and keep the turnovers down .\" Kelly has thrown for 953 yards and 10 touchdowns this season, but his four interceptions have been costly. One was returned for a touchdown last week in the Rebels' 48-43 loss to Alabama. \"I have to take it upon myself to keep putting it in my head to take care of the ball,\" Kelly said. ___ Some other things to watch when Ole Miss hosts Georgia on Saturday: ENGRAM'S THE TARGET: Ole Miss senior tight end Evan Engram has emerged as Kelly's favorite target this season. He's caught 20 passes for 302 yards this season. Both numbers are tops in the nation for a tight end. Said Kelly: \"He's a heck of an athlete. He's a playmaker, he's aggressive. He likes to hit people, too. He's a blocker, so he's not just a receiving tight end .\" REBELS STRUGGLE TO KEEP LEADS: Ole Miss has already let two big leads get away during losses this season. The Rebels led Florida State 28-6 on Sept. 5 before eventually losing 45-34. Last weekend, Ole Miss had a 24-3 lead on No. 1 Alabama before the Tide rallied to win 48-43. GEORGIA CAN COME BACK: While Ole Miss has had trouble keeping leads, Georgia has proven adept at coming back after falling behind early in games. The Bulldogs trailed by 10 points to both North Carolina and Missouri before winning both games. CHUBB'S RESURGENCE: Georgia running back Nick Chubb has had a great start to the season after missing a big chunk of 2015 with a serious knee injury. The 5-foot-10, 228-pound junior has run for 365 yards and three touchdowns through three games. Said Ole Miss coach Hugh Freeze: \"Another great test for sure. They are going to present a great challenge to us in the run game and we've got to be sure that our eyes are disciplined .\" MCKENZIE EMERGES: Georgia receiver Isaiah McKenzie is having a breakout year, catching 18 passes for 305 yards and four touchdowns in three games. He had 10 catches for 122 yards and two touchdowns in last week's win against Missouri. ____ Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP. AP College Football website: www.collegefootball.ap.org.", "articleID": "2016092312_00496241_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-09-23", "url": "http://northjersey.com/news/education/student-athletes-eligible-to-opt-out-of-gym-under-proposed-policy-1.1665871", "content": "& copy; 2016 North Jersey Media Group September 23, 2016 Last updated: Friday, September 23, 2016, 2:46 PM Student-athletes eligible to opt out of gym under proposed Northern Valley Regional policy By Samantha Karas Staff Writer | Northern Valley Suburbanite OLD TAPPAN - The Northern Valley Regional Board of Education plans to amend a policy that allows student athletes to substitute one marking period of physical education for a study period during a season in which they are playing a sport. The second reading of the amended policy will be held during the Board of Education's Sept. 26 regular meeting, interim Superintendent <mark>Geoffrey Gordon</mark> said. The changes include what types of sports are eligible, as well as a clarification that the only sports permitted for the physical education substitution are Northern Valley Regional sports. The board is making the policy clearer, said Demarest Principal James Santana. <mark>Gordon</mark> said while some school districts allow students to use club teams after school as an alternative for physical education, those credentials do not apply under the Regional District policy. The district policy is to comply with a June 2009 Department of Education regulation that requires all district boards of education to create a process to allow \"individualized student learning opportunities that meet or exceed the Core Curriculum Content Standards .\" For the Northern Valley Regional school district, these individualized student learning opportunities allow students to take courses for credit if the student fails a course and has to remediate, the course is not offered at the district or if the student wishes to enroll in college level courses, participate in an independent study or a senior internship. The policy also allows for an alternative for physical education. Commonly known as the \"Option II\" policy, students who participate in these alternative programs must meet \"local district curricular objectives\" and the principal should \"carefully document the student's achievement .\" According to the Regional District's physical education criteria for acceptance under Option II, application for the alternative is valid for one physical education course for the specified school year and does not apply for health education or Project Adventure, a physical education course that emphasizes teamwork and leadership skills through adventure-based learning. The physical education alternative only applies for the student during their participating sports season and the student will receive either a \"pass\" or grade of \"F\" based on completion of requirements. Allowing students to swap a study hall for gym aims to alleviate some of the stress of juggling academics and school sports, <mark>Gordon</mark> said. \"We have kids taking five or six AP courses and they go to a top school and they often play sports,\" <mark>Gordon</mark> said. \"The idea was to give kids who legitimately loaded up on work and, during one specific season they are playing a year, they would have some relief where they could go to the library media center and catch up on studies while meeting state standards for physical education .\" State requirements say that a student has to participate in 150 minutes of physical education a week, he added, so Option II \"is an alternative to that .\" \"It's an alternative to being in the classroom and meeting the core curriculum standards,\" <mark>Gordon</mark> said. Option II is currently available only for 11th and 12th-graders, Santana said. Tenth-graders will not be able to use the alternative because of Project Adventure and health class requirements mandated by the state. Email: karasa @ northjersey.com", "articleID": "2016092318_00942461_W", "names": {"Geoffrey Gordon": ["Q1502982", "Q56055704", "Q57437749"]}}, {"date": "2016-09-23", "url": "http://www.centralmaine.com/2016/09/23/two-indicted-on-attempted-murder-charges-following-augusta-wal-mart-parking-lot-shooting-incident/", "content": "AUGUSTA--Two men accused of shooting handguns at each other in the parking lot at Wal-Mart during an altercation that ended when armed bystanders intervened were indicted Friday on charges including attempted murder. Frankie Dejesus, 27, of Augusta, was indicted on charges of attempted murder, aggravated assault, and reckless conduct with a firearm. Reginald McBride, 45, of Harlem, New York, was indicted on charges of attempted murder, aggravated trafficking in scheduled drugs, reckless conduct with a firearm, and four counts of possession of a firearm by a prohibited person. The indictments stem from a June 26 shooting and fight a judge described as \"like an old Western shoot-out in the Wal-Mart parking lot .\" Frankie Dejesus Samantha Tupper Diana Davis REginald McBride Search photos available for purchase: Photo Store → Also indicted Friday, in connection to the same incident, were Samantha E. Tupper, 24, of Augusta, on charges of unlawful furnishing of scheduled drugs and hindering apprehension or prosecution, and Diana M. Davis, 29, of Rochester, New York, on a charge of aggravated assault. An indictment is not a determination of guilt, but it indicates that there is enough evidence to proceed with formal charges and a trial. Police say McBride and Dejesus fired guns at each other during a dispute about money in the parking lot of the Augusta Wal-Mart, though no one was struck by a bullet during the altercation. An affidavit by Augusta Police Detective Brian Wastella says Tupper had been driving in a Ford Taurus to Wal-Mart when she picked up McBride on Mount Vernon Avenue. A car with three women passengers in it, and Dejesus driving, approached them. Two of the women got out and got into Tupper's vehicle, and both vehicles went to Wal-Mart, parking side by side. All the people got out of both vehicles. Wastella said McBride, Tupper, Dejesus and Davis argued. McBride said Tupper and he got back into the Taurus when \"he observed Dejesus point a handgun out the driver's side of his vehicle at him. McBride stated in fear of being shot, McBride drew his handgun and began firing at Dejesus,\" Wastella wrote. Dejesus, meanwhile, told police McBride pulled the gun first and began shooting, so Dejesus began firing back. Wastella said McBride got out of the car when the shooting stopped and began fighting with Dejesus and Davis, with the two beating on him. Tupper told police Dejesus hit McBride with the butt of a gun while Davis held him. Then, according to police accounts of the incident, two bystanders, both legally armed with guns, broke up the confrontation, taking out their guns and telling the suspects to stop fighting. Tupper and McBride drove away before police arrived. Police later found them at Tupper's residence, on Mayflower Road. Wastella said police found 42 grams of heroin on McBride. The indictment for McBride notes he \"did intentionally or knowingly shoot at Frankie Dejesus,\" while Dejesus' indictment likewise states he \"did intentionally or knowingly shoot at Reginald McBride .\" McBride's indictment indicates, regarding the four counts of possession of a firearm by a prohibited person, that McBride was convicted of possessing cocaine with intent to distribute in Virginia in 1996. The indictment states McBride owned, possessed or controlled four firearms--two .22 caliber handguns, a .32 caliber handgun, and a 9 millimeter handgun. Davis' indictment states she caused bodily injury to McBride, with the use of a firearm. While no one was shot in the incident, McBride suffered lacerations to his head, which police said was from being hit by the butt of a gun during the fight that ensued after four shots were fired. <mark>Keith Edwards</mark>--621-5647 [email protected] Twitter: @ kedwardskj Share Read or Post Comments Were you interviewed for this story? If so, please fill out our accuracy form Send questions/comments to the editors.", "articleID": "2016092400_00183968_W", "names": {"Keith Edwards": ["Q18165711", "Q6384307", "Q6384308", "Q6384309", "Q6384310"]}}, {"date": "2016-09-24", "url": "http://tribune.com.pk/story/1187590/kumar-sanus-concert-cancelled-lahore-retaliation-threats-pakistani-actors/", "content": "The Express Tribune Share Tweet Email Forthcoming visit of Indian folk singer <mark>Shamsher Singh</mark> Mahdi to Lahore has also been postponed. PHOTO: Reuters LAHORE: Indian singer Kumar Sanu's concert scheduled to be held in Lahore on Monday has been cancelled in retaliation to threats issued by an Indian nationalist party to Pakistani actors. The concert organised to pay tribute to Abdul Sattar Edhi was scheduled to be held at Lahore's Royal Palm Country Club on September 26. Tickets for the event have already been sold and sources claim the organisers had raised Rs4 million from the sales. Indian nationalist party gives Pakistani actors 48-hour ultimatum to leave country The event has been cancelled following threats from Indian nationalist party Maharashtra Navnirman Sena (MNS). The film workers' association of MNS on Friday \"ordered' all Pakistani actors working in India to leave the country in 48 hours .\" We gave a 48-hour deadline to Pakistani actors and artists to leave India or the MNS will push them out, \"The Indian Express quoted Amey Khopkar of the MNS Chitrapat Sena as saying. Khopkar also threatened to assault Pakistani artists and those who cast them.", "articleID": "2016092412_00143320_W", "names": {"Shamsher Singh": ["Q24175058", "Q48869003"]}}, {"date": "2016-09-25", "url": "http://in.reuters.com/article/usa-election-clinton-idINKCN11V0MW", "content": "For some Democrats, it's voting for Clinton - and keeping it quiet World News | Sun Sep 25, 2016 | 9:08 pm IST For some Democrats, it's voting for Clinton - and keeping it quiet U.S. Democratic presidential candidate Hillary Clinton talks with a member of her staff inside of her campaign plane as she flies back to White Plains, U.S. September 21, 2016. REUTERS/Carlos Barria By Amy Tennery | NEW YORKNEW YORK One would expect voters from the heavily Democratic Brooklyn neighborhood of Cobble Hill to pick presidential candidate Hillary Clinton in the Nov. 8 general election. Just don't expect them to advertise it. Like lawns and windowsills in liberal pockets across the country, much of the neighborhood is bereft of pro-Clinton signage in the final weeks before the election. It's a stark contrast to the 2012 and 2008 campaigns, when President Barack Obama whipped up a frenzy of support from Democrats and his signature \"Hope\" and \"Forward\" signs were ubiquitous. The scarcity of lawn and window signs is an indication of the Democratic nominee's struggle to generate enthusiasm among left-leaning voters, a challenge that's borne out in polling data, and could potentially haunt her if voters fail to turn out on election day. Clinton leads Republican challenger <mark>Donald Trump</mark> by four percentage points among likely voters, according to a Reuters/Ipsos poll released Friday. But Americans of all political stripes have been more critical of Clinton than they were of Obama when he was running for his second term four years ago, according to the daily tracking poll. Among Democrats, 78 percent say they have a favorable view of Clinton, lower than the 89 percent favorability rating Obama had at this point in the race in 2012. Clinton's favorability drops to 28 percent among independents versus Obama's 47 percent. Nancy Kimmel Viola, a 63-year-old social worker who lives about a mile away from Clinton's campaign headquarters in Brooklyn, keeps a \"Bernie 2016\" sticker taped to the front door of her Carroll Gardens home, a vestige of her support for the unsuccessful bid of Sen. Bernie Sanders. While she plans to vote for Clinton, she confesses that her \"heart's not in it .\" \"I have to vote for her .\" Viola said. \"Having <mark>Trump</mark> in there is too scary .\" In Denver, residents in the Democratic stronghold of Park Hill posted many yard signs over a local zoning issue, but few for the presidential race. \"Most of us around here will vote Democratic, we always do, but we're not overly enthusiastic for Clinton,\" said resident Pablo Marron. \"But we are united in our opposition to <mark>Trump</mark>.\" \"HOLD YOUR NOSE' In the heavily Democratic Denver suburb of Northglenn, banners for local office-seekers littered a major roadway, but there were no accompanying Clinton signs. In the affluent liberal Washington DC suburb of Chevy Chase, Maryland, signs for the Democratic nominee appeared only roughly once every 10 blocks. The lack of enthusiasm isn't just hitting the Clinton campaign. Americans from both major parties say they are generally less interested in voting this year than they were in 2012, according to the Reuters/Ipsos opinion poll, which compared results gathered during the first 20 days of September with the same period of 2012. The Clinton campaign did not respond to emailed requests for comment. Clinton's online store displayed roughly a dozen different signs and banners for sale, ranging from an 11-inch by 17-inch sign, sold at $10 for a pack of two, to a four-foot by six-foot\" Hillary for America \"banner, which retailed for $100. Sales data was not immediately available and a request for comment from the store went unanswered. For some, there is a\" hold your nose quality \"to this election, said Matthew Dallek, associate professor at George Washington University's Graduate School of Political Management .\" The lack of signage \"in liberal enclaves may indicate, Dallek said,\" that there just isn't this sort of enthusiasm that existed for Obama. \"But there are some blocks that buck the trend. On a street in Gowanus, Brooklyn, no fewer than four homes bore pro-Clinton signage, including a life-size cutout of the Democratic nominee, which rests in the windowsill of retired lawyer Chris Morrison's home. The beaming cardboard Clinton prompts many passersby to take pictures, said Morrison, a staunch Clinton supporter .\" You don't see as much signage this time around. In this neighborhood I don't get so concerned (because everyone is) more or less on the same page, \"said Morrison, 66 .\" I worry when I go to some other places. \"(Reporting By Amy Tennery in New York, additional reporting by Keith Coffman in Colorado, Jim Oliphant in Washington, D.C. and Chris Kahn in New York; Editing by Mary Milliken) Next In World News", "articleID": "2016092516_01018920_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-09-25", "url": "http://www.kutv.com:80/news/entertainment/the-magnificent-seven-rides-again-storks-struggles-to-get-off-the-ground", "content": "\"The Magnificent Seven' rides again,\" Storks' struggles to get off the ground by Ryan Painter Denzel Washington stars in Metro-Goldwyn-Mayer Pictures and Columbia Pictures' THE MAGNIFICENT SEVEN. AA Weekend Box Office September 25, 2016 () \"' s\" reign atop the box office came to a close as Antoine Fuqua's reimagining of 1960's \"\"rose to the top with an opening weekend of $35 million. Some projections had the film coming in at over $40 million. Considering the film's $90 million budget, there is still a great distance for these cowboys to cover before the film will turn a profit. It will be interesting to see how the film does overseas where the star power of the cast, which features Denzel Washington, <mark>Chris Pratt</mark>, Peter Sarsgaard and Lee Byung-hun, is likely to have a slightly stronger impact. It might not be a massive hit, but\" The Magnificent Seven \"will likely turn a profit and that's not something that many contemporary westerns can claim. KUTV Sully The Magnificent Seven In second place is\" , \"the new animated adventure from Warner Bros., with $21.8 million. That's decidedly less than the $30 million that the film was expected to bring in. Still, the film looks strong internationally where it has already earned $18 million. I expect\" Storks \"to have legs, particularly because next week's\" Miss Peregrine's Home for Peculiar Children \"appears to be targeting an older audience. Storks In its third weekend\" Sully \"added $13.8 million. Tom Hanks and <mark>Clint Eastwood</mark>'s film has now earned $92 million domestically. Add in early international numbers and the film has already earned more than $125 million. Hank's\" Bridge of Spies \"only managed $72 million domestically with a worldwide total of just $165 million after 21 weeks of release .\" Sully \"will likely blow past those numbers .\" \"fell 47% for $4.5 million in its second weekend. Domestic totals now sit at a disappointing $16.4 million. However, the international numbers are extremely robust and push the worldwide total above $80 million. Considering the film cost only $35 million, there's a good chance that the film has already turned a modest profit. Suddenly a fourth film seems incredibly likely. Bridget Jones's Baby Oliver Stone's\" \"brought in $4.1 million. That pushes the biopic's earnings to just over $15 million. I've yet to see any international numbers, but if this film is going to break even its going to need to perform well overseas. Snowden\" \"brought in an additional $3.9 million for a domestic total of $16 million. That's a disappointing total for the filmmakers, but the film will still make money. Just not the kind of money that Lionsgate was banking on. Blair Witch close", "articleID": "2016092517_00968798_W", "names": {"Chris Pratt": ["Q503706", "Q5107796"], "Clint Eastwood": ["Q2979323", "Q43203"]}}, {"date": "2016-09-26", "url": "http://tvtechnology.com/thewire/joystick-audio-to-exclusively-represent-prism-sound-and-sadie-in-benelux/7030/view", "content": "Joystick Audio To Exclusively Represent Prism Sound and SADiE in Benelux 9/26/2016 5:03:00 AM By Sue Sillitoe, White Noise PR Acclaimed pro audio manufacturer Prism Sound has appointed Joystick Audio as its exclusive distributor in Benelux. Established 15 years ago by Raf Lenssens, Joystick Audio provides the Benelux market with access to high-end equipment and services from pro audio manufacturers such as CEDAR, PMC Monitors, Solid State Logic and Crane Song. As well as acting as a sales outlet, the company also offers support, consultancy and project engineering for the studio and broadcast industries. \"Our manufacturing partners all deliver added value in terms of functionality or extra features,\" says RAF Lenssens. \"The people behind the products are just as important as the equipment because good communication on a technical level is vital in our industry .\" The company will now represent Prism Sound's entire recording and post production portfolio including its flagship ADA-8XR multichannel converter and its Award-winning range of audio interfaces such as Lyra, Titan and Atlas. Joystick Audio will also represent all SADiE products including SADiE 6 software, which brings SADiE's high-end DAW editing capabilities into the computer environment. \"Prism Sound and SADiE offer superb products that are fully complementary with the other brands we represent,\" Raf Lenssens explains. \"Prism Sound's ADA-8XR converter is world-famous and the addition of products like Lyra and Titan to the company's range have opened up new possibilities for audio engineers to create high quality and highly flexible set-ups .\" Lenssens adds that SADiE was one of the first DAWs to enter the Benelux market and has long been the choice of many acclaimed engineers and studios, both for digital recording and mastering. \"The power and flexibility of its software make it a great choice for many different applications,\" he says. <mark>Mark Evans</mark>, Channel Sales Manager for Prism Sound and SADiE, says: \"We are delighted to have Joystick Audio representing our products and look forward to a long and profitable relationship with them. The company shares our no compromise approach to customer support and we feel that, with Joystick, our products and our brand are in safe hands .\" Joystick Audio is planning a number of special events over coming weeks to re-introduce customers in Belgium and the Netherlands to the Prism Sound and SADiE ranges. These will take the form of product demonstrations by Joystick Audio's product support engineers Mathijs Indesteege and Jules Fransen, which will take place in a real studio environment. The company is also supporting Prism Sound's Mic To Monitor event, which is scheduled for October 17th at the Abbey Road Institute in Amsterdam. For more information, please visit Joystick Audio's website at: www.joystick.be-ends-About Prism Sound Founded in 1987, Prism Sound manufacture high-quality professional digital audio equipment for the International broadcast, film, music production, manufacturing and telecommunications sectors. The company's product range includes the Prism ADA-8XR precision 8-channel converter unit, which is regularly used for music and film soundtrack projects by clients such as EMI Abbey Road, BBC, Sony, Lucasfilm and Walt Disney. Prism Sound also manufactures a range of audio test and measurement products, including the de facto dScope Series III audio analyser system. For more information: www.prismsound.com", "articleID": "2016092609_00326835_W", "names": {"Mark Evans": ["Q12795898", "Q14946841", "Q16194528", "Q16210885", "Q20090670", "Q358208", "Q43006927", "Q46585872", "Q57561127", "Q59219170", "Q6767546", "Q6767547", "Q6767549", "Q6767552"]}}]