[{"date": "2016-09-26", "url": "http://fox23.com/web/koki/news/national/key-bridge-case-witness-traffic-problems-email-no-joke/450561227", "content": "Key bridge case witness: \"Traffic problems' email no joke by: DAVID PORTER, Associated Press Updated: Sep 26, 2016 - 10:51 AM Twtter NEWARK, N.J. (AP)--The government's key witness in the George Washington Bridge lane-closing case said that he interpreted an email from one of the defendants that it was\" time for some traffic problems \"as an order to put a political revenge plot into action. David Wildstein worked for the Port Authority of New York and New Jersey, the agency that operates New York-area bridges, tunnels, ports and airports. He pleaded guilty last year to conspiring to cause traffic gridlock near the bridge to punish Fort Lee's Democratic mayor for not endorsing Republican Gov. Chris Christie. Bridget Kelly, Christie's former deputy chief of staff, has claimed the email from mid-August 2013 was a joke, but Wildstein testified Monday that he didn't take it as one .\" I understood that to mean it was time to change the lanes configuration at the upper level of the George Washington Bridge in order to create traffic in the borough of Fort Lee, \"Wildstein said .\" We had had joking emails before. I did not think she was joking. \"The government contends that a month later, Wildstein, Kelly and Port Authority executive Bill Baroni put the plan into action and caused four days of traffic jams. Baroni and Kelly are on trial for fraud, conspiracy and civil rights counts. Christie hasn't been charged, but prosecutors say Wildstein will testify that he told the governor about the plot on the third of the four days of traffic chaos. Christie has denied that. Both defendants say Wildstein conceived and carried out the scheme in September 2013. The bridge, one of the world's busiest, spans the Hudson River and connects Fort Lee, New Jersey, with New York City. Last week, Wildstein testified that Christie's office used the Port Authority as a source of political favors for local Democratic officials whose endorsements were sought for his 2013 re-election. Christie wound up winning easily. Wildstein said Christie and his former campaign manager, Bill Stepien, were among those who discussed the strategy at a meeting about Christie's re-election. Stepien and another former Christie aide who testified Friday, Matt Mowers, now work for Republican presidential nominee <mark>Donald Trump</mark>'s campaign. Kelly and Baroni have pleaded not guilty and have said the government has twisted federal law to turn their actions into crimes. They also have said other people with more power and influence were involved in the lane closures but aren't being prosecuted. Wildstein also testified he told Stepien about the lane closures in mid-August 2013, shortly after his email and discussion with Kelly, and told Stepien he was going to\" create the cover of a traffic study. \"Mowers, a former Christie campaign staffer who worked with Kelly in early 2013, testified last week that Kelly's office kept a spreadsheet noting what favors mayors had received and, on a scale from 1 to 10, their likelihood of endorsing Christie. Prosecutors say Fort Lee Mayor Mark Sokolich, one of the Democratic mayors who declined to endorse Christie, was the target of the traffic jam scheme in September 2013. Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2016092616_00113887_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-09-27", "url": "http://comicbook.com/2016/09/27/i-kill-giants-has-started-filming/", "content": "I Kill Giants Has Started Filming Megan PetersPin to Pinterest It's been just over a year since sources confirmed that the graphic novel I Kill Giants was being adapted into a film. And, now, the project looks like it has started principal shooting. Creator <mark>Joe Kelly</mark> announced the news on Twitter earlier today and even gave a shoutout to co-creator Ken Niimura. In other news, #IKillGiants has begun principal shooting today. So excited, so proud and so lucky I met @ ken_niimura!--<mark>Joe Kelly</mark> (@ JoeKellyMOA) September 27, 2016 \"In other news, [I Kill Giants] has begun principal shooting today. So excited, so proud and so lucky I met [Ken Niimura]!\" <mark>Joe</mark> wrote. Over the past year, several big casting confirmations for the film were released to fans' excitement. Zoe Saldana signed on to I Kill Giants and will be playing a school psychologist. Newcomer Madison Wolfe will be playing the film's heroine Barbara, and Imogen Poots was cast in a an unknown role as well. When the film was first announced, <mark>Joe</mark> had the honor of telling fans the good news. He revealed that Treehouse Pictures agreed to finance the project. Anders Walter will direct the film while Chris Colombus stands in as producer. <mark>Joe</mark> adapted the screenplay for I Kill Giants. Speaking about the project, Chris explained that, \"<mark>Joe Kelly</mark> has written a deeply insightful story about a child using fantasy to navigate through a harsh reality, and I am excited and proud to finally be able to bring this wonderful material to the screen .\" <mark>Joe</mark> also talked about his feelings about the theatrical adaptation, saying, \"I'm overwhelmed by the enthusiasm, vision and sheer talent of the team we've assembled. Chris and Anders understand the book on an instinctive level and will translate it into a hell of a film. I could not be happier .\" If you're unfamiliar with I Kill Giants, then you should know the story started off as a graphic novel in 2008. <mark>Kelly</mark> created the project with artist J. M. Ken Niimura and pitched the story to Image Comics. If you'd like to hear a bit about the story, <mark>Kelly</mark> provided a very succinct description during an interview he did with Newsarama. \"It's a story about a girl who's a bit of an outsider--she's smart-assed and funny, but totally in our geekland: she's obsessed with Dungeons & Dragons, she doesn't have a lot of friends, she's a bit of a social misfit,\" he said. \"She's taken her fantasy life a little far, and really only talks about giants to people. She's convinced that giants are real and giants are coming, and it's her responsibility to stop them when they show up. This weird little fantasy life that she's going has started seeping into her real life, and as we see things from her point of view, we see that she sees pixies and she sees signs in the clouds and other things that might be telling her that bad things might be coming .\" Since its publication, I Kill Giants has won a Gaiman Award (an overseas manga award selected by readers), the International Manga Award, and was even listed in the \"Top Ten Great Graphic Novels for Teens\" list by the Young Adult Library Services Association in 2010. It was also awarded the title of \"Best Indy Book of 2008\" by IGN and was an Eisner Award finalist.", "articleID": "2016092720_00418166_W", "names": {"Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"]}}, {"date": "2016-09-28", "url": "http://www.morningstar.co.uk/uk/news/AN_1475054874644950500/extra-britain-goes-on-holiday-after-brexit-vote-as-tui-bookings-rise.aspx", "content": "Add Your Note (Optional): LONDON (Alliance News) - Tour operator TUI Group on Wednesday said the summer 2016 holiday season is closing as expected, while winter 2016/17 also is trading in line with expectations, ahead of the close of its financial year, adding to positive updates provided by TUI's travel-industry peers earlier in the week. TUI said the summer 2016 season is 97% sold to date, with revenue and bookings up 1% year-on-year, driven by a strong performance in the UK business, where revenue and bookings are up 5%. Trading for the winter 2016/17 season is in line with the company's expectations as well, TUI said, with revenue up 11% on this time last year and bookings up 5%. TUI said this was driven in particular by UK long-haul growth. TUI added that it is confident of delivering between 12% and 13% growth in underlying earnings before interest, tax and amortisation in its full year which ends on Friday. \"This demonstrates the strength of our integrated business model and the success of our content centric strategy, as well as the continued delivery of our merger synergies,\" Chief Executive Friedrich Joussen said in a statement. TUI will release its full-year results on December 8. On Tuesday, rival <mark>Thomas Cook</mark> Group PLC had released a trading update saying its summer 2016 holiday season was closing as expected as well, while winter 2016/17 bookings were in line, although its summer bookings figures weren't as strong as TUI's. <mark>Thomas Cook</mark> said summer bookings fell by 4% overall, but would have grown by 8% excluding Turkey, which has suffered a reduction in demand over the past year due to the terrorist attacks and political turmoil plaguing the country. This was, however, in line with <mark>Thomas Cook</mark>'s expectations, with 89% of the summer programme sold, down from 92% the year before. Winter bookings, meanwhile, are up 8% so far. Like TUI, <mark>Thomas Cook</mark> maintained its full-year underlying earnings before interest and tax guidance, of GBP300 million, which will be down on the GBP310 million made the year before. On Monday, cruise operator Carnival PLC had reported growth in profit in the third quarter of its financial year to USD1 .47 billion from USD1 .25 billion the year before, as revenue rose to USD5 .10 billion from USD4 .88 billion. Carnival said it is on track to deliver 25% earnings growth in the full year. Shares in TUI were trading up 1.8% at 1,106.00 pence on Wednesday, while <mark>Thomas Cook</mark> shares were up 1.5% to 70.81 p and Carnival shares were up 1.6% at 3,787.00 p. By Karolina Kaminska; karolinakaminska @ alliancenews.com @ KarolinaAllNews Copyright 2016 Alliance News Limited. All Rights Reserved. Share via Email", "articleID": "2016092809_00512614_W", "names": {"Thomas Cook": ["Q16205324", "Q47452628", "Q53952787"]}}, {"date": "2016-09-28", "url": "http://www.bloomberg.com/news/articles/2016-09-28/gold-holds-losses-as-u-s-consumer-confidence-boosts-dollar", "content": "Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Google + E-mail Share on Twitter Share on WhatsApp Silver is looking shinier than ever, at least in the eyes of the exchange-traded fund investors. Holdings in ETFs backed by silver climbed to the highest since they were created about a decade ago, according to data compiled by Bloomberg. This quarter, investors poured $625.5 million into iShares Silver Trust,, the most since 2010, data show. iShares owns more than half of total silver holdings in ETFs. Silver has rallied 39 percent this year, helped by a tailwind from gains in gold, as the Federal Reserve kept U.S. interest rates steady and other central banks increased stimulus to support growth. An improving outlook for the U.S. economy and Chinese manufacturing has also benefited silver, with industrial use accounting for more than half of the metal's demand. \"Some of the data that we've seen from an industrial standpoint has been relatively decent,\" <mark>Tim Evans</mark>, the chief market strategist at Long Leaf Trading Group Inc. in Chicago, said in a telephone interview. \"Silver having that industrial component, tends to respond more favorably to those kinds of news development than gold does .\" Consumer confidence rose in September to the highest since before the last recession on optimism about the labor market, according to a report from the New York-based Conference Board on Tuesday. The same day, a government report showed profits of China's industrial corporations jumped the most in three years, a report Tuesday showed, adding to evidence of continued stabilization in manufacturing. Silver futures for December delivery slipped 0.2 percent to $19.13 an ounce at 12:19 p.m. on the Comex in New York, paring this quarter's gains for the most-active contract to 2.7 percent. Gold futures for December delivery declined 0.4 percent to $1,324.50 an ounce. In other precious metals and mining news: A gauge of 14 senior global gold producers tracked by Bloomberg Intelligence fell 1.2 percent, with shares of Newcrest Mining Ltd. and Kinross Gold Corp. among the biggest decliners. On the New York Mercantile Exchange, palladium futures gained, while platinum futures fell. Before it's here, it's on the Bloomberg Terminal. LEARN MORE", "articleID": "2016092817_00882588_W", "names": {"Tim Evans": ["Q7803475", "Q7803476"]}}, {"date": "2016-09-28", "url": "http://www.bostonglobe.com/news/nation/2016/09/28/congress-votes-override-obama-veto-bill/DjfRAup4ICADpdLFzbEx1I/story.html", "content": "WASHINGTON--Congress voted overwhelmingly Wednesday to allow families of Sept. 11 victims to sue Saudi Arabia for its alleged backing of the attackers, handing Barack Obama the first veto override of his presidency. Both the House and Senate voted decisively to reverse Obama's decision to scuttle the legislation. Democrats in both chambers abandoned the president in large numbers despite warnings from Obama and top national security officials that flaws in the bill could put US interests, troops, and intelligence personnel at risk. Advertisement The Senate vote was 97-1. The House vote a few hours later was 348-77. Lawmakers said their priority was the 9/11 victims and their families, not Saudi Arabia. \"The White House and the executive branch (are) far more interested in diplomatic considerations,\" said Senator Chuck Schumer, Democrat of New York and a sponsor of the bill. \"We're more interested in the families and in justice .\" Speaking at a forum in Washington, CIA Director <mark>John Brennan</mark> said he was concerned about how Saudi Arabia, a key US ally in the Middle East, would interpret the bill. He said the Saudis provide significant amounts of information to the United States to help foil extremist plots. \"It would an absolute shame if this legislation, in any way, influenced the Saudi willingness to continue to be among our best counterterrorism partners,\" <mark>Brennan</mark> said. Advertisement <mark>Brennan</mark>, who said he visited lawmakers Wednesday to argue against an override of Obama's veto, noted that there is a tremendous amount of Saudi investment in the United States. \"Do they want to leave them here so they could potentially be attached by some type of court ruling that is going to award the litigants?\" he asked. After senators acted, White House spokesman Josh Earnest called the vote the \"single most embarrassing thing\" the Senate has done in decades and \"an abdication\" of its responsibility. He accused members of the Senate Judiciary Committee of not understanding the legislation and its impact on the military. Five weeks before state and national elections, lawmakers refused to oppose a measure strongly supported by 9/11 families who say they are still seeking justice 15 years after attackers killed nearly 3,000 people. Saudi Arabia is staunchly opposed to the measure. Despite reversing Obama's decision, a group of senators acknowledged that defects in the bill could open a legal Pandora's box, triggering lawsuits from people in other countries seeking redress for injuries or deaths caused by military actions in which the United States may have had a role. In a letter sent Tuesday to Senate minority leader <mark>Harry Reid</mark>, Obama said the bill would erode sovereign immunity principles that prevent foreign litigants \"from second-guessing our counterterrorism operations and other actions that we take every day .\" <mark>Reid</mark> was the lone senator to side with the president. But proponents of the bill dismissed Obama's concerns as unpersuasive. Senator John Cornyn of Texas, the Senate's No. 2 Republican, and other supporters said the bill is narrowly tailored and applies only to acts of terrorism that occur on US soil. \"This bill is about respecting the voices and rights of American victims,\" Cornyn said. Families of the victims and their attorneys dismissed concerns over the legislation as fear-mongering. Senator Ben Cardin of Maryland, one of the Democrats who broke with Obama and voted to override, said, \"The risks of shielding the perpetrators of terrorism from justice are greater than the risks this legislation may pose to America's presence around the world .\" The legislation gives victims' families the right to sue in US court for any role that elements of the Saudi government may have played in the 2001 attacks. Fifteen of the 19 Sept. 11 hijackers were Saudis. Courts would be permitted to waive a claim of foreign sovereign immunity when an act of terrorism occurred inside US borders, according to the terms of the bill. A group of national-security minded legislators pledged to discuss how to repair problem areas during the upcoming lame-duck session of Congress. But the fact that legislation could pass both chambers of Congress without closer scrutiny left at least a few senators chiding themselves for not examining its ramifications more closely. The Justice Against Sponsors of Terrorism Act moved to the floor of the Senate in May and was passed by voice vote. The bill cleared the House earlier this month, also by voice vote. \"We didn't pay much attention to this,\" said Senator Dianne Feinstein of California, the top Democrat on the Senate Intelligence Committee. \"And boy is that ever a lesson learned .\" Obama vetoed the measure last week, telling lawmakers the bill would make the country vulnerable to retaliatory litigation. In his letter to <mark>Reid</mark>, the president said other countries could attempt to use law to justify similar immunity exceptions to target US policies and activities that they oppose. In a separate letter sent Monday to a senior House member, Defense Secretary Ashton Carter described the potential for foreign litigants to seek classified intelligence data and analysis and sensitive operational information to establish their cases in what could be an \"intrusive discovery process .\" Missing the vote were Senator Bernie Sanders, independent of Vermont, and Tim Kaine, Democrat of Virginia. Of the Massachusetts delegation, both Senators Elizabeth Warren and Edward Markey and Representatives Michael Capuano, <mark>Katherine Clark</mark>, <mark>Joseph Kennedy</mark> III, William Keating, <mark>Stephen Lynch</mark>, <mark>Richard Neal</mark>, and Niki Tsongas backed the override of Obama's veto. James McGovern and Seth Moulton voted to uphold the veto.", "articleID": "2016092821_00608163_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "John Brennan": ["Q16229793", "Q27044621", "Q58198198", "Q6223063", "Q6223068", "Q984191"], "Joseph Kennedy": ["Q18153879", "Q21289316", "Q27981477", "Q8041616"], "Katherine Clark": ["Q58757120", "Q6376330"], "Richard Neal": ["Q1464697", "Q7328011"], "Stephen Lynch": ["Q21063195", "Q2164670", "Q2344921", "Q7609833", "Q7609834", "Q7609835", "Q7609836"]}}]