[{"articleID": "2015032515_00068687_W", "names": {"Barbara Jordan": ["Q4859035", "Q4859322", "Q53570"]}, "date": "2015-03-25", "url": "http://southfloridagaynews.com/Community/gay-history-101-women-s-history-month.html", "content": "Gertrude \"Ma\" Rainey (1886 -1939) is known as the Mother of the Blues. Although Ma Rainey was not the first black woman to sing the Blues, she has been credited with its rise in popularity. She sang about loving women in the 1920s. Gladys Bentley (1907 -1960) was a popular Blues singer during the 1920s Harlem Renaissance. She dressed in men's clothing, her signature look was a tuxedo and top hat. She was very out about her sexual orientation and reputation as a \"bulldagger' or butch lesbian and she openly flirted with women in the audience. Lorraine Hansberry (1930-1965) was an American playwright, best known for\" A Raisin in the Sun, \"which in 1959 became the first play by an African American woman to open on Broadway. It also won the New York Drama Critics Circle Award as the best play of the year. Although she was known as a supporter of equal rights regardless of sexual orientation, it wasn't until after her death that her own sexual orientation was revealed. <mark>Barbara</mark> Gittings (1932 -2007) was an early gay and lesbian rights activist and was instrumental in the forming of Daughters of Bilitis, one of the first lesbian organizations in the U.S. <mark>Barbara</mark> Gittings helped organize gay rights demonstrations in front of the White House and in front of Independence Hall in Philadelphia in 1965 to protest federal employment discrimination. <mark>Barbara Jordan</mark> (1936-1996) was an accomplished U.S. congressional representative from Texas and was the first African American congresswoman to come from the Deep South. Although she was in a long-term relationship with another woman for more than 20 years, she never publicly came out. It was only after her death in 1996 that the press reported about her sexual orientation. Ann Bannon (September 15, 1932) is a celebrated author of lesbian pulp fiction dating back to 1950 and 1960s. Although she was married and not quite living a lesbian life when she penned her popular books, Ann Bannon, author of Odd Girl Out, Beebo Brinker, I am a Woman, Journey to a Woman and Women in the Shadows, struggled with same-sex attractions and came out later in life. In fact, she calls her books\" love letters to the women I thought I would never get to know. \"Margarethe Cammermeyer (March 24, 1942) is the highest ranking military official to come out while in the service. Prior to\" Don't Ask, Don't Tell \"she challenged the military policy banning gays and won the right to serve. Born in Oslo, Norway she became a U.S. citizen in 1960. She had a 15-year marriage to a man and they had four sons. In 1988, when she was 46, she met her partner, Diane Divelbess. Kate Clinton (November 9, 1947) describes herself as a\" fumerist, \"a feminist humorist. She grew up Catholic in New York State and taught high school English for eight years before becoming a comedian. She began her stand-up career in 1981 using her lesbianism, Catholicism and current politics for her jokes. Melissa Etheridge (born May 29, 1961) Grammy and Oscar winner has been out and proud since 1993. She is as well known for her activism and being a breast cancer survivor as she is for her music. Etheridge is known for her mixture of\" confessional lyrics, \"pop-based folk-rock, and raspy, smoky vocals. She has also been an iconic gay and lesbian activist since her public coming out in January 1993. She has received fifteen Grammy Award nominations, winning two, and an Academy Award. In September 2011, Etheridge received a star on the Hollywood Walk of Fame. Phyllis Lyon (November 10, 1924), with her partner Del Martin (1921 - August 27, 2008) were two of the early lesbian rights activists in the U.S. On June 16, 2008, they were the first same-sex couple married in California. The wedding was officiated by San Francisco Mayor Gavin Newsom. Martin and Lyon published two books together,\" Lesbian/Woman \"(1972) and\" Lesbian Love and Liberation \"(1973). The Dinah Shore Weekend was named after the late Dinah Shore - a singer, TV personality and renowned golfer, born Frances Rose Shore, in 1916, who lived in the Coachella Valley and is credited for having founded, in Palm Springs, the Colgate-Dinah Shore Winner's Circle. The Dinah now coincides with the Kraft Nabisco Championship women's golf tournament. The first unofficial Dinah Shore Weekend took place in 1986 when women began to flock to Palm Springs in conjunction with the tournament. After-dinner parties following the golfing turned benefits for the Human Rights Campaign and the AIDS Service Foundation. Mariah Hanson is the promoter of the Dinah Shore Weekend party held every April that attracts thousands of women from all over the world to Palm Springs."}, {"articleID": "2010082414_00222579_W", "names": {"Michael Steele": ["Q331838", "Q443813", "Q51709680"]}, "date": "2010-08-24", "url": "http://ca.news.yahoo.com/s/reuters/100823/us/usreport_us_confidence", "content": "by julie steenhuysen chicago (reuters) - julia wood, a 51-year-old mother of 12 from chicago's east side, has some health insurance through a state program--but is so worried she may lose it she asks not to give her real name. wood's husband, a plumbing contractor, watched his business dry up in 2008 with the mortgage crisis. \"the economy hit us,\" said wood in an interview at the not-for-profit chicago family health center. like millions of americans, she is waiting for healthcare reform legislation signed into law by president barack obama in march to take effect. but like millions of americans, she is not sure what it will do for her. a thomson reuters poll of consumer confidence released on monday shows americans' confidence in their ability to pay for and access healthcare has fallen by 5 percent since december 2009. the thomson reuters consumer healthcare sentiment index, based on a monthly survey of 3,000 consumers, asks if they have had trouble paying for or had to postpone care in the three months prior. and it asks if they expect to in the coming three months. on every survey question, responses were more pessimistic in july than they were in december. \"that's a cause for concern to healthcare providers and policymakers,\" gary pickens, chief research officer at thomson reuters, parent company of reuters, said in a statement. pickens has seen a gradual eroding of confidence since december, despite a few notable peaks, such as in april, the month after congress passed the affordable care act. \"i doubt the average person really knows what has been implemented,\" he said. \"they just know there is a lot of talk and there has been a lot of negative publicity.\" letdown david kendall, a senior fellow for health and fiscal policy at thirdway, a centrist think tank, said dissatisfaction with the current health system likely reflects a letdown after the reform debate subsided. \"the healthcare debate raised people's expectations and there is now disappointment as a result that the problem isn't solved,\" kendall said. he said growing dissatisfaction with healthcare may help democrats who supported health reform a little. but it may also be polarizing. in the thomson reuters poll, republicans tend to have slightly higher confidence about access to healthcare, which may be linked to employment, pickens said. \"clearly, at the top of the pile, the most important factor is having insurance coverage,\" pickens said in a telephone interview. \"it's related to your employment status and, obviously, so many people in the country are out of work.\" republican national committee chairman <mark>michael steele</mark> said in a statement on friday that the white house has failed to win widespread support for health reform. \"for months, the white house promised wavering democrats that the bill would become more popular once it became law. the white house was wrong,\" he said. kendall, however, thinks concerns about the economy will overshadow any concerns about health reform in the midterm elections. \"what matters more to people right now is their concern about the deficit and the economy and their own jobs,\" he said. stephanie washington, a 50-year-old clerk for the chicago public schools, said she hopes healthcare does become an election issue."}, {"articleID": "2018053004_00034933_W", "names": {"James Palmer": ["Q30122660", "Q57198787"]}, "date": "2018-05-30", "url": "http://www.bournemouthecho.co.uk/news/16257421.Healthcare_services_given_funding_to_alleviate___39_bed_blocking__39_/", "content": "File photo dated 25/01/13 of a model posing with a stethoscope, as the National Institute for Health and Care Excellence (Nice) has said that healthcare professionals will be given more help in spotting the crucial early signs of cancer to prevent late d 0 comments HEALTHCARE services in Dorset are set to receive a share of £ 1.4 million to help ease delayed transfers in care. NHS Digital has announced that Dorset is one of seven local authority partnerships successful in bidding for a share of the funds. The money will help digitise assessment, discharge and withdrawal (ADW) notices. A delayed transfer of care is where a patient is ready and safe to leave hospital care, but is unable to do so, and continues to occupy a hospital bed. Dorset NHS patients spend 2,000 days more than they need to in hospital due to delays in transfers of care, or \"bed-blocking .' Systems in place to handle ADWs are currently non-digital and have been identified by local authorities and NHS partners as one of the stumbling blocks to the transfer of care from health to social care settings. <mark>James Palmer</mark>, programme head for the social care programme at NHS Digital, said:\" This funding isn't going to be the whole solution to delays in transfers of care but as a digital substitute for faxes and post, these projects will help smooth the process of moving statutory key information from a healthcare setting to local authority social care. \"0 comments"}, {"articleID": "2018121819_00297187_W", "names": {"Penny Marshall": ["Q237659", "Q3374792"], "Cindy Williams": ["Q266820", "Q5120612"]}, "date": "2018-12-18", "url": "http://chronicle.northcoastnow.com/national-news/2018/12/18/Actress-and-director-Penny-Marshall-dies-at-age-75.html", "content": "Advertisement LOS ANGELES (AP)--<mark>Penny Marshall</mark>, who starred in \"Laverne & Shirley\" before becoming one of the top-grossing female directors in Hollywood, has died. She was 75. Mashall's publicist, Michelle Bega, said <mark>Marshall</mark> passed away in her Hollywood Hills, Calif., home on Monday due to complications from diabetes. <mark>Marshall</mark> starred alongside <mark>Cindy Williams</mark> in the hit ABC comedy \"Laverne & Shirley,\" which aired from 1976 to 1983. As a filmmaker, she became the first woman to direct a film that grossed more than $100 million with \"Big,\" the 1988 comedy starring Tom Hanks. She also directed \"A League of Their Own,\" \"Jumpin' Jack Flash\" and \"Awakenings.\" Related Topics: <mark>Penny Marshall</mark>, Laverne & Shirley Click to view comments Close comments Please enable JavaScript to view the comments powered by Disqus."}, {"articleID": "2012052908_00088406_W", "names": {"Darren Johnson": ["Q17306102", "Q5224992"]}, "date": "2012-05-29", "url": "http://buryfreepress.co.uk/sport/other-sport/county-courting-success-on-their-national-adventures-1-3880041", "content": "can i opt out of receiving cookies? cookies are small data files which are sent to your browser (internet explorer, firefox, chrome etc) from a website you visit. they are stored on your electronic device. this is a type of cookie which is collected by adobe flash media player (it is also called a local shared object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. however, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. the types of cookies we, our ad network and technology partners use are listed below: a tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. to opt out of this type of targeting you can visit the \"your online choices' website by clicking here. google ads? our sites contain advertising from google; these use cookies to ensure you get adverts relevant to you. you can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" your online choices' website by clicking here. webtrends / google analytics? this is used to help us identify unique visitors to our websites. this data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. dart for publishers? this comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. this information is not used by us for any other type of audience recording or monitoring. comscore? comscore monitor and externally verify our site traffic data for use within the advertising industry. any data collected is anonymous statistical data and cannot be traced back to an individual. local targeting? our classified websites (photos, motors, jobs and property today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. these cookies store no personally identifiable information. grapeshot? we use grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. grapeshot stores the categories of story you have been exposed to. their privacy policy and opt out option can be accessed here. subscriptions online? our partner for newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. add this? add this provides the social networking widget found in many of our pages. this widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. published on tuesday 29 may 2012 09:30 county upper school's basketball teams enjoyed a memorable season with no less than five of their sides reaching the last 16 of the national schools basketball tournament. the under-17 boys' team were the stand out performers of the school, reaching the national championship final, only missing out on claiming the title after a hard-fought 85-63 defeat to london representatives st aloysius. four other teams also enjoyed relative success, including the under-14 and under-16 girls' teams, who despite still developing, became suffolk champions back in february. this enabled them to go through to the last 16 of the national competition before both were knocked out by greenwards academy under-14s 84-29 and shenfields under-16s 60-39, respectively. despite the defeats, coach <mark>darren johnson</mark> was left delighted. \"our girls team were outstanding this year and thoroughly deserved to finish where they did,\" he said. \"i am really proud of how we came together, played great team basketball and i am looking forward to helping this group of girls develop as basketball players.\" the under-18 boys' team won their domestic pool stages after defeating both seevic from essex and notre dame high school from norfolk before going on to become east of england champions with a dominating performance against shenfield high school form brentwood, winning the game 94-36. however they could not recreate that form in the national tournament as they knocked out by northampton school with a 73-59 loss. like the under-18s, the under-19s eased through their pool group, only missing out on finishing leaders, due to having their match with milton keynes void. as one of the last 16 teams left in the national tournament, county faced a tough encounter against barking abbey basketball academy, one of the strongest basketball academies in the country. and despite a spirited performance from county they were eliminated following a 83-58 defeat. <mark>johnson</mark> went on to hail county's overall success and stated he is no doubt about the bright future of basketball in the region. appeal for witnesses after late night crash involving mini bus and car on the a11 temperature: 10 c to 19 c wind speed: 12 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. bury free press provides news, events and sport features from the bury st edmunds area. for the best up to date information relating to bury st edmunds and the surrounding areas visit us at temperature: 12 c to 22 c wind speed: 10 mph temperature: 9 c to 17 c wind speed: 12 mph temperature: 5 c to 13 c wind speed: 18 mph temperature: 6 c to 13 c wind speed: 15 mph"}, {"articleID": "2019080304_00070501_W", "names": {"Ken Martin": ["Q11339877", "Q25190506", "Q6388085", "Q6388087"]}, "date": "2019-08-03", "url": "http://www.startribune.com/experts-stamp-out-iowa-museum-hopes-inverted-jenny-a-fake/514491352/", "content": "Experts stamp out Iowa museum hopes: \"Inverted Jenny' a fake By MARGERY A. BECK Associated Press August 2, 2019--7:10 pm Purchase: Order Reprint OMAHA, Neb.--Hopes by a small aviation museum in southwestern Iowa that a stamp in its possession was rare enough to parlay a potential fortune crashed Friday when experts told them it wasn't real, and likely not even worth the paper it was glued upon. The Iowa Aviation Museum in Greenfield, Iowa, has had what it thought was a 1918\" Inverted Jenny \"stamp on public display for some 20 years, dating back to when it was donated to the museum, glued to a board along with several other stamps. A notation from the donor attached to the board speculated then that it was worth about $73,000. Experts at the national stamp convention meeting in Omaha knew immediately the stamp wasn't authentic, said <mark>Ken Martin</mark> with the American Philatelic Society that's holding the show through Sunday.\" It wasn't the right size. It was too small, \"<mark>Martin</mark> said.\" This version was likely cut out of a postage stamp auction catalog. \"An examination under a microscope confirmed experts' initial doubt. A 100-year-old stamp would have been printed from an artist's engraving, so the image under a microscope would appear as a series of lines. A reproduction for printed material decades later would have been comprised of a series of tiny dots, which is what appeared under the scope, <mark>Martin</mark> said. The news was disappointing for those at the museum, which also serves as the home of the Iowa Aviation Hall of Fame and had hoped to auction the stamp for hundreds of thousands of dollars and build a new museum hangar.\" We really didn't know what we had, \"Larry Konz, a tour guide at the museum, said Friday.\" When we were told that we might have the real deal, I thought, \"My God, we might have something quite valuable here, and we've had it hanging on a wall all this time.\" Had it been real, it would be worth between $300,000 and $400,000 at auction, <mark>Martin</mark> said. There were only 100 of the stamps printed in 1918, with the image of a JN-4-H \"Jenny\" biplane accidentally displayed upside-down on a 24-cent stamp. Norma Nielson, of Eugene, Oregon, was at the convention Friday to see for herself if the museum was in possession of one of the few rare and unaccounted stamps. Nielson is a stamp collector who grew up in the museum's hometown of Greenfield, and had put museum officials in touch with the American Philatelic Society to check the stamp's authenticity. \"I knew it was probably a slim chance of it being genuine, given how rare that stamp is,\" she said. \"But, boy, it sure would have been exciting if it had been.\" More from Star Tribune"}, {"articleID": "2019020114_00698689_W", "names": {"Harry Shum": ["Q16905622", "Q348649"]}, "date": "2019-02-01", "url": "http://www.tvguide.com/news/shadowhunters-season-3b-everything-we-know-so-far/?rss=breakingnews", "content": "Share on WhatsApp It's been a long hiatus, hasn't it, fans? Shadowhunters The return of all of our favorite Shadowhunters, Downworlders and Mundanes is just around the corner, and we're just as eager as you are to find out if Clary (Katherine McNamara) is actually dead--yeah right--how Magnus (<mark>Harry Shum</mark> Jr.) will be coping with the loss of his powers, and how this epic series will begin to wrap itself up as enter the final stretch. To help keep track of the madness to come, TV Guide has compiled everything we know about Season 3B so far! It returns Monday, Feb. 25 at 8/7c on Freeform. We had to wait a while (OK, a lot longer than a while), but we finally have a date for the return of Shadowhunters Season 3. The show will be back on Mondays for the final 10 episodes of Season 3, and we'll get an additional 2-hour series finale too. Clary is still around...somehow. Though Clary seemed to meet her pretty nasty demise in the midseason finale last year, Katherine McNamara was obviously still filming for 3B and the 2-hour series finale. Whether she's been blasted to another dimension or she's a ghost/dream/hallucination, you can rest assured that Clary will be back. Executive producer Todd Slavkin told TV Guide that her story in 3B is \"a really cool spin on the books,\" so take that as you will. Subscribe: Apple Podcasts / Stitcher / Google Play / iHeartRadio / TuneIn The first episode back will be a bit of a downer. While we know Clary's fate is probably not as bleak as it's been made out to be, her friends from the Shadow World aren't so lucky. Darren Swimmer called the first episode \"emotional as hell\" as Clary's friends reflect back on her life and what she meant to them. Magnus (<mark>Harry Shum</mark> Jr.) will have to learn how to live without magic. While Magnus learning to live without his powers could provide some opportunities for positive growth, but it's also going to be a tough struggle, particularly when it comes to his own mortality. Malec could have some \"heartbreaking\" times ahead. Predictably, Magnus giving up his magic in order to save Alec's (Matthew Daddario) Parabatai, Jace (Dominic Sherwood) is a pretty monumental thing to happen in and to their relationship. Slavkin has told us to expect the Malec relationship to evolve in a really \"interesting, heartbreaking, beautiful way.\" Discover your new favorite show: Watch This Now! We'll finally get answers about the Mark of Cain. When the Seelie Queen burned that freaky symbol into Simon's (Alberto Rosende) forehead last year, we had so many questions about what it was, why she did it and what it means for Simon. We'll be getting a lot of those answers in the first three episodes of 3B, and we've been assured it will all make sense in time. Luke Baines will take over the role of Jonathan Morgenstern. Before her loft exploded, Lillith (Anna Hopkins) did achieve her goal of bringing her son, Jonathan, back to life. Gooey as he was, we did see that arm rise out of the casket and grab Clary. Seeing as he's been \"remade\" though, he won't look like Sebastien Verlac (Will Tudor), the form he took when we first met him. This time around, he'll wear his true face, which will look a whole lot like Luke Baines. Shadowhunters returns Feb. 25 at 8/7c on Freeform."}, {"articleID": "2017021817_00144067_W", "names": {"Khalid Latif": ["Q6399529", "Q6399530"], "Mohammad Irfan": ["Q16045779", "Q20983357", "Q21642592", "Q23415113", "Q23664247", "Q24005370", "Q24005371", "Q24005372", "Q25189401", "Q25189406", "Q25189413", "Q3536989"]}, "date": "2017-02-18", "url": "http://www.sbs.com.au/news/article/2017/02/19/pcb-gives-sharjeel-and-latif-14-days", "content": "19 Feb 2017 - 3:42 am PCB gives Sharjeel and <mark>Latif</mark> 14 days Suspended duo Sharjeel Khan and <mark>Khalid Latif</mark> have been given a fortnight by the Pakistan Cricket Board to respond to charges of spot-fixing. Source: Tweet The Pakistan Cricket Board has given Sharjeel Khan and <mark>Khalid Latif</mark> 14 days to respond to charges of violating its anti-corruption code in the Pakistan Super League. Sharjeel and <mark>Latif</mark> have already given statements to the PCB's anti-corruption unit in Lahore amid allegations of spot-fixing. \"Today we have given them the charge sheet and now they are bound to respond to the charges within two weeks,\" PCB spokesman Amjad Bhatti said in Lahore on Saturday. Bhatti said if the players denied the charges the PCB will form a three-member tribunal, including a retired judge and a former cricketer, to hear the case. A PCB disciplinary committee will decide on punishment if the charges are accepted by the players, Bhatti said. Last week, the PCB provisionally suspended both players, who represented Islamabad United in the PSL. On Monday Britain's National Crime Authority arrested two men, one of them believed to be former Pakistan opening batsman Nasir Jamshed, before releasing them on bail in connection with alleged spot-fixing in the PSL. The PCB also suspended Jamshed from playing any form of cricket. Three more players - Islamabad United's <mark>Mohammad Irfan</mark>, Quetta Gladiators' Zulfiqar Babar and Karachi Kings' Shahzaib Hassan - were questioned by the anti-corruption unit, but none of them were suspended. All three continue to play in the PSL, which is being held in the United Arab Emirates. Advertisement"}, {"articleID": "2015010521_00018988_W", "names": {"Sushil Kumar": ["Q27924858", "Q378384", "Q47568673", "Q57041099", "Q57157332", "Q7648941", "Q7648943", "Q7648947"]}, "date": "2015-01-05", "url": "http://hindustantimes.com/sports-news/othersports/if-saina-nehwal-why-not-other-olympic-medallists/article1-1303694.aspx", "content": "Only the ministry of home affairs can tell whether London Olympic medallist Saina Nehwal's name will feature in the final list of Padma Bhushan winners. Her public outburst was enough to move the sports ministry to recommend her name for the third-highest civilian award as a special case, three-and-a-half-months after the deadline for submitting nominations. No one will question whether Saina deserves the award or not. But eyebrows are being raised on the way she questioned the ministry's judgement of not equating her achievements with India's only two-time Olympic individual medallist <mark>Sushil Kumar</mark>. Where is the sportsman's spirit? There are other Olympic medallists whose achievements are comparable to Saina's, then why not nominate them for the Padma Bhushan. Whether they get it or not is a different issue. Other contenders If the ministry is ready to accommodate a nomination after the deadline, then why not make a special case for London Olympic medallist shooter Gagan Narang, who got the Olympic medal a year after getting the Padma Shri and also won medals in the 2014 Commonwealth Games. Or, for Beijing Olympic medallist Vijender Singh, who got the Padma Shri in 2010, and went on win gold at the 2010 Asian Games and silver at the 2014 CWG. Wrestler Yogeshwar Dutt's achievements are no less. Though he got the Padma Shri in 2013 for his bronze at the London Olympics, he went on to win gold at the 2014 Asian Games and broke the nation's 28-year gold medal drought in wrestling. Following Saina's public outburst against the sports ministry for only recommending <mark>Sushil</mark>'s name, the ministry came up with a press release on Monday stating: \"In view of the achievements of Saina Nehwal, the department of sports has decided to recommend her case for Padma Bhushan to the ministry of home affairs as a special case, although the last date for making the recommendation is long over.\" The ministry also went on record to state that they hadn't got an application \"for or from\" Saina before the deadline. They only received Saina's nomination for a Padma Bhushan from the Badminton Association of India on January 3, 2015, three months and 20 days past the deadline. In view of her achievements, the ministry decided to go ahead. Pak fishing boat blows up near Gujarat coast after being chased by Coast Guard Ship Thought this happened only in India, say Chinese after stampede kills 36 PK breaks box office collection records, earns Rs. 276.32 crore in two weeks"}, {"articleID": "2008102317_00017329_W", "names": {"Brian Smith": ["Q15991542", "Q15993513", "Q16186493", "Q18211014", "Q20643215", "Q2382758", "Q27185702", "Q29064118", "Q2925008", "Q42840317", "Q4800311", "Q4965316", "Q4965318", "Q4965320", "Q4965321", "Q4965322", "Q4965324", "Q4965327", "Q4965328", "Q4965329", "Q4965330", "Q4965331", "Q57895220", "Q913075"], "Andy Martin": ["Q4760988", "Q4760989", "Q4760991", "Q4760992", "Q4760993", "Q4760995"]}, "date": "2008-10-23", "url": "http://wptv.com/news/local/story.aspx?content_id=63fa296d-be99-4c23-9b75-2bf8d0c717c4", "content": "west palm beach, fl--it's been internet gossip for months. is barack obama a u.s. citizen? \"i think it's conspiracy theories run amuck,\" says wptv political analyst dr. robert watson. \"the next thing we're going to hear is barack obama was at roswell.\" nonetheless an attorney in philadelphia, philip berg, filed a lawsuit claiming obama lost his u.s. citizenship when his mother married an indonesian man. berg says obama failed to take an oath of allegiance when he turned 18. obama has attempted to silence any critics by producing a birth certificate from hawaii, proving he was born there in 1961. berg however is demanding an original, and not a copy from the obama camp. obama's team filed a motion to dismiss berg's lawsuit, but they also made a motion to block discovery. <mark>brian smith</mark> is a west palm beach attorney registered as an independent, that has wrote about this issue from a legal standpoint on his blog. \"the obama camp and democratic national committee responded to the lawsuit by filing a motion to dismiss, but they never responded to the request for admissions.\" berg is now arguing because obama's camp is refusing to produce an original birth certificate copy in discovery, his allegations are essentially true. \"wednesday he filed a motion for summary judgment, or a judgment in his favor, as a matter of law, because they essentially admitted those allegations. that from a legal perspective is huge,\" says <mark>smith</mark>. this is the third lawsuit that's been filed about obama's citizenship, meaning the courts will have to decide how to move forward. a washington man, steven marquis, is suing the washington secretary of state, demanding that he verify obama's citizenship status before the election. in honolulu, <mark>andy martin</mark> filed a lawsuit on october 17th, to get the hawaiin department of health to release obama's birth certificates. <mark>martin</mark> also wants to see an original birth certificate, and not a \"copy .' <mark>smith</mark> says under hawaiin law birth certificates are considered private. meanwhile, judge r. barclay surrick is hearing berg's case in pennsylvania. the suit was filed on august 21st, but the judge has not made any ruling. what is certain is that this issue doesn't seem to be going away. on-line it has a rabid and contentious following from both sides. even in the real world, dr. watson tells us whenever he speaks publicly, the issue always pops up. you can send a story to multiple email addresses by separating the email addresses with a semicolon (;)"}]