[{"date": "2016-09-29", "url": "http://abc.net.au/news/2016-09-29/dally-m-winner-taumalolo-wants-to-be-a-rugby-league-great/7887060", "content": "Dally M winner Jason Taumalolo of the Cowboys wants to be a rugby league great Posted September 29, 2016 07:21:42 Map: Sydney 2000 The last time two players shared the Dally M stage in 2014, one left to pursue an American dream. But just days after reports of a similar interest in gridiron, as Jarryd Hayne did two years ago, newly-crowned Dally M medallist Jason Taumalolo has declared a desire to stay in the NRL and become one of the greats. Taumalolo and Melbourne star Cooper Cronk finished as joint winners of the most prestigious award in the game after a thrilling countdown at The Star on Wednesday night. Cronk became just the eighth player in the history of the medal to win the gong on multiple occasions, adding to his individual honour in 2013. Taumalolo became the first forward to claim the honour since <mark>Cameron Smith</mark> in 2006, and the first true forward since Cronulla's <mark>Gavin Miller</mark> took out back-to-back honours in 1989. 2016 Dally M Medal leaders Cooper Cronk (26) Sam Burgess (17) Matt Moylan (17) He is also the second Kiwi to win the prize after <mark>Gary Freeman</mark> in 1992 and comes just two weeks after winning the Players Champion award voted by opposition players. But it was the words he said after being bestowed the medal that would most send shivers down the spines of his rivals for the rest of the long summer. \"My plan is to retire playing rugby league and that hasn't changed over the last little while,\" he said. \"I want to be playing in the NRL for as long as I can and hopefully be recognised alongside (Cronk), (Johnathan Thurston) and (<mark>Cameron Smith</mark>) as one of the greats .\" Cronk, who will lead the Storm in Sunday's NRL decider against Cronulla, praised Taumalolo's efforts in becoming the first true forward to win the award in almost 30 years. \"To play the power game and the physicality that requires to do it for 26 weeks of the year is pretty impressive,\" he said. \"One, to be mentally strong. Two, physically. But you also need to be durable. He wouldn't have missed too many games this year. The way that he plays, that's pretty impressive .\" Johnathan Thurston gets a lot of raps at the Cowboys, and rightly so for what he does. But most of it is on the back of what Jason, (Matt) Scott and James Tamou do. \"Jason's been a wrecking ball all year and there's a reason why he's standing here as the best player in the game and that's because he deserves it .\" Cronk said the 2016 season had been the most enjoyable of his career. \"2013 was a good year in terms of my performance, but 2016 has been the most enjoyable year of my football career. There's no doubt about that,\" he said. \"There's a few contributing factors to that, but I've just really enjoyed both on and off the field and looking forward to what Sunday brings as well .\" ", "articleID": "2016092823_00117905_W", "names": {"Cameron Smith": ["Q27840142", "Q27840143", "Q28343824", "Q2934778", "Q44614454", "Q5026380"], "Gary Freeman": ["Q24809130", "Q3758488", "Q5525095", "Q5525096", "Q56274917"], "Gavin Miller": ["Q42849211", "Q5528223", "Q57980355"]}}, {"date": "2016-09-29", "url": "http://www.cablefax.com/distribution/intx-exit-ncta-shuttering-annual-tradeshow", "content": "By Cablefax Staff | September 29, 2016 | Premium Content Alfred Liggins, Chairman & CEO, TV One, President & CEO, Radio One, opened INTX 2015 Anyone at this year's INTX in Boston had to see the writing on the wall. Speculation over how much longer NCTA could continue its 65-year-old annual trade show was put to rest Wed, with the association announcing it was nixing the event. The change, billed as a decision by the trade association and its board, is immediate, with next year's gathering set for DC in April canceled. That could bode well for NAB' s annual conference, which was going to overlap the event. Already, many of cable's shows regulars had migrated to the revamped NAB conference. \"We are now exploring new and better ways to tell our story, to gather our community, to advance our growth and present our vision of the future,\" NCTA chief wrote in a blog post Wed.. <mark>Michael Powell</mark> Given that these events must be booked more than a year out, NCTA will lose deposits, but <mark>Powell</mark> argues that large trade show floors with exhibit booths and artificial schedules are an \"anachronism .\" Hardly the image the group, which just renamed itself NCTA, The Internet & Television Association, wants to paint. \"Contemporary venues emphasize conversation, dialog, and more intimate opportunities to explore and interact with technology. Ending INTX gives us a clean slate and we are excited to explore presenting our industry in new and different ways,\" <mark>Powell</mark> wrote. He signed off by acknowledging the many years of fond show memories the industry's members have: \"But all good things must come to an end. And endings hold the promise of new beginnings .\" NCTA declined to comment on what the move means for its staffing, saying it does not comment on personnel matters. (We hear Barbara York, svp, industry affairs, isn't going anywhere as a result). NCTA has seen its annual gathering's attendance go from about 30K at its peek to around 8K this year. The association has rebranded the trade show over the years, taking it from The National Show to the Cable Show before rebranding it as INTX: The Internet & Television Expo in 2015. While there's been questions for years over whether NCTA's show was still needed in this day and age, other more niche shows are seeing growth. The announcement came as SCTE/ISBE is in the middle of its annual Cable-Tec Expo in Philly. Attendance figures won't be released until Thurs, but we're told it is up YOY. And the exhibit floor was bustling, at times with booths so full of people it was hard not to bump into people. NCTC and ACA's Independent Show has seen YOY increases in attendees, with the annual gathering of independent operators seeing its exhibit floor grow significantly over the years. Even ACA's much smaller lobbying-focused Summit in DC has attracted several vendors. Then there are the biggies...CES set a new attendance record of more than 177K in January. The NAB Show had more than 103K registered attendees this year, on par with 2015. And the industry also is participating more in consumer-facing shows such as SXSW and Comic-Con. share this article This is a high-impact position where your analysis and interpretation of results informs decisions affecting millions of consumers...The Managing Editor/Digital will work collaboratively with other leaders and teach employees how to create unique, shareable content ...", "articleID": "2016092900_00321004_W", "names": {"Michael Powell": ["Q11778385", "Q1562548", "Q1928927", "Q47459798", "Q49943329", "Q588371"]}}, {"date": "2016-09-29", "url": "http://www.star-telegram.com/news/local/community/weatherford-star-telegram/wt-news/article104893256.html#storylink=rss", "content": "September 29, 2016 11:53 AM Hudson Oaks hires new police chief Michael BaldwinCOHOPhoto courtesy i Order Reprint of this Story After a lengthy search process, the City of Hudson Oaks has selected Michael Baldwin as the new Chief of Police. Baldwin has more than 33 years of law enforcement experience and currently serves as a Captain with the Fort Worth Police Department. Although he spent most of career in Fort Worth, Baldwin has lived in Parker County for 29 years. Baldwin managed the Communications Division, West Division, North Division, Special Projects, Data Management, Support Services, Staffing Management, and Internal Affairs at the Fort Worth Police Department. \"Chief Baldwin brings a wealth of experience to our department, and with the explosive growth occurring in Parker County, Hudson Oaks is strategically investing in public safety,\" Mayor Pat Deen said. \"I am excited to provide our existing officers with a leader of Michael's caliber and look forward to the contributions he will make within the Parker County law enforcement community .\" Baldwin said he was very honored and blessed to be selected for the position. \"It is very exciting to become part of such a dynamic city,\" Baldwin said. \"I appreciate Chief <mark>Chris Green</mark> for his leadership during this interim period. I look forward to serving the citizens of Hudson Oaks and working with the members of the department, the city administration, city staff and the city council .\" Chief Baldwin will officially be sworn in on Dec. 1, after winding down his current commitments with the City of Fort Worth.", "articleID": "2016092917_00086772_W", "names": {"Chris Green": ["Q18686459", "Q19957945", "Q2048639", "Q5106713", "Q5106714", "Q5106715", "Q5106716", "Q5106717", "Q5106718", "Q59162298"]}}, {"date": "2016-09-29", "url": "http://www.kxxv.com/story/33283965/cyclist-going-for-world-record-stops-in-amarillo", "content": "Cyclist going for world record stops in Amarillo - KXXV-TV News Channel 25 - Central Texas News and Weather for Waco, Temple, Killeen | Cyclist going for world record stops in Amarillo - KXXV-TV News Channel 25 - Central Texas News and Weather for Waco, Temple, Killeen | Member Center: Cyclist going for world record stops in Amarillo 2016-09-29T23:39:32 ZDanielle Girdano with APD and Amarillo Fire (Source: KFDA) APD and Amarillo Fire (Source: KFDA) Danielle Girdano's Bike for the Route 66 journey (Source: KFDA) AMARILLO, TX (KFDA) - One woman aiming to break a cross-country cycling world record on Route 66 has made a stop in Amarillo. Danielle Girando is a cyclists who is determined to ride through more than 200 cities in 43 days. Girando began her journey in Chicago on Sept. 18 and is now 11 days into her trip. Sept. 17 was her longest stretch of over 100 miles from Elk City to Amarillo and she will continue on Route 66 for another 1,088 miles. \"This project is actually four years in the making, so doing something like this isn't something that you take lightly,\" Girando said. \"There's a lot of physical training that goes into it. There's a lot of emotional and mental training too. One of the hardest things about Historic Route 66, is the punishment that you take psychologically .\" While cycling Route 66, Girando is also hoping to raise awareness along with funds for childhood obesity and bullying, which is something that she advocates for after she struggled with her weight. At her heaviest, she weighed close to 400 pounds and cycling helped her tackle weight loss. \"Kids are being hurt by child obesity and bullying,\" said Girando. \"I understand that fact first hand. It comes down to education and behavioral patterns and it comes down to the education of parents to help stop this problem .\" This ride was expected to be completed last year, but during her first attempt she suffered an accident. Since first responders were so kind to her, she now is making it an effort to also dedicated the ride to them. \"When we learned what the cause was, we very much supported that,\" <mark>Larry Davis</mark>, Captain of the Amarillo Fire Department, said. \"She dedicated this ride to first responders as well and that's fantastic. Plus, we are proud to be apart of her going for a world record .\" Girando will leave Amarillo early Sept. 30 and continue on Route 66 until she reaches Los Angeles. Those interested in donating to stop childhood obesity and bullying or following Girando's journey can visit her. website Copyright 2016 KFDA. All rights reserved. Thursday, September 29 2016 8:39 PM EDT2016-09-30 00:39:38 GMTUpdated: Thursday, September 29 2016 8:39 PM EDT2016-09-30 00:39:38 GMT It's official: Lady Gaga will headline the Super Bowl halftime show next year. Wednesday, September 28 2016 2:05 PM EDT2016-09-28 18:05:50 GMTUpdated: Thursday, September 29 2016 8:35 PM EDT2016-09-30 00:35:10 GMTJacob Hall (L) in critical condition after shooting. Fireman Jamie Brock (R) saved lives including Jacob's. (Source: Family/Townville FD) School has been canceled for the rest of the week at Townville Elementary School after deputies said a 14-year-old opened fire on the school playground, wounding three people on Wednesday. Thursday, September 29 2016 8:21 PM EDT2016-09-30 00:21:58 GMTUpdated: Thursday, September 29 2016 8:21 PM EDT2016-09-30 00:21:59 GMT It took more than an hour for police to arrive at the shopping center in a San Diego suburb where a distressed black man had been wandering into traffic. It took about a minute for him to be shot and killed. Thursday, September 29 2016 6:09 AM EDT2016-09-29 10:09:03 GMTUpdated: Thursday, September 29 2016 8:03 PM EDT2016-09-30 00:03:13 GMT It is still too early to tell what precise impactHurricane Matthew will have on the U.S. coastline. Thursday, September 29 2016 11:42 AM EDT2016-09-29 15:42:42 GMTUpdated: Thursday, September 29 2016 7:16 PM EDT2016-09-29 23:16:33 GMT A middle school counselor is being hailed as a hero after talking a student at Sycamore Middle School from shooting other students.", "articleID": "2016093000_00622436_W", "names": {"Larry Davis": ["Q16120627", "Q6490181", "Q6490183"]}}, {"date": "2016-09-30", "url": "http://www.usatoday.com/story/sports/nfl/2016/09/30/dolphins-depleted-offensive-line-pushed-around-in-22-7-loss/91309300/", "content": "FacebookEmail Twitter Google + LinkedIn Pinterest Dolphins' depleted offensive line pushed around in 22-7 loss Miami's depleted offensive line had a tough time all around during a 22-7 loss to Cincinnati on Thursday night Post to FacebookDolphins' depleted offensive line pushed around in 22-7 loss Miami's depleted offensive line had a tough time all around during a 22-7 loss to Cincinnati on Thursday night Check out this story on USATODAY.com: http: //usat.ly/2dr8uLKCancelSend A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Dolphins' depleted offensive line pushed around in 22-7 loss AP12:33 a.m. EDT September 30, 2016Miami Dolphins quarterback Ryan Tannehill, center, is sacked by Cincinnati Bengals defensive tackle Geno Atkins (97) during the second half of an NFL football game, Thursday, Sept. 29, 2016, in Cincinnati. (AP Photo/Frank Victores) (Photo: The Associated Press) CINCINNATI (AP)--Geno Atkins simply shoved Dolphins guard Jermon Bushrod backward into Ryan Tannehill, knocking him down. The Bengals defense tackle then gently touched the quarterback down, one final indignity on a rough night. Miami's depleted offensive line had a tough time all around during a 22-7 loss to Cincinnati on Thursday night. And given the health of their blockers, the Dolphins (1-3) have a real challenge ahead. \"We've got to get it fixed and quick, and by that I mean Monday,\" Tannehill said. \"We're kind of in a dark spot right now. It's squarely on our shoulders .\" It was so bad that during the first three quarters, Bengals receiver A.J. Green had more yards than the entire Miami offense. Green piled up 166 yards on catches, while the Dolphins managed only 152 total yards. Tannehill was 15 of 25 for 189 yards with a touchdown, an interception, five sacks and a fumble. The Dolphins' running game--one of the NFL's worst--managed only 62 yards. \"Some of the plays were not ideal, as far as what we were doing,\" coach Adam Gase said. \"Some were busted protections. Ryan has to step up on the fumble. It's everybody taking their turn. I don't think it really mattered who was out right now. We couldn't get out of our own way .\" Tannehill had been a bright spot lately. He threw for 319 yards and three touchdowns during a win over Cleveland on Sunday, his second straight game with more than 300 yards passing. He had been sacked only one time in the last two games despite throwing 84 times. On Thursday, he threw a 74-yard touchdown pass to Kenny Stills on Miami's second play of the game, but did little else the rest of the way. Miami finished with 222 total yards. It wasn't all Tannehill's fault. The patchwork line had trouble giving him time. \"Not everybody was on the same page,\" Gase said. \"All of a sudden he looks like he doesn't know what he's doing .\" There was a reason for the problems--Miami had a lot of players in different positions. The Dolphins were missing four starting offensive linemen, two linebackers, running back Arian Foster and tight end Jordan Cameron. Left tackle Branden Albert and center <mark>Anthony Steen</mark> were inactive with sprained ankles suffered during the win over Cleveland. Center Mike Pouncey has missed all four games with a hip injury. \"We have to put it all together and figure out what we do well and start working on that a little more,\" Gase said. ___ CONNECTTWEETLINKEDINCOMMENTEMAILMORE Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2016093004_00581256_W", "names": {"Anthony Steen": ["Q14202166", "Q4773519"]}}, {"date": "2016-09-30", "url": "http://app.com/story/news/local/land-environment/enviroguy/2016/09/30/nj-fall-deer-hunting/91158636/", "content": "Skip Ad Ad Loading...x Embed x Share Fish & Wildlife officials were able to help a doe who had been shot in the face with an arrow. STAFF VIDEO BY DOUG HOOD Buy Photo Deer hunting starts Oct. 1. (Photo: Susanne Cervenka/Asbury Park Press) Buy Photo WALL - The signs across from Denise Wilczewski's home seem to contradict each other. Bow and arrow deer hunting ahead. But also: No Hunting. For Wilczewski, of Wall, the mixed message is concerning. Technically, there's no deer hunting allowed in the section of Shark River Park that is across from her home. With bow deer hunting season opening Saturday, Wilczewski worries that the confusion she reads in the signs could result in either her family or her pets being injured by a stray arrow. OH DEER! Truck hits deer in Howell, deer attacks driver The root of Wilczewski's concerns stems from an attempt by Monmouth County Parks System to expand the archery hunting area in Shark River Park this summer. After concerns from neighbors like Wilczewski, Wall officials intervened, asking the county to return to old maps earlier this month that gave a greater buffer between the hunting area and homes. \"Who is going to be watching them? Who is going to be making them stay (within the hunting area)? Where's my safety in all this?\" Wilczewski said. \"It's not about hunting. It's about strange people around my house with weapons .\" Wilczewski isn't convinced enough is being done to protect residents. Her solution: Don't let hunters access the park from the side of the road by residential neighborhoods. Even though the original hunting boundaries were reinstated, hunters are now able to access the park directly across from Wilczewski's home. Monmouth County Parks spokeswoman Karen Livingstone says hunters always were able to do this. But, former Wall Mayor <mark>Jeff Foster</mark>, who helped Wilczewski with hunting concerns years ago, said hunters didn't access there because the parking was on another street. MORE HUNTS: Brick man wins $4500 hunting Giant Pythons Livingstone said that while hunters can access the park from any location, it doesn't give them the ability to hunt in off-limits areas. Wall administrator <mark>Jeff</mark> Bertrand said his police officers can take action if they see illegal hunting. \"If they are hunting in an area they aren't supposed to be hunting, our police officers will take action,\" he said. ENVIRONMENT: Lacey Rail Trail's fate to be decided soon Here are 4 things to know about deer hunting on county land: 1. Monmouth County expanded the hunting area this year in some parks to match state regulations. New Jersey changed its law in 2010 to reduce the distance hunters have to be from buildings from 450 feet to 150 feet. Hunters still have to be at least 450 feet away from schools. Livingstone said Monmouth County Parks System held off before implementing those changes to its hunting maps. Livingstone said the county parks system decided to move ahead with the change after seeing the state did not have problems with the new distance on its lands. 2. The rules are more strict for hunting on Monmouth County Park lands. Monmouth County allows hunting at 17 parks, but the rules here are different than on state land. Hunters have to be at least 18, licensed by the state and have taken safety courses to get a permit to hunt in one of Monmouth County Parks. And, all hunting has to be done from a tree stand. \"They're in one place. They're not meandering around,\" Livingstone said. Hunters are also given numbers that must be displayed on their tree stands and vehicles to identify who they are. 3. Ocean County allows hunting on some preserved lands. Hunting isn't allowed in Ocean County parks, but Ocean County does allow it on some of the land in its Natural Lands Trust Fund Program. County officials point hunters to its interactive maps to see what tracts allow hunting and what don't. Ocean County doesn't have additional permits to hunt on its land like Monmouth County; however, Monmouth officials remind hunters they need to follow state and local regulations for hunting in each area. 4. The number of deer harvested last year was down. Monmouth County's deer harvest at its parks was down about 9 percent in the 2015-2016 season compared to the prior season, according to the county's annual deer management report. In all, 840 permits were issued to hunters who hunted 9,798 days and harvested 426 deer in Monmouth County Parks. Statewide, the harvest numbers were down about 21 percent and down 14 percent across all of Monmouth County, a tally that includes more land than just the county parks. Susanne Cervenka: 732-643-4229; scervenka @ gannettnj.com. CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //on.app.com/2dJyy9c", "articleID": "2016093011_00891518_W", "names": {"Jeff Foster": ["Q21716120", "Q2571956", "Q3552863"]}}, {"date": "2016-11-30", "url": "http://watoday.com.au/comment/first-contact-the-message-all-australians-should-take-from-indigenous-culture-20161130-gt0nn7.html", "content": "COMMENT December 1 2016 - 7:52 AM Save Print License article First Contact: The message all Australians should take from Indigenous culture Ian \"Dicko' Dickson 17 reading now Show comments facebook SHARE twitter TWEET email google-plus linkedin reddit More The offer to appear on First Contact was met with the quickest\" Yes' I've ever given to any TV show since I've been in the business. I realised immediately that this was a golden opportunity to broaden what was a pretty narrow mind when it came to Indigenous people. It's such a hot potato for most suburban Australians--an awkward conversation that most would rather not have. Most of my own perception of black Australia was borne out of my own ignorance and a certain nagging white guilt. This, I felt was wholly inadequate. Play Video Replay Video Play Video Don't Play Up Next Trailer: Mad Sheila Virgin Road Play Video Don't Play Video duration 00:54 More Trailers Videos Previous slide Next slide Video duration 01:38 Trailer: First Contact season 2 Trailer: First Contact season 2 Hosted by <mark>Ray Martin</mark>, First Contact is the journey of six European Australians who are challenged about their perceptions of Indigenous Australians. Up Next Trailer: Mad Sheila Virgin Road Play Video Don't Play Video duration 00:54 Video duration 00:54 Trailer: Mad Sheila Virgin Road Trailer: Mad Sheila Virgin Road Bounty hunter Xi Liya rescues a group of virgins from a band of steam-punk desert warlords. Up Next Trailer: Midnight Sun Play Video Don't Play Video duration 00:59 Video duration 00:59 Trailer: Midnight Sun Trailer: Midnight Sun A brutal murder leads French homicide investigator to Kiruna, Sweden, where her investigation soon takes on staggering proportions. Up Next Trailer: Coral: Rekindling Venus Play Video Don't Play Video duration 01:42 Video duration 01:42 Trailer: Coral: Rekindling Venus Trailer: Coral: Rekindling Venus An extraordinary journey into a mysterious realm of fluorescent coral reefs, bioluminescent sea creatures and rare marine life, revealing a complex community living in the oceans most threatened by climate change. Up Next Trailer: Beaches Play Video Don't Play Video duration 01:00 Video duration 01:00 Trailer: Beaches Trailer: Beaches The story of two friends from different backgrounds whose friendship spans more than 30 years through childhood, love, and tragedy. Up Next Trailer #2: Assassin's Creed Play Video Don't Play Video duration 02:25 Video duration 02:25 Trailer #2: Assassin's Creed Trailer #2: Assassin's Creed When Callum Lynch explores the memories of his ancestor Aguilar and gains the skills of a Master Assassin, he discovers he is a descendant of the secret Assassins society. Up Next Trailer: Bon Appetit Play Video Don't Play Video duration 00:57 Video duration 00:57 Trailer: Bon Appetit Trailer: Bon Appetit Gérard Depardieu travels through different European regions looking for their famous local specialities, identity and history. Up Next Trailer: The Grand Tour Play Video Don't Play Video duration 01:34 Video duration 01:34 Trailer: The Grand Tour Trailer: The Grand Tour Jeremy, Richard, and James embark on an adventure across the globe, driving new and exciting automobiles from manufacturers all over the world. More videos Trailer: First Contact season 2 Hosted by <mark>Ray Martin</mark>, First Contact is the journey of six European Australians who are challenged about their perceptions of Indigenous Australians. The trip was an enormously empowering experience. I have far fewer answers than when I set off but at least now I get the feeling I am equipped to ask better questions. The complexity of the situation we encountered was enormous; sometimes confronting and distressing, at other times uplifting and inspiring yet always somehow confusing and confounding to my white sensibilities. SHARE Share on Facebook SHARE Share on Twitter TWEET Pin to Pinterest PIN Link Ian \"Dicko' Dickson with Timmy\" Djawa' Burarrwanga in East Arnhem Land Photo: <mark>David</mark> Dare Parker We met a huge number of impressive people dedicating their whole lives to advance their communities, but there was often a subtext of hopelessness beneath their efforts. It was as though they were swimming against a tide of self-destruction. Often these incredible individuals admitted they were merely laying down and smoothing a pillow for a dying generation of broken people. Elsewhere, we visited what most people would have to admit were very efficient, very impressive black communities whose self-governance I would describe as ultra-conservative and zero tolerance. This was hard to take for a bleeding heart leftie like me. These were the sort of no-nonsense, three-strikes-and-you're - out policies that would have most white urban lefties crying \"Fascists!\" if it was implemented by the federal government; yet this was a work of steely self-determination by blackfellas, and it was working just fine. Shit! Maybe I'm not a lefty after all! Advertisement I had believed that under the skin, all humans are alike. I now believe this to be a misconception that sells our wonderful diversity short. I met a man in Arnhem Land who told me that blackfellas and whitefellas are different. Initially I felt uncomfortable with what he was telling me, regarding it as divisive, maybe even racist. He told me that blackfellas and whitefellas see the world differently. That whitefellas generally think in straight lines while blackfellas think in circles. He also said that whitefellas are driven by time while blackfellas are more attached to place. SHARE Share on Facebook SHARE Share on Twitter TWEET Pin to Pinterest PIN Link <mark>David Oldfield</mark>, Natalie Imbruglia, Ian \"Dicko' Dickson, Renae Ayris, Tom Ballard, Nicki Wendt and host <mark>Ray Martin</mark> at Derby Airport. Photo: <mark>David</mark> Dare Parker I didn't quite get the time and place distinction until it was beautifully Illustrated to me in northern Western Australia. A young Indigenous girl who was working with us told us she was heading to the coast to see her mob .\" How long are you going to be in Wyndham? \"one of us asked her .\" Aw...'til I get back! \", came her thoughtful reply. Pure poetry! We are different. Wonderfully, magically different. I had several confrontations with <mark>David Oldfield</mark>. He was convinced that as a nation, Australia could derive nothing from embracing, supporting or saving Aboriginal culture. He scoffed at programs to save local languages, stating that no young blackfella was going to increase his chances of landing a job because he spoke his own traditional language. Unfortunately, we hear this a lot; there now appears to be only an economy where once there was a society too. Unfortunately, an economy is a cruel task master with a brutal logic and little time for concepts such as, tradition or culture or beauty. <mark>Oldfield</mark> was also often keen to point out that Aboriginal culture was\" stone age \". He used it as a pejorative term, proof that our first nation Australians have little to offer beyond throwing in the towel and assimilating into our technologically advanced, turbocharged, white utopia. I intend to lend <mark>Oldfield</mark> a brilliant book by Bill Gammage entitled The Biggest Estate on Earth. It details how for tens of thousands of years before white settlement, blackfellas conducted incredibly sophisticated land management practices to ensure plentiful wildlife and plant foods. Gammage also contends that without this skilful management, Australia has become vulnerable to the devastating bushfires that we encounter on a regular basis. Australia is selling itself short by marginalising its Indigenous people. We can learn so much from our ancient cultures. So following my time on First Contact, the question I am left with is this: Why do most Australians do not share a pride in our nation's ancient heritage? Surely a deep and respectful knowledge of one's country can only enrich our sense of national identity? I imagined telling the people of my birth place, a nation of proud post-Brexit Britons that we would be wiping all British history pre 1788: No Henry VIII beheading his wives, No Queen Elizabeth I or the Spanish Armada, No 1066 and the Norman invasion. No Romans, no Hadrian's Wall and no Stonehenge! I promise you if this happened there would be blood on the streets Yet this is exactly what we have been asking Australians, both black and white, to accept. I really don't know how we go about closing the shocking gap in equality that I saw between black and white Australia. I fear it may take generations of hard work, belief and understanding before we see real equality. What I do believe is that real healing begins with a desire to see things from the other fella's point of view; a desire for understanding, a need for respect. If we can find a way of developing a deep pride in our shared history, an ancient history, a remarkable story, then this I think will allow us to take the first few steps to really complete us as a nation. Perhaps we white Australians could resist the urge to talk about blackfellas as a costly, and dysfunctional\" them \", and instead start perceiving our first nation Australians as an incredibly proud and integral part of\" us \". We are so keen to pat ourselves on the back for Australia's successful multiculturalism, but Aboriginal history is the fascinating story of multiculturalism writ large. Before 1788 this continent played host to, according to some research, about 450 separate nations all with distinct identities, language, culture and traditions. This is a fabulous story. This is the story of Australia, our country. Black, white, Asian, Pom, it doesn't matter. We should all share a pride in the ancient stories found in the red dust beneath our feet. Only then can we truly call ourselves Australians. Ian\" Dicko' Dickson is a TV and radio presenter. First Contact continues Thursday at 8.30 pm on SBS and NITV. Advertisement 0 comments Log in to comment New User? Sign up You are logged in as unknown Logout 300 words Close comment form Write your comment here Screen name (required) Location (optional) I understand that submission of this content is covered by the Conditions of Use by which I am bound and Commenting Guidelines are available for my reference. Close Thank you Your comment has been submitted for approval. Please note that comments are moderated and are generally published if they are on-topic and not abusive. Sort comments by Oldest Newest", "articleID": "2016120100_00404837_W", "names": {"David Oldfield": ["Q5238210", "Q5238211"], "Ray Martin": ["Q7297787", "Q7297788", "Q7297789", "Q7297790", "Q7297791"]}}]