[{"date": "2016-12-02", "url": "http://www.goldcoastbulletin.com.au/news/national/hmas-tobruk-to-be-scuttled-in-wide-bay-region-after-queensland-towns-win-dive-site-bid/news-story/d7e713f955597fa0448d53103530b5e4", "content": "HMAS Tobruk to be scuttled in Wide Bay region after Queensland towns win dive site bid Tom Snowdon, The Courier-Mail December 2, 2016 4:52 pm A PRIZED former warship will be scuttled off the south Queensland coastline after councils pitched a hard-fought battle to secure the navy vessel as a tourist dive site. Federal Defence Personnel Minister Dan Tehan announced today the HMAS Tobruk would be sunk in the Wide Bay area between Bundaberg and Hervey Bay. \"She will be fondly remembered by all those who served in Tobruk and those who have been supported by the many operational and humanitarian deployments she undertook,\" Mr Tehan said. \"The scuttling of Tobruk in the Wide Bay Burnett area will be a permanent monument to Tobruk's proud history and a reminder she served as her motto intended\" Faithful and Strong'. \"The Bundaberg and Fraser Coast councils mounted a hard-fought campaign after they pledged $1 million each to secure the former landing ship after it was decommissioned in 2015 after 34 years of service. The councils were fighting against most other coastal Queensland local government areas, including Redlands, which had been petitioning for the ship to be sunk off its shores in a bid to transition towards a tourism economy as sand mining operations draw to a close. Tasmania had also thrown a bid in the ring to have it sunk in the icy waters of Binalong Bay. Bundaberg Mayor <mark>Jack Dempsey</mark> said the pre-scuttling work, including cleaning, would be done at the local port .\" This work is valued at millions of dollars and it certainly would provide a financial fillip for local businesses that might be engaged to undertake the work, \"Cr <mark>Dempsey</mark> said .\" I cannot applaud loudly enough the wonderful bipartisan spirit of co-operation between Bundaberg and Fraser Coast Councils in combining their energies and resources to win this project for the benefit of the communities of our regions. \"Queensland Government Tourism Minister <mark>Kate Jones</mark> said all the proposals presented\" excellent arguments to host the ex-HMAS Tobruk \".\" The Fraser Coast, in partnership with Bundaberg, was able to present the most compelling case that a dive site in its area would deliver the most benefit, \"Ms <mark>Jones</mark> said. The ship is expected to set off from Sydney this month but Ms <mark>Jones</mark> said it would probably be 2018 before preparations could be completed so it could be sunk Federal Member for Hinkler Keith Pitt, who claimed it could become one of the country's\" premier \"dive sites, said it had been a difficult three-year campaign .\" This dive wreck will not only bring domestic and international visitors to the region, it will bring much needed long term, sustainable jobs and a future for the next generation, \"Mr Pitt said .\" That has always been the driver behind this campaign: more jobs for this region, with an economic boost of $4 million per year.", "articleID": "2016120206_00384296_W", "names": {"Jack Dempsey": ["Q21621158", "Q6112074"], "Kate Jones": ["Q20235524", "Q41718769", "Q56867959", "Q6375568"]}}, {"date": "2016-12-04", "url": "http://slog.thestranger.com/slog/2016/12/04/24727147/celebration-and-tears-at-standing-rock-as-obama-administration-halts-plans-to-drill-under-the-missouri-river#more", "content": "Celebration and Tears at Standing Rock as Obama Administration Halts Plans to Drill Under the Missouri River by Sydney Brownstone • Dec 4, 2016 at 2:27 pm Tweet Christinia Eala, 70, told me back in September that she took a stand against the pipeline for her grandchildren. Tentatively, it looks like Eala and her fellow water protectors may have won. Today the US Army Corps of Engineers announced in a press release that it is denying a permit builders of the Dakota Access pipeline need in order go forward with their plans to drill under the Missouri River. In response to the decision, Standing Rock Sioux chairman Dave Archambault II has issued this statement: \"This is something that will go down in history and I know that it's a blessing,\" Archambault said. Activists who have been camping out in the cold for months are ecstatic. Benalex Dupris, a film producer I met at camp and a member of the Colville Confederated Tribes from Washington State, described the scene to me like this: The scene at camp is electric, with eagle feathers on top hats, army jackets that don't camouflage from the snow, and wild ass Indians war hooping at each other non stop. Everyone is singing or crying, and in the distance it's either cries of \"Mni Wiconi\" or \"black snake killa .\" Brian Cladoosby, chairman of the Swinomish Indian Tribal Community and president of the National Congress of American Indians, put out a statement thanking the Obama administration for the Army Corps' decision. US Secretary of the Interior Sally Jewell also released a statement saying that there would be \"an in-depth evaluation of alternative routes for the pipeline and a closer look at potential impacts .\" The Army's Assistant Secretary for Civil Works, Jo-Ellen Darcy, announced that alternative routes would be considered through an Environmental Impact Statement, a process that takes months and will incorporate public and tribal input. \"Although we have had continuing discussion and exchanges of new information with the Standing Rock Sioux and Dakota Access, it's clear that there's more work to do,\" Darcy said. Even though the Army Corps of Engineers has denied the Dakota Access pipeline project the permit to drill under Lake Oahe, a man-made reservoir on the Missouri River, much of the construction of the Dakota Access pipeline has already been completed. Dupris, the filmmaker I quoted above, says people are celebrating a \"cautious victory .\" <mark>Donald Trump</mark> has expressed his support for the pipeline project, and it remains to be seen whether a <mark>Trump</mark> administration might just re-issue a permit for a pipeline that impacts tribal rights and access to clean drinking water. \"We hope that Kelcey Warren, Governor Dalrymple, and the incoming <mark>Trump</mark> administration respect this decision and understand the complex process that led us to this point,\" Standing Rock Sioux chairman Dave Archambault II said in a statement. Update: Here's the full statement from Archambault: Today, the U.S. Army Corps of Engineers announced that it will not be granting the easement to cross Lake Oahe for the proposed Dakota Access Pipeline. Instead, the Corps will be undertaking an environmental impact statement to look at possible alternative routes. We wholeheartedly support the decision of the administration and commend with the utmost gratitude the courage it took on the part of President Obama, the Army Corps, the Department of Justice and the Department of the Interior to take steps to correct the course of history and to do the right thing. The Standing Rock Sioux Tribe and all of Indian Country will be forever grateful to the Obama Administration for this historic decision. We want to thank everyone who played a role in advocating for this cause. We thank the tribal youth who initiated this movement. We thank the millions of people around the globe who expressed support for our cause. We thank the thousands of people who came to the camps to support us, and the tens of thousands who donated time, talent, and money to our efforts to stand against this pipeline in the name of protecting our water. We especially thank all of the other tribal nations and jurisdictions who stood in solidarity with us, and we stand ready to stand with you if and when your people are in need. Throughout this effort I have stressed the importance of acting at all times in a peaceful and prayerful manner--and that is how we will respond to this decision. With this decision we look forward to being able to return home and spend the winter with our families and loved ones, many of whom have sacrificed as well. We look forward to celebrating in wopila, in thanks, in the coming days. We hope that Kelcey Warren, Governor Dalrymple, and the incoming <mark>Trump</mark> administration respect this decision and understand the complex process that led us to this point. When it comes to infrastructure development in Indian Country and with respect to treaty lands, we must strive to work together to reach decisions that reflect the multifaceted considerations of tribes. Treaties are paramount law and must be respected, and we welcome dialogue on how to continue to honor that moving forward. We are not opposed to energy independence, economic development, or national security concerns but we must ensure that these decisions are made with the considerations of our Indigenous peoples. To our local law enforcement, I hope that we can work together to heal our relationship as we all work to protect the lives and safety of our people. I recognize the extreme stress that the situation caused and look forward to a future that reflects more mutual understanding and respect. Again, we are deeply appreciative that the Obama Administration took the time and effort to genuinely consider the broad spectrum of tribal concerns. In a system that has continuously been stacked against us from every angle, it took tremendous courage to take a new approach to our nation-to-nation relationship, and we will be forever grateful.", "articleID": "2016120422_00982886_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-12-05", "url": "http://theworldlink.com/business/the-latest-protesters-cheer-army-corps-decision/article_d2a0ea51-a1eb-555f-9ce7-bd1f3f6be9d1.html", "content": "CANNON BALL, N.D. (AP)--The Latest on the Dakota Access pipeline protest (all times local): 5:35 p.m. Hundreds of demonstrators near the Dakota Access pipeline protest camp broke into cheers and chanted \"water is life\" in the Lakota Sioux language as news spread that the federal government won't grant an easement for the project in southern North Dakota. Some in the crowd banged drums. Miles Allard of the Standing Rock Sioux tribe said he was pleased by the decision but remained cautious, saying opponents of the pipeline \"don't know what <mark>Trump</mark> is going to do .\" Allard says he's been telling his people \"to stand up and not to leave until this is over .\" Carla Youngbear of the Meskwaki Potawatomi tribe traveled from central Kansas to be at the protest site. She says she has grandchildren and is going to have great-grandchildren who will need water and that's why she was there. ___ 4:55 p.m.. The Morton County Sheriff's Office says that it has lifted the blockade on a bridge north of the large Dakota Access oil pipeline protest encampment. In a statement, it said that it won't be near the bridge as long as protesters stick to the conditions outlined on Saturday, including only coming to the bridge for predetermined meetings with law enforcement. The release did not comment on the U.S. Army Corps' decision to not grant an easement for the four-state, $3.8 billion pipeline under Lake Oahe, a Missouri River reservoir from which the Standing Rock Sioux tribe gets its drinking water. The large Oceti Sakowin camp is south of the Backwater Bridge, and several hundred people are camped there. ___ 4:15 p.m. U.S. Attorney General Loretta Lynch says that the Department of Justice will still monitor the protest in North Dakota and is ready to \"provide resources\" for those who \"can play a constructive role in easing tensions .\" The U.S. Army Corps of Engineers said Sunday afternoon that the four-state, $3.8 billion Dakota Access oil pipeline cannot be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. North Dakota Gov. <mark>Jack Dalrymple</mark> said in a statement that the Corps' decision \"is a serious mistake,\" \"prolongs the serious problems\" that law enforcement faces and \"prolongs the dangerous situation\" of people camping in cold, snowy conditions. The federal government has ordered the several hundred people at the main encampment, which is on Corps land, by Monday. Lynch said in a statement that the safety of those in the area, including officers, residents and protesters, \"continues to be our foremost concern .\" ___ 4:10 p.m. North Dakota Republican Rep. Kevin Cramer says that the Army Corps' decision not to grant an easement for the Dakota Access oil pipeline is \"a very chilling signal\" for the future of infrastructure in the U.S. Cramer said in a statement that infrastructure will be hard to build \"when criminal behavior is rewarded this way,\" apparently referring to the large protest encampment on federal land and the clashes between demonstrators and law enforcement. The Corps said Sunday afternoon that the pipeline cannot be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. The route has been the subject of months of protests by the Standing Rock Sioux tribe and others, who have argued the pipeline threatens a water source and cultural sites. Cramer also said that \"law and order\" will be restored when <mark>Donald Trump</mark> takes office and that he feels bad for the Corps having to do \"diligent work...only to have their Commander-in-Chief throw them under the bus .\" ___ 4 p.m.. The Secretary of the Interior says the Army Corps' decision to not grant an easement for the Dakota Access oil pipeline \"ensures there will be an in-depth evaluation of alternative routes .\" Sally Jewell also said in a statement that the decision \"underscores that tribal rights...are essential components of the analysis\" for the environmental impact statement. The Corps said Sunday afternoon that the pipeline cannot be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. The route has been the subject of months of protests by the Standing Rock Sioux tribe and others, who have argued the pipeline threatens a water source and cultural sites. The company constructing the pipeline, Dallas-based Energy Transfer Partners, and the Morton County Sheriff's Office didn't have immediate comment. ___ 3:45 p.m. U.S. Army Corps of Engineers says it won't grant an easement for the Dakota Access oil pipeline in southern North Dakota. Corps spokeswoman Moria Kelley said in a news release Sunday that the administration will not allow the four-state, $3.8 billion pipeline to be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. Assistant Secretary for Civil Works Jo-Ellen Darcy said her decision was based on the need to \"explore alternate routes\" for the pipeline's crossing. The route has been the subject of months of protests by the Standing Rock Sioux tribe and others, who have argued the pipeline threatens a water source and cultural sites. The company constructing the pipeline, Dallas-based Energy Transfer Partners, and the Morton County Sheriff's Office didn't have immediate comment. The federal government has ordered people to leave the main encampment, which is on Army Corps of Engineers' land and is close to the construction site, by Monday. Demonstrators say they're prepared to stay, and federal, state and local authorities say they won't forcibly remove the protesters. ___ 2:45 p.m.. A disabled Gulf War veteran from Flint, Michigan, says he sees irony in the parallels between his city's lead-tainted water issue and the four-state Dakota Access pipeline. Art Woodson is a disabled Gulf War veteran who served in the Army and drove to the main protest encampment from North Dakota with two others--a 17-hour nonstop drive. He's here as part of the Veterans Stand for Standing Rock group. The 49-year-old says he is showing is support for \"Native Americans and for water,\" because Flint residents know \"that water is in dire need .\" Woodson also said that \"they're trying to force pipes on people\" but that \"we're trying to get pipes in Flint for safe water .\" The group had said about 2,000 veterans were going to the camp, where several hundred people have for months protested the $3.8 billion pipeline, but it wasn't clear how many actually arrived. The government has ordered people to leave the encampment by Monday. Demonstrators say they're prepared to stay. ___ 1:30 p.m. Get news headlines sent daily to your inbox Sign Up! I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. A Vietnam veteran who's part of a Michigan tribe says he came to the Dakota Access pipeline protest camp because the issue of water quality is \"an issue for everyone .\" Sixty-six-year-old <mark>Steven Perry</mark> is from Traverse City, Michigan, and a member of the Little Traverse Bay band of Odawa Indians. He came to help at the Oceti Sakowin camp, which is on federal land in southern North Dakota, as part of the Veterans Stand for Standing Rock group. <mark>Perry</mark> says: \"When we fought for this country, we fought for everyone .\" The group had said about 2,000 veterans were going to the camp, where several hundred people have for months protested the four-state, $3.8 billion pipeline, but it wasn't clear how many actually arrived. The government has ordered people to leave the main encampment by Monday, but demonstrators say they're prepared to stay. Federal, state and local authorities say they won't forcibly remove the protesters. ___ 1:25 p.m.. An organizer with the Veterans Stand for Standing Rock has told a gathering of veterans near the Dakota Access pipeline protest site that elders have asked they have no confrontations with authorities. Organizer Wes Clark Jr., the son of former Democratic presidential candidate Gen. Wesley Clark, spoke to about 250 veterans Sunday afternoon. State authorities have said they talked with the veterans group and will move away Sunday afternoon from the Blackwater Bridge that's north of the Oceti Sakowin camp on federal land if protesters agree to certain conditions. Wes Clark Jr. spoke of that agreement, saying the National Guard and law enforcement have armored vehicles and are armed. He added: \"If we come forward, they will attack us .\" The group had said about 2,000 veterans were going to the camp, where several hundred people have for months protested the four-state, $3.8 billion pipeline, but it wasn't clear how many actually arrived. Clark asked veterans to help out anyone who needs it at camp. ___ 11:10 a.m.. A Navy veteran and Harvard graduate student says he came to the Dakota Access pipeline protest camp because he thought they could use his help. Twenty-nine-year-old Art Grayson of Cambridge, Massachusetts, said he came to the encampment as part of the Veterans Stand for Standing Rock group. He flew, then met up with other veterans and rode the final leg of the trip from Bismarck in the back of a pickup truck. Hundreds of veterans are expected to come to the camp on federal land, where several hundred people have been in protest of the four-state, $3.8 billion pipeline for months. Grayson said that he \"couldn't stand by and watch people being abused .\" He has finals this week, but told his professors \"I'll see you when I get back .\" The group's GoFundMe.com page had raised more than $1 million of its $1.2 million goal on Sunday, which is to go toward food, transportation and supplies. ___ 7:25 a.m. Authorities in North Dakota say they'll move away from a bridge near the main Dakota Access pipeline protest camp by Sunday afternoon if demonstrators agree to certain conditions. A Morton County Sheriff's Office news release details the conditions as outlined Saturday by Cass County Sheriff Paul Laney, which he said are meant to de-escalate conflict. They include staying in the Oceti Sakowin camp that's south of the Backwater Bridge, coming to it only if there is a prearranged meeting with law enforcement and not removing barriers. Standing Rock Sioux tribal chairman Dave Archambault and Gov. <mark>Jack Dalrymple</mark> have agreed to meet. Archambault told the Bismarck Tribune this weekend that he wanted the blockade on the bridge, damaged in late October during a protest, lifted. Hundreds of veterans are due to gather Sunday on the reservation.", "articleID": "2016120501_00475508_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Jack Dalrymple": ["Q16241268", "Q770393"], "Steven Perry": ["Q28857176", "Q51883997", "Q7615138"]}}, {"date": "2016-12-05", "url": "http://www.theborneopost.com/2016/12/05/california-warehouse-fire-death-toll-climbs-to-33/", "content": "A fireman walks before a warehouse after it was destroyed by a fire, Dec 3, 2016 in Oakland, California. AFP Photo OAKLAND: The death toll from a fire at a California warehouse where a rave party was taking place rose to 33 on Sunday, with authorities saying they had no idea how many more bodies they would find. \"When we started this investigation, if you would have told us we would have 33 victims, we wouldn't have believed you,\" Sergeant <mark>Ray Kelly</mark> of the Alameda County Sheriff's Department told reporters, adding that crews had searched less than half of the gutted building. \"I don't know how many people are left in there. We have no idea how many people were in that building that night...We're expecting the worst and hoping for the best in regards to how many more victims we find .\" The fire in Oakland, near San Francisco, broke out late Friday at the cluttered warehouse where artists and students worked and lived, even though the structure wasn't licensed for such use. The electronic dance music party, with between 50 and 100 guests, also took place without proper permits. The cause of the blaze was still under investigation but Oakland Mayor Libby Schaaf said the district attorney had activated a criminal investigation as a precaution to preserve options as the case unfolded. Authorities on Sunday asked relatives of the missing to \"eliminate future delays\" in identifying victims by preserving items like hairbrushes and toothbrushes for DNA samples. \"We will ask for them as we need them,\" said Captain Melanie Ditzenberger of the sheriff's department coroner's bureau. Firefighters worked for 12 hours by night to enter the building, eventually breaching a wall to clear their way into the warehouse, said Oakland Fire Battalion Chief Melinda Drayton .--\"A few more days'--\"It will take a few more days just getting through the building,\" Drayton told reporters. Images published online show artwork, pianos and wooden objects throughout the building, which helps explain how the fire quickly spread through the structure. \"It was filled end-to-end with furniture, whatnot, collections,\" Fire Chief Teresa Deloach Reed said Saturday. \"It was like a maze, almost .\" \"There wasn't a real entry or exit path,\" she said. In addition, firefighters said the building seemed to have no sprinklers or smoke detectors. Officials said the roof collapsed onto the second floor, which was connected to the ground floor only by a makeshift system of wooden pallets. A dozen bodies were found in an area in the middle of the building, Drayton said. She added that the firefighters had taken every precaution to treat the human remains with respect .--\"It was heartbreaking'--Describing the atmosphere during the night of excavation, Drayton choked back tears:\" It was quiet. It was heartbreaking. \"Most of those who perished in the blaze, which started at about 11:30 pm Friday (0730 GMT Saturday) were thought to have died on the upper floor of the warehouse known as the Oakland Ghost Ship, Reed said. Some of the missing were apparently foreign students thought to be in their 20s and 30s, making identification more difficult. The fire was the deadliest incident in Oakland since the 1989 Loma Prieta earthquake in northern California, which killed 63 people. The deadliest nightclub fire in the United States in recent decades occurred in 2003, when pyrotechnic effects by the rock band Great White set off an inferno at The Station nightclub in Rhode Island, killing 100 people. Oakland, a city of some 420,000, was once deemed largely unsafe but is now home to a more affluent population attracted by affordable rent and proximity to San Francisco .--AFP What do you think of this story? Great (0%) Interesting (0%) Nothing (0%) Sad (0%) Angry (0%)", "articleID": "2016120503_00409705_W", "names": {"Ray Kelly": ["Q16509084", "Q3420958", "Q7297693"]}}, {"date": "2016-12-07", "url": "http://www.indiatimes.com/entertainment/celebs/dilip-kumar-thanks-fans-for-their-wishes-tweets-he-s-feeling-much-better-from-the-hospital-266912.html", "content": "Home> Entertainment> celebscoop <mark>Dilip Kumar</mark> Thanks Fans For Their Wishes, Tweets He's \"Feeling Much Better' From The Hospital Isha Sharma December 07, 2016 Twitter The 93-year-old veteran actor <mark>Dilip Kumar</mark> was recently hospitalized in Mumbai's Lilavati Hospital on Tuesday after complaining of fever and swelling in the right leg. As soon as the news was reported by the media, many of his fans started pouring messages for their beloved actor. Thanking his sweet fans for their wishes and prayers, <mark>Dilip Kumar</mark> posted a series of tweets, updating his fans about his health. In one his tweets, he even thanked his doctors. Feeling much better now. Was admitted to Lilavati hospital for routine checkup. Your prayers are with me. pic.twitter.com/ii3nCMJG3f--<mark>Dilip Kumar</mark> (@ TheDilipKumar) December 7, 2016 A wonderful team of doctors here along with my personal physicians Dr. S Ghokale, Dr. Nitin Ghokale and Dr. R. Sharma. pic.twitter.com/cYeX4wWHSZ--<mark>Dilip Kumar</mark> (@ TheDilipKumar) December 7, 2016 Health is wealth said somebody. Mein aap sabhi ka mashkoor hoon ki aapne hamesha apni dua'on mein mujhe yaad rakha. pic.twitter.com/dWzxDpQiUa--<mark>Dilip Kumar</mark> (@ TheDilipKumar) December 7, 2016 Talking more about his health in an interview with Bombay Times, his wife Saira Banu said,\" I was anyway planning to take him for a routine check-up, but the swelling alarmed me. He was also complaining of cold and cough. I don't ignore anything even remotely suspicious when it comes to <mark>Dilip</mark> Saab's health. The doctors are examining him; he's under observation. He's very comfortable with the team here. I just hope there is nothing serious. Inshallah, I will take him home before his birthday on Sunday. \"The couple has time and again reinstated our faith in love and marriage. Twitter Get well soon, <mark>Dilip</mark> Saab. Don't Miss 12 Of The Best College Canteens In India And What You Should Eat There 12.5 K SHARES Virat Kohli Defending Anushka Sharma From Fans And Critics Has Been Chosen As The Golden Tweet...6.9 K SHARES Congratulations Are In Order! <mark>Zaheer Khan</mark> Is All Set To Marry Chak De Actress Sagarika Ghatge 32.6 K SHARES This Video Of Anushka-Virat Dancing With Each Other On\" Gur Naal Ishq Mitha' Will Make Your...27.9 K SHARES 11 Powerful Photos Of Jayalalithaa Tell You Why She Will Always Be The Silver Jubilee Star 17K SHARES just in celebscoop <mark>Dilip Kumar</mark> Thanks Fans For Their Wishes, Tweets He's \"Feeling Much Better' From The Hospital Partner 7 Christmas Hotspots in Germany That One Must Definitely Visit This Holiday Season 1.9 K SHARES celebscoop A Newcomer Can't Afford Lip Surgery, Says Vaani Kapoor Rubbishing Rumors Of Going Under A Knife 771 SHARES celebscoop The Spectacular Trailer Of Shah Rukh <mark>Khan</mark>'s Raees Is Out & It Has Blockbuster Written All Over It 2.2 K SHARES Partner 8 Things You Must Do Right Now To Retire As A Billionaire 17.8 K SHARES celebscoop Baba Ramdev Beating The Shit Out Of Ranveer In This Dance-Off Will Make You Laugh Until You Cry 4.2 K SHARES celebscoop SRK Reaction To AIB's Confession On Roasting Him Proves That He Is The Coolest One Of The Lot 975 SHARES", "articleID": "2016120708_00634456_W", "names": {"Dilip Kumar": ["Q377789", "Q57368862"], "Zaheer Khan": ["Q24005467", "Q2508461"]}}, {"date": "2016-12-12", "url": "http://ca.sports.yahoo.com/news/hawks-hope-keep-trending-vs-magic-224720473--nba.html", "content": "Hawks hope to keep trending up vs. Magic 21 minutes ago   ATLANTA--The Atlanta Hawks have had a split personality this season, going from terrific during a 9-2 start that featured a six-game winning streak to horrific during a 1-10 swoon that included seven losses in a row. Now are the Hawks ready to return to their good selves? It is a very small sample size, but Atlanta is showing positive signs in winning its past two games and will try to build momentum when it hosts the Orlando Magic on Tuesday night. If the Hawks (12-12) do end up having the season they hoped, coming back from a 20-point halftime deficit to win at Milwaukee on Friday may be looked on as the turning point. Atlanta had shown little resiliency during its slump, losing back-to-back games by 36 and 44 points. That wasn't the case against the Bucks, though. \"The message was, don't lose by 20,\" forward Paul Millsap said after the win in Milwaukee. \"Don't do it again. It was just about having some pride, going out there and trying to get it done .\" Millsap, who missed three games during the losing streak with a bad hip, had 23 points and 14 rebounds during the comeback victory, and point guard Dennis Schroder scored a career-high 33 points. The Hawks have had three days off since the victory and they need to pick right back up from where they left off in Milwaukee. \"We have to take care of business Tuesday,\" Millsap said. \"Get another win and keep building off the last game we've had. Hopefully, we'll continue to get better like we did (Friday).\" \"We have to have the right mindset from the jump ball on Tuesday,\" coach Mike Budenholzer said. The Magic (10-15) lost 17 of their past 22 games against the Hawks and come to Atlanta on a three-game losing streak. Orlando was stingy defensively early this season. That hasn't been the case lately. \"It's just frustrating,\" Magic coach <mark>Frank Vogel</mark> said after Saturday's 121-113 home loss to Denver. \"When you're trying to build something, it takes daily work, daily habits. We certainly have slipped on the defensive end .\" Power forward Nikola Vucevic took a hard fall during the loss at Charlotte on Friday and sat out the Nuggets game because of a lower back contusion. He is questionable against the Hawks, as is center Bismack Biyombo with a sore left shoulder. The Magic salvaged a split of the four-game season series against the Hawks a year ago, winning the final two games. Vucevic was a big part of that, scoring 22 and 28 points. Hawks guard Kent Bazemore missed the last three games because of a sore knee, with Tim Hardaway Jr. taking his place in the starting lineup. Atlanta's other recent lineup change is defensive-minded Thabo Sefolosha starting a small forward and Kyle Korver coming in to add offense when needed. \"I think Kyle can be really effective off the bench,\" Budenholzer said when making the move four games ago. \"I think it will be beneficial for both of them and us .\" Sports & Recreation The D-League will experiment with four and five-person referee crews The NBA's minor league will attempt, in an experimental run, to work with four or five referees in a single game. If the experiment could pan out, the move could go a long way toward pushing the NBA to move toward the use of four or five-person...More & raquo; Ball Don't Lie - 10 minutes ago Hawks hope to keep trending up vs. Magic The Atlanta Hawks have had a split personality this season, going from terrific during a 9-2 start that featured a six-game winning streak to horrific during a 1-10 swoon that included seven losses in a row. Now are the Hawks ready to return to...More & raquo; AP - Sports - 21 minutes ago LeBron to be producer of <mark>Ali</mark> documentary <mark>King James</mark> is set to tell the story of The Greatest. Cleveland Cavaliers star LeBron James will be the executive producer of an HBO documentary on <mark>Muhammad Ali</mark>, who died earlier this year. The as-yet-untitled film will be directed by Antoine...More & raquo; AP - Sports - 1 hour 15 minutes ago MIAMI (AP)--The NBA is going to take a look at having more officials on the court ....More & raquo; AP - Sports - 2 hours 9 minutes ago The Vertical's Chris Mannix and Bobby Marks discuss the floundering Mavs and if the rebuild needs to start with trading the face of their franchise ....More & raquo; Yahoo Sports Videos - 2 hours 14 minutes ago The Celtics received a hoax bomb threat while flying from Boston to Oklahoma City Coach <mark>Brad Stevens</mark> knew of the threat, but his players did not. By the time the Boston Celtics landed in Oklahoma City on Saturday evening, fears surrounding the city's infamous haunted hotel probably felt like child's play in comparison to what...More & raquo; Ball Don't Lie - 2 hours 19 minutes ago LeBron James wore a safety pin on the cover of Sports Illustrated This week's Sports Illustrated features the announcement that LeBron James has been named the magazine's Sportsperson of the Year for 2016. Sports Illustrated named LeBron James its 2016 Sportsperson of the Year. If we're being honest, the first...More & raquo; Ball Don't Lie - 4 hours ago Introducing Cost Per Win and the list of most valuable NBA free-agent signings Kevin Durant has tuned out the noise and turned up the Warriors. Consider it a refresher course on the free agents, coaches, trades, rookies and potential award winners that have shaped the league thus far. NBA teams spent more than $4 billion on...More & raquo; Ball Don't Lie - 4 hours ago NEW YORK (AP)--John Legend will return to the NBA All-Star weekend as the game's halftime performer, it was announced Monday ....More & raquo; AP - Sports - 5 hours ago After months of optimism surrounding a potential new collective bargaining agreement that would allow the NBA and the players' union to avoid another work stoppage, the momentum has slowed a bit as a critical date approaches ....More & raquo; AP - Sports - 5 hours ago Porzingis, Rose lead Knicks past Lakers Carmelo Anthony was thrilled when several Knicks took turns hitting big shots while they held off the Lakers. The Lakers had a similar rhythm going, and now they've lost it. Kristaps Porzingis had 26 points and 12 rebounds, Derrick Rose scored 25...More & raquo; AP - Sports - 16 hours ago Holiday time for Pelicans as New Orleans rally past Suns (The Sports Xchange) - With <mark>Anthony Davis</mark> struggling through a rare poor shooting night, the New Orleans Pelicans were forced to rely on the supporting cast to rally the team and pull out a rare road win. Jrue Holiday scored 16 of his 23 points in...More & raquo; Reuters - 16 hours ago Russell Westbrook lost his triple-double streak, but he still killed the Celtics Bad news, Russell Westbrook: rather than going one up on them, you're going to have to settle for just hanging out alongside Oscar Robertson and <mark>Michael Jordan</mark> for basketball eternity. Westbrook saw his historic streak of triple-doubles snapped at...More & raquo; Ball Don't Lie - 16 hours ago Highlights of Sunday's National Basketball Association games: Thunder 99, Celtics 96 Russell Westbrook scored 37 points to lead the Oklahoma City Thunder to a 99-96 victory over the Boston Celtics on Sunday, though his streak of consecutive...More & raquo; Reuters - 16 hours ago Catch up on all the action from around the league in Sunday's edition of The Fast Break ....More & raquo; NBA.com - 16 hours ago NBA-Holiday time for Pelicans as New Orleans rally past Suns With <mark>Anthony Davis</mark> struggling through a rare poor shooting night, the New Orleans Pelicans were forced to rely on the supporting cast to rally the team and pull out a rare road win. Jrue Holiday scored 16 of his 23 points in the fourth quarter and...More & raquo; Reuters - 16 hours ago Derrick Rose scores 25 points with three boards in the Knicks win over the Lakers ....More & raquo; NBA.com - 17 hours ago Kristaps Porzingis records a double-double with 26 points and 12 rebounds as the Knicks take care of the Lakers on the road ....More & raquo; NBA.com - 17 hours ago Frazier's triple-double keys Pelicans Triple-doubles are nothing new to Tim Frazier. Now he can add one with the New Orleans Pelicans, and that is a much bigger deal. Frazier had 14 points, a career-high 11 rebounds and 11 assists, helping the Pelicans rally from a 15-point...More & raquo; AP - Sports - 17 hours ago Late-fading Kings set to host Lakers Not long ago, Sacramento center DeMarcus Cousins watched how his team performed in the fourth quarter of games, especially late, and opined that the Kings were one of the league's best in the game's final minutes. The Kings (8-15) will be coming...More & raquo; AP - Sports - 17 hours ago", "articleID": "2016121223_00216526_W", "names": {"Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"]}}]