[{"date": "2016-12-12", "url": "http://ca.sports.yahoo.com/news/hawks-hope-keep-trending-vs-magic-224720473--nba.html", "content": "Hawks hope to keep trending up vs. Magic 21 minutes ago   ATLANTA--The Atlanta Hawks have had a split personality this season, going from terrific during a 9-2 start that featured a six-game winning streak to horrific during a 1-10 swoon that included seven losses in a row. Now are the Hawks ready to return to their good selves? It is a very small sample size, but Atlanta is showing positive signs in winning its past two games and will try to build momentum when it hosts the Orlando Magic on Tuesday night. If the Hawks (12-12) do end up having the season they hoped, coming back from a 20-point halftime deficit to win at Milwaukee on Friday may be looked on as the turning point. Atlanta had shown little resiliency during its slump, losing back-to-back games by 36 and 44 points. That wasn't the case against the Bucks, though. \"The message was, don't lose by 20,\" forward Paul Millsap said after the win in Milwaukee. \"Don't do it again. It was just about having some pride, going out there and trying to get it done .\" Millsap, who missed three games during the losing streak with a bad hip, had 23 points and 14 rebounds during the comeback victory, and point guard Dennis Schroder scored a career-high 33 points. The Hawks have had three days off since the victory and they need to pick right back up from where they left off in Milwaukee. \"We have to take care of business Tuesday,\" Millsap said. \"Get another win and keep building off the last game we've had. Hopefully, we'll continue to get better like we did (Friday).\" \"We have to have the right mindset from the jump ball on Tuesday,\" coach Mike Budenholzer said. The Magic (10-15) lost 17 of their past 22 games against the Hawks and come to Atlanta on a three-game losing streak. Orlando was stingy defensively early this season. That hasn't been the case lately. \"It's just frustrating,\" Magic coach <mark>Frank Vogel</mark> said after Saturday's 121-113 home loss to Denver. \"When you're trying to build something, it takes daily work, daily habits. We certainly have slipped on the defensive end .\" Power forward Nikola Vucevic took a hard fall during the loss at Charlotte on Friday and sat out the Nuggets game because of a lower back contusion. He is questionable against the Hawks, as is center Bismack Biyombo with a sore left shoulder. The Magic salvaged a split of the four-game season series against the Hawks a year ago, winning the final two games. Vucevic was a big part of that, scoring 22 and 28 points. Hawks guard Kent Bazemore missed the last three games because of a sore knee, with Tim Hardaway Jr. taking his place in the starting lineup. Atlanta's other recent lineup change is defensive-minded Thabo Sefolosha starting a small forward and Kyle Korver coming in to add offense when needed. \"I think Kyle can be really effective off the bench,\" Budenholzer said when making the move four games ago. \"I think it will be beneficial for both of them and us .\" Sports & Recreation The D-League will experiment with four and five-person referee crews The NBA's minor league will attempt, in an experimental run, to work with four or five referees in a single game. If the experiment could pan out, the move could go a long way toward pushing the NBA to move toward the use of four or five-person...More & raquo; Ball Don't Lie - 10 minutes ago Hawks hope to keep trending up vs. Magic The Atlanta Hawks have had a split personality this season, going from terrific during a 9-2 start that featured a six-game winning streak to horrific during a 1-10 swoon that included seven losses in a row. Now are the Hawks ready to return to...More & raquo; AP - Sports - 21 minutes ago LeBron to be producer of <mark>Ali</mark> documentary <mark>King James</mark> is set to tell the story of The Greatest. Cleveland Cavaliers star LeBron James will be the executive producer of an HBO documentary on <mark>Muhammad Ali</mark>, who died earlier this year. The as-yet-untitled film will be directed by Antoine...More & raquo; AP - Sports - 1 hour 15 minutes ago MIAMI (AP)--The NBA is going to take a look at having more officials on the court ....More & raquo; AP - Sports - 2 hours 9 minutes ago The Vertical's Chris Mannix and Bobby Marks discuss the floundering Mavs and if the rebuild needs to start with trading the face of their franchise ....More & raquo; Yahoo Sports Videos - 2 hours 14 minutes ago The Celtics received a hoax bomb threat while flying from Boston to Oklahoma City Coach <mark>Brad Stevens</mark> knew of the threat, but his players did not. By the time the Boston Celtics landed in Oklahoma City on Saturday evening, fears surrounding the city's infamous haunted hotel probably felt like child's play in comparison to what...More & raquo; Ball Don't Lie - 2 hours 19 minutes ago LeBron James wore a safety pin on the cover of Sports Illustrated This week's Sports Illustrated features the announcement that LeBron James has been named the magazine's Sportsperson of the Year for 2016. Sports Illustrated named LeBron James its 2016 Sportsperson of the Year. If we're being honest, the first...More & raquo; Ball Don't Lie - 4 hours ago Introducing Cost Per Win and the list of most valuable NBA free-agent signings Kevin Durant has tuned out the noise and turned up the Warriors. Consider it a refresher course on the free agents, coaches, trades, rookies and potential award winners that have shaped the league thus far. NBA teams spent more than $4 billion on...More & raquo; Ball Don't Lie - 4 hours ago NEW YORK (AP)--John Legend will return to the NBA All-Star weekend as the game's halftime performer, it was announced Monday ....More & raquo; AP - Sports - 5 hours ago After months of optimism surrounding a potential new collective bargaining agreement that would allow the NBA and the players' union to avoid another work stoppage, the momentum has slowed a bit as a critical date approaches ....More & raquo; AP - Sports - 5 hours ago Porzingis, Rose lead Knicks past Lakers Carmelo Anthony was thrilled when several Knicks took turns hitting big shots while they held off the Lakers. The Lakers had a similar rhythm going, and now they've lost it. Kristaps Porzingis had 26 points and 12 rebounds, Derrick Rose scored 25...More & raquo; AP - Sports - 16 hours ago Holiday time for Pelicans as New Orleans rally past Suns (The Sports Xchange) - With <mark>Anthony Davis</mark> struggling through a rare poor shooting night, the New Orleans Pelicans were forced to rely on the supporting cast to rally the team and pull out a rare road win. Jrue Holiday scored 16 of his 23 points in...More & raquo; Reuters - 16 hours ago Russell Westbrook lost his triple-double streak, but he still killed the Celtics Bad news, Russell Westbrook: rather than going one up on them, you're going to have to settle for just hanging out alongside Oscar Robertson and <mark>Michael Jordan</mark> for basketball eternity. Westbrook saw his historic streak of triple-doubles snapped at...More & raquo; Ball Don't Lie - 16 hours ago Highlights of Sunday's National Basketball Association games: Thunder 99, Celtics 96 Russell Westbrook scored 37 points to lead the Oklahoma City Thunder to a 99-96 victory over the Boston Celtics on Sunday, though his streak of consecutive...More & raquo; Reuters - 16 hours ago Catch up on all the action from around the league in Sunday's edition of The Fast Break ....More & raquo; NBA.com - 16 hours ago NBA-Holiday time for Pelicans as New Orleans rally past Suns With <mark>Anthony Davis</mark> struggling through a rare poor shooting night, the New Orleans Pelicans were forced to rely on the supporting cast to rally the team and pull out a rare road win. Jrue Holiday scored 16 of his 23 points in the fourth quarter and...More & raquo; Reuters - 16 hours ago Derrick Rose scores 25 points with three boards in the Knicks win over the Lakers ....More & raquo; NBA.com - 17 hours ago Kristaps Porzingis records a double-double with 26 points and 12 rebounds as the Knicks take care of the Lakers on the road ....More & raquo; NBA.com - 17 hours ago Frazier's triple-double keys Pelicans Triple-doubles are nothing new to Tim Frazier. Now he can add one with the New Orleans Pelicans, and that is a much bigger deal. Frazier had 14 points, a career-high 11 rebounds and 11 assists, helping the Pelicans rally from a 15-point...More & raquo; AP - Sports - 17 hours ago Late-fading Kings set to host Lakers Not long ago, Sacramento center DeMarcus Cousins watched how his team performed in the fourth quarter of games, especially late, and opined that the Kings were one of the league's best in the game's final minutes. The Kings (8-15) will be coming...More & raquo; AP - Sports - 17 hours ago", "articleID": "2016121223_00216526_W", "names": {"Brad Stevens": ["Q18164413", "Q4954288"], "Frank Vogel": ["Q1444383", "Q2456047", "Q36935609"], "King James": ["Q17100723", "Q36159"], "Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"], "Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}}, {"date": "2016-12-13", "url": "http://www.indcatholicnews.com/news.php?viewStory=31543", "content": "Diocese of East Anglia to lead the way in opening new Catholic schools December 13, 2016 The Catholic Diocese of East Anglia is to be among the first to open new Catholic schools after the proposed removal of the 50% faith admissions cap, with plans for up to eight in the pipeline. East Anglia has some of the most severe shortage of places in Catholic schools in the country due to the demographic changes that have taken place in the region over the past decade. Since Prime Minister Theresa May announced the proposed removal of the 50% cap on faith admissions, the Diocese has been progressing with a number of bids. Should the policy be lifted after the Government's consultation on the issue closed on December 12, the Diocese is in a position to act straight away to move towards the opening of new schools. The areas of East Anglia where the new schools are being proposed are those with some of the highest need for places and where possible sites for the schools have already been identified. In Cambridgeshire, the Diocese wants to establish a high school and a primary school in West Cambourne and another primary in the Cherry Hinton area. The Diocese also wants to establish a new primary school in Peterborough. A new Catholic primary school is also being proposed in Thetford within the significant new housing development planned to the north of the town, whilst two primaries and possible sixth form provision are hoped for in Norwich. In addition, the Sacred Heart Convent School in Swaffham is also considering proposals for a new free school as well as possible expansion plans. Assistant Director for the Schools Commission for the Diocese of East Anglia, Helen Bates, said: \"It is a very exciting time and we are really looking forward to opening new schools which are desperately needed to meet the demand we already have here in East Anglia .\" For the Catholic Church, the cap has meant it has been unable to open any new Catholic schools in case it results in Catholic children being turned away from a Catholic school. In East Anglia we have some of the most severe shortages of places, which is why we want to bid for so many new schools. \"Brian Conway, Chief Executive Officer of the St John the Baptist Catholic Multi-Academy Trust, which currently covers six primaries and a high school in Norfolk and north Suffolk, said:\" The possibility of new Catholic schools is hugely exciting. Catholic schools have a long history of providing a successful education to widely diverse pupil populations. For example, our current primary school in Norwich, St Francis of Assisi, has more than 40% of its pupils whose first language is not English. \"We also have a real need for Catholic primary school places in north Norwich and this is growing as large housing developments in places like Sprowston and Rackheath are planned. A school in north Norwich could serve a Catholic need from this housing as well as an existing need across north Norfolk where there are no Catholic schools. We are also considering the possibility of new sixth form provision in central Norwich, which could be linked to extra 11-16 places at Notre Dame High School .\" Director of the Catholic Education Service, <mark>Paul Barber</mark>, said: \"This is fantastic news from the Diocese of East Anglia and we warmly welcome their announcement. Up and down the country we are seeing pockets of high demand for Catholic education and if the cap is lifted we will be able to answer that call. Catholic schools are the most ethnically diverse in the country and consistently outperform the national average when it comes to KS2 and KS4 results. We are excited at this opportunity to give more children an outstanding Catholic education .\" Notre Dame pupils in Science class Parents can register their interest in any of the new schools at: http: //rcdea.org.uk/freeschools/ Share:", "articleID": "2016121312_00409997_W", "names": {"Paul Barber": ["Q7149214", "Q7149215", "Q7149216", "Q7149218"]}}, {"date": "2016-12-13", "url": "http://www.theprovince.com/entertainment/review", "content": "This image released by Lucasfilm Ltd. shows Riz Ahmed as Bodhi Rook in a scene from, \"Rogue One: A Star Wars Story .\" (Jonathan Olley/Lucasfilm Ltd. via AP) Photo by \"Rogue One: A Star Wars Story\" seemed suspicious on paper, like any film saddled with the dreaded \"spinoff\" label. For a while all the odds looked stacked against it too--reshoots, script changes and a director in <mark>Gareth Edwards</mark> whose last blockbuster \"Godzilla\" had visual flair but no humanity, not to mention the fact that the film would be asking us to learn a dozen new characters with strange names, none of which were Skywalker or Solo. And of course as with any franchise there's that ever-present knowledge that, in some ways, this is another line-item on a corporate profit sheet. As it turns out, those should-be liabilities were only assets in the end. \"Rogue One\" is a bold and stirring adventure film that will have both fans and casual observers spellbound. It is easily the most exciting blockbuster in recent memory this side of \"Mad Max: Fury Road,\" and that includes \"The Force Awakens,\" which now looks lazy and bloated with sentimentality and fan service in comparison to the subversive ingenuity of \"Rogue One .\" How refreshing it is to have a truly contained film that doesn't have any objective beyond the story at hand. There is nothing to advance, nothing to tease, no \"maybe we'll find answers in the next movie in 2 years\" here. It is just allowed to be what it is, which is an intense and visually engrossing powder keg of a film. It's a simple idea, really: Who are the rebels who stole the plans for the Death Star? That pivotal action kicked off the original \"Star Wars\" and it's pretty inherently dramatic. Loosely, \"Rogue One\" is rooted around the plight of Jyn Erso, whose father Galen Erso (Mads Mikkelsen) is a scientist who once worked for the Empire. He gets drawn back in by the ambitious Orson Krennic (Ben Mendelsohn) to help finish the Death Star, leaving Jyn, played by Beau and Dolly Gadsdon as a young girl, and <mark>Felicity Jones</mark> as an adult, to survive on her own. Jyn is sort of raised by a rebel extremist in Saw Gerrera (an over-the-top Forest Whitaker), but much of this is left both unseen and unexplained. What we know is she's a child of war, and an almost apathetic one at that, until she's rescued from imprisonment by a group of rebels hoping her familial connections might help with their efforts against the Empire. There she's put together with a deadpan droid K-2S0 (Alan Tudyk) and a spy, Cassian (<mark>Diego Luna</mark>), who's given a secret mission within the mission. Eventually they meet the blind Jedi Chirrut (Donnie Yen), his decidedly more practical companion Baze Malbus (<mark>Wen Jiang</mark>) and the conflicted pilot (Riz Ahmed), forming a motley crew of unlikely heroes. The real feat of \"Rogue One\" is that <mark>Edwards</mark> and screenwriters Chris Weitz and Tony Gilroy create a world with actual stakes, making the audience feel for and worry about characters we've just met. It doesn't rely on decades old nostalgia, although there is a bit of that too in mostly unobtrusive ways. There's also some CGI that veers pretty dramatically into the uncanny valley. But like the somewhat slow and disjointed beginning, eventually it all just washes over you, especially as the riveting action kicks in, taking you from the trenches to space and back again. The only downside of the thrilling battles in the third act is that it means less time with the leads--especially <mark>Jones</mark>, <mark>Luna</mark> and Mendelsohn, whose performances make up for the script's occasional deficiencies. \"Rogue One: A Star Wars Story\" is one of the best Star Wars films ever made. Only time will tell if it will surpass \"The Empire Strikes Back\" as the franchise standard bearer. There's a compelling case to be made. \"Rogue One: A Star Wars Story,\" a Walt Disney Studios release, is rated PG-13 by the Motion Picture Association of America for \"extended sequences of sci-fi violence and action .\" Running time: 133 minutes. Three and a half stars out of four. ___ MPAA Definition of PG-13: Parents strongly cautioned. Some material may be inappropriate for children under 13. ___ Follow AP Film Writer on Twitter: www.twitter.com/ldbahr Comments Share your thoughts", "articleID": "2016121319_00612530_W", "names": {"Diego Luna": ["Q30122923", "Q313044"], "Felicity Jones": ["Q16232172", "Q21402730", "Q234447"], "Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"], "Wen Jiang": ["Q40090181", "Q42565956", "Q42773688", "Q45500933", "Q716069"]}}]