[{"date": "2016-12-13", "url": "http://feeds.latimes.com/~r/latimes/entertainment/news/music/~3/TPRwW2K2Jb8/la-pol-ca-oakland-mayor-libby-schaaf-20161213-story.html", "content": "Libby Schaaf knows how to make being mayor of one of California's most troubled cities look like fun. When the Golden State Warriors won the NBA championship last year, Oakland's top elected official rode in the victory parade with hometown music legend M.C. Hammer atop a fire-breathing car shaped like a snail, her gonzo chariot for city celebrations. But although the car represents an image of Oakland that Schaaf has promoted--creative, exuberant and more than a little offbeat--recent months have brought a cascade of reminders of this Bay Area city's deep-rooted problems. \"There is hardly a day that goes by as mayor of Oakland that I'm not met with some unpredictable challenge,\" Schaaf said in an interview. Updates on California politics: Lawmakers send gun measures to Gov. <mark>Brown</mark>, initiative on parole overhaul makes the Nov. 8 ballot Updates on California politics: Lawmakers send gun measures to Gov. <mark>Brown</mark>, initiative on parole overhaul makes the Nov. 8 ballot June 30, 2016, 5:45 p.m. Welcome to Essential Politics, our daily feed on California government and politics news. Here's what we're watching: Legislators sent Gov. <mark>Jerry</mark>... Updates on California politics: Lawmakers send gun measures to Gov. <mark>Brown</mark>, initiative on parole overhaul makes the Nov. 8 ballot June 30, 2016, 5:45 p.m. Welcome to Essential Politics, our daily feed on California government and politics news. Here's what we're watching: Legislators sent Gov. <mark>Jerry</mark>... Read the story The city's police force was rocked by a sex abuse scandal that has stalled the department's effort to emerge from more than a decade of federal oversight. The Oakland Raiders football team is threatening to move to Las Vegas. Local leaders are struggling to keep the city affordable despite a rising tide of wealth from the tech boom. And all of that was before the deadliest fire in Oakland's history ripped through a warehouse Dec. 2, killing 36 people who had gathered for an underground concert. The tragedy was compounded by subsequent revelations that the city appeared to have never inspected the building. When Schaaf stepped to the microphone at a nighttime vigil three days after the blaze, mourners shouted \"go home .\" The boos grew louder as she talked about addressing safety issues in loosely regulated warehouses where artists work and live. Red Cross workers outside the Ghost Ship warehouse Dec. 7. Francine Orr / Los Angeles Times Red Cross workers outside the Ghost Ship warehouse Dec. 7. Red Cross workers outside the Ghost Ship warehouse Dec. 7. (Francine Orr / Los Angeles Times) \"This city is going to go through a lot of emotions and one of them is going to be anger and that's part of my job--to hear that and feel that,\" she told the crowd. \"My job is to keep this city and this community together right now .\" Whether she accomplishes that job may define Schaaf's tenure as mayor of a city that's already undergoing what she describes as \"a radical transformation .\" Cracking down on unsafe buildings could cause evictions, inflaming tensions in a city that declared a housing emergency this year. But doing nothing doesn't seem to be an option either. \"If she doesn't do something quick, and come up with solutions, I don't know how she moves forward,\" said Joseph Sarapochillo, a real estate developer. \"This is just not going to go away .\" Schaaf, 51, one of California's few prominent female elected officials, arrived in office with a solid political pedigree. A former lawyer, she started working in local government as an Oakland City Council aide, then under Gov. <mark>Jerry Brown</mark> when he was mayor. She served as a City Council member for four years before beating out a crowded field of candidates in 2014 to become mayor herself. Deadly Oakland warehouse fire Read more stories If Schaaf wants to seek higher office, she already has the team she needs--she's represented by the same high-powered political consultants at SCN Strategies as <mark>Brown</mark> and Lt. Gov. Gavin Newsom. Once a high school cheerleader, the Oakland-born mayor has been an ebullient booster for her hometown. She wears earrings in the shape of the oak tree the city is named after and considers herself a defender of Oakland's \"secret sauce .\" She says city bureaucrats are really \"fantasti-crats\" and promotes \"techquity,\" her buzzword for ensuring the technology industry's boom benefits rather than displaces low-income residents. Last year the ride-sharing company Uber announced plans for a new office with up to 3,000 employees in downtown Oakland, a development that Schaaf hopes will bring a much-needed economic boost to a city with entrenched poverty. \"She has a lot of goodwill built up,\" said Don Perata, a former state Senate president who unsuccessfully ran for mayor of Oakland. But the city, which is home to a large activist community, has earned a reputation for being difficult to govern. \"Your honeymoon is brief,\" Perata said. \"And the problems are one after another .\" Schaaf's predecessor, Jean Quan, was hobbled by her response to Occupy Oakland protesters in 2011. She initially allowed them to camp out by City Hall, but police later forced protesters to vacate in violent confrontations. Mayor Libby Schaaf, center, is flanked by emergency personnel during a press conference near the site of the Ghost Ship fire on Dec. 5 Marcio <mark>Jose Sanchez</mark> / Associated Press Mayor Libby Schaaf, center, is flanked by emergency personnel during a press conference near the site of the Ghost Ship fire on Dec. 5 Mayor Libby Schaaf, center, is flanked by emergency personnel during a press conference near the site of the Ghost Ship fire on Dec. 5 (Marcio <mark>Jose Sanchez</mark> / Associated Press) Now it's Schaaf's turn to face a crisis with the Ghost Ship fire, which struck at the intersection of long-festering problems about affordable housing and the city's sense of identity. Schaaf said she wants to address the former and preserve the latter, improving safety while also ensuring that Oakland remains an eclectic haven for artists. \"It would be another tragedy if we didn't take this moment to improve our systems,\" she said. \"We can still always do better, and that's part of what we owe everyone who has been affected by this tragedy .\" The city convened a task force after the fire, but threading the needle won't be easy. Activists are already wary of an administration they feel has been too cozy with developers who are eager to renovate older buildings or demolish them to make way for higher-priced dwellings. And political opponents criticized Schaaf as slow to get a handle on problems within her administration. \"For someone who has been in city government for as long as Libby Schaaf has been, her failure to get on top of what some of these departments is doing is really inexcusable,\" said <mark>Dan Siegel</mark>, a civil rights lawyer who ran against Schaaf in the 2014 mayor's race. Victims of the Oakland warehouse fire: Who they were Los Angeles Times Staff A fire ripped through a warehouse in Oakland on Dec. 2, killing 36 people who were there for an electronic music concert. Here are the names of those who have been confirmed dead by the Alameda County Sheriff's Office Coroner's Bureau or immediate family members. Did you know one of the victims...A fire ripped through a warehouse in Oakland on Dec. 2, killing 36 people who were there for an electronic music concert. Here are the names of those who have been confirmed dead by the Alameda County Sheriff's Office Coroner's Bureau or immediate family members. Did you know one of the victims...(Los Angeles Times Staff) The Police Department, which is struggling to emerge from federal oversight that began in 2003 after a pattern of civil rights abuses, has been another challenge for Schaaf. A new scandal erupted this year when a 19-year-old woman accused several officers of having sex with her when she was underage. Besides criminal charges for some officers, the scandal has caused widespread turmoil within the department. The chief resigned, and his two successors resigned soon after. The department has been run by a civilian city administrator since June, and the chief position remains unfilled. Barry Donelan, president of the Oakland Police Officers' Assn., Association said the turmoil has been demoralizing and prompted some to leave the force. \"The uncertainty among the rank-and-file fuels that,\" he said. <mark>John Burris</mark>, a civil rights lawyer who brought the lawsuit that led to federal oversight more than a decade ago and now represents the young woman in the recent scandal, said Schaaf was doing the best she could in a difficult situation. \"This is the job you ask for, right?\" he said. \"Every year, something comes up .\" Oakland Mayor Libby Schaaf, left, speaks beside Oakland Chief of Police Sean Whent in May. He resigned amid a department sex-crimes scandal this summer. Ben Margot / Associated Press Oakland Mayor Libby Schaaf, left, speaks beside Oakland Chief of Police Sean Whent in May. He resigned amid a department sex-crimes scandal this summer. Oakland Mayor Libby Schaaf, left, speaks beside Oakland Chief of Police Sean Whent in May. He resigned amid a department sex-crimes scandal this summer. (Ben Margot / Associated Press) One of those things is the potential for the Oakland Raiders to leave the city, something they've threatened before. Nevada has lined up $750 million in public money to lure the team. By comparison, Schaaf's plan to keep the Raiders in Oakland, which is being placed before the City Council and county supervisors for a vote Tuesday, includes $350 million in public resources, including infrastructure investments and land for a new stadium. Although the proposal leaves taxpayers on the hook for less, it's unlikely to be enough to satisfy the Raiders or the National Football League, which has the final say on whether the team is allowed to move. In the midst of all of these challenges, Schaaf is still trying to carve out time for long-term plans to improve the city. She highlighted a partnership with philanthropists and businesses, the Oakland Promise, to help students graduate high school and attend college. \"We can't just be reactive to crises,\" she said. \"We have to invest in sustainable, comprehensive solutions .\" On Saturday, she attended a meeting in Mosswood, a hub for the city's African American community, the quickly gentrifying Temescal neighborhood, where another fire destroyed a recreation center that housed programs for elementary school children and teens with developmental disabilities. After Schaaf spoke to the crowd, she answered questions from residents and chatted with retired NFL running back Marshawn Lynch, who grew up nearby. Cynthia Armstrong, 37, said she feels for the mayor. \"This is the type of city where there is constantly something happening,\" she said. \"So how do you stop and pause to fix some things that you inherited if the next crisis is always at hand? I think she is doing the best that she can at this point .\" Caption Kanye West at <mark>Trump</mark> Tower Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Caption Kanye West at <mark>Trump</mark> Tower Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Caption President Obama and <mark>Donald Trump</mark> in the Oval Office President Obama and <mark>Donald Trump</mark> discuss their visit at the White House President Obama and <mark>Donald Trump</mark> discuss their visit at the White House Caption Hillary Clinton's concession speech A portion of Hillary Clinton's concession speech. A portion of Hillary Clinton's concession speech. Caption President Obama talks about the 2016 election and the future President Obama talks about the 2016 election and the future President Obama talks about the 2016 election and the future Caption <mark>Donald Trump</mark>'s acceptance speech: \"It is time for us to come together' President-elect <mark>Donald Trump</mark> gives his acceptence speech at a election party at a New York City Hilton hotel with his family and vice president-elect Mike Pence. President-elect <mark>Donald Trump</mark> gives his acceptence speech at a election party at a New York City Hilton hotel with his family and vice president-elect Mike Pence. chris.megerian @ latimes.com Twitter: @ chrismegerian ALSO:\" It's excruciating': Inside the heartbreaking recovery of 36 bodies in Oakland warehouse Ghost Ship tragedy puts focus on plight of Oakland artists dealing with soaring Bay Area housing costs Updates on California politics Updates from the campaign trail", "articleID": "2016121322_00393880_W", "names": {"Dan Siegel": ["Q5214384", "Q5214386"], "Donald Trump": ["Q22686", "Q27947481"], "Jerry Brown": ["Q152451", "Q717620"], "John Burris": ["Q6224014", "Q6224016"], "Jose Sanchez": ["Q25860481", "Q3186563", "Q3810586", "Q5548031"]}}, {"date": "2016-12-14", "url": "http://www.newsmax.com/Politics/White-House-press-conference-access/2016/12/14/id/763993", "content": "Priebus Promises Change of White House Press Corps \"Tradition' (\"The Hugh Hewitt Show\" / YouTube) Wednesday, 14 Dec 2016 04:51 PM Close A A Incoming White House chief of staff Reince Priebus said Wednesday the new <mark>Trump</mark> administration intends to \"revisit\" some of White House press corp's traditional access, declaring \"change is going to happen .\" In an interview on \"\"the conservative host asked Priebus to comment on the White House press corps' reported concern <mark>Trump</mark> will either do away or radically change briefings and other aspects of reporters' access at the White House. The Hugh Hewitt Show,\" It just so happens that we're actually talking about those things right now, and what the new tradition, I guess you could say, should be in the <mark>Trump</mark> White House, \"Priebus said. Priebus offered the example of assigned seating at press briefings--suggesting that might be over .\" You know, this was the first front row assigned seat issue, as I understand it, started in the Obama administration, \"he said .\" In the Bush administration, you just took a seat, and I guess there were a couple of people that have had reserved spots. \"But for the most part, the more formalized reserved seating piece came in over the last eight years. That issue is being talked about .\" Change, he said, is a certainty. \"The traditions, while some of them are great, I think it's time to revisit a lot of these things that have been done in the White House, and I can assure you that change is going to happen, even on things that might seem boring like this topic,\" he said. President-elect <mark>Donald Trump</mark> has had a throughout his campaign and after his election. contentious relationship with the media Related Stories:", "articleID": "2016121422_00042750_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-12-14", "url": "http://westport-news.com/news/crime/article/Trump-urged-to-tackle-campaign-finance-in-swamp-10796555.php", "content": "http: //www.westport-news.com/news/crime/article/Trump-urged-to-tackle-campaign-finance-in-swamp-10796555.php <mark>Trump</mark> urged to tackle campaign finance in \"swamp draining' Julie Bykowicz, Associated Press Updated 5:01 pm, Wednesday, December 14, 2016 Photo: Evan Vucci, AP Image 1of/1 Caption Close Image 1 of 1 President-elect <mark>Donald Trump</mark> speaks during a rally at the Wisconsin State Fair Exposition Center, Tuesday, Dec. 13, 2016, in West Allis, Wis.. President-elect <mark>Donald Trump</mark> speaks during a rally at the Wisconsin State Fair Exposition Center, Tuesday, Dec. 13, 2016, in West Allis, Wis.. Photo: Evan Vucci, AP <mark>Trump</mark> urged to tackle campaign finance in\" swamp draining' 1 / 1 Back to Gallery WASHINGTON (AP)--Washington lawmakers acknowledge they spend a \"sickening\" amount of time raising money--and a bipartisan advocacy group sees President-elect <mark>Donald Trump</mark> as part of the cure. Issue One has united 165 former members of Congress, governors and administration officials behind a plan to rewrite campaign finance laws to give small donors more power in the political process. The coalition is led by former Indiana Rep. Tim Roemer, who says Republican and Democratic lawmakers often describe their fundraising duties as \"sickening .\" \"You had <mark>Trump</mark> saying he was going to do something about this,\" Roemer told a news conference Wednesday. He said <mark>Trump</mark> and Democratic presidential candidate Bernie Sanders, both of whom raised hundreds of millions of dollars from small donors, \"launched a hand grenade into Washington with this election .\" As presidential candidates, both lambasted the influence that money--particularly from big donors--holds over politicians. Lawmakers, Roemer said, think <mark>Trump</mark> could use his political juice next year to help pass the first major campaign finance overhaul in more than a decade. After the 2002 legislation known as McCain-Feingold, which limited how much special interests could give to the political parties, court rulings and legal and regulatory changes have cleared a path for unlimited donations to outside groups. That has reduced the importance of smaller donations. Republican former Transportation Secretary Ray LaHood, part of the Issue One effort, said the current system is \"awash in money, with little or no accountability\" and said Washington should embrace voters' calls for change. Issue One has passed along its policy proposals to <mark>Trump</mark> transition aides Kellyanne Conway, <mark>Donald Trump</mark> Jr., Steve Bannon and others, said Nick Penniman, the group's executive director. Key pieces include incentivizing small donors by providing them a tax rebate and restructuring the Federal Election Commission. The group is hoping to break through to <mark>Trump</mark>, who has put forward no policy proposals on campaign finance even as he has repeatedly pledged to \"drain the swamp\" of Washington. His swamp-draining platform centers on curbing the influence of lobbyists, and Penniman says its failure to include campaign finance proposals is a major oversight. Yet many of <mark>Trump</mark>'s actions and comments on the campaign trail have campaign-finance reformers feeling hopeful. Throughout the primary campaign, when he was largely paying out of his own pocket, the billionaire New York businessman called out rivals as \"puppets\" of big donors and promised to change the system. In the general election, <mark>Trump</mark> dialed back that rhetoric as he began raising money--including from donors writing half-million-dollar checks to his campaign and party allies. Still, <mark>Trump</mark> was one of most successful low-dollar fundraisers in history. His campaign raised more than twice as much from people giving less than $200 than from larger donors, fundraising documents show. Democratic former Agriculture Secretary Dan Glickman, who also signed on to the Issue One plan, said <mark>Trump</mark> might be able to achieve what President Barack Obama couldn't--sweeping changes in how federal campaigns are financed. Despite running on such a mantra in 2008, Obama \"did not engage in this issue very strongly at all,\" Glickman said. <mark>Trump</mark> can take up the fight because \"he doesn't have a stake in this current system like I think previous presidents have,\" Glickman said. __ Follow Julie Bykowicz on Twitter at http: //www.twitter.com/bykowicz Most Popular 1 Video: Troopers save driver from burning car 2 Staples winter preview: Seideman, Pritchett form 1-2 punch for...3 Greens Farms opens new squash facility with Staples 4 Police: Westport man ran from cops after crash 5 Westport police: Weston man drove drunk, ran red light 6 To Kill a Mockingbird: Still relevant after 50 years 7 Stratford man allegedly shoplifted in Westport View Comments & copy; 2016 Hearst Communications, Inc. .", "articleID": "2016121422_00214482_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-12-15", "url": "http://duncanbanner.com/oklahoma/news/firefighter-applicants-undergo-testing-this-week/article_baebef25-4add-5ddd-aaea-24f301a7a0df.html", "content": "1of 2Staff photo by <mark>Mark Hughes</mark> Basic firefighter applicants leave a smoke-filled building as part of their testing to become a member of Muskogee's Fire Department. About 49 candidates arrived for the agility test, and by the end of the day only 18 made it. There are four basic firefighters position open. Staff photo by <mark>Mark Hughes</mark> A candidate applying for one of four basic firefighter positions climbs a 75-foot ladder tilted to 75 degrees. The test's purpose is to find out if applicants are afraid of heights. The candidate is wearing a safety belt with lines attached. Firefighter applicants undergo testing this week By <mark>Mark Hughes</mark> | CNHI News Oklahoma6 hrs agoStaff photo by <mark>Mark Hughes</mark> Basic firefighter applicants leave a smoke-filled building as part of their testing to become a member of Muskogee's Fire Department. About 49 candidates arrived for the agility test, and by the end of the day only 18 made it. There are four basic firefighters position open. Staff photo by <mark>Mark Hughes</mark> A candidate applying for one of four basic firefighter positions climbs a 75-foot ladder tilted to 75 degrees. The test's purpose is to find out if applicants are afraid of heights. The candidate is wearing a safety belt with lines attached. ENID, Okla.--Zack Gamble said that since he was a child he's known he wanted to be a firefighter. \"Firefighters have always been my hero,\" the Broken Arrow man said. Honor, community service and employment were some of the reasons given by applicants taking Muskogee Fire Department's employment tests this week. \"There were 86 applications submitted, and about 49 of them showed up to compete for four entry level firefighter positions,\" said Jeff Watkins, training officer, about Tuesday's agility test. The first test was to run or walk 1 1/2 miles in 13 minutes, and 21 made it through the run and three could not complete 35 sit-ups in two minutes. They were also required to finish 25 pushups in two minutes. Austin Seabolt of Muskogee had a leg up on his competitors. While in the U.S. Navy, he was required to run 1 1/2 miles in 13 minutes and 30 seconds. By coincidence, he was trained to work in the Navy police and fire departments. He was pretty confident of passing the agility test because he works out at the gym about five days a week, he said. Teddy Baker of Fort Gibson is one of the applicants. \"It has always been my nature to help others. That is my calling, and this is a godsend,\" Baker said. Levi Drier of Vian said finding employment near home is difficult. \"There's not many good jobs to choose from,\" Drier said. Muskogee resident Jake Woodard said the agility test wasn't easy. \"The run was most difficult with the cold wind,\" Woodard said. During their run, and remaining portion of their test, the temperature was 44 degrees with wind chill making it feel like 37 degrees, said a National Weather Service meteorologist. \"We typically lose 50 percent on the run, but some years 40 percent and other years 60 percent,\" Watkins said. The candidates also will take a written test and be interviewed by the chief officers. Once the four candidates are selected a drug test and physical evaluation is conducted. Watkins said that the selectees are on probation for a year and will receive a monthly evaluation that includes their performance, attitude and respectfulness. They also have to pass an emergency medical responders course and a basic firefighters course. The remaining agility events determined whether applicants had back problems, were claustrophobic or afraid of heights. The final test was ascending and descending a 75-foot ladder positioned at 75 degrees to discover whether they were afraid of heights, said Fire Chief Mike O’Dell. Other events included carrying 125 pounds 100 feet that simulated carrying fire equipment and carrying a rolled hose while walking on a 4-inch beam simulating a roof's plank. Reach <mark>Mark Hughes</mark> at (918) 684-2908 or mhughes @ muskogeephoenix.com. Tags", "articleID": "2016121515_01209085_W", "names": {"Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"]}}, {"date": "2016-12-16", "url": "http://dailyherald.com/article/20161216/entlife/312169897/", "content": "LOS ANGELES--\"Rogue One: A Star Wars Story\" blasted into theaters with a $29 million opening night, according to Friday estimates from Disney. It's the biggest Thursday preview of 2016, narrowly topping \"Batman v. Superman: Dawn of Justice's\" $27.7 million and \"Captain America: Civil War's\" $25 million. But it doesn't hold a candle to last year's Star Wars installment \"The Force Awakens,\" which brought in a record $57 million from Thursday night showings. Directed by <mark>Gareth Edwards</mark> and set before the events of the original 1977 \"Star Wars,\" \"Rogue One\" is the first in a series of planned spinoff films set in the Star Wars universe. It's expected to earn over $130 million this weekend, which would make it the second-biggest December debut ever behind \"The Force Awakens,\" which fetched $247.9 million.", "articleID": "2016121618_00284063_W", "names": {"Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"]}}, {"date": "2016-12-17", "url": "http://www.heraldonline.com/news/local/news-columns-blogs/andrew-dys/article121556642.html#storylink=rss", "content": "Order Reprint of this Story YORK Every year in the weeks leading up to Christmas, Buddy Owens, the jolly Vietnam veteran on Oklahoma Street in York, puts out lights and decorations to bring cheer to the Musical Heights neighborhood. To get to Oklahoma Street, you take South Pacific Street and pass Dolly Street. The neighborhood streets are all named for famous musicals. It was always considered a safe place to enjoy the lights. Nobody loved it more than Owens. \"It's always so beautiful over there. I have known Buddy for years and he always had such beautiful lights,\" said Doris Mode at York's senior center. Others at the center talked of driving their grandchildren past Owens' house to see the lights. But on Dec. 11, while Owens was fixing a palm tree light display in his front yard, he was attacked by two pit bull mix dogs and his arms injured so badly that he remains hospitalized after several surgeries. Police put it bluntly: Owens' left arm was mangled. One of the dogs had chased another woman in the neighborhood into her house, and a police officer who responded was threatened by one of the dogs before shooting it to protect himself and others. York's mayor Eddie Lee said the attack on Owens \"could have been fatal,\" and he will bring up a potential dangerous dog law to other city leaders in January. \"This was an attack,\" Lee said. \"Musical Heights, that's a safe neighborhood. But what happened could have been deadly .\" Lee said he plans to bring up the potential for a law against dangerous dogs despite the council being told about a decade ago that the city could not enact \"breed specific\" laws after complaints about pit bulls. \"After what happened here in York, we need to take another look at it,\" Lee said. A rash of dog attacks a decade ago prompted Rock Hill officials to look at a dangerous dog law aimed at pit bulls and Rottweilers, but that law never was passed after outcries from owners of those breeds. <mark>Robert Miles</mark>, the owner of one of the two dogs in the Dec. 11 attack, said the dogs are mixes of Boxer and American Pit Bull terrier, but had not previously shown aggressive behavior. Although both dog owners have been cited for leash law violations, police have so far filed no criminal charges. Investigators are continuing to look at the circumstances around the attack, said detective Billy Mumaw of the York Police Department who is handling the investigation. People in York were stunned by the attack and remain concerned. \"I am a Vietnam veteran just like Mr. Owens and what happened to him is just terrible,\" said <mark>Steve Ramsey</mark> of York. \"Here he survived Vietnam and at his age this happens to him. That's not right .\" Owens, 71, who worked almost four decades for a textile company, is a Musical Heights neighborhood Christmas staple but his family said it remains unclear if Owens will be released from a Charlotte hospital in time for Christmas. And even days after the attack this week, as Christmas approaches, many people drove down Oklahoma Street. Not just to see the lights as they have for so many years, but to see where a man was severely attacked in his own yard while trying to make Christmas bright for others.", "articleID": "2016121800_00144875_W", "names": {"Robert Miles": ["Q1629565", "Q310985", "Q7347674"]}}]