[{"date": "2016-12-17", "url": "http://www.heraldonline.com/news/local/news-columns-blogs/andrew-dys/article121556642.html#storylink=rss", "content": "Order Reprint of this Story YORK Every year in the weeks leading up to Christmas, Buddy Owens, the jolly Vietnam veteran on Oklahoma Street in York, puts out lights and decorations to bring cheer to the Musical Heights neighborhood. To get to Oklahoma Street, you take South Pacific Street and pass Dolly Street. The neighborhood streets are all named for famous musicals. It was always considered a safe place to enjoy the lights. Nobody loved it more than Owens. \"It's always so beautiful over there. I have known Buddy for years and he always had such beautiful lights,\" said Doris Mode at York's senior center. Others at the center talked of driving their grandchildren past Owens' house to see the lights. But on Dec. 11, while Owens was fixing a palm tree light display in his front yard, he was attacked by two pit bull mix dogs and his arms injured so badly that he remains hospitalized after several surgeries. Police put it bluntly: Owens' left arm was mangled. One of the dogs had chased another woman in the neighborhood into her house, and a police officer who responded was threatened by one of the dogs before shooting it to protect himself and others. York's mayor Eddie Lee said the attack on Owens \"could have been fatal,\" and he will bring up a potential dangerous dog law to other city leaders in January. \"This was an attack,\" Lee said. \"Musical Heights, that's a safe neighborhood. But what happened could have been deadly .\" Lee said he plans to bring up the potential for a law against dangerous dogs despite the council being told about a decade ago that the city could not enact \"breed specific\" laws after complaints about pit bulls. \"After what happened here in York, we need to take another look at it,\" Lee said. A rash of dog attacks a decade ago prompted Rock Hill officials to look at a dangerous dog law aimed at pit bulls and Rottweilers, but that law never was passed after outcries from owners of those breeds. <mark>Robert Miles</mark>, the owner of one of the two dogs in the Dec. 11 attack, said the dogs are mixes of Boxer and American Pit Bull terrier, but had not previously shown aggressive behavior. Although both dog owners have been cited for leash law violations, police have so far filed no criminal charges. Investigators are continuing to look at the circumstances around the attack, said detective Billy Mumaw of the York Police Department who is handling the investigation. People in York were stunned by the attack and remain concerned. \"I am a Vietnam veteran just like Mr. Owens and what happened to him is just terrible,\" said <mark>Steve Ramsey</mark> of York. \"Here he survived Vietnam and at his age this happens to him. That's not right .\" Owens, 71, who worked almost four decades for a textile company, is a Musical Heights neighborhood Christmas staple but his family said it remains unclear if Owens will be released from a Charlotte hospital in time for Christmas. And even days after the attack this week, as Christmas approaches, many people drove down Oklahoma Street. Not just to see the lights as they have for so many years, but to see where a man was severely attacked in his own yard while trying to make Christmas bright for others.", "articleID": "2016121800_00144875_W", "names": {"Steve Ramsey": ["Q4389824", "Q56676015"]}}, {"date": "2016-12-21", "url": "http://canadafreepress.com/article/its-climate-regulations-that-threaten-us", "content": "Our nation is not threatened by manmade climate change. It is threatened by regulations implemented in the name of protecting us from dangerous manmade climate and weather It's climate regulations that threaten us Comments | Print Friendly | Subscribe | Email Us In President-Elect <mark>Donald Trump</mark>'s Contract with the American Voter, a \"100-day action plan to Make America Great Again,\" Mr. <mark>Trump</mark> outlines several measures he says he will undertake to create jobs and spur economic growth. While much of his proposed agenda will help to improve the economy while also leaving reasonable environmental protections in place, I believe there are two additional environment-related policy changes that he could take to jump-start the economy. In a September 21, 2015, appearance on Hugh Hewitt's radio show, Mr. <mark>Trump</mark> said, \"I'm not a believer in man-made global warming. I mean, Obama thinks it's the number-one problem in the world today. I think it's very low on the list ....We have much bigger problems .\" If these comments accurately reflect <mark>Trump</mark>'s views, a first important step he could take to undo the damage done by the Obama administration's vainglorious attempt to control climate and weather would be to reverse the Environmental Protection Agency's (EPA) determination that carbon dioxide (CO2) is a pollutant endangering public and environmental health. This \"endangerment finding\" came about in response to EPA following a narrow 5-4 Supreme Court decision in the 2007 case Massachusetts v. EPA. In that case, a majority of the justices ruled that, if EPA determines carbon-dioxide emissions are causing global warming--and global warming may reasonably be expected to endanger public health or welfare--then EPA has the authority to regulate carbon dioxide as a pollutant. In fact, the justices ruled, EPA would be required to regulate carbon dioxide under such a finding, unless it can provide a reasonable basis for not choosing to regulate this vitally important, plant-fertilizing gas. Relying on unsubstantiated projections produced by the U.N. Intergovernmental Panel on Climate Change, EPA did determine that CO2 emissions from cars and industry do threaten human welfare. That led directly to the agency's decision to limit those emissions. For instance, the endangerment finding was the basis for ratcheting up automobile fuel-economy standards to 54.5 mpg by 2025. That could soon mean consumers no longer have the right or ability to choose the vehicles they drive--based on safety, passenger or cargo considerations, for example--by either forcing all but the smallest cars off the roads or, at the very least, making larger cars and trucks too expensive for all but the relatively wealthy to drive. Additionally, the endangerment finding serves as the foundation for various Obama administration regulations requiring utilities, oil and gas producers, and other entities to cut their greenhouse gas emissions. If these draconian rules are not overturned by the <mark>Trump</mark> Administration, Americans will pay much more for energy and their energy supplies will be less reliable. Mr. <mark>Trump</mark> cannot undo the endangerment finding with the stroke of a pen. To reverse it, he must instead charge EPA to demonstrate, through independent, validated research, that carbon-dioxide emissions are \"toxic\" (which they are not at any levels that might occur in Earth's atmosphere)--or that global warming is causing measurable amounts of sea-level rise, increased hurricane numbers or intensity, the spread of diseases, or other harms directly attributable to carbon-dioxide emissions in the United States. Continued below ...", "articleID": "2016122113_00099951_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-12-22", "url": "http://www.chieftain.com/news/5471134-120/health-law-pelosi-care?#comments", "content": "Pelosi rallies House Democrats to oppose health law repeal By MARY CLARE JALONICK Associated Press Published: December 22, 2016; Last modified: December 22, 2016 09:54 AM WASHINGTON--House Democratic Leader Nancy Pelosi is calling on members of her caucus to begin the new Congress by highlighting the risks of repealing the health care law. In a letter to Democratic colleagues late Wednesday, Pelosi said 2016 has been a difficult year for the country and that House Democrats \"stand ready to fight vigorously for America's hard-working families .\" Pelosi asked the lawmakers to hold press events in early January to tell voters about Republican plans to repeal the law, called the Affordable Care Act, at the beginning of the year. Republicans will begin work immediately next year toward repealing the health care law. Some Republicans, including <mark>Donald Trump</mark>'s nominee to lead the Health and Human Services Department, have also sought to overhaul Medicare. Discuss this story", "articleID": "2016122218_00481205_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2016-12-22", "url": "http://ph.sports.yahoo.com/news/voices-of-sport-john-inverdale-the-unflappable-presenter-who-has-been-our-companion-at-the-big-events-for-decades-192647960.html", "content": "Voices of Sport: John Inverdale - The unflappable presenter who has been our companion at the big events for decades View Photo Voices of Sport: John Inverdale - The unflappable presenter who has been our companion...In our weekly series, Yahoo Sport's Nick Metcalfe features a famous voice of sport. As we look forward to a bumper feast of festive action, presenter John Inverdale goes under the spotlight. This series has featured many famous characters from a bygone era. This week, we profile somebody that has been very much part of our modern sporting lives. If you've followed sport on radio and television over the past 30 years, there's no way you will have missed John Inverdale. Whether you've been tuning into the Olympics, Wimbledon, The Open or Cheltenham, Inverdale has so often been the main man. A great radio operator throughout his career, Inverdale has spent more time on TV as the years have gone on. Whatever the medium, he remains in the very top echelon of contemporary broadcasters, with viewers and listeners everywhere respecting his genuine love of sport and natural authority. It's no surprise that sport has always been a huge part of Inverdale's life. He has always enjoyed playing rugby union, and while at university in Southampton, he captained the tennis team. He had his eye on a life in journalism from his early days. He edited the student newspaper during his time on the south coast, before he started his career in print journalism at the Lincolnshire Echo. Radio wasn't far behind however, and Inverdale joined BBC Radio Lincolnshire in 1982. Three years later he began working for national BBC stations. In those days, Radio 2 was the home of sport on the radio. The main Saturday afternoon programme was called Sport on 2, and wasn't dissimilar from the offerings of today, expect there was a little bit less of everything. It began at 1.30 pm, and carried second half commentary of a key football match. Inverdale became the main presenter of the programme, a job he carried on doing for six years. A new station, Radio 5, went on the air in 1990, followed in 1994 by 5 Live. But the Saturday programme stayed the same. Inverdale suited it very well, remaining unflappable no matter what the dramas. The main highlights I recall during his time on the programme include the 1991 Rugby World Cup, where England beat old rivals Scotland to reach the final, but lost to Australia in the Twickenham climax. There was also an infamous day in racing history, the 1993 Grand National that had a bungled start and became the \"race that never was\". And of course there were countless football dramas, as the old Division One made way for the Premier League and the FA Cup continued to throw up its shock results. Inverdale interviews Ryanair CEO Michael O’Leary during the 2015 Cheltenham Festival I'd argue Inverdale has been the No. 1 voice in radio sport for the last 30 years. I've always thought it's his natural home too. The story has it that Jenny Abramsky, the launch controller of 5 Live, was so impressed by his style presenting sport that she tried to incorporate that into all forms of presentation on the new station, including news coverage. She wanted it to be informal and relaxed, but also intelligent. Pure Inverdale in other words. Indeed, Inverdale has always been at home working on news programmes too. He presented the daily drivetime programme Nationwide in those early years of 5 Live, picking up a Sony Broadcaster of the Year award in 1997. Even to this present day, a good deal of Inverdale's work is in that cherished old medium. He is the main host of 5 Live's coverage from the Cheltenham Festival at the start of spring--which he clearly relishes as a big fan of National Hunt racing--and leads the BBC radio golf team at both The Open and Ryder Cup. Inverdale just works so well on radio, having a natural warmth and sense of occasion about him. Actually, that's one of his real strengths. He brings a real gravitas to a major event. When he goes on air at the start of the Cheltenham Festival or Open Championship, he just sells the event so brilliantly. He makes you feel that you want, even need, to spend the next few days enjoying some great sport with the radio team. It's possibly even fair to say that he set the benchmark for modern presentation, which has now become standard, with the likes of Mark Pougatch and now <mark>Mark Chapman</mark> following in his footsteps. The Olympic Games has always been a big event for Inverdale, ever since he was part of the Radio 2 team at the 1988 Games in Seoul. I well remember him fronting late night 5 Live coverage during the 1996 Atlanta Olympics. Actually, millions must have shared that Games with him as they headed to bed. After one particularly memorable night of track and field, which featured a 100m final that saw Linford Christie disqualified and Donovan Bailey winning gold--along with <mark>Jonathan Edwards</mark> just missing out on triple jump gold--I recall him saying: \"Sport really is one of the great trivialities, but sometimes, how glorious is it?\" Rugby union is probably still seen as Inverdale's main sport. He played at a decent standard for Esher, and has clearly always loved the sport deeply. The World Cups of 1995 in South Africa and 2003 in Australia saw Inverdale in his element as the main presenter for 5 Live. Both tournaments produced unforgettable sporting moments while he was on the air--South Africa President Nelson Mandela handing the trophy to home captain Francois Pienaar in 1995 and Jonny Wilkinson nervelessly slotting over a last-gasp drop goal to break the hearts of hosts Australia and win the 2003 tournament for England. As the years have gone on, Inverdale has also expanded his television portfolio. In the 1990s, he began presenting a late night discussion and magazine programme, On Side. And today the majority of his year is spent working in front of the camera. His time at the Olympics has now become TV rather than radio based, including presenting BBC coverage of the rowing at the London and Rio Games, which both featured some memorable British gold medals. He also presented the athletics coverage in London, with its many wonderful moments including Mo Farah's long distance double. Since 2006, he's been the main presenter of the BBC's Six Nations coverage, although these days coverage is shared with ITV. For many years, he fronted the BBC's daily highlights programme from Wimbledon, before moving to his current role as TV commentator during the SW19 fortnight. Inverdale, who for so long has been associated with the BBC, has moved to the other side too, working for ITV at events like the French Open tennis and the 2015 Rugby World Cup. I always think he's at his best when he has proper time to settle into an event, and always seems particularly assured and relaxed during the fortnight of ITV coverage from Roland Garros in the spring. It also has to be said that Inverdale has been no stranger to controversy in recent times. He clumsily said this about tennis star Marion Bartoli before her appearance in the 2013 Wimbledon final: \"I just wonder if her dad did say to her when she was 12, 13, 14 maybe,\" Listen, you are never going to be, you know, a looker'. \"Inverdale was accused of being sexist and apologised on air the following day. He also mistakenly swore during radio coverage at Cheltenham, and appeared to have some difficulties working alongside Sir Steve Redgrave at the recent Rio Olympics. The rowing legend rolled his eyes in Inverdale's direction and shook a wet umbrella over his head. At one stage, there was so much criticism of him that one national newspaper asked earlier this year:\" Why does everyone hate John Inverdale? \"If you ask me, nearly all that business has been absurdly overblown. Inverdale is still one of the giants of broadcasting. It's true that he may have the odd clumsy moment, but if you weigh it up against his millions of sensible words, I think he's still built up plenty of credit in the positive bank. Inverdale shows no signs of stopping. Why should he? Those big sporting occasions wouldn't feel quite the same without him. There's another Cheltenham and Roland Garros coming in the new year, then a Ryder Cup in 2018, and a Rugby World Cup in 2019. Inverdale, who turns 60 in 2017, is still pretty near the top of his game. He has become one of the most famous voices of our sporting times. --", "articleID": "2016122219_01056533_W", "names": {"Jonathan Edwards": ["Q16213939", "Q18719387", "Q19957695", "Q20656891", "Q22018231", "Q221648", "Q302892", "Q6273021", "Q629737"], "Mark Chapman": ["Q27524127", "Q27922303", "Q55622208", "Q57053134", "Q57520002", "Q6767044", "Q6767045"]}}, {"date": "2016-12-29", "url": "http://eonline.com/news/818767/carrie-fisher-s-autopsy-on-hold-as-family-begins-planning-funerals-for-debbie-reynolds-and-star-wars-actress", "content": "Press Enter to Search Carrie Fisher's Autopsy on Hold as Family Begins Planning Funerals for Debbie Reynolds and Star Wars Actress By ShareEmail As the grieving process continues following the deaths of and, those closest to the Hollywood stars are beginning the emotional task of arranging funerals. Debbie Reynolds Carrie Fisher While nothing has been finalized just yet, E! News has learned that discussions are currently underway to determine what is the best way to honor two talented ladies. According to <mark>Todd Fisher</mark>, a joint funeral has been discussed but is not official. \"That is my preference,\" he shared with E! News. \"Obviously it's not finalized, but I think that sounds like a grand idea given the beautiful story between them .\" In only a matter of months, both Debbie and Carrie were set to star in the HBO documentary, Bright Lights: Starring Debbie Reynolds and Carrie Fisher. Photos Debbie Reynolds & Carrie Fisher's Mother-Daughter Moments Kevork Djansezian/Getty Images While the premiere day has yet to be announced, <mark>Todd</mark> revealed to E! News that HBO reached out and both parties hope the documentary can be a part of the memorial in some way. \"Remarkably enough, the [Bright Lights] documentary is the greatest tribute you can imagine to both of them,\" <mark>Todd</mark> shared. As planning continues, The Los Angeles Coroner's Office confirmed to E! News Thursday afternoon that Carrie's body is in their possession and that the autopsy is on hold due to the \"family's loss for two .\" \"We're not out to rush the family,\" the office shared with us. \"We're giving the family some space. They not only lost Carrie, but lost Debbie too .\" As the tributes continue pouring in from fans and celebrities alike, <mark>Todd</mark> revealed that many of Carrie's Star Wars co-stars have reached out. And while many of the tributes will remain private, some family members can't help but express some of their emotions on social media. \"This is a beautiful love story to witness in my 58 years,\" <mark>Todd</mark> wrote on Twitter with a drawing of a mother and daughter. \"I miss them both so much. Love is everlasting .\" --Reporting by Holly Passalaqua and Alli Rosenbloom", "articleID": "2016123004_00407773_W", "names": {"Todd Fisher": ["Q7812365", "Q7812366"]}}, {"date": "2017-02-01", "url": "http://www.derehamtimes.co.uk/sir_henry_bellingham_calls_for_sensible_perspective_and_says_former_breckland_councillor_charles_carter_comments_in_different_league_to_donald_trump_1_4872420", "content": "Sir Henry Bellingham calls for \"sensible perspective\" and says former Breckland councillor Charles Carter comments in \"different league\" to <mark>Donald Trump</mark> Annabelle Dickson annabelle.dickson @ archant.co.uk @ newsannabelle 01 February, 2017 - 14:30 Charles Carter at the Boxing Day hunt at Raynham Hall. He has been suspended following an incident while hunting with the Middleton Hunt. Picture: Ian Burt A Norfolk MP has claimed a former Breckland councillor and hunt master's comments to a female protestor were in a \"different league\" to <mark>Donald Trump</mark> and needed \"sensible perspective\". Share 3 Comments Email this article to a friend To send a link to this page you must be logged in. Sir Henry Bellingham claimed that while Charles Carter's comments were \"completely inappropriate and out of order for someone of his standing\" , they had been made in a \"purely private context\". Mr Carter, who was master of the West Norfolk Fox Hounds until last May, was filmed when he was approached by 41-year-old mum-of-four Linda Hoggard to challenge him over his activities. As he took out his own phone to video her, he asked her name and then told her: \"I'd quite like to **** you, actually\" , before adding: \"Can I take you to bed, please?\" Smiling, he then added: \"You're very pretty,\" before finally asking: \"Can I have your number, please?\" In a letter to the Eastern Daily Press, Sir Henry, the MP for North-West Norfolk, praised the former Saham Toney councillor's \"many different achievements\" , claiming it would be \"very sad\" if they were undermined by his \"10 second aberration\". He said: \"My starting point is that the remarks he made during what he thought was a private conversation were completely inappropriate and out of order for someone of his standing .\" However, I do believe that we need to keep this in some sort of perspective. Indeed, if you compare his remarks to some of the completely vile ones about women made by <mark>Donald Trump</mark>, and some of the anti-Semitic remarks made by Labour MPs, then Charles Carter's remarks are in a different league. \"He went on to say that there appeared to be\" growing tendency these days to give someone a good kicking when they are down, and completely fail to acknowledge their success and achievements over many years \". He claimed Mr Carter was very\" conscientious, incisive and professional \"as a councillor, and he had provided a\" great deal of leadership and effort \"in his job as Joint Master and Amateur Huntsman of the West Norfolk Hunt. Tory councillor Charles Carter resigned from Breckland Council last Wednesday. A notice of vacancy for the Saham Toney ward is on the council website at www.breckland.gov.uk/article/3430/Elections-2016-2017", "articleID": "2017020115_00469778_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-02-06", "url": "http://www.aol.co.uk/living/2017/02/06/messi-alba-and-umtiti-backed-by-luis-enrique-over-ban-threat/", "content": "Messi, Alba and Umtiti backed by <mark>Luis Enrique</mark> over ban threat By Omnisport Feb 6th 2017 02:46 PM - <mark>Luis Enrique</mark> says Barcelona trio Lionel Messi, Jordi Alba and Samuel Umtiti will play as normal against Atletico Madrid despite being one booking away from missing a potential Copa del Rey final. Three yellow cards over the course of the competition results in a one-game ban, leaving the three players - who all have two to their name - in a precarious situation ahead of the second leg of the semi-final with Atletico on Tuesday. Barca lead the last-four tie 2-1 on aggregate, but are already without Neymar for the match at Camp Nou, who received his third yellow card of the tournament in the first leg. <mark>Luis Enrique</mark>, though, will play Messi, Alba and Umtiti without fear of them receiving a costly ban and does not expect the tense situation to affect their play. \"No [it will not affect our approach to the game] because fortunately these players are very good at knowing the situation,\" the head coach said at his pre-match media conference. \"I don't think it is going to affect how these players play in the game. The most important thing is to beat Atletico Madrid and get into the final .\" After that we will see what has happened, but I don't think it is going to play a role. \"There is nothing I can do to change Neymar being out - so [being frustrated] would be a waste of energy .\" I have fewer options at that position than midfield, although I do have some interesting players I can put there on the wing. \"But we are going to make the other coach [Diego Simeone] think about it and not give away who we are going to play there .\" <mark>Luis Enrique</mark>: My players are experts in big games https: //t.co/WLCx4KWp2I #CopaFCB #ForçaBarça pic.twitter.com/F21IO0LVmN", "articleID": "2017020615_00165952_W", "names": {"Luis Enrique": ["Q222789", "Q322350"]}}, {"date": "2017-02-15", "url": "http://wect.com/story/34511253/woman-contests-ticket-issued-for-parking-1-minute-early", "content": "Woman contests ticket issued for parking 1 minute early - WECT TV6-WECT. com: News, weather & sports Wilmington, NC Woman contests ticket issued for parking 1 minute early - WECT TV6-WECT. com: News, weather & sports Wilmington, NC Member Center: Woman contests ticket issued for parking 1 minute early 2017-02-15T17:22:01 Z PROVIDENCE, RI (RNN)--A woman appeared in a Rhode Island traffic court to contest a ticket she received for parking one minute too early. Well, 2 seconds too early. The woman, who is called Sarah in the video, received the ticket for parking in a \"no parking zone\" that ended at 10 a.m.. The ticket was issued at 9:59 and 58 seconds. Judge <mark>Frank Caprio</mark>, who has his own YouTube show \"Caught in Providence\" turned his disbelief over the ticket into humor. \"You've taken the wrong path in life,\" he told the woman with a smile. The woman said her car clock said 10 a.m., and the judge teased her for blaming the clock. <mark>Caprio</mark> also joked that Providence's parking enforcement officers \"were second to none in the country\" before dismissing the violation. \"I think 9:59 is close enough to 10,\" <mark>Caprio</mark> said. Copyright 2017 Raycom News Network. All rights reserved. Updated: Wednesday, February 15 2017 1:47 PM EST 2017-02-15 18:47:44 GMT Outside of a hard rain that typically floods Water Street, you don't find many water hazards in downtown Wilmington. Sand traps aren't in abundance either. But that will change for at least one week in May. Updated: Wednesday, February 15 2017 1:44 PM EST 2017-02-15 18:44:17 GMT A community is heartbroken after a head-on collision sent three people to the hospital, where two elderly people eventually died. <mark>John Howard</mark>, 84, and Betty Erdman,87, were leaving an 84th birthday celebration for <mark>Howard</mark> the night of February 2nd. They never made it out of the driveway.", "articleID": "2017021518_01211731_W", "names": {"Frank Caprio": ["Q5485673", "Q5489862"], "John Howard": ["Q1467025", "Q51330", "Q5670833", "Q58363217", "Q6228200", "Q6236889", "Q6240028", "Q6240032", "Q6240035", "Q6240041", "Q6240047"]}}]