[{"date": "2017-02-16", "url": "https://phys.org/news/2017-02-cells-bricklaying-scaffolding.html", "content": "Bacteria appear to build a new cell wall working from the outside in with the help of multiple molecular \"bricklayers', in about a quarter of an hour. The\" bricklayers' move along the inside of the wall under construction by \"treadmilling'; the building of the cell wall is performed from scaffolding that is continuously being moved at the front, while at the rear it is continuously being dismantled. Credit: TU Delft It is the most crucial mechanism in life - the division of cells. For 25 years, it has been known that bacteria split into two by forming a Z ring at their centre. They use this to cut themselves into two daughter cells. Using advanced microscopes, researchers from the universities of Harvard, Indiana, Newcastle, and Delft have succeeded in finding out how bacteria do this. The bacteria appear to build a new cell wall working from the outside in with the help of multiple molecular\" bricklayers', in about a quarter of an hour. What was completely unexpected was that the \"bricklayers' move along the inside of the wall under construction by\" treadmilling'; the building of the cell wall is performed from scaffolding that is continuously being moved at the front, while at the rear it is continuously being dismantled. The scientists will be publishing an article on the topic in Science on 17 February. Colours They investigated the process by viewing individual bacteria through advanced microscopes. This involved putting coloured labels on the cell wall material. By changing the colours every time, they were able to see that the bacteria were building the cell walls from the outside in. And by changing the colours of the building material with breaks of just a few seconds, they were also able to see that this is not a gradual process, but one that takes place in a different location each time. The engine that drives all of this is FtsZ, a protein that makes an arched - haped piece of polymer, and which appears to move via a phenomenon known as \"treadmilling', named after the old treadmills from the Middle Ages. Protein as scaffolding\" With treadmilling, you create movement by adding something on the front, while removing something from the rear, \"explains Professor <mark>Cees Dekker</mark> of TU Delft, a co-author on the article .\" Our research shows that a cell also uses this phenomenon for building a cell wall. \"Cell walls are built with the help of a number of collaborating proteins, with FtsZ playing the most important part .\" Our new discovery has solved the 25-year-old puzzle of how FtsZ coordinates cell division. The protein appears to work like a kind of scaffolding, on which the building work takes place. However, it is not rolling scaffolding, but fixed scaffolding that is continuously renovating itself: all the time, the cell is building new scaffolding boards for the work on the cell wall on, let's say, the right-hand side of the FtsZ scaffolding, while breaking up the now-superfluous scaffolding on the left-hand side, at the rear end of the work. This way, the scaffolding shifts along the cell wall. The building machine that produces the cell wall is controlled from the scaffolding, therefore moving neatly in tandem with the slowly moving scaffolding. The cell does this with different sets of scaffolding along the cell wall simultaneously, resulting in the construction of a partition wall in ten or fifteen minutes. Meanwhile, other proteins make sure that the DNA is divided properly between the two halves, for example, or that the membrane is properly closed off, and so on. The division of cells is a complex and fascinating process. \"The video will load shortly Bacteria appear to build a new cell wall working from the outside in with the help of multiple molecular\" bricklayers', in about a quarter of an hour. The \"bricklayers' move along the inside of the wall under construction by\" treadmilling'; the building of the cell wall is performed from scaffolding that is continuously being moved at the front, while at the rear it is continuously being dismantled. Credit: TU Delft/Scixel Nanoboxes The study was a collaborative project involving researchers from four scientific groups, in the US, the UK, and Delft. The most significant contribution from Delft consisted of the production of nanostructures in which exactly one bacterium fits, lengthwise. \"By placing the nanoboxes upright on the microscope, we were able to see in very sharp focus a cross-section of the cell. This gave us an excellent view of the dynamics of the FtsZ molecules. An important technical contribution .\" explains <mark>Dekker</mark>. Although the study is fundamental in nature, <mark>Dekker</mark> believes that this type of research may be of practical benefit in the future. \"Once we have a thorough understanding of how bacterial cells divide, it could pave the way towards alternative antibiotics. That is still some way off, but if we are able to disrupt bacterial cell division in a targeted manner, we may have new weapons in the future that we can use to fight bacteria that cause disease .\" Special nanocages fitting one cell allow the observation of the forming of the cell wall in bacteria Credit: TU Delft Explore further: Bacterial protein structure could aid development of new antibiotics More information: \"Treadmilling by FtsZ filaments drives peptidoglycan synthesis and bacterial cell division,' Science, 17 February 2017. science.sciencemag.org/cgi/doi/10.1126/science.aak9973", "articleID": "2017021619_00809053_W", "names": {"Cees Dekker": ["Q330365", "Q42683239"]}}, {"date": "2017-02-18", "url": "http://www.sbs.com.au/news/article/2017/02/19/pcb-gives-sharjeel-and-latif-14-days", "content": "19 Feb 2017 - 3:42 am PCB gives Sharjeel and <mark>Latif</mark> 14 days Suspended duo Sharjeel Khan and <mark>Khalid Latif</mark> have been given a fortnight by the Pakistan Cricket Board to respond to charges of spot-fixing. Source: Tweet The Pakistan Cricket Board has given Sharjeel Khan and <mark>Khalid Latif</mark> 14 days to respond to charges of violating its anti-corruption code in the Pakistan Super League. Sharjeel and <mark>Latif</mark> have already given statements to the PCB's anti-corruption unit in Lahore amid allegations of spot-fixing. \"Today we have given them the charge sheet and now they are bound to respond to the charges within two weeks,\" PCB spokesman Amjad Bhatti said in Lahore on Saturday. Bhatti said if the players denied the charges the PCB will form a three-member tribunal, including a retired judge and a former cricketer, to hear the case. A PCB disciplinary committee will decide on punishment if the charges are accepted by the players, Bhatti said. Last week, the PCB provisionally suspended both players, who represented Islamabad United in the PSL. On Monday Britain's National Crime Authority arrested two men, one of them believed to be former Pakistan opening batsman Nasir Jamshed, before releasing them on bail in connection with alleged spot-fixing in the PSL. The PCB also suspended Jamshed from playing any form of cricket. Three more players - Islamabad United's <mark>Mohammad Irfan</mark>, Quetta Gladiators' Zulfiqar Babar and Karachi Kings' Shahzaib Hassan - were questioned by the anti-corruption unit, but none of them were suspended. All three continue to play in the PSL, which is being held in the United Arab Emirates. Advertisement", "articleID": "2017021817_00144067_W", "names": {"Khalid Latif": ["Q6399529", "Q6399530"], "Mohammad Irfan": ["Q16045779", "Q20983357", "Q21642592", "Q23415113", "Q23664247", "Q24005370", "Q24005371", "Q24005372", "Q25189401", "Q25189406", "Q25189413", "Q3536989"]}}, {"date": "2017-02-09", "url": "http://rare.us/rare-politics/issues/foreign-policy/rand-paul-it-would-be-a-really-rotten-no-good-bad-idea-to-have-ground-troops-in-syria/", "content": "In 2015, I asked, \"Why is Rand Paul the only Republican who knows our foreign policy is crazy?\" Among the crazy characteristics is the U.S.' s constant habit of intervening militarily in other nation' s civil wars. Watch the video It was precisely this sort of suggestion during a Senate Foreign Relations Committee meeting on Tuesday featuring former Defense Department and CIA Chief of Staff Jeremy Bash and national security adviser and U.S. Ambassador James Jeffrey, that seemed to incense committee member Sen. Paul. RELATED: Why is Rand Paul the only Republican who knows our foreign policy is crazy? The senator vehemently rejected sending American troops to Syria, \"I' d like to go on record as saying that it would be a really rotten, no good, bad idea to have ground troops in Syria, and very naive to think you' re going to put 1000 troops in there, and everybody' s going to welcome us .\" Paul continued, \"It' s very presumptuous to think that we' re going to decide who takes Raqqa and who occupies Raqqa. Don' t you think the people there would be aghast, to think we' re 3000 miles away, to decide who' s going to take over Raqqa and who' s going to occupy it?\" \"We can win any battle,\" Paul said. \"But when we big we usually go big, and sort of, there have been many people--the Powell Doctrine--go big or don' t go. 1000 soldiers?\" Paul inquired, appearing to note that this number would not be enough should the U.S. decide to escalate our military efforts in Syria. A year ago during the campaign, <mark>Donald Trump</mark> said he would consider sending up to 30,000 U.S. troops to Syria. Yet <mark>Trump</mark> also has stressed that the U.S. should get out of the business of nation building. Those two foreign policy views don' t typically jibe. Paul addressed to the committee how sending troops abroad inevitably leads to nation building. \"And then the other problem [...] The mantra is always\" Stay, stay, we must stay forever,' and if we leave, that' s our fault for leaving, \"Paul said .\" There' s no exit from a situation like this \"the senator said .\" Let' s say we were to go in and defeat those who were there, to defeat ISIS--do you think that' s the end? No, when a big force comes, they' re going to shrink away, and they will fight' til the end of time. \"\"And they will fight against an American target if Americans are the target,\" Paul said. Watching the 2016 presidential primaries where most Republican candidates seemed eager to commit American troops abroad, with the exception of Paul and in some ways <mark>Trump</mark>, I wrote, \"Our foreign policy is run by crazy people. I don't mean legitimately insane, but politicians who insist America must do things around the world that have been empirically proven not to work--for decades--at great cost to our country's finances, military, prestige and actual security .\" It remains true: We go out of our way to make other nation' s wars our own, usually to our own detriment. Paul said Tuesday, \"This is a war within Islam, and I think we should be supportive and try to amplify those who are trying to defeat this aberration .\" \"But let' s don' t make it our war,\" he said. The Republican senator from Kentucky then ran down all of the other forces that could be part of anti-ISIS efforts in the region instead of the U.S. always having to take the lead. \"Look, there are 200,000 Peshmerga. There are 200,000 Iraq soldiers. There' s a hundred and some odd thousand in the Syrian army. There are 600,000 in the Turks',\" Paul said, \"and there are 15,000 ISIS, and we have to go over there to defeat them?\" RELATED: No, <mark>Donald Trump</mark>, torture doesn't work, and we're not going down that road again <mark>Donald Trump</mark> won the election saying sane things about the futility of the Iraq war and the folly of nation building, combined with some less sane and belligerent things. But at a Senate Foreign Relations Committee hearing this week, we were reminded that among the nation' s entrenched foreign policy elite, nothing has really changed. They still possess the same interventionist mentality. The only person on that committee who seemed to outraged over the idea of sending 1000 Americans men and women to Syria--particularly based on everything we have learned about ill-advised interventions from the Iraq war forward--was Sen. Paul. \"I think we ought to think this thing through and think that this won' t be the end, this will be the beginning,\" Paul said. \"And I guarantee you the voices are loud and strong. Everybody says we should have stayed in Iraq. Everybody is still saying we should stay in Afghanistan .\" \"Are we going to stay everywhere? Forever?\" Sen. Paul asked. Disclosure: I co-authored Senator Rand Paul's 2011 book \"The Tea Party Goes to Washington .\" ", "articleID": "2017022022_00369412_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-02-24", "url": "http://www.investors.com/news/technology/oled-tech-firm-universal-display-shines-bright-after-q4-beat/", "content": "Technology OLED Tech Firm Universal Display Hits Record High After Q4 Beat PATRICK SEITZ 10:23 AM ET Reprints Loading the player...Universal Display (OLED) shares jumped to a record high on Friday, a day after the provider of technology and materials for OLED displays and lighting, crushed Wall Street's Q4 targets. The Ewing, N.J.-based company late Thursday said it earned 55 cents a share, up 41% year over year, on sales of $74.6 million, up 20%, in the December quarter. Analysts polled by Thomson Reuters expected Universal Display to earn 42 cents a share on sales of $68.6 million. Universal Display, aka UDC, also announced that it will begin paying a quarterly cash dividend next month, starting at 3 cents a share. UDC stock was up over 19%, near 80.80, in morning trading on the stock market today. It topped its previous all-time high of 74.39, reached Aug. 1. IBD'S TAKE: Universal Display stock has an IBD Composite Rating of 75, meaning it has outperformed 75% of stocks in key metrics over the past 12 months. But it ranks No. 8 out of 40 stocks in IBD's Electronics-Miscellaneous Products industry group. To see which companies lead the group, visit the IBD Stock Checkup. Susquehanna Financial Group analyst <mark>Mehdi Hosseini</mark> reiterated his positive rating on UDC stock and raised his price target to 105 from 100. \"UDC should be viewed as a core holding in a small-cap portfolio, benefiting from multiyear, secular trends in display technology,\" <mark>Hosseini</mark> said in a report. Meanwhile, Needham analyst James Ricchiuti maintained his hold rating on UDC stock, citing a rich valuation. \"We would not chase the stock following what is likely to be a strong open and would look to become more constructive on a pullback,\" he said in a report. Oppenheimer analyst Andrew Uerkwitz concurred, saying UDC stock looks fully valued. He maintained his perform rating on the stock Friday. Canaccord Genuity analyst John Quealy also is cautious on UDC. He reiterated his hold rating, but raised his price target to 65 from 49. \"While we acknowledge the compelling market potential of OLED technology (TVs, mobile phones, VR headsets, etc.) in the near to medium term, monetization pathways for the company need to become further de-risked, in our view, to support a more attractive risk/reward,\" Quealy said in a report. Smartphone makers are beginning to switch to OLED, or organic light-emitting diode, displays from LCD, or liquid-crystal displays, because OLED provides better color reproduction and contrast and uses less power. The displays also are thinner and flexible, allowing for new hardware designs. Apple (AAPL) is rumored to be using OLED displays produced by Samsung in its upcoming iPhone 8 smartphone, which is expected to be released in September. As OLED manufacturing matures, analysts expect TVs and PC displays to shift to OLED from LCD screens as well. Other companies benefiting from the OLED adoption trend include display equipment vendors such as Applied Materials (AMAT) and Coherent (COHR), analysts say. RELATED: Stocks To Buy And Watch: Top IPOs, Big And Small Caps, Growth Stocks PATRICK SEITZ | Facebook | @ IBD_PSeitz Share this: Related news The Nasdaq and other major indexes were keeping their losses small Friday afternoon. (Erik Pendzich/REX/Shutterstock / Newscom) Stock Indexes Down, But Apple, Tesla, Nvidia Stage Bullish Reversals 1:32 PM ET Some leaders were getting hit again Friday, but others were erasing early losses. 1:32 PM ET Some leaders were getting hit again Friday, but others were...Warren Buffett Likely To Discuss Apple, Trump, Airlines In Saturday's Shareholder Letter Dow Threatens To End Win Streak As Apple, Goldman Weigh; Is Nvidia Reversing? OLED Tech Leader Universal Display Beats Q4 Goals, Will Pay Dividend HP Breaks Out On Q1 Beat; Fitbit Up On In-Line Q4 Apple Poised To Unveil New iPads Before Headquarters Opens This Spring 7 Stocks With Accelerating, Triple-Digit Earnings Growth Stocks Rally Broadly; Will These 5 Large Caps Turn Into Big Leaders? Apple, Broadcom Hit Highs As PTs Raised; Freeport, Marriott Downgraded Today's Spotlight MarketSmith Top Stocks 2016 Identify winners in 2017. Use our Top Stock 2016 to see last year's leaders and their winning traits. New York Traders Expo Join IBD for free investing workshops and get product training at our booth (2/26--2/28). Get Leaderboard Find winning stocks faster with Leaderboard. Get our proprietary stock analysis today. More News Google Plays Catch-Up In The Cloud With Amazon And Microsoft Week In Review: Dow Runs On Wal-Mart; Tesla Is On \"Edge'; Facebook? Oh, Snap Go Beyond Buy and Hold: See the advantages of Skoufis Capital Active Strategy over Growth ETF's and Mutual Funds Promoted Content By Skoufis Capital Management Special Report FANG Stocks News & Quotes: Facebook, Amazon, Netflix, Google Get the latest news, stock quotes and analysis of FANG stocks Facebook, Amazon, Netflix and Google-parent Alphabet. TRADING CENTER", "articleID": "2017022418_01171951_W", "names": {"Mehdi Hosseini": ["Q21621496", "Q452959"]}}, {"date": "2017-02-25", "url": "http://www.nytimes.com/2017/02/25/technology/farhads-and-brians-week-in-tech-ubers-very-bad-month.html?partner=rss&emc=rss", "content": "Technology Farhad's and Brian's Week in Tech: Uber's Very Bad Month Bits By FARHAD MANJOO and BRIAN X. CHEN FEB. 25, 2017 Continue reading the main story Share This Page Photo Travis Kalanick, the chief executive of Uber, has pledged an investigation into allegations of sexism at the company. Credit Marlene Awaad/Bloomberg Each Saturday, Farhad Manjoo and Mike Isaac, technology reporters at The New York Times, review the week's news, offering analysis and maybe a joke or two about the most important developments in the tech industry. This week, Brian X. Chen, the Times's personal technology writer, filled in for Mike. Farhad: Hello, Brian! You're stepping in for Mike this week because he has again locked himself out of the office. You really can't count on that guy. So thank you for filling in. Anyway, I wanted to start with some real talk: Science news is very cool right now. You must have seen how astronomers discovered seven Earth-size planets orbiting a star just 40 light years away. Meanwhile, physicists are puzzling over how quickly the universe is expanding; it seems to be going faster than physics predicts it should, which could be a clue that our understanding of the universe is missing something. I don't have any jokes here. I just think this stuff is awesome. Brian: Forty light years is pretty far away. I was hoping I could find another planet to live on for the next four to eight years. I guess I'll have to settle for Vancouver. Farhad: Eh, Canada. O.K., things picked up in the tech industry this week. For the first time in a long time, there was some news that didn't have anything to do with <mark>Donald Trump</mark>. Instead, it pretty much all had to do with Uber. Continue reading the main story But we'll get to that in a bit. Here are some other things that happened. First, Apple announced that its huge new headquarters building in Cupertino, Calif., would be completed in April. This is the spaceship building that Steve Jobs unveiled to the Cupertino City Council in the summer of 2011, in his last public appearance before he died that fall. Apple has named the new campus Apple Park, and it has named the campus auditorium after Jobs. The building will house 12,000 employees. I bet more than a few of them will have roller-skate races around the huge circular hallways. Steve Jobs Presents to the Cupertino City Council (6/7/11) Video by Cupertino City Channel Brian: Apple's campus renovations are long overdue. Have you tried to find parking there recently? It's a nightmare--the place is flooded with Teslas and Mustangs. Anyway, Apple's chief executive, <mark>Tim Cook</mark>, has been talking about this new campus for years now. The way it's shaped--kind of like a U.F.O.--is supposed to foster stronger collaboration between different departments across Apple, whereas historically the divisions (hardware, software, special projects, Apple Minivan or whatever the heck they're doing, iOS, Mac, etc.) have been very siloed. Let's see if that happens. (Maybe one day we'll be able to plug the iPhone charging cable into the ports on the new MacBook Pros--what a concept .) Farhad: If it takes a $5 billion building to eliminate dongles, I'm all for it. So a shocking thing happened this week: A subsidiary of Facebook copied a feature from Snapchat. I'm sorry, I should be above easy sarcasm as a joke. But this week the president used \"NOT!\" in a tweet, and it took me back to the fourth grade. Remember when people used to say, \"Psych?\" Brian: Tcha. I mean, totes. Farhad: Anyway, WhatsApp, which Facebook purchased for more than $19 billion a few years ago, r olled out a number of features this week that borrow heavily from Snapchat. This follows another Facebook-owned app, Instagram, rolling out Stories, a way to make collections of short videos that Snapchat also pioneered. I have no problem with this; as I've argued repeatedly, I think it's generally good for consumers and innovation online when companies freely copy each other's best software ideas. Still, it's got to be just a little bit embarrassing for Facebook, which has been at the forefront of the social game for so long, to have completely run out of original ideas. As a columnist, I know that feeling well. Brian: Tell me about it. I just did my third advice column on phone plans in the last two years. Anyway, I'm used to social media giants cloning each other's features, but I don't think WhatsApp should have gone in this direction. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up Receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. See Sample Manage Email Preferences Not you? Privacy Policy People loved WhatsApp partly because it is a zero-nonsense, intuitive chatting app. So now WhatsApp's new feature, called Status, basically lets people share images, GIFs or videos before they self-destruct in 24 hours. But do you know anyone who uses WhatsApp and desires features like these? I mostly see people using WhatsApp to keep in touch with others overseas. I'm not sure this will stick with consumers or help Facebook lure people away from Snapchat. All it does is add a layer of complexity to what was otherwise a perfectly solid messaging app that everyone knew how to use. Farhad: WhatsApp is great because it just works without any fuss. This all feels like a big fuss. Now let's talk Uber. What a cluster. So, last weekend, a former Uber engineer named Susan Fowler published a lengthy blog post in which she went into lots of detail about sexual harassment and discrimination at Uber. She described a culture in which women were treated terribly and the human resources department did nothing. Then Mike, our Uber beat writer, published a really good piece detailing a whole bunch of other explosive stories about the company's unrestrained culture. Then on Thursday, another shoe dropped: Waymo, a unit of Google's parent company, Alphabet, filed suit against Uber. Waymo said that a former member of Google's self-driving car project stole thousands of technical documents about the project before starting Otto, his own company--which Uber bought last year. And all this follows another controversy at Uber--C.E.O. Travis Kalanick's one-time plan to join a presidential advisory council, which led to an outcry from employees and customers. Uber has pledged an investigation on the sexism charges, but it's not at all clear that will be enough to quell the mounting anger against the company both internally and externally. So, where do you think this goes next? Brian: As these things often tend to go, Uber is going to be in damage-control mode for the coming months. It will probably release the results of the investigation and announce a mandatory sexual harassment training program for its employees. Mike's reporting on this fiasco was truly stunning, and Uber's response--\"We are totally committed to healing wounds of the past and building a better workplace culture for everyone\" --is remarkable in that there is no denial or justification whatsoever of the aggressive, chauvinistic work culture. Their next step, PR-wise, is to show the steps they are taking to \"heal .\" Farhad: I think that was the plan, but the script is already falling apart. Two of Uber's early investors, Mitch Kapor and Freada Kapor Klein, published an open letter to Kalanick expressing their disappointment in how Uber has handled the crisis so far. The company has tasked <mark>Eric Holder</mark>, the former attorney general under President Obama, to lead an investigation into its culture. But the investors--who have long fought for better representation of women in tech companies--say that such an investigation will not be truly independent. \"To us, this decision is yet another example of Uber's continued unwillingness to be open, transparent and direct,\" they said. This is something new in tech--you don't ordinarily see investors calling out their companies. So it seems like Uber is going to have to do something much bigger and less superficial here.... I think. Brian: What an epic disaster. I guess Travis will have to make his employees do more than a few trust falls before they recover from this one. Farhad: This is one of those sagas that might never end. Well, thanks for being Mike this week, Brian. Brian: No problem. Did I sound childish enough? Smell ya later. Continue reading the main story We're interested in your feedback on this page. Tell us what you think.", "articleID": "2017022709_00944472_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Eric Holder": ["Q312644", "Q3591180"], "Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}, {"date": "2017-03-02", "url": "http://stuff.co.nz/timaru-herald/sport/89916581/south-canterbury-rugby-union-returns-to-the-black", "content": "South Canterbury Rugby Union returns to the black STU PIDDINGTON Last updated 16:17, March 2 2017 John Bisset Alpine Energy Stadium's future is up for discussion. The South Canterbury Rugby Union is back in black, announcing a small profit at their 128th annual general meeting. The union made a surplus of $27,365, thanks to receiving a grant of $36,150 for their new scoreboard, otherwise an operational loss of $8786 would have occurred. While there was an increase in expenditure by $59,415 to $871,750, due to the appointment of a full time chief executive and increased maintenance costs at Alpine Energy Stadium, revenue also increased by $58,665. Tetsuro Mitomo/Fairfax NZ South Canterbury Rugby Union chief executive Craig Calder is keen to see Alpine Energy Stadium used more. Wages and salaries also increased to $278,016 over the 3.8 full time staff employed by the union plus some casual staff, who had a only a small impact on the figure. Outfitting eight representative teams from under 48kg to the Heartland side cost $59,665 for off field gear including hoodies, tops, bags and caps and alike. . Comparisons against the previous financial year were not available in detail as the union had changed its accounting system. The meeting also voted to change the financial year to finish on December 31 to fall in line line with New Zealand Rugby and most of the other unions. Chief executive Craig Calder said it was important to note that half of the union's came from New Zealand Rugby by way of grants, with $462,000 expected next year. \"We have key performances indicators to meet to protect that income .\" Declining player numbers in teenage boys rugby remained a concern, which was offset in part with the growth in the women's game, he said. Ad Feedback Calder said it was not easy to arrest the decline with 104 players gone in the 15 to 20-year-olds last year. Off the field the union was undertaking a feasibility study around the future of Alpine Energy Stadium, he said. It would address the redevelopment of the No. 1 and-or No. 2 playing surface. Also included was whether the damaged east stand should be repaired or redeveloped, as well as identifying the long term structural integrity and future of the main stand, including the lounge. The development of women's changing facilities, including showers, as well as access, driveway and parking to meet compliance issues were also part of the study. Calder said the union had also committed to several capital projects including new stairs to the broadcasting tower and barriers on top, renewing all the seating on the main stand as well as an upgrade of the changing rooms and offices, including new office equipment. No voting was required to fill any of the office bearers as there was only one nominee. Ranfurly Shield winning winger Murray Roberts was elected president, with his 1974 team-mate Neville \"Ru' Twaddell confirmed as vice president. Grant Norton was re-elected on to the board, with lawyer Craig O'Connor stepping down after nine years service. No further independent was needed to be appointed in O'Connor's case as the board had carried an extra person. Pat Scott was elected patron again while Colin Clemens retained his role as the liaison to the New Zealand Rugby Foundation. Long serving senior representative manager Cedric Coll was elected a life member. SCRU board: Ray Teahen (chairman), Brent Isbister, Steve McCoy, Grant Norton, <mark>Michelle Martin</mark>, Vaughan O'Shaughnessy, Jeremy Sutherland and Murray Roberts. - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Sport story: South Canterbury under perform at Hawke Cup level but show plenty of promise Timaru Herald Homepage", "articleID": "2017030203_00391133_W", "names": {"Michelle Martin": ["Q2145289", "Q547953"]}}, {"date": "2017-03-04", "url": "http://www.aol.co.uk/living/2017/03/04/williamson-demands-improvements-from-misfiring-black-caps/", "content": "Williamson demands improvements from misfiring Black Caps By Omnisport 4 Mar 2017, 9:45 - New Zealand must improve with the bat if they are to be competitive in one-day cricket, said Kane Williamson after their six-wicket defeat to South Africa on Saturday. The Proteas wrapped up the ODI series 3-2 in Auckland with a comfortable victory after winning the toss and bowling the hosts out for 149 - Kagiso Rabada the pick of the bowlers with 3-25. Only four batsmen got themselves into double figures for the Black Caps, and key men Martin Guptill (4), <mark>Ross Taylor</mark> (8) and Williamson (9) all failed to deliver. A 150-run target was never enough to put South Africa under pressure. Even the loss of early wickets could not hinder their progress, as Faf du Plessis and <mark>David Miller</mark> eased them home. Williamson acknowledged New Zealand's batsmen had not fired, and that it is something that they must work on ahead of the Champions Trophy in June. \"We were out played today. They were very good with the ball and gave us nothing .\" - Kane Williamson #NZvSA ^ WN pic.twitter.com/XC9PuEmjSe", "articleID": "2017030409_00878426_W", "names": {"David Miller": ["Q1175688", "Q12899557", "Q15455696", "Q16185473", "Q19875639", "Q20656547", "Q28870727", "Q3018511", "Q30607124", "Q404333", "Q404779", "Q5237563", "Q5237568", "Q5237569", "Q5237573", "Q5237574", "Q5237576", "Q55196713", "Q56458216", "Q57729525", "Q57832355", "Q6828449", "Q92986"]}}]