[{"date": "2017-03-04", "url": "http://www.aol.co.uk/living/2017/03/04/williamson-demands-improvements-from-misfiring-black-caps/", "content": "Williamson demands improvements from misfiring Black Caps By Omnisport 4 Mar 2017, 9:45 - New Zealand must improve with the bat if they are to be competitive in one-day cricket, said Kane Williamson after their six-wicket defeat to South Africa on Saturday. The Proteas wrapped up the ODI series 3-2 in Auckland with a comfortable victory after winning the toss and bowling the hosts out for 149 - Kagiso Rabada the pick of the bowlers with 3-25. Only four batsmen got themselves into double figures for the Black Caps, and key men Martin Guptill (4), <mark>Ross Taylor</mark> (8) and Williamson (9) all failed to deliver. A 150-run target was never enough to put South Africa under pressure. Even the loss of early wickets could not hinder their progress, as Faf du Plessis and <mark>David Miller</mark> eased them home. Williamson acknowledged New Zealand's batsmen had not fired, and that it is something that they must work on ahead of the Champions Trophy in June. \"We were out played today. They were very good with the ball and gave us nothing .\" - Kane Williamson #NZvSA ^ WN pic.twitter.com/XC9PuEmjSe", "articleID": "2017030409_00878426_W", "names": {"Ross Taylor": ["Q19325418", "Q26820844", "Q7369657", "Q7369663"]}}, {"date": "2017-03-04", "url": "http://hawaiitribune-herald.com/news/world/china-says-defense-budget-rise-about-7-percent-2017", "content": "China says defense budget to rise by about 7 percent in 2017 Published March 4, 2017 - 12:05 am By GERRY SHIH and CHRISTOPHER BODEEN Associated Press BEIJING (AP)--China will raise its defense budget by about 7 percent this year, a government spokeswoman said Saturday, continuing a trend of lowered growth amid a slowing economy. Total defense spending would account for about 1.3 percent of projected gross domestic project in 2017, said <mark>Fu Ying</mark>, spokeswoman for the legislature. She was speaking at a news conference on the eve of the opening of the body's annual session. The precise figure will be provided by Premier Li Keqiang in his address to the National People's Congress on Sunday morning. <mark>Fu</mark> reiterated China's contention that its military was purely for defense and constituted a force for stability in Asia. \"We advocate dialogue for peaceful resolutions, while at the same time, we need to possess the ability to defend our sovereignty and interests,\" <mark>Fu</mark> said. \"The strengthening of Chinese capabilities benefits the preservation of peace and security in this region, and not the opposite .\" Depending on the final figure, this year's budget could mark the third consecutive year of declines in defense spending growth rates. The budget grew by 7.6 percent last year and 10.1 percent in 2015. The increase of about 67 billion yuan ($9.7 billion) would push the total defense budget past the 1 trillion yuan ($145 billion) mark for the first time. The percentage increases do not track in U.S. dollar figures because of variations in the exchange rate. China's defense budget has for years been the world's second largest, although still lagging far behind the U.S. President Donald Trump has asked for a 10 percent increase in U.S. defense spending this year, adding $54 million to the budget that topped $600 billion last year. China points out that, as a developing country with a population of 1.37 billion, its defense spending per capita is a fraction of those of other nations. <mark>Fu</mark> also said the percentage of GDP China spends on defense is below the 2 percent the U.S. calls on NATO allies to spend. \"The gap in capabilities with the U.S. is enormous, but China's military development and construction will continue in keeping with our need to defend our national sovereignty and security,\" <mark>Fu</mark> said. While China insists its military is purely for domestic purposes, it has been spending heavily on technologies allowing it to project power far from shore, including aircraft carriers, long-range bombers and its first overseas military base located in the East Africa nation of Djibouti. Beijing has also come under criticism from the U.S. and others for militarizing man-made islands in the South China Sea, which China claims virtually in its entirety. <mark>Fu</mark> turned those accusations back on the U.S., saying the strategically vital waterway through which about $5 trillion in trade passes each year was basically calm. \"As to how to the situation develops in future, that depends on U.S. intentions. American actions in the South China Sea have a definite significance in terms of which way the winds blow,\" she said. Rules for posting comments Comments posted below are from readers. In no way do they represent the view of Oahu Publishing Inc. or this newspaper. This is a public forum. Comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Oahu Publishing Inc. is not liable for messages from third parties. IP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. Do not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity.", "articleID": "2017030410_00905609_W", "names": {"Fu Ying": ["Q1006996", "Q3090487", "Q45377513", "Q45444262", "Q45537139", "Q45541786"]}}, {"date": "2017-03-07", "url": "http://www.mojo4music.com/25239/zombies-odessey-and-oracle-returns/", "content": "THE LATEST VOLUME of MOJO ’60s, MOJO's decade-specific sister magazine, features a brand new catch-up with ’60s cult heroes The Zombies. MOJO ’60s Volume 9, featuring The Zombies, Keith Moon and more. The venerable group, still led by original undead Colin Blunstone and Rod Argent, are set to tour the US later this month, and are also due to play their classic Odessey And Oracle album in its entirety at the prestigious London Palladium on September 29. \"I'm mystified that people are still discovering the record,\" says Blunstone, speaking to Lois Wilson in MOJO ’60s Volume 9. \"I can only explain the renewed interest through word of mouth. Musicians like <mark>Paul Weller</mark> and Dave Grohl often say how much they like the album and that has led to its reassessment and helped introduce it to new generations .\" Odessey And Oracle occupies an exceptional place in the rock canon. Widely proclaimed a work of genius comparable with The Beach Boys' Pet Sounds and The Beatles' Sgt. Pepper, it is also, simultaneously somehow, a well-kept secret. In many respects, this dichotomy is symptomatic of the position in which the band found themselves back in early 1968 just prior to the album's release. Formed in St Albans, Hertfordshire, in the early ’60s, The Zombies arrived in the disguise of a typical beat group of the time. Their debut single, She's Not There (released in August 1964), provided them with a Top 20 UK hit and peaked at Number 2 in the US, the track characterised by Colin Blunstone's winsome vocal and composer Rod Argent's electric piano. In terms of commercial pop success, they never bettered it. However, by 1967 The Zombies' sound had grown more sophisticated and they'd signed to CBS, beginning work on a more ambitious second album. Their budget was modest--a mere £ 1000, with sessions beginning in June and using downtime at Abbey Road and Olympic Studios. However, by the time Odessey And Oracle emerged in April' 68, the five-piece of Blunstone, Argent, <mark>Paul Atkinson</mark> (guitar), <mark>Chris White</mark> (bass) and Hugh Grundy (drums) had effectively split. The failure of two singles prior to the album's release--Friends Of Mine (October' 67) and Care Of Cell 44 (released November' 67)--contributed to their disillusionment with the industry, exacerbating internal tensions over the band's musical direction. Since then Odessey's reputation has grown amongst connoisseurs and, to a degree, mainstream audiences. The album was afforded further exposure when, from the late ’90s onwards, key track Time Of The Season was used in a string of TV commercials to sell goods as diverse as women's hygiene products, soft drinks and cider. In addition to their appearance in MOJO ’60s, the group and their masterpiece album are documented in a brand new book entitled The Odessey: The Zombies In Words And Images which is published by Reel Art Press/BMG Books. The band's touring plans can be found at their website www.thezombiesmusic.com. MOJO ’60s Volume 9, featuring The Zombies, Keith Moon, The Doors, Dusty Springfield, The Temptations, The Bonzo Dog Doo-Dah Band, Zappa and Beefheart posters, and more, is in UK shops now. Or you can have a copy sent straight to your home.", "articleID": "2017030711_00729105_W", "names": {"Chris White": ["Q1077846", "Q19560238", "Q264420", "Q2964892", "Q2964894", "Q42434048", "Q5108458", "Q5108459", "Q5108461", "Q5108462", "Q5108463", "Q5108464", "Q56422264", "Q727678"], "Paul Atkinson": ["Q38545438", "Q57687338", "Q7149127", "Q7149129"], "Paul Weller": ["Q371986", "Q7154286", "Q7154289"]}}, {"date": "2017-03-07", "url": "http://www.news-gazette.com/news/local/2017-03-07/top-morning-march-7-2017.html", "content": "Top of the Morning, March 7, 2017 Tue, 03/07/2017 - 6:00 am | Jim Rossow Photo by: The News-Gazette Champaign County Emergency Management Agency Director <mark>John Dwyer</mark> - photographed in the NG studio on 10/27/14 The annual statewide tornado drill is scheduled to take place at 10 a.m. today (barring--and this is odd to write--actual bad weather). That means 84 sirens in Champaign County wailing for a few minutes and your TV screen going from \"The Price Is Right\" to a blackened test message from the National Weather Service. \"It's better we find out now that a siren isn't working than during an actual tornado warning,\" said <mark>John Dwyer</mark>, director of the Champaign County Emergency Management Agency. The drill--conducted the first Tuesday of March for 25 years--will be delayed in the case of inclement weather so as not to confuse anyone, <mark>Dwyer</mark> said. Despite a publicity push leading up to this morning's test, <mark>Dwyer</mark> said he \"will still get calls from people asking\" What's going on?' \"Online audience: What was trending last week at news-gazette. com, which in a seven-day period ending Sunday saw 1,374,063 pageviews: TOP STORIES", "articleID": "2017030715_00267312_W", "names": {"John Dwyer": ["Q28059681", "Q57408581", "Q6230578", "Q6230581", "Q6230583", "Q6230584"]}}, {"date": "2017-03-07", "url": "http://totallyspies.wikia.com/wiki/Stark_Raving_Mad?diff=69767&oldid=65282", "content": "Changes: Stark Raving Mad Edit Back to page Revision as of 10:47, March 29, 2016 (view source) Ellis99 (wall | contribs) m ← Older edit Latest revision as of 17:57, March 7, 2017 (view source) Steven + Amethyst = SmokyQuartz (wall | contribs) (→ Trivia) (3 intermediate revisions by one user not shown) Line 68: Line 68: ** \"[[Malled]]\" ** \"[[Malled]]\" ** \"Stark Raving Mad\" ** \"Stark Raving Mad\" − * Goof: When Sebastian stretches out his arms and shouts \"Hyper rave is the wave of the future!\" , his left robotic arm is normal again, then for the rest of episode, it's robotic. * Pablo Picardo is a reference to [http: //en.wikipedia.org/wiki/Pablo_Picasso Pablo Picasso]. * Pablo Picardo is a reference to [http: //en.wikipedia.org/wiki/Pablo_Picasso Pablo Picasso]. * Saga's henchmen refuse to stop watching the association football (soccer) on television. After being arrested, a WOOHP agent holds the television in front of them while they are taken to the car. * Saga's henchmen refuse to stop watching the association football (soccer) on television. After being arrested, a WOOHP agent holds the television in front of them while they are taken to the car. * \"[http: //en.wikipedia.org/wiki/Stark_Raving_Mad_ (2002_film) Stark Raving Mad]\" is also the title of a famous movie in which a man throws a rave party to cover up the noise from his robbery of a bank next door. * \"[http: //en.wikipedia.org/wiki/Stark_Raving_Mad_ (2002_film) Stark Raving Mad]\" is also the title of a famous movie in which a man throws a rave party to cover up the noise from his robbery of a bank next door. − * Between the scenes where the girls are running from Sebastian's minions and then getting dropped off after his speech, the music is playing and the girls don't get affected by it until the next rave. + * Goof: Between the scenes where the girls are running from Sebastian's minions and then getting dropped off after his speech, the music is playing and the girls don't get affected by it until the next rave. − * When Clover said, \"When will it be my turn to pick where we are going?\" , she and Sam had sweat drops when they should have been on Alex and Sam instead, as Clover was the one who said that quote. + * Goof: When Clover said, \"When will it be my turn to pick where we are going?\" , she and Sam had sweat drops when they should have been on Alex and Sam instead, as Clover was the one who said that quote. − * While the spies are riding on their [[Anti-gravity cycle]] s, Alex's cycle turns pink for one scene before turning yellow again. + * Goof: While the spies are riding on their [[Anti-gravity cycle]] s, Alex's cycle turns pink for one scene before turning yellow again. + * Goof: When Sebastian stretches out his arms and shouts \"Hyper rave is the wave of the future!\" , his left robotic arm is normal again, then for the rest of the episode, it's robotic. + * Goof: When <mark>Jerry</mark> asks for the gym door to be unlocked and gym equipment breaks one of the doors, the window on the other door briefly turns red but is is blue again a scene later. + * Goof: When Sebastian's helicopter first flies through the tunnel the petals on the girls backpacks are colored pick instead of yellow. + * Goof: When Clover and Sam get splashed by water at the end of the episode their eyes overlap their hair. = = Gallery = = = = Gallery = = Latest revision as of 17:57, March 7, 2017 Stark Raving Mad Air Date April 20, 2004 Season 02 Episode Number 14 Proceeded By W.O.W. Followed By S.P.I. Stark Raving Mad is episode 14 of Season 2. Contents [show] Characters Edit Clover Samantha Alexandra <mark>Jerry Lewis</mark> Mandy <mark>David Arnold</mark> Jackson Sebastian Saga Synopsis Edit Sebastian escapes from prison and he plans to use a special remix of a rave music track to hypnotize people into destroying the spies' favorite places. When the girls discover that Sebastian is the villain behind this, he hypnotizes them to help in destroying <mark>Beverly Hills</mark> High. Luckily, <mark>Jerry</mark> rescues the girls and they stop Sebastian by sabotaging his music transmitter, which was hidden beneath the sign at the entrance of <mark>Beverly Hills</mark> High. In a B-story, Alexandra believes that she is doomed to 7 years of bad luck after accidentally breaking her Compowder (which had a mirror in it that also broke). Gadgets Edit Anti-gravity cycle Catsuit Compowder Expandable Cable Bungee Belt Heat Sensor 6000 Infrared Motion Detector Sunglasses Kick scooter Sensible Soundproof Earplug Ultra Sensitive Hearing Microphone Trivia Edit Places attacked by Saga <mark>Beverly Hills</mark> High <mark>Beverly Hills</mark> Mall Kacy's (a parody of Macy's) Rings and Things Modern Art Musuem Pumps, Platforms, and Pinkies Roller Disco (roller rink) Scrunchie City Smoothie King WOOHP headquarters (accidently) The helicopter used is the Mil Mi-24. \"A Thing For Musicians\" --Sebastian Saga \"Malled\" --Simon Tucker \"Man or Machine\" --Eisenstein \"Model Citizens\" --Tuesday Tate \"Stark Raving Mad\" --Sebastian Saga The WOOHP budget: \"Evil Hair Salon\" --buying 2 wigs at $1250 per wig ($2500 total) is considered a major field equipment expense \"Evil Ice Cream Man Much?\" --damaging a vehicle is met with disdain \"Shrinking\" --a prototype reconnaissance/surveillance satellite costs $1,000,000; the full scale version costs $1,000,000,000 \"Stark Raving Mad\" --a Compowder is expensive Sebastian Saga's rave music is used. \"Alex Gets Schooled\" \"Evil Graduation\" \"Evil Ice Cream Man Much?\" \"Head Shrinker Much?\" \"Stark Raving Mad\" \"The O.P.\" The <mark>Beverly Hills</mark> Mall suffers severe damage. \"Head Shrinker Much?\" \"Malled\" \"Stark Raving Mad\" Pablo Picardo is a reference to Pablo Picasso. Saga's henchmen refuse to stop watching the association football (soccer) on television. After being arrested, a WOOHP agent holds the television in front of them while they are taken to the car. \"Stark Raving Mad\" is also the title of a famous movie in which a man throws a rave party to cover up the noise from his robbery of a bank next door. Goof: Between the scenes where the girls are running from Sebastian's minions and then getting dropped off after his speech, the music is playing and the girls don't get affected by it until the next rave. Goof: When Clover said, \"When will it be my turn to pick where we are going?\" , she and Sam had sweat drops when they should have been on Alex and Sam instead, as Clover was the one who said that quote. Goof: While the spies are riding on their Anti-gravity cycles, Alex's cycle turns pink for one scene before turning yellow again. Goof: When Sebastian stretches out his arms and shouts \"Hyper rave is the wave of the future!\" , his left robotic arm is normal again, then for the rest of the episode, it's robotic. Goof: When <mark>Jerry</mark> asks for the gym door to be unlocked and gym equipment breaks one of the doors, the window on the other door briefly turns red but is is blue again a scene later. Goof: When Sebastian's helicopter first flies through the tunnel the petals on the girls backpacks are colored pick instead of yellow. Goof: When Clover and Sam get splashed by water at the end of the episode their eyes overlap their hair. Gallery Edit Animation with both hands Saga's henchmen Roller Disco Add a photo to this gallery Retrieved from \"http: //totallyspies.wikia.com/wiki/Stark_Raving_Mad? oldid=69767\" Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected. Categories: Season 2", "articleID": "2017030808_01196183_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "David Arnold": ["Q22003180", "Q27032111", "Q346285", "Q5230855", "Q5230858", "Q5230861"], "Jerry Lewis": ["Q294927", "Q472199", "Q6183975"]}}, {"date": "2017-03-08", "url": "http://www.computerworld.com.au/article/615569/senators-push-fcc-keep-its-net-neutrality-rules/?utm_medium=rss&utm_source=taxonomyfeed", "content": "The U.S. Federal Communications Commission should reverse course and keep the net neutrality rules it passed just two years ago, several Democratic senators said Wednesday. The FCC has not yet moved to repeal the regulations prohibiting broadband providers from selectively blocking or slowing web traffic, but the agency's new chairman, Republican <mark>Ajit Pai</mark>, has called the rules a \"mistake .\" Broadband customers, however, still need the protections of the net neutrality rules, several Democratic members of the Senate Commerce, Science, and Transportation Committee said during a hearing. Since President Donald Trump appointed him chairman in late January, <mark>Pai</mark> has moved to roll back transparency provisions in the net neutrality rules, suspended some ISP privacy regulations, and removed some companies from the Lifeline broadband subsidy program for low-income people, noted Senator <mark>Bill Nelson</mark>, a Florida Democrat. \"These are actions that directly impact the lives of millions of Americans and I sincerely hope they are not a sign of things to come,\" <mark>Nelson</mark> said to <mark>Pai</mark>. \"Because, at the end of the day, the FCC has a responsibility to put the public interest ahead of powerful special interests .\" Many lawmakers expect the FCC to uphold the laws they have passed and \"enforce the regulations properly adopted by the agency,\" <mark>Nelson</mark> added. Concerns that the net neutrality rules would hurt the broadband market seem to be unfounded, added Senator Cory Booker, a New Jersey Democrat. \"A lot of gloom and doom was predicted if this was to happen, but clearly, the sky's not fallen,\" he said. \"Businesses have continued to innovate in this space .\" <mark>Pai</mark> largely avoiding talking about his net neutrality plans during the hearing, and Republican senators avoided asking him about it. He laid out other priorities for the commission, including broadband deployment to underserved areas and consumer protection from robocalls. Fellow Republican Commissioner Michael O'Rielly also called on the FCC to end the \"scourge\" of pirate radio, saying unauthorized radio signals cause interference with other stations. But Mignon Clyburn, the commission's lone Democrat at the moment, called on the FCC to keep net neutrality rules and take other actions that put \"consumers first .\" \"Will there be a cop on the beat in a broadband world?\" she sad. \"If not the FCC, who will consumers turn to when their broadband provider throttles their favorite website? And what if there is a billing dispute? Poor service? Privacy concerns?\" The agency's rollback of its privacy rules last week, along with a Senate resolution to remove the rest of the net neutrality-related privacy rules are the \"opening salvo\" in a fight to remove the entire suite of net neutrality regulations, said Senator Ed Markey, a Massachusetts Democrat. Democratic FCC members argued for the privacy rules after they reclassified broadband as a regulated common carrier as part of the net neutrality rules. That reclassification took privacy enforcement authority for broadband away from the FCC's sister agency, the Federal Trade Commission. \"I fear [the privacy rollback] is just a preview of coming attractions,\" Markey said. \"Big broadband companies don't want to give consumer privacy protections the attention they deserve .\" 7 Habits of the Effective Network Manager More from NetScout Join the Computerworld newsletter! Join Error: Please check your email address. More about <mark>Bill</mark> FCC Federal Communications Commission Federal Trade Commission Transportation", "articleID": "2017030817_00592117_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}}]