[{"date": "2017-03-08", "url": "http://www.computerworld.com.au/article/615569/senators-push-fcc-keep-its-net-neutrality-rules/?utm_medium=rss&utm_source=taxonomyfeed", "content": "The U.S. Federal Communications Commission should reverse course and keep the net neutrality rules it passed just two years ago, several Democratic senators said Wednesday. The FCC has not yet moved to repeal the regulations prohibiting broadband providers from selectively blocking or slowing web traffic, but the agency's new chairman, Republican <mark>Ajit Pai</mark>, has called the rules a \"mistake .\" Broadband customers, however, still need the protections of the net neutrality rules, several Democratic members of the Senate Commerce, Science, and Transportation Committee said during a hearing. Since President Donald Trump appointed him chairman in late January, <mark>Pai</mark> has moved to roll back transparency provisions in the net neutrality rules, suspended some ISP privacy regulations, and removed some companies from the Lifeline broadband subsidy program for low-income people, noted Senator <mark>Bill Nelson</mark>, a Florida Democrat. \"These are actions that directly impact the lives of millions of Americans and I sincerely hope they are not a sign of things to come,\" <mark>Nelson</mark> said to <mark>Pai</mark>. \"Because, at the end of the day, the FCC has a responsibility to put the public interest ahead of powerful special interests .\" Many lawmakers expect the FCC to uphold the laws they have passed and \"enforce the regulations properly adopted by the agency,\" <mark>Nelson</mark> added. Concerns that the net neutrality rules would hurt the broadband market seem to be unfounded, added Senator Cory Booker, a New Jersey Democrat. \"A lot of gloom and doom was predicted if this was to happen, but clearly, the sky's not fallen,\" he said. \"Businesses have continued to innovate in this space .\" <mark>Pai</mark> largely avoiding talking about his net neutrality plans during the hearing, and Republican senators avoided asking him about it. He laid out other priorities for the commission, including broadband deployment to underserved areas and consumer protection from robocalls. Fellow Republican Commissioner Michael O'Rielly also called on the FCC to end the \"scourge\" of pirate radio, saying unauthorized radio signals cause interference with other stations. But Mignon Clyburn, the commission's lone Democrat at the moment, called on the FCC to keep net neutrality rules and take other actions that put \"consumers first .\" \"Will there be a cop on the beat in a broadband world?\" she sad. \"If not the FCC, who will consumers turn to when their broadband provider throttles their favorite website? And what if there is a billing dispute? Poor service? Privacy concerns?\" The agency's rollback of its privacy rules last week, along with a Senate resolution to remove the rest of the net neutrality-related privacy rules are the \"opening salvo\" in a fight to remove the entire suite of net neutrality regulations, said Senator Ed Markey, a Massachusetts Democrat. Democratic FCC members argued for the privacy rules after they reclassified broadband as a regulated common carrier as part of the net neutrality rules. That reclassification took privacy enforcement authority for broadband away from the FCC's sister agency, the Federal Trade Commission. \"I fear [the privacy rollback] is just a preview of coming attractions,\" Markey said. \"Big broadband companies don't want to give consumer privacy protections the attention they deserve .\" 7 Habits of the Effective Network Manager More from NetScout Join the Computerworld newsletter! Join Error: Please check your email address. More about <mark>Bill</mark> FCC Federal Communications Commission Federal Trade Commission Transportation", "articleID": "2017030817_00592117_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"]}}, {"date": "2017-03-08", "url": "http://uzomediangr.wordpress.com/2017/03/08/nigeria-to-cut-stake-in-oil-assets-under-buharis-growth-map-read-full-details/", "content": "proposes in a 2017-2020 economic blueprint to reduce the government's stake in joint-venture oil assets and other holdings. PHOTO: Bloomberg Nigeria plans to sell portions of its oil assets to help fund President Muhammadu Buhari's four-year program to lift the economy from its worst slump in a quarter century and create 15 million jobs. Buhari proposes in a 2017-2020 economic blueprint to reduce the government's stake in joint-venture oil assets and other holdings. Selling them will \"optimise their efficiency and reduce fiscal burden on the government,\" according to the proposal posted on the Ministry of Budget and National Planning's website. Lenders including the World Bank are awaiting the plan to conclude funding facilities for Africa's second-biggest oil producer. The proposed plan targets growth of 7 percent and inflation under 10 percent by 2020 by increasing oil output, opening up new farmland and boosting investment in power, roads and ports to diversify revenue. The economy shrunk 1.5 percent in 2016, the first full-year contraction since 1991, mainly due to a drop in prices and output of oil, the nation's biggest export, and the resulting foreign exchange shortage. The naira weakened after the central bank removed a peg in June, increasing the prices of imports from fuel to food, contributing to the inflation rate rising to the highest in more than a decade. Selling some oil assets \"will help unlock needed resources, so it's positive,\" <mark>Razia Khan</mark>, head of Africa macro research at Standard Chartered Plc in London, said by email. \"But we will have to look at the timeframe over which this is done. Should we expect a slew of quick privatisations, or will this be drawn out?\" Unlock Resources Nigeria has an average 55 percent stake in joint ventures run by Royal Dutch Shell Plc, Exxon Mobil Corp., Chevron Corp., Total SA and Eni SpA, which produce about 90 percent of its crude. The government also owns 49 percent of Nigeria LNG Ltd, a multibillion-dollar company which operates Africa's biggest liquefied natural-gas plant. The government has also hinted it may award concessions for airports. The government aims to increase oil output to 2.5 million barrels a day by 2020 from a low of 1.6 barrels daily in the 2016 third quarter when militants bombed pipelines. This is forecast to boost government revenue by 800 billion naira ($2.53 billion) annually. Some of the additional funds will be used to revamp domestic refineries to raise capacity to a level where the country will turn into a net exporter of refined fuel. \"Hidden' Debt The West African nation raised $1 billion in a Eurobond issuance last month and will probably tap the international bond market for a second time this quarter to raise $500 million. Nigeria will re-balance its debt portfolio to increase the proportion of foreign financing and\" make arrangements to pay off hidden federal government debt, \"according to the plan. The government wants to issue bonds and debt certificates for 2 trillion naira to pay outstanding bills to contractors, ministries, departments and agencies, and state governments, Budget Ministry spokesman Akpandem James said by phone from Abuja, the capital. The plan refers to\" hidden \"debt because some of the liabilities have to be verified before they are paid, he said. Nigeria will\" sustain a market-determined exchange rate \"and monetary policy will be\" aligned with other aspects of the federal government's macroeconomic program, \"according to the plan. The central bank has intervened since August to keep the naira at about 315 against the dollar, after abandoning the peg of 197-199 per dollar. The regulator has increased its key lending rate to a record 14 percent to fight inflation, despite calls from Finance Minister Kemi Adeosun to loosen policy to support the economy. The currency was 0.2 percent weaker at 315.5 by 6:18 a.m. in Lagos, the commercial capital. Power Prices The government will introduce cost-reflective power tariffs to encourage investment in a sector that's heavily indebted and struggling with cash flow. The Ministry of Power, Works and Housing said the government would, from January, guarantee 702 billion naira for state-controlled Nigeria Bulk Electricity Trading Plc to pay for electricity it receives from generating companies and sells to distributors. Nigerian power distributors paid only 27 percent owed to generators in 2017, according to data from the National Bureau of Statistics. The plan proposes reforms including increasing the value-added tax on luxury products to 15 percent in 2018 from 5 percent and improving compliance to add 350 billion naira to annual revenue collections. At least 100,000 hectares of additional arable land will be irrigated, farmers will have better access to fertiliser, a staple crop processing zones authority will be established, and the Bank of Agriculture will be recapitalized to increase loans. This is part of the nation's strategy to boost production to meet domestic demand and export products including rice, cashew nuts, groundnuts, cassava and vegetable oil by 2020. The plan\" ticks a lot of the key boxes and correctly identifies the problems that they have, \"John Ashbourne, an economist at London-based Capital Economics Ltd. said by phone .\" The real question is, will they follow through with this? \"Advertisements Rate this: Like this: Like Loading...Related", "articleID": "2017030817_00618408_W", "names": {"Razia Khan": ["Q48798641", "Q7299554"]}}, {"date": "2017-03-08", "url": "http://www.tribtown.com/2017/03/08/us-st-patricks-parade-gays-the-latest/", "content": "BOSTON--The Latest on the decision by the organizers of Boston's St. Patrick's Day parade to deny permission for a gay veterans group to participate (all times local): 12:30 p.m.. The decision by the organizers of Boston's St. Patrick's Day parade to bar a group representing gay veterans from participating is leading to more political fallout. Republican Gov. <mark>Charlie Baker</mark> said Wednesday he would not participate in the March 19 parade if OutVets was excluded. He says denying veterans the chance march in a parade that honors veterans \"doesn't make any sense .\" Democratic U.S. Rep. Seth Moulton called for an outright boycott of the parade. This year's Chief Marshal also stepped down in light of the vote to bar OutVets. Dan Magoon, executive director of Mass Fallen Heroes, says the freedom to hold the parade has been won by the spilled blood of all veterans. Boston Mayor Marty Walsh previously said he would not participate if OutVets was excluded. 7:45 a.m.. The organizers of Boston's St. Patrick's Day parade made history in 2015 when after decades of resistance they allowed a group of gay veterans to participate. Now, that group, OutVets, say they have been denied a spot in this year's parade scheduled for March 19. OutVets said on their Facebook page that \"While the reason for our denial is unclear, one can only assume it's because we are LGBTQ .\" Ed Flynn, a member of the South Boston Allied War Veterans Council, the parade's organizer, says he voted to allow OutVets to participate. The vote Tuesday was 9-4. The Navy veteran said he was \"saddened and outraged\" that the council \"voted to turn back the clock on equality .\" Emails and phone messages for the council were not immediately returned Wednesday morning.", "articleID": "2017030817_01328596_W", "names": {"Charlie Baker": ["Q28051620", "Q5076629", "Q5084482", "Q56254750"]}}, {"date": "2017-03-09", "url": "https://www.gympietimes.com.au/news/barnett-says-labor-costings-cobbled/3153543/", "content": "WA Labor leader <mark>Mark McGowan</mark> visits the Civmec Construction and Engineering company in Perth on Friday. DAN PELED Popular Stories 15 jobs going in Gympie right now Why is there a chopper hovering over Gympie? $20k? Is this the Gympie region's cheapest land? Local Real Estate Subscribe Now LONG-serving West Australian Premier Colin Barnett used his final election campaign media conference yesterday to blast Labor's election promise costings as flimsy, fake and cobbled together by \"a couple of Labor mates\". Despite criticism over WA's rising debt, Mr Barnett said the state had prospered through difficult times under his government and the economy was improving. The 66-year-old said a vote for Labor in today's poll was \"a vote for a return to Dullsville\". Under pressure over the Liberal Party's controversial preference swap deal with One Nation, Mr Barnett admitted on ABC radio he was personally uncomfortable with the deal. \"But at the same time, can I say I accept the reality of that,\" he said. \"Micro parties game the system. They game it and trade preferences .\" A firm favourite to become WA's next premier, Labor leader <mark>Mark McGowan</mark> has been endorsed by the state's only daily newspaper, The West Australian. colin barnett Read More Login to follow dullsville Read More Login to follow <mark>mark mcgowan</mark> Read More Login to follow state election Read More Login to follow western australia Read More Login to follow Topics: colin barnett dullsville <mark>mark mcgowan</mark> state election western australia 0 PRINT Have your say", "articleID": "2017031008_00419180_W", "names": {"Mark Mcgowan": ["Q16197112", "Q5981811", "Q6768808"]}}, {"date": "2017-03-12", "url": "http://lancasteronline.com/news/pennsylvania/zika-is-still-a-threat-pennsylvania-officials-remind-travelers/article_832b111e-069c-11e7-aee1-23c1d41ff635.html", "content": "Close Andre Penner A female Aedes aegypti mosquito; the Aedes aegypti is a vector for transmitting the Zika virus. (AP Photo/Andre Penner) Zika is still a threat, Pennsylvania officials remind travelers (...) Andre Penner A female Aedes aegypti mosquito; the Aedes aegypti is a vector for transmitting the Zika virus. (AP Photo/Andre Penner) If you are heading to a warm destination for vacation, state and federal health officials would like to remind you that Zika is still out there. Yes, college students getting ready for spring break travel should know that the virus linked to serious birth defects hasn't gone away. The U.S. Centers for Disease Prevention & Control still has a travel alert for places where mosquitoes could spread the virus to people--a list that includes parts of Florida and Texas, as well as Mexico, Puerto Rico, Dominican Republic and nearly all of central and south America. Pregnant women should consider postponing nonessential travel to those areas, the CDC says, and all travelers should take extra precautions against mosquito bites both during the trip and three weeks after returning, to avoid spreading the virus. Because the virus can also be transmitted sexually, the CDC also counsels travelers to avoid unprotected sex with a woman who is or may become pregnant for at least six months after being in a Zika-infected region. State officials are reminding potential travelers to be cautious. \"The threat of the Zika virus exists in every part of the state due to global travel,\" said Nate Wardle, the emergency preparedness public information officer a the state Department of Health, which has been \"using social media to reach students and their families to urge the importance of education and awareness about Zika, the dangers and how to protect oneself .\" The CDC recently estimated that Zika made certain types of birth defects 20 times more likely in the U.S., with a previous rate of 3 per 1,000 births rising to 60 per 1,000 births among mothers who had contracted the virus. One of those defects is microcephaly, which is characterized by abnormally small heads and brains. Mosquito transmission hasn't been documented in Pennsylvania yet, but to date department data shows 177 confirmed cases of Zika since the state started tracking them last year, and 32 probable ones. The department doesn't provide local details on those cases, but as of November local health officials said 12 pregnant women in Lancaster County had Zika and there had not yet been any reports of associated birth defects. Updates on county cases and their outcomes were not available this week. In the continental U.S., the CDC says there have been 5,109 cases of Zika in the states, including 1,143 in pregnant women that resulted in 47 babies born with birth defects and 5 pregnancy losses with birth defects. And in Puerto Rico--which has strong ties to the Lancaster area--the CDC says there have been nearly 37,000 cases, and information on pregnancy outcomes is not yet available. Locally, a type of mosquito thought capable of spreading Zika but not likely to do so was found in Lancaster County last year, but Millersville University professor <mark>John Wallace</mark> said that at this point, he doesn't think people need to worry about Zika if they're not traveling outside Pennsylvania. The warm winter here has pushed mosquito season earlier, <mark>Wallace</mark> said, with some flying around now. \"Wear repellent and light-colored clothing; reduce mosquito habitat,\" he said. Call", "articleID": "2017031211_00023131_W", "names": {"John Wallace": ["Q14946934", "Q14949339", "Q15485470", "Q17113779", "Q18163162", "Q21612064", "Q2343394", "Q43911228", "Q57941720", "Q57941797", "Q6223637", "Q6226385", "Q6228353", "Q6230968", "Q6248666", "Q6262780", "Q6262782", "Q6262785", "Q794473"]}}, {"date": "2017-03-14", "url": "http://www.djc.com/cust/openx/www/delivery/ck.php?oaparams=2__bannerid=655__zoneid=48__cb=cc46bbfdde__oadest=http://www.ssfengineers.com", "content": "\"The creativity inherent in engineering separates the mediocre from the excellent .\" Paul Faget, Principal \"I value Ryan Reichman's contributions, especially in the early stages of the design process because he thinks like an architect .\" Paul S. Akiyama, Architect, Akiyama Architecture, LLC \"SSF is unique in that we compete with both the big and small firms. We are your one-stop shop for structural engineering services. Not many firms can say that .\" Brian Richter, SSF Staff \"We have been working with SSF since 1997. Our experience has been consistently positive. Our detail oriented residential projects require a high degree of interaction with engineers; we have found SSF to be engaging, timely and collegial. With this experience, we would not think of working with anyone else .\" Daniel Stettler, Principal, Stettler Design \"I have to tell you that in the short two years I have been associated with SSF, I am extremely impressed. You are the best, most responsive consultant I have ever worked with in 33 years. Your approach to engineering is equaled only by your customer service. I can't believe how fast you work and how quickly you are able to respond. I can only say that this attitude appears to be pervasive within SSF, as I have seen the same attitude from Greg Coons. What a firm!\" <mark>David Clark</mark>, Principal, <mark>David</mark> A. Clark Architects \"I like working here because I have the freedom to explore my ideas. I came here because the opportunities for growth are unparalleled, and the atmosphere is relaxed and welcoming. I stay here because my coworkers are awesome, you can't beat the perks and there's a constant effort by SSF leadership to make things even better. Shareholders wholeheartedly support my volunteer efforts--and I get volunteer PTO!\" <mark>Sean King</mark>, Associate Principal \"I have worked with SSF on both public and private commercial buildings. From new construction to historic preservation projects, they have become a critical asset to the success of our team. They are talented structural engineers, who understand the construction / design requirements of our clients and integrate them with the realities of the budget. They are extremely creative. I cannot give them a higher recommendation!\" Eric Cederstrand, President, Commencement Bay Development \"The Engineers at Swenson Say Faget have been our structural problem-solvers for over two decades. When we have a complex design to create or simply want to enjoy collaborating with their kind, fun, and very experienced engineers, we call SSF!\" <mark>Tim James</mark> Rhodes, RA, AIA, Rhodes Architecture and Light \"When I was in grad school, I had a few classes with an SSF employee. He and I had similar personalities and he thought I would be a good fit. I love the work and the opportunity to design almost every project type you could imagine, from residential to retrofits to climbing gyms. I've been here since 2004, and am now fortunate enough to be a shareholder. I think he was right!\" Zane Kanyer, Associate Principal \"We allow people to be themselves. I'm proud of the people we have and the work that we do every day .\" Chardie Byrne, Principal \"SSF is equitable and truly values the happiness of their employees. This is evident in the retention rate...people that work here stay here! We get great bonuses, time and a half for overtime, 401k contributions and pay nothing for health care .\" Brian Rittereiser, SSF Staff \"I'm given the autonomy to do what I was hired to do: be an engineer and work with great colleagues and clients!\" <mark>Robert Henry</mark>, SSF Staff \"We are only as good as those we work with. SSF is the best and we value our partnership. Thanks for all you do .\" Kevin Price, Creative Director/Lead Architect, JAS Design Build \"SSF hits it out-of-the-park with communication and creative design .\" Blaze Bresko, Principal \"When we have a vision for a structure, I know that I can easily communicate it with the SSF team. Finding an engineer who is not only technically capable, but is also able to communicate the design concept through the skeleton of the building; that is a match made in heaven. They also know how to throw a good party!\" Alev Seymen, LEED AP, Project Associate, Board & Vellum \"Swenson Say Faget's engineers are great collaborators in crafting project-specific structural design and detailing solutions .\" <mark>Brad Miller</mark>, Principal, <mark>Miller</mark> Hayashi Architects \"Working with SSF is fun, friendly and creative. The folks at SSF are always open to pursuit of the best idea for the project at hand .\" Jonathan Hartung, Principal, SHKS Architects \"As a young engineer, SSF is a great place to grow and learn. It is also the definition of work-life balance .\" Joanna Klimczak, SSF Staff \"I like working here because of the great people, great leadership, fun projects, project variety, Tacoma location...great atmosphere. I keep working here for the same reasons. SSF is easy going, but super productive .\" Tony Williamson, SSF Staff \"I can't say enough great things about Swenson Say Faget. Whether we need a simple beam sized, or a 10,000 SF home engineered, we love working with SSF. The engineers are all great communicators (which can be rare in this field), timely, and most importantly the designs make sense both for our aesthetic ideals and for the builders in the field .\" Michelle Linden, Principal, Atelier Drome Architecture, LLP \"Alternate Transportation Supported! SSF has bike racks and a shower for bicycle commuters!\" Dan Morrow, Principal \"SSF's structural engineers are unflappable, careful, creative, and dedicated. My structural engineer is my wingman, and I truly value SSF working beside me through design and construction. Through our 15 years of collaboration, our teamwork has created solid designs and strong projects .\" Jim Cary, Principal, Cardinal Architecture PC \"I get paid to do what I love to do, what I believe I have been made to do, for my friends and with my friends. If that isn't motivation, I don't know what is...\"Ryan Reichman, Principal\" We don't take the stuffed shirt approach to solving problems. \"Rob Galus, Principal", "articleID": "2017031407_00021018_W", "names": {"Brad Miller": ["Q15789609", "Q21288566", "Q21549841", "Q21553608", "Q386995", "Q4954126", "Q4954127", "Q4954129", "Q896845"], "David Clark": ["Q1173155", "Q16018707", "Q21585485", "Q29642472", "Q30122397", "Q3017678", "Q3561074", "Q5232387", "Q5232388", "Q5232390", "Q5232392", "Q5232393", "Q5232394"], "Robert Henry": ["Q42325505", "Q47118768", "Q57201522", "Q7345408", "Q7345409"], "Sean King": ["Q53105723", "Q7441135", "Q7441138"], "Tim James": ["Q1111167", "Q7803707", "Q7803708", "Q7803710"]}}]