[{"date": "2017-03-15", "url": "http://forum.blu-ray.com/showthread.php?t=289674&goto=newpost", "content": "The Matrix Reboot in the works at WB User Name Somebody at work told me a theory about the original trilogy that kept me thinking--Makes me want to re-evaluate the trilogy in that context. But that's the whole thing, as everybody else is saying--the three movies (and animes) are fine as-is and hold up, it doesn't need a reboot. Nobody's asking for it. I could take a sequel, prequel, spin-off (and the material is there already--per Reloaded, the Matrix history goes back through five or six other versions of \"The One,\" so there could be many possibilities for more films or even a TV series). But reboot?! Hell no. . [Show spoiler] 11 WB, let's talk. Just because someone decided to make a movie based off Ghost in the Shell, that doesn't mean you have to rush and pull the closest thing you have in your IP closet out for a remake. For starters, they're not even that close. We don't even know if GITS is going to make that much money. The Matrix is already a pretty good movie and even though it's approaching drinking age, it hasn't withered. Besides, you're already preoccupied with ruining your DCU stable. You don't need to ruin everything you own. Thank you ....and sometimes I miss my 1985 RCA console TV. That reminds me, I wonder what's become of that Neuromancer adaptation? Will it ever see the light of day? (wikipedia says it's in a Chinese company's hands now) And a Snow Crash movie is in the works. Big cyberpunk wave is coming our way. I can see why WB wants to surf on it now. 3 Maybe Keanu can convince WB to do a sequel with him as the lead instead of this reboot crap. I mean, he is on top of his game currently and audiences love him in the John Wick films. He is hot NOW, and people want more badass action films with him as the lead. This would be a good time to the The Matrix 4 and John Wick: Chapter 3 right after that. 54 Remember when The X-Files revival was called a \"reboot\" ? More recently, the Twin Peaks revival keeps being referred to as \"reboot\" by the media. Considering how misused that term has become this'll end up being a sequel/prequel/spinoff etc.. Existing in the same universe but focusing on new characters. Last edited by spanky87; Today at 01:59 AM. Not happening, it will be an all black movie. Then it should have Jaden Smith as Neo and <mark>Kevin Hart</mark> as Morpheus. Top 10: (1) Blade Runner (2) Aliens (3) The Thing '82 (4) The Shining (5) Fear and Loathing in Las Vegas (6) My Neigbor Totoro (7) Monty Python and The Holy Grail (8) Evil Dead 2 (9) Stalker (10) Avalon Quote: Originally Posted by BladeRunner2007 Maybe Keanu can convince WB to do a sequel with him as the lead instead of this reboot crap. I mean, he is on top of his game currently and audiences love him in the John Wick films. He is hot NOW, and people want more badass action films with him as the lead. This would be a good time to the The Matrix 4 and John Wick: Chapter 3 right after that. WB: \"Makes too much sense, does not compute .\" Top 25 | Aliens | Amadeus | Annie Hall | Casablanca | Chinatown | The Dark Knight | Days of Thunder | Die Hard | Drive | Fargo | The Fugitive | The Godfather, Part II | Goldfinger | Goodfellas | Lawrence of Arabia | The Lord of the Rings | Psycho | Pulp Fiction | Raiders of the Lost Ark | The Shining | The Silence of the Lambs | Star Wars | The Sting | Unforgiven | Zodiac | (2016 Top 25) | 2017 Movie Ratings", "articleID": "2017031503_00040234_W", "names": {"Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"]}}, {"date": "2017-03-16", "url": "http://brisbanetimes.com.au/wa-news/men-handed-long-jail-terms-over-meth-in-the-spa-drug-raid-20170315-guyxv3.html", "content": "March 16 2017 - 11:28 AM Save Print License article Men handed long jail terms over \"meth in the spa drug raid' Phil Hickey facebook SHARE twitter TWEET email google-plus linkedin reddit More Millions of dollars of methamphetamine was thrown into a spa at a Perth home in a panicked attempt to destroy the drugs during a police raid, a WA court has heard. Christopher Neil Rowson, 31, and Shaun Michael Mather, 35, were both handed long jail terms in the WA District Court last week over the multimillion dollar drug bust. SHARE Share on Facebook SHARE Share on Twitter TWEET Link The meth dealers poured the drug in a hot tub in the hope of getting away with the crime, but testing uncovered $2m worth of ice. (file pic) Photo: AP The pair were inside a home south-east of Perth in April 2015 when police came calling with a search warrant. Federal police officers had been monitoring Mather, the court heard, as part of an operation targeting the Lone Wolf outlaw motorcycle gang. SHARE Share on Facebook SHARE Share on Twitter TWEET Link Police seized 2.1 kg of meth from the scene, including 1.7 kg from the spa water. Photo: Supplied Police raided the Mount Richon rental home after Mather arrived there and after he had met with a patched member of the Lone Wolf gang. As police officers made their way to the back of the property, they saw Mather holding open the lid of the spa and emptying methamphetamine from plastic bags into it. Advertisement In doing so, he also spilled a quantity of the drug onto the ground next to the spa. Details of how police were able to extract large quantities of the drug from the spa water were revealed in court as the pair were sentenced. Police had intended to empty the entire contents of the spa - some 700 litres of water - into 25 large plastic containers. But the containers were only able to hold 595 litres, so only 595 litres of the spa water was tested. Police emptied the other 105 litres of remaining spa water onto the back lawn. ChemCentre specialists took samples from each of the 25 containers. The samples were tested and the concentration levels of methamphetamine in each one was determined. From those concentration levels, police were able to calculate the amount of meth in each of the 25 containers. The total amount of methamphetamine seized by police from the scene was 2.1 kg, including 1.7 kg from the spa water. The drugs had a street value of more than $2 million. Mather pleaded guilty to one count of possessing methamphetamine with intent to sell or supply. He was jailed for 13 years. Rowson was convicted after a trial of three offences relating to the seized drugs and weapons found in the home. He was jailed for 15 years. Judge <mark>Stephen Scott</mark> said he had to send a strong message to methamphetamine dealers who were fuelling the significant crime rate being committed by those who seek the drug .\" Those crimes being burglaries, robberies and significant gratuitous violence, \"Judge <mark>Scott</mark> said .\" The court does need to demonstrate, as best sentencing, a zero tolerance with respect to those who deal in this insidious drug. \"Both Rowson and Mather were made eligible for parole after 11 and 13 years respectively.", "articleID": "2017031601_00281800_W", "names": {"Stephen Scott": ["Q2345068", "Q7610488"]}}, {"date": "2017-03-16", "url": "http://playbill.com/article/acting-company-tour-arrives-in-nyc-march-17", "content": "Acting Company Tour Arrives in NYC March 17 | Playbill Mar 17, 2017 The company presents two plays in repertory, X: Or, Betty Shabazz v. The Nation and Julius Caesar. Jimonn Cole The Acting Company tour of X: Or, Betty Shabazz v. The Nation and William Shakespeare's, presented in repertory at nearly 30 universities, colleges, and community partners across the country, arrives in New York City March 17. Julius Caesar The Acting Company's 44th tour runs through March 26 at The New Victory Theater. Marcus Gardley's X: Or, Betty Shabazz v. The Nation concerns the assassination of Malcolm X. The cast comprises Jimonn Cole as Malcolm X, Jonathan-David as Louis X, William Sturdivant as Elijah Muhammad and Bootblack, Joshua David Robinson as Brother Eugene X and Doc, Gabriel Lawrence as Muhammad the First, Chelsea <mark>Lee Williams</mark> as Betty Shabazz, Kevis Hillocks as Wilbert X, and N’Jameh Camara as the Judge with ensemble members Austin Purnell and Tatiana Wechsler, all under the direction of Acting Company artistic director Ian Belknap. The creative team also includes Lee Savage (scenic design), Candice Donnelly (costume design), Mary Louise Geiger (lighting design), Justin Ellington (sound design/music composition), Byron Easley (choreography), <mark>Elizabeth Smith</mark> (voice, speech, and text consultant), and Orlando Pabotoy (fight direction). Gardley adapts the framework of Shakespeare's Julius Caesar for his play to \"deepen our understanding of one of America's most complex, compelling historical figures and explores the tumultuous landscape of ideology and activism in the 1960s,\" according to press notes. \"Through the story of Julius Caesar, a rising political star torn down by his most trusted allies, audiences witness the art of persuasion, the ugliness of backroom politics, and the historical patterns we can't stop repeating. Tackling essential questions about the balance of ambition, personal loyalty, and love of country, Shakespeare's timeless political masterpiece has never been more relevant .\" Gabriel Lawrence Devin Brain directs the Julius Caesar cast, which includes Gabriel Lawrence as Julius Caesar, William Sturdivant as Caius Cassius, Jimonn Cole as Marcus Brutus, Jonathan-David as Mark Antony, Joshua David Robinson as Casca and Titinius, N’jameh Camara as Calpurnia, Chelsea Williams as Portia, Kevin Hillocks as Octavius, Austin Purnell as Soothsayer, and Tatiana Wechsler as Trebonius. The creative team also features Lee Savage (scenic design), Jennifer Moeller (costume design), Mary Louise Geiger (lighting design), Nathan A. Roberts and Charles Coes (music and sound design), <mark>Elizabeth Smith</mark> (voice, speech, and text consultant), and Orlando Pabotoy (fight direction). The company is also joined on tour by Lindsey Turteltaub (production stage manager) and Geoffrey Boronda (assistant stage manager). For more information and ticketing visit www.theactingcompany.org.", "articleID": "2017031704_00050764_W", "names": {"Elizabeth Smith": ["Q1331318", "Q28530491", "Q43391751", "Q43393828", "Q43394133", "Q43395523", "Q43395873", "Q43396043", "Q55761719", "Q56535801", "Q644208"], "Lee Williams": ["Q1423984", "Q23041966", "Q6515522", "Q6515525", "Q6515526", "Q6515531"]}}, {"date": "2017-03-18", "url": "http://www.taipeitimes.com/News/taiwan/archives/2017/03/18/2003666993", "content": "<mark>Lin</mark> vexed by complaints over labor changes By Alison Hsiao / Staff reporter Premier <mark>Lin Chuan</mark> gestures during a question-and-answer session at the Legislative Yuan in Taipei yesterday. Photo: Peter Lo, Taipei Times Employers would not have had any problems implementing the \"one fixed day off and one flexible rest day\" policy if they had been complying with the Labor Standards Act (勞動基準法) all along, Premier <mark>Lin Chuan</mark> (林全) said yesterday. The Chinese Nationalist Party (KMT) caucus and Nantou County Commissioner <mark>Lin</mark> Ming-chen (林明溱) on Thursday said that the central government should take responsibility for the public's complaints about the new labor policy and asked for more \"flexibility\" for employers. The policy has significantly increased costs in the ready-mixed concrete industry, while relations between workers and employers have deteriorated, Taiwan Ready-Mixed Concrete Association chairperson Chu Jui-lu (朱瑞爐) said. \"Many businesses might fold this year. We might witness a wave of bankruptcies,\" Chu told the Chinese-language Economic Daily News. <mark>Lin</mark> said that many businesses have been stoking tensions by mentioning problems related to general management, many of which were not caused by the policy, \"but due to that [the businesses] did not closely follow the Labor Standards Act in the past .\" The government's follow-up to the act's implementation and its examination of the problems reportedly caused by the policy has shown that the problems mostly arose from lax execution of the labor law prior to its amendment, the premier said, adding that the government would continue to monitor the effects of the policy and communicate with the public. The Ministry of Labor yesterday announced that the logistics industry will be allowed flexibility when applying Article 30, Paragraph 3 of the act, which stipulates that employers, with prior consent from the relevant unions, can distribute the regular working hours over eight weeks, provided that the regular working time does not exceed eight hours per day and the total number of working hours do not exceed 48 hours per week. It would collect opinions regarding the measure, it said. Asked about the proposed relaxation and whether other industries would be given similar flexibility, the premier said he would respect the ministry's decision. However, Chinese Nationalist Party (KMT) Legislator Alicia Wang (王育敏) said the government should set \"a final tone\" instead of using executive orders to relax prohibitions that it established, \"which leaves everyone baffled .\" This story has been viewed 89 times. Comments will be moderated. Remarks containing abusive and obscene language, personal attacks of any kind or promotion will be removed and the user banned. Listing from 2017-03-11 to 2017-03-18 Most read", "articleID": "2017031716_00644680_W", "names": {"Lin Chuan": ["Q45542575", "Q45649697", "Q8997373"]}}, {"date": "2017-03-17", "url": "http://money.usnews.com/investing/news/articles/2017-03-17/g20-to-jointly-fight-bank-sector-hacking", "content": "A general view shows the G20 Finance Ministers and Central Bank Governors Meeting in Baden-Baden, Germany, March 17, 2017. REUTERS/Kai Pfaffenbach Reuters By Balazs Koranyi BADEN-BADEN, Germany (Reuters) - The world's biggest economies will pledge to jointly fight cyber attacks on the global banking system, one of the biggest coordinated efforts yet to protect lenders since an $81 million heist of the Bangladesh central bank's account last year. Meeting in the German resort town of Baden-Baden, G20 finance chiefs will agree to fight attacks regardless of their origin and promise cross-border cooperation to maintain financial stability, according to a draft document seen by Reuters. \"We will promote the resilience of financial services and institutions in G20 jurisdictions against malicious use of information and communication technologies, including from countries outside the G20,\" it said. However, it dropped an earlier reference for enhanced security requirements for financial services. Cyber crime became a top priority after an elaborate heist on the Bangladesh central bank's account at the Federal Reserve Bank of New York last year, an unprecedented theft that exposed the vulnerabilities of the system. The agreement, set to be finalised on Saturday, will come just days after the United States charged two intelligence agents from Russia, another G20 member, with masterminding the 2014 theft of 500 million Yahoo accounts. The indictment was the first time U.S. authorities have criminally charged Russian spies for cyber offences including for computer fraud, economic espionage, theft of trade secrets, and wire fraud. The charges came amid a swirl of controversies relating to alleged Kremlin-backed hacking of the 2016 U.S. presidential election and possible links between Russian figures and associates of U.S. President Donald Trump. In the banking world, attacks through the global SWIFT bank transfer system have continued to increase with the network recording a \"meaningful\" number of attacks with about a fifth of them resulting in stolen funds since the Bangladesh heist, the firm said late last year. In other highly publicized attacks, retailer Tesco Plc's banking arm said 2.5 million pounds ($3 million) had been stolen from 9,000 customers last year while hackers also stole more than 2 billion rubles ($34 million) from correspondent accounts at the Russian central bank and from accounts in commercial banks. The European Union is considering testing banks' defenses against cyber attacks with concerns growing about the industry's vulnerability to hacking. (Editing by Julia Glover) Copyright 2017 Thomson Reuters. Recommended Articles Valeant Stock Gets a Vote of Confidence Wayne Duggan | March 17, 2017 An activist investor with long ties to the pharmaceutical firm buys stock for less than $11 per share. 3 Ways to Avoid Undercutting Your Retirement Strategy Rebecca Lake | March 17, 2017 When it comes to your retirement future, you can't afford to sell yourself short. Pros and Cons of Taking a 401 (k) Loan Matt Whittaker | March 17, 2017 Disadvantages and risks outweigh the benefits when it comes to tapping your retirement account for cash. Gaming Stocks Are Worth a Gamble <mark>Brian O'Connell</mark> | March 17, 2017 The stock market has been sky-high, but gaming stocks, so far, are lagging in the Trump years. GoPro Shares Rise on Restructuring Wayne Duggan | March 17, 2017 GPRO stock climbed more than 15 percent. Driverless Cars May Be Bad for Sirius XM Wayne Duggan | March 16, 2017 More entertainment options are seen as a challenge for SIRI stock. 7 of the Best Cheap Stocks to Buy Under $10 John Divine | March 16, 2017 Cheap stocks are a dime a dozen but cheap stocks worth buying? Those are harder to come by. 3 Things to Know About the March Interest Rate Hike John Divine | March 16, 2017 A quick rundown of the major takeaways from the Fed's most recent rate hike. McDonald's Calls Trump \"Disgusting' <mark>David Oliver</mark> | March 16, 2017 The fast food chain later deleted the post and said the account had been\" compromised .' Avoid These 5 Common Tax-Filing Errors Debbie Carlson | March 16, 2017 Typos and claiming dependents are some of the common mistakes. Load More", "articleID": "2017031718_00504439_W", "names": {"Brian O'Connell": ["Q44738511", "Q4964892", "Q4964893", "Q4964895", "Q7143847"], "David Oliver": ["Q16214119", "Q20127971", "Q20732875", "Q5238212", "Q5238216", "Q5238217", "Q9162"]}}, {"date": "2017-03-19", "url": "http://heroichollywood.com/han-solo-film-different-rogue-one/", "content": "Now that the dust has settled on Rogue One, all eyes are turning on Star Wars: The Last Jedi and the upcoming Han Solo film. Seeing as J.J Abrams already established the tone, setting, and characters for the upcoming Skywalker Trilogy, everyone's focused on the Han Solo film. After all, it's an unknown quantity, but it has been proven that solo Anthology films can work in the Star Wars universe with Rogue One. Also read: \"Rogue One' Screenwriter Explains Connections To\" A New Hope' The unique thing about these Anthology films is that they can each have different tones without compromising the tone of the core series. Seeing as Rogue One was a mash-up of a heist/war film, the Han Solo film can be seen as a Western film. With Phil Lord and <mark>Chris Miller</mark> behind the camera and Star Wars veteran Lawrence Kasdan penning the script, the team for the Han Solo film is looking to make something different from <mark>Gareth</mark> Edward's gritty Rogue One. During an interview at the Empire Film Awards, <mark>Gareth Edwards</mark> discussed how both stand-alone films will be different from each other. \"They're amazing filmmakers. I'm very excited about what they do. It'll be a completely different film to what we did. I think they've got the hardest task, I think, out of all the films that I heard about that one is probably the greatest challenge and they're gonna knock it out of the park, but I wouldn't have had the balls to do that .\" Also read: \"Star Wars': First Ever Photo Of Luke Skywalker Revealed Unlike us, <mark>Edwards</mark> has the inside scoop on the upcoming film and is aware of all the minutiae surrounding it. However, this is more of a curse for <mark>Edwards</mark> since he's feeling a bit jealous .\" They've got really good taste. You glimpse things--you try not to--as you're going about your business, but you see stuff. And everything I saw, I got really jealous about it. \"Also read:\" Rogue One' Writer Explains Why Fans Will Never See Draft Of Unused Opening Crawl The Han Solo film just recently went into production and with the principal cast ready, we got our first look at them in the Millenium Falcon. While Phil Lord and <mark>Chris Miller</mark> keep busy, we're not sure what <mark>Gareth Edwards</mark> is up to next. He was originally attached to direct the sequel to his 2014 reboot of the Godzilla franchise, Godzilla: King of Monsters. However, he left the project last year and was replaced with Michael Dougherty, who directed Krampus. Directed by Phil Lord and <mark>Chris Miller</mark>, the Han Solo film stars Alden Ehrenreich, Donald Glover, Woody Harrelson, and Emila Clarke. The Han Solo film is set to hit cinemas on May 25, 2018. Source: Empire (via Facebook) Kotobukiya Reveals \"Star Wars' Celebration Exclusive Figures Previous 1 of 5 Next Star Wars Celebration is always a fun time for everyone involved. The filmmakers get to reveal and show footage from their new films, fans get to meet their favorite Star Wars actors, get autographs, and grab exclusive collectibles that can't be found anywhere else. This year's Star Wars Celebration is taking place in Orlando, Florida from April 13th to the 16th. While a majority of the event is currently under wraps, one thing is certain: Kotobukiya will be delivering the goods. Kotobukiya has revealed their upcoming slate of exclusive Star Wars Celebration figures and this year, their figures have a distinct theme: droids. Four new ARTFX + figures will be released, both for fans who are stuck at home, and those at the event itself. The droids include R4-M9, R5-D4, RX-X2, Triple Zero (0-0-0), and BT-1. You can check out the full gallery of the figures, including their details below the pictures by clicking NEXT. If you can't make it to the event, you can pre-order the figures on Kotobukiya's official website. Be sure to check back when Star Wars Celebration Orlando begins as we'll have all the latest information on your favorite franchise in a galaxy far, far away. Source: ComicBook.com Previous 1 of 5 Next VIEW IN GALLERY", "articleID": "2017032005_00415967_W", "names": {"Chris Miller": ["Q13638984", "Q25184124", "Q283700", "Q5107465", "Q5107466", "Q58011841"], "Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"]}}, {"date": "2017-03-21", "url": "http://www.koaa.com/story/34963174/hanks-baldwin-headline-facebook-live-aclu-fundraiser", "content": "Hanks, Baldwin headline Facebook Live ACLU fundraiser - KOAA.com | Continuous News | Colorado Springs and Pueblo Hanks, Baldwin headline Facebook Live ACLU fundraiser - KOAA.com | Continuous News | Colorado Springs and Pueblo Member Center: Hanks, Baldwin headline Facebook Live ACLU fundraiser Posted: Updated: (Photo by Jordan Strauss/Invision/AP, File). FILE - In this Oct. 25, 2016, file photo, Tom Hanks arrives at a special screening of \"Inferno\" at the Directors Guild of America Theatre in Los Angeles. Hanks is among the celebrities set to appear during a.. . NEW YORK (AP) - Tom Hanks, Alec Baldwin and Tina Fey are among the stars set to appear on Facebook Live as part of a fundraiser for the American Civil Liberties Union. Jon Hamm, Amy Poehler, <mark>Tracy Morgan</mark> and others will also take part in \"Stand for Rights: A Benefit for the ACLU,\" which will stream on Facebook on March 31. The event will be broadcast from New York and hosted on the Facebook pages of Stand for Rights, Funny or Die and The Huffington Post. The ACLU has been active in the legal fight against President Donald Trump's travel bans. ACLU executive director <mark>Anthony Romero</mark> says the telethon will allow the group to \"fight even harder to defend the rights guaranteed by our Constitution .\" Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Search Local Businesses", "articleID": "2017032115_00577726_W", "names": {"Anthony Romero": ["Q1568107", "Q43151542"]}}]