[{"date": "2017-03-21", "url": "http://www.koaa.com/story/34963174/hanks-baldwin-headline-facebook-live-aclu-fundraiser", "content": "Hanks, Baldwin headline Facebook Live ACLU fundraiser - KOAA.com | Continuous News | Colorado Springs and Pueblo Hanks, Baldwin headline Facebook Live ACLU fundraiser - KOAA.com | Continuous News | Colorado Springs and Pueblo Member Center: Hanks, Baldwin headline Facebook Live ACLU fundraiser Posted: Updated: (Photo by Jordan Strauss/Invision/AP, File). FILE - In this Oct. 25, 2016, file photo, Tom Hanks arrives at a special screening of \"Inferno\" at the Directors Guild of America Theatre in Los Angeles. Hanks is among the celebrities set to appear during a.. . NEW YORK (AP) - Tom Hanks, Alec Baldwin and Tina Fey are among the stars set to appear on Facebook Live as part of a fundraiser for the American Civil Liberties Union. Jon Hamm, Amy Poehler, <mark>Tracy Morgan</mark> and others will also take part in \"Stand for Rights: A Benefit for the ACLU,\" which will stream on Facebook on March 31. The event will be broadcast from New York and hosted on the Facebook pages of Stand for Rights, Funny or Die and The Huffington Post. The ACLU has been active in the legal fight against President Donald Trump's travel bans. ACLU executive director <mark>Anthony Romero</mark> says the telethon will allow the group to \"fight even harder to defend the rights guaranteed by our Constitution .\" Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Search Local Businesses", "articleID": "2017032115_00577726_W", "names": {"Tracy Morgan": ["Q14542", "Q27119857"]}}, {"date": "2017-03-23", "url": "http://www.walesonline.co.uk/news/uk-news/london-terror-attack-theresa-tells-12784935", "content": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email Prime Minister Theresa May has given a statement to MPs, saying killed PC <mark>Keith Palmer</mark> was \"every inch a hero and his actions will never be forgotten\". She told the House of Commons that Parliament was sending out the message following Wednesday's attack: \"We will never waver in the face of terrorism .\" The Prime Minister addressed MPs as they gathered at the usual time inside the Palace of Westminster, which a day before had come under attack from a knife-wielding terrorist. She says millions will be boarding trains and planes to come to London and \"see for themselves the greatest city on earth\". \"Our values will prevail and I commend this statement to the House .\" Mrs May told MPs: \"Yesterday an act of terrorism tried to silence our democracy, but today we meet as normal, as generations have done before us and as future generations will continue to do, to deliver a simple message:\" We are not afraid and our resolve will never waver in the face of terrorism'. \"She said it was still believed that the attacker acted alone and there was\" no reason to believe \"further attacks on the public were planned. She added:\" His identity is known to the police and MI5 and when operational considerations allow, he will be publicly identified. Read More London terror attack latest: Everything we know so far \"What I can confirm is that the man was British-born and that some years ago he was once investigated by MI5 in relation to concerns about violent extremism .\" He was a peripheral figure. The case is historic. He was not part of the current intelligence picture. \"There was no prior intelligence of his intent or of the plot .\" Mrs May concluded her statement by saying: \"Our values will prevail .\" An hour before MPs had stood for a minute's silence in honour of the innocent people killed in the attack, Mrs May delivered a statement with details of the atrocity. Read More London terror attack: Victim named as mum of two who was collecting her children from school Read More London terror attack Live updates MP claims bomb was found in 4x4 Victim was mum of two MP filmed as he ran through Westminster MPs speak of \"frightening' atmosphere Reporter describes scenes James Corden pays tribute What we know so far", "articleID": "2017032310_00423393_W", "names": {"Keith Palmer": ["Q1738074", "Q1776781", "Q19276832", "Q19876817", "Q30333381", "Q46585611"]}}, {"date": "2017-03-28", "url": "http://www.valdostadailytimes.com/news/national_international/today-in-history/article_12dcd70b-13a3-5ec2-80f6-e2eeb6e5ea34.html", "content": "National/International (31601) Today Intervals of clouds and sunshine. A stray shower or thunderstorm is possible. High around 85F. Winds SW at 5 to 10 mph. . Tonight A few clouds. Low 59F. Winds WSW at 5 to 10 mph. Updated: March 27, 2017 @ 11:53 pm VALDOSTA--A former Moody Air Force Base commander passed away during the weekend--a man whose career seemed to reflect the history of the 20th century. More Headlines VALDOSTA--The Lowndes baseball team had runners in scoring position while Valdosta left-hander Dayton Hall faced a 2-2 count with a one-run lead in the bottom of the seventh inning Tuesday night. More Headlines Ashley Reaves & <mark>Christopher Gibson</mark> LEESBURG, Ga.--Thomas Shane and <mark>Deborah Tucker</mark> of Leesburg, Ga. and William Timothy and Pam Reaves of Hahira, Ga. announce the engagement of their daughter, Ashley Reaves of Bluffton, S.C., to <mark>Christopher Gibson</mark> of Bluffton, S.C., son of Hope <mark>Gibson</mark> and Kenneth R. Hughett and the late Tate...More Headlines A time capsule and park bench in the heart of Drexel Park encourages passersby to sit and enjoy the surroundings. More Headlines 16 min ago Today in History Today is Tuesday, March 28, the 87th day of 2017. There are 278 days left in the year. Today's Highlight in History: On March 28, 1942, during World War II, British naval forces staged a successful raid on the Nazi-occupied French port of St. Nazaire in Operation Chariot, destroying the only dry dock on the Atlantic coast capable of repairing the German battleship Tirpitz. On this date: In 1834, the U.S. Senate voted to censure President <mark>Andrew Jackson</mark> for the removal of federal deposits from the Bank of the United States. In 1896, the opera \"Andrea Chenier,\" by Umberto Giordano, premiered in Milan, Italy. In 1898, the Supreme Court, in United States v. Wong Kim Ark, ruled that a child born in the United States to Chinese immigrants was a U.S. citizen. In 1930, the names of the Turkish cities of Constantinople and Angora were changed to Istanbul and Ankara. In 1935, the notorious Nazi propaganda film \"Triumph des Willens\" (Triumph of the Will), directed by Leni Riefenstahl, premiered in Berlin with Adolf Hitler present. In 1941, novelist and critic Virginia Woolf, 59, drowned herself near her home in Lewes, East Sussex, England. In 1955, <mark>John Marshall</mark> Harlan II was sworn in as an associate justice of the U.S. Supreme Court. In 1969, the 34th president of the United States, Dwight D. Eisenhower, died in Washington, D.C. at age 78. In 1977, \"Rocky\" won best picture at the 49th Academy Awards; <mark>Peter Finch</mark> was honored posthumously as best actor for \"Network\" while his co-star, Faye Dunaway, was recognized as best actress. In 1979, America's worst commercial nuclear accident occurred with a partial meltdown inside the Unit 2 reactor at the Three Mile Island plant near Middletown, Pennsylvania. In 1987, Maria von Trapp, whose life story inspired the Rodgers and Hammerstein musical \"The Sound of Music,\" died in Morrisville, Vermont, at age 82. In 1990, President George H.W. Bush presented the Congressional Gold Medal to the widow of U.S. Olympic legend Jesse Owens. Ten years ago: Iran aired a video of 15 British sailors and marines who were captured five days earlier; the lone female captive, Faye Furney, wearing a white tunic and a black head scarf, said the British boats had \"trespassed\" in Iranian waters while patrolling for smugglers near the mouth of the Shatt al-Arab, a disputed waterway. (The crew members were released a week later .) In the Philippines, dozens of children were taken hostage on a bus by a day-care center owner armed with grenades and guns; the crisis ended peacefully 10 hours later with the hostage-taker's surrender. Five years ago: The U.S. Supreme Court wrapped up three days of public arguments on President Barack Obama's historic health care law. On the last day of his visit, Pope Benedict XVI demanded more freedom for the Roman Catholic Church in communist-run Cuba and preached against \"fanaticism\" in an unusually political sermon before hundreds of thousands at Revolution Plaza. Bluegrass legend and banjo pioneer Earl Scruggs, 88, died in Nashville, Tennessee. One year ago: The FBI said it had successfully used a mysterious technique without Apple Inc.'s help to hack into the iPhone used by a gunman in a mass shooting in California, effectively ending a pitched court battle. Officers shot and wounded a man who had pulled a weapon at a security checkpoint as he entered the underground U.S. Capitol Visitor Center. Winston Moseley, the man convicted of the 1964 stabbing death of bar manager Kitty Genovese, died at the Clinton Correctional Facility in Dannemora, New York, at age 81. Actor <mark>James Noble</mark>, 94, died in Norwalk, Connecticut. Today's Birthdays: Former White House national security adviser Zbigniew Brzezinski (ZBIG' - nyef breh-ZHIN' - skee) is 89. Author Mario Vargas Llosa is 81. Country musician <mark>Charlie McCoy</mark> is 76. Movie director <mark>Mike Newell</mark> is 75. Actress Conchata Ferrell is 74. Philippines President Rodrigo Duterte is 72. Actress Dianne Wiest (weest) is 71. Country singer Reba McEntire is 62. Olympic gold medal gymnast Bart Conner is 59. Rapper Salt (Salt-N-Pepa) is 51. Actress Tracey Needham is 50. Actor Max Perlich is 49. Movie director Brett Ratner is 48. Country singer Rodney Atkins is 48. Actor Vince Vaughn is 47. Rapper Mr. Cheeks (Lost Boyz) is 46. Actor Ken L. is 44. Singer/songwriter Matt Nathanson is 44. Rock musician Dave Keuning is 41. Actress Annie Wersching is 40. Actress Julia Stiles is 36. Singer Lady Gaga is 31. Thought for Today: \"A man can do his best only by confidently seeking (and perpetually missing) an unattainable perfection .\" --Ralph Barton Perry, American author and educator (1876-1957). (Above Advance for Use Tuesday, March 28) Copyright 2017, The Associated Press. All rights reserved. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2017032804_00270059_W", "names": {"Andrew Jackson": ["Q16844406", "Q20641045", "Q22076700", "Q2846642", "Q3816215", "Q39067934", "Q43072215", "Q46182175", "Q4757451", "Q56872130", "Q58468310"], "Charlie Mccoy": ["Q17489746", "Q2619399"], "Christopher Gibson": ["Q10451590", "Q32722", "Q5112406"], "Deborah Tucker": ["Q46993213", "Q5248398"], "James Noble": ["Q1322133", "Q14951134", "Q28421980", "Q58423558"], "John Marshall": ["Q11727936", "Q16227857", "Q1700966", "Q201423", "Q20675590", "Q20675591", "Q20684714", "Q21064499", "Q28709713", "Q29033953", "Q30604090", "Q3809459", "Q47540656", "Q51588456", "Q56808914", "Q58104514", "Q6246855", "Q6246857", "Q6246861", "Q6246867", "Q6246869", "Q6246871", "Q929340"], "Mike Newell": ["Q1933404", "Q30612396", "Q312088"], "Peter Finch": ["Q18530607", "Q7173980"]}}]