[{"articleID": "2019062203_00095188_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-22", "url": "http://www.gamereactor.eu/rainbow-six-siege/?sid=73e2bf64f660c0e49878502aab593b70", "content": "RAINBOW SIX: SIEGE REVIEW. Written by Anders Mai on the 30th of November 2015 at 11 \"It's in competitive multiplayer where the game shines. The matches are short, intense and always surprising .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 11 This includes hardware, giveaways, promotions, in-game challenges, and plenty more, starting this month with Season X of the Pro League. 0 NEWS. Written by Ben Kerry on the 11th of June 2019 at 16:24 The new content drops landed alongside a new trailer shown at the Ubisoft press conference. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 7th of June 2019 at 10 Lion is coming back after extensive reworks, alongside changes to the schedule, map pool, operator pool, and more. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of June 2019 at 09 They'll be joined by streamers, all of which will be competing for a charity prize pool of $50,000 USD."}, {"articleID": "2009080814_00030393_W", "names": {"Tom Sawyer": ["Q16143110", "Q28421923", "Q7817480"], "John Lennon": ["Q11979004", "Q6244563"]}, "date": "2009-08-08", "url": "http://open.salon.com/blog/gji_penguin/2009/08/08/warning_-_piss_and_vinegar_seeping_from_my_keyboard_today", "content": "location al khobar, saudi arabia birthday bio born in the uk, grew up in canada, and currently residing in saudi arabia - i guess you could say i get around. \"i had never thought of them this way. it does take a special talent to be able to...\"\"you should board a plane in the middle east. not much security at all. unless the...\"\"nick - great post. at times i think we push too far too fast in order to make thi...\"i got into this debate at work today with one of the few english speakers who is left at the hospital...... click\" submit abuse \"if you feel this post is inappropriate. explain why below if you wish. i got into this debate at work today with one of the few english speakers who is left at the hospital...and as per normal, it just triggered the anger in me. hello, my name is geraint isitt and i have a problem with censorship. i just don't like being told what i can read or listen to, and even worse, write. in order for my writing to be as strong as possible, to emit the emotions in others that i want, i need to know that i have used the best words possible for piece. usually, this means offending someone. by placing limitations on what i can write, whether it be an individual word, a sentence, or a whole genre, you are crippling the creative spirit that i need to become a better writer. i write because i love it, but also because it gives me the freedom to dare, to try things i normally wouldn't. through my writing i can accomplish anything. i can climb everest, i can have that moment that lasts forever, i can be the lone gunman sitting in a coffee shop waiting to commit my seventh shooting of the summer. hell, i can even speak a single sentence and not stutter. do i want to do all of this in real life? no, of course not. but that is where the issue of censorship gets cloudy. too many people take things too literally and blame what they read or hear on things that go wrong. somewhere along the lines we lost touch with reality, started taking things too personally, and found it acceptable behavior to complain, bitch and moan about anything and everything. and god forbid if anything goes wrong and it can be traced, in some way, to a piece of literature or pop culture. exactly where those lines started to blur i could not tell you; but it was a long time ago. in a day and age when kids can sever heads of victims on their video games, i find it hard to believe that we are still considering banning books because of content. quite frankly, it's not like most kids spend too much time reading anyway. and i think we censor to appease the weak and dumb, the not-so-in-touch with reality that, unfortunately, make up too much of our society and too many of the rules. i'm no genius, but i'm not an idiot either, and i can tell the difference between a work of fiction and reality. reality is more painful. how many of you have heard of mark twain? that's what i thought. twain is often regarded as one of america's finest writers, yet, one of his books, the adventures of <mark>tom sawyer</mark> and huckleberry finn was in a constant state of should it be banned or not in many us schools. and the furor was over one word: a racial slur. one of twain's characters was named nigger jim. i don't use this word in everyday conversation, okay, i don't use the word at all, but i feel safe enough with the readership on this website to understand that i am in no ways meaning this in a derogatory or offensive way to anyone. unfortunately, too many people complained about it, successfully having it banned from schools. it mattered not that when twain wrote the book, that term was in wide use, and unfortunately, pretty commonplace. and it mattered not that jim turned out to be the most honest character in the book. you can't appease everyone i guess. and let us not forget about the controversy surrounding j.d. sallinger's novel, catcher in the rye. i loved this book, as did many others, including a gentleman named mark david chapman, who, apparently, was reading this book the day he shot <mark>john lennon</mark>. the book was subsequently banned; something to do with the messages chapman took from the book. maybe i didn't read the book closely enough, but i don't remember a paragraph that said\" get a gun and shoot, arguably, the most talented member of one of the world's greatest bands \". maybe that line only appeared in one copy? and even if it did, i wouldn't do it. we can't succumb to the pressure and start censoring and banning just because people\" say \"something was the reason they did something wrong. i hate to break it to you people in the know, but it takes a little bit more than that. something is fumbling around in the old cranial passages of these people. but, hey, let's not address the health problems of our society; let's limit what we want our writers to put out. and forgive me for saying it, but does anyone else not have a problem with people killing themselves when they hear these secret messages on albums? don't get me wrong, death, in any form, is a tragedy. and i'm not condoning suicide. but i'm not one of those people who sit around and think that it is a total waste of a life either. as far as i'm concerned, the bottom feeders are the ones that leave this way. i've had three friends commit suicide, none for the reason of\" subliminal messages \"in a black sabbath song, and i've wept for the three of them. but, i also thought their actions were cowardly. sure, their pain and suffering is over, but in each instance, the wife/girlfriend, and family members suffer much longer. one of them was the biggest fan of heavy metal music i know, but i know why he did what he did and it had nothing to do with what he read or heard. if that was the reason, i wouldn't have wept. maybe i'm heartless. maybe i'm just upset because the unintelligent and the scared get to make the rules. writing, by nature, is meant to stir emotions. writing, by nature, is meant to leave you wanting more, or wanting to take a cold shower, or wanting to hug a loved one and feel safe again. writing is not meant to be as numbingly benign as talk shows and reality television. i want to be the next margaret atwood or bret easton ellis. i want to be the one pushing boundaries on what is acceptable fiction. when i write i write to entertain. and i also write to get people thinking - intelligent, rational people. unfortunately, most days, it seems like there are too few of us left. and, on a final note, did anyone else find it funny a few years back when a group of modern day\" witches \"wanted to ban"}, {"articleID": "2009100821_00039457_W", "names": {"Harsh Kumar": ["Q19625801", "Q57321695"]}, "date": "2009-10-08", "url": "http://blogs.newsobserver.com/business/cree-to-add-575-jobs-by-2012-plans-durham-expansion", "content": ". biz this is your window into the world of triangle business. it's the source for news on local companies and people who keep capitalism moving. it's your exclusive tip sheet on deals, squabbles and the whimsy that makes this region's industries interesting. cree to add 575 jobs by 2012, plans durham expansion cree, the maker of energy-efficient led lights, announced a new surge of hiring that will swell the company's ranks by 575 workers in the state. in a staged event at its durham headquarters this afternoon that included gov. bev perdue, cree ceo chuck swoboda said the company expects to fill 275 of those jobs this year and fill the remaining 300 openings by the end of 2012. the expansion will significantly boost cree's local staff of 1,500 as the company rides the green energy wave. \"we are seeing tremendous growth for led lighting,\" swoboda said, in a prepared statement. \"energy-efficient lighting has its roots right here in north carolina and cree is proud to be bringing more green jobs to our state .\" in august, cree also began making and assembling led lights in charlotte with contract manufacturer flextronics. cree's is the second major local jobs announcement this week, on the heels of parachute maker north american aerodynamics' plans to hire 375 people in roxboro to fill a u.s. army contract. but the good news was overshadowed by computer maker dell's news wednesday that it will shut down its plant in winston-salem and idle 905 workers. cree is one of the most successful homegrown businesses the triangle has ever spawned, an outgrowth of a n.c. state university research project that that is now traded on the nasdaq stock market. originally cree developed early-generation light emitting diodes for mobile phones, car dashboards and computer monitors. but rapid advancements in semiconductor technology are pushing leds to new applications in lighting for streetlights, offices, homes, hotels and restaurants. led lights can last more than two decades and are sometimes referred to as semi-permanent fixtures. at the same time, leds are up to 90 percent more efficient than conventional lights. as the price of leds comes down and quality improves, leds are increasingly seen as the future of electric lighting that will eventually render incandescent bulbs obsolete. the recent national push for energy-efficiency coincides with quality improvements that together are creating new demand for leds in a wide range of uses. raleigh is among the cities that's testing leds in streetlights and parking decks. as one of the world's top led manufacturers, cree is poised to get a major boost from the transition to efficient lighting. \"business is very good for cree and they're struggling to add capacity,\" said <mark>harsh kumar</mark>, an analyst who follows the company's stock with morgan keegan & co. \"as the federal stimulus money is kicking in, as the population is becoming more green, led lighting is a very compelling product .\" last month, cree sold nearly $400 million worth of new shares on wall street, with about $150 million earmarked for expansion. assistant business editor alan m. wolf joined the n & o in 1999 covering the business of health care. he became an editor in 2001, and helps oversee the paper's daily business coverage and sunday work & money section. he lives in clayton with his wife and two children. reach him at 919-829-4572 or"}, {"articleID": "2016051714_00549156_W", "names": {"Alison Brooks": ["Q13033980", "Q4727039"], "Tony Ward": ["Q18353292", "Q2577525", "Q3531929", "Q7823646", "Q7823647", "Q7823648"], "Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"], "Neil Young": ["Q1361496", "Q16104585", "Q1974908", "Q48841251", "Q6265210", "Q633", "Q6989513", "Q6989515"], "Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}, "date": "2016-05-17", "url": "http://out.com/hit-list/2016/5/17/pop-sisters-tegan-sara-break-new-queer-ground", "content": "Pop Sisters Tegan & Sara Break New (Queer) Ground The duo has left moody alt-rock behind for greener pastures: mainstream pop By Steven J. Horowitz Tue, 2016-05-17 10:27 Photography by Benedict Evans. Styling by <mark>Alison Brooks</mark>. Tegan (left) and Sara Quin. Sara: Shirt by <mark>Tony Ward</mark> available at Church Boutique LA.. Jacket by <mark>Marc Jacobs</mark>. Tegan: Shirt by <mark>Tony Ward</mark> available at Church Boutique LA.. Jacket by JET available at John Eshaya. Left: Tegan: Shirt by Rag & Bone. Forging a career that transgresses the boundaries of alternative rock and dives into infectious pop is new ground for Tegan and Sara. Often pegged to their labels--lesbians, identical twins, Canadian--the duo have spent nearly 20 years eclipsing what's on the surface by focusing on their sound and message, gradually progressing from bedroom four-trackers to moody indie blowouts to their most ambitious incarnation yet: candy-striped, ’80s - indebted, queer-leaning New Wave that, instead of fetishizing sexuality, normalizes it. On their eighth album, Love You to Death, the duo take the rocky experiences from real-life relationships and send them up the flagpole in the hopes of finally cracking the mainstream. Though they're the most prominent contemporary gay female act to scale the charts (their 2013 album, Heartthrob, debuted at number 3 on the Billboard 200), the 35-year-old songwriters have still spent most of their career as outsiders. But proud ones. Female artists such as Lady Gaga, Halsey, and Nicki Minaj have bent the spectrum of sexuality in pop culture but limited it to just one facet of their public persona. Tegan and Sara Quin have become torchbearers forpost -' 00s queerdom in music. Where the Calgary, Alberta, natives have excelled is in their readiness to take anecdotes from their personal lives and push them to the forefront, something they've done since signing to <mark>Neil Young</mark>'s Vapor Records in 1999. \"A lot of our career, it felt really natural to be open about the fact that I was queer,\" says Sara. \"I don't have to think very hard about relating to a song about a straight man. I don't understand why the world can't relate to a song written by a queer woman. I'm writing about the same shit everyone is writing about. I just happen to be a girl who identifies as queer .\" With Love You to Death, out June 3 on Vapor/Warner Bros., their openness takes on added dimensions. Having invited superproducer Greg Kurstin (Adele, Sia) to partake in the recording process for the whole album--a first for the pair--they tackle a complex kaleidoscope of relationships, particularly the one they share as twins. Until now they've been relatively private about the friction between them, which nearly tore the duo apart around the release of 2007's The Con (their fifth album and first to chart) and led to literal blows and long stretches when they wouldn't speak to each other. \"I think Sara and I spent a lot of years compromising, and I think that fueled a lot of the anger and resentment and frustration and isolation that we experienced in our band,\" says Tegan. The song on Love that addresses the ripples in their sisterhood most explicitly is \"100x,\" a stark piano ballad written by Sara: \"It was cruel of me to do what I did to you / It was wrong of me to hurt such a big part of you,\" they harmonize. Pants by Veronica Beard available at Saks Fifth Avenue. Jacket available at Church Boutique LA.. Sara: Shirt by Rag & Bone. Pants by Sandro available at Bloomingdale's. Jacket by Mossimo for Target. \"We are doing much better, but old habits die hard,\" says Sara. They went to therapy at one point and are finally at a place where they can listen to each other before reacting. \"There are days where I imagine opening the car door and pushing Tegan out, but I just think to myself, We're 35 and grown-ups, and we've acquired skills, in our personal and romantic relationships as well as our professional relationships. Now that we've put that era behind us, I think it's actually quite healing to talk about it .\" Their improved communication has also freed them to focus more on staking uncharted sonic territory. Just two albums ago, with 2009's Sainthood, they inhabited a space in alternative music where people often crassly exoticized their otherness: \"People asked us if we were incestuous,\" recalls Sara. With that record's follow-up, Heartthrob, they kept their approach to lyricism the same but shifted the tone, working mostly with Kurstin to tighten its pop structures and fold in synthetic sounds. On Love they're making a bid for a bigger fan base, something they've been edging toward for years. \"We deserve to be there,\" says Tegan. \"We're working just as hard as everybody else, and I want to blow that fuckin' door open, just like so many artists before us did .\" Many have already embraced them. In 2014 they opened for Katy Perry on her Prismatic tour, and last year they performed their song \"Everything Is Awesome\" (from The Lego Movie) at the Academy Awards with Andy Samberg's band, the Lonely Island, and Questlove. Their hummable, Windex-wiped new single \"Boyfriend\" is about dating a woman who's never been with another woman, inspired by the beginning of Sara's romance with her current girlfriend--and it's just as capable of being slotted into a radio playlist as anything from Taylor Swift. While queer male pop stars like <mark>Sam Smith</mark>, Troye Sivan, and Years and Years's Olly Alexander have seamlessly won over large swaths of pop fans with their confessional same-sex love songs, Tegan and Sara are hoping to level the playing field and do the same. \"If Katy Perry can open the door for artists like us, then we can open the door for some of those <mark>young</mark> kids to start to think about their gender and their sexuality,\" says Tegan. \"That feels really important .\" Tegan and Sara will release their new album, Love You to Death, on June 8. Like what you see here? Subscribe and be the first to receive the latest issue of OUT. Subscribe to print here and receive a complimentary digital subscription."}, {"articleID": "2019021515_00495730_W", "names": {"Scott Johnson": ["Q1444739", "Q22113504", "Q24804566", "Q3476241", "Q5889250", "Q7436581", "Q7436583", "Q7436584"]}, "date": "2019-02-15", "url": "https://www.radioiowa.com/2019/02/15/national-ffa-week-begins-saturday/", "content": "Thousands of Iowa FFA members will be celebrating National FFA Week, starting Saturday and all next week. <mark>Scott Johnson</mark>, executive director of the Iowa FFA Association, says these young people are tomorrow's leaders of America's number-one industry, agriculture. Drive Your Tractor to School Day remains one of the organization's most popular events in Iowa--and one of the most visible. \"I remember from my experiences teaching, it was always weather-pending,\" <mark>Johnson</mark> says. \"If FFA Week happened to be colder, Drive Your Tractor to School Day would almost always occur but sometimes it didn't occur during FFA Week. You had to wait for it to be warmer for those old diesel engines to be able to fire up and survive a day in the open parking lot .\" FFA membership in Iowa hit an all-time high last year with more than 15,400 students wearing the familiar blue jackets. <mark>Johnson</mark> says membership has continued to grow over the past several years. \"We've experienced about a 20% growth in membership,\" <mark>Johnson</mark> says. \"When I started in this position in 2012, we were right around 12,000 to 12,300. Now, we're at 15,000 .\" The number of chapters statewide last year hit 242, which was also a record, one <mark>Johnson</mark> hopes to again surpass this year. The Iowa FFA Association provides leadership, personal growth and career success training through agricultural education, what he says is a growing field. \"We see a few schools that are adding a second ag instructor,\" <mark>Johnson</mark> says. \"We continue to see schools adding new programs. We look forward to the opportunity to bring on-board a number of chapters for the 2019-2020 school year .\" The week gives members an opportunity to educate the public about agriculture through events including: service activities, appreciation breakfasts, dress-up days and Agricultural Olympics."}, {"articleID": "2018122708_00785280_W", "names": {"Gary Cahill": ["Q17305745", "Q223827"]}, "date": "2018-12-27", "url": "https://www.thesun.co.uk/sport/football/8065185/7am-arsenal-news-emery/", "content": "Gossip By Tom Roddy 27th December 2018, 6:00 am Updated: 27th December 2018, 6:02 am UNAI EMERY apologised to a Brighton fan for kicking a water bottle out of frustration. Read all this plus more of the latest news, views and gossip from the Emirates. � Richard Calver - www.matchdayimages.com 1 Unai Emery apologised to a Brighton fan after kicking a water bottle into the crowd WATER PALAVA Unai Emery could be seen talking with fans with a steward next to him, while other Brighton fans applauded him for his gesture. After the game he said: \"I kicked the (water) bottle. It wasn't hard but it touched one supporter .\" BRIGHTON 1 ARSENAL 1 ARSENAL were held 1-1 by a spirited Brighton at the Amex. Pierre Emerick-Aubameyang's 15th goal of the season was scrubbed out by Jurgen Locadia's first strike of the campaign to stop the Seagulls' rot after three straight defeats. Unai Emery apologises to fan after hitting him with water bottle after Arsenal draw at Brighton WHAT FORMATION? ALEX IWOBI seemed to not know what formation Arsenal were playing against Brighton as he replaced Mesut Ozil at half-time. Iwobi replaced Ozil in midfield at half-time and the Nigerian international was captured on television cameras asking team-mate Granit Xhaka what formations Arsenal were playing. SAGN STAY BACARY SAGNA has signed a one-year contract with Montreal Impact. The 35-year-old spent last season with the MLS side and was expected to leave after his contract ran out. MOST READ IN FOOTBALL \"conned the ref' Mo Salah facing Arsenal and Man City ban after\" dive' against Newcastle Exclusive MAX OUT Tottenham plotting £ 15m bid for Norwich City star Max Aarons League won Sunderland attract third biggest crowd in English football in stunning turnout Xmas turkies Pep Guardiola cancelled Christmas and then saw City's title hopes stuffed Can't teach an Ole Pog new tricks? Solskjaer hails rejuvenated Pogba as United win again Highlights SUN GOALS Watch Boxing Day highlights as Liverpool extend lead and City lose at Leicester Pictured Don't Roo know who I am? Rooney searched by Old Trafford security ahead of Boxing Day clash \"Fuming right now' Chelsea fans rage at Callum Hudson-Odoi being subbed off HENRIKH ADDS TO INJURY PLIGHT HENRIKH MKHITARYAN has fractured a metatarsal in his right foot and is expected to be out of action for six weeks. It is understood the Arsenal playmaker, 29, sustained the injury in a challenge with Lucas Moura in the Carabao Cup clash at the Emirates last Wednesday. RAM CHARGES LESS AARON RAMSEY has revealed that he wants £ 9m-a-year when he leaves Arsenal next summer - less than the deal the Gunners withdrew. The Welsh midfielder has been linked with heading Juventus or Bayern Munich when his contract expires. ARSENAL FAVOURITES TO LAND <mark>CAHILL</mark> ARSENAL are shock favourites to land Chelsea outcast <mark>Gary Cahill</mark> in January. <mark>Cahill</mark>, 33, has played just seven times this season, including just once in the league, with the Gunners in need of reinforcements. DUNK WOE IS GUNNERS BOOST BRIGHTON will not be able to appeal Lewis Dunk's sending off against Bournemouth -, meaning he will be suspended against Arsenal. Dunk was sent off for two bookings - the first for a case of mistaken identity - but rules only allow appeals for straight reds. Brighton 1-1 Arsenal - Jurgen Locadia cancels out Aubameyang's early strike as the Gunners are held at the Amex Comments Topics Football Arsenal"}, {"articleID": "2016092609_00326835_W", "names": {"Mark Evans": ["Q12795898", "Q14946841", "Q16194528", "Q16210885", "Q20090670", "Q358208", "Q43006927", "Q46585872", "Q57561127", "Q59219170", "Q6767546", "Q6767547", "Q6767549", "Q6767552"]}, "date": "2016-09-26", "url": "http://tvtechnology.com/thewire/joystick-audio-to-exclusively-represent-prism-sound-and-sadie-in-benelux/7030/view", "content": "Joystick Audio To Exclusively Represent Prism Sound and SADiE in Benelux 9/26/2016 5:03:00 AM By Sue Sillitoe, White Noise PR Acclaimed pro audio manufacturer Prism Sound has appointed Joystick Audio as its exclusive distributor in Benelux. Established 15 years ago by Raf Lenssens, Joystick Audio provides the Benelux market with access to high-end equipment and services from pro audio manufacturers such as CEDAR, PMC Monitors, Solid State Logic and Crane Song. As well as acting as a sales outlet, the company also offers support, consultancy and project engineering for the studio and broadcast industries. \"Our manufacturing partners all deliver added value in terms of functionality or extra features,\" says RAF Lenssens. \"The people behind the products are just as important as the equipment because good communication on a technical level is vital in our industry .\" The company will now represent Prism Sound's entire recording and post production portfolio including its flagship ADA-8XR multichannel converter and its Award-winning range of audio interfaces such as Lyra, Titan and Atlas. Joystick Audio will also represent all SADiE products including SADiE 6 software, which brings SADiE's high-end DAW editing capabilities into the computer environment. \"Prism Sound and SADiE offer superb products that are fully complementary with the other brands we represent,\" Raf Lenssens explains. \"Prism Sound's ADA-8XR converter is world-famous and the addition of products like Lyra and Titan to the company's range have opened up new possibilities for audio engineers to create high quality and highly flexible set-ups .\" Lenssens adds that SADiE was one of the first DAWs to enter the Benelux market and has long been the choice of many acclaimed engineers and studios, both for digital recording and mastering. \"The power and flexibility of its software make it a great choice for many different applications,\" he says. <mark>Mark Evans</mark>, Channel Sales Manager for Prism Sound and SADiE, says: \"We are delighted to have Joystick Audio representing our products and look forward to a long and profitable relationship with them. The company shares our no compromise approach to customer support and we feel that, with Joystick, our products and our brand are in safe hands .\" Joystick Audio is planning a number of special events over coming weeks to re-introduce customers in Belgium and the Netherlands to the Prism Sound and SADiE ranges. These will take the form of product demonstrations by Joystick Audio's product support engineers Mathijs Indesteege and Jules Fransen, which will take place in a real studio environment. The company is also supporting Prism Sound's Mic To Monitor event, which is scheduled for October 17th at the Abbey Road Institute in Amsterdam. For more information, please visit Joystick Audio's website at: www.joystick.be-ends-About Prism Sound Founded in 1987, Prism Sound manufacture high-quality professional digital audio equipment for the International broadcast, film, music production, manufacturing and telecommunications sectors. The company's product range includes the Prism ADA-8XR precision 8-channel converter unit, which is regularly used for music and film soundtrack projects by clients such as EMI Abbey Road, BBC, Sony, Lucasfilm and Walt Disney. Prism Sound also manufactures a range of audio test and measurement products, including the de facto dScope Series III audio analyser system. For more information: www.prismsound.com"}, {"articleID": "2020031915_00249623_W", "names": {"Thomas Reilly": ["Q47540764", "Q57596686", "Q7793467", "Q7793469"]}, "date": "2020-03-19", "url": "http://www.burytimes.co.uk/news/national/18318932.uk-holidaymakers-face-stranded-weeks-due-coronavirus-shutdowns/", "content": "News National News UK holidaymakers face being stranded for weeks due to coronavirus shutdowns By Press Association 2020 An airplane flying 0 comment Hundreds of thousands of UK tourists could be stranded overseas for weeks as airlines ground planes and countries close borders due to the coronavirus. Holidaymakers in destinations such as Peru and Morocco are facing immense difficulty and cost to return home. Foreign Secretary Dominic Raab said it was \"very difficult\" for people to get out of those countries. He told the Commons' Foreign Affairs Committee: \"The challenge there is to make sure, first of all, the governments of those countries keep a route so British nationals can get out .\" Mr Raab said there were between 300,000 and \"closer to a million\" British nationals travelling abroad. \"That is a massive, massive scale,\" he admitted. Many airlines have started grounding the majority of their aircraft due to demand collapsing. ✈ ️ ✈ ️ ✈ ️ FLIGHTS UPDATE ✈ ️ ✈ ️ ✈ ️ @ TSAReilly ⚠ ️ ⚠ ️ ⚠ ️ All special flights departing from #Morocco???? to the #UK???? are scheduled for today. There will be no other flights after midnight tonight 0 ⃣ 0 ⃣:0 ⃣ 0 ⃣?? ⚠ ️ ⚠ ️ ⚠ ️ pic.twitter.com/hVaGGNGH0U--UK in Morocco (@ UKinMorocco) March 19, 2020 Peru has implemented a state of emergency, with a travel ban and curfew, leading to UK nationals expressing fear they will be unable to leave. Kasey Butler, from Oxford, wrote a message on Twitter stating that she was \"stranded\" in the capital Lima. She said the British embassy was closed and her hostel \"isn't letting us leave our rooms\". \"Peru is great but I'm ready to leave,\" she added .?? IMPORTANT Avianca is considering a charter flight to London. Please review the information below and register your interest into this form, before Thursday 19th, 8.00 hours ➡ ️ https: //t.co/FtXCd4pzPI pic.twitter.com/LrUNICTeqF--UK in Peru???????? (@ UKinPeru) March 18, 2020 The embassy posted a message stating that Colombian airline Avianca was considering operating a charter flight from Lima to London this weekend, but warned that tickets for the one-way trip were \"likely\" to cost between 3,000 and 3,500 US dollars (£ 2,600 to £ 3,000). Tourists in Morocco face a race against time to get home as the country is closing its airspace after Thursday. Bob Warburton, 62, from Manchester, told the PA news agency that the situation at Agadir airport was \"chaos\" , with hundreds of UK holidaymakers waiting for flights. He explained that he and his wife were unable to contact Ryanair, who they were booked to fly back with, and described the airline as \"appalling and negligent\". The pair eventually paid a £ 100 taxi fare to travel to Marrakech airport, where they were able to book themselves onto a flight. <mark>Thomas Reilly</mark>, the British ambassador to Morocco, said: \"It is chaotic. There is no way that evacuating over 85,000 people in less than a week was ever going to be anything other than chaotic .\" I am sorry. It is not just the UK which is bringing its citizens home. Every other nation is trying to as well. We are all doing our best. \"Grant Gibson, 65, from Lyminge, Kent, is stuck with his wife in Northern Cyprus, where a state of emergency has been declared. The pair were scheduled to return to the UK last week but were among the guests at the Salamis Bay Conti Hotel put into quarantine due to the coronavirus. We are asking @ DominicRaab about the @ foreignoffice's response to the #coronavirus outbreak. Watch live here: https: //t.co/9QOK686bOx pic.twitter.com/YXBZwGqcoz--Foreign Affairs Committee (@ CommonsForeign) March 19, 2020 Mr Gibson said:\" They've closed all the crossing points to British nationals so we're waiting to find out from the British embassy how they're going to get us out of here. \"Given that all the other tourists on the island went yesterday (Wednesday)--that was the cut off, curfew time--then I would expect that they'll be keen to get rid of us .\" The Foreign and Commonwealth Office (FCO) is advising travellers in Spain to return home before March 24 as the Spanish government has ordered all hotels to close from that date. Mr Raab told the committee the Government was asking airlines to operate flights on routes they did not normally serve, which \"takes some configuring\". He said any spare seats on rescue flights would be offered to other countries trying to bring their citizens home. He explained: \"We also want to be able to pick up the phone and say\" By the way, if you have any spare room can you help get the Brits out?' \"0 comment"}, {"articleID": "2019121515_00194534_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-11-21", "url": "http://www.gamereactor.eu/age-of-empires-iv-on-consoles-isnt-a-definite-no/?sid=3faa201744c825825ab21a08306c2896#comments", "content": "Age of Empires IV Age of Empires IV on consoles isn't a definite no Microsoft's Shannon Loftis and Adam Isgreen both said that PC was the main focus, but we may still see it on consoles. 2019-11-21 16:00 <mark>Sam Bishop</mark> The majority of Age of Empires players will be used to experiencing strategy games like this on the PC, but when Stevivor spoke with Microsoft's Shannon Loftis and Adam Isgreen at X019 last week, they didn't rule out the possibility of console gamers getting Age of Empires IV. \"It's hard, as a PC game,\" Loftis said. \"We want to make it great on PC. But then, I think the whole concept of platform is about to change with Xbox .\" \"We are working hard to make sure to visualize all the different ways that people are going to want to experience Age [of Empires]. But our number one priority is to make it work great with keyboard and mouse .\" \"We're going to explore our options,\" Isgreen added. \"Once we have our wonderful PC game, then we'll start looking at other ways that we can show up .\" We also found out earlier this month that microtransactions won't be in Age of Empires IV, and the X019 event gave us a full reveal of the newest entry in the strategy series. Would you play Age of Empires IV on console? You watching"}, {"articleID": "2017070620_00660484_W", "names": {"Tom Walsh": ["Q16886418", "Q19586386", "Q19664158", "Q20984602", "Q21061744", "Q2440190", "Q37380700", "Q55362473", "Q7817978", "Q7817979", "Q7817980"]}, "date": "2017-07-06", "url": "http://au.news.yahoo.com/a/-/world/36294146/improved-walsh-second-in-lausanne-shot-put/", "content": "NZ Newswire on July 7, 2017, 6:10 am Share Tweet Whatsapp Email Share Improved <mark>Walsh</mark> second in Lausanne shot put - Yahoo7 Pinterest Tumblr New Zealand's <mark>Tom Walsh</mark> has unleashed a season-best throw at the Diamond League meet in Lausanne but it wasn't enough to topple American arch-rival Ryan Crouser. Olympic bronze medallist <mark>Walsh</mark> placed second with an impressive 21.97 m while compatriot Jacko Gill was eighth in a 10-man field with his 20.70 m effort. <mark>Walsh</mark> was happy with his best distance of the year by 17cm, achieved with his opening throw, as he builds towards the world championships in London in August. It was just 24cm short of his personal best and 26cm longer than his previous Diamond League meet effort in May, when he was also beaten by Crouser at the Prefontaine Classic in Oregon. <mark>Walsh</mark> admits Olympic champion Crouser is throwing at a different level after the American won on Thursday with a 22.39 m heave. Four of his throws were better than the Kiwi's best effort. \"I train a lot with Ryan and he almost always is ahead of me,\" <mark>Walsh</mark> said. \"I need to turn the table at some point in time. Who knows? I may do that at the biggest stage .\" Former world junior champion Gill wasn't at his best, having achieved a career-best 21.01 m in January, which was enough to qualify for the world championships. Gill saved his best distance until last after failing to better 20.36 m through his first five throws. Share Tweet Whatsapp Email Share Improved <mark>Walsh</mark> second in Lausanne shot put - Yahoo7 Pinterest Tumblr"}]