[{"date": "2017-03-29", "url": "http://www.msn.com/en-us/music/news/calvin-harris-teases-pharrell-ariana-grande-young-thug-collab/ar-BByYI1c?srcref=rss", "content": "© Evan Agostini Calvin Harris arrives at the Vanity Fair Oscar Party on Sunday, Feb. 26, 2017, in <mark>Beverly Hills</mark>, Calif.. The next single from electronic dance music star Calvin Harris, \"Heatstroke,\" will feature rapper Young Thug, R & B pop star Ariana Grande, and cross-genre artist Pharrell Williams. Harris revealed the line-up in posts to his social media accounts; Twitter and Facebook updates also featured an expanded credits list for the upcoming single. The Scottish DJ and producer shot to fame with a series of singles taken from his third album, 2012's \"18 Months,\" and in 2016 released singles \"This Is What You Came For\" (featuring Rihanna,) \"Hype\" (with Dizee Rascal,) and \"My Way,\" for which provided vocals. February 2017 saw him release \"Slide,\" which had Frank Ocean and rap group Migos guesting. It was released two days after a similar social media announcement. CALVIN HARRIS / / YOUNG THUG / / PHARRELL / / ARIANA GRANDE pic.twitter.com/9Ups0Eu53O--Calvin Harris (@ CalvinHarris) March 28, 2017", "articleID": "2017032910_00732878_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2017-03-29", "url": "http://origin.thehollywoodgossip.com/2017/03/the-real-housewives-of-beverly-hills-season-7-episode-17-recap-w/", "content": "Did Dorit take cocaine with her gal pals at Lisa Rinna's party? That was one of the more pressing questions on The Real Housewives of <mark>Beverly Hills</mark> Season 7 Episode 17 as the bickering between the ladies hit crazy new heights. Watch The Real Housewives of <mark>Beverly Hills</mark> Season 7 Episode 17 Online When the episode got underway, the ladies were still going at it, with Dorit turning on the water works to claim she was not the type of person Rinna tried to imply. \"Rinna just gets so upset that you just don't know what she's going to pull out of that bag of hers, but it's going to be one sharp dagger,\" Kyle Richards said to the camera. \"I saw what I saw, and that behavior speaks pretty loudly,\" Rinna said to the camera. The next day, Lisa Vanderpump decided to play peacemaker and visited Rinna to say she felt she was horrible to Dorit. Vanderpump invited Rinna to a wine tasting at her house to see if she and Dorit could make things right with each other. \"Maybe she could apologize to Dorit because she's really been kind of a bitch to her, to be honest,\" Vanderpump said to the camera. While Rinna escaped to Philadephia for a work commitment, the other ladies embarked on a shopping trip, but Eden's strange behavior continued. Eden decided to latch on to Erika and tried to buy her a friendship ring. \"I don't understand why you're buying me this ring,\" Erika said, confused. \"Because I love you!\" Eden screamed back. \"Just say thank you, and' I love you, too .'\" Yeah, there's something odd about the way Eden tries to make nice with the ladies. The 9 Richest Real Housewives in Bravo History Start Gallery Some time later, Erika, Eileen, and Kyle met for lunch. Erika wanted to apologize for the way she behaved towards Eileen. \"I'm sorry that I had a meltdown on you at the table. I apologize. It has nothing to do with you. I was stressed out, and those words are very sensitive to me, so I had a meltdown,\" she said. \"I was tired, and I was exhausted from that fight [with Dorit] and from trying to take the high road--and then I took the low road,\" Erika giggled. \"I'm not sure that Dorit is sincere,\" Erika said. \"I'm not sure that either she or PK understand what they've done .\" Meanwhile, Dorit met with PK and told him about the cocaine claims. He called her \"schizophrenic\" before taking aim at Erika. \"I'm not calling her husband!\" he said. \"She should call her husband because she doesn't see him very often. Check in .\" How you doing, Tom?' It's been six months. \"Is it just us, or does PK seem like someone who is stuck in high school? Grow the eff up. Real Housewives All Stars: Who Should Be Cast? Start Gallery Lisa Vanderpump's lavish party finally arrived, and the ladies struggled to stick to the dress code. Apparently, red, pink and diamonds were part of the dress code. That's a typical LVP party right there. Vanderpump noticed Dorit was acting strangely. Dorit revealed the tension amongst the group of ladies was getting to her. Surprisingly, there was no cliffhanger. Everything seemed to go well, but there's still one more episode left this season for all the drama to go down. What do you think will happen? 19 Real Housewives Who Only Lasted One Season Start Gallery Edit Delete Share Tweet Email", "articleID": "2017032911_00444656_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2017-03-29", "url": "http://www.scout.com/college/usc/story/1766938-so-what-about-this-2nd-team-enhancing", "content": "Not quite midway through spring practice, Clay Helton made an interesting call Tuesday. Focus on the second team. Coach 'em up. Get 'em better. Get 'em ready to go. They're going to be needed. Smart stuff. For this USC team, these coaches and these players, especially these young players. USC will need them, if for no other reason than a 12-game, no-bye-until-the-last-week regular season. But that bye-less schedule is just the first challenge, but maybe not the first reason to do this. It just makes sense. This USC team is actually getting younger, at least in the numbers of guys who will be on the field in the rotation as a percentage of the game participants. When you look at position groups like the O-line, the wide receivers, the linebackers, the D-line even. there was more experience, although maybe fewer players, on the field. The major reason to do this, as we see it, is to get more guys ready to go from the get-go. Right now. Thursday. And Saturday. And the rest of the spring, summer and when fall gets here. \"The best players play,\" Clay said when the talk Tuesday came around to one of those maybe-no-longer-second-team guys--early entry freshman Marlon Tuipulotu who is one of the \"best players\" playing with the first team now after starting out with the twos a couple of weeks ago. That's the kind of second-team focus and \"enhancing\" this team has to be all about. While at least one media person was questioning what kind of message this sends to the upperclassmen when you elevate a freshman, one who should still be thinking about the prom to first team replacing the likes of a married 25-year-old Stevie Tu'ikolovatu, Clay was saying the message was a simple one. Especially when he said it again: \"This is USC...the best players play .\" Not sure there's a better message a coach can deliver--as long as he delivers on it. And not to attempt a return to a decade ago, but it was by far the best thing Pete Carroll communicated in building the nation's best college program when he was here. Because you can't do that unless you coach them up to compete every day. At every position. For the right to be next in line. It's a new way of thinking for this Trojans program coming out of the dark roster days of the NCAA sanctions when just finding enough players who could play at the elite level USC needed them to perform at was all that mattered. Only 12 available defenders to upset a No. 4 Stanford team the first time Clancy Pendergast was here. Well, that would have to be enough. Only the game isn't played that way any more most of the time. Most teams do not slow things down. So the guys USC coaches up on the second team can figure on playing in the rotation when it matters. Which is why Clay's call matters. Why it makes so much sense to come right out and say it. Because as much as Marlon's elevation sends a message, so do Clay's words. And we get the sense they're listening. There are lots of young Trojans who can see themselves making a move--if not onto the first group, into that second group that will play. Because the talent is there. Let's go down the list here position group by position group, starting with defense: *** Outside linebackers: When the two second-teamers you start with are Oluwole Betiku and Connor Murphy, you are not really talking second-teamers. You're talking in-the-rotation guys with Uchenna Nwosu and Porter Gustin. It does not get any better than this. Then there's senior Olajuwon Tucker who can fill in both inside and out. *** Inside linebackers: We've already seen it happen here. With Cam Smith coming down with a stiff neck Tuesday, sophomore Jordan Iosefa stepped in seamlessly from his backup spot. Next to him is early entry freshman Tayler Katoa, whose athleticism will have to make up for his lack of linebacker experience. Which is why he's a target of what Clay is talking about. *** D-Line: With Rasheem Green already in the mix with Marlon, and Kenny Bigelow on the way, the challenge is there for Josh Fatu, who showed some ability to find a spot for himself last fall, along with Malik Dorton and Christian Rector, who did the same, along with two who haven't yet made that move--Jacob Daniel and Liam Jimmons. There's room here for one, two or three of them. It's just for them to make the move. *** Secondary: Here may be the focal point for this whole deal with redshirt freshman star-in-waiting safety/nickel Jamel Cook showing up the way he has going back from second to first team with so much impact. Wherever he spends most of his time, with Ajene Harris battling for that spot, Jamel and his guys will be in a bit of the spotlight. And the numbers are big here for the backup bunch: Ykili Ross, Isiah Langley, Jonathan Lockett, Matt Lopes and C.J. Pollard. The challenge here is not so much the talent or the numbers but getting this group up to speed to communicate and play as fast as the first-teamers. *** Quarterbacks: Perfect timing here for Matt Fink to have his best day as a Trojan in his second spring Tuesday. He threw it, ran it and controlled things in ways we haven't seen. And behind him is a talented early entry freshman Jack Sears who on one play, one adjustment on a throw over two defenders into the deep corner of the end zone, showed he's coming on. USC has to get this right because for all sorts of smart reasons including this one: USC is going to have to protect Sam Darnold--in games and in practices. And someone else is going to have to be out there. *** Running backs: This spring has made it clear how much the next guy in line matters here and with Aca'Cedric Ware and Dominic Davis mostly unavailable, the ball has bounced to redshirt freshman Vavae Malepeai who has stepped up in a big way. The focus is working here. And then Reuben Peters has shown he can do more than block at fullback. And James Toland is back. So get everybody healthy here and find ways to incorporate Ced's toughness and Dom's speed with Vai's knack of making things happen. A lot to work with here for Deland McCullough. *** Tight end: Cary Angeline, we're talking about you here. With some two-tight-end sets for Daniel Imatorbhebhe and Tyler Petite, until the freshman recruits get here, Cary will be it for scholarship tight ends on the second team. Should be able to get plenty of one-on-one coaching from <mark>John Baxter</mark>. *** Wide receivers: This is the position many think Clay is talking about with the number of young talents trying to step up to the place where JuJu Smith-Schuster, Darreus Rogers, De'Quan Hampton and Isaac Whitney, maybe even Adoree' Jackson, vacated. Lots of room here. Deontay Burnett, Jalen Greene, senior <mark>Steven Mitchell</mark> after his rehab and <mark>Michael Pittman</mark> can't take every rep. So there it is for Josh Imatorbhebhe, Tyler Vaughns, the recently switched Pie Young and when he's rehabbed, Trevon Sidney, to make the kind of leap redshirt freshman Velus Jones has made this spring. \"We'll only go as far as they take us,\" Clay said Tuesday. He was talking about the whole group not just the second-team guys. But for this group, it's sometimes hard to tell the difference. But lots of work for Tee Martin here. *** O-Line: The jumble here, with veteran starters Nico Falah and Toa Lobendahn out right now, makes it not so obvious where the line is between the first and second groups. So except for Chuma Edoga and Viane Talamaivao, you could consider all these players in pretty much the same boat from current first-teamers <mark>Chris Brown</mark> and Roy Hemsley, as they switch sides and from guard to tackle, to early entry freshman Andrew Vorhees who has made a big impression, to Cole Smith getting his big chance at center with the ones to <mark>Frank Martin</mark>, also at center, to Clayton Johnston and Jordan Austin, there are a bunch of folks in play here for Neil Callaway to get in line before the rest of the freshmen get here this summer. By our count, that's 36 players who could qualify for the \"second group\" guys Clay is talking about coaching up. And that's not counting the two or three walk-ons every year who matter. That's a number we're not used to seeing, as we've said. And it's why we like the way Clay singled out this group--larger, younger, more talented than we're accustomed to--as an emphasis the rest of the way. Good call. You can follow me on Twitter at @ dweber3440 or email me at weber @ uscfootball.com. Why join? Not a subscriber? Sign up now to get all the great information in the War Room, access to the Peristyle and all of the premium stories on USCFootball.com! Click here to subscribe! #USCSpringBall 17", "articleID": "2017033003_00483754_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "Frank Martin": ["Q16196582", "Q16732054", "Q5488199", "Q5488201", "Q57832692"], "John Baxter": ["Q15485269", "Q18530105", "Q19609695", "Q20675962", "Q43344980", "Q53844090", "Q56072460", "Q6221148", "Q6221150", "Q6221154"], "Michael Pittman": ["Q3308458", "Q54257480"], "Steven Mitchell": ["Q433597", "Q55362739"]}}, {"date": "2017-03-31", "url": "http://dcist.com/2017/03/will_ferrell-themed_pop_up_bar_is_c.php", "content": "Will Ferrell-Themed Pop Up Bar Is Coming To H Street (Really) by Rachel Sadon in Food on Mar 31, 2017 4:46 pm Note: we're not sitting on a throne of lies here, April's Fools (observed) be damned. A new pop-up bar is coming from a group of people who love Will Ferrell as much as Ron Burgundy loves scotch. New York's famed Stay Classy Will Ferrell-themed tribute bar has taken its show on the road, with plans to open for at least a month on H Street NE starting in May. That means you can soon be sipping a glass of You're My Boy Blue, Smelly Pirate Hooker, A Whale's Vagina, or Glass Case Of Emotion while a Ron Burgundy impersonator bellows from behind an Anchorman desk. \"It's such a happy environment--people come and have a blast,\" says Stay Classy co-creator Zach Neil. \"It's like the fun bus has rolled into town .\" There are plenty of Elf references, but Neil and his partners are true Ferrell aficionados and you can expect some deep cuts and kitsch going all the way back to his SNL days. Given an official launch date on Cinco de Mayo, Neil notes it is the perfect opportunity to get in references to Casa de Mi Padre (one my personal favorites). They're even thinking about bringing in a live mariachi band. Unlike the original, Stay Classy's D.C. outpost will also offering food--giant, over-the-top burgers. The Ma's Meatloaf burger (a Wedding Crashers reference), for example, will see a toasted brioche bun brushed with honey garlic butter and then topped with a seasoned fried potato cake, two cuts of meatloaf, smoked cheddar cheese, tomato chutney sauce, and crispy onions straws. And they're flying in one of the nation's premiere Ferrell impersonators from Minnesota to sit behind a Channel 4 news set and read the \"news\" (read: half-priced shots). After a decade working in the music industry, Neil got involved in the bar and nightlife scene--owning a club in Pennsylvania and becoming a partner at a bar in Times Square. But at some point, he realized that most bars fall into predictable tropes--sports bars, Irish pubs, rowdy taverns--that are charging as much for cocktails as an entire bottle of liquor. \"There was nothing going on in the bar world that would make anyone my age want to go to a bar. So I thought, what if I just opened something I'm interested in,\" Neil says, and there are few things that give him greater joy than Will Ferrell movies. \"I tried to think of something in my life, no matter how bad my day was, something that could consistently cheer me up. Enter Buddy the Elf, Chazz Reinhold, Jacobim Mugatu, and Ricky Bobby. Neil thought to himself:\" Either it would the dumbest thing I've ever done, or it would fail miserably but I'd have a really great story...if I lost my money at least I'm doing it over the top and ridiculous .' After a bit of a slow start (he says the first few weeks were \"crickets,\" with bartenders making $4 in tips a night), word got out and there were soon lines around the Lower East Side location stretching for hours. They wound up staying for 14 months, closing only once interest started to wane. He's since turned to other concepts in New York, like a Tim-Burton themed bar called Beetle House, and taken Stay Classy on the road. They've brought the concept to Los Angeles and are settling in for a 10 day stay in Boston before heading to our fair city. But although D.C. once played host to an entire Anchorman exhibit, the District wasn't originally on Neil's radar. \"Ever since they elected <mark>Donald Trump</mark>, I didn't want to go near D.C.,\" he says. The owner of Mythology, a newly opened restaurant on H Street NE, actually gave the team a call and invited them to set up shop in a lounge space. Neil had a change of heart, realizing the Washingtonians need a dose of laughter more than anyone else. \"I was like, D.C. of all places needs some cheer and fun in their life. Let's come in to town and bring some cheer .\" Stay Classy is set to have a soft opening on May 3 and an official launch on May 5 at Mythology (816 H Street NE); it will stay open for a month, though they may choose to extend it. The bar will be first-come, first-served, but they plan to take reservations for dinner. More details will be available next week. Contact the author of this article or email tips @ dcist.com with further questions, comments or tips.", "articleID": "2017033121_00025463_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-04-02", "url": "http://www.startribune.com/sports/gophers/417882973.html", "content": "GLENDALE, ARIZ.--North Carolina's <mark>Roy Williams</mark> was the only coach in the Final Four that had been there before--and his program has an NCAA record 20 appearances in the national semifinals. That type of experience and tradition made the Tar Heels the clear favorite Saturday over Oregon, but it took them until late in the first half to wake up and play like a potential champion. Trailing by eight points in the first half, North Carolina was shooting just 25 percent from the field. The only reason it wasn't getting blown out was because of the play of Kennedy Meeks, who finished with 25 points and 14 rebounds. And Meeks' offensive rebound on a missed free throw in the closing seconds eventually helped the top-seeded Tar Heels barely escape with a 77-76 victory over No. 3 seed Oregon to advance to their second straight NCAA championship game. \"If it wasn't for Kennedy Meeks, we wouldn't have been in the basketball game,\" <mark>Williams</mark> said. \"It's a dream come true to get there. Now we've got to play better .\" Tyler Dorsey's three-pointer followed by a layup from <mark>Keith Smith</mark> cut it to 77-76 with seven seconds left in the game. Meeks missed two free throws with 5.8 seconds left, but Theo Pinson tapped the ball out to put his team on the line once again. David J. Phillip & #x 2022; Associated Press Oregon forward Jordan Bell fought for a rebound with North Carolina guard Stilman White during the first half. Joel Berry clanked the front end of a 1-and-1, but Meeks was there for the clutch carom to seal it. <mark>Williams</mark> will be vying for his third national title and first since 2009 when North Carolina (31-7) plays Gonzaga on Monday night. Jackson also had 22 points for the Tar Heels. \"We're moving on,\" said Jackson, who finished with 22 points. \"We'll get back in the gym tomorrow and probably work on a lot of free throws, but we're just happy to move on .\" Dorsey finished with 21 points and Dylan Ennis had 18 points for the Ducks (33-6), who were making their first Final Four appearance since 1939. That's when they won the inaugural crown. An all-West Coast final would've been intriguing. But Oregon was playing from behind after leading early. Meeks' dominance in the post kept his team within striking distance before a late surge helped the Tar Heels take a 39-36 lead into halftime. Meeks had 14 points on 6-for-7 shooting in the first half, while the rest of his team shot just 8-for-28 from the floor. Dorsey had just four points on 0-for-4 shooting in the first half. All-American Dillon Brooks wasn't that much better with just six of his 10 points on 2-for-7 shooting and four of his team's 12 turnovers by halftime. The Ducks stayed in the game by winning the rebounding battle early. Even without 6-10 center <mark>Chris Boucher</mark> (knee injury) in the NCAA tournament, they were tough to keep off the glass because of double-double machine Jordan Bell. Bell finished with 13 points and 16 rebounds. But he needed help battling in the paint Saturday. The Tar Heels' size eventually gained them the edge on the boards. The top rebounding team in the nation finished with 19 second-chance points on 17 offensive rebounds Saturday. Meeks opened the second half scoring twice on offensive rebounds, including an emphatic putback dunk. But he went to the bench with three fouls at 14:44. The Ducks, though, failed to take advantage of his absence. They couldn't stop Jackson. Jackson scored eight straight points during one stretch. After a few minutes, Meeks returned and immediately made his presence felt. After a missed free throw, Pinson grabbed the offensive rebound and found Meeks for a layup to take a 66-56 lead. It was basically a two-man show Saturday, but North Carolina's run to a second straight NCAA title game wouldn't have been possible without sixth-man Luke Maye's jumper with 0.3 seconds left in a 75-73 win against Kentucky in the Elite Eight. That was a fitting way to advance since the Tar Heels suffered a heart-breaking loss in last year's national championship game on a buzzer-beating three from Villanova's <mark>Kris Jenkins</mark>.", "articleID": "2017040205_00471292_W", "names": {"Chris Boucher": ["Q30668441", "Q5105946"], "Keith Smith": ["Q15439635", "Q16105484", "Q16980993", "Q24451721", "Q3814340", "Q41782731", "Q43109906", "Q57541710", "Q6383947", "Q6385036", "Q6385038", "Q6385040", "Q6385041", "Q6385042", "Q6385043", "Q6385046"]}}]