[{"date": "2017-04-12", "url": "http://nymag.com/daily/intelligencer/2017/04/republicans-almost-lost-ks-because-no-one-likes-their-agenda.html", "content": "A worse way. Photo: Melina Mara/The Washington Post/Getty Images Last night, a pro-choice Democrat--who proudly aligned himself with a self-avowed socialist--almost won the House district where Koch Industries is headquartered. Back in November, Kansas's fourth district backed <mark>Donald Trump</mark> by 27 points, and then-GOP congressman (now, CIA Director) Mike Pompeo by 31. Five months later, Republican Ron Estes needed a visit from Ted Cruz, a robocall from the president, and an infusion of national money to secure a seven-point victory over the aforementioned Democrat, <mark>James Thompson</mark>, a Wichita civil rights lawyer who'd never held public office. That 24-point swing wasn't enough to shake the red off Kansas. But if Democrats can swing every congressional district by half that sum, they'll take back the House in 2018. Naturally, Republicans are eager to paint last night's vote as an anomaly--one that says less about their party's national liabilities than its local ones. Kansas's GOP governor Sam Brownback boasts a woeful 27 percent approval rating, thanks, in large part, to gaping holes in the state's budget. Ron Estes was Brownback's state treasurer. In other words: Estes wasn't just running as a member of an unpopular governor's cabinet, but as the one most closely tied to Brownback's biggest failure. If anything, the fact that the treasurer of a state with wrenching budget problems won at all is a testament to the Republican Party's vitality! This is fine! America is already great again! There are a couple problems with that story. To name the most obvious: The past three months have been replete with evidence that the Democratic base is highly mobilized. You can see it in the record-setting marches, town hall protests, massive traffic enjoyed by leftwing Facebook pages, the tight special election race in Georgia's sixth district, and in the $150,000 that the liberal blog, Daily Kos, convinced its readers to pony up for <mark>James Thompson</mark>'s long-shot campaign. But okay: Let's ignore all that. Let's stipulate that last night was all about Brownback. That would certainly offer vulnerable House Republicans short-term comfort. But in the long run, a repudiation of Brownback is just as--if not more threatening--to the Republican Party than a repudiation of Trump. Sam Brownback isn't unpopular for idiosyncratic, personal reasons. The governor didn't decimate his state's finances by spending public funds on sex workers; he did it by implementing the conservative movement's blueprint for utopia. Some readers may be familiar with the legend of the \"red state model,\" but for those who aren't, here are the Cliff Notes: The 2010 tea-party wave delivered Brownback to the Sunflower State's governor's mansion and Republican majorities to both houses of its legislature. Together, they passed massive tax breaks for the wealthy and repealed all income taxes on more than 100,000 businesses. They tightened welfare requirements, privatized the delivery of Medicaid, cut $200 million from the education budget, eliminated four state agencies and 2,000 government employees. In 2012, Brownback helped replace the few remaining moderate Republicans in the legislature with conservative true believers. The following January, after signing the largest tax cut in Kansas history, Brownback told the Wall Street Journal, \"My focus is to create a red-state model that allows the Republican ticket to say,\" See, we've got a different way, and it works. \"' The GOP's national leadership agreed: Voters should look to Kansas to see the Republican vision for the nation's future .\" This is exactly the sort of thing we [Republicans] want to do here, in Washington, but can't, at least for now, \"Senate Majority Leader Mitch McConnell said of Brownback's Kansas. And the supply-side nostrum undergirding the governor's economic model--that massive tax cuts for the rich will pay for themselves, via heightened economic growth (provided that you kick the undeserving poor out of their welfare hammocks)--is the same one on which all of <mark>Paul Ryan</mark>'s celebrated budgets are based. Of course, the GOP's\" different way \"didn't work. Instead of providing national Republicans with a winning advertisement for fiscal conservatism, it provided Kansas's government with giant revenue shortfalls, its economy with weaker job growth than neighboring states, and Brownback himself with one of the lowest approval ratings of any governor in America. For decades now, Republicans have been asking voters to trade pieces of their social safety net for stronger economic growth. Kansas took them up on that offer. It allowed its government to throw more than a thousand disabled Kansans off of Medicaid, cut millions from the state's university system, and, in some of its districts, shorten the K-through-12 school year. Here was their reward. No state economy has done worse over the last 5 years than right-wing paradise Kansas. https: //t.co/rWPjwqo17r pic.twitter.com/3AYsgQHMqZ--Bruce Bartlett (@ BruceBartlett) October 26, 2016 To say that Kansas didn't swing against the GOP because of Trump--but only because of Brownback--is to say that red America isn't souring on one particular Republican, but only on their party's entire economic philosophy. Last year, the Republican Party nominated a man who campaigned on a promise to deliver universal health-care, preserve Social Security and Medicare, and intervene in the free market to protect American jobs. Last month, Republicans in the Kansas legislature passed a bill to expand Medicaid in their state. President Trump has never been popular. But his approval rating began sliding in early March, right after <mark>Paul Ryan</mark> unveiled his plan to finance a large tax cut for the rich by throwing millions of low-income people off of their health insurance--an idea that enjoyed the backing of 17 percent of the electorate. Turns out Tea Party voters want more government healthcare spending, yet support <mark>Ryan</mark>'s healthcare bill. Go figure. https: //t.co/y77gXZHn6j pic.twitter.com/VT7W2FqDPC--Guy Kawasaki (@ GuyKawasaki) March 23, 2017 Path to Trump's base? Trump should NOT lower taxes on the wealthy--College whites: 74% Non-college whites: 69% https: //t.co/wPGAFETKBM pic.twitter.com/FWbVGxldRt--Will Jordan (@ williamjordann) March 8, 2017 These are not coincidences. They are testaments to the GOP's fundamental weakness, the one that they need gerrymandered districts, voting restrictions, fraudulent promises, defamatory conspiracy theories, and increasingly garish appeals to white racial resentment to compensate for: Republican voters no longer want to buy what misanthropic billionaires pay their leaders to sell them. Not even in the Koch brothers' backyard.", "articleID": "2017041216_00231505_W", "names": {"James Thompson": ["Q16324360", "Q19666426", "Q2031218", "Q21457741", "Q25413093", "Q2740371", "Q3806742", "Q41446776", "Q51587826", "Q54833499", "Q55863509", "Q55937953", "Q58323221", "Q58332042", "Q6133231", "Q6144184", "Q6144186", "Q6144196", "Q780129"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2017-04-12", "url": "http://www.dailystar.co.uk/showbiz/605125/Jess-Impiazzi-bum-Ex-on-the-beach-Jog-on-to-cancer", "content": "WENN TV BABE: Jess found fame on Ex On The Beach The Ex on The Beach babe is known for her toned frame, regularly stripping off via both social media and magazine deals. But on Wednesday night the star managed to leave us lost for words again. Not only did she looked flawless as she arrived at James Ingham's Jog On To Cancer event in central London, but she also added a cheeky slice of sass to her outfit. WENN CHEEKY: Jess exposed her bum in the dress Celebrities in see through dresses Tuesday, 4th April 2017 These celebrities just love the \"naked' dress look. From net dresses, to completely see through, here are some of our favourite naked looks. 1 / 170 Getty Images Savannah Chrisley underwear in see-through gown FAMEFLYNET SNAP: Lizzie arrived in a similar dress Mirroring former WAG Lizzie Cundy by rocking a sheer dress, the MTV star left ditched both her bra and underwear for maximum effect. Jess completed the look by wearing her hair tied up in a high ponytail. Proudly posing up a storm, Rogan O'Connor's ex turned up the heat by turning her back on the eager cameras to reveal her perky rump. And we don't just mean she was teasing it. INSTAGRAM TEASE: Jess sexes up a storm on her social media Jess Impiazzi strips off Monday, 17th October 2016 Reality TV babe Jess Impiazzi flaunts her incredible figure 1 / 112 No, the leotard section of Jess's dress rode up so high it had about as much--or little--material as a thong. But don't get any ideas lads. The model is happily engaged to rugby ace Denny Solomona. INSTAGRAM GOING STRONG: Jess and Denny are still together The couple are thought to be stronger than ever after initially splitting in the first half of 2016, only to get back together a few months later. Talking about the split, Jess told The Daily Star:\" Denny and I broke up at the beginning of the year, which has been quite hard because we bought a place together. \"We were only dating for about six months .\" I've not really met anyone since and that's really had an effect on my heart. \"Related articles\" Drinking Jack til I fell asleep' <mark>Stephanie Davis</mark> drops surprise song Casey Batchelor shows off her ever growing assets in plunging display Lizzie Cundy forgets her knickers in boob and bum exposé", "articleID": "2017041220_00862572_W", "names": {"Stephanie Davis": ["Q6134141", "Q7608260"]}}, {"date": "2017-04-14", "url": "http://www.610kvnu.com/world/dea40aa8c177bb9f3de5d152e1828b17", "content": "Analysts identify #SyriaHoax as Russian-fueled propaganda Posted just a moment ago the_guitar_mann / iStock/Thinkstock (NEW YORK)--As Syrian president Bashar al-Assad called videos of last week's chemical attack a \"fabrication,\" a piece of propaganda promoted by a Russian cyber operation and bearing the hashtag #SyriaHoax has gained traction in the United States, analysts tell ABC News. Following the chemical weapons attack that killed dozens of civilians on Tuesday, Al-Masdar News, a pro-Assad website based in Beirut, published claims that \"something is not adding up in [the] Idlib chemical weapons attack .\" Its author cited \"holes\" in the accounts provided by the \"Al-Qaeda affiliated\" White Helmets leading to the conclusion that \"this is another false chemical attack allegation made against the government .\" That hoax story was promoted by a network of Russian social media accounts and ultimately picked up by popular alt-right personalities in the United States, including Mike Cernovich, one of the leading voices in the debunked \"Pizzagate' conspiracy theory. Cernovich popularized its new hashtag--#SyriaHoax--and sent it soaring through cyberspace. According to Trends24, within hours of the retaliatory missile strike President <mark>Donald Trump</mark> launched on Thursday night, #SyriaHoax was the No. 1 trending Twitter topic in the United States. J.M. Berger of The International Centre for Counter-Terrorism at The Hague, who studies propaganda and social media analytical techniques, said #SyriaHoax is\" a clear example of a Russian influence campaign \"designed to undermine the credibility of the U.S. government .\" The point of an influence campaign is to get people involved who wouldn't otherwise be involved, \"Berger said .\" A lot of people in the alt-right would not necessarily characterize themselves as being pro-Russian, but they're receiving influence from this campaign. \"Berger cannot say whether Al-Masdar News is backed by either the Syrian government or the Russian government, only that the outlet\" is being promoted at an extraordinary level by this [Russian] network \"and the Kremlin has a history of weaponizing disinformation .\" This is a new iteration of an old type of warfare, \"Berger said .\" We saw the Soviet Union use tactics like this during the Cold War. The difference is that you can do it on an industrial scale at a very low cost without deploying actual operatives on the ground of a foreign country. \"This latest social media coup comes just months after Russia's attempts to use similar tactics to meddle with the U.S. presidential election, which U.S. officials believe was undertaken by a secretive Russian intelligence operation based in St. Petersberg tasked with manipulating public opinion. Senator <mark>Mark Warner</mark>, the ranking Democrat on the Senate Intelligence Committee investigating those efforts, says a close examination of the evidence so far reveals a disturbing timeline running throughout the campaign. WikiLeak's release of Hillary Clinton campaign chairman John Podesta's Russian-hacked emails--just 29 minutes after The Washington Postpublished an explosive video showing <mark>Donald Trump</mark> making sexually explicit comments during an Access Hollywood shoot--raised particular concerns .\" That was more than coincidence, \"<mark>Warner</mark> said .\" It is so outrageous that a foreign nation came in and manipulated our news, hacked into personal information leaked it out on a selective basis. \"According to Ciaran Martin, the head of a newly created national cybersecurity operation at Britain's GCHQ, which provided U.S. officials with the first indication that the Russians had hacked the Democratic Party, activity like this hasn't slowed down since the presidential election in November. It's actually on the rise .\" I think we've seen a significant increase in Russian aggression in cyberspace over the past two years, \"Martin said .\" We see attacks from state actors on a very frequent basis...It has not plateaued. It is continuing to increase. \"<mark>John Carlin</mark>, the former assistant attorney general for national security and an ABC News consultant, said the U.S. has less than four years to find a way to protect its election process .\" They're going to come after us again in 2020, \"<mark>Carlin</mark> said .\" If anything it may be more severe...They're probably going to come back with more skill, more desire to cause impact, and between now and then, we need to make sure they don't succeed. \"Copyright © 2017, ABC Radio. All rights reserved.", "articleID": "2017041400_00207542_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Carlin": ["Q1231024", "Q15434040", "Q1898439", "Q33019263"], "Mark Warner": ["Q14949474", "Q1617921", "Q21166633", "Q453893", "Q51299121", "Q6770231"]}}, {"date": "2017-04-17", "url": "http://www.bordermail.com.au/story/4602458/land-deal-set-for-corowa-splash-park/?cs=4067", "content": "Federation Council administrator expected to ratify in-principle support for Corowa water fun park READY TO ROLL: Shaun Whitechurch with consortium members Stephen O'Bryan and <mark>John Fraser</mark> with plans for their water fun park to be built near Corowa's tennis centre. A PLAN for a privately-run water fun park at Corowa is set to get a major boost at Federation Council's meeting on Tuesday. Shire administrator Mike Eden should give in-principle support for the development to be located on council land in Riesling Street near the town's tennis club. The approval will be subject to a satisfactory management plan and lease deal between the shire and consortium of fun park investors. In her report recommending the move, Federation Council corporate and community services director Kristy Kay noted positive opinion for the plan. \"The proposal has generated much interest from the local community with 21 responses received,\" Ms Kay stated. \"Overall most people (19) were in support of the proposed development .\" Whilst only two responses were against the proposed development, they identified the location as being the main issue, citing reasons such as safety, cost for families, commercial viability and sustainability. \"Consortium spokesman Shaun Whitechurch welcomed the council's backing .\" From our point of view it's great that they are going to the recommendation and should it go through as presented the consortium can now put their whole development and plans to the council, so we can get the ball rolling, \"Mr Whitechurch said. He expected the group would be able to present a detailed blueprint to the council for consideration at its May meeting. The first stage of the fun park would involve three water slides, a mini splash pad, kiosk and barbecue area. A second leg is to include a putt putt golf course and an area for an animal farm to occupy in school holidays. Mr Whitechurch has not put a value on the aquatic project but it could be similar to the $350,000 spent on the Wangaratta splash park which replaced the Yarrunga pool. A valuation of the land to determine a rental figure will be required as part of the process .\" The consortium don't expect the lease for nix, they expect rent to be on commercial terms, \"Mr Whitechurch said. He admitted the group's original aim of opening by December 1 would be tight .\" Whilst having it ready for next summer is optimistic nothing is impossible if approvals fall into place relatively quickly, \"Mr Whitechurch said.", "articleID": "2017041714_00747013_W", "names": {"John Fraser": ["Q16090802", "Q16729089", "Q1700123", "Q17523755", "Q17523831", "Q19565408", "Q3181531", "Q43910851", "Q52732316", "Q6217676", "Q6234025", "Q6234043", "Q6234047", "Q6234049", "Q6234053", "Q6234056"]}}, {"date": "2017-04-18", "url": "https://vtdigger.org/2017/04/18/presentations-health-care-providers-cover-new-opioid-prescribing-rules/", "content": "News Release--Vermont Department of Health April 18, 2017 Media Contact: Vermont Department of Health 802-863-7281 BURLINGTON--The Vermont Department of Health is conducting a series of presentations for health care professionals about new rules governing opioid prescribing. Presentations will be held April 18 in Burlington and April 20 in Rutland, and a webinar hosted by the Vermont Medical Society will take place on May 17. The sessions are designed to educate the state's health care providers and prescribers about the requirements and public health policy for appropriate prescribing of opioids in treating acute pain. The new rules are scheduled to go into effect on July 1, 2017. The revision to the existing prescribing rules are intended to minimize opportunities for misuse, abuse, diversion, addiction and overdoses, by flipping the presumption that a patient needs opioids to manage pain, and by addressing appropriate quantities for initial prescriptions. \"These rules are a critical part of our efforts to create conditions where we can prevent opioid addiction from starting,\" said Health Commissioner <mark>Mark Levine</mark>, MD.. To bridge the varying prescribing practices and philosophies among Vermont's prescribers, the rules set new \"defaults' for prescribing for pain, and requires that doctors assess non-opioid and non-pharmacological treatments before opioids are prescribed. Providers will also continue to engage patients in their own treatment decisions, through education concerning the risks associated with taking opioids, safe storage and appropriate disposal of opioids. Dr. <mark>Levine</mark> said the new rules were approved by the Legislative Committee on Administrative Rules following an extensive process that included 19 meetings and a public hearing with patients, physicians, pharmacists, dentists, and other stakeholders. For more information about the April 18 and 20 in-person presentations and the May 17 webinar, visit: http: //www.vtmd.org/sites/default/files/OpioidPrescribingflyer.pdf See the Rule Governing the Prescribing of Opioids for Pain. For health news, alerts and information, visit healthvermont. gov Join us on Facebook Follow us on Twitter", "articleID": "2017041818_00208164_W", "names": {"Mark Levine": ["Q10321395", "Q1673135", "Q47999341", "Q6768525", "Q6768573"]}}, {"date": "2017-04-19", "url": "http://www.journal-news.com/sports/miami-lands-fourth-recruit-owens-first-class/R8zcoF2uXChdqcISMOfjcN/", "content": "0 Sports View Caption Hide Caption New Miami basketball coach <mark>Jack Owens</mark> was introduces himself during a public event at Millett Hall in Oxford, Thursday, Mar. 30, 2017. GREG LYNCH / STAFF Miami University men's basketball coach <mark>Jack Owens</mark> announced the signing of Dalonte Brown to a National Letter of Intent on Wednesday. A 6-foot-7 forward from Toledo, Brown was a four-year letterwinner for Bowsher High School, where he averaged a double-double as a senior and reached the 1,000 career point milestone. Brown averaged 22.1 points per game in 2016-17 and was named second team All-Ohio as well as the Toledo City Player of the Year. \"RELATED: Trotwood's Patton lists Miami among his top choices\" Dalonte provides this team with athleticism from the forward position, \"<mark>Owens</mark> said .\" He can play inside or out. He's a good rebounder with a high skill level. He brings something we needed in this class and we're excited that he's here. \"\"MORE: <mark>Owens</mark> rounds out his coaching staff Brown joins guards Jalen Adaway, Isaiah Coleman-Lands and Darrian Ringo as part of <mark>Owens</mark>' first recruiting class. View Comments 0", "articleID": "2017041918_00666865_W", "names": {"Jack Owens": ["Q16236423", "Q30122175"]}}, {"date": "2017-04-20", "url": "http://www.kpvi.com/news/year-after-prince-s-death-another-turn-for-the-revolution/article_99b83345-1090-51b9-bab9-ccddba0bdd83.html", "content": "1 year after Prince's death, another turn for The Revolution By JEFF BAENEN Associated Press 24 min ago 0 MINNEAPOLIS (AP)--For members of Prince's 1980s backing band The Revolution, reuniting and hitting the road for a spring U.S. tour is how they are coping with the \"Purple Rain\" pop superstar's unexpected death a year ago. \"We're taking it to the people who are grieving like we are, and letting them have a little bit of relief,\" guitarist Wendy Melvoin, sitting on a couch with other members of the band during a break at their Minneapolis rehearsal space, said Wednesday. When Prince died of an accidental painkiller overdose, members of The Revolution were mourning at a Minneapolis hotel and made an impromptu video, promising to reunite for shows honoring their one-time flamboyant front man. After three sold-out shows at the fabled First Avenue nightclub (the setting of Prince's hit 1984 movie \"Purple Rain\" ) in September, The Revolution is back, preparing to kick off a tour Friday at Paisley Park in the Minneapolis suburb of Chanhassen on the anniversary of Prince's death. The tour includes stops in Chicago, Washington, D.C., New York, Cleveland, Detroit, Los Angeles and San Francisco before ending in Seattle on July 15. Melvoin is joined by bassist BrownMark, keyboardists Matt Fink and <mark>Lisa Coleman</mark>, and drummer Bobby Z. The reunited Revolution plans to play Prince's synthesizer-heavy 1980s music through his lauded 1987 double album \"Sign o' the Times .\" \"We have the ability now to give people a glimpse of what we experienced with him,\" BrownMark said. \"And I think that's a powerful thing. I know it helped me heal .\" While Prince had a reputation as a perfectionist, members of The Revolution remember the good times goofing in the studio. \"We had fun. We had a lot of fun. Sometimes we would be rehearsing and we'd crack up, we'd just laugh for an hour, cracking jokes,\" BrownMark recalls. \"We'd go play softball,\" keyboardist Fink said. \"\"OK, we're not going to rehearse today, let's go play softball .'\" After years of recording and touring with The Revolution, Prince \"did what any boss would do and just put it (the band) to bed,\" Bobby Z. said. \"That intense run we had, all those years, it was starting to come apart at the seams, with personalities and under that kind of pressure, just like human beings do, and he just kind of made a decision,\" the drummer said. \"And he wanted to move on as basically a solo artist with a backing band, no disrespect. But this was a band he was a very critical member of .\" Whether The Revolution will continue beyond this tour is an open question. \"We'd love to be able to see if there are some legs with this,\" Melvoin said. ___ Follow Jeff Baenen on Twitter at https: //twitter.com/jeffbaenen. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Angry 0", "articleID": "2017042002_00639466_W", "names": {"Lisa Coleman": ["Q456306", "Q6557883"]}}]