[{"date": "2017-04-24", "url": "http://10thousandcouples.com/2017/04/columbus-loses-top-defenseman-for-rest-of-playoffs/", "content": "Columbus loses top defenseman for rest of playoffs by Claude Wood | April 24, 2017 | 14:18 Facing elimination in their best-of-seven Eastern Conference first-round series, the Blue Jackets started aggressively and held off the Pittsburgh Penguins for a 5-4 victory on Tuesday night in Nationwide Arena. He was hurt in the second period when Pittsburgh Penguins' Phil Kessel shot the puck. Coach John Tortorella told reporters Monday that Werenski is done for the season. That's the way it happens after a loss. After a lackluster performance in a 3-1 loss in Game 3, the Rangers came out aggressive early in Game 4. \"I said to him,\" I'm proud to be your teammate \". The Blue Jackets have benefitted greatly from his services this year, and losing him is arguably one of the biggest blows they could suffer in the postseason. Nutivaara, a rookie, was making his playoff debut. It helped. They were able to maintain pressure pretty much all evening, and while the Penguins had their moments, they never seized momentum in the second and third periods the way they did in the first three games of the series .\" No matter what period we're in, we have to have the puck more \", Tortorella said .\" We just got to keep doing it \". He'll walk away from his rookie campaign with 11 goals and 47 points in 78 regular season games, good for sixth in scoring on the team and first among blue liners. BOSTON (AP) - <mark>Bobby Ryan</mark> scored on a tip-in on a power play 5:43 into overtime, and the Ottawa Senators recovered after giving up a three-goal lead to beat the Boston Bruins to take a 2-1 lead in the first-round series. Veteran goaltender Marc-Andre Fleury, replacing injured starter <mark>Matt Murray</mark>, has been sharp for the Penguins and made a critical mask save of a potential game-winning Brandon Dubinsky shot in overtime Sunday. Corey Perry scored 1:30 into overtime and Anaheim rallied from three goals down to take a 3-0 series lead in the first-round series .\" When they get closer, we end up with a shift and score a goal \". They lost that series in seven games to Vancouver. The Blue Jackets will be seeing some changes in their lineup. There was less luck involved when Anderson made it 2-0 with a little over minute left in the period. He was waiting to the right of the net to collect a rebound on a shot by Jenner and beat Fleury to the glove side. But Kuhnhackl found the back of the net on a rebound less than two minutes later to make it 4-3 before Jenner put Columbus back up by two. The Pittsburgh Penguins will be looking to go with what worked, keeping most of their lines in tact for game four. Even when they would win series, they would too often leave the door open for opponents or let series go an extra game or two. Related Articles", "articleID": "2017042412_00765371_W", "names": {"Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"]}}, {"date": "2017-04-24", "url": "http://erietvnews.com/story/35227000/feud-season-2-will-be-a-very-different-kind-of-feud-says-ryan-murphy", "content": "\"Feud' Season 2 will be' a very different kind of feud,' says Ry - Erie News Now: News, Weather & Sports | WICU 12 & WSEE\" Feud' Season 2 will be' a very different kind of feud,' says Ry - Erie News Now: News, Weather & Sports | WICU 12 & WSEE Member Center: \"Feud' Season 2 will be' a very different kind of feud,' says <mark>Ryan Murphy</mark> Posted: Updated: By Sandra Gonzalez CNN (CNN)--The story about a clash between two Hollywood heavyweights came to a close with Sunday's conclusion of\" Feud \"Season 1. And creator <mark>Ryan Murphy</mark> already has his sights set on next season, which will center on the ill-fatted marriage between Prince Charles and Princess Diana .\" It's going to be super juicy, \"<mark>Murphy</mark> told Entertainment Weekly .\" It's a very different kind of feud than the feud we told with Bette and Joan. It's a love affair feud. \"FX picked up the second installment of the anthology series even before Season 1 debuted. The roles of Charles and Diana have yet to be cast. But <mark>Murphy</mark> says filling the iconic roles is proving to be difficult feat .\" It's become sort of a Scarlett O'Hara part, \"<mark>Murphy</mark> said of finding an actress to fill Diana's shoes .\" A lot of people want to be Diana, and we're doing a very sympathetic portrayal of her. \"<mark>Murphy</mark> added that he's\" open \"to both newcomers and established stars for the role .\" I don't know where we're going to land, \"he said. <mark>Murphy</mark> said at an Emmy event over the weekend that the second installment begins with the couple filing divorce papers and will tell the story of\" the dissolving of a fairy tale. \"Season 2 will be written by <mark>Murphy</mark>, Jon Robin Baitz and Ned Martel .\" FEUD: Charles and Diana \"will consist of 10 episode and is scheduled to debut in 2018. TM & © 2017 Cable News Network, Inc., a Time Warner Company. All rights reserved. 3514 State St. Erie, PA 16508 Newsroom: (814) 454-8812", "articleID": "2017042415_00377549_W", "names": {"Ryan Murphy": ["Q1185730", "Q19979249", "Q21934130", "Q316844", "Q3453832", "Q6379482", "Q6380012", "Q7384364"]}}, {"date": "2017-04-24", "url": "http://rss.cnn.com/~r/rss/money_technology/~3/KeHY-pfcRO0/index.html", "content": "See Google co-founder <mark>Larry Page</mark>'s \"flying car' in action <mark>Larry Page</mark>'s long-rumored\" flying car \"project is finally ready for takeoff. Kitty Hawk, a startup backed by the Google (GOOGL, Tech30) cofounder, unveiled its prototype for an\" ultralight \"aircraft that can take off vertically--as long as you're flying over open water. In a demonstration shared online Monday, the Kitty Hawk Flyer is shown lifting off over a lake with the help of small propellers under its base. The prototype looks less like a car than a jet ski with wings. The Flyer is expected to go on sale by the end of this year, according to the company's website. The price has yet to be announced. The startup says it has received approval from the Federal Aviation Administration for the aircraft to be flown in\" uncongested areas. \"Customers will not need a pilot's license to use it .\" We've all had dreams of flying effortlessly. I'm excited that one day very soon I'll be able to climb onto my Kitty Hawk Flyer for a quick and easy personal flight, \"<mark>Page</mark> said in a statement provided to The New York Times, which was first to report the news. Related: As Uber makes a pitch for flying cars, transit hype jumps the shark Nearly a year ago, <mark>Page</mark> was reported to have invested more than $100 million in flying car startups. Reps for the company did not immediately respond to a request for comment. Sebastian Thrun, CEO of Kitty Hawk and a former Google exec who led the company's self-driving car efforts, described the mission on Twitter as nothing short of\" changing the future of personal transportation. \"If the Kitty Hawk prototype doesn't exactly look like the flying car of your sci-fi fantasies, you're probably not alone. Several firms, including Aeromobil and Terrafugia, are developing flying cars that look more like tiny planes than cars. Many rely on vertical takeoff and landing, or VTOL, eliminating the need for a runway. The Kitty Hawk announcement also gets out of in front of Uber, which is scheduled to hold an event Tuesday related to its own flying car efforts. <mark>Page</mark>'s Google has a complicated relationship with Uber. Google is an investor in the ride-hailing startup, but Google's self-driving car unit is currently suing Uber for allegedly stealing its intellectual property. CNNMoney (New York) First published April 24, 2017: 10:52 AM ET", "articleID": "2017042415_00645742_W", "names": {"Larry Page": ["Q4934", "Q6490923"]}}, {"date": "2017-04-26", "url": "https://sg.finance.yahoo.com/news/family-trumps-potent-mix-blood-business-074206201--politics.html", "content": "View photos FILE - In this March 3, 2017, file photo, President <mark>Donald Trump</mark> and his family, daughter Ivanka Trump, her husband senior adviser Jared Kushner and their children Arabella Kushner and Joseph Kushner walk out of the Oval Office of the White House in Washington. Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law to head the Peace Corps has a president leaned as heavily on his family as has <mark>Donald Trump</mark>. (AP Photo/Pablo Martinez Monsivais, File) More WASHINGTON (AP)--Not since John F. Kennedy appointed his brother Bobby to be attorney general and his brother-in-law as director of the Peace Corps has a president leaned so heavily on his family. Even <mark>Donald Trump</mark>'s 5-year-old granddaughter Arabella has pitched in. As the administration nears its 100-day mark, Trump has established a White House operation with such an unusual commingling of blood, business and government that it has surprised even his own family. Ivanka Trump, who once said she'd stick to the role of daughter, now has a West Wing office and the title of assistant to the president after she discovered that \"having one foot in and one foot out wouldn't work .\" Her effort to walk a fine line has not always been easy. During an appearance Tuesday at a women's empowerment conference in Germany, she drew hisses and groans as she defended her father's track record. Her husband Jared Kushner is a senior adviser to the president with a bulging and growing portfolio that includes everything from brokering Mideast peace to restructuring the federal government. And there was the president's son Eric, in the unofficial role of spokesman, declaring his father would stand up to North Korea's provocations. In an interview, at the White House Easter egg roll no less, saying on behalf of the president: \"You don't want there to be death and destruction and turmoil around the world but, again, you have to have massive backbone when it comes to dealing with awful, awful dictators .\" Another Trump son, Don Jr., enhanced his profile during the campaign and early months of his father's presidency to such an extent that there is speculation he'll make his own run for office. And he's leaving that door open, saying the New York governor's seat could be a tempting destination at some point. The president's wife, Melania, meanwhile, has been a largely distant presence so far, remaining in New York for the most part while their 11-year-old son Barron finishes out the school year. But she is gradually spending more time in Washington and did give her husband a gentle nudge to put his hand on his heart during the playing of the national anthem at the Easter egg roll. Little Arabella chimed in to the Trump team effort by charming Chinese President Xi Jinping by singing a tune in Mandarin during the leaders' recent meeting at Mar-a-Lago. There are both pros and cons in staffing up from within one's own family, as Trump is learning. The family dynamic has added extra intrigue to the jockeying between rival power centers that is typical in the early days of any White House. The more moderate contingent led by Kushner and Ivanka Trump appears to be ascendant in recent days over those allied with senior strategist Steve Bannon, the former media executive and radio host who's a favorite of conservatives. Princeton historian Julian Zelizer says family members may be able to give a president a tough assessment that other staff members would shrink from providing, but they also can become \"so enmeshed in the identity of their family and protecting their father that they can't give honest advice or can't even see problems as they emerge .\" Ivanka Trump has been criticized for not speaking out more forcefully when she disagrees with her father. But that doesn't necessarily mean she's not making her views heard. \"I would say not to conflate lack of public denouncement with silence,\" she said earlier this month. During her appearance this week in Berlin, she said she's still \"rather unfamiliar\" with her new role as first daughter and presidential adviser but hopes to bring advice and feedback \"back to both my father and the president--and hopefully that will bring about incremental, positive change .\" Her husband, meanwhile, has traveled to Iraq with the chairman of the Joint Chiefs of Staff and has been advising the president on relations with the Middle East, Canada and Mexico. The extent of Ivanka Trump's sway with her father is suggested by Eric Trump's recent comment that she likely weighed in before the president decided to bomb Syria in retaliation for a chemical weapons attack. Eric Trump told London's Daily Telegraph: \"She has influence. I'm sure she said,\" Listen, this is horrible stuff .' \"The blurry line between the Trump family's business interests and its government connections is another unusual complication of this presidency. Even with sons Don Jr. and Eric tasked with running the Trump businesses while Kushner and Ivanka Trump tend to government affairs, the continuing public-private overlap has generated lots of questions about conflicts of interest. Read More The separation between business and government is\" totally artificial, \"says Zelizer. Eric Trump's admission to Forbes magazine in February that\" nepotism is kind of a factor of life \"in the Trump family didn't help dispel the impression of an insider's clan, although he stressed that\" if we didn't do a good job, if we weren't competent, believe me, we wouldn't be in this spot. \"For all the questions about Trump's reliance on family, some see it as a net positive. The value of having a son or daughter on the inside\" is honesty and love, \"says former George H.W. Bush administration staffer Doug Wead, author of books on presidential children and the 2016 campaign .\" They care if your shirt-tail is hanging out. If your hair is messed up, they'll tell you. When everybody else is trying to hide from you, they're going to let you know. \"The power--and peril--of Kushner's place in Trump World is hinted at by Washington graybeard Henry Kissinger in a write-up for Time's list of 100 most influential people. Kissinger said Kushner's broad education and business background\" should help him make a success of his daunting role flying close to the sun. \"___ Follow Nancy Benac on Twitter at: http: //twitter.com/nbenac", "articleID": "2017042615_00037130_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-04-26", "url": "http://fmqb.com/article.asp?id=3027413", "content": "Cox Enterprises Names Alexander <mark>C. Taylor</mark> President/CEO April 26, 2017 Cox Enterprises Chairman <mark>Jim Kennedy</mark> today named Alexander <mark>C. Taylor</mark>, Executive Vice President and COO, as the company's next President and CEO, effective Jan. 1, 2018. <mark>Taylor</mark> will succeed <mark>John Dyer</mark>, President and CEO, who will retire in December after 40 years with the company. <mark>Dyer</mark> and <mark>Taylor</mark> will both continue serving on the Cox Enterprises' board of directors. <mark>Taylor</mark> oversees Cox Communications, Cox Automotive and Cox Media Group, as well as the company's long-term growth and investment plans, and is the great-grandson of company founder Gov. James M. Cox. \"It's especially meaningful for me that a fourth-generation Cox family member will lead the company my grandfather started in 1898,\" said <mark>Kennedy</mark>. \"Alex has a deep understanding of our company and its culture. Cox has thrived in business because we believe in doing good and being a contributor to society. Alex shares this commitment to our employees and communities .\" <mark>Taylor</mark> has held numerous positions within the company's divisions. He was SVP/Field Operations for Cox Communications and EVP/President of Cox Media Group, where he oversaw its largest television, radio, newspaper and digital properties. He also led the creation of the company's first cross-platform newsroom. <mark>Taylor</mark> began his career at Cox as a reporter for the Grand Junction Daily Sentinel in Colorado in May 2000. <mark>Taylor</mark> previously served as Cox Enterprises' EVP/Strategic Investments. He also oversees Cox's investments in the Cox Innovation Fund and True North Venture Partners.", "articleID": "2017042619_00083891_W", "names": {"C. Taylor": ["Q56557075", "Q57691505"], "Jim Kennedy": ["Q22088211", "Q6196096", "Q8013466"], "John Dyer": ["Q39079211", "Q6230595", "Q6230596"]}}, {"date": "2017-04-26", "url": "http://www.13wmaz.com/sports/mayhem-practice-out-of-town-before-sphl-finals/434307587", "content": "Mayhem practice out of town before SPHL finals D Hunter Joyce, WMAZ 4:26 PM. EDT April 26, 2017 CONNECT TWEET LINKEDIN GOOGLE + PINTEREST The top seeded Macon Mayhem have the home ice in the SPHL finals. But before the series closes out at the Centreplex, the Mayhem are on the road, facing the Peoria Rivermen in game 1 Friday night. Due to another scheduling conflict at the coliseum, the team is unable to practice in Macon. So, head coach <mark>Kevin Kerr</mark> and the gang loaded up the bus this morning and headed down to Columbus to get in some practice on their ice. Coach says the extended road trip will give the team some time to bond before their toughest test of the season, but he's excited for the opportunity to come home and win a championship in front of the home fans. \"It's something I've wished for for our guys and I think that's why you play for home ice all year,\" says <mark>Kerr</mark>. \"You play for home ice to give yourself an opportunity and a chance to play in front of your home crowd and win a championship. And we're right there. if we can take care of business on Friday and come back home Sunday, hopefully we close it out. If not, if we need two games, we have two games at home .\" Here's the schedule for the championship series against the Rivermen. Game 1 is Friday night in Peoria. The puck drops at 8:30 EST.. Game 2 is Sunday evening in Macon. That game will start at 6 PM. Game 3, if necessary, is scheduled for Monday at 7:30. Tickets are available through the Macon Centreplex box office. Glass seats are $20 dollars. All other seats are general admission, only $14. Sunday only, tickets for kids 12 and under are just $7. © 2017 WMAZ-TV", "articleID": "2017042620_00440412_W", "names": {"Kevin Kerr": ["Q22005779", "Q326761", "Q6379284", "Q6396687"]}}, {"date": "2017-04-26", "url": "http://www.voiceofalexandria.com/news/national/ap-explains-trump-order-sets-up-legal-clash-over-vast/article_ad1246a4-55fb-53c2-8b37-7435196d3c3d.html", "content": "1 of 14 Carolyn Kaster President Donald Trump signs an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. President Donald Trump is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" (AP Photo/Carolyn Kaster) <mark>Eric Paul</mark> Zamora File-In this Oct. 3, 2016, file photo, Kyle Palmer, left, of Idaho waits as his son Lance Palmer of San Francisco, takes a photograph of the scene looking south from Beetle Rock at Giant Forest in Sequoia National Park, Calif.. President Donald Trump will sign executive orders this week aimed at expanding offshore oil drilling and reviewing national monument designations made by his predecessors, continuing the Republican's assault on Democratic President Barack Obama's environmental legacy. (<mark>Eric Paul</mark> Zamora/The Fresno Bee vi AP, File) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, a reporter walks through the trunk of a 2,000-year-old giant Sequoia inside the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, File) Rick Bowmer FILE - In this June 22, 2016 file photo, the \"Bears Ears\" buttes are shown near Blanding, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Rick Bowmer, File) Carolyn Kaster President Donald Trump acknowledge applause after signing an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. Th president is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" Front row, from left are, Rep. <mark>Ben Bishop</mark>, R-Utah, the president and Sen. Orrin Hatch, R-Utah. (AP Photo/Carolyn Kaster) Douglas C. Pizac FILE - This May 30, 1997, file photo, shows the varied terrain of Grand Staircase-Escalante National Monument near Boulder, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Douglas C. Pizac, File) NOAA Office of Ocean Exploration and Research FILE - This undated file photo released by the National Oceanic and Atmospheric Administration made during the Northeast U.S. Canyons Expedition 2013, shows corals on Mytilus Seamount off the coast of New England in the North Atlantic Ocean. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (NOAA Office of Ocean Exploration and Research via AP, File) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, a portion of Midway Atoll in the Papahanaumokuakea Marine National Monument is seen from Air Force One, with President Barack Obama aboard, as it comes in for a landing at Henderson Field. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Carolyn Kaster, file) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, Forest Service Engine Captain Jim Bauer waters down the historic Speas Meadow cabin, once used by sheep herders in late 1800s, near Packsaddle Grove in the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama pauses at the Battle of Midway Navy Memorial as he tours on Midway Atoll in thePapahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) Francisco Kjolseth FILE - This May 23, 2016, file photo, shows the northernmost boundary of the proposed Bears Ears region, along the Colorado River, in southeastern Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (Francisco Kjolseth/The Salt Lake Tribune via AP file, File) Jacquelyn Martin FILE - In this July 10, 2015 file photo, President Barack Obama, signs designations for three new national monuments; Berryessa Snow Mountain in California, Waco Mammoth in Texas, and the Basin and Range in Nevada, in the Oval Office of the White House, in Washington. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Jacquelyn Martin, File) Rick Egan FILE--In this Dec. 29, 2016, file photo, a young protester demonstrates with others against the new Bears Ear National Monument in Montecello, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. Rick Egan/The Salt Lake Tribune via AP, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama looks out over Turtle Beach as he tours Midway Atoll in the Papahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) AP AP Explains: Trump order sets up legal clash over vast lands By JOHN FLESHER AP Environmental Writer Apr 26, 20178 min ago Carolyn Kaster President Donald Trump signs an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. President Donald Trump is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" (AP Photo/Carolyn Kaster) <mark>Eric Paul</mark> Zamora File-In this Oct. 3, 2016, file photo, Kyle Palmer, left, of Idaho waits as his son Lance Palmer of San Francisco, takes a photograph of the scene looking south from Beetle Rock at Giant Forest in Sequoia National Park, Calif.. President Donald Trump will sign executive orders this week aimed at expanding offshore oil drilling and reviewing national monument designations made by his predecessors, continuing the Republican's assault on Democratic President Barack Obama's environmental legacy. (<mark>Eric Paul</mark> Zamora/The Fresno Bee vi AP, File) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, a reporter walks through the trunk of a 2,000-year-old giant Sequoia inside the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, File) Rick Bowmer FILE - In this June 22, 2016 file photo, the \"Bears Ears\" buttes are shown near Blanding, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Rick Bowmer, File) Carolyn Kaster President Donald Trump acknowledge applause after signing an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. Th president is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" Front row, from left are, Rep. <mark>Ben Bishop</mark>, R-Utah, the president and Sen. Orrin Hatch, R-Utah. (AP Photo/Carolyn Kaster) Douglas C. Pizac FILE - This May 30, 1997, file photo, shows the varied terrain of Grand Staircase-Escalante National Monument near Boulder, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Douglas C. Pizac, File) NOAA Office of Ocean Exploration and Research FILE - This undated file photo released by the National Oceanic and Atmospheric Administration made during the Northeast U.S. Canyons Expedition 2013, shows corals on Mytilus Seamount off the coast of New England in the North Atlantic Ocean. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (NOAA Office of Ocean Exploration and Research via AP, File) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, a portion of Midway Atoll in the Papahanaumokuakea Marine National Monument is seen from Air Force One, with President Barack Obama aboard, as it comes in for a landing at Henderson Field. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Carolyn Kaster, file) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, Forest Service Engine Captain Jim Bauer waters down the historic Speas Meadow cabin, once used by sheep herders in late 1800s, near Packsaddle Grove in the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama pauses at the Battle of Midway Navy Memorial as he tours on Midway Atoll in thePapahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) Francisco Kjolseth FILE - This May 23, 2016, file photo, shows the northernmost boundary of the proposed Bears Ears region, along the Colorado River, in southeastern Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (Francisco Kjolseth/The Salt Lake Tribune via AP file, File) Jacquelyn Martin FILE - In this July 10, 2015 file photo, President Barack Obama, signs designations for three new national monuments; Berryessa Snow Mountain in California, Waco Mammoth in Texas, and the Basin and Range in Nevada, in the Oval Office of the White House, in Washington. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Jacquelyn Martin, File) Rick Egan FILE--In this Dec. 29, 2016, file photo, a young protester demonstrates with others against the new Bears Ear National Monument in Montecello, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. Rick Egan/The Salt Lake Tribune via AP, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama looks out over Turtle Beach as he tours Midway Atoll in the Papahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) President Donald Trump's order for the government to review national monuments created by several of his predecessors sets up a legal showdown over whether one chief executive has the power to undo another's decisions. At stake are federal lands revered for their natural beauty and historical significance. The review goes well beyond a few declarations made in the waning months of Barack Obama's term. It covers 24 monuments established by three former presidents over more than two decades. A closer look at the issues: ___ WHAT IS A NATIONAL MONUMENT? The 1908 Antiquities Act, enacted under President Theodore Roosevelt, empowers the president to declare as national monuments any landmarks, structures and other \"objects of historic or scientific interest\" on land owned or controlled by the federal government. Roosevelt established 18 monuments, including the Grand Canyon in Arizona and Devil's Tower in Wyoming. Most presidents since then have designated additional monuments. Congress has created others. Most monuments are overseen by the National Park Service. Some are cared for by the federal Bureau of Land Management, the Fish and Wildlife Service or the Forest Service. Each agency has policies for protecting the land while also allowing some public use. For instance, some policies include limits on mining, timber cutting and recreational activities such as riding off-road vehicles. ___ A CONTENTIOUS HISTORY Many national monument proclamations have enjoyed broad support. Others have been fiercely contested in Congress and the courts, including designations by Franklin D. Roosevelt (Jackson Hole National Monument, now Grand Teton National Park); <mark>Jimmy Carter</mark> (vast lands in Alaska); and George W. Bush (Papahanaumokuakea Marine National Monument northwest of Hawaii). Trump's choice of Jan. 1, 1996, as the starting date for his review was prompted by lingering resentment among Utah conservatives of Bill Clinton's designation of the Grand Staircase-Escalante National Monument that year. Critics say presidents increasingly are protecting areas that are too large and do not fit the law's original purpose of shielding particular historical or archaeological sites. Designating millions of acres for scientific observation or sheltering rare species, they contend, is a \"federal land grab\" that ignores the wishes of local residents, although the lands already belonged to the government or were under federal control. Interior Secretary Ryan Zinke says the pendulum has swung too far toward protecting public lands and away from the \"multiple-use\" concept advanced by Gifford Pinchot, the first chief of the Forest Service and an early leader in the conservation movement. Supporters say the designations are essential to protect sensitive areas from looting and damage. Complaints about people getting kicked off the land are exaggerated, they say, and opposition fades as nearby communities benefit from tourism the monuments attract. A 2014 study by the nonprofit research group Headwaters Economics found that indicators such as employment, population and per-capita income held steady or improved in sections of the West where monuments larger than 10,000 acres had been established since 1981. ___ LEGAL PRINCIPLES Some monuments have been reduced in size over the years, either by presidential order or by Congress, while others have been enlarged. But no president has tried to eliminate a predecessor's monument. If Trump does so, his move will almost certainly be challenged in court. The Antiquities Act does not explicitly say whether a president can nullify a monument proclamation. A legal analysis commissioned by the National Parks Conservation Association says no, pointing to a 1938 opinion by then-Attorney General Homer Cummings that a monument designation has the force of law and can be reversed only by Congress. A House report accompanying the Federal Land Policy and Management Act of 1976 agrees. But a study for the conservative American Enterprise Institute released in March argues that when Congress authorizes the executive branch to write regulations, the power to repeal them generally can be assumed. That's especially so, it says, when a president is correcting a predecessor's act that exceeded what a law intended--such as creating vast monuments when the Antiquities Act says they should consist of \"the smallest area compatible with the proper care and management of the objects to be protected .\" ___ WHAT'S NEXT? Trump's order directs Zinke to review monument designations involving 100,000 acres or more. The interior secretary will submit an interim report within 45 days focusing on the Bears Ears National Monument in Utah, which Obama established last year. A final report is due in 120 days. Zinke says the report will recommend whether any monuments should be abolished or resized. He promises an open-minded approach and says he remains opposed to selling any federal land or transferring it to state or local control. Congress might weigh in as well. Numerous bills on the issue were introduced in the previous session, including measures to prevent the president from establishing or expanding monuments in particular states and to require consent of Congress or state legislatures. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2017042622_00256984_W", "names": {"Ben Bishop": ["Q12956342", "Q816445"], "Eric Paul": ["Q5387251", "Q5387252"]}}]