[{"date": "2017-04-26", "url": "http://www.voiceofalexandria.com/news/national/ap-explains-trump-order-sets-up-legal-clash-over-vast/article_ad1246a4-55fb-53c2-8b37-7435196d3c3d.html", "content": "1 of 14 Carolyn Kaster President Donald Trump signs an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. President Donald Trump is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" (AP Photo/Carolyn Kaster) <mark>Eric Paul</mark> Zamora File-In this Oct. 3, 2016, file photo, Kyle Palmer, left, of Idaho waits as his son Lance Palmer of San Francisco, takes a photograph of the scene looking south from Beetle Rock at Giant Forest in Sequoia National Park, Calif.. President Donald Trump will sign executive orders this week aimed at expanding offshore oil drilling and reviewing national monument designations made by his predecessors, continuing the Republican's assault on Democratic President Barack Obama's environmental legacy. (<mark>Eric Paul</mark> Zamora/The Fresno Bee vi AP, File) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, a reporter walks through the trunk of a 2,000-year-old giant Sequoia inside the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, File) Rick Bowmer FILE - In this June 22, 2016 file photo, the \"Bears Ears\" buttes are shown near Blanding, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Rick Bowmer, File) Carolyn Kaster President Donald Trump acknowledge applause after signing an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. Th president is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" Front row, from left are, Rep. <mark>Ben Bishop</mark>, R-Utah, the president and Sen. Orrin Hatch, R-Utah. (AP Photo/Carolyn Kaster) Douglas C. Pizac FILE - This May 30, 1997, file photo, shows the varied terrain of Grand Staircase-Escalante National Monument near Boulder, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Douglas C. Pizac, File) NOAA Office of Ocean Exploration and Research FILE - This undated file photo released by the National Oceanic and Atmospheric Administration made during the Northeast U.S. Canyons Expedition 2013, shows corals on Mytilus Seamount off the coast of New England in the North Atlantic Ocean. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (NOAA Office of Ocean Exploration and Research via AP, File) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, a portion of Midway Atoll in the Papahanaumokuakea Marine National Monument is seen from Air Force One, with President Barack Obama aboard, as it comes in for a landing at Henderson Field. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Carolyn Kaster, file) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, Forest Service Engine Captain Jim Bauer waters down the historic Speas Meadow cabin, once used by sheep herders in late 1800s, near Packsaddle Grove in the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama pauses at the Battle of Midway Navy Memorial as he tours on Midway Atoll in thePapahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) Francisco Kjolseth FILE - This May 23, 2016, file photo, shows the northernmost boundary of the proposed Bears Ears region, along the Colorado River, in southeastern Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (Francisco Kjolseth/The Salt Lake Tribune via AP file, File) Jacquelyn Martin FILE - In this July 10, 2015 file photo, President Barack Obama, signs designations for three new national monuments; Berryessa Snow Mountain in California, Waco Mammoth in Texas, and the Basin and Range in Nevada, in the Oval Office of the White House, in Washington. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Jacquelyn Martin, File) Rick Egan FILE--In this Dec. 29, 2016, file photo, a young protester demonstrates with others against the new Bears Ear National Monument in Montecello, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. Rick Egan/The Salt Lake Tribune via AP, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama looks out over Turtle Beach as he tours Midway Atoll in the Papahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) AP AP Explains: Trump order sets up legal clash over vast lands By JOHN FLESHER AP Environmental Writer Apr 26, 20178 min ago Carolyn Kaster President Donald Trump signs an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. President Donald Trump is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" (AP Photo/Carolyn Kaster) <mark>Eric Paul</mark> Zamora File-In this Oct. 3, 2016, file photo, Kyle Palmer, left, of Idaho waits as his son Lance Palmer of San Francisco, takes a photograph of the scene looking south from Beetle Rock at Giant Forest in Sequoia National Park, Calif.. President Donald Trump will sign executive orders this week aimed at expanding offshore oil drilling and reviewing national monument designations made by his predecessors, continuing the Republican's assault on Democratic President Barack Obama's environmental legacy. (<mark>Eric Paul</mark> Zamora/The Fresno Bee vi AP, File) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, a reporter walks through the trunk of a 2,000-year-old giant Sequoia inside the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, File) Rick Bowmer FILE - In this June 22, 2016 file photo, the \"Bears Ears\" buttes are shown near Blanding, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Rick Bowmer, File) Carolyn Kaster President Donald Trump acknowledge applause after signing an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. Th president is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" Front row, from left are, Rep. <mark>Ben Bishop</mark>, R-Utah, the president and Sen. Orrin Hatch, R-Utah. (AP Photo/Carolyn Kaster) Douglas C. Pizac FILE - This May 30, 1997, file photo, shows the varied terrain of Grand Staircase-Escalante National Monument near Boulder, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Douglas C. Pizac, File) NOAA Office of Ocean Exploration and Research FILE - This undated file photo released by the National Oceanic and Atmospheric Administration made during the Northeast U.S. Canyons Expedition 2013, shows corals on Mytilus Seamount off the coast of New England in the North Atlantic Ocean. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (NOAA Office of Ocean Exploration and Research via AP, File) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, a portion of Midway Atoll in the Papahanaumokuakea Marine National Monument is seen from Air Force One, with President Barack Obama aboard, as it comes in for a landing at Henderson Field. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Carolyn Kaster, file) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, Forest Service Engine Captain Jim Bauer waters down the historic Speas Meadow cabin, once used by sheep herders in late 1800s, near Packsaddle Grove in the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama pauses at the Battle of Midway Navy Memorial as he tours on Midway Atoll in thePapahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) Francisco Kjolseth FILE - This May 23, 2016, file photo, shows the northernmost boundary of the proposed Bears Ears region, along the Colorado River, in southeastern Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (Francisco Kjolseth/The Salt Lake Tribune via AP file, File) Jacquelyn Martin FILE - In this July 10, 2015 file photo, President Barack Obama, signs designations for three new national monuments; Berryessa Snow Mountain in California, Waco Mammoth in Texas, and the Basin and Range in Nevada, in the Oval Office of the White House, in Washington. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Jacquelyn Martin, File) Rick Egan FILE--In this Dec. 29, 2016, file photo, a young protester demonstrates with others against the new Bears Ear National Monument in Montecello, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. Rick Egan/The Salt Lake Tribune via AP, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama looks out over Turtle Beach as he tours Midway Atoll in the Papahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) President Donald Trump's order for the government to review national monuments created by several of his predecessors sets up a legal showdown over whether one chief executive has the power to undo another's decisions. At stake are federal lands revered for their natural beauty and historical significance. The review goes well beyond a few declarations made in the waning months of Barack Obama's term. It covers 24 monuments established by three former presidents over more than two decades. A closer look at the issues: ___ WHAT IS A NATIONAL MONUMENT? The 1908 Antiquities Act, enacted under President Theodore Roosevelt, empowers the president to declare as national monuments any landmarks, structures and other \"objects of historic or scientific interest\" on land owned or controlled by the federal government. Roosevelt established 18 monuments, including the Grand Canyon in Arizona and Devil's Tower in Wyoming. Most presidents since then have designated additional monuments. Congress has created others. Most monuments are overseen by the National Park Service. Some are cared for by the federal Bureau of Land Management, the Fish and Wildlife Service or the Forest Service. Each agency has policies for protecting the land while also allowing some public use. For instance, some policies include limits on mining, timber cutting and recreational activities such as riding off-road vehicles. ___ A CONTENTIOUS HISTORY Many national monument proclamations have enjoyed broad support. Others have been fiercely contested in Congress and the courts, including designations by Franklin D. Roosevelt (Jackson Hole National Monument, now Grand Teton National Park); <mark>Jimmy Carter</mark> (vast lands in Alaska); and George W. Bush (Papahanaumokuakea Marine National Monument northwest of Hawaii). Trump's choice of Jan. 1, 1996, as the starting date for his review was prompted by lingering resentment among Utah conservatives of Bill Clinton's designation of the Grand Staircase-Escalante National Monument that year. Critics say presidents increasingly are protecting areas that are too large and do not fit the law's original purpose of shielding particular historical or archaeological sites. Designating millions of acres for scientific observation or sheltering rare species, they contend, is a \"federal land grab\" that ignores the wishes of local residents, although the lands already belonged to the government or were under federal control. Interior Secretary Ryan Zinke says the pendulum has swung too far toward protecting public lands and away from the \"multiple-use\" concept advanced by Gifford Pinchot, the first chief of the Forest Service and an early leader in the conservation movement. Supporters say the designations are essential to protect sensitive areas from looting and damage. Complaints about people getting kicked off the land are exaggerated, they say, and opposition fades as nearby communities benefit from tourism the monuments attract. A 2014 study by the nonprofit research group Headwaters Economics found that indicators such as employment, population and per-capita income held steady or improved in sections of the West where monuments larger than 10,000 acres had been established since 1981. ___ LEGAL PRINCIPLES Some monuments have been reduced in size over the years, either by presidential order or by Congress, while others have been enlarged. But no president has tried to eliminate a predecessor's monument. If Trump does so, his move will almost certainly be challenged in court. The Antiquities Act does not explicitly say whether a president can nullify a monument proclamation. A legal analysis commissioned by the National Parks Conservation Association says no, pointing to a 1938 opinion by then-Attorney General Homer Cummings that a monument designation has the force of law and can be reversed only by Congress. A House report accompanying the Federal Land Policy and Management Act of 1976 agrees. But a study for the conservative American Enterprise Institute released in March argues that when Congress authorizes the executive branch to write regulations, the power to repeal them generally can be assumed. That's especially so, it says, when a president is correcting a predecessor's act that exceeded what a law intended--such as creating vast monuments when the Antiquities Act says they should consist of \"the smallest area compatible with the proper care and management of the objects to be protected .\" ___ WHAT'S NEXT? Trump's order directs Zinke to review monument designations involving 100,000 acres or more. The interior secretary will submit an interim report within 45 days focusing on the Bears Ears National Monument in Utah, which Obama established last year. A final report is due in 120 days. Zinke says the report will recommend whether any monuments should be abolished or resized. He promises an open-minded approach and says he remains opposed to selling any federal land or transferring it to state or local control. Congress might weigh in as well. Numerous bills on the issue were introduced in the previous session, including measures to prevent the president from establishing or expanding monuments in particular states and to require consent of Congress or state legislatures. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2017042622_00256984_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}}, {"date": "2017-04-27", "url": "https://www.joe.co.uk/sport/wladimir-klitschko-rubbishes-eye-injury-rumour-and-explains-point-of-memory-stick-123450", "content": "5 shares Wladimir Klitschko rubbishes eye injury rumour and explains point of memory stick By Darragh Murphy Sport | 6 minutes ago Boxing Playing those mind games 5 shares Wladimir Klitschko rubbishes eye injury rumour and explains point of memory stick By Darragh Murphy Wladimir Klitschko is not one to engage in trash talk all that often but that's not to say that he won't indulge in a subtle mind game or two. Once revered as the most dominant force in boxing's heavyweight division, Klitschko will have to prove that there's some fight left in the old dog yet as he aims to yank the brakes on a hype train of unparalleled momentum in the form of Anthony Joshua. One of the most intriguing fights in recent heavyweight history takes place on Saturday night as Wembley Stadium hosts Joshua vs. Klitschko, with the IBF, vacant WBA (Super) and IBO heavyweight titles on the line. Respect has dominated the build-up to the in-ring collision of past and future but Klitschko has tried, on occasion, to get under the skin of the humble \"AJ'. Earlier in the month, he referred to Joshua as\" a wannabe billionaire \"in an out-of-character swipe at his upcoming opponent. But Joshua didn't bite. Where the hell did this come from? Klitschko gives it both barrels https: //t.co/e8Qm1tly8P--JOE. co. uk (@ JOE_co_uk) April 10, 2017 And with just days to go until nothing but a referee separates the fighters, we saw more attempted mind games from the Ukrainian. During Thursday's press conference, Klitschko reached into his pocket and pulled out a memory stick, where his confident prediction for this weekend's clash is stored. Advertisement The 41-year-old intends to auction off the robe he will wear to the ring, which will come with his pre-fight prediction included, and the proceeds will go to his charity .\" On this stick, I recorded a video last week and I gave my prediction, \"Klitschko explained .\" This stick is going to be integrated into my robe. \"Do not ask me, after that fight, what is on the stick. The only person who is going to be able to open it up and watch it is the person who buys this robe, with all the money going to the Klitschko Foundation .\" Rumours of an eye injury to Klitschko have circulated in recent days but he gave short shrift to any talk of the fight being in jeopardy by pulling a line right out of <mark>Donald Trump</mark>'s arsenal. \"Fake news!\" Klitschko assured. There's not long to go now! Read more about: Boxing, Anthony Joshua, Wladimir Klitschko 5 shares Share", "articleID": "2017042717_00344543_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-04-27", "url": "http://www.readingeagle.com/ap/article/in-vr-land-rush-creators-unlock-an-empathy-engine", "content": "AP The Associated Press | This image released by the Tribeca Film Festival shows a scene from the VR film, \"The Last Goodbye,\" being shown at the Tribeca Film Festival in New York. A number of high-profile projects unveiled at the Tribeca Film Festival show the young medium pushing forward to unlock VR's power to create empathy, whether it's a Holocaust survivor or a crow voiced by John Legend. (Tribeca Film festival via AP) The Associated Press | This image released by the Tribeca Film Festival shows a scene from the VR film, \"The Last Goodbye,\" being shown at the Tribeca Film Festival in New York. A number of high-profile projects unveiled at the Tribeca Film Festival show the young medium pushing forward to unlock VR's power to create empathy, whether it's a Holocaust survivor or a crow voiced by John Legend. (Tribeca Film festival via AP) The Associated Press | FILE - This Thursday, April 20, 2017 file photo provided by Strategy PR shows director Kathryn Bigelow at the Tribeca Film Festival Virtual Arcade in New York. A number of high-profile projects unveiled at the Tribeca Film Festival show the young medium pushing forward to unlock VR's power to create empathy, whether it's a Holocaust survivor or a crow voiced by John Legend. (Kathryn Bigelow/Strategy PR via AP) In VR land rush, creators unlock an 'em pathy engine' Thursday April 27, 2017 01:47 PM By JAKE COYLE, AP Film Writer NEW YORK (AP)--On a plain, overcast day in Poland, Holocaust survivor Pinchas Gutter walks toward the Nazi concentration camp Majdanek. He stands in the railway car that delivered him and his family to the camp. He walks to the gas chamber and the showers. Some rooms he can't bear to go in. He shares his recollections and tries to remember what he can of his family. All he can really visualize of his sister is the fleeting image of her golden braid of her hair. Walking with Gutter in Majdanek is an undeniably powerful way to make the Holocaust tangible, and to see it through a survivor's eyes. Now, being Gutter's companion as he revisits his painful past is an experience anyone can have just by putting on a headset. The virtual reality piece \"The Last Goodbye,\" made from 3-D video and thousands of photographs at Majdanek, is being billed as the first Holocaust survivor testimony in room-scale VR. It premiered at the Tribeca Film Festival, where the medium's growing ambitions have been on display over the past week. What \"The Last Goodbye\" and other works show is that virtual reality, while still very much in its early days, has a potent ability to foster empathy. In transporting you to an intimate space with someone, it gives that old expression, \"walk in my shoes,\" a new, high-tech, physical dimension. That's literally the concept behind Katheryn Bigelow and Imraan Ismail's \"The Protectors: Walk in the Ranger's Shoes,\" an 8-minute, 360-degree visit with the Garamba National Park rangers. They defend the Democratic Republic of the Congo park from waves of poachers. Ismail, whose earlier, award-winning VR experience, \"The Displaced,\" followed three child refugees, says of virtual reality: \"It enables empathy because it enables a kind of presence in someone else's space. And breaking through apathy .\" \"For me, it's exactly that. It's empathy,\" says Bigelow. \"Here are these individuals who put their lives on the line in order to thwart the problem. Sometimes they pay the ultimate price. In order to be able to help, you have to be very well informed .\" Big names filmmakers and actors are increasingly experimenting in VR, a fast-growing new media landscape that the investment bank Citi last fall forecast will be a trillion-dollar industry by the year 2035. <mark>Jon Favreau</mark> (\"Iron Man\" ) and Justin Lin (\"Fast & Furious\" ) have tried their hand in it, and in May, \"Birdman\" director Alejandro Inarritu will premiere a virtual reality project at the Cannes Film Festival. He has called it an effort to \"allow the visitor to go through a direct experience walking in the immigrants' feet, under their skin, and into their hearts .\" Jennifer Brea turned to VR for an accompanying experience to her Sundance entry film, \"Unrest,\" about her battle with chronic fatigue syndrome. In the VR experience, the viewer feels what it's like to be bedridden in her room. Brea calls virtual reality \"an engine of empathy .\" A sense of growth was palpable at Tribeca, which increased the size of its VR arcade this year. Loren Hammonds, a film and experiential programmer at Tribeca, sees a rapidly progressing medium where artists are continually reexamining their notions of how to orient the viewer. \"The rules are being broken,\" says Hammonds. \"There are constantly these sets of rules that keep being presented to creators: you can't move the camera or you can't cut. And the minute someone breaks it and it works, well, no more rule .\" Creators, many eyeing the neighboring booths in the Tribeca arcade, acknowledge there's a competitive atmosphere in VR that can feel like a land rush. Technology is one race, and all agree virtual reality is going to get exponentially smoother and crisper. \"The Last Goodbye\" has been \"future-proofed,\" meaning that more detailed photography and video has been set aside for when the tech catches up, says Patrick Milling Smith, chief executive of VR production company Here Be Dragons. But storytelling is a race of its own in VR, a medium many call a combination of cinema and gaming. Should the viewer have agency to move and shape their experience? If so, to what degree? How do you guide them? For inspiration, Baobab Studios co-founder Eric Darnell, an animation veteran who co-directed the \"Madagascar\" films, has studied how magicians manipulate the eyes of their audiences. Baobab's first VR work, \"Invasion!\" supplied the viewer a partner--a little white bunny--for an alien arrival. \"Now everyone is doing that,\" says Maureen Fan, chief executive of Baobab. \"But a lot of people debated us on that. We felt that as a user, why are you there if you're a fly (on the wall) verses if you're a bunny? If you have a role to play, how much more do you feel for that character and feel immersed in that world?\" At Tribeca, Baobab premiered the first chapter of an ambitious 10-part series, \"Rainbow Crow,\" in which John Legend voices a mythical, sonorous bird forever changed by a cosmic adventure. \"It's about love. It's about inclusion. It's about community,\" says Legend. The creators of the choose-your-own-adventure, live-action \"Broken Night\" wanted to take go further. In it, Emily Mortimer plays a woman with a hazy memory recounting a violent encounter with an intruder in her home. At various points in the story, viewers are given a choice to follow different paths in the story, which they select by looking to one side of the action or the other. \"The problem with live-action VR today is it's not interactive,\" says co-director Tal Zubalsky. \"Kind of the whole promise of VR is to get you to a different place. But if you get there only as an observer and not as a participant, then you're not really there .\" ___", "articleID": "2017042717_00770243_W", "names": {"Jon Favreau": ["Q295964", "Q581607"]}}, {"date": "2017-04-27", "url": "http://www.omaha.com/news/education/after-uno-chancellor-search-is-put-on-hold-unmc-s/article_b2e8e5e2-2b5a-11e7-9c9b-1399ac129841.html", "content": "<mark>John Christensen</mark>, UNO chancellor After UNO chancellor search is put on hold, UNMC's Gold expected to lead both campuses through next 2-year budget cycle Buy Now MATT DIXON/THE WORLD-HERALD University of Nebraska President Hank Bounds, left, and University of Nebraska Medical Center Chancellor Chancellor <mark>Jeffrey Gold</mark> at the press conference discussing the UNO chancellor search. Buy Now MATT DIXON/THE WORLD-HERALD University of Nebraska President Hank Bounds speaks at a press conference about the search for a new UNO chancellor. REBECCA S. GRATZ/THE WORLD-HERALD Dr. <mark>Jeffrey Gold</mark>, UNMC chancellor University of Nebraska Medical Center Chancellor <mark>Jeffrey Gold</mark> may add the title of interim chancellor of the University of Nebraska at Omaha for two years or more. NU President Hank Bounds announced Thursday that the search for a replacement for UNO Chancellor <mark>John Christensen</mark> was on hold because the right person hadn't been found. Bounds said he expected Gold to lead both UNMC and UNO through the next two-year budget cycle. Bounds said in comments at UNO that the plan could change if the situation isn't working out for UNMC, UNO or Gold himself. Bounds and Gold said the decision would help increase collaboration and find efficiencies between the two universities, both situated in Omaha. The duration of Gold's interim position and the many mentions of collaboration raised questions about the degree to which UNO and UNMC might merge for the long term. Dale Eesley, a UNO faculty member, posed that question to Bounds and Gold when they met with faculty and staff early Thursday afternoon at UNO's Strauss Performing Arts Center. After the session, Eesley received compliments from at least three UNO faculty members for having asked the question. Bounds declined to say that merger wasn't a possibility in a brief interview after meeting with faculty members. \"I can't give you an iron-clad guarantee on anything,\" Bounds said. \"You're asking me to totally preidict the future. I can't do that .\" But he also characterized a reporter's questions about merger as an effort to \"make news .\" <mark>Christensen</mark>, who announced last year that he would step down in mid-2017, said in an interview: \"Hank said from the very beginning this was an interim postiion. That's really where this thing is at at this moment. Now who knows what happens as this thing goes forward?\" Gold said he was excited about the opportunity to bring the two institutions closer together. \"I'm truly humbled and excited about this opportunity,\" Gold said at a press conference at UNO. He said he talked this possibility over with his wife. \"Her comment was,\" Go for it,' \"Gold said. The search for UNO chancellor was put on hold because the right person hasn't been found, the NU system announced Thursday. Gold will take on the interim chancellor role at UNO, beginning May 8. The interim appointment is expected to be confirmed by the NU Board of Regents on June 1. UNO Chancellor <mark>John Christensen</mark>, 68, said late last year that he would step down in mid-2017 after about 10 years of leading the campus. Bounds said in a statement that the search was a struggle because there were so many president and chancellor openings nationwide. He also said the state's financial difficulties compelled some candidates to hesitate to pursue the UNO position. Theresa Barron-McKeagney, a UNO associate dean and co-chairwoman of the search committee, said her committee worked hard .\" Our goal was to find the right person who could pick up where Chancellor <mark>Christensen</mark> will leave off and continue UNO's momentum, \"Barron-McKeagney said .\" While the position attracted interest from across the country, ultimately none of the candidates was the right mutual fit. We're excited to have Dr. Jeff Gold lead our campus forward. \"Bounds oversees the campuses in Omaha, Lincoln and Kearney. Gold became UNMC's chancellor three years ago. Before coming to UNMC, Gold, a heart surgeon, was chancellor and executive vice president of biosciences and health affairs at the University of Toledo. Bounds gave no date for resuming the UNO chancellor search but indicated that would happen eventually. Gold was not part of the candidate pool for the chancellorship, the statement said. But Bounds said Gold's interim appointment is logical because the university's financial state will require more shared operations between the Omaha campuses. Gold's appointment also will deepen collaboration between the two institutions, the statement said .\" Jeff is the right person, at the right time, to lead UNO into the future, \"Bounds said. Gold is paid $814,234 a year as UNMC's chancellor and won't be paid more for his new duties, an NU spokeswoman said. Gold, 64, praised <mark>Christensen</mark>'s leadership and said through a statement that he has been\" impressed and inspired by the work being done \"at UNO .\" Our campuses have a long record of collaboration, and I am humbled and honored to get to know UNO and its people even better in the months head, \"Gold said .\" This is an opportunity to work together to change the world--and we will. \"", "articleID": "2017042721_00133342_W", "names": {"Jeffrey Gold": ["Q3176695", "Q42708202"], "John Christensen": ["Q5608314", "Q6226001", "Q6226002"]}}, {"date": "2017-05-01", "url": "http://pagesix.com/page/2/?_ga=1.93212506.652403088.1488071024", "content": "Page Six Lamar Odom is selling his Florida home for $5.2 million...Trending Now Katy Perry bombs with Obama joke Sightings SEE ALL Now On Copyright trial about Eminem's \"Lose Yourself' begins May 1, 2017 | 1:31 pm In 2014, when the case was filed, lawmaker <mark>Steven Joyce</mark> said he thought the use of the song was\" pretty legal. \"\"Fixer Upper' star fires back at former partners' lawsuit May 1, 2017 | 11:33 am Last week, Magnolia's cofounders John L. Lewis and <mark>Richard</mark> L. Clark filed a $1 million lawsuit against Gaines. Fyre Festival called a\" get-rich-quick scam' in $100 million suit May 1, 2017 | 11:20 am \"The island isn't private, as there is a Sandals resort down the road, and Pablo Escobar never owned the island,\" the complaint says. Former drug \"Kingpin' on why Trump should leave pot alone May 1, 2017 | 11:00 am\" There's something about freeing the consciousness that comes with marijuana that makes it for difficult people to control, \"<mark>Richard Stratton</mark> explained.", "articleID": "2017050120_00088591_W", "names": {"Richard Stratton": ["Q17021852", "Q26777006", "Q7329276"], "Steven Joyce": ["Q22667650", "Q7614885"]}}, {"date": "2017-05-02", "url": "http://vanityfair.com/news/2017/05/infosys-jobs-donald-trump", "content": "Depends on his mood. By Andrew Harrer/Bloomberg via Getty Images. After spending the whole of his campaign and first 100 days in office railing against any company even entertaining the thought of sending jobs overseas or not hiring American workers stateside, <mark>Donald Trump</mark> can claim a victory: Infosys Ltd., Bangalore-based I.T.-services firm, will hire 10,000 Americans within the next two years, as well as open four hubs within the U.S., starting in Indiana this summer. And unlike with previous press announcements from companies like Sprint and GM, which recycled old jobs plans to flatter the president's ego, it appears Infosys really did respond to <mark>Trump</mark>'s harsh rhetoric. Also likely contributing to the move? An executive order <mark>Trump</mark> signed last month, initiating a government review that is expected to make it harder for companies to obtain H-1B visas for workers who might undercut American labor. While tech companies throughout Silicon Valley rely heavily on the H-1B program, which is designed to allow high-skill workers to enter the United States, <mark>Trump</mark>'s directive is expected to focus on restricting visas at the lower end of the skill spectrum, disproportionately affecting call-center companies like Infosys. Perhaps in an attempt to appease the president, Infosys C.E.O. Vishal Sikka offered Reuters a comment on the move that sounded like it could have been dictated by <mark>Trump</mark> himself: \"When you think about it from a U.S. point of view, obviously creating more American jobs and opportunities is a good thing .\" While the move isn't guaranteed to get Infosys out of <mark>Trump</mark>'s crosshairs, it is almost certain to increase the company's labor costs. \"This is positive in one aspect and negative in another,\" IDBI Capital Market Services analyst Urmil Shah told Bloomberg. \"Increasing local hiring is important for Indian IT firms to retain ongoing projects in the US, as well as secure new ones. The downside is that the costs will rise .\" Share Email Facebook Twitter", "articleID": "2017050217_00815567_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-05-03", "url": "http://www.tiftongazette.com/sports/marlowe-wins-state-hurdles-championship/article_96dff0ce-2f84-11e7-9451-fb8cb7676825.html", "content": "Marlowe wins state hurdles championship TIFTON--Tiftarea Academy's Marlee Marlowe was crowned state champion Saturday in the Georgia Independent Schools Association state Class AAA track meet in the 100-meter hurdles. More Headlines The Tifton Gazette is releasing \"Our United States Presidents,\" a magazine-style book briefly chronicling the history of our 45 United States presidents. More Headlines The Tifton Gazette is releasing \"Our United States Presidents,\" a magazine-style book briefly chronicling the history of our 45 United States presidents. More Headlines Close Sarge Dorsey Marlee Marlowe won an individual championship at Saturday's state track meet for Tiftarea Academy, running the 100 hurdles in 16.04 seconds. Marlowe wins state hurdles championship Becky Taylor 3 min ago Sarge Dorsey Marlee Marlowe won an individual championship at Saturday's state track meet for Tiftarea Academy, running the 100 hurdles in 16.04 seconds. TIFTON--Tiftarea Academy's Marlee Marlowe was crowned state champion Saturday in the Georgia Independent Schools Association state Class AAA track meet in the 100-meter hurdles. Competing at Albany's Hugh Mills Stadium, Tiftarea finished 13th overall in the boys meet and 14th in the girls, accumulating four and 16 points, respectively. Deerfield-Windsor swept the meet, though it had to settle with Trinity Christian of Dublin for a tie in boys. Both Deerfield and Trinity totaled 114.5 points. The Lady Knights scored 92 points to defeat Augusta Prep by seven. Marlowe's win \"feels really great,\" said David Dark, head coach of Tiftarea's track team. \"She blew the competition away,\" he said. \"She ran almost a full second faster in the finals .\" Marlowe, who also won the region hurdles title earlier in April, had qualified in a preliminary Thursday for the finals at the top of the heap in 16.7 seconds. She then improved upon that time in the finals by running in 16.04 seconds. The time allowed her to finish more than a half-second ahead of her nearest competitor, Teresa Dominguez of Holy Spirit Prep, who finished in 16.83 seconds. Dark said the competition was actually stiffer in the preliminary. One of Marlowe's top opponents fell in the qualifier and did not finish in time to make the final round. He refused to accept any credit for Marlowe's championship. That, he said, should be split among two people: Marlowe and Newell \"Sarge\" Dorsey. A Tiftarea stalwart for all sports, Dorsey coached the 1984 Lady Panthers to the state title. \"Marlee's hard work and Sarge's great,\" Dark said. \"He's really her coach .\" Tiftarea earned points in four other events, the girls 400 meters, girls long jump, boys 800 meters and boys 4x400. Adylein Hunt was sixth in the long jump at 15' 04.25. \"\"Adylein jumped a foot farther than she had all season,\" said Dark. Sixth place also went to Abby Carswell in the 400. He said he was \"really proud\" of her finish, as well as Adam McKinney, who was eighth in the 800. Even more impressive for McKinney, he shaved 10 seconds off his previous time. McKinney was also on the sixth place 4x400 relay team with Jackson Cook, Logan Carswell and Spence Massey. McKinney was not originally set to run with the group, but was forced into duty after an injury to Dallas Hunt. Hunt was injured during state and did not finish his individual race, the 1,600 meters. Dark said Hunt sacrificed his own race for the 4x400 team to help them qualify for the finals. \"He didn't finish that race so he had something to give .\" McKinney had not trained much for the 4x400, but quickly jumped into the slot. Tiftarea didn't miss a beat, finishing within a second of their qualifying time. Dark said the meet was bittersweet. Logan Carswell and Cook are seniors and this was their last ever meet for Tiftarea. Though they did not earn points, he was also proud of Kassidy Goodman and <mark>Michael Garvey</mark>. Goodman won region in shot put and was 12th in the finals. <mark>Garvey</mark> was 10th in discus. Tags", "articleID": "2017050313_00564384_W", "names": {"Michael Garvey": ["Q16232116", "Q57033300", "Q6830539"]}}, {"date": "2017-05-03", "url": "https://www.eveningexpress.co.uk/pipe/news/international/trump-hoping-for-resumed-middle-east-peace-talks/?share=email", "content": "by Press Association, 3 May 2017 17:28 President Donald Trump has expressed optimism for resumed peace talks between the Palestinians and Israel. He made the comment at the start of his Oval Office meeting with Palestinian leader <mark>Mahmoud Abbas</mark>. President Trump says that \"hopefully something terrific can come out between the Palestinians and Israel\" and that \"we've been working on that one a long time\". Mr Trump added: \"Maybe we can end that journey and start a much better journey .\" It is the first direct meeting between President Trump and Mr <mark>Abbas</mark>. More from the Evening Express", "articleID": "2017050316_00362777_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}}]