[{"date": "2017-05-03", "url": "http://jacksonsun.com/story/news/local/2017/05/03/breaking-cycle-inmates-graduate-penal-farm/101214166/", "content": "Buy Photo Madison County Mayor <mark>Jimmy Harris</mark> congratulates men who have graduated from the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program, Tuesday, May 2, 2017. (Photo: KENNETH CUMMINGS/The Jackson Sun) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Tenica Dickerson patted her boyfriend on the back as he stood up to get his diploma, showing he successfully passed the 14-class course to be a better dad. Kenneth Hodges, Dickerson's boyfriend of more than 20 years, wore a gray T-shirt reading \"24/7 dad\" over his jail shirt. Hodges is an inmate at the Madison County Penal Farm, and Dickerson expects he'll be released in August after serving a year sentence. \"Talking to him, he's more enthused. He's more positive, when he's always doubted,\" Dickerson said. \"Now he sees things in a brighter light, and he's better at communicating. I really profited from this also because we can communicate now, when we couldn't even communicate at first .\" Hodges is one of three men who graduated from the Inside/Out program run through Southwest Human Resources Agency. The program teaches inmates how to be a better dad once they're released from custody, and to work on communication with their wives, girlfriends and kids. \"Communication is a whole lot better, but he's also got a little bit of a drive behind him. He has plans, he wants to make a future,\" said Barbara Lents, whose husband Austin is in custody at the Penal Farm. \"It's a big deal .\" Buy Photo Kenneth Hodges thanks his support team after succesfully completing the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program (Photo: KENNETH CUMMINGS/The Jackson Sun) Dickerson said she and Hodges have a 16-year-old son together, and Barbara and Austin Lents have a 5-year-old daughter together. \"They need their fathers,\" Dickerson said. \"Here, they're missing out .\" \"It's painful,\" Hodges said. \"I grew up on the wrong side of the law .\" Hodges said he's trying to guide his kids in a different direction than he went growing up, but he hopes this program will give him skills he needs to teach his children. \"I want to teach my daughters and my sons the right way to go so they don't go down the path I went,\" Hodges said. \"I didn't have to go the way I did. I had both of my parents, I just made bad decisions. Now I'm older and I've learned to really do the right things .\" Buy Photo Bradley Washington thanks his support team after succesfully completing the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program (Photo: KENNETH CUMMINGS/The Jackson Sun) Tim Carothers, the re-entry coordinator for Southwest, said they want the graduation to mark a milestone for men who successfully finish the class. \"As much as anything, it is to let them know how much support they have from, not only our organization, but the Sheriff's Department, other people in the county who are willing to help them,\" Carothers said. \"If we do the same things, we're going to get the same results, and we're trying to get them to change the way they think .\" Reach Maranda at (731) 425-9657 or at mfaris2 @ jacksonsun.com. Follow her on Twitter: @ MarandaFaris Buy Photo Austin Lents thanks his support team after succesfully completing the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program (Photo: KENNETH CUMMINGS/The Jackson Sun) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http: //www.jacksonsun.com/story/news/local/2017/05/03/breaking-cycle-inmates-graduate-penal-farm/101214166/", "articleID": "2017050316_00883983_W", "names": {"Jimmy Harris": ["Q14951984", "Q6200296", "Q6200299"]}}, {"date": "2017-05-03", "url": "http://southernminn.com/owatonna_peoples_press/news/article_52a15efc-f1a7-5066-88a3-cf53efe6ed49.html", "content": "OWATONNA--Taking home medals and plaques from the spring Minnesota Association of Alternative Programs (MAAP) STARS conference would be a boost to the confidence of any student. But for Owatonna's Amanda Haskell, those medals and plaques are mile markers of a life back on track. They're tangible evidence of promises finally fulfilled after a detour of drugs and depression, and signs heralding a future of boundless possibility. \"I don't want to be afraid to tell my story,\" she said. \"Finally becoming who I was before has been an incredible journey .\" And, she added, the MAAP STARS awards \"showed I can achieve something .\" As a child, Haskell was so bright she was able to skip kindergarten and move right to first grade. Before she was even a year old, she could read--thanks to her grandfather's tutelage--from the <mark>King James</mark> Bible. She \"was ridiculously advanced in state test scores\" as an elementary student, she was in a gifted-and-talented program as an eighth grader, and she regularly brought home straight A's, she said. Then, when she was 15, she was shattered by a sexual assault in a hotel, leaving her with Post Traumatic Stress Disorder. Self-medicating soon led to a disastrous spiral of substance abuse. Though she'd vowed to herself to go through her senior year sober, that promise--like countless ones before--went unfulfilled, and she missed nearly the entire first week in a haze of drugs before landing at the Alternative Learning Center, or ALC, in October. Every time she used drugs, she said, she knew she was breaking her parents' hearts, but she could never get clean in her social circle comprised of other heavy drug users who she knew were pulling her down. Finally, on New Year's, as she sat surrounded by drugs and deeply under the influence friends, she experienced the epiphany that it was neither kindness nor love she was experiencing, and that they didn't care about each other: They just fed each other drugs. \"I don't want to be around these people or drugs anymore,\" she said about her realization. She separated herself from them, and she's been sober since the first of the year. In February, she also cut ties with \"an emotionally-abusive\" now-ex-boyfriend who encouraged her drug use, she said. In the past few months, she's befriended peers at the ALC who support her sobriety, and both her grades and attendance have markedly improved. Instead of bragging to peers about her drug-and-alcohol-fueled exploits, Haskell now cautions others from following her self-destructive path, she said. \"I could've died so many times,\" said Haskell. Ditching drugs has also helped her rebuild her relationship \"beyond belief\" with her parents, whom she'd shut out while abusing drugs, she said. Now, she can bring reputable friends home with her and talk with her mother and father about their days, as opposed to dashing up the stairs to her room as soon as she walked in the door so her parents wouldn't see in her eyes she was high again. Haskell said there's no chance she'd be in the position she is today--poised to graduate on time later this month, sober, and heading to college in the fall to become a nurse--if not for the teachers at the ALC. \"They care so much about your home life, and they really want you to succeed,\" Haskell said as tears welled in her eyes. \"They have to deal with a lot, but they do it so well .\" Haskell has settled on nursing as a career because her mother was a nurse, as was her mother's mother, and \"my parents raised me on service,\" she said. In addition, Haskell is now working with elderly dementia patients at a local nursing home. \"My parents are such good examples of service to other people being gratifying,\" she said. \"To look them in the eyes and know they respect me back is such a huge thing for me .\" Between her parents, friends and teachers, Haskell now has a motivational support system as she prepares to leave the warm embrace of the ALC for college this fall, she said. In addition, she'll glance at her MAAP STARS awards every day as a reminder of what she can achieve by attending class, studying for tests and remaining sober. ALC STARS shine bright Haskell's performance in Edina last week was all the more impressive considering it was her first time at the conference, as it was for the handful of other students who represented Owatonna's ALC there, said Ray Ostfeld, a math teacher at the ALC and the MAAP STARS adviser. Owatonna's ALC has been participating in MAAP STARS \"about as long as there's been an ALC,\" but this was Ostfeld's first year as the adviser. Students participated in various activities, both individual and team, from public speaking to employment interviews, he added. The competitions concentrate on building leaders and career development. \"The way they taught you life skills was awesome,\" Haskell said. \"It really stuck in your head .\" Furthermore, \"you definitely become a leader,\" she said. \"It's definitely for everyone, and I told all the people I know when I got back to school to get into MAAP STARS .\" Because so much of the conference \"is planned down the minute,\" students also learned valuable time-management skills, she said. \"Being in charge of your own time is very adult-like .\" Haskell was also impressed by the sheer amount of volunteers working the event, showing they care about the students, she said. Furthermore, the event was conducted at \"a really beautiful hotel, which I don't think a lot of kids [who were] there get on a regular basis .\" Haskell first learned about the possibility from her sister, Ally, who participated in MAAP STARS and told her \"it was a blast, and it taught you a lot about growing up,\" she said. \"It really does, and we could all benefit from that .\" For example, the critique sheets from judges helped students improve their employment interviews in later rounds, she said. \"We really took their comments to heart .\" Though the articulate Haskell had long been told she more than held her own in conversations with adults despite her youth, she didn't expect to finish second out of more than 200 students in the employment interview, she said. Instead, her focus was on the public speaking category, where she also excelled, finishing sixth out of more than 150 contestants. \"I really like public speaking, and I prepared for weeks,\" she said. \"I rewrote it and rewrote it and rewrote it .\" Though Haskell had a remarkable story to tell of her education journey, her speech needed to fit within a five to seven minute time frame, Ostfeld said. \"She was so receptive to reworking it repeatedly, and she deserves her\" accolades. Because her father, Keith, is a pastor (at Bridges of Hope Community Church), and she often helped him at events, Haskell grew up with public speaking, she said. \"I did introductions for him, and he trained me to be comfortable with public speaking,\" she said. While in high school, Haskell's mother, Kathleen, also excelled in public speaking, receiving recognition for a speech she gave about her mother's death from ALS. When Haskell told her mother she was going to give a speech for MAAP STARS and \"follow in her footsteps,\" Kathleen's advice was succinct: \"Do something personal .\" So Haskell shared the painful details of her educational journey for the first time publicly. Adding to the irony was the fact the first day of the conference--at a hotel--took place on the two-year anniversary of her own hotel nightmare, she said. \"It was emotional, but also more meaningful because I overcame that,\" she said. Haskell discovered \"it's easier to tell strangers than people close to you,\" she said. \"Family and friends have this weird pity, and they're afraid to talk about it, but judges understand, and I could cry with them knowing I was being heard .\" A judge even hugged Haskell and cried herself, she added. \"I didn't know they could do that .\" Haskell also credited ALC social studies teacher Don Hettinga, who accompanied the group as a pinch hitter for Ostfeld, who was unable to attend due to a death in his family. Hettinga's presence also added poignancy to the ALC's community service project, Pennies for Patience, as he's a cancer survivor. \"Everybody knew (Hettinga),\" Haskell said. \"It was so cool .\" Though not a particularly close-knit group prior to the conference, the six students from Owatonna bonded while at MAAP STARS, she said. It was neat \"to get close to people\" with similar interests and goals, and \"we became a little family .\" Stories of redemption like Haskell's are a reason \"I don't want to do anything else\" but teach at an ALC, said Ostfeld, who is in his second year in Owatonna after nine years at a Rochester ALC. \"It has its challenges every day, but to see students walk across the stage on graduation day--my favorite day of the year--with their diplomas, beaming with pride, knowing what they've been through, and what they're capable of, makes everything worthwhile,\" said Ostfeld. Though earning a high school diploma \"doesn't seem like a lot to people outside this building, it means a lot to us,\" Haskell said. \"That diploma is a reminder every morning that I can do it .\" Indeed, Ostfeld spends much of his time convincing students they can excel, and they often do, he said. He tried to remind them \"the past is the past, and it's never too late for anything .\" ", "articleID": "2017050322_00663503_W", "names": {"King James": ["Q17100723", "Q36159"]}}, {"date": "2017-05-04", "url": "http://wtam.com/onair/glenn-beck-56047/paul-ryan-and-the-gop-make-15802479/", "content": "<mark>Paul Ryan</mark> and the GOP Make Lindsey Graham Look Like Benjamin Franklin posted by The <mark>Glenn Beck</mark> Program - 1 hour ago share Well, it looks like Republicans are going to pull a Nancy Pelosi with the Obamacare replacement bill. We'll have to pass it to see exactly what's in it. If only we'd elected someone who promised to drain the swamp, destroy the GOP, tear the system down and get the weasels out. Oh wait, we did. Unfortunately, Trump has failed to deliver on many of his promises--and it won't be <mark>Paul Ryan</mark> and the GOP holding his feet to the fire. \"I mean, at first, we liked <mark>Paul Ryan</mark>. Then we're like,\" Oh, he's a dirtbag, but at least he's not Lindsey Graham .' Lindsey Graham looks like Ben Franklin compared to the GOP now...Lindsey Graham hasn't gotten better. The GOP has gotten worse, \"<mark>Glenn</mark> said Thursday on radio. Listen to this segment beginning at mark 4:10 from The <mark>Glenn Beck</mark> Program: Known for his quick wit, candid opinions and engaging personality, <mark>Glenn Beck</mark> has attracted millions of viewers and listeners throughout the United States with The <mark>Glenn Beck</mark> Program. His radio show is now heard on over 400 stations and is nationally syndicated by Premiere Networks. It is the third highest-rated national radio talk program in America. <mark>Glenn</mark> is also the founder and owner of The Blaze, a 24/7 news, information and opinion network that is available on television and online. He also has multiple #1 New York Times bestsellers in both fiction and non-fiction along with hosting acclaimed live-events, overseeing the fashion brand 1791, and previously hosted a phenomenally successful show on Fox News and CNN's Headline News. Across all of these mediums, <mark>Beck</mark> connects with his fans in a whole new way, inspiring and entertaining them with his humor, hard-hitting interviews and honest tales about his life. Contact", "articleID": "2017050421_00025580_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2017-05-05", "url": "http://www.wbrc.com/story/35351068/pakistan-afghan-border-cross-fire-kills-15-on-both-sides", "content": "Pakistan-Afghan border cross-fire kills 15 on both sides - WBRC FOX6 News - Birmingham, AL Pakistan-Afghan border cross-fire kills 15 on both sides - WBRC FOX6 News - Birmingham, AL Member Center: Pakistan-Afghan border cross-fire kills 15 on both sides 2017-05-05T15:11:25 Z2017-05-05T15:11:25 Z (AP Photo/Arshad Butt). A Pakistani victim of cross border firing rests at a hospital in Quetta, Pakistan, Friday, May 5, 2017. Afghan security forces backed by artillery fired without provocation on Pakistani census workers and soldiers escorting them...By <mark>ABDUL SATTAR</mark> and MUNIR AHMEDAssociated Press QUETTA, Pakistan (AP) - Backed by artillery, Afghan security forces fired across the border on Pakistani census workers and troops escorting them on Friday, killing nine and drawing a response from the military, Pakistan said. On the Afghan side, officials reported six killed in the incident, a significant escalation of hostilities between the two neighbors. Pakistani government and military officials said the artillery rounds that hit in the border town of Chaman in southwestern Baluchistan province were unprovoked but Afghan provincial officials claimed that the Pakistanis fired first. The incident was the latest escalation between the two neighbors who share a volatile and porous boundary. Pakistani army spokesman Maj. Gen. Asif Ghafoor said the army shut the border crossing in Chaman in response to the early morning attack, blocking all movement of people and supplies to its landlocked neighbor. Residents in the area said Pakistani and Afghan security personnel exchanged fire using light and heavy weapons. \"So far, we have received nine bodies. These civilians were killed as a result of the Afghan shelling,\" said Akhtar Mohammad, a doctor at the state-run hospital in Chaman. At least 42 people were reported wounded on the Pakistani side, including women and children, and Mohammad said some of the wounded were in critical condition. Prime Minister Nawaz Sharif issued a statement describing the Afghan firing as \"unfortunate\" and urged Kabul to put an end to cross-border attacks that threaten efforts to bring peace to Afghanistan. Pakistan's foreign ministry spokesman Nafeez Zakaria said the census workers were on their side of the border when Afghan forces opened fire. According to local residents, dozens of shells slammed into nearby villages, as well as close to the regional headquarters of Pakistan's paramilitary forces. Several of the wounded said their homes were destroyed in the exchange. Gen. Abdul Raziq, the police chief in Afghanistan's Kandahar province, blamed Pakistan for initiating the gunbattle. He accused Islamabad of using the census as a mask to conceal the crossing of militants from Pakistan into Afghanistan. Raziq said six people - four Afghan policemen and two civilians - were killed while another 37 were wounded by Pakistani forces' fire. Among the Afghan wounded were 23 civilians. \"Pakistani forces were trying to infiltrate Afghan territory but Afghan forces stopped them; that's when the fight started,\" said Raziq. In Islamabad, the foreign ministry said it had summoned Afghanistan's chargé d'affaires to complain about the firing. Pakistan and Afghanistan routinely accuse each other of providing sanctuaries to their enemy insurgents - something both sides deny. Despite several high-level visits by Pakistani intelligence and security officials to Afghanistan in recent weeks, relations between the two countries continue to deteriorate. Gen. Ghafoor also accused Afghan forces of creating obstacles for census workers in villages divided by the Pakistan-Afghanistan border. He did not elaborate on what those obstacles entailed. Later Friday, the Pakistani military said a hotline had been established between the two sides and that the cross-border shooting had stopped. Pakistani Maj. Gen. Sahir Shamshad Mirza asked the Afghan military to ensure its forces stay on their side and take every step to \"defuse the situation\" while the Pakistani military would \"work within our own border .\" Pakistan shares a 2,200-kilometer - (1,375 mile -) long porous border with Afghanistan. Pakistan currently hosts 1.5 million registered Afghan refugees and another 1 million unregistered. They routinely get caught in the middle when tensions between Pakistan and Afghanistan escalate. Pakistan started conducting a nationwide census in mid-March, with censor-takers going door-to-door to collect information. The census - the country's first since 1998 - has reignited a centuries-old border dispute between Pakistan and Afghanistan. The boundary, known as the Durand Line - named for Sir Henry Mortimer Durand, the former British diplomat who first established the border in 1896 - runs through vast ethnic Pashtun areas on both sides, in some places straight through villages. Any attempt to make the border a permanent one has been fiercely opposed by Afghanistan. The two countries routinely squabble over the disputed border line, incidents which at times escalate into armed conflict. In March this year former Afghan President Hamid Karzai again said that Afghanistan would never accept the Durand Line as an international border, stoking fears on the Pakistani side. ___ Ahmed reported from Islamabad. Associated Press writers Mirwais Khan in Quetta, Pakistan; Kathy Gannon in Multan, Pakistan; Zarar Khan in Islamabad and Amir Shah in Kabul, Afghanistan, contributed to this report. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2017050515_00099368_W", "names": {"Abdul Sattar": ["Q17486434", "Q4409050", "Q59490492"]}}, {"date": "2017-05-06", "url": "http://www.hudsonhubtimes.com/entertainment/2017/05/04/cedar-point-adds-metal-detectors", "content": "Search Cedar Point adds metal detectors Officials say amusement park goers can expect a slightly longer wait time to pass through the new Published: May 4, 2017 3:00 AM 1 of 1 Photos | View More Photos SANDUSKY (AP)--Amusement park visitors to the \"Roller Coaster Capital of the World\" can expect slightly longer wait times to pass through new metal detectors. The parent firm of Cedar Point added another level of security to all of its parks. Cedar Point spokesman <mark>Tony Clark</mark> said the process for passing through metal detectors should go quickly. Cedar Point will open Saturday with a newly expanded water park called Cedar Point Shores. It has the second most roller coasters in the world behind Six Flags Magic Mountain in Clarita, California. Cedar Fair L.P. operates 11 amusement parks in the U.S., including Knott's Berry Farm in California and Dorney Park & Wildwater Kingdom in Pennsylvania. Rate this article", "articleID": "2017050606_00261055_W", "names": {"Tony Clark": ["Q11321326", "Q20630841", "Q21280433", "Q7822067", "Q7822069", "Q7822070"]}}, {"date": "2017-05-07", "url": "http://www.pga.com/news/pga-tour/dustin-johnson-returns-top-form-wells-fargo-championship", "content": "<mark>Dustin Johnson</mark> returns to top form at Wells Fargo Championship Jim Dedmon | USA Today Sports Images <mark>Dustin Johnson</mark> got back into the swing of things with a 5-under round three at the Wells Fargo Championship. By Series: PGA Tour Published: Sunday, May 07, 2017 | 11:38 a.m. WILMINGTON, N. C .--It took about 45 holes, but <mark>Dustin Johnson</mark> finally looked like the world's top-ranked golfer again on his final nine holes Saturday afternoon at Eagle Point Golf Club. The Coastal Carolina alumnus and shot a bogey-free 5-under 67 in the third round of the 15th Wells Fargo Championship to climb into a tie for 14th at 4-under 212 and pull within four shots of leader <mark>Patrick Reed</mark>. Four of <mark>Johnson</mark>'s five birdies came on his second nine. RELATED: Wells Fargo Championship leaderboard | Photos With his late rally, <mark>Johnson</mark> still has hope of becoming the first player since Tiger Woods in 2007-08 to win four consecutive starts on the PGA Tour. \"If it's windy again tomorrow, hopefully I get off to a good start and post a real good number and let them play for it,\" <mark>Johnson</mark> said. \"Starting today I thought it was going to take 11 or 12 under, and I'm 4 under so I need to shoot 7 under tomorrow probably to have a chance .\" <mark>Johnson</mark> made a 22-foot birdie putt on his first hole of the third round, the par-3 10th, then made four birdies on his second nine with putts of 4, 3, 3 and 9 feet, the final birdie coming on the tough par-4 ninth hole. He's having difficulty reading Eagle Point's greens in his first look at the course. \"I just need to putt better,\" <mark>Johnson</mark> said. \"Even this afternoon I didn't putt good. I shot 5 under and hit it good and chipped it well but didn't make any putts hardly. I made a nice one to start the day and nice one to finish, but I've missed a lot of 10-footers for birdie out there .\" ...The greens are kind of tricky, they're real subtle. I just haven't played and my feel is a little bit off. I just need some more rounds. I feel like it's getting better. It's getting there. \"No. 1 in the World. No. 1 in the FedExCup standings. No. 1 in the Power Rankings. <mark>Dustin Johnson</mark> is back in action. pic.twitter.com/lteVz35y9M--PGA TOUR (@ PGATOUR) May 4, 2017 <mark>Johnson</mark> hit 9 of 14 fairways in the third round after hitting just six fairways in the second. He put a new TaylorMade driver into play in the third round, replacing a driver that won three consecutive tournaments .\" was in play, that's all I care about, \"<mark>Johnson</mark> said .\" I hit one good drive all day...The problem is I'm not swinging good enough to judge. I've got to start hitting it solid first then I'll be able to figure out which one I want to use. \"<mark>Johnson</mark>'s second round was suspended due to darkness Friday, and he made two bogeys and a birdie on the five holes he played to complete his second round Saturday morning to make the cut on the number at 1-over 145. In the second round, <mark>Johnson</mark> birdied the 15th hole, bogeyed holes 16 and 17 and made a par on the 18th to be among the 79 players who made the cut to Saturday's third round .\" I wasn't worried about the cut, \"<mark>Johnson</mark> said. His second-round 3-over-par 75 is <mark>Johnson</mark>'s highest round since last September's Deutsche Bank Championship. <mark>Johnson</mark> practiced in the two hours he had between the second and third rounds, paying particular attention to the short game and putting .\" I'm just rusty. I really hadn't had any practice coming into here. I mean none, \"<mark>Johnson</mark> said .\" ...That's the biggest thing. I had a little bit better feel out there today. It's just going to take a little bit of time to get back into it. But I felt like I played pretty well this afternoon. \"<mark>Johnson</mark> is playing his first tournament since winning the WGC-Dell Technologies Match Play Championship on March 26 and spent the past four weeks recovering from a back injury incurred when he slipped and landed on a small staircase on the eve of the Masters Tournament. <mark>Johnson</mark> tees off with Morgan Hoffmann at 12:25 in the final round, 1:20 before the final group of <mark>Reed</mark> and Alex Noren. Lefty makes charge Phil Mickelson played Saturday like the tournament hasn't changed venues this year. Though he has yet to win at Quail Hollow Club in Charlotte, Mickelson has nine top-10s and seven top-fives including a runner-up finish in 2010 in the Wells Fargo, and he made a move Saturday at Eagle Point. Phil Mickelson enters the third round five shots off the pace. pic.twitter.com/KPXtQy8Vi8--PGA TOUR (@ PGATOUR) May 6, 2017 Shaking off a disappointing double bogey on his final hole in the second round, Mickelson shot a 3-under 69 Saturday to move into a tie for 14th at 4-under 212. He made four birdies--holing a pair of 15-foot birdie putts and a 7-footer, and chipping in from 35 feet on the fifth hole--while making a bogey on the ninth hole .\" I had a lot of opportunities to take it even lower and really move up the leaderboard, but it was a good solid day, \"Mickelson said .\" At least I put myself in position where if I get hot tomorrow and get it going I can make up the ground. I was thinking I needed to shoot 5, 6, 7 under today to get right where I wanted. \"Mickelson believes a low number is possible at Eagle Point, but it won't be easy .\" Surprisingly, you can be a little more aggressive than you think, but you have to use the slopes and contours on the green to stop the ball close rather than just flying it right at it because still, even though they're softer than the first couple of days, they're still tough to hold anything past a wedge, \"Mickelson said .\" But I think it's a lot easier today than it has been the first two days. \"A cut above WATCH: Nicklaus nearly holds out | Fowler, Thomas, Walker at the Derby Because more than 78 players made the 36-hole cut, another cut to the low 70 scores and ties was made after 54 holes Saturday afternoon. Players who didn't qualify for Sunday's final round were <mark>Fabian Gomez</mark>, <mark>Greg Owen</mark>, Jason Bohn, Martin Flores and Steven Alker, who each shot a 5-over 77. This article is written by Alan Blondin from The Sun News and was legally licensed via the Tribune Content Agency through the NewsCred publisher network. Please direct all licensing questions to legal @ newscred.com.", "articleID": "2017050716_01009819_W", "names": {"Dustin Johnson": ["Q1002293", "Q30015838"], "Fabian Gomez": ["Q5427907", "Q6077142"], "Greg Owen": ["Q28860416", "Q3116266", "Q594237"], "Patrick Reed": ["Q15905139", "Q57514710"]}}]