[{"date": "2017-05-07", "url": "http://www.gulf-times.com/story/547180/Rayyan-face-make-or-break-clash-with-Saudi-s-Al-Hi", "content": "Rayyan face make-or-break clash with Saudi's Al Hilal May 07 2017 10:13 PM Al Rayyan coach Michael Laudrup. Text Size: A By Sports Reporter/Doha Al Rayyan face a tightrope situation when they take on already qualified Saudi giants Al Hilal in their Last Group D clash in the Asian Champions League in Doha today. A win will help Michael Laudrup's team top the group, while a loss, combined with a victory for Iran's Persepolis over the UAE's Al Wahda, will see them miss out on a spot in the last 16 of the lucrative continental championship. A draw will be helpful only if Persepolis go down to Al Wahda. With seven points from five matches, Al Rayyan are in second spot behind Al Hilal who have nine. Third placed Persepolis have six from five and Al Wahda have four. It's a peculiar situation that means even bottom-placed Al Wahda have a slim hope of making the knockouts. \"We have to ensure we win against Al Hilal and qualify on our own rather than depend on the other result,\" Al Rayyan coach Laudrup said yesterday. \"We are quite confident that we can overcome the challenge from Al Hilal,\" the Dane added. Al Rayyan last week booked their semi-final slot in the Emir Cup, but are still smarting from the 5-1 thrashing they suffered at the hands of Al Wahda that revived the UAE side's chances of a last 16 spot. Al Rayyan also lost to Al Hilal earlier in the group stage when when they went down 2-1 in Riyadh, the winning goal coming from a penalty in the sixth minute of second-half stoppage time. \"We were unlucky to concede a penalty then. Hope our luck changes this time,\" added Laudrup, who will be banking on their South American professionals to progress to the knockouts for the first time in history. Al Hilal, on the other hand, have better pedigree. The winners of several regional titles, they finished runners-up in the 2014 Asian Champions League but were champions in 1991 and 2000 when the tournament was called the Asian Club Championship. Unbeaten Al Hilal have posted two wins and three draws from their five games on the continent to book their place in the last 16 with a match to spare, but must gain at least a point against second-placed Al Rayyan to advance as table-toppers. They have several quality players in their line-up, including Yasser al-Shahrani, who is hoping that the memory of the 2014 defeat in the final to Western Sydney Wanderers can spur them on to greater heights this season. \"I can't describe exactly how I was feeling at the time,\" reflected defender Al Shahrani, who was just 22 when competing in his first and, to date, only AFC Champions League final. \"I was a very young player and even though I had the support of all the experienced players at Al Hilal, I felt the pressure because I wanted to compete well and put in a good performance .\" I think that the group did well to get to the final but I hope we can do that again this year because last time we didn't win it. \"The following year Al Hilal again performed admirably before ultimately being ousted in the semi-finals by the United Arab Emirates' Al Ahli, although last year's Round of 16 defeat to Lokomotiv failed to match expectations. <mark>Ramon Diaz</mark>'s side, though, are again likely to be among the strongest contenders from the West, having yet to taste defeat on their march to the knockout round and boasting a squad replete with Saudi internationals .\" Our players have good experience in the ACL as it's not the first time we have participated in it, \"added Al Shahrani, who has missed the previous two Group D games. Meanwhile, an exciting encounter is expected at Azadi Stadium in Tehran today as Persepolis host Al Wahda. Early pacesetters Persepolis have suffered a dip in form of late, picking up just two points from a possible nine, and must win to have any chance of progression. The Iranian champions welcome back captain Jalal Hosseini and Soroush Rafieitelgary from suspension for the crunch tie.", "articleID": "2017050719_00872854_W", "names": {"Ramon Diaz": ["Q348557", "Q6099558"]}}, {"date": "2017-05-08", "url": "http://www.hawkesburygazette.com.au/story/4647516/best-sunday-ever-show-society-said/?src=rss", "content": "Lots of categories saw a resurgence in entries this year, show society says. School entries in the sheep categories were one of the stand out aspects of the 2017 show, with increased entries also in honey, dairy goats and alpacas. Picture: <mark>Geoff Jones</mark> \"IT WAS a top show--every-thing was sensational,\" show society president Ross Matheson summed up on Monday. While Friday was a bit down on numbers, Saturday was on a par with last year's bumper crowd, and Sunday was the best Sunday ever. Hawkesbury District Agricultural Association administration and business manager Linda Beneke said \"our carpark people said they had never parked cars where they had to on Sunday\" due to the huge numbers. She said for her the highlights of the show were the new $3m ride called The Beast, and the animal wrangler who did a breathtaking show with his super-tame horse. \"Also the Aldo's pizza van--it was really popular\". Mr Matheson said quite a few exhibit categories had a resurgence this year. \"We had the largest number of entries in the honey for many years, and the alpacas, poultry and dairy goats all had an increase in entries. He agreed that those categories were ones which hobby farmers could do .\" It's a sign of the times that these are animals that can be kept on smaller acreages, \"he said. The sheep entries were very well supported by schools this year as well. He said entertainment-wise the woodchop was a showstopper .\" We had the biggest number of woodchoppers for around 15 years, \"he said .\" We had as many watch that on the Saturday night as any of the other events at the show. \"One of the teams of eight even came up from Tasmania to compete. He said the new heavy horse foal championships were also very popular .\" Our painted cow competition was also unbelievably successful--we had to split it into two categories--east of the river, won by Windsor Public School, and west of the river--won by Richmond North Public School. \"Another success story was the new Lego creation category .\" We had about 60 entries. \"He said the fruit and veg sections were also\" very well supported by locals \".\" This was good considering the hot summer followed by the rain. \"He said it was a great show for the police as well, with very minimal bad behaviour and no major incidents. Those with special needs enjoyed the show in huge numbers too .\" Our disabled carpark was full on the Sunday, \"Ms Beneke said .\" We'd extended it and it still filled. It has about 250 spots. \"Mr Matheson said they'd also spent $27,000 making an externally accessed unisex toilet next to the craft pavilion, to cater for carers who are a different gender to those in the wheelchair. In the only negative incident the Gazette heard about, a young adult was taken by ambulance on Sunday morning with chest pains.", "articleID": "2017050807_00590071_W", "names": {"Geoff Jones": ["Q21176422", "Q21598228"]}}, {"date": "2017-05-08", "url": "http://www.echonews.com.au/news/hydro-power-not-a-pipe-dream-for-gladstone/3175517/", "content": "OPTIONS: The hinterland mountains west of Gladstone would be the perfect place for a pumped-storage hydroelectricity facility. <mark>Mike Richards</mark> GLA080417HYDRO Popular Stories BBC's bizarre Madeleine McCann documentary intro Luxury outback paradise built in western Queensland Man wed to screwdriver killer says he can't divorce Local Real Estate Cars For Sale AS POWER prices continue to rise and the threat of global warming lingers, the need for cheap, clean and reliable energy grows. While the Gladstone Regional Council pushes for another coal-fired power station to be built in the region, business owner and aviator Hugh Bridge believes our mountainous surrounds out west are the perfect location to build dams for pumped-storage hydroelectricity in order to store excess energy. Pumped-storage hydroelectricity is a type of hydroelectric energy storage used by electric power systems for load balancing - like a big battery. It's a method which stores energy in the form of gravitational potential energy of water, pumped from a lower elevation reservoir to a higher elevation. At times of low electrical demand, excess generation capacity is used to pump water into the upper reservoir. When there's higher demand, water is released back into the lower reservoir through a turbine, therefore generating electricity. The amount of megawatts produced by such a facility would depend on various factors including the falling distance of water and the rate at which water spills per litre every second. Mr Bridge, a Cessna plane owner, doesn't believe these ideas are pie in the sky. The 69-year-old has flown over one million kilometres of land and has seen plenty of mountains along the Great Dividing Range with potential to base a pumped-storage facility. OPTIONS: The mountains west of Gladstone would be the perfect place for a pumped-storage hydroelectricity facility. <mark>Mike Richards</mark> GLA080417HYDRO \"We've reached the stage where a lot of our power stations are reaching the end of their useful life and they're talking about replacing them,\" Mr Bridge said. \"If we're going to replace them it would be nonsense to build more coal-powered ones - we should be building clean power stations .\" Providing it was practical to do so, I would be building wind turbines in suitable places along the Great Dividing Range, solar farms on the other side of the range where it is drier and also building the high and low dams to do the pumped-storage hydroelectricity. \"Mr Bridge says he's not against mining, but believes alternatives must be found to replace coal mining .\" I would like to see all tiers of government start taking the carbon dioxide pollution of the atmosphere seriously, \"he said .\" They seem to think because (Australia) only contributes a small percentage it doesn't matter too much. \"They should keep in mind we are amongst the highest polluters per head of population in the world .\" Global warming could be a runaway effect; once it starts it could be nearly impossible to stop its effects. \"These renewable projects would lower energy prices, lower carbon emissions and lower unemployment, Mr Bridge said. carbon emissions Read More Login to follow clean energy Read More Login to follow gladstone region Read More Login to follow hydro electricity Read More Login to follow hydro power Read More Login to follow renewable energy Read More Login to follow Topics: carbon emissions clean energy gladstone region hydro electricity hydro power renewable energy 0 PRINT Have your say Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now", "articleID": "2017050820_00063839_W", "names": {"Mike Richards": ["Q575019", "Q6833845", "Q6848560", "Q6848562", "Q6848563"]}}, {"date": "2017-05-09", "url": "http://www.newhamrecorder.co.uk/athletics-newham-essex-beagles-team-manager-rowan-griffiths-says-title-challenge-is-plausible-after-second-place-in-opening-match-1-5009552", "content": "Athletics: Newham & Essex Beagles team manager Rowan Griffiths says title challenge is plausible after second place in opening match PUBLISHED: 14:00 09 May 2017 Ned Keating Newham & Essex Beagles team manager Rowan Griffiths (left) (pic: <mark>Claire Jones</mark>) © <mark>Claire Jones</mark> Beagles only finished behind Birchfield Harriers in Sheffield on Saturday Share Comment Email this article to a friend To send a link to this page you must be logged in. Team manager Rowan Griffiths believes Newham & Essex Beagles can mount a challenge for the British League Premier Division title this term after finishing second in the opening match. Beagles were only beaten by Birchfield Harriers in Sheffield, taking seven victories on the day. It was a positive start to the campaign for Beagles, and Griffiths knows it means the club can aim high this season. \"It's been a number of years since we've been able to talk about a serious title challenge, but the start to this year has put us in a good position,\" he said. \"In previous years, we've had a lot of athletes away in warm weather training camps, so it's often hard in the first match, but we've started well .\" We had the smallest squad of the eight on the day and were only beaten by Birchfield, who had the biggest, so it's a great achievement. \"Two of those six wins for Beagles came in the javelin, with <mark>Harry Hughes</mark> (72.03 m) claiming the\" A' string and Chris Hughff (62.93) the victor in the \"B' event. And Griffiths was understandably delighted with the clean sweep for Beagles in the javelin events in Sheffield .\" <mark>Harry</mark> is only 19 and still a young lad, so to throw over 72 metres in windy conditions was good, \"he added .\" Chris is 35, so the two boys are at either ends of their careers, but they egg each other on in training, but maybe it's time for <mark>Harry</mark> to shine now. \"Other wins went the way of Alex Al-Ameen in the\" A' 110m hurdles and Hassan Abdel Gawad in the \"A' hammer event. Both Nigerian Al-Ameen and Gawad of Egypt have represented their countries internationally, and Griffiths believes both will prove to be key members of the squad .\" Hassan was great on his British League debut for us and so was Alex, both are world class athletes so hopefully there is more to come from them, \"he said. There was a popular winner in the\" B' 3000m as Frank Baddick came home in eight minutes 31 seconds to claim victory, much to Griffiths' delight. \"Frank has probably scored more points for us in the British League than anyone else and he always gives it a real good go,\" said the Beagles team manager. The other winners for Beagles in Sheffield were Matthew Roberts in the \"A' high jump, and the 4x100m relay quartet of Aidan Steers, Emmanuel Stephens, <mark>Michael Warner</mark> and Lennox Thompson. Related articles Athletics: Newham & Essex Beagles team manager Tim Mundle praises team's commitment after UK Athletics League opener in Wigan", "articleID": "2017050913_00215079_W", "names": {"Claire Jones": ["Q16728064", "Q5125234", "Q58023339"], "Harry Hughes": ["Q10413311", "Q5669862", "Q880642"], "Michael Warner": ["Q1929737", "Q56554754", "Q6835220"]}}, {"date": "2017-05-09", "url": "https://heatst.com/culture-wars/duke-university-professor-resigns-after-criticizing-intellectually-flaccid-diversity-training/", "content": "A Duke University theology professor resigned this week following disciplinary action taken against him by the school. This, after the professor had excoriated diversity training sessions suggested by the university as \"intellectually flaccid .\" Professor <mark>Paul Griffiths</mark>, Duke Divinity School A series of emails published by The American Conservative reveals that 61-year-old professor <mark>Paul Griffiths</mark>, who teaches Catholic theology at Duke, took umbrage by an invitation urging all divinity school faculty to partake in two full days of \"racial equity\" training this past March. \"Those who have participated in the training have described it as transformative, powerful, and life-changing,\" wrote Anathea Portier-Young, the associate professor who sent the invitation. \"We recognize that it is a significant commitment of time; we also believe it will have great dividends for our community .\" <mark>Griffiths</mark> wasn't too happy about the invitation, and sent a public reply to everyone else on the mailing list criticizing the value of the diversity training. \"I exhort you not to attend this training. Don't lay waste your time by doing so,\" he wrote. \"It'll be, I predict with confidence, intellectually flaccid: there'll be bromides, clichés, and amen-corner rah-rahs in plenty. When (if) it gets beyond that, its illiberal roots and totalitarian tendencies will show. Events of this sort are definitively anti-intellectual .\" Dean of the Duke Divinity School Elaine Heath His response wasn't well-received, and within hours, school dean Elaine Heath sent an email to campus faculty reprimanding mass emails like the one <mark>Griffiths</mark> sent out. Without mentioning the professor specifically, Heath wrote: \"It is inappropriate and unprofessional to use mass emails to make disparaging statements--including arguments ad hominem--in order to humiliate or undermine individual colleagues or groups of colleagues with whom we disagree. The use of mass emails to express racism, sexism, and other forms of bigotry is offensive and unacceptable, especially in a Christian institution .\" According to further emails published at The American Conservative, Heath requested to speak with <mark>Griffiths</mark>, but neither of them could agree on the conditions of the meeting. The News & Observer reports that <mark>Griffiths</mark> later sent out a separate email to his colleagues informing them that he was now subject to two separate disciplinary proceedings, including a harassment complaint by Portier-Young, which was prompted by his initial response. <mark>Griffiths</mark> says that the dean had furthermore banned him from attending faculty meetings and was told he wouldn't receive future funds for research and travel. Anathea Portier-Young, Duke Divinity School <mark>Griffiths</mark> characterized these punishments as \"reprisals\" for his willingness to voice criticism, designed not to engage the points he made \"but rather to discipline me for having expressed them .\" \"Elaine Heath and Thea Portier-Young, when faced with disagreement, prefer discipline to argument,\" he wrote in his blistering response. \"In doing so they act illiberally and anti-intellectually; their action shows totalitarian affinities in its preferred method, which is the veiled use of institutional power .\" \"They appeal to non - or anti-intellectual categories (\"unprofessional conduct' in Heath's case;\" harassment' in Portier-Young's) to short-circuit disagreement. All this is shameful, and I call them out on it, \"wrote <mark>Griffiths</mark>. Given Professor Griffith's position as an endowed chair, which includes tenure, there was little to no possibility that the university could have vacated his position or fired him. Griffith's resignation is clearly intended to send a message to the school's administration--and it's one that comes through loud and clear. <mark>Ian Miles</mark> Cheong is a journalist and outspoken media critic. You can reach him through social media at @ stillgray on Twitter and on Facebook. Advertisement More Elites Financing Social Justice: 6,000 Harvard Alums Invest in Left-Wing Site Mic.com Yale College Republicans Taunt Grad Student\" Hunger Strikers' With Barbecue, Corn and Baked Beans Columbia University Accused of Censoring Its \"Politically Incorrect' Marching Band Trayvon Martin to Receive Posthumous Degree From Florida University Show Full Article Related UVA Puts Business Professor on Leave for Criticizing Black Lives Matter College Disorientation How Campuses Became So Disconnected From Reality", "articleID": "2017050919_00748599_W", "names": {"Ian Miles": ["Q20640922", "Q58231747"], "Paul Griffiths": ["Q16215288", "Q28111204", "Q5162251", "Q58167926", "Q7151015", "Q7151017", "Q7151019"]}}, {"date": "2017-05-09", "url": "http://www.wusa9.com/news/local/hurricane-awareness-tour-comes-to-dc/438233685", "content": "Hurricane Awareness Tour Comes to DC Howard Bernstein, WUSA 4:48 PM. EDT <mark>May</mark> 09, 2017 This NOAA image shows Hurricane Matthew in the Caribbean Sea heading towards Jamacia, Haiti and Cuba on October 3, 2016. (Photo by NOAA via Getty Images) (Photo: Handout, 2016 NOAA) CONNECT TWEET LINKEDIN GOOGLE + PINTEREST WASHINGTON (WUSA9) - Hurricanes are the largest and most destructive storms on Earth. With hurricane season starting in just a few weeks, The National Hurricane Center's Hurricane Awareness Tour was in town on a mission to help residents of the Mid-Atlantic be more prepared. It was field day at the Reagan National as the \"Hurricane Hunters\" spent the day talking about their mission and hurricane safety. School groups and the general public toured these special planes that fly into the eye of the storm. Colonel <mark>Brian May</mark> is one of the pilots that flies these missions, \"It's like riding a roller coaster through a car wash, it really is. You're getting bounced around, we can drop, we can hit a down draft and lose 1500 feet like that .\" Hayden Buell was on a field trip today learning about the threat from tropical systems, \"It's very important for the hurricane hunters to go inside of hurricanes and warn people, otherwise a lot more people would get injured by Hurricanes .\" The scientists that fly into the storms collect data critical in forecasting the track and intensity of tropical systems that make for better forecasts and better planning by emergency personnel. Dr. Rick Knabb is the Director of the National Hurricane Center, \"The good thing about hurricanes is that they don't impact severely any one community very often, when they do it's really bad. and if you haven't prepared in advance and you're just wishing the hurricane problem away, you're putting yourself in a position of weakness. Wind and water are both hazards that can affect the Washington area. If you get a strong enough hurricane coming ashore, you could get hurricane force winds here, storm surges can be pushed up the Chesapeake and up the Potomac. heavy rainfall can cause flooding near the coast and well inland .\" Colonel <mark>May</mark> appreciates the seriousness of what and his team do, \"we understand the information that we're collecting to help with that cone of uncertainty and the model predictions that the hurricane center puts out. . it's just too valuable, too important. Obviously there's inherent risks in flying, but we take what we do very serious...very safety conscience .\" The Hurricane Hunters Have 10 WC-130s in their fleet. In the Atlantic Basin, as dangerous as the mission is, they've never lost one. The last time a plane was lost was was October 12, 1974 when a \"Typhoon Tracker\" out of Guam was lost. The plane was flying out of the Philippines and was lost while trying to get a second fix on Typhoon Bess. © 2017 WUSA-TV", "articleID": "2017050920_00448071_W", "names": {"Brian May": ["Q15873", "Q45923599"]}}, {"date": "2017-05-09", "url": "http://m.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=11852988", "content": "America's Cup cats could harm turtles Save Wednesday, 10 May 2017 SHARE: Facebook Twitter Google + Email The New Zealand Herald SHARE: Facebook Twitter Google + Email The razor-sharp rudders and foils of the America's Cup boats, which are capable of travelling up to 50 knots, could harm local sea life. Photo: Hamish Hooper/ETNZ There are fears the fleet of America's Cup catamarans may pose a threat to local sea life in Bermuda. Conservation groups in Bermuda are rounding up sea turtles on the Great Sound ahead of the regatta opening on May 27. The incoming fleet of catamarans, which are capable of speeds up to 50 knots, could potentially harm the sea turtles. To protect their numbers, the local authorities are temporarily relocating them to a purpose-built ocean enclosure near the Bermuda Aquarium, Museum and Zoo. Their relocation will have a low impact on other species, according to a Bermuda Government press release issued to the Royal Gazette. A collision with a sea turtle could also have a potentially devastating impact on a team's campaign. Softbank Team Japan skipper <mark>Dean Barker</mark> told the Royal Gazette last month there were concerns the hard shells of the turtles could seriously damage some of the most expensive items on the multi-million dollar catamarans - their razor-edged foils and rudders. \"We've seen a lot of turtles and other debris out there and we try to avoid them wherever possible. You can't engineer daggerboards or rudders strong enough to withstand hitting something like that. It is a concern .\" Continued below. Collection of the turtles already underway in advance of the America's Cup qualifiers later this month; by July the turtles will be back in the same area where they were originally located. The operation is being carried out by America's Cup Bermuda (ACBDA), the Ministry of the Environment and relevant environmental organisations. Mike Winfield, CEO of the ACBDA, said in a statement: \"There will be a vastly increased level of marine traffic in the Great Sound in late May and June .\" We began and continue with the objective of capturing the turtles safely, looking after them during the enhanced traffic volume period and then returning them to their habitats. \"<mark>Ian Walker</mark>, principal curator of the Bermuda Aquarium, Museum and Zoo, said the ACBDA came to the scientific community expressing concern about the level of marine traffic in the Great Sound in May and June and asking for assistance in minimising the risks this could present to marine wildlife .\" Working with local sea turtle experts, the team collectively developed a plan to capture and relocate these animals in late May and June which is expected to reduce the risk to animals while keeping them in a safe and humane manner. \"Share this article SHARE: Facebook Twitter Google + Email", "articleID": "2017050923_00366302_W", "names": {"Dean Barker": ["Q3020624", "Q5245999"]}}]