[{"date": "2017-05-09", "url": "http://m.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=11852988", "content": "America's Cup cats could harm turtles Save Wednesday, 10 May 2017 SHARE: Facebook Twitter Google + Email The New Zealand Herald SHARE: Facebook Twitter Google + Email The razor-sharp rudders and foils of the America's Cup boats, which are capable of travelling up to 50 knots, could harm local sea life. Photo: Hamish Hooper/ETNZ There are fears the fleet of America's Cup catamarans may pose a threat to local sea life in Bermuda. Conservation groups in Bermuda are rounding up sea turtles on the Great Sound ahead of the regatta opening on May 27. The incoming fleet of catamarans, which are capable of speeds up to 50 knots, could potentially harm the sea turtles. To protect their numbers, the local authorities are temporarily relocating them to a purpose-built ocean enclosure near the Bermuda Aquarium, Museum and Zoo. Their relocation will have a low impact on other species, according to a Bermuda Government press release issued to the Royal Gazette. A collision with a sea turtle could also have a potentially devastating impact on a team's campaign. Softbank Team Japan skipper <mark>Dean Barker</mark> told the Royal Gazette last month there were concerns the hard shells of the turtles could seriously damage some of the most expensive items on the multi-million dollar catamarans - their razor-edged foils and rudders. \"We've seen a lot of turtles and other debris out there and we try to avoid them wherever possible. You can't engineer daggerboards or rudders strong enough to withstand hitting something like that. It is a concern .\" Continued below. Collection of the turtles already underway in advance of the America's Cup qualifiers later this month; by July the turtles will be back in the same area where they were originally located. The operation is being carried out by America's Cup Bermuda (ACBDA), the Ministry of the Environment and relevant environmental organisations. Mike Winfield, CEO of the ACBDA, said in a statement: \"There will be a vastly increased level of marine traffic in the Great Sound in late May and June .\" We began and continue with the objective of capturing the turtles safely, looking after them during the enhanced traffic volume period and then returning them to their habitats. \"<mark>Ian Walker</mark>, principal curator of the Bermuda Aquarium, Museum and Zoo, said the ACBDA came to the scientific community expressing concern about the level of marine traffic in the Great Sound in May and June and asking for assistance in minimising the risks this could present to marine wildlife .\" Working with local sea turtle experts, the team collectively developed a plan to capture and relocate these animals in late May and June which is expected to reduce the risk to animals while keeping them in a safe and humane manner. \"Share this article SHARE: Facebook Twitter Google + Email", "articleID": "2017050923_00366302_W", "names": {"Ian Walker": ["Q30070066", "Q356378", "Q38589551", "Q57306591", "Q5983175", "Q5983179", "Q5983186"]}}, {"date": "2017-05-10", "url": "http://www.eagletribune.com/news/trump-budget-would-slash-funds-from-opiate-fight/article_d1c0ac27-bbe9-5a1e-bf9f-7f5a6cd7d3a5.html", "content": "Trump budget would slash funds from opiate fight By Kery Murakami Washington Reporter 3 min ago Trump budget would slash funds from opiate fight By Kery Murakami Washington Reporter 3 min ago WASHINGTON--On a spring day in southern Kentucky two years ago, 200 worried residents gathered in rural Somerset's community center to hear police address the deadly opiate epidemic in the area. Some in the room had lost loved ones to the scourge, including Wanda Absher, whose son died of a heroin overdose. They wanted to know what the authorities were doing about it. Absher, safe schools coordinator for the Pulaski County Board of Education, helped organize the session with the help of a federal anti-substance abuse grant--the kind that President Donald Trump's recommended budget for the fiscal year starting Oct. 1 will likely eliminate. \"We can't just give people Naracan and think that's going to prevent addiction,\" she said. \"Drug prevention and education is the key to making an impact and getting to children earlier in age .\" Somerset schools have received roughly $500,000 in grants over the last five years to pay for workbooks and other materials teachers use in classrooms from kindergarten to grade 12 in their weekly discussions. Kindergarteners, for example, are warned not to assume tiny colorful pills are candy. Members of Congress representing communities ravaged by opioids have been quick to condemn Trump's budget plan to slash from $388 million to $24 million per year funding for the U.S. Office of National Drug Control Policy, and completely do away with drug-fighting grants for community groups and law enforcement agencies. \"Congress holds the purse strings for the federal government,\" said Congressman Hal Rogers, Kentucky Republican and member of the House Appropriations Committee, in a statement. \"We will ensure funding is sufficient to continue combatting the deadly drug abuse epidemic in the years ahead .\" More broadly, the concern over the sharp cuts to drug assistance programs has added to the discord between the Trump administration and Republicans in Congress over the president's spending priorities, particularly those reductions that would impact the rural areas Trump courted in his campaign. Trump wants to shift billions in spending from domestic programs to national security and projects like his Mexican border wall to stop illegal immigration. The president's preliminary budget plan released in March proposed crippling the drug policy office, cutting a number of agricultural grant programs and eliminating an agency designed to create jobs in 13 Appalachian states. Congress, though, signaled its resistance last week when it passed a short-term budget to fund the government to the end of the current fiscal year on Sept. 30. The approved measure didn't just preserve funding Trump wants to cut, including the Appalachian Regional Authority. It increased it. Sen. <mark>Shelley Moore Capito</mark>, R-W.V., in a statement Tuesday, said Congress made its feelings known it won't go along with eliminating programs it deems important to the public interest. \"Any proposal to eliminate them without a clear understanding of how their missions will be carried forth will not be considered and are not helpful to our efforts in fighting this (drug) scourge in our nation,\" she said. In the latest dispute, the Trump administration hasn't said why it is considering reducing anti-opioid funding; only that it wants to streamline government agencies. White House Budget officials have declined to comment in detail, saying it is still working on the president's budget before a final version is released later this month. But Deputy Press Secretary <mark>Sarah Sanders</mark> said last week that combatting the opioid epidemic is still a top priority for Trump. The drug policy office is seen as playing a crucial role in combating the opiate crisis. It makes sure federal agencies are on the same page in fighting addiction, administers grants and conducts research into how best to deal with the epidemic, according to the version of its website under former President Barack Obama's administration, a description that was removed when Trump took office. Also on the chopping block is the Drug-Free Communities Support Program, which provided $85.9 million in grants to 698 community groups, school districts, hospitals and others for local drug prevention efforts. The High Intensity Drug Trafficking Areas Program, which distributed $250 million in grants to local law enforcement agencies in high drug areas, is also being considered for elimination. No state is more concerned with plans to roll back federal drug assistance programs than West Virginia, where rising opioid and heroin addiction claimed 864 deaths last year, marking it as the state with the highest drug overdose death rate in the nation, according to U.S. Health and Human Services data. Sen. Joe Manchin, D-W.V., called cutting the drug policy office \"criminal\" in a statement. Manchin, a member of the Senate appropriations committee, vowed: \"I will do everything I can to prevent this from happening .\" Rep. <mark>Evan Jenkins</mark>, a West Virginia Republican, who announced Monday he is running for Manchin's seat in 2018, also opposed reductions in drug fighting efforts. \"While I can appreciate the president's desire to cut spending, the Office of National Drug Control Policy plays an important role in combating the drug crisis in West Virginia and across our nation,' said <mark>Jenkins</mark>, a member of the House appropriations committee .\" In particular, \"he added,\" the High Intensity Drug Trafficking Areas Program works hand in hand with law enforcement across West Virginia to keep dangerous drugs out of our communities. \"Kery Murakami is the Washington reporter for The Eagle-Tribune and its sister newspapers and websites.", "articleID": "2017051022_00815716_W", "names": {"Evan Jenkins": ["Q5415437", "Q56597319"], "Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"], "Shelley Moore Capito": ["Q459618", "Q47506415"]}}, {"date": "2017-05-11", "url": "https://www.thisisanfield.com/2017/05/iago-aspas-failed-liverpool-career-ending-man-uniteds-europa-league-hopes/", "content": "Ex-Liverpool striker Iago Aspas has no problems with his troubled campaign on Merseyside in 2013/14, having recaptured his form at Celta Vigo. Aspas spent two short years on the books at Anfield, but only one season with the Reds, making 15 appearances during their ill-fated title challenge. The Spaniard scored just one goal, laying on another, with the enduring memory of his time with the club a weak attempted corner in an eventual 2-0 loss to Chelsea at Anfield. Aspas left to join Sevilla on loan in 2014, finally ending up back with Celta a year later. There, he has revived his career, scoring 42 and assisting 13 in 85 appearances so far, as well as a sensational goal on his debut for Spain against England in November. Thursday night gives Aspas the chance to prove himself again to a wider audience, when Celta take to Old Trafford for the second leg of their Europa League semi-final clash with Man United. And Aspas is eager to put Jose Mourinho's side to the sword, to repay Liverpool supporters after his failure in the Premier League. ▼ Article continues below ▼ \"It was a great season for Liverpool...I just wish I could have played a bigger part,\" he told the Mail. \"The corner is the last memory they have of me but football always gives you another chance .\" Let's hope the new lasting memory of me in England is knocking Manchester United out of Europe, for the sake of Celta Vigo, and for the happiness it would bring to Liverpool supporters too. \"Aspas has previously been criticised for his failure to integrate at Liverpool, often resembling a spare part in <mark>Brendan Rodgers</mark>' formidable squad. This saw him play just 468 minutes in all competitions, but the striker believes there are mitigating factors behind his struggle: chiefly, the form of <mark>Luis Suarez</mark> and Daniel Sturridge .\" Sturridge scored 22 league goals, I think, and <mark>Luis</mark> 31, so it's normal that I didn't get many chances, \"he explained. ▼ Article continues below ▼\" It didn't annoy me; I understood that I couldn't play with them at that level. \"There was also a culture shock for Aspas, who left Liverpool unable to speak English, having travelled over with his family and spoken to <mark>Rodgers</mark> in his native tongue. All that matters now, however, is victory over United, and Aspas will have the backing of his old supporters on Thursday .\" I know that Liverpool fans want Manchester United to lose just as United fans wanted Liverpool to be beaten by Sevilla in last year's Europa League final, \"he said .\" We have to play with no fear; only a win will do so we have to go for it. \"", "articleID": "2017051109_00347436_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "Luis Suarez": ["Q26517", "Q270367"]}}, {"date": "2017-05-11", "url": "http://www.breitbart.com/news/massive-snake-slowly-slithers-across-south-africa-golf-course/", "content": "Massive snake slowly slithers across South Africa golf course by UPI 11 May 2017 0 11 May, 201711 May, 2017 SIGN UP FOR OUR NEWSLETTER May 11 (UPI)--A massive python was spotted slinking past golfers at a golf course in South Africa on Wednesday. The KwaZulu-Natal Amphibian and Reptile Conservation shared video captured by Kyle Caitano of the enormous snake slithering toward a sand trap at the Zimbali Country Club. Conservation staff member, <mark>Nick Evans</mark>, said the giant snake was likely a Southern African Python measuring about 11 feet long and \"made of pure muscle .\" Video shows the python slowly crawling past a golfer before winding its body side to side toward a walkway after apparently becoming startled. \"Notice how, at first, it appears to move a bit like a slug, moving in a straight line,\" <mark>Evans</mark> said. \"As you'll see towards the end of the video, when it feels threatened, it is very capable of moving rather quickly!\" <mark>Evans</mark> said the golfers were lucky to witness one of South Africa's largest snake species, which have faced dwindling numbers due to poaching. \"What an amazing encounter! Lucky golfers!\" <mark>Evans</mark> said. \"I'd definitely take up the sport if I could see this on a regular basis!\" Comment count on this article reflects comments made on Breitbart.com and Facebook. Visit Breitbart's Facebook Page. BREITBART CONNECT", "articleID": "2017051116_00525742_W", "names": {"Nick Evans": ["Q3339740", "Q7025358", "Q7027082", "Q723355", "Q981527"]}}, {"date": "2017-05-12", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/vJorMAsE6Ow/us-austria-politics-idUSKBN18814J", "content": "Austrian Foreign Minister Kurz calls for snap election World News | Fri May 12, 2017 | 6:00 am EDT Austrian Foreign Minister Kurz calls for snap election left right Austria's Foreign Minister Sebastian Kurz leaves a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 1/4 left right Austria's Foreign Minister Sebastian Kurz addresses a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 2/4 left right Austria's Foreign Minister Sebastian Kurz addresses a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 3/4 left right Austria's Foreign Minister Sebastian Kurz addresses a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 4/4 VIENNA Austrian Foreign Minister Sebastian Kurz called on Friday for a snap parliamentary election but stopped short of saying he would take over as head of the conservative party in the coalition government and force that move. Kurz, 30, is widely favored within his People's Party (OVP) to succeed party leader Reinhold Mitterlehner, who said on Wednesday he was stepping down. Several polls suggest that Kurz's taking over would boost the OVP's support and leapfrog it into first place. Surveys have repeatedly shown the far-right Freedom Party to be the most popular in Austria, closely followed by Chancellor Christian Kern's center-left Social Democrats. \"I personally believe early elections would be the right path,\" Kurz told a news conference. The next elections are due by autumn 2018. Whether a snap election is called is likely to depend on whether Kurz takes on the job of party leader. He said he would do that only if he were given more powers, to avoid the kind of in-fighting that prompted Vice Chancellor Mitterlehner to quit. \"Whoever takes over the leadership must have the possibility to set a party line, and he must above all be able to make staffing decisions,\" Kurz said, in an apparent reference to the strong influence within the party of figures such as the governors of Austrian provinces. The party leadership is due to meet on Sunday to decide who should replace Mitterlehner. Kern, who on Wednesday urged his conservative partners to stay in the government, had no immediate comment. (Reporting by Francois Murphy and Kirsti Knolle; Editing by <mark>Michael Shields</mark>)", "articleID": "2017051210_00166579_W", "names": {"Michael Shields": ["Q15454888", "Q57923083"]}}, {"date": "2017-05-14", "url": "http://www.freepressjournal.in/world/donald-trump-may-be-a-poet-without-knowing-it/1067682", "content": "Home / World / <mark>Donald Trump</mark> may be a poet without knowing it! <mark>Donald Trump</mark> may be a poet without knowing it!--By | May 14, 2017 12:08 am Agencies FOLLOW US: make poetry great again Oslo: \"I know words...I have the best words,\" <mark>Donald Trump</mark> had once said in his superlative way. Now those words by the US President have been pulled together as a collection of poetry in Norway. Who knew? <mark>Trump</mark> the poet? \"What <mark>Trump</mark> says is closer to poetry and fiction than to reality,\" said Chris Felt, the Norwegian man who created the collection. \"We're appalled that his rhetoric which seems to have little thought or preparation behind it could have won an electoral campaign,\" Felt said. The book's tongue-in-cheek title is \"Make poetry great again'--a play on <mark>Donald Trump</mark>'s campaign slogan\" Make America great again'. The content is composed strictly from speeches, interviews and other statements that the 70-year-old has given over the years. Among the choice bits turned to poems in the book are words about his daughter that <mark>Donald Trump</mark> said around 10 years ago. \"I have said if Ivanka were not my daughter, perhaps I would be dating her .\" Felt said the words may be \"terribly macho, pitiful and confusing but when the quotations have space around them I see other facets of him\". Reading <mark>Donald Trump</mark>'s words as poetry, Felt said he felt in them \"more despair, more insecurity and perhaps an inferiority complex\". According to the publisher, Kaggen, the first print run was 2,000 copies--one of which has been sent to <mark>Donald Trump</mark>. Now the question is whether his penchant for superlatives will make it a \"bestseller\". Share this Post:", "articleID": "2017051320_00483408_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-05-15", "url": "http://www.maravipost.com/karonga-north-west-residents-want-undule-mwakasungula-mp/", "content": "Home \"\"\"Karonga north west residents want Undule Mwakasungula to be their MP World Top News 1 Karonga north west residents want Undule Mwakasungula to be their MP By Maravi Post correspondent / Monday, 15 May 2017 02:31 PM / Leave a Comment /, Steven Simsokwe, Undule Mwakasungula / 0 views Tags: <mark>John Bond</mark> Kamwamb Mwakasungula Traditional leaders and communities from the Karonga north west constituency, have asked Undule Mwakasungula, the former executive director of the Center for Human Rights and Rehabilitation (CHRR), to become their Member of Parliament (MP) through the 2019 elections. According to them, they are ready to give Mwakasungula enough support to win the 2019 general elections. They said they are regretting why they voted for the current MP, <mark>John Bond</mark> Kamwambi, who has done nothing despite being on the government side .\" Mwakasungula has been helping us in different ways, even before he joined the CHRR. He has a loving heart to this constituency, we therefore don't want to lose his work, \"some community members said. They said they have confidence in Mwakasungula, especially because he has demonstrated to be a good leader. In his response, Mwakasungula, who is now a pastor, said he needs to ask God first, before responding to the community's call .\" My response to this is that I have heard the people's demand, but I need to pray over it first. I need to ask God if this is a mission He wants me to pursue. But it's a great honour for me to have people's trust, that I can serve them better. I thank God for all this grace, \"Mwakasungula said. The Executive Director for Karonga Youths for Justice and Development (KYJD), Steven Simsokwe said the constituency needs a strong and educated person because it is near the district town .\" This is a big constituency, it really needs to be represented by someone who is strong and educated, \"Simsokwe said. Simsokwe, one of the norther region's fearless youth activists, said Mwakasungula deserves this because of his type of leadership and care for the community .:", "articleID": "2017051514_00561032_W", "names": {"John Bond": ["Q16106872", "Q16186593", "Q1676381", "Q21259086", "Q3181095", "Q542345", "Q54323547", "Q6222420", "Q6222422", "Q6222426"]}}]