[{"date": "2017-05-15", "url": "http://www.nbcconnecticut.com/entertainment/the-scene/Third-Show-Added-for-Harry-Potter-Concert-in-Hartford-422357974.html", "content": "Third Show Added for Harry Potter Concert in Hartford By Amanda Lundergan NEWSLETTERS Receive the latest the-scene updates in your inbox Email Privacy policy | More Newsletters Warner Bros.. Entertainment Inc.. Music from one of the most popular film series in history will be coming to Hartford in November and ticket sales have been so popular that a third show was added. The Hartford Symphony Orchestra will perform the score from Harry Potter and the Sorcerer's Stone at the Bushnell Center for the Performing Arts. Sneak Peek Inside \"Wizarding World' 2016 Universal Studios The original performance was scheduled for 7 p.m., Saturday, Nov. 4 After the show was announced, a second performance was added at 1 p.m. due to popular demand and a third show has been added for 3 p.m. on Sunday, Nov. 3 at 3 p.m.. The Harry Potter Film Concert Series was created by CineConcerts and Warner Bros.. Consumer Products. Performances kicked off last June and are scheduled for more than 35 countries around the world through 2018. US Accuses Syria of Mass Executions, Burning the Bodies\" Audiences will be able to relive the magic of the film in high-definition on a 40-foot screen while hearing the orchestra perform <mark>John Williams</mark>' unforgettable score, \"Amanda Savio, of the Hartford Symphony, said in a news release. The concert will feature the symphony orchestra performing, to picture, every note from the film. One of the most sought-after conductors of film music, CineConcert President Justin Freer, will conduct the show in Hartford .\" The Harry Potter film series is a once-in-a-lifetime cultural phenomenon that continues to delight millions of fans around the world, \"Freer said .\" It is with great pleasure that we introduce for the first time ever an opportunity to experience the award-winning music scores played live by a symphony orchestra, all while the beloved film is simultaneously projected onto the big screen. It will be an unforgettable event. \"Woman Charged With Murder After Chicago Teen Rammed Into Tree Tickets went on sale this morning at hartfordsymphony.org, in person at the Bushnell Box Office, and by phone at 860-897-5900. For more information about the Harry Potter Film Concert Series, visit harrypotterinconcert.com .\" WannaCry' Cyberattack Ebbs, But Experts See Risk of More Published 1 minute ago Get the latest from NBC Connecticut anywhere, anytime Download the App Available for IOS and Android Follow NBC Connecticut", "articleID": "2017051518_00898734_W", "names": {"John Williams": ["Q11310708", "Q12633687", "Q131285", "Q1367551", "Q14950380", "Q15429336", "Q15821602", "Q1606354", "Q16105524", "Q16224055", "Q1702438", "Q18385583", "Q19325807", "Q20821181", "Q20821436", "Q21176199", "Q21481534", "Q22019624", "Q2333172", "Q24249667", "Q25190475", "Q2567288", "Q2688830", "Q28434529", "Q29643791", "Q30122882", "Q30612128", "Q370293", "Q3809678", "Q46993819", "Q49546744", "Q51585685", "Q54932733", "Q56187903", "Q56597939", "Q56604636", "Q6264302", "Q6264304", "Q6264308", "Q6264311", "Q6264317", "Q6264319", "Q6264346", "Q6264352", "Q6264355", "Q6264357", "Q6264363", "Q6264366", "Q6264372", "Q6264380", "Q6264382"]}}, {"date": "2017-05-15", "url": "http://rss.cnn.com/~r/rss/cnn_allpolitics/~3/1aarWYngrWI/index.html", "content": "GOP senators question whether Cornyn should get FBI job Updated 2146 GMT (0546 HKT) May 15, 2017 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. JUST WATCHED Sen. John Cornyn is on the short list to be the next FBI director Some of his Republican Senate colleagues want someone else (CNN) Influential Senate Republicans are questioning whether one of their own--Senate Majority Whip John Cornyn--should be tapped to run the FBI, amid a deeply chaotic political environment after President Donald Trump fired James Comey as director of the bureau. While Cornyn is one of the more popular members of the Senate GOP Conference, a number of his colleagues are skeptical that he would be the right choice for the job, worried that such a pick would be viewed as too political at a time when many critics are questioning whether Comey was fired to slow-walk the FBI's investigation into alleged Russian coordination with the Trump campaign during last year's elections. On Sunday, Senate Majority Leader Mitch McConnell declined to put his weight behind his top deputy, instead pushing another potential candidate, Merrick Garland, who was former President Barack Obama's Supreme Court pick before the majority leader led an effort to scuttle his nomination last year. Sen. Lindsey Graham, who serves on the Senate judiciary committee with Cornyn, suggested that it made sense to name an FBI agent to the post--rather than the Texas Republican. And on Monday, Sen. <mark>Susan Collins</mark>, who sits on the intelligence committee with Cornyn, said it made sense to choose either Garland or <mark>Mike Rogers</mark>, a former House intelligence committee chairman and FBI special agent. \"I think the world of John Cornyn, and he would be a great choice in normal times, but we're not living in normal times,\" Sen. <mark>Susan Collins</mark>, a Maine Republican, told CNN Monday. Read More With Garland, <mark>Collins</mark> said: \"No one could argue that he was beholden to anybody in any way and he would bring integrity and independence to the job .\" On Monday, Cornyn, who has insisted he has not been offered the job, told CNN he interviewed this weekend for 45 minutes with Attorney General Jeff Sessions, one of his former Senate colleagues, and Rod Rosenstein, who is the deputy attorney general. But Cornyn declined to say whether the Russia probe or Comey's firing were discussed. And he would not say if there was a pledge for loyalty, as Trump reportedly asked Comey to commit to earlier this year, though the White House has denied that account. \"I met with the attorney and the deputy attorney general. I told him I was interested in having a conversation and, basically, that's what we did,\" Cornyn said. Asked about the White House's shifting explanations for Comey's firing, Cornyn said he still backed the President's decision and supported the initial reasoning behind the firing--that Comey mishandled the Clinton email investigation. \"I found the Rod Rosenstein email compelling--that's still my view .\" Cornyn would not comment about Trump's threats to release a tape of his conversations with Comey--or if Congress should obtain those tapes. But <mark>Collins</mark>, like other Republicans, said the White House should be prepared to turn them over. \"We have no idea whether or not there are tapes but if there are tapes then they should be turned over,\" <mark>Collins</mark> said. \"That issue was settled many years ago when the Supreme Court ruled in 1974 that the tapes that President (Richard) Nixon had should be turned over to Congress .\" Democrats have vowed to try to block the new FBI director until Rosenstein names a special prosecutor to investigate the Russia probe. But they would need to court at least three Republicans to be successful. And <mark>Collins</mark> signaled she would not go that route. \"I don't think that's a good strategy at all,\" <mark>Collins</mark> said, adding that she wanted to question Rosenstein Thursday on whether a special prosecutor was indeed needed.", "articleID": "2017051600_00054126_W", "names": {"Mike Rogers": ["Q1933467", "Q970515"], "Susan Collins": ["Q22279", "Q7647692"]}}, {"date": "2017-05-16", "url": "http://reneweconomy.com.au/how-cheap-is-solar-cheap-enough-to-cool-the-air-outside-85335/", "content": "How cheap is solar? Cheap enough to cool the air outside By Giles Parkinson on 16 May 2017 How cheap is solar? Cheap enough, says the head of the Australian Renewable Energy Agency, to drive the transformation of our grid to zero emissions. Cheap enough, he says, to inspire some people to install air conditioners on their verandah to cool the air outside the house, as well as inside. Source: <mark>Wendy Miller</mark>, Senior Research Fellow, Queensland University of Technology (via The Conversation) The latter, quite bizarre example was given by ARENA CEO Ivor Frischknecht at the recent Emissions Reduction conference in Melbourne to illustrate just how cheap solar has become. He came across a home owner in Townsville, north-eastern Queensland, who had installed a very large rooftop solar system, and planned to use it to power an air conditioning unit on the verandah. \"He likes to have cool air on his face while he is sitting outside outside,\" Frischknecht said. \"And this is fine, because if you are only running it in middle of day, and using the solar, the energy is free .\" Indeed, noted Frischknecht, solar was becoming so cheap, and will become so abundant, that we will reach the situation where the kilowatt hours of use (i.e. the production) are effectively free. The cost will come in managing the variability, and integrating it into the grid. But even here, contrary to much that is written, Frischknecht says the technologies to do that are available now, in the form of battery storage, demand response, pumped hydro and a \"whole bunch of solutions that can ensure that the lights stay on .\" The challenge comes down to rewriting the market rules and regulations, and reframing business models, so that these technologies are rewarded for their services, and not punished. He cited the use of battery storage. \"If you have a battery today and charge it up--you have to pay transmission costs and distribution costs and a share of RET, and when you discharge it again and sell the output, you pay all those costs again,\" Frischknecht said. \"You are adding 50 per cent to the cost of energy getting stored. That's a pretty big barrier to put in place of a mechanism we need .\" Frischknecht says it is not hard to look forward and imagine a world where many things would be quite different, and when a lot of centralised fossil fuel generation is made redundant by the falling costs of renewables. \"The cost of solar PV will be so cheap it will literally cover every surface--packaging, buildings, cars, roads. Energy will be cheap, but we will still got this variable output issue. We are going to have to figure out different ways of pricing and dealing with variable output .\" RenewEconomy Free Daily Newsletter", "articleID": "2017051604_00612021_W", "names": {"Wendy Miller": ["Q56099345", "Q57952091", "Q7982727"]}}, {"date": "2017-05-18", "url": "http://www.timesdaily.com/sports/alabama_football/alabama-struggles-under-new-baseball-coach/article_967be691-67dd-55fb-8a54-19951c74dea9.html#comments", "content": "Alabama has struggled under first-year baseball coach Greg Goff. Entering this weekend's final series at Vanderbilt, the Crimson Tide (19-32, 5-22 SEC) is closing in on a potentially program-worst record. Just three months into the job, new Alabama athletic director <mark>Greg Byrne</mark> has already heard rumblings from fans regarding the season-long struggles. \"Obviously it's not a year that anybody wants,\" <mark>Byrne</mark> said Wednesday at the Regions Tradition Pro-Am from the Greystone Golf and Country Club in Hoover. \"At the same time, too, I like the effort the kids have continued to make and I know the coaches have been out there recruiting and that's what you want them to do .\" To date, Alabama's worst season came in 1994 when the Tide went 21-35 overall and 4-22 in SEC play. And while a series sweep against rival Auburn helped surpass the season-low conference win mark, Alabama could still finish with a program-worst winning percentage if it is swept by the Commodores. But while he commiserates with some fans, <mark>Byrne</mark> remains supportive of Goff--the last coaching hire his predecessor Bill Battle made before retiring. \"For all of our sports, we want to compete for championships--baseball included,\" <mark>Byrne</mark> said. \"I know how passionate our fan base is, that's what separates us from our competition and makes us so special ....This year's not the year we wanted to have at all, but at the same time, I like the steps we're taking moving forward to give us the best opportunity to succeed long term .\" Johnson updates Key's status Before Braxton Key declared for the NBA draft, Alabama coach Avery Johnson laid out his expectations for how the next month would play out. With just a week until the NBA's deadline of May 24 to decide whether to stay in the draft or return to school, the Crimson Tide's 6-foot-8 freshman wing has only had one team tryout (with the Boston Celtics) and hasn't been invited to either of the national pre-draft combines. None of it surprised Johnson. \"When this process started and he came in and said he was very serious about declaring, we talked about what that process would look like,\" Johnson said Wednesday from the Regions Tradition Pro-Am. \"We provided he and his family with all the information, and I told him what I thought the prognosis would be in terms of whether he would get drafted or not, get invited to Chicago or not, how many workouts he'd eventually have, and it's pretty much right in line with what's (happened).\" Despite a lack of interest, Key--who was named to the SEC's All-Freshman team after leading Alabama in points per game and minutes played--has continued to keep tabs with Johnson while working out near his hometown of Charlotte. All the while, the door to return to the Tide remains wide open. \"If he decides to come back, all the returning players know that by 3 o’clock on the 29th, they all have to be on campus and we have a team dinner that night,\" Johnson said. \"We'll know what we're dealing with in the next couple of days .\" Subscribe", "articleID": "2017051805_00027269_W", "names": {"Greg Byrne": ["Q3116191", "Q57633545"]}}, {"date": "2017-05-22", "url": "https://tribune.com.pk/story/1415742/is-globalisation-dead/", "content": "The Express Tribune Share Tweet Email The writer is a former caretaker finance minister and served as vice-president at the World Bank A decade or two ago, there was great confidence on the part of most social scientists that the world was finally settling down in ways that would help all countries and all people. With the Soviet Union having collapsed in 1991, with Eastern Europe having abandoned communism and with China and its southern neighbours having adopted forms of capitalism to manage their economic systems, ideological conflict ended. The American sociologist Francis Fukuyama in his book titled The End of History celebrated these developments. He laid out the direction in which the world was headed. It was moving towards Western liberalism. This sense of confidence led a number of economists to develop policies they lumped together in what they called The Washington Consensus. This was done to help developing countries adopt policies that would quicken the rate of growth of their economies. This policy set had two important components. The most important of these concerned the size of the state and the functions the governments should perform. The Consensus opted for a minimalistic approach to governance. The state should leave the running of the economies to private enterprises. The government should lightly regulate private activity. The second important component concerned flow of trade, capital information and, to a limited extent, people. All these should flow across international borders without much hindrance. That way these factors will go to the places where return was high that would result in increased economic activities and add to global growth. However, with borders open, the benefits from increased global output would spread across the globe. That is the way the world did go for a couple of decades until two things happened and the freed private sector acted irresponsibly, in particular its financial component. Banks in the US lent huge amounts for housing to those who could not afford to service the loans that were being aggressively marketed. The banks did not keep these loans on their books. They combined them into fancy products that were rated highly by the rating agencies and sold to the institutions, such as pension funds and insurance companies that had large amounts of long-term capital at their disposal. Thus was built a house of cards that collapsed in 2007, plunging the world into what came to be called the Great Recession. This lasted for a couple of years and changed for good the structure of the global economy. A \"new norm\" came into being in which the rates of growth slowed down to the point that equalled increase in productivity and in the size of the labour force. However, in most developed countries natural increase in the workforce was negative unless immigration was allowed. People came in from the crowded parts of the world to fill the job markets in rich countries. People-flows became important for the economies of the US and the UK. The former received a lot of illegal labour from Mexico, while the latter had legal migrants from Eastern Europe, in particular from Poland. The migrants affected the labour market in ways that hurt the low-income earners. This group included what sociologists call \"low-income, non-college educated white population .\" They formed the base of support for the <mark>Donald Trump</mark> and the movement in Britain to leave the EU. In both countries this disaffected and disgruntled population was fed anti-globalism. Banning the entry of immigrants and walking out of trade deals were sold as the policies that will rescue this group from its economic troubles. With <mark>Trump</mark> elected president and with Britain's Prime Minister Theresa May having sent the divorce letter to Brussels, the stage is set for more anti-globalisation moves. But has globalisation really hurt these countries? The answer comes from a recently published Washington-based study by the Peterson Institute for International Economics. According to the report, trade has contributed significantly to the rise of living standards in the US. Since the end of WWII, the US has gained $2.1 trillion a year, which is equivalent to 11 per cent of the current estimate of the size of the country's economy of $18.5 trillion. This has benefited low-income groups whose budgets are weighted towards such manufactured products as shoes, clothing and electronics. Also, only modest job losses resulted from trade. In recent years, imports displaced 312,500 jobs per year but the economy on average created 156,250 jobs. Most of the job losses were because of technological advances, not because of trade. The report also found that since 2003, benefits from trade have exceeded costs by a factor of five to one. However, as the economist Mancur Olson pointed out, some time ago, gains from trade are spread among millions of consumers while the pain of job loss is concentrated in the areas where factories close. These were the areas that voted for <mark>Trump</mark> and cast their votes in favour of Brexit. As the economic writer Robert J Samuelson wrote in a recent article, \"politically globalisation shifts blame abroad. Foreigners--their exports, subsidies, exchange rates or whatever--are the villains. We are the victims. Little wonder that <mark>Trump</mark> has found anti-globalisation an irresistible pitch. So have many others. Yet this has created a dilemma for trade policy. What's good politics is bad economics and vice versa .\" It is hard to predict what is in store for the <mark>Trump</mark> presidency. On May 17th, the Justice Department appointed a Special Counsel to investigate the nature of president's and his team's contacts with Russia. No matter what they find from this investigation, a great deal of damage has already been done to globalisation. Published in The Express Tribune, May 22 nd, 2017. Like Opinion & Editorial on Facebook, follow @ ETOpEd on Twitter to receive all updates on all our daily pieces.", "articleID": "2017052205_00250277_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-05-23", "url": "http://au.news.yahoo.com/a/-/sport/35615693/french-keen-to-make-sure-hes-no-1-eel/", "content": "<mark>Scott Bailey</mark> - AAP on May 24, 2017, 3:35 am Share Tweet Whatsapp Email Share French keen to make sure he s No. 1 Eel - Yahoo7 Pinterest Tumblr Bevan French is back from his knee injury and ready to stake his permanent claim on the Parramatta fullback spot. French returned for the Eels' in their 22-16 NRL loss to Canberra on Saturday night, after a six-week lay-off with a ruptured posterior cruciate ligament. He pulled up tender following Saturday's game, but is certain he will be fit to take on South Sydney at ANZ Stadium on Friday night. Currently without five-eighth <mark>Corey Norman</mark>, French has slotted straight in at the back with Clinton Gutherson, who deputised for French in his absence, now covering <mark>Norman</mark>. And such was Gutherson's form at fullback, the flashy French knows he has to earn the spot back. \"It's a big five weeks for me,\" French said. \"I want to play fullback and hopefully stay there all season...It is my preferred position. Hopefully I do cement the spot but it's what's good for the team .\" Gutherson's numbers at fullback are marginally better than those of the ultra-impressive French, while the pair can each fill a number of positions in the backline. \"Gutho is killing it wherever he plays,\" French said. \"He went really good at fullback when he was there...I've got to really keep my game up over the next few weeks .\" I was probably a bit off my game there on the weekend but hopefully I can turn it around this week. \"Key to that will be his combination with new halfback Mitchell Moses, given French's ability to find the try line once given the ball in open space. And while he admitted Moses at times looked\" lost \"in the Eels' attack last week, the pair had worked closely in video sessions to quickly remedy any problems they might have had combining .\" Mitch came in last week and offered quite a bit. He looked a bit lost at times attacking the try-line, but worked on that this week, \"French said .\" It was expected, we only had two sessions coming in, but still no excuses. \"We've watched a bit of video and seen what we need to work on .\" Share Tweet Whatsapp Email Share French keen to make sure he s No. 1 Eel - Yahoo7 Pinterest Tumblr", "articleID": "2017052318_00159532_W", "names": {"Corey Norman": ["Q20649212", "Q5170410"], "Scott Bailey": ["Q1464826", "Q6379124", "Q7435932"]}}, {"date": "2017-05-23", "url": "http://www2.kusports.com/news/2017/may/23/look-some-changes-now-bill-self-has-been-elected-p/", "content": "Keegan: Look for some changes now that Bill Self has been elected president Photo by Nick Krug Kansas University basketball coach Bill Self watches his drive from the first hole during the Bill Self/LPRD Golf Classic, Friday, June 17, 2016, at Eagle Bend. Proceeds from the event will benefit the Wee Folk Scholarship fund. Advertisement Now that Kansas basketball coach Bill Self has been elected president (of the National Association of College Basketball Coaches), what exactly does that mean to the state of college basketball? Well, look for some changes. For one thing, expect Self to turn into a tweeting fool at 3 a.m. Also, his skin will turn as orange as the Syracuse mascot and he will become Self-obsessed. President Self intends to build a wall around the KU campus so that when recruits visit, they won't be able to leave. They'll have no choice but to sign with the Jayhawks. And get this: He's going to get Kentucky coach John Calipari to pay for it. \"Trust me,\" he'll tweet at 3 a.m., \"Cal's footing the bill .\" President Self will see to it that every recruit who signs with either Duke or Kentucky is deported immediately. The fans have been known to raise the roof, figuratively, at Allen Fieldhouse. President Self will raise the roof literally because he is going to transform the field house into a massive tower: Self Tower. Self will proclaim the media \"the enemy of the American people\" and will send Chris Theisen to handle press briefings, but still will make appearances on \"the shows .\" On those shows, when asked how he'll go about devising a strategy for winning a 14th consecutive Big 12 title, Self will answer, \"From watching the General on the shows .\" Presumably, that will mean <mark>Bob Knight</mark>, who sadly no longer is on the shows much these days. President Self will do much of his work on the golf course, where his big hands will come in handy driving the ball 280-yards-plus. Self's term as president of the NABC might seem like an eternity, but will last just two years. President Self's vice president's first name is Mike and his last name is one syllable, Brey (Notre Dame). He will develop derogatory pet nicknames for opponents and won't even spare past NABC presidents. He'll refer to the Michigan State coach as \"Little Izzo .\" Henceforth, Self will refer to referee Ted Valentine as \"Lyin' Ted .\" Self is the third Kansas basketball coach to become president of the NABC. Phog Allen (1927-29) was the first and <mark>Roy Williams</mark> (2001-02) also filled the office that commands respect. Advisers will remind the president to conduct himself with the type of dignity associated with the lofty office. They'll do their best to keep him from tweeting at 3 a.m., but their best advice won't stand a chance against such a powerful urge. They'll lose that battle and he'll call them losers.", "articleID": "2017052402_00006651_W", "names": {"Bob Knight": ["Q16538199", "Q4933049", "Q888594"], "Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"]}}]