[{"articleID": "2018103020_00414328_W", "names": {"Tom Holmes": ["Q19874293", "Q23016967", "Q4499221", "Q50366051", "Q7816220"], "Michael Rosenthal": ["Q23302033", "Q24005022"], "Bob Sullivan": ["Q4934119", "Q888274"]}, "date": "2018-10-30", "url": "http://www.forestparkreview.com/9_12_11811/?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS", "content": "How would Jesus vote next Tuesday? How would Jesus vote next Tuesday? Opinion: Columns By <mark>Tom Holmes</mark> Pastor Walter Mitty sat at his office desk at the Poplar Park Community Church earlier this morning staring out the window at the maple tree whose leaves were starting to turn yellow. He'd often slip into this meditative kind of zone when he was frustrated, and this morning he was having a severe case of brain freeze. What happened was that early last week he felt that he had to write a sermon on how being a follower of Jesus should change the way you vote in the upcoming election. His problem was that the more he listened to people talking about whom they were going to vote for and why the more unsure he became regarding what to say when he would climb into the pulpit. For example, after church on Sunday he had driven up to Manitowoc to celebrate his nephew Brian's birthday. It was a cozy family affair--Brian, Brian's brother Matt, and Mitty's sister-in-law Susan. As he was about to blow out sixteen candles Brian confessed, \"It's been three years since dad died, and I still miss him .\" In a way, everyone was relieved that Brian had acknowledged the elephant in the room. And all nodded their heads when Brian added, \"But lately I find myself not choking up when I talk about him. Three years ago I wouldn't have thought that could be possible .\" Brian's acknowledgment seemed to open the door to other topics. \"Hey, Uncle Walt,\" began Brian's younger brother Matt. \"My friend Koobmeej asked me to help with the Immigrant and Minority Farmers Conference coming up soon. It's a lot of work, but what I really like is listening to Koob's grandfather tell stories about when he was growing up in Vietnam during the war .\" Mitty turned to Susan and asked, \"So they're doing OK since the government settled them here as refugees?\" \"Yes, for the most part,\" answered his sister-in-law. \"I think the latest census revealed that there are around 1,400 Hmong living in Manitowoc, and especially the third generation kids like Koob are fitting in. What tickles me is to see Koob wearing Packer gear. Growing up in the mountains in northern Vietnam his grandfather didn't even know what football was, and here we have Vietnamese kids playing on our high school football team .\" Mitty took a chance and said, \"When President Trump was in Wisconsin on Wednesday he didn't say anything good about immigrants .\" Susan sighed and replied, \"I know. I know. Walt, you're very aware that I voted for Trump two years ago, even though I thought that he was a spoiled little boy who treats people like crap. I voted for him because he promised to put pro-life judges on the Supreme Court, and now that that has been accomplished, I'm done with him. I'm voting for Tony Evers for governor. Walker thinks he'll win by hanging on to Trump's coat tails and I think he'll be in for a big surprise on Nov. 6 .\" On the three-hour drive home from Manitowoc, Mitty pondered how this red state family which he loved did not fit the stereotype of a redneck, white supremacist Trump voter. On Monday, Mitty and <mark>Michael Rosenthal</mark> decided to get a cappuccino at the Retro and who should walk in but Fr. <mark>Bob Sullivan</mark>, who joined at the table by the window. Mitty had been telling <mark>Michael</mark> about his short visit to Manitowoc, so he brought the Franciscan up to speed with the story. He then confessed that he was thinking about preaching the next Sunday on how Jesus would tell people to vote on Nov. 6. <mark>Michael</mark> laughed and said, \"You think that would cut ice with this Jewish boy?!\" but added, \"I know what you mean, Walt .\" Fr. <mark>Bob</mark> said, \"Yeah, I struggle with that, too. First, I think you know that Catholic teaching declares that a fetus is a human life from the moment of conception. Cardinal Bernardine used to talk about the seamless garment. That is, if you are against war and capital punishment and are for a ban on killing wolves, then to be morally consistent you have to be pro-life .\" \"I'm pretty sure,\" said <mark>Michael</mark>, \"that in my temple most of the women, especially the younger ones, would say they are pro-choice, but if you would take a poll, say in Skokie, I think you'd get a whole different response .\" \"Here's what I struggle with,\" Fr. <mark>Sullivan</mark> said after a minute of thoughtful silence. \"I think my church's teaching on the sanctity of life is consistent with God's intention for us. On top of that, I saw that a poll two years ago showed that six in 10 Americans, including 61 percent of women, say abortion is morally wrong and that one-third of pro-choice Americans agree .\" \"My question,\" he continued after another pause, \"is what happens when the government tries to make a crime out of having an abortion. I do worry about back alley abortions and I think we learned something from the failure of Prohibition to rid society of the scourge of alcoholism .\" So, Mitty sat staring out the window at the maple tree this morning trying to figure out what he should say. The gospels record nothing from Jesus on the subject of abortion, partly because 2,000 years ago it was not an issue. What's more, his conversations lately had focused on abortion but there were issues like the environment, gun control, the budget deficit, foreign policy, taxes, tariffs, racism, the income gap, the achievement gap, immigration, health care, LGBTQ rights, the size and scope of government and sexual harassment. And then there was local politics. Candidates were already lining up to challenge Mayor Ernie Romano in the spring election and the ads were already getting personal and nasty. Carl Reiniger, for one, made a post on Facebook that implied that Romano's judgment was being limited by dementia, so one of Ernie's supporters made a post that accused Reiniger's wife of having an ongoing affair. As of lunch time the maple tree hadn't shared any wisdom with the pastor of Poplar Park Community Church. As he ate his toasted coconut flavored Greek yogurt, Mitty decided that anything Jesus might have to say about the election would have something to do with love, but how in the world he could apply that to next Tuesday he still had no idea. One thing that he knew for sure, however, was that anything he would say would be said with a humility informed by the fact that he didn't know all the answers."}, {"articleID": "2012030404_00064194_W", "names": {"Mel Gibson": ["Q3854066", "Q42229"]}, "date": "2012-03-04", "url": "http://thetimesnews.com/articles/election-53082-season-surving.html", "content": "it's already started. on wednesday, i received a form notice in the mail. it had an overline that read: \"concerned americans tell the liberal media?\". this was followed by a quote \"tell the truth aboutobama's scandals .\" the original source of the mailer was the washington-basedmediaresearchcenter, a conservative organization purporting to investigate liberal media bias. they do this by apparently watching tv and reading newspapers, thenflagging pretty much anything with which they disagree. pretty scientific. the secondary source was a person from this area who put their signature and theirs alone under this heading: \"accordingly we, burlingtonmembers ofmediaresearchcenter, urge the liberal media to do its job and report the truth about the corruption directly related to the obama white house .\" it goes on to list about three things, including the widely reported solyndra deal, that no one is apparently reporting. it's an interesting document and one i suspect i'll see repeated a few thousand times over the course of the next fewmonths. as usual, it includes a photo ofobama taken with someone from the worlds of either politics or popular culture who is so widely loathed that the mere image of them can spark widespread frothing at the mouth and running naked into traffic. in this particular case, of course, it's house minority leadernancypelosi. finally, ol' al sharpton got abreak. yes, i envision people in tiny rooms hidden in the back of sweepstakes businesses processing these mailers at the rate van camps manufactures beanee weenees. my first response to such mailers is to say that if i ever meet anyone in the liberal media i'll be sure and pass it along. my second would be to ask what part of covering local news should the times-news give up in order to dedicate all of our reporters to such an endeavor that would entail opening a washington bureau - local government, schools, crime, courts, lost dogs or wedding announcements? and my third response is to take a deepbreath and remember that somewhere in the back rooms of toilet paper manufacturers around the nation there are legions of similarly dedicated people endlessly watching fox news and preparing their own exclamation point-laden mailers from the left with photos of house speaker john boehner with his arm around <mark>mel gibson</mark>. here in local newspaperland, though, i often find it irritating to be caught in the middle. that's why this week i heaved a deep sigh and said softly, \"it's already started .\" i did so because i've pretty much dreaded the political campaign of 2012 since the political campaign of 2008 ended. actually, the case could be made that the political campaign of 2012 began right there. only now, the intensity level is only going to grow. and grow. and grow. so this is probably as good a time as any to go over the house rules regarding times-news election coverage for all races this year. n letters to the editor about candidates or amendments should be about issues, not personalities.name-calling will not be allowed. endorsement letters will not be published as a matter of routine. if writers want to talk about why a certain candidate is qualified based on issues, we will likely publish it. letters that simply state a writer likes a candidate, won't make the cut. n we will check facts the best way we can. letters and candidates must cite verifiable sources. n guest columns are welcomed, but please stick to local issues. i have enough people who write about national matters. guest columns endorsing a candidate will not be considered for publication. n organizations hosting election forums are invited to let us know so we can publish notice in advance. coverage of political forums will be decided on a case-by-case basis. time, logistics, deadlines and staffing constraints will be determining factors. organizations are encouraged to invite all candidates participating in bids for a particular elected office. they will get first preference. n the times-news will likely host forums in the fall. forums for primary races will be based on public interest. there aren't that many contested races. n the times-news is inviting all candidates here to meet our advertising staff and discuss what's available during this election cycle. letters should be going out soon to all candidates who filed locally. n candidate q & as will be completed in april before the may primary election. first and foremost, though we're going to do our best to keep things fair to all candidates. after all, we don't want someone walled off in a little room processing negative mailers about us. overcast and 50.0? f winds west at 3.5 mph (3 kt)"}, {"articleID": "2019091122_00158375_W", "names": {"Arttu Ruotsalainen": ["Q21016846", "Q45834817"], "Jack Hughes": ["Q53952401", "Q608218", "Q6113254"]}, "date": "2019-09-11", "url": "https://www.yukon-news.com/sports/dylan-cozens-impresses-at-buffalo-sabres-prospects-challenge/", "content": "The Buffalo Sabres hosted its annual preseason Prospects Challenge in Buffalo, New York, from Sept. 6 to 9 with the Boston Bruins, Pittsburgh Penguins and New Jersey Devils also taking part. The event, held at the Harborcenter, was the first time the Sabres organization and fans got to see Whitehorse's Dylan Cozens compete against other NHL franchises. Cozens was left off Buffalo's initial roster for the event as he is recovering from thumb surgery following an injury at development camp earlier this summer, but ultimately played in two games and picked up three points. Cozens finished the weekend tied for second on the team in goals and tied for fourth in points. Training camp for the Sabres starts on Sept. 12 and runs until Sept. 28. General Manager Jason Botterill made it clear at the NHL Draft in June he doesn't expect any of the team's 2019 draft picks, including Cozens, to make the big club out of training camp. In the event Cozens is sent down, he'll be reporting to the WHL's Lethbridge Hurricanes where he has played his entire CHL career. Sabres defeat Devils 6-4 Buffalo jumped out to an early lead against the New Jersey Devils on Sept. 6 when Kyle Olson scored just 30 seconds into the first period. The Sabres struck twice more in the first, with goals from Victor Olofsson and Andrew Oglevie making it 3-0 after 20 minutes. Things kept rolling for the Sabres in the second as <mark>Arttu Ruotsalainen</mark> scored early to make it 4-0. Cozens then scored a power-play goal at 13:19 of the second period, assisted by Henri Jokiharju, to make it 5-0. Cozens took a pass near the top of the right faceoff circle and stepped around the Devils winger, shielding the puck with his leg, before ripping a wrist shot high past the New Jersey goaltender. Buffalo's William Borgen scored to make it 6-0, but New Jersey's first-overall pick <mark>Jack Hughes</mark> got one late on the powerplay to make it 6-1 after 40 minutes. In the third period, the Sabres prospects let off the gas, conceding three goals to New Jersey but ultimately held on for a 6-4 win. Cozens picked up three minor penalties in the game--a hooking penalty in the second and penalties for roughing and interference in the third. After the game, Cozens told the media he was glad to be on the ice and that the atmosphere from the hometown crowd lived up to expectations. \"It was good to just get my legs under me,\" said Cozens. \"I was told there was going to be lots of fans out here tonight and it was completely packed; that's awesome to see for a tournament like this .\" Buffalo beats Boston 4-3 The Buffalo Sabres and the Boston Bruins took to the ice on Sept. 7 with the Sabres again jumping out to an early lead. This time, Rasmus Asplund scored just over five minutes into the first period to give Buffalo a 1-0 lead. In the second period, Oskar Steen tied things up for Boston near the middle of the frame before Buffalo exploded for three goals in four minutes. Olofsson scored first at 12:23, followed by Matej Pekar at 13:33 and Pekar again at 16:22. In the third period, Steen scored to cut the lead to two before Samuel Asselin clawed the Bruins back to within one at 15:59. Cozens did not play in the game. Penguins win 6-4 over Sabres The Pittsburgh Penguins handed the Sabres prospects a 6-4 defeat in the final game of the Prospects Challenge on Sept. 9, although Cozens had a goal and an assist in the loss. After an opening period that included 23 shots on target but no goals, the floodgates opened in the second as the two teams combined for six goals. Pittsburgh struck first with a shorthanded goal from Sam Lefferty. Anthony Angello then added two for the Pens, making it 3-0, before Jordy Bellerive made it 4-0 with a power play goal at 9:05. Brett Murray scored a powerplay goal assisted by Jokiharju and Cozens at 18:05 before Cozens scored at the end of the period to make it 4-2 after 40 minutes. Cozens fought for position in front of the net and managed to deflect a point shot with just 1.3 seconds remaining on the clock. In the third period, Asplund scored a pair to tie it up 4-4 before Nathan Legare scored the winner for Pittsburgh at 3:57. The Penguins added an empty net goal in the final minute to make it 6-4. Contact John Hopkins-Hill at john.hopkinshill @ yukon-news.com"}, {"articleID": "2016070119_00068702_W", "names": {"John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2016-07-01", "url": "http://www.montrealgazette.com/news/world/offers", "content": "Russian Defense Minister Sergei Shoigu, third left, visits the Hemeimeem air base in Syria, Saturday, June 18, 2016. Syrian President Bashar al Assad shakes hands with Russian Defense Minister Sergei Shoigu in Damascus, Syria, Saturday, June 18, 2016. Share Adjust Comment Print The Obama administration has offered to help Russia improve its targeting of terrorist groups in Syria if Moscow will stop bombing civilians and opposition fighters who have signed on to a ceasefire and use its influence to force Syrian President Bashar al-Assad to do the same. The offer early this week of what one administration official called \"enhanced information sharing\" does not include joint military planning, targeting or coordination with U.S. airstrikes or other operations in Syria. But it would expand cooperation beyond the \"deconfliction\" talks the U.S. and Russian militaries began last year to ensure their planes do not run into each other in Syria's increasingly crowded airspace. DefenCe Secretary Ashton Carter, who has long opposed any additional cooperation, said Thursday that if Russia would \"do the right thing in Syria--that's an important condition--as in all cases with Russia, we're willing to work with them .\" \"The Russians got off on the wrong foot in Syria,\" Carter said. The stated purpose of airstrikes Russia began last fall was \"to fight ISIL and...assist the political transition in Syria towards a post-Assad government .\" \"They haven't done either of those things,\" he said. Senior administration officials declined to discuss details of the proposal, saying that publicizing the content of diplomatic talks would undermine their possible success. \"We've made no bones about the fact that if the Russians, with their military presence in Syria, proved to be willing to focus those efforts against Daesh, then that's a conversation we would be willing to have,\" State Department spokesman <mark>John Kirby</mark> said. \"There have been proposals offered by multiple parties,\" he said. \"We're certainly not going to start laying those out publicly .\" The United States and Russia, while backing opposing sides in Syria's civil war, co-chair an international task force that agreed early this year--along with Assad and the opposition--to support a \"cessation of hostilities\" and begin negotiations for a political solution that would allow the international community to turn its full attention to the fight against ISIL. More than 400,000 Syrians have died in the civil war, which has also displaced half the population, with millions fleeing to neighboUring countries and beyond. The Islamic State of Iraq and the Levant and Jabhat al-Nusra, al-Qaeda's Syrian affiliate, are not parties to the truce. The administration has charged that Russia and Assad's forces have violated it by continuing to launch airstrikes and other attacks on the anti-Assad opposition and civilians, under the guise of targeting the terrorist groups. \"What has prevented us from being able to more effectively coordinate militarily is that what the Russians have been militarily doing is propping up Assad and not going after ISIL,\" White House press secretary Josh Earnest said. Russia has defended its actions, and those of Assad, by saying that U.S.-backed opposition fighters are interwoven with Jabhat al-Nusra forces, especially around the northwestern Syrian city of Aleppo. While violations of the truce have escalated throughout Syria's populated western third, Aleppo has become the epicenter of fighting. Jabhat al-Nusra forces are principally massed to the south of the city. While the administration has acknowledged some overlap in opposition-held areas to the north, officials charge that Russia's principal interest in bombing there is to help Assad's forces close rebel and humanitarian supply lines across the nearby Turkish border. The advance of ISIL fighters to areas close to Aleppo and other populated areas has also brought U.S. and Russian aircraft into closer proximity over the complicated Syrian battlefield. ISIL has rarely clashed with Assad. In early May, as the cease-fire and U.N.-shepherded peace talks headed toward collapse, Secretary of State <mark>John Kerry</mark> and Russian Foreign Minister Sergei Lavrov agreed to send senior military officers to \"sit at the same table\" in Geneva, where they set up a center to monitor violations. Weeks later Russia--which has long sought more coordination with the West in Syria--proposed joint airstrikes against Jabhat-al-Nusra with the U.S.-led coalition that is bombing ISIL positions. Although U.S. officials were dismissive, the proposal unsettled U.S.-backed opposition representatives, who feared a backroom U.S.-Russia deal. They have said they will not return to the negotiating table until the violence abates. <mark>Kerry</mark> and other U.S. officials have remained in close contact with their Russian counterparts, trying out a series of possible initiatives to revitalize the cease-fire, including the new offer of increased intelligence sharing on terrorist positions. <mark>Kerry</mark> is \"fixated\" on the Syria issue, \"and he will stay so,\" <mark>Kirby</mark> said. <mark>Kerry</mark> has long advocated a more robust U.S. strategy to help the anti-Assad opposition, including additional weapons systems and the possible bombing of Assad's military assets. Internal unhappiness with the current strategy, and the humanitarian disaster the war has brought to Syria, led 51 U.S. diplomats last month to write an internal \"dissent channel\" appeal for U.S. military action. While President Barack Obama has steadily increased U.S. attacks against ISIL in Syria, he has rejected entreaties for more direct involvement in the civil war, saying that he does not see how it would improve the situation. But Obama has blessed efforts to persuade Russia to change its policies, including the intelligence offer. Administration officials believe that the Russians have no deep attachment to Assad himself but fear his removal would spark a collapse of Syrian institutions and allow terrorist expansion--something the Obama administration has said will happen if Assad remains. In an address Thursday to Russian ambassadors gathered in Moscow from across the world, President Vladimir Putin said that he was \"prepared to work with any future president\" and was interested in closer cooperation with the United States in international affairs. \"However, we consider unacceptable the approach on the part of the American establishment, which believes that they can decide in what issues they will cooperate with us,\" Putin said. Comments We encourage all readers to share their views on our articles and blog posts. We are committed to maintaining a lively but civil forum for discussion, so we ask you to avoid personal attacks, and please keep your comments relevant and respectful. If you encounter a comment that is abusive, click the \"X\" in the upper right corner of the comment box to report spam or abuse. We are using Facebook commenting. Visit our FAQ page for more information."}, {"articleID": "2010080515_00019145_W", "names": {"John Tierney": ["Q15513491", "Q6260826", "Q6260828", "Q6260830", "Q6260832"], "Scott Brown": ["Q15047261", "Q155125", "Q314160", "Q47233855", "Q7436044", "Q7436045", "Q7436046", "Q7436047", "Q7436048", "Q7436049", "Q7436050", "Q7436051", "Q7436052", "Q933673"], "Charlie Baker": ["Q28051620", "Q5076629", "Q5084482", "Q56254750"], "Katherine Harris": ["Q272787", "Q45332360"], "Michael Steele": ["Q331838", "Q443813", "Q51709680"], "Barbara Anderson": ["Q453631", "Q457873", "Q52555829"], "Brad Hill": ["Q39069936", "Q4953997", "Q4953998", "Q4953999", "Q4954939"], "Brad Jones": ["Q26834399", "Q2923402", "Q299228", "Q4954040", "Q4954041", "Q4954042", "Q56280650", "Q896802"], "Joe Perry": ["Q313378", "Q377430", "Q537432", "Q6211782"], "Neil Young": ["Q1361496", "Q16104585", "Q1974908", "Q48841251", "Q6265210", "Q633", "Q6989513", "Q6989515"], "Sharon Jones": ["Q447759", "Q461256", "Q7490108"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2010-08-05", "url": "http://thephoenix.com/BLOGS/talkingpolitics/archive/2010/08/05/baker-palling-around-with-hudak.aspx", "content": "bill hudak, republican congressional candidate in <mark>john tierney</mark>'s district, has not been universally embraced by mainstream massachusetts republicans--in fact, when hudak announced that <mark>scott brown</mark> had endorsed him, <mark>brown</mark> quickly denied it and forced a retraction. that cold shoulder is due to some rather disturbing and, some might say, nutty opinions hudak has expressed, such as once suggesting to journalists that he had documentation proving that barack obama was born in kenya. but <mark>charlie baker</mark> has no problem appearing with the guy. a couple of weeks ago, <mark>baker</mark> accepted an invitation to speak at a large hudak event; he came, took the stage with hudak, and briefly addressed the audience. the photo above, obtained by the phoenix, shows <mark>baker</mark> speaking at the event, gesturing to the bow-tied hudak. \"<mark>charlie</mark> was speaking to voters,\" campaign spokesperson rick gorka told me, when i asked about <mark>baker</mark> choosing to associate with hudak. \"we're going to talk to voters everywhere .\" originally reported by tri-town transcript. among the highlights: hudak, in 2008, proudly displayed on his boxford lawn an array of anti-obama signs, one of which depicted barack obama as osama bin laden. he showed reporters documents that, he claimed, proved that obama was born in kenya. (he has admitted showing the documents, but now denies that he believed them .) he claimed that obama had ties to the muslim faith. he referred to obama as \"barry soetoro,\" as is common on so-called \"birther\" web sites. asked whether <mark>baker</mark> personally considers hudak's questioning of obama's citizenship, or comparing obama to bin laden, offensive, gorka replied: \"they're not things <mark>charlie</mark> agrees with .\" pressed again, gorka termed those things \"outrageous,\" but would not accept the characterization of \"offensive .\" (as an aside, i'm not sure why the <mark>baker</mark> campaign brought in gorka from the republican national committee to be its press secretary--not only is he alien to massachusetts, but his resume of working for folks like <mark>katherine harris</mark>, <mark>michael steele</mark>, and the now-defunct freedom's watch may not make him a great fit for our poitical-media landscape .) the event <mark>baker</mark> appeared at was a hudak campaign fundraiser/rally at the north shore music theater in beverly--\"stand up for america: a celebration of freedom .\" todd feinburg, jeff katz, and <mark>barbara anderson</mark> participated, and hudak claims that 500 people attended. among those on hand were former congressman peter torkildsen, state representatives <mark>brad hill</mark> and <mark>brad jones</mark>, and a host of area legislative candidates. gorka insists that <mark>baker</mark>'s on-stage appearance did not suggest an endorsement of, or support for, hudak. but wicked local topsfield, for one, came away with a different impression; a photo caption accompanying their story about the event included the line: \"also on hand to support hudak's candidacy for the 6th district seat were <mark>charlie baker</mark>...\" and, while hudak is clear that <mark>baker</mark> has not endorsed him, he did suggest, at the least, a camaraderie between the campaigns, when i asked him about <mark>baker</mark>'s appearance. \"we're all in this working together,\" hudak says. i've spoken with hudak a couple of times, and he comes across as a nice enough guy. but, his rabid, conspiratorial, admittedly internet-researched attacks on obama are about all we have to assess him; he had never been politically active prior to his late - 2008 outburst of anti-obamaism. pretty much all we know is that he believes, and acts upon, crazy, offensive things he reads on the internet. i can't imagine that it helps <mark>baker</mark> to associate himself with that fringe of the republican party. plus ultimate 2010 jam revealed, <mark>joe perry</mark> wrecked, and <mark>neil young</mark> unplayable the low anthem, yim yames, john prine, <mark>sharon jones</mark>, edward sharpe and more, live from newport, july 30 - august 1, 2010 ontario dream-pop duo find inspiration in the library stacks getting folked prine, helm, and edward sharpe highlight the newport fest burn baby burn <mark>john kerry</mark>, <mark>scott brown</mark>, and the death of climate-change legislation the black keys live at the bank of america pavilion, july 31, 2010 [video] interview w/aa bondy - hahaha...people in dr. seuss hats! \"you know, the modern primitive kind .\" the most exclusive father abraham webterview in the history of the world british newspapers out alleged wikileaks source, a soldier, as being gay; queer-bashing has already begun ticket on-sale alert: 16 shows including temper trap, of montreal, scissor sisters, matisyahu, and jonas brothers (zomg!)"}, {"articleID": "2012020202_00010679_W", "names": {"Brad Pitt": ["Q35332", "Q373912"], "Nick Santino": ["Q17198684", "Q2134026"], "Allen West": ["Q2095615", "Q3277451"]}, "date": "2012-02-02", "url": "http://opposingviews.com/i/politics/2012-election/newt-gingrich-brad-pitt-should-play-me-movie", "content": "it's a game many of us play--\"if they made a movie of my life, who would play me?\" well, no one is making a movie of any of our lives so we don't have to worry. but theoretically, a movie could be made about newt gingrich. so who does gingrich want to play him--<mark>brad pitt</mark>! tmz.com reports gingrich was on the rich stevens radio show on tuesday when for some reason that question was asked. gingrich answered, \"oh, in my fantasy life? <mark>brad pitt</mark>. why not?\" stevens jokingly asked, \"is it because you guys look alike?\" albert covarrubias jr shot by fellow officer and best man at his wedding matthew kline actor <mark>nick santino</mark> commits suicide, guilty over putting down pit bull rocco video: rep. <mark>allen west</mark> tells obama and democrats to \"get the hell out of the united states of america\" pastor: christians should boycott starbucks over pro-gay marriage stance video: radio host bryan fischer blames pres. bill clinton for rise in hpv virus cops kill one of their own; albert covarrubias was sex abuse suspect ov badges? 2008-2012 opposing views, inc. all rights reserved."}, {"articleID": "2019092921_00255318_W", "names": {"Mark Francis": ["Q16236137", "Q1900045", "Q6767658", "Q6767659"]}, "date": "2019-09-29", "url": "http://www2.kusports.com/news/2019/sep/29/mandi-duggans-two-goals-lead-ku-soccer-4-1-victory/", "content": "Mandi Duggan's two goals lead KU soccer to 4-1 victory over Baylor By Braden Shaw Carter Gaskins KU teammates Sophie Maierhofer (27), Katie McClure (12) and Ebba Costow (8) celebrate a goal during the team's 6-0 win over Loyola Chicago Sunday afternoon at Rock Chalk Park on Aug. 25, 2019. Advertisement With opportunities few and far between, Kansas sophomore forward Bri Amos took advantage of an opening down the left sideline. Amos quickly sent a cross into the box to junior forward Mandi Duggan, who sent a header into the back of the net. That 30th minute goal shifted momentum into KU's favor in the first half, which was enough for the Jayhawks to secure the 4-1 victory over Baylor Sunday. \"It was really more about the result today than it was about how we play,\" KU coach <mark>Mark Francis</mark> said. \"I'm proud of the kids today. It was more about the effort and the energy in the second half than it was about how well we played soccer today because we had to compete .\" The Jayhawks were coming off a 1-0 defeat to Texas Thursday night, dropping their Big 12 opener for the second time in three years. \"Before we came out, we huddled up and said,\" We've got to get the job done today .' And that's what we did, \"Duggan said. And prior to the goal from Duggan, KU looked sluggish and behind the pace of Baylor. The Bears dominated possession throughout the first half, sending in 10 shots before halftime. However, only one of those shots was on goal. Baylor also earned three corners early on. The two closest chances came from Baylor freshman forward Taylor Moon's shot just curling over the bar in the 17th minute and Baylor sophomore midfielder Giuliana Cunningham sending a shot just over the bar from outside the box in the 23rd minute. And even with the Baylor offense applying pressure, KU sophomore goalkeeper Sarah Peters only had to make one save in the first half, pointing to inaccuracy befalling Baylor's halftime deficit. In the first 30 minutes of the match, KU had two close chances, with any other attack resulting in a quick counter attack from Baylor. The Jayhawks had just one shot on goal in the first half--and one shot in total--resulting in the Duggan goal .\" (It was a) huge momentum shift, because I think the first 15, 20 minutes we were kind of on our toes a little bit, not playing the game we normally play, \"Duggan said of her first goal .\" Then after that goal everyone was so energized and so ready. \"Coming out of the break, KU kept that momentum and looked like a completely different, more aggressive team .\" The second half was just a different story, \"<mark>Francis</mark> said. It only took about five minutes into the second half for KU to add to its lead, as a pass combination in the box from junior midfielder Ceri Holland and senior forward Katie McClure found sophomore forward Kailey Lane for a tap-in goal. Lane's fourth goal of the season put the Jayhawks up 2-0. Baylor looked to respond in the 53rd minute, but senior forward Raegan Padgett was called offside, nullifying another goal-scoring chance for the Bears. On the other end, KU had another close chance with McClure and Lane almost connecting once again in the 62nd minute. But, Lane's shot sailed just wide of the net. The Jayhawks added to their lead later in the 81st minute off a cross from McClure sent to Duggan who scored her second goal of the match and on the season .\" Oh, Mandi was huge, \"<mark>Francis</mark> said .\" She scored two fantastic goals, but the kid was all over the place. She was pressuring, she was chasing, she was running onto balls. She was brilliant. \"Meanwhile, Baylor managed to get on the board in the 86th minute thanks to a header from freshman midfielder Michaela Gorman off a corner. The Bears finished with 15 shots, with four shots on goal. KU freshman midfielder Ebba Costow added a goal directly off a corner in the 90th minute, capping off a dominant second half for the Jayhawks .\" I was stoked, everyone was stoked, \"Duggan said .\" I think the world stopped for a second when that happened. We were all so excited and good for her, too. \"Moving forward, Duggan said the Jayhawks need to focus on attacking earlier and not sitting back to start matches .\" We've just got to realize that we have to play our game, \"Duggan said .\" We can't wait for the momentum to shift and we just have to come out right away and get the job done. \"Kansas will travel to Oklahoma State at 7 p.m. Thursday."}, {"articleID": "2017072811_00265808_W", "names": {"Rajendra Prasad": ["Q30077615", "Q5516315"]}, "date": "2017-07-28", "url": "http://www.siasat.com/news/mehbooba-warns-grave-repercussions-article-35a-tinkered-1217186/", "content": "Mehbooba warns of grave repercussions if Article 35 (A) is tinkered with July 28, 2017, 4:39 PM IST India, News New Delhi: New Delhi: Jammu and Kashmir Chief Minister Mehbooba Mufti on Friday warned against any tinkering with Article 35 (A) of the Constitution that is being debated in the Supreme Court and which empowers the State legislature to define \"permanent residents\" and accord special rights and privileges to them. Strongly defending the constitutional clause, Mehbooba said that any change in its status would invite repercussions and mean that nobody would be able to protect the Indian national flag in Jammu and Kashmir. She said that mainstream parties like the National Conference and her own Peoples Democratic Party (PDP) risk their workers' lives who stand up and carry the national flag in Kashmir. \"Any tinkering with the article won't be acceptable. I won't hesitate in saying that nobody will even carry the corpse of the National Flag in Kashmir (if the article is scrapped). Let me make it very clear,\" she said at an event here on Kashmir. The Chief Minister said that by employing such tactics, \"you are not targeting separatists who have an agenda to secede but you are weakening the forces who have accepted India, participated in elections. They make efforts to integrate Jammu and Kashmir with India with respect and dignity. You are weakening them .\" The Article 35 (A) is being challenged in the Supreme Court by NGO \"We The Citizens' on its legal basis because the article was never presented before the Parliament and executed on the orders of President of India. The provision was implemented in 1954 when then President <mark>Rajendra Prasad</mark> used the powers conferred on him by Article 370 to introduce the\" Constitution (Application to Jammu and Kashmir) Order 1954 \". Under the article, citizens from other parts of the country cannot acquire immovable property in Jammu and Kashmir or take up employment with the State government. The Supreme Court has now referred the case to a three-judge bench for a larger debate over it. IANS Share Whatsapp Facebook Twitter Google +"}, {"articleID": "2019121020_00134639_W", "names": {"Alex Moore": ["Q21104247", "Q28658001"]}, "date": "2019-12-10", "url": "http://www.shropshirestar.com/news/local-hubs/telford/2019/12/10/home-extension-can-go-ahead-after-telford-couples-appeal/", "content": "Home extension can go ahead after Telford couple's appeal By <mark>Alex Moore</mark> | Telford | News | Published: Less than an hour ago A couple have won permission to extend their home despite concerns it might impact on a \"historically significant\" pub and pair of houses nearby. Subscribe to our daily newsletter Sign UpThe Church Wicketts pub, one of the buildings Telford & Wrekin Council said the extension could have negatively impacted. Photo: Google Maps Mr and Mrs J Murfin applied for permission to build a conservatory at the side of their home at Church Road, Dawley, but Telford and Wrekin Council's planning department refused permission in August. But, after a site visit last week, government-appointed planning inspector Robert Hitchcock has overturned that appeal and allowed the development. Council planners had said the conservatory, which would be visible from the street, would be \"incongruous\" , but, in a Planning Inspectorate decision notice, Mr Hitchcock points out that nearby homes are already significantly altered, and the area no longer has \"consistent rhythm or character\". Mr Hitchcock writes that the Murfins' home is in \"an area of mixed age and character dwellings, including traditional semi-detached and detached properties intertwined with more modern terraces, individually-styled properties and infill development\". He adds: \"The proposed development would not appear incongruous or adversely affect any consistent rhythm or character of development within the locality .\" An appraisal document, prepared by council planning officers at the time of the original refusal, said the proposed conservatory, being visible from the street, would be an \"incongruous addition\". It also said \"the proposed scheme would have a detrimental impact upon the setting, character and appearance of surrounding local interest buildings, distracting from the historic character of the surrounding area\". Mr Hitchcock says this refers to a semi-detached pair of homes next to the Murfins' house and The Church Wicketts, a pub opposite. \"The buildings' significance stems from their forming part of an earlier 19th-century settlement, now incorporated within the wider Malinslee suburb,\" he writes. He adds that, while the conservatory would narrow the gap between the houses, a \"visual break\" would remain and \"no direct physical effect\" on the next-door house would result. In his decision notice, published on Monday, Mr Hitchcock allowed Mr and Mrs Murfin's appeal but said they must use approved building materials on the external surface \"in the interest of the character and appearance of the area\" ."}, {"articleID": "2019120218_00259503_W", "names": {"Steve King": ["Q37084447", "Q749710", "Q7613030", "Q7613031", "Q7613033", "Q7613034", "Q7613037"]}, "date": "2019-12-02", "url": "https://talkingpointsmemo.com/edblog/notable-6", "content": "Notable By Josh Marshall | December 2, 2019 1:33 p.m. JOIN TPM FOR JUST $1 From Nathan Gonzales in Roll Call...\"With a combination of Republicans' self-inflicted wounds, slow recruiting, or suburbs continuing to shift against the president, Democratic chances of winning improved in a dozen House races in recent weeks. Those rating changes include:\" Arizona's 6th (David Schweikert, R) Solid Republican to Likely Republican California's 25th (Vacant, D) Likely Democratic to Solid Democratic Illinois' 6th (Sean Casten, D) Lean Democratic to Likely Democratic Illinois' 13th (Rodney Davis, R) Tilt Republican to Toss-up Iowa's 2nd (Open; Dave Loebsack, D) Toss-up to Tilt Democratic Iowa's 4th (<mark>Steve King</mark>, R) Lean Republican to Tilt Republican Michigan's 8th (Elissa Slotkin, D) Tilt Democratic to Lean Democratic Michigan's 11th (Haley Stevens, D) Lean Democratic to Likely Democratic Minnesota's 1st (Jim Hagedorn, R) Lean Republican to Tilt Republican Minnesota's 2nd (Angie Craig, DFL) Lean Democratic to Likely Democratic New Hampshire's 1st (Chris Pappas, D) Lean Democratic to Likely Democratic Virginia's 2nd (Elaine Luria, D) Tilt Democratic to Lean Democratic The full article is here. Josh Marshall (@ joshtpm) is editor and publisher of TPM. Have a tip? Send it Here!"}]