[{"date": "2017-05-24", "url": "http://www.thebull.com.au/articles/a/67396-as-us-mulls-action-on-steel,-foreign-producers-urge-caution.html", "content": "News As US mulls action on steel, foreign producers urge caution Foreign steel producers on Wednesday called for prudence from the Trump administration as it considers possible actions to shield domestic companies from unfair imports on national security grounds. Print 25.05.2017 08:45 AM Foreign steel producers on Wednesday called for prudence from the Trump administration as it considers possible actions to shield domestic companies from unfair imports on national security grounds. The remarks came at a public hearing that is part of a Commerce Department investigation into the effects of steel imports on US national security. The administration is also scrutinizing aluminum imports. The Trump administration's new stance has cheered US producers, who hope it will bring more relief to struggling industries than scores of scattershot anti-dumping cases. Domestic producers on Wednesday said unfair competition is undermining the US industrial base in ways that could jeopardize energy production and the manufacture of weapons, armor and vehicles. Still, some analysts say technological advances and increased productivity, more than trade, have accounted for much of the industry's job losses. John Ferriola, president of Nucor Corp, said his company's steel helped produce US Humvee light military trucks, Abrams battle tanks, Bradley fighting vehicles, the Patriot surface-to-air missile system and the plating used for armored vehicles, Navy aircraft carriers and destroyers. That required \"continual investment\" in expertise, research, development and testing to meet exacting US Navy standards, he told the hearing. \"Unfortunately, global overcapacity and unfairly traded imports threaten our ability to invest,\" he said. \"Production overcapacity in the steel industry has reached crisis levels .\" - Trade barriers questioned - However, foreign producers told the hearing that new trade barriers could be both unnecessary and counter-productive. Karl Tachelet, head of international affairs at Eurofer--an association of European Union steel producers--said his organization had also been fighting unfair practices and global oversupply. \"We do not believe that restrictive, unilateral action based on national security will allow for lasting solutions we all need,\" he said, calling for the investigation to focus on \"specific uses\" directly tied to national security. \"What do tin mill products used to make cans for food and beverages have to do with national security?\" he said. \"How real is the risk that one day the US will not be able to produce enough rebar or sections for construction and infrastructure given its massive scrap availability?\" - China, Russia, Ukraine - <mark>Yu Gu</mark>, a representative of the Chinese Commerce Ministry, said the US Defense Department had found that US defense needs for steel were low, citing research that concluded that just three percent of domestic shipments served national defense purposes. \"Clearly, current and projected US national defense demand for steel can be readily satisfied by domestic production,\" he said. The deputy head of Russia's US trade mission, Alexander Zhmykhov, said his country's steel exports were already subject to heavy anti-dumping restrictions and duties in the United States, where certain imports have tumbled. \"Russian imports have already been so drastically limited by the measures enforced that further limitations would be excessive,\" he said. Ukraine's representative said his country's steel industry is under attack--suffering seizure and expropriation by foreign-backed separatists in industrial eastern Ukraine--but that security cooperation with the United States is also crucial to his country's stability. A 2001 investigation showed that the America was not vulnerable to imports of iron ore and semi-finished steel, said Vitalii Tarasiuk, minister-counsellor at the Ukrainian embassy. \"We are confident that evidence in this case will likewise show that steel imports do not threaten US national security,\" he said. Speaking to reporters on Wednesday during a visit to Washington--where she met with US Trade Representative Robert Lighthizer--German Economy Minister Brigitte Zypries said she is worried the US steel investigation could result in higher tariffs on German exports of the metal and hopes to address the issue with US Commerce Secretary Wilbur Ross. Archive", "articleID": "2017052423_00178126_W", "names": {"Yu Gu": ["Q3428771", "Q45434640", "Q51542236", "Q58363615"]}}, {"date": "2017-05-25", "url": "http://www.davisenterprise.com/arts/wagners-photos-of-the-redwood-coast-area-on-display/", "content": "<mark>Wagner</mark>'s photos of the Redwood Coast on display Share Tweet \"Redwood Coast: Sea and Land\" will feature the black-and-white photography of <mark>Gary Wagner</mark>. The show opens Friday, June 2, at YoloArts' Gallery 625 in Woodland. <mark>Wagner</mark>'s career spans more than three decades. His love of the photographic image began in Kokomo, Ind., as his high school newspaper's photographer. He attended the University of Bloomington, then earned a master's degree in photography from Brooks Institute of Photography in Santa Barbara. His professional career includes fine art, portrait and commercial photography. <mark>Wagner</mark> has taught theory and technique at colleges in Europe, focusing on the English country landscape. His latest book, \"Digital Black and White Landscape Photography, Fine Art Techniques from Camera to Print,\" was published recently and copies will be available for sale at the reception. \"The coastal landscape is an exciting and challenging environment to work in, as it is constantly changing with the light of the day and the interplay of tides, sand, and rocks,\" <mark>Wagner</mark> said in his artist statement. \"I find freedom, and inspiration to create my interpretations of the natural elements and scenic vistas that come to my view at these locations .\" On working exclusively in black and white, <mark>Wagner</mark> says \"color imagery for me is too close to reality and more of a visual record, than an artistic interpretation ....I find the magic of light on the sea to best be conveyed in black and white .\" The artist will attend the opening reception 5:30 to 8 p.m. Friday, June 2, during the downtown Woodland First Friday Art Walk. In the upstairs gallery of Gallery 625, the culminating exhibition for the almost year-long \"I SEE YOU\" project will open. Participants in this special collaboration and arts engagement for people experiencing homelessness in Yolo County are from Woodland, West Sacramento and Davis. YoloArts, the Yolo County Library, Fourth & Hope, Yolo County Social Services, the Woodland Library and other agencies worked together to provide art exploration and access to a variety of social services. \"The\" I SEE YOU' art program connected those needing a helping hand to some vital services with compassion, understanding and empathy. I got to know some very talented folks who touched my heart, and I expect that time spent listening to them will help them be successful in the future, \"said Kristen Cline, homeless program clinical supervisor for the Yolo County Department of Health & Human Services. Beginning at the Stephens Branch Library in Davis and moving to the West Sacramento Branch Library last year, the program recently concluded at the Fourth & Hope homeless shelter in Woodland .\" The clients have shared with me the excitement and joy the art class has brought to them over these weeks, and some of them will have their art in the show--it was a great opportunity to reach out to the community and share a fun activity, \"said Charlotte Baur, Fourth & Hope lead case manager. The artwork in the show includes pastel drawings, prints, 3-D work, masks, watercolor and painting. Teaching artists Melissa Uroff, Mary Anne Kirsch, <mark>Andrea Ross</mark> and Jim Vetter are expected to attend the reception along with those who created the artwork. All of the artwork will be for sale (cash only) with proceeds going to the artists and the program. Pianist Julie Dachtler will play during the reception Friday, June 2, until 7:30 p.m. Matchbook Winery will provide the wine for tasting. YoloArts board member Susan Lord Bovey will be the reception's host. Gallery 625 is at 625 Court St. in Woodland, in the Yolo County Administration Building, and is open from 8 a.m. to 5 p.m. Mondays through Fridays, and by appointment. For more information, call YoloArts at 530-309-6464.", "articleID": "2017052500_00150984_W", "names": {"Andrea Ross": ["Q18421096", "Q1997233"], "Gary Wagner": ["Q16934994", "Q5526099"]}}, {"date": "2017-05-25", "url": "http://www.pressreleaserocket.net/terma-software-sees-over-100-growth-in-services-for-workload-optimization/555356/", "content": "Home / Press Releases / Terma Software Sees Over 100% Growth in Services for Workload Optimization Terma Software Sees Over 100% Growth in Services for Workload Optimization By PR Rocket on May 25, 2017 Pin It Terma Software's introduction of an analytics based service offering to help companies optimize automation environments has helped the company experience significant growth. The service based offering combines the strength of its analytics based product for workload service management, deep knowledge of enterprise job schedulers, and industry best practices to help optimize workload processes. Boulder, CO (PRWEB) May 24, 2017 Terma Software introduced its Workload Service Model for optimization of Workload Automation environments over a year ago, in order to address the growing challenges organizations are facing with their workload solutions as complexity continues to grow. Since the introduction of this service offering, Terma has experienced significant growth and interest in the services that help to optimize batch workload environments as well as manage their inherent complexity. These services take a process based approach and employ both operational and statistical analyses to address inefficiencies and lack of insight into the management of the highly complex interdependent processes used to support critical business activities. Shane Hade, CEO of Terma comments, \"Many of our customers and prospects are challenged by not only time constraints, but also the lack of resources needed to analyze and develop service models for workload automation. Our service models help identify inefficient practices used within workload scheduling solutions such as AutoSys, CA 7, and Tidal. Once these models are applied and aligned with redesigned operational practices, a more reliable and efficient service can leveraged .\" <mark>Jim Anderson</mark>, VP, Product Strategy, Sales & Marketing says, \"Our professional service business has grown significantly due to a need in the workload automation customer base to drive more efficiency within IT operations. The capabilities inherent in our analytics solution, combined with the knowledge and experience of our consultants, helps customers develop a more efficient and reliable approach, insuring that the implemented processes meet their desired expectations. The Terma Workload Service Model is what drives this .\" About TERMA SOFTWARE Over the past decade Terma has developed the industry's most comprehensive knowledge of workload data and the ability to leverage that understanding to provide measurable business analytics. Terma's products, TermaUNIFY (formerly JAWS), TermaINSIGHT, and TermaVISION enable companies to optimize their workload processing and realize more value from their automation tools by providing SLA management, forecasting, prediction, business intelligence, reporting, simulation, and modeling for CA Technologies' CA 7 and AutoSys, and Cisco's Tidal Workload Automation. Availability for both IBM IWS and BMC ControlM are coming soon. The products are available as SaaS and on premise solutions. The solution ensures that companies can lower their costs and improve the reliability and performance of their mission critical workloads. For more information, please contact <mark>Jim Anderson</mark> at 303.396.0454 or email <mark>Jim</mark> (at) TermaLabs.com. For the original version on PRWeb visit: http: //www.prweb.com/releases/2017/05/prweb14368632.htm Related Items", "articleID": "2017052500_00168633_W", "names": {"Jim Anderson": ["Q16091384", "Q20668766", "Q27887229", "Q3178726", "Q35814840", "Q6193381", "Q6193384", "Q6193386", "Q6193388", "Q6193392"]}}, {"date": "2017-05-25", "url": "http://kdhnews.com/news/local/fire-destroys-unoccupied-house-near-belton-officials-say/article_ae8f3bfc-40f6-11e7-8c4c-2f9b84ecd8bf.html", "content": "BELTON--Thick smoke seen for miles across Bell County was the result of a blaze that destroyed an unoccupied house Wednesday evening. The fire occurred at about 7:15 p.m. at a house in the 7600 block of Sparta Road near Moon Rise Trail. An onlooker said he saw the smoke on Interstate coming from Jarrell. Bell County Fire Marshal Steve Casey was investigating the cause of the fire, which nearby residents said appeared to spread rapidly. \"It went up super fast,\" said <mark>David Watkins</mark>, 25, a next-door neighbor. \"We looked out the window, saw all this smoke and then fire trucks started showing up .\" The fire occurred about a mile from the Sparta Road headquarters of the Sparta Volunteer Fire Department. It was the first agency to respond, according to Pat Beard, president of the department's board. The charred remains of the house smoked for hours as the sun set on the rural Lake Belton neighborhood near Fort Hood. The house was unoccupied and was used for storage, neighbors said. Firefighters from Central Bell Fire & Rescue, and the Belton, Fort Hood, Salado and Morgan's Point Resort fire departments responded.", "articleID": "2017052504_00209065_W", "names": {"David Watkins": ["Q16751000", "Q27042011", "Q3018959", "Q3018961", "Q5240866", "Q5240867", "Q56596996"]}}, {"date": "2017-05-26", "url": "http://home.nzcity.co.nz/news/article.aspx?id=248675&fm=psp,tsf", "content": "Home> News> Living & Travel NZ rocket catches world's attention New Zealand's successful entry into the space age has caught the world's attention, the Kiwi businessman behind the venture says. 26 May 2017 New Zealand's successful entry into the space age has caught the world's attention, the Kiwi businessman behind the venture says. On Thursday, US-New Zealand aerospace company Rocket Lab successfully sent its Electron rocket into space from the remote Mahia Peninsula, between Napier and Gisborne. The rocket reached space and, although it did not quite make it into orbit, that puts New Zealand in the company of an elite group of countries, Rocket Lab chief executive and founder <mark>Peter Beck</mark> told Newshub. \"It's not every day that a country goes to space, I think New Zealand is the 11th nation now to do that, and, if you look at the other nations, they are generally super powers,\" he said on Friday. \"It's a great milestone for the country .\" The rocket reached space but it did not reach orbit, which requires significantly more energy as the launch vehicle must accelerate to about 27 times the speed of sound. \"All the really critical and key stages to go to orbit we achieved,\" Mr <mark>Beck</mark> said. \"We didn't quite get there but we'll find out exactly why but if you've seen any of the footage, New Zealand looks great from space .\" He said the launch also achieved a number of world firsts. \"It was the first all 3D printed rocket engine, first all carbon composite launch vehicle, first electric turbo pump - there was a lot of boxes ticked yesterday .\" Rocket Lab could now confidently push ahead with its next test flights and into commercial operations, Mr <mark>Beck</mark> said. He said the company aimed to send small satellites into orbit because satellites, like other forms of technology, were becoming smaller and did not require large expensive rockets to launch them. \"[There is an] absolute dire need for a small launch vehicle to get small satellites on orbit,\" Mr <mark>Beck</mark> said. NZN", "articleID": "2017052521_00368537_W", "names": {"Peter Beck": ["Q1698582", "Q18421811", "Q51021169", "Q7172742", "Q7172744"]}}, {"date": "2017-05-25", "url": "http://www.canalstreetchronicles.com/2017/5/25/15694306/new-orleans-saints-news-media-gets-first-glimpse-otas-adrian-peterson-michael-thomas-drew-brees", "content": "✕ New Orleans Saints news: Media gets first glimpse of team at OTAs The media was able to observe the 2017 Saints for the first time on Thursday, and there's a lot of good stuff to pass on from it. Rec Stephen Lew-USA TODAY Sports The media attended New Orleans Saints OTAs on Thursday, and gave a ton of reactions for today's news. But first, here's a cool gallery of some of the best pictures from the open session .--New Orleans Saints (@ Saints) May 25, 2017 It's gonna be <mark>Corey Fuller</mark> Hype Day. Looked good--New Orleans Saints (@ Saints) May 25, 2017 Saints coach Sean Payton with 96 on his visor in honor of the late Cortez Kennedy. Players wore 96 decals on helmets. pic.twitter.com/IKWTrLPB0L--Mike Triplett (@ MikeTriplett) May 25, 2017 #Saints wearing 96 decal during OTAs to honor friend Cortez Kennedy pic.twitter.com/qjLpr6EGJY--New Orleans Saints (@ Saints) May 25, 2017 Payton on <mark>Peterson</mark>'s age: he would be the one guy that has gone against conventional wisdom .--New Orleans Saints (@ Saints) May 25, 2017 Wannathank my @ UIWAthletics! And everyone New chapter with an awesome team What a great day to be alive and be a saint! Go saints @ Saints pic.twitter.com/9QBuvirqpE--Alex Jenkins (@ AlexJenkins15) May 25, 2017 Asked if the Saints have a 4-3 base defense, <mark>Dennis Allen</mark> said, \"We're a best 11 defense .\" --New Orleans Saints (@ Saints) May 25, 2017 AJ Klein was first team MLB. Breaux & <mark>Williams</mark> first team CBs. Josh LeRibeus first team center .--Sean Fazende (@ SeanFazende) May 25, 2017 Coach @ SeanPayton's thoughts after the start of OTAs--New Orleans Saints (@ Saints) May 25, 2017 Good news on Saints center Max Unger. He says expects to have walking boot off in a few weeks. Saints honor Cortez Kennedy by wearing No. 96 on practice field | theadvocate.com \"If you didn't know better and you saw him, you might think he worked here,\" Payton said. \"My first time here interviewing with Mickey, we had dinner, and Cortez would always make sure if it was a nice play that he was there to join you .\" News of Kennedy's death has been on the mind of the organization all week. \"He was just here for the draft,\" Payton said. \"All of us are devastated ....It just was so sudden, and it's tough ....As great a player as he was--and trust me, if you had to pull a starting lineup out of the Hall of Fame on defense, he's in the starting lineup--he was that good a guy .\" A.J. Klein started at MLB | Mike Triplett Some other lineup/attendance notables during Saints OTA practice Thursday: A.J. Klein started at MLB (though Manti Te'o still rehabbing). Newly-signed vet Josh LeRibeus at center in place of injured Max Unger. Senio Kelemete and Bryce Harris split time at LT while Terron Armstead watched from the side. P.J. <mark>Williams</mark> started at CB opposite Delvin Breaux. Rookie S <mark>Marcus Williams</mark> spent time with first string in three-safety alignment. DE Hau'oli Kikaha did some individual work as he rehabs from ACL. WR Willie Snead was present but did not participate. DT Nick Fairley did not appear to be in attendance. Undrafted former Georgia Tech QB <mark>Justin Thomas</mark> lined up as a WR. Veteran Josh LeRibeus getting a look at center for Saints this summer with Max Unger out | theadvocate.com \"It was really just the ballhandling, just learning how to snap,\" LeRibeus said. \"Because at guard, you just block the guy, so now you have a little extra aspect, but my whole thing is repetition .\" LeRibeus spent the entire 2016 season as a free agent, but with Unger's injury--the Saints' starter is expected back near the end of the preseason--there's an opening this summer to potentially fight for a roster spot. Veteran Tim Lelito, who backed up Unger last year, left for Tennessee in free agency, and Kelemete is the offensive line's sixth man. Marshon Lattimore is trying to circumvent what can be a hard learning curve for rookie cornerbacks | theadvocate.com So, it shouldn't be a surprise that first-round pick Marshon Lattimore didn't have a perfect showing during his debut practice before the media. He was never targeted during Thursday's organized team activity and appeared to be in phase on each route he defended, but there were other moments when he looked like a rookie trying to figure things out. One of those moments came late in the session when he failed to pick up his receiver coming out of the huddle, and the play had to be restarted. Lattimore was affixed to the right side of the field, and by the time he saw his guy lining up to the left and made his way over it was too late. \"My confidence level is at an all-time high,\" Breaux said Thursday after Saints organized team activities. \"I've worked my behind off this offseason just to know that it's time to be that Pro Bowl or All-Pro type guy .\" I just been working, man, and feel great. \"Can Okafor Give the Saints Pass Rush an Edge? • Saints News Network Okafor can play standing up or with his\" hand in the dirt \", and it's probably likely that the Saints will make him the new\" official' starter at that spot right out the gate; although he'll more than likely fill a situational role as part of a 3-man rotation and no doubt will have to show everyone that he can avoid the nagging injuries that constantly plagued him with the Cardinals. For Saints fans however, the addition of Okafor is looked at in a bit more simpler terms, which is: Can Okafor be the \"complementary\" player on the opposite side of All-Pro defensive end Cam Jordan that the team has lacked since the departure of former defensive end Junior Galette; and give their pass rush \"an edge\" that it has been sorely lacking for the past few seasons? <mark>Adrian Peterson</mark> working on pass-catching skills, and other Saints OTA observations | NOLA.com The Saints played primarily nickel defense throughout the practice. It looked like the familiar 4-2-5 defense we watched most of last season. Alex Okafor, predictably, manned the defensive end spot opposite Cam Jordan. Sheldon Rankins and David Onyemata took snaps with the first unit with Nick Fairley and Tyeler Davison not practicing. More From Canal Street Chronicles", "articleID": "2017052522_00177032_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"], "Corey Fuller": ["Q14918208", "Q5170360"], "Dennis Allen": ["Q1112571", "Q31828242"], "Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"]}}]