[{"date": "2017-05-25", "url": "http://www.canalstreetchronicles.com/2017/5/25/15694306/new-orleans-saints-news-media-gets-first-glimpse-otas-adrian-peterson-michael-thomas-drew-brees", "content": "✕ New Orleans Saints news: Media gets first glimpse of team at OTAs The media was able to observe the 2017 Saints for the first time on Thursday, and there's a lot of good stuff to pass on from it. Rec Stephen Lew-USA TODAY Sports The media attended New Orleans Saints OTAs on Thursday, and gave a ton of reactions for today's news. But first, here's a cool gallery of some of the best pictures from the open session .--New Orleans Saints (@ Saints) May 25, 2017 It's gonna be <mark>Corey Fuller</mark> Hype Day. Looked good--New Orleans Saints (@ Saints) May 25, 2017 Saints coach Sean Payton with 96 on his visor in honor of the late Cortez Kennedy. Players wore 96 decals on helmets. pic.twitter.com/IKWTrLPB0L--Mike Triplett (@ MikeTriplett) May 25, 2017 #Saints wearing 96 decal during OTAs to honor friend Cortez Kennedy pic.twitter.com/qjLpr6EGJY--New Orleans Saints (@ Saints) May 25, 2017 Payton on <mark>Peterson</mark>'s age: he would be the one guy that has gone against conventional wisdom .--New Orleans Saints (@ Saints) May 25, 2017 Wannathank my @ UIWAthletics! And everyone New chapter with an awesome team What a great day to be alive and be a saint! Go saints @ Saints pic.twitter.com/9QBuvirqpE--Alex Jenkins (@ AlexJenkins15) May 25, 2017 Asked if the Saints have a 4-3 base defense, <mark>Dennis Allen</mark> said, \"We're a best 11 defense .\" --New Orleans Saints (@ Saints) May 25, 2017 AJ Klein was first team MLB. Breaux & <mark>Williams</mark> first team CBs. Josh LeRibeus first team center .--Sean Fazende (@ SeanFazende) May 25, 2017 Coach @ SeanPayton's thoughts after the start of OTAs--New Orleans Saints (@ Saints) May 25, 2017 Good news on Saints center Max Unger. He says expects to have walking boot off in a few weeks. Saints honor Cortez Kennedy by wearing No. 96 on practice field | theadvocate.com \"If you didn't know better and you saw him, you might think he worked here,\" Payton said. \"My first time here interviewing with Mickey, we had dinner, and Cortez would always make sure if it was a nice play that he was there to join you .\" News of Kennedy's death has been on the mind of the organization all week. \"He was just here for the draft,\" Payton said. \"All of us are devastated ....It just was so sudden, and it's tough ....As great a player as he was--and trust me, if you had to pull a starting lineup out of the Hall of Fame on defense, he's in the starting lineup--he was that good a guy .\" A.J. Klein started at MLB | Mike Triplett Some other lineup/attendance notables during Saints OTA practice Thursday: A.J. Klein started at MLB (though Manti Te'o still rehabbing). Newly-signed vet Josh LeRibeus at center in place of injured Max Unger. Senio Kelemete and Bryce Harris split time at LT while Terron Armstead watched from the side. P.J. <mark>Williams</mark> started at CB opposite Delvin Breaux. Rookie S <mark>Marcus Williams</mark> spent time with first string in three-safety alignment. DE Hau'oli Kikaha did some individual work as he rehabs from ACL. WR Willie Snead was present but did not participate. DT Nick Fairley did not appear to be in attendance. Undrafted former Georgia Tech QB <mark>Justin Thomas</mark> lined up as a WR. Veteran Josh LeRibeus getting a look at center for Saints this summer with Max Unger out | theadvocate.com \"It was really just the ballhandling, just learning how to snap,\" LeRibeus said. \"Because at guard, you just block the guy, so now you have a little extra aspect, but my whole thing is repetition .\" LeRibeus spent the entire 2016 season as a free agent, but with Unger's injury--the Saints' starter is expected back near the end of the preseason--there's an opening this summer to potentially fight for a roster spot. Veteran Tim Lelito, who backed up Unger last year, left for Tennessee in free agency, and Kelemete is the offensive line's sixth man. Marshon Lattimore is trying to circumvent what can be a hard learning curve for rookie cornerbacks | theadvocate.com So, it shouldn't be a surprise that first-round pick Marshon Lattimore didn't have a perfect showing during his debut practice before the media. He was never targeted during Thursday's organized team activity and appeared to be in phase on each route he defended, but there were other moments when he looked like a rookie trying to figure things out. One of those moments came late in the session when he failed to pick up his receiver coming out of the huddle, and the play had to be restarted. Lattimore was affixed to the right side of the field, and by the time he saw his guy lining up to the left and made his way over it was too late. \"My confidence level is at an all-time high,\" Breaux said Thursday after Saints organized team activities. \"I've worked my behind off this offseason just to know that it's time to be that Pro Bowl or All-Pro type guy .\" I just been working, man, and feel great. \"Can Okafor Give the Saints Pass Rush an Edge? • Saints News Network Okafor can play standing up or with his\" hand in the dirt \", and it's probably likely that the Saints will make him the new\" official' starter at that spot right out the gate; although he'll more than likely fill a situational role as part of a 3-man rotation and no doubt will have to show everyone that he can avoid the nagging injuries that constantly plagued him with the Cardinals. For Saints fans however, the addition of Okafor is looked at in a bit more simpler terms, which is: Can Okafor be the \"complementary\" player on the opposite side of All-Pro defensive end Cam Jordan that the team has lacked since the departure of former defensive end Junior Galette; and give their pass rush \"an edge\" that it has been sorely lacking for the past few seasons? <mark>Adrian Peterson</mark> working on pass-catching skills, and other Saints OTA observations | NOLA.com The Saints played primarily nickel defense throughout the practice. It looked like the familiar 4-2-5 defense we watched most of last season. Alex Okafor, predictably, manned the defensive end spot opposite Cam Jordan. Sheldon Rankins and David Onyemata took snaps with the first unit with Nick Fairley and Tyeler Davison not practicing. More From Canal Street Chronicles", "articleID": "2017052522_00177032_W", "names": {"Marcus Williams": ["Q1120799", "Q17403530", "Q2352338", "Q28180644", "Q3290306", "Q6758540"]}}, {"date": "2017-05-27", "url": "http://www.ndtv.com/world-news/2-men-killed-in-portland-after-trying-to-stop-anti-muslim-rant-police-1704607?pfrom=home-topstories", "content": "2 Men Killed In Portland After Trying To Stop Anti-Muslim Rant: Police A man harassing two women who appeared to be Muslim killed two people who tried to intervene. World | | Updated: May 27, 2017 15:58 IST Reuters 6 Shares PRINT COMMENTS The suspect was arrested when he got off the train where he committed the murders (Representational) Two men were stabbed to death in the US city of Portland on Friday when they tried to stop their attacker from harassing two women because they appeared to be Muslim, police said. The incident unfolded on a commuter train hours before the start of Ramadan, Islam's holy month, when most of the world's 1.6 billion Muslims observe a religious fast. The attack began shortly before 4:30 pm when a man started yelling ethnic and religious slurs toward two women who appeared to be Muslim on a MAX train at the Hollywood Transit Station, the Portland Police Department said in a statement. Three men who intervened were stabbed, two fatally. The attacker was arrested shortly after he got off the train, police said, adding that the women left the scene before police could interview them. \"In the midst of his ranting and raving, some people approached him and appeared to try to intervene with his behavior and some of the people that he was yelling at,\" Portland police spokesman Pete Simpson said during a news conference aired by local news outlets. \"They were attacked viciously by the suspect,\" he added. In a statement responding to Friday's attack, the Council on American-Islamic Relations said that anti-Muslim incidents increased by more than 50 percent in the United States from 2015 to 2016 due in part to President <mark>Donald Trump</mark>'s focus on terrorist groups and anti-immigrant rhetoric. \"President <mark>Trump</mark> must speak out personally against the rising tide of Islamophobia and other forms of bigotry and racism in our nation that he has provoked through his numerous statements, policies and appointments that have negatively impacted minority communities,\" said CAIR National Executive Director Nihad Awad. The <mark>Donald Trump</mark> administration says that while it strongly opposes what it calls \"radical Islamic terrorists\" , it has no quarrel with Islam. Following the attack, police said one of the men died at the scene while another died at a hospital. The third man was treated for non-life threatening injuries. \"These were folks just riding the train and unfortunately got caught up in this,\" he said. Witnesses told police that the two young women were possibly Muslim. One wore a hijab. Portland police did not identify the suspect or the victims. (Reporting by <mark>Brendan O'Brien</mark> in Milwaukee; Editing by Toby Chopra) © Thomson Reuters 2017 (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed .) Trending", "articleID": "2017052712_00222553_W", "names": {"Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-05-29", "url": "http://www.lmtonline.com/news/article/Two-men-wounded-in-Santa-Rosa-in-gang-related-11180925.php", "content": "http: //www.sfgate.com/news/article/Two-men-wounded-in-Santa-Rosa-in-gang-related-11180925.php Two men wounded in Santa Rosa in gang-related incident By John Wildermuth Updated 4:53 pm, Monday, May 29, 2017 Begin Slideshow 35 Photo: Jacom Stephens, Getty Image Image 1 of / 35 Caption Close Image 1 of 35 File photo of police car lights. Flashing Lights on Police Car File photo of police car lights. Flashing Lights on Police Car Photo: Jacom Stephens, Getty Image Image 2 of 35 2017 SF crime statistics from Jan. 1-April 6 2017 SF crime statistics from Jan. 1-April 6 Photo: Ted Andersen Image 3 of 35 San Francisco has 10 police stations: Central, Northern, Southern, Bayview, Ingleside, Taraval, Richmond, Park, Mission and Tenderloin. The city makes crime data available to the public online through DataSF. San Francisco has 10 police stations: Central, Northern, Southern, Bayview, Ingleside, Taraval, Richmond, Park, Mission and Tenderloin. The city makes crime data available to the public online through DataSF. Photo: SFPD Image 4 of 35 The Mission District covers the area east of Twin Peaks and south of Market Street to <mark>Cesar Chavez</mark> Street. The neighborhood has become a destination spot for specialty restaurants, shops and sunny-day people watching. However, the area has seen a huge rise in thefts in 2017. less The Mission District covers the area east of Twin Peaks and south of Market Street to <mark>Cesar Chavez</mark> Street. The neighborhood has become a destination spot for specialty restaurants, shops and sunny-day people...more Photo: Google Maps Image 5 of 35 Mission Station Captain: <mark>Bill Griffin</mark> Capt. <mark>Griffin</mark> grew up in the Richmond District and attended George Washington High School. His father was a juvenile probation officer with the city for over 30 years and encouraged him to try a career in law enforcement. <mark>Griffin</mark> graduated from the SFPD Academy in 1981 and later earned a degree in Criminal Justice Management. He has served in the Mission, Southern, Park, Northern and Ingleside stations. less Mission Station Captain: <mark>Bill Griffin</mark> Capt. <mark>Griffin</mark> grew up in the Richmond District and attended George Washington High School. His father was a juvenile probation officer with the city for over 30 years and...more Photo: SFPD Image 6 of 35 MISSION STATION: 5,742 records No resolution: 4,018, Arrests: 1,639, Arrest/Citation rate: 28 percent 785 violent crimes (672 in 2016) 2,010 burglaries and thefts (1,140 in 2016) Top crime type: Larceny/Theft, 1,325 incidents (563 cases in 2016) 2017: 601 assaults, 172 robberies, 203 burglaries, 262 vehicle thefts (2016: 521 assaults, 142 robberies, 221 burglaries, 238 vehicle thefts) less MISSION STATION: 5,742 records No resolution: 4,018, Arrests: 1,639, Arrest/Citation rate: 28 percent 785 violent crimes (672 in 2016) 2,010 burglaries and thefts (1,140 in 2016) Top crime type:...more Photo: Godong/UIG Via Getty Images Image 7 of 35 SOUTHERN STATION: Southern District incorporates the Ferry Building, extending to the SOMA, Embarcadero, and China Basin areas. SOUTHERN STATION: Southern District incorporates the Ferry Building, extending to the SOMA, Embarcadero, and China Basin areas. Photo: SFPD Image 8 of 35 Southern Station Captain: Daryl Fong Capt. Fong grew up in the Bayview District and attended school in North Beach. Not ascribing to the traditional academic criminology path, he earned a BS degree in marketing at SFSU and then joined the SFPD in 1994. Fong trained at Richmond Station and served at Central Station as a patrol, plainclothes and school resource officer and has also served as a field training sergeant, internal affairs investigator and media relations spokesman. less Southern Station Captain: Daryl Fong Capt. Fong grew up in the Bayview District and attended school in North Beach. Not ascribing to the traditional academic criminology path, he earned a BS degree in marketing...more Photo: SFPD Image 9 of 35 SOUTHERN STATION: 6,996 records No resolution: 5,010, Arrests: 1,855, Arrest/Citation rate: 26 percent 737 violent crimes (672 in 2016) 2,932 burglaries and thefts (3,133 in 2016) Top crime type: Larceny/Theft, 2,254 incidents (2,319 in 2016) 2017: 604 assaults, 156 robberies, 211 burglaries, 190 vehicle thefts (2016: 560 assaults, 128 robberies, 268 burglaries, 158 vehicle thefts) less SOUTHERN STATION: 6,996 records No resolution: 5,010, Arrests: 1,855, Arrest/Citation rate: 26 percent 737 violent crimes (672 in 2016) 2,932 burglaries and thefts (3,133 in 2016) Top crime type:...more Photo: Ted Andersen Image 10 of 35 CENTRAL STATION: Central Station is located in the center of tourism, commerce, entertainment and civic events. The district comprises the Financial district, Chinatown, North Beach, Fisherman's Wharf, and three famous hills: Telegraph, Nob and Russian. less CENTRAL STATION: Central Station is located in the center of tourism, commerce, entertainment and civic events. The district comprises the Financial district, Chinatown, North Beach, Fisherman's Wharf, and...more Photo: SFPD Image 11 of 35 Central Station Captain: Paul Yep Capt. Yep was born at San Francisco's Chinese Hospital and raised in Chinatown. He attended Lowell High School and earned a BA degree in Business Administration from San Francisco State University. He joined the San Francisco Police Department in 1996, serving as a patrol officer at Central, Northern, Southern and Taraval Police Stations. He has also worked in the Community Relations Unit, Domestic Violence Reduction Unit, Vice Crimes Division, Station Investigations Teams and was the Director of Basic Training for the Police Academy until his promotion to Captain in 2016. less Central Station Captain: Paul Yep Capt. Yep was born at San Francisco's Chinese Hospital and raised in Chinatown. He attended Lowell High School and earned a BA degree in Business Administration from San...more Photo: SFPD Image 12 of 35 CENTRAL STATION: 4,561 records No resolution: 3,683, Arrests: 803, Arrest/Citation rate: 18 percent 433 violent crimes (405 in 2016) 2,301 burglaries and thefts (2,230 in 2016) Top crime type: Larceny/Theft, 1,175 incidents (1,640 in 2016) 2017: 309 assaults, 119 robberies, 206 burglaries, 133 vehicle thefts (2016: 327 assaults, 101 robberies, 141 burglaries, 118 vehicle thefts) less CENTRAL STATION: 4,561 records No resolution: 3,683, Arrests: 803, Arrest/Citation rate: 18 percent 433 violent crimes (405 in 2016) 2,301 burglaries and thefts (2,230 in 2016) Top crime type:...more Photo: Ted Andersen Image 13 of 35 NORTHERN STATION: The Northern District encompasses the Western Addition, Pacific Heights, Japantown, Polk Gulch, Russian Hill and the Marina. Although the Northern District is geographically one of the smallest, it's one of the most densely populated with large apartment buildings, senior citizens' residences, residential hotels, and public housing complexes. less NORTHERN STATION: The Northern District encompasses the Western Addition, Pacific Heights, Japantown, Polk Gulch, Russian Hill and the Marina. Although the Northern District is geographically one of the...more Photo: SFPD Image 14 of 35 Northern Station Captain: John Jaimerena Capt. Jaimerena was born in the Sunset and grew up on the peninsula. He joined SFPD in 1994 and spent much of his early career as a plainclothes and field training officer in the Southern Station. He later worked with the Gang Task Force at Tenderloin Station and became captain of Northern Station in 2016. less Northern Station Captain: John Jaimerena Capt. Jaimerena was born in the Sunset and grew up on the peninsula. He joined SFPD in 1994 and spent much of his early career as a plainclothes and field training...more Photo: SFPD Image 15 of 35 NORTHERN STATION: 5,604 records No resolution: 4,423, Arrests: 1,126, Arrest/Citation rate: 20 percent 436 violent crimes (485 in 2016) 2,883 burglaries and thefts (2,380 in 2016) Top crime type: Larceny/Theft, 2,314 incidents (1,756 in 2016) 2017: 359 assaults, 81 robberies, 234 burglaries, 196 vehicle thefts (2016: 408 assaults, 90 robberies, 224 burglaries, 198 vehicle thefts) less NORTHERN STATION: 5,604 records No resolution: 4,423, Arrests: 1,126, Arrest/Citation rate: 20 percent 436 violent crimes (485 in 2016) 2,883 burglaries and thefts (2,380 in 2016) Top crime type:...more Photo: Ted Andersen Image 16 of 35 PARK STATION: The Park District serves Cole Valley, Haight Street, the Western Addition, Twin Peaks, and the Duboce and Castro areas. They work in patrol cars, on foot beats, patrol wagons and off-road vehicles in and out of Golden Gate Park. less PARK STATION: The Park District serves Cole Valley, Haight Street, the Western Addition, Twin Peaks, and the Duboce and Castro areas. They work in patrol cars, on foot beats, patrol wagons and off-road vehicles...more Photo: SFPD Image 17 of 35 Park Station Captain: John Sanford Jr.. Capt. Sanford was born and raised in the Bayview/Hunters Point area and began his law enforcement career at age 14 as a Police Activities League cadet. Sanford attended Woodrow Wilson High School in San Francisco and holds a B.S. in public administration from the USF and an M.A. in leadership from Saint Mary's. less Park Station Captain: John Sanford Jr.. Capt. Sanford was born and raised in the Bayview/Hunters Point area and began his law enforcement career at age 14 as a Police Activities League cadet. Sanford attended...more Photo: SFPD Image 18 of 35 PARK STATION: 2,258 records No resolution: 1,767, Arrests: 456, Arrest/Citation rate: 20 percent 203 violent crimes (163 in 2016) 893 burglaries and thefts (948 in 2016) Top crime type: Larceny/Theft, 582 incidents (620 in 2016) 2017: 168 assaults, 27 robberies, 130 burglaries, 106 vehicle thefts (2016: 150 assaults, 26 robberies, 148 burglaries, 117 vehicle thefts) less PARK STATION: 2,258 records No resolution: 1,767, Arrests: 456, Arrest/Citation rate: 20 percent 203 violent crimes (163 in 2016) 893 burglaries and thefts (948 in 2016) Top crime type: Larceny/Theft, 582...more Photo: Mathew Sumner, Special To The Chronicle Image 19 of 35 TARAVAL STATION: The Taraval District encompasses a large area of the western part of the city, extending from west of Twin Peaks to Ocean Beach and south to the county line and north to Lincoln Way. The Taraval district is mostly residential and contains many schools and the zoo. less TARAVAL STATION: The Taraval District encompasses a large area of the western part of the city, extending from west of Twin Peaks to Ocean Beach and south to the county line and north to Lincoln Way. The Taraval...more Photo: SFPD Image 20 of 35 Taraval Station Captain: Denise Flaherty Capt. Flaherty grew up in the Mission District and joined SFPD in 1991. She has served in Central, Northern, Taraval, Richmond, Ingleside, Tenderloin and Park districts and has worked in the Narcotics Unit, Burglary Detail, Homeland Security, and in the Tenderloin Task Force. She became Captain of Taraval Station in 2012. less Taraval Station Captain: Denise Flaherty Capt. Flaherty grew up in the Mission District and joined SFPD in 1991. She has served in Central, Northern, Taraval, Richmond, Ingleside, Tenderloin and Park districts...more Photo: SFPD Image 21 of 35 TARAVAL STATION: 3,204 records No resolution: 2,476, Arrests: 662, Arrest/Citation rate: 21 percent 312 violent crimes (257 in Taraval) 1,184 burglaries and thefts (1,292 in 2016) Top crime type: Larceny/Theft, 790 incidents (816 in 2016) 2017: 282 assaults, 50 robberies, 188 burglaries, 145 vehicle thefts (2016: 233 assaults, 47 robberies, 224 burglaries, 150 vehicle thefts) less TARAVAL STATION: 3,204 records No resolution: 2,476, Arrests: 662, Arrest/Citation rate: 21 percent 312 violent crimes (257 in Taraval) 1,184 burglaries and thefts (1,292 in 2016) Top crime type:...more Photo: Stephen Lam, Special To The Chronicle Image 22 of 35 BAYVIEW and INGLESIDE STATIONS: The Bayview District covers one of the largest areas of the southeastern part of the city, extending along the eastern edge of McClaren Park to the bay and south to the San Mateo County line. The Ingleside Police District encompasses the area south of <mark>Cesar Chavez</mark> Street to the San Mateo County line, and area west from Highway 101 to Faxon Avenue and includes Balboa Park, McLaren Park and the Excelsior. less BAYVIEW and INGLESIDE STATIONS: The Bayview District covers one of the largest areas of the southeastern part of the city, extending along the eastern edge of McClaren Park to the bay and south to the San Mateo...more Photo: SFPD Image 23 of 35 Bayview Station Captain: Raj Vaswani Capt. Vaswani has more than 23 years of experience as a police officer, working in patrol, street crimes/narcotics plainclothes, investigative and field operations. He has worked in the Potereo, Ingleside, Southern, Northern, Park and Mission districts. less Bayview Station Captain: Raj Vaswani Capt. Vaswani has more than 23 years of experience as a police officer, working in patrol, street crimes/narcotics plainclothes, investigative and field operations. He has...more Photo: SFPD Image 24 of 35 BAYVIEW STATION: 3,648 records No resolution: 2,619 Arrests: 970, Arrest/Citation rate: 27 percent 476 violent crimes (500 in 2016) 1,143 burglaries and thefts (1,164 in 2016) Top crime type: Larceny/Theft, 686 incidents (650 in 2016) 2017: 426 assaults, 77 robberies, 135 burglaries, 258 vehicle thefts (2016: 468 assault, 64 robbery, 133 burglaries, 272 vehicle thefts in 2016) less BAYVIEW STATION: 3,648 records No resolution: 2,619 Arrests: 970, Arrest/Citation rate: 27 percent 476 violent crimes (500 in 2016) 1,143 burglaries and thefts (1,164 in 2016) Top crime type:...more Photo: Kevin Schultz / The Chronicle Image 25 of 35 Ingleside Station Captain: Joe McFadden Capt. Joe McFadden grew up in the Mission District. With more than 27 years in the SFPD, he began his law enforcement career as an Ingleside station patrol officer and has since served in Field Operations, Tactical (SWAT) Team, Investigations Bureau, Management Control/Internal Affairs, Homeland Security, and Crime Scene Investigations. less Ingleside Station Captain: Joe McFadden Capt. Joe McFadden grew up in the Mission District. With more than 27 years in the SFPD, he began his law enforcement career as an Ingleside station patrol officer and...more Photo: SFPD Image 26 of 35 INGLESIDE STATION: 3,099 records No resolution: 2,270, Arrests: 765 Arrest/Citation rate: 25 percent 411 violent crimes (477 in 2016) 989 burglaries and thefts (1,074 in 2016) Top crime type: Larceny/Theft, 571 incidents (555 in 2016) 2017: 350 assaults, 71 robberies, 159 burglaries, 231 vehicle thefts) (2016: 432 assaults, 89 robberies, 167 burglaries, 278 vehicle thefts) less INGLESIDE STATION: 3,099 records No resolution: 2,270, Arrests: 765 Arrest/Citation rate: 25 percent 411 violent crimes (477 in 2016) 989 burglaries and thefts (1,074 in 2016) Top crime type:...more Photo: PAUL CHINN Image 27 of 35 TENDERLOIN STATION: The Tenderloin District is the smallest of 10 district station areas. The Tenderloin Task Force was created on April 1st 1991 (with SF's first bicycle patrol) to combat high levels of crime in that area and made its headquarters in the basement of the historic Hibernia Bank building. A new headquarters opened in 2000 at 301 Eddy St. less TENDERLOIN STATION: The Tenderloin District is the smallest of 10 district station areas. The Tenderloin Task Force was created on April 1st 1991 (with SF's first bicycle patrol) to combat high levels of crime...more Photo: SFPD Image 28 of 35 Tenderloin Station Captain: Teresa Ewins Capt. Ewins spent her early years in SoCal but moved to the East Bay at age 10. She graduated from the SFPD Academy in 1995 and has since worked in the Southern, Mission, and Bayview stations. She has served in the Homeland Security Unit, the Special Victims Unit and the Fugitive Recovery Enforcement Team and led the Tactical Division before becoming Tenderloin Station captain in 2015. less Tenderloin Station Captain: Teresa Ewins Capt. Ewins spent her early years in SoCal but moved to the East Bay at age 10. She graduated from the SFPD Academy in 1995 and has since worked in the Southern,...more Photo: SFPD Image 29 of 35 TENDERLOIN STATION: 2,336 records No resolution: 1,303, Arrests: 984, Arrest/Citation rate: 42 percent 329 violent crimes (408 in 2016) 588 burglaries and thefts (680 in 2016) Top crime type: Larceny/Theft, 427 incidents (479 in 2016) 2017: 262 assaults, 75 robberies, 42 burglaries, 33 vehicle thefts (2016: 340 assaults, 89 robberies, 44 burglaries, 39 vehicle thefts) less TENDERLOIN STATION: 2,336 records No resolution: 1,303, Arrests: 984, Arrest/Citation rate: 42 percent 329 violent crimes (408 in 2016) 588 burglaries and thefts (680 in 2016) Top crime type:...more Photo: Ted Andersen Image 30 of 35 RICHMOND STATION: Covering the northwest corner of the city, the Richmond District is largely residential, but also includes the commercial, shopping, and restaurant corridors of Geary Boulevard and Clement Street, most of Golden Gate Park, the Golden Gate National Recreation Area and the University of San Francisco campus. less RICHMOND STATION: Covering the northwest corner of the city, the Richmond District is largely residential, but also includes the commercial, shopping, and restaurant corridors of Geary Boulevard and Clement...more Photo: SFPD Image 31 of 35 Richmond Station Captain: Alexa O’Brien Capt. Alexa O’Brien grew up in the Marina and Richmond districts. She earned a BA degree in sociology with a minor in criminology from USF before graduating from the SFPD academy in 2000. She has served at Southern, Mission, Northern, Park and Ingleside stations. In addition, she has served in Vice and Night Investigations and led the Homicide Detail and Major Crimes Unit. less Richmond Station Captain: Alexa O’Brien Capt. Alexa O’Brien grew up in the Marina and Richmond districts. She earned a BA degree in sociology with a minor in criminology from USF before graduating from the...more Photo: SFPD Image 32 of 35 RICHMOND STATION: 2,355 records No resolution: 1,892, Arrests: 409, Arrest/Citation rate: 18 percent 150 violent crimes (147 in 2016) 1,148 burglaries and thefts (1,143 in 2016) Top crime type: Larceny/Theft, 871 incidents (828 in 2016) 2017: 115 assaults, 23 robberies, 107 burglaries, 88 vehicle thefts (2016: 128 assaults, 21 robberies, 106 burglaries, 148 vehicle thefts in 2016) less RICHMOND STATION: 2,355 records No resolution: 1,892, Arrests: 409, Arrest/Citation rate: 18 percent 150 violent crimes (147 in 2016) 1,148 burglaries and thefts (1,143 in 2016) Top crime type:...more Photo: Liz Hafalia, The Chronicle Image 33 of 35 Violent crime throughout San Francisco in 2017. Violent crime throughout San Francisco in 2017. Photo: Ted Andersen Image 34 of 35 Thefts and burglaries throughout San Francisco in 2017. Thefts and burglaries throughout San Francisco in 2017. Photo: Ted Andersen Image 35 of 35 Two men wounded in Santa Rosa in gang-related incident 1 / 35 Back to Gallery Two men were hospitalized after being shot as they were walking on the Newhall Bike Path in Santa Rosa, police said Monday. The shootings occurred shortly before 10 p.m. Sunday. Officers were sent to to the 1300 block of Grand Avenue in response to a report of a gunshot victim. As they were on their way to the site, they learned of a second gunshot victim in the 500 block of Colgan Avenue, police said in a statement. The victims were taken to a local hospital where they are listed in serious, but stable condition. The victims, whose names were not released, were leaving Martin Luther King Park and were walking home via the bike path, when they were confronted by several suspects and at least one shooter, police said. The victims immediately fled the area seeking safety and assistance. Detectives from the Gang Crimes Team were called to assist and take over the investigation. The detectives believe the shooting was a targeted incident and gang-related. police said. Related Stories Man killed by Vacaville police after car chase Alternative courts for veterans show promise Mountain View man arraigned on child porn, cyberstalking charges The Santa Rosa Police Department is encouraging anyone who witnessed or has information regarding the incident to call the Gang Crimes Team at (707) 543-3670. A reward up to $2,500 is being offered by the Sonoma County Alliance \"Take Back Our Community Program .\" The reward is for information leading to the arrest and conviction of the suspects involved in this shooting. John Wildermuth is a San Francisco Chronicle staff writer. Email: jwildermuth @ sfchronicle.com Twitter: @ jfwildermuth The Latest U2's Bono made time to visit George W. Bush during the band's...\"It's sexist': Men flip out over women-only\" Wonder Woman'...Texas OKs upping combative board of ed's textbook veto power Budget totaling $216.8 billion is approved Toddler \"alert, smiling' after missing a day in Houston-area...Texas approves banning drones over stadiums, prisons Texas approves extending exam reprieve for some students Searching for killers, Texas Rangers post cold cases online Rockers U2 made a pit stop at a Whataburger after their...Photo: Retired Spurs star spotted at TX convenience store Best places to eat on a Texas road trip Supermodel suffers a second wardrobe malfunction Leaving Netflix, HBO June 2017 Most Popular 1 LPD: Suspect who hit three women with vehicle in custody 2 14-year-old boy electrocuted in central Laredo during severe...3 The best burgers in Laredo, according to Yelp 4 10 things to do in Laredo for Memorial Day weekend 5 Martin player with Down syndrome shines in All-Star game win 6 Manu Ginobili backs J.K. Rowling's trolling of <mark>Donald Trump</mark> 7 Photo: <mark>Tim Duncan</mark> spotted at San Antonio-area convenience store 8 Missing Tennessee teenager found, father arrested 9 Man found guilty of murdering 3-year-old in Laredo motel room 10 DAVID TAMEZ View Comments © 2017 Hearst Communications, Inc. .", "articleID": "2017052921_01208568_W", "names": {"Bill Griffin": ["Q16224682", "Q4909225"], "Cesar Chavez": ["Q17299958", "Q27983465", "Q5202531"], "Donald Trump": ["Q22686", "Q27947481"], "Tim Duncan": ["Q193020", "Q7803451"]}}, {"date": "2017-05-30", "url": "http://thecourierexpress.com/lifestyle/entertainment/geoffrey-rush-originality-has-been-key-to-pirates-of-the/article_9650c6f2-9985-5a97-a05b-ebf94562f1ce.html", "content": "Geoffrey Rush thinks the \"Pirates of the Caribbean' franchise was wise to avoid stereotypes. The 65-year-old actor - who stars as Hector Barbossa in the money-spinning movie series - has claimed the success of the\" Pirates' films can be linked to their unconventional characters, like Captain Jack Sparrow. He explained: \"Right from the beginning, we always talked about how pirate films were a bit dead in the water, maybe since the '50s with Errol Flynn and Burt Lancaster, certainly as a populist film. There's been\" The Princess Bride', and films like that. \"We were very low down on the summer release schedule. We were lost in the small print in the trades, under\" This is what's coming out, in the summer of 2003'. \"Jerry Bruckheimer timed it right. This was pre-Twitter and pre-social media. It really thrilling caught people's imaginations, and I think part of that was the originality of how Johnny [Depp] led the company and created a pirate that had none of the traditional tropes .\" Geoffrey thinks his on-screen co-star and his original way of thinking has been central to the success of the franchise. More from this section Review: \"Killers of the Flower Moon: The Osage Murders and the Birth of the FBI' by David Grann Nick Grimshaw starstruck by <mark>Chris Pratt</mark> Gregg Allman dies aged 69 The actor told Collider:\" [Depp] does have a tangential, warped, absurd, creative mind, and he looked at the idea that they all drank rum and they were always in the sun. \"He said,\" Geoffrey, man, their brains are fried!' And then, he talked about rock stars of the '60s and the flamboyant clothing. And he came up with this idea, which I thought was really, really clever, where he said, \"In the script, sometimes I'm on boats and sometimes I'm on land, and I just want to play around with never getting my sea legs and land legs in order,' and that gave him so much scope .\" And with Barbossa not having a parrot, but having a monkey, we tried to find archetypes and not stereotypes. \"", "articleID": "2017053007_00391172_W", "names": {"Chris Pratt": ["Q503706", "Q5107796"]}}, {"date": "2017-05-31", "url": "http://www.pe.com/2017/05/30/riverside-poly-holds-off-dana-hills-reaches-first-softball-final-since-2004/", "content": "Riverside Poly holds off Dana Hills, reaches first softball final since 2004 By Michael Huntley | Press-Enterprise PUBLISHED: May 30, 2017 at 10:02 pm | UPDATED: May 30, 2017 at 10:04 pm DANA POINT>> The Riverside Poly softball team outlasted Dana Hills, 6-4, Tuesday in the semifinals of the CIF-SS Division 2 playoffs. Riverside Poly (28-6) will play in its first championship game since 2004, taking on Camarillo on Friday or Saturday at <mark>Bill Barber</mark> Park in Irvine. \"It's such a great feeling for this group of girls,\" Bears coach Robert Sakaguchi said. \"They are doing absolutely everything we could have expected or wanted from them .\" The loss snapped a 12-game winning streak for Dana Hills (19-13), which won the Sea View League championship this season. \"This is the best group we've had since I've been coaching here,\" Dana Hills coach Brandon Cosenza said. \"They battled until the end and done everything we've asked. It's been a successful and fun season .\" The Dolphins were shut out by Riverside Poly pitcher <mark>Paige Peterson</mark> until fifth inning. They trailed, 6-0, but scored three runs in the fifth and one in the sixth to cut the lead to two. Cozette Zoch started the rally with a triple in the fifth inning. Cameron Cecil drove her in for the Dolphin's first run of the game. Tori Sickmeier and Jessie Nagel drove in the other two runs in the inning. Carlee Russo singled in the sixth and was driven in by Cecil to cut the Poly lead to two. \"I have to admit, I got a little comfortable with the lead,\" <mark>Peterson</mark> said. \"But after I saw them scoring, it got into my head and I picked it up .\" <mark>Peterson</mark> has been the most reliable pitcher for the Bears all season. The senior allowed only one run the past two playoff games. \"It was a gutsy performance,\" Sakaguchi said. \"She knew that her team needed her and we weren't going to go to anyone else. She stepped up and took that challenge .\" Riverside Poly struck first in the third inning with a four-run rally. The Bears hit four consecutive singles, which included run-scoring hits by Niki Calderon and Kayla Trayor. Later in the inning, Jacquelin Loya drove in a run on a fielder's choice. In the fifth inning, Nahuaque Orona led off the inning for Riverside Poly with a triple. On the ensuing pitch, Savannah Favre hit an inside-the-park home run to extend the Poly lead to 6-0. \"We were talking about it on the drive over here that with the size of this field, any gapper could turn into a home run,\" Sakaguchi said. \"It was huge getting those runs but we still weren't comfortable .\" Get the latest news delivered daily! Subscribe Follow Us Facebook Twitter Instagram RSS", "articleID": "2017053105_00203726_W", "names": {"Bill Barber": ["Q30122755", "Q323103"], "Paige Peterson": ["Q1170263", "Q7124726"]}}]