[{"date": "2017-05-31", "url": "http://lithgowmercury.com.au/story/4700368/breaking-government-jobs-to-stay-in-lithgow/?cs=1464", "content": "The Office of State Revenue said it has listened to feedback from the community and staff members. After a scare earlier this week the 25 jobs are set to stay at the State Office Block on Railway Parade in Lithgow. Lithgow can breathe a little easier after the Office of State Revenue back flipped on its decision to transfer 25 jobs from Lithgow to Gosford. Office of State Revenue deputy secretary <mark>Stephen Brady</mark> said the organisation had listened to feedback from the community and staff members. \"Following consideration of this feedback, we have decided not to move the Collection Centre positions in Lithgow and Maitland to the new Gosford office through natural attrition. These positions will remain in their current locations,\" Mr <mark>Brady</mark> said. \"We continue to be committed to supporting our staff .\" Councillor Cassandra Coleman had earlier revealed the plans to move the jobs away from Lithgow at Monday night's council meeting. \"This is a great concern for our community. It's 25 times $67,000 worth of wages that we need to consider as a great urgency,\" she said. A total of $1.68 million that would have been funneled out of the Lithgow economy but is now here to stay for the foreseeable future.", "articleID": "2017053106_00652169_W", "names": {"Stephen Brady": ["Q1831756", "Q7608762"]}}, {"date": "2017-06-01", "url": "https://www.bloomberg.com/news/articles/2017-06-01/bank-of-russia-concedes-focus-shifting-as-inflation-nears-target", "content": "Bank of Russia Concedes Focus Shifting as Inflation Nears Target - Bloomberg Bloomberg the Company & Its Products Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 MENU Bank of Russia Concedes Focus Shifting as Inflation Nears Target by Nabiullina sees policy focused on keeping prices low, stable Central bank won't ease \"sharply and quickly,' governor says Russia's central bank is shifting gears as the goal of achieving its inflation target gives way to policy normalization. After a period of two years when rate setters focused on disinflation, steering price growth from almost 17 percent to near 4 percent, their attention now is on keeping it stable and low, Bank of Russia Governor Elvira Nabiullina said on Thursday at a panel during the St. Petersburg International Economic Forum .\" In some sense, the focus of our monetary policy has already changed slightly, \"she said. The aim is to ensure\" a gradual decline of annual inflation to 4 percent and holding it near that level in the future. \"With the price goal within reach months ahead of schedule, the central bank is broadening the scope of policy and clarifying its intentions after two surprise rate cuts of half a percentage point each. But its stance remains\" moderately tight, \"leaving Nabiullina to temper expectations of a pivot toward deeper easing two weeks before the Bank of Russia reviews borrowing costs again .\" We don't rush to loosen monetary policy sharply and quickly because we need to be sure that low inflation is rooted in such fundamental factors as a propensity to consume, a propensity to save, based on inflation expectations, \"she said. The central bank will cut its key rate to 9 percent from 9.25 percent at its June 16 meeting, according to most of the economists polled by Bloomberg. The benchmark will end the year at 8.25 percent, according to an average estimate of analysts in another survey. The most important market news of the day. Get our markets daily newsletter. Sign Up The median value of inflation expectations for a year ahead remains at more than double the target. While consumer-price growth slowed to 4.1 percent in April from a year earlier, households' perceived inflation was at 12.1 percent in May, according to a poll conducted for the central bank. Policy makers consider inflation expectations\" a pillar \"for making their rate decisions, according to <mark>Igor Dmitriev</mark>, head of the central bank' monetary policy department .\" Our target is not to reach 4 percent for one month, but to support the stability of low inflation in the medium term, \"Nabiullina said .\" And we can say that we reached low stable inflation in two to three years. \"Before it's here, it's on the Bloomberg Terminal.", "articleID": "2017060112_00667043_W", "names": {"Igor Dmitriev": ["Q1657680", "Q27579756", "Q433411"]}}, {"date": "2017-06-01", "url": "http://theintell.com/life-style/local-entertainment/music/the-chainsmokers-to-light-up-liacouras-center-in-philadelphia-on/article_4d13ab18-66ea-5831-aab0-e2c058171df5.html", "content": "Close Chris Pizzello/Associated Press \"It's been crazy,\" Alex Pall (right) says of the success he and Drew Taggart have enjoyed as the Chainsmokers. The Chainsmokers to light up Liacouras Center in Philadelphia on Saturday By Ed Condran, correspondent 0 Chris Pizzello/Associated Press \"It's been crazy,\" Alex Pall (right) says of the success he and Drew Taggart have enjoyed as the Chainsmokers. According to the National Health Interview Survey, cigarette smoking among adults and teens has dropped dramatically over recent years. However, according to the Billboard charts, the Chainsmokers are all the rage. There was no secondhand smoke when the Chainsmokers--Alex Pall and Drew Taggart--played South By Southwest in March. The fans who jammed into the Sony party to catch the charismatic EDM-pop duo during the annual music festival/conference couldn't get enough of the act. But that's no surprise considering how well the Chainsmokers have been doing on the charts. The catchy single \"Roses\" reached the Top 10 on the Billboard Hot 100. \"Don't Let Me Down\" became their first top-five single and won the Grammy Award for best dance recording. \"Closer\" became their first No. 1 single on the chart. \"It's been crazy,\" Pall says. \"But it's a good crazy. We are running around so much that we don't get a chance to absorb all of this .\" It's been a whirlwind since the tandem hooked up in 2012. In just five years, the celebrated act is headlining arenas. \"Things have happened quickly for us but we've worked hard for this,\" Pall says. \"We're constantly working .\" The Chainsmokers, who will perform Saturday at the Liacouras Center, are touring behind their first full-length album, \"Memories: Do Not Open,\" which dropped in April. \"Memories\" is cut from the same cloth as the act's EP, 2016's \"Collage .\" The new tunes are witty, playful and hook-laden. \"It Wont' Kill You\" and \"Wake Up Alone\" sound like future hits. Fans danced enthusiastically to the party rock anthems in Austin. \"You never know what's going to happen,\" Pall says. \"We're just happy to have the opportunity to make music .\" It wasn't that long ago that Pall was working as an art gallery receptionist in New York, which is where he grew up. Taggart was an intern at Interscope Records when they met. \"We had this huge connection over music,\" Pall says. \"Calvin Harris, Deadmau5 and David Guetta are some of the artists we talked about when we met. We got together all of the time to make music. It was slow at the start but we started to get it going. The cool thing was that we got some good feedback .\" Less than two years after meeting, the Chainsmokers scored with \"#Selfie,\" which became a viral sensation. \"That was a joke but it blew up,\" Pall says. \"We were just having fun, messing around and it took off. We were in an odd spot since we really didn't have anything else...to showcase. We were just getting started and we didn't expect anyone to get that excited over it (' #Selfie').\" But when the Chainsmokers were pressed to come up with material, the pair came through. \"We love making music,\" Pall says. \"The fame can get in the way. But we try to ignore that stuff and just focus on what matters. It's all about the songs .\" There should be plenty of future for the Chainsmokers since Pall is 31 and Taggart is just 27. \"We're excited about everything,\" Pall says. \"The response has been amazing. We love our fans but we know we have so much ahead of us. We have a lot of work to do .\" Enjoying our content? Become a Intelligencer subscriber to support stories like these. Get full access to our signature journalism for just 44 cents a day. The Chainsmokers appear Saturday at the Liacouras Center, 1776 N. Broad St., Philadelphia. Klara, Whethan and <mark>Emily Warren</mark> will open. Show time: 8 p.m. Tickets: $81 and $110. Information: 215-204-2400; www.liacourascenter.com Tags", "articleID": "2017060112_00953840_W", "names": {"Emily Warren": ["Q22314878", "Q24060566"]}}, {"date": "2017-06-02", "url": "http://www.sbs.com.au/news/article/2017/06/02/kyrgios-still-wimbledon-dreamer", "content": "World News Radio Kyrgios still a Wimbledon dreamer Nick Kyrgios believes he remains a factor in Wimbledon reckoning despite his second-round elimination from the French Open in Paris. Source: Tweet Nick Kyrgios maintains he is a Wimbledon force despite injuries and the death of his grandfather scuppering his French Open hopes. A deflated Kyrgios is hoping a doubles run at Roland Garros with Australian Davis Cup teammate <mark>Jordan Thompson</mark> can boost his spirits ahead of next month's grasscourt showpiece at the All England Club. With a rare four aces in one flawless service game, Kyrgios displayed in his 5-7 6-4 6-1 6-2 second-round loss in Paris to <mark>Kevin Anderson</mark> that he remains very much a top-six title contender at London's SW19. Despite conceding his battered body needs rest, Kyrgios is confident four weeks is \"enough time\" to recover and prepare for tennis's most prestigious event. But he's playing a dangerous balancing act. \"At the same time I need rest, but I need the practice as well,\" Kyrgios said. \"I haven't been hitting enough tennis balls .\" For my first round, I was serving and I only played three sets and my shoulder was sore. \"So usually at grand slams I don't really feel my body at all, really. That's just a sign that my body is a bit underdone .\" I haven't really put together any good training in the last couple weeks, obviously just trying to manage some niggles and obviously I haven't really structured any good training in the last five weeks. \"So I don't think I was match-ready to play best-of-five-sets .\" A Wimbledon quarter-finalist at just 19 three years ago, Kyrgios is adamant he remains a threat - and doubles in Paris is central to his preparation. He and <mark>Thompson</mark> knocked out French second seeds Nicolas Mahut and Pierre-Hugues Herbert in round one to open up the draw beautifully for a run at the title. \"It's good just to keep playing core matches, just keep playing,\" Kyrgios said. \"I think me and Thommo can do well here as well. I'm just going to focus on that for now .\" I was going to maybe go home after this week if I didn't do so well here, but obviously winning a round and still in doubles, it's cutting the time pretty slim. \"So I don't really know what I'm going to do next week. I'm not sure .\" Kyrgios's only scheduled grasscourt event before Wimbledon is Queens. Currently ranked 19th, he needs to improve his ranking to secure a top-16 seeding to ensure he won't run into a top-eight heavyweight like defending champion <mark>Andy Murray</mark>, world No. 2 Novak Djokovic or resurgent seven-time champion Roger Federer until at least the quarter-finals. Kyrgios, however, is more concerned about rediscovering his mojo. \"I haven't put in enough work to have gone deep here. The whole team knows it,\" he said. \"The surprising thing is I was in a winning position today and I still could have won .\" It doesn't even matter how underdone I was. I still could have won. \"I've just got to practise. You know, during Indian Wells and Miami time, I was practising a lot. After my grandpa passing, I just lost a lot of motivation to do anything, really .\" Advertisement", "articleID": "2017060203_00254732_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "Jordan Thompson": ["Q16219277", "Q18385737", "Q6277054"], "Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"]}}, {"date": "2017-06-02", "url": "http://www.huffingtonpost.com/2017/05/30/15-times-brooke-shields-captured-the-highs-and-lows-of-motherhood_n_16925520.html", "content": "Neilson Barnard via Getty Images Brooke Shields has two daughters, Rowan and Grier. Brooke Shields is no stranger to the highs and lows of parenting. The actress and her husband, Chris Henchy, have two daughters, 14-year-old Rowan and 11-year-old Grier. Over the years, Shields has been incredibly open about her experiences as a mother--from her battle with postpartum depression (the subject of her 2005 memoir Down Came the Rain) to her parenting rules to her hopes for her children. In honor of her birthday this week, we've compiled some of her most honest and touching quotes about parenthood. On her fears as a mother \"I'm terrified that I'm not really understanding who they are, and that maybe one day they won't feel like they can come to me--that I will somehow fail them...I don't know if you overcome it. The way I try to get through it is by talking to other moms. Either someone will do something that's seemingly worse, and I'll think,\" At least I didn't do that,' but then someone will do something better and I think, \"I've gotta learn that, I've got to do that instead!\" ' On her advice for new parents \"Don't be afraid to ask for help and don't be too hard on yourself. If you think that everybody else has it figured out and you're the only one that's going crazy or yelling or feeling like you can't do it all...you're not alone .\" A post shared by Brooke Shields (@ brookeshields) on Apr 16, 2017 at 9:37 am PDT On living in the moment \"They're not going to remember Mom was tired. They're going to remember I did the weather chart or story time at school. So you just do it. And you're tired...It's the mundane stuff that is important .\" On playdates and raising grounded kids \"If you're not polite, you can't come to my house. Manners [represent] respect and kindness. I want people to like my kids, and if they're bratty, they'll have a harder time in life .\" On the beauty of parenthood \"Once you love someone that much, you think, god, why did I do this to myself? It's so heart-wrenching! And then you realize: It's so heart-wrenching. That's why I did it to myself .\" On her decision to speak out about her postpartum depression \"Because nobody was talking about postpartum depression, and women were suffering all the time. I wanted to educate women who were suffering and families of women who were suffering .\" <mark>Mark Avery</mark> / Reuters On being a celebrity parent \"You know, the only reason why it seems like it's more challenging is because it's in the public eye to a certain extent and it's scrutinized, but that is such a minor percentage. Really the challenges are just about being a mom. All moms have them, and nobody's exempt .\" On staying calm as a mother \"Every day there's a new challenge. My new thing is not screaming and not screaming back at them. I would engage in an absolute fight, and my husband would say,\" What's wrong with you? Why are you fighting with them?'...Chris, my husband, calls it FOFO--Find Out Before You Freak Out. So before I react, I'm now trying to just count to 10. \"On how becoming a mom changed her life\" It took having a child, for me to feel like I belong, that I'm normal. \"A post shared by Brooke Shields (@ brookeshields) on May 14, 2017 at 12:46 pm PDT On embracing imperfection as a parent\" I would have thought that I would have become one of those parents--just because it's my nature to be such a perfectionist--that anything falling short, I would have seen as a failure. But something has happened to me over the past few years--it's not Zen, believe me, I'm not at all Zen--but I'm so appreciative of even the chaos. It's not about being perfect; it's about being engaged. \"On work-life balance\" I had a moment where I realized I was spending all of my free time, which is so little, doing events and going to charities. I wasn't putting my kids to bed at all. When you're doing theatre it's almost impossible to put them to bed and it really threw me for a loop. I have to work so when I'm not working, it's easy to get caught up and say, oh, I'll do that charity or I'll do that thing for you. And your kids are with the babysitter and it's heartbreaking. \"On how having kids changed her attitude toward her career\" Being a mom puts the rejection of being an actress in perspective. \"Bruce Glikas via Getty Images On mom peers\" I get support from other moms and my therapist. It is only as important to connect with mom peers as it gives you comfort. If and when it gets competitive, it becomes toxic. \"On how parenthood shifts your priorities\" However, having my first daughter obliterated me. It took away all my power. All of a sudden I was experiencing something so foreign, which I had no response for. I had no resources to rely on. It was not simply about being the good girl, or being polite, or doing my job. A little human being was involved. \"On the joys of raising children\" What I love most is being able to wake up in the morning with these innocent and truthful little people. \"Suggest a correction Caroline Bologna Parents Editor, HuffPost MORE: U.S. News Arts And Entertainment Parenting Postpartum Depression Brooke Shields Close", "articleID": "2017060222_00225945_W", "names": {"Mark Avery": ["Q38023167", "Q59261371", "Q6766617"]}}, {"date": "2017-06-03", "url": "http://www2.tbo.com/ap/world/pop-star-ariana-grande-visits-fans-in-hospital-ap_world5bd32a40f584437ab20d67fdd22d7ebc", "content": "LONDON (AP)--Pop star Ariana Grande surprised young fans injured in the Manchester Arena attack, hugging the thrilled little girls in their hospital beds as they recovered from injuries sustained in the May 22 suicide bombing. The attack at Grande's concert last week killed 22 people and injured dozens of others, many of them teenagers. The singer returned to Britain on Friday ahead of a concert to benefit victims and their families. Grande shared an image of her visit to Royal Manchester Children's Hospital with her 107 million Instagram followers. The caption was simply a heart. Others touched by the visit posted pictures on social media, including a group shot with Grande among the nurses caring for the children hurt in the blast. <mark>Peter Mann</mark>, whose daughter Jaden was injured in the attack, posted several photos of Grande and the youngster on Facebook. \"So happy she came i could burst!,\" he wrote. \"Never seen jaden so happy! even cried again myself .\" Tasha Hough also shared photos of Jaden and Grande on social media. \"I think she's a little star struck. No1 deserves this more than her. That smile! And what a lovely girl Ariana Grande is .\" Grande will be joined by a number of pop stars for the One Love Manchester concert on Sunday, including Justin Bieber, Katy Perry, Coldplay, Take That and Miley Cyrus.", "articleID": "2017060311_00594066_W", "names": {"Peter Mann": ["Q55093391", "Q7175640"]}}, {"date": "2017-06-04", "url": "http://abc13.com/sports/mlb-best-astros-win-over-rangers/2064758/", "content": "SPORTS MLB-best Astros win 9th in a row with 6-5 win over Rangers Email share share tweet email AP Texas Rangers & #39; Andrew Cashner, left, talks with catcher Jonathan Lucroy and manager Jeff Banister, right, on the mound during a game against the Astros & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros & #39; Jose Altuve sits in the dugout in the first inning of a baseball game against the Texas Rangers on Saturday, June 3, 2017 & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Houston Astros first baseman Yuli Gurriel sits in the dugout during a baseball game against the Texas Rangers on Saturday, June 3, 2017, Texas. & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros & #39; Norichika Aoki of Japan heads to third during a baseball game against the Texas Rangers in the fourth inning & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Texas Rangers second baseman Rougned Odor fields a ground ball from the Houston Astros during a baseball game, & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros shortstop <mark>Carlos Correa</mark> fields a ground ball from the Texas Rangers during a baseball game, Saturday, June 3, 2017, in Arlington, Texas. & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Houston Astros & #39; Jose Altuve & #40; 27 & #41; gets a little help stopping from Texas Rangers second baseman Rougned Odor after sliding into second during game & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Sunday, June 04, 2017 05:36 AM A.J. Hinch isn't getting caught up in the streaks or all the impressive things the Houston Astros are doing this season. Their manager is just relishing each victory, and the Astros have 40 of them after winning their major league-best ninth in a row with a 6-5 victory over the Texas Rangers on Saturday night .\" It means we've put a lot of games together in a row successfully, \"Hinch said .\" We don't get caught up in first to 40, or leads. It's June and we're trying to win as many games as we can. \"<mark>Carlos Beltran</mark> had three hits and drove in three runs, Jose Altuve capped his three-hit game with a key homer leading off the ninth and the Astros (40-16), with best record in the majors and best start in franchise history, are already 14 games ahead of two-time defending division champion Texas .\" Everyone is having a good year, everyone is swinging the bat well so it's kind of rare to see that from top to the bottom, anyone could do damage, \"<mark>Beltran</mark> said .\" It's fun for us. For other people, I don't know how much fun it is. \"The Rangers are 3-10 since a 10-game winning streak last month that is still the longest in the majors this season - a mark the Astros have a chance to match in the series finale Sunday. Six Astros pitchers combined for 18 strikeouts, which came only nine days after Rangers hitters matched an MLB record for a nine-inning game with 20 strikeouts against five Boston pitchers. That included four strikeouts by second baseman Rougned Odor hitting fifth. His first three strikeouts came with runners in scoring position, and the last ended the game with a runner at first .\" Obviously he was a guy who was so good for us last year and obviously good for us in certain stretches this year, \"manager Jeff Banister said .\" Hitters go through certain stretches and this one is obviously challenging. \"<mark>Beltran</mark>'s seventh homer leading off the second tied the game at 1-all after the Rangers got a quick run off <mark>Lance McCullers</mark> in his first start since being named the AL pitcher of the month in May. The Astros went ahead to stay after six straight batters reached with one out in the third, and four of them scored. <mark>Carlos Correa</mark> had a tiebreaking RBI single before <mark>Beltran</mark>'s two-run single off Andrew Cashner (2-5).\" You can go through so many guys tonight that stepped up and made big pitches or had big at-bats, \"Hinch said. Chris Devenski (4-3) worked 1 2/3 scoreless innings after taking over for <mark>McCullers</mark> in the fifth. Ken Giles worked the ninth for his 15th save in 16 chances even while allowing an RBI single by Adrian Beltre. <mark>McCullers</mark> struck out eight but gave up six hits and four runs - three earned - in 4 1/3 innings. He was coming off a month of May when he was 4-0 with a 0.99 ERA when he allowed only four earned runs in 36 1/3 innings. MARRIED MAN Elvis Andrus, who got married Thursday when the Rangers had a day off, had three hits and drove in three runs. He had a two-run double in the fifth and scored on Beltre's one-out single that chased <mark>McCullers</mark>. CLOSING IN ON MILESTONES Beltre has 2,950 career hits, including eight in five games since his season debut this week after missing the first 51 games because of calf issues ....Astros LF Norichika Aoki got his 1,995 th career hit, his 711th in the majors to go with 1,284 he had in Japan. WELL, HELLO When third baseman Beltre fielded a grounder in the fifth, he tagged <mark>Beltran</mark> for the final out. The two, teammates with the Rangers at the end of last season, ended up in an awkward hug,\" He was trying to tag me. I had nowhere to go, so I just ended up giving him a hug for the great career that he's had in baseball, \"<mark>Beltran</mark> said. TRAINER'S ROOM Rangers: 1B Mike Napoli left in the fifth inning because of back spasms ....LHP Cole Hamels (right oblique strain) is scheduled to have his first bullpen session Sunday since sustaining a right oblique strain while warming up and being a last-second scratch before his scheduled start May 2 at Houston. UP NEXT Astros: Houston is going for its 10th consecutive road victory, which would match the team record set in 1989. Rangers: <mark>Martin Perez</mark> (2-5) starts as the Rangers try to avoid being swept in a series at home for the first time since losing three straight to Cleveland to start the season. Report a Typo Related Topics: sports Houston Astros Texas Rangers MLB Texas Email share share tweet email (Copyright © 2017 by The Associated Press. All Rights Reserved .) Load Comments Please enable JavaScript to view comments. SPORTS Freebies, deals and fun events this year at Astros' games Bear crashes round of golf in Alaska UH gears up for NCAA baseball regionals NBA handshakes steal the show before the game even begins More Sports Top Stories Dodging scattered downpours this weekend Police: 6 dead, 30 + injured in London attacks Trump argues for travel ban after attacks hit London Sand artists build awe-inspiring castles in Galveston Free Press attendees feel safe, even after London attack Convicted rapist on the run last seen in Houston Lightning puts damper on Free Press Summer Fest Show More PHOTOS: Aftermath of\" terror incidents' in London Detectives: Dealers peddled cocaine from pizza boxes Consider this new Houston bar like your own backyard 2 injured after suspect crashes into Humble home VP Pence coming to Houston next week More News Photos PHOTOS: Aftermath of \"terror incidents' in London PHOTOS: Celebrities who have been arrested PHOTOS: 21 children missing in Houston this year PHOTOS: Throwback Thursday pics of ABC13 talent More Photos", "articleID": "2017060410_00746174_W", "names": {"Carlos Beltran": ["Q1042743", "Q5041829"], "Carlos Correa": ["Q2754588", "Q57055498", "Q58499542", "Q82518", "Q9696967"]}}]