[{"date": "2017-06-04", "url": "http://abc13.com/sports/mlb-best-astros-win-over-rangers/2064758/", "content": "SPORTS MLB-best Astros win 9th in a row with 6-5 win over Rangers Email share share tweet email AP Texas Rangers & #39; Andrew Cashner, left, talks with catcher Jonathan Lucroy and manager Jeff Banister, right, on the mound during a game against the Astros & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros & #39; Jose Altuve sits in the dugout in the first inning of a baseball game against the Texas Rangers on Saturday, June 3, 2017 & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Houston Astros first baseman Yuli Gurriel sits in the dugout during a baseball game against the Texas Rangers on Saturday, June 3, 2017, Texas. & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros & #39; Norichika Aoki of Japan heads to third during a baseball game against the Texas Rangers in the fourth inning & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Texas Rangers second baseman Rougned Odor fields a ground ball from the Houston Astros during a baseball game, & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Houston Astros shortstop <mark>Carlos Correa</mark> fields a ground ball from the Texas Rangers during a baseball game, Saturday, June 3, 2017, in Arlington, Texas. & #40; AP Photo & #47; Tony Gutierrez & #41; (AP)\" > AP Houston Astros & #39; Jose Altuve & #40; 27 & #41; gets a little help stopping from Texas Rangers second baseman Rougned Odor after sliding into second during game & #40; AP Photo & #47; Tony Gutierrez & #41; (AP) \"> AP Sunday, June 04, 2017 05:36 AM A.J. Hinch isn't getting caught up in the streaks or all the impressive things the Houston Astros are doing this season. Their manager is just relishing each victory, and the Astros have 40 of them after winning their major league-best ninth in a row with a 6-5 victory over the Texas Rangers on Saturday night .\" It means we've put a lot of games together in a row successfully, \"Hinch said .\" We don't get caught up in first to 40, or leads. It's June and we're trying to win as many games as we can. \"<mark>Carlos Beltran</mark> had three hits and drove in three runs, Jose Altuve capped his three-hit game with a key homer leading off the ninth and the Astros (40-16), with best record in the majors and best start in franchise history, are already 14 games ahead of two-time defending division champion Texas .\" Everyone is having a good year, everyone is swinging the bat well so it's kind of rare to see that from top to the bottom, anyone could do damage, \"<mark>Beltran</mark> said .\" It's fun for us. For other people, I don't know how much fun it is. \"The Rangers are 3-10 since a 10-game winning streak last month that is still the longest in the majors this season - a mark the Astros have a chance to match in the series finale Sunday. Six Astros pitchers combined for 18 strikeouts, which came only nine days after Rangers hitters matched an MLB record for a nine-inning game with 20 strikeouts against five Boston pitchers. That included four strikeouts by second baseman Rougned Odor hitting fifth. His first three strikeouts came with runners in scoring position, and the last ended the game with a runner at first .\" Obviously he was a guy who was so good for us last year and obviously good for us in certain stretches this year, \"manager Jeff Banister said .\" Hitters go through certain stretches and this one is obviously challenging. \"<mark>Beltran</mark>'s seventh homer leading off the second tied the game at 1-all after the Rangers got a quick run off <mark>Lance McCullers</mark> in his first start since being named the AL pitcher of the month in May. The Astros went ahead to stay after six straight batters reached with one out in the third, and four of them scored. <mark>Carlos Correa</mark> had a tiebreaking RBI single before <mark>Beltran</mark>'s two-run single off Andrew Cashner (2-5).\" You can go through so many guys tonight that stepped up and made big pitches or had big at-bats, \"Hinch said. Chris Devenski (4-3) worked 1 2/3 scoreless innings after taking over for <mark>McCullers</mark> in the fifth. Ken Giles worked the ninth for his 15th save in 16 chances even while allowing an RBI single by Adrian Beltre. <mark>McCullers</mark> struck out eight but gave up six hits and four runs - three earned - in 4 1/3 innings. He was coming off a month of May when he was 4-0 with a 0.99 ERA when he allowed only four earned runs in 36 1/3 innings. MARRIED MAN Elvis Andrus, who got married Thursday when the Rangers had a day off, had three hits and drove in three runs. He had a two-run double in the fifth and scored on Beltre's one-out single that chased <mark>McCullers</mark>. CLOSING IN ON MILESTONES Beltre has 2,950 career hits, including eight in five games since his season debut this week after missing the first 51 games because of calf issues ....Astros LF Norichika Aoki got his 1,995 th career hit, his 711th in the majors to go with 1,284 he had in Japan. WELL, HELLO When third baseman Beltre fielded a grounder in the fifth, he tagged <mark>Beltran</mark> for the final out. The two, teammates with the Rangers at the end of last season, ended up in an awkward hug,\" He was trying to tag me. I had nowhere to go, so I just ended up giving him a hug for the great career that he's had in baseball, \"<mark>Beltran</mark> said. TRAINER'S ROOM Rangers: 1B Mike Napoli left in the fifth inning because of back spasms ....LHP Cole Hamels (right oblique strain) is scheduled to have his first bullpen session Sunday since sustaining a right oblique strain while warming up and being a last-second scratch before his scheduled start May 2 at Houston. UP NEXT Astros: Houston is going for its 10th consecutive road victory, which would match the team record set in 1989. Rangers: <mark>Martin Perez</mark> (2-5) starts as the Rangers try to avoid being swept in a series at home for the first time since losing three straight to Cleveland to start the season. Report a Typo Related Topics: sports Houston Astros Texas Rangers MLB Texas Email share share tweet email (Copyright © 2017 by The Associated Press. All Rights Reserved .) Load Comments Please enable JavaScript to view comments. SPORTS Freebies, deals and fun events this year at Astros' games Bear crashes round of golf in Alaska UH gears up for NCAA baseball regionals NBA handshakes steal the show before the game even begins More Sports Top Stories Dodging scattered downpours this weekend Police: 6 dead, 30 + injured in London attacks Trump argues for travel ban after attacks hit London Sand artists build awe-inspiring castles in Galveston Free Press attendees feel safe, even after London attack Convicted rapist on the run last seen in Houston Lightning puts damper on Free Press Summer Fest Show More PHOTOS: Aftermath of\" terror incidents' in London Detectives: Dealers peddled cocaine from pizza boxes Consider this new Houston bar like your own backyard 2 injured after suspect crashes into Humble home VP Pence coming to Houston next week More News Photos PHOTOS: Aftermath of \"terror incidents' in London PHOTOS: Celebrities who have been arrested PHOTOS: 21 children missing in Houston this year PHOTOS: Throwback Thursday pics of ABC13 talent More Photos", "articleID": "2017060410_00746174_W", "names": {"Lance Mccullers": ["Q6483471", "Q6483473"], "Martin Perez": ["Q3078130", "Q3850348"]}}, {"date": "2017-06-05", "url": "http://www.businessinsider.in/Year-round-school-is-booming-but-its-benefits-are-over-hyped/articleshow/59005566.cms#commentHash", "content": "Year-round school is booming - but its benefits are over-hyped <mark>Chris Weller</mark> Jun 5, 2017, 10.26 PM Facebook Linkedin WhatsApp Twitter Google + Reddit Continue reading Anyone who's spent at least two years in school knows how quickly the mental cobwebs can pile up over the summer. In June you're a test-ready warrior. By September, you might feel like a foggy-headed dunce. Sociologists refer to this decline as the summer setback, and it's widely cited as one of the most corrosive factors in the achievement gap between low - and high-income students. While low-income kids play games and watch cartoons in the summer, high-income kids go to camp, visit museums, and continue learning. Over time, those incremental advantages can spell the difference between who gets placed into elite colleges and high-paying jobs and who drops out. Some parents and schools have tried to help kids overcome the summer setback with enrichment classes. But others have taken a more radical approach, calling instead for a complete overhaul of the school calendar so that kids attend school year-round. Between 1985 and 2011, the number of US schools with year-round learning increased ninefold, bringing the current total to just shy of 4,000. According to recent research, however, the trend might be misguided. Year-round school doesn't help with the effects of inequality or erase the summer setback all kids tend to experience. In the worst cases, it actually hurts kids' education. What people get wrong about year-round school The biggest misconception with year-round school is that kids spend more time in the classroom. Parents hear \"no summer break\" and immediately think kids are getting an extra three months of school. That's not necessarily true. In most cases, kids who attend year-round schools learn for six weeks at a time before taking three-week breaks. Their \"summer break\" lasts only a month. They still learn for 180 days, just like traditional schools. Paul von Hippel, an expert on educational inequality at the University of Texas at Austin, argues that kids in schools using either calendar models - whether they're from low-income, middle-income, or high-income families - end up performing roughly the same on standardized tests. There's no added drawback to summer vacation that year-round school protects kids from, he tells Business Insider. A three-week break might be shorter than a three-month break, but compared to how long kids are in school before the break, the setbacks add up equally. \"It is a bit like the race between tortoise and hare,\" von Hippel wrote in a recent review of the research on year-round school, \"except that, in this case, the race ends in a tie .\" Still, people like to blame summer vacation because they see kids spending a huge chunk of time away from a classroom and think that's doing the most damage. Often, the real culprit is economic in nature. \"The differences you see between upper-middle class families and poor families aren't differences that go away if you rearrange the school calendar,\" von Hippel says. \"The summer provides a window into what those differences are like, but those differences exist every weekend. Whenever children are out of school, their environments are less equal .\" Richard Kahlenberg, senior fellow at The Century Foundation, agrees that rearranging the time isn't nearly as important as making smarter use of it. \"It doesn't get at that issue of making sure that low-income students, when they're not in school, have lots of opportunities for enrichment,\" he tells Business Insider. Too many kids, too little time Perceived increases in achievement aren't the only reason a school district might push to switch. One of the few benefits of a year-round system is that it relieves the burdens of overcrowding. In Wake County, North Carolina, for example, attendance rose by nearly two-thirds between 1995 and 2007. As a result, 37 of the county's 177 schools now rely on a \"multi-track\" model in which students are split into four groups. Each group is staggered so while one group is on break, the others are in session, and the building doesn't sit empty for three months. \"It really is true that the traditional calendar is somewhat inefficient,\" von Hippel says. Multi-track schools might have to pay more during the summer to keep the lights and A/C on, but that's much cheaper than building a brand-new school. In any case, the benefit that gets passed on to students is still marginal. The lessons from Wake County don't translate to schools where overcrowding isn't an issue. And research shows the switch can frustrate parents who have kids in schools using both schedules. Year-round school can even cause property values to decline if families and teachers relocate to keep their summers. As von Hippel writes, \"Although surveys can be informative, behaviors show teachers and parents voting with their feet. Actions speak louder than words .\" How to solve the right problems If there's any hope for year-round school it's that multiple three-week breaks might give teachers an easier time to teach additional classes than a full summer, when kids have fully checked out. Neither Kahlenberg nor von Hippel could say for sure, however, because there isn't any research on it. What the research does suggest is schools should do whatever they can to close the gaps created by poverty. They can hold field trips to museums, aquariums, and national parks during the summer so kids don't equate enrichment with summer school. And during the year they can focus more on personalized learning, which some schools have used to great success. If governments want to stop the achievement gap from widening (or close it altogether), they can offer greater access to pre-K. Or, if they want to go by the latest research, they could just give poor families more money, which may raise achievement even more than early education. Whatever the solution, implying that the three-month period between June and September is what leads some to Harvard and others to hard times ignores a much bigger problem. Schools need level playing fields, not cleverly designed calendars. Please enable Javascript to watch this video Facebook Linkedin WhatsApp Twitter Google + Reddit Follow Business Insider on facebook Like twitter Follow gplus Follow Next Story LIVE: Apple's biggest conference of the year is here - get ready for new products More from this author Hong Kong's 20-square-foot \"coffin homes' reveal t.. . IBM launched a high school to churn out workers fo...Japan's demographic time bomb is a bad omen for th...Japanese family life is falling apart - and the re...Mark Zuckerberg says basic income is worth explori...Related Stories Shree Sai Spaces Creations and Wasankar Wealth man...Four points about higher education in India Here's where <mark>Donald Trump</mark> stands on education 4 ways Finland beats America on education Online Education: Young Guns Will Propel Market Ex...\"src =\" http: //www.businessinsider.in/photo/17981456.cms \"> Beginning of a revolution in Education through Cou...How to create world-class higher education centres...Here are the options for bettering higher educatio...More: SAI Education Promoted Stories A Solution That Puts Snoring to Bed My Snoring Solution Cable Companies Furious Over This New Device (Selling Out. . TV Frog End Your Nightly Snoring Nightmare With This Simple Solution My Snoring Solution Now You Can Track Your Car Using Your Smartphone Smart Device Trends If you own a computer you must try this game! Throne: Free Online Game The Ultimate Way to Get Cheap Hotel Rooms tripsinsider.com", "articleID": "2017060517_00206227_W", "names": {"Chris Weller": ["Q5108443", "Q54932125"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-06-08", "url": "http://www.courierpostonline.com/story/entertainment/2017/06/08/collingswoods-matt-cappy-finds-his-own-groove/377609001/", "content": "Buy Photo \"He always stood out,\" says Matt Cappy's fourth grade band director Bill Garton. Cappy of Collingswood plays his trumpet as he poses for a portrait inside the Gradwell House recording studio in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Matt Cappy's Haddon Heights rehearsal room could barely contain the soulful grooves and jazz jams pumped out by the sound system. The Collingswood trumpet player pushed the volume a tick higher with every track playing on his first album due to release this month. More: Free concerts in park feature heavy-hitters More: Gary Puckett & The Union Gap to play Pennsauken More: Big concerts set for South Jersey Lit by a single bulb in a lamp made from an old trumpet, Cappy, 43, swayed, bobbing his head to the thick bass lines, not noticing his fingers played along with his trumpet solos on the track. The Berlin Township native began playing professionally nearly two decades ago, backing super stars like <mark>Jill Scott</mark> and Jay-Z. Now it's Cappy's turn out front. His first album, \"Church and State,\" releases June 16, days before he heads out on a summer tour playing with <mark>Jill Scott</mark>. \"I want people's heads moving, not just sitting there watching me playing 1,000 notes,\" Cappy said. Buy Photo Matt Cappy's trumpet waits for his return inside his rehearsal space at Gradwell House Recording in Haddon Heights. Cappy's first album, \"Church and State,\" releases June 16, days before he heads out on a summer tour playing with <mark>Jill Scott</mark>. (Photo: Joe Lamberti/Staff Photographer) In The Gradwell House rehearsal space--a small, gray-painted room with a lamp, keyboard and not-yet assembled drum kit--his music blared. His lips moved, mouthing his parts of the melody. The record--much like this career--\"is about the groove,\" he said. \"I put a lot of years into this record,\" Cappy explained. The album's final track--titled \"The Last One\" --was the first song he wrote. That was a decade ago, he noted, yelling over the song as it played. His professional career began a decade before that, he said. \"We have great musicians in this area. The cover band scene is amazing. And the average wedding band is really good. But to punch through and have a national artist. We haven't done that yet .\" Buy Photo Albums upon which Matt Cappy has played trumpet line the walls of his rehearsal space at Gradwell House Recording in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) Hooking up with <mark>Scott</mark> in the late 1990s through Philly's jazz clubs and hip-hop funk scene catapulted his career. <mark>Scott</mark> affectionately nicknamed her band Fatback Taffy, Cappy said. A year after he played on <mark>Scott</mark>'s first album \"Who is <mark>Jill Scott</mark>?,\" she and Fatback Taffy were playing Wells Fargo Center-sized sports arenas. In 2002, he was part of her live album that went gold. \"I owe everything to <mark>Jill Scott</mark>,\" he said. \"I was with her literally for 10 years straight .\" Their first summer show together is June 23 in Virginia. Since, he's played on <mark>Michael Jackson</mark>'s double platinum-selling \"Butterfly\" record, and on recordings for other platinum-selling artists, like Musiq Soulchild. Cappy--GRAMMY's Philadelphia chapter board governor since 2003--has performed with The Roots, Mos Def, Common, Aretha Franklin, The O-Jays, The Moody Blues and <mark>Tony Bennett</mark>, and recorded with Earth, Wind and Fire, <mark>Marvin Sapp</mark>, and <mark>Faith Evans</mark>. And that's the short list. Buy Photo Matt Cappy of Collingswood plays his trumpet inside the Gradwell House recording studio in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) In February, DJ Jazzy Jeff invited Cappy and tons of other highly-regarded musicians and artists to his Delaware studio to record \"Chasing Goosebumps,\" an album curated from top to bottom in seven days. Cappy plays on a half-dozen tracks, recording at Jeff's studio through the night to meet the deadline. Cappy's album's title track \"Church and State\" was recorded at the same studio. Through marathon globe treks and arena performances, Cappy still remembers his first performances--with Dwight D. Eisenhower Middle School's band in Berlin. \"The percentage of kids in band in this blue-collar town,\" he remembered. \"I would go to my sister's concerts, and the whole town showed up for the band. I was hooked. I wanted to be in it as soon as I could .\" He knew early--about fourth grade--the jazz band is where he belonged. \"He always stood out,\" his fourth grade band director Bill Garton told the Courier-Post \"He had fire in his eyes. He just wanted to be great from fourth grade on .\" Buy Photo Matt Cappy of Collingswood plays his trumpet inside his rehearsal space at Gradwell House Recording in Haddon Heights. (Photo: Joe Lamberti/Staff Photographer) Cappy played under Garton's direction in middle schools, then again at Overbrook High School. Cappy--a former member of Berlin-based South Jersey String Band--also learned saxophone. Garton, a retired professor at University of the Arts, oversaw Cappy's student-teaching rotation at Berlin Borough schools. Cappy continues to give lessons to South Jersey student musicians. Garton will be in the audience Thursday at 2300 Arena in South Philadelphia for Cappy's album release concert. \"He's never forgotten his roots,\" Garton said. \"As a teacher, you really do appreciate that. You start the kids off with everything you got, then you wait and see .\" Cappy's Camden County roots get a nod on the record. The track \"Rose Lane,\" an Afro-beat-style song already played on London radio stations, is a nod to the Berlin Township street where he grew up--North Rose Lane, he said. \"Eight Five Six\" --a reference to South Jersey's area code--shows how his jazz playing has matured since Eisenhower and Overbrook. \"Sacramento,\" written in California, is a shout out to Overbrook High School, when teenage Cappy jammed to Power 99 and Stevie Wonder. Like the song, Overbrook is \"soulful, and a mix of all people,\" he explained. \"I've been in the music business this long. I've been part of big ships. I'm thinking of myself like a start-up business,\" he said. \"It's really exciting, and it's a little scary ....But what I learned from the <mark>Jill Scott</mark> model--you need to make great music and back it up live .\" How to listen: Find Matt Cappy's debut album \"Church and State\" on iTunes and Amazon.com starting June 16. For more on the musician visit www.mattcappy.com Carly Q. Romalino; (856) 486-2476; cromalino @ gannettnj.com Facebook Twitter Google + LinkedIn GALLERY: Local trumpeter Matt Cappy Fullscreen Post to Facebook Posted! A link has been posted to your Facebook feed. Buy Photo Matt Cappy of Collingswood plays his trumpet inside his rehearsal space at Gradwell House Recording in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Buy Photo Matt Cappy's trumpet waits for his return inside his rehearsal space at Gradwell House Recording in Haddon Heights. Cappy's first album, \"Church and State,\" releases June 16, days before he heads out on a summer tour playing with <mark>Jill Scott</mark>. Joe Lamberti/Staff Photographer Fullscreen Buy Photo Matt Cappy of Collingswood plays his trumpet inside the Gradwell House recording studio in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Buy Photo Albums upon which Matt Cappy has played trumpet line the walls of his rehearsal space at Gradwell House Recording in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Buy Photo \"He always stood out,\" says Matt Cappy's fourth grade band director Bill Garton. Cappy of Collingswood plays his trumpet as he poses for a portrait inside the Gradwell House recording studio in Haddon Heights. Joe Lamberti/Staff Photographer Fullscreen Like this topic? You may also like these photo galleries: Replay 1 of 5 2 of 5 3 of 5 4 of 5 5 of 5 Autoplay Show Thumbnails Show Captions Last Slide Next Slide CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http: //www.courierpostonline.com/story/entertainment/2017/06/08/collingswoods-matt-cappy-finds-his-own-groove/377609001/", "articleID": "2017060818_01071598_W", "names": {"Faith Evans": ["Q236318", "Q5431183"], "Jill Scott": ["Q10896", "Q232592", "Q23661775"], "Marvin Sapp": ["Q4008540", "Q6778477"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Tony Bennett": ["Q19946119", "Q23048751", "Q296729", "Q3993198", "Q4772102", "Q7821881", "Q7821882", "Q7821883"]}}, {"date": "2017-06-09", "url": "http://web.tampabay.com/sports/football/bucs/why-bucs-receiver-mike-evans-is-feeling-older/2326809", "content": "TAMPA--Last week, while explaining a play against the Seattle Seahawks last year, Bucs receiver <mark>Mike Evans</mark> dropped a throwaway line about Seahawks cornerback <mark>Richard Sherman</mark>. Related News/Archive Bucs want to make <mark>Mike Evans</mark> \"Buc for life' 2 Months Ago The next step Bucs' <mark>Mike Evans</mark> knows he needs to take 1 Month Ago Bucs grab safety <mark>Justin Evans</mark> in second round, receiver Chris Godwin in third 1 Month Ago\" Even though we're close in age, he's had a few more years than me in the league. \"They're not that close in age. <mark>Sherman</mark> is 29 years old; <mark>Evans</mark> is just 23. When the Buccaneers selected <mark>Evans</mark> in 2014, he was among the youngest players in the league. Last season, the former Texas A & M receiver was still younger than many 2016 rookies. But <mark>Evans</mark> is feeling like a veteran, and it isn't simply his three years of leading the Bucss in receiving yards and touchdowns (he's 1,440 yards and seven touchdowns from the team record in both categories). It's his status within the team. With the departure of <mark>Vincent Jackson</mark> this offseason, <mark>Evans</mark> has become a relative veteran compared to rookie and third year receivers Chris Godwin and Adam Humphries or the similarly young tight end group. While DeSean Jackson adds experience from his nine seasons combined in Philadelphia and Washington, <mark>Evans</mark> said he's always felt like a leader .\" I was a leader since I've been here, \"<mark>Evans</mark> said .\" First along with [<mark>Vincent Jackson</mark>], and then when he went down this year I was able to lead the guys and that's carried over without him. They're older than me, but I've got a lot of experience. We've got a lot of capable guys and it's been fun. \"That leadership starts with the fact that he's even at One Buc Place during voluntary OTAs. Every team hopes for full attendance, but a star player approaching the end of their rookie contract might just be the type to wait it out. Yet there was <mark>Evans</mark>, making a trademark high-point catch from a Jameis Winston catch for a touchdown Thursday and throwing down a powerful dunk over the goal posts to celebrate. <mark>Evans</mark> said he values the importance of organized team activities (OTAs) at his position too much to miss .\" Receivers and quarterbacks can get a lot more out of OTAs than other positions, \"<mark>Evans</mark> said .\" They can't use their pads, but we can run routes and get the timing right, which is really important. \"It wasn't simply other receivers watching <mark>Evans</mark> Thursday in practice. Orlando-born boxer Erickson Lubin--formerly the world's No. 1-ranked junior middleweight before turning professional last year--was in attendance, too. <mark>Evans</mark>, a boxing fan and a fan of Lubin in particular, said he specifically wanted to meet the 21-year-old fighter, while Lubin said he was a fan of <mark>Evans</mark> both on and off the field .\" I love his personality, \"Lubin said .\" He has a great personality. He's a welcoming person. And he's a fighter, just like I am. He goes out and gives his all every game. He told me that he's a big fan of me, and I'm a big fan of him. \"Within a season's reach of the franchise's key receiving records and with a major contract likely on the way, perhaps <mark>Evans</mark> could be forgiven for focusing on his own stats. But with Jameis Winston possessing a greater array of weapons in 2017 than ever before, <mark>Evans</mark>' goals for the year are team-focused .\" If I catch zero passes but we win the Super Bowl, I wouldn't have a problem. \"", "articleID": "2017060922_00548935_W", "names": {"Justin Evans": ["Q15975248", "Q30122523", "Q6317576"]}}]