[{"date": "2017-06-15", "url": "http://www.ipswichadvertiser.com.au/news/tv-host-embraces-fire-survivor-he-breaks-down/3189856/", "content": "Mother posts video from burning tower 12 dead in London tower fire Girl photobombs live TV Former Top Gear hosts have a new name <mark>Samuel Johnson</mark> Foxtel launches Netflix rival MKR contestants JP & N elly BBC host almost eats his own flesh A BBC TV host has embraced London fire survivor Mahad Egal as he broke down describing \"horrific\" scenes of people jumping and throwing babies from the blaze. Mr Egal, a resident of the Grenfell Tower where 12 people died in the overnight blaze on Wednesday, put his head in his hands and wept as he recalled the dramatic scenes of the tragedy. Clad in a blue tracksuit and standing on the street, Mr Egal was speaking on camera to BBC host Victoria Derbyshire who was forced to cut the interview and embrace Mr Egal as he struggled to speak. BBC host Victoria Derbyshire embraces London fire survivor Mahad Egal as he breaks down describing \"horrific scenes' of the Grenfell Tower blaze. Picture: BBC\" This was really horrific. There's people who were jumping out. There's a man who threw two of his children, \"Mr Egal said before he became choked up with emotion. Ms Derbyshire pulled Mr Egal to her in a comforting embrace for several seconds, before separating from him but keeping her hand on his shoulder, shaking her head and saying,\" Wow \". With his eyes still downcast, Mr Egal then said,\" We saw a lot, we saw a lot. We saw a lot with our own eyes, we saw...\"He broke down again and held both his hands up to his face as if to block out the horror. 12 dead in London tower fire: London's Fire Commissioner describes fire as\" completely unprecedented \". Derbyshire again tried to comfort him with her hand on his shoulder and said,\" it's alright, you don't have to say anymore \". Other Grenfell residents have described terrifying scenes of their narrow escape from the blaze. Hanan Wahabi fled the building with her husband and their 16-year-old son and daughter, eight. However she last spoke with her brother, who lives on level 21, at 2am on Wednesday .\" I told him to leave. He said he was going to come. Then I called him and he said there was too much smoke. \"I've not heard from them since .\" Related Items MP queries safety of Australian buildings after London fire Mum trapped in London fire posts harrowing videos London fire: \"Nobody on top three floors survived' Grenfell Tower fire: Why was cladding added? London horror: 12 confirmed dead but toll likely to rise London inferno:\" The baby just fell straight down' London Fire: \"They can't say they haven't been warned' Show More 0 bbc Read More Login to follow deaths Read More Login to follow editors picks Read More Login to follow grenfell tower Read More Login to follow london fire Read More Login to follow media Read More Login to follow Topics: bbc deaths editors picks grenfell tower london fire media Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now", "articleID": "2017061500_00806727_W", "names": {"Samuel Johnson": ["Q1251433", "Q1255535", "Q27824338", "Q4119435", "Q44872191", "Q57777407", "Q7411862", "Q7413148"]}}, {"date": "2017-06-17", "url": "http://www.arkansasonline.com/news/2017/jun/17/how-about-showing-dj-little-respect-201/", "content": "How about showing DJ little respect? a A Font Size PHOTO BY AP/CHRIS CARLSON Defending U.S. Open champion <mark>Dustin Johnson</mark>, the world's No. 1 player, won't repeat after missing the cut by three shots at Erin Hills on Friday. <mark>Johnson</mark> played the tournament's first eight holes in 3 over in the opening round and never recovered. As <mark>Dustin Johnson</mark> approached his ball buried in the tall grass on the 17th hole at Erin Hills, a fan standing just a few feet away offered a little pick-me-up to the world's No. 1 player. \"You got a nice bounce off my arm, Justin,\" the fan said proudly as he patted his right arm. Justin? It was that sort of day for <mark>Johnson</mark>, who either didn't notice the misspeak or didn't care, because by that point the first round in defense of his 2016 U.S. Open title was already headed the wrong direction. Starting on the back nine, he double-bogeyed 14, bogeyed 15 and was on his way to wasting a birdie at 16 with the errant drive on 17 that would lead to yet another bogey. Three over in four holes isn't a blueprint for disaster for the average golfer--like, for example, the guy in the gallery who just called the best player in the world by the wrong name--but it's a death knell at this U.S. Open. Just a few holes ahead, Rickie Fowler had four birdies on his front nine, another three on the back side for a 7-under 65. Even though <mark>Johnson</mark> played even-par golf the rest of the way to finish with a 3-over 75, it still left him 10 strokes back after the first round. \"Where I went wrong is when I laid it up in the hay,\" <mark>Johnson</mark> said matter-of-factly after his round, referring to his brutal 14th. \"Got it on the green and three-putted for double. A great hole I played there .\" And just like that, the prohibitive favorite coming in was already on the ropes. By the time <mark>Johnson</mark> walked off the green on his final hole, 44 players were under par. He did better Friday, but not good enough, despite getting to the 1-over cut line after a birdie on 12. Bogeys on 13, 14 and 17 knocked him out of the tournament. He finished with a 1-over 73, a two-round total of 4-over 148. The race is on Olympic legend Michael Phelps is probably the greatest that's ever been in the water. Well, for a human. According to a news release from Discovery Channel, Phelps will race a great white shark as part of Shark Week on July 23. \"They are one of the fastest and most efficient predators on the planet: Sharks,\" the release said. \"He is our greatest champion to ever get in the water: Michael Phelps. 39 world records. 23 Olympic golds. But he has one competition left to win. An event so monumental no one has ever attempted it before. The world's most decorated athlete takes on the ocean's most efficient predator: Phelps V Shark--the race is on!\" Phelps is going to have his hands full. According to Jennifer Kennedy of ThoughtCo.com, sharks cruise at around 5 mph, but great whites can reach north of 25 mph if they're in attack-mode. \"Their swimming speed is 10 times faster than the typical human swimmer,\" Kennedy wrote. Phelps was clocked at 6 mph by ESPN.com at the height of his overwhelming success in 2010. The distance and the shark's state of mind will certainly play a role in the race. Phelps, 31, went cage diving with some great whites last weekend, perhaps scouting out his competition: Phelps will also take part in another Shark Week project, Shark School, which will \"dispel the myths and common misconceptions\" about the beasts. That puts Phelps on the first and last days of Shark Week. Sports on 06/17/2017", "articleID": "2017061707_00294928_W", "names": {"Dustin Johnson": ["Q1002293", "Q30015838"]}}, {"date": "2017-06-17", "url": "https://sports.yahoo.com/starter-hahn-looking-forward-facing-yankees-071819377--mlb.html?src=rss", "content": "OAKLAND, Calif.--Oakland Athletics right-hander Jesse Hahn is no stranger to the mystique and history of the New York Yankees. He grew up in Connecticut, watching countless Yankees games on television, even though much of his family was from Pittsburgh and he was a Pirates fan. But it was while Hahn attended Virginia Tech that he became a true fan of the Yankees. \"When I was in college at Virginia Tech after the massacre we had there in 2007, they came and played a memorial game for us and donated money to the school,\" Hahn said Friday. \"I've always had much respect for those guys. It's cool just to be pitching against the New York Yankees .\" On April 16, 2007, a student at Virginia Tech shot and killed 32 people at the university before killing himself. Hahn will make his third career start against the Yankees on Saturday afternoon in the third of a four-game series at the Oakland Coliseum when the A's will try to make it three straight wins against New York. Oakland won the series-opener 8-7 in 10 innings on Thursday night and beat the Yankees 7-6 on Friday night, handing them their season-high fourth straight loss. \"It's part of the game, every team's going to go through it,\" Yankees manager Joe Girardi said of the skid. \"I'm pleased with the way we keep fighting back and that will bode well during the course of the season. Right now, our bullpen's been in a little bit of disarray. We'll get that straightened out .\" Hahn is 0-2 with a 5.40 ERA in two starts against the Yankees, both at the Coliseum. \"This is a complete different lineup over here, a very strong one,\" Hahn said of the Yankees. \"I believe they're one of the best in baseball. So I've got to go out there and pitch my game and have confidence out there tomorrow .\" Rookie right fielder Aaron Judge went 2-for-3 with his major league-leading 23rd home run, a three-run shot, on Friday, and first baseman <mark>Chris Carter</mark> had a solo home run for New York. The Yankees had plenty of offense, despite having four regulars out of the lineup. Catcher Gary Sanchez (strained groin) and center fielder Aaron Hicks (strained Achilles tendon) were out with injuries and remained day-to-day. Left fielder Brett Gardner and shortstop Didi Gregorius had scheduled days off, although Gardner pinch hit in the ninth. <mark>Mason Williams</mark>, who was called up from Triple-A Scranton/Wilkes-Barre and started in center, had a hit and scored a run. Hahn will make his third start since a stint on the disabled list with a strained right triceps. He's 1-0 with a 2.45 ERA in his past two starts and 2-4 with a 3.56 ERA for the season. On June 6, Hahn allowed one run on seven hits in a 4-1 victory against Toronto at the Coliseum. Then on Sunday on the road against Tampa Bay, Hahn had a no-decision in a 5-4 loss. Hahn gave up three runs--all in the fifth inning--on seven hits. \"I thought the last one went well,\" Hahn said. \"I just had that one inning where they strung together a couple good hits. I'm not going to say I was hit hard, because I don't think I was by any means. But they had a good approach on me that inning and were able to get some timely doubles, timely hitting. I gave up three and was able to get out of it after that .\" Hahn has allowed one home run in 60 2/3 innings and will face a Yankees team that has hit 108 homers, the most in the major leagues Yankees right-hander <mark>Masahiro Tanaka</mark> (5-6, 6.55 ERA) will make his 14th start of the season. In his last start, he gave up one run on two hits over seven innings with eight strikeouts and two walks in a 16-3 victory against Baltimore. <mark>Tanaka</mark> had a no-decision in his only career start against the A's, a 7-3 loss on April 21, 2016. He allowed two runs on seven hits over six innings, struck out four and walked none.", "articleID": "2017061707_00619514_W", "names": {"Chris Carter": ["Q1017050", "Q1077082", "Q1077084", "Q15953386", "Q27120913", "Q2964680", "Q355398", "Q437267", "Q5106106", "Q5106107", "Q5106108", "Q5106109", "Q5106110", "Q5106111", "Q55208181", "Q58062201", "Q9190902"], "Masahiro Tanaka": ["Q11575599", "Q11575656", "Q911463"], "Mason Williams": ["Q339892", "Q6783644"]}}, {"date": "2017-06-19", "url": "http://www.nasdaq.com/article/rptwith-whole-foods-amazon-on-collision-course-with-walmart-20170619-00330", "content": "RPT-With Whole Foods, Amazon on collision course with Wal-Mart June 19, 2017, 07:01:00 AM EDT By Reuters Reuters (Repeats without change) By Nandita Bose and Jeffrey DastinCHICAGO/SAN FRANCISCO, June 19 (Reuters) - When Wal-Mart Stores Inc <WMT. N> bought online retailer Jet.com for $3 billion last year, it marked a crucial moment - the world's largest brick-and-mortar retailer, after years of ceding e-commerce leadership to arch rival Amazon, intended to compete. On Friday, Amazon.com Inc <AMZN. O> countered. With its $14 billion purchase of grocery chain Whole Foods Market Inc <WFM. N>, the largest e-commerce company announced its intention to take on Wal-Mart in the brick-and-mortar world. [nL3N1JD3Z4] The two deals make it clear that the lines that divided traditional retail from e-commerce are disappearing and sector dominance will no longer be bound by e-commerce or brick-and-mortar, but by who is better at both. Amazon's purchase of Whole Foods also brings disruption to the $700 billion U.S. grocery sector, a traditional area of retailing that stands on the precipice of a ferocious price war. German discounters Aldi and Lidl are battling Wal-Mart, which controls 22 percent of the U.S. grocery market, with each vowing to undercut whatever price the others offer. The stakes are highest for Wal-Mart. Amazon's move aims at the heart of the Bentonville, Arkansas-based retail giant's business - groceries, which account for 56 percent of Wal-Mart's $486 billion in revenue for the year ending Jan. 31. With the deal, Whole Foods' more than 460 stores become a test bed with which Amazon can learn how to compete with Wal-Mart's 4,700 stores with a large grocery offering that are also within 10 miles (16 km) of 90 percent of the U.S. population. Amazon is expected to lower Whole Foods' notoriously high prices, enabling it to pursue Wal-Mart's customers. The push comes as Wal-Mart is headed in the opposite direction - going after Amazon's higher-income shoppers with a recent string of acquisitions of online brands such as Moosejaw and Modcloth and on Friday, menswear e-tailer Bonobos. Wal-Mart may be ready. In preparation for the grocery price war, Wal-Mart in recent months has cut grocery prices, improved fresh food and meat offerings, modernized shelving and lighting in its grocery aisles, and expanded its online grocery pickup service. [nL2N1GC03L] [nL1N1ID07D] [nL2N1IJ0D3] Marc Lore, the Jet.com founder who now runs Wal-Mart's e-commerce business after selling a startup to Amazon, told Reuters in an interview that Amazon's move does not change Wal-Mart's game plan. \"We're playing offense,\" he said. Wal-Mart is offering curbside pickup of online grocery purchases at 700 locations, with 300 more planned by year end. It also is testing same-day fresh and frozen home delivery from 10 of its stores. \"We see an opportunity to do a lot more of that,\" Lore said. <mark>Roger Davidson</mark>, who oversaw Wal-Mart's global food procurement and now is president of Oakton Advisory Group, said the deal will reduce Wal-Mart's brick-and-mortar advantage. \"I think this acquisition is a concern,\" he said. Some industry observers say Amazon will find it difficult to use Whole Foods to pull away Wal-Mart shoppers because the two stores appeal to different customers. But Michelle Grant, head of retailing at market research firm Euromonitor, said Amazon could use an obscure part of the Whole Foods portfolio - Whole Foods 365 - to lure Wal-Mart shoppers. Whole Foods 365 offers private-label goods and lower prices than typical Whole Foods stores, and is targeted at younger, value-conscious shoppers. Amazon could provide the financial capital and tactical ability to build that into something big. \"That (Whole Foods 365) may become a big problem for Wal-Mart,\" Grant said. Amazon, which reported $12.5 billion in cash and equivalents and a free cash flow of $10.2 billion in the year ended March 31, has plenty to spend. Wal-Mart reported $6.9 billion in cash and equivalents and $20.9 billion in free cash flow at its year ended Jan. 31. Brittain Ladd, a former senior manager at Amazon who worked on its brick-and-mortar strategy, said Amazon will use Whole Foods to test concepts for the grocery store of the future. Ladd, who left Amazon in March, said Amazon will seek to eliminate checkout lines by using technology that automatically scans goods as customers add them to their shopping carts. It will select merchandise based on Amazon's vaunted customer data, and potentially expects the use of technology to change prices during the course of a day. Amazon declined comment on competition with Walmart but spokesman Drew Herdener said in a statement the company has no plans to cut jobs or use technology in development at its Seattle Amazon Go store to automate jobs of cashiers. Ladd, who helped with AmazonFresh's global expansion and now is a supply chain consultant, said an Amazon-owned Whole Foods also likely will offer in-car pickup of online purchases, and home delivery from Whole Foods stores, add pharmacies and showcase Amazon devices inside the stores. \"Amazon will reduce prices and change the assortment of products carried in Whole Foods stores to attract a larger customer base,\" said Ladd. \"Kroger and Wal-Mart will be impacted as their customers will defect to Amazon .\" <^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ TAKE A LOOK-Amazon to acquire Whole Foods in $13.7 bln deal [nL1N1JD16Q] ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^> (Additional reporting by Richa Naidu in Chicago; Editing by David Greising, <mark>Peter Henderson</mark> and Bill Trott) ((nandita.bose @ thomsonreuters.com) (+13124088726) (Reuters Messaging: nandita.bose.reuters.com @ reuters.net)) Keywords: WHOLE FOODS M & A / AMAZON.COM WALMART (REPEAT) Interactive Charts Default Setting Please note that once you make your selection, it will apply to all future visits to NASDAQ.com. If, at any time, you are interested in reverting to our default settings, please select Default Setting above. If you have any questions or encounter any issues in changing your default settings, please email isfeedback @ nasdaq.com. CLOSE X Please confirm your selection: You have selected to change your default setting for the Quote Search. This will now be your default target page; unless you change your configuration again, or you delete your cookies. Are you sure you want to change your settings? YESNO CLOSE X Please disable your ad blocker (or update your settings to ensure that javascript and cookies are enabled), so that we can continue to provide you with the first-rate market news and data you've come to expect from us. CLOSE X", "articleID": "2017061911_00506125_W", "names": {"Peter Henderson": ["Q16090819", "Q39701154", "Q7174626", "Q7174627", "Q7174628"], "Roger Davidson": ["Q7358071", "Q7358072"]}}, {"date": "2017-06-21", "url": "http://home.nzcity.co.nz/news/article.aspx?id=250253&fm=psp,tst", "content": "Home> News> Entertainment <mark>Paris Jackson</mark> wants to be a good role model for children The 19-year-old star - who is the daughter of pop legend <mark>Michael Jackson</mark> - has revealed her ambition is to make a positive impression on the fashion world, and <mark>Paris</mark> also wants to become a healthy influence in the lives of young women. 21 June 2017 She shared: \"I really want to leave a positive imprint in the fashion world, mostly regarding the media and the stereotypical beauty standard that is blasted all over every magazine you see, every article that pops up on your phone screen, every billboard you see while you're driving down the street .\" I already have many young girls looking up to me and I want to be something their parents are OK with them looking up to. \"<mark>Paris</mark> is balancing her burgeoning career as a model with her ambition of becoming a screen star. The teenager recently secured a role in US TV series\" Star', while she has also just finished shooting her first movie. Explaining her passion for acting, <mark>Paris</mark> told the Australian version of Vogue magazine: \"I've always just loved the aspect of storytelling and getting my head into a new space, experiencing the shoes of another person/character, and suspending reality for a moment .\" <mark>Paris</mark>' movie debut sees her star alongside Charlize Theron and Amanda Seyfried in the Nash Edgerton-directed action-comedy \"Gringo'. And <mark>Paris</mark> admitted the Australian movie-maker played a crucial role in ensuring she felt at ease on set. She said:\" It was just like playing my eighth-grade self. Nash is a total angel and made me feel at home the instant I got to set. \"Meanwhile, <mark>Jermaine Jackson</mark> recently admitted he worries fame could\" break \"his niece <mark>Paris</mark>. <mark>Jermaine</mark> said:\" We're very proud of <mark>Paris</mark>. I just think we have to make sure she is OK because this business not kind to anybody. It can break you. \"You have to know when to hold them, when to fold them, when to make your move and when to hold back .\" ", "articleID": "2017062106_00490541_W", "names": {"Jermaine Jackson": ["Q317784", "Q3807984", "Q6182329"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Paris Jackson": ["Q16027591", "Q7137312"]}}]