[{"date": "2017-06-27", "url": "http://www.kollytalk.com/hindi1/bolly/srk-thanks-fans-clocking-25-years-bollywood-579537.html", "content": "Hindi Bolly Cinenews Share on Facebook Tweet on Twitter SRK Mumbai, June 27: Superstar Shah Rukh Khan has thanked all his fans and well-wishers for supporting him in his \"glorious journey\" of over two decades in the Hindi filmdom. Shah Rukh on Monday night shared a 37-second clip on his Twitter handle, where he and his youngest son AbRam were seen addressing a crowd standing in front of his house--Mannat in Bandra here. The father-son duo was seen twinning in all-white kurta pyjamas, while they greeted fans from the terrace of his home in the video. \"Eid Mubarak! Thank you for making my day special. And thank you for joining me on this glorious journey of 25 years. Love you all,\" Shah Rukh captioned the image. The 51-year-old superstar completed the 25-year milestone on June 25, a date which saw the release of his debut film \"Deewana\" back in 1992. Shah Rukh is now gearing up for his upcoming film \"Jab Harry Met Sejal\" , which is directed by <mark>Imtiaz Ali</mark>. The romantic film is extensively shot in Lisbon, Prague, Budapest and Punjab. The film also stars Shah Rukh's \"Rab Ne Bana Di Jodi\" co-star Anushka Sharma. This is the third time the two will be seen sharing screen space together.", "articleID": "2017062711_00324347_W", "names": {"Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"]}}, {"date": "2017-06-28", "url": "http://qctimes.com/now/today/history/today-in-history-june-affordable-care-act/collection_09b6804a-034f-548f-b74e-0540a3587906.html", "content": "Today is Wednesday, June 28. Today's Highlights in History: 1 of 19 1 2012: Affordable Care Act AP Updated 22 hrs ago Five years ago: The Affordable Care Act narrowly survived, 5-4, an election-year battle at the U.S. Supreme Court with the improbable help of conservative Chief Justice <mark>John Roberts</mark>. 2 1836: James Madison AP Updated 22 hrs ago In 1836, the fourth president of the United States, James Madison, died in Montpelier, Virginia. 3 1914: Archduke Franz Ferdinand AP Updated 22 hrs ago On June 28, 1914, Archduke Franz Ferdinand of Austria and his wife, Sophie, were shot to death in Sarajevo (sah-ruh-YAY' - voh) by Serb nationalist Gavrilo Princip (gavh-REE' - loh PREEN' - seep)--an act which sparked World War I. 4 1919: Treaty of Versailles AP Updated 22 hrs ago In 1919, the Treaty of Versailles (vehr-SY') was signed in France, ending the First World War. In Independence, Missouri, future president Harry S. Truman married Elizabeth Virginia Wallace. 5 1939: Pan American Airways AP Updated 22 hrs ago In 1939, Pan American Airways began regular trans-Atlantic air service with a flight that departed New York for Marseilles, France. 6 1944: Thomas E. Dewey AP Updated 22 hrs ago In 1944, the Republican national convention in Chicago nominated New York Gov. Thomas E. Dewey for president and Ohio Gov. <mark>John</mark> W. Bricker for vice president. 7 1950: Seoul, South Korea AP Updated 22 hrs ago In 1950, North Korean forces captured Seoul (sohl), the capital of South Korea. 8 1964: Malcolm X AP Updated 22 hrs ago In 1964, civil rights activist Malcolm X declared, \"We want equality by any means necessary\" during the Founding Rally of the Organization of Afro-American Unity in New York. 9 1978: Supreme Court AP Updated 22 hrs ago In 1978, the Supreme Court ordered the University of California-Davis Medical School to admit Allan Bakke (BAHK' - ee), a white man who argued he'd been a victim of reverse racial discrimination. 10 1989: Battle of Kosovo AP Updated 22 hrs ago In 1989, about 1 million Serbs gathered to mark the 600th anniversary of the Battle of Kosovo in 1389. 11 1997: Evander Holyfield & <mark>Mike Tyson</mark> AP Updated 22 hrs ago In 1997, in a wild rematch, Evander Holyfield retained the WBA heavyweight boxing championship after his opponent, <mark>Mike Tyson</mark>, was disqualified for biting Holyfield's ear during the third round of their fight in Las Vegas. 12 2007: \"Burn Notice\" AP Updated 22 hrs ago Ten years ago: The TV series \"Burn Notice,\" starring Jeffrey Donovan as a spy left out in the cold, premiered on USA Network. 13 2007: George W. Bush AP Updated 22 hrs ago Ten years ago: President George W. Bush's immigration plan to legalize as many as 12 million immigrants while fortifying the border collapsed in the Senate. 14 2007: Supreme Court AP Updated 22 hrs ago Ten years ago: The U.S. Supreme Court voted 5-4 to strike down school integration plans in Louisville, Kentucky, and Seattle, a decision that was denounced hours later by Democratic presidential candidates in their third primary debate. 15 2012: <mark>Eric Holder</mark> AP Updated 22 hrs ago Five years ago: Attorney General <mark>Eric Holder</mark> became the first sitting Cabinet member held in contempt of Congress, a rebuke pushed by Republicans seeking to unearth the facts behind a bungled gun-tracking operation known as Fast and Furious. (The vote was 255-67, with more than 100 Democrats boycotting .) 16 2012: <mark>Katie Holmes</mark> & Tom Cruise AP Updated 22 hrs ago Five years ago: <mark>Katie Holmes</mark> filed for divorce from Tom Cruise after 5 years of marriage. 17 2012: Wimbledon Tennis AP Updated 22 hrs ago Five years ago: At Wimbledon, 2-time champion Rafael Nadal was overpowered in the second round by Lukas Rosol, a Czech ranked No. 100, 6-7 (9), 6-4, 6-4, 2-6, 6-4. 18 2016: Ataturk Airport AP Updated 22 hrs ago One year ago: Three suicide bombers armed with assault rifles stormed Istanbul's Ataturk airport, killing 44 victims and wounding nearly 150; no one claimed responsibility, but Turkish official said they suspected the Islamic State group. 19 2016: House Benghazi Report AP Updated 22 hrs ago One year ago: House Republicans concluded their $7 million, two-year investigation into the deadly attacks in Benghazi, Libya, with fresh accusations of lethal mistakes by the Obama administration but no \"smoking gun\" pointing to wrongdoing by Hillary Clinton, who said the report \"found nothing, nothing to contradict\" the findings of earlier investigations. More like this...Close 1 of 19 AP Five years ago: The Affordable Care Act narrowly survived, 5-4, an election-year battle at the U.S. Supreme Court with the improbable help of conservative Chief Justice <mark>John Roberts</mark>. AP In 1836, the fourth president of the United States, James Madison, died in Montpelier, Virginia. AP On June 28, 1914, Archduke Franz Ferdinand of Austria and his wife, Sophie, were shot to death in Sarajevo (sah-ruh-YAY' - voh) by Serb nationalist Gavrilo Princip (gavh-REE' - loh PREEN' - seep)--an act which sparked World War I. AP In 1919, the Treaty of Versailles (vehr-SY') was signed in France, ending the First World War. In Independence, Missouri, future president Harry S. Truman married Elizabeth Virginia Wallace. AP In 1939, Pan American Airways began regular trans-Atlantic air service with a flight that departed New York for Marseilles, France. AP In 1944, the Republican national convention in Chicago nominated New York Gov. Thomas E. Dewey for president and Ohio Gov. <mark>John</mark> W. Bricker for vice president. AP In 1950, North Korean forces captured Seoul (sohl), the capital of South Korea. AP In 1964, civil rights activist Malcolm X declared, \"We want equality by any means necessary\" during the Founding Rally of the Organization of Afro-American Unity in New York. AP In 1978, the Supreme Court ordered the University of California-Davis Medical School to admit Allan Bakke (BAHK' - ee), a white man who argued he'd been a victim of reverse racial discrimination. AP In 1989, about 1 million Serbs gathered to mark the 600th anniversary of the Battle of Kosovo in 1389. AP In 1997, in a wild rematch, Evander Holyfield retained the WBA heavyweight boxing championship after his opponent, <mark>Mike Tyson</mark>, was disqualified for biting Holyfield's ear during the third round of their fight in Las Vegas. AP Ten years ago: The TV series \"Burn Notice,\" starring Jeffrey Donovan as a spy left out in the cold, premiered on USA Network. AP Ten years ago: President George W. Bush's immigration plan to legalize as many as 12 million immigrants while fortifying the border collapsed in the Senate. AP Ten years ago: The U.S. Supreme Court voted 5-4 to strike down school integration plans in Louisville, Kentucky, and Seattle, a decision that was denounced hours later by Democratic presidential candidates in their third primary debate. AP Five years ago: Attorney General <mark>Eric Holder</mark> became the first sitting Cabinet member held in contempt of Congress, a rebuke pushed by Republicans seeking to unearth the facts behind a bungled gun-tracking operation known as Fast and Furious. (The vote was 255-67, with more than 100 Democrats boycotting .) AP Five years ago: <mark>Katie Holmes</mark> filed for divorce from Tom Cruise after 5 years of marriage. AP Five years ago: At Wimbledon, 2-time champion Rafael Nadal was overpowered in the second round by Lukas Rosol, a Czech ranked No. 100, 6-7 (9), 6-4, 6-4, 2-6, 6-4. AP One year ago: Three suicide bombers armed with assault rifles stormed Istanbul's Ataturk airport, killing 44 victims and wounding nearly 150; no one claimed responsibility, but Turkish official said they suspected the Islamic State group. AP One year ago: House Republicans concluded their $7 million, two-year investigation into the deadly attacks in Benghazi, Libya, with fresh accusations of lethal mistakes by the Obama administration but no \"smoking gun\" pointing to wrongdoing by Hillary Clinton, who said the report \"found nothing, nothing to contradict\" the findings of earlier investigations. More like this...Tags Sweeps Wire A Twitter List by qctimes", "articleID": "2017062811_00346398_W", "names": {"Eric Holder": ["Q312644", "Q3591180"], "John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"], "Katie Holmes": ["Q174346", "Q6377464"], "Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}}, {"date": "2017-06-28", "url": "https://www.alligatorarmy.com/2017/6/28/15886390/florida-gators-baseball-national-title-highlights-mick-hubert-call-video", "content": "Watch, listen: Highlights from Florida's baseball national title, and Mick Hubert's call \"OH MY! They've done it! They've won it!\" Dunno if you caught that. Wasn't that big a deal. Here are all the relevant highlights, though. National Championship highlights are the best highlights! Check out everything from the 6-1 win, and all the celebration after! #GoGators pic.twitter.com/YwbyOClmOT--Gators Baseball (@ GatorsBB) June 28, 2017 Notable highlights missing from this? Nick Horvath's sweet catch to end the seventh, and the spin move he did after making it; Jonathan India's \"LET'S FUCKING GO!\" after his leadoff double in the eighth inning. (Lamentably missing from it: The saga of the LSU fan quixotically straining for foul balls. Not so lamentably missing: Karl Ravech's play-by-play call .) History...MADE .--Savanna E. Collins (@ savannaecollins) June 28, 2017 That feeling when you win your school's first ever College World Series. pic.twitter.com/jWvaC0Ewj3 Dogpiles are cool. I am also envious of Jackson Kowar's hair. That NATIONAL CHAMPIONSHIP call we've waited so long to hear! #OmahaGators #GoGators pic.twitter.com/kOZZDTOG2x--Gators Baseball (@ GatorsBB) June 28, 2017 Even written out, longtime Florida play-by-play man Mick Hubert's call of the final out is a great one: \"Here's Kowar, coming set. The pitch...swung on, bouncing ball! Second base! Liput! On the outfield grass, throws to first--that's it! The ballgame is all over! Gloves go flying in the air, as the fireworks come bursting out of the stands out in the outfield! The dogpile is on, to the right of the mound, the Gators heaping on one another! Florida has won the national championship in baseball! OH MY! They've done it! They've won it!\" But the best thing I saw last night? The thing that made my heart swell two sizes? It's this video of Florida catcher <mark>Mike Rivera</mark> getting hugged, with a wonderful addition at the end of it. GROUP HUG FOR MIKEY!! pic.twitter.com/JwKZwIcjZW--Gators Baseball (@ GatorsBB) June 28, 2017 At the end of it all--at the end of our lives, which all will end--I think we will be measured by the love we have given, the love we have shared. I see a lot of that love right there. Trending", "articleID": "2017062816_00006799_W", "names": {"Mike Rivera": ["Q3313520", "Q6848583"]}}, {"date": "2017-06-28", "url": "http://journalstar.com/news/national/mom-s-ex-boyfriend-gets-life-in-killing-of-baby/article_2a36aa1f-b5ec-5c51-b1ff-e47d828d6919.html", "content": "BOSTON (AP)--A Massachusetts man was sentenced Wednesday to life in prison in the killing of a 2-year-old girl who became known as Baby Doe after her remains washed up on the shore of a Boston Harbor island. <mark>Michael McCarthy</mark>, 37, will be eligible for parole after serving 20 years under the sentence imposed by Judge Janet Sanders. <mark>McCarthy</mark> was convicted Monday of second-degree murder in the 2015 killing of Bella Bond, the daughter of his girlfriend at the time. A computer-generated image of Bella was shared by millions on social media as authorities scrambled to identify her. Assistant District Attorney David Deakin asked the judge to set <mark>McCarthy</mark>'s parole eligibility at 25 years--10 years more than the minimum. <mark>McCarthy</mark>'s lawyer called that recommendation \"vindictive\" and asked Sanders to make him eligible for parole after 15 years. The judge came out in the middle of the two recommendations at 20 years. The girl's mother, Rachelle Bond, who also was charged in the case, was the prosecution's star witness. She told the jury she saw <mark>McCarthy</mark> kill her daughter one night after the girl didn't want to go to bed. <mark>McCarthy</mark>'s lawyer, <mark>Jonathan Shapiro</mark>, insisted that Bond was the real killer and cast a \"web of lies\" to blame <mark>McCarthy</mark>. \"There was no justice for Mr. <mark>McCarthy</mark> here,\" <mark>Shapiro</mark> said. Bond pleaded guilty to being an accessory after the fact for helping <mark>McCarthy</mark> dispose of her daughter's body. Under a plea deal with prosecutors, she is expected to serve less than two years in jail. The agreement calls for her to be released after her sentencing July 12. Sign up for our daily news email The top headlines from JournalStar.com. Delivered at 11 a.m. Monday-Friday. Sign Up! Daily Headlines Top headlines from journalstar.com. Delivered at 11 a.m. Monday-Friday. Obituaries I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. Bella Bond's father, Joseph Amoroso, gave a victim impact statement before <mark>McCarthy</mark> was sentenced, describing Bella as \"a happy and innocent child full of life .\" \"I was robbed of my chance to be a father to Bella,\" he said. Testimony during the trial showed the girl's short life was marked by turmoil. Both <mark>McCarthy</mark> and Bond were heroin addicts. A friend testified that he saw <mark>McCarthy</mark> discipline the girl by putting her in a locked closet.", "articleID": "2017062817_00488568_W", "names": {"Jonathan Shapiro": ["Q28421759", "Q2966148"], "Michael Mccarthy": ["Q1933317", "Q20010903", "Q20642389", "Q3308368", "Q6832627", "Q6832630", "Q6832633"]}}, {"date": "2017-06-29", "url": "http://www.news.com.au/national/breaking-news/no-case-for-significant-rate-rise-anz/news-story/cf2565a03f4f854b7e8dfe8949d02be6", "content": "Borrowers get worrying warning on rates June 29, 2017 2:29 pm Colin Brinsden, AAP Economics Correspondent Australian Associated Press Share Email a friend The views of a former Reserve Bank board member on the interest rate outlook might have been dismissed as \"extreme\" and \"nonsense\" , but they sent a shiver down the spine of borrowers. Economist <mark>John Edwards</mark>, who ended his five-year term as a board member last year, believes official interest rates could rise eight times over the next two years, based on the central bank's present economic forecasts. That would add hundreds of dollars to monthly mortgage payments. But the boss of one of the big four banks disagrees with the <mark>Edwards</mark> assessement. ANZ chief executive Shayne Elliott said it was difficult to see interest rate increases anytime soon when Australia was struggling with below-trend economic growth and wage growth that was almost non-existent. \"I think it is hard to lay a case that says\" gee we are going to see significant interests rate rises', \"he told ABC radio on Thursday. Many households wouldn't be able to afford such increases .\" I think we need to be very careful. \"<mark>John</mark> Kolenda, managing director of mortgage broker 1300HomeLoan, said a rapid rise in interest rates would be disastrous to already fragile consumer confidence .\" The impact of a number of rate rises by the RBA will just terrify consumers and prompt them to tighten their belts dramatically, \"he said. It is a point made by the global central banking authority, the Bank for International Settlements, in a report this week, which cited Australia among a handful of other countries where household debt is on the rise .\" Increases in interest rates beyond what is currently priced in markets could weaken consumption considerably, \"the central bank to central banks said. If Dr <mark>Edwards</mark>, a former adviser to <mark>Paul Keating</mark>, is correct it would take the Reserve Bank's cash rate to 3.5 per cent from a record low 1.5 per cent, where it has stood since August last year. But financial markets are predicting just a single quarter of a percentage point increase by the end of 2018. Deloitte Access Economics economist <mark>Chris Richardson</mark> also expects higher interest rates, but not to the same extent as Dr <mark>Edwards</mark>.\" We wouldn't see interest rates in Australia rise at all until sometime in 2018, probably a year from now, and by the end of 2018 you might have seen two interest rate rises, \"he told ABC radio. The Reserve Bank will hold its monthly board meeting on Tuesday next week.", "articleID": "2017062905_00083005_W", "names": {"Chris Richardson": ["Q5107865", "Q5107867"], "John Edwards": ["Q1499392", "Q16192689", "Q1699944", "Q1699946", "Q19873112", "Q20733395", "Q21461221", "Q21461226", "Q217314", "Q27915201", "Q3809239", "Q52834658", "Q54556677", "Q56597692", "Q56706105", "Q57617438", "Q6231383", "Q6231395"]}}]