[{"date": "2017-06-29", "url": "http://www.news.com.au/national/breaking-news/no-case-for-significant-rate-rise-anz/news-story/cf2565a03f4f854b7e8dfe8949d02be6", "content": "Borrowers get worrying warning on rates June 29, 2017 2:29 pm Colin Brinsden, AAP Economics Correspondent Australian Associated Press Share Email a friend The views of a former Reserve Bank board member on the interest rate outlook might have been dismissed as \"extreme\" and \"nonsense\" , but they sent a shiver down the spine of borrowers. Economist <mark>John Edwards</mark>, who ended his five-year term as a board member last year, believes official interest rates could rise eight times over the next two years, based on the central bank's present economic forecasts. That would add hundreds of dollars to monthly mortgage payments. But the boss of one of the big four banks disagrees with the <mark>Edwards</mark> assessement. ANZ chief executive Shayne Elliott said it was difficult to see interest rate increases anytime soon when Australia was struggling with below-trend economic growth and wage growth that was almost non-existent. \"I think it is hard to lay a case that says\" gee we are going to see significant interests rate rises', \"he told ABC radio on Thursday. Many households wouldn't be able to afford such increases .\" I think we need to be very careful. \"<mark>John</mark> Kolenda, managing director of mortgage broker 1300HomeLoan, said a rapid rise in interest rates would be disastrous to already fragile consumer confidence .\" The impact of a number of rate rises by the RBA will just terrify consumers and prompt them to tighten their belts dramatically, \"he said. It is a point made by the global central banking authority, the Bank for International Settlements, in a report this week, which cited Australia among a handful of other countries where household debt is on the rise .\" Increases in interest rates beyond what is currently priced in markets could weaken consumption considerably, \"the central bank to central banks said. If Dr <mark>Edwards</mark>, a former adviser to <mark>Paul Keating</mark>, is correct it would take the Reserve Bank's cash rate to 3.5 per cent from a record low 1.5 per cent, where it has stood since August last year. But financial markets are predicting just a single quarter of a percentage point increase by the end of 2018. Deloitte Access Economics economist <mark>Chris Richardson</mark> also expects higher interest rates, but not to the same extent as Dr <mark>Edwards</mark>.\" We wouldn't see interest rates in Australia rise at all until sometime in 2018, probably a year from now, and by the end of 2018 you might have seen two interest rate rises, \"he told ABC radio. The Reserve Bank will hold its monthly board meeting on Tuesday next week.", "articleID": "2017062905_00083005_W", "names": {"Paul Keating": ["Q15452628", "Q242654"]}}, {"date": "2017-06-29", "url": "http://www.theobserver.ca/2017/06/29/bluewater-health-adds-8-larger-rooms-accommodating-for-larger-families-and-indigenous-birthing-rituals", "content": "Bluewater Health adds 8 larger rooms accommodating for larger families and Indigenous birthing rituals By Jeremiah Rodriguez, Postmedia Network Thursday, June 29, 2017 3:31:57 EDT PM Previous Next First Nation dancers performing a dance during the drum ceremony at Bluewater Health Hospital inaugurating new multi-purpose rooms in maternity ward. (JEREMIAH RODRIGUEZ / THE SARNIA OBSERVER) Tweet Change text size for the story Print Report an error Forget waiting rooms, large families will now be able to comfortably fit in the same room where a mother goes in labour to recovery as Bluewater Health adds eight large unique birthing rooms Thursday. The new rooms, funded by Bluewater Health Foundation, allow for a new birthing experience where larger families, especially Indigenous ones, can stay in the same room where labour, birthing and then recovery all will take place. \"Indigenous population generally come with larger extended families and we really wanted to give them space,\" Sally Jenkins, director of the Maternal, Infant Child program, said. \"It's part of their culture and they have big celebrations .\" Marked by a ribbon-cutting and an Indigenous dancing and drumming ceremony, one of the rooms was dedicated and specially designed for Indigenous families but are open for everyone to use. They include wood panelling, a basin for cedar bath for purification and cleansing and a space for ceremonial smudging. \"The rooms are important because it keeps the families together. So they are bigger rooms and they don't get moved,\" Jenkins said. \"It's less disruptive .\" The room was also a part of one of the first joint projects between Aamijiwnaang First Nation Health Centre and Erie St. Clair LHIN's Indigenous advisory panel, said Sarah Plain from the health centre. The new rooms are all larger than both Bluewater's six birthing and 10 postpartum rooms and one of the eight is even larger to accommodate and hold larger families who might wish to take part in the traditional indigenous birthing ceremonies. This larger one is covered in covered in Indigenous art, decorations and a mounted moss bag behind glass not unlike the usable ones that First Nations peoples use to hold newborns, grandmother Liz Plain said. \"My daughter--who is going to be forty soon--I still have hers and has gone down in generations to my recently born grandson,\" Plain said. Although she mentioned that re-using one is rarer in most cases. Bluewater Health sees over a thousand births a year so the new rooms should be a massive help. \"We have a commitment to serving our diverse community and that's why we trying to provide an exemplary birthing experience for all the families in Sarnia and Lambton,\" Dr. <mark>Baljit Singh</mark>, Medical director of the MIC program said. The genesis for the new rooms happened during planning for renovations to create more birthing rooms two years ago, Bluewater reached out to the First Nations community as well as Dr. <mark>Singh</mark> along with staff and physicians all for their input. The rooms themselves were built within one year with the funds donated by the Bluewater Health Foundation.", "articleID": "2017062919_01044196_W", "names": {"Baljit Singh": ["Q4851052", "Q4851053", "Q805002"]}}, {"date": "2017-06-30", "url": "http://www.dailystar.co.uk/sport/football/626090/Premier-League-owners-most-money-richest-investments-club-Abramovich-sportgalleries", "content": "The 10 Premier League club owners who have invested the most in their teams WHICH Premier League club owners have put the most money into their clubs? 1 / 10 GETTY 10. <mark>David Sullivan</mark> and <mark>David Gold</mark> - £ 105m in West Ham \"Two different owners for Arsenal and Manchester City both appear in the top 10\" England's top flight's biggest clubs are all bankrolled by rich investors these days, from the USA, Russia, China and elsewhere. Research by SBO has shown which owners have invested the most cash, with two different sets of owners appearing for both Arsenal and Manchester City. So which club's sugar daddy has splashed out the most? CLICK THROUGH THE GALLERY ABOVE TO FIND OUT. Related articles Every Premier League club since 1992 ranked by their highest home attendance Every Premier League done deal so far this transfer window: What has been confirmed? Borini joins Faubert and Bendtner among the weirdest transfers football has ever seen", "articleID": "2017063004_00104239_W", "names": {"David Gold": ["Q48816571", "Q5234186", "Q56752800", "Q860329"], "David Sullivan": ["Q1046824", "Q16196719", "Q5240170", "Q57436725"]}}, {"date": "2017-06-30", "url": "http://timesofindia.indiatimes.com/sports/tennis/wimbledon-2017/lendl-confident-murray-will-be-fit-to-defend-wimbledon-title/articleshow/59381210.cms", "content": "Times of India Dream is to play World Cup alongside Hardik: Krunal Lendl confident <mark>Murray</mark> will be fit to defend Wimbledon title Reuters | Jun 30, 2017, 10.06 AM IST LONDON: <mark>Andy Murray</mark>'s coach Ivan Lendl is \"not at all\" concerned that injury would prevent the world number one from defending his Wimbledon title next week. <mark>Murray</mark> has twice pulled out of matches at a grasscourt exhibition tournament in London this week because of a hip problem but Lendl said the 30-year-old Scot was likely to resume practice at Wimbledon on Friday. \"We'll see what the weather is like,\" Lendl told the British media. \"If the weather is good, I am sure we will practise .\" Asked whether he was concerned about <mark>Murray</mark>'s Wimbledon campaign, the Czech said: \"Not at all. Unlike before Paris, he is hitting the ball really well. Practice has gone well .\" <mark>Murray</mark> was knocked out of the semi-finals of the French Open in Paris by Stan Wawrinka earlier this month but lost his only tour outing since that match to lowly-ranked Australian <mark>Jordan Thompson</mark> on the grasscourts of Queen's Club. \"I wasn't really surprised,\" Lendl added. \"The first match on grass is always tricky. The guys who beat Stan Wawrinka, Milos Raonic and <mark>Andy</mark> had played qualifying or the previous week at a tournament. We have seen that movie over and over .\" Guys play matches, feel a little bit more comfortable than the guys who didn't play. \"Roger Federer, seven times a champion at the All England Club, said he was convinced <mark>Murray</mark> would be on court for his first round match at Wimbledon on Monday .\" I expect him to play unless I have missed something completely, \"the Swiss told British newspapers .\" I would know more about it, I think, if it had been a really significant injury. The way I know <mark>Andy</mark>, he's tough as nails and I feel like he's going to be there on the opening Monday. \"He would need to be significantly injured not to play. For me, if he can get through that first round and feel better afterwards, absolutely he should play .\" Top seed <mark>Murray</mark> will discover his first round opponent when the draw is made later on Friday Get latest news & live updates on the go on your pc with News App. Download The Times of India news app for your device. RELATED", "articleID": "2017063005_00007325_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "Jordan Thompson": ["Q16219277", "Q18385737", "Q6277054"]}}, {"date": "2017-06-30", "url": "http://eastenders.wikia.com/wiki/29_May_2017?diff=71796&oldid=0", "content": "Revision as of 14:13, June 30, 2017 (view source) Sonalsall (wall | contribs) (Created page with \"{{eastenders edit box information for episodes | title1 = 29 May 2017 | image1 = 29. jpg | caption1 = Whitney on the train, leaving Walford | air_date: = 29 May 2017 | writer = Gillian R.. .\" ) Newer edit → Revision as of 14:13, June 30, 2017 29 May 2017 Whitney on the train, leaving Walford Air Date: 29 May 2017 Writer Gillian Richmond Director John Dower \"Two residents are forced to face the reality of their actions. Denise gets a welcome surprise\". Plot Synopsis In the opening scene Whitney is in the Carter Kitchen, Mick enters and they talk about the previous series of events and agree that it was a mistake, Shirley interrupts them and tells Mick to go downstairs to take care of a vending machine rep. Johnny walks into the kitchen hungover and looking for food. Shirley looks at troubled Whitney. In the next scene, Denise is walking through the market on the phone with her sister Kim, who is worried about how Denise fainted. Kim is in the cafe and offers to get coffee with Denise, she rejects the offer and tells Kim she is staying home preparing for Patrick's return. Once Kim gets off the phone with her sister she and Sharon talk about the community centre, Cathy has the information but Kim looks disappointed with their work. Johnny and Whitney are sitting in the cafe and Johnny confesses to Whitney that he is worried about his father and asks Whitney if he has said anything to her. She looks worried but tells him Mick hasn't said anything. Meanwhile, in the market Denise bumps into Honey who then asks her how she is after she fainted, Denise tells honey she is alright and it was \"just stress from the exam\" , Honey tells her to look after herself. Denise catches up on local gossip, honey gets a call from Jack and rushes off. Stacey, <mark>Martin</mark> and baby Arthur walk through the market, Stacey asks Denise how she is, annoyed Denise then says that she wishes her sister would not spread the news about her all over the square. Denise then leaves and <mark>Billy</mark> talks to Stacey and <mark>Martin</mark>. The new couple in Walford walk through the market admiring the <mark>Fowler</mark> family, Kim attempts to get as many signatures as she can to save the community centre, she then approaches the new couple. Steven comes out of the house looking worried as <mark>Martin</mark> and Stacey make a remark regarding Lauren and her relationship with her boss. Denise's tutor comes to visit her and manages to convince her to leave the house and go for a walk as she has been couped up in the house studying for the exam she took the previous week. Back in the cafe Whitney and Johnny are still talking, Johnny is concerned for Whitney and ensures her that if anything is worrying her then she can talk to him, he then leaves. In the Park, Honey is looking after the kids when she gets a call from her husband, <mark>Billy</mark>, they both share concern over their son as he is having a hard time. She then ends the call, Charlie is hiding in the trees in the park, watching honey and the children, including his son, Mathew. Shirley is concerned for Mick and wants to know why he is acting so sketchy, she tells him to tell her whatever he is hiding, she ensures him that she will not judge as she is his mother. Mick then confesses to her that he and Whitney kissed, he tells her he is not a good man and walks out. Back in the cafe, Cathy asks Whitney if she is okay, Whitney tells her that Bianca, Morgan and Tiffany are having a hard time. Cathy reminds her that they are her family so she should go see them. Abi comes into the cafe and sees Steven, Abi is looking after Louis because Lauren is working. Abi tries to stir up trouble between Steven and Lauren. Steven asks if Abi is jealous of Lauren and she walks away. As she walks towards the door Cathy asks her about her birthday plans, Steven watches as they talk. After Abi leaves Steven looks at his laptop and searches \"Track your partner\" , he then opens a website and takes out his phone. Back in the Queen Vic Shirley is keeping a close eye on Mick and Whitney, Patrick returns and Mick tells him he is sorry about Denise, however, Patrick doesn't know what Mick is talking about. While in the park, Denise and Jorgen talk, Denise then tells him that she thinks she failed the exam, Jorgen tries to boost her confidence and buys her ice cream. As Honey is walking back to the square with all of the kids Charlie approaches them, she then takes him aside and tells him that Jack is the best father that the kids could ever have, she then walks away and takes the kids to get sweets. Back at the Pub Shirley warns Whitney to stay away from Mick and to leave, Whitney tells her that Shirley is the mother Mick never knew and that questions her about what kind of mother she is as she forged her son's signature and sold half of the pub. Shirley then tells her to pack her bags and leave. Meanwhile, downstairs, Mick begins to Wallow again. Back in the park, Denise and Jorgen continue to talk about the exam, she tells him that she has to go and prepare for Patrick's arrival, she says she would have like to cook him a meal but she forgot her purse at home. Jorgen offers to lend her 20 quid, she first refuses and then asks for a tenner. The scene then jumps back to Mick wallowing, Whitney is then shown upstairs pulling out a suitcase from under her bed and walking over to her cupboard. Honey is outside Jacks house, they are talking, she tells him that the kids had a nice time at the park. Charlie is watching from behind a tree. Outside Sharon's house, Michelle returns home after work, Sharon gives Michelle a package that was left for her. Honey then tells Jack that Charlie approached her and the kids, they talk and then she walks away. Charlie comes out from behind the tree and tells Jack that he has informed social services that he intends to apply for residence. Denise returns home to see Patrick waiting, she begins to worry as she got his time of arrival confused. Denise panics and starts preparing dinner, she begins to cry but blames it on the onions. Patrick is worried about her and she begins to tell him how bad it has been. Back at the pub, Mick is upstairs trying to talk to Whitney through the door of her room, he apologises to her and asks if she can hear him. When he gets no response he enters to see an empty room with an empty cupboard. The scene then cuts to Whitney on the train and the episode ends. Appearances Edit Whitney Carter Mick Carter Shirley Carter Johnny Carter Denise Fox Kimberly Fox-Hubbard Sharon Mitchell Cathy Beale Honey <mark>Mitchell</mark> Stacey <mark>Fowler</mark> <mark>Martin Fowler</mark> <mark>Billy Mitchell</mark> Ted Murray Joyce Murray Steven Beale Jorgen Christensen Ricky <mark>Mitchell</mark> Amy <mark>Mitchell</mark> Abi Branning Michelle <mark>Fowler</mark> Charlie Cotton Patrick Trueman Retrieved from \"http: //eastenders.wikia.com/wiki/May_29, _2017? oldid=71796\" Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected.", "articleID": "2017063015_00214817_W", "names": {"Billy Mitchell": ["Q16732684", "Q18001525", "Q466532", "Q530431"], "Martin Fowler": ["Q58417927", "Q6775467", "Q74894"]}}, {"date": "2017-06-30", "url": "https://www.barcablaugranes.com/2017/6/30/15901096/barcelona-transfer-pip-real-madrid-betis-dani-ceballos#comments", "content": "Barcelona Ready to Pip Real Madrid for Betis's Dani Ceballos? Rec Photo by Aitor Alcalde/Getty Images Dani Ceballos is lighting up the UEFA Under-21 Championship, drawing strong interest from Real Madrid. And now, Barcelona want to swoop in before the Real Betis player goes to the capital, according to MARCA. That report might not come true, of course, because, well...MARCA. But there's also the players' anti-Catalan tweets from a few years ago. \"Be quiet, Gerard Pique, and don't give your opinion about Andalusia, you s ** t Catalan,\" he wrote when he was 16. \"I find the whistling of the national anthem a disgrace,\" another tweet said. \"A bomb needs to fall on the stands and kill all the Catalan and Bizcayan dogs .\" Another sent to Pique and Cesc Fabregas said: \"don't you feel ashamed taking a picture with the Catalan flag? Get out of the country, Catalans .\" Another one simply said: \"I'm disgusted by Catalans, all of them should die already .\" He did have some positive things to say about Barcelona, one time writing: \"This Barcelona isn't normal, with the way Lionel Messi receives the ball in the middle of the pitch, does a PlayStation move to Jordi Alba, and then it's a goal from Xavi,\" He also wrote derogatory comments about former Real Madrid keeper <mark>Iker Casillas</mark> and his wife Sara Carbonero. On another day he wrote: \"Ronaldo and Mourinho have no shame, disgusted by Madrid .\" The list of inappropriate and/or shameful tweets goes on. In any case, should Barcelona want this young star despite his previous attacks on the likes of Pique and Catalans in general? Or should we just recognize that kids say stupid things ...? After all, he was just 16, and everyone says things they later regret. The difference is most of us didn't write it on Twitter and later become famous footballers. On the other hand, Barcelona has shown they take these kinds of tweets seriously. Sergi Guardiola's Barcelona B contract was cancelled the same day it was signed after tweets were uncovered in which he praised Real Madrid and cursed at Catalonia. Poll Yes, his mistakes should be forgiven. No, anyone who says that has no place at BarçaNo, for other reasons Yes, his mistakes should be forgiven. (44 votes) No, anyone who says that has no place at Barça (39 votes)", "articleID": "2017063018_00406445_W", "names": {"Iker Casillas": ["Q11584", "Q1190369"]}}, {"date": "2017-07-02", "url": "http://www.dailypost.co.uk/sport/football/transfer-news/everton-fc-news-live-michael-13269823", "content": "Sport Everton FC news LIVE: <mark>Michael Keane</mark> and Sandro Ramirez updates All the latest from Goodison Park Share By Chris Beesley Updated 13:09, 2 JUL 2017 Sport Burnley's <mark>Michael Keane</mark> marshal's Sunderland's Jermain Defoe at the Stadium of Light Share Chris Beesley and the rest of the team will be with you today from 9am to ensure constant coverage of all things EFC, including news, great photos, nostalgia, live interviews and much more. The ECHO will also provide you with the very latest transfer news as it happens throughout the summer, with every rumour and story digested and analysed each day with updates from full-time EFC reporter Phil Kirkbride, as well as EFC editor Greg O'Keeffe. We will also have the very latest on Everton's proposed new stadium on the Bramley Moore dock, pre-season fixtures and injury updates head of the new Premier League season. We want you to get involved too - tell us your thoughts on what's happening at Goodison Park by tweeting @ LivEchoEFC 13:09 <mark>Keane</mark> Gallery Could Everton be getting this record-breaking deal for a defender over the line in the next 24 hours? 12:45 Golden Vision Artistic graphic of the late, great <mark>Alex Young</mark>. 12:13 Why Koeman is best equipped to avoid \"sophomore slump' That's something of an Americanism (or izm) as they might call it. Other here we say\" second season syndrome \". Both David Moyes and Roberto Martinez had a bad case of it - the Scot recovered, the Catalan did not. Alistair Kleebauer examines how current Blues boss Ronald Koeman might fare. Click here for the full article Everton vs Watford. Everton players lap of honour and manager Ronald Koeman (Photo: Colin Lane) 11:32 Coleman delight to hear fans sing his name Everton's Seamus Coleman has been speaking about his friends and family from back home in Ireland and he mentions the time they came to watch last season's game at Manchester United with him. He says:\" I'm quite close to all my friends. \"We had an evening, on the day we played Manchester United at Old Trafford, when all the boys came up to watch the game .\" It was good to chill out with them all. We heard my song being sung by the fans, coming out loud through the TV. That was great. \"Jags' celebration as well was a nice touch. That was a really good evening at home .\" It was like the old days. We are a very close bunch at home. I have a group of friends that I grew up with playing Gaelic football and it's important we all still stay in touch. \"11:06 Blues eye Giroud According to today's transfer rumours, Everton have entered the race for Arsenal's Olivier Giroud. Click here for the full article Allez les Bleus? France striker Olivier Giroud could end up at Everton (Photo: FRANCK FIFE/AFP/Getty Images) 10:35 Fowler salutes Blues transfer business Former Liverpool striker (and boyhood Evertonian of course) Robbie Fowler reckons the Blues transfer business this summer has made rest of league look\" a bit stupid. \"He said:\" I have to hand it to Bill Kenwright and his team at Everton. \"They have stolen a march on the rest of the Premier League clubs and even made them look a bit stupid .\" I honestly think that doing your business early this summer is not only wise, but vital, because I reckon prices are only going one way as deals start to get done...through the roof. \"Click here for the full story Robbie Fowler 10:01 <mark>Watson</mark> long-ranger Despite being primarily a right-back, <mark>Steve Watson</mark> had an eye for goal. The Geordie utility man wasn't even playing as an auxiliary centre-forward in this game but he had his eye in. 09:38 Dowell wants to emulate Arteta Kieran Dowell returns to Finch Farm as a World Cup winner - having been part of England's all-conquering U20s side in South Korea - but it's Basque schemer Mikel Arteta who he wants to base his game on. The Blues midfielder said:\" He was someone I always looked up to as a kid. \"He was so graceful on the ball and he made everything look easy .\" He was great to watch and he is someone who I looked at and tried to implement areas of his game into my own. \"Click here for the full interview Kieran Dowell of Everton celebrates with the trophy during the Premier League 2 match between Everton and Liverpool at Goodison 09:30 Chris Beesley Good morning Well the transfer window is now officially open and the Blues return to pre-season training tomorrow so let's start cranking things up. Share More On Everton FC", "articleID": "2017070212_00698206_W", "names": {"Alex Young": ["Q21043040", "Q26710684", "Q353522", "Q4718033", "Q4718035"]}}]