[{"date": "2017-07-02", "url": "http://www.dailypost.co.uk/sport/football/transfer-news/everton-fc-news-live-michael-13269823", "content": "Sport Everton FC news LIVE: <mark>Michael Keane</mark> and Sandro Ramirez updates All the latest from Goodison Park Share By Chris Beesley Updated 13:09, 2 JUL 2017 Sport Burnley's <mark>Michael Keane</mark> marshal's Sunderland's Jermain Defoe at the Stadium of Light Share Chris Beesley and the rest of the team will be with you today from 9am to ensure constant coverage of all things EFC, including news, great photos, nostalgia, live interviews and much more. The ECHO will also provide you with the very latest transfer news as it happens throughout the summer, with every rumour and story digested and analysed each day with updates from full-time EFC reporter Phil Kirkbride, as well as EFC editor Greg O'Keeffe. We will also have the very latest on Everton's proposed new stadium on the Bramley Moore dock, pre-season fixtures and injury updates head of the new Premier League season. We want you to get involved too - tell us your thoughts on what's happening at Goodison Park by tweeting @ LivEchoEFC 13:09 <mark>Keane</mark> Gallery Could Everton be getting this record-breaking deal for a defender over the line in the next 24 hours? 12:45 Golden Vision Artistic graphic of the late, great <mark>Alex Young</mark>. 12:13 Why Koeman is best equipped to avoid \"sophomore slump' That's something of an Americanism (or izm) as they might call it. Other here we say\" second season syndrome \". Both David Moyes and Roberto Martinez had a bad case of it - the Scot recovered, the Catalan did not. Alistair Kleebauer examines how current Blues boss Ronald Koeman might fare. Click here for the full article Everton vs Watford. Everton players lap of honour and manager Ronald Koeman (Photo: Colin Lane) 11:32 Coleman delight to hear fans sing his name Everton's Seamus Coleman has been speaking about his friends and family from back home in Ireland and he mentions the time they came to watch last season's game at Manchester United with him. He says:\" I'm quite close to all my friends. \"We had an evening, on the day we played Manchester United at Old Trafford, when all the boys came up to watch the game .\" It was good to chill out with them all. We heard my song being sung by the fans, coming out loud through the TV. That was great. \"Jags' celebration as well was a nice touch. That was a really good evening at home .\" It was like the old days. We are a very close bunch at home. I have a group of friends that I grew up with playing Gaelic football and it's important we all still stay in touch. \"11:06 Blues eye Giroud According to today's transfer rumours, Everton have entered the race for Arsenal's Olivier Giroud. Click here for the full article Allez les Bleus? France striker Olivier Giroud could end up at Everton (Photo: FRANCK FIFE/AFP/Getty Images) 10:35 Fowler salutes Blues transfer business Former Liverpool striker (and boyhood Evertonian of course) Robbie Fowler reckons the Blues transfer business this summer has made rest of league look\" a bit stupid. \"He said:\" I have to hand it to Bill Kenwright and his team at Everton. \"They have stolen a march on the rest of the Premier League clubs and even made them look a bit stupid .\" I honestly think that doing your business early this summer is not only wise, but vital, because I reckon prices are only going one way as deals start to get done...through the roof. \"Click here for the full story Robbie Fowler 10:01 <mark>Watson</mark> long-ranger Despite being primarily a right-back, <mark>Steve Watson</mark> had an eye for goal. The Geordie utility man wasn't even playing as an auxiliary centre-forward in this game but he had his eye in. 09:38 Dowell wants to emulate Arteta Kieran Dowell returns to Finch Farm as a World Cup winner - having been part of England's all-conquering U20s side in South Korea - but it's Basque schemer Mikel Arteta who he wants to base his game on. The Blues midfielder said:\" He was someone I always looked up to as a kid. \"He was so graceful on the ball and he made everything look easy .\" He was great to watch and he is someone who I looked at and tried to implement areas of his game into my own. \"Click here for the full interview Kieran Dowell of Everton celebrates with the trophy during the Premier League 2 match between Everton and Liverpool at Goodison 09:30 Chris Beesley Good morning Well the transfer window is now officially open and the Blues return to pre-season training tomorrow so let's start cranking things up. Share More On Everton FC", "articleID": "2017070212_00698206_W", "names": {"Michael Keane": ["Q16154778", "Q51427785", "Q6831802", "Q80712"], "Steve Watson": ["Q21067229", "Q2347391", "Q3499159", "Q56423575", "Q7614250", "Q984352"]}}, {"date": "2017-07-03", "url": "https://almanacnews.com/news/show_story.php?id=22793", "content": "Uploaded: Mon, Jul 3, 2017, 11:10 am Renegade robot makers by Kate Bradshaw / Almanac Renegade Robotics Team Coach Leslie <mark>Peters</mark> addresses the team members at the beginning of long summer work day, on June 14, 2017. The team has been known to log in 14 hours in a single weekend building robots. Photo by Ana Sofia Amieva-Wang View All Photos (9) They wear purple capes. They decorate their gear with stick-on jewels, and carry a tote bag decorated with their team logo. They also program a robot to operate autonomously and with remote controls. And, in two years, they've gone from starting their own team to competing in the world championships at an activity known widely to be skewed male. They're Renegade Robotics, an all-girls robotics team made up of five high school students from Menlo Park and Portola Valley: Serena <mark>Peters</mark> (grade 9), Avani Anne (grade 10) and Navya Anne (grade 12) at Menlo-Atherton High School; Anna Beaver (grade 11) at Woodside High School; and <mark>Elizabeth Peters</mark> (grade 11) at Pinewood School. Coached by Leslie <mark>Peters</mark>, mother to <mark>Elizabeth</mark> and Serena, they compete in a league called VEX Robotics, run by the Robotics Education & Competition Foundation. Unlike other leagues, where there is a set amount of time that teams are given to work on their robots, the VEX league allows teams to work on iterations of their robots over the course of a year, as they develop robots that can complete a set of challenges during two-minute, two-on-two competitions. Of about 11,000 teams in 32 countries, about 700 are all-female, a VEX Robotics spokesperson says. At the California state championships, the Renegade team members were almost the only girls competing among 36 teams, Coach <mark>Peters</mark> says. \"VEX Robotics has a particularly bad male-to-female ratio,\" she says. Renegade is one of only two all-girls teams in Silicon Valley--\"the other one is the one we left,\" she says. The girls split from the other team because they wanted to spend more time building robots, Ms. <mark>Peters</mark> says. Team members interviewed by the Almanac say they typically meet for three-hour sessions twice a week in a teammate's garage. They have been known to log as many as 14 hours in a single weekend, but they find the work rewarding. \"It's the best way to spend your free time,\" Anna says. <mark>Elizabeth</mark>, who does a lot of the programming to make the robot move autonomously, says she loves the feeling when the robot starts working. \"It's all this work, but then (it starts) and you're like,\" Whoa! We built this! It's doing things. It's doing really cool things!'...and you feel so proud that you made this thing that can move on its own. \"The competition At the annual world championships, the next year's\" game, \"or set of challenges that the robots will have to complete, is announced. Then the work begins back home. After an intensive study of the rules, there are discussions of strategy and how to best score points. Then comes designing, prototyping, testing and practice driving the robot. Unlike many of the boys' robots, which are driven usually by one student, the girls say, the Renegade team has multiple drivers operating different parts of the robot. This year, after competing in local tournaments and the state championships, the girls' robot didn't perform well enough to qualify for the world championships the traditional way, by beating the tournament bracket. Instead, they got into the competition with a wild-card spot given for winning a video competition. Their video was about how to use an LCD display to calibrate the robot. They say they were motivated to win the competition after receiving an honorable mention the previous year for their tongue-in-cheek video about how handy it is to have a\" magic \"tote bag to carry extra supplies. At the 2017 VEX Worlds, a world competition, held April 19 to 22 in Louisville, Kentucky, they saw all-girls teams from other countries, and placed higher than they expected to, with a 5-5 record. Unsurprisingly, the level of robotics competition in Silicon Valley more than holds its own compared to other regions .\" The problem with being from Silicon Valley is that this is where all the good teams are, \"Anna explained. China and Singapore are also known to be highly competitive, the girls say. Mentor of the year The team also submitted an essay to the organization nominating Ms. <mark>Peters</mark> for the Mentor of the Year award, which she won and was presented with at the world championships. Though she has a STEM background--she studied mathematics at Princeton and was an actuary before she had kids--Ms. <mark>Peters</mark> says .\" I had to learn all of this stuff really quickly so I get to be just a bit ahead of the girls. \"She now blogs about strategies and problem-solving for VEX teams. Ms. <mark>Peters</mark> and Serena have also helped to mentor an upcoming robotics team at the Corte Madera School in Portola Valley. According to principal Cyndi Maijala and Jason Borgen, the school's director of innovation and learning, parents of Renegade Robotics team members have been involved in helping to launch a competitive robotics program at the school, and the girls have helped to mentor the co-ed middle school team. Success\" I think their success is self-reinforcing, \"Ms. <mark>Peters</mark> says about the team .\" They put in a lot and they have a lot to show for it, and that makes them want to keep going. \"She points to a shelf in the garage lined with trophies:\" This is two seasons of five girls in a garage. \"Because each team must join with another team to face off against two others during the competitions, and are matched up randomly during the tournaments, Ms. <mark>Peters</mark> says, the team has had to learn how to negotiate with other teams to discuss strategy and have confidence in their robot's performance. As middle - and high-school female engineers, they say they sometimes come up with fixes that are different than what boys would do. Using hair ties to help hold pieces in place is an example, Anna said. They also decorate their robots with stick-on jewels and stickers, and have a tradition of naming each year's robot after a secondary Disney character. Ms. <mark>Peters</mark> said the team is looking to add one or two more girls, but noted that there is a significant time commitment. Their next tournament is expected to be held in September .\" It really is fantastic preparation for the real world of engineering, \"she said .\" The girls are getting more confidence as they get older. \"Serena, who will start as a freshman at Menlo-Atherton High School in the fall, said the skills she's learned on the robotics team make problem-solving challenges in science class easier and more fun. Anna described how she felt when the team's robot performed well at a competition .\" You get this insane vibe--you just want to dance, \"she said. __", "articleID": "2017070319_00128964_W", "names": {"Elizabeth Peters": ["Q451009", "Q47451301"]}}, {"date": "2017-07-06", "url": "http://fox8.com/2017/07/06/watch-live-president-trump-visits-poland-ahead-of-tense-meeting-with-world-leaders-in-germany/", "content": "WARSAW, Poland--Republican presidents have been drawn to Poland ever since Ronald Reagan worked with Pope <mark>John Paul</mark> II and the Solidarity movement to help usher in the Eastern European country's democratic political system. And President Donald Trump, who landed in Poland Wednesday night. Poland's affinity for the United States is rooted in Reagan's actions to counter the USSR and truly blossomed when his successor, George H.W. Bush, helped orchestrate a soft landing for the country as it left the Soviet bloc. Despite welcoming Bill Clinton twice to great fanfare, the actions approved by Reagan and Bush created an affinity for the United States, in general, and specifically Republicans. Ties to the United States dipped during President Barack Obama's time in office. Obama's close ties with German Chancellor Angela Merkel--and his view that Germany was the heart of a collective Europe--raised suspicions in Poland, where Germany's power has long been viewed skeptically. Poland's relationship with Obama grew so fraught in 2012 that Republican presidential challenger Mitt Romney traveled there during the campaign to highlight, among other issues, the president's relationship with an ally. Obama's record in regard to Poland was mixed. Obama initially scrapped Bush-era plans to deploy ground-based missile defense systems to Poland and the Czech Republic. He later approved an anti-missile platform in Poland and delivered American troops to the country near the end of his presidency. But by the time those troops arrived to help NATO, the view of Obama as a pro-German leader was cemented. A Pew survey in 2014 found just 50% of Poles had confidence in Obama, one of his lowest ratings in Europe. \"Poland is the most pro-American country in the world--including the United States,\" Michael Mandelbaum, a professor emeritus at Johns Hopkins University, was quoted as saying after a 2003 trip to the country. The sentiment in Poland is changing, though. With populist tides rising--as evidenced by the election of nationalist President <mark>Andrzej Duda</mark>--Poles are now looking inward for leadership, cautious of both Russia to its East and the European Union and Germany to the West. Trump's presidency, however, may turn that feeling on its head. Trump has so far done little to combat Russian President Vladimir Putin's meddling into the 2016 election in the United States and Trump's own advisers are struggling to convince him that Russia still poses a threat, according to multiple senior administration officials. Trump, who will meet with Putin Friday after visiting Poland, will deliver an address to the Polish people on Thursday, as well as meet with <mark>Duda</mark> and speak to the leaders at the Three Seas Initiative, a project that aims to unite Eastern Europe through energy infrastructure. Trump may find a partner in his Polish counterpart, though. <mark>Duda</mark> rose to power in 2015 on the back of nationalist, anti-immigrant sentiment, not dissimilar to Trump's 2016 election win. Both Trump and <mark>Duda</mark> have been publicly skeptical of international organizations, with the Polish president worrying European Union diplomats with some fractures he is causing in Poland's relationship with the union. And local media have been reporting that <mark>Duda</mark> and his conservative Law and Justice Party promised people close to Trump sizable crowds for Trump's visit, particularly for his speech to the Polish people at the Warsaw Uprising Monument, a memorial in honor of Poles who rose up to fight Nazis in 1944. Even though relations with Poland have changed since Reagan, Republicans in particular have long viewed the former Soviet bloc nation as a pro-America haven in Europe, a country that has been welcoming to Republicans at times of relative unpopularity around the continent. Top White House aides said ahead of Trump's trip to Poland that the President plans to highlight the United States' ties to the country. \"The main message is that America is with you, America understands that its interests align with the interests of the Polish people, and we are determined to do our best to work together on our common priorities and our common interests,\" H.R. McMaster, Trump's national security adviser, said about his visit. Polish leaders said ahead of Trump's visit that now is the time for solidarity against Russia. \"President Donald Trump's visit to Poland is in my opinion truly taking place at a crucial moment in history. The threat that Russia poses cannot be overstated,\" said Polish Ambassador to the US <mark>Piotr Wilczek</mark>. \"Now is the time for allied solidarity and President Trump's decision to visit Poland so early in his presidency underscores the importance of our region to the US administration and the transatlantic community as a whole,\" he added. Nixon to Romney Every president since Richard Nixon--except for Reagan--has visited Poland, a feat not many European countries can boast. Nixon became the first US president to visit Poland when he traveled to Warsaw in 1972. The two-day visit was extraordinary for the Polish people, who lined the streets of Warsaw with signs like \"Nixon rescue Poland .\" By traveling to the then-communist nation, Nixon became the first president since Franklin D. Roosevelt to visit a country behind the Iron Curtain. It was Reagan's support of Solidarity, the anti-bureaucratic labor union founded by Lech Walesa in 1980, that truly won early support for American Republicans in Poland. George H.W. Bush's trip in 1989, including a speech to the Polish National Assembly, was a seminal moment for US-Polish relations. Bush met with Walesa on the trip, but his greatest contribution may have been how he modeled a different style of politics to the Polish people. Poles were fascinated at the difference between Bush and their old Soviet leaders when photos emerged of the American president running through Łazienki Park in Warsaw. President George W. Bush continued to foster a relationship with Poland during the Iraq and Afghanistan wars, where Polish soldiers participated in both missions. Bush traveled to Poland three times in his eight years as president. During a presidential debate against Democratic Sen. <mark>John Kerry</mark>, Bush even held Poland up as an example of his ability to build a coalition around the war in Iraq. \"Well, actually, he forgot Poland,\" Bush said at one point. Republican presidential nominee Mitt Romney visited Poland during the 2012 presidential election. \"Our nations belong to the great fellowship of democracies. We speak the same language of freedom and justice,\" Romney said during his visit. \"I believe it's critical to stand by those who have stood by America .\" Changing times Though Poland participated in the Iraq and Afghanistan wars, the conflicts grew unpopular over time. Only 58% of Poles polled in the Pew Research Global Attitudes and Trends survey released at the end of the Obama administration said they believed he would do the right thing regarding world affairs. Trump's rating is a dismal 23%. Apprehension toward the United States could also be associated with <mark>Duda</mark>'s nationalist rise. <mark>Duda</mark> has some refugee requirements imposed by the European Union, signaling he and his party will be skeptical of lawmakers in Brussels and more interested in their own success. <mark>Wilczek</mark>, Poland's ambassador to the United States, told reporters that the country remains committed to the North Atlantic Treaty Organization, especially because of Article 5, the principle that an attack on one NATO country is an attack on all NATO countries. \"We would like to hear that every day from the President of the United States and from actually leaders of all other NATO countries,\" he said. \"As far as Russia is concerned, what is important for us in NATO deterrence .\" Trump, McMaster said, will highlight Poland's historic ties to the United States and herald the country as one of America's \"staunchest allies .\" During his visit, the President is also expected to tout recent sales of liquified natural gas to Poland, highlighting the need for a Poland that is energy independent from Russia. \"It is a country that has partnered with us and had been a great ally during combat missions in Afghanistan and in Iraq, as well,\" McMaster said. \"And so...the President will emphasize themes about the past, what Poland has gone through as a nation, what they've achieved to fight to be part of Europe .\" 52.229676 21.012229", "articleID": "2017070608_00351785_W", "names": {"Andrzej Duda": ["Q28354405", "Q9151911"], "John Kerry": ["Q22316", "Q6242998"], "John Paul": ["Q1701359", "Q6252169"], "Piotr Wilczek": ["Q51457828", "Q7197024"]}}, {"date": "2017-07-06", "url": "http://au.news.yahoo.com/a/-/world/36294146/improved-walsh-second-in-lausanne-shot-put/", "content": "NZ Newswire on July 7, 2017, 6:10 am Share Tweet Whatsapp Email Share Improved <mark>Walsh</mark> second in Lausanne shot put - Yahoo7 Pinterest Tumblr New Zealand's <mark>Tom Walsh</mark> has unleashed a season-best throw at the Diamond League meet in Lausanne but it wasn't enough to topple American arch-rival Ryan Crouser. Olympic bronze medallist <mark>Walsh</mark> placed second with an impressive 21.97 m while compatriot Jacko Gill was eighth in a 10-man field with his 20.70 m effort. <mark>Walsh</mark> was happy with his best distance of the year by 17cm, achieved with his opening throw, as he builds towards the world championships in London in August. It was just 24cm short of his personal best and 26cm longer than his previous Diamond League meet effort in May, when he was also beaten by Crouser at the Prefontaine Classic in Oregon. <mark>Walsh</mark> admits Olympic champion Crouser is throwing at a different level after the American won on Thursday with a 22.39 m heave. Four of his throws were better than the Kiwi's best effort. \"I train a lot with Ryan and he almost always is ahead of me,\" <mark>Walsh</mark> said. \"I need to turn the table at some point in time. Who knows? I may do that at the biggest stage .\" Former world junior champion Gill wasn't at his best, having achieved a career-best 21.01 m in January, which was enough to qualify for the world championships. Gill saved his best distance until last after failing to better 20.36 m through his first five throws. Share Tweet Whatsapp Email Share Improved <mark>Walsh</mark> second in Lausanne shot put - Yahoo7 Pinterest Tumblr", "articleID": "2017070620_00660484_W", "names": {"Tom Walsh": ["Q16886418", "Q19586386", "Q19664158", "Q20984602", "Q21061744", "Q2440190", "Q37380700", "Q55362473", "Q7817978", "Q7817979", "Q7817980"]}}, {"date": "2017-07-06", "url": "http://feeds.nydailynews.com/~r/nydnrss/sports/hockey/islanders/~3/m5Iu8IE8GGs/tough-north-korea-choices-regime-arm-article-1.3306797", "content": "Across 25 years and five administrations, we have kicked the North Korean can down the road. We are now out of road. On July 4, North Korea tested an intercontinental ballistic missile apparently capable of hitting the United States. As yet, only Alaska. Soon, every American city. Moreover, Pyongyang claims to have already fitted miniaturized nuclear warheads on intermediate range missiles. Soon, on ICBMs. Secretary of State Rex Tillerson's initial reaction to this game-changer was not encouraging. \"Global action is required to stop a global threat,\" he declared. This, in diplo-speak, is a cry for (multilateral) help. Alas, there will be none. Because, while this is indeed a global threat, there is no such thing as global interests. There are individual national interests and they diverge. In this case, radically. Take Russia and China. If there's to be external pressure on North Korea, it would come from them. Will it? On Tuesday, they issued a joint statement proposing a deal: North Korea freezes nuclear and missile testing in return for America abandoning large-scale joint exercises with South Korea. This is a non-starter. The exercises have been the backbone of the U.S.-South Korea alliance for half a century. Abandonment would signal the end of an enduring relationship that stabilizes the region and guarantees South Korean independence. In exchange for what? A testing freeze? The offer doesn't even pretend to dismantle North Korea's nuclear program, which has to be our minimal objective. Moreover, we've negotiated multiple freezes over the years with Pyongyang. It has violated every one. That Russia and China would, amid a burning crisis, propose such a dead-on-arrival proposal shows that their real interest is not denuclearization. It is cutting America down to size by breaking our South Korean alliance and weakening our influence in the Pacific Rim. These are going to be our partners in solving the crisis? And yet, relying on China's good graces appeared to be <mark>Donald Trump</mark>'s first resort. Until he declared two weeks ago (by tweet, of course) that China had failed. \"At least I know China tried!\" he added. They did? <mark>Trump</mark> himself tweeted out on Wednesday that Chinese trade with North Korea increased by almost 40% in the first quarter, forcing him to acknowledge that the Chinese haven't been helping. Indeed not. The latest North Korean missile is menacing not just because of its 4,000-mile range, but because it is mobile. And the transporter comes from China. In the calculus of nuclear deterrence, mobility guarantees inviolability. (The enemy cannot find, and therefore cannot pre-empt, a mobile missile .) It's a huge step forward for Pyongyang. Supplied by Beijing. How many times must we be taught that Beijing does not share our view of denuclearizing North Korea? It prefers a divided peninsula, sustaining its client state as a guarantee against a unified Korea allied with the West and sitting on its border. Nukes assure regime survival. That's why the Kims have so single-mindedly pursued them. The lessons are clear. Saddam Hussein, no nukes: hanged. Moammar Khadafy, gave up his nuclear program: killed by his own people. The Kim dynasty, possessing an arsenal of 10 to 16 bombs: untouched, soon untouchable. What are our choices? <mark>Trump</mark> has threatened that if China doesn't help we'll have to go it alone. If so, the choice is binary: acquiescence or war. War is almost unthinkable, given the proximity of the Demilitarized Zone to the 10 million people of Seoul. A mere conventional war would be devastating. And could rapidly go nuclear. Acquiescence is not unthinkable. After all, we did it when China went nuclear under Mao Zedong, whose regime promptly went insane under the Cultural Revolution. The hope for a third alternative, getting China to do the dirty work, is mostly wishful thinking. There's talk of sanctioning other Chinese banks. Will that really change China's strategic thinking? Bourgeois democracies believe that economics supersedes geostrategy. Maybe for us. But for dictatorships? Rarely. If we want to decisively alter the strategic balance, we could return U.S. tactical nukes (withdrawn in 1991) to South Korea. Or we could encourage Japan to build a nuclear deterrent of its own. Nothing would get more quick attention from the Chinese. They would face a radically new strategic dilemma: Is preserving North Korea worth a nuclear Japan? We do have powerful alternatives. But each is dangerous and highly unpredictable. Which is why the most likely ultimate outcome, by far, is acquiescence. letters @ charleskrauthammer.com Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2017070700_00583351_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-07-09", "url": "http://autoweek.com/article/monster-energy-nascar-cup/martin-truex-jr-survives-overtime-restart-win-monster-energy", "content": "Martin Truex Jr. had a lead that hovered between 10 and 15 seconds in the closing laps Saturday. Photo by LAT Photographic Martin Truex Jr. survives overtime restart to win Monster Energy NASCAR Cup race at Kentucky Stages dominating performance for third win this season July 9, 2017 Pinterest Email After all was said and done, the dominant car won the race--but not without extreme complications. With just over a lap to go in Saturday night's Quaker State 400 at Kentucky Speedway, Martin Truex Jr. held a lead of more than 15 seconds over second-place <mark>Kyle Larson</mark>, with only eight cars remaining on the lead lap. But before Truex could take the white flag signaling the final lap, the engine in <mark>Kurt Busch</mark>'s Ford expired, dumping oil on the 1.5-mile track. Under the caution, only Truex stayed out, with all other lead-lap cars coming to pit road for fresh tires. \"I thought we were dead,\" Truex said. \"I thought we were done .\" On old rubber and with a hard shove from <mark>Larson</mark>, who lined up behind him in the outside lane, Truex surged past Kyle Busch through the first two corners and held the lead until a wreck behind him at the end of the first overtime lap caused the ninth caution of the night and froze the field with Truex in the lead. The victory completed a perfect night for Truex, who won the first and second stages and then took the checkered flag. The win was Truex's third of the season, his first at Kentucky and the 10th of his career. Truex increased his series-leading playoff point total to 28, 12 more than that of second-place <mark>Jimmie Johnson</mark>. \"It's just...this is completely unbelievable,\" said Truex, who is tied with <mark>Johnson</mark> for the series lead in victories this season. \"I'm so excited to win here. It felt like we had a shot last year and it got away from us on fuel mileage, and (I) just wanted to win here so, so bad after that. This is sweet redemption .\" Before <mark>Kurt Busch</mark>'s engine blew, the green-flag run after the second stage had extended to 100 laps, and the final minutes of the race had only increased Truex's anxiety, despite his colossal lead. \"Worried every lap, waiting for a caution,\" Truex said. \"Especially at the end. You're counting them down--you know, 30, the last 30, the last 20, the last 10 and then you get inside of five, and you're like\" Oh my god, there's no way there's not going to be a caution, and sure enough there was. \"Fortunately (I was) able to hold them off. This thing was just so stout tonight. A good push from <mark>Larson</mark> (on the final restart) helped us a bunch .\" The win was the third of the 2017 season for Truex. Photo by LAT Photographic <mark>Larson</mark> started the race in 40th because his car failed to pass inspection before qualifying. In the first 80-lap stage, he charged forward to the third position but sped on pit road during caution between stages and restarted at the rear of the field on lap 88. Again he charged through the field, and when the cars lined up for the final restart in overtime, <mark>Larson</mark> took advantage of four new tires to grab second place. Even on new rubber, he had nothing for Truex, who led a race-high 152 laps. \"Yeah, I don't know what we could have done to beat him,\" said <mark>Larson</mark>, who retained a one-point lead over Truex in the championship standings. \"He was obviously pretty fast with the lead there. It would have been fun to get to race him, because I felt like I had the second-best car today; and it would have been interesting to get a restart with him earlier and get to hang with him that last run there .\" But we brought the Target Chevy home second after not being able to qualify and having to start last in the race and then having my speeding penalty there. I guess I was just a little too fast leaving my stall and got a penalty. So I've got to clean that stuff up. I'm mad at myself that I made that mistake. I don't really know if it affected the outcome, but you never know. \"Chase Elliott came home third, followed by <mark>Joe Gibbs</mark> Racing teammates Denny Hamlin and Kyle Busch. <mark>Erik Jones</mark>, Truex's Furniture Row Racing teammate, ran sixth, with Jamie McMurray, Joey Logano and Kevin Harvick finishing seventh through ninth, respectively, as the only remaining cars on the lead lap. For <mark>Johnson</mark>, the jinx continued at Kentucky, one of three active tracks at which the seven-time champion hasn't won (the others being Watkins Glen and Chicagoland). On lap 88, after the start of the second stage, Brad Keselowski's No. 2 Ford got loose on the entry to turn three and collected Clint Bowyer's No. 14 Ford. <mark>Johnson</mark> couldn't avoid the wreck in front of him .\" The car felt great, \"<mark>Johnson</mark> said .\" I feel like we were probably in the position for a good top five tonight, with all things considered. But, the No. 2 car (Keselowski) got into the corner and he was sideways before we got there. I feel like the car on the outside of him (Bowyer) left him some room. \"But then, talking to Brad inside (the infield care center), he said he was just sideways before he ever got to the corner. And I thought I almost had him missed. I really thought I had him missed, and I just clipped him with my right front. It broke something in the suspension and took me into the fence .\" Keselowski confirmed the diagnosis after both cars had retired from the race, Keselowski in 38th and <mark>Johnson</mark> in 39th. \"I just wrecked it,\" Keselowski said. \"It stinks. I got loose into (turn) three. I was underneath the 14 (Bowyer). I was trying to lay up and give room but just spun out as soon as I got anywhere near the corner .\" I wrecked myself and a bunch of other guys. It's part of it I guess, but not a part that you have to like. \"The win was the 10th of Martin Truex Jr.'s NASCAR Cup career. Photo by Getty Images for NASCAR Monster Energy NASCAR Cup Series Race Results Quaker State 400 Presented by Advance Auto PartsKentucky Speedway 1. (2) Martin Truex Jr., Toyota, 274. 2. (40) <mark>Kyle Larson</mark>, Chevrolet, 274. 3. (12) Chase Elliott, Chevrolet, 274. 4. (5) Denny Hamlin, Toyota, 274. 5. (1) Kyle Busch, Toyota, 274. 6. (14) <mark>Erik Jones</mark> #, Toyota, 274. 7. (4) Jamie McMurray, Chevrolet, 274. 8. (11) Joey Logano, Ford, 274. 9. (7) Kevin Harvick, Ford, 274. 10. (6) Ryan Blaney, Ford, 273. 11. (17) Darrell Wallace Jr. (i), Ford, 273. 12. (13) Dale Earnhardt Jr., Chevrolet, 273. 13. (16) Clint Bowyer, Ford, 273. 14. (18) Ricky Stenhouse Jr., Ford, 273. 15. (20) Danica Patrick, Ford, 273. 16. (22) Chris Buescher, Chevrolet, 273. 17. (3) Matt Kenseth, Toyota, 273. 18. (9) <mark>Daniel Suarez</mark> #, Toyota, 273. 19. (25) Austin Dillon, Chevrolet, 272. 20. (28) AJ Allmendinger, Chevrolet, 272. 21. (24) <mark>Paul Menard</mark>, Chevrolet, 272. 22. (29) <mark>Ryan Newman</mark>, Chevrolet, 272. 23. (21) <mark>Michael McDowell</mark>, Chevrolet, 271. 24. (26) David Ragan, Ford, 270. 25. (30) Matt DiBenedetto, Ford, 270. 26. (35) Landon Cassill, Ford, 268. 27. (31) * Ryan Sieg (i), Toyota, 266. 28. (33) Reed Sorenson, Chevrolet, 265. 29. (36) Jeffrey Earnhardt, Chevrolet, 265. 30. (15) <mark>Kurt Busch</mark>, Ford, Engine, 264. 31. (38) * Timmy Hill (i), Chevrolet, 261. 32. (37) * BJ McLeod (i), Chevrolet, 260. 33. (27) Ty Dillon #, Chevrolet, 253. 34. (32) Cole Whitt, Chevrolet, Engine, 212. 35. (39) * Gray Gaulding #, Toyota, 207. 36. (34) Joey Gase (i), Toyota, Accident, 129. 37. (19) Trevor Bayne, Ford, Accident, 101. 38. (23) Kasey Kahne, Chevrolet, Accident, 93. 39. (10) Brad Keselowski, Ford, Accident, 89. 40. (8) <mark>Jimmie Johnson</mark>, Chevrolet, Accident, 87. Average Speed of Race Winner: 138.604 mph. Time of Race: 2 Hrs, 57 Mins, 55 Secs. Margin of Victory: Caution. Caution Flags: 9 for 39 laps. Lead Changes: 9 among 4 drivers. Lap Leaders: Kyle Busch 1-28; M. Truex Jr. 29; Kyle Busch 30-67; M. Truex Jr. 68-87; Kyle Busch 88-133; M. Truex Jr. 134-163; J. Logano 164-170; M. Truex Jr. 171-225; D. Earnhardt Jr. 226-228; M. Truex Jr. 229-274. Leaders Summary (Driver, Times Lead, Laps Led): M. Truex Jr. 5 times for 152 laps; Kyle Busch 3 times for 112 laps; J. Logano 1 time for 7 laps; D. Earnhardt Jr. 1 time for 3 laps. Stage #1 Top Ten: 78,18,42,4,1,20,11,77,48,24 Stage #2 Top Ten: 78,18,20,4,77,1,41,11,14,24", "articleID": "2017070905_00663518_W", "names": {"Daniel Suarez": ["Q1162833", "Q16302254"]}}]