[{"articleID": "2012050810_00102304_W", "names": {"Greg Abbott": ["Q5605224", "Q5605225"]}, "date": "2012-05-08", "url": "http://bbc.co.uk/sport/0/football/17991140", "content": "carlisle release craig curran and stephen o'halloran carlisle united are to release former aston villa defender stephen o'halloran and striker craig curran when their contracts expire this summer. was restricted to just five appearances this season due to a knee cartilage injury following his arrival from coventry in june 2011. curran, 22, scored eight goals in 69 games following his move to brunton park in the summer of 2010. \"they leave with our very best wishes,\" boss <mark>greg abbott</mark> told the club website. he added: \"both lads have worked hard and they've been a pleasure to have around .\" "}, {"articleID": "2013050201_00004253_W", "names": {"Linda Smith": ["Q16885749", "Q3241375", "Q435239", "Q57744472"], "Matthew Brown": ["Q16205624", "Q22323679", "Q3852260", "Q38801557", "Q48869864"]}, "date": "2013-05-01", "url": "http://www.crestviewbulletin.com/news/community/guardian-ad-litem-remembers-needy-children-with-ceremony-1.135845", "content": "CRESTVIEW - The Guardian Ad Litem in Crestview on Sunday remembered needy, unrepresented children with a ceremony at Twin Hills Park. Guardian Ad Litem is a government-assisted, volunteer-based organization that speaks for children moved from their homes due to courtroom intervention. These children, who have been abused, neglected or abandoned, are often removed from a toxic environment and placed into care of others. Carita <mark>Smith</mark>, the Crestview Guardian Ad Litem program's volunteer coordinator, hosted the event. The goal was to encourage more people to volunteer for the program. \"We have lots of volunteers and I appreciate them,\" <mark>Smith</mark> said during the ceremony. \"But right now, we have over 200 (children) without Guardian Ad Litem. So that means those children get up and have nobody to speak on their behalf and have nobody to visit them and nobody to make sure they are not hurt, harmed or endangered again .\" A basket with 201 flowers was placed inside a lookout pavilion overlooking a pond at the park. Following the service, attendees tossed flowers into the pond in remembrance of children without representation. Additionally, area judges and program directors spoke and there were performances from the Macedonia Missionary Baptist Church children's choir, Jeilani Champion and Dr. <mark>Linda Smith</mark>. \"Doing from my heart' Crestview resident Malcolm Parker said Sunday's event taught him a lot about the issue .\" It opened my eyes a little bit, \"he said .\" You don't always pay attention to what's going on with the children in the community. \"Parker said he's considering volunteering and wants to help spread the word. Tammy Hillsman, who has worked with Guardian for the past eight months, said she enjoys speaking on the children's behalf .\" I just want to be there because whatever situation we step in to, it's a tragedy from the very beginning, \"she said .\" I'm basically there to help them get through it. \"Hillsman said she is working on two cases involving four children. On average, she handles two cases at a time, she said. The workload is never a burden, she said .\" They try not to overwhelm you; they start you off slow \"Hillsman said. And it's fulfilling, she said .\" I'm doing from my heart - I don't want to get paid for it, \"Hillsman said .\" I'm just doing it for those children. \"Want to volunteer? Prospective Crestview Guardian Ad Litem volunteers can call 689-5060. Learn more about the program at guardianadlitem.org. Contact News Bulletin Staff Writer <mark>Matthew Brown</mark> at 850-682-6524 or matthewb @ crestviewbulletin.com. Follow him on Twitter @ cnbMatthew."}, {"articleID": "2017110715_00978773_W", "names": {"Stefan Keller": ["Q1544422", "Q2336676", "Q2336682", "Q7606155"]}, "date": "2017-11-07", "url": "http://www.dailygalaxy.com/my_weblog/2017/11/the-alien-observatory-life-may-have-been-in-existence-for-13-billion-years-early-universe-functioned.html#comments", "content": "The Alien Observatory--\"Life May Have Been in Existence for 13 Billion Years--Early Universe Functioned as an Incubator Soon After the Big Bang\" (WATCH Video) November 07, 2017 How long has there been life in the Universe? Perhaps some thirteen billion years. Harvard Astrophysicist, Avi Loeb speaks on the surprising habitability of planets in the early Universe far earlier than the creation of the Milky Way. Surprisingly, temperatures in the early cosmos were similar to those on Earth today. The cosmological conditions for life were in place far earlier than commonly thought. The NASA image at the top of the page shows one of the first stars, which formed around 13.7 billion years ago. The discovery was made by lead researcher <mark>Stefan Keller</mark> of The Australian National University and the results were published in Nature. Dr. <mark>Keller</mark>'s team operates the SkyMapper telescope at the Siding Spring Observatory in New South Wales. Because elements heavier than helium are forged in the cores of stars, the first ones were made mostly out of hydrogen. The telescope is able to detect these first stars because the low iron content influences their color. Using this technique to find early stars, the SkyMapper is currently in a 5-year-long survey, mapping the ancient Southern sky. This star formed so early in our Universe's history, was most likely a second-generation star. Because of the chemical composition, astronomers can gather information about the earlier primordial star, which is believed to be 60 times more massive than our sun and composed of hydrogen and helium. Click Here to Launch Your Day With The Daily Galaxy - Great Discoveries Channel - Free Email Delivery Recent Most Viewed: \"Still a Mystery\" --Huge Elliptical Galaxy Observed Missing a Central Supermassive Black Hole The Alien Observatory--\"It's Astonishingly Likely That We're Not the Only Time and Place That an Advance Civilization Has Evolved\" (VIDEO) This Week's \"Planet Earth Report\" --Terrifying Quark Discovery to Edward Snowden's Alien Contact Theory \"Destroyer of Cancer Cells\" --Iridium from the Chicxulub Asteroid 66-Million Years Ago that Ended the Dinosaur Epoch \"We Exist in a Cyclical Universe\" --Chinese Scientists Measure Cosmic Expansion With a \"Magic Ruler' The Extraterrestrial Mirror--\"There's a Level of Predictability to Evolution that Aliens Would Look Like Us\" NASA Reveals Record-Breaking Results of \"Sci-Fi\" Ion Engine--\"Manned Missions to Mars On the Horizon In Weeks\" (WATCH Video) \"It Came From Outer Space\" --Mystery of First Interstellar Object Ever Observed in Our Solar System Posted on November 07, 2017 at 07:55 AM | Permalink | Comments (0) | | |"}, {"articleID": "2018030316_00247880_W", "names": {"James Anderson": ["Q1398542", "Q1679949", "Q21516191", "Q2419972", "Q27887229", "Q27887279", "Q30066238", "Q43395084", "Q43912040", "Q5652449", "Q58385467", "Q6128699", "Q6128708", "Q6128711", "Q654375"], "Angus Fraser": ["Q19325047", "Q4764116", "Q4764119"]}, "date": "2018-03-04", "url": "http://www.taipeitimes.com/News/sport/archives/2018/03/04/2003688648", "content": "T20 leaves sport facing testing times AFP, LONDON \"In this ultra-modern age counter attractions have multiplied many times since my youthful days,\" a former England batsman wrote, as he questioned whether teenagers had the time to \"devote to cricket .\" That the former international was Herbert Sutcliffe and he was writing in a pamphlet following England's defeat in the 1950-1951 Ashes series. It shows that worrying about the future of cricket, and English cricket in particular, is nothing new. However, whereas Sutcliffe was concerned by ice skating and greyhound racing taking people away from cricket, the worry now is about how one type of cricket--Twenty20 (T20) franchise leagues--could spell the end of another in five-day Tests. The recent decisions of England internationals Adil Rashid and Alex Hales to sign \"white-ball\" only county contracts--a red ball is used in traditional first-class matches--this season, thereby opting out of Test contention, heightened these concerns. Rashid and Hales have not played a Test since 2016, but the worry for some is that, without a major alteration to cricket's congested schedule and a change in spectator habits--Tests outside of England and Australia often draw paltry crowds--their example might be followed by that of more high-profile cricketers. Jonny Bairstow, a Yorkshire and England teammate of Rashid, is alive to the danger, although the wicketkeeper remains committed to continuing his Test career. \"If we're not careful, there are going to be more and more people [giving up red-ball cricket],\" said Bairstow, who is on tour with England in New Zealand. \"You've got lucrative tournaments...[to] go off for five weeks and earn a heck of a lot of money...[with] the strain and stress on the body of bowling [only] four overs compared to 24 in a day in Test cricket,\" he said. Bairstow's thoughts were echoed by Test colleague <mark>James Anderson</mark>, with England's all-time leading Test bowler adding: \"I just hope and pray there is enough love for Test cricket out there, not just the players that are playing at the moment, but players coming through still having the ambition and drive to play Test cricket in the future .\" Bairstow and <mark>Anderson</mark> grew up in an environment where the most reliable way for cricketers to maximize their income was to become an established Test player, as this would lead to a larger wage packet and enhanced opportunities for sponsorship deals. To gain Test selection, players would have to take part in domestic first-class competitions such as England's County Championship or Australia's Sheffield Shield. However, the advent of the Indian Premier League (IPL) and other T20 franchise events has created an environment where it is now possible to make major money, in cricket terms, without playing Tests. For example, England all-rounder Ben Stokes was bought for ￡ 1.37 million (US $1.89 million) by the Rajasthan Royals during January's IPL auction. By offering specialist \"white-ball,\" as well as Test, central contracts in a bid to improve England's woeful record at major global limited-overs tournaments, the England and Wales Cricket Board might have inadvertently made it easier for players to turn their backs on the first-class game. \"You always want your best players playing as much high-quality cricket as you can,\" England selector <mark>Angus Fraser</mark> said on Friday."}, {"articleID": "2010101205_00241860_W", "names": {"Phil Williams": ["Q20774381", "Q26899389", "Q50328322", "Q55940265", "Q7182552", "Q7182553", "Q7182554", "Q7182556"]}, "date": "2010-10-12", "url": "http://bbc.co.uk/programmes/b00v6dpm/microsite", "content": "bbc - bbc radio 5 live programmes - 5 live breakfast @ import url (/ 5live/style/global-layout. css); @ import url (/ 5live/style/global-decor. css); british broadcasting corporation home accessibility links text only skip to content skip to local navigation skip to bbc.co.uk navigation skip to bbc.co.uk search help accessibility help now on air - 5 live breakfast webcam listen live less 06:00 - 09:00 call 0500 909 693 text 85058 cost info email breakfast @ bbc.co.uk next on air 09:00 5 live breakfast view full schedule home programmes schedule news sport life podcasts breakfast weekdays 06:00 - 10:00 home get in touch about nicky campbell about shelagh fogarty facebook page bbc radio 5 live programmes 5 live breakfast 5 live breakfast 5 live's breakfast programme with news, sport, weather and money reports. programmes: on bbc iplayer (48) clips (2) coming up (13) previous programmes: by series (2) by year (1493) available now on bbc iplayer listen to the latest programme your call 11/10/2010 more: programme information listen now (60 minutes) available since yesterday with 6 days left. how much should students have to pay to go to university? with shelagh fogarty. also available 11/10/2010 more: programme information clips listen now (180 minutes) available since yesterday with 6 days left. the 7/7 inquest begins. with <mark>phil williams</mark> and shelagh fogarty. your call 08/10/2010 more: programme information listen now (60 minutes) available since friday with 3 days left. \"if someone wants to have a go, then i'm up for it .\" how do we stop football hooligans? 08/10/2010 more: programme information clips listen now (180 minutes) available since friday with 3 days left. nicky and shelagh discuss football hooliganism, the new shadow cabinet and toxic sludge. your call 07/10/2010 more: programme information listen now (60 minutes) available since thursday with 2 days left. should people on benefits take responsibility for the number of people they have? see all 48 programmes available now. clips (2) breakfast editor scott solder (00.34) about nicky and shelagh (02.32) coming up on air now 12/10/2010 <mark>phil williams</mark> and shelagh fogarty, with lord browne's tuition fee proposals. listen live on bbc radio 5 live (started at 06:00) see all 13 programmes coming up. podcast 5 live breakfast: your call links 5 live breakfast on facebook (www.facebook.com) more from bbc radio 5 live genre: news format: bulletins dab radio mobile podcasts digital tv online search term: bbc.co.uk navigation news sport weather iplayer tv radio more...a to f cbbc cbeebies food h to le health history learning lo to z nations & local music science & nature popular links merlin strictly full a-z of bbc sites back to start of navigation bbc links about the bbc bbc help contact us accessibility help terms of use jobs privacy & cookies © mmx the bbc is not responsible for the content of external sites. read more. this page is best viewed in an up-to-date web browser with style sheets (css) enabled. while you will be able to view the content of this page in your current browser, you will not be able to get the full visual experience. please consider upgrading your browser software or enabling style sheets (css) if you are able to do so."}, {"articleID": "2009031413_00024400_W", "names": {"Stan Lee": ["Q16194157", "Q181900", "Q7597756"], "Scott Hamilton": ["Q1379356", "Q16244026", "Q2289971", "Q729950"], "Tom Green": ["Q25189666", "Q315826", "Q48816071", "Q7815997", "Q7815998", "Q7815999", "Q7816000", "Q998064"], "Adam Lambert": ["Q190231", "Q30310741"], "Rob Nicholson": ["Q1566929", "Q600859"], "Robert Brooke": ["Q52848187", "Q7342387"]}, "date": "2009-03-14", "url": "http://wellandtribune.ca/ArticleDisplay.aspx?e=1479191", "content": "this week's highlights and lowlights of reality tv the celebrity apprentice what kind of a superhero name is eee? you don't have to be <mark>stan lee</mark> to know a spandexed saviour with a name so lame couldn't be trusted to get your cat down from a tree--never mind rescue the world. but men's team (kotu) project manager <mark>scott hamilton</mark> was pretty proud of himself for coming up with the moniker when the teams were asked to create a comic-book character representing zappos.com. the women's team (athena) won their second challenge with heroine z, and, after a brief boardroom brawl with <mark>tom green</mark>, <mark>hamilton</mark> was promptly eee-liminated. the amazing race you don't know how many racers i wanted to shake this week and say, \"chekhov, damnit! it's chekhov!\" unscrambling the letters cohkehv to form the name of the most obvious russian playwright ever was like rocket science to these people. while in siberia, the teams also had to build shutters or pile firewood--though amanda and kris had to do both, since margie and luke u-turned them so they'd finish last, instead of the cheerleaders luke is crushing on (kara and jaime). it worked. dancing with the stars a jackass! the bachelor \"sex-fiancee! a real live playmate! with more cleavage and baggage than ever before, season 8 ofdwtswas a gong show before it even hit the hardwood. in fact, jewel and nancy o'dell hit the floor so hard before tuesday's premiere, they were replaced last-minute bygirls next doorstar (and hef's ex) holly madison and freshly dumped bachelorette melissa rycroft--the latter of which rocked her waltz after three days of rehearsal. to quickly recap: ex-con lil' kim aced her first cha-chachallenge, belinda carlisle must go-go home, sex and the citymovie hunk gilles marini is hot hot hot! and it was even more painful to watch steve-o waltz than it was to see him snort wasabi injackass. american idol what--kris allen is married? i swear i heard teenage girls' hearts across america shatter when the southern cutie's wife appeared in his video .\" i'm not sure i would have brought the wife out so early, \"simon said. agreed. continued after advertisement below other disappointments on idol's first michael jacksonthemed show include anoop desai's karaoke take onbeat it, jasmine murray's cheesyi'll be thereand <mark>adam lambert</mark>'s ridiculous hair. the biggest loser: families relapse alert! hungry losers + upscale restaurant = bad news. after winning a luxury challenge, the black team ate a fancy (read: fattening) meal complete with double tequila shots and paid for it bigtime in the gym and at the weigh-in, where they lost a combined total of 18 pounds. that was enough to beat the blue team, which is so totally not fair. project runway canada post-it notes are good for many things, and making dresses was never one of them--until this week, when the prc designers came up with some fab paper frocks. jessica's pink-and-yellow creation won, and will be auctioned off for the canadian breast cancer foundation; while jason didn't measure up because his looked just like, well, post-its. american idol well, you can already toss two of those predictions i made earlier this week out the window. jasmine murray and jorge nunez--who i thought would stick around for awhile--were canned on wednesday's double-elimination. and even though a new rule where the judges have one chance this season to save a contestant from elimination is in effect, it didn't apply. america's next top model it was makeover week, meaning all the girls with short hair got extensions, and all the girls with long hair got pixie cuts. fo was this season's complainer, after a hairstylist cropped her locks and stole her femininity. hasn't she ever watched this show before? if they chop your hair, it means the tyra likes your cheekbones. fo's bad attitude landed her in the bottom two, but jessica's cocky attitude had her packing. survivor: tocantins quote of the week:\" let's find that tooth. you're going to want that tooth. \"thank you, jeff probst--who was determined to find the piece of tooth that j. t. tossed into the water while he was more focused on trying to win the immunity challenge for his tribe. the tooth was found, but j. t.'s jalapao lost--and decided to vote out spencer for not being useful enough. he didn't even get a chance to come out of the closet. federal justice minister and niagara falls mp <mark>rob nicholson</mark> will be the special guest speaker as the stamford kiwanis celebrate 50 years of service to is the recent economic turmoil a terrible crisis for investors, or a terrific opportunity? patrick baichoo and <mark>robert brooke</mark> will be at the centennial the library barrels towards one of the busiest weeks of the year! this year's march break features hands-on and entertainment activities for children from brock u - c! rca: 46 circus acts in 45 minutes - march break a hip and humorous, fast and furious, stamford kiwanis the stamford kiwanis club meets each monday at 6:30 p.m. at the best western cairn croft on lundy's lane .\" flying into spring \"saturday april 25th, 2009, royal canadian legion, 383 morningstar, welland' @ st. catharines public library - easter egg hunt contest (ages 11 and under)' @ st. catharines public library - job and career searching online"}, {"articleID": "2014123101_00044247_W", "names": {"Chris Hardwick": ["Q15844590", "Q313049", "Q3675502", "Q5106780"]}, "date": "2014-12-31", "url": "http://www.movieweb.com/spider-man-3-sam-raimi", "content": "\"Saturday Night Live: Amy Adams/One Direction' Dr. Evil Cold Open\" Star Wars Rebels: Path of the Jedi' Yoda Contacts Kanan \"The Carbonaro Effect: Just A Milker' Milking Almonds Revealed Sam Raimi Says\" Spider-Man 3' Is Awful Gillian Greene directed. While there, he also reflected on the critically-panned 2007 sequel Spider-Man 3. Despite being drubbed by critics and fans alike, the director was initially slated to return for Spider-Man 4, before the studio decided to reboot the franchise once again with 2012's The Amazing Spider-Man and this year's The Amazing Spider-Man 2 Spider-Man 3, the director opened up, and revealed that trying to raise the stakes after the beloved Spider-Man 2 was what \"doomed\" the sequel, which he admits is \"awful .\" \"It's a movie that just didn't work very well. I tried to make it work, but I didn't really believe in all the characters, so that couldn't be hidden from people who loved Spider-Man. If the director doesn't love something, it's wrong of them to make it when so many other people love it. I think [raising the stakes after Spider-Man 2] was the thinking going into it, and I think that's what doomed us. I should've just stuck with the characters and the relationships and progressed them to the next step and not tried to top the bar. I think that was my mistake. [But] directors don't like to talk about their bad films .\" When host <mark>Chris Hardwick</mark> added that he didn't think \"bad\" was the right word for Sam Raimi added that the sequel was \"awful .\" The filmmaker was also asked if he had the chance to make Spider-Man 3 again, would he? The director said he would, although he would have to care about the characters. \"I wouldn't make that movie. If I had a different story with characters that I cared about and was engaging, yes, in a second. I love Spider-Man. That was never the issue, just that I made the wrong story, the wrong way. That's everything .\" Co-host Matt Mira also complimented the filmmaker on his last film, Oz: The Great and Powerful, which he didn't seem too happy with either. Spider-Man 3? Do you think the filmmaker should be given another crack at the Spider-Man franchise? Chime in with your thoughts below. \"Evil Dead' Director Fede Alvarez Confirms Sam Raimi Will Direct\" Army of Darkness 2' Sam Raimi Says \"Spider-Man 3' Is Awful\" Shaun of the Dead' Live Stage Show Trailer \"Into the Woods' Music Featurette with Anna Kendrick\" The Interview' Is Youtube's Best Selling Movie of 2014 \"Avengers: Age of Ultron' LEGO Comic Shows an Epic Battle GIVEAWAY: Win\" Woman in Black 2 Angel of Death' Prizes \"Avengers 2' Art Reveals Vision and Ultron Origin Details\" Independence Day 2': Is Randy Quaid Set to Return? Will the \"Ghostbusters' Reboot Be Rated R? Sylvester Stallone Confirms\" Rambo 5: Last Blood' Title?"}, {"articleID": "2016070714_00807122_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-07-07", "url": "http://kcbd.com/story/32388728/warning-for-children-surfing-the-web-this-summer", "content": "Warning for children surfing the web this summer - KCBD NewsChannel 11 Lubbock Warning for children surfing the web this summer - KCBD NewsChannel 11 Lubbock Member Center: Warning for children surfing the web this summer 2016-07-07T03:03:51 ZSource: KFDA NewsChannel 10Source: KFDA NewsChannel 10 AMARILLO, TX (KFDA) - Just like when we were told not talk to strangers as children, the same can be said online. In the ever-changing online world, it's possible for kids to come across something or someone that could do them harm. Police say it happens far too often and want parents to be more aware. Facebook, SnapChat, Instagram and Twitter are used multiple times every day. Kids are social and are using these apps and sites to share with each other. \"I think there's so many things out there now,\" said local parent, Craig Vaughn. \"When I was growing up all we had were encyclopedias. That was about all the technology we had .\" Vaughn has two kids, one of them a teenage girl who he tries to protect from potential online predators. \"Our computer is in the living room. If you wannause the main computer or lab top, it's in the living room,\" said Vaughn. \"So, everybody knows what you're doing .\" But the hardest thing to monitor are the smart phones. \"The kids have the computer in their pocket. You can't put it in a room where you can supervise them,\" said Sergeant Brent Barbee with the Amarillo Police Department. \"So, protecting them from predators and bad influences online has become more difficult .\" Barbee says the first step in protection starts with the parent. \"Sitting down with the children and having some really clear, frank discussion about ground rules,\" said Barbee. \"Rules like don't go to websites that other people tell you about, don't have contacts or conversations with people that you don't know in real life .\" Teach children to be smart while online--share with caution, that goes for pictures and details about their life. \"So often, very small things can turn into a lot of threat for a kid,\" said Barbee. Barbee also says parents should teach kids to be nice to others online and if your kids have a cell phone, know their apps. Check their privacy settings and make sure their information doesn't get in the wrong hands. All good advice for parents just like Vaughn. \"You might be saving your kid from big problems in the future,\" said Vaughn. Parents should also check the ratings and reviews of video games kids are playing. If they chat with other players online, make sure the child knows not to give out personal information. Copyright 2016 KFDA. All rights reserved. Local News on KCBD.com NewsMore>> Thursday, July 7 2016 10:04 AM EDT2016-07-07 14:04:31 GMTUpdated: Thursday, July 7 2016 10:04 AM EDT2016-07-07 14:04:31 GMT <mark>Donald Trump</mark> is paying his first visit to rank-and-file congressional Republicans, appearing Thursday morning at closed-door meetings of the House and Senate GOP caucuses. <mark>Donald Trump</mark> pledged adherence to basic Republican Party goals Thursday as he sought to win over rank-and-file GOP lawmakers skeptical he can beat Democrat Hillary Clinton in the fall. Thursday, July 7 2016 12:58 AM EDT2016-07-07 04:58:27 GMTUpdated: Thursday, July 7 2016 9:46 AM EDT2016-07-07 13:46:28 GMT A Facebook Live video captured the chaotic aftermath of the fatal police shooting of Philando Castile in Minnesota. As word of the shooting spread, protestors gathered at the governor's mansion in St. Paul, chanting, \"No justice, no sleep .\" A Facebook Live video captured the chaotic aftermath of the fatal police shooting of Philando Castile in Minnesota. As word of the shooting spread, protestors gathered at the governor's mansion in St. Paul, chanting, \"No justice, no sleep .\" Thursday, July 7 2016 9:38 AM EDT2016-07-07 13:38:53 GMT (Source: KCBD Graphic) Lubbock police will be closing northbound I-27 between 19th Street and the Marsha Sharp Freeway on Thursday to conduct an investigation regarding a crash that happened on Monday night. Lubbock police will be closing northbound I-27 between 19th Street and the Marsha Sharp Freeway on Thursday to conduct an investigation regarding a crash that happened on Monday night. Thursday, July 7 2016 9:13 AM EDT2016-07-07 13:13:36 GMT (Source: KCBD) A U.S. Air Force Airman from the 27th Special Operations Wing was found dead in his Clovis home around 2:45 p.m. July 6. A U.S. Air Force Airman from the 27th Special Operations Wing was found dead in his Clovis home around 2:45 p.m. July 6. Thursday, July 7 2016 6:44 AM EDT2016-07-07 10:44:26 GMTUpdated: Thursday, July 7 2016 6:44 AM EDT2016-07-07 10:44:26 GMT By The Associated Press Your daily look at late-breaking news, upcoming events and the stories that will be talked about today: By The Associated Press Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:"}, {"articleID": "2018050413_00238258_W", "names": {"Jeff Anderson": ["Q1140895", "Q26899394", "Q29167254", "Q50239827", "Q6173216", "Q6173217"]}, "date": "2018-05-04", "url": "https://www.mprnews.org/story/2018/05/04/vikings-bow-to-neighbors-to-turn-off-lights-at-night", "content": "Vikings team bows to neighbors, to turn off lights at night Sports & Leisure The Associated Press · Eagan · May 4, 2018 The Minnesota Vikings' new practice facility in Eagan, as seen while it was under construction Oct. 23, 2017. Courtney Perry for MPR News 2017 The Minnesota Vikings are turning off the lights at the team's new practice facility in Eagan after neighbors complained about the glow. Spokesperson <mark>Jeff Anderson</mark> says the NFL team will turn off the lights between 11 p.m. and 6 a.m.. The shut-off time will be moved to about midnight when the team hosts night events such as high school games. • Soccer: Stadium's skeleton nearly complete. Next: translucent skin for Allianz Field The team moved into the new building in March. The building's north side is nearly 100 feet high and is lit up with the team's Norseman logo and the words \"Twin Cities Orthopedics Performance Center--Home of the Minnesota Vikings .\" Mendota Heights residents complained about the lights last month. <mark>Anderson</mark> says the team is \"listening to the community .\" The team expects the change to occur this weekend. The news on your schedule from MPR News Update Email Address *"}, {"articleID": "2011070900_00035468_W", "names": {"Carlos Morales": ["Q16190856", "Q18085289", "Q3660094", "Q47472055", "Q5042401", "Q5042402", "Q5042404"], "Peter Anderson": ["Q17708719", "Q19325109", "Q19662623", "Q21004824", "Q22003142", "Q24844378", "Q2778476", "Q28051640", "Q2844153", "Q47546025", "Q53548176", "Q55938616", "Q59200502", "Q7172518", "Q7172522"]}, "date": "2011-07-09", "url": "http://ktre.com/story/15050406/feds-wont-fight-bankruptcy-by-married-gay-couples", "content": "nolan ryan says fan's widow worried about son feds won't fight bankruptcy by married gay couples shuttle lifts off for last time; \"light this fire' weak hiring casts doubts on strength of rebound gunman often resorted to violence, made threats apnewsbreak: bp wants to end future loss claims grim jobs report casts shadow over debt talks ex-cameron aide arrested in uk hacking scandal unemployment rose to 9.2 percent in june, us employers added only 18,000 jobs weak hiring casts doubts on strength of rebound unemployment rose to 9.2 percent in june, us employers added only 18,000 jobs obama: uncertainty over debt limit impacts hiring casey anthony sentenced mostly to time served for lying to police, will go free wednesday talks: inflation change could cut social security new inflation gauge could cut social security colas, raise taxes most on low-income workers storms, lightning threaten final shuttle launch casey anthony given maximum sentence after conviction for lying to police in death of daughter casey anthony will get credit for time served with the space shuttles retiring, houston has a problem: what becomes of space city? by lisa leff associated press san francisco (ap) - federal officials no longer plan to contest joint bankruptcy pleadings brought by legally married same-sex couples, a department of justice spokeswoman said friday. the obama administration's recent position is that the federal law forbidding government recognition of same-sex unions is unconstitutional. justice department spokeswoman tracy schmaler said government lawyers decided this week that letting gay and lesbian couples jointly petition for bankruptcy protection is consistent with that stance .\" the department of justice has informed bankruptcy courts that it will no longer seek dismissal of bankruptcy petitions filed jointly by same-sex debtors who are married under state law, \"schmaler said. the shift stems from a case involving two california men who got married when it was briefly legal in 2008 before the state's voters passed a constitutional amendment banning same-sex marriages. a u.s. bankruptcy trustee initially fought gene balas and <mark>carlos morales</mark>' shared chapter 13 bankruptcy plan on the grounds that the federal defense of marriage act prohibited it. but 20 of the 24 bankruptcy judges in los angeles took the unusual step of disagreeing and ruled last month that the act violated the couple's civil rights. trustee <mark>peter anderson</mark> subsequently appealed, maintaining president barack obama had ordered government lawyers to defend the ban\" unless and until \"congress repeals the act or there is a final judicial ruling striking it down. but <mark>anderson</mark> withdrew his objections in a written filing wednesday. he noted that even a u.s. house of representatives group that has stepped in to defend the marriage act's constitutionality in other cases had decided against taking part in <mark>morales</mark> and balas' case .\" in light of the decision by the (bipartisan legal advisory group) not to participate in this appeal and the availability of other judicial fora for resolution of the constitutional question, the united states trustee has determined that it is not a necessary or appropriate expenditure of the resources of this court and the parties to continue to litigate the appeal, \"<mark>anderson</mark>'s office wrote. even before the justice department arrived at its position this week, another bankruptcy trustee in san diego already had cited the administration's decision to stop defending the defense of marriage act in a request to withdraw her opposition to the bankruptcy pleading of another married gay couple. the department's change in policy already has provided the basis for the government to drop its opposition to an attempt by a same-sex couple to seek joint bankruptcy protection in new york state .\" by having the department change its policy nationwide in response to gene and <mark>carlos</mark>' case, we basically accomplished what it would normally take a supreme court ruling to achieve, \"robert pfister, a lawyer for the los angeles couple. balas, 42, a freelance economics writer, and <mark>morales</mark>, 46, a graphic designer, said friday that having the government recognize their marriage for purposes of declaring bankruptcy has practical and profound implications. they will not have to pay extra court fees to file separate petitions, nor go through the exhausting task of trying to untangle their financial lives, which include joint bank accounts, joint debts and jointly owned real estate. he said, however, that as long as the defense of marriage act and state-level same-sex marriage bans remain in effect, he and his husband are not truly equal. when he was considering taking a job in another state, for instance, he had to consider if their marriage would be recognized for purposes of taxes, hospital visitation, inheritance and other spousal rights .\" if you asked an opposite-sex married couple to move to a state where their relationship would be instantly divorced if they moved from say, california, across the border to arizona, you would see how doma and the patchwork of state laws created a problem for married same-sex couples such as <mark>carlos</mark> and myself, \"he said. obama's stance on doma also was cited this week by a federal appeals court in san francisco that ordered the pentagon to immediately stop enforcing the 17-year-old law that prohibits gay men, lesbians and bisexuals from serving openly in the armed forces. ktre.com rss news feeds rss (really simple syndication) is an easy way for you to keep up with all of your favorite news and information. get news, weather, sports, movie and tv listings, stocks, flight tracker, and more, anytime, anywhere on your cell phone or pda with ktre 9 to go! click here for details."}]