[{"date": "2017-07-09", "url": "http://autoweek.com/article/monster-energy-nascar-cup/martin-truex-jr-survives-overtime-restart-win-monster-energy", "content": "Martin Truex Jr. had a lead that hovered between 10 and 15 seconds in the closing laps Saturday. Photo by LAT Photographic Martin Truex Jr. survives overtime restart to win Monster Energy NASCAR Cup race at Kentucky Stages dominating performance for third win this season July 9, 2017 Pinterest Email After all was said and done, the dominant car won the race--but not without extreme complications. With just over a lap to go in Saturday night's Quaker State 400 at Kentucky Speedway, Martin Truex Jr. held a lead of more than 15 seconds over second-place <mark>Kyle Larson</mark>, with only eight cars remaining on the lead lap. But before Truex could take the white flag signaling the final lap, the engine in <mark>Kurt Busch</mark>'s Ford expired, dumping oil on the 1.5-mile track. Under the caution, only Truex stayed out, with all other lead-lap cars coming to pit road for fresh tires. \"I thought we were dead,\" Truex said. \"I thought we were done .\" On old rubber and with a hard shove from <mark>Larson</mark>, who lined up behind him in the outside lane, Truex surged past Kyle Busch through the first two corners and held the lead until a wreck behind him at the end of the first overtime lap caused the ninth caution of the night and froze the field with Truex in the lead. The victory completed a perfect night for Truex, who won the first and second stages and then took the checkered flag. The win was Truex's third of the season, his first at Kentucky and the 10th of his career. Truex increased his series-leading playoff point total to 28, 12 more than that of second-place <mark>Jimmie Johnson</mark>. \"It's just...this is completely unbelievable,\" said Truex, who is tied with <mark>Johnson</mark> for the series lead in victories this season. \"I'm so excited to win here. It felt like we had a shot last year and it got away from us on fuel mileage, and (I) just wanted to win here so, so bad after that. This is sweet redemption .\" Before <mark>Kurt Busch</mark>'s engine blew, the green-flag run after the second stage had extended to 100 laps, and the final minutes of the race had only increased Truex's anxiety, despite his colossal lead. \"Worried every lap, waiting for a caution,\" Truex said. \"Especially at the end. You're counting them down--you know, 30, the last 30, the last 20, the last 10 and then you get inside of five, and you're like\" Oh my god, there's no way there's not going to be a caution, and sure enough there was. \"Fortunately (I was) able to hold them off. This thing was just so stout tonight. A good push from <mark>Larson</mark> (on the final restart) helped us a bunch .\" The win was the third of the 2017 season for Truex. Photo by LAT Photographic <mark>Larson</mark> started the race in 40th because his car failed to pass inspection before qualifying. In the first 80-lap stage, he charged forward to the third position but sped on pit road during caution between stages and restarted at the rear of the field on lap 88. Again he charged through the field, and when the cars lined up for the final restart in overtime, <mark>Larson</mark> took advantage of four new tires to grab second place. Even on new rubber, he had nothing for Truex, who led a race-high 152 laps. \"Yeah, I don't know what we could have done to beat him,\" said <mark>Larson</mark>, who retained a one-point lead over Truex in the championship standings. \"He was obviously pretty fast with the lead there. It would have been fun to get to race him, because I felt like I had the second-best car today; and it would have been interesting to get a restart with him earlier and get to hang with him that last run there .\" But we brought the Target Chevy home second after not being able to qualify and having to start last in the race and then having my speeding penalty there. I guess I was just a little too fast leaving my stall and got a penalty. So I've got to clean that stuff up. I'm mad at myself that I made that mistake. I don't really know if it affected the outcome, but you never know. \"Chase Elliott came home third, followed by <mark>Joe Gibbs</mark> Racing teammates Denny Hamlin and Kyle Busch. <mark>Erik Jones</mark>, Truex's Furniture Row Racing teammate, ran sixth, with Jamie McMurray, Joey Logano and Kevin Harvick finishing seventh through ninth, respectively, as the only remaining cars on the lead lap. For <mark>Johnson</mark>, the jinx continued at Kentucky, one of three active tracks at which the seven-time champion hasn't won (the others being Watkins Glen and Chicagoland). On lap 88, after the start of the second stage, Brad Keselowski's No. 2 Ford got loose on the entry to turn three and collected Clint Bowyer's No. 14 Ford. <mark>Johnson</mark> couldn't avoid the wreck in front of him .\" The car felt great, \"<mark>Johnson</mark> said .\" I feel like we were probably in the position for a good top five tonight, with all things considered. But, the No. 2 car (Keselowski) got into the corner and he was sideways before we got there. I feel like the car on the outside of him (Bowyer) left him some room. \"But then, talking to Brad inside (the infield care center), he said he was just sideways before he ever got to the corner. And I thought I almost had him missed. I really thought I had him missed, and I just clipped him with my right front. It broke something in the suspension and took me into the fence .\" Keselowski confirmed the diagnosis after both cars had retired from the race, Keselowski in 38th and <mark>Johnson</mark> in 39th. \"I just wrecked it,\" Keselowski said. \"It stinks. I got loose into (turn) three. I was underneath the 14 (Bowyer). I was trying to lay up and give room but just spun out as soon as I got anywhere near the corner .\" I wrecked myself and a bunch of other guys. It's part of it I guess, but not a part that you have to like. \"The win was the 10th of Martin Truex Jr.'s NASCAR Cup career. Photo by Getty Images for NASCAR Monster Energy NASCAR Cup Series Race Results Quaker State 400 Presented by Advance Auto PartsKentucky Speedway 1. (2) Martin Truex Jr., Toyota, 274. 2. (40) <mark>Kyle Larson</mark>, Chevrolet, 274. 3. (12) Chase Elliott, Chevrolet, 274. 4. (5) Denny Hamlin, Toyota, 274. 5. (1) Kyle Busch, Toyota, 274. 6. (14) <mark>Erik Jones</mark> #, Toyota, 274. 7. (4) Jamie McMurray, Chevrolet, 274. 8. (11) Joey Logano, Ford, 274. 9. (7) Kevin Harvick, Ford, 274. 10. (6) Ryan Blaney, Ford, 273. 11. (17) Darrell Wallace Jr. (i), Ford, 273. 12. (13) Dale Earnhardt Jr., Chevrolet, 273. 13. (16) Clint Bowyer, Ford, 273. 14. (18) Ricky Stenhouse Jr., Ford, 273. 15. (20) Danica Patrick, Ford, 273. 16. (22) Chris Buescher, Chevrolet, 273. 17. (3) Matt Kenseth, Toyota, 273. 18. (9) <mark>Daniel Suarez</mark> #, Toyota, 273. 19. (25) Austin Dillon, Chevrolet, 272. 20. (28) AJ Allmendinger, Chevrolet, 272. 21. (24) <mark>Paul Menard</mark>, Chevrolet, 272. 22. (29) <mark>Ryan Newman</mark>, Chevrolet, 272. 23. (21) <mark>Michael McDowell</mark>, Chevrolet, 271. 24. (26) David Ragan, Ford, 270. 25. (30) Matt DiBenedetto, Ford, 270. 26. (35) Landon Cassill, Ford, 268. 27. (31) * Ryan Sieg (i), Toyota, 266. 28. (33) Reed Sorenson, Chevrolet, 265. 29. (36) Jeffrey Earnhardt, Chevrolet, 265. 30. (15) <mark>Kurt Busch</mark>, Ford, Engine, 264. 31. (38) * Timmy Hill (i), Chevrolet, 261. 32. (37) * BJ McLeod (i), Chevrolet, 260. 33. (27) Ty Dillon #, Chevrolet, 253. 34. (32) Cole Whitt, Chevrolet, Engine, 212. 35. (39) * Gray Gaulding #, Toyota, 207. 36. (34) Joey Gase (i), Toyota, Accident, 129. 37. (19) Trevor Bayne, Ford, Accident, 101. 38. (23) Kasey Kahne, Chevrolet, Accident, 93. 39. (10) Brad Keselowski, Ford, Accident, 89. 40. (8) <mark>Jimmie Johnson</mark>, Chevrolet, Accident, 87. Average Speed of Race Winner: 138.604 mph. Time of Race: 2 Hrs, 57 Mins, 55 Secs. Margin of Victory: Caution. Caution Flags: 9 for 39 laps. Lead Changes: 9 among 4 drivers. Lap Leaders: Kyle Busch 1-28; M. Truex Jr. 29; Kyle Busch 30-67; M. Truex Jr. 68-87; Kyle Busch 88-133; M. Truex Jr. 134-163; J. Logano 164-170; M. Truex Jr. 171-225; D. Earnhardt Jr. 226-228; M. Truex Jr. 229-274. Leaders Summary (Driver, Times Lead, Laps Led): M. Truex Jr. 5 times for 152 laps; Kyle Busch 3 times for 112 laps; J. Logano 1 time for 7 laps; D. Earnhardt Jr. 1 time for 3 laps. Stage #1 Top Ten: 78,18,42,4,1,20,11,77,48,24 Stage #2 Top Ten: 78,18,20,4,77,1,41,11,14,24", "articleID": "2017070905_00663518_W", "names": {"Erik Jones": ["Q16239574", "Q57422872"], "Jimmie Johnson": ["Q217238", "Q6199355"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"], "Kurt Busch": ["Q201820", "Q42507470"], "Kyle Larson": ["Q11751789", "Q21184548", "Q5308142"], "Michael Mcdowell": ["Q1928579", "Q1928582"], "Paul Menard": ["Q16732470", "Q2879369"], "Ryan Newman": ["Q18989", "Q525980"]}}, {"date": "2017-07-10", "url": "http://www.kiro7.com/news/local/senators-express-concern-over-white-house-interference-in-att-time-warner-merger/554942221", "content": "Senators express concern over White House interference in AT & T - Time Warner Merger Updated: Jul 9, 2017 - 10:38 PM The--the parent company of CNN--is widely expected to close by the end of the year, if not earlier, should it win government approval. But the question of whether it will be approved was raised this week, after that the White House, which has an adversarial relationship with CNN, was considering using the deal as \"leverage .\" $85 billion mega-merger between AT & T and Time Warner the New York Times reported TRENDING NOW: DOWNLOAD OUR FREE NEWS APP Democratic senators reacted with dismay to the Times report and warned against any White House involvement in antitrust enforcement. \"Any political interference in antitrust enforcement is unacceptable,\" Minnesota Sen. Amy Klobuchar wrote in a letter to Attorney General Jeff Sessions. \"Even more concerning, in this instance, is that it appears that some advisers to the President may believe that it is appropriate for the government to use its law enforcement authority to alter or censor the press. Such an action would violate the First Amendment .\" Fellow Minnesotan Sen. Al Franken, who opposes the merger, echoed Klobuchar's sentiment in his own statement: \"The Trump Administration's war against the media must not influence the fate of this transaction .\" During the presidential campaign, when the deal between AT & T and Time Warner was announced, on its merits, calling it \"a deal we will not approve in my administration because it's too much concentration of power in the hands of too few .\" Mr. Trump promised to block the merger But his open war on CNN has been escalating in recent days. In Warsaw this week, Mr. Trump said CNN has been \"fake news\" for a long time. \"They've been covering me in a very, very dishonest way,\" he said. And linking Trump supporter Anthony Scaramucci to a Russian billionaire, causing three journalists to resign over the report, the president responded with a \"Wow,\" and wondered \"about all the other phony stories they do .\" after CNN retracted a story But animus aside, it's not the White House that makes the call on whether the merger goes through. That's up to the FCC and the Justice Department. The FCC evaluates mergers on the basis of whether they're in the public interest. In February, FCC Chairman <mark>Ajit Pai</mark> told the Wall Street Journal that his agency would likely not be reviewing the deal because no airwave licenses would be transferred. This was, according to the Journal, a development that investors had been watching for, since an FCC review is considered to to be broader than the antitrust review conducted by the Justice Department. The AT & T - Time Warner merger is a vertical merger, meaning that the two companies are not direct competitors. This, according to the Journal, is one of the main reasons the companies are confident that the Justice Department won't reject the deal on antitrust grounds. Currently, the Justice Department does not have anyone heading the Antitrust Division, but Andrew Finch is currently serving as Acting Assistant Attorney General responsible for overseeing the division. © 2017 Cox Media Group.", "articleID": "2017071005_00716150_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}}, {"date": "2017-07-10", "url": "http://www.pwmania.com/alberto-el-patron-involved-in-domestic-incident-at-orlando-airport-detained-by-police", "content": "News Impact Share on Facebook Tweet on Twitter GFW Impact World Heavyweight Champion Alberto <mark>El Patron</mark> was reportedly detained by police at the airport in Orlando on Sunday afternoon, according to PWInsider. The Orlando Police Department issued the following statement: \"There was an incident at Orlando International Airport at about 3 p.m. Sunday involving <mark>Jose Rodriguez</mark> (DOB 5/25/1977) The reported incident was a domestic violence battery, and it is still under investigation. No arrests have been made as of this time, but the case remains open. That is all the information we have for release at this time .\" <mark>Patron</mark> later missed an indie booking in Texas Sunday night. We do know that Paige and <mark>Patron</mark>'s family were in Orlando over the weekend as she posted the following photo from Universal Studios: @ UniversalORL time with the family. @ rootsoffight #FamilyStickTogether @ PrideOfMexico @ HijoDeDosCaras pic.twitter.com/LlD1SZwr0T--PAIGE (@ RealPaigeWWE) July 8, 2017", "articleID": "2017071017_00759755_W", "names": {"El Patron": ["Q5945041", "Q79231"]}}]