[{"date": "2017-07-10", "url": "http://www.pwmania.com/alberto-el-patron-involved-in-domestic-incident-at-orlando-airport-detained-by-police", "content": "News Impact Share on Facebook Tweet on Twitter GFW Impact World Heavyweight Champion Alberto <mark>El Patron</mark> was reportedly detained by police at the airport in Orlando on Sunday afternoon, according to PWInsider. The Orlando Police Department issued the following statement: \"There was an incident at Orlando International Airport at about 3 p.m. Sunday involving <mark>Jose Rodriguez</mark> (DOB 5/25/1977) The reported incident was a domestic violence battery, and it is still under investigation. No arrests have been made as of this time, but the case remains open. That is all the information we have for release at this time .\" <mark>Patron</mark> later missed an indie booking in Texas Sunday night. We do know that Paige and <mark>Patron</mark>'s family were in Orlando over the weekend as she posted the following photo from Universal Studios: @ UniversalORL time with the family. @ rootsoffight #FamilyStickTogether @ PrideOfMexico @ HijoDeDosCaras pic.twitter.com/LlD1SZwr0T--PAIGE (@ RealPaigeWWE) July 8, 2017", "articleID": "2017071017_00759755_W", "names": {"Jose Rodriguez": ["Q16151948", "Q27049504", "Q3186137", "Q3810571", "Q56525305", "Q6293886", "Q6293887"]}}, {"date": "2017-07-10", "url": "http://www.thehansindia.com/posts/index/Sports/2017-07-11/BCCI-bouncer-New-coach-only-later/311504", "content": "BCCI bouncer: New coach only later THE HANS INDIA | Jul 11,2017, 03:19 AM IST Sourav Ganguly, one of the three Cricket Advisory Committee (CAC) members, addressing the media in Mumbai on Monday In a dramatic turn of events, the three-member Cricket Advisory Committee (CAC) on Monday decided to put the appointment of next India coach on hold despite completion of the interview process. Mumbai: The decision to withhold the appointment is a clear indication that Ravi Shastri is no longer a runaway favourite for the top job after Virender Sehwag appeared in person for the interview which went on for two hours. It was revealed that five people, including Shastri, Sehwag, Lalchand Rajput and Richard Pybus appeared for interview while <mark>Phil Simmons</mark> made himself unavailable. The CAC comprises former captains Sachin Tendulkar and Sourav Ganguly along with VVS Laxman. Tendulkar joined the day's proceedings via skype as he is currently in London. \"We will hold on to the announcements as we need a few more days. We feel there is no hurry, the Sri Lanka tour is coming in a few days' time,\" Ganguly told media persons. Ganguly made it clear that they are looking at the bigger picture for the next two years and will take a decision in the best interest of Indian cricket. Reiterating the policy of the BCCI, Ganguly stated that any appointment will be made till the World Cup. \"Once we make this announcement, it has to be till the World Cup (2019),\" said Ganguly. Ganguly said that the presentations given by coaches on their roadmap for Indian cricket were no different from what they saw last year. \"From what we have heard from the coaches, it is not different from last year. We will take a call in the due course of time. We are not in a hurry. Sri Lanka is a long tour. We want to make sure that everybody is in synchronisation .\" \"It's not me, Sachin, Amitabh ji (Chaudhary) or Rahul (Johri), who will play. It is the players who will be playing and the support staff will be there. Everybody should be in synchronisation,\" Ganguly said in a matter-of-fact manner. He made it clear that skipper Virat Kohli remains an important cog in the decision-making process. \"Virat is an important cog in the system and we will take a call which would be the best way forward for the team and the boys because they are going to play .\" Stay updated on the go with The Hans India News App. Click for Android / IOS download it for your device.", "articleID": "2017071021_01146119_W", "names": {"Phil Simmons": ["Q47434073", "Q6827914"]}}, {"date": "2017-07-11", "url": "http://www.pokernews.com/news/2017/07/world-series-of-poker-donates-bracelet-to-reg-charity-28477.htm", "content": "Team PokerStars Pro Liv Boeree revealed this week that the World Series of Poker has donated one of its gold bracelets to the Raise for Effective Giving charity. Boeree and her boyfriend Igor Kurganov, who is also a member of Team PokerStars, won Event #2: $10,000 Tag Team No-Limit Hold ’em Championship at the beginning of the 2017 WSOP and each were awarded a coveted gold bracelet. As their team consisted of only two members, there were two bracelets left over, as Boeree explained on social media. \"As there were only two of us in our Tag Team, there were two WSOP bracelets left over from the event .\" The kind folks at the WSOP have given us one to auction off in aid of Raising for Effective Giving - REG Charity's Charities...so if you haven't won your bracelet yet, here's your chance! Not only will you get your very own World Series gold bracelet, but 100% of your winning bid will go directly to the world's most effective charities and save lives. \"The bracelet has been put up for sale on the auction site eBay and, at time of writing, had attracted a total of nine bids, the highest of which weighed in at $3,150, which is under the unknown reserve price set by Boeree and Kurganov. Every cent from the eventual sale will go to the REG charity which was co-founded by Boeree and Kurganov, along with fellow poker players Philipp Gruissem and <mark>Stefan Huber</mark>. Anyone can become a REG member by pledging at least two percent of their income to the organisation, which it then distributes in the most effective way possible. REG seeks to help alleviate poverty, looks after animal welfare, and prevent risk from emerging technologies. Some of the charities recommended by REG include: Against Malaria Foundation Schistosomiasis Control Initiative Animal Charity Evaluators Animal Ethics Humane Slaughter Association Foundational Research Institute Machine Intelligence Research Institute Anyone interested in placing a bid for the WSOP bracelet can head to eBay now. Bidding ends at 3 a.m. on July 20. For more information about the REG charity, including how to donate, more on the recommended charities and more, click here. Have you ever wanted to write your own articles about poker? Maybe you've got some experiences or opinions about poker that you'd like to share. PokerNews is proud to launch The PN Blog where you can have a platform to make your voice heard. Learn more here.", "articleID": "2017071119_01173176_W", "names": {"Stefan Huber": ["Q2336572", "Q25415666", "Q50021147", "Q670225"]}}, {"date": "2017-07-13", "url": "http://www.galesburg.com/news/20170713/bail-cut-in-half-for-galesburg-man-charged-with-child-abuse", "content": "Bail cut in half for Galesburg man charged with child abuse Thursday Jul 13, 2017 at 6:44 PM Jul 13, 2017 at 6:44 PM Robert Connelly The Register-Mail RConnelly _ GALESBURG--A Galesburg man charged with battering a seven-week-old child had his bail cut in half, but was not expected to post bond. Austin M. Mitchener, 19, East North Street, made a court appearance before Circuit Judge Paul Mangieri Thursday afternoon on a motion to reduce bail. His bail was set at $500,000, $50,000 needed to get out of jail, in an arrest warrant on one count of Class X felony aggravated battery to a child. That charge says Mitchener allegedly bounced a child \"on his lap without supporting the (victim's) neck, causing blood and swelling on the brain and/or seizures and/or shaken baby syndrome .\" If Mitchener is convicted, the charge carries a sentence of between six and 30 years in the Illinois Department of Corrections, which would be served at 85 percent. It is not eligible for probation. Mitchener is represented by defense attorney Jeremy Karlin. Knox County Assistant State's Attorney <mark>Brian Kerr</mark> successfully filed a motion to continue Mitchener's preliminary hearing one week to begin Thursday's court appearance. That led to the bond hearing, in which Karlin called Melania Mitchener to testify. She said she is Mitchener's stepmother. She has become a foster parent for the child in the case, who is now 2 1/2 months old, through the Illinois Department of Children and Family Services. The child was released from an area hospital last Friday, July 7. Karlin requested bail be lowered to $10,000, and Melania Mitchener said she could post the $1,000 that would be needed to get Austin Mitchener out of the Knox County jail. Even if he were to get out of jail, she said she understood he was to have no contact with the victim while the child's mother has supervised visits with a DCFS representative present. <mark>Kerr</mark> read from the Galesburg police report related to the incident to make an argument against reducing bail. He said Galesburg police received a call for a suspicious injury report on June 23 involving a child with blood on her brain, which came from non-accidental head trauma. A doctor said it was shaken baby syndrome and that the child was suffering from seizures and the swelling on her brain caused her brain to shift, <mark>Kerr</mark> said. It was not initially expected that the baby would survive, but she has subsequently recovered. The doctor ruled there was \"no other possible explanation other than some form of child abuse\" that caused the injuries, <mark>Kerr</mark> said in court Thursday afternoon. He further said Mitchener said he had anger issues growing up and would get frustrated when the child would not calm down. In those instances, he would hand the baby off to her mother. Early June 21, he took care of the child and was attempting to calm her down while the child's mother slept. He reportedly bounced the baby on his knee and chest without supporting the baby's neck. \"Shortly after bouncing her is when she went limp,\" which Mitchener thought was her going to sleep, <mark>Kerr</mark> told Mangieri in court. At that point, he reportedly lay the girl down and then checked on her a few hours later and found her twitching. Later that morning, the child was taken to the emergency room, <mark>Kerr</mark> said. Mangieri elected to cut Mitchener's bail in half from $500,000 to $250,000, $25,000 needed to get out of jail. That amount was believed to be too high for him to be able to post, according to testimony heard Thursday afternoon. Mitchener will return to court at 2 p.m. Thursday for his preliminary hearing. Robert Connelly: (309) 343-7181, ext. 266; rconnelly @ register-mail.com; @ RConnelly_", "articleID": "2017071323_00856362_W", "names": {"Brian Kerr": ["Q2924937", "Q4964340", "Q56877196", "Q849630"]}}, {"date": "2017-07-14", "url": "http://www.msn.com/en-us/news/world/five-hurt-in-acid-attack-robberies-in-london-teenager-arrested/ar-BBEofJG?li=BBnbfcL", "content": "© REUTERS Emergency response following acid attack on the junction of Hackney Road junction with Queensbridge Road, London British police arrested a teenager on Friday after five acid attacks in less than 90 minutes across east London left several people with facial burns, including one with horrific injuries. 2 cards charging 0% Interest until 2019 See The 0% APR Cards Sponsored by NextAdvisor Two assailants on a moped pulled up alongside a 32-year-old man in the Hackney area of east London at 2125 GMT on Thursday and threw acid in his face before one of the pair made off with the victim's moped. In the next hour and a half, three other men across Hackney and one in the neighboring borough of Islington had corrosive substances hurled at them, police said. After one of the robberies in Hackney, a man was left with facial injuries described by police as life-changing. \"A male in his teens has been arrested on suspicion of grievous bodily harm and robbery,\" the London police service said. \"He is currently in custody at an east London police station .\" Metropolitan Police Commissioner Cressida Dick said that while still relatively rare, the number of acid attacks appeared to have risen in the capital. \"I don't want people to think that this is happening all over London all of the time - it's really not, but we are concerned because the numbers appear to be going up,\" Dick told the LBC radio station in an interview. \"Acid attacks are completely barbaric,\" Dick said. \"The acid can cause horrendous injuries. The ones last night involved a series of robberies we believe are linked .\" (Editing by Guy Faulconbridge and <mark>Gareth Jones</mark>)", "articleID": "2017071411_00681241_W", "names": {"Gareth Jones": ["Q15990091", "Q16194126", "Q25189125", "Q28766870", "Q304629", "Q30505322", "Q5522881", "Q5522882", "Q5522883", "Q5522885", "Q5522889", "Q57245256"]}}, {"date": "2017-07-15", "url": "http://www.dailytrust.com.ng/news/feature/-how-we-survived-biafran-war/205547.html", "content": "Feature \"How we survived Biafran war' By Tony Adibe (Enugu), Linus Effiong (Umuahia), Nabob Ogbonna (Abakaliki) & Emma Elekwa (Awka) | Publish Date: Jul 15 2017 2:00 AM (0 Likes)\" How we survived Biafran war' War drums are easy to beat, but hard to dance. Rising agitations for Nigeria's break-up have made the country's leaders to issue words of caution at various points in recent times. <mark>Ibrahim Babangida</mark>, an army General and former military ruler who actively took part in the civil war to keep Nigeria one, recently expressed concern on profuse verbal provocations from certain individuals in the country, saying the pains of that war fraught with death and suffering are still being felt. This is a link that appears lacking in the imagination of current agitators for secession and hate speech mongers. Our correspondents bring accounts of some Nigerians who went through the three-year quagmire. Obiefuna Onuoha makes a living dealing in paint. He was five years old when the Nigerian civil war broke out. \"Everything was turned upside down. Life became miserable,\" he recalls. \"There was no food for us to eat, no water to drink. The only thing close to meat was grasshopper, if you could see it. Another was lizard. In fact, nobody should even think of another war, please. War is not good and I will nerve support it, a person like me would prefer dialogue if the need arises,\" he says. Onuoha recalls living in the forest with his twin for two whole years while bombs and mortars pounded surroundings. Now more recent agitations are forcing him to look back upon years he would rather forget. Agitators for Biafra and opposing sides have been pitted against each other. The stand-off has forced reflections into the years between 1966 and 1970 when Nigeria teetered on the brink of breakup, as the eastern part of the country declared itself Biafra, citing political marginalization. \"The obvious point is that freedom is not free and for me I am not ready to witness any fight again. In short, it is better for me to stay in Nigeria than witness another war in the name that we are fighting for Biafra,\" said Onuoha. Chinedum Nwogu was 18 years at the time, and he recalls how it began like a funfair. \"Many people jumped up and down that the war had started, just like the drum beat we are having now, there was enthusiasm everywhere, people were asking Ojukwu for weapons,\" he says. And then the refugee problems began. \"We never thought we would have such problem until when people started fleeing their homes to reside in schools, and the speed of the federal troops? They were moving fast to conquer more grounds which gave rise to the growth of refugees. Before we realized it, they had taken over Enugu. The city was then the capital of the newfound country .\" The refugees had nobody to take care of them, they were just in schools. There was hunger in the land, health hazards, food scarcity because the Nigerian government did not allow the Red Cross free passage to bring food to the people, so there was problem of malnutrition. There was economic blockage, \"recalls Nwogu .\" We had a lot of deaths, we lost more of our brothers and sisters to health hazards. Sincerely speaking, more people died out of starvation compared to the number killed by the federal troops. This was the most horrible part of the war. \"What is happening now is also the same build up to what happened during the civil war, but if you ask me, and a few of us who are veterans, we are telling the young ones to adopt all the available options. I don't want war, it's more than what you see .\" \"Unprepared, and without a bullet\" Josiah Akparandum, 80, is also a veteran of the civil war. He was 25 then and skipped conscription into the Biafran Army. He joined the war out of sheer enthusiasm and trained as an intelligence officer, such was in short supply at the time. After training for four months in Enugu, he took leave to see his family at Owerrinta, on the outskirts of Aba in present-day Abia State. He was too late. \"When I got to my village, l realized that my community had been taken over by the Nigerian Army, I couldn't find my parents nor any of my relatives anymore, because some were killed while others fled for their lives,\" Akparandum recalls. That was in 1968. \"I refused to return to work, I had to pitch my tent with the Biafran Army Bongo Battalion at Owerrinta Umuopkala axis to fight against the perceived enemies of my people where I was allowed to work in the intelligence unit,\" he says. As an intelligence officer, he wrote situation reports to the 65 Brigade through the battalion. He believes the war took Biafra unprepared. \"The then South easterners should not have gone for the war because they didn't prepared for it, it was just mere enthusiasm by the Igbos, we suffered so much hunger, ill health, no medical support anywhere, deaths at home and loss of many soldiers .\" \"South easterners lost the Biafran War mainly because of sabotage by Igbo civilians and some of our Biafran military men who hijacked food meant for distribution and sold them. A lot diverted monies meant to purchase arms, some ran away with the cash, there was serious sabotage during the Biafran war .\" In as much as the Igbo race is still complaining about marginalization, not having our own fair share of the dividends of democracy, I am not in support of going to war, but I believe Biafra will be won without a bullet. \"We saw hell' The bullet is something Emeka Amaefula doesn't want to contemplate .\" I don't want to wish even my worst enemy the type of experience we had during the civil war, \"says the 54-year-old, only a boy in 1966 when the war broke out. As it began to wind down in 1969, the memories still haunt him .\" Troops from the Nigerian Army were throwing bombs at the market. My mother and other women were not going to the market because Nigerian troops were always bombarding everywhere. Nothing was happening. Everywhere was in crisis. There was no food, no hospital and no utilities. \"We were starving. There were kwashiorkor and other terrible illnesses caused by poor feeding. My mother used to cook unripe paw-paw as yam. We cooked and ate that because there was no food. Our parents could not go to farm because of the war. We were hunting for lizards and rats to eat. It was a miracle I survived .\" We were able to gather insects, lizards, maggots and snails which scattered all over the bush. As we ran inside the bush we saw all these things and we started gathering them and it helped us a lot. They also got food handouts from non-government groups like Caritas, mostly milk and smashed egg yolk. \"We were served corn meal at a place called community centres. Schools were not functioning and some of schools were operating under trees. At the end of the war we were forced out of our homes and our properties were vandalised. My father trekked from Calabar to Ikeduru in Imo State. They were ferried across the river and those that didn't have the stamina to trek died on the way. Inestimable losses Teddy Chilaka worked with the International Red Cross Society during the war, assisting the wounded under harrowing circumstances. He recalls:\" Two of my brothers were killed in the war. You know what it means losing your beloved ones in such tragic situation. Then when the Nigerian military forces were coming closer and closer, we ran from one village to another. At the sound of aircraft, we had to hide under a tree and remove our white shirts in order not to be easily identified by those in the aircraft. Then we were sleeping in markets. It was like that until after two months. I left my parents and went with the Red Cross team to Cross River State, and from there we traveled to many places, carrying the sick, assisting the wounded, taking them to hospital. Then after the war, we came back and rejoined our families. We were lucky that my parents were alive because most of our neighbours were dead. \"It was after the war that people developed lack of regard for dead bodies. Before the war, when you saw people carrying a corpse, you would hide. But in the war condition, we were eating where dead bodies were laid, to the extent that people were no longer afraid of death or corpses .\" Life very difficult after return \"When we came back, we had no homes. We were haboured somewhere in our neighbourhood until we were able to get money to start life all over again for the family,\" he recalls. But he has a different understanding of ongoing agitations. \"The agitators I've come in contact with are not canvassing for war. They are saying that they will follow it up through referendum, like Southern Sudan did or the one that happened recently, Scotland under British government. Now, if the United Nations can organize a referendum, if they succeed, so be it, but if they do not succeed, they may continue to agitate until their intentions are achieved .\" Igbos are humiliated too much because of the effects of the civil war. In fact, the war made the Igbo to lose their identity. Nobody will agitate for war again. \"But Emeka Iro doesn't rule out a referendum. From Isuikwuato Local Government Area resident in Abakiliki, he was 10 when the war started. His father died in the war, leaving the 10-year-old to fend for himself even after the war. Says Iro:\" It was a bitter story and I won't like that to repeat itself. Like these people - the Indigenous People of Biafra (IPOB) and MASSOB members that are calling for referendum, if there should be referendum everybody will air his or her view and if it is something we cannot manage everybody we go their way but in a situation where it will lead us to a war, I will not like it. \"Emeka Okafor retired from public service, he was eight years old when the war started. He was among countless youths who joined the war effort in enthusiasm. He fought for three years and has marks on his body to show for it .\" I served the 14 Divisional Brigade headquarters, Owerri, 60 Brigade in Uguta, 72 Battalion in Egbema, among others. I rose to the rank of a lieutenant, \"he says .\" We were in Ogbidi when the war ended. As soon as it ended, we had no option than to go back to the basics. Personally, I was very disappointed that we lost out in a noble cause we all thought we could have won, \"he said. He returned to school after the war .\" Our mates in Nigeria were already in year one when we were still battling with the entrance examinations. I became more annoyed. But thank God, I eventually graduated and worked in both public and private organizations. But the disquiet hasn't died down, and there's talk of Biafra of the mind. \"What gave rise to this agitation is injustice and lack of fairness and equity. Check out the six geopolitical zones in the country. Northeast has seven states, others have six. It is only the Southeast that has five states. You know states is a basis for sharing the national cake,\" Okafor says. \"Just imagine what we have lost as all these years. On that ground, it is okay to at least recognize the fact that we have been shortchanged and cheated for long .\" A state like Bayelsa that produces the greatest volume of oil has only seven local government areas. So, if anything is being shared, you can imagine what they would end up getting. But Kano which has no single oil well has 44 local governments. I don't think that is fair. \"What does Biafra meant to Igbos? Ralph Obioha, a chieftain of the apex Igbo socio-cultural association, Ohanaeze Ndi-Igbo, was in the House of Representatives between 1979 and 1983, serving on the finance committee. Later, he joined pro-democracy groups in the aftermath of June 12. They triggered international sanctions on Nigeria to force the military back to the barracks. He would later found the Justice Party. But he is disturbed that the\" crusade' led by Nnamdi Kanu of the Indigenous Peoples of Biafra (IPOB) is anti-Igbo. \"I'm opposed to Biafra. It means nothing. It is against the Igbo. Anybody who is proposing or propagating it is anti-Igbo because Biafra is not in Igbo's vital interest. Nigeria is even too small for Igbo. The Igbo are all over the world excelling in every field of their chosen endeavours. How can we contract it? How can we reduce our space and size?\" says Obioha. He says the word Biafra is opium for young people who never witnessed the war and who are taking up social media to fan misconceptions. \"I'm appealing to the Igbo to see Nigeria as the place they will have to aspire to be their best, to take the abundant opportunities in this country. On the other hand, I'm asking other Nigerians to have another look about the Igbo. The Igbo are the engine room of Nigeria. They are really the true Nigerians because they are the ones who will leave their own shores and venture to other places and take those places as their home, build and develop such,\" notes Obioha. Air Commodore Luke Ochulor is retired but he fought on the Biafran side during the war. He later became the military administrator of Delta State. \"Most of us are worried but is not because we don't know what to say. We have been very inarticulate as far as this problem of agitation is concerned. The danger in this type of situation is that you may be caught in a web where the agitators, because they don't understand exactly what they are looking for, can regard you as an enemy, which makes it dangerous .\" But we all owe allegiance to the flag of the Federal Republic of Nigeria. After the civil war, we all agreed that the fight for Biafra was over. That's what makes a people and then we must stay together and build Nigeria to an extent that if any group wants to secede, we won't allow them. So when we look at the agitation for Biafra, we are of the view that youths in the Southeast zone of Nigeria have the right to protest if the condition in Nigeria is not good for them and their future. But they should not use the word, \"Biafra'. (0 Likes) Name", "articleID": "2017071513_00459615_W", "names": {"Ibrahim Babangida": ["Q333415", "Q35539224", "Q4521833"]}}, {"date": "2017-07-15", "url": "http://santamariatimes.com/news/national/penn-state-ex-officials-begin-jail-terms-in-sandusky-case/article_1cd8db4e-b12b-5010-91ae-4c84d6791d67.html", "content": "2 Penn State ex-officials begin jail terms in Sandusky case By JOE MANDAK Associated Press Jul 15, 2017 Updated 1 min ago This undated photo provided by the Centre County Correctional Facility on Saturday, July 15, 2017 shows former Penn State University athletic director Tim Curley. Curley and former Penn State University vice president Gary Schultz reported to the Pennsylvania prison on Saturday to serve sentences for how they responded to a 2001 complaint about Jerry Sandusky showering with a boy. (Centre County Correctional Facility via AP) HOGP This undated photo provided by the Centre County Correctional Facility on Saturday, July 15, 2017 shows former Penn State University vice president Gary Schultz. Schultz and former Penn State University athletic director Tim Curley reported to the Pennsylvania prison on Saturday to serve sentences for how they responded to a 2001 complaint about Jerry Sandusky showering with a boy. (Centre County Correctional Facility via AP) HOGP Two former high-ranking Penn State administrators surrendered Saturday morning to serve jail sentences for how they responded to a 2001 complaint about Jerry Sandusky showering with a boy. Former university vice president Gary Schultz and former athletic director Tim Curley turned themselves in, according to Lt. <mark>Michael Woods</mark>, the shift commander at the Centre County Correctional Facility. Wood confirmed their surrender, but said he was not authorized to release any other details from the jail, which is about 135 miles (217 kilometers) east of Pittsburgh. The lockup is about 7 miles (11 kilometers) northeast of Penn State's main campus. Schultz and Curley pleaded guilty to misdemeanor child endangerment in March, leading prosecutors to drop three felony charges of child endangerment and conspiracy. Curley, 63, must serve three months in jail, while Schultz, 67, has two months behind bars. Jail officials said they will be evaluated for participation in work release while incarcerated. A co-defendant, former Penn State president Graham Spanier, 68, was convicted of the same offense and faces two months in jail. Spanier remains free on bail while he appeals to Superior Court. Spanier continues to be a tenured faculty member and is on administrative leave. A deal with the university when he was forced out as president after Sandusky's arrest in November 2011 pays him $600,000 a year, ending this fall, after which he will receive a salary. The three men received a complaint from a graduate assistant football coach in February 2001 who said he was highly disturbed by seeing Sandusky appear to sexually abuse the boy late on a Friday night in a team shower. They told Sandusky not to bring children onto campus anymore, but prosecutors said the administrators had no plan to enforce that rule. Police were not notified, and a criminal investigation into Sandusky did not begin until a Pennsylvania school district reported another complaint about him in 2008. Sandusky was convicted in 2012 of 45 counts of child sexual abuse. He maintains his innocence and is appealing, while serving 30 to 60 years in state prison. The scandal led the university to fire Hall of Fame football coach Joe Paterno, who was informed of the 2001 incident the next morning by the assistant, Mike McQueary. Paterno notified Curley but did not call police. He died in 2012, a few months after his firing, and was never charged with a crime. An anonymous email in 2010 led investigators looking into Sandusky to contact McQueary, and he proved to be a critical witness at the criminal trials of both Sandusky and Spanier. Get news headlines sent daily to your inbox Sign Up! I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. At sentencing for Curley, Schultz and Spanier last month, Judge John Boccabella did not spare Paterno, saying he \"could have made that phone call without so much as getting his hands dirty. Why he didn't is beyond me .\" He also questioned Curley's memory lapses while testifying for the prosecution at Spanier's trial. \"I find it really hard to believe that he doesn't remember every detail of the most serious mistake he ever made,\" Boccabella said .------Associated Press writer Mark Scolforo contributed from Harrisburg. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Angry", "articleID": "2017071515_00591569_W", "names": {"Michael Woods": ["Q1501409", "Q16961795", "Q17041407", "Q18211822", "Q21459180", "Q3267081", "Q3308580", "Q47129080", "Q6835442", "Q995633"]}}, {"date": "2017-07-16", "url": "http://www.houstonchronicle.com/news/article/Trump-defends-his-son-drawing-a-contrast-with-11291945.php", "content": "<mark>Trump</mark> defends his son - drawing a contrast with Clinton - and says media are \"distorting democracy' Philip Rucker, The Washington Post July 16, 2017 PISCATAWAY, N.J. - President <mark>Trump</mark> defended his son <mark>Donald Trump</mark> Jr., contrasting his Russia meeting with Hillary Clinton's deleted emails and accused the news media of\" DISTORTING DEMOCRACY \"in a series of angry statements issued early Sunday. Tweeting from his private golf club in Bedminster, N.J., where he is spending the weekend, <mark>Trump</mark> lashed out at the media for coverage of the disclosure that his oldest son and namesake held a meeting last year with a Kremlin-connected Russian lawyer who offered damaging information about Clinton, his campaign opponent. <mark>Trump</mark> tweeted,\" HillaryClinton can illegally get the questions to the Debate & delete 33,000 emails but my son Don is being scorned by the Fake News Media? \"<mark>Trump</mark> was referring to emails Clinton deleted from her private server as secretary of state, as well as to her campaign being provided an early look at a question in a primary debate against Sen. Bernie Sanders of Vermont. The debate controversy surfaced only because of an illegal hack of Democratic emails, which U.S. intelligence agencies have concluded was orchestrated by Russia, and their subsequent release on Wikileaks. In another tweet Sunday morning, <mark>Trump</mark> accused the news media of\" phony unnamed sources & highly slanted & even fraudulent reporting. \"He said the\" #Fake News, \"the president's term for news outlets whose aggressive reporting he does not like, is\" DISTORTING DEMOCRACY in our country! \"Translator To read this article in one of Houston's most-spoken languages, click on the button below. US News With all of its phony unnamed sources & highly slanted & even fraudulent reporting, #Fake News is DISTORTING DEMOCRACY in our country! - <mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) July 16, 2017--<mark>Trump</mark> also thanked a former campaign adviser, Michael Caputo, for his testimony Friday before the House Intelligence Committee, which is investigating Russian meddling in the U.S. election and possible collusion with the <mark>Trump</mark> campaign. Caputo told reporters that he testified in a closed session for nearly four hours and told House investigators,\" I had no contact with Russians and I never heard of anyone in the <mark>Trump</mark> campaign talking with Russians. \"<mark>Trump</mark> tweeted,\" Thank you to former campaign adviser Michael Caputo for saying so powerfully that there was no Russian collusion in our winning campaign. \"Caputo worked on the <mark>Trump</mark> campaign as a communications adviser throughout the Republican primary season but left the team in summer 2016 as the general election got underway. He has long ties to Russia, having lived in the country in the 1990s and working in 2000 as a contractor with the Russian conglomerate Gazprom Media to improve Putin's image in the United States. <mark>Trump</mark> has been staying in Bedminster at his <mark>Trump</mark> National Golf Club since returning from Paris on Friday evening. The president has been watching the U.S. Women's Open, tweeting five times over the weekend about his attendance at the golf tournament. He spent much of Saturday in an enclosed viewing area, watching the golfers on television and entertaining spectators by flashing a thumbs up or posing for photos. On Sunday morning, <mark>Trump</mark> boasted that his supporters\" far out-numbered the protesters \"at the golf club: Thank you to all of the supporters, who far out-numbered the protesters, yesterday at the Women's U.S. Open. Very cool! - <mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) July 16, 2017", "articleID": "2017071613_00208447_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-07-17", "url": "http://www.sandiegouniontribune.com/news/us-politics/la-pol-sac-skelton-cap-trade-jerry-brown-20170717-story.html#nt=oft11aH-22li2", "content": "\"He's single-minded like a bull,\" said a close friend of Gov. <mark>Jerry Brown</mark>. That was more than 42 years ago. Another Times reporter and I had tracked down friends and relatives of <mark>Brown</mark>, looking for some insight into the young man about to be inaugurated California governor for the first time. The single-minded bull description came from Frank Damrell, a former college roommate of <mark>Brown</mark> and a fellow Jesuit seminarian. He's now a retired U.S. district judge. The late Peter Finnegan, another longtime friend and fellow seminarian, said of <mark>Brown</mark>: \"I don't think he's a mystic. But I sure as hell think he's got a spiritual dimension that you don't find in politicians .\" Ironically, I had to cancel a luncheon with Damrell and some other old-timers last week because <mark>Brown</mark> simultaneously was doing his bull-spiritualist bit at a legislative committee hearing. It was too compelling to miss. Those old descriptions of <mark>Brown</mark> are as accurate today as they were in 1975. In fact, I've never seen <mark>Brown</mark> as animated, emotional and tenacious as he was before the state Senate Environmental Quality Committee, arguing for his embattled cap-and-trade climate control legislation. He resembled a cross between the <mark>Clint Eastwood</mark> character Walt Kowalski in \"Gran Torino\" --\"Get off my lawn!\" --and some street-corner preacher warning that the end is near. He's also the most effective politician Sacramento has seen in a very long time. \"I do get a little excited because, you know, as we get older we have less patience,\" the governor told the committee. \"And I want to see this thing get done.... Whatever I've got to do, I'm going to do it .\" \"This is the most important vote of your life,\" he continued, sounding a tad hyperbolic. \"Unless you think I'm lying. And I was in the seminary for three years, studying to be a good searcher of the truth. And I'm telling you, this is the truth.... And the only way I can be wrong is...if I'm stupid and ignorant, and I'm not. I've been around this business a long time .\" <mark>Brown</mark>'s hands were flying, arms flailing. Critics might say he was ranting. I'll just call it shouting. This isn't for me. I'm going to be dead. It's for you. And it's damn real .--Gov. <mark>Jerry Brown</mark>, speaking about cap-and-trade legislation to fight climate change Very rarely does a governor testify before a legislative committee. Never do I recall one sitting at the witness table for four hours--sermonizing, listening intently, writing notes and--presumably--taking names. \"Climate change is real,\" he warned. \"It is a threat to organized human existence. Maybe not in my life. I'll be dead. What am I, 79? Do I have five years more? Do I have 10 years more, 15? I don't know, 20? I don't even know if I want that long .\" Then he dramatically turned around and faced the packed audience, something legislative witnesses never do. \"When I look out here,\" he said, \"a lot of you people are going to be alive. And you're going to be alive in a horrible situation. You're going to see mass migrations, vector diseases, forest fires, Southern California burning up. That's real, guys....\" So I'm not here about some cockamamie legacy that people talk about. This isn't for me. I'm going to be dead. It's for you. And it's damn real. \"<mark>Brown</mark> fights global warming with religious zeal. But it doesn't seem plausible that he's not concerned about his legacy, his place in history. That's perfectly human and acceptable. The governor relishes his role as arguably America's leading voice against climate change. He was ceded the mantle by President Trump when Trump pulled the U.S. out of the Paris climate accord. Trump\" doesn't speak for the rest of America, \"<mark>Brown</mark> declared to foreign allies. The governor will hold his own international climate summit in San Francisco next summer. <mark>Brown</mark> wants California to show the world how to reduce greenhouse gas emissions without ruining its economy. This state produces only 1% of the planet's emissions. So our cutbacks won't amount to a hill of beans. But we can create a successful model that could be copied everywhere and have a worldwide impact, the governor believes. Updates from Sacramento\" That would be through the cap-and-trade program. But if <mark>Brown</mark> can't get his legislation passed, it would be an embarrassing step backward. Here's another huge motivation for <mark>Brown</mark>: The cap-and-trade program has been keeping his bullet train project on life support. It receives 25% of cap-and-trade revenue. So far, it has totaled $800 million. Cap and trade works this way: A cap is imposed on an industry's greenhouse gas emissions. But companies can trade for--buy--extra permits to pollute, either from the state or private investors. Caps are gradually lowered and emissions reduced. This will be a crucial week for the legislation. It cleared the Senate committee on a party-line vote. The governor will attempt to push it through both houses before lawmakers adjourn for summer vacation Friday. There are two bills. AB 398 would extend cap and trade until 2030. It's slated to expire in 2020. AB 617 would tighten controls on air pollution. It's a close vote because <mark>Brown</mark> wants a two-thirds majority to guard against legal challenges. He's dealing, trying to entice Republicans. He has offered tax breaks for manufacturers and power companies, regulatory limits for oil refineries and repeal of a fire prevention fee hated by rural landowners. Environmentalists don't like it. Big business does. Republicans don't like Democrats. It's a vote-seller's market. The single-minded bull will need to use all his political skills. CAPTION Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District CAPTION Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District CAPTION States are pushing back against the Trump administration's voter fraud commission. (July 6, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) States are pushing back against the Trump administration's voter fraud commission. (July 6, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) CAPTION House Speaker <mark>Paul Ryan</mark> addressed the House of Representatives after Wednesday's shooting at a practice of lawmakers for the annual charity congressional baseball game. House Speaker <mark>Paul Ryan</mark> addressed the House of Representatives after Wednesday's shooting at a practice of lawmakers for the annual charity congressional baseball game. CAPTION Sen. Kamala Harris of California asks Atty. Gen. Jeff Sessions about his refusal to discuss any conversations with President Trump about the FBI investigation into Russia and the presidential campaign. Sen. Kamala Harris of California asks Atty. Gen. Jeff Sessions about his refusal to discuss any conversations with President Trump about the FBI investigation into Russia and the presidential campaign. CAPTION Atty. Gen. Jeff Sessions makes an opening statement before the Senate Intelligence Committee, where members are eager to hear an explanation of his actions related to the investigation into whether President Trump's campaign colluded with a Russian scheme to interfere in last year's election. Atty. Gen. Jeff Sessions makes an opening statement before the Senate Intelligence Committee, where members are eager to hear an explanation of his actions related to the investigation into whether President Trump's campaign colluded with a Russian scheme to interfere in last year's election. george.skelton @ latimes.com Follow @ LATimesSkelton on Twitter ALSO Our current bail system is indefensible, but the bill that aims to fix it needs work AT & T and Verizon want free rein to put new wireless transmitters in your neighborhood. Here's why that's a bad idea Bored by state races, young Californians increasingly forsake their right to vote", "articleID": "2017071707_00280157_W", "names": {"Clint Eastwood": ["Q2979323", "Q43203"], "Jerry Brown": ["Q152451", "Q717620"]}}]