[{"date": "2017-07-17", "url": "http://www.sandiegouniontribune.com/news/us-politics/la-pol-sac-skelton-cap-trade-jerry-brown-20170717-story.html#nt=oft11aH-22li2", "content": "\"He's single-minded like a bull,\" said a close friend of Gov. <mark>Jerry Brown</mark>. That was more than 42 years ago. Another Times reporter and I had tracked down friends and relatives of <mark>Brown</mark>, looking for some insight into the young man about to be inaugurated California governor for the first time. The single-minded bull description came from Frank Damrell, a former college roommate of <mark>Brown</mark> and a fellow Jesuit seminarian. He's now a retired U.S. district judge. The late Peter Finnegan, another longtime friend and fellow seminarian, said of <mark>Brown</mark>: \"I don't think he's a mystic. But I sure as hell think he's got a spiritual dimension that you don't find in politicians .\" Ironically, I had to cancel a luncheon with Damrell and some other old-timers last week because <mark>Brown</mark> simultaneously was doing his bull-spiritualist bit at a legislative committee hearing. It was too compelling to miss. Those old descriptions of <mark>Brown</mark> are as accurate today as they were in 1975. In fact, I've never seen <mark>Brown</mark> as animated, emotional and tenacious as he was before the state Senate Environmental Quality Committee, arguing for his embattled cap-and-trade climate control legislation. He resembled a cross between the <mark>Clint Eastwood</mark> character Walt Kowalski in \"Gran Torino\" --\"Get off my lawn!\" --and some street-corner preacher warning that the end is near. He's also the most effective politician Sacramento has seen in a very long time. \"I do get a little excited because, you know, as we get older we have less patience,\" the governor told the committee. \"And I want to see this thing get done.... Whatever I've got to do, I'm going to do it .\" \"This is the most important vote of your life,\" he continued, sounding a tad hyperbolic. \"Unless you think I'm lying. And I was in the seminary for three years, studying to be a good searcher of the truth. And I'm telling you, this is the truth.... And the only way I can be wrong is...if I'm stupid and ignorant, and I'm not. I've been around this business a long time .\" <mark>Brown</mark>'s hands were flying, arms flailing. Critics might say he was ranting. I'll just call it shouting. This isn't for me. I'm going to be dead. It's for you. And it's damn real .--Gov. <mark>Jerry Brown</mark>, speaking about cap-and-trade legislation to fight climate change Very rarely does a governor testify before a legislative committee. Never do I recall one sitting at the witness table for four hours--sermonizing, listening intently, writing notes and--presumably--taking names. \"Climate change is real,\" he warned. \"It is a threat to organized human existence. Maybe not in my life. I'll be dead. What am I, 79? Do I have five years more? Do I have 10 years more, 15? I don't know, 20? I don't even know if I want that long .\" Then he dramatically turned around and faced the packed audience, something legislative witnesses never do. \"When I look out here,\" he said, \"a lot of you people are going to be alive. And you're going to be alive in a horrible situation. You're going to see mass migrations, vector diseases, forest fires, Southern California burning up. That's real, guys....\" So I'm not here about some cockamamie legacy that people talk about. This isn't for me. I'm going to be dead. It's for you. And it's damn real. \"<mark>Brown</mark> fights global warming with religious zeal. But it doesn't seem plausible that he's not concerned about his legacy, his place in history. That's perfectly human and acceptable. The governor relishes his role as arguably America's leading voice against climate change. He was ceded the mantle by President Trump when Trump pulled the U.S. out of the Paris climate accord. Trump\" doesn't speak for the rest of America, \"<mark>Brown</mark> declared to foreign allies. The governor will hold his own international climate summit in San Francisco next summer. <mark>Brown</mark> wants California to show the world how to reduce greenhouse gas emissions without ruining its economy. This state produces only 1% of the planet's emissions. So our cutbacks won't amount to a hill of beans. But we can create a successful model that could be copied everywhere and have a worldwide impact, the governor believes. Updates from Sacramento\" That would be through the cap-and-trade program. But if <mark>Brown</mark> can't get his legislation passed, it would be an embarrassing step backward. Here's another huge motivation for <mark>Brown</mark>: The cap-and-trade program has been keeping his bullet train project on life support. It receives 25% of cap-and-trade revenue. So far, it has totaled $800 million. Cap and trade works this way: A cap is imposed on an industry's greenhouse gas emissions. But companies can trade for--buy--extra permits to pollute, either from the state or private investors. Caps are gradually lowered and emissions reduced. This will be a crucial week for the legislation. It cleared the Senate committee on a party-line vote. The governor will attempt to push it through both houses before lawmakers adjourn for summer vacation Friday. There are two bills. AB 398 would extend cap and trade until 2030. It's slated to expire in 2020. AB 617 would tighten controls on air pollution. It's a close vote because <mark>Brown</mark> wants a two-thirds majority to guard against legal challenges. He's dealing, trying to entice Republicans. He has offered tax breaks for manufacturers and power companies, regulatory limits for oil refineries and repeal of a fire prevention fee hated by rural landowners. Environmentalists don't like it. Big business does. Republicans don't like Democrats. It's a vote-seller's market. The single-minded bull will need to use all his political skills. CAPTION Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District CAPTION Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District Rep. Jimmy Gomez is sworn in as representative of the 34th Congressional District CAPTION States are pushing back against the Trump administration's voter fraud commission. (July 6, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) States are pushing back against the Trump administration's voter fraud commission. (July 6, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) CAPTION House Speaker <mark>Paul Ryan</mark> addressed the House of Representatives after Wednesday's shooting at a practice of lawmakers for the annual charity congressional baseball game. House Speaker <mark>Paul Ryan</mark> addressed the House of Representatives after Wednesday's shooting at a practice of lawmakers for the annual charity congressional baseball game. CAPTION Sen. Kamala Harris of California asks Atty. Gen. Jeff Sessions about his refusal to discuss any conversations with President Trump about the FBI investigation into Russia and the presidential campaign. Sen. Kamala Harris of California asks Atty. Gen. Jeff Sessions about his refusal to discuss any conversations with President Trump about the FBI investigation into Russia and the presidential campaign. CAPTION Atty. Gen. Jeff Sessions makes an opening statement before the Senate Intelligence Committee, where members are eager to hear an explanation of his actions related to the investigation into whether President Trump's campaign colluded with a Russian scheme to interfere in last year's election. Atty. Gen. Jeff Sessions makes an opening statement before the Senate Intelligence Committee, where members are eager to hear an explanation of his actions related to the investigation into whether President Trump's campaign colluded with a Russian scheme to interfere in last year's election. george.skelton @ latimes.com Follow @ LATimesSkelton on Twitter ALSO Our current bail system is indefensible, but the bill that aims to fix it needs work AT & T and Verizon want free rein to put new wireless transmitters in your neighborhood. Here's why that's a bad idea Bored by state races, young Californians increasingly forsake their right to vote", "articleID": "2017071707_00280157_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2017-07-17", "url": "http://news.opb.org/news/article/npr-timeline-of-events-the-2013-miss-universe-pageant/", "content": "From left, Miss Connecticut USA Erin Brady and <mark>Donald Trump</mark> look on as Russian singer Emin Agalarov speaks onstage with his father Aras Agalarov during a news conference after Brady won the Miss USA 2013 pageant on June 16, 2013, in Las Vegas. Jeff Bottari, AP In November 2013, <mark>Donald Trump</mark> took the Miss Universe pageant to Moscow, bringing his trademark glitz and glamour to a country that had never hosted a major beauty contest. Trump later boasted that he met a lot of important people at the pageant. They included the billionaire real estate tycoon Aras Agalarov, who is now figuring prominently in the investigations into the Trump campaign's ties to Russia. Here is a look back at how the Miss Universe contest came together and what happened there. 2012 British-born music promoter Rob Goldstone began representing singer Emin Agalarov, son of billionaire real estate investor Aras Agalarov. At the time, Emin was married to <mark>Leyla Aliyeva</mark>, the daughter of Azerbaijani president Ilham Aliyev. March 21, 2013 In a Facebook post from New York, Goldstone announced he would be attending the Miss USA pageant in June. He served as a preliminary round judge at the event. May 31, 2013 Emin Agalarov released a music video featuring 2012 Miss Universe Olivia Culpo. This collaboration led Golstone to meet with the head of the Miss Universe Organization, Paula Shugart, according to Mother Jones. June 15, 2013 \"Fun meeting with <mark>Donald Trump</mark>,\" Rob Goldstone posted on Facebook. June 16, 2013 During the Miss USA pageant, Trump announced the location for the 2013 Miss Universe pageant: Crocus City Hall in Moscow, Russia. Trump was joined on stage by Aras Agalarov, president of Crocus Group, and his son. The elder Aras later told a Russian news outlet that Trump greeted him warmly, saying, \"\"Look who came to me! This is the richest man in Russia!\" ' Later in June, the Russian parliament passed a series of anti-gay laws. In an interview with Miss Universe co-host <mark>Thomas Roberts</mark> before the event in November, Trump defended his decision to keep the pageant in Moscow. June 18, 2013 Trump tweeted about the upcoming pageant. \"Do you think Putin will be going to The Miss Universe Pageant in November in Moscow - if so, will he become my new best friend?\" he wrote. November 9, 2013 Miss Universe took place at Crocus City Hall in Moscow, Russia. Emin Agalarov performed at the event. November 13, 2013 In an interview with Forbes, Emin Agalarov said Crocus Group, \"may theoretically consider a possibility of building a Trump Tower as one of our skyscrapers .\" November 20, 2013 Emin Agalarov released his music video for \"In Another Life .\" The video features him at a dull business meeting, daydreaming about Miss Universe contestants. His fantasies are suddenly interrupted by the man running the meeting, <mark>Donald Trump</mark>, who barks, \"You're fired!\" The pop musician would later tweet about the video, after a controversial dossier was leaked making allegations about Trump's Russia visit. February 4, 2014 Ivanka Trump visited Crocus City Hall in Moscow. Emin Agalarov gave her a tour. March 8, 2014 Emin Agalarov performed at the 2014 WGC-Cadillac Championship golf tournament held at Trump National Doral near Miami, Fla.. September 21, 2015 Trump told radio host Hugh Hewitt about meeting Russian oligarchs during the Miss Universe pageant. He said, \"...two years ago, I was in Moscow. And a lot of the people, Hugh, they were there, and they had an amazing time. And they're terrific people. You know, I was getting along with them so great. I really loved my weekend, I called it my weekend in Moscow. But I was with the top level people, both oligarchs and generals, and top of the government people. I can't go further than that, but I will tell you that I met the top people, and the relationship was extraordinary .\" June 3, 2016 Rob Goldstone emailed <mark>Donald Trump</mark> Jr., offering up incriminating information on Hillary Clinton. \"Emin just called and asked me to contact you with something very interesting,\" he wrote. Goldstone said the information came from the \"crown prosecutor,\" an apparent reference to Russia's top prosecutor, Yuri Chaika. Throughout the campaign, Emin Agalarov and Goldstone supported Trump on social media. \"You proved the entire world wrong, it's just incredible!\" Emin Agalarov posted on November 10. June 9, 2016 Russian lawyer Natalia Veselnitskaya and a Russian-American lobbyist met with Trump Jr., then-Trump campaign chairman Paul Manafort and Trump son-in-law Jared Kushner. July 24, 2016 On CNN, Trump Jr. skewered the Democrats for accusing the Trump campaign of colluding with Russian hackers to release documents from the Democratic National Committee. \"I mean, I can't think of bigger lies--but that exactly goes to show you what the DNC and what the Clinton camp will do. They will lie and do anything to win,\" he said. November 8, 2016 Goldstone posted a picture of Emin Agalarov, himself and Trump captioned \"The A Team - headed to the White House!\" November 13, 2016 Days after the election, Goldstone shared a picture of himself, Emin Agalarov and president-elect Trump that ran on Russian TV. July 8, 2017 The New York Times first reported the existence of the meeting with Trump Jr., Manafort, Kushner and Veselnitskaya. July 11, 2017 Trump Jr. published the email exchange with Goldstone on his personal Twitter account. Later in the day, White House principal deputy press secretary Sarah Huckabee Sanders reads a statement from the president: \"My son is a high-quality person, and I applaud his transparency .\" Copyright 2017 NPR. To see more, visit http: //www.npr.org/. Featured Adventure explore view more photos get driving directions print field guide + map powered by Explore Nearby Adventures More News Contract Dispute Grounds Converted 747 As Wildfires Rage Across The West Hate, Bias Incidents Are On The Rise In Eugene Fairview Police Department Merges With Multnomah County Sheriff's Office Helicopters To Drop 350,000 Trout Into Oregon's High Mountain Lakes More OPB History, Beer And Throwing Heavy Things At Portland Highland Games 3 Things About Arts In The 2017 Oregon Legislative Session The Decemberists As Offa Rex | Tracy K. Smith | DaVinci Days | Bend Arts Center", "articleID": "2017071709_00279126_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Leyla Aliyeva": ["Q284744", "Q298532"], "Thomas Roberts": ["Q21282391", "Q51590127", "Q56598249", "Q7793584", "Q7819809"]}}, {"date": "2017-07-17", "url": "https://www.washingtonpost.com/news/comic-riffs/wp/2017/07/17/as-war-for-the-planet-of-the-apes-soars-is-andy-serkis-our-most-underrated-box-office-draw/", "content": "Comic Riffs Perspective Perspective Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events As \"War for the Planet of the Apes' soars, is Andy Serkis our most underrated box-office draw? The inside track on Washington politics. Be the first to know about new stories from PowerPost. Sign up to follow, and we'll e-mail you free updates as they're published. You'll receive free e-mail news updates each time a new story is published. You're all set! By Michael Cavna By Michael Cavna July 17 at 7:00 AM Follow @ comicriffs Andy Serkis, Terry Notary and Michael Adamthwaite in\" War for the Planet of the Apes. \"(Twentieth Century Fox) AS FOX's\" War for the Planet of the Apes \"scales a $102.5 million global opening, the question also rises: Is Andy Serkis, well-known as a motion-capture actor, still underrated as a reliable presence in so many box-office powerhouses? Consider: Serkis's films have grossed more than $1.8 billion simply when he's playing a simian--including his current\" Apes \"trilogy and 2005's\" <mark>King Kong</mark>. \"Throw in the London-born actor's presence in such franchises as Avengers (\"Age of Ultron\" ), Star Wars (\"The Force Awakens\" ) and the Lord of the Ring/Hobbit films, and Serkis's blockbuster movies have grossed more than $8 billion worldwide. And once you add his next two big films--December's \"Star Wars: The Last Jedi\" and next year's \"Black Panther\" --Serkis could become a $10 billion man in terms of what his franchise films have grossed worldwide. Actor Andy Serkis appears on the red carpet last week for a New York screening of \"War for the Planet of the Apes .\" (Bria Webb/Reuters) It helps enormously, of course, that the actor who got his start three decades ago on British TV comedies has become a go-to performer for CG-heavy roles, including motion capture. Ever since his iconic role as Gollum for <mark>Peter Jackson</mark>'s Tolkien movies, Serkis--suddenly a precious commodity--has been able to go where the money is. But most actors are fortunate to have just a single character that becomes fixed in the pop-culture firmament. Besides Gollum, filmgoers around the world now know such Serkis characters as Caesar (the \"Apes\" trilogy) and Supreme Leader Snoke (Star Wars), plus he will reprise his Marvel character Ulysses Klaue (aka Klaw) in February's \"Black Panther .\" Many fans are hopeful that he will return as Captain Haddock for a \"Tintin\" sequel. Then there is the matter of the Serkis-directed \"Jungle Book,\" a live-action adaptation with an A-list cast that's not to be confused with Disney's recent behemoth of a hit. If Serkis (who does double duty in his film as Baloo) can turn even a crowded-market \"Jungle Book\" into a hit next year, then his bag of cinematic mo-cap magic will seem bottomless. Till then, the Golden Globe-nominated actor should remain swimming in box-office success. The well-reviewed \"War for the Planet of the Apes\" grossed $56.5 million in its domestic debut to hold off Sony's \"Spider-Man: Homecoming\" ($45.2 million), which plummeted 61 percent in its second weekend. The current \"Apes\" trilogy has grossed nearly $1.3 billion worldwide--and come December, Serkis's \"Last Jedi\" should begin a $2 billion-plus launch. Now, if only the Academy could appropriately appreciate Serkis with an Oscar nod to honor inspired performance beneath the painted pixel. entertainment", "articleID": "2017071711_00349264_W", "names": {"King Kong": ["Q2171232", "Q22278621", "Q6411824"], "Peter Jackson": ["Q25521960", "Q3376667", "Q39073400", "Q4160117", "Q4465", "Q52743056", "Q54556363", "Q7174914", "Q7174916", "Q7174918", "Q7174919", "Q7174920", "Q7174922", "Q7174923"]}}, {"date": "2017-07-17", "url": "http://magicvalley.com/business/sushi-lovers-rejoice-sushi-tokyo-reopens-months-after-fire/article_215c6b88-33b9-57c8-9a63-1799a35ee408.html", "content": "TWIN FALLS--Sushi Tokyo opened its doors Monday after fire damage closed the business for more than nine months. Owner <mark>Tony Tse</mark> said the newly remodeled restaurant is open 11:30 a.m. to 9 p.m. Monday through Thursday and 11:30 a.m. to 9:30 p.m. Friday and Saturday. \"We're opening all day now,\" he said. Sushi Tokyo had previously closed for several hours after the lunch rush. Customers can expect to see many of the same faces serving them--as well as the same menu, <mark>Tse</mark> said. Sushi Tokyo, 1111 Blue Lakes Blvd.. N., Suite B, closed in October after crumbs from the deep fryer spontaneously combusted in a garbage can in the pantry. The restaurant was heavily damage, requiring extensive remodeling that took longer than originally projected. \"It feels good, but it feels stressful,\" <mark>Tse</mark> said about reopening. Also open: Epic Corals Another business that opened this month caters to a different kind of fish love. Saltwater aquarium owners have a new local option for fish, plants and supplies. Epic Corals opened in early July at 639 Washington St. N., Suite B. The business offers saltwater fish, aquariums and supplies and live corals. \"We lease fish tanks. We sell fish tanks. We maintain them, service them,\" co-owner Marty Summers said. Customers can place special orders. Summers co-owns the business with Ethan Pinch. Epic Corals is open 1 p.m. to 8 p.m. Monday through Saturday. Information: Call 733-3775.", "articleID": "2017071722_00536833_W", "names": {"Tony Tse": ["Q5541244", "Q58077300"]}}, {"date": "2017-07-18", "url": "http://klaw.com/thomas-rhett-wife-lauren-date-night-sunset/", "content": "Thomas Rhett and Wife Lauren's Pre-Baby Date Night Features Sunset, Dolphins By Cillea Houghton July 18, 2017 11:40 AM | Taste of Country Share on Facebook Share on Twitter Sunset date night at the beach A post shared by ThomasRhettAkins (@ thomasrhettakins) on Jul 17, 2017 at 5:31 pm PDT Thomas Rhett and his wife Lauren have been on a beach vacation, and Rhett shared a sweet video of the two of them enjoying a sunset date night. Rhett shares that they were on a kayaking adventure and decided to pull over to a little sandbar and watch the \"sick\" sunset from the beach. But they had some special guests--dolphins can be seen popping their heads out of the water in a video he posted on Instagram. \"Oh they're so close!\" Lauren adorably gushes. \"Date night to the sandbar. The colors God painted tonight were unbelievable aaaand dolphins were playing in the sunset right in front of us,\" she writes on her own Instagram page, describing the gorgeous evening. It's Bikini Season for These Country Mamas-to-Be Subscribe to KLAW-FM on This is just one of many glimpses of the couple's tropical getaway that they've shared. Rhett posted a cute photo of he and his pregnant wife in the water, with Lauren showing off her baby bump in a bikini and her husband dubbing her a \"100% smoke show .\" She's set to give birth to their second daughter on August 8. After a year-long adoption process, the beloved country music couple brought home Willa Gray from Africa in spring of 2017, just months after announcing they were pregnant with another little girl. Rhett just scored another No. 1 hit with his most recent single, \"Craving You\" featuring Maren Morris, which serves as the lead single off his upcoming third studio album that will drop in fall of 2017. He's currently on his 2017 Home Team Tour with openers Kelsea Ballerini, <mark>Russell Dickerson</mark> and the newly-engaged Ryan Hurd. Baby Bump on the Mind? Check Out These! Image of Next: See Country's Best Baby Announcements Source: Thomas Rhett and Wife Lauren's Pre-Baby Date Night Features Sunset, Dolphins Filed Under: Thomas Rhett Category: Country Music News Share on Facebook Share on Twitter More Leave a comment Send to a friend! Print this page Pin it! Reddit This! Share on Tumblr!", "articleID": "2017071818_00654828_W", "names": {"Russell Dickerson": ["Q24572267", "Q58067337"]}}, {"date": "2017-07-19", "url": "http://www.kwqc.com/content/news/Mother-of-slain-Davenport-teen-to-hold-Justice-for-Marcus-Jones-event-435360083.html", "content": "DAVENPORT, Iowa (KWQC) - Anthony \"<mark>Marcus</mark>\" <mark>Jones</mark>, 17, was murdered in August of 2014. He was found a block away from home with a fatal gunshot wound. His killer has never been found. For the third year, <mark>Jones</mark>' mother Kerri Nunn will host an annual outdoor event at Cork Hill Park. Justice for <mark>Marcus Jones</mark> will have guest speakers on addiction, suicide prevention, bullying and gun violence. \"The event is to keep <mark>Marcus</mark>' name out in the public because his killer has never been found,\" said Nunn. \"Also, the event is to bring information to the youth and teens, or young adults, about issues they are dealing with today .\" It's important to Nunn that police officers attend, as well. Nunn said she likes seeing them \"socialize and interact with the kids .\" Davenport Mayor Frank Klipsch is also expected to be there. T-shirts saying \"Justice for <mark>Marcus</mark>\" and \"Stop the Violence\" will be sold--helping to fund future events. Monetary donations will be accepted. Canned food donations are also being collected. \"We will have a bounce house for the younger kids and a candy toss,\" Nunn said. Justice for <mark>Marcus Jones</mark> is happening at 5 p.m. on Thursday, August 10 at Cork Hill Park.", "articleID": "2017071911_00111666_W", "names": {"Marcus Jones": ["Q16214908", "Q56946668", "Q6758258", "Q6758259", "Q750398"]}}, {"date": "2017-07-20", "url": "http://local15tv.com/news/local/president-slams-attorney-general-jeff-sessions", "content": "President slams Attorney General Jeff Sessions by Andrea Ramey Sessions was the first U.S. Senator to support Trump during the campaign and remained loyal throughout. (WPMI) A A MOBILE, Ala. (WPMI)--President Trump was highly critical of Attorney General Jeff Sessions in a New York Times interview Wednesday, saying he would not have picked Sessions as his Attorney General. \"Sessions never should've recused himself. He should've told me before he took the job, and I would've picked somebody else .\" Trump said it was \"unfair\" for Sessions to rescue himself from the Russia investigation, which led to special counsel being appointed. In a news conference this morning, Sessions said he's staying put. . \"I have the honor of serving as Attorney General. We love this job. We love this department, and I plan to continue to do so as long as that is appropriate,\" said Sessions. \"For Trump to turn around and stab Sessions in the back like this unconscionable,\" said conservative columnist Quin Hillyer. Sessions was the first U.S. Senator to support Trump during the campaign and remained loyal throughout. The President's remarks rebuked by conservatives in Sessions home state, where he remains a popular figure. \"If Trump fires Jeff Sessions, then that means the only person left who Trump will not show loyalty to is Vladimir Putin,\" said Hillyer. The phone lines also lighting up on local conservative talk radio. \"Trump shouldn't have thrown him under the bus .\" said a caller on FM Talk 106.5 Midday Mobile. \"You're telling me the recusal, which was the right thing to do, brought the problem? Come on, give me a break!\" said host <mark>Sean Sullivan</mark>. In the special election to fill Sessions seat, Republicans have aligned themselves with Trump, some attacking each other for not being loyal enough. Rep. Mo Brooks, who has been on the receiving end of those attack ads said today, he understands President Trump's position but says Sessions \"did the right thing\" and is \"a person of the highest caliber .\" close", "articleID": "2017072023_00004708_W", "names": {"Sean Sullivan": ["Q224496", "Q28871822", "Q3476780", "Q55361114", "Q7441461", "Q7441462", "Q7441463"]}}]