[{"date": "2017-07-21", "url": "http://jamaicaobserver.com/business-report/paramount-looks-to-markets-in-cuba-and-haiti_105451?profile=1606", "content": "Paramount looks to markets in Cuba and Haiti BY KARENA BENNETT Tweet Listed company Paramount Trading Jamaica Ltd hopes to finalise a deal with some of Cuba's largest manufacturing groups and companies. The company, which is currently in partnership with Pittsburgh-based Allegheny Petroleum to build a $500-million oil-blending plant on Waltham Park Road in Kingston, also has its eyes on exporting products to the French-speaking Caribbean country Haiti. In a series of Jamaica Promotions Corporation (Jampro) - organised tours recently, top representatives from Cuba's largest manufacturing groups and companies--including Imeco, Quimimport, Coralsa and CubaSol--were hosted at Paramount's plant on East Bell Road in Kingston. Members of the delegation, including commercial attaché at the Cuban Embassy, Jorgé Sanchez, were also given a tour of the company's Waltham Park Road lubricant facility set to open in September. In a telephone interview with the Jamaica Observer yesterday, managing director of Paramount Trading, <mark>Hugh Graham</mark>, reckons that now is a good time for companies like Paramount and to a greater extent, Jamaica, to secure contracts with businesses in Cuba. \"The interesting thing about Cuba is that since they seem to be on the verge of opening up, we would want to get in there early because when they do open up, you will have the big companies from America that will come in. So I'm thinking that the first mover advantage would work well for us,\" he said. <mark>Graham</mark> noted that with volume demands three times that of Jamaica, signing off on supplier contracts with the Cuban manufacturers would be \"icing on the cake\" for the company. Paramount currently operates five business units, including its chemical products arm which deals in food and industrial products, the distribution of SIKA-branded products, manufacturing of commercial cleaning agents, haulage services and lubricants business. According to <mark>Graham</mark>, the delegates have shown particular interest in the Altra brand of lubricant for which the company has jointly partnered with Allegheny on producing. \"They displayed other interest in our baking soda from the food side of the business. We have a low sodium baking powder that works well with diabetics because the sodium content is lower than the regular baking powder,\" he told the Caribbean Business Report. In an effort to encourage relationships and business partnerships between Cuba and Jamaica, Jampro spearheaded another meeting with the companies yesterday aimed at determining the specific needs of each business. Paramount anticipates fulfilling the demand of the Cuban manufacturers if it secures a contract, given the planned opening of its lubricant facility later this year. The managing director is also of the view that the company will be able to successfully compete against industry giants in both Cuba and Haiti, given the importation tax relief for local companies manufacturing goods on the island. \"The competitive advantage of manufacturers here in Jamaica is that you don't pay the duties on the raw material that goes in manufacturing in the same way you pay the duties on the finished product .\" So this will certainly make us competitive as it relates to not having to pass that cost on to customers, which is almost 50 per cent duty, \"he said. ADVERTISEMENT", "articleID": "2017072107_00412918_W", "names": {"Hugh Graham": ["Q1634361", "Q5930973"]}}, {"date": "2017-07-22", "url": "http://www.wbal.com/article/253488/2/longtime-washington-news-anchor-jim-vance-dies-at-age-75", "content": "WBAL's <mark>Robert Lang</mark> and NBC 4's <mark>Jim Vance</mark> at the University of Maryland in March WASHINGTON (AP)--A longtime television news anchor in the nation's capital has died. WRC-TV President and General Manager Jackie Bradford said in a statement that <mark>Jim Vance</mark> died Saturday morning. He was 75 years old. <mark>Vance</mark> told viewers earlier this year that he was undergoing treatment for cancer. <mark>Vance</mark> joined the NBC station in 1969 and moved to the anchor chair in 1972. The Washington Post reports that <mark>Vance</mark>'s 11 p.m. shows with longtime broadcast partner Doreen Gentzler regularly attracted more viewers than the prime-time programs on the three major cable networks combined. Bradford said <mark>Vance</mark>'s was \"not only the soul of NBC4 but of the entire Washington area .\" Washington Mayor Muriel Bowser tweeted that <mark>Vance</mark> was a \"steady voice who shared the news - good or bad - with grace .\" <mark>Jim Vance</mark>'s smooth voice and calm presence made viewers feel like, no matter how bad the news was, it would be OK. https: //t.co/hwoPOiT6wO", "articleID": "2017072220_01183562_W", "names": {"Jim Vance": ["Q16106127", "Q27042411"], "Robert Lang": ["Q16731223", "Q2157973", "Q56433508", "Q914398"]}}, {"date": "2017-07-23", "url": "http://indiatoday.intoday.in/story/mithali-raj-heartbreak-womens-world-cup-jhulan-goswami-final-india/1/1009151.html", "content": "India Today googlepluse Mithali Raj's heartbreak in World Cup final continues after India go down by 9 runs Mithali Raj's wish of lifting the World Cup remained so as India lost to England by nine runs at Lord's. In 2005, she was a captain of the side that lost to Australia in the final at Centurion in 2005. Highlights 1 Mithali Raj ended up as the second most runs in this World Cup, behind Tammy Beaumont. 2 Jhulan Goswami ended the tournament with 10 wickets and figures of 3/23 in the final. 3 Mithali Raj is the only Indian captain to reach two 50-over World Cup finals. Mithali Raj's heartbreak continued as in the final of the Women's World Cup at Lord's on Sunday. She was the captain of the Indian team that lost to Australia in the final of the Women's World Cup back in 2005 at Centurion as well. India lost to England by nine runs Ahead of the big final, Mithali had said that she wanted to go a step further and lift the Cup this time. \"It's been seven years since we qualified for the final and 12 years since we reached the final. So, the girls want to do well. 2005 we were runners-up and this time I want to go one step further,\" said the Indian captain. But her poor luck continued. Mithali and Jhulan Goswami were the only players from the 2005 team and both sounded positive about a victory after the English were restricted to 228/7 from their 50 overs and India were on course for a victory after a flying start. But, England pulled off a remarkable comeback to bowl India out for 219 and lift their fourth World Cup. GOOD TOURNAMENT FOR THE VETERANS Mithali and Jhulan both stood up in the tournament. While Mithali finished as the second highest run-getter with 409 from nine games in the tournament, Goswami picked up 10 wickets in this year's edition. Although Mithali missed out in the final, Goswami did not. She came up with an to help India restrict England 228/7. inspiring performance in the final Meanwhile, the India captain was the most consistent player of the tournament. She got runs in most of the matches and led the team brilliantly and showed great calmness under pressure. The 34-year-old stood up and hammered a century against New Zealand in a must-win game for India and also played an important knock of 36 against Australia in the semis. She formed an important partnership with <mark>Harmanpreet Kaur</mark> to stabilise the innings before the all-rounder smashed her way to a 115-ball 171 *. On a personal note, Mithali became the first woman to score seven consecutive fifties in One-Day Internationals. Not only that, she is currently the highest run scorer in ODIs with 6190 runs from 186 matches and averages a whopping 51.58. She has hit six centuries and 49 half-centuries. For more news from India Today, follow us on Twitter @ indiatoday and on Facebook at facebook.com/IndiaToday For news and videos in Hindi, go to AajTak. in. ताज़ातरीन ख़बरों और वीडियो के लिए आजतक. इन पर आएं.", "articleID": "2017072317_00624227_W", "names": {"Harmanpreet Kaur": ["Q3525920", "Q52239619"]}}, {"date": "2017-07-24", "url": "http://www.shropshirestar.com/entertainment/showbiz/2017/07/24/mental-health-crisis-in-music-industry-as-campaign-launched-following-chester-benningtons-death/", "content": "\"Mental health crisis' in music industry as campaign launched following Chester Bennington's death Less than an hour ago Music Minds Matter aims to provide a 24/7 phone line. Subscribe to our daily newsletter Sign UpChester Bennington (PA) A funding campaign has been launched to address the\" mental health crisis \"in the British music industry. Prompted by the death of Linkin Park frontman Chester Bennington, charity Help Musicians has launched Music Minds Matter with the aim of providing a 24/7 mental health service phone line. The charity kicked off the funding drive with a $100,000 injection as CEO <mark>Richard Robinson</mark> described the situation as\" urgent \". He called on the music industry and philanthropists to offer\" arm in arm \"support. Chester Bennington inspired many with his music (Lewis Stickley/PA) The helpline will combine listening, advice and signposting with medical, clinical, therapeutic and welfare support for those who need it and is set to launch later this year. The campaign has been backed by Linkin Park's management according to Madina Lake bassist Matthew Leone, who has toured with the band. CHARITY EXCLUSIVE Help Musicians has announced a £ 100k #MentalHealth Fund on @ bbc5live as a response to the death of #ChesterBennington pic.twitter.com/hkMVtuqeJM--Help Musicians UK (@ HelpMusiciansUK) July 23, 2017 Advertising He said Bennington would have approved of the helpline, adding:\" I spent many hours working alongside Chester and he was an incredibly passionate man. \"\"Likewise, having spoken to Linkin Park's management, I know that they are anxious to follow this campaign through to a successful conclusion .\" This unique service will revolutionise the way musicians and the music industry think about mental health. It's been a long time in coming and I strongly urge the music community to support this brand new fund. \"Artists/fans @ HelpMusiciansUK @ SweetRelief & like orgs exist 4 YOU! Ur never alone, there's always a solution. Life is tough Love is tougher--Matthew Leone (@ Madinafire) July 21, 2017 Advertising A number of other stars from the world of music also lent their support including Enter Shikari frontman Rou Reynolds who said:\" Whilst creating and playing music has a wonderfully positive influence on mental health, it is not an all encompassing elixir for the vast swathes of mental health problems that our society breeds. \"The music industry has a dark history with the tragic loss of too many amazing people to suicide, so I'm very happy to hear about Music Minds Matter and support them in all they're about to do .\" Donate to Music Minds Matter campaign here.", "articleID": "2017072413_00543668_W", "names": {"Richard Robinson": ["Q22280073", "Q25711399", "Q28058362", "Q51590316", "Q55713112", "Q7328701"]}}, {"date": "2017-07-24", "url": "http://www.skysports.com/football/news/12040/10959868/huddersfield-town-defender-christopher-schindler-signs-new-three-year-contract", "content": "Huddersfield Town defender Christopher Schindler signs new three-year contract By Sky Sports News HQ Last Updated: 24/07/17 3:04 pm Huddersfield's Wembley hero Christopher Schindler celebrates his winning penalty in the Sky Bet Championship play-off Huddersfield Town defender Christopher Schindler has signed a new three-year contract. Schindler, who scored the winning penalty at Wembley as the Terriers secured promotion to the Premier League, has committed his future to the club until 2020, with Huddersfield having the option of a further year's extension. The 27-year-old centre-back made the move to the <mark>John Smith</mark>'s Stadium from 1860 Munich for a then-club record fee in June 2016 and became a regular in the side, starting 46 matches. Schindler joins <mark>Chris Lowe</mark>, Elias Kachunga, Jonathan Hogg, <mark>Tommy Smith</mark> and Rajiv van La Parra in committing their futures to the club. SIGNED! Promotion winner Christopher Schindler has committed his future to #htafc penning a new deal until 2020 https: //t.co/Zmvu9C9iT0 (AT) pic.twitter.com/9BhtyGMeey--Huddersfield Town (@ htafcdotcom) July 24, 2017 \"When Christopher Schindler joined the club, I always said I was comfortable to break the transfer record to bring him in and I think he totally proved his worth last season,\" said Huddersfield head coach <mark>David Wagner</mark>. \"Christopher was one of our standout players last year; he adapted really well to English football and has developed during the year he's been with us .\" He is a very strong character, who leads the group both on and off the pitch and he's responsible not only for himself but the team and the football club as well. \"Everyone could see at Wembley how strong he is as a person, when he stepped-up and scored the winning penalty; it's great to have a person like him in our dressing room. Huddersfield Town have been showing off their new kit as they prepare for a first-ever season in the Premier League .\" He is an excellent defender who suits our style of play but now the challenge for him and his teammates is to make the step-up into the Premier League. \"Watch Huddersfield v Newcastle on August 20. Coverage begins on Sky Sports Main Event and Sky Sports Premier League at 12:30 pm.", "articleID": "2017072414_00506554_W", "names": {"Chris Lowe": ["Q15994592", "Q433587", "Q46939502", "Q5107275", "Q5107277"], "David Wagner": ["Q1177029", "Q13102284", "Q5240764", "Q871069", "Q93041"], "John Smith": ["Q14948763", "Q16225555", "Q16674228", "Q1701779", "Q18633303", "Q18706057", "Q2031229", "Q20856697", "Q21228107", "Q23008642", "Q23008647", "Q29643615", "Q30612639", "Q3809625", "Q40765031", "Q42225247", "Q43392856", "Q43910764", "Q444388", "Q47126468", "Q47452313", "Q48810908", "Q51586908", "Q54577013", "Q54635521", "Q54635522", "Q6258245", "Q6258251", "Q6258294", "Q6258296", "Q6258298", "Q6258312", "Q6258332", "Q6258338", "Q6258342", "Q6258344", "Q6258352", "Q6258362", "Q6258364", "Q6258373"], "Tommy Smith": ["Q10581", "Q1179411", "Q13131957", "Q16235031", "Q1770763", "Q462503", "Q652743", "Q7819862", "Q7819863", "Q7819864", "Q7819865", "Q7819866"]}}, {"date": "2017-07-24", "url": "http://www.nydailynews.com/newswires/news/national/latest-lawmaker-blames-female-senators-failed-bill-article-1.3351186", "content": "WASHINGTON (AP)--The Latest on the ongoing effort by congressional Republicans to pass a health care bill (all times local): 1:15 p.m.. A Texas Republican congressman says it's \"absolutely repugnant\" that the GOP-led Senate hasn't acted on repealing the health care law and he singled out \"some female senators from the Northeast .\" In a radio interview with \"1440 Keys,\" Rep. Blake Farenthold said the Senate has failed to show the courage to dismantle the health care law. The Senate is expected to vote Tuesday on whether to move ahead on legislation. Farenthold complained about some female lawmakers and said, \"If it was a guy from south Texas, I might ask him to step outside and settle this Aaron Burr-style .\" Maine Sen. <mark>Susan Collins</mark> has been consistent in opposing the GOP replacement to Obamacare. Other female senators who have expressed reservations are <mark>Shelley Moore Capito</mark> of West Virginia and Lisa Murkowski of Alaska. ___ 12:25 p.m.. The Republican governor of Ohio says it would be a mistake for the Senate to move ahead on health and \"force a one-sided deal that the American people are clearly against .\" FILE - In this March 1, 2017 file photo, President Donald Trump, flanked by Senate Majority Leader Mitch McConnell of Ky., left, and House Speaker <mark>Paul Ryan</mark> of Wis., speaks during a meeting with House and Senate leadership, in the Roosevelt Room of the White House in Washington. Repeal and replace \"Obamacare .\" Just repeal. Or let it fail _ maybe with a little nudge. President Donald Trump has sent a flurry of mixed messages, raising questions about the White House strategy on health care. (AP Photo/Evan Vucci, File) In a statement on Monday, Gov. John Kasich says Republicans and Democrats should work together openly to address the failings of the Obama health law and come up with a bipartisan solution. Kasich, who sought the GOP presidential nomination last year, said the American people will come out on the losing end if Republicans try to force a vote without open dialogue and transparency. Kasich's comments add pressure to Ohio's Republican senator, Rob Portman, ahead of the vote. ___ 9:30 a.m. President Donald Trump has a message for Republican lawmakers deliberating the latest proposed health care bill: this is your last chance. Trump is tweeting that \"Republicans have a last chance to do the right thing on Repeal & Replace after years of talking & campaigning on it .\" Senate Majority Leader Mitch McConnell has struggled to get the votes needed from GOP lawmakers to pass the bill, particularly in the face of solid opposition from the Democrats. In this July 18, 2017 photo, Senate Majority Leader Mitch McConnell of Ky. speaks at a news conference on Capitol Hill in Washington. There are many reasons why the Senate will probably reject Republicans' crowning bill razing much of \"Obamacare .\" There are fewer why Senate Majority Leader Mitch McConnell might revive it and avert a GOP humiliation. (AP Photo/Andrew Harnik) Facing criticism from the president, the Senate postponed its summer break as it works to break through the stalemate. The White House remains adamant that a path to passing the bill remains, but concedes that the longer the process drag on, the harder it will be to move the bill forward. ___ 3:10 a.m.. The Senate will move forward with a key vote this week on a Republican health bill but it's a mystery what exactly they will be voting on. It's not yet known whether the legislation will seek to replace President Barack Obama's health care law or simply repeal it. Sen. <mark>John Thune</mark> of South Dakota says Senate Majority Leader Mitch McConnell will make a decision soon on which bill to bring up for a vote, depending on ongoing discussions with GOP senators. <mark>Thune</mark> sought to cast this week's initial vote as important but mostly procedural, allowing senators to begin debate and propose amendments. But he acknowledged senators should be able to know beforehand what bill they will be considering. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags: newswires associated press us newswires Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2017072417_01082947_W", "names": {"John Thune": ["Q4571225", "Q462981"]}}]