[{"date": "2017-07-24", "url": "http://www.nydailynews.com/newswires/news/national/latest-lawmaker-blames-female-senators-failed-bill-article-1.3351186", "content": "WASHINGTON (AP)--The Latest on the ongoing effort by congressional Republicans to pass a health care bill (all times local): 1:15 p.m.. A Texas Republican congressman says it's \"absolutely repugnant\" that the GOP-led Senate hasn't acted on repealing the health care law and he singled out \"some female senators from the Northeast .\" In a radio interview with \"1440 Keys,\" Rep. Blake Farenthold said the Senate has failed to show the courage to dismantle the health care law. The Senate is expected to vote Tuesday on whether to move ahead on legislation. Farenthold complained about some female lawmakers and said, \"If it was a guy from south Texas, I might ask him to step outside and settle this Aaron Burr-style .\" Maine Sen. <mark>Susan Collins</mark> has been consistent in opposing the GOP replacement to Obamacare. Other female senators who have expressed reservations are <mark>Shelley Moore Capito</mark> of West Virginia and Lisa Murkowski of Alaska. ___ 12:25 p.m.. The Republican governor of Ohio says it would be a mistake for the Senate to move ahead on health and \"force a one-sided deal that the American people are clearly against .\" FILE - In this March 1, 2017 file photo, President Donald Trump, flanked by Senate Majority Leader Mitch McConnell of Ky., left, and House Speaker <mark>Paul Ryan</mark> of Wis., speaks during a meeting with House and Senate leadership, in the Roosevelt Room of the White House in Washington. Repeal and replace \"Obamacare .\" Just repeal. Or let it fail _ maybe with a little nudge. President Donald Trump has sent a flurry of mixed messages, raising questions about the White House strategy on health care. (AP Photo/Evan Vucci, File) In a statement on Monday, Gov. John Kasich says Republicans and Democrats should work together openly to address the failings of the Obama health law and come up with a bipartisan solution. Kasich, who sought the GOP presidential nomination last year, said the American people will come out on the losing end if Republicans try to force a vote without open dialogue and transparency. Kasich's comments add pressure to Ohio's Republican senator, Rob Portman, ahead of the vote. ___ 9:30 a.m. President Donald Trump has a message for Republican lawmakers deliberating the latest proposed health care bill: this is your last chance. Trump is tweeting that \"Republicans have a last chance to do the right thing on Repeal & Replace after years of talking & campaigning on it .\" Senate Majority Leader Mitch McConnell has struggled to get the votes needed from GOP lawmakers to pass the bill, particularly in the face of solid opposition from the Democrats. In this July 18, 2017 photo, Senate Majority Leader Mitch McConnell of Ky. speaks at a news conference on Capitol Hill in Washington. There are many reasons why the Senate will probably reject Republicans' crowning bill razing much of \"Obamacare .\" There are fewer why Senate Majority Leader Mitch McConnell might revive it and avert a GOP humiliation. (AP Photo/Andrew Harnik) Facing criticism from the president, the Senate postponed its summer break as it works to break through the stalemate. The White House remains adamant that a path to passing the bill remains, but concedes that the longer the process drag on, the harder it will be to move the bill forward. ___ 3:10 a.m.. The Senate will move forward with a key vote this week on a Republican health bill but it's a mystery what exactly they will be voting on. It's not yet known whether the legislation will seek to replace President Barack Obama's health care law or simply repeal it. Sen. <mark>John Thune</mark> of South Dakota says Senate Majority Leader Mitch McConnell will make a decision soon on which bill to bring up for a vote, depending on ongoing discussions with GOP senators. <mark>Thune</mark> sought to cast this week's initial vote as important but mostly procedural, allowing senators to begin debate and propose amendments. But he acknowledged senators should be able to know beforehand what bill they will be considering. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags: newswires associated press us newswires Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2017072417_01082947_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Shelley Moore Capito": ["Q459618", "Q47506415"], "Susan Collins": ["Q22279", "Q7647692"]}}, {"date": "2017-07-27", "url": "http://www.joplinglobe.com/region/trump-announces-billion-foxconn-plant-in-wisconsin/article_37a131fa-c851-5d87-a974-0e1a4ea5d956.html", "content": "Trump announces $10 billion Foxconn plant in Wisconsin By <mark>SCOTT</mark> BAUER and <mark>PAUL</mark> WISEMAN Associated Press 15 min ago FILE - In this May 26, 2010 file photo, staff members work on the production line at the Foxconn complex in the southern Chinese city of Shenzhen, Southern city in China. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Kin Cheung, File) Kin Cheung FILE - In this May 26, 2010 file photo, staff members work on the production line at the Foxconn complex in the southern Chinese city of Shenzhen, southern China. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Kin Cheung, File) Kin Cheung FILE - In this May 27, 2010 file photo, a worker looks out through the logo at the entrance of the Foxconn complex in the southern Chinese city of Shenzhen. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Kin Cheung) Kin Cheung FILE - In this Feb. 4, 2016, file photo, employees enter and exit the headquarters of Taiwan's Hon Hai Precision Industry Co., also known as Foxconn, in New Taipei City, Taiwan. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Wally Santana, File) Wally Santana WASHINGTON (AP)--President Donald Trump says that electronics giant Foxconn will build a $10 billion factory in Wisconsin that's expected to initially create 3,000 jobs, the largest economic development project in state history. The announcement Wednesday comes at a critical juncture for a Trump administration that pledged to generate manufacturing jobs but has struggled to deliver results as quickly as the president promised. Trump's plans for health care and tax cuts face a murky future in Congress, while his administration is bogged down by an investigation into Russia's possible ties with his presidential campaign. In a White House speech, Trump said the financial commitment by Foxconn CEO Terry Gou was a direct result of his electoral win. \"If I didn't get elected, he definitely would not be spending $10 billion,\" Trump said. \"We are going to have some very, very magnificent decades .\" But the decision to build the plant in Wisconsin also stemmed from $3 billion in state economic incentives over 15 years if Foxconn invests $10 billion in the state and ultimately adds 13,000 jobs. The incentives would only be awarded if Foxconn creates the jobs and pays an average salary of nearly $54,000. The Wisconsin factory, scheduled to be open by 2020, would be massive. The campus dubbed \"Wisconn Valley,\" would cover nearly 1.6 square miles and be three times the size of the Pentagon. Foxconn's plant will produce liquid-crystal display panels, or LCDs, that are used in televisions and computer screens. The factory will be located in the congressional district of House Speaker <mark>Paul Ryan</mark>. It would mark a substantial gain for a state that currently has 472,000 manufacturing jobs and is still recovering from factory layoffs--including the closure of a General Motors plant in <mark>Ryan</mark>'s hometown--that hit after the 2008 financial crisis. Taiwan-based Foxconn is perhaps best known for assembling Apple iPhones in China. The company noted in a statement that having the Wisconsin factory would help it better serve the major U.S. technology companies that are its clients. Inside the White House, discussions with Foxconn about opening a U.S. plant were led over several months by Jared Kushner, a senior adviser and the president's son-in-law, and Reed Cordish, an assistant to the president on technology initiatives. The president had met personally with Gou, who on Wednesday complimented Trump's leadership at the event by saying, \"Mr. President, the eagle flies .\" Seven states had competed for the Foxconn plant. By awarding the plant to Wisconsin, Foxconn would appear to be giving a victory to both Trump and the state's Republican governor, <mark>Scott Walker</mark>, who is up for re-election next year. Other states that vied for the plant are Michigan, Illinois, Indiana, Ohio, Pennsylvania and Texas. Foxconn said in a release the announcement was just the first of several investments the company will be making in the U.S. <mark>Walker</mark> and several other Wisconsin officials, including <mark>Ryan</mark>, attended the White House announcement. Landing the multistate competition has been cast as a once-in-a-generation opportunity. Foxconn is the biggest contract assembler of smartphones and other devices for Apple and other brands. It has been eyeing building the plant in a part of Wisconsin represented by <mark>Ryan</mark>, who said he has met with company officials at <mark>Walker</mark>'s request. Critics have cautioned that Foxconn has made promises before to invest in the U.S. and not followed through. Foxconn promised in 2013, for example, to invest $30 million and hire 500 workers for a new, high-tech factory in Pennsylvania that was never built. State Sen. Alberta Darling, co-chair of the Wisconsin Legislature's budget committee, said any deal would be examined with a \"fine-toothed comb\" and need to win approval by the Republican-controlled Legislature. <mark>Walker</mark> said he planned to call a special legislative session to consider the incentives. They include up to $1.5 billion in income tax credits for job creation, $1.35 billion in income tax credits for capital investment and up to $150 million in a sales tax exemption for the purchase of construction materials. White House chief of staff Reince Priebus, who is from <mark>Ryan</mark>'s congressional district in southeast Wisconsin, told WTMJ-TV on Tuesday that Trump, when flying over the area in Kenosha County during a visit to Wisconsin in April, noticed vacant land where a former Chrysler Motors plant used to be. \"He said,\" That land should be used,' \"Priebus said .\" So when Foxconn came into the White House, into the Oval Office, the president said,' I know a good spot that you should go to, that place in Kenosha .' \"That part of the state is an attractive location for a large plant because of the area's proximity to Lake Michigan and its abundant water supply. To make flat-panel displays, the company will need access to great quantities of water to keep work spaces dust-free, among other things. The news sent a jolt of excitement across Wisconsin, even among longtime Democratic critics of <mark>Walker</mark>.\" It's an exciting opportunity, \"said Democratic state Assembly Minority Leader Peter Barca. Barca, like many Democrats, voiced concern about how much taxpayers may have to contribute in tax breaks and other incentives .\" We want to make sure it's a fair deal for everybody, \"he said .\" We want a win-win-win. \"---- --", "articleID": "2017072708_00212183_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"]}}, {"date": "2017-07-28", "url": "http://www.siasat.com/news/mehbooba-warns-grave-repercussions-article-35a-tinkered-1217186/", "content": "Mehbooba warns of grave repercussions if Article 35 (A) is tinkered with July 28, 2017, 4:39 PM IST India, News New Delhi: New Delhi: Jammu and Kashmir Chief Minister Mehbooba Mufti on Friday warned against any tinkering with Article 35 (A) of the Constitution that is being debated in the Supreme Court and which empowers the State legislature to define \"permanent residents\" and accord special rights and privileges to them. Strongly defending the constitutional clause, Mehbooba said that any change in its status would invite repercussions and mean that nobody would be able to protect the Indian national flag in Jammu and Kashmir. She said that mainstream parties like the National Conference and her own Peoples Democratic Party (PDP) risk their workers' lives who stand up and carry the national flag in Kashmir. \"Any tinkering with the article won't be acceptable. I won't hesitate in saying that nobody will even carry the corpse of the National Flag in Kashmir (if the article is scrapped). Let me make it very clear,\" she said at an event here on Kashmir. The Chief Minister said that by employing such tactics, \"you are not targeting separatists who have an agenda to secede but you are weakening the forces who have accepted India, participated in elections. They make efforts to integrate Jammu and Kashmir with India with respect and dignity. You are weakening them .\" The Article 35 (A) is being challenged in the Supreme Court by NGO \"We The Citizens' on its legal basis because the article was never presented before the Parliament and executed on the orders of President of India. The provision was implemented in 1954 when then President <mark>Rajendra Prasad</mark> used the powers conferred on him by Article 370 to introduce the\" Constitution (Application to Jammu and Kashmir) Order 1954 \". Under the article, citizens from other parts of the country cannot acquire immovable property in Jammu and Kashmir or take up employment with the State government. The Supreme Court has now referred the case to a three-judge bench for a larger debate over it. IANS Share Whatsapp Facebook Twitter Google +", "articleID": "2017072811_00265808_W", "names": {"Rajendra Prasad": ["Q30077615", "Q5516315"]}}, {"date": "2017-07-30", "url": "http://www.thametoday.co.uk/lifestyle/console-corner-new-old-skool-sonic-to-deliver-on-hype-for-all-the-right-reasons-1-8064698", "content": "Console Corner: New old skool Sonic to deliver on hype for all the right reasons? Sonic Mania Have your say It is around this time of year that the video gaming scene - like the football season - really starts kicking back into gear. July and August tend to be pretty quiet for obvious reasons with people holidaying and the like...but there is one release which has gamers old and new skool talking. As I have touched on a number of times in this column in recent months, 2017 has been the year of the classic comeback with retro game, systems, re-releases and remasters taking centre stage. And August is no different with Mega Man Legacy Collection 2 set to launch in the first week of the new month. But it is the \"new\" 2D Sonic game which has caught the eye. Sonic Mania is due out on August 15th and continues the old skool theme this year but with the added bonus of being a new entry into the franchise. The retro title was meant to be released in the spring but was delayed until August. Mania is a new 2D Sonic title in the vein of his classic adventures but features both original stages as well as remixed versions of older Sonic levels like the Green Hill and Flying Battery Zones. Sonic Mania is releasing digitally for Switch, PS4, Xbox One and PC and is available for preorder. It is a precursor to a new 3D Sonic title called Sonic Forces which is also coming to the same platforms later this year. Sonic Mania was named one of the best games shown at E3 2017 by The Guardian, Ars Technica, Twinfinite, and Saucy Gamer, with Ars Technica's Sam Machkovech naming it his \"game of the show\". It comes with a big billing and plenty of nostalgia too and was described as \"the one carrying hype for all of the right reasons\" when Mania and Forces were discussed by experts. It was also nominated as best platformer but lost out - understandably - to the Switch's as yet undated stellar title, Super Mario Odyssey. Trending <mark>Liam Fox</mark>: No Cabinet deal on free movement for three years after Brexit WITH VIDEO: Animals from Blue Cross rehoming centres wish Her Majesty the Queen a happy birth-neigh! Cakes withdrawn over allergy concerns Nepal namesake is hit by earthquake A life cut short: RAF Halton's popular mascot George the goat has passed away Sign in", "articleID": "2017073005_00062889_W", "names": {"Liam Fox": ["Q16300641", "Q332374", "Q6539597"]}}, {"date": "2017-07-30", "url": "http://heroichollywood.com/justice-league-vfx-artists-mustache/", "content": "Last week, the internet was ablaze with some great jokes regarding Henry Cavill's role in the reshoots for Justice League. Because he is currently shooting Mission: Impossible 6, Cavill grew an impressive mustache that would totally hide his identity as Clark Kent even more than his classic spectacles that somehow guard him from people recognizing that he actually is Superman. Because Justice League reshoots are underway, Cavill's schedule is quite hectic. However, Paramount Pictures is not allowing the actor to shave off his mustache despite his need to play Superman in Justice League. So instead of him shaving it off and having to wear a fake mustache for the rest of his work on Mission: Impossible 6, VFX artists on Justice League have to digitally remove his mustache for the footage used in the reshoots. Also read: \"Mission: Impossible' Director: Why\" Justice League' Star Henry Cavill Couldn't Shave Business Insider recently spoke with some VFX artists at The Mill regarding the process of digitally removing facial hair off of actors. As it turns out, that process is quite common depending on actors' involvement with other projects. Dave Fleet, head of 3D for The Mill discussed the process that may be utilized for Cavill's situation: \"Smoothing out tiny vellus hairs on the skin requires a totally different approach to removing a large volume of hair, like a beard or mustache. If we were to remove a beard we would have to digitally re-build the actor's face behind the hair mass. We would need to build a 3D model of the face and then shade the surface of the skin to look realistic. We would then need to track the 3D model to the movement of his head and potentially re-animate his mouth. The amount of lip animation would depend on how much of the original beard occluded his lips. We would need to paint out the parts of the beard that extend beyond his shaven face .\" Fleet also explained how long it will take to remove the mustache in post-production: \"One week just to make the 3D elements; then another three weeks to track, animate, and render the shaven face; and another two weeks to composite it all together .\" VFX artists are some of the most hard-working people in the industry. For one, putting together some of Hollywood's most exciting set-pieces is something to be lauded for. Also, their work on the effects one doesn't see immediately also deserves some praise. So yes, the removal of the Super-Stache is just as impressive as seeing the Justice League unite to fend off the Parademons. Talk about artistry. Justice League opens in theaters on November 17, 2017. Source: Business Insider; <mark>Cameron Stewart</mark> (Image Header) 5 Things We Want To See In \"Flashpoint' Previous 1 of 6 Next With DC revealing that the upcoming Flash movie will be titled Flashpoint, fans are wracking their brains trying to figure out what will happen. While the story is famous for rebooting the DC universe before the New 52 initiative, the series is chop full of awesome moments. The book is full of awesome alternate versions of characters and emotional moments that ground the universe-changing story in a deeply personal core narrative. For those who don't know, Flashpoint follows what happens after <mark>Barry Allen</mark> travels back in time to save his mother on the night of her murder. When he returns to the present, he finds that everything he's ever known is different and he's even lost his powers. It might not be the perfect story to introduce people to the larger Flash universe, but I trust Geoff Johns. Hopefully now that the plot seems to be a bit more set, a director or directors (I'm looking at you Phil Lord and <mark>Chris Miller</mark>) will step onto the project soon and help mold it into something awesome. If Warner Bros. chooses to introduce an alternate version of the DC Extended Universe to the bigscreen, there's no one I'd rather explore it with than Flash. <mark>Barry Allen</mark> is the heart and soul of the DCU, so it's only fitting to watch him try and inject some light into a dark version of his home. Hit Next to learn about the five things we want to see in Flashpoint. Previous 1 of 6 Next VIEW IN GALLERY", "articleID": "2017073019_00479611_W", "names": {"Barry Allen": ["Q5210005", "Q808998"], "Cameron Stewart": ["Q1921734", "Q5026387"], "Chris Miller": ["Q13638984", "Q25184124", "Q283700", "Q5107465", "Q5107466", "Q58011841"]}}]