[{"date": "2017-08-01", "url": "https://foodmag.com.au/western-australian-grain-growers-break-into-asian-beer-market/", "content": "Latest News Newcomer surprises at the CBIA Craft Beer Awards 2017 Detmold acquires Heshan Innopak business in China Drone and sensor technology coming to Australian farming Companies granted Bulk Wheat Port Code exemptions The CBH Group today joins Interflour Group in celebrating the opening of the US $70 million Intermalt facility in Vietnam providing Western Australian grain growers with direct access to the Asian beer market. CBH Chairman Wally Newman and Chief Executive Officer Andy Crane attended the ceremony together with directors and senior leaders including Interflour Group Managing Director and Chief Executive Officer Greg Harvey, Intermalt General Manager James Kirton and representatives from the Vietnamese government. Mr Newman said CBH's involvement in downstream grain processing, through its 50 per cent shareholding of Interflour, had diversified the co-operative's income stream and resulted in increased market opportunities for Australian grain. \"CBH's investment in Interflour 12 years ago was ground breaking and today's opening of the Intermalt facility in Vietnam marks a new phase of growth for the business as it moves into barley processing and expands across South East Asia,\" said Newman. \"It will be a new chapter for Western Australian barley growers who now have direct access to Vietnam's burgeoning beer market--the fastest growing beer market in Asia .\" Mr Newman said over the past harvest growers delivered 1.5 million tonnes of malt barley into the CBH receival network and the facility provides a new market for growers. As part of the final commissioning phase, Intermalt has already purchased 42,000 tonnes of malt barley, with 32,000 tonnes coming from the Kwinana and Albany port zones of the Western Australian grain belt. Intermalt is located in Cai Mep, Vietnam, and will be the largest malting plant in South East Asia. It will have the capacity to produce 110,000 tonnes of malt a year and will service major brewers in the region including Heineken Vietnam. \"Not only is the Intermalt infrastructure impressive, but so too is the growth and opportunity it affords our growers, our businesses and the Asia Pacific region as a whole,\" Mr Newman said. \"Our current and future growers can look forward to benefiting from Interflour's expansion and this new venture generating value that we can then return to them a number of ways including through our investment rebate .\" Heineken Vietnam Corporate Affairs Director <mark>Matt Wilson</mark> said, \"Heineken Vietnam always seeks to use local suppliers where possible in order to drive jobs and wealth in Vietnam\". \"Our preference for local sourcing has seen us contribute around 0.75 per cent of Vietnam's total GDP and support nearly 200,000 jobs in Vietnam,\" he said. \"Because of this, we are very happy to see Intermalt entering the local market with the potential to supply us with locally produced malt in the future and increase our contribution to the Vietnamese economy .\" ", "articleID": "2017080102_00445917_W", "names": {"Matt Wilson": ["Q1284392", "Q17040675", "Q18011187", "Q21710837", "Q6789535"]}}, {"date": "2017-08-01", "url": "http://www.nottinghampost.com/news/nottingham-news/man-jailed-strangling-ex-partner-261557", "content": "A \"controlling' partner has been jailed after he strangled his partner to the point she thought she was going to die. <mark>Daniel Lee</mark>, 30, previously of Bulwell, punched the woman in the face after she returned home from visiting his sister in June. Nottingham Crown Court heard on Tuesday (August 1) he then grabbed her throat with his left hand and squeezed. <mark>Lee</mark> punched her numerous times in her face and hit her head hard on the back board of the sofa .\" She struck her head on the back board, \"said Andrew Tanser, prosecuting .\" He moved his right and left hand to her throat and squeezed. She felt her face start to tingle and thought she was going to die. This lasted at least ten to 15 seconds. All of a sudden he let go \". Read More Nine year jail term for burglar who carried out violent £ 38,000 raid Nottingham Crown Court The woman ran from the house. She said she was left with marks on her neck and a very bad headache, added Mr Tanser .\" She describes being assaulted numerous times over the last few years. Her honest belief was he was going to kill her and she was going to die at the time he strangled her. She wants nothing more to do with him and wants him to stay away \". Mr Tanser added:\" He started to become very controlling and stopped her seeing friends and family. He wouldn't allow her out of the house to see them. He took hold of her bank card. She wasn't allowed her own money unless she asked for it \". <mark>Lee</mark>, who has been in Lincoln Prison on remand, pleaded guilty to assault, causing bodily harm. Read More Passenger who tried to get out of moving car was left hanging onto door in police chase Judge Gregory Dickinson QC sent him to prison for 18 months. He imposed a restraining order, stopping <mark>Lee</mark> from contact his now ex-partner. The judge gave him six points on his driving licence for driving without insurance. There will also be an endorsement on his driving record for having no licence. He told <mark>Lee</mark> he had two previous convictions for battery in 2012 on his partner. Of the latest attack, the judge said:\" You grabbed her around the throat with both hands and squeezed so hard, she was struggling to breathe. She feared she was going to die. \"I have seen photographs of marks to her neck\". <mark>Lee</mark> said from the dock: \"I'm sorry\". Read More Man denies attempting to abduct a child in Beeston The judge said: \"She still looks back on that as the worst day of her life and it will affect her for a long time to come\". Solicitor <mark>Nick Walsh</mark>, mitigating, said his client \"wouldn't accept that he is controlling in nature\". \"He disputes what has been said about money; she had her own money in the past .\" He knows a custodial sentence is inevitable in his case today \".", "articleID": "2017080113_00464785_W", "names": {"Daniel Lee": ["Q2215646", "Q41065588", "Q42313359", "Q43085242", "Q5217896", "Q706142", "Q9430586"], "Nick Walsh": ["Q16196325", "Q30122335"]}}, {"date": "2017-08-02", "url": "http://www.fleetwoodtoday.co.uk/news/business/fresh-fish-provided-to-the-open-1-8681832", "content": "Fresh fish provided to the Open Published: 10:18 Wednesday 02 August 2017 A fishmongers from Fleetwood was given the opportunity to showcase its produce during The Open at Royal Birkdale, thanks to being selected by Sodexo Sports & Leisure which ran the hospitality and dining suites at the international golf event. Neve Fleetwood, a leading supplier of fresh fish, showcased its high quality produce to visitors who were dining in one of the many hospitality suites, while watching the greatest golfers and rising stars compete at the 146th edition of The Open. Neve Fleetwood's experienced team created a unique dish for the tournament this year, The Open Fish and Chips. The succulent fish, which utilised one of the UK's most popular fish choices, haddock, was responsibly sourced and ensured that The Open guests enjoyed the best quality, fresh fish available. Neve Fleetwood has been offering an amazing supply of fresh fish and seafood to the North West for over 30 years. <mark>Chris Scott</mark>, Sodexo Account Manager at Neve Fleetwood, said: \"The Open proved a very busy but enjoyable time for us and it was a pleasure to supply such a prestigious event .\" Trending", "articleID": "2017080210_00219211_W", "names": {"Chris Scott": ["Q1077730", "Q18217980", "Q18631749", "Q5108004", "Q5108005", "Q5108006", "Q5108007", "Q57894195"]}}, {"date": "2017-08-02", "url": "http://weblogs.baltimoresun.com/entertainment/dining/baltimore-diner-blog/bs-fo-hard-rock-test-kitchen-20170802-story.html#nt=oft13a-20gp1", "content": "Diners at Baltimore's Hard Rock Cafe can now order crab cakes as part of a new program in which some of the chain's restaurants are adding local flavors to their menus. The Inner Harbor restaurant was among 12 Hard Rock Cafe locations selected for the company's \"test kitchen\" program. New items at the Baltimore restaurant became available Tuesday. Local offerings at the Hard Rock Cafe Baltimore include a crab cake sandwich, crab cake entree, crab dip \"Local Legendary Burger\" and a fresh catch of the day. On its drink menu, the restaurant also added a black-eyed Susan cocktail made with Sagamore rye whiskey. <mark>John Galloway</mark>, Hard Rock International's chief marketing officer, said the company began looking for potential test kitchen sites in January, searching for restaurants located in areas with strong \"culinary energy,\" an aptitude for local sourcing, and strong chefs and general managers. Baltimore was among the locations selected from the chain's 176 restaurants. Other Hard Rock test kitchens are in Chicago, Denver and Pittsburgh. Culinary teams at Hard Rock's Orlando headquarters collaborated with chefs in individual markets to develop the new menu items. While the test kitchen items could ultimately end up on Hard Rock's universal menu, the primary goal was adding local flavor to Hard Rock's standard offerings in certain markets. Lorraine Mirabella The Baltimore Sun Unveiling of redesign at Hard Rock Baltimore planned for Tuesday Unveiling of redesign at Hard Rock Baltimore planned for Tuesday (Lorraine Mirabella The Baltimore Sun) \"The bigger idea is to allow a guest who is visiting Baltimore to have their choice of local cuisine or the global Hard Rock cuisine that they may expect,\" <mark>Galloway</mark> said. \"It's about serving the needs of locals as well as the tourists .\" The test kitchen restaurants spent about three months developing local dishes, and <mark>Galloway</mark> said he expects the local menu items to evolve over time. Now that the items are available to the public, his team is taking feedback from customers. <mark>Galloway</mark> was in Baltimore Tuesday for the launch of the new menu and to hear what diners thought of the new options. When it came to the crab cakes, customers told him not to mess with traditional preparations. \"We stuck to a script,\" he said. \"There's not a lot of Hard Rock twist on that .\" CAPTION Hackers have stolen video and other data from HBO, Disney, Netflix, and Sony. (Aug. 1, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) Hackers have stolen video and other data from HBO, Disney, Netflix, and Sony. (Aug. 1, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) CAPTION The French actress Jeanne Moreau, who became one of the most popular and bewitching film stars of the 1960s, died July 31 at 89 in Paris. Her career spanned seven decades and nearly 150 movie and TV roles, establishing her as the thinking man's femme fatale. (July 31, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) The French actress Jeanne Moreau, who became one of the most popular and bewitching film stars of the 1960s, died July 31 at 89 in Paris. Her career spanned seven decades and nearly 150 movie and TV roles, establishing her as the thinking man's femme fatale. (July 31, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) smeehan @ baltsun.com twitter.com/sarahvmeehan MORE BALTIMORE DINER 100 essential food and drink experiences every Baltimorean must try Map: 10 hot Baltimore restaurants Dish Baltimore: Search Baltimore Sun-reviewed restaurants", "articleID": "2017080221_00182693_W", "names": {"John Galloway": ["Q29642716", "Q6234758"]}}, {"date": "2017-08-03", "url": "https://nupge.ca/content/bcgeu-granted-standing-national-inquiry-missing-and-murdered-indigenous-women-and-girls", "content": "\"The essential work of our members has been recognized by the commission and they've asked to hear from them directly\" --<mark>Stephanie Smith</mark>, BCGEU President Vancouver (2 Aug. 2017)--The B.C. Government and Service Employees' Union (BCGEU/NUPGE) has been granted standing in the National Inquiry into Missing and Murdered Indigenous Women and Girls (MMIWG) allowing it to make formal written and oral submissions to the public inquiry. The letter from the MMIWG states: \"On behalf of the Commissioners, the Application for Standing submitted by BC Government and Service Employees' Union has been granted, for greater certainty, the Commissioners have granted standing in Part I, for the Region of British Columbia, for the issues as applied, with full rights .\" \"I am very pleased to hear our application was accepted. The essential work of our members has been recognized by the commission and they've asked to hear from them directly,\" said <mark>Stephanie Smith</mark>, BCGEU President. \"Several of our members around the province have worked with now missing and murdered women and girls, and feel strongly that their stories and experiences be shared with the commission .\" BCGEU report looks at work done by members to protect vulnerable women and girls \"I am so proud of the work our members do with Indigenous peoples and communities. We now have some of our most important work ahead of us as we prepare for our submission to the Inquiry. Recently, we released our report on Women's Services in B.C.--Collective Wisdom: Challenges and Opportunities in BC Women's Services. It speaks to the vital work our members do to protect and support vulnerable women and girls and their children, including many Indigenous women and girls. We intend to share this collective voice and experience directly with the inquiry .\" \"We have already shared these findings with the Federal Minister of Status of Women, Honourable Maryam Monsef, as well as the former Provincial Minister of Social Development and Social Innovation, Honourable Michelle Stilwell. I hope to meet with Minister Monsef in September to further discuss our members' work, how we can better protect and support Indigenous women and girls, and how we can help provide healing and justice for their communities .\" The BCGEU will issue further updates as our involvement with the National Inquiry into Missing and Murdered Indigenous Women and Girls progresses. NUPGE and Components pushed for the inquiry NUPGE and its Components supported efforts to get the federal government to call an inquiry into the tragically high number of missing and murdered indigenous women. This has included supporting the Native Women's Association of Canada (NWAC) and its Sisters in Spirit Initiative to increase awareness and address the issue of the appalling high number of Indigenous women and girls who are missing or have been murdered. While an Inquiry has been called, it is clear that it needs to be restructured. To meet the hopes and expectations people have for the Inquiry, a process is needed that honours the lives of Indigenous women and girls and leads to measures to end the violence. Organizations like the Native Women's Association of Canada have made concrete suggestions for how the Inquiry can be restructured and it is hoped those suggestions will be listened to. NUPGE The National Union of Public and General Employees (NUPGE) is one of Canada's largest labour organizations with over 370,000 members. Our mission is to improve the lives of working families and to build a stronger Canada by ensuring our common wealth is used for the common good. ~ NUPGE NUPGE Components: BCGEU Issues and Campaigns: Women's Issues Occupational Groups: Social Services People: <mark>Stephanie Smith</mark> Private: National Inquiry into Missing and Murdered Indigenous Women and Girls MMIWG violence against women", "articleID": "2017080318_00572952_W", "names": {"Stephanie Smith": ["Q587622", "Q7608398"]}}, {"date": "2017-08-04", "url": "http://www.philstar.com/headlines/2017/08/05/1725190/scs-claimants-will-suffer-if-harsh-china", "content": "Headlines Skinning Left, pagematch: 1, sectionmatch: 1 Headlines (Leaderboard Top), pagematch: 1, sectionmatch: 1 \"SCS claimants will suffer if harsh to China' By Helen Flores (The Philippine Star) | Updated August 5, 2017 - 12:00 am People from claimant-states in the South China Sea will suffer if they take a hard stance with China, Foreign Affairs Secretary Alan Peter Cayetano said yesterday, as former diplomats and experts expressed concern over Beijing's continued island-building activities in and militarization of the disputed waters. AFP/Fabrice Coffrini, File MANILA, Philippines - People from claimant-states in the South China Sea will suffer if they take a hard stance with China, Foreign Affairs Secretary Alan Peter Cayetano said yesterday, as former diplomats and experts expressed concern over Beijing's continued island-building activities in and militarization of the disputed waters .\" In the West Philippine Sea, our neighbors are also claimants. If we go harsh with everyone, our people will suffer--trade, direct foreign investments, tourism, \"Cayetano said at the\" ASEAN at 50: The Way Forward \"forum in Makati City. The Philippines under President Duterte, he pointed out, seeks to\" build more bridges of understanding \"to attain peace and stability in the region. China claims about 90 percent of the entire South China Sea but this is being contested by Taiwan and four ASEAN members--the Philippines, Vietnam, Malaysia and Brunei. The two-day forum, organized by the Carlos P. Romulo Foundation for Peace and Development, Center for Strategic and International Studies and Stratbase ADR Institute, was attended by diplomats and policy experts from ASEAN member-countries as well as non-ASEAN nations, including the US, Australia and South Korea. Former foreign affairs secretary Albert del Rosario, chairman of Stratbase ADR Institute, urged ASEAN members to\" define its own leadership \"and oppose Beijing's aggressive expansion, noting that the\" fear of economic retaliation \"was keeping the ASEAN from standing up on important issues. Headlines (Article MRec), pagematch: 1, sectionmatch: 1 Cayetano, in his speech, assured the administration's critics that the Philippine government would not give up\" a single centimeter \"of its territory in the West Philippine Sea to China despite improved relations between the two nations .\" We may have different strategies, but we have the same objective, sir, \"Cayetano told Del Rosario. In 2013, under Del Rosario's term as DFA secretary, the Philippines challenged China's maritime claim before an international arbitral tribunal, calling it\" excessive \"and\" exaggerated. \"A Hague-based arbitral court ruled in favor of the Philippines in 2016, saying China's maritime claims have no legal basis--a decision that was dismissed by China as\" a mere piece of paper. \"Del Rosario warned the Philippines against entering into financial agreements with China .\" By entering into weighty financial agreements, we may end up not only tying our own hands but also the hands of the next generation, \"he said as he called on ASEAN to take a stand against Chinese incursions. ASEAN must unite vs China Amy Searight, former US deputy assistant secretary of defense for South and Southeast Asia, also called on the ASEAN to push for its strategic vision in the development of the region .\" Neutrality is not an option because South China Sea is a key litmus test for China's rise and whether regional responses, regional norms and international law can shape China's behavior or not, \"said Searight, now senior adviser and director of the Southeast Asia Program of the Center for Strategic and International Studies. She warned that the ASEAN could end up as a passive bystander if it would choose neutrality over making a stand in the region .\" ASEAN's potential is far greater (than being a team leader and hosting events in the region). It lies at forging a strategic vision for Southeast Asia, and the vision of what kind of neighborhood in the broader Indo-Pacific that it wants to reside in, \"she added. Searight said this would require leadership and political courage and determination, but noted that ASEAN was able to show that it is up to tough challenges if it puts its collective mind to it. Top ASEAN meeting topics * NL * Alarm over North Korea's intercontinental ballistic missile tests, a germinal step to temper South China Sea disputes and unease over a disastrous siege by pro-Islamic State group militants will grab the spotlight in the ASEAN forum. At least 27 nations are deploying their foreign ministers for three days of summitry and handshake photo-ops in Manila starting today, including the main protagonists in long-tormenting conflicts led by the US, Russia, China, Japan and South and North Korea. The Philippines plays host as this year's ASEAN chairman. Chinese and ASEAN foreign ministers will endorse a two-page framework of a long-sought code of conduct in the disputed South China Sea when they meet today as the Philippines calls the development a major diplomatic progress in efforts to ease a potential flashpoint. Critics say the agreed outline of key principles is lopsidedly in China's favor and suspect that Beijing may have consented to it to divert protests as it tries to complete land reclamations and fortify its man-made islands with a missile defense system. While the framework carries hope for a diplomatic approach to the disputes, it noticeably failed to mention China's construction of new islands and an arbitration ruling last year that invalidated the historic basis of Beijing's claim to virtually the entire sea. Beijing's cozier ties with Manila under Duterte have calmed tensions and prompted China to allow Filipinos back to a disputed shoal, but arbitration proponents worry that the Chief Executive was squandering an opportunity to harness the rule of law to restrain aggressive acts in the disputed region. A draft of a joint communiqué to be issued by the ASEAN ministers welcomes the conclusion of talks on the framework, but drops any mention of regional concerns over land reclamations and militarist moves in the South China Sea, which ASEAN members had agreed to include in their previous statements. North Korea's two recent and successful ICBM tests also topped the agenda as the US and its allies quickly signaled their intention to impose additional sanctions against Pyongyang through a UN resolution. Along with South Korea and Japan, the US is also expected to lead a barrage of condemnations against Pyongyang at the ASEAN Regional Forum (ARF), an annual security conference to be held in Manila on Monday. North Korea has confirmed that its top diplomat, <mark>Ri Yong-Ho</mark>, will attend, raising the specter of a verbal showdown in the 27-nation ARF, which also includes Pyongyang's ally, China. Ahead of the meeting, a senior State Department official told reporters in Washington that the US was moving to have North Korea suspended from the forum for going against its conflict-prevention objectives. It's part of America's broader effort to isolate Pyongyang diplomatically and force it to end missile tests and abandon its nuclear weapons program. But removing North Korea from the grouping will be tough, as there is no exclusion procedure and the ARF decides by consensus .--With Janvic Mateo, Rudy Santos, AP Headlines (Article MRec), pagematch: 1, sectionmatch: 1", "articleID": "2017080417_00143557_W", "names": {"Ri Yong-Ho": ["Q12594422", "Q483800"]}}, {"date": "2017-08-07", "url": "http://noosanews.com.au/news/qld-woman-admits-murdering-grandfather-during-robb/3209560/", "content": "Bernadette Burns has appeared in the Supreme Court for her part in the death of Adelaide grandfather Robert Whitwell. Popular Stories Bubbly Sharon \"was truly an angel' Tributes flow for Garth\" Mr Noosa' Prowd Proving the grieving wife was actually calculating murderer Local Real Estate Cars For Sale A WOMAN has admitted to murdering Adelaide grandfather Robert Whitwell during a violent robbery that she carried out with her friend - who was the granddaughter of the victim and has already pleaded guilty to murder. On Monday, Bernadette Burns, 22, of Redbank Plains, 33km southwest of Brisbane, pleaded guilty to murder before Supreme Court Justice Trish Kelly. She was set to face trial for murder but has instead pleaded guilty to the crime - under a unique section of the Criminal Law Consolidation Act. Burns has admitted to committing an intentional act of violence while undertaking the robbery, which resulted in the death of Mr Whitwell. The offence - which is similar to the controversial US offence of \"felony murder\" - still carries the maximum penalty of life imprisonment. Justice Kelly transferred the case to her colleague Justice <mark>Kevin Nicholson</mark>, who is hearing the matter of her co-accused Brittney Jade Dwyer, the granddaughter of Mr Whitwell. The pair will be back in court later this month. Shelby Lee Angie Holmes (left) and accused killer Brittney Jade Dwyer (right). Source: Facebook Last week, Dwyer, 20, faced sentencing submissions for her role in the killing of Mr Whitwell, 81, in his Craigmore unit in August last year. Dwyer, also of Redbank Plains, fabricated an eleventh-hour lie to tarnish the name of her victim and excuse her crime, the court was told. Supreme Court Justice <mark>Kevin Nicholson</mark> heard Dwyer told a psychiatrist that her grandfather may have sexually molested her as a child - but she wasn't sure if it was real or not. \"It is a most unpleasant assertion. It's unfounded in any other material,\" prosecutor Jim Pearce told the court. He said \"at one minute to midnight\" Dwyer was having flashbacks about something her victim may or may not have done, despite never having raised this as a motive at any other point in the investigation. \"In my submission, the court would be entitled to infer, with the absence of evidence from Ms Dwyer about this, that it is just simply an invention designed to give her an explanation for why she acted as she did,\" he said. \"Because the only other explanation is a premeditated, pre-planned, almost sociopathic killing .\" It's insidious to a man who was murdered in that way. \"He asked Justice <mark>Nicholson</mark> to place no weight on that part of the psychiatric report. Murder victim Robert Whitwell, who was found dead in his Craigmore unit on August 8, 2016. Dwyer's lawyer, Craig Caldicott, said his client wasn't sure whether\" her flashbacks \"were real or not and it would not be presented as a motive in the killing. He said the motivation was to steal money from her grandfather. Her case was then adjourned until after Burns' case had been finalised. Another friend, Shelby Lee Angie Holmes, 19, was sentenced last week for trespassing on Mr Whitwell's property in the months leading up to the murder. Holmes was jailed for 17 months with a non-parole period of nine months, suspended on the condition she be of good behaviour for three years. The court was told Dwyer and Holmes drove from Queensland to Adelaide to rob Mr Whitwell of\" thousands of dollars \"of the\" hundreds of thousands \"which they believed was kept in his shed. But the girls were frightened off by a sensor light, barking dogs and a nearby neighbour. Last month, Mr Whitwell's brothers told how they embraced his crying granddaughter in the days after his death - only to discover they had been comforting his killer. Dwyer had to listen as her family outlined their devastation and despair in victim impact statements read out in the Supreme Court by prosecutor Jim Pearce. In his statement, Mr Whitwell's brother Geoffrey Whitwell said he was devastated by his brother's murder and missed him dearly .\" Bob and I were very close, \"he wrote .\" We always came together for Christmas and Bob's birthday was special because it was on the same day as my wife's (birthday). \"He wrote that he would speak with his older brother on the phone frequently .\" But I'll never hear the phone ring with my brother on the other end, \"he said in his statement. Mr Whitwell said Dwyer, her mother Tonya Dwyer and brother all flew to Adelaide from Queensland after the murder .\" We welcomed you into our home, embraced you and comforted you, all the while you wept with your fake tears and made comments like \"my poor poppa',\" he said. \"I now know that I had been embracing and comforting my brother's killer. You are a master of deception, I will give you that .\" I will never forgive you. You're a cruel, deceitful person with no regard for human life - I believe you are dangerous and evil and deserve the highest penalty. \"Mr Whitwell's other brother, Peter Whitwell, also spoke of inviting Dwyer into the family home and comforting her in the days after his death .\" We were just coming to terms with his death when we found out it was his own granddaughter who was responsible, \"he said in his statement. Tonya Dwyer - whose daughter killed her father - also provided a statement to the court, saying she had been a happy wife, mother and daughter until everything changed on May 2 last year .\" (Now) I feel like I'm drowning in life, \"she said. Dwyer's father, Garry Dwyer, described his former father-in-law as a\" great man, who loved his family \". He asked the court to impose an\" appropriate \"jail term on his daughter. Dwyer pleaded guilty to the murder and in February and admitted to a further charge of aggravated serious criminal trespass between April 30 last year and May 2. crime Read More Login to follow murder Read More Login to follow national Read More Login to follow Topics: crime murder national 0 Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now", "articleID": "2017080702_00188911_W", "names": {"Kevin Nicholson": ["Q17306336", "Q6397095", "Q6397096"]}}, {"date": "2017-08-07", "url": "http://www.theepochtimes.com/n3/2277795-2-boy-scouts-electrocuted-to-death-after-boat-his-power-line-in-texas/", "content": "2 Boy Scouts Electrocuted to Death After Boat His Power Line in Texas August 7, 2017 AT 1:00 PM Last Updated: August 7, 2017 1:00 pm (Carl Ballou/Shutterstock) Two boys were killed and one person was injured after a sail boat struck a power line on Saturday in Marion County, Texas, according to officials. The boys, who belonged with the Hallsville Boy Scouts, got electrocuted when their catamaran sail boat was sailing on a lake near Hallsville. The boat caught on fire as a result, and scouts onshore could be heard shouting for help, according to Texas state wildlife officials. \"Preliminary investigations and observations indicates the vessel, a Catamaran sailboat, collided with an overhead transmission power line and those onboard may have been electrocuted as a result,\" a news release says. All of the boys were wearing their life jackets. \"Preliminary investigations and observations indicates the vessel, a Catamaran sailboat, collided with an overhead transmission power line and those onboard may have been electrocuted as a result,\" a news release says. (Screenshot) The three occupants of the boat were aged 11, 16, and 18. \"Wardens discovered an 18-year-old male onboard and a 16-year-old in the water a short distance away. Both victims suffered severe bodily injuries and were deceased,\" officials said in the release. \"It was a tragic scene,\" Texas Game Warden Quint Balkcom told ABC affiliate KLTV 7. Two boys were killed and one person was injured after a sail boat struck a power line on Saturday in Marion County, Texas, according to officials. (Google Maps) \"We have to come together as a scout family and make sure we are supporting those who are carrying quite a weight right now,\" <mark>Daniel Anderson</mark>, chief operating officer for the East Texas Boy Scouts of America, told the Washington Post. \"You're talking about great young men, men of integrity,\" Sherri Morgan, the Hallsville band director, said at a candlelight vigil, according to the News-Journal. \"We're heartbroken, we're devastated .\" \"All is not lost, they leave a legacy,\" she noted. \"So, they are going to live on forever .\". The injured and unresponsive 11-year-old boy scout was found nearby and was given CPR by good Samaritans on the scene. He was then taken to LSU Medical Center-Shreveport in Louisiana. The incident is s being investigated by the Texas Parks and Wildlife Department. Editor's Picks", "articleID": "2017080717_00145882_W", "names": {"Daniel Anderson": ["Q114489", "Q3013658", "Q5216411", "Q5216412", "Q58067865"]}}, {"date": "2017-08-07", "url": "http://holmesdale.net/page.php?id=106&tid=167751", "content": "Crystal Palace FC Supporters' Website - The Holmesdale Online You are here: Home> Message Board> Palace Talk> This is a joke right??!! August 7 2017 11.12 pm Page 1 of 2 1 2> Last \"Palace Talk is sponsored by I just read that online to...I hope it's a joke...Its the daily star so don't know how trust worthy it is. Dan89 Se25 Today 10.41 pm This post has been merged from a topic called\" <mark>Tony Adams</mark> Buys Crystal Palace (Daily Star)' by Guntrisoft Dan89 Se25 Today 10.42 pm This post has been merged from a topic called \"<mark>Tony Adams</mark> Buys Crystal Palace (Daily Star)' by Guntrisoft Sorry didn't realise there was a thread - sorry mods Few more threads on this now! romford essex via another galaxy Today 10.44 pm It's in the daily star, a very crappy paper Originally posted by collier row eagle It's in the daily star, a very crappy paper 100% True. However, the wording of the article is very explicit - no\" talks are ongoing \"or\" expressed an interest \"or even\" about to start talks with CFPC2010 \". Blimey. He want player manager role <mark>Andy Johnson</mark> Magic, He wears a Magic HatWhen he Sees the match ball, he says he having thatHe scores one with left foot, he scores one with his rightAnd When his playing Brighton, He scores all f *** ING Night! laddo london Today 10.47 pm If so explains slow transfer dealings. As long as Parish is still on the board as chairman I'm ok with it. laddo\" People say, live fast, die young. I say live fast, die old. That's me, the non-conformist \". David Brent. Hevon Today 10.48 pm This post has been merged from a topic called\" <mark>Tony Adams</mark> £ 200m takeover' by Guntrisoft That valuation makes SPs original investment of £ 2.5 mill worth now £ 40mill. Not bad for seven years work. He'd be bonkers not to sell though obviously he won't \"if it's not right for the club\" ", "articleID": "2017080722_00226609_W", "names": {"Andy Johnson": ["Q276306", "Q3616274", "Q4760860", "Q4760862", "Q4760864"]}}]