[{"date": "2017-08-07", "url": "http://holmesdale.net/page.php?id=106&tid=167751", "content": "Crystal Palace FC Supporters' Website - The Holmesdale Online You are here: Home> Message Board> Palace Talk> This is a joke right??!! August 7 2017 11.12 pm Page 1 of 2 1 2> Last \"Palace Talk is sponsored by I just read that online to...I hope it's a joke...Its the daily star so don't know how trust worthy it is. Dan89 Se25 Today 10.41 pm This post has been merged from a topic called\" <mark>Tony Adams</mark> Buys Crystal Palace (Daily Star)' by Guntrisoft Dan89 Se25 Today 10.42 pm This post has been merged from a topic called \"<mark>Tony Adams</mark> Buys Crystal Palace (Daily Star)' by Guntrisoft Sorry didn't realise there was a thread - sorry mods Few more threads on this now! romford essex via another galaxy Today 10.44 pm It's in the daily star, a very crappy paper Originally posted by collier row eagle It's in the daily star, a very crappy paper 100% True. However, the wording of the article is very explicit - no\" talks are ongoing \"or\" expressed an interest \"or even\" about to start talks with CFPC2010 \". Blimey. He want player manager role <mark>Andy Johnson</mark> Magic, He wears a Magic HatWhen he Sees the match ball, he says he having thatHe scores one with left foot, he scores one with his rightAnd When his playing Brighton, He scores all f *** ING Night! laddo london Today 10.47 pm If so explains slow transfer dealings. As long as Parish is still on the board as chairman I'm ok with it. laddo\" People say, live fast, die young. I say live fast, die old. That's me, the non-conformist \". David Brent. Hevon Today 10.48 pm This post has been merged from a topic called\" <mark>Tony Adams</mark> £ 200m takeover' by Guntrisoft That valuation makes SPs original investment of £ 2.5 mill worth now £ 40mill. Not bad for seven years work. He'd be bonkers not to sell though obviously he won't \"if it's not right for the club\" ", "articleID": "2017080722_00226609_W", "names": {"Tony Adams": ["Q299391", "Q4772792", "Q7821744", "Q7821745"]}}, {"date": "2017-08-08", "url": "http://www.afr.com/lifestyle/arts-and-entertainment/books/henry-david-thoreau-and-the-natural-rhythms-of-nature-20170717-gxcpph", "content": "Henry David Thoreau and the natural rhythms of nature Share Henry David Thoreau inspired Gandhi and Martin Luther King Jr in their own nonviolent activism. Supplied by Michael Sims is the masterpiece that the gadfly of youthful America deserves. I have been reading Henry David Thoreau and reading about him for 40 years; I've written a book about him myself. Yet often I responded to Laura Dassow Walls' compelling narrative with mutterings such as \"I never knew that\" and \"I hadn't thought of it that way\". I found myself caught up in these New England lives all over again. On a foundation of rigorous scholarship, Walls, a professor of English at Notre Dame, resurrects Thoreau's life with a novelist's sympathy and pacing. Most of her previous books are about either the American Transcendentalists or the explorer and naturalist Alexander von Humboldt, and her broad grasp of the era's scientific issues integrates Thoreau's dawning ecological conscience into a better-understood context than most writers on the topic can provide. Every biographer faces the challenge of portraying and deciphering a subject's parents--their history, their mythic resonance throughout the subject's life. Walls does both with aplomb. \"<mark>John</mark> Thoreau would be remembered as a quiet man,\" she writes of Henry's father, \"unambitious and too decent to press the hard bargains needed for success in the cash-poor early republic. But time and again, he met defeat by taking a forward leap, such as opening his own store, and when it failed, trying again in Maine .\" Walls builds up <mark>John</mark>'s character scene by scene, and when he dies, I felt deeply sad despite knowing this story well. Henry's mother, a huge influence on her son and a woman whom many friends and neighbours memorialised, comes alive in this biography. \"If few noticed <mark>John</mark>,\" Walls writes, \"everyone noticed the indomitable Cynthia, who stood a head taller than her husband and was one of the most famous talkers of the day, full of wit and anecdote spiced with sarcasm, and blessed with that brisk efficiency that New Englanders call\" faculty'. \"She remains a strong and witty presence throughout. This new biography Walden is a seminal work by Thoreau and a book that still impresses youthful America. Supplied View all announcements Both of Henry's smart and resourceful sisters, Helen and Sophia, influenced him--not least as informed and passionate abolitionists, encouraging his activism. But no person in his life affected him more than his handsome older brother, <mark>John</mark> Jr, whom he adored. Henry imitated him in hobbies, romance and even--after <mark>John</mark> died of tetanus in Henry's arms--in medical symptoms. <mark>John</mark>'s death resulted in Henry's breakdown, out of which he climbed with difficulty. Thoreau's era is fascinating for many reasons, including the Transcendentalist reassessments of religion and society during the 1840s, the bloody results of the Fugitive Slave Act of 1850, the war with Mexico between 1846 and 1848, and the start of the Civil War, which was still raging when Thoreau died in 1862. Far from hiding out in the woods, Thoreau was passionately involved in these issues. His now-famous night in jail was an orchestrated public protest; he supported the violent abolitionist <mark>John Brown</mark>. Decades later, both Gandhi and Martin Luther King Jr credited Thoreau's essay with helping inspire their own nonviolent activism. Civil Disobedience Walls is too well versed in Thoreau's life to accept his own often contradictory pronouncements or his semi-fictional first-person narrator as necessarily factual. She teases out nuances and implications, but without unfounded speculation. And often she sums up a trait with a sly image, such as the final clause of this sentence:\" Moving to Walden Pond thus had a double purpose: it offered a writer's retreat, where Thoreau could follow his calling as spiritual seeker, philosopher, and poet; and it offered a public stage on which he could dramatise his one-person revolution in consciousness, making his protest a form of performance art. \"Thoreau was preoccupied with natural rhythms: day and night, summer and winter, seed and harvest. He celebrated their parade and exploited their symbolism. In Walls' later pages, as Thoreau battles tuberculosis and slips toward death at the age of 44, she aptly employs his own imagery:\" As the days shortened and the leaves fell, a new Thoreau emerged: pensive and sadder, slower, deeper. \"As he fought to regain strength, fighting the grave, he turned to the most common activities and the most mundane needs with intentionality and deliberation. Walden had been his book of spring and summer. Now, willing his recovery, he was learning a mind of autumn. In these darkening and haunted pages of his Journal, Thoreau began to trace the outlines of Walden's sequel: he would call it Wild Fruits, and it would be his final harvest .\" Washington Post Henry David Thoreau: A Life, by Laura Dassow Walls, published by University of Chicago Press. Michael Sims' recent books include Arthur and Sherlock and The Adventures of Henry Thoreau. Washington Post Book World", "articleID": "2017080813_00593504_W", "names": {"John Brown": ["Q10496369", "Q10558835", "Q1468968", "Q15407696", "Q16209507", "Q16841668", "Q19325232", "Q21077784", "Q21166054", "Q21460583", "Q25184207", "Q27831180", "Q28972089", "Q29464116", "Q3809112", "Q43393199", "Q43393927", "Q43911145", "Q46580905", "Q51879869", "Q53952917", "Q57779023", "Q57987458", "Q6223435", "Q6223436", "Q6223461", "Q6223482", "Q6223509", "Q6223512"]}}, {"date": "2017-08-09", "url": "https://www.theglobeandmail.com/feeds/thomson-reuters/canada-business/vw-workers-want-new-model-for-germany-to-boost-flagging-output/article35918548/", "content": "Comments Share via email Share on facebook Share on twitter Share on LinkedIn Print Volkswagen's top labor representative has urged the carmaker's management board to assign a new vehicle model to Germany to boost flagging capacity utilization or risk missing hard-fought productivity goals. The carmaker's powerful unions are concerned that a 3.8 percent drop in first-half group vehicle output in Germany, fueled by waning demand for the Golf and Passat models, could inspire further cuts in Volkswagen's (VW) high-cost home market. Europe's largest automaker last November agreed with unions to cut thousands of jobs through natural attrition, weed out red tape and cut R & D costs under a so-called future pact to revive the core namesake brand. To counter any weakening at Wolfsburg, VW's core plant employing over 60,000 people and grappling with low demand for the aging Golf, management should overhaul assembly lines to be able to build an extra 40,000 Tiguan sport-utility vehicles (SUVs), VW's most sought-after model at present, works council chief Bernd Osterloh said. \"A high capacity utilization of German plants is crucial for the success of the company and the jointly agreed future pact,\" Osterloh said on Wednesday in emailed remarks to Reuters. \"Only by means of a high capacity utilization we can achieve the productivity targets .\" VW couldn't be reached for comment outside business hours. The carmaker plans to raise productivity at its German factories by 7.5 percent this year and next, and a further 5 percent in 2019 and 2020, counting on fixed-cost cuts and fine-tuning of R & D, procurement and production operations. Investors have said a turnaround at the long-struggling VW brand is key to reviving the group's fortunes following a costly diesel emissions test-cheating scandal. Osterloh, a member of VW's supervisory board, said the carmaker has earmarked another 500 million euros ($587.20 million) in cost savings on top of the 1.5 billion of efficiency gains already budgeted this year, without providing details. VW's works council want the new model to be assigned to one of the three auto-making plants in Wolfsburg, Emden and Zwickau, Osterloh said. Wolfsburg has already been chosen to build an SUV model of VW's Spanish division Seat in 2018, using the German group's cost-saving MQB modular platform that underpins the Tiguan. VW's powerful unions, whose members occupy half the 20 supervisory board seats, threatened to withhold support for mid-term group spending plans on models, plants and technology due to be discussed by the board in November without a production roadmap from management, Osterloh said. \"It's completely clear that the workers will only approve the budget round if the German plants are utilized as agreed under the future pact,\" he said. (Reporting by Andreas Cremer; Editing by <mark>Andrew Hay</mark>) This content appears as provided to The Globe by the originating wire service. It has not been edited by Globe staff. Topics Reuters AG Europe Germany Passat SA Volkswagen AG Wolfsburg, Lower Saxony", "articleID": "2017080906_00625267_W", "names": {"Andrew Hay": ["Q21174027", "Q21456447", "Q39078862", "Q43912209"]}}, {"date": "2017-08-10", "url": "http://www.businessinsider.in/The-UK-is-now-home-to-hundreds-of-human-traffickers-and-business-is-booming/articleshow/60006366.cms#commentHash", "content": "The UK is now home to hundreds of human traffickers - and business is booming Kieran Corcoran Aug 10, 2017, 07.09 PM Facebook Linkedin WhatsApp Twitter Google + Reddit Continue reading The National Crime Agency said the slave trade in the UK is \"far more prevalent\" than expected. Gangs are making up to £ 600 a day forcing victims into work, including prostitution. Children as young as 12 have been forced into domestic servitude. Senior officer said criminals are shifting their business models towards slavery to maximise profits. LONDON - Britain is home to hundreds of gangsters who have trapped more than 10,000 people in domestic servitude, forced labour, and sex work, senior police officials have said. The gangs make up to £ 600 ($780) from forcing women into sex work, according to the UK's National Crime Agency (NCA), which deals with the most serious cases, and are moving into other types of business as well. Police and border officials have found children as young as 12 forced into domestic servitude. The problem of trafficked labour is also prevalent in the fishing industry, agriculture, construction, and food processing, the NCA said at a press conference on Thursday. It shared footage of a recent raid in the north-east of England, which showed officers breaking down the door of a house and arresting several men. It also showed the inside of a room where women were forced to have sex with the gang's clients. Will Kerr, who is leading the NCA's anti-trafficking operations, said the phenomenon was being driven by criminal organisations changing their business model to focus on human exploitation over other crimes. At the media briefing on Thursday, he said: \"A growing number of crime gangs have realised that, while you can sell drugs once and make a profit once from drugs, you can repeatedly exploit people including the most vulnerable and continue to make money from them on a regular basis .\" Kerr said several gangs were making £ 600 a day from women they forced into prostitution but emphasised that sex crime was not the only type of modern slavery. Twelve-year-old girl sold into domestic servitude He described one case of a 12-year-old Roma girl, who was found by border officials in a recent investigation. The girl, whom he couldn't name or give a location for, had been sold by her father to the criminal gangs and was sold into domestic servitude. Her host family made her take their children to school and clean the house during the day, effectively enslaving her. Kerr described how people are lured from other countries - and to a lesser extent within the UK - by adverts for jobs which later turn out not to exist, often on social media. When they arrive, victims are typically forced into whatever type of work the gang deems them suited for. Gang leaders then take most or all of the money they would be paid. Kerr said it is difficult to spot trafficking victims at the border (they typically arrive on budget flights or a ferry) because they have not yet realised they have been tricked. Slavery is \"far more prevalent than previously thought\" The scale of the problem was emphasised on Thursday at a press event where the NCA admitted that the scale of modern slavery in the UK is \"far more prevalent than previously thought .\" Kerr said the phenomenon was not restricted to any particular area of the country, and is taking place \"every large town and city in the UK .\" The various British police forces currently have 300 separate investigations into human trafficking and slavery, after senior officers decided the scale of the problem demanded a more robust response. An NCA spokesman declined to specify how many gangs are under investigation, but said that at least 300 separate suspects would be involved. Kerr said his agency is now running \"significantly more\" investigations than this time last year, and that \"the more we look for modern slavery, the more we find .\" There are more than 13,000 trafficking victims in the UK The NCA did not provide precise figures, but said that a previous estimate that the UK is home to between 10,000 and 13,000 victims would by now have been superseded. The agency urged people to be aware that people around them could be victims of modern-day slavery. In a statement, it said: \"This is a crime which affects all types of communities across every part of the United Kingdom. It is difficult to spot because often victims don't even know they are being exploited. Nevertheless, we need those communities to be our eyes and ears .\" There will be people living and working where victims come into contact with everyone else's so-called normal lives. \"They may see something they feel is not quite right. That might be someone seeming afraid, vulnerable or being controlled, moved around or forced to work against their will. If they do, we need the public to speak to us .\" The NCA said anyone with suspicions can call their local police force on 101 or the Modern Slavery Helpline, 08000 121 700. We are sharing #SilviasStory today. Here's why - https: //t.co/IndyigM6gL. #ForcedProstitution could be happening on your street @ MSHelpline pic.twitter.com/wlAIsbiMd6 - NationalCrimeAgency (@ NCA_UK) August 10, 2017 Facebook Linkedin WhatsApp Twitter Google + Reddit Follow Business Insider on facebook Like twitter Follow gplus Follow Next Story There is a looming threat to the stock market's calm that's not even on investors' radars More from this author 7 Welsh priests walked into a bar...and...London firefighters defeat massive fire a.. . Several deaths confirmed in horrific Germ...Iraq's prime minister has declared the \"e.. . Video shows gunshots and explosions from...Related Stories Ad tech firm Rubicon Project's stock plummeted aft...The ad fraud issue could be more than twice as big...Tatas might start funding social enterprises Are you making these mistakes in your first job? I.. . India is becoming a hot auto market; Toyota, Volks...Wait is over! One day to\" Baahubali 2' trailer SDMC to make restrooms in South Delhi hotels and r.. . <mark>Trump</mark>'s team and his supporters are taking a victo...More: Promoted Stories 4-year-old needs an urgent Heart Transplant Milaap Help 3-year-old undergo a liver transplant! Milaap Ever Wonder Why <mark>Donald Trump</mark> Doesn't Talk About His Daught. . LifeDaily.com A Solution That Puts Snoring to Bed My Snoring Solution Cop Finds Baby In Dumpster: But 25 Years Later, This Happe. . LifeDaily.com Megahype: The World ´ s first wiperblade cutter ECOCUT pro", "articleID": "2017081013_00983558_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-08-13", "url": "http://www.huffingtonpost.com/entry/a-priests-confession-i-am-racist_us_59908b33e4b063e2ae058099?section=us_religion", "content": "BrianAJackson via Getty Images My siblings in Christ, after the events that have been unfolding in Charlottesville, the Spirit has moved within me and compels me to share with you an important and serious confession. I am racist. It's not something I'm proud of. I like to consider myself woke. I like to consider myself a good white person. I was born and raised in multicultural Northern Virginia. I went to a high school in which there were more kids of color than there were white kids like me. My life partner is a beautiful dark-skinned man. But I am still racist. Rarely does a day go by when I am not confronted with my own internalized racism. When I'm walking my dog early in the morning or late at night, I have to consciously be aware of my body's reaction when walking past a black man. When I am around other white people and occasionally hear a racist remark--whether in the form of a sincere opinion or an attempt at humor--I don't always speak up to condemn such talk. When I am in a setting where I am the only white person, I am uncomfortable. I may do a convincing job of not showing it (or so I think), but internally I am analyzing every move I make and every thing I say to try and convince my company that I am a good white person. Even still, I am racist. And whether you think so or not, I'm sorry to tell you: you are racist, too. As columnist Courtney Martin writes, \"If you are white, if you've been socialized in the United States of America in the twenty-first century, you are racist. You will be racist until the day you die. There is nothing you can do to escape that fundamental fact .\" There may be nothing we can do to change this. But there is plenty we can do in response to this. I think step one is confession. Admission of guilt. It's easy to criticize someone like President Trump for failing to acknowledge what's happening around him. The racism of the white nationalists who gathered in Charlottesville yesterday is easier to spot. It's out in the open. But our racism? Our racism is bottled up on our shelf next to all the books we've read about racism, or the prison industrial complex, or <mark>Alexander Hamilton</mark>. Our racism is kept hidden in the faces of all our friends of color on Facebook, or the diploma on our wall from a good liberal university, or the people we march beside at protests. Yes, self-confessing neo-Nazis or members of the Klan are easy to identify as racists. But it's not so for you and me. For us, it's well hidden. We don't like to show it. But we're still racist. And to those reading this who are black or brown, I'm sorry. I'm sorry I have to preach a sermon like this. I'm sorry for the ways that I have failed you. I'm sorry for all the times I've been too weak to relinquish the ways that my life is easier because I don't look like you. I'm sorry for the ways our world demonizes you, hurts you, calls you names, and kills those who look like you. I'm sorry you have to worry about your children's survival each day. I'm sorry you have to have \"the talk\" with them at such a young age. I'm sorry for the ways our Church has failed you. But I'm here to say that despite the ways we humans fail constantly, God does not fail. God's steadfast love endures forever (Psalm 136). Last night I recalled a conversation I recently had with a client at Charlie's Place. (Charlie's Place is our parish's feeding and social services program for the hungry and homeless in our community .) This conversation I'm thinking of is exemplary of a number of conversations I have had with clients who on the whole, despite the poor hands they have been dealt in life, remain quite resilient and firm in their faith in God. This is true for Franklin, originally from Nigeria, who in response to my asking if he missed his home told me, \"I find God no matter where I am. And I know that God is with me .\" Later he added \"It's so simple yet so difficult for many people to accept. Jesus is Lord. Once you accept this, everything else follows .\" This was like Franklin's confession. The kind of confession Paul advocates in his letter to the Romans. Now I want to talk about this Romans passage. Because I think it has something very relevant for all of us and contains part of the ways that we can respond to our racism. The main point Paul is trying to make here, which some argue is in fact the main point he's trying to make in the entirety of this massive epistle to the Romans, is this: \"If you confess with your lips that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved\" (Romans 10:9). The end. Or, as Franklin put it, \"It's so simple yet so difficult for many people to accept. Jesus is Lord. Once you accept this, everything else follows .\" So it occurs to me that if we progressive Christians struggle to admit we're racist, then I think we sometimes also struggle to think about confessions of faith. And we don't like to talk about our path to salvation. That kind of talk we're used to hearing from other kinds of Christians. But not in an Episcopal church! But Paul simply says: Everyone who calls on the name of the Lord will be saved. Simple maybe. But that's not the same as easy. It's simple (maybe) to accept the fact that we're racist, and that we have no control over the ways that internalized racism shapes our daily lives. But it's not easy to know how to respond to that. I think Paul is challenging us to set aside any queasiness we might have about his assertion, and to trade in our own self-righteousness about who's right and who's wrong in the cultural and political wars of our day. Then we can truly consider what it would mean to believe Paul when he writes that \"there is no distinction between Jew and Greek, there is no longer slave or free, or male and female,\" (Romans 10:12; Galatians 3:28). Everyone who confesses that Jesus is Lord will be saved. My friends, we need Jesus to be Lord. Because if Jesus is Lord, then Caesar is not. If Jesus is Lord, then white supremacy is not. Racism and white nationalism cannot and will not have the final answer if Jesus is Lord. So confess with me first: I am racist. Then confess your faith in Jesus Christ. And trust that because of Jesus' lordship, the rest will follow. Notes: A version of this message was originally preached at St. Margaret's Episcopal Church, Washington, DC, on Sunday, August 13. \"Franklin\" is a pseudonym to protect the anonymity of the individual mentioned. Download MORE: U.S. News Arts And Entertainment Hate Speech Christianity Jesus", "articleID": "2017081321_00561709_W", "names": {"Alexander Hamilton": ["Q43390357", "Q43914913", "Q56556511"]}}, {"date": "2017-08-14", "url": "https://www.northernstar.com.au/news/wilko-slips-in-world-title-race/3212323/", "content": "TIGHT FINISH: Byron Bay surfer <mark>Matt Wilkinson</mark> has dropped to third on the World Championship Tour rankings. Kelly Cestari Popular Stories Four dead after two horror crashes East Ballina fire may smoulder for days Woman has sex with three dogs: Didn't know it was illegal Local Real Estate Subscribe Now BYRON Bay surfer <mark>Matt Wilkinson</mark> has lost his lead on the World Championship Tour after an early exit at the Billabong Pro in Tahiti. He was eliminated in the fifth round while former Lennox Head surfer <mark>Owen Wright</mark> made it as far as the quarter-finals. <mark>Wilkinson</mark> drops two places in the world title race while <mark>Wright</mark> holds his spot at fourth. The Byron Bay resident has still won the most prizemoney on tour this year with South African surfer Jordy Smith now in first place. <mark>Julian Wilson</mark> has jumped to fifth after beating <mark>Gabriel Medina</mark> in the Billabong Pro final yesterday. It was his third win on the tour and best result at Tahiti. \"It has been a few years,\" <mark>Wilson</mark> said. \"It is so special to win. I am ecstatic and I have nothing left in me .\" I am just so happy and relieved to finally win an event again. \"It took so many good waves to win this event and I was lucky enough to get those .\" It really turned on for us in the final and we had some great opportunities, so I am just glad to get that special one. \"\"I've had a pretty steady start to the year and I am so happy to be in the mix now .\" With so many events left, I am really looking forward to it and I cannot wait for the rest of the year. \"Meanwhile, <mark>Wright</mark> has been a consistent performer since returning to the tour fulltime this year. He won the first event of the year on the Gold Coast and has made three quarter-finals since .\" At the start of the year I was just focused on health but now being in the title race is where I want to be, \"<mark>Wright</mark> said .\" I find myself trying to be really aware of what's going on. \"It was always going to be a tough ask for <mark>Wright</mark> at Tahiti after <mark>Medina</mark> nailed a perfect 10 on his first wave in the quarter-final. <mark>Medina</mark> has struggled to get past the semi-finals since winning the world title in 2014 .\" It feels good to be back in the game and now I am thinking about Trestles (Hurley Pro). \"It is Father's Day in Brazil and my dad is here, so that was a good present .\" 0", "articleID": "2017081420_00374373_W", "names": {"Gabriel Medina": ["Q3093867", "Q42394048", "Q5873447"], "Julian Wilson": ["Q27068761", "Q6307688", "Q6307689"], "Matt Wilkinson": ["Q21091668", "Q6789524"], "Owen Wright": ["Q3359004", "Q7114703", "Q7114704"]}}, {"date": "2017-08-14", "url": "http://news.yahoo.com/news/body-language-experts-analyse-whether-212500618.html", "content": "<mark>Donald Trump</mark>'s comments condemning white supremacists may have been belated--and heavily scripted--but body language experts say they were largely sincere. On Monday, under mounting media pressure, Mr <mark>Trump</mark> took to the podium to call out white supremacists, neo-Nazis, and the KKK. Three days earlier, a hundred of them had descended on Charlottesville, Virginia, in protests that lead to three deaths and dozens of injuries. Mr <mark>Trump</mark> had initially attributed the casualties to \"violence on many sides\". On Monday, however, he called out the hate groups specifically. \"Racism is evil,\" Mr <mark>Trump</mark> said, in hastily arranged remarks at the White House. \"And those who cause violence in its name are criminals and thugs, including the KKK, neo-Nazis, white supremacists, and other hate groups that are repugnant to everything we hold dear as Americans .\" Body language experts Susan Constantine and Lillian Glass both told The Independent that the remarks appeared scripted, and devoid of the President's usual ad-libbing--an indication of the seriousness of the topic. But both women agreed that Mr <mark>Trump</mark> couldn't help letting slip some telling body-language cues. \"He's got to either concentrate on his words and reading off the script, or on showing the right affect,\" Ms Constantine said. \"I've found that what he does is he reads the script, but at the moment he feels he wants to add emphasis, he uses hand gestures .\" \"Racism is evil': <mark>Trump</mark> condemns white supremacist groups after deadly protest in Charlottesville pic.twitter.com/4g3PL4SsdP--Business Insider (@ businessinsider) August 14, 2017 Ms Constantine pointed to his signature bouncing, up-and-down hand gesture, which she says connotes his anger. The gesture, she said, is similar to someone shaking their finger. It means:\" I am telling you with a level of certainty, I will absolutely not put up with it. \"Ms Glass also saw signs of authentic anger from the President, especially when he talked about one of the weekend's victims. When discussing the death of 32-year-old Heather Heyer, she said, the President\" breathes in through his nose, which shows he is angry \". She compared the breathing to that of a bull before it enters the ring. His upturned palm, she added, shows he was speaking honestly on the subject. But Ms Glass also noticed something odd about his remarks--a new gesture she had never witnessed the President making. The movement--a sort of pinching of the thumb and forefinger--is a gesture she says was pioneered by John F Kennedy, and parroted by every president after him .\" I guess he's trying to be contained, because he's got this new gesture, \"she said .\" ...In essence, he's starting to get more in-script and more in the politics of the matter. \"Despite this, Ms Glass is convinced that Mr <mark>Trump</mark> meant the bulk of what he said from behind the podium--whether or not he wrote the words himself .\" He's very controlled because he knows this is such a divisive issue, \"she said,\" ...But he does leak out his anger and passion when he breathes through his nose, and his honesty comes out through his hand being open. \"Ms Constantine concurred .\" When he's talking about how he wants everyone to love each other...he's using his hand gestures, \"she said .\" And as a body language expert, that \"s what you look for: Do the words match the gesture? If he didn't feel that, his hands would be on the podium .\" ", "articleID": "2017081605_00731605_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]