[{"date": "2017-08-16", "url": "http://tv.yahoo.com/tv/seth-meyers-calls-trumps-charlottesville-press-conference-clinically-insane-214031608.html", "content": "Superfan Superfan TV • August 16, 2017 Late night hosts have been sharply rebuking President Trump's handling of the recent events in Charlottesville, Virginia, in which white supremacists clashed with protesters, leading to the death of one woman, Heather Heyer, and dozens more being injured. Trump took several days to specifically address the hate groups' actions but in a recent press conference said there were \"very fine people\" on both sides of the conflict. On Late Night, Seth Meyers spoke out about Trump's refusal to fully condemn the hate groups who participated, saying, \"President Trump this afternoon gave a press conference that can only be described as clinically insane .\" Meyers went on to highlight Trump's comparison of a Confederate general to George Washington. He also highlighted White House Chief of Staff <mark>John Kelly</mark>'s slumped posture during the speech. The late-night host joked, \"Trump is so fully out of his mind he broke a general. That guy's been in wars .\" Seth Meyers ended his segment, titled \"Breaking Crazy,\" with a call to Congress to \"cut bait\" on the President. Watch: \"He is not a president': Seth Meyer's statement on Trump's response to Charlottesville: Read more from Yahoo TV:\" Bachelor in Paradise' Season 4 Week 1 recap: Trouble in you know where Our favorite Elvis Presley TV sightings on the 40th anniversary of his death \"The Walking Dead's' most unforgettable foodie moments: From Crazy Cheese to S’Getti Rings Tell us what you think! Hit us up on Twitter, Facebook, or Instagram or leave your comments below. And check out our host, Khail Anonymous, on Twitter.", "articleID": "2017081622_00108944_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}}, {"date": "2017-08-17", "url": "http://www.huffingtonpost.com/entry/trump-charlottesville-reaction_us_59956f3fe4b0acc593e5639c?section=us_queer-voices", "content": "President <mark>Donald Trump</mark> on Thursday claimed that he never \"said there is a moral equivalency between\" white supremacists and the activists protesting bigotry last weekend in Charlottesville, Virginia. But <mark>Trump</mark> had on Saturday blamed \"many sides\" for the deadly violence at a white supremacists rally in Charlottesville, and waited two days to denounce the neo-Nazis and other far-right groups who organized the event. Then, on Tuesday, he defended his initial response to the violence and lashed out at the anti-fascist activists who had been protesting the \"Unite The Right\" event. He also claimed there were \"fine people on both sides\" and even said that some of those attending the white supremacist gathering were \"innocent .\" \"I am not putting anybody on a moral plane,\" he said. \"You had a group on one side and the other and they came at each other with clubs and it was vicious and horrible. It was a horrible thing to watch. There is another side. There was a group on this side, you can call them the left. You have just called them the left, that came violently attacking the other group. You can say what you want. That's the way it is .\" Publicity seeking Lindsey Graham falsely stated that I said there is moral equivalency between the KKK, neo-Nazis & white supremacists....--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) August 17, 2017...and people like Ms. Heyer. Such a disgusting lie. He just can't forget his election trouncing. The people of South Carolina will remember!--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) August 17, 2017 The public is learning (even more so) how dishonest the Fake News is. They totally misrepresent what I say about hate, bigotry etc.. Shame!--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) August 17, 2017 As The New York Times put it, \"<mark>Trump</mark> buoyed the white nationalist movement on Tuesday as no president has done in generations--equating activists protesting racism with the neo-Nazis and white supremacists .\" \"If you look, there were people protesting very quietly the taking down of the statue of Robert E. Lee,\" he said on Tuesday, referring to a torch-carrying group of far-right activists, many of whom were waving Swastikas or chanting \"Jews will not replace us .\" His Thursday comments were a direct rebuttal to Sen. Lindsey Graham (R-S.C.), who had on Wednesday accused <mark>Trump</mark> of \"dividing Americans\" with his Charlottesville response. \"Through his statements yesterday, President <mark>Trump</mark> took a step backward by again suggesting there is moral equivalency between the white supremacist neo-Nazis and KKK members who attended the Charlottesville rally and people like Ms. Heyer,\" Graham had said in a statement. \"I, along with many others, do not endorse this moral equivalency .\" <mark>Trump</mark>'s comments have been panned by lawmakers across both parties, as well as officials overseas. Download Suggest a correction Alana Horowitz Satlin Assignment Editor, HuffPost MORE: <mark>Donald Trump</mark> U.S. News Republican Politics Hate Speech Political Science Subscribe to the Queer Voices email. Get all of the queer news that matters to you.", "articleID": "2017081713_00089074_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-08-17", "url": "http://ksn.com/2017/08/17/k-state-hopes-returning-secondary-can-hold-up-in-big-12/", "content": "MANHATTAN, Kan. (AP)--The school that once produced <mark>Chris Canty</mark> and Thorpe Award winner Terence Newman has struggled to defend in recent years in the pass-happy Big 12. It still draws Kansas State coach <mark>Bill Snyder</mark>'s ire. The hard-to-please Hall of Fame coach was often quick to bemoan a bunch that allowed 272.7 yards per game through the air last season, better only than the sieve known as Texas Tech. Their shortcomings were only made worse when they were forced to stand beside by the Wildcats' staunch rush defense, which was by far the best in the Big 12. But the Wildcats harbor hope for success this season. They return D.J. Reed, the league's defensive newcomer of the year, and running mate Duke Shelley at cornerback. Two-year starter Kendall Adams is back to anchor the safety corps, while a host of experience headlined by Cre Moore, Sean Newlan and Denzel Goolsby provide plenty of depth. Throw into the mix Elijah Walker, the third-ranked junior college safety last season, and some think Kansas State could have the best secondary in the Big 12--perhaps even the nation. \"I've seen it all happen, the good and the bad,\" said Shelley, who burned his redshirt as a freshman in 2015 when injuries forced him onto the field. \"Really for us as a unit as well, we went from nobody respecting us to,\" Wow, our unit is getting some love and respect we deserve .' We knew we deserved it. \"Now it's time to keep it. Things started promisingly enough for Kansas State last season, holding Stanford in check in the opener on the road and shutting down Florida Atlantic and Missouri State. But concerns arose when Skylar Howard threw for 298 yards in West Virginia's comeback victory, and they had a full-scale problem the following two games against Texas Tech and Oklahoma. First-round draft pick <mark>Patrick Mahomes</mark> II torched the Wildcats for 504 yards and two touchdowns, while the Sooners' Baker Mayfield had 346 yards and four TDs passing in a 38-17 rout. The key is to prevent a similar downturn this season .\" When you have a decent number of returning starters and returning players, the general public will probably say if you have a lot of people coming back then you will have an even better football team, \"<mark>Snyder</mark> said .\" We were pretty decent at the end of the season last year, so there is great expectation. \"There is nothing wrong with that. That is great,\" he continued. \"The key element is you have to do something about it. You just can't be a returning starter or guy that played an awful lot and the same coaches coming back, etcetera. You have heard me say so many times, every season presents new dynamics .\" One of those dynamics is the schedule. Kansas State opens Sept. 2 against Central Arkansas, then plays Charlotte the following week. It gives the secondary ample opportunity to come together before a trip to Vanderbilt. But the Commodores are no real threat through the air, ranking 100th out of 128 teams in passing offense a year ago. Throw in a week off after the nonconference schedule and the Wildcats should have hit their stride before the Big 12 slate opens with games against Baylor, Texas and TCU. High-powered Oklahoma looms Oct. 21 in a game that could help decide the conference race. \"As long as they keep working, having daily improvement, stay together, play together, we will find replacements for those five or six guys we lost,\" Kansas State defensive coordinator <mark>Tom Hayes</mark> said not only of his secondary but the entire unit. \"It's our job as coaches to identify them and certainly the players' job to go earn them .\" ___ More AP college football: http: //collegefootball.ap.org and https: //twitter.com/AP_Top25 Like this: Like Loading...Related Related Posts Kansas State and Kansas football both land players on preseason watch lists Jesse Ertz receives two more honors heading into 2017 <mark>Bruce Weber</mark> and Kansas State agree on two-year contract extension <mark>Snyder</mark>, Ertz could give K-State another winning combo Advertisement", "articleID": "2017081720_00160770_W", "names": {"Bill Snyder": ["Q17388778", "Q4910936"], "Bruce Weber": ["Q4135170", "Q991871"], "Chris Canty": ["Q3675459", "Q5106084"], "Patrick Mahomes": ["Q11329045", "Q19667998"], "Tom Hayes": ["Q19668361", "Q21597864", "Q22087172", "Q22945088", "Q3777584", "Q7816126", "Q7816129", "Q7816130", "Q7816131"]}}, {"date": "2017-08-18", "url": "http://www2.newsadvance.com/news/state/wire/the-latest-conference-of-mayors-supports-anti-hate-pact/article_cecbe996-10e3-5ad1-bb35-7ebb034087d8.html", "content": "The Latest: Conference of Mayors supports anti-hate pact 9 min ago (...) Patrick Kellogg wears an American flag jacket during a rally in Coolidge Park on Thursday, Aug. 17, 2017, in Chattanooga, Tenn.. Organizers said that the purpose of the demonstration, held in response to Saturday's rally by white nationalists in Charlottesville, Va., was to declare resistance against Nazism. (Doug Strickland/Chattanooga Times Free Press via AP) Doug Strickland Robert Castello, owner of the Dixie General Store, discusses his dislike of neo-Nazis and the Ku Klux Klan in Chulafinee, Ala., on Thursday, Aug. 17, 2017. Castello and other supporters of Southern heritage fear that extremists are hurting their cause with protests like the rally that turned deadly in Charlottesville, Virginia. (AP Photo/Jay Reeves) Jay Reeves Jennifer Vik, Yvonne Thrash and Sheila Thrash hold signs during a rally at T.B. Butler Fountain Plaza in Tyler, Texas, on Thursday, Aug. 17, 2017. Around 75 people attended the rally to discuss ways the community could unify. The rally was held in response to a white nationalist rally held in Charlottesville, Va., over the weekend. (Chelsea Purgahn/Tyler Morning Telegraph via AP) Chelsea Purgahn Isaiah Moore, right, argues with counter demonstrators about race relations during a rally in Coolidge Park on Thursday, Aug. 17, 2017, in Chattanooga, Tenn.. Organizers said that the purpose of the demonstration, held in response to Saturday's rally by white nationalists in Charlottesville, Va., was to declare resistance against Nazism. (Doug Strickland/Chattanooga Times Free Press via AP) Doug Strickland People march in the streets of Durham protesting against a possible march by the Ku Klux Klan, Friday, Aug. 18, 2017, in Durham, N.C. Hundreds of anti-racist demonstrators gathered in a North Carolina city in response to rumors of a white supremacist march. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon. However, officers blocked streets and businesses closed. (AP Photo/Jonathan Drew) Jonathan Drew People march in the streets protesting against a possible march by the Ku Klux Klan, Friday, Aug. 18, 2017, in Durham, N.C. Hundreds of anti-racist demonstrators gathered in a North Carolina city in response to rumors of a white supremacist march. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon. However, officers blocked streets and businesses closed. (AP Photo/Jonathan Drew) Jonathan Drew Protesters take to the the street in response to rumors of a white supremacist march on Friday, Aug. 18, 2017 in Durham, N.C.. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon. However, officers blocked streets and businesses closed. (<mark>Bernard</mark> Thomas/The Herald-Sun via AP) <mark>Bernard Thomas</mark> CHARLOTTESVILLE, Va. (AP)--The Latest on developments related to a violent white-nationalist rally in Charlottesville, Virginia (all times local):------Breaking news emails | iOS app | Android app The U.S. Conference of Mayors says more than 250 of its members have signed on to a compact designed to combat hate, extremism and bigotry. The mayors announced the compact Friday on a conference call with the Anti-Defamation League, which is a partner in the effort. The compact lists 10 components, including rejecting white supremacism and extremism, celebrating diversity, and ensuring public safety while protecting free speech. During the call, Republican Mayor Shane Bemis of Gresham, Oregon, said the compact was needed because President Donald Trump failed to \"exhibit moral clarity\" when he blamed both sides for the violence last weekend in Charlottesville during clashes between white nationalists and counter protesters. Columbia, South Carolina, Mayor Steve Benjamin cited the need \"to create stronger cultures of kindness .\" ------2:45 p.m.. The City of Manassas, Virginia, is canceling an upcoming Civil War Weekend, citing a desire not to exacerbate recent tension over Civil War monuments. In a statement Friday, the city said that \"recent events have ignited passions in this country surrounding the Civil War and the symbols representing it .\" As a result, the city said it is canceling its Civil War Weekend planned for Aug. 25-27 out of concern for the safety of residents, visitors and re-enactors. Manassas spokeswoman Patty Prince said the city has hosted the weekend since 2011, when it was launched in connection with the 150th anniversary of the Civil War. She said the weekend is one of the smaller events on the city's tourism calendar. The Manassas area was host to two major Civil War battles .------1:30 p.m. Hundreds of anti-racist demonstrators are marching through the streets of a North Carolina city in response to rumors of a white supremacist march. The sheriff had issued a statement that he was investigating the rumors, but no gathering of white supremacists was apparent by midafternoon Friday. However, officers blocked streets and businesses closed. Hundreds of others gathered downtown with signs such as \"Black Lives Matter\" and \"We Will Not Be Intimidated .\" They marched for several blocks and then held an impromptu rally in front of where a Confederate statue was toppled Monday. On Friday, protesters altered an inscription on the statue's base that had read \"In memory of the boys who wore the gray\" with the phrase \"Death to the Klan .\" The protest was largely peaceful, but two white men and some protesters engaged in a shouting match, and then the men entered a government building. Willis Brown, who is black, said he came out to support racial unity. He said protesters are \"trying to live in harmony .\" ------Noon Four people have been charged with trying to rip away a plaque honoring Confederate Gen. Robert E. Lee from its place of honor in a North Carolina city. Asheville police said the arrests came after officers found a group of protesters around the plaque on the city's main downtown plaza about 8 a.m. Friday. Photos show people using crowbars and an electric hand drill to yank away the top-right corner of the metal plaque from a granite boulder. The vandals failed to separate the rest of the plaque. Police say the four Asheville residents charged with damage to real property are 27-year-old Nicole Townsend, 45-year-old Amy Cantrell, 30-year-old Hillary Brown and 34-year-old Adrienne Sigmon. Asheville Police spokeswoman Christina Hallingse said she did not know if any of them had obtained a lawyer .------Noon Hundreds of mourners have arrived for the funeral of a Virginia state trooper who died in a helicopter crash after monitoring a white nationalist protest in Charlottesville. Gov. <mark>Terry McAuliffe</mark> and others who gathered at St. Paul's Baptist Church in Richmond on Friday praised Trooper-Pilot Berke Bates as a devoted family man and proud police officer. <mark>McAuliffe</mark> told colorful stories of Bates from his time spent on the governor's protective unit. Authorities say Bates was a passenger in a helicopter providing video to police of activities in downtown Charlottesville last Saturday before it broke off to lend support to a motorcade for the governor. Bates had recently gotten his pilot's license so that he could apply to work for the department's aviation unit. He joined the unit only last month .------10:15 a.m.. The mayor of the Virginia city rocked by a deadly white nationalist rally over a statue of Confederate Gen. Robert E. Lee has canceled a scheduled news conference about the monument's future. Charlottesville Mayor Mike Signer's office said Friday that he would no longer be making a previously scheduled \"major announcement\" about the Lee statue. Signer's office said the mayor would hold public events in the future to discuss public safety and the \"legacy of Heather Heyer,\" the woman who was killed after a car rammed into a group of people protesting against white supremacists last Saturday. Signer's office said Friday morning that the governor would release a statement later in the day .------9:30 a.m. Crime novelist and Charlottesville, Virginia-area resident John Grisham is condemning the white nationalists who descended upon the city for a rally that turned deadly. Grisham writes in a column published by Time that the neo-Nazis, skinheads, Ku Klux Klan members and others came to Charlottesville last Saturday to \"provoke violence and get attention .\" Grisham says the city has proved that \"silence is not an option\" in the \"face of intimidation and hate .\" Grisham says that Charlottesville's streets are quiet again and physical wounds are healing, but \"emotional wounds will take longer .\" One woman was killed and 19 were injured on Saturday when a car plowed into a crowd of people who gathered to condemn what is believed to be the largest gathering of white nationalists in a decade .------9 a.m. Faculty members at a college in South Carolina want their president to repudiate a Confederate flag event planned at the school in October. The Post and Courier of Charleston reported the history department at the College of Charleston has asked school president Glenn McConnell to ban events planned by the South Carolina Secessionist Party on campus. McConnell is a former state Senate leader and lieutenant governor who formerly owned a Confederate memorabilia shop. The South Carolina Secessionist Party plans to display Confederate battle flags on campus Oct. 28. McConnell has mostly avoided discussing the Civil War since becoming college president in 2014. A college spokesman said McConnell had no comment. The faculty said the event is designed to intimidate students, staff and faculty. Secessionist Party founder James Bessenger denies that .---- --", "articleID": "2017081819_00051541_W", "names": {"Bernard Thomas": ["Q16440226", "Q28099675", "Q2898665", "Q4893701"], "Terry Mcauliffe": ["Q3518911", "Q49001865"]}}, {"date": "2017-08-18", "url": "http://idahopress.com/news/world/the-latest-american-man-is-among-the-barcelona-dead/article_903fce07-6a92-5197-88df-9735fea19e89.html", "content": "BARCELONA, Spain (AP)--The Latest on the Spain attacks (all times local): 10:30 p.m.. A father says his son, a California resident, is among the 13 people killed in a van attack in Barcelona, Spain. × Advertisement Daniel Tucker tells The Daily News of New York that his son Jared Tucker's body was identified by his wife at the morgue Friday. Tucker says of the attack, which was claimed by Islamic State militants, \"it's just something we really just don't understand .\" Jared Tucker and his wife, Heidi Nunes, were visiting Barcelona for their first wedding anniversary. Tucker and his father worked together installing swimming pools. The elder Tucker tells the newspaper that \"everybody loved him .\" Secretary of State Rex Tillerson on Friday confirmed that an American died in the Barcelona van attack .------10:20 p.m. Barcelona says it will make its Spanish league debut with players wearing a shirt carrying the word \"Barcelona\" instead of their names to pay tribute the victims of the vehicle attacks in the city and the nearby seaside resort of Cambrils. The hashtag \"TotsSomBarcelona\" (We are all Barcelona) will be displayed on the front of the players' shirts when the team hosts Real Betis on Sunday at Camp Nou. The club said it received special authorization from the Spanish soccer federation to make the changes. Barcelona said club members playing in various age divisions over the weekend will also wear a black armband in honor of the victims. There will be a minute of silence before every Spanish league game this weekend. Barcelona said the moment will \"commemorate all the victims and offer support to their friends and relatives, and all the citizens and visitors to the city .\" ------10 p.m.. A police union official says a document identifying four suspects in the attacks in Spain's Catalonia region identify them as being of Moroccan origin and all from the small city of Ripoll near the Pyrenees mountains and Spain's border with France. The document--whose validity was confirmed by a Spanish police union official--identified the four as Moussa Oukabir, Said Aallaa, Mohamed Hychami and Younes Abouyaaqoub. It says Oukabir was born in Ripoll and also holds Moroccan citizenship. The document also says the other three were born in Morocco and have Spanish residency. The official said Friday the document was sent to police across the country after Spain's National Court issued arrest warrants for the suspects. The official spoke anonymously because the official was not authorized to disclose the information .--By Alan Clendenning------9:20 p.m.. The leading newspaper in Spain's northeastern Catalonia region says beach towns are installing concrete barriers on popular pedestrian walkways to try to prevent the kind of attack that saw a van plow through tourists walking on a famed Barcelona promenade. La Vanguardia reported Friday that barriers were installed in the popular Mediterranean tourist destinations of Calafell, Calella and Reus. Strolls down Spanish streets and pedestrian-only areas filled with bars and restaurants are one of the country's biggest tourism draws. Those areas are typically packed with people during the summer, often until midnight or later. La Vanguardia's report had images of the barriers and of workers putting in place huge concrete flower pots in downtown Madrid as a precaution against van attacks. Thursday's van attack in Barcelona killed 13 people and injured 120, while a car attack early Friday in the seaside resort of Cambrils left one dead and five injured .------8:55 p.m.. A police union official says he has been told that Moussa Oukabir, one of the main suspects in the Barcelona and Cambrils van attacks, was killed by officers in Cambrils early Friday. Spanish media are also reporting that Oukabir, 17, was killed and say he is the driver of the van that plowed into scores of pedestrians in Barcelona on Thursday, killing 13 people and wounding 120 others. A spokesman for Catalonia regional police said authorities were investigating whether the driver had been killed but would not say if they suspected this was Oukabir. The official with a union for Spain's Civil Guard police force told The Associated Press that police colleagues confirmed Oukabir was one of five suspects killed by Catalan regional police officers early Friday in an attack on a seaside resort. The union official says Oukabir was one of four suspects for whom a court has issued warrants. He is also believed to be the younger brother of Driss Oukabir, one of the four people arrested since the attacks. He spoke on condition of anonymity because he was not authorized to disclose the information .---- Ciaran Giles, Alan Clendenning .------8:20 p.m.. A French security official says Spanish police are looking for a Kangoo utility vehicle rented by suspects in the Barcelona attacks that may have crossed into France. The official said Spanish police alerted French authorities to the vehicle, rented Thursday in Spain. The official said French police nationwide are on the lookout for the car, and were given information from Spain about four suspects believed to be on the run. The official was not authorized to be publicly named speaking of an ongoing manhunt. After two deadly vehicle attacks in Barcelona and a nearby resort, France's interior minister said his country reinforced police surveillance Friday of what is normally an open border between Spain and France. French officials said Friday evening that no one has been detained so far in the Spanish investigation. The attacks Thursday and early Friday in Spain killed 14 people and wounded 126 others .------7:40 p.m. Riot police have dispersed a small group of far-right protesters after separating them from hundreds of counter-protesters near the site of a memorial to the Barcelona van attack victims. The far-right protesters, numbering 20-30, held up signs saying \"Stop Islamization of Europe .\" Counter-protesters were chanting \"tontos,\" or \"idiots\" at them, with some of them holding up their middle fingers at the far-right protesters. Riot police wearing helmets with face shields kept them apart for a while before gently removing the far-right protesters. After they walked away, the counter-protesters applauded and also left peacefully. The protest came a day after a van rammed into pedestrians in Barcelona's Las Ramblas district, killing 13 and injuring 120 .------7:30 p.m.. An official with a union for Spain's Civil Guard police force says a court has issued an order for the arrest of four suspects in connection with the attacks in Barcelona and a nearby seaside resort. The official also confirmed the validity of a document naming the four suspects, with photos, and says it was sent to police across the country with the arrest order. A French official also confirmed the document was circulating among law enforcement officials. Both spoke on condition of anonymity because they weren't authorized to disclose the information. The document says one suspect was born in Spain and has Moroccan citizenship and the other three were Moroccans with Spanish residency. The list included Moussa Oukabir, who is believed to be a brother of one of those arrested for the attacks and possibly the Barcelona van driver. The document was first reported by Spanish media who said it was provided by unnamed police sources .--by Al Clendenning in Phoenix, Ciaran Giles in Madrid and Lori Hinnant in Barcelona .------6:55 p.m.. A regional police official in Spain says that authorities are investigating whether the Barcelona van attack driver is among the suspects killed by officers after the attack in the nearby resort of Cambrils. The official, however, said that officers couldn't yet confirm that the Barcelona van attacker was among the five suspects killed in Cambrils after ramming into people with another car. One woman was killed in the attack and six others were injured. The official spoke on customary condition of anonymity. The van attack in Barcelona killed 13 people and injured 120 others .--By Ciaran Giles in Madrid .------6:25 p.m. Spanish police have searched the family apartment of a teenager reportedly suspected of driving the van in the deadly promenade attack in Barcelona. Neighbors of the Oukabir family in the northern town of Ripoll say no one was home when the police arrived Friday morning. The door of the Oukabir's first-floor apartment was busted open. Spanish media have identified the van's suspected driver as 17-year-old Moussa Oukabir. His brother, Driss Oukabir, a French citizen of Moroccan origin, reportedly went to police in Ripoll to report that his documents were stolen. The mayor of Ripoll, Jordi Molle, says the documents were found in a vehicle used in the Barcelona attack. Ripoll, a 90-minute drive north of Barcelona, is a quiet, upscale town of 10,000 tucked into hilly Catalan heartland .---- 6 p.m. Rome will turn off the lights on the Colosseum to mourn those killed in the Barcelona attack. Italian Culture Minister Dario Franceschini says the lights on the ancient arena will go dark for a half hour Friday night. The ministry says the gesture is a \"sign of solidarity with the city of Barcelona and of mourning for the victims of the terror attack .\" On the broad boulevard outside the Colosseum are somber reminders of some of Italy's anti-attack security strategy. Near each end of the road, which is closed to most vehicular traffic, heavy vehicles guarded by soldiers or other security forces are positioned in such a way that city buses must slow to slalom around the obstacles .------5:45 p.m. Emergency authorities in Spain have provided an update on the numbers of casualties in the attacks in Barcelona and the seaside town of Cambrils. The Civil Protection agency says that 120 people were injured in the Barcelona attack, and six in Cambrils. It says that 61 people remain hospitalized, including 17 in critical condition and 25 in serious condition, after the Barcelona van attack. In the Cambrils attack, four people remain hospitalized, including three in serious condition. The death toll remains the same: 13 killed in Barcelona and one woman in Cambrils .------5 p.m.. The U.N. Security Council is strongly condemning the terrorist attack in Barcelona and paying tribute to the innocent victims. Egypt's U.N. Ambassador Amr Abdellatif Aboulatta, the council president, began Friday's meeting on Yemen denouncing Thursday's deadly attack in Spain. He said: \"On behalf of the members of the Security Council, I should like to condemn in the strongest terms the unconscionable terrorist attack in Barcelona, Spain, which targeted innocent civilians .\" Aboulatta said the Security Council sends its \"deepest condolences\" to the families. Many ambassadors and diplomats stood with their heads bowed in tribute .------4:40 p.m. Barcelona and Real Madrid have held a minute of silence for the victims of the attacks in Spain before their training sessions. Real Madrid players huddled Friday before beginning their activities at the team's training center in Madrid, while Barcelona's squad lined up in silence before its practice session at the team's headquarters. Barcelona team President Josep Bartomeu joined thousands at a minute of silence near where the driver of a van started an attack Thursday that killed at least 13 people and injured more than 100 others in Barcelona. There will be a minute of silence held before every Spanish league game this weekend, beginning with Friday's opening matches: Leganes vs. Alaves and Valencia vs. Las Palmas. Other soccer leagues across Europe have also planned acts to honor the victims of the attacks. The French league will hold a minute of silence before games .------4:30 p.m. Two memorials to the victims have grown on Barcelona's historic Las Ramblas promenade--one at the top near where the van jumped the curb, the other on the Joan Miro mosaic embedded in the pavement where it stopped. An ever-expanding jumble of flags, candles, teddy bears and flowers were placed at the base of the ornate Canaletes Fountain. \"We are not afraid! We are not afraid!\" onlookers chanted in Spanish. Jesus Borrull, a lifelong resident, gently pushed through the crowd to kneel and pray in front of the fountain. Legend has it that visitors who drink from the fountain will fall in love with Barcelona and return to the city. Borrull says \"the only thing we can do is go forward with peace and goodness...even though it's difficult, we have to do it .\" At the other memorial, bystanders held signs declaring they are not afraid. A guitar player strummed out \"Imagine\" by <mark>John Lennon</mark> while several people sang along .------4:20 p.m.. The State Department says at least one American was killed and one was injured in the terrorist attacks in Barcelona and Cambrils, Spain. The department said Friday that diplomats from the U.S. consulate in Barcelona are continuing to work with local authorities to identify victims and provide assistance to Americans. The department did not identify either of the Americans, but said the injured person suffered only a minor wound .------4:15 p.m. Spanish authorities are still investigating whether a car that rammed a police checkpoint in the confused hours after the Barcelona van attack on Thursday was linked to the bloodshed in the city. Catalan police chief Josep Lluis Trapero said the driver of a Ford Focus rammed the control post and wounded a sergeant. Another officer shot at the car, which stopped, he said. Police found a dead body inside and first thought they had shot and killed the person, but forensic reports showed it was a knife wound. Trapero said a second person may have been in the car. He said it was unclear how or whether it was linked to the other attacks in Spain on Thursday and Friday .------4 p.m. Italy's premier has released the names of two Italians slain in the Barcelona van attack. Premier Gentiloni tweeted Friday that \"Italy remembers Bruno Gulotta and Luca Russo and gathers tight around their families. Freedom will conquer the barbarianism of terrorism .\" Gulotta, 35, was hailed in his hometown of Legnano as a hero for putting himself between the van and his 6-year-old son and 7-month-old daughter as he strolled with his wife Thursday in the Spanish city. Italian media reported that Russo, 25, held a university degree in engineering and lived in northern Italy. An Italian officials said Russo's girlfriend suffered fractures and remains hospitalized. Verrecchia said two other Italians were injured but have since been released from the hospital .------3:50 p.m. Britain's Queen Elizabeth II has offered her sympathies to the King of Spain and to the nation following attacks in in Barcelona and the seaside community of Cambrils. The British monarch says it is \"deeply upsetting when innocent people are put at risk in this way when going about their daily lives .\" The queen said Friday that she and Prince Philip offer sincere condolences and that their thoughts and prayers are with those who have lost loved ones or are in the hospital. Fourteen people died and over 100 were injured in attacks Thursday and early Friday .------3:45 p.m. Police in Spain say that attacks in Barcelona, Cambrils had been prepared some time ago. Senior police official Josep Lluis Trapero said Friday police believe the two attacks were connected with an explosion in a house in the town of Alcanar on Wednesday in which one person was killed. Police believe one of the person injured in that blast and now arrested had links to the two attacks. Trapero said Cambrils terrorists carried an ax and knives in the car and body belts with false explosives. Four people have been arrested in all. Thirteen people were killed in the attack in Barcelona on Thursday and one in the resort town Cambrils early Friday .------3:30 p.m. Turkey's president has condemned the van attack in Barcelona, Spain, in which 13 people were killed. Speaking to reporters in Istanbul on Friday, Recep Tayyip Erdogan said he \"strongly condemned\" the attack. State-run Anadolu news agency reports that Erdogan sent a note offering condolences to King Felipe VI earlier in the day. Turkish media reports that 33-year-old Turkish businessman Emre Eroglu was injured in the attack. Foreign Minister Mevlut Cavusoglu has instructed Turkish consular officials to accompany him at the hospital and says he is in good condition and has received surgery on a broken foot .------3:25 p.m. Pope Francis says the extremist attack in Barcelona gravely offends God. Francis sent a condolence telegram Friday to Barcelona's cardinal, expressing \"sorrow and pain\" over \"such an inhumane action .\" In his message, the pope \"once again condemns blind violence, which is a very grave offense to the Creator .\" He offered his blessing for all the victims, their families and \"all the beloved Spanish people .\" Francis also expressed \"sadness and pain\" over the news of the \"cruel terrorist attack that has sown death and sorrow on the Rambla of Barcelona .\" ------3:20 p.m. British Prime Minister Theresa May says the government is doing all it can to help amid reports of a child missing after the terror attack in Barcelona. May told Sky News Britain is \"urgently looking into reports of a child believed missing, who is a British dual national .\" She did not name him. A post on social media from the 7-year-old boy's grandfather says Julian Alessandro Cadman became separated from his mother when a driver slammed into a crowd of pedestrians in a major promenade area. Tony Cadman posted a photograph of Julian on Facebook. He says the family found his daughter-in-law in a serious but stable condition in a hospital .------3:10 p.m.. A police official says that authorities haven't idenitifed the driver of the van that killed at least 13 people in Barcelona. Catalan regional police official Josep Lluis Trapero says that the attacks suspects in custody are three Moroccans and a Spaniard. He says that none of them had a record of terror activity although one was known to police for petty crimes. Hours after the Barcelona attack, a car struck pedestrians in the seaside town of Cambrils, killing a woman and injuring others. Police fatally shot five of the Cambrils attackers. Trapero says that the Cambrils and Barcelona attacks are linked as is an abandoned van and a house south of Barcelona destroyed in an explosion in which a man was killed on Wednesday night .------2:55 p.m.. A senior police official in Spain says that a single police officer killed four of the suspects who carried out the attack in the Catalan seaside town of Cambrils. Catalan regional police official Josep Lluis Trapero says that it was \"not easy\" for the officer involved despite being a professional. A total of five suspects were killed after the Cambrils attack in which a car plowed into a crowd, killing a woman. Hours earlier, a van struck a crowd of pedestrians, killing at least 13 people in Barcelona and injured more than 100 people .------2:35 p.m. Spanish Prime Minister Mariano Rajoy says the fight against terrorism is a \"global battle\" and Europe's main problem after two attacks in Catalonia that killed 14 people. Rajoy also thanked the emergency services for their work and messages of support from around the world after the van attack in Barcelona killed 13 people, and subsequent violence in the seaside resort of Cambrils that killed one woman. Rajoy was speaking at a joint news conference in Barcelona with Catalan regional president Carles Puigdemont .------1:50 p.m. Catalan police say they have arrested a fourth person in connection with the attacks in Barcelona and the resort of Cambrils that have killed at least 14 people. Police made the announcement on Twitter without providing further details. Thursday's van attack in Barcelona killed at least 13 people, and one woman was killed early Friday in Cambrils when a car plowed into pedestrians there. Police fatally shot five suspects in Cambrils. It wasn't immediately clear if the Barcelona van driver is among the arrested or dead suspects .------1:40 p.m. Britain's Foreign Office says a \"small number\" of U.K. citizens were injured in the terror attacks in Spain. It says it is assisting Britons affected by the violence and is trying to find out if anyone else needs help. Officials say they have \"deployed additional staff to Barcelona and have offered support to the Spanish authorities .\" The statement came Friday after violence in the town of Cambrils, eight hours after an attack in Barcelona. Foreign Secretary Boris Johnson said Thursday he was \"concerned and saddened\" after a driver barreled down a main promenade in Barcelona, plowing his van into pedestrians. Fourteen people died and dozens were injured. Johnson tweeted: \"my thoughts are with the Spanish people & those affected by #Barcelona attack. Together we will defeat terrorism .\" ------1:35 p.m.. A British man has described his shock after watching police shoot those suspected of an attack in the Spanish resort town of Cambrils, hours after a similar attack 130 kilometers (80 miles) away in Barcelona. Fitzroy Davies was visiting Cambrils for a judo camp when attackers apparently struck pedestrians with a car. Davies tells Sky News says he saw one man get to his feet despite being shot multiple times. \"He then fell down and, within two seconds, he stood back up. He then stepped over the fence, charged the police again, the police fired some more shots and then he fell down again .\" He says \"I was watching a film, one of them horror films .\" ------1:30 p.m. Poland's interior minister says \"Europe should wake up\" after the Barcelona attack and realize it's dealing with a \"clash of civilizations\" that proves his government's point that accepting migrants is a tragedy for Europe. Mariusz Blaszczak says Friday his country is safe because \"we do not have Muslim communities which are enclaves, which are a natural support base for Islamic terrorists .\" The ruling Law and Justice party has taken a strong anti-migrant stance, refusing to accept any refugees in a European Union resettlement plan, creating tensions with Brussels. Blaszczak insisted late Thursday on state TVP that Warsaw will not succumb to EU pressure because it is putting Poland's security needs first. He said: \"The refugee resettlement system is a system that is encouraging millions of people to come to Europe .\" ------1:15 p.m.. When a few people raised Spanish and Catalan flags before the minute of silence for the Barcelona attack victims, the crowd quickly rebuked them for trying to politicize the solemn event. The crowd urged them to lower the flags, chanting \"Fuera la bandera,\" or \"Get rid of the flags .\" It was a rare moment when the question of whether the Catalonia region should become independent from Spain didn't divide people. Polls show the region is split ahead of a planned referendum, which Spain's central government considers would be illegal to hold, on Oct. 1. Anna Esquerdo, a lifelong Barcelona resident who works in a uniform apparel store, said \"we're here for the victims and to protest what happened. This is not about anyone's politics .\" ------12:40 p.m. Catalan authorities say a woman injured in an attack in a popular seaside town south of Barcelona has died. The woman, who wasn't named, is the first fatal victim of the attack late Thursday in Cambrils, about 130 kilometers (80 miles) south of Barcelona. It came hours after a van slammed into pedestrians on a busy Barcelona promenade, killing 13 people and injuring over 100 others. In Cambrils, police shot dead five people wearing fake bomb belts who plowed into a group of tourists and residents with a car. In all, six people, including a police officer, were injured in the Cambrils incident .------12:30 p.m. Israel's president has expressed his nation's sympathy to the people of Spain and said the world must join together to fight terrorism. Reuven Rivlin on Friday sent a letter of condolences to King Felipe VI after the bloodshed in Barcelona. Rivlin said \"terrorism is terrorism is terrorism, whether it takes place in Barcelona, Paris, Istanbul or Jerusalem .\" He said \"these horrific events once again prove that we must all stand united in the fight against those who seek to use violence to stifle individual liberty and freedom of thought and belief, and continue to destroy the lives of so many .\" Israel is coping with a wave of deadly Palestinian attacks against civilians and security forces that erupted in 2015. Palestinians say it stems from anger at decades of Israeli rule in territories they claim for a state .------12:15 p.m.. An Italian foreign ministry official says two Italians are among those confirmed dead in the Barcelona attack. Stefano Verrecchia, who heads the ministry's crisis unit, said Friday that authorities weren't immediately making the victims' names public. But one of the two appeared to be a young father from Legnano, a town in northern Italy. Legnano Mayor Giambattista Fratus told reporters, \"it is sure that our fellow citizen is deceased .\" Pino Bruno, head of the company where the victim from Legnano worked, was quoted by the Italian news agency ANSA as saying the man's wife told him she, the victim and their two children were strolling down Barcelona Ramblas street when the attack van suddenly appeared, and the victim kneeled down to successfully shield son, 6, and daughter, 7 months .------12 p.m. Thousands of people including Spain's king and prime minister have held a minute of silence for the victims of attacks in Barcelona and a nearby seaside resort. King Felipe VI and Prime Minister Mariano Rajoy, along with Catalan regional president Carles Puigdemont, stood in front of the crowd in Placa de Cataluyna during the remembrance. The participants then broke into applause before the crowd chanted repeatedly: \"I am not afraid! I am not afraid!\" The minute of silence was held near where the driver of a van started an attack that killed at least 13 people and injured more than 100 others on Thursday evening .------11:50 a.m. Germany's Foreign Ministry says that there were multiple German citizens among the injured in the attacks in Spain. German Foreign Ministry spokesman <mark>Martin Schaefer</mark> told reporters in Berlin on Friday that at the moment they know of 13 Germans injured, \"some of them seriously, so seriously that they are still fighting for their lives .\" He says he could not confirm unsourced media reports that Germans were also killed in the attacks. He says, however, \"we also can't rule that out .\" ------11:35 a.m. German Chancellor Angela Merkel is expressing her sympathy with Spain over the attacks in Barcelona, and says such violence cannot be allowed to change the European way of life. Speaking to reporters in Berlin, Merkel said Friday that \"these murderous attacks have once again showed us the total hatred of humanity with which Islamist terrorism acts .\" She added \"we will not allow these murderers to make us depart from our path, from our way of life .\" She said \"terrorism can cause us bitter and deeply sad hours, as has happened in Spain, but it won't defeat us .\" She said the Foreign Ministry is still working with Spanish authorities to say whether any Germans were among the victims. \"This can't be said with great precision right now,\" she added .------11:30 a.m. Spanish Prime Minister Mariano Rajoy has attended an emergency security meeting in Barcelona to coordinate the investigation into the terror attacks in the northeastern region of Catalonia. Rajoy traveled to Barcelona on Thursday night after a van plowed into a pedestrian promenade, killing 13 people and injuring more than 100 others. Police then stopped a second attack in nearby Cambrils when they shot and killed five attackers who had driven a car into another crowd. Rajoy met on Friday morning with Spain's interior minister and police and emergency officials. He said on Twitter that the meeting was to \"analyze the latest details of the attacks in Barcelona and Cambrils .\" ------11:20 a.m. Belgian officials are identifying a woman from the town of Tongeren killed in the van attack in Barcelona as Elke Vanbockrijck. Two officials, who declined to be identified on the record, confirmed Vanbockrijck's name to The Associated Press on Friday. Tongeren Mayor Patrick Dewael said in a tweet late Thursday that a woman from his town had died, and sent his condolences. He told Belgian radio that he had presided over her wedding in 2014. Belgian media said the 44-year-old woman was holidaying in Barcelona with her husband and sons. Foreign minister Didier Reynders also confirmed that two Belgians were injured in the attack, one of them seriously .--By Lorne Cook------11:10 a.m.. The Irish and Romanian governments have both confirmed that their nationals were among the 100 people injured when a truck was driven at tourists on Barcelona's Ramblas. Irish officials say a 5-year-old boy and his father are among those injured in the terror attack in Barcelona. Ireland's Foreign Affairs Minister, Simon Coveney, says a 5-year-old boy and his father received injuries that were not life-threatening. They were part a family of four celebrating the birthday of the youngster, who suffered a broken leg. Coveney says it's a miracle more Irish citizens weren't hurt as \"there are so many Irish people in Spain, Barcelona and Cambrils at this time of year .\" Romania's foreign ministry says three Romanians are among the injured. All three were hospitalized, and the ministry said that two are in a stable condition while the third suffered light injuries. Romania's consul there was in touch with the injured, who were not identified .------10:50 a.m.. The Lebanese militant group Hezbollah is condemning the van attack in Barcelona claimed by the Islamic State group that killed at least 13 people. In a statement issued in Beirut Friday, the group said the attack must be a renewed incentive to eliminate the group \"whose ideology is based on hate .\" Hezbollah, a Shiite Muslim group whose military wing is considered a terrorist group by the EU, is fighting against IS, a Sunni organization, in both Lebanon and neighboring Syria. The statement said that \"targeting innocent civilians and killing them is part of a satanic plot being carried out by those terrorists, which aims at tarnishing the concept of jihad (holy war) and sullying the image of Islam .\" ------10:35 a.m. Catalonia's regional president says that there's at least one \"terrorist still out there\" after the attacks in Barcelona and a seaside resort. Carles Puigdemont also told Onda Cero radio \"we don't have information regarding the capacity to do more harm .\" It wasn't immediately clear if the person on the run is the driver of the speeding van that killed at least 13 people and injured more than 100 others on Thursday evening in Barcelona's Las Ramblas district. In the early hours of Friday, police killed five suspects in the resort of Cambrils after a car plowed down and injured six people near a boardwalk. One of the injured was a police officer. Police said the suspects were wearing fake bomb belts. Police have three people in connection with the attacks .------10:20 a.m. German politicians have agreed to tone down election campaigning for the day in the aftermath of the attacks in Barcelona and a seaside resort. Chancellor Angela Merkel's main challenger in the September election says he spoke with her and both agreed to limit campaigning. The Social Democrat's <mark>Martin Schulz</mark> told reporters in Berlin on Friday that they made the decision \"as a sign of solidarity for those people affected in Spain\" by the attacks. He says: \"these are bitter days .\" <mark>Schulz</mark> added that there was a \"common will that there is no place for terror\" and that Europe would continue to be an \"open tolerant society .\" Speaking of the attackers and their backers, he says \"one has to send them the message that they will not win .\" ------10 a.m. Catalan authorities are confirming that the five suspects killed in a police shootout in the seaside resort of Cambrils had plowed down pedestrians and police in a car attack and were wearing fake bomb belts. The attack early Friday in Cambrils came hours after a white van mowed down tourists and locals in the popular Las Ramblas promenade in Barcelona, killing at least 13 people and injuring more than 100. Catalonia's interior minister, Joaquim Forn, tells Onda Cero radio that the suspects in Cambrils were driving in an Audi 3 and began plowing down people when they reached a populated area near the boardwalk. A police car was damaged and an officer was among the six people injured. Forn says the suspects killed in a subsequent shootout with police were wearing fake bomb belts. He says the belts were very well made, and that authorities only determined they were phony after a controlled explosion .------9:35 a.m.. A town mayor in Belgium says a woman from his town has died in the van attack in a major tourist area in the Spanish city of Barcelona. Patrick Dewael confirmed in a tweet late Thursday that the woman was from Tongeren, 90 kilometers (56 miles) east of Brussels, and sent his condolences. He told Belgian radio that he had presided over her wedding in 2014. Belgian Foreign Minister Didier Reynders also confirmed that two Belgians were wounded in the attack, one of them seriously .------9:20 a.m. Barcelona's famed Ramblas walkway has quietly reopened to the public, the morning after a van rampage that killed 13 and wounded more than 100. Police closed down the city center Thursday evening, after the van zigzagged down the packed Ramblas before the driver escaped. Friday morning, residents and tourists were allowed past police lines and slowly trickled back to their homes and hotels. The city center remained under heavy surveillance. A demonstration that will include a minute of silence honoring the victims was announced by public officials for Friday at noon at the Plaza Catalunya, next to the top of the Ramblas, where the deadly attack began .------9:05 a.m. Pakistani Prime Minister Shahid Khaqan Abbasi has condemned the van attack in Barcelona, and extended his condolences to the families of those killed. In a statement Friday, Abbasi said such terrorist attacks cannot scare the brave Spanish people. He said \"so long as the terrorists underestimate the spirit of the societies they seek to undermine, they will lose\". Abbasi's comment came a day after a van barreled down a busy walkway in central Barcelona, swerving back and forth as it mowed pedestrians down. Thirteen people were killed and 100 were injured, 15 of them seriously, in what authorities called a terror attack .------9 a.m. Danish authorities have confirmed that there are two Danes among those \"lightly wounded\" following the deadly van attack on tourists in the Spanish city of Barcelona. Leaders in the Nordic and Baltic region are rushing to condemn the attack. Sweden's Prime Minister Stefan Lofven said he was \"horrified by reports from Barcelona,\" while his Danish counterpart Lars Loekke Rasmussen said Europe has \"again been attacked by terror .\" In Norway, Prime Minister Erna Solberg called it \"a cowardly attack,\" her Estonian colleague Juri Ratas called it \"brutal\" and Lithuanian President Dalia Grybauskaite said it was \"despicable .------8:50 a.m. Catalonia authorities say a third person has been arrested in connection with the Barcelona van attack that killed at least 13 people. Catalonia Interior Minister Joaquim Forn told Catalunya Radio on Friday that the suspect was taken into custody in the northern Catalan town of Ripoll. On Thursday, one of the two suspects detained in the hours after the Las Ramblas attack was arrested in Ripoll and another in Alcanar. Police said neither of the two people detained Thursday was the driver of the white van that plowed down pedestrians. The driver escaped the scene on foot .------8 a.m. French officials say 26 French nationals were among the dozens injured in a van attack in Barcelona, and Australia says one of its citizens is unaccounted for. Spanish authorities previously said the dead and injured are from 24 countries. The attack involved a van that veered onto a busy promenade in downtown Barcelona and struck pedestrians. Thirteen people were killed and 100 injured. One of the dead was Belgian, and Australia's Foreign Minister Julie Bishop told reporters:\" We are concerned for one Australian who remains unaccounted for. \"France's Foreign Ministry said Friday at least 11 of the French nationals who were hurt had serious injuries. Australia also says three of its citizens were injured, one seriously. Two with slight injuries were Taiwanese. A Greek woman and a Hong Kong resident were also hurt .------The item timed at 8 a.m. has been corrected to show that 26 French nationals were injured, not 25. The item timed at 10:20 a.m. has been corrected to show that the politicians agreed to tone down campaigning, not cancel.", "articleID": "2017081820_01071870_W", "names": {"John Lennon": ["Q11979004", "Q6244563"]}}]