[{"date": "2017-08-18", "url": "http://idahopress.com/news/world/the-latest-american-man-is-among-the-barcelona-dead/article_903fce07-6a92-5197-88df-9735fea19e89.html", "content": "BARCELONA, Spain (AP)--The Latest on the Spain attacks (all times local): 10:30 p.m.. A father says his son, a California resident, is among the 13 people killed in a van attack in Barcelona, Spain. × Advertisement Daniel Tucker tells The Daily News of New York that his son Jared Tucker's body was identified by his wife at the morgue Friday. Tucker says of the attack, which was claimed by Islamic State militants, \"it's just something we really just don't understand .\" Jared Tucker and his wife, Heidi Nunes, were visiting Barcelona for their first wedding anniversary. Tucker and his father worked together installing swimming pools. The elder Tucker tells the newspaper that \"everybody loved him .\" Secretary of State Rex Tillerson on Friday confirmed that an American died in the Barcelona van attack .------10:20 p.m. Barcelona says it will make its Spanish league debut with players wearing a shirt carrying the word \"Barcelona\" instead of their names to pay tribute the victims of the vehicle attacks in the city and the nearby seaside resort of Cambrils. The hashtag \"TotsSomBarcelona\" (We are all Barcelona) will be displayed on the front of the players' shirts when the team hosts Real Betis on Sunday at Camp Nou. The club said it received special authorization from the Spanish soccer federation to make the changes. Barcelona said club members playing in various age divisions over the weekend will also wear a black armband in honor of the victims. There will be a minute of silence before every Spanish league game this weekend. Barcelona said the moment will \"commemorate all the victims and offer support to their friends and relatives, and all the citizens and visitors to the city .\" ------10 p.m.. A police union official says a document identifying four suspects in the attacks in Spain's Catalonia region identify them as being of Moroccan origin and all from the small city of Ripoll near the Pyrenees mountains and Spain's border with France. The document--whose validity was confirmed by a Spanish police union official--identified the four as Moussa Oukabir, Said Aallaa, Mohamed Hychami and Younes Abouyaaqoub. It says Oukabir was born in Ripoll and also holds Moroccan citizenship. The document also says the other three were born in Morocco and have Spanish residency. The official said Friday the document was sent to police across the country after Spain's National Court issued arrest warrants for the suspects. The official spoke anonymously because the official was not authorized to disclose the information .--By Alan Clendenning------9:20 p.m.. The leading newspaper in Spain's northeastern Catalonia region says beach towns are installing concrete barriers on popular pedestrian walkways to try to prevent the kind of attack that saw a van plow through tourists walking on a famed Barcelona promenade. La Vanguardia reported Friday that barriers were installed in the popular Mediterranean tourist destinations of Calafell, Calella and Reus. Strolls down Spanish streets and pedestrian-only areas filled with bars and restaurants are one of the country's biggest tourism draws. Those areas are typically packed with people during the summer, often until midnight or later. La Vanguardia's report had images of the barriers and of workers putting in place huge concrete flower pots in downtown Madrid as a precaution against van attacks. Thursday's van attack in Barcelona killed 13 people and injured 120, while a car attack early Friday in the seaside resort of Cambrils left one dead and five injured .------8:55 p.m.. A police union official says he has been told that Moussa Oukabir, one of the main suspects in the Barcelona and Cambrils van attacks, was killed by officers in Cambrils early Friday. Spanish media are also reporting that Oukabir, 17, was killed and say he is the driver of the van that plowed into scores of pedestrians in Barcelona on Thursday, killing 13 people and wounding 120 others. A spokesman for Catalonia regional police said authorities were investigating whether the driver had been killed but would not say if they suspected this was Oukabir. The official with a union for Spain's Civil Guard police force told The Associated Press that police colleagues confirmed Oukabir was one of five suspects killed by Catalan regional police officers early Friday in an attack on a seaside resort. The union official says Oukabir was one of four suspects for whom a court has issued warrants. He is also believed to be the younger brother of Driss Oukabir, one of the four people arrested since the attacks. He spoke on condition of anonymity because he was not authorized to disclose the information .---- Ciaran Giles, Alan Clendenning .------8:20 p.m.. A French security official says Spanish police are looking for a Kangoo utility vehicle rented by suspects in the Barcelona attacks that may have crossed into France. The official said Spanish police alerted French authorities to the vehicle, rented Thursday in Spain. The official said French police nationwide are on the lookout for the car, and were given information from Spain about four suspects believed to be on the run. The official was not authorized to be publicly named speaking of an ongoing manhunt. After two deadly vehicle attacks in Barcelona and a nearby resort, France's interior minister said his country reinforced police surveillance Friday of what is normally an open border between Spain and France. French officials said Friday evening that no one has been detained so far in the Spanish investigation. The attacks Thursday and early Friday in Spain killed 14 people and wounded 126 others .------7:40 p.m. Riot police have dispersed a small group of far-right protesters after separating them from hundreds of counter-protesters near the site of a memorial to the Barcelona van attack victims. The far-right protesters, numbering 20-30, held up signs saying \"Stop Islamization of Europe .\" Counter-protesters were chanting \"tontos,\" or \"idiots\" at them, with some of them holding up their middle fingers at the far-right protesters. Riot police wearing helmets with face shields kept them apart for a while before gently removing the far-right protesters. After they walked away, the counter-protesters applauded and also left peacefully. The protest came a day after a van rammed into pedestrians in Barcelona's Las Ramblas district, killing 13 and injuring 120 .------7:30 p.m.. An official with a union for Spain's Civil Guard police force says a court has issued an order for the arrest of four suspects in connection with the attacks in Barcelona and a nearby seaside resort. The official also confirmed the validity of a document naming the four suspects, with photos, and says it was sent to police across the country with the arrest order. A French official also confirmed the document was circulating among law enforcement officials. Both spoke on condition of anonymity because they weren't authorized to disclose the information. The document says one suspect was born in Spain and has Moroccan citizenship and the other three were Moroccans with Spanish residency. The list included Moussa Oukabir, who is believed to be a brother of one of those arrested for the attacks and possibly the Barcelona van driver. The document was first reported by Spanish media who said it was provided by unnamed police sources .--by Al Clendenning in Phoenix, Ciaran Giles in Madrid and Lori Hinnant in Barcelona .------6:55 p.m.. A regional police official in Spain says that authorities are investigating whether the Barcelona van attack driver is among the suspects killed by officers after the attack in the nearby resort of Cambrils. The official, however, said that officers couldn't yet confirm that the Barcelona van attacker was among the five suspects killed in Cambrils after ramming into people with another car. One woman was killed in the attack and six others were injured. The official spoke on customary condition of anonymity. The van attack in Barcelona killed 13 people and injured 120 others .--By Ciaran Giles in Madrid .------6:25 p.m. Spanish police have searched the family apartment of a teenager reportedly suspected of driving the van in the deadly promenade attack in Barcelona. Neighbors of the Oukabir family in the northern town of Ripoll say no one was home when the police arrived Friday morning. The door of the Oukabir's first-floor apartment was busted open. Spanish media have identified the van's suspected driver as 17-year-old Moussa Oukabir. His brother, Driss Oukabir, a French citizen of Moroccan origin, reportedly went to police in Ripoll to report that his documents were stolen. The mayor of Ripoll, Jordi Molle, says the documents were found in a vehicle used in the Barcelona attack. Ripoll, a 90-minute drive north of Barcelona, is a quiet, upscale town of 10,000 tucked into hilly Catalan heartland .---- 6 p.m. Rome will turn off the lights on the Colosseum to mourn those killed in the Barcelona attack. Italian Culture Minister Dario Franceschini says the lights on the ancient arena will go dark for a half hour Friday night. The ministry says the gesture is a \"sign of solidarity with the city of Barcelona and of mourning for the victims of the terror attack .\" On the broad boulevard outside the Colosseum are somber reminders of some of Italy's anti-attack security strategy. Near each end of the road, which is closed to most vehicular traffic, heavy vehicles guarded by soldiers or other security forces are positioned in such a way that city buses must slow to slalom around the obstacles .------5:45 p.m. Emergency authorities in Spain have provided an update on the numbers of casualties in the attacks in Barcelona and the seaside town of Cambrils. The Civil Protection agency says that 120 people were injured in the Barcelona attack, and six in Cambrils. It says that 61 people remain hospitalized, including 17 in critical condition and 25 in serious condition, after the Barcelona van attack. In the Cambrils attack, four people remain hospitalized, including three in serious condition. The death toll remains the same: 13 killed in Barcelona and one woman in Cambrils .------5 p.m.. The U.N. Security Council is strongly condemning the terrorist attack in Barcelona and paying tribute to the innocent victims. Egypt's U.N. Ambassador Amr Abdellatif Aboulatta, the council president, began Friday's meeting on Yemen denouncing Thursday's deadly attack in Spain. He said: \"On behalf of the members of the Security Council, I should like to condemn in the strongest terms the unconscionable terrorist attack in Barcelona, Spain, which targeted innocent civilians .\" Aboulatta said the Security Council sends its \"deepest condolences\" to the families. Many ambassadors and diplomats stood with their heads bowed in tribute .------4:40 p.m. Barcelona and Real Madrid have held a minute of silence for the victims of the attacks in Spain before their training sessions. Real Madrid players huddled Friday before beginning their activities at the team's training center in Madrid, while Barcelona's squad lined up in silence before its practice session at the team's headquarters. Barcelona team President Josep Bartomeu joined thousands at a minute of silence near where the driver of a van started an attack Thursday that killed at least 13 people and injured more than 100 others in Barcelona. There will be a minute of silence held before every Spanish league game this weekend, beginning with Friday's opening matches: Leganes vs. Alaves and Valencia vs. Las Palmas. Other soccer leagues across Europe have also planned acts to honor the victims of the attacks. The French league will hold a minute of silence before games .------4:30 p.m. Two memorials to the victims have grown on Barcelona's historic Las Ramblas promenade--one at the top near where the van jumped the curb, the other on the Joan Miro mosaic embedded in the pavement where it stopped. An ever-expanding jumble of flags, candles, teddy bears and flowers were placed at the base of the ornate Canaletes Fountain. \"We are not afraid! We are not afraid!\" onlookers chanted in Spanish. Jesus Borrull, a lifelong resident, gently pushed through the crowd to kneel and pray in front of the fountain. Legend has it that visitors who drink from the fountain will fall in love with Barcelona and return to the city. Borrull says \"the only thing we can do is go forward with peace and goodness...even though it's difficult, we have to do it .\" At the other memorial, bystanders held signs declaring they are not afraid. A guitar player strummed out \"Imagine\" by <mark>John Lennon</mark> while several people sang along .------4:20 p.m.. The State Department says at least one American was killed and one was injured in the terrorist attacks in Barcelona and Cambrils, Spain. The department said Friday that diplomats from the U.S. consulate in Barcelona are continuing to work with local authorities to identify victims and provide assistance to Americans. The department did not identify either of the Americans, but said the injured person suffered only a minor wound .------4:15 p.m. Spanish authorities are still investigating whether a car that rammed a police checkpoint in the confused hours after the Barcelona van attack on Thursday was linked to the bloodshed in the city. Catalan police chief Josep Lluis Trapero said the driver of a Ford Focus rammed the control post and wounded a sergeant. Another officer shot at the car, which stopped, he said. Police found a dead body inside and first thought they had shot and killed the person, but forensic reports showed it was a knife wound. Trapero said a second person may have been in the car. He said it was unclear how or whether it was linked to the other attacks in Spain on Thursday and Friday .------4 p.m. Italy's premier has released the names of two Italians slain in the Barcelona van attack. Premier Gentiloni tweeted Friday that \"Italy remembers Bruno Gulotta and Luca Russo and gathers tight around their families. Freedom will conquer the barbarianism of terrorism .\" Gulotta, 35, was hailed in his hometown of Legnano as a hero for putting himself between the van and his 6-year-old son and 7-month-old daughter as he strolled with his wife Thursday in the Spanish city. Italian media reported that Russo, 25, held a university degree in engineering and lived in northern Italy. An Italian officials said Russo's girlfriend suffered fractures and remains hospitalized. Verrecchia said two other Italians were injured but have since been released from the hospital .------3:50 p.m. Britain's Queen Elizabeth II has offered her sympathies to the King of Spain and to the nation following attacks in in Barcelona and the seaside community of Cambrils. The British monarch says it is \"deeply upsetting when innocent people are put at risk in this way when going about their daily lives .\" The queen said Friday that she and Prince Philip offer sincere condolences and that their thoughts and prayers are with those who have lost loved ones or are in the hospital. Fourteen people died and over 100 were injured in attacks Thursday and early Friday .------3:45 p.m. Police in Spain say that attacks in Barcelona, Cambrils had been prepared some time ago. Senior police official Josep Lluis Trapero said Friday police believe the two attacks were connected with an explosion in a house in the town of Alcanar on Wednesday in which one person was killed. Police believe one of the person injured in that blast and now arrested had links to the two attacks. Trapero said Cambrils terrorists carried an ax and knives in the car and body belts with false explosives. Four people have been arrested in all. Thirteen people were killed in the attack in Barcelona on Thursday and one in the resort town Cambrils early Friday .------3:30 p.m. Turkey's president has condemned the van attack in Barcelona, Spain, in which 13 people were killed. Speaking to reporters in Istanbul on Friday, Recep Tayyip Erdogan said he \"strongly condemned\" the attack. State-run Anadolu news agency reports that Erdogan sent a note offering condolences to King Felipe VI earlier in the day. Turkish media reports that 33-year-old Turkish businessman Emre Eroglu was injured in the attack. Foreign Minister Mevlut Cavusoglu has instructed Turkish consular officials to accompany him at the hospital and says he is in good condition and has received surgery on a broken foot .------3:25 p.m. Pope Francis says the extremist attack in Barcelona gravely offends God. Francis sent a condolence telegram Friday to Barcelona's cardinal, expressing \"sorrow and pain\" over \"such an inhumane action .\" In his message, the pope \"once again condemns blind violence, which is a very grave offense to the Creator .\" He offered his blessing for all the victims, their families and \"all the beloved Spanish people .\" Francis also expressed \"sadness and pain\" over the news of the \"cruel terrorist attack that has sown death and sorrow on the Rambla of Barcelona .\" ------3:20 p.m. British Prime Minister Theresa May says the government is doing all it can to help amid reports of a child missing after the terror attack in Barcelona. May told Sky News Britain is \"urgently looking into reports of a child believed missing, who is a British dual national .\" She did not name him. A post on social media from the 7-year-old boy's grandfather says Julian Alessandro Cadman became separated from his mother when a driver slammed into a crowd of pedestrians in a major promenade area. Tony Cadman posted a photograph of Julian on Facebook. He says the family found his daughter-in-law in a serious but stable condition in a hospital .------3:10 p.m.. A police official says that authorities haven't idenitifed the driver of the van that killed at least 13 people in Barcelona. Catalan regional police official Josep Lluis Trapero says that the attacks suspects in custody are three Moroccans and a Spaniard. He says that none of them had a record of terror activity although one was known to police for petty crimes. Hours after the Barcelona attack, a car struck pedestrians in the seaside town of Cambrils, killing a woman and injuring others. Police fatally shot five of the Cambrils attackers. Trapero says that the Cambrils and Barcelona attacks are linked as is an abandoned van and a house south of Barcelona destroyed in an explosion in which a man was killed on Wednesday night .------2:55 p.m.. A senior police official in Spain says that a single police officer killed four of the suspects who carried out the attack in the Catalan seaside town of Cambrils. Catalan regional police official Josep Lluis Trapero says that it was \"not easy\" for the officer involved despite being a professional. A total of five suspects were killed after the Cambrils attack in which a car plowed into a crowd, killing a woman. Hours earlier, a van struck a crowd of pedestrians, killing at least 13 people in Barcelona and injured more than 100 people .------2:35 p.m. Spanish Prime Minister Mariano Rajoy says the fight against terrorism is a \"global battle\" and Europe's main problem after two attacks in Catalonia that killed 14 people. Rajoy also thanked the emergency services for their work and messages of support from around the world after the van attack in Barcelona killed 13 people, and subsequent violence in the seaside resort of Cambrils that killed one woman. Rajoy was speaking at a joint news conference in Barcelona with Catalan regional president Carles Puigdemont .------1:50 p.m. Catalan police say they have arrested a fourth person in connection with the attacks in Barcelona and the resort of Cambrils that have killed at least 14 people. Police made the announcement on Twitter without providing further details. Thursday's van attack in Barcelona killed at least 13 people, and one woman was killed early Friday in Cambrils when a car plowed into pedestrians there. Police fatally shot five suspects in Cambrils. It wasn't immediately clear if the Barcelona van driver is among the arrested or dead suspects .------1:40 p.m. Britain's Foreign Office says a \"small number\" of U.K. citizens were injured in the terror attacks in Spain. It says it is assisting Britons affected by the violence and is trying to find out if anyone else needs help. Officials say they have \"deployed additional staff to Barcelona and have offered support to the Spanish authorities .\" The statement came Friday after violence in the town of Cambrils, eight hours after an attack in Barcelona. Foreign Secretary Boris Johnson said Thursday he was \"concerned and saddened\" after a driver barreled down a main promenade in Barcelona, plowing his van into pedestrians. Fourteen people died and dozens were injured. Johnson tweeted: \"my thoughts are with the Spanish people & those affected by #Barcelona attack. Together we will defeat terrorism .\" ------1:35 p.m.. A British man has described his shock after watching police shoot those suspected of an attack in the Spanish resort town of Cambrils, hours after a similar attack 130 kilometers (80 miles) away in Barcelona. Fitzroy Davies was visiting Cambrils for a judo camp when attackers apparently struck pedestrians with a car. Davies tells Sky News says he saw one man get to his feet despite being shot multiple times. \"He then fell down and, within two seconds, he stood back up. He then stepped over the fence, charged the police again, the police fired some more shots and then he fell down again .\" He says \"I was watching a film, one of them horror films .\" ------1:30 p.m. Poland's interior minister says \"Europe should wake up\" after the Barcelona attack and realize it's dealing with a \"clash of civilizations\" that proves his government's point that accepting migrants is a tragedy for Europe. Mariusz Blaszczak says Friday his country is safe because \"we do not have Muslim communities which are enclaves, which are a natural support base for Islamic terrorists .\" The ruling Law and Justice party has taken a strong anti-migrant stance, refusing to accept any refugees in a European Union resettlement plan, creating tensions with Brussels. Blaszczak insisted late Thursday on state TVP that Warsaw will not succumb to EU pressure because it is putting Poland's security needs first. He said: \"The refugee resettlement system is a system that is encouraging millions of people to come to Europe .\" ------1:15 p.m.. When a few people raised Spanish and Catalan flags before the minute of silence for the Barcelona attack victims, the crowd quickly rebuked them for trying to politicize the solemn event. The crowd urged them to lower the flags, chanting \"Fuera la bandera,\" or \"Get rid of the flags .\" It was a rare moment when the question of whether the Catalonia region should become independent from Spain didn't divide people. Polls show the region is split ahead of a planned referendum, which Spain's central government considers would be illegal to hold, on Oct. 1. Anna Esquerdo, a lifelong Barcelona resident who works in a uniform apparel store, said \"we're here for the victims and to protest what happened. This is not about anyone's politics .\" ------12:40 p.m. Catalan authorities say a woman injured in an attack in a popular seaside town south of Barcelona has died. The woman, who wasn't named, is the first fatal victim of the attack late Thursday in Cambrils, about 130 kilometers (80 miles) south of Barcelona. It came hours after a van slammed into pedestrians on a busy Barcelona promenade, killing 13 people and injuring over 100 others. In Cambrils, police shot dead five people wearing fake bomb belts who plowed into a group of tourists and residents with a car. In all, six people, including a police officer, were injured in the Cambrils incident .------12:30 p.m. Israel's president has expressed his nation's sympathy to the people of Spain and said the world must join together to fight terrorism. Reuven Rivlin on Friday sent a letter of condolences to King Felipe VI after the bloodshed in Barcelona. Rivlin said \"terrorism is terrorism is terrorism, whether it takes place in Barcelona, Paris, Istanbul or Jerusalem .\" He said \"these horrific events once again prove that we must all stand united in the fight against those who seek to use violence to stifle individual liberty and freedom of thought and belief, and continue to destroy the lives of so many .\" Israel is coping with a wave of deadly Palestinian attacks against civilians and security forces that erupted in 2015. Palestinians say it stems from anger at decades of Israeli rule in territories they claim for a state .------12:15 p.m.. An Italian foreign ministry official says two Italians are among those confirmed dead in the Barcelona attack. Stefano Verrecchia, who heads the ministry's crisis unit, said Friday that authorities weren't immediately making the victims' names public. But one of the two appeared to be a young father from Legnano, a town in northern Italy. Legnano Mayor Giambattista Fratus told reporters, \"it is sure that our fellow citizen is deceased .\" Pino Bruno, head of the company where the victim from Legnano worked, was quoted by the Italian news agency ANSA as saying the man's wife told him she, the victim and their two children were strolling down Barcelona Ramblas street when the attack van suddenly appeared, and the victim kneeled down to successfully shield son, 6, and daughter, 7 months .------12 p.m. Thousands of people including Spain's king and prime minister have held a minute of silence for the victims of attacks in Barcelona and a nearby seaside resort. King Felipe VI and Prime Minister Mariano Rajoy, along with Catalan regional president Carles Puigdemont, stood in front of the crowd in Placa de Cataluyna during the remembrance. The participants then broke into applause before the crowd chanted repeatedly: \"I am not afraid! I am not afraid!\" The minute of silence was held near where the driver of a van started an attack that killed at least 13 people and injured more than 100 others on Thursday evening .------11:50 a.m. Germany's Foreign Ministry says that there were multiple German citizens among the injured in the attacks in Spain. German Foreign Ministry spokesman <mark>Martin Schaefer</mark> told reporters in Berlin on Friday that at the moment they know of 13 Germans injured, \"some of them seriously, so seriously that they are still fighting for their lives .\" He says he could not confirm unsourced media reports that Germans were also killed in the attacks. He says, however, \"we also can't rule that out .\" ------11:35 a.m. German Chancellor Angela Merkel is expressing her sympathy with Spain over the attacks in Barcelona, and says such violence cannot be allowed to change the European way of life. Speaking to reporters in Berlin, Merkel said Friday that \"these murderous attacks have once again showed us the total hatred of humanity with which Islamist terrorism acts .\" She added \"we will not allow these murderers to make us depart from our path, from our way of life .\" She said \"terrorism can cause us bitter and deeply sad hours, as has happened in Spain, but it won't defeat us .\" She said the Foreign Ministry is still working with Spanish authorities to say whether any Germans were among the victims. \"This can't be said with great precision right now,\" she added .------11:30 a.m. Spanish Prime Minister Mariano Rajoy has attended an emergency security meeting in Barcelona to coordinate the investigation into the terror attacks in the northeastern region of Catalonia. Rajoy traveled to Barcelona on Thursday night after a van plowed into a pedestrian promenade, killing 13 people and injuring more than 100 others. Police then stopped a second attack in nearby Cambrils when they shot and killed five attackers who had driven a car into another crowd. Rajoy met on Friday morning with Spain's interior minister and police and emergency officials. He said on Twitter that the meeting was to \"analyze the latest details of the attacks in Barcelona and Cambrils .\" ------11:20 a.m. Belgian officials are identifying a woman from the town of Tongeren killed in the van attack in Barcelona as Elke Vanbockrijck. Two officials, who declined to be identified on the record, confirmed Vanbockrijck's name to The Associated Press on Friday. Tongeren Mayor Patrick Dewael said in a tweet late Thursday that a woman from his town had died, and sent his condolences. He told Belgian radio that he had presided over her wedding in 2014. Belgian media said the 44-year-old woman was holidaying in Barcelona with her husband and sons. Foreign minister Didier Reynders also confirmed that two Belgians were injured in the attack, one of them seriously .--By Lorne Cook------11:10 a.m.. The Irish and Romanian governments have both confirmed that their nationals were among the 100 people injured when a truck was driven at tourists on Barcelona's Ramblas. Irish officials say a 5-year-old boy and his father are among those injured in the terror attack in Barcelona. Ireland's Foreign Affairs Minister, Simon Coveney, says a 5-year-old boy and his father received injuries that were not life-threatening. They were part a family of four celebrating the birthday of the youngster, who suffered a broken leg. Coveney says it's a miracle more Irish citizens weren't hurt as \"there are so many Irish people in Spain, Barcelona and Cambrils at this time of year .\" Romania's foreign ministry says three Romanians are among the injured. All three were hospitalized, and the ministry said that two are in a stable condition while the third suffered light injuries. Romania's consul there was in touch with the injured, who were not identified .------10:50 a.m.. The Lebanese militant group Hezbollah is condemning the van attack in Barcelona claimed by the Islamic State group that killed at least 13 people. In a statement issued in Beirut Friday, the group said the attack must be a renewed incentive to eliminate the group \"whose ideology is based on hate .\" Hezbollah, a Shiite Muslim group whose military wing is considered a terrorist group by the EU, is fighting against IS, a Sunni organization, in both Lebanon and neighboring Syria. The statement said that \"targeting innocent civilians and killing them is part of a satanic plot being carried out by those terrorists, which aims at tarnishing the concept of jihad (holy war) and sullying the image of Islam .\" ------10:35 a.m. Catalonia's regional president says that there's at least one \"terrorist still out there\" after the attacks in Barcelona and a seaside resort. Carles Puigdemont also told Onda Cero radio \"we don't have information regarding the capacity to do more harm .\" It wasn't immediately clear if the person on the run is the driver of the speeding van that killed at least 13 people and injured more than 100 others on Thursday evening in Barcelona's Las Ramblas district. In the early hours of Friday, police killed five suspects in the resort of Cambrils after a car plowed down and injured six people near a boardwalk. One of the injured was a police officer. Police said the suspects were wearing fake bomb belts. Police have three people in connection with the attacks .------10:20 a.m. German politicians have agreed to tone down election campaigning for the day in the aftermath of the attacks in Barcelona and a seaside resort. Chancellor Angela Merkel's main challenger in the September election says he spoke with her and both agreed to limit campaigning. The Social Democrat's <mark>Martin Schulz</mark> told reporters in Berlin on Friday that they made the decision \"as a sign of solidarity for those people affected in Spain\" by the attacks. He says: \"these are bitter days .\" <mark>Schulz</mark> added that there was a \"common will that there is no place for terror\" and that Europe would continue to be an \"open tolerant society .\" Speaking of the attackers and their backers, he says \"one has to send them the message that they will not win .\" ------10 a.m. Catalan authorities are confirming that the five suspects killed in a police shootout in the seaside resort of Cambrils had plowed down pedestrians and police in a car attack and were wearing fake bomb belts. The attack early Friday in Cambrils came hours after a white van mowed down tourists and locals in the popular Las Ramblas promenade in Barcelona, killing at least 13 people and injuring more than 100. Catalonia's interior minister, Joaquim Forn, tells Onda Cero radio that the suspects in Cambrils were driving in an Audi 3 and began plowing down people when they reached a populated area near the boardwalk. A police car was damaged and an officer was among the six people injured. Forn says the suspects killed in a subsequent shootout with police were wearing fake bomb belts. He says the belts were very well made, and that authorities only determined they were phony after a controlled explosion .------9:35 a.m.. A town mayor in Belgium says a woman from his town has died in the van attack in a major tourist area in the Spanish city of Barcelona. Patrick Dewael confirmed in a tweet late Thursday that the woman was from Tongeren, 90 kilometers (56 miles) east of Brussels, and sent his condolences. He told Belgian radio that he had presided over her wedding in 2014. Belgian Foreign Minister Didier Reynders also confirmed that two Belgians were wounded in the attack, one of them seriously .------9:20 a.m. Barcelona's famed Ramblas walkway has quietly reopened to the public, the morning after a van rampage that killed 13 and wounded more than 100. Police closed down the city center Thursday evening, after the van zigzagged down the packed Ramblas before the driver escaped. Friday morning, residents and tourists were allowed past police lines and slowly trickled back to their homes and hotels. The city center remained under heavy surveillance. A demonstration that will include a minute of silence honoring the victims was announced by public officials for Friday at noon at the Plaza Catalunya, next to the top of the Ramblas, where the deadly attack began .------9:05 a.m. Pakistani Prime Minister Shahid Khaqan Abbasi has condemned the van attack in Barcelona, and extended his condolences to the families of those killed. In a statement Friday, Abbasi said such terrorist attacks cannot scare the brave Spanish people. He said \"so long as the terrorists underestimate the spirit of the societies they seek to undermine, they will lose\". Abbasi's comment came a day after a van barreled down a busy walkway in central Barcelona, swerving back and forth as it mowed pedestrians down. Thirteen people were killed and 100 were injured, 15 of them seriously, in what authorities called a terror attack .------9 a.m. Danish authorities have confirmed that there are two Danes among those \"lightly wounded\" following the deadly van attack on tourists in the Spanish city of Barcelona. Leaders in the Nordic and Baltic region are rushing to condemn the attack. Sweden's Prime Minister Stefan Lofven said he was \"horrified by reports from Barcelona,\" while his Danish counterpart Lars Loekke Rasmussen said Europe has \"again been attacked by terror .\" In Norway, Prime Minister Erna Solberg called it \"a cowardly attack,\" her Estonian colleague Juri Ratas called it \"brutal\" and Lithuanian President Dalia Grybauskaite said it was \"despicable .------8:50 a.m. Catalonia authorities say a third person has been arrested in connection with the Barcelona van attack that killed at least 13 people. Catalonia Interior Minister Joaquim Forn told Catalunya Radio on Friday that the suspect was taken into custody in the northern Catalan town of Ripoll. On Thursday, one of the two suspects detained in the hours after the Las Ramblas attack was arrested in Ripoll and another in Alcanar. Police said neither of the two people detained Thursday was the driver of the white van that plowed down pedestrians. The driver escaped the scene on foot .------8 a.m. French officials say 26 French nationals were among the dozens injured in a van attack in Barcelona, and Australia says one of its citizens is unaccounted for. Spanish authorities previously said the dead and injured are from 24 countries. The attack involved a van that veered onto a busy promenade in downtown Barcelona and struck pedestrians. Thirteen people were killed and 100 injured. One of the dead was Belgian, and Australia's Foreign Minister Julie Bishop told reporters:\" We are concerned for one Australian who remains unaccounted for. \"France's Foreign Ministry said Friday at least 11 of the French nationals who were hurt had serious injuries. Australia also says three of its citizens were injured, one seriously. Two with slight injuries were Taiwanese. A Greek woman and a Hong Kong resident were also hurt .------The item timed at 8 a.m. has been corrected to show that 26 French nationals were injured, not 25. The item timed at 10:20 a.m. has been corrected to show that the politicians agreed to tone down campaigning, not cancel.", "articleID": "2017081820_01071870_W", "names": {"Martin Schaefer": ["Q26899623", "Q54153168", "Q58270401"], "Martin Schulz": ["Q17905", "Q1904987", "Q26884486", "Q42372365"]}}, {"date": "2017-08-19", "url": "https://startsat60.com/entertainment/tv-movies/british-tv-entertainer-sir-bruce-forsyth-dies-age-89", "content": "News Britain heartbroken by death of TV legend Bruce Forsyth at 89 By Starts at 60 Writers Sir Bruce Forsyth pictured at the launch of the 2012 series of Strictly Come Dancing. Sir Bruce Forsyth, one of Britain's best-loved television stars, has died aged 89. The showbiz legend's manager said that Forsytth had died at home, with is wife Wilnelia and his six children by his side, The Sun reported. Forsyth, known fondly by fans as Brucie, had been sick for some time, having been admitted to hospital earlier this year with a chest infection. <mark>Tony Hall</mark>, the director general of the BBC, released a statement calling Forsyth \"one of the greatest entertainers our country has ever known\" , while Prime Minister Theresa May tweeted that the UK had \"lost a national treasure .\" We have lost a national treasure. Like millions of others, for years I watched Sir Bruce dance, sing, joke & laugh. He will be sorely missed--<mark>Theresa May</mark> (@ theresa_may) August 18, 2017 Ad. Article continues below. Forsyth had a record-breaking 78-year career on British screens, having made his first TV appearance at the age of 11, having taken up tap dancing after being inspired by a Fred Astaire film. An early photo of Sir #BruceForsyth, as a young entertainer. pic.twitter.com/wH9kMVQbmF--ClassicPics (@ History_Pics) August 18, 2017 He was performing in his own song-and-dance act by 14 but didn't hit the big time until he was 30, when he started hosting a weekly variety show called Saturday Night at the London Palladium, that became a huge hit. He went on to become the long-running host of popular game shows including The Price is Right and The Generation Game, which made him the UK's best-paid TV star of the time. Ad. Article continues below. More recently, he won a new generation of fans as the witty co-host of the BBC's hit dance competition series Strictly Come Dancing from 2004 until he retired in 2014. His Strictly co-host Tess Daly described him as a \"gentleman and true legend\". \"I will never forget his generosity, his brilliant sense of humour and his drive to entertain the audiences he so loved,\" she said. The star received a knighthood in 2011 and his last appearance on TV was at Christmas 2015, when he sent a festive message to Strictly fans on the Christmas edition o f the show. Legendary entertainer Sir Bruce Forsyth has died aged 89. Didn't he do well? pic.twitter.com/afaSOfH4la--BBC Archive (@ BBCArchive) August 18, 2017 Ad. Article continues below. Forsyth had been married to Wilnelia, a former Miss World, for 36 years. The 59-year-old spoke last November to the Daily Mail about her husband's health issues. \"He's the man I fell in love with because his brain is there,\" she said. \"He has a bit of a problem moving, but we still laugh and talk. I pray, I believe. The main thing is that he's doing well. The pain is more emotional. Sometimes we cry, but mostly we laugh .\" Tributes to Forsyth flooded social media as news of his death broke, with the London Palladium promising to dim its lights, stars sharing their memories of working with the entertainer and fans recalling experiences they had had with him. Do you remember Bruce Forsyth's shows? Which one did you watch? Ad. More articles below.", "articleID": "2017081823_00683193_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "Tony Hall": ["Q21597856", "Q33675022", "Q7822516", "Q7822518", "Q7822519", "Q80390"]}}, {"date": "2017-08-20", "url": "http://scmp.com/sport/soccer/article/2107506/arsenal-dont-get-fair-share-penalties-claims-arsene-wenger-after-stoke", "content": "South China Morning Post Print Email Now Reading \"Arsenal don't get fair share of penalties,' claims Arsene Wenger after Stoke condemn Gunners to first defeat of the season Arsenal don't get fair share of penalties, claims Arsene Wenger after Stoke condemn Gunners to first defeat of the season Gunners boss reacts furiously to two failed penalty appeals PUBLISHED: Sunday, 20 August, 2017, 1:00 pm UPDATED: Sunday, 20 August, 2017, 1:00 pm Everton shrug off crowd trouble in European win over Hajduk Split 18 Aug 2017 Arsene Wenger believes his side does not receive its fair share of penalty decisions, a view he claimed was demonstrated in their 1-0 Premier League defeat at Stoke City. The Arsenal manager was left beaten by an early second half goal from Stoke's new Spanish forward Jese, signed on loan this week from PSG and whose training had been curtailed by his new-born son requiring a medical procedure. But, while accepting that his side had not performed well, the veteran French manager was also left fuming by two failed penalty appeals--for a handball by Kurt Zouma and foul by Mame Diouf .\" We don't get penalties, we know that, \"said Wenger .\" I can get the numbers you will see. Look at the statistics. We had the highest penalties against us at home by a mile and the lowest number for us. \"To add to the manager's bad mood, he also saw a second half\" equaliser \"by record signing Alexandre Lacazette ruled out for offside--a decision by referee Andre Marriner which television replays suggested had been correct by a matter of millimetres .\" I watched it, it's not offside at all, \"said Wenger .\" Even his foot was not offside but we have to swallow that. \"We should have scored and it's just another detail that didn't go our way .\" Among many disappointing Arsenal performances, German international Mesut Ozil was particularly underwhelming, with television pundits picking him out for special attention, although Wenger would not criticise him. \"I think he did try,\" said the manager. \"It is difficult to single anybody out. Personally, I don't think he deserved it .\" Wenger also confirmed that Chilean striker Alexis Sanchez, who trained with the team in London on Friday, will be available for their next game, Sunday's visit to Liverpool, after being linked with a potential move away from the club. Tottenham Hotspur pay club record £ 42m to Ajax for Colombian defender Davinson Sanchez But, in the meantime, having conceded three goals in the opening weekend victory over Leicester, Wenger insists he is not panicking about his team in that area. \"Last week we conceded two goals from corners,\" he said. \"They only had three shots on goal so I don't think defended so badly--on set-pieces, yes .\" Today, the goal we conceded we were 100 per cent guilty but it was the kind of night when, not only we didn't score, but stupid mistakes--first by losing the ball centrally and then by defending poorly--cost us. \"Meanwhile, Stoke manager <mark>Mark Hughes</mark> believes his new signing Jese will set the Premier League alight after his debut goal came on the back of a solitary training session with his new club. The 24-year-old Spaniard had also missed an entire week's training before arriving in Stoke due to a family illness. Liverpool reject £ 114m Barcelona bid for Philippe Coutinho\" He's an elite player, \"said <mark>Hughes</mark>.\" A player that can change games for teams, I'm delighted he's here. \"Everybody has seen what he is going to bring to Stoke and bring to the Premier League. We're glad he's in our colours because he's going to light up the Premier League .\" I saw glimpses of that in training and knew if we could get him on the pitch and give him some minutes he would have opportunities to show what he can do. He can be devastating. \"He's not up to speed yet. He's only had one significant training session and missed a week's training last week because his new-born child had a minor operation .\" But he came in and wanted to make an impression and really enjoyed his first taste of the Premier League. \"SCMP Today: HK Edition", "articleID": "2017082005_00545126_W", "names": {"Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"]}}, {"date": "2017-08-20", "url": "http://chatsports.com/mma/a/source/terence-crawford-plans-to-move-up-to-147-wants-jeff-horn-manny-pacquiao-2-winner-13791600", "content": "<mark>Terence Crawford</mark> plans to move up to 147, wants Jeff Horn-Manny Pacquiao 2 winner Related Topics: <mark>Terence Crawford</mark>, Manny Pacquiao, Keith Thurman <mark>Terence Crawford</mark> (32-0, 23 KOs) became the first man since Kostya Tszyu * to unify all major championship belts at junior welterweight, and unlike Tszyu, he did so under the four-belt era (with the WBO becoming a major title in 2007). <mark>Crawford</mark> stopped Julius Indongo (22-1, 11 KOs) with a debilitating body shot in the third round of Saturday's Top Rank on ESPN main event in Lincoln, Nebraska. Having fulfilled his goal of unifying all major championships, \"Bud\" is now looking towards moving up to welterweight. \"I'm planning on moving up to 147,\" <mark>Crawford</mark> said on ESPN's SportsCenter.", "articleID": "2017082022_00732440_W", "names": {"Terence Crawford": ["Q18763984", "Q7701880"]}}, {"date": "2017-08-21", "url": "http://www.9news.com.au/national/2017/08/21/12/49/daniel-kelsall-argues-murder-sentence-should-be-reduced-by-up-to-10-years", "content": "Killer who stabbed victim 28 times in \"senseless' murder appeals sentence By Kelly Fedor • Court Reporter 1:40 pm Aug 21, 2017 Daniel Jack Kelsall today argued for his sentence to be reduced. F Share T Tweet B Mail J Tumblr G Share L LinkedIn W WhatsApp Daniel Jack Kelsall has argued his sentence for the murder of Morgan Huxley at Neutral Bay, should be reduced by up to 10 years. The now 24-year-old chose not to appear via video link as his appeal was heard in the NSW Supreme Court this morning. But his parents Mark and Lynne Kelsall were there to support him almost two-and-a-half years after he was sentenced to a minimum 30 years behind bars for stabbing Morgan Huxley 28 times in his Neutral Bay unit. CCTV showed Kelsall following the 31-year-old home from the Oaks Hotel that night. The sentencing judge, Justice Robert Allan Hulme said the murder\" was utterly senseless and needless...it must have been the doing of a very disturbed individual. \"Morgan Huxley was stabbed 28 times in his Neutral Bay unit. But Kelsall's barrister Braddon Hughes SC argue today the judge made an error in not considering his prospects of rehabilitation properly. He argued he should have placed\" more emphasis on his age, his youth, his lack of convictions and the very, very long time he's going to spend in custody \"he said. Related Articles Sydney trip ends in tragedy for bricklayer Max Summerfield French designer goes head to head with <mark>Brad Pitt</mark> over chateau Husband charged after wife allegedly stabbed in Sydney home He called the sentence\" crushing \"and said\" no matter what steps the applicant makes with his mental health it won't count in a positive way. \"Crown prosecutor Sally Dowling SC today argued Kelsall showed\" psychopathic traits \"which was\" an incurable condition \"and had never shown any remorse .\" This was a...truly heinous, chilling and grotesque case of murder. \"She said the sentencing judge took into account Kelsall's youth when he refused to grant their requests for a life sentence. The three judges hearing the appeal will deliver their judgement at a later date. Mr Huxley's sister Tiffany was among those in court for the hearing. © Nine Digital Pty Ltd 2017 Continue reading courts New South Wales crime national Auto news: Which is Australia's best small hatch? - caradvice.com. au", "articleID": "2017082103_00635726_W", "names": {"Brad Pitt": ["Q35332", "Q373912"]}}, {"date": "2017-08-21", "url": "http://in.reuters.com/article/britain-internet-hatecrime-idINKCN1B10QH?il=0", "content": "Britain to treat internet hate crime as seriously as offline offences Reuters TV Discover Thomson Reuters Trump eyes Afghanistan's elusive mineral riches <mark>Jerry Lewis</mark>: 1926-2017 Reuters TV United States August 21, 2017 / 8:21 AM / a few seconds ago Britain to treat internet hate crime as seriously as offline offences Reuters Staff 1 Min Read A man holds a laptop computer as cyber code is projected on him in this illustration picture taken on May 13, 2017. Kacper Pempel/Illustration/Files LONDON (Reuters) - Online abuse will be treated as seriously as offline offences, Britain's prosecution service said on Monday in new guidance on handling hate crimes. The rules - which included guidelines on helping disabled and bisexual victims - were meant to encourage more people to come forward and press courts to impose longer sentences, the Crown Prosecution Service said. \"This is a crime that's under-reported. Sometimes people feel that they just have to put up with it...That's absolutely not the case,\" Alison Saunders, the director of public prosecutions, told the BBC. The new advice was in response to the growth of social media, the CPS said. There have been several high-profile instances of successful prosecutions of people who had abused lawmakers and other public figures online. Reporting by Alistair Smout; Editing by Andrew Heavens 0: 0", "articleID": "2017082108_00604303_W", "names": {"Jerry Lewis": ["Q294927", "Q472199", "Q6183975"]}}, {"date": "2017-08-21", "url": "http://feeds.breakingnews.ie/~r/bntopstories/~3/fv2odpKxbVw/ireland-make-three-changes-ahead-of-world-cup-clash-with-australia-802850.html", "content": "Ireland make three changes ahead of World Cup clash with Australia 21/08/2017 - 15:32:26 Back to Rugby World Cup Sport Home There has been three changes to the Irish rugby team set to face Australia in Belfast tomorrow, writes Ciara Phelan. Cliodhna Moloney, Louise Galvin and Ciara Cooney have been taken off the bench in a bid to end the tournament on a high after Ireland's hopes of progressing to the semi-finals were shattered with a tough defeat to France last week. <mark>Tom Tierney</mark> addressing the team during a training session in Belfast yesterday. Pic. INPHO Louise Galvin will make up the back three alongside <mark>Alison Miller</mark> and Hannah Tyrrell. Commenting on the changes Ireland's head coach <mark>Tom Tierney</mark> said management looked at areas where the team could be improved. \"Since arriving in Belfast on Friday the squad have had some down time and settled well into the city and training has been very positive,\" he said. \"We know what the Australians will bring to the game tomorrow, and we will have to be ready to match their physicality from the start .\" We've reviewed our own games and looked at areas where we can improve in both attack and defence. \"There is huge pride in this team and we're looking to finish this tournament with two performances .\" Kick off is at 2pm in Belfast and can we watched on eir Sport and RTÉ 2.", "articleID": "2017082115_00806505_W", "names": {"Alison Miller": ["Q18044943", "Q4727144"], "Tom Tierney": ["Q17523759", "Q3530903"]}}]