[{"date": "2017-08-23", "url": "http://www.businesswire.com/news/home/20170823005488/en/Flavored-Water-Market---Trends-Forecasts-Technavio/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE", "content": "LONDON--(BUSINESS WIRE)--Technavio's latest report on the global flavored water market provides an analysis of the most important trends expected to impact the market outlook from 2017-2021. Technavio defines an emerging trend as a factor that has the potential to significantly impact the market and contribute to its growth or decline. The global flavored water market will be growing both in terms of revenue and volume during the forecast period. The growth is expected to be primarily due to changing consumer lifestyle and preferences and growing health awareness among the consumers. These factors have resulted in the development of different varieties of flavors which are fueling the growth of the global flavored water market. Flavored water has emerged as a ready-to-drink (RTD) health beverage. It is a better substitute for carbonated drinks owing to its nutritional benefits. <mark>Atul Kumar</mark>, a lead analyst from Technavio, specializing in research on non-alcoholic beverages sector, says, \"The Americas is the leading region in the global flavored water market, and is expected to witness a high growth rate during the forecast period. Since flavored water is enriched with minerals, vitamins, and natural flavors, the product attracts many health-conscious consumers .\" This report is available at a USD 1,000 discount for a limited time only: View market snapshot before purchasing Buy 1 Technavio report and get the second for 50% off. Buy 2 Technavio reports and get the third for free. The top three emerging trends driving the global flavored water market according to Technavio research analysts are: Introduction of new flavors Innovation in packaging Expansion of flavored water market in emerging economies Looking for more information on this market? Request a free sample report Technavio's sample reports are free of charge and contain multiple sections of the report including the market size and forecast, drivers, challenges, trends, and more. Introduction of new flavors The global flavored water market is witnessing an increasing demand for new flavors and consumers are demanding innovative and exotic flavors. Therefore, players are responding by adding new flavors to their product lines. The competition is becoming intense in the market and players are coming up with various new flavors to stay ahead of the competitors. \"Flavored water products with raspberry, strawberry, pineapple, cucumber, and watermelon have been introduced in the market. Considering this trend among consumers, flavored water manufacturers are introducing many new flavors. H2ROSE uses rose water to create a sweet and fragrant drink, and H2ROSE water comes in four different flavors such as mango, peach, wild berry, and apple,\" according to <mark>Atul</mark>. Innovation in packaging Manufacturers are coming up with innovative packaging that is convenient to carry and enable consumption directly from the package while on-the-go. Consumers are now demanding transparent, labeled, and smaller pack size and that are environment-friendly. Coca-Cola has come up with the plant-based packaging bottle, which is a bio-based plant bottle packaging. Companies such as PepsiCo, Coca-Cola, Danone, and Nestlé are taking the initiative to support for 100% sustainable packaging and increase packaging recovery and recycling rates. Expansion of flavored water market in emerging economies The markets of flavored water in countries like the US are becoming saturated for flavored water. To survive in the market and continue making profits, the vendors of flavored water need to tap new market and customer base. Flavored water, being a functional beverage and having several alternatives, was not that popular in emerging economies. Soft drinks and caffeine-rich drinks like tea and coffee are already in high demand in these nations. Although flavored water by key vendors like Coca-Cola, PepsiCo are present in certain countries but are generally consumed by the upper strata of the society and affluent customers. The key vendors are as follows: Coca-Cola Hint Nestlé PepsiCo Browse Related Reports: Global Sparkling Juices Market 2017-2021 Coconut Water Market in Europe 2017-2021 Global Marzipan Market 2017-2021 About Technavio Technavio is a leading global technology research and advisory company. Their research and analysis focuses on emerging market trends and provides actionable insights to help businesses identify market opportunities and develop effective strategies to optimize their market positions. With over 500 specialized analysts, Technavio's report library consists of more than 10,000 reports and counting, covering 800 technologies, spanning across 50 countries. Their client base consists of enterprises of all sizes, including more than 100 Fortune 500 companies. This growing client base relies on Technavio's comprehensive coverage, extensive research, and actionable market insights to identify opportunities in existing and potential markets and assess their competitive positions within changing market scenarios. If you are interested in more information, please contact our media team at media @ technavio.com.", "articleID": "2017082318_00582948_W", "names": {"Atul Kumar": ["Q41790058", "Q4818789", "Q57090004", "Q58207751"]}}, {"date": "2017-08-24", "url": "http://tbo.com/blogs/gators/fsu-bama-almost-feels-like-a-national-championship-game-week-1/2334907", "content": "FSU-Bama \"almost feels like a national championship game Week 1' MONICA HERNDON | Times <mark>Matt Baker</mark> Published: August 24, 2017 The buzz is continuing to build for next Saturday's blockbuster showdown between No. 1 Alabama and No. 3 Florida State .\" It almost feels like a national championship game Week 1, \"ESPN analyst Kirk Herbstreit said during a teleconference Wednesday. It's the highest season-opening matchup ever and one of only four top-five season openers. One of the most interesting aspects to the game in Atlanta is the coaching matchup - Nick Saban against his former pupil, Seminoles coach Jimbo Fisher .\" If you put those two guys in a cornhole game together for halftime entertainment, that might be as good as the actual game itself, \"Herbstreit said .\" They want to win and compete. That has a lot to do with why they've both enjoyed so much success. \"I'd totally watch that competition. It's better than the chest-pass-the-ball-into-a-soda-can-thing games. A few other excerpts from Herbstreit: * He said a Jim McElwain offense typically has a cerebral quarterback who\" was literally an extension of him into the huddle, \"even if that player wasn't the most talented. Herbstreit didn't say this, but I will: That sounds like Luke Del Rio to me. * He predicts FSU to meet Miami (again) in the ACC title game and said Mark Richt clearly looks refreshed since rejoining his alma mater .\" He looks as young and energetic as I've seen him, \"Herbstreit said. * Herbstreit said he was blown away by the toughness of FSU quarterback Deondre Francois .\" It seemed like every play he played, he was on his back, or he was throwing a touchdown pass, \"Herbstreit said. Francois, for the record, threw 20 touchdown passes and was sacked 36 times.", "articleID": "2017082412_01044261_W", "names": {"Matt Baker": ["Q11771606", "Q30555607", "Q6788298", "Q6788301"]}}, {"date": "2017-08-25", "url": "https://www.theguardian.com/culture/2017/aug/25/trevor-noah-donald-trump-jokes-the-daily-show", "content": "Trevor Noah discussed <mark>Donald Trump</mark>'s variety of public personas, referring to them as an extreme form of acting. Trevor Noah on <mark>Trump</mark>'s rally: \"An outstanding rejection of sanity' Read more On The Daily Show, the host looked at the president's week of wildly differing speeches .\" Three days, three Trumps. Maybe Hillary only has one setting, but <mark>Trump</mark> is like one of those Japanese toilets: he's got too many settings to figure out. \"But while many have used these performances as proof that <mark>Trump</mark> is unhinged, Noah thinks differently .\" Although people would like to believe that <mark>Donald Trump</mark> switches every day because he's not in control, I think it's the opposite, \"he said .\" This is not a bug of <mark>Donald Trump</mark>, it's a feature. He's in full control of whatever persona shows up. \"He described how other politicians switch styles on stage .\" Obama speaks differently in a black and a white crowd; Bush spoke differently to farmers and bankers; Ted Cruz speaks differently to people and that pile of human heads in his basement that he says are his friends, \"he said .\" <mark>Trump</mark> is different. When he talks to different audiences, even within just a few days, he doesn't just tweak his style, he changes his message. \"Facebook Twitter Pinterest Noah then discussed his ultimate theory about <mark>Trump</mark> and how this week has proved him right .\" <mark>Trump</mark>'s swings are only surprising if you expect <mark>Trump</mark> to actually be president. But <mark>Donald Trump</mark> isn't a president, he's just playing one on TV, \"he said .\" <mark>Trump</mark> is simply exploiting something we've all known about politics: half of it is performance. \"He continued:\" It's acting. It's just like Denzel Washington: he can be a lawyer, or a pilot, or a football coach. <mark>Trump</mark> can be a statesman, a demagogue or a standup comedian--he can choose. \"In conclusion, he found a way to reward <mark>Trump</mark>'s work as a politician .\" Don't think of <mark>Donald Trump</mark> as America's worst president. Think of him as the Academy Award winner for best actor in a presidency, \"he said.", "articleID": "2017082516_00072841_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-08-26", "url": "http://wtol.com/story/36221306/trump-setting-records-for-low-presidential-approval", "content": "Trump setting records for low presidential approval - Toledo News Now, News, Weather, Sports, Toledo, OH Trump setting records for low presidential approval - Toledo News Now, News, Weather, Sports, Toledo, OH Member Center: Trump setting records for low presidential approval 2017-08-26T00:34:38 Z2017-08-26T00:41:10 Z (Source: AP Images) Donald Trump started as the most unpopular new president in the history of modern polling. After seven months, things have only gotten worse. Plunging into undesirably uncharted territory, Trump is setting records with his dismally low approval ratings, including the lowest mark ever for a president in his first year. In fact, with four months left in the year, Trump has already spent more time under 40 percent than any other first-year president. At 34 percent, his current approval rating is worse than former President Barack Obama's ever was. Trump's early descent in the polls defies some longstanding patterns about how Americans view their president. Such plunges are often tied to external forces that the president only partially controls, such as a sluggish economy or an all-consuming international crisis. In Trump's case, the economy is humming and the foreign crises have been kept to a minimum. Americans also tend to be optimistic about their new leaders, typically cutting them some slack during their early days in office. Not with Trump. \"Most presidents begin with a honeymoon period and then go down from that, and Trump had no honeymoon,\" said Gallup editor-in-chief Frank Newport. It's a jarring juxtaposition for the reality TV star-turned-president who spent months on the campaign trail obsessing about his poll numbers and reading them to massive rally crowds while vowing that he'd win so much as president that Americans would get sick of it. Since he took office, the poll number recitations have stopped. Trump is now viewed positively by only 37 percent of Americans, according to Gallup's most recent weekly estimate. (Obama's lowest weekly average never fell below 40 percent .) It's even lower - just 34 percent - in Gallup's shorter, three-day average, which includes more recent interviews but can also involve more random variation. To be sure, approval ratings can fluctuate - sometimes dramatically. Some presidents have seen their positive reviews dip below 40 percent, only to recover strongly. Bill Clinton, whose rating fell to 37 percent in early June 1993 after policy stumbles, quickly gained ground. Later that same month, he climbed to 46 percent, and ended his eight years enjoying approval from 66 percent of the nation. Trump has defied the trends before. But if history is a guide, his numbers don't bode well. Low approval ratings hamper a president's ability to push an agenda through Congress and make it more likely the president's party will lose seats in Congress in the midterm elections. Scott de Marchi, who teaches political science at Duke University, says his research suggests approval ratings tend to affect whether a president can persuade Congress to do his or her bidding. That's primarily true with complex issues like tax reform, where Americans care about the outcome but may not have strongly formed opinions. In those cases, Americans are more likely to support whatever plan the president proposes if they broadly approve of the president himself. \"The problem with Trump is that on any area like the budget or tax policy or even health care, people need to be led to a position to support,\" de Marchi said. Since Gallup began tracking presidential approval, four presidents - Harry Truman, Gerald Ford, <mark>Jimmy Carter</mark> and George H.W. Bush - spent significant time below 40 percent during their first four years. Clinton's and Ronald Reagan's forays below the 40 percent mark also came during their first terms. But neither stayed there long. Of those who spent at least a few months below 40 percent approval in a first term, only one - Truman - recovered enough to win re-election. Still, several others reached lows at some point in their presidency that are worse than Trump's, including several who dropped below 30 percent. Truman hit 22 percent in February 1952, during a drawn-out Korean War stalemate and accusations of corruption in his administration. Richard Nixon hit 24 percent at the height of the Watergate scandal just before his resignation in 1974. <mark>Carter</mark> bottomed out at 28 percent in the summer of 1979, amid that year's oil crisis. Trump's average approval rating so far: Just 40 percent. That's even lower than the previous average low for a first-term president, 46 percent, set by <mark>Carter</mark>. Newport, the Gallup chief, said Trump's struggles are unusual in that such abysmal numbers can usually be tied to a single, specific issue bedeviling the country. With Trump, Newport said, \"it's a more general kind of issue with the man himself and a more general dissatisfaction with the way things are going in the country .\" In July, Gallup posed another question to Trump's disapprovers: Why? Nearly two-thirds cited his personality or character, while less than a third cited issues, policies or job performance. By contrast, when Gallup asked the same question about Obama in 2009 and George W. Bush in 2001, less than 2 in 10 disapprovers cited similar concerns about personal characteristics. The vast majority of Republicans support Trump while the vast majority of Democrats oppose him. Such political polarization might be both a blessing and a curse for Trump, preventing him from achieving higher ratings but also keeping him from falling even further. \"When Trump has done things that have generated an enormous amount of attention and people have anticipated his rating could go down, it has not,\" Newport said. \"And that's because he's being propped up by Republicans .\" It's unclear whether Trump's most recent bout with controversy - his response to racially tinged clashes in Charlottesville, Virginia - further harmed his approval ratings. It could be he's close enough to bottoming out that the latest dust-up will have little effect. In a Washington Post-ABC News poll conducted Aug. 16-20, just 28 percent said they approve of Trump's response to Charlottesville. But 37 percent said they approved of the job Trump is doing overall - almost the exact same percentage that approved in the same poll a month earlier. Yet if the famously image-conscious Trump aspires to undo some of the damage, there's reason to hope. \"The history of presidential job approval ratings shows an enormous amount of fluctuation,\" Newport said. \"There's no historical reason why his ratings couldn't go up .\" Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. WTOL 11 Top Stories WTOL 11 Top Stories More>> Friday, August 25 2017 8:30 PM EDT 2017-08-26 00:30:30 GMT (Source: WTOL) Health officials say mosquitoes capable of spreading the Zika virus have been documented in Michigan for the first time. Friday, August 25 2017 8:27 PM EDT 2017-08-26 00:27:49 GMT Updated: Friday, August 25 2017 8:28 PM EDT 2017-08-26 00:28:58 GMT (Source: AP Images) President Donald Trump has pardoned former sheriff Joe Arpaio following his conviction for intentionally disobeying a judge's order in an immigration case. Friday, August 25 2017 8:16 PM EDT 2017-08-26 00:16:43 GMT (Source: RNN) The father of a 4-year-old Ohio boy who died after the boy's stepmother put him in a scalding bath has been found guilty of involuntary manslaughter in his third trial. Tuesday, August 22 2017 9:38 PM EDT 2017-08-23 01:38:06 GMT (Source: AP) A young Ohio man engaged to be married next year is among 10 U.S. sailors missing since the USS John McCain collided with an oil tanker off the coast of Singapore.", "articleID": "2017082600_00686847_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}}, {"date": "2017-08-28", "url": "https://www.texastribune.org/2017/08/28/federal-official-texas-needs-help-finding-new-normal-hurricane-afterma/", "content": "WASHINGTON--Officials leading the federal Hurricane Harvey relief operation emphatically called on all Americans to support rescue efforts in Southeast Texas. \"Helping Texas overcome this disaster is going to be far greater than FEMA coordinating the mission of the entire federal government,\" Federal Emergency Management Agency Director Brock Long said at a Monday morning news conference. \"We need citizens to be involved. This is a landmark event. We have not seen an event like this. You could not...dream this forecast up .\" Long said he planned to travel to Corpus Christi and San Antonio on Monday morning to be with Gov. <mark>Greg Abbott</mark>. Long refused to criticize the decision of Houston-area leaders to direct constituents to stay put, rather than evacuate. \"I believe that every local official, state official and including us, are operating with the best information we've been provided at the time,\" Long said. The Texas Tribune thanks its sponsors. Become one. \"We will strive to get better, but right now guys, it's not a time to start pointing blame,\" he added. A federal official at the news conference said that President Donald Trump still planned to visit the state on Tuesday. Long offered guidance to Texans: People in the flooded regions should not get into their cars. That could put their lives at risk and drain resources that could be used to rescue citizens elsewhere. Those wanting to support relief efforts should visit the website National Voluntary Organization Active in Disaster. For those who need assistance, visit www.disasterassistance.gov. If a person does not have internet access, call 1-800-621-FEMA. The U.S. Army Corps of Engineers was working to restore electrical power to \"critical infrastructure .\" National Flood Insurance Program policy holders should \"call your insurance agent. Go ahead and start that ball rolling .\" Long called on Congress to reauthorize the federal flood insurance program but also suggested this was an opportunity for major reforms. But overall, his refrain on Monday morning was that while the government is coordinated in its response, this hurricane is a stunning natural disaster and has exceeded the federal government's capacity to help every Texan in need. \"We need the whole community, not only the federal government forces, but this is a whole community effort from all levels of government, and it's going to require all citizens to get involved,\" he said. The Texas Tribune thanks its sponsors. Become one. \"I'm asking for all citizens to get involved, here,\" he added. \"Donate your money, figure out how you can get involved as we help Texas find a new normal going forward after this devastating disaster .\" Long maintained the refrain from most federal officials working on the effort: Federal agencies are taking cues from local officials and aim to back up each rung of government as resources are expended. \"They set the mission priorities right now; we fall in line to support those,\" he added. Hide all comments Comment Policy The Texas Tribune is pleased to provide the opportunity for you to share your observations about this story. We encourage lively debate on the issues of the day, but we ask that you refrain from using profanity or other offensive speech, engaging in personal attacks or name-calling, posting advertising, or wandering away from the topic at hand. To comment, you must be a registered user of the Tribune, and your real name will be displayed. Thanks for taking time to offer your thoughts. You must be logged in to leave a comment. | Login | Sign Up Your Comment Read More Comments Related News Most Read Republish This Story Find out how you can put this story on your website. Be a citizen, not a spectator. Support independent, fact-based journalism. Donate to our 501 (c) (3) nonprofit newsroom. Donate today by visiting: texastribune.org/donate The Texas Tribune thanks its sponsors.", "articleID": "2017082813_00703680_W", "names": {"Greg Abbott": ["Q5605224", "Q5605225"]}}, {"date": "2017-08-29", "url": "http://bdtonline.com/news/no-fire-or-fury-but-muted-trump-response-to-nkorea/article_a6212e3f-c85e-5abe-9101-5464b32bcfe3.html", "content": "No fire or fury, but muted Trump response to NKorea missile North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over U.S. ally Japan and splashed into the northern Pacific Ocean, officials said. More Headlines NEW YORK (AP)--The Latest on the U.S. Open, the last Grand Slam tournament of the year (all times local): More Headlines Birth Announcement HAGER--<mark>Michelle Lee</mark> and Jay O’Keith Hager announce the birth of their daughter, Kinsley Paige Hager, born on August 15 at Bluefield Regional Medical Center, the baby weighed 7 lbs. 2 oz. The mother is the former <mark>Michelle Lee</mark> Reed. Maternal Grandparents are Tina and Terry Reed of Bluefield,...Covering Trump: Reports facts, then let the people decide A president's true effect on his country can't be fully and accurately assessed until some time after his or her term ends. But looking at Donald Trump's record so far indicates his effect will be almost 100 percent negative, as is plainly demonstrated by media coverage and the estimates of...More Headlines Close 1 of 9 El presidente Donald Trump habla en una conferencia de prensa conjunta con su colega finlandés Sauli Niinistro, el lunes 28 de agosto de 2017, en la Casa Blanca (AP Foto/Carolyn Kaster) Carolyn Kaster In this Aug. 24, 2017 photo provided by South Korea Defense Ministry on Tuesday, Aug. 29, 2017, a South Korean missile is test-fired at an undisclosed location in South Korea. South Korea has released footage of its own missile tests it says were conducted last week in a response to the latest North Korean missile launch that flew over northern Japan. (South Korea Defense Ministry via AP) HOGP In this photo taken Aug. 28, 2017, President Donald Trump speaks in the East Room of the White House in Washington. President Donald Trump said Tuesday, Aug. 29, 2017 that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. (AP Photo/Alex Brandon) Alex Brandon FILE - In this Aug. 3, 2017 file photo, Japanese Prime Minister Shinzo Abe speaks during a news conference in Tokyo. President Donald Trump said Tuesday that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. President Donald Trump and Abe conferred by telephone over the latest missile test and how to response. (AP Photo/Shizuo Kambayashi, File) Shizuo Kambayashi Japanese Air Self-Defense Force (JASDF) demonstrates the training to utilize the PAC-3 surface to air interceptors at the U.S. Yokota Air Base in Fussa, on the outskirts of Tokyo Tuesday, Aug. 29, 2017. The pre-planned training took place the same morning North Korea fired a missile over Japan. (AP Photo/Eugene Hoshiko) Eugene Hoshiko A visitor uses binoculars to see the North Korea side from the unification observatory in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man AP's news director for Japan and the Koreas explains that Pyongyang's launch of a ballistic missile seems designed to show that North Korea can back up its threat to target the U.S. territory of Guam. (Aug. 29) North Korea's Kaepoong town is seen behind a North Korean military guard post, right bottom, from the unification observatory in Paju, in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man South Korean army's K-9 self-propelled howitzers move on the street in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man No fire or fury, but muted Trump response to NKorea missile By MATTHEW PENNINGTON Associated Press 14 min ago El presidente Donald Trump habla en una conferencia de prensa conjunta con su colega finlandés Sauli Niinistro, el lunes 28 de agosto de 2017, en la Casa Blanca (AP Foto/Carolyn Kaster) Carolyn Kaster In this Aug. 24, 2017 photo provided by South Korea Defense Ministry on Tuesday, Aug. 29, 2017, a South Korean missile is test-fired at an undisclosed location in South Korea. South Korea has released footage of its own missile tests it says were conducted last week in a response to the latest North Korean missile launch that flew over northern Japan. (South Korea Defense Ministry via AP) HOGP In this photo taken Aug. 28, 2017, President Donald Trump speaks in the East Room of the White House in Washington. President Donald Trump said Tuesday, Aug. 29, 2017 that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. (AP Photo/Alex Brandon) Alex Brandon FILE - In this Aug. 3, 2017 file photo, Japanese Prime Minister Shinzo Abe speaks during a news conference in Tokyo. President Donald Trump said Tuesday that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. President Donald Trump and Abe conferred by telephone over the latest missile test and how to response. (AP Photo/Shizuo Kambayashi, File) Shizuo Kambayashi Japanese Air Self-Defense Force (JASDF) demonstrates the training to utilize the PAC-3 surface to air interceptors at the U.S. Yokota Air Base in Fussa, on the outskirts of Tokyo Tuesday, Aug. 29, 2017. The pre-planned training took place the same morning North Korea fired a missile over Japan. (AP Photo/Eugene Hoshiko) Eugene Hoshiko A visitor uses binoculars to see the North Korea side from the unification observatory in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man AP's news director for Japan and the Koreas explains that Pyongyang's launch of a ballistic missile seems designed to show that North Korea can back up its threat to target the U.S. territory of Guam. (Aug. 29) North Korea's Kaepoong town is seen behind a North Korean military guard post, right bottom, from the unification observatory in Paju, in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man South Korean army's K-9 self-propelled howitzers move on the street in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man WASHINGTON (AP)--So much for North Korea's restraint. So much for President Donald Trump's threats of \"fire and fury .\" After Pyongyang's highly provocative missile test over close American ally Japan, Trump offered a surprisingly subdued response Tuesday, pulling back from his administration's recent suggestions of a dialogue with the communist country but also avoiding a repeat of his bombastic warnings earlier this month of a potential military confrontation. Instead, Trump's terse, written statement reiterating that all U.S. options are being considered pointed to an administration cautiously searching for an effective policy, even as the North's test risked endangering Japanese civilians. Washington and its allies called an emergency U.N. Security Council meeting for later Tuesday, but looked short on new ideas for stopping the nuclear and missile advances that are increasingly putting the U.S. mainland within range. \"Threatening and destabilizing actions only increase the North Korean regime's isolation in the region and among all nations of the world,\" Trump said after the North's missile soared almost 1,700 miles (2,700 kilometers) into the Pacific Ocean, triggering alert warnings in northern Japan and shudders throughout Northeast Asia. \"All options are on the table .\" The tone was far more moderate than Trump's colorful language earlier this month, when he spoke of unleashing \"fire, fury and frankly power the likes of which this world has never seen before\" if North Korea kept threatening the U.S.. There were no indications Trump had any imminent intention to make good on his threat to strike North Korea. But such has been the speed of the Trump administration's zigs and zags on North Korea policy. If Tuesday's statement seemed unusually restrained for Trump, it actually marked a toughening of his administration's most recent tone. A senior U.S. official said the restrained nature of the administration's recent responses was intentional, reflecting an effort by new White House chief of staff <mark>John Kelly</mark> to prevent a repeat of the rhetorical escalation that occurred earlier this month. But with Trump's focus diverted to flood-ravaged Texas, it was unclear whether he might ultimately speak or tweet about the launch in greater detail. Three weeks ago, when North Korea responded to Trump's \"fire and fury\" warning by threatening to launch multiple missiles near the U.S. Pacific territory of Guam, Trump tweeted that an American military solution to the standoff was \"locked and loaded .\" Experts warned that the rapid-fire escalation had raised the danger of a miscalculation among the nuclear-armed powers. The administration's more cautious approach in recent days reflects an effort to preserve modest signs of progress with North Korea that had led Trump and his top diplomat to hint at the possibility of direct talks, said the official, who wasn't authorized to discuss the deliberations publicly and requested anonymity. North Korean leader <mark>Kim Jong Un</mark> is \"starting to respect us,\" Trump said at a campaign rally in Phoenix last week, adding that \"maybe, probably not, but maybe something positive can come about .\" Secretary of State Rex Tillerson credited <mark>Kim</mark>'s government with demonstrating \"some level of restraint that we have not seen\" by not conducting a missile test for almost a month, expressing hope it might be the \"signal that we have been looking for,\" leading to a dialogue. Even that suggestion was a surprising one for the Trump administration. On his first trip to Asia, Tillerson said North Korea must first abandon its \"weapons of mass destruction\" for talks to occur. But he later floated the idea that the North merely had to halt its nuclear and missile tests. The North has completely rejected both demands, saying negotiations hinge on the U.S. dropping its \"hostile policy .\" In any case, the optimism generated by North Korea's temporary lull in missile activity ended last Friday, when it fired three short-range projectiles into the sea. It then raised the ante three days later by firing directly over Japan's territory, breaking with its usual practice of launching over open seas where there's no risk that a misfire would land in another country or send debris falling on populated areas. <mark>Kim</mark> on Tuesday expressed great satisfaction with the launch and called for more ballistic missile launches into the Pacific, the Korean Central News Agency reported. <mark>Kim</mark> called it a \"meaningful prelude\" to containing Guam. The agency said the missile the North fired Tuesday was the Hwasong-12 intermediate-range missile it recently threatened to fire toward Guam. But for Trump's earlier bombast, his Tuesday statement wouldn't have been particularly surprising. Democrat and Republican presidents have routinely offered the \"all options on the table\" terminology, even though a pre-emptive U.S. military strike is highly unlikely. North Korea has the world's largest standing army and a massive conventional weapons arsenal that can easily target the capital of South Korea and its metropolitan area of about 25 million people. American officials have long assessed that mass casualties would likely result. But while U.S. officials had been inclined to overlook Friday's launches, the launch early Tuesday in North Korea was harder to ignore. Friday's rocket tests represented a typical North Korean response to annual, U.S.-South Korean military drills that Pyongyang claims are rehearsals for invasion. This year's war games started last week and end Thursday. Tuesday's launch was altogether more provocative. It was only the third time North Korea has fired a missile over Japan. The previous occasions in 1998 and 2009 used rockets purportedly for space exploration. This time, the North unambiguously tested a ballistic missile designed for military strikes and believed capable of carrying a nuclear warhead. Within minutes, cellphones alerted residents on the northern Japanese island of Hokkaido, and loud alarms and emails instructed them to stay indoors. Speakers broadcast an alert saying \"missile is passing, missile is passing .\" Trump and Prime Minister Shinzo Abe of Japan conferred by telephone, agreeing that North Korea poses \"a grave and growing direct threat,\" the White House said. They vowed to increase pressure on the North. \"Japan's and the U.S. positions are totally at one,\" Abe added in a statement, saying Trump expressed his \"strong commitment\" to defend Japan. During a closed-door Security Council session later Tuesday, Nikki Haley, Trump's U.N. envoy, was hoping veto-wielding members China and Russia would cooperate. But Haley didn't specify what action the U.S. its allies sought. \"No country should have missiles flying over them like those 130 million people in Japan. It's unacceptable,\" Haley told reporters. She added, \"Something serious has to happen .\" ------Associated Press writers Josh Lederman and Bradley Klapper in Washington and Jennifer Peltz at the United Nations contributed to this report. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2017082923_00649148_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"], "Kim Jong Un": ["Q14045951", "Q56226"], "Michelle Lee": ["Q16233958", "Q28465824", "Q6837119", "Q717070"]}}, {"date": "2017-08-30", "url": "http://www.myrtlebeachonline.com/news/business/national-business/article170144052.html#storylink=hpdigest", "content": "Mobile & Apps In this Oct. 16, 2016, file photo, Indian Prime Minister Narendra Modi, left, talks with Chinese President Xi Jinping shake hands with leaders at the BRICS summit in Goa, India. India and China have agreed to pull back their troops from a face-off in the high Himalayas where China, India and Bhutan meet, signaling a thaw in the monthslong standoff, India's government said Monday, Aug. 28, 2017. Manish Swarup, File AP Photo In this Oct. 16, 2016, file photo, Indian Prime Minister Narendra Modi, left, talks with Chinese President Xi Jinping shake hands with leaders at the BRICS summit in Goa, India. India and China have agreed to pull back their troops from a face-off in the high Himalayas where China, India and Bhutan meet, signaling a thaw in the monthslong standoff, India's government said Monday, Aug. 28, 2017. Manish Swarup, File AP Photo China, India rivalry looms over BRICS summit By LOUISE WATT Associated Press August 30, 2017 12:44 AM BEIJING China and India may have ended a tense border standoff for now, but their longstanding rivalry raises questions about the possibility of meaningful cooperation at an upcoming summit of major emerging economies. The annual summit of the BRICS grouping encompassing Brazil, Russia, India, China and South Africa gets under way this weekend in the southeastern Chinese city of Xiamen, hoping to advance its vision of an alternative to the Western dominance of global affairs. The leaders of all five nations are expected to attend, offering the best opportunity for Chinese President Xi Jinping and Indian Prime Minister Narendra Modi to talk since the border tensions flared in June. While both their countries view BRICS as a significant forum for progress, their rivalry for global influence and fears of containment by the other threaten to overshadow those aspirations. The two countries' militaries are \"prowling the same spaces\" along their land borders, in the Indian Ocean and western Pacific Ocean, said Sreeram Chaulia, dean of Jindal School of International Affairs in the Indian city of Sonipat. Even beyond the region, they are vying in Africa and Latin America \"for the leadership of the developing world,\" Chaulia said. \"There is a contest, whether it is acknowledged or not, and it is because of the ambitions of both nations to be superpowers and to be inheriting the Asian century,\" Chaulia said. Attempting to start the BRICS summit off on a positive note, Beijing and Delhi on Monday announced a resolution of their most protracted and potentially explosive border standoff in years. The saber-rattling had raised fears of renewed conflict between the nuclear-armed Asian giants, who fought a bloody border war in 1962 and remain locked in disputes over extensive chunks of territory along their border. Yet, while India's Ministry of External Affairs said that troops were leaving the face-off site, China's official response avoided any mention of Chinese concessions or the fact that troops from both sides will continue patrolling in the area. \"The attempt is to paint India as the aggressor,\" said Sriparna Pathak, an assistant professor in international relations at Assam Don Bosco University in the northeastern Indian state of Assam. \"Clearly, China wants to somehow portray itself as the winner in a conflict which India had started and has now...been forced to withdraw by China .\" Other sources of distrust include:--Indian fears of Chinese encroachment in the Indian Ocean. China announced Friday it had carried out military drills in the western Indian Ocean, advertising its growing presence there. China is also cooperating with Pakistan, Sri Lanka and other coastal nations on port access, including for its navy .--Indian wariness about the motives behind Beijing's flagship \"One Belt, One Road\" infrastructure initiative, which includes a key component in Pakistan--India's archrival but one of China's staunchest allies. That adds to Indian frustration over lopsided trade that saw China record a trade surplus of about $40 billion with India last year .--China has thwarted attempts by India to gain permanent membership on the U.N. Security Council and join the Nuclear Suppliers Group, or to label Pakistani militant Masood Azhar a terrorist .--Beijing resents India's providing a base for the Dalai Lama, and complained bitterly when the exiled Tibetan spiritual leader was permitted to visit an Indian region claimed by China earlier this year .--Beijing fears what it sees as a U.S.-led encirclement of China by Washington's allies and neighbors, including India and Japan. Modi has sought to balance relations between China and the U.S., along with others such as Russia and Japan, but Beijing continues to view New Delhi as an upstart rival. Given the recent hostility between China and India, \"the air between the two even at the upcoming BRICS summit will not be a calm one,\" although they will likely seek to maintain appearances so as not to be portrayed as the spoil sport, Pathak said. Still, the BRICS grouping holds considerable allure for both countries, underscoring their support for regular meetings over the past decade to discuss economic concerns and issues such as climate change. Some observers see a multilateral arena like BRICS as being one of the few places where the world's two most populous countries can work together despite tensions. \"There is competition and mistrust but also some maturity where they are able to convert these face-offs into face-saving solutions,\" said Chaulia. He said it was \"quite feasible\" to put aside \"bilateral bad blood\" and have worthwhile cooperation at BRICS. \"Both countries cannot hold the other three, as in South Africa, Russia and Brazil, hostage to our narrow nationalistic rivalries,\" he said. The recent border standoff has shown that BRICS now needs to establish a method for sorting out \"problems and contradictions\" between China and India when they arise, said <mark>Zhang Yansheng</mark>, chief research fellow at the Beijing think tank China Center for International Economic Exchanges. The summit is \"a great opportunity to communicate face-to-face and exchange views on the two countries' problems and contradictions and the solutions to them,\" <mark>Zhang</mark> said. The timing of the summit is also significant, coming as the U.S. under President Donald Trump appears to be abandoning the traditional global order, said Alka Acharya, professor at the Centre for East Asian Studies at Jawaharlal Nehru University. Both China and India see BRICS as \"a very significant platform, particularly this time when the West is disengaging from globalization as it had operated until now,\" Acharya said. Yet, she added, \"unless China and India cooperate, this is not going to produce very good results. So this is something I think is realized at the highest levels .\" In this Oct. 16, 2016, file photo, Indian Prime Minister Narendra Modi, left, talks with Chinese President Xi Jinping at the BRICS summit in Goa, India. India and China have agreed to pull back their troops from a face-off in the high Himalayas where China, India and Bhutan meet, signaling a thaw in the monthslong standoff, India's government said Monday, Aug. 28, 2017. Manish Swarup, File AP Photo Never miss a local story. Sign up today for unlimited digital access to our website, apps, the digital newspaper and more.", "articleID": "2017083004_00558211_W", "names": {"Zhang Yansheng": ["Q45448554", "Q45505592", "Q45658084", "Q45694841"]}}, {"date": "2017-08-30", "url": "http://brownsvilleherald.com/business/article_f94c946e-8d9f-11e7-8113-339e9f6364b5.html", "content": "Brownsville port signs MOU; Mission part of economic development agreement - Brownsville Herald: Business Los Fresnos Consolidated Independent School District trustees approved a $114.3 million budget that includes the same tax rate as last year and a 3 percent raise for all employees at a meeting Monday in Los Fresnos. Posted: August 29 CALAR ALTO, Spain (AP)--Chris Froome increased his lead of the Spanish Vuelta on Wednesday, finishing second in the mountainous 11th stage behind Astana rider <mark>Miguel Angel Lopez</mark>. Updated: 11:31 am Port of Brownsville logo Posted: Wednesday, August 23, 2017 10:05 pm Brownsville port signs MOU; Mission part of economic development agreement BY <mark>STEVE CLARK</mark> STAFF WRITER Brownsville Herald Officials from the Brownsville Navigation District and Mission Economic Development Corporation have signed a memorandum of understanding to collaborate on international trade opportunities with Mexico and other economic development projects. The legally nonbinding agreement signals that the parties aim to \"work to connect and grow business between the Mission Business Park and the Port of Brownsville,\" according to an official statement. Patty Gonzales, the port's director of communications, said that although the MOU is nonbinding, it does indicate and \"seriousness and mutual respect .\" \"While the port has long worked with all chambers and EDCs up and down the Valley, this just kind of defines our relationship a little bit more,\" she said. \"Where it makes sense we'll share information that pertains to economic development in the region, not just economic development for Mission or the Port of Brownsville, but up and down the Valley .\" The port, which already has ties with economic development organizations in Cameron County, made overtures to EDOs across the Valley and Mission was the first to respond, Gonzales said. She cited Southwest Steel Coil, a Mission-based company that imports steel through the port, as one instance of the cross-Valley bond. \"That's one example of how we work together,\" Gonzales said. \"This is really the port working to fulfill its regional potential. The Port of Brownsville is the Valley's port .\" Teclo Garcia, Mission EDC's director of strategic partnerships, said his organization and the port had been talking for some time about coordinating, which makes sense given the asset of Hidalgo County's international bridges. \"We can try to drive traffic to the port and vice versa,\" he said. Garcia said having a deepwater port just down the road is an effective tool for recruiting companies to the business park. \"Especially when you're talking to a bigger factory or company that needs deepwater port access, they ask those kind of questions: What kind of interstate access to do you have? Do you have a port nearby? We haven't had the occasion yet but we hope to be able to use that,\" he said.", "articleID": "2017083016_00680717_W", "names": {"Miguel Angel Lopez": ["Q17711593", "Q459799", "Q6015707"]}}]