[{"articleID": "2009010822_00023420_W", "names": {"Alexander Medvedev": ["Q15303933", "Q4287262", "Q723240"]}, "date": "2009-01-08", "url": "http://slapshot.blogs.nytimes.com/2009/01/08/european-puck-gazprom-and-the-khl-all-star-game/", "content": "european puck: gazprom and the k.h.l. all-star game this saturday the k.h.l. all-star game will be played outdoors in moscow's red square. the first game there was staged in december 2006, above, to mark the 50th anniversary of the u.s.s.r.'s first olympic gold medal in hockey. saturday's game will be played amid controversy over the cutoff of natural gas exports to europe by gazprom, the k.h.l.'s top sponsor. (ap/andrei golovanov) k.h.l. all-star game, live in the u.s. viewers in the united states will be able to watch the k.h.l. all-star game, live from moscow, on both cable television and the internet this saturday, jan. 10. the game, to be played outdoors in red square, will be telecast on universal sports (channel 162 on manhattan cable systems) starting at 8 a.m. eastern with a same-day encore presentation at 11 p.m. the live webcast on universalsports.com will also begin at 8 a.m. and will be available later for on-demand viewing. anaheim ducks announcers john ahlers and brent severyn will call the action from the universal sports studio in los angeles. saturday's k.h.l. all-star game, an outdoor extravaganza in red square that will be shown live on u.s. television, is meant to showcase the new league and its ambitious plans to expand into scandinavia, central europe and even asia. but some of the countries the k.h.l. wants to expand into may be feeling a little put off right now, given that the league's main sponsor is the russian state company gazprom, which has cut off natural gas supplies to much of europe during a very cold winter on the continent as part of a price dispute with ukraine. at a time when k.h.l. president <mark>alexander medvedev</mark> might have been talking up the game, he is very much in the news in his other role as gazprom's export c.e.o. vladimir krutov and...is that borje salming?...at the commemorative game in red square in 2006. (reuters/sergei karpukhin) \"we are shocked that we're not in the position to bring gas to the border of ukraine because they shut down the pipelines,\" <mark>medvedev</mark> said on wednesday, as european union officials stepped in to try to mediate the dispute. \"there is no reason to blame russia or gazprom .\" continuing gazprom controversy. but now we turn to the first european roundup of 2009 (note the new name, \"european puck,\" shorter and less derivative than the previous \"hockey night in europe\" ). we start, aptly enough, with the russian k.h.l., where ak bars kazan, the league's no. 3 club, has been struggling a bit of late. could they snap out of it against improving hk mvd, the police team that has almost made it all the way to .500?: summary avangard ot 2-1 vityaz summary lokomotiv 2-1 dinamo minsk. alexei yashin scores the winner on a power play with five minutes to go. your comment comments are moderated and generally will be posted if they are on-topic and not abusive. for more information, please see our about slap shot slap shot, the new york times hockey blog, reports on the rangers, the national hockey league and anything that glides quickly across a frozen surface anywhere on the globe, from the snowy prairies of saskatchewan to the frigid steppes of russia and beyond, like, say, phoenix. wednesday the champions hockey league finalists are set after zsc lions zurich defeat espoo blues, 4-1, to sweep both ends of their two-leg semifinal. lions will face defending european champions metallurg magnitogorsk, who rallied to upset k.h.l. leaders salavat yulaev ufa, 3-1, then beat them in a decisive penalty shootout as well. the two-leg final goes on jan. 21 and 28--the first time ever that a russian club will face a swiss club in a european final how much more popular is a big holiday-time international tournament compared with the six-month grind of the n.h.l. regular season? going head to head saturday night, tsn's telecast of the canada-russia semifinal at the world junior championship averaged 1.86 million viewers, against cbc's \"hockey night in canada\" leafs-sens telecast, which drew 857,000. below, the standings for the \"top seven\" european domestic leagues through games of jan. 7. an asterisk (*) denotes last season's playoff champion; a circumflex (^) denotes the regular-season champion; a double asterisk (**) denotes those clubs that did the double in 2007-08. tarasov division w w + l + l pts linköpings hc 19 1 11 64 hc vítkovice steel ostrava deg metro stars düsseldorf 16 5 thursday's results in russia and sweden. pennington finds perspective his season over, chad pennington takes some time out for news-media closure. thursday's results in russia and sweden. his new town is crazy for mats sundin, even though he made his unremarkable debut out of town. thursday's junior report news, notes, results and more from the world of junior hockey. zsc lions win their semifinal and will face metallurg magnitogorsk for the club championship of europe."}, {"articleID": "2014081514_00008130_W", "names": {"Michael Chapman": ["Q16199815", "Q18921531", "Q19949160", "Q487094", "Q5323401", "Q58757719", "Q6829213"]}, "date": "2014-08-15", "url": "http://bendbulletin.com/home/2325830-151/legendary-british-journalist-unmasked-soviet-spies", "content": "By Martin Weil / The Washington Post Chapman Pincher, a reporter and author who plagued prime ministers and tracked down traitors while becoming a legend in British journalism, died Aug. 5 in Kintbury, England. He was 100 years old. He had a small stroke several weeks ago, his son, <mark>Michael Chapman</mark> Pincher, told Britain's Guardian newspaper. As an investigative reporter for the London Daily Express during the Cold War decades, Pincher displayed a flair for getting highly placed sources to entrust him with information that many in Britain's political and security establishments wished to keep secret. Working as a one-man investigative unit, Pincher sought to expose the activities of people he suspected of acting surreptitiously on behalf of the Soviets. In an interview with Pincher last year in the British newspaper the Independent, Charlotte Philby noted that one of the traitors or double agents he exposed was her grandfather, Kim Philby, who defected to the Soviet Union in 1963. Pincher was dubbed \"the great spy catcher of Fleet Street,\" after the street that was the headquarters of British newspapering. Targets of Pincher's suspicions included members of the \"Cambridge Five,\" a group of British intelligence moles - including Philby - who had been educated at Cambridge University; the German atomic spy Klaus Fuchs, who was convicted of leaking information about Allied nuclear research to the Soviets; and even one of the chiefs of the British internal security agency MI5, analogous to the FBI. The suspicions about the MI5 chief were laid out in a 1981 book, \"Their Trade Is Treachery,\" which was published after Pincher had left a 40-year career in newspapers. Some of his allegations were vigorously denied. Pincher was unruffled by critics who said he was reporting leaks to serve the purposes of his source, saying, \"If someone wants to come and tell me some news that nobody else knows and I make a lovely scoop of it, come on, use me .\" In addition to his revelations of spying, Pincher also broke journalistic ground with reporting on the link between smoking and lung cancer and was credited with a scoop on the marriage of Britain's Princess Anne. Endowed with a memory that enabled him to recall what he was told without recourse to note-taking, Pincher often interviewed his sources at his favorite London tavern. One chapter in his autobiography, \"Dangerous to Know,\" published this year to mark his 100th birthday, was called \"Momentous Lunches .\" Pincher was equally adept at getting information by joining well-placed weekenders in country fishing or shooting outings. \"I always tried to meet all the top people, because that's where the stories lay,\" he once said. \"When you have access to people, you have access to facts, usually secret facts .\" Such practices allowed him to set out in disturbing detail the extent to which Britain's security services had been penetrated by the Soviets. Noting the unusually large size of the Soviet Embassy in London, Pincher asserted that many of the presumed diplomats, gardeners and drivers were actually engaged in espionage. More than 100 were ultimately expelled. In another revelation, Pincher told Britons how the government was intercepting their private cables and telegrams. According to news accounts, he also detailed overpayments for the Bloodhound missile, a mainstay of Britain's air defense. While head of the defense staff, Lord Louis Mountbatten was said to have dictated a story to him as the two drove together. The story appeared under Pincher's name. One of the most frequently repeated endorsements of his journalistic accomplishments was found in a 1959 note in which Prime Minister Harold Macmillan, in a fit of annoyance, asked a subordinate, \"Can nothing be done to suppress or get rid of Mr. Chapman Pincher? I am getting very concerned about how well informed he always seems to be on defense matters .\" Henry Chapman Pincher was born March 29, 1914, in Ambala in India, where his father had been in the British military. After World War I, the family returned to England. Pincher studied biology at King's College in London and, while a student, published scientific papers on genetics. After military service, he became the defense, science and medical editor of the Daily Express. He later worked for other newspapers. One of his editors at the Express, he said, suggested that he drop his first name from his byline, saying it would give him a dash of upper-class panache. Pincher wrote historical romances, science fiction and espionage novels and several nonfiction books about the world of spies and secrets. Explore more of Central Oregon with a subscription to The Bulletin."}, {"articleID": "2016041913_00400682_W", "names": {"Jon Jones": ["Q285450", "Q3183202"]}, "date": "2016-04-19", "url": "http://www.sportsbusinessdaily.com/Daily/Morning-Buzz/2016/04/19/Quick-Hits.aspx", "content": "Quick Hits...Published April 19, 2016 \"I want to win this series as badly as they do\" --Lightning VP & GM Steve Yzerman, on playing his old team, the Red Wings, in the first round of the Stanley Cup Playoffs (TAMPA BAY TIMES, 4/19). \"I was a drug addict\" --UFC fighter <mark>Jon Jones</mark>, in a U.. . This is a SportsBusiness Daily article. Perhaps you are not logged in to your SBD account or you are not an SBD subscriber. To access this article, please click Log In, Subscribe or Free Trial. Already a SBD Subscriber? E-mail alerts of the week's sports business news. Up to the minute coverage of sports business news around the country online and more ..."}, {"articleID": "2019083020_00047186_W", "names": {"Jean-Luc Godard": ["Q3167159", "Q53001"]}, "date": "2019-08-30", "url": "https://ottawasun.com/entertainment/movies/kristen-stewart-aims-to-shine-spotlight-on-jean-seberg/wcm/392c8cc3-2a08-4d7d-ac34-142f1c4f5318", "content": "VENICE--Forty years after actress Jean Seberg died, Kristen Stewart says she wants to show the world that the star of the French New Wave should be known for more than just her short haircut. The 29-year-old plays the actress in a political thriller detailing how the FBI targeted Seberg in the late 1960s because of her personal and political links to African American civil rights activist Hakim Jamal. Seberg began her career as a teenager, portraying Joan of Arc in Otto Preminger's Saint Joan. But it was her role in <mark>Jean-Luc Godard</mark>'s Breathless in 1960 that turned her in a French New Wave star. The film titled Seberg starts with her meeting Jamal, played by Anthony Mackie, on a plane. FBI agents, played by Jack O’Connell and Vince Vaughn, tap her home as they seek to expose the affair and discredit the actress. The film, which premieres at the Venice Film Festival on Friday in an out-of-competition screening, follows Seberg's realization that she is being watched and the impact it has on her mental health and personal life. \"This person's story is so tragic for all the right reasons and we should definitely know her for more than the short haircut and the movies,\" Stewart told a news conference. Director Benedict Andrews said viewers get to know Seberg \"through the gaze of the FBI\" in the movie. \"To see that private life then used by the FBI to destroy her for political purposes I found was a very particular and a very special story, but also one that was startlingly relevant in 2019,\" he said. Seberg died on Aug. 30, 1979, aged 40. Asked about actors being political today, Stewart she had no qualms in voicing her opinions. \"There's this really sort of polarized climate that we're living in right now, it's not hard for me to wear my politics,\" she said. \"It shows up in the work that I do and the people I associate myself with and the conversations that I have with individual journalists, day in and day out. I like that interaction. I'm so lucky to have it .\" Stewart, who found global fame as a teenager when she starred in the Twilight movies and will soon be seen in the Charlie's Angels reboot, also said she now felt more comfortable living in the public eye. \"There's a difference, and for a minute a couple years ago I definitely felt like\" ugh, I have to like protect myself' and I'm so completely unguarded now, \"she said .\" It's a beautiful feeling. \"Comments Share your thoughts Festivals Kristen Stewart"}, {"articleID": "2017102701_00344657_W", "names": {"Aaron Smith": ["Q16875058", "Q18819350", "Q4662447", "Q4662449", "Q4662451", "Q4662453", "Q4662456", "Q4662457"], "Patrick Murphy": ["Q17418821", "Q21170773", "Q2224935", "Q23418906", "Q3182011", "Q3299047", "Q55360928", "Q58096471", "Q58544103", "Q5997832", "Q7147290", "Q7147291"], "Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2017-10-27", "url": "http://future.wikia.com/wiki/2028_US_Presidential_Election_(Populist_America)?diff=210741&oldid=201336", "content": "Revision as of 19:36, August 5, 2017 (edit) Ben10fan3 (wall | contribs) (Adding categories) ← Older edit Latest revision as of 00:36, October 27, 2017 (edit) (undo) 71.72.141.147 (wall) (→ Democratic Party) Line 61: Line 61: − The \"\"United States presidential election of 2028\" ' was held on Tuesday, November 4, 2028, taking place as the effects of the 2025 Wall Street Crash and the Second Depression were being felt intensely across the country. It was the 61st consecutive quadrennial election for President and Vice President. Independent candidate Andrew Farkas, award winning rap artist, defeated incumbent Libertarian President Lucky Narain, Democratic Party candidate Marisol Rodriguez, Republican Governor of Michigan, <mark>Aaron Smith</mark>. − − President Lucky Narain's popularity was falling as voters felt he was partly responsible for the economic collapse, and had no intention of doing anything to solve the problem. While normally corporations in and outside of the United States would have spent billions to keep Narain in power, the Second Depression quickly drained the coffers of the most powerful business interests, therby allowing for the first time since the election of President Donald Trump, for a candidate to run largely on private small donations from citizens and not huge donations from powerful interest groups. Charles P. Edwards used what he called Capitalism's failure to deal with the problems of the modern economy as a platform for his own election, promising reform in his policy called Populism. Edwards won by a landslide, and this \"re-aligning election\" marked the collapse of the Fifth Party System or Conservative Era. The voters soon were realigned into the Sixth Party System, dominated by Edward's Populist Coalition. − − = = Nominations = = − = = = Democratic Party = = = − * arya, Governor of Texas − * Chelsea Clinton, U.S. Senator from New York − * <mark>Patrick Murphy</mark>, U.S. Speaker of the House from Pennsylvania − − = = = Republican Party = = = − * <mark>Aaron Smith</mark>, Governor of Michigan − * Meagan McCain, former U.S. Secretary of the Interior − * Cory Shears, U.S. Representative from Washington − * <mark>Glenn Beck</mark>, U.S. Senator from Utah − * Will Healy − − = = = Libertarian Party = = = − * Lucky Narain, 47th President of the United States − * Robert Grandon, Governor of Ohio − − = = = Independent Candidates = = = − * Charles Patrick Edwards, Governor of Washington − − = = General Election = = − = = = Campaign = = = − After working for months with leaders of most of America's minor party leaders to form a single Populist convention, Edwards accepted an unofficial nomination by most of the country's minor parties. In this history-making speech, he committed himself to battling the Second Depression in the United States with a \"permanent revolution\" when he stated: \"I promise you my fellow Americans, that a permanent revolution will bring this country under an economic system host first priority is fairness for all people\" Edwards' trip to Chicago was the first of several successful, precedent-making moves designed to make him appear to be the candidate of change in the election. Large crowds greeted Edwards as he traveled around the nation, and he often appeared on stage during his introductory concerts playing along side the bands. − − In contrast, Narain was widely blamed for the Second Depression, and Reed and May-Rod drew fire from all sides for being members of the parties that enabled the depression; for more than two years, Narain had been issuing statements that the worst was over, only to have the economy make further downturns. Along with the anti-sentiment from the deaths of refugees who had built tent cities in Washington DC; his chances of a second term were slim to none. Narain's attempts to campaign in public were a disaster, as he often had objects (especially rotten fruit and vegetables) thrown at him or his vehicle as he rode through city streets. In his addresses, Narain attacked Edwards as a dangerous radical who would only make the Depression worse by raising taxes and increasing the federal debt to pay for expensive welfare and social-relief programs. However, with unemployment at 34.6%, Narain's criticisms of Populism did nothing more than further lower his popularity with the public. Narain even received a letter from an Ohio man that said \"Vote for Edwards and we might not hang you\". − − Narain called Edwards a \"socialist in drag\" and Edwards called Narain a \"rich, self righteous, corportist .\" In the last days of campaigning, Narain criticized Edwards' \"idiocy, nonsense, childishness, and exaggeration\" of his administration. − − 2028 was a realigning election. Edwards and the populist coalition ticket won a sweeping victory over Narain and the conservatives, extending their control over the U.S. House and gaining control of the U.S. Senate. Eight years of conservative leadership came to an end, and the Populist era would ensue. − − = = = Issues = = = − = = = = China & Turkey = = = = − By July China and Turkey had become major issues of the campaign as they continue their expansionist policies in the middle east. President Narain and Governor Rodriguez both maintained strong anti-war positions on the issue of engaging China and Turkey; however Rodriguez did express a willingness to negotiate with the Turks. Governor Reed took the stance that nothing less than a full scale invasion of China was necessary to defend American interests in the Pacific, and negotiating with the Turks would only act as a rout to appeasement would weaken US strategic interests. Governor Edwards had the most nuanced approached. He suggested that negotiation continue to be key to US foreign relations, but allowing the Chinese or the Turks to expand their spheres of influence into American global interests would demand a military response. Edwards suggested that to avoid war, the US must engage in Lend-Lease policies with Taiwan, Japan, Poland, Russia, and India to bolster America's allies ability to defend themselves from attack. Governor Rodriguez countered this notion, as well as Governor Reed's militeristic approach, with the simple fact that the US military had been bled dry by the Narain administration, and that there was simply no way to make war should the Chinese attack American interests in the Pacific. Both Governor Reed and Edwards stated that they intended to increase military funding should they be elected; Governor Reed even went so far as to propose bringing back the draft, while Edwards argued that merely upgrading the Navy and the Air Force would be sufficient to defend America from attack. − − = = = = Narain's Unpopularity = = = = − President Narain enjoyed respectable approval ratings for much of his first year and office, usually remaining between 40% to 55%. By 2027, however, a number of economists began to insist that the President and the Libertarian's economic policies were only making the Depression worse, not better. Unemployment was still growing and had surpassed the levels of the first Great Depression, the financial sector was in ruins and in April of 2026 a report had come out that most of the American financial institutions were being subsidized by Chinese and European companies. Due to the tighter corporate control of the media that finally fell apart due to the mere lack of money from parent companies, much of this information was often buried by powerful interests in the hopes of keeping Narain in power. By election day, President Narain's approval ratings were in the low 30s and sometimes 20s. His efforts on civil liberties and keeping America were out of war were still regarded as the successes of his presidencies, but as was later quoted by former President Clinton on her 81st birthday, \"Its still the economy stupid .\" − − = = = = The Economy = = = = − Arguably the most dominant issue of the campaign was always at its core the economy; a subject where Governor Edwards was considered an expert. Of all of the candidates, Edwards' state was the only one not suffering major deficits or record unemployment, while President Narain's deregulatory policies were almost universally blamed for the Depression. Edwards took an early lead on economic issues and was never surpassed by any candidate during the campaign. − − For the first half of the campaign the equity crisis and the banking crisis dominated the debate, with Governor Edwards and Rodriguez scoring virtually equal points for their regulatory policy towards equity and their movement of their state's funds to credit unions and community banks. On these issues President Narain was seen as irrefutably a failure, as his support of Big Enough To Fail showed. − − During the later half of the economic debate the discussion shifted towards jobs. With a combined labor shortage for manufacturing jobs as well as mass layoffs for white collar workers, the US economy had reached a point of labor disparity that it had never known. President Narain argued for a more streamlined immigration process to bring in new workers to fill the manufacturing and unskilled labor shortage, which he argued would increase economic activity and spur the hiring of white collar workers. Governor Rodriguez concurred on this point, as did Governor Edwards. Edwards, however argued that the US government would have to fund new public works projects to direct the new flow of labor, as well as creating new jobs for white collar workers to fill. − − = = = = Populism vs. Capitalism = = = = − The 2028 presidential election is widely considered iconic for its debate on the economic system as a whole, and that for the first time in American history, a popular candidate was running against Capitalism. Charles Patrick Edwards was the only populist of the four candidates, and as the economic systems chief architect and governor of the first state to implement populist policies, he carried considerable weight as an economics expert. Every other candidate sided against Edwards on the issue, though Governor Rodriguez did state that she believed in certain principles of Populism could work in a Capitalist Economy. President Narain was the most vilament opponent to Edwards ideas on Economics, and for the majority of the campaign he focused on defending Capitalism. − − = = = Results = = = [[Category: Populist America]] [[Category: Populist America]] [[Category: Elections]] [[Category: Elections]] Latest revision as of 00:36, October 27, 2017 \"2024 2032' 2028 United States Presidential Election November 4, 2028 Nominee Andrew Louis Farkas Lucky Narain Party Independent Libertarian Home state Washington Virginia Running mate Ivory Toldson Ashley Reagan Electoral vote 424 28 States carried 38 + DC 6 Nominee <mark>Aaron Smith</mark> Marisol Rodriguez Party Republican Democratic Home state Michigan Texas Running mate Marco Rubio Beau Biden Electoral vote 29 72 States carried 4 5 coming soon President before election Lucky Narain Libertarian Elected President Charles Patrick Edwards Independent Retrieved from\" http: //future.wikia.com/wiki/2028_US_Presidential_Election_ (Populist_America)? oldid = 210741 \"Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected. Categories: Populist America Elections Outdated Articles Politics United States"}, {"articleID": "2013082909_00046406_W", "names": {"John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"]}, "date": "2013-08-28", "url": "http://www.wnyc.org/story/314909-50-years-after-march-on-washington-john-lewis-still-fighting/", "content": "Rep. <mark>John Lewis</mark>, D-Ga ., speaks Saturday at the Lincoln Memorial during activities to commemorate the 50th anniversary of the March on Washington. Fifty years ago Wednesday, <mark>John Lewis</mark> was the youngest speaker to address the estimated quarter-million people at the March on Washington. \"Those who have said be patient and wait - we must say that we cannot be patient,\" the 23-year-old chairman of the Student Nonviolent Coordinating Committee (SNCC) said that day. \"We do not want our freedom gradually. But we want to be free now .\" Aug. 28, 1963, also was the day the Rev. Martin Luther King Jr. gave his famous \"I Have A Dream\" speech, and few are as thoughtful about the significance of the day as <mark>Lewis</mark>, now a Democratic congressman from Georgia and civil rights icon. That summer, the nation had seen black children attacked by dogs and fire hoses in Birmingham, Ala., as well as the murder of NAACP field secretary Medgar Evers. In his 1963 speech, <mark>Lewis</mark> thundered: \"Where is the political party that would make it unnecessary to march on Washington?\" Lonnie Bunch, director of the National Museum of African American History and Culture, says <mark>Lewis</mark> originally planned to give a much angrier speech. \"Unlike all the other leaders there, <mark>John</mark>, coming out of the SNCC leadership, really experienced that violence,\" says Bunch. \"He experienced that violence as a Freedom Rider. He experienced that violence at the sit-ins. He found himself saying how crucial it was not to wait for freedom because waiting for freedom also meant that there would be years more violence .\" <mark>Lewis</mark> acknowledges that he did plan a more direct speech. \"I did say in my original text,\" Listen, Mr. Kennedy. Listen, Mr. President. Listen, members of Congress. You're trying to take the revolution out of the streets and put it in the courts. You tell us to wait. You tell us to be patient. We cannot wait .' \"Some thought the first draft of <mark>Lewis</mark>' speech was scary, so organizers convinced him to tone it down, Bunch says, for fear it could jeopardize the civil rights legislation President Kennedy was supporting .\" There's the fear that this version would not only alienate Congress, but it might alienate the potential middle America who might become supporters of this when it's seen as a moral issue, \"he says. <mark>Lewis</mark> is still fighting, he told a crowd Saturday during a march to commemorate the original demonstration 50 years ago .\" There are forces - there are people who want to take us back, \"he said .\" We cannot go back. We've come too far. We want to go forward. \"<mark>Lewis</mark> said he never thought 50 years later that some of the same issues would be back on the table .\" I thought we had completed the fight for the right to vote, the right to participate in the democratic process. I thought we were in a process of reforming the justice system. But when I see something like what the Supreme Court did, or what happened to Trayvon Martin, it tells me over and over again that we're not there yet. We have not finished. \"(<mark>Lewis</mark> was referring to the verdict in the killing of unarmed black teen in Florida, and the Supreme Court's decision in June striking down a key part of the Voting Rights Act of 1965 .) Two years after the 1963 March on Washington, <mark>Lewis</mark>' skull was fractured as he marched for voting rights in Alabama on what's known as\" Bloody Sunday. \"\"I got arrested 40 times during the '60s,\" <mark>Lewis</mark> reminded the audience Saturday, speaking from the steps of the Lincoln Memorial. \"Beaten and left bloody and unconscious. But I'm not tired. I'm not weary. I'm not prepared to sit down and give up. I am ready to fight and continue to fight, and you must fight .\" Looking back over 50 years, <mark>Lewis</mark> said it's \"almost too much to believe\" that an African-American president resides in the White House and can \"come and greet the participants that gather 50 years later\" at Wednesday's commemoration of the march. Register for your own account so you can vote on comments, save your favorites, and more."}, {"articleID": "2019091819_00257798_W", "names": {"Hugh Davidson": ["Q10391532", "Q28378513", "Q5930500", "Q5930507"]}, "date": "2019-09-18", "url": "http://www.mysuncoast.com/2019/09/18/florida-man-who-murdered-woman-raped-her-daughter-sentenced-death/", "content": "State Florida man who murdered woman, raped her daughter sentenced to death The State Attorney's Office in Jacksonville announced Donald <mark>Hugh Davidson</mark> Jr. had waived his right to a jury trial after pleading guilty to charges of first-degree murder, attempted sexual battery on a child over 12, lewd and lascivious molestation, kidnapping and grand theft. (Source: FDLE) By Associated Press | September 18, 2019 at 3:43 PM EDT - Updated September 18 at 3:45 PM MIDDLEBURG, Fla. (AP)--A Florida man has been sentenced to death for the murder of a 35-year-old woman and the sexual assault of her young daughter. The State Attorney's Office in Jacksonville announced Wednesday that Donald <mark>Hugh Davidson</mark> Jr. had waived his right to a jury trial after pleading guilty to charges of first-degree murder, attempted sexual battery on a child over 12, lewd and lascivious molestation, kidnapping and grand theft. State Attorney Melissa Nelson says the case \"shocked the conscience of Clay County .\" <mark>Davidson</mark> is a registered sex offender who was convicted in 2005 of lewd or lascivious molestation of a victim under the age of 12. Prosecutors said he entered Roseann Welsh's Middleburg home and strangled and stabbed her. <mark>Davidson</mark> then sexually assaulted Welsh's child and kidnapped her in the family's van. He later dropped her off at home. The Florida Times-Union reports <mark>Davidson</mark> knew Welsh's husband. Copyright Associated Press 2019. All rights reserved. 95"}, {"articleID": "2017030807_00471152_W", "names": {"Carlos Tavares": ["Q23905420", "Q2939466", "Q58621400"]}, "date": "2017-03-08", "url": "http://torquenews.com/comment/reply/29217#comment-form", "content": "General Motors Sells Opel, Vauxhall to Peugeot for $1.376 billion General Motors announced this morning that the company well sell the Opel and Vauxhall automotive operations in Europe and all of the accompanying assets with those brands including 11 production facilities and an engineering center to PSA--with a purchase price of 1.3 billion Euros or $1.376 billion US dollars. General Motors has long operated in Europe with their Opel and Vauxhall brands, but with today's announcement, it appears as though GM will focus their efforts on other markets. With the sale of both Opel and Vauxhall to the PSA Group. PSA is best known for their Peugeot and Citroen brands, and in adding Opel and Vauxhall, PSA will be Europe's second-largest automaker behind only Volkswagen Auto Group. \"We are proud to join forces with Opel/Vauxhall and are deeply committed to continuing to develop this great company and accelerating its turnaround. We respect all that Opel/Vauxhall's talented people have achieved as well as the company's fine brands and strong heritage,\" said <mark>Carlos Tavares</mark>, chairman of the Managing Board of PSA. \"We intend to manage PSA and Opel/Vauxhall capitalizing on their respective brand identities. Having already created together winning products for the European market, we know that Opel/Vauxhall is the right partner. We see this as a natural extension of our relationship and are eager to take it to the next level. We are confident that the Opel/Vauxhall turnaround will significantly accelerate with our support, while respecting the commitments made by GM to the Opel/Vauxhall employees .\" Selling Opel and Vauxhall While several outlets have incorrectly reported that PSA Group is paying General Motors $2.3 billion US dollars for the Opel and Vauxhall brands, there are actually two deals combined into that price. PSA is paying General Motors 1.3 billion Euros (about $1.376 billion US dollars) for Opel, Vauxhall and the assets associated with those two brands, which is the first part of the deal. The second part of the deal relates to GM Financial's European operations, which PSA is also buying for the price of roughly 900 million Euros, or $953 million USD. In total, GM is selling the majority of its European operations including their lending division, the Opel brand and the Vauxhall brand for 2.3 billion Euros or $2.434 billion US dollars--but buying the two brands technically only cost PSA $1.376 billion USD. The $1.376 billion purchase price of the Opel and Vauxhall brands include the intellectual properties of the two automotive brands, six assembly facilities, five component manufacturing facilities and one engineering center across Europe (GM will continue to operate their engineering center in Torino, Italy. PSA will gain roughly 40,000 employees through the acquisition of the two brands. \"We are very pleased that together, GM, our valued colleagues at Opel/Vauxhall and PSA have created a new opportunity to enhance the long-term performance of our respective companies by building on the success of our prior alliance\" , said Mary T. Barra, GM chairman and chief executive officer. What About the Cars? Many of the current Opel and Vauxhall vehicles are built on General Motors underpinnings with GM drivetrains, and under PSA, those models will continue to rely on GM technology such as the Opel Ampera-E, which we know as the Chevrolet Bolt. However, PSA will begin to work on replacements for the Opel and Vauxhall lineups using their own bits and pieces in the coming years."}, {"articleID": "2012062220_00015618_W", "names": {"Steve Martin": ["Q16473", "Q2347163", "Q48152466", "Q55085130", "Q55085225", "Q7613276", "Q7613279", "Q7613281", "Q7613283"]}, "date": "2012-06-22", "url": "http://amestrib.com/sections/entertainment/music/steve-martin-and-steep-canyon-rangers-come-central-iowa.html", "content": "contributed photo the steep canyon rangers, from left: mike guggino, graham sharp, woody platt, nicky sanders and charles r. humphrey iii. \"/> contributed photo the steep canyon rangers, from left: mike guggino, graham sharp, woody platt, nicky sanders and charles r. humphrey iii. the name <mark>steve martin</mark> is likely a familiar one in movies, television and music. but the bluegrass musicians backing <mark>martin</mark> on his tour are making a big name for themselves, too. the steep canyon rangers will perform alongside <mark>martin</mark> at the civic center of greater des moines on saturday, june 23. before the musicians were playing with <mark>martin</mark>, they were making music of their own. mike guggino, the group's mandolin player, has been with the band since it started over 10 years ago during the member's college days in north carolina. guggino, along with charles humphrey iii, woody platt, nicky sanders and graham sharp, formed the bluegrass band that would go on to produce multiple records over the years. though guggino was invited into a bluegrass band, he didn't get into the genre until college .\" woody and i grew up in western north carolina, so we were certainly surrounded by it but didn't grow up around it, \"he said. instead, guggino spent his earlier years listening to rock, jazz and classical music. guggino said the group got into bluegrass music at a high point in the genre's development .\" when we got into it, it was' o brother, where art thou', \"guggion said .\" it seemed like a lot of people were getting into it. \"now, guggino said more college bands have started playing bluegrass, and its popularity has grown with groups like the avett brothers and mumford and sons. despite the growing popularity of the genre, guggino said bluegrass as a whole still has plenty of classical style too .\" every genre will have people that are kind of purists. then you'll have folks that love that stuff, but want to expand it and add things to it, \"guggino said .\" there's a place for both. there's a lot of really traditional bands that are great, and there are some that have bluegrass instruments but are taking the music to bigger audiences. \"the steep canyon rangers are helping with that. for the last three years, the band has played on tour with comedian <mark>steve martin</mark>. together, they have toured every summer, and this year they are promoting their collaborative album,\" rare bird alert. \"the band first met <mark>martin</mark> through his wife, anne stringfield .\" we were friends with her through our guitar player, \"guggino said .\" she invited us over to dinner and to play, and we kind of hit it off. \"<mark>martin</mark>'s agent suggested he should go on tour with a backing band to promote his latest album at the time,\" the crow. \"since then, <mark>martin</mark> and the band have performed at big venues and festivals across the country. the group has played at the bonnaroo music festival and at the white house for the president and at\" a capitol fourth, \"pbs's annual fourth of july celebration on the national mall. but the steep canyon rangers are still solid when <mark>martin</mark> is away. the group recently released its latest album,\" nobody knows you, \"in april. the performances with <mark>martin</mark> and the band's solo work are\" definitely two different shows, \"guggino said .\" our solo show is all our music, and the show with <mark>steve</mark> is all his music, \"guggino said .\" with <mark>steve</mark>, there's obviously more comedy and banter. being who he is, there's quite a bit of comedy mixed in. \"but guggino said audience members can still expect a serious musical performance from <mark>martin</mark>, with a few funny songs throughout. with both the successful tour with <mark>martin</mark> and a solo album just released, guggino said the band's musical career is going strong in both aspects. though\" rare bird alert \"was just released, guggino said the group has already written several songs since then. he expects it\" won't be too long \"before the group is back in the studio, and he hopes to record something new with <mark>martin</mark> within the next year. <mark>steve martin</mark> and the steep canyon rangers when: 7:30 p.m. saturday where: civic center of greater des moines rules for posting comments comments posted below are from readers. in no way do they represent the view of stephens media llc or this newspaper. this is a public forum. comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. comment posters are solely responsible under the communications decency act for comments posted on this web site. stephens media llc is not liable for messages from third parties. ip and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. do not post: potentially libelous statements or damaging innuendo. obscene, explicit, or racist language. copyrighted materials of any sort without the express permission of the copyright holder. personal attacks, insults or threats. the use of another person's real name to disguise your identity. half off your ticket to knoxville raceway! for only $7.50 y.. . half off your ticket to knoxville raceway! for only $4 you...iowa school of rock amps up for new session ames pd officer drowns over the weekend suzanne schlunz, october 21, 1953 - june 15, 2012 officer drowned trying to help daughter"}, {"articleID": "2014011720_00029017_W", "names": {"Simon Cowell": ["Q162629", "Q7518530"], "Kate Middleton": ["Q10479", "Q17506155"], "Gerry Adams": ["Q5552631", "Q76139"]}, "date": "2014-01-17", "url": "http://www.belfasttelegraph.co.uk/entertainment/news/soderbergh-to-direct-moretz-in-play-29925251.html", "content": "President Barack Obama will call for the National Security Agency's ability to store phone data from millions of Americans to be ended. Kittens dumped in Christmas plastic bag find three new homes ALL they wanted for Christmas was a chance at life, but instead these three kittens were tied up in a plastic bag in west Belfast and left to die. Paisley: BBC buckles under DUP onslaught with last-minute changes made to interview The Ulster Bank Belfast Festival at Queen's may be over for another year, but the Belfast Telegraph - official media partner to the event - is proud to announce the results of its ever-popular Audience Award. Belfast Festival: Ten days of events that pushed the boundaries Lorraine Pascale serves up model cookery class Lorraine Pascale knows a fair few things about criticism. The model-turned-TV chef was once, of all things, accused of breaking a customer's pearly whites with a vanilla cupcake sold in her shop, The Cupcake Bakehouse, in central London. The 69-year-old radio presenter and singer lives near Mount Stewart, Co Down, with his wife Hilarym and they have two children, Jason (41) and Natalie (38). He hosts the afternoon show on Downtown Radio Is Hayley's suicide on Coronation Street a bid to boost ratings? /> Chloe Grace Moretz will star in The Library Chloe Moretz is set to make her stage debut in a production directed by DJ Travis \"fumbled girl on TOTP' Kanye moves ahead with Coinye suit Knightley wanted for Weinstein Co McElhone to take bunny boiler role The 16-year-old actress, who played gun-toting teen Hit-Girl in the Kick-Ass films, will star in a production of The Library at the Public Theatre in New York later this year. Oscar-winning filmmaker Soderbergh will be at the helm of the play. The Public Theatre site said of the production:\" After Caitlin Gabriel (Chloe) survives a deadly shooting at her high school, she struggles to tell her story to her parents, the authorities and anyone who will listen. But there are other narratives that gain purchase in the media and paint her in a different light. \"Rory McIlroy: I was sweating, but I'd an idea Caroline Wozniacki would say\" yes' to marriage proposal <mark>Simon Cowell</mark> and David Walliams Belfast-bound for Britain's Got Talent auditions in Waterfront Hall McElhone to take bunny boiler role Top 10 books to help you keep New Year resolutions Old school pictures: <mark>Kate Middleton</mark> <mark>Gerry Adams</mark>, Liam Neeson, Eamon Holmes...new A teenage pop music fan has told a court how DJ Dave Lee Travis \"had a fumble\" up her skirt as he presented an episode of Top Of The Pops. new A New York judge has said Kanye West's lawyers can do the research necessary to learn the identities of the creators of digital currency called Coinye West. new Keira Knightley was asked to be the face of the Weinstein Company, it has been revealed. new Reggae musicians look set for a showdown over the use of the name UB40 after former members of the band announced they were adopting it, despite a rival camp already touring and recording with the title. new A New York judge has said Kanye West's lawyers can do the research necessary to learn the identities of the creators of digital currency called Coinye West. new Sophie Ellis-Bextor has revealed that her jaunts to Eastern Europe inspired her new album Wanderlust. new Darren Aronofsky will not direct spy thriller Red Sparrow, it has been reported. new Keira Knightley was asked to be the face of the Weinstein Company, it has been revealed. new Chloe Moretz is set to make her stage debut in a production directed by Steven Soderbergh. new Natascha McElhone is to play the bunny boiler role made famous by Glenn Close in the first stage adaptation of hit film Fatal Attraction. Joris Minne: Rhubarb, Wellington Place, Belfast Rhubarb restaurants and their Barbie-pink graphics have been popping up around Belfast like a bright rash. There's one in Little Victoria Street next to the reptile shop. On the other side of the snakes is Ginger which completes the cartoon joke neatly. Joris Minne: Custom House Restaurant, Londonderry The Derry/Londonderry culinary king is Ian Orr. His two restaurants, Brown's in the Waterside and Brown's in Town in Strand Road, are both excellent, the latter being more a populist, brasserie version of the fine diner across the Foyle. The rolling stone of the restaurant world has struck again with another wacky name. Will we ever tire of Bill Wolsey's indefatigable appetite for strange, earthy names and bad spelling? Never! Who could not love the nutty Goat's Toe, the Cloth Ear or the Bishop's A ** e? (I made the last one up). By using this website you consent to our use of cookies. For more information on cookies see our"}]