[{"articleID": "2019061722_00089012_W", "names": {"Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"]}, "date": "2019-06-18", "url": "http://home.nzcity.co.nz/news/article.aspx?id=292244&fm=psp,tst", "content": "Home> News> Entertainment <mark>Chris Martin</mark> has reportedly split from Dakota Johnson The 42-year-old musician - who was previously married to Gwyneth Paltrow - has told friends that he's no longer in a relationship with Dakota, who is best-known for starring in the \"Fifty Shades' movies 18 June 2019 A source told The Sun newspaper:\" <mark>Chris</mark> and Dakota were very easygoing and always seemed really happy together. \"There was talk of engagement but now he says they have gone their separate ways, which has come as a real surprise to everyone.\" The high-profile duo dated for 20 months and had previously discussed tying the knot. Last year, an insider described their romance as \"serious\" . The source shared: \"They will probably get married. It's serious.\" <mark>Chris</mark> (likes that) she doesn't thrive on the spotlight and is very understated. \"Meanwhile, Gwyneth previously revealed plans to write a book about her experiences of divorce. The Oscar-winning actress - who is now married to Brad Falchuk - went through a divorce from the Coldplay frontman in 2016 and she now wants to pen a tome about her experiences with <mark>Chris</mark>, because she thinks their bond is special. Gwyneth - who has kids Apple, 15, and Moses, 13, with <mark>Chris</mark> - said:\" Both <mark>Chris</mark> and I have made a commitment to continue to love the things about each other that we've always loved and to really continue to develop our friendship and to find ways to continue to communicate. There's been a long process to it. \"At some point maybe I'll write a book, because you really have to focus on forgiveness and spite that comes up; you have to let it go.\" "}, {"articleID": "2015021205_00047684_W", "names": {"Jackie Robinson": ["Q1631748", "Q3805723", "Q731871"], "Brandon Green": ["Q3445712", "Q4956876"], "Frank Thomas": ["Q16091336", "Q16106478", "Q3082827", "Q3082840"], "David Axelrod": ["Q1251914", "Q519838"]}, "date": "2015-02-12", "url": "http://news8000.com/news/us-little-league-champs-lose-title/31212778", "content": "Published On: Feb 11 2015 10:10:55 AM CST But now those feelings, like the championship, are no more. Little League International announced Wednesday that it is vacating all of the <mark>Jackie Robinson</mark> West squad's wins from last year's tournament, including from the Great Lakes regionals and U.S. championship, because some of its players lived outside its assigned boundaries. Mountain Ridge Little League, out of Las Vegas, officially becomes the 2014 U.S. champ in its place. The international youth baseball organization also suspended <mark>Jackie Robinson</mark> West's manager, ousted the local district administrator and barred the program from tournament play. Reflecting on what he called \"a heartbreaking decision,\" Little League International President Stephen Keener said the Chicago team's players can still be proud of what they accomplished last year. \"But it is unfortunate that the actions of adults have led to this outcome,\" Keener added. \"...As painful as this is, we feel it a necessary decision to maintain the integrity of the Little League program. No team can be allowed to attempt to strengthen its team by putting players on their roster that live outside their boundaries.\" <mark>Brandon Green</mark>, a player on the <mark>Jackie Robinson</mark> West team, said the players weren't involved in anything that should cause the squad to be stripped of its title. \"We know that we're champions, our parents know that we're champions...and Chicago knows we're champions,\" he said at a news conference. Chicago Mayor Rahm Emanuel called Keener and the two spoke for 10 minutes, a spokeswoman for the mayor, Kelley Quinn, said. Emanuel told the Little League official that the players didn't deserve to be punished. The organization should have sanctioned the adults, he said. \"You have turned them into the perpetrators when they are the victims,\" Emanuel told him, according to his spokeswoman. \"You know what they have done for Chicago, and let's face it, you know what they've done for your tournament.\" Named for the icon who broke baseball's color barrier and consisting entirely of African-Americans, the <mark>Jackie Robinson</mark> West squad proved that, despite talk to the contrary, baseball was not dead among inner-city youth. The Illinois team earned raves after knocking out Sports Illustrated cover girl Mo \"ne Davis' Philadelphia team and rolling to the U.S. championship contest. It entered that game as an underdog to Las Vegas, which had beaten every team it faced--including crushing Chicago by a 13-2 score. The title game was a much more even affair. The two squads swapped leads before Chicago jumped ahead for good with a three-run fifth inning en route to a 7-5 win. In the World Series final the following day, <mark>Jackie Robinson</mark> West rallied late but couldn't overcome the eventual champions from South Korea. That loss didn't halt the positive feelings about the team. Everyone from former Chicago White Sox great and baseball Hall of Famer <mark>Frank Thomas</mark> and longtime Obama adviser <mark>David Axelrod</mark> cheered their success. Emanuel credited\" their positive attitude and success on the field (for rallying) people from every neighborhood. \"The team was celebrated with a parade through their hometown and even a visit to the White House in November, where they met President Barack Obama, a Chicago resident. At the time of the Washington visit, local Little League officials were already investigating thanks to a tip from a neighboring district's official and documentation. Little League International initially determined that all of <mark>Jackie Robinson</mark> West's players were eligible. In the middle of December, though,\" Little League began to learn of multiple issues with boundary maps and operational process with multiple leagues in Illinois District 4, \"the international organization said in a statement. Several more meetings followed, including one on January 31 when several issues came up, including that\" <mark>Jackie Robinson</mark> West Little League used a falsified boundary map for their 2014 tournament and that <mark>Jackie Robinson</mark> West Little League officials met with other leagues in District 4 to try to get the territory they wrongfully claimed was theirs for their 2014 tournament. \"\"During our review, it became clear that both <mark>Jackie Robinson</mark> West officials and (the) District Administrator...signed documents to make players eligible who should not have been,\" Keener said. UP NEXT / / La Crosse police: Lock your doors Please set an email address for your profile. To complete your registration on this site, please supply an address."}, {"articleID": "2010021209_00059734_W", "names": {"Bob Boyer": ["Q4588776", "Q4931901"]}, "date": "2010-02-12", "url": "http://citizensvoice.com/news/wyoming-borough-will-host-kingston-k-9-fundraiser-1.613554?localLinksEnabled=false", "content": "officials in wyoming borough will join supporters of the kingston police k-9 unit tonight for a fundraiser at bo brother's restaurant, wyoming avenue in wyoming. kingston borough police are trying to raise money to purchase a new k-9 to replace sax, a german shepherd who will be retired after serving on the force for nearly 10 years. the event will take place between 5 and 7 p.m. the donation is $5 and free pizza will be available. the public is welcome to attend. additional donations are welcome and can be made payable to the kingston police k-9 unit. \"any k-9 on the west side of the river is an asset here. we want to help them raise some funds,\" wyoming borough mayor <mark>bob boyer</mark> said."}, {"articleID": "2019061616_00208027_W", "names": {"Paul Kelly": ["Q14913044", "Q2060579", "Q25190216", "Q2682390", "Q6382232", "Q7151728", "Q7151729", "Q7151730", "Q7151731", "Q7151732", "Q7151737", "Q7151738", "Q952656"]}, "date": "2019-06-16", "url": "http://www.eppingforestguardian.co.uk/news/national/17709913.police-launch-murder-probe-after-glasgow-death/", "content": "Police launch murder probe after Glasgow death By Press Association 2019 Police 0 comment A murder investigation has been launched after the death of a man in Glasgow. <mark>Paul Kelly</mark> was found with serious injuries in Hermitage Avenue, Knightswood, around 10am on Saturday. Emergency services attended however the 50-year-old died at the scene. His relatives have been made aware and a report will be sent to the Procurator Fiscal. Officers say a 46-year-old man has been arrested in connection with the death. Murder Inquiry Launched--Knightswood Police are treating the death of <mark>Paul Kelly</mark> (50) who died in Knightswood on Saturday 15 June 2019 as murder. A 46-year-old man has been arrested bot not charged at this time. Police enquiries continue. https: //t.co/oULe3UqDJn--GreaterGlasgPolice (@ GreaterGlasgPol) June 16, 2019 However he has not been charged and police inquiries are continuing. Detective Inspector Steven Elliot said: \"A man has lost his life in what I can only describe as a very violent attack.\" We are still trying to establish exactly what happened yesterday in Hermitage Avenue but are keen to speak to anyone who saw a man in the vicinity around the time Mr <mark>Kelly</mark> was assaulted. \"This man is described as white, in his 40s, around 6ft tall, slim build and was wearing a black jacket and carrying a large orange carrier bag.\" Anyone who may have seen this man or has any other information that could assist our enquires is asked to contact police at Govan CID via telephone number 101 quoting incident number I314 of 15 June 2019. \"0 comment"}, {"articleID": "2015032315_00021719_W", "names": {"Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"]}, "date": "2015-03-23", "url": "http://timesrecordnews.com/newsy/millions-of-computers-vulnerable-to-twominute-attack", "content": "Photo Credit: happyhappyjoyjoy / CC BY NC SA 2.0 Security researchers are definitely earning their keep. According to a report by Wired, researchers at a digital security conference Friday revealed a difficult-to-detect BIOS attack called LightEater that leaves YouTube / hdgadget) When you turn on your computer, the BIOS - which stands for basic input/output system - helps your computer get going. It loads up your operating system - like Microsoft Windows - and helps the computer communicate with the stuff you've plugged into it: the display, the keyboard, the mouse, etc.. The hack works by infecting this basic input/output system. It's particularly worrisome because software designed to protect your computer from viruses doesn't typically scan the BIOS; it scans the operating system loaded by the BIOS. So if hackers can infect the BIOS, they are - in theory - capable of loading malware onto your system undetected. And here's the kicker, via Wired: \"The vulnerabilities...were so easy to find that they wrote a script to automate the process and eventually stopped counting [them] because there were too many.\" The problem is people aren't updating their BIOS when manufacturers make updates available. That leaves dozens of openings for hackers, which result in millions of vulnerable computers. \"To check the setup version from Windows, go to the Start screen and type\" msinfo32 .' Click \"msinfo32,' and the System Information window will open.\" Yeah, that was just a few seconds of a The Register spoke to the lead researchers who discovered these vulnerabilities. The duo hopes to essentially shock governments, businesses and users into action by showing just how simple it is to gain nearly unprecedented access to millions of computers - especially now that DEFCONConference / CC BY 3.0) \"The research pair says the attacks should serve as a boot in the arse for governments and corporations to apply BIOS patches if only to make life more difficult for less-resourced hostile spy agencies.\" Woolly mammoth DNA added to elephant cells Supreme Court won't consider Wis. voter ID law Vin Diesel names daughter after <mark>Paul Walker</mark> Packing peanuts key to fast-charging batteries"}, {"articleID": "2013042704_00021761_W", "names": {"Michael Jacobs": ["Q28043408", "Q3308269", "Q6831573", "Q6831577"]}, "date": "2013-04-27", "url": "http://newsobserver.com/2013/04/27/2852821/barry-jacobs-orange-county-balancing.html#storylink=rss", "content": "orange county balancing competing issues well regarding the april 21 point of view piece \"a paler shade of orange\" : apparently <mark>michael jacobs</mark> has chosen to use statistics to reinforce what he already thinks even if the facts don't fit his assertions. to read his piece, one would believe orange county is a willfully elitist outlier in north carolina, promulgating policies that drive away people of color and expend tax dollars to no particular purpose. the professor takes pains to identify a decline in the county's african-american population over the last decade, throws together a hodgepodge of other stats and concludes that \"a community that preaches social inclusion enacts policies of economic exclusion.\" he conveniently fails to mention that, in the span of a decade governed by orange county's supposedly anti-inclusionary policies, its asian population nearly doubled, its \"hispanic or latino\" population (census terms) more than doubled and the percentage of white population decreased. that must mean our policies aren't a barrier to inclusion after all. as for where all that tax revenue goes, orange is among state leaders in the percentage of the county budget devoted to public education. despite sustained enrollment growth in both of our excellent school systems, and a continued decline in school construction funds from the state, we've kept up with providing the high-dollar school buildings necessary to accommodate reasonable class sizes. we are careful stewards of taxpayer dollars. we have a rigorous policy limiting debt and a strong fund balance, resulting in one of the highest bond ratings of any county in north carolina. and we haven't raised property taxes in four years. we know our poverty rate and cost of living remain too high, situations we're addressing in the face of historical, political and market-based forces we often cannot control. even in these anti-tax times, a healthy debate can be had regarding the limits and merits of public spending and government policy. but <mark>jacobs</mark> seems more eager to paint orange county leaders as business and social bogeymen (and women) than to grasp current realities or to appreciate the complexities of balancing competing local imperatives in an era of shrinking resources. chairman, orange county commissioners, the length limit was waived to provide a fuller response to the point of view .> apps and services for tablet devices> apps and services for your mobile phone> get updates via facebook and twitter> your daily paper delivered to your computer"}, {"articleID": "2013012023_00007696_W", "names": {"Mike Fisher": ["Q172357", "Q6846825", "Q945715"], "Tim Sullivan": ["Q16122829", "Q17033913", "Q466552", "Q59368830", "Q7804357", "Q7804358"]}, "date": "2013-01-20", "url": "http://courier-journal.com/article/20130120/COLUMNISTS1802/301200045/1011/rsslink", "content": "a still-popular barack obama took the presidential oath of office for a second term on sunday,...small city stands tall with ordinance protecting gays and lesbians with a population of 334, the eastern kentucky community of vicco may be the smallest town to take...louisville volunteer medical group to provide care to the needy in nicaragua auburn pulled out all the stops for the visiting university of kentucky basketball team on saturday...trinity beats ballard 53-52 for lit title on last-second free throw as if state football champion, mr. football and u.s. a roundup of martin luther king jr. day closings in kentucky. a roundup of sales by insiders at selected companies. website highlights five must-see attractions for the next three months didn't travel much last year? didn't take a vacation at all? make a positive change right now by...jessica pollio is especially a fan of fashions that meet two criteria: on trend, but still...jennifer lawrence hosted \"saturday night live' over the weekend, but before making her\" snl' debut,...nicole scherzinger's latest single, \"boomerang,' is being launched this week in the united kingdom...\"the american dream,\" martin luther king jr. make no mistake, carrie underwood's hubby, <mark>mike fisher</mark>, is no mr. underwood. the singer says her husband gets upset when the media refer to him by her last name. \"it made me feel awful,\" the country music superstar says in the february issue of allure magazine. \"somebody works real hard to make a name for themselves, a respectable name, and then it's\" mr. underwood .' \"mitch mcconnell vows to block president obama's gun control initiatives <mark>tim sullivan</mark> | peyton siva knows that this pass, too, shall pass no. 1 is done: late louisville turnover opens door for syracuse win, 70-68 the buzz | jennifer lawrence to host\" saturday night live' this weekend the buzz | jennifer lawrence explains meryl streep comment in golden globes speech the buzz | it's <mark>mike fisher</mark>, not \"mr. underwood' make no mistake, carrie underwood's hubby, <mark>mike fisher</mark>, is no mr. underwood. investigations with impact: the heart of the courier-journal mission is public service journalism. daily, we print and put online the watchdog stories that significantly affect you. mitch mcconnell vows to block president obama's gun control initiatives <mark>tim sullivan</mark> | peyton siva knows that this pass, too, shall pass no. 1 is done: late louisville turnover opens door for syracuse win, 70-68 a hoax most cruel: caller coaxed mcdonald's managers into strip-searching a worker become a subscriber today to enjoy these benefits: ipad-optimized edition mobile site & iphone app are you currently a subscriber? set up your digital access now. you now have full access. thank you for subscribing. access the tablet-optimized site, mobile site and iphone app share your access with any friend or family member subscriber exclusive top 5 daily email newsletter create an account or if you have a digital profile to continue using your current web browser, adobe flash must be installed or upgraded:"}, {"articleID": "2019112520_00013787_W", "names": {"Ryan Reynolds": ["Q192682", "Q7384463"], "Tracy Morgan": ["Q14542", "Q27119857"]}, "date": "2019-11-25", "url": "http://www.thehour.com/entertainment/article/Ryan-Reynolds-Acquires-Ownership-Stake-in-14861557.php", "content": "https: //variety.com/2019/digital/news/ryan-reynolds-acquires-mint-mobile-stake-1203415791/ <mark>Ryan Reynolds</mark> Acquires Ownership Stake in Wireless Carrier Mint Mobile Todd Spangler, provided by Published 2:36 pm EST, Monday, November 25, 2019 Photo: Charles Sykes/Invision/AP / Shutterstock Photo: Charles Sykes/Invision/AP / Shutterstock Image 1 of / 1 Caption Close Image 1 of 1 Photo: Charles Sykes/Invision/AP / Shutterstock <mark>Ryan Reynolds</mark> Acquires Ownership Stake in Wireless Carrier Mint Mobile 1 / 1 Back to Gallery \"Deadpool\" star <mark>Ryan Reynolds</mark> has taken on a new gig as part owner--and pitchman--for low-cost mobile carrier Mint Mobile. Mint Mobile, whose prepaid plans start as low as $15 per month for 3 gigabytes of wireless data, announced that <mark>Reynolds</mark> purchased an ownership stake in the company. The Costa Mesa, Calif.-based company did not disclose the size of <mark>Reynolds</mark>' investment. More from Variety \"Saturday Night Live': <mark>Ryan Reynolds</mark> and <mark>Tracy Morgan</mark> Join Will Ferrell's Monologue (Watch)\" Joker' Passes \"Deadpool 2' to Become the Highest-Grossing R-Rated Movie <mark>Ryan Reynolds</mark>, John Krasinski in Talks for\" Imaginary Friends' Movie Mint Mobile is a \"virtual\" wireless carrier whose service runs on T-Mobile's nationwide network. In connection with the investment, <mark>Reynolds</mark> will \"help with Mint's communications and marketing efforts as well as strategic decision-making,\" according to the company. \"Celebrities generally invest in high-end products like skincare brands or delicious gin companies,\" <mark>Reynolds</mark> said in a statement. \"Yet Mint is making wireless way more affordable at a time when the average American is paying $65 a month. I'm excited to champion a more practical approach to the most essential technology.\" Mint Mobile was previously a division of UVNV Inc., doing business as Ultra Mobile, a virtual wireless provider founded by telecom exec David Glickman in 2012. UVNV recently spun off Mint Mobile as a standalone entity. <mark>Reynolds</mark> tweeted about his stake in Mint Mobile Monday: Related Stories \"Saturday Night Live': <mark>Ryan Reynolds</mark> and <mark>Tracy Morgan</mark> Join Will Ferrell's Monologue (Watch)\" Joker' Passes \"Deadpool 2' to Become the Highest-Grossing R-Rated Movie <mark>Ryan Reynolds</mark>, John Krasinski in Talks for\" Imaginary Friends' Movie Newest @ _MintMobile customer. Also, owner of the company. To keep things above board, I'll be paying myself $15 a month. #MintOwner pic.twitter.com/hrzd8t8T2H--<mark>Ryan Reynolds</mark> (@ VancityReynolds) November 25, 2019 It's not the first business venture for <mark>Reynolds</mark>: Last year, he acquired Portland, Ore.-based Aviation Gin. <mark>Reynolds</mark> recently inked a promotional pact with Samsung and Netflix, tied to Netflix's upcoming \"6 Underground\" original film, with an ad-within-an-ad-within-an-ad campaign telling fans that the best way to watch movies at home is on Samsung's QLED TVs (along with some Aviation Gin). <mark>Reynolds</mark> is repped by WME and the law firm Sloane, Offer, Weber and Dern. Sign up for Variety's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2013103013_00026998_W", "names": {"Adam Levine": ["Q219631", "Q37840339", "Q4679401"]}, "date": "2013-10-30", "url": "http://www.today.com/entertainment/voice-bromance-blake-shelton-snuggles-adam-levine-8C11493379", "content": "NBC <mark>Adam Levine</mark> cozies up to Blake Shelton on \"The Voice.\" \"The Voice\" bromance between Blake Shelton and <mark>Adam Levine</mark> is hotter than a steaming mug of cocoa. Thank Team CeeLo's Caroline Pennell for bringing out the country superstar's softer (stranger?) side. After her knockout battle with George Horga Jr., Blake began his critique by noting that George was flat throughout. And then...\"Caroline makes me want to buy a cat and a pink blanket,\" Blake said. Most viewers probably did a spit-take with their soda, or at least wondered if they understood correctly. But not his fellow coaches, who didn't seem surprised. \"That's not Caroline who wants to do that,\" <mark>Adam</mark> interrupted. Blake kept going: \"...and build a little fire in the house, and just curl up with a cup of hot chocolate...\"\"And <mark>Adam</mark>,\" Christina Aguilera said. \"With <mark>Adam</mark>,\" Blake agreed. Sound like something that's been discussed previously? Apparently so. \"He said the same thing when he met me,\" <mark>Adam</mark> warned Caroline. \"I've heard it all before.\" Which might well be true. Indeed, the bromance got going earlier in the evening, after Blake praised Ray Boudreaux's performance. \"Ray, you remembered to take out a couple of words,\" commended his coach. \"It allowed you to take that one last breath going into those big things you did at the end, and you did it. And I'm jealous. I wish I could do that. It's studly.\" \"It's OK, Blake,\" <mark>Adam</mark> said. \"I think you're studly. I really do.\" \"Thank you, because Ray makes me feel like less of a man,\" Blake said. It's only October, NBC. There's still time to make that into a holiday special. Blake and <mark>Adam</mark>, a roaring fire, a bottle of wine and some traditional music. Who wouldn't watch \"Blake and <mark>Adam</mark>'s Bromantic Christmas?\" Then again, Blake might have some competition, if the #AdamTina folks get their way. As the coaches were walking towards their seats, <mark>Adam</mark> made a proposal. \"I'm gonna join Christina's team. Can I be a contestant?\" \"AdamTina?\" Christina said. \"Yeah, I think we could do it together,\" <mark>Adam</mark> said. The Internet would be overjoyed. But alas. Christina had her arm around CeeLo Green at the time, so it looked like a guy hitting on a girl in front of her boyfriend, which was reinforced later in the show when the four were, again, walking to their seats and talking the various steals. \"I wish I could steal your heart, Christina,\" CeeLo said. \"You already have it,\" Christina said. So to recap: Blake likes <mark>Adam</mark>. <mark>Adam</mark> likes Blake and also likes Christina. Christina maybe likes <mark>Adam</mark> and definitely likes CeeLo. CeeLo likes Christina."}, {"articleID": "2019121400_00018808_W", "names": {"Anthony Smith": ["Q16197257", "Q20640889", "Q27838053", "Q2852962", "Q2852963", "Q4773483", "Q4773484", "Q4773486", "Q4773487", "Q4773488", "Q4773489", "Q7823446", "Q7823448"], "Robert Nisbet": ["Q16292939", "Q21999572", "Q7348044"]}, "date": "2019-12-14", "url": "http://brentwoodweeklynews.co.uk/news/national/18101485.new-train-timetable-will-add-1-000-weekly-services/", "content": "New train timetable will add 1,000 weekly services By Press Association 2019 Great Western Railway is making the biggest timetable change on its network since the 1970s (GWR/PA) 0 comment Britain's railways will undergo a major timetable change on Sunday including the first non-stop trains between London and Bristol in decades. Journey times will be cut, frequencies increased and new routes added across the country following infrastructure investment and upgraded carriages. Industry body the Rail Delivery Group (RDG) said the new timetable change will feature 1,000 extra weekly services, on top of the 4,000 introduced over the past two years. Train timetables are changed twice a year, in May and December. The launch of the May 2018 timetables saw services crippled in parts of the North and the South East, with blame attributed to Network Rail, train operators and the Government. <mark>Anthony Smith</mark>, chief executive of the passenger watchdog Transport Focus, said: \"This time around passengers need the rail industry to deliver a smooth set of timetable improvements--so they can reliably use both new and existing services.\" Many passengers should have a greater choice of services with more seats as result of these changes. However, there will also be some who lose out with fewer or slower services. \"Train companies must have plenty of visible staff on hand to guide passengers, to answer questions on how these changes will affect them, and to explain what travel choices they have.\" The RDG sought to reassure passengers over the upcoming timetable, stating that the industry has put \"years of work into drafting, consulting and planning for these changes\" . <mark>Robert Nisbet</mark>, the organisation's director of nations and regions, urged passengers to check their journey details in advance as many times are changing. He added: \"Train operators and Network Rail will be working together to run a reliable service and respond quickly to any teething problems as people get used to the change.\" Sunday will see the biggest timetable change on the Great Western Railway network since the 1970s, taking advantage of Network Rail's electrification of the line between London and Bristol, and the operator's new intercity express trains. Non-stop trains between London Paddington and Bristol Parkway will have journey times as short as one hour and eight minutes, shaving 12 minutes off the existing quickest services. Fastest journey times between the capital and Bristol Temple Meads--near the centre of the city--will be cut by 17 minutes to one hour and 19 minutes. The frequency of trains on this routes will be increased from two per hour to three during the morning and evening peaks. There will be major improvements on the ScotRail network, with additional services in north-east Scotland and extra seats between Edinburgh and Glasgow. A new station, Robroyston, will open in north-east Glasgow on the line between Queen Street and Cumbernauld. Other operators introducing new services are Greater Anglia, London North Eastern Railway, Northern, TfL Rail, Thameslink, Transpennine Express (TPE), Transport for Wales, West Midlands Railway and London Northwestern Railway. TPE admitted last week that the frequency of its new direct Liverpool-Edinburgh trains will initially be lower than the planned hourly service. The firm blamed a maintenance backlog and infrastructure problems for delaying crew training, as well as the late delivery of new trains. 0 comment"}]