[{"date": "2017-08-30", "url": "http://brownsvilleherald.com/business/article_f94c946e-8d9f-11e7-8113-339e9f6364b5.html", "content": "Brownsville port signs MOU; Mission part of economic development agreement - Brownsville Herald: Business Los Fresnos Consolidated Independent School District trustees approved a $114.3 million budget that includes the same tax rate as last year and a 3 percent raise for all employees at a meeting Monday in Los Fresnos. Posted: August 29 CALAR ALTO, Spain (AP)--Chris Froome increased his lead of the Spanish Vuelta on Wednesday, finishing second in the mountainous 11th stage behind Astana rider <mark>Miguel Angel Lopez</mark>. Updated: 11:31 am Port of Brownsville logo Posted: Wednesday, August 23, 2017 10:05 pm Brownsville port signs MOU; Mission part of economic development agreement BY <mark>STEVE CLARK</mark> STAFF WRITER Brownsville Herald Officials from the Brownsville Navigation District and Mission Economic Development Corporation have signed a memorandum of understanding to collaborate on international trade opportunities with Mexico and other economic development projects. The legally nonbinding agreement signals that the parties aim to \"work to connect and grow business between the Mission Business Park and the Port of Brownsville,\" according to an official statement. Patty Gonzales, the port's director of communications, said that although the MOU is nonbinding, it does indicate and \"seriousness and mutual respect .\" \"While the port has long worked with all chambers and EDCs up and down the Valley, this just kind of defines our relationship a little bit more,\" she said. \"Where it makes sense we'll share information that pertains to economic development in the region, not just economic development for Mission or the Port of Brownsville, but up and down the Valley .\" The port, which already has ties with economic development organizations in Cameron County, made overtures to EDOs across the Valley and Mission was the first to respond, Gonzales said. She cited Southwest Steel Coil, a Mission-based company that imports steel through the port, as one instance of the cross-Valley bond. \"That's one example of how we work together,\" Gonzales said. \"This is really the port working to fulfill its regional potential. The Port of Brownsville is the Valley's port .\" Teclo Garcia, Mission EDC's director of strategic partnerships, said his organization and the port had been talking for some time about coordinating, which makes sense given the asset of Hidalgo County's international bridges. \"We can try to drive traffic to the port and vice versa,\" he said. Garcia said having a deepwater port just down the road is an effective tool for recruiting companies to the business park. \"Especially when you're talking to a bigger factory or company that needs deepwater port access, they ask those kind of questions: What kind of interstate access to do you have? Do you have a port nearby? We haven't had the occasion yet but we hope to be able to use that,\" he said.", "articleID": "2017083016_00680717_W", "names": {"Steve Clark": ["Q1370741", "Q20676404", "Q3431192", "Q3499197", "Q7612213", "Q7612214", "Q7612215"]}}, {"date": "2017-08-31", "url": "http://www.edmontonsun.com/2017/08/31/princess-dianas-final-hours-dodis-yacht-a-ritz-suite-a-diamond-ring-and-relentless-photographers", "content": "Princess Diana death photo to be shown at Cannes The last day of Princess Diana's life began on the top deck of her lover's yacht, with croissants and fresh jams. Diana and her beau, Dodi Al Fayed, sipped their coffee marveling at the breathtaking Emerald Coast in Sardinia. Diana took hers with milk. Fayed took his black. There were kiwis, too. \"They were in a good mood,\" his butler remembered later. \"They were always laughing, holding hands .\" Their romance was a whirlwind - passionate, thrilling, scandalous. Fayed, the son of Harrod's department store owner Mohamed Al-Fayed, was a rich playboy. Diana, divorced from Prince Charles after he cheated on her, was the mother of the future king of England and the most photographed woman in the world. That Saturday - Aug. 30, 1997 - promised to be a moment of change. The princess knew it. She snuck a call to Richard Kay, a friend who covered the Royals for the Daily Mail, and told him, as he later wrote, \"she had decided to radically change her life .\" \"She was going to complete her obligations to her charities,\" Kay continued, \"and then, around November, would completely withdraw from her formal public life .\" Diana had not told Kay why, but he had a hunch: \"They were, to use an old but priceless cliche, blissfully happy. I cannot say for certain that they would have married, but in my view it was likely .\" In the 20 years since she's been gone, there have been countless revisions to this love story. Her friends and relatives: They weren't in love! His friends and relatives: They were in love! Last week, in the Daily Mail, Kay published an article with this headline: \"Was Diana about to dump Dodi?\" In it, he quoted Diana's private secretary saying she'd planned to return home after becoming bored with Fayed. \"It's very much a personal view,\" the secretary said, \"but I don't think she would have seen Dodi again once she got back .\" Whatever the case, Fayed wanted to propose that fateful night. It was summer. As they were on holiday, Britain announced plans to invite the Irish Republican Army for peace talks. Conspiracies theories about the suicide of Vincent Foster, President Bill Clinton's lawyer, were spreading. Israel and Lebanon were sparring with one another. Fayed's primary concern was the six-figure diamond ring waiting in Paris. People close to Fayed said the couple picked it out a week earlier even though they had been dating less than a month. The danger of their relationship wasn't its brevity. To royal watchers, to Buckingham Palace, and no doubt to the British tabloids whose photographers were hounding them, the threat was something the couple apparently had not yet considered, even as rumors swirled that Diana was already pregnant. \"For the mother of the future king of England to bear the child of a Muslim Arab, a child who would be the half sibling of the heir to the throne, would be embarrassing in the eyes of the royal family and the ruling Establishment,\" former Time magazine reporters Tom Sancton and <mark>Scott MacLeod</mark> wrote in their book, \"Death of a Princess .\" Fayed's calendar that day had just one entry - at 6:30 p.m., he was to pick up the ring at a store near his father's hotel in Paris, The Ritz. They left the boat for Fayed's plane around 11:30 a.m., taking along the butler and a masseuse for Fayed's painful back. As soon as they landed in Paris, Fayed saw the paparazzi out his window. \"Dodi did not want this special occasion ruined by a bunch of a shutter-happy cowboys trying to corral them on motorcycles and shoving lenses in their faces,\" the ex-Time reporters wrote. \"As soon as the door opened, cameras started clicking .\" The aggressiveness of the photographers - and their sheer numbers - would increase as the day progressed. Diana and Fayed arrived at The Ritz in the late afternoon. She went to the salon for a hair appointment. He went to the jeweler. The couple then rested in the hotel's Imperial Suite before going to Fayed's apartment to get dressed for dinner. She checked in with her children, who were in Scotland with Prince Charles and the queen. \"On that Saturday evening, Diana was as happy as I have ever known her,\" her friend Kay wrote in the Daily Mail. \"For the first time in years, all was well with her world .\" They left for Fayed's apartment around 7 p.m., trailed by photographers. More were waiting at the building's front door when they arrived. Fayed fumed. There was an ugly shoving match. Once inside, Fayed pulled his butler aside, telling him about his plan to propose that night. \"The ring was on the nightstand in his bedroom,\" author <mark>Christopher Anderson</mark> wrote in \"The Day Diana Died .\" \"Dodi had checked to make sure they had several bottles of Dom Pérignon on ice for the big moment .\" But dinner was a bust. The first restaurant they tried - Chez Benoit, a cozy, casual bistro not far from the city center - was quickly overrun by photographers. They split and headed for The Ritz, ducking into the dining room hoping to be left alone. The princess ordered vegetable tempura. Fayed ordered grilled turbot. \"No sooner had they ordered,\" the ex-Time reporters wrote, \"they began to feel the indiscreet stares of other diners .\" The couple left and had the food delivered to the Imperial Suite. Fayed's plan was in shambles. They had to get back to the apartment. But how? The hotel was swarming with photographers. Fayed devised a plan: The couple's driver and bodyguards would make a big show out front, appearing to get their caravan of Mercedes sedans ready to leave. Meanwhile, the Princess and Fayed would slip out the back door, in a borrowed car driven by a hotel security officer. What happened next was the subject of lengthy investigations and conspiracy theories that live on today. The couple did get away. But the driver, it turned out, was drunk. As the couple sped off, the photographers out front got tipped off about the escape, quickly catching up on their motorcycles. Their driver darted in and out of traffic, wrecking spectacularly inside the Pont de l'Alma tunnel near the Eiffel Tower. Fayed died instantly. Diana died at the hospital. Her death startled the world. An up-and-coming anchor named <mark>Brian Williams</mark> broke into regular coverage on MSNBC to announce the news to Americans in the early morning hours of Aug. 31. \"I've just been handed from the Reuters news service what has been marked\" bulletin,' \"<mark>Williams</mark> said, speaking slowly .\" It says, \"Princess Diana has died .'\" She was 36.", "articleID": "2017083113_00379284_W", "names": {"Brian Williams": ["Q10498110", "Q11688807", "Q16106138", "Q20273975", "Q22636441", "Q28777337", "Q39185757", "Q43162643", "Q459695", "Q4965638", "Q4965639", "Q4965640", "Q4965642", "Q4965643", "Q4965645"], "Christopher Anderson": ["Q24042099", "Q5111850", "Q5111851"], "Scott Macleod": ["Q3476261", "Q7436750"]}}, {"date": "2017-09-01", "url": "http://journal.com.ph/news/world/us-show-of-force-against-north-korea", "content": "SEOUL--US heavy bombers and stealth jet fighters delivered a show of force directed at North Korea in a live-fire drill Thursday, two days after Pyongyang's provocative test-launch of a ballistic missile that flew over northern Japan. Two B-1B \"Lancer\" bombers from Guam and four F-35B stealth jet fighters from the Marine Corps' Iwakuni airbase in Japan joined four South Korean jet fighters and two from Japan in the exercise over Japanese and South Korean air space, US military officials said. US and South Korean aircraft dropped live munitions onto the Pilseung shooting range in Gangwon province, some 150 kilometres (94 miles) south of the Demilitarized Zone dividing the two Koreas. General Terrence O’Shaughnessy, commander of the US Pacific Air Forces, said in a statement that the exercise meant to signal solidarity between the air forces of the three countries. \"North Korea's actions are a threat to our allies, partners and homeland, and their destabilizing actions will be met accordingly,\" he said. \"Our forward-deployed force will be the first to the fight, ready to deliver a lethal response at a moment's notice if our nation calls .\" North Korea sparked fresh concerns over its nuclear and missile program Tuesday when it launched a Hwasong-12 intermediate range missile over Hokkaido and into the central Pacific, sparking emergency sirens and text alerts sent en masse to people in northern Japan. The launch came as US and South Korean forces were nearing the end of the 10-day annual Ulchi Freedom Guardian joint exercises, which Pyongyang regards as threatening. The North's state media called the Hwasong-12 test \"a part of the muscle-flexing\" against the war games. And leader <mark>Kim Jong-Un</mark> called for more launches into the Pacific, KCNA news agency said. The UN Security Council denounced North Korea's latest missile test, unanimously demanding that Pyongyang halt the program. US Defense Secretary Jim Mattis called the IRBM test a \"reckless and provocative act\" while President Donald Trump said it demonstrated that negotiations with Pyongyang were \"not the answer .\" Tweet Read 0", "articleID": "2017090111_00040481_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}}, {"date": "2017-09-01", "url": "https://www.geo.tv/latest/156263-house-speaker-urges-trump-not-to-scrap-dreamers-immigration-policy", "content": "US House speaker urges Trump not to scrap \"Dreamers' immigration policy By R REUTERS Saturday Sep 02, 2017 House Speaker <mark>Paul Ryan</mark> speaks on Capitol Hill in Washington, US, July 27, 2017. REUTERS/Yuri Gripas/Files WASHINGTON: US House of Representatives Speaker <mark>Paul Ryan</mark> urged President Donald Trump on Friday not to rescind an Obama-era program that protects immigrants who entered the United States illegally as children, joining business leaders and others opposing the move. White House spokeswoman <mark>Sarah Sanders</mark> said Trump will announce on Tuesday whether he will end the Deferred Action for Childhood Arrivals (DACA) program, which protects nearly 800,000 people from deportation. It also makes those covered--the so-called Dreamers--eligible for work permits .\" We love the \"Dreamers,'\" the Republican president told reporters in the Oval Office. <mark>Ryan</mark> and Senator Orrin Hatch--both Republicans--on Friday joined a small but growing number of lawmakers from the majority party to speak out against killing DACA, created in 2012 by Democratic former President Barack Obama and long the target of conservative immigration hard-liners. \"I actually don't think he should do that, and I believe that this is something Congress has to fix,\" <mark>Ryan</mark> said in an interview with WCLO radio in his hometown of Janesville, Wisconsin. \"These are kids who know no other country, who were brought here by their parents and don't know another home. And so I really do believe that there needs to be a legislative solution. That's one that we're working on. And I think we want to give people peace of mind,\" <mark>Ryan</mark> added. Hatch said in a statement that rescinding the program would further complicate a US immigration system sorely in need of legislative reform. \"Like the president, I've long advocated for tougher enforcement of our existing immigration laws. But we also need a workable, permanent solution for individuals who entered our country unlawfully as children through no fault of their own and who have built their lives here. And that solution must come from Congress,\" the longest-serving Republican senator added. Trump made a crackdown on illegal immigrants a centrepiece of his 2016 election campaign and has stepped up deportations since taking office in January. However, business leaders say immigrants make important economic contributions and that ending the program would hit economic growth and tax revenue. Congress under presidents of both parties has been unable to pass comprehensive immigration reform. Obama bypassed the Republican-led Congress and created DACA through an executive order. In 2014, he signed another order providing similar protections as DACA to millions of additional illegal immigrants who were parents of US citizens or lawful permanent residents, but a group of Republican states led by Texas blocked it with a lawsuit that went all the way to the US Supreme Court. <mark>Sanders</mark> said Trump--who previously has called DACA illegal--is not taking the decision lightly. \"The president's priorities on immigration are to create a system that encourages legal immigration and benefits our economy and American workers,\" she told a news briefing. Most of the Dreamer immigrants came from Mexico and other Latin American countries. More than 200,000 live in California, while 100,000 are in Texas. On the other hand, New York, Illinois, and Florida also have large numbers. What to do about Dreamers has been actively debated within the White House and Trump administration. One senior administration official described the debate as a \"tug of war\" between factions in favour and against the move. \"Future of our country' Leading business figures including Facebook Inc CEO Mark Zuckerberg have rallied in defence of the program and the Dreamers .\" These young people represent the future of our country and our economy. They are our friends and family, students and young leaders in our communities, \"Zuckerberg wrote in a Facebook posting late on Thursday. DACA supporters argue that the people it protects grew up and were educated in the United States and were integrated into American society, with little connection to the countries in which they are citizens. Opponents of the program argue that illegal immigrants take jobs from US citizens. There are deep divisions in the United States over the fate of roughly 11 million illegal immigrants, most of them Hispanics. Trump as a candidate promised to deport all of them. Undoing DACA could have political consequences for Trump and his fellow Republicans, further alienating Hispanics, a growing voting bloc in the United States. Trump's pardon for an Arizona sheriff who critics accused of targeting Hispanics, his planned wall along the US-Mexican border and his comments about Mexico sending\" rapists \"and drug dealers into the United States already had antagonized many Hispanic Americans. Trump in February, four weeks after taking office, signalled he was conflicted over the DACA program, telling a news conference he would\" deal with DACA with heart \"and calling the matter\" one of the most difficult subjects I have. \"Trump said\" some absolutely incredible kids \"were among those covered by DACA, but also gang members and drug dealers. Advertisement", "articleID": "2017090121_00108645_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}}, {"date": "2017-09-06", "url": "http://www.foxsports.com/florida/story/washington-nationals-at-miami-marlins-preview-wednesday-september-6-090617", "content": "CAN'T GET TO A TV? WATCH IT LIVE ON FOX SPORTS GO MIAMI--Miami Marlins players and coaches this week are no doubt mixing some weather reports in with their scouting reports. Fortunately for the Marlins (67-71), they hit the road after the series finale against the Washington Nationals (84-54) on Wednesday. That flight out of town will help the Marlins avoid the expected effects of Hurricane Irma, which is supposed to strike the Miami area by Sunday morning. Marlins manager <mark>Don Mattingly</mark> said he is grateful team owner Jeffrey Loria is picking up the tab to take families of players and coaches on their upcoming seven-day road trip, including four games at Atlanta and three at Philadelphia. Watch the Miami Marlins on FOX Sports Florida Marlins Clubhouse \"(The Marlins) are providing a service for our families,\" <mark>Mattingly</mark> said. \"I think it's really nice for the organization .\" Before the Marlins can bolt out of town, they have to conclude the three-game set against Washington. Miami lost 2-1 on Tuesday and could get swept Wednesday. In search of the sweep, the Nationals will throw left-hander Gio Gonzalez (13-6, 2.58 ERA) against Marlins rookie lefty Dillon Peters (0-0, 0.00). Gonzalez, who is from Miami Dade County, is 3-0 with a 1.29 ERA against the Marlins this year. For his career, he is 9-3 with a 1.94 ERA in 15 career starts against the Marlins. At Marlins Park, he is 3-2 with a 3.29 ERA. The last time he was here, he nearly threw a no-hitter on July 31, settling for a 1-0 victory, allowing one hit in eight-plus innings. Peters tossed seven scoreless innings in his major league debut Friday against the Phillies. The Nationals won't have Bryce Harper available Wednesday, but the star right fielder played catch Tuesday for the first time since injuring his left knee Aug. 12. \"It's encouraging,\" said Nationals manager Dusty Baker, who is using Jayson Werth in right field in place of Harper. \"When you see him doing light baseball activities, you know he is on his way .\" Nobody can predict where he is (in terms of the rate of his recovery), but be at least initiated signs of progress. \"Harper has yet to swing a bat, however, and the first-place Nationals are hoping there is enough time on the schedule to get him back in time for the playoffs .\" At some point, we're going to need \"Harp',\" Baker said. \"They say injuries are no excuse, and they aren't, but it depends on who is hurt .\" The Marlins, who seemed to a viable playoff contender 10 days ago, have fallen to the fringes of the wild-card race after losing eight of their past nine games. Even so, there are some Marlins players worth watching, including Giancarlo Stanton, who leads the majors with 53 homers, and Marcell Ozuna, who is enjoying a breakout year with 32 homers and 107 RBIs. <mark>Mattingly</mark>, though, is not as interested in talking about anything except team goals. \"Teams in pennant races are the most interesting to watch--at least for me,\" he said. \"Individual stuff gets pushed to the side .\" <mark>Mattingly</mark> also said he likes the expanded playoffs, with a second wild-card berth now available. \"It gets more teams involved,\" he said. \"It makes things exciting down the stretch .\" ", "articleID": "2017090616_00644774_W", "names": {"Don Mattingly": ["Q19843097", "Q679120"]}}, {"date": "2017-09-07", "url": "http://wtop.com/ncaa-football/2017/09/dormadys-early-results-encouraging-for-no-25-tennessee/", "content": "Dormady's early results encouraging for No. 25 Tennessee By The Associated Press September 7, 2017 1:19 pm 09/07/2017 01:19 pm Share Tennessee quarterback Quinten Dormady (12) throws from the pocket in the first half of an NCAA college football game against the Georgia Tech, Monday, Sept. 4, 2017, in Atlanta. (AP Photo/John Bazemore) KNOXVILLE, Tenn. (AP)--If Tennessee's Quinten Dormady improves as much throughout the season as he did over the course of his first career start, the Volunteers won't have to worry about their quarterback situation. After winning a preseason competition with redshirt freshman Jarrett Guarantano, Dormady struggled initially but came on strong down the stretch to spark the 25th-ranked Volunteers to a 42-41 double-overtime victory over Georgia Tech. The performance should give Dormady a confidence boost heading into Tennessee's home opener Saturday with Football Championship Subdivision program Indiana State (0-1). His second-half surge certainly caught the attention of his teammates. \"I'm really proud of him, how he handled himself,\" running back <mark>John Kelly</mark> said. Dormady said he wasn't particularly nervous about making his first start, but the statistics show how much he improved as the game wore on. After going 8 of 20 for 52 yards in the first half, Dormady was 12 of 17 for 169 yards with two touchdown passes the rest of the way. Tennessee coaches had talked during the preseason about the possibility of playing both Dormady and Guarantano in the opener, but Dormady said he didn't look over his shoulder or worry about the possibility of getting pulled from the game during his early struggles. \"I wasn't focused on that,\" Dormady said. \"I was just focused on executing. It took us a little while to get going, but when we finally did hit (our) stride, it felt pretty good out there .\" Dormady never did get removed from the game, and he eventually rewarded the coaching staff's faith in him. He led Tennessee (1-0) to touchdowns on five of its last six possessions, including a game-tying 93-yard drive in the final five minutes of regulation. He never got sacked and didn't commit any turnovers. His performance should provide some hope that Tennessee has found a capable replacement for Joshua Dobbs, who started 35 games over the last four seasons before getting drafted in the fourth round by the Pittsburgh Steelers. \"I can't say enough about Quinten,\" offensive tackle Brett Kendrick said. \"He always had his composure. He reminded me a lot of Dobbs (in that) was a calming presence on the sideline. There's no worry in him. You always want someone like that in a quarterback .\" Dormady's emergence in the second half and overtime was particularly noteworthy because it came without Jauan Jennings, who started the season as Tennessee's top returning receiver. Jennings got injured in the first half of the Georgia Tech game and is out indefinitely. Jennings' absence will force Dormady to develop a rhythm with Tennessee's other receivers. He already appears to have found a favorite target in Marquez Callaway, who caught four passes for 115 yards and two touchdowns against Georgia Tech. Tennessee's matchup with Indiana State should help Dormady build that trust with receivers while also correcting mistakes he made in the opener. \"For me, I think it's just making the easy throws,\" Dormady said. \"That comes with me and the receivers, just with our timing and things ....We'll get things fixed. That will probably be the biggest jump. We've just got to make the routine plays .\" The Indiana State game also should provide an opportunity for Guarantano to make his debut. Television cameras during the Georgia Tech game showed Guarantano sitting apart from Dormady on the sideline without wearing a headset, leading to questions about how the redshirt freshman was handling the backup role. Guarantano hasn't been made available to the media this week, but Tennessee coach Butch Jones spoke out in the redshirt freshman's defense and noted his backup quarterbacks typically don't wear headsets during games. \"They'll continue to compete\" Jones said. \"I know there was a lot out there with Jarrett, and all I can tell you is Jarrett's a good teammate. He's always been a good teammate. He's a competitor and wants to be it there but also has a tremendous amount of respect for everyone in this program and the players .\" NOTE: Tennessee announced Thursday that reserve cornerback Baylen Buchanan has an ankle injury that will prevent him from playing against Indiana State. ___ More AP college football: http: //collegefootball.ap.org and https: //twitter.com/AP_Top25 ___ Follow Steve Megargee at www.twitter.com/stevemegargee Copyright © 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, written or redistributed.", "articleID": "2017090717_00358374_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}}, {"date": "2017-09-11", "url": "http://wkms.org/post/after-irma-shelter-residents-weigh-whether-brave-roads-or-wait-it-out", "content": "After Irma, Shelter Residents Weigh Whether To Brave The Roads--Or Wait It Out By Camila Domonoske • 57 seconds ago Tweet Share Google + Email View Slideshow 1 of 4 Flooding outside the Germain Arena in Estero, Fla., where some 5,000 people sought shelter from Hurricane Irma. Meredith Rizzo / NPR View Slideshow 2 of 4 Roger Forsythe volunteered at the Germain Arena, where thousands took shelter during the storm. \"This isn't safe for me to drive in,\" he says. Meredith Rizzo / NPR View Slideshow 3 of 4 Lydia Makarova's car broke down while she was trying to leave Germain Arena. Meredith Rizzo / NPR View Slideshow 4 of 4 After two nights in the shelter, many people were eager to leave and go home even though Lee County officials hadn't cleared the roads to travel. Meredith Rizzo / NPR Originally published on September 11, 2017 2:14 pm <mark>Stephen Ward</mark> arrived at the Germain Arena in Estero, Fla., at 4 o'clock in the morning on Saturday as Hurricane Irma was making its approach. On Monday morning, after the storm had passed, the elderly Fort Myers resident was unhappily looking out over the parking lot at the arena where some 5,000 people had sought shelter. \"I have to get home and see if I still have a house,\" he said. But the lot was covered in water, spilling from a nearby pond and rising over the hubcaps of the smaller cars. And both roads out of the parking lot were underwater, too. \"It's over. We made it out,\" <mark>Ward</mark> said, with an unhappy laugh that verged on tears. \"But we can't get out .\" A few minutes later, he climbed in his Lincoln Town Car and slowly drove out to try his luck. It's a decision that scores of residents in other storm-tossed parts of Florida were likely having to make. Germain Arena was secure during Irma, though not comfortable. The hockey rink was chilly, and the roof sprang a leak when the eyewall passed over late Sunday night. But after two nights in the shelter, people were eager to leave even though county officials hadn't cleared the roads to travel. \"They're going out right now on their own accord,\" Staff Sgt. Shawn Pennick of the Deep Florida Army National Guard said as he watched cars leave. He said the National Guard was warning people on their way out. \"If you feel that you want to do that, then you're able to go out, and if you get stuck--it happened,\" he says. It happened to Lidia Makarova. She pointed back at a row of six cars stranded on one road out of the arena. Her car was now on dry land, but the engine wouldn't start. Police told her to walk back to the shelter, she said. She pointed at her legs, soaked to the knee. \"It's very terrible. It's impossible .\" \"You call AAA, it's not working today,\" Makarova said. \"You call a garage to deliver my car home, it's not working. What [must I] do?\" A sheriff's deputy told her to wait and that someone would come along to help eventually. Five and a half hours later, she was still standing by her stranded car. In general, authorities in Lee County were urging residents to stay off the roads and be patient. The county's Department of Transportation said crews were working to clear culverts and catch basins, which \"should help with many standing-water issues .\" By the wall of the arena, three women, two men, three kids and a dog were resigned to wait it out. Teandra Evans of Fort Myers said she already had a good guess what she'd be going back to find. \"I know for a fact my apartment will probably be flooded,\" she said. \"When Harvey came and we just got that little rain, I was flooded. So just having this hurricane, I know it's flooded out there .\" And none of them were eager to risk the roads. \"It's a waiting game,\" said Veronica Smith. Curtis Christmas looked out over the parking lot, filled with indecisive drivers trying to gauge their odds. \"Ain't no reason to go out there and get stuck,\" he said. Copyright 2017 NPR. To see more, visit http: //www.npr.org/. Tags: Hurricane Irma Tweet Share Google + Email View the discussion thread.", "articleID": "2017091119_00219556_W", "names": {"Stephen Ward": ["Q27831019", "Q334576"]}}]