[{"date": "2017-09-12", "url": "http://www.thestar.co.uk/our-towns-and-cities/sheffield/sheffield-family-begin-their-journey-of-giving-1-8748896", "content": "Sheffield family begin their journey of giving. Have your say A Sheffield family has given a lasting gift to the community they love. <mark>Jonathan Hunt</mark> OBE and his family have joined together to set up an Acorn fund, which will grow over the years into a long lasting gift to South Yorkshire and create a legacy for the <mark>Hunt</mark> family. The <mark>Jonathan Hunt</mark> Family Acorn Fund has been set up with local charity South Yorkshire's Community Foundation (SYCF). SYCF specialises in establishing funds with local businesses and philanthropists, which are distributed for the benefit of local communities. Mr <mark>Hunt</mark> is a former Senior Partner at Wake Smith Solicitors in Sheffield and served as High Sheriff of South Yorkshire in 2007-8. Mr <mark>Hunt</mark> has a long history of supporting local charities and is the current Chairman of the South Yorkshire branch of SSAFA, which supports those in the armed forces, veterans and their families. He also gave 10 years of leadership and support as Chairman of South Yorkshire's Community before retiring from the position in 2014. <mark>Jonathan Hunt</mark> said: \"I was Chairman of SYCF for 10 years and during that time I donated to SYCF to help cover the costs of its vital work .\" Now, I wish to continue my support by building a named endowment, with the income supporting need in South Yorkshire for many years to come. \"Setting up an Acorn Fund appealed to us as a family because it meant we could give a meaningful amount, but over time in an affordable way .\" \"I expect Acorn Funds will grow in appeal to those looking to give locally, as it is a simple and effective solution to provide long term support for our county and communities .\" Acorn funds have a target sum, which is achieved through annual donations. The fund then becomes endowed and means that grants from the fund can be given in perpetuity. Mr <mark>Hunt</mark> continued: \"My wife and I, supported by our sons have established the\" <mark>Jonathan Hunt</mark> Family Acorn Fund' and we are excited to witness the impact it will make in our lifetime and comforted, knowing the difference it will make during the lives of generations to come. Mr <mark>Hunt</mark> and his family are following in the footsteps of another former SYCF Chairman Roy Darlison, who established the very first Acorn Fund with the Foundation. James Newman OBE, Chairman of SYCF and former Chairman of the Sheffield City Region Local Enterprise Partnership (LEP) said: \"<mark>Jonathan</mark> was a dedicated and passionate Chairman .\" He gave so much to the Foundation and to South Yorkshire before retiring from the role. \"For <mark>Jonathan</mark> and family to set up an Acorn Fund, it shows that supporting local people remains as important as ever to the <mark>Hunt</mark> family .\" The choice of an Acorn Fund, which will become endowed over time also means that the <mark>Hunt</mark> family will continue to keep helping the community they love for years to come. It will be a legacy they can pass down through generations. \"SYCF is a key part of the local charity sector and in 30 years has raised and distributed over £ 26m, amounting to over 8,250 grant awards. In 2015-16, SYCF's grant awards supported 1 in 10 people across South Yorkshire. Sign in", "articleID": "2017091209_00500737_W", "names": {"Jonathan Hunt": ["Q6273447", "Q6273451"]}}, {"date": "2017-09-12", "url": "http://www.northdevongazette.co.uk/swp-league-round-up-torridgeside-s-unbeaten-start-comes-to-an-end-1-5191077", "content": "SWP League round-up: Torridgeside's unbeaten start comes to an end PUBLISHED: 11:58 12 September 2017 | UPDATED: 11:59 12 September 2017 Matt Smart Football Archant This week's Carlsberg South West Peninsula League round-up Share Email this article to a friend To send a link to this page you must be logged in. Torridgeside's unbeaten start to the season in the Carlsberg South West Peninsula League was brought to an end on Saturday. It was Teignmouth who inflicted T-Side with their first loss in Division One East, leaving Donnacroft 3-0 winners. Manager Barry Paine said individual mistakes cost his side in what was otherwise an even game. \"There was nothing in the game. It looked like a 0-0,\" he said. \"Either side could have won and they've taken it because of the mistakes we've made .\" On the day they've just played it a little bit better than we did, but we're not a million miles away. \"Ilfracombe Town picked up their first away win of the season, and made it four unbeaten with a 4-1 at Galmpton and Roselands. <mark>Simon Townsend</mark> gave the Bluebirds the lead with a well-taken finish before Joe Seldon doubled. Galmpton pulled one back before Cassian Blackmore burst through to restore a two-goal advantage. <mark>Townsend</mark> wrapped things up in the second half with a classic route one goal .\" In the first half, although we went in 3-1 up, it could have gone either way, \"said coach Clem Bennellick .\" Both teams had decent chances, and it all went well for us. Everything we touched turned to gold. \"I think that was the first match where I've come in after the game and said I enjoyed it. We've found our feet a little bit and we're playing with a little bit more freedom .\" Elsewhere in Division One East, Appledore were beaten 2-0 at Honiton Town. \"I was struggling for a side and we knew it was going to be difficult,\" said manager Keith Shapland. \"We deserved to get beat, I won't gloss it over, we weren't good enough .\" We gave away possession too cheaply and didn't create. One thing I will say, was in goal Toby <mark>Robinson</mark>, who came in from the reserves was fantastic. He made four or five brilliant saves to keep the score down. \"In Division One West, Holsworthy thumped Illogan RBL 6-2 on Saturday. There were two goals each for Connor Nash and Tudor Placinta. <mark>Tom Robinson</mark> and <mark>Adam Smith</mark> also scored. Attentions turn to the Walter C Parsons Cup this weekend, with all the Division One teams at home. Appledore play University of Exeter, Ilfracombe welcome Budleigh Salterton, Torridgeside play Honiton Town and Hoslworthy have a game against St Martins. Witheridge are on their travels, playing Stoke Gabriel. Withy were in action in the Buildbase FA Vase on Saturday, coming unstuck 9-1 at home to Toolstation Western League side Cribbs.", "articleID": "2017091219_00516821_W", "names": {"Adam Smith": ["Q14950467", "Q16255210", "Q20023132", "Q22121229", "Q33035156", "Q350916", "Q350920", "Q42763651", "Q4679545", "Q4679802", "Q4679803", "Q4679807", "Q4679808", "Q48976986", "Q52116879", "Q5539790", "Q56997269", "Q57451408", "Q58051258", "Q58219052", "Q59065"], "Simon Townsend": ["Q21064247", "Q7519915"], "Tom Robinson": ["Q153289", "Q17198666", "Q42320057", "Q42714349", "Q723493"]}}, {"date": "2017-09-12", "url": "http://usatodayhss.com/2017/zion-williamson-loved-recent-advice-from-nba-all-star-john-wall-washington-wizards", "content": "Long before <mark>John Wall</mark> was making Lil' Duval do frontward dives as a result of trying to guard him and long before he was making multiple NBA All-Star games, <mark>Wall</mark> was racking up millions of views on his high school highlight videos. That's why it's easy for him to relate to high school basketball's multi-million views man Zion Williamson. RELATED: <mark>John Wall</mark> mesmerized the competition in high school In a recent episode of his No Offseason documentary with BallIsLife.com, <mark>Wall</mark> said Williamson is \"probably one of the top two or three most athletic players I've ever seen in life, period .\" Makes sense for a guy whose highlight vids have made fans out of everyone from Shaq to Dez Bryant to Drake, who famously posted a pic of him wearing Williamson's Spartanburg Day (Spartanburg, S.C.) jersey on Instagram. Still, when a fellow athletic freak of nature like <mark>Wall</mark> takes notice it means even more. \"Coming from a guy like <mark>John</mark> (<mark>Wall</mark>), that's just a great honor,\" said Williamson, who is ranked No. 2 overall in the ESPN 100. \"People think that because I get a lot of attention that I don't get fazed by things like that, but I do. I'm still a fan of guys like <mark>John</mark> so that was exciting for me .\" NBA All-Star point guard <mark>John Wall</mark> had high praise for Zion Williamson. <mark>Wall</mark>, a former ALL-USA first teamer in 2009, went on to offer Williamson advice on how to maximize his time on the floor during his final high school season. \"I would tell him just to work on different things,\" <mark>Wall</mark> said. \"The game is so easy and boring at times for him you can tell; work on things that you're gonna need for the next level. That's how I played in high school. When the game got serious I played the way I wanted to play get what I wanted to get done, but, other than that, I was just trying stuff and trying to improve my game .\" Williamson conceded that <mark>Wall</mark>'s advice made \"a lot of sense,\" and said it was something he would \"definitely\" implement more going forward. \"I do try and work on things that will benefit me at the level I want to get to but I don't go overboard with it,\" said Williamson, who made the ALL-USA first team last season. \"I never want to be too extra. When the situation calls for it I definitely will try and work on things that I'll need to improve for the ultimate level. That's something that I'll keep in mind. I appreciate that advice. That helps me a lot .\" Follow <mark>Jason Jordan</mark> on Twitter: @ JayJayUSATODAY <p> Photo: Bart Boatwright, Greenville News </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p>", "articleID": "2017091221_00176994_W", "names": {"Jason Jordan": ["Q2649346", "Q3162955"], "John Wall": ["Q14945536", "Q17400794", "Q337370", "Q47452330", "Q6262752", "Q6262757", "Q6262759"]}}, {"date": "2017-09-13", "url": "http://columbiamissourian.com/news/nation_world/irma-spawns-unusual-storm-surges-on-both-florida-coasts/article_53c395c7-8487-54ba-8534-a5f2594e836d.html", "content": "Nation & World News Sunny. High 83F. Winds NNW at 5 to 10 mph. . Tonight Clear skies. Low 58F. Winds light and variable. Updated: September 13, 2017 @ 2:54 am Sunny. High 83F. Winds NNW at 5 to 10 mph. . Tonight Clear skies. Low 58F. Winds light and variable. Updated: September 13, 2017 @ 2:54 am Close 1 of 8 <mark>Paul Johnson</mark> points to the flood water line on his truck in the San Marco neighborhood in Jacksonville, Fla., Monday, Sept. 11, 2017. <mark>Johnson</mark> tried to drive his prized posession truck out of the flood but it sputtered and died and still wouldn't turn on hours later. The nature of Irma's eye, its wide girth and especially its path made its storm surge seem somewhat strange with far off Jacksonville getting hit hard while parts of western Florida got off lighter than expected. (AP Photo/Claire Garafolo) Claire Galofaro Amber Narbett checks on flooding in her yard in the San Marco area of Jacksonville, Fla. in the aftermath of Hurricane Irma, Tuesday, Sept. 12, 2017. (AP Photo/John Raoux) John Raoux Larry Dimas walks around his destroyed trailer, which he rents out to others, in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. His tenants evacuated and nobody was inside when it was destroyed. (AP Photo/Gerald Herbert) Gerald Herbert FILE - This Sept. 11, 2017 file photo shows pedestrians walking by on a flooded street as Tropical Storm Irma hits Charleston, S.C.. While preliminary data suggest Irma's eye pushed a surge of more than 10 feet hit onto southwest Florida's Marco Island, the highest water levels were reported hundreds of miles away in Jacksonville, Fla., and Savannah, Ga., according to the National Oceanic and Atmospheric Administration. (AP Photo/Mic Smith, File) Mic Smith/The Associated Press Police officers plow through floodwater on Hendricks Avenue in San Marco as Hurricane Irma passes by Monday, Sept. 11, 2017, in Jacksonville, Fla. (Will Dickey/The Florida Times-Union via AP) Will Dickey FILE - This Sept. 10, 2017, file photo shows people walking on Old Tampa Bay, in Tampa, Fla.. Hurricane Irma's devastating storm surge came with weird twists that scientists attribute to the storm's girth, path and some geographic quirks. They can explain why the highest water levels observed from Irma were in faraway corners, while places closer to the eye experienced a rare reverse surge. (AP Photo/Chris O'Meara, File) Chris O'Meara Quintana and Liz Perez look out at the flooding outside their home in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. (AP Photo/Gerald Herbert) Gerald Herbert Charlotte Glaze gives Donna Lamb a teary hug as she floats out some of her belongings in floodwaters from the Ortega River in Jacksonville, Fla., Monday, Sept. 11, 2017, after Hurricane Irma passed through the area. \"This neighborhood has not flooded in at least 51 years,\" Lamb said. (Dede Smith/The Florida Times-Union via AP) Dede Smith Irma spawns unusual storm surges on both Florida coasts BY SETH BORENSTEIN and CLAIRE GALOFARO Associated Press 31 min ago (...) <mark>Paul Johnson</mark> points to the flood water line on his truck in the San Marco neighborhood in Jacksonville, Fla., Monday, Sept. 11, 2017. <mark>Johnson</mark> tried to drive his prized posession truck out of the flood but it sputtered and died and still wouldn't turn on hours later. The nature of Irma's eye, its wide girth and especially its path made its storm surge seem somewhat strange with far off Jacksonville getting hit hard while parts of western Florida got off lighter than expected. (AP Photo/Claire Garafolo) Claire Galofaro Amber Narbett checks on flooding in her yard in the San Marco area of Jacksonville, Fla. in the aftermath of Hurricane Irma, Tuesday, Sept. 12, 2017. (AP Photo/John Raoux) John Raoux Larry Dimas walks around his destroyed trailer, which he rents out to others, in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. His tenants evacuated and nobody was inside when it was destroyed. (AP Photo/Gerald Herbert) Gerald Herbert FILE - This Sept. 11, 2017 file photo shows pedestrians walking by on a flooded street as Tropical Storm Irma hits Charleston, S.C.. While preliminary data suggest Irma's eye pushed a surge of more than 10 feet hit onto southwest Florida's Marco Island, the highest water levels were reported hundreds of miles away in Jacksonville, Fla., and Savannah, Ga., according to the National Oceanic and Atmospheric Administration. (AP Photo/Mic Smith, File) Mic Smith/The Associated Press Police officers plow through floodwater on Hendricks Avenue in San Marco as Hurricane Irma passes by Monday, Sept. 11, 2017, in Jacksonville, Fla. (Will Dickey/The Florida Times-Union via AP) Will Dickey FILE - This Sept. 10, 2017, file photo shows people walking on Old Tampa Bay, in Tampa, Fla.. Hurricane Irma's devastating storm surge came with weird twists that scientists attribute to the storm's girth, path and some geographic quirks. They can explain why the highest water levels observed from Irma were in faraway corners, while places closer to the eye experienced a rare reverse surge. (AP Photo/Chris O'Meara, File) Chris O'Meara Quintana and Liz Perez look out at the flooding outside their home in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. (AP Photo/Gerald Herbert) Gerald Herbert Charlotte Glaze gives Donna Lamb a teary hug as she floats out some of her belongings in floodwaters from the Ortega River in Jacksonville, Fla., Monday, Sept. 11, 2017, after Hurricane Irma passed through the area. \"This neighborhood has not flooded in at least 51 years,\" Lamb said. (Dede Smith/The Florida Times-Union via AP) Dede Smith JACKSONVILLE, Fla. (AP)--Hurricane Irma's devastating storm surge came with weird twists that scientists attribute to the storm's girth, path and some geographic quirks. A combination of storm surge, heavy rains and swollen rivers sent some of the worst flooding into Jacksonville, Florida, even though Irma roared into the opposite end of the state, had weakened to a tropical storm and its eye stayed at least 80 miles (130 kilometers) away. Although preliminary data suggest Irma's eye pushed a surge of more than 10 feet (3 meters) onto southwest Florida's Marco Island, the highest water levels were reported hundreds of miles away in Jacksonville and Savannah, Georgia, according to the National Oceanic and Atmospheric Administration. And southwestern Florida, which is prone to surges, saw the opposite at first: a strange-looking negative surge that sucked the water off the sea floor quickly enough to maroon several manatees. After the water pulled away from the beaches and bay, it came back with vengeance, but much of Florida's west coast wasn't swamped as badly as it could have been because Irma's track kept them safe from the storm's stronger eastern side. \"You can call it bizarre; I might call it unusual or unique,\" said Rick Luettich, director of the Institute of Marine Studies at the University of North Carolina. \"What was very unusual about it was, it spanned two coastlines that were in different-facing directions. As a result, you got the opposite behavior on both coastlines .\" Tampa \"dodged a bullet\" on the weaker side of the storm, especially because Irma's southwestern eyewall had been broken up by high winds near Cuba, MIT meteorology professor Kerry Emanuel said. Jacksonville and the rest of the east coast, on the other hand, got the northeast brunt of the storm, where winds, surge and rainfall are at the strongest. And because hurricane winds spin counterclockwise and lined up perfectly perpendicular to Jacksonville's St. John's River, \"it just pushed the water from the Atlantic right into the river,\" National Hurricane Center spokesman and meteorologist Dennis Feltgen said. The city's concave coastline and the shallow water off the beach also made for a bigger storm surge buildup, funneling more water into Jacksonville, said storm surge expert Hal Needham of Galveston, Texas. On top of that, Jacksonville--unlike western Florida--only got one side of Irma, so the wind kept coming from the same direction, pushing the surge even higher, Needham said. That's why <mark>Paul Johnson</mark> was surprised when Monday morning he woke up in Jacksonville, looked out the window and saw boats passing by where cars normally drive. The water was licking at his front door. Before long, the flooding rose nearly to the window of his beloved pickup truck. \"I've lived here most of my life, and I've never seen anything like that,\" he said. It was worse than last year's Category 5 Matthew, which sat just off shore, because Irma grew to an immense 415 miles (670 kilometers) wide, Luettich said. \"The size of the storm made a huge difference,\" Luettich said. People tend to focus on top sustained winds, but that's only part of the equation that goes into storm surges. The storm's size is another major factor, as with Katrina, said Jamie Rhome, who heads the storm surge unit at the National Hurricane Center. \"As bad as it felt on the east coast of Florida, things were significantly worse in the Florida Keys,\" Rhome said, as well as in the lower part of southwest Florida where the storm's eye passed close by, such as Immokalee. Negative storm surge happened where Irma's eye moved over water east of the coastline and winds pushed the water away from the shore. That draining of the bay and coast \"tricks people,\" Rhome said, but Needham said the Tampa region has experienced this type of negative storm surge at least twice before. And because the reverse surge means the coastline must be refilled before water inundates land, the resulting speed and effect of the surge is lessened, Luettich said. <mark>Johnson</mark> said he had joked with his Facebook friends when Irma's track appeared to turn away from Jacksonville that the storm was too afraid to come near. But this storm's punch came from so far away that it never had to. \"She got us back,\" <mark>Johnson</mark> said. \"She showed us, she sure did .\" ---- --", "articleID": "2017091308_00444806_W", "names": {"Paul Johnson": ["Q15051763", "Q1632997", "Q18607331", "Q19560882", "Q19874724", "Q19874780", "Q2060446", "Q2060449", "Q21497946", "Q2278396", "Q3032232", "Q41805402", "Q42297148", "Q42706993", "Q45997", "Q47091510", "Q47289825", "Q7151597", "Q7151598", "Q7151599", "Q7151600", "Q7151601", "Q7151602", "Q7151604", "Q7151605", "Q7151606", "Q7151607", "Q7151609", "Q7151610", "Q7151611", "Q7151612", "Q7151613"]}}, {"date": "2017-09-13", "url": "http://www.bustle.com/p/what-does-iphone-x-mean-you-probably-didnt-notice-this-interesting-thing-about-the-name-2347652", "content": "What Does iPhone X Mean? You Probably Didn't Notice This Interesting Thing About The Name Justin Sullivan/Getty Images News/Getty Images Share By Brandi Neal 11 min ago While the Sept. 22 release of the iPhone 8 is is almost upon us, another new iPhone is coming out on Nov. 3: The iPhone X. Now, it's really pronounced out loud as \"iPhone 10,\" but typed out, it seems Apple took more of a Roman numeral route rather than sticking to numbers. Interestingly enough, though, in addition to utilizing Roman numerals, iPhone X is an anagram for Phoenix, which in Greek mythology is a bird that is cyclically regenerated or reborn from its own ashes. Coincidence? I'm not sure, but the description of the iPhone X sounds like one continuous experience, so even if it is coincidental, the anagram is fitting. \"Our vision has always been to create an iPhone that is entirely screen. One so immersive the device itself disappears into the experience. And so intelligent it can respond to a tap, your voice, and even a glance,\" Apple reported on its website. \"The display employs new techniques and technology to precisely follow the curves of the design, all the way to the elegantly rounded corner .\" Apple is billing the iPhone X as the phone of the future. With facial recognition ID, wireless charging, and more, it's certainly beyond what anyone ever imagine a phone could be. In comparison, the phoenix is, \"A mythical bird that never dies, the phoenix flies far ahead to the front, always scanning the landscape and distant space. It represents our capacity for vision, for collecting sensory information about our environment and the events unfolding within it. The phoenix, with its great beauty, creates intense excitement and deathless inspiration,\" The Feng Shui Handbook, Feng Shui Master Lam Kam Chuen, according to the website Mythic Realm. And, that description represents the iPhone X with stunning accuracy. Apple According to Digital Trends, the iPhone X commemorates the iPhones 10-year anniversary. But, this is where we may be able to dispel the phoenix rumors because Digital Trends reported that it's actually pronounced iPhone 10 to celebrate the milestone. However, that doesn't mean the comparison isn't accurate. \"In our view, Apple took the iPhone franchise to a whole new level with the iPhone X, pushing the company deep into the ultra-luxury smartphone market,\" <mark>Brian White</mark>, an analyst Drexel Hamilton, wrote in an investor note Wednesday, CNN reported. The evolution of the iPhone during its 10 years can be compared to the phoenix. According to the website Ancient Origins, \"Legend paints a picture of a magical bird, radiant and shimmering, which lives for several hundred years before it dies by bursting into flames. It is then reborn from the ashes, to start a new, long life .\" Giphy So, you can think of the iPhone X as Apple's rebirth, and it's swift move to reclaim its throne as the queen of all smartphones. Kind of like if a smartphone were BeyoncÃ © or Lady Gaga, who both engage in a constant cycle of reinvention and rebirth, always emerging on top. And, like these two women, Apple went about its rebirth in the same way the phoenix does. \"When it feels its end approaching, [the phoenix] builds a nest with the finest aromatic woods, sets it on fire, and is consumed by the flames,\" Tina Garnet wrote in The Phoenix in Egyptian, Arab, & Greek Mythology, according to Ancient Origins. \"From the pile of ashes, a new phoenix arises, young and powerful .\" And, with some of the most sophisticated technology Apple has ever developed, including the cameras and sensors that enable Face ID, the iPhone X is definitely a phoenix.", "articleID": "2017091320_00673162_W", "names": {"Brian White": ["Q21461106", "Q3644521", "Q4965621", "Q4965623", "Q57408280", "Q912278", "Q913226"]}}, {"date": "2017-09-14", "url": "http://jamaica-gleaner.com/article/news/20170914/bull-savannah-students-get-scholarship", "content": "Bull Savannah students get scholarship Published: Thursday | September 14, 2017 | 9:00 AM Shaequan McTaggart of Bishop Gibson High School receives her G. Winifred Kagwa Scholarship award from Heather Murray, former Hampton School principal. The ceremony was held at Bull Savannah Primary School in St Elizabeth on September 8. BULL SAVANNAH, St Elizabeth: Twelve past students of Bull Savannah Primary School in St Elizabeth received more than $1 million in scholarship money from the G. Winifred Brown Kagwa Scholarship programme and the American Friends of Jamaica on Friday September 8, at an awards ceremony at the school. The students are from the parish of St Elizabeth and have consistently excelled both academically and in their community activities. The scholarship was launched earlier that day at a luncheon in honour of the recipients. Eight students who are attending high schools in Manchester and St Elizabeth received $65,000 each and four tertiary students received the sum of $125,000. In a message, which was read to the scholarship recipients, Jamaica's ambassador to the United States and founder of Jamaica's Promise Foundation, Audrey Marks, reminded them that no matter how humble their beginnings, they can achieve greatness through hard work and determination. \"Remember that whether you work for someone or yourself, do your best. Learn all you can about your future career, pursue your passion, avoid negative critics, and most importantly, in today's technologically advanced world, protect your intellectual property. It is also important to give back to someone else so that you can help to break the cycle of generational poverty .\" The school was lauded for its academic excellence by <mark>Andrew Mills</mark> from the Ministry of Education, Region Five. He said Bull Savannah Primary is the school of choice in the area and parents, especially single mothers, send their children from as early as age two and a half years old. CHARGE FROM PAST STUDENT Guest speaker, former principal of Hampton School, Heather Murray, and also a past student of Burnt Savannah Primary, delivered a motivational talk to the students, who eagerly absorbed her every word. \"If it's going to be, it is up to me\" was the refrain that Murray used to reinforce to the scholarship winners that Winifred Kagwa has given them a start so it was up to them to make the decision to study hard and make the necessary steps towards achieving their goal. Armed with a litre of the popular drink 7-UP, Murray said, \"I am going to tell you about the seven ups that will take you through your lives. They are get up instead of sitting around waiting for things to happen; dress up by looking the part all the time, shut up because not everything is to be spoken, stand up for your right, look up to God, reach up for what you want, and bless up by practising the attitude of gratitude .\" ", "articleID": "2017091406_00193806_W", "names": {"Andrew Mills": ["Q46043542", "Q4758033"]}}, {"date": "2017-09-14", "url": "https://www.click2houston.com/entertainment/fergie-and-josh-duhamel-announce-separation", "content": "Fergie and Josh Duhamel announce separation Married in 2009, couple split earlier this year By MEGAN THOMAS, CNN Posted: 2:47 PM, September 14, 2017Updated: 3:21 PM, September 14, 2017 Dimitrios Kambouris/Getty Images Josh Duhamel met Fergie when The Black Eyed Peas filmed a cameo on his show \"Las Vegas\" in 2004. They became engaged in 2007 and were married in 2009. More Entertainment Headlines Amber Tamblyn, <mark>James Woods</mark> continue Twitter spat (CNN) - Pop star Fergie and actor Josh Duhamel have announced they are separating after eight years of marriage. \"With absolute love and respect we decided to separate as a couple earlier this year,\" the couple said in a joint statement to CNN. \"To give our family the best opportunity to adjust, we wanted to keep this a private matter before sharing it with the public. We are and will always be united in our support of each other and our family .\" More Entertainment Headlines Amber Tamblyn, <mark>James Woods</mark> continue Twitter spat The two married in 2009 and are parents to 4-year-old son, Axl. The couple frequently posted photos of their time together on social media and spoke affectionately about each other throughout their marriage. In a 2012 interview with Oprah Winfrey, Duhamel said there was \"no question\" his wife was the best thing that ever happened to him. Fergie called Duhamel her \"partner in crime\" and \"soul mate .\" In the same interview, they addressed facing difficulty at times in their marriage and credited each other for becoming better people. Copyright 2017 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2017091500_00227343_W", "names": {"James Woods": ["Q193105", "Q2333487", "Q6145792"]}}]