[{"date": "2017-09-15", "url": "http://news.opb.org/news/article/npr-hacker-group-ourmine-targets-vevos-data-and-removes-it-by-request/", "content": "Vevo, the music video platform co-owned by the three major labels along with Google's parent company and the Dubai-based Abu Dhabi Media, was the victim of a hack by the prolific group OurMine in the early hours of Friday. The hack was revealed by OurMine in a blog post. Data including one-sheets on featured artists and marketing materials, supposedly 3.12 terabytes worth, was posted to OurMine's website. Hours later, Vevo requested that the stolen info be taken down, and OurMine removed it. In an email to NPR, OurMine, which operates anonymously, claims it did not initially intend to post the data publicly and tried to alert Vevo of the breach privately, but that Vevo responded, \"F *** off, you don't have anything .\" OurMine shared a screenshot of that exchange, which lacked any identifying information and so could not be verified as taking place between the two, with NPR. Vevo would not verify the exchange to NPR when asked. Why was Vevo targeted? In its email to NPR, OurMine wrote, \"Every month we pick random companies to check their security and Vevo was one of them .\" (So it was not this 2016 tweet .) Asked for particulars about the hack, such as when it learned of the attack, whether any user data was posted publicly, when it requested its data be removed from public availability and what steps it was taking to prevent future attacks, Vevo issued this statement: \"We can confirm that Vevo experienced a data breach as a result of a phishing scam via LinkedIn. We have addressed the issue and are investigating the extent of exposure .\" In addition to posting private documents publicly, OurMine is also a business, offering its security services to both individuals (for $30) and companies (price upon request). While high-profile hacks of companies like Vevo and individuals like the singer Troye Sivan and tech mogul Mark Zuckerberg (password: \"dadada\" ) act as marketing for the company--generating articles like the one you're reading now--OurMine says that's not the point of its activities. \"We are doing this to improve the world security, as we said before we start all the hacks we did. No one is safe from hackers, even us!\" According to the group's own posts that doesn't seem to be the whole truth--its hack of BuzzFeed Media in Oct., 2016, appeared to be retaliatory, \"because they are reporting fake news about us .\" The group posted on BuzzFeed's website a warning: \"don't share fake news about us again, we have your database. Next time it will be public. Don't f *** with OurMine again .\" Copyright 2017 NPR. To see more, visit http: //www.npr.org/. Featured Adventure explore view more photos get driving directions print field guide + map powered by Explore Nearby Adventures More News UO Agrees To Pay Fired Bach Festival Artistic Director $90K Rep. Greg Walden Is Oregon's Champion Of Self-Driving Cars Net Neutrality Billboard Targets Oregon Rep. Greg Walden All Classical Portland CEO Retires Amid Station Unrest More OPB News Roundtable | Opera Theatre Oregon | PSUAH's Response To <mark>Joey Gibson</mark> An Interview with GoGo Penguin Portland Mayor Wheeler | Type 1 Diabetes | \"Oregon Field Guide '", "articleID": "2017091519_00710289_W", "names": {"Joey Gibson": ["Q11310827", "Q43378375"]}}, {"date": "2017-09-16", "url": "http://kfgo.com/news/articles/2017/sep/16/california-lawmakers-take-anti-trump-stance-as-session-ends/", "content": "California lawmakers take anti-Trump stance as session ends Saturday, September 16, 2017 5:42 a.m. CDT U.S. President Donald Trump waves as he arrives at Morristown municipal airport for a weekend at the Trump National Golf Club in Bedminster By Sharon Bernstein SACRAMENTO, Calif. (Reuters) - California lawmakers voted to become a sanctuary state, tussled over hot-button environmental issues and urged other states to refuse to cooperate with President Donald Trump's Election Integrity Commission as their legislative year ended early on Saturday. The majority Democratic lawmakers headed back to their districts having positioned the state in opposition to conservative policies proposed by the Republican-dominated U.S. Congress and President Donald Trump on immigration, the environment and other issues. \"It's a purposeful positioning,\" said political analyst Sherry Bebitch Jeffe, a senior fellow at the University of Southern California. \"We have a different political path and a different ideological path than the Republican-controlled Congress and White House have .\" This year, California lawmakers have strengthened protections for undocumented immigrants, increased the gasoline tax and extended a program aimed at compelling businesses to reduce air pollution, all in opposition to federal policies. Early on Saturday, lawmakers gave last-minute support to a bill barring local governments from forcing undocumented immigrants to spend extra time in jail just to allow enforcement officers to take them into their custody. The bill, a compromise from a version that sought to severely restrict interactions between law enforcement and immigration officials, does allow communities to notify the federal government if they have arrested an undocumented immigrant with a felony record. It also allows enforcement agents access to local jails. It came a day after a federal judge barred the U.S. Justice Department from denying public-safety grants to so-called sanctuary cities in retaliation for limiting cooperation with the Trump administration's crackdown on illegal immigration. The bill goes now to Democratic Governor <mark>Jerry Brown</mark> for his signature. Trump issued an executive order in January targeting funding for cities that offer illegal immigrants safe harbor by declining to use municipal resources to enforce federal immigration laws. A San Francisco judge blocked the order. Illinois' Republican Governor signed a bill last month protecting people from being detained because they are the subject of an immigration-related warrant. FOSSIL FUELS Although California lawmakers have enacted several environmental protections this year, a measure aimed at weaning the state's power grid entirely off fossil fuels by 2045 died for the year after lawmakers adjourned without voting on it. California's three investor-owned utilities, Pacific Gas & Electric, Southern California Edison and San Diego Gas & Electric [SDGE. UL], said the bill does not protect customers from the cost of switching from fossil fuels. Assemblyman Chris Holden, who held the measure in his Utilities and Energy Committee, said he would consider it again when the legislature returns in January for the second half of their two-year session. The legislature also passed a package of bills aimed at increasing the availability of affordable housing in the notoriously expensive state, and approved a plan for spending $1.5 billion in income from the state's cap-and-trade air quality program, which raises money by selling businesses limited rights to emit pollutants. They passed a resolution condemning the election integrity commission, calling it an effort to suppress the voting rights of minorities and others, and voted to move up the state's presidential primary from June to March. (Reporting by Sharon Bernstein in Sacramento, Nichola Groom in Los Angeles and <mark>Brendan O'Brien</mark> in Milwaukee; Editing by <mark>Andrew Bolton</mark>) More From World EU-U.S. data pact faces first major test of credibility British police arrest 18-year-old in hunt for London train bomber Trump move to block chipmaker deal bad for America - Xinhua Toys \"R' Us mulls bankruptcy filing: Wall Street Journal Houston residents, officials stew over Harvey storm-trash removal Mexico-U.S. trade would survive any NAFTA rupture: Mexico foreign minister Comments", "articleID": "2017091610_00092224_W", "names": {"Andrew Bolton": ["Q20829853", "Q9151099"], "Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"], "Jerry Brown": ["Q152451", "Q717620"]}}, {"date": "2017-09-18", "url": "http://www.cspdailynews.com/category-news/beverages/articles/ab-inbev-ready-turn-hostile", "content": "AB InBev Ready to Turn Hostile? CEO urges SABMiller stockholders to \"voice their views\" on takeover effort By, Editor in Chief, CSP Daily News Steve Holtz October 08, 2015 <mark>Carlos Brito</mark> LONDON & LEUVEN, Belgium--The possibility of Anheuser-Busch InBev purchasing SABMiller began to drift into hostile territory this morning as AB InBev CEO <mark>Carlos Brito</mark> urged stockholders of the coveted No. 2 beer brewer to \"voice their views\" and \"not allow the board of SABMiller to frustrate this process .\" The comments came in a brief statement from AB InBev expressing surprise over the SABMiller board of directors' swift rejection of an offer--AB InBev's third bid--to purchase the London-based company for £ 42.15 per share in cash ($64.51 per share U.S.). The offer values the company at $104 billion. \"AB InBev is surprised that the board of SABMiller (excluding the directors nominated by SABMiller's largest shareholder, Altria Group Inc., who dissented) continues to say that this proposal\" still very substantially undervalues SABMiller,' \"AB InBev wrote .\" This lacks credibility because the cash proposal represents a premium of approximately 44% to SABMiller's closing share price of £ 29.34 on Sept. 14 (being the last business day prior to renewed speculation of an approach from AB InBev); and Altria Group Inc., which owns 27% of SABMiller and has three representatives on the board, has publicly stated that it supports our proposal and \"urges SABMiller's board to engage promptly and constructively with AB InBev to agree on the terms of a recommended offer .'\" SABMiller, however, said the offer \"has been timed opportunistically to take advantage of SABMiller's recently depressed share price .\" \"SABMiller is the crown jewel of the global brewing industry, uniquely positioned to continue to generate decades of stand-alone future volume and value growth for all SABMiller shareholders from highly attractive markets,\" said Jan du Plessis, chairman of SABMiller. \"AB InBev needs SABMiller but has made opportunistic and highly conditional proposals, elements of which have been deliberately designed to be unattractive to many of our shareholders. AB InBev is very substantially undervaluing SABMiller .\" Some analysts believe AB InBev making its third offer publicly--two lower previous offers were handled quietly--was a first step at riling up shareholders, allowing them to see what they are missing. But certainly encouraging them to \"voice their views\" is an effort to create unrest. \"Notwithstanding our good faith efforts, the board of SABMiller has refused to meaningfully engage with us,\" <mark>Brito</mark> said today. \"Our proposal creates significant value for everybody. How long will it be before shareholders see a value of over £ 42 in the absence of an offer from AB InBev? If shareholders agree that we should be in proper discussions, they should voice their views and should not allow the board of SABMiller to frustrate this process and let this opportunity slip away .\" Based on British law, AB InBev has until Wednesday, Oct. 14, to make the deal happen or request an extension. Related Content", "articleID": "2017091816_01008960_W", "names": {"Carlos Brito": ["Q2199420", "Q5041861"]}}, {"date": "2017-09-19", "url": "http://abc30.com/news/police-vehicle-set-on-fire-3-arrested-at-georgia-tech-during-violent-protests/2431215/", "content": "Police vehicle set on fire, 3 arrested at Georgia Tech during \"violent protests' Email share share tweet email ABCNews KARMA ALLEN Monday, September 18, 2017 11:02 PM Three people were arrested and students were ordered to shelter in place at the Georgia Institute of Technology in Atlanta on Monday as violent protests erupted in response to the police shooting death of a student who allegedly had a knife, the university. The protests broke out after a peaceful vigil for Georgia Tech student Scout Schultz, 21, who was fatally shot by police late Saturday night after he called 911 to report an armed and possibly intoxicated suspicious person, authorities said. A police vehicle was set on fire, two officers suffered minor injuries and one officer was transported to a local hospital with non-life threatening injuries during the\" violent protests on campus, \"according to the university. The university estimated that a about 50 people participated in the protests, including some who marched to the the Georgia Tech Police Department immmdiately after the\" peaceful memorial vigil \"for Schultz. At one point, Georgia Tech police ordered students to stay inside and lock their doors, while off-campus students were told to remain off campus .\" Seek shelter in a secure location until further notice. Lock all doors and windows. Take Immediate Action Now, \"the Georgia Tech Department said in a tweet at 9:28 p.m. Monday. Video posted on social media showed a police vehicle on fire and officers pinning people to the ground while witnesses yelled in the background. Police said they restored order by 11 p.m. Monday and gave students the\" all clear \"to resume normal activities. Three people were arrested and charged with inciting a riot and battery of an officer, a university spokesperson said. Police told students to\" expect additional patrols throughout campus tonight \"and asked them to report\" anything suspicious. \"In a statement released through attorney <mark>Chris Stewart</mark>, Schultz's family urged protesters to remain peaceful .\" [W] e ask that those who wish to protest Scout's death do so peacefully. Answering violence with violence is not the answer, \"the statement said .\" Our goal is to work diligently to make positive change at Georgia Tech in an effort to ensure a safer campus for all students. \"\"Scout's family respects the rights of those who wish to voice opposition to what they feel was an unnecessary use of force, but they ask that it be done respectfully and safely,\" the statement added. Earlier on Monday, <mark>Stewart</mark> described Schultz as a loving child who lost his life simply because the police overreacted. He said Schultz was barefoot and \"disoriented,\" in the middle of a \"mental breakdown\" when he was shot. \"Scout should not have been shot,\" <mark>Stewart</mark> told reporters Monday. \"There has to be a bigger value put on taking a human life than fear when you are doing your job .\" <mark>Stewart</mark> also accused the school of handling the situation poorly and pushing a narrative that Schultz was a \"knife-wielding\" threat despite evidence suggesting otherwise. Scout Schultz's father, William Schultz, said Schultz had a 3.9 GPA and was scheduled to graduate in December. Scout Schultz served as president of the Georgia Tech Pride Alliance, and a leading voice within the campus' LGBTQ community. Scout Schultz identified as nonbinary and intersex and prefers to use the pronouns they, them and their, according to the group's web site. Related Topics: abc news national Email share share tweet email (Copyright © 2017 ABC News Internet Ventures .) Load Comments Please enable JavaScript to view comments. Top Stories Breanna Bradford's ex-boyfriend expected to be charged for her death Man pleads not guilty to exposing self at Wild Water Adventures Valley \"Dreamers' scramble to renew application before Oct. 5 deadline UPS expanding Visalia distribution center, bringing dozens of jobs Officials planning to lift all voluntary evacuations caused by the Pier Fire and reopen HWY 190 Tulare County judge denies DA request to recognize TRMC board member Nurses at Kaiser Permanente rally for patient care Trucking company steps up to help two Clovis Unified bus drivers deliver goods to Texas Show More For the first time ever, the UFC is coming to Fresno in December VIDEO: Deadly Queens bus crash caught on camera Amber Alert canceled for 5-year-old Lemoore girl taken from home Car crash takes out power to 3,000 people in Central Fresno Raw video released showing woman found dead in Rosemont hotel freezer More News Photos PHOTOS: Irma's devastation PHOTOS: Railroad Fire chars Giant Sequoias at Nelder Grove Photos of the Railroad Fire Hurricane Harvey heroes More Photos", "articleID": "2017091906_00061969_W", "names": {"Chris Stewart": ["Q1077782", "Q22254232", "Q30084424", "Q4068880", "Q5108164", "Q713526", "Q902651"]}}, {"date": "2017-09-21", "url": "http://www.eveningtimes.co.uk/sport/15546802.Hamilton_winger_David_Templeton_could_be_out_for_six_weeks/", "content": "Show caption () View gallery Skip to next image \"0 comments Get the latest local news straight to your inbox every day Sign up DAVID Templeton has been ruled out for four to six weeks after suffering a fractured foot during the defeat to Hearts. The Hamilton winger limped off early in the second half following a strong tackle, and manager Martin Canning revealed the injury was worse than first thought. Templeton was initially expected to be okay to return to face St Johnstone on Saturday, but instead will face another frustrating wait on the sidelines having impressed against his former side .\" We've lost David Templeton who will be out for four to six weeks, \"said Canning .\" He has a wee avulsion fracture in his foot following a blocked tackle on Saturday. \"He was very good on Saturday. It's frustrating for him because he's worked very hard to get himself ready to start games and he did very well in the game, but he's now going to miss four to six weeks .\" It's a blow to him, but it's a blow to us as well, but we have players in Steven Boyd and Louis Longridge and Botti Biabi who are desperate to go and play, so it's an opportunity for someone else. \"It is the latest setback in what has been an injury-plagued few years for Templeton, but Canning insisted there was no reason to doubt his future. He said:\" It's not a concern, because there's nothing you can do about it. \"It was a blocked tackle and that can happen to anybody, regardless of what your history of injury is .\" It's not a concern for me, it's a contact sport. \"Meanwhile, <mark>Antonio Rojano</mark>'s absence from competitive action looks set to continue as the club continues to wait for a work permit. The Argentinian striker joined late in the transfer window, but has not yet been able to take to the field as he waits for clearance to play. Canning said:\" It's an ongoing thing. Hopefully it's imminent. It's out of our hands as much as we can do. \"I think he will be out of this weekend .\" Hopefully if it's not at the end of this week, it will be at some point next week. \"0 comments", "articleID": "2017092103_00054648_W", "names": {"Antonio Rojano": ["Q5699579", "Q5699581"]}}, {"date": "2017-09-22", "url": "http://www.financialexpress.com/world-news/north-korea-may-consider-hydrogen-bomb-test-in-pacific-kim-jong-un-calls-donald-trump-deranged/865720/", "content": "North Korea said on Friday it might test a hydrogen bomb on the Pacific Ocean after U.S. President Donald Trump vowed to destroy the country. (File Photo: Reuters) Top News After Ratan Tata, now Anand Mahindra backs Narendra Modi, says PM clearly communicating India's direction NDTV stock hits upper circuit, jumps 5% as Spice Jet's <mark>Ajay Singh</mark> all set to take command Tata Motors Nexon launched priced at Rs 5.85 lakh to take on Maruti Suzuki Vitara Brezza, Ford Ecosport North Korea said on Friday it might test a hydrogen bomb on the Pacific Ocean after U.S. President Donald Trump vowed to destroy the country, with leader <mark>Kim Jong Un</mark> promising to make a \"mentally deranged\" Trump pay dearly for his threats. <mark>Kim</mark>, who has traded ever-more heightened rhetoric with Trump, did not specify what his response would be. His comments were believed to be the first direct message ever issued by a North Korean leader. However, <mark>Kim</mark>'s foreign minister, Ri Yong Ho, said North Korea could consider a hydrogen bomb test of an unprecedented scale on the Pacific Ocean, South Korea's Yonhap news agency reported. Ri, who was talking to reporters in New York ahead of a planned address later this week, however also said he did not know <mark>Kim</mark>'s exact thoughts, according to the report. Japan, the only country ever to suffer an atomic attack, described the threat as \"totally unacceptable\". Trump said in his first address to the United Nations on Tuesday he would \"totally destroy\" North Korea, a country of 26 million people, if it threatened the United States and its allies, and called <mark>Kim</mark> a \"rocket man\" on a suicide mission. <mark>Kim</mark> said the North would consider the \"highest level of hard-line countermeasure in history\" against the United States and that Trump's comments had confirmed his own nuclear programme was \"the correct path\". Pyongyang conducted its sixth and largest nuclear test on Sept. 3 and has launched dozens of missiles this year as it accelerates a programme aimed at enabling it to target the United States with a nuclear-tipped missile. \"I will surely and definitely tame the mentally deranged U.S. dotard with fire,\" <mark>Kim</mark> said in the statement carried by the KCNA state news agency, referring to Trump. \"SLEEPWALKING INTO WAR\" Vipin Narang, an associate professor of political science at Massachusetts Institute of Technology, said he could not recall such a statement in the first person, authored and signed by <mark>Kim</mark>. \"I don't think it's happened before. That's something to take seriously alone,\" he said. The escalating rhetoric came even as U.N. Secretary-General Antonio Guterres called for statesmanship to avoid \"sleepwalking\" into a war. South Korea, Russia and China all urged calm. Also Watch: However, the rhetoric was starting to rattle some in the international community. French Sports Minister Laura Flessel said France's team would not travel to the 2018 Winter Olympic Games in South Korea if its security cannot be guaranteed. The 2018 Games are to be staged in Pyeongchang, just 80 km (50 miles) from the demilitarised zone between North and South Korea, the world's most heavily armed border. Asian stocks fell and the Japanese yen and Swiss franc gained on the possibility of a hydrogen bomb test in the Pacific. MSCI's broadest index of Asia-Pacific shares outside Japan handed back earlier gains and was down 0.4 percent after falling 0.7 percent the previous day. MORE TIME In his sanctions announcement on Thursday, Trump stopped short of going after Pyongyang's biggest trading partner, China, praising as \"tremendous\" a move by its central bank ordering Chinese banks to stop doing business with North Korea. The additional sanctions on Pyongyang, including on its shipping and trade networks, showed that Trump was giving more time for economic pressures to weigh on North Korea after warning about the possibility of military action on Tuesday. Asked ahead of a lunch meeting with the leaders of Japan and South Korea on Thursday if diplomacy was still possible, Trump nodded and said: \"Why not?\" Trump said the new executive order on sanctions gives further authorities to target individual companies and institutions that finance and facilitate trade with North Korea. It \"will cut off sources of revenue that fund North Korea's efforts to develop the deadliest weapons known to humankind\" , Trump said. The U.S. Treasury Department now had authority to target those that conduct \"significant trade in goods, services or technology with North Korea\". Trump did not mention Pyongyang's oil trade. The White House said North Korea's energy, medical, mining, textiles, and transportation industries were among those targeted and that the U.S. Treasury could sanction anyone who owns, controls or operates a port of entry in North Korea. \"ON NOTICE\" U.S. Treasury Secretary Steven Mnuchin said banks doing business in North Korea would not be allowed to also operate in the United States. \"Foreign financial institutions are now on notice that going forward they can choose to do business with the United States or with North Korea, but not both,\" Mnuchin said. The U.N. Security Council has unanimously imposed nine rounds of sanctions on North Korea since 2006, the latest this month capping fuel supplies to the isolated state. South Korean President Moon Jae-in, who addressed the U.N. General Assembly, said sanctions were needed to bring Pyongyang to the negotiating table, but Seoul was not seeking North Korea's collapse. \"All of our endeavours are to prevent war from breaking out and maintain peace,\" Moon said in his speech. He warned the nuclear issue had to be managed stably so that \"accidental military clashes will not destroy peace\". The United States and South Korea are technically still at war with North Korea because the 1950-53 Korean conflict ended with a truce and not a peace treaty. The North accuses the United States, which has 28,500 troops in South Korea, of planning to invade and regularly threatens to destroy it and its Asian allies.", "articleID": "2017092205_00259842_W", "names": {"Ajay Singh": ["Q15734101", "Q20630466", "Q25991768", "Q4699657", "Q4699658", "Q4699660", "Q47126262", "Q57080992", "Q58483951"], "Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2017-09-24", "url": "http://www.financialexpress.com/world-news/canadian-pm-justin-trudeau-melania-trump-prince-harry-inaugurate-invictus-games/868214/", "content": "The eight-day event, established in 2014 by Prince Harry, includes over 550 injured soldiers and veterans from 17 countries competing in 12 adaptive sports, reports Efe news. (Reuters) Top News Big relief for consumers: Prices of FMCG products falling after GST rollout Bihar Police Constable Admit Card 2017: CSBC releases admit cards; how to download it from official website csbc. bih. nic. in Subramanian Swamy says economy is heading for depression, claims warning govt last May Canadian Prime Minister Justin Trudeau along with US First Lady Melania Trump and UK's Prince Harry inaugurated the Invictus Games for military veterans with disabilities or injuries here. The eight-day event, established in 2014 by Prince Harry, includes over 550 injured soldiers and veterans from 17 countries competing in 12 adaptive sports, reports Efe news. This event marked the first solo foreign trip for Melania Trump. Prior to the official opening of the third edition of the Invictus Games on Saturday evening, Melania Trump met Prince Harry for the first time. She invited Prince Harry to visit the White House at \"any time\". Melania Trump also met with Trudeau, his wife, Sophie-Gregoire, and their three children prior to the event. Afterwards, Melania Trump held a reception with the approximately 100 US competitors participating where she said: \"On behalf of my husband and our entire country, I want to thank you and your families for all you have sacrificed to keep us safe .\" The opening ceremony of the Toronto Invictus Games also saw Prince Harry meet with his girlfriend, American actress Meghan Markle. Markle, who resides in Toronto, attended the opening ceremony but did not sit with Harry. The American actress witnessed the opening ceremony sitting several rows behind, whilst Ukrainian President Petro Poroshenko and his wife Maryna; the Trudeau couple, Melania Trump, Prince Harry and Governor General of Canada <mark>David Johnston</mark>, and his wife Sharon sat together in the VIP area. The Canadian Prime Minister said: \"The Invictus Games are a unique and powerful way to honour those who have sacrificed so much on behalf of their country .\" They represent the best and deserve our gratitude forever. Over the next eight days, the Invictus Games will put the spotlight on the strength and resilience that characterized their service. Sophie and I wish every competitor the best of luck. \"The 2017 Invictus Games will conclude on September 30.", "articleID": "2017092404_00244124_W", "names": {"David Johnston": ["Q16730377", "Q21066672", "Q28102004", "Q3018164", "Q41564", "Q43132128", "Q43394930", "Q5235710", "Q5235711", "Q5235712", "Q5235713", "Q5235714", "Q58338670"]}}]