[{"date": "2017-09-24", "url": "http://www.newcastlestar.com.au/story/4944997/loan-rules-should-apply-only-in-sydney-melbourne/?cs=9", "content": "The major banks' main domestic rivals are calling for an overhaul of the prudential regulator's caps on property investor and interest-only mortgages, claiming the curbs are stifling competition. The major banks' main domestic rivals are calling for an overhaul of the prudential regulator's caps on property investor and interest-only mortgages, claiming the curbs are stifling competition. View More Local Business List Your Business Here Proposals from the second-tier lenders include clamping down on mortgages only in the hottest property markets such as Melbourne and Sydney, or putting tighter speed limits on the big four than the rest of the industry. For almost three years, banks have faced a 10 per cent annual growth cap in their housing investor loan portfolios, enforced by the Australian Prudential Regulation Authority (APRA). In March this year, APRA imposed a further restriction, capping interest-only lending at 30 per cent of new loans. As big banks sell peripheral businesses to zero in on the housing market, regional banks say these \"macroprudential\" policies are having unhealthy side-effects for competition. Banks including Suncorp, Bank of Queensland, and industry super-owned ME are calling on APRA to consider redesigning the rules, which they say are effectively locking in the big four banks' market share. \"The macroprudential rules, while well-intentioned, have the effect of effectively maintaining status quo from a competition point of view,\" said Suncorp's chief executive of banking and wealth, <mark>David Carter</mark>. He acknowledged the policy was intended to prevent a \"credit bubble\" in real estate, but said the caps could be redesigned, such as only focusing on the cities at the greatest risk of overheating. \"If we're really concerned about house prices getting away from everyone in Sydney and Melbourne, then maybe the focus point should be Sydney and Melbourne,\" Mr <mark>Carter</mark> said. He noted the precedent in New Zealand, where regulators have targeted \"macroprudential\" policies at Auckland, where price growth had been most rapid. Bank of Queensland chief Jon Sutton said the caps could also be changed so some banks had higher speed limits than others - which would allow smaller banks to increase their share. \"These changes basically just lock in the market share for everybody at the current level,\" Mr Sutton said. ME chief executive Jamie McPhee said the 30 per cent cap on interest-only lending also skewed how different banks could grow. Banks that were able to compete strongly in principal and interest lending were also given scope by the cap to pick up a strong share of interest-only lending, he said. \"It just makes it harder for challenger brands or smaller [authorised deposit-taking institutions] to get any shift in market share,\" he said. The regional banks called for the change in tack by APRA as part of a submission to the Productivity Commission's inquiry into competition in financial services. Larger banks, however, have maintained in their submissions that the mortgage market remains highly competitive. Westpac said that in the four years to June, non-major banks had grown their lending at an average page of 9.5 per cent a year, faster than the 7.7 per cent average pace for the big four. Another key concern identified by the regional banks was the funding cost advantage that the big four receive from being considered \"too big to fail\" , and the big banks' more favourable capital treatment. The big four are able to set aside less shareholder capital than the regional banks for every dollar lent, which makes the same loans more profitable for the big four. The smaller banks argue the government's bank levy helped to address the advantage the big four receive from an \"implicit\" guarantee by the taxpayer, but it has not gone far enough. The story Loan rules should apply only in Sydney, Melbourne first appeared on The Sydney Morning Herald.", "articleID": "2017092414_00582305_W", "names": {"David Carter": ["Q1173943", "Q20193403", "Q23304159", "Q28454933", "Q5232204", "Q5232205", "Q5232207", "Q5232208", "Q5232209", "Q5232211", "Q5232212", "Q5232213", "Q58062269", "Q6128819"]}}, {"date": "2017-09-25", "url": "http://www.richmond.com/news/local/education/richmond-area-students-attend-white-house-computer-science-announcement/article_01342c89-fe83-5b70-8cd4-933fdbd8c7a3.html", "content": "More than a dozen Richmond-area students were on hand Monday as the White House announced a $200 million per year commitment to computer science education in U.S. schools. Fourteen students from CodeRVA in Richmond and Chesterfield County traveled to Washington to witness the announcement, which is meant to expand access to computer science in schools. The money also aims to increase participation by women and underrepresented minorities in computer science. \"This funding will jumpstart efforts to ensure every student in every school has the opportunity to learn computer science as part of a well-rounded education,\" code.org, a national coding nonprofit funded by donations from the likes of Facebook and Microsoft, wrote in a statement. \"For advocates of increased access and diversity in CS, this is the culmination of years of momentum that began in classrooms, spread to entire school districts, and won the support of business leaders and elected officials globally .\" Got a news tip? Email tips and photos here. President Donald Trump signed the executive memorandum Monday afternoon. The memorandum directs the U.S. Department of Education to dedicate at least $200 million to computer science education while increasing the focus of computer science in K-12 classrooms, Axios reported. The announcement was originally scheduled for about two weeks ago, but was delayed by Hurricane Irma. Former President Barack Obama also pushed for computer science education with his Computer Science For All initiative, which called for $4 billion in funding for states. Congress didn't fund the initiative. The Richmond region's representation in Washington comes as computer science education in Richmond is on the rise. The four students at The White House from CodeRVA are in their first year at the new, experimental high school near The Diamond. The school, which has a staff of six and an enrollment of about 100, is focused on computer science and is experimental in nature with internships, year-round schooling and about a 50-50 split between online and face-to-face learning. The school also features a diverse population, with about 50 percent men and women, which is similar to the school's makeup of white students and minorities. Virginia became the first state in the U.S. to pass computer science education reform in 2016 where every student receives access to computer science education from K-12. CodeVA, a nonprofit based in Richmond that advocates for computer science across the commonwealth, helped create the legislation and was overjoyed by the news Monday. CodeVA is an affiliate partner of code.org. \"We're pleased to see the renewed commitment from the administration to computer science education. Virginia, which has the highest density of computer science jobs in the nation, has long been a national leader in making K-12 computer science education a priority,\" said Chris Dovi, the executive director of CodeVA, in a statement. \"Our governor and our General Assembly's commitment is clear by adding computer science as a core K-12 subject in out SOLs, and it's fitting that Virginia students are represented at the White House event .\" The Richmond-area students who went to the announcement were: Sean Reavis, Robious Middle School Samuel Raymond, James River High School Shalicia Pickett, CodeRVA Alanah Mayo, Providence Middle School Barbara Wyand, Providence Middle School Briana Jackson, Bailey Bridge Middle School Kyndal Townes, CodeRVA Krystal Rubio, CodeRVA Torrence Washington, <mark>Elizabeth Davis</mark> Middle School Richard Drum, Tomahawk Creek Middle School <mark>John Best</mark>, Manchester Middle School Kenneth Brake, Swift Creek Middle School Hunter Cumbie, Robious Middle School Jeffery Cumming, CodeRVA", "articleID": "2017092520_00815126_W", "names": {"Elizabeth Davis": ["Q16195968", "Q29000529", "Q5362395"], "John Best": ["Q1101234", "Q1376523", "Q1699328", "Q329180", "Q47454915", "Q51521433", "Q51586082", "Q54556043", "Q6221772"]}}, {"date": "2017-09-25", "url": "http://ijr.com/the-declaration/2017/09/982981-last-season-qb-russell-wilson-gave-bold-reason-stands-flag-sunday-locker-room/", "content": "Share on Facebook Share on Twitter Share via email Discuss The Declaration Last Season, QB <mark>Russell Wilson</mark> Gave Bold Reason Why He Stands for Flag. Sunday, He Was in Locker Room By Victoria Taft 34 minutes ago Share on Facebook Discuss Last football season, Seattle Seahawks quarterback <mark>Russell Wilson</mark> explained why he wouldn't take a knee while the national anthem played. <mark>Wilson</mark> always stood with his hand over his heart: Grateful to live in a place where freedom is a right. #Proud 2BeAnAmerican A post shared by <mark>Russell Wilson</mark> (@ dangerusswilson) on Jul 4, 2016 at 2:08 pm PDT In 2016, after former San Francisco 49ers quarterback Colin Kaepernick began kneeling during the anthem and presentation of the colors to protest police shootings, <mark>Wilson</mark> was asked why he stood. IJR reported his comments at the time: \"For me, I love the flag. I love the national anthem because it's an emotional time for me because I'm so grateful I get to play on the football field. And every time I get to put my hand on my heart, it's truly an honor--you know, the military, for me I think about my family members who have served, and friends--I train down in San Diego all the time, so I'm around the Navy and I see those guys around. [...] And all they do for our country and the people in Afghanistan and all these people fighting. So that's why I stand and put my hand on my heart .\" So for <mark>Wilson</mark> at that time, the issue was respect for the country and the sacrifices of those who fight for it. But this time, that message of unity was apparently lost in the weeds. <mark>Wilson</mark> acknowledged that the entire team made a \"quick\" decision to stay in the locker room in solidarity \"against injustice\" while the \"Star-Spangled Banner\" was sung by \"The Voice\" contestant Meghan Linsey, who herself knelt on the field. But what it really smacked of was a political statement against the president after <mark>Donald Trump</mark> said at a rally in Alabama on Friday: \"We're proud of our country. We respect our flag. Wouldn't you love to see one of these NFL owners when somebody disrespects our flag to say\" get that son of a b *** h right off the field right now. Out. He's fired. \"And then the president doubled down on his sentiments with a couple of tweets: If a player wants the privilege of making millions of dollars in the NFL, or other leagues, he or she should not be allowed to disrespect ...--Donald J. Trump (@ realDonaldTrump) September 23, 2017...our Great American Flag (or Country) and should stand for the National Anthem. If not, YOU'RE FIRED. Find something else to do!--Donald J. Trump (@ realDonaldTrump) September 23, 2017 <mark>Wilson</mark> said he saw the president's comments while flying on the Seahawks jet to Tennessee Friday and grimaced. Screenshot / Seattle Seahawks The president's comments were also panned by several NBA players who weighed in. And by Sunday, the Seahawks were planning to skip the national anthem as a show of\" unity. \"At his news conference after the Seahawks' loss to the Tennessee Titans on Sunday, <mark>Wilson</mark> acknowledged that the decision to stay in the locker room as a protest was\" quickly decided \"because he believed that the issue of\" injustice \"is taken too\" lightly \":\" I know that the guys in the National Football League are trying to do right and trying to make a change. We're a team that really want to make a change and it was pretty sad to see and we were on the plane and I saw that and you think about people that have gone through stuff and the people that have from our team...<mark>Michael Bennett</mark>... to people that have gone through all kinds of stuff through the country. It's a serious issue and can't be taken lightly. I feel that honestly it's being taken lightly. And I think that we have to do something about it and be able to communicate and show love and make a difference in our world. And I think it starts from the top and in our communities, too. \"<mark>Bennett</mark> was handcuffed by police when they say he ran away when police ordered patrons to get down in response to an active shooter situation at a Las Vegas club. The incident is under review. He says he was mistreated by police because he's black. Equality. pic.twitter.com/NQ4pJt94AZ--<mark>Michael Bennett</mark> (@ mosesbread72) September 6, 2017 <mark>Bennett</mark> hired a civil rights attorney to bring action against Las Vegas police. Because of that incident and others to which <mark>Wilson</mark> alluded, the Seahawks quarterback said that the team wanted to do something together to protest. It was decided that they'd stay in the locker room to protest:\" We wanted to do something as a team. We're such a tight knit group and our thought was we want to--you know, last year we did something. We locked arms. And that was very good and stuff and then we thought \"how can we do something as a whole team collectively to show that, you know, the injustice in America, you know for people needs to be fixed .\" There have been many high-profile police shootings in years past protested by groups such as Black Lives Matter and highlighted by Colin Kaepernick. Police have made mistakes. But in the overwhelming number of cases, police are found to have acted within the boundaries of their training in such shootings. Local, state and federal investigations, for example, showed that the <mark>Michael Brown</mark> shooting was justified because he attacked the police officer. The claims that <mark>Brown</mark> pleaded with the officer that he had his \"hands up, don't shoot\" were also found to be untrue. The Washington Post database shows there have been 730 police shootings so far this year. Most of the people shot were white and most were armed with a weapon. Share on Facebook Share on Twitter Share via email View Comments (0 comments) Trending 24 Steelers QB Roethlisberger Could No Longer Stay Silent About Team Staying in Tunnel During Anthem 2 hours ago <mark>Sarah Sanders</mark> Was Asked if National Anthem Protest Was \"Appropriate .' Her Response Silences the Room 3 hours ago 112k views 64 The NFL Ratings Are in After Day of Mass Anthem Protests...5 hours ago 141.3 k views 47 The Patriots Kneeled for the Anthem, But It's What the Fans Did That's Turning Heads 19 hours ago Mattis Was Asked About the National Anthem Protest--His Next 4 Words Define American Patriotism 44 minutes ago You might like 1.2 m views 181 NASCAR Just Joined in on the National Anthem Drama, But They're Taking a Totally Different Approach a day ago 712.3 k views 78 Only Steeler to Show Up for National Anthem Issued a Bold Message to Kaepernick and Protesters a day ago 169.4 k views 90 While Everyone Wonders Who Will #TakeAKnee on Sunday, Some Remember One Hero Who Never Would 2 days ago", "articleID": "2017092522_00259784_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Michael Bennett": ["Q1176654", "Q18022004", "Q21458629", "Q21458633", "Q27922506", "Q5570630", "Q6828576", "Q6828577", "Q7330923"], "Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"], "Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}}, {"date": "2017-09-27", "url": "http://www.mypalmbeachpost.com/news/local-govt--politics/pbc-irma-costs-100-million-damage-million-haul-debris/KgBhPwPjg6vjiYcFSJOhLL/", "content": "politics By Wayne Washington - Palm Beach Post Staff Writer...Community engagement manager Marissa Jacobs examines bamboo in a large pile of debris removed from Mounts Botanical Garden west of West Palm Beach on September 15, 2017. (Bruce R. Bennett / The Palm Beach Post) Posted: 6:08 p.m. Wednesday, September 27, 2017 Palm Beach County's Solid Waste Authority expects to spend about $27 million to clear debris left in the wake of Hurricane Irma, the authority's executive director has told county commissioners. Most of that money should be reimbursed to the county from the Federal Emergency Management Agency and the state of Florida. But Solid Waste Authority Executive Director <mark>Mark Hammond</mark> said the county shouldn't expect to see reimbursement dollars flowing this way any time soon. RELATED: The Post's complete coverage of Hurricane Irma \"Unfortunately, it could be over a year before the Authority receives reimbursement,\" <mark>Hammond</mark> wrote to commissioners in an email to commissioners on Tuesday. \"The authority has yet to receive reimbursement for Hurricane Matthew which impacted us last year around this time .\" The authority, which has about $26 million in collection reserve accounts for unincorporated Palm Beach County, is \"exploring short term borrowing options to cover the costs of Irma in order to retain sufficient reserves for next year's hurricane season,\" <mark>Hammond</mark> told commissioners. The authority expects 87.5 of its debris removal costs--about $23.6 million--to be reimbursable, <mark>Hammond</mark> said. The authority will seek to get 75 of its debris removal costs back from the Federal Emergency Management Agency and another 12.5 percent back from the state of Florida. Meanwhile, with the initial estimate of damage to properties in unincorporated Palm Beach Beach County set at more than $100 million, the County Commission on Tuesday passed a resolution waiving permit and expedited review fees for residents attempting to rebuild after Irma. \"This resolution will authorize the Building Division to expedite reviews and issue permits to begin recovery and repair without charging any fees for these services,\" the county said in a statement announcing the waivers. The fee waivers extend to March 26, 2018. After that date, the county will compile a summary of the fees waived. The county was unable to provide an estimate for how much the fee waivers will cost in lost revenue. \"This is an excellent example of local government done right,\" Commissioner Melissa McKinlay said of the fee waivers. \"This is tremendous .\" The Solid Waste Authority's debris monitoring contractor, Thompson Consulting Services, reports that debris removal is in full swing. Through Tuesday, 520,733 cubic yards of vegetative debris have been removed in Palm Beach County. Some of the largest municipalities in the county are also seeing progress in debris removal: 60,437 cubic yards of vegetative debris has been removed from West Palm Beach, 30,778 cubic yards from Boynton Beach, 12,359 cubic yards from Wellington and 12,119 cubic yards from Royal Palm Beach. Municipalities are expected to pay the Solid Waste Authority an estimated $9 million to have debris from their localities brought to SWA disposal sites, <mark>Hammond</mark> said. Solid Waste Authority officials continue to urge county residents to be patient as crews attempt to clear roads and neighborhoods. Authority Spokesman Willie Puz pointed out that Hurricanes Frances and Jeanne in 2004 \"generated a similar amount of yard waste and took 6 months to remove. Hurricane Wilma in 2005 also generated about 3 million cubic yards of material that took 4 1/2 months to collect. That is why we keep asking PBC residents to be patient during cleanup .\" Puz stressed that the cleanup will be faster and safer if residents put garbage and recyclables out by 6 a.m. on regularly scheduled days. All vegetative debris is to be put in its own pile and other construction storm debris is to be placed in a another pile. Garbage, recyclables and debris should be placed away from fences, mailboxes, power lines, canal banks, water meters, fire hydrants and storm drains, Puz said. About the Author WAYNE WASHINGTON Popular in News 1 2 3", "articleID": "2017092722_00162555_W", "names": {"Mark Hammond": ["Q20730236", "Q55181092", "Q6767898"]}}, {"date": "2017-09-28", "url": "http://www.postregister.com/articles/featured-news-daily-email/2017/09/27/fishing-good-old-times", "content": "<mark>Richard Adams</mark>, 89, casts as he floats along the Snake River near Swan Valley on Wednesday. <mark>Adams</mark> learned to fish on the river when he was four-years-old. & ldquo; I lived here all my life; my daddy before me and my grandpa before him, & rdquo; said <mark>Adams</mark> & ldquo; so we & rsquo; ve fished on this generation for three generations. & rdquo; \"> <mark>Richard Adams</mark>, 89, casts as he floats along the Snake River near Swan Valley on Wednesday. <mark>Adams</mark> learned to fish on the river when he was four-years-old .\" I lived here all my life; my daddy before me and my grandpa before him, \"said <mark>Adams</mark>\" so we've fished on this generation for three generations. \"Full text available to premium subscribers only. Please click here to read the entire story. Get today's digital edition for 99 cents. Read more about Fishing for the good old times", "articleID": "2017092801_00285226_W", "names": {"Richard Adams": ["Q21207257", "Q22022410", "Q26251073", "Q28007169", "Q313289", "Q3431521", "Q56426072", "Q57177983", "Q57242376", "Q6108680", "Q7323633", "Q7323634", "Q7323635", "Q7323636", "Q7323640"]}}]