[{"date": "2017-09-28", "url": "http://www.twincities.com/2017/09/27/adalberto-mejia-disappoints-in-chance-to-pitch-twins-into-postseason/", "content": "Minnesota Twins' Jorge Polanco forces out Cleveland Indians' Austin Jackson at second base and throws out <mark>Jose Ramirez</mark> at first base to complete the double play during the third inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' <mark>Jose Ramirez</mark> rounds third base on the way to scoring on a single by Edwin Encarnacion during the first inning in a baseball game against the Minnesota Twins, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins starting pitcher Adalberto Mejia delivers against the Cleveland Indians during the first inning of a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians starting pitcher Danny Salazar delivers against the Minnesota Twins during the first inning of a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes reacts after being hit by a pitch from Minnesota Twins starter Adalberto Mejia with the bases loaded during the fourth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins starting pitcher Adalberto Mejia walks off the field after being pulled after hitting Cleveland Indians' Yan Gomes with a pitch with the bases loaded during the fourth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins' Max Kepler makes a catch to get out Cleveland Indians' Jay Bruce during the fourth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians starting pitcher Mike Clevinger delivers against the Minnesota Twins during the fifth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' <mark>Jose Ramirez</mark> throws out Minnesota Twins' Jorge Polanco at first base during the sixth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes watches a solo home run off Minnesota Twins relief pitcher Michael Tonkin during the sixth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins' <mark>Eduardo Escobar</mark> throws to first base and is charged with an error on a ball hit by Cleveland Indians' Jay Bruce, which allowed Austin Jackson to score during the fifth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes steps on home plate after hitting a solo home run off Minnesota Twins relief pitcher Michael Tonkin during the sixth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins' Jorge Polanco rounds the bases after hitting a two-run home run off Cleveland Indians relief pitcher Cody Allen during the ninth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. The Indians won 4-2. (AP Photo/Ron Schwane) Cleveland Indians' Austin Jackson makes a leaping catch to get out Minnesota Twins' Joe Mauer during the ninth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. The Indians won 4-2. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes, left, and <mark>Carlos Santana</mark> celebrate a 4-2 victory over the Minnesota Twins in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Show Caption of Expand By Mike Berardino | mberardino @ pioneerpress.com | Pioneer Press PUBLISHED: September 27, 2017 at 9:21 pm | UPDATED: September 27, 2017 at 10:29 pm Sign up for newsletters and alerts CLEVELAND--If this was Adalberto Mejia's chance to secure a starting slot in a potential Twins postseason rotation, it didn't go very well. The burly 24-year-old left-hander failed to last four innings for the sixth time this season as the Twins fell 4-2 to the Cleveland Indians on Wednesday night at Progressive Field. \"Today was one of those days it didn't happen,\" Mejia said through a translator. \"There were good moments, I thought, and there were bad moments, but I tried .\" With their magic number down to one to end a seven-year postseason drought, the Twins would have to rely on the Chicago White Sox to eliminate their only remaining wild-card competitor, the Los Angeles Angels. The Indians still haven't lost consecutive games since Aug. 22-23, just before they embarked upon a 22-game winning streak. Even without any help, the Twins would still have four games left to become the first team in history to go from 98 or more losses to the postseason the following year. After dropping a Twins franchise-worst 103 games in 2016, the Twins have already improved by 24 wins, biggest year-over-year jump in Minnesota big-league history. Related Articles Key stretch of I-35W will close this weekend--despite major sports events <mark>Paul Molitor</mark> explains pitching change that wasn't in Tuesday's win Twins' Miguel Sano takes 60 swings after seeing two more specialists Late Brian Dozier homer lifts Twins to 8-6 win over Cleveland Indians Max Kepler returns to lineup, plays through bruised lower back Jorge Polanco kept the Twins from just their third shutout loss all year with a two-run homer off Cody Allen in the ninth. Through the first eight innings, Danny Salazar (nine strikeouts) and the vaunted Indians bullpen held the Twins to two hits: two-out doubles by Max Kepler in the second and Chris Gimenez in the fifth. Mejia started his night by walking Francisco Lindor after falling behind 3-0, and things only got marginally better from there. Edwin Encarnacion ripped a changeup for a two-out single to put the Indians ahead and give him 18 of his 104 runs batted in against the Twins, nearly twice his top total against any other opponent this season. \"I would think there would be some (nerves), given what's at stake,\" Twins manager <mark>Paul Molitor</mark> said before the game. \"I've been impressed by this kid all year long. His first one back, I thought he was over-amped and tried to overthrow. His second one was much more calm, under control and he pitched better .\" Mejia hasn't completed six innings in the majors since July 8. \"He's got the stuff to get any lineup out,\" <mark>Molitor</mark> said, \"if he's mixing it up and getting it over the plate .\" The Indians improved to 7-1 against the Twins when scoring first. It was just the second Twins road loss against the Indians in eight tries this season. Mejia then ran three-ball counts on four of seven batters as he pitched his way into trouble in the fourth. His night ended at 69 pitches with a bases-loaded plunking of Yan Gomes on the left calf to force in the second run. \"It seems like there's a lot of misfires that get his pitch counts up, but a lot of good pitches too,\" <mark>Molitor</mark> said. \"There's a fine line. I think he's got fairly good composure overall .\" Gomes added a solo homer off Michael Tonkin in the sixth. <mark>Eduardo Escobar</mark>'s throwing error with two down in the fifth let in the other Indians run. It was just the sixth error for <mark>Escobar</mark> in 76 games at third base but his third in the past three weeks. For Mejia, who missed five-plus weeks with upper arm soreness before returning in mid-September, this marked the 10th time he's failed to complete five innings. Just four times in 21 starts as a rookie has he gone six innings or longer. Mejia entered 1-1 with a 1.86 earned run average in two previous starts against the Indians, but he has now averaged just 4.4 innings against the American League Central champions. Should the Twins qualify for the postseason and knock off the New York Yankees in the Bronx behind staff leader Ervin Santana on Oct. 3, they figure to start the AL division series here against the Indians two days later. Whoever starts Game 1, whether it's <mark>Kyle Gibson</mark> or young <mark>Jose</mark> Berrios, could seem a better bet than Mejia to start a potential Game 4 (if necessary) in a best-of-five series. That would require either one to start on short rest, but Mejia's lack of efficiency has held him back for much of his rookie season. \"Obviously I couldn't get it done to help the team get into the postseason,\" Mejia said, \"but if the time comes and I get the opportunity to throw in a postseason game, I'll be ready. Mentally, physically, I'll be ready .\" ", "articleID": "2017092803_00356571_W", "names": {"Carlos Santana": ["Q2367902", "Q5042623", "Q819016"], "Eduardo Escobar": ["Q3048331", "Q5548489"], "Jose Ramirez": ["Q1101675", "Q2029119", "Q21755529", "Q3186538", "Q51754004", "Q6293802"], "Kyle Gibson": ["Q14878777", "Q24283915", "Q6451161"], "Paul Molitor": ["Q1972377", "Q93152"]}}, {"date": "2017-09-28", "url": "http://www.examiner.com.au/story/4955039/carrying-on-lewis-legacy/?src=rss", "content": "The Anzac spirit was alive and well at Campbell Town District High School on Thursday. Ajay Woods (fourth from left) receives the Lewis McGee Memorial Medallion at Campbell Town District High School on Thursday. View More Local Business List Your Business Here The Anzac spirit was alive and well at Campbell Town District High School on Thursday, with the inaugural awarding of the Lewis McGee Memorial Medallion. Ajay Woods, 11, from Avoca Primary School and Jonty Nicolson, 11, from Campbell Town District High School were named as the first ever recipients of the award in front of more than 100 community members. The ceremony was also used to mark the 100 th anniversary of the action which earned Sergeant McGee the Victoria Cross medal. The award was created to recognise students who show exceptional consideration and mateship throughout year. Thursday's event marked the culmination of a three-year journey for Campbell Town Anzac Group chairman <mark>Peter Evans</mark>, who was the driving force behind the award. He said the medallion was not just about commemorating Sergeant McGee. \"It's way for us to remember all the soldiers who have served bravely for Australia,\" he said. \"I was immensely proud to see the medallion awarded in front of an audience that included surviving members of the 12 th and 40 th battalions .\" It's great to be involved with the schools and to be able to give back after all they have done for us. \"Born in Ross, Lewis McGee spent much of his young life in Avoca before enlisting in the Australian Imperial Force during 1916 at the age of 27. He was posted to the 40th Battalion, and completed training in Tasmania and the United Kingdom, where he was promoted to lance corporal. After being transferred to the Western Front in November 1916, he was quickly promoted to corporal and then sergeant. It was during an attack on Broodseinde Ridge as part of the Passchendale Offensive where Sgt McGee's platoon suffered heavily casualties from machine gun fire 50 metres in front of their position. Armed with just a revolver Sgt McGee made his way forward alone and was able to seize control of the pillbox upon which the machine gun was set. His actions on October 4, 1917 reignited the 40 th Battalion's advance and earned him the Victoria Cross. Sgt McGee died in battle on October 12, 1917.", "articleID": "2017092810_00326419_W", "names": {"Peter Evans": ["Q17523824", "Q2074761", "Q2534758", "Q39089656", "Q52888475", "Q57986136", "Q7173890"]}}, {"date": "2017-09-28", "url": "http://communitynewspapergroup.com/sports/national/dad-battled-tiger-on-the-golf-course-son-is-now/article_3e448ef9-1aee-58f9-950a-83c37ab71875.html", "content": "Twitter surely must be God's gift to the transfer student. Weeks before arriving in Owasso, Ernest William Kuehne IV--also known as Will--had already befriended Rams receiver Dylan Chinn, using the social media site. When Kuehne (pronounced \"key-knee\" ) was finally on the ground in Ram Town, their friendship deepened. Soon, senior running back Bryce Cabrera joined the club. Today, the three are inseparable. They're also key components, along with Josh Proctor, <mark>Wayne Jones</mark>, Tyrese Sisson, Devin Tyler, <mark>Sam Thompson</mark>, Courtre Alexander, Tyler Moody and Duece Mayberry, in what has to be the reclamation project of the year in Oklahoma high school football. Coming off two sub-par seasons, in their first year under local coaching legend Bill Blankenship, the Rams are 4-0, ranked No. 2 and headed into a 7:05 p.m. Friday showdown at No. 1 Union, 6A Division I defending champion. Cox3 will televise a potential preview of the state final. Kuehne, a junior, needed less than two full weeks of spring practice to begin separating himself as the Rams' starting quarterback. In his first four starts, he's completed 71 percent of his passes for 989 yards and 14 touchdowns, with only one interception, leading an offense that averages 54 points and 495.1 yards per game. \"He's still a work in progress, but he has played well,\" Blankenship said. \"There's a whole lot he can improve on fundamentally, but it's encouraging to have a quarterback who's been able to do what he's done so far. He's always taking notes. He's a student of the game. He makes a point of trying to learn everything he's been exposed to .\" Owasso's fast start has ignited a mountainous surge in fan interest. An estimated 11,600 spectators saw the home opener against Broken Arrow three weeks ago. Rams athletic director Zach Duffield called it likely \"an all-time record for Owasso Stadium .\" Another 8,000 to 9,000 watched the district opener against Mustang last week. Union officials are expecting 13,000 on Friday. \"It's really exciting when the stands are full and the whole town comes out to watch us play,\" Kuehne said. \"That gets the whole team fired up. But we can't be focused on that. We have to focus on what we need to do to keep getting better .\" Kuehne couldn't be happier with his new hometown. \"I love it. It's a great place,\" he said. \"The people are awesome and I've really connected with the team. There's not much I don't like about it. I think it's the perfect place for me and for my family .\" Who is Kuehne and where did he come from? How did he arrive at the perfect moment, and with just the right skills necessary to run Blankenship's spread-the-ball, take-what-the-defense-gives-you system with near perfection? Some suspect he was recruited for the purpose. But as Kuehne tells the story, he recruited himself. Or his father did. Golf fans shouldn't have any trouble recognizing the name \"Trip\" Kuehne. The former Oklahoma State three-time All-American golfer--and Will's father--was part of a Cowboys' 1995 national championship team and received the Ben Hogan Award that same year as the nation's top collegiate golfer. In 1994, he was also part of the dramatic U.S. Amateur championship, finishing runner-up to his good friend and soon-to-be-legend, Tiger Woods. In the 36-hole, match-play final, Kuehne led by five holes with 12 to play at TPC Sawgrass in Ponte Vedra Beach, Florida. But Woods rallied in stunning fashion, foreshadowing his spectacular professional career. \"It was tough, but to that point, it was some of the best golf I've ever played in my life,\" Trip Kuehne said. \"Sometimes, you can play as good as you possibly can and come up on the short end of the stick. That's a little of what happened .\" The Dallas native saw the painful loss as an omen. Instead of turning pro, he returned to OSU to complete his master's degree and prepare for a business career. Today he runs a successful investment management company, Double Eagle Capital. Trip has never watched tape of the match, but he refers to it as \"a blessing in disguise .\" Once back in Stillwater, he met his future bride. The former Dusti Stuart was a Cowgirls basketball player from Shattuck. Had they not gotten together, there would be no Will Kuehne. This time last season, Will was a sophomore football player at Liberty Christian School in Argyle, Texas. The family was satisfied with Liberty, but for several reasons, Tripp had been looking to move his family north for several years. For starters, the Kuehnes are OSU season-ticket holders with multiple ties to the Stillwater campus. Dusti's father, the late Jiggs Stuart, was a letterman football and baseball player at Oklahoma A & M in the early \"40s .\" So there really is some orange that runs through our bodies, \"Trip said. Trip wanted to move his wife closer to her mother and Will wanted to move closer to his private quarterback trainers, Joe Dickinson and Joe McCulley. Dickinson is a former offensive coordinator at the University of Oklahoma, University of Tulsa and Central Oklahoma, with 35 years of college and high school coaching experience. McCulley is a former TU quarterback and offensive innovator who coached high school football at Grove, Tahlequah, Broken Bow, Coalgate, Kiowa and Hennessey. He was also superintendent at Hennessey (in western Oklahoma) before announcing his retirement in October 2015. He moved to Collinsville last year. Both were working with quarterbacks for DeBartolo Sports University, an organization dedicated to training young athletes, when Will and his father attended a DeBartolo event five years ago in Oklahoma City. At the time, Will was a sixth-grader at tiny Westlake (Texas) Academy. He had just been introduced to the idea of playing quarterback and wanted private instruction. More from this section +5 <mark>John Fox</mark>, Chicago Bears at a crossroads in Year Three of rebuild Tampa Bay Bucs' Gerald McCoy wants to talk to fans face-to-face to discuss frustrations Husker notes: Omaha North grad <mark>Michael Decker</mark> centers in on larger role; <mark>Chris Jones</mark> works out and more\" I figured if (Westlake's coaches) wanted me to do it, I wanted to be the best I could be, \"he said. Last year at Liberty, he played safety and a smattering of quarterback. He's also played receiver and linebacker. McCulley said Will's experience with other positions has given him a unique perspective for playing quarterback .\" He understands the physical part of the game, \"McCulley said .\" Nothing is more potentially demoralizing for a quarterback than getting hit, but I was noticing in the Jenks game that he was able to stand in there, take the hit and put the ball out there. He understands getting hit and getting up. It gives him a chance to be special. \"McCulley also likes Kuehne's\" innate ability \"to control his emotions .\" He has that temperament. It comes from being part of a family of athletes. He's been around athletes his whole life, \"McCulley said. Will's aunt and uncle were also standout golfers. Kelli Kuehne won four straight Texas high school state titles for Highland Park (1992-95), won the U.S. Women's Amateur in 1995 and had won an LPGA Tour tournamnet before injuries cut short her career. Hank Kuenhe played college golf at OSU and SMU and had four wins on the PGA Tour. Many consider the Kuehne siblings the most successful in U.S. amateur golf history. At least two or three years ago, Trip was considering private schools in the Tulsa area. McCulley had worked with Lincoln Christian's 2015 standout, Micah Wilson, and recommended Lincoln and a few others. Had the family moved then, Will might be playing for Cascia Hall, Lincoln or Holland Hall right now. But then, he couldn't have become Blankenship's bandleader. Blankenship won three state titles and 154 games over 14 Union seasons (1992-05). In 2012, he won a Conference USA title and Liberty Bowl in his best of four seasons at the TU helm. Trip said he knew Blankenship\" only by reputation. I knew he had coached at TU and was a great high school coach. We decided to move for our own reasons, but when Bill got the Owasso job (in January), it became kind of a no-brainer. Where else could you play high school football where the coach has won a (college) conference title and a bowl game? \"Will arrived in March, just in time for the final nine weeks of Owasso's school year. The family's Westlake home sold in 18 days, but their initial contract on an Owasso residence fell through before another property in Stone Canyon became available. Trip operates his business from a separate building that was used by the previous owner for his model-train hobby. The family belongs to The Patriot Golf Club, but Trip, a two-time Texas high school state champion at Highland Park and three-time Walker Cup qualifier, plays less golf than he once did. He's having more fun these days following his son's football career, and Will just isn't that interested in chasing the little white ball .\" His dream has always been to play quarterback and we're going to let him chase that dream and see how good he can be, \"Trip said. Then, he added with a chuckle,\" We keep his golf score by how many balls he loses. \"", "articleID": "2017092900_00275106_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"], "John Fox": ["Q12892062", "Q13459838", "Q19662010", "Q19750869", "Q24285717", "Q3809274", "Q44786513", "Q6233800", "Q6233806", "Q6233808", "Q6233810", "Q719030"], "Michael Decker": ["Q21064686", "Q47878431"], "Sam Thompson": ["Q19520038", "Q21067120", "Q55117887", "Q7408246", "Q7408247"]}}]