[{"date": "2017-09-28", "url": "http://communitynewspapergroup.com/sports/national/dad-battled-tiger-on-the-golf-course-son-is-now/article_3e448ef9-1aee-58f9-950a-83c37ab71875.html", "content": "Twitter surely must be God's gift to the transfer student. Weeks before arriving in Owasso, Ernest William Kuehne IV--also known as Will--had already befriended Rams receiver Dylan Chinn, using the social media site. When Kuehne (pronounced \"key-knee\" ) was finally on the ground in Ram Town, their friendship deepened. Soon, senior running back Bryce Cabrera joined the club. Today, the three are inseparable. They're also key components, along with Josh Proctor, <mark>Wayne Jones</mark>, Tyrese Sisson, Devin Tyler, <mark>Sam Thompson</mark>, Courtre Alexander, Tyler Moody and Duece Mayberry, in what has to be the reclamation project of the year in Oklahoma high school football. Coming off two sub-par seasons, in their first year under local coaching legend Bill Blankenship, the Rams are 4-0, ranked No. 2 and headed into a 7:05 p.m. Friday showdown at No. 1 Union, 6A Division I defending champion. Cox3 will televise a potential preview of the state final. Kuehne, a junior, needed less than two full weeks of spring practice to begin separating himself as the Rams' starting quarterback. In his first four starts, he's completed 71 percent of his passes for 989 yards and 14 touchdowns, with only one interception, leading an offense that averages 54 points and 495.1 yards per game. \"He's still a work in progress, but he has played well,\" Blankenship said. \"There's a whole lot he can improve on fundamentally, but it's encouraging to have a quarterback who's been able to do what he's done so far. He's always taking notes. He's a student of the game. He makes a point of trying to learn everything he's been exposed to .\" Owasso's fast start has ignited a mountainous surge in fan interest. An estimated 11,600 spectators saw the home opener against Broken Arrow three weeks ago. Rams athletic director Zach Duffield called it likely \"an all-time record for Owasso Stadium .\" Another 8,000 to 9,000 watched the district opener against Mustang last week. Union officials are expecting 13,000 on Friday. \"It's really exciting when the stands are full and the whole town comes out to watch us play,\" Kuehne said. \"That gets the whole team fired up. But we can't be focused on that. We have to focus on what we need to do to keep getting better .\" Kuehne couldn't be happier with his new hometown. \"I love it. It's a great place,\" he said. \"The people are awesome and I've really connected with the team. There's not much I don't like about it. I think it's the perfect place for me and for my family .\" Who is Kuehne and where did he come from? How did he arrive at the perfect moment, and with just the right skills necessary to run Blankenship's spread-the-ball, take-what-the-defense-gives-you system with near perfection? Some suspect he was recruited for the purpose. But as Kuehne tells the story, he recruited himself. Or his father did. Golf fans shouldn't have any trouble recognizing the name \"Trip\" Kuehne. The former Oklahoma State three-time All-American golfer--and Will's father--was part of a Cowboys' 1995 national championship team and received the Ben Hogan Award that same year as the nation's top collegiate golfer. In 1994, he was also part of the dramatic U.S. Amateur championship, finishing runner-up to his good friend and soon-to-be-legend, Tiger Woods. In the 36-hole, match-play final, Kuehne led by five holes with 12 to play at TPC Sawgrass in Ponte Vedra Beach, Florida. But Woods rallied in stunning fashion, foreshadowing his spectacular professional career. \"It was tough, but to that point, it was some of the best golf I've ever played in my life,\" Trip Kuehne said. \"Sometimes, you can play as good as you possibly can and come up on the short end of the stick. That's a little of what happened .\" The Dallas native saw the painful loss as an omen. Instead of turning pro, he returned to OSU to complete his master's degree and prepare for a business career. Today he runs a successful investment management company, Double Eagle Capital. Trip has never watched tape of the match, but he refers to it as \"a blessing in disguise .\" Once back in Stillwater, he met his future bride. The former Dusti Stuart was a Cowgirls basketball player from Shattuck. Had they not gotten together, there would be no Will Kuehne. This time last season, Will was a sophomore football player at Liberty Christian School in Argyle, Texas. The family was satisfied with Liberty, but for several reasons, Tripp had been looking to move his family north for several years. For starters, the Kuehnes are OSU season-ticket holders with multiple ties to the Stillwater campus. Dusti's father, the late Jiggs Stuart, was a letterman football and baseball player at Oklahoma A & M in the early \"40s .\" So there really is some orange that runs through our bodies, \"Trip said. Trip wanted to move his wife closer to her mother and Will wanted to move closer to his private quarterback trainers, Joe Dickinson and Joe McCulley. Dickinson is a former offensive coordinator at the University of Oklahoma, University of Tulsa and Central Oklahoma, with 35 years of college and high school coaching experience. McCulley is a former TU quarterback and offensive innovator who coached high school football at Grove, Tahlequah, Broken Bow, Coalgate, Kiowa and Hennessey. He was also superintendent at Hennessey (in western Oklahoma) before announcing his retirement in October 2015. He moved to Collinsville last year. Both were working with quarterbacks for DeBartolo Sports University, an organization dedicated to training young athletes, when Will and his father attended a DeBartolo event five years ago in Oklahoma City. At the time, Will was a sixth-grader at tiny Westlake (Texas) Academy. He had just been introduced to the idea of playing quarterback and wanted private instruction. More from this section +5 <mark>John Fox</mark>, Chicago Bears at a crossroads in Year Three of rebuild Tampa Bay Bucs' Gerald McCoy wants to talk to fans face-to-face to discuss frustrations Husker notes: Omaha North grad <mark>Michael Decker</mark> centers in on larger role; <mark>Chris Jones</mark> works out and more\" I figured if (Westlake's coaches) wanted me to do it, I wanted to be the best I could be, \"he said. Last year at Liberty, he played safety and a smattering of quarterback. He's also played receiver and linebacker. McCulley said Will's experience with other positions has given him a unique perspective for playing quarterback .\" He understands the physical part of the game, \"McCulley said .\" Nothing is more potentially demoralizing for a quarterback than getting hit, but I was noticing in the Jenks game that he was able to stand in there, take the hit and put the ball out there. He understands getting hit and getting up. It gives him a chance to be special. \"McCulley also likes Kuehne's\" innate ability \"to control his emotions .\" He has that temperament. It comes from being part of a family of athletes. He's been around athletes his whole life, \"McCulley said. Will's aunt and uncle were also standout golfers. Kelli Kuehne won four straight Texas high school state titles for Highland Park (1992-95), won the U.S. Women's Amateur in 1995 and had won an LPGA Tour tournamnet before injuries cut short her career. Hank Kuenhe played college golf at OSU and SMU and had four wins on the PGA Tour. Many consider the Kuehne siblings the most successful in U.S. amateur golf history. At least two or three years ago, Trip was considering private schools in the Tulsa area. McCulley had worked with Lincoln Christian's 2015 standout, Micah Wilson, and recommended Lincoln and a few others. Had the family moved then, Will might be playing for Cascia Hall, Lincoln or Holland Hall right now. But then, he couldn't have become Blankenship's bandleader. Blankenship won three state titles and 154 games over 14 Union seasons (1992-05). In 2012, he won a Conference USA title and Liberty Bowl in his best of four seasons at the TU helm. Trip said he knew Blankenship\" only by reputation. I knew he had coached at TU and was a great high school coach. We decided to move for our own reasons, but when Bill got the Owasso job (in January), it became kind of a no-brainer. Where else could you play high school football where the coach has won a (college) conference title and a bowl game? \"Will arrived in March, just in time for the final nine weeks of Owasso's school year. The family's Westlake home sold in 18 days, but their initial contract on an Owasso residence fell through before another property in Stone Canyon became available. Trip operates his business from a separate building that was used by the previous owner for his model-train hobby. The family belongs to The Patriot Golf Club, but Trip, a two-time Texas high school state champion at Highland Park and three-time Walker Cup qualifier, plays less golf than he once did. He's having more fun these days following his son's football career, and Will just isn't that interested in chasing the little white ball .\" His dream has always been to play quarterback and we're going to let him chase that dream and see how good he can be, \"Trip said. Then, he added with a chuckle,\" We keep his golf score by how many balls he loses. \"", "articleID": "2017092900_00275106_W", "names": {"Wayne Jones": ["Q2338144", "Q4160432", "Q7976374", "Q7976375"]}}, {"date": "2017-09-29", "url": "http://tdn.com/sports/m-s-need-moves-to-stay-relevant/article_12e88e36-0d71-53b4-ba61-5b5fe10b5a6f.html", "content": "SEATTLE--It was four years ago when, seeking to jolt the franchise out of its extended doldrums, the Mariners shocked the baseball world by shelling out $240 million to sign second baseman Robinson Cano to a 10-year deal. Numerous club officials admitted privately at the time that such a contract made little financial sense in strict baseball terms. While Cano was then one of the game's premier players, he had just turned 31. The Mariners were hoping for four-to-five years of peak performance before age began to erode (gradually they hoped) his skills. The massive deal only made sense when linked to a franchise reset with its waning fan base and within the industry. The Mariners wanted everyone to know they were committed to winning. Signing Cano was a statement. Results to date have been mixed but generally disappointing. Cano has been an All-Star in three of his four seasons in Seattle. It's also unlikely <mark>Nelson Cruz</mark> would have signed a year later as a free agent if not for the franchise commitment shown in signing Cano. The Mariners, after perennially slogging through the season's closing weeks, played meaningful games in September in three of the last four years. They twice went to the season's final weekend before getting eliminated from postseason contention. But their postseason drought is now up to 16 years. All 29 other clubs have experienced postseason since the Mariners' magical 2001 run ended in a disappointing loss to the New York Yankees in the American League Championship Series. It's time for the Mariners to make another offseason splash. Texas and the Los Angeles Angels are in the process of turning over veteran rosters and have shown a willingness to spend in order to win. Oakland faces severe financial challenges but has nonetheless assembled a deep group of talented youngsters. Bottom line: The AL West already has an emerging bully in Houston, and the Mariners' three other division opponents each show signs of improvement. It's an arms race that can't be ignored. The Mariners recognize all of this, and they've taken steps over the last two seasons under general manager Jerry Dipoto to transform their roster into a younger, more athletic collection. \"Look around our diamond,\" he said. \"Our catcher (Mike Zunino) is 26. Our shortstop (Jean Segura) is 27. Our third baseman (Kyle Seager) is 29. Our outfielders (Mitch Haniger, Ben Gamel and Guillermo Heredia) are all 25 or 26 .\" We're not an old team outside of looking at <mark>Cruz</mark> and Cano. \"The pitching staff offers a similar story. While <mark>Felix Hernandez</mark> is an old 31 (in terms of mileage), the remaining rotation candidates are under 30: Mike Leake is 29, <mark>James Paxton</mark> and Ariel Miranda are 28, <mark>Erasmo Ramirez</mark> is 27, Marco Gonzales is 25 and <mark>Andrew Moore</mark> is 23. Lefty relief specialist Marc Rzepczynski is 31, and setup man <mark>Nick Vincent</mark> is 30. But closer <mark>Edwin Diaz</mark> is 23. Emilio Pagan, James Pazos and Shae Simmons are 26. Dan Altavilla is 24. Prospects Thyago Vieira and Max Povse are 23. The obvious offseason target is Japanese two-way star Shohei Otani, who is expected to be posted for MLB consideration in coming weeks by the Nippon Ham Fighters of the Pacific League. Otani is 23, which means he is subject to the international spending limits, which effectively eliminates a bidding war. The Mariners plan to make a strong push. Early indications suggest Otani will make a decision prior to the Winter Meetings. Whatever happens with Otani, the Mariners' primary offseason needs are to acquire an impact starting pitcher, a first baseman and a center fielder. They could pursue a corner outfielder if they choose to move Haniger to center. Trades are possible and have been Dipoto's preferred player-acquisition approach, but the Mariners' thin farm system makes any impact addition difficult to obtain without significantly weakening another area. The offseason roster turnover projects to free roughly $20 million in payroll once guaranteed increases for Seager and Segura are computed along with projected pay hikes for a handful of arbitration cases. Further relief is on the horizon. <mark>Cruz</mark>'s contract runs one more year at $14 million, and <mark>Hernandez</mark>'s deal runs two more years for a guaranteed $53 million. Neither is well positioned for a significant new contract. <mark>Hernandez</mark>'s form dipped significantly over the last three seasons, and while <mark>Cruz</mark> remains one of the game's premier sluggers, any new deal will start with his age-39 season. Signing an impact free agent will be costly, but big deals in recent years for <mark>Hernandez</mark>, Cano, <mark>Cruz</mark>, Seager and Segura suggest the Mariners are willing to spend money on what they view as reliable assets. So who's available on the free-agent market? The big splash for the rotation would be Yu Darvish, whom the Mariners know well from his time in Texas. Other high-impact possibilities are Jake Arrieta and <mark>Masahiro Tanaka</mark>. Signing Darvish or <mark>Tanaka</mark> could aid the Mariners in recruiting Otani, although getting either one signed--even assuming mutual interest develops--prior to Otani making a decision seems a long shot. More-likely rotation targets include Alex Cobb or Lance Lynn. The market is loaded with first basemen, including the Mariners' current duo of Yonder Alonso and Danny Valencia. The big name is Eric Hosmer, but the Yankees and Boston are expected to pursue him which, if so, could quickly escalate into a bidding war. The more likely possibilities for the Mariners are Lucas Duda or Mitch Moreland. The Mariners could choose to fill their need for a center fielder by retaining free-agent Jarrod Dyson, who could again form an effective platoon tandem with Guillermo Heredia. The best available free-agent center fielder is Dyson's old teammate in Kansas City: Lorenzo Cain, who figures to draw heavy interest. Possibilities widen if the Mariners shift Haniger to center field on a full-time or part-time basis. The top available free-agent corner outfielders are J.D. Martinez, Jay Bruce and possibly Justin Upton (if he opts out of his current contract).", "articleID": "2017092901_00231986_W", "names": {"Andrew Moore": ["Q17144472", "Q30597809", "Q4758056", "Q4758057", "Q4758058", "Q4758059", "Q506356"], "Edwin Diaz": ["Q11290336", "Q5346370"], "Erasmo Ramirez": ["Q3055980", "Q5384933"], "Felix Hernandez": ["Q1196594", "Q58310246"], "James Paxton": ["Q28054192", "Q6141080"], "Masahiro Tanaka": ["Q11575599", "Q11575656", "Q911463"], "Nelson Cruz": ["Q1133784", "Q11957344", "Q6990454"], "Nick Vincent": ["Q3339807", "Q7028082"]}}, {"date": "2017-09-29", "url": "http://www.oxfordmail.co.uk/leisure/musics/15567743.A_different_beat__Radiohead_drummer_makes_music_for_a_film/", "content": "Making movies: Philip Selway has stepped out from behind the drum kit to work on the music for the film Let Me Go 0 comments Get the latest local news straight to your inbox every day Sign up doc Radiohead drummer Philip Selway tells <mark>Tim Hughes</mark> about his first film soundtrack CONSIDERING his place in one of the world's biggest, and certainly best, rock bands, Philip Selway is a modest soul. While less impressive artists brag and show off, the Radiohead drummer is the embodiment of cool. He speaks quietly and intelligently and is polite throughout. He is one of rock's few true gentlemen. You wouldn't think he had been headlining the Pyramid Stage at Glastonbury just three months ago. \"I'm back home in Oxfordshire, which is good,\" he chuckles. \"There's time to take stock of everything that's going on and also to do some writing .\" It's been a busy year, with an epic Radiohead tour culminating in that Glasto show, in front of more than 100,000 fans and millions more on TV worldwide. But it is his latest project which has got him excited, ranking as a highpoint in a glittering career for the father of three, who lives in rural west Oxfordshire. Again demonstrating his ability as a composer, he has stepped from behind the drum kit, this time to write his first film soundtrack. Called Let Me Go, the movie, which premiered this month in Leicester Square, stars Juliet Stevenson and up-and-coming talent Lucy Boynton, and was produced by Lizzie Pickering, from Lyneham, near Burford, and directed by BAFTA-nominated Oxford University alumnus Polly Steele. Based on the true story of <mark>Helga Schneider</mark>, whose mother abandoned her as a four-year old to become a guard at Auschwitz during the Second World War, the film is a thought-provoking story of mothers and daughters over four generations. A thoroughly Oxford project, the soundtrack was recorded at Nick Moorbath's Evolution Studio, in Osney Mead, west Oxford. Nick is the former owner of the Zodiac in Cowley Road, once partly owned by Radiohead and the location for the video to their anthem Creep. Let Me Go has already won an award for Best Ensemble at Geena Davis's Bentonville Film Festival, in the US, which supports women in film (as well as having a female director and producer and four strong female cast members more than half the crew were women). The soundtrack follows Philip's previous solo albums, 2010's Familial and 2014's Weatherhouse. So how did the process of writing a soundtrack differ? \"There are some parallels,\" he says. \"Working in Evolution with Nick also felt very familiar and was a fruitful process .\" Some of the pieces keyed into what I'd done with the band and my solo stuff, but obviously there's a thing of fitting into a whole creative project, and at the heart of it is <mark>Helga Schneider</mark>'s true story and Polly Steele's interpretation and screenplay. There were all these other elements to respond to cinematically and in the performances themselves. \"From the outset I was writing pieces from just the screenplay and knowing who's going to play what role, and that was a productive time. But I also knew I had to release a soundtrack album that could be convincing in its own right .\" The result is haunting, brooding and quite beautiful. \"It was an emotional, rather than physical journey,\" says Philip, who as part of Radiohead has sold well over 30 million albums and racked up multiple awards. \"The film was chiefly set in Vienna, which also feeds into the tone of the music .\" It also makes it a little gloomy, I suggest. \"Yeah,\" he agrees. \"It deals with some weighty issues and contrasts between light and dark. It is looking at how generational trauma plays out and what <mark>Helga Schneider</mark>'s role was in Auschwitz. These are all deeply disturbing and emotionally rich subjects and they lead you in a particular way musically .\" And he enjoyed working close to home. \"There's a wealth of talent in Oxford and to be able to benefit from that and highlight that is great,\" says the keen Oxford United fan. \"It was brilliant working with Nick Moorbath again too. I have known him for a long time, since he ran the Cold Room studios in Cumnor when we first started to put ourselves out as a band. Nick is so central to the growth of Oxford's music scene. At the heart of his studio is a lovely mixing desk, and the studio reflects his personality. He's very talented as a musician and engineer .\" The release of the film, which is screened at the Ultimate Picture Palace off Cowley Road on October 11 and 12, and the soundtrack, out on vinyl and CD on the Bella Union label on October 27, tops an extraordinary year for Philip, including that Radiohead Glastonbury set, which he says was one of the highlights of his career. \"We spent the year working towards that,\" he says. \"It was an amazing experience being on that stage and having the opportunity to go back and do it again 20 years after our first headline set in 1997 .\" It's a good indication of what we've done as a band in that time. \"Looking back over the years, what has been his highpoint with Radiohead?\" I don't think I can narrow it down to one thing, but as a band I'd say some of our playing this year. It hit a new level for us and to actually get to this point is brilliant. \"So with Oxford fans deprived of a local show since 2005's South Park triumph, might we finally see another homecoming concert?\" There are no plans at the moment--but as with everything we do, never say never! \"In the meantime there is the question of the next Radiohead album, and Oxford United's new season to think about\" They have shown so much progress, \"he laughs .\" They are a championship team in the making! \"Let Me Go is at the Ultimate Picture Palace, Oxford on October 11 & 12. Order Philip Selway's album at bellaunion.greedbag.com 0 comments", "articleID": "2017092918_00053179_W", "names": {"Helga Schneider": ["Q3784531", "Q38473634"]}}]