[{"date": "2017-10-04", "url": "http://www.sport.co.uk/football/scotland-boss-gordon-strachan-is-excited-ahead-of-deci/9126262/", "content": "Scotland boss <mark>Gordon Strachan</mark> is \"excited' ahead of decisive qualifiers Tweet 04 October 2017 03:49 <mark>Gordon Strachan</mark> is feeling excitement more than any other emotion ahead of Scotland's decisive World Cup qualifiers. Scotland hauled themselves back into contention ahead of Thursday's visit of Slovakia after a disappointing start to Group F, when they took four points from their opening four matches. <mark>Strachan</mark>'s side have since gained 10 points from their next four and were only denied a clean sweep by England striker <mark>Harry Kane</mark>'s dramatic equaliser at Hampden Park in June. SCOTLAND | The squad were back at it this morning with final preparations ahead of #SCOSVK tomorrow evening. pic.twitter.com/XLLzcGsyaE--Scottish FA (@ ScottishFA) October 4, 2017 The Scotland boss looked to be moments from ending his reign before <mark>Chris Martin</mark> popped up with a late winner against Slovenia in March, so it is no surprise he is relishing the chance to lead his country to the play-offs. Victories over both Slovakia and Slovenia this week would secure second spot in Group F and a likely two-legged encounter in November for a place in Russia next summer. <mark>Strachan</mark> said:\" Forget how big it is, it's how exciting it is. And it's really exciting. Forget the rest of the emotions, excitement takes over the whole thing. \"When you have a challenge, excitement comes along. It's really exciting for me and really enjoyable taking on this challenge with the players. Two matches to go. It's in our hands. #SCOSVK pic.twitter.com/MLlOHKy0gp--Scottish FA (@ ScottishFA) October 4, 2017\" We try and start at the same level where we are all looking forward to joining up with each other. There's always a good buzz when we meet, but obviously the buzz is higher if you have got those couple of wins under your belt. \"<mark>Strachan</mark>'s frame of mind will no doubt have been boosted by the way his side handled that clash with Slovenia, which the 60-year-old unusually branded a\" must-win \"game. Ticket sales were nearing the 45,000 mark as <mark>Strachan</mark> spoke and the national boss feels the Hampden crowd can continue helping his team over the line .\" There were times against Slovenia when we needed their help and they gave us their help, there were times against England when we needed their help to get back in it, \"<mark>Strachan</mark> said. Scotland boss <mark>Strachan</mark> says Barry Bannan produced the best performance he has seen over the last 3-4 weeks--Gavin McCafferty (@ GavinMcCafferty) October 4, 2017\" Between the players and the fans we have dragged ourselves back in the position where we can determine our own future. \"The Scotland manager has had a fairly settled team since the Slovenia game, when he built his team around a Celtic core, but he has decisions to make after injured Parkhead midfielders <mark>Scott Brown</mark> and Stuart Armstrong pulled out, along with Newcastle's Matt Ritchie. Celtic midfielder <mark>Callum McGregor</mark> and Hibernian's John McGinn both hit doubles at the weekend as they challenge for a place in the centre of the park, but <mark>Strachan</mark> revealed that Barry Bannan's display in Sheffield Wednesday's 3-0 victory over Leeds on Sunday had given him a real chance of starting .\" You talk about John McGinn and <mark>Callum McGregor</mark>, probably the best performance I have seen over the last three or four weeks is Barry Bannan's, so he is certainly at the forefront of what we are trying to do, \"<mark>Strachan</mark> said. Source: By PA Sport Staff", "articleID": "2017100416_00390874_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"], "Scott Brown": ["Q15047261", "Q155125", "Q314160", "Q47233855", "Q7436044", "Q7436045", "Q7436046", "Q7436047", "Q7436048", "Q7436049", "Q7436050", "Q7436051", "Q7436052", "Q933673"]}}, {"date": "2017-10-05", "url": "http://theherald.com.au/story/4970051/knights-confirm-signing-of-origin-prop-lillyman/?cs=12&utm_source=latestnews&utm_medium=cpc&utm_campaign=Latest", "content": "\"The Knights have got some great young players, especially in the forwards, and I am keen to help them in their development .\" View More Local Business List Your Business Here The Knights have taken another step in their NRL rebuild, signing veteran prop Jacob Lillyman on a one-year deal. RECRUIT: Jacob Lillyman His recruitment comes just two days after the club had announced premiership-winning Melbourne forward Slade Griffin has also been lured to Newcastle until the end of the 2019 season. With 250 NRL games and 14 State of Origin matches for Queensland, the long-serving Warriors' prop brings a wealth of experience to the Knights' young roster. Already on the recruitment list are Brisbane duo Herman Ese’ese and Tautau Moga, and Sydney Roosters pair Aidan Guerra and Connor Watson. The biggest fish is North Queensland teenage sensation Kalyn Ponga. \"Newcastle is a good young team on the up and I'm really looking forward to getting over there and getting stuck in,\" the 33-year-old Lillyman said in a statement on the club's website on Thursday. \"I think the Knights have got some great young players, especially in the forwards, and I am keen to help them in their development .\" Newcastle is a very proud rugby league region and town and I can't wait to experience that, first hand. \"Lillyman could soon be joined at the Knights by another front-row veteran, Chris Heighington, who has reportedly been released by the Sharks. Meanwhile, <mark>Anthony Griffin</mark> will guide Penrith until the end of the 2020 NRL season after Panthers boss <mark>Phil Gould</mark> confirmed a two-year extension for the head coach at their end-of-season awards night this week. Following a semi-final finish this year, <mark>Gould</mark> praised <mark>Griffin</mark> for being just the second coach in the club's history to lead the Panthers to consecutive finals appearances. The former Brisbane mentor had been tipped to remain at the foot of the mountains since midway through the year and <mark>Gould</mark> announced the deal on Wednesday night .\" He's had a wonderful start to his term here at Panthers, \"<mark>Gould</mark> said .\" His first two years at the club we've qualified for the finals. It's the first time we've been back-to-back finals for something like 15 years, and only for the third time in the club's history. \"He becomes only the second coach to do it in his first two years of coaching the Panthers .\" So much so that he's been rewarded with an extension of his contract until the year 2020, he brings a lot of great qualities to our club. \"But while <mark>Griffin</mark>'s long-term plans has now been finalised, speculation continues to surround the short-term future of star captain Matt Moylan. Despite being in rehabilitation to address mental issues since the start of the finals series, the Panthers five-eighth is believed to want out and has been linked with a number of rival clubs. <mark>Gould</mark> made no mention of Moylan's status on Wednesday, but insisted forward Sitaleki Akauola would be the only player to depart from this year's squad. He said 24 players of next year's 30-man squad will have come through their program .\" And that's really special for us, so much so that we do not have to recruit a player from outside this club for the next two years, provided we retain all the players that we've got, \"he said .\" This year we will only lose one player, Sitaleki Akauola. We're not recruiting one player from another club because we've developed from within and we've built from within. \"<mark>Gould</mark> also said their premiership window was open for the next two seasons and pre-empted the salary cap squeeze would follow .\" It's a fact of life that salary cap will erode into this, \"he said .\" As I've said to all the players, as soon as one of you wants a few more dollars, someone else has got to go. If someone else wants a few more dollars, that's another that's got to go. \"But our window of opportunity over the next two years when we don't have to recruit from outside, and we don't have to lose a player, gives this team and this club an opportunity to do something really special. I want to see it happen with this group of people .\" ", "articleID": "2017100507_00300267_W", "names": {"Anthony Griffin": ["Q4772632", "Q4772633"], "Phil Gould": ["Q7181928", "Q7181933"]}}, {"date": "2017-10-06", "url": "http://www.crainscleveland.com/article/20171006/blogs06/137961/trust-tito-reaches-new-level-after-bauers-game-1-gem", "content": "October 06, 2017 9:41 am \"Trust in Tito' reaches new level after Bauer's Game 1 gem Cleveland Cavaliers Cleveland Indians Kevin Kleps Radio Photo by Joe Sargent/MLB Photos Trevor Bauer threw 6 2/3 shutout innings against the Yankees in Game 1 of the American League Division Series on Thursday night, Oct. 5. Against a New York Yankees team that led MLB in home runs and was second in runs scored, Terry Francona picked his third-best starting pitcher for Game 1. Wait, what?\" Trust in Tito \"is now as much a part of the Northeast Ohio sports dialogue as\" Strive for greatness \"and (choose the phrase you most often yell at the TV during Browns games). But the Bauer move seemed as if the Tribe was getting a little too cute, considering the opponent and stakes. What the heck do we know? Bauer threw 6 2/3 shutout innings Thursday night in Game 1 of the American League Division Series, the Indians posted their sixth shutout victory in 16 postseason games dating back to last year, and Kluber will take the mound Friday night, when a win would put the Tribe one victory short of back-to-back ALCS appearances for the first time in 19 years. Basically, Thursday was a continuation of a theme that started last July, and hasn't really stopped. Francona, Chris Antonetti and <mark>Mike Chernoff</mark> can do almost no wrong--even in a sport that can be more odd than some of Bauer's past interview sessions. Since July 27, Bauer is 10-1 with a 2.23 ERA and 1.15 WHIP. He's allowing 8.2 hits and 2.1 walks per nine innings (down from his respective season norms of 9.2 and 3.1), and he's struck out 93 batters in 84 2/3 frames. In three starts against the Yankees in 2017, he's 3-0 with a 0.92 ERA and 19 Ks in 19 2/3 innings. He's yielding only 5.9 hits per nine against a lineup that also finished in the top five in MLB in on-base percentage, slugging and OPS. Thursday night, only four of the 23 batters Bauer faced reached base, and he faced only three over the minimum in recording 20 outs. He got a boost from an incredible catch by Jason Kipnis on a line drive to center field by Chase Headley to lead off the third inning. Kipnis, a two-time All-Star, was moved from second base to center for 11 regular-season games in another\" wait, what? \"move by Francona that now looks brilliant. And just as <mark>Andrew Miller</mark>--the Tribe's prized acquisition at the 2016 trade deadline--did last October, the front office's big summer move looked even better in Game 1. Jay Bruce--acquired from the Reds in August, after the Indians beat out the Yankees in the bidding because they, unlike the Bronx Bombers, were willing to take on the $4 million that remained on the outfielder's contract--doubled, homered and hit a sacrifice fly in his first three trips to the plate. Bruce was acquired for Ryder Ryan, a 30th-round draft pick by the Indians in 2016 who spent the entire 2017 campaign in Single-A. He's 22 and has a 4.07 ERA and 1.40 WHIP in two years down on the farm. Maybe Ryan will end up being an effective reliever. It doesn't matter, though. Bruce was the piece the banged-up Indians desperately needed at the time, and with Michael Brantley on the roster only as a pinch hitter, he's every bit as crucial in the postseason. Thursday night, it was as if every big decision was on display. And again, the Tribe's decision-makers hit it out of the park. Do you have MLB Network? Time to check Depending on your level of baseball fandom, you might not even be aware if you have the MLB Network. Well, unless you're going to be at Progressive Field or a bar early Friday night, you should check. Game 2 of the Indians-Yankees series is the second of two exclusive postseason broadcasts by MLB Network. Baseball's signature channel, as this Sports TV Ratings piece outlines, is in about 62.4 million homes. That's almost 23 million below FS1 (85.3 million) is 25.3 million fewer than ESPN (87.5 million). MLB sent out a news release this week that Thursday's Astros-Red Sox and Friday's Indians-Yankees games on MLB Network would also be available via free preview for customers of Armstrong, Cablevision (Optimum), Comcast (XFINITY), Cox, DISH, Fidelity, Frontier, Grande, GVTC, Mid-Hudson Cable, Norwood Light Broadband, RCN and Verizon FiOS. MLB partnered with those providers for an eight-day free preview that runs until Oct. 11. That, however, isn't enough to cover all of the fans whose providers don't have MLB Network. Again, we recommend you check, and soon. Cavs strike contract with iHeart just in time The Cavs and Lake Erie Monsters announced a radio deal with iHeartMedia Cleveland on Thursday, and it turns out, it really went down to the wire. The NBA team and the American Hockey League club struck multiyear agreements with iHeart, which means WTAM-AM, 1100, and WMMS-FM, 100.7, will remain the flagship stations of the Cavs. After the deal was made public, a source told Crain's that the previous agreement was expiring prior to the 2017-18 season. That's a moot point now, as the two Cleveland stations will power the 30-station Cavs Radio Network, which the release says\" reaches 38 states and half of Canada. \"It also means WMMS-HD2, 99.1 FM, remains the Monsters' radio home. The station will air all 76 regular-season broadcasts for the second consecutive year. The Cavs also announced that they reached an extension with Murray Hill Broadcasting's 87.7 FM La Mega to continue the team's Spanish radio broadcasts, which are led by play-by-play voice Rafael Hernandez Brito. This will be Year 7 with <mark>John Michael</mark> as the radio voice on the Cavs Radio Network, and Jim Chones will be in his eighth season as the color analyst. <mark>Mike</mark> Snyder, in Year 26, will anchor the pregame, halftime and postgame coverage.", "articleID": "2017100614_00540222_W", "names": {"Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"], "John Michael": ["Q16209656", "Q21556337", "Q6248613", "Q6248615"], "Mike Chernoff": ["Q1176973", "Q21091663"]}}, {"date": "2017-10-06", "url": "http://blogs.edf.org/energyexchange/2017/10/06/climate-and-clean-energy-progress-continues-in-spite-of-clean-power-plan-repeal-rumors/", "content": "By Charlie Jiang According to news reports, Environmental Protection Agency (EPA) Administrator Scott Pruitt is planning to start the process of repealing the Clean Power Plan very soon. This seriously flawed and misguided effort would be a dangerous step backwards for public health and climate protections. However, as the Trump Administration continues to unravel these protections, the transition to a clean energy future is accelerating. States, cities, and power companies are responding to the ongoing attacks by forging ahead with ambitious actions to slash carbon pollution in order to respond to the threat of climate change and accelerate the clean energy revolution. Clean Power Plan repeal? The Clean Power Plan is a common-sense rule to safeguard public health by reducing carbon pollution from power plants to 32 percent below 2005 levels by 2030. The Clean Power Plan would prevent: 3,600 premature deaths each year 1,700 heart attacks each year 90,000 asthma attacks each year Administrator Pruitt reportedly intends to propose repealing the Clean Power Plan in the coming days. If so, EPA will likely issue an \"Advance Notice of Proposed Rulemaking\" (ANPR) to solicit public input on a replacement rule--a protracted process that is likely to lead to a far weaker standard. The ANPR process could lead to years of harmful and unjustified delay in implementing urgently needed limits on carbon pollution from fossil fuel power plants. Climate and clean energy progress continues in spite of Clean Power Plan repeal rumors Click To Tweet Powered By CoSchedule Forging ahead to a clean energy future The U.S. power sector has already made enormous strides in deploying clean energy resources and slashing greenhouse gas emissions. Wind and solar comprised more than 60 percent (roughly 16.5 gigawatts) of new utility-scale generating capacity added in 2016. In March of this year, wind and solar exceeded ten percent of the nation's electricity generation for the first time in history--even as coal's share of the energy mix has declined to historic lows. The clean energy sector now employs more than three million Americans, and continues to grow rapidly: American Wind Energy Association Solar Jobs Census 2016--The Solar Foundation, interactive map Globally, the International Energy Agency (IEA) reported yesterday that renewables accounted for almost two-thirds of new capacity installed. Solar additions worldwide grew faster than any other fuel last year, including coal and natural gas. Over the next five years, the IEA projects renewable capacity to grow by over 920 gigawatts--a 43 percent increase by 2022. Meanwhile, by the end of 2016, carbon pollution from U.S. power plants had already declined to 25 percent below 2005 levels--meaning the power sector is already almost 80 percent of the way to achieving the Clean Power Plan's 2030 targets. A new report by the Institute for Policy Integrity highlights the falling costs of complying with the Clean Power Plan. The report points to several market and policy developments including low natural prices, declining renewable energy costs, the 2015 renewable energy tax credit extensions, and state programs supporting the adoption of clean energy technologies. By the end of 2016, carbon pollution from U.S. power plants had declined to 25 percent below 2005 levels. The Clean Power Plan targets have become a floor for forward-looking states and companies that acknowledge the Clean Power Plan was a first step towards realizing the promise of a low-carbon power sector. Yet this shift towards clean energy--driven by market forces and accelerating subnational action--is no substitute for decisive federal action that will ensure continued and accelerated progress in achieving the emissions reductions required to stem the tide of climate change. The U.S. Energy Information Administration projects that without the Clean Power Plan, carbon emissions from the power sector will increase by 2030--reversing the current downward trajectory in the United States and leaving the country behind as the global clean energy revolution continues. States and cities step up To keep us moving forward, state and local officials are stepping up their game by cutting carbon pollution and switching to clean energy in spite of--and in direct response to--President Trump's rollbacks. Fourteen states and Puerto Rico, accounting for more than 10 percent of U.S. carbon emissions from the power sector, pledged as part of the new U.S. Climate Alliance to reduce their greenhouse gas emissions consistent with the goals of the Paris Agreement, as well as meet or exceed their Clean Power Plan targets. 381 mayors (and counting) representing more than 67 million Americans also pledged to honor the Paris Agreement goals and work to meet the 1.5 ° Celsius global temperature target. Dozens of cities have committed to move to 100 percent clean energy. Colorado Governor John Hickenlooper signed an executive order in July 2017 committing the state to slash greenhouse gas emissions to 26 percent below 2005 levels by 2026, consistent with U.S. goals under the Paris Agreement. \"The vast majority of our residents, and indeed the country, expect us to help lead the way toward a clean and affordable energy future,\" Governor Hickenlooper said in a press release. Nine states comprising the Regional Greenhouse Gas Initiative (RGGI) in August announced a proposal to cut carbon pollution from the power sector an additional 30 percent between 2020 and 2030--a 65 percent reduction below the original 2009 pollution cap. The proposal demonstrates bipartisan commitment to combat climate change, with five Republican and four Democratic governors helming the RGGI states (Connecticut, Delaware, Maine, Maryland, Massachusetts, New Hampshire, New York, Rhode Island, and Vermont). Meanwhile, both New Jersey gubernatorial frontrunners have pledged to rejoin RGGI after this year's election. Virginia regulators are working to establish a \"trading-ready\" program to slash power plant carbon emissions in response to an executive order Governor <mark>Terry McAuliffe</mark> signed in May 2017. \"Today, I am proud to take executive action to cut greenhouse gases and make Virginia a leader in the global clean energy economy,\" Governor <mark>McAuliffe</mark> said when he signed the order. California affirmed its position as a global leader on climate progress with a bevy of actions in the past year. In September 2016, legislators passed SB 32, which requires the state to slash greenhouse gas emissions to 40 percent below 1990 levels by 2030. In July 2017, the state secured a 10-year extension to its landmark cap-and-trade program and strengthened tools to improve local air quality in a bipartisan effort. \"All over the world, momentum is building to deal seriously with climate change,\" Governor <mark>Jerry Brown</mark> said in July. \"Despite rejection in Washington, California is all in .\" At least 20 states and the District of Columbia have adopted ambitious greenhouse gas reduction targets, with most aiming for an 80 percent reduction by 2050 below baselines ranging from 1990 to 2006. Twenty-nine states and D.C. have binding renewable portfolio standards in place, while eight more have set renewable portfolio goals. Twenty states have set mandatory energy efficiency targets, while eight more have set energy efficiency goals. Company pledges The nation's largest power companies are similarly pledging to slash carbon pollution and deploy renewable energy resources as they embrace the rapid transition to a clean energy economy. The CEO of American Electric Power (AEP), the country's largest generator of electricity from coal, had this to say in response to President Trump's decision to withdraw the U.S. from the Paris Agreement: \"I think it's really important for us to stay engaged from an international community standpoint, particularly addressing large issues. And not withstanding that, we're continuing on our path of moving to a clean energy economy .\" AEP has cut carbon pollution by 44 percent since 2005, and has plans to add more than eight gigawatts of wind and solar in the coming years. Duke Energy, the nation's largest power producer, this year announced plans to reduce carbon emissions to 40 percent below 2005 levels by 2030. \"Our next major investment platform focuses on generating cleaner energy,\" said CEO Lynn Good. \"Our retirement of more than 40 older, less efficient coal units, coupled with the addition of clean natural gas plants and renewables, is driving our emissions reduction .\" DTE Energy Co. announced plans in May 2017 to curb its carbon emissions more than 80 percent by 2050 by closing coal-fired power plants and adding new gas-fired generation and renewables. \"Not only is the 80 percent reduction goal achievable--it is achievable in a way that keeps Michigan's power affordable and reliable,\" DTE Chairman and CEO <mark>Gerry Anderson</mark> said. \"There doesn't have to be a choice between the health of our environment or the health of our economy; we can achieve both .\" Xcel Energy committed in June 2017 to achieving a 60 percent reduction in carbon emissions by 2030, relative to 2005 levels. In August, the company announced plans to retire two coal-fired units in Colorado, continuing its progress towards a cleaner generating portfolio. In addition, Xcel's massive new investments in renewable energy--including a proposal to add 3,380 megawatts of wind generation across seven states--will help the company generate 40 percent of its energy from renewables by 2021. Berkshire Hathaway Energy subsidiary MidAmerican Energy has announced a goal to provide 100 percent renewable energy, including a $3.6 billion project to add 2,000 megawatts of wind, which will expand wind energy to 85 percent of the company's sales. Said CEO Bill Fehrman: \"Our customers want more renewable energy, and we couldn't agree more .\" Minnesota Power, a division of ALLETE, plans to provide 44 percent of its electricity from renewable resources by 2025. Said one executive, \"We look forward to working with our customers and regulators to continue down the path toward a safe, reliable, cleaner and affordable energy future .\" The imperative of addressing climate change, overwhelming public support for climate action, and clear market trends towards lower-carbon energy resources are driving states, cities, and power companies to lead the way to a low-carbon future. If governors, mayors, and power sector CEOs continue to take steps to reduce carbon pollution, they will realize the tremendous benefits of a clean energy economy--thousands of new jobs, critical public health protections, and increasingly resilient communities and infrastructure. The Trump Administration's effort to repeal the common-sense Clean Power Plan--its latest attack on life-saving safeguards for our children's health--will not change the reality of climate change or the accelerating transition to an economy powered by low-carbon energy. However, without a quick return to meaningful federal progress, the U.S. will fall further behind in the global clean energy revolution--one that could lead to shared prosperity and enormous opportunities for millions of Americans. This post originally appeared on our Climate 411 blog. Related Posts 3 Ways the Clean Power Plan Will Strengthen Our Economy What Do the 2016 Elections Mean for the Clean Power Plan? The Clean Power Plan: Driving Down Electricity Bills for Families", "articleID": "2017100616_00420201_W", "names": {"Gerry Anderson": ["Q5552638", "Q596137"], "Jerry Brown": ["Q152451", "Q717620"], "Terry Mcauliffe": ["Q3518911", "Q49001865"]}}]