[{"date": "2017-10-07", "url": "http://www.cbr.com/nycc-dc-comics-batman-future-plans/", "content": "Share On Facebook Tweet Pin It Email Comment It's time for a DC Comics convention staple! The writers and artists behind Batman in Rebirth have been brought together on stage today at New York Comic Con to spill Gotham City's secrets. The panel includes <mark>Tom King</mark>, <mark>Scott Snyder</mark>, Sean Gordon Murphy, Cully Hamner, Tony Patrick, and James Tynion IV. CBR is there live to bring you the latest news and announcements as they happen, so keep hitting refresh! DC All Access host Jason Inman took the stage to announce the panel, including Marguerite Bennett who had not been announced previously. Batman: The Signal was up first with Cully Hamner talking about his Duke design. \"The reversed-out Bat symbol on his chest is reflective so it can pick up light and maybe confuse enemies .\" Inman asked writer Tony Patrick if he was intimidated about taking on a project with <mark>Scott Snyder</mark>. \"No not at all,\" Patrick laughed, \"This was like Duke training with Batman for me. Months of training with <mark>Scott Snyder</mark>, getting lots and lots of notes--still getting notes. This is the dream team .\" <mark>Snyder</mark> took a moment to thank everyone at the panel, \"this is the best time to be a Batman fan. You guys are the best fans in the world .\" He then moved on to talk about figuring out where Duke can land. \"We didn't want him to take on a mantle like Nightwing or Robin--which were options, but the way. We wanted to give him something new. Gotham by day is where all the new threats in the city start to take root .\" He continued, talking about Patrick's idea that for a juvie Arkham, and building out a different neighborhood. \"There's a cop who was on nightshift who quit and came to the dayshift because of an encounter with Mr. Freeze,\" He teased, also dropping hits about a new Wayne Enterprises endeavor where Bruce is going to be building housing for city employees that will build into a mystery. <mark>Tom King</mark> was up next, talking about the end of the \"War of Jokes and Riddles .\" \"I knew from day one, I knew Catwoman was gonna say yes. If you look back at my issue 1, I knew I wanted to do 100 issues of this book and I wanted to focus on Bruce and Selina's relationship as the core of the run,\" <mark>King</mark> explained. The next arc of Batman will be called \"The Rules of Engagement\" rather than \"A Dream of Me\" as was initially announced. It will run for 17 issues. \"I thought about Catwoman and Batman being engaged...and then I immediately thought about Catwoman and Talia in a sword fight in the desert...and it gets awkward .\" \"What will Damian think of this marriage?\" Inman asked, to which <mark>King</mark> responded that the next arc will be all about how Damian is going to cope with this new status quo. \"It drives him a little more crazy,\" <mark>King</mark> joked. Sean Murphy was up for Batman: White Knight, \"I was always inspired by Batman: The Animated Series, and I wanted to tell a story about a story where Joker was\" cured \"in a new way,\" Murphy explained, \"I wanted him to start coming at Batman in like, legal ways, using social media .\" \"This story is about the family, too .\" Murphy explained, saying Nightwing and Batgirl will continue to play a big part in the story. \"This is just Nightwing from the animated series but with a motorcycle jacket .\" Inman asked if White Knight was a finite story, but Murphy said he's already in talks with DC for a potential sequel. James Tynion IV was next to talk about his Bat-related projects. Batman/TMNT volume 2 was first on the docket. \"The first volume was taking the Turtle to Gotham City and the second volume is going to be taking Gotham City to the Turtles. It's Batman, Robin and Bane invading the Turtles' NYC. I just wrote a scene where Bane takes over the Statue of Liberty and pulls the Bane mask down over it .\" \"At the end of the day, all Batman stories are about family, and all Turtles stories are about family, they have this common theme .\" Tynion explained. He went on to talk about the current arc of Detective Comics, \"A Lonely Place of Living .\" \"It's been a tremendous honor. This is a book that's always been near and dear to my heart. When Geoff brought me in to say they were going to take Tim off the table but to tie him into this bigger mystery playing into Rebirth, I was so excited .\" Tynion said. \"A Lonely Place of Living\" taps into what makes Tim Drake important. \"\"The fact that Tim carries the whole world on his shoulders, and it was evident right from those first original pages in\" A Lonely Place of Dying. \"Tynion explained about the importance of restoring the original origin. Tynion went on to explain that the answers to the Connor Kent questions that keep getting asked might be answered in Detective #966. Bennett was next for Batwoman and her use of Scarecrow in the story,\" The places Kate has built her armor were not put in place to defend against villains like him. She has all this training in black ops but she has no defenses against the guilt in her mind. \"<mark>Snyder</mark> then teased his upcoming project with Sean Murphy, called Last Knight\" I want it to be my last Batman story for a long time. \"\"Batman suddenly wakes up and he's...young, but he wakes up in this post apocalyptic wasteland, crawling out of the sand in this Gotham City that's been ruined. He's got the Joker's head chained to his belt, but it's alive and like\" You gotta move, kid! \"It's got old Wonder Woman, Baby Superman--it's like my Lone Wolf and Cub Batman story .\" <mark>Snyder</mark> explained that he got advice from Grant Morrison about taking over iconic characters, \"He said you've got to give them a birth and a death. So this isn't really a death, but this is a closing a chapter in my version of Batman .\" Inman asked the panel for one last spoiler from the panel, to which <mark>Tom King</mark> replied that he and Lee Weeks are coming together for at Batman Annual \"It's the story of Batman and Catwoman's first kiss...and their last .\" Fans were then invited to ask questions. A fan from Australia asked if Tynion has any plans for new additions to the Detective Comics roster. \"The Robins and Batgirl are core to the mythos are they're going to be a big part in the next arc .\" A fan then asked if the Bat-books had any plans to do a benefit book for a Batman-oriented story for gun control, but the panel confirmed that if that did happen it would be in DC's hands. Inman then told the fan that if this was a book and an issue people want to see, they should let DC know. A fan then asked Murphy about Last Knight--if it will be a graphic novel or a mini series. \"It might be a mixed. I'm not completely informed but there will be more info probably before San Diego. It'll be a new format that'll make these stand out .\" Share On Facebook Tweet Pin It Email Comment ThePremium Network Ad Free Browsing Over 10,000 Videos! All in 1 Access Join For Free! GO PREMIUM WITH CBR Go Premium!", "articleID": "2017100720_00425550_W", "names": {"Scott Snyder": ["Q322415", "Q59488659"], "Tom King": ["Q23664009", "Q27139397", "Q3530763", "Q3992491", "Q52892734", "Q55635982", "Q58316386", "Q7816471", "Q7816473"]}}, {"date": "2017-10-07", "url": "http://www.theneworleansadvocate.com/baton_rouge/opinion/article_be52a350-a94a-11e7-b182-7b4b76aa3323.html", "content": "New Orleans Saints Coach Sean Payton has developed a new pattern of violating a fundamental rule of human behavior. That is saying something people don't want to hear. Most of us typically <mark>will</mark> say things we think people want to hear. If a woman asks if the dress she's wearing makes her look fat, most <mark>will</mark> say no, even if it makes her look so big she requires her own Zip code. But these days, politics has motivated many of us, including Coach Payton, to say things knowing full well it <mark>will</mark> anger many. As a country, we have split along ideological lines gravitating toward groupthink and tribalism. Saying anything political <mark>will</mark> be met with resistance and scorn. We do it anyway. I think that's a good thing. Coach Payton had to know back in April of last year after former Saints player <mark>Will Smith</mark> was tragically shot to death, his calling for stricter gun control would not sit well with many in red-state Louisiana. And then a couple of weeks ago, Payton praised the 10 Saints players sitting during the national anthem, saying he was proud of them. But the coach wasn't finished. He also questioned the wisdom of our current president. The very same president who overwhelmingly won the state in which Payton coaches. Coach Payton has apparently gotten used to his newfound political punditry, doubling down on his passion for gun control this past week by calling for it once again after the Las Vegas shooting. Even though I disagree with Payton on his views, I admire him for having the courage to express them. He <mark>will</mark> pay a price for it in that some <mark>will</mark> place their allegiance to their worldview above their loyalty to their football team. At least Coach Payton isn't as harsh and vitriolic as others calling for gun control. A Facebook friend of mine is extremely passionate about the issue. The Las Vegas shooting motivated him to post this about his heartache that the gun control debate seems to be over: Sean Payton again calls for gun reform after Vegas shooting: \"We need to be better' The Las Vegas shooting that claimed the lives of 59 people and injured 527 more prompted New...\"It was over when America decided that two dozen dead first - and second-graders were an acceptable price to pay for the right to own weapons that exist for no other purpose than killing large numbers of people in a short amount of time. All that's left for us to do now is document record-breaking atrocity after record-breaking atrocity .\" My friend's assertion that those opposing gun control are OK with the Sandy Hook massacre is obviously misguided, absurd and foggy thinking caused by an over-the-top emotional tantrum. I understand why this is a such a gut-level issue for gun control zealots. If what they believe is true, which is conservatives are OK with the mass shooting of kids, they should be outraged. This further illustrates the divide that separates us ideologically. Unfortunately, conservatives often see leftists as nuts, and many leftists view conservatives as evil. It's hard to unite with that dynamic in play. Saints shaken by <mark>McKnight</mark> killing, N.O. shootings: \"It has nothing to do with race' The news of <mark>Joe McKnight</mark>'s shooting death hit the New Orleans Saints' locker room hard. So what do we do about all of this dissension, disunity, and enmity between us? Keep our deeply held views to ourselves? Of course not. Truth is, we couldn't if we tried. We are all closely married to our beliefs and take them very personally. They are a part of who we are. What would be nice is if we could find the strength, grit, and determination to stop assuming the worst of each other. As a conservative, it appears to me this problem is much more severe and common from my friends on the left, but then again, I am obviously biased. My fellow conservatives should stop thinking leftists are crazy just because we view their logic as nutty, emotionally based, and unreasonable. I think Coach Payton may have struck the right cord. He courageously expressed controversial opinions without insulting anyone, assigning malice, or questioning motives. I heard once that we are never weaker in our arguments than when we attempt to explain what motivates those we are debating. None of us can see inside the human heart. We would all do well to remember that.", "articleID": "2017100723_00024173_W", "names": {"Joe Mcknight": ["Q18749091", "Q6211275"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}, {"date": "2017-10-08", "url": "http://www.kristv.com/story/36546240/tcu-only-undefeated-team-left-in-big-12", "content": "TCU only undefeated team left in Big 12 - KRISTV.com | Continuous News Coverage | Corpus Christi TCU only undefeated team left in Big 12 - KRISTV.com | Continuous News Coverage | Corpus Christi Member Center: TCU only undefeated team left in Big 12 Posted: Updated: TCU logo FORT WORTH, Texas (AP) - <mark>Kenny Hill</mark> scored three different ways, and got the winning score by avoiding three defenders as No. 8 TCU remained the only undefeated team in the Big 12 Conference. <mark>Hill</mark> eluded a defender in the backfield and lunged forward through two more Mountaineers for a 3-yard touchdown run with 2:53 left in a 31-24 victory over No. 23 West Virginia on Saturday. \"This team and the coaches trust me with the ball down there. That means a lot,\" <mark>Hill</mark> said. \"It gives you a lot of confidence .\" That winning TD run came only five plays after an apparent interception was reversed on a replay review, and after <mark>Hill</mark> had already thrown a 45-yard TD pass and been on the receiving end of a 48-yard score for the Horned Frogs (5-0, 2-0 Big 12). \"It seems like every week, you guys believe this wants to be a drama about <mark>Kenny Hill</mark>,\" coach <mark>Gary Patterson</mark> said. \"The guy's 5-0 .\" <mark>Hill</mark> is only the second Big 12 player to throw, run and catch a touchdown in a conference game during the league's 22 seasons, while two players have done it in nonconference play, the last in 2008, according to STATS Inc.. Will Grier threw for 366 yards and three TDs for West Virginia (3-2, 1-1), including two long catch-and-run scores in a span of about 2 1/2 minutes late in the third quarter. It was tied at 24 after Grier hooked up with <mark>David Sills</mark> V on a 64-yard scoring play and then Ka'Raun White for a 76-yarder. TCU led 7-3 at halftime in the only game Saturday matching Top 25 teams, and after third-ranked and two-time defending Big 12 champion Oklahoma (4-1, 1-1) was upset at home by Iowa State. \"It was a close game. Everything that happened in the first half, throw it away,\" West Virginia coach Dana Holgorsen said, when asked what he told his team at the half. \"If we outplay them in the second half, we're probably going to win the game - and we didn't .\" After those two long West Virginia TDs, the Frogs used a little trickery to go ahead again. KaVontae Turpin took a handoff and swept to the right before stopping and throwing back to <mark>Hill</mark>, who sprinted down the left sideline for the score. It was a play TCU had worked on in practice, and <mark>Hill</mark> had told coach Sonny Cumbie he would score if it got called in a game. \"I was like\" Oh, let's go .' It just worked out. \"<mark>Hill</mark> said .\" Overall, that's just a great team effort. \"", "articleID": "2017100802_00350610_W", "names": {"David Sills": ["Q5239788", "Q5239790"], "Gary Patterson": ["Q25189982", "Q5525722", "Q5525724"], "Kenny Hill": ["Q17523843", "Q20090908", "Q6391078", "Q6391081"]}}, {"date": "2017-10-09", "url": "http://6abc.com/sports/second-grader-calls-out-cam-newton-on-twitter-/2513356/", "content": "BREAKING NEWS Fatal crash in Northeast closes major thoroughfare Full Story Email share share tweet email BREAKING NEWS ESPN: Joel Embiid OKs five-year, $148M deal with Sixers Full Story Email share share tweet email BREAKING NEWS Suspect in custody for murder of Philly activist Full Story Email share share tweet email BREAKING NEWS Names released of 4 killed in Gloucester Twp. crash Full Story Email share share tweet email SPORTS Local second grader creates stir calling out <mark>Cam Newton</mark> on twitter Email share share tweet email EMBED </> More Videos <iframe width = \"476\" height = \"267\" src = \"http: //6abc.com/video/embed/? pid=2513362\" frameborder = \"0\" allowfullscreen> </ iframe> Local second grader creates social media stir calling out <mark>Cam Newton</mark>: Jamie Apody reports on Action News at 6 p.m., October 9, 2017 (WPVI) WPVI By Jamie Apody Monday, October 09, 2017 07:27 PM PHILADELPHIA (WPVI)--It was the off-the-cuff comment heard round the world. \"It's funny to hear a female talk about routes,\" said <mark>Cam Newton</mark>, during an interview on October 4. But it was not seen as funny to millions of football fans who happen to be female. One of these fans, 7-year-old Reese Emanuele took <mark>Newton</mark> to task on twitter. Reese created a video explaining routes, which her dad posted to his twitter account on Friday. Since it has been posted, Reese's video has been retweeted almost 4000 times. On Monday, the second grader from Clinton, N.J. paid a visit to Action News, talking a little football with <mark>Rick Williams</mark>. She even sat down to speak with someone who knows a thing or two about pass routes, former Eagles Quarterback Ron Jaworski. She said she hopes the takeaway from her video is that people realize girls can know a thing or two about sports, just like boys. Reese's dad Eric said he learned the game of football from his mother and that is what drove him to post the video .------Send a breaking news alert to Action News Report a correction or typo Learn more about the 6abc family of apps Related Topics: sports Action News Sports Email share share tweet email (Copyright © 2017 WPVI-TV. All Rights Reserved .) Load Comments Please enable JavaScript to view comments. SPORTS Sources: Joel Embiid OKs five-year, $148M deal with Sixers ESPN: Joel Embiid OKs five-year, $148M deal with Sixers Three and Out - Ducis and Jaws on fan excitement around 4-1 Eagles Doug Pederson: Will be \"tough' for Lane Johnson to play Thursday More Sports Top Stories Fatal crash in Northeast closes major thoroughfare Names released of 4 killed in Gloucester Twp. crash Suspect in custody for murder of Philly activist ESPN: Joel Embiid OKs five-year, $148M deal with Sixers All Monroe Twp. schools closed for rest of week amid mold concerns AccuWeather: Clearing Skies Tonight Woman, 84, hit by car in Fox Chase; in critical condition Man arrested after gun pointed at driver in Del.. Show More No charges after incident at Toomey town hall Missing toddler left near coyote-infested alley as punishment, police say Child burned after falling into bonfire in Monto, police say Hall of Fame quarterback Y.A. Tittle dies at age 90 Firefighter injured battling Port Richmond fire More News Top Video Names released of 4 killed in Gloucester Twp. crash Suspect in custody for murder of Philly activist Watch NJ Gubernatorial Debate Tuesday on 6abc Action News Update More Video", "articleID": "2017100923_00432604_W", "names": {"Cam Newton": ["Q5024850", "Q5024852", "Q591678"], "Rick Williams": ["Q16152041", "Q19518930", "Q28421787", "Q42321991", "Q7331860"]}}, {"date": "2017-10-12", "url": "http://www.irishmirror.ie/sport/soccer/soccer-news/6-things-spotted-liverpools-training-11331836", "content": "Sport 6 things spotted from Liverpool's training session ahead of huge Manchester United clash The Reds have struggled recently in the league, winning only one of their last four games Share Comments Thomas Bristow 15:03, 12 OCT 2017 Updated 15:24, 12 OCT 2017 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email The international break is over and the majority of Liverpool's stars have returned to training - and just in time. Jurgen Klopp's side face a titanic clash against an unbeaten, in form Manchester United side at Anfield on Saturday. The Reds have struggled in the Premier League recently, winning just one from their last four games. However, it's not uncommon for form to go out the window in these sorts of games - and Liverpool will be desperate for a win over their bitter rivals. Here are six things we spotted in their training session leading up to the big clash. Nervous, Jurgen? How Klopp would love a win at Anfield over Mourinho (Image: Andrew Powell/Liverpool FC via Getty Images) Klopp enters the training ground with his band of merry men sporting something of a nervous smile. A victory over United would be the perfect way for his side to get back on track. The return of Firmino? The Brazilian could do with a confidence booster (Image: Andrew Powell/Liverpool FC via Getty Images) Firmino's poor form led him to being dropped against Newcastle last time out. Looking sharp in training, the Brazilian could well be back in the starting XI for Saturday's lunch-time clash. Matip the main man \"More of that, Matip!\" (Image: Andrew Powell/Liverpool FC via Getty Images) Liverpool's frail defence is by no means a secret and Romelu Lukaku and co will be looking to exploit it in any which way they can. Joel Matip will be heavily relied upon for Saturday and crunch tackles like the one above will be much appreciated by the Anfield faithful. He's SmilINGS Ings has been linked with a move to Newcastle (Image: Andrew Powell/Liverpool FC via Getty Images) The 25-year-old's Liverpool career has been blighted with injuries and he's recently been linked with a move to St. <mark>James</mark>' Park. All smiles in training, could Ings come back to rescue Klopp in his time of need? The perfect Daniel Sturridge photo? Did Sturridge waste his chance against Newcastle? (Image: Andrew Powell/Liverpool FC via Getty Images) Could there be a better photo representing Sturridge's current situation at Liverpool? The 28-year-old failed to make an impact against Newcastle and could find himself back on the bench against United. <mark>Moreno</mark>'s fine form continues <mark>Alberto Moreno</mark> has kept <mark>James Milner</mark> out of the Liverpool starting XI this season (Image: Andrew Powell/Liverpool FC via Getty Images) Unlike Sturridge, <mark>Alberto Moreno</mark> is having a brilliant time at Liverpool. The Spaniard even scored a scorpion kick in training. <mark>Moreno</mark>, whose Liverpool career looked to be over last season, has featured nine times for the Merseyside outfit this campaign. poll loading What's your prediction for Saturday? 1000 + VOTES SO FAR Liverpool win Man United win Draw for me, Jeff! Like us on Facebook Follow us on Twitter Daily Newsletter irishmirrorsport Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Premier League Manchester United FC Liverpool FC Barclay's Premier League", "articleID": "2017101214_00543931_W", "names": {"Alberto Moreno": ["Q4712132", "Q4712133", "Q57542702"]}}]