[{"date": "2017-10-12", "url": "http://www.irishmirror.ie/sport/soccer/soccer-news/6-things-spotted-liverpools-training-11331836", "content": "Sport 6 things spotted from Liverpool's training session ahead of huge Manchester United clash The Reds have struggled recently in the league, winning only one of their last four games Share Comments Thomas Bristow 15:03, 12 OCT 2017 Updated 15:24, 12 OCT 2017 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email The international break is over and the majority of Liverpool's stars have returned to training - and just in time. Jurgen Klopp's side face a titanic clash against an unbeaten, in form Manchester United side at Anfield on Saturday. The Reds have struggled in the Premier League recently, winning just one from their last four games. However, it's not uncommon for form to go out the window in these sorts of games - and Liverpool will be desperate for a win over their bitter rivals. Here are six things we spotted in their training session leading up to the big clash. Nervous, Jurgen? How Klopp would love a win at Anfield over Mourinho (Image: Andrew Powell/Liverpool FC via Getty Images) Klopp enters the training ground with his band of merry men sporting something of a nervous smile. A victory over United would be the perfect way for his side to get back on track. The return of Firmino? The Brazilian could do with a confidence booster (Image: Andrew Powell/Liverpool FC via Getty Images) Firmino's poor form led him to being dropped against Newcastle last time out. Looking sharp in training, the Brazilian could well be back in the starting XI for Saturday's lunch-time clash. Matip the main man \"More of that, Matip!\" (Image: Andrew Powell/Liverpool FC via Getty Images) Liverpool's frail defence is by no means a secret and Romelu Lukaku and co will be looking to exploit it in any which way they can. Joel Matip will be heavily relied upon for Saturday and crunch tackles like the one above will be much appreciated by the Anfield faithful. He's SmilINGS Ings has been linked with a move to Newcastle (Image: Andrew Powell/Liverpool FC via Getty Images) The 25-year-old's Liverpool career has been blighted with injuries and he's recently been linked with a move to St. <mark>James</mark>' Park. All smiles in training, could Ings come back to rescue Klopp in his time of need? The perfect Daniel Sturridge photo? Did Sturridge waste his chance against Newcastle? (Image: Andrew Powell/Liverpool FC via Getty Images) Could there be a better photo representing Sturridge's current situation at Liverpool? The 28-year-old failed to make an impact against Newcastle and could find himself back on the bench against United. <mark>Moreno</mark>'s fine form continues <mark>Alberto Moreno</mark> has kept <mark>James Milner</mark> out of the Liverpool starting XI this season (Image: Andrew Powell/Liverpool FC via Getty Images) Unlike Sturridge, <mark>Alberto Moreno</mark> is having a brilliant time at Liverpool. The Spaniard even scored a scorpion kick in training. <mark>Moreno</mark>, whose Liverpool career looked to be over last season, has featured nine times for the Merseyside outfit this campaign. poll loading What's your prediction for Saturday? 1000 + VOTES SO FAR Liverpool win Man United win Draw for me, Jeff! Like us on Facebook Follow us on Twitter Daily Newsletter irishmirrorsport Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Premier League Manchester United FC Liverpool FC Barclay's Premier League", "articleID": "2017101214_00543931_W", "names": {"James Milner": ["Q191136", "Q57324227"]}}, {"date": "2017-10-13", "url": "http://www.foxnews.com/politics/2017/10/13/newsweek-labels-value-voter-summit-as-hate-group-ahead-trump-appearance.html", "content": "Newsweek has labeled the Family Research Council's Value Voter Summit a \"hate group\" in a headline published in advance of President <mark>Trump</mark>'s speech there. The online story that appeared Thursday was headlined, \"<mark>Donald Trump</mark> to speak at hate group's annual event, a first for a president .\" It doesn't explain who actually labeled it as a hate group until the third paragraph. Newsweek cites the Southern Poverty Law Center as the organization that deemed the Family Research Council a \"hate group,\" but the SPLC doesn't exactly have the best reputation itself. The group claims to fight \"hate and bigotry\" and seeks \"justice for the most vulnerable members of society .\" However, many critics say the group's methodology for labeling a group or person as \"extremist\" in unclear and the Pentagon recently severed all ties to the group, according to the Daily Caller. \"This vile group claims to be expert on hate, but that's only because it promotes hatred of conservatives and Christian groups .\" - Media Research Center Vice President Dan Gainor \"There's absolutely nothing legitimate about the Southern Poverty Law Center's so-called hate list. This vile group claims to be expert on hate, but that's only because it promotes hatred of conservatives and Christian groups,\" Media Research Center Vice President Dan Gainor told Fox News. Earlier this month, the Daily Caller obtained emails that show the Department of Defense Office of Diversity Management and Equal Opportunity \"removed any and all references\" to the SPLC from its training materials. The SPLC has also been under fire from conservative organizations, and a Christian ministry group based in Florida sued the SPLC last Summer after it labeled the ministry as a hate group. The Patriot Post calls the SPLC \"the anti-hate group that is a hate group\" and labeled it as \"un-American\" in a story that specifically questions why the media continues to quote them--which is exactly what Newsweek did with its headline. \"The next time you see the Southern Poverty Law Center quoted in the news, just remember: the masterminds behind the SPLC aren't eliminating hate. They are fueling it,\" the Patriot Post wrote on Friday. This undated photo provided by the Las Vegas Metropolitan Police Department shows Marilou Danley. Danley is being sought by the LVMPD for questioning in connection with the investigation into the active shooter incident on Sunday, Oct. 1, 2017. (Las Vegas Metropolitan Police Department via AP) (Las Vegas Metropolitan Police Department) It's been a rough time for Newsweek and the magazine has issued at least 20 corrections in 2017, including at least one per month, and even has a page on its website dedicated to its mistakes. The magazine admitted to over 50 mistakes in 2016 and recently issued an embarrassing retraction about a story that falsely detailed the life of the Las Vegas shooter's girlfriend with salacious information that turned out to be fake news. Citing public records, the original story claimed <mark>Stephen Paddock</mark>'s girlfriend, Marilou Danley, had used two social security accounts and had two husbands at the same time. The now-retracted story said that Danley is the \"one person who holds the key to solving the mystery\" of the deadliest mass shooting in American history. Newsweek painted her as \"a shadowy figure with a convoluted life of her own,\" who lived \"an unconventional life .\" Unfortunately for Newsweek, the initial report was based on the marriage record of Danley, who was known under a different name when she married Geary Danley in Clark County, Nevada, according to the magazine. Gainor mocked Newsweek for promoting SPLC's \"garbage\" and brought up the 2010 sale of the magazine when Dr. Sidney Harman only had to spend $1 to acquire it because the publication came with so many financial liabilities. \"It's hard to imagine a publication that sold for $1 going down in value, but it has,\" Gainor said. Brian Flood covers the media for Fox News. Follow him on Twitter at @ briansflood.", "articleID": "2017101315_00240864_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Stephen Paddock": ["Q41529365", "Q41711871"]}}, {"date": "2017-10-13", "url": "http://www.bucksfreepress.co.uk/news/15595861.Rock_legend_Ozzy_Osbourne_sends_message_of_support_ahead_of_charity_concert/", "content": "Show caption () View gallery Skip to next image \"0 comments Get the latest local news straight to your inbox every day Sign up Rock legend Ozzy Osbourne has sent a message of support to organisers of a charity concert after donating a guitar to be auctioned off at the event. The concert is being held tonight at Pipers Corner School in aid of patients at The South Bucks Community Hospice. One of the highlights will be the sale of a signed LAG Tramontane donated by the Black Sabbath singer. Organisers were thrilled by the donation and have now been given an extra boost by a message from the star, who said:\" I'm delighted to be helping raise much needed funds for The South Bucks Community Hospice through the auction of one of my guitars from my home studio. \"The concert, mainly featuring bands from the school, has been arranged by Pipers Corner's guitar teacher <mark>Mark Campbell</mark>--whose terminally ill father Ian has been treated by the hospice at Butterfly House, High Wycombe. <mark>Mark</mark>, whose own acoustic band Luna Sees will also play on the night, said:\" I wanted to give something back because The South Bucks Community Hospice has done a really wonderful job looking after my father. \"Ozzy Osbourne is a legend and it's fantastic he has donated this guitar. I hope we will raise a lot of money as a result to help the hospice treat patients with life-limiting illnesses .\" <mark>Mark</mark>'s father Ian, 62, suffers from Motor Neurone Disease. He says the Hospice has been of huge help to him and his family over the last year. The concert begins at Pipers Corner, Great Kingshill, HP15 6LP, at 7.30 pm on Friday October 13. Tickets are £ 5 and everyone is welcome, although seats are limited to just under 300. To book tickets for the Pipers Corner concert, email http: //www.piperscorner.co.uk/our-school/box-office or to bid in advance for the guitar, email <mark>Mark</mark> at mcampbell @ piperscorner.co.uk. 0 comments", "articleID": "2017101315_00482639_W", "names": {"Mark Campbell": ["Q18631520", "Q3849456", "Q41212795", "Q54858776", "Q56073254", "Q6766977", "Q6766978"]}}, {"date": "2017-10-13", "url": "http://www.wnewsj.com/news/53059/bls-parent-local-leaders-not-doing-their-job-reinbolt-lynch-father-aggressive-disruptive-banned-from-school-grounds", "content": "BLANCHESTER--A former Blanchester High School student's father spoke before village council Thursday night over concerns he has with both the police department and with Blanchester Local Schools as well as employees of each. Tom Pollitt, of Pleasant Plain, accused Police Chief Scott Reinbolt and Blanchester Schools Superintendent Dean Lynch of \"not doing their job\" in regards to an incident involving his daughter (a minor), who attended Blanchester High School, and another student who allegedly assaulted her at school. According to him, on Sept. 21 his daughter was shoved into the lockers by another student. The alleged assault, resulting in the girl getting a black eye and swelling, was the result of issues going on with several students both in-person and across social media channels in the days leading up to the incident. Pollitt and his wife expressed concerns to Blanchester High School Assistant Principal Pandy McCarty. They said that, due to an accident last year in which their daughter was struck by a car in Loveland, causing brain damage, they feared the alleged assault would make things worse for their daughter. This resulted in legal action against the alleged offending student being pursued through Clinton County and a restraining order being filed against the suspect, through Clermont County. Pollitt alleges that the school didn't comply with the order. He said he discussed the issue with Superintendent Dean Lynch and Blanchester High school Principal <mark>Chris Smith</mark> about it. \"They said they don't have to comply, they can't comply with it,\" said Pollitt. Lynch called this claim \"unsubstantiated\" --that they received a restraining order against the student that was put in place on Sept. 26 but expired on Oct. 2. \"We did a number of things to support the restraining order,\" said Lynch. According to Lynch, the student withdrew from the school on Oct. 4. Lynch also submitted a no trespassing letter to Pollitt for his behavior at the high school on Sept. 21 including disobeying a school official's (McCarty) request to the point where she felt the need to call police. Reinbolt told the News Journal Friday, \"On or about Sept. 28 I received a copy of a letter sent to Mr. Pollitt by the School Superintendent informing him that due to his angry and disruptive behavior at the high school, he was no longer permitted to be there without permission of the building principal. I briefed officers on this and made inquiries as to the circumstances that led to it. Officers informed me that Mr. Pollitt had been angry, rude and aggressive with school officials .\" Pollitt said he then went to the Blanchester Police Department, where he spoke with an officer who, according to Pollitt, said, \"I'm not going to pick her up and drive two-and-half hours and take her because she violated this thing .\" After an alleged second restraining order violation, Pollitt spoke with Reinbolt where the two then had a \"rough conversation\" according to Pollitt. This included Reinbolt allegedly telling him that they didn't have to comply with the order and that if he called the police department again, \"They were going to have problems .\" He also allegedly said that if Pollitt \"didn't like it\" then he should \"get a lawyer and sue us .\" Reinbolt told the News Journal Friday, \"Mr. Pollitt and/or his wife called the police department repeatedly in the week following the assault. Each of those conversations were not documented, but generally involved the Pollitts making demands for seizure of evidence, immediate arrests of students and school officials without evidence of criminal conduct, and immediate arrest of the perpetrator of the assault. Each call was answered by a patrol officer who attempted to explain the process of criminal investigation, prosecution and how the court system operates. These phone calls were so frequent that it was distracting officers from other duties. According to the officers involved, they could not get the Pollitts to understand that the case was proceeding and appropriate action would be taken at the close of the investigation .\" According to the police report, the BPD forwarded its entire report (more than 20 pages) on the incident to the Clinton County Juvenile Prosecutor on Oct. 2 for \"consideration of charges\" against the alleged perpetrator of the assault. Reinbolt said, \"Mr. Pollitt told me the officers here were not doing their job and repeated this allegation without ever giving specifics. I finally interrupted him and asked for specifics, and he provided none, but continued alleging that the officers weren't doing their jobs. I finally asked him to give me one sentence in which he outlined what he was seeking from me. He stated he wanted a restraining order from the Clermont County Courts enforced .\" \"I asked what the order provided, and he said it required the alleged perpetrator in his daughter's case to remain 500 feet away from his daughter. I told him that, since the children attend the same school, it would seem difficult for anyone to enforce such an order. I told him I had not seen the order. He said he brought it to the police station the night before and showed it to an officer, who refused to do anything to enforce it ....I asked him to mail me a copy of the order so I could review it, and he seemed shocked that I would ask such a thing. I explained that we cannot enforce every court order, as some provide for police intervention and others do not...\"Reinbolt added,\" I told him that he and his wife needed to stop repeatedly calling the police station day after day as we have other matters that also require our attention. I told him if they didn't cease the repetitive calls that I would take action to prevent that from occurring further. \"Council member Don Gephart on Thursday night suggested that Pollitt attend the next Blanchester School Board meeting on Monday and bring his concerns to them. The council later met in executive session with Mayor <mark>John</mark> Carman and Village Solicitor Andrew T. McCoy to discuss the situation. Carman said the council did not come to a decision and that Pollitt would have to report his complaints to the Mayor's Office. Carman indicated he felt he should've asked Pollitt to stop commenting at Thursday's meeting as he was making accusations about a city official which was against the public comment guidelines. Reinbolt told the News Journal Friday he was\" disappointed that Village Council last night operated contrary to its own rules regarding complaints about Village employees. The Council has consistently, for the past five years or more, refused to permit complaints about individual employees during open council meetings. They have insisted that the proper channel for such complaints are to the employee's immediate supervisor, not in an open council session. I'm a bit befuddled as to why that rule was apparently disregarded last night...\"http: //www.wnewsj.com/wp-content/uploads/sites/22/2017/10/web1_Blan-sign-cr-1.jpg Reinbolt, Lynch: Father' aggressive',\" disruptive', banned By <mark>John Hamilton</mark> and Tom Barr News Journal RECOMMENDED FOR YOU 5:30 pm | Village of Sabina employees donate sick-leave time to co-worker 5:02 pm | Two men receive prison terms for property crimes in Clinton County 9:35 pm | Clinton County's foster care levels keep on rising Load comments (0)", "articleID": "2017101321_00792680_W", "names": {"Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "John Hamilton": ["Q16195098", "Q19816311", "Q25183942", "Q28955335", "Q29642873", "Q43910681", "Q46648449", "Q5786239"]}}, {"date": "2017-10-16", "url": "http://idahopress.com/sports/national/stat-watch-marshall-punter-s--yarder-longest-since/article_c933b9b2-1f12-553e-8488-cbb71a0a1f32.html?block_id=1359641", "content": "STAT WATCH: Marshall punter's 92-yarder longest since 1972 By ERIC OLSON AP College Football Writer 16 min ago (...) UCLA quarterback Josh Rosen (3) throws down field for a first down against Arizona in the first half during an NCAA college football game, Saturday, Oct. 14, 2017, in Tucson, Ariz. (AP Photo/Rick Scuteri) Rick Scuteri Oklahoma State quarterback <mark>Mason Rudolph</mark> (2) passes in the fourth quarter of an NCAA college football game against Baylor in Stillwater, Okla., Saturday, Oct. 14, 2017. Oklahoma State won 59-16. (AP Photo/Sue Ogrocki) Sue Ogrocki Boston College running back AJ Dillon (2) crosses the goal line to score during the second half of an NCAA college football game against Louisville, Saturday, Oct. 14, 2017, in Louisville, Ky.. Boston College won 45-42. (AP Photo/Timothy D. Easley) Timothy D. Easley Navy quarterback Zach Abey, left, runs the ball behind the blocking of fullback Chris High (33) in the first half of an NCAA college football game against Memphis Saturday, Oct. 14, 2017, in Memphis, Tenn. (AP Photo/Mark <mark>Humphrey</mark>) <mark>Mark Humphrey</mark> Navy quarterback Zach Abey (9) scores a touchdown on an 8-yard run against Memphis in the second half of an NCAA college football game Saturday, Oct. 14, 2017, in Memphis, Tenn.. Memphis upset Navy 30-27. (AP Photo/Mark <mark>Humphrey</mark>) <mark>Mark Humphrey</mark> Marshall's Kaare Vedvik knew he hit a good punt out of his own end zone. Once the ball landed, it kept going and going, farther than any other punt in a Football Bowl Subdivision game in 45 years. His 92-yard punt against Old Dominion on Saturday was, according to Marshall research, the longest since Southern Mississippi's <mark>Ray Guy</mark> boomed a 93-yarder against Mississippi in 1972. \"It's an unbelievable feeling to send it from one end zone to the other,\" the redshirt senior from Norway said. \"It's a punter's dream. Every time, you just try to hit your best ball. This one went over his head and had a nice tail wind. The ball rolled down to the other goal line, so you can't ask for anything better than that .\" × Vedvik's big punt came after the Thundering Herd went three plays and out on their first possession of the game. With the ball at the 8-yard line, Vedvik was deep in his own end zone and with a light wind at his back when he put his foot to the ball. It bounced at the Old Domion 30, over the return man, and skipped hard toward the end zone and rolled in before the coverage team could down it. Vedvik also had punts of 52, 36, 48 and 36 yards as well as a pooch punt of 27 in the Herd's 35-3 win. His season average of 44.8 yards leads Conference USA. The longest punt in FBS history: 99 yards by Nevada's <mark>Pat Brady</mark> against Loyola Marymount in 1950. Some other notable feats from the weekend:------LEG WORKOUT Kansas' Cole Moos established a national season high with 13 punts against Iowa State. No other punter in the FBS has attempted more than 11 in a game this season. Moos' 40 punts are most in the Big 12 by far. NAVY GOES BY LAND Navy leads the nation with 397.5 yards rushing per game, and the Midshipmen are on pace to pile up the most yards on the ground since Nebraska's 1995 national championship team averaged 399.8. Quarterback Zach Abey is running for 169.3 yards per game, 29 behind national leader Bryce Love of Stanford. Abey's 189 carries are tied for most in the country. The Midshipmen also get nearly 70 yards a game from both <mark>Malcolm Perry</mark> and Chris High. THE 200 CLUB Boston College freshman AJ Dillion had the top rushing performance of the weekend, running for 272 yards and four touchdowns on 39 carries in a 45-42 win over Louisville. It was the third-best outing by a BC back behind <mark>Andre Williams</mark>' 339 yards against North Carolina State and 295 yards against New Mexico State, both in 2013. Arizona quarterback Khalil Tate, after going for 327 yards against Colorado a week earlier, ran 15 times for 230 yards against UCLA. Wisconsin freshman <mark>Jonathan Taylor</mark> had his second straight 200-yard game, going for 219 on 30 carries against Purdue. Diocemy Saint Juste of Hawaii ran 39 times for 202 yards against San Jose State, his third 200-yard game of the season. FANTASTIC FALCON Air Force quarterback Arion Worthman became the fifth player this season to score five touchdowns in a game. Worthman finished with 166 yards and scored four of his touchdowns in the second half as the Falcons came back from a 27-point deficit to beat UNLV 34-30. Worthman's fifth TD, a 1-yard run with 2:14 left, gave the Falcons their first lead. PASSING LEADER Oklahoma State's <mark>Mason Rudolph</mark> and UCLA's Josh Rosen are in a close competition for most passing yards per game. <mark>Rudolph</mark> overtook Rosen this week after throwing for 459 yards against Baylor to raise his average to 394.7. Rosen had a season-low 219 yards against Arizona, dropping his average from 427 to 392.3 .------More AP college football: http: //collegefootball.ap.org and https: //www.twitter.com/AP--Top25 Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2017101607_00181338_W", "names": {"Andre Williams": ["Q16235162", "Q2846286"], "Jonathan Taylor": ["Q16214649", "Q26864704", "Q41788679", "Q41806856", "Q57440551", "Q58464066", "Q6274569", "Q6274573", "Q6274575"], "Malcolm Perry": ["Q37372024", "Q47124330", "Q6742550", "Q6742553"], "Mark Humphrey": ["Q6768145", "Q6768146"]}}]