[{"articleID": "2017112801_00298181_W", "names": {"Stephen Roberts": ["Q2026194", "Q22280061", "Q43197539", "Q7610381", "Q7610382", "Q7610383", "Q7610384"]}, "date": "2017-11-27", "url": "http://www.nydailynews.com/newswires/sports/georgia-faces-auburn-rematch-avenge-23-point-loss-article-1.3661197", "content": "ATHENS, Ga. (AP)--Three weeks isn't much time at all. Certainly not enough to forget a 23-point blowout. Now the question is: Can No. 6 Georgia turn the sting of its lone defeat--not to mention the gleeful boasting of Auburn coach Gus Malzahn--into the sort of controlled anger and nagging motivation that produces a vastly different result in the Southeastern Conference championship game? No matter how you slice it, that Nov. 11 mismatch at Jordan-Hare Stadium looms large over Saturday's rematch at Mercedes-Benz Stadium in Atlanta. \"We'll have a lot of energy, a lot of emotions,\" Georgia linebacker Lorenzo Carter said Monday. \"But when it comes down to it, those emotions aren't going to win the game. It's how you play.\" No. 4 Auburn (10-2) is playing as well as any team in the country, winning five straight games by an average of 22 points since a seemingly crushing loss to LSU. That streak includes a 40-17 rout of Georgia, when the Bulldogs were ranked No. 2 by The Associated Press and sitting atop the College Football Playoff standings, and last Saturday's equally impressive 28-16 victory over top-ranked Alabama. Suddenly, the Tigers are a trendy pick to win it all. But they've got to beat Georgia (11-1) for the second time in less than a month. FILE - In this Nov. 11, 2017, file photo, Auburn head coach Gus Malzahn, left, and Georgia head coach Kirby Smart, right, meet before an NCAA college football game in Auburn, Ala.. No. 6 Georgia is getting ready for a rematch with No. 4 Auburn in the SEC championship game. (AP Photo/Brynn Anderson, File) And Malzahn may come to regret what he said right after the previous meeting. Walking away from his on-field interview with CBS, he was overheard commenting, \"We whipped the dog crap out of 'em, didn't we!\" The coach wasn't wrong, considering Auburn outgained the Bulldogs 488-230 in total yards and shut down the dynamic running back duo of Nick Chubb and Sony Michel. But those words are sure to be plastered all over the Bulldogs' training facility this week. \"It is certainly a normal human response to want revenge when we are harmed,\" Will Freeman, the track coach at Iowa's Grinnell College who also teaches sports psychology, wrote in an email. \"Can it increase motivation? Yes. Can that motivation go bad? Also, yes. Optimal performance requires the athlete find the optimal level of motivation and excitement for the situation. Too much, and the athlete can lose focus, control and mental awareness about the situation. Just as important, too much arousal can cause timing and rhythm issues with the athlete that result in poor performance.\" Georgia coach Kirby Smart was part of a rematch situation during the 2011 season while serving as Alabama's defensive coordinator. The Crimson Tide lost to LSU 9-6 in overtime during the regular season, only to get another shot at the Tigers in the national championship game. Alabama dominated the second meeting in New Orleans, claiming the BCS title with a stifling 21-0 victory. Looking back on LSU's poor performance, then-coach Les Miles said recently the team that loses the first game probably has an easier time getting its players motivated for the rematch. Georgia head coach Kirby Smart holds his son Andrew on his shoulders after the second half of an NCAA college football game, Saturday, Nov. 25, 2017, in Atlanta. Georgia won 38-7. (AP Photo/John Bazemore) \"They plan and they work and there's a stronger commitment than the team that looks back on a hard-fought victory, but a victory nonetheless,\" Miles said. \"I think once you've beaten a team, it takes a special view of how to get them ready to beat that team again.\" But it's not unusual, at least in the SEC, for the team that won the first game to take the second as well. This will be the seventh time in the title game's 26-year history that there's a rematch of a regular-season matchup. Five of the six times it happened before, the same team won both games, the only exception coming in 2001 when LSU lost to Tennessee 26-18 in late September but bounced back to win the SEC crown with a 31-20 triumph. \"You can watch the tape of the game,\" Smart said. \"It fires you up pre-game and gets you all excited, but when the toe meets leather it's about striking people, it's about speed, it's about blocking, tackling, it's about having composure. It's about having discipline. It really doesn't revert back to who won the previous game.\" What makes this a bit different is the proximity of the two meetings--all previous SEC rematches were at least seven weeks after the first game--and these teams are especially bitter foes even though they're in different divisions. Billed as the Deep South's oldest rivals, they first played in 1892 and have clashed nearly every season since then for a total of 121 meetings. Georgia leads by the slimmest of margins, 57-56 with eight ties. If Smart is taking notes on all that history, and especially the most recent matchup, he isn't letting on. \"The other game is past history,\" he said. \"Now whether or not you say that it helps mentally with your preparation, that somebody is more focused than the other, I don't know. I certainly think Auburn was more focused down the stretch because their backs were against the wall. They had two losses. Now everybody's backs are against the wall.\" Auburn linebacker Robert Muschamp, left, and Auburn defensive back <mark>Stephen Roberts</mark>, celebrate during the second half of the Iron Bowl NCAA college football game, Saturday, Nov. 25, 2017, in Auburn, Ala. (AP Photo/Brynn Anderson) Indeed, the winner of the rematch will almost certainly land a spot in the four-team playoff. The loser is eliminated from the national championship race. \"I think you should prepare the same, regardless of your record, regardless of a revenge factor and be real consistent in your approach so that the players are able to understand that it's important to prepare right for every game,\" Smart said. \"We don't say that this game is more important than the other because it's the next game. The next game is always the most important.\" ___ Follow Paul Newberry on Twitter at https: //twitter.com/pnewberry1963. His work can be found at https: //apnews.com/search/paul% 20newberry ___ For more AP college football coverage: http: //collegefootball.ap.org and https: //twitter.com/AP_Top25 Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags: newswires associated press sports newswires Send a Letter to the Editor Join the Conversation: facebook Tweet"}, {"articleID": "2010121722_00120869_W", "names": {"Robert Rosenthal": ["Q1365573", "Q28936080"]}, "date": "2010-12-17", "url": "http://blogs.laweekly.com/squidink/2010/12/food_pot_2010_best_top.php", "content": "spawned a south park episode? marijuana has been in the news a lot this year. prop 19 brought the legalization debate to the national forefront, even though it never had much of a shot at passing (despite our governator's since, say, 1930. but as this is a food blog, and the year is winding down, we decided to take a look back at the top food and pot stories of 2010. criminalize coffee, not cannabis <mark>robert rosenthal</mark> writes about the u.s. coffee culture, and argues that our addiction to coffee is our biggest drug problem, and that we should start turning coffee shops into marijuana dispensaries. while his comedic article may run a little pun-heavy, it also includes gems like, \"more problematic yet is that caffeine is clearly a\" gateway' drug. you don't need fancy research reports to prove that a majority of those who innocently start their day with a cup of joe inevitably move on to harder drugs. like prozac, ambien, and viagra. \"cooking with...marijuana? cookbook a sign of changing attitudes further proof that times, indeed, have changed. cannabis cookbook author sandy moriarty (a name jack kerouac can surely get behind), has a non-growing tumor in her skull. that, combined with high blood pressure, gives her excruciating headaches.\" the cannabis complements my blood pressure medication that keeps my pressure down, and i don't get headaches, \"she says. the obvious next step? writing a cookbook, of course. the weekly's own dennis romero discovers that if you put marijuana in food, it is classified as medicine, and thus, not subject to inspection from the california department of public health.\" this is a loophole big enough to drive a lunch truck through. we joked to county department of environmental health specialist nick brakband and if we sold sandwiches with aspirin inside we could avoid the health inspectors who normally keep a close eye on sandwich shops. he said, yeah, something like that. \"5. remember personal info? comments (you may use html tags for style): comments may not show up immediately after submission. please wait a minute after posting a comment for it to appear. kiss her grits: nona sivley wins season 8 of hell's kitchen, will become head chef at la market [updated] hollywood farmers market update: la film school clarifies + negotiations to continue (8) royal/t's\" christmas is for cupid \"holiday party: tacos, ping pong and sexy santa 8th & olive los angeles, ca 90017"}, {"articleID": "2019122120_00050174_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-12-21", "url": "http://www.gamereactor.eu/call-of-duty-black-ops-4/?sid=198d78bf5095df1a865fa568ad5a4b43", "content": "CALL OF DUTY: BLACK OPS 4 REVIEW. Written by Eirik Hyldbakk Furu on the 12th of October 2018 at 05 \"It sets the bar both in terms of quality and quantity for the franchise.\" ESPORTS. Written by <mark>Sam Bishop</mark> on the 3rd of September 2019 at 07 Several key players like JKap and Temp have already been signed to the agency, which has Andrew Drake as CEO. ESPORTS. Written by <mark>Sam Bishop</mark> on the 19th of August 2019 at 08 It was an emotional event for the community as the scene transitions to a franchised format next year. NEWS. Written by Lisa Dahlgren on the 6th of August 2019 at 06:51 While we know the mode is landing today, Treyarch teased the Pandemic mode before launch. ESPORTS. Written by Ben Lyons on the 23rd of July 2019 at 11 They took down Gen. G in a tough final set, marking their second Call of Duty event championship. ESPORTS. Written by <mark>Sam Bishop</mark> on the 16th of July 2019 at 08 They've been signed just in time for CWL Miami, with the Championships just around the corner too. NEWS. Written by Ben Lyons on the 9th of July 2019 at 12:52 This season of content brings zombies to the forefront in the latest iteration of the Call of Duty franchise. ESPORTS. Written by <mark>Sam Bishop</mark> on the 8th of July 2019 at 08 This will be in effect until the end of the season, including CWL Champs taking place next month. ESPORTS. Written by <mark>Sam Bishop</mark> on the 21st of June 2019 at 10 Saints, Blazt, and Lacefield are making way for three new recruits as Midnight joins the list of teams making changes. ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 09 Gunless and Classic are out as the team looks to the future after a poor performance at the CWL Anaheim event. ESPORTS. Written by <mark>Sam Bishop</mark> on the 7th of June 2019 at 10 See how the action will unfold between the biggest and best Call of Duty teams in California this month. NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2019 at 12:13 This has introduced plenty for PS4 players to see, including changes to Blackout's map, new weaponry, and more. ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of June 2019 at 08 As the CWL Pro League goes on, Nolson is coming into the main roster as Accuracy becomes a substitute. ESPORTS. Written by <mark>Sam Bishop</mark> on the 23rd of May 2019 at 09 The player might have had a lot of success in the past, but he's moving to a substitute role as Ricky comes into the roster."}, {"articleID": "2018050801_00146971_W", "names": {"Kevin Macdonald": ["Q1344373", "Q52018728", "Q614111", "Q6396823"], "Kate Muir": ["Q58403926", "Q6375675"], "Matt Dillon": ["Q193070", "Q6788561", "Q93062"], "Jean-Luc Godard": ["Q3167159", "Q53001"]}, "date": "2018-05-08", "url": "http://www.digitaljournal.com/news/world/scandal-protesting-stars-and-bans-as-cannes-festival-opens/article/521616", "content": "Scandal, protesting stars and bans as Cannes festival opens Listen | Print By Fiachra GIBBONS (AFP) 5 mins ago in World The most political Cannes film festival in years opens Tuesday with female stars vowing to protest on the red carpet, two top directors barred from attending and bans hanging over other movies. With the industry still reeling from the Harvey Weinstein scandal, and Cannes under fire for its dearth of women directors, Cate Blanchett and Kristen Stewart are likely to join actresses and women directors Saturday in a protest in support of the #MeToo and Time's Up movements. The new \"Star Wars\" spin-off, \"Solo\" , is the only Hollywood blockbuster in a slightly less starry line-up than usual. But with no less than a dozen films with LGBT themes, and others tackling child abuse, male prostitution and an eye-watering DIY sex change, it has all the makings of a vintage year for scandal and controversy. A new documentary about the tragic singer Whitney Houston by Oscar winner <mark>Kevin Macdonald</mark> reportedly includes a devastating revelation about the demons that dogged her short life. \"Black Panther\" director Ryan Coogler--whose film is breaking box office records--is also likely to tackle the lack of black faces in Hollywood in a Cannes masterclass. - Lesbian film banned - Australian actress Cate Blanchett heads this year's Cannes jury Alberto PIZZOLI, AFP With Monty Python's Terry Gilliam fighting in the French courts to have his disaster-plagued \"The Man Who Killed Don Quixote\" shown, the first Kenyan movie to be selected for the world's top festival has already been banned in its homeland for daring to depict a lesbian romance. Despite a plea by US director Oliver Stone, Tehran has refused to lift a travel ban on Iranian master Jafar Panahi, whose \"Three Faces\" is in the running for the top Palme d'Or prize. The dissident director made it clandestinely after being banned from making films for 20 years for his activism after the \"stolen election\" of 2009. Appeals to bail Russia's Kirill Serebrennikov, under house arrest in Moscow on embezzlement charges his supporters claim are political, have also fallen on deaf ears. Festival director Thierry Fremaux told reporters Monday that it was ironic that both Iran and Russia should be \"punishing the directors when neither film is political\" . Serious doubts also hang over whether Gilliam's Pythonesque movie will be allowed to close the festival after it became embroiled in a bitter legal battle over who owns the rights. Judges in Paris will decide Wednesday whether the film, which Gilliam has laboured on for nearly two decades, can be shown. - \"Problem with women' - But it is Cannes'\" dismal \"record on female directors, and Saturday's red carpet protest led by A-list stars, which may generate the most political heat. Long before Weinstein had been accused of attacking four women at the festival, Cannes had been under fire for a\" problem with women \". Women have been stopped on the red carpet in previous years for not wearing high heels, and its dress code has been condemned as sexist. But the Weinstein scandal has given its critics further ammunition, with screenwriter <mark>Kate Muir</mark> of Women and Hollywood lacerating the festival as\" a two-week celebration of male brains and female beauty \". The 71st Cannes film festival Simon MALFATTO, AFP The fact that only three out of 21 directors in the running for the top prize are women--the same number as last year--has also rankled. While admitting that Cannes\" will never be the same again \"after the Weinstein scandal, Fremaux said he was against quotas. Instead he put Hollywood star Blanchett--one of the first to call out Weinstein--at the head a majority-female jury alongside another of Weinstein's victims, French\" Bond \"actress Lea Seydoux. But Fremaux's surprise decision to lift the festival's seven-year ban on Danish director Lars von Trier has stoked feminist ire. The ageing provocateur has been accused of sexual harassment by the singer Bjork, and his production company has been hit by multiple similar claims. Von Trier sparked outrage during a 2011 Cannes press conference by saying that he was a Nazi who understood Hitler and sympathised\" with him a little bit \". But Michel Hazanavicius, the Oscar-winning director of\" The Artist \", who is on the festival's board, insisted von Trier was joking, while Fremaux said Monday that the Dane was not an anti-Semite. Pointedly, however, he has not risked giving von Trier a press conference this time for his new serial killer flick,\" The House That Jack Built \"with Uma Thurman and <mark>Matt Dillon</mark>. Hazanavicius said the veteran Swiss-French director <mark>Jean-Luc Godard</mark>, whose latest film is also at Cannes, has also said\" much worse things than Lars von Trier on this very same topic \". But that\" doesn't mean we have to condemn them \"as artists, he added. The festival runs for two weeks and is considered the world's most prestigious film awards LOIC VENANCE, AFP\" It's very difficult for people to accept the idea that you can be a jerk in your personal life and a great artist. \""}, {"articleID": "2010102406_00313806_W", "names": {"Richard Lee": ["Q11890658", "Q16735186", "Q2150065", "Q2493449", "Q3934832", "Q54634631", "Q7327304", "Q7327305", "Q7327306", "Q7327309"]}, "date": "2010-10-24", "url": "http://feeds.sfgate.com/click.phdo?i=6c644df075699f421bde2caa8f598fda", "content": "article: prop. 19: fight over pot starts to heat up: / c/a/2010 / 10/23/ba8o1g0foe. dtl no tv ads. no billboards. just a lot of news conferences, endorsement announcements, mailings by special-interest groups and phone calls to voters. that's what the battle has consisted of so far in the campaigns around the lowest-key, highest-interest election issue on the nov. 2 ballot - proposition 19, which would legalize personal marijuana use for adults. and that's pretty much the game plan from here to the end. the very subject of legalizing marijuana has been in the public discourse for so many decades that many people apparently have their minds made up already, observers and combatants say. so the main challenge has been to fire up the converted on both sides, while educating voters in the middle to shore up the margins. a public policy institute of california survey released thursday showed 49 percent of californians saying they would vote no on the measure, and 44 percent saying they'd vote yes. that's a turnaround from a field poll last month that had prop. 19 up, 49 percent to 42 percent. a smattering of smaller polls disagree on which side is ahead. what this means, in the home stretch toward election day, is that prop. 19 is still up for grabs. \"it's probably going to be a squeaker one way or another,\" said tom angell, media director for prop. 19. \"our message is harder to get out, because it's got a little more complexity, but we're making headway,\" said roger salazar, spokesman for the no on prop. 19 effort. \"the other side is working overtime to generate some press, and so are we.\" no ads the most striking thing about the campaign is the lack of the advertisements, even though polls indicate prop. 19 is by far the most recognizable measure on the ballot. it's also been drawing international headlines because it would make california the first place in the united states to legalize recreational pot. \"we're seeing lots of ads for everything else on the ballot, aren't we? but not prop. 19,\" said martin carcieri, a political science professor at san francisco state university. \"it tells us that this is such a touchy subject you have to be careful.\" that, plus neither side has a ton of money, and ads are expensive. \"it generally costs about $2 million a week to run television ads statewide in a california election, and so far neither campaign has been able to attract a lot of cash. according to the california secretary of state's office, the anti-prop. 19 side had raised just $250,000 as of friday. the measure's proponents had pulled together $2.8 million, which could position them for a last-minute flurry of ads. by contrast, more than $22 million has been raised by the pro and con sides around proposition 24, which would repeal a number of tax breaks for big corporations. the main weapons in the battle over prop. 19 have been news coverage, endorsement announcements and opinion pieces in newspapers and on blogs. representatives of both sides, including police, politicians and educators, have debated each other in hundreds of settings.\" fired up' \"people are really fired up about this all over the country,\" angell said. \"we've got a huge bank of volunteers doing phone-bank work everywhere, and we're on most campuses.\" the crucial thing for us is direct contact with the voters through the phones and outreach. we really do feel we can win this. \"about 1,000 volunteers from as far away as denver's women's marijuana movement have pitched in to spread the pro-pot message by phone to voters. the proposition, drawn up by medical marijuana pioneer <mark>richard lee</mark> of oakland, would allow local jurisdictions to legalize the possession of as much as an ounce of marijuana for recreational use by anybody 21 or older, and to tax pot sales. each person could also grow the drug for personal use in anything up to a 5-by-5-foot space.\" i've always said that cannabis prohibition is hypocritical and unfair, \"said <mark>lee</mark>, who founded the oaksterdam marijuana-trade school in oakland.\" this sort of law is overdue. \"\"confusion' on the flip side, anti-prop. 19 activists say people don't need to be convinced that a drug is a drug. it's getting them to the polls that matters most.\" prop. 19 isn't really what it says it is - it will lead to a great deal of confusion, and it won't stop crime, \"said pleasant hill police chief dunbar, spokesman for the california police chiefs association.\" marijuana may be legalized one day, but this is not the way to do it. \"salazar said his campaign's message boils down to this:\" prop. 19 claims to regulate, tax and control marijuana, but it in fact does none of those things. \"he said there would be a proliferation of people coming to work and driving while stoned, and that many sellers may refuse to pay local taxes because marijuana would still be illegal under federal law. several home-grown groups, such as citizens against legalizing marijuana, a self-started outfit of 15 in sacramento, are spreading thousands of leaflets around the state to counteract the pro-prop. 19 phone calls and campus crusades. neither side will say if it is planning last-minute tv or radio ads, but if they do the arguments would undoubtedly echo what has already made the proposition the most recognizable one on the ballot, carcieri said. those for prop. 19 argue that it would bring in billions to governmental coffers through taxes and fees and give people the freedom to use an herb they see as less harmful than liquor or tobacco. and those who oppose it say prop. 19 would legitimize a dangerous drug that the federal government would still outlaw.\" americans really do believe in personal liberty, and that's part of why this proposition has gotten this far, \"carcieri said.\" of course, this is too much for even a lot of those who believe in personal liberty - but this time there is also the money argument. \"without the desperate economic situation we have now, this wouldn't be on the ballot.\" for more election-related news and information, visit our game 6 nlcs: sanchez takes the ball: sfgate: san francisco giants: the...sorry, comments are closed for this story."}, {"articleID": "2010051406_00103258_W", "names": {"Richard Murphy": ["Q20635299", "Q55523382", "Q57282970", "Q57847773", "Q7327951", "Q7327952", "Q7327954", "Q7327955", "Q7327956"]}, "date": "2010-05-14", "url": "http://seacoastonline.com/articles/20100514-NEWS-5140408", "content": "portsmouth firefighters at station 2, now located at 3010 lafayette road, await their first call in their new home on thursday. charles mcmahon news @ seacoastonline.com portsmouth - fire lt. <mark>richard murphy</mark> and his crew at station 2 could hardly contain their excitement thursday afternoon as they awaited their first call in their new home. less than a mile away from their old station, the firefighters moved into their new, energy-efficient station at 3010 lafayette road just after 1 p.m. thursday. for <mark>murphy</mark> and the rest of the firefighters who have spent time in the outdated 1968 station over the years, the move has been a long time coming. \"this offers us a tremendous amount of flexibility for both equipment and training,\" <mark>murphy</mark> said. \"the other station had pretty much lived out its purpose.\" the new facility boasts a training tower designed to help firefighters better prepare for high-level rescues, state-of-the-art amenities including flat screen televisions, a new multimedia training/community room dedicated to the late george i. pierce jr., and much improved living quarters. the training room also will be available to the public for meetings and an emergency operation center. with five firefighters on each shift, <mark>murphy</mark> said the new station contains six bunk rooms that will allow each firefighter privacy and a place to rest their heads. the 15,840-square-foot building has a leadership in energy and environmental design silver certification that designates it as a \"green\" building that meets the needs of a modern fire department, he said. in addition, the new station has plenty of room in each of its three bays to contain an ambulance, a ladder and tower truck, and virtually any other piece of equipment in the city's fleet. also included in the new facility are rooms designated for storage of fire fighting equipment, laundry maintenance and more. as one of the first firemen to occupy the building, <mark>murphy</mark> said he and his crew were thrilled to finally be home. with new locker rooms, a kitchen and kitchenette complete with stainless steel appliances, <mark>murphy</mark> said the expansion was imperative. \"we just didn't have the expansion capabilities at the other station,\" he said. fire chief christopher leclaire said the work done by contractors and city officials to ensure the facility came to fruition was \"excellent.\" \"they all did great work and made sure everything came in on time and on budget,\" leclaire said. \"we finally have adequate space to perform our function. it's a much better facility.\" the process of building a new station began nearly five years ago, according to leclaire. the location of the new facility was initially supposed to at the 2700 lafayette road station, but in november 2007, a lot at 3010 lafayette road became available for sale to the city. the property was purchased in july 2008, and construction began in march 2009. leclaire said the $4.2 million project would have never been possible without the assistance of city officials, the city council, and the fire commission. \"i'm thrilled the way it came out and we are all grateful to have the support of the council and the public in carrying this out,\" he said. we reserve the right to remove any content at any time from this community, including without limitation if it violates the"}, {"articleID": "2014050313_00011312_W", "names": {"Perry Martin": ["Q47471828", "Q7169839"]}, "date": "2014-05-03", "url": "http://chronicle.northcoastnow.com/2014/05/03/kentucky-derby-2014-california-chrome-shines-favorite-despite-humble-beginnings/", "content": "LOUISVILLE, Ky. - Steve Coburn proudly calls himself a working man, and he'll tell you upfront that he was insulted when a rich stable owner offered him millions of dollars for the racehorse who'd eaten cookies from his hand as a gangly 3-month-old. \"Somebody who's got that much money, just to think they can step in and buy something people have worked so hard to get to?\" Coburn said. \"To me, that was a slap in the face. The no was easy. Not just\" no,' but \"hell no .'\" It might seem strange, the idea of a populist hero as clear favorite in today's Kentucky Derby, a race that fires the dreams of multimillionaire horsemen around the world. But that's California Chrome. His owners, Coburn and <mark>Perry Martin</mark>, are racing novices who spent a grand total of $10,000 to breed their champion. His trainer, Art Sherman, last saw Churchill Downs as an 18-year-old stable hand and never expected to make it back. They've spent a giddy week telling their colt's story to anyone who asks - how Coburn and <mark>Martin</mark> met when they bought California Chrome's mother, an untalented Maryland-bred racer named Love the Chase; how Sherman thought the men were a touch nuts when they told him the young thoroughbred had a brilliant future. Thousands of long-shot tales bubble up every year, and almost none of them end anywhere near the starting gate of the Kentucky Derby. Yet here they are with the one horse that consistently blew away his competition in the spring prep races. \"It's become like a fairy tale come true,\" said Coburn, who turns 61 today. \"It really, really has. It's quite an amazing deal.\" Some top trainers will admit they'd never feel complete without a Derby win. But Sherman, 77, isn't among them. All week, he's laughed with well-wishers, telling them how fortunate he feels for this late-career gift. Given his short, sturdy build, it's not hard to picture Sherman as the jockey he was for 23 years. \"I'm very satisfied with my career,\" he said. \"I never made it to what you'd say are the big, big horses, but I won a lot of graded stakes, always won my share and had a lot of fun.\" Sherman last came to Kentucky in 1955 as an 18-year-old working the barn for the great California horse Swaps. He had caught the racing bug a few years earlier, listening to the men call in bets from his father's barber shop. \"Everything was overwhelming to me,\" he recalled. \"I'd never been out of California. We took the horse off the van into the barn area and I'm seeing all the people around ....It was an awesome experience.\" He watched Swaps charge to victory from a perch on the backside, never making it to the winner's circle. Sherman became a jockey, always successful but a bit under the national radar. He repeated the pattern as a trainer, accumulating more than 2,000 wins from his California stable but never producing a Triple Crown star. He won't lie to you and say he knew California Chrome was the one. But he liked the chestnut colt from early on, finding him both amiable and quick to learn. \"He was just a baby, and yet he was more focused than a lot of the 2-year-olds,\" Sherman said. Coburn had seen the same qualities from the time Love the Chase gave birth. He and <mark>Martin</mark> had paid a $2,000 stud fee to pair her with a stallion named Lucky Pulpit. It seemed a humble blend on the surface, but the men based their hopes on the great horses - Swaps, Seattle Slew, Secretariat - in California Chrome's more distant ancestry. Coburn, who makes his living manufacturing the magnetic strips on credit cards, calls the Derby favorite \"Junior.\" \"He was just very curious,\" Coburn recalled. \"I'd walk up and I'd pet him. I've been feeding him the Mrs. Pastures horse cookies since he was 3-months old. So we've been interacting since he was a baby.\" He and <mark>Martin</mark> gave the horse to Sherman because they wanted an old-school trainer who would give California Chrome plenty of individual attention. California Chrome's poise has been on display all week at Churchill Downs. He likes to stop for a moment and take in the scene, apparently unperturbed by the photographers and patrons clicking cameras all around him. \"It's like I've been saying, he's almost half-human,\" said his exercise rider, Willy Delgado. \"He just likes to take it all in.\" Though California Chrome had his ups and downs as a 2-year-old, he has passed every test this year. Facing a stacked field at the Santa Anita Derby on April 5, he exploded to a 5-length victory that stamped him as the horse to beat in Kentucky. Sherman said jockey Victor Espinoza even eased up on the horse late in the race. The trainer had never seen one of his horses deliver quite like that. \"Every time I watch him run, especially that last time, I say wow,\" he said. \"He deserves to be the favorite,\" said Kentucky trainer Mike Maker, who will saddle three horses in the Derby. \"What does he do so well? He likes to win.\" With California Chrome's success came those big purchase offers, one as high as $6 million, according to Coburn, who added that someone even offered $2 million for Love the Chase. But Coburn and <mark>Martin</mark> weren't about to bow out before the Triple Crown. They wanted to live the dream and give Sherman a chance to complete his 59-year Kentucky circle. After a week at the center of the racing world's attention, the trainer said he was still having fun Friday morning. It was 8 a.m. outside Barn 20, and California Chrome had jogged early, keeping to his routine. Sherman had been up since 2 a.m., perhaps because of all the chocolate ice cream he'd eaten the night before. He had also visited Swaps' grave behind the Kentucky Derby Museum. \"That was touching for me,\" he said. Nearby, Coburn held court in his worn boots and weather-beaten cowboy hat. He said he had a $300 Stetson in a box at home that Sherman wouldn't let him wear for reasons of superstition. More than 60 years around the business have taught Sherman the enormous role luck plays for any horse, much less a Kentucky Derby champion. Just 24 hours earlier, Hoppertunity, the second choice on the morning line, had scratched because of a foot bruise. Sherman shook his head sadly at the thought. He could see California Chrome's perfect trip in his mind's eye - no trouble around the first turn, hang a few horses back from the lead, outlast the early speed and stay ahead of the late chargers. But who knew if reality would be so kind? \"Life plays a funny part in a lot of things,\" Sherman said. \"Maybe it's my turn.\" TONIGHT WHAT: 140th Kentucky Derby POST TIME: 6:32 WHERE: Churchill Downs, Louisville, Ky.. FAVORITE: California Chrome TV: Channel 3 print"}, {"articleID": "2015071522_00063361_W", "names": {"John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"]}, "date": "2015-07-15", "url": "http://northwestgeorgianews.com/associated_press/news/national/japanese-bills-would-expand-military-s-role/article_24f717aa-2b33-11e5-bead-ef8fda8ed84e.html", "content": "TOKYO (AP)--A parliamentary committee on Wednesday approved legislation that would expand the role of Japan's military after Prime Minister Shinzo Abe's ruling bloc forced the vote in the face of protests from some lawmakers and citizens. Opposition lawmakers tried to stop the committee vote as hundreds of citizens protested outside. The unpopular legislation was crafted after Abe's Cabinet adopted a new security policy last year that reinterpreted a part of Japan's post-World War II constitution that only permitted the nation's military to use force for its self-defense. The bills in question would allow Japan to also defend aggression against its allies--a concept called collective self-defense. Abe has argued that Japan should better prepare for China's regional threat and do more to contribute to international peacekeeping efforts. But opponents, including legal experts and academics, counter that the new interpretation is unconstitutional. Polls show that about 80 percent of Japanese find the bills hard to swallow, and the majority of them say they think the legislation is unconstitutional. That tension was on display Wednesday as opposition lawmakers attempted to thwart the committee's vote and hundreds chanted anti-war and anti-Abe slogans outside in protest. Lawmakers rushed over to the podium and began to slap and grab at committee chairman Yasukazu Hamada as he cut off debate and began the voting process. Some held up posters that read \"No to a forced vote!\" and \"No to Abe politics!\" The legislation would \"fundamentally change the way Japan has sought pacifism since the end of the war,\" Kiyomi Tsujimoto, an opposition Democratic Part of Japan lawmaker, told Abe before the vote. Abe acknowledged Wednesday that the legislation doesn't have public support but said he could force the vote because his party has the voters' mandate--an attitude that has also angered critics and polarized the debate around the military legislation. Abe has been increasingly criticized for being an autocratic leader and members of his right-wing Liberal Democratic Party came under fire recently after suggesting that two liberal newspapers on Okinawa should be destroyed. \"The existence of our constitution is threatened, the sovereignty-of-the-people principle is threatened, and our democracy is being threatened,\" Tsujimoto said. In Washington, State Department spokesman <mark>John Kirby</mark> declined to comment on the security legislation, calling it a domestic matter for Japan, a key U.S. ally. But he said the U.S. welcomes \"Japan's ongoing efforts to strengthen the alliance and play a more active role in regional and international security activities.\" ___ Associated Press writer Matthew Pennington in Washington contributed to this report. Follow Mari Yamaguchi at https: //www.twitter.com/mariyamaguchi/ Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. & copy; 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2014120516_00022343_W", "names": {"Nick Jones": ["Q16229192", "Q17198222", "Q24799774", "Q3876016", "Q52892180", "Q7027374", "Q7027375"]}, "date": "2014-12-05", "url": "http://www.cbronline.com/news/govt-invest-10m-to-bring-driverless-cars-to-uk-roads-4461250", "content": "Gov' t invest £ 10m to bring driverless cars to UK roads Greenwich, Bristol, Coventry and Milton Keynes selected by Innovate UK to trial driverless cars. Four UK cities including Greenwich, Bristol, Coventry and Milton Keynes have been selected by Innovate UK to trial driverless cars. The formal trials are aimed at finding how driverless cars could be integrated into everyday life across the country, in order to better understand how driverless technology will interact with people. The UK Government has already funded £ 10m for the driverless cars competition and has the announced an additional £ 9m to help the cities implement the initiative. Bristol is planning to form a consortium, which is aimed at knowing how driverless cars can make roads safer and reduce congestion. Greenwich is expected to run the Gateway scheme which will test automated passenger shuttle vehicles and autonomous valet parking for adapted cars. Milton Keynes and Coventry will be working together on the UK Autodrive programme, which is aimed at developing technologies for integration into existing roads and the surrounding infrastructure to facilitate vehicle navigation. The programme is also expected to help the public get accustomed to seeing such vehicles on the road. Innovate UK lead technologist <mark>Nick Jones</mark> said: \"Cars that drive themselves would represent the most significant transformation in road travel since the introduction of the internal combustion engine and at Innovate UK; we want to help the UK to lead the world in making that happen.\" \"There are so many new and exciting technologies that can come together to make driverless cars a reality, but it's vital that trials are carried out safely, that the public have confidence in that technology and we learn everything we can through the trials so that legal, regulation and protection issues don't get in the way in the future.\" ICT Priorities in Financial Markets - Enterprise ICT investment plans Teneo is an infrastructure optimization company, providing solutions that help customers with the management, performance and virtualization of...Absolute ® Software specialises in technology and services for the management and security of mobile computers and smartphones. Webroot - Security Solutions Webroot provides industry leading security solutions for consumers, enterprises and small and medium businesses worldwide."}, {"articleID": "2017121517_00062986_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Paul Rogers": ["Q16083970", "Q1626414", "Q166149", "Q2061983", "Q22107239", "Q3247749", "Q7153300", "Q7153302"]}, "date": "2017-12-15", "url": "http://www.eastbaytimes.com/2017/12/15/bay-area-weather-red-flag-fire-warning-issued-ahead-of-dry-windy-weekend/", "content": "(National Weather Service Bay Area) Bay Area weather: Red-flag fire warning issued ahead of dry windy weekend By Robert Salonga | rsalonga @ bayareanewsgroup.com | Bay Area News Group December 15, 2017 at 8:24 am The National Weather Service has issued a red-flag fire warning in the Bay Area for this weekend, the first such December warning in four years, amid dry, warm and windy conditions, officials said. The red-flag declaration came a day after the agency issued a fire weather watch alert for Friday through Sunday in the Bay Area and Monterey County. But the red flag was issued once it was within 24 hours of the anticipated weather event appeared to arriving as expected. There has not been a red-flag fire warning issued in the Bay Area in December in 2013, during the height of the years-long drought that finally ended earlier this year. \"It's not unprecedented, we can get fires anytime throughout the year,\" meteorologist Charles Bell said. \"What's made this year interesting is that we've had so little rain recently, and we just had all those days of warmer than normal temperatures and offshore winds. So any rain has been nullified.\" Wind gusts expected to reach up to 50 mph, warm temperatures and low humidity will increase fire risk, particularly in the Santa Cruz Mountains, Diablo Range, East Bay hills and Big Sur areas. \"Its dry enough, with wind, anything that starts will take off,\" Bell said. The only saving grace is that that the calendar is approaching what Bell called the \"solar minimum\" with the least daylight of the year, so warm temperatures will be capped. Since Oct. 1, Northern California has had a mediocre rain season. Some storms in November increased the moisture levels in plants and dampened the ground. But with nothing new for weeks, San Jose is now at 43 percent of its historic rainfall average for this date, with 1.58 inches, while San Francisco is at 52 percent with 3.16 inches and Oakland is at 63 percent with 3.15 inches. This time last year, every one of those cities had already had twice as much rain. After the worst drought since California became a state in 1850, Gov. <mark>Jerry Brown</mark> last April rescinded his emergency drought declaration. Huge storms brought flooding in downtown San Jose and other areas, buried Sierra ski resorts in snow and wrecked the spillway at Oroville Dam, the tallest dam in the United States. If Northern California remains dry through New Year's Day, as the forecast suggests, this December would be the third driest on record in San Francisco history with .02 of an inch of rain, dating back to 1849, according to the National Weather Service. San Francisco recorded no December rainfall in 1876 and 1989. San Jose, which has received just a trace amount (less than one-hundredth of an inch) this month, would eclipse the current low of .04 of an inch in 1989. And Oakland International Airport, currently at .02 of an inch, would break the mark of .11 of an inch set in 2011. Staff writers <mark>Paul Rogers</mark> and Mark Gomez contributed to this report. Tags:"}]