[{"date": "2017-10-16", "url": "http://idahopress.com/sports/national/stat-watch-marshall-punter-s--yarder-longest-since/article_c933b9b2-1f12-553e-8488-cbb71a0a1f32.html?block_id=1359641", "content": "STAT WATCH: Marshall punter's 92-yarder longest since 1972 By ERIC OLSON AP College Football Writer 16 min ago (...) UCLA quarterback Josh Rosen (3) throws down field for a first down against Arizona in the first half during an NCAA college football game, Saturday, Oct. 14, 2017, in Tucson, Ariz. (AP Photo/Rick Scuteri) Rick Scuteri Oklahoma State quarterback <mark>Mason Rudolph</mark> (2) passes in the fourth quarter of an NCAA college football game against Baylor in Stillwater, Okla., Saturday, Oct. 14, 2017. Oklahoma State won 59-16. (AP Photo/Sue Ogrocki) Sue Ogrocki Boston College running back AJ Dillon (2) crosses the goal line to score during the second half of an NCAA college football game against Louisville, Saturday, Oct. 14, 2017, in Louisville, Ky.. Boston College won 45-42. (AP Photo/Timothy D. Easley) Timothy D. Easley Navy quarterback Zach Abey, left, runs the ball behind the blocking of fullback Chris High (33) in the first half of an NCAA college football game against Memphis Saturday, Oct. 14, 2017, in Memphis, Tenn. (AP Photo/Mark <mark>Humphrey</mark>) <mark>Mark Humphrey</mark> Navy quarterback Zach Abey (9) scores a touchdown on an 8-yard run against Memphis in the second half of an NCAA college football game Saturday, Oct. 14, 2017, in Memphis, Tenn.. Memphis upset Navy 30-27. (AP Photo/Mark <mark>Humphrey</mark>) <mark>Mark Humphrey</mark> Marshall's Kaare Vedvik knew he hit a good punt out of his own end zone. Once the ball landed, it kept going and going, farther than any other punt in a Football Bowl Subdivision game in 45 years. His 92-yard punt against Old Dominion on Saturday was, according to Marshall research, the longest since Southern Mississippi's <mark>Ray Guy</mark> boomed a 93-yarder against Mississippi in 1972. \"It's an unbelievable feeling to send it from one end zone to the other,\" the redshirt senior from Norway said. \"It's a punter's dream. Every time, you just try to hit your best ball. This one went over his head and had a nice tail wind. The ball rolled down to the other goal line, so you can't ask for anything better than that .\" × Vedvik's big punt came after the Thundering Herd went three plays and out on their first possession of the game. With the ball at the 8-yard line, Vedvik was deep in his own end zone and with a light wind at his back when he put his foot to the ball. It bounced at the Old Domion 30, over the return man, and skipped hard toward the end zone and rolled in before the coverage team could down it. Vedvik also had punts of 52, 36, 48 and 36 yards as well as a pooch punt of 27 in the Herd's 35-3 win. His season average of 44.8 yards leads Conference USA. The longest punt in FBS history: 99 yards by Nevada's <mark>Pat Brady</mark> against Loyola Marymount in 1950. Some other notable feats from the weekend:------LEG WORKOUT Kansas' Cole Moos established a national season high with 13 punts against Iowa State. No other punter in the FBS has attempted more than 11 in a game this season. Moos' 40 punts are most in the Big 12 by far. NAVY GOES BY LAND Navy leads the nation with 397.5 yards rushing per game, and the Midshipmen are on pace to pile up the most yards on the ground since Nebraska's 1995 national championship team averaged 399.8. Quarterback Zach Abey is running for 169.3 yards per game, 29 behind national leader Bryce Love of Stanford. Abey's 189 carries are tied for most in the country. The Midshipmen also get nearly 70 yards a game from both <mark>Malcolm Perry</mark> and Chris High. THE 200 CLUB Boston College freshman AJ Dillion had the top rushing performance of the weekend, running for 272 yards and four touchdowns on 39 carries in a 45-42 win over Louisville. It was the third-best outing by a BC back behind <mark>Andre Williams</mark>' 339 yards against North Carolina State and 295 yards against New Mexico State, both in 2013. Arizona quarterback Khalil Tate, after going for 327 yards against Colorado a week earlier, ran 15 times for 230 yards against UCLA. Wisconsin freshman <mark>Jonathan Taylor</mark> had his second straight 200-yard game, going for 219 on 30 carries against Purdue. Diocemy Saint Juste of Hawaii ran 39 times for 202 yards against San Jose State, his third 200-yard game of the season. FANTASTIC FALCON Air Force quarterback Arion Worthman became the fifth player this season to score five touchdowns in a game. Worthman finished with 166 yards and scored four of his touchdowns in the second half as the Falcons came back from a 27-point deficit to beat UNLV 34-30. Worthman's fifth TD, a 1-yard run with 2:14 left, gave the Falcons their first lead. PASSING LEADER Oklahoma State's <mark>Mason Rudolph</mark> and UCLA's Josh Rosen are in a close competition for most passing yards per game. <mark>Rudolph</mark> overtook Rosen this week after throwing for 459 yards against Baylor to raise his average to 394.7. Rosen had a season-low 219 yards against Arizona, dropping his average from 427 to 392.3 .------More AP college football: http: //collegefootball.ap.org and https: //www.twitter.com/AP--Top25 Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2017101607_00181338_W", "names": {"Mason Rudolph": ["Q19666923", "Q3543162"], "Pat Brady": ["Q2056430", "Q3368521", "Q7143235", "Q7143237"], "Ray Guy": ["Q1857411", "Q7297563"]}}, {"date": "2017-10-16", "url": "http://www.jdsupra.com/legalnews/cybersecurity-guidance-on-the-way-for-13808/", "content": "Cybersecurity Guidance on the Way for Small Businesses Embed To embed, copy and paste the code into your website or blog: <iframe src = \"/ / www.jdsupra.com/post/contentViewerEmbed.aspx? fid=da4eb4f8-f1d0-4236-996c-0f266a7095e4\" width = \"100%\" height = \"620\" frameborder = \"1\" style = \"border: 2px solid #ccc; overflow-x: hidden! important; overflow: hidden;\" scrolling = \"auto\" > </ iframe> On October 11, 2017, the House passed a bill that would provide guidance to small business on how to deal with cybersecurity issues. This legislation passed on the heels of a similar Senate bill that passed just weeks before on September 28. The NIST Small Business Cybersecurity Act (H.R. 2105) would require the Department of Commerce's National Institute of Standards and Technology (NIST) to issue voluntary guidelines specifically addressing the needs of the many small businesses across the country. Much like other voluntary guidelines enacted by NIST, the guidance for small business would not seek to add additional regulation, but rather would provide small business owners with a set of best practices to keep themselves safe in the constantly growing cyber world. According to the bill, small businesses account \"for 54 percent of all United States sales and 55 percent of jobs in the United States .\" Not only do attacks targeting small and medium businesses account for a high percentage of cyberattacks in the United States, according to the National Cyber Security Alliance, but \"[s] ixty percent of small businesses that suffer a cyberattack are out of business within 6 months .\" House sponsor <mark>Daniel Webster</mark> (R-Fla .), an owner of a multi-generational small business, stated that small businesses \"are more susceptible to attacks\" because of the limited cybersecurity resources and the \"tools they need to prepare for such an event .\" (via Bloomberg BNA .) According to <mark>Webster</mark>, the NIST cybersecurity framework would act to \"protect business owners, their employees, and their customer base, all while contributing positively to the economy .\" H.R. 2105 received bipartisan support and passed by a voice vote. The similar Senate bill, the MAIN STREET Cybersecurity Act (S. 770), also received bipartisan support. DISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. © Reed Smith + Follow more + Follow more Reed Smith on: \"My best business intelligence, in one easy email...\"Your first step to building a free, personalized, morning email brief covering pertinent authors and topics on JD Supra: Sign up using * Already signed up? Log in here * By using the service, you signify your acceptance of JD Supra's Privacy Policy. Privacy Policy (Updated: October 8, 2015): hide JD Supra provides users with access to its legal industry publishing services (the\" Service \") through its website (the\" Website \") as well as through other sources. Our policies with regard to data collection and use of personal information of users of the Service, regardless of the manner in which users access the Service, and visitors to the Website are set forth in this statement (\"Policy\" ). By using the Service, you signify your acceptance of this Policy. Information Collection and Use by JD Supra JD Supra collects users' names, companies, titles, e-mail address and industry. JD Supra also tracks the pages that users visit, logs IP addresses and aggregates non-personally identifiable user data and browser type. This data is gathered using cookies and other technologies. The information and data collected is used to authenticate users and to send notifications relating to the Service, including email alerts to which users have subscribed; to manage the Service and Website, to improve the Service and to customize the user's experience. This information is also provided to the authors of the content to give them insight into their readership and help them to improve their content, so that it is most useful for our users. JD Supra does not sell, rent or otherwise provide your details to third parties, other than to the authors of the content on JD Supra. If you prefer not to enable cookies, you may change your browser settings to disable cookies; however, please note that rejecting cookies while visiting the Website may result in certain parts of the Website not operating correctly or as efficiently as if cookies were allowed. Email Choice/Opt-out Users who opt in to receive emails may choose to no longer receive e-mail updates and newsletters by selecting the \"opt-out of future email\" option in the email they receive from JD Supra or in their JD Supra account management screen. Security JD Supra takes reasonable precautions to insure that user information is kept private. We restrict access to user information to those individuals who reasonably need access to perform their job functions, such as our third party email service, customer service personnel and technical staff. However, please note that no method of transmitting or storing data is completely secure and we cannot guarantee the security of user information. Unauthorized entry or use, hardware or software failure, and other factors may compromise the security of user information at any time. If you have reason to believe that your interaction with us is no longer secure, you must immediately notify us of the problem by contacting us at info @ jdsupra.com. In the unlikely event that we believe that the security of your user information in our possession or control may have been compromised, we may seek to notify you of that development and, if so, will endeavor to do so as promptly as practicable under the circumstances. Sharing and Disclosure of Information JD Supra Collects Except as otherwise described in this privacy statement, JD Supra will not disclose personal information to any third party unless we believe that disclosure is necessary to: (1) comply with applicable laws; (2) respond to governmental inquiries or requests; (3) comply with valid legal process; (4) protect the rights, privacy, safety or property of JD Supra, users of the Service, Website visitors or the public; (5) permit us to pursue available remedies or limit the damages that we may sustain; and (6) enforce our Terms & Conditions of Use. In the event there is a change in the corporate structure of JD Supra such as, but not limited to, merger, consolidation, sale, liquidation or transfer of substantial assets, JD Supra may, in its sole discretion, transfer, sell or assign information collected on and through the Service to one or more affiliated or unaffiliated third parties. Links to Other Websites This Website and the Service may contain links to other websites. The operator of such other websites may collect information about you, including through cookies or other technologies. If you are using the Service through the Website and link to another site, you will leave the Website and this Policy will not apply to your use of and activity on those other sites. We encourage you to read the legal notices posted on those sites, including their privacy policies. We shall have no responsibility or liability for your visitation to, and the data collection and use practices of, such other sites. This Policy applies solely to the information collected in connection with your use of this Website and does not apply to any practices conducted offline or in connection with any other websites. Changes in Our Privacy Policy We reserve the right to change this Policy at any time. Please refer to the date at the top of this page to determine when this Policy was last revised. Any changes to our privacy policy will become effective upon posting of the revised policy on the Website. By continuing to use the Service or Website following such changes, you will be deemed to have agreed to such changes. If you do not agree with the terms of this Policy, as it may be amended from time to time, in whole or part, please do not continue using the Service or the Website. Contacting JD Supra If you have any questions about this privacy statement, the practices of this site, your dealings with this Web site, or if you would like to change any of the information you have provided to us, please contact us at: info @ jdsupra.com. - hide * With LinkedIn, you don't need to create a separate login to manage your free JD Supra account, and we can make suggestions based on your needs and interests. We will not post anything on LinkedIn in your name. Or, sign up using your email address.", "articleID": "2017101612_00415458_W", "names": {"Daniel Webster": ["Q1163099", "Q22047723"]}}, {"date": "2017-10-16", "url": "http://www.theweek.co.uk/rugby-union/89036/gatland-s-law-scrapped-rhys-webb-told-he-won-t-play-for-wales", "content": "Oct 16, 2017 The WRU has changed its player selection policy for Test matches whatsapp facebook twitter google + linkedin email Stu Forster/Getty Images <mark>Rhys Webb</mark> in action for Wales against Scotland in the RBS Six Nations The Welsh Rugby Union (WRU) has scrapped the so-called \"Gatland's Law'--and this is bad news for star scrum-half <mark>Rhys Webb</mark>. See related Rugby in crisis: potential strike amid injury and mental health fears Gatland's Law--or as WalesOnline puts it, the WRU Senior Players Selection Policy--was introduced by head coach Warren Gatland to keep Test stars playing in Wales and bar them from international Test matches if they played outside Wales. WalesOnline says the law states that\" only players who play in Wales will be eligible for selection to the national squad \". These rules changed today. Under the new system, stars playing outside Wales will only be available for international selection if they have won 60 caps or more. The rule change does not apply to players with less than 60 caps if they are already playing outside Wales. One player who will be hit by the rule change is British & Irish Lions star <mark>Webb</mark>, who will join French side Toulon next season. Because he has won only 28 caps he will now miss out on Wales selection. Big breaking news as Gatland's Law is scrapped and a 60-cap rule introduced. <mark>Rhys Webb</mark> the big casualty. https: //t.co/njTEbhC1Aq--<mark>Simon Thomas</mark> (@ simonrug) October 16, 2017 Fly-half Dan Biggar is another player who could soon be out of the Wales set-up. He's currently on 56 appearances, but with a move to Northampton lined up next season he would need another four caps to remain in contention. When asked about the change, WRU chief executive Martyn Phillips told ITV Sport:\" Whatever contract that a player is in today, that contract is protected. When that contract expires and if the player has less than 60 caps, they would not be eligible for selection. \"If they have 60 or more caps and they are outside Wales they would be .\" He says the existing policy didn't work well enough and was \"quite complicated\". The aim, he says, is to make it simpler. \"We have tried to step back and say:\" let's try to simplify this' make it understandable for players, for supporters and try and give each of the five entities [four regions and Wales] access to the players they need. \"Wales head coach Gatland said:\" For me as a national coach, if I was being perfectly selfish, would I have a policy? No I wouldn't. It is not about me or the national team, it is about what is the best thing for Welsh rugby? He says the best thing is to try and keep the best players in Wales for \"as long as we possibly can\". While being aware of pressure from market forces, he says the new policy is \"pretty much black and white\". On social media some Wales supporters are furious about a rule change that will see their \"best player\" <mark>Webb</mark> miss out on selection. Sandra Loy called it a \"big decision\" by the WRU. Wow. Big decision, that #GatlandsLaw https: //t.co/QAKUT3BAiF--Sandra Loy (@ SandraLoy1) October 16, 2017 <mark>Webb</mark> has been thrown \"under the bus\" by the WRU, said one fan. Nice of the WRU to throw <mark>Rhys Webb</mark> under a bus. What a charming way to treat a fine player and British Lion. Says much of the organisation--PhilBB (@ rugbyPhilBB) October 16, 2017 Rugby World magazine writer <mark>Paul Williams</mark> feels for <mark>Webb</mark>. I genuinely feel for <mark>Rhys Webb</mark> 10 years service in Wales 145 caps for the Ospreys Yet apparently not even told about the '60 cap change'--<mark>Paul Williams</mark> (@ thepaulwilliams) October 16, 2017 These fans were more sarcastic in their reply to the news ...% u201CHey Warren, how good is <mark>Rhys Webb</mark>?% u201D% u201CWell, he% u2019s our best player, why?% u201D% u201CHow about, we make a rule that means you cant select him anymore?% u201D--Tom Albrighton (@ tmalbrghtn) October 16, 2017 <mark>Rhys Webb</mark>: * plays well enough to get recruited by one of Europe's top teams * WRU: on yer bike Top player development, that--Gareth (@ garethleaman) October 16, 2017 But Rugby Studio claims <mark>Webb</mark> knew that the rule would be changed. <mark>Rhys Webb</mark> was supposedly aware of the rule coming into place and still chose to move overseas--RugbyStudio (@ RugbyStudioblog) October 16, 2017 Advertisement Sign up for our daily newsletter Newsletter Close Sign me up Read more: Rugby Warren Gatland Sport You are here: Home rugby union \"Gatland's Law' scrapped: <mark>Rhys Webb</mark> told he won't play for Wales Advertisement Related Articles rugby union\" Gatland's Law' scrapped: <mark>Webb</mark> told he won't play for Wales rugby union Rugby in crisis: potential strike over extended season rugby union World Rugby hits back at \"alarmist' school rugby study rugby union Experts call for tackling and scrum ban in school rugby rugby union Billy Vunipola ruled out for four months Lions tour 2017 Lions officials angered by Sean O’Brien's criticism rugby union Billy Vunipola warns rugby players could go on strike rugby union England target the All Blacks and their No. 1 spot Advertisement", "articleID": "2017101614_00384035_W", "names": {"Paul Williams": ["Q11339500", "Q1375801", "Q14948624", "Q15441162", "Q15452843", "Q15990362", "Q18746544", "Q1933480", "Q19517939", "Q30165049", "Q3898170", "Q43082028", "Q50365751", "Q52645093", "Q542332", "Q55294657", "Q59094558", "Q7154382", "Q7154384", "Q7154386", "Q7154387", "Q7154392", "Q7154396", "Q7154397", "Q7154398", "Q7154399", "Q7154401", "Q7154402", "Q7154407", "Q927415"], "Rhys Webb": ["Q1118053", "Q7321844"], "Simon Thomas": ["Q14475873", "Q3405148", "Q46586417", "Q58327033", "Q59554832", "Q7519887", "Q7519889"]}}, {"date": "2017-10-16", "url": "http://tantrume.wordpress.com/2017/10/16/the-death-of-hollywood-and-the-echo-of-the-silence/", "content": "\"Lying is done with words, and also with silence .\" Adrienne Rich \"We can easily forgive a child who is afraid of the dark; the real tragedy of life is when men are afraid of the light .\" Plato Hollywood has erupted with a number of actresses coming forward to speak out regarding the abuse they suffered at the hands of American Producer Harvey Weinstein. Weinstein and his brother founded Miramax which has been responsible for successful films such as Pulp Fiction and Good Will Hunting. He has received numerous awards for his work and has been active in issues such as AIDS and Juvenile Diabetes. He was, undoubtedly, a Hollywood powerhouse who had the connections to make or break careers. Sexual assault is rampant around the world and I have long been an active voice speaking out against it and advocating for the victims. I am in no way minimizing what any woman suffers in my comments regarding this particular case but I have some serious concerns and I think they are concerns that should be shared. Lately, there has been a whole stream of public figures who stand accused of various sexual assaults. Some are hopeful that this signals a new willingness to expose these atrocities and that they represent our commitment to draw a line in the sand and say \"No more .\" We seem to circumvent the who legal process meant to determine guilt and jump straight to judgement. Guilt appears to be amplified by the public lives of the accused. Is it easier for us to comment on a life that we already feel we have a right to because we see them in our own homes on our media devices and on the news? It appears to at least polarize the accusers as legitimate and the accused as guilty. No-one seems to worry about questioning what we read and hear. A trial and its outcome are irrelevant. As long as you have Gloria Allred on one side of the microphone, the truth is irrelevant. The story never dies and the accused, even if innocent, will never completely recover. Take away the celebrity cases and looking to regular court in your own cities and communities and you will find a whole slew of sexual abuse allegations being made against, mainly men. In family court, those allegations are too frequently proven to be wrong or without substance. The man stands accused and those who are willing to lie in order to punish or hurt, or even sometimes to gain financial reward, are suddenly in the driver's seat. They have a story with elaborately made up facts. The accused now has to prove a negative. They have to prove that they did not abuse the \"pretend victim .\" These pretend victims are believed and supported BECAUSE there are real victims somewhere and their suffering is real. These false accusers, who themselves should be punished to the full extent of the law, use the very real stories of legitimate victims to further their lies. No-one should be championing these women. No-one should be supporting them. THEY make it harder for the real victims because once these liars are found out, they make it harder for real victims to come forward. They make it harder for people to believe them and they make it less likely that they will ever find justice, safety or peace. Isn't this the real foundation of all women's rights? We will no longer allow ourselves to be abused? We will stand up and speak out and we demand justice? Violence against women, especially sexual violence MUST end? Then WHY are women using the abuse of women as a weapon to \"get even\" or to \"make someone pay?\" Now amplify the accusation to the public arena and you have people possibly motivated for the same reasons but more. Now there is a quality of blackmail in taking it public. You and I probably do not care what is happening in a city on the other side of our countries where \"John Citizen\" has just been accused but we are possibly going to weigh in on \"John Celebrity .\" These people also are involved in issues, they speak out. They can expose people and their business practices. They may know about political issues and personalities. They may have done something to anger the wrong people or not done what they were supposed to do. The accusations made against <mark>Donald Trump</mark> during the last election are a perfect example. All of a sudden the man is accused of several instances of sexual abuse and yet none of them seem to have followed through and he was never found guilty or even charged. It seems like it all might just have been part of an attempt to keep him from being elected. Despite there being no real proof, many people still believe it as if there had been a conviction. All I am saying is there are plenty of reasons for people to stand up and make accusations without them ever being true. The \"pretend victims\" are using the accusation of sexual abuse for personal gain. I have heard some people insist there are too many women coming forward for Weinstein's charges to not be true. I hear people swayed by the star quality of some of the accusers. The bigger the star the more we seem willing to believe in their moral integrity, even when there is no evidence of a star having any morals or integrity. Is Weinstein guilty? I have no idea. Just because I state that I am not loading up my own supply of stones to throw does not mean I am supporting him or that I believe he is innocent. It means I don't know. None of us can say that we do. But here is where I am most uneasy. I see these women, huge stars such as Gwyneth Paltrow and Angelina Jolie and well-known stars like Rose McGowan and Ashely Judd, coming forward. According to Entertainment Weekly, there are more than 40 women to date. There are others who have not claimed abuse but who say they knew, like Jane Fonda. Many of these women are role models, active in various Women's groups. Some of them are considered role models for the other actresses. None of them spoke out? None of them. Not the abused, not the ones who heard about it, not the ones who saw it. This is reported to have been going on for years. They were abused and then they were silent. They did not seek help. They did not seek justice. They did not stand up and use their positions of leadership among women to speak the truth of their own experience and lead by example. I find myself asking why. The only answer is that ultimately, they all chose their careers overcoming forward. If they said anything, they would never work again because Weinstein was that powerful. I accept that it might have been incredibly painful. I accept that they may have been that damaged. But then, I have to ask, why did they stay? Why continue to work in an industry that operates on that level, with people who see and know and say nothing? Why risk further abuse in an industry with a man so powerful that he had great influence over their careers? They stayed and continued to work and accept the money, and uphold the image and the façade of Hollywood. They played the game. They were part of it. In making their choice they spit in the face of all the other victims which many of them heard about and talked with over the years. They did not protect them. They spit in the face of all the women who struggle to come forward in their own lives because the very real consequences of doing that might mean the loss of their families, and even worse violence, possibly death. The fame of many of these women offered them a protection that the average woman does not have. Their fame offered them a voice that could have saved many by identifying their abuser who, by their accounts, was growing bolder, but also by setting an example for other women to follow. Instead, Ashley Judd stood and insisted she was a \"nasty woman\" and assured all women they should be like her and fight against all these injustices. She was happy to hurl accusations at <mark>Trump</mark> when again, she had no personal knowledge as to whether any of those accusations were true, but the one truth she could have spoken with complete confidence went unspoken. She was willing to destroy someone else's life based on a possible lie but she was not willing to stand up for her own truth. I am sure there are many sexual predators in Hollywood, of course, there are, they are a group of people like any other group of people. Our world is filled with both violence and sexual depravity. Predators exist in practically every group you can name. The disregard for one another, the disrespect, the hate, is not about being black, or Muslim, or a woman, it is just the way many people now see the world. We are so bolstered in our sense of entitlement, our \"rights,\" that we now see other people as just tools that we can use and abuse as our whims and appetites might direct us. And while the predators should be exposed and stand to face their crimes, there are many other who should stand with them. In order for them to continue and to feed the appetites of the predator, there has to be a huge crowd of the people that know what is going on and do nothing. Sadly, in this case, that crowd included his victims. Hollywood has no-one to blame for the decay that I believe is going to destroy all of them, but themselves. \"Some people think they can find satisfaction in good food, fine clothes, lively music, and sexual pleasure. However, when they have all these things, they are not satisfied. They realize happiness is not simply having their material needs met. Thus, society has set up a system of rewards that go beyond material goods. These include titles, social recognition, status, and political power, all wrapped up in a package called self-fulfilment. Attracted by these prizes and goaded on by social pressure, people spend their short lives tiring body and mind to chase after these goals. Perhaps this gives them the feeling that they have achieved something in their lives, but in reality, they have sacrificed a lot in life. They can no longer see, hear, act, feel, or think from their hearts. Everything they do is dictated by whether it can get them social gains. In the end, they've spent their lives following other people's demands and never lived a life of their own. How different is this from the life of a slave or a prisoner?\" Liezi Advertisements Like this: Like Loading...Related", "articleID": "2017101617_00036348_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2017-10-18", "url": "https://www.indiatimes.com/entertainment/celebs/priyank-sharma-and-dhinchak-pooja-likely-to-enter-bigg-boss-11-house-as-wild-card-contestants-331873.html", "content": "Home> Entertainment> celebscoop Priyank Sharma And Dhinchak Pooja Likely To Enter Bigg Boss 11 House As Wild Card Contestants Garima Satija October 18, 2017 It has just been two weeks since Bigg Boss 11 started, and four contestants have already been evicted--Priyank Sharma, <mark>Zubair Khan</mark>, Sshivani Durga and Lucinda Nicholas. We have witnessed a lot of drama in this short span of time inside the Bigg Boss house, and a lot of it is going to follow henceforth. (Also Read: Eliminated Contestant Sshivani Durga Reveals She Didn't Do Black Magic Inside The Bigg Boss House) Twitter (Also Read: Here's How Much <mark>Hina Khan</mark>, Shilpa Shinde And Hiten Tejwani Are Earning Inside The Bigg Boss House) If the grapevine is to be believed, just like how arguments and fights have kick-started on season 11 so soon, the wild card entries, which generally arrive in the house when the show is half-way through the season, will also enter the house this week. In the Diwali special episode, two wild-card entries will go into the house--Dhinchak Pooja and Priyank Sharma. Confirming the news Priyank Sharma told Mumbai Mirror, \"This season has been explosive from the word go. My journey was incomplete because of an impulse decision. But I'll be going back into the house to make amends with a different outlook and advice from <mark>Salman</mark> sir. And I'm hoping I come out a winner at the end of this innings .\" Furthermore, according to Spotboye.com, internet sensation Dhinchak Pooja is also in talks to join Bigg Boss 11. What do you think of the two wild-card contestants? Tell us in the comments section below. Don't Miss <mark>Zubair Khan</mark> Hits Back At <mark>Salman</mark>, Mallika Dua Shares Her Molestation Story & More From Ent 828 SHARES Akash Dadlani Shouldn't Win Bigg Boss 11, Lashes Out Evicted Contestant Lucinda Nicholas 1.5 K SHARES After Sex-Change Surgery, Gaurav Arora Will Participate On \"India's Next Top Model' As...19.8 K SHARES Happy Anniversary, Saifeena! 9 Gorgeous Photos Of Saif & Bebo That Prove There's No One Like...22.2 K SHARES Stand-Up Comedian Mallika Dua Joins\" Me Too' Protest, Shares Her Horrifying Molestation Story 12 K SHARES Ajay Devgn Takes Potshots At Arshad Warsi & Tusshar Kapoor's Career And We Can't Help But...9.2 K SHARES Here's How Much <mark>Hina Khan</mark>, Shilpa Shinde And Hiten Tejwani Are Earning Inside The Bigg Boss...18.4 K SHARES After <mark>Zubair Khan</mark> Demands Apology, <mark>Salman Khan</mark> Says Sorry To His Dogs For Calling Him One 16.6 K SHARES Aamir Khan Reportedly Takes Kangana Ranaut's Side, Feels It's Unfair That She's Being...8.2 K SHARES 9 Countries Where Bollywood Is Badshah 11.5 K SHARES just in celebscoop 5 K SHARES Deepika Padukone Reveals She's Just 12th Pass & Her Parents Had A Big Problem With That MUST WATCH Trapped In Their Worlds, Will They Find An Escape? Entertainment Chris Hemsworth Is Open To Working In Bollywood If The Industry Offers Him A Great Script celebscoop 3.4 K SHARES Ajay Devgn Hails SC For Cracker Ban, Feels It Should Be Implemented In Other Cities As Well Looking for premium traffic in India? Times Group Entertainment 391 SHARES <mark>Sophie Turner</mark> Announces Engagement, Karni Sena Threatens To Burn Cinema Halls & More From Ent celebscoop 6.3 K SHARES Hrithik Roshan Is All Smiles As He Celebrates The Launch Of His Ex-Wife <mark>Sussanne Khan</mark>'s Luxury Boutique celebscoop 117 SHARES Pussycat Founder Rubbishes Kaya Jones \"Prostitution Ring' Claims, Says She's Looking For Fame bollywood 8.3 K SHARES Karni Sena Threatens To Burn Theatres If\" Padmavati' Is Not Shown To The Group Before Release celebscoop 775 SHARES Eliminated Contestant Sshivani Durga Reveals She Didn't Do Black Magic Inside The Bigg Boss House celebscoop 4.4 K SHARES Fatima Sana Shaikh Is The Central Character Of Thugs Of Hindostan And Not Katrina, Reveals Aamir Khan celebscoop 7.6 K SHARES <mark>Sophie Turner</mark> AKA Sansa Stark Announces Her Engagement To Joe Jonas & Priyanka Is Happy For Them celebscoop 340 SHARES Spiderman Star <mark>Tom Holland</mark> Pokes Fun At Mark Ruffalo, Calls Him \"Worst Avengers Secret Keeper' celebscoop 1.5 K SHARES Priyanka Chopra Looks Pretty As A Petal In Her Peach Attire As She Attends A Gala In Los Angeles Entertainment 1.5 K SHARES Sshivani Durga Evicted From Bigg Boss 11, Shabana Azmi Gets Trolled Again & More From Ent World", "articleID": "2017101805_00353379_W", "names": {"Hina Khan": ["Q10948640", "Q5765564"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}]