[{"date": "2017-10-18", "url": "https://www.indiatimes.com/entertainment/celebs/priyank-sharma-and-dhinchak-pooja-likely-to-enter-bigg-boss-11-house-as-wild-card-contestants-331873.html", "content": "Home> Entertainment> celebscoop Priyank Sharma And Dhinchak Pooja Likely To Enter Bigg Boss 11 House As Wild Card Contestants Garima Satija October 18, 2017 It has just been two weeks since Bigg Boss 11 started, and four contestants have already been evicted--Priyank Sharma, <mark>Zubair Khan</mark>, Sshivani Durga and Lucinda Nicholas. We have witnessed a lot of drama in this short span of time inside the Bigg Boss house, and a lot of it is going to follow henceforth. (Also Read: Eliminated Contestant Sshivani Durga Reveals She Didn't Do Black Magic Inside The Bigg Boss House) Twitter (Also Read: Here's How Much <mark>Hina Khan</mark>, Shilpa Shinde And Hiten Tejwani Are Earning Inside The Bigg Boss House) If the grapevine is to be believed, just like how arguments and fights have kick-started on season 11 so soon, the wild card entries, which generally arrive in the house when the show is half-way through the season, will also enter the house this week. In the Diwali special episode, two wild-card entries will go into the house--Dhinchak Pooja and Priyank Sharma. Confirming the news Priyank Sharma told Mumbai Mirror, \"This season has been explosive from the word go. My journey was incomplete because of an impulse decision. But I'll be going back into the house to make amends with a different outlook and advice from <mark>Salman</mark> sir. And I'm hoping I come out a winner at the end of this innings .\" Furthermore, according to Spotboye.com, internet sensation Dhinchak Pooja is also in talks to join Bigg Boss 11. What do you think of the two wild-card contestants? Tell us in the comments section below. Don't Miss <mark>Zubair Khan</mark> Hits Back At <mark>Salman</mark>, Mallika Dua Shares Her Molestation Story & More From Ent 828 SHARES Akash Dadlani Shouldn't Win Bigg Boss 11, Lashes Out Evicted Contestant Lucinda Nicholas 1.5 K SHARES After Sex-Change Surgery, Gaurav Arora Will Participate On \"India's Next Top Model' As...19.8 K SHARES Happy Anniversary, Saifeena! 9 Gorgeous Photos Of Saif & Bebo That Prove There's No One Like...22.2 K SHARES Stand-Up Comedian Mallika Dua Joins\" Me Too' Protest, Shares Her Horrifying Molestation Story 12 K SHARES Ajay Devgn Takes Potshots At Arshad Warsi & Tusshar Kapoor's Career And We Can't Help But...9.2 K SHARES Here's How Much <mark>Hina Khan</mark>, Shilpa Shinde And Hiten Tejwani Are Earning Inside The Bigg Boss...18.4 K SHARES After <mark>Zubair Khan</mark> Demands Apology, <mark>Salman Khan</mark> Says Sorry To His Dogs For Calling Him One 16.6 K SHARES Aamir Khan Reportedly Takes Kangana Ranaut's Side, Feels It's Unfair That She's Being...8.2 K SHARES 9 Countries Where Bollywood Is Badshah 11.5 K SHARES just in celebscoop 5 K SHARES Deepika Padukone Reveals She's Just 12th Pass & Her Parents Had A Big Problem With That MUST WATCH Trapped In Their Worlds, Will They Find An Escape? Entertainment Chris Hemsworth Is Open To Working In Bollywood If The Industry Offers Him A Great Script celebscoop 3.4 K SHARES Ajay Devgn Hails SC For Cracker Ban, Feels It Should Be Implemented In Other Cities As Well Looking for premium traffic in India? Times Group Entertainment 391 SHARES <mark>Sophie Turner</mark> Announces Engagement, Karni Sena Threatens To Burn Cinema Halls & More From Ent celebscoop 6.3 K SHARES Hrithik Roshan Is All Smiles As He Celebrates The Launch Of His Ex-Wife <mark>Sussanne Khan</mark>'s Luxury Boutique celebscoop 117 SHARES Pussycat Founder Rubbishes Kaya Jones \"Prostitution Ring' Claims, Says She's Looking For Fame bollywood 8.3 K SHARES Karni Sena Threatens To Burn Theatres If\" Padmavati' Is Not Shown To The Group Before Release celebscoop 775 SHARES Eliminated Contestant Sshivani Durga Reveals She Didn't Do Black Magic Inside The Bigg Boss House celebscoop 4.4 K SHARES Fatima Sana Shaikh Is The Central Character Of Thugs Of Hindostan And Not Katrina, Reveals Aamir Khan celebscoop 7.6 K SHARES <mark>Sophie Turner</mark> AKA Sansa Stark Announces Her Engagement To Joe Jonas & Priyanka Is Happy For Them celebscoop 340 SHARES Spiderman Star <mark>Tom Holland</mark> Pokes Fun At Mark Ruffalo, Calls Him \"Worst Avengers Secret Keeper' celebscoop 1.5 K SHARES Priyanka Chopra Looks Pretty As A Petal In Her Peach Attire As She Attends A Gala In Los Angeles Entertainment 1.5 K SHARES Sshivani Durga Evicted From Bigg Boss 11, Shabana Azmi Gets Trolled Again & More From Ent World", "articleID": "2017101805_00353379_W", "names": {"Sophie Turner": ["Q240573", "Q735034"], "Sussanne Khan": ["Q22301945", "Q23696666"], "Tom Holland": ["Q1236243", "Q1340923", "Q16104458", "Q2023710", "Q42887023", "Q7816215"], "Zubair Khan": ["Q16195412", "Q16222244", "Q42368847", "Q56275247"]}}, {"date": "2017-10-19", "url": "http://www.metro.us/news/reuters/suspect-maryland-shooting-killed-three-arrested-delaware", "content": "Reuters Suspect in Maryland shooting that killed three arrested in Delaware By <mark>Ian Simpson</mark> Facebook Twitter LinkedIn Reddit StumbleUpon Email By <mark>Ian Simpson</mark> (Reuters) - An employee of a Maryland kitchen countertop company suspected of fatally shooting three co-workers and critically wounding two others on Wednesday was arrested in neighboring Delaware, a Maryland county sheriff said. The suspected gunman, Radee Prince, 37, was apprehended by U.S. agents and others, the Harford County Sheriff's Office said on Twitter, without providing further details. Prince was also being sought for a shooting in Delaware that took place after the Maryland shooting. Prince entered Advanced Granite Solutions in Edgewood, Maryland, just before 9 a.m. and fired multiple shots from a handgun, Harford County Sheriff Jeffrey Gahler told reporters. Three people died at the company's premises in a business park northeast of Baltimore. Two people were taken to a hospital, one of whom had come out of surgery, he said. Those killed were identified as Jose Romero, 34; Enis Mrvoljak; and Bayarsaikhan Tudev, the Harford County Sheriff's Office said in a statement. Two other people shot in the attack were in critical condition at the University of Maryland Shock Trauma Center, it said. Gahler called the shooting a \"targeted attack .\" Asked about the gunman's possible motive, he said: \"We believe he's tied into a relationship here at work .\" Prince had worked for Advanced Granite Solutions for the past four months and had been scheduled to work on Wednesday, the sheriff said. The suspect fled in a black GMC Acadia with Delaware license plates. Police in Wilmington, Delaware, about 30 miles (50 km) northeast of Edgewood, said Prince was also being sought for a shooting there at 10:46 a.m. that injured a man. Wilmington police spokeswoman Stephanie Castellani said the victim identified the shooter as Prince, who fled in the same vehicle. Prince had been arrested 42 times in Delaware and had 15 felony convictions, she said. \"He is a dangerous individual,\" said Castellani, adding that the motive was not yet known but that Prince was associated with all six victims. \"We do not know if there is a beef going on between the victims and the suspect .\" (Reporting by <mark>Ian Simpson</mark> in Washington; Additional reporting by Chris Kenning in Chicago, Jon Herskovitz in Austin, Texas and Keith Coffman in Denver; Editing by Lisa Shumaker and Peter Cooney) By Reuters Top News Published: October 18, 2017 | Updated: October 18, 2017 Facebook Twitter LinkedIn Reddit StumbleUpon Email More Share this article Facebook Twitter Mail Google Plus Reddit LinkedIn", "articleID": "2017101903_00143249_W", "names": {"Ian Simpson": ["Q21455115", "Q59303806", "Q5982901", "Q5982902"]}}, {"date": "2017-10-19", "url": "https://sg.finance.yahoo.com/news/cramer-remix-why-oct-20-230000561.html", "content": "Jim Cramer took a trip down memory lane to 30 years ago, when the market suffered its worst one-day plunge ever. More CNBC's Jim Cramer had a unique experience during the historic market crash of 1987 that occurred 30 years ago Thursday. \"People always want to talk about Black Monday, 30 years ago today where the Dow lost 500 points, erasing more than 20 percent of the market's value,\" the \"Mad Money\" host said. \"But as bad as Black Monday was, believe it or not, it was the next day--Terrible Tuesday, as it was known back then--that really scared the bejesus out of people .\" The day after the crash, investors, traders and fund managers alike could not determine the lay of the land, Cramer said. Stock prices were unclear, equities were falling, and the futures suggested the market had another 20 percent decline ahead. \"It was as if the world had ended and it didn't matter what you owned, it was going to be beaten down to a pulp by the endless cascade of Chicago S & P futures raining on the New York Stock Exchange,\" Cramer said. \"I was scared stiff .\" But in the week before the crash, Cramer got a lucky call that helped him save his hide. Cramer's Sell-Off Playbook As equities slid from their highs after a brief 100-basis-point dip in the Dow Jones industrial average on Thursday, Cramer wanted to reinforce his sell-off strategy. \"That's when you need to be ready with the playbook,\" he said. \"That's when you need to go over all your notes that were written in a calmer moment after watching the show about what to buy, your shopping list and how, if you get a pullback that has nothing to do with the merchandise that you want, damaging just the stock but not the company, you should use it to pounce at sale prices rather than being so confused by the fog of war that you panic like everyone else .\" As the negative news began trickling in before the bell on Thursday, beginning with an earnings miss from Unilever, continuing with a tepid quarter from SAP and ending with a notable decline in shares of Apple, Cramer felt the sell-off coming. But every sell-off is different, so Cramer decided to review his \"targets of opportunity\" to see if the stocks he has wanted to buy on weakness were indeed pulling back. Skyworks Solutions CEO: Digital Traffic Jam The world is going mobile at a faster rate than most technology companies ever expected, Skyworks Solutions CEO <mark>Liam Griffin</mark> told CNBC on Thursday. \"We never anticipated what mobile was going to do for this world, for this economy,\" <mark>Griffin</mark> said in an exclusive interview with Cramer. \"So what's happened, by virtue of all of this excitement and this data and the commerce that's being transmitted, we've created a very, very crowded network. Spectrum today is really in a digital traffic jam .\" \"Spectrum\" refers to the electromagnetic spectrum that telecommunications companies use to transmit mobile signals. Companies like Verizon license parts of the spectrum from the government and use them to run 3G and 4G broadband networks. But <mark>Griffin</mark> argued that 3G and 4G soon won't be enough to handle the number of mobile users in the world. Winnebago CEO: Remaining Connected After Winnebago Industries Inc. reported 73 percent revenue growth year-over-year on Thursday, and CEO <mark>Michael</mark> Happe said the gains are coming from a revived love for recreational vehicles. \"Winnebago has been synonymous with the RV lifestyle throughout its history,\" Happe told Cramer on Thursday. \"But what we're seeing today is really this race for people to get outdoors and create memories and create experiences .\" Having recently acquired towable RV maker Grand Design, Winnebago is on a \"high-growth track,\" Happe said. Industry experts expect 2017 to see the highest level of RV shipments ever. But with much of the industry's momentum coming from the millennial generation, going \"off the grid\" comes with a little more pizzazz nowadays, Happe told Cramer. \"Some recent research said that almost 80 percent of people who are in the RV lifestyle...want to remain connected while they're on the road,\" the CEO said. \"People want to get off the grid, Jim, but they really want to remain connected. They do want to send those panoramic pictures on their Snapchats or Instagrams. They want to share their experiences with people, and so we are trying to place technology into the coaches, the trailers, the fifth-wheelers that enable people to do that .\" Read more Lightning Round: Building on USG's Gains? In Cramer's lightning round, he shared his take on some callers' favorite stocks: USG Corporation: \"People don't understand, but I know this from Suburban Enterprises' <mark>Michael Haley</mark>--he was my best man--that the thing that goes the worst is the dry board. OK? It's got to be ripped out because of mold. I think people are short-changing USG. It's going to go up more than it already has because it's the registered trademark of, yes, U.S. gypsum .\" Enterprise Products Partners L.P.: \"If you want to be in one of the better master-limited partnerships, which almost nobody wants to be, it would be Enterprise Products Partners. It's a very good company .\" Questions for Cramer? Call Cramer: 1-800-743-CNBC Want to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine Questions, comments, suggestions for the \"Mad Money\" website? madcap @ cnbc.com", "articleID": "2017101923_00244881_W", "names": {"Liam Griffin": ["Q6539614", "Q6539615"], "Michael Haley": ["Q21621422", "Q22279202", "Q3308234", "Q6830906"]}}, {"date": "2017-10-20", "url": "http://www.mrt.com/news/world/article/What-Puerto-Rico-is-doing-to-get-the-power-back-12292552.php", "content": "http: //www.mrt.com/news/world/article/What-Puerto-Rico-is-doing-to-get-the-power-back-12292552.php What Puerto Rico is doing to get the power back after storm Ben Fox, Associated Press Updated 11:10 pm, Thursday, October 19, 2017 Photo: Ramon Espinosa, AP Image 1 of / 10 Caption Close Image 1 of 10 In this Friday, Oct. 13, 2017 photo, a resident tries to connect electrical lines downed by Hurricane Maria in preparation for when electricity is restored in Toa Baja, Puerto Rico. A month after the storm rolled across the center of Puerto Rico, power is still out for the vast majority. less In this Friday, Oct. 13, 2017 photo, a resident tries to connect electrical lines downed by Hurricane Maria in preparation for when electricity is restored in Toa Baja, Puerto Rico. A month after the storm...more Photo: Ramon Espinosa, AP Image 2 of 10 In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers stand on towers to restore lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said Whitefish was making progress on the line that carries about 230,000 volts to San Juan from the Aguirre power plant in the south, which will vastly increase the amount of power reaching the capital. less In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers stand on towers to restore lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said Whitefish was...more Photo: Ramon Espinosa, AP Image 3 of 10 In this Thursday, Oct. 19, 2017 photo, Ezequiel Rivera works with the Electric Energy Authority to restore distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The office of Gov. <mark>Ricardo</mark> Rossello said Thursday, Oct. 19 that about 20 percent of the island has service and he has pledged to get that to 95 percent by Dec. 31. less In this Thursday, Oct. 19, 2017 photo, Ezequiel Rivera works with the Electric Energy Authority to restore distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The...more Photo: Carlos Giusti, AP Image 4 of 10 In this Sunday, Oct. 15, 2017 photo, a helicopter from Whitefish Energy Holdings flies to power line towers for repairs after the passing of Hurricane Maria in Barceloneta, Puerto Rico. The storm's path was ideal for taking down the entire grid. less In this Sunday, Oct. 15, 2017 photo, a helicopter from Whitefish Energy Holdings flies to power line towers for repairs after the passing of Hurricane Maria in Barceloneta, Puerto Rico. The storm's path was...more Photo: Ramon Espinosa, AP Image 5 of 10 In this Thursday, Oct. 19, 2017 photo, a brigade from the Electric Power Authority repairs distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The storm struck after the Authority had filed for bankruptcy in July, put off maintenance and had finished dealing with outages from Hurricane Irma. less In this Thursday, Oct. 19, 2017 photo, a brigade from the Electric Power Authority repairs distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The storm struck after...more Photo: Carlos Giusti, AP Image 6 of 10 In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers restore power lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said previous work restoring transmission lines damaged by wildfires in the western U.S. has prepared them for the Puerto Rico contract. less In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers restore power lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said previous work restoring...more Photo: Ramon Espinosa, AP Image 7 of 10 In this Thursday, Oct. 19, 2017 photo, a resident walks by Electric Power Authority worker Ezequiel Rivera restoring distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. Without air-conditioning, many residents have resorted to using washboards to clean clothes and sleeping on their balconies for relief from daytime temperatures above 90 degrees. less In this Thursday, Oct. 19, 2017 photo, a resident walks by Electric Power Authority worker Ezequiel Rivera restoring distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto...more Photo: Carlos Giusti, AP Image 8 of 10 In this Monday, Oct. 16, 2017 photo, power lines lay broken after the passage of Hurricane Maria in Dorado, Puerto Rico. A month after the storm rolled across the center of the island, power is still out for the vast majority of people as the work to restore hundreds of miles of transmission and distribution lines grinds on. less In this Monday, Oct. 16, 2017 photo, power lines lay broken after the passage of Hurricane Maria in Dorado, Puerto Rico. A month after the storm rolled across the center of the island, power is still out for...more Photo: Ramon Espinosa, AP Image 9 of 10 In this Sunday, Oct. 15, 2017 photo, power lines stand at an angle surrounded by vegetation that was torn down by Hurricane Maria in Barceloneta, Puerto Rico. Hurricane Maria's onslaught was sufficient to knock down hundreds of transmission towers and thousands of distribution poles and lines. less In this Sunday, Oct. 15, 2017 photo, power lines stand at an angle surrounded by vegetation that was torn down by Hurricane Maria in Barceloneta, Puerto Rico. Hurricane Maria's onslaught was sufficient to knock...more Photo: Ramon Espinosa, AP Image 10 of 10 What Puerto Rico is doing to get the power back after storm 1 / 10 Back to Gallery BARCELONETA, Puerto Rico (AP)--Electrical linemen descend from helicopters, balancing on steel girders 90 feet high on transmission towers in the mountains of central Puerto Rico, far from any road. At the same time, crews fan out across the battered island, erecting light poles and power lines in a block by block slog. A month after Hurricane Maria rolled across the center of Puerto Rico, the power is still out for the vast majority of people on the island as the work to restore hundreds of miles of transmission lines and thousands of miles of distribution lines grinds on for crews toiling under a blazing tropical sun. And it won't get done soon without more workers, more equipment and more money, according to everyone involved in the effort. \"It's too much for us alone,\" Nelson Velez, a regional director for the Puerto Rican power authority, said as he supervised crews working along a busy street in Isla Verde, just east of San Juan, on a recent afternoon. \"We have just so many, so many areas affected .\" The office of Gov. <mark>Ricardo</mark> Rossello said Thursday that about 20 percent of the island has service and he has pledged to get that to 95 percent by Dec. 31. For now, though, most of the island's 3.4 million people suffer without air conditioning or basic necessities. Many have resorted to using washboards, now frequently seen for sale along the side of the road, to clean clothes, and sleeping on their balconies and flocking to any open restaurants for relief from daytime temperatures above 90 degrees. \"I thought we would we have power in the metro area by now,\" said <mark>Pablo Martinez</mark>, an air conditioning technician, shaking his head in frustration. Hurricane Maria, which caused at least 48 deaths on the island, made landfall on the southeastern coast near Yabucoa as a Category 4 storm, with maximum sustained winds of about 154 mph (248 kph). It passed out of the territory about 12 hours later near Barceloneta in the north, still with sustained winds of about 115 mph (185 kph). The onslaught was sufficient to knock down hundreds of transmission towers and thousands of distribution poles and lines. The storm's path was ideal for taking down the entire grid. Most of Puerto Rico's generating capacity is along the southern coast and most consumption is in the north around San Juan, with steel and aluminum transmission towers up to 90 feet (27 meters) tall running through the mountains in the middle. At least 10 towers fell along the most important transmission line that runs to the capital, entangling it with a secondary one that runs parallel and that lost about two dozen towers in a hard-to-reach area in the center of the island. \"It reminds me of a fireball that just burned everything in its path,\" said Brig. Gen. Diana Holland, commander of the Army Corps of Engineers unit working to clear debris and restore the grid, with nearly 400 troops on the ground. The storm also struck at a terrible time. The Puerto Rico Electric Power Authority filed for bankruptcy in July. It has put off badly needed maintenance and had just finished dealing with outages from Hurricane Irma in early September. \"You stop doing your typical deferred maintenance, and so you become even that much more susceptible to a storm like Maria and Irma coming and blowing down your towers, water coming up in your substations and flooding them,\" said <mark>Tom Lewis</mark>, president of the Louis Berger Group, which has been supplying generators in Puerto Rico to clients that include the Federal Emergency Management Agency. \"Everything becomes that much more sensitive to any kind of damage whether it be from wind or water .\" PREPA Director <mark>Ricardo Ramos</mark> said the authority is working with the Army Corps of Engineers and contractors to bring in more \"bucket trucks\" and other equipment. It already has about 400 three - to five-member repair crews and is trying to reach 1,000 within three weeks with workers brought in from the U.S. \"With this number of brigades we will be able to advance much more rapidly,\" <mark>Ramos</mark> assured reporters during a recent news conference. PREPA brought in a Montana company, Whitefish Energy Holdings, to help its crews restore the transmission and distribution lines across the island. It has a rolling contract and can bill up to $300 million for its work, said Odalys <mark>de Jesus</mark>, a spokeswoman for the power authority. It is a huge job for a young company, formed in 2015. Whitefish CEO Andy Techmanski said previous work restoring transmission lines damaged by wildfires in the western U.S. has prepared them for the Puerto Rico contract. \"We don't like easy,\" he said during a break at one of the company's base camps near Barceloneta. The camp buzzes with activity as helicopters come and go, taking linemen and equipment to the mountain towers, the pilots deftly navigating the lines and mountains to lower men and equipment to the steel-and-aluminum girds high above the trees. Whitefish had about 270 employees in Puerto Rico as of midweek, working both on transmission and distribution. It expects the number to double in the coming weeks if it can find sufficient lodging and transport to the island. Other contractors working in Puerto Rico include Fluor Corp., which was awarded a $336.2 million contract from the Army Corps of Engineers for debris removal and power restoration, and Weston Solutions, which is providing two generators to stabilize power in the capital for $35 million. Their efforts are to restore the system that was in place before the storm, not to build a better one, at least not yet. Gov. Rossello says the island needs to overhaul its power grid, make it less vulnerable and look at alternative sources. He welcomed a proposal by Elon Musk, CEO of electric-car company Tesla, to expand solar energy and has raised the issue of longer-term improvements with Washington. House Speaker <mark>Paul Ryan</mark> seemed to express at least a willingness to consider helping Puerto Rico build back better when he visited the island this month. \"If you going to put up a power line let's put up a power line that can withstand hurricane-force winds,\" he said. \"It makes no sense to put temporary patches on problems that have long term effects .\" Techmanski said Whitefish was making progress on the line that carries about 230,000 volts to San Juan from the Aguirre power plant in the south, which will vastly increase the amount of power reaching the capital. \"We're getting it done,\" he said. But, asked about the goal of getting 95 percent of power back by the end of the year, he wasn't sure: \"It is very optimistic at this point .\" ___ Associated Press writer Danica Coto contributed to this report. Stay Connected Top Jobs Latest News & Sports Video Latest Stories Former GOP chair to run for county judge Diamondback CEO joins list of industry leaders supporting road...JumBurrito offers free burrito for those who vote Appeals court grants Young stay of execution Democratic lt. gov. candidate says school finance relief is...Leach about road bond: \"I am for it' Concho's Leach in center of action at A & M Road bond campaign raises more than $61,000 during first period Most Popular 1 UPDATE: Emerson Elementary lockdown lifted 2 Massive North Texas ranch goes up for sale 3 MISD spokeswoman: Emerson student recants story about weapon 4 Appeals court grants Young stay of execution 5 Halloween and Fall Celebrations 6 More than 80 children saved and 120 traffickers arrested by...7 JumBurrito offers free burrito for those who vote View Comments © 2017 Hearst Communications, Inc. .", "articleID": "2017102004_00200519_W", "names": {"De Jesus": ["Q36553259", "Q5361013"], "Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}]