[{"date": "2017-10-20", "url": "http://www.mrt.com/news/world/article/What-Puerto-Rico-is-doing-to-get-the-power-back-12292552.php", "content": "http: //www.mrt.com/news/world/article/What-Puerto-Rico-is-doing-to-get-the-power-back-12292552.php What Puerto Rico is doing to get the power back after storm Ben Fox, Associated Press Updated 11:10 pm, Thursday, October 19, 2017 Photo: Ramon Espinosa, AP Image 1 of / 10 Caption Close Image 1 of 10 In this Friday, Oct. 13, 2017 photo, a resident tries to connect electrical lines downed by Hurricane Maria in preparation for when electricity is restored in Toa Baja, Puerto Rico. A month after the storm rolled across the center of Puerto Rico, power is still out for the vast majority. less In this Friday, Oct. 13, 2017 photo, a resident tries to connect electrical lines downed by Hurricane Maria in preparation for when electricity is restored in Toa Baja, Puerto Rico. A month after the storm...more Photo: Ramon Espinosa, AP Image 2 of 10 In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers stand on towers to restore lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said Whitefish was making progress on the line that carries about 230,000 volts to San Juan from the Aguirre power plant in the south, which will vastly increase the amount of power reaching the capital. less In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers stand on towers to restore lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said Whitefish was...more Photo: Ramon Espinosa, AP Image 3 of 10 In this Thursday, Oct. 19, 2017 photo, Ezequiel Rivera works with the Electric Energy Authority to restore distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The office of Gov. <mark>Ricardo</mark> Rossello said Thursday, Oct. 19 that about 20 percent of the island has service and he has pledged to get that to 95 percent by Dec. 31. less In this Thursday, Oct. 19, 2017 photo, Ezequiel Rivera works with the Electric Energy Authority to restore distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The...more Photo: Carlos Giusti, AP Image 4 of 10 In this Sunday, Oct. 15, 2017 photo, a helicopter from Whitefish Energy Holdings flies to power line towers for repairs after the passing of Hurricane Maria in Barceloneta, Puerto Rico. The storm's path was ideal for taking down the entire grid. less In this Sunday, Oct. 15, 2017 photo, a helicopter from Whitefish Energy Holdings flies to power line towers for repairs after the passing of Hurricane Maria in Barceloneta, Puerto Rico. The storm's path was...more Photo: Ramon Espinosa, AP Image 5 of 10 In this Thursday, Oct. 19, 2017 photo, a brigade from the Electric Power Authority repairs distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The storm struck after the Authority had filed for bankruptcy in July, put off maintenance and had finished dealing with outages from Hurricane Irma. less In this Thursday, Oct. 19, 2017 photo, a brigade from the Electric Power Authority repairs distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. The storm struck after...more Photo: Carlos Giusti, AP Image 6 of 10 In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers restore power lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said previous work restoring transmission lines damaged by wildfires in the western U.S. has prepared them for the Puerto Rico contract. less In this Sunday, Oct. 15, 2017 photo, Whitefish Energy Holdings workers restore power lines damaged by Hurricane Maria in Barceloneta, Puerto Rico. Whitefish CEO Andy Techmanski said previous work restoring...more Photo: Ramon Espinosa, AP Image 7 of 10 In this Thursday, Oct. 19, 2017 photo, a resident walks by Electric Power Authority worker Ezequiel Rivera restoring distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto Rico. Without air-conditioning, many residents have resorted to using washboards to clean clothes and sleeping on their balconies for relief from daytime temperatures above 90 degrees. less In this Thursday, Oct. 19, 2017 photo, a resident walks by Electric Power Authority worker Ezequiel Rivera restoring distribution lines damaged by Hurricane Maria in the Cantera community of San Juan, Puerto...more Photo: Carlos Giusti, AP Image 8 of 10 In this Monday, Oct. 16, 2017 photo, power lines lay broken after the passage of Hurricane Maria in Dorado, Puerto Rico. A month after the storm rolled across the center of the island, power is still out for the vast majority of people as the work to restore hundreds of miles of transmission and distribution lines grinds on. less In this Monday, Oct. 16, 2017 photo, power lines lay broken after the passage of Hurricane Maria in Dorado, Puerto Rico. A month after the storm rolled across the center of the island, power is still out for...more Photo: Ramon Espinosa, AP Image 9 of 10 In this Sunday, Oct. 15, 2017 photo, power lines stand at an angle surrounded by vegetation that was torn down by Hurricane Maria in Barceloneta, Puerto Rico. Hurricane Maria's onslaught was sufficient to knock down hundreds of transmission towers and thousands of distribution poles and lines. less In this Sunday, Oct. 15, 2017 photo, power lines stand at an angle surrounded by vegetation that was torn down by Hurricane Maria in Barceloneta, Puerto Rico. Hurricane Maria's onslaught was sufficient to knock...more Photo: Ramon Espinosa, AP Image 10 of 10 What Puerto Rico is doing to get the power back after storm 1 / 10 Back to Gallery BARCELONETA, Puerto Rico (AP)--Electrical linemen descend from helicopters, balancing on steel girders 90 feet high on transmission towers in the mountains of central Puerto Rico, far from any road. At the same time, crews fan out across the battered island, erecting light poles and power lines in a block by block slog. A month after Hurricane Maria rolled across the center of Puerto Rico, the power is still out for the vast majority of people on the island as the work to restore hundreds of miles of transmission lines and thousands of miles of distribution lines grinds on for crews toiling under a blazing tropical sun. And it won't get done soon without more workers, more equipment and more money, according to everyone involved in the effort. \"It's too much for us alone,\" Nelson Velez, a regional director for the Puerto Rican power authority, said as he supervised crews working along a busy street in Isla Verde, just east of San Juan, on a recent afternoon. \"We have just so many, so many areas affected .\" The office of Gov. <mark>Ricardo</mark> Rossello said Thursday that about 20 percent of the island has service and he has pledged to get that to 95 percent by Dec. 31. For now, though, most of the island's 3.4 million people suffer without air conditioning or basic necessities. Many have resorted to using washboards, now frequently seen for sale along the side of the road, to clean clothes, and sleeping on their balconies and flocking to any open restaurants for relief from daytime temperatures above 90 degrees. \"I thought we would we have power in the metro area by now,\" said <mark>Pablo Martinez</mark>, an air conditioning technician, shaking his head in frustration. Hurricane Maria, which caused at least 48 deaths on the island, made landfall on the southeastern coast near Yabucoa as a Category 4 storm, with maximum sustained winds of about 154 mph (248 kph). It passed out of the territory about 12 hours later near Barceloneta in the north, still with sustained winds of about 115 mph (185 kph). The onslaught was sufficient to knock down hundreds of transmission towers and thousands of distribution poles and lines. The storm's path was ideal for taking down the entire grid. Most of Puerto Rico's generating capacity is along the southern coast and most consumption is in the north around San Juan, with steel and aluminum transmission towers up to 90 feet (27 meters) tall running through the mountains in the middle. At least 10 towers fell along the most important transmission line that runs to the capital, entangling it with a secondary one that runs parallel and that lost about two dozen towers in a hard-to-reach area in the center of the island. \"It reminds me of a fireball that just burned everything in its path,\" said Brig. Gen. Diana Holland, commander of the Army Corps of Engineers unit working to clear debris and restore the grid, with nearly 400 troops on the ground. The storm also struck at a terrible time. The Puerto Rico Electric Power Authority filed for bankruptcy in July. It has put off badly needed maintenance and had just finished dealing with outages from Hurricane Irma in early September. \"You stop doing your typical deferred maintenance, and so you become even that much more susceptible to a storm like Maria and Irma coming and blowing down your towers, water coming up in your substations and flooding them,\" said <mark>Tom Lewis</mark>, president of the Louis Berger Group, which has been supplying generators in Puerto Rico to clients that include the Federal Emergency Management Agency. \"Everything becomes that much more sensitive to any kind of damage whether it be from wind or water .\" PREPA Director <mark>Ricardo Ramos</mark> said the authority is working with the Army Corps of Engineers and contractors to bring in more \"bucket trucks\" and other equipment. It already has about 400 three - to five-member repair crews and is trying to reach 1,000 within three weeks with workers brought in from the U.S. \"With this number of brigades we will be able to advance much more rapidly,\" <mark>Ramos</mark> assured reporters during a recent news conference. PREPA brought in a Montana company, Whitefish Energy Holdings, to help its crews restore the transmission and distribution lines across the island. It has a rolling contract and can bill up to $300 million for its work, said Odalys <mark>de Jesus</mark>, a spokeswoman for the power authority. It is a huge job for a young company, formed in 2015. Whitefish CEO Andy Techmanski said previous work restoring transmission lines damaged by wildfires in the western U.S. has prepared them for the Puerto Rico contract. \"We don't like easy,\" he said during a break at one of the company's base camps near Barceloneta. The camp buzzes with activity as helicopters come and go, taking linemen and equipment to the mountain towers, the pilots deftly navigating the lines and mountains to lower men and equipment to the steel-and-aluminum girds high above the trees. Whitefish had about 270 employees in Puerto Rico as of midweek, working both on transmission and distribution. It expects the number to double in the coming weeks if it can find sufficient lodging and transport to the island. Other contractors working in Puerto Rico include Fluor Corp., which was awarded a $336.2 million contract from the Army Corps of Engineers for debris removal and power restoration, and Weston Solutions, which is providing two generators to stabilize power in the capital for $35 million. Their efforts are to restore the system that was in place before the storm, not to build a better one, at least not yet. Gov. Rossello says the island needs to overhaul its power grid, make it less vulnerable and look at alternative sources. He welcomed a proposal by Elon Musk, CEO of electric-car company Tesla, to expand solar energy and has raised the issue of longer-term improvements with Washington. House Speaker <mark>Paul Ryan</mark> seemed to express at least a willingness to consider helping Puerto Rico build back better when he visited the island this month. \"If you going to put up a power line let's put up a power line that can withstand hurricane-force winds,\" he said. \"It makes no sense to put temporary patches on problems that have long term effects .\" Techmanski said Whitefish was making progress on the line that carries about 230,000 volts to San Juan from the Aguirre power plant in the south, which will vastly increase the amount of power reaching the capital. \"We're getting it done,\" he said. But, asked about the goal of getting 95 percent of power back by the end of the year, he wasn't sure: \"It is very optimistic at this point .\" ___ Associated Press writer Danica Coto contributed to this report. Stay Connected Top Jobs Latest News & Sports Video Latest Stories Former GOP chair to run for county judge Diamondback CEO joins list of industry leaders supporting road...JumBurrito offers free burrito for those who vote Appeals court grants Young stay of execution Democratic lt. gov. candidate says school finance relief is...Leach about road bond: \"I am for it' Concho's Leach in center of action at A & M Road bond campaign raises more than $61,000 during first period Most Popular 1 UPDATE: Emerson Elementary lockdown lifted 2 Massive North Texas ranch goes up for sale 3 MISD spokeswoman: Emerson student recants story about weapon 4 Appeals court grants Young stay of execution 5 Halloween and Fall Celebrations 6 More than 80 children saved and 120 traffickers arrested by...7 JumBurrito offers free burrito for those who vote View Comments © 2017 Hearst Communications, Inc. .", "articleID": "2017102004_00200519_W", "names": {"Ricardo Ramos": ["Q26611940", "Q44070424", "Q7322783"], "Tom Lewis": ["Q15502240", "Q21061958", "Q2352807", "Q24578293", "Q3525352", "Q55999179", "Q7816580", "Q7816581"]}}, {"date": "2017-10-20", "url": "https://theislandnow.com/community-news/assemblyman-durso-presented-citations-kiwanis-honorees/#respond", "content": "Community News Manhasset Port Washington Share on Facebook Tweet on Twitter From left, Kathy Levinson, Assemblyman Anthony D’Urso and <mark>Jeff Stone</mark>. Assemblyman Anthony D’Urso recently attended a dinner held by the Kiwanis International of Manhasset and Port Washington where he presented citations to the honorees Lt. Governor Kathy Levinson and President <mark>Jeff Stone</mark>. The dinner was held in Manhasset at the Strathmore-Vanderbilt Country Club. \"There are thousands of Kiwanis Club volunteers all around the world who give their time to raise funds to help children and others everywhere. We are fortunate that two of their most dedicated volunteers--Kathy Levinson and <mark>Jeff Stone</mark>--live in our community,\" said Assemblyman D’Urso.", "articleID": "2017102014_00870247_W", "names": {"Jeff Stone": ["Q1686356", "Q19662662", "Q6175083", "Q6175085"]}}, {"date": "2017-10-21", "url": "http://registerguard.com/rg/sports/preps/36070696-79/head-goes-right-hereyy-hereyyyyy.html.csp#civil-comments", "content": "MONROE--There was nothing fancy about this performance. It was just good, old-fashioned, smashmouth football. Monroe dispatched Oakland 35-14 on Friday night behind a no-frills offensive game plan that churned out 263 rushing yards and battered the visiting Oakers into submission. In the process, the third-ranked Dragons locked up the Mountain View Conference title and potentially a high seed for the Class 2A state playoffs that begin in two weeks. \"I'm very pleased,\" said Monroe coach Bill Crowson, whose team wraps up the regular season next week with a nonleague game against Stanfield. \"I feel like Lost River and Oakland are both quality football teams. Their records may not be great, but they're going to both maybe be playoff teams and I feel like...the four wins over them is a good statement for us .\" Monroe (6-1, 4-0 MVC) made a different kind of statement Friday, dialing up some old-school playcalling that involved a lot of fullback dives and tailback counters. The result was nearly 5.5 yards per carry as a team and a healthy time of possession advantage that eventually wore out visiting Oakland (4-3, 0-3). The Dragons were led by sophomore running back Zach Young, who had 142 yards on 18 carries and scored two touchdowns--the first a 12-yard run late in the second quarter that gave Monroe a 20-7 halftime lead, and the second an 18-yard backbreaker with four minutes left that iced the game after Oakland had briefly sliced the margin to 27-14. Junior fullback Colton Sutton rushed for 42 yards and a pair of touchdowns, senior Parker Wynn had 34 yards and a score, and fellow senior Zack Esplin finished with 37 yards on the ground. Quarterback Kairen Garber attempted only eight passes, completing three of them for 39 yards. \"We're a little dinged up,\" Crowson explained. \"Nothing bad, but our personnel is a little different, so we knew all week that we were going to go back to fullbacks and just kind of grind a little bit. We haven't really done that this year, so it was something that we needed to work on and something we needed to do tonight .\" Monroe boasts one of the biggest offensive lines in the state at the 2A level, featuring 6-foot-4, 320-pound <mark>Cristian Garcia</mark> and 6-1, 280-pound Jorge Sanchez, among others. Going to a ground-and-pound strategy, Crowson said, was one way of maximizing the Dragons' size advantage against an active defensive front. \"They attack really well,\" Crowson said of Oakland's front four. \"They put a lot of pressure on you up front. I think that was a good challenge for our linemen .\" We were a little cute in the first half, but we needed to just settle in. We felt like we could run the football, we just weren't being real consistent. We made some adjustments and tried to get some schemes right, and I felt like we were more consistent (in the second half). \"Oakland was led by senior Andrew Harrington, who started the game at running back, then moved to quarterback after the first offensive series ended in a three-and-out. Harrington completed 9-of-24 pass attempts for 106 yards with two interceptions and ran for 36 yards and both of the Oakers' touchdowns. More Prep Football articles\" ", "articleID": "2017102106_00051087_W", "names": {"Cristian Garcia": ["Q5186193", "Q5186194"]}}, {"date": "2017-10-23", "url": "http://thestir.cafemom.com/tv/208108/jenelle_evans_teen_mom_reunion?utm_medium=sm&utm_source=rss&utm_content=tv_rssfeed", "content": "Nate Beckett/Splash News Uh-oh, is the old Jenelle back? On Saturday, the girls of Teen Mom 2 taped their reunion, and according to numerous sources, both Jenelle <mark>Evans</mark> and David Eason behaved in a downright shocking way. The day after the taping, Jenelle posted a live Instagram video in an attempt to tell her side of the story. \"I came here to do a live video...because of the s ** t that happened last night,\" she started off. And from the sounds of things, the mom of three has a lot of explaining to do. Advertisement \"If you haven't heard, last night there was an article that, of course, comes out after I left, [saying] that they had to shut down production and Jenelle and David were acting crazy,\" Jenelle said, referring to a report on The Ashley that claimed a huge fight erupted backstage and David even wound up pulling a knife out at party for the cast. According to Jenelle, David, technically-speaking, did have a knife, but he only used it to, um, pop some balloons after he was frustrated that he was being denied a beer. But apparently, that wasn't the big issue on Saturday. Evidently, Jenelle was upset after seeing her ex Nathan Griffith's new girlfriend, Ashley Lanhart, hug her mother, <mark>Barbara Evans</mark>. OK, fine, not cool. But here's where things get a little strange. Jenelle said that she was always under the impression that Ashley wanted nothing to do with Teen Mom, so she was surprised to see her being filmed backstage. When she asked why Nathan's girlfriend was being filmed, Jenelle said that Ashley started to \"cuss her out\" to the point where she had to be pinned against a wall and asked to leave.", "articleID": "2017102315_00561693_W", "names": {"Barbara Evans": ["Q21459365", "Q26197283", "Q27450107", "Q56867893"]}}, {"date": "2017-10-24", "url": "https://geektyrant.com/news/full-trailer-for-netflixs-stretch-armstrong-and-the-flex-fighters-animated-series", "content": "Full Trailer For Netflix's STRETCH ARMSTRONG AND THE FLEX FIGHTERS Animated Series Trailer TV Stretch Armstrong and the Flex Fighters Netflix about 35 minutes ago by Joey Paur Netflix has released a full trailer for their upcoming animated series Stretch Armstrong and The Flex Fighters. The series was inspired by the classic late 70's - early 80's action figure that kids could stretch. The series has a very different kind of tone and vibe as the original toy, but it looks like a fun series that the kids will enjoy. The story follows a high school student named Jake Armstrong and his two best friends Nathan Park and <mark>Ricardo Perez</mark> and they are accidentally exposed to an experimental chemical that forever changes their lives. They are transformed into unlikely heroes who embark on a series of adventures. <mark>Stephen Davis</mark>, Chief Content Officer and Executive Vice President, Hasbro Inc. previously had this to say in a statement: \"Stretch Armstrong and the Flex Fighters is the first Hasbro brand to receive a Netflix original series order. We have been waiting for just the right moment to re-imagine Stretch for a new audience and our friends at Netflix got it right away; they have been a tremendous partner. We have hit a superhero sweet spot, and with Netflix's global reach, kids across the world will fall in love with its fun characters and action-packed storyline .\" Stretch Armstrong and the Flex Fighters will feature some great voice talent that includes Scott Menville (Teen Titans Go!, Teenage Mutant Ninja Turtles) as Jake Armstrong/Stretch, Steven Yeun (The Walking Dead, Okja) as Nathan Park/Wingspan, Ogie Banks (Ultimate Spider-Man) as <mark>Ricardo Perez</mark> / Omni-Mass, Wil Wheaton (Teen Titans Go!, Star Trek: The Next Generation) as Rook, Felicia Day (The Guild, Supernatural) as Erika, Keith David (Adventure Time, Rick and Morty) as Kane, Kate Mulgrew (Orange Is the New Black, Star Trek: Voyager) asDr. C, and <mark>Walter Koenig</mark> (Star Trek, Babylon 5) as Mr. Savic. The series will consist of 26 episodes and will debut in late 2017. Facebook Twitter Pinterest Reddit Joey Paur--Co-Founder / Editor of GeekTyrant.com, and if you haven't noticed I write...a lot. Movies are my passion and I live and breathe all things geek. This site is part of my life's work, it's a part of me. I love what I do, and I enjoy sharing everything I can with you when it comes to movies and geekery. In my spare time I travel to the netherworlds to battle demons. @ JoeyPaur | joeypaur @ geektyrant.com Featured Posts on GeekTyrant Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Review: THOR: RAGNAROK is an Insanely Funny and Wild Adventure! Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Brutally Intense New Trailer For THE PUNISHER and The Release Date is Set For November! Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment The HAN SOLO Film Has Wrapped Production and Finally Has an Official Title SOLO: A STAR WARS STORY Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Marvel Unleashes an Awesome New BLACK PANTHER Trailer! Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Watch The Incredible and Haunting New STRANGER THINGS Season 2 Trailer Now! Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Creepy Cool First Trailer For The X-Men Horror Movie THE NEW MUTANTS Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Back to GT Homepage", "articleID": "2017102421_00640749_W", "names": {"Ricardo Perez": ["Q1334974", "Q28976377", "Q30122668", "Q5485794"], "Ron Howard": ["Q103646", "Q19874445", "Q3940969", "Q4883"], "Stephen Davis": ["Q3498537", "Q7609026", "Q7609027"], "Walter Koenig": ["Q376176", "Q42832997"]}}, {"date": "2017-10-25", "url": "http://dailyitem.com/news/local_news/state-prison-for-gregg-township-meth-lab-suspect/article_6c9ec59f-beca-50c6-91d3-a2bc206dcf23.html", "content": "State prison for Gregg Township meth lab suspect LEWISBURG--A Selinsgrove man avoided trial in three separate cases and was handed a state prison sentence by a Union County judge. More Headlines DANVILLE--The 22nd Annual Danville Area Community Center 5K Race and Community Walk will be held Nov. 4. More Headlines My Turn: The right question on gun safety In an interview with experts on gun safety, a news show host recently posed the question \"What law could have prevented the event at Las Vegas?\" I have often heard the same question, stated over and over in pretty much the same fashion by representatives of the NRA and its supporters in Congress. More Headlines State prison for Gregg Township meth lab suspect The Daily Item 29 min ago LEWISBURG--A Selinsgrove man avoided trial in three separate cases and was handed a state prison sentence by a Union County judge. According to District Attorney <mark>Pete Johnson</mark>, Chris Biddinger, 29, entered a guilty plea to operating a methamphetamine laboratory along with simple assault and possession of drug paraphernalia. His plea scuttled jury selection proceedings scheduled to have been held Monday. Judge Michael Sholley sentenced Biddinger to serve one to three years on the methamphetamine charge and serve consecutive one-year probation sentences upon release on the other two charges, <mark>Johnson</mark> said. Remaining criminal counts in the three separate cases were dismissed, <mark>Johnson</mark> said. Biddinger was among several defendants accused of manufacturing methamphetamine in a \"one-pot\" method of cooking on two separate occasions in Gregg Township in the summer of 2016. He was charged with a combined 30 counts. Biddinger also was charged with assault by prisoner and related counts for his role in allegedly injuring a fellow inmate inside the Union County jail in March. He was one of two charged in the alleged assault .--ERIC SCICCHITANO Police: Driver had marijuana DANVILLE--A Macombe, Mich., woman faces drug charges after being stopped by state police for traveling in the left lane of Interstate 80 and not passing or attempting to pass a vehicle Oct. 3. Tpr. Jared Mowen charged Alexandra M. Skiba, 20, with possessing a small amount of marijuana, possessing drug paraphernalia and restrictions on the use of limited access highways. Mowen detected a strong odor of marijuana coming from the vehicle and asked where the marijuana was. Skiba indicated she had it in one of her bags in the trunk, according to police. Police seized a white jar with about 20 grams of marijuana inside along with a gold grinder in Skiba's luggage in the trunk .--KAREN BLACKLEDGE Veterans breakfast Nov. 8 ELYSBURG--Veterans in Pennsylvania's 107th District are invited to attend a Veterans Appreciation Breakfast on Nov. 8, at the Elysburg Fire Company's social hall, 1 E. Mill St., Elysburg. Hosted by Pa.. House Rep. Kurt Masser, R-107, Elysburg, and his staff, the breakfast is a show of appreciation for veterans who put their lives on the line for our country's freedom. \"These men and women deserve to be thanked and appreciated every day, and this is our way to say thank you for all they've done,\" Masser said. Pre-registration is required for this event. Call Masser's district office at 570-648-8017 by Nov. 3. Information can also be found online at RepMasser.com. Kreamer bridge to be complete Nov. 20 KREAMER--The year-long bridge reconstruction along Route 522 in Kreamer is scheduled to be completed next month. <mark>David Thompson</mark>, community relations coordinator, PennDOT District 3-0, said construction on the Route 522 bridge in Kreamer, Middle Creek Township, Snyder County, is to be completed on Nov. 20, according to the project manager. The bridge work began in November 2016. Final paving will take place in spring 2018. The new bridge, according to <mark>Thompson</mark>, will be 12 feet wider than the existing bridge with a 12-foot driving lanes and 8-foot shoulders in each direction .--TABITHA GOODLING Continuance granted in identity theft case SELINSGROVE--A preliminary hearing has been continued for a Selinsgrove businessman accused of using his employee's identity without permission to obtain several credit cards and make more than $40,000 purchases. Nathan T. Fisher, 26, co-owner of Vivace Music Center was granted a continuance Tuesday by District Judge Lori R. Hackenberg, who is setting aside two hours for an upcoming hearing yet to be scheduled. Fisher is being held in Lancaster County jail on a detainer for violating conditions of probation. He was sentenced to five years of probation in 2013 for convictions on identity theft, theft by deception and bad checks and has convictions for similar crimes in other counties, including Union and Dauphin. In the latest case in Snyder County, he allegedly obtained credit cards with the identity of an employee that he used to make $40,447 in fraudulent purchases .--MARCIA MOORE Shamokin man hurt in motorcycle crash SHAMOKIN--A 28-year-old Shamokin man was injured Tuesday and had to be taken to Geisinger Medical Center, in Danville, after the motorcycle he was riding on Market Street was hit by a vehicle at the intersection of Market and Chestnut Street. Allen Cole was riding a 2011 Harley Davidson motorcycle north on Market Street when, at about 5:15 p.m., a 2003 Chevrolet Trailblazer driven by a 17-year-old male pulled into the path of the motorcycle, according to Shamokin Police Chief Darwin Tobias. Cole, who was wearing a helmet, was thrown from the cycle. The cycle also flew off the road and into a building at 1 Market Street causing property damage, Tobias said. A hospital nursing supervisor said Cole was listed in serious condition Tuesday night. Police are investigating the accident .--Rick Dandes Halloween celebrations Oct. 31 SUNBURY--Oct. 31 will be a busy night in the city as Halloween parties are shaping up to be a treat for all. Starting at 5 p.m. and running until 9 p.m. Cameron Park will play host to \"Light the Night,\" an event presented by the River of Life Assembly of God. The Halloween party will include food, games and bounce houses for children. Also, at Degenstein Community Library, there will be a \"Boo Bash\" event for children trick or treating. There will be vendors giving away candy. The event starts at 6 p.m. and ends at 9 p.m. Oct. 31 is also Sunbury's annual trick-or-treating night and there will be several police officers and firefighters spread out through the city to ensure safety for children out trick-or-treating.", "articleID": "2017102502_00481548_W", "names": {"David Thompson": ["Q1176843", "Q14950372", "Q15378706", "Q16499854", "Q16830995", "Q18924157", "Q20710001", "Q28434580", "Q310082", "Q5236246", "Q5240375", "Q5240378", "Q5240379", "Q5240380", "Q5240381", "Q5240382", "Q5240383", "Q56192238", "Q58065993", "Q718669"]}}]