[{"date": "2017-10-25", "url": "http://dailyitem.com/news/local_news/state-prison-for-gregg-township-meth-lab-suspect/article_6c9ec59f-beca-50c6-91d3-a2bc206dcf23.html", "content": "State prison for Gregg Township meth lab suspect LEWISBURG--A Selinsgrove man avoided trial in three separate cases and was handed a state prison sentence by a Union County judge. More Headlines DANVILLE--The 22nd Annual Danville Area Community Center 5K Race and Community Walk will be held Nov. 4. More Headlines My Turn: The right question on gun safety In an interview with experts on gun safety, a news show host recently posed the question \"What law could have prevented the event at Las Vegas?\" I have often heard the same question, stated over and over in pretty much the same fashion by representatives of the NRA and its supporters in Congress. More Headlines State prison for Gregg Township meth lab suspect The Daily Item 29 min ago LEWISBURG--A Selinsgrove man avoided trial in three separate cases and was handed a state prison sentence by a Union County judge. According to District Attorney <mark>Pete Johnson</mark>, Chris Biddinger, 29, entered a guilty plea to operating a methamphetamine laboratory along with simple assault and possession of drug paraphernalia. His plea scuttled jury selection proceedings scheduled to have been held Monday. Judge Michael Sholley sentenced Biddinger to serve one to three years on the methamphetamine charge and serve consecutive one-year probation sentences upon release on the other two charges, <mark>Johnson</mark> said. Remaining criminal counts in the three separate cases were dismissed, <mark>Johnson</mark> said. Biddinger was among several defendants accused of manufacturing methamphetamine in a \"one-pot\" method of cooking on two separate occasions in Gregg Township in the summer of 2016. He was charged with a combined 30 counts. Biddinger also was charged with assault by prisoner and related counts for his role in allegedly injuring a fellow inmate inside the Union County jail in March. He was one of two charged in the alleged assault .--ERIC SCICCHITANO Police: Driver had marijuana DANVILLE--A Macombe, Mich., woman faces drug charges after being stopped by state police for traveling in the left lane of Interstate 80 and not passing or attempting to pass a vehicle Oct. 3. Tpr. Jared Mowen charged Alexandra M. Skiba, 20, with possessing a small amount of marijuana, possessing drug paraphernalia and restrictions on the use of limited access highways. Mowen detected a strong odor of marijuana coming from the vehicle and asked where the marijuana was. Skiba indicated she had it in one of her bags in the trunk, according to police. Police seized a white jar with about 20 grams of marijuana inside along with a gold grinder in Skiba's luggage in the trunk .--KAREN BLACKLEDGE Veterans breakfast Nov. 8 ELYSBURG--Veterans in Pennsylvania's 107th District are invited to attend a Veterans Appreciation Breakfast on Nov. 8, at the Elysburg Fire Company's social hall, 1 E. Mill St., Elysburg. Hosted by Pa.. House Rep. Kurt Masser, R-107, Elysburg, and his staff, the breakfast is a show of appreciation for veterans who put their lives on the line for our country's freedom. \"These men and women deserve to be thanked and appreciated every day, and this is our way to say thank you for all they've done,\" Masser said. Pre-registration is required for this event. Call Masser's district office at 570-648-8017 by Nov. 3. Information can also be found online at RepMasser.com. Kreamer bridge to be complete Nov. 20 KREAMER--The year-long bridge reconstruction along Route 522 in Kreamer is scheduled to be completed next month. <mark>David Thompson</mark>, community relations coordinator, PennDOT District 3-0, said construction on the Route 522 bridge in Kreamer, Middle Creek Township, Snyder County, is to be completed on Nov. 20, according to the project manager. The bridge work began in November 2016. Final paving will take place in spring 2018. The new bridge, according to <mark>Thompson</mark>, will be 12 feet wider than the existing bridge with a 12-foot driving lanes and 8-foot shoulders in each direction .--TABITHA GOODLING Continuance granted in identity theft case SELINSGROVE--A preliminary hearing has been continued for a Selinsgrove businessman accused of using his employee's identity without permission to obtain several credit cards and make more than $40,000 purchases. Nathan T. Fisher, 26, co-owner of Vivace Music Center was granted a continuance Tuesday by District Judge Lori R. Hackenberg, who is setting aside two hours for an upcoming hearing yet to be scheduled. Fisher is being held in Lancaster County jail on a detainer for violating conditions of probation. He was sentenced to five years of probation in 2013 for convictions on identity theft, theft by deception and bad checks and has convictions for similar crimes in other counties, including Union and Dauphin. In the latest case in Snyder County, he allegedly obtained credit cards with the identity of an employee that he used to make $40,447 in fraudulent purchases .--MARCIA MOORE Shamokin man hurt in motorcycle crash SHAMOKIN--A 28-year-old Shamokin man was injured Tuesday and had to be taken to Geisinger Medical Center, in Danville, after the motorcycle he was riding on Market Street was hit by a vehicle at the intersection of Market and Chestnut Street. Allen Cole was riding a 2011 Harley Davidson motorcycle north on Market Street when, at about 5:15 p.m., a 2003 Chevrolet Trailblazer driven by a 17-year-old male pulled into the path of the motorcycle, according to Shamokin Police Chief Darwin Tobias. Cole, who was wearing a helmet, was thrown from the cycle. The cycle also flew off the road and into a building at 1 Market Street causing property damage, Tobias said. A hospital nursing supervisor said Cole was listed in serious condition Tuesday night. Police are investigating the accident .--Rick Dandes Halloween celebrations Oct. 31 SUNBURY--Oct. 31 will be a busy night in the city as Halloween parties are shaping up to be a treat for all. Starting at 5 p.m. and running until 9 p.m. Cameron Park will play host to \"Light the Night,\" an event presented by the River of Life Assembly of God. The Halloween party will include food, games and bounce houses for children. Also, at Degenstein Community Library, there will be a \"Boo Bash\" event for children trick or treating. There will be vendors giving away candy. The event starts at 6 p.m. and ends at 9 p.m. Oct. 31 is also Sunbury's annual trick-or-treating night and there will be several police officers and firefighters spread out through the city to ensure safety for children out trick-or-treating.", "articleID": "2017102502_00481548_W", "names": {"Pete Johnson": ["Q16730368", "Q18627300", "Q7172045", "Q7172046", "Q7172047"]}}, {"date": "2017-10-26", "url": "https://www.inquisitr.com/opinion/4579003/chicago-bears-trade-for-los-angeles-chargers-dontrelle-inman-can-he-save-their-passing-game/", "content": "Former Los Angles Chargers' wide receiver Dontrelle Inman will give Chicago Bears' quarterback Mitch Trubisky a veteran wide receiver to help in the passing game. The Bears hope that Inman and Trubisky can give opposing defenses some concerns outside of the running game. According to ESPN's Adam Schefter, the Chicago Bears acquired Dontrelle Inman from the Los Angeles Chargers on Wednesday. The Bears agreed to send a conditional draft pick to the Chargers. That pick will likely be a seventh-round selection in the 2018 NFL draft. Dontrelle Inman, a 28-year-old veteran immediately becomes the Bears most established wide receiver on the roster. At 6-foot-3, he has the size to win jump ball passes. Inman became expendable for the Chargers, who have Pro Bowler Keenan Allen, Tyrell Williams, and a healthy <mark>Mike Williams</mark>. The L.A. Chargers want to take a long look at rookie <mark>Mike Williams</mark>. The former Clemson star was taken No. 7 by the Chargers in last April's NFL draft. <mark>Williams</mark>' presence left Dontrelle Inman inactive in Week 7. It left open the possibility of him landing at with a new team. Chargers' head coach Anthony Lynn explained why they decided to deal Inman. \"He got hurt and never really got a good chance to see him, and some other guys stepped ahead of him. We just wanted to get him someplace where he can be happy and play football .\" Despite being buried as the fourth or fifth receiver on the L.A. Chargers' depth chart, when healthy, Dontrelle Inman has the potential to be a lead pass-catcher. Dontrelle Inman gives the Chicago Bears a wide receiver with the ability to go up and get the football. [Image by Streeter Lecka/Getty Images] The addition of Dontrelle Inman is a timely one for the Chicago Bears. Just days after the Bears only completed four passes in their 17-3 win over the Carolina Panthers, they add Dontrelle Inman in the trade with the Chargers. Versus the Panthers, Mitch Trubisky only attempted seven throws. None of those passes went to Bears' receivers, despite Trubisky dealing with nine defenders at the line of scrimmage. With opposing teams looking to stop the Bears from running the football, the Bears had a need for a vertical threat. The receivers the Bears had on the roster have had their struggles separating from defenders. The presence of Dontrelle Inman could change things a bit. Inman hauled in 58 catches last season for the Chargers. He tallied up 810 yards and four touchdowns. This year Inman was seldom used, only catching two passes, while sitting behind Keenan Allen and Tyrell Williams. With the Bears, that is expected to change. Season ending injuries to Cameron Meredith and <mark>Kevin White</mark> forced the Bears to alter their depth chart. That left the Bears to rely on Kendall Wright, Tre McBride, and Tanner Gentry, among others. The addition of Dontrelle Inman will allow the incumbent receivers to be slotted in the positions they are best suited for. The timing of the Bears' acquisition of Inman is ideal. With Mitch Trubisky under center, the Bears have already scaled back their offensive playbook. Trubisky having a learning curve helps matters in a sense. If Inman makes his Bears' debut this week versus the New Orleans Saints, all the coaching staff has to do is implement a few routes to help him get acclimated early. The Bears have a bye week in Week 9. That gives Trubisky and Inman two weeks to get acquainted before the second half of the season starts. The #Bears added to their WR corps via a trade with the #Chargers: https: //t.co/ASHdSNwzHf--Pro Football Rumors (@ pfrumors) October 25, 2017 Few should expect Dontrelle Inman to make an immediate impact for the Bears in terms of the stat sheet. His true impact on the Bears may not be realized for weeks. Two weeks may be enough time for Inman and Trubisky to develop some chemistry going forward. The Bears' rookie quarterback knows that he has to develop rapport with his wide receivers (courtesy of AP News). \"It's all about rhythm, staying in a groove and really just continuing to evolve and find our identity and what works best for our offense to help out our defense .\" Dontrelle Inman's size and resume will dictate that be becomes the Chicago Bears' top receiver. Inman allows the Bears to play Kendall Wright as the slot receiver, with either Tanner Gentry or Tre McBride flanked on the other side. If a double-team is forced with regularity, it opens up the Bears' offense. Inman's presence alone could help the Chicago Bears going forward. It would be simply due to the fact that he is a big target for Mitch Trubisky to find down the field. Gaining separation will be paramount for Inman as he joins a Bears' team that struggles in that department. Mitch Trubisky establishing some continuity with Dontrelle Inman opens up the Chicago Bears' running game, as well as opportunities for Kendall Wright. If the Bears use the former L.A. Chargers' receiver properly, they could contend for the NFC North. The second half of the Bears' schedule is not as formidable as the first eight weeks. Not only does the Chicago Bears face the Cincinnati Bengals, who are struggling, they also have the Cleveland Browns and San Francisco 49ers to play. Both teams are currently winless. #Bears are eager to get newly-acquired receiver Dontrelle Inman up to speed, writes @ CEmma670: https: //t.co/bp4D0nsnqW pic.twitter.com/FVOTtOFpi7--670 The Score (@ 670TheScore) October 25, 2017 There is one primary reason for Bears' fans to have optimism for the pick up of Dontrelle Inman--free agency. Inman is a free agent at the end of the season. The Bears would benefit greatly from a motivated Inman, who can earn his return to the team next season with a strong showing. As for the Los Angeles Chargers, receiving a late draft pick from the Chicago Bears is better than not receiving any compensation for a solid receiver. The Chargers are deep at the position and could afford to trade Dontrelle Inman to the Bears. The trade currently stands as a win for both the Bears and the Chargers. It is also a win for Dontrelle Inman and Mitch Trubisky. Inman gets a fresh start with a Chicago Bears' team, which finds themselves quietly in a race for the NFC North. Trubisky gets a proven target to help the Bears win games. A hefty payday awaits the former Los Angeles Chargers' receiver if the he can help the Bears make things interesting in the second half of the season. [Featured Image by Donald Miralle/Getty Images]", "articleID": "2017102606_00276745_W", "names": {"Kevin White": ["Q16145878", "Q18159165", "Q20738243", "Q40158721", "Q6397748", "Q6397750"], "Mike Williams": ["Q11339601", "Q16873065", "Q18162727", "Q1843112", "Q18619126", "Q18627293", "Q19663901", "Q27449445", "Q30122685", "Q3313590", "Q3313595", "Q3857466", "Q3857468", "Q3857469", "Q55361153", "Q6831667", "Q6849276", "Q6849279", "Q6849281", "Q6849282", "Q6849283", "Q6849284", "Q6849285", "Q6849286", "Q6849287"]}}, {"date": "2017-10-26", "url": "http://www.marketwired.com/mw/release.do?id=2238519&sourceType=3", "content": "SOURCE: Strategic Environmental & Energy Resources, Inc.. October 26, 2017 08:31 ET Strategic Environmental & Energy Resources Partners with Biochar Now and Enters into Exclusive Service Contract and Water Remediation Market Wholly Owned Subsidiary Resource Environmental Group Services \"REGS' Receives Exclusive Manufacturing, Management and Remediation Services Contract & Exclusive Technology Licensing Rights to Water Remediation in the Mining Market Throughout U.S. GOLDEN, CO--(Marketwired - October 26, 2017) - Strategic Environmental & Energy Resources, Inc. (SEER) (OTCQB: SENR), a provider of environmental, renewable fuels and industrial waste stream management services, today announced that it has partnered with Biochar Now, (\"BCN\" ) a leading engineer and manufacturer of high-quality biochar. As a part of this new partnership, REGS, a wholly owned subsidiary of SEER, has received exclusive rights to perform all fabrication, manufacturing and environmental/remediation services required by BCN on all its water and soil clean up, reclamation or enhancement projects. In addition, REGS received an exclusive license under BCN's newly issued U.S. Patent Number 9,650,261 B2 (May 16, 2017) arising out of and related to water reclamation and clean up in and around the mining industry; a market REGS has serviced in the past. This license will be granted to a joint venture owned 90% by SEER and 10% by BCN. As part of the partnership, SEER made a $300,000 loan to BCN. The loan is in a super-priority position and paid back out of gross sale proceeds from BCN's currently operating Berthoud, Colorado production facility. For the loan, SEER has also received a small equity interest of approximately one percent of the privately held BCN. BCN, and its patented production technology, is emerging as one of the nation's premier producer of biochar. Biochar, considered as a more cost-effective alternative to activated carbon, is a solid material, obtained through thermochemical conversion of biomass (primarily wood) in a kiln. BCN has proprietary and patented procedures for this process resulting in a superior biochar product. The superiority of the BCN product has already been recognized by several states and many of the country's largest industrial and chemical companies that are currently developing programs and remediation plans to utilize the BCN product. All of these programs and remediation plans represent opportunities for REGS to provide services and support. The BCN product also has large potential for landfill soil remediation, a market that supplements MV's LFG gas capture technologies. Biochar has several applications within the reclamation market, from improving soil quality in agricultural, to removing various pollutants and unwanted components from water, such as phosphorous, mercury, arsenic and pesticides. REGS has already begun to work with leading water experts and service companies to expedite the deployment of this technology within the water treatment market. The addressable opportunity is significant, as the water recycling market is expected to grow 13.1% annually through 2021, to $22.3 B, according to BCC Research. As the number and scale of environmental cleanup projects around the world increase, the activated carbon global market, estimated to be $3 billion in 2015, is expected to exceed $10 billion by 2024 according to grandviewresearch.com. The superior quality biochar produced by Biochar Now is now being recognized by many industries and engineers as a more cost-effective and superior substitute for activated carbon in many applications. Given REGS' exclusive license and operational background in several Colorado mines, biochar is especially relevant for the mining industry, where it can sequester heavy metals and acids in the soil, preventing them from entering local water supplies. This more rapidly facilitates the return of vegetation, expediting the traditionally costly process of mine reclamation. In one study by the U.S. Forest Service, biochar performed better for re-vegetation than compost alone by 313%. \"This new partnership is part of SEER's ongoing effort to leverage REGS' 25 years of environmental service experience and diversify its business model into new mature and lucrative verticals,\" said <mark>John Combs</mark>, SEER's President and CEO. \"The addressable market for biochar is significant and growing rapidly. This fits perfectly into SEER's business portfolio objectives and presents an exciting and imminent revenue growth opportunity for SEER. We are particularly interested in the joint marketing opportunities between MV and BCN in the landfill market and have already begun discussions with a large landfill operator in Florida where MV has one of its largest LFG systems. In addition to this promising landfill opportunity, we have a potential pipeline of projects on the East Coast and in South Florida through our relationship with Biochar Now with some of the nation's largest industrial and chemical companies where REGS could provide service work and project management, in addition to manufacturing the kilns that would be required to fulfill increased product demand. We look forward to announcing these projects in the months to come,\" concluded <mark>Combs</mark>. \"We couldn't have found a better fit as service and support partners than SEER and its affiliated companies, especially REGS,\" said James Gaspard, BCN's CEO. \"REGS is right here in our backyard, they have used our biochar over the last year, they have impressive fabrication capabilities, and we are familiar with REGS' great reputation for service in the greater front-range area for over 20 years. In addition, SEER's other divisions, MV, SEM and Paragon, also bring expertise and experience in closely related areas such as gas conditioning, environmental materials production, pyrolysis, and solid waste destruction. All of these synergies make for multiple and potentially very lucrative opportunities for our companies as we can now offer services as part of our product offerings,\" continued Gaspard. \"As a real-world example of the possible synergies, in just a few weeks of joint marketing with SEER, Biochar Now has been able to identify and add millions of dollars to our product sales pipeline with companies that had already expressed interest in using our product after successful testing, but needed the full-service solution offered by REGS to implement our product in their processes,\" concluded Gaspard. About Resource Environmental Group Services (REGS) Resource Environmental Group Services (REGS) is a wholly owned subsidiary of Strategic Environmental & Energy Resources, Inc. (SEER). Founded in 1994, REGS provides industrial and environmental services to the petroleum industry, various industrial and manufacturing clients, medical facilities, universities, government entities, and environmental and consulting firms in the Western United States. REGS utilizes state-of-the-art equipment and technologies to provide the most efficient and environmentally safe services in the industry. As the developer of the first non-entry closed-loop cleaning process for stationary tanks, REGS can provide the lowest cost cleaning options for your tanks, as well as offer additional savings in down-time and waste reduction. REGS' experience and knowledge in dealing with a myriad of environmental regulations can ensure that its client companies' environmental programs are proactive and compliant. REGS offers its clients flexibility by providing turnkey project services or supplemental services on an as needed basis. For more information on REGS, please visit: www.regs-llc.com. About Strategic Environmental & Energy Resources, Inc.. Strategic Environmental & Energy Resources, Inc. (SEER) (OTCQB: SENR), identifies, secures, and commercializes patented and proprietary environmental clean technologies in several multibillion dollar sectors (including oil & gas, renewable fuels, and all types of waste management, both solid and gaseous) for the purpose of either destroying/minimizing hazardous waste streams more safely and at lower cost than any competitive alternative, and/or processing the waste for use as a renewable fuel for the benefit of the customers and the environment. SEER has three wholly-owned operating subsidiaries: REGS, LLC; MV Technologies, LLC and SEER Environmental Materials, LLC; and two majority-owned subsidiaries: Paragon Waste Solutions, LLC; and ReaCH4biogas (\"Reach\" ). For more information about the Company visit: www.seer-corp.com. Forward Looking Statements This press release contains \"forward-looking statements\" within the meaning of various provisions of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, commonly identified by such terms as \"believes,\" \"looking ahead,\" \"anticipates,\" \"estimates,\" and other terms with similar meaning. Although the company believes that the assumptions upon which its forward-looking statements are based are reasonable, it can give no assurance that these assumptions will prove to be correct. Such forward-looking statements should not be construed as fact. Statements in this press release regarding future performance or fiscal projections, the cost effectiveness, impact and ability of the Company's products to handle the future needs of customers are forward-looking statements. The information contained in such statements is beyond the ability of the Company to control, and in many cases the Company cannot predict what factors would cause results to differ materially from those indicated in such statements. All forward-looking statements in the press release are expressly qualified by these cautionary statements and by reference to the underlying assumptions. Contact Information", "articleID": "2017102613_00031672_W", "names": {"John Combs": ["Q22676769", "Q6226795"]}}, {"date": "2017-10-29", "url": "http://www.newindianexpress.com/sport/other/2017/oct/29/after-ramachandran-ioc-secretary-general-rajeev-mehta-calls-for-emergency-executive-council-meeting-1685958.html", "content": "Home Sport Other After Ramachandran, IOC secretary general Rajeev Mehta calls for emergency Executive Council meeting By Indraneel Das | Express News Service | Published: 29th October 2017 02:30 AM | Last Updated: 29th October 2017 09:48 AM | A + A A - | 0 Share Via Email Indian Olympic Association secretary general Rajeev Mehta. | File Photo The power game has begun. The bugle has been sounded and the rapiers are out. Allegations and verbal volleys are being lobbed. In the end, it's the image of the IOA that's getting sullied. But who bothers? The tussle between the president of the Indian Olympic Association N Ramachandran and secretary general Rajeev Mehta is out in the open. Days after the IOA president called for an Executive Council meeting on November 9, the secretary general sent out a letter calling for emergent EC meeting, but on November 7. The meet was called after 19 of 27 EC members met in New Delhi on Friday. It is learnt some of the present and past top sports administrators were present. The president is saying that according to IOA constitution only he has the right to call for a meeting, Mehta and Co believe that if the secretary has the mandate of the members, he too can call for the meeting. The two top officials of the IOA were not in agreement over the next Annual General Meeting (AGM) and the candidate for the president's post. There are 10 agendas listed for the meeting on November 7. The meeting will discuss \"regarding requisition notice already served to the president, IOA by approximately 70 per cent of the members\". One of them is to discuss the actions of \"the president, IOA which have brought down the image of IOA\". Mehta told Express that since 19 of the 27 members asked for the meeting on Nov 7, he couldn't have avoided to request. \"When so many members call for a meeting I can't stop it .\" He was also not happy that the president did not accede to the demand of 70 per cent members of the IOA who wanted a requisition meeting. A meeting of Ramachandran's supporters were held over dinner called by former IOA president Abhay Singh Chautala at Delhi Lawn Tennis Association (DLTA) on Thursday. It is learnt there were around seven to eight EC members were present. There are hectic parleys on for the posts of the treasurer of the body. It was in September (around 27/28) when, at a meeting in New Delhi between the president's rival faction, the idea of a requisition meeting was decided. The SGM, according to them, was necessitated because the term of the president and the current Office Bearers (OB) was over in March. And Ramachandran should have called for elections. The requisition for the SGM was however not considered by the IOA saying not enough members have signed the list. Interestingly, the list was handed over to the secretary who felt everything was in order for the president to call for an SGM. \"I felt the president should have called for the meeting,\" Mehta further added. Without SGM, Batra may not qualify as a presidential candidate. The IOA constitution (as it currently stands) doesn't allow a person who is not part of the executive board to contest the elections. The way things stand right now, the secretary seems to be enjoying the support of bigwigs like Narinder Batra, former IOA secretary generals Lalit Bhanot, <mark>Randhir Singh</mark>, vice-president RK Anand while the president has the support of former IOA president Chautala, former AITA president and treasurer Anil Khanna, senior vice president Virender Nanavati. Knowing IOA, the dynamics can change fast depending on whose favour the balance is tilted towards indraneel.das @ newindianexpress.com", "articleID": "2017102904_00251127_W", "names": {"Randhir Singh": ["Q48869008", "Q51096185", "Q7291681", "Q7291682"]}}, {"date": "2017-11-02", "url": "http://wbtw.com/ap/notre-dames-mike-elko-faces-bittersweet-reunion-with-deacs/", "content": "Notre Dame's Mike Elko faces bittersweet reunion with Deacs 6 mins ago SOUTH BEND, Ind. (AP)--Through enticement, advancement and the turbulence of coaching college football, Notre Dame first-year defensive coo...25 mins ago LOS ANGELES (AP)--Who's next? The Houston Astros won their first World Series crown in their 56th season since starting play as the Colt .4...36th Annual American Heart Association Beach Ride set for this weekend in Myrtle Beach November 1, 2017 The 36th annual American Heart Association Beach Ride is set to take place Wednesday, November 1st to Sunday, November 5th, 2017 at Lakewood...Breast cancer myths debunked by oncologist October 30, 2017 Breast cancer is the most common cancer in American women and the second leading cause of cancer deaths in women, according to the American...Ideas for using your outdoor space as weather turns cooler November 1, 2017 MYRTLE BEACH, SC (WBTW)--Randy Hann from Contract Exteriors joined News13 NOW at 9 a.m. to talk about ideas to make outdoor living space in...36th Annual American Heart Association Beach Ride set for this weekend in Myrtle Beach November 1, 2017 The 36th annual American Heart Association Beach Ride is set to take place Wednesday, November 1st to Sunday, November 5th, 2017 at Lakewood...Notre Dame's Mike Elko faces bittersweet reunion with Deacs TODD BURLAGE, The Associated Press Published: November 2, 2017, 3:16 am Click to share on Pinterest (Opens in new window) SOUTH BEND, Ind. (AP)--Through enticement, advancement and the turbulence of coaching college football, Notre Dame first-year defensive coordinator Mike Elko will find himself this weekend across the field facing a group of players he once recruited to a program he helped build. Elko spent the last three seasons as the defensive coordinator at Wake Forest, which visits the fifth-ranked Fighting Irish (No. 3 CFP) on Saturday. It's a game Elko likely wishes had never been scheduled given the circumstances. \"I'm sure he would like to get through this (week) quickly,\" Notre Dame coach <mark>Brian Kelly</mark> said when asked about Elko's bittersweet reunion with his former players. \"It's never easy .\" Having a coach with first-hand knowledge of his former team might seem like an advantage for Notre Dame (7-1). But <mark>Kelly</mark> warned not to read too much into any benefits of inside info. After all, the Demon Deacons (5-3) can counter with a working knowledge of how Elko likes to attack an offensive opponent. Wake Forest averages 31.6 points per game, too. The success each program has enjoyed under Elko mirror each other. Elko came to Notre Dame as one of only two FBS coordinators with top-40 defenses in each of the past five years--three at Wake Forest and two at Bowling Green. Neither team is a perennial football power. \"We had lower-recruited players, but we had good players,\" Elko said upon his arrival at Notre Dame. \"We taught a defense that they understood, and we weren't asking kids to just make plays and do things that they weren't capable of doing .\" Wake Forest coach Dave Clawson knows what his team will be up against because it's what the Demon Deacons have been doing for some time now. \"They're one of the top teams in the country in limiting the run, creating turnovers,\" he said. \"Does that sound familiar? That's been Mike's M.O., try to make teams one-dimensional, and he's doing it .\" Clawson hired Elko as an assistant in 2009 when Clawson was the head coach at Bowling Green. The two coached and moved up together over the next eight years until Elko left Clawson for Notre Dame. The two also worked together at Fordham and Richmond from 2002 to 2005. Clawson expressed gratitude for Elko's service and wished him nothing but success--after this weekend. \"We know they're going to be well-coached, and Mike has made a big impact there already,\" Clawson said. \"He's a great coach. He's doing a great job (at Notre Dame) and I'm proud of him. But on Saturday, we want to beat him and he wants to beat us .\" With a defensive roster at Notre Dame filled with NFL prospects, leaving Wake Forest for a more prominent program seemed like an easy choice after last season. But Elko said his decision took great care and consideration, and the improvement followed. After finishing last season No. 104 in takeaways with only 14, Elko's Irish rank No. 11 in the country this season with 18 turnovers gained. Notre Dame allows only 16.1 points a game, the 10th best mark in the country. It has also given up only one rushing touchdown this season, the fewest in the FBS, and opponents have scored just 10 red zone touchdowns in 25 trips. Irish senior captain Drue Tranquill said there is no single reason for the success and turnaround from last season. He calls it a collection of shifts and changes that all correlate to Elko's arrival. Elko moved Tranquill from a strong safety last year to a rover (a safety/linebacker hybrid) this season and the production has followed. \"I don't know that you can point the finger at any one thing that has led to the change,\" said Tranquill, who leads the Irish with 6.5 tackles for loss and also has 1.5 sacks, three fumble recoveries, one forced fumble and an interception. \"It's just the all-around mental preparation of our team has been much better. I never walk into a game feeling inferior in terms of my mental preparation with our new coaching staff .\" Elko isn't the only former Wake Forest coach on <mark>Kelly</mark>'s staff, either. Chuck Lea, who coached linebackers at Wake Forest last season under Elko, is now doing the same job at Notre Dame. Clawson was asked about Notre Dame's improved defense this season. \"Well, they hired two guys from Wake Forest,\" he said. \"So I think that's what happened .\" ___ AP Sports Writer Joedy McCreary contributed. ___ More AP college football: http: //www.collegefootball.ap.org and https: //twitter.com/AP_Top25 Share this:", "articleID": "2017110207_00211351_W", "names": {"Brian Kelly": ["Q16186315", "Q16730700", "Q18098352", "Q194016", "Q21259238", "Q22920229", "Q28873135", "Q48773396", "Q4964312", "Q4964313", "Q4964314", "Q4964315", "Q4964316", "Q4964318", "Q4964319", "Q4964321", "Q4964322", "Q57431309", "Q58039928"]}}, {"date": "2017-11-02", "url": "https://www.theglobeandmail.com/globe-investor/investment-ideas/general-electric-stock-suffering-worst-slump-since-the-recession/article36812936/?cmpid=rss1", "content": "Open this photo in gallery: In this Monday, June 12, 2017, file photo, the General Electric logo appears above a trading post on the floor of the New York Stock Exchange. Richard Drew/AP Richard Clough Bloomberg News November 2, 2017 It must be feeling an awful lot like 2009 for General Electric Co. shareholders. That's not a good thing. The stock fell Thursday afternoon as it careened toward a ninth straight daily loss, which would be the longest in eight years. During the latest streak, GE also suffered the worst single-week decline since March 2009 and closed its biggest monthly drop since February of that year. The recession-era slump has become a frequent point of comparison as the industrial giant struggles with a raft of problems, from poor cash flow to weak power and oil markets. New Chief Executive Officer <mark>John Flannery</mark> has said he'll consider all options to revitalize GE, which is the worst performer by far on the Dow Jones Industrial Average this year. Story continues below advertisement The shares fell 1 per cent to $19.81 at 1:41 p.m. in New York. GE dropped 37 per cent this year through Wednesday, wiping out more than $100-billion in market value, even as broader indexes rose. JPMorgan Chase & Co. on Wednesday cut its price target for GE to $17 a share from $19, with analyst Stephen Tusa citing weak revenue and profit in the power-generation business. Jeff Sprague, an analyst with Vertical Research Partners, warned that a rebound may be underwhelming. \"Once the bottom is in, GE will still have a challenging growth outlook,\" Sprague said in a note. \"While there could be a short-term technical pop, the fundamental recovery will take time .\" Investors and analysts are also bracing for a possible dividend cut, particularly after the Boston-based company last month slashed its cash-flow forecast for 2017. <mark>Flannery</mark>, who took the top post in August, hasn't ruled out such a move. If the payout is reduced, it would be the first time since--you guessed it--2009. Video: How advisors can keep client information safe from hackers Report an error", "articleID": "2017110220_00244456_W", "names": {"John Flannery": ["Q30242909", "Q6233390", "Q6233392", "Q7584924"]}}, {"date": "2017-11-03", "url": "http://au.news.yahoo.com/a/-/world/37725700/third-of-young-britons-refuse-to-wear-poppy-for-remembrance-day/", "content": "A third of Brits under the age of 25 are reportedly refusing to wear the poppy as Remembrance Day draws closer because they believes that it glorifies war. The research, carried out by Consumer Intelligence, found that some 11 percent of the country will not wear poppies as part of the Royal British Legion appeal, which raises £ 43 million for ex-service personnel every year. Some even claimed that they feel bullied into wearing it, while others said they refused to wear it as a show of opposition against current military action. A third of Brits under 25 are refusing to wear poppies for Remembrance Day. Photo: AP The survey, which polled Brits in the run-up to Remembrance Sunday, also found that 29 percent of people believe that it should be compulsory to wear it. <mark>Ian Hughes</mark>, the Chief Executive of Consumer Intelligence said: \"The Poppy Appeal commands widespread support and raises huge sums but not everyone agrees with it or backs it\". UK Prime Minister Theresa May receives her poppy. Photo: AP \"It is interesting however that tolerance of those who oppose poppies is so high with most people accepting it is a matter of personal choice .\" The wearing of a white poppy has also been popularised in recent years, warn as a sign of remembrance by pacifists and anti-war activists.", "articleID": "2017110300_00561004_W", "names": {"Ian Hughes": ["Q15819828", "Q16148972", "Q21289123", "Q21549958", "Q48817102", "Q56254266", "Q5981847", "Q5981848", "Q5981850"]}}, {"date": "2017-11-03", "url": "http://www.bbc.co.uk/news/uk-scotland-highlands-islands-41860773", "content": "Residents buy land near Fairy Pools to ease traffic 3 November 2017 These are external links and will open in a new window Close share panel Image copyright John Allan/Geograph Image caption The series of waterfalls and pools in Glen Brittle have become a major tourist attraction Residents on Skye have bought land near a popular tourist spot in a bid to reduce congestion in the area. Locals say the high volume of visitors and traffic at the Fairy Pools has become \"too much to bear\". Minginish Community Hall Association (MCHA) is the first to make use of a scheme which allows publicly-owned forestry assets to be transferred for the benefit of local communities. The scheme is run by Forest Enterprise Scotland (FES). The MCHA bought the 12.3 hectares of land for £ 2,500 - a discount of £ 27,500 on the market value - because of the \"substantial public benefit that will be delivered\". \"World-class attraction' The series of waterfalls and pools in Glen Brittle have become a major tourist attraction and the area was recently named by travel guide Wanderlust as the best place in Britain for wild swimming. Local MSP <mark>Kate Forbes</mark> said there were more than 108,000 visitors to the Fairy Pools last year, but access is restricted by a single-track road and a 35-space car park. The MCHA plans to make space for 137 cars and about 20 mini-buses and camper vans in a bid to reduce congestion. Image copyright Richard Dorrell/Geograph Image caption The access road to the Fairy Pools is single track The land acquisition was announced by Tourism Secretary Fiona Hyslop during a visit to Skye. She said:\" I am delighted FES have agreed to the sale of this land, which will help the local community respond to the pressures and opportunities that come with having a world-class attraction like the Fairy Pools on your doorstep. \"We recognise the recent surge in interest seen by some of our tourism sites, particularly in rural locations. That is why we recently announced a new £ 6m Rural Tourism Infrastructure Fund .\" Alongside the Skye strategic group, the Scottish government will continue to do all we can to support sustainable growth in tourism, working in partnership with local communities - in Skye, throughout the Highlands & Islands and across Scotland. \"\"Too much to bear' Julie Burnett, a director of MCHA, said:\" This is a key milestone in the project to provide improved parking facilities close to the Fairy Pools. \"The community benefit of the land transfer and the overall project cannot be overstated .\" Both residents living in Glen Brittle and future visitors to the Fairy Pools will benefit from the proposal to expand and improve the existing small car park. \"Ms <mark>Forbes</mark> said a\" robust \"tourist strategy was needed for Skye as a whole to improve infrastructure .\" The situation at the Fairy Pools has really become too much to bear for local residents who just want to go about their daily lives, \"she said .\" The single-track road is far too narrow for the volume of traffic parked at the Fairy Pools. \"We've reached a point where enough is enough and I'm pleased the Scottish government is facilitating the community asset transfer at the Fairy Pools .\" She said she had begun a series of meetings to draft a strategy for the island. \"Tourists are welcome on Skye, it's our responsibility to ensure the infrastructure is prepared for them,\" she said.", "articleID": "2017110313_00709375_W", "names": {"Kate Forbes": ["Q24039479", "Q28007154"]}}, {"date": "2017-11-03", "url": "http://www.philly.com/philly/business/technology/philadelphia-patrons-line-up-outside-walnut-street-apple-store-for-the-new-iphone-x-cook-timothy-stock-20171103.html", "content": "Over 100 people were lined up covering half the 1600 block of Walnut Street on Friday, waiting to snag the newly released iPhone X from the Apple Store. The doors opened at 8 a.m. Friday, but police say customers had lined up as early as 8:30 pm the night before in an attempt to be among the first to pick up the pricey new smart phone. The iPhone X comes with many new features, such as facial recognition software, a larger screen, and a faster processor. Despite its high price--around $1,000 for the base model--people still came out in droves to get it. \"I have the antique, the iPhone 4S, it really is time for an upgrade,\" said Elaine Davidson, 54, a musician from Dallas, Texas who was in Philadelphia to perform with the Phantom of the Opera musical. Davidson said she drives constantly, and the new phone would make it easier for her to listen to music as she navigated to a new city. \"I primarily want the [iPhone X] because of the better camera. I have an iPhone 6, and I usually get a new phone every two years so it is about time .\" said Jason McAndrew, 37, a marketing manager from Philadelphia who stood near the back of the line. McAndrew had ordered the phone, but said he would have to wait two weeks for it to arrive, so he hoped to get the phone Friday if the wait was not too unreasonable. For those who wish to avoid waiting at an Apple Store, the phone can be purchased online at Apple.com. Apple's stock has risen about 3 percent by midday, primarily due to the release of the iPhone X. The iPhone line is the company's dominant product, accounting for about two-thirds of Apple's total sales. Chief Executive Officer <mark>Tim Cook</mark> has focused on growing services, like Apple Music and iCloud, so the company can better bind consumers to Apple's hardware products. \"I've been waiting about two hours. This phone is the new thing, and I want to be one of the first to try it out so I can optimize my client's apps,\" said Gilson Nunes, 27, a developer who said he owns a small company in Brazil. Published: November 3, 2017--1:24 PM EDT We encourage respectful comments but reserve the right to delete anything that doesn't contribute to an engaging dialogue Help us moderate this thread by flagging comments that violate our guidelines Commenting policy | Comments FAQ Comment policy: Philly.com comments are intended to be civil, friendly conversations. Please treat other participants with respect and in a way that you would want to be treated. You are responsible for what you say. And please, stay on topic. If you see an objectionable post, please report it to us using the \"Report Abuse\" option. Please note that comments are monitored by Philly.com staff. We reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. Personal attacks, especially on other participants, are not permitted. We reserve the right to permanently block any user who violates these terms and conditions. Additionally comments that are long, have multiple paragraph breaks, include code, or include hyperlinks may not be posted. Load comments Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2017110317_00558702_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}]