[{"date": "2017-11-06", "url": "https://www.fin24.com/Markets/International-Markets/stocks-mixed-yen-slides-to-lowest-since-march-20171106", "content": "1549,97 (-0.10%) Loading...We're currently experiencing serious technical problems on the site, and as a result are unable to update the news--even though our market data is running as per normal. We sincerely apologise for any inconvenience caused and hope to be up and running again this evening. Thank you for your patience in this regard .--<mark>David McKay</mark> (editor) & team Stocks mixed, yen slides to lowest since March 0 minutes ago Dollar gains before US jobs report, stocks rise Sydney - The yen tumbled to the weakest since March after Bank of Japan (BoJ) Governor Haruhiko Kuroda said it's crucial for inflation to exceed the 2% target. Stocks were mixed after China's central bank chief warned again about excessive leverage and President Donald Trump brought up trade grievances on a trip to the region. Hong Kong's Hang Seng Index reversed losses after dropping the most in more than two weeks in the wake of People's Bank of China Governor Zhou Xiaochuan's latest salvo on the continuing accumulation of financial risks. Japanese equities were little changed after the yen's decline offered support earlier. Kuroda underscored in a speech Monday that the BOJ is committed to overshooting its inflation goal, auguring no appetite for tapering stimulus. Oil extended an advance above $55 a barrel, with traders keeping an eye on the surprise power shakeup in Saudi Arabia over the weekend. Iron ore climbed percent. \"Governor Kuroda is repeating what he said after the BoJ's meeting last week but the dollar-yen is getting more support as the market starts to anticipate dollar divergence becoming a key driver again of price action,\" said Mansoor Mohi-uddin, head of currency strategy in Singapore at NatWest Markets, a unit of Royal Bank of Scotland. \"The BoJ, like other major central banks, is signaling it will not lift interest rates anytime for the foreseeable future. In contrast, the Fed continues to stress its tightening bias. That is laying the conditions for a broader-based rally for the greenback across the board .\" Trump in Tokyo on Monday complained of unfair trade with Japan, pressing the country to step up investment in the US. He goes on to South Korea and China this week, with further prospects for trade tensions to pop up. Read more on Trump's trip to Asia here. Over the weekend, the president claimed credit for the rise in US stocks, which on Friday capped the longest run of weekly advances since 2013. The anti-corruption crackdown in Saudi Arabia has ensnared top officials and billionaires, including Prince Alwaleed bin Talal, known for his investments in companies such as Citigroup and Apple. Saudi Arabia's Tadawul All Share Index fell as much as 2.2% on Sunday before erasing losses to end up 0.3%. Kingdom, Alwaleed's investment vehicle, tumbled 7.6%. News on central bankers also will be closely watched. Federal Reserve Bank of New York President William Dudley is close to announcing his retirement, according to CNBC. His early departure would mean the top three positions at the Fed changing over within a relatively short period. Trump announced last week that Fed Governor Jerome Powell will be nominated to replace Janet Yellen when her term expires in February. Vice Chairperson Stanley Fischer retired in mid-October. Friday's US payrolls data provided a mixed picture of the strength of the labour market, though distortions from the hurricanes in August made it difficult to draw firm conclusions. Based on fed fund futures, the odds for a rate hike in December were little changed. Here are key events to watch out for this week: • The Reserve Bank of Australia is expected to keep interest rates on hold at a policy-setting meeting on Tuesday. Other central banks setting monetary policy this week include: Argentina, Mexico, New Zealand, Peru, Malaysia, Poland, Serbia and Thailand. • China releases third-quarter current account; October foreign-exchange reserves and October CPI and PPI this week. • Indonesia's third-quarter GDP expanded at a slower-than-expected pace, rising 5.06% from a year earlier versus a median estimate of 5.2%. • US consumer sentiment probably cooled in early November from a more than 13-year high. • The University of Michigan's report on Friday wraps up a light week for US economic data that also includes figures on job openings in September. New York Fed's Dudley gives a speech on \"Lessons from the Financial Crisis\" at an Economic Club of New York luncheon on Monday. • OPEC releases its World Oil Outlook. • Earnings season continues with announcements from Toyota, BMW, Walt Disney, Adidas, and Siemens. • Also this week, the European Central Bank publishes its economic bulletin and the European Commission updates its economic projections for the eurozone. Stocks • Euro Stoxx 50 futures fell 0.2% in early European trading. • Futures on the S & P 500 were little changed. • The main gauge rose 0.3% on Friday. • The Topix index was down 0.1% at the close, while the Nikkei 225 Stock Average was little changed. • Australia's S & P / ASX 200 Index fell 0.1%, while the Shanghai Composite Index climbed 0.5%. • South Korea's Kospi index fell 0.3%. • Hong Kong's Hang Seng Index rose 0.1%. • The CBOE Volatility Index, known as the VIX, dropped 8% to a record-low 9.14 on Friday. • The MSCI Asia Pacific Index declined 0.1%. Currencies • The yen dropped 0.3% to 114.40 / $, paring an earlier decline of more than 0.5%. • The Aussie dollar traded at 76.49 US cents. • The South Korean won fell 0.1% to 1 115.09 per dollar. • The euro was steady at $1.1612. • The Bloomberg Dollar Spot Index was little changed. Bonds • The yield on 10-year Treasuries was little changed at 2.34%. It fell more than seven basis points last week. • German 10-year bund yields were steady at 0.36%. Commodities • West Texas Intermediate crude rose 0.4% to $55.86 a barrel. It jumped 2% on Friday. • Gold slipped 0.1% to $1 263.43 an ounce. • Iron ore rose 3% to 454 yuan per ton on the Dalian Commodity Exchange. SUBSCRIBE FOR FREE UPDATE: Get Fin24's top morning business news and opinions in your inbox.", "articleID": "2017110608_00020043_W", "names": {"David Mckay": ["Q1175601", "Q15500677", "Q46515282", "Q47541485", "Q5237382", "Q5237386", "Q55942880"]}}, {"date": "2017-11-06", "url": "http://www.sport24.co.za/Soccer/International/pochettino-confident-kane-will-be-fit-for-england-20171106", "content": "Pochettino confident <mark>Kane</mark> will be fit for England 2017-11-06 14:35 Khune out injured with facial fracture London - Tottenham Hotspur manager Mauricio Pochettino insists <mark>Harry Kane</mark> will be available for England's upcoming friendly internationals despite an injury scare in a 1-0 Premier League win over Crystal Palace. The Spurs striker went off 14 minutes from the end of Sunday's success at Wembley after receiving treatment in the first half. Pochettino also believes Dele Alli will recover from a hamstring problem in time for his club's next game with north London rivals Arsenal, even if he is missing England duty for the matches with Germany and Brazil. But he was unsure whether Harry Winks will have to withdraw from Gareth Southgate's squad after the midfielder went off with an ankle injury in a below-par victory where Spurs failed to hit the heights of their thrilling midweek 3-1 success over Real Madrid in the Champions League. \"<mark>Kane</mark> was subbed because after 75 minutes we wanted to protect him,\" said Pochettino. \"After Real Madrid it was such an emotional game, it was better to avoid risk. I think he's OK and I'm sure he will go with the international team .\" The former Southampton manager added: \"Harry Winks twisted his ankle in the first half, it's a little bit painful, we must assess him with our medical staff and the national team medical staff .\" He is so excited to be with the national side but now it is up to the medical staff to assess the player. \"Dele felt his tendon at the end of the Manchester United game close to his hamstring and then played 90 minutes against Real Madrid. It is a very small thing. It was not a massive risk to play him here and we hope he can be ready for Arsenal .\" Spurs were disappointing against Palace in a match where the deadlock was not broken until the 64th minute thanks to Son Heung-Min's 20-yard drive. \"It was very difficult,\" admitted Pochettino. \"We knew after Real Madrid it would be a massive challenge to compete again. In the end I'm very pleased, the team was very professional .\" It was a game where we had possession and dominated but we conceded a lot of chances. You need some luck to win and it was a good performance. \"\"Deserved more' Palace remain bottom and are five points from safety but the Eagles can feel aggrieved with Wilfried Zaha missing their best chance when he fired wide at 0-0 after rounding debutant goalkeeper Paulo Gazzaniga .\" I will be leaving Wembley as a loser, which didn't happen much when I was here for four years, \"said Palace's former England manager Roy Hodgson .\" We created chances and had moments where we were even on top against an illustrious side. We deserved more than what we had. \"But in football you get what you get. You don't get what some people think you deserve .\" Hodgson added: \"We look at the table and we are still on four points. But globally there is not a lot I can accuse my players of. The confidence is fragile but when the goal went in we could have collapsed and lose by three or four .\" They (Tottenham) have players who can punish you. That's a positive they didn't. \"", "articleID": "2017110614_00074918_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}, {"date": "2017-11-07", "url": "https://dominicantoday.com/dr/local/2017/11/07/greens-politicos-have-made-a-wash-rag-of-the-constitution/", "content": "Local November 7, 2017 | 12:39 pm Text size: Bigger Greens: politicos have made a wash rag of the Constitution Santo Domingo.-The Green March movement on Monday called to convene a constituent based on \"the independence of the branches of government and the non-encroachment of one over another, shutting the path to impunity for corruption .\" During an anticorruption and anti-impunity rally at Santo Domingo's Colonial City to mark the 173rd anniversary of the Dominican Constitution, the Greens called it a date \"to analyze the politicians' misdeeds .\" Reading from a statement the political leader <mark>Rafael Perez</mark> Peña (Bacho) called to discuss the crisis that sparked the anti-corruption movement on January 22. \"The movement aims to articulate its aspirations through consultations aimed at generating their own initiatives, before the convocation of a constituent that outlines a viable exit to the reservoir that shelters the country,\" <mark>Perez</mark> said. \"That's the way that this country has been governed since 1844, that's the way they've violated our Constitution and have converted it into a piece of paper, a wash rag .\" ", "articleID": "2017110713_00355254_W", "names": {"Rafael Perez": ["Q3108248", "Q7282269"]}}, {"date": "2017-11-07", "url": "http://www.dailygalaxy.com/my_weblog/2017/11/the-alien-observatory-life-may-have-been-in-existence-for-13-billion-years-early-universe-functioned.html#comments", "content": "The Alien Observatory--\"Life May Have Been in Existence for 13 Billion Years--Early Universe Functioned as an Incubator Soon After the Big Bang\" (WATCH Video) November 07, 2017 How long has there been life in the Universe? Perhaps some thirteen billion years. Harvard Astrophysicist, Avi Loeb speaks on the surprising habitability of planets in the early Universe far earlier than the creation of the Milky Way. Surprisingly, temperatures in the early cosmos were similar to those on Earth today. The cosmological conditions for life were in place far earlier than commonly thought. The NASA image at the top of the page shows one of the first stars, which formed around 13.7 billion years ago. The discovery was made by lead researcher <mark>Stefan Keller</mark> of The Australian National University and the results were published in Nature. Dr. <mark>Keller</mark>'s team operates the SkyMapper telescope at the Siding Spring Observatory in New South Wales. Because elements heavier than helium are forged in the cores of stars, the first ones were made mostly out of hydrogen. The telescope is able to detect these first stars because the low iron content influences their color. Using this technique to find early stars, the SkyMapper is currently in a 5-year-long survey, mapping the ancient Southern sky. This star formed so early in our Universe's history, was most likely a second-generation star. Because of the chemical composition, astronomers can gather information about the earlier primordial star, which is believed to be 60 times more massive than our sun and composed of hydrogen and helium. Click Here to Launch Your Day With The Daily Galaxy - Great Discoveries Channel - Free Email Delivery Recent Most Viewed: \"Still a Mystery\" --Huge Elliptical Galaxy Observed Missing a Central Supermassive Black Hole The Alien Observatory--\"It's Astonishingly Likely That We're Not the Only Time and Place That an Advance Civilization Has Evolved\" (VIDEO) This Week's \"Planet Earth Report\" --Terrifying Quark Discovery to Edward Snowden's Alien Contact Theory \"Destroyer of Cancer Cells\" --Iridium from the Chicxulub Asteroid 66-Million Years Ago that Ended the Dinosaur Epoch \"We Exist in a Cyclical Universe\" --Chinese Scientists Measure Cosmic Expansion With a \"Magic Ruler' The Extraterrestrial Mirror--\"There's a Level of Predictability to Evolution that Aliens Would Look Like Us\" NASA Reveals Record-Breaking Results of \"Sci-Fi\" Ion Engine--\"Manned Missions to Mars On the Horizon In Weeks\" (WATCH Video) \"It Came From Outer Space\" --Mystery of First Interstellar Object Ever Observed in Our Solar System Posted on November 07, 2017 at 07:55 AM | Permalink | Comments (0) | | |", "articleID": "2017110715_00978773_W", "names": {"Stefan Keller": ["Q1544422", "Q2336676", "Q2336682", "Q7606155"]}}, {"date": "2017-11-07", "url": "http://www.firstpost.com/politics/narendra-modi-writes-to-people-of-gujarat-says-vote-for-bjp-and-save-state-from-casteism-4198311.html", "content": "Narendra Modi writes to people of Gujarat, says vote for BJP and save state from casteism Narendra Modi writes to people of Gujarat, says vote for BJP and save state from casteism Politics PTI Nov, 07 2017 22:35:07 IST Ahmedabad: Prime Minister Narendra Modi urged the people of Gujarat to vote for the BJP in the Assembly polls embracing its development agenda, and save the state by rejecting \"casteism, communalism and dynastic politics\". File image of Prime Minister Narendra Modi. Reuters. On the first day of the BJP's door-to-door outreach drive--Gujarat Gaurav Maha-Sampark Abhiyan--BJP workers and leaders, including its president <mark>Amit Shah</mark>, distributed copies of Modi's message-cum-appeal among people. In the written message addressed to the people of Gujarat, Modi urged them to remember what the state was before the BJP assumed power in 1995, and appealed to them to vote for his party to carry forward the \"journey of development\" that began 22 years back. \"Just compare what was Gujarat 22 years back and what it is now. Thanks to the good governance of the BJP governments, Gujarat has reached new heights of development, so much so that it is now known across the world,\" he said in the message. Modi said a young person of 22-25 years cannot even imagine what Gujarat was in the past when casteism and communalism \"destroyed\" it. \"Now, some power-hungry elements are playing the same dirty game. Now, it is our collective responsibility to save Gujarat from the evils of casteism, communalism and dynastic politics,\" the message read. Modi also slammed the Congress-led UPA governments, accusing them of having stalled the Narmada project. The prime minister said though the Congress-led central governments were not favourable to Gujarat, the state continued its journey of development. He reminded the people how his government got completed the Sardar Sarovar dam project quickly. Polling for the two-phase elections will take place on 9 and 14 December and votes will be counted on 18 December. Published Date: Nov 07, 2017 10:35 pm | Updated Date: Nov 07, 2017 10:35 pm New Zealand in India, 3 T20 International Series, 2017 IND Vs NZ New Zealand in India, 3 T20 International Series, 2017 IND Vs NZ New Zealand in India, 3 T20 International Series, 2017 IND Vs NZ Pakistan and Sri Lanka in UAE, 3 T20 International Series, 2017 PAK Vs SL Bangladesh in South Africa, 2 T20 International Series, 2017 SA Vs BAN New Zealand in India, 3 ODI Series, 2017 IND Vs NZ West Indies in Zimbabwe, 2 Test Series, 2017 ZIM Vs WI Pakistan and Sri Lanka in UAE, 3 T20 International Series, 2017 PAK Vs SL Pakistan and Sri Lanka in UAE, 3 T20 International Series, 2017 PAK Vs SL Bangladesh in South Africa, 2 T20 International Series, 2017 SA Vs BAN", "articleID": "2017110717_00948027_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}}, {"date": "2017-11-07", "url": "http://www.denverpost.com/2017/11/07/claudio-lopez-colorado-rapids-overhaul/", "content": "Cyrus McCrimmon, The Denver Post Colorado Rapids director of soccer Claudio Lopez during Picture Day for the team at their headquarters in Commerce City on Thursday, March 12, 2015. By Daniel Boniface | dboniface @ denverpost.com | The Denver Post November 7, 2017 at 4:13 pm Sign up for newsletters and alerts Submit your news tips or photos Colorado Rapids director of soccer Claudio Lopez will not return for the 2018 season as part of a massive overhaul that will bring in three new front-office hires, up to 11 new players and a new head coach. Lopez, who joined the club's front office in December 2014, had his contract expire and the Rapids said they decided not to bring him back. \"There's no doubt it's going to be an offseason overhaul in here,\" Rapids interim general manager Padraig Smith told The Denver Post on Tuesday. \"Both on the field and off the field .\" Smith said the Rapids plan to restructure their front office with the hire of a new assistant general manager, director of player personnel and a head of sports science. He said the team hopes to fill the positions with outside hires by the start of preseason. Cyrus McCrimmon, The Denver Post Colorado Rapids sporting director Pádraig Smith during Picture Day for the team at their headquarters in Commerce City on Thursday, March 12, 2015. Meanwhile, Smith said the club is closing in on its new head coach, who the Rapids wanted to have in place by the beginning of November. \"We've identified the person that we want to take us forward,\" Smith said. \"And I think people can expect an announcement in the coming weeks .\" Smith said the search is \"definitely at the final stages now,\" after a global search that focused on finding someone who aligned with the club's attack-minded philosophy. Smith said the new coach will have a plan and track record of executing that vision. In recent weeks, the Rapids have been linked with New Zealand head coach <mark>Anthony Hudson</mark> in several reports, but Smith would not confirm whether <mark>Hudson</mark> was a candidate for the Rapids' job. <mark>Hudson</mark>'s New Zealand team is facing Peru in a two-match playoff series for a spot in the World Cup, with matches Nov. 11 and 15. <mark>Anthony</mark> Au-Yeung, Getty Images Head Coach <mark>Anthony Hudson</mark> of New Zealand looks on prior to the 2018 FIFA World Cup Qualifier match between the New Zealand All Whites and Solomon Island at North Harbour Stadium on Sept. 1, 2017 in Auckland, New Zealand. Asked what input a new coach would have on player acquisitions, Smith said that is why their exhaustive search was so important. \"When you identify a coach who shares the same philosophy and vision, then you obviously put yourself in a position where the players you're identifying are absolutely in line with everyone's thinking,\" Smith said. In the weeks since the season ended, Smith has had one-on-one conversations with all players on the roster and informed each one whether the club would pick up their options, but would not go into detail yet on which players would not return. \"I obviously want to speak to all the other MLS clubs as well to see if there's a potential deals in place,\" Smith said. Asked whom he considered cornerstone players that the club will build around going forward, Smith mentioned only <mark>Tim Howard</mark> by name. \"I'm excited about what we're trying to achieve this offseason,\" <mark>Howard</mark> said in a statement released by the club. \"There's a huge amount of potential at this club and I know we're all ready to get back to winning ways .\" Related Articles <mark>Anthony Hudson</mark> has caught the Rapids' eye. But for now, he's trying to lead New Zealand to the World Cup. <mark>Steve Cooke</mark> no longer being considered for Rapids head coach job Rapids enter the offseason with plenty of question marks Nicolas Lodeiro scores twice, Sounders beat Rapids in season finale Rapids beat Real Salt Lake in final home game of season Smith said the Rapids have identified a number of key additions they are targeting this offseason. In the short term, Smith said he's looking for a left wing back and an attacking midfielder. He said those players should play with intensity, urgency and boldness. \"I think what we need is a little more creativity and a little more soccer IQ and guile in the attacking midfield position centrally,\" Smith said. Smith said the Rapids have two scouts in Europe watching games and narrowing the team's search. \"I'll be heading off to Europe as well to watch some of our targets in the coming weeks,\" Smith said, adding that he may also head to South America to see some players the team is targeting.", "articleID": "2017110723_00426156_W", "names": {"Anthony Hudson": ["Q4772753", "Q4772754"], "Steve Cooke": ["Q48976786", "Q7612265"], "Tim Howard": ["Q16226269", "Q200785", "Q7803679"]}}, {"date": "2017-11-08", "url": "http://www.bollywoodlife.com/news-gossip/gadar-ek-prem-katha-team-sunny-deol-and-anil-sharma-to-return-with-kavach-read-all-the-details-here/#disqus_thread", "content": "Last week, there were reports about Shahid Kapoor and <mark>Imtiaz Ali</mark> reuniting for a film, after a gap of 10 years. Now, another popular actor-director duo is coming up with their next film--Sunny Deol and <mark>Anil Sharma</mark>. Reveals a source, \"Sunny and <mark>Anil</mark> have always shared a great working relationship. <mark>Anil</mark> had this script and approached Deol, who immediately agreed to be part of the film. It's titled Kavach .\" This will be their fifth film together. Their first film Gadar: Ek Prem Katha, which released in 2001, is considered one of Indian cinema's biggest hits. Sunny and <mark>Anil</mark> collaborated on three other films thereon--The Hero (2002), Apne (2007), and Singh Saab The Great (2013). They are coming together after almost five years now. Also read: Dimple Kapadia is the reason Hema Malini spoke to Sunny Deol for the first time? Our source adds, \"<mark>Sharma</mark> will start this film right after his next. They will begin filming for Kavach sometime next year and the film is expected to release in the last quarter of 2018 or January 2019, depending on their schedule .\" <mark>Anil</mark> doesn't want to divulge any details about the project at the moment. He says, \"I am busy finishing Genius which is my son Utkarsh's debut film. I don't want to talk about any other film right now .\" ", "articleID": "2017110804_00377390_W", "names": {"Anil Sharma": ["Q4764669", "Q55192662", "Q58332017"], "Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"]}}]