[{"date": "2017-11-09", "url": "http://www.tennessean.com/story/news/local/williamson/2017/11/09/church-shooting-prevention-security-antioch-tennessee-texas-williamson-county/844585001/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Twitter Google + LinkedIn Pinterest \"Fine line' for Williamson congregations when it comes to church security Congregations are looking at how to deal with safety and security in light of church shootings in Antioch and Texas. Post to Facebook Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CLOSE Engle, who was called a hero by the Nashville police chief,\" physically engaged \"with a masked shooter at the end of the Sept. 24 morning service at Burnette Chapel Church of Christ, Metro police said. Shelley Mays/The Tennessean CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Four weeks ago, Tim Orr said conversations around security started inside his Franklin church, after members saw the headlines on a shooting in an Antioch sanctuary. Franklin First United Methodist Church has more than 1,000 members that attend its newest facility at Mack Hatcher Parkway and Aldersgate Drive. The church also has services inside its historic location in downtown .\" Right now with our congregation, we are looking at different security aspects and what would be the best for our congregation, \"said Orr, who was hired as head of security when a committee formed a month ago to look at church safety. CLOSE What we know about the gunman's AR-556 rifle and the modifications you can make to those guns. Ramon Padilla, USA TODAY This thought only intensified in the wake of a church shooting at First Baptist Church of Sutherland Springs, outside San Antonio, Texas, on Sunday. The shooting left 26 people dead, according to authorities .\" We have a small team in place, but we don't have any type of protocol that we practice now, \"he said .\" That is what we are currently working on. \"Police checks in place Already conducting security assessments, Franklin Police Department officers regularly evaluate businesses, schools and places of worship. Department Public Information Officer Lt. Charles Warner said officers will provide recommendations to those locations for free .\" The disturbing increase is mass-shooting incidents at public places has prompted an increase in requests, especially from Franklin churches, \"Warner said. Facebook Twitter Google + LinkedIn Nashville church shooting: The emotional scene Fullscreen Post to Facebook Posted! A link has been posted to your Facebook feed. Buy Photo Ieshea White and Kimberly Stallworth embrace their uncle and brother Roger Bracey, who was at Burnette Chapel Church of Christ when shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. They were reunited at another nearby church. Shelley Mays / The Tennessean Fullscreen Buy Photo A member of a neighboring church left a memorial at the doorstep of Burnette Chapel Church of Christ where a mass shooting occurred during Sunday services. photographed the day after Monday, Sept. 25, 2017 in Nashville, Tenn.. <mark>George Walker</mark> IV / The Tennessean Fullscreen Buy Photo A mass shooting happened during Sunday morning services at the Burnette Chapel Church of Christ. photographed the day after Monday, Sept. 25, 2017 in Nashville, Tenn.. <mark>George Walker</mark> IV / The Tennessean Fullscreen Alleged church shooter Emanuel Kidega Samson is being transported to jail. MNPD Fullscreen Emanuel Kidega Samson, 25, has been charged with criminal homicide in the death of Burnette Chapel Church of Christ member Melanie Crow. Courtesy of Metro Nashville Police Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo Ethan Huffard, left, a teacher at Ezell-Harding, prays during a vigil at Ezell-Harding Christian School in Antioch, Tenn., Sunday, Sept. 24, 2017. The vigil was in response to a shooting at Burnette Chapel Church of Christ that left one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police officer conducts a search of a car where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kristy Mallory helps Phillip Reese carry his son Jeremiah from Beautiful Gate Church after the 10-year-old injured his ankle while barricading his Sunday School classroom during the shooting at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Emergency personnel investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency vehicles surround Burnette Chapel Church of Christ after the shooting Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police place yellow tape near the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Church members retrieve their cars later in the day after the shooting at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo A member of the Metro Nashville Police Department bomb squad exits the building following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in the Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police investigate the parking lot at Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Jeremiah Reese, 10, and father Phillip wait at Beautiful Gate Church after Jeremiah was injured barricading his Sunday school classroom after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Investigators work the shooting scene at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police spokesman Don Aaron speaks to the media at the scene of the shooting at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police continue to investigate the suspect's vehicle after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Evidence markers are on the ground in the parking lot after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Ieshea White cries tears of joy after being reunited at a nearby church with her uncle Roger Bracey who was at Burnette Chapel Church of Christ when shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Police enter Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo People console each other at the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member investigates a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police place yellow tape near the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Joe Love, 68, lives across the street from the church. Members asked for his help after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Joe Love, 68, lives across the street from the church. Members asked for his help after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Police use a rope and pulley to remove a case from a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member investigates a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police use a rope and pulley to remove a case from a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police bomb squad takes pictures of a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo The scene at Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Broken glass on the door at the church where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police investigate outside Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member gets suited up outside Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Onlookers stand near the Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member gets suited up outside Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police place yellow tape where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo ATF agents investigate following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in the Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired with people shot at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police use rope and pulleys to remove items from the suspect's car following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency personnel watch the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Metro Nashville Police investigate following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in the Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police tape lines at the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency vehicles line the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency vehicles line the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Emergency vehicles line the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo A mass shooting happened during Sunday morning services at the Burnette Chapel Church of Christ. photographed the day after Monday, Sept. 25, 2017 in Nashville, Tenn.. <mark>George Walker</mark> IV / The Tennessean Fullscreen Like this topic? You may also like these photo galleries: Replay 1 of 66 2 of 66 3 of 66 4 of 66 5 of 66 6 of 66 7 of 66 8 of 66 9 of 66 10 of 66 11 of 66 12 of 66 13 of 66 14 of 66 15 of 66 16 of 66 17 of 66 18 of 66 19 of 66 20 of 66 21 of 66 22 of 66 23 of 66 24 of 66 25 of 66 26 of 66 27 of 66 28 of 66 29 of 66 30 of 66 31 of 66 32 of 66 33 of 66 34 of 66 35 of 66 36 of 66 37 of 66 38 of 66 39 of 66 40 of 66 41 of 66 42 of 66 43 of 66 44 of 66 45 of 66 46 of 66 47 of 66 48 of 66 49 of 66 50 of 66 51 of 66 52 of 66 53 of 66 54 of 66 55 of 66 56 of 66 57 of 66 58 of 66 59 of 66 60 of 66 61 of 66 62 of 66 63 of 66 64 of 66 65 of 66 66 of 66 Autoplay Show Thumbnails Show Captions Last Slide Next Slide\" As their police department, we want to empower the members of our community with information on how to decrease their chances of becoming a victim of the unthinkable. We also want to teach them how to fight back in the midst of an attack, to save their life and the lives of others around them. \"More: What happens when violence invades sacred spaces More: How this Tennessee county is helping churches boost security in wake of shootings FPD hasn't been the only department approaching churches with this tactic. Wilson County Sheriff's Office and Lebanon Police Department have offered security support to churches for the last year. Safety a long-time concern With more than 8,000 members, Brentwood United Methodist Church officials have kept safety in mind for a few years .\" We have had a safety in security plan in place for awhile, \"executive director Leslie Hotzfield said .\" But one of the things we have done as direct result of what's happened elsewhere recently is we have increased security on Sunday mornings. The Brentwood Police Department already help manage parking lots and traffic. We also have a plain clothes officer to be inside the building. This is walking the line between safety and hospitality. \"More: Antioch church turns to forgiveness one week after deadly church shooting More: Personal turmoil weighed on Nashville church shooting suspect Emanuel K. Samson Down the road at Congregation Micah, Rabbi Philip Rice said the synagogue has always had a plan in place for its worshipers since its founding. Congregants also chip in to pay a security fee, and Rice said synagogue leadership had a wish list in mind for other safety procedures .\" The officer we have is not there directing traffic, \"he said .\" They are there in case of emergency. If you visit a synagogue anywhere outside of United States, they don't let you just walk right now. It's not that you're not allowed in but they have to take security seriously. It's an unfortunate thing. \"Doors kept open Even with a wave of new thinking toward safety in places of worship, Rector Rusty McCown said St. Paul's Episcopal Church had no plans to change. As Franklin's oldest church, McCown said its thick, wooden doors to the sanctuary have always been open, no matter the time of day. Among its four services on Sundays, the church will see around 1,000 people at worship .\" It's a difficult situation, and we walk a fine line between our parishioners feeling safe, \"McCowan said .\" But at the same time, we aren't a particular church going to put a lot of systems in place that are overtly toward safety. \"More: Franklin's oldest church continues open-door tradition McCowan said he's had one email in the last 24 hours asking the question: what will the church do about safety? And while McCowan said there were not any concrete plans in place, he hoped all houses of worship would stand with the united message of hope .\" There's not a completely safe library or even concert anymore, \"he said .\" We just hope and pray that people will find the church to be a place of comfort. We shouldn't have to worry about something like this. \"Reach <mark>Emily West</mark> at erwest @ tennessean.com or 615-613-1380 and on Twitter at @ emwest22. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http: //www.tennessean.com/story/news/local/williamson/2017/11/09/church-shooting-prevention-security-antioch-tennessee-texas-williamson-county/844585001/", "articleID": "2017110913_00473017_W", "names": {"Emily West": ["Q10272426", "Q58374888"], "George Walker": ["Q1425389", "Q16193922", "Q16886404", "Q24042094", "Q24050502", "Q25205065", "Q5545817", "Q5545820"]}}, {"date": "2017-11-10", "url": "http://www.nbcsports.com/philadelphia/phillies/roy-halladays-family-releases-statement-memorial-details", "content": "Roy Halladay's family releases statement, memorial details AP Images Fans have shared their memories and paid tribute to Roy Halladay after the former Phillie died Tuesday from a plane crash in the Gulf of Mexico. The outpouring of support has deeply touched his loved ones. On Thursday, the Halladay family released a statement on Roy's life, including memorial service details. A celebration of his life will be held Tuesday, Nov. 14, at 4 p.m. at Spectrum Field in Clearwater, Florida, and it is open to the public. Here is what the Halladay family had to say in memory of Roy: Our family is heartbroken in confirming that Roy passed away in a plane crash Tuesday afternoon. While many will remember him for his success as a major league pitcher, we remember him as an amazing father, loving husband and loyal friend. Roy had many accomplishments in his professional career, the memories of which we will cherish forever. He described each achievement as a team effort rather than an individual accomplishment, a true testament to his character and love for his teammates. Roy grew up with a passion for planes and always had the goal of becoming a pilot. Since retiring from baseball, he has been actively studying, accumulating the required flight hours and obtaining multiple pilot certifications and licenses. Just as he was known for his work ethic in baseball, he was also widely respected by those who knew him in the aviation community for his hard work, attention to detail and dedication to safety while flying. He treated his passion for aviation with the same joy and enthusiasm as he did his love for baseball. That passion was also expressed through his tireless dedication to helping his own children and so many others learn to love and respect the game of baseball. He was an amazing coach for many youth teams, always showing patience and encouragement while reminding each child that they all had a role to play, a way to contribute and add value to their team. His love for the game had no boundaries as we often saw him instructing and encouraging the players on opposing teams. Roy was selfless in every aspect of his life. While we mourn the loss of the core of our family, we choose to celebrate him and remember the man we knew privately on and off the field. We hope that he serves as an example of professionalism, integrity and hard work for all who knew him. For us, we will forever remember his unconditional love, humility and the sacrifices he made to provide for the family that meant the world to him. On behalf of our family we thank you for respecting our privacy during this time of overwhelming grief. We also ask that you respect the privacy of our extended family as well as the families and children who Roy has coached, taught or worked with. We are so fortunate and thankful for the outpouring of love and support we've received from across the world. The Halladay Family Remembering Roy Halladay, who died Tuesday at the age of 40 after his plane crashed in the Gulf of Mexico. Chase Utley seldom looks out of place on a baseball field. He is a preparation junkie, always in tip-top shape and runs out every play like it's his last. Then he met the surgeon on the mound. Roy Halladay, a competitor of Utley's ilk, was his match. In his career, \"The Man\" never logged an official at-bat against \"Doc\" --and for that, he considers himself fortunate. However...\"I believe I faced him in spring training and he made me look like a little leaguer out there,\" Utley said Wednesday on NBC Sports Philadelphia's Philly Sports Talk. \"And I think I might have faced him in the All-Star Game (2009), and I remember thinking,\" OK, I've heard a lot about him, first pitch I see that's going to be a strike, I'm going to try to put it in play .' I did and I was out. He was a man among boys out there. He truly was. \"Utley and Halladay, astoundingly alike in their baseball makeup and mindset, shared an incredible appreciation for one another, especially after they became teammates in 2010. Over the past two days, Utley has found himself sharing that appreciation in the wake of Halladay's death on Tuesday, a result of a tragic plane crash .\" Obviously this is terrible, my heart goes out to Brandy and his two boys (Ryan and Braden), \"Utley said .\" I know he was really involved in their athletic abilities. I did a camp for them, this was a few years ago, and he was a coach, he had all the gear on, and he was really into it. Words can't really describe...it's just not a good thing. But I think it's important to reflect on all the positive things that he not only did for Major League Baseball, but for the Phillies and his teammates. He really made his teammates better. \"Utley was made better by Halladay as the two pushed each other with their drive to be better than the day before. Utley offered a glimpse inside his own routine for spring training. And the day someone actually beat him to the ballpark. It was Halladay at 5:45 a.m.\" I heard a lot of good things about Roy prior to actually meeting him. Going back to the Instagram post that I put out [Tuesday], I thought I was a guy that got to the ballpark early to get a bunch of work done before the day really started, \"Utley said .\" I walked in, I think I was with Brian Schneider at the time, and Roy was sitting there in his workout gear, almost finished with breakfast, he was soaking wet. I assumed he had worked out, but I made a joke, \"Hey, man, was it raining when you walked into the ballpark?' He kind of looked at me, laughed [and said],\" No, I just finished my workout .' That's something that I'll never forget about him. Right then and there, I knew what he was all about--all the rumors, all the stories that I heard about him prior to that, I knew they were all real. \"Halladay captured the hearts of Philadelphia. A blue-collar city could tip its cap to a player with such dedication and determination. Utley said those traits resonated with his teammates, as well .\" He was obviously an important part of our ballclub and he rubbed guys the right way, he made guys around him better, he was the best pitcher in all of baseball, \"Utley said .\" Our pitching staff, even our position players, kind of watched what he did in between starts and I think a lot of them implemented that into what they did on a daily basis. Guys gravitated towards him. \"What he did, in the era that he did it, is truly remarkable. There's a reason he was so good. Obviously everyone is talking about how hard he worked between starts, and it was no joke. He was getting after it and it motivated me, it motivated a lot of guys to try to become the best player you could be. And he got the most out of everything .\" He was a once-in-a-lifetime player to be honest with you. \"Utley got a taste of it one steamy day in Chicago's Friendly Confines, where he was baptized with Halladay's unmatched intensity .\" I remember a game we were playing in Wrigley Field. And for some reason that day, it felt like it was 1,000 degrees on the field. There was no breeze, it was probably 105 degrees, but the heat index must have been much higher, \"Utley said .\" And he was working. As we all know, he was working hard out on the mound. \"I remember thinking,\" OK, he's working hard, it's super hot out here, I'm going to go to the mound and maybe give him a breather .' So I go to the mound, I think I pretend like I'm tying my shoes and he looked at me with like this evil look. I knew right then and there, he didn't need a break, he didn't need to take any time off. He wanted to get back to pitching, so I learned my lesson at that point to not bother him when he's doing his thing on the mound. \"That's because Halladay was as fierce as any when it came to winning. Utley mentioned the decisive Game 5 of the 2011 NLDS against the Cardinals. Halladay allowed a leadoff triple to Rafael Furcal, who a moment later scored what turned out to be the game's only run. Halladay finished with eight innings of one-run ball and seven strikeouts. The Phillies lost, 1-0, and the 102-win season was over way too early. Still, Utley looks back on that night in amazement of Halladay .\" You knew looking into his eyes after they scored that one run, that they were not going to score another run, \"Utley said .\" And they didn't. Unfortunately we were not able to squeeze a run across, but I remember him just sitting in the locker room after the game, as we all were disappointed. At that point, I just said, \"Doc, you did everything you could do, you need to hold your head high .' I think that picked him up a little bit, but he was all about winning, that's what he wanted to do on a daily basis .\" He accomplished plenty in Philadelphia. The perfect game, the postseason no-hitter, the 2010 NL Cy Young, the franchise-record 102 victories. All with class. \"One thing that I took from him was obviously he was a great pitcher, he had so much success with the Phillies, but after every game he pitched well, which was pretty much the majority of all of them, he would always kind of deflect the attention to somebody else as far as,\" Chooch (<mark>Carlos Ruiz</mark>) called a great game, Ryan Howard had the big home run, Jayson Werth made a great play in the outfield,' \"Utley said .\" That right there showed me what kind of person he was--he wasn't about himself, he was about the team and he was definitely all about winning. \"And, he somehow made a guy like Utley want to work even harder. Remembering Roy Halladay, who died Tuesday at the age of 40 after his plane crashed in the Gulf of Mexico. Cole Hamels looked up to Roy Halladay. The 6-foot-6 frame, the unrivaled work ethic, the mastery of his craft. Hamels saw it all. But he also appreciated something else in Halladay. Fatherhood. As he marveled at the qualities of his old teammate and friend just hours after learning Halladay had died in a plane crash, Hamels' voice grew shaky when family came to mind. (see story) Halladay was a loving father of two sons, Ryan and Braden. (see story) And that's what Hamels admired, what he learned and what he aspires to be, just as much as emulating the machine on the mound. When remembering Halladay on the tragic Tuesday, Hamels thought of his own sons, Braxton and Caleb .\" Now, I have two boys of my own, \"Hamels said .\" And I got to see what that meant to him every time he was able to bring them (Ryan and Braden) around the ballpark. That was something that really did leave an impression. Hopefully I'll be able to do what he was able to do for his boys. \"Halladay, already established and revered as one of the game's best pitchers, came to the Phillies in 2010. Hamels was recovering from a disastrous season in which he went from 2008 World Series MVP to career lows and mental exhaustion in 2009. Hamels, only 26 at the time, found a mentor in the 33-year-old\" Doc. \"Through example and experience, Halladay molded the skinny lefty from California. He exemplified the importance of approach and preparation. Hamels even recalls watching Halladay's tendencies when the big righty was with the Toronto Blue Jays in spring training, before he ever joined the Phillies in that transformational 2010 .\" In order to be great at something, you have to have mentors. You have to have great mentors, and he was one for me, \"Hamels said .\" I watched from afar with being here and him being in Dunedin for the Blue Jays, we got to see him pitch. Seeing him pitch in spring training and then watching him during the season, he was the greatest of that decade. He was the greatest pitcher. You wanted to watch him, see how he attacked hitters, what was he doing different that everybody else wasn't, why was he so great? \"And then to finally play catch with him and see that he had a purpose. Behind everything that he did, he had a purpose. And I think you come to realize that you have very small, short moments in life to be able to do something great, so you have to maximize it, you have to make the best of it--and he did .\" At times, Hamels felt like a kid watching in awe from the stands. \"A lot of us grew up watching Roy Halladay play. I was fortunate to be able to sit in the dugout and share a locker with him for some of the best years I've had,\" Hamels said. \"He's really given me such a way to perceive and to look at baseball and to try to improve and be the best at what I do. He was a man of few words, but you just sat back and you just watched him, you watched what he did, his work ethic was second to none. I mean, you couldn't beat him to the ballpark, and if you did, you were going to lose from there on out .\" You didn't miss those moments when he pitched. Baseball can be a long, grueling season, but when you had Roy Halladay on the mound, you didn't miss an inning, you didn't miss a pitch, you were watching every moment. And I know those are kind of the moments when you're playing this game and you look up in the stands, and there are people there to watch you and watch you perform--I was one of those people. I obviously had a closer seat and got to kind of talk to him a bit in between innings, but I was there to watch him perform. He raised my bar, he raised the game for me. \"He was also influential in developing Hamels' new, difference-making two-seam fastball .\" There was always times when I would be throwing it and it wouldn't be working very well, and I'd ask him and he would just tell me where to put the fingers, the placement and then obviously where to envision where to release it, \"Hamels said .\" He really did help me out with introducing that pitch. \"Hamels and Halladay remained close once the latter retired in December 2013. Hamels said their families had vacationed together and he would frequently text with Halladay throughout the busy baseball season. And Hamels knew well of his buddy's passion for flying planes .\" Knowing that his father was a pilot, I think that was right there, \"Hamels said .\" You look up to your dad always. \"Hamels looked up to Halladay. Not just the pitcher, but the father, too .\" We play this game and we love every minute of it, and then, it is over, \"Hamels said .\" And then you get to go to your family and spend time with your family. To see that it's cut short for somebody that was such a good, good person, to him and his wife Brandy, it's hard to think about what's really going to transpire. He means a lot to all of us and we're really, really going to miss him. \"", "articleID": "2017111001_00406697_W", "names": {"Carlos Ruiz": ["Q21555320", "Q441052", "Q475730", "Q5042595", "Q5042597", "Q54555383", "Q55281068", "Q9697328"]}}, {"date": "2017-11-10", "url": "http://www.houstonchronicle.com/sports/cougars/article/Rob-Gray-Houston-set-to-open-season-against-12346288.php", "content": "<mark>Rob Gray</mark>, Houston set to open season against McNeese State Top scorer works on getting more assists this year By Joseph Duarte, Houston Chronicle November 9, 2017 Photo: Yi-Chin Lee, Staff Houston guard <mark>Rob Gray</mark> led the American Athletic Conference with 20.6 points per game last season. In a moment of levity, <mark>Rob Gray</mark> was asked about hairstyle, more precisely how he plans to wear his early in the season. Go with the curly, flowing locks? Or wear it in a Samurai-style bun? \"It's starting to get annoying because it's getting in my face a lot, so I might have to start wearing it up more,\" <mark>Gray</mark> said. \"I don't put much thought into it. Just how I feel .\" Hair isn't the only new look <mark>Gray</mark> will introduce. A senior guard for the University of Houston, <mark>Gray</mark> has proven he can score. Now, entering his final season, he's embracing a new role: passer. More Information With construction underway on a modernized basketball arena, the University of Houston will play its home schedule this season just a few blocks away. The Cougars will play 13 of 15 home games at Texas Southern's H & PE Arena. The only exceptions are Jan. 20 against Wichita State and March 4 against Connecticut, which are likely to be played at Toyota Center. \"If this is what we have to do to get a brand-new arena, I'd go play on an out-door court in the rain,\" coach Kelvin Sampson said. The $60 million Fertitta Center is set to open for the 2018-19 season. \"Scoring (has been) a strong point in my game that I feel the other team's scouting report will definitely have a target on me,\" said <mark>Gray</mark>, who is among the nation's top returning scorers. \"Like coach (Kelvin) Sampson said, this year my role is different. I don't have to score 20 points a game, maybe, for us to win. Maybe I'll get 10 assists instead .\" As the Cougars begin the season at 7 p.m. Friday against McNeese State at Texas Southern's H & PE Arena, Sampson has a roster that, even with the loss of NBA draft pick Damyean Dotson, is deep enough to take some of the scoring load off the 6-1 <mark>Gray</mark>. Depth a strength For starters, UH has more options in the post, a healthy <mark>Devin Davis</mark> and a deep backcourt that should be among the strengths as the Cougars look to build off consecutive NIT appearances and snap a seven-year NCAA Tournament drought. \"A lot more guys around him that can score,\" Sampson said. \"There were a couple positions (last season) we couldn't score at that limited us .\" As one of the Cougars' primary scorers, along with Dotson, <mark>Gray</mark> led the American Athletic Conference with 20.6 points per game. He was also second on the team with 91 assists and 63 3-pointers. In Sunday's final exhibition against Angelo State, <mark>Gray</mark> went nearly six minutes without attempting a shot and finished with eight points, five assists and four rebounds. \"I have other guys around me and I just have to be a great decision-maker and make the right decision whether it's to shoot or pass,\" said <mark>Gray</mark>, who is tied for ninth among returning scorers. For as much as <mark>Gray</mark> has accomplished on the court, a transformation off the court has been equally noticeable. During his first season in 2015, <mark>Gray</mark> was benched for one game for what he described as \"some things I had to learn .\" \"When I first got here I just wanted to explore the city and just meet new people and have fun at the University of Houston,\" <mark>Gray</mark> said. \"Now I'm more focused on my goals. I'm about to graduate in December. I'm just trying to wrap up my college career on the right path and make the most of it while I have the opportunity .\" Translator Any type of bowl a success for UT this season Upon <mark>Gray</mark>'s arrival, Sampson said the talented guard's \"beat was to a little bit different drummer .\" \"He was listening to a drummer somewhere, but it wasn't necessarily in our band,\" Sampson said. \"It was another stage over there that was playing reggae and we were over here playing golden oldies. I said,\" <mark>Rob</mark>, here's our drummer dude. Listen to our drummer .' \"Following Dotson A sign of how much progress <mark>Gray</mark> has made was evident recently when Sampson invited a guest speaker on leadership. Afterward, Sampson and <mark>Gray</mark> spent 20 minutes exchanging text messages .\" About what he learned and how he can apply it to our team, \"Sampson said .\" I think more than anything that shows his maturity. <mark>Rob</mark> has really developed. \"After being roommates with Dotson, <mark>Gray</mark> also has hopes of following in his footsteps and landing in the NBA .\" It just shows you that it's a reality now, not so much a dream, \"<mark>Gray</mark> said .\" It gives you a purpose every day when you wake up and get ready for practice. You know you're doing it for a reason. \"", "articleID": "2017111002_00416619_W", "names": {"Devin Davis": ["Q3392563", "Q5267485"], "Rob Gray": ["Q55631792", "Q7340165"]}}, {"date": "2017-11-13", "url": "http://www.santafenewmexican.com/news/longtime-queen-of-tabloid-gossip-columns-dies/article_5d806960-9023-5164-9b12-e2d722331f32.html", "content": "<mark>Liz Smith</mark>, the longtime queen of New York's tabloid gossip columns, who for more than three decades chronicled little triumphs and trespasses in the soap-opera lives of the rich, the famous and the merely beautiful, died Sunday at her home in Manhattan. She was 94. Her friend and literary agent, Joni Evans, confirmed her death. From hardscrabble nights writing snippets for a Hearst newspaper in the 1950s to golden afternoons at Le Cirque with Sinatra or Hepburn and tête-à-tête dinners with Madonna to gather material for columns that ran six days a week, <mark>Smith</mark> captivated millions with her tattletale chitchat and, over time, ascended to fame and wealth that rivaled those of the celebrities she covered. A self-effacing, good-natured, vivacious Texan who professed to be awed by celebrities, <mark>Smith</mark> was the antithesis of the brutal columnist J.J. Hunsecker in Clifford Odets and Ernest Lehman's screenplay for Sweet Smell of Success, which portrayed sinister power games in a seamy world of press agents and nightclubs. Her column, called simply \"<mark>Liz Smith</mark>,\" ran in The New York Daily News from 1976-91; in New York Newsday from 1991-995, when that newspaper closed; continued in Newsday until 2005 and, with some overlap, in The New York Post from 1995-2009--a 33-year run that morphed onto the internet in the New York Social Diary. She was not an exceptional writer or reporter, although there were occasional scoops--the 1990 split of Donald and Ivana Trump, Madonna's 1996 pregnancy--but her income often exceeded $1 million a year, more than any newspaper columnist or executive editor. Her style was not the intimidating jugular attack of columnists who expose intimacies or misdeeds in the private lives of public figures, thriving on Schadenfreude and sometimes damaging reputations. Nor, for the sake of a titillating item, did she seize upon ugly rumors or tasteless embarrassments. And gossip was hardly the only ingredient of her columns, which were sprinkled with notes on books or films, bits of political commentary and opinions about actors, authors and other notables. But journalism's watchdogs accused her, with some justification, of conflicts of interest, of lacking objectivity and distance from those she wrote about. \"It's a valid criticism, I suppose,\" <mark>Smith</mark> said in a 1991 interview with The New York Times. Mary <mark>Elizabeth Smith</mark> was born in Fort Worth, Texas, on Feb. 2, 1923, daughter of Sloan and Sarah McCall <mark>Smith</mark>. Her father was a cotton broker whose gambling problems and fading income during the Great Depression forced the family to sell their home and move. After high school, she attended Hardin-Simmons University, a Baptist-affiliated college in Abilene, and met George E. Beeman, whom she married and divorced. She leaves no immediate survivors.", "articleID": "2017111302_00075735_W", "names": {"Elizabeth Smith": ["Q1331318", "Q28530491", "Q43391751", "Q43393828", "Q43394133", "Q43395523", "Q43395873", "Q43396043", "Q55761719", "Q56535801", "Q644208"], "Liz Smith": ["Q27517406", "Q291438", "Q644208", "Q6660303"]}}, {"date": "2017-11-13", "url": "http://www.woodstocksentinelreview.com/2017/11/12/ontarios-lieutenant-governor-elizabeth-dowdeswell-visited-the-4-h-oxford-showcase-friday", "content": "Ontario's Lieutenant Governor Elizabeth Dowdeswell visited the 4-H Oxford showcase Friday By Greg Colgan, Sentinel-Review Sunday, November 12, 2017 9:28:43 EST PM Lieutenant Governor of Ontario Elizabeth Dowdeswell spoke to a crowd of more than 100 during a Oxford 4-H Showcase in Woodstock, Ont. on Friday November 10, 2017 at the Oxford Auditorium. Greg Colgan/Woodstock Sentinel-Review/Postmedia Network Tweet Change text size for the story Print Report an error WOODSTOCK - Ontario's Lieutenant Governor Elizabeth Dowdeswell visited Woodstock Friday evening. The province's 39th representative of the United Kingdom and the Commonwealth - the 29th since Canadian confederation in 1867 - spoke for 15 minutes to the crowd of more than 100 people at Oxford Auditorium during the 4-H Oxford showcase. In her speech, she emphasized the role 4-H played during her youth in helping teach her life lessons she continues to use in her role as Lieutenant Governor. \"I think it's a very big moment for the kids to see, especially having someone of that stature explain how 4-H has helped them,\" 4-H Oxford chair Dwight Hargreaves said. \"People are always looking for work and if you mention 4-H in your interview, that can help because they know the value 4-H has instilled in their members .\" Dowdeswell has travelled much of Ontario since being appointed Lieutenant Governor in 2014. She discussed the theme of sustainability as well as visiting towns and cities throughout Ontario to listen to their concerns, but also what makes them proud of their communities. Following her speech, Dowdeswell mingled with 4-H Oxford members and visited the different stations that had been set up to showcase information on 4-H and projects it's members had completed. The process of getting Dowdeswell to visit Woodstock began several months ago when 4-H Oxford volunteer <mark>Katherine Grieve</mark> saw her speak on a TV news show. During the interview, Dowdeswell mentioned how 4-H had helped her when she grew up in rural Saskatchewan after emigrating from Northern Ireland with her family at a young age. After <mark>Grieve</mark> submitted an application for Dowdeswell to speak in Oxford, they were able to set a date to coincide with the 4-H Oxford showcase. 4-H is a worldwide youth organization focusing on helping to develop youth between six and 21. The four H's stand for head, heart, hands and health. 4-H Oxford has more than 200 members and more than 50 volunteers. \"It's a youth focused evening and we wanted to hear the impact 4-H has had on Her Honours (Dowdeswell) life with her experiences,\" <mark>Grieve</mark> said. The Lieutenant Governor position is a viceroy representative of Canada's head of state, Queen Elizabeth II. The rest of the evening featured square dancing, collecting donations for Farm Credit Canada Drive Away Hunger campaign and viewing of several displays spread throughout the Oxford Auditorium. Members of 4-H Oxford were also presented with awards for completion of projects. \"I hope it empowers them,\" <mark>Grieve</mark> said of what she hopes members take away from hearing Dowdeswell speak. \"It's interesting to hear how it helped prepare her. In our 4-H projects we help the youth learn public speaking, parliamentary procedure, judging or critical thinking skills. We work that in so our members become confident and make judgements from buying groceries to doing their job .\" To have someone of Her Honours stature visit and share her time is a privilege and one the youth can learn from, \"she added. gcolgan @ postmedia.com twitter.com/GregatWSR", "articleID": "2017111302_00561886_W", "names": {"Katherine Grieve": ["Q43392914", "Q43393914"]}}, {"date": "2017-11-13", "url": "http://www.ibtimes.sg/k-pop-band-got7-member-jackson-wangs-presence-mtv-ema-2017-makes-everyone-go-gaga-over-him-19867", "content": "Jackson Wang Instagram The 2017 MTV EMAs hosted by the dazzling \"Your Song\" singer Rita Ora, held at the SSE Arena in Wembley, London on November 12, had lots of eye-catching moments. One of the major highlights of the show was the presence of K-pop member GOT7 member Jackson Wang, who attended the awards show as the official ambassador of Greater China. Soon the social media is abuzz with questions enquiring about this mysteriously handsome guy. Jackson with his good looks and awesome personality has surely left a mark in the minds of people all around the world not failing to show his importance in his debut presence at the 2017 MTA EMAs. Jackson was seen standing next to British star Liam Payne when host Rita was interviewing the former. People all over the world have created a frenzy on Twitter over his presence. Check out their tweets: who is jackson wang bcs he's cute as hell? #MTVEMA--Lizzyrart (@ lizzy_roberts_) November 12, 2017 Okay can someone please send me some hot ass pics of that cute asian who was next to Liam this isn't enough for me #MTVEMA--Gazal (@ Artflavoredsoul) November 12, 2017 Aww Jackson was so nice to us man, we didn't even have time to see him and he quickly came to us, I cried after?? #MTVEMA #Jacksonwanginlondon pic.twitter.com/7MIWd2juVm--Latifah (@ LatifahDankwa) November 13, 2017 \"The hot asian guy beside Liam\" aka Jackson Wang hands down owned the MTV EMAs 2017. I'm so proud of this bb #MTVEMA pic.twitter.com/EsjVNNSfVG--Jea? (@ maneniiiiiiiii) November 13, 2017 I come to twitter to everyone asking \"who's the hot Asian guy next to Liam\" his name is Jackson Wang? #MTVEMA pic.twitter.com/DdglgTO3wq--edniaris? (@ seojohnny_) November 12, 2017 I literally can't breathe...jackson is absolutely gorgeous pic.twitter.com/m38c6wkKGn--londonson (@ sseunah) November 13, 2017 So who's exactly Jackson Wang? Born in Hong-Kong, Wang is singer, rapper, dancer and member of famous K-pop band Got7. He made his debut through the group's 2014 single \"Frozen in Time\". The band is popular for its hit songs like Fly, Hard, Girls Girls Girls, Stop Stop it, A and I Like You. JYP Entertainment took Jackson in 2011 when he signed the production house's talent program in the summer of the same year. He rose to stardom as a member of the boy group GOT7. The top winners of the night included Shawn Mendes (Best Artiste), Coldplay (Best Rock), Eminem (Best Hip Hop), Fifth Harmony (Best US Act) and Camilla Cabello (Best Pop). Moreover, kudos to Jackson on hitting another Jackpot, said one of his fans, who tweeted saying, \"look at this #mtvema impact jacks gained 10k followers on Instagram in one day akssjsjaja .\" look at this #mtvema impact jacks gained 10k followers on instagram in one day akssjsjaja pic.twitter.com/sJFXgzsGjx--londonson (@ sseunah) November 13, 2017 Check out GOT7 Jackson Wang speaking English at MTV EMA 2017: Related BTS members tweet in celebration of their official account crossing 10m followers on Twitter Picture of Song Joong ki, Song Hye Kyo showing off director <mark>John Woo</mark>'s wedding gift breaks internet From Song Hye Kyo to Park Shin Hye: Check out 6 naturally beautiful South Korean actresses without plastic surgery Kim Hee Sun, YoonA join Asia Artist Awards 2017 lineup Related BTS members tweet in celebration of their official account crossing 10m followers on Twitter Picture of Song Joong ki, Song Hye Kyo showing off director <mark>John Woo</mark>'s wedding gift breaks internet From Song Hye Kyo to Park Shin Hye: Check out 6 naturally beautiful South Korean actresses without plastic surgery Kim Hee Sun, YoonA join Asia Artist Awards 2017 lineup", "articleID": "2017111310_00297922_W", "names": {"John Woo": ["Q16887100", "Q55432"]}}, {"date": "2017-11-13", "url": "https://sg.finance.yahoo.com/news/latest-trump-tweets-suggestion-gop-tax-bill-153051901--finance.html", "content": "View photos House Ways and Means Committee Chairman <mark>Kevin Brady</mark>, R-Texas, left, joined by Rep. <mark>Richard Neal</mark>, D-Mass ., the ranking member, and Rep. Sander Levin, D-Mich ., offers his manager's amendment as the GOP tax bill debate enters the final stage, on Capitol Hill in Washington, Thursday, Nov. 9, 2017. (AP Photo/J. Scott Applewhite) More WASHINGTON (AP)--The Latest on tax legislation (all times local): 11:30 a.m. Congressional analysts are estimating that the Republican Senate tax bill would increase taxes in 2019 for some 13.8 million U.S. households earning less than $200,000 a year. The nonpartisan Joint Committee on Taxation provided the analysis Monday as the Senate's tax-writing committee begins work on its version of the tax overhaul bill. The legislation, promoted as a boon to the middle class, would steeply cut corporate taxes, double the standard deduction, and limit or repeal completely the federal deduction for state and local property and income taxes. The analysis of the Senate plan says 13.8 million households, or about 10 percent of all taxpayers, would face a tax increase of $100 to $500 in 2019. There also would be increases greater than $500 for a number of taxpayers, especially those with incomes between $75,000 and $200,000. By 2025, 21.4 million households would have tax increases. ___ 10:15 a.m. President Donald Trump is calling on Republican lawmakers to get more aggressive with their tax proposals. In a tweet Monday, Trump says the GOP should repeal \"the unfair & highly unpopular\" individual mandate in the Affordable Care Act as part of the tax legislation, and to reduce taxes \"even further .\" Trump tweets: \"Cut top rate to 35% w/all of the rest going to middle income cuts?\" Neither the House or Senate tax bills includes a repeal of the individual mandate, with lawmakers saying it would make their signature legislative promise all the more difficult to approve. Both versions of the tax plan cut the top individual rate, but the Senate version only lowers it to 38.5 percent. ___ 3:50 a.m.. The chairman of the House's tax-writing committee is expressing confidence that his chamber won't go along with the Senate's proposal to eliminate the deduction for property taxes. The GOP is moving urgently on the first rewrite of the U.S. tax code in three decades, but key differences promise to complicate the effort. The House bill allows homeowners to deduct up to $10,000 in property taxes while the Senate proposal eliminates the entire deduction. The deduction is particularly important to residents in states with high property values or tax rates. Rep. <mark>Kevin Brady</mark>, chairman of the House Ways and Means Committee, says he worked with lawmakers in those states to ensure the House bill delivers relief. The Senate's tax-writing committee will wade through its newly unveiled measure starting Monday.", "articleID": "2017111316_00834961_W", "names": {"Kevin Brady": ["Q472241", "Q6395881"]}}]