[{"date": "2017-11-13", "url": "https://sg.finance.yahoo.com/news/latest-trump-tweets-suggestion-gop-tax-bill-153051901--finance.html", "content": "View photos House Ways and Means Committee Chairman <mark>Kevin Brady</mark>, R-Texas, left, joined by Rep. <mark>Richard Neal</mark>, D-Mass ., the ranking member, and Rep. Sander Levin, D-Mich ., offers his manager's amendment as the GOP tax bill debate enters the final stage, on Capitol Hill in Washington, Thursday, Nov. 9, 2017. (AP Photo/J. Scott Applewhite) More WASHINGTON (AP)--The Latest on tax legislation (all times local): 11:30 a.m. Congressional analysts are estimating that the Republican Senate tax bill would increase taxes in 2019 for some 13.8 million U.S. households earning less than $200,000 a year. The nonpartisan Joint Committee on Taxation provided the analysis Monday as the Senate's tax-writing committee begins work on its version of the tax overhaul bill. The legislation, promoted as a boon to the middle class, would steeply cut corporate taxes, double the standard deduction, and limit or repeal completely the federal deduction for state and local property and income taxes. The analysis of the Senate plan says 13.8 million households, or about 10 percent of all taxpayers, would face a tax increase of $100 to $500 in 2019. There also would be increases greater than $500 for a number of taxpayers, especially those with incomes between $75,000 and $200,000. By 2025, 21.4 million households would have tax increases. ___ 10:15 a.m. President Donald Trump is calling on Republican lawmakers to get more aggressive with their tax proposals. In a tweet Monday, Trump says the GOP should repeal \"the unfair & highly unpopular\" individual mandate in the Affordable Care Act as part of the tax legislation, and to reduce taxes \"even further .\" Trump tweets: \"Cut top rate to 35% w/all of the rest going to middle income cuts?\" Neither the House or Senate tax bills includes a repeal of the individual mandate, with lawmakers saying it would make their signature legislative promise all the more difficult to approve. Both versions of the tax plan cut the top individual rate, but the Senate version only lowers it to 38.5 percent. ___ 3:50 a.m.. The chairman of the House's tax-writing committee is expressing confidence that his chamber won't go along with the Senate's proposal to eliminate the deduction for property taxes. The GOP is moving urgently on the first rewrite of the U.S. tax code in three decades, but key differences promise to complicate the effort. The House bill allows homeowners to deduct up to $10,000 in property taxes while the Senate proposal eliminates the entire deduction. The deduction is particularly important to residents in states with high property values or tax rates. Rep. <mark>Kevin Brady</mark>, chairman of the House Ways and Means Committee, says he worked with lawmakers in those states to ensure the House bill delivers relief. The Senate's tax-writing committee will wade through its newly unveiled measure starting Monday.", "articleID": "2017111316_00834961_W", "names": {"Richard Neal": ["Q1464697", "Q7328011"]}}, {"date": "2017-11-14", "url": "http://open.salon.com/2017/11/14/newspapers-should-stop-endorsing-candidates_partner/", "content": "(Credit: Shutterstock/Salon) Why newspapers should stop endorsing candidates Ralph Northam, Democrat of Virginia, has cruised to a victory even though Virginia newspapers didn't endorse him Jeff South, The Conversation 2017-11-14T11:00:05 Z • 2017-11-14T11:00:05 Z • 0 Comments 0 Comments This piece originally appeared on The Conversation. Ralph Northam, a folksy Democrat from the Eastern Shore, beat out <mark>Ed Gillespie</mark>, former chairman of the Republican National Committee, in Virginia's heated gubernatorial race. Northam's victory was remarkably comfortable. He won with 54 percent of the vote. His opponent, a Washington lobbyist who sought to distance himself from President Donald Trump, received 45 percent. But you would have predicted just the opposite if you had been following newspaper endorsements in Virginia leading up to Election Day. I'm a journalism professor, so I was closely following the media's engagement in this election. And over the past month or so, I observed with interest as most of Virginia's newspapers favored <mark>Gillespie</mark> over Northam, a pediatric neurologist who served six years as a Virginia state senator and four as the state's lieutenant governor. Who got it wrong The Richmond Times-Dispatch, in an Oct. 27 editorial, for example, praised <mark>Gillespie</mark> for running \"an energetic, inclusive, moderate-conservative, solutions-oriented campaign .\" In a swipe at Northam, the paper said <mark>Gillespie</mark> \"knows, unlike most Democrats, that more government spending is not the cure for all that ails society .\" Newspapers in Roanoke, Fredericksburg, Winchester, Harrisonburg, Lynchburg and Halifax also urged readers to vote for <mark>Gillespie</mark>. One week later, in early November, the editorial board of the Daily Progress, Charlottesville's local paper, opined that because Republicans also control Virginia's General Assembly, \"we believe <mark>Ed Gillespie</mark> has the best chance of leading Virginia to a brighter economic future .\" The editors of The Free Lance-Star in Fredericksburg agreed. \"Unlike his Democratic rival, Lt. Gov. Ralph Northam, <mark>Gillespie</mark> is not in favor of expanding Medicaid,\" they asserted just days before Northam would go on to win Virginia, a Republican stronghold turned swing state. In the end, Northam received endorsements from only three newspapers: The Virginian-Pilot, in Norfolk, where he now lives; the Daily Press of nearby Newport News; and the Washington Post. Credibility problem As Northam cruised to his nine-point victory over <mark>Gillespie</mark>, I couldn't help but think that maybe it's time for newspapers to stop telling their dwindling number of subscribers how to vote. News organizations already have a credibility problem: Polls show that only 13 percent of Americans trust their local paper \"a lot .\" And while journalists swear there's a wall between the editorial staff that endorses candidates and the reporters who write the news, many readers are skeptical: They suspect that a newspaper's endorsement influences what should be objective coverage. In my opinion, getting out of the endorsement game would help newspapers regain trust, fend off charges of bias and show respect for the public's decision-making abilities. Some opt out Some news organizations are starting to recognize this. In the runup to the gubernatorial election, the editorial board of the Martinsville Bulletin wrote that the newspaper wouldn't be making endorsements in state or local races: \"It's not for a lack of interest. It's that we truly do not feel it's our job to tell any of you who to vote for .\" The Martinsville Bulletin, which serves communities along Virginia's border with North Carolina, questioned the point of endorsements: A person or organization announces who they support, with the implication everyone else should follow suit. We see that as tricky for a news organization, where the goal is to be objective. If we do a piece on candidate X, but we've endorsed candidate Y, how can you be expected to trust it? That's a valiant acknowledgment from a small-town paper, but newspaper endorsements--no matter their credibility or weight--won't be easy to extirpate. They have a very long history in the United States. During the presidential election of 1860, for example, the editorial page of The New York Times announced its support for \"Mr. Lincoln, of Illinois, familiarly known as\" Old Abe,' age 51, height six feet seven, by profession Rail-Splitter. \"Abraham Lincoln won that election, of course. But overall, newspaper endorsements have had mixed results in influencing voters or forecasting election outcomes. Most papers, for instance, endorsed Hillary Clinton over Trump last fall--and were soundly repudiated at the polls. Bad for business It's not just arrogant for newspapers to issue endorsements in elections--it may also be financially unwise. Newspapers already face severe economic challenges as they lose readers--and thus advertising--to digital platforms. Readers turned off by an endorsement are likely to seek their news elsewhere. Digital outlets like Slate and BuzzFeed do not endorse candidates. Indeed, in Virginia you could already see signs of readers' rejection of this blatant display of politics in the media. In the comments reacting to the Richmond Times-Dispatch's endorsement of <mark>Gillespie</mark>, one person wrote,\" If the RTD thinks he is a wise choice, I now understand why the RTD is losing readership. \"Not the best move, in the end. Screenshot, Richmond Times Dispatch Many media experts believe that for newspapers to survive, they must position themselves as community forums--platforms for engaging the audience and fostering a dialogue. That means hosting a conversation, not delivering a lecture. By forgoing endorsements, newspapers could better fulfill that role: They would be making a statement that news organizations provide impartial information--and readers should act on it as they see fit. Plus, if Virginia's race is any indication, they're not so great at the endorsement game, anyway.", "articleID": "2017111411_00414016_W", "names": {"Ed Gillespie": ["Q18686352", "Q5334860"]}}, {"date": "2017-11-14", "url": "http://www.chicagonow.com/2017/11/whos-your-daddy/", "content": "Tweet By <mark>Sean Flynn</mark>, Monday at 1:28 pm Everyone needs an example, right? \"Say, See, and Do\" is a common learning strategy used by some educators across the country. This practice is founded on the idea of following the leader. The notion of an example holds so much weight for us as people, even more so as minority men. As a matter of fact, everyone could use it as a point of reference. Needless to say, having a good example before us is vital to our development. So, since we are talking about examples, let's talk about fathers. Fathers represent the first model of a man for boys. It is expected that a male child will imitate or mimic the behavior that was displayed before him. This obviously works whether the situation is positive or negative. What is role modeled before us affects our preferences and decisions. Now place this in a context of moral accountability. If a child grows up without seeing his father display a relationship with God before him, it is plausible that the child will develop a similar preference. Of course, there's a possibility that the child can cultivate a spiritual relationship on his own, independent of what he saw growing up. But I would like to think that those chances are slim. I read a study some years ago that highlighted the fact that black churches are 25% male versus 75% female. Now consider this: a reported 74% of black children grow up in single parent homes where predominately the single parent is typically a woman. Stands to reason why more black males don't go to church or struggle to identify with a male figure of God seeing that their own relationship with their natural father is strained. I am a Christian. To that end, I'm a huge advocate for cultivating the spiritual man inside of me. By developing a personally active relationship with God (who I regard as my spiritual father), I am strengthening my moral accountability. This in turn encourages me to live ethically, leading me ideally to make the right decisions in life. Being a Christian is a lifestyle. Because of my spiritual stance there are certain ideologies that I strive to uphold. Namely for me, that's adhering to the principles of the Bible. This is what helps keep me grounded in life. Consider this: How do I tie a necktie properly if I've never been taught? How will I learn to shave correctly if I've never witnessed anyone do it? Do catch my drift? As time has it, you will learn some things along the way, whether right or wrong. Like plants, we all grow, but the question is will how we grow? My point is--not knowing how to maintain a relationship will affect you. In the case, I'm referring to a spiritual one rather than a natural one. I believe that a lot of men are affected on the inside because they don't know how to have a meaningful relationship with God. Unfortunately, these men seldom cry, lack compassion, show little empathy, usually become bitter, often become angry, in addition to being cold and alone internally. I attribute this to the possibility that they didn't see very many good examples of godly men. Maybe they didn't know any men who prayed or read their Bibles regularly. Maybe they didn't know any men who attempted daily to live out the principles of Christ. Maybe they saw some bad examples that turned them off to the idea of being a Christian male. I don't know for sure, but what I do know is that there is a difference in a man whose heart is filled with joy, has peace of mind, lives with purpose, shows love to many and is truly genuinely happy versus a man who doesn't know God in his heart. Similar to how it's important to know who your natural father is, I see it as just as important to know who your spiritual father is. Now understandably, some may not share the same beliefs in God as I do. I respect that. But for those that do, or are open to the idea, I think it's something to be said for such a meaningful bond. The way you engage God starts with believing who he says he is, the next step is prayer or communicating with him. Also meditating and studying his word, The Bible is an important step in getting to know Him. And lastly, intentionally living out the principles of Christ. These basic practices performed daily make up the foundation to building a meaningful relationship with God. Of course, there is more to this relationship outside of these basic steps. But whatever else you need to know will come organically as a result of your efforts to getting to know God. It is said that \"If you take one step toward him, he will take two toward you\". I am proud to say I know who my (heavenly) father is, even though I don't know my biological father. I wouldn't be the man I am today if not for God's impact on my life. I firmly believe that not only having a personal relationship with God has been beneficial to my life, but it can also be beneficial to yours as well. Meet The Blogger <mark>Sean Flynn</mark> <mark>Sean Flynn</mark> was raised in the West Pullman and Roseland neighborhoods on the Southside of Chicago. The product of a single parent home, Mr. <mark>Flynn</mark> is the youngest of four boys. Besides the harsh life experiences sometimes learned in the streets Mr. <mark>Flynn</mark>'s upbringing consisted of family, friends, school or church. At his core he is a son, brother, husband, father and friend to those who know him. Being a parent for Mr. <mark>Flynn</mark> wasn't just limited to his own children; he became a father figure to other young people whom he came in contact with as well. Having a heart for the troubled youth in Chicago led him into mentorship many years ago. Mr <mark>Flynn</mark>'s experience has included working for Chicago's Lighthouse for the Blind, THe Harris YMCA, Coaching Girls Basketball at Barnard Elementary, Mentoring youth at By The Hand Club for Kids, in addition to being a youth leader at the Joliet Church of God. Mr. <mark>Flynn</mark> has had extensive training in youth development; some of which being S.E.L., Mental Health First Aid, Trauma and De Escalation training. Mr. <mark>Flynn</mark> is a self published author of the book, \"The Manual - From Adolescence to Manhood\". He also facilitates a male mentorship program - Manology 101 for at risk teens in underserved communities in Chicago. Working in the various southside communities is Mr. <mark>Flynn</mark>'s passion. His mission is to shape and mold young minds into the positive leaders their neighborhoods will need in the future. Subscribe by Email", "articleID": "2017111415_00398221_W", "names": {"Sean Flynn": ["Q461502", "Q7441002"]}}, {"date": "2017-11-16", "url": "http://www.tribtown.com/2017/11/16/fire_hits_recycling_center/", "content": "Firefighters from several volunteer fire departments continued to try to put out a blaze Wednesday afternoon that began as a large structure fire more than 12 hours earlier. No one was injured in the fire on the 19-acre site owned by Charlotte W. Helt, who once operated the recycling center with her late husband, Roger W. Helt. Charlotte still lives in a home on the property at 10770 E. County Road 125S. The fire was first reported at the former Helt Enterprises-Recycling site south of Seymour to the Jackson County Sheriff's Department at 10:56 p.m. Tuesday. Firefighters from several departments extinguished the blaze, but it rekindled about two hours later and was still burning Wednesday afternoon. Story continues below gallery 1 of 4 20171116st recycling center fire 02ajp Tribune photo by Aaron Piper / Firefighters respond to a fire at a former private recycling collection site in Jackson County on Wednesday. AARON PIPER | THE TRIBUNE Tribune submitted photo by Hamilton Township Fire Department / Firefighters respond to a fire at a former private recycling collection site in Jackson County on Wednesday. Tribune submitted photo / Firefighters respond to a fire at a former private recycling collection site in Jackson County on Wednesday. Tribune photo by Aaron Piper / Firefighters clean up a fire at a former private recycling collection site in Jackson County on Wednesday. Crothersville-Vernon Township Fire Chief <mark>Ben Spencer</mark> said the cause of the fire remained under investigation Wednesday afternoon. \"We're working closely with the Indiana State Fire Marshal's Office to determine the cause of the fire,\" he said. He said he expected it to burn into the evening. The fire was difficult to extinguish because of the materials involved, which included plastic, tires, pallets and other materials, he said. The water firefighters sprayed on the burning plastic cooled it, which was essentially creating a shield for the flames burning underneath. That's the type of fire that fire officials consider \"deep-seated fires,\" <mark>Spencer</mark> said. One solution <mark>Spencer</mark> and other firefighters were exploring Wednesday afternoon was the use of an excavator to move the piles around so water could reach the flames. \"There are residences nearby, and that's why we're doing what we're doing trying to put this fire out,\" he said. <mark>Spencer</mark> said the fumes from the plastic burning was the primary concern of fire officials, and representatives from the Indiana Department of Environmental Management and Jackson County Health Department were on scene. \"We have a gas meter out to monitor the levels and are looking at that,\" he said, adding the situation seemed to improve as firefighters contained the fire. \"We're seeing a lot of steam now, but when we were first here, it was heavy black smoke .\" The rural site is at the edge of a wooded area, but firefighters were able to stop the fire from spreading to that area. Rainy conditions in the morning and afternoon also helped keep the fire contained. \"It's helped, but it has hampered some of our guys,\" <mark>Spencer</mark> said, adding many had been on site since the fire was first reported. This is not the first fire on the property. A fire was reported in April 2000 when the site still operated. That fire involved similar materials and included one minor injury of an employee. The Seymour Fire Department and Grassy Fork, Jackson-Washington, Brownstown, Redding and Hamilton township volunteer fire departments assisted with the fire.", "articleID": "2017111608_00492452_W", "names": {"Ben Spencer": ["Q15623878", "Q16235043"]}}, {"date": "2017-11-16", "url": "http://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2017/11/16/grumor-mill-full-swing-jon-gruden-ut-vols-coaching-search-unfolds/868121001/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Twitter Google + LinkedIn Pinterest Grumor mill in full swing about Jon Gruden as UT Vols' coaching search unfolds Tennessee finds itself in a football coaching search for the fourth time in the past 10 years, which means the Grumor mill is in full swing. Post to Facebook Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CLOSE Former Tampa Bay Buccaneers head coach Jon Gruden told ESPN's Mike and Mike that he would never rule out a return to coaching but has not engaged in any talks with teams. Time CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Tennessee finds itself in a football coaching search for the fourth time in the past 10 years, which means the Grumor mill is in full swing. Former NFL coach Jon Gruden has been atop the wish list of some Vol fans for many years, so much so that rumors associated with <mark>Gruden</mark> and Tennessee have received their own moniker: Grumors. Former UT players caused a stir on Wednesday with possibly some subtle hints on Twitter. More: UPDATE: UT Vols coaching search: Here's what we know, including Grumors More: Butch Jones' replacement as Tennessee football coach: 15 names from <mark>Gruden</mark> to Gundy More: Why not Jon Gruden? Or Dan Mullen? Or <mark>Scott Frost</mark>? Here is a sample. UT's Hire is better than the Florida Haters! Just watch??!--<mark>Aaron Hayden</mark> (@ Ran4UT) November 16, 2017 <mark>Gruden</mark> update: their is actually strong interest in being our next head coach (confirmed source) and there is a number out there that is around $10 million a year (unconfirmed). JG YOU CAN MAKE TENNESSEE GREAT AGAIN!!! I'm behind you 1,000,000% #VFL--Albert Haynesworth (@ haynesworthiii) November 15, 2017 Thinking about coming out of retirement!???? ‍ ♂ ️???? ‍ ♂ ️???? ‍ ♂ ️ pic.twitter.com/kdGs56vIg3--JJ McCleskey (@ JJMcCleskey) November 15, 2017 Do the Vols have a chance of landing their white whale this year? It's certainly a topic of conversation. <mark>Gruden</mark>, when asked about the Tennessee opening on ESPN's \"Mike & Mike\" on Wednesday morning, said \"You never say never to nothing .\" We couldn't have one last visit with Jon Gruden without addressing the latest \"returning to coaching rumors .\" #Vols pic.twitter.com/arlp9Its7a--Mike & Mike (@ MikeAndMike) November 15, 2017 The Chattanooga Times Free Press, citing sources, reported on Wednesday that <mark>Gruden</mark> has contacted some college assistants to gauge their interest in possibly joining him on a coaching staff. Blackburn says <mark>Gruden</mark> still a viable option to coach Vols, says <mark>Gruden</mark> would listen to offer https: //t.co/xEbEzrQIuT via @ timesfreepress--Stephen Hargis (@ StephenHargis) November 15, 2017 Paul Finebaum, of the SEC Network and ESPN, said on his radio show Tuesday that one source close to <mark>Gruden</mark> told him that <mark>Gruden</mark> is not coming to Tennessee. Are the #Grumors real? @ StephenHargis has a fascinating report that gives <mark>John Gruden</mark> a 50/50 shot of ending up in Knoxville. Listen to the full interview: https: //t.co/odhmlzOIEB https: //t.co/CIWPp5vpVk--Paul Finebaum (@ finebaum) November 16, 2017 Footballscoop.com, which monitors coaching moves, addressed the Grumors on Tuesday with a report that stated \"<mark>Gruden</mark> has no interest in being the next coach at Tennessee .\" Vols athletic director <mark>John Currie</mark> was asked specifically about <mark>Gruden</mark> on Sunday. <mark>Currie</mark> is spearheading the search for Butch Jones' replacement. \"One of the things that's most important for me to do is not add to misinformation, so I will not be making any comments or responses to specific candidates or specific rumors,\" <mark>Currie</mark> said. <mark>Gruden</mark>, who coached in the NFL at Oakland and Tampa Bay, is an ESPN analyst. <mark>Gruden</mark> last coached in 2008. He's been the color analyst for \"Monday Night Football\" since 2009. <mark>Gruden</mark>'s coaching career started as a graduate assistant at Tennessee in the 1980s. <mark>Gruden</mark>'s wife, Cindy, is a native of East Tennessee and a Tennessee alumna. She was a cheerleader at UT. Their son is a current Tennessee student. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE", "articleID": "2017111614_00955849_W", "names": {"Aaron Hayden": ["Q20807778", "Q4662083"], "John Currie": ["Q16241256", "Q43910622", "Q6227942", "Q6227944"], "John Gruden": ["Q365882", "Q6379151"], "Scott Frost": ["Q2018023", "Q7436370"]}}, {"date": "2017-11-17", "url": "http://www.yorkpress.co.uk/news/15667295.From___32_guitar_and_cheap_Electricity_to_The_Punishment_Of_Luxury__the_journey_of_OMD/", "content": "OMD's Andy McCluskey and <mark>Paul Humphreys</mark> 0 comments THE Punishment Of Luxury Tour brings OMD, or Orchestral Manoeuvres In The Dark in old money, to York Barbican on Saturday night. The sold-out 8pm gig forms part of an 18-date autumn tour to back up the September release of OMD's 13th studio album of a career stretching back almost 40 years to when two teenage Kraftwerk fans from the Wirral, Andy McCluskey and <mark>Paul Humphreys</mark>, formed their synth-pop duo. Such OMD albums as 1980's Orchestral Manoeuvres In The Dark, 1981's Architecture And Morality and 1983's Dazzle Ships helped to shape the dominant electronic sound of that decade, alongside The Human League and Tubeway Army's Gary Numan. Now McCluskey and <mark>Humphreys</mark> return with The Punishment Of Luxury, their first studio set since 2013's English Electric, creating a \"daring collection of stylish synth pop and masterful song craft that sees OMD edge out of their comfort zone without compromising their integrity\". \"It's almost like we've gone back to being teenagers after all these years,\" says McCluskey, now 58. \"We just do whatever we want and there's no record company to tell us what we can or can't do .\" Reflective and sanguine in mood, the album was recorded in McCluskey and <mark>Humphreys</mark>' respective studios in Merseyside and London, with the final mixes being handled by both at <mark>Paul</mark>'s place. Their 13th album is \"lucky 13,\" says McCluskey. \"We've taken great care and considerable time to make it a good album, and we're really happy with it. The great thing is that we're back in the place where we were in our very early days in that we're doing it for ourselves. But having said that, you have to be careful not to be self-delusional!\" We're in a good place now, with people praising us, but we don't want to do pale pastiches of what we've done before. By giving yourself time, you can self-edit, and our ethos is to still challenge ourselves, and there's so much on the album that's not the usual \"pop fodder' .\" The Punishment Of Luxury is a progression \"both electronically and in terms of themes on the record,\" says McCluskey. \"I have a collection of notes of what I want to write about but I never write the lyrics first. We always write the music first, then the lyrics, and for this album, for example, some of the tracks have much more crunchy, dirty drums than we've used before .\" Some songs are more sparse than before, using the \"glitch' sound that we've previously discarded: the noises that are normally rejected .\" Now OMD can make such choices where once they were limited by the ultimate limitations. \"When we first began, not only did we not know how to play our instruments, but we didn't actually have any instruments, so it was a voyage of discovery. My left-handed guitar cost £ 32; it was the cheapest in the shop, and though I'm right-handed, I bought it, and I still play it upside down,\" says McCluskey. \"The Selmer Pianotron, of which I've only ever seen one, we had a friend who sold it to us for £ 25, and that's the famous plinky-plonky sound you hear on Electricity .\" Then, after six gigs, we got fed up with borrowing synths, so we bought a micro preset from my mother's mail order catalogue for £ 7 and 76 pence per week for 36 weeks and that was basically the sound of the first album! \"Roll forward all these years and McCluskey says:\" We're blessed to still be able to play concerts, sell lots of tickets and still make interesting records, working hard and being determined that we won't be a grey version of our former selves. \"We started with a fairly radical idea, playing songs on a naive collection of instruments, and it turned out to be a hobby that got out of hand with a crazy name [Orchestral Manoeuvres In The Dark] that we chose when we were only going to do one gig!\" OMD play York Barbican, Saturday, November 18, 8pm; sold out. 0 comments", "articleID": "2017111708_00005979_W", "names": {"Paul Humphreys": ["Q368348", "Q7151427"]}}, {"date": "2017-11-18", "url": "http://heraldscotland.com/opinion/15668612.Alison_Rowat_s_week__billionaires_in_need__no_escaping_blonde_ambition_of_the_Johnsons__high_five_to_one_brave_dog/", "content": "Alison Rowat's week: billionaires in need; no escaping blonde ambition of the Johnsons; high five to one brave dog 0 comments BILLIONAIRES IN NEED AS Christmas approaches there is no shortage of appeals to your charitable instincts. Should you give to this good cause or that, buy one charity's Christmas cards or another's? It's a strain on both principles and wallet. Nevertheless, there is one cause that is exceptional, and so worthy of your immediate attention that you will be ashamed for not thinking of these poor souls before. Yes, it's billionaires. Loading article content The Swiss bank UBS estimates there are 1542 of them in the world. America has the most (563), then China (318) and Germany (117). If you prefer your good causes to be local, the UK has 55. Their plight came to light this week with the sale of Leonardo da Vinci's Salvator Mundi for £ 341 million--the highest price ever paid for a painting. Searching for an explanation as to why anyone would hand over so much, the Today programme turned to Georgina Adam, author of Dark Side of the Boom: The Excesses of the Art Market in the 21st Century (yours for a very reasonable £ 19.99 on Amazon, as owned by Jeff Bezos, the world's number one billionaire). Ms Adam said the market was being fuelled by \"the sheer amount of money that billionaires have\". If you are worth tens of billions, £ 341 million is not a huge chunk out of one's fortune. Suddenly, the plight of billionaires became all too clear. It's supply and demand, innit? There are only so many London townhouses, Manhattan apartments, yachts, diamonds, bottles of rare wine and private islands in the world. Yet the number of folk who want to buy them is increasing in number, and the mountain of money they have to spend is growing by the second. The market cannot meet the demands being placed on it. How could Marx not foresee such a glaring deficiency in the capitalist system? Too busy fretting about class struggle to predict there would one day be billionaires scrambling to find things to spend money on. I jest, of course. Any billionaire worth his or her salt and place in heaven can easily find a home for their money in a good cause, and many do. What the likes of the da Vinci painting, and before that the Paradise Papers leak, make clear, however, is the increasing gulf between the super rich and the rest of us. They don't just live in bigger homes; they might as well be on a different planet. Here on Earth, in the UK to be precise, we are about to have our own ponder about haves and have nots. It's Budget time, when we turn back the political clocks and pretend that the Chancellor of the Exchequer has ability to make huge differences to millions of lives with one speech to the Commons. Yet that has not been the case for some time. Budgets used to be momentous events, now they largely exist as political theatre, an occasion for Westminster to dress up and think of how it used to be. But the days of Jenkins, Healey, Lawson, even Brown and those extra billions for the NHS in his 2000 Budget, are gone. Only accountants, think tanks and the media can get excited about Budgets now. One could blame globalisation, the crash of 2008, or a looming Brexit, but there is also the not inconsiderable problem every Chancellor now faces: the Great British public has become allergic to income tax rises. As with full percentage hikes in the interest rate, an electorate worn down by stagnant pay and rising prices simply won't tolerate being asked to hand over more. Denied the means to bring in the big bucks via income tax, Chancellors are forced to tinker around the margins, nipping here and tucking there. Not every party, of course, agrees that tax rises are taboo. Labour's Shadow Chancellor, <mark>John McDonnell</mark>, said this week he would raise an extra £ 17 billion through taxes to spend on public services. Scotland, the First Minister has promised, is to have its own great debate on tax. Given the outcry in some quarters over the SNP Government's freezing of the 40p threshold, and this week's row over how many Scots were paying more in tax than their counterparts in England, any \"debate\" is going to be of the stairheid variety. Or will Scotland buck the perceived trend on income tax the way it has with minimum pricing for alcohol? In the meantime, prepare for a lot of sound, perhaps even fury, after <mark>Philip Hammond</mark> resumes his seat next Wednesday afternoon. And don't worry. Unless he is getting ready to pull the mother and father of rabbits out of his hat, his Budget will contain nothing to trouble any billionaires on the hunt for that next special something to buy. Small seasonal mercies, eh? GRUMBLE IN THE JUNGLE THERE is something about the Johnson family that reminds me of the old story about Mike and Bernie Winters at the Glasgow Empire. You know the one: Mike comes on stage to a tumbleweed welcome, Bernie joins him, only for someone to shatter the silence with the cry: \"Oh God, there's two of them!\" Except in the case of the Johnsons there are more than two. Among the most prominent are Boris the Foreign Secretary, Jo the Universities Minister, Rachel the columnist, and their father Stanley, whose long list of jobs includes writer and conservationist. Now Stanley is to take part in I'm a Celebrity, Get Me Out of Here!, which starts its annual run tomorrow. For those who have been holed up in an Australian rainforest for the past 15 years, I'm A Celeb is an ITV reality show in which a group of people, many of whom you have never heard, endure all sorts of indignities to win food for their campmates. The 77-year-old is favourite to win, too. One way or another there is just no escaping the blonde ambitions of the Johnsons. HIGH FIVE TO ONE BRAVE DOG HERE'S to Mali, the eight-year-old dog yesterday awarded the PDSA Dickin Medal for his contribution to a British Special Forces assault on a Taliban position in Kabul. The citation says the Belgian Malinois \"displayed outstanding courage in the face of fire\" and there was no doubt that his actions, including searching for explosives, had helped to save lives. Mali was hit by shrapnel during the 2012 assault, but carried on despite his injuries. Taking their name from Maria Dickin, founder of the PDSA, the medals were first handed out in 1943. Over the years they have gone to dogs, cats, horses, pigeons and other creatures. Just as no human knows how they will fare under fire till it happens, so it is hard to imagine our pets in such extreme circumstances. Take a look at that big lump on the sofa (the dog, not your other half), or that little darling who has just stormed through the door demanding her dinner (the cat, not the daughter). Are they the stuff of medal winners? In the eyes of those who love them, too right they are. 0 comments", "articleID": "2017111805_00325423_W", "names": {"John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"]}}]