[{"date": "2017-11-18", "url": "http://heraldscotland.com/opinion/15668612.Alison_Rowat_s_week__billionaires_in_need__no_escaping_blonde_ambition_of_the_Johnsons__high_five_to_one_brave_dog/", "content": "Alison Rowat's week: billionaires in need; no escaping blonde ambition of the Johnsons; high five to one brave dog 0 comments BILLIONAIRES IN NEED AS Christmas approaches there is no shortage of appeals to your charitable instincts. Should you give to this good cause or that, buy one charity's Christmas cards or another's? It's a strain on both principles and wallet. Nevertheless, there is one cause that is exceptional, and so worthy of your immediate attention that you will be ashamed for not thinking of these poor souls before. Yes, it's billionaires. Loading article content The Swiss bank UBS estimates there are 1542 of them in the world. America has the most (563), then China (318) and Germany (117). If you prefer your good causes to be local, the UK has 55. Their plight came to light this week with the sale of Leonardo da Vinci's Salvator Mundi for £ 341 million--the highest price ever paid for a painting. Searching for an explanation as to why anyone would hand over so much, the Today programme turned to Georgina Adam, author of Dark Side of the Boom: The Excesses of the Art Market in the 21st Century (yours for a very reasonable £ 19.99 on Amazon, as owned by Jeff Bezos, the world's number one billionaire). Ms Adam said the market was being fuelled by \"the sheer amount of money that billionaires have\". If you are worth tens of billions, £ 341 million is not a huge chunk out of one's fortune. Suddenly, the plight of billionaires became all too clear. It's supply and demand, innit? There are only so many London townhouses, Manhattan apartments, yachts, diamonds, bottles of rare wine and private islands in the world. Yet the number of folk who want to buy them is increasing in number, and the mountain of money they have to spend is growing by the second. The market cannot meet the demands being placed on it. How could Marx not foresee such a glaring deficiency in the capitalist system? Too busy fretting about class struggle to predict there would one day be billionaires scrambling to find things to spend money on. I jest, of course. Any billionaire worth his or her salt and place in heaven can easily find a home for their money in a good cause, and many do. What the likes of the da Vinci painting, and before that the Paradise Papers leak, make clear, however, is the increasing gulf between the super rich and the rest of us. They don't just live in bigger homes; they might as well be on a different planet. Here on Earth, in the UK to be precise, we are about to have our own ponder about haves and have nots. It's Budget time, when we turn back the political clocks and pretend that the Chancellor of the Exchequer has ability to make huge differences to millions of lives with one speech to the Commons. Yet that has not been the case for some time. Budgets used to be momentous events, now they largely exist as political theatre, an occasion for Westminster to dress up and think of how it used to be. But the days of Jenkins, Healey, Lawson, even Brown and those extra billions for the NHS in his 2000 Budget, are gone. Only accountants, think tanks and the media can get excited about Budgets now. One could blame globalisation, the crash of 2008, or a looming Brexit, but there is also the not inconsiderable problem every Chancellor now faces: the Great British public has become allergic to income tax rises. As with full percentage hikes in the interest rate, an electorate worn down by stagnant pay and rising prices simply won't tolerate being asked to hand over more. Denied the means to bring in the big bucks via income tax, Chancellors are forced to tinker around the margins, nipping here and tucking there. Not every party, of course, agrees that tax rises are taboo. Labour's Shadow Chancellor, <mark>John McDonnell</mark>, said this week he would raise an extra £ 17 billion through taxes to spend on public services. Scotland, the First Minister has promised, is to have its own great debate on tax. Given the outcry in some quarters over the SNP Government's freezing of the 40p threshold, and this week's row over how many Scots were paying more in tax than their counterparts in England, any \"debate\" is going to be of the stairheid variety. Or will Scotland buck the perceived trend on income tax the way it has with minimum pricing for alcohol? In the meantime, prepare for a lot of sound, perhaps even fury, after <mark>Philip Hammond</mark> resumes his seat next Wednesday afternoon. And don't worry. Unless he is getting ready to pull the mother and father of rabbits out of his hat, his Budget will contain nothing to trouble any billionaires on the hunt for that next special something to buy. Small seasonal mercies, eh? GRUMBLE IN THE JUNGLE THERE is something about the Johnson family that reminds me of the old story about Mike and Bernie Winters at the Glasgow Empire. You know the one: Mike comes on stage to a tumbleweed welcome, Bernie joins him, only for someone to shatter the silence with the cry: \"Oh God, there's two of them!\" Except in the case of the Johnsons there are more than two. Among the most prominent are Boris the Foreign Secretary, Jo the Universities Minister, Rachel the columnist, and their father Stanley, whose long list of jobs includes writer and conservationist. Now Stanley is to take part in I'm a Celebrity, Get Me Out of Here!, which starts its annual run tomorrow. For those who have been holed up in an Australian rainforest for the past 15 years, I'm A Celeb is an ITV reality show in which a group of people, many of whom you have never heard, endure all sorts of indignities to win food for their campmates. The 77-year-old is favourite to win, too. One way or another there is just no escaping the blonde ambitions of the Johnsons. HIGH FIVE TO ONE BRAVE DOG HERE'S to Mali, the eight-year-old dog yesterday awarded the PDSA Dickin Medal for his contribution to a British Special Forces assault on a Taliban position in Kabul. The citation says the Belgian Malinois \"displayed outstanding courage in the face of fire\" and there was no doubt that his actions, including searching for explosives, had helped to save lives. Mali was hit by shrapnel during the 2012 assault, but carried on despite his injuries. Taking their name from Maria Dickin, founder of the PDSA, the medals were first handed out in 1943. Over the years they have gone to dogs, cats, horses, pigeons and other creatures. Just as no human knows how they will fare under fire till it happens, so it is hard to imagine our pets in such extreme circumstances. Take a look at that big lump on the sofa (the dog, not your other half), or that little darling who has just stormed through the door demanding her dinner (the cat, not the daughter). Are they the stuff of medal winners? In the eyes of those who love them, too right they are. 0 comments", "articleID": "2017111805_00325423_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}}, {"date": "2017-11-20", "url": "http://www.christianpost.com/news/sc-high-court-rejects-breakaway-dioceses-appeal-to-decision-giving-properties-to-episcopal-church-207208/", "content": "SC High Court Rejects Breakaway Diocese's Appeal to Decision Giving Properties to Episcopal Church Free sign up cp newsletter! Sign up By, Christian Post Reporter | Nov 20, 2017 10:44 AM Michael Gryboski (Photo: Wikimedia Commons) The building of the South Carolina Supreme Court, located in Columbia, South Carolina. The South Carolina Supreme Court has denied a motion by a breakaway diocese to reconsider a decision granting ownership of nearly all of their properties to The Episcopal Church. In a divided decision released Friday, the state's highest court denied a motion from the Episcopal Diocese of South Carolina, with the motion failing to get the necessary majority vote from the judges. \"In light of the above, the petitions for rehearing have failed to recieve a majority vote. Therefore the petitions for rehearing have been denied, and the opinions previously filed in this case reflect the final decision of this Court,\" stated the denial notice. The decision garnered praise from The Episcopal Church in South Carolina, which is the name for those Episcopalians within the diocese who stayed loyal to the national denomination. Expand | Collapse (Photo: Joy Hunter) The Reverend <mark>Mark Lawrence</mark>, bishop of the Protestant Episcopal Diocese of South Carolina, on the steps of Cathedral of St. Luke and St. Paul in Charleston, South Carolina, in April of 2014. In a statement released Sunday, TECSC Bishop Skip Adams expressed thanks for the decision, but also said that \"the hope of reconciliation has been our guiding principle .\" \"We understand that the many people in the parishes affected by this ruling may be experiencing pain, fear and confusion,\" stated Bishop Adams. \"Let me say to all that The Episcopal Church in South Carolina is committed to finding a path that will allow the people of God to continue to live their lives as a part of the Anglican Communion in and through the Episcopal Church .\" In November 2012, the South Carolina Diocese voted to leave the national denomination (The Episcopal Church) due to theological differences and the apparent mistreatment of diocesan bishop the Rev. <mark>Mark Lawrence</mark>. In January 2013, a lawsuit was filed by the breakaway diocesan leadership over the rightful ownership of the name and property of the regional body. The estimated value of the property is $500 million. In August, the state supreme court ruled that nearly all the church properties belonged to the national denomination, overturning a lower court decision from 2015. Acting Justice Costa Pleicones authored the majority opinion, in which he argued that the lower court ruling had an \"error of law\" which produced \"a distorted view of the issues in this case .\" \"I conclude that the present property and church governance disputes are not appropriate for resolution in the civil courts and would reverse the order to the extent it purports to resolve these questions,\" wrote Justice Pleicones. \"Finally, I find the trial court erred in holding that the Respondents' state-registered trademarks prevail over TEC's federally-protected trademarks, and therefore would also reverse that portion of the order .\" Regarding the Friday denial of motion to rehear, the Rev. Canon <mark>Jim Lewis</mark> of the South Carolina Diocese said in a statement released Saturday that he was \"deeply disappointed .\" <mark>Lewis</mark> believed that there were many concerns with how the state court handled the case, which will lead them to consider appealing to the U.S. Supreme Court. \"We believe the number and character of the issues at stake in this ruling merit review by the high court. Because of the long road of litigation that has brought us to this day, all the parties to this case will need to take counsel together before deciding our next steps,\" stated <mark>Lewis</mark>. \"We remain confident that God is at work in even these circumstances to redeem and use them, as He does all things, for His glory and the building up of His Church .\" Free sign up cp newsletter! Sign up Related", "articleID": "2017112016_00754946_W", "names": {"Jim Lewis": ["Q15485791", "Q16731449", "Q3178877", "Q47091330", "Q57243784", "Q6196406", "Q6196408", "Q6196413", "Q6196418"], "Mark Lawrence": ["Q1649595", "Q641046", "Q6768507", "Q6768508", "Q6768509", "Q6768510", "Q6768511", "Q6768512", "Q6768513"]}}, {"date": "2017-11-20", "url": "http://broadwayworld.com/industry/article/Industry-Editor-Exclusive-1984-and-Beyond-How-the-Tony-Awards-Committee-Makes-Their-Determinations-20171120", "content": "Industry Editor Exclusive: 1984 and Beyond - How the Tony Awards Committee Makes Their Determinations Tweet Share Last week, the Tony Awards Administration Committee made news when it declared 1984 ineligible to receive a Tony Award. The decision covered not only the play itself, but everyone who worked on it. What happened? The official statement from the Tony folks was generic: \"1984 has been deemed ineligible by the Tony Awards Administration Committee. The show did not fulfill all of the eligibility requirements, as outlined by the Tony Rules and Regulations .\" News quickly spread that nominator Jose Antonio Vargas, a journalist, had not been invited, breaking the Tony rules which state you have to invite all the nominators and voters. There are 50 nominators, each invited by the press office (which had no comment on the issue). Why the production chose not to invite Vargas is unknown. The New York Times reported 1984 producer Scott Rudin had a beef with Vargas because of the writer's criticism of the film THE SOCIAL NETWORK, which Rudin also produced. That does not make much sense to me because Vargas is not a new nominator, so an issue from 2010 (the year the movie was released) would have impacted him before now. But we don't know the complete truth and we may never know it. We also don't know if Vargas will be invited to Rudin's upcoming shows--and he is a lead producer on at least three more this season--though one would think so. The thing to understand for the future is how these things work. This season there were 50 nominators announced. To give you an idea of how that number has risen in the last decade: for the 2007-2008 season it was 27 and then it started growing. Each season there started to be additional nominators, perhaps because of a desire to diversify the pool. Though surprisingly this season the number is down from last season's tally of 51. Of course not everyone nominates. Every year a certain amount of people back out, sometimes because of conflicts of interest but also often because they failed to see all the shows. Last season nine stepped aside. This season, of the 50 announced, composer/lyricist/orchestrator <mark>Tom Kitt</mark> has already withdrawn because of his involvement in the new musical SPONGEBOB SQUAREPANTS. Producers have to invite the current list of those nominating though. That is what makes this seemingly controversial decision non-controversial: the rules clearly state producers need to invite all nominators and voters. The Administration Committee has great discretion otherwise. Too much in many cases in fact. The Tony Awards Administration Committee is comprised of 24 members, of whom 10 are designated by the Wing, 10 by the League, and one each by the Dramatists Guild, Actors' Equity Association, United Scenic Artists, and the Society of Stage Directors and Choreographers. There are alternates so the number stays consistent if someone is conflicted and has to drop out. These folks determine a ton throughout the season. Scene from 1984. Photo Credit: Julieta Cervantes Usually Tony eligibility goes along with opening night billing. Actors above the title are leads, below featured. However billing doesn't always match with reality. Sometimes star names go above-the-title even when the relevant actor has a small role; other times everyone is below-the-title, even clear leads. A producer must provide the Tony Awards Administration Committee a letter expressing what his/her position is regarding the categorization of productions and potential nominees, whether that letter says simply \"we agree the opening night title page should remain as-is for nominating purposes\" or whether a modification is requested. If a modification is requested, the reasons for this must be spelled out. Then the Administration Committee can do what it wishes. In 2013, I was extremely angry that the Administration Committee chose to make Kristine Nielsen, perennially below-the-title, eligible in the lead actress category without a request from the producers of VANYA AND SONIA AND MASHA AND SPIKE. She would have won featured, but Cicely Tyson was too much competition in lead. On occasion, the Committee goes against the wishes of even powerful producers (SHUFFLE ALONG as new musical, for example) and then sometimes they do perplexing things upon request (for instance Chita Rivera is moved down to featured for the revival of THE MYSTERY OF EDWIN DROOD when that character was considered a lead when the show was on Broadway originally). Last season I was surprised that the Administration Committee confirmed no one from PARAMOUR was a lead, despite it being obvious that there was a male and female lead of that show. And the above is just choices regarding acting. The Administration Committee sets the rules and enforces them more generally. Particularly troubling is the latitude the members are given to decide what is a \"classic\" and therefore eligible as a revival even if it has never been on Broadway before. Also there is a rule that even if a show isn't eligible for various reasons other than that they didn't invite nominators or voters, elements of the production that do not \"substantially duplicate any prior presentation of the play or musical\" can be eligible. So new designers, choreographers, actors and directors are often eligible even if a show is not. There is discretion on what it means to \"substantially duplicate\" though: last season CATS' producers thought Andy Blankenbuehler, whose work was \"based on the original choreography by Gillian Lynne,\" was new enough to garner eligibility, the Administration Committee disagreed. Christopher Gattelli, on the other hand, was nominated for the Lincoln Center revival of THE KING AND I, despite his work being \"based on the original choreography by Jerome Robbins .\" I thought the book of GIGI should be eligible, the Tony Awards folks did not. Eligibility rulings are made throughout the season and each time they come in we read and analyze them within minutes. Sometimes they are demonstrably wrong and reconsiderations are granted - I personally take some credit in Jason Robert Brown getting a Tony nomination for URBAN COWBOY after his work was originally deemed ineligible. But back then there was a precise guideline: over 50% of a score was new, it could be eligible. Now it is more amorphous, with producers self-reporting what percentage of a score is new and the Administration Committee determining eligibility without a set rule. (Although I suspect it is still in practice 50%, nothing has been close enough to test it in recent years .) An appeal and reversal requires more than \"I think you got it wrong .\" In fact, under the rules, technically Administration Committee decisions are not to be changed. So, while it has happened, it's extremely rare. Therefore 1984 will remain ineligible. In a season of few plays, no elements of 1984 will be in contention for any Tonys. As the show is closed, it didn't need to splash those nominations in promotional ads. One must think that the people who could have been nominated would have liked the honor however. Related Articles", "articleID": "2017112017_00433135_W", "names": {"Tom Kitt": ["Q2439786", "Q7816484"]}}, {"date": "2017-11-20", "url": "http://www.mdjonline.com/neighbor_newspapers/north_fulton/news/roswell-mayor-and-city-council-candidates-to-debate-before-runoff/article_69e756ce-ce13-11e7-80c0-7b1423247e8e.html", "content": "Positively Roswell, Roswell NEXT and the Roswell Community Masjid will host a runoff debate with the mayoral and city council candidates at the Roswell Cultural Arts Center on Nov. 28. No candidate earned the majority vote to win outright in the races for Mayor and City Council Posts 3 and 6, resulting in a runoff election scheduled for Dec. 5. Each of the six runoff candidates will answer random questions submitted by the candidates who ran, but did not get elected or make a runoff, as well as questions submitted via a Facebook post. As it works, the top two vote-getters in each race square-off in the runoff election. They include: Mayor: Lori Henry and <mark>Lee Jenkins</mark> Council Post 3: Sean Groer and Mike Nyden Council Post 6: Matt Judy and Karen Parrish \"Roswell residents are encouraged to attend the event. Those that cannot, are encouraged to watch the event live via Positively Roswell's Facebook feed,\" said a news release. The debate will also be recorded and re-broadcast in the same feed via a link at https: //www.facebook.com/proRoswell/ on the day of the event. Roswell Cultural Arts Center is at 950 Forrest Street. For more information, please contact <mark>Geoff Smith</mark> at geoff @ gsmitandco.com, or 678-779-5066.", "articleID": "2017112018_00265352_W", "names": {"Geoff Smith": ["Q1502915", "Q16095878", "Q16107511", "Q16194339", "Q18128184", "Q19668048", "Q21104287", "Q28873166", "Q5534318", "Q5534319", "Q5534320", "Q5534321", "Q5534325", "Q58121518"], "Lee Jenkins": ["Q10466528", "Q6514139"]}}, {"date": "2017-11-21", "url": "https://www.newkerala.com/news/fullnews-266365.html", "content": "3 months ago | 25-08-2017 | PRN Nashville Business Journal Names Kelsea Ballerini Artist of the Year, Announces 2017 Women in Music City Honorees NASHVILLE, Tenn., Aug. 25, 2017: The Nashville usiness Journal has named Kelsea Ballerini Artist of the Year for its fourth-annual Women in Music City Awards. The platinum-selling country star will be honored at the red-carpet awards dinner on October 17 at Music City Center. This event will bring together both the business and music industries, combining two major driving forces behind the success of Music City. Kelsea Ballerini released her first album, \"The First Time,\" in 2015, which reached gold status. That same year, Ballerini received Billboard's Women in Music Rising Star award. In 2016, she was named New Female Vocalist of the Year at the ACM Awards. Ballerini has also been named one of CMT's \"Next Women of Country\" and the \"Nashville It Girl\" by Rolling Stone. Earlier this year, the ACM awarded Ballerini with the Gene Weed Milestone Award for her accomplishments in country music. Ballerini's sophomore album, \"Unapologetically,\" is set to drop Nov. 3, 2017. \"When you read the list of winners this year, you get a true sense of the impact that women are making in the Nashville music business - what a group, including the Artist of the Year, Kelsea Ballerini! Not only will we be showcasing what women are currently contributing, but also highlighting women from the past (and future) showing the longevity and importance of females in the business .\" - NBJ President and Publisher Kate Herman. The Nashville Business Journal is also pleased to name the program's first Lifetime Achievement winner: Jo Walker-Meador. Walker-Meador was born Edith Josephine Denning in Orlinda, Tenn.. She led the Country Music Association as executive director from 1962 until 1991, playing an integral part in the growth of the country music industry during that time. Under her leadership, the association grew from about 200 members to more than 7,000. She was elected to the Country Music Hall of Fame in 1995. Walker-Meador died this year on Aug. 16 after suffering a stroke. CMA CEO Sarah Trahern will be presenting the award at the event. Also new this year, the NBJ and Ryman are excited to present the first Lula Naff Ryman Trailblazer Award awarding an outstanding woman in music business history. In its inaugural year to kick off the award, the honor goes to Lula Naff, formerly with Ryman Auditorium. Naff took a job with a Johnson City talent agency after finishing business school. When the company moved to Nashville in 1904, Naff followed, soon thereafter she was put in charge of booking speaking engagements, concerts and other events for the newly renamed Ryman Auditorium. After years of commitment to the group, booking everyone from Katherine Hepburn to Harry Houdini, Naff retired in 1955 and was named Manager Emeritus. She passed away in 1960 at the age of 85. In addition to the presentation of the awards, The Harpeth Hall School Chamber Choir will perform a Kelsea Ballerini song as part of the awards dinner. Said Head of School Dr. Stephanie Balmer, \"It is an honor for Harpeth Hall's Chamber Choir to perform in a program that celebrates women in Nashville's music industry. The honorees are role models, and their paths exhibit the variety of ways our young women can make an impact. At Harpeth Hall School, we believe brave girls and purposeful women can change the world .\" To determine our list of Women in Music City winners, nominations were taken from the public, and the final of selection of honorees was judged by an independent panel of judges made up of the following: Lori Feldman (Warner Bros.. Records); Camille Hackney (Atlantic Records); Cara Lewis (Cara Lewis Group); Natalia Nastaskin (United Talent Agency); and Jacqueline Saturn (Harvest Records). This year's winners are (listed alphabetically): Tatum Allsep (Music Health Alliance), Julie Boos (Flood, Bumstead, McCready & McCarthy), Debbie Carroll (MusiCares), Erin Crawford (Nielsen Music), Virginia Davis (G Major Management/Home Team Publishing), Beville Dunkerley (Pandora), Kerri Edwards (KP Entertainment), Leslie Fram (CMT), Becky Gardenhire (WME), Tracy Gershon (Red Light Management), Lisa Harless (Regions), Ali Harnell (AEG Live), Mary Hilliard Harringon (Red Light Management), Rebecca \"Becky\" Harris (Huskins-Harris Business Management), Caryl Healey (Sony Music Nashville), Autumn House-Tallant (Red Light Management), <mark>Allison Brown</mark> Jones (Big Machine Label Group), Beverly Keel (Middle Tennessee State University), Chandra LaPlume (Taillight TV), Ebie McFarland (Essential Broadcast Media), Haley McLemore (Red Light Management), LeAnn Phelan (Sea Gayle Management), Lisa Purcell (Country Music Hall of Fame and Museum), Kelly Rich (Amazon Music, Nashville), Risha Rodgers (WME), Sally Seitz (iTunes), <mark>Alison Smith</mark> (BMI), Jennie Smythe (Girlilla Marketing), Denise Stevens (Loeb & Loeb LLP), <mark>Susan Stewart</mark> (The Recording Academy), Lou Taylor (Tri Star Sports and Entertainment), Sarah Trahern (CMA), Marcie Allen Van Mol (MAC Presents), Christy Walker-Watkins (The AristoMedia Group), Carla Wallace (Big Yellow Dog Music), Sally Williams (Opry Entertainment Group) and Stephanie Wright (UMG Nashville). Nashville-based design build firm Van Mol Restoration and Ryman Hospitality Properties are Gold Sponsors of this year's Event. Change the Conversation is an Association Sponsor. KGV Studio is the Video Sponsor. All winners will be highlighted in both a printed Nashville Business Journal special publication and online at NashvilleBusinessJournal.com.", "articleID": "2017112109_00079532_W", "names": {"Alison Smith": ["Q20714093", "Q21455677", "Q23979128", "Q28530963", "Q4727188"], "Allison Brown": ["Q17600859", "Q4732734"], "Susan Stewart": ["Q3978233", "Q58005118", "Q58006168", "Q729225", "Q7648427"]}}, {"date": "2017-11-21", "url": "http://6abc.com/charlie-rose-fired-from-cbs-amid-sexual-misconduct-allegations/2678671/", "content": "BREAKING NEWS Shots fired at New Castle County police Full Story Email share share tweet email <mark>Charlie Rose</mark> fired from CBS amid sexual misconduct allegations Email share share tweet email ABCNews TARA FOWLER Tuesday, November 21, 2017 02:48 PM CBS has fired veteran journalist <mark>Charlie Rose</mark> after multiple women accused him of sexual misconduct. In a statement to staff posted on Twitter, CBS said <mark>Rose</mark> was terminated \"effective immediately .\" \"This followed the revelation yesterday of extremely disturbing and intolerable behavior said to have revolved around his PBS program,\" the statement read in part. \"Despite <mark>Charlie</mark>'s important journalistic contribution to our news division, there is absolutely nothing more important, in this or any organization, than ensuring a safe, professional workplace .\" Shortly thereafter, PBS released a statement of its own: \"In light of yesterday's revelations, PBS has terminated its relationship with <mark>Charlie Rose</mark> and canceled distribution of his programs. PBS expects all the producers we work with to provide a workplace where people feel safe and are treated with dignity and respect .\" <mark>Rose</mark>'s dismissal came after multiple women shared their personal stories with The Washington Post and Business Insider. The Post reported that <mark>Rose</mark>'s accusers either worked with or aspired to work with him on his PBS show, \"<mark>Charlie Rose</mark>,\" from the late 1990s to 2011. At the time of the alleged incidents, the women ranged in age from 21 to 37, according to the paper. Business Insider featured three women, all former \"<mark>Charlie Rose</mark>\" interns, who also accused <mark>Rose</mark> of inappropriate behavior, speaking to the site on the condition of anonymity. Before being fired on Tuesday, <mark>Rose</mark>'s \"CBS This Morning\" co-anchors Gayle King and Norah O'Donnell addressed the situation, calling for an end to the alleged behavior from <mark>Rose</mark> or anyone else in a position of power. \"Let me be very clear, there is no excuse for this alleged behavior,\" O'Donnell said. \"It is systematic and pervasive and I've been doing a lot of listening ....Women cannot achieve equality in the workplace or in society until there is a reckoning and a taking of responsibility .\" <mark>Rose</mark> issued an apology to the Post after the allegations first broke and later shared it on Twitter Monday night. \"In my 45 years in journalism, I have prided myself on being an advocate for the careers of the women with whom I have worked,\" he said in a statement to the newspaper. \"Nevertheless, in the past few days, claims have been made about my behavior toward some former female colleagues .\" It is essential that these women know I hear them and that I deeply apologize for my inappropriate behavior. I am greatly embarrassed. I have behaved insensitively at times, and I accept responsibility for that, though I do not believe that all of these allegations are accurate. I always felt that I was pursuing shared feelings, even though I now realize I was mistaken, \"he continued .\" I have learned a great deal as a result of these events, and I hope others will too. All of us, including me, are coming to a newer and deeper recognition of the pain caused by conduct in the past, and have come to a profound new respect for women and their lives. \"Related Topics: abc news national Email share share tweet email (Copyright © 2017 ABC News Internet Ventures .) Load Comments Please enable JavaScript to view comments. Top Stories Shots fired at New Castle County police Granddaughter arrested in Port Richmond stabbing CBS, PBS fire <mark>Charlie Rose</mark> following sexual misconduct allegations Police arrest suspect in fatal shooting of Pa. officer Bank bandit caught on camera in Center City Video shows moments before, after Plymouth Twp. attack FCC chairman sets out to repeal\" net neutrality' rules Day care owner charged with abuse in Del.. Show More Several assaulted, robbed by teen flash mob Border Patrol agent may have fallen to his death: AP Source Woman struck and killed on Black Horse Pike in NJ AccuWeather: Mostly Sunny, Milder This Afternoon Formerly conjoined twins head home from CHOP More News Photos PHOTOS: Mass shooting at Texas church PHOTOS: Arrests target drug, gang activity in Delaware 16 charged with murder in Delaware prison riot 15 indicted in Philadelphia/Camden drug ring bust More Photos", "articleID": "2017112119_00777989_W", "names": {"Charlie Rose": ["Q1064593", "Q715515"]}}]