[{"date": "2017-11-23", "url": "http://www.wbt.com/articles/ap-news/report-rep-joe-barton-threatened-ex-lover-police", "content": "Report: Rep. <mark>Joe Barton</mark> threatened ex-lover with police The Chris Ferrell Show, seg1 11/18/17 November 18, 2017 FILE - In this June 14, 2017, file photo, Rep. <mark>Joe Barton</mark>, R-Texas, speaks to reporters on Capitol Hill in Washington, about the incident where House Majority Whip Steve Scalise of La., and others, were shot during a Congressional baseball practice. <mark>Barton</mark> is apologizing after a nude photo of him circulated on social media. <mark>Barton</mark> released a statement on Nov. 22 to the Texas Tribune acknowledging that while separated from his second wife, prior to their divorce, he had sexual relationships \"with other mature adult women .\" (AP Photo/Manuel Balce Ceneta, File) Report: Rep. <mark>Joe Barton</mark> threatened ex-lover with police November 23, 2017 - 12:10 am Categories: News DALLAS (AP)--U.S. Rep. <mark>Joe Barton</mark> told a woman that he would complain to U.S. Capitol Police if sexually explicit photographs of him and other material from their relationship were to be exposed publicly, according to a published report. The Washington Post reported the threat Wednesday after <mark>Barton</mark>, a North Texas Republican, apologized for a nude photo of him that circulated on social media. The photo of <mark>Barton</mark> appeared on an anonymous Twitter account. It was not immediately known who posted the photo or when it was taken. <mark>Barton</mark> issued a statement saying that while separated from his second wife, prior to their divorce in 2015, he had sexual relationships \"with other mature adult women .\" The 68-year-old Republican said each relationship was consensual and has since ended. \"I am sorry I did not use better judgment during those days. I am sorry that I let my constituents down,\" said <mark>Barton</mark>, the longest-serving member of Congress from Texas. However, a woman whom the Post did not identify told the newspaper of <mark>Barton</mark>'s threat over the sexually explicit photographs, videos and messages he had sent to her. The woman described sexual encounters and contact extending over five years, beginning with her posting of a message on <mark>Barton</mark>'s Facebook page in 2011. She also shared with the Post a secretly recorded telephone conversation with <mark>Barton</mark> in 2015 in which he warned her against using the material \"in a way that would negatively affect my career .\" The Post reported the woman, who is not married, spoke on the condition of anonymity to protect her privacy. A message left by The Associated Press at <mark>Barton</mark>'s district office in Arlington, Texas, was not returned. The voicemail for his office in Washington was full. In a statement to the Post, <mark>Barton</mark> said a transcript of the telephone conversation provided by the newspaper may be \"evidence\" of a \"potential crime against me .\" He also said that Capitol Police had informed him Wednesday that they were opening an inquiry. Capitol Police did not respond to a request by the AP for comment late Wednesday. Earlier in the day, <mark>Barton</mark>'s spokeswoman told The Dallas Morning News that the congressman has no plans to step down. <mark>Barton</mark>, a member of the conservative House Freedom Caucus, announced his re-election bid this month. His district includes several counties in the Dallas-Fort Worth area. <mark>Barton</mark> was a consultant in the oil and gas industry before he joined the U.S. House in 1985. He is currently the vice chairman of the powerful House Energy and Commerce committee. He was the committee's chairman from 2004 to 2007. <mark>Barton</mark> has also been the longtime manager of the GOP congressional baseball team. He was taking part in a team practice in June when a gunman opened fire, injuring another congressman and others. The Associated Press", "articleID": "2017112306_00162282_W", "names": {"Joe Barton": ["Q6208505", "Q966261"]}}, {"date": "2017-11-24", "url": "https://www.digitallook.com/news/news-and-announcements/rio-tinto-extends-sinosteel-joint-venture-for-third-time--2991561.html", "content": "Rio Tinto extends Sinosteel joint venture for third time Rio Tinto extends Sinosteel joint venture for third time <mark>Josh White</mark> WebFG News | 24 Nov, 2017 07:44 - Updated: 07:44 | | | MM 200: n/a 17:17 25/09/06 Rio Tinto and China's Sinosteel Corporation have agreed to extend their Channar Mining joint venture, the pair announced on Friday. The third extension of the joint venture, confirmed in Beijing by Rio Tinto chief executive J-S Jacques and Sinosteel chairman Xu Siwei, would see an additional 10 million tonnes of iron ore delivered into the venture from Western Australia. FTSE 100 firm Rio Tinto said the extension would see Sinosteel make an upfront payment of $15m to it, as well as production royalties linked to the iron ore price. It remained conditional on approvals from the Western Australian, Australian and Chinese governments. \"The Channar joint venture is one of Australia's most significant trading partnerships and has helped pave the way for the incredibly strong relationship we have forged with China today,\" said Rio Tinto Iron Ore chief executive Chris Salisbury. \"This extension represents another milestone in our 30-year partnership that has seen more than 250 million tonnes of iron ore delivered from the Pilbara to China .\" The original Channar joint venture was signed in 1987 and provided for the production of 200 million tonnes of iron ore. Rio Tinto said the third extension would increase the life of the joint venture to cover production totalling 290 million tonnes. Advertising", "articleID": "2017112407_00510764_W", "names": {"Josh White": ["Q20710668", "Q22338540", "Q27830874", "Q6289511"]}}, {"date": "2017-11-24", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-live-13945677", "content": "News What next for North East devolution after this week's Budget announcement? The \"North of Tyne' devolution deal is set to go ahead this week following the Chancellor's announcement - so what happens next? Share By Kathryn Riddell Multimedia Journalist Sean Seddon Updated 08:27, 24 NOV 2017 News Share Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Chancellor <mark>Philip Hammond</mark> announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £ 600m and months in the planning, will be officially launched this week. It is a major announcement for the North East and means that three councils serving communities north of the River Tyne will join together to create a new North of Tyne Combined Authority, which will be led by a regional mayor to be elected in 2019. Those councils are Northumberland County Council, North Tyneside Council and Newcastle City Council. Formal agreement to the deal from the councils involved is expected to be announced this week, and includes funding of £ 600 million for the new authority paid over 30 years. The creation of the North of Tyne Combined Authority raises questions about future funding for the councils not involved, including Gateshead, Sunderland, South Tyneside and County Durham. Here, we take you through the complexities of what has been announced so far, and we will bring you the latest updates as the councils move towards formal agreement. Read More Budget 2017 Everything you need to know £ 337m funding for Metro system Business leaders welcome Budget How social media reacted 08:27 Kathryn Riddell Budget divides opinions among MPs The Chancellor's Budget has divided opinion among North East politicians, with Conservatives hailing it as a\" big boost for the North East \"while Labour MPs claim it failed the region. Chancellor Phillip <mark>Hammond</mark> this week announced a £ 337 million grant for the Tyne and Wear Metro, allowing a new fleet of 84 trains to be delivered by 2021. Chancellor <mark>Philip Hammond</mark> has announced funding for a new fleet of Metro trains And he also said the Government had agreed with local council leaders to create a\" North of Tyne \"mayor and combined authority, with funding of £ 600 million over 30 years to start with. The Government also said it would\" begin negotiations on a growth deal for the Borderlands \", which could benefit Northumberland as well as the neighbouring region of Scotland. Here's how MPs have reacted. 08:04 Kathryn Riddell Devolution deal to be launched this week Chancellor <mark>Philip Hammond</mark> announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £ 600m and months in the planning, will be officially launched this week. It is a major announcement for the North East and means that three councils serving communities north of the River Tyne will join together to create a new North of Tyne Combined Authority, which will be led by a regional mayor to be elected in 2019. Those councils are Northumberland County Council, North Tyneside Council and Newcastle City Council. Devo What is the North of Tyne devo deal? This week's announcement means that Newcastle, North Tyneside and Northumberland councils will ultimately come together to form a new combined authority which will include an elected mayor, to be chosen in 2019. The three councils decided to go it alone after negotiations for an authority encompassing all seven North East councils collapsed last year. As well as £ 600m over 30 years, the government say the deal will include\" powers over important economic levers including planning and skills \". The full scale of the deal will be revealed soon, but it represents the biggest shake-up to local government in the North East for decades. Budget Recap on key points from the Budget Chancellor Phillip <mark>Hammond</mark> delivered his Autumn 2017 Budget statement on Wednesday. It included plans to help people afford a home, money for the NHS and improvements to the Government's controversial Universal Credit policy. There was also big news for the North East as it was confirmed that: a North of Tyne devolution deal is about to get the go ahead, to be led by a directly-elected mayor £ 337 million will be invested to pay for new Tyne and Wear Metro trains Read more about the Budget key points here, and more on the Metro investment here. More On Devolution Northern Powerhouse Politics North Tyneside North Tyneside Council Northumberland Northumberland County Council Newcastle upon Tyne Newcastle City Council Tyne & Wear The Budget Gateshead South Tyneside Sunderland County Durham North East Combined Authority", "articleID": "2017112408_00570191_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}}, {"date": "2017-11-26", "url": "http://local12.com/sports/bengals/bengals-browns-5th-quarter-game-balls-coaching-grades-takeaways-key-stats-and-more-11-26-2017", "content": "Bengals-Browns 5th Quarter: Game balls; coaching grades; takeaways; key stats and more by Richard Skinner, WKRC 11 photos A A CINCINNATI (WKRC) - Welcome to the Bengals Fifth Quarter where I provide my analysis of Sunday's 30-16 win over the Cleveland Browns before a crowd announced at 51,710 in <mark>Paul Brown</mark> Stadium (here is a link to the story with game details filed as soon as the game concluded that also includes video/tweet highlights): GAME BALLS Offense: RB Joe Mixon. The Skinny: The rookie rushed for 114 yards and a touchdown on 23 carries and added 51 yards on three receptions, which accounted for 45.7 percent of the Bengals total yards. He became the first Bengals running back to surpass 100 yards since Rex Burkhead had 119 in last year's finale against Baltimore, and his total alone was more than the Bengals had as a team in any game this season. \"I tip my hat off to everybody that trusted in our run game,\" said Mixon. \"Coach did a great job calling plays, and our line did a great job executing. Our fullback (<mark>Ryan Hewitt</mark>) did a damn good job. too. Our receivers blocked on the perimeter, and it was up to me to go ahead and finish those runs, and that's what happened .\" Mixon's previous high in a game was 62 yards at <mark>Green</mark> Bay, and he surpassed that total less than two minutes into the second half. \"We put an emphasis on running the ball this week,\" said right tackle <mark>Andre Smith</mark>. \"We know if we can get Joe going, he's going to work some big runs for us and he did that today. He did some tremendous things today, and I happened to get behind him on some of those longer runs. To see him run hard and lower his pads was really impressive. I'm excited to block for him .\" The line had perhaps its best performance of the season thanks to a lot of drive blocking, but Mixon also averaged 2.8 yards after contact, according to ProFootballFocus.com. Mixon said he planned on taking the offensive line to dinner for his 100-yard performance. \"If I can get them together we're going to go - Ruth's <mark>Chris</mark>, Cheesecake (Factory), wherever, they deserve it,\" said Mixon. \"Our line has done well drive-blocking, and I'll keep finishing runs. At this point, it's about believing and getting the job done week-by-week .\" Mixon got off to a great start with runs of nine and 19 yards on the Bengals first drive of the game. \"It was big, because we all feed off of each other,\" said Mixon. \"By us going downhill from the start it meant a lot .\" Veteran guard Clint Boling was impressed with Mixon's performance. \"He brings a lot of energy,\" said Boling. \"The guy's obviously talented. You get him in space and it's fun watching him run. I think once he's taken over that role, he's obviously done well with it. He brings a lot of momentum when he starts running the ball like that .\" Mixon also finished the game on a high note with an 11-yard touchdown run with 2:57 left that gave the Bengals a 30-16 lead and clinched the win. \"We executed and we caught an outside toss,\" said Mixon. \"A.J. <mark>Green</mark> had a great block and Russell Bodine did a hell of job carrying me into the end zone. <mark>Ryan Hewitt</mark> did a great job .\" Defense: Nickel pass rushers (<mark>Carl Lawson</mark>, <mark>Chris Smith</mark>, Geno Atkins, Carlos Dunlap and <mark>Michael Johnson</mark>). The Skinny: The Bengals recorded four sacks and had 11 quarterback hits, and those five combined for three of the sacks and eight of the quarterback hits. <mark>Lawson</mark> had 1.5 sacks and now has a team-high 7.0 sacks, while <mark>Smith</mark>, Atkins and Dunlap each had half a sack, and <mark>Johnson</mark> had a quarterback hit. Atkins also had two other quarterback hits. \"We had an opportunity to work our man, and (<mark>Chris Smith</mark>) and I built that relationship to feel the rushes, and we play off each other,\" said Dunlap. Defensive tackle Pat Sims, who doesn't play in nickel situations, also had a sack. The Bengals now have 33 sacks this season after recording just 33 all of last season, and are on pace for 48, which would tie for second most in a season in team history since sacks became an official NFL stat in 1982. COACHING GRADES Head Coach Marvin Lewis: A-minus. Offensive Coordinator Bill Lazor: A-minus. Defensive Coordinator Paul Guenther: C. Special Teams Coordinator Darrin Simmons: B. The Skinny: The Bengals have dominated this series of late (they entered the game having won six straight, each by at least 13 points and by an average of 22.7 points per game) so it would have been easy to overlook the Browns, and the team didn't, which Lewis deserves at least some of the credit. It was a very business-like, professional win with few gaffes. The Bengals were penalized just four times for 35 yards with a personal foul for hitting a defenseless receiver on linebacker Vontaze Burfict accounting for 15 of those yards, and that was even a questionable call. Lazor's offense had its most productive performance since the bye week and racked up its second-most yards of the season (361). The offense was well-balanced, too, with 30 rushes accounting for a season-high 152 yards (and take away two kneel downs for minus-two yards on the final two plays of the game and it would have been 28 for 154 yards), while quarterback <mark>Andy Dalton</mark> attempted 28 passes and completed 18 for 209 yards and was sacked just once. About the only negative was that the offense was only 1 for 4 scoring touchdowns in the red zone, but the offense did score points on each of its first five drives of the game, and then put together a seven-play, 75-yard drive for Mixon's clinching touchdown with 2:57 remaining after the Browns had pulled within 23-16 with 6:57 left. Guenther's unit just wasn't as dominant as it should have been and allowed 405 yards, but while it bent a lot it didn't break all that much and held the Browns to only one touchdown, although that came at the end of a 15-play, 89-yard drive in the fourth quarter. Cleveland rushed for 169 yards on 31 carries (5.5 per carry) and probably should have stuck with the run game a little more than it did. \"We had some plays that will be interesting to see where our breakdowns where, particularly in the running game a couple of times,\" said Lewis. As for Simmons' group it made a glaring mistake in a sixth straight game, this time when Cethan Carter was called for an illegal block in the back to wipe out <mark>Adam Jones</mark>' 55-yard punt return for a touchdown. Other than that though the special teams were pretty solid. Kicker Randy Bullock made all three field-goal attempts (31, 49 an 21 yards) and all three extra-point attempts. The Browns averaged just 20.6 yards on five kickoff returns. <mark>Jones</mark>' punt return still gained 16 yards and Alex Erickson had a 14-yard punt return and a 25-yard kickoff return. THREE TAKEAWAYS - The defense is doing a lot of bending, but not breaking lately. The Skinny: Since the 29-14 loss to Pittsburgh on Oct. 22 the Bengals are 3-2 and the defense allowed an average of just 19.2 points per game (seven other points came on a punt return by Jacksonville), but it also allowed an average of 380.2 yards, including 145.0 yards on the ground. There is a lot of bending going on, but not much breaking to this point. \"Bend but don't break,\" said Dunlap. \"Obviously, we don't want them to get into the red zone, but when they get there, don't let them get seven--hold them to three .\" In the last five games the Bengals defense allowed 11 field goals and nine touchdowns. The most disturbing trend though is that the Bengals continue to get gashed on the ground. They allowed the Browns to average 5.5 yards per carry and in the last five games allowed an average 4.3 yards per carry. \"We have a lot of things we have to clean up as a defense,\" said <mark>Lawson</mark>. \"We allowed them to get too many yards on the ground. We should have put that team away. I'm not saying they're not a talented team, but we should have played better than what we did. It's the pride of the defense to not let them put up yards rushing or through the air. I'm happy we got the win, but there's some stuff to clean up .\" - Bullock answered Lewis' challenge The Skinny: After missing the Nov. 5 game at Jacksonville due to a back injury, Bullock missed an extra point in each of the last two games and Lewis said on Wednesday that the team's patience with Bullock was short and that, \"we're committed to Randy for this week .\" Bullock responded by making all six placement kicks: three field goals (31, 49 and 21 yards) and three extra points. \"I think today was a confidence booster,\" said Bullock. \"I had a good week of practice. Since I've been back I've kind of gradually continued to kick a little bit better and I'm just trying to get my strength back and fine-tune my swing .\" He said he didn't mind Lewis putting extra pressure on him with his comments. \"Honestly, I think that's part of the NFL,\" said Bullock. \"Every week is an evaluation; every day is an evaluation. It doesn't matter what position you are in the building - whether you are a player or a coach - you are constnatly being evaluated and you just go out and do your job and everything takes care of itself .\" - A.J. <mark>Green</mark> amazes The Skinny: In the NFL Gamebook all it says to describe a late third quarter pass completion from <mark>Dalton</mark> to wide receiver A.J. <mark>Green</mark> is: \"<mark>A.</mark> <mark>Dalton</mark> short pass right to <mark>A. Green</mark>, pushed OB at CIN 40 for 13 yards .\" It was certainly nowhwere near as simple as it reads as <mark>Green</mark> extended his hands toward the sideline to make a fingertip grab against tight coverage from Browns cornerback Jason McCourty, and then somehow tapped his feet inbounds in just enough time to make the catch. In short, it was a spectacular catch. \"When <mark>Andy</mark> threw the ball, there wasn't but one person in the world maybe that can make that catch and get both feet down without question in bounds,\" said Lewis. \"That's why I told (the referee) to (pick up) the (end of the) quarter there, because I thought it was inbounds. They ended up challenging it, so it stopped (the clock) anyway, but I had no question in my mind he had both feet down (inbounds). You have to have the ability to track the ball, and the athleticism to get both feet down like that. It was incredible .\" <mark>Green</mark> finished with a team-high five receptions for a team-high 66 yards. THREE STATS/NUMBERS OF NOTE 0-5: The Bengals record this season when the opposition scored first entering Sunday's game, but they are now 1-5 after Cleveland got a field goal on the opening possession of the game. 104.9: <mark>Dalton</mark>'s passer rating in the last five games this season. In that span he is 80 of 135 for 1,012 yards, nine touchdowns and no interceptions. He has thrown 140 straight passes without an interception. 131.8: <mark>Dalton</mark>'s passer rating in the last six games against the Browns. He is 117 of 160 (73.1 percent) for 1,442 yards, 15 touchdowns and no interceptions in thos six games. THREE QUOTES OF NOTE - Lewis on <mark>Jones</mark> having his 55-yard punt return for a touchown wiped out by Carter's illegal block in the back: \"It was a shame. It was a great job by him and a great finish with a block by William (Jackson). The guy's got a block in the back on the back side. That's one of the things our young guys have to keep on understanding: They're giving us the football, they're punting it where they are punting it from, we're going to get good field position, so let's make sure we don't have to have anything more. Let the returners make the guys miss, and positive yardage is positive yardage. It's something to learn from .\" - Browns coach Hue Jackson on the key 15-yard penalty for unnecessary roughness called on rookie safety Jabrill Peppers for hitting Bengals wide recever Josh Malone to break up a pass late in the fourth quarter on the Bengals game-clinching touchdown drive: \"The officials said that our player's helmet hit their player in the head. I didn't see that. I thought our player's shoulder hit him in the chest. The torque of the impact could have caused their player's head to react the way it did. To me, that's football. He didn't target their player's head. That was a huge call at that juncture in the game, and the officials have to get that one right. I thought Jabrill (Peppers) did the right thing during that play, and I stand by him wholeheartedly. He hit the guy below the shoulder pads .\" - Center Russell Bodine on the offensive line's positive performance the last couple of weeks: \"Things weren't obviously going toward the beginning of the year like we wanted it to go, but we just kind of emphasized being physical and going out there and having a little bit of an attitude, and we've done a good job of that the last two weeks and we just need to keep it going .\" UP NEXT: Monday Dec. 4 vs. Pittsburgh Steelers, 8:30 p.m. (ESPN). The Skinny: The Steelers are playing the Sunday night game against the <mark>Green</mark> Bay Packers, but should win that game and if they do will be 9-2 and in total command of the AFC North. The Bengals (5-6) can stay alive in the division race (albet it just barely) with a victory, but they can definitely stay in the wild-card race with a win. Pittsburgh has dominated the series of late winning the last five in a row, including 29-14 earlier this season in Pittsburgh on Oct. 22, and eight of the last nine. The Bengals last win at home in the series came on Sept. 16, 2013 when they won 20-10. Lewis is just 8-23 against the Steelers since becoming Bengals head coach in 2003. The Bengals are also just 11-23 in Monday Night Football games. close", "articleID": "2017112703_00337038_W", "names": {"A. Green": ["Q57137144", "Q58985471"], "Adam Jones": ["Q1060788", "Q16232662", "Q2537838", "Q2823965", "Q29787083", "Q349892", "Q350686", "Q43101011", "Q4679305"], "Andre Smith": ["Q2846283", "Q4754877", "Q4754878", "Q48977286", "Q493240"], "Andy Dalton": ["Q129605", "Q2849092"], "Carl Lawson": ["Q27918220", "Q5040466"], "Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "Michael Johnson": ["Q16195604", "Q16238908", "Q190924", "Q1928051", "Q20667583", "Q21458865", "Q21484117", "Q29456", "Q29964620", "Q3856198", "Q4896337", "Q496521", "Q54667230", "Q55313528", "Q56853023", "Q57056207", "Q57427460", "Q5889087", "Q6831672", "Q6831675", "Q6831677", "Q6831678", "Q6831679", "Q6831680", "Q6831682", "Q6831683", "Q6831685", "Q6831687", "Q6831690", "Q6831692", "Q898451"]}}]