[{"date": "2017-11-26", "url": "http://local12.com/sports/bengals/bengals-browns-5th-quarter-game-balls-coaching-grades-takeaways-key-stats-and-more-11-26-2017", "content": "Bengals-Browns 5th Quarter: Game balls; coaching grades; takeaways; key stats and more by Richard Skinner, WKRC 11 photos A A CINCINNATI (WKRC) - Welcome to the Bengals Fifth Quarter where I provide my analysis of Sunday's 30-16 win over the Cleveland Browns before a crowd announced at 51,710 in <mark>Paul Brown</mark> Stadium (here is a link to the story with game details filed as soon as the game concluded that also includes video/tweet highlights): GAME BALLS Offense: RB Joe Mixon. The Skinny: The rookie rushed for 114 yards and a touchdown on 23 carries and added 51 yards on three receptions, which accounted for 45.7 percent of the Bengals total yards. He became the first Bengals running back to surpass 100 yards since Rex Burkhead had 119 in last year's finale against Baltimore, and his total alone was more than the Bengals had as a team in any game this season. \"I tip my hat off to everybody that trusted in our run game,\" said Mixon. \"Coach did a great job calling plays, and our line did a great job executing. Our fullback (<mark>Ryan Hewitt</mark>) did a damn good job. too. Our receivers blocked on the perimeter, and it was up to me to go ahead and finish those runs, and that's what happened .\" Mixon's previous high in a game was 62 yards at <mark>Green</mark> Bay, and he surpassed that total less than two minutes into the second half. \"We put an emphasis on running the ball this week,\" said right tackle <mark>Andre Smith</mark>. \"We know if we can get Joe going, he's going to work some big runs for us and he did that today. He did some tremendous things today, and I happened to get behind him on some of those longer runs. To see him run hard and lower his pads was really impressive. I'm excited to block for him .\" The line had perhaps its best performance of the season thanks to a lot of drive blocking, but Mixon also averaged 2.8 yards after contact, according to ProFootballFocus.com. Mixon said he planned on taking the offensive line to dinner for his 100-yard performance. \"If I can get them together we're going to go - Ruth's <mark>Chris</mark>, Cheesecake (Factory), wherever, they deserve it,\" said Mixon. \"Our line has done well drive-blocking, and I'll keep finishing runs. At this point, it's about believing and getting the job done week-by-week .\" Mixon got off to a great start with runs of nine and 19 yards on the Bengals first drive of the game. \"It was big, because we all feed off of each other,\" said Mixon. \"By us going downhill from the start it meant a lot .\" Veteran guard Clint Boling was impressed with Mixon's performance. \"He brings a lot of energy,\" said Boling. \"The guy's obviously talented. You get him in space and it's fun watching him run. I think once he's taken over that role, he's obviously done well with it. He brings a lot of momentum when he starts running the ball like that .\" Mixon also finished the game on a high note with an 11-yard touchdown run with 2:57 left that gave the Bengals a 30-16 lead and clinched the win. \"We executed and we caught an outside toss,\" said Mixon. \"A.J. <mark>Green</mark> had a great block and Russell Bodine did a hell of job carrying me into the end zone. <mark>Ryan Hewitt</mark> did a great job .\" Defense: Nickel pass rushers (<mark>Carl Lawson</mark>, <mark>Chris Smith</mark>, Geno Atkins, Carlos Dunlap and <mark>Michael Johnson</mark>). The Skinny: The Bengals recorded four sacks and had 11 quarterback hits, and those five combined for three of the sacks and eight of the quarterback hits. <mark>Lawson</mark> had 1.5 sacks and now has a team-high 7.0 sacks, while <mark>Smith</mark>, Atkins and Dunlap each had half a sack, and <mark>Johnson</mark> had a quarterback hit. Atkins also had two other quarterback hits. \"We had an opportunity to work our man, and (<mark>Chris Smith</mark>) and I built that relationship to feel the rushes, and we play off each other,\" said Dunlap. Defensive tackle Pat Sims, who doesn't play in nickel situations, also had a sack. The Bengals now have 33 sacks this season after recording just 33 all of last season, and are on pace for 48, which would tie for second most in a season in team history since sacks became an official NFL stat in 1982. COACHING GRADES Head Coach Marvin Lewis: A-minus. Offensive Coordinator Bill Lazor: A-minus. Defensive Coordinator Paul Guenther: C. Special Teams Coordinator Darrin Simmons: B. The Skinny: The Bengals have dominated this series of late (they entered the game having won six straight, each by at least 13 points and by an average of 22.7 points per game) so it would have been easy to overlook the Browns, and the team didn't, which Lewis deserves at least some of the credit. It was a very business-like, professional win with few gaffes. The Bengals were penalized just four times for 35 yards with a personal foul for hitting a defenseless receiver on linebacker Vontaze Burfict accounting for 15 of those yards, and that was even a questionable call. Lazor's offense had its most productive performance since the bye week and racked up its second-most yards of the season (361). The offense was well-balanced, too, with 30 rushes accounting for a season-high 152 yards (and take away two kneel downs for minus-two yards on the final two plays of the game and it would have been 28 for 154 yards), while quarterback <mark>Andy Dalton</mark> attempted 28 passes and completed 18 for 209 yards and was sacked just once. About the only negative was that the offense was only 1 for 4 scoring touchdowns in the red zone, but the offense did score points on each of its first five drives of the game, and then put together a seven-play, 75-yard drive for Mixon's clinching touchdown with 2:57 remaining after the Browns had pulled within 23-16 with 6:57 left. Guenther's unit just wasn't as dominant as it should have been and allowed 405 yards, but while it bent a lot it didn't break all that much and held the Browns to only one touchdown, although that came at the end of a 15-play, 89-yard drive in the fourth quarter. Cleveland rushed for 169 yards on 31 carries (5.5 per carry) and probably should have stuck with the run game a little more than it did. \"We had some plays that will be interesting to see where our breakdowns where, particularly in the running game a couple of times,\" said Lewis. As for Simmons' group it made a glaring mistake in a sixth straight game, this time when Cethan Carter was called for an illegal block in the back to wipe out <mark>Adam Jones</mark>' 55-yard punt return for a touchdown. Other than that though the special teams were pretty solid. Kicker Randy Bullock made all three field-goal attempts (31, 49 an 21 yards) and all three extra-point attempts. The Browns averaged just 20.6 yards on five kickoff returns. <mark>Jones</mark>' punt return still gained 16 yards and Alex Erickson had a 14-yard punt return and a 25-yard kickoff return. THREE TAKEAWAYS - The defense is doing a lot of bending, but not breaking lately. The Skinny: Since the 29-14 loss to Pittsburgh on Oct. 22 the Bengals are 3-2 and the defense allowed an average of just 19.2 points per game (seven other points came on a punt return by Jacksonville), but it also allowed an average of 380.2 yards, including 145.0 yards on the ground. There is a lot of bending going on, but not much breaking to this point. \"Bend but don't break,\" said Dunlap. \"Obviously, we don't want them to get into the red zone, but when they get there, don't let them get seven--hold them to three .\" In the last five games the Bengals defense allowed 11 field goals and nine touchdowns. The most disturbing trend though is that the Bengals continue to get gashed on the ground. They allowed the Browns to average 5.5 yards per carry and in the last five games allowed an average 4.3 yards per carry. \"We have a lot of things we have to clean up as a defense,\" said <mark>Lawson</mark>. \"We allowed them to get too many yards on the ground. We should have put that team away. I'm not saying they're not a talented team, but we should have played better than what we did. It's the pride of the defense to not let them put up yards rushing or through the air. I'm happy we got the win, but there's some stuff to clean up .\" - Bullock answered Lewis' challenge The Skinny: After missing the Nov. 5 game at Jacksonville due to a back injury, Bullock missed an extra point in each of the last two games and Lewis said on Wednesday that the team's patience with Bullock was short and that, \"we're committed to Randy for this week .\" Bullock responded by making all six placement kicks: three field goals (31, 49 and 21 yards) and three extra points. \"I think today was a confidence booster,\" said Bullock. \"I had a good week of practice. Since I've been back I've kind of gradually continued to kick a little bit better and I'm just trying to get my strength back and fine-tune my swing .\" He said he didn't mind Lewis putting extra pressure on him with his comments. \"Honestly, I think that's part of the NFL,\" said Bullock. \"Every week is an evaluation; every day is an evaluation. It doesn't matter what position you are in the building - whether you are a player or a coach - you are constnatly being evaluated and you just go out and do your job and everything takes care of itself .\" - A.J. <mark>Green</mark> amazes The Skinny: In the NFL Gamebook all it says to describe a late third quarter pass completion from <mark>Dalton</mark> to wide receiver A.J. <mark>Green</mark> is: \"<mark>A.</mark> <mark>Dalton</mark> short pass right to <mark>A. Green</mark>, pushed OB at CIN 40 for 13 yards .\" It was certainly nowhwere near as simple as it reads as <mark>Green</mark> extended his hands toward the sideline to make a fingertip grab against tight coverage from Browns cornerback Jason McCourty, and then somehow tapped his feet inbounds in just enough time to make the catch. In short, it was a spectacular catch. \"When <mark>Andy</mark> threw the ball, there wasn't but one person in the world maybe that can make that catch and get both feet down without question in bounds,\" said Lewis. \"That's why I told (the referee) to (pick up) the (end of the) quarter there, because I thought it was inbounds. They ended up challenging it, so it stopped (the clock) anyway, but I had no question in my mind he had both feet down (inbounds). You have to have the ability to track the ball, and the athleticism to get both feet down like that. It was incredible .\" <mark>Green</mark> finished with a team-high five receptions for a team-high 66 yards. THREE STATS/NUMBERS OF NOTE 0-5: The Bengals record this season when the opposition scored first entering Sunday's game, but they are now 1-5 after Cleveland got a field goal on the opening possession of the game. 104.9: <mark>Dalton</mark>'s passer rating in the last five games this season. In that span he is 80 of 135 for 1,012 yards, nine touchdowns and no interceptions. He has thrown 140 straight passes without an interception. 131.8: <mark>Dalton</mark>'s passer rating in the last six games against the Browns. He is 117 of 160 (73.1 percent) for 1,442 yards, 15 touchdowns and no interceptions in thos six games. THREE QUOTES OF NOTE - Lewis on <mark>Jones</mark> having his 55-yard punt return for a touchown wiped out by Carter's illegal block in the back: \"It was a shame. It was a great job by him and a great finish with a block by William (Jackson). The guy's got a block in the back on the back side. That's one of the things our young guys have to keep on understanding: They're giving us the football, they're punting it where they are punting it from, we're going to get good field position, so let's make sure we don't have to have anything more. Let the returners make the guys miss, and positive yardage is positive yardage. It's something to learn from .\" - Browns coach Hue Jackson on the key 15-yard penalty for unnecessary roughness called on rookie safety Jabrill Peppers for hitting Bengals wide recever Josh Malone to break up a pass late in the fourth quarter on the Bengals game-clinching touchdown drive: \"The officials said that our player's helmet hit their player in the head. I didn't see that. I thought our player's shoulder hit him in the chest. The torque of the impact could have caused their player's head to react the way it did. To me, that's football. He didn't target their player's head. That was a huge call at that juncture in the game, and the officials have to get that one right. I thought Jabrill (Peppers) did the right thing during that play, and I stand by him wholeheartedly. He hit the guy below the shoulder pads .\" - Center Russell Bodine on the offensive line's positive performance the last couple of weeks: \"Things weren't obviously going toward the beginning of the year like we wanted it to go, but we just kind of emphasized being physical and going out there and having a little bit of an attitude, and we've done a good job of that the last two weeks and we just need to keep it going .\" UP NEXT: Monday Dec. 4 vs. Pittsburgh Steelers, 8:30 p.m. (ESPN). The Skinny: The Steelers are playing the Sunday night game against the <mark>Green</mark> Bay Packers, but should win that game and if they do will be 9-2 and in total command of the AFC North. The Bengals (5-6) can stay alive in the division race (albet it just barely) with a victory, but they can definitely stay in the wild-card race with a win. Pittsburgh has dominated the series of late winning the last five in a row, including 29-14 earlier this season in Pittsburgh on Oct. 22, and eight of the last nine. The Bengals last win at home in the series came on Sept. 16, 2013 when they won 20-10. Lewis is just 8-23 against the Steelers since becoming Bengals head coach in 2003. The Bengals are also just 11-23 in Monday Night Football games. close", "articleID": "2017112703_00337038_W", "names": {"Paul Brown": ["Q16197784", "Q16212754", "Q18205667", "Q18921483", "Q19396015", "Q21462455", "Q22235645", "Q24033408", "Q29034170", "Q54727692", "Q55079049", "Q5587853", "Q7149543", "Q7149544", "Q7149545", "Q7149546", "Q7149547", "Q7149549"], "Ryan Hewitt": ["Q17715106", "Q48700509"]}}, {"date": "2017-11-27", "url": "http://11alive.com/article/news/nation-now/trump-has-no-plans-to-campaign-for-roy-moore-white-house-says/465-5625d69e-cdd5-4c6f-9c81-cfe6665c7aee", "content": "Trump has no plans to campaign for <mark>Roy Moore</mark>, White House says WH: Trump has no plans to campaign for <mark>Moore</mark> Author: <mark>David Jackson</mark>, USA TODAY Published: 12:17 PM EST November 27, 2017 WASHINGTON--President Trump does not plan to travel to Alabama to campaign for embattled Senate candidate <mark>Roy Moore</mark>, a White House official said Monday. \"There is nothing on the schedule at this time,\" White House spokeswoman Lindsay Walters said. Trump, who has all but endorsed <mark>Moore</mark> despite multiple sexual assault and harassment accusations against him, told reporters last week he would decide soon whether to campaign for the Alabama Republican in person ahead of the Dec. 12 election. Trump has defended <mark>Moore</mark>, who has denied the allegations that he assaulted or pursued relationships with teenage girls while he was in his 30s. Trump has cited <mark>Moore</mark>'s denials--and repeatedly bashed <mark>Moore</mark>'s opponent, Democratic nominee <mark>Doug Jones</mark>. Over the weekend, Trump said <mark>Jones</mark> would be a \"puppet\" of national Democrats such as Sen. Chuck Schumer of New York and Rep. Nancy Pelosi of California. \"The last thing we need in Alabama and the U.S. Senate is a Schumer/Pelosi puppet who is WEAK on Crime, WEAK on the Border, Bad for our Military and our great Vets, Bad for our 2nd Amendment, AND WANTS TO RAISES TAXES TO THE SKY,\" Trump wrote from during his Thanksgiving weekend at his Mar-a-Lago estate in Palm Beach, Fla. .", "articleID": "2017112717_00427508_W", "names": {"David Jackson": ["Q1174850", "Q16215837", "Q18706415", "Q19560836", "Q25171864", "Q3018141", "Q42889647", "Q46585740", "Q5235533", "Q5235534", "Q5235535", "Q53104720", "Q8354128", "Q9202628", "Q9202630"], "Doug Jones": ["Q1251779", "Q16142774", "Q30122825", "Q461309", "Q5300612", "Q5300613"], "Roy Moore": ["Q17466511", "Q27924997", "Q5302905"]}}, {"date": "2017-11-27", "url": "http://www.nydailynews.com/newswires/sports/georgia-faces-auburn-rematch-avenge-23-point-loss-article-1.3661197", "content": "ATHENS, Ga. (AP)--Three weeks isn't much time at all. Certainly not enough to forget a 23-point blowout. Now the question is: Can No. 6 Georgia turn the sting of its lone defeat--not to mention the gleeful boasting of Auburn coach Gus Malzahn--into the sort of controlled anger and nagging motivation that produces a vastly different result in the Southeastern Conference championship game? No matter how you slice it, that Nov. 11 mismatch at Jordan-Hare Stadium looms large over Saturday's rematch at Mercedes-Benz Stadium in Atlanta. \"We'll have a lot of energy, a lot of emotions,\" Georgia linebacker Lorenzo Carter said Monday. \"But when it comes down to it, those emotions aren't going to win the game. It's how you play .\" No. 4 Auburn (10-2) is playing as well as any team in the country, winning five straight games by an average of 22 points since a seemingly crushing loss to LSU. That streak includes a 40-17 rout of Georgia, when the Bulldogs were ranked No. 2 by The Associated Press and sitting atop the College Football Playoff standings, and last Saturday's equally impressive 28-16 victory over top-ranked Alabama. Suddenly, the Tigers are a trendy pick to win it all. But they've got to beat Georgia (11-1) for the second time in less than a month. FILE - In this Nov. 11, 2017, file photo, Auburn head coach Gus Malzahn, left, and Georgia head coach Kirby Smart, right, meet before an NCAA college football game in Auburn, Ala.. No. 6 Georgia is getting ready for a rematch with No. 4 Auburn in the SEC championship game. (AP Photo/Brynn Anderson, File) And Malzahn may come to regret what he said right after the previous meeting. Walking away from his on-field interview with CBS, he was overheard commenting, \"We whipped the dog crap out of 'em, didn't we!\" The coach wasn't wrong, considering Auburn outgained the Bulldogs 488-230 in total yards and shut down the dynamic running back duo of Nick Chubb and Sony Michel. But those words are sure to be plastered all over the Bulldogs' training facility this week. \"It is certainly a normal human response to want revenge when we are harmed,\" Will Freeman, the track coach at Iowa's Grinnell College who also teaches sports psychology, wrote in an email. \"Can it increase motivation? Yes. Can that motivation go bad? Also, yes. Optimal performance requires the athlete find the optimal level of motivation and excitement for the situation. Too much, and the athlete can lose focus, control and mental awareness about the situation. Just as important, too much arousal can cause timing and rhythm issues with the athlete that result in poor performance .\" Georgia coach Kirby Smart was part of a rematch situation during the 2011 season while serving as Alabama's defensive coordinator. The Crimson Tide lost to LSU 9-6 in overtime during the regular season, only to get another shot at the Tigers in the national championship game. Alabama dominated the second meeting in New Orleans, claiming the BCS title with a stifling 21-0 victory. Looking back on LSU's poor performance, then-coach Les Miles said recently the team that loses the first game probably has an easier time getting its players motivated for the rematch. Georgia head coach Kirby Smart holds his son Andrew on his shoulders after the second half of an NCAA college football game, Saturday, Nov. 25, 2017, in Atlanta. Georgia won 38-7. (AP Photo/John Bazemore) \"They plan and they work and there's a stronger commitment than the team that looks back on a hard-fought victory, but a victory nonetheless,\" Miles said. \"I think once you've beaten a team, it takes a special view of how to get them ready to beat that team again .\" But it's not unusual, at least in the SEC, for the team that won the first game to take the second as well. This will be the seventh time in the title game's 26-year history that there's a rematch of a regular-season matchup. Five of the six times it happened before, the same team won both games, the only exception coming in 2001 when LSU lost to Tennessee 26-18 in late September but bounced back to win the SEC crown with a 31-20 triumph. \"You can watch the tape of the game,\" Smart said. \"It fires you up pre-game and gets you all excited, but when the toe meets leather it's about striking people, it's about speed, it's about blocking, tackling, it's about having composure. It's about having discipline. It really doesn't revert back to who won the previous game .\" What makes this a bit different is the proximity of the two meetings--all previous SEC rematches were at least seven weeks after the first game--and these teams are especially bitter foes even though they're in different divisions. Billed as the Deep South's oldest rivals, they first played in 1892 and have clashed nearly every season since then for a total of 121 meetings. Georgia leads by the slimmest of margins, 57-56 with eight ties. If Smart is taking notes on all that history, and especially the most recent matchup, he isn't letting on. \"The other game is past history,\" he said. \"Now whether or not you say that it helps mentally with your preparation, that somebody is more focused than the other, I don't know. I certainly think Auburn was more focused down the stretch because their backs were against the wall. They had two losses. Now everybody's backs are against the wall .\" Auburn linebacker Robert Muschamp, left, and Auburn defensive back <mark>Stephen Roberts</mark>, celebrate during the second half of the Iron Bowl NCAA college football game, Saturday, Nov. 25, 2017, in Auburn, Ala. (AP Photo/Brynn Anderson) Indeed, the winner of the rematch will almost certainly land a spot in the four-team playoff. The loser is eliminated from the national championship race. \"I think you should prepare the same, regardless of your record, regardless of a revenge factor and be real consistent in your approach so that the players are able to understand that it's important to prepare right for every game,\" Smart said. \"We don't say that this game is more important than the other because it's the next game. The next game is always the most important .\" ___ Follow Paul Newberry on Twitter at https: //twitter.com/pnewberry1963. His work can be found at https: //apnews.com/search/paul% 20newberry ___ For more AP college football coverage: http: //collegefootball.ap.org and https: //twitter.com/AP_Top25 Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags: newswires associated press sports newswires Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2017112801_00298181_W", "names": {"Stephen Roberts": ["Q2026194", "Q22280061", "Q43197539", "Q7610381", "Q7610382", "Q7610383", "Q7610384"]}}, {"date": "2017-11-29", "url": "http://www.dailystar.co.uk/showbiz-tv/im-a-celebrity-get-me-out-of-here/663622/Im-A-Celebrity-2017-Declan-Donnelly-replaced-Ant-McPartlin-Bob-the-medic-emergency", "content": "Following the news that I'm A Celebrity contestant Rebekah Vardy was ruled out of the latest Bushtucker trial due to having low blood pressure. I'm A Celeb host Dec was hosting alongside Ant McPartlin when Bob the medic was suddenly called in to check him over. Bob ruled him unfit to do the link and he was told sit out before taking an emergency oxygen mask. ITV MEDICAL WORRIES: A medic was called over for Dec live on TV ITV MEDICAL CHECK: Bob the medic ruled Dec too ill to present the link Sexiest I'm a Celebrity shower scenes We've rounded up the sexiest EVER shower scenes from I'm a celebrity...get me out of here. From THAT Myleene Klass bikini to Jordan's cornrows in the shower here are our favourites. 1 / 76 ITV/REX Vanessa White puts on the hottest shower scene in the history of I'm a Celebrity The medical expert then took over Dec's role and delivered Dec's next line. Ant was so impressed with Bob's efforts that he sacked Dec and renamed their show Ant and Bob's Saturday Night Takeaway. Poor Dec looked devastated as he suddenly jumped up to share his outrage. ITV OXYGEN MASK: Dec had to sit at the back of the set to get some oxygen I'm A Celebrity Kings & Queens Look back through all the celebrities crowned Kings and Queens of the jungle. 1 / 17 ITV Fans took to social media to laugh at the funny moment. One said: \"The look of utter betrayal on Dec's face .\" Another added: \"I think Dec should pair up with Kiosk Keith! Dec and Kiosk Keith does it for me .\" A third chipped in: \"Can we rule Dec out of presenting on medical grounds so that we get to see more of Ant & Medic Bob?\" ITV REPLACED: Ant asked Bob to present Saturday Night Takeaway with him Jorgie Porter hottest pictures I'm a Celeb Jorgie Porter shows off her curves in these sexy pictures. 1 / 66 Instagram Jorgie Porter hottest pictures A fourth wrote: \"I will miss Dec.. but will get used to the Ant n Bob Saturday Night Takeaway .\" Meanwhile, <mark>Stanley Johnson</mark> and Kezia Dugdale failed to impress viewers with their attempt at the trial. The pair only managed to bring home 5 meals for the team. I'm A Celeb continues tomorrow at 9pm on ITV. Related articles Holby City accused of copying Emmerdale in major faux pas I'm A Celebrity's Ant and Dec forced to apologise for \"rude' comments to Iain Lee Coronation Street to bring iconic character back from the dead in epic resurrection", "articleID": "2017113000_00015598_W", "names": {"Stanley Johnson": ["Q16239572", "Q28580377", "Q29643064", "Q45736371", "Q7599711"]}}, {"date": "2017-11-30", "url": "http://www.washingtontimes.com/news/2017/nov/29/james-clyburn-charges-john-conyers-might-be-false-/?utm_source=RSS_Feed&utm_medium=RSS", "content": "-- Robert Draper (@ DraperRobert) November 29, 2017 He said the report, which Mr. Clyburn and the Congressional Black Caucus quickly disputed, was \"according to 2 sources. One told me Clyburn has used the <mark>Susan Smith</mark> parallel more than once, to members & staffers .\" Both Mr. Clyburn and Mr. Conyers are members of the CBC; <mark>Smith</mark>'s claim that a black man had kidnapped her children quickly fell apart and she was later convicted in a South Carolina court of murdering the kids by drowning them in the family car. Yes, according to 2 sources. One told me Clyburn has used the <mark>Susan Smith</mark> parallel more than once, to members & staffers. https: //t.co/3SjKCzjBh8--Robert Draper (@ DraperRobert) November 29, 2017 The CBC quickly said on its Twitter account that the reporter's claims are \"not accurate .\" Mr. Clyburn \"used the <mark>Smith</mark> example to illustrate the dangers of convicting people before getting all the facts. Although <mark>Smith</mark> killed her kids, she blamed an innocent person & a lot of people believed that innocent person was guilty .\" The CBC went on to say that Mr. Draper's sources were doing \"nothing more than members changing the story because they want his leadership position .\". @ RepRichmond: \"If the police hadn't investigated, the wrong person would have gone to jail. This mischaracterization of what @ clyburn said is nothing more than members changing the story because they want his leadership position .\" 2/2--Black Caucus (@ OfficialCBC) November 30, 2017 Mr. Clyburn himself also took to Twitter to say that Mr. Draper \"is inaccurate in many regards. That discussion had nothing to with Conyers,\" a claim the reporter quickly rebutted. This is inaccurate in many regards. That discussion had nothing to with Conyers. https: //t.co/EWeokwGn50--James E. Clyburn (@ Clyburn) November 29, 2017 \"That discussion was specifically & exclusively about Conyers, according to 2 attendees. Who else could you have been referring to when bringing up <mark>Susan Smith</mark>?\" Mr. Draper asked rhetorically. That discussion was specifically & exclusively about Conyers, according to 2 attendees. Who else could you have been referring to when bringing up <mark>Susan Smith</mark>? https: //t.co/MtbIdDbxT7--Robert Draper (@ DraperRobert) November 29, 2017", "articleID": "2017113001_00217101_W", "names": {"Susan Smith": ["Q21459106", "Q2449527", "Q27927258", "Q34992921", "Q37377726", "Q42664397", "Q47467430", "Q7648396"]}}, {"date": "2017-11-30", "url": "https://indaily.com.au/news/2017/11/30/uk-slams-trumps-anti-muslim-tweets/", "content": "President Trump sparked conflict with the UK over retweeting material from a fringe British political group. EPA photo The tweets drew a sharp condemnation from British Prime Minister Theresa May's office, which said it was \"wrong for the president to have done this .\" Brushing off the criticism in an evening tweet, Trump said May instead of focusing on him should \"focus on the destructive Radical Islamic Terrorism that is taking place within the United Kingdom .\" Trump had turned away from taxes, North Korea and other issues facing his administration to share the three videos tweeted by Jayda Fransen, deputy leader of the British group. It was not clear what drew him to the videos, though one had been shared by conservative commentator Ann Coulter the day before. Advertisement White House spokeswoman Sarah Huckabee Sanders said Trump was simply promoting border security and suggested that verifying the content was not a top concern. \"Whether it's a real video, the threat is real and that is what the president is talking about,\" she said. The tweets read: \"VIDEO: Islamist mob pushes teenage boy off roof and beats him to death!\" and \"VIDEO: Muslim Destroys a Statue of Virgin Mary!\" and \"VIDEO: Muslim migrant beats up Dutch boy on crutches!\" His promotion of the videos came two days after he mocked Senator Elizabeth Warren as \"Pocahontas\" during an Oval Office event with Native American veterans, drawing criticism from of Native American war veterans and politicians of both major parties. Trump's retweets have given a wide platform to the previously obscure group. The videos were each shared more than 10,000 times, and Fransen picked up nearly 10,000 Twitter followers in the hours following Trump's retweets. She thanked him on Twitter, saying \"GOD BLESS YOU TRUMP!\" Former Ku Klux Klan leader <mark>David Duke</mark> also welcomed the videos, tweeting that Trump was being \"condemned for showing us what the fake news media WON'T. Thank God for Trump! That's why we love him!\" --AP We value local independent journalism. We hope you do too. InDaily provides valuable, local independent journalism in South Australia. As a news organisation it offers an alternative to The Advertiser, a different voice and a closer look at what is happening in our city and state for free. Any contribution to help fund our work is appreciated. Please click below to become an InDaily supporter. Powered by PressPatron Advertisement Jump to next article", "articleID": "2017113002_00043849_W", "names": {"David Duke": ["Q163042", "Q5233100"]}}, {"date": "2017-11-30", "url": "http://www.goal.com/en-india/news/7083/isl/2017/11/30/40650222/isl-2017-gregory-nelson-chennaiyin-fcs-dutch-wing-wizard-snubbed-", "content": "Indian Super League Goal By Ashwin Muralidharan (Tweets @ AshwinMNair10) 06:07 Share Close Comments Image Courtesy: ISL The former AZ Alkmaar winger has made a bright start to life in the South Indian city and is loving the excitement and colour surrounding the ISL...It is not often that a footballer, especially someone from Europe, decides to snub offers from European teams to go play for an Indian club. Yes, Indian Super League (ISL) outfit Chennaiyin FC's Dutch recruit Gregory Nelson did exactly that and has had absolutely no regrets over his decision. Nelson has had a sparkling start to life at Chennaiyin FC, coming off the bench and helping Chennaiyin FC almost stage a comeback in their opening game against FC Goa before playing a stellar role in their 3-0 hammering of NorthEast United in the second game of the season. In an exclusive chat with Goal, the winger revealed that the lure of coming to India was too tempting to pass up, with the good words put in by former Chenaniyin FC and Delhi Dynamos midfielder <mark>Hans Mulder</mark> also playing a part in convincing him. \"I did have offers from Europe this season but I was close to joining Chennaiyin FC and I really wanted to come to India. So, I decided to take up this offer (instead),\" he said. \"I have some friends who have already played here like <mark>Hans Mulder</mark>. He's a very good friend of mine. They told me only good things about India. So, it was an easy decision,\" he expressed before adding that he was close to playing the ISL in the previous editions as well. \"In the previous two ISL seasons, I was close to coming to India. I spoke to some agents and they tried to bring me to India. I've known about the league also for some time now .\" I didn't expect the league to be so organised when I came in. Everything around the matches are well organised. And the games are like big happenings and I like it very much. \"However, he felt that the country's training facilities had a lot of scope for improvement but expressed confidence that in the coming years, they will improve as well .\" The schedule (of the league) and travelling is very good but the training facilities can be better. The field where we are training is good but in Europe, we have five-to-six very good pitches and you get gyms and other facilities which are not here. But I'm sure in four-to-five years, it will come here as well and the facilities will be better, \"he opined. The winger went on to state that while he would like to continue playing in the ISL in the future, the timing of the league makes it hard for overseas footballers to remain match fit and further their careers. In doing so, he pointed out one drawback of the ISL expanding to a four-month long league from the point of view of overseas players .\" As of now, I really like it here. I want to see how the season plays out. But I don't mind staying longer here. I like it and I want to help the (Indian) players get better. But you never know what will happen, \"he shared before adding,\" It is difficult (to commit for long time), with the ISL being of short duration. \"You are free only in March and in Europe, the next window is open in June I think. So, the other teams will view you as a player who hasn't played for two-to-three months. So, it is a bit scary for the foreign players who come here. Last year, we could have signed in January for some other team and then come back next season .\" The 29-year-old who came through the youth ranks of Eredivisie club AZ Alkmaar might not have had a storied career in football, with him making just the one senior appearance for AZ before meandering off to countries lke Ukraine, Bulgaria, Kazakhstan etc, but holds the distinction of being handed his senior team debut by none other than former Manchester United manager Louis van Gaal. Van Gaal was in charge of AZ from 2005 till 2009 and he picked Nelson for the team's Eredivisie game against Heracles Almelo in September 2007. \"Yes, I was given my debut my Louis van Gaal. He is a very tough coach who backed talent. No matter how young you are, if you were good enough to play, he would pick you,\" recollected Nelson. Interestingly, Chennaiyin FC is Nelson's third club in 2017 with him cutting short his association with Kazakhstan's Kaiser without making an appearance for them due to personal issues before turning out for Bahrain's Al Muharraq club. \"I was supposed to go to Kazakhstan (at the start of the year) and they promised me several things but didn't deliver on them. So I decided to break (the agreement) and I went home .\" (Then) I went to Al Muharraq and our goal was to win the league. But we failed and the coach who brought me there was fired. The new coach brought new players and I decided to leave. \"Before the ISL season started, Chennaiyin coach <mark>John Gregory</mark> described Gregory Nelson as someone who can take on and beat any defender. The Dutchman concurs with the view and gave an insight into how he likes to play .\" I think my strength is a combination of pace and trickery. I'm not the fastest player going around but in a one-on-one, I'm very difficult to defend and I think that is my biggest strength, \"he stated. Article continues below One of Nelson's biggest achievements in his career has been playing in the Europa League with Bulgarian side CSKA Sofia in the 2010-11 season where they played against the likes of FC Porto and Besiktas. Nelson wrapped up the chat by recollecting some of his most memorable moments, including his Europa League bow and the 2012 Ukraine Cup final loss against Shakhtar Donetsk, which had the likes of Henrikh Mkhitaryan, Willian and Fernandinho in the starting XI that day .\" Playing in the Europa League (was certainly one of the best memories). Also, winning the Cup and the Super cup in Bulgaria (with CSKA Sofia). We (Metalurh Donetsk) lost in the Ukraine Cup final agianst Shakhtar Donetsk (2012) who had some really big players. \"Indian Super League Chennaiyin Pune City v Chennaiyin Pune City G. Nelson Comments ()", "articleID": "2017113006_00318280_W", "names": {"Hans Mulder": ["Q15059161", "Q25702"]}}]