[{"articleID": "2015120123_00057331_W", "names": {"Michael Mayer": ["Q1611585", "Q1689106", "Q1928565", "Q1928566", "Q19964005", "Q2094087", "Q21458849", "Q47948992", "Q70378", "Q99282"]}, "date": "2015-12-01", "url": "http://www.startribune.com/local/south/358974031.html", "content": "Rucki sisters headed to reunification program after shunning dad South Metro 358974031 Rucki sisters headed to family reunification program Saying the girls' \"life has become a circus,\" Judge <mark>Michael Mayer</mark> had to choose among three competing arguments of where Gianna, 16, and Samantha, 17, should go. By Brandon Stahl Star Tribune December 1, 2015--5:11 pm Jerry Holt, Star TribunePolice are searching a horse farm near Herman in the continuing efforts to find Gianna and Samantha Rucki, who went missing in April 2013. Wednesday November 18, 2015 in Herman, MN. Purchase: Order Reprint The runaway Lakeville sisters who had been missing for two and a half years will be sent to an intensive out-of-state reunification program after a Dakota County judge pulled them out of foster care Monday. The program aims to overcome the resistance of Gianna and Samantha Rucki to moving back in with their father, whom they still refuse to live with, less than two weeks after they were discovered on a western Minnesota horse farm. Saying the girls' \"life has become a circus,\" Judge <mark>Michael Mayer</mark> had to choose among three competing arguments of where Gianna, 16, and Samantha, 17, should go. Dakota County child protection thought they should stay in foster care. The couple who kept the runaway teens at the White Horse Ranch filed a petition on Monday saying the girls were best off with them. \"We love the children and believe we can provide them the best environment under these current circumstances,\" Doug and Gina Dahlen wrote in their motion. Before the girls ran away in April 2013, the teens repeatedly accused their father of abuse, but a court-appointed psychologist concluded that their mother, Sandra Grazzini-Rucki, had brainwashed them. Their father, David Rucki, was granted full custody of the children in November 2013 after a judge ruled that there was no credible evidence that the girls were abused. Case gone \"massively awry' Dakota County child protection placed the girls in a foster care home a few days after they were found and on Monday asked a judge to keep them there. The county argued that the girls were likely to flee again and needed to be in a safe and stable environment after refusing to live with their father. An attorney for the girls said they promised not to run away if they were allowed to remain in foster care. David Rucki objected, saying he is willing and able to care for the girls. The judge agreed, saying he had no jurisdiction to keep them under the county's supervision .\" I think I have a family law case that has gone massively awry, \"he said. <mark>Mayer</mark>'s decision gave full parental rights back to Rucki, who said he will put them in a reunification program. At the hearing, <mark>Mayer</mark> said he agreed with sending them to the program, which he described as lasting six to eight hours a day for about six to 10 weeks .\" The girls have indicated to me that they would run, \"<mark>Mayer</mark> said .\" I can't make them like their parents again. I can't make them love their parents again. But...I can give them the tools to make that happen. \"Rucki said after the hearing that he was\" elated \"by <mark>Mayer</mark>'s decision .\" I'm going to try to move forward now and get the girls the help they need, \"he said. Rucki said he was working on a plan to ensure the girls would not run away while being transported to the reunification program. Mom faces felony counts The girls' mother, Sandra Grazzini-Rucki, faces six felony counts of deprivation of parental rights, after Dakota County prosecutors alleged that she and another woman left the girls at the White Horse Ranch four days after they ran away. In a child protection petition filed last week, a Dakota County social worker said the girls told them that they were home-schooled and assisted with chores on the farm the last two years. One of the girls\" reported not having any contact with their mother \"in years' and assumed she was incarcerated .\" In their petition asking to intervene in that case, the Dahlens wrote that when the girls arrived, they had \"extreme personal fear, there was reasonable belief that they had been emotionally threatened with their life and physically abused .\" Over the next two and a half years, the Dahlens wrote, they helped the girls overcome some of their fears and grew to love the girls. \"We have provided the children with a home and shelter and all the necessities of life including food, clothing, health care, education, religious upbringing, love, support and companionship,\" the Dahlens wrote. \"The children developed friendships here and were a part of this community. The children have their ranch pets they have connected with and it has been therapeutic for them. The children indicated they wanted to stay at the ranch home .\" The judge's ruling effectively shut down that effort. <mark>Mayer</mark> noted that there were \"ongoing criminal investigations\" against the Dahlens. Outside the courtroom, the Dahlens declined to comment."}, {"articleID": "2017081420_00374373_W", "names": {"Matt Wilkinson": ["Q21091668", "Q6789524"], "Owen Wright": ["Q3359004", "Q7114703", "Q7114704"], "Julian Wilson": ["Q27068761", "Q6307688", "Q6307689"], "Gabriel Medina": ["Q3093867", "Q42394048", "Q5873447"]}, "date": "2017-08-14", "url": "https://www.northernstar.com.au/news/wilko-slips-in-world-title-race/3212323/", "content": "TIGHT FINISH: Byron Bay surfer <mark>Matt Wilkinson</mark> has dropped to third on the World Championship Tour rankings. Kelly Cestari Popular Stories Four dead after two horror crashes East Ballina fire may smoulder for days Woman has sex with three dogs: Didn't know it was illegal Local Real Estate Subscribe Now BYRON Bay surfer <mark>Matt Wilkinson</mark> has lost his lead on the World Championship Tour after an early exit at the Billabong Pro in Tahiti. He was eliminated in the fifth round while former Lennox Head surfer <mark>Owen Wright</mark> made it as far as the quarter-finals. <mark>Wilkinson</mark> drops two places in the world title race while <mark>Wright</mark> holds his spot at fourth. The Byron Bay resident has still won the most prizemoney on tour this year with South African surfer Jordy Smith now in first place. <mark>Julian Wilson</mark> has jumped to fifth after beating <mark>Gabriel Medina</mark> in the Billabong Pro final yesterday. It was his third win on the tour and best result at Tahiti. \"It has been a few years,\" <mark>Wilson</mark> said. \"It is so special to win. I am ecstatic and I have nothing left in me .\" I am just so happy and relieved to finally win an event again. \"It took so many good waves to win this event and I was lucky enough to get those .\" It really turned on for us in the final and we had some great opportunities, so I am just glad to get that special one. \"\"I've had a pretty steady start to the year and I am so happy to be in the mix now .\" With so many events left, I am really looking forward to it and I cannot wait for the rest of the year. \"Meanwhile, <mark>Wright</mark> has been a consistent performer since returning to the tour fulltime this year. He won the first event of the year on the Gold Coast and has made three quarter-finals since .\" At the start of the year I was just focused on health but now being in the title race is where I want to be, \"<mark>Wright</mark> said .\" I find myself trying to be really aware of what's going on. \"It was always going to be a tough ask for <mark>Wright</mark> at Tahiti after <mark>Medina</mark> nailed a perfect 10 on his first wave in the quarter-final. <mark>Medina</mark> has struggled to get past the semi-finals since winning the world title in 2014 .\" It feels good to be back in the game and now I am thinking about Trestles (Hurley Pro). \"It is Father's Day in Brazil and my dad is here, so that was a good present .\" 0"}, {"articleID": "2019071911_00014829_W", "names": {"James Earl Jones": ["Q203960", "Q2074528"]}, "date": "2019-07-19", "url": "https://www.highsnobiety.com/p/beyonce-the-gift-stream/", "content": "Last week Beyoncé nonchalantly announced she had curated and produced an accompanying album to Disney \"s The Lion King like it's no big deal. And, well, Bey just delivered. The Lion King: The Gift is finally here and it's the sonic cinema of our dreams. The album, out today, features contributions from a dazzling cast of collaborators, including JAY-Z, Blue Ivy Carter, Childish Gambino, Kendrick Lamar, Pharrell, and others. Referred to as a\" love letter to Africa, \"the record also boasts multiple African artists, such as Wizkid, Mr Eazi, Tekno, and Burna Boy. Behind the scenes, the album is just as impressive. The Gift features production from Diplo, Syd and Sounwave--who worked on Kendrick Lamar's DAMN. DJ Khaled is listed as a producer on the track\" MOOD 4 EVA, \"a collaboration between Beyoncé, JAY-Z, and Childish Gambino .\" I wanted to put everyone on their own journey to link the storyline, \"Beyoncé said in a press release .\" Each song was written to reflect the film's storytelling that gives the listener a chance to imagine their own imagery, while listening to a new contemporary interpretation. \"The album maintains a strong link to the Jon Favreau-directed film and is interspersed with interludes carrying dialogue from the characters. <mark>James Earl Jones</mark>, who voices Mufasa, opens the album. Earlier this month, Beyoncé (who voices Nala) released the first single from the project,\" Spirit \"with an accompanying dramatic video. You can now stream the full album below. Subscribe beyonce the gift the lion king Words by Sarah Osei Read Full Article"}, {"articleID": "2011111416_00121173_W", "names": {"Michael Wong": ["Q58332139", "Q713998", "Q718036"]}, "date": "2011-11-14", "url": "http://sys-con.com/node/2063104", "content": "dell & vmware deliver the enterprise hybrid cloud are financial services organizations risking security by avoiding cloud computing? from consolidation to enterprise private paas driving the transformation to next generation cloud data centers the inevitability of an open cloud war in the clouds: are you ready? cloud storage: myths and realities cloud expo new york: cto power panel cloud expo new york: ceo power panel cloud expo new york: cmo power panel roadmap to enterprise cloud computing the move is on: cloud strategies for businesses unlocking the value of the cloud today sap the journey to on demand - lessons learned from small, high-growth customers what if you could transform it your way, using cloud 2.0? changing the game: how to get a cloud service up and running in less than 30 days cisco cloud strategy, within and across data centers next cloud on the horizon: exascale to microservers cloud computing - extending your it infrastructure it's all cloud: blurring the line between dedicated and cloud service parting the clouds - evaluating clouds and cloud providers for the enterprise from the wires openmp expanding its scope to embedded systems and accelerators the openmp architecture review board (arb), a global industry alliance dedicated to developing and promoting the openmp api, today announced that three new members joined the consortium this year, bringing the total number of member organizations to 22. this allows openmp to expand its scope from the traditional smp systems to embedded systems and accelerators. over the last three years seven members joined: three vendors, three research laboratories and one academic institution. these collaborate with existing openmp arb members to develop the methods for programming next-generation parallel computing systems, which will include accelerators and embedded systems. nvidia - united states texas instruments - united states argonne national laboratory - united states oak ridge national laboratory - united states los alamos national laboratory - united states texas advanced computing centre - united states this is in addition to the existing members consisting of amd, cray, epcc, fujitsu, hp, ibm, intel, llnl, microsoft, nasa, nec, oracle, rwth aachen, stmicroelectronics, and compunity. \"these seven organizations bring a varied set of approaches and ideas that will help advance our goal of expanding parallel computing as we know it today,\" said <mark>michael wong</mark>, ceo of openmp and senior engineer at ibm. \"their energy and enthusiasm will add tremendous value to many projects already under way within the consortium .\" leader in thread-based standards expanding to embedded space \"openmp is the leader in establishing the standard in scientific thread-based programming. tacc is excited to join this collaborative effort that will continue the openmp success story into the new era of accelerated computing,\" said kent milfeld, member of hpc group at tacc. \"openmp has the potential to increase programmer productivity at all levels of computing, from embedded systems to supercomputers,\" said andy fritsch of texas instruments, \"our c66x dsps support the openmp api and we welcome this opportunity to further expand our openmp efforts in the embedded space .\" \"in our commitment to provide a many-core programming standard,\" says fran? ois bodin, caps cto, \"caps is very happy to contribute to such a dynamic consortium and in particular to the openmp accelerator effort .\" about openmp the openmp application program interface (api) is a multi-platform shared-memory parallel programming model for the c, c++ and fortran programming languages. jointly defined by a group of major computer hardware and software vendors and the user community, openmp is a portable, scalable model that gives shared-memory parallel programmers a simple and flexible interface for developing parallel applications for platforms ranging from multicore systems and smps, to embedded systems. openmp is supported on all architectures including unix and microsoft windows platforms. openmp is the most popular shared-memory parallel programming model in use today and is a cornerstone technology in high performance and technical computing. about the openmp architecture review board incorporated in 1999, the openmp arb is the non-profit corporation that owns the openmp brand, oversees the openmp specification and produces and approves new versions of the specification. the openmp arb helps to organize and fund workshops and other related events, and promotes openmp. the openmp arb's mission is to standardize shared memory multiprocessing apis. further information can be found at. openmp is a registered trademark of the openmp architectural review board. copyright? 2011 sys-con media, inc. - all rights reserved. about business wire copyright? 2009 business wire. all rights reserved. republication or redistribution of business wire content is expressly prohibited without the prior written consent of business wire. business wire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. subscribe to the world's most powerful newsletters subscribe to our rss feeds & get your sys-con news live! publish your article! please send it to editorial (at) sys-con. com! copyright? 1994-2008 sys-con publications, inc. all rights reserved. all marks are trademarks of sys-con media."}, {"articleID": "2019031216_00605459_W", "names": {"John Warner": ["Q15491306", "Q16194388", "Q19878573", "Q29643753", "Q464810", "Q54321981", "Q6263063", "Q6263071", "Q6263076"]}, "date": "2019-03-12", "url": "https://www.fitsnews.com/2019/03/12/sc-governors-school-upheaval-update/", "content": "SC SC Governor's School: Upheaval Update At least one key administrator \"no longer employed\" by SCGSAH...Share Tweet Published 5 mins ago on March 12, 2019 By FITSNews Students at the South Carolina Governor's School for the Arts and Humanities (SCGSAH) will reportedly receive an update on the administrative chaos currently enveloping this taxpayer-subsidized campus in downtown Greenville, S.C.. According to sources familiar with the situation, a school-wide meeting has been scheduled for 1:00 p.m. EDT to address reports of administrative upheaval at the government-funded institution. What exactly is going on? It is not immediately clear, however our news outlet has confirmed that the school's vice president of finance and administration--<mark>John Warner</mark>--is no longer employed by SCGSAH. In fact, <mark>Warner</mark>'s biographical page on the school website is currently displaying a 404 error. This news outlet has been told that \"multiple administrative positions at the school have been terminated,\" but as of this writing we cannot confirm any additional names. <mark>Warner</mark> (below), an ex-entrepreneur, was an integral part of the school's latest expansion project--a $4.3 million rehearsal center funded by South Carolina taxpayers. (Click to view) (Via: SCGSAH) \"When the school was built, they kind of ran out of money and skimped a little on the music space,\" <mark>Warner</mark> told The Greenville News last February. \"Right now, we have kids practicing in elevators and stairwells. This fills the need that we have for music teaching and teaching space and ensemble space .\" In addition to this grant, state taxpayers shelled out $12 million on the construction of this school back in 1999 and have been giving it $1.5 million annually--including a $1.5 million appropriation in the current version of the fiscal year 2019-2020 state budget. Located in Falls Park on the Reedy River, SCGSAH was founded in 1980 as a summer program but opened its doors as a full-time campus in 1999. The school accepts students from all over the state who have perfect (or near-perfect) grade point averages and who successfully complete auditions for one of its six art disciplines--dance, drama, creative writing, music, voice and visual arts. (SPONSORED CONTENT--STORY CONTINUES BELOW) (DOMINION ENERGY) Several parents of students at the school reached out to us on Monday in the aftermath of class delays and cancellations reportedly related to the administrative chaos. \"Something's not right,\" one concerned parent told us. Developing...*** WANNASOUND OFF? Got something you'd like to say in response to one of our stories? Please feel free to submit your own guest column or letter to the editor via-email HERE. Got a tip for us? CLICK HERE. Got a technical question or a glitch to report? CLICK HERE. Want to support what we're doing? SUBSCRIBE HERE. Banner: McMillan Pazdan Smith Related Topics: Falls Park greenville south carolina Reedy River SCGSAH South Carolina Governor's School for Arts and Humanities Don't Miss Sources: Upheaval At Greenville SC Governor's School Advertisement You may like Sources: Upheaval At Greenville SC Governor's School Greenville SC Arrests: Double Standard Alleged Follow-Up Files: Upstate Catholic School Scandal Upstate \"Drag Queen Story Hour\" Comes Off Without Incident Greenville Mental Health Advocate Arrested Again Greenville SC Police Chief Eyes City Manager Post Comments"}, {"articleID": "2017122920_00744656_W", "names": {"Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"], "Jason Mitchell": ["Q20895485", "Q24731481", "Q57047433", "Q6163124"]}, "date": "2017-12-29", "url": "http://www.latimes.com/entertainment/arts/culture/la-et-cm-john-wullbrandt-carpinteria-20171229-story.html", "content": "It was close to midnight when the call came from a panicked neighbor. A roaring wildfire was racing down the mountain and the flames would be there soon. It was time to get out. But John Wullbrandt, a prolific artist who'd been painting the landscape around La Granada Mountain since he was a teenager, refused to leave. He'd been preparing for this moment for the last 15 years. The 100-acre former cattle ranch just above Carpinteria in Santa Barbara County has been in Wullbrandt's family for four generations. Fire was always a threat. He and his partner, Jean-Claude Rivalland, had encased the house in corrugated steel, installed three 5,000-gallon water tanks and laid 300 feet of fire hose. Each year, they cleared vegetation around the house and had circled the structure with fire-resistant succulents. Decades of his paintings, including the works he cherished most, were tucked away in two steel shipping containers he believed could withstand a wildfire. They were going to stay, and fight. Shortly after midnight on Dec. 10, as the Thomas fire raced toward them, Wullbrandt took the northeast corner of the house, Rivalland the southwest. They tied their animals--two donkeys, two cows, a mule and a horse--to the side of the house and hosed them down with water. They figured their four dogs and two cats would be safe inside the house, and the tortoise could ride out the fire in the bathtub. Finally, the towering wall of flames reached them. They affixed their mask respirators and battled the onslaught with fire hoses, buckets of water and the animals' drinking troughs. The fire's deafening moan was so loud it sounded like a freight train, and the smoke so thick, they couldn't communicate or see one another. So they fought solo, each feeling he was the last man on Earth, ensconced in scalding heat, flying embers and whirling ash. Hal Wells / Los Angeles Times The 2017 Thomas fire in Ventura and Santa Barbara counties leaves behind vast swaths of charred landscape like this area in Upper Rincon Canyon. The 2017 Thomas fire in Ventura and Santa Barbara counties leaves behind vast swaths of charred landscape like this area in Upper Rincon Canyon. (Hal Wells / Los Angeles Times) When it was over, Wullbrandt had learned what near-death looks like: it is crimson and deep orange, as if rendered in the \"Naphthol Red\" and \"Cadmium Orange\" tubes of paint that he often works with. It is brilliant and murky at once, with flickers of gold, deep-green and blue, like the rolling hills, ripe fruit and sun-dappled beach in Wullbrandt's downtown Carpinteria murals. In the eye of the fire, not unlike when he's painting sometimes, Wullbrandt says he felt an otherworldly calm. \"It was like being in the epicenter of a blowtorch,\" Wullbrandt says. \"It took all of our might. But we were well prepared, we were confident, like when I paint--I had peace of mind. It was actually quite beautiful, haunting .\" An artist comes home With his tanned face, bushy, Santa Claus-like beard and soft, hazel eyes, 66-year-old Wullbrandt looks like a modern-day cowboy, rugged and sensitive. He grew up in Carpinteria, where his late father, Ernest C. Wullbrandt, served multiple terms as mayor. The sleepy beach town was spared from the fire, the largest in California history, but is still dangerously smoky more than a week after the first flames. As Wullbrandt strolls down the ash-speckled sidewalks of Wullbrandt Way--named after his father--he stirs a \"big man on campus\" reaction. Neighbors, friends, local business owners--some wearing dust masks as they run errands--nod as they pass by, often slapping him on the shoulder or stopping for hugs. Driving up the mountain to Wullbrandt's ranch in his old Mitsubishi SUV, the scene along the rocky, dirt road looks like a steam punk moonscape of blackened tree skeletons coated in gray ash. Crisped shipping containers and lone propane tanks litter empty lots where houses once stood, their barbed wire fences now bent and charred. Spindly curls of smoke swirl up from the canyon below, where tree trunk stumps still smolder, their roots still sparking with fire. The air is so thick with smoke, it leaves a bitter, burnt taste with every breath. When the wind picks up, it sends enormous, billowy clouds of gray ash into the car's path, obscuring the bumpy road ahead. Wullbrandt left the area in 1978 for San Francisco, he explains in the car, to forge a career as an artist. He was rejected by the commercial gallery establishment there--\"devastating\" at the time, he says--but he made a living over more than three decades through private commissions and selling artwork to luxury hotels and resorts around the U.S. mainland and Hawaii. His pastoral scenes of local flora and fauna and illustrated cultural histories have adorned hotel suites, lobbies and golf clubhouses. With San Francisco as his home base, Wullbrandt traveled the world for weeks at a time looking for inspiration--India, Nepal, Japan, South Africa--and making paintings. He spent time in 1994 as artist-in-residence for King George of Tonga, he says, creating interior murals for a new villa. Hal Wells / Los Angeles Times Once the Thomas fire had scorched off the needles on the ranch's cactus plants, the cows could enjoy the tasty succulents without pain. Planting cactus, aloe and agave proved fortuitous. Once the Thomas fire had scorched off the needles on the ranch's cactus plants, the cows could enjoy the tasty succulents without pain. Planting cactus, aloe and agave proved fortuitous. (Hal Wells / Los Angeles Times) His many public artworks have included a site-specific mural about the history of the Van Nuys Airport, a city-commissioned architectural trompe l'oeil on a building in San Francisco's Tenderloin district and multiple murals inside the Dole Food Co.'s corporate headquarters in Westlake Village. When San Francisco became too expensive for the artist and his longtime partner, they returned to Carpinteria and in 2002 bought \"El Rancho Botello,\" which his great-great uncle homesteaded in 1913. It was a working cattle ranch until last year. Wullbrandt, a longtime vegetarian, suddenly had to learn how to brand and castrate cows, buck hay and herd cattle. All the while, Wullbrandt painted, working intensely for weeks at a time either in his studio, a stand-alone cabin encased in metal, or outside two adjacent shipping containers situated about 600 feet from the house. Capturing the local landscape and its history is his passion. Nearly all of his neighbors own pieces of his art, he says. In 2013, the late \"Fast & Furious\" actor <mark>Paul Walker</mark> commissioned two pieces. One of his works is in the collection of the Carpinteria Valley Museum of History; others are on loan to local businesses. His most recent mural, chronicling agricultural development in Carpinteria, was unveiled in the town's center earlier this year. Knowing that his personal collection of paintings was safe in his studio--decades of carefully rendered observations--brought him a deep sense of purpose and accomplishment. \"So many of my murals have been destroyed over the years,\" he says, \"I felt it was responsible to hold onto some [art]--that I was in charge of holding onto my own history .\" A flaw in the plan The inferno, which cut through Wullbrandt's property like \"fast-flowing lava,\" torched 100-year-old oaks, ceanothus trees and swaths of coyote bush. It left the outer regions of the ranch burned to a crisp, the now-ashy landscape dotted with sizzled trees, charred antique farm equipment, shattered glass and fried rat and rabbit carcasses. Hal Wells / Los Angeles Times Painter John Wullbrandt and partner Jean-Claude Rivalland's ranch house just above Carpinteria was spared from the flames of the Thomas fire. Painter John Wullbrandt and partner Jean-Claude Rivalland's ranch house just above Carpinteria was spared from the flames of the Thomas fire. (Hal Wells / Los Angeles Times) Wullbrandt admits that some might consider it irresponsible to stay at the ranch and fight the fire, especially considering the sheriff's call, two days earlier, urging them to evacuate. \"But I'm passionate about where I live and I have the freedom to make that choice,\" he says. \"The ranch hadn't burned in over 100 years, so we knew it was coming, it was inevitable. We prepared. We spend 15 years being responsible .\" And the plan worked, at least in part. The house and its immediate surroundings were untouched, save for a 1-inch burn spot on the front porch step and tiny fire lashings on the porch posts. But all his preparations for protecting the art studio were for naught. It was burned into oblivion. Wullbrandt knew the studio and shipping containers had wood floors, but he was certain there was metal beneath them. That was not the case. The fire blew underneath and ignited everything inside, turning decades worth of paintings into ash. The oldest work that Wullbrandt lost was a series of charcoal figurative drawings from when he was in junior high school; his most treasured work lost was a still life painting of an Art Deco vase in which he felt he'd successfully experimented with the rules of composition. Most devastating, Wullbrandt says, is his ravaged archives: 50 years worth of letters, personal photographs and slides, portfolios of drawings and sketches, treasured books, maquettes for murals, pre-internet newspaper and magazine articles about him, along with TV and radio interviews on VHS and cassette tapes and documentation from early public art projects--all turned to dust. Hal Wells / Los Angeles Times Jean-Claude Rivalland, left, and partner John Wullbrandt fought off the approaching flames of the Thomas fire in their 100-acre El Rancho Botello just above Carpinteria. Rivalland hosed down the donkeys with water as flames approached. Jean-Claude Rivalland, left, and partner John Wullbrandt fought off the approaching flames of the Thomas fire in their 100-acre El Rancho Botello just above Carpinteria. Rivalland hosed down the donkeys with water as flames approached. (Hal Wells / Los Angeles Times) The corrugated steel barn, too, was destroyed; it also didn't have a metal floor, as Wullbrandt had thought. He lost three significant large-scale paintings that were housed there, along with family heirloom furniture, century-old tools his family used to build the ranch and his sister's collection of antique saddles. \"It was terrible,\" he says of watching his art studio burn during the fire. \"But I thought:\" We're alive. \"' Sorrow and liberation This is what rejuvenation looks like: It is\" Chromium Oxide Green \"and\" Light Blue Violet, \"like the tubes of paint Wullbrandt will use in the landscape paintings he's planning for an upcoming show. Just a week before the fire, he was voted into the Oak Group, an artists organization that raises money for environmental preservation causes. They'll exhibit his work at the Santa Barbara Public Library's Faulkner Gallery, as part of a group show, in the fall. He'll also have a solo show in 2018 at Carpinteria's Palm Loft Gallery, he says .\" The fire has given me an opportunity to show my work, it's given me something to head towards, \"Wullbrandt says. Losing so much in the fire, he says, has been oddly liberating. For years, Wullbrandt meant to organize his archives. But that would have required classifying his history, and he isn't one who likes to be pigeonholed, he says. He never clung to an artistic identity as a\" muralist \"or\" landscape painter, \"for example; instead, he's toggled between genres, experimenting with figure drawing, magical realism, abstraction, landscapes and set design, among other styles. Losing everything frees him from the daunting task of sorting his sprawling life's work and, for better or worse, from his personal narrative. It presented an opportunity to start anew .\" There's not being burdened with all the trappings of my life, \"he says .\" I thought that one day I would take all of this archival stuff and turn it over to someone; and somehow that would validate my career. But I don't have to do that now. I'm free to paint. \"Wullbrandt may be eerily at peace about the Thomas fire, but standing by the remains of his destroyed barn--now just layers of charred steel--he chokes up thinking about his ancestors .\" The fact that my family's ranch burned on my watch, \"he says, tears pooling in his now bloodshot eyes .\" It's been tough. But I know I did everything I could. My ancestors would be darn proud. \"The sorrow is compounded at the mention of his neighbors .\" My heart goes out to those who have lost far more than I have, \"he says. Still, Wullbrandt remains optimistic. In town, Wullbrandt stops at a small garage that was once his grandfather's plumbing shop and which he now uses for storage. He lifts the metal grate and there, piled up with the cardboard boxes, bikes and old furniture, was a glossy, 10-foot-wide painting of his ranch in better times, vibrant and alive. It depicts cowboys roping and herding cattle across dark green hills, the Carpinteria Valley and city of Santa Barbara stretching out to the sea in the background .\" Gone, all of this gone, \"he says, sweeping his hand across the landscape depicted in the painting. But with loss comes new life .\" It really will be like the Phoenix rising out of the ashes, the rebirth, \"he says .\" It will be so much more beautiful once it starts to rejuvenate. We're gonna see wildflowers we haven't seen in 100 years. \"Then Wullbrandt gazes up at a mountain ridge in the distance, now a thin, ash-gray paint stroke on the horizon .\" The spring--just wait. As an artist, I can't wait to paint it. \"CAPTION Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"CAPTION Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"CAPTION Justin Chang and Glenn Whipp on what critics awards mean for the Oscars, factoring in the academy's expanding membership. Justin Chang and Glenn Whipp on what critics awards mean for the Oscars, factoring in the academy's expanding membership. CAPTION Two men return home from World War II to work on a farm, where they struggle to deal with racism and adjusting to life after war in\" Mudbound. \"Video by <mark>Jason</mark> H. Neubert Two men return home from World War II to work on a farm, where they struggle to deal with racism and adjusting to life after war in\" Mudbound. \"Video by <mark>Jason</mark> H. Neubert CAPTION It's quite the challenge trying to interview the energetic child stars of\" The Florida Project. \"It's quite the challenge trying to interview the energetic child stars of\" The Florida Project. \"CAPTION Director Dee Rees talks about casting Mary J. Blige, Carey Mulligan and <mark>Jason Mitchell</mark> for her film\" Mudbound. \"After loving <mark>Mitchell</mark>'s performance in\" Straight Outta Compton, \"Rees said,\" I'd be so lucky to get him in my film. \"Director Dee Rees talks about casting Mary J. Blige, Carey Mulligan and <mark>Jason Mitchell</mark> for her film\" Mudbound. \"After loving <mark>Mitchell</mark>'s performance in\" Straight Outta Compton, \"Rees said,\" I'd be so lucky to get him in my film. \"deborah.vankin @ latimes.com Follow me on Twitter: @ debvankin ALSO The Cold War as a museum: At the Wende, one man's 100,000-piece collection finds a new home\" Unsettled' explores the terrain--physical and political--of the West Shepard Fairey: Have we lost the \"street' in street art?"}, {"articleID": "2018022820_00026186_W", "names": {"Graham Hughes": ["Q18705278", "Q5592926"]}, "date": "2018-02-28", "url": "http://montrealgazette.com/opinion/opinion-chess-tips-for-english-speaking-quebecers", "content": "5 / 5 Opinion: Chess tips for English-speaking Quebecers Yes, call out Quebec Liberals when we fall short, but also shine a light on our opponents, MNA David Birnbaum says. David Birnbaum, Special to Montreal Gazette Published on: February 28, 2018 | Last Updated: February 28, 2018 2:50 PM EST The next Quebec election is expected Oct. 1. \"I join the premier, Minister Kathleen Weil and all of my caucus colleagues in hoping that English-speaking Quebecers will engage fully in the upcoming campaign, with questions, suggestions and criticism of all of the parties that wish to form the next government,\" Liberal MNA David Birnbaum writes. <mark>Graham Hughes</mark> / THE CANADIAN PRESS Share Adjust Comment Print Chess anyone? Robert Libman (\"Anglos should seize opportunity to be heard,\" Opinion, Feb. 27) suggests that English-speaking Quebecers \"play the strategic chess game and be a factor in the run-up to the election .\" I could not agree more. I have spent most of my professional life advocating on behalf of those one million Quebecers who are English-speaking, and I continue to do so in my current roles. I've known and worked with Robert Libman over the years, and absolutely subscribe to the importance he places on community mobilization. However, I do not share his often-expressed view that English-speaking Quebecers have been too apathetic and passive. Nor do I buy into his description of us as \"anglophones,\" a somewhat pejorative term that leaves out thousands of English-speaking Quebecers from cultural communities who view that tired term as exclusive of them. As Premier Philippe Couillard has insisted and demonstrated, we are all Quebecers, point final. That said, I join the premier, Minister Kathleen Weil and all of my caucus colleagues in hoping that English-speaking Quebecers will engage fully in the upcoming campaign, with questions, suggestions and criticism of all of the parties that wish to form the next government. They should properly call for results from our ground-breaking creation of a designated bureaucracy and cabinet post for relations with the English-speaking community across Quebec. They should be expecting renewed access plans for the delivery of health and social services in English, progress on French second-language instruction, job support for young English-speaking entrepreneurs and better access to the civil service and government appointments. On those questions and others, they will want to shine a light not only on us, but on all of our opponents as well. Are they comfortable with Coalition Avenir Québec Leader François Legault's summary dismissal of our new Secretariat responsible to the English-speaking community? His plan to limit immigration and to institute obligatory language tests for newcomers? His plan to scrap linguistic and universally elected school boards? His vague and fuzzy conversion to the Canadian federation? His distaste, expressed and on the record in the National Assembly, at the thought of a judge wearing a kippa? Are English-speaking Quebecers actually ready to consider the Parti Québécois and Leader Jean-François Lisée, whose short stint as a minister included nominal responsibility for us \"anglophones\" ? His single evident accomplishment in that role was to free up 20 grand for a song called Our Home. Are they prepared to support a party that promises to talk separation only on every second Tuesday? Québec solidaire unabashedly promotes separation. Has anybody ever seen the slightest credible budget plan to support their utopian list of promises? Or, will English-speaking Quebecers carefully examine our government's record and its vision for a modern, prosperous Quebec? Will they look at a recent Liberal Party resolution to offer free French second-language instruction to the English-speaking adult population? Action plans on seniors, culture and infrastructure that will include specific measures aimed at our community? An approach on immigration, diversity and French-language promotion that is inclusive and forward-looking? A long-standing conviction and record predicated on English-speaking Quebecers as allies rather than adversaries? And, are an impending fifth balanced budget, 250,000 new jobs, a level of economic growth that is the envy of the rest of Canada not English-speaking issues as well? Yes, we can do better, and we count on the English-speaking community to call us out when we don't. We invite the community to exercise that same vigilance in evaluating our opponents. That should make for a fair game of chess, and may our community come out the winner. David Birnbaum is the member of the National Assembly for D’Arcy-McGee, parliamentary assistant to the ministers of Education and Higher Education and chair of the Montreal Caucus of the Liberal government."}, {"articleID": "2009100119_00030375_W", "names": {"James Bell": ["Q14948622", "Q15734074", "Q21456508", "Q39072412", "Q56427301", "Q56597564", "Q57031000", "Q59070199"]}, "date": "2009-10-01", "url": "http://mediaroom.kbb.com/video-kelley-blue-book-launches-trusted-marketplace-first-one-stop-shop-car-pricing-research-buying", "content": "director of public relations robyn eckard 949.268.3049 twit this video: kbb.com launches the trusted marketplace; first one-stop shop for car pricing, research and buying kelley blue book introduces new-and used-car classified site featuring all-new best-match technology prnewswire /--kelley blue book has launched the trusted marketplace (sm), a new online consumer car shopping experience that can be accessed through its top-rated web site www.thetrustedmarketplace.com. for the first time, consumers now are able to complete their vehicle research, conduct new - and used-vehicle inventory searches and find their next car, all on one convenient and easy-to-use web site. the trusted marketplace also brings a unique technology platform to the classified vehicle experience, returning best-match cars from consumers' search criteria, rather than vehicles dealers have paid to be presented at the top of vehicle search results. recent online automotive shopping studies find that 75 percent of new-vehicle buyers use the internet during their shopping process and more than six in 10 used-car buyers purchase a vehicle that they find online. with more than 13 million vehicle shoppers visiting kbb.com each month, kelley blue book is in a unique position to assist car buyers across the united states in finding the vehicle that best meets their needs. the trusted marketplace provides the right car in the right place at the right price. with the introduction of the trusted marketplace, kelley blue book extends its popular vehicle pricing and research information to include the next natural step in the process helping kbb.com's millions of monthly visitors find their next new or used car. integrating the company's best-in-class online vehicle research with highly detailed dealer inventory listings makes kbb.com a one-stop resource from research to purchase. this integration allows consumers to confidently collect the trusted information they need, from finding the value of their current car, to researching new-car reviews, videos, vehicle ratings, pricing and side-by-side comparisons, to determining the make and model they would like to purchase, and ultimately finding a local dealer with that exact vehicle on their lot. kelley blue book, the trusted resource (®) will integrate blue book (®) suggested retail values into used-car classified listings to assist consumers in determining whether or not the car is a good deal. the trusted marketplace provides consumers with an unparalleled experience in finding their next new or used car due to its unique search platform, which reveals \"best matches'--a list of cars that most closely correspond with a shopper's search criteria as well as applied intelligence gained from millions of customer queries and transactions. when searching for a vehicle online, shoppers can search confidently on the trusted marketplace and rely on kelley blue book to return a complete set of newly listed vehicles that best match their criteria, with more vehicle details, photos and information available .\" the trusted marketplace is a one-stop shop that provides assistance with everything from trusted kelley blue book trade-in values (®) to in-depth research and advice to locating the perfect vehicle at a dealer near you, \"said <mark>james bell</mark>, executive market analyst for kelley blue book's kbb.com .\" what was once a tedious and time-consuming process is now easy and convenient, with everything car buyers need from start to finish all in one place on kbb.com. \"to keep up with kelley blue book news and information, find us on facebook. about kelley blue book (1926, kelley blue book, the trusted resource ®, has provided vehicle buyers and sellers with the new and used vehicle information they need to accomplish their goals with confidence. the company's top-rated web site,"}, {"articleID": "2019110718_00150363_W", "names": {"Ryan Day": ["Q18921628", "Q402985"]}, "date": "2019-11-07", "url": "https://www.cleveland.com/osu/2019/11/how-co-defensive-jeff-hafley-has-had-an-immediate-impact-on-ohio-state-football-and-its-recruiting.html", "content": "COLUMBUS, Ohio--Jeff Hafley was one of the first hires for <mark>Ryan Day</mark> as Ohio State football's head coach, and in 11 months, he's proven to be his best. That's shown in both the play of the current group of players in the secondary. Along with the commits, he's garnered in that period, making him the No. 4 recruiter in the country according to 247Sports. His first achievement as the Buckeyes' co-defensive coordinator was getting a recommitment from Lejond Cavazos of IMG Academy (Fla.). That process started the moment he got settled into Columbus, and Cavazos was the first recruit Hafley reached out to. That decision paid off, and four months later, Cavazos was back in Ohio State's 2020 class and has been one of the program's most prominent advocates ever since. Hafley made Cavazos feel comfortable with him. He gave him other reasons to fall in love with Ohio State that didn't require Urban Meyer to be a part of it. Now, as a commit, he's seen the strides Ohio State has taken in the secondary. The relationship he's built with the current players has given him confidence in the future of the defensive backs at Ohio State. Everyone he's talked to has had nothing but positive things to say about their new position coach. \"All of them have changed,\" Cavazos told cleveland.com. \"They say that it's a totally different atmosphere. It's a better technique that they've learned. He's letting them be them and get loose. Hearing that from the players was a big set off for me. I know if he's helping them get to where they want to get to, he can for sure help me .\" While making headway on the recruiting trails, which eventually led to 13 commitments between June and July--four of which he had a hand in--he was also spending time revamping a secondary that had a less than stellar 2018. His first step was sitting down with Okudah and watching every single target the junior cornerback had last season. \"He gave feedback after every single rep,\" Okudah said. \"After listening to him in that one-hour session, I was like\" Ok, he knows what he's talking about .' I listened to his plans for making me better and after that, I just bought in. \"Okudah and the rest of the secondary buying into Hafley's words have resulted in 10 interceptions this season, which sits at No. 2 in the Big Ten. The Buckeyes have also allowed a nation's best 1,062 passing yards per game this season. Jordan Fuller has experienced the Jeff Hafley effect as both from both Cavazos' and Okudah's perspectives. During his time at Rutgers, Halfeyr recruited Fuller's brother, Devin, who eventually chose UCLA. He got a chance to see how Hafley made recruits and their families feel comfortable .\" He was probably my brother's favor coach/recruiter, \"Fuller said .\" I definitely thought he was a great guy. Me and my brother think the same, so whoever he likes, I like. It's just grown from there since he's been here. \"Now he's experiencing it as one of his players, and the feedback has been just as positive. But there's a chance that the entire starting secondary will only get one year of Hafley. Fuller and Damon Arnette are fifth-year seniors, while Okudah and Shaun Wade could both head for the NFL after three seasons. That's played a role in Hafley's success as a recruiter. It'll be open season for every spot in the secondary, and many of the guys in Ohio State's 2020 recruiting class are talented enough to get on the field right away. They've watched how Ohio State has played this season and are ready to continue that tradition of elite-level defensive backs in the upcoming seasons .\" That's the plan, \"Cavazos said .\" It's up for grabs, and it's pretty much whoever wants it at that point. \"More Ohio State coverage Why the CFP committee loves Ohio State, and the results of the pizza challenge: Buckeye Talk Podcast What No. 1 in the first College Football Playoff ranking means for Ohio State football Why Penn State emerged as the biggest threat to Ohio State's Big Ten championship aspirations Ohio State vs. Penn State football will be a noon kickoff on Nov. 23 Ohio State basketball overcomes rough first half to knock off Cincinnati 64-56 in season opener LSU vs. Alabama matchup has implications for the Heisman, playoff: Heisman Watch How can Ohio State football's offense get better? Ohio State vs. Maryland for football, tuition, academics, sports money and more, by the numbers Joe Burrow asked to compare OSU-Michigan to Alabama-LSU: Buckeye Breakfast Get Buckeyes Insider texts in your phone from Doug Lesmerises: Cut through the clutter of social media and communicate directly with the award-winning OSU football reporter, just like you would with your friends. Sign up for insight on the Buckeyes in your phone for $3.99 per month. Buy Buckeyes gear: Fanatics, Nike, Amazon, Lids Buy Buckeyes tickets: StubHub, SeatGeek, Ticketmaster Stream Buckeyes games live: fuboTV, ESPN +, Sling"}, {"articleID": "2011062408_00051621_W", "names": {"Tim Burton": ["Q56008", "Q7803257"], "Elton John": ["Q16209157", "Q2808"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2011-06-24", "url": "http://newkerala.com/news/2011/worldnews-13995.html", "content": "hollywood-news eva green still takes acting classes london, june 24: french actress eva green still takes acting classes from her childhood drama teacher and even invites her to film sets for tips. \"it's my old drama teacher that i used to have in drama school years ago when i was young. we talk a lot about the character because there are so many possibilities, so many options, so it's good to explore them with someone else. i love prepping, it's great,\" contactmusic.com quoted green as saying. the 30-year-old, known for her roles in \"kingdom of heaven\" and bond movie \"casino royale\" , is currently working with a dialect coach to perfect her american accent for <mark>tim burton</mark>'s new film \"dark shadow\" , in which she is playing johnny depp's wife. anna paquin \"doesn't mind vampire hubby stephen moyer biting fans' boobs' shane warne, liz hurley make 1st red carpet walk at <mark>elton john</mark>'s ball <mark>michael jackson</mark>'s brother jermaine says family a fan of bollywood one-man policy giving rise to suicide attacks in pakistan: nawaz sharif video of couple kissing during vancouver riot proves it really happened pakistan offers\" guarded' response on afghan troop pullout plans"}]