[{"date": "2017-11-30", "url": "http://www.goal.com/en-india/news/7083/isl/2017/11/30/40650222/isl-2017-gregory-nelson-chennaiyin-fcs-dutch-wing-wizard-snubbed-", "content": "Indian Super League Goal By Ashwin Muralidharan (Tweets @ AshwinMNair10) 06:07 Share Close Comments Image Courtesy: ISL The former AZ Alkmaar winger has made a bright start to life in the South Indian city and is loving the excitement and colour surrounding the ISL...It is not often that a footballer, especially someone from Europe, decides to snub offers from European teams to go play for an Indian club. Yes, Indian Super League (ISL) outfit Chennaiyin FC's Dutch recruit Gregory Nelson did exactly that and has had absolutely no regrets over his decision. Nelson has had a sparkling start to life at Chennaiyin FC, coming off the bench and helping Chennaiyin FC almost stage a comeback in their opening game against FC Goa before playing a stellar role in their 3-0 hammering of NorthEast United in the second game of the season. In an exclusive chat with Goal, the winger revealed that the lure of coming to India was too tempting to pass up, with the good words put in by former Chenaniyin FC and Delhi Dynamos midfielder <mark>Hans Mulder</mark> also playing a part in convincing him. \"I did have offers from Europe this season but I was close to joining Chennaiyin FC and I really wanted to come to India. So, I decided to take up this offer (instead),\" he said. \"I have some friends who have already played here like <mark>Hans Mulder</mark>. He's a very good friend of mine. They told me only good things about India. So, it was an easy decision,\" he expressed before adding that he was close to playing the ISL in the previous editions as well. \"In the previous two ISL seasons, I was close to coming to India. I spoke to some agents and they tried to bring me to India. I've known about the league also for some time now .\" I didn't expect the league to be so organised when I came in. Everything around the matches are well organised. And the games are like big happenings and I like it very much. \"However, he felt that the country's training facilities had a lot of scope for improvement but expressed confidence that in the coming years, they will improve as well .\" The schedule (of the league) and travelling is very good but the training facilities can be better. The field where we are training is good but in Europe, we have five-to-six very good pitches and you get gyms and other facilities which are not here. But I'm sure in four-to-five years, it will come here as well and the facilities will be better, \"he opined. The winger went on to state that while he would like to continue playing in the ISL in the future, the timing of the league makes it hard for overseas footballers to remain match fit and further their careers. In doing so, he pointed out one drawback of the ISL expanding to a four-month long league from the point of view of overseas players .\" As of now, I really like it here. I want to see how the season plays out. But I don't mind staying longer here. I like it and I want to help the (Indian) players get better. But you never know what will happen, \"he shared before adding,\" It is difficult (to commit for long time), with the ISL being of short duration. \"You are free only in March and in Europe, the next window is open in June I think. So, the other teams will view you as a player who hasn't played for two-to-three months. So, it is a bit scary for the foreign players who come here. Last year, we could have signed in January for some other team and then come back next season .\" The 29-year-old who came through the youth ranks of Eredivisie club AZ Alkmaar might not have had a storied career in football, with him making just the one senior appearance for AZ before meandering off to countries lke Ukraine, Bulgaria, Kazakhstan etc, but holds the distinction of being handed his senior team debut by none other than former Manchester United manager Louis van Gaal. Van Gaal was in charge of AZ from 2005 till 2009 and he picked Nelson for the team's Eredivisie game against Heracles Almelo in September 2007. \"Yes, I was given my debut my Louis van Gaal. He is a very tough coach who backed talent. No matter how young you are, if you were good enough to play, he would pick you,\" recollected Nelson. Interestingly, Chennaiyin FC is Nelson's third club in 2017 with him cutting short his association with Kazakhstan's Kaiser without making an appearance for them due to personal issues before turning out for Bahrain's Al Muharraq club. \"I was supposed to go to Kazakhstan (at the start of the year) and they promised me several things but didn't deliver on them. So I decided to break (the agreement) and I went home .\" (Then) I went to Al Muharraq and our goal was to win the league. But we failed and the coach who brought me there was fired. The new coach brought new players and I decided to leave. \"Before the ISL season started, Chennaiyin coach <mark>John Gregory</mark> described Gregory Nelson as someone who can take on and beat any defender. The Dutchman concurs with the view and gave an insight into how he likes to play .\" I think my strength is a combination of pace and trickery. I'm not the fastest player going around but in a one-on-one, I'm very difficult to defend and I think that is my biggest strength, \"he stated. Article continues below One of Nelson's biggest achievements in his career has been playing in the Europa League with Bulgarian side CSKA Sofia in the 2010-11 season where they played against the likes of FC Porto and Besiktas. Nelson wrapped up the chat by recollecting some of his most memorable moments, including his Europa League bow and the 2012 Ukraine Cup final loss against Shakhtar Donetsk, which had the likes of Henrikh Mkhitaryan, Willian and Fernandinho in the starting XI that day .\" Playing in the Europa League (was certainly one of the best memories). Also, winning the Cup and the Super cup in Bulgaria (with CSKA Sofia). We (Metalurh Donetsk) lost in the Ukraine Cup final agianst Shakhtar Donetsk (2012) who had some really big players. \"Indian Super League Chennaiyin Pune City v Chennaiyin Pune City G. Nelson Comments ()", "articleID": "2017113006_00318280_W", "names": {"John Gregory": ["Q28016802", "Q49783724", "Q55739798", "Q6236260", "Q942124"]}}, {"date": "2017-12-01", "url": "http://alpha.supersport.com/football/fifa-world-cup-2018/news/171201/Portugal_clash_concerns_Spain_boss", "content": "Portugal clash concerns Spain boss 01 December 2017, 19:44 Tweet Spain coach Julen Lopetegui believes an enticing clash with European champions Portugal, led by World Player of the Year Cristiano Ronaldo, to start their World Cup campaign leaves the 2010 champions with little room for error in Russia. The Iberian neighbours will be favourites to progress from Group B after also being paired with Morocco and Iran in Friday's draw in Moscow, but they face each other first up in Sochi on June 15. Real Madrid's Ronaldo is just one of a number of Portugal's top players who ply their trade in Spain, but Lopetegui was keener to point to the overall qualities Portugal showed in claiming their first major trophy at Euro 2016 just 18 months ago. \"Straight away it isn't the time to talk about individuals,\" Lopetegui told Spanish TV station Cuatro. \"Portugal have won an important title and, moreover, very recently. They are the champions of Europe, they have fantastic players and we are talking about the highest level .\" Indeed, Portugal survived without an injured Ronaldo for the vast majority of the Euro 2016 final to shock hosts France thanks to an extra-time goal from Eder. However, Portugal have failed to beat Spain in seven previous meetings at major tournaments, including as the Spanish went on to lift their only World Cup in South Africa in 2010. \"What matters to us is to play a great game when the time comes and to be capable of beating them,\" added Lopetegui. \"The rest is history .\" Lopetegui was at least happy with Spain's draw in terms of logistics with their expected base in Krasnodar just a half an hour flight away from Sochi before facing Iran in Kazan and Morocco in Kaliningrad. \"Until it is official I can't say anything, but it is more than probable the base will be (Krasnodar),\" he added. \"Knowing the distances there could be in Russia, it is quite balanced .\" Iran's Portuguese coach <mark>Carlos Queiroz</mark>, who also had a brief spell in charge at Real Madrid, was more enthusiastic as he claimed he couldn't have wished for a better draw. \"Personally I am very happy because it is a group with two teams from two very special places for me,\" said <mark>Queiroz</mark>. \"It will be a very tough competition for us, it would have been no matter what group we were in, but when you are with Spain, a World Cup winner, and Portugal, European champions, it couldn't be better for me .\" © AFP", "articleID": "2017120117_00733484_W", "names": {"Carlos Queiroz": ["Q313209", "Q9697298"]}}, {"date": "2017-12-02", "url": "http://www.baltimoresun.com/ct-senate-tax-bill-20171201-story.html", "content": "Republicans pushed a nearly $1.5 trillion tax bill through the Senate early Saturday after a burst of eleventh-hour horse trading, as a party starved all year for a major legislative triumph took a giant step toward giving President Donald Trump one of his top priorities by Christmas. \"Big bills are rarely popular. You remember how unpopular\" Obamacare' was when it passed? \"Senate Majority Leader Mitch McConnell, R-Ky ., said in an interview, shrugging off polls showing scant public enthusiasm for the measure. He said the legislation would prove to be\" just what the country needs to get growing again. \"Presiding over the Senate, Vice President Mike Pence announced the 51-49 vote to applause from Republicans. Sen. Bob Corker, R-Tenn ., was the only lawmaker to cross party lines, joining the Democrats in opposition. The measure focuses its tax reductions on businesses and higher-earning individuals, gives more modest breaks to others and offers the boldest rewrite of the nation's tax system since 1986. Republicans touted the package as one that would benefit people of all incomes and ignite the economy. Even an official projection of a $1 trillion, 10-year flood of deeper budget deficits couldn't dissuade GOP senators from rallying behind the bill .\" Obviously I'm kind of a dinosaur on the fiscal issues, \"said Corker, who battled to keep the bill from worsening the government's accumulated $20 trillion in IOUs. The Republican-led House approved a similar bill last month in what has been a stunningly swift trip through Congress for complex legislation that impacts the breadth of American society. The two chambers will now try crafting a final compromise to send Trump. After spending the year's first nine months futilely trying to repeal President Barack Obama's health care law, GOP leaders were determined to move the measure rapidly before opposition Democrats and lobbying groups could blow it up. The party views passage as crucial to retaining its House and Senate majorities in next year's elections. Democrats derided the bill as a GOP gift to its wealthy and business backers at the expense of lower-earning people. They contrasted the bill's permanent reduction in corporate income tax rates from 35 percent to 20 percent to smaller individual tax breaks that would end in 2026. Congress' nonpartisan Joint Committee on Taxation has said the bill's reductions for many families would be modest and said by 2027, families earning under $75,000 would on average face higher, not lower, taxes. The bill is\" removed from the reality of what the American people need, \"said Senate Minority Leader Chuck Schumer, D-N.Y. He criticized Republicans for releasing a revised, 479-page bill that no one can absorb shortly before the final vote, saying,\" The Senate is descending to a new low of chicanery. \"\"You really don't read this kind of legislation,\" Sen. <mark>Ron Johnson</mark>, R-Wis ., told home-state reporters, asked why the Senate was approving a bill some senators hadn't read. He said lawmakers needed to study it and get feedback from affected groups. Heather Long When Senate Republicans introduced their tax bill in mid-November, they faced competing interests: Some senators thought it wasn't generous enough for working-class families. Others thought it didn't deliver enough to business owners. As Republicans moved closer to a final vote on the bill Friday...When Senate Republicans introduced their tax bill in mid-November, they faced competing interests: Some senators thought it wasn't generous enough for working-class families. Others thought it didn't deliver enough to business owners. As Republicans moved closer to a final vote on the bill Friday...(Heather Long) Democrats took to the Senate floor and social media to mock one page that included changes scrawled in barely legible handwriting. Later, they won enough GOP support to kill a provision by Sen. Pat Toomey, R-Pa ., that would have bestowed a tax break on conservative Hillsdale College in Michigan. The bill hit rough waters after the Joint Taxation panel concluded it would worsen federal shortfalls by $1 trillion over a decade, even when factoring in economic growth that lower taxes would stimulate. Trump administration officials and many Republicans have insisted the bill would pay for itself by stimulating the economy. But the sour projections stiffened resistance from some deficit-averse Republicans. But after bargaining that stretched into Friday, GOP leaders nailed down the support they needed in a chamber they control 52-48. Facing unyielding Democratic opposition, Republicans could lose no more than two GOP senators and prevail with a tie-breaking vote from Vice President Mike Pence, but ended up not needing it. Leaders' changes included helping millions of companies whose owners pay individual, not corporate, taxes on their profits by allowing deductions of 23 percent, up from 17.4 percent. That helped win over Wisconsin's <mark>Johnson</mark> and Steve Daines of Montana. People would be allowed to deduct up to $10,000 in property taxes, a demand of Sen. <mark>Susan Collins</mark> of Maine. That matched a House provision that chamber's leaders included to keep some GOP votes from high-tax states like New York, New Jersey and California. The changes added nearly $300 billion to the tax bill's costs. To pay for that, leaders reduced the number of high-earners who must pay the alternative minimum tax, rather than completely erasing it. They also increased a one-time tax on profits U.S.-based corporations are holding overseas and would require firms to keep paying the business version of the alternative minimum tax. Jeff Stein High-ranking Republicans are hinting that, after their tax overhaul, the party intends to look at cutting spending on welfare, entitlement programs such as Social Security and Medicare, and other parts of the social safety net. House Speaker <mark>Paul Ryan</mark>, R-Wis ., said recently that he wants Republicans...High-ranking Republicans are hinting that, after their tax overhaul, the party intends to look at cutting spending on welfare, entitlement programs such as Social Security and Medicare, and other parts of the social safety net. House Speaker <mark>Paul Ryan</mark>, R-Wis ., said recently that he wants Republicans...(Jeff Stein) Sen. Jeff Flake, R-Ariz .--who like Corker had been a holdout and has sharply attacked Trump's capabilities as president--voted for the bill. He said he'd received commitments from party leaders and the administration \"to work with me\" to restore protections, dismantled by Trump, for young immigrants who arrived in the U.S. illegally as children. That seemed short of a pledge to actually revive the safeguards. The Senate bill would drop the highest personal income tax rate from 39.6 percent to 38.5 percent. The estate tax levied on a few thousand of the nation's largest inheritances would be narrowed to affect even fewer. Deductions for state and local income taxes, moving expenses and other items would vanish, the standard deduction--used by most Americans--would nearly double to $12,000 for individuals and $24,000 for couples, and the per-child tax credit would grow. The bill would abolish the \"Obamacare\" requirement that most people buy health coverage or face tax penalties. Industry experts say that would weaken the law by easing pressure on healthier people to buy coverage, and the nonpartisan Congressional Budget Office has said the move would push premiums higher and leave 13 million additional people uninsured. Drilling would be allowed in the Arctic National Wildlife Refuge. Another provision, knocked out because it violated Senate budget rules, would have explicitly let parents buy tax-advantaged 529 college savings accounts for fetuses, a step they can already take but which anti-abortion forces wanted to inscribe into law. There were also breaks for the wine, beer and spirits industries, Alaska Natives and aircraft management firms. Associated Press writers Andrew Taylor in Washington and Scott Bauer Milwaukee contributed to this report.", "articleID": "2017120208_00241901_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Ron Johnson": ["Q1741083", "Q19879325", "Q20639273", "Q21229090", "Q27923350", "Q3892458", "Q3940971", "Q7363984", "Q7363985", "Q7363986", "Q7363987", "Q7363989", "Q970272"], "Susan Collins": ["Q22279", "Q7647692"]}}, {"date": "2017-12-02", "url": "http://www.firstpost.com/entertainment/padmavati-controversy-juhi-chawla-condemns-protesters-for-giving-death-threats-4238577.html", "content": "Padmavati controversy: Juhi Chawla condemns protesters for giving death threats Juhi Chawla, Aanand L Rai and <mark>Anurag Kashyap</mark> are the latest to speak in support of Padmavati, its director Sanjay Leela Bhansali, as well as its cast. Deepika Padukone in Padmavati poster (left); Juhi Chawla (right). Images via Facebook Juhi Chawla also opened up about the controversy in an interview to PTI. While she refrained from commenting on the film or the story line and did not get into the issue of the distortion of history, her prime concern remained the death threats that Deepika Padukone had received. She said that people should react to things with sensitivity and that tempers should not flare in this manner. \"I am not speaking for Padmavati the film but the threats were not right. You watch the same heroine in other films, go crazy for her, you love her so much, she has a tremendous fan following. Then, to threaten her like this, I didn't feel was right,\" she said. \"At the end of the day, films are made by directors, by the team [and] you're playing a part. Just for that reason, I'd say a little sensitivity is [needed] and people should have patience. Not flare up and say things like that, that too to a woman,\" she added. In a recent interview to PTI, Aanand L Rai said that there is a sense of fear in the industry. \"There is a lot of fear for all of us and not just makers,\" he said. Rai added that the trend of fighting threats is fading away, and that the courage filmmakers used to show before seems to be missing. \"And that is missing because of the kind of fear you, me, all of us, even the makers and everyone is facing,\" he added.", "articleID": "2017120215_00074689_W", "names": {"Anurag Kashyap": ["Q2839609", "Q56248257"]}}, {"date": "2017-12-02", "url": "http://www.courant.com/sports/college/hc-college-fb-big-12-1203-20171202-story.html", "content": "ARLINGTON, Texas--Baker Mayfield and No. 2 Oklahoma were happy to have another game, even with the potential consequences. The Sooners definitely left no question about whether they will be in the playoff. Heisman Trophy front-runner Mayfield threw four touchdowns and the Sooners staked their playoff spot with a 41-17 win over No. 10 TCU in the return of the Big 12 championship game Saturday. \"The reason I came back was to play for a national title,\" Mayfield said. \"The most exciting thing about today is we control our destiny. That's all out in front of us .\" With their record 11th Big 12 title, the Sooners (12-1, No. 3 CFP) are a lock to be in the College Football Playoff for the second time in three seasons. They are the only Big 12 team to make the four-team playoff format that started in 2014. The Sooners probably would have made the playoffs even if the Big 12 hadn't played its first championship game since 2010. But a loss would have likely knocked the Sooners out of contention. \"I'm really proud of our group for not listening to all the noise on the outside and we've played pretty good ball here at the end,\" Sooners coach Lincoln Riley said. \"We knew there was going to be a championship game and that was just going to be part of our journey if we wanted to get to this place .\" Oklahoma jumped out to a quick 17-0 lead, including <mark>Caleb Kelly</mark>'s 18-yard fumble return for a touchdown after running back Kyle Hicks' turnover on the first offensive play by TCU (10-3, No. 11). <mark>Kenny Hill</mark> threw two TD passes to get the Horned Frogs within 24-17 at halftime, but Oklahoma scored twice on its first three offensive plays after the break. \"Big plays, we gave up a couple. Two plays basically in the second half,\" TCU coach <mark>Gary Patterson</mark> said. \"The worst thing that could happen in the third quarter happened .\" A week before the Heisman Trophy winner will be named, Mayfield finished 15-of-23 passing for 243 yards and take game MVP honors. The first two touchdowns were to tight end <mark>Mark Andrews</mark>. <mark>Hill</mark> opened the second half with three consecutive incompletions. On the first play after the punt, Mayfield hit Mykel Jones for a 55-yard catch-and-run score. On fourth-and-1 from the Oklahoma 41 on the next drive, <mark>Hill</mark> bootlegged to the right side. Big defensive end Ogbonnia Okoronkwo chased him toward the sideline before Parnell Motley delivered the crushing blow that kept TCU's quarterback from getting a first down. Two plays later, Marquise Brown made an impressive over-the-shoulder grab for a 52-yard TD and a 38-17 lead. <mark>Hill</mark> finished 27-of-37 for 234 yards passing, and led TCU with 51 yards rushing. The Takeaway TCU: The Horned Frogs had allowed only six points (two field goals) combined after halftime in their last seven games. Even Oklahoma was scoreless in the second half of its 38-20 home win over TCU three weeks ago. The 41 points are the most TCU has allowed this season. Oklahoma: The Sooners clinched their third straight Big 12 title, all since former Texas Tech transfer Mayfield took over as the starting quarterback. Their 11th Big 12 title overall was the first without Bob Stoops, the coach for their last national title in 2000 who resigned unexpectedly last summer. Riley, at 34 the youngest FBS head coach, is only the fifth coach in FBS history with no previous head coaching experience at a four-year college to win at least 12 games in his debut season. Title Games Oklahoma is 8-1 in Big 12 championship games, winning seven of them between 2000 and 2010, when the Sooners beat Nebraska in the league's last championship game until Saturday. TCU has previously won or shared conference titles in the old Southwest Conference, Conference USA, the WAC, the Mountain West and Big 12. But this was the Frogs' first conference title game. Up Next TCU: The Horned Frogs could still possibly make it into one of the New Year's Six bowl games, and if not likely will be the Big 12 representative in the Alamo Bowl. Oklahoma: The Sooners wait to find out who they will play and in which national semifinal game, the Rose Bowl or Sugar Bowl.", "articleID": "2017120300_00237865_W", "names": {"Caleb Kelly": ["Q28095229", "Q5019263"], "Gary Patterson": ["Q25189982", "Q5525722", "Q5525724"], "Kenny Hill": ["Q17523843", "Q20090908", "Q6391078", "Q6391081"], "Mark Andrews": ["Q1408804", "Q18763812", "Q21557955", "Q21557956", "Q26000923", "Q3293985", "Q364746", "Q41790042", "Q55093469", "Q6766550"]}}]