[{"date": "2017-12-03", "url": "http://www.heraldcourier.com/sports/vhsl-a-state-football-chilhowie-s-cale-didn-t-flinch/article_9cd9065c-d7e3-11e7-9861-27ef32756276.html", "content": "GALAX, Va.--Galax High School football coach <mark>Mark Dixon</mark> recognizes a talented player when he sees one and he saw one on Saturday in Chilhowie junior quarterback Zack Cale. \"I knew how good he was,\" <mark>Dixon</mark> said. \"And he was even better than what I thought .\" Cale was a dual threat dynamo on Saturday--as he has been all season--in helping Chilhowie claim a 25-21 victory over Galax in the VHSL 1A state semifinals. Cale threw for 204 yards and hooked up with Will Russell and Lucas Doss for scores, while also gaining 97 yards on the ground. The Galax defense was kept on its toes by the 6-foot, 170-pound speedster, who eluded Maroon Tide tacklers all day. \"He bought a lot of time scrambling,\" <mark>Dixon</mark> said. \"We got pressure a lot, but then we just got wore down chasing him. In the end, when we needed to get pressure, I thought we were a little bit tired and then we got a little cautious of how we were rushing because he kept breaking the pocket so much .\" There were some mistakes by Cale--he threw an interception and lost a fumble--but you take the bad with the good when it comes to a player of his caliber. \"That's who he is,\" said Chilhowie coach <mark>Jeff Robinson</mark>. \"He's a playmaker. He's going to lose yardage sometimes and then he's going to make the plays. He made more of those plays today than he didn't .\" Cale has a gift of being able to put the play which just occurred out of his mind as soon as it ends and focusing on the moment at hand. Take for instance how calm, cool and collected he was on the eight-play, 76-yard drive late in the fourth quarter that put Chilhowie ahead to stay. He completed a 3rd-and-10 pass to Russell that gained 25 yards. He had an 18-yard completion to <mark>Nick Jones</mark>. There was a 36-yard strike to Doss on the penultimate play of the drive. He culminated the march by handing it off to Greg Sanchez, who plowed into the end zone from the 2-yard line with 2:16 left as a 21-18 deficit was turned into a 25-21 lead. \"I knew I made some mistakes and I knew I had to step up and make some more big plays,\" Cale said. There was one play in particular that showed what Cale can do. \"Number 69 [Christian Brown] chased him for about 30 yards one time, still didn't get him and Zack completed a 30-yard pass,\" <mark>Robinson</mark> said. \"That's a backbreaker when you're playing defense that hard .\" Cale was all smiles after a performance that put Chilhowie in Saturday's state championship game against Riverheads. \"This is great,\" Cale said. \"We've been working for this all summer. It's a great feeling for all of us .\" As the confident QB took questions from a local media member following the game, a teammate stood behind him and kiddingly observed. Cale didn't flinch. Nothing seems to rattle this guy. \"Zack Cale's got ice water in his veins,\" <mark>Robinson</mark> said. \"How many plays did he make in that game?\" Too many to count.", "articleID": "2017120304_00473475_W", "names": {"Jeff Robinson": ["Q16193823", "Q16229109", "Q6174821", "Q6174823"], "Mark Dixon": ["Q6767380", "Q6767382"], "Nick Jones": ["Q16229192", "Q17198222", "Q24799774", "Q3876016", "Q52892180", "Q7027374", "Q7027375"]}}, {"date": "2017-12-03", "url": "https://thepewterplank.com/2017/12/03/buccaneers-participating-nfls-cleats-cause-campaign-2017/", "content": "Comment TAMPA, FL--OCTOBER 29: <mark>Justin Evans</mark> #21 of the Tampa Bay Buccaneers celebrates after defending a pass in the second quarter of a game against the Carolina Panthers at Raymond James Stadium on October 29, 2017 in Tampa, Florida. (Photo by Joe Robb ins/Getty Images) This week, several Buccaneers players will be wearing custom cleats to show a little of their personality and a lot of their support. In one of the better marketing moves made by the NFL, \"My Cause, My Cleats' is a favorite week of mine. Players on the Buccaneers roster, and across the NFL, will get to break most of the league's equipment rules this week to show support for various organizations and causes. I don't know if every player is taking advantage of this, but there certainly are a good amount. The team has been joining the players in getting their messages out there. Some have taken to social media to bring theirs to life. I looked in both places, and the following are just some of the contributions from Bucs this weekend. Gerald McCoy The All-Pro defensive tackle gives a shout-out to his childhood with his appreciation of the difficulties experienced in single parent homes. As a father, I can say raising a family is hard enough sometimes with the dedicated partner I have found in my Wife. I couldn't imagine doing it without her. It's a silent battle often times as many of those in this situation make it look easier outside their homes while the good fight continues inside it. On one side of each cleat there is a depiction of\" Super Mom' and \"Super Dad' in full on hero mode. On the alternate side of each shoe, the same parent with the love of their children glowing in their eyes as they battle everyday problems. It's a touching tribute, and has an obvious flare of McCoy's own personality with the comic book design. Must Read: Bucs to Watch in Green Bay A post shared by <mark>Chris Baker</mark> (@ bigbake92) on Dec 2, 2017 at 11:00 am PST <mark>Chris Baker</mark> It's Bakers first year as a Buccaneers player, but not his first making a difference with the opportunity he's gotten. Knowledge is power, so they say, and <mark>Baker</mark> believes in this mentality completely. His foundation is the vehicle he uses to reach out to youth in Connecticut and in Washington DC where he played for the Redskins for five seasons prior to joining Tampa Bay. Using free youth camps, establishing literacy programs, and providing mentorship to his benefactors, this player is ensuring his legacy just begins when he steps off the field. <mark>Mike Evans</mark> Racial tensions have been a major part of the last two NFL seasons, and the Buccaneers were not immune to it either. On two occasions, wide receiver <mark>Mike Evans</mark> took a knee to demonstrate his displeasure with perceived injustices in our country. His cleats this weekend will show his efforts to help bridge these gaps with the simply stated,\" Sideline Racism \", painted onto his shoes. The Ross Initiative in Sports for Equality (RISE) is described on their website as,\". . an unprecedented alliance of professional sports leagues, organizations, athletes, educators, media networks, and sports professionals using sports to bring people together. . \"At the end of the day, we may not all understand each other's strife and struggles, but we can all work towards a more unified tomorrow. His cause is just this, and <mark>Evans</mark>' cleats are a beautiful representation of this message. Next: Knowing the Green Bay Packers Jameis Winston The Buccaneers quarterback is no stranger to working with kids, and as he makes his return to the field, he'll bring his Dream Forever Foundation with him. He'll have another partner though too. JDRF works to help find ways to improve the lives of people battling type 1 diabetes (T1D). According to their website JDRF.org, the organization is the leading funder for T1D research. They envision a world without the affliction and are working to accelerate life-changing steps towards treatment and curing of this terrible disease. These aren't all of the Buccaneers wearing special cleats today. Find the rest on the team's website, and click each image to get a little background on why each player chose the designs and causes they did. Locked on Bucs is on the air with a look at the return of Jameis Winston and a Week 13 Preview! Which ones are your favorite? Let me know in the comments, on Facebook, or find me on Twitter. Also find me now as one half of the Locked on Bucs podcast team, with episodes airing Monday--Friday every week of the 2017 NFL Season. Enjoy the rest of your weekend, and Go Bucs!", "articleID": "2017120316_00480260_W", "names": {"Chris Baker": ["Q1076963", "Q20200808", "Q20987938", "Q42718943", "Q5105791", "Q5105792", "Q5105794", "Q5105795", "Q5105796", "Q5105797"], "Justin Evans": ["Q15975248", "Q30122523", "Q6317576"], "Mike Evans": ["Q14951064", "Q1621683", "Q25189874", "Q6846717", "Q6846719"]}}, {"date": "2017-12-05", "url": "http://roosterteeth.wikia.com/wiki/Bruce_Greene?diff=43867&oldid=43789", "content": "Revision as of 11:38, November 27, 2017 (edit) LazarouDave (wall | contribs) (Not trivia - belongs in main section (and is now there, thanks Deven)) ← Older edit Latest revision as of 18:15, December 5, 2017 (edit) (undo) Deventhakkar (wall | contribs) Line 89: Line 89: [http: //www.imdb.com/name/nm3163851/ IMDb] [http: //www.imdb.com/name/nm3163851/ IMDb] − [[Facebook]] + [http: //rtxsydney.com/wp-content/uploads/sites/18/2016/10/bruce.jpg Company headshot] Latest revision as of 18:15, December 5, 2017 \"Hump Day!\" --Followed by <mark>Bruce</mark> humping Adam \"<mark>Bruce</mark> is the\" cool guy' (suuuuure) of Funhaus. He is mostly known as the most serious out of the group when it comes to handling the channel and is second-in-command towards Adam, oh yeah and also for his farts. \"- Funhaus wiki <mark>Bruce</mark> <mark>Paul Greene</mark> IV [Source] <mark>Bruce</mark> <mark>Paul Greene</mark> IV (born August 12, 1981) is an American actor, voice actor, show and podcast host, content creator and content producer as well as an Internet and YouTube personality, who is best known for his work on the Funhaus division of Rooster Teeth as well as co-creating and formerly co-hosting and working on Machinima Inc's Inside Gaming division with Adam Kovic. <mark>Bruce</mark> is known for his humping, farting, and laughing at Funhaus. His main role, though, is to collaborate with and annoy Adam as he plays through and suffered from terrible games, all in the name of entertainment. He presently serves as the main host and lead content creator and producer for the YouTube channel and gaming group called Funhaus, a division of Rooster Teeth as early as February of 2015 after previously being a part of Inside Gaming and Machinima. In addition, he is also the main Head and General Manager of Funhaus. Before fame, he was a DJ at the radio station in Santa Barbara. He later worked as a segment producer for Attack of the Show and reviewed technology products. In addition to this, he studied Computer Science at the University of California, Santa Barbara. Contents [show] Description Edit <mark>Bruce</mark> is perhaps the wackiest member of the Funhaus gang. His most known trademark is his distinctive beard and wheezing laugh. It is said that <mark>Bruce</mark> has never ever shaved his body once. This assumption is supported by the fact that he has some royal chest and body hair, which can be seen in the latest strip video from him here. Also it's a fact that <mark>Bruce</mark> is\" shredded as hell \"as many people like to say, although he's hiding his muscles most of the time because he doesn't want Adam to become jealous. <mark>Bruce</mark>'s Bio Edit\" Born in the small town of Los Angeles, <mark>Bruce</mark> always wanted to become the world's greatest unicyclist At the tender age of 4, he was performing the fabled \"double puckle chuck\" when he fell, hit his head, and went into a coma. Fourteen years later, he woke up on the radio as a DJ in Santa Barbara with no knowledge of how he got there. As time passed, he learned to live and love again, and he was mentored by a jolly old fat man who showed him the 1 ′ s and 0 ′ s of life. As he was walking down the aisle at his college graduation, he grabbed the computer science diploma from his mentor and shook his hand, asking what was next. He whispered, \"Half-life 3,\" and <mark>Bruce</mark> never saw him again. Then <mark>Bruce</mark> worked on Attack of the Show at G4 and reviewed tech products for years. The end. \"--<mark>Bruce</mark>'s Bio...According to InsideGaming.com Early life and education Edit <mark>Bruce</mark> grew up primarily in Los Angeles County, California where he attended elementary and secondary school. Ever since he was <mark>young</mark>, <mark>Bruce</mark> had always wanted to become the world's greatest unicyclist during his childhood. At the age of 4, in 1985, he fell down, hit his head, and went into a coma after being severely injured. He was hospitalized following this injury and fortunately recovered. Following this incident and for his education, he attended high school at Dos Pueblos High School in Goleta, California in 1995, graduating four years later. [1] [2] [2] Fourteen years after the unicycle incident, in 1999, he attended the University of California, Santa Barbara (UCSB) in Santa Barbara, California where he primarily studied, and later received a degree Computer Science, graduating in the Class of 2004. Career Edit Pre-Rooster Teeth Edit After graduating from university at UCSB with a degree in Computer Science, he first worked as a DJ (disc jockey) at a radio station in Santa Barbara, California called KJEE. Following his stint as a DJ, <mark>Bruce</mark> became employed and then later worked on the television show, Attack of the Show (TV Series) on, and the now defunct cable channel G4 where he was primarily working as a segment producer. He worked on four episodes from October 13, 2008 until October 16, 2008. At G4 <mark>Bruce</mark> produced such segments as Gaming with the Troops and MMA Chokehold. He also produced technology segments for G4 which he describes as\" gadget porn \"and reviewed technology products for several years. <mark>Bruce</mark> described what he did on the show as:\" I produce Gadget porn, as well as Gaming with the Troops and MMA Chokehold (all segments on the show). \"While in college <mark>Bruce</mark> made a video of his friends butthole farting. <mark>Bruce</mark> then worked at NBCUniversial as a Producer. He also worked as a Segment Producer on Esquire Network from May 2007 to July 2011. After being employed by Machinima Inc in late 2008, he replaced Mike Rouse as the co-host during the relaunch of Inside Halo as Inside Gaming alongside Adam. <mark>Bruce</mark> was also hosting a show at the time for Machinima called Wrecknology [3] using the skill he learned at G4 what he called\" gadget porn. \"He would review technology products for several years and then destroy it, as there are two notable episodes where Adam Kovic makes a appearance. In late January of 2015, <mark>Greene</mark> and Kovic, along with James Willems, Lawrence Sonnag, Matt Peake, Joel Rubin and Sean\" Spoole \"Poole, departed from Machinima to form heir own independent network, but later formed a partnership with Rooster Teeth, moving into their new LA offices and studios, rebranding themselves as\" Funhaus \". In mid April of 2016, <mark>Bruce</mark> became the new boss of Funhaus after Joel Rubin amicably resigned to work at SourceFed and SourceFedNERD. Role at Machinima's Inside Gaming Edit <mark>Bruce</mark> was the co-anchor of the Inside Gaming Daily news show, with Adam. <mark>Bruce</mark> was often the one who puts forward the unpopular/negative opinion on games. <mark>Bruce</mark> was also known for his humping of Adam on Wednesdays on the news show. As of now the show is currently unknown, if the same traditional way of their Gaming Daily is going to continue, we hope that we can enjoy more <mark>Bruce</mark> Humps. Role At Funhaus Edit As of April 2016, <mark>Bruce</mark> serves as the main host and lead producer for the YouTube channel and gaming group called Funhaus, a division of Rooster Teeth as early as February of 2015 after previously being a part of Inside Gaming and Machinima. In addition, he is also the main Head of Funhaus. He started doing parodies of songs for a few weeks at the beginning of Demo Disk. Some songs include Uptown Funk (Uptown Disk), Say it Ain't So (Say it Ain't Disk), Hotline Bling (Demo Bling), and many, many more. Joel will usually sing back-up while Lawrence and Sean dance, sometimes seductively, all while James and Adam suffer for three or four minutes. He announced that he would stop making parodies on a Demo Disk published on January 11, 2016. Family Life Edit <mark>Greene</mark> was born and raised in Los Angeles, California where he presently resides. As of October 28, 2017, he is in a relationship with Autumn Farrell of Sugar Pine 7, after previously dating and amicably breaking up with Bethany Feinstein. [4] [5] He is neighbours with fellow Funhaus member Matt Peake. [1] Gallery Edit Hump Day BananaBruce <mark>Bruce</mark> in his natural habitat Beautiful <mark>Bruce Young</mark> <mark>Bruce</mark> and Adam\" Bones \"Brouillard <mark>Young</mark> <mark>Bruce</mark> Trivia Edit <mark>Bruce</mark> loves all things Mexican, particularly the restaurant chain, Chipotle. <mark>Bruce</mark>'s favorite season is summer. <mark>Bruce</mark> addressed his farting with the fact that he had a surgery and had to take antibiotics which altered his digestive system, making him unable to burp and only can fart. Adding to this fact, <mark>Bruce</mark> states that he refused to fart in front of his ex-girlfriend, Bethany. <mark>Bruce</mark> is a direct descendant of Pocahontas. <mark>Bruce</mark> made a video called\" Bath time with lil <mark>Bruce</mark> \", he wears a diaper and bathes himself in the video. <mark>Bruce</mark> <mark>Greene</mark> has two apps about him featured on the Google Play Store,\" Brucie Bird \"and\" Pocket <mark>Bruce</mark>! \"<mark>Bruce</mark> was one of the lead singers (Alongside with Adam Kovic) in a song named\" We love video games' (Which was created by the people behind \"Thanksgiving' and\" Chinese Food'). He has appeared on the TV show \"Attack of the Show'. He was childhood friends with Funhaus editor Adam\" Bones \"Brouillard. External Links Edit RT Profile Personal YouTube IMDb Company headshot References Edit ↑ https: //en.wikipedia.org/wiki/Dos_Pueblos_High_School #Notable_alumni ↑ 2.0 2.1 https: //www.facebook.com/Brucegreene/about? lst=100008224415072% 3A1065193583% 3A1487530252 & section=education & pnref=about ↑ Wrecknology playlist ↑ https: //twitter.com/_rufhaus/status/924507124591247362? lang=en ↑ https: //www.reddit.com/r/SugarPine7/comments/79f01q/bruce_and_autumn/ Navigation Edit Funhaus Cast Adam Kovic · <mark>Bruce</mark> <mark>Greene</mark> · James Willems · Lawrence Sonntag · Matt Peake · Elyse Willems Crew Omar de Armas · Jacob Fullerton · <mark>Daniel Schneider</mark> · Don Casanova · Adam Brouillard · Jon Smith Former Sean Poole · Joel Rubin Current Shows Demo Disk · Dude Soup · Fan Show · Funhaus: FAQ · Fullhaus · Funhaus Shorts Gameplay · Open Haus · Rest Of · Your Comments Retrieved from\" http: //roosterteeth.wikia.com/wiki/Bruce_Greene? oldid=43867 \"Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected. Categories: Rooster Teeth Productions Rooster Teeth Staff Male Staff Funhaus August Birthday", "articleID": "2017120519_00078336_W", "names": {"Bruce Young": ["Q4978508", "Q4978509"], "Daniel Schneider": ["Q444366", "Q57032800", "Q57209218"], "Paul Greene": ["Q7150999", "Q7151000"]}}, {"date": "2017-12-06", "url": "http://www.foxnews.com/us/2017/12/06/southern-california-wildfires-trigger-mass-destruction-hurting-families-economy.html", "content": "close What to know: Huge wildfire rips through Southern California A massive wildfire in Southern California has spread over 48 square miles and continues to expand. A look at the destruction and what we know about it. Thousands of people in Southern California were forced to evacuate on Tuesday as wind-whipped wildfires continued to blaze across Ventura County. Officials said that the so-called \"Thomas Fire,\" which started Monday about 60 miles northwest of downtown Los Angeles, has caused 27,000 people to evacuate, destroyed at least 150 structures and has scorched roughly 65,000 acres so far. At least 12,000 additional structures are threatened by the wildfire as well. The cause of the fire is currently unknown. No fatalities have been confirmed yet, Ventura County Fire Chief Mark Lorenzen said Tuesday. One unnamed firefighter has reportedly been injured and three others were burned, the Los Angeles Times reported. President Trump tweeted about the wildfires on Wednesday, writing: \"Our thoughts and prayers are with everyone in the path of California's wildfires. I encourage everyone to heed the advice and orders of local and state officials. THANK YOU to all First Responders for your incredible work!\" Our thoughts and prayers are with everyone in the path of California's wildfires. I encourage everyone to heed the advice and orders of local and state officials. THANK YOU to all First Responders for your incredible work! https: //t.co/g9y9PkB352--Donald J. Trump (@ realDonaldTrump) December 6, 2017 In light of the Thomas Fire, here's what you need to know about California wildfires. How do the fires start? Roughly 95 percent of wildfires are caused by humans, <mark>Scott McLean</mark>, an information officer at the California Department of Forestry and Fire Protection, or Cal Fire, told Fox News. A simple task--like mowing the lawn, throwing a cigarette butt out of a window, or parking a car on dry grass--can spark a fire, he said. For instance, if a rock hits the lawn mower's metal blades, that's usually enough friction to create a spark that can ultimately start a fire, he said. And the heat from a car's catalytic converter, a device that's located underneath that controls its exhaust emissions, can reach up to 1,200 degrees Fahrenheit--enough heat to create a fire if the car is parked over dry, flammable grass. \"It only takes one spark to start a fire,\" he said. How are wildfires stopped? Officials are currently unsure what sparked the wildfires in Southern California. (The Associated Press) All wildfires can bring mass destruction. But the way each fire is stopped varies, <mark>McLean</mark> said. In other words, \"the different vegetation and different scenarios up and down the state\" impact how each fire is handled. \"You don't just throw resources at a wildfire,\" he said. \"It's like a battle--you have to think what will be the most effective .\" Cal Fire usually depends on a mix of bulldozers, fire engines, inmate crews, and helicopters or airplanes, which disperse things like fire retardant, to stop wildfires. Using containment lines, or large areas where a bulldozer cuts away vegetation to the point where only dirt remains, is very common, he said. But this isn't always an accessible option. \"\"What would increase the fire's speed, what would slow it down?,'\" he asked. \"Helicopter and airplanes are ineffective with winds over 30 miles an hour, and bulldozers can't always get in there .\" Strong wind gusts also cause problems when putting out or controlling wildfires, he said. Regional atmospheric patterns that develop in the fall create dry, hot wind gusts that can sometimes reach 80 miles per hour. These winds can create so-called \"spot fires\" --which is when an ember from the main wildfire gets blown into a nearby bush or field, ultimately creating a second fire. \"It's like a blowtorch .\" - <mark>Scott McLean</mark> \"It's like a blowtorch,\" he said. Rain is typically welcome, as it can slow down or deter the fire, he said. But it can also create muddy conditions for bulldozers and fire crews which impacts how they can combat the blaze. As for the Thomas Fire, however, <mark>McLean</mark> said resident safety comes first--hence the evacuation that took place on Tuesday. He added that Cal Fire is expecting more resources to come to the Ventura County area, adding that \"several strategies and tactics are in place\" to stop or control it. \"It's a case by case basis, and it's extremely fluid,\" he said. Why have California's wildfires been so destructive recently? <mark>McLean</mark> explained that California has faced a significant drought over the past five years, which created a lot of dead vegetation across the state. Like other mediterranean climates, winter time brings rain, which fills up water reserves and helps new vegetation to grow. California also had a record amount of rainfall in spring of 2017. But the summer's heat dried out that new growth, and, combined with the autumn winds, means \"a lot of fuel was created for wildfires,\" he said. The Santa Ana winds are currently pushing the Thomas Fire. <mark>McLean</mark> said there are 102 million or more dead trees in California--all potential fuel for wildfires to blaze across the state. \"There's a long road ahead of us. The fires we've dealt with recently--like the Thomas Fire--are all indicators of what we're having to deal with in California for the next few years,\" he said, adding that many of these fires have been wind-driven. \"Rains are not a cure all with one winter--it will take several years of winters to get moisture back into plants and reservoirs .\" Additionally, unlike tornados and hurricanes, wildfires don't really have a season, <mark>McLean</mark> said. At this point, \"there's pretty much no fire season. It's year round,\" he said. An impact on wine and entertainment Wildfires could also impact the state's wine industry from an economic standpoint, wine experts previously told Fox News. The California wine industry generates $57.6 billion in annual economic activity in the state and $114 billion in the country, according to statistics from the Wine Institute, a California-based public policy organization. The wine industry can be affected by wildfires in California. (The Associated Press) About 325,000 Californians are employed by the wine industry in California. The industry also contributes $17.2 billion in wages annually in the state. Additionally, it generates $7.2 billion in tourism expenditures in California. What's more, the Hollywood Reporter reported Tuesday that HBO suspended its second season of \"Westworld\" due to a 200-acre brush fire that broke out near where the show was filming. Fox News' Travis Fedschun contributed to this report. Madeline Farber is a Reporter for Fox News. You can follow her on Twitter @ MaddieFarberUDK.", "articleID": "2017120617_00804229_W", "names": {"Scott Mclean": ["Q21622011", "Q7436835", "Q7436836"]}}]