[{"date": "2017-12-06", "url": "http://www.dailysabah.com/mideast/2017/12/07/majority-of-americans-oppose-moving-embassy-to-jerusalem-poll-suggests", "content": "Majority of Americans oppose moving embassy to Jerusalem, poll suggests DAILY SABAH WITH AGENCIES YOUR E-MAIL VERIFICATION CODE U.S. President Donald Trump's controversial move on Jerusalem has received strong opposition from the U.S. public, including Republicans, a survey has revealed. According to a new poll conducted by the University of Maryland, The Middle East and Russia: American attitudes on Trump's foreign policy, found that a strong majority of Americans (63 percent), including 44 percent of Republicans oppose moving the U.S. embassy in Israel from Tel Aviv to Jerusalem. Interestingly, the poll, which was conducted last month, suggests that an overwhelming majority of Americans, 81 percent, including 71 percent of Republicans, favor President Trump relying on experts for Middle East diplomacy instead of his son in law and former lawyer. \"Among Democrats, those who want the U.S. to take neither side of the conflict have grown to 77 percent from 69 percent last year, while the number of those who want to take Israel's side outright has dropped to only 13 percent, from 17 percent. In contrast, a majority of Republicans, 58 percent want the U.S. to take Israel's side,\" the report said. The poll also revealed that 57 percent of Democrats want to see sanctions or \"more serious action\" over Israeli settlement construction, while 43 percent of Americans support imposing sanctions or more serious actions. The competing claims to East Jerusalem, the section of the city captured by Israel in 1967, have frequently boiled over into deadly violence over the years. East Jerusalem is home to the city's most sensitive Jewish, Muslim and Christian holy sites, as well as its 330,000 Palestinian residents. The U.S. has never endorsed Israel's claim of sovereignty over any part of Jerusalem and has insisted its status be resolved through Israeli-Palestinian negotiation. The mere consideration of Trump changing the status quo sparked a renewed U.S. security warning Tuesday. America's consulate in Jerusalem ordered U.S. personnel and their families to avoid visiting Jerusalem's Old City or the West Bank and urged American citizens, in general, to avoid places with increased police or military presence. Trump, as a presidential candidate, repeatedly promised to move the U.S. Embassy. However, U.S. leaders have routinely and unceremoniously delayed such a move since President Bill Clinton signed a law in 1995 stipulating that the U.S. must relocate its diplomatic presence to Jerusalem unless the commander in chief issues a waiver on national security grounds. Key national security advisers, including Secretary of State Rex Tillerson and Defense Secretary Jim Mattis, have urged caution, according to officials, who said Trump has been receptive to some of their concerns. According to a Reuters report on Tuesday, several U.S. officials had said on condition of anonymity that news of the plan to recognize Jerusalem as Israel's capital had kicked up resistance from the State Department's Near Eastern Affairs Bureau (NEA), which deals with the region. \"Senior [officials] in the NEA and a number of ambassadors from the region expressed their deep concern about doing this,\" said one official, saying that the concerns focused on \"security .\" Another U.S. official said the consensus the U.S. intelligence estimates on the U.S. recognition of Jerusalem as Israel's capital was that it would risk triggering a backlash against Israel and also potentially against U.S. interests in the Middle East, the Reuters report added. Also quoted in the same report, <mark>Daniel Benjamin</mark>, a former U.S. counterterrorism official now at Dartmouth University, had a simple message: \"This is playing with fire .\" ", "articleID": "2017120621_00117709_W", "names": {"Daniel Benjamin": ["Q1160048", "Q5216534"]}}, {"date": "2017-12-07", "url": "http://trollslum.wikia.com/wiki/SuicidalArsonist?diff=42667&oldid=42491", "content": "Revision as of 04:41, November 26, 2017 (edit) 108.44.197.110 (wall) (FUCK) ← Older edit Latest revision as of 02:35, December 7, 2017 (edit) (undo) SuicidalArsonist (wall | contribs) Line 244: Line 244: * Toraum's Doc outfits are based on Peter Capaldi and <mark>Peter Davison</mark>'s doctors from Doctor Who. * Toraum's Doc outfits are based on Peter Capaldi and <mark>Peter Davison</mark>'s doctors from Doctor Who. * Toraum's full title is Professor Sir Toraum Zwilig, CH, KBE, CB, FRS, MD.. * Toraum's full title is Professor Sir Toraum Zwilig, CH, KBE, CB, FRS, MD.. + * Jay doesn't believe in blood colour being related to Zodiac, so they just decided \"Teal-Blooded Gemini, why not?\" Anyone who criticises Toraum for his sign in front of Jay will have their kneecaps broken. [[Category: Teal/Blue Blood]] [[Category: Teal/Blue Blood]] [[Category: Male]] [[Category: Male]] Latest revision as of 02:35, December 7, 2017 Contents [show] Basic Information Edit Toraum Zwilig If you think about it. . We all go through change in our lives even when we don't expect it. I wasn't expecting to go blind and lose my right arm, but it happened. AKA The Doctor, Doc, Toto Title Heir of Space Age 9 Alternian Solar Sweeps (19 Human Years) Screen Name suicidalArsonist Typing Style Toraum: Replaces O with 0, i with 1, S with 2. The Doctor: Uses perfect grammar and syntax. Symbol Gemini Strife Specibi Firekind Fetch Modus Burn, Formerly Deck of Cards Relations The Novelist/Arsonist (Ancestor) Krakau Zwilig (Dancestor) Lodove Planci/Zwilig (Wife) Khimio Vuqtoz (Moirail) Jay (Best Friend) Planet Land of Light and Fire Likes History, Electro Swing Music https: //www.youtube.com/watch? v=7QU1nvuxaMA Toraum Zwilig, later known as Doc, is a male teal blooded troll. He is an Heir of Space. His associated zodiac sign is Gemini. The first part of his handle, suicidal, is referring to the fact his Accident was viewed as one of his many suicide attempts by his Moirail and best friend. The second part of his handle, arsonist, is referring to the fact he was often fascinated with fire before the incident. Etymology Edit Toraum is a combination of two german words. \"Tot\" meaning dead, referencing his personality. and \"Raum\" meaning Space, referencing his god tier. \"Zwilig\" was shortened from Zwillinge, meaning Twins in german. Introduction Edit> Be that one blind blue guy. Your name is TORAUM ZWILIG. You like to play with CARDS, suprisingly you can actually do some pretty amazing tricks. Your favourite card is the ACE OF SPADES. You used to study your ANCESTOR, how he was first a well known NOVELIST, but then he went mad and became known as the ARSONIST. You tried to copy one of his habits of lighting candles in his hive so he could still see in the dark, but you ended up dropping one and set your entire house ablaze. You lost your RIGHT ARM and EYESIGHT that day, but luckily your moirail found you at the right time and possibly saved you from certain death. Your trolltag is suicidalArsonist and you tend t0 2peak 1n a manner that 1s referenc1ng the c0d1ng 0f a c0mputer. Fire Edit Toraum spent most of his time inside studying, mainly studying novels from the Novelist, and learning about his slow descent into madness. Toraum was on the last novel that he had wrote before he was murdered, and found a note in the back. To Whom It May Concern, I don't have much time left in this world, they're coming for me. I can sense that they are going to kill me, just by his nature. I try to keep calm around him, but he seems to be devoid of all emotion. They claim to be a \"Time Lord\" , whatever that means. . They're a very dangerous person, let's just hope he doesn't come for you. They said they were going to come after my next of Kin, and said one of them is going to study all of my novels and then die in an \"Accident\". . Let's both hope you're safe, for my sake. ~ ARSONIST But it was too late, while he was reading the letter, a man had snuck in with intent to kill, he had a smile across his face. Before Toraum could say anything, the man dropped a candle onto Toraum's carpet, setting the house ablaze. Toraum managed to escape through the back, clutching onto his arm before being crushed by the rubble of his house. Toraum recieved a scar on his left him, lost his right, and lost his eyesight as a result. Toraum was later diagnosed with Post Traumatic Stress Disorder, upon the sight of fire, he goes into a state of shock and could possibly pass out. Robotopia Edit After his session, Toraum stumbled into the world of Robotopia. There he helped locals by offering the residents services that the government couldn't give. He built people houses, helped the local government with its budget and made sure the city was happy. He worked as a Piano Player for a Restaurant. One of Two Endings Edit There are two ways that Toraum's future ends, both of them do have quite a story to tell. Toraum ended up having an Anxiety attack and broke down into tears on stage after failing to play \"Plucky Daisy\" and was fired. After that, things just seemed to take a turn for the worse. Constant Death Edit Khimio Vuqtoz, Toraum's Moirail, was found dead in a street alley after a little fight with robbers. Toraum broke down and cried during the funeral. Jay, Toraum's Closest friend, was brought into emergency care after the food he had eaten at a restaurant was found to have contained very lethal amounts of Potassium Cyanide. They died a few days later. With nobody to turn to, Toraum felt that everything in life had lost meaning. His closest friends were dead, and he had nobody else to turn to. Getting Help Edit Eventually, Emergency Care was called and Toraum was taken to the hospital. There he was nursed back to health and given lots of love and care. Toraum asked for his friend Khimio's house to be searched in an effort to recover anything that could be used as a memoir for his deceased friend, they found a blue rose and plans for a robot design. Toraum cried when he saw the rose, and asked if they could try and follow the blueprints to see just what his friend wanted to build before he was murdered. Robot Edit The blueprint was for a \"Battery-Powered Orb Head\" Robot. Khimio's body was exhumed and the contents of his brain were put into a hard drive and placed inside the robot. Khimio was reborn, but suffered from massive amnesia. Toraum helped him regain his memories and then asked if he could try and help scientists build a robot for Jay. Khimio, with tears in his eyes, agreed to help them build the robot and bring them back to life. Jay was brought back as a robot 5 days later. With his friends by his side and a newfound sense of happiness, Toraum finally felt that things were going to be alright after all. Research Edit Toraum ended up getting a degree in Psychology and studied Mental Disorders, such as Autism. His in-depth research in the field of Psychology ended up him being recognised as a role-model for Psychologists everywhere. (wip ajklsdgjas) Toraum met his future wife, Lodove Planci, while working his day job as a piano player for a restaurant. He was taking song requests and he invited her up to play a piece with him. The Piece they played together was called \"Plucky Daisy\". It can be found here. https: //www.youtube.com/watch? v=9Stb6HIBw8M After the show, Toraum asked Lodove if they wanted to hang out sometime, and they did. A few months later, Toraum confessed his love and the two got married within the next month. They had two beautiful children, Mirari and Dergan Zwilig. The Zwilig Family. Betrayal Edit A local Mafia, whom Toraum had been helping pay off debts, had turned on him. Due to members of that mafia being affiliated with government officials, Toraum was convicted of 1st Degree Murder, Arson, and Child Abduction after a house in the area burned down and one of the sons of the victim of the fire had been found in Toraum's custody. Toraum pleaded not guilty due to a lack of evidence and false testimony being given, alas that was not enough to save him. He was sentenced to Death by Lethal Injection. Toraum took the time in his cell to write his wife his final letter. Dear Lodove, I just went to court for another hearing today, I was given the death penalty. I don't have much time left...But before I go, tell the kids that daddy will always love them and that he will always be thinking about them. I didn't do the crime, but they found me guilty because the witnesses had a solid alibi and they all linked me to the crime. The execution date is tommorow, but I'm not ready to go. Not like this. . I don't want to go. . I love you so much. Thank you for everything, and goodbye. ~ Toraum Death Edit Toraum was executed by lethal injection, as the court had ordered. Toraum requested Khimio be by his side to comfort him as he died, and this request was granted. Upon his death, Khimio visited Toraum's grave, placed a blue rose onto it, and swore to find the true circumstances about Toraum's death. Rebirth Edit Extensive research done on Khimio's part had shown that Toraum was not only innocent, but the prosecution had been blackmailed into getting a guilty verdict. Khimio had used his skills in robotics to attempt to revive Toraum. It took a few weeks, but he had succeeded. Toraum was officially brought back. He suffered from massive amnesia, appearing to not even know who he was or have any recollection of any of his past life memories. With the help of Khimio, he discovered the truth behind who he was and what happened. Toraum requested that he just be referred to as \"Doc\" as he didn't want to arouse any suspicions. Doc inside his charging pod. Sacrifice Edit Toraum came home to Mirari and Dergan crying. When Toraum asked what was wrong, they both replied, \"Dad, Mom isn't waking up!\" Toraum then followed them to find Lodove on the floor, dead. Toraum looked at them with tears in his eyes and said, \"Mom's gone. . and she's never going to come back .\" Toraum comforted his children reassuring them that Lodove loved them until the very end, as he did. Toraum begged and pleaded with Khimio to help him bring back his deceased wife. He reluctantly agreed to do so due to stress related reasons. Regardless, Khimio managed to finish working on Lodove's robot body and was brought back to the world of the living 2 weeks later. Upon Khimio being recognized for his actions, Khimio died of a heart attack during the knighting ceremony. Move Edit Upon Lodove being brought back to the world of the living, Toraum and his family moved to England after Toraum had been offered a position at the University of Cambridge as a Psychology Professor. Toraum was brought to Buckingham Palace a few weeks later, and was knighted for his service to the field of Psychology, Toraum had done research to help get a better understanding on Mental Disorders. Ancestor Edit The Arsonist Edit The Arsonist is the ancestor of Toraum Zwilig and the post-scratch incarnation of Krakau Zwilig. The Arsonist wielded a firekind specibus, much like Toraum. Although it's worth mentioning he has a knifekind specibus, filled with various kinds of knives. The Arsonist was originally a well known Novelist who published many fantasies that would spark controversy with the other highbloods, referring to the fact that most purple bloods in his books were considered heartess, cruel psychopaths. The Arsonist (called the Novelist at the time) often wrote stories about mythical creatures, murder mysteries and revolutions that he would hear about from Jay (Pre-Regeneration), his stories were often over-exaggerated and quite appealing to the Lowblooded castes. He was known to have caused outrage with highbloods and eventually befriended The Picaroon. Upon hearing of The Picaroon's Death, The Novelist went beserk. The Novelist went completely insane. He started by setting hives on fire, starting with a lot of purplebloods and seadwellers then resorting to raiding hives, killing the residents inside, looting them and then setting their hive on fire to dispose of the body. The Arsonist managed to narrowly managed to escape death by setting the entire courthouse ablaze, killing everyone inside except him. He was finally caught when Jay, one of his closest affiliates, confronted him about his crimes and murdered him. Toraum studied his Ancestor's novels, even the ones he wrote as he descended into madness. Toraum is often frightened whenever he thinks of his ancestor, saying \"He wa2 a danger0u2 tr0ll, but he d1d 1t f0r a ju2t1f1ed rea2on, 1 gue22 .\" The Novelist was a troubled man who spent most of his time with his closest friends, and he ended up getting murdered by someone he trusted completely. Dancestor Edit Krakau Zwilig Edit Krakau's normal appearance Krakau's god tier Krakau Zwilig is the Mage of Space, the pre-scratch incarnation of The Novelist, and is Toraum Zwilig's dancestor. He is the moirail to Retinz Vuqtoz, the dancestor to Khimio Vuqtoz. Krakau is 12 sweeps old, or 26 human years old. Like Toraum, Krakau has problems with his eyesight. Krakau and Retinz are close moirails and stick with eachother until the very end. Unlike Toraum, Krakau is only Monochromatic, he only sees the world in black and white. Krakau is known to dress in a very sophisticated style, finding pleasure in cravats and frilly coats. He sports a \"Flint Michigan,\" by human terms, but he has a soft and comforting voice. He always put his friends first and calmed those in distress. Krakau was known to be a skilled Tactician and Field Expert. Unlike Toraum, Krakau would actually go outside and explore, not being afraid to get his hands dirty if it came to it. Krakau has Bipolar Disorder though, which results in random mood swings at certain times. Toraum and Krakau started off awkward, but eventually became close friends. Even though sometimes Toraum is a bit scared of his dancestor, as he finds Krakau to be \"the k1nd 0f per20n wh0 ha2 tw0 21des t0 them, they can e1ther be y0ur be2t fr1end 0r y0ur w0r2t enemy .\" Relationships Edit Lodove Planci/Zwilig Edit Lodove Zwilig (née Lodove Planci) is Toraum's wife. Toraum doesn't know what he'd be doing if he didn't have his wife. She means the world to him. True love sometimes means being able to deal with pain for your lover. Khimio Vuqtoz Edit Khimio is Toraum's best friend. Toraum is always there for Khimio, even in the darkest of times. They are pretty much like brothers. Trivia Edit Toraum is Jay's Trollsona. Toraum's Doc outfits are based on Peter Capaldi and <mark>Peter Davison</mark>'s doctors from Doctor Who. Toraum's full title is Professor Sir Toraum Zwilig, CH, KBE, CB, FRS, MD.. Jay doesn't believe in blood colour being related to Zodiac, so they just decided \"Teal-Blooded Gemini, why not?\" Anyone who criticises Toraum for his sign in front of Jay will have their kneecaps broken. Retrieved from \"http: //trollslum.wikia.com/wiki/SuicidalArsonist? oldid=42667\" Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected. Categories: Teal/Blue Blood Male Troll SuicidalArsonist", "articleID": "2017120703_00182143_W", "names": {"Peter Davison": ["Q16090277", "Q19876980", "Q21932415", "Q358427", "Q7173573"]}}, {"date": "2017-12-08", "url": "http://www.krmg.com/news/national/foo-fighters-fans-were-treated-impromptu-nirvana-reunion/qtPkynL69lAbrEeuTdIZaP/", "content": "Foo Fighters fans were treated to an impromptu Nirvana reunion Photo Credit: Ian Gavan/Getty Images Dave Grohl of Foo Fighters (Photo by Ian Gavan/Getty Images) Foo Fighters fans were treated to an impromptu Nirvana reunion By: Rare. us December 07 2017 10:00 PM EUGENE, Ore. - Nirvana fans can rejoice! The surviving members of the band Dave Grohl, Krist Novoselic and touring member Pat Smear briefly reunited for a rendition of the Foo Fighters song \"Big Me\" at a concert in Eugene, Ore.>> Read more trending news \"I love you Krist,\" Grohl says as Novoselic leaves the stage. \"No! That's a new one,\" he yells as the bass player pretends to smash his instrument to smithereens, just like the old days. \"You just got it!\" Don McClean would have you believe that Feb. 3, 1959, was \"the day the music died\" but for gen-Xers, that day is April 5, 1994 the day Kurt Cobain took his own life and left legions of adoring fans in tears or worse. In the wake of Cobain's suicide, Dave Grohl, the drummer who played with Cobain in Nirvana, went on to have a long and successful career after he formed your dad's favorite band, Foo Fighters, with guitarist Pat Smear who was never a full-fledged member of Nirvana, but he played rhythm guitar at a lot of their live shows. But what happened to the other guy? Nirvana's bassist Krist Novoselic dabbled in a few post-Nirvana musical projects, but none of them really took off like Grohl's did. Grohl actually asked Novoselic to join Foo Fighters as a full time band member, but he declined. Believe it or not, this isn't the first time the three musicians have jammed together since Nirvana ceased to exist. During the filming of Grohl's 2013 documentary \"Sound City,\" the trio teamed up with rock god Paul McCartney and recorded a new track titled \"Cut Me Some Slack,\" which they played live a few times in 2013. they also reunited for Nirvana's induction into the Rock And Roll Hall Of Fame the following year, where they rocked out with Lorde, St. Vincent and Joan Jett because they love rock and roll! Recently, Grohl was the guest host for the Oct. 31 edition of \"<mark>Jimmy Kimmel</mark> Live .\" And he completely nailed the Halloween theme by showing up in a terrifyingly accurate David Letterman costume. \"I'm Dave Grohl dressed as Dave Letterman sitting in for <mark>Jimmy Kimmel</mark>. It's confusing, I get it, especially if you're home watching right now stoned to the bone,\" the guest host said. He went on to perform a rocking version of \"Do You Want To Build a Snowman\" from the movie \"Frozen\" with one of its stars, Kristen Bell who was dressed up as Tom Selleck's ’80s TV icon Magnum P.I. \"If I were to jam a song with you, I would become like the coolest dad,\" Grohl admitted, after informing Bell that his kids were huge \"Frozen\" fans. Read More VIEW COMMENTS Another date set for a special session Governor Mary Fallin called lawmakers to return to the State Capitol for a special session to address the shortfall in the current fiscal year budget. This will be the second special session this year. Gov. Fallin scheduled the next session on Monday, Dec. 18. \"I wanted to give legislators enough notice as possible about when they should return to the Capitol,\" said Fallin. Fallin didn't file an executive order, or an official call, for the special session. She says she'll do that at a later date. \"Before the session begins, I intend to make specific recommendations on how we can balance the budget and meet our immediate needs .\" The current 2018 fiscal year budget includes $509 million of one-time funds and future obligations of at least $180 million not included in the 2018 fiscal year budget. Sexual misconduct claims force two in Congress to resign, another into ethics probe In a head shaking series of events, a tide of sexual misconduct allegations continued to sweep across Capitol Hill on Thursday, as one Senate Democrat and one House Republican announced their resignations, while another House GOP lawmaker became the subject of an ethics review over a sexual harassment case that has already resulted in a taxpayer funded settlment. Sen. Al Franken (D-MN) began the highly unusual day on Capitol Hill, taking the Senate floor just before lunch to announce his resignation \"in coming weeks,' but denying any wrongdoing. Hours later, the House floor suddenly was in the spotlight, as Rep. Trent Franks (R-AZ) surprised colleagues by announcing he would resign effective at the end of January. A group of fellow Republicans just prayed on the House floor with Rep. Trent Franks (R-AZ), who @ PoliticsReid reports is resigning. Everyone stone-faced .--Cristina Marcos (@ cimarcos) December 7, 2017 About the same time, the House Ethics Committee announced it had formed an investigative panel to review allegations of sexual harassment against Rep. Blake Farenthold (R-TX), who has already acknowledged having the taxpayers pay $84,000 to a former employee to settle a sexual harassment case. All those developments came amid talk in the halls of the Capitol of possibly more stories emerging about lawmakers, mirroring the public rush of sexual misconduct allegations nationally .\" Every one of these claims, whether it's in business, industry, or in Congress, has to be taken very seriously, \"said House Speaker <mark>Paul Ryan</mark>, hours before <mark>Ryan</mark> said he had asked Rep. Franks to resign. The Speaker's office put out this background on the Franks case:\" Last Wednesday, the speaker was briefed on credible claims of misconduct by Rep. Trent Franks. He found the allegations to be serious and requiring action, \"read a statement put out by the Speaker's office. The Speaker's statement was much different than the explanation put out by Franks, who said he had discussed the issue of having a child by a surrogate with two former female staffers .\" Rather than allow a sensationalized trial by media damage those things I love most, this morning I notified House leadership that I will be leaving Congress as of January 31st, 2018, \"Franks said in a statement. Meanwhile, pressure increased on Rep. Blake Farenthold (R-TX), who admitted this week that he had used taxpayer dollars to pay an $84,000 sexual harassment settlement with a former employee on Capitol Hill. On CNN Thursday evening, Rep. Mia Love (R-UT) said she thought Farenthold needed to move on .\" I think that he should voluntarily resign, \"Love said, becoming the second GOP lawmaker to call for Farenthold to quit, along with Rep. Barbara Comstock (R-VA). Farenthold is now facing a full investigation by the House Ethics Committee, which was announced at about the time that Rep. Franks announced his resignation. Meanwhile, Rep. Ruben Kihuen (D-NV), was resisting calls for his resignation, over claims of sexual misconduct during his 2016 run for Congress .\" We have a responsibility to uphold the dignity of the House of Representatives, \"said House Democratic Leader Nancy Pelosi, who has publicly urged Kihuen to leave the Congress. State revenue collections rise in November State Treasurer Ken Miller announced that the November Gross Receipts to the Treasury are more than 12 percent higher than the same month of last year. Oklahoma has had eight consecutive months with year-over-year growth. The last time monthly gross receipts grew by more than 12 percent was in February 2012 .\" Gross Receipts to the Treasury, insomuch as they indicate general economic activity, paint an encouraging picture as we enter the holiday period, \"Miller said .\" Sales tax collections, a measure of consumer confidence, are up by double-digits and the bulk of holiday shopping including Black Friday is not yet measured with this report. \"The three other major revenue streams--gross income, gross production, and motor vehicle taxes--also increased during the month compared to November of last year. Sen. Al Franken D-MN says he will resign over sexual misconduct allegations Accused by multiple women of unwanted sexual advances, Sen. Al Franken (D-MN) announced on the floor of the U.S. Senate Thursday that he would resign his seat\" in the coming weeks,' even as he denied the veracity of the charges leveled against him in the last three weeks. \"Some of the allegations against me are simply not true,\" Franken said. \"Others I remember very differently .\" Even as he announced he would leave the Senate, Franken took a shot at both President Donald Trump, and Alabama GOP Senate candidate <mark>Roy Moore</mark>, as Franken said it is ironic that he is leaving, while the other two men are dealing with accusations of sexual misconduct. Sen. Al Franken: \"There is some irony in the fact that I am leaving while a man who has bragged on tape about his history of sexual assault sits in the Oval Office .' https: //t.co/Dg1QIytmqP pic.twitter.com/ZlT2Fs50Fw--ABC News Politics (@ ABCPolitics) December 7, 2017 BREAKING: Minnesota Sen. Al Franken, once a rising star in Democratic Party, is resigning amid sexual misconduct allegations .--AP Politics (@ AP_Politics) December 7, 2017 Franken's decision came after a wave of calls on Wednesday from fellow Democratic Senators for his resignation, as the number of women accusing the Minnesota Democrat of unwanted sexual advances continued to rise this week. I expect that Senator Franken will announce his resignation tomorrow. It is the right thing to do given this series of serious allegations .--Ron Wyden (@ RonWyden) December 6, 2017\" I agree the time has come for Senator Franken to step aside, \"said Sen. Sherrod Brown (D-OH). The resignation of Franken will now allow the Governor of Minnesota--former U.S. Senator, and Democrat, Mark Dayton--to fill the vacancy. Franken's term runs out after the 2020 election, so there would be a short-term appointment made by the Governor, and then an election to fill the rest of his term. FRANKEN--WHAT HAPPENS NOW:--MN's Gov. appoints a temp senator. (Gov. Dayton = Dem .)--The state holds a special election Nov. 2018 .--That means both MN Senate spots will be on the ballot next year. (Klobuchar up for reelex .)--Lisa Desjardins (@ LisaDNews) December 7, 2017", "articleID": "2017120804_00072196_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Roy Moore": ["Q17466511", "Q27924997", "Q5302905"]}}, {"date": "2017-12-08", "url": "https://uk.sports.yahoo.com/news/bjorn-leads-tributes-tommy-horton-180611163.html", "content": "Tommy Horton, an eight-time winner on the European Tour, has passed away at the age of 76. More European Ryder Cup captain Thomas Bjorn led the tributes after it was announced Tommy Horton had died at the age of 76. Horton turned professional in 1957 and enjoyed a lengthy career, which encompassed eight victories on the European Tour and a further 23 on the Senior Tour. The Englishman, who twice featured at the Ryder Cup, won the <mark>John Jacobs</mark> Trophy--for the Senior Tour's number one player--a record five times and was awarded honorary life membership of the European Tour in 2012. \"Tommy Horton was one of finest gentlemen I ever met in the game of golf,\" said Bjorn on Twitter. \"His contributions as a player and a coach has formed many young men into great players. Thanks for everything you gave! RIP .\" \"Tommy Horton was an incredibly influential and respected figure in the world of golf, as a wonderful player and coach and as someone who was central to the development of the European Tour and the European Senior Tour,\" added European Tour chief executive Keith Pelley. \"After the passing of <mark>John Jacobs</mark> in January, we have lost two of the true gentlemen of the game in 2017. The thoughts of everybody at the European Tour are with Tommy's family .\" ", "articleID": "2017120818_00309150_W", "names": {"John Jacobs": ["Q22278334", "Q2245422", "Q58150314", "Q6241430", "Q6241433"]}}, {"date": "2017-12-09", "url": "https://www.timesofisrael.com/angry-worshipers-lash-out-against-trump-across-muslim-world/", "content": "home page Muslim men burn portraits of US President <mark>Donald Trump</mark> and rally against his decision to recognize Jerusalem as Israel's capital in Banda Aceh, Indonesia, Friday, Dec. 8, 2017. (AP Photo/Heri Juanda) Large crowds of worshipers across the Muslim world staged anti-US marches Friday, some stomping on posters of <mark>Donald Trump</mark> or burning American flags in the largest outpouring of anger yet at the US president's recognition of bitterly contested Jerusalem as Israel's capital. In the holy city itself, prayers at the Temple Mount site dispersed largely without incident, but Palestinians clashed with Israeli troops in several dozen West Bank hotspots and on the border with the Gaza Strip. Get The Times of Israel's Daily Edition by email and never miss our top stories Free Sign Up <mark>Trump</mark>'s pivot on Jerusalem triggered warnings from America's friends and foes alike that he is needlessly stirring more conflict in an already volatile region. The religious and political dispute over Jerusalem forms the emotional core of the Israeli-Arab conflict. The ancient city is home to major Jewish, Muslim and Christian shrines and looms large in the competing national narratives of Israelis and Palestinians. In a Wednesday address from the White House, <mark>Trump</mark> defied worldwide warnings and insisted that after repeated failures to achieve peace a new approach was long overdue, describing his decision to recognize Jerusalem as the seat of Israel's government as merely based on reality. The move was hailed by Israel's Prime Minister Benjamin Netanyahu and by leaders across much of the Israeli political spectrum. <mark>Trump</mark> stressed that he was not specifying the boundaries of Israeli sovereignty in the city, and called for no change in the status quo at the city's holy sites. <mark>Trump</mark>'s decision on Jerusalem is widely seen in the region as a blatant expression of pro-Israel bias, but it was unclear if protests and confrontations would maintain momentum after Friday. The Saint Georges Cathedral, illuminated by a giant projection of the Church of Holy Sepulchre, in down town Beirut, Lebanon, Thursday, Dec. 7, 2017. A number of US allies in the Middle East are condemning the <mark>Trump</mark> administration's decision to recognize Jerusalem as the capital of Israel, with the United Arab Emirates, Kuwait, Qatar and Saudi Arabia urging Washington to reconsider and reverse the announcement. (AP Photo/Bilal Hussein) Across the region--from Asia's Indonesia, Malaysia and Pakistan to North Africa's Algeria and Lebanon in the Levant--thousands of worshipers poured into the streets after midday prayers to voice their anger. Some protesters burned US and Israeli flags or stomped <mark>Trump</mark> posters that showed the president alongside a Nazi swastika. In Jordan's capital of Amman, thousands marched through the center of town, chanting \"America is the head of the snake .\" Pro-Western Jordan is a crucial US. ally in the fight against Islamic extremists, but King Abdullah II cannot afford to be seen as soft on Jerusalem. His Hashemite dynasty derives its legitimacy from its role as guardian of the Al Aqsa Mosque in Jerusalem, Islam's third-holiest site, that sits on the Temple Mount. <mark>Trump</mark>'s decision has also strained US foreign relations UN Mideast envoy Nickolay Mladenov told an emergency session of the UN Security Council on Friday that <mark>Trump</mark>'s announcement created a \"serious risk\" of a chain of unilateral actions that would push the goal of peace further away. Palestinian UN Ambassador Riyad Mansour warned of the danger of \"a never-ending religious war that will only be exploited by extremists, fueling more radicalism, violence and strife in the region and elsewhere .\" Even traditional US allies sharply criticized <mark>Trump</mark>'s decision. Sweden's UN Ambassador Olof Skoog said the US action \"contradicts international law and Security Council resolutions .\" Britain's Ambassador Matthew Rycroft called the US decision \"unhelpful to peace,\" the French envoy expressed regret and Italy's Sebastiano Cardi warned of \"the risk of unrest and tensions in the region .\" The US ambassador, Nikki Haley, told the council that the <mark>Trump</mark> administration is more committed to peace \"than we've ever been before--and we believe we might be closer to that goal than ever before .\" Haley did not explain. Palestinians hold a placard with the picture of US President <mark>Donald Trump</mark> during a protest in Athens, on Friday, Dec 8, 2017. Several hundred Palestinians living in Greece, backed by Greek leftist demonstrators, protested the US decision to recognize Jerusalem as the capital of Israel (AP Photo/Petros Giannakouris) In Europe, US Secretary of State Rex Tillerson on Friday played down the impact of <mark>Trump</mark>'s policy shift, which also included a pledge to move the US Embassy in Israel from Tel Aviv to Jerusalem. Tillerson said it will likely take years for the US to open an embassy in Jerusalem. In a news conference with the French foreign minister, Tillerson said <mark>Trump</mark>'s recognition of the city as Israel's capital \"did not indicate any final status for Jerusalem .\" The United States is making clear that Jerusalem's borders will be left to Israelis and Palestinians to \"negotiate and decide,\" he said. Most countries around the world have not recognized Israel's 1967 annexation of East Jerusalem and maintain their embassies in Tel Aviv. Under a longstanding international consensus, the fate of the city is to be determined in negotiations. <mark>Trump</mark>'s announcement delivered a blow to <mark>Abbas</mark>, a supporter of the idea of reaching Palestinian statehood through US-led negotiations with Israel. In siding with Israel on Jerusalem, he has said, the <mark>Trump</mark> administration effectively disqualified itself as a mediator. However, Palestinian Authority President <mark>Mahmoud Abbas</mark> has not decided how to move forward, including whether he will rule out future US-brokered negotiations. <mark>Trump</mark> has said he still intends to propose a Mideast peace deal. More than two decades of intermittent Israeli-Palestinian negotiations have failed to bring the Palestinians closer to statehood. Some in <mark>Abbas</mark>' inner circle say the old paradigm, with the US serving as mediator, is no longer relevant. On Thursday, a senior Fatah official said the Palestinians would not receive Vice President Mike Pence when he visits the West Bank later this month, but it was not immediately clear if the official spoke for <mark>Abbas</mark>. The Arab League, an umbrella group of close to two dozen states, is to meet Saturday to try to forge a joint position, followed next week by a gathering in Turkey of the 57-state Organization of Islamic Cooperation. Turkish officials said Russian President Vladimir Putin will travel to Turkey next week for talks with President Recep Tayyip Erdogan on Jerusalem's status and other issues. read more: Israel & the Region <mark>Trump</mark> recognizes Jerusalem anti-Israel protests Muslim world Jerusalem <mark>Mahmoud Abbas</mark> Nikki Haley Facebook Twitter email Print shares comments", "articleID": "2017120906_00047358_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}}, {"date": "2017-12-13", "url": "http://www.brisbanetimes.com.au/world/on-the-banks-of-the-tumen-china-prepares-for-north-korean-refugee-tide-20171213-h03rvn.html", "content": "Beijing: A Chinese county along the border with North Korea is constructing refugee camps intended to house thousands of migrants fleeing a possible crisis on the Korean Peninsula, according to an internal document that appears to have been leaked from China's main state-owned telecommunications company. Three villages in Changbai county and two cities in the north-eastern border province of Jilin have been designated for the camps, according to the document from China Mobile. The document appeared last week on Weibo, China's answer to Twitter site. China's national flag flutters on the Chinese side of the banks of the Tumen river, as a North Korean village is seen behind. Photo: <mark>KIM</mark> KYUNG HOON The telco was tasked with providing internet services to the camps, Newsweek reported. The camps are an unusual, albeit tacit, admission by China that instability in North Korea is increasingly likely, and that refugees could swarm across the Tumen River, a narrow ribbon of water that divides the two countries. A bridge over the Tumen River linking Dandong, China, and Sinuiju, North Korea, has never been used since it was built in 2015. Photo: Sanghee Liu/Fairfax Media For decades, Chinese policy on North Korea has centred on maintaining stability in a neighbouring country known for its repression and volatility. Despite international sanctions and condemnation, the North in recent months has intensified a program to test nuclear weapons and missiles, increasing the potential for internal instability or the chance of an attack by the United States. <mark>Lu Kang</mark>, a China's Foreign Ministry spokesman, told reporters this week that he was unaware of the plan for the refugee camps, but he did not deny their existence. \"I haven't seen such reports,\" <mark>Lu</mark> said. North Korean leader <mark>Kim Jong-un</mark> waves during a military parade in Pyongyang, North Korea earlier this year. China fears his antics may drive a rise in desertions. Photo: Wong Maye-E Changbai county officials did not answer telephone calls, and an executive at China Mobile in Changbai declined to discuss the matter. Newsweek however quoted a China Mobile spokesperson as saying: \"The government has ordered these settlement points .\" But don't worry, no one is panicking here. It is not a big deal. \"With a gun on his shoulder, a young North Korean man on a bicycle watches a Chinese tourist boat passing by in Sinuiju on the North Korean side of the Chinese border. Photo: Sanghee Liu The China Mobile document said that a manager of the company inspected five sites December 2 at the request of the Changbai county government. The company was asked to ensure there was viable internet service in the areas that would be used for the camps .\" Because the situation on the China-North Korea border has intensified lately, Changbai county government plans to set up five refugee sites in Changbai, \"China Mobile said in the document. A North Korean man fishes off a ferry in Sinuiju near the Chinese border. Photo: Sanghee Liu/Fairfax Media The areas designated for the refugee camps were on state-owned land, and temporary housing had already been constructed at several sites, according to a local businessman who requested anonymity for fear of angering the local government. Three county villages were named in the document as locations for the camps. The cities of Tumen and Hunchun would also house refugees, according to the businessman. Tumen and Hunchun have for 20 years received defectors, who have managed to escape from North Korea into China. Many of those defectors travel on to South-east Asia and eventually to South Korea. Jilin province is about 90 kilometres from Punggye-ri, the main North Korean nuclear test site. Fears of a nuclear war, or disaster, just kilometres away have set residents of the province on edge. Last week, the Jilin Daily, a provincial newspaper, advised residents on how to react in case of a nuclear explosion or radioactive fallout. The advice included washing off radioactive dust from exposed body parts and shoes, and taking iodine tablets. The article noted that when the United States dropped an atomic bomb on Hiroshima, Japan, in 1945, more than 70,000 people were killed. Modern weapons are many times more powerful. China has refrained from imposing overly punitive sanctions on North Korea for fear of causing a collapse that would result in refugees flooding the economically vulnerable northeast. So far, China has resisted calls to cut off oil to North Korea, a move that would result in severe deprivation resulting in many people crossing the border. Although China does not appear to have changed its basic position on maintaining stability, the increasingly hostile talk in Washington appears to be spurring contingency preparations. Zheng Zeguang, vice minister of foreign affairs, rushed to Washington last week to discuss what Chinese officials call the\" black hole of confrontation \"between the US and North Korea. As a result of the rising tensions, one of China's most prominent experts on North Korea, called building the camps\" absolutely reasonable. \"\"It is highly possible that there is a conflict between North Korea and the United States now,\" said <mark>Zhang Liangui</mark>, a professor of international strategic research at the Communist Party's Central Party School. \"What China does here is to be prepared for any kind of situation happening on the Korean Peninsula .\" In another sign of increased tensions, South Korea is joining the United States and Japan for a drill to practice tracking missiles launched from North Korean submarines. Loading Last month, North Korea tested an intercontinental ballistic missile that flew higher and longer than its previous tests. The North said that the missile could deliver nuclear warheads anywhere in the continental United States. New York Times", "articleID": "2017121305_00210510_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"], "Lu Kang": ["Q19825841", "Q45425431", "Q45438483", "Q45443872", "Q45505537"]}}]