[{"date": "2017-12-13", "url": "http://www.brisbanetimes.com.au/world/on-the-banks-of-the-tumen-china-prepares-for-north-korean-refugee-tide-20171213-h03rvn.html", "content": "Beijing: A Chinese county along the border with North Korea is constructing refugee camps intended to house thousands of migrants fleeing a possible crisis on the Korean Peninsula, according to an internal document that appears to have been leaked from China's main state-owned telecommunications company. Three villages in Changbai county and two cities in the north-eastern border province of Jilin have been designated for the camps, according to the document from China Mobile. The document appeared last week on Weibo, China's answer to Twitter site. China's national flag flutters on the Chinese side of the banks of the Tumen river, as a North Korean village is seen behind. Photo: <mark>KIM</mark> KYUNG HOON The telco was tasked with providing internet services to the camps, Newsweek reported. The camps are an unusual, albeit tacit, admission by China that instability in North Korea is increasingly likely, and that refugees could swarm across the Tumen River, a narrow ribbon of water that divides the two countries. A bridge over the Tumen River linking Dandong, China, and Sinuiju, North Korea, has never been used since it was built in 2015. Photo: Sanghee Liu/Fairfax Media For decades, Chinese policy on North Korea has centred on maintaining stability in a neighbouring country known for its repression and volatility. Despite international sanctions and condemnation, the North in recent months has intensified a program to test nuclear weapons and missiles, increasing the potential for internal instability or the chance of an attack by the United States. <mark>Lu Kang</mark>, a China's Foreign Ministry spokesman, told reporters this week that he was unaware of the plan for the refugee camps, but he did not deny their existence. \"I haven't seen such reports,\" <mark>Lu</mark> said. North Korean leader <mark>Kim Jong-un</mark> waves during a military parade in Pyongyang, North Korea earlier this year. China fears his antics may drive a rise in desertions. Photo: Wong Maye-E Changbai county officials did not answer telephone calls, and an executive at China Mobile in Changbai declined to discuss the matter. Newsweek however quoted a China Mobile spokesperson as saying: \"The government has ordered these settlement points .\" But don't worry, no one is panicking here. It is not a big deal. \"With a gun on his shoulder, a young North Korean man on a bicycle watches a Chinese tourist boat passing by in Sinuiju on the North Korean side of the Chinese border. Photo: Sanghee Liu The China Mobile document said that a manager of the company inspected five sites December 2 at the request of the Changbai county government. The company was asked to ensure there was viable internet service in the areas that would be used for the camps .\" Because the situation on the China-North Korea border has intensified lately, Changbai county government plans to set up five refugee sites in Changbai, \"China Mobile said in the document. A North Korean man fishes off a ferry in Sinuiju near the Chinese border. Photo: Sanghee Liu/Fairfax Media The areas designated for the refugee camps were on state-owned land, and temporary housing had already been constructed at several sites, according to a local businessman who requested anonymity for fear of angering the local government. Three county villages were named in the document as locations for the camps. The cities of Tumen and Hunchun would also house refugees, according to the businessman. Tumen and Hunchun have for 20 years received defectors, who have managed to escape from North Korea into China. Many of those defectors travel on to South-east Asia and eventually to South Korea. Jilin province is about 90 kilometres from Punggye-ri, the main North Korean nuclear test site. Fears of a nuclear war, or disaster, just kilometres away have set residents of the province on edge. Last week, the Jilin Daily, a provincial newspaper, advised residents on how to react in case of a nuclear explosion or radioactive fallout. The advice included washing off radioactive dust from exposed body parts and shoes, and taking iodine tablets. The article noted that when the United States dropped an atomic bomb on Hiroshima, Japan, in 1945, more than 70,000 people were killed. Modern weapons are many times more powerful. China has refrained from imposing overly punitive sanctions on North Korea for fear of causing a collapse that would result in refugees flooding the economically vulnerable northeast. So far, China has resisted calls to cut off oil to North Korea, a move that would result in severe deprivation resulting in many people crossing the border. Although China does not appear to have changed its basic position on maintaining stability, the increasingly hostile talk in Washington appears to be spurring contingency preparations. Zheng Zeguang, vice minister of foreign affairs, rushed to Washington last week to discuss what Chinese officials call the\" black hole of confrontation \"between the US and North Korea. As a result of the rising tensions, one of China's most prominent experts on North Korea, called building the camps\" absolutely reasonable. \"\"It is highly possible that there is a conflict between North Korea and the United States now,\" said <mark>Zhang Liangui</mark>, a professor of international strategic research at the Communist Party's Central Party School. \"What China does here is to be prepared for any kind of situation happening on the Korean Peninsula .\" In another sign of increased tensions, South Korea is joining the United States and Japan for a drill to practice tracking missiles launched from North Korean submarines. Loading Last month, North Korea tested an intercontinental ballistic missile that flew higher and longer than its previous tests. The North said that the missile could deliver nuclear warheads anywhere in the continental United States. New York Times", "articleID": "2017121305_00210510_W", "names": {"Zhang Liangui": ["Q45492171", "Q45703917"]}}, {"date": "2017-12-13", "url": "http://www.mystatesman.com/news/local/community-news-central-health-urges-residents-enroll-for-coverage/J6rn45tCKdf3X6zL8Y4H0K/", "content": "metro-state By Staff - American-Statesman staff...Posted: 11:40 a.m. Wednesday, December 13, 2017 Highlights Operation Blue Santa is seeking volunteers Saturday morning to be delivery drivers. Georgetown firefighters will serve breakfast Saturday morning as part of fundraiser. TRAVIS COUNTY TRAVIS COUNTY Insurance deadline Friday Central Health and its partners are accelerating efforts to enroll Travis County residents in health coverage, as open enrollment for the Health Insurance Marketplace ends Friday. Residents can call into the United Way 211 call center by dialing 211 to schedule an appointment at an enrollment facility in Central Texas. While local efforts have resulted in a 100 percent increase in enrollment to date, Central Health and its partners want to ensure everyone who needs health coverage gets it. Consumers are being reminded to not delay, as time is limited; enroll this week or risk not having health coverage in 2018 .--American-Statesman staff AUSTIN Help deliver Blue Santa gifts Operation Blue Santa is seeking volunteers, starting at 8 a.m. Saturday, to be delivery drivers who bring toys and goods to qualifying Blue Santa recipients. Volunteers may visit wrapping stations at the Operation Blue Santa Warehouse, 4101 S. Industrial Drive; the Austin Police Department North Substation, 12425 Lamplight Village Ave.; the East Substation, 812 Springdale Road; or the South Substation, 404 Ralph Ablanedo Drive. For more information: 512-974-2583 .--American-Statesman staff SOUTHEAST AUSTIN TreeFolks to give away trees TreeFolks, in partnership with H-E-B, will give away 200 trees as part of the organization's NeighborWoods program from 9 a.m. to noon Saturday, at H-E-B Plus, 2508 E. Riverside Drive. The trees that will be distributed are native to Central Texas and include evergreen sumac, burr oak, Texas mountain laurel, mulberry and persimmon. The NeighborWoods program helps to shade city streets and neighborhood by distributing 4,200 trees annually to Austin Energy customers. The trees will help lower summer temperatures and energy bills, as well as increase the tree canopy cover in Austin-area neighborhoods. The program is a partnership between TreeFolks and the city of Austin. Another distribution event will be Feb. 24 .--American-Statesman staff AUSTIN New traffic signals coming The city of Austin will build pedestrian hybrid beacons and traffic signals next year to improve safety across the city as the City Council approved a $2.85 million contract to build 10 signals in locations with identified safety needs. Pedestrian hybrid beacons are pedestrian-activated traffic control devices that help pedestrians safely cross major roads where traffic signals are not present and/or warranted. Using the new contract, these will be built near 12th and Luna streets; First Street and King Edward Place; First Street and Desert Primrose Drive; First and Monroe streets; the 515 block of South Congress Avenue, south of Riverside Drive; and Burnet Road and 47th Street. New signals will be built near First Street and Great Britain Boulevard, Davis Lane and West Gate Boulevard, Davis Lane and Copano Drive and Lamar Boulevard and Houston Street .--American-Statesman staff WILLIAMSON COUNTY GEORGETOWN Sheriff's office to present awards The Williamson County sheriff's office's Winter Awards Banquet will begin at 6 p.m. Thursday at the Sheraton Hotel & Conference Center, 1101 Woodlawn Ave. During the program, sheriff's office employees will be recognized for their achievements and service throughout the year .--American-Statesman staff GEORGETOWN Firefighters to serve breakfast Georgetown firefighters will serve breakfast from 7:30 to 11 a.m. Saturday at the Georgetown Community Center in San Gabriel Park, 445 E. Morrow St. Santa Claus will make an appearance for pictures, and children will be able to visit with the firefighters and climb on a fire truck. The breakfast will include pancakes and sausage with juice and coffee. Tickets are $6 per person and can be purchased at the door the day of the event or in advance at the Public Safety Operations and Training Center, 3500 D.B. Wood Road. Ages 12 and younger are free with a paid adult. Proceeds will help to provide clothing, food and gifts for children in the Georgetown area .--American-Statesman staff HAYS COUNTY DRIPPING SPRINGS Shooter response event set The Hays County sheriff's office will host the \"Civilian Response to Active Shooter Event\" presentation from 6:30 to 8:30 p.m. Thursday at Dripping Springs High School, 940 U.S. 290 West. The public presentation will be made by Hays County sheriff's Lt. <mark>David Burns</mark>, one of the founding members of Advanced Law Enforcement Rapid Response Training who has taught throughout the country on how to respond to an active shooter crisis. Additional presentations will be announced as they become available. Companies or organizations that want to schedule a specific presentation are encouraged .--American-Statesman staff Popular in News 1 2 3", "articleID": "2017121317_00733430_W", "names": {"David Burns": ["Q10426343", "Q20986553", "Q3558779", "Q4109533", "Q5231931", "Q5231932", "Q57395556"]}}, {"date": "2017-12-13", "url": "https://cyclingtips.com/news/tucker-analyses-froome-case/", "content": "Froome's salbutamol case, The Secret Pro's reaction: Daily News Digest by Shane Stokes December 14, 2017 Chris Froome urine test reveals twice the legal amount of Salbutamol; Nibali on Froome salbutamol case: No one can give me back the thrill of winning the Vuelta; Vuelta a España expresses \"extreme caution' about Froome situation; The Secret Pro: My thoughts on Froome's positive and the bikes we ride; <mark>Tucker</mark> analyses Froome case; INRNG on what comes next for Froome; Ewan confirmed for Tour de France debut in 2018; Stig Broeckx pushes through rehab; Aqua Blue reveals 2018 kit <mark>Tucker</mark> analyses Froome case by CyclingTips Link has been copied to your clipboard! <mark>Ross Tucker</mark> is the author of the Science of Sport website and also a sport scientist. He has been known for questioning Team Sky and Chris Froome, and wrote a long and interesting post after Wednesday's big news broke. Here's an excerpt:\" At the time, WADA's decision to classify salbutamol as a \"threshold drug\" (rather than being completely banned unless a TUE is obtained) was not entirely uncontroversial. Here's one quote, which I think you'll find is relevant as we explore the Froome situation further: \"Michel Rieu, scientist at the French Anti-Doping Agency, [said that] salbutamol should remain banned in any concentration. Rieu said to L’Equipe that in order to reach the 1000 ng/ml threshold,\" you really have to mess things up and not follow classic doping protocol. Those who cheat use salbutamol as a cure, out of competition, and are careful not to reach these kind of concentrations during competition. \"So, all of that history brings us to Chris Froome, whose urine contains levels that exceed the threshold by 100%. 2000 ng/ml vs 1000 ng/ml. Twice as high. That's a big miss. Like going out to buy a TV with a budget of $1000 and coming home with an 84 inch flat screen and surround sound speakers. It would take some pretty remarkable adjustments in dosage, or (possibly normal, mind) pharmacology, to clear the bar by that amount. The first thing I read in response to this story was the following quote by Froome:\" My asthma got worse at the Vuelta so I followed the team doctor's advice to increase my Salbutamol dosage. As always, I took the greatest care to ensure that I did not use more than the permissible dose. \"So with\" the greatest care \", Froome and a doctor, working together, with years of experience using this very same drug in stage races, managed to miss the mark by 100%? They missed the upper allowable limit by a factor of 2? See the full analysis here. The CyclingTips Daily News Digest features the most important and interesting news and content from around the cycling world, published every weekday morning at 9am AEST. Get it delivered straight to your inbox.", "articleID": "2017121320_00048820_W", "names": {"Ross Tucker": ["Q47127665", "Q7369680"]}}, {"date": "2017-12-15", "url": "http://www.eastbaytimes.com/2017/12/15/bay-area-weather-red-flag-fire-warning-issued-ahead-of-dry-windy-weekend/", "content": "(National Weather Service Bay Area) Bay Area weather: Red-flag fire warning issued ahead of dry windy weekend By Robert Salonga | rsalonga @ bayareanewsgroup.com | Bay Area News Group December 15, 2017 at 8:24 am The National Weather Service has issued a red-flag fire warning in the Bay Area for this weekend, the first such December warning in four years, amid dry, warm and windy conditions, officials said. The red-flag declaration came a day after the agency issued a fire weather watch alert for Friday through Sunday in the Bay Area and Monterey County. But the red flag was issued once it was within 24 hours of the anticipated weather event appeared to arriving as expected. There has not been a red-flag fire warning issued in the Bay Area in December in 2013, during the height of the years-long drought that finally ended earlier this year. \"It's not unprecedented, we can get fires anytime throughout the year,\" meteorologist Charles Bell said. \"What's made this year interesting is that we've had so little rain recently, and we just had all those days of warmer than normal temperatures and offshore winds. So any rain has been nullified .\" Wind gusts expected to reach up to 50 mph, warm temperatures and low humidity will increase fire risk, particularly in the Santa Cruz Mountains, Diablo Range, East Bay hills and Big Sur areas. \"Its dry enough, with wind, anything that starts will take off,\" Bell said. The only saving grace is that that the calendar is approaching what Bell called the \"solar minimum\" with the least daylight of the year, so warm temperatures will be capped. Since Oct. 1, Northern California has had a mediocre rain season. Some storms in November increased the moisture levels in plants and dampened the ground. But with nothing new for weeks, San Jose is now at 43 percent of its historic rainfall average for this date, with 1.58 inches, while San Francisco is at 52 percent with 3.16 inches and Oakland is at 63 percent with 3.15 inches. This time last year, every one of those cities had already had twice as much rain. After the worst drought since California became a state in 1850, Gov. <mark>Jerry Brown</mark> last April rescinded his emergency drought declaration. Huge storms brought flooding in downtown San Jose and other areas, buried Sierra ski resorts in snow and wrecked the spillway at Oroville Dam, the tallest dam in the United States. If Northern California remains dry through New Year's Day, as the forecast suggests, this December would be the third driest on record in San Francisco history with .02 of an inch of rain, dating back to 1849, according to the National Weather Service. San Francisco recorded no December rainfall in 1876 and 1989. San Jose, which has received just a trace amount (less than one-hundredth of an inch) this month, would eclipse the current low of .04 of an inch in 1989. And Oakland International Airport, currently at .02 of an inch, would break the mark of .11 of an inch set in 2011. Staff writers <mark>Paul Rogers</mark> and Mark Gomez contributed to this report. Tags:", "articleID": "2017121517_00062986_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Paul Rogers": ["Q16083970", "Q1626414", "Q166149", "Q2061983", "Q22107239", "Q3247749", "Q7153300", "Q7153302"]}}, {"date": "2017-12-15", "url": "http://www.detroitnews.com/story/sports/mlb/tigers/2017/12/15/tigers-frank-lary-yankee-killer-dies/108629296/?src=rss", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Twitter Google + LinkedIn Pinterest Tigers' Frank Lary, \"The Yankee Killer,' dies at 87 Lary won 128 games in his 12-year career, with 28 of those coming against the Yankees. Post to Facebook Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Long-time Tigers pitcher Frank Lary, with 28 of his 128 career wins coming against the New York Yankees to earn him the nickname\" The Yankee Killer, \"died Wednesday in his home state of Alabama. He was 87. Lary pitched 12 seasons in the major leagues, from 1954-65, and nearly 11 of them with the Tigers. For his career, the right-hander was 128-116 with a 3.49 ERA. Against the Yankees, he was 28-13 with a 3.32 ERA in 56 games (49 starts). That included three shutouts, and he also had two of his 11 career saves against the Yankees. At Yankee Stadium, he was 12-6 with a 3.11 ERA in 24 games (21 starts).\" The Detroit Tigers are saddened to learn of the passing of Frank Lary, \"the ballclub said in a statement .\" A three-time All-Star and a Gold Glove winner in 1961, Frank spent 11 years of his 12-year major-league career in Detroit. The Tigers organization extends our deepest sympathies to Frank's wife, Emma, and their family. \"Lary, a native of Northport, Ala.--where he still lived when he died--broke into the majors in 1954, after a successful run at the University of Alabama, which he helped to its first College World Series appearance in 1950. He signed with the Tigers organization for a $6,000 bonus, and his first full season in the major leagues was 1955, when he was 14-15 with a 3.10 ERA. The next year, he won 21 games in finishing 17th in the American League MVP voting. His best season was 1961, when he was 23-9 with a 3.24 ERA and a league-best 22 complete games. He was third in the Cy Young voting, behind winner <mark>Whitey Ford</mark> of the Yankees and Warren Spahn of the Milwaukee Braves. By today's standards, Lary probably would've won, given his WAR (4.3) was higher than <mark>Ford</mark>'s and Spahn's .\" He is mean on the mound and a joker off it, \"Sports Illustrated wrote in a 1961 profile of Lary, who also had nicknames\" Taters \"--after he once placed an order on a dining cart for\" Taters, \"or potatoes--as well as\" The Mule. \"Lary also could hit a little bit, with six home runs and 54 RBIs in his career. His most memorable homer came against--you guessed it--the Yankees. On May 12, 1961, at Yankee Stadium, the game was tied at 3 when Lary led off the top of the ninth inning with a solo shot to left field. He then worked the bottom of the ninth inning for the complete-game victory. Lary had brief stints with the New York Mets, Milwaukee Braves and Chicago White Sox after departing the Tigers in 1964. He coached and scouted briefly following his 1965 retirement before returning home to start a construction business. Lary's older brother, Al, played briefly in the major leagues, as a pitcher with the Chicago Cubs in 1954 and 1962. He died in 2001. Lary was the youngest of seven boys, all of whom were taller than his 5-foot-11 frame .\" That's one thing that made him so competitive, \"Joe Lary told the Tuscaloosa News .\" He didn't want his older brothers showing him up in sports. \"According to the Tuscaloosa News, a funeral service will be held at 2 p.m. Saturday in Northport, just south of Tuscaloosa. tpaul @ detroitnews.com twitter.com/tonypaul1984 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE", "articleID": "2017121517_00974154_W", "names": {"Whitey Ford": ["Q1345775", "Q453048"]}}, {"date": "2017-12-19", "url": "https://www.ndtv.com/india-news/lessons-should-be-learnt-from-doklam-standoff-china-1789645?pfrom=home-india", "content": "News Alerts Must Learn From Doklam To Avoid Future Conflict, Says China China says its ties with India have maintained a good momentum, though the Doklam incident posed a \"major test\" All India | | Updated: December 19, 2017 16:40 IST Press Trust of India 1 Share COMMENTS The Doklam standoff ended on August 28 following mutual agreement between India and China. Beijing: China today said the Doklam standoff posed a \"major test\" for bilateral ties with India and lessons should be learnt from it to avoid a similar situation of its kind in future. The comment came ahead of the 20th round of India-China border talks which are expected to be held this week in New Delhi between National Security Advisor (NSA) Ajit Doval and China's State Councillor Yang Jiechi, who are designated Special Representatives. Though the talks are scheduled for December 22, an official announcement has not been made yet from both sides. The two sides attach significance to this event as it would be the first round of talks since the 73-day-long standoff in Doklam ended on August 28. \"This Special Representative meeting is not only a high - level channel for the border issue discussion but also the platform for strategic communication,\" Chinese Foreign Ministry spokesperson Hua Chunying told reporters today. This also allows the two sides to exchange views on the international and regional issues of major concern, she said. \"In 2017, China-India relations have maintained a good momentum generally but the Doklam incident posed a major test for the two countries. We should learn lessons from this incident to avoid any further conflict of this kind in the future,\" Hua said. \"We should follow our historical conventions on the border to uphold the tranquillity and peace in the border region...\"Hua said the Doklam issue also figured in the recent visit of Foreign Minister <mark>Wang Yi</mark> to New Delhi to take part in the foreign ministers' meeting of Russia, India and China. <mark>Wang</mark> held talks with External Affairs Minister Sushma Swaraj and President Ram Nath Kovind. <mark>Wang</mark> in his meeting with Ms Swaraj also touched the Doklam issue, Hua said. Officials say <mark>Wang</mark>'s visit, the first by a top Chinese official after the Doklam standoff and the starting of the second term of Chinese President Xi Jinping in October, facilitated a more candid and frank talks between the two countries to tide over most contentious issues. In June, Chinese soldiers who began constructing a new road were stopped by Indian troops who crossed over the border at Sikkim. The new road would give Beijing access to a thin corridor that connects India to its northeastern states. In August, both sides agreed to withdraw their soldiers from the face-off site at Doklam.", "articleID": "2017121911_00197496_W", "names": {"Wang Yi": ["Q15932545", "Q16761688", "Q19856060", "Q24862862", "Q3377225", "Q45362970", "Q45365249", "Q45366078", "Q45380924", "Q45390101", "Q45425687", "Q45429019", "Q45429157", "Q45429905", "Q45429976", "Q45430089", "Q45430100", "Q45430139", "Q45430146", "Q45430201", "Q45430445", "Q45430586", "Q45430843", "Q45430888", "Q45431252", "Q45432263", "Q45432751", "Q45433689", "Q45435777", "Q45438173", "Q45439039", "Q45440374", "Q45440619", "Q45441141", "Q45441358", "Q45441846", "Q45442720", "Q45444153", "Q45444479", "Q45449266", "Q45450958", "Q45451889", "Q45453602", "Q45456208", "Q45458273", "Q45460179", "Q45461385", "Q45461492", "Q45463127", "Q45463252", "Q45463313", "Q45464397", "Q45464678", "Q45467325", "Q45468288", "Q45470135", "Q45470350", "Q45471531", "Q45473275", "Q45473300", "Q45473712", "Q45474981", "Q45476893", "Q45477133", "Q45477197", "Q45477783", "Q45478126", "Q45482098", "Q45482651", "Q45484195", "Q45484788", "Q45484851", "Q45485172", "Q45487005", "Q45487323", "Q45488065", "Q45489663", "Q45489920", "Q45494057", "Q45494122", "Q45495824", "Q45495899", "Q45497431", "Q45498725", "Q45498891", "Q45500643", "Q45501596", "Q45503837", "Q45503903", "Q45505099", "Q45506593", "Q45510291", "Q45510922", "Q45511242", "Q45512097", "Q45517622", "Q45518994", "Q45519248", "Q45522397", "Q45522579", "Q45522897", "Q45523020", "Q45524384", "Q45525774", "Q45526117", "Q45526169", "Q45526264", "Q45526515", "Q45526559", "Q45526577", "Q45528290", "Q45529863", "Q45531596", "Q45533096", "Q45533724", "Q45534699", "Q45537901", "Q45537914", "Q45542700", "Q45544139", "Q45545442", "Q45546857", "Q45546989", "Q45547491", "Q45549586", "Q45551972", "Q45553665", "Q45557159", "Q45562351", "Q45562575", "Q45563542", "Q45564252", "Q45564924", "Q45565099", "Q45565936", "Q45566677", "Q45566812", "Q45567198", "Q45568662", "Q45569083", "Q45570277", "Q45570414", "Q45571257", "Q45574576", "Q45575912", "Q45577451", "Q45577513", "Q45577557", "Q45578837", "Q45582397", "Q45587318", "Q45588697", "Q45588985", "Q45589792", "Q45593967", "Q45596729", "Q45597277", "Q45597933", "Q45598381", "Q45599612", "Q45600048", "Q45602481", "Q45603757", "Q45604894", "Q45606237", "Q45607692", "Q45610171", "Q45610336", "Q45614214", "Q45615809", "Q45616313", "Q45620206", "Q45624357", "Q45624969", "Q45625084", "Q45626718", "Q45627280", "Q45627918", "Q45628746", "Q45631319", "Q45633270", "Q45634561", "Q45635419", "Q45635523", "Q45635598", "Q45635761", "Q45638288", "Q45643990", "Q45644206", "Q45644720", "Q45645937", "Q45647421", "Q45648130", "Q45649054", "Q45649114", "Q45650832", "Q45653345", "Q45653992", "Q45654195", "Q45655152", "Q45655407", "Q45655965", "Q45656791", "Q45656851", "Q45657131", "Q45658647", "Q45658937", "Q45660908", "Q45660968", "Q45661026", "Q45661086", "Q45661744", "Q45662466", "Q45664007", "Q45664062", "Q45664115", "Q45664170", "Q45664279", "Q45664332", "Q45664387", "Q45664815", "Q45665897", "Q45666235", "Q45666555", "Q45667659", "Q45667814", "Q45669071", "Q45673037", "Q45675163", "Q45675682", "Q45675927", "Q45676301", "Q45676611", "Q45676790", "Q45676907", "Q45677479", "Q45678142", "Q45678761", "Q45679097", "Q45679522", "Q45680963", "Q45683246", "Q45683871", "Q45693876", "Q45697186", "Q45699725", "Q45704592", "Q45705277", "Q45706438", "Q56008821", "Q701801", "Q705734", "Q7967716", "Q7967717", "Q7967720", "Q9058743", "Q9065465"]}}, {"date": "2017-12-19", "url": "http://www.wtoc.com/story/37100976/free-cooking-demo-offers-sw-georgians-healthy-eating-options", "content": "Free cooking demo offers SW Georgians healthy eating options - WTOC-TV: Savannah, Beaufort, SC, News, Weather & Sports Free cooking demo offers SW Georgians healthy eating options - WTOC-TV: Savannah, Beaufort, SC, News, Weather & Sports Member Center: Free cooking demo offers SW Georgians healthy eating options 2017-12-19T17:32:53 Z Folks learn how to cook cabage from the free, healthy cooking demo (Source: WALB) Cabbage waiting to be cooked (Source: WALB) <mark>Bill Miller</mark> Community Center also has community gardens (Source: WALB) ALBANY, GA (WALB) - Folks in the Albany community had the opportunity to sample cabbage late Tuesday morning. Through the Department of Public Health's \"Pick it, try it, like it\" series, DPH workers taught people at the <mark>Bill Miller</mark> Community Center how to cook cabbage. After learning how to make healthy recipes to try at home, they got to sample the dish. Ebonee Kirkwood, DPH's Chronic Disease Prevention Manager for the Southwest Health District, said they want to work specifically with adults to learn how to eat healthy. \"We're trying to make sure that those fresh fruits and vegetables are easily accessible to the populations that are at greater risk for chronic diseases such as diabetes, heart disease and even obesity,\" explained Kirkwood. If you want to stop by the next event it will be at 9:30 on January 10 at Jackson Heights Community Center. The vegetable demonstrators will focus on is kale. Copyright 2017 WALB. All rights reserved. Tuesday, December 19 2017 1:20 PM EST 2017-12-19 18:20:05 GMT Source: WTOC Savannah-Chatham Metro Police are investigating a shooting that took place at an apartment complex on E. Montgomery Cross Road, Tuesday afternoon. Tuesday, December 19 2017 12:30 PM EST 2017-12-19 17:30:35 GMT Steven <mark>Wayne Collins</mark> (Source: CCSO) The Candler County Sheriff's Office says a suspect wanted after a multi-county police chase Monday morning has turned himself in. Tuesday, December 19 2017 9:36 AM EST 2017-12-19 14:36:00 GMT (Source: SCMPD) The Savannah-Chatham Metropolitan Police Department is asking for the public's help identifying a pair suspected of stealing several hoverboards from Walmart on Abercorn Street. Tuesday, December 19 2017 8:50 AM EST 2017-12-19 13:50:02 GMT Last year's turkey giveaway event. (Source: WTOC) Savannah Attorney Mike Hostilo is lending a helping hand when it comes to feeding folks this holiday season. Tuesday, December 19 2017 8:17 AM EST 2017-12-19 13:17:36 GMT (Source: WTOC)", "articleID": "2017121918_00738197_W", "names": {"Bill Miller": ["Q14951130", "Q16187209", "Q16732604", "Q19325928", "Q28421889", "Q30507980", "Q43379343", "Q438279", "Q4910185", "Q4910193", "Q4910195", "Q860960", "Q862326"], "Wayne Collins": ["Q20676285", "Q7976110", "Q7976111"]}}, {"date": "2017-12-19", "url": "https://uk.news.yahoo.com/star-wars-prequel-rogue-one-082200001.html", "content": "Star Wars: The Last Jedi has been out for less than a week and has proved rather divisive with some praising it as one of the best franchise entries to date and others disliking the direction that director Rian Johnson has steered the series in. Regardless of your stance on Episode VIII, it's hard to ignore the fact that the film - while immensely enjoyable in many place - is riddled with glaring plot holes and convenient devices which help our rebel heroes out of some pretty sticky situations. One such moment presents itself in a sequence which reveals that the First Order have developed technology that allows them to follow the Rebel Alliance through hyperspace. Convenient, huh? It turns out the First Order has been on the cusp of being able to do this for years - a discovery made by Jyn Erso (<mark>Felicity Jones</mark>) in prequel spinoff Rogue One. Redditor rhodetolove pointed out that in the 2016 film, Erso - while looking for the plans to the Death Star - sifted through the names of other files on the Empire's database, one of which is \"Hyperspace tracking .\" \"They can track us through hyperspace?!\" Hyperspace tracking is actually old tech, as old as the Death Star plans @ CenayangFilm pic.twitter.com/KZtmsoHVM6--Donny Narendra (@ donny_np) December 19, 2017 This throwaway moment lends credence to the fact that Johnson didn't just concoct the plot device to increase the danger for our heroes in The Last Jedi. The name of the film's most intriguing new character - a creation that hints at the future of the franchise under Johnson's guidance - has been revealed. Follow Independent Culture on Facebook", "articleID": "2017122001_00145643_W", "names": {"Felicity Jones": ["Q16232172", "Q21402730", "Q234447"]}}]