[{"date": "2017-12-20", "url": "http://onlineathens.com/local-news/2017-12-20/possible-changes-clayton-street-contentious-topic-some", "content": "lee.shearer @ onlineathens.com Possible changes to Clayton Street contentious topic for some Cars move down Clayton Street in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) A surveyor at work in College Square in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) Cars move down Clayton Street. (Photo/Joshua L. Jones, Athens Banner-Herald) Cars move down Clayton Street in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) Cars move down Clayton Street in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) Some downtown business owners say they're being left out of the planning process as the Athens-Clarke County government gets ready for a major facelift for three downtown blocks of Clayton Street along with intersecting sections of North Jackson and Wall streets. Athens Downtown Development Authority co-director <mark>David Lynn</mark> wants to fast-forward a part of the project, which includes underground changes such as storm-sewer improvements as well as above-ground changes, which may include moving curbs further out from buildings to have wider sidewalks, reducing Clayton Street to three lanes from its present two, while preserving angle parking. Angle parking allows for more cars to park than parallel parking on the side of a street. \"We're trying to reduce the pain (of street construction during busy retail shopping seasons),\" <mark>Lynn</mark> told Athens-Clarke County Commissioners in the board's agenda-setting meeting Tuesday. The sooner the project can get going, the more likely it is that disruptive construction won't spill over into more busy fall or holiday shopping season, he said. The infrastructure and streetscape project is a continuation of earlier work down on Clayton Street toward its end on Pulaski Street. But officials should share more about the plans and allow for more public discussion before embarking on changes that could actually threaten some businesses' abilities to survive, according to business owners who spoke to commissioners. \"It's a slap in the face of the business owners,' said Frontier owner Devin Clower .\" I do think rushing it is not a good idea, \"said another business owner .\" I think a lot of citizens would like to have input and certainlly some of the merchants are concerned, \"said another speaker, <mark>Julie Duncan</mark>.\" Would it hurt to have one public input session? I don't see the harm, \"said an owner of a downtown building, Russell Edwards. More public input might elicit more creativity in the streetscape part of the project, Clower said. But beginning work earlier on the infrastructure portion of the project would still leave ample time for input into what it will look like, <mark>Lynn</mark> said. He said he'd talked to a number of business owners already. Some commissioners were sympathetic to the business owners' complaints .\" Downtown is the economic and cultural heart of this city. To not reach out to them is unconscionable, \"said District 3 Commissioner Melissa Link. Commissioners asked county administrators for more information before the commission's upcoming voting meeting next month. In a $109.5 million transportation sales tax approved by voters last month, about $7.1 million is earmarked for downtown Athens projects, such as improvements to Clayton Street.", "articleID": "2017122021_00496145_W", "names": {"David Lynn": ["Q1175360", "Q28155105", "Q5236858", "Q58003126"], "Julie Duncan": ["Q39127284", "Q53353478"]}}, {"date": "2017-12-21", "url": "http://www.newsmax.com/us/donald-trump-walter-reed-visit-soldiers/2017/12/21/id/833201/", "content": "Trump Swings by Walter Reed to Visit With Soldiers (Andrew Harrer/Getty Images) By Jason Devaney | Thursday, 21 Dec 2017 04:03 PM Close A A President Donald Trump visited soldiers at Walter Reed National Military Medical Center Thursday afternoon via a short helicopter flight on Marine One. Trump arrived at the facility shortly before 3 p.m., according to a pool report. Prior to leaving the White House, he promised to wish soldiers there a Merry Christmas. \"Merry Christmas, everybody. I'm heading over right now to Walter Reed Medical Center to say hello to some of the bravest people anywhere in the world. They're great people,\" Trump said. \"I will be over there for a while. Just gonna wish them a Merry Christmas, Happy New Year. We love those people .\" According to White House Chief of Staff <mark>John Kelly</mark>--a retired Marine general--joined Trump on his visit. The Hill, Walter Reed is located in Bethesda, Maryland, a drive of less than nine miles from the White House. Related Stories:", "articleID": "2017122121_00165968_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}}, {"date": "2017-12-22", "url": "http://www.mydaytondailynews.com/sports/adoree-jackson-who-grew-rooting-for-rams-faces-them-with-lot-line/NP0fDxip3uc0VlbW2G5sbJ/", "content": "sports By <mark>Gary Klein</mark> - Los Angeles Times...CHARLES TRAINOR JR/TNS Miami Dolphins quarterback Jay Cuyler (6) runs from the Tennessee Titans' Adoree Jackson (25) at Hard Rock Stadium in Miami Gardens, Fla., on October 8, 2017. (Charles Trainor Jr. / Miami Herald/TNS) Posted: 6:00 a.m. Friday, December 22, 2017 LOS ANGELES--Growing up about 15 miles from St. Louis, Adoree' Jackson rooted for and dreamed of playing for the Los Angeles Rams. Quarterback Kurt Warner, running back Marshall Faulk, receivers Isaac Bruce and Torry Holt and offensive lineman Orlando Pace were among the Rams players who starred at the <mark>Edward Jones</mark> Dome and won a Super Bowl during Jackson's youth. Jackson also played in the stadium--during halftime exhibitions featuring local Pop Warner teams. When he stepped onto the artificial turf, his goal was always the same. \"The only thing on my mind was playing well so I could go to Dave & Buster's,\" Jackson said, referring to the restaurant and arcade chain. \"That's what my dad always did for me .\" He said give him three touchdowns and he'd take me to Dave & Buster's. So I pretty much went to Dave & Buster's every weekend during football season. \"Jackson moved to California after his first year of high school. He starred at multiple positions at Gardena Serra and USC before the Tennessee Titans selected him with the 18th pick in this year's draft. Related Golden State Warriors' go-to guy doesn't play a minute On Sunday, Jackson will start at cornerback and return kicks for the Titans when they play host to the Rams at Nissan Stadium in a game that has playoff implications for both teams. The Titans are 8-6 and in second place behind the Jacksonville Jaguars in the AFC South, needing a win plus some help to get in. The Rams are 10-4--their first 10-win season since Jackson was 8 years old--and can clinch the NFC West with a victory .\" It will be strange because I always wanted to play for them growing up as a kid, \"Jackson said during a phone interview last week .\" But being able to play against them is one of those things that's pretty cool. \"Jackson, 22, has started every game at cornerback. He has broken up 14 passes and forced two fumbles. On special teams he's averaging 21.3 yards per kickoff return and 9.3 yards per punt return. He also has rushed for 55 yards in five carries but has not run the ball in the last four games. Rams rookie running back <mark>Justin Davis</mark> was a teammate of Jackson for three seasons at USC. Receiver <mark>Robert Woods</mark>, a fifth-year pro, played at Serra and USC and has watched Jackson evolve as a cornerback and return specialist .\" He's made a lot of plays, \"<mark>Woods</mark> said .\" He's an exciting player on punt returns, one of those very, very elusive players ....When he gets the ball in his hands, he's a very dangerous player. \"A matchup with <mark>Woods</mark> would be Jackson's second this season against a former Serra and USC All-American receiver. Jackson covered Jacksonville's Marqise Lee on several plays during the Titans' Week 2 victory over the Jaguars. Lee, a fourth-year pro, caught seven passes for 76 yards .\" It was cool to see Marqise out there, \"Jackson said .\" I always wanted to play with him, but when I transferred to Serra, he was leaving. And when I got to SC, he left ....Playing against him, it was an honor. \"We always keep in touch. He's like a big bro in my eyes, one of those guys I tried to model my game after when I was at Serra .\" Jackson also knows <mark>Woods</mark>, who returned from a shoulder injury for last week's 42-7 victory at Seattle. <mark>Woods</mark> has 53 catches, five for touchdowns. \"We've all been in touch, worked out together a couple times,\" Jackson said. \"From <mark>Woods</mark> to Lee, it's just cool the connection we have. It's bigger than just football. It's like a brotherhood we have from being at the same high school and college .\" Jackson said he was improving each week, \"getting smarter, getting better, tuning up some things to play at a high level\" every week. Jackson left USC with a season of eligibility remaining. He said he was close to finishing his undergraduate degree and has considered pursuing a master's degree. But his focus is on football. \"Having the whole offseason, without having to get ready for the draft and prepare for the combine and be able to focus on certain things, I think that's going to be a big help going into my second year,\" he said. First, he'll concentrate on containing <mark>Woods</mark> and other Rams receivers, and helping the Titans stay in the playoff race. He also plans to acquire a Rams souvenir. \"I'm sure after the game, I got to do a jersey swap or something with <mark>Woods</mark>,\" he said, \"so I can have one of those jerseys to hang up .\" Popular in sports 1 2 3", "articleID": "2017122211_00354092_W", "names": {"Edward Jones": ["Q16853914", "Q18671061", "Q19282395", "Q24042103", "Q5343818", "Q5343819", "Q5343824", "Q56597246"], "Gary Klein": ["Q1746215", "Q5525375"], "Justin Davis": ["Q14904993", "Q38708712", "Q6317515", "Q6317516"], "Robert Woods": ["Q1265326", "Q12970035", "Q3436589", "Q7351239", "Q7351240"]}}, {"date": "2017-12-22", "url": "http://ew.com/tv/2017/12/22/bingeworthy-best-tv-revivals-2017/", "content": "Will & Grace hailed as one of 2017's best TV revivals Derek Lawrence December 22, 2017 AT 07:30 AM EST Catch the full episode of Bingeworthy here and on PeopleTV. Go to PEO PLE.com / PeopleTV, or download the free app on your smart TV, mobile, and web devices. 2017 might be the year of the television revival, but only a few of the many returns can be labeled the best. On the latest edition of Bingeworthy, hosts <mark>Jessica Shaw</mark> and Lola Ogunnaike shared their picks for the year's top revival, with <mark>Shaw</mark> choosing Netflix's One Day at a Time and Ogunnaike selecting Will & Grace. \"It did not disappoint,\" Ogunnaike said of the NBC sitcom's long-awaited ninth season. \"The opening episode came out on fire...And it's been a laugh parade ever since .\" Watch the full clip above. You May Like Comments Read More Get your EW TV news Subscribe to EW TV for the latest TV news. Signup Now EDIT POST", "articleID": "2017122212_00499138_W", "names": {"Jessica Shaw": ["Q28957221", "Q39061600"]}}, {"date": "2017-12-22", "url": "https://www.independent.ie/irish-news/news/inms-david-harrison-stands-down-as-company-director-36431051.html", "content": "Independent. ie INM's <mark>David Harrison</mark> stands down as company director Independent House, Talbot Street, Dublin INM's <mark>David Harrison</mark> stands down as company director Independent. ie Independent News & Media (INM) has announced that <mark>David Harrison</mark> has stood down as a director after five years with the company. The Dermot Desmond nominated director was elected to the board of INM as a non-executive director in 2012. https: //www.independent.ie/irish-news/news/inms-david-harrison-stands-down-as-company-director-36431051.html Email Independent News & Media (INM) has announced that <mark>David Harrison</mark> has stood down as a director after five years with the company. The Dermot Desmond nominated director was elected to the board of INM as a non-executive director in 2012. INM's Chairman, Leslie Buckley, said \"On behalf of the Company and the Board, I wish to express my sincere gratitude to <mark>David</mark> for his extremely valuable and positive contribution to INM over the last five years. His support and dedication has been invaluable during this transformative period for the business .\" The company is in the process of appointing candidates to fill a number of vacancies, including to replace the former senior non-executive director Jerome Kennedy who stood down earlier in the year. Online Editors", "articleID": "2017122216_00807127_W", "names": {"David Harrison": ["Q19798242", "Q2337380", "Q24005525", "Q3018041", "Q5234755", "Q5234756", "Q5234758", "Q5234759", "Q5234760"]}}, {"date": "2017-12-23", "url": "http://www.ktvq.com/story/37130823/analysis-tax-bill-means-savings-for-most-montanans-lower-state-revenues", "content": "Analysis: Tax bill means savings for most Montanans, lower state - KTVQ.com | Q2 | Continuous News Coverage | Billings, MT Analysis: Tax bill means savings for most Montanans, lower state - KTVQ.com | Q2 | Continuous News Coverage | Billings, MT Member Center: Analysis: Tax bill means savings for most Montanans, lower state revenues Posted: Updated: By Jonathon Ambarian - MTN News HELENA - The vast majority of Montanans will pay less in federal income tax after the new Republican tax reform bill takes effect in January, according to new analysis from the state Department of Revenue. The agency analysis says more than three-quarters of the roughly 461,000 Montana households that file federal tax returns will receive an income tax cut of at least $50 a year and at least 2 percent of what they currently pay. About 20 percent of households will see a small change--an increase or decrease of less than $50 or 2 percent of their current taxes. Just over 1.5 percent will see a larger tax increase. Overall, Revenue estimates Montanans will save a total of more than $746 million in federal income tax next year. Just under half of that savings--about $356 million--will go to the top 10 percent of income earners. The average tax cut for a Montana household will be about $1,618 in 2018, but that will vary widely based on taxpayers' income levels. For the top third of income earners, those making more than $64,000, the average cut will be $3,881. It will be $945 for a household earning between $64,000 and $20,000, and $307 for those making less. President Donald Trump signed the sweeping tax reform into law Friday. Republican leaders have called it the most substantial change in the federal tax code in decades. The plan reduces the top income tax rate for individuals, adjusts the other individual tax brackets, significantly cuts the corporate tax rate and increases the standard deduction taxpayers can take, among other changes. In addition, it repeals the federal Affordable Care Act's requirement that individuals purchase health insurance or pay a tax penalty. Because the tax law goes into effect next year, people will start seeing changes next month in the amount withdrawn from their paychecks. However, there won't be any large changes in taxpayers' returns for 2017, which must be filed by April. Webb Brown, president and CEO of the Montana Chamber of Commerce, said his group supported tax reform as a way to make American businesses more competitive with those overseas. \"The bottom line here is almost three-quarters of a billion dollars will now stay in Montana, and stay in the economy here,\" he said. \"We're excited about what that will mean in increased economic activity .\" In addition to breaking down the tax bill's effect on individual Montanans, the Revenue Department analyzed what changes it could bring to the state budget. In a memo to Gov. <mark>Steve Bullock</mark>'s budget office, Revenue director Mike Kadas said provisions in the bill might reduce state revenues by millions of dollars. Kadas said the state could lose $29 million in individual income tax during the 2018 tax year. He said the biggest reason is a change to \"pass-through\" businesses, which do not file corporate taxes, but instead pass their income directly to the individuals who own them. The tax reform allowed many of those businesses to deduct up to 20 percent of that income from their taxes. Revenue also estimates Montana could receive $17 million less in corporate tax in 2018. Kadas said that would be mostly due to a change allowing businesses to deduct more of the costs for new equipment and other investments. Kadas' memo also highlighted the possibility that the tax bill could trigger automatic federal spending cuts--including $24 million a year in mineral leasing payments for Montana. That concern is based on a 2010 law that requires offsetting cuts if legislation would otherwise lead to an increase in the national deficit. However, congressional leaders have announced they intend to waive that law as part of a year-end spending agreement. Brown said the Montana Chamber is concerned both about the federal deficit and about the effects the tax reform could have on state revenues, especially after a budget crisis led to a special state legislative session last month. But he said the new law should be a positive change for Montana overall. \"We believe in the long run, this is beneficial,\" he said. \"So now we have to get to work on how we can make the adjustments in Montana .\" The Revenue Department's analysis is based on the tax year, which runs from January to December. The governor's budget office still has to make its own determination of what the changes mean for the state's financial picture. State budgeting is based on a fiscal year that runs from July to June. Kadas said Revenue has only begun to analyze the tax reform's effects on Montana. \"It's a 500-page bill that fits into several thousand pages of code,\" he said. \"I think everything that you see now is preliminary, and we have to have time to kind of work through the details of it .\" Montana's congressional delegation was split on the tax reform plan. Republican Sen. Steve Daines and Rep. Greg Gianforte both supported it, saying it would give Montana families a needed tax cut and provide a boost to the state's economy. Democratic Sen. Jon Tester voted against the plan, saying too much of the tax relief went to the wealthiest Montanans and criticizing the repeal of the individual health insurance mandate. WEATHER Posted: Wednesday, December 20 2017 10:53 AM EST 2017-12-20 15:53:35 GMT There has been a lot of talk about the existence of aliens and UFOs following reports that the Pentagon has researched them, but astrophysicist Neil deGrasse Tyson isn't convinced, or frankly, interested. There has been a lot of talk about the existence of aliens and UFOs following reports that the Pentagon has researched them, but astrophysicist Neil deGrasse Tyson isn't convinced, or frankly, interested. Friday, December 22 2017 2:13 PM EST 2017-12-22 19:13:18 GMT Vernelle Badbear (left) Freman Bends (right) (Photos from Facebook) More than a year after a man was found dead in Big Horn County, a Wyola woman has been charged with the murder. More than a year after a man was found dead in Big Horn County, a Wyola woman has been charged with the murder. Friday, December 22 2017 9:06 AM EST 2017-12-22 14:06:14 GMT The interview comes four months after the disappearance and death of Savanna Lafontaine-Greywind. The interview comes four months after the disappearance and death of Savanna Lafontaine-Greywind. Friday, December 22 2017 10:45 AM EST 2017-12-22 15:45:57 GMT Father James Csaszar / CBS CHICAGO An Ohio priest under investigation for questionable communications with a minor took his life in Chicago. An Ohio priest under investigation for questionable communications with a minor took his life in Chicago.", "articleID": "2017122303_00377787_W", "names": {"Steve Bullock": ["Q24015", "Q7612088", "Q7612089"]}}]