[{"date": "2017-12-23", "url": "http://www.rappler.com/sports/world/192095-nfl-nba-political-protest-year", "content": "NFL, NBA go political in year of protests World Sports NFL, NBA go political in year of protests 2017 is a year that saw sports figures make a stand - and kneel - against Trump and a culture of inequality Published 3:12 PM, December 23, 2017 Updated 3:12 PM, December 23, 2017 PROTEST. <mark>Maurice Smith</mark> #27 and Julius Thomas #89 kneel with Jarvis Landry #14 of the Miami Dolphins during the National Anthem prior to an NFL game against the New York Jets. Steven Ryan/Getty Images/AFP LOS ANGELES--From the US President describing protesting NFL players as \"sons of bitches\" to the pre-eminent superstar of the NBA disparaging the occupant of the White House as a \"bum\" , 2017 was the year that American sport went political. Decades of convention which had allowed the two phenomenally successful professional sports leagues to chug along peacefully, and apolitically, were swept away in the course on one tumultuous weekend in September. In February, as protests erupted across the nation after <mark>Donald Trump</mark>'s new administration issued restrictions on visitors from several Muslim nations, participants in Super Bowl 52 mostly stuck to the line that sport and politics should be kept apart. \"I'm not talking politics at all,\" said New England Patriots quarterback <mark>Tom Brady</mark>. \"If people want to take sides, they have a right to do that. I have a right to stay out of it too .\" <mark>Brady</mark> would subsequently go on to lead the Patriots to an astonishing comeback from 28-3 down to defeat the Atlanta Falcons for a record fifth Super Bowl. In the immediate aftermath of that win, there was no hint of the controversy that would engulf America's most popular sport soon after the 2017-2018 season kicked off 7 months later. The seeds had been sown a year earlier, when San Francisco 49ers quarterback Colin Kaepernick refused to stand for the national anthem in a protest aimed at drawing attention to injustices suffered by minorities at the hands of law enforcement. Trump tirade Yet as September rolled around, Kaepernick's protest movement had largely fizzled. Kaepernick, a free agent, had found himself frozen out of the sport, with none of the 32 teams in the NFL seeing any value in a 30-year-old quarterback who had led the 49ers to the brink of a Super Bowl victory only 4 years earlier. A handful of players continued to kneel for the anthem in early season games, but as a story, the issue had been mostly forgotten. That all changed on September 22, when Trump, speaking at a rally in Alabama, raised the issue of NFL players who refused to stand for the anthem. To loud cheers, Trump said NFL owners should respond to the players by saying, \"Get that son of a bitch off the field right now, he's fired. He's fired!\". The following day, Trump turned his attention to the NBA's reigning champions Golden State and their star point guard, <mark>Stephen Curry</mark>. <mark>Curry</mark>, like many of his Warriors team-mates an outspoken critic of Trump, had earlier indicated he would be reluctant to visit a White House reception if the team was invited. Trump responded by withdrawing the team's invitation. \"Going to the White House is considered a great honor for a championship team. <mark>Stephen Curry</mark> is hesitating, therefore invitation is withdrawn!\" he wrote. Trump's outburst drew sharp criticism, with Cleveland Cavaliers superstar LeBron James leading the charge. \"U bum @ StephenCurry already said he ain't going!\" James wrote on Twitter. \"So therefore ain't no invite. Going to White House was a great honor until you showed up .\" \"Lack of respect' The NFL, meanwhile, united in its response to Trump's criticism of players who protest .\" Divisive comments like these demonstrate an unfortunate lack of respect for the NFL, our great game and all of our players, \"NFL commissioner Roger Goodell wrote in a statement. NFL team owners issued statements condemning Trump's comments. (READ: Fil-Am NFL star Baldwin believes\" dehumanized' Trump's comments can unify sports world) But the most resounding statement came on the following Sunday, two days after Trump's comments, when a wave of player protests erupted across the league in the biggest single demonstration of political activism in NFL history. All told, around 150 players across the league took to one knee during the playing of the US national anthem, instantly reigniting Kaepernick's cause. \"We felt like President Trump's speech was an assault on our most cherished right--freedom of speech,\" Denver star Von Miller explained. Trump's anti-NFL invective has continued, as have the player protests, albeit on a smaller scale. The NFL meanwhile has had to navigate a difficult course, on the one hand defending protesting players from political attack while at the same time not antagonizing fans who see refusal to stand for the anthem as an affront bordering on treason. Goodell has led talks with protesting players and the NFL has pledged nearly $100 million to charities which deal with criminal justice reform, law enforcement/community relations and education. The NFL hierarchy hopes the pledge will help draw a line under its season of protest, although there is no explicit requirement for players to refrain from demonstrating during the anthem .--Rappler.com", "articleID": "2017122307_00174035_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Maurice Smith": ["Q2698144", "Q30122557", "Q3301416", "Q6793475", "Q6793476", "Q721093"], "Stephen Curry": ["Q352159", "Q43981708", "Q5573861"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}}, {"date": "2017-12-24", "url": "http://ca.reuters.com/article/businessNews/idCAKBN1EI001-OCABS", "content": "December 24, 2017 / 12:07 AM / in 5 minutes An investor's best friend: China's booming pet market sparks deals Anita Li, Adam Jourdan 7 Min Read PINGYANG, China/SHANGHAI (Reuters) - Li Mingjie is a pet industry investor's dream. The 23-year-old e-commerce worker spares little expense to make his pooch happy. Pet dog Duoduo walks into Cute Beast Pet Resort in Beijing, China December 22, 2017. Picture taken December 22, 2017. REUTERS/Jason Lee \"I'll happily splash out on my dog,\" Li told Reuters as he walked his brown poodle Coco in Pingyang, a town on China's east coast. \"She is like a child to me .\" He is far from alone in China these days. The growth in the middle class, a massive move to urbanization and other demographic changes - such as growing numbers of elderly, and people getting married and having children later than before - have been turning this into not just a pet-owning society but also one that is prepared to lavish money on them. Chinese shoppers are set to spend 46.3 billion yuan ($7 billion) on their pets by 2022, up from 17.5 billion yuan this year as the market grows at around an annual 20 percent, according to estimates from Euromonitor. The U.S. market may be much bigger with an estimated $44.4 billion in sales this year but it is only growing around 2 percent a year. The surge in Chinese demand is not only great news for global pet food behemoths such as Mars Inc and Nestle SA NESN. S, but also rapidly growing Chinese pet food and product companies, as well as entrepreneurs setting up everything from dog salons for grooming to fancy pet hotels. It is an amazing shift in a country where owning pets was once banned for being too much of a bourgeois pursuit under revolutionary leader Mao Zedong, and where - despite protests - there is still an annual dog-meat festival in the southern Chinese town of Yulin. \"There is huge growth potential in the Chinese market,\" said Liu Yonghao, the chairman of Chinese company New Hope Group [NWHOP. UL] at a recent event in Beijing, noting that younger people especially were developing closer bonds with their pets. \"They are willing to spend lots of money on the pets because they have become like part of the family,\" he said. New Hope joined a consortium, including Singapore's state-owned fund Temasek and private equity firm Hosen Capital that just closed a $1 billion deal to acquire Australian pet food maker Real Pet Food Co, with the aim of bringing the firm's brands to China. The growing popularity of pets is turning China into a magnet for local and global firms. Thomas Kwan, chief investment officer of Hong Kong-based fund manager Harvest Global, said China's pet market would be one of his personal picks for 2018 as consumers looked to shift up to premium products. The questions pet owners are asking now: \"Can you buy them healthy foods? Can you give them a good lifestyle?\" he said. BONE-SHAPED CENTER Pingyang, where Li lives with his poodle, has big ambitions in China's pet economy. The county, which is near the wealthy city of Wenzhou and has a population of almost one million, is among a slew of places responding to Beijing's call to create 1,000 \"specialty towns\" by 2020 in industries from cloud computing to chocolate. In Pingyang's case the theme is pets. It has a dog bone-shaped visitor center and pet factories, while locals said there were plans for pet-themed hotels and a retail hub. On a recent visit, though, it was clear the concept has a way to go. The visitor center was shut and locals admitted the \"pet town' had yet to fully catch on. Nationally though, there is no doubt that the pet economy is thriving--helped by demographic shifts .\" Chinese society is aging, we're experiencing declining birth rates, we have empty nesters and the youngsters from those empty nests, \"said <mark>Zhang</mark> Tianli, co-founder of Hosen Capital, adding pets were helping people find\" spiritual sustenance \". The pet products boom has stoked imports and boosted local business. Among the Chinese companies that are now challenging the global giants, in China at least, are Shanghai Bridge Petcare, Sunsun Group and Navarch. Yantai China Pet Foods 002891. SZ has seen its stock climb close to 60 percent since it listed in Shenzhen in August. Smaller entrepreneurs abound too. They include DogWhere.com, which offers pet holidays and runs a boutique pet hotel in Beijing with all sorts of amenities for the pets - including a swimming pool, pet-sized bedrooms and a cinema. Owners can spend thousands of dollars per stay .\" We once looked after a dog in our hotel for 47 nights, at a total costs of 17,000 yuan ($2,585), \"said the platform's marketing manager <mark>Wang Chao</mark>. Xiao Xudong in Beijing runs a popular grooming service for\" Westies \"- West Highland White Terriers - and says his increasingly youthful clientele fly in from regions as remote as far-western Xinjiang and the southwestern Yunnan province .\" Young people hold a different consumption view to the older generations, \"said Xiao, 45 .\" They think a lot about how their pets are groomed and are willing to splash out on them. \"PET BATHING Despite the growth, Chinese pet ownership is still just getting started. Some pets are mistreated and there is a lack of know-how about vaccinations and sterilization. Strict rules about pet food imports also stoke a gray market trade. Earlier this month, police arrested gang members who were selling poisoned darts used to kill dogs that were then sold to restaurants, the official Xinhua news reported, opening the debate once more about the practice of eating dog meat. Back in Pingyang's state-sanctioned pet town, the owner of one pet shop said the shift towards pet ownership was nonetheless stark .\" Ten years ago this place was basically farmland and people were eating dogs, now they don't eat them as much and have started to see them as pets, \"he said. In the shop, <mark>Wang Jing</mark>, 26, was getting her two dogs - Can Can and Niu Niu - their regular bath. She said she spent around 2,000 yuan a month on them, mostly on food, but that it was all worth it when she arrived home each day .\" Otherwise when you come back there's nobody there, \"she said .\" But if you have a dog then it jumps on you happily as soon as you open the door. \"Reporting by Anita Li in PINGYANG, Hallie Gu in BEIJING and Adam Jourdan in SHANGHAI; Additional reporting by SHANGHAI newsroom, Lusha <mark>Zhang</mark> and <mark>Shu Zhang</mark> in BEIJING; Writing by Adam Jourdan; Edited by Martin Howell 0: 0", "articleID": "2017122400_00161411_W", "names": {"Shu Zhang": ["Q45385081", "Q45603848", "Q58662161", "Q59140667", "Q59549816"], "Wang Chao": ["Q3566047", "Q44952317", "Q45365235", "Q45429277", "Q45445341", "Q45482742", "Q45492396", "Q45510573", "Q45519116", "Q45520872", "Q45546830", "Q45558060", "Q45590542", "Q45593175", "Q45596084", "Q45609163", "Q45615236", "Q45617896", "Q45617958", "Q45618020", "Q45644529", "Q45647133", "Q45680319", "Q58234725", "Q7967378", "Q835832"], "Wang Jing": ["Q19602484", "Q30122604", "Q45359416", "Q45373540", "Q45429838", "Q45429962", "Q45433500", "Q45442900", "Q45443143", "Q45444482", "Q45445040", "Q45445465", "Q45448138", "Q45449611", "Q45461277", "Q45462687", "Q45465055", "Q45465853", "Q45471607", "Q45471925", "Q45474233", "Q45476816", "Q45476880", "Q45476943", "Q45483293", "Q45484784", "Q45488674", "Q45495675", "Q45497293", "Q45498258", "Q45501441", "Q45508092", "Q45508940", "Q45509036", "Q45512327", "Q45513671", "Q45517650", "Q45519168", "Q45524153", "Q45527504", "Q45527758", "Q45533434", "Q45535632", "Q45538425", "Q45539920", "Q45541960", "Q45542322", "Q45542879", "Q45545798", "Q45548812", "Q45552751", "Q45553378", "Q45557208", "Q45558894", "Q45560505", "Q45560688", "Q45562641", "Q45568743", "Q45572623", "Q45572685", "Q45573048", "Q45573960", "Q45575036", "Q45575898", "Q45582090", "Q45582609", "Q45584134", "Q45584388", "Q45589265", "Q45591270", "Q45593471", "Q45594426", "Q45598717", "Q45601711", "Q45603079", "Q45604375", "Q45605129", "Q45608160", "Q45616251", "Q45619266", "Q45621392", "Q45624759", "Q45632449", "Q45634709", "Q45635869", "Q45638924", "Q45640157", "Q45645833", "Q45646828", "Q45647657", "Q45648190", "Q45653570", "Q45654870", "Q45660728", "Q45660787", "Q45660848", "Q45664376", "Q45671654", "Q45677446", "Q45679032", "Q45682963", "Q45696268", "Q45698199", "Q45706724", "Q707336", "Q7967484", "Q7967486"]}}, {"date": "2017-12-24", "url": "http://www.wvgazettemail.com/news/at-ground-zero-for-the-opioid-epidemic-mcdowell-schools-are/article_5ff7aaef-d939-50b2-9a71-e84a020affc6.html", "content": "At ground zero for the opioid epidemic, McDowell schools are helping students overcome the odds By Peggy Barmore For The Hechinger Report 8 min ago Virginia Dickerson proudly shows off her high school diploma. Grandparents and great-grandparents like Dickerson are still raising school-age children long after their own children finished or dropped out of school. PEGGY BARMORE | For The Hechinger Report Grandparents and guardians in the Second Time Around Club paint to help them relax from the demands of raising their young charges. PEGGY BARMORE | For The Hechinger Report A mural in the town of Welch, the McDowell County seat. JACKIE MADER | The Hechinger Report A vacant lot is all there is of a proposed multi-unit apartment complex for teachers and other professionals behind the Marquee Cinemas in Welch as Reconnecting McDowell works to renegotiate funds held up by the <mark>Trump</mark> administration. Peggy Barmore for The Hechinger Report A student receives dental care as part of the Smiles Mobile Dentistry Program at Mount View High School. One of the wraparound services McDowell County Schools makes available for students, the program has provided in-school dental exams and restorative work for more than 1,600 children. JACKIE MADER | The Hechinger Report McDowell Public Schools psychologist <mark>Timothy Hughes</mark> says attendance is a big problem at all grade levels. Peggy Barmore for The Hechinger Report Save Editor's Note This story is part of a reporting project looking at the six-year anniversary of a public-private initiative to revive the schools and economy in McDowell County, West Virginia. It was published in partnership with the Charleston Gazette-Mail. WELCH--Each morning, 74-year-old Virginia Dickerson watches anxiously as two of her great-grandchildren disappear down a dark alley on their way to the school bus. She says a prayer that they'll stay safe and that the youngest one won't get into trouble. But she goes further. She prays that they will \"be saved and be able to support and take care of themselves, and if they get a family, to be able to support the family and not to get on drugs .\" Quote Every day, McDowell County's Virginia Dickerson prays that her great-grandchildren will \"be saved and be able to support and take care of themselves, and if they get a family, to be able to support the family and not to get on drugs .\" Graffiti doesn't mar school property, and schools don't have metal detectors in McDowell, a county at the southernmost tip of West Virginia. There are no gangs here. Students wave and greet visitors in school hallways. A Bible verse, I <mark>Timothy</mark> 4:12, hand-scrawled on a sign posted by the Fellowship of Christian Athletes, welcomes all who enter River View High School: \"Don't let anyone look down on you because you are young, but set an example for the believers in speech, in conduct, in love, in faith and in purity .\" With its popular Hatfield-McCoy Trail snaking through densely treed mountains, trout fishing and have-a-seat-on-my-porch culture, McDowell County could be some sort of utopia if not for the abandoned businesses that outnumber the open ones along its namesake avenue in Welch, the county seat, and its spiraling, two-lane highways so dangerous that churchgoers thank God on Sunday mornings that they made it through the week safely. The county competes with its coalfield neighbors for having the highest unemployment rate in the state. In 2016, it was the county with the highest opioid mortality rate in the nation. But lately, in the place that for more than 50 years has been the poster child for rural poverty in America, change has been taking hold. Schools have been returned to community control. The four-year graduation rate is up 14 percentage points, from 74 in the 2010-11 school year to 88.3 in 2016, which is above the national average. According to school administrators, teen pregnancies have gone from 64.3 per 1,000 births to 52.5--a nearly 20 percent drop. The county established a juvenile drug court. The county's dial-up internet service was replaced with high-speed internet in 2014. Students have laptops and access to computers and new books. The improvements can nearly all be attributed to Reconnecting McDowell, a collaboration among the schools; local, state and federal government agencies; and private entities, including telecommunications, construction and coal-producing businesses, health care providers, teachers unions, and nonprofits. Its partners have put their many political and policy differences aside, pledging to stay as long as needed to help the county \"create a new reality,\" starting with the lives of its children. Yet, despite its successes, six years after more than 100 individuals and organizations signed that pledge, McDowell is at a crossroads. Its schools still struggle, many of its gains are hard to quantify and the partnership is grappling with how to keep positive momentum going in the face of budget cuts and uncertainties under the <mark>Trump</mark> administration. One proposed cut would eliminate the Appalachian Regional Commission, a significant funder of an $8 million teacher housing project in Welch the partnership hoped would provide a concrete symbol of its commitment and the community's progress. Development on the project has stalled, and people are slowly losing sight of the purpose of that vacant lot downtown. Versions of Dickerson's prayer for the safety of the children are repeated throughout McDowell each morning. The opioid crisis in this county of some 19,000-and-dropping residents, located at the intersection of the Bible and the Rust belts, has tested the everyone-looks-out-for-one-another tradition here, compelling grandparents and great-grandparents like Dickerson, who have family members struggling with finances or substance and domestic abuse, to raise school-age children decades after they and their own children finished school or dropped out. (Nearly 47 percent of residents over 25 in McDowell don't have a high school diploma, the highest percent of dropouts in the state .) Already under state control for nearly a decade, the McDowell school system hit bottom in 2009-10. Student performance on state tests ranked it as the lowest-performing school district in West Virginia--which ranked in the bottom quarter of states nationally on math and reading performance assessments. Some county educators and mental health professionals pointed to a \"culture of poverty\" or a \"poverty mindset\" dating back generations as the root of the problems, one that would be hard--maybe impossible--to dig out. Dickerson's family hasn't escaped the effects of the county's hard times: Two of her daughters battled drug addiction, a granddaughter brought her children to Dickerson when she could no longer support them after her marriage ended, one grandson served a year in federal prison for selling drugs and another is incarcerated. Now, while the side effects of generations of poverty remain omnipresent in McDowell, its schools have been emerging as bellwethers of change. Still, although national news outlets have covered McDowell's turnaround efforts, residents haven't necessarily connected the positive steps that have been made so far with the work of the public-private collective, local leaders say. The lack of a visible symbol might be partly to blame. \"[People] can't see anything,\" said Welch Mayor Reba Honaker. \"People need to see what's going on .\" McDowell County Schools Superintendent Nelson Spencer isn't bothered by the initiative's low profile because the community and its stakeholders are Reconnecting McDowell. \"It's an umbrella,\" he said. \"It should be the entire community did it and gets the credit for it ....If it was just an outside entity that came in, they would have been rejected immediately .\" But the lack of local visibility and understanding might be undermining the project's future. More than three-quarters of voters in this historically blue county supported <mark>Donald Trump</mark> last year based on his promise of returning coal jobs and building roads. West Virginia state Sen. Chandler Swope, a Republican who represents the area, said people didn't see the vote as a choice between improving education or improving the economy; they saw voting for the candidate who supported coal as a matter of survival. \"West Virginia would have been doomed if <mark>Trump</mark> had not gotten elected,\" Swope said. In fact, since the election, two coal mines and a processing plant have opened in McDowell. But the new additions have brought only 265 jobs to a place where 69 percent of people are unemployed or not in the labor market. The promised infrastructure improvements haven't materialized yet. Meanwhile, <mark>Trump</mark>'s policy prescriptions spell trouble for Reconnecting McDowell and the progress local schools have made. His budget would do away with funding for 21st Century Community Learning Centers grants and an additional $575,000 in Title II funds, according to the American Federation of Teachers, a lead partner in Reconnecting McDowell. The cuts would effectively eliminate after-school programs at seven of McDowell's 10 public schools and threaten money that could support 13 full-time teaching jobs or professional development for 95 teachers. Seeing beams going up on the teacher housing project, now called Renaissance Village, would give Reconnecting McDowell the visibility it needs, as test scores also haven't risen as fast as many hoped, leaving it without stand-out numbers to trumpet the initiative's value. The county still ranks last in the state on reading and math exams, despite incremental improvements. Even if test scores haven't budged much, McDowell schools have changed dramatically in the decades since Dickerson had to leave in 1961 after becoming pregnant, and the changes are accelerating. Girls are no longer required to leave school and sit out a year after having a baby. The U.S. Supreme Court banned school prayer in 1962. Now breakfast, lunch and, in some cases, dinner are free thanks to expanded federal support. In the last few years, schools have overhauled their curricula and gone beyond teaching to provide services like dental care and mental health counseling. Entire school communities are benefiting from the introduction of mental health services and supports into the schools. \"It's been amazing,\" said Kristy East, principal of Welch Elementary School. \"We have a lot of students with anger issues,\" she said, noting that many students have incarcerated or deceased parents. \"They just don't have those coping skills,\" she said. \"[Teachers] aren't trained to deal with that .\" When Dickerson's 13-year-old great-grandson was \"disrespectful in school,\" Dickerson turned to the district's in-school mental health counseling services for help. In 2015, McDowell was one of three counties in West Virginia to receive federal Project AWARE grants (totaling $9.7 million) to \"bring mental health practices into the school and ensure teachers are equipped to manage the mental health problems of students and their families,\" said McDowell County Schools Project AWARE coordinator Kenneth Birchfield. Now, more than 3 percent of students receive in-school individual mental health therapy or group counseling, according to school officials. Hanging over the initiative, which is targeted at kids who have experienced trauma at home, is the fear that the administration could \"zero out funding at any time .\" Quote More than 3 percent of McDowell County students receive in-school individual mental health therapy or group counseling. Birchfield said that while mental health services previously existed in the region, they weren't offered in schools, and none were located in McDowell County. The agencies also weren't communicating and were replicating one another's efforts. Reconnecting McDowell provides \"an extra layer of communications and collaboration,\" bringing them all together to share information and marshal resources. Birchfield hosted the first joint meeting of the newly constituted Project AWARE leadership team in September. To support grandparents like Dickerson, the district also launched a Second Time Around Club for \"grandfamilies raising grandkids,\" which is supported with federal Title I funding for low-income schools. Nearly half of district children live in a home without a biological parent, according to Reconnecting McDowell. The club, along with the district's family advisory council, brings grandparents and guardians into the schools, giving them an opportunity to de-stress while learning parenting and coping strategies. Birchfield was a featured speaker at the Grandparents Day celebration for the Second Time Around Club in September, when some two dozen attendees learned how to build their young charges' self-esteem by not \"over complimenting them,\" while also taking a painting lesson, being served a hot ham lunch and getting a primer on the meaning of social media acronyms like BTW, L8R and POS. The last one stumped most of them. It stands for \"parent over shoulder,\" Birchfield explained. Children's more mundane-seeming needs are now also being taken care of in the schools. More than half the county's 3,056 schoolchildren received in-school dental checkups and treatment in 2016, school officials said. The district was connected to a mobile dental service through the Reconnecting McDowell partnership. Quote Teen pregnancies in McDowell County have dropped nearly 20 percent, from 64 births per 1000 to 53, and the graduation rate rose 8 percent, but only 21 percent of students are proficient in math. Still, though educators are pleased with the progress they're making to ensure students are physically and emotionally ready to learn, they are frustrated by their inability, so far, to make more academic gains. A switch to the federally supported Common Core State Standards in math and English set the county back. The county's math proficiency rate dropped to 14 percent when new Common Core tests were introduced in 2015. That rate has since increased to 21 percent, but is still below the state average of 34 percent. Quote \"Nowadays we have this math called hard core? Common Core? You have to go around <mark>John Henry</mark>'s barn to say two plus two is four .\" Virginia Dickerson, a great-grandmother in McDowell County Dickerson's 15-year-old great-granddaughter, Vitonni, is in a \"high math class\" at Mount View High School. Dickerson, who still works full time as a deputy clerk in the Magistrate Court building, shakes her head as she talks about how math has changed. \"We had algebra,\" she said. \"Nowadays we have this math called hard core? Common Core? You have to go around <mark>John Henry</mark>'s barn to say two plus two is four,\" she laughed, adding that when her great-granddaughter kiddingly asks her for help, she fires back, \"I can't, because I don't know nothing about no Common Core math .\" Attendance is another persistent problem, said <mark>Timothy Hughes</mark>, the county's school psychologist. Given the problems associated with poverty and substance abuse in the home, \"education isn't a priority as it is in the more affluent areas,\" <mark>Hughes</mark> said. \"Some parents aren't educated beyond high school and don't understand the importance of an education .\" Students are often left to fend for themselves or to care for younger siblings, missing the bus and school. Attendance dropped from 93 percent in 2011-12 to 90 percent in 2016-17. \"If you put an intervention in place and a student isn't there, you can't help them,\" <mark>Hughes</mark> said. He added that he's also had students tell him that they \"just want to grow up and draw a check .\" Quote \"If we help one child, that's well worth it. That is a success and that is a win .\" McDowell County Schools Superintendent Nelson Spencer Asked if he will see a change in this cultural mindset in his career, Spencer said, \"I don't know .\" \"If we help one child, that's well worth it,\" Spencer said. \"That is a success, and that is a win .\" Meanwhile, parents and grandparents like Dickerson continue to encourage their children to get an education and a skill and leave McDowell. Dickerson earned her diploma in 1985, the same year as her daughter, Renetta, and 24 years after she left school to have the first of her seven children. She keeps her diploma handy. \"I carry it everywhere I go ’cause I was proud of it,\" she said. Dickerson doesn't know what the future holds, for herself or her hometown. Of her two great-grandchildren still living with her, Dickerson says that her great-granddaughter \"hasn't said anything about what she wants to do,\" and she thinks her great-grandson wants to design homes. She said she prays for her husband's health and her own, because \"nobody's going to have to look after me .\" This story was produced by The Hechinger Report, a nonprofit, independent news organization focused on inequality and innovation in education. Sign up for our newsletter.", "articleID": "2017122405_00096138_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Henry": ["Q16193633", "Q3181733", "Q58744887", "Q6238703", "Q6238707", "Q6238712"], "Timothy Hughes": ["Q50093791", "Q57486530"]}}]