[{"date": "2017-12-24", "url": "http://www.christianpost.com/news/10-christmas-carols-everyone-should-know-210556/", "content": "Subscribe to the Voices Newsletter Engaging views and analysis from outside contributors on the issues affecting society and faith today. CP VOICES do not necessarily reflect the views of The Christian Post. Opinions expressed are solely those of the author (s). 10 Christmas Carols Everyone Should Know So this Christmas, how can we truly be present and not just buy presents? Sun 24 Dec 2017 10:18 EST Expand | Collapse REUTERS/Kevin Coombs Hustle. Bustle. It's all too easy to look up at the end of December and--poof--like excess glitter in the floor that fell from some cheap ornament, the moment gets vacuumed up or packed away for next year like another decoration. So this Christmas, how can we truly be present and not just buy presents? The answer is surprisingly found in the most fundamental of places--in singing traditional carols together. Redemption drew a baby breath that first chilly Christmas night, offering eternal breath to a forlorn world dying to be rescued. And yet even before Jesus lay snuggled up in the manger, the miraculous story of rescue was already being sung about. Mary sang about Him in the Magnificat (Luke 1:46 -51). Zechariah sang about Him in the Benedictus (Luke 1:68 -79). And of course, on the night of His birth, the skies over Shepherds' Field became a vertical stage for hosts of choiring angels. We have literally been created, compelled and commanded to sing, thus it's no surprise that the oldest Christmas traditions are the masterpieces of the hymns: the carols. Our sixth annual Christmas event--Sing! An Irish Christmas Tour--features ten timeless hymns none of us should ever forget. 1. \"Hark! The Herald Angels Sing\" is one of over 6,000 hymns penned by Charles Wesley, who included it in his 1739 Methodist hymnal. It was later set to music by Felix Mendelssohn, which added dashing majesty to the deeply theological truth of the words. This is among our richest hymns in terms of doctrine, but it got off to a bumpy start. Wesley's first line originally said, \"Hark, How All the Welkin Rings .\" The word \"welkin\" meant \"the vault of heaven .\" Evangelist George Whitefield did us all a favor by changing the words to \"Hark! The Herald Angels Sing .\" We have finished the first half of every Irish Christmas concert with a celebratory arrangement of this song, including an Irish reel and cultural Irish dance, which I suspect would have pleased neither Wesley nor Mendelssohn! 2. \"Come Thou Long Expected Jesus\" is another carol by Charles Wesley, appearing in his book of 18 Christmas songs in 1745. If I had to name my three favorite carols, this would definitely be one of them. In its advent or its Old Testament context, imagine the centuries of waiting, longing and weeping coming to their fruition when people--and indeed all of us today in the chaos and emotion that is Christmas--can find our ultimate supernatural rest in Christ. Israel's strength and consolation, Hope of all the earth thou art; Dear desire of every nation, Joy of every longing heart. I can hardly get through this one without crying. 3. \"O Come, All Ye Faithful\" is a Christmas call to worship, mostly likely written by <mark>John Francis</mark> Wade, a catholic artist who created beautiful manuscripts decorated with exquisite floral images. His hymn, Adeste Fidelis, remained a Latin masterpiece for a hundred years before being translated into English by Rev. Frederick Oakeley. For congregational singing, especially when trying to teach harmony or when singing acapella, this carol sings beautifully, which is why it is has often also been a selection to finish our Christmas concerts. 4. is among our most plaintive carols, partly because of the haunting melody by Gustav Holst. The words came from the pen of the English poet, Christina Rossetti, who was born in London in December, 1830. A gifted writer, she dictated her first story to her mother before she was old enough to read and write. She was also lauded as the most beloved poet of her generation. Her hymn, \"A Christmas Carol,\" appeared in the January issue of Scribner's Monthly in 1872, and was later set to music under the title, \"In the Bleak Midwinter .\" The last stanza has appeared on thousands of Christmas cards: \"What can I give Him, poor as I am? / If I were a Shepherd I would bring Him a lamb; / If I were a Wise Man I would do my part, / Yet what I can I give Him: give my heart .\" We have edited this carol and added Dvorak's New World Symphony melody to link it to Simeon's song, the benedictus, which has proved an effective moment of dedication in our Christmas events. \"In the Bleak Midwinter\" 5. with its triumph cadence and rousing spirit was written by the man who is frequently called the \"Father of the English Hymn,\" Isaac Watts. It was published a 1719 hymnal in which Watts translated, interpreted, and paraphrased the Old Testament book of Psalms, overlaying them with the truths of the Gospel. He called the hymnal, The Psalms of David Imitated in the Language of the New Testament. \"I have rather expressed myself as I may suppose David would have done if he lived in the days of Christianity,\" said Watts. His hymn, \"Joy to the World,\" wasn't originally a Christmas hymn, but history has embedded it into our holiday traditions. \"Joy to the World\" 6. \"O Come, O Come Emmanuel\" is a medieval Latin hymn dating from the 800s. It was one of a series of antiphons that were sung every December, and it isn't hard to imagine the mystic beauty of this hymn echoing off the walls of remote monasteries during the Middle Ages. This particular antiphon was discovered by an English minister and musician named <mark>John Mason</mark> Neale, who rendered it into English and published it in 1851. 7. \"Joy Has Dawned\" is a hymn Stuart Townend and I wrote back in 2004 as part of the Apostles Creed collection we put together following the introduction of In Christ Alone. It takes us through the Christmas story, explaining much of the symbolism, and has been a helpful hymn for both children and adults. Stuart wanted to draw out parts of the Christmas story, such as the gifts of the Magi, that aren't particularly present in other Christmas hymns and demonstrate how those elements are connected to the gospel story and present throughout. Melodically, we wanted to give this carol the same fit and feel you might expect from classic Christmas songs you sang growing up in church so there would be an element of familiarity the first time you sang it. If you are considering using this with your congregation, we often find it helpful to combine this with a familiar hymn such as angels \"We Have Heard On High .\" 8. \"Angels we have heard on High\" is one of the most joyful and well-written choruses ever composed. The lyrical journey, which sweeps from \"Angels we have heard on high sweetly singing o'er the plain\" to the ending lyric, \"Gloria, in excelsis Deo,\" shines a light on the reality of incarnation in a way that refreshes the soul each time you sing it. 9. \"O Little Town of Bethlehem\" was inspired by a visit to Bethlehem by the American preacher, Phillips Brooks. For the 1867 Christmas worship services at Philadelphia's Holy Trinity Church, Brooks wanted to write a carol for his children's choir. Recalling his visit to the birthplace of Jesus, Brooks wrote the words for \"O Little Town of Bethlehem\" and handed them to the church's worship leader, Lewis Redner, who composed the melody. It was first sung by a group of six Sunday School teachers and thirty-six children. 10. \"Once is Royal David's City\" might be the least known of these 10 carols, but we mustn't lose its message or music. Cecil Frances Alexander was a pastor's wife whose poetry was much better known than her husband's sermons. She published this carol in her hymnbook for children in 1848. She's also the author of the children's hymn, \"All Things Bright and Beautiful .\" How interesting it is, then, that many consider her works too deep to sing in adult congregations today. The famous festival of lessons and carols service at King's College in Cambridge opens every year with this carol, where a boy soprano (nominated that day!) opens the service that is televised around the world with verse one as a solo. If ever we needed empirical evidence that the Irish actually did save civilization, this may actually be it. How remarkable that every December the greatest themes of the Gospel are carried by the winds, through the malls, into hotels and restaurants and stores and churches as we hear, play, and most importantly, sing the carols of Christmas! They express our highest Christian worship, sharing joy with the world in the bleak midwinter. They remind us that hope has dawned in the little town of Bethlehem, in Royal David's city, and we should all join the triumph of the skies. O come, let us adore Him--Christ the Lord! Engaging views and analysis from outside contributors on the issues affecting society and faith today. CP VOICES do not necessarily reflect the views of The Christian Post. Opinions expressed are solely those of the author (s).", "articleID": "2017122415_00366473_W", "names": {"John Francis": ["Q22590", "Q51077505", "Q56597700", "Q6233853", "Q6233855", "Q6233857", "Q6233859"], "John Mason": ["Q14945665", "Q1700987", "Q21077155", "Q21597927", "Q25344506", "Q27925051", "Q53953104", "Q6247048", "Q6247051", "Q6247057", "Q6247072", "Q6247074"]}}, {"date": "2017-12-24", "url": "http://msn.com/en-au/news/australia/parts-of-australia-set-to-sizzle-on-christmas-church-leaders-reflect-and-tweet/ar-BBHfDFu?li=AAgfIYZ", "content": "© AAP Image/Anglican Media Sydney The Anglican Archbishop of Sydney, Dr Glenn Davies. As people in some parts of Australia get ready to celebrate Christmas in sizzling heat, the nation's Church leaders have offered messages of hope, love and generosity, with one even condensing his spiritual remarks into a single tweet. People in Queensland are set to flock to the beach for Christmas, with temperatures tipped to soar above 40 degrees Celsius in some areas and severe thunderstorms expected to hit in the afternoon. \"It's looking warm really across the entire of Queensland,\" Bureau of Meteorology forecaster <mark>James Thompson</mark> said, saying Birdsville would likely hit 45C. A top of 34C is expected in Brisbane, compared to 32C on the Sunshine Coast and 31C on the Gold Coast. \"It looks like it'll probably be pretty close to the warmest day for December this year across the south-east,\" Mr <mark>Thompson</mark> said. Severe afternoon thunderstorms are likely south of the Gold Coast and down to the NSW border. On the other side of the country, Perth is expected to enjoy a sunny 32C, while other parts of Western Australia are predicted to have temperatures hovering in the low to mid-40s. Coastal areas in the state's southern half are expected to experience similar weather to Perth, such as Esperance and Bunbury, while Albany is likely to be a cooler 26C. In New South Wales, Christmas Day barbecues are expected to take place under grey skies after a cool change rolled across the state's east following scorching temperatures on Christmas Eve. Sydney's observatory hill reached 37.7 C just after 2:00 pm on Sunday but it was well shy of Penrith's 42.1 C. Penrith came close to breaking a record set just 10 days ago when it reached 43.5 C. A thunderstorm and cool change helped drop temperatures from mid-afternoon and Christmas Day is expected to reach a maximum of 23C in the city and 26C in the west. Cooler weather is also expected for Melbourne, where people will be able to break out the ugly holiday-themed jumpers. The city is predicted to hit a top of 22C, with a chance of drizzle and mild winds before the sun comes out in the afternoon. The cooler forecast is set to be repeated across the south of the state, with Gippsland towns likely to hit 21C in the east and Warrnambool set to hit the same temperature in the west. Religious leaders offer Christmas messages In a twist on the traditional Christmas message, Anglican Archbishop of Sydney Glenn Davies, for the first time, took to Twitter to send out his wish. \"In short--a baby born in a shed saves the world #canyoubelieveit,\" the tweet reads. The Archbishop remarked Twitter had become the preferred communication method for at least one world leader--a thinly veiled reference to US President Donald Trump. \"With a limit of 280 characters--it is difficult to say much, let alone explain anything complex,\" he said in a statement earlier this week. \"Who knows what might happen if the leader of another country takes something the wrong way?\" Australia's leading Catholic issued his Christmas message last week, calling 2017 an \"annus horribilis\" partly due to the same-sex marriage and euthanasia debates which have challenged the Christian conceptions of life and love. Catholic Archbishop of Sydney <mark>Anthony Fisher</mark> said the year's end united people in their need for hope. \"For people of faith you might say it's been an annus horribilis,\" he said. \"But the Christmas story insists there is a star in the dark sky, light amidst the fears and failures. Christmas speaks of new hope .\" In his Christmas message, Dr Philip Freier, the Anglican Primate of Australia and Archbishop of Melbourne, said there was \"widespread mistrust and dissatisfaction\" in Australia and more suffering than there should be. \"Yet, in the worst times and worst of situations, salvation is at hand through God's precious gift of his son, Jesus Christ,\" he said. Moderator of the Uniting Church in NSW and the ACT, Simon Hansford, recounted how embracing his new-born daughter changed him as a person, and urged his followed to similarly embrace the baby Jesus. \"When we engage with the child we are changed,\" he said in a statement. \"One of the highlights of Christmas is that the birth of the baby Jesus is God in all his vulnerability .\" He is here in our hands for holding. I wish you a blessed and peaceful Christmas. \"God creates the world We rebel God sends his Son Jesus into our world to be born in a stable + grow up to die on a cross but that's not the end He defeats death + is raised to life offering every1 freedom from death. In short--a baby born in a shed saves the world #canyoubelieveit--Archbp Glenn Davies (@ abpdavies) December 21, 2017", "articleID": "2017122421_00549652_W", "names": {"Anthony Fisher": ["Q11686326", "Q18637364", "Q573256"], "James Thompson": ["Q16324360", "Q19666426", "Q2031218", "Q21457741", "Q25413093", "Q2740371", "Q3806742", "Q41446776", "Q51587826", "Q54833499", "Q55863509", "Q55937953", "Q58323221", "Q58332042", "Q6133231", "Q6144184", "Q6144186", "Q6144196", "Q780129"]}}, {"date": "2017-12-28", "url": "https://propakistani.pk/2017/12/28/ptcl-wins-fight-land-grabbers-karachi/", "content": "PTCL Wins Fight Against Land Grabbers in Karachi Raja Kamran 14 mins ago Pakistan Telecommunications Company Limited (PTCL) has said that its properties located at Malir Halt in Karachi, just off Shahrah-e-Faisal and near Karachi Airport are under threat from the land grabbers who are using different tactics to deprive the company of its rightful ownership. This was disclosed by PTCL's Director of Human Resources and Legal Affairs, Syed <mark>Mazhar Hussain</mark>, in a media brief at a local hotel Karachi. PTCL's legal and media team were also present at the briefing. Syed <mark>Mazhar Hussain</mark> informed the media that on December 16 2017, a group of civil armed personnel with a contingent of Sindh Anti Encroachment Police and heavy machinery started bulldozing PTCL's duct factory that was owned by PTCL since 1960, located near the airport at Shahrah-e-Faisal. \"A person name Murtaz Khooso gave an application paper to the police, saying that this land was owned by him and PTCL encroached on it. Police and Local Administration came to aid him in grabbing PTCL's property .\" Syed <mark>Mazhar</mark> told media. Syed <mark>Mazhar</mark> said that this was the 2 nd attempt by Murtaz Khooso to grab this land. Earlier In 2013, a similar attempt was made with local administration and police when PTCL, with the help of higher officials, regained the ownership of its land successfully. PTCL filed a case against the land grabbers and took a stay order. \"This time PTCL's management contacted the Chief Secretary and IG police, and showed the stay order and other legal documents to the High Court. On the basis of these documents, the higher management of Sindh Administration backed PTCL in regaining control of the factory .\" Syed <mark>Mazhar</mark> said PTCL is a government owned company and with 62 percent of its shares still owned by the Federal Government. It's ironic how the local administration and state organs assisted the land mafia in their activities. This time land grabbers and police targeted PTCL's abandoned duct factory. This factory currently is not in operation but is used as a storage facility. During the land grabbing operation, PTCL's precious equipment, copper wire and other material worth millions of Rupees was also stolen. \"PTCL is taking every action against the miscreants and has filed a contempt of court case against them. PTCL has also registered a FIR under trespassing property, theft and others charges .\" Syed <mark>Mazhar</mark> added. He also confessed that another property owned by PTCL is threatened by land grabbers, who are engaged in China cutting of the land. P & T colony is one of the examples, however, this is a more complicated matter.", "articleID": "2017122811_00485359_W", "names": {"Mazhar Hussain": ["Q44478908", "Q59490386", "Q6798493", "Q6798495"]}}, {"date": "2017-12-29", "url": "http://www.breakingtravelnews.com/news/article/lata-south-america-poised-for-strong-tourism-growth-in-2018/", "content": "As 2017 draws to a close, LATA members have revealed forward booking statistics for 2018 showing positive growth in travel to Latin America, particularly to Peru, Chile, Argentina, Costa Rica and Colombia. At the same time, the organisation is predicting an increase in demand for less traditional and more off-the-beaten-track destinations, and a surge in luxury bookings. In Argentina, Abercrombie & Kent has seen travellers move away from more traditional tourist destinations towards more undiscovered and wildlife focused areas of the country such as Peninsula Valdes located on the Atlantic coast and the majestic area of the Ibera Wetlands. Jacada Travel has seen a similar trend across Latin America with a sharp rise in holiday bookings to off-the-beaten track destinations such as Nicoya Peninsula in Costa Rica, and Punta Gorda in Belize. At the same time, airlines like Air Europa continue to develop their flight connections in Latin America, bringing lesser-known destinations closer to the UK traveller - such as Recife in Brazil's north-eastern state of Pernambuco. ADVERTISEMENT Both Journey Latin America and Chimu Adventures report strong booking figures for Colombia which over the last two decades has shrugged off its negative image into one of Latin America's brightest stars. With forward booking stats revealing increases of up to 20 per cent (Chimu Adventures), Colombia looks set for strong UK visitor arrivals in 2018. This is in line with recent tourist statistics published by ProColombia which revealed a 5.1 per cent year-on-year increase in UK visitors (between January and October 2017). Although traditionally favoured by the more intrepid client, the growth of luxury infrastructure and services in Latin America has spurred the demand for luxury holidays. Developments such as Awasi Iguazu (scheduled to open in January 2018 in Argentina), Leonardo Di Caprio's \"Blackadore Cay, A Restorative Island\" (to open in 2018 in Belize), and the introduction of new luxury services such as the Belmond Andean Explorer illustrate a strong response to the growing luxury sector - a trend that is set to continue in 2018 and beyond. It is also expected that the launch of Latin America's first budget flight from London Gatwick to Buenos Aires with Norwegian Airlines will open up Latin America to a more diverse market, making the destination more accessible to a wider demographic and stimulating further growth to the region. <mark>Colin Stewart</mark>, chairman of the Latin American Travel Association, said: \"LATA continues to work closely with its members and the UK travel industry to promote sustainable travel to Latin America and to stimulate growth to the region .\" This year was a pivotal year for Latin America with new flight links and the development of new tourism infrastructure opening-up new destinations to visitors and catapulting Latin America to the top of the list of desirable travel destinations. \"We are delighted to see that tourism statistics for 2018 are looking strong and we look forward to continuing our work with the LATA members to help showcase this vibrant and colourful continent .\" Older Civilco joins Banyan Tree Residences project in Dubai Newer Waldhotel Health & Medical Excellence opens in Switzerland", "articleID": "2017122911_00631805_W", "names": {"Colin Stewart": ["Q23020530", "Q43911642", "Q50366019", "Q5145593", "Q5145594"]}}, {"date": "2017-12-29", "url": "http://www.latimes.com/entertainment/arts/culture/la-et-cm-john-wullbrandt-carpinteria-20171229-story.html", "content": "It was close to midnight when the call came from a panicked neighbor. A roaring wildfire was racing down the mountain and the flames would be there soon. It was time to get out. But John Wullbrandt, a prolific artist who'd been painting the landscape around La Granada Mountain since he was a teenager, refused to leave. He'd been preparing for this moment for the last 15 years. The 100-acre former cattle ranch just above Carpinteria in Santa Barbara County has been in Wullbrandt's family for four generations. Fire was always a threat. He and his partner, Jean-Claude Rivalland, had encased the house in corrugated steel, installed three 5,000-gallon water tanks and laid 300 feet of fire hose. Each year, they cleared vegetation around the house and had circled the structure with fire-resistant succulents. Decades of his paintings, including the works he cherished most, were tucked away in two steel shipping containers he believed could withstand a wildfire. They were going to stay, and fight. Shortly after midnight on Dec. 10, as the Thomas fire raced toward them, Wullbrandt took the northeast corner of the house, Rivalland the southwest. They tied their animals--two donkeys, two cows, a mule and a horse--to the side of the house and hosed them down with water. They figured their four dogs and two cats would be safe inside the house, and the tortoise could ride out the fire in the bathtub. Finally, the towering wall of flames reached them. They affixed their mask respirators and battled the onslaught with fire hoses, buckets of water and the animals' drinking troughs. The fire's deafening moan was so loud it sounded like a freight train, and the smoke so thick, they couldn't communicate or see one another. So they fought solo, each feeling he was the last man on Earth, ensconced in scalding heat, flying embers and whirling ash. Hal Wells / Los Angeles Times The 2017 Thomas fire in Ventura and Santa Barbara counties leaves behind vast swaths of charred landscape like this area in Upper Rincon Canyon. The 2017 Thomas fire in Ventura and Santa Barbara counties leaves behind vast swaths of charred landscape like this area in Upper Rincon Canyon. (Hal Wells / Los Angeles Times) When it was over, Wullbrandt had learned what near-death looks like: it is crimson and deep orange, as if rendered in the \"Naphthol Red\" and \"Cadmium Orange\" tubes of paint that he often works with. It is brilliant and murky at once, with flickers of gold, deep-green and blue, like the rolling hills, ripe fruit and sun-dappled beach in Wullbrandt's downtown Carpinteria murals. In the eye of the fire, not unlike when he's painting sometimes, Wullbrandt says he felt an otherworldly calm. \"It was like being in the epicenter of a blowtorch,\" Wullbrandt says. \"It took all of our might. But we were well prepared, we were confident, like when I paint--I had peace of mind. It was actually quite beautiful, haunting .\" An artist comes home With his tanned face, bushy, Santa Claus-like beard and soft, hazel eyes, 66-year-old Wullbrandt looks like a modern-day cowboy, rugged and sensitive. He grew up in Carpinteria, where his late father, Ernest C. Wullbrandt, served multiple terms as mayor. The sleepy beach town was spared from the fire, the largest in California history, but is still dangerously smoky more than a week after the first flames. As Wullbrandt strolls down the ash-speckled sidewalks of Wullbrandt Way--named after his father--he stirs a \"big man on campus\" reaction. Neighbors, friends, local business owners--some wearing dust masks as they run errands--nod as they pass by, often slapping him on the shoulder or stopping for hugs. Driving up the mountain to Wullbrandt's ranch in his old Mitsubishi SUV, the scene along the rocky, dirt road looks like a steam punk moonscape of blackened tree skeletons coated in gray ash. Crisped shipping containers and lone propane tanks litter empty lots where houses once stood, their barbed wire fences now bent and charred. Spindly curls of smoke swirl up from the canyon below, where tree trunk stumps still smolder, their roots still sparking with fire. The air is so thick with smoke, it leaves a bitter, burnt taste with every breath. When the wind picks up, it sends enormous, billowy clouds of gray ash into the car's path, obscuring the bumpy road ahead. Wullbrandt left the area in 1978 for San Francisco, he explains in the car, to forge a career as an artist. He was rejected by the commercial gallery establishment there--\"devastating\" at the time, he says--but he made a living over more than three decades through private commissions and selling artwork to luxury hotels and resorts around the U.S. mainland and Hawaii. His pastoral scenes of local flora and fauna and illustrated cultural histories have adorned hotel suites, lobbies and golf clubhouses. With San Francisco as his home base, Wullbrandt traveled the world for weeks at a time looking for inspiration--India, Nepal, Japan, South Africa--and making paintings. He spent time in 1994 as artist-in-residence for King George of Tonga, he says, creating interior murals for a new villa. Hal Wells / Los Angeles Times Once the Thomas fire had scorched off the needles on the ranch's cactus plants, the cows could enjoy the tasty succulents without pain. Planting cactus, aloe and agave proved fortuitous. Once the Thomas fire had scorched off the needles on the ranch's cactus plants, the cows could enjoy the tasty succulents without pain. Planting cactus, aloe and agave proved fortuitous. (Hal Wells / Los Angeles Times) His many public artworks have included a site-specific mural about the history of the Van Nuys Airport, a city-commissioned architectural trompe l'oeil on a building in San Francisco's Tenderloin district and multiple murals inside the Dole Food Co.'s corporate headquarters in Westlake Village. When San Francisco became too expensive for the artist and his longtime partner, they returned to Carpinteria and in 2002 bought \"El Rancho Botello,\" which his great-great uncle homesteaded in 1913. It was a working cattle ranch until last year. Wullbrandt, a longtime vegetarian, suddenly had to learn how to brand and castrate cows, buck hay and herd cattle. All the while, Wullbrandt painted, working intensely for weeks at a time either in his studio, a stand-alone cabin encased in metal, or outside two adjacent shipping containers situated about 600 feet from the house. Capturing the local landscape and its history is his passion. Nearly all of his neighbors own pieces of his art, he says. In 2013, the late \"Fast & Furious\" actor <mark>Paul Walker</mark> commissioned two pieces. One of his works is in the collection of the Carpinteria Valley Museum of History; others are on loan to local businesses. His most recent mural, chronicling agricultural development in Carpinteria, was unveiled in the town's center earlier this year. Knowing that his personal collection of paintings was safe in his studio--decades of carefully rendered observations--brought him a deep sense of purpose and accomplishment. \"So many of my murals have been destroyed over the years,\" he says, \"I felt it was responsible to hold onto some [art]--that I was in charge of holding onto my own history .\" A flaw in the plan The inferno, which cut through Wullbrandt's property like \"fast-flowing lava,\" torched 100-year-old oaks, ceanothus trees and swaths of coyote bush. It left the outer regions of the ranch burned to a crisp, the now-ashy landscape dotted with sizzled trees, charred antique farm equipment, shattered glass and fried rat and rabbit carcasses. Hal Wells / Los Angeles Times Painter John Wullbrandt and partner Jean-Claude Rivalland's ranch house just above Carpinteria was spared from the flames of the Thomas fire. Painter John Wullbrandt and partner Jean-Claude Rivalland's ranch house just above Carpinteria was spared from the flames of the Thomas fire. (Hal Wells / Los Angeles Times) Wullbrandt admits that some might consider it irresponsible to stay at the ranch and fight the fire, especially considering the sheriff's call, two days earlier, urging them to evacuate. \"But I'm passionate about where I live and I have the freedom to make that choice,\" he says. \"The ranch hadn't burned in over 100 years, so we knew it was coming, it was inevitable. We prepared. We spend 15 years being responsible .\" And the plan worked, at least in part. The house and its immediate surroundings were untouched, save for a 1-inch burn spot on the front porch step and tiny fire lashings on the porch posts. But all his preparations for protecting the art studio were for naught. It was burned into oblivion. Wullbrandt knew the studio and shipping containers had wood floors, but he was certain there was metal beneath them. That was not the case. The fire blew underneath and ignited everything inside, turning decades worth of paintings into ash. The oldest work that Wullbrandt lost was a series of charcoal figurative drawings from when he was in junior high school; his most treasured work lost was a still life painting of an Art Deco vase in which he felt he'd successfully experimented with the rules of composition. Most devastating, Wullbrandt says, is his ravaged archives: 50 years worth of letters, personal photographs and slides, portfolios of drawings and sketches, treasured books, maquettes for murals, pre-internet newspaper and magazine articles about him, along with TV and radio interviews on VHS and cassette tapes and documentation from early public art projects--all turned to dust. Hal Wells / Los Angeles Times Jean-Claude Rivalland, left, and partner John Wullbrandt fought off the approaching flames of the Thomas fire in their 100-acre El Rancho Botello just above Carpinteria. Rivalland hosed down the donkeys with water as flames approached. Jean-Claude Rivalland, left, and partner John Wullbrandt fought off the approaching flames of the Thomas fire in their 100-acre El Rancho Botello just above Carpinteria. Rivalland hosed down the donkeys with water as flames approached. (Hal Wells / Los Angeles Times) The corrugated steel barn, too, was destroyed; it also didn't have a metal floor, as Wullbrandt had thought. He lost three significant large-scale paintings that were housed there, along with family heirloom furniture, century-old tools his family used to build the ranch and his sister's collection of antique saddles. \"It was terrible,\" he says of watching his art studio burn during the fire. \"But I thought:\" We're alive. \"' Sorrow and liberation This is what rejuvenation looks like: It is\" Chromium Oxide Green \"and\" Light Blue Violet, \"like the tubes of paint Wullbrandt will use in the landscape paintings he's planning for an upcoming show. Just a week before the fire, he was voted into the Oak Group, an artists organization that raises money for environmental preservation causes. They'll exhibit his work at the Santa Barbara Public Library's Faulkner Gallery, as part of a group show, in the fall. He'll also have a solo show in 2018 at Carpinteria's Palm Loft Gallery, he says .\" The fire has given me an opportunity to show my work, it's given me something to head towards, \"Wullbrandt says. Losing so much in the fire, he says, has been oddly liberating. For years, Wullbrandt meant to organize his archives. But that would have required classifying his history, and he isn't one who likes to be pigeonholed, he says. He never clung to an artistic identity as a\" muralist \"or\" landscape painter, \"for example; instead, he's toggled between genres, experimenting with figure drawing, magical realism, abstraction, landscapes and set design, among other styles. Losing everything frees him from the daunting task of sorting his sprawling life's work and, for better or worse, from his personal narrative. It presented an opportunity to start anew .\" There's not being burdened with all the trappings of my life, \"he says .\" I thought that one day I would take all of this archival stuff and turn it over to someone; and somehow that would validate my career. But I don't have to do that now. I'm free to paint. \"Wullbrandt may be eerily at peace about the Thomas fire, but standing by the remains of his destroyed barn--now just layers of charred steel--he chokes up thinking about his ancestors .\" The fact that my family's ranch burned on my watch, \"he says, tears pooling in his now bloodshot eyes .\" It's been tough. But I know I did everything I could. My ancestors would be darn proud. \"The sorrow is compounded at the mention of his neighbors .\" My heart goes out to those who have lost far more than I have, \"he says. Still, Wullbrandt remains optimistic. In town, Wullbrandt stops at a small garage that was once his grandfather's plumbing shop and which he now uses for storage. He lifts the metal grate and there, piled up with the cardboard boxes, bikes and old furniture, was a glossy, 10-foot-wide painting of his ranch in better times, vibrant and alive. It depicts cowboys roping and herding cattle across dark green hills, the Carpinteria Valley and city of Santa Barbara stretching out to the sea in the background .\" Gone, all of this gone, \"he says, sweeping his hand across the landscape depicted in the painting. But with loss comes new life .\" It really will be like the Phoenix rising out of the ashes, the rebirth, \"he says .\" It will be so much more beautiful once it starts to rejuvenate. We're gonna see wildflowers we haven't seen in 100 years. \"Then Wullbrandt gazes up at a mountain ridge in the distance, now a thin, ash-gray paint stroke on the horizon .\" The spring--just wait. As an artist, I can't wait to paint it. \"CAPTION Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"CAPTION Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"Justin Chang and Glenn Whipp talk about the top contenders of the awards season, including\" Call Me by Your Name \"and\" The Florida Project. \"CAPTION Justin Chang and Glenn Whipp on what critics awards mean for the Oscars, factoring in the academy's expanding membership. Justin Chang and Glenn Whipp on what critics awards mean for the Oscars, factoring in the academy's expanding membership. CAPTION Two men return home from World War II to work on a farm, where they struggle to deal with racism and adjusting to life after war in\" Mudbound. \"Video by <mark>Jason</mark> H. Neubert Two men return home from World War II to work on a farm, where they struggle to deal with racism and adjusting to life after war in\" Mudbound. \"Video by <mark>Jason</mark> H. Neubert CAPTION It's quite the challenge trying to interview the energetic child stars of\" The Florida Project. \"It's quite the challenge trying to interview the energetic child stars of\" The Florida Project. \"CAPTION Director Dee Rees talks about casting Mary J. Blige, Carey Mulligan and <mark>Jason Mitchell</mark> for her film\" Mudbound. \"After loving <mark>Mitchell</mark>'s performance in\" Straight Outta Compton, \"Rees said,\" I'd be so lucky to get him in my film. \"Director Dee Rees talks about casting Mary J. Blige, Carey Mulligan and <mark>Jason Mitchell</mark> for her film\" Mudbound. \"After loving <mark>Mitchell</mark>'s performance in\" Straight Outta Compton, \"Rees said,\" I'd be so lucky to get him in my film. \"deborah.vankin @ latimes.com Follow me on Twitter: @ debvankin ALSO The Cold War as a museum: At the Wende, one man's 100,000-piece collection finds a new home\" Unsettled' explores the terrain--physical and political--of the West Shepard Fairey: Have we lost the \"street' in street art?", "articleID": "2017122920_00744656_W", "names": {"Jason Mitchell": ["Q20895485", "Q24731481", "Q57047433", "Q6163124"], "Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"]}}, {"date": "2017-12-31", "url": "http://m.nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=11962632", "content": "NZ Herald Brokers Picks 2018: Hot stocks for the new year updated 12 minutes ago 31 Dec, 2017 5:30 pm 7 minutes to read James Smalley says benefits from SkyCity's investment in its Auckland and Adelaide operations will materialise in the years ahead. Photo / 123RF Share on Reddit reddit Brokers have picked a diverse mix of stocks for 2018, in many cases opting for those that have underperformed in the last year or so. It's always worth remembering that winning the Brokers Picks competition requires different strategies to everyday investing. A single year is an arbitrary time frame--often not long enough for value investors but too long for traders. It is interesting to see the way participants opt for different ends of that spectrum in an attempt to capture a market beating annual result. Hamilton Hindin Greene has leaned most heavily towards value investing picking well established stocks that have been out of favour and could present a bargain. Advertisement The two most obvious examples in their selection are Fletcher Building and Comvita--both strong companies that were punished by investors in 2017. \"Fletcher Building aired plenty of dirty laundry in 2017,\" says Hamilton Hindin Greene's James Smalley \"Whilst the risk remains of more coming to light, we believe the risk of major surprises has been limited by the announcements to date, and the recent KPMG Audit .\" When you strip out the downgrades associated with the Building & Interiors business unit, Fletcher Building actually had a reasonable year, Smalley and his team noted. \"We expect continued strong performance from most divisions, and a return to more normal performance from the Building & Interiors business unit .\" Comvita had a tough year, its share price falling 37 per cent at one point before almost recovering back almost to break even by December. \"The decline was the result of investors' concerns of a lower than usual honey harvest, the discovery of myrtle rust in the North Island, and a drop-off in grey channel sales,\" says Smalley. Related articles: Share on Reddit reddit Hamilton Hindin Green also picks both SkyCity and Sky TV. SkyCity's share price has gone sideways for several years as the company continues to invest heavily into the expansion of its Auckland and Adelaide operations. We expect the benefits from this investment will materialise in the years ahead, Smalley notes. SkyCity seems a more curious play given the widespread view that the life span of its satellite transmission business model is limited. Sky TV's share price has been in a steady decline since 2014, and accelerated to the down side in 2017 to touch an all-time lows in December, Smalley notes. \"This is on the back of investor concerns regarding alternative internet based offerings such as Netflix and the ever present threat of Amazon. Despite this, it is worth noting Sky's revenue is still above where it was in 2013 and subscriber numbers above where they were in 2012 .\" That presents a potential short term upside--around the rights context for All Black rugby. \"We feel that given the complexity of the contracts with Sanzaar, and the wider rugby content distribution obligations, Sky is still the likely candidate. Negotiations are expected to begin in April 2018, with a renewal likely to ease investor concerns. The company has relatively low gearing, with total debt representing just over 20 months 2017 free cash flow. This free cash flow should also underpin a dividend that would be in the double digits at current prices .\" Craigs Investment Partners takes a similar approach with established stocks but leans towards those that have performed well in 2017 and could continue their run. Share on Reddit reddit Craigs head of Research Mark Lister notes it would have been nice to have had a2 milk in the mix for 2017 (it returned 274 per cent). While the a2 chart might look a bit shocking to some \"the fact is that a fair chunk of the gains have been driven by fundamental improvements in the business\" , Lister says. In 2014 a2 generated EBITDA of just $3.6 m, and in 2017 this increased to $141m. This is expected to growth even further, with EBITDA of more than $250m expected in the coming year. Forsyth Barr also has a2 in its picks for 2018. Share on Reddit reddit Tourism Holdings is another strong performer which Craigs is picking to continue its run in 2018. It delivered nearly 70 per cent return for 2017. \"The tourism sector remains in very good shape, despite some capacity issues in places like Queenstown,\" says Lister \"THL is also a vastly different company than it was ten years ago, with management having made a lot of progress in reshaping the business and positioning it for growth. More than half the company's revenue comes from outside New Zealand, so it also fits the bill for us in terms of global growth options and some international diversification .\" The only stock to get picked by three brokers this is year is Restaurant Brands--another strong performer through 2017. Craigs, Hobson Wealth and Vulcan Capital all have it in the mix. Share on Reddit reddit \"[Restaurant Brands is] well placed to continue their impressive growth trajectory through global expansion initiatives as well as the continued roll-out of store refreshes, Hobson Wealth Partners notes. Says Lister:\" RBD has approximately 45 per cent of revenues from outside New Zealand, which provides some insulation from a potentially slower economy, the benefit of any NZ dollar weakness, as well as a number of international growth opportunities. \"After that the picks start to get pretty diverse. A number of brokers have picked small cap stocks that have potential for large percentage gains if they capture market attention. MSL Capital Markets sticks with Green Cross Health and Plexure--two companies that dragged down their results in 2017. Share on Reddit reddit Green Cross Health is a diversified healthcare business (owning or supporting 330 Pharmacies under the Life Pharmacy and Unichem Brands, 23,000 Community Nursing clients and 46 Medical Centres).\" It is our preferred exposure to the healthcare sector and ageing population theme, \"says MSL's Andrew McDouall .\" The arrival of offshore competition to the Pharmacy division has seen share price weakness which we believe is an over-reaction and provides a buying opportunity. \"Plexure is a digital advertising company (originally known as V-Mob). It moved into profitability in 2017, notes McDouall, and is selling now on a revenue multiple of less than 1 times .\" Given the quality of their main contract with McDonalds and the worldwide rollout through the McDonalds franchises there should be significant earning uplift in 2018, \"he says. First NZ Capital also picks some outsiders this year including EROAD--a tech company specialising in road transport payment solutions. And Tilt Renewables a solar and wind generation player formed from the de-merger of Trustpower. The ultimate speculative play this year comes from Vulcan's <mark>Brett Wilkinson</mark> who's included a company called QEX logistics--which is expected to list in January. <mark>Wilkinson</mark> notes that the QEX, whose directors include former Federated Farmers chairman Connor English (Bill's brother) and local rich Lister <mark>Danny Chan</mark> has completed capital raising and is ready to roll. However, the NZX notes that (at time of writing) QEX Logistics have not yet released a listing and quotation notice. Disclaimer--It's a game Readers should recognise that the results of the Brokers Picks are skewed by some features of the game. The figures exclude brokers fees. Brokers are asked to choose the securities that will give the best short-term performance. If they had been asked to choose, for example, a five-year term, the results might be different. The survey does not allow brokers to review choices during the year. The survey implies a one-size-fits-all approach. It takes no account of individual circumstances such as an investor's appetite for risk, need for income or tax circumstances. The views expressed do not constitute personalised financial advice and are not directed at any person. Finally, past performance is no guarantee of future performance. We hope it provides a good basis for further research and discussion about investment in the local market.", "articleID": "2017123104_00461991_W", "names": {"Brett Wilkinson": ["Q18378912", "Q2924636"], "Danny Chan": ["Q16068695", "Q42162022", "Q706919", "Q9368727"]}}]