[{"date": "2017-12-31", "url": "https://sg.finance.yahoo.com/news/18-predictions-2018-130400153.html", "content": "2017 turned out to be a pretty banner year for investors and America as a whole. The U.S. stock market indexes all hit dozens of new all-time highs, with the Dow Jones Industrial Average (DJINDICES: ^ DJI) setting a record for the most record closes hit in a single year. It's safe the say the memories of the Great Recession have been put to bed for good. The U.S. economy hummed along, despite the Federal Reserve increasing interest rates on three separate occasions. GDP growth in the third quarter came in at a very healthy 3.2% ahead of the holiday season, and the U.S. unemployment rate of 4.1% as of Nov. 2017 is the lowest it's been since December of 2000. View photos A man in a suit with his hands around a crystal ball. More Image source: Getty Images. 18 predictions for 2018 But as we prepare to dive headfirst into 2018, there are plenty of questions on everyone's mind. Most of these revolve around what we as investors should expect next. While I don't have a crystal ball (I'd be retired by now if I had a functional one), and am not in any way guaranteeing that the following will come true, here are 18 predictions that I suspect have a decent chance of coming true for the upcoming year. 1. Bitcoin will lose at least half of its value, twice Following a blistering run higher, bitcoin's volatility only seems to be growing, not slowing, despite the addition of bitcoin futures trading in December 2017 and the expectation of bitcoin ETFs becoming available in 2018. Since April 2013, bitcoin has plunged by 22% on 20 separate occasions, with three of those instances matching or topping a 50% decline. Given how retail investors (and their emotions) are still in control of bitcoin, wild volatility should be expected. Don't be surprised if bitcoin plunges by 50% or more twice next year. 2. Russia will ban bitcoin Vladimir Putin seems to be all but a lock to win a 2018 presidential election in Russia. But this isn't the biggest story you can expect from Russia in the upcoming year. My belief is that Putin will put his foot down on bitcoin and ban the popular cryptocurrency. In October, Putin was quoted as saying bitcoin creates \"opportunities to launder funds acquired through criminal activities, tax evasion, even terrorism financing, as well as the spread of fraud schemes .\" Russia's central bank concurred, too. The list of countries where bitcoin is banned should grow in 2018. View photos A physical gold bitcoin on a table. More Story Continues Image source: Getty Images. 3. Bitcoin will (briefly) lose its spot at the head of the cryptocurrency table Until recently, bitcoin made up between 60% and 80% of the aggregate market cap of all cryptocurrencies combined. But the fourth quarter saw other virtual coins rally in a big way and handily outperform bitcoin. It's my suspicion that while bitcoin will begin and end the year as the world's largest cryptocurrency by market cap, it'll lose that title, at least briefly, in 2018. To what cryptocurrency, you ask? My guess would be either Ripple, which has been snagging blockchain partnerships with big financial institutions, or Ethereum, which has 200 organizations around the world testing a version of its blockchain. 4. Sears Holdings won't make it through the year without a bankruptcy filing Troubled retailer Sears Holdings (NASDAQ: SHLD) has reached into its bag of tricks one too many times and has prevented the inevitable---- bankruptcy--for far too long. It's taken loans from its CEO, Eddie Lampert, sold off its well-known Craftsman brand to Stanley Black & Decker, and closed countless Sears and Kmart locations. It's just not working, with organic sales continuing to decline at a rapid pace. 2018 will be the year that Sears seeks the safety of bankruptcy protection. 5. Apple will fail to reach the $1 trillion mark Apple (NASDAQ: AAPL) recently became the first publicly traded company ever to cross the $900 billion market cap mark. But I don't believe it'll be the first to hit $1 trillion, despite being so close. Much of the hoopla surrounding the iPhone 8 and X has already been priced into Apple's stock, which has proven to be historically cyclical based on its development cycle. This doesn't mean we'll necessarily witness a rush to the exit, but Apple will be far from a growth story, in my view, in 2018. View photos A stock chart plunging into the red. More Image source: Getty Images. 6. The U.S. stock market will experience its first correction in over two years Can you believe it's essentially been two years since the stock market moved lower by at least 10%? My suspicion is that'll change in 2018. Since 1950, the S & P 500 (SNPINDEX: ^ GSPC) has had 35 corrections that, when rounded to the nearest whole number, were 10% or greater, according to Yardeni Research. Though the stock market doesn't care about probability, history says we're due. 7. The U.S. stock markets' annual winning streak will come to a modest end The stock market has been on a relative tear now for nine consecutive years. This writer doesn't believe it'll extend to a 10th year. Long-term buy-and-hold mogul Warren Buffett often suggests that investors \"be fearful when others are greedy, and greedy when others are fearful .\" Right now, things look a little too perfect, and there's very little pessimism to be found on Wall Street. That looks to be the perfect recipe for a disappointing year for the broader market, if Buffett's analysis is correct. 8. Utilities will outperform the S & P 500 On the other hand, a flat to modestly down year in stocks often means investors returning to the safety of basic-needs industries. After eating dust for years, my belief is that 2018 will represent a strong year for utility stocks. Their steady cash flow, higher-than-average dividend yields, and share-price stability could be exactly what investors flock to if the stock market or cryptocurrencies undergo a major correction. View photos A chart of rising interest rates, with U.S. dollars being used as the rising line. More Image source: Getty Images. 9. The Fed will hike rates three times, despite minimal inflation The big debate is whether the Federal Reserve will increase its federal funds target rate, which influences interest rates, two or three times in 2018. My guess would be three hikes, albeit I still don't see inflation picking up much despite strong Q3 GDP growth figures and the recently passed GOP tax reforms. The Fed is going to continue walking on eggshells and pussyfooting its way to higher interest rates, one quarter-point rate hike at a time. 10. Gold prices will buck higher interest rates and end the year higher Higher interest rates are usually bad news for gold investors since the lustrous yellow metal has no yield. However, it should buck the trend in 2018. Corrections in the cryptocurrency market should send some investors back to gold, while continued pressure on the U.S. dollar tends to be a positive for the gold market. Let's also not forget that gold producers haven't exactly ramped up exploration spending as they did in the early part of the decade. With demand likely to continue outpacing production growth, the fundamentals are in place for a strong year in gold and gold stocks. 11. The GOP will lose control of the Senate, but maintain control of the House Politics is about as easy to predict as the next number on a roulette wheel. Then again, it's not hard to ignore the disapproval ratings with the GOP's handling of healthcare reform and tax reform from the American public. With just a one-seat majority in the Senate and midterm elections looming in November 2018, it's looking more likely than not that the GOP-controlled Congress will soon become a split Congress. View photos A doctor shrugging his shoulders and hands. More Image source: Getty Images. 12. Healthcare reform will again fail to pass muster in Congress Given the prediction that the GOP will lose seats in the Senate, the chances of healthcare reform passing in the upcoming year is very slim. Republicans couldn't repeal Obamacare and implement a new healthcare plan when they had a two-seat advantage, so it seems even less likely it'll happen with a one-seat advantage for only a portion of the year. Plus, with an infrastructure plan on the horizon, healthcare reform could again take a backseat. In short, Obamacare, or at least its shell now that the individual mandate has been repealed, will live on. 13. At least three new states will legalize recreational marijuana Since 1996, 29 states have legalized medical cannabis, with residents in eight states OK \"ing the legalization of recreational pot sales. In 2018, I'd look for at least three, and up to six, states to legalize recreational marijuana. Arizona and Michigan are likely to see voters approve an adult-use weed measure, while New Jersey's Gov.-elect <mark>Phil Murphy</mark> (D-NJ) has already stated that he'd sign a recreational pot bill put on his desk. 14. Canadian marijuana stocks will double...again Sure, cryptocurrencies are all the rage, but among traditional equities, marijuana stocks have been on fire! In particular, Canadian pot stocks can't be stopped of late, primarily based on the expectation that Canada will become the first developed country in the world to legalize adult-use weed by July 2018. With medical cannabis sales steadily increasing and pushing some growers into the black and adult-use demand capable of adding $3.7 billion to $5 billion in annual sales, Canadian marijuana stocks have a real shot to skyrocket even further in 2018. View photos A man wearing Britain's flag colors for a shirt, with parliament in the background. More Image source: Getty Images. 15. Brexit goes nowhere Looking overseas for a moment, I'd venture a guess that virtually nothing gets resolved in Britain's attempt to break away from the European Union. Though the clock is ticking and the March 2019 date is approaching, the U.K.'s <mark>Theresa May</mark> and European leaders are nowhere near reaching a consensus on how much Britain should pay to leave the EU, or what the nature of future trade deals with the U.K. will look like. This lack of progress could set the U.K. up for a disappointing year. 16. Oil will touch $75 per barrel for the first time since 2014 Following a number of really bad years for oil drillers, 2018 is really looking up. West Texas Intermediate recently hit $60 per barrel for the first time since mid-2015, and my suspicion is it'll move as high as $75 per barrel in 2018. Both OPEC and non-OPEC countries have thus far stuck with production cuts, resulting in less oversupply and a higher crude price. Furthermore, the chance of conflict in the Middle East appears to be rising. Any disruption in Middle East oil production would be viewed as a positive for oil prices. 17. The federal minimum wage will increase for the first time since 2009 It's been nine years since the federal minimum wage has been increased by Congress. I believe that'll change in 2018, and $7.25 an hour will be a thing of the past. To begin with, not adjusting the minimum wage higher in nine years has allowed minimum wage workers to be crushed by the impacts of inflation. With the U.S. economy clicking and unemployment exceptionally low, there are ample reasons to support an increased federal minimum wage. Additionally, if Democrats gain hold of one or both houses of Congress, I suspect they'll make a federal minimum wage increase a priority. View photos A person holding a Social Security card in their hand. More Image source: Getty Images. 18. Social Security's COLA comes in below 2% for 2019 Last, but not least, I'd expect Social Security's cost-of-living adjustment, or COLA, to disappoint once again. The only reason beneficiaries received a 2% raise in 2018--the highest raise in six years--was a result of gasoline-price inflation tied to hurricanes Harvey and Irma. While representing a nice upward tick in benefits, it's also going to create some tough year-over-year comparisons for Social Security's inflationary tether, the Consumer Price Index for Urban Wage Earners and Clerical Workers. Unless the U.S. is hit by another devastating hurricane in the third quarter of 2018 or inflation dramatically picks up, COLA is likely to come in below 2% for 2019. More From The Motley Fool 3 Growth Stocks at Deep-Value Prices 5 Expected Social Security Changes in 2018 6 Years Later, 6 Charts That Show How Far Apple, Inc.. Has Come Since Steve Jobs' Passing 10 Best Stocks to Buy Today The $16,122 Social Security Bonus You Cannot Afford to Miss Bitcoin's Biggest Competitor Isn't Ethereum--It's This <mark>Sean Williams</mark> has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Apple. The Motley Fool has the following options: long January 2020 $150 calls on Apple and short January 2020 $155 calls on Apple. The Motley Fool has a disclosure policy.", "articleID": "2017123114_00123081_W", "names": {"Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"], "Sean Williams": ["Q3531227", "Q41674016", "Q552911", "Q6379568", "Q7441537", "Q973049"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2017-12-31", "url": "http://pittsburgh.cbslocal.com/2017/12/31/browns-steelers-game-frigid-temperatures/", "content": "Follow KDKA-TV: Facebook | Twitter PITTSBURGH (KDKA)--Emergency crews treated three people for weather-related problems as football fans braved the cold to attend Sunday's game at Heinz Field. Pittsburgh Steelers fans were determined not to let the cold weather put a damper on Game Day. \"I live out of town now for work, so I take every chance I get to go to a Steeler game,\" one fan said. \"I'm a little cold, but not too cold .\" Temperatures were in the teens with a near-zero wind chill factor. \"It's pretty chilly, but it's kinda nice. We like it,\" Sequoia Bauerle, of Anaheim, Calif., said. \"It's a big change. Big change. We're about an 80 degree difference right now, so big change,\" Sierra Roumimper, of Anaheim, Calif., said. Tailgaters came prepared. \"I think I have four shirts, two pairs of pants, hunting socks...It's not my first time,\" one fan said. \"It's three layers. Normal routine that we go through every cold game at home,\" another fan said. A group of tailgaters kept warm by a fire. One man didn't even wear boots, opting for flip-flops and shorts instead. \"You ask anybody that sits in my section, I never wear shoes,\" Steeler fan <mark>Dennis Morris</mark> said. Overall 21 people were checked out by EMTs for non-weather-related problems. Ten people were taken to the hospital.", "articleID": "2018010103_00546051_W", "names": {"Dennis Morris": ["Q5258762", "Q5258763"]}}, {"date": "2018-01-01", "url": "http://www.wsmv.com/story/37169137/kim-jong-un-offers-rare-olive-branch-to-south-korea", "content": "<mark>Kim Jong Un</mark> offers rare olive branch to South Korea - WSMV News 4 <mark>Kim Jong Un</mark> offers rare olive branch to South Korea - WSMV News 4 Member Center: <mark>Kim Jong Un</mark> offers rare olive branch to South Korea Posted: lee.morehouse @ meredith.com By Alanne Orjoux and <mark>Steve George</mark>, CNN (CNN)--North Korean leader <mark>Kim Jong Un</mark> has held out a rare olive branch to the country's southern neighbor, offering talks over sending a delegation to the Winter Olympics in Pyeongchang next month. <mark>Kim</mark> struck an unusually conciliatory note in his annual New Year's Day address, declaring his wish \"for peaceful resolution with our southern border .\" He nevertheless couched the message in more familiar bellicose language, warning the United States that North Korea's nuclear ambitions were now complete and the launch button was \"always on the desk in my office .\" <mark>Kim</mark>'s comments on South Korea surprised analysts, who described them as the most significant part of his speech. Tensions with the South have been high as <mark>Kim</mark> has presided over a dramatic increase in the pace of North Korea's weapons program. In September, the regime carried out its sixth and most powerful nuclear test. Call for peace In his address, <mark>Kim</mark> called for peace on the Korean peninsula. \"North and South must work together to alleviate the tensions and work together as a people of the same heritage to find peace and stability,\" <mark>Kim</mark> said, according to a CNN translation of his speech. He added that North Korean representatives should start talks with their South Korean counterparts \"as soon as possible\" to discuss sending a delegation to the 2018 Winter Games. <mark>Kim</mark> went on to wish South Korea success in hosting the upcoming Olympics and said the event would be a \"good chance\" to show the greatness of the Korean people. But <mark>Kim</mark> ratcheted up his warnings to the US. \"The entire mainland of the US is within the range of our nuclear weapons and the nuclear button is always on the desk of my office. They should accurately be aware that this is not a threat but a reality,\" <mark>Kim</mark> said. \"No matter how much America wants to attack us with their military might and nuclear power, they know that now we possess such great nuclear power and therefore they will not dare,\" he continued, adding that his country's greatest achievement of 2017 was the \"historic accomplishment of completing our nuclear capabilities .\" Softened tone Euan Graham, director of the International Security Program at the Lowy Institute, told CNN the softened tone toward South Korea was a surprise. \"The olive branch of trying to reach out to the South, that's the most significant change, because up until now, they just haven't shown any interest in engaging with the South, or anyone else for that matter,\" he said. \"But an olive branch is always wrapped in some sort of belligerent coating in North Korea, it doesn't mean the end of the nuclear program...Even if they do reach out and send a delegation to the Pyeongchang Winter Olympics, it wouldn't surprise me at all if they accompanied that with a continuing testing program as the spring comes, be that a submarine launch or satellite launch .\" Tension has been rising between the United States and North Korea in recent months. Adm. Mike Mullen, a former chairman of the Joint Chiefs of Staff, said Sunday that the United States is \"closer to a nuclear war with North Korea\" than ever. In an interview on ABC's \"This Week,\" Mullen warned that President Donald Trump's provocative rhetoric aimed at <mark>Kim Jong Un</mark> likely indicates he would prefer to take a more aggressive approach to countering the rogue regime's rapidly evolving nuclear weapons program. Last week, the <mark>UN</mark> Security Council unanimously adopted new sanctions on North Korea in response to Pyongyang's November 29 ballistic missile test, seeking to further strangle its energy supplies and tighten restrictions on smuggling and the use of North Korean workers overseas. North Korea's state-run news agency KCNA released a report Saturday promising that the country would remain committed to its nuclear development in 2018. \"Do not expect any change in its policy,\" the report read. \"Its entity as an invincible power can neither be undermined nor be stamped out. The DPRK, as a responsible nuclear weapons state, will lead the trend of history to the only road of independence and justice, weathering all tempests on this planet,\" the report continued, referring to North Korea's official name, the Democratic People's Republic of Korea. Joint military exercises In early December, the US carried out another round of military exercises with South Korea, involving the largest concentration of fifth-generation F-22s and F-35s fighter jets ever assembled in South Korea. The war games included attacks against a mock North Korean missile launch site with mock North Korean radars. In his New Year's address, <mark>Kim</mark> again denounced the exercises. \"These military exercises that you have with our enemy the USA must be halted at this very moment, because this behavior only causes fire and destruction on this great country,\" the North Korean leader said, apparently addressing South Korea. Tong Zhao, a fellow at the Carnegie-Tsinghua Center in Beijing told CNN that <mark>Kim</mark> does \"not want to appear threatening and provocative .\" \"He wants to convince the international community that his nuclear weapons are purely for self-defense and wants to have a negotiated solution with the United States on the basis that he gets to keep its nuclear deterrent capability, Zhao said .\" After achieving a preliminary strategic deterrent capability, North Korea might want to deescalate tensions and see (s) the Winter Olympics as a golden opportunity. The games make it possible for Washington and Seoul to meet Pyongyang's demand for self-restraint--adjusting their military exercises--without losing face and appearing weak on Pyongyang. \"The-CNN-Wire ™ & © 2018 Cable News Network, Inc., a Time Warner Company. All rights reserved. Popular Stories Monday, January 1 2018 7:46 AM EST 2018-01-01 12:46:32 GMT Lebanon Knights Hookah Bar (WSMV) Around 1:40 a.m., metro police responded to multiple calls for a shooting at the Lebanon Knights Hookah Bar on Charlotte Pike in West Nashville. When officers arrived to the scene, guests were hiding in the back of the bar. Monday, January 1 2018 7:46 AM EST 2018-01-01 12:46:14 GMT The wreck happened at the intersection of Harding Place and Nolensville Pike. (WSMV) Metro police are investigating a possible hit-and-run crash that sent one man to the hospital. Monday, January 1 2018 6:52 AM EST 2018-01-01 11:52:50 GMT People started showing up at Bicentennial Mall at 4 p.m. on New Year's Eve. (WSMV) By the time the clock struck midnight, the temperature was only around 14 degrees, but the frigid cold did not put a freeze on the celebrations. Updated: Monday, January 1 2018 12:09 AM EST 2018-01-01 05:09:21 GMT According to authorities, the car was traveling northbound in a white Chevrolet Malibu around 6 a.m. when a passing car opened fire. Monday, January 1 2018 12:06 AM EST 2018-01-01 05:06:29 GMT (Source: Mt. Juliet Police Department) It started around 5 p.m. in the 1400 block of Westwood Boulevard. Sunday, December 31 2017 9:28 PM EST 2018-01-01 02:28:43 GMT The shooting happened at Falcon View Apartments on East Palestine Avenue in Madison. (WSMV) The shooting happened at Falcon View Apartments on East Palestine Avenue in Madison.", "articleID": "2018010114_00770634_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"], "Steve George": ["Q16186681", "Q20487038", "Q7612640"]}}, {"date": "2018-01-01", "url": "http://www.huffingtonpost.in/2018/01/01/un-secretary-general-puts-world-on-red-alert-in-somber-new-years-eve-address_a_23321153/", "content": "Reuters U.N. Secretary-General Antonio Guterres speaking during the 9th ASEAN <mark>UN</mark> Summit in Manila, Philippines, in November 2017. United Nations Secretary-General António Guterres issued a grim warning as 2017 drew to a close. In a somber video address posted to Twitter on New Year's Eve, he cautioned that the globe was on \"red alert\" following a year marked by deepening conflicts and \"new dangers .\" \"When I took office a year ago, I appealed for 2017 to be a year for peace,\" Guterres said in the clip. \"Unfortunately, in fundamental ways, the world has gone in reverse ....Global anxieties over nuclear weapons are the highest since the Cold War, and climate change is moving faster than we are. Inequalities are growing, and we see horrific violations of human rights. Nationalism and xenophobia are on the rise .\" Facing such challenges, Guterres said he was \"not issuing an appeal\" but a \"red alert for our world .\" Only international unity and cooperation, he stressed, could now help solve these many crises. As we begin 2018, I am issuing a red alert for our world. I call for unity--our future depends on it. pic.twitter.com/fWtTa1irM3--António Guterres (@ antonioguterres) December 31, 2017 \"I truly believe we can make our world more safe and secure. We can settle conflicts, overcome hatred and defend shared values but we can only do that together,\" the U.N. chief said. \"I urge leaders everywhere to make this New Year's resolution: Narrow the gaps. Bridge the divides. Rebuild trust by bringing people together around common goals. Unity is the path. Our future depends on it .\" Hours after Guterres' message, North Korean leader <mark>Kim Jong Un</mark> issued a New Year's Day speech, in which he spoke of a \"nuclear button\" on his desk, ready for use if the hermit kingdom is threatened. \"The entire United States is within range of our nuclear weapons, and a nuclear button is always on my desk. This is reality, not a threat,\" he said, adding that he was \"open to dialogue\" with South Korea and emphasizing that \"these weapons will be used only if our security is threatened .\" Adm. Mike Mullen, former chairman of the Joint Chiefs of Staff, said Sunday that the U.S. is \"closer to a nuclear war with North Korea\" than ever before. MORE: António Guterres International News Politics <mark>un</mark> secretary general united states Wars and Conflicts Suggest a correction", "articleID": "2018010203_00413415_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2018-01-04", "url": "http://www.fashion.ie/fabletics-demi-lovato-new-collaboration/", "content": "0 comments Fabletics and Demi Lovato team up for new collaboration. American singer, Demi Lovato has designed her third capsule collection for Fabletics. The \"Confident' beauty has teamed up with <mark>Kate Hudson</mark>'s label for the third time, and her latest range includes footwear and two athletic bags for the first time. Demi said:\" I was so excited when Fabletics asked me to come back to design another capsule collection with them! \"I've learned so much from working with the Fabletics design team the past year and really wanted to take it to the next level with this collection now that I'm more confident with the process .\" And the 25-year-old star thinks the collection--which features tops, shorts, sports bras and other layering pieces with bold straps, metallic and textured mesh details--is closer to her own style than ever before and reflects the needs and wants of her fans. She added: \"I think that this collection reflects my personal style more than ever .\" It was also very important to me to incorporate all of the feedback I've received from my supportive fans. I made sure to include different elements and details into the collection that were not only important to me but to them as well. \"And Fabletics executives are delighted with the results of Demi's latest foray into design. Felix del Toro, Senior Vice President, chief merchandise and design officer for the company, said in a statement:\" Demi's leveraging her creative abilities, and has become more confident as a designer. \"In approaching this collection she channeled what she and her fans are looking for in activewear pieces which support her life as a confident woman .\" Fashion. ie is a 100% owned Irish fashion website that offers the latest Celebrity News and Fashion News to our users. Fashion. ie also gives our users the opportunity to purchase selected, high quality goods directly from our wide range of fashion affiliates. An important note to remember is that Fashion. ie is an affiliate sales website that offers users, links to accredited fashion websites on the Internet. Fashion. ie takes no responsibility or liability for any transaction between user and each fashion vendor. It is the sole responsibility of each user to ensure they are completely happy to interact and trade with each on-line fashion vendor. Fashion. ie would also advise all users to check for the correct sizes of items as well as delivery and returns policy of each vendor prior to purchasing items from them. Don't forget to follows us on social media. If you enjoy shopping for Ladies fashion, Men's fashion, or Teenage fashion then look around our site and enjoy!. Fashion. ie features Fashion news, Irish fashion news, entertainment news, Celebrity news, Online shopping and Irish fashion. Fabletics and Demi Lovato team up for new collaboration.", "articleID": "2018010409_00071074_W", "names": {"Kate Hudson": ["Q169946", "Q6375550"]}}, {"date": "2018-01-05", "url": "http://commondreams.org/news/2018/01/05/trolling-trump-journalism-watchdog-hold-global-press-oppressor-awards-monday-500", "content": "Published on Friday, January 05, 2018 by Common Dreams Trolling <mark>Trump</mark>, Journalism Watchdog to Hold \"Global Press Oppressor Awards on Monday at 5:00'\" Subjects will cover Thinnest Skinned & Outrageous Use of Laws, in various categories for world leaders. \"by Julia Conley, staff writer 0 Comments The Committee to Protect Journalists calls attention to threats to free speech around the world, including President <mark>Donald Trump</mark>'s anti-press rhetoric. (Photo: Chris McGrath/Getty Images) In response to President <mark>Donald Trump</mark>'s announcement this week that he plans to hold an awards ceremony for dishonest media outlets, the Committee to Protect Journalists (CPJ) said Friday it was organizing its own event to honor anti-press world leaders. CPJ will be announcing THE GLOBAL PRESS OPPRESSORS AWARDS on Monday at 5:00 pm. Subjects will cover Thinnest Skinned & Outrageous Use of Laws, in various categories for world leaders. Stay tuned! #TheFakies #PressFreedom #PressOppressors https: //t.co/0r93ceV3HJ--CPJ (@ pressfreedom) January 5, 2018 CPJ documents threats to press freedom including cases of journalists being killed, injured and imprisoned while reporting as well as attacks on the media by <mark>Trump</mark> and other politicians. The group's announcement mirrored <mark>Trump</mark>'s earlier tweet saying that he would be holding\" THE MOST DISHONEST & CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o'clock. \"(sic)\" Subjects will cover Dishonesty & Bad Reporting in various categories from the Fake News Media, \"the president added. In December, capping off a year during which he regularly attacked the press for its coverage of his administration and policies, <mark>Trump</mark> sent an email to his supporters asking them to help him decide which media outlet should win the award for\" fakest news. \"A Rasmussen poll taken after the president first promoted his idea for an awards ceremony, in a November tweet, found that 40 percent of respondents believed Fox News, which has covered the <mark>Trump</mark> administration far more favorably than other cable networks, should win <mark>Trump</mark>'s\" Fakest News Trophy. \"CPJ's planned awards will follow their annual Press Freedom Awards, held in November. The group honored a journalist who has been jailed since 2015 for his reporting in Cameroon, and reporters who have been under threat for their coverage of human rights and politics in Mexico, Thailand, and Yemen. The group has also been sharply critical of <mark>Trump</mark>'s treatment of the press, partnering with several other organizations to run the U.S. Press Freedom Tracker, which catalogues threats to journalists including the president's anti-media rhetoric and actions. Most recently the tracker documented <mark>Trump</mark>'s attempt to stop the publication of <mark>Michael Wolff</mark>'s book about his first year in office, and the president's statement that an ABC News reporter\" should be immediately fired \"for incorrectly reporting on the timing of <mark>Trump</mark>'s conversations with former National Security Advisor <mark>Michael Flynn</mark> regarding Russia--a mistake that ABC quickly corrected .\" The United States has some of the strongest legal free speech protections in the world, and serves as a beacon for press freedom in a world where journalists are routinely censored, attacked, or imprisoned for their work, \"notes the U.S. Press Freedom Tracker's website .\" But the U.S. record is imperfect, and journalists and advocates must tirelessly defend the First Amendment in courts, in legislatures, and in the media. Constant vigilance and an honest accounting of the country's track record on press freedom are essential. \"This work is licensed under a Creative Commons Attribution-Share Alike 3.0 License Share This Article More in: U.S., Media, <mark>Donald Trump</mark>, Committee to Protect Journalists, Journalism, #NotNormal Top Comments (Click to see more comments or to join the conversation)", "articleID": "2018010522_00587986_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"]}}]