[{"date": "2018-01-05", "url": "http://commondreams.org/news/2018/01/05/trolling-trump-journalism-watchdog-hold-global-press-oppressor-awards-monday-500", "content": "Published on Friday, January 05, 2018 by Common Dreams Trolling <mark>Trump</mark>, Journalism Watchdog to Hold \"Global Press Oppressor Awards on Monday at 5:00'\" Subjects will cover Thinnest Skinned & Outrageous Use of Laws, in various categories for world leaders. \"by Julia Conley, staff writer 0 Comments The Committee to Protect Journalists calls attention to threats to free speech around the world, including President <mark>Donald Trump</mark>'s anti-press rhetoric. (Photo: Chris McGrath/Getty Images) In response to President <mark>Donald Trump</mark>'s announcement this week that he plans to hold an awards ceremony for dishonest media outlets, the Committee to Protect Journalists (CPJ) said Friday it was organizing its own event to honor anti-press world leaders. CPJ will be announcing THE GLOBAL PRESS OPPRESSORS AWARDS on Monday at 5:00 pm. Subjects will cover Thinnest Skinned & Outrageous Use of Laws, in various categories for world leaders. Stay tuned! #TheFakies #PressFreedom #PressOppressors https: //t.co/0r93ceV3HJ--CPJ (@ pressfreedom) January 5, 2018 CPJ documents threats to press freedom including cases of journalists being killed, injured and imprisoned while reporting as well as attacks on the media by <mark>Trump</mark> and other politicians. The group's announcement mirrored <mark>Trump</mark>'s earlier tweet saying that he would be holding\" THE MOST DISHONEST & CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o'clock. \"(sic)\" Subjects will cover Dishonesty & Bad Reporting in various categories from the Fake News Media, \"the president added. In December, capping off a year during which he regularly attacked the press for its coverage of his administration and policies, <mark>Trump</mark> sent an email to his supporters asking them to help him decide which media outlet should win the award for\" fakest news. \"A Rasmussen poll taken after the president first promoted his idea for an awards ceremony, in a November tweet, found that 40 percent of respondents believed Fox News, which has covered the <mark>Trump</mark> administration far more favorably than other cable networks, should win <mark>Trump</mark>'s\" Fakest News Trophy. \"CPJ's planned awards will follow their annual Press Freedom Awards, held in November. The group honored a journalist who has been jailed since 2015 for his reporting in Cameroon, and reporters who have been under threat for their coverage of human rights and politics in Mexico, Thailand, and Yemen. The group has also been sharply critical of <mark>Trump</mark>'s treatment of the press, partnering with several other organizations to run the U.S. Press Freedom Tracker, which catalogues threats to journalists including the president's anti-media rhetoric and actions. Most recently the tracker documented <mark>Trump</mark>'s attempt to stop the publication of <mark>Michael Wolff</mark>'s book about his first year in office, and the president's statement that an ABC News reporter\" should be immediately fired \"for incorrectly reporting on the timing of <mark>Trump</mark>'s conversations with former National Security Advisor <mark>Michael Flynn</mark> regarding Russia--a mistake that ABC quickly corrected .\" The United States has some of the strongest legal free speech protections in the world, and serves as a beacon for press freedom in a world where journalists are routinely censored, attacked, or imprisoned for their work, \"notes the U.S. Press Freedom Tracker's website .\" But the U.S. record is imperfect, and journalists and advocates must tirelessly defend the First Amendment in courts, in legislatures, and in the media. Constant vigilance and an honest accounting of the country's track record on press freedom are essential. \"This work is licensed under a Creative Commons Attribution-Share Alike 3.0 License Share This Article More in: U.S., Media, <mark>Donald Trump</mark>, Committee to Protect Journalists, Journalism, #NotNormal Top Comments (Click to see more comments or to join the conversation)", "articleID": "2018010522_00587986_W", "names": {"Michael Wolff": ["Q1630670", "Q1929891", "Q20054125", "Q439955", "Q6835424", "Q6835425"]}}, {"date": "2018-01-08", "url": "http://www.insidermedia.com/insider/yorkshire/town-centre-securities-appoints-john-lewis-director", "content": "<mark>Stephen Farrell</mark> Digital Staff Writer Town Centre Securities appoints <mark>John Lewis</mark> director 8 Jan 2018 Yorkshire Business <mark>Stephen Farrell</mark> Leeds-based property developer and investor Town Centre Securities has appointed the property director at department store chain <mark>John Lewis</mark> to its board. Jeremy Collins will take up a position as non-executive director with effect from 1 February 2018. Collins is currently property director at <mark>John Lewis</mark> and will leave his current role as at the end of January. He joined <mark>John Lewis</mark> in 2003 as head of retail development, becoming property director in 2010, and has overseen the significant expansion of the partnership's department store estate from 24 to 51 shops during that time. He worked for Lend Lease between 1998 and 2003, in the roles of head of retail and project director, and his career has also included roles at MEPC, Grosvenor Square Properties, Bredero Properties and Wirral Borough Council. Edward Ziff, chairman and chief executive of TCS, said: \"We are delighted Jeremy is joining our Board. He brings 35 years of commercial property experience and a unique perspective on retail development and management having worked for a local authority and several property companies .\" Jeremy's appointment continues our board succession planning with three new non-executive directors, a new executive director and a new finance director appointed over the last three years, adding the additional skills and experience necessary to manage an ambitious real estate business. \"Jeremy Collins added:\" I am delighted to be joining the board of Town Centre Securities, at such an exciting time for the company. Its family origins and values, and its long-term perspective, resonates very strongly with me. \"I am looking forward to helping the business to adapt to the rapidly changing retail environment, and to continuing its role as a leading regeneration specialist in major cities such as Leeds and Manchester. This new role is an exciting start to my new portfolio of interests .\" Entries are now open for Insider's 6th annual manufacturing awards, Made in Yorkshire 2018. Enter your nominations now. Sector News", "articleID": "2018010808_00257666_W", "names": {"John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"], "Stephen Farrell": ["Q27824992", "Q7609177", "Q7609179"]}}, {"date": "2018-01-08", "url": "http://www.standard.net.au/story/5156730/pregnant-miranda-kerr-leads-stars-at-globes-after-party/?cs=36", "content": "It was billed as a Golden Globes unlike any other in history but once it was over, the stars still partied the night away. Led by Australian-born Miranda Kerr, pregnant with her second child, a host of celebrities not at the awards flocked to various after parties - many of them also wearing the all-black dress code implemented as part of the Time's Up initiative. Kerr, whose baby is her first with second husband Evan Spiegel and a sibling to Flynn, 7, was making her first red carpet appearance since the announcement. Also flaunting her news - and a $2-million ring - was Paris Hilton, who recently became engaged to Chris Zylka. Hilton, at the HBO party, sported a black lace dress that covered her fingertips, allowing the massive diamond to pop. Baby on board with #TimesUp...Miranda Kerr. Photo: CHRIS PIZZELLO But possibly the most poignant reminder of what the Golden Globes was about - solidarity, women speaking out on abuse and all forms of mistreatment, the \"enough is enough\" vibe that has blanketed Hollywood since the allegations surrounding Hervey Weinstein - was the arrival of Ashley Judd and Selma Hayek, two of Weinstein's accusers, arm in arm. At the @ instylemagazine party...#GirlPower @ mariahcarey @ ashley_judd En la fiesta de #Instyle A post shared by Salma Hayek Pinault (@ salmahayek) on Jan 7, 2018 at 11:28 pm PST The pair even shared photos of themselves getting ready for the event together, with Hayek posting to Instagram: \"With my date @ ashley_judd heading to the #GoldenGlobes, as usual we are kind of tardy, even though #Time\" sUp. \"Absent from the parties was actress Rose McGowan, who publicly disapproved of the call to wear black and called out\" Hollywood fakery \"on Twitter. And not one of those fancy people wearing black to honor our rapes would have lifted a finger had it not been so. I have no time for Hollywood fakery, but you I love,. @ AsiaArgento #RoseArmy https: //t.co/9e0938y5sI??? rose mcgowan (@ rosemcgowan) January 8, 2018 McGowan was the first high-profile actress to go public with her claims of abuse at the hands of Weinstein, which was first exposed in the New York Times three months ago. Since then, a flood of women have come forward with their own stories of abuse against Hollywood's mighty, which has also led to the inception of Time's Up, a coalition of 300 women in entertainment who have formed a fighting fund and have vowed to take widespread action against sexual and other forms of abuse and degradation of women. Paris Hilton arrives at the HBO Golden Globes afterparty at the <mark>Beverly</mark> Hilton Hotel on Sunday, Jan. 7, 2018, in <mark>Beverly Hills</mark>, Calif. (Photo by Richard Shotwell/Invision/AP) Photo: Richard Shotwell This story Pregnant Miranda Kerr leads stars at Globes after party first appeared on The Sydney Morning Herald. facebook SHARE twitter TWEET email whatsapp", "articleID": "2018010810_00580725_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2018-01-09", "url": "http://www.breitbart.com/texas/2018/01/09/guatemalan-gets-5-years-assaulting-border-patrol-agent/#disqus_thread", "content": "A Guatemalan man will spend five years in a U.S. prison after he assaulted a Border Patrol agent in Uvalde, Texas. The agent suffered a concussion after the man pounded his head against a train car. In November 2016, Border Patrol agents discovered two illegal immigrants near a train that recently crossed the border from Mexico. One fled the scene. The other, Elias <mark>de Jesus</mark> Gregorio <mark>de</mark> Paz, a 21-year-old Guatemalan national, began fighting with one of the agents. During the fight, <mark>de</mark> Paz slammed the agent's head, neck, and body into the train causing the agent to lose consciousness, according to court documents. The illegal immigrant fled the scene and disappeared for a few days. Border Patrol agents encountered <mark>de</mark> Paz on November 22, 2016, and placed him in custody. The injured Border Patrol agent was transported to the hospital--doctors determined he suffered a concussion from the assault. <mark>De</mark> Paz pleaded guilty to assaulting the agent in federal court on March 9, 2017. On January 8, U.S. District Judge Alia Moses sentenced the Guatemalan national to five years in prison. He also ordered <mark>de</mark> Paz to pay $5,767.28 to the Border Patrol agent for restitution to cover medical expenses and lost wages. \"This case demonstrates the great sacrifice Border Patrol Agents make every day, often risking their lives to protect our nation. Violence against Border Patrol Agents will not be tolerated,\" San Antonio Division FBI Special Agent in Charge Christopher Combs said in a written statement obtained by Breitbart Texas. To combat rising assaults against Border Patrol agents, Attorney General Jeff Sessions announced plans to increase the number of prosecutions. In a memo dated April 11, 2017, Sessions directed prosecutors to push for charges against anyone who assaults, resists, or impedes agents engaging in the performance of their official duties, Breitbart Texas reported. Despite this effort, assaults on Border Patrol agents continue to increase. During Fiscal Year 2017, assaults on Border Patrol agents increased by more than 70 percent over the prior year. A total of 786 agents were assaulted in 324 incidents over the period ending September 30, 2017. During the first two months of Fiscal Year 2018, 96 Border Patrol agents were assaulted in the line of duty. <mark>Bob Price</mark> serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @ BobPriceBBTX, Gab, and Facebook.", "articleID": "2018010914_00755022_W", "names": {"Bob Price": ["Q18358850", "Q4933684"], "De Jesus": ["Q36553259", "Q5361013"]}}, {"date": "2018-01-09", "url": "http://www.breitbart.com/news/meryl-streep-confirms-mariah-carey-stole-her-seat-at-golden-globes/", "content": "by UPI 9 Jan 2018 0 9 Jan, 20189 Jan, 2018 Jan. 9 (UPI)--Meryl Streep says music superstar Mariah Carey \"stole\" her seat at the Golden Globes. The 68-year-old actress recounted on Monday's episode of <mark>Jimmy Kimmel</mark> Live! how Carey took her place next to Steven Spielberg at the 2018 Golden Globe Awards ceremony Sunday. \"[Expletive] stole my seat,\" she jokingly confirmed to host <mark>Jimmy Kimmel</mark>. Streep said she returned from a break to find Carey sitting in her spot and \"sucking up\" to Spielberg. Carey explained she was told to sit down and offered to move, which Streep said she initially declined. \"\"No, no stay there. I'll sit on your lap because...comfy!\" ' she recalled of her response. Carey had said Sunday on Twitter that she accidentally took Streep's seat while on her way to the restroom. \"Got caught mingling on the way to the loo during a commercial break. . took the first available, happens to be right next to Steven Spielberg. Cut to next commercial break, guess who comes back to her seat...\"the singer wrote .\" (me) Dear Meryl, please forgive me!!! (MERYL STREEP) You can take my seat any time! \"she added. Streep and Carey were nominated at the awards show for Best Actress in a Motion Picture--Drama and Best Original Song, respectively. Streep lost to Frances McDormand, while Carey lost to Pasek & Paul. Comment count on this article reflects comments made on Breitbart.com and Facebook. Visit Breitbart's Facebook Page. BREITBART CONNECT", "articleID": "2018010917_00305351_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}}, {"date": "2018-01-11", "url": "https://www.frontpagemag.com/fpm/268929/islamic-terrorists-or-tragic-heroes-raymond-ibrahim#disqus_thread", "content": "The Western media's ongoing attempts to portray aggressors--even suicide-bombers--as victims. January 11, 2018 Raymond Ibrahim Raymond Ibrahim is a Shillman Fellow at the <mark>David Horowitz</mark> Freedom Center. PJ Media The so-called mainstream media's approach to and apologias for Islamic terrorism have become as predictable as they are farcical. In a recent piece titled, \"A Mysterious Act of Mercy by the Subway Bombing Suspect,\" the New York Times' Jeffrey Gettleman portrays would-be suicide bomber Akayed Ullah--whose foiled attempt at Times Square subway last month could have massacred countless Americans--as just another Muslim youth angered at and responding to the mistreatment of Muslims, that is, a Muslim with legitimate \"grievances .\" This is clear from the opening sentences: Before Akayed Ullah returned home to New York from his native Bangladesh...he had one last thing to do--an all-night bus ride by himself to help Rohingya refugees [Muslims]. After visiting relatives here in the capital city, Dhaka, he traveled across the country, slept in a mosque and under a tree, and passed out a few hundred dollars of medicine in the crowded refugee camps. \"When he left [America], he seemed happy,\" said his mother-in-law, Mahfuza Akhter. \"But when he returned, he was so upset. He said those people were living in hell, each and every minute .\" \"That lonely trip across Bangladesh in September remains a mystery,\" Gettleman goes on to opine, wondering whether Ullah was \"following his own heart, reflecting some sort of inner struggle as he headed toward his first known act of violence and self-destruction .\" Gettleman claims to base this \"tragic hero\" image of the would-be Muslim suicide bomber on \"extensive interviews with more than a dozen friends, relatives and acquaintances,\" all of whom (opportunistically?) say that Ullah was \"outraged by injustices inflicted on Muslims. He was also described by several people who know him well as loving and giving .\" According to Gettleman, such claims \"still leave a hole as to why Mr. Ullah did this .\" And so it goes. To anyone paying attention, the NYT's portrayal of Ullah is virtually boilerplate; the duplicate structure of the portrayals of all Islamic terrorists who strike at the United States. Recall, for instance, when <mark>Abdul Razak</mark> Ali Artan--an 18-year-old Muslim refugee from Somalia, who was receiving aid from Catholic charities--rammed his car into a building at Ohio State University, then got out and stabbed people with a butcher knife, hospitalizing some 13 people. CNN, NBC, the Washington Post and many others sought to rationalize away Artan's violence by citing one of his Facebook posts where he wrote, \"Seeing my fellow Muslims being tortured, raped and killed in Burma led to a boiling point. I can't take it anymore .\" The problem with both Ullah's and Artan's supposed \"grievances\" is twofold. First, the obvious: how, exactly, does terrorizing and slaughtering Americans make up for the plight of Rohingya Muslims in Burma/Myanmar? If Ullah and Artan were primarily motivated by the suffering of the Rohingya, shouldn't they have sought to terrorize and kill Burmese--not Americans? Secondly, while media and other \"experts\" routinely portray such Muslim terrorists as being motivated by the \"love\" they feel for fellow Muslims--as when former CIA Michael Scheuer described Osama bin Laden as a man of love, comparing him to Robin Hood--this \"love\" is itself another reflection of Islamic supremacism and the flipside to the Islamic doctrine of Loyalty and Enmity: just as Muslims are obligated to hate and fight non-Muslims, so are they \"obligated to befriend a believer--even if he is oppressive and violent toward you--while he [the Muslim] must be hostile to the infidel--even if he is liberal and kind to you\" (The Al Qaeda Reader, p. 64). Or as the Koran (48:29) more succinctly puts it, Muslims \"are forceful against the disbelievers, merciful among themselves .\" Simply put, Ullah's terror attempt is a byproduct of Islamic teachings that make the non-Muslim enemy number one, regardless of any real or imagined \"grievances .\" The reason Ullah struck the U.S. as opposed to Myanmar is probably because the latter has more \"draconian\" security measures that made America an easier target. Ironically, Bangladeshi authorities, who said Ullah \"was closely following several jihadist websites,\" come closer to the mark: \"He seemed to have this hatred for America,\" said <mark>Monirul Islam</mark>, the chief of Bangladesh's counterterrorism police operations. \"We're not exactly sure where it came from .\" While the answer is self-evident--the hatred came from jihadi websites that preach hate for all infidels 24/7--at least Bangladeshi authorities do not offer silly and sappy motivations such as \"grievances,\" which is more than can be said for so-called mainstream Western media and their nonstop efforts to portray Islamic aggressors as \"tragic heroes .\" Share", "articleID": "2018011105_00106874_W", "names": {"Abdul Razak": ["Q247730", "Q41251943", "Q4665681"], "David Horowitz": ["Q44641480", "Q5235149", "Q722462"], "Monirul Islam": ["Q47467193", "Q6900421", "Q6900425"]}}]