[{"date": "2018-01-11", "url": "http://www.bigcountryhomepage.com/news/main-news/shipt-to-bring-groceries-from-heb-to-abilene-homes/910517139", "content": "Shipt to bring groceries from HEB to Abilene homes By: Erica Garner Posted: Jan 11, 2018 11:02 AM CST Updated: Jan 11, 2018 11:04 AM CST Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Shipt is coming to Abilene, meaning residents will soon be able to have HEB groceries delivered right to their doors. Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Shipt is coming to Abilene, meaning residents will soon be able to have HEB groceries delivered right to their doors. ABILENE, Texas (KTAB/KRBC) - Shipt is coming to Abilene, meaning residents will soon be able to have HEB groceries delivered right to their doors. Beginning on January 18, anyone who wants to take part in the Shipt service can create a profile on the company's website, select their food items, and get their order delivered fresh the same day in as little as an hour. The full selection of products available at HEB will be listed on the website. Membership to Shipt is normally $99 a year, but to honor their expansion, Abilene residents who sign up prior to January 18 can receive a $50 discount. Shipt began serving HEB customers in May of 2016 and is now launching in 14 additional areas, including Abilene. \"In the past year, we've seen tremendous growth with H-E-B, an incredible partner and beloved retailer in the state of Texas. Together, our latest expansion brings the simplicity and convenience of grocery delivery to more families across the state,\" said <mark>Bill Smith</mark>, founder and CEO of Shipt. Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. More Stories A Florida university posted campus police outside a sociology class...46 minutes ago Whataburger is giving customers a chance to win free food for a year...1 hour ago", "articleID": "2018011117_00194252_W", "names": {"Bill Smith": ["Q17017840", "Q20273869", "Q4020151", "Q4400961", "Q4910910", "Q4910914", "Q4910916", "Q4910919", "Q4910920", "Q4910921", "Q4910925", "Q4910927", "Q56274191", "Q621106", "Q862469"]}}, {"date": "2018-01-10", "url": "http://news.sky.com/story/is-a-month-without-booze-worth-it-experts-on-dry-january-11202717", "content": "Weather Is a month without booze worth it? Experts on Dry January Experts give their views on whether a detox is essential to body functions and what happens in a month without booze. 04:09, UK, Friday 12 January 2018 Image: Dry January reaches its midway point this weekend Mail By <mark>Rebecca Taylor</mark>, News Reporter All around the country, people are hitting the halfway mark in their January detoxes and getting to grips with their New Year's resolutions. Whether it was to get to the gym more, eat more fruit and vegetables, or cut back on alcohol, there may be a slump around the corner requiring a new flex of willpower. But is there any point to a detox? What really happens to your body when you give up the booze? Should we all be trying to help our bodies cut out \"toxins'? Sky News spoke to experts to get the truth about the January detox. Yes to a detox - it's a great opportunity Image: Dr Sarah Brewer says a detox helps take opportunity to reset your diet Dr Sarah Brewer, author of more than 60 self-help books, told Sky News:\" I think a detox is a great opportunity to review and address your diet and change things that are wrong with it. Most people recognise that they don't eat enough fruit and vegetables, or protein. \"It is an opportunity to ditch the crap, and focus on a healthy diet .\" Avoiding alcohol is always a good thing to give your liver a rest. \"There is a lot of research to show supplements can help. If you take one thing, I recommend globe artichoke, to help the liver .\" During a detox, you eat a restricted selection of healthy and nutritious foods. You can eat as much or as little of these foods as you like, and do not necessarily need to lose weight. In practice, however, most people aim to halve their usual calorie intake to help boost the Detox process and to lose a few excess pounds. \"I do not recommend patches or colonics, it's all about focusing on your diet and cutting back .\" No to a detox - your liver does the job Image: Rhiannon Lambert says nothing detoxes like the liver Leading Harley Street Nutritionist Rhiannon Lambert said: \"The good news is that that we all already have a detoxification system. It's called the liver and no tea, juice cleanse or diet will do it's job any better .\" Any suggestion that the human body can be detoxed with a tea, juice cleanse or patch is incorrect. We are naturally designed to remove toxins using our liver and kidneys - none of these perform such a detox. These items often prey on those individuals desperate for a quick fix or simply to feel healthier, when in reality just addressing their overall diet and lifestyle will work wonders and cost less. \"The idea that we kind do some kind of purge and purify our bodies is an attractive thought but the reality is you simply need to eat well most of the time. If you accept the marketing of any supposed detox, you're abandoning proven science .\" Food isn't strictly speaking medicine and encouraging people to see some food as toxic and others as pure is dangerous. In my experience, all detoxes do is push you into extreme calorie restriction. An obsession with a rule-driven way of eating like so-called detoxing is familiar to so many people with disordered eating. \"Image: Dry January has side effects like losing weight and saving money She added:\" There is no denying that alcohol should be limited as part of a healthy diet. All too often I see alcohol associated with weight gain and poor mental clarity. Any positive claims from alcohol stem largely from studies using quality red wine and often on males over the age of 50. There is a lot of research investigating the powerful plant compounds in red wine and their health benefits, including reduced inflammation, lower risk of heart disease and extended lifespan. \"Choose your alcohol wisely and remember that alcohol can be addictive and excessive consumption can cause a whole host of health issues .\" Dry January: What happens after you give up alcohol? Many people may now be starting to see some differences in their appearance and their wellbeing as they make it to the second weekend in January without alcohol. In general, those who give up alcohol for one to two weeks report better quality of sleep, and see improvements in their skin. According to Drinkaware, drinking alcohol helps people to drop off to sleep quicker, but it prevents the body staying in deep sleep, and entering REM cycles (rapid eye movement). This means while the glass of red might send you to sleep, it'll make you groggy the next day too. Image: Friends Ruari and Andy set up One Year No Beer Reducing alcohol intake could also benefit your skin, as it's a diuretic, meaning it makes you dehydrated. Cutting back will help your skin and eyes to sparkle. Many people report weight loss, as the empty calories of alcohol are replaced with lower calories alternatives, and making up lbs with pounds when they don't get tied into rounds at the pub. Friends Andy Ramage and Ruari Fairburns gave up alcohol for a year after becoming fed up of late nights and hangovers entertaining clients in the City of London. Now, they've written a book together, The 28 Day Alcohol Free Challenge, and run programmes encouraging people to knock the pints on the head for as long as they can, from 28 days to 365. Mr Fairburns said: \"We have worked with the University of Stirling and we've found that people who do our programme get an\" epiphany' moment somewhere between 20 and 60 days. \"This epiphany is' I feel amazing'. It happens to nearly everyone who regularly drinks more than 14 units a week, four large glasses of wine. Image: Andy's body changed dramatically when he stopped drinking\" They think' I feel limitless'. Many people who stick to our 28 days end up staying to do 90 days or longer without alcohol. \"He added that humans naturally want to fit into a tribe, and for some tribes, they can be defensive when one member stops drinking. But the key can be finding a tribe with a different common interest, or who can help keep you on the no alcohol path. More from Health", "articleID": "2018011204_00386197_W", "names": {"Rebecca Taylor": ["Q511094", "Q7301953"]}}, {"date": "2018-01-13", "url": "http://gulfnews.com/life-style/celebrity/desi-news/bollywood/shah-rukh-khan-returns-as-dubai-hero-1.2156066", "content": "Published: 13:40 January 13, 2018 Staff Report SMALL MEDIUM LARGE He's back! Bollywood superstar Shah Rukh <mark>Khan</mark> returns to his starring role for Dubai Tourism's #BeMyGuest campaign. The actor starred in his first promotional film for the city, which was released last year and racked up millions of views online. In the first video from the latest mini series--there are four in total--directed by <mark>Kabir Khan</mark>, the actor is seen taking a couple through Dubai attractions, and ends with the man proposing to his girlfriend. Other videos will show <mark>Khan</mark> taking visitors through Dubai, introducing four characters and personalising each of their experiences in the city. The mini series has been shot at various landmarks, including Legoland Dubai, Bollywood Parks Dubai, Dubai Aquarium, Dubai Fountain, The Palace Downtown Dubai and the mountainous Hatta region. \"Last year I invited my fans around the world to Be My Guest while giving them a glimpse into my Dubai, as part of this exciting partnership with Dubai Tourism .\" This year, along with one of Bollywood's most recognised directors, <mark>Kabir Khan</mark>, we're taking that partnership further to exploring new places and attractions but with the signature essence of Dubai that truly makes it a place where every visitor can feel like they belong to even greater heights. \"I love this amazing city and I'm really looking forward to once again sharing my experiences with my fans,\" <mark>Khan</mark> said in a statement. #BeMyGuest Essam Kazim, the CEO of Dubai Corporation for Tourism and Commerce Marketing (DCTCM), added: \"We are delighted to partner with Shah Rukh <mark>Khan</mark> once again for the new edition of this very special project, #BeMyGuest .\" There is no one quite like him--with his charisma, global appeal, and most importantly because he truly considers Dubai to be his second home and shares so many similarities with what Dubai stands for. \"Our video last year that saw Shah Rukh surprise and delight people in Dubai, garnered great response from across the world, but that was only the beginning of our journey .\" This time around, we continue to celebrate this strong bond by capturing Shah Rukh <mark>Khan</mark> directly exploring the city and what it has to offer to audiences across different age groups and demographics. \"We are also very pleased to work with <mark>Kabir Khan</mark> for the first time, as he has brought to life Dubai's extensive tourism proposition, while weaving in Shah Rukh's unique relationship with the city. We look forward to sharing this series with our global audiences and the international diaspora as well as the wider global fanbase of Shah Rukh <mark>Khan</mark>.\" Director <mark>Kabir Khan</mark> is known for films such as Kabul Express, Ek Tha Tiger and the 2015 mega-hit Bajrangi Bhaijaan. \"It's been an absolute dream come true to work on this campaign with such power house names,\" he said. \"I have always aspired to work with Shah Rukh, the charisma he brings to every shot is admirable, while Dubai has been one of my favourite cities to visit. In these films, we've done our best to capture the essence of Dubai, from its stunning locations to its welcoming hospitality. After working so closely with both Dubai Tourism and Shah Rukh <mark>Khan</mark>, I can confidently call Dubai my home and cannot wait to be back .\" The first #BeMyGuest video, which debuted last year, has garnered more than 45 million views across multiple social media channels. The video also reached No 3 on YouTube's worldwide trending list within 48 hours of its launch and became one of the top 10 most viewed videos on the website globally in December. It also won the Grand Prix, as well as first prize in the Tourism Destination category at the International Tourism Film Festival held in Riga, Latvia.", "articleID": "2018011310_00026210_W", "names": {"Kabir Khan": ["Q6344214", "Q6344216"]}}, {"date": "2018-01-14", "url": "https://citizen.co.za/news/news-world/1782060/vatican-religion-pope-francis/", "content": "Pope Francis and Latin American winds of change by Catherine MARCIANO/AFP The Archbishop of Buenos Aires was virtually an unknown when he was elected on March 13, 2013, becoming the first pope to choose the name Francis--a homage to St. Francis of Assisi, who dedicated his life to the poor A squall of fresh air with a distinct Latin American feel tore through the Vatican on the election of Pope Francis, a passionate Argentine whose defence of the downtrodden has stirred hearts across the world. On his return to the continent this week with a trip to Catholic majority Chile and Peru, Francis will not only speak his native Spanish but also a vibrant spiritual and cultural language common to all. \"I feel free, nothing scares me,\" the pontiff once said, despite shouldering the burden of leading the world's 1.3 billion Catholics, nearly half of whom live in the Americas. It was a typically American expression according to fellow Argentine, Bishop Marcelo Sanchez Sorondo, who has known Francis for decades. \"North and South America are both societies with European origins that have realised they need independence. The idea of freedom is the cornerstone of the Americas,\" the philosophy professor told AFP. The first pope to address the United States congress has \"a strong sense of human dignity and freedom\" , he says. But while one of the Americas has prospered, the other has become increasingly impoverished. \"The pope is very sensitive to the issue of social justice--a more Latin than North American theme, hence the interest he has for the\" peripheries' in difficulty, \"Sorondo said, referring to Francis's support for those on the margins .--\"Link between worlds'--The Archbishop of Buenos Aires was virtually an unknown when he was elected on March 13, 2013, becoming the first pope to choose the name Francis--a homage to St. Francis of Assisi, who dedicated his life to the poor. The Argentine hails from a family of Italian immigrants and became\" a sort of link between the Old World and the New World \", says Giovanni Maria Vian, editor of the Vatican's L’Osservatore Romano newspaper. However,\" the dramatic history of Argentina at the end of the 20th century is what shapes his personal trajectory \", he says in the preface to a book called\" Francis, the American pope \". In 2007, Jorge Bergoglio was elected by his fellow bishops in Aparecida in Brazil to draw up the final document of the Latin American Episcopal Council, which can be read as a guide to many of the themes dearest to him. Bergoglio stressed the ills of a\" scandalous inequality which wounds personal dignity \", a theme which\" clearly guides his actions at the head of the church today \", Vatican specialist Nicolas Seneze writes in\" The Words of the Pope \". The Aparecida conference\" prioritised the poor \", Sarondo said .\" The pope is very critical of capitalism which sacrifices human rights--a typical stance of the Latin American episcopate, \"he added .--\"Faith and blood'--While Polish pope <mark>John Paul</mark> II had denounced\" wild capitalism \", Francis has taken more concrete steps, such as calling for\" a poor church for the poor \"and turning down a luxurious papal apartment for a humble hotel room, he said. Bergoglio was an active pastor, taking the bus around Buenos Aires and heading without a second thought into slums in Latin America to comfort the poor. An inmate at the Virgen de Fatima Women's prison in Lima shows handmade wooden rosaries made by the prisoners. A total of 72 inmates in the prison have produced 33,000 rosaries to be sold at stores in Lima, to donate the proceedings to Pope Francis His experience of the Argentine economic crisis has also shaped his idea of\" the misery of big cities \", which fatally attract poor farmers from the countryside in search of a better life, stripping them of their culture. His vision was strongly influenced by the\" theology of the people \", the Argentine, non-violent version of the South American Liberation theology--a strain without the focus on the Marxist class struggle. And since his arrival in Rome, the pope has created new Latin American cardinals, saying\" they bring with them the air of new churches and of a history of faith and of blood \". In doing so, he is also reshaping in his image the conclave of cardinals that will elect his successor.", "articleID": "2018011403_00553729_W", "names": {"John Paul": ["Q1701359", "Q6252169"]}}, {"date": "2018-01-14", "url": "http://www.rutlandherald.com/articles/otter-creek-solar-gets-contract-offer/", "content": "Developers have received a contract offer for one of two solar projects proposed for Windcrest Road in Rutland Town, they said Friday. The two projects would together generate more than 7 megawatts of power. FILE PHOTO The developers of the proposed Otter Creek Solar projects in Rutland Town said they have received a contract offer for the smaller of the two solar projects proposed for Windcrest Road. <mark>Brad Wilson</mark> of Ecos Energy, said Friday the two projects have yet to receive a certificate of public good from the Public Utility Commission. \"The projects have moved through the 248 process and now we're in the stage of waiting for a decision,\" <mark>Wilson</mark> said. <mark>Wilson</mark> is working for the Melone family of New York City which has several solar projects in Rutland and Bennington counties pending before the Vermont Public Utility Commission. The Otter Creek Solar project would be built on a 56-acre parcel, with the larger project on 17.5 acres, and the smaller one on 10.8 acres. The projects were split into two different projects in order to qualify for the state's renewable energy credits, which required any project to be smaller than 5 megawatts. When the projects were first proposed in 2016, Allco expected to have started construction in 2017. <mark>Wilson</mark> said recent statements at a public meeting last week in Rutland Town that the developers had pulled back from the project weren't correct. \"We are currently pursuing contracts for both,\" he said. Otter Creek Solar, a project of Allco Renewable Energy Ltd., has proposed two, side-by-side solar projects on 57 acres of forested land between Windcrest and Cold River roads. The larger of the two projects would generate 4.9 megawatts of power, and the smaller one less than half that, 2.2 megawatts. <mark>Wilson</mark> said the smaller project had received a contract offer and that Allco was currently evaluating the offer. According to a Dec. 14 order from the Public Utility Commission, it was moving the Otter Creek 2 project up on its list of project that qualify for the commission's \"standard offer' list, since a different solar project in northern Vermont had been disqualified. Power contracts are often considered key to winning approval from state regulators. In the December 14 order, the PUC said it was awarding the Otter Creek Solar 2 project a contract and was referring it to Vermont Electric Power Producers Inc. of Manchester, which administers the standard-offer process for the state. The order stated that the Otter Creek Solar 2 project was the\" least-cost proposal in this year's reserve group. \"\"The larger of the two projects does not currently have a contract,\" said <mark>Wilson</mark>, who denied that Allco was having trouble nailing down a project for the Rutland Town solar projects. The Public Utility Commission recently ordered a review of its standard-offer process, where energy developers are guaranteed a certain power rate in an effort to promote the development of alternative renewable power sources. More From Local & State Go To The Local & State Section Cornish-Windsor Covered Bridge closed due to ice jam Truck ends up in creek, driver missing Red Cross opens evacuation center in Swanton due to flooding", "articleID": "2018011414_00967798_W", "names": {"Brad Wilson": ["Q16887049", "Q4954364", "Q4954365"]}}, {"date": "2018-01-14", "url": "http://www.kxlf.com/story/37263271/ex-idaho-lawmaker-kills-himself-amid-sex-abuse-investigation", "content": "Ex-Idaho lawmaker kills himself amid sex abuse investigation - KXLF.com | Continuous News | Butte, Montana Ex-Idaho lawmaker kills himself amid sex abuse investigation - KXLF.com | Continuous News | Butte, Montana Member Center: Ex-Idaho lawmaker kills himself amid sex abuse investigation Posted: Updated: By CNN A former Idaho state representative who resigned last fall amid sexual abuse accusations has killed himself, officials said. Former Republican state Rep. Brandon Hixon, 36, died Tuesday of a self-inflicted gunshot wound to the head, Canyon County Coroner Vicki DeGeus-Morris told CNN. Hixon's death follows the December death of Kentucky state Rep. <mark>Dan Johnson</mark>, also a Republican, who had been accused of sexually assaulting a teenage girl in 2013. <mark>Johnson</mark> died a day after denying the allegations, and the Bullitt County, Kentucky, coroner ruled the death a suicide. Hixon, who was in his third term, resigned from the Idaho legislature in late October. Shortly after the resignation, reports in local media said Hixon was under investigation for sexual abuse, with the Idaho Statesman citing the state attorney general's office in its news report. Idaho Speaker of the House Rep. Scott Bedke announced Hixon's death Tuesday on the chamber floor. \"Our thoughts go to his family and friends who are suffering from his loss,\" said Bedke, who did not respond to CNN's request for further comment. Sex abuse case rises to state level The Canyon County prosecutor's office initially handled the complaint against Hixon, county spokesman Joe Decker told CNN. The investigation was transferred to the state attorney general \"due to a conflict of interest,\" according to a document provided to CNN by Scott Graf, director of constituent affairs for the Idaho Office of the Attorney General. The document notes that the case relates to \"Brandon Hixon, Sexual Abuse Allegations .\" The attorney general's office would not comment further on the sexual abuse accusations against Hixon. Hixon's legal troubles continued after he resigned from the legislature. He was arrested on December 9 and charged with two misdemeanors: driving under the influence and resisting arrest, Ada County Sheriff's Office spokesman Patrick Orr told CNN. Hixon was arrested again later in December for \"suspicion of driving under the influence,\" Capt. Devin Riley of the Caldwell Police Department told CNN. Alleged victims were minors, ex-wife says Hixon's ex-wife, Danielle Eirvin Hixon, told CNN that the alleged victims in the sexual abuse case against her former husband were two underage girls. She said one of the alleged victims told her about the suspected sexual abuse in October. Eirvin Hixon, who was married to Hixon for 10 years before they divorced in May 2016, said it was the first she'd learned of abuse allegations against Hixon. Eirvin Hixon told CNN she's speaking out because she wants to help the alleged victims. \"It isn't fair for his victims that they be silenced because he's no longer here,\" Eirvin Hixon told CNN. Eirvin Hixon told CNN she was due to testify before a grand jury considering the allegations against Hixon on Wednesday morning, the day after he killed himself. The Idaho attorney general's office would not comment on Eirvin Hixon's assertions. WEATHER Updated: Saturday, January 13 2018 11:30 PM EST 2018-01-14 04:30:14 GMT The Blaine County Sheriff has identified the teen whose body was found in a field along US Highway 2. The Blaine County Sheriff has identified the teen whose body was found in a field along US Highway 2. Saturday, January 13 2018 5:30 PM EST 2018-01-13 22:30:10 GMT A government watchdog is expressing concern over the dangerous misuse of a laundry detergent. A government watchdog is expressing concern over the dangerous misuse of a laundry detergent. Updated: Sunday, January 14 2018 10:30 AM EST 2018-01-14 15:30:10 GMT MILES CITY - A Miles City woman is dead after she was ejected during a multi-vehicle crash west of Forsyth on Saturday morning. MILES CITY - A Miles City woman is dead after she was ejected during a multi-vehicle crash west of Forsyth on Saturday morning. Updated: Saturday, January 13 2018 9:30 PM EST 2018-01-14 02:30:09 GMT John Clune and Lauren Groth, of the Denver law firm Hutchinson Black and Cook, will be joining the case against the Frenchtown School District and Superintendent Randy Cline. John Clune and Lauren Groth, of the Denver law firm Hutchinson Black and Cook, will be joining the case against the Frenchtown School District and Superintendent Randy Cline.", "articleID": "2018011422_00112923_W", "names": {"Dan Johnson": ["Q16193666", "Q16730344", "Q27917138", "Q3013125", "Q45409991", "Q5213759", "Q5213760", "Q5213762"]}}, {"date": "2018-01-15", "url": "http://www.lmtonline.com/local/article/Newtown-Southbury-students-win-MLK-essay-contest-12499148.php", "content": "http: //www.newstimes.com/local/article/Newtown-Southbury-students-win-MLK-essay-contest-12499148.php Newtown, Southbury students win MLK essay contest By Rob Ryser Published 12:57 pm, Monday, January 15, 2018 Photo: Win McNamee / Getty Images Image 1 of / 1 Caption Close Image 1 of 1 The Martin Luther King Jr.. Memorial in Washington, D.C., is shown in the early morning light on Monday. The Martin Luther King Jr.. Memorial in Washington, D.C., is shown in the early morning light on Monday. Photo: Win McNamee / Getty Images Newtown, Southbury students win MLK essay contest 1 / 1 Back to Gallery NEWTOWN - A Newtown High School student and a Sandy Hook School student were winners of an essay contest honoring Martin Luther King, Jr., according to a release. Kenneth Miller, a student at Sandy Hook School, and Karl Miller, a student at Newtown High School, each won for their essays in Congressional District 5. Kyler Kumi, a student at Rochanmbeau Middle School in Southbury also won, according to the release. The students were among 15 winners in Connecticut of the second annual Martin Luther King Jr.. Day Essay Challenge, sponsored by U.S. Sen. <mark>Chris Murphy</mark>. \"Today, we reflect on Dr. King's legacy, and I hope that students across Connecticut who wrote essays took it as an opportunity to do so,\" <mark>Murphy</mark> said in a prepared statement. \"If they stay engaged and fight hard for what they believe in, they can accomplish anything they set their minds to .\" Some 700 students submitted essays to the contest, according to the release. The winning essays will be displayed in <mark>Murphy</mark>'s office. Click to Sign Up for News Alerts UISD football coach reassigned in fallout of 8-liner raid 5 Mexican states get US \"do not travel' warning Immigration agents descend on dozens of 7-Eleven stores Trump makes 2,000 false or misleading claims over 355 days Catch every Laredo-area moment! Click to like LMTonline on Facebook: The Latest Hit-and-run suspect sought by Laredo police Government shutdown looms as hopes for immigration deal fade Make gadgets great again\" We made a mistake' Hawaii sends false missile alert Basketball Hall of Famer arrested for DUI Trump's \"pretty Korean lady' comment draws swift backlash Dramatic photo shows plane hanging off runway New alarm among GOP that Democrats could win big this year The most shocking celeb scandals of the last 20 years\" True Lies' actress alleges she was abused at age 12 Spur on Trump remarks: Ffrequent of the way he talks \"SNL' host drops an F-bomb during his first sketch (Video) Katy Perry makes Laredo girl's dream come true Review: Katy Perry takes 12,000 fans to another world Big shows worth driving up to S.A. for Becky Lynch and WWE Live head to Laredo Tuesday UISD head coach reassigned after home raided TX girl goes viral for angering TSA with school spirit Gamers take over San Antonio for PAX South Sign Up for News Alerts Loading...Most Popular 1 Katy Perry brings South Texas girl up onstage during San...2 Alexander's Joel Lopez reassigned from role as head coach 3 Hit-and-run suspect sought by Laredo police 4 Houston girl goes viral after angering TSA for showing school...5 FERNANDO SALINAS 6 Fourth arrest made after maquinita raids believed to be head...7 ANA ISABEL FARIAS MULLER 8 ALFREDO ESCOBEDO SR. 9 MICHAEL PATRICK ESQUIVEL 10 IMELDA G. RAMIREZ View Comments © 2018 Hearst Communications, Inc. .", "articleID": "2018011519_00042634_W", "names": {"Chris Murphy": ["Q1077594", "Q20022484", "Q2964809", "Q5107535", "Q5107536", "Q5107538", "Q56379834"]}}, {"date": "2018-01-16", "url": "https://www.drovers.com/article/murphy-eagle-soars", "content": "<mark>Dan Murphy</mark> January 16, 2018 06:00 AM The return of the bald eagle shows the benefits of a useful regulation. (Photo: freeimages.com) One of underappreciated pleasures of living near the shores of Puget Sound in northwest Washington state is the annual springtime spectacle: watching juvenile bald eagles attempting to fend off a determined flock (murder?) of crows working as a team to drive the eagles away from their nesting areas. Sometimes these aerial battles, which literally take place right above my backyard, last as long as four or five minutes. Surprisingly, the young eagles are not nearly as adept as you might imagine, and the clever crows use their superior agility and numbers to harass the eagles until they're forced to fly away. Of course, when I lived back East years ago, the sight of a bald eagle, juvenile or otherwise, would have been front-page news, because back then, eagles were a species that was threatened with extinction. The reason proved to be straightforward: Widespread use of the potent pesticide DDT (dichloro-diphenyl-trichloroethane). The problem was that DDT is solvent in fats or oils. As a result, it bio-accumulates in the fatty tissues of animals, especially those at the top of the food chain, such as predators like eagles, hawks and condors. In humans, DDT exposure can cause damage to the liver, the nervous system and even birth defects. With eagles, their numbers began declining sharply in the 1960s and 1970s because the DDT they were ingesting made their eggshells thin and fragile, and the birds weren't able to reproduce effectively. Now just this year, the symbol of the nation has been removed from the protected list by the Washington Fish and Wildlife Commission, which acknowledged the raptor's comeback from threatened extinction. \"It's a real success story,\" agency spokesperson Hannah Anderson told news reporters. A Regulation that Worked It's easy to demonize the mass of federal regulations, and truthfully, many are cumbersome and problematic for businesspeople. EPA, in particular, has been excoriated by agricultural interests as an agency whose authority ought to be eviscerated, since its agenda (allegedly) is anti-industry. Blanket condemnation of any federal agency is counterproductive, however, and in the case of the bald eagle, as well as other avian species, EPA's regulatory authority turned out to be downright heroic. That's because in 1972, EPA banned the use of DDT, not only because of its impact on wildlife, but also because its toxicity was determined to be seriously problematic for people, as well. It took several decades, but once the pesticide was removed from the environment, the populations of eagles and other raptors began to rebound. In fact, a recent study by the state of Washington identified 1,334 eagle nesting sites, mostly in the northwestern part of the state where there are numerous lakes and salmon-bearing rivers. And talk about an impressive lifestyle: Bald eagles instinctively return from northern Canada and the Arctic each spring to the same nest or nesting territory, and those nests are often four to six feet across and can weigh as much as 2,000 pounds. The point of this feel-good story is that the American bald eagle, which appears on U.S. currency, on the official Great Seal of the United States (holding a bundle of arrows in one talon and an olive branch in the other) and in too many numerous patriotic depictions to catalog, is alive and well as a result of government regulation. \"In some ways, [their recovery] was an easy success story,\" Ruth Milner, a regional biologist for Washington's Fish and Wildlife Commission, told The Herald newspaper. \"We identified their problem and removed it from the environment .\" Granted, most regulatory edicts aren't as clear-cut in their impact as the DDT ban, nor as beneficial to both industry and the public. But the backstory of how the bald eagle journeyed from near-extinction to full recovery is a cautionary tale for those who reflexively oppose all government regulations as being intrinsically bad. What would have been bad is if the majestic bird that for 235 years has served as our national symbol had perished from these United States. Editor's Note: The opinions in this commentary are those of <mark>Dan Murphy</mark>, a veteran journalist and commentator. PREV Tally Time: Preparing for Calving Season Related on Drovers Thompson-Weeman: Refresh Your Hiring Procedures for the New Year Mon, 01/15/2018 - 10:30 by Hannah Thompson-Weeman <mark>Murphy</mark>: Bad Move for the Wrong Reasons Mon, 01/15/2018 - 10:00 by <mark>Dan Murphy</mark> Canada Welcomes Trump Suggestion of NAFTA Deadline Extension Fri, 01/12/2018 - 12:40 by Reuters Staff", "articleID": "2018011612_00337538_W", "names": {"Dan Murphy": ["Q28025982", "Q3013155", "Q5214076", "Q5214077", "Q5214078", "Q5214079"]}}, {"date": "2018-01-16", "url": "http://hamodia.com/2018/01/16/first-test-run-tel-aviv-yerushalayim-high-speed-railway/", "content": "Tuesday, January 16, 2018 at 9:03 am | כ \"ט טבת תשע\" ח Israel Railways CEO Shahar Ayalon with Israeli Minister of Transportation Israel Katz during a test ride on the Jerusalem-Tel Aviv express train in central Israel on January 16. (Hadas Parush/Flash90) Transportation Minister <mark>Yisrael Katz</mark> on Tuesday conducted the first test run of the new high-speed railway from Tel Aviv to Jerusalem. The line is set to open on March 30, in about two and a half months. During the trip, <mark>Katz</mark> was accompanied by an entourage of Transportation Ministry officials, reporters and supporters. Speaking to the reporters, <mark>Katz</mark> said that he had decided to name the rail line the \"King David Line .\" The line \"will connect us to Yerushalayim and its history,\" <mark>Katz</mark> said. \"I decided to call it after King David, the conquerer of Yerushalayim, who turned the city into our eternal capital .\" Test trips that have been ongoing in recent months indicate that the predictions that the trip between Yerushalayim and Tel Aviv will take less than a half-hour are accurate, with the electric train achieving speeds of up to 160 kilometers per hour (100 mph). The 28-minute trip will include stops at Ben Gurion Airport, Modiin, and Shaar Hagay (where a large parking lot for commuters to Beit Shemesh will be set up). According to the Transport Ministry, the line will include five kilometers of bridges, including the longest bridge in Israel, at a length of almost three quarters of a mile. It is also the highest bridge, rising to almost 300 ft off the ground. The successful traversing of this bridge by the 1,200 ton train is an excellent sign that the project is sound from an engineering point of view, the Ministry said in a statement, adding that each pass of a train over the bridge will enable it to \"settle,\" strengthening its pylons and making it more sturdy. Besides the highest bridge, the railway will include the country's longest tunnel--7 miles. In addition, the railway's Jerusalem terminus, which will be about half a mile below ground, is one of the deepest commuter railway stations in the world. The line will begin operating just in time for Chol Hamo’ed Pesach, and travel for the first three months of its operations will be free, <mark>Katz</mark> said Tuesday. \"The train will take 28 minutes to travel in either direction, and will guarantee further the status of Jerusalem, and further bring it to the country's business center, making it a more attractive place to live for families to live and start businesses. It will completely change the connection between Jerusalem and the rest of Israel,\" said <mark>Katz</mark>. Print Email Gmail", "articleID": "2018011614_00124089_W", "names": {"Yisrael Katz": ["Q487304", "Q487316"]}}, {"date": "2018-01-16", "url": "http://www.nbcsports.com/philadelphia/eagles/stefen-wisniewski-was-blocking-machine-first-playoff-game", "content": "Standings Stats Video Toward the end of the regular season, the Eagles' offensive line just didn't seem to be hitting its stride. That all changed on Saturday against the Falcons. The Eagles' O-line dominated in the trenches and helped guide the Birds to a 15-10 win to advance to the NFC championship game. What was the line missing down the stretch? Stefen Wisniewski. The starting left guard missed a couple games with an ankle sprain, but returned for the regular season finale. Then, he just happened to have his best game as an Eagle in the divisional round game. It also happened to be the very first playoff game of his career. The 27-year-old Wisniewski had played in 107 regular season games without getting to the postseason--more than any other player on the active roster. When he got his first shot, he certainly made it count. Because Wisniewski didn't just do his job against the Falcons. He was dominant and made things happen all afternoon. Here's a closer look at some of his impressive plays against Atlanta: good-wiz1a. png This first play came on the Eagles' second drive of the game. It's 2nd-and-3 and Jay Ajayi is about to break off an 11-yard gain right behind the hole Wiz opens up. Wisniewski is about to get to the second level after the snap and find linebacker Deion Jones, who is a dynamic player, but is also just 222 pounds. good-wiz1b. png At the mesh point, Trey Burton has come across to take care of the defensive lineman, while Wiz is getting out in front on Jones. He doesn't just block him, he's about to push him back. good-wiz1c. png Ajayi finishes the run strong, picking up 11 pounds. He rode on the back of Wisniewski the whole way. Here's a different angle on the block to get an idea of how far Wisniewski drove Jones back. good-wiz1v. gif • • • good-wiz2a. png These next three plays happened on consecutive downs. They were the last two plays of the first quarter and the first play of the second. Wiz got in a zone. On this one, Wiz is about to take on big Ahtyba Rubin, who weighs 310 pounds. good-wiz2b. png good-wiz2c. png On this zone read play, Ajayi sweeps left, so the entire defensive line shifts that way. Rubin goes with the play, but you can see where Wisniewski opens the hole. He makes it pretty easy on Ajayi. good-wiz2v. gif • • • good-wiz3a. png The very next play is a screen, which has been a big part of the Eagles' offense when it gets clicking. \"The screen game has been something we've worked on the last couple of weeks,\" head coach Doug Pederson said, \"and it had to get better as the season wore on for us .\" On this play, Nelson Agholor is at the bottom of the screen. He's about to come in motion to create some space at the bottom of the screen. That's where Wisniewski is going to get out in front to clear a path for Ajayi. good-wiz3b. png Ajayi is working through the line and is about to settle in his spot to catch the pass from Nick Foles. Meanwhile, Wisniewski gets to the second level to find a hat to block. good-wiz3c. png Then, Wiz just bullies Jones again. He really used that size and strength edge to his advantage and didn't let the quicker Jones get around him. good-wiz3v. gif This was an important play because it showed just how big of a key the screen game could be. A little later you'll get to see Wiz's most impressive play. It came on a screen later in the game. good-wiz4a. png This is the first play of the second quarter. After Ajayi picked up nearly 50 yards in the first quarter, he's on the sideline getting a breather so LeGarrette Blount is on the field. He's gonna run right behind Wiz. good-wiz4b. png Just after the snap, Wiz lends some help to Jason Kelce, who is blocking big 346-pound tackle Dontari Poe. He then turns his attention to Jones, who has become his whipping boy at this point in the game. good-wiz4c. png At this point, Wisniewski has picked up his second block on the play and you can see where Blount is going to find the room to sneak ahead for an 8-yard gain. good-wiz4v. gif • • • good-wiz5a. png This next play comes about a minute later in the second quarter. The Eagles were running all over the Falcons but Foles was having trouble getting into rhythm. Pederson is going to find a way to get the ball into one of his playmaker's hands anyway. Agholor will take the ball on an end around and Wisniewksi is going to make it happen. good-wiz5b. png Lane Johnson swings around to get out in front of Agholor to provide a lead block, but it's Wisniewski who opens the hole. good-wiz5v. gif The Eagles gained 21 yards on this play to get them down the the 3-yard line. This led to their only touchdown of the game. good-wiz6a. png We went in chronological order, which allowed us to save the best for last. Wiz was incredible on this 32-yard screen pass in the fourth quarter. He actually blocks three guys on one play and forces one away from a tackle. Pederson caught the Falcons off guard by running a screen pass to the same side on two consecutive plays. He knew they wouldn't be expecting it. But it was still gutsy to run it on a key 3rd-and-7. good-wiz6b. png Just after the snap, Wisniewski gets enough of a block on Adrian Clayborn to give Foles plenty of time to deliver the ball. It's Wiz's job to let Clayborn through, but if he doesn't get a piece of him, the talented pass-rusher might have been able to blow up the play before it ever got a chance to develop. good-wiz6c. png good-wiz6d. png After getting the block at the line of scrimmage, Wiz gets out in front and takes care of the two defenders that get in his way. It's hard to see it with the photos, so take a look at his incredible play here: good-wiz6v. gif Pretty impressive, huh? This 32-yard screen pass got the Eagles across midfield and they eventually got close enough for <mark>Jake Elliott</mark> to kick a 21-yard field goal to put them up 15-10. It was a huge score because then the Falcons needed a touchdown instead of a field goal. \"I'll tell you, it was just set up perfectly for us and well-executed to have Wiz downfield and block one,\" Pederson said, \"but take out two, obviously helps the play .\" It took Wisniewski a while to prove himself this season. Even though he signed an extension this offseason, the Eagles seemed hesitant to give him the starting left guard spot. Isaac Seumalo was the starter going into the season and Chance Warmack was given the first shot to replace him when he struggled. Eventually, though, Wisniewski got the nod and has been playing at a really high level all season. The Eagles have three Pro Bowl or All-Pro linemen, but without Wisniewski this line just didn't seem to work. With him, they were dominant on Saturday.", "articleID": "2018011614_00753321_W", "names": {"Jake Elliott": ["Q22004199", "Q22277691", "Q27928464"]}}]