[{"articleID": "2010121000_00116596_W", "names": {"Roberto Mancini": ["Q23289352", "Q48330", "Q55466310"]}, "date": "2010-12-10", "url": "http://independent.co.uk/sport/football/premier-league/mancini-calls-on-city-to-prove-they-can-thrive-without-tevez-2155743.html", "content": "manchester city manager <mark>roberto mancini</mark> believes that carlos tevez will remain at the club for' a long time' enlarge <mark>roberto mancini</mark> may have to do without carlos tevez this weekend, but the manchester city manager believes the argentine will be at eastlands for the long term, despite the pair's very public disagreement last saturday after tevez was substituted late on against bolton. \"i think we can talk about this situation every week,\" said <mark>mancini</mark> yesterday. \"now we must have a focus on the games. we have a difficult month and big games ahead. we can't speak about him [tevez] every week. we can cope without him. he has spoken this week, but i've explained about 1,000 times now. i think he will stay here for a long time as he's never spoken to me about anything else with this situation.\" tevez's touchline dissent came not long after collecting his fifth yellow card of the season. that means the striker will be missing against bottom-placed west ham tomorrow; and that doesn't bode well for city as the club's over-reliance on tevez this season has almost become crippling. the statistics simply don't make easy viewing, with <mark>mancini</mark>'s side winning just once since january when tevez has failed to find his way on to the scoresheet. according to <mark>mancini</mark> that is about to change given the rich talent in the expensive squad that has been assembled at eastlands. \"i think that this is a time when we can try to win without carlos,\" said <mark>mancini</mark>. \"he is an important player for us. but the players that will play will have a good game. i'm sure of that. if we continue to play like we did against bolton and against stoke in the second half we can win without him.\" but we know we must try to score with the other players. there's enough quality there with mario [balotelli], jo, and [adam] johnson. we can do this. carlos is an important player inside the box as he's very dangerous. he is a fantastic player. he is one of the most important players in europe, in the world maybe. for us he is very important. but if we play like we did against bolton, we can still win without him. \"in a week when tevez has quashed speculation that he wants to quit the club, the dependency on the former manchester united striker this season has been eased somewhat in recent weeks thanks to the introduction of balotelli. but tevez remains the vital cog in <mark>mancini</mark>'s wheel. with the italian's faith in the likes of emmanuel adebayor and jo remaining somewhat limited, tevez can perhaps do with a week off before the hectic christmas backlog of games fast approaching. yet given the number of talented players in <mark>mancini</mark>'s squad, the defensive, safety-first approach may have to be put on the back burner if manchester city are to go joint top of the premier league tomorrow afternoon. hodgson hints at new deal for lucas after brazilian finally proves his worth manager ready to gamble on lampard's fitness to end horrendous run what's wrong at chelsea - and will ancelotti be given the time to fix it?"}, {"articleID": "2014101213_00011243_W", "names": {"Brian Vickers": ["Q2112545", "Q4965539"], "Ryan Newman": ["Q18989", "Q525980"], "Jimmie Johnson": ["Q217238", "Q6199355"], "Kurt Busch": ["Q201820", "Q42507470"], "Paul Menard": ["Q16732470", "Q2879369"], "Kyle Larson": ["Q11751789", "Q21184548", "Q5308142"], "Peter Casey": ["Q15040081", "Q16188918", "Q41787474"], "Tony Stewart": ["Q380127", "Q3993311", "Q4648431", "Q56803689", "Q7823492", "Q7823493"], "Michael Mcdowell": ["Q1928579", "Q1928582"], "Josh Wise": ["Q328890", "Q5344899"]}, "date": "2014-10-12", "url": "http://wcnc.com/story/sports/motor/nascar/2014/10/12/kevin-harvick-wins-at-charlotte-advances-in-chase/17148223", "content": "Kevin Harvick wins at Charlotte, advances in Chase Kevin Harvick celebrates in victory lane after winning the Bank of America 500 at Charlotte Motor Speedway. MORE CONCORD, N.C.--Breaking down the Bank of America 500 from Charlotte Motor Speedway: Winner: Kevin Harvick pulled away from Jeff Gordon on the final restart in a green-white-checkered finish after <mark>Brian Vickers</mark>' crash with seven laps remaining brought out the race's final caution. With the win, Harvick earned a slot in Round 3 of the Chase for the Sprint Cup. It is his third win of the season and first since April. \"It's great, to be honest with you,\" Harvick said after the race. \"We know we have the car we need to run up front and win races; things just haven't gone right. This was the night we needed to win.\" Gordon finished second, followed by Jamie McMurray, Joey Logano and Kyle Busch. \"I'm really proud of that finish, really proud of that effort,\" Gordon said. \"Kevin was tough. I knew when he got out front it was going to tough to beat him.\" Fight: Meanwhile, 2012 titlist Brad Keselowski, who also needed a very strong finish or win after a blown tire last week, was 16th. He and fellow Chase driver Denny Hamlin got tangled up on the cool down lap, with Keselowski taking a swipe across the No. 11 Toyota's fender. Hamlin had to be restrained by his crew when he exited his vehicle in the garage. Matt Kenseth, who said he also was hit by Keselowsi under yellow, jumped him as Keselowski was walking betwen the Team Penske haulers. \"He's a champion; he's supposed to know better than that,\" Kenseth said. Race 5: Kevin Harvick does a burnout after winning the Bank of America 500 at Charlotte Motor Speedway to clinch a berth in Round 3 of the Chase. Race 5: Reporters surround Denny Hamlin after he tried to go after Brad Keselowski following the Oct. 11 race at Charlotte Motor Speedway. The cars of Keselowski and Hamlin made contact on the cool-down lap and on pit road immediately after the race ended. Race 5: The No. 2 Team Penske crew pushes Brad Keselowski's car to the garage after he plowed into two cars on pit road following the conclusion of the Bank of America 500. Race 5: <mark>Ryan Newman</mark>, left, spins out as he tries to avoid colliding with a crashing Danica Patrick (not pictured) during the Oct. 11 race at Charlotte Motor Speedway. Race 5: A broken gear shifter forced Dale Earnhardt Jr.'s crew to push him out of his stall during a pit stop in the Bank of America 500 at Charlotte Motor Speedway. Race 4: NASCAR Sprint Cup Series driver Joey Logano celebrates after winning the Hollywood Casino 400 at Kansas Speedway. Race 4: Joey Gase is helped out of his car by safety workers after spinning out and hitting the wall on lap 188. Race 4: Crew members work in the garage on the car of Brad Keselowski, driver of the No. 2 Ford. He crashed due to a tire failure on lap 160. Race 4: Teammates Dale Earnhardt Jr., driver of the No. 88 Chevrolet, and <mark>Jimmie Johnson</mark>, driver of the No. 48 Chevrolet, speak in the garage area while their crews work on their damaged cars. Earnhardt blew a tire on lap 122. Race 4: <mark>Jimmie Johnson</mark> (No. 48) and Greg Biffle (No. 16) wreck on lap 85. Race 3: Jeff Gordon celebrates in victory lane after winning the AAA 400 at Dover International Speedway to advance to the next round of the Chase for the Sprint Cup. Race 3: Greg Biffle was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 21st at the AAA 400 at Dover International Speedway. Race 3: <mark>Kurt Busch</mark> was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 18th at the AAA 400 at Dover International Speedway. Race 3: Aric Almirola was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 28th at the AAA 400 at Dover International Speedway. Race 3: AJ Allmendinger was one of four drivers eliminated from the Chase for the Sprint Cup after finishing 23rd at the AAA 400 at Dover International Speedway. Race 2: Joey Logano applies his name to the next round of the Chase grid after winning the Sylvania 300 at New Hampshire Motor Speedway. Race 2: No Chase driver struggled more at New Hampshire Motor Speedway than Denny Hamlin. First his team had to deal with a fueling malfunction early in the race. Then his No. 11 Toyota collided with David Ragan's No. 34 Ford. Race 2: Kyle Busch needed extensive front-end repairs after a collision with Kasey Kahne during the Sept. 21 race at New Hampshire. Race 2: Matt Kenseth spins into the wall after colliding with <mark>Paul Menard</mark> during the Sylvania 300 at New Hampshire Motor Speedway. Race 2: Drivers make their way into Turn 2 during the Sylvania 300 at New Hampshire Motor Speedway. Race 1: Top seed Brad Keselowski does a burnout after winning the MyAFibStory.com 400 at Chicagoland Speedway to kick off the Chase. Race 1: Jeff Gordon (24) and <mark>Kyle Larson</mark> (42) finished second and third, respectively, at Chicagoland Speedway. Race 1: Aric Almirola reacts during an interview with ESPN's Jamie Little after blowing an engine at Chicagoland Speedway. Almirola finished 41st. Race 1: Carl Edwards (99) pits after blowing a tire during the MyAFibStory.com 400 at Chicagoland Speedway. Edwards finished 20th. Race 1: Kyle Busch (18) leads the field as the green flag waves to start the MyAFibStory.com 400 at Chicagoland Speedway. Race 5: Kevin Harvick does a burnout after winning the Bank of America 500 at Charlotte Motor Speedway to clinch a berth in Round 3 of the Chase. (Photo: <mark>Peter Casey</mark>, USA TODAY Sports) FullscreenNext Slide Bad start: Kenseth was penalized after a crew member cut a decal off the right rear quarterpanel - apparently at NASCAR's request - before the race but after all cars had cleared inspection. That was considered an unapproved adjustment, so he was sent to the rear of the field to start the race. He finished 19th and now also is in danger of missing Round 3. Out for revenge: Joey Logano turned Danica Patrick into the wall with 86 laps to go, and she asked for - and was granted - permission to retaliate against the Chase points leader. \"Too bad taking the 22 out doesn't hurt his Chase because he won last weekend,\" she said. Broken shifter puts Dale Earnhardt Jr. on Chase brink Big shift: With just under 200 laps to go, Earnhardt Jr. reported a broken shifter. He pitted several times for repairs, but they didn't work and he was forced to go on another green-flag run while waiting for a replacement. At one point, his crew had to push him off pit road during a green-flag stop and he lost a lap. Tires all good: Despite worries about blown tires like the ones at Kansas Speedway, teams didn't experience any major issues at Charlotte. Heavy rains soaked the track in the afternoon, leaving it green. But the lack of rubber on the 1.5-mile surface--which often can lead to faster tire wear--were a non-issue. Blown up: Clint Bowyer's Toyota Racing Development engine blew up less than 100 laps into the race, leaving he and his team quite unhappy. \"Everyone else's (engine) lived every time they (freaking) run it,\" crew chief Brian Pattie radioed to Bowyer. \"At least they make good power,\" Bowyer said, moments after he said the failure \"put us out of our (freaking) misery.\" What channel is it on? NASCAR fans expressed their outrage on Twitter after the first 25 laps of the race were unable to be seen anywhere but the track. A college football game between TCU and Baylor on ABC ran late, which forced ESPN to scramble for another option. Officials settled on ESPNEWS, but a preseason NBA game on that network went to overtime. The race was then set to be played on ESPN3, an online network, but it never appeared. Finally, ABC started showing the race after the football game concluded - just in time for a competition caution. \"We are disappointed that our fans were unable to see the start of tonight's race,\" NASCAR said in a mid-race statement. \"We do all we can with the networks to avoid delays when live sports run late. We're grateful for the passion of our fans and are thankful to those now watching on ABC.\" ESPN later issued a statement of its own: \"We started the race on ESPN3, which is available to 95 million homes. We're fortunate to have multiple TV networks available, but tonight there were live events on all of them, including an epic football game on ABC and an overtime NBA game on ESPNEWS. We joined the race on ABC at lap 26.\" Follow Gluck on Twitter @ jeff_gluck SATURDAY'S BANK OF AMERICA 500 RESULTS 1. (7) Kevin Harvick, Chevrolet, 334 laps, 145.3 rating, 48 points. 2. (2) Jeff Gordon, Chevrolet, 334, 126.8, 43. 3. (18) Jamie McMurray, Chevrolet, 334, 112.7, 42. 4. (13) Joey Logano, Ford, 334, 92.3, 40. 5. (1) Kyle Busch, Toyota, 334, 115.5, 40. 6. (24) <mark>Kyle Larson</mark>, Chevrolet, 334, 107.5, 39. 7. (5) <mark>Ryan Newman</mark>, Chevrolet, 334, 94.4, 38. 8. (10) Carl Edwards, Ford, 334, 84.5, 37. 9. (3) Denny Hamlin, Toyota, 334, 96.2, 36. 10. (19) Kasey Kahne, Chevrolet, 334, 83.5, 34. 11. (11) <mark>Kurt Busch</mark>, Chevrolet, 334, 111.9, 34. 12. (26) AJ Allmendinger, Chevrolet, 334, 79.1, 32. 13. (20) Austin Dillon, Chevrolet, 334, 82.1, 32. 14. (23) Martin Truex Jr., Chevrolet, 334, 86.1, 30. 15. (16) Justin Allgaier, Chevrolet, 334, 72.2, 30. 16. (17) Brad Keselowski, Ford, 334, 97.5, 29. 17. (21) <mark>Jimmie Johnson</mark>, Chevrolet, 334, 91.7, 27. 18. (12) Greg Biffle, Ford, 334, 66.8, 26. 19. (22) Matt Kenseth, Toyota, 334, 64.8, 25. 20. (9) Dale Earnhardt Jr., Chevrolet, 333, 85.4, 25. 21. (4) <mark>Tony Stewart</mark>, Chevrolet, 333, 78.8, 23. 22. (15) Aric Almirola, Ford, 332, 63, 22. 23. (32) Landon Cassill, Chevrolet, 331, 46.9, 0. 24. (28) Ricky Stenhouse Jr., Ford, 331, 56.2, 20. 25. (27) Marcos Ambrose, Ford, 331, 54.1, 19. 26. (14) Danica Patrick, Chevrolet, 331, 61.8, 18. 27. (30) Reed Sorenson, Chevrolet, 330, 49.9, 17. 28. (36) Cole Whitt, Toyota, 330, 43.1, 16. 29. (31) <mark>Michael McDowell</mark>, Ford, 330, 50.5, 15. 30. (33) Alex Bowman, Toyota, 330, 46.6, 14. 31. (29) Casey Mears, Chevrolet, 329, 55.2, 13. 32. (37) David Gilliland, Ford, 329, 40, 12. 33. (35) Michael Annett, Chevrolet, 328, 41.7, 12. 34. (34) David Ragan, Ford, 328, 35.1, 10. 35. (42) Corey LaJoie, Ford, 326, 32.9, 0. 36. (40) Timmy Hill, Chevrolet, 326, 31.9, 8. 37. (8) <mark>Brian Vickers</mark>, Toyota, engine, 325, 79.9, 7. 38. (41) J.J. Yeley, Toyota, 325, 29.5, 0. 39. (43) Blake Koch, Ford, 322, 26.3, 0. 40. (39) Brett Moffitt, Toyota, 320, 25.5, 4. 41. (38) <mark>Josh Wise</mark>, Chevrolet, rear gear, 178, 38.8, 3. 42. (6) <mark>Paul Menard</mark>, Chevrolet, engine, 134, 58.6, 2. 43. (25) Clint Bowyer, Toyota, engine, 94, 56.5, 1 .--Race Statistics Average Speed of Race Winner: 145.346 mph. Time of Race: 3 hours, 26 minutes, 49 seconds. Margin of Victory: 0.571 seconds. Caution Flags: 8 for 39 laps. Lead Changes: 32 among 14 drivers. Lap Leaders: Ky.. <mark>Busch</mark> 1-13; J. Gordon 14-27; M. Annett 28; D. Earnhardt Jr. 29; Ky.. <mark>Busch</mark> 30-36; J. Gordon 37-74; Ku. <mark>Busch</mark> 75; D. Earnhardt Jr. 76; B. Keselowski 77-78; J. Gordon 79-97; D. Earnhardt Jr. 98-99; J. McMurray 100-104; K. Harvick 105-139; J. Gordon 140; K. Harvick 141-187; J. Gordon 188; B. Keselowski 189-190; K. Harvick 191-222; K. <mark>Larson</mark> 223; K. Harvick 224-237; A. Dillon 238-242; Ky.. <mark>Busch</mark> 243-263; K. <mark>Larson</mark> 264-267; B. Keselowski 268-271; D. Hamlin 272-293; K. Harvick 294-310; J. Gordon 311; Ku. <mark>Busch</mark> 312; A. Dillon 313; R. <mark>Newman</mark> 314; C. Edwards 315; J. Allgaier 316-317; K. Harvick 318-334. Leaders Summary (Driver, Times Led, Laps Led): K. Harvick, 6 times for 162 laps; J. Gordon, 6 times for 74 laps; Ky.. <mark>Busch</mark>, 3 times for 41 laps; D. Hamlin, 1 time for 22 laps; B. Keselowski, 3 times for 8 laps; A. Dillon, 2 times for 6 laps; J. McMurray, 1 time for 5 laps; K. <mark>Larson</mark>, 2 times for 5 laps; D. Earnhardt Jr., 3 times for 4 laps; Ku. <mark>Busch</mark>, 2 times for 2 laps; J. Allgaier, 1 time for 2 laps; R. <mark>Newman</mark>, 1 time for 1 lap; C. Edwards, 1 time for 1 lap; M. Annett, 1 time for 1 lap. Wins: B. Keselowski, 5; J. Logano, 5; J. Gordon, 4; D. Earnhardt Jr., 3; K. Harvick, 3; J. <mark>Johnson</mark>, 3; C. Edwards, 2; A. Allmendinger, 1; A. Almirola, 1; Ku. <mark>Busch</mark>, 1; Ky.. <mark>Busch</mark>, 1; D. Hamlin, 1; K. Kahne, 1."}, {"articleID": "2013120309_00006941_W", "names": {"Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"]}, "date": "2013-12-03", "url": "http://news.ninemsn.com.au/sitecore/content/news/news/entertainment/2013/12/03/11/49/video-emerges-of-walker-fatal-crash", "content": "December 03, 2013: CCTV vision has been released showing the exact moment that <mark>Paul Walker</mark> and Roger Rodas were killed in a high speed crash, resulting in a huge explosion. The first video has emerged of the car accident that killed action movie star <mark>Paul Walker</mark> and his friend Roger Rodas. Civoniceva turns down tilt at Qld politics Australian nude pic suspect indicted in US Californian surfer freaked out about seal Rooftopping: the risky trend in photography The CCTV video posted online by TMZ, shows a street adjacent to the smash, with a massive ball of flames rising above the trees. Cars are seen moving to the side of the road as a massive black plume of smoke rises into the sky. Sources connected to Always Evolving, the garage co-owned by <mark>Walker</mark> and Porsche driver Roger Rodas told TMZ they observed \"evidence of a fluid burst and subsequent fluid trail before the skid marks at the accident scene\" . They added that the absence of skid marks almost up to the point of impact suggested the driver was not in control of the car's steering. There were no cars immediately in front of or behind the car at the time of the crash, leading to speculation the Porsche may have been involved in a high-speed street race. December 01, 2013: Drivers that witnessed the burning wreck of the crashed Porsche, in which Hollywood actor <mark>Paul Walker</mark> tragically died, rushed to offer assistance and call an ambulance. Both Rodas and <mark>Walker</mark> were killed instantly in the accident in the Los Angeles suburb of Valencia. Rodas was driving at the time and it is believed that speed was a factor in the fatal smash. The likely cause of the failure that triggered the crash has been identified as a powering steering fluid leak. Hollywood heartthrob <mark>Walker</mark> had starred in six of seven of the Fast and the Furious films, including one that is yet to be released. The 40-year-old has also appeared in films like Pleasantville, She's All That and Varsity Blues. Police have now issued a warning to fans of <mark>Walker</mark> who have been pulling stunt manoeuvres and burn-outs near the accident site in tribute to the late actor. The father of late actor <mark>Paul Walker</mark> spoke to CBS about his famous son's sudden death. <mark>Walker</mark>'s girlfriend Jasmine Pilchard-Gosnell reportedly collapsed in shock after she found out about his death. The couple apparently started dating when he was 33 and she was 16. She is now being comforted by her mother, her uncle said. Ms Pilchard-Gosnell and <mark>Walker</mark>'s 15-year-old daughter, Meadow, were at the fundraiser, held by Reach Out Worldwide to raise money for the Philippines. An engineer at the charity said he received a phone call from his son at the scene of the crash relaying the tragic news. \"<mark>Paul</mark>'s girlfriend was standing next to me when I got the phone call,\" the engineer, Jim Thorp, told Hollywood Life. December 02, 2013: Witnesses have told how they were helpless to react to the fiery scene where actor <mark>Paul Walker</mark> and a driver crashed in their Porsche. \"When I told her what happened she fell, she collapsed.\" Also reportedly devastated in the crash is <mark>Walker</mark>'s ex-girlfriend Aubrianna Atwell, whose father died five days before the car accident. Author: Nick Pearson. Approving editor: Martin Zavan. Actor <mark>Paul Walker</mark> has been killed in a fiery car crash and explosion in Southern California. \\ n The 40 year-old was the passenger in his friend's Porsche when it veered off the road and slammed into a tree before exploding. \\ nBoth were pronounced dead at the scene. \\ nWalker will always be remembered for his role as Brian O'Conner in"}, {"articleID": "2009011400_00033038_W", "names": {"Claire Smith": ["Q27996325", "Q5125314", "Q57038564"]}, "date": "2009-01-14", "url": "http://nationofshopkeepers.wordpress.com/2009/01/14/liar-liar-pants-on-fire/", "content": "january 14, 2009 by harry haddock harry haddock isn't my real name. it's a pseudonym. i know, i know, you're really pissed off that the fish dj \"ing in my facebook profile isn't a photo of me at all. in fact, that is a fake photo and large haddock cannot rock the ministry of sound. bummer, huh? so, what right on earth have i got to slag of a bbc / nu labour alliance councilor for posting under a pseudonym? simple. i don't need to. like all liars ~ if you give them enough rope. compare; the long-standing councilor said in his email:\" as far as i am concerned this has and always will be a legitimate means of making comments. \"it is perfectly legitimate to use pseudonyms as indeed many others do.\" investigations showed omegaman was registered with an address containing mr grower's name. got that? bigging your real self up using a pseudonym is all fine and dandy. so fine and dandy, in fact, that...he initially denied being the author, saying it could be anyone, even santa claus, but later admitted it to the newspaper and said he would carry on but would use a different pseudonym ....it's best to blame father christmas. anyway, just so that cllr grower (a surname suitable for his pinocchio like nose), doesn't feel too bad, i will include this balance; leader of the council's liberal democrats, <mark>claire smith</mark>, said it was deceitful. \"it's a little bit sad to say the least but it does have serious connotations,\" she said. \"things like this cannot happen or the trust breaks down between councilors and members of your ward.\" good point, duck. i mean, imagine describing yourself as a liberal and a democrat when you believe in...oh, no, it's ground hog day."}, {"articleID": "2018100217_00114406_W", "names": {"President Bush": ["Q207", "Q23505"]}, "date": "2018-10-02", "url": "http://qz.com/africa/1408683/melania-trump-will-face-a-hurdle-in-africa-no-other-first-lady-has-her-husband/", "content": "By Abdi Latif Dahir 7 hours ago On her debut major solo international trip, first lady Melania Trump is headed on a five-day visit to Ghana, Malawi, Kenya, and Egypt to promote children's welfare, highlight successful US humanitarian and development work, and focus on tourism and conservation efforts. By flying without the president, Melania Trump will be following in the footsteps of her forerunners who toured the continent without their husbands. Pat Nixon was the first to go it alone, traveling to Liberia, Ghana, and Cote d’Ivoire in 1972 as a representative of president Richard Nixon. Hillary Clinton took her daughter Chelsea to five African states in 1997, while Laura Bush made five trips alone in support of president <mark>Bush</mark>'s global health initiatives. Michelle Obama traveled unaccompanied to South Africa in 2011, and in 2016 took her daughters Malia and Sasha to Liberia and Morocco to promote education for girls. Reuters Hillary Clinton arrives in the Masai village of Olturoto in Tanzania in 1997. But what sets apart the current first lady's international trip from her predecessors is that it comes at a time when US-Africa policy has been set adrift. Since coming to office, president Trump's administration has shown that it cares little, and understands even less, about the continent. Trump has reportedly called African states \"shithole,\" imposed travel bans on nations including Somalia and Libya, delayed the appointment of key officials to the continent, and even applauded a fictional African state during a meeting with African leaders. Trump also propagated false allegations of \"large scale killing\" of white farmers in South Africa, expediently ignoring data that shows violence against white farmers was on the decline. REUTERS/Jason Reed Laura Bush in Nigeria in 2006. In so far as there's a policy, the administration is focused on security and countering China's influence in the continent. This problematization of the deepening Sino-Africa relations was a narrative touted by former secretary of state Rex Tillerson, who was fired during his first and last trip to Africa. Last year, Trump also proposed to slash funding for HIV and AIDS programming, cuts that could lead to four million deaths and 26 million new infections in sub-Saharan Africa over the next 15 years, according to advocacy organization ONE campaign. Despite all this, Trump said last week that both he and his wife \"love Africa. Africa is so beautiful. The most beautiful part of the world, in many ways.\" Melania has also said her trip was rooted in globalism and was meant to encourage \"open dialogue and the exchanging of ideas\" --a point of contrast with her husband's \"America first\" fervor. REUTERS/Youssef Boudlal Michelle Obama in Morocco in 2016. Amid this conflicting messaging, experts are wondering how effective Melania's trip could be and if she can help improve and repair US image abroad. Myra Gutin, a professor at Rider University in New Jersey who studies American first ladies says that she found the choice of a trip to Kenya \"interesting\" given that Melania supported her husband's claims that Obama wasn't born in Hawaii but in Kenya where his father was from. Gutin, however, notes Melania can leverage the goodwill and \"positive vibe\" associated with first ladies given they aren't elected officials. As an intensely private first lady associated with a chaotic White House, she said she could also use this opportunity to engender a constructive portrait by speaking up on critical issues including healthcare and education. \"She can show that the United States cares about these things, not just at home but around the world.\" Sign up to the Quartz Africa Weekly Brief here for news and analysis on African business, tech and innovation in your inbox Tags"}, {"articleID": "2012021001_00091383_W", "names": {"Chris Cooper": ["Q16226896", "Q2414835", "Q273208", "Q47093443", "Q5106257", "Q7411265"]}, "date": "2012-02-10", "url": "http://businessweek.com/news/2012-02-09/dinosaur-bridge-leads-tokyo-push-to-ease-traffic-boost-economy.html", "content": "feb. 10 (bloomberg)--tokyo's \"dinosaur bridge\" opens to vehicles this weekend after 10 years of construction as the world's largest metropolis tackles traffic jams that slow vehicles to half of japan's average highway speed. the 2,618-meter (1.6-mile) bridge, whose nickname derives from its shape, will bring 19 billion yen ($246 million) in economic benefits a year as it almost halves journey times to container terminals in tokyo bay, the government estimates. built at an estimated cost of 113 billion yen, it's forecast to carry about 32,000 vehicles a day between eastern tokyo and a man-made island, where a new container terminal is being built. the four-lane bridge will be followed by a ring road and two larger loop lines around japan's capital. the improvements, spurred by the city's unsuccessful bid to host the 2016 olympics, are intended to cut traffic jams in and around the metropolis of more than 35 million people. \"the new bridge will ease congestion in the whole waterfront area,\" said shinichi ishii, a senior consultant for public management and strategy at nomura research institute inc. \"there is a premium on the value of time in the area, and the economic impact could be two or three times more than government estimates.\" population growth as migration from the countryside and smaller cities boosts tokyo's population, the city is increasing use of its waterfront by reclaiming land and building islands in tokyo bay. the three fastest-growing prefectures in japan from 2005 to 2010 were all in the greater tokyo region, led by tokyo prefecture, which increased its population 4.7 percent to 13.2 million, according to japan's statistics bureau. haneda airport, also built on reclaimed land in the bay, opened a fourth runway and started 24-hour operations in 2010. to expand container trade, japan has selected the port of tokyo, the nation's busiest cargo handler, along with nearby kawasaki and yokohama as the main focus for port investment in the region. the new container terminal being built on the man-made island will be able to handle ships capable of carrying 10,000 boxes, according to the port office, which is part of the national government's transport ministry. the tokyo gate bridge, as it is officially known, will shorten the travel time to the island from the city's shin-kiba district to 10 minutes from 19 minutes, according to the tokyo port office. it will also give truckers a choice of routes to the city's main aomi and oi container terminals. below cost the bridge, which weighs about 36,000 tons, was built for less than the original estimate of about 140 billion yen, thanks to new techniques and materials, said koki hosaka, a civil engineer at tokyo ports. it is built to withstand an earthquake directly under tokyo, he said. the height of the bridge was limited since it is on the approach to haneda airport, meaning that a suspension bridge wasn't an option, hosaka said. the construction also needed to be wide and high enough underneath for ships to pass, he said, leading to the final design that resembles two dinosaurs facing off. tokyo-based kawada industries inc. spent two years building the dinosaur-shaped trusses for the bridge, according to yoshifumi kodama, a manager for the project. the company used three cranes on boats to lay the bridge on the support columns, he said. \"nerve wracking'\" it hadn't been done for a bridge of this type in japan for 16 years, \"said kodama.\" it was very nerve wracking as we had to do it in one shot. \"it will be followed by a new tokyo ring road, set to be completed by march 2014, and two new larger loop lines that are under construction. while roads and bridges can help cut travel time for truckers, the government could do more to help by extending operating hours at container terminals, said toshio araki, head of container operations at the tokyo trucking association.\" the problem is with processing at the terminal rather than the roads, \"araki said.\" it's extremely crowded. the gates are only open during the day and so trucks have to line up and wait. it can take anything from a couple of hours to more than 16 hours. \"the bridge, which has a walkway for pedestrians, is already helping to spur tourism in the area. sightseeing boat operator zeal cruise division has almost sold all its seats this month for its 80-minute tours of the bridge.\" the tours have become popular for families with kids, \"hirano takumi, zeal's president, said in an interview.\" we're almost completely booked for the opening month and next month. we want overseas tourists to come and see japan's new mammoth bridge. \"--editors: terje langeland, teo chian wei to contact the reporters on this story: <mark>chris cooper</mark> in tokyo at ccooper1 @ bloomberg.net; kiyotaka matsuda in tokyo at kmatsuda @ bloomberg.net"}, {"articleID": "2013032606_00009052_W", "names": {"Scott Henderson": ["Q1299535", "Q708879", "Q7436487"], "Clint Eastwood": ["Q2979323", "Q43203"]}, "date": "2013-03-26", "url": "http://examiner.com/article/monday-mornings-recap-everyone-faces-the-music-truth-or-consequences", "content": "monday mornings have to be almost over? there are only two episodes left after tonight and there hasn't been a weak one yet. this week's chapter opens with a random new guy getting 311 \"ed for giving a patient a lethal dose of adrenaline. rng, whose name is stewart delany and who is played by ioan gruffudd, does a miserable job of defending himself and gets fired, much to the shock of everyone else in the room, except for maybe park. speaking of park, he's brushing up on his english when wilson walks into his office. park immediately susses out that wilson wants something, which happens to be\" a little insight \"into what he can expect at his upcoming deposition. park tells wilson he should be ashamed for sleeping with another man's wife and ruining his marriage. you have to love park's honesty. the one good thing about this development is that it means we get to see more of jason gray-stanford as hospital counsel <mark>scott henderson</mark>, who's agreed to come to wilson's defense. before much can be said, though, tina interrupts the pending deposition and asks to speak privately to her soon-to-be ex-husband, wanting to know what he's\" looking to prove. \"not that he doesn't have every right in the world to be livid or anything. wake up, woman. meanwhile, dr. delany is made to face the parents of the patient he accidentally killed, with hooten straight-up admitting to the distraught couple that she died because of their incompetence. villanueva might be the giant in the room, but is there anyone scarier in this hospital than hooten? not by a long shot. elsewhere at chelsea general, sydney, villanueva and tierney are having a difference of opinion on their next case, that of a guy who tried to jump to his death, and michelle teams up with park to handle a patient. neither of these things goes well, with villanueva saying he might punch tierney and park declaring his patient braindead. he and michelle have to break the news to the woman's distraught significant other, who asks to say goodbye, and wants to know what will happen to her organs. though she wasn't an organ donor, he thinks she'd be happy if she helped save someone...as long as it's not the guy who tried to commit suicide, which conflicts with their religious beliefs. mark ridgeway's lawyer wants to know the details of tina and wilson's affair, which apparently started\" a little over a year ago, \"according to wilson. asked if it mattered that she was married, he hesitates before answering in the affirmative, and walks out when the lawyer wants to know how many times he slept with tina. <mark>henderson</mark> confronts wilson afterward, saying that the case is very real and that it's going to have a massive price tag attached however the chips fall. frustrated by their inability to secure the transplant they need for their patient, villanueva and sydney are surprised when the jumper indicates that he didn't try to kill himself - he was pushed. this prompts the arrival of the police, as well as fran horowitz. villanueva shocks everyone when he says that the patient's deadbeat father is the one who shoved him off the roof.\" i guess he didn't want to be found, \"the big cat says, adding that dad is in police custody. with <mark>henderson</mark>'s words in his head, wilson reluctantly returns to the table to finish his deposition, with the lawyer wanting to know how exactly he started sleeping with his married colleague. <mark>henderson</mark> cuts off the dialogue after wilson says he could name 20 other relationships or affairs at chelsea general, realizing that the lawyer intends to go after not just the doctor, but the hospital. furthermore, that wrinkle creates a conflict of interest for <mark>henderson</mark>, who advises wilson to find new counsel and settle the case before he gets\" crushed. \"everyone else brings their case in front of hooten, looking for guidance. villanueva asks his teammates if they think they can really save the patient, to which a surprisingly affected tierney replies,\" his father pushed him off a roof, i'm not tossing him under a bus. i will save this kid. \"wow, tierney's actually starting to get likeable, isn't he? michelle talks again with delany, who's leaving portland for los angeles, but wants her to keep in touch. he asks for her to give him a moment, and when she pulls away, we see they've been holding hands, so maybe tina and wilson aren't the only two coworkers personally involved at the hospital. it's no surprise that michelle goes to see tina for guidance, but tina tells her that hooten won't change his mind about dismissing delany. tierney, villanueva and sydney head back to the or and seem to have saved their patient, but before they can celebrate too much, are called to another 311 meeting in which hooten addresses both tina and wilson, quipping,\" what happens in vegas doesn't always stay in vegas, does it? \"if somebody somehow didn't know those two were sleeping together, they do now. hooten moves on to the other three docs, seeming to be complimentary, until he brings up the unflattering comments sydney and tierney first made when they thought their patient was a lost cause, and admonishes villanueva for not chastizing them. he accuses them of not really caring until they knew their case was an attempted homicide rather than an attempted suicide. hooten is, as usual, annoyingly right. villanueva sticks his head into the boss's office later and asks him if he's okay. as for tina and wilson, they're at the dive bar. tina asks wilson if he's okay and tries to take sole responsibility for their affair, but he disagrees with her, pointing out that she had something to lose while he didn't.\" as far as i'm concerned, my behavior was worse than yours here, \"he says.\" there are consequences to things. \"he tells her he wants the thing between them to have meaning, maybe just to ease his guilt, which is the most awkward and unflattering way in the history of ever to ask someone out. she doesn't really answer him, but she doesn't leave, either. speaking of leaving, delany is in the process of doing so, when hooten finds him in the parking garage and tries to reassure him that he's still a good doctor. delany cuts him off and tells him\" it's not just the right call, it's the only one. \"they wish each other well before hooten leaves delany to continue his journey to los angeles. while the emphasis on the show's weakest plotline (the affair between tina and wilson) means that this isn't the best episode of to date, the series still comes up with the compelling intellectual dilemmas that have made it such a pleasure to watch. the script goes out of its way for the audience to feel sympathetic toward axed doctor delany, while at the same time we know he absolutely has to pay the price for a fatal mistake. likewise, hooten is spot on in calling out tierney, sydney and villanueva for their initial reaction to their patient's circumstances, but were we in their position, would we also hesitate to give our best to a cause we honestly believed to be hopeless? you can see these situations both ways, which is what makes the series remarkable. it doesn't tell the audience which side of the argument is right or wrong; rather, it's up to the audience to decide how they feel, and in doing so, question how they might respond. it provokes thought, not just a reaction. hopefully, the personal drama will wrap itself up in time, and the series can continue to tell stories that not only entertain, but challenge us as people, too. monday mornings fans should also be sure to check out keong sim on the big screen in olympus has fallen, in theaters now. you can read the bftv interview with keong about the movie\" monday mornings' star keong sim on the big screen in \"olympus has fallen' lindsay may go to jail since\" lockdown rehab \"doesn't exist. 10 photos what do paris hilton and <mark>clint eastwood</mark> have in common with cops? dog is awarded world record for bark that is louder than a pneumatic drill examiner.com is the inside source for everything local. we are powered by examiners, the largest pool of passionate contributors in the world."}, {"articleID": "2017050120_00088591_W", "names": {"Steven Joyce": ["Q22667650", "Q7614885"], "Richard Stratton": ["Q17021852", "Q26777006", "Q7329276"]}, "date": "2017-05-01", "url": "http://pagesix.com/page/2/?_ga=1.93212506.652403088.1488071024", "content": "Page Six Lamar Odom is selling his Florida home for $5.2 million...Trending Now Katy Perry bombs with Obama joke Sightings SEE ALL Now On Copyright trial about Eminem's \"Lose Yourself' begins May 1, 2017 | 1:31 pm In 2014, when the case was filed, lawmaker <mark>Steven Joyce</mark> said he thought the use of the song was\" pretty legal. \"\"Fixer Upper' star fires back at former partners' lawsuit May 1, 2017 | 11:33 am Last week, Magnolia's cofounders John L. Lewis and <mark>Richard</mark> L. Clark filed a $1 million lawsuit against Gaines. Fyre Festival called a\" get-rich-quick scam' in $100 million suit May 1, 2017 | 11:20 am \"The island isn't private, as there is a Sandals resort down the road, and Pablo Escobar never owned the island,\" the complaint says. Former drug \"Kingpin' on why Trump should leave pot alone May 1, 2017 | 11:00 am\" There's something about freeing the consciousness that comes with marijuana that makes it for difficult people to control, \"<mark>Richard Stratton</mark> explained."}, {"articleID": "2019080616_00814689_W", "names": {"Colin Harris": ["Q5145183", "Q5145184"], "François Bonnardel": ["Q3084026", "Q58880058"], "Eric Girard": ["Q39737048", "Q601036"]}, "date": "2019-08-06", "url": "https://www.cbc.ca/news/canada/montreal/montreal-highway-deadly-collision-public-help-1.5237078?cmp=rss", "content": "Montreal Public's help sought to determine cause of Laval highway crash that left 4 dead, 12 injured Quebec provincial police are trying to determine the cause of a deadly collision on Highway 440 north of Montreal on Monday afternoon, and working with the coroner's office to identify the victims. Social Sharing Police working with the coroner's office to ID victims <mark>Colin Harris</mark> · CBC News · Posted: Aug 06, 2019 8:08 AM ET | Last Updated: August 6 Two trucks were involved in Monday's fatal collision on Highway 440 north of Montreal. (Radio-Canada) comments Quebec provincial police are seeking the public's help in trying to determine the cause of a collision on Highway 440 about 27 kilometres north of Montreal on Monday afternoon that left four people dead and 12 injured. Around 3:30 p.m. ET, a small car collided with a semi-trailer truck on the westbound section of highway in Laval near the exit to Highway 15. The two vehicles then hit a second truck, starting a pileup involving another six vehicles. Provincial police's major crimes unit in Mascouche is leading investigation, and is working with the coroner's office to identify all the victims. Police downgraded the number of injured from 15 to 12 on Tuesday. Three are in critical condition in hospital. The other nine are first responders who were treated for smoke inhalation. Police have collected statements from witnesses, but are asking anyone who saw the collision or filmed video to contact them, which can be done anonymously, at 1-800-659-4262. \"Some of the vehicles are in such a damaged state that it's not easy to find the [serial] numbers that identify them,\" said Sûreté du Québec Sgt. Daniel Thibodeau on Tuesday morning. A small car collided with a semi-trailer truck on the highway in Laval, about 27 kilometres north of Montreal. The two vehicles then hit a second truck, starting a pileup. (Submitted by Peter Christakos) Terry Blanchard, who works by the scene of the collision, heard two loud booms, and when he looked out the window, it was clear it was a deadly accident. \"All we saw were flames. One truck looked like it hit the back of another truck,\" he said. \"I've never seen anything like that before.\" He said the smoke went so high that it blocked out the sun. Driving in the area regularly, he said, the configuration of the highway where it connects with Highway 15 could have contributed to the accident. But he also said he often sees reckless drivers on the road. \"You've got people cutting in. There's just a lot going on at once.\" Mario Lévesque said he sees accidents at that stretch of highway all the time, and drivers often go from travelling at high speeds to being bumper to bumper. \"There are regularly three or four accidents per week,\" he said, though not as severe as Monday's collision. Quebec Transport Minister <mark>François Bonnardel</mark>, centre, speaks to reporters a day after the fatal collision with Finance Minister <mark>Eric Girard</mark>, left, and Laval Mayor Marc Demers, right. (Radio-Canada) Painted line to be extended \"My first thoughts go to the victims and their families,\" Quebec Transport Minister <mark>François Bonnardel</mark> said Tuesday alongside Laval Mayor Marc Demers. <mark>Bonnardel</mark> said the ministry will look at provincial police's report of the collision to see what improvements can be made, but in the meantime, the painted line separating the service lane from the highway would be extended. The new line will span a few hundred metres, to dissuade motorists from moving into the service lane \"at the last minute,\" he said. While he acknowledged the stretch of road was built decades ago when congestion was not as severe, <mark>Bonnardel</mark> said it is not any more dangerous than other interchanges in the Montreal area. \"The city will work in collaboration with the ministry to find solutions,\" Demers said. Watch footage from the collision below. Fiery wreckage is seen from a pileup involving two trucks and seven cars on westbound Highway 440 in Laval. Four people died in the collision. 1:07 Highway reopened On Monday, a large fire ignited from the collision and smoke could be seen kilometres away. One of the trucks had about 10 propane tanks inside, but the Laval fire department said Tuesday that the tanks were empty. The fire department had the blaze under control around 5 p.m. that day. Crash scene specialists spent overnight collecting physical evidence, and the busy highway was reopened to traffic around 5 a.m. Tuesday. Thibodeau said it's too early to determine the cause of the crash. \"Nothing is off the table at this point,\" he said. \"We're still gathering as much information as we can and the public's help would be much appreciated.\" With files from Jay Turnbull and Radio-Canada CBC's Journalistic Standards and Practices | About CBC News Report Typo or Error | Send Feedback Related Stories 4 dead, 12 injured in multi-vehicle accident on highway north of Montreal Car crash on Highway 440 in Laval leaves driver dead Man seriously injured as vehicle gets stuck under flatbed truck in Laval Comments To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted. By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time."}, {"articleID": "2013112820_00004394_W", "names": {"Ricky Reyes": ["Q16145690", "Q3935060"]}, "date": "2013-11-28", "url": "http://manilastandardtoday.com/2013/11/28/personalized-christmas-gifts-/", "content": "Avoid the rush, do your Christmas shopping early. \"At a time like this when our Visayan brothers are suffering from the death and tragedy wrought by Yolanda, some say that the usual color, fun and merriment on Christmastime must take a back seat. But I believe the Yuletide Season is for the children, especially those who still believe that Santa comes once a year to bring them cheer. So, why disappoint the kids?\" says Gandang <mark>Ricky Reyes</mark> Todo Na Toh host <mark>Ricky Reyes</mark>. Tomorrow, 9 a.m. on GMA News TV, <mark>Reyes</mark> takes the audience to different places in Metro Manila and suburbs known for the beautiful decors and colorful lights. <mark>Reyes</mark> also shares tips where to order personalized items such as cups, glasses, mugs, ball pens, ashtrays in affordable prizes. A popular chef gives tips as well. \"Even simple and cheap dishes well cooked and deliciously concocted can make Noche Buena a feast fit for a family bonding,\" he says."}]