[{"date": "2018-01-16", "url": "https://sg.finance.yahoo.com/news/stock-levels-watch-retailers-still-too-high-executives-160744345--finance.html", "content": "View photos Visitors look at watches at the Montblanc stand at the \"Salon International de la Haute Horlogerie\" (SIHH) watch fair, organised by the Richemont group, in Geneva, Switzerland, January 15, 2018. REUTERS/Denis Balibouse More By Silke Koltrowitz GENEVA (Reuters) - Inventory levels at multi-brand watch retailers are still too high, two top industry executives said on Tuesday, suggesting a robust recovery in luxury watch sales may be some way off. Swiss watchmakers are just emerging from a severe downturn, helped by a recovery in demand among their biggest customer group - Chinese shoppers - and echoing a broader pick-up in luxury goods industries from fine wines to designer clothes. But the problem of overproduction and resulting excess stock at watch retailers - which forced some labels into buybacks, in part to prevent their wares from being sold off at steep discounts - is still present, the executives said. \"Inventories at retailers are still huge, especially in Asia. Some brands bought back unsold watches, but the problem has not been solved,\" Richard Mille, head of the eponymous independent label told Reuters in an interview at the SIHH watch fair in Geneva. \"It seems that some people in the watch industry just don't learn the lessons of the past. As soon as demand picks up, they flood the market,\" he said. Laurent Dordet, head of Hermes' <HRMS. PA> watch business, said the brand's own stock levels were healthy. But \"many of our competitors still have overcapacity and produce too many watches that jam the retail network,\" he said. The mood in the aisles of the Geneva show, as well as on luxury group LVMH's <LVMH. PA> boat moored in the city, was brighter than in previous years, with brands such as Audemars Piguet and LVMH's Hublot forecasting further growth in 2018. But the sales recovery so far has been largely limited to watchmakers' own stores, while multi-brand retailers are struggling as many have cash tied up in outdated models that no longer sell. Cartier-owner Richemont <CFR. S>, which made large inventory buybacks during the downturn, reported a 13 percent rise in constant currency sales in its own stores in the quarter to Dec. 31, but a 3 percent decline at third-party retailers that still represent more than a third of group sales. Swiss watch exports, which reflect brands' sales to retail partners, rose a modest 2.8 percent in the first eleven months of 2017. Audemars Piguet, Hermes' watch unit, Roger Dubuis, Parmigiani and Richard Mille all said they were closing points of sales at third-party retailers. CONSOLIDATION The problems at multi-brand stores have already led to some consolidation, ultimately shrinking the number of such outlets. Last year, Canada's Birks Group <BGI. A> sold its U.S.-based subsidiary Mayor's Jewelers to Britain's Aurum Holdings. \"There are too many retailers, this cannot go on. Their margins have shrunk, they have financial problems,\" Mille said. Patrick Pruniaux, chief executive of Kering's <PRTP. PA> Ulysse Nardin brand, said he was comfortable that his brand relied entirely on third-party sellers, but also said he expected further mergers and acquisitions among retailers as some were just not up to the new challenges in their industry. Cartier said on Monday its inventories had returned to healthy levels, but it might still resort to selective buybacks. Berenberg analyst Zuzanna Pusz said in a note on Tuesday that Richemont's close monitoring of the wholesale market suggested inventory levels were still too high. (Editing by <mark>Mark Potter</mark> and <mark>Sarah White</mark>)", "articleID": "2018011616_00593288_W", "names": {"Mark Potter": ["Q6769304", "Q6769305"], "Sarah White": ["Q52727394", "Q57699411", "Q7422897"]}}, {"date": "2018-01-16", "url": "http://www1.skysports.com/football/news/11678/11210462/newcastle-takeover-talks-with-amanda-staveley-and-pcp-partners-have-ended", "content": "Newcastle takeover talks with Amanda Staveley and PCP Partners have ended By Sky Sports News Last Updated: 16/01/18 7:12 pm Newcastle owner <mark>Mike Ashley</mark> Talks between <mark>Mike Ashley</mark> and Amanda Staveley's PCP Partners over a potential takeover of Newcastle United have ended for now, Sky Sports News understands. And, as it stands, there is no deal is in place between the two parties for a sale of the Premier League club, nor is one under discussion. A source close to <mark>Ashley</mark> told Sky Sports News: \"It is only right to let the fans know that there is no deal on the table or even under discussion with Amanda Staveley and PCP .\" The source added that attempts to reach a deal had proved to be \"exhaustive, frustrating and a complete waste of time\". Sky Sports News have contacted PCP and are awaiting comment. More to follow.", "articleID": "2018011619_00309261_W", "names": {"Mike Ashley": ["Q15454805", "Q554077"]}}, {"date": "2018-01-17", "url": "https://globalnews.ca/news/3970362/kid-rock-nhl-all-star-game/", "content": "Kid Rock will headline entertainment at the upcoming 2018 NHL All-Star Game in Tampa, Fl. on Sunday, Jan. 28. He will perform during the second intermission and his set will be televised as part of the game broadcast, the league announced on Jan. 16. The 2018 @ Honda #NHLAllStar Game will feature @ KidRock as the headlining entertainment! pic.twitter.com/rhwYqjr4Em--NHL (@ NHL) January 17, 2018 READ MORE: Kid Rock delivers political speech during Detroit concert amid protest Additional performers will be announced in the coming days, but the choice of headlining entertainment left many NHL fans confused. Opens up Twitter * The headline reads that Kid Rock is performing at the 2018 NHL All Star game.... pic.twitter.com/tw9jUH1dlA--Alex R. (@ AlexTheGreatzz) January 17, 2018 Hey @ NHL, did you actually discuss inviting Kid Rock to perform at the ASG or was it an intern error?--Jason Kay (@ JKTHN) January 17, 2018 Nobody chooses #KidRock for their event; they settle for Kid Rock when they can't get anyone else for the money they're offering. #NHLAllStar--Ed the Sock (@ EdtheSock) January 17, 2018 Kid rock to play the #NHLAllStar game.... every #Hockey fan right now...pic.twitter.com/d07L2y5ZHE--All Beard No Teeth (@ ABNTHockey) January 17, 2018 NHL: Why don't any women, minorities, or people under 40 watch our sport? Also NHL: Let's book Kid Rock to be the main entertainment for our biggest event of the year!!--Mike (@ DeetoDC) January 17, 2018 NHL selected Kid Rock to do their ASG? pic.twitter.com/mUXEdUpqqQ--Jayson Buford (@ jaysonbuford) January 17, 2018 I've never seen @ NHL fans more united than they are right now in hating the announcement that Kid Rock is playing the #NHLAllStar game .--Alisha Grauso (@ AlishaGrauso) January 17, 2018 Did the NHL get turned down by 10,000 more prominent musicians of was Kid Rock a first choice? Either way, amazing .--Travis Yost (@ travisyost) January 16, 2018 And just when you thought the NHL couldn't get any whiter. . https: //t.co/t8ynPfpFjm--Asher M. Roth (@ TheAsherRoth) January 17, 2018 The NHL picking musical acts at their events. pic.twitter.com/5nTW9k0yS7--Joey Jo-Jo Junior Shabadoo (@ Brendan414) January 17, 2018 If SNL parodied the NHL All Star Game, the skit would have Kid Rock as the headlining act. https: //t.co/0lHaREaz1d--Keegan Matheson (@ KeeganMatheson) January 17, 2018 The NHL looked at how much attention that college football got for having trendy, young, peak-popularity artist in Kendrick Lamar play the halftime show. So they decided to get...* squints eyes * Kid Rock. huh--<mark>Sung Min</mark> Kim (@ sung_minkim) January 17, 2018 Kid Rock is playing the #NHLAllStar game? pic.twitter.com/gWi79ORc6J Story continues below--Erik (@ erikwray) January 17, 2018 READ MORE: Kid Rock hints at run for U.S. Senate Kid Rock's appearance at the NHL All-Star Game will support his \"American Rock n Roll Tour 2018\" and new album Sweet Southern Sugar. His tour kicks off on Jan. 19 at Bridgestone Arena in Nashville, Tenn., and will continue with 21 shows. \"Kid Rock remains at the centre of media attention in regards to his musical and personal ambitions, leaving his mark in a multitude of genres,\" the NHL said in a press release. Flo Rida will take the stage at the All-Star Skills competition prior to the game. The all-star festivities will begin on Saturday, Jan. 27, with the skills competition, followed by the divisional battles the following day. Follow @ KatieScottNews", "articleID": "2018011717_00788476_W", "names": {"Sung Min": ["Q12971420", "Q7640091"]}}, {"date": "2018-01-19", "url": "http://www.nbcbayarea.com/news/california/AG-California-Is-Not-in-the-Business-of-Deportation-469927783.html", "content": "AG on ICE Sweeps: California Is \"Not in the Business of Deportation' By Don Thompson Published 50 minutes ago NEWSLETTERS Receive the latest california updates in your inbox Email Privacy policy | More Newsletters NBC 7 California's attorney general said Wednesday he is concerned about open-ended immigration sweeps at a time he and other state officials say the Trump administration should be concentrating on deporting dangerous felons. Attorney General Xavier Becerra said while it is the federal government's responsibility to protect the nation's borders, the goal should be public safety, not deporting otherwise law-abiding immigrants who are in the country illegally .\" We will, as always, work with our federal partners in every respect to go after drug dealers, human traffickers, potential terrorists, \"Becerra said .\" We're not in the business of deportation. We're in the business of public safety. \"Becerra and other Democrats spoke in response to an anonymous report in the San Francisco Chronicle on Wednesday that said federal officials are preparing for a major immigration sweep in San Francisco and other Northern California cities. House Passes Budget Bill Aimed at Averting Shutdown Immigration and Customs Enforcement spokeswoman Sarah Rodriguez said agency policy is to neither confirm nor deny the possibility or existence of a specific operation. ICE Acting Director Thomas Homan has repeatedly lambasted California and Gov. <mark>Jerry Brown</mark>, a Democrat, over a new state law that strictly limits the cooperation of local law enforcement with federal immigration authorities when they are booked into jail for other reasons. A day after the law took effect in California, he said ICE will\" vastly increase our enforcement footprint in the state of California. \"\"California better hold on tight,\" he told Fox News on Jan. 2. \"They're about to see a lot more special agents, a lot more deportation officers in the state of California. If the politicians in California don't want to protect their communities, then ICE will .\" Activists Urge Travelers to \"Know Your Rights' Democratic U.S. Sens. Dianne Feinstein and Kamala Harris sent Homan a letter Wednesday asking to be briefed on how raids are prioritized and for all communications regarding upcoming raids in California .\" Diverting resources in an effort to punish California and score political points is an abhorrent abuse of power, not to mention a terrible misuse of scarce resources, \"they wrote. Immigrant rights advocates had not stepped up their activism in response to the report, but said anxiety remained high. Haitians Face Hurdles After Protected Status Renewal Delays\" We're always worried of what's going to come next from this administration, \"said <mark>Juan Rivera</mark> of Carecen SF, a nonprofit that assists Central American immigrants in the San Francisco Bay Area and is part of a rapid response network that alerts immigrants about ICE raids. Becerra and former U.S. Homeland Security Secretary Janet Napolitano, now the University of California president, spoke at a news conference urging young immigrants to apply to remain in the country after a federal judge prevented Trump from ending the Deferred Action for Childhood Arrivals program. Napolitano said when she was secretary under President Barack Obama from 2009 to 2013, immigration officials concentrated on deporting felons, particularly violent felons, gang members, security threats and those caught soon after crossing the border .\" The current administration has kind of erased all of those priorities and said anybody in the country without documentation is fair game, \"she said .\" I think one can question whether that is the best use of our law enforcement resources. \"Deportation arrests have surged about 40 percent under Trump's presidency, even without a budget increase. Homan, in a recent interview with The Associated Press, said authorities still target people with criminal histories but limits on access to local jails will prompt them to chase them elsewhere, potentially arresting others who happen to be there and are in the country illegally. Trump and other administration officials have singled out San Francisco for criticism, repeatedly raising the 2015 fatal shooting of Kate Steinle by Mexican man who had been deported five times and was recently acquitted of murder. Copyright Associated Press", "articleID": "2018011900_00722964_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Juan Rivera": ["Q19879381", "Q25280722", "Q861215"]}}, {"date": "2018-01-19", "url": "http://www.thenorthernecho.co.uk/news/national/15867120.Barry_Bennell_abuse_complainant_says_ex_Crewe_manager_Dario_Gradi_arranged_sleepovers/", "content": "File photo dated 8/1/2018 of Court artist sketch by <mark>Elizabeth Cook</mark> of Barry Bennell appearing via videolink at Liverpool Crown Court where he is accused of 48 counts of child sexual abuse. An alleged victim of former football coach Barry Bennell stayed at his house after an arrangement made with ex-Crewe Alexandra manager Dario Gradi, a court has heard. Liverpool Crown Court was shown a video of a police interview with the complainant, who alleges he was raped by Bennell, 64, between 18 and 20 times at his home. He said he would stay at the coach's house with other boys while playing for Crewe's youth team. Loading article content Former Crewe Alexandra manager Dario Gradi Asked whose idea it was to stay there, he said: \"The football club .\" It would have been Dario Gradi, the manager. \"\"Dario was the manager and Barry was in charge of the youth .\" But alleged victim also said Gradi stopped him staying there after about 18 months, adding: \"I grew up thinking Dario saved me from Barry .\" He told police how Bennell had first tried to touch him while he was in a bunk bed but he told him to \"go away\". Former football coach Barry Bennell He said: \"Nothing happened then for a while and he started to kind of play mind games, saying I wouldn't be able to play for England .\" He wasn't playing me in the right position. I got dropped out of the football team. \"I think it was five or six weeks later, that was the first time it happened .\" He added: \"He had this power over you and he had this nasty streak .\" He could turn on you just like that. He would say \"I'll ruin your football career' .\" The complainant broke down in tears on occasions as he described being \"paralysed with fear\" while he was abused by Bennell. He said: \"You feel like you're paralysed. All I'm trying to think about is my football. I can't say anything because of my football .\" The complainant told police that the abuse--alleged to have taken place over an 18-month period--ended when Gradi stopped him staying at Bennell's home. He said: \"Dario Gradi stopped me staying with Bennell. I was not allowed to stop there any more .\" Asked what was the reason given, he replied: \"I have no idea. All I can remember is it just stopped .\" I grew up thinking Dario saved me from Barry. I never stayed there again. \"", "articleID": "2018011912_00555180_W", "names": {"Elizabeth Cook": ["Q1331177", "Q5362618"]}}, {"date": "2018-01-20", "url": "https://patch.com/california/cupertino/campaign-embracing-immigrants-launches-santa-clara-county-wide", "content": "health & fitness Campaign Embracing Immigrants Launches Santa Clara County-Wide \"This is a campaign to say,\" You are not you, and we are not we. We are all. Immigrants are all .' \"0 SANTA CLARA COUNTY, CA--The County of Santa Clara's Office of Immigrant Relations launched a coordinated media campaign this morning to emphasize the county's support and resources for immigrants living in the county. County officials gathered with the consuls general from Mexico, El Salvador, Guatemala and Nicaragua in front of a Valley Transportation Authority bus with one of the campaign ads to make remarks on how and why the campaign was created. The campaign, advertised with posters that read,\" One county, one future, \"is designed to focus on\" the value of differences in the community, \"County Executive <mark>Jeffrey Smith</mark> said. The campaign will primarily highlight public health and social services, though the county offers many more resources available to the immigrant community, according to <mark>Smith</mark>. This campaign comes in the wake of recent U.S. Immigration and Customs Enforcement raids in four Bay Area counties on Jan. 10, when 21 people were arrested and ordered to appear in immigration court. The event was a follow-up operation that stemmed from a 2013 investigation, according to a statement from ICE. County Office of Immigrant Relations Director Maria Love also said that the county works to make sure that immigrants arrested by ICE have access to legal defense, including through a $3.5 million investment in community organizations that offer free legal services. The Rapid Response Network of Santa Clara County and the County Office of Immigration Relations have been working together, Love said. The RRN has a 24/7 hotline with attorneys standing by in the event that someone wants to report a raid happening or has had a family member picked up by ICE during a raid. The Santa Clara County Sheriff's Office had two representatives present in solidarity. <mark>Smith</mark> said that they are\" liberal \"and honor the sanctuary county rules, meaning that they do not report undocumented immigrants to ICE and keep their information confidential. They will not be following federal threats or ICE threats in the effort to deport undocumented residents, <mark>Smith</mark> said. <mark>Smith</mark> described Love, an immigrant from El Salvador, as\" the mastermind of the campaign. \"Love said that the Santa Clara County Board of Supervisors tasked her department with creating the campaign. According to <mark>Smith</mark>, about 100 county employees worked on it. Love said that her department talked to immigrants that live in Santa Clara County to determine what messages were most important. Love said that the campaign's objective is for the community to know that no matter what happens at the federal level, the county will support both documented and undocumented immigrants by giving them the resources that they need .\" Our immigrants are good people, the vast majority of them work hard, are documented and contribute significantly to our community, \"<mark>Smith</mark> said .\" The people who are not documented are only undocumented because we have a very abhorrent and very ineffective immigration policy nationwide. \"Deputy county executive <mark>David Campos</mark> highlighted that several employees who worked on the campaign are\" Dreamers themselves, \"individuals who entered the country as minors and were largely raised in the U.S. Santa Clara County Chief Operating Officer <mark>Miguel Marquez</mark> echoed <mark>Smith</mark>'s statement, telling his own sibling's stories of success as\" one of the true stories of immigrants. \"<mark>Marquez</mark> spoke of the two nationwide injunctions against President Trump's executive orders, one that protects sanctuary jurisdictions nationwide and one that allows\" Dreamers \"to renew their Deferred Action for Childhood Arrivals status that allowed them to reside in the United States. According to <mark>Marquez</mark>, county officials are doing all they can for each resident of the county, but especially for those foreign-born residents that make up more than 70 percent of the Silicon Valley workforce. All of the consul generals spoke in accord with county officials and the significance of the campaign in helping the immigrant community .\" We are all people, no matter our color, no matter our race and no matter our immigration status, \"said Consul General of El Salvador Ana Valuenzuela. Consul General of Guatemala Patricia Lavagnino called the campaign\" brave. \"\"This is a campaign to say,\" You are not you, and we are not we. We are all. Immigrants are all,' \"Lavagnino said. The campaign has a budget of about $40,000, and can be expanded as needed, according to <mark>Smith</mark>.\" Our major issue is trying to get the message out to our clients, \"<mark>Smith</mark> said .\" We are here to provide services for people who are typically underserved. \"The campaign ads will be posted at buses and bus stops with the reasoning that the targeted community needs those transportation services to get to the community resources the county can provide. They will also be in government buildings and advertised in a mail campaign, <mark>Smith</mark> said. By Bay City News Service Photos courtesy County of Santa Clara Office of Public Affairs", "articleID": "2018012005_00402996_W", "names": {"David Campos": ["Q12054131", "Q56509186", "Q56558506"], "Jeffrey Smith": ["Q42699211", "Q57441012"], "Miguel Marquez": ["Q6014815", "Q6844663"]}}]