[{"date": "2018-01-21", "url": "http://www.stuff.co.nz/taranaki-daily-news/news/100709220/Taranakis-dairying-past-recalled-in-Our-Milky-Ways-exhibition", "content": "Taranaki's dairying past recalled in \"Our Milky Ways' exhibition CATHERINE GROENESTEIN Last updated 14:08, January 21 2018 Catherine Groenestein Esther Kahukuranui, 9, and her brothers Noah, 7, Tuck, 10, and cousin Katika, 12, enjoyed getting a closeup look of a vintage tractor, part of the Our Milky Ways exhibition at Aotea Utanganui Museum of South Taranaki. A Jersey cow named Jenny walked 250 kilometres to begin her dairying career in Taranaki. Her story is told in Our Milky Ways, a new exhibition on the history of dairying in Taranaki that opened at Aotea Utanganui Museum of South Taranaki on Friday. District archivist Cameron Curd, who curated the display, hopes to gather more stories from visitors sharing their own memories. Catherine Groenestein Keiran Dwyer and his granddaughter Pippa, 5, take a guess how many milk bottle lollies are in a bottle .\" We are hoping that people will bring in objects, stories and photographs that we can add to the exhibition, \"he said. As well as vintage milking equipment and photos, it features six films documenting farm life and how butter and cheese were made in the little dairy factories scattered around the mountain. READ MORE: * Aotea Utanganui museum is rich in material but poor in memories * German couple find the perfect wedding venue in Patea * Museum has Stars all set up Catherine Groenestein Some items from Our Milky Ways exhibition at Aotea Utanganui Museum of South Taranaki. A scarlet 1947 Farmall tractor sits in the centre of the exhibition and the displays are numbered with yellow ear tags. Taranaki's first Jersey cow ambled in to Taranaki in 1876, after being walked 250km from Marton to Bell Block by her new owner William Hulke. A vintage centrifuge machine (circa 1910) was used to test the fat content of milk and ensure that dodgy farmers didn't water down their milk, and a NZ Department of Health sign from 1946 proclaims the benefits of pasteurisation. During the exhibition a series of talks about the future of dairying were planned with speakers from Dairy NZ, Fonterra, and farmers, as well as people from environmental groups, Curd said. Those who preferred a more hands-on approach to learning could try making butter with a vintage butter churn during a workshop that would include eating it on scones with cream and jam. The exhibition was funded by the Taranaki Regional Council and took about four months to prepare and runs until May, he said. It was opened with a brief ceremony on Friday with speeches by Curd and Taranaki Regional Councillor <mark>Donald McIntyre</mark>. One of those attending was farmer Keiran Dwyer of Patea .\" I think it's pretty good, the industry's got a lot of history. \"He remembered using some of the equipment on display during his farming career .\" But not the horse drawn ones, it was tractors and trucks in my time. \"- Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next News story: Star Gym users in limbo as council scrambles to accommodate rugby players Taranaki Daily News Homepage", "articleID": "2018012101_00538930_W", "names": {"Donald Mcintyre": ["Q21454438", "Q23616862", "Q330991"]}}, {"date": "2018-01-23", "url": "http://www.koreaherald.com/view.php?ud=20180123001023", "content": "North Korea, US clash at disarmament forum Published: Jan 23, 2018 - 23:08 Updated: Jan 23, 2018 - 23:08 GENEVA (Reuters)--North Korea said Tuesday it had a \"powerful and reliable\" nuclear deterrent to thwart any attack, and accused the United States of deploying military assets nearby it under the pretext of ensuring security at the PyeongChang Winter Olympics. \"This is a dangerous act of throwing a wet blanket over the current positive atmosphere of inter-Korean relations...which could drive again into an extreme phase of confrontation,\" Han Tae Song, North Korea \"s ambassador to the United Nations in Geneva, said. South Korean President Moon Jae-in said Monday a thaw in relations between the two Koreas ahead of next month's Winter Olympics presented a\" precious chance \"for the United States and North Korea to discuss the North\" s weapons programs. North Korea is developing missile and nuclear technology amid regular threats to destroy the United States and Japan and in defiance of UN Security Council resolutions. Han, addressing the UN-sponsored Conference on Disarmament, said nuclear tests last year had allowed his country to \"perfect a national nuclear force\" in a transparent manner. \"Thus DPRK (North Korea) at last came to possess a powerful and reliable war deterrent,\" he told the Geneva forum. \"I am proudly saying that DPRK's nuclear force is capable of frustrating and countering any nuclear threats from the US and it constitutes a powerful deterrent that prevents the US from starting an adventurous war .\" Han said as a \"responsible nuclear power\" that North Korea could not resort to using the weapons unless hostile forces violate its sovereignty or interests. US disarmament ambassador <mark>Robert Wood</mark> said, \"The United States will not recognize North Korea as a nuclear weapon state .\" If the North wishes to return and be in the good graces of the international community, it knows what it has to do, it has to take steps toward denuclearization of the Korean Peninsula. \"In an earlier speech on Tuesday, United Nations disarmament official Izumi Nakamitsu welcomed an easing of tensions between North and South Korea, but called for further steps toward removing nuclear weapons from the divided peninsula. In this Sept. 16, 2017 file photo, people watch the launch of a Hwasong-12 strategic ballistic rocket aired on a public TV screen at the Pyongyang Train Station in Pyongyang, North Korea. (AP-yonhap)", "articleID": "2018012314_00881424_W", "names": {"Robert Wood": ["Q1265326", "Q15052600", "Q19325396", "Q21165763", "Q22098434", "Q24566698", "Q43915973", "Q51586292", "Q7351216", "Q7351217", "Q7351220", "Q9185475"]}}, {"date": "2018-01-24", "url": "http://www.wearecentralpa.com/news/philadelphia-wants-safe-injection-sites-to-help-opioid-fight-1/935531442", "content": "Philadelphia wants safe injection sites to help opioid fight By: KRISTEN DE GROOT, Associated Press Posted: Jan 23, 2018 07:51 PM EST Updated: Jan 23, 2018 07:51 PM EST KWWL via CNN KWWL via CNN PHILADELPHIA - PHILADELPHIA (AP) - Philadelphia wants to become the first U.S. city to allow supervised drug injection sites as a way to combat the opioid epidemic, officials announced Tuesday, saying they are seeking outside operators to establish one or more in the city. Public Health Commissioner Dr. <mark>Thomas Farley</mark> said the sites could be \"a life-saving strategy and a pathway to treatment,\" and would be just one piece of the city's overall plan to fight the epidemic. \"No one here condones or supports illegal drug use in any way,\" <mark>Farley</mark> said. \"We want people saddled with drug addiction to get help .\" Safe injection sites are locations where people can shoot up under the supervision of a doctor or nurse who can administer an overdose antidote if necessary. Critics have argued the sites may undermine prevention and treatment, and seem to fly in the face of laws aimed at stopping use of deadly illicit drugs. Philadelphia has the highest opioid death rate of any large U.S. city. More than 1,200 people fatally overdosed in Philadelphia in 2017, one-third more than 2016. The city hopes to hear from operators interested in setting up the injection sites - which they are calling comprehensive user engagement sites - where the city would provide outreach services. Other cities have proposed similar safe havens. No U.S. city has established such a site, though Seattle has set aside $1.3 million to create a safe injection site there. Injection sites are operating in Canada and Europe. Officials from Philadelphia visited Seattle and safe injection sites in Vancouver, where <mark>Farley</mark> said they have reduced overdose deaths, the spread of diseases like HIV and hepatitis C, and created safer neighborhoods that are free of used-needle litter. It's not clear how the federal government would respond if Philadelphia gets a safe-injection site. Nearly three months ago, President Donald Trump declared the U.S. opioid crisis a public health emergency. Philadelphia Police Commissioner Richard Ross said he was initially dead-set against injection sites but now is keeping an open mind if they can truly save lives. He said he still has a lot of questions about how it all would work but added: \"We cannot just throw our hands up and say,\" That's not my problem .' \"Mayor Jim Kenney wasn't at the news conference but <mark>Farley</mark> said the Democrat supports the recommendation. Philadelphia City Councilwoman Helen Gym called the decision to allow safe injection sites\" bold, brave, and lifesaving. \"\"This crisis requires us to think differently and comprehensively about how to reach everybody impacted by the opioid crisis,\" the Democrat said. Pennsylvania Attorney General Josh Shapiro said sanctioning such sites presents public safety concerns and changes in state and federal law would have to be made in order for them to operate legally. The Democrat also expressed doubt that the sites are an effective path to treatment. \"There is no safe way to inject heroin, fentanyl and carfentanyl,\" he said in a statement. \"These are dangerous drugs with devastating consequences .\" House Speaker Mike Turzai, who is running for the Republican nomination to challenge Democratic Gov. <mark>Tom Wolf</mark>, called Philadelphia's safe injection plan misguided and a violation of federal law. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Don't Miss Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2018012403_00003275_W", "names": {"Thomas Farley": ["Q23058869", "Q59489244", "Q7789520"], "Tom Wolf": ["Q1557544", "Q7794795"]}}, {"date": "2018-01-24", "url": "https://www.bloomberg.com/news/articles/2018-01-24/ford-stresses-fitness-after-failing-to-seize-on-strong-revenue", "content": "Ford Stresses \"Fitness' After Failing to Seize on Strong Revenue - Bloomberg Bloomberg the Company & Its Products Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 MENU Ford Stresses\" Fitness' After Failing to Seize on Strong Revenue By Earnings underwhelm despite better-than-expected sales Overseas profits plunge on weak China demand, Brexit impact Ford Motor Co.. reemphasized the need to trim costs under its new CEO as rising revenue failed to translate into profit growth to help its sinking stock. Automotive revenue surged to $38.5 billion in the last three months of last year, about $1.8 billion better than analysts projected. But strong sales only managed to boost earnings to a level that disappointed investors when Ford reported preliminary results last week. The automaker has telegraphed trouble for this year, issuing a warning that profit will slip and prompting a sharp selloff that's cost Ford about $4.2 billion in market value. Chief Executive Officer <mark>Jim Hackett</mark> has earmarked $14 billion in cost cuts over five years and has said the company will drop some car models from its lineup to focus on more lucrative sport utility vehicles and pickups. \"We are intensely focused on improving the operational fitness of our business to deliver strong results while continuing to build toward our vision of the future,\" <mark>Hackett</mark> said Wednesday in a statement. This year, Ford has said it will face a $1.6 billion headwind from rising prices of steel, aluminum and other raw materials, as well as adverse exchange rates. On the strength of rising F-Series truck sales, Ford boosted quarterly revenue and market share in North America, yet pretax profit fell to $1.6 billion. Rising raw material and warranty costs dragged on earnings in the region--the company warned in October that an F-Series recall would cost about Overseas, Ford lost money in South America, while profit declined in Europe. The company barely broke even in Asia as both sales and prices fell in China. Wall Street Wary Wall Street has been wary of Ford. Its profit forecast for this year reneges on former CEO <mark>Mark Field</mark>'s promise that earnings would rebound after 2017. Instead, the automaker said the rising cost of raw materials and the expense of developing autonomous and electric cars will weigh on 2018 profits. \"It was a very challenging year,\" Bob Shanks, chief financial officer, told reporters Wednesday at Ford's headquarters in Dearborn, Michigan. \"It's very, very clear that we have to improve the fitness of the company .\" <mark>Hackett</mark>, who is preparing the company for an ambitious plan to roll out robot taxis and driverless delivery vehicles by 2021, warned last week that this will be a \"bad year .\" Ford shares have fallen about 8 percent since the company issued its profit warning on Jan. 16. Last year, the stock rose just 3 percent, while General Motors Co. jumped 18 percent and Tesla Inc. soared 46 percent. Fiat Chrysler Automobiles NV's U.S.-listed shares outperformed them all, nearly doubling during 2017. \"There's a lot of frustration,\" David Whiston, a Chicago-based auto analyst with Morningstar, said before Ford released earnings. \"People feel like it's not going to get better any time soon .\" Before it's here, it's on the Bloomberg Terminal.", "articleID": "2018012421_00577410_W", "names": {"Jim Hackett": ["Q13129314", "Q30030987"], "Mark Field": ["Q304450", "Q6767598"]}}, {"date": "2018-01-25", "url": "http://www.miamiherald.com/sports/spt-columns-blogs/barry-jackson/article196645549.html#storylink=indep", "content": "What the Miami Heat is doing better than any team in the NBA By <mark>Barry Jackson</mark> Order Reprint of this Story January 25, 2018 02:48 PM A few Heat notes on a Thursday, with Goran Dragic hoping to play against visiting Sacramento on Thursday night but <mark>Tyler Johnson</mark> still out with an ankle injury: ▪ The Heat has done a lot of things well in moving seven games above .500. But there's one thing it has done better than any team in the league, by far: Shooting three-pointers late in close games. Never miss a local story. Sign up today for a free 30 day free trial of unlimited digital access. SUBSCRIBE NOW Even after missing two such shots late against Houston on Monday, Miami is shooting 47.2 percent on clutch threes: 25 for 53. The NBA defines clutch as the final five minutes of games with a margin of five points or fewer. The next-best three-point shooting team in the clutch? The Knicks at 38 percent. By comparison, Golden State is shooting 33.3 percent on clutch threes (20 for 60) and Houston 34.7 percent (17 for 49). Josh Richardson is 5 for 9 on clutch threes, injured Dion Waiters 7 for 13, Goran Dragic and Wayne Ellington 3 for 8. ▪ Two teams can regret giving up on Hassan Whiteside: Sacramento, which waived him in July 2012 (two years after drafting him 33 rd overall), and the Memphis Grizzlies, who released him twice--Oct. 22, 2014 (28 days after signing him) and Nov. 22, 2014 (two days after signing him). The Heat signed him Nov. 24, 2014, and, well, you know the rest. More Videos Goran Dragic talks about the All-Star game snub and the Miami Vice-themed City Edition uniforms, which will make their debut Thursday night when the Miami Heat plays the Sacramento Kings. Manny Navarro mnavarro @ miamiherald.com Kings coach Dave Joerger, who was Memphis' coach at the time the Grizzlies cut him twice, said Thursday morning that he's happy for Whiteside and explained why Memphis released him. \"It was tough on us because with the contract positions and rosters numbers we had, and we had Pau Gasol and Kosta [Koufos], experienced guys in the NBA. In today's game, it's pretty difficult to play him and Marc Gasol together, even though Marc can shoot the three. The game's being played with one big and four guys--you are either a shooter or a playmaker. You must be one or the other .\" Related stories from Miami Herald Does he ever wonder what might have been with Whiteside in Memphis? \"I'm over our win the other night,\" Joerger said. \"Coaches see a little bit shorter views .\" But...\"I'm happy for all those guys--James [<mark>Johnson</mark>], Wayne [Ellington], Hassan--that the Heat rewarded them for their performance and their work ethic. They're a great organization. You cheer for those guys. I'm fired up for them and their family. Hassan is a sweetheart human being. Really enjoyed being around him .\" Joerger was fired by the Grizzlies on May 7, 2016, despite guiding them to the playoffs all three of his seasons, then joined the Kings as coach two days later. ▪ After some growing pains defensively earlier in the season, Heat rookie Bam Adebayo isn't merely a decent defender. More Videos Richardson talked about the effort it took to hold the Bucks to 31.6 percent shooting and pick up the Heat's seventh win in a row. Andre C. Fernandez a1fernandez @ miamiherald.com \"He's much more than that,\" coach Erik Spooelstra said. \"Very good mind and terrific work ethic .\" Players defended by Adebayo are shooting 44.9 percent, compared with 48.1 overall. By comparison, players defended by Whiteside are shooting 46.5, and Kelly Olynyk 49.4. ▪ One of the ways the Heat shrewdly and legally is managing the remaining NBA days for Derrick Walton Jr. (six remaining) and <mark>Derrick Jones</mark> Jr. (nine left) was by having them practice alone--just the two of them--on Wednesday. As a result, that didn't count as a day of NBA service time as part of their two-way contracts that limit the number of days they can spend in the NBA this season. \"It was a little workout; being able to perfect our craft is a great thing,\" <mark>Jones</mark> said. The idea of giving <mark>Jones</mark> a standard contract has been considered internally, but the Heat likely will wait through the Feb. 8 trade deadline before making a move. As far as following all the steps necessary to conserve his days--such as practicing alone or not traveling with the team back from a road trip--<mark>Jones</mark> said: \"I just do what I'm told .\" ", "articleID": "2018012519_00899134_W", "names": {"Barry Jackson": ["Q15995218", "Q4864344", "Q4864346", "Q4864347", "Q4864348", "Q55619170", "Q809055"], "Derrick Jones": ["Q24007463", "Q30122541", "Q5263043"], "Tyler Johnson": ["Q17489372", "Q30122141", "Q57423105", "Q7585450", "Q7860052"]}}, {"date": "2018-01-25", "url": "https://www.upi.com/Sports_News/College-Football/2018/01/25/Florida-St-QB-Francois-cleared-in-domestic-violence-probe/2671516909448/", "content": "Florida St. QB Francois cleared in domestic violence probe By The Sports Xchange | Jan. 25, 2018 at 2:46 PM Comments | License Photo Florida State quarterback Deondre Francois was cleared by police in an alleged domestic violence incident, multiple media outlets reported Thursday. Francois was involved in a domestic dispute with his pregnant girlfriend late Tuesday afternoon. But Francois and the woman gave very different accounts of what took place in their statements to the Tallahassee Police Department following the incident at Francois' apartment. Another Florida State football player, Zaquandre White, also was present and spoke to police. Police were called to the scene but an investigation Wednesday evening resulted in no arrests and no charges being filed, because of \"conflicting statements and lack of independent witnesses,\" according to the police. State Attorney <mark>Jack Campbell</mark> told the Orlando Sentinel on Wednesday that Francois will not be charged based on the Tallahassee Police Department's investigation. \"Based on the evidence as we understand it and with the conclusions made by the Tallahassee Police Department, I'm in agreement with TPD with insufficient evidence to charge Deondre Francois,\" <mark>Campbell</mark> told the Orlando Sentinel. Francois, who called the police, said the woman began to break items in the house and attempted to rip a television off the wall, according to the police report. She told authorities that he broke down a bedroom door, threw her to the ground and tried to get her to leave the apartment. Francois said he grabbed the women in a hug to prevent her from breaking things, and that a cut she sustained on her arm was the result of a broken vase. The woman told police she is nine weeks pregnant and said she did not want Francois to get in \"trouble, trouble .\" But she did want the police to speak with Francois to \"scare him a little,\" according to the report. The woman asked police if Francois would get in trouble for smoking marijuana at the apartment before the incident. The woman did not want to press charges against Francois, according to the report. Neither the school nor new coach Willie Taggart has commented on the incident. Francois started every game in 2016 as a redshirt freshman, throwing for 3,350 yards and leading the Seminoles to a 10-3 record. With even higher expectations for him and the team going in 2017, he suffered a season-ending knee injury in the opener against Alabama as FSU struggled to a 7-6 mark. Francois is expected to compete with sophomore James Blackman for the starting quarterback spot for the 2018 season. Related UPI Stories", "articleID": "2018012519_00902970_W", "names": {"Jack Campbell": ["Q3029621", "Q3123835", "Q3157139", "Q6111556"]}}]