[{"date": "2018-01-26", "url": "http://www.espn.in/football/real-madrid/story/3360556/zinedine-zidanes-real-madrid-future-set-to-be-decided-at-end-of-season", "content": "Zinedine Zidane's Real Madrid future set to be decided at end of season play WATCH: If the transfer window was breakfast (2:31) While Premier League clubs wheel and deal, the guys at Exploding Heads imagine if the transfer window was breakfast. (2:31) comment Under-pressure Real Madrid coach Zinedine Zidane has said any changes at the club will come in the summer. Zidane, whose side are 19 points behind La Liga leaders Barcelona and have crashed out of the Copa del Rey, said he and his players were fully focused on improving their situation. On Wednesday, Madrid's campaign hit a new low with their Copa exit to Leganes, after which Zidane admitted his job was on the line over the next few weeks. The situation has brought speculation that Madrid president Florentino Perez may feel forced into a change before the team take on Paris Saint-Germain in the Champions League. But Zidane told a news conference: \"I talk all the time with the president, but I am continuing with the same motivation as ever .\" Tomorrow, we have a game to win three points [at Valencia]. Then we will see at the end [of the season] what will happen, whether things need to change, but not now. \"I feel the support of the club, the president, the squad, and we will keep going to turn things around .\" Zidane said he realised the success he enjoyed during his first two years in the job was now irrelevant and added: \"If I thought I could not [turn things around], I would leave tomorrow .\" In football, there are good and bad moments. I feel strong and able to resolve this. \"What I have won before...this is about today, I do not think about [the past]. I was very disappointed with the game the other day, I did not expect that. But that is part of football, we must accept it .\" Nobody can take from me the motivation to keep going, working, until the last day. \"Denis Doyle/Getty Images Zidane said that although the slump in form\" is not a typical situation for Madrid, \"it had happened before .\" It is not always nice moments all year, \"he added .\" We want to keep working hard and this will improve. We have played good games, we must do that more consistently. \"I am speaking of this for weeks now, that is true, but I am convinced we will turn it around and the players are convinced too, which is the most important .\" Asked whether he had regrets over last summer's transfer business, when experienced players such as Alvaro Morata, <mark>James Rodriguez</mark> and Pepe left, Zidane said he had faith in his youngsters. \"I would not change anything now,\" he added. \"This squad is what I have. I was happy with the squad before the season started. It is a younger squad, with future, which has to learn. But I am with them completely .\" Zidane confirmed that Cristiano Ronaldo was available for Saturday's game despite a facial injury suffered while scoring his second goal in last weekend's 7-1 win over Deportivo La Coruna. \"We are ready to play a great game, and we will do that,\" he said. \"We know it is a difficult ground to visit, a very good team who have had a good season until now .\" But we like to play against the best teams, and we will play a good game tomorrow. \"The only thing that counts in football is to win. The only thing that will bring calm here is to win games, and we are all here to do that .\" ", "articleID": "2018012617_00854720_W", "names": {"James Rodriguez": ["Q368441", "Q37946987"]}}, {"date": "2018-01-27", "url": "http://www.thenorthernecho.co.uk/sport/15901628.SUNDERLAND__The_coach_who_used_to_clean_Juninho__39_s_boots_is_enjoying_seeing_young_Black_Cats_shine/", "content": "Show caption () View gallery Skip to next image \"0 comments ROBBIE STOCKDALE remembers what it was like to be a teenager making the breakthrough at first team level. He would clean the boots of Juninho as a teenage scholar at Middlesbrough, dreaming of the time he might join the Brazilian on the first team stage. A little later than normal, because of Juninho's departure and then return to Teesside a few years later, Stockdale eventually did. Through hard work and determination, the young man from Redcar made it onto the first team stage--and that is the message he has been banging at Sunderland over the last five-and-a-half years. And, having first joined Sunderland as a coach in the youth set-up from Grimsby Town, he was as proud as anyone else at the club last weekend when five graduates of the academy system helped secure a vital 1-0 win over Hull City at first team level. Loading article content Joel Asoro scored the winner that afternoon and he had George Honeyman, Josh Maja and Ethan Robson alongside him. Lynden Gooch emerged from the bench too. Having experienced what it is like to make the grade the grade at Premier League level with Middlesbrough and then eventually move on seven years later, when he went onto have spells at numerous clubs in lower leagues, Stockdale has stressed the challenge is to stay there. He said:\" The distance from the Under-23s room to the first team room at the Academy is maybe 50 steps. That is the hardest 50 steps any player will ever make. They think they're closer but it is the hardest to take. You have to embrace it and once you do get there you have to stay there. \"I always remember <mark>Curtis Fleming</mark> at Middlebsrough saying to me, when we were battling for the right-back place and an Argentinian came in for the trial. <mark>Curtis</mark> said to me,\" come on, he's not taking our place'. That's the mentality you've got to have, people always want to take your place. \"Sunderland manager Chis Coleman is showing he is willing to give youth a chance, even if he is probably giving more than he would like because of the club's predicament. In that sense, Championship football and relegation from the Premier League has helped. Stockdale said:\" If they're good enough they would get the chance. Certainly this year we wanted them to be part of it and that drips down to the academy. So the Under-23s on Tuesday night was a young team, we're trying to mould that into an Under-19 team if we can so they get an experience of older football. \"We want to get the Under-16s in the Under-18s and if they're good enough the U23s. That's the idea, filter the better players if you like and test them quicker. We'll be sending players out on loans, too .\" Sunderland have wasted plenty of cash over the last decade on players who have not fitted into the club's way or not lived up to their billing; so the change of direction should be applauded and welcomed now that they are in the Championship's relegation zone. Coleman is also keen to build a reputation for helping Sunderland by developing youth from other clubs, highlighted by his capture of Chelsea youngster Jake Clarke-Salter and how he has put him in the team straightaway. Stockdale, who has remained a first team coach under Coleman, said: \"Sometimes it can lift them to have senior players alongside them, because you feel that extra responsibility to the players next to you .\" We had <mark>Colin Cooper</mark> in yesterday, he works with the England Under-21s now and so he came in to see Jake. Jake said to him, I've learned more about defending playing alongside John O’Shea in two games than I have in any amount of junior football. The senior pros have all been in that situation and you really do remember those chats you have, those little bits of information. \"Stockdale certainly had that in his younger days. As a teenager in 1998 his debut was alongside Mark Schwarzer, Paul Merson and Co in Middlesbrough colours. He said:\" It was a cup game on the Tuesday night against QPR. Bryan Robson told me the day before I was in, which didn't help me sleep! But then, and this is the high and lows, on Saturday I was cleaning the boots. \"What is important, and it was exactly the same with me and Boro, is that the younger players come into an environment with really good senior pros. Nigel Pearson was my captain, Robbie Mustoe, <mark>Steve Vickers</mark>. They lead the way and you follow, it is still the same now .\" Now Stockdale is playing a huge part in providing the link between the academy at Sunderland and the first team picture, where the likes of Honeyman are grateful to the advice they have received. Honeyman has played more than any other player for Sunderland this season, and is determined to stay in the mix for the longer term. Sunderland might be in the throes of a relegation battle, but he is convinced that the experience can make all of the young talents stronger people and players. He said: \"I think it can make or break you. To get to this stage, though, I think you have to have a certain mental toughness anyway. There are so many young lads who come through who are all desperate to be first-team players, and you go through so many ups and downs even at a young age, that if you don't have that mental toughness then you will have probably fallen by the wayside anyway by now .\" It (the relegation fight) is not where we want to be, obviously, but once we come through it I am sure it will help the young lads in the long run. \"When you are a young player coming in, you have that excitement, and you probably don't realise the pressures. Ethan, Joel and Maj, they just want to come in and do really well--they are not focused on the consequences of defeat. That's the kind of freshness that young players can bring .\" Sunderland are up against Birmingham on Tuesday and Coleman hopes to have more new arrivals in by then. He signed winger Kazenga LuaLua on a free until the end of the season on Thursday night and is still in the hunt for at least one striker and a goalkeeper. Derby's <mark>Chris Martin</mark> is still on the radar, while it has emerged Hearts striker Kyle Lafferty is also under serious consideration. The Scottish Premier League club, however, are seeking a fee for the experienced Northern Ireland front-man. 0 comments", "articleID": "2018012705_00448176_W", "names": {"Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"], "Colin Cooper": ["Q1108398", "Q28873601", "Q472373", "Q5145003", "Q5145005"], "Curtis Fleming": ["Q3007800", "Q56461130"], "Steve Vickers": ["Q364424", "Q3973412"]}}, {"date": "2018-01-29", "url": "http://www.motorsport.com/v8supercars/news/djr-team-penske-co-owner-steve-brabeck-passes-away-1000001/", "content": "DJR Team Penske co-owner Steve Brabeck passes away 2 views By: Andrew van Leeuwen, News Editor 29/01/2018 01:51 DJR Team Penske co-owner Steve Brabeck passed away overnight after a brave 24-year battle with cancer. The influential businessman first got involved with the DJR Team Penske squad as a sponsor through his Crimsafe company in 2009 when it was known as <mark>Dick Johnson</mark> Racing, going on to provide funding badly needed to help the team survive a financially difficult 2010 season and seal the Supercars title with <mark>James Courtney</mark>. Brabeck then became part of the ownership structure several years later, retaining a 20 per cent stake through the transition into DJR Team Penske for the 2015 season. \"Jill and I have known Steve for many years, and he became much more than a business partner, he became a true friend,\" said Supercars legend and fellow part DJRTP owner <mark>Dick Johnson</mark>. \"He shared some incredible moments on track with us over the years and we will remember those for a long, long time. Our thoughts are with his family, especially his two boys Matt and Ben. He will be missed, greatly .\" Roger Penske also paid tribute to Brabeck's role in the pre-DJRTP survival of the old DJR outfit. \"We first met Steve in 2013 when we started talking to <mark>Dick</mark> and the team about Supercars,\" said Penske. \"He was a great guy, a successful businessman and really enjoyed going racing .\" He was there in the tough times for DJR and a terrific partner to us in DJR Team Penske. \"Motorsport.com offers its condolences to Brabeck's family and friends. Want motorsport news in your inbox? Sign up for our newsletters!", "articleID": "2018012901_00626668_W", "names": {"Dick Johnson": ["Q16091224", "Q357924", "Q3706952", "Q5273060", "Q5273062", "Q5273063"], "James Courtney": ["Q1680206", "Q30818524"]}}, {"date": "2018-01-29", "url": "http://mlb.mlb.com/news/article/mlb/tigers-castellanos-takes-on-leadership-role?ymd=20180129&content_id=265496936&vkey=news_mlb", "content": "Relaxed Castellanos embracing leadership role By Jason Beck MLB.com @ beckjason Facebook Share Twitter Share Email Copy Link Print DETROIT--Four years have passed since Nicholas Castellanos broke into the big leagues with the Tigers, as a highly-touted prospect with Detroit roots. As he talked with reporters at TigerFest on Saturday at Comerica Park, it might be the most comfortable the 25-year-old has seemed in his role here. At a time when Castellanos' future in Detroit isn't entirely clear, two years away from free agency on a team in the early stages of a rebuilding project, the Tigers' starting right fielder sounds not only relaxed and comfortable, but prepared to take on a role as part of the core of the franchise. DETROIT--Four years have passed since Nicholas Castellanos broke into the big leagues with the Tigers, as a highly-touted prospect with Detroit roots. As he talked with reporters at TigerFest on Saturday at Comerica Park, it might be the most comfortable the 25-year-old has seemed in his role here. At a time when Castellanos' future in Detroit isn't entirely clear, two years away from free agency on a team in the early stages of a rebuilding project, the Tigers' starting right fielder sounds not only relaxed and comfortable, but prepared to take on a role as part of the core of the franchise. Video: Castrovince, Justice on Tigers, Castellanos' options \"I would love to,\" he said. \"When I sit in my backyard and I'm looking up and just daydreaming about my dream career, it's [a vision of me being] the kid that helped bring the World Series back to Detroit. My mom was born here. My grandparents are from here. I have cousins that all go to school here ....\"So if I'm able to come over that hump, and it's myself and [Michael] Fulmer and [Shane Greene] and whoever, when we're not supposed to [win], that's Plan A....And I never leave, and I play 23 years in the big leagues here, and I'm an unbelievable right fielder and I'm in conversations with Al Kaline. That's the dream. That's the goal. That's what I love. But we all know in life, we don't always get Plan A. And you just have to make the best of whatever plan you get dealt .\" On Saturday, Castellanos was clearly one of the faces of the franchise at TigerFest and on the Winter Caravan, not only interacting with fans but showing personality. That extended to his talk with reporters, where he expressed his happiness to be a right fielder after years of scrutiny as a third baseman. Castellanos talked extensively about taking that happy feeling to the plate down the stretch. Video: Castellanos on moving to right, Candelario's impact \"To be honest, I love it out there,\" Castellanos said. \"I'm excited to get really good. I want to be called a very good outfielder. I think my arm is going to play better than it did at third base. I think my speed is going to be able to come into play a lot more than it did at third. I think that being able to be out there and be in a relaxed state of mind and not so tense at third base is going to also help me offensively. And I think that you saw that when I got put out there .\" The whole month of September, it was literally like playing backyard baseball, just joking around with the center fielder, having fun, hitting, doing whatever I could to try to win. \"To that end, Castellanos said he switched up his offseason workouts to improve his chances of sticking in right field, focusing on athleticism, agility and quickness .\" Basically I shifted my entire workout program as if I was going to be a corner in the NFL, \"he said .\" I'd run routes and do whatever. The really good outfielders are just really good athletes. And that is all I tried to be. \"Athletes as adults are just kids that just never stop doing athletic stuff. And that's all I tried to focus on this offseason, was kind of breaking down those walls and being a little kid again .\" Video: Nicholas Castellanos' 2017 Highlights That childlike enthusiasm, Castellanos said, carries over into his approach to leadership. \"I think I'm going to be a playful leader,\" he said. \"I think that it's not going to be work. My goal is that, win, lose or draw, we're kids playing baseball. And the rebuild is going to be as fun or as miserable as we make it .\" Castellanos did cite lessons he learned from Tigers veterans of years past, learning competitiveness from Ian Kinsler, how to treat people from Torii Hunter, and camaraderie from <mark>David Price</mark>. Still, Castellanos made it clear he wants to put his own stamp on helping his team. And as rough as September was for the Tigers last year, it's clear the relaxed pressure of that stretch run had an impact on him. Video: Castellanos on learning from his teammates \"I felt like for the first time that I was playing high school baseball again,\" he said. \"I didn't have anybody breathing down my neck. I didn't feel I had to do this, or I had to try to do this. I knew that I could just go about my day and have the best time, joke around, lighten the mood .\" I'm a competitor, but I'm not a very serious competitor. And I think that when you start putting handcuffs mentally on yourself when you try so hard, you get frustrated really easily, and then that's going to hinder your performance. \"Jason Beck has covered the Tigers for MLB.com since 2002. Read Beck's Blog, follow him on Twitter @ beckjason and Facebook. Read more: Detroit Tigers, Nicholas Castellanos Continue Reading View 0 Comments Hide Comments", "articleID": "2018012919_00769155_W", "names": {"David Price": ["Q1176177", "Q16063598", "Q20804677", "Q20973688", "Q332804", "Q37830471", "Q5238707", "Q5238709", "Q5238711", "Q5238712", "Q5238713", "Q5238714", "Q5238716", "Q56072488", "Q56952850", "Q634326", "Q984010"]}}, {"date": "2018-01-30", "url": "http://timesunion.com/news/politics/article/State-Department-says-no-new-Russia-sanctions-at-12535008.php", "content": "http: //www.timesunion.com/news/politics/article/State-Department-says-no-new-Russia-sanctions-at-12535008.php US issues \"Putin list' of Russian politicians, oligarchs Josh Lederman, Associated Press Updated 1:51 am, Tuesday, January 30, 2018 Photo: Mikhail Klimentyev, AP Image 1 of / 1 Caption Close Image 1 of 1 In this Jan. 26, 2018, photo, Russian President Vladimir Putin chairs a Security Council meeting in Moscow, Russia. The State Department has notified Congress that it will not impose new sanctions on Russia at this time. The State Department says it is confident that new legislation enacted last year is significantly deterring Russian defense sales. (Mikhail Klimentyev, Sputnik, Kremlin Pool Photo via AP) less In this Jan. 26, 2018, photo, Russian President Vladimir Putin chairs a Security Council meeting in Moscow, Russia. The State Department has notified Congress that it will not impose new sanctions on Russia at...more Photo: Mikhail Klimentyev, AP US issues\" Putin list' of Russian politicians, oligarchs 1 / 1 Back to Gallery WASHINGTON (AP)--The Trump administration late Monday released a long-awaited list of 114 Russian politicians and 96 \"oligarchs\" who have flourished during the reign of President Vladimir Putin, fulfilling a demand by Congress that the U.S. punish Moscow for interfering in the 2016 U.S. election. Yet the administration paired that move with a surprising announcement that it had decided not to punish anybody--for now--under new sanctions retaliating for the election-meddling. Some U.S. lawmakers accused President Donald Trump of giving Russia a free pass, fueling further questions about whether the president is unwilling to confront America's Cold War foe. Known informally as the \"Putin list,\" the seven-page unclassified document is a who's who of politically connected Russians in the country's elite class. The idea, as envisioned by Congress, is to name-and-shame those believed to be benefiting from Putin's tenure just as the United States works to isolate his government diplomatically and economically. Being on the list doesn't trigger any U.S. sanctions on the individuals, although more than a dozen are already targeted under earlier sanctions. Prime Minister <mark>Dmitry Medvedev</mark> is among the 114 senior political figures in Russia's government who made the list, along with 42 of Putin's aides, Cabinet ministers such as Foreign Minister Sergey Lavrov, and top officials in Russia's leading spy agencies, the FSB and GRU. The CEOs of major state-owned companies, including energy giant Rosneft and Sberbank, are also on the list. So are 96 wealthy Russians deemed \"oligarchs\" by the Treasury Department, which said each is believed to have assets totaling $1 billion or more. Some are the most famous of wealthy Russians, among them tycoons Roman Abramovich and Mikhail Prokhorov, who challenged Putin in the 2012 election. Aluminum magnate Oleg Deripaska, a figure in the Russia investigation over his ties to former Trump campaign chairman Paul Manafort, is included. The Trump administration had until Monday to issue the list under a law passed last year. After declining to answer questions about it throughout the day Monday, the Treasury Department released it with little fanfare 12 minutes before midnight. Even more names, including those of less-senior politicians or businesspeople worth less than $1 billion, are on a classified version of the list being provided to Congress, officials said. Drawing on U.S. intelligence, Treasury also finalized a list of at least partially state-owned companies in Russia, but that list, too, was classified and sent only to Congress. There was no immediate comment early Tuesday from the Kremlin or the Russian Embassy in Washington. In the works for months, the list has induced fear among rich Russians who are concerned that it could lead to U.S. sanctions or to being informally blacklisted in the global financial system. It triggered a fierce lobbying campaign, with Russia hawks in Congress pushing the administration to include certain names and lobbyists hired by Russian businessmen urging the administration to keep their clients off. The list's release was likely to at least partially diffuse the disappointment from some lawmakers that Trump's administration opted against targeting anyone with new Russia sanctions that took effect Monday. Under the same law that authorized the \"Putin list,\" the government was required to slap sanctions on anyone doing \"significant\" business with people linked to Russia's defense and intelligence agencies, using a blacklist the U.S. released in October. But the administration decided it didn't need to penalize anyone, even though several countries have had multibillion-dollar arms deals with Russia in the works. State Department officials said the threat of sanctions had been deterrent enough, and that \"sanctions on specific entities or individuals will not need to be imposed .\" \"We estimate that foreign governments have abandoned planned or announced purchases of several billion dollars in Russian defense acquisitions,\" said State Department spokeswoman Heather Nauert. She did not provide evidence or cite any examples. Companies or foreign governments that had been doing business with blacklisted Russian entities had been given a three-month grace period to extricate themselves from transactions, starting in October when the blacklist was published and ending Monday. But only those engaged in \"significant transactions\" are to be punished, and the United States has never defined that term or given a dollar figure. That ambiguity has made it impossible for the public to know exactly what is and isn't permissible. Late last year, Secretary of State Rex Tillerson said one reason the U.S. was proceeding cautiously was that major U.S. allies have much at stake. Turkey, a NATO ally, has a deal to buy the S-400, Russia's most advanced air defense missile system. And key security partner Saudi Arabia recently struck an array of deals with Moscow, including contracts for weapons. It was unclear whether either country had since abandoned those deals to avoid running afoul of the U.S. sanctions. New York Rep. Eliot Engel, the top Democrat on the House Foreign Affairs Committee, lambasted the move to punish no one, saying he was \"fed up\" and that Trump's administration had chosen to \"let Russia off the hook yet again .\" He dismissed the State Department's claim that \"the mere threat of sanctions\" would stop Moscow from further meddling in America's elections. \"How do you deter an attack that happened two years ago, and another that's already underway?\" Engel said. \"It just doesn't make sense .\" ___ Associated Press writer Jill Colvin contributed to this report. ___ Reach Josh Lederman on Twitter at http: //twitter.com/joshledermanAP Most Popular 1 Sheriff: Couple forges real estate transaction, moves in 2 2 homes razed after Schenectady mudslide 3 Emails: Executives gleeful over influence of Percoco, Howe 4 Longtime TU track writer Matt Graves dies at 70 5 20 things you don't know about me: Yvonne Perry 6 20 things you don't know about me: Yvonne Perry 7 RPI alumni stop donating amid concerns over leadership, campus...View Comments © 2018 Hearst Communications, Inc. .", "articleID": "2018013006_00641086_W", "names": {"Dmitry Medvedev": ["Q23530", "Q47858657"]}}, {"date": "2018-01-30", "url": "http://www.newdelhitimes.com/kochs-warm-to-trump-policies-not-behavior/", "content": "Kochs warm to Trump policies, not behavior By New Delhi Times Bureau on January 30, 2018 For the Koch brothers and their powerful donor network, the trouble with President Donald Trump isn't what he's doing. It's how he's doing it. Huddled at a private retreat in the California desert, the conservative movement's moneyed elite worried aloud this weekend that the Republican president's undisciplined behavior is clouding his achievements--and making it harder for the GOP to protect its grip on Congress heading into the 2018 midterms. \"President Trump is not helping get many Republicans elected,\" said Tom Shepherd, a Cincinnati-based businessman who joined roughly 550 Koch donors at a private retreat in the California desert this weekend. \"I think he's doing more harm than good because he's distracting people from the good work which is happening, which is either happening because of him or in spite of him .\" The frustration with the unorthodox president comes as the Kochs begin to implement their strategy to protect Republican majorities in the House and Senate this fall. The GOP has no more powerful ally than the vast political and policy network assembled by the Midwestern industrialist icons, long demonized by the left and revered by the right for their short - and long-term efforts to reshape American politics and culture. The Koch network's chief lieutenants renewed their vow this weekend to spend up to $400 million on politics and policy to shape November's midterm elections nationwide. That's more than the combined resources spent by the Republican National Committee, the National Rifle Association and the Chamber of Commerce in the 2016 election cycle. They outlined plans on Monday to spend big on political advertising now through the end of July on as many as 14 key Senate races and 15 gubernatorial elections. Their goal: Flood the airwaves with political messaging early to help shape voters' opinions long before the election season's final months. \"We need to be on offense starting now,\" said Emily Seidel, CEO of the Kochs' political arm, Americans for Prosperity. She said the network has already decided to play in Senate contests in Wisconsin, Indiana, Missouri and Florida--all seats held by vulnerable Democrats. They expect to be active in many more. And on governor's races, they're targeting Nevada, Wisconsin, Illinois, Michigan and Florida to start. The investment includes $20 million to help sell the recently adopted tax overhaul to a skeptical American public through a series of public rallies, phone banking and paid advertising. Despite the extraordinary investment, the men and women who filled the luxury resort outside Palm Springs for a three-day retreat that ended Monday acknowledged a difficult road ahead. Some blamed history more than the regular distractions from Trump. The party in the White House traditionally struggles in the first midterm election of a new presidency. \"It's a challenge regardless of the president,\" said <mark>Tim Phillips</mark>, president of Americans for Prosperity. But the donors who pledged at least $100,000 this year to the Koch network--there were an estimated 550 on hand this weekend--were less cautious when asked about the president's leadership Many opposed his candidacy before the 2016 election. The Kochs refused to endorse Trump, fearing that his style and policies might undermine conservative priorities. \"I didn't support him,\" said Frank Baxter, a retired investment banker from California who served as the ambassador to Uruguay under former President George W. Bush. \"The results are kind of changing my mind .\" Like others, he praised the tax overhaul, Trump's judicial appointments and regulatory cuts. He added, \"I still don't like what he says or does .\" <mark>Gary Lynch</mark>, whose Iowa livestock business employs roughly 700 people, said he and his business have benefited from the Republican tax overhaul. He said, however, that Trump's behavior \"doesn't help\" his party promote the benefits of the plan. \"He hasn't got it down yet,\" <mark>Lynch</mark> said of the president, noting that he doesn't mind Trump's style personally. Another former Trump critic, North Carolina-based donor Art Pope, said he's warming to the president as well. \"The policies of this administration have really benefited the American people,\" Pope said. He's still worried about the political climate heading into the midterms: \"It's going to be a tough election .\" Democrats need to pick up at least 24 seats nationwide this fall to claim the House majority for the last two years of Trump's first term. Recent Democratic wins in Alabama and Virginia, backed by Trump's low approval ratings, suggest the GOP is in trouble. When asked about his party's 2018 prospects, Rep. <mark>Mark Meadows</mark>, R-N.C., among a handful of elected officials who attended the Koch conference, acknowledged that the House majority is at risk. \"I can make the case for losing 18 seats and no more. I can make the case for 28 seats,\" he said. \"It's a long ways off. It depends what we do between now and November .\" As the White House and Republicans nationwide work to highlight the strong U.S. economy, Trump intensified a weekend feud with the rapper Jay-Z on Twitter. The musician said over the weekend the president's recent vulgar comments about African countries and Haiti were \"disappointing\" and \"hurtful .\" Trump punched back on Twitter, urging his followers to inform Jay-Z that \"because of my policies,\" unemployment among black Americans is at the \"LOWEST RATE EVER RECORDED!\" Back at the Koch retreat, prominent Trump donor Doug Deason said he enjoyed the president's social media habits, which allow him to speak directly to the American people. \"I don't think it helps. I don't think it hurts,\" Deason said. He noted that the Koch network would \"spend a lot of money\" to ensure the benefits of the tax overhaul aren't overshadowed by any distractions. \"Who gives a crap about Jay-Z?\" Deason asked. \"I don't .\" Credit: Associated Press (AP) | Photo Credit: (AP)", "articleID": "2018013015_00765528_W", "names": {"Gary Lynch": ["Q21062326", "Q5525497"]}}]