[{"date": "2018-01-30", "url": "http://www.newdelhitimes.com/kochs-warm-to-trump-policies-not-behavior/", "content": "Kochs warm to Trump policies, not behavior By New Delhi Times Bureau on January 30, 2018 For the Koch brothers and their powerful donor network, the trouble with President Donald Trump isn't what he's doing. It's how he's doing it. Huddled at a private retreat in the California desert, the conservative movement's moneyed elite worried aloud this weekend that the Republican president's undisciplined behavior is clouding his achievements--and making it harder for the GOP to protect its grip on Congress heading into the 2018 midterms. \"President Trump is not helping get many Republicans elected,\" said Tom Shepherd, a Cincinnati-based businessman who joined roughly 550 Koch donors at a private retreat in the California desert this weekend. \"I think he's doing more harm than good because he's distracting people from the good work which is happening, which is either happening because of him or in spite of him .\" The frustration with the unorthodox president comes as the Kochs begin to implement their strategy to protect Republican majorities in the House and Senate this fall. The GOP has no more powerful ally than the vast political and policy network assembled by the Midwestern industrialist icons, long demonized by the left and revered by the right for their short - and long-term efforts to reshape American politics and culture. The Koch network's chief lieutenants renewed their vow this weekend to spend up to $400 million on politics and policy to shape November's midterm elections nationwide. That's more than the combined resources spent by the Republican National Committee, the National Rifle Association and the Chamber of Commerce in the 2016 election cycle. They outlined plans on Monday to spend big on political advertising now through the end of July on as many as 14 key Senate races and 15 gubernatorial elections. Their goal: Flood the airwaves with political messaging early to help shape voters' opinions long before the election season's final months. \"We need to be on offense starting now,\" said Emily Seidel, CEO of the Kochs' political arm, Americans for Prosperity. She said the network has already decided to play in Senate contests in Wisconsin, Indiana, Missouri and Florida--all seats held by vulnerable Democrats. They expect to be active in many more. And on governor's races, they're targeting Nevada, Wisconsin, Illinois, Michigan and Florida to start. The investment includes $20 million to help sell the recently adopted tax overhaul to a skeptical American public through a series of public rallies, phone banking and paid advertising. Despite the extraordinary investment, the men and women who filled the luxury resort outside Palm Springs for a three-day retreat that ended Monday acknowledged a difficult road ahead. Some blamed history more than the regular distractions from Trump. The party in the White House traditionally struggles in the first midterm election of a new presidency. \"It's a challenge regardless of the president,\" said <mark>Tim Phillips</mark>, president of Americans for Prosperity. But the donors who pledged at least $100,000 this year to the Koch network--there were an estimated 550 on hand this weekend--were less cautious when asked about the president's leadership Many opposed his candidacy before the 2016 election. The Kochs refused to endorse Trump, fearing that his style and policies might undermine conservative priorities. \"I didn't support him,\" said Frank Baxter, a retired investment banker from California who served as the ambassador to Uruguay under former President George W. Bush. \"The results are kind of changing my mind .\" Like others, he praised the tax overhaul, Trump's judicial appointments and regulatory cuts. He added, \"I still don't like what he says or does .\" <mark>Gary Lynch</mark>, whose Iowa livestock business employs roughly 700 people, said he and his business have benefited from the Republican tax overhaul. He said, however, that Trump's behavior \"doesn't help\" his party promote the benefits of the plan. \"He hasn't got it down yet,\" <mark>Lynch</mark> said of the president, noting that he doesn't mind Trump's style personally. Another former Trump critic, North Carolina-based donor Art Pope, said he's warming to the president as well. \"The policies of this administration have really benefited the American people,\" Pope said. He's still worried about the political climate heading into the midterms: \"It's going to be a tough election .\" Democrats need to pick up at least 24 seats nationwide this fall to claim the House majority for the last two years of Trump's first term. Recent Democratic wins in Alabama and Virginia, backed by Trump's low approval ratings, suggest the GOP is in trouble. When asked about his party's 2018 prospects, Rep. <mark>Mark Meadows</mark>, R-N.C., among a handful of elected officials who attended the Koch conference, acknowledged that the House majority is at risk. \"I can make the case for losing 18 seats and no more. I can make the case for 28 seats,\" he said. \"It's a long ways off. It depends what we do between now and November .\" As the White House and Republicans nationwide work to highlight the strong U.S. economy, Trump intensified a weekend feud with the rapper Jay-Z on Twitter. The musician said over the weekend the president's recent vulgar comments about African countries and Haiti were \"disappointing\" and \"hurtful .\" Trump punched back on Twitter, urging his followers to inform Jay-Z that \"because of my policies,\" unemployment among black Americans is at the \"LOWEST RATE EVER RECORDED!\" Back at the Koch retreat, prominent Trump donor Doug Deason said he enjoyed the president's social media habits, which allow him to speak directly to the American people. \"I don't think it helps. I don't think it hurts,\" Deason said. He noted that the Koch network would \"spend a lot of money\" to ensure the benefits of the tax overhaul aren't overshadowed by any distractions. \"Who gives a crap about Jay-Z?\" Deason asked. \"I don't .\" Credit: Associated Press (AP) | Photo Credit: (AP)", "articleID": "2018013015_00765528_W", "names": {"Mark Meadows": ["Q3956796", "Q6768847", "Q6768848"], "Tim Phillips": ["Q40249374", "Q59309816", "Q7804108", "Q7804110", "Q7804112", "Q7804113"]}}, {"date": "2018-01-31", "url": "http://sootoday.com/world-news/so-much-for-speech-trump-on-hot-mic-says-hell-release-memo-826920", "content": "SooToday.com World News So much for speech: Trump on hot mic says he'll release memo WASHINGTON--Scenes from the Capitol on a night of pomp, pageantry and politics for the State of the Union address: Talk about stepping on one's message. Jan 31, 2018 12:25 AM by: Canadian Press WASHINGTON--Scenes from the Capitol on a night of pomp, pageantry and politics for the State of the Union address: Talk about stepping on one's message. Schmoozing in the House chamber after delivering his maiden State of the Union speech, a hot mic caught President Donald Trump telling a Republican lawmaker that he was \"100 per cent\" in favour of making public a classified Republican intelligence memo. That was further than the White House had gone on the matter and not something Trump had said during the hour-plus speech he had finished moments earlier. In the C-SPAN video, Rep. <mark>Jeff Duncan</mark>, R-S.C., urged Trump to release the memo. Trump, with a microphone nearby, can be heard saying, \"Don't worry, 100 per cent .\" The White House had said earlier Tuesday that it would conduct a legal and national security review before Trump decides whether to release the memo. It has sparked a political fight pitting Republicans against the FBI and the Department of Justice. ___ It's not a question that typically needs asking. But yes, the White House says, Melania Trump rode back from the Capitol in the same car as her husband, President Donald Trump, after his State of the Union speech. That wasn't a foregone conclusion. The first lady had not been seen in public with her husband since the Wall Street Journal reported that lawyers for Trump paid Stormy Daniels $130,000 to stay quiet about what the porn star said was an affair with the future president. Daniels said in a statement Tuesday that the affair she had described never happened. The couple's 13th anniversary passed without public comment. And Mrs. Trump abruptly cancelled her trip with the president to Davos, Switzerland, for an economic summit. Mrs. Trump travelled separately from her husband to the Capitol for the address. Her aide said she had held receptions at both places for the guests seated with her for the speech. The president began his speech by acknowledging \"the first lady\" along with other congressional leaders. Mrs. Trump did not visibly react. ___ It wasn't the longest State of the Union address. That designation still goes to former President Bill Clinton. But an hour and 20 minutes of President Donald Trump talking Tuesday was plenty long enough for House Democrats. Just before Trump finished, their leader, Rep. Nancy Pelosi, made eye contact with Rep. <mark>Joe Crowley</mark> of New York and pointed toward the back of the House chamber. Democrats followed their lead and made an unusually quick beeline for the exits. Earlier, Pelosi had warned House Democrats not to leave the chamber mid-speech. Trump's first State of the Union address clocked in at about eight minutes shorter than the final such address by Clinton. ___ They could all agree to support 12-year-old Preston Sharp and his project to plant flags on the graves of veterans. But it was a different story when President Donald Trump used that good deed to scold athletes, ahead of the Super Bowl, who kneel during the national anthem. Members of Congress, the Cabinet, the Supreme Court and assorted guests applauded Trump's shout-out to Preston, who noticed that not every grave was decorated with a flag at the California veterans' cemetery where his grandfather was buried. He started collecting donations and, two years later, had decorated 23,000 graves. \"Preston's reverence for those who have served our nation reminds us why we salute our flag, why we put our hands on our hearts for the pledge of allegiance,\" Trump said during his speech, drawing applause. But the mood changed when the president added: \"...and why we proudly stand for the national anthem .\" GOP lawmakers erupted in applause. Democrats were far more muted. Trump was a leading critic of NFL players, predominantly African-American, during last fall's protests. Vice-President Mike Pence abruptly left an Indianapolis Colts game after almost two dozen members of the San Francisco 49ers knelt during \"The Star-Spangled Banner .\" ___ Their leader, Nancy Pelosi, warned Democrats to behave during Trump's address and \"let the attention be on his slobbering self .\" The president didn't slobber. Some Democrats couldn't hold back, especially when Trump mentioned immigration issues. \"Oh, c'mon,\" Rep. <mark>Joe Crowley</mark>, D-N.Y., audibly enough to be heard in the gallery overhead, as Trump mentioned open borders, letting in drugs and gangs. They laughed out loud when Trump cast his immigration proposal as a down-the-middle compromise. And they groaned when Trump spoke of ending \"chain migration .\" Pelosi extended her hands to try to quiet her colleagues. ___ Rep. Rodney Davis, R-Ill ., strolled through the Capitol before the speech with a guest who was attracting more attention than he was. Tall and sporting a ponytail was Jayson Werth, an outfielder who played the last several years for the local Washington Nationals. Werth said he has an organic farm in Davis' district. Asked if he was a Trump supporter, Werth said he was a moderate. \"I'm just spreading my wings a little bit,\" he said. ___ Associated Press writers Matthew Daly and Alan Fram contributed to this report. ___ Follow Kellman on Twitter at www.twitter.com/APLaurieKellman Laurie Kellman, The Associated Press", "articleID": "2018013105_00456147_W", "names": {"Jeff Duncan": ["Q1027026", "Q6173749", "Q6173752"], "Joe Crowley": ["Q16730310", "Q21717752"]}}, {"date": "2018-02-01", "url": "http://kgun9.com/news/local-news/potholes-repaired-on-northwest-side", "content": "Potholes repaired on northwest side Pothole Patrol fixes roads again 9:55 AM, Feb 1, 2018 49 mins ago Next Pothole Patrol fixes potholes on northwest side thanks to viewer email. Copyright 2017 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next TUCSON (KGUN-TV) - Kathy Hamstra emailed the Pothole Patrol with <mark>Big Al</mark> about potholes plaguing the northwest side. She sent two pictures of potholes on Ina and Shannon saying, \"All I want for Christmas is these potholes fixed!\" We called Pima County DOT and they repaired the potholes in January. Roger Rd. between Oracle and Romero is in queue to be repaired. On the east side, a pothole near a crosswalk at 5h and Pantano is being reported to the City of Tucson DOT for repair. Have potholes on your commute or in your community? Send an email to Potholes @ KGUN9.com. <mark>Big Al</mark> Traffic Pal has been in the Tucson community delivering traffic updates since 1988. You can reach him here. Copyright 2018 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2018020117_01314634_W", "names": {"Big Al": ["Q4723642", "Q4904920"]}}, {"date": "2018-02-01", "url": "http://www.nationalmemo.com/red-cross-general-counsel-resigns-handling-sexual-assault-allegations/", "content": "Red Cross General Counsel Resigns Over Handling of Sexual Assault Allegations February 1, 2018 sexual harassment American Red Cross General Counsel <mark>David Meltzer</mark> has resigned after a ProPublica story detailed troubling aspects of how he handled a sexual misconduct case involving another senior official at the charity. In his resignation letter, dated Jan. 31 and effective immediately, <mark>Meltzer</mark> wrote to American Red Cross CEO Gail McGovern that he deeply regretted his handling of the case. \"I want to ensure that the reputation of the institution remains strong and that nothing interferes with the organization's ability to effectively carry out its important mission,\" his letter says. In an organization-wide email this morning, McGovern announced the resignation. \"Over the course of the last year, we have seen news accounts of other organizations and institutions contending with serious instances of sexual harassment and the harmful repercussions that such misconduct can create. Last week, it was our organization's turn to again struggle with these issues,\" McGovern wrote. \"I am committed to moving forward in a way that strengthens us as an organization .\" ProPublica's story last week reported that in 2012 the charity pushed out a senior executive in its international division, <mark>Gerald Anderson</mark>, after an internal investigation concluded he sexually harassed at least one subordinate. Another Red Cross employee accused him of rape. Through his lawyer, <mark>Anderson</mark> has denied any sexual misconduct. Save the Children, which hired <mark>Anderson</mark> after he left the Red Cross, said in a statement today that \"<mark>Anderson</mark> is no longer employed by Save the Children .\" At the conclusion of the investigation in 2012, <mark>Meltzer</mark> sent out an email announcing <mark>Anderson</mark>'s departure in which <mark>Meltzer</mark> praised <mark>Anderson</mark> for his \"dedication\" and \"leadership .\" <mark>Meltzer</mark> then angered some employees at a staff meeting when he said he wished <mark>Anderson</mark> were staying at the charity, according to several people who attended. Shortly after he left the Red Cross, <mark>Anderson</mark> got a job as senior director for humanitarian response at Save the Children, a global charity based in Connecticut. <mark>Anderson</mark> was given a positive reference by a senior Red Cross official, according to Save the Children. The Red Cross said last week it was taking disciplinary action because of the positive reference but declined to provide details. In his resignation letter, <mark>Meltzer</mark> apologized for his statements around <mark>Anderson</mark>'s departure. \"I deeply regret the damage this language may have caused the organization and its wonderful staff--particularly the employees involved in this matter,\" he wrote. \"I also deeply regret that my words could have undermined confidence in the commitment of the Red Cross to properly address complaints of this nature. I would never want to be the cause of such a result. Rather, I feel strongly that every employee must feel comfortable and protected in reporting harassment and other misconduct to management .\" <mark>Meltzer</mark> couldn't immediately be reached for comment. <mark>Meltzer</mark>'s resignation follows what multiple staffers described as a tense week at the charity. At an emotional staff meeting last week of the International Services Department, where <mark>Anderson</mark> and his accusers had worked, multiple employees called for <mark>Meltzer</mark>'s resignation and a public apology to the two women who made the allegations in 2012. <mark>Meltzer</mark> worked for the Red Cross for over 12 years, rising from senior vice president for international services to a dual role as general counsel and chief international officer. In those positions, he helped oversee some of the charity's largest--and at times, most troubled--projects. He played a leading role in its half-billion-dollar relief program after the 2010 Haiti earthquake, the subject of a previous investigation by ProPublica and NPR. <mark>Meltzer</mark> has also tried to manage the charity's relationship with overseers on Capitol Hill. A 2016 Senate report found that <mark>Meltzer</mark> had successfully maneuvered to limit the scope of an inquiry into the charity's disaster relief operations by the Government Accountability Office. ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for their newsletter.", "articleID": "2018020122_01112723_W", "names": {"David Meltzer": ["Q19664344", "Q3018441"], "Gerald Anderson": ["Q16146030", "Q2412115", "Q596137"]}}, {"date": "2018-02-01", "url": "http://pilotonline.com/news/nation-world/world/article_51e938e1-72a1-5b64-bd27-2e890127dd1e.html", "content": "Save wire A grisly photo of an execution 50 years ago shocked the world and helped end the Vietnam war By Michael E. Ruane Buy Now In this Feb. 1, 1968, file photo, South Vietnamese Gen. Nguyen Ngoc Loan, chief of the National Police, fires his pistol into the head of suspected Viet Cong officer Nguyen Van Lem (also known as Bay Lop) on a Saigon street, early in the Tet Offensive. The photo showed the war's brutality in a way Americans hadn't seen before. Protesters saw it as graphic evidence that the U.S. was fighting on the side of an unjust government. Eddie Adams | Associated Press Save WASHINGTON Before he pulls the trigger, the South Vietnamese general waves his soldiers out of the way so they don't get hurt. He shoos them with the pistol he holds in his right hand, and flicks out his left hand as he approaches the prisoner standing before him. His men guess what's coming, and scatter. The general raises the shiny snub-nose .38, points it at the prisoner's right temple and pulls the trigger. At that instant on the sunny Thursday of Feb. 1, 1968, in what was then called Saigon, Associated Press photographer Eddie Adams' camera shutter clicked once and one of the most powerful pictures of the Vietnam War, or any war, was taken. In 1/500th of a second, Adams caught the moment the bullet crashed through the Viet Cong prisoner's skull at about 600 mph, distorting his face, tousling his hair and shoving his head off center. Some people say you can see the bullet coming out the other side. Adams thought it was still inside. It's hard to tell. In the picture, Gen. Nguyen Ngoc Loan, the head of South Vietnam's National Police, stares coldly at his victim. Loan, who had a reputation as a government enforcer, is a thin man with a receding hairline who seems to be wearing a bulky flak vest. His shirt sleeves are rolled up, showing the sinews in his forearm. The gun looks like it has recoiled slightly upward. Off to the left in the frame, another soldier winces. The prisoner, whose hands are bound behind him, already has a fat lip, likely acquired when he was captured after leading a brutal commando raid. He wears dark shorts, a plaid shirt and no shoes. On film footage of the incident, the shooting scene unfolds in about 10 seconds. (Adams can be seen for an instant in an earlier part of the footage .) The prisoner, Viet Cong officer Nguyen Van Lem, tumbles to the pavement, blood spouting from his head. Loan calmly holsters his pistol, saying to Adams, \"they killed many of my men and many of your people,\" and walks away. Adams waits until the blood stops gushing. \"It was gross,\" he would say later. He takes a few more pictures of the body then returns to the Associated Press office to drop off his film. No big deal. \"I thought absolutely nothing of it,\" he said in an interview that later became part of a Newseum podcast. \"I said' I think I got some guy shooting somebody .' And, uh, I went to lunch .\" Just another day on the bloody streets of Saigon in the midst of the enemy's famous Tet offensive - sweeping guerrilla attacks across South Vietnam - during the endless Vietnam War. \"So what?\" Adams, a former U.S. Marine from a small town north of Pittsburgh, said later. \"It was a war. I'm serious. That's how I felt. I had seen so many people die at that point in my life .\" Adams did not realize he had taken one of history's great pictures. He did not know it was a shot that would summarize in a millisecond the savage, seemingly mindless, violence of the war. He had no idea that his photograph, snapped 50 years ago Thursday, would help change history, and echo throughout his life and that of his surviving subject. \"He wasn't allowed to forget that photograph,\" Loan's son, August, said in a 2008 documentary. \"It stuck with him everywhere he went .\" The picture ran on the front pages of many U.S. newspapers and the footage ran on TV. But it was the photograph, and its frozen portrait of agony, that fueled the antiwar movement and helped end U.S. involvement. \"It just kind of summed up the whole war,\" former CBS News anchor Bob Schieffer said in the short film \"Eddie Adams: Saigon' 68\" by <mark>Douglas Sloan</mark>. \"The horrificness of it stops you,\" the late Life Magazine photographer Bill Eppridge said in the 20128 documentary. \"I think his picture was the moment that changed the war .\" David Hume Kennerly, a fellow Vietnam War photographer, who was the former chief White House photographer and a friend of Adams's, compared the picture with that of <mark>Joe Rosenthal</mark>'s famous shot of U.S. Marines raising the flag on Iwo Jima in World War II. \"Where <mark>Joe Rosenthal</mark>'s picture represented the heroism...and courage in war and patriotism...Eddie's picture was exactly the opposite,\" Kennerly said in a telephone interview. \"Eddie's picture was the real underbelly of violence and summary execution...It's what war is really like .\" \"I don't know that it ended the Vietnam War, but it sure as hell didn't help the cause for the government,\" he said. \"One thing I know for sure, anybody who's ever seen that photo has never forgotten it .\" In 1969, Adams was awarded a Pulitzer Prize for the shot. But he felt terrible about the photo, which he didn't think was that good, and bitter about the prize, according to interviews he gave over the years. He believed he had taken far more worthy pictures, and that the execution photo was viewed out of context by most people: The slain Viet Cong prisoner was suspected in the murder of a South Vietnamese officer, his wife and children. Adams believed he had destroyed Gen. Loan's life. \"Two people died in that photograph,\" Adams wrote in Time magazine years later. \"The recipient of the bullet and General Nguyen Ngoc Loan. The general killed the Viet Cong; I killed the general with my camera .\" \"General Loan was...a real warrior,\" Adams wrote in a Time eulogy for Loan. \"I'm not saying what he did was right, but you have to put yourself in his position...He never blamed me. He told me if I hadn't taken the picture, someone else would have, but I've felt bad for him and his family for a long time .\" Loan, who later lost a leg in combat, was treated for the injury at Washington's old Walter Reed Army Hospital in 1969, which outraged some people. The late Sen. <mark>Stephen Young</mark>, D-Ohio, called Loan a \"brutal murderer,\" and his treatment in the U.S. \"a disgraceful end to a...disgraceful episode .\" Loan was university-educated and had become a jet pilot before he was named national police chief. He was married and had five children. After the war, he made his way with his family to the United States and ran a restaurant in northern Virginia. But the photograph stalked him. In the restaurant men's room, someone scrawled on the wall: \"We know who you are, you f--\"In 1976, he told a Washington Post reporter he was trying\" to think about the present and the future of my children. I have no time to think back or regrets. \"In 1978, the government moved to deport him .\" Gen Loan cold-bloodedly shot and killed another human being, \"former Rep. Elizabeth Holtzman, D-N.Y., wrote at the time .\" By any standard what he did was immoral. \"But Loan had local support and was never deported. Twenty years later, on July 14, 1998, he died at home in Burke, Virginia, at the age of 67. Adams, a rough-edged, cantankerous figure who had great fame after the war, also was haunted by the photo, among other things. In the documentary, he said that when he died he wanted to be buried in his Marine Corps\" dress blues \"uniform. He wanted a 35mm camera with a wide-angle lens, and he wanted some slow speed color film .\" Because where I go there's going to be a lot of light, \"he said .\" And it (won't be) from up above either. Fire, you can photograph really well with a slow speed film. \"Adams died of Lou Gehrig's disease on Sept. 18, 2004, in New York City. He was 71. He was laid to rest beside his father just outside his home town of New Kensington, Pa.. He didn't fit into his old uniform, his widow, Alyssa, said. But she did bury him with a camera. --", "articleID": "2018020123_00016086_W", "names": {"Douglas Sloan": ["Q4354495", "Q5301980"], "Joe Rosenthal": ["Q17483916", "Q6212081"], "Stephen Young": ["Q21458224", "Q27924846", "Q3498689", "Q50365763", "Q7609865"]}}]