[{"date": "2018-02-02", "url": "https://www.pr.com/press-release/743175", "content": "Receive press releases from Shero Comics: By Email RSS Feeds: The Comic Book World Marvels as a Black Shero Emerges with New Release in Graphic Novel Series, Rayven Choi Rayven Choi book series creates a historic moment, just in time for Black History Month. Los Angeles, CA, February 02, 2018--(PR.com)--This February, Marvel's \"Black Panther\" won't be the only comic book hero making black history when award-winning writer, Shequeta <mark>L. Smith</mark>, releases the third installment of her female empowered graphic novel series, \"Rayven Choi,\" on February 7, 2018. The graphic novel series is centered on the story of Rayven Choi, a young African-American woman who witnesses the murder of her parents by a hit man. Choi finds herself growing up in Seoul, Korea where she's adopted and is influenced by the local culture. As an adult, Choi returns to America to uncover the truth behind her parents' murders with the intention of finding the hit man who destroyed her family. The first two books, published under the \"Shero Comics\" indie imprint, have quickly gained popularity amongst seasoned comic book fans. The books have been highlighted in several popular blogs, podcasts, and newspapers and were most notably featured in Publisher's Weekly under the evocative headline: \"The World Needs More Sheroes .\" <mark>Smith</mark>, who is based in Los Angeles, recently completed a lengthy, multi-city, \"Year of Rayven Choi,\" book tour in 2017 that included multiple stops on military bases. Following the release of Rayven Choi Chapter 3, <mark>Smith</mark> will be heading across the pond with her \"Shero Universe\" book tour that will feature stops in South Korea, Mexico, and Canada. Additionally, all three books in the series have been translated into Spanish and Hangul (Korean), with upcoming scheduled releases in South Korea and Mexico - something that <mark>Smith</mark> hopes will help to further reach the international audience she's been targeting. \"I created Rayven Choi with the idea that I could present a black female character that the entire world could relate to. So it's extremely exciting to not only be releasing the third book in the series but to personally introduce Rayven to the world with the Shero Universe book tour,\" said <mark>Smith</mark>. Rayven Choi Chapter 3 will be available as an eBook on Amazon Kindle, Comixology, Barnes & Noble Nook, Kobo, and iTunes. Physical copies will be on sale on the Shero Comics webstore and at several brick and mortar stores in Los Angeles, Chicago, North Carolina, and Florida. For more information on <mark>Smith</mark> or the Rayven Choi series, please visit www.sherocomics.comA bout Shequeta <mark>L.</mark> SmithShequeta <mark>L. Smith</mark> is a writer and filmmaker located in Los Angeles, California. <mark>Smith</mark> recently beat more than 5,000 entrants to become the only individual female director, of the Top 20 finalists, in HBO's Project Greenlight. After her success with the project, <mark>Smith</mark> decided to adapt her award-winning screenplay, Rayven Choi, into a graphic novel series. Additionally, she shot an innovative 14-minute short film based on the first three books in the series. For more information on Shequeta <mark>L. Smith</mark> and her company, Shero Comics, visit www.sherocomics.com Contact Information", "articleID": "2018020208_00745096_W", "names": {"L. Smith": ["Q16885749", "Q27597449", "Q54911965"]}}, {"date": "2018-02-02", "url": "http://uk.reuters.com/article/uk-venezuela-politics-usa/venezuela-derides-u-s-comments-on-military-ouster-of-maduro-idUKKBN1FM1ZE?il=0", "content": "February 2, 2018 / 3:34 PM / Updated 19 minutes ago Venezuela derides U.S. comments on military ouster of Maduro Alexandra Ulmer, Vivian Sequera 4 Min Read CARACAS (Reuters) - Venezuela condemned on Friday U.S. comments that its own military could topple President Nicolas Maduro and said a Latin American tour by Secretary of State Rex Tillerson was seeking a regional \"intervention\" against the socialist government. Accusing Washington of seeking to undermine democracy in Latin America and return to the days of \"imperialism,\" Defence Minister Vladimir Padrino lashed out at Tillerson during a broadcast on state television. \"Every day he distances himself more from diplomacy to enter into war-mongering. You have no moral authority,\" said Padrino, flanked by armed forces' top brass who swore loyalty to Maduro. \"This man...will try to persuade Latin America governments to intervene in Venezuela. That's a publicity stunt,\" he added, blaming U.S. President Donald Trump's sanctions for economic hardship in Venezuela. On Thursday, Tillerson raised the prospect of a Venezuelan military coup ahead of a five-day tour of Latin America. Discussing Venezuela, the U.S. official said militaries in Latin America often \"handled\" transitions from bad governments, but insisted he was not advocating \"regime change .\" \"If the kitchen gets a little too hot for him, I am sure that he's got some friends over in Cuba that could give him a nice hacienda on the beach and he could have a nice life over there,\" Tillerson said, referring to 55-year-old Maduro, who has a close relationship with Cuba's communist government. U.S. Secretary of State Rex Tillerson steps off his plane as he arrives to the presidential hangar in Mexico City, Mexico February 1, 2018. REUTERS/Henry Romero Many opposition leaders would love for Maduro to seek exile abroad. The former bus driver and union leader is widely disliked in Venezuela due to a brutal economic crisis that has sparked malnutrition, disease and mass emigration. But even some anti-government activists fear Washington's heavy-handed approach will only foster unity between the Socialist Party and the armed forces, as they would be loathe to seem to be taking orders from Washington. The U.S. comments will likely also cause unease in capitals of Latin America, where memories are rife of U.S. backing for right-wing dictators during the Cold War. That could hamper Tillerson's ability to reach a consensus on Venezuela during his trip. Senior military leaders have consistently stood by Maduro, whom critics accuse of turning Venezuela into a dictatorship and wrecking its economy. But discontent among the rank-and-file, especially at their own economic penuries, is evident. There have been some small uprisings against Maduro from within the security forces. A National Guard captain led an attack on a barracks but was later arrested, and a police helicopter pilot lobbed grenades at government buildings but was tracked down and killed last month. Venezuela's opposition leaders have long urged the military to take action to force Maduro to follow the constitution. He maintains the United States and opposition parties are part of an international right-wing conspiracy to oust him and get their hands on the OPEC nation's oil wealth. Trump has himself suggested possible military intervention in Venezuela, though that was widely rejected in Latin America. Trump has imposed individual and economic sanctions on Venezuela's government, accusing it of rights abuses and corruption. Venezuelan officials say Tillerson is particularly bitter towards them because he was chief executive of Exxon Mobil Corp when late leader <mark>Hugo Chavez</mark> nationalized one of its oil projects in the South American nation a decade ago. Additional reporting by Girish Gupta, Andreina Aponte, <mark>Andrew</mark> Cawthorne; Writing by Alexandra Ulmer and <mark>Andrew</mark> Cawthorne; Editing by Bernadette Baum and <mark>Andrew Hay</mark>", "articleID": "2018020217_00902559_W", "names": {"Andrew Hay": ["Q21174027", "Q21456447", "Q39078862", "Q43912209"], "Hugo Chavez": ["Q732006", "Q8440"]}}, {"date": "2018-02-02", "url": "http://www.kltv.com/story/37414403/officials-owner-of-houston-company-illegally-dumped-waste", "content": "Officials: Owner of Houston company illegally dumped waste - KLTV.com - Tyler, Longview, Jacksonville | ETX News Officials: Owner of Houston company illegally dumped waste - KLTV.com - Tyler, Longview, Jacksonville | ETX News Member Center: Officials: Owner of Houston company illegally dumped waste 2018-02-02T17:10:16 Z2018-02-02T17:10:16 Z HOUSTON (AP) - Prosecutors say the majority owner of a Houston company illegally dumped chemicals into the city's storm-drain system that were so toxic they \"would burn the skin off your bones .\" The Harris County district attorney's office said in a statement Friday that 50-year-old <mark>Ronald Wright</mark> was indicted a day earlier on charges that include improper disposal and storage of hazardous materials. Officials say the dumping occurred as recently as last month. The general manager of <mark>Wright</mark> Containers also was indicted. Companies in the oil and gas industry would ship waste to <mark>Wright</mark> for disposal but prosecutors say the waste was repeatedly dumped into the drainage system. Benzene was among the toxic material that was dumped. A message left for <mark>Wright</mark> at his company was not immediately returned. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Can't Find Something?", "articleID": "2018020217_01239233_W", "names": {"Ronald Wright": ["Q1348862", "Q6111695"]}}, {"date": "2018-02-06", "url": "http://daytondailynews.com/news/national-govt--politics/the-latest-pence-japan-boost-pressure-north-korea/OHy4iBUOLphsN65DRzzueM/", "content": "0 Nation & World View Caption Hide Caption Vice President Mike Pence addresses the media before a briefing on missile defense with Alaska Gov. <mark>Bill Walker</mark> and Gen. Lori J. Robinson, Commander, United States Northern Command and North American Aerospace Defense Command, at Joint Base Elemendord-Richardson, Alaska, Monday, Feb. 5, 2018. (AP Photo/Zeke Miller TOKYO The Latest on Vice President Mike Pence (all times local): 9:35 p.m. U.S. Vice President Mike Pence has arrived in Japan on the second stop of his Asia swing that he says will boost pressure on North Korea over its nuclear program during the Winter Olympic games in the South. In Japan, Pence says he will meet with Prime Minister Shinzo Abe to show \"solidarity,\" in the face of the North Korean threat and with U.S. service members who would be among the first to respond to a crisis. Pence departs for South Korea Thursday, where he will meet with President Moon Jae-in and attend the opening of the games Friday night. Pence says he wants to help \"make sure that North Korea doesn't use the powerful symbolism and the backdrop of the Winter Olympics to paper over the truth about their regime .\" ___ 8:30 p.m. U.S. Vice President Mike Pence has not ruled out the possibility of meeting with North Korean officials at the upcoming Olympics in South Korea. Pence spoke before departing Monday for a six-day swing through Asia that will be highlighted by his stop at the Pyeongchang Games. He says no plans have been made for him to meet with any members of the North Korean delegation. North Korea is sending its nominal head of state, Kim Jong Nam--the highest-level visitor to the South from the North in recent memory. Pence says he hasn't requested any meeting \"but we'll see what happens .\" View Comments 0", "articleID": "2018020613_00028406_W", "names": {"Bill Walker": ["Q18159074", "Q25473882", "Q4911260", "Q4911261", "Q4911262", "Q4911263", "Q4911264", "Q4911267", "Q547758", "Q862635"]}}, {"date": "2018-02-06", "url": "http://www.cachevalleydaily.com/news/national/article_370b2162-8c03-54e2-a624-da56e46a118c.html#user-comment-area", "content": "SAN FRANCISCO (AP)--A federal appeals court on Tuesday upheld an agreement requiring President <mark>Donald Trump</mark> to pay $25 million to settle lawsuits accusing his now-defunct <mark>Trump</mark> University of fraud. The 9th U.S. Circuit Court of Appeals rejected an effort by student Sherri Simpson to opt out of the deal and pursue her own lawsuit. The move would have derailed the settlement resolving lawsuits that claimed the university pressured students to spend tens of thousands of dollars but then failed to deliver on promises to teach them how to be successful in real estate. Simpson didn't drop out of the agreement initially and claimed she had the right to do so before it was finalized. A three-judge panel of the court unanimously disagreed, saying neither a notice to affected students nor due process gave her a second chance to opt out. The court also said U.S. District Judge <mark>Gonzalo Curiel</mark> had ample reason to approve the deal. \"Both classes of plaintiffs would have faced significant hurdles had they proceeded to trial, including the difficulty of prevailing in a jury trial against either the president-elect (if the trial had proceeded as scheduled) or the sitting president,\" Judge Jacqueline Nguyen wrote for the panel. An attorney for Simpson referred comment to another attorney, who did not immediately respond. The two class-action lawsuits and a civil lawsuit by New York Attorney General Eric Schneiderman followed <mark>Trump</mark> throughout the presidential campaign. <mark>Trump</mark> fueled the controversy by repeatedly insinuating that <mark>Curiel</mark>'s Mexican heritage made him biased against <mark>Trump</mark>. <mark>Trump</mark> had vowed never to settle but said after the election that he didn't have time for a trial. The president did not acknowledge any wrongdoing under the terms of the settlement. In a statement Tuesday, Scheiderman said the 9th Circuit ruling \"means that victims of <mark>Donald Trump</mark>'s fraudulent university will soon receive the $25 million in relief they deserve .\" Plaintiffs' attorneys have said about 3,730 people will get at least 90 percent of their money back under the deal. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. © 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2018020620_00245659_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Gonzalo Curiel": ["Q26467337", "Q5582231"]}}, {"date": "2018-02-06", "url": "http://www.startribune.com/local/472987163.html", "content": "East Metro 472987163 Decision in Fischbach lawsuit pending as legislative session looms Judge John Guthmann declined to say whether he would decide on lieutenant governor's bid to stay in Senate before session starts Feb. 20. By Chao Xiong Star Tribune February 6, 2018--1:44 pm Purchase: Order Reprint The legal question of whether Minnesota Lt. Gov. Michelle Fischbach can remain a state senator may not be resolved before the start of the upcoming legislative session. Ramsey County District Court Judge John Guthmann heard arguments Tuesday morning from attorney Charles Nauen, who argued that the state Constitution demands that Fischbach resign her legislative seat now that she has ascended to lieutenant governor. The outcome of the lawsuit has the potential to realign power between the majority GOP and minority DFL in the closely divided Senate. Fischbach's attorney, Kevin Magnuson, argued that the suit should be dismissed because the court has no jurisdiction over the dual offices, which he said is allowed under the state Constitution. Guthmann took the matter under advisement after an hourlong hearing Tuesday. Reached afterward, Guthmann declined to say when he would rule, or, whether the time frame would be influenced by the legislature's Feb. 20 start date. He has 90 days to issue a decision. Nauen is representing Sauk Rapids resident Destiny Dusosky, a Democrat who filed the suit in January against Fischbach, a Republican who represents Senate District 13. \"To me, it's a matter of the constitution,\" Dusosky said after the hearing. \"Our constitution clearly plays out that we have three separate branches of government, and we need to keep those branches separate and keep those powers separate...\"Fischbach also addressed media after the hearing, saying that she was\" confident \"in her attorney's arguments based on case law and a state Supreme Court decision .\" It would be nice to have a quick decision..., \"she said. Fischbach noted that seven male senators previously served as lieutenant governor while retaining their Senate seat. Asked if she believed the lawsuit could be politically motivated, Fischbach said,\" Well, it does have that potential. There has been potential for political motivation...through the entire kind of process. \"Dusosky, who has served as DFL chairwoman of the St. Cloud-area Senate district, denied any political motivation. Fischbach, as Senate president, automatically ascended to the lieutenant governor position after Gov. Mark Dayton appointed former Lt. Gov. <mark>Tina Smith</mark> to replace Al Franken in the U.S. Senate. The lawsuit's outcome could temporarily impact control of the state Senate. If the judge agrees with Dusosky and the DFL wins a special Senate election next week, the Senate would be split 33-33 between the GOP and DFL .\" What we're trying to say is: let's not wait for an issue and have lawsuits about votes and matter, \"Nauen said .\" Let's see if we can get it addressed right now. \"Nauen said at the hearing and in court filings that the state constitution prohibits Fischbach from keeping one foot in the legislative branch and the other in the executive branch of government, and that case law gives the court\" broad discretion \"to order her to give up her Senate seat. He told Guthmann in court that amendments to the state Constitution no longer permitted the dual offices. Magnuson argued in court that the amendments were\" minor tweaks \"that should not impact Fischbach. He also argued that the lieutenant governor has\" extremely limited \"legislative function and no constitutional duties other than to replace the governor if necessary. Guthmann asked about the office's other constitutional duties .\" ...inquire daily to the health of the governor, \"Magnuson said .\" Well, that'll make you look forward to getting up in the \"morning, Guthmann said. Twitter: @ ChaoStrib", "articleID": "2018020621_00169692_W", "names": {"Tina Smith": ["Q18631509", "Q22670437"]}}, {"date": "2018-02-07", "url": "https://www.newsx.com/sports/india-vs-south-africa-kuldeep-yadav-is-more-difficult-to-play-than-yuzvendra-chahal-says-shikhar-dhawan", "content": "India vs South Africa: Kuldeep Yadav is more difficult to play than Yuzvendra Chahal, says Shikhar Dhawan India vs South Africa: Kuldeep Yadav is more difficult to play than Yuzvendra Chahal, says Shikhar Dhawan Indian opener Shikhar Dhawan has picked chinaman Kuldeep Yadav as the more difficult bowler to play between the wrist spin duo of Yadav and Yuzvendra Chahal. Both the spinners have been in incredible form in the ongoing South Afric series but for Dhawan, Yadav's variation has an edge over Chahal's turn. By 8:16 AM Kuldeep Yadav has been in scintillating form in South Africa | Phoot - IANS | Indian spinners have been the force behind team's phenomenal performance in the first two games of the ongoing India South Africa ODI series. The wrist-spin duo of Yazuvendra Chahal and Kuldeep Yadav has particularly caused a lot of problems to the South African batsmen with their pinpoint spin bowling. The wrist-spinners share 13 wickets between each other from the first two games and will aim to continue their destructive form further in the series. While the Proteas batsman who are not used to playing spin on the rough South African patches are finding it difficult to play turn, Indian batsmen play the duo in the nets every day and have accustomed themselves to the spin very well. Ahead of the third ODI in Cape Town, Shikhar Dhawan has given his verdict on who out of the two spinners is more lethal. Though both the wrist spinners have been in great form in the series, Dhawan singled out Chinaman Kuldeep Yadav as the one he finds more difficult to play. Yadav ever since rising to prominence in the IPL has been an integral part of the Indian setup in the shorter formats and has lately formed a lethal partnership with Yuzvendra Chahal. \"From my point of view, chinaman is more difficult to read. Between Kuldeep and Chahal, I think Kuldeep is a little harder to read. There are players who can't read googlies. They will find Chahal's googlies tough to handle. As far as I'm concerned, I find Kuldeep a little more difficult to read,\" said Dhawan who is himself a fantastic batsman of spin. Chahal-Yadav duo has spun magic for India on the dusty South Africa tracks which are often ruled by the pacers. While the likes of Kagiso Ranbada, Morne Morkel are failing to hit the chords for their side, Chahal and Yadav have combined well for India to see off the challenge from the Proteas batsmen. The duo bundled out South African innings in the second ODI to help India post a comprehensive victory by nine wickets. They ran through the South African top and middle order picking eight wickets between them. Chahal went on to bag his first five-for against South Africa by dismissing the likes of Quinton de Kock, JP Duminy, K Zondo and <mark>Chris Morris</mark>. Meanwhile, Kuldeep packed skipper Markram and explosive batsmen <mark>David Miller</mark> along with Rabada, in the end, to stop the Proteas on a spectacularly low total of 118. Talking about the rainbow nation's problem in adapting to wrist-spin, Dhawan said, \"It's difficult to play the wrist spinners because they can turn the ball even on a flat track. Especially the overseas players...They are not used to (playing spin). So the wrist spinners can create doubts in the batsmen's mind. That's why they are effective .\" India's bowling has gone strength to strength on this tour and there was rarely a sight even in the Test series which India lost 2-1 that the Indian bowlers were not on par with the South Africans. It was most of the time their batting that failed Virat Kohli and his men. But Chahal and Kuldeep have remarkably turned things around for the Men in Blue under the able guidance of Kohli and imperative inputs of MS Dhoni from behind the wickets. They will aim to continue their brilliant run in the series when they take the field in the third ODI in Cape Town. Talking about the South African's problems of failing to tackle the spin, Dhawan ruled out the fact that they have been too impatient with the bat and instead pointed out losing wickets in the middle order as a bigger factor in the result of the first two ODIs. \"I won't say it's the lack of patience, for when you are playing the ODIs you have to score runs (quickly). They can answer it better; about their problems. But they are losing wickets in a heap in the middle-overs, which is the reason why they are not getting to their target scores. If you have doubts in your mind, then that reflects on your batting. And this is giving us the advantage,\" said Dhawan. South Africa who are already trailing behind 2-0 in the six-match series would aim to bounce back strongly in the third ODI but the team will once again be without three of their key batsmen which makes it more difficult for them. Apart from AB de Villiers and Faf Du Plessis, wicket-keeper batsman will also miss out the Cape Town ODI after picking up a wrist injury in the second game at Centurion. He is likely to be rested for 3-4 weeks and looks set to miss out on the T20 series as well.", "articleID": "2018020702_00618816_W", "names": {"Chris Morris": ["Q2326339", "Q2547938", "Q3675540", "Q48975640", "Q5107505", "Q5107506", "Q5107507", "Q5107508", "Q5107509", "Q552780"], "David Miller": ["Q1175688", "Q12899557", "Q15455696", "Q16185473", "Q19875639", "Q20656547", "Q28870727", "Q3018511", "Q30607124", "Q404333", "Q404779", "Q5237563", "Q5237568", "Q5237569", "Q5237573", "Q5237574", "Q5237576", "Q55196713", "Q56458216", "Q57729525", "Q57832355", "Q6828449", "Q92986"]}}]