[{"date": "2018-02-07", "url": "http://www.santafenewmexican.com/sports/engineering-marvel-of-the-winter-olympics-a-broom/article_42c0cd7a-229e-542c-a539-af7b991c960f.html", "content": "Engineering marvel of the Winter Olympics: A broom By Scott Cacciola | The New York Times 51 min ago Email The SmartBroom, which has built-in sensors measuring a curling sweeper's stroke rate and force, in Kitchener, Ontario, Canada, Jan. 14, 2018. In a sport that can come across as vaguely primordial, this piece of 21st-century gadgetry could play a role in determining who wins gold at the 2018 Winter Olympics in Pyeongchang, South Korea. Ian Willms/The New York Times From left: Andrew Flemming, left, Will <mark>Hamilton</mark> and Geoff Fowler, the co-inventors of the SmartBroom, in Kitchener, Ontario, Canada, Jan. 14, 2018. The brooms have built-in sensors measuring stroke rate and force, to help sweepers in the sport of curling hone their crucial but imperfectly-understood craft. Ian Willms/The New York Times Parts and prototypes in the home of Andrew Flemming, one of the co-inventors of the SmartBroom, in Kitchener, Ontario, Canada, Jan. 14, 2018. The brooms have built-in sensors measuring stroke rate and force, to help sweepers in the sport of curling hone their crucial but imperfectly-understood craft. Ian Willms/The New York Times From left, an old-fashioned curling broom, a modern curling broom and a SmartBroom, which has built-in sensors measuring a sweeper's stroke rate and force, in Kitchener, Ontario, Canada, Jan. 14, 2018. The SmartBroom is helping sweepers hone their crucial but imperfectly-understood craft. Ian Willms/The New York Times Save KITCHENER, Ontario--Andrew Flemming and Geoff Fowler tinkered for months in their spare time. They used soldering irons. They printed three-dimensional models in their basements. They brainstormed over beers in this small city about 60 miles west of Toronto, where they kept their project quiet. \"We did a fair bit of work in bars,\" Flemming said. Flemming and Fowler, both 29, along with their friend and business partner, Will <mark>Hamilton</mark>, 37, were pouring their creative energies into a high-tech training device the likes of which the sporting world had never seen. They were building a better broom. Not just any broom, but one that they thought could be essential to the sport of curling, which relies on the best broom handling out there as teams strategically cajole a polished granite rock across a sheet of ice. They wound up calling it the SmartBroom, and in a sport that can come across as vaguely primordial, their piece of 21st-century gadgetry could play a role in determining who wins gold at the 2018 Winter Olympics in Pyeongchang, South Korea. <mark>Matt Hamilton</mark>, a member of the U.S. men's team, overhauled his sweeping technique after training with a SmartBroom. Curlers from countries as far afield as China, Denmark and Switzerland have leaned on it in their preparation for the Olympics. In all, Will <mark>Hamilton</mark>, who is not related to <mark>Matt Hamilton</mark>, said he had sold SmartBrooms to eight of the 13 national curling federations sending teams to Pyeongchang. \"We definitely learned a few tricks,\" said Marc Kennedy, a member of the Canadian men's team. A quick primer on sweeping: It is important. The science behind it is much more complicated than people think. The simplified version is that sweeping slightly increases the temperature of the ice while creating micro-scratches on the surface. The result is that players are better able to control for distance and trajectory as the rock travels down the sheet. The sport hinges on precision, so every brush stroke counts. But for decades, there have been competing theories about sweeping. One such debate: Is it more important to sweep faster, with a higher stroke rate, or harder, with greater force applied to the ice? And what about body positioning? Do sweepers generate more power by holding the broom upright or at an angle? These were the types of questions eating at Will <mark>Hamilton</mark>. <mark>Hamilton</mark> was coaching a junior women's team six years ago and wanted to help his sweepers improve their technique. But he knew there was no clear way to assess how well they were actually doing. It was all guesswork. <mark>Hamilton</mark> dreamed of producing data that could be used to solve some of those age-old curling debates. So he zeroed in on Flemming and Fowler, two friends with engineering degrees. <mark>Hamilton</mark> knew they liked to build stuff for fun. At the time, they were trying to invent a climate-controlled, water-cooled suit jacket. When <mark>Hamilton</mark> met with Flemming over beers one night, he pitched a new project: Was there a way to take a pedometer (to measure stroke rate) and a miniature bathroom scale (to measure force) and fuse them to a curling broom? \"So Andrew looks at me like I'm an idiot and says,\" No, you'd use, like, four sensors and an accelerometer,' \"<mark>Hamilton</mark> recalled .\" But I could tell that he thought it was interesting. \"Flemming and Fowler were coming to realize that their climate-controlled suit jacket was not about to set the world on fire. (Fowler still has a couple of half-finished prototypes in his closet .) Perhaps they would be better served by focusing on the high-tech broom .\" This has been slightly more successful, \"Flemming said. On a recent afternoon, Flemming joined Fowler and <mark>Hamilton</mark> on the curling ice here at Westmount Golf and Country Club for a demonstration. They wore matching windbreakers with\" SmartBroom: Sweep Better \"on the backs. Each SmartBroom has four sensors in the broom head that relay data to a small display unit. <mark>Hamilton</mark> took one for a spin down the ice, and the data was instantaneous--line graphs along with a slew of numbers that showed his force in pounds and his stroke rate in hertz. <mark>Hamilton</mark> also pointed to a figure that he described as his\" sweeping performance index, \"or SPI, a metric that combines power and speed in one easy-to-digest figure. <mark>Patrick Janssen</mark>, a world-class curler from Canada, has consistently registered an SPI in the 2,800 range. Fowler provided context .\" As a Thursday night club curler, I'd be happy to get 2,000, \"he said. The numbers by themselves might not mean much, Flemming said, but subtle changes in technique can lead to big differences in the quality of each stroke. And now curlers have that information at their disposal. They can experiment to see which stroke works best for them .\" It's sometimes tough to convince an athlete that what they're doing is maybe not the best, because they feel like they're working really, really hard, \"Flemming said .\" And it's probably true that they're working really, really hard. But they might also be wasting a lot of energy. \"The first SmartBroom was used by Canada before the 2014 Winter Olympics in Sochi, Russia. But at the request of Curling Canada, the country's national curling federation, <mark>Hamilton</mark> and his partners agreed not to sell SmartBrooms to other consumers until after the Olympics. Fowler called it a\" polite agreement \"rooted in relationships with Curling Canada officials. In Sochi, the Canadian men and women swept gold. Ahead of the Olympics in Pyeongchang, the gospel of the SmartBroom spread across the globe, and many of the teams competing in South Korea this month are acolytes. <mark>Matt Hamilton</mark>, the American curler, said he discovered that he was able to generate greater force by holding the broom more upright. Kennedy, the Canadian curler, said he learned that pressure was more important than stroke rate. So now he sacrifices speed for the sake of power .\" For years, \"he said,\" we thought it was the other way around. \"Curlers have also used the SmartBroom to assess their physical conditioning. They can compare their statistics from the beginning of a workout to those at the end, or even after several weeks of training. Will <mark>Hamilton</mark> declined to say how many SmartBrooms he and his partners have sold, but they are not retiring anytime soon--or even quitting their day jobs. Flemming and Fowler are engineers, and <mark>Hamilton</mark> works in information technology for a hardware company. The SmartBroom, <mark>Hamilton</mark> said, is a\" side hustle, \"albeit a useful one. The broom retails for $3,000. (Canadians get a discount .) They all hope that more innovations are forthcoming. For example: hardware light enough to embed in brooms used in competition so that real-time statistics can be broadcast on television .\" This, \"Flemming said,\" is not the end of what we plan to do. \"", "articleID": "2018020703_00111945_W", "names": {"Matt Hamilton": ["Q6788751", "Q6788752"], "Patrick Janssen": ["Q2969812", "Q47541656"]}}, {"date": "2018-02-07", "url": "https://www.thesportreview.com/2018/02/chelsea-fc-west-brom-thibaut-courtois-positive-message/", "content": "Terms of use Thibaut Courtois sends positive message to Chelsea FC squad ahead of West Brom The Chelsea FC goalkeeper underlines the unity in the Blues squad despite Monday night's 4-1 loss at Watford By The Sport Review staff Wednesday 7 February 2018, 09:15 UK @ thesportreview Chelsea FC goalkeeper Thibaut Courtois Photo: Thibaut Courtois / Instagram Thibaut Courtois has urged the Chelsea FC squad to regroup ahead of next week's trip to West Brom. The defending Premier League champions lost 4-1 to Premier League strugglers Watford at Vicarage Road on Monday night to slump to successive top-flight defeats. Troy Deeney broke the deadlock in the first half after Courtois brought down Gerard Deulofeu inside the Chelsea FC penalty area minutes after Tiemoue Bakayoko's sending off. The Belgium international Eden Hazard levelled in the 82nd minute before goals from Darryl Janmaat, Deulofeu and <mark>Roberto Pereyra</mark> in the final six minutes sealed a 4-1 home win. The west London side have lost successive Premier League games following a 3-0 loss to Bournemouth at Stamford Bridge last week. Chelsea FC are in fourth place in the Premier League table and a mere point ahead of Tottenham Hotspur. Courtois was searching for the positives ahead of Chelsea FC's home clash against West Brom at Stamford Bridge next Monday. \"Obviously we are disappointed with the two results we have had in the last week, obviously it is not good but we have to regroup in training, have heads high and continue the hard work and just continue what we were doing,\" Conte told Chelsea's website. \"We have now two bad losses but we are a team with the manager, and everyone is positive about that, and we will try to do our best to win next week .\" Chelsea FC won the Premier League title with two games to spare last season after finishing seven points ahead of Tottenham Hotspur. The Blues will take on La Liga giants Barcelona in the Champions League round of 16 later this month.", "articleID": "2018020710_00009389_W", "names": {"Roberto Pereyra": ["Q42398698", "Q55468620", "Q93504"]}}, {"date": "2018-02-06", "url": "http://rss.cnn.com/~r/rss/edition_world/~3/OimT7d-gS9g/index.html", "content": "Bitcoin's \"many problems' puzzle regulators by Nathaniel Meyersohn @ CNNMoneyInvest February 6, 2018: 12:00 PM ET What is an ICO? Bitcoin's extreme volatility has flustered lawmakers and regulators .\" There are many problems \"with the way bitcoin markets operate, testified Securities and Exchange Commission Chairman <mark>Jay Clayton</mark> at a Senate Banking Committee hearing on cryptocurrency oversight Tuesday. <mark>Clayton</mark> and Chris Giancarlo, chairman of the Commodity Futures Trading Commission, testified that tighter regulation and a more coordinated response between federal agencies were needed to protect investors from fraud and abuse in digital currency markets. Securities and commodities laws protecting investors don't neatly apply to new online currency trading. Regulators have trouble enforcing the laws, because it's not entirely clear what bitcoin is or does. Is bitcoin a currency? A security? Something entirely different?\" What's so challenging about bitcoin is that it has characteristics of multiple different things, \"Giancarlo said. Although <mark>Clayton</mark> said it was too soon to know whether Congress needed to enact laws targeting cryptocurrencies, he said,\" We may be back with our friends from Treasury and the Fed to ask for additional legislation. \"<mark>Clayton</mark> said investors raising money through initial coin offerings are similar to investors buying stocks. That makes bitcoin like a security, and it falls under SEC enforcement.", "articleID": "2018020710_00501921_W", "names": {"Jay Clayton": ["Q15441392", "Q1672427", "Q28122984", "Q57432267"]}}, {"date": "2018-02-07", "url": "https://www.paulickreport.com/news/the-biz/frankfort-host-second-annual-keep-day-feb-15/", "content": "Frankfort To Host Second Annual KEEP Day Feb. 15 Sponsored by: by Press Release | 02.07.2018 | 9:37 am The Kentucky Equine Education Project is staging its second KEEP Day in Frankfort on Thursday, February 15, 2018, providing a convenient setting for those involved in the industry to share with state legislators the importance of horses to their districts' economy. The event will run from 12:00 PM--2:00 PM in Room 129 in the Capitol Annex. The informal setup will allow industry stake-holders, including horse enthusiasts and racing fans, to interact with a variety of state senators and representatives. Horses of all breeds form a $4 billion industry in the Commonwealth, supporting an estimated 100,000 in direct and indirect jobs and spanning all 120 counties. Kentucky is home to 35,000 operations with at least one horse, totaling 242,400 equines and $23.4 billion when including related assets, according to a University of Kentucky Department of Agriculture survey. \"KEEP Day is a convenient way for people working in businesses connected to equines, as well as those who show, ride and own horses, to meet with our lawmakers and let them know that every county and district benefits from horses,\" said KEEP executive vice president <mark>Elisabeth Jensen</mark>. \"We encourage those involved with every breed and discipline to come and show support for our signature industry that creates so many jobs .\" Created in 2004 to preserve, promote and protect the state's signature industry, KEEP represents and advocates on behalf of Kentucky's entire horse industry--all breeds and equine pursuits. \"People might be surprised to know how many trail-riding and pleasure horses there are in Kentucky--about 80,000,\" <mark>Jensen</mark> said. \"While there are about 54,000 Thoroughbreds in the Commonwealth, there also are 45,000 Quarter Horses and 36,000 Tennessee Walking Horses. All these horses eat grain and hay provided by our farmers, and their owners buy trucks, trailers, tractors and tack, also paying for an array of services such as boarding, instruction and training, farriers and veterinarians. We want those voices heard at KEEP Day and encourage participants to let their state legislators know that they are attending .\" Rep. James Kay of Versailles said at last year's inaugural KEEP Day that horses are an important economic tool even in areas of Kentucky that aren't home to high-profile breeding farms or racetracks. \"We absolutely benefit from the horse industry every day in ways that people don't always understand,\" Kay said. \"We need to do a better job articulating that, and showing the economic driver that the industry is for our people .\" New to the Paulick Report? Click here to sign up for our daily email newsletter to keep up on this and other stories happening in the Thoroughbred industry. Copyright © 2018 Paulick Report. This entry was posted in The Biz and tagged Horse Racing, keep, kentucky equine education project, thoroughbred by Press Release. Bookmark the permalink.", "articleID": "2018020714_01031112_W", "names": {"Elisabeth Jensen": ["Q1330023", "Q16202543"]}}, {"date": "2018-02-07", "url": "http://www.moultonadvertiser.com/news/national/article_9d061752-3a69-5321-8d88-0f8a68a663bc.html", "content": "Court: Idaho nuclear waste documents won't be made public - The Moulton Advertiser: National News BOISE, Idaho (AP)--U.S. officials don't have to provide details about proposed shipments of extremely radioactive spent commercial nuclear fu...posted: February 07 BOSTON (AP)--Josh McDaniels sent ripples throughout the NFL with his decision to pull out of an agreement to become the Indianapolis Colts' h...posted: February 07 The long-awaited ruling on the case of Nosey, the seized circus elephant, came out last Monday, and it appears that Judge Terry made the right...posted: February 01 Keith Ridler Court: Idaho nuclear waste documents won't be made public FILE - In this May 11, 2015, file photo, Colt Killian, left, and Rob Cox manipulate radioactive material remotely behind a protective barrier at the Hot Fuel Examination Facility at the Idaho National Laboratory near Idaho Falls, Idaho. A federal judge says the U.S. Department of Energy doesn't need to make public documents involving spent commercial nuclear fuel shipments to eastern Idaho sought by former Idaho Gov. Cecil Andrus. (AP Photo/Keith Ridler, File) Keith Ridler Court: Idaho nuclear waste documents won't be made public FILE - In this May 11, 2015, file photo, nuclear waste is stored in underground containers at the Idaho National Laboratory near Idaho Falls, Idaho. A federal judge says the U.S. Department of Energy doesn't need to make public documents involving spent commercial nuclear fuel shipments to eastern Idaho sought by former Idaho Gov. Cecil Andrus. (AP Photo/Keith Ridler, File) Posted: Wednesday, February 7, 2018 5:13 pm Court: Idaho nuclear waste documents won't be made public Associated Press | 0 comments BOISE, Idaho (AP)--U.S. officials don't have to provide details about proposed shipments of extremely radioactive spent commercial nuclear fuel to the country's top government nuclear research laboratory in Idaho, a federal court has ruled. The ruling was a major setback to a lawsuit filed by former Idaho Gov. Cecil Andrus, who had a long history of legal battles with the Energy Department over nuclear waste entering the state and a firm belief that residents had a right to know the agency's plans. U.S. District Court Judge B. Lynn Winmill on Tuesday ruled the federal agency acted properly in withholding information sought by Andrus in a Freedom of Information Act request he filed in January 2015. That decision means the documents will not be released to the public anytime soon, but they ultimately could be as another part of Andrus' argument has yet to play out and the case remains open. Andrus, a Democrat who died in August at age 85, filed the lawsuit in September 2015 after receiving heavily blacked-out documents from the federal agency about the spent commercial nuclear fuel shipments. His daughter, Tracy Andrus, has been substituted with the court's approval as the plaintiff in the case. The former governor's longtime aide, <mark>Marc Johnson</mark>, said he was disappointed with Tuesday's ruling in favor of the Department of Energy, \"particularly after waiting so long to see what DOE really has in mind for further waste in Idaho .\" The lawsuit seeks information about several hundred pounds of proposed research shipments of spent commercial nuclear fuel the federal agency wants to send to the Idaho National Laboratory, the nation's top federal nuclear research lab. The shipments required a waiver to a nuclear waste agreement the Energy Department and Idaho signed in 1995 limiting nuclear waste shipments to Idaho. The agreement followed federal court victories by then Gov. Andrus at a time when he feared the state was becoming a repository for the nation's nuclear waste. Andrus, before his death from complications from cancer, contended that signing such a waiver would open the state up to receiving tons of nuclear waste from around the nation, and is why he sought information about the Energy Department's plans. In August 2016, Winmill ordered the Energy Department to provide the court with the documents Andrus wanted to determine whether the agency's redactions fell within exemptions to the Freedom of Information Act. Winmill on Tuesday ruled they did. \"The court will sustain DOE's assertion of privilege, and not require it to provide the plaintiff with a copy of any of the documents,\" he wrote. Energy Department officials didn't immediately respond to inquiries from The Associated Press on Wednesday. The agency has previously said it wants to better understand \"high burnup\" spent fuel that is accumulating at nuclear power plants in the U.S.. The fuel stays longer in nuclear reactors than other nuclear fuel and produces more energy. But its spent fuel comes out hotter and more radioactive than fuel that does not stay so long in reactors. In Winmill's 2016 order, he also directed the Energy Department to determine whether the redacted material \"would relate to the public's interest, rather than that of the agency itself .\" He said if the information wasn't in the public's interest, the agency had to explain why, and not just site the policy underlying the exemption. Winmill in that order is telling the Energy Department to explain why releasing the information would not be in the public interest of Idaho residents, said Andrus' lawyer, Laird Lucas, with the Advocates for the West legal firm that often represents environmental groups. He said the federal agency hasn't yet responded to that part of Winmill's order. The former governor in a 2016 interview with The Associated Press said he filed the lawsuit because \"we have to know what's going on .\" The Energy Department's \"stonewalling and reluctance lends credence to my suspicion,\" he said. \"That's all I have right now--a strong suspicion backed up by a history of an agency that has run roughshod over the public for way too many years .\" Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2018020723_00515243_W", "names": {"Marc Johnson": ["Q1375699", "Q3294120", "Q6755650"]}}, {"date": "2018-02-07", "url": "http://refinery29.com/2018/02/190196/reasons-this-is-us-is-bad-from-mom", "content": "Kaitlin Reilly Photo: Courtesy of NBC My mother should have cried over Jack Pearson's television death. I did! If you scrolled through Twitter, it seemed like the entire world was weeping over Milo Ventimiglia's deceased patriarch, who survived a fire only to die of a heart attack hours later. My mother watches This Is Us. We've sat through episodes together, enjoying all of the Pearson family drama. Of course, that was back in season 1, when my mom was convinced NBC would give us an answer about Jack's death within the freshman season. (My mother didn't watch Pretty Little Liars so she has no television patience .) Advertisement So, when I called my mother to chat about \"Super Bowl Sunday,\" the season 2 episode where Jack met his ultimate demise, I was met with two words: \"It sucked .\" (You should know that, growing up, I was never allowed to utter this phrase, as it fell under the umbrella of \"fresh .\" But anywaysssss .) I spent a few minutes making my case for This Is Us and Jack's death, which broke me so much that I texted my boyfriend to come home from a Super Bowl party \"because This Is Us is too sad .\" My points to my mother were as such: Jack sacrificed himself for his family without even knowing it! He loved Kate (Chrissy Metz) so much that he would rather grab her dog from a burning building than see her sad! How could one not squeeze out a single tear when <mark>Mandy Moore</mark>'s Rebecca sees Jack's dead body? Alas, my points fell on deaf ears. Instead, my mother made a list (yes, a literal list) of all the reasons why Jack's death on This Is Us, and all of the drama surrounding it with the Pearson clan, totally and completely sucks. Here are her reasons, paraphrased from her own words. 1. Jack had zero idea what he was doing in the fire scene. Why would he insist on bringing everyone into one bedroom when the house was burning up? My mother, who clearly paid more attention at the Firehouse Festivals they held in our town (real thing, there was even a smoke house where you had to faux-escape a burning building) insisted that it was much more dangerous to go through the hallway lest the ceiling collapse and kill everyone. Advertisement \"But he was trying his best,\" was what I squeaked out, afraid she might be right that Jack's \"fight the fire with the mattress\" plan was not the most sound. 2. Why destroy the Crock-Pot brand? My mother, for some reason, took a very big offense to the show's decision to have a slow cooker be the instrument of Jack's death, even though the year of Jack's demise may have also been the last time my mom actually cooked anything. (Sorry. Love you .) Fortunately for my mother, Crock-Pot has bounced back thanks to a fantastic PR plan. 3. Old Rebecca looks ridiculous. This has actually been an argument my mom has had since season 1, but it resurfaced thanks to new gripes with the NBC series. Personally, I think that This Is Us does a fantastic job making <mark>Moore</mark> look like she's in her 60s (<mark>Moore</mark>, in real life, is even younger than the stars who play her children), but my mom insists that Rebecca looks like she's in a school play. What does this say about the production quality of my high school musicals? I'm not really sure. 4. Everyone is a whiner. (My mom is a pre-school teacher .) This may be the episode where everyone remembers the anniversary of their father's death, intercut with actual flashbacks of his death, but no. . Kate (Chrissy Metz) is a whiner. Kevin (Justin Hartley) is a whiner. My mother has no time for whiners. 5. Jack's death did not warrant the massive wait. I think my mom wanted Jack to die in some, Rube Goldberg machine-type accident, in order to make the season-and-a-half arc feel more earned. Instead, he died of a heart attack, which my mother insists the doctors would spend a lot more time trying to treat. My mother has not seen the pilot of The Resident, which revealed why that's not always the best plan. Advertisement 6. Randall (Sterling K. Brown) needs to get his shit together. This one was kind of like a punch to the gut, as Randall is the best. She does not think that Beth (Susan Kelechi Watson) should put up with all of Randall's mid-life crisis theatrics. (Sorry, Randall .) So. Is my mother...right? Did This Is Us jump the shark with Jack's death, and the subsequent drama surrounding it? Considering I still can't think about it for too long without becoming a puddle of tears, I'm going to say no...though she may have a point about Kevin's whining. Read These Stories Next:", "articleID": "2018020814_01017635_W", "names": {"Mandy Moore": ["Q187832", "Q6748314"]}}, {"date": "2018-02-08", "url": "http://www.roanoke.com/news/world/wire/uk-disappointed-at-bermuda-s-same-sex-marriage-ban/article_922c1670-79e2-5cb4-94f8-297fa3277a70.html", "content": "LONDON (AP)--The U.K. government expressed disappointment Thursday that Bermuda has abolished same-sex marriage, but said it would have been wrong to overturn the decision by the British island territory. Bermuda's Senate and House of Assembly passed legislation replacing same-sex marriage with domestic partnerships in December, and the island's U.K.-appointed governor, <mark>John Rankin</mark>, signed it into law Wednesday. British Prime Minister Theresa May's spokesman, James Slack, said Britain was \"seriously disappointed\" by the decision, which reverses a 2017 court ruling legalizing gay marriage. Receive today's headlines in your inbox with our daily news email SUBSCRIBE TODAY But he said it would not have been right for Britain to block the move. He said the bill \"has been democratically passed by the Parliament of Bermuda, and our relationship with the overseas territories is based on partnership and respect for their right to democratic self-government .\" Some opposition politicians criticized the government, saying Britain should have intervened to prevent the change, which they called discriminatory. Labour Party foreign affairs spokeswoman Helen Goodman said the legislation was \"shameful\" and \"turns same-sex couples into second-class citizens .\" Foreign Office Minister Harriett Baldwin said \"after full and careful consideration\" the government had decided not to block the legislation. She said Britain's powers to intervene with laws in its overseas territories \"can only can be used where there is a legal or constitutional basis for doing so, and even then only in exceptional circumstances .\" ", "articleID": "2018020815_01194499_W", "names": {"John Rankin": ["Q15429094", "Q20203593", "Q374620", "Q42634605"]}}, {"date": "2018-02-08", "url": "http://smashtasm.wikia.com/wiki/Super64?diff=8310&oldid=8292", "content": "Revision as of 00:05, December 27, 2016 (view source) Matheus Leonardo (Talk | contribs) m (Vandalism) ← Older edit Latest revision as of 22:05, February 8, 2018 (view source) PoisonMon09 (Talk | contribs) Line 16: Line 16: = = Personality = = = = Personality = = − Super64 is a naive newbie with a tendency to believe in clichés, but he means well. He is a quick learner, a good listener, and is very good at making new friends, though he usually gets beat up by them in the process of befriending them. His belief in clichés causes him to give generic speeches about friendship and heroism, which often bores people to the point where they either refuse to listen or just leave altogether. He is a very vengeful person as well, as seen when he goes on a journey to get back at [[Killa7]], and in the crossover \"\"Beans\" \"he reveals he's bad at making insults in the song\" We Will Fuck You \", a parody of\" We Will Rock You \"by Queen. He also seems to have changed slightly, stating that he doesn't do clichés (NOTE:\" Beans \"cannot be taken as canon, as none of the creators have said anything about the matter). He will always take on anyone, though he doesn't try to start fights (especially when he's trying to do something). + Super64 is a naive newbie with a tendency to believe in clichés, but he means well. He is a quick learner, a good listener, and is very good at making new friends, though he usually gets beat up by them in the process of befriending them. His belief in clichés causes him to give generic speeches about friendship and heroism, which often bores people to the point where they either refuse to listen or just leave altogether. He is a very vengeful person as well, as seen when he goes on a journey to get back at [[Killa7]], and in the crossover\" \"Beans\" \"he reveals he's bad at making insults in the song\" We Will F--You \", a parody of\" We Will Rock You \"by Queen. He also seems to have changed slightly, stating that he doesn't do clichés (NOTE:\" Beans \"cannot be taken as canon, as none of the creators have said anything about the matter). He will always take on anyone, though he doesn't try to start fights (especially when he's trying to do something). = = Character Biography = = = = Character Biography = = Latest revision as of 22:05, February 8, 2018 Contents [show] Super64 Plumber Style! Vital statistics Title The Plumber Gender Male Character Mario Status Moderator Super64 is the main protagonist in Smashtasm, both in Season One and Season Two. He plays as Mario in default costume. He is considered a\" n00b \"by other players because of his lack of skill in the game and that he was tricked by Killa7's Tournament Scheme. Super64 likes using items. He often makes long speeches, causing other players to leave out of boredom, or just because they want to be mean (or sometimes both). As of the second season, he has apparently been promoted to mod for defeating Greg. He is voiced by the creator of the series, Shippiddge. Physical Description Edit Super64 introduces himself. Because the Melee in Smashtasm is an online multiplayer fighting game, we never learn what the real Super64 looks like. Being a Mario player however, he looks just like the famous plumber in his normal clothing when logged in. We randomly assume he looks like Pierce\" Shippiddge \"Shipp. Personality Edit Super64 is a naive newbie with a tendency to believe in clichés, but he means well. He is a quick learner, a good listener, and is very good at making new friends, though he usually gets beat up by them in the process of befriending them. His belief in clichés causes him to give generic speeches about friendship and heroism, which often bores people to the point where they either refuse to listen or just leave altogether. He is a very vengeful person as well, as seen when he goes on a journey to get back at Killa7, and in the crossover\" Beans \"he reveals he's bad at making insults in the song\" We Will F--You \", a parody of\" We Will Rock You \"by Queen. He also seems to have changed slightly, stating that he doesn't do clichés (NOTE: Beans cannot be taken as canon, as none of the creators have said anything about the matter). He will always take on anyone, though he doesn't try to start fights (especially when he's trying to do something). Character Biography Edit The Tournament Scheme and 1337f0x Edit\" Hyrule Temple. This must be the place. \"- Super64, Season 1, Episode 1 Super64 meets 1337f0x. Super64 started his adventure at Hyrule Temple in a server called\" Ultimate Smash Tournament \", run by Killa7. He was there for a tournament, which was just a ruse by Killa7 Super64's first appearance in scene one. (A Bowser player) to raise his own ranking. Upon arriving at the server, Super64 was knocked out by Killa7, which sent him flying. He later landed on the Corneria stage where he met and briefly fought 1337f0x (A Fox Player who speaks primarily in 1337). After managing to knock him out once, 1337f0x befriended him and informed him that tournaments do not exist in the game and that Super64 fell for what is called\" Tournament Scheme \". 1337f0x then shows Super64 the way to get back to Hyrule Temple. Hyrule Temple Battles Edit\" Plumber Style! \"- Super64, Season 1, Episode 2 Upon arriving at Hyrule Temple, 1337f0x leaves, and Super64 meets Link, a Link player who genuinely believes he is the protagonist from the Legend of Zelda games. Link teaches Super64 how to set match rules, saying if he doesn't agree to them,\" You \"ze-a gettin' banned\". Super64 tricks him into a 1-Stock match and quickly defeats him by hitting him off the edge of the stage when they're right next to it, at which point Link attacks him for the cheap move. Luckily for Super64, a player controlling Ganondorf appears, and when Link rushes off to fight his \"nemesis,\" he is beaten swiftly and easily. Upon talking to the Ganondorf player, Super64 learns she is a female player named BlakBerri, certified Smash Professional. When accidentally insulting BlakBerri, (\"Hey Link, you just got OWNED by a CHICK!\" ) she attacks him, and Super64 calls in 1337f0x to help. 1337f0x and BlackBerri have a battle shown offscreen, during which an intermission where trophies are shown off plays, and the battle results in a draw. BlakBerri gives them information on where to find Killa7, telling them he's in the same server as where he was before. Greg Edit \"He got away!\" - Super64, Season 1, Episode 4 Super64 and 1337f0x track down Killa7 to Great Bay, but while Super64 is giving a speech about how Killa7 will not get away, Killa7 gets away. At this point, a <mark>green</mark> Falco player shows up, who is then revealed to be 1337f0x's old friend and partner, Greg. After speaking in 1337, which Super64 doesn't understand a \"word\" of, 1337f0x explains. Speaking normally for the first time, 1337f0x (after being interrupted by Super64 and Greg) tells the story about how Greg turned evil by wanting to use hacks to cheat at Melee and defeat all the pros, and 1337f0x stopped him after the Admins failed to do so. Greg and 1337f0x decide to have a battle then and there, so 1337f0x smashes Super64 out of the bay before they clash, as three characters fighting with hacks in a server will crash the server. The Rap Sheet Edit \"Don't say fine! Say Word!\" \"Ugh...Word\" - Pimpachu and Super64, Season 1, Episode 7 Super64 lands in the Fountain of Dreams stage, where he meets PrinceRok, a white Marth player from Scotland who calls Super64 \"Lassie .\" After accidentally insulting him by calling him Irish, PrinceRok fights and horribly defeats Super64. When PrinceRok comments on how terrible he is at fighting and asks if anyone had ever told him that, an inaccurate flashback takes place of Super64 and 1337f0x on Corneria, where 1337f0x tells Super64 that he sucks, and it is revealed that Super64 only knocked out 1337f0x at the beginning because 1337f0x wasn't trying. After the flashback, Super64 responds that he didn't even want to fight PrinceRok in the first place. PrinceRok then asks why he came to his server in the first place, and Super64 recalls everything that's happened to him thus far on his journey. At this point, PrinceRok offers to take Super64 to a friend who can help him find Killa7, which Super64 gladly accepts. PrinceRok takes Super64 to Mushroom Castle, where Super64 meets Pimpachu, a red Pikachu player who speaks like a gangsta. Pimpachu agrees to give Super64 Killa7's rap sheet if he can beat him in a fight. After failing to even touch Pimpachu because he keeps spamming his Down B, Pimpachu allows Super64 to fight somebody else for the Rap Sheet. A shot of Super64's bomb throw right before it knocks Lamp off of the stage. Later at Hyrule Temple, Pimpachu introduces Super64 to his \"main man\" Lamp, a purple Samus player who comes off as very slow witted and childish. If Super64 can beat Lamp, he can have Killa7's rap sheet. If not, Pimpachu gets Super64's password. An unnamed Zelda player then asks Pimpachu to go easy on Super64, which prompts Pimpachu to hit her. At this point, Super64 calls Pimpachu a poser, which angers him and starts the battle. After knocking each other out a few times, Lamp is about to beat Super64 for good, when a surprise intervention from Link, being chased by a horde of Kirbys causes Lamp to lose. Not one to go back on his word, Pimpachu gives Super64 the promised Rap Sheet, and Super64 goes off to hunt Killa7. The Bet and Training Edit \"Yes! Yes! I'm doing it!\" - Super64, Season 1, Episode 9 Super64 messes with Killa7's head by showing up everywhere he is. Just when he's about to take his revenge, 1337f0x shows up and stops Super64, while Greg runs off with Killa7. 1337f0x then explains that he and Greg have made a bet to see who the better hacker is, not being able to hack themselves simultaneously without crashing the server, and that they'll give the two bigest n00bs they know their hacks to see who's best. 1337f0x chose Super64, Greg chose Killa7. 1337f0x then explains that Super64 will need training, and takes him to a Target Smash course. At the target Smash course, Super64 is introduced to MewZero, a Mewtwo player who acts like a stereotypical Asian sensei, to train him with the hacks. But to fight with hacks, Super64 must first learn to fight without them. After a training montage including a valuable lesson on how the cape propels you forward, Super64 fights \"himself,\" really another Mario player named Daniel. Upon succeeding, he is ready to fight Killa7. The Awaited Match Edit \"Let this be...our final battle!\" - Super64, Season 1, Episode 10 Super64 and 1337f0x meet Greg and Killa7 at Final Destination, ready to fight. But then 1337f0x realizes that even if Super64 wins, Greg will still be evil. So, he raises the stakes: The loser of the match and the person they got hacks from is banned from Melee forever. Greg uses hacks to turn Killa7 into Giga Bowser, while 1337f0x turns Super64 in Super Super64, who looks the same, but with artificially enhanced abilities, including the cape and fireball. After a long battle, Killa7 and Super64 are both down to 1 Stock, when Killa7 sends Super64 flying off the stage. In what appears to be a loss, 1337f0x cries in despair. Greg is about to ban him when, suddenly, Super64 reappears from the other side of the stage and knocks out Killa7, winning the match. He reveals to 1337f0x that he remembered MewZero's advice about the cape's propulsion capabilities. Greg, having lost the bet, refuses to agree to be banned, but is forced into it with the sudden arrival and attack of MewZero, who brought along BlakBerri, PrinceRok, Pimpachu, Lamp, and Link (the last of which didn't fight, and had no clue why he was there) saying \"All have helped you on your journey. Now all will help you finish it\". Super64 decides to end with a speech about friendship and talent, but 1337f0x questions it, and ends the season with \"Lulz .\" Setting Out Once Again Edit \"You don't want to mess with me! I'm a mod!\" - Super64, Season 2, Episode 1 Super64 after a mysterious unnamed Snake player comes in and snaps his neck. After the events of Melee, Super64 is now a moderator. He is first seen telling his story to a Ness player, which quickly leaves as soon as possible. Then, Pakkery appears and tells him of a hacker in Skyworld. After talking about Pakkery's fake accent, he leaves to Skyworld. He soon learns 1337f0x is the hacker, and they exchange insane laughter. Then, they are kidnapped by a Dark Fox and Dark Falco duo named Gront and Grant. He then awakens in their hideout, boxed in. Despite \"help\" from Lamp he is still trapped. Then, a Snake player comes, frees him, (Which is probably a joke from Shipp's other videos which Snake snaps Sonic's and others neck) and snaps his neck. He is then able to escape, interrogate the kidnappers, (which Grant tries to cover it up but Gront tells all the right information) and dispose of them. Then, Super64 and Lamp set off to find 1337f0x. A New Ally...Or Not...Edit \"Are you coming on to me? In an online game?\" - Super64, Season 2, Episode 2 After traveling through various stages, Super64 and Lamp get lost in New Pork City. Super64 is flirted with by a Zero Suit Samus, but Lamp is able to tell that it's a Spam-Bot, and disposes of it. After Lamp tells a story about how he knew that it was a Bot (which really has nothing to do with what just happened), Meta-Dark comes, who accidentally spills information about knowing 1337f0x's location, and keeps teleporting back and forth in an attempt to escape, until Super64 KO's him, Lamp asks why Super64 did that, as since Meta-Dark knew where 1337f0x was, they should have questioned him. Super64 is about to follow Meta-Dark, when Lamp is KO'ed by a Dark Sheik player working for Girem6, who offers to \"help' Super64 find 1337f0x. Meeting Princess H Edit The Dark Sheik player leads Super64 to a Trap Portal, and she supposedly tricks him into going in by saying there is candy at the bottom, but it is revealed that it was just in her imagination. In real life, she's about to trick Super64 into going in, but Super64's kind and trusting personality cause her to turn good. She reveals her true form, Princess H. Princess H tells Super64 that there may be a way to stop Girem6, which she'll tell him\" right after I finish pausing dramatically. \"Executing The Plan Edit Princess H tells Super64 her plan: collect several items that will destroy all of Girem6's hacks when combined. It gets off to a shaky start, with Super64 angering Princess H by pretending not to hear her. Once the plan is in motion, they collect the first one with ease, with Grant and Gront supposed to be guarding it, but really goofing off. The second is also collected fine, despite being guarded by a world-famous security system. The third one is guarded by someone who demands to hear a racial joke, but Princess H deals with him. They encounter Meta-Dark, but they get out while Meta-Dark is talking about how they won't get out. The last item is collected by knocking out another guard who asks a riddle. Multi-Dimensional Madness Edit NOTE: These events are from the crossover\" Beans \", which combined GuitarmasterX7's series Brawlgasm with Smashtasm and DexterBoy's series Wolf's Retarded Mission. It is currently unknown if these events are canon to the main story of Smashtasm .\" Wait, he was named Blackimar now? \"- Super64, Beans Sometime after all the events of Smashtasm Season 1, Brawl is released, and Super64 and all of the others get it. One day, Super64 is talking to 1337Fox asking why they aren't fighting in a game called\" Brawl \", when he gets forced into a portal to another dimension. In this dimension, he meets Link from the Brawlgasm universe, the Link from the Wolf's Retarded Mission/Peach's Slutty Adventure universe, and Captain Blackimar. The four are asked by a mysterious voice to fight to the death, which they all refuse to do, and Captain Blackimar seemingly dies when they try to escape through a plot hole. Later, the two Links dub Super64\" Skippy \", and after interrogating a demon, they learn where the voice that has captured them is located. The voice is coming from the Lord of All Things With Nipples, who looks like Ganondorf and sounds like <mark>Dan Green</mark>. Upon twisting Captain Blackimar's nipples, officially killing him, Super64 and the two Links attack the Lord. The Lord then turns into his final form, a cross between a dragon and <mark>Chris Crocker</mark>, which proceeds to damage Brawlgasm Link and Super64 with its nipple beam, causing them horrible agony, which makes absolutely no sense on Shippiddge's part as Super64 is still on his computer. WRM/PSA Link has cut off his nipples before, so he attacks the dragon with an arrow, reversing its nipple beam. Super64 and Brawlgasm Link then attack it with their Final Smashes, saying that their nipples are\" Infused with firey energy! \", and destroy the foe. At this point, the three return to their home dimensions, and Super64 is immediately greeted by 1337Fox, who leaves while he's making a speech. He is then confronted by RaustBlackDragon, creator of the Brawl machinima Dairantou Gaiden, as to why he wasn't in the crossover. Super64 states he has no idea who he is or what he's talking about, and ironically, RaustBlackDragon makes a long speech about why he should be included in the collab, but Super64 leaves during his speech, this is like when Super64 makes long speeches, he causes others to leave out of boredom, and the crossover ends. Mega32 Edit This is a spoiler to the people who have not seen BS64 Being the older brother of Super64, Mega32 is also a total n00b in the game and only won his first match through continual jumping, eventually winning the match because his opponent, VixxenHaxxors, dropped the controller. Where he last left off, he's in a Team Battle with Zelda against KingKirb and Bubbles, an admin. More info as the series progresses. Other Appearances Edit Aside from Smashtasm and its collaborations, Super64 makes cameos in other videos. So far, these include: Super64 makes a cameo in an announcement by TomKitsune, creator of the series\" Smash Fighter, \"where TomKitsune announces voice auditions for Season 2 of Smash Fighter. In this video, Tom thinks Super64 is one of the voice actors auditioning, when he really just wants directions to get to his studio to film Smashtasm. Tom helps him leave by having him yell\" I'M RUNNING ACROSS THE STREET WITHOUT LOOKING BOTH WAYS! \", which causes him to get sent flying away via hammer to the face from Judge Dedede. Name origin Edit Super64's username comes from Mario's first 3d platformer, Super Mario 64, without the word\" Mario' in between. Trivia Edit Had Super64 fallen for Princess H's trap, he could have easily wall-jumped out. The reason Super64 plays as Mario may be to reflect the fact that Mario is a prominent protaganist in many Nintedo games. Smashtasm characters Super64 - 1337f0x - Killa7 - Link - Lamp - Pimpachu - BlakBerri - Greg - PrinceRok - MewZERO/LuZERIO - KingKirb - Narrator - Pakkery - Grant - Gront - Girem6 - Meta-Dark - Princess H - Spead - Extra Characters Retrieved from \"http: //smashtasm.wikia.com/wiki/Super64? oldid=8310\" Categories: Season 1 Characters Season 2 Characters Characters", "articleID": "2018020822_00243183_W", "names": {"Chris Crocker": ["Q5106307", "Q734039"], "Dan Green": ["Q19282196", "Q4119907", "Q5213603"]}}]