[{"date": "2018-02-09", "url": "http://nzherald.co.nz/travel/news/article.cfm?c_id=7&objectid=11991234", "content": "NZ Herald Whose side are you on? On the Korean border island divided by Winter Olympic rivalry 9 Feb, 2018 3:30 pm 6 minutes to read As Korea puts out the Olympic rings on Gyeongpo beach, not everyone is rooting for the host nation. Photo / Sergei Boby, Getty Daily Mail Share on Reddit reddit <mark>Chris White</mark> visits Gyodong Island and the tiny sliver of water between South and North Korea, for the Daily Mail When the Winter Olympics opening ceremony begins tonight in PyeongChang, there will be an area of the host nation South Korea cheering on their bitter rivals in the North. The people of Gyodong Island have more in common with <mark>Kim Jong-un</mark>'s side of the border than their own - it's the \"North Korea of the South\". The tiny South Korean isle, situated right on the border with North Korea, has barely any military presence and the people on each side wave happily to each other. Advertisement Advertise with NZME. Residents don't need to set their alarm, as they've got a 7am wake up call from North Korea's propaganda radio. When the Korean War began in 1950, locals were told to swim down to the other side and \"in a few days\" , the island would be taken back by the North Koreans. It never happened, but the Gyodong residents, who speak with North Korean accents, have never forgotten which side they're on. No one is as close to the communist regime as they are. There's not millions of landmines, tanks and military, just a tiny sliver of the Yellow Sea and a fence. North Korean cheering squads arrive south, ahead of the Olympic opening ceremony. Photo / Ahn Young-joon-Pool, Getty Share on Reddit reddit Even the fence is fairly recent after so many people from the north were floating down to the south. It's that close, only 1.2 miles wide, that any potential North Korean defector was able to ride the tide down to the south's edge. A council official tells us \"at the right time and place, you can float your way here .\" Gyodong has been stuck in the past with propaganda posters lining the streets of the main town of Daeryong, and the retro market stalls are manned by first generation North Korean defectors, who are bitter sweet about the last sixty-odd years. Related articles: 2 minutes to read But now they're opening their arms to international tourism - especially English-speaking ones. A bridge was built connecting the island to the Korean mainland in 2014 and people are fast hearing about the island's charm, it's now becoming popular with expats living in Seoul, three hours away by car. Park Jang Ja has loaded her shop with British and American clothes and bags, she says she \"loves the English\" and, as we speak, she's got her face glued to the screen as <mark>Donald Trump</mark> is making a speech and she's holding a pillow with a Union Jack. She's wearing Bean Pole clothing, a trendy South Korean store with a Penny Farthing as its label. The brand claims it wants to \"emphasise the British-like style that they aim for\" , signing Mark Ronson and Cara Delevingne as models. \"I've been here for about 45 years. I was here before the bridge, when people had to come here according to the ebbs and flows of the day,\" says Park. \"And now that there is a bridge, people can finally buy stuff in my store, we want more tourists, I love all the visitor's gear!\" My parents are first generation descendants of North Korea. Of course, I feel a part of them. \"Those people on the north, in the Spring, when we replant the rice in our paddy fields, they too are on their paddy fields. Before the fence was there, you could hear them talk .\" Now, every morning the North Koreans have broadcasts and you can hear it. I'm not scared. It's part of my life. When you hear the announcement in the morning, you know it's 7am. \"Gyeongpodae Beach: life continues as normal within the divided Olympic host nation. Photo / GWoohae Cho, Getty Share on Reddit reddit Gyodong Island Council Officer <mark>Kim</mark> Joeng Seop is promoting tourism in the area, saying:\" North Korea is certainly missed in these parts. As people get older, they seem to miss their roots and value their heritage and lineage more. \"Some tourists even say that the people here speak with a North Korean accent. So in a figurative sense, we are very close with North Korea .\" The residents of this island have more in common and more interactions with their northern counterparts than South Koreans. In that sense, maybe the residents here feel a bond. \"Now <mark>Kim</mark> says that they want to open their doors to more international tourists like the Brits\" , adding: \"We are far out on the west, so development hasn't been so fast. However, what first was a flaw is now an idiosyncratic aspect of the island. Tourists have called the island\" the island that has been trapped in time. \"\"After the bridge was laid, there are many tourists coming, especially during the weekend, we are getting people who want to escape Seoul. Now we are one of Korea's\" Year of Tourism' areas, which has helped us get a head start in tourism. \"We are using this opportunity to increase tourism, but also increase awareness of our role in the unification and peace advocacy community .\" We have built a Peace Bicycle Trail all around the fence and an observatory, where people can see normal North Koreans on the fields, as opposed to the military images that they often see on the media. \"Every year, defectors in the island climb to the top of Manghyangdae Mount, at the northern end of Gyodong, which looks out onto the North Korean town of Yeonbaek, Hwanghae Province. They say a prayer, shed a tear and are homesick for the place across the water. <mark>Kim</mark> Yong-jin is 83 and has a store in Daeryong. He came to the south on a makeshift raft in 1951 .\" I was still in school when the Soviets, the Chinese, and the North Korean People's Army came down, they told us to go, we made a raft and came down together, there were no motorboats or anything, \"he said .\" I mean now there is a fence and a seawall, but back then, it was easy, South Korea had nothing. \"Most of us [people of North Korean descent] left the mainland during the war and settled down here, expecting this island to be part of North Korea later. They said that this island would be absorbed by North Korea within a few days, but what rubbish, it's been sixty years now .\" You might have seen a black monolith next to the telescopes. That's where the defectors and people of North Korean descent who miss the north do a ceremony in remembrance of their ancestors every year. \"Those very people who came from the North made this traditional market back then. Now the people of North Korean descent are all scattered around, but on the day of the ceremony, they all come down here .\" 9 Feb, 2018 3:08 pm 2 minutes to read The Joker is getting an origin movie and Joaquin Phoenix is in talks to play the lead.", "articleID": "2018020903_00666379_W", "names": {"Chris White": ["Q1077846", "Q19560238", "Q264420", "Q2964892", "Q2964894", "Q42434048", "Q5108458", "Q5108459", "Q5108461", "Q5108462", "Q5108463", "Q5108464", "Q56422264", "Q727678"], "Donald Trump": ["Q22686", "Q27947481"], "Kim Jong-Un": ["Q10855883", "Q56226"]}}, {"date": "2018-02-09", "url": "http://ew.com/tv/scott-bakula-photos-role-call", "content": "CBS Photo Archive Murphy Brown The actor joined the hit CBS sitcom in 1993 (during its sixth season) as reporter <mark>Peter Hunt</mark>, who was a love interest for <mark>Candice Bergen</mark>'s titular character. \"The show was so smart. And I loved that there was a live audience; it felt natural to me,\" he says. \"The cast was so gracious when I joined their company, and <mark>Candice</mark> set that tone .\" In fact, he has hopes of reuniting with <mark>Bergen</mark> on the upcoming revival of the series. \"I didn't die. I just went off to work!\" he says of his character's potential return. More...Everett Collection American Beauty After headlining the CBS crime drama Mr. & Mrs. Smith with Maria Bello and appearing in the final Major League movie, Bakula set his sights on working on Broadway director Sam Mendes' first feature film, 1999's American Beauty. \"I read the script and called my agent and said,\" I'll take any part in this movie. I just want to be involved,' \"says the actor, who was ultimately cast alongside Sam Robards as a gay couple living in the film's seemingly idyllic but truly troubled central neighborhood .\" I really connected to the idea of \"What is going on behind our neighbors' doors? When we close the door, who are we?'\" says Bakula. \"I mean, I was in a movie that won a bunch of Oscars,\" he adds. \"That's something I never imagined would happen for me!\" More...Everett Collection Star Trek: Enterprise Bakula became a Star Trek fan watching the original TV series in reruns while in college, so he welcomed the opportunity to become a part of the mythology when he was offered the role of Jonathan Archer, the captain of Earth's first long-range interstellar ship, on Star Trek: Enterprise, which ran from 2001 to 2005. \"The key, to me, was when they said the show would take place 100 years before Kirk and Spock,\" says Bakula. \"I liked that I didn't have to follow anyone, and the idea of being the first ship in space, the Wild West of it all, and there being no Federation .\" And he had no fears about being embraced by the Star Trek fans. \"From Quantum I understood sci-fi fans and their passion,\" he says. \"And if they love you, then you're theirs forever .\" More...Greg Gayne/TNT Men of a Certain Age \"It was so much fun,\" Bakula says of working with Andre Braugher and Ray Romano on their TNT series. \"It was a good bunch of guys .\" Critics raved about Men of a Certain Age and Bakula's performance as unemployed actor Terry, but the show never found the audience its stars had hoped for and it was canceled in 2011 after two seasons. \"It was really hard to let go after just 22 episodes, it was painful,\" he says. \"Even though it was a show about old guys, there was a really cool feeling about it .\" More...Claudette Barius/HBO Behind The Candelabra Bakula says he initially heard about Behind the Candelabra while working with director Steven Soderbergh on the 2009 crime comedy The Informant! \"There had been some talk of Candelabra, and then it went away for several years,\" says Bakula. \"Then, out of nowhere, I got a call while I was doing a show at the Globe in San Diego .\" The 2013 HBO TV movie reunited Bakula with \"Mr. Soderbergh\" and provided him with the chance to step back in time as <mark>Bob Black</mark>, a Hollywood producer who introduces young Scott Thorson (Matt Damon) to flamboyant pianist Liberace (<mark>Michael Douglas</mark>). \"From the first costume fitting to the end, it was a riot,\" he says. But it wasn't just a good time. His work on the movie scored him an Emmy nomination (an honor he'd received four times during his tenure on Quantum). \"That was an unnecessary perk, but I took it!\" he says, laughing. \"It was really exciting to attend all the awards-season events. I hadn't been nominated in 20 years, so I got to enjoy it when it happened .\" More...Skip Bolen/CBS NCIS: New Orleans The chance to lead the latest installment of the NCIS franchise came to Bakula as he was preparing to shoot season 2 of HBO's Looking in 2014. He loved the character of Special Agent Dwayne Pride, but shooting on location in New Orleans didn't make it easy to film his scenes as entrepreneur Lynn on Looking in California. \"I was shooting in Louisiana five days a week and then flying to San Francisco to shoot until the wee hours of the morning every Saturday and then flying back,\" he says. \"It was wild .\" Now Bakula is more singularly focused on New Orleans and is proud of how his show has expanded the franchise's universe. \"It's encased in the NCIS world--and there are certain things we do to present the procedural elements to that audience--but we've been able to branch out and make it our own. We've built a community of characters that feel authentic to the city,\" he says. \"I love New Orleans. I just wish I had more time outside of work to explore .\" More...Shout! Studios Basmati Blues Bakula shot this movie musical with Brie Larson before her Academy Award-winning turn in 2015's Room (or, as he puts it, \"before Brie Larson became Brie Larson\" ). \"It's a love card to India,\" Bakula says of the film, in which he plays a scientist whose daughter (Larson) gets involved in a romantic triangle while they are working in Asia. \"I got to work with Donald Sutherland, Tyne Daly, and this spectacular group of Indian actors. They took us places and told us stories. It was the perfect way to see such an incredible, massive country. I'm awed by my whole experience .\" More ...", "articleID": "2018020921_00502455_W", "names": {"Bob Black": ["Q1266007", "Q42421345"], "Candice Bergen": ["Q106942", "Q2936261"], "Michael Douglas": ["Q119798", "Q172140", "Q358096"], "Peter Hunt": ["Q12372343", "Q7174790", "Q7174792", "Q7174793", "Q7174795"]}}, {"date": "2018-02-10", "url": "https://timesofindia.indiatimes.com/sports/more-sports/cycling/elia-viviani-wins-final-stage-lifts-maiden-dubai-tour-title/articleshow/62863613.cms", "content": "Times of India Elia Viviani wins final stage, lifts maiden Dubai Tour title Elia Viviani wins final stage, lifts maiden Dubai Tour title | | Updated: Feb 10, 2018, 18:13 IST TIMESOFINDIA.COM Highlights Viviani needed at least a second place finish with good timing <mark>Marco Haller</mark> and Adam Blythe secured second and third position respectively This is Elia Viviani's third stage win of the season Elia Viviani. (TOI Photo) DUBAI: Elia Viviani of Quick Step Floors bagged his second stage win and emerged as the winner of the 2018 Dubai Tour. With about 50 meters to go for the finish line, Viviani made the most of a crash right when the peloton, moving at over 80 kmph, took a sharp turn and stranded the likes of Mark Cavendish and Marcel Kittel. Holding a two seconds advantage to be placed atop the overall classification, Viviani, gold medallist at the Rio Olympics, needed at least a second place finish with good timing but went one better to cross the line before <mark>Marco Haller</mark> and Adam Blythe, who secured the second and third positions. \"It's amazing. This morning I was very stressed but I tried to look relaxed. Two seconds lead meant all or nothing. But we rode well as a team,\" Viviani said after the win. \"The ideal situation for us was a breakaway without anyone involved in the top of the overall ranking. I had six teammates leading me out in the last corner. We missed the crash by very little. [Fabio] Sabatini closed the gap on the four guys ahead after the crash. With 50 meters to go I understood I could win the stage. With the headwind, it would have been dangerous to launch from too far out .\" To win GC here is an important step up. I want to be one of the best sprinters in the world. This is a good start towards this goal with the great team I have now. \"Having conquered Stage 7 of the Tour Down Under and the opening stage of the Dubai Tour on Tuesday, this is Viviani's third stage win of the season. Get latest news & live updates on the go on your pc with News App. Download The Times of India news app for your device. Read more Sports news in English and other languages. RELATED", "articleID": "2018021013_00351907_W", "names": {"Marco Haller": ["Q1240107", "Q695085"]}}, {"date": "2018-02-13", "url": "http://thehill.com/policy/finance/373657-consumer-protection-agency-drops-lawsuit-against-lender-that-charged-950", "content": "© Getty The Consumer Financial Protection Bureau has dropped a lawsuit against a lender that was allegedly charging interest rates up to 950 percent, NPR reported. The case against Golden Valley Lending had taken CFPB staffers years to establish, but new agency Director Mick Mulvaney John (Mick) Michael Mulvaney Overnight Regulation: EPA sued over water rule delay | House passes bill to ease ObamaCare calorie rule | Regulators talk bitcoin | Patient groups oppose FDA \"right to try' bill Mnuchin wants to know how consumer bureau is handling Equifax breach Overnight Finance: Senators near two-year budget deal | <mark>Trump</mark> would\" love to see a shutdown' over immigration | Dow closes nearly 600 points higher after volatile day | Trade deficit at highest level since 2008 | Pawlenty leaving Wall Street group MORE instructed staffers to drop the lawsuit, according to NPR. \"People are devastated and angry--just imagine how you would feel if years of your life had been dedicated to pursuing justice and you lose everything,\" <mark>Christopher Peterson</mark>, a former attorney at the bureau who had worked on the case, told the news outlet. ADVERTISEMENT The agency had sued Golden Valley in April, alleging unfair, deceptive and abusive business practices. Golden Valley declined NPR's request for comment. \"The <mark>Trump</mark> administration is just going to turn them loose and let them off the hook despite the fact they were making 950 percent interest rate loans to struggling families in ways that were illegal and unauthorized under both state and federal law,\" <mark>Peterson</mark> said. Mulvaney's spokesperson told NPR that the decision to drop the suit wasn't made by him, but by \"professional career staff .\" However, several bureau staffers pushed back against that claim, saying that Mulvaney was involved in the decision to stop pursuing the lawsuit. The spokesperson later said Mulvaney had in fact been involved. The dropped lawsuit comes as Mulvaney moves to reign in the agency. The new bureau head, who is also serving as the head of the Office of Management and Budget, requested no new funding for the agency for the second quarter of fiscal 2018. President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> Tillerson: Russia already looking to interfere in 2018 midterms Dems pick up deep-red legislative seat in Missouri Speier on <mark>Trump</mark>'s desire for military parade: \"We have a Napoleon in the making' MORE's budget, unveiled on Monday, would give Congress control of the agency and cut its funding by $6.4 billion over 10 years. Tags Mick Mulvaney <mark>Donald Trump</mark> Consumer Financial Protection Bureau Predatory lending", "articleID": "2018021320_00367325_W", "names": {"Christopher Peterson": ["Q4360278", "Q5113060"], "Donald Trump": ["Q22686", "Q27947481"]}}]