[{"date": "2018-02-14", "url": "http://www.lockportjournal.com/news/local_news/why-i-m-glad-not-to-be-rich-and-famous/article_6d05557f-74bd-592d-ade0-8cb846f7927f.html", "content": "Me too. I don't agree with everything President Trump says, but I think he hit the nail on the head with his Tweet about #MeToo over the weekend. He tweeted, \"People's lives are being shattered and destroyed by a mere allegation. Some are true and some are false. Some are old and some are new. There is no recovery for someone falsely accused - life and career are gone. Is there no such thing any longer as Due Process?\" I too have been accused of sexual misconduct. I was walking behind a temporary employee where I worked. Due to the cooler temperatures in the plant, I was wearing a \"hoodie,\" which was unzipped. All of a sudden she jumped up and started yelling that I had touched her bottom (not the word she used). I'm guessing my sweatshirt may have brushed her. I denied it but by the time she hit the front office, her story had changed. Now I had \"groped\" and squeezed her butt (again not her word). I was called to the front office to answer to these allegations and when the new scenario was presented to me, I actually saw red. Obviously my sweatshirt has a life of its own if it can grope someone. Let me say at this point that I have been very happily married since 1969. I have never been unfaithful despite a few opportunities. I respect the sanctity of marriage and take the oath \"'til death do us part\" very seriously. An allegation of this sort was like taking a bullet to everything I believe in. I was so livid about these lies, I told my supervisor that if he entertained any notion these allegations might be true I would punch out, get my stuff and they would never see me again. I had worked for this business for over 25 years and had a spotless record. I never even had an attendance problem. An allegation like this had the power to negate everything I worked my entire life for. Fortunately, my record spoke for itself and my supervisor told me they didn't believe anything that my accuser had said. She was gone the next day. Fast forward to today. If she were to make these accusations now, I would have been fired or suspended without pay pending an investigation. After an investigation I am certain that they would have to believe her story and I would have been terminated. I now see <mark>Cristina Garcia</mark>, a leading figure in California's #MeToo movement, has been accused of groping a male staff member from another politician's office. Ms. <mark>Garcia</mark> was a fierce advocate for legislation signed by Governor <mark>Jerry Brown</mark>, giving legislative staff members whistle blower protections for reporting sexual misconduct or other misbehavior. She has tweeted repeatedly about the importance of sexual consent in recent days. She allegedly rubbed former legislative staff member Daniel Fierro's back, gripped his buttocks and tried to feel his crotch in the dugout at an amateur softball game in 2014. Earlier this month, film star Catherine Deneuve and a group of 100 French women signed a letter that defended a man's right to flirt with women and claimed the #MeToo campaign promotes puritanism. Some observers have said the largest problem with the anti \"sexual harassment\" movement is that it's taking attention away from people who are molested, raped or otherwise sexually assaulted. I think we all have, at one time or another, been guilty of giving someone a hug in congratulations or possibly touching somebody in our youth. If we classify all \"petting\" as sexual harassment, many men and women may as well just quit their jobs. We may as well eliminate all dating, eliminate all love and just go with arranged marriages. Recently I told my wife I was afraid of her accusing me of sexual misconduct because while we were going out, I touched her without a signed, written waiver, in triplicate, notarized and filed with the county, before I proceeded. She said she wasn't inclined to file a complaint against me, because she knows how much money I have, where I keep it and it just isn't worth the effort. When I think about the number of girls I groped or who groped me when I was a teenager, I'm glad I never became rich or famous. Norb Rug resides in Lockport. Write to him at nrug @ juno.com.", "articleID": "2018021405_00016854_W", "names": {"Cristina Garcia": ["Q5186348", "Q5186349", "Q57422352"], "Jerry Brown": ["Q152451", "Q717620"]}}, {"date": "2018-02-14", "url": "http://www.tribdem.com/news/prosecution-rests-in-capital-murder-trial-shetler-s-girlfriend-claims/article_9ee56926-11b4-11e8-8f8d-cb20f0ccbbcc.html", "content": "Prosecution rests in capital murder trial; Shetler's girlfriend claims defendant \"tried to surrender' David Hurst 13 min ago <mark>Ray Allen</mark> Shetler arrives at the scene of the fatal shooting of St. Clair Township police Officer Lloyd Reed Jr. on Friday, Feb. 9, 2018. tberkey @ tribdem.com GREENSBURG--The New Florence man accused in a St. Clair Township officer's murder lifted his hands to surrender--and then was shot anyway, his girlfriend testified Wednesday. Kristin Luther, the woman who called for police that night following a fight with <mark>Ray</mark> Shetler, said her boyfriend had his rifle slung over his shoulder until after officer Lloyd Reed Jr. opened fire several times. Once Shetler was struck, it knocked his hunting rifle\" right into his hands \"and he reacted while trying to escape, she said .\" Once he was shot...he just started aimlessly shooting from his waist, \"Luther testified, saying he wasn't aiming at Reed. Luther spent well over an hour on the witness stand as the opening witness for Shetler's defense, after a morning that saw the Westmoreland County District Attorney's Office rest its case against the New Florence man. Prosecutors' final witness assisted investigators during their reconstruction efforts in the days following the Nov. 28, 2015, shooting. Longtime FBI Special Agent Michael Hochrein said he processed and mapped\" thousands of different points \"in the area surrounding Luther's home, areas where shell casings fell and bullets struck trees and other objects to map out the gunfight scene. Bullet impact points, holes and other evidence were used to determine the path Shetler's .270 rounds traveled, leading Hochrein to dispute statements that at 6 foot tall, Shetler was firing\" from the hip. \"A round that struck Reed hit him horizontally across his chest, not an upward motion, he said. And it damaged a tree in a horizontal path as well--at more than 5 feet 4 inches above the ground, he told jurors. Through his attorney, Shetler has admitted firing the shot that killed Reed, 54. But while statements he has apparently made to state police, paramedics and others have varied about what led to the exchange, the New Florence man has said several times that he reacted to gunfire that night by firing with his rifle held low. Luther made the same statement Wednesday, saying she remembered it clearly, even after District Attorney <mark>John Peck</mark> reminded her about Hochrein's findings. <mark>Peck</mark> responded soon after by noting that she once told Shetler she would\" do anything for him \"and hoped to marry the man. Luther agreed .\" I would do anything...to help him, \"she said .\" But not lie. \"Wednesday is the fifth day of Shetler's trial. If convicted of first-degree murder, his most serious offense, a second phase of the trial would be held to determine if he should face the death penalty. Testimony in the case is expected to continue Wednesday afternoon. Check back for additional information on this developing story. David Hurst is a reporter for The Tribune-Democrat. He can be reached at (814) 532-5053. Follow him on Twitter @ TDDavidHurst and Instagram @ TDDavidHurst. Tags", "articleID": "2018021418_00227529_W", "names": {"John Peck": ["Q16731792", "Q20890188", "Q6252402"], "Ray Allen": ["Q208623", "Q2438891"]}}, {"date": "2018-02-16", "url": "http://www.expressandstar.com/sport/uk-sports/2018/02/16/willey-rashids-red-ball-exit-could-be-the-first-of-many/", "content": "<mark>Willey</mark>: Rashid's red ball exit could be the first of many Less than an hour ago <mark>Willey</mark> believes it is getting harder for players to excel in all formats. Subscribe to our daily newsletter Sign UpEngland's Adil Rashid (Steve Parsons/PA) England all-rounder <mark>David Willey</mark> believes Adil Rashid could be the first of many top players to turn their backs on red-ball cricket. Rashid has decided to focus exclusively on limited-overs competitions next season and is renegotiating a deal with Yorkshire to reflect his withdrawal from the first-class game. The leg-spinner, who earned the last of 10 Test caps in December 2016, has not closed the door on a future return but, at the age of 29 and with lucrative Twenty20 opportunities at an all-time high, few expect it. Rashid has gone a step further than one-day captain Eoin Morgan, who has not donned his Middlesex whites since 2015 but remains theoretically available to do so, and does not suffer from the fitness problems which constrain short-form specialist Tymal Mills. The Yorkshire County Cricket Club can confirm that leg-spinning all-rounder Adil Rashid will not play red-ball cricket for the White Rose in 2018 .--Yorkshire CCC (@ YorkshireCCC) February 15, 2018 As such, his announcement is sure to usher in plenty of soul-searching from those who fear for Test cricket's status at the pinnacle of the game and hold the Specsavers County Championship as the premier domestic competition. But <mark>Willey</mark>, Rashid's team-mate with club and country, sees it as a natural step and one that others could soon pursue. \"It's to be expected. It is too much to play everything and that's cricket now,\" he said. Advertising \"If you look around now with all the white-ball cricket around the world people can make a career out of that. <mark>Willey</mark>, centre, expects other players to follow in the footsteps of Rashid, right (Owen Humphreys/PA)\" Whether more people decide to do it or not is another matter but it's certainly been discussed. \"It's just the way the game seems to be going and these Twenty20 competitions are appealing to people not only for the cricket but also financially. At the end of the day we have a short time playing sport--it's not something we do until we're 60 years old--and there comes a time when you have to make decisions for yourself and your family .\" Advertising Totally understand players who get huge figures in the IPL...& if @ josbuttler did it i would not argue...Rashid didn't get an IPL deal so why not continue to play for Yorkshire!!!!!!!!!! https: //t.co/ovhP3lXrzB--Michael Vaughan (@ MichaelVaughan) February 15, 2018 As well as money, elite cricketers are increasingly finding themselves funnelled towards specific formats by the relentless international schedule. England felt compelled to rest Joe Root, Chris Woakes and Moeen Ali for the ongoing T20 triangular series while Australia have effectively had to select parallel squads due to the imminent Test campaign in South Africa. <mark>Willey</mark> has a long-held ambition of following in the footsteps of his father Peter, who played 26 Tests for England from 1976-86, but increasingly finds himself pigeon-holed as a white-ball player. <mark>Willey</mark> has been used predominantly in limited-overs cricket since moving to Yorkshire (Rui Vieira/PA) \"It's probably nearly impossible to play Test cricket when you're playing so much white-ball cricket,\" he said. \"Last year we were barely available for any four-day cricket because of the Champions Trophy so it then becomes difficult to play regular red-ball cricket, which you need to be doing if you want to be pushing for Tests,\" he said. \"If you're only playing two or three games a year, you're probably not making much of a contribution to a championship title and you're certainly not going to be able to push for Test cricket, so if you are in that position you're probably thinking\" what am I playing it for? \"'", "articleID": "2018021618_00321147_W", "names": {"David Willey": ["Q5241102", "Q5241103", "Q5241104"]}}, {"date": "2018-02-18", "url": "https://www.irishmirror.ie/news/irish-news/health-news/irish-kids-young-10-seeking-12046585", "content": "News Irish kids as young as 10 seeking help for anxiety and self-harming <mark>Marie Johnston</mark>, who runs a mental health clinic, says the situation is \"shocking' Share By <mark>Louise Walsh</mark> 14:35, 18 FEB 2018 News <mark>Marie</mark> <mark>Johnson</mark> from SOSAD Navan (Image: Seamus Farrelly) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email A mother who runs a mental health support clinic says children as young as 10 are seeking help for anxiety and self-harming. Seven kids, aged between 10 and 15 contacted SOSAD's Navan centre in Co Meath in four months last year, many already self-harming. Previously, the centre may have experienced calls from one or two children for the entire year, according to SOSAD co-ordinator <mark>Marie Johnston</mark>. <mark>Marie</mark>, who became involved in the voluntary organisation SOSAD after her own son <mark>Brian</mark> died by suicide ten years ago, at the age of 17, believes existing resources are over-stretched and under-staffed. Read More Tipperary soccer team hopes its fight against suicide is supported by EVERY club in Ireland Describing the situation as\" shocking,' she is now appealing to the Government for more funding and resources on the matter. \"It is shocking and distressing to see children - who should be out playing and enjoying life - actually feel so down that they are thinking of dying by suicide,\" she said. \"We have seen seven children come to our office looking for support from October until Christmas last year .\" In previous years, we might have been contacted by at most one or two children for the entire year and that's still far too many. \"<mark>Brian Johnson</mark> Read More Mum of Irish teen bullied to death warns politicians they will have\" more blood on their hands' <mark>Marie</mark> said that many of the children were self-harming and suffering because of a multitude of reasons. \"Unfortunately, one size doesn't fit all. Children are stressed because of bullying or social media, bereavement or problems at home,\" she added. \"We are finding that many kids are self-harming and anxiety is a huge issue now among children and young people .\" Kids often blame themselves for fights between parents or their parents splitting up. \"Sometimes it's hard for parents to understand how their actions can have huge effects on their children .\" We need to take more responsibility to make sure that children are allowed just to be children. \"<mark>Marie</mark> went on:\" I used to wish that I had someone who would listen to me when I was trying to help <mark>Brian</mark>. Read More Heartbroken Dublin mum calls for laws on cyber-bullying after son's suicide \"I thought if I could talk to someone, then it would free up my head to think about how I could help my son more .\" Now I am that person ready to listen but I am only one of hundreds in the sector who would like to do more but can't because of funding constraints. \"Parents often can't afford the high costs of getting their child psychological help and the waiting lists at funded services can be lengthy .\" SOSAD Navan provides aid to over 90 people who walk through their doors at Cannon Row each week and they gave 4,500 hours of counselling last year. Read More Irish mum who lost two daughters and husband in murder suicide blasts mental health regulations Like us on Facebook Follow us on Twitter Daily Newsletter irishmirror Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe More On Meath Navan Mental health", "articleID": "2018021814_00242777_W", "names": {"Brian Johnson": ["Q16194125", "Q16970531", "Q18233338", "Q18603560", "Q20639270", "Q21075786", "Q21598224", "Q28766669", "Q2924932", "Q295948", "Q4963696", "Q4964217", "Q4964218", "Q4964219", "Q4964221", "Q4964222", "Q4964224", "Q4964225", "Q4964226", "Q912414"], "Louise Walsh": ["Q38077351", "Q52613030"], "Marie Johnston": ["Q21264355", "Q48211537"]}}, {"date": "2018-02-19", "url": "http://www.huffingtonpost.co.uk/entry/neighbours-spoilers-plain-jane-superbrain-return-annie-jones_uk_5a8aa1cee4b05c2bcaccdca3", "content": "Back when \"Neighbours' regularly pulled in UK audiences of up to 20 million during the 1980s,\" Plain <mark>Jane</mark> Superbrain' was one of the best-loved characters. Well, now nearly 30 years on from her departure, she's set to make a dramatic return to the Australian soap. <mark>Jane Harris</mark> - played by Annie Jones - was remembered by fans for being the nerdy best friend of Kylie Minogue's character Charlene Mitchell. FremantleMedia Ltd/REX/Shutterstock Plain <mark>Jane</mark> Superbrain was Charlene Mitchell's best friend Her bookishness earned her the nickname \"Plain <mark>Jane</mark> Superbrain', but she underwent a glamorous makeover to win the heart of <mark>Mike Young</mark> (Guy Pearce). Bosses have now revealed she will be returning to Ramsay Street to tie up some unfinished business, as part of an upcoming guest stint. However, it remains unclear what will bring her back, as the only current cast member she has connections to are <mark>Paul Robinson</mark> (Stefan Dennis). Speaking about her comeback, Annie said:\" I was absolutely thrilled to be asked to return to \"Neighbours'. As an actor, the best thing you can be is a working actor .\" I've done a lot of guest roles but usually very short-lived, so this has been lovely to come back for an extended period and really get my teeth into a part. \"FremantleMedia Ltd/REX/Shutterstock Annie originally played <mark>Jane</mark> from 1986 to 1989 Stefan added:\" This is going to sound terribly gushy, Annie is just the same as she was on the show 30 years ago--kind, funny and just a beautiful person to be around. I've loved having her back on set. \"Annie is the latest in a long line of former stars to return to the soap in recent months, with Natalie Bassingthwaite recently reprising her role as the iconic Izzy Hoyland. Annie will be back on screen from April .\" Neighbours' airs weekdays at 1.45 pm and 5.30 pm on Channel 5. READ MORE: Ex - \"Neighbours' Star Craig McLachlan Denies Sexual Misconduct Allegations Former\" Coronation Street' Star <mark>Ryan Thomas</mark> \"Lands Impressive New Soap Role' Adele Is Not Impressed Over\" Neighbours' UK Axe Reports Suggest a correction Ash Percival Entertainment Editor, HuffPost UK MORE: uktv uk soaps nostalgia neighbours", "articleID": "2018021911_00205916_W", "names": {"Jane Harris": ["Q21458202", "Q21458207", "Q6152356", "Q6152357"], "Mike Young": ["Q17144212", "Q19664774", "Q3308595", "Q6849349", "Q6849350", "Q6849351", "Q6849355"]}}]