[{"date": "2018-02-19", "url": "http://www.huffingtonpost.co.uk/entry/neighbours-spoilers-plain-jane-superbrain-return-annie-jones_uk_5a8aa1cee4b05c2bcaccdca3", "content": "Back when \"Neighbours' regularly pulled in UK audiences of up to 20 million during the 1980s,\" Plain <mark>Jane</mark> Superbrain' was one of the best-loved characters. Well, now nearly 30 years on from her departure, she's set to make a dramatic return to the Australian soap. <mark>Jane Harris</mark> - played by Annie Jones - was remembered by fans for being the nerdy best friend of Kylie Minogue's character Charlene Mitchell. FremantleMedia Ltd/REX/Shutterstock Plain <mark>Jane</mark> Superbrain was Charlene Mitchell's best friend Her bookishness earned her the nickname \"Plain <mark>Jane</mark> Superbrain', but she underwent a glamorous makeover to win the heart of <mark>Mike Young</mark> (Guy Pearce). Bosses have now revealed she will be returning to Ramsay Street to tie up some unfinished business, as part of an upcoming guest stint. However, it remains unclear what will bring her back, as the only current cast member she has connections to are <mark>Paul Robinson</mark> (Stefan Dennis). Speaking about her comeback, Annie said:\" I was absolutely thrilled to be asked to return to \"Neighbours'. As an actor, the best thing you can be is a working actor .\" I've done a lot of guest roles but usually very short-lived, so this has been lovely to come back for an extended period and really get my teeth into a part. \"FremantleMedia Ltd/REX/Shutterstock Annie originally played <mark>Jane</mark> from 1986 to 1989 Stefan added:\" This is going to sound terribly gushy, Annie is just the same as she was on the show 30 years ago--kind, funny and just a beautiful person to be around. I've loved having her back on set. \"Annie is the latest in a long line of former stars to return to the soap in recent months, with Natalie Bassingthwaite recently reprising her role as the iconic Izzy Hoyland. Annie will be back on screen from April .\" Neighbours' airs weekdays at 1.45 pm and 5.30 pm on Channel 5. READ MORE: Ex - \"Neighbours' Star Craig McLachlan Denies Sexual Misconduct Allegations Former\" Coronation Street' Star <mark>Ryan Thomas</mark> \"Lands Impressive New Soap Role' Adele Is Not Impressed Over\" Neighbours' UK Axe Reports Suggest a correction Ash Percival Entertainment Editor, HuffPost UK MORE: uktv uk soaps nostalgia neighbours", "articleID": "2018021911_00205916_W", "names": {"Paul Robinson": ["Q16751562", "Q17525451", "Q18217918", "Q215824", "Q21932167", "Q3372113", "Q3372118", "Q674763", "Q7153277", "Q7153282", "Q7153284", "Q7153285", "Q7153286", "Q725397"], "Ryan Thomas": ["Q22248616", "Q3943100", "Q49338010", "Q7384580", "Q7384583", "Q7384584"]}}, {"date": "2018-02-20", "url": "https://www.washingtonpost.com/local/public-safety/mueller-probe-london-based-son-of-russian-businessman-to-plead-guilty-to-false-statements/2018/02/20/142f4d2e-164b-11e8-b681-2d4d462a1921_story.html?tid=pm_local_pop", "content": "The London-based son-in-law of a Russian businessman is set to plead guilty Tuesday afternoon in Washington to making false statements in special counsel Robert S. Mueller III's probe of alleged Russian interference in the 2016 U.S. presidential election, according to a new court filing. Alex Van der Zwaan was charged with one count of making false statements, a felony, about his work as an attorney employed by a law firm engaged in 2012 by the Ukraine Ministry of Justice to prepare a report on the trial of former Ukrainian Prime Minister Yulia Tymoshenko. Tymoshenko was imprisoned by former president Viktor Yanukovych for signing in 2009 a controversial gas supply deal with Russia. Van der Zwaan is the son-in-Russian oligarch German Khan. U.S. prosecutors in Mueller's office said the case was related to former Trump 2016 presidential campaign manager Paul Manafort, who was an adviser to Yanukovych. Manafort and his longtime employee, <mark>Rick Gates</mark>, have pleaded not guilty to conspiracy, fraud and money laundering charges arising from the allegedly secret lobbying work for a Russian-friendly political party in Ukraine. Former associate to former Trump campaign manager Paul Manafort, <mark>Rick Gates</mark> (Michael Reynolds/Epa-Efe/Rex / Shutterstock) [Judge lashes out at \"unacceptable' delays in setting trial of Manafort and <mark>Gates</mark> in Mueller probe] Van der Zwaan is expected to appear at an arraignment and plea hearing at 2:30 p.m. Tuesday before U.S. District Court Judge Amy Berman Jackson of Washington. In a two-page information document, prosecutors alleged that Van der Zwaan falsely told the FBI and Mueller's office that his last communication with <mark>Gates</mark> was in mid-August 2016 in an innocuous text message and his last communication with another, unnamed person was in 2014 when Van der Zwaan discussed that person's family. Van der Zwaan also allegedly falsely said he did not know why a September 2016 email between him and the other person, identified in court documents only as\" person A \"was not produced to prosecutors. In fact, prosecutors alleged, Van der Zwaan spoke with both <mark>Gates</mark> and Person A regarding the report on Tymoshenko and recorded the calls. Van der Zwaan also allegedly\" deleted and otherwise did not produce emails \"sought by prosecutors and an unnamed law firm. A criminal information is a type of charging document that can be filed only with a defendant's permission and usually indicates the person is cooperating with investigators. A judge does not have to accept a plea deal, and a defendant can change his mind before making a plea. U.S. authorities in 2016 asked the Skadden, Arps, Slate, Meagher & Flom law firm for information and documents related to its work on behalf of Yanukovych's government, including Manafort's work arranging the report that was used by the former president's allies to justify his rival Tymoshenko's arrest. Correction: An earlier version of this story described Alex Van der Zwaan as German Khan's son. He is his son-in-law and the story has been corrected.", "articleID": "2018022015_00085296_W", "names": {"Rick Gates": ["Q42429771", "Q92901"]}}, {"date": "2018-02-21", "url": "http://www.local10.com/news/politics/hhs-official-promoted-conspiracy-theories-on-social-media", "content": "HHS official promoted conspiracy theories on social media Cordova placed on leave By ANDREW KACZYNSKI AND NATHAN MCDERMOTT, CNN Posted: 4:17 AM, February 21, 2018Updated: 4:17 AM, February 21, 2018 HHS. gov via CNN Senate confirms HHS secretary nominee Alex Azar (CNN) - A top official at the Department of Health and Human Services has been placed on administrative leave after a CNN KFile inquiry while the agency investigates social media postings in which he pushed unfounded smears on social media. Jon Cordova serves as the principal deputy assistant secretary for administration at HHS. A KFile review of Cordova's social media accounts found that he pushed stories filled with baseless claims and conspiracy theories, including stories that claimed Gold Star father Khizr Khan is a \"Muslim Brotherhood agent\" and made baseless claims about Sen. Ted Cruz's personal life. Related content \"Mr. Cordova is currently on administrative leave while we look into this issue further,\" a HHS spokesperson said in a statement. Cordova did not respond to a request for comment. Cordova joined HHS in February of 2017, initially as part of the Office of the White House Liaison. In his current role, Cordova oversees day-to-day operations for the Office of Human Relations, Office of the Chief Information Officer, Office of Security and Strategic Information, Equal Employment Opportunity Compliance and Operations Office and the Program Support Center, according to his biography posted on the HHS website. Prior to joining HHS, Cordova served as a Trump delegate from California to the Republican National Convention and worked in communications for <mark>Donald Trump</mark>'s campaign in California. During the 2016 presidential campaign, Cordova routinely promoted stories on social media that pushed fringe claims about Trump's opponents that have no basis in fact. In July 2016, Cordova shared a story that asserted without evidence that Khan, who spoke out against Trump at the 2016 Democratic National Convention, was a \"Muslim Brotherhood agent\" and \"a Muslim plant working with the Hillary Clinton campaign .\" He also shared another story that falsely claimed the Clinton Foundation paid Khan. Cordova also shared unfounded and false stories that claimed Cruz, a Texas Republican frequented prostitutes, was involved in a sex scandal and was hiding various public records related to his birth and education. In a post in 2013, Cordova called Democrats \"the real racists\" and said that 95% of blacks would not have voted for President Barack Obama if he were white. In a December 2016 comment on Facebook on an article about a nonprofit selling access to President Trump during the inauguration, Cordova called Clinton \"a slimy trailer trash huckster .\" Cordova also repeatedly shared fake or conspiratorial stories, including one that claimed that Clinton was photoshopping her rallies to make them look bigger, one with a fake quote from Clinton about Democratic voters, one that claimed NBA star Dwyane Wade endorsed Trump and one with a photoshopped picture of a black man holding a sign that read, \"No mother should have to fear for her son's life every time he robs a store .\" Cordova also struck a conspiratorial tone on his since-scrubbed Twitter account, of which only a few tweets are archived on several websites. In one tweet, Cordova called for a boycott of Budweiser because the company supported \"jihadis\" over white immigration. In another tweet, Cordova speculated the reason the identity of the shooter at Umpqua Community College in 2015 hadn't been made public was because he was a Muslim. The shooter was not a Muslim. In another tweet, Cordova compared MoveOn.org and the Black Lives Matter movement to Nazis. Copyright 2018 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2018022109_00124299_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2018-02-22", "url": "http://www.thedp.com/article/2018/02/amy-wax-op-ed-penn-law-upenn-philadelphia-professor-bourgeois-culture", "content": "Amy Wax's newest opinion piece has reignited a familiar debate at Penn Law By Lucy Curtis <1 minute ago Credit: <mark>Julio Sosa</mark> Months after she sent campus into an uproar with a fiery opinion piece praising \"bourgeois culture,\" Penn Law School professor Amy Wax has divided students and colleagues alike with a familiar weapon: another op-ed piece. Her new article, titled \"What Can't Be Debated on Campus,\" was published in The Wall Street Journal on Feb. 15 and explores the \"unreasoned speech\" she encountered in response to her original Philadelphia Inquirer op-ed. Wax's piece has raised questions about how Penn Law handled the ensuing furor over her controversial opinions and invited rancorous debate from professors and students over her teaching a mandatory, first-year course. In the op-ed, which Wax adapted from a speech she delivered in December, she accused Dean of Penn Law Theodore Ruger of asking her to \"take a leave of absence next year\" and stop teaching her civil procedure class, which is required for first-year students. \"When I suggested that it was his job as a leader to resist such illiberal demands, he explained that he is a\" pluralistic dean' who must listen to and accommodate \"all sides,'\" Wax wrote. Penn Law spokesperson Steven Barnes sharply disputed Wax's claim in a statement sent to The Daily Pennsylvanian. \"Professor Wax is a valued member of our faculty and nothing has changed in her status,\" Barnes said. He described the conversation with Wax as a \"discussion with the dean about the timing of a regularly-accrued sabbatical, a discussion the dean has with many faculty members each year, as every tenured faculty member enjoys a sabbatical benefit, with full pay .\" Wax also took aim at her colleagues, including the group of 33 professors who criticized her in an open letter published in August in the DP. Their piece contained \"no argument, no substance, no reasoning, no explanation whatsoever as to how our op-ed was in error,\" she wrote. One of the co-writers of the open letter, Penn Law professor Jonah Gelbach, said Wax's piece in the Journal initially omitted the fact that he and two other legal scholars wrote extensive rebuttals to Wax in the fall. Gelbach's essay, titled \"Facts v. Wax,\" was published in September and is over 14,000 words long. \"The version of the op-ed that now appears online contains a sentence acknowledging those posts, but only because I shamed a WSJ editor into adding it,\" he wrote in an email. At the bottom of Wax's article, an addendum now reads, \"The essay has been updated to note that two signers of the open letter condemning Ms. Wax's op-ed later wrote substantive responses to her arguments .\" The piece has been amended to note the two responses to Amy Wax posted at Heterodox Academy and linking to them. https: //t.co/9tSIoTjxEU--Gary Rosen (@ garyrosenWSJ) February 18, 2018 Gelbach also said he sent an early draft of the Heterodox Academy essay to Wax, but she responded by saying that she did not have time to read it. (Wax did not respond to repeated requests for comment .) In addition to openly questioning Ruger's conduct, Wax has also reopened a debate about her fitness to teach a mandatory course for 1Ls, some of whom advocated for her removal. \"A couple weeks before we even got here, she publishes an op-ed openly denigrating cultural backgrounds of students who are then required to take her class,\" said Vivek Kembaiyan, a 1L student who sits on the Council of Student Representatives for Penn Law. \"Students who've had her [are] apprehensive about going to her office hours, or asking for a recommendation, because they come from one of the specific backgrounds that she calls out in her op-ed .\" In the fall, the Penn Black Law Students Association and the Penn chapter of the National Lawyers Guild called on Wax to be barred from teaching the course. B.J. Courville, a 1L student, said she has separately petitioned faculty members to remove Wax from the first-year curriculum as well. \"At the end of the day I deserve the same education and the same safe learning environment as the person next to me, from a strictly economic standpoint,\" Courville said. But months after that debate receded from the minds of many higher education observers, Penn Law students remain divided over Wax's standing. \"There are a lot of times when I find myself at odds with the opinions of my professors,\" 3L student Mia Rendar said. \"I don't think it's right to punish someone for giving an independent opinion .\" Conservative sites like Breitbart and the National Review have rallied behind her and Wax has said she received many supportive emails in response to her original Inquirer piece. Other critics who disagree with her argument about bourgeois cultural values have decried the style of ad hominem attacks that refer to her a \"Nazi\" and a \"racist .\" \"Every open letter you sign to condemn a colleague for his or her words brings us closer to a world in which academic disagreements are resolved by social force and political power, not by argumentation and persuasion,\" wrote scholar Jon Haidt in an essay defending Wax. Sign up for our newsletter Get our newsletter, Dear Penn, delivered to your inbox every weekday morning. Sign Up Gelbach and Wax's many intellectual adversaries are not as persuaded. \"Professor Wax isn't entitled a safe-space bubble in which she can express her opinions however she likes without fear of criticism from those whom she angers,\" Gelbach wrote. \"Debate comes with a price .\" All comments eligible for publication in Daily Pennsylvanian, Inc. publications. More Articles Dozens of Penn students, faculty gather in the rain to protest gun violence on Thursday Republican candidate for governor pledged to prioritize \"people over politics' at Penn talk Students critique sexual assault policy after admin. say they haven't heard significant feedback Penn men's soccer announces <mark>Brian Gill</mark> as next head coach Inside Penn grad students' decision to stall their efforts to unionize Valentine's Day Gift Guide for the Last Minute Shopper Sponsored", "articleID": "2018022219_01027069_W", "names": {"Brian Gill": ["Q16230677", "Q22106454", "Q47068063"], "Julio Sosa": ["Q5955805", "Q6309065"]}}, {"date": "2018-02-22", "url": "http://kake.com/story/37569498/former-nfl-players-wichita-restaurants-seized-over-back-taxes", "content": "Former NFL player's Wichita restaurants seized over back taxes Posted: Follow @ KAKEnews WICHITA, Kan. (KAKE) - Authorities have seized the assets of a former NFL player's two Wichita restaurants because he owes more than $80,000 in back taxes. Agents from the Kansas Department of Revenue and Sedgwick County Sheriff's Office on Wednesday seized the assets of Wings & Things LLC. The KDOR said the delinquent state sales and withholding tax owed by 34-year-old Kamerion Wimbley totals $82,329.50. Wings & Things has two Wichita locations: 2800 East Central and 2624 East 21st Street North. The types of assets seized include all known bank accounts, on-site cash, business inventory, as well as personal property belonging to Wimbley. The business was sealed closed with a public notice posted on the outside. Andover restaurant seized over back taxes All seized assets will be sold at public auction and the proceeds will pay for the delinquent taxes. The KDOR says its policy and practice is to work with taxpayers in delinquent status to voluntarily enter into repayment agreements. \"It is only after these efforts and multiple failed collection attempts that the Department is forced to execute a tax warrant, utilizing such actions as bank levies, till taps, and ultimately asset seizure to ensure compliance with the law .\" Wimbley, a Wichita Northwest High School graduate, played for the Cleveland Browns, Oakland Raider and Tennessee Titans. Kansas students arrested stolen gun found in car at school Jace Sull (left) and Chase Weaver Authorities say a Kansas high school student has been arrested after a stolen gun was found in his car on Wednesday. Authorities say a Kansas high school student has been arrested after a stolen gun was found in his car on Wednesday. With a winter storm in the forecast, these events have been cancelled or changed. With a winter storm in the forecast, these events have been cancelled or changed. Updated: Thursday, February 22 2018 3:29 PM EST 2018-02-22 20:29:31 GMT The stepmother of a missing 5-year-old Wichita boy has been booked into the Sedgwick County Jail. The stepmother of a missing 5-year-old Wichita boy has been booked into the Sedgwick County Jail. Former NFL player's Wichita restaurants seized over back taxes Agents from the Kansas Department of Revenue and Sedgwick County Sheriff's Office on Wednesday seized the assets of Wings & Things LLC. Agents from the Kansas Department of Revenue and Sedgwick County Sheriff's Office on Wednesday seized the assets of Wings & Things LLC. House passes body camera bill The Kansas House has passed bills aimed at making law enforcement more transparent by revising laws dealing with officers' body camera footage and agencies' seizure of property. The Kansas House has passed bills aimed at making law enforcement more transparent by revising laws dealing with officers' body camera footage and agencies' seizure of property. Morris helps No. 13 Wichita State hold off Tulane, 93-86 Shaquille Morris had 25 points and nine rebounds to help No. 13 Wichita State outlast Tulane 93-86 on Wednesday night. Conner Frankamp scored six of his 18 points in the final four minutes, Shaquille Morris had 25 points and nine rebounds to help No. 13 Wichita State outlast Tulane 93-86 on Wednesday night. Conner Frankamp scored six of his 18 points in the final four minutes, <mark>Brown</mark>'s 14 second-half points pushes Kansas State past Texas <mark>Barry Brown</mark> scored 14 of his 16 points in the second half and Kansas State pulled away late to beat Texas 58-48 on Wednesday night. <mark>Barry Brown</mark> scored 14 of his 16 points in the second half and Kansas State pulled away late to beat Texas 58-48 on Wednesday night.", "articleID": "2018022220_00826410_W", "names": {"Barry Brown": ["Q4864046", "Q4864047", "Q4864048", "Q4864049", "Q4864052"]}}, {"date": "2018-02-22", "url": "http://www.ithaca.edu/news/releases/k-i-s-s-i-n-g-comes-to-the-ithaca-college-stage-49489/", "content": "Lenelle Möise's \"K-I-S-S-I-N-G' Comes to the Ithaca College Stage Ryan Dickson, 2/22/2018 Ithaca College Theatre presents\" K-I-S-S-I-N-G, \"a play about teenagers navigating emotional baggage and economic inheritances written by Ithaca College alumna Lenelle Moïse' 02. The play will be performed at Ithaca College's McCarroll Studio Theatre on February 23 and 24, and March 2 and 3 at 8:00 p.m., and on February 24 and 25 and March 3 at 2:00 p.m. Tickets are free and must be picked up at the entrance to the McCarroll Studio Theatre on the ground floor of Dillingham Center 15 minutes before the scheduled start of the performance. Reservations are recommended and can be made on Facebook or by emailing icstudio2tam @ gmail.com. Audiences are advised that this production includes mature content .\" K-I-S-S-I-N-G \"opens February 23 in the McCarroll Studio Theatre .\" K-I-S-S-I-N-G \"tells the story of Lala, an\" around-the-way-girl \"who meets the brainy and affluent Dani. Their instant flirtation grows into an inseparable season of firsts. The pair's playful debates about everything from visual art to old-school music seem romantic. So why haven't they started K-I-S-S-I-N-G? Moïse is an award-winning poet, playwright, composer and performance artist. With humor, charm and power, her solo performances address intersectional feminism, LGBTQ identities, black history, Haitian-American culture, immigration and inclusion. She is the author of the poetry collection\" Haiti Glass, \"a Lambda Literary Award finalist and winner of the 2015 PEN Oakland Josephine Miles Literary Award, and her poems and essays have appeared in numerous publications. Her plays include\" Merit, \"winner of the 2011--12 Ruby Prize, the off-Broadway hit\" Expatriate \"and\" The Many Faces of Nia. \"Moïse has returned to campus several times to speak and perform since graduating from Ithaca College in 2002 with a planned studies degree in\" women in storytelling. \"She is currently the college's playwright-in-residence, sponsored by the Department of Theatre Arts and the women's and gender studies program. She also hold an MFA in playwriting from Smith College, and was a Huntington Theatre Company Playwriting Fellow and a Next Voices Fellow at New Rep Theatre. Moïse leads energetic writing and movement workshops for students and creative adults. The cast of\" K-I-S-S-I-N-G \"includes Tyler Sapp' 18, Mariah Lyttle' 19, Dharon Jones' 20, Kellik Dawson' 20, Erin Lockett' 20, Drew Nauden' 20, Jahmar R. Ortiz' 21, Maya Jones ’20 and Jake Forehlich' 19. The production is directed by Ithaca College associate professor <mark>Dean Robinson</mark> and assistant directed by Devin Gatlet' 19. The design team includes scenic/costume designer Brock Viering' 19, lighting designer Shane Hennessy' 19, sound designer Ron Ziomek ’19 and art curator/movement consultant x rance' 18. The stage manager is Karley Davis ’19 and the dramaturg is Vanessa Reyes' 18. A nationally recognized professional theatre-training program, the Department of Theatre Arts attracts students from across the globe. Throughout the school year, undergraduate students present all aspects of theatre in a professional model. Follow Ithaca College Theatre on Facebook and on Twitter and Instagram at @ ICTheatreArts. Dillingham Center proudly accommodates all patrons. Individuals with special needs are asked to contact 607-274-3224 or email icstudio2tam @ gmail.com to request accommodations as soon as possible.", "articleID": "2018022221_00356184_W", "names": {"Dean Robinson": ["Q16735312", "Q21285506"]}}, {"date": "2018-02-25", "url": "http://savannahnow.com/accent/2018-02-24/these-people-s-lives-mattered-too-book-gives-new-narrative-savannah-s-weeping-time", "content": "Posted February 24, 2018 09:02 pm By Special to Savannah Morning News \"These people's lives mattered, too': Book gives a new narrative to Savannah's The Weeping Time Pamela Oglesby, at left, and Shirley James helped commemorate The Weeping Time as part of the 27th annual Savannah Black Heritage Festival in 2016. James was festival coordinator. (Carl Elmore/Savannah Morning News file photo)\" The Weeping Time: Memory and the Largest Slave Auction in American History \"by Anne C. Bailey Anne C. Bailey The 2016 commemoration of The Weeping Time was held at the site of the Georgia Historical Society marker explaining the 1859 slave sale. The marker is on Augusta Avenue at Dunn Street. (Photo by Carl Elmore/Savannah Morning News file photo) The 2016 commemoration of The Weeping Time held at the site of the Georgia Historical Society marker explaining the 1859 slave sale. The marker is on Augusta Avenue at Dunn Street. (Carl Elmore/Savannah Morning News file photo) O n March 2-3, 1859, the largest documented auction of human beings on U.S. soil took place at the Ten Broeck Race Course, just two and a quarter miles west of downtown Savannah. The sale of 436 men, women and children--including 30 babies--came to be known as The Weeping Time, and it is one of the most significant events leading up to the Civil War, though few textbooks mention it and very little has been written about it over the 159 years since it occurred. A historical marker documenting the event was erected in a small triangular park at the corner of Augusta Avenue and Dunn Street in West Savannah and dedicated on March 2, 2008, by Mayor <mark>Otis Johnson</mark>. Because of its somewhat obscure placement, it's doubtful that many come across the marker unless they're explicitly seeking it out. A smattering of articles have been written about The Weeping Time over the years and a handful of books have touched on the subject, including one well-researched, self-published edition by Gullah-Geechee historian Griffin Lotson. But until now, there has never been a full-scale accounting of this incredible episode in American history in a book by a mainstream publisher. Historian and associate professor Anne C. Bailey has stepped into the breach with her book,\" The Weeping Time: Memory and the Largest Slave Auction in American History, \"published by Cambridge University Press. Bailey teaches history and Africana Studies at Binghamton University, State University of New York. She spent years researching this epochal event and tracing the genealogy of a number of the descendants of the auction. Bailey will be speaking at Georgia Southern's Armstrong Campus on March 22. Too few narratives Bailey's initial interest was ignited after she visited <mark>Thomas Jefferson</mark>'s Monticello Plantation in 2006 and noticed how the complicated issue of slavery was still being grappled with and the uncomfortable story of Sally Hemings was marginalized. When Bailey came across the account of how 140 of <mark>Jefferson</mark>'s slaves were auctioned off after his death, it struck a deep chord inside her, particularly the word\" auction \"as it applied to human beings .\" That word just stuck with me, \"explains Bailey .\" I realized that, having read hundreds of books on slavery, I don't recall that an auction had been used as a lens by which we looked at the period of slavery. \"Bailey mentions a few significant studies of slave auctions--most notably Walter Johnson's chronicle of the New Orleans slave market--but they have been few and far between .\" There really aren't too many people looking at this question of slave auctions and the fact that they were so common, \"says Bailey .\" I also noticed that when I looked at it carefully, it was also pivotal in the minds and hearts of anyone who was writing their own slave narrative. \"Bailey says if you look at the canon of autobiographies of enslaved people, the auction block was a central motivation for many things, including escape. She concluded that it was such an integral element to understanding the so-called\" peculiar institution \"of slavery that it eventually led her into the annals of The Weeping Time. People who need a voice The entirety of the story surrounding The Weeping Time is so extraordinary, it's a wonder that volumes haven't already been written about it. It's Shakespearean in scope and includes a cast of characters that would be nearly impossible to imagine if they weren't real. It includes Pierce Mease Butler, the reckless gambler and owner of the enslaved people who were sold. Butler inherited his wealth (and\" human chattel \") from his grandfather, Maj. Pierce Butler, one of the largest slaveholders in his time and the author of the\" Fugitive Slave Clause in the U.S. Constitution. \"Butler's wife, Frances Anne\" Fanny \"Kemble, was a well-known British actress and abolitionist who claimed she was unaware of Butler's entanglement in the slave trade when they married, but eventually visited the plantation in Darien that Butler inherited and wrote what is considered the most detailed first-hand account of slavery in\" Journal of a Residence on a Georgia Plantation (1838-1839). \"And though their stories are even less known, some of the people who were sold in 1859 have been given a voice by Bailey through her painstaking research and by the eyewitness account of an undercover reporter from the New York Tribune, Mortimer Thomson, who wrote under the pseudonym Q. K. Philander Doesticks. Bailey recounts some of the scenes that Thomson relates in his article at the time about people like Dorcas and Jefferey--considered mere\" hands \"and listed as auction items--but who were in love and shared a life, only to be ripped apart by being sold separately and taken to different parts of the country .\" An American issue' One of the things Bailey's book does best is sussing out the thin narrative threads of these enslaved individuals and giving them a voice despite the paucity of information we have about them. Bailey's goal is not only to tell the tale of The Weeping Time, but also to explain why it's relevant today and to bring the memory of these individuals who have been hidden from history for so long to the fore. \"Because so much of black American life in my view has been about just getting to the next level--pushing through to the next level and moving forward--looking back has been difficult,\" explains Bailey. \"But I think there's something so powerful--even if you go back just a few generations--about knowing who these people were and that their lives matter. You know, we talk about black lives matter. These people's lives mattered, too. Just to be able to call their name is a really powerful thing .\" In the last few chapters of the book, Bailey talks about the healing power the restoration of these historical memories can have. She talks about the \"democratization of memory\" by explaining why it's so important to highlight these previously untold stories as part of our collective past. \"Maybe we can't do anything about the past, but what can we do now?\" asks Bailey. \"That concerns me. If we can't do anything about the past, we can certainly rectify some wrongs in the present .\" Slavery is an American issue. This is not a southern problem, its legacy is an American problem...The great story of slavery is that it's not a one-dimensional story. \"A work of restoration One of the most salient aspects of Bailey's book is how she was able to trace the genealogy of some of the descendants of The Weeping Time. Due to the overwhelming absence of genealogical records, African Americans have traditionally had a harder time than most in tracing their lineage, but Bailey says there's plenty of progress that can and should be made despite the substantial hurdles .\" It's a work of restoration. We have to work with what we have. I don't think we have everything that we need. There's no question that we don't. But I think for too many historians, that was a reason to not try at all. \"I find that what happens in most cases is that people are pleasantly surprised at how far they can go. Even if it's just on one side of the family, maternal versus paternal or what have you...There's more there than we think, let me put it that way .\" What Bailey most hopes with her book is of course that people buy it, but that they also actually read it and not let it just sit on a shelf. The history it recounts is very much alive and relevant to today. And she's optimistic that it will contribute to a full understanding of our nation's history and fill in some of the gaps that have been left empty for too long. \"I'm hopeful. History moves slowly, so I think it's not fast enough for most of us, but I'm hopeful that people are open to looking at things in a different way, and I think there are more of them than not .\" IF YOU GO", "articleID": "2018022504_00025623_W", "names": {"Otis Johnson": ["Q21934110", "Q7108796"], "Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}}]