[{"date": "2018-02-25", "url": "http://lovecraft.wikia.com/wiki/Winifred_V._Jackson?diff=15118&oldid=15108", "content": "Revision as of 08:31, February 25, 2018 (edit) AVoraciousReader (wall | contribs) ← Older edit Latest revision as of 08:48, February 25, 2018 (edit) (undo) AVoraciousReader (wall | contribs) Line 1: Line 1: + {{realworld}} {{Infobox writer {{Infobox writer | name = Winifred Virginia Jackson | name = Winifred Virginia Jackson Latest revision as of 08:48, February 25, 2018 \"The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown .\" - H.P. Lovecraft This article is written on a topic in the real world and reflects factual information. Winifred V. Jackson Pseudonym (s) Elizabeth Berkley Birth Date 1876 Birthplace Maine Death Date 1959 Nationality United States Genre Horror, poetry, fantasy Spouse Horace Jordan (divorced 1919) Winifred V. Jackson was a collaborator with <mark>Howard Phillips</mark> Lovecraft on the short stories, The Green Meadow and The Crawling Chaos, under the name Elizabeth Berkeley. Details about her life are scarce, but there is speculation that she and Lovecraft were romantically involved during the period of their collaborations. Lovecraft was highly congratulatory of her work and praised her talent in his essay, Winifred Virginia Jackson: A \"Different\" Poetess. It is of note that she was married to an African-American man, Horace Jordan. This was a rarity in the era. Furthermore after her divorce and during her maybe-romance with Lovecraft, she was romantically involved with the African-American poet and critic <mark>William Stanley</mark> Braithwaite. Some of the remaining examples of her poems appear in his collections. This article is a stub. You can help the The H.P. Lovecraft Wiki by expanding it. Retrieved from \"http: //lovecraft.wikia.com/wiki/Winifred_V._Jackson? oldid=15118\" Categories: Articles written on real-world topics Article stubs Writers Cthulhu Mythos writers", "articleID": "2018022509_00122580_W", "names": {"Howard Phillips": ["Q13569762", "Q22907741", "Q977175"], "William Stanley": ["Q17152417", "Q41755515", "Q8018729"]}}, {"date": "2018-02-26", "url": "http://mufclatest.com/jose-mourinho-praises-manchester-united-for-the-team-effort-after-chelsea-victory-at-the-theatre-of-dreams/", "content": "Jose Mourinho praises Manchester United for the \"team effort' after Chelsea victory at the Theatre of Dreams February 26, 2018 Manchester United manager Jose Mourinho spoke about many aspects of the 2-1 victory over reigning Premier League champions, Chelsea at Old Trafford on Sunday. The defeat for the London club has seen them drop out of the top four in the league with Tottenham Hotspur beating Crystal Palace in the earlier kick-off on Sunday. United regained second place in the league after Liverpool took charge of the position for some 11 hours with United sitting level on goal difference but two points better off. United fell behind in the match after Willian broke behind United's defensive line and fired a shot diagonally past David De Gea. The lead for the visitors lasted just seven minutes after Romelu Lukaku scored the equaliser which was assisted by Anthony Martial. It was Lukaku's 22nd goal for Manchester United and his first against his former club. Perhaps those who operate Football Twitter will now be able to drop that\" Lukaku has not scored against a big club \"rubbish now? The match was won after Jesse Lingard replaced Martial in the 64th minute of the match and just 11 minutes later, the Academy graduate fired his 13th goal of the season, the eighth in the Premier League with a stunning header after Lukaku played the ball into the box. Lingard then celebrated by recognising the Black Panther, a recent release in the cinema. Mourinho spoke about the important result, his second victory over his former club at the Theatre of Dreams, speaking about how his side beat a very good team:\" I think we beat a fantastic team. For some reason, they were the champions last season. For some reason, they played the way they did against Barcelona. For some reason, they started the game so well as they started here. \"We beat a very good team and to beat a very good team, you need to be organised but you also need to have a humble spirit where everybody works, everybody fights, everybody tries to follow a game plan. I repeat, we beat a very good team .\" Mourinho then went into detail about how tight the match was. Last season, United won this fixture 2-0 after Ander Herrera man-marked Eden Hazard out of the game with both Herrera and Marcus Rashford scoring the goals. This game was not going to be like that, especially after Willian opened the scoring 13 minutes before the end of the first half. The equaliser scored by Lukaku opened the game up and United looked more likely to score again in the second half, which they did. Speaking about the tightness of the game, Mourinho said: \"They started very well, it's as simple as that. When Chelsea hit the posts, I was looking to my players and I was thinking\" what could we do?' or \"who can I blame?' but it was so beautifully played that I had nothing to say. They are a very good team--they have big routines of their football. They have a fantastic dynamic of the way they project the wing-backs .\" I was trying to find a way for my players to be dangerous in the interior football because through the sides Chelsea are very, very strong, so we found a way to play against them where we didn't concede much. \"I think we had a good control of Eden [Hazard], Willian, of course, is an amazing player and in that action [his goal] he killed us, but we took progression of the game, we had more and more control of the game without creating lots of chances because we didn't but they also didn't. That's the way I was expecting the game to be when I spoke with you before the game--a tight game .\" Scott McTominay started the match, his third in a row for United. Mourinho had tasked the 20-year-old to mark Hazard, which he did to the best of his abilities, also getting involved in other aspects of the game. Many criticise United's Academy players, even so-called United supporters, suggesting they are not good enough to play in the team. There seems to be an obsession with having world class players when that is not necessary for every position in the team. Manchester United are built on foundations of youth and that continues. Mourinho, speaking about McTominay, said: \"I think he's a fantastic player--a player that is what I call the modern midfield player, which in the end is a bit of what the top midfield players of the past were. They can do everything. The only thing he is not doing yet is scoring goals, which he can. But because I'm giving him different jobs, he's not yet free to do that .\" We are starting from the basics and the basics he's doing wonderfully well. I think he can also score goals--he has that talent. In pre-season, we understood that. But we are adapting him to his multi-functionality and he's doing fantastic jobs for us, like he did in Sevilla against Ever Banega and today against Eden, so I'm really happy with the player. \"Mourinho closed with the great team effort which was shown in the victory. The Portuguese manager singled out praise to Nemanja Matic for being phenomenal, Paul Pogba for playing a fantastic game in the midfield--yet the media will continue to talk about this rift and the fact Pogba will leave in the summer. He then stated that he could speak about his central defenders; Victor Lindelof, Chris Smalling, and Eric Bailly, who played the final nine minutes or so. Also talking about his attacking players and the mission Alexis Sanchez had. The United manager also mentioned McTominay again also talking about the big effort of the team as a collective. Mourinho, presumably after having been asked about the possibility of the match being a draw and Chelsea manager <mark>Antonio Conte</mark> suggesting a draw would have been a fair result, the Portuguese agreed that is was a possibility emphasising on the fact that United were much more confident in the second half of the game. Mourinho concluded by saying:\" I don't like to individualise--I think [Nemanja] Matic was phenomenal, I think [Paul] Pogba played a fantastic game in our midfield. I could speak about my central defenders too and the guys in attack--the mission Alexis had, to be the third attacking player but at the same time the fourth midfield player to try to cover the area in front of Scott. I think everyone made a big effort. \"Could the result have been a draw? Yes, it could. But I think in the second half we were more confident, we felt more confident with the defensive base and I think if somebody deserved a victory it was us. But, if you were to say a draw, I would accept that. The important thing for us is that we beat a fantastic team .\" United will have a break of a week before they play a match with the Premier League encounter with Crystal Palace at Selhurst Park being played on Monday 5th March 2018, which will kick-off at 20:00 GMT and will be shown live in the United Kingdom on Sky Sports Premier League HD. United will be seeking another win in the league to cement their standing in second place, which could see them fall to third again in the league by the end of the weekend with Liverpool just two points behind United, entertaining Newcastle United at Anfield. United will face their North West rivals in the Premier League at Old Trafford on Saturday 10th March 2018, kick-off 12:30 GMT--another big match they must win this season. The reverse fixture at Anfield earlier in the season resulted in a 0-0 draw. If United are intent on finished in second place this season, beating those around them is what will be needed. United have already been beaten by Spurs, so the victory over Chelsea is half-way there with just Liverpool to silence once again in the coming weeks. Advertisements First Team, Managers, Opinion 0 July 6, 2017 This upcoming season is crucial to both Manchester United staffers and players. Last season the squad showcased its ability, though it was fairly inconsistent. One of the...Read more First Team, Live Blog, Managers, News, Opinion, Transfer Rumours 0 July 26, 2016 Manchester United are days away from what would have been their fourth pre-season friendly this season, against Galatasaray in Gothenburg, Sweden. Zlatan Ibrahimovic has...Read more First Team, Managers, News, Opinion 0 March 16, 2017 Manchester United beat FC Rostov in the second leg of the round of 16 1-0 at Old Trafford in the UEFA Europa League, winning 2-1 on aggregate. United now find themselves...Read more Academy, First Team, Live Blog, Managers, News, Opinion 0 June 23, 2016 Manchester United have been linked to many players this summer, with Jose Mourinho looking to make his team his own this summer. Zlatan Ibrahimovic has been tipped to joi...Read more", "articleID": "2018022614_00201182_W", "names": {"Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"]}}, {"date": "2018-02-27", "url": "http://marvel.wikia.com/wiki/Marvel_Super_Heroes:_What_The--?!_Season_1_29?diff=4376977&oldid=4354223", "content": "Revision as of 16:39, February 11, 2018 (view source) Luismine23 (wall | contribs) ← Previous diff Latest revision as of 02:27, February 27, 2018 (view source) Luismine23 (wall | contribs) Line 62: Line 62: * Big Butt Universe {{Mentioned}} * Big Butt Universe {{Mentioned}} \"\"Itens:\" ' \"\"Itens:\" ' − * {{a | [[Hunger Virus]]}} + * {{Cameo | [[Hunger Virus]]}} * {{a | [[Iron Man Armor Model 37 | Bleeding Edge Armor]]}} * {{a | [[Iron Man Armor Model 37 | Bleeding Edge Armor]]}} * {{a | [[Black Widow's Gauntlets]]}} * {{a | [[Black Widow's Gauntlets]]}} − <!--+ <!--\"\"Vehicles:\" ' − \"\"Vehicles:\" ' + * <br />--> − * <br /> −--> | Notes = * Watch the full episode [https: //www.youtube.com/watch? v=Jh9NkpgbfNM here]. | Notes = * Watch the full episode [https: //www.youtube.com/watch? v=Jh9NkpgbfNM here]. Latest revision as of 02:27, February 27, 2018 \"Holiday Special with Iron Man & Deadpool\" Gallery Marvel Super Heroes: What The--?! Season 1 #29 December 10, 2013 Episode Title \"Holiday Special with Iron Man & Deadpool\" Director Alex Kropinak Writers Marly Halpern-Graser, Ben Morse, Todd Casey Producers Ben Morse, Todd Casey, Jesse Falcon, Alex Kropinak Previous Episode Next Episode \"San Diego Comic Con 2013 Special\" (June 25, 2013) \"Deadpool vs. Punisher\" (March 10, 2014) Appearing in \"Holiday Special with Iron Man & Deadpool\" Featured Characters: Iron Man (Tony Stark) Supporting Characters: Avengers Captain America (<mark>Steve Rogers</mark>) Hulk (Bruce Banner) Hawkeye (Clint Barton) Black Panther (T'Challa) (First appearance) Black Widow (Natasha Romanova) Thor Wonder Man (<mark>Simon Williams</mark>) (First appearance) Deadpool (Wade Wilson) Ant-Man (Hank Pym) Villains: Skrulls (First appearance) Other Characters: Fin Fang Foom (Mentioned) Guardians of the Galaxy (Mentioned) Sleipnir (Mentioned) Jim Rhodes (Photo) Howard Stark Wolverine (Logan) (Earth-811) (Cameo) Sentinels (Earth-811) (Cameo) Spider-Man (Miguel O'Hara) (Cameo) Marvel Zombies (Cameo) Colonel America (<mark>Steve Rogers</mark>) (Earth-2149) (Cameo) Spider-Man (<mark>Peter Parker</mark>) (Earth-2149) (Cameo) Hulk (Bruce Banner) (Earth-2149) (Cameo) Alex Kropinak (Cameo) Locations: Earth-TRN416 Earth (Destruction) New York City Manhattan Avengers Tower Earth-811 (Cameo) Earth-928 (Cameo) Earth-2149 (Cameo) Earth-1218 (Cameo) Big Butt Universe (Mentioned) Itens: Hunger Virus (Cameo) Bleeding Edge Armor Black Widow's Gauntlets Synopsis for \"Holiday Special with Iron Man & Deadpool\" Synopsis not yet written. Notes Watch the full episode here. Trivia No trivia. See Also Discuss \"Holiday Special with Iron Man & Deadpool\" on the forums Gallery for the Marvel Super Heroes: What The--?! series Cast Character Actor Recommended Media None. Links and References None. Footnotes Retrieved from \"http: //marvel.wikia.com/wiki/Marvel_Super_Heroes: _What_The--% 3F! _Season_1_29? oldid=4376977\" Categories: Episodes 2013, December Modern-Age Marvel Super Heroes: What The--?! Season 1 Alex Kropinak/Director Marly Halpern-Graser/Writer Ben Morse/Writer Todd Casey/Writer Anthony Stark (Earth-TRN416) / Appearances Avengers (Earth-TRN416) / Appearances <mark>Steven Rogers</mark> (Earth-TRN416) / Appearances Bruce Banner (Earth-TRN416) / Appearances Clinton Barton (Earth-TRN416) / Appearances T'Challa (Earth-TRN416) / Appearances Natalia Romanova (Earth-TRN416) / Appearances Thor Odinson (Earth-TRN416) / Appearances <mark>Simon Williams</mark> (Earth-TRN416) / Appearances Wade Wilson (Earth-TRN416) / Appearances Henry Pym (Earth-TRN416) / Appearances Deviant Skrulls/Appearances Fin Fang Foom (Earth-TRN416) / Mentions Guardians of the Galaxy (Earth-TRN416) / Mentions Sleipnir (Earth-TRN416) / Mentions <mark>James Rhodes</mark> (Earth-TRN416) / Minor Appearances Howard Stark (Earth-TRN416) / Appearances <mark>James</mark> Howlett (Earth-811) / Appearances Sentinels/Appearances Miguel O'Hara (Earth-928) / Appearances Zombies (Earth-2149) / Appearances <mark>Steven Rogers</mark> (Earth-2149) / Appearances <mark>Peter Parker</mark> (Earth-2149) / Appearances Bruce Banner (Earth-2149) / Appearances Earth-TRN416 / Appearances Earth/Appearances New York City/Appearances Manhattan/Appearances Stark Tower (Columbus Circle, Original) / Appearances Earth-811 / Appearances Earth-928 / Appearances Earth-2149 / Appearances Earth-1218 / Appearances Hunger Virus/Appearances Iron Man Armor Model 37/Appearances Black Widow's Gauntlets/Appearances Synopsis Needed Templated Articles", "articleID": "2018022702_00215915_W", "names": {"James Rhodes": ["Q2012356", "Q42367696", "Q6142033"], "Peter Parker": ["Q19596717", "Q21165177", "Q51587673", "Q56513979", "Q7176298"], "Simon Williams": ["Q15647498", "Q17020826", "Q4470100", "Q57901554", "Q58040063", "Q6242950", "Q7520052", "Q7520053", "Q7520054", "Q7520056", "Q7520060"], "Steve Rogers": ["Q24006357", "Q3499089", "Q3973387", "Q7613788"], "Steven Rogers": ["Q15437892", "Q50709434"]}}, {"date": "2018-02-28", "url": "http://montrealgazette.com/opinion/opinion-chess-tips-for-english-speaking-quebecers", "content": "5 / 5 Opinion: Chess tips for English-speaking Quebecers Yes, call out Quebec Liberals when we fall short, but also shine a light on our opponents, MNA David Birnbaum says. David Birnbaum, Special to Montreal Gazette Published on: February 28, 2018 | Last Updated: February 28, 2018 2:50 PM EST The next Quebec election is expected Oct. 1. \"I join the premier, Minister Kathleen Weil and all of my caucus colleagues in hoping that English-speaking Quebecers will engage fully in the upcoming campaign, with questions, suggestions and criticism of all of the parties that wish to form the next government,\" Liberal MNA David Birnbaum writes. <mark>Graham Hughes</mark> / THE CANADIAN PRESS Share Adjust Comment Print Chess anyone? Robert Libman (\"Anglos should seize opportunity to be heard,\" Opinion, Feb. 27) suggests that English-speaking Quebecers \"play the strategic chess game and be a factor in the run-up to the election .\" I could not agree more. I have spent most of my professional life advocating on behalf of those one million Quebecers who are English-speaking, and I continue to do so in my current roles. I've known and worked with Robert Libman over the years, and absolutely subscribe to the importance he places on community mobilization. However, I do not share his often-expressed view that English-speaking Quebecers have been too apathetic and passive. Nor do I buy into his description of us as \"anglophones,\" a somewhat pejorative term that leaves out thousands of English-speaking Quebecers from cultural communities who view that tired term as exclusive of them. As Premier Philippe Couillard has insisted and demonstrated, we are all Quebecers, point final. That said, I join the premier, Minister Kathleen Weil and all of my caucus colleagues in hoping that English-speaking Quebecers will engage fully in the upcoming campaign, with questions, suggestions and criticism of all of the parties that wish to form the next government. They should properly call for results from our ground-breaking creation of a designated bureaucracy and cabinet post for relations with the English-speaking community across Quebec. They should be expecting renewed access plans for the delivery of health and social services in English, progress on French second-language instruction, job support for young English-speaking entrepreneurs and better access to the civil service and government appointments. On those questions and others, they will want to shine a light not only on us, but on all of our opponents as well. Are they comfortable with Coalition Avenir Québec Leader François Legault's summary dismissal of our new Secretariat responsible to the English-speaking community? His plan to limit immigration and to institute obligatory language tests for newcomers? His plan to scrap linguistic and universally elected school boards? His vague and fuzzy conversion to the Canadian federation? His distaste, expressed and on the record in the National Assembly, at the thought of a judge wearing a kippa? Are English-speaking Quebecers actually ready to consider the Parti Québécois and Leader Jean-François Lisée, whose short stint as a minister included nominal responsibility for us \"anglophones\" ? His single evident accomplishment in that role was to free up 20 grand for a song called Our Home. Are they prepared to support a party that promises to talk separation only on every second Tuesday? Québec solidaire unabashedly promotes separation. Has anybody ever seen the slightest credible budget plan to support their utopian list of promises? Or, will English-speaking Quebecers carefully examine our government's record and its vision for a modern, prosperous Quebec? Will they look at a recent Liberal Party resolution to offer free French second-language instruction to the English-speaking adult population? Action plans on seniors, culture and infrastructure that will include specific measures aimed at our community? An approach on immigration, diversity and French-language promotion that is inclusive and forward-looking? A long-standing conviction and record predicated on English-speaking Quebecers as allies rather than adversaries? And, are an impending fifth balanced budget, 250,000 new jobs, a level of economic growth that is the envy of the rest of Canada not English-speaking issues as well? Yes, we can do better, and we count on the English-speaking community to call us out when we don't. We invite the community to exercise that same vigilance in evaluating our opponents. That should make for a fair game of chess, and may our community come out the winner. David Birnbaum is the member of the National Assembly for D’Arcy-McGee, parliamentary assistant to the ministers of Education and Higher Education and chair of the Montreal Caucus of the Liberal government.", "articleID": "2018022820_00026186_W", "names": {"Graham Hughes": ["Q18705278", "Q5592926"]}}, {"date": "2018-03-01", "url": "https://www.bostonglobe.com/news/world/2018/03/01/ambassador-mexico-will-resign-soon-amid-tense-relations-under-trump/OkKhfA5fh5l2s2qLD9TgQP/story.html", "content": "MEXICO CITY--The US ambassador to Mexico plans to resign in May, according to a memo circulated Thursday to embassy staff, the latest in a string of senior diplomatic departures from the region--and more broadly from the State Department. The ambassador, Roberta S. Jacobson, 57, served just under two years in the post, after her arrival was delayed by a prolonged confirmation process. Analysts say her departure will be deeply felt by both US and Mexican officials: She was one of the most experienced Latin America experts in the State Department, having spent most of her 31 years there, focusing on the region. \"I have come to the difficult decision that it is the right time to move on to new challenges and adventures,\" Jacobson wrote. \"This decision is all the more difficult because of my profound belief in the importance of the US-Mexico relationship and knowledge that it is at a crucial moment .\" Advertisement The Trump administration has selected a nominee to replace Jacobson but has not released the name, according to a US official with knowledge of the decision who was not authorized to comment publicly and who discussed the matter on the condition of anonymity. Get Today's Headlines in your inbox: The day's top stories delivered every morning. Sign Up Thank you for signing up! Sign up for more newsletters here Jacobson leaves at a tense moment in relations between Mexico and the United States, with President Trump vowing to have Mexico pay to build a wall between the countries, pledging to tear up the North American Free Trade Agreement, and promising to deport millions of Mexicans who crossed the border illegally. There was also a testy phone call between Trump and President Enrique Peña Nieto of Mexico that derailed tentative plans for the two leaders to meet after Trump refused to drop his demand that Mexico fund the border wall. For Jacobson, the ambassadorial post was the culmination of a career largely centered in Washington, where she was most recently the assistant secretary for Western Hemisphere affairs. As a member of the State Department's Civil Service--as opposed to the foreign service, which typically fills the ranks of diplomats--it was highly unusual for Jacobson to have ascended to the top slot in Mexico. But Jacobson's supporters say her extensive experience and connections in the country were crucial assets for Washington at a time of strain between the two neighbors, which have closely intertwined economies. Advertisement Former President Barack Obama named Jacobson to the post in 2015, but a bitter partisan dispute in Congress meant nearly 11 months elapsed before she was confirmed. After she arrived in Mexico City, the honeymoon period did not last long. Trump's election abruptly changed the generally warm relations that the United States had developed with Mexico over 25 years--ones that Jacobson had helped foster. Jacobson was left working with her Mexican counterparts to assuage growing concern--and anger--about the new president's tough talk. At the same time, diplomacy on Mexico was being routed through the White House, via the president's son-in-law, Jared Kushner, which left Jacobson with less authority. Officials in Mexico, as well as former colleagues, lamented her departure, calling it the latest blow to strained relations. \"No career official has more consummately understood US-Mexico relations,\" said <mark>Carlos Pascual</mark>, a former US ambassador to Mexico and Ukraine. \"She grounded American policy in the belief that, as neighbors, the US and Mexico will gain most from using the vast resources of both countries to confront shared problems together .\" Advertisement Jacobson will be leaving a State Department that has seen an exodus of foreign service officers. Among those leaving are several high-ranking officials with deep experience in Latin America, including Thomas A. Shannon Jr., the third-highest-ranking official in the State Department. Shannon, the undersecretary of state for political affairs who previously served as an ambassador to Brazil, Guatemala, and Venezuela, announced his retirement last month.", "articleID": "2018030123_00123107_W", "names": {"Carlos Pascual": ["Q5042474", "Q5042478"]}}]