[{"date": "2018-03-02", "url": "https://archinect.com/news/article/150052507/christopher-hawthorne-s-frank-lloyd-wright-documentary-that-far-corner-frank-lloyd-wright-in-los-angeles-to-air-next-week", "content": "Christopher Hawthorne's <mark>Frank Lloyd</mark> Wright documentary \"That Far Corner: <mark>Frank Lloyd</mark> Wright in Los Angeles\" to air next week Follow Travis LaBella, director of photography for \"That Far Corner,\" at <mark>Frank Lloyd</mark> Wright's Ennis House in Los Feliz. Image: Jacqueline Reyno / KCET. Why focus on Wright, American architecture's equivalent of Abraham Lincoln, the giant who casts a shadow over his field big enough to blot out smaller and underrepresented figures? [...] Because the architect's brilliant if forbidding Southern California houses, the most important of which were designed in a burst of creative energy during the first few months of 1923, remain mysterious, their meaning and inspiration as opaque as their heavy, richly patterned concrete-block facades .--latimes.com Christopher Hawthorne's documentary, \"That Far Corner: <mark>Frank Lloyd</mark> Wright in Los Angeles\" , focuses on aspects of the infamous architect's work which remain enigmatic. Filming inside eight Wright buildings, the project interviews around 20 people to present new insights around these mysterious works. Hawthorne explains, \"My overarching goal was to bring some new, sustained attention to a group of houses that have lingered too long, given their importance to the American architectural canon, in the relative shadows .\" The title \"That Far Corner\" originates from a phrase Wright used to describe Southern California in his autobiography. As part of a new ARTBOUND season, the documentary airs next Tuesday March 6, at 9 p.m. ET/PT on KCET-TV. The episode will also stream online at KCET, as well as on Amazon, YouTube, Roku, and Apple TV following its broadcast. Tune in and decide what you make of Hawthorne's theory. As a bonus, several of the interviews occur inside residential designs by Rudolph Schindler, <mark>Charles Moore</mark> and <mark>William Turnbull</mark>, and Richard Neutra. Similar articles on Archinect that may interest you ...", "articleID": "2018030200_00257560_W", "names": {"Charles Moore": ["Q15444732", "Q1902544", "Q21068908", "Q425752", "Q5079370", "Q5081057"], "Frank Lloyd": ["Q28777471", "Q895500"], "William Turnbull": ["Q325274", "Q41968214"]}}, {"date": "2018-03-02", "url": "http://abc7news.com/news/manhunt-for-student-accused-of-shooting-parents-on-campus/3164568/", "content": "BREAKING NEWS 12-year-old San Jose girl arrested for making threats against her school Full Story Email share share tweet email WEATHER ALERT Winter Storm Warning Full Story WEATHER ALERT Winter Weather Advisory Full Story WEATHER ALERT High Surf Advisory Full Story LIVE VIDEO Track the weather on Live Doppler 7 Watch Now Manhunt for student accused of shooting parents on campus Email share share tweet email ABCNews EMILY SHAPIRO Friday, March 02, 2018 03:33 PM A manhunt is underway for a 19-year-old Central Michigan University student whom officials accused of fatally shooting his mother and father on campus. More than 100 police officers are searching the Mount Pleasant area for <mark>James</mark> <mark>Eric Davis</mark>, whom authorities describe as armed and dangerous, after he allegedly shot his mother and father, an Illinois police officer. Bellwood Police Officer <mark>James Davis</mark> Sr. and his wife, Diva Jennen <mark>Davis</mark>, were the victims, according to the university. No students, faculty or staff were injured in the incident at Campbell Hall, a dorm building, according to the school. University police said the suspect was caught on camera fleeing the area. The Mount Pleasant Police Department is asking for the community's help to find him. A police department had contact with the suspect Thursday night, and at some point in the night, he was taken to a hospital, university police said. Debra Williams, the mother of <mark>James</mark> <mark>Eric Davis</mark>' roommate, told ABC affiliate Toledo, Ohio, station WTVG that she was overcome with panic after her son texted her Friday morning, saying that he thinks his \"roommate just shot his mom .\" The campus was on lockdown this morning and students posted on social media images of their barricaded dorm room doors and video of the school's alert message. All planned campus events have been canceled until further notice, as well as scheduled Saturday classes. Michigan Gov. Rick Snyder said, \"The priority right now is the safety of those still on campus .\" Related Topics: abc news national Email share share tweet email (Copyright © 2018 ABC News Internet Ventures .) Top Stories Officials: Missing snowboarder found dead at Squaw Valley Ski Resort Dangerous driving conditions amid winter storm warning in Lake Tahoe Flu activity decreasing in California, nationwide New sexual battery lawsuit filed in SJ against former Olympics doctor Police investigate officer-involved shooting at Santa Rosa armored car facility Track the rain on Live Doppler 7 Evangelist <mark>Billy Graham</mark> honored with funeral in North Carolina Instant Pot recalls multicooker model due to overheating, melting Show More 2 fatally shot at Central Michigan University, suspect at large SJPD ID 12-year-old as sender of threatening tweet against schools Teen first diagnosed with flu finds out it's cancer Howling winds, saturated soil causes trees to topple in Bay Area Driver released from jail after crash left mom, baby dead More News Photos Meet the stars where you live PHOTOS: Time's Up hops the pond to BAFTAs red carpet PHOTOS: Florida school shooting aftermath Man landed helicopter at SAS to impress woman, Feds say More Photos", "articleID": "2018030223_00154796_W", "names": {"Billy Graham": ["Q213550", "Q4912624", "Q863115"], "Eric Davis": ["Q12654077", "Q2943174", "Q3026100", "Q5386357"], "James Davis": ["Q1651845", "Q21034426", "Q21973653", "Q43295578", "Q6132407", "Q6132409", "Q6132421"]}}, {"date": "2018-03-04", "url": "http://www.taipeitimes.com/News/sport/archives/2018/03/04/2003688648", "content": "T20 leaves sport facing testing times AFP, LONDON \"In this ultra-modern age counter attractions have multiplied many times since my youthful days,\" a former England batsman wrote, as he questioned whether teenagers had the time to \"devote to cricket .\" That the former international was Herbert Sutcliffe and he was writing in a pamphlet following England's defeat in the 1950-1951 Ashes series. It shows that worrying about the future of cricket, and English cricket in particular, is nothing new. However, whereas Sutcliffe was concerned by ice skating and greyhound racing taking people away from cricket, the worry now is about how one type of cricket--Twenty20 (T20) franchise leagues--could spell the end of another in five-day Tests. The recent decisions of England internationals Adil Rashid and Alex Hales to sign \"white-ball\" only county contracts--a red ball is used in traditional first-class matches--this season, thereby opting out of Test contention, heightened these concerns. Rashid and Hales have not played a Test since 2016, but the worry for some is that, without a major alteration to cricket's congested schedule and a change in spectator habits--Tests outside of England and Australia often draw paltry crowds--their example might be followed by that of more high-profile cricketers. Jonny Bairstow, a Yorkshire and England teammate of Rashid, is alive to the danger, although the wicketkeeper remains committed to continuing his Test career. \"If we're not careful, there are going to be more and more people [giving up red-ball cricket],\" said Bairstow, who is on tour with England in New Zealand. \"You've got lucrative tournaments...[to] go off for five weeks and earn a heck of a lot of money...[with] the strain and stress on the body of bowling [only] four overs compared to 24 in a day in Test cricket,\" he said. Bairstow's thoughts were echoed by Test colleague <mark>James Anderson</mark>, with England's all-time leading Test bowler adding: \"I just hope and pray there is enough love for Test cricket out there, not just the players that are playing at the moment, but players coming through still having the ambition and drive to play Test cricket in the future .\" Bairstow and <mark>Anderson</mark> grew up in an environment where the most reliable way for cricketers to maximize their income was to become an established Test player, as this would lead to a larger wage packet and enhanced opportunities for sponsorship deals. To gain Test selection, players would have to take part in domestic first-class competitions such as England's County Championship or Australia's Sheffield Shield. However, the advent of the Indian Premier League (IPL) and other T20 franchise events has created an environment where it is now possible to make major money, in cricket terms, without playing Tests. For example, England all-rounder Ben Stokes was bought for ￡ 1.37 million (US $1.89 million) by the Rajasthan Royals during January's IPL auction. By offering specialist \"white-ball,\" as well as Test, central contracts in a bid to improve England's woeful record at major global limited-overs tournaments, the England and Wales Cricket Board might have inadvertently made it easier for players to turn their backs on the first-class game. \"You always want your best players playing as much high-quality cricket as you can,\" England selector <mark>Angus Fraser</mark> said on Friday.", "articleID": "2018030316_00247880_W", "names": {"Angus Fraser": ["Q19325047", "Q4764116", "Q4764119"], "James Anderson": ["Q1398542", "Q1679949", "Q21516191", "Q2419972", "Q27887229", "Q27887279", "Q30066238", "Q43395084", "Q43912040", "Q5652449", "Q58385467", "Q6128699", "Q6128708", "Q6128711", "Q654375"]}}, {"date": "2018-03-03", "url": "http://indiatoday.intoday.in/pti-feed/story/bjd-ridicules-shah-for-statement-on-winning-odisha-1181353-2018-03-03", "content": "READ LATER BJD ridicules <mark>Shah</mark> for statement on winning Odisha March 3, 2018 UPDATED 21:25 IST March 3, 2018 UPDATED 21:25 IST READ LATER Bhubaneswar, Mar 3 (PTI) BJD leaders today ridiculed BJP president <mark>Amit</mark> Shahs statement and claimed that the saffron partys \"dream\" of forming the government Odisha will never be fulfilled even though it has won in Tripura and other north eastern states. Patro was reacting to Shahs stateme Bhubaneswar, Mar 3 (PTI) BJD leaders today ridiculed BJP president <mark>Amit</mark> Shahs statement and claimed that the saffron partys \"dream\" of forming the government Odisha will never be fulfilled even though it has won in Tripura and other north eastern states. Patro was reacting to Shahs statement in Delhi that BJPs golden period will start when it forms government in Odisha, West Bengal and Kerala. Shahs statement has not gone down well with the BJD leaders and ministers who are celebrating defeat of BJP in the recently concluded by-poll in Bijepur assembly seat .? <mark>Amit Shah</mark> had confidently told that his party will win the Bijepur by-elections, but it did not happen. Therefore, there is no chance of BJP coming to power in 2019 assembly elections in Odisha, \"BJD Vice-president and minister S N Patro said. <mark>Shah</mark> had in September last year set an ambitious Mission 120 of winning at least 120 of the 147 assembly seats in Odisha after BJP registered unexpected success in the rural polls .\" Only Naveen Patnaik is popular in Odisha. Nobody knows <mark>Shah</mark> in Odisha. The BJP is passing through a silver period but it will not reach its golden era. His (<mark>Shah</mark>) desire of BJP forming government in Odisha will never be fulfilled, \"Odishas Panchayati Raj Minister Pradeep Maharathy told reporters. Maharathy, a veteran BJD leader in coastal Puri district, had announced before the results of the Bijepur by-polls were announced that he would resign from the ministry if BJP won the seat. BJD candidate Rita Sahu won the Bijepur seat over a margin of 41,932 votes. PTI AAM KK KK This is unedited, unformatted feed from the Press Trust of India wire. Do You Like This Story? 0 Awesome! Now share the story 0 Too bad. Tell us what you didn't like in the comments Posted by site admin Suggested Stories Recommended READ THIS After Sridevi's death, Congress says UPA gave her Padma Shri. Twitter fumes. INC deletes post Let Chef Kunal Kapur show you how to do Holi right Who's that? Jayalalithaa statue at AIADMK headquarters looks nothing like Amma What exactly happened on the night Sridevi died? Watch Right Now Exclusive: BJP's frontrunner for Tripura CM Biplab Kumar Deb on election results Nagaland election results: NPF supporters raining down money in Dimapur Exclusive: Kiren Rijiju confident of remaining in power in Nagaland Tripura result is a historic verdict, says Ram Madhav on BJP's victory Battleground Northeast: Cliffhanger in Tripura, CPM-BJP neck and neck Top Takes Exclusive: BJP's frontrunner for Tripura CM Biplab Kumar Deb on election results Tripura result is a historic verdict, says Ram Madhav on BJP's victory Islamabad Club snubs Indian envoy Ajay Bisaria, puts on hold his membership application", "articleID": "2018030318_00017379_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}}, {"date": "2018-03-05", "url": "http://www.cityam.com/281696/focus-victoria-gbp4bn-investment-has-completely-changed", "content": "Homes and interiors Monday 5 March 2018 5:34 pm Focus On Victoria: A £ 4bn investment has completely changed the area from dowdy offices to shiny penthouses and hip restaurants Share Melissa York I edit our weekly residential section Hot Property, and I deputy edit Living magazine, recently awarded Property Supplement of the Year at the 2017 Property Press Awards. I also write features for Bespoke, our monthly luxury magazine, and I write for the Life & Style section, encompassing arts reviews, travel and food. I won Consumer Magazine Property Journalist of the Year and Lifestyle & Interiors Journalist of the Year at the Property Press Awards 2017. Follow Melissa Nova, Victoria If the Queen's getting a £ 369m refurbishment of Buckingham Palace, it seems only fair that the neighbourhood surrounding it should get a polish, too. £ 4bn should just about cover it, and that's how much has been invested in the area by developer Land Securities over the last five years. Around £ 700m of that has gone on revamping the train station, a major terminus that's also set to be a hub for Crossrail 2, if current proposals go ahead. Traditionally, the areas around big rail stations haven't made desirable places to live and Victoria was no exception. Tall, grey, faceless office blocks characterised much of its property stock for decades and the retail offering was pretty poor, making it one of the cheapest spots in central London. Now, new homes make up two thirds of all sales in the area, with £ 262m changing hands in the resi market in 2017, more than twice the amount on the year before, according to figures compiled by David Fell, research analyst at Hamptons International. He nods to Nova, where penthouses go for £ 8m, and \"facadism\" , described as \"schemes that keep the front of the building while knocking down everything behind. We have seen a big influx of prime tenants ranging from CEOs to Middle Eastern royalty Developers are increasing using 19th century grandeur to conceal living space designed for the 21st century .\" Good transport links--it's on the Victoria and Circle lines in Zone One, as well as a being a gateway to the south of England and Gatwick Aiport--are only going to get better with the refurbishment of Victoria coach station, too. This makes it the perfect place for a London bolthole, says <mark>Tom</mark> Bond from UK Sotheby's International Realty, who is seeing \"a significant number of buyers from the commuter hotspots including Surrey and Berkshire, who are seeing a convenient second home in the capital .\" Hamilton at the Victoria Palace Theatre The influx of new homes and better transport has also made it a popular place for premium lets, according to Jo Eccles from SPPG. \"We have seen a big influx of prime tenants ranging from CEOs to Middle Eastern royalty. They or their relocation agents are specifically targeting Victoria as a location and the most popular buildings are 44 Victoria Street and Nova, with steady demand for rental properties in the £ 1,000 to £ 3,500 a week range .\" With new businesses moving in--Deutsche Bank, <mark>Tom Ford</mark>, Google and the UK's new National Cyber Security Centre--as well as new residents, top names in retail and hospitality have been lured to the area, from Molten Brown to Michelin-starred chef Jason Atherton's latest restaurant Hai Cenato. \"People no longer walk through Victoria to get to their destination, but choose to stay to enjoy the exciting array of new restaurants and shops, which is drawing a young crowd,\" says Martin Bikhit from Kay & Co.. But traditionalists will still find secluded enclaves of 18th century terraced housing tucked behind Victoria Street, and according to Kirsty Sugden of Dexters Westminster, \"surrounding Westminster Cathedral are a host of red-brick mansion blocks dating from the Victorian and Edwardian period .\" Mostly, Victoria is known for its diverse housing stock and bright future. \"You may find a one bedroom flat for £ 550,000 around the corner from a £ 20m townhouse,\" Sugden adds. Boisdale Belgravia Area highlights One of London's most highly-anticipated musicals, Hamilton, took up residence in the refurbished Victoria Palace Theatre last year and it's the hottest ticket in town. A view of Westminster Cathedral, the mother Catholic Church for England and Wales with stripped back Byzantine-style architecture, is often a perk of buying property in Victoria. A Royal Park, St James's, is right on your doorstep for picturesque jogs and the changing of the guard. For robust Scottish fare and a fine cigar, Boisdale of Belgravia is only a few paces away from Victoria Station and has an impressive selection of whisky on offer, too. Cardinal Place is one of many new shopping havens on Victoria Street, but has a particularly good food offering, with a food market every Thursday lunchtime. Full to the brim, waddle over to the Curzon Victoria on the same street to take in a film in one of its comfy sofa seats. Then check out the new restaurant quarter around the Nova building. Area guide", "articleID": "2018030517_00351858_W", "names": {"Tom Ford": ["Q19873307", "Q240015", "Q318149", "Q7815834"]}}]