[{"date": "2018-03-06", "url": "http://capegazette.villagesoup.com/article/derek-delivers-domino’s-hall-fame-athlete-high-character/152284", "content": "<mark>Derek</mark> delivers like Domino's - a hall of fame athlete of high character Dave Frederick March 6, 2018 <mark>Derek Savage</mark> will be inducted into Goldey-Beacom Athletics Hall of Fame this May. You can find <mark>Derek</mark> between The Factory and Milford Boys & Girls Club, working with youth programs. DAVE FREDERICK PHOTO Ed Bordley with his guide dog. SUBMITTED PHOTO <mark>Jimmy Allen</mark> with a ball signed by the 1975 starting five. DAVE FREDERICK PHOTO Luke Oliphant is an outfielder at UMass. SOURCE: UMASS ATHLETICS Izzy Cryne is a freshman starting goalie for the Mercer University lacrosse team. DAVE FREDERICK PHOTO <mark>Derek</mark> delivers like Domino's - <mark>Derek Savage</mark>, the Doctor of Dunk when he played for Cape, will be inducted into the Goldey-Beacom College Athletic Hall of Fame April 22 during a ceremony at the Deerfield Golf Club in Newark. According to the school website, \"<mark>Savage</mark> was one of the outstanding players for the Lightning's men's basketball team during a very special era .\" He was named first-team All-Central Atlantic Collegiate Conference and to the CACC All-Tournament Team in 2008, when he helped Goldey-Beacom reach the conference quarterfinals. <mark>Savage</mark> also was picked second-team all-league in 2007, when he helped the squad to the Eastern Collegiate Athletic Conference title. <mark>Savage</mark> graduated first in school history with 1,333 points, 772 rebounds, 293 assists, 219 free throws, 96 blocks and 236 steals. <mark>Derek</mark> is the youngest of three boys. His older brothers are Mike and Elliott. They are all super nice young men and first cousins to the <mark>Savage</mark> family that includes Willie, Taiwan, Princess, Tranesha, Chimire and Janelle. Like his cousins, <mark>Derek</mark> was a track star, excelling in the high jump and triple jump. Ed Bordley - A blind wrestler from Caesar Rodney won a state championship at 167 pounds his junior year in 1975. I saw Bordley wrestle a novice Cape recruit in 1976, whom Bordley was wearing out, and so the kid escaped then hid and would not re-engage. Pete Basile, who now runs in several local road races, was Bordley's high school wrestling coach. The ref awarded a tech fall. Bordley then wrestled at Harvard. Neil deGrasse Tyson, the future astrophysicist, was a mat partner. Bordley later graduated from Harvard Law School. He spent the next 30 years working for the Justice Department as a lawyer. Ed Bordley died Dec. 16 from a rare cancer of the thymus at the age of 61. I remember him at a Lower Gridiron Club banquet emceed by Joe Purzycki, former Caesar Rodney football coach and first white man to be named head football coach at a historically black college, Delaware State 1981-84 and James Madison 1985-90. Back to the banquet, Bordley worked for Attorney General Janet Reno (1993-2001), so of course coach Purzycki had a few Reno jokes. When Bordley got to the podium, he said, \"Coach I don't appreciate you making fun of my boss, Janet Reno,\" and Coach Joe quickly quipped, \"I'm sure she looks good to you .\" And that was that. Two guys and friends from the world of sports jousting at the head table. Jokes scripted in advance are like batting practice home runs--so what?--take the changeup deep in real-time game action, then come talk to me. Crime Dog - Bruce Barrett, Cape Class of 1979, who bears a striking resemblance to former Major League Baseball player Fred \"Crime Dog\" McGriff, is one of the best three-sport athletes in the 49-year history of the school district. Bruce will be inducted into the Delaware Afro-American Sports Hall of Fame April 21 at the Modern Maturity Center in Dover. Bruce is going in as a football player. He is part of the Cape/University of New Haven connection. Bruce had a crazy good college career and was a real pro prospect, but was hobbled by injury. He also played basketball and ran track at Cape. I was his track coach and have a ton of funny stories to tell but nowhere to sell them. Bruce lives in Texas, works in the oil fields, drives a big old truck and looks like he can still play. Delaware Sports Hall of Fame - Contemporary candidates for 2018 include downstate basketball guys <mark>Jimmy Allen</mark> and Charles Rayne, and Heidi Pearce, former women's lacrosse coach at St. Andrew's who is now the head coach at Washington College. Eddie Pettyjohn, a native of Milton and noted race car driver, is nominated in the veterans category. Snippets - Luke Oliphant (Sussex Tech), a freshman on the UMass baseball team, started in the outfield for the Minutemen in the season opener March 2 versus Pitt in Kissimmee, Fla.. Luke scored the tying run in the top of the ninth, after walking and moving to third on a pair of groundouts. He scored on a passed ball, tying the game at 2-2. But the Panthers scored in the bottom of the ninth to win the game. Good job, Luke. Starting for UMass as a freshman is no joke. I w atched Mercer University beat Gardner Webb 16-6 on the Big South Network March 2. Freshman Izzy Cryne (Cape) had five saves and earned her first college lacrosse win. Mercer followed that up with a win over Davidson. Izzy looked good, very quick, locked in and clearing passes on the money. Smyrna is the only downstate boys' team still alive in the semifinal round of the DIAA state tournament. St. Thomas More is still alive on the girls' side. Go on now, git! Sports Editor Emeritus", "articleID": "2018030617_00294835_W", "names": {"Derek Savage": ["Q24592005", "Q5262332"], "Jimmy Allen": ["Q30122330", "Q5999007"]}}, {"date": "2018-03-06", "url": "https://myjournalcourier.com/news/article/The-Latest-Schumer-fires-back-at-Trump-on-12732755.php", "content": "https: //www.myjournalcourier.com/news/article/The-Latest-Schumer-fires-back-at-Trump-on-12732755.php The Latest: Schumer fires back at Trump on traffic project Updated 3:55 pm, Tuesday, March 6, 2018 Photo: <mark>Pablo Martinez</mark> Monsivais, AP Image 1 of / 2 Caption Close Image 1 of 2 Senate Minority Leader Chuck Schumer of N.Y., right, speaks to reporters following weekly policy luncheons to answer questions on Capitol Hill in Washington, Tuesday, March 6, 2018. Watching is Sen. Ron Wyden, D-Ore ., left. The Senate moves closer to passing legislation to roll back some of the safeguards Congress put in place to prevent a repeat of the 2008 financial crisis. less Senate Minority Leader Chuck Schumer of N.Y., right, speaks to reporters following weekly policy luncheons to answer questions on Capitol Hill in Washington, Tuesday, March 6, 2018. Watching is Sen. Ron Wyden,...more Photo: <mark>Pablo Martinez</mark> Monsivais, AP Image 2 of 2 Transportation Secretary Elaine Chao testifies before the House Transportation and Infrastructure Committee on President Donald Trump's trillion-dollar-plus plan to boost infrastructure, on Capitol Hill in Washington, Tuesday, March 6, 2018. less Transportation Secretary Elaine Chao testifies before the House Transportation and Infrastructure Committee on President Donald Trump's trillion-dollar-plus plan to boost infrastructure, on Capitol Hill in...more Photo: <mark>J. Scott</mark> Applewhite, AP The Latest: Schumer fires back at Trump on traffic project 1 / 2 Back to Gallery WASHINGTON (AP)--The Latest on a dispute over a New York railway tunnel project (all times local): 4:45 p.m. Top Senate Democrat Chuck Schumer is firing back at President Trump's effort to block funding for a new Hudson River rail tunnel. Schumer tells The Associated Press that \"I don't think anyone should play politics with a project like this, plain and simple .\" Transportation Secretary Elaine Chao acknowledged to a House panel on Tuesday that Trump wants to kill the multi-billion dollar Gateway Project. She said New York and New Jersey \"need to step up\" and shoulder more of the project's cost. But Schumer says \"the states have really stepped up to the plate. It's the feds who haven't .\" He helped broker an agreement under which the neighboring states would offset half of the project's cost. \"The administration says there is no such agreement and that no application has been filed with the Department of Transportation. ___ 2:45 p.m. Secretary of Transportation Elaine Chao says President Donald Trump asked Speaker <mark>Paul Ryan</mark> to block funding for a multi-billion dollar railway tunnel project. The project is a top priority of the Senate's top Democrat and chief Trump antagonist, Chuck Schumer. In contentious exchanges with several lawmakers, Chao told a House committee Tuesday that Trump indeed is intervening to try to kill the project. She said that New York and New Jersey\" have no skin in the game \"and need to pony up more money to help pay for the Gateway Project, which would build a new tunnel under the Hudson River and make other critically sought improvements. The House has approved $900 million for the project. Most Popular 1 Teen injured in Morton Avenue accident 2 Police Beat 3 Morgan fair board announces concert lineup 4 Police Beat 5 Crime watch 6 Police Beat 7 Fire department expands secure box program View Comments © 2018 Hearst Communications, Inc. .", "articleID": "2018030621_00334032_W", "names": {"J. Scott": ["Q54036785", "Q6107076"], "Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2018-03-08", "url": "http://www.bozemandailychronicle.com/news/education/bozeman-schools-to-sell-patterson-road-land-dispose-of-durston/article_362831a8-c2da-5a3d-bdca-24680347f524.html", "content": "Bozeman schools to sell Patterson Road land, dispose of Durston house RACHEL LEATHE / CHRONICLE Map shows the land at Patterson Road and South Third Avenue that the Bozeman School District plans to divide so the north 18 acres can be sold, with the image of an elementary school imposed on the south 12 acres to show scale. Save After talking about it for years, the Bozeman School District has decided to sell off more than half the land it owns on Patterson Road, while keeping the smaller portion for a possible future elementary school. The School Board voted 4-0 this week to sell about 18 acres on Patterson Road and at the same time get rid of an old house on Durston Road, behind Bozeman High School. Both the land and the house were declared to be obsolete or unsuitable for school uses. How much the 18 acres on Patterson Road might be worth won't be known until an appraisal is conducted, Superintendent <mark>Rob Watson</mark> said Tuesday. × Decades ago the school district purchased the 30 acres on Patterson Road, near South Third Avenue, <mark>Watson</mark> said. Thirty acres would be the right size for a middle school, but it's so close to Sacajawea Middle School that it's unlikely that's where a new middle school would ever be located, he said. It's too small for a high school, and too big for an elementary school. So the School Board agreed to subdivide the land, sell the north half and keep the 12 acres on the south for a possible future elementary school. Last year when school officials started talking to voters about the need to acquire land in the fast-growing northwest side of town for new elementary schools, people asked if the district could sell off land it doesn't need, <mark>Watson</mark> said. The reason for acting on the Patterson property now is that a developer has approached district officials and expressed interest in purchasing it. The reason for getting rid of the old house, hidden behind trees, at 1218 Durston Road, is that the plan to build a new football stadium on the Bozeman High campus will require moving some softball fields. \"Were going to need some space at the north end of campus,\" <mark>Watson</mark> said. The house, originally constructed in the 1930s and added onto in 1980, has also been owned by the school district for years. Officials looked into selling the house to someone who might want to move it, but now say it will likely have to be torn down because of its age and construction. The house at one time was rented out and housed Adult Education, but it hasn't been used in six or seven years, <mark>Watson</mark> said. No one objected to disposing of the Patterson land or Durston house. Last month the School Board made a more controversial decision to sell nearly one acre of surplus land, the Emerson Lawn, for $2.2 million. That sale is intended to raise enough money to buy two more suitable elementary school sites, one on Baxter Lane near the new post office and the second in the Woodland Park subdivision near Four Corners. Voters will be asked in May to approve those as school sites. Gail Schontzler can be reached at 406-582-2633 or gails @ dailychronicle.com.", "articleID": "2018030823_00411636_W", "names": {"Rob Watson": ["Q18720309", "Q7340641"]}}, {"date": "2018-03-10", "url": "http://www.montrosepress.com/national/sports/without-anthony-davis-pelicans-winning-streak-ends-at-in-/article_456614df-344d-5c6d-8638-3ee0b9abcd74.html", "content": "Facebook Twitter Email Washington Wizards forward <mark>Mike Scott</mark> (30) shoots over New Orleans Pelicans forward <mark>Cheick Diallo</mark> (13) and New Orleans Pelicans forward Darius Miller (21) in the first half of an NBA basketball game in the Smoothie King Center in New Orleans, La.. Friday, March 9, 2018. Advocate staff photo by MATTHEW HINTON New Orleans Pelicans guard Jrue Holiday (11) shoots against Washington Wizards forward Chris McCullough (1) in the first half of an NBA basketball game in the Smoothie King Center in New Orleans, La.. Friday, March 9, 2018. Advocate staff photo by MATTHEW HINTON New Orleans Pelicans forward Nikola Mirotic (3) shoots against Washington Wizards forward Otto Porter Jr. (22) in the first half of an NBA basketball game in the Smoothie King Center in New Orleans, La.. Friday, March 9, 2018. Advocate staff photo by MATTHEW HINTON TownNews.com Content Exchange Facebook Twitter Email Print Save There was a noticeable lack of scoring, and eyebrow, in the Smoothie King Center. <mark>Anthony Davis</mark> was sidelined due to a sprained ankle, and the New Orleans Pelicans' 10-game winning streak came crashing alongside of him. <mark>Davis</mark> could only watch from the sidelines as the streak he built was halted with a thud, concluding just a victory shy of the franchise record. Washington took full advantage of the Pelicans' diminished star power, dispatching them 116-97 and sweeping the season series. \"Yeah, it hurts (not having <mark>Davis</mark>),\" Jrue Holiday said. \"But, we have a team full of people who step up to the plate. Tonight, it didn't happen very much. We saw some guys play well, but we just can't always rely on <mark>Anthony</mark>.\" It was the Pelicans' first loss since Feb. 9, and in the month between defeats New Orleans climbed from No. 8 to the coveted No. 4 spot in the bunched up Western Conference standings. While the loss didn't immediately drop the Pelicans from that valuable home-court advantage perch, it did tighten the margin for error down to a half-game. And it underscored the notion that if <mark>Davis</mark> remains out for any length of time, the Pelicans could be more concerned with reaching the playoffs at all than where it's seeded. Without <mark>Davis</mark>, the Pelicans' offense had nowhere to turn when it needed a bucket to stop a run and no one to seal off the paint from a torrent of Wizards dribble drives. Instead, E’Twaun Moore was forced to cover the rangy 6-foot-8 Otto Porter, Jr., who tallied 19 points. And Markieff Morris battered the Pelicans' interior for 17 of his own. In short, the Pelicans had no answers. Their cheat sheet was sitting on the bench in a sweatsuit. Once Washington rattled off a 27-7 run midway through the second quarter, there was little drama remaining for the sold out crowd of 18,147 fans, most of whom headed to the exits with more than six minutes remaining. However, coach Alvin Gentry is hopeful the Pelicans' won't miss <mark>Davis</mark> for long, claiming the All-Star can potentially return for Sunday's 3 p.m. tipoff against the Utah Jazz. \"I don't think it's that big of a deal,\" Gentry said, when asked about the severity of <mark>Davis</mark>' injury. \"I really don't. It's a sprained ankle and it's going to be OK. I'm optimistic about Sunday, yes .\" Friday, however, went off the rails in a hurry. After tallying at least 110 points in each of the 10 consecutive wins, New Orleans couldn't gear up into its fast pace or create their typical shooting space, scoring just 19 in each of the first two quarters. And the premium placed on ball security during the winning streak evaporated under a torrent of sloppy passes. The Pelicans finished the third quarter with an equal number of assists and turnovers (14). \"We just never got into any kind of flow,\" Gentry said. One game after Jrue Holiday and Nikola Mirotic carried the Pelicans' fourth quarter in a win at Sacramento, they were nowhere to be found. Washington swarmed Holiday and Mirotic, running them off of the arc and shading defenses their way whenever some open space appeared. With all of the focus on him, Holiday not only failed to replace some of <mark>Davis</mark>' production but didn't come close to replicating his own. \"It was just one of them games for me,\" Holiday said. \"I just didn't really have it. I'm a little disappointed in myself .\" After a torrid run of averaging more than 25 points per game, Holiday failed to fight off the array of double teams thrown at him and tallied just just four points and two assists, his lowest output since the season opener. \"I mean, it's not easy for him,\" Mirotic said of Holiday. \"All of the games, he's guarding the best player there and we're kind of expecting him to be a leader of the offense too. So I think he might be a little tired today, too, which is normal. And he's guarding (All-Star Bradley) Beal tonight, so it was really a tough matchup .\" It just wasn't our day. \"This article originally ran on theadvocate.com. Love 0 Funny 0 Wow 0 Sad 0 Angry 0 Facebook Twitter Email Print Save Tags Sport Nikola Mirotic Assist <mark>Anthony Davis</mark> Holiday Point Alvin Gentry Winning Streak Jrue Holiday Locations Louisiana Baton Rouge Load comments × Post a comment as Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching", "articleID": "2018031005_00083709_W", "names": {"Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"], "Cheick Diallo": ["Q16269634", "Q21039421"], "Mike Scott": ["Q16216757", "Q1849355", "Q3313545", "Q582252", "Q6848743", "Q6848747", "Q6848748", "Q6848749"]}}, {"date": "2018-03-11", "url": "http://asia.nikkei.com/Japan-Update/Fukushima-ice-wall-yields-limited-benefit-for-its-cost", "content": "March 11, 2018 1:16 am JST Fukushima ice wall yields limited benefit for its cost $322m barrier is less effective than lower-tech measures in fighting contamination Nikkei staff writers Tepco has surrounded the reactors at its Fukushima Daiichi plant with a wall of frozen earth. TOKYO--Tokyo Electric Power Co.. Holdings faces the question of whether the so-called frozen soil wall built to contain contamination at its damaged Fukushima Daiichi nuclear power plant justifies its high cost. The 1.5 km barrier of frozen earth, which cost 34.5 billion yen ($322 million) to build using taxpayer money, is supposed to keep groundwater out of the plant's four reactor buildings. Multiple reactors suffered core meltdowns following the earthquake and tsunami in March 2011. Any water that enters must undergo decontamination, though it is not possible to remove all the radioactive material the water takes up. Tepco, as the utility is widely known, said Thursday that the barrier has reduced the amount of new contaminated groundwater by 95 tons a day. This suggests that the wall accounts for just one-quarter of recent reductions: Around 110 tons of groundwater were contaminated daily in the three months through February, compared to roughly 490 tons daily before the frozen barrier was created. Freezing of earth around the buildings began in March 2016, and was nearly complete last November. The utility has said a variety of external factors make those numbers difficult to compare directly, and it plans to release a more detailed analysis as soon as next week. \"The frozen soil wall is working,\" said <mark>Naohiro Masuda</mark>, chief decommissioning officer for the Fukushima plant. Some of the tanks to store contaminated water are rendered unnecessary, and \"this is huge in monetary terms,\" he said. Others beg to differ. \"It is hard to believe\" the barrier is \"contributing as much as it cost to build,\" said Masashi Kamon, professor emeritus at Kyoto University. Japan's Nuclear Regulation Authority has also raised questions about the barrier's effectiveness relative to its cost. Lower-tech measures also in place to prevent contamination, such as wells that pump water out of the ground surrounding the plant, have proven more effective than the frozen barrier. But Tepco plans to keep the wall in place, at an annual cost of more than 1 billion yen, until the groundwater contamination problem is resolved.", "articleID": "2018031016_00168206_W", "names": {"Naohiro Masuda": ["Q11406928", "Q17230341"]}}]