[{"date": "2018-03-11", "url": "http://www.amny.com/news/nyc-integration-initiative-1.17298087", "content": "City will undertake an analysis of segregation and suggest a plan to address it The effort will culminate with the release of a policy platform in fall 2019. The city will be eliciting feedback on ways to promote integration with community conversations and a survey. Photo Credit: Getty Images / <mark>Spencer Platt</mark> By Sarina Trangle sarina.trangle @ amny.com @ SarinaTrangle Updated March 11, 2018 2:19 PM Share Tweet Share Email The city announced it will kick off a series of conversations this summer about segregation in the city and how it impacts residents' access to opportunities. The conversations will focus on immigrants, people with disabilities, seniors, LGBTQ individuals and all racial and religious communities. The dialogue is part of the city's Where We Live NYC initiative, which aims to satisfy the U.S. Department of Housing and Urban Development's requirement that governments and public housing authorities receiving HUD funding are taking steps to overcome segregation. Under President Donald Trump, HUD has extended the deadline by which funding recipients must complete related analyses, but the city said it will continue operating on the original timeline and release a framework to promote integration in fall 2019. \"Where We Live NYC is an unprecedented opportunity to work with government partners, community organizations, and the general public to take a comprehensive look at the historic and ongoing factors that contribute to long-standing patterns of segregation in our neighborhoods, and discuss what we as a City can do to increase housing choice and access to opportunity for all New Yorkers,\" Maria Torres-Springer, the city's Department of Housing Preservation and Development commissioner, said in a statement. \"I look forward to having meaningful and candid conversations as we work together to make our city stronger, fairer, and more equitable .\" Torres-Springer's department will be working with several city agencies, the New York City Housing Authority and a Fair Housing Stakeholder Group to understand and address how various segregation patterns impact access to jobs, education, public transit and health. Beyond looking at data and analyzing policies, the city will glean insight through conversations with members of communities across the five boroughs, beginning this summer. The city plans to hire a consulting firm and racial justice organization to facilitate these public dialogues. A survey also will inform the initiative, which aims to have specific policy solutions to present in fall 2018 and a final framework with measurable goals to release in fall 2019. NYC, in your inbox.", "articleID": "2018031118_00232910_W", "names": {"Spencer Platt": ["Q3966492", "Q7576159"]}}, {"date": "2018-03-12", "url": "https://geektyrant.com/news/x-men-dark-phoenix-set-photo-shows-us-the-team-in-their-comic-accurate-costumes", "content": "X-MEN: DARK PHOENIX Set Photo Shows us The Team in Their Comic-Accurate Costumes Movie Photos X-Men: Dark Phoenix Marvel about a minute ago by Joey Paur A photo from the set of director Simon Kinberg's X-Men: Dark Phoenix has surfaced online and it gives us a glimpse at the young team of X-Men wearing their comic-accurate X-Men costumes. We saw the characters sporting a version of their X-Men costumes at the end of X-Men: Apocalypse that a lot of fans were happy with, but the new costume designs in Dark Phoenix are even more fan-friendly as they look like they are inspired Frank Quietly and Grant Morrison's New X-Men. A new photo from the set includes Cyclops (Tye Sheridan), Jean Grey (<mark>Sophie Turner</mark>), Quicksilver (Evan Peters), Storm (Alexandra Shipp), Nightcrawler (Kodi Smit-McPhee), Beast (Nicholas Hoult) and Mystique (Jennifer Lawrence). There are a few other characters in the photo wearing orange suits with their backs to us. The film is set in 1992, \"roughly a decade after Apocalypse and finds the X-Men dealing with being heroes. An unfortunate side effect is how that fuels Charles Xavier's (James McAvoy) ego. He starts sending the team on more dangerous missions, including one to space that ends with Grey going to some very dark places .\" What do you think of the new X-Men suit costume designs? X-Men: Dark Phoenix is set to be released in theaters on November 2nd, 2018. Quitley-ass looking X-Men in DARK PHOENIX pic.twitter.com/zpSL1X2sB4--Xavier Files (@ XavierFiles) March 9, 2018 Joey Paur--Co-Founder / Editor of GeekTyrant.com, and if you haven't noticed I write...a lot. Movies are my passion and I live and breathe all things geek. This site is part of my life's work, it's a part of me. I love what I do, and I enjoy sharing everything I can with you when it comes to movies and geekery. In my spare time I travel to the netherworlds to battle demons. @ JoeyPaur | joeypaur @ geektyrant.com Featured Posts on GeekTyrant Thanos Rips a Moon From Space in New Photos For AVENGERS: INFINITY WAR Netflix's LOST IN SPACE Looks Great! Watch The Adventurous Full Trailer Now! Johnny Lawrence Starts Teaching Karate in New Teaser Trailer For COBRA KAI STAR WARS REBELS Producer Dave Filoni Says a New Series Announcement is Coming Soon FOX is Developing a SILVER SURFER Movie With DAREDEVIL Writer Brian K. Vaughn This New \"Pure Imagination\" Trailer For READY PLAYER ONE is Filled with So Much Awesomeness! Back to GT Homepage", "articleID": "2018031209_00054183_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}}, {"date": "2018-03-12", "url": "http://elkodaily.com/sports/college/the-most-annoying-college-sports-traditions/collection_9db11ff7-f6f8-5ee1-8138-9295fb296ef2.html", "content": "Facebook Twitter Email Print Save One school's beloved pastime might annoy the heck out of everyone else. Here are 21 school traditions that other college sports fans find loathsome, obnoxious or just plain dumb. 21. Big heads (San Diego State) San Diego State's rabid cheering section The Show has been credited with coming up with the idea of using oversized cutouts of heads to distract opponents; a group member printed up a big <mark>Michael Jackson</mark> head during the 2002-03 season. Ever since, sports fans across college and pro sports have copied this, going bigger and more bizarre with their \"big head\" signs by choosing random celebrities, fictional characters or even portraying the athletes themselves. Regardless, the signs have become so commonplace that they're more of a distraction to fellow fans trying to watch the game than the players. SD Dirk/Flickr 20. The Tomahawk Chop (Florida State) Florida State does have some unique traditions that earn respect from college football fans, such as the Sod Cemetery, but there's one that rubs other people the wrong way: the \"Tomahawk Chop\" and war chant. Later adopted by the Atlanta Braves and the Kansas City Chiefs, FSU claims to have invented the chant and hand motion, though the university itself isn't proud of it. Former FSU President Dale Lick wrote in a 1993 column for USA Today: \"Some traditions we cannot control .\" The chant itself is droning and incessant while the hand motion is an offensive stereotype. Ruth Peterkin/Dreamstime/TNS 19. Curtain of Distraction (Arizona State) Since it debuted in 2014, the Curtain of Distraction has helped the Sun Devils' student section, the 942 Crew, be mathematically proven as the most distracting student section in college basketball. The curtain remains closed until a rival player winds up to shoot a free throw. It's then pulled back to reveal anything from an Elvis impersonator to a shark attack to Olympian Michael Phelps in his Speedo. It's hysterical to watch--unless you're the team they're playing. Zach Helfand/Los Angeles Times/TNS 18. Calling the hogs (Arkansas) One of the most irritating cheers in college sports is University of Arkansas fans Calling the Hogs. This might be because the tradition of chanting \"wooo pig sooie\" isn't confined to stadiums, but can be heard anywhere fans congregate, from airports to Disney World. Razorback fans love the call so much, it's an additional skill you can download for the Amazon Alexa personal assistant. Dreamstime/TNS 17. Cameron Crazies (Duke) Duke's men's basketball student section earned its nickname by being one of the most intense in college sports. The organized annoying they do of visiting players include insulting chants that are coordinated on cheer sheets, \"hexing\" players who foul out and getting close enough to touch players who are inbounding the ball. Though they've mellowed out a bit in recent years thank to intervention from the university and coach Mike Krzyzewski, they remain one of the most irritating fan bases in college sports, and contribute to why many people love to hate Duke. Robert Willett/Raleigh News & Observer/MCT 16. Couch burning (West Virginia) While not at all an official or university-encouraged activity, couch burning has become a shameful defacto tradition at West Virginia. So much so that the university has produced PSAs to discourage it, and the city of Morgantown, where the school is located, banned outdoor upholstered furniture and upped the penalty for couch burning from a misdemeanor with a fine to a felony with jail time. According to the city manager in 2015, there had been 3,000 street fires in Morgantown in the prior decade. It's no wonder WVU fans are considered some of the worst in college sports. Dreamstime/TNS 15. OH-IO (Ohio State) Congratulations, Ohio State; your fans can spell your four-letter state name. Or you can most of the time. (In the 2015 national championship game, the second \"O\" flag didn't make it onto the field when the team ran out, so the flags spelled \"Ohi .\" ) Fans certainly get plenty of practice since spelling \"Ohio\" seems to be Ohio State's main schtick, from fans chanting it and spelling it with their arms to the marching band spelling it out in \"Script Ohio\" at halftime. Every season. Since 1938. This team has one bit, and it gets seriously annoying. Barbara J. Perenic/Columbus Dispatch/TNS 14. Throwing tortillas (Texas Tech) Plenty of fans have thrown items like cans and trash onto the football field to voice their displeasure at a game's outcome. Northwestern students in the \"80s were so discouraged by on-field action, that they begin staging marshmallow fights to make game day more fun. But Texas Tech Red Raiders fans stand alone in their unique food tradition. They throw tortillas at kickoff, despite outside food not being allowed at the stadium. According to lore, in 1992, an ESPN announcer said that there was\" nothing but Tech football and a tortilla factory in Lubbock. \"The actual story is probably that the practice evolved from throwing soda lids. But ever since, rabid fans have thrown tortillas at football and some basketball games, though landing them on the playing field incurs a penalty. Visiting fans have to make sure to guard themselves against an errant projectile tortilla. Nicholas Moore/Dreamstime/TNS 13. The pink visitors locker room (Iowa) This college football tradition affects visiting players and not fans. In 1979, former Iowa coach Hayden Fry had the walls of the visitors locker room at Kinnick Stadium painted pink. When the stadium was updated in 2005, the pink was carried over to the carpets, lockers, toilets and showers. Fry's logic was that pink psychologically has a calming effect on people. While it didn't bother some, other coaches such as Michigan head coach Bo Schembechler saw red in that room. He reportedly hated it so much that he put paper on the walls to cover the color. Asolsma1988/Wikimedia Commons 12. Barking (Georgia) The majority of college sports fans leave the animal noises to the sound system, with one notable exception being University of Georgia fans. A tradition that needs to retire is Bulldog Nation barking at opposing fans. It's cute when it's done by a kid, but a grown man barking in someone's face comes off as manic. The only one who should be barking at a Georgia game is Uga, the bulldog mascot. Louis Lopez/CSM/Zuma Press/TNS 11. The Leland Stanford Junior University Marching Band (Stanford) The Stanford University marching band isn't like other bands. According to NPR, they're\" the only university marching band to be repeatedly fined and banned by the NCAA \"as well as booed off the field and suspended by their own school. Their polarizing, provocative on-field routines are meant to be humorous but sometimes cross the line to offensive and even interfere with the game. Many non-Cardinal fans find their\" jokes \"and wacky uniforms to be insufferable. Al Diaz/Miami Herald/MCT 10. Smurf Turf (Boise State) While some traditions are only annoying because of the suffering they cause in-person to opponents, even college football fans watching on their couches have to deal with the eye pain caused by Boise State's iconic, annoying Smurf Turf. Also given such titles as\" The Blue Plastic Tundra, \"the blue turf was installed in 1986 and became the first and most notorious non-green stadium surface. This unique home-field advantage is hard on the eyes for fans and players, especially when the Broncos wear all-blue uniforms. Joe Jaszewski/Idaho Statesman/TNS 9. Boomer Sooner (Oklahoma) To rival fans in the stands, it can feel like\" Boomer Sooner \"is the only song the University of Oklahoma band knows how to play. In fact, in the 2018 Rose Bowl game against Georgia, the band played it for almost every play, even after the Sooners lost the lead. A failed OU third down conversation? Time for\" Boomer Sooner! \"According to Reddit, the band played it 84 times in total in that single game. Afterward, USC's marching band, the Spirit of Troy, which is infamous for overplaying its school fight song, tweeted\" Mad respect for that level of annoyingness. \"The band's official count was 1,104 times during the 2017 season. No wonder other fans are peeved. Tom Fox/Dallas Morning News/MCT 8. Duck noise makers (Oregon) The 2010 World Cup had vuvuzelas, which led to them being banned four years later in Rio. The Oregon Ducks had duck bill noisemakers, known as Duck Lips, which became barred by the Pac-12 in 2011. There was officially a league-wide policy on artificial noisemakers, though only Oregon's quacking kazoos got the boot. Though the conference and the NCAA should have bigger concerns than eliminating an innocuous long-standing tradition, it was a bit of a relief to Pac-12 opponents and perhaps even to parents whose kids were using Duck Lips long after the game was over. Larry C. Lawson/Cal Sport Media/Zuma Press/TNS 7 .\" What is your profession?' (Michigan State) It seems only natural that the Michigan State Spartans would pilfer something from the 2006 movie \"300\" since it's about the Spartans. Except that the Spartans lost the Battle of Thermopylae. Miserably. And the \"Spartans\" in that battle were mostly Greeks. These facts don't stop Michigan State from playing the clip on the Jumbotron and grunting a response to the question posed by Gerard Butler's King Leonidas. Butler himself even visited the school for Midnight Madness and the homecoming football game in 2010, which further ingrained this tradition. Rashaun Rucker/Detroit Free Press/MCT 6. Cowbells (Mississippi State) Clanga! Cowbells might be a beloved tradition by Bulldogs dating back to the 1930s, but these instruments were considered so aggravating that they were sidelined by the SEC from 1974 until 2010. That year, Mississippi State's famed cowbells were allowed back into football stadiums provided Bulldog fans only ring them during timeouts. While MSU fans don't think of them as a gimmick, most other college football fans think otherwise. Charlie Jaijo/Tampa Bay Times/TNS 5. Turkey gobbling (Virginia Tech) Virginia Tech's annoying tradition isn't a chant or cheer but rather a sound effect played throughout the football stadium. Plenty of stadiums use effects like the noise of their animal mascot, but barks or growls don't make you clap your hands over your ears quite like the cry of the HokieBird, which is basically a turkey that evolved from the school's former nickname, the Gobblers. If it's not blasting for the scoreboard speakers, you might hear the turkey call emanating from a fan's noisemaker. Basically, the gobble is inescapable. Jared Lazarus/Miami Herald/MCT 4. Toast Toss (Pennsylvania) The true champions of throwing food on the field are students at the University of Pennsylvania. Between the third and fourth quarters of a football game, UPenn students sing \"Drink a Highball,\" which includes the line: \"Here's a toast to dear old Penn.\" Since no alcohol is allowed at the stadium, students improvise, throwing more than 20,000 pieces of toast as well as bagels, muffins and other baked goods down onto the track around the field. According to the Penn Currant, a modified turf cleaner called the \"toast zamboni\" picks up the food at the end of the day. The tradition has faced criticism for being a waste of money and food, though the school supports hunger-related charities to counteract the cost. Abby Drey/Centre Daily Times/MCT 3. \"Rocky Top' (Tennessee) Many discussions on fan forums are dedicated to college football fans' distaste for\" Rocky Top, \"the unofficial fight song of the University of Tennessee. This distaste seems to stem from the fact that it's simple and catchy as well as the sheer amount of times the band plays it. The Volunteers' marching band, the Pride of the Southland Band, played the song 438 times during the 2016 season, according to the Tennessean. That's an average of about 34 renditions of\" Rocky Top \"per game day. This has been described by Bleacher Report as\" psychological warfare \"in the form of a song. Tim Dominick/The State/MCT 2. Rolling Toomer's Corner (Auburn) This college sports tradition is more annoying to the Auburn groundskeepers than to anyone else, though it's also a frustrating sight to see for rival fans. Starting in 1896, people started tossing ticker tape over the telegraph wires at the spot nicknamed Toomer's Corner after big road victories. It later evolved to throwing toilet paper around the corner's oak trees. The long-standing tradition ticked off one bitter Alabama fan after Auburn topped the Crimson Tide. He poisoned and killed the original oak trees in 2010 and was sentenced to 3 years in prison for the damage, but the Tigers were resilient and continued the tradition. Mike Haskey/Columbus Ledger-Enquirer/MCT 1. Rammer Jammer (Alabama) Part of what makes this song so annoying is that it gets played quite a lot since Alabama is perennially good at football. What really make it get under the skin of the Crimson Tide's opponents are the lyrics:\" We just beat the hell out of you. \"These taunting words get directed as an opposing team mere seconds after their defeat, whether by 50 points or by 1. And the lyrics allow students and fans to relish the other team's defeat rather than celebrating their victory, which is why so many college football fans find it distasteful. Hyosub Shin/Atlanta Journal-Constitution/TNS Tags Wire Tns Sweeps College Sports Football Basketball Facebook Twitter Email Print Save Load comments × Post a comment as Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching © 2017 Lee Enterprises | Terms | Privacy", "articleID": "2018031217_00037773_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}}, {"date": "2018-03-12", "url": "http://the72.co.uk/99322/norwich-youngster-called-international-friendlies/", "content": "Norwich City youngster, <mark>Jamal Lewis</mark>, has today been called up to represent Northern Ireland during the upcoming international break. <mark>Lewis</mark> has made 13 appearances for the Canaries in the Sky Bet Championship this season, after being thrown in at the deep end by City boss Daniel Farke. The full-back has never previously been called up by the senior team has made three appearances for the U18's as well as a single appearance for the U21's. <mark>Lewis</mark> has impressed for the Canaries so far this season with his goal in the FA Cup 3rd round replay against current Premier League champions Chelsea thrusting the 20 year old into the limelight. Speaking in his press conference this afternoon, City boss Farke praised his young defender for his recent call-up on the international front: \"It's brilliant news for him and well-deserved .\" He's a brilliant lad. I'm really happy for him. He's totally happy and it's great for him. \"<mark>Lewis</mark> and his international teammates will face South Korea at Windsor Park on the 24th of March", "articleID": "2018031219_00239339_W", "names": {"Jamal Lewis": ["Q1452212", "Q46996227"]}}, {"date": "2018-03-13", "url": "https://www.massdevice.com/anika-ceo-retires-after-two-decades-president-assumes-corner-office-personnel-moves-march-13-2018/", "content": "Anika CEO retires after two decades; president assumes corner office | Personnel Moves--March 13, 2018 - MassDevice MassDevice <script type = \"text/javascript\" language = \"JavaScript\" src = \"https: //designw.nui.media/pipeline/553620/0/vj? z=designw & dim=538595 & kw= & click= & abr= $scriptiniframe\" > </ script> <noscript> <a href = \"https: //designw.nui.media/pipeline/553620/0/cc? z=designw\" > <img src = \"https: //designw.nui.media/pipeline/553620/0/vc? z=designw & dim=538595 & kw= & click= & abr= $imginiframe\" width = \"970\" height = \"250\" alt = \"\"border =\" 0 \"> </ a> </ noscript> Home\" Anika CEO retires after two decades; president assumes corner office | Personnel Moves--March 13, 2018 Anika CEO retires after two decades; president assumes corner office | Personnel Moves--March 13, 2018 March 13, 2018 By Sarah Faulkner Leave a Comment Anika Therapeutics (NSDQ: ANIK) announced this month that CEO Charles Sherwood plans to retire after working for Anika for nearly twenty years. Joseph Darling, who has been Anika's president since July 2017, will take his place in the corner office. Darling has previously served in executive leadership roles across an array of medtech companies like Abbott (NYSE: ABT), Baxter (NYSE: BAX) and Smith & Nephew (NYSE: SNN). \"First, I would like to thank Chuck Sherwood for his close to two decades of commitment to Anika and for establishing Anika as a global innovator in joint health and tissue repair,\" chairman Joseph Bower said in prepared remarks. \"Chuck Sherwood built Anika as we know it. As CEO for 15 years, he has delivered outstanding product innovation and development and operational, commercial, and financial achievements .\" 9 wearable medtech companies at the Wearable Technology Show Digital health wearables are increasingly making medtech strides: They can measure heart vitals, temperature and even track when someone falls. The Wearable Technology Show 2018--March 13--14 in London--is highlighting some of the latest wearable devices in the digital health realm. Showcased technologies include sensors to help orthopedic surgery patients, a watch to [...] Drug delivering contact lenses win MIT's top healthcare innovation prize Contact lenses that deliver medications directly to the eye over a period of days or weeks was the recent grand prize winner of Massachusetts Institute of Technology's Sloan Healthcare Innovation Prize. The MIT Sloan Healthcare Innovation Prize competition had 8 finalists who pitched their healthcare innovations to judges from Optum and other local venture firms, [...] 5 trends that could affect medtech in 2018 Antoine Baschiera, Early Metrics The rapid advancement of innovation today is propelling fundamental changes in all industries. Among them, the health and medtech sectors are ones that will be transformed drastically in the coming years. The medical devices and technology market will reach $500 billion in sales by 2021, according to a new analysis from Evaluate. [...] This 3D-printed device analyzes tissue cells from rheumatoid arthritis Researchers in New York have created a 3D-printed, portable and low-cost microfluidic controller that analyzes tissue cells and can recognize fibroblast subtypes in rheumatoid arthritis patients. Single-cell analysis is a way for researchers to study how cells influence disease and their response to treatment, but there is a lack of cost-effective and user-friendly devices to [...] Designing wearables: How to make sense of your material options The medical device industry's knowledge base continually evolves regarding what works--and what doesn't--for wearable applications. Gain insight into some material selection considerations for skin-worn wearable design and development. Deepak Prakash, Vancive Medical Technologies In the dynamic wearables sector, medical device makers are searching for ways to translate their expertise into mobile, [...] Qosina touts ergonomic slide clamps Qosina is touting its slide clamps that have been an important part of the company since its founding in 1980. As one of the first products Qosina sold and one of its top-selling product lines, the company has evolved the original six slide clamps to add new innovative parts and remove old ones. Now, five [...] Raumedic showcasing polymer solutions at Medtec Europe 2018 Raumedic is showcasing some of its polymer solutions at Medtec Europe, set to take place in Stuttgart, Germany April 17-19. The company manufactures medical-grade components made from thermoplastics and silicone using its extrusion and injection-molding processes. All of the components are processed under clean-room conditions and are ISO Class 7 compliant. Raumedic has a variety [...] Covestro releases new polycarbonate with resistance to solvents, cleaning agents Covestro has released Makrolon Rx3440, a material designed to withstand solvents found in oncology treatments--as well as cleaning agents. The medical polycarbonate offers durability and chemical resistance to help prevent cracking so that healthcare professionals can more safely deliver oncology drugs to patients. Cancer treatments are hard on plastics, noted Lauren Zetts, North America [...] Former Starkey president found guilty in multimillion-dollar embezzlement case A federal court jury in Minnesota today found Jerry Ruzicka, former president of hearing aid company Starkey Laboratories, guilty of eight of 25 counts involving more than $15 million worth of embezzlement, according to media reports. W. <mark>Jeff Taylor</mark>, who previously president of Starkey parts supplier Sonion U.S., was also found guilty. The jury acquitted two [...] Rimsys launches software to help medtech companies manage regulatory changes Startup company Rimsys (Pittsburgh) has launched its its first software solution that helps medical device companies effectively manage regulations around the world. Delays or blocks to medical devices entering the market can be caused by things like mismanaged information. Rimsys is trying to alleviate that problem with its software by giving them a platform that [...]", "articleID": "2018031313_00317663_W", "names": {"Jeff Taylor": ["Q3807796", "Q6175126", "Q6175130", "Q6175132"]}}, {"date": "2018-03-14", "url": "https://www.upi.com/Top_News/US/2018/03/14/Lamb-holds-slight-edge-over-Saccone-as-votes-counted-in-Pennsylvania-race/1071520998384/?utm_source=fp&utm_campaign=ls&utm_medium=2", "content": "Lamb holds slight edge over Saccone as votes counted in Pennsylvania race By Ray Downs | Updated March 14, 2018 at 9:26 AM 1 of 6 | License Photo March 14 (UPI)--A key congressional race in Pennsylvania's 18th District was too close to call Wednesday morning, with absentee ballots waiting to be counted to determine the winner. Democrat Conor Lamb led Republican Rick Saccone by 641 votes as of 9 a.m.. He had claimed victory just before 1 a.m. \"It took a little longer than we thought, but we did it. You did it,\" Lamb told supporters in Canonsburg, Pa.. Saccone said late Tuesday that there are also provisional and military absentee ballots that still need to be counted. And if those fail to bring victory, he said, his campaign could seek a recount due to the razor-thin margin of the vote tally. \"We are still fighting the fight. It's not over yet,\" he said. Absentee ballots in Washington County were being counted Wednesday morning. The race--in which a Lamb victory would flip the Republican seat--is considered a bellwether for the November midterms. President Donald Trump handily won the district in 2016 over Democratic nominee Hillary Clinton. Rep. <mark>Tim Murphy</mark> vacated the seat in October after a scandal involving a staffer. The winner of the race will serve out the remaining 10 months of <mark>Murphy</mark>'s term, but will have to win a new district to continue in November--after an anti-gerrymandering decision last month by the Pennsylvania Supreme Court that realigned congressional boundaries. Jakob Lazzaro of Medill News Service contribute to this report. Related UPI Stories", "articleID": "2018031414_00041549_W", "names": {"Tim Murphy": ["Q2434181", "Q7804022", "Q7804024", "Q7804025"]}}, {"date": "2018-03-14", "url": "https://www.gladstoneobserver.com.au/news/theyre-only-human-towns-cops-thank-officers-for-he/3361114/", "content": "Gladstone's police station are honouring their peer support officers this week with a morning tea to say \"thanks'. Sargent Kieran Barton, Chaplain Glenn Louttit, senior constable Wendy Brooks, acting inspector Tony Poli and peer support officer <mark>Matt Russell</mark>. Hannah Sbeghen News They're only human: Town's cops thank officers for helping hands by Hannah Sbeghen 15th Mar 2018 4:30 AM 0 THEY deal with ugly crimes so we don't have to, but who counsels a police officer at the end of a hard day? The Gladstone police station is recognising and honouring a group of 13 peer support officers this week who volunteer their free time to support struggling officers. Peer support officer <mark>Matt Russell</mark> said this week was one which recognised the hard days and strong support in the police network .\" It's a voluntary role that we do on our days off and as PSO's we need to make ourselves available to police officers who need our support, \"he said .\" I think people forget that police officers work shifts and juggle families at the same time. It's harder than it looks and when a rough day comes along that upsets you, you need someone to listen to you. \"Senior constable Wendy Brooks said each peer support officer (PSO) had to undertake extensive training course with yearly updates .\" There are funds being given to each patrol group and it's important because these are the people who understand us the best, they see what we do-day-in-and-day-out, \"she said .\" Our officers face a mix of issues that are unique to their role, everything from struggling with an emotional job to their own family life. But the best thing is that it's all confidential and there is no office gossip. \"Glenn Louttit has been counselling Gladstone police for the past six-a-half years and said some of their jobs take a horrendous emotional toll that outsiders would never see .\" There was a recent murder in Rockhampton and when the officers came back after their job, some were emotionally torn. These people are human too and it's important to share their burdens and lows with someone they can trust. \"They have an enormous amount of pressure on them to be good role models so they can't go to the pub and have a beer like the rest of us .\" Mr Louttit who is also a church minister, said he was honoured to be a release to the pressure. \"They keep our community safe and it's important we give them our shoulder,\" he said. 0", "articleID": "2018031418_00303343_W", "names": {"Matt Russell": ["Q16217590", "Q47349679", "Q6789277"]}}, {"date": "2018-03-14", "url": "http://www.washingtontimes.com/news/2018/mar/14/twitter-truthiness-and-titillation/", "content": "Twitter, truthiness and titillation Are you worried about a trade war? Question of the Day By Suzanne Fields - The Washington Times - Wednesday, March 14, 2018 ANALYSIS/OPINION: When talking politics, online or in person, you don't often hear anything about the \"magnificent middle .\" You'll hear epithets like the \"dirtbag left\" or the wicked \"alt-right,\" and all of the ugly free associations to commies and fascists, loonies and wackos. Moderation is mush, evenhandedness is stupid, considering two sides of an issue is so 20th century (or maybe 19th). Only one side could possibly be right. Arrogance and self-righteousness reign everywhere. And rain, too. Politics has always been a blood sport and we're accustomed to watching red and blue gladiators, but now that everybody's a pundit, human cockfighters and their respective followers are mad and mean 24/7. There's no time out. It's hard to figure out how this came about, but you can't blame it on <mark>Donald Trump</mark>. He merely tapped into great dissatisfaction with the powers that be, and a ravenous cable-TV with time to fill, along with a social media urgently demanding reaction to everything in 140 characters, did the rest. Tweets race from brain to finger without a serious thought for reflection. Marshall McLuhan said the \"medium is the message,\" but that's ancient history. The message today is in the air we inhale. Everybody talks in bursts of short sentences, like comic book characters. Instead of word bubbles over the heads of the characters there's the tap tap tap on a digital keyboard. Over a decade has passed since Stephen Colbert, a political jester on Comedy Central, coined the term \"truthiness\" to poke fun at President George W. Bush's facts, and the American Dialect Society would designate it \"word of the year,\" reflecting the Zeitgeist in 2005. Truthiness was thinking with your heart and intuition, unburdened by facts and logic. Factoids--Norman Mailer's inspired word for something that looks like a fact, sounds like a fact but in fact is not a fact--pushed aside the real thing. Truth in a media-saturated world began to change dangerously when information was no longer delivered by the written word, by newspapers and magazines with editors who held reporters to a strict standard for getting the who, what, why, where and how into the story. \"If your mother says she loves you,\" went the Chicago city room warning, \"check it out .\" The modern \"lead\" of a story is often shaded toward advocacy, trying to shape the reader's attention before a single fact is put to ink. Angry rhetoric determines point of view, placement and the flow of the stories on the front page and TV screen. Editorial pages and pundits struggle to keep up. Anecdotes become the sugar that helps the medicine go down, often replacing hard reporting. Oprah, a master at drawing out the emotional truth in the lives of ordinary people and a driver of television's daytime drivel, has become the designer of the news. Megyn Kelly, once a hard-hitting commentator on the news on Fox, moved to NBC to deliver breathless interviews of celebrities about the intimacies of their personal lives. Her ratings took off after the Weinstein scandals broke and #MeToo victims went to her with their tales of woe and racy revelations. In fact, the harassment scandals, as important as they can be, have defined news standards down, establishing guilt in the public eye and dispensing the sordid facts behind the accusations. Three professors at the Massachusetts Institute of Technology analyzed 126,000 Twitter cascades (unbroken chains of retweets from a common origin) that discovered that false stories (\"fake news,\" some call it) spread significantly farther and faster than tweets of truth, proving again the old maxim, variously attributed to Jonathan Swift, Mark Twain and Winston Churchill, that \"a lie goes halfway around the world before the truth can get its boots on .\" George Orwell created a Ministry of Truth in \"1984,\" his novel about control of human behavior through the manipulation of lies. Orwell could hardly imagine our ministries of truthiness, uncontrolled and chaotic, digital tweets of false stories that titillate and appeal to polarized points of view, spreading easily at the mere touch of fingertip. Research into Twitter trends of false stories is just beginning, and Sinan Aral, one of those MIT researchers, warns that the study of behavioral and psychological incentives for spreading false stories is needed to blunt and bend the trend. Truthiness and factoids appeal to the human craving for novelty and sensation, and advertisers crave the wider diffusion of stories, whether true or false, to attract eyes to their wares. There's a risk. \"Some notion of truth is central to the proper functioning of nearly every realm of human endeavor,\" Sinan Aral writes in The New York Times. \"If we allow the world to be consumed by falsity, we are inviting catastrophe .\" Can anyone doubt it? Suzanne Fields is a columnist for The Washington Times and is nationally syndicated.", "articleID": "2018031500_00224512_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2018-03-15", "url": "http://www.nydailynews.com/newswires/sports/syracuse-outlasts-arizona-state-article-1.3875616", "content": "Syracuse coach Jim Boeheim has made a concession for his thin roster--shorter practices and more sleep, especially for the Big Three. Good formula so far. The Orange, the last team selected for the NCAA Tournament, survived to play another day, holding off Arizona State 60-56 on Wednesday night in the First Four. Syracuse guards Tyus Battle and <mark>Frank Howard</mark> are 1-2 in the nation in minutes played and freshman Oshae Brissett is sixth, all of them averaging at least 38 per game. Despite recovering from a case of strep, <mark>Howard</mark> never sat and neither did Battle as the trio, led by Brissett's 23 points and 12 rebounds, combined to score 50 points. \"These two guys are amazing,\" Boeheim said at the podium afterward, looking over at <mark>Howard</mark> and Battle. \"They're going up against tremendous defensive teams all year long. They get doubled in everything every time they come off a screen .\" It's difficult to win when you've got three guys scoring. If they're off a little bit, it puts all the pressure back on our defense. \"That defense rose to the occasion, holding Arizona State to a season low in scoring .\" It was a rock fight, \"Sun Devils coach Bobby Hurley said .\" We didn't make enough shots. \"EYES ON CATS: The Arizona Wildcats will be in the spotlight when they open play against Buffalo, and coach Sean Miller and star freshman forward Deandre Ayton will be a focus as college basketball's season of scandal nears a climax. Miller missed one game and three practices late last month after ESPN reported he discussed a $100,000 payment to Ayton. Miller repudiated the report in a statement two weeks ago and the players don't seem fazed .\" I think off-the-court stuff, we don't really worry about that, \"guard Rawle Alkins said .\" We focus on the court, on the task at hand, this week, and we just take everything game by game. \"Syracuse's Oshae Brissett (11) scores the game-tying basket against Arizona State's Mickey Mitchell, left, during the second half of a First Four game of the NCAA men's college basketball tournament, Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo) Added Miller:\" Sometimes when adversity strikes it can really rally a group of people, can bring out a closeness that maybe you otherwise would not have felt. And I believe that about our team. \"KANSAS DEJA VU: A year ago Frank Mason III was the catalyst for the Kansas Jayhawks and consensus national player of the year. This year it's been Devonte' Graham's turn at the helm, and the senior has responded by leading Kansas to its 14th straight Big 12 regular-season title, putting him in the hunt for national POY. He's already received the league honor and this week was named a finalist for the Naismith Award .\" I don't really know what to say right now, but it hasn't really hit me yet, \"Graham said .\" But that's an individual award. You know, I'm more of a team guy. So I focus on the team and trying to get past this first game. \"Graham's value cannot be underestimated on a team that lost seven games and won the Big 12 Tournament without 7-footer Udoka Azubuike, who sat out with a knee injury but is expected back in the lineup. NEW YORK STATE OF MIND: The bellwether of NCAA Tournament basketball in upstate New York is usually perennial power Syracuse, but the Orange have company this year with western New York schools St. Bonaventure and Buffalo, and they're ready to make some noise of their own. In fact, the Bonnies, seeded 11th in the East, already have. They beat UCLA in the First Four--their first NCAA Tournament victory since 1970 and the days of <mark>Bob Lanier</mark>--then quickly jetted to Dallas where they'll play sixth-seeded Florida on Thursday night. St. Bonaventure has set a school record for wins in a season with 26 and will be trying to win two games in the NCAA Tournament for the first time since that banner year nearly a half-century ago when it beat Davidson, North Carolina State and Villanova before losing to Jacksonville, the defeat coming with an injured <mark>Lanier</mark> on the bench .\" This victory is for those guys. They didn't get an opportunity to show their talent, \"Bonnies coach <mark>Mark Schmidt</mark> said of that team led by <mark>Lanier</mark>.\" Bonaventure is a unique, special place...and it has great basketball tradition. \"Buffalo won the Mid-American Conference title and opens play against fourth-seeded Arizona in the South Regional. Syracuse's <mark>Frank Howard</mark>, left, and Arizona State's Romello White scramble for a loose ball in the final seconds of a First Four game of the NCAA men's college basketball tournament, Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo)\" Oh, man, it's going to be special. Hopefully, I can get past the jitters, \"Bulls guard Wes Clark said. PICK TWO: Congratulations Tom Izzo and Geno Auriemma. Former President Barack Obama has picked your teams to win it all in his NCAA Tournament brackets. Obama has Michigan State winning the men's title and--no surprises--UConn winning the women's championship. Obama has the Spartans beating Bucknell, Syracuse, Duke, and top-seeded Kansas to reach the Final Four along with defending national champion North Carolina, Villanova, and Virginia. Then he has Michigan State topping Villanova in the national semifinals and Virginia, the tournament's top seed, for the national championship. On the women's side, Obama has the unbeaten Huskies, the overall No. 1 seed, defeating Saint Francis, Quinnipiac, Duke, and South Carolina to reach the Final Four along with Louisville, Notre Dame and Mississippi State. UConn beats longtime rival Notre Dame in the national semifinals and Mississippi State for the title. The picks were posted Wednesday on the Obama Foundation's website. Last year he picked the North Carolina men and UConn women to win, and at least the Tar Heels obliged. The Huskies had their 111-game winning streak snapped by Mississippi State in last year's Final Four. It's unclear whether President Donald Trump will fill out a bracket. He declined an invitation last year from ESPN to do so on-air, as Obama did during his presidency. GET SHORTY: Demonstrae Jefferson is only 5-foot-7, but the Texas Southern guard sure plays big. He scored 25 points and grabbed eight rebounds in a 64-46 rout of North Carolina Central in the First Four on Wednesday night. Jefferson and Miami freshman Chris Lykes, also 5-7, are the shortest players in the tournament. For the 150-pound Jefferson, it was simply a good time to send a reminder to all the teams that passed him by. Syracuse's Oshae Brissett reacts during the second half against Arizona State in a First Four game of the NCAA men's college basketball tournament Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo)\" Yeah, when I do play those teams I kind of have an extra edge on my shoulder, like, you kind of missed out on the blessing, \"he said. FIRST TIME A CHARM? No fewer than 15 teams in the tournament are being led by head coaches who have never coached in the Big Dance. Among them are Avery Johnson at Alabama, Loyola-Chicago's Porter Moser, LaVall Jordan at Butler, Travis DeCuire at Montana, and 70-year-old Dan D'Antoni at <mark>Marshall</mark>. D'Antoni, who took over at his alma mater four years ago, is the older brother of Houston Rockets coach Mike D'Antoni and played point guard for <mark>Marshall</mark> in the 1960s. The list of coaches who won the title on their first try include: UConn's Kevin Ollie (2014), <mark>Steve Fisher</mark> at Michigan (1989), George Ireland at Loyola-Chicago (1963), and <mark>Fred Taylor</mark> at Ohio State (1960) with the likes of Jerry Lucas, John Havlicek and <mark>Bob Knight</mark> on the roster. ___ AP Sports Writers Dave Skretta in Kansas and <mark>John Marshall</mark> in Boise, Idaho, contributed. ___ For more AP college basketball coverage: More AP college basketball: https: //collegebasketball.ap.org; https: //twitter.com/AP_Top25 and https: //www.podcastone.com/ap-sports-special-events Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Sign up for BREAKING NEWS Emails privacy policy Thanks for subscribing! Tags: newswires associated press sports newswires Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2018031511_00044907_W", "names": {"Bob Knight": ["Q16538199", "Q4933049", "Q888594"], "Bob Lanier": ["Q4933111", "Q888056"]}}]