[{"date": "2018-03-15", "url": "http://www.nydailynews.com/newswires/sports/syracuse-outlasts-arizona-state-article-1.3875616", "content": "Syracuse coach Jim Boeheim has made a concession for his thin roster--shorter practices and more sleep, especially for the Big Three. Good formula so far. The Orange, the last team selected for the NCAA Tournament, survived to play another day, holding off Arizona State 60-56 on Wednesday night in the First Four. Syracuse guards Tyus Battle and <mark>Frank Howard</mark> are 1-2 in the nation in minutes played and freshman Oshae Brissett is sixth, all of them averaging at least 38 per game. Despite recovering from a case of strep, <mark>Howard</mark> never sat and neither did Battle as the trio, led by Brissett's 23 points and 12 rebounds, combined to score 50 points. \"These two guys are amazing,\" Boeheim said at the podium afterward, looking over at <mark>Howard</mark> and Battle. \"They're going up against tremendous defensive teams all year long. They get doubled in everything every time they come off a screen .\" It's difficult to win when you've got three guys scoring. If they're off a little bit, it puts all the pressure back on our defense. \"That defense rose to the occasion, holding Arizona State to a season low in scoring .\" It was a rock fight, \"Sun Devils coach Bobby Hurley said .\" We didn't make enough shots. \"EYES ON CATS: The Arizona Wildcats will be in the spotlight when they open play against Buffalo, and coach Sean Miller and star freshman forward Deandre Ayton will be a focus as college basketball's season of scandal nears a climax. Miller missed one game and three practices late last month after ESPN reported he discussed a $100,000 payment to Ayton. Miller repudiated the report in a statement two weeks ago and the players don't seem fazed .\" I think off-the-court stuff, we don't really worry about that, \"guard Rawle Alkins said .\" We focus on the court, on the task at hand, this week, and we just take everything game by game. \"Syracuse's Oshae Brissett (11) scores the game-tying basket against Arizona State's Mickey Mitchell, left, during the second half of a First Four game of the NCAA men's college basketball tournament, Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo) Added Miller:\" Sometimes when adversity strikes it can really rally a group of people, can bring out a closeness that maybe you otherwise would not have felt. And I believe that about our team. \"KANSAS DEJA VU: A year ago Frank Mason III was the catalyst for the Kansas Jayhawks and consensus national player of the year. This year it's been Devonte' Graham's turn at the helm, and the senior has responded by leading Kansas to its 14th straight Big 12 regular-season title, putting him in the hunt for national POY. He's already received the league honor and this week was named a finalist for the Naismith Award .\" I don't really know what to say right now, but it hasn't really hit me yet, \"Graham said .\" But that's an individual award. You know, I'm more of a team guy. So I focus on the team and trying to get past this first game. \"Graham's value cannot be underestimated on a team that lost seven games and won the Big 12 Tournament without 7-footer Udoka Azubuike, who sat out with a knee injury but is expected back in the lineup. NEW YORK STATE OF MIND: The bellwether of NCAA Tournament basketball in upstate New York is usually perennial power Syracuse, but the Orange have company this year with western New York schools St. Bonaventure and Buffalo, and they're ready to make some noise of their own. In fact, the Bonnies, seeded 11th in the East, already have. They beat UCLA in the First Four--their first NCAA Tournament victory since 1970 and the days of <mark>Bob Lanier</mark>--then quickly jetted to Dallas where they'll play sixth-seeded Florida on Thursday night. St. Bonaventure has set a school record for wins in a season with 26 and will be trying to win two games in the NCAA Tournament for the first time since that banner year nearly a half-century ago when it beat Davidson, North Carolina State and Villanova before losing to Jacksonville, the defeat coming with an injured <mark>Lanier</mark> on the bench .\" This victory is for those guys. They didn't get an opportunity to show their talent, \"Bonnies coach <mark>Mark Schmidt</mark> said of that team led by <mark>Lanier</mark>.\" Bonaventure is a unique, special place...and it has great basketball tradition. \"Buffalo won the Mid-American Conference title and opens play against fourth-seeded Arizona in the South Regional. Syracuse's <mark>Frank Howard</mark>, left, and Arizona State's Romello White scramble for a loose ball in the final seconds of a First Four game of the NCAA men's college basketball tournament, Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo)\" Oh, man, it's going to be special. Hopefully, I can get past the jitters, \"Bulls guard Wes Clark said. PICK TWO: Congratulations Tom Izzo and Geno Auriemma. Former President Barack Obama has picked your teams to win it all in his NCAA Tournament brackets. Obama has Michigan State winning the men's title and--no surprises--UConn winning the women's championship. Obama has the Spartans beating Bucknell, Syracuse, Duke, and top-seeded Kansas to reach the Final Four along with defending national champion North Carolina, Villanova, and Virginia. Then he has Michigan State topping Villanova in the national semifinals and Virginia, the tournament's top seed, for the national championship. On the women's side, Obama has the unbeaten Huskies, the overall No. 1 seed, defeating Saint Francis, Quinnipiac, Duke, and South Carolina to reach the Final Four along with Louisville, Notre Dame and Mississippi State. UConn beats longtime rival Notre Dame in the national semifinals and Mississippi State for the title. The picks were posted Wednesday on the Obama Foundation's website. Last year he picked the North Carolina men and UConn women to win, and at least the Tar Heels obliged. The Huskies had their 111-game winning streak snapped by Mississippi State in last year's Final Four. It's unclear whether President Donald Trump will fill out a bracket. He declined an invitation last year from ESPN to do so on-air, as Obama did during his presidency. GET SHORTY: Demonstrae Jefferson is only 5-foot-7, but the Texas Southern guard sure plays big. He scored 25 points and grabbed eight rebounds in a 64-46 rout of North Carolina Central in the First Four on Wednesday night. Jefferson and Miami freshman Chris Lykes, also 5-7, are the shortest players in the tournament. For the 150-pound Jefferson, it was simply a good time to send a reminder to all the teams that passed him by. Syracuse's Oshae Brissett reacts during the second half against Arizona State in a First Four game of the NCAA men's college basketball tournament Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo)\" Yeah, when I do play those teams I kind of have an extra edge on my shoulder, like, you kind of missed out on the blessing, \"he said. FIRST TIME A CHARM? No fewer than 15 teams in the tournament are being led by head coaches who have never coached in the Big Dance. Among them are Avery Johnson at Alabama, Loyola-Chicago's Porter Moser, LaVall Jordan at Butler, Travis DeCuire at Montana, and 70-year-old Dan D'Antoni at <mark>Marshall</mark>. D'Antoni, who took over at his alma mater four years ago, is the older brother of Houston Rockets coach Mike D'Antoni and played point guard for <mark>Marshall</mark> in the 1960s. The list of coaches who won the title on their first try include: UConn's Kevin Ollie (2014), <mark>Steve Fisher</mark> at Michigan (1989), George Ireland at Loyola-Chicago (1963), and <mark>Fred Taylor</mark> at Ohio State (1960) with the likes of Jerry Lucas, John Havlicek and <mark>Bob Knight</mark> on the roster. ___ AP Sports Writers Dave Skretta in Kansas and <mark>John Marshall</mark> in Boise, Idaho, contributed. ___ For more AP college basketball coverage: More AP college basketball: https: //collegebasketball.ap.org; https: //twitter.com/AP_Top25 and https: //www.podcastone.com/ap-sports-special-events Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Sign up for BREAKING NEWS Emails privacy policy Thanks for subscribing! Tags: newswires associated press sports newswires Send a Letter to the Editor Join the Conversation: facebook Tweet", "articleID": "2018031511_00044907_W", "names": {"Frank Howard": ["Q5487338", "Q5487340", "Q5487342"], "Fred Taylor": ["Q15994449", "Q359884", "Q3752661", "Q5496385", "Q5496387", "Q5496388"], "John Marshall": ["Q11727936", "Q16227857", "Q1700966", "Q201423", "Q20675590", "Q20675591", "Q20684714", "Q21064499", "Q28709713", "Q29033953", "Q30604090", "Q3809459", "Q47540656", "Q51588456", "Q56808914", "Q58104514", "Q6246855", "Q6246857", "Q6246861", "Q6246867", "Q6246869", "Q6246871", "Q929340"], "Mark Schmidt": ["Q16229217", "Q57167391"], "Steve Fisher": ["Q30188272", "Q7612541", "Q7612543", "Q7612549"]}}, {"date": "2018-03-15", "url": "http://wincountry.com/news/articles/2018/mar/15/dive-bars-dahlonega-and-worst-days-a-crash-course-in-ashley-mcbrydes-breakthrough-hit/", "content": "Dive bars, Dahlonega and \"worst day [s]\" : A crash course in Ashley McBryde's breakthrough hit Thursday, March 15, 2018 11 a.m. CDT Image courtesy of Warner Music Nashville (via ABC News Radio) If you're trying to unravel the mysteries of Ashley McBryde's first top forty hit, \"A Little Dive Bar in Dahlonega,\" here's a crash course: Dahlonega is a town in the mountains of North Georgia, and the watering hole in question is a place called the Crimson Moon. The song was based on something that actually happened to songwriter Jesse Rice. \"Jesse did a really good job of explaining the town of Dahlonega to us, and his exact situation, the car breaking down and pulling into the Crimson Moon, just to kind of ride it out and have a beer, and Shawn Mullins was in [the bar] singing,\" Ashley says of the session where the tune was written. \"[Our co-writer] Nicolette Hayford and I were taking notes as fast as we possibly could,\" Ashley recalls. \"And [Jesse]'s like,\" Well, anyway, I guess we're not writing today .' And I was like, \"No, no, no! Listen to this .\" She recalls that she then started sing, \"Here's to the breakups that didn't break us,\" and adds, \"45 minutes after that, we had the song .\" The Arkansas native says the tune about \"making the best of the worst day\" is having a bigger effect than she ever imagined. \"I started getting emails and Snapchats from people saying,\" This song changed my life,' \"Ashley tells ABC Radio .\" And I'm Snapping back, immediately. \"What do you mean? What happened?' You know like,\" Did your car break down?' \"\"And [one fan] said I kept her from taking a phone call from her abusive ex,\" Ashley reveals. \"That's way bigger than us. So what we touched on--our terrible day--became way bigger than we can comprehend .\" Ashley's debut album for Warner Nashville, Girl Going Nowhere, comes out March 30. Copyright © 2018, ABC Radio. All rights reserved. More From Music \"Happens Like That\" : The spontaneous beginning of Granger Smith's latest hit <mark>Morgan Evans</mark>' \"Kiss Somebody\" competes for a major award Down Under Blake Shelton, <mark>Craig Morgan</mark> and MercyMe will be Jammin' to Beat the Blues with Trace Adkins Jon Pardi's adorable wedding present for Maren Morris and Ryan Hurd Reba and the cast are rarin' to go for a \"Reba\" reboot Jason Aldean reunites Hootie & the Blowfish to play Braves' stadium this summer Comments", "articleID": "2018031516_00055450_W", "names": {"Craig Morgan": ["Q1138616", "Q1771428", "Q3002042", "Q39927282"], "Morgan Evans": ["Q21954811", "Q30122234", "Q56598028"]}}, {"date": "2018-03-17", "url": "http://www.bdtonline.com/region/the-latest-trump-says-mccabe-caught-called-out-and-fired/article_ff30b313-0184-5e7c-aaed-dda69f1e3032.html", "content": "The Latest: Trump says <mark>McCabe</mark> \"caught, called out and fired' The Latest on the second round of the NCAA Tournament (all times Eastern): More Headlines Birth Announcement HAGER--<mark>Michelle Lee</mark> and Jay O’Keith Hager announce the birth of their daughter, Kinsley Paige Hager, born on August 15 at Bluefield Regional Medical Center, the baby weighed 7 lbs. 2 oz. The mother is the former <mark>Michelle Lee</mark> Reed. Maternal Grandparents are Tina and <mark>Terry</mark> Reed of Bluefield,...North Korea negotiations Maybe it's President Donald Trump's\" fire and fury \"threats and coarseness with the leader he calls\" Little Rocket Man. \"Maybe it's the squeeze of international sanctions. Maybe it's both. But after years of brinkmanship and missile tests, North Korean leader <mark>Kim Jong Un</mark> appears to be signal...More Headlines The Latest: Trump says <mark>McCabe</mark>\" caught, called out and fired' Mar 17, 2018 Updated 2 min ago WASHINGTON (AP)--The Latest on the dismissal of <mark>Andrew McCabe</mark>, a former FBI deputy director (all times local): 2:10 p.m. President Donald Trump says \"the Fake News is beside themselves that <mark>McCabe</mark> was caught, called out and fired .\" Trump is referring to <mark>Andrew McCabe</mark>, the FBI deputy director fired by Attorney General Jeff Sessions late Friday. The president tweets Saturday: \"How many hundreds of thousands of dollars was given to wife's campaign by Crooked H friend, <mark>Terry</mark> M, who was also under investigation? How many lies? How many leaks? Comey knew it all, and much more!\" As a candidate for state office, <mark>McCabe</mark>'s wife accepted a campaign contribution from the political action committee of then-Virginia Gov. <mark>Terry McAuliffe</mark>, a Democrat. <mark>McAuliffe</mark> is a longtime friend of Democrat Hillary Clinton, whom Trump defeated in 2016. Trump fired James Comey as FBI director last May, citing the Russia investigation. <mark>McCabe</mark> says Sessions fired him as part of the Trump administration's \"war on the FBI .\" ------1:55 p.m. President Donald Trump says many people are finding out about \"tremendous leaking, lying and corruption at the highest levels\" of the FBI and the Justice and State Departments. He provided no details in his tweet Saturday. But his tweet comes a day after Attorney General Jeff Sessions announced that he had fired FBI deputy director <mark>Andrew McCabe</mark> following a recommendation from FBI disciplinary officials. <mark>McCabe</mark> has long been a target of Trump's anger. His dismissal precedes the release of an inspector general report that's expected to conclude that <mark>McCabe</mark> was not forthcoming about matters related to the FBI investigation of Hillary Clinton's emails. In Saturday's tweet, Trump also repeated that there had been no collusion between his 2016 presidential campaign and Russia. That matter is under investigation by special counsel Robert Mueller .------12:55 p.m. <mark>Andrew McCabe</mark>--the former FBI deputy director just fired by the attorney general--kept personal memos regarding President Donald Trump. That's according to a person with direct knowledge of the situation who wasn't authorized to discuss the memos publicly and spoke on condition of anonymity. This person says the memos are similar to the ones maintained by former FBI Director James Comey, who Trump fired last May. Comey's series of notes detailed interactions with Trump that Comey said unnerved him. The person with knowledge of <mark>McCabe</mark>'s situation says <mark>McCabe</mark>'s memos include details of interactions with the president, among other topics. It's not immediately clear whether any of the <mark>McCabe</mark> memos have been turned over to special counsel Robert Mueller or requested by Mueller .------1:25 a.m. Attorney General Jeff Sessions says he has fired former FBI deputy director <mark>Andrew McCabe</mark>, a regular target of President Donald Trump's anger and criticism, just two days before his scheduled retirement date. <mark>McCabe</mark> immediately decried the move and suggested it was part of the Trump administration's \"war on the FBI .\" The Friday dismissal was made on the recommendation of FBI disciplinary officials and comes ahead of an inspector general report expected to conclude that <mark>McCabe</mark> had authorized the release of information to the news media and had not been forthcoming with the watchdog office as it examined the bureau's handling of the Hillary Clinton email investigation. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2018031718_00121197_W", "names": {"Andrew Mccabe": ["Q27734885", "Q29878677"], "Kim Jong Un": ["Q14045951", "Q56226"], "Michelle Lee": ["Q16233958", "Q28465824", "Q6837119", "Q717070"]}}]