[{"date": "2018-03-17", "url": "http://www.bdtonline.com/region/the-latest-trump-says-mccabe-caught-called-out-and-fired/article_ff30b313-0184-5e7c-aaed-dda69f1e3032.html", "content": "The Latest: Trump says <mark>McCabe</mark> \"caught, called out and fired' The Latest on the second round of the NCAA Tournament (all times Eastern): More Headlines Birth Announcement HAGER--<mark>Michelle Lee</mark> and Jay O’Keith Hager announce the birth of their daughter, Kinsley Paige Hager, born on August 15 at Bluefield Regional Medical Center, the baby weighed 7 lbs. 2 oz. The mother is the former <mark>Michelle Lee</mark> Reed. Maternal Grandparents are Tina and <mark>Terry</mark> Reed of Bluefield,...North Korea negotiations Maybe it's President Donald Trump's\" fire and fury \"threats and coarseness with the leader he calls\" Little Rocket Man. \"Maybe it's the squeeze of international sanctions. Maybe it's both. But after years of brinkmanship and missile tests, North Korean leader <mark>Kim Jong Un</mark> appears to be signal...More Headlines The Latest: Trump says <mark>McCabe</mark>\" caught, called out and fired' Mar 17, 2018 Updated 2 min ago WASHINGTON (AP)--The Latest on the dismissal of <mark>Andrew McCabe</mark>, a former FBI deputy director (all times local): 2:10 p.m. President Donald Trump says \"the Fake News is beside themselves that <mark>McCabe</mark> was caught, called out and fired .\" Trump is referring to <mark>Andrew McCabe</mark>, the FBI deputy director fired by Attorney General Jeff Sessions late Friday. The president tweets Saturday: \"How many hundreds of thousands of dollars was given to wife's campaign by Crooked H friend, <mark>Terry</mark> M, who was also under investigation? How many lies? How many leaks? Comey knew it all, and much more!\" As a candidate for state office, <mark>McCabe</mark>'s wife accepted a campaign contribution from the political action committee of then-Virginia Gov. <mark>Terry McAuliffe</mark>, a Democrat. <mark>McAuliffe</mark> is a longtime friend of Democrat Hillary Clinton, whom Trump defeated in 2016. Trump fired James Comey as FBI director last May, citing the Russia investigation. <mark>McCabe</mark> says Sessions fired him as part of the Trump administration's \"war on the FBI .\" ------1:55 p.m. President Donald Trump says many people are finding out about \"tremendous leaking, lying and corruption at the highest levels\" of the FBI and the Justice and State Departments. He provided no details in his tweet Saturday. But his tweet comes a day after Attorney General Jeff Sessions announced that he had fired FBI deputy director <mark>Andrew McCabe</mark> following a recommendation from FBI disciplinary officials. <mark>McCabe</mark> has long been a target of Trump's anger. His dismissal precedes the release of an inspector general report that's expected to conclude that <mark>McCabe</mark> was not forthcoming about matters related to the FBI investigation of Hillary Clinton's emails. In Saturday's tweet, Trump also repeated that there had been no collusion between his 2016 presidential campaign and Russia. That matter is under investigation by special counsel Robert Mueller .------12:55 p.m. <mark>Andrew McCabe</mark>--the former FBI deputy director just fired by the attorney general--kept personal memos regarding President Donald Trump. That's according to a person with direct knowledge of the situation who wasn't authorized to discuss the memos publicly and spoke on condition of anonymity. This person says the memos are similar to the ones maintained by former FBI Director James Comey, who Trump fired last May. Comey's series of notes detailed interactions with Trump that Comey said unnerved him. The person with knowledge of <mark>McCabe</mark>'s situation says <mark>McCabe</mark>'s memos include details of interactions with the president, among other topics. It's not immediately clear whether any of the <mark>McCabe</mark> memos have been turned over to special counsel Robert Mueller or requested by Mueller .------1:25 a.m. Attorney General Jeff Sessions says he has fired former FBI deputy director <mark>Andrew McCabe</mark>, a regular target of President Donald Trump's anger and criticism, just two days before his scheduled retirement date. <mark>McCabe</mark> immediately decried the move and suggested it was part of the Trump administration's \"war on the FBI .\" The Friday dismissal was made on the recommendation of FBI disciplinary officials and comes ahead of an inspector general report expected to conclude that <mark>McCabe</mark> had authorized the release of information to the news media and had not been forthcoming with the watchdog office as it examined the bureau's handling of the Hillary Clinton email investigation. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags", "articleID": "2018031718_00121197_W", "names": {"Terry Mcauliffe": ["Q3518911", "Q49001865"]}}, {"date": "2018-03-18", "url": "http://www.stuff.co.nz/sport/cricket/102378260/South-Africa-sweat-on-Kagiso-Rabada-hearing-as-NZ-lawyer-takes-centre-stage", "content": "South Africa sweat on Kagiso Rabada hearing as NZ lawyer takes centre stage ROB FORSAITH Last updated 19:57, March 18 2018 GALLO IMAGES South African fast bowler Kagiso Rabada, centre, appears hopeful rather than optimistic of having his ban overturned for the third test against Australia. Comments emanating from South Africa's cricket team suggest they will enter Monday's hearing over Kagiso Rabada's two-test ban with high hopes but low expectations. Judicial commissioner Michael Heron, who is based in New Zealand and more commonly assesses tip tackles and other Super Rugby incidents, will soon chair a video conference over Rabada's charge of making \"inappropriate and deliberate physical contact\" with <mark>Steve Smith</mark> during the second test. Heron then has 48 hours to reach a verdict. MONIQUE FORD/STUFF Lawyer Michael Heron will preside over South African fast bowler Kagiso Rabada's appeal against a two-test ban. That timeline ensures the saga, which started when the Proteas spearhead brushed <mark>Smith</mark>'s shoulder during a screaming send-off, should be over before the four-test series continues in Cape Town on Thursday. READ MORE: * Rabada: 50/50 it's my fault * Rabada's path to the Proteas * Bangladesh nearly forfeit T20 The judicial stoush has captivated much of the Rainbow Nation's attention. Rabada's representative Dali Mpofu opined it \"has implications for our shared project of nation-building\" , while former Springboks behemoth Bakkies Botha is among those to have weighed in. GALLO IMAGES Former New Zealand captain and now match referee Jeff Crowe, second from right, ruled Kagiso Rabada's contact with Australian captain <mark>Steve Smith</mark> was deliberate. Rabada would be a huge loss for the hosts, with the series level at 1-1 after he bowled them to victory in Port Elizabeth. But the 22-year-old is seemingly resigned to the fact he won't be playing at Newlands, having admitted he erred during the press conference that followed a haul of 11-150. \"It's going to have to stop. I can't keep doing this because I am letting the team down and I am letting myself down. I would've loved to have been playing the next game,\" he said at the time. Later in the week, the world's top-ranked test bowler told reporters he takes \"responsibility for what happened\". Ad Feedback That was the view taken by match referee Jeff Crowe - the former New Zealand captain and later team manager - who noted in a public statement that Rabada \"had the opportunity to avoid the contact\". \"I could not see any evidence to support the argument that the contact was accidental,\" Crowe said. Faf du Plessis knows as well as anybody how hard it can be to overturn a match referee's verdict at a formal appeal. South Africa's skipper unsuccessfully took his ball-tampering charge resulting from \"mint-gate' to a judicial commissioner .\" Our strike rate is zero per cent at the moment with trying to challenge these cases, it will probably stay at zero, \"du Plessis said after the second test. It is unclear whether Mpofu intends presenting new evidence. He is expected to argue both Rabada and <mark>Smith</mark> are culpable. Heron has the option to settle on a new punishment for Rabada but it would be a major surprise if he opts for a harsher punishment. Rabada's problem is his poor disciplinary record, having started the series with five demerit points. The International Cricket Council's laws dictate that eight points result in an automatic two-test ban, so he will most likely miss the next two tests unless the charge is thrown out altogether. - AAP Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Cricket story: Legspinner Ish Sodhi stars with seven wickets in Plunket Shield for ND Sport Homepage", "articleID": "2018031807_00024833_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"]}}, {"date": "2018-03-19", "url": "http://infotel.ca/newsitem/us-school-shootings-metal-detectors/cp2087731845", "content": "In a photo from Thursday, March 8, 2018, in Detroit, Alondra Alvarez, a student at Western International High School, goes through a metal detector and has her backpack checked as she enters the school. Experts say metal detectors and other security measures put in place decades ago to quell gang and other violence in many urban schools have made them tough targets for mass shootings by troubled students or outsiders. (AP Photo/Carlos Osorio) March 19, 2018 - 10:48 AM DETROIT - Schools around the U.S. are looking for ways to impose tougher security measures in the wake of last month's school shooting in Florida that left 17 people dead. And they don't have to look further than urban districts such as Detroit, Chicago, Los Angeles and New York that installed metal detectors and other security in the 1980s and 1990s to combat gang and drug violence. Security experts believe these measures have made urban districts less prone to mass shootings, which have mostly occurred in suburban and rural districts. National African American Gun Association president <mark>Philip Smith</mark> says security measures at urban schools are \"eons ahead\" of those in the suburbs because \"they've been dealing with violence a lot longer .\" News from © The Associated Press, 2018", "articleID": "2018031917_00296177_W", "names": {"Philip Smith": ["Q2086449", "Q22247718", "Q24205313", "Q25189326", "Q27793298", "Q57061005", "Q57904017", "Q7184394", "Q7184396"]}}, {"date": "2018-03-19", "url": "http://kjzz.org/content/623431/overdose-deaths-native-american-communities-skyrocket", "content": "Listen to JazzPHX NPR News: 03-19-2018 5PM ET We are experiencing temporary interruptions to our phone service. Please visit our contact page, send an e-mail to member_services @ rioradio.org or call 480-834-5627 to reach us. Thanks for your patience. Overdose Deaths In Native American Communities Skyrocket (Photo by Johanna Huckeba - Cronkite News) Native Americans and Alaska Natives saw a fivefold increase in overdose deaths between 1999 and 2015, according to recent data from the Centers for Disease Control and Prevention. The increase in that period was higher for Native Americans than any other group, jumping to roughly 22 deaths for every 100,000 people in metropolitan areas and nearly 20 for every 100,000 people in rural areas. But the statistics, while staggering, may represent an undercount for Native Americans and Alaska Natives by as much as 35 percent, because death certificates often list them as belonging to another race, said Dr. Michael Toedt, the Indian Health Services' chief medical officer. As a growing number of tribes file lawsuits against drug manufacturers and distributors, saying they misrepresented addiction risks, the U.S. Senate Committee on Indian Affairs held a hearing focused on the crisis. Federal officials said the opioid epidemic is straining tribal resources. \"I have heard from tribes that there are not enough resources out there certainly any funding that congress can provide would be appreciated,\" Toedt said. Congress is scheduled to vote on a $1.4 trillion dollar budget later this week, and about $10 billion has been earmarked to tackle the opioid crisis nation-wide. Its unclear how much of that will be designated for tribes. <mark>Christopher Jones</mark>, policy director of the Substance Abuse and Mental Health Services Administration, told the committee he's more concerned about man power. \"We can have multiple billions of dollars that could be spent on treatment...but if we don't have providers who can provide the care, whether you're in Indian county or not, you're not going to be able to get access to evidence-based care,\" he said. Officials highlighted the success of expanded telehealth services for remote communities, training law enforcement officers on overdose procedures and providing naloxone, an overdose reversal drug, to tribal first responders. U.S. Attorney <mark>John Anderson</mark>, of New Mexico, said tribal leaders in a northern stretch of the state had called for solutions. One pueblo police chief described losing a brother and sister to overdoses, he said. \"The opioid epidemic knows no boundaries,\" he said. In August, state and tribal officials will come together for a policy academy with the goal of developing develop specific and actionable plans to address opioid crisis with available tribal, state and federal funds. The Associated Press contributed to this report. KJZZ on Twitter", "articleID": "2018031922_00216397_W", "names": {"Christopher Jones": ["Q1086779", "Q1086781", "Q16221807", "Q16541128", "Q22005681", "Q26706864", "Q2964754", "Q2966607", "Q2966611", "Q42877769", "Q44375922", "Q49587584", "Q5107029", "Q5112648", "Q5112649", "Q5112650", "Q58485818"], "John Anderson": ["Q13461960", "Q15994265", "Q16146059", "Q16146064", "Q1699148", "Q18576365", "Q18580618", "Q21460175", "Q22003139", "Q2399086", "Q25352589", "Q28232869", "Q3180912", "Q369857", "Q42431836", "Q43126740", "Q43394002", "Q43911342", "Q56650048", "Q56726476", "Q6218937", "Q6218947", "Q6218954", "Q6218975", "Q6218977", "Q6218982", "Q6218984", "Q6219000", "Q6219005", "Q93374", "Q936548"]}}, {"date": "2018-03-20", "url": "http://basketball.wikia.com/wiki/Antoine_Walker?diff=59780&oldid=45209", "content": "Revision as of 16:35, March 27, 2014 (view source) Sixerman (wall | contribs) (The NBA was not founded in 1722) ← Older edit Latest revision as of 13:54, March 20, 2018 (view source) Jdh87 (wall | contribs) (4 intermediate revisions by one user not shown) Line 1: Line 1: − {| class = \"Infobox NBA Player\" cellpadding = 1 cellspacing = 1 align = right width = 290px style = \"font-family: Arial; padding: 4px; margin: 0 0 1em 1em; font-size: 11px; background-color: #F 8F8FF; border:1 px solid #C 0C0C0; clear: right;\" + {{Heading 2}} {{Pagename}} {{Pagename}} | - | - − {{Colspan center}} [[Image: Antoine Walker. jpg | center]] + {{Colspan center}} [[Image: Antoine Walker. jpg | 220px]] <br> Walker at the NBAPA All-Star Players Social in 2015 − | - − {{Blank team color}} No. 8 − | - − {{Colspan center}} [[Power Forward]] / [[Small Forward]] | - | - {{Blank team color}} Personal information {{Blank team color}} Personal information | - | - − {{Colspan left}} Date of birth + {{Colspan left}} Born − | {{Birth date and age | 1976 | 8 | 12}} + | {{Birth date and age | 1976 | 8 | 12}} <br> Chicago, Illnois − | - − {{Colspan left}} Place of birth − | Chicago, IL | - | - {{Colspan left}} Nationality {{Colspan left}} Nationality − | [[Image: U.S. Flag. png]] American + | American + | - + {{Blank team color}} Physical stats | - | - {{Colspan left}} Listed height {{Colspan left}} Listed height Line 19: Line 19: | - | - {{Blank team color}} Career information {{Blank team color}} Career information + | - + {{Row}} \"\"High school\" ' + | Mount Carmel <br> (Chicago Illinois) | - | - {{Colspan left}} College {{Colspan left}} College Line 24: Line 27: | - | - {{Colspan left}} [[NBA Draft]] {{Colspan left}} [[NBA Draft]] − | [[1996 NBA Draft | 1996]]; Round: 1 / Pick: 6th + | [[1996 NBA Draft | 1996]] / Round: 1 / Pick: 6th | - | - {{Colspan center}} Selected by the [[Boston Celtics]] {{Colspan center}} Selected by the [[Boston Celtics]] | - | - − {{Colspan left}} Pro career + {{Colspan left}} Playing career | 1996-2012 | 1996-2012 + | - + {{Row}} \"\"Position\" ' + | [[Power forward]] | - | - {{Blank team color}} Career history {{Blank team color}} Career history | - | - − {{Colspan left 2}} Idaho Stampede (2010-2012) <br> Guaynabo Mets (2010) <br> [[Memphis Grizzlies]] (2008) <br> [[Minnesota Timberwolves]] (2008) <br /> [[Miami Heat]] (2005-2007) <br /> [[Atlanta Hawks]] (2004-2005) <br /> [[Dallas Mavericks]] (2003-2004) <br /> [[Boston Celtics]] (1996-2003) + | 1996-2003 + | [[Boston Celtics]] + | - + | 2003-2004 + | [[Dallas Mavericks]] + | - + | 2004-2005 + | [[Atlanta Hawks]] + | - + | 2005-2007 + | [[Miami Heat]] + | - + | 2008 + | [[Minnesota Timberwolves]] + | - + | 2008 + | [[Memphis Grizzlies]] + | - + | 2010 + | Guaynabo Mets + | - + | 2010-2012 + | Idaho Stampede | - | - {{Blank team color}} Career highlights and awards {{Blank team color}} Career highlights and awards + | - + {{colspan left 2}} * NBA champion (2006) * NBA champion (2006) * 3 × NBA All-Star (1998, 2002, 2003) * 3 × NBA All-Star (1998, 2002, 2003) Line 47: Line 55: |} |} − \"\"Antoine Devon Walker\" ' is a retired American [[basketball]] player in the [[NBA]] at [[Power Forward]], who last played for the [[Idaho Stampede]] of the [[NBA D-League]]. Walker was selected 6th overall in the [[1996 NBA Draft]] by the [[Boston Celtics]] out of the University of Kentucky. + \"\"Antoine Devon Walker\" ' (born August 12, 1976) is an American former professional [[basketball]] player. He was drafted with the sixth overall pick in the [[1996 NBA Draft]] out of the [[Kentucky Wildcats | University of Kentucky]] and played in the NBA from 1996 to 2008. Walker played for the Celtics, Mavericks, Hawks, Heat, Timberwolves, the [[Baloncesto Superior Nacional | BSN's]] Mets and the [[NBA D-League]]'s Stampede before retiring from basketball in 2012. Walker, a three-time NBA All-Star, won an NCAA championship with Kentucky in 1996 and an NBA championship with the [[Miami Heat]] in 2006. + + = = Pre-NBA career = = + Walker attended [[Mount Carmel High School (Chicago) | Mount Carmel High School]], in Chicago, where he played with future [[National Football League | NFL]] [[quarterback]] [[Donovan McNabb]] and attained all-state status as a senior, earning a full scholarship to play for [[Rick Pitino]] at the [[University of Kentucky]]. He was a starting forward on the Wildcats' [[1996 NCAA Men's Division I Basketball Championship Game]] - winning team. As a freshman at Kentucky he was named [[Southeastern Conference | SEC]] Tournament [[MVP]]. In his sophomore year, Walker was named All-SEC First, All-SEC Tournament and to the All-NCAA Regional Teams. + + = = Professional career = = + + = = = Boston Celtics = = = + After Walker's sophomore season, he declared for the [[1996 NBA draft]] and was picked sixth overall by the [[Boston Celtics]]. In the 1996--1997 season, Walker made the All-Rookie First Team and led the team in scoring (17.5 ppg) and rebounding (9.0), as the team had its worst season in franchise history, 15--67. The following season, Pitino was reunited with Walker as the new coach of the Celtics, and he made the All-Star team as a reserve while averaging 22.4 ppg and 10.2 rpg. He also scored a career-high 49 points in a loss against the [[Washington Wizards]]. In the '98 draft, the Celtics had the 10th pick and chose swing man [[Paul Pierce]]. The next few years, Pierce and Walker were the 1--2 punch for the Celtics. In the 2001--2002 season, Walker had his best overall season by helping lead the Celtics to a 49--33 record and their first playoff berth in seven years. He was second on his team in scoring (22.0), first in rebounds (9), and first in assists, (5.0). Pierce and Walker took the team to the Eastern Conference finals, where they fell to the New Jersey Nets in six games. The next season, Walker made his third All-Star team. + + On February 20, 2002, former Kentucky teammate [[Tony Delk]] was traded to the Celtics, reuniting Walker with him. + + = = = Dallas Mavericks and Atlanta Hawks = = = + Nine and one-half days before the start of the [[2003--04 NBA season | 2003--04 season]], Walker was traded with Delk to the [[Dallas Mavericks]] for [[Raef LaFrentz]], [[<mark>Chris Mills</mark> (basketball) | <mark>Chris Mills</mark>]], and [[Jiří Welsch]]. Walker was used in a relatively limited capacity on his new team due to the number of high-caliber players populating the Mavericks' roster. Included on that team was [[Antawn Jamison]], newly acquired from the [[Golden State Warriors]]. On August 8, 2004 Walker and Delk were traded again, this time to the [[Atlanta Hawks]] for [[Jason Terry]], longtime Hawk [[<mark>Alan Henderson</mark>]] and a draft pick. + + = = = Return to Boston = = = + On February 24, 2005, Walker was traded back to the Celtics in a deal that sent [[<mark>Gary Payton</mark>]], [[Tom Gugliotta]], [[<mark>Michael Stewart</mark> (basketball) | <mark>Michael Stewart</mark>]], and a first-round draft pick to the Hawks <ref> [http: //sports.espn.go.com/nba/news/story? id=1998923 Walker returns to Celtics in shocker]. Updated February 25, 2005 </ ref> (<mark>Payton</mark> was released by the Hawks and re-signed with Boston for the remainder of the season). Walker started all 24 remaining games for the Celtics, averaging 16.3 points and 8.3 rebounds a game as the Celtics advanced to the playoffs before losing to the [[Indiana Pacers]] in a 7-game first round series. + + = = = Miami Heat = = = + [[File: Antoine Walker Miami Heat. jpg | thumbnail | right | Walker with the Heat]] + On August 2, 2005, Walker was involved in a five-team, 13-player deal (the largest trade in NBA history) that sent him from the Celtics to the [[Miami Heat]]. The Celtics received [[Curtis Borchardt]], [[Qyntel Woods]], and a handful of draft picks in Walker's stead. + + The Heat played Walker mostly off the bench, and he rotated between both forward positions. Though he struggled early to adjust to this role, by the end of the season he was a force for the Heat, finishing the season with averages of 12.2 points and 5.1 rebounds a game as the team's main scorer off the bench. Walker also led the team in overall 3-point shots made for the season, and increased his 3-point, free throw and overall shooting percentages. + + In the playoffs his production would increase, as he would be the third leading scorer for the team while making crucial three-point baskets and posting 20 points in four different playoff games including 23 against the [[New Jersey Nets]] in the closing game of the conference semifinals. Miami advanced to the NBA Finals and faced the [[Dallas Mavericks]], with Walker posting 13.8 points per game in the series as the Heat won the [[NBA championship]] in 6 games. In the title clinching sixth game in Dallas, Walker contributed 14 points and 11 rebounds. Walker's production dipped in the 2006--2007 season as he averaged 8.5 points a game and 4.3 rebounds. The Heat failed to repeat as champions following a first round loss to the [[Chicago Bulls]]. + + = = = Minnesota Timberwolves and Memphis Grizzlies = = = + On October 24, 2007, Walker was traded to the [[Minnesota Timberwolves]] along with [[Michael Doleac]], [[Wayne Simien]], a first-round draft pick and cash considerations in exchange for [[<mark>Ricky Davis</mark>]] and [[<mark>Mark Blount</mark>]]. <ref> [http: //sports.espn.go.com/espn/wire? section=nba & id=3077864 By trading two more veteran starters, Wolves grow even younger], October 24, 2007 </ ref> <ref name = tradestokes> Ira Winderman, [http: //www.sun-sentinel.com/sports/sfl-flspheat25nboct25,0,5407411.story Riley's trade stokes the Heat] {{webarchive | url = https: //web.archive.org/web/20071026033138/http: //www.sun-sentinel.com/sports/sfl-flspheat25nboct25% 2C0% 2C5407411.story | date = October 26, 2007}}, \"[[South Florida Sun-Sentinel]]\" </ ref> <ref> [http: //www.nba.com/timberwolves/news/wolves_nab_first_round_pick_and_three_players_from_heat.html Wolves Nab First-Round Pick and Three Players From Heat] </ ref> + + On June 27, 2008, Walker was dealt to the [[Memphis Grizzlies]] along with [[Marko Jarić]], [[Greg Buckner]], and the rights to [[O. J. Mayo]], for [[<mark>Mike Miller</mark> (basketball player) | <mark>Mike Miller</mark>]], [[Brian Cardinal]], [[<mark>Jason Collins</mark>]], and the rights to [[<mark>Kevin Love</mark> (basketball) | <mark>Kevin Love</mark>]]. <ref> [http: //www.startribune.com/sports/wolves/21828189.html? location_refer=Homepage: highlightModules:1 Wolves pick Mayo, swap him for <mark>Love</mark> in 8-player deal] </ ref> After appearing in just two preseason games and remaining inactive throughout the opening months of the regular season, <ref> http: //www.commercialappeal.com/news/2008/dec/15/grizzlies-to-give-walker-a-contract-buyout/ </ref> he was waived by the Grizzlies on December 19, 2008. + + In February 2010, he signed with the [[Mets de Guaynabo (basketball) | Guaynabo Mets]] along with former [[Chicago Bulls]] player [[Marcus Fizer]]. <ref> [http: //probasketballtalk.nbcsports.com/2010/02/antoine-walker-signs-in-puerto-rico.html Antoine Walker Signs In Puerto Rico] </ ref> Walker was released on April 1, 2010. <ref> [http: //thehoopsmarket.blogspot.com/2010/04/mets-de-guaynabo-release-antoine-walker.html Mets de Guaynabo release Antoine Walker] </ ref> + + On May 6, 2010, ESPN reported that Walker was trying to return to the NBA. <ref> http: //sports.espn.go.com/nba/news/story? id=5167188 </ref> On December 7, 2010, Walker was acquired by [[Idaho Stampede]] of the [[NBA Development League]]. It was reported in April 2012 that Walker had announced his retirement after two years with the Stampede. <ref> [https: //archive.is/20120723080727/http: //www.cnnsi.com/2012/basketball/nba/04/09/antoine.walker.ap/index.html? sct=hp_t2_a12 & eref=sihp] </ref> + + = = Personal life = = + [[File:20140614 Antoine Walker at the Nike Chi-League (1). JPG | thumbnail | right | Walker coaching in the Nike summer basketball Chi-League in 2014]] + Walker was previously engaged to reality star [[Evelyn Lozada]] of [[Basketball Wives]]. + = = = Legal troubles = = = + On January 5, 2009, Walker was arrested for [[driving under the influence]] in [[Miami Beach, Florida]]. <ref> http: //www.tmz.com/2009/01/05/antoine-walker-busted-for-dui/ #.T3OOZ9lWEpM </ref> <ref> {{cite web | url = http: //www.aolnews.com/2009/01/05/antoine-walker-arrested-for-drunk-driving/ | title = Archived copy | accessdate = 2012-03-28 | deadurl = yes | archiveurl = https: //web.archive.org/web/20131105200437/http: //www.aolnews.com/2009/01/05/antoine-walker-arrested-for-drunk-driving/ | archivedate = 2013-11-05 | df =}} </ ref> + + On July 15, 2009, Walker was charged with three felony counts of writing bad checks related to gambling debts he had incurred at three Las Vegas casinos. <ref name = gamblingdebts> [http: //www.boston.com/sports/basketball/celtics/articles/2009/07/15/gambling_woes_for_walker Gambling woes for Walker] </ ref> Walker was arrested on July 15 at [[Harrah's Casino]] in [[South Lake Tahoe]], [[Nevada]]. The charges stemmed from over $800,000 in gambling debts. Walker was in South Lake Tahoe to play in the [[American Century Celebrity Golf Classic]] the following day. <ref> {{cite web | url = http: //sports.espn.go.com/nba/news/story? id=4336288 | title = Walker Arrested at Lake Tahoe Cabaret | publisher = ESPN.com | accessdate = 2009-09-19}} </ ref> + + On June 30, 2010, Walker entered a plea of not guilty on felony bad check charges stemming from his failure to pay $770,000 in gambling losses to Caesars Palace and two other casinos in Las Vegas, according to the \"Las Vegas Review Journal\". <ref> http: //www.lvrj.com/news/walker-pleads-not-guilty-to-charges-tied-to-gambling-debts-97516504.html </ref> A year later, he pleaded guilty to one felony count of passing a bad check. Under the plea agreement, he did not face a prison term, and was put on probation and worked towards repaying the debt. <ref> {{cite web | last = Shine | first = Conor | title = NBA's Antoine Walker pleads guilty to felony check charges | url = http: //www.lasvegassun.com/news/2011/jun/28/antoine-walker-pleads-guilty-felony-check-charges/ | work = Las Vegas Sun | accessdate = June 29, 2011 | date = June 28, 2011}} </ ref> + + = = = Robberies = = = + In July 2000, Walker and former University of Kentucky teammate [[Nazr Mohammed]] were robbed outside a [[South Side, Chicago | South Side]] Chicago restaurant. <ref name = robbery> [http: //sports.espn.go.com/nba/news/story? id=2931152 Heat forward Walker robbed at home in Chicago] </ ref> On July 9, 2007, Walker and another individual were robbed at gunpoint by two offenders in his own house. The assailants made off with close to $200,000 worth of merchandise, including Walker's [[Mercedes-Benz | Mercedes]]. His car was later recovered having been stripped of its expensive aftermarket wheels and stereo system. Four men were charged in this robbery and two of them were also linked to the similar robbery of fellow NBA player, [[Eddy Curry]]. <ref name = robbery2> [http: //sports.espn.go.com/nba/news/story? id=4143282 & campaign=rss & source=NBAHeadlines \"Man who robbed Walker gets 21 years\" ], ESPN.com. May 5, 2009. </ ref> + + = = = Bankruptcy = = = + On May 18, 2010, Walker filed for Chapter 7 bankruptcy protection in the Southern District of Florida (Miami) as case number 10-23558 with total assets of $4.3 million and debts of $12.7 million. The filing listed four pieces of real estate including a $2.3 million Miami home that was underwater with a mortgage of $3.6 million, and three other properties in Chicago, one listed for $1.4 million. [[Nazr Mohammed]] paid half the fee of Walker's bankruptcy attorney. Walker's championship ring had to be sold off. In August 2013, Walker announced that he was debt-free. <ref> [http: //www.sportsworldnews.com/articles/4451/20130817/antoine-walker-bankrupt-update-debt-free-former-nba-star-opens.htm Antoine Walker Bankrupt Update: Debt-Free? Former NBA Star Opens Up About Financial Crisis, Says He's Ready To Move On] </ ref> Between 1996 and 2009, Walker earned more than $108 million from NBA salaries. <ref> {{cite web | title = Antoine Walker page at basketball-reference. com | url = https: //www.basketball-reference.com/players/w/walkean02.html | publisher = basketball-reference. com}} </ ref> + + = = = Broadcasting career = = = + Walker is now a basketball analyst on [[120 Sports]]. <ref> http: //www.120sports.com/video </ref> Walker was also hired by [[SEC Network]] as a basketball analyst. + + = = NBA career statistics = = + + {{NBA player statistics legend}} + {| class = \"wikitable\" + | - + | style = \"background: #afe 6ba; width:3 em;\" | † + | Denotes seasons in which Walker won an [[List of NBA champions | NBA championship]] + |} + + = = = Regular season = = = + + {{NBA player statistics start}} + | - + | align = \"left\" | [[1996--97 NBA season | 1996--97]] + | align = \"left\" | [[1996-97 Boston Celtics season | Boston]] + | \"' 82\" ' | | 68 | | 36.2 | | .425 | | .327 | | .631 | | 9.0 | | 3.2 | | 1.3 | | .6 | | 17.5 + | - + | align = \"left\" | [[1997--98 NBA season | 1997--98]] + | align = \"left\" | [[1997-98 Boston Celtics season | Boston]] + | \"' 82\" ' | | \"' 82\" ' | | 39.9 | | .423 | | .312 | | .645 | | \"' 10.2\" ' | | 3.3 | | \"' 1.7\" ' | | .7 | | 22.4 + | - + | align = \"left\" | [[1998--99 NBA season | 1998--99]] + | align = \"left\" | [[1998-99 Boston Celtics season | Boston]] + | 42 | | 41 | | 36.9 | | .412 | | \"' .369\" ' | | .559 | | 8.5 | | 3.1 | | 1.5 | | .7 | | 18.7 + | - + | align = \"left\" | [[1999--2000 NBA season | 1999--00]] + | align = \"left\" | [[1999-2000 Boston Celtics season | Boston]] + | \"' 82\" ' | | \"' 82\" ' | | 36.6 | | .430 | | .256 | | .699 | | 8.0 | | 3.7 | | 1.4 | | .4 | | 20.5 + | - + | align = \"left\" | [[2000--01 NBA season | 2000--01]] + | align = \"left\" | [[2000-01 Boston Celtics season | Boston]] + | 81 | | 81 | | 41.9 | | .413 | | .367 | | .716 | | 8.9 | | \"' 5.5\" ' | | \"' 1.7\" ' | | .6 | | \"' 23.4\" ' + | - + | align = \"left\" | [[2001--02 NBA season | 2001--02]] + | align = \"left\" | [[2001-02 Boston Celtics season | Boston]] + | 81 | | 81 | | \"' 42.0\" ' | | .394 | | .344 | | \"' .741\" ' | | 8.8 | | 5.0 | | 1.5 | | .5 | | 22.1 + | - + | align = \"left\" | [[2002--03 NBA season | 2002--03]] + | align = \"left\" | [[2002-03 Boston Celtics season | Boston]] + | 78 | | 78 | | 41.5 | | .388 | | .323 | | .615 | | 7.2 | | 4.8 | | 1.5 | | .4 | | 20.1 + | - + | align = \"left\" | [[2003--04 NBA season | 2003--04]] + | align = \"left\" | [[2003-04 Dallas Mavericks season | Dallas]] + | \"' 82\" ' | | \"' 82\" ' | | 34.6 | | .428 | | .269 | | .554 | | 8.3 | | 4.5 | | .8 | | .8 | | 14.0 + | - + | align = \"left\" | [[2004--05 NBA season | 2004--05]] + | align = \"left\" | [[2004-05 Atlanta Hawks season | Atlanta]] + | 53 | | 53 | | 40.2 | | .415 | | .317 | | .534 | | 9.4 | | 3.7 | | 1.2 | | .6 | | 20.4 + | - + | align = \"left\" | [[2004--05 NBA season | 2004--05]] + | align = \"left\" | [[2004-05 Boston Celtics season | Boston]] + | 24 | | 24 | | 34.5 | | \"' .442\" ' | | .342 | | .557 | | 8.3 | | 3.0 | | 1.0 | | \"' 1.1\" ' | | 16.3 + | - + | style = \"text-align: left; background: #afe 6ba;\" | [[2005--06 NBA season | 2005--06]] † + | align = \"left\" | [[2005-06 Miami Heat season | Miami]] + | \"' 82\" ' | | 19 | | 26.8 | | .435 | | .358 | | .628 | | 5.1 | | 2.0 | | .6 | | .4 | | 12.2 + | - + | align = \"left\" | [[2006--07 NBA season | 2006--07]] + | align = \"left\" | [[2006-07 Miami Heat season | Miami]] + | 78 | | 15 | | 23.3 | | .397 | | .275 | | .438 | | 4.3 | | 1.7 | | .6 | | .2 | | 8.5 + | - + | align = \"left\" | [[2007--08 NBA season | 2007--08]] + | align = \"left\" | [[2007-08 Minnesota Timberwolves season | Minnesota]] + | 46 | | 1 | | 19.4 | | .363 | | .324 | | .530 | | 3.7 | | 1.0 | | .7 | | .2 | | 8.0 + | - class = \"sortbottom\" + | style = \"text-align: center;\" colspan = \"2\" | Career + | 893 | | 707 | | 35.3 | | .414 | | .325 | | .633 | | 7.7 | | 3.5 | | 1.2 | | .5 | | 17.5 + | - class = \"sortbottom\" + | style = \"text-align: center;\" colspan = \"2\" | All-Star + | 3 | | 1 | | 13.3 | | .350 | | .300 | | .500 | | 2.0 | | 1.3 | | .7 | | .0 | | 6.0 + {{s-end}} + + = = = Playoffs = = = + + {{NBA player statistics start}} + | - + | align = \"left\" | [[2002 NBA Playoffs | 2002]] + | align = \"left\" | [[2001-02 Boston Celtics season | Boston]] + | 16 | | 16 | | 43.9 | | .411 | | .385 | | .781 | | 8.6 | | 3.3 | | 1.5 | | .4 | | \"' 22.1\" ' + | - + | align = \"left\" | [[2003 NBA Playoffs | 2003]] + | align = \"left\" | [[2002-03 Boston Celtics season | Boston]] + | 10 | | 10 | | \"' 44.0\" ' | | \"' .415\" ' | | .356 | | .500 | | 8.7 | | \"' 4.3\" ' | | \"' 1.7\" ' | | .4 | | 17.3 + | - + | align = \"left\" | [[2004 NBA Playoffs | 2004]] + | align = \"left\" | [[2003-04 Dallas Mavericks season | Dallas]] + | 5 | | 5 | | 28.0 | | .361 | | .100 | | .571 | | \"' 10.0\" ' | | 2.4 | | 1.2 | | .6 | | 9.8 + | - + | align = \"left\" | [[2005 NBA Playoffs | 2005]] + | align = \"left\" | [[2004-05 Boston Celtics season | Boston]] + | 6 | | 6 | | 37.3 | | .413 | | .368 | | .636 | | 7.3 | | 2.3 | | 1.2 | | \"' 1.0\" ' | | 16.7 + | - + | style = \"text-align: left; background: #afe 6ba;\" | [[2006 NBA Playoffs | 2006]] † + | align = \"left\" | [[2005-06 Miami Heat season | Miami]] + | \"' 23\" ' | | \"' 23\" ' | | 37.5 | | .403 | | .324 | | .574 | | 5.6 | | 2.4 | | 1.0 | | .3 | | 13.3 + | - + | align = \"left\" | [[2007 NBA Playoffs | 2007]] + | align = \"left\" | [[2006-07 Miami Heat season | Miami]] + | 4 | | 0 | | 23.0 | | .405 | | \"' .500\" ' | | \"' .818\" ' | | 2.3 | | 1.5 | | .5 | | .3 | | 11.8 + | - class = \"sortbottom\" + | style = \"text-align: center;\" colspan = \"2\" | Career + | 64 | | 60 | | 38.5 | | .406 | | .352 | | .663 | | 7.1 | | 2.9 | | 1.2 | | .4 | | 16.1 + {{s-end}} + + = = See also = = + * [[List of National Basketball Association career 3-point scoring leaders]] + * [[List of National Basketball Association career turnovers leaders]] + + = = Notes = = + {{reflist | 30em}} − = = Gallery = = + = = External links = = − <gallery> + * {{basketballstats | nba = Antoine_Walker}} − AntoineWalker. jpg + * [https: //www. basketball-reference. com/players/w / walkean02. html Walker's Career Stats] − </ gallery> + * [https: / / web.archive.org/web/20100617211509/http: //bankruptcy4austin.com/2010/05/29/attorney/lawyer/antoine-walker-files-for-bankruptcy-view-the-documents-here/ Antoine Walker Bankruptcy Documents] {{DEFAULTSORT: Walker, Antoine}} {{DEFAULTSORT: Walker, Antoine}} Latest revision as of 13:54, March 20, 2018 Antoine Walker Walker at the NBAPA All-Star Players Social in 2015 Personal information Born August 12, 1976 (1976-08-12) (age 41) Chicago, Illnois Nationality American Physical stats Listed height 6 ft 9 (2.06 m) Listed weight 265 lbs (120 kg) Career information High school Mount Carmel (Chicago Illinois) College Kentucky (1994-1996) NBA Draft 1996 / Round: 1 / Pick: 6th Selected by the Boston Celtics Playing career 1996-2012 Position Power forward Career history 1996-2003 Boston Celtics 2003-2004 Dallas Mavericks 2004-2005 Atlanta Hawks 2005-2007 Miami Heat 2008 Minnesota Timberwolves 2008 Memphis Grizzlies 2010 Guaynabo Mets 2010-2012 Idaho Stampede Career highlights and awards NBA champion (2006) 3 × NBA All-Star (1998, 2002, 2003) NBA Three-Point Field Goals leader (2001) NBA All-Rookie Team (1997) NCAA champion (1996) Antoine Walker at NBA.com Antoine Devon Walker (born August 12, 1976) is an American former professional basketball player. He was drafted with the sixth overall pick in the 1996 NBA Draft out of the University of Kentucky and played in the NBA from 1996 to 2008. Walker played for the Celtics, Mavericks, Hawks, Heat, Timberwolves, the BSN's Mets and the NBA D-League's Stampede before retiring from basketball in 2012. Walker, a three-time NBA All-Star, won an NCAA championship with Kentucky in 1996 and an NBA championship with the Miami Heat in 2006. Contents [show] Pre-NBA career Edit Walker attended Mount Carmel High School, in Chicago, where he played with future NFL quarterback Donovan McNabb and attained all-state status as a senior, earning a full scholarship to play for Rick Pitino at the University of Kentucky. He was a starting forward on the Wildcats' 1996 NCAA Men's Division I Basketball Championship Game - winning team. As a freshman at Kentucky he was named SEC Tournament MVP. In his sophomore year, Walker was named All-SEC First, All-SEC Tournament and to the All-NCAA Regional Teams. Professional career Edit Boston Celtics Edit After Walker's sophomore season, he declared for the 1996 NBA draft and was picked sixth overall by the Boston Celtics. In the 1996--1997 season, Walker made the All-Rookie First Team and led the team in scoring (17.5 ppg) and rebounding (9.0), as the team had its worst season in franchise history, 15--67. The following season, Pitino was reunited with Walker as the new coach of the Celtics, and he made the All-Star team as a reserve while averaging 22.4 ppg and 10.2 rpg. He also scored a career-high 49 points in a loss against the Washington Wizards. In the '98 draft, the Celtics had the 10th pick and chose swing man Paul Pierce. The next few years, Pierce and Walker were the 1--2 punch for the Celtics. In the 2001--2002 season, Walker had his best overall season by helping lead the Celtics to a 49--33 record and their first playoff berth in seven years. He was second on his team in scoring (22.0), first in rebounds (9), and first in assists, (5.0). Pierce and Walker took the team to the Eastern Conference finals, where they fell to the New Jersey Nets in six games. The next season, Walker made his third All-Star team. On February 20, 2002, former Kentucky teammate Tony Delk was traded to the Celtics, reuniting Walker with him. Dallas Mavericks and Atlanta Hawks Edit Nine and one-half days before the start of the 2003--04 season, Walker was traded with Delk to the Dallas Mavericks for Raef LaFrentz, <mark>Chris Mills</mark>, and Jiří Welsch. Walker was used in a relatively limited capacity on his new team due to the number of high-caliber players populating the Mavericks' roster. Included on that team was Antawn Jamison, newly acquired from the Golden State Warriors. On August 8, 2004 Walker and Delk were traded again, this time to the Atlanta Hawks for Jason Terry, longtime Hawk <mark>Alan Henderson</mark> and a draft pick. Return to Boston Edit On February 24, 2005, Walker was traded back to the Celtics in a deal that sent <mark>Gary Payton</mark>, Tom Gugliotta, <mark>Michael Stewart</mark>, and a first-round draft pick to the Hawks [1] (<mark>Payton</mark> was released by the Hawks and re-signed with Boston for the remainder of the season). Walker started all 24 remaining games for the Celtics, averaging 16.3 points and 8.3 rebounds a game as the Celtics advanced to the playoffs before losing to the Indiana Pacers in a 7-game first round series. Miami Heat Edit File: Antoine Walker Miami Heat. jpg On August 2, 2005, Walker was involved in a five-team, 13-player deal (the largest trade in NBA history) that sent him from the Celtics to the Miami Heat. The Celtics received Curtis Borchardt, Qyntel Woods, and a handful of draft picks in Walker's stead. The Heat played Walker mostly off the bench, and he rotated between both forward positions. Though he struggled early to adjust to this role, by the end of the season he was a force for the Heat, finishing the season with averages of 12.2 points and 5.1 rebounds a game as the team's main scorer off the bench. Walker also led the team in overall 3-point shots made for the season, and increased his 3-point, free throw and overall shooting percentages. In the playoffs his production would increase, as he would be the third leading scorer for the team while making crucial three-point baskets and posting 20 points in four different playoff games including 23 against the New Jersey Nets in the closing game of the conference semifinals. Miami advanced to the NBA Finals and faced the Dallas Mavericks, with Walker posting 13.8 points per game in the series as the Heat won the NBA championship in 6 games. In the title clinching sixth game in Dallas, Walker contributed 14 points and 11 rebounds. Walker's production dipped in the 2006--2007 season as he averaged 8.5 points a game and 4.3 rebounds. The Heat failed to repeat as champions following a first round loss to the Chicago Bulls. Minnesota Timberwolves and Memphis Grizzlies Edit On October 24, 2007, Walker was traded to the Minnesota Timberwolves along with Michael Doleac, Wayne Simien, a first-round draft pick and cash considerations in exchange for <mark>Ricky Davis</mark> and <mark>Mark Blount</mark>. [2] [3] [4] On June 27, 2008, Walker was dealt to the Memphis Grizzlies along with Marko Jarić, Greg Buckner, and the rights to O. J. Mayo, for <mark>Mike Miller</mark>, Brian Cardinal, <mark>Jason Collins</mark>, and the rights to <mark>Kevin Love</mark>. [5] After appearing in just two preseason games and remaining inactive throughout the opening months of the regular season, [6] he was waived by the Grizzlies on December 19, 2008. In February 2010, he signed with the Guaynabo Mets along with former Chicago Bulls player Marcus Fizer. [7] Walker was released on April 1, 2010. [8] On May 6, 2010, ESPN reported that Walker was trying to return to the NBA. [9] On December 7, 2010, Walker was acquired by Idaho Stampede of the NBA Development League. It was reported in April 2012 that Walker had announced his retirement after two years with the Stampede. [10] Personal life Edit File:20140614 Antoine Walker at the Nike Chi-League (1). JPG Walker was previously engaged to reality star Evelyn Lozada of Basketball Wives. Legal troubles Edit On January 5, 2009, Walker was arrested for driving under the influence in Miami Beach, Florida. [11] [12] On July 15, 2009, Walker was charged with three felony counts of writing bad checks related to gambling debts he had incurred at three Las Vegas casinos. [13] Walker was arrested on July 15 at Harrah's Casino in South Lake Tahoe, Nevada. The charges stemmed from over $800,000 in gambling debts. Walker was in South Lake Tahoe to play in the American Century Celebrity Golf Classic the following day. [14] On June 30, 2010, Walker entered a plea of not guilty on felony bad check charges stemming from his failure to pay $770,000 in gambling losses to Caesars Palace and two other casinos in Las Vegas, according to the Las Vegas Review Journal. [15] A year later, he pleaded guilty to one felony count of passing a bad check. Under the plea agreement, he did not face a prison term, and was put on probation and worked towards repaying the debt. [16] Robberies Edit In July 2000, Walker and former University of Kentucky teammate Nazr Mohammed were robbed outside a South Side Chicago restaurant. [17] On July 9, 2007, Walker and another individual were robbed at gunpoint by two offenders in his own house. The assailants made off with close to $200,000 worth of merchandise, including Walker's Mercedes. His car was later recovered having been stripped of its expensive aftermarket wheels and stereo system. Four men were charged in this robbery and two of them were also linked to the similar robbery of fellow NBA player, Eddy Curry. [18] Bankruptcy Edit On May 18, 2010, Walker filed for Chapter 7 bankruptcy protection in the Southern District of Florida (Miami) as case number 10-23558 with total assets of $4.3 million and debts of $12.7 million. The filing listed four pieces of real estate including a $2.3 million Miami home that was underwater with a mortgage of $3.6 million, and three other properties in Chicago, one listed for $1.4 million. Nazr Mohammed paid half the fee of Walker's bankruptcy attorney. Walker's championship ring had to be sold off. In August 2013, Walker announced that he was debt-free. [19] Between 1996 and 2009, Walker earned more than $108 million from NBA salaries. [20] Broadcasting career Edit Walker is now a basketball analyst on 120 Sports. [21] Walker was also hired by SEC Network as a basketball analyst. NBA career statistics Edit Legend GP Games played GS Games started MPG Minutes per game FG% Field-goal percentage 3P% 3-point field-goal percentage FT% Free-throw percentage RPG Rebounds per game APG Assists per game SPG Steals per game BPG Blocks per game PPG Points per game Bold Career high † Denotes seasons in which Walker won an NBA championship Regular season Edit Year Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 1996--97 Boston 82 68 36.2 .425 .327 .631 9.0 3.2 1.3 .6 17.5 1997--98 Boston 82 82 39.9 .423 .312 .645 10.2 3.3 1.7 .7 22.4 1998--99 Boston 42 41 36.9 .412 .369 .559 8.5 3.1 1.5 .7 18.7 1999--00 Boston 82 82 36.6 .430 .256 .699 8.0 3.7 1.4 .4 20.5 2000--01 Boston 81 81 41.9 .413 .367 .716 8.9 5.5 1.7 .6 23.4 2001--02 Boston 81 81 42.0 .394 .344 .741 8.8 5.0 1.5 .5 22.1 2002--03 Boston 78 78 41.5 .388 .323 .615 7.2 4.8 1.5 .4 20.1 2003--04 Dallas 82 82 34.6 .428 .269 .554 8.3 4.5 .8 .8 14.0 2004--05 Atlanta 53 53 40.2 .415 .317 .534 9.4 3.7 1.2 .6 20.4 2004--05 Boston 24 24 34.5 .442 .342 .557 8.3 3.0 1.0 1.1 16.3 2005--06 † Miami 82 19 26.8 .435 .358 .628 5.1 2.0 .6 .4 12.2 2006--07 Miami 78 15 23.3 .397 .275 .438 4.3 1.7 .6 .2 8.5 2007--08 Minnesota 46 1 19.4 .363 .324 .530 3.7 1.0 .7 .2 8.0 Career 893 707 35.3 .414 .325 .633 7.7 3.5 1.2 .5 17.5 All-Star 3 1 13.3 .350 .300 .500 2.0 1.3 .7 .0 6.0 Playoffs Edit Year Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 2002 Boston 16 16 43.9 .411 .385 .781 8.6 3.3 1.5 .4 22.1 2003 Boston 10 10 44.0 .415 .356 .500 8.7 4.3 1.7 .4 17.3 2004 Dallas 5 5 28.0 .361 .100 .571 10.0 2.4 1.2 .6 9.8 2005 Boston 6 6 37.3 .413 .368 .636 7.3 2.3 1.2 1.0 16.7 2006 † Miami 23 23 37.5 .403 .324 .574 5.6 2.4 1.0 .3 13.3 2007 Miami 4 0 23.0 .405 .500 .818 2.3 1.5 .5 .3 11.8 Career 64 60 38.5 .406 .352 .663 7.1 2.9 1.2 .4 16.1 See also Edit List of National Basketball Association career 3-point scoring leaders List of National Basketball Association career turnovers leaders Notes Edit ↑ Walker returns to Celtics in shocker. Updated February 25, 2005 ↑ By trading two more veteran starters, Wolves grow even younger, October 24, 2007 ↑ Ira Winderman, Riley's trade stokes the Heat Template: Webarchive, South Florida Sun-Sentinel ↑ Wolves Nab First-Round Pick and Three Players From Heat ↑ Wolves pick Mayo, swap him for <mark>Love</mark> in 8-player deal ↑ http: //www.commercialappeal.com/news/2008/dec/15/grizzlies-to-give-walker-a-contract-buyout/ ↑ Antoine Walker Signs In Puerto Rico ↑ Mets de Guaynabo release Antoine Walker ↑ http: //sports.espn.go.com/nba/news/story? id=5167188 ↑ [1] ↑ http: //www.tmz.com/2009/01/05/antoine-walker-busted-for-dui/ #.T3OOZ9lWEpM ↑ \"Archived copy\". Archived from the original on 2013-11-05. https: //web.archive.org/web/20131105200437/http: //www.aolnews.com/2009/01/05/antoine-walker-arrested-for-drunk-driving/. Retrieved 2012-03-28. ↑ Gambling woes for Walker ↑ \"Walker Arrested at Lake Tahoe Cabaret\". ESPN.com. http: //sports.espn.go.com/nba/news/story? id=4336288. Retrieved 2009-09-19. ↑ http: //www.lvrj.com/news/walker-pleads-not-guilty-to-charges-tied-to-gambling-debts-97516504.html ↑ Shine, Conor (June 28, 2011). \"NBA's Antoine Walker pleads guilty to felony check charges\". Las Vegas Sun. http: //www.lasvegassun.com/news/2011/jun/28/antoine-walker-pleads-guilty-felony-check-charges/. Retrieved June 29, 2011. ↑ Heat forward Walker robbed at home in Chicago ↑ \"Man who robbed Walker gets 21 years\" , ESPN.com. May 5, 2009. ↑ Antoine Walker Bankrupt Update: Debt-Free? Former NBA Star Opens Up About Financial Crisis, Says He's Ready To Move On ↑ \"Antoine Walker page at basketball-reference. com\". basketball-reference. com. https: //www.basketball-reference.com/players/w/walkean02.html. ↑ http: //www.120sports.com/video External links Edit Template: Basketballstats Walker's Career Stats Antoine Walker Bankruptcy Documents Retrieved from \"http: //basketball.wikia.com/wiki/Antoine_Walker? oldid=59780\" Categories: Pages with broken file links Born in 1976 American basketball players National Basketball Association players Players who wear/wore number 8 Players who won the NBA Championship Kentucky Alumni Retired Power Forwards NBA All-Star participants Boston Celtics draft picks Boston Celtics players Dallas Mavericks players Atlanta Hawks players Miami Heat players Minnesota Timberwolves players NBA D-League players Idaho Stampede players Players who won the NCAA Championship", "articleID": "2018032014_00233596_W", "names": {"Alan Henderson": ["Q2324397", "Q4706852"], "Chris Mills": ["Q1626618", "Q17306289", "Q26922398", "Q5107467", "Q51624478"], "Gary Payton": ["Q1494855", "Q309872"], "Jason Collins": ["Q2317740", "Q6161884"], "Kevin Love": ["Q297221", "Q6396801"]}}]