[{"date": "2018-03-29", "url": "http://www.whio.com/news/new-moraine-city-manager-get-145k-return-his-home-county/tFKqovosTxxWIMrzfYECtO/", "content": ">> Read more trending news TMZ reported that, according to unnamed sources, Emily B, 37, called police and told them Fabolous, 40, had hit her. Fabolous was with his attorney at the police station. According to TMZ, he was cited for the alleged assault and given a ticket for his court appearance. He did not go to jail. According to HipHopDX, Fabolous and Emily have been together for over 10 years. Although Fabolous has not commented directly on the report, HipHopDX reported he posted \"2018 tryna break my heart,\" in an Instagram story early Thursday. Billboard reported that the rapper, whose real name is <mark>John Jackson</mark>, has two kids with Emily, Jonas, 2, and Johan, 10. Trending - Most Read Stories Carpenter seeks to win 7th straight countywide election \"They saw that bicycle as a symbol of hard work,\" said the four-term township trustee. Now he campaigns for Butler County Commission, running against incumbent Commissioner Cindy Carpenter for the GOP nomination in the May 8 primary. He has since upgraded from his bike to a small Segway which allows him to go door-to-door faster. And that one-on-one contact with voters is at the heart of his campaign. \"People see this as shoe-leather politics, going door-to-door, and people see that you are hard-working and honest,\" said Wong. But being a politician, and in campaigning, Wong said he has developed a thick skin. \"I've been to some houses, they've slammed the door on me,\" he said. \"It's life; you have to have thick skin .\" This month, this news organization is profiling the two candidates vying for the Republican nomination in the Butler County Commission race. This is the second of those profiles. Wong came to America in 1971 as a student in Chicago, and never had an interest in becoming a politician or going into public office. That all changed after he was attacked. \"That changed the course of my career,\" he said. CAMPAIGN 2018: What candidates for notable Butler County officers can do to win in May He enlisted in the Army and spent 20 years there from 1975 to 1995, most of that time as a special agent in the Criminal Investigations Division. He later took a job with Butler County in the court's probation department. \"I want to make this a better community than how I found it,\" Wong said. \"This is why I am involved in civic matters .\" And now that he's fully retired, he said he has the time to do it. Wong was the first candidate <mark>Bob Higgins</mark> on Cherry Blossom Lane in Liberty Twp. saw as he went door-to-door a couple of weeks ago in the Four Bridges neighborhood. He appreciated Wong taking the time to hear from the public. \"We don't know about the people we're voting for if we just see a picture until we can come out, shake their hand and know about them as a person,\" said <mark>Higgins</mark>, who is undecided on who he'll support on May 8. While there are many issues the County Commission will have to deal with in the future--from population growth and infrastructure needs to jobs and the economy--Wong said the top issue he hears from voters is about property taxes. \"The property tax is too high. This area (in the Four Bridges neighborhood), they pay over $10,000 (a year).\" He said there needs to be some control on the levies because people are paying too much. \"In West Chester, we stretch the levies. Our police levy, we'll stretch a five-year levy for five or 10 more years,\" he said. \"You've got to stretch it .\" Some, including Carpenter, have questioned Wong for running for an office just months after winning an election. But Wong said as a probation officer with Butler County, he could not seek a partisan office. He's since retired, and also said, \"I have enough experience to do it for the larger office .\" But this is the largest office Wong said he intends to seek, saying, \"I want to stay local .\" \"This is where I would serve best,\" he said. \"I'm a people person. I get out and people know me. Most of the people have seen me before .\" Wong did unsuccessfully attempt to seek the Butler County GOP's recommendation to succeed former lawmaker Margy Conditt as the 52nd Ohio House District appointment this past September. The Ohio House appointed former West Chester Twp. Trustee <mark>George Lang</mark> to that seat. Trending - Most Read Stories PHOTOS: Check out this nearly $1M Beavercreek home with outdoor pool \"The memory of someone's birth is not important but the memory of someone's death is much more important because its about what they've done and who they are,\" said Daryl Ward, pastor at Omega Baptist Church. \"That's why April 4 is so important to me .\" Locally, Carillon Park, the University of Dayton, Wright State University and Omega Baptist Church are expected to participate and organizers said dozens of others will too. The commemoration is a \"fitting tribute\" to <mark>King</mark>, said Brady Kress, president and CEO of Dayton History which oversees Carillon Historical Park. The park has tolled its bells to mark just a few occasions, including the anniversary of the death of former president John F. Kennedy as well as the attacks on Pearl Harbor and Sept. 11, 2001, Kress said. \"This is one that we thought we'd do and was the right thing to do,\" said Brady Kress, president of Dayton History. \"We wanted to pay our respects .\" <mark>King</mark> visited the Dayton region several times and has dozens of connections to the area. He gave commencement speeches at Central State University, Wilberforce University and Antioch College. His wife, Coretta <mark>Scott King</mark>, was also an activist and graduate of Antioch, where a building now bares her name. In 1964 <mark>King</mark> spoke at UD and he was also presented the key to the city. RELATED: Ohio State says a high GPA works against young women job hunters Along with the bell toll, both Wright State and UD will host activities to honor <mark>King</mark>. At Wright State, students will be able to watch a live stream of programs taking place at the National Civil Rights Museum beginning at 11 a.m. and students and community members will gather at the campus ministry center at 7 p.m. to reflect on <mark>King</mark>'s death, according to the university. UD will host a viewing of the last speech <mark>King</mark> right before he was assassinated at 7 p.m. on Tuesday and the public is invited to gather at the university's memorial to <mark>King</mark> for a brief remembrance at noon on Wednesday followed by a procession to a 12:30 p.m. Mass.. Terri Freeman, a UD alumna who serves as president of the National Civil Rights Museum will speak at an event int he Kennedy Union ballroom at 7 p.m., April 12, according to the university. The year of <mark>King</mark>'s assassination--1968--was a challenging one for Americans, said said Roger Crum, a UD art history professor and member of the school's planning committee that helped organize the April events for <mark>King</mark>. In a lot of ways, the tensions of 1968 are similar to cultural and racial issues that erupted recently in response to police brutality and the violence in Charlottesville, Virginia, he said. \"These are not strictly historical issues. They remain contemporary issues,\" Crum said. Below we have listed a few recipes that are sure to be a hit: Peeps Make use of seasonal peeps to add extra decoration and make your dessert stand out. Hot cross buns Hot cross buns isn't just a song you had to play on that recorder in fifth grade, but a traditional treat this time of year. A 12th-century monk was the first to mark the buns with a cross when he was baking them on Good Friday. The buns gained in popularity in England until they became a symbol for the holiday weekend, according to Smithsonian.com. Easter Bunny No Easter is complete without a visit from the Easter Bunny. With these sweet treats, family members and children are sure to have a hoot. Rice Krispies nest Add some color to your dessert table with these festive colorful nests. Marshmallow bark For those who have a sweet tooth and love four-ingredient recipes, this is the one for you. Chocolate lasagna Any family get-together is not complete without having a little chocolate (or a lot). This dish is sure to have your family talking for years to come. Trending - Most Read Stories", "articleID": "2018032915_00074857_W", "names": {"George Lang": ["Q129737", "Q48784746", "Q5541536"], "John Jackson": ["Q11978993", "Q14951093", "Q1700314", "Q19874601", "Q25171910", "Q27898568", "Q44476143", "Q51589313", "Q6241376", "Q6241393", "Q6241395"], "Scott King": ["Q2260899", "Q3952845", "Q58926388", "Q6379730", "Q7436621"]}}, {"date": "2018-03-29", "url": "http://dailycaller.com/2018/03/29/trumps-wax-statue-yak-squirrel-hair/", "content": "Politics <mark>Trump</mark>'s Wax Statue Includes Bovine And Squirrel Hair Saagar Enjeti White House Correspondent 1:07 PM 03/29/2018 Pinterest Reddit LinkedIn WhatsApp Share TOP President <mark>Donald Trump</mark>'s wax statue at the popular Madame Tussauds wax museum includes a mix of human, yak and squirrel hair. Of interest: pic.twitter.com/RsoyRWX7Rp--Jacqueline Alemany (@ JaxAlemany) March 29, 2018 \"His hair is a mixture of human hair and yak hair,\" Tussaud hairstylist Kelly Cox told CNN in January 2017. \"We use yak hair with people with white hair because human hair is not readily available .\" Museum hair inserter Sophie Crudginton told the Dallas News in November 2016 that the yak hair was specifically from the belly of the bovine species, declaring \"it is 100 percent belly yak hair .\" Museum workers also told CNN that squirrel hair was used for the President's signature bushy eyebrows. The statue was recently put on full display after <mark>Trump</mark> canceled a visit to London and the museum decided to place it outside the U.S. Embassy. Madame Tussauds trolls <mark>Trump</mark> by moving his wax statue to London embassy after canceled visit https: //t.co/AQbP152Txu pic.twitter.com/5GRQhmV13E--The Hill (@ thehill) January 13, 2018 Follow Saagar Enjeti on Twitter Tags: <mark>Donald Trump</mark> Hide Comments Show comments", "articleID": "2018032918_00024020_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2018-03-29", "url": "https://www.nytimes.com/2018/03/29/technology/microsoft-reorganizes-to-fuel-cloud-and-ai-businesses.html?partner=rss&emc=rss", "content": "Photo In an email to employees on Thursday, Microsoft chief executive Satya Nadella cited the central role of cloud computing and the advances in artificial intelligence as reasons for a reorganization. Credit <mark>Bryan Thomas</mark> for The New York Times The Windows era at Microsoft, long in eclipse, is officially history. Microsoft said on Tuesday that it was splitting up its Windows engineering team and that the leader of its Windows business was leaving. The moves, analysts said, were part of a reorganization intended to accelerate Microsoft's emphasis on newer, faster-growing businesses like cloud computing and data-fueled artificial intelligence. That shift, they noted, has been underway since Satya Nadella became chief executive in 2014. In an email to employees, Mr. Nadella cited the central role of cloud computing and the advances in artificial intelligence--and their potential across all the company's products. The organizational overhaul, Mr. Nadella wrote, \"enables us to step up to this opportunity .\" Terry Myerson, 45, executive vice president of Microsoft's Windows and devices group, will be departing. In a separate email to employees, Mr. Myerson said that he supported the company's evolution under Mr. Nadella. \"I believe in it, and these changes are great for Microsoft,\" wrote Mr. Myerson, who worked for the company for 21 years. Continue reading the main story But with the revamp, the Windows group will be smaller and its engineering efforts dispersed. Windows technology, analysts said, will increasingly be folded into Microsoft's cloud software. Other engineers will create the user applications--\"Windows experiences,\" in Microsoft terms--that ride on top of the underlying software, in smartphones, tablets, personal computers and game consoles. Photo Terry Myerson, executive vice president of Microsoft's Windows and devices group, will be departing as part of the reorganization. Credit Eric Risberg/Associated Press Today, cloud services from Amazon, Microsoft and Google have become the internet equivalent of Windows, the dominant operating system of the personal computer era. Software developers write new applications to run on the cloud services, just as they once did for the Windows operating system. Microsoft has successfully rewritten its popular Office productivity products as web-based applications running on the cloud. The reorganization is \"really doubling down on the cloud as the fundamental platform for Microsoft,\" said Ed Anderson, an analyst at Gartner. Newsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. See Sample Manage Email Preferences Not you? Privacy Policy Opt out or contact us anytime Microsoft's cloud business is powering its growth. In the most recent quarter, its Azure business grew 98 percent and its cloud-based Office 365 offering by 41 percent. By contrast, the division that includes the Windows PC software increased 2 percent. The formal relegation of the Windows franchise, said Michael Cusumano, a professor at the Massachusetts Institute of Technology's Sloan School of Management, \"has been a long time coming .\" And such a transition, Mr. Cusumano said, \"probably had to be done by a second or third generation of leader .\" Mr. Nadella succeeded Steven A. Ballmer, the longtime ally and friend of Microsoft's co-founder, Bill Gates. Beyond the organizational changes, Mr. Nadella said in his email that Microsoft's research leader, <mark>Harry Shum</mark>, and president, <mark>Brad Smith</mark>, have established a panel, the A.I. and Ethics in Engineering and Research Committee, to increase the odds that A.I. technology \"benefits the broader society .\" That move, said Patrick Moorhead, an independent analyst, is Microsoft's effort to show it is \"serious about the broader implications of A.I.\" at a time of rising concern about the technology's influence on people's behavior and as a threat to jobs. Continue reading the main story We're interested in your feedback on this page. Tell us what you think.", "articleID": "2018032920_00204296_W", "names": {"Brad Smith": ["Q15477554", "Q16218831", "Q23664265", "Q24084114", "Q2923428", "Q4954263", "Q4954264", "Q4954266", "Q4954267", "Q4954269", "Q4954270", "Q50300377"], "Bryan Thomas": ["Q4980418", "Q4980419", "Q54922057"], "Harry Shum": ["Q16905622", "Q348649"]}}, {"date": "2018-03-31", "url": "http://www.rappler.com/life-and-style/travel/ph-travel/199245-misibis-bay-resort-nature-green-resort-albay", "content": "Enjoying nature in Albay's sole high-end green resort PH Travel Enjoying nature in Albay's sole high-end green resort Tourists are welcomed by a school of fish at the breakwater of the Marina Bay area of Misibis Bay Resort, less than 10 meters away from the shore Published 5:24 PM, March 31, 2018 Updated 5:28 PM, March 31, 2018 UNDER THE SEA. Tourists swim and glide with a school of fish at the Marina Bay area of Misibis Bay resort in Cagraray Island, Bacacay town. Photo by Rhaydz Barcia ALBAY, Philippines--In Albay's sole high-end resort situated in Cagraray Island in Bacacay town, tourists don't need to go far from the shoreline to catch a glimpse of colorful fish. Tourists are welcomed by a school of fish at the breakwater of the Marina Bay area of the Misibis Bay Resort, less than 10 meters away from the shore. <mark>Stephen Harris</mark>, a Canadian tourist along with his Filipina wife Celeste snorkeled within the Marina area of the resort. The couple returned to Misibis Bay Resort after 9 years. \"We're supposed to be heading to Catanduanes but we decided to go back in Misibis 9 years after our first visit here. It was an amazing experience again with a lot of development, with healthy corals home of different colorful fish and of marine life,\" <mark>Stephen</mark> said. <mark>Stephen</mark> did not use any GoPro underwater camera to capture the rich marine life. He described the bay as a \"paradise\" with clean water and rejuvenating coral reefs. Green resort Misibis Bay is a resort with a fish sanctuary, and is to home giant clams. Located in Barangay Misibis, the resort known for its white sand beach is the first high-end \"green\" resort in Bicol as it is powered by solar panels. Cecille Balala, associate engineering manager of Misibis Bay, said that the solar panels genetate 310 kwh per day. Businessman Elizaldy \"Zaldy\" S. Co of Sunwestville Realty and Development Corporation developed Misibis Bay and Residential Resort. Co wants to put Bicol on the world map. \"We put up this resort to change the perception that Bicol can be proud no more than Mayon Volcano .\" Co said, adding that the resort was built with enviromental protection in mind. The resort counts as among its guests world leaders, local celebrities, Hollywood actors, international models and beauty queens, and NBA players. Natural beauty On the way to the resort, visitors can stop to appreciate panoramic views of islets with Mayon volcano as a backdrop; Sula Channel, which used to provide sanctuary galleons during typhoons when the country was still under Spanish rule; and Albay Gulf and the rolling mountains. From the resort, one can walk head to caves which houses limestone formations. Pototan Cave in neighboring Batan Island can be reached by boat. Just 20 minutes from the resort is Pighologan Cave. After a half-hour boat ride through the underground riven, tourists can visit the monkey sanctuary in Manaet Islet. Historically, Cagraray Island in Bacacay town where the Misibis Bay Resort is located is considered as a historical jewel because of the archeological relics found there between l879 and 188. <mark>Juan Alvarez</mark> Guevarra found sacred burial jars in two of at least 28 caves in the island. Local historians suggest that these archeological evidences could prove that Cagraray Island was the cradle of Bicolano civilization about 200,000 to 300,000 years ago. The construction of a coastal road network in Cagraray Island is underway former Bicol tourism regional director Maria Nini Ong-Ravanilla worked out the development of Cagraray Island with the help of Albay lawmakers .--Rappler.com", "articleID": "2018033109_00085814_W", "names": {"Juan Alvarez": ["Q5953695", "Q6298824"], "Stephen Harris": ["Q27832749", "Q32103448", "Q56872533", "Q56872534", "Q7609429"]}}, {"date": "2018-03-31", "url": "http://www.thedrive.com/news/19805/one-of-gms-cruise-self-driving-cars-just-got-a-ticket-in-california", "content": "One of GM's Cruise Self Driving Cars Just Got a Ticket in California Cruise says that its car did nothing wrong. By Rob Stumpf March 31, 2018 News autonomy Bolt Chevy Cruise GM police self-driving technology General Motors SHARE Autonomous car development is having a rough month. From a self-driving Uber striking and killing a pedestrian in Arizona to Tesla's Autopilot being engaged in a fatal crash in California, the news just keeps piling up. Now, an autonomous Chevy Bolt by GM's autonomous division, Cruise, has been ticketed according to local news. The company disagrees and says it has the data to prove that no wrongdoing occurred. The car was pulled over by an officer on the streets of San Francisco for not yielding to a pedestrian in a crosswalk, according to reports. Cruise feels that this is an incorrect assertation of events. The Bolt was in an autonomous driving mode, meaning that its sensors were collecting data as it drove down the street and the car logged the information as it used it to make decisions on just how to operate. The data it collected suggests that the pedestrian was 10.8 feet away from the car while it passed through the intersection, insinuating that the car did nothing wrong. \"Safety is our priority in testing our self-driving vehicles,\" Cruise said in a statement. \"California law requires the vehicle to yield the right of way to pedestrians, allowing them to proceed undisturbed and unhurried without fear of interference of their safe passage through an intersection. Our data indicates that's what happened here .\" One concern that many have is the ability for autonomous cars to be \"bullied\" by pedestrians who walk into traffic or are otherwise aggressive with oncoming cars. As long as the technology is working right, we should be seeing autonomy being more adaptive to pedestrians who are in its path. Cruise stated that its systems were functioning as intended and followed all laws pertaining to pedestrians. The driver behind the wheel of the Bolt has been issued a ticket, according to the Bay Area news station. This brings into question just who should be held responsible for scenarios such as the one which Cruise found themselves in. If a ticket is issued, whether valid or not, while a car is in an autonomous driving mode, who is ultimately responsible for the illegal maneuver? Should drivers be expected to override the vehicle? These are all questions which further elaborate on the need for legislation surrounding self-driving cars. Since January 1, Oklahoma Has Ticketed 60 Left Lane Squatters By James Gilboy Posted in News Watch This Michigan Driver Roll His Car Trying to Avoid a Simple Speeding Ticket By Kyle Cheromcha Posted in News Hawaii Driver Gets Ticket for Honking at Police Car That Allegedly Cut Her Off By Kyle Cheromcha Posted in News Please Don't Try <mark>Gordon Ramsay</mark>'s Very Illegal Trick to Avoiding Speeding Tickets By Kyle Cheromcha Posted in News The Fast and the Furious Movies Are to Blame for Speeding Tickets By Basir Khan Posted in Sheet/Metal MORE TO READ RELATED Since January 1, Oklahoma Has Ticketed 60 Left Lane Squatters Our hats are off to the Oklahoma Highway Patrol. READ NOW RELATED Watch This Michigan Driver Roll His Car Trying to Avoid a Simple Speeding Ticket \"The conversation would have been easier,\" Michigan State Police tweeted. READ NOW RELATED Hawaii Driver Gets Ticket for Honking at Police Car That Allegedly Cut Her Off No one should be above the beep. READ NOW RELATED Please Don't Try <mark>Gordon Ramsay</mark>'s Very Illegal Trick to Avoiding Speeding Tickets Plastic wrap on the license plate? Rubbish, just rubbish. READ NOW RELATED The Fast and the Furious Movies Are to Blame for Speeding Tickets There is a correlation between the movies being released and motorists getting pulled over. READ NOW", "articleID": "2018033117_00229782_W", "names": {"Gordon Ramsay": ["Q15280", "Q22279905", "Q27557641"]}}]