[{"date": "2018-04-03", "url": "https://www.cnbc.com/2018/04/03/reuters-america-update-2-elliott-takes-1-bln-stake-pushes-for-changes-at-hyundai.html", "content": "* Reveals stakes in Hyundai Mobis, Hyundai Motor, Kia Motors * Calls for clearer plan to improve corporate governance * U.S. hedge fund previously took on S. Korea's top chaebol Samsung (Add background on Elliott, past campaigns, Samsung) SEOUL/NEW YORK, April 4 (Reuters) - A unit of activist hedge fund Elliott Management said on Wednesday that it holds more than $1 billion of shares in three key affiliates of South Korea's Hyundai Motor Group, and said more needs to be done to reform the company. In its latest challenge to South Korea's family-run conglomerates, Elliott Advisors called for \"a more detailed roadmap as to how it will improve corporate governance, optimize balance sheets, and enhance capital returns at each of the companies\" including Hyundai Mobis, Hyundai Motor and Kia Motors. South Koreas auto-to-steel giant Hyundai Motor Group announced a plan last week to streamline its complex ownership structure as it responds to calls from the government and investors to reform the countrys powerful family-controlled conglomerates or chaebols. The plan will be put to shareholders for approval on May 29, but worries that a proposed restructuring plan would benefit the parent groups controlling family ahead of companys shareholders hit shares. While Elliott said it was pleased that Hyundai Motor Group has taken a first step toward improving its corporate structure, it said in a statement that \"more needs to be done to benefit the companies and stakeholders .\" Under Hyundai's plan, parts supplier Hyundai Mobis is to spin off its domestic module and after-service parts businesses and merge them with logistics affiliate Hyundai Glovis backed by Hyundai's family members. But some investors and analysts said Mobis could be giving away cheaply what is seen as the more profitable part of its business. After the merger, parent Hyundai Motor Groups Chairman Chung Mong-koo and his son Chung Eui-sun, who is vice chairman, will buy stakes in Mobis held by other affiliates Kia Motors, Glovis and Hyundai Steel. \"Elliott looks forward to engaging with management and other stakeholders directly on these issues, and to offering recommendations regarding the proposed plan,\" it said. A Hyundai Motor spokesman in Seoul was not immediately available for comment outside business hours. Last year, South Koreas new antitrust chief told Reuters that he has been in talks with Hyundai Motor Group about unwinding its circular shareholdings, which critics say gives too much power to its controlling family at the expense of shareholders. His commission welcomed Hyundai's latest decision. Elliott's call adds to challenges for Hyundai, which is struggling from slowing sales in China and the United States, due to its delayed response to the sport utility vehicle segment, and Seouls diplomatic row with Beijing last year. BATTLE WITH CHAEBOLS Paul Singers $33 billion firm Elliott Management has taken on Samsung Group, South Korea's biggest family-run conglomerate, as well as the Li family, which founded Hong Kongs third-largest lender Bank of East Asia. In 2015, Elliott narrowly lost its battle to block a merger of two Samsung Group affiliates that would allow the controlling Samsung family to consolidate their holdings ahead of a leadership transition. Like Samsung, Hyundai has a large foreign investors base. In 2016, Elliott called on Samsung Electronics to introduce a transparent holding company structure and pay a 30 trillion won special dividend, among other demands. In 2017, Samsung rejected the call for a holding company, but announced plans to cancel its existing treasury shares worth over $35 billion by 2018. Founded by Singer in 1977, Elliott is renowned for winning cases against Peru and Argentina for repayment of debts they took on at a deep discount during their financial crises. While U.S. hedge funds used to rarely target Asia-based companies for activist campaigns, it is now becoming more popular. San Francisco-based activist hedge fund ValueAct Capital said late last month it was considering making its first investment in Japan. (Reporting by Hyunjoo Jin in Seoul and Liana B. Baker in New York; Editing by Adrian Croft and <mark>Tom Brown</mark>)", "articleID": "2018040320_00251247_W", "names": {"Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}}, {"date": "2018-04-05", "url": "https://vtdigger.org/2018/04/04/uvm-health-system-pitches-new-psychiatric-hospital-berlin/", "content": "Share Tweet Share Email The Senate Institutions Committee heard testimony Wednesday on a new proposal to overhaul the mental health system. Photo by Elizabeth Hewitt/VTDigger S tate officials are considering a dramatic realignment of Vermont's mental health system that could result in more inpatient beds, shorter waits and less pressure on the state's emergency rooms. The proposals--unveiled Wednesday in simultaneous meetings before the Green Mountain Care Board and the Senate Institutions Committee--feature a new \"acute inpatient\" mental health facility of still-undetermined size on the Central Vermont Medical Center campus in Berlin. That project would produce a ripple effect, allowing the current Vermont Psychiatric Care Hospital in Berlin to become a less-intensive \"secure residential\" facility to replace the much smaller Middlesex Therapeutic Community Residence. Because those changes would take several years, officials also are considering the addition of temporary mental health treatment capacity in either Swanton or Brattleboro. Taken together, the projects would represent tens of millions of dollars of investment. And some of that would come from University of Vermont Health System, which would allocate budget overages incurred by UVM Medical Center toward mental health projects. \"I think the intent on our part was to say, we recognize this need, and we want to be a participant in the solution,\" said Dr. Robert Pierattini, who chairs the Psychiatry Department at the University of Vermont College of Medicine. The proposed changes result from the collision of two seemingly unrelated issues: UVM Medical Center overshot its revenue target in fiscal year 2017, and the state's hospitals are dealing with an increasing number of mental health patients in emergency rooms. The Green Mountain Care Board, which regulates hospital budgets, has been considering how to address the fact that UVM Medical Center's net patient revenues exceeded its state-approved budget by $38.3 million last fiscal year. A few weeks ago, the board pitched a unique solution: UVM Medical faces a possible 3 percent rate cut penalty, but the rate cut could be alleviated if the hospital agrees to make a significant investment in the state's mental health system. That system is under strain. One indicator is the fact that many mental health patients are forced to spend extended periods in emergency rooms due to a lack of available inpatient beds. On Wednesday, the Vermont Association of Hospitals and Health Systems presented data to the care board showing that the total number of days mental health patients spent in emergency rooms jumped 28.6 percent from 2015 to 2016. The statistic increased by another 29.7 percent from 2016 to 2017, when mental health patients spent a total of 5,237 days in emergency rooms. Melissa Bailey, the commissioner of the Department of Mental Health. File Photo by Erin Mansfield/VTDigger The number of mental health patients showing up at emergency departments waxes and wanes. But in the past few weeks, \"it has picked back up with a fury,\" Mental Health Commissioner Melissa Bailey said. \"We have a number of people who are waiting .\" Bailey told the care board she could not propose a single policy solution to address the increasingly intense demands on the state's mental health system. \"I'd love to sit here and say there is one easy answer,\" she said. \"What I can tell you is, that's not possible .\" That's not to say, however, that there aren't answers. And some care board members believe their budget-regulation talks with UVM Medical Center may provide a way to ease pressure on the mental health system. While the board did not vote on the matter Wednesday, one option presented to members is allowing the hospital to set aside $21 million of its fiscal 2017 revenues in order to \"enhance inpatient mental health treatment capacity in Vermont .\" Pierattini presented a plan to do just that. The proposal's centerpiece is for Central Vermont Medical Center--which is part of University of Vermont Health System--to host a new inpatient psychiatric facility. It seems likely that officials will target a bed number higher than the current psychiatric hospital, which has 25 beds. But Pierattini said he could not commit to a size for the new facility. \"We don't have a number,\" he said. \"I think arriving at that number is going to require considerable deliberation .\" But Pierattini also said the facility \"has the potential to improve care in several ways .\" First and foremost, it could provide more treatment capacity for more-timely admissions. Also, Pierattini noted that Berlin is a central location that \"would serve the entire state .\" And he said the proposed hospital's proximity to Central Vermont Medical Center and other psychiatric facilities could be advantageous. \"There's an advantage of having things together in a closer, overall, operation,\" he said. \"You can just manage your resources more thoughtfully .\" Under UVM's preliminary plan, the state's psychiatric hospital would be transformed into a secure residential setting. That's meant as a place for mental health patients to go when they're ready for discharge from a psychiatric hospital but still require support and supervision. The state's Middlesex residential facility--which has just seven beds and was supposed to be temporary--would be phased out. Bailey was enthusiastic about the UVM plan. \"We're very pleased and really interested in exploring it more with them and getting into the details,\" she said. \"We think, for parity purposes, to have psychiatric care (become) part of the general hospital is absolutely the direction to go .\" Secretary of Human Services Al Gobeille. File photo by Mike Dougherty/VTDigger State Human Services Secretary Al Gobeille also threw his support behind the proposal to locate a new inpatient mental health facility at Central Vermont Medical Center. UVM Health Network is a good partner for the state because it is large enough to take on the task of running a major mental health unit, Gobeille said. \"This is not a small undertaking,\" he said. For that reason, it will take some time even if everything goes smoothly. UVM's proposed psychiatric facility would require a certificate of need from the care board, and there would be other planning and permitting work needed before the project could move forward. According to Gobeille, UVM Health System has estimated that the new mental health facility would take three to four years to be operational. So Gobeille, in his presentation to the Senate Institutions Committee, said the state should take smaller, more-immediate steps to expand Vermont's mental health treatment capacity until the UVM Health Network-run facility opens. One option would be to revamp a unit at Northwest Regional Correctional Facility in Swanton to make it a 12-bed facility that serves people who enter the mental health system through the courts. The administration pitched that idea earlier this year, but the House did not include funding for it in the fiscal 2019 budget approved last month. Another option would be a new facility. Gobeille said the state is considering some properties in Chittenden County or central Vermont to temporarily house mental health services, but he did not offer specifics. Gobeille also told lawmakers that \"the best idea\" for a temporary facility may be to partner with the Brattleboro Retreat to conduct repairs on a wing of that facility. The state would help cover the costs. No matter the solution, Gobeille emphasized the need for short-term mental health beds. \"If you don't do the temporary (treatment options), I think we've failed this session,\" he said. Sen. Peg Flory, R-Rutland, chair of the Senate Institutions Committee. On the left is Sen. Dick Mazza, D-Grand Isle. File photo by Erin Mansfield/VTDigger Sen. Peg Flory, R-Rutland and Institutions Committee chair, said there are a lot of questions about how the administration's proposal would work. She said she does not have enough details to know what steps the Legislature would need to take before the session ends in May. \"It's got a lot of moving parts, considering we have about a month left to get these sorted out,\" Flory said. She asked Agency of Human Services officials to put together more information about how the proposal would compare to the state's current mental health system. Flory acknowledged an immediate need to expand treatment capacity. However, she is wary of spending money out of the capital bill--which is paid for by issuing bonds--on temporary solutions. \"You can make a better decision if you know what your mid-term and long-term results are going to be,\" Flory said. \"But I'm not sure we'll have those definitive answers in time this year .\" VSEA Executive Director <mark>Steve Howard</mark>. File photo by Elizabeth Hewitt/VTDigger <mark>Steve Howard</mark>, who heads the Vermont State Employees' Association, said he has concerns that a partnership with UVM Health Network on a new acute-treatment facility would create potential cracks in the system that could leave some people without access to care. <mark>Howard</mark> also has concerns that the proposal would result in fewer state employee positions. But Green Mountain Care Board Chair Kevin Mullin said the new facility could improve quality of care and access to care while reducing hospital costs associated with emergency room stays. Mullin also said it's \"a question of parity .\" \"We say that there is parity between physical and mental health,\" he said. \"And yet, no one would ever allow somebody with a broken arm or a heart problem to sit in the emergency room for more than a week at a time while they were waiting for care .\" Share Tweet Share Email If you read us, please support us.", "articleID": "2018040501_00063491_W", "names": {"Steve Howard": ["Q23670647", "Q2457386", "Q7612886"]}}, {"date": "2018-04-05", "url": "http://sfgate.com/sports/article/Guardiola-set-to-come-up-short-again-in-Champions-12807378.php?cmpid=overnight", "content": "https: //www.sfgate.com/sports/article/Guardiola-set-to-come-up-short-again-in-Champions-12807378.php Guardiola set to come up short again in Champions League Steve Douglas, Ap Sports Writer Updated 3:39 am, Thursday, April 5, 2018 LIVERPOOL, England (AP)--Pep Guardiola was ridiculed when he backed Barcelona to mount a historic comeback from 4-0 down against Paris Saint-Germain in the Champions League last season. Back then, the former Barcelona player and coach warned that Spanish team \"will be back and prove you wrong .\" He was right about that, Barcelona won the second leg 6-1. But with a similar deficit facing Manchester City, Guardiola didn't sound quite as convinced. \"In this room, I think there is nobody, except the guy talking to you, who believes we can go through,\" the Spaniard said after City's 3-0 loss at Liverpool in the first leg of the Champions League quarterfinals. \"There are 90 minutes more. We are going to try .\" His statement lacked conviction. Just like City's play at Anfield on Wednesday when Guardiola's tactics were pulled apart, not for the first time at this level in recent years. Guardiola's decision to change his approach and play an extra central midfielder, Ilkay Gundogan, instead of winger Raheem Sterling was based on his belief that it would allow City to take charge of midfield. window. _ taboola = window. _ taboola | | []; _ taboola. push ({mode: \"thumbnails-c', container:\" taboola-interstitial-gallery-thumbnails-4', placement: \"Interstitial Gallery Thumbnails 4', target_type:\" mix'}); _ taboola. push ({flush: true}); Photo: <mark>Dave Thompson</mark>, AP Image 1 of / 4 Caption Close Image 1 of 4 Manchester City coach Josep Guardiola ahead of the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. Manchester City coach Josep Guardiola ahead of the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. Photo: <mark>Dave Thompson</mark>, AP Image 2 of 4 Manchester City coach Josep Guardiola wipes his face during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. less Manchester City coach Josep Guardiola wipes his face during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday,...more Photo: <mark>Dave Thompson</mark>, AP Image 3 of 4 Manchester City coach Josep Guardiola speaks to his coaching staff during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. less Manchester City coach Josep Guardiola speaks to his coaching staff during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool,...more Photo: <mark>Dave Thompson</mark>, AP Image 4 of 4 Guardiola set to come up short again in Champions League 1 / 4 Back to Gallery \"We wanted more passes, more control,\" Guardiola said. By the time Gundogan traipsed off after 57 minutes--the game having virtually passed him by--to be replaced by Sterling, City was losing 3-0 and its players were struggling to clear their minds after Liverpool's devastating first-half display. Liverpool had taken advantage of City's lack of width on the right as left back <mark>Andrew Robertson</mark> repeatedly burst forward in support of Sadio Mane, leaving City right back Kyle Walker exposed. City's central-midfield four seemed unsure about their exact roles, the diagonal switch to left winger Leroy Sane became a default ploy because of a lack of options on the other flank, and lone striker Gabriel Jesus was left too isolated. It revived memories of Guardiola's time at Bayern Munich, when he changed his formation to 4-2-4 for the second leg of the semifinals against Real Madrid. Madrid, 1-0 ahead from the first leg, won the return match 4-0 in one of the most humiliating nights of Guardiola's career. Unless City pulls off a Barcelona-style recovery, it will be seven years since Guardiola last won the Champions League--when Barcelona won for the second time with that enchanting 3-1 victory over Manchester United at Wembley Stadium. A semifinal loss with Barcelona in 2012 was followed by three straight exits at the last four with Bayern. City under Guardiola was eliminated by Monaco in the last 16 last year, and now faces going out in the quarterfinals. It seems ungrateful to criticize Guardiola and his approach, given his City team could clinch the Premier League in record time this weekend after playing some of the best soccer ever seen in the English game. But in the Champions League, he has been found wanting, either through his overthinking (which was the case against Liverpool) or an unwillingness to change his attack-at-all-costs style (like against Monaco last season). He acknowledged before Wednesday's game that City's style plays right into the hands of Liverpool, but said he would not budge in his beliefs. What followed was a kind of fudged change, bolstering his central midfield but leaving another area of the field undermanned. He picked the same midfield against Arsenal in the English League Cup final and City was somewhat fortunate to go into halftime leading 1-0 before running out an easy 3-0 winner. Guardiola won't make the same mistake in the second leg against Liverpool. He has no option but to go on all-out attack, returning to the way City usually plays. The fact that City plays Manchester United in a potentially title-clinching derby match on Saturday makes things even more complicated for Guardiola. He will cling to the fact that City already has beaten Liverpool 5-0 at home in the league this season, and that City has scored at least three goals in 23 of its 49 games this season. Liverpool also has a big game over the weekend, a Merseyside derby against Everton, and there are doubts about the fitness of forward <mark>Mohamed Salah</mark>. \"I am too long in the business,\" Liverpool manager Juergen Klopp said, when asked if the quarterfinal match was virtually over. \"No one was in the dressing room dancing around and celebrating after the halftime result. This leg is about 180 minutes .\" Klopp has now won seven of his 13 career meetings against Guardiola, and appears to have his number. It's time for Guardiola to strike back. ___ Steve Douglas is at www.twitter.com/sdouglas80 Most Popular 1 Fat-shamed teen buys all the cupcakes at her local bakery to...2 An AirAsia passenger caused an uproar after trying to upgrade...3 Muni assault: SF man seriously injures woman for bumping into him 4 NFL Star Julian Edelman Stopped Potential School Shooter After...5 \"Fascinated and horrified' scientists watched as a killer...6 Big storm raising flooding fears across Northern California 7 Atmospheric river could hit Bay Area with month of rain in 2 days 8 SF man arrested in Fisherman's Wharf, Richmond District car...9 YouTube shooting: Family claims police failed to heed warnings 10 Women kicked out of sumo ring--despite helping with a.. . LATEST NEWS NFL star may have stopped potential school shooting Women kicked out of sumo ring despite medical emgergency Cyclist fired for flipping off Trump sues former employer 3 robbery suspects detained in Concord after standoff Teen buys every cupcake at bakery to spite fat-shaming woman Woman on flight tries to upgrade without paying, causes uproar SF police arrest man suspected of multiple car break-ins SF man seriously injures woman on Muni for bumping into him SFGate Giants mash four homers, slam King Felix in rout of Mariners Search Make and Model View Comments © 2018 Hearst Communications, Inc. .", "articleID": "2018040511_00069529_W", "names": {"Andrew Robertson": ["Q15915040", "Q20979480", "Q23035861", "Q2846717", "Q4758409", "Q49707939", "Q58937110"], "Dave Thompson": ["Q1173362", "Q1176844", "Q18619721", "Q25171579", "Q28224816", "Q3703057", "Q5229992", "Q5229993"], "Mohamed Salah": ["Q1354960", "Q22109496", "Q43975293", "Q50365713"]}}, {"date": "2018-04-05", "url": "https://www.thestar.com/news/world/2018/04/05/number-of-palestinians-killed-by-israel-this-week-rises-to-21-after-gaza-airstrike.html", "content": "News World Palestinian protesters carrying tires walk toward the fence along Gaza's border with Israel Thursday. An Israeli airstrike in northern Gaza early on Thursday killed a Palestinian, while a second man died from wounds sustained in last week's mass protest. (Adel Hana / The Associated Press) By Ilan Ben Zion The Associated Press Thu., April 5, 2018 JERUSALEM--An Israeli airstrike killed a Gaza man Thursday, while a second Palestinian died of wounds sustained in last week's mass protest along the Gaza-Israel border, officials said. The deaths brought to 21 the number of Palestinians killed by Israeli fire over the past week, including 15 who had been involved in the protests. The Israeli military said the man killed in the airstrike before dawn Thursday had approached the border fence with an assault rifle. It released a grainy video showing the armed man walking in the dark. Read more: Israel rejects calls for inquiry into Gaza violence Article Continued Below Palestinian death toll from Gaza protests hits 18; Israel rejects excessive force claims Israeli PM backtracks on deal to resettle African migrants in western countries, including Canada A new round of protests along the border is expected on Friday, raising the prospect of further bloodshed. The protest march last week, largely organized by Gaza's Hamas leaders, had been billed as the first of several weeks of intermittent protests against a stifling, decade-old Israeli blockade. Hamas leaders have portrayed the final protest, set for May 15, as the \"Great March of Return\" of Palestinian refugees and their descendants, implying they would try to enter Israeli territory. But they have stopped short of specifically threatening a mass breach of the border fence. The Israeli military has said it will not allow anyone to breach the border fence and has beefed up forces in the area, with snipers and other special units. The military was on high alert ahead of Friday. Nickolay Mladenov, the UN's Mideast envoy, urged both sides to show caution on Friday. \"Israeli forces should exercise maximum restraint and Palestinians should avoid friction at the Gaza fence,\" he said. \"Demonstrations and protests must be allowed to proceed in a peaceful manner,\" he added. \"Civilians, particularly children, must not be intentionally put in danger or targeted in any way .\" Meanwhile, Gaza health officials said a 34-year-old Palestinian who was seriously injured in last week's protests died of his injuries Thursday. Hundreds more were wounded by live fire last week, according to Palestinian health officials. Of the 21 dead so far, 15 were killed during border protests, and videos and witness accounts indicate that most were not armed or carrying out attacks at the moment they were killed. Hamas announced it is distributing money to the families of those killed and wounded in Friday's clashes. Families of those killed receive $3,000 (U.S.). Wounded receive $500 or $200 depending on the injury. Hamas said in a statement the money is part of its \"national and social responsibility in boosting the steadfastness\" of the people. Israel's military spokesman, Brig. Gen. Ronen Manelis, alleged that Hamas is exploiting Gaza residents by urging them to attend the protests and \"under the cover of these civilians carry out terror activities .\" Manelis said several Israeli communities are close to the Gaza border and warned of the consequences of Palestinians breaching the fence. Israel has defended its actions by saying the marches are planned by Hamas, which is sworn to Israel's destruction. It says the border fence was attacked with burning tires, stones and firebombs and, in one case, by a pair of gunmen in recent days. It says its snipers carefully targeted only the main \"instigators,\" and accuses Hamas of using the crowds as cover to stage attacks. \"By defending the border fence, the IDF (army) is protecting civilian homes,\" the military said on Twitter. Defence Minister Avigdor Lieberman warned in a radio interview on Thursday that Israel would respond harshly to any attempt to violate its security. Earlier this week, Lieberman said Gazans who approach the fence would be risking their lives. Rights groups have condemned orders to shoot unarmed protesters as unlawful, saying lethal force can only be used if soldiers face an apparent imminent threat to their lives. The Israeli group B’Tselem, in a rare appeal, urged Israeli soldiers to refuse such orders. The United Nations and the European Union have called for independent investigations into the shootings. Meanwhile, Egyptian intelligence chief <mark>Abbas</mark> Kamel held separate meetings this week with Israeli officials and with Palestinian President <mark>Mahmoud Abbas</mark>, the West Bank-based rival of Hamas, in hopes of preventing an escalation on the Gaza border. In recent months, Egypt had tried to broker a deal that would have enabled <mark>Abbas</mark> to take back control in the Gaza Strip, more than a decade after Hamas seized the territory from forces loyal to him. Hamas, in turn, had hoped that Israel and Egypt would end their blockade of Gaza if the group handed the reins of government to <mark>Abbas</mark>. However, talks broke down last month, in part because Hamas refused to disarm. Hamas and Israel have fought three wars in the Gaza Strip since 2008. <mark>Abbas</mark> told the Egyptian intelligence this week that he would not waste any more time negotiating a deal with Hamas and that he would only assume responsibility for Gaza if Hamas hands over all powers, including control over the security apparatus, according to two Palestinian officials. All the officials spoke on condition of anonymity because they were not authorized to discuss details of the meeting with reporters. Read more about: Israel Delivered daily The Morning Headlines Newsletter Subscribe The Toronto Star and thestar.com, each property of Toronto Star Newspapers Limited, One Yonge Street, 4th Floor, Toronto, ON, M5E 1E6. You can unsubscribe at any time. Please contact us or see our privacy policy for more information.", "articleID": "2018040519_00085490_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}}, {"date": "2018-04-05", "url": "http://www.wacotrib.com/news/ap_nation/politics/the-latest-white-house-trump-referring-to-migrants-plight/article_77d65ea9-dc12-5b88-9dd4-bf9c9ad6fef6.html", "content": "The Latest: White House: Trump referring to migrants' plight Apr 5, 2018 President Donald Trump speaks during a roundtable discussion on tax policy Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump smiles during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., with from left, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, CEO of Davis Trust Company Hugh Hitchcock, assistant head teller at Davis Trust Company Ann Macomber, parts manager at Leslie Equipment Company Jon Lilly and his wife Elizabeth Lilly. (AP Photo/Evan Vucci) Evan Vucci US President Donald Trump told a crowd in West Virginia that the US and China will have a \"fantastic relationship\" in the long term. Trump also complained about trade with the European Union. (April 5) President Donald Trump smiles as people applaud him during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va.. From left, Principle Engineer at Service Pump and Supply <mark>Sean Farrell</mark>, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, Trump, CEO of Davis Trust Company Hugh Hitchcock, and Assistant Head Teller at Davis Trust Company Ann Macomber. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump smiles as people applaud him during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., from left, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, and CEO of Davis Trust Company Hugh Hitchcock. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump speaks during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump smiles during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., with from left, Service Pump and Supply principal engineer <mark>Sean Farrell</mark>, Rep. <mark>Evan Jenkins</mark>, R-W. Va., and West Virginia Attorney General Patrick Morrisey. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump waves during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va., with from left, Rep. <mark>Evan Jenkins</mark>, R-W. Va., West Virginia Attorney General Patrick Morrisey, Trump, CEO of Davis Trust Company Hugh Hitchcock, and assistant head teller at Davis Trust Company Ann Macomber. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump responds to White House visitors as he makes his way to board Marine One on the South Lawn before departing the White House, Thursday, April 5, 2018 in Washington. Trump is traveling to West Virginia to hold a discussion on taxes in White Sulphur Springs, W. Va. (AP Photo/Manuel Balce Ceneta) Manuel Balce Ceneta Rep. <mark>Evan Jenkins</mark>, R-W. Va., left, and West Virginia Attorney General Patrick Morrisey, right, watch as President Donald Trump arrives for a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci West Virginia Attorney General Patrick Morrisey, right, listens as President Donald Trump speaks during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump gives a thumbs up during a roundtable discussion on tax policy, Thursday, April 5, 2018, in White Sulphur Springs, W. Va. (AP Photo/Evan Vucci) Evan Vucci President Donald Trump will be directing the departments of Defense and Homeland Security to deploy the National Guard to the southwest border. A former Border Patrol Chief, from El Paso says he sees the military's role as look-out post. (April 4) FILE - In this June 21, 2006, file photo, members of the California National Guard work next to the U.S.-Mexico border fence Wednesday, June 21, 2006, near the San Ysidro Port of Entry in San Diego. President Donald Trump said April 3, 2018, he wants to use the military to secure the U.S.-Mexico border until his promised border wall is built. The Department of Homeland Security and White House did not immediately respond to requests for comment. At the Pentagon, officials were struggling to answer questions about the plan, including rudimentary details on whether it would involve National Guard members, as similar programs in the past have done. But officials appeared to be considering a model similar to a 2006 operation in which former President George W. Bush deployed National Guard troops to the southern border in an effort to increase security and surveillance. (AP Photo/Denis Poroy, File) DENIS POROY President Donald Trump will be signing a proclamation directing the departments of Defense and Homeland Security to work together with governors to deploy the National Guard to the southwest border with Mexico. (April 4) WASHINGTON (AP)--The Latest on President Donald Trump (all times local): 4:55 p.m.. The White House says President Donald Trump was referring to the plight faced by migrants when he said those who make the journey to the U.S. from Mexico are \"raped at levels that nobody has ever seen before .\" Trump said Thursday at a tax event in West Virginia that \"yesterday it came out\" that during \"this journey coming up, women are raped at levels that nobody has ever seen before .\" Trump had previously mentioned a caravan of migrants working its way north through Mexico, so it appeared to some that he was suggesting the caravan was besieged by violence. But White House spokesman Hogan Gidley says it has been \"a widely reported fact for years\" that there is \"extensive and extreme victimization of those making the journey north with coyotes/smugglers in general .\" ------3:15 p.m. President Donald Trump is alleging without evidence that voter fraud is a huge problem in California. At a tax event in West Virginia on Thursday, Trump says that \"in many places, like California, the same person votes many times .\" He says, \"They always like to say,\" Oh, that's a conspiracy theory .' Not a conspiracy theory, folks. Millions and millions of people. \"After the 2016 election, Trump alleged repeatedly and without evidence that voting fraud cost him the popular vote. Earlier this year he disbanded a voter fraud commission amid infighting and lawsuits as state officials refused to cooperate. While there have been isolated cases of voter fraud in the U.S., past studies have found it to be rare .------3:10 p.m. President Donald Trump is seething over immigration policies at a tax event in West Virginia. Trump on Thursday complained about catch-and-release policies and family based migration, in which immigrants sponsor their relatives to join them in the U.S. Trump also noted he'd been criticized for saying in his campaign kickoff speech that Mexico was sending rapists across the border. But he says that\" yesterday it came out \"that during\" this journey coming up, women are raped at levels that nobody has ever seen before. \"It's unclear what he was referring to, but a White House spokesman pointed to past reports of women being raped by smugglers. Trump announced this week that he was requesting the deployment of the National Guard to the U.S.-Mexico border to fight illegal immigration and drug smuggling .------2:45 p.m. President Donald Trump is taking shots at Democratic Sen. Joe Manchin while visiting West Virginia. Speaking at a tax event Thursday, Trump referenced the fact that Manchin did not vote for his tax plan. He told the audience that they would get\" a chance to get a senator that's going to vote our program. \"He added that\" you're not getting that help right now. \"Trump says:\" Joe Manchin, he's really not helped us. \"Six Republicans are competing in a GOP primary to challenge Manchin, who is running for re-election. Trump easily carried the state in 2016 .------11:10 a.m. President Donald Trump plans to see two GOP Senate candidates during his visit to West Virginia. Trump is scheduled to hold a discussion on taxes in White Sulphur Springs later Thursday. Among those expected to attend are a congressman, <mark>Evan Jenkins</mark>, and the state's attorney general, Patrick Morrisey. They're among six Republicans competing in the May 8 for the party's Senate nomination. The incumbent is Democrat Joe Manchin, who is seeking another term in November. Trump, who overwhelmingly won West Virginia in the 2016 president election, has stayed neutral in the Senate primary so far .------10:50 a.m. President Donald Trump is ready to discuss his tax overhaul with business owners and families in West Virginia. The White House says Trump will hear from West Virginia companies that provided benefits to workers due to the tax law, as well as from families and elected officials. The companies include two community banks and a truck dealership. Republican officials expected to attend include the governor, Jim Justice, and Sen. <mark>Shelley Moore Capito</mark>. Trump signed the $1.5 trillion tax package into law in December. The Republican measure cut taxes on corporations and the wealthy, and gave more modest savings for many middle-class and lower-income Americans. The trip marks Trump's fourth visit to the state as president .------9:25 a.m.. The Trump administration hasn't determined how many troops it will seek to have deployed to the U.S.-Mexico border. That's according to Homeland Security Secretary Kirstjen Nielsen. She says:\" We're going to be sending as many troops as we need. \"President Donald Trump has signed a memo clearing the way for the deployment of National Guard troops to the border. Ultimately, it will be up to the four border-state governors to finalize the numbers and precise timing. Nielsen says the administration wants the National Guard's help providing surveillance along the border and maintenance for border patrol vehicles and aircraft to free up law enforcement assets for securing the border. Nielsen says she'll be speaking again Thursday with California Gov. <mark>Jerry Brown</mark> about earning his support for the deployment .------8:05 a.m. President Donald Trump is praising the Mexican government for breaking up a\" caravan \"of Central American migrants and avoiding\" a giant scene \"at the U.S. border. In a tweet, the president credits\" the strong immigration laws of Mexico and their willingness to use them. \"The tweet comes hours after Trump signed a proclamation directing the deployment of National Guard troops to assist in securing the U.S.-Mexico border. Trump has seized on news reports that the migrant group was traveling toward the U.S. Organizers of the migrant group said they never intended to reach the U.S. border. Trump adds that\" Border crossings are at a still UNACCEPTABLE 46 year low. \"------1:32 a.m. President Donald Trump has signed a proclamation directing the deployment of the National Guard to the U.S.-Mexico border to fight illegal immigration and drug smuggling. Homeland Security Secretary Kirstjen Nielsen says she's been working with governors of the southwest border states to develop agreements on where and how many Guardsmen will be deployed.", "articleID": "2018040521_00079677_W", "names": {"Evan Jenkins": ["Q5415437", "Q56597319"], "Jerry Brown": ["Q152451", "Q717620"], "Sean Farrell": ["Q16744758", "Q7440985", "Q7440988"], "Shelley Moore Capito": ["Q459618", "Q47506415"]}}]