[{"date": "2018-04-06", "url": "https://247sports.com/Bolt/WATCH-Pittsburgh-Steelers-Joe-Greenes-crazy-play-during-1974-season-117084762", "content": "WATCH: <mark>Joe Greene</mark>'s crazy play during 1974 season <mark>Joe Greene</mark> knew exactly what the Steelers needed during a 1974 matchup against the Cleveland Browns. Slot to 247Sports Links <mark>Joe Greene</mark> new exactly what the Pittsburgh Steelers needed during a 1974 matchup against the Cleveland Browns: points. Pittsburgh's offense was downright struggling against Cleveland, with starting quarterback Terry Hanratty throwing more interceptions (three) than completions (two) against the Browns' defense. With the Steelers' offense struggling, <mark>Greene</mark> made sure to make the most of his opportunity when Cleveland quarterback Brian Sipe fumbled while trying to pitch the ball to running back Billy Lefear. Instead of simply pouncing on the loose pigskin, <mark>Greene</mark> scooped up the ball and lateraled it to Pittsburgh cornerback J.T. Thomas. Thomas caught <mark>Greene</mark>'s toss and scampered into the end zone to give the Steelers a 23-16 fourth quarter lead. Pittsburgh would tack on a field goal to defeat the Browns, 26-16. When <mark>Joe Greene</mark> pitches you the??, you make sure to take it to the??. #tbt pic.twitter.com/9kgpwxFVft--Pittsburgh Steelers (@ steelers) April 5, 2018 The victory helped jumpstart a 4-1 finish to the regular season for the Steelers, who ended the 1974 regular season with a 10-3-1 record en route to winning the AFC Central division for the second time in three years. Pittsburgh would then dismantle O.J. Simpson and the Buffalo Bills in the first round to set up a matchup with the rival Raiders in the AFC Championship Game in Oakland. Pittsburgh had shocked Oakland two years earlier following <mark>Franco Harris</mark>' \"Immaculate Reception\" in the '72 divisional round, giving the Steelers their first-ever playoff victory. The Raiders got even by defeating the Steelers in the same round in the 1973 playoffs. While the Steelers were already itching at the chance to face the Raiders with a trip to the Super Bowl on the line, Oakland coach <mark>John Madden</mark> added some added incentive when he called his Raiders and the Miami Dolphins--the two time defending Super Bowl champions and the team Oakland defeated to get to the AFC title game--the two best teams in football. <mark>Madden</mark>'s comment did not sit well with Pittsburgh coach Chuck Noll, who delivered a rare inspirational speech to his team before heading to Oakland to face the Raiders. \"People out in Oakland think that the two best teams in football played yesterday,\" <mark>Greene</mark> said while recalling Noll's speech in his book,. \"But you know what? The Super Bowl will be played in two weeks and the best team in football is sitting right here in his room .\" \"<mark>Joe Greene</mark>: Built By Football\" <mark>Greene</mark> said Noll's words changed the complexion of the Pittsburgh Steelers for good. \"When he said that,\" <mark>Greene</mark> wrote, \"the case was closed. I knew we were going to win. I believed him and he was right .\" Noll was right, as his super charged Steelers defeated the Raiders 24-13. They then defeated the Minnesota Vikings in Super Bowl IX, as <mark>Greene</mark>, Noll and the rest of the Steelers were on their way to becoming the team of the decade by winning four Super Bowls in a six-year span. Author", "articleID": "2018040620_00068090_W", "names": {"Franco Harris": ["Q1333547", "Q5868373"], "Joe Greene": ["Q505256", "Q6210111", "Q982412"], "John Madden": ["Q1345694", "Q51516", "Q6246350", "Q945652"]}}, {"date": "2018-04-09", "url": "http://livingstondaily.com/story/sports/high-school/baseball/2018/04/09/2018-livingston-county-high-school-baseball-preview/471190002/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Email Twitter Google + LinkedIn Pinterest A look at Livingston County's 2018 high school baseball teams Baseball is traditionally a strong sport in Livingston County. The 2018 season should be no exception. Post to Facebook A look at Livingston County's 2018 high school baseball teams Baseball is traditionally a strong sport in Livingston County. The 2018 season should be no exception. Check out this story on livingstondaily.com: https: //ldpaa.com/2qgvi8Q Cancel Send Sent! A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE BRIGHTON ► Last season: 28-7 overall, 14-2 KLAA West; KLAA West, Lakes Conference champion ► Top returners: Cameron Tullar, P-OF, Sr.; Rudy Ramirez, P-OF, Sr.; Kyle Hook, SS, Sr.; Andrew Gilpin, 1B-P, Sr.; Jack Brenner, 3B-P, Sr.; Jack Krause, OF, Jr.; Camden Benedict, 2B-P, Jr. ► Outlook: Winners of a seventh KLAA West championship in the past nine years, Brighton is back with another loaded lineup looking to make a run at a state title. Led by a large returning cast and the 1-2 punch of Cameron Tullar and Rudy Ramirez on the mound, the Bulldogs might just have the ability to do it. Tullar and Ramirez were two of the best pitchers in the state last season, who also provided at the plate. Brighton's success will start with those two. ► Coach Charlie Christner: \"We are returning a very good core of players who have a lot of varsity experience. We are also adding in some new players who we feel will be able to contribute to this year's success. For me, it always comes down to pitching and defense, and these are the areas we feel really good about going into the season. Our schedule is going to be very challenging .\" SPRING SPORTS PREVIEWS ► Livingston County's 2018 preseason top 5 baseball players ► Livingston County's top 5 boys track and field athletes ► A look at Livingston County's boys track and field teams ► Livingston County's top 5 girls track and field athletes ► A look at Livingston County's girls track and field teams ► Top 5 boys lacrosse players in Livingston County ► A look at the Livingston County's 2018 boys lacrosse teams Junior JT Maybee is one of the top returning players from a Fowlerville baseball team that won a league and district title last season. (Photo: Kevin W. Fowler / for the Lansing State Journal) FOWLERVILLE ► Last season: 27-9-2 overall, 10-0 CAAC White; district champion ► Top returners: Trevor Miller, 3B-1B-P, Sr.; Nathan Southgate, 1B-P, Sr.; JT Maybee, OF-IF-P, Jr.; Sam Browne, C-P, Jr.; Wyatt Daniel, SS, Jr. ► Outlook: League and district champions last season, Fowlerville lost quite a bit of talent in the offseason, including its top three pitchers in Eric Fritz, Wyatt Thomas and Nate Leonard, who were all also top-of-the-order hitters. That group will be difficult to replace, but the Gladiators feel they do have the pieces with Miller, Southgate, Maybee and Browne back to contribute on the mound as well as help inflict damage in the lineup. ► Coach Matt Hunt: \"Our guys have been working extremely hard. The coaching staff has been stressing confidence and maximum effort in everything we do around the program. That includes in practice, the classroom, the weight room and nutrition. It has been a real culture change around the program. We are excited to see our results and what our young guys can do .\" Hartland's Max Hendricks was 11-1 last season. (Photo: Timothy Arrick/For the Livingston Daily) HARTLAND ► Last season: 33-7, district champion ► Top returners: Max Hendricks, P, Sr.; Ian Kenrick, OF, Sr.; Tommy Lappin, C, Sr.; Jake Moyer, CF, Sr.; Logan Tobel, 1B, Soph. ► Outlook: Hartland has a certified staff ace in Hendricks, who was 11-1 with a 1.22 ERA last year. Hendricks is the last holdover from Hartland's 2015 Division 1 championship team, going 3-for-5 in the state final. Finding a No. 2 pitcher to close out doubleheaders will be a key for the Eagles. Lappin will be a full-time catcher after also playing outfield last season. This is an athletic team with two college recruits in baseball (Hendricks, Moyer) and two in football (Lappin, Kenrick). Tobel is a future star who was a rare freshman last year who could start at one of the county's big three programs. ► Coach <mark>Brian Morrison</mark>: \"We are athletic. I would expect us to be really good on defense. I expect us to be able to run a little bit. We've just got a couple guys who have to step up at the plate and on the mound and be better than expected. It's pretty much the same every year .\" Howell's Johnny Shields slides home against Brighton on April 21, 2017. (Photo: Jim Jagdfeld/For the Livingston Daily) HOWELL ► Last season: 29-10-1 overall, 12-4 KLAA West; district champion ► Top returners: Ty Weatherly, P-IF, Sr.; Jake Falzone, P-OF, Sr.; Blake Arnold, P, Sr.; Brandon Maki, 1B, Sr.; Johnny Shields, SS-P, Sr.; Jack Rossbach, IF-P, Sr. ► Outlook: The Highlanders no longer have 2017 Mr. Baseball Sam Weatherly on the mound, but they have several capable arms in their rotation. Ty Weatherly, Sam's brother, is a Ball State University recruit who was 5-0 with a 1.89 ERA last season. Howell graduated eight players who are competing in college baseball. The Highlanders have lost plenty of good players over the years, but keep producing more, which is how they've put together a string of six straight district championships. ► Co-coach Mike Weatherly: \"We have a good blend of experienced returners and newcomers. We have depth in our pitching rotation, returning experience defensively, and good speed and power offensively. Extremely coachable group that is eager to get going with the 2018 season .\" PINCKNEY ► Last season: 11-19 ► Top returners: Al Thorington, P-OF, Jr.; Drew Cortez, OF-SS-P, Sr.; Jack Wurzer, P-SS, Sr.; Dalton Knightley, 3B-1B-P, Jr. ► Outlook: It's an exciting time for Pinckney baseball, which should be on a bit more even ground after leaving the KLAA and joining the SEC. While the Pirates had trouble contending in the KLAA, they do have some key players back from a team that split a doubleheader with West Division champion Brighton last season. Thorington, one of the county's top players, drove in both runs in a 2-0 victory over Brighton. ► Coach Ryan Rogowski: \"The Pinckney Pirates have a lot of starters returning, but also add a lot of young talent to the roster this year. We have three freshmen and four sophomores that will all see significant playing time (and) help this team compete for their first SEC title .\" CONNECT TWEET LINKEDIN COMMENT EMAIL MORE", "articleID": "2018040916_00114821_W", "names": {"Brian Morrison": ["Q20737985", "Q3644491", "Q39074057", "Q4964815", "Q57439709"]}}, {"date": "2018-04-10", "url": "https://in.news.yahoo.com/why-fans-upset-latest-episode-080249344.html", "content": "Many 90s kids have known the struggle of picking the best episode of The Simpsons, the longest-running scripted series in TV history. Over a decade later, the fans are wiser. They stand evolved and have mixed feelings about some of the problematic depictions. The stealthy stereotypes and racist depictions of the character, Apu - the Indian owner and manager of the Springfield Kwik-E-Mart, prompted Hari Kondabalu an Indian-American fan of the classic comedy series to release a documentary titled The Problem with Apu. Hank Azaria, a non-Indian actor lent his voice replete with an Indian accent to the animated series. Azaria's performance as Apu was based on a guy who worked at the 7-11 in Los Angeles back in the late 1980s - the result was a caricature. In one of the interviews, Kondabalu asserted that Apu is predominantly \"a white person's perception of an Indian immigrant .\" He's not the only fan who is grappling with this conflict. Kondabalu argued that the stereotyping provoked bullying of and racism towards people of colour. The latest episode of the series, titled No Good Read Goes Unpunished finally addressed the criticisms around the character but not without being defensive. In the episode Marge decides to update a book she loved as a girl, The Princess in the Garden before introducing it to Lisa to make it more relevant to the times, to strip it off any traces of misogyny and racism and to make it \"politically correct'. #TheSimpsons completely toothless response to @ harikondabolu #TheProblemWithApu about the racist character Apu:\" Something that started decades ago and was applauded and inoffensive is now politically incorrect...What can you do? \"pic.twitter.com/Bj7qE2FXWN--Soham (@ soham_burger) April 9, 2018 The new version fails to fascinate Lisa .\" Well, what am I supposed to do? \"Marge inquires exasperated. Lisa then breaks the fourth wall and tells the audience:\" \"It's hard to say. Something that started decades ago, and was applauded and inoffensive, is now politically incorrect. What can you do?\" \"- Lisa in the latest episode of The Simpsons She then glances at her nightstand, on which a framed photo of Apu is perched, emblazoned with the caption,\" Don't have a cow! \"Marge also indicates that there's no point to the book after the revision. The response was perceived as flippant, at best by Twitterati, who agree that The Simpsons jumped the shark long ago. The aforesaid documentary released last year had ignited a conversation on how Apu's depiction as a character fails to stand the test of time. The facile jab didn't go unnoticed by Kondabalu who jumped into the discussion online. Wow .\" Politically Incorrect? \"That's the takeaway from my movie & the discussion it sparked? Man, I really loved this show. This is sad. https: //t.co/lYFH5LguEJ--Hari Kondabolu (@ harikondabolu) April 9, 2018 Disappointed in The Simpsons. @ harikondabolu's doc was fair and articulate about media representation of South Asians. The Simpsons' writers shat on it by getting the most progressive character (Lisa) to dismiss it as\" politically incorrect \"& followed up with a Hindu/cow joke. https: //t.co/HePO5qspTk--Areeq Chowdhury (@ AreeqChowdhury) April 9, 2018 Back then, the depiction of Apu in the series surreptitiously made Indian Americans vulnerable to ridicule and bigotry. The episode assumed that the show was\" inoffensive' all along. It discounted the little or no representation of Indian Americans in the media. \"\"We just were underrepresented. We didn't have any other representation in this country. That creates a problem when the most popular show on television is showing mainstream America what an Indian is .\" \"- Actor Utkarsh Ambudkar in The Problem with Apu. It was\" inoffensive \"? When? Back when y' all didn't give a shit what Indian-American kids felt? (I'm kidding, of course, they still don't care. Just some of those kids grew up, grew into their voice and were able to point out how hurtful this shit was .) https: //t.co/OvMtDJcToP--aprotim (@ aprotim) April 9, 2018 What assholes. Not to mention the erasure of the people who were offended and weren't applauding .--Cate Young (@ battymamzelle) April 9, 2018 Fans are disappointed that the show loved by them for decades has shirked culpability and dismissed the discourse that Kondabalu began with his documentary. They almost see it as a smug cop-out. Story Continues 1. Desi kids get called Apu by bullies too young to really get The Simpsons 2. Guy makes doc about it 3. The Simpsons blow it because their heads are too far up their own asses to really get The Simpsons 4. The machines take over and we are set free .--rob corddry (@ robcorddry) April 9, 2018 Everybody has an opinion about Apu, but did they ever talk to someone who owned a convenience store or gas station or work in one or grow up in one? You know, like my dad and I? #simpsons #apu--<mark>Amar Shah</mark> (@ amarshahism) April 9, 2018 Apu on The Simpsons being voiced by a white guy is one of those things that everyone is aware of but no one wants to reconcile with, like the fact that <mark>Elizabeth Moss</mark> is a scientologist--Dana Schwartz (@ DanaSchwartzzz) April 9, 2018 Source: Vulture. Read more on TV by The Quint. CWG 2018 | Day 6: Heena Sidhu Wins Gold in 25 m Pistol Event Here's Why Fans Are Upset With the Latest Episode of The Simpsons. Read more on TV by The Quint.", "articleID": "2018041008_00086024_W", "names": {"Amar Shah": ["Q16223949", "Q58806795"], "Elizabeth Moss": ["Q54573547", "Q6152388"]}}, {"date": "2018-04-10", "url": "http://jis.gov.jm/local-authorities-challenged-to-become-more-self-sufficient/", "content": "Minister of Local Government and Community Development, Hon. Desmond McKenzie (left), greets His Worship the Mayor of Port-of-Spain, Trinidad, Alderman Joel Martinez (right), at the inaugural staging of the Caribbean Conference of Mayors at the University of the West Indies (UWI) Regional Headquarters, Mona, St. Andrew, today (April 9). At centre is His Worship the Mayor of Kingston, Senator Councillor, Delroy Williams. The three-day meeting is organised by the Kingston and St. Andrew Municipal Corporation and is being held under the theme \"Caribbean Cities: Honouring the Past, Embracing a Smart Future'. + - Photo: <mark>Dave Reid</mark> Minister of Local Government and Community Development, Hon. Desmond McKenzie (left), greets His Worship the Mayor of Port-of-Spain, Trinidad, Alderman Joel Martinez (right), at the inaugural staging of the Caribbean Conference of Mayors at the University of the West Indies (UWI) Regional Headquarters, Mona, St. Andrew, today (April 9). At centre is His Worship the Mayor of Kingston, Senator Councillor, Delroy Williams. The three-day meeting is organised by the Kingston and St. Andrew Municipal Corporation and is being held under the theme\" Caribbean Cities: Honouring the Past, Embracing a Smart Future'. Story Highlights Minister of Local Government and Community Development, Hon. Desmond McKenzie, is calling on local authorities to become more self-sufficient, in order to reduce their dependency on central government. \"If we speak about the independence of local government, then we should create our own niche of revenue, and it's time we extricate ourselves from the pockets of central government by becoming more relevant when it comes to generating our own sources of revenue,\" the Minister said. Mr. McKenzie emphasised that the potential is there for this to become a reality, noting that \"this is one area of disappointment in local government\". Minister of Local Government and Community Development, Hon. Desmond McKenzie, is calling on local authorities to become more self-sufficient, in order to reduce their dependency on central government. He was addressing the opening ceremony of the inaugural Caribbean Conference of Mayors at the University of the West Indies (UWI) Regional Headquarters, Mona, St. Andrew, today (April 9). \"If we speak about the independence of local government, then we should create our own niche of revenue, and it's time we extricate ourselves from the pockets of central government by becoming more relevant when it comes to generating our own sources of revenue,\" the Minister said. Mr. McKenzie emphasised that the potential is there for this to become a reality, noting that \"this is one area of disappointment in local government\". The Minister argued that the success of central government requires the continued success of local government. \"Local government has and continues to be the most accessible and intimate form of government to the citizens anywhere, (and) its importance continues to grow. As our collective economy and societies evolve, we should pool our intellectual and social capacities to drive and support development in our cities, municipalities and countries,\" he said. The Minister said the conference provides an opportunity for local government practitioners to share best practices and significantly improve the quality of service provided to citizens, particularly in starting the process of coordinating the creation of smart cities across the Caribbean. \"The starting point of this process is the sharing of ideas--communication and information technologies--to increase efficiency and creativity of our operations. In this way, we will positively affect service delivery and governance in our cities and municipalities, and, at the same time, we will more strongly contribute to the share of the limited budget resources that are available to the local authorities,\" he said. The conference, which ends on April 11, is being held under the theme \"Caribbean Cities: Honouring the Past, Embracing a Smart Future'. It is geared towards building relationships and understanding among mayors and local government practitioners from across the Caribbean. It is organised by the Kingston and St. Andrew Municipal Corporation.", "articleID": "2018041014_00195069_W", "names": {"Dave Reid": ["Q1173327", "Q5229651", "Q784286"]}}, {"date": "2018-04-10", "url": "http://www.bluemountaineagle.com/Local_News/20180410/election-2018-county-judge-myers-running-for-re-election", "content": "ELECTION 2018: County Judge <mark>Myers</mark> running for re-election Touts experience, common sense and patience. By Richard Hanners Published on April 10, 2018 5:13 PM <mark>Scott Myers</mark> Job descriptions pdf file Editor's note: County Judge <mark>Scott Myers</mark> is running for re-election against County Commissioner Jim Hamsher. If either candidate receives more than 50 percent of the vote in the May primary, as is likely, that person will win the election outright, and the position will not appear on the ballot in November. <mark>Scott Myers</mark>, 63, Canyon City, is running for a second term as Grant County judge. Prior to that, he served two six-year terms as a county commissioner. After graduating from high school, <mark>Myers</mark> worked for 10 years in construction before landing a job at the Malheur Lumber Co. mill in <mark>John Day</mark>, where he worked from 1983-1998. He's been a self-employed building contractor since then. The biggest issues facing Grant County are jobs, housing and public safety, he said. \"In any order,\" he added. <mark>Myers</mark> has supported <mark>John Day</mark>'s proposal to bring broadband internet service to Grant County, including the county's participation in the Grant County Digital Network Coalition with <mark>John Day</mark> and Seneca. \"I think we need it,\" he said. \"We need competition. The small communities at the will of the internet providers need help .\" <mark>Myers</mark> has been at the table reviewing options to replace the existing 911 dispatch center now operated by the city of <mark>John Day</mark>--including outsourcing the service to Frontier Regional 911 in Condon. <mark>Myers</mark> said he would support the decision of the 911 User Board. \"If it's not Frontier, then I'd like to see the hybrid cost-sharing formula used to pay for a local dispatch,\" he said. \"It would be nice to retain payroll in Grant County .\" <mark>Myers</mark> has concerns about establishing a new natural resource adviser position for the county--including its role and funding. \"We have a lot of eyes looking at natural resources for us already,\" he said, citing the Eastern Oregon Counties Association and the Association of Oregon Counties. He said the new position was not sustainable for more than a year, and if the county turned to federal Secure Rural Schools or payment-in-lieu of taxes funding, that might not be available two years from now. <mark>Myers</mark> has a straightforward vision for the area's economy. \"We need to sustain jobs that we have while attempting to attract new ones,\" he said. \"Tourism does not bring family-wage jobs--industry does .\" Bringing broadband access to the county could help by encouraging home businesses that the area doesn't have now, he noted. In addition to common sense and patience, <mark>Myers</mark> said he's bringing legacy knowledge to the job. \"I have experience--there's no substitute for institutional experience,\" he said. \"I've been here a long time .\" ", "articleID": "2018041100_00090086_W", "names": {"John Day": ["Q16186636", "Q16239406", "Q21554065", "Q21554066", "Q28012733", "Q54321637", "Q6228897", "Q6228899", "Q6228901", "Q6228903"], "Scott Myers": ["Q6381100", "Q7436939"]}}, {"date": "2018-04-11", "url": "https://phys.org/news/2018-04-scientists-link-superconductivity-periodic-table.html", "content": "Scientists discover a link between superconductivity and the periodic table April 11, 2018, Moscow Institute of Physics and Technology TOC graph. Credit: Dmitrii V. Semenok et al. / The Journal of Physical Chemistry Letters Scientists from Moscow Institute of Physics and Technology and Skoltech have demonstrated the high-temperature superconductivity of actinium hydrides and discovered a general principle for calculating the superconductivity of hydrides based on the periodic table alone. The results of their study were published in the Journal of Physical Chemistry Letters. High - temperature superconductivity is a phenomenon of zero electrical resistance in certain materials at temperatures above -196 degrees C (the temperature of liquid nitrogen). Room-temperature superconductors open up prospects for the power industry, transport, and other technology-driven sectors. Currently, the record holder in high-temperature superconductivity is hydrogen sulfide (H3S), which functions as a superconductor at 1.5 million atmospheres and a temperature of -70 degrees C. Such pressure levels can only be attained in a lab environment, and the temperature is way below room temperature, so the search continues for new superconductors. Perhaps an even higher-temperature superconductivity can be attained in metal-hydrogen compounds. Yet the link between chemical composition and superconductivity was unclear, leaving scientists to puzzle out by trial and error. A group of chemists led by <mark>Artem R. Oganov</mark>, professor at the Moscow Institute of Physics and Technology and Skoltech, discovered that certain elements capable of forming superconducting compounds are arranged in a specific pattern in the periodic table. It was established that high-temperature superconductivity develops in substances containing metal atoms that come close to populating a new electronic subshell. Metal atoms inside the crystal are assumed to become highly sensitive to the positions of the neighboring atoms, which would result in strong electron-phonon interaction, the underlying effect of conventional superconductivity. Based on this assumption, the scientists supposed that high-temperature superconductivity could occur in actinium hydrides. Their supposition was verified and confirmed: superconductivity was predicted for AcH 16 at temperatures of -69 to -22 degrees C at 1.5 million atmospheres. \"The very idea of a connection between superconductivity and the periodic table was first put forward by Dmitry Semenok, a student at my lab. The principle he discovered is very simple and it is really amazing that no one had hit upon it before,\" says Artem Oganov. Superconductivity in an alloy with quasicrystal structure March 27, 2018 Extraordinary things happen at low temperatures. One of the best examples is superconductivity, a phenomenon wherein the electrical resistance of a solid drops to zero below a critical temperature. Known for a century, superconductivity...Cooking up \"frustrated' magnets in search of superconductivity June 13, 2017 Duke physics professor Sara Haravifard is mixing, cooking, squishing and freezing\" frustrated \"magnetic crystals in search of the origins of superconductivity. Key compound for high-temperature superconductivity found June 16, 2016 A research group in Japan found a new compound H5S2 that shows a new superconductivity phase on computer simulation. Further theoretical and experimental research based on H5S2 predicted by this group will lead to the clarification...High-temperature superconductivity in B-doped Q-carbon July 24, 2017 Researchers at North Carolina State University have significantly increased the temperature at which carbon-based materials act as superconductors, using a novel, boron-doped Q-carbon material. New temperature record: Hydrogen sulfide becomes superconductive under high pressure at minus 70 degrees Celsius August 18, 2015 Up until now, no material has been able to conduct current with no resistance at such high temperatures: Researchers at the Max Planck Institute for Chemistry in Mainz and the Johannes Gutenberg University Mainz observed...Superconductors on the nanoscale March 15, 2010 Superconductors, materials in which current flows without resistance, have tantalizing applications. But even the highest-temperature superconductors require extreme cooling before the effect kicks in, so researchers want...Recommended for you In quest of the coldest possible antihydrogen April 11, 2018 Currently, one of the major goals in ultracold science is to cool antihydrogen atoms to as close to absolute zero as possible. Ultracold antihydrogen would pave the way toward ultraprecise antimatter experiments that could...Quantum simulator offers faster route for prime factorization April 10, 2018 Factoring very large numbers into their prime\" building blocks \"is extremely difficult for classical computers, and this difficulty underlies the security of many cryptographic algorithms. While it's easy to factor the number...Metamaterial device controls transmission and reflection of acoustic waves April 10, 2018 Metamaterials researchers at Duke University have demonstrated the design and construction of a thin material that can control the redirection and reflection of sound waves with almost perfect efficiency. Harnessing\" Rashba spin-Seebeck effect' phenomenon will enable commercial devices to turn waste heat into electricity April 10, 2018 Mechanical engineers at the University of California, Riverside, have reported success in using inexpensive materials to produce thermoelectric devices that transform low-level waste heat into electricity. Mini toolkit for measurements: New NIST chip hints at quantum sensors of the future April 10, 2018 Researchers at the National Institute of Standards and Technology (NIST) have created a chip on which laser light interacts with a tiny cloud of atoms to serve as a miniature toolkit for measuring important quantities such...Diamond-based circuits can take the heat for advanced applications April 10, 2018 When power generators like windmills and solar panels transfer electricity to homes, businesses and the power grid, they lose almost 10 percent of the generated power. To address this problem, scientists are researching new ...", "articleID": "2018041110_00203994_W", "names": {"Artem R. Oganov": ["Q18406571", "Q42879486"]}}]