[{"articleID": "2019010620_00561565_W", "names": {"Julie Davis": ["Q1712168", "Q5954191"]}, "date": "2019-01-06", "url": "http://newsok.com/seminars-prove-need-for-education-about-senior-living/article/5619370?custom_click=rss", "content": "NewsOK BrandInsight Connecting local experts and business leaders with the NewsOK audience. What is this? NewsOK BrandInsight provides a place for local organizations and companies to connect directly with the NewsOK audience by publishing sponsored native advertising articles of interest on the NewsOK digital platforms and to participate in the resulting conversation. BrandInsight content is produced by the organizations and included in this special section as a service to NewsOK readers. Read more about BrandInsight here. To learn how to participate in BrandInsight, email us at brand-insight @ opubco.com. Seminars prove need for education about senior living by Eddie Roach Published: Sun, January 6, 2019 1:59 PM Updated: Sun, January 6, 2019 1:59 PM shares email Spanish Cove Retirement Village BrandInsight How to pay for senior living Planning for senior living is vital Spanish Cove can help take the stress out of retirement downsizing Seminar to explore little-known ways to pay for senior living Show More Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] In January 2016, a group of about 40 people made their way to the Northwest Library expecting yet another bland seminar ending in a sales pitch. However, what this group of optimistic, learning-based senior adults experienced was something much different. \"The most surprising thing that happened was actually what didn't happen--a sales pitch,\" said Oliver Delaney. \"There wasn't one.\" \"The presentation was straight forward, highly organized, and candid, offering far more than simply facts and features, added Joy Jones, who at 92 years old said she looks forward to the seminars each month and only missed one last year. Now, three years later, the educational talks known as the Senior Living Truth Series continue to grow. With nearly 200 in attendance each month, a new venue has been added serving homeowners living in the south metro area.\" We chose the Moore-Norman Technology Center as our south location because several residents from Moore, Norman, Mustang, and the Tri-City areas have expressed an interest in attending but prefer not to drive so far north, \"said Chris Buckelew, one of the main organizers of the events. The 2019 calendar includes content designed to help retired\" truth seekers \"gain information about topics that are otherwise hard to research.\" Unfortunately information found on the internet, while a helpful starting point, is often designed to sell and sway opinions. For instance, if you want to learn more about senior living options and you google it, you are bombarded with ads and misinformation from a variety of places. It can be both confusing and frustrating, \"said Nikki Buckelew, the moderator and host of the series.\" The series has been good for attendees who are looking for honest and candid information, \"she said. Regular attendees to the series, Pat and Debra Lynch of Nichols Hills, agree with her.\" We didn't know where to start. After attending the Truth Series, we met with several of the sponsors and toured a number of 55 + communities, \"Pat Lynch said.\" They were all very helpful. Now we feel both informed and equipped to move forward with our plans. \"The Senior Living Truth Series, referred to by organizers as simply SLTS, was inspired by Nikki Buckelew, a veteran real estate broker, after experiencing her own struggle to gather information about local services for seniors.\" It was extremely difficult for me, and I feel I am personally pretty tech savvy, \"Buckelew said.\" I came across other professionals who felt the same way and who wanted to help make getting information easier and less intimidating. Many became sponsors and ambassadors of the series. It's a group effort. \"While the series is the result of a team effort, sponsors point to Buckelew's signature presentation style as integral in the overall growth of the program.\" Nikki doesn't hold back. She tells it like it is and ensures that everyone involved does the same. There is no gray area. It's either complete truth or nothing to be said at all, \"said <mark>Julie Davis</mark>, marketing director for Concordia Life Care Community. Sponsors and panelists are held to strict standards. They are required to participate in pre-event orientations and regular seminar debriefings. They sign off on agreements about standards of conduct.\" I believe in education, \"said Jill Huff, marketing director at Spanish Cove Retirement Village.\" My goal at Spanish Cove is to educate everyone I talk to and to help them find the option that's right for them. Sponsors of SLTS are not allowed to sell at the seminars. Since this method of education aligns with our values and goals, it just makes sense to support SLTS. \"It isn't surprising that the seminars tend to differ from the traditional approach. Buckelew, a long-time Oklahoma real estate agent specializing in retirement moves, also holds a degree from Southern Nazarene University in gerontology and recently completed her doctorate in psychology from Northcentral University.\" I chose to get a doctorate to deepen my understanding of the issues our clients face, \"Buckelew said.\" As I found myself having more conversations with people making tough decisions late in life, I set out to gain knowledge that would empower and equip those I serve. The best way for me to do that is through offering free public seminars. \"January's topic is\" The Truth about Retirement Communities. \"Here attendees will get an inside perspective about various senior living options, as well as best practices for touring, selecting, and moving to a senior living community.\" While we have done similar talks to this one before, on January 10 and January 22 we are going to really dive deep into the world of senior living, debunk some myths, and expose some little known truths about the industry, \"Buckelew said. Both sessions begin at 10 a.m. Future monthly topics include dealing with legal and financial issues, healthcare, estate liquidation, and downsizing, among others. Pre-registration is required to attend due to limited seating and can be done online at seniorlivingtruthseries.com or by calling 405-563-7501. This article is sponsored by Concordia Life Care Community and Spanish Cove Retirement Village. Related Photos Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] <figure> <img src =\" / / cdn2. newsok. biz/cache/r960-e 0e83038f6bac5de52c47e4c993d4e77. jpg \"alt =\" Photo - Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] \"title =\" Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] \"> <figcaption> Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] </ figcaption> </ figure> Eddie Roach Read more' Spanish Cove Retirement Village Spanish Cove is an adult senior retirement community located in the metropolitan Oklahoma City area, in the suburb of Yukon. We are a Continuing Care Retirement Community (or\" CCRC, \"sometimes known as a\" Continuum of Care Retirement Community \"), offering amenities and programs for every phase of retirement, from independent living to home health care, skilled nursing, assisted living, and nursing care. Residents enjoy a lifestyle that is maintenance-free and carefully customized to meet the needs of each individual. Read more' NewsOK BrandInsight provides a place for local organizations and companies to connect directly with the NewsOK audience by publishing articles of interest on the NewsOK digital platforms in a special section. Comments Comments Seminars prove need for education about senior living × Commenting on NewsOK requires a NewsOK Pro or Oklahoman subscription. Log in or subscribe to read and leave comments."}, {"articleID": "2018052420_01136230_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}, "date": "2018-05-21", "url": "https://www.livetradingnews.com/white-house-sets-up-investigation-into-election-spying-by-fbi-88752.html", "content": "White House Sets Up Investigation Into Election Spying by FBI The White House announced Monday that US President Donald Trump's Chief of Staff <mark>John Kelly</mark> plans to \"immediately set up a meeting\" with congressional leaders and the FBI, Justice Department and Director of National Intelligence to review \"highly classified and other information they have requested\" [...] The post White House Sets Up Investigation Into Election Spying by FBI appeared first on Live Trading News."}, {"articleID": "2019092523_00042637_W", "names": {"Alan Mahon": ["Q1646551", "Q21062515"]}, "date": "2019-09-25", "url": "http://www.twtd.co.uk/ipswich-town-news/5760/mahon-injury-not-serious/onthisday", "content": "<mark>Mahon</mark> Injury Not Serious Friday, 26th Sep 2003 09:17 On-loan winger <mark>Alan Mahon</mark> has had a scan which has shown his thigh injury to be a minor problem. However, the Blackburn player is unlikely to be involved for the Blues against Watford on Saturday. <mark>Mahon</mark> picked up the problem in the 2-1 loss at Notts County on Tuesday. The Irishman is relieved that it isn't too serious: \"Thankfully the scan showed there is no tear or anything but I can still feel it.\" It usually takes about 50 hours for the swelling to go down and the bruising to ease so I will see the physio and take it from there. \"I'm hoping I will be OK because I'm desperate to play. I'm really enjoying my football here and I came to play first-team games not sit around injured.\" Darren Bent is back in training today and may well be fit for the trip to Vicarage Road while Joe Royle has revealed it is a loan striker he is targeting. The Town boss was hoping to hear back from the player's club yesterday but is now expecting confirmation one way or the other today. He has a specific international player in mind but if that doesn't work out then he'll look elsewhere. Play Football, Lose Weight Ipswich places available now. Save 50% of your registration fee by clicking here, and we'll donate £ 5 to Prostate Cancer UK. Read more in our blog about how it works and how 95% of members lose weight. Photo: Action Images Please report offensive, libellous or inappropriate posts by using the links provided. Page:"}, {"articleID": "2019112101_00019676_W", "names": {"Oleksandr Danylyuk": ["Q12099480", "Q20066727"]}, "date": "2019-11-20", "url": "https://www.salon.com/2019/11/20/tucker-carlson-claims-he-didnt-use-anti-semitic-trope-despite-suggesting-vindman-has-a-dual-loyalty/", "content": "Fox News host Tucker Carlson suggested Tuesday that Lt. Col. Alexander Vindman has raised concerns about President Donald Trump's July 25 phone call to Ukrainian President Volodymyr Zelensky because of a dual loyalty. Vindman was born in Kyiv and is Jewish. Carlson opened his monologue by claiming that \"the circus train of impeachment remains stalled on the tracks.\" He described Vindman as \"a low-level U.S. army officer\" and showed a clip in which Steve Castor, a Republican staff attorney, asked Vindman whether <mark>Oleksandr Danylyuk</mark>, a former Ukrainian national security adviser, had offered him the position of Ukrainian defense minister. While Carlson included the part of the exchange in which Vindman confirmed that he had been approached for the job, he edited out crucial context from the lieutenant colonel's response. Advertisement: Vindman said that although he had been offered the post three times, \"every single time, I dismissed it. Upon returning, I notified my chain of command and the appropriate counterintelligence folks about the offer.\" He later added, \"I'm an American. I came here when I was a toddler, and I immediately dismissed these offers--did not entertain them. The whole notion is rather comical that I was being asked to consider whether I would want to be the minister of defense. I did not leave the door open at all. But it is pretty funny for a lieutenant colonel in the United States Army, which really is not that senior, to be offered that illustrious a position.\" Carlson alleged that Vindman was someone who holds \"strongly-held views on Ukrainian politics--views that may or may not align with U.S. policy on the subject.\" Advertisement: There is a long history of accusing Jews of being disloyal to the countries where they reside, which is a form of anti-Semitism. In the 1890s, a French captain named Alfred Dreyfus was accused of being a German spy and publicly disgraced despite exculpatory evidence. T he dual loyalty slur appeared more recently when Trump claimed that American Jews who vote for Democrats, whom he in turn claimed were anti-Israel, were \"disloyal.\" In response to a Salon request for comments, Fox News sent a statement attributed to Carlson. \"Our segment noted that Lt. Col. Vindman was offered a high-ranking position in the Ukrainian government--a fact that emerged during his congressional testimony,\" Carlson said. \"Lt. Col. Vindman's religious faith was never mentioned, because it is entirely irrelevant. Any suggestion to the contrary is outrageous and dishonest.\" Advertisement: Carlson is not the only Fox News host to call Vindman's loyalty of country into question. Last month, fellow primetime colleague Laura Ingraham commented that Vindman \"immigrated from Ukraine along with his family when he was a child and is fluent in Ukrainian and Russian. Ukrainian officials sought advice from him about how to deal with Mr. Giuliani, though they typically communicated in English.\" She added, \"We have a U.S. national security official who is advising Ukraine while working inside the White House, apparently against the president's interest. And, usually, they spoke in English. Isn't that kind of an interesting angle on this story?\" Advertisement: During his opening statement to the House Intelligence Committee on Tuesday, Vindman addressed the various right-wingers who have attacked him and others who have come forward to attest to inappropriate behavior by Trump under oath during the impeachment inquiry. \"I want to take a moment to recognize the courage of my colleagues who have appeared and are scheduled to appear before this committee,\" Vindman said. \"I want to state that the vile character attacks on these distinguished and honorable public servants is reprehensible. It is natural to disagree and engage in spirited debate--this has been our custom since the time of our Founding Fathers--but we are better than callow and cowardly attacks.\" Vindman, who personally listened to Trump's July 25 phone call with Zelensky, told Congress on Tuesday that he was \"concerned\" by the call, because he thought it was \"improper.\" Advertisement: \"It is improper for the president of the United States to demand a foreign government investigate a U.S. citizen and political opponent,\" Vindman said. \"It was also clear that if Ukraine pursued an investigation into the 2016 election, the Bidens and Burisma, it would be interpreted as a partisan play. This would undoubtedly result in Ukraine losing bipartisan support, undermine U.S. national security and advance Russia's strategic objectives in the region.\" You can watch the full Carlson segment below: Advertisement: Watch the latest video at foxnews.com"}, {"articleID": "2019041110_00062194_W", "names": {"Andrew Hore": ["Q25189782", "Q4757335", "Q505193"]}, "date": "2019-04-11", "url": "http://smdailyjournal.com/news/world/rugby-australia-to-terminate-folau-deal-after-anti-gay-post/article_f36ad061-474a-56af-8789-f45bcd7c12c8.html", "content": "Facebook Twitter SMS Email Facebook Twitter SMS Email Print Save SYDNEY (AP)--Rugby Australia says it plans to terminate Israel Folau's contract after the star fullback made anti-gay comments on social media for the second year in a row. RA chief executive Raelene Castle said she and NSW Rugby Union chief <mark>Andrew Hore</mark> made \"repeated attempts\" to contact Folau directly and via his representatives on Thursday but that he failed to communicate with them. \"As a code we have made it clear to Israel formally and repeatedly that any social media posts or commentary that is in any way disrespectful to people because of their sexuality will result in disciplinary action,\" Castle said. \"In the absence of compelling mitigating factors, it is our intention to terminate his contract.\" Folau, one of the sport's top players, published a message on his Instagram account late Wednesday that hell awaits \"drunks, homosexuals, adulterers, liars, fornicators, thieves, atheists, idolators.\" The decision comes just five months before the start of the Rugby World Cup in Japan .------More AP sports: https: //apnews.com/apf-sports and https: //twitter.com/AP—Sports Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Facebook Twitter SMS Email Print Save Locations Australia Oceania New South Wales"}, {"articleID": "2009010609_00009953_W", "names": {"Mark Warner": ["Q14949474", "Q1617921", "Q21166633", "Q453893", "Q51299121", "Q6770231"], "Michael Steele": ["Q331838", "Q443813", "Q51709680"], "Mike Duncan": ["Q16207428", "Q361250"], "Jon Cohen": ["Q15069805", "Q16728126", "Q6270512"], "President Bush": ["Q207", "Q23505"]}, "date": "2009-01-06", "url": "http://truthdig.com/report/item/20090105_ej_dionne_party_chairmen/", "content": "e.j. dionne the message sent over the weekend may have been unintentional, but it was nonetheless powerful. while the candidates to chair the republican national committee prepared for a debate on monday sponsored by americans for tax reform, a reagan-era group, the democrats leaked word that their next national chairman would be gov. tim kaine of virginia. the message: while republicans are looking inward and focusing on appeals to the party's activist base, president-elect barack obama wants democrats to concentrate their energies on recently acquired political terrain and the new converts who were central to his party's sweep last year. of course, one can be too grand about the business of who leads a party's national committee. obama, not kaine, is the real head of the democratic party. governors and members of congress, not the national committee chair, will define the next republican party. moreover, the offer of the national chairmanship to kaine was widely interpreted as a kind of consolation prize for one of obama's earliest and most fervent supporters. but that understates the meaning of the choice. a top obama adviser, using trademark obama language, described kaine as \"a pragmatic progressive, less concerned about orthodoxies than about getting things done.\" in fact, obama is already following the path blazed in virginia by kaine and his predecessor, incoming sen. <mark>mark warner</mark>. their approach was to pursue broadly progressive policies in a non-ideological way and to speak of downplaying partisanship-even as doing so was their way of building the democratic party's brand and broadening its base of support. obama's initial meetings on monday about his stimulus package (and the incoming president's decision to go to capitol hill and not have congressional leaders come to him) were designed to send a strong message of collaboration. by contrast, republicans seem less focused on how to expand their party's appeal than on hunkering down to preserve ideological purity. for now, the underdogs in the chairmanship fight seem to be the two candidates outside the party's regional and ideological comfort zones, former maryland lt. gov. <mark>michael steele</mark> and michigan state chairman saul anuzis. they confront two southerners, chip saltsman of tennessee, now most noted for distributing the cd that included the \"barack the magic negro\" song, and katon dawson, the south carolina party chairman. the incumbent, <mark>mike duncan</mark> of kentucky, is seeking re-election, while former ohio secretary of state kenneth blackwell has emerged as the candidate of the conservative stalwarts. structurally, it turns out to be much easier for democrats than republicans to reach out to moderates because democrats are the more ideologically diverse party. i asked <mark>jon cohen</mark>, director of polling for the washington post, to use the 2008 media exit poll to break down last november's electorate by party and ideology. in one sense, republicans have the larger core base-21 percent of voters called themselves conservative republicans, while only 15 percent saw themselves as liberal democrats. but there are many more moderate democrats than moderate republicans: 18 percent of all voters considered themselves moderate democrats, while only 10 percent thought of themselves as moderate republicans. (five percent of voters called themselves conservative democrats and only 1 percent called themselves liberal republicans, who, sadly, are a dying breed .) thus, when democrats try to broaden their appeal, they are also addressing middle-of-the-road voters in their own party. republicans who want to reach out have to fight their party, which is overwhelmingly inclined to stick with the true conservative faith. republicans would do well to pay attention to another trend: the young are leaning left. voters under 30, according to the exit poll, are the only age group in which liberals outnumber conservatives, by a margin of 32 percent to 26 percent. and the last four years of the <mark>bush</mark> presidency clearly turned this generation off to the gop. in 2004, 18 - to 29-year-olds tilted only narrowly democratic, 37 percent to 35 percent. in 2008, 45 percent of the under-30s called themselves democrats; only 26 percent called themselves republican. right-wing loyalists can talk all they want about how president <mark>bush</mark>'s problem was that he wasn't \"conservative enough,\" but the numbers show they are misunderstanding their party's problem. obama and kaine are appealing to a moderate country moving gradually in a progressive direction, and have a party behind them prepared to grapple with the realities of politics now. whoever takes the helm of the gop will have to persuade a very conservative following that we are not living in ronald reagan's america anymore. e.j. dionne's e-mail address is postchat (at) aol.com. posts by unregistered readers are moderated. posts by members are you a human? retype the word you see here. a progressive journal of news and opinion. editor, robert scheer. publisher, zuade kaufman."}, {"articleID": "2010122221_00117459_W", "names": {"Ray Lewis": ["Q44428", "Q7297747", "Q7297749"]}, "date": "2010-12-22", "url": "http://bleacherreport.com/articles/551152-thomas-vermaelen-will-not-return-until-the-end-of-january-according-to-arsenal", "content": "arsenal: thomas vermaelen will not return until the end of january vermaelen has already missed half of the 2010-2011 campaign. the 25-year-old belgian defender has been out since late august due to an achilles injury. while vermaelen was initially reported to only be out for a couple of days, the injury proved to be much more serious. wenger stated two weeks ago that the vermaelen would return to action in january. his statement today clarifies that he won't be expected in the lineup until the end of that month. vermaelen was an astute signing by wenger, as he made a significant impact after arriving from ajax in the summer of 2009. the team has struggled defensively in his absence. according to wenger, \"he is short on fitness and we have to build it up. that will take three to four weeks...he has started now and the signs are good. but i have been hit so many times with backlash that i am very cautious with vermaelen.\" arsenal fans will find solace in the fact that both abou diaby and lukasz fabianski are expected to return to the squad for monday's premier league match against chelsea. finally, there is better news on the recovery of kieran gibbs, who has been struggling with an ankle problem for the past two weeks. what is the duplicate article? why is this article offensive? where is this article plagiarized from? bleacher report publishes the best arsenal newsletter on the internet. we're going to send you the most entertaining arsenal articles, videos, and podcasts from around the web. share the arsenal newsletter with contacts from select contacts from username @ gmail.com for your security, you'll be redirected briefly to arsenal's top gunners: ranking the best midfielders in club history arsenal's top gunners: ranking the best defenders in club history we'd like to send you the most entertaining bleacher report is a sports network driven entirely by passionate fans. our writers publish over 500 new articles every day, many of which are syndicated to cbssports.com, hearst newspapers, the los angeles times, nhl.com, and other leading media outlets. @ bleacherreport: on peyton hillis running for 144 in last meeting rt @ ravensinsider: <mark>ray lewis</mark>:' a blind cat will find a meal every once in a while .' copyright? 2010 bleacher report, inc. all rights reserved."}, {"articleID": "2019031401_00082610_W", "names": {"Paul Keating": ["Q15452628", "Q242654"], "Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"], "Tim Wilson": ["Q16205919", "Q17319084", "Q20055589", "Q50093894", "Q7804502", "Q7804503", "Q7804505"]}, "date": "2019-03-13", "url": "https://www.brisbanetimes.com.au/national/cbd-melbourne-the-pell-tolling-at-the-melbourne-club-20190313-p513ve.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "CBD Melbourne: The Pell tolling at the Melbourne Club CBD Melbourne: The Pell tolling at the Melbourne Club CBD Melbourne: The Pell tolling at the Melbourne Club By Samantha Hutchinson and Kylar Loussikian March 13, 2019--10.59 pmVery large text size \"What to do about George Pell?\" It's the question that has been asked up and down the local and international Catholic hierarchy, and in Melbourne's legal precinct, the state's corrections system and countless homes across the country. And now it's a topic of conversation inside the exclusive, gentlemen-only Melbourne Club, which has counted Australia's highest-ranked Catholic as a member since 1992. To be sure, it has been a week of headaches for Melbourne's coterie of blokes-only clubs, after Julian Burnside's on-air Damascus moment, deciding membership of an all-men club didn't fit with the brand of a Green-voting human rights defender. But the question of whether to let women on the members' roll is elementary compared to the weightier issue of what to do with a convicted sex offender who has already been given the privilege of joining. Advertisement The Melbourne Club's general committee did not respond to requests for comment on the status of Pell's membership. A club secretary also refused to confirm receipt of the questions. Pell is understood to have received his guernsey during his tenure as auxiliary bishop of Melbourne in 1992. Presumably his role afforded him honorary membership, a category sometimes provided gratis to senior members of the Defence Force, clergy, government and other fields of service. Other less decorated hopefuls--who pass the first requirement of possessing a Y chromosome--must be proposed and seconded, then supported by written references from seven additional referees, all of which have known the candidate for a minimum of 10 years. Credit: Matt Golding And that's all before the five-figure joining fee. Members say it's about weeding out the slouches. But those lucky enough to be admitted are expected to remain on their best behaviour for the entirety of their membership. Which means filing for bankruptcy can prompt a member to be turfed, as can adverse findings made by the courts. Members can't say if Pell will be sadder to give up the camaraderie, the annual turkey carve or access to what could be the city's prettiest courtyard and lawn, shaded by a fairy-lit, historically significant plane tree. But they are certain he'll miss the hospitality. He was often a guest in the club's hotel rooms on the second and third floors. Russelling up at AustralianSuper Don Russell always kept a curiously low profile, despite once being <mark>Paul Keating</mark>'s right-hand man. Now he's under consideration for a more public position--chairman of AustralianSuper, the country's largest superannuation fund, which manages more than $160 billion in savings. AustralianSuper's current chairwoman, former Reserve Bank board member Heather Ridout, was appointed to the position five years ago and her term will soon be up (although we have no doubt any future Labor governments will find her work). Old mates: <mark>Paul Keating</mark> and his former adviser Don Russell, who is in contention for the chair at AustralianSuper. Credit: AAP In addition to his time with <mark>Keating</mark>, Russell has had a gig at West AM and chaired State Super. Meanwhile, industry-backed funds have been increasingly contested territory as Treasurer Josh Frydenberg moves to seek new powers to stop apparent union activism. Ridout earlier this month declared AustralianSuper--which manages funds for members of the Australian Workers' Union and others--would not be \"dragged into industrial relations\" , but also accused the government of making retirement savings political. It's unclear whether Russell's appointment has been given the green light already, but his name has certainly been floated as the odds-on successor to Ridout. An announcement could come soon. Shaking the can and sharing the spoils The rattling noise filtering through the state is audible to anyone, as all the Liberal and Labor heavyweights in town attempt to fill the coffers ahead of their election efforts. Former Australia Post boss turned Latitude Financial chief executive Ahmed Fahour was the star at Bill Shorten's fundraising lunch at the Swisse HQ in Collingwood on Wednesday, where his anti-bank commentary was poorly received by the Westpac lobbyists in attendance. Know your audience: Former Australia Post chief turned low-tier lender Ahmed Fahour Credit: Markus Weber Woodside was also present, as was Allianz corporate affairs chief Nicholas Scofield, who we have learnt is a master of the shakuhachi (a type of flute) in the Chikuho tradition. Meanwhile, Prime Minister <mark>Scott Morrison</mark> headlined a fundraising bash hosted by Martyn Myer at the Collins Street HQ of the retailing dynasty's family office, before finishing the day at a comparatively lower-key \"Politics in the Pub\" affair at the Malvern Hotel, alongside Higgins hopeful Katie Allen. But it's not just about raising the cash. It's also about shoring up votes. Liberal MP <mark>Tim Wilson</mark> is expected to announce a handout of up to $9 million on Thursday to help the genteel Melbourne bayside suburb of Sandringham get the indoor netball courts it so desperately needs. And nothing screams \"save the furniture\" like the Liberals ploughing millions of dollars into one of their safest seats in the state."}, {"articleID": "2018020814_01017635_W", "names": {"Mandy Moore": ["Q187832", "Q6748314"]}, "date": "2018-02-07", "url": "http://refinery29.com/2018/02/190196/reasons-this-is-us-is-bad-from-mom", "content": "Kaitlin Reilly Photo: Courtesy of NBC My mother should have cried over Jack Pearson's television death. I did! If you scrolled through Twitter, it seemed like the entire world was weeping over Milo Ventimiglia's deceased patriarch, who survived a fire only to die of a heart attack hours later. My mother watches This Is Us. We've sat through episodes together, enjoying all of the Pearson family drama. Of course, that was back in season 1, when my mom was convinced NBC would give us an answer about Jack's death within the freshman season. (My mother didn't watch Pretty Little Liars so she has no television patience .) Advertisement So, when I called my mother to chat about \"Super Bowl Sunday,\" the season 2 episode where Jack met his ultimate demise, I was met with two words: \"It sucked.\" (You should know that, growing up, I was never allowed to utter this phrase, as it fell under the umbrella of \"fresh.\" But anywaysssss .) I spent a few minutes making my case for This Is Us and Jack's death, which broke me so much that I texted my boyfriend to come home from a Super Bowl party \"because This Is Us is too sad.\" My points to my mother were as such: Jack sacrificed himself for his family without even knowing it! He loved Kate (Chrissy Metz) so much that he would rather grab her dog from a burning building than see her sad! How could one not squeeze out a single tear when <mark>Mandy Moore</mark>'s Rebecca sees Jack's dead body? Alas, my points fell on deaf ears. Instead, my mother made a list (yes, a literal list) of all the reasons why Jack's death on This Is Us, and all of the drama surrounding it with the Pearson clan, totally and completely sucks. Here are her reasons, paraphrased from her own words. 1. Jack had zero idea what he was doing in the fire scene. Why would he insist on bringing everyone into one bedroom when the house was burning up? My mother, who clearly paid more attention at the Firehouse Festivals they held in our town (real thing, there was even a smoke house where you had to faux-escape a burning building) insisted that it was much more dangerous to go through the hallway lest the ceiling collapse and kill everyone. Advertisement \"But he was trying his best,\" was what I squeaked out, afraid she might be right that Jack's \"fight the fire with the mattress\" plan was not the most sound. 2. Why destroy the Crock-Pot brand? My mother, for some reason, took a very big offense to the show's decision to have a slow cooker be the instrument of Jack's death, even though the year of Jack's demise may have also been the last time my mom actually cooked anything. (Sorry. Love you .) Fortunately for my mother, Crock-Pot has bounced back thanks to a fantastic PR plan. 3. Old Rebecca looks ridiculous. This has actually been an argument my mom has had since season 1, but it resurfaced thanks to new gripes with the NBC series. Personally, I think that This Is Us does a fantastic job making <mark>Moore</mark> look like she's in her 60s (<mark>Moore</mark>, in real life, is even younger than the stars who play her children), but my mom insists that Rebecca looks like she's in a school play. What does this say about the production quality of my high school musicals? I'm not really sure. 4. Everyone is a whiner. (My mom is a pre-school teacher .) This may be the episode where everyone remembers the anniversary of their father's death, intercut with actual flashbacks of his death, but no. . Kate (Chrissy Metz) is a whiner. Kevin (Justin Hartley) is a whiner. My mother has no time for whiners. 5. Jack's death did not warrant the massive wait. I think my mom wanted Jack to die in some, Rube Goldberg machine-type accident, in order to make the season-and-a-half arc feel more earned. Instead, he died of a heart attack, which my mother insists the doctors would spend a lot more time trying to treat. My mother has not seen the pilot of The Resident, which revealed why that's not always the best plan. Advertisement 6. Randall (Sterling K. Brown) needs to get his shit together. This one was kind of like a punch to the gut, as Randall is the best. She does not think that Beth (Susan Kelechi Watson) should put up with all of Randall's mid-life crisis theatrics. (Sorry, Randall .) So. Is my mother...right? Did This Is Us jump the shark with Jack's death, and the subsequent drama surrounding it? Considering I still can't think about it for too long without becoming a puddle of tears, I'm going to say no...though she may have a point about Kevin's whining. Read These Stories Next:"}, {"articleID": "2015080911_00005328_W", "names": {"John O'Farrell": ["Q5018672", "Q6250876"]}, "date": "2015-08-09", "url": "http://www.illawarramercury.com.au/story/3262640/st-michaels-a-look-back-at-the-early-days/?src=rss", "content": "St Michael's Primary School in Thirroul is celebrating its 75th anniversary. JODIE DUFFY takes a look back at the school's early days. St Michael's class of 1940. St Michael's Thirroul 1955 sixth class girls in hats. It was not long after Sister Thecla Sullivan had taken her final vows that she established a Catholic primary school in Thirroul, 75 years ago. She had travelled by train with the slightly older Sister Alphonsa Jones, who was to be her boss and companion for the next five years. Together they were to be the founding nuns of St Michael's Catholic Parish Primary School. Sister Thecla was 24, and even in her dark brown, heavy habit, in the height of summer, you could tell she was an attractive woman. There was a kindness in her eyes and smile. Even long after her looks had faded and her habit had been replaced with more comfortable civilian clothing, at almost 100 years old she was still a striking woman. The nuns arrived in Thirroul two weeks before the start of the new teaching year in 1940 and were shocked to discover there was no school building, no teaching resources and no convent in which to live. There was also no warm welcome from the parish priest. While the northern suburbs Catholic community had rallied support for a new school, it appears Father <mark>John O'Farrell</mark> may have been less than enthusiastic about having two females in his realm. On January 28 he announced to his congregation that classes would begin inside the church for kindergarten to year 3 students. Older Catholic children would have to remain at the nearby Thirroul Public School or travel by train or bus to St Joseph's Convent School at Bulli. \"To our horror there was no school, but we were informed that we would teach in the church,\" wrote Sister Thecla just before her oak jubilee in 2014. \"We were given a quarter of the church with two blackboards on easels. That was the extent of the school's equipment.\" With no resources or money provided by the parish, Sisters Thecla and Alphonsa caught the train back to Sydney to purchase the basics with the & pound; 5 they had been given by their superior, Sister Marcellinus. The money stretched to buy chalk, dusters and a few textbooks. On their return they met with the school's 34 new students. The first intake lined up and stood tall against the outside northern wall of the church, eager to meet their new teachers. Pat Cadogan (nee Agnew) recalls that everyone was excited. St Michael's founder Sister Thecla Sullivan with a student on Holy Communion Day. Sister June Bath (middle row, second from left) at St Michael's Thirroul with a group of nuns. \"I remember the day we enrolled,\" says Pat. \"The nuns asked what year we were in. I put myself up a grade. Gave myself a bit of a promotion. They realised later and amended the error. But it was an exciting time. Our parents all wanted us to have a Catholic education. It was important to them.\" Inside the church a curtain was put up to divide the altar from the students and the pews were pushed aside to make way for desks. The \"neatly kept\" blackboards were the only division between the classes. \"The nuns battled on under trying conditions,\" explains Ron Tuckerman, a student from the first intake. \"In the beginning they had to go out and solicit donations to buy chalk.\" Another student, Arthur Martin, remembers that on the first day of the new school Father <mark>O'Farrell</mark> was reluctant to hand over the keys to the church. \"I remember we were all lined up on the first day outside the church waiting for the nuns to get the keys. Eventually they did but I think it would be fair to say that the parish priest didn't want the nuns in his church, at least to begin with,\" says Arthur. With not much room in the school grounds, Sister Thecla would walk her pupils to a nearby empty paddock to play rounders. Rolling up the sleeves of her habit she would join in the game using a fence picket as a bat. \"She loved it. She was very active and could really whack the ball,\" says Ron. \"She would roll up the sleeves to the elbows and run. Everyone always wanted to be on her side.\" During the war, air raid shelters were dug in the paddock and the nuns would plant religious medals and sprinkle holy water in there each Friday to protect their charges in the event of an enemy invasion. Also, at the end of each week, as a treat, Sister Thecla would share with them Australian stories like Blinky Bill and We of the Never Never. \"Sister Thecla was fantastic. We were all in love with her,\" adds Arthur. \"She was just so kind to everybody. Sister Alphonsa was the school principal and a bit more serious.\" By the end of the year more than 90 students had enrolled at St Michael's. \"The school was quite primitive,\" says Sister Tess, a Josephite nun and Sister Thecla's niece. \"It was a stark contrast to the beautifully built public school across the road. The irony of it was that the students came in droves to this poor little school with no proper facilities. I think the two nuns must have had some kind of charisma for that to have happened.\" While a cottage had been purchased near the church for a convent in 1927, the nuns did not move in until 1950. The parish rented it out to tenants. The nuns were forced to travel each day from the Sisters of St Joseph's Bulli convent, which was a hardship for them. Around mid-year Father <mark>O'Farrell</mark> was replaced by Father James Mullin. \"Initially the nuns believed that Father Mullin didn't support them,\" explains Ron. \"But he had been left with a difficult financial situation. When he arrived he had to replace furnishings in the presbytery. He was also left with a huge debt from the extensions to the church in 1939. So in the early years he was limited in how much he could support the nuns. They were tough times. But it didn't dampen the enthusiasm to start the school, and everyone wanted to see it succeed.\" The parish had attempted to buy land near the church to build the school but the Protestant owners refused to sell. In the end hotelier and entrepreneur Johanna Ryan came to the rescue, purchasing the land. She immediately handed it over to the parish with the provision that a Catholic school be built within 10 years of her death (a new school building was constructed in 1951). Mrs Ryan also provided a little stove for the nuns so they could cook their lunch in the sacristy and kept them in bread each day. A Catholic butcher in Thirroul donated meat. Each Friday the nuns would send one of their students, Tony Bolt, who later became a priest, to pick up fish and chips for their lunch. They often shared what was left with those students who would help clean up the church at lunchtime or after school. \"There was just the one learning area at the back quarter of the church,\" remembers Father Tony Bolt. \"We did not see anything strange about this crowding. The nuns managed crowd control very effectively. Noise was not a problem. The teachers were very much in charge.\" At the time Australia was a sectarian society divided between Catholics and Protestants. Mixed marriages were frowned upon and in some cases family members were disinherited. Catholics stuck together and the church and school community became the focus of life. Father Bolt says there was a sense that Catholics were the underdogs, with government funding for education going to public schools. \"We did not feel badly done by because the results in bursaries and scholarships came more frequently to us,\" he says. \"The dedication and interest of the sisters made all the difference.\" In the '40s and '50s life in the convent was strict. As she grew as a teacher, Sister Thecla would always be an advocate for fair play and justice, but she could also be daunting and forthright, says Sister Tess. She had a shadow side and was exacting about the proper way to do things. \"She had a strict code, a stern exterior and a heart of gold,\" says Sister Tess. Sister June Bath was also a student in the church in those early years. \"I remember my first day of kindergarten in the church,\" she says. \"I had Sister Alphonsa. I was five. She was very gentle and kind to us.\" Sister June was in year 6 when she decided to become a Josephite nun. She was 13 when she was sent to boarding school at Hunters Hill to begin her training as a nun. \"My father didn't want me to go. I know I was young but you've got to do what God wants you to do,\" she says. She became a postulant after her Leaving Certificate. Josephite nun Sister June Bath returns to St Michael's Catholic Primary School where she went to school in the 1940s and where she taught for a year in 1979. Past and present students and staff have celebrated the school's 75th anniversary all week. Picture: KIRK GILMOUR \"I liked the spirit of the Josephites. I had grown up with them. The nuns impressed me with the simple way they lived. The fact that they cared about people. That was the main thing. I liked how they didn't put themselves above other people. It's an Australian order, for the Australian people.\" Sister June returned to St Michael's in 1979 to teach year 2 for a year. \"I was pleased to be closer to my family [who lived at Austinmer],\" she says. \"But it was strange being at the school. When I walked into the classroom I could tell I had been to school with the parents of some of my students. I recognised them straight away.\" Both current and former students and staff have spent a week marking the 75th anniversary of St Michael's Catholic Parish Primary School. The celebrations coincide with the Feast Day of St Mary of the Cross MacKillop, the founder of the Order of the Sisters of St Joseph."}]