[{"date": "2018-04-11", "url": "https://pagesix.com/2018/04/11/saint-laurent-heir-may-not-be-happy-with-new-book/", "content": "Saint Laurent heir may not be happy with new book Richie Sambora to reunite with Bon Jovi The reclusive heir to the Saint Laurent fashion fortune is said to be unhappy with a new book. Garden designer Madison Cox, 59, is a key figure in \"Loulou & Yves: The Untold Story of Loulou de La Falaise and the House of Saint Laurent\" by Christopher Petkanas, out Tuesday from St. Martin's Press. The handsome Cox got married to Saint Laurent's longtime business partner, Pierre Bergé, a few months before Bergé died this past September at the age of 86, leaving Cox an estate believed to be worth more than $1 billion. Petkanas was set to speak next month at Boscobel House and Gardens in Garrison, NY, but the event was mysteriously canceled, and the author believes friends of Cox lobbied to quash it. \"I had a signed contract, and they pulled the rug out from under me,\" Petkanas told me. A spokeswoman for Boscobel said: \"We came upon an unanticipated conflict and had to cancel the lecture .\" A spokesman for Cox said he was \"unavailable for any comment .\" Cox is also director of the Saint Laurent museums in Paris and Marrakech, Morocco, and president of the Pierre Bergé-Yves Saint Laurent Foundation. \"Madison is enormously rich and has a huge budget at his disposal. His friends are fiercely protective,\" Petkanas said. Cox might be upset because the book adds color to the rumors that despite his marriage to Bergé, he has a longtime boyfriend, Jaimal Odedra. The marriage took place possibly to ensure Bergé's will couldn't be contested. Cox's friends were unable to put the kibosh on the book's Tuesday launch at <mark>Marc Jacobs</mark>' Bookmarc store on Bleecker Street, or on Petkanas' talk with Fern Mallis the following night at the 92nd Street Y on a panel with Pat Cleveland and Simon Doonan. Share this:", "articleID": "2018041123_00103632_W", "names": {"Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"]}}, {"date": "2018-04-12", "url": "http://www.mystatesman.com/sports/college/penn-state-sloppy-full-teachable-moments-11th-spring-practice/JPbMle2KHTggCHy7ubkJOK/", "content": "sports By Audrey Snyder - Land of 10...Posted: 9:07 p.m. Wednesday, April 11, 2018 STATE COLLEGE, Pa.--Quarterback Trace McSorley raised his voice to a level that hadn't been heard before--at least not by reporters--as he pulled aside Danny Dalton for a teachable moment during Penn State's Wednesday night spring practice. Dalton, one of the Nittany Lions' many tight ends vying for an increased role this year, got an earful from Penn State's fiery quarterback after he was caught from behind and Cam Brown forced a fumble. The quarterback then tapped Dalton on the helmet after the exchange was over on the sideline as if to pick him up and say all is well. It was just one of those off nights for the Nittany Lions on the practice field, and McSorley wasn't the only one fired up following Penn State's practice inside Holuba Hall. \"I wasn't happy with today,\" <mark>James Franklin</mark> said after the 11th practice of the spring. \"We're a mature football team. You guys know we never run guys after practice, that's junior high stuff. I thought we were sloppy today. You guys know I'm a pretty positive guy, but I thought we were too sloppy, had too many penalties, balls on the ground, dropped balls, just a lack of discipline. I was not pleased today, but overall I thought we've had a damn good spring, but I was not pleased with today .\" <mark>Franklin</mark> had his players line the sideline for a series of wind sprints to conclude the workout, only to huddle them up and then send them back out for another sprint. He paced the field as they ran back and forth. The team's lack of focus was something that he said ultimately falls on him and on Penn State's leadership. \"Great teams, good teams don't do that,\" <mark>Franklin</mark> said of the sloppy practice. \"Obviously we've got a lot of growing up to do. It was unacceptable on every level. We'll never accept poor performances in the classroom, we'll never accept poor performances on the football field and we'll never accept poor behaviors in the community .\" Chemistry and leadership are often built during the offseason and <mark>Franklin</mark> was pleased that McSorley stepped up and displayed vocal leadership when getting on Dalton. While McSorley is the player teammates huddle around before games on Saturdays in the fall, his experience heading into his senior season should help the younger players understand what it takes in the spring to achieve success. <mark>Franklin</mark> hopes others continue to be more vocal, as well. If that means laying into a teammate for a lack of execution and then picking them right back up afterward, <mark>Franklin</mark> is all for it. \"I think he saw some things like I saw today that are unacceptable. Lack of focus, lack of finish, lack of mentality, lack of championship habits which is what we talk about all the time,\" <mark>Franklin</mark> said of McSorley. \"I would hope guys like Trace and <mark>Nick Scott</mark>, guys who've played a lot of football for us would speak up and hold themselves accountable and hold other guys accountable and call people out .\" I think that's one of our problems now in our society and especially specific to sports and specific to young people, everybody wants to be a leader by example and no one wants to be a vocal leader, \"<mark>Franklin</mark> continued .\" I don't care, in any organization, on any team you have to have some verbal leaders that are willing to speak up and tell people what they need to hear, not what they want to hear. \"<mark>Franklin</mark>'s message to the team after he huddled them after the second set of sprints didn't fall on deaf ears .\" We just need to pick it up, \"running back Miles Sanders said .\" We let this day slip away from us ....I think this is our 11th practice, so, yeah, we just let this day slip away from us. . \"Other observations from the 11th practice of the spring: • <mark>Franklin</mark> said defensive end Shane Simmons is now more than 250 pounds after being\" undersized \"last year during his redshirt freshman season. Shaka Toney's weight is also up as <mark>Franklin</mark> said Toney is\" finally getting bigger and stronger. \"<mark>Franklin</mark> said defensive end needs to be an area of strength while the defensive tackles mature. • Sanders spent extra time this offseason working on catching passes out of the backfield. How has Sanders looked this spring?\" The challenge is he'll make four people miss and go 80 [yards] and we're all like, \"Next play' because we've been spoiled with Saquon Barkley for the last couple years,\" <mark>Franklin</mark> said. \"I do think Miles is in that conversation in terms of what he's been able show and what he's been able to do so far .\" • Penn State worked a few scenarios toward the end of the practice, including one from late in the game with Ohio State. <mark>Franklin</mark> likes to go back and highlight different scenarios from crunch time from seasons past to reinforce why they're out there going through so many scenarios even on a dreary day in mid April. • Punter Blake Gillikin, whom <mark>Franklin</mark> said last week could also take on kickoff duties this season, did so Wednesday. Gillikin is also the team's No. 2 kicker for the spring and is also the holder. Realistically, punting, holding and kickoffs could all be on his plate this fall. • Redshirt freshman CJ Thorpe might be Penn State's top lineman in the run game, <mark>Franklin</mark> said. Thorpe's nastiness was praised last year on the scout team and has carried over to the spring. For a line that was criticized by <mark>Franklin</mark> for lacking that nasty streak at points last season, that's a development worth noting. However, Thorpe needs to improve in pass protection. \"I want us to play with that mentality, to play with that edge,\" <mark>Franklin</mark> said. • Fellow redshirt freshman O-lineman Des Holmes is excelling in pass protection and needs to continue improving in the run game, <mark>Franklin</mark> said. Both Homes and Thorpe are 315-plus pounds and got what <mark>Franklin</mark> called \"unbelievable\" reviews for their scout team work last season. • McSorley has been high on Dalton this spring, praising him just last week for his development. Penn State needs someone to step up at tight end, which perhaps was part of McSorley's momentary frustration. The post Penn State sloppy, full of teachable moments in 11th spring practice appeared first on Land of 10. Popular in Sports 1 2 3", "articleID": "2018041202_00067469_W", "names": {"James Franklin": ["Q14950689", "Q14950690", "Q3530165", "Q3895609", "Q56807312", "Q6134186"], "Nick Scott": ["Q21622776", "Q43388432"]}}, {"date": "2018-04-12", "url": "https://www.channelstv.com/2018/04/12/winnie-mandelas-football-club-a-blot-on-her-legacy/", "content": "FILE COPY Willie Mandela Photo Credit: AFP \"Winnie Mandela was there. She is the one who started beating all of us. The rest followed, for at least one hour, if not two,\" said Thabiso Mono. He is still haunted by that night in December 1988 when he was kidnapped with three other anti-apartheid activists in an incident that has been at the centre of a debate about Winnie Mandela's legacy since her death earlier this month. \"I was surprised, I could not understand what was happening,\" Thabiso told AFP, strain audible in his voice. \"We thought that when we were around her we were very secure .\" Winnie Mandela died on April 2 at the age of 81 and is remembered by many South Africans for her courageous role in the fight against white rule and her 38-year marriage to Nelson Mandela. But in the late 1980s her bodyguards, dubbed Mandela United Football Club (MUFC) and easily identifiable by their yellow tracksuits, inflicted a reign of terror on the Soweto township near Johannesburg. MUFC had nothing to do with soccer. The gang was implicated in kidnappings, torture and murder in circumstances which remain mired in confusion. Before he was brutalised, Thabiso--then 19--was kidnapped in Soweto by the \"club\" along with three acquaintances--Stompie Seipei, whose murder became emblematic of the MUFC's violence, Pelo Mekgwe and Kenny Kgase. \"We went to Winnie's house in Diepkloof,\" a district of Soweto, said Pelo who is now an army sergeant. \"The beatings happened in her property, in a back room .\" \"I am not angry anymore' The youths were repeatedly struck with fists, bottles, sticks and whips .\" We had bruises all over the body, \"said Thabiso, now 48. Just days later the body of 14-year-old Stompie was found on a riverbank near Soweto. The other three were released after their ordeal. The group was targeted because Stompie was suspected of being an informant for the apartheid security services. The others were accused of having sexual relations with a white priest who lived in Soweto, Thabiso and Pelo recalled. A portrait of Stompie, along with an image of Nelson Mandela, greets visitors to the impoverished township where he was born in the central province of Free State. His tombstone is overgrown with wild grass and withered thistles. Nearby in the modest, tin-roofed family home, Stompie's mother has given several media interviews following Winnie Mandela's death .\" I am not angry anymore. The past is the past. I want to let it go, \"Mananki Seipei told AFP in her kitchen. Her fridge door is adorned with a black and white image of her son who she describes as her\" hero \". She recalled her late 1990s meeting with Winnie Mandela on the sidelines of the country's Truth and Reconciliation Commission (TRC) which was tasked with examining and exposing the political crimes and abuses of the apartheid era .\" Winnie asked for forgiveness and we made peace, \"said Mananki. In court, Winnie Mandela was sentenced on appeal to a suspended two-year prison term and a fine for her role in the kidnapping and violent treatment of Stompie and his three friends. <mark>Jerry Richardson</mark>, a prominent member of MUFC, was sentenced to life in prison for Stompie's murder .\" A shadow that has followed her' \"One has to say that something went wrong--horribly, badly wrong,\" said one of her most prominent supporters archbishop <mark>Desmond Tutu</mark> at the TRC which he chaired. The lingering pain is still felt by all three, who must weigh up Winnie's mixed legacy and the role she played in their lives. Both Mananki Seipei and Pelo Mekgwe will attend Winnie's state funeral this Saturday in Soweto. Thabiso is not planning to go but said: \"I think that we must all remember her for the sacrifices she made. She might have made mistakes like anybody could do .\" Pelo still wonders what motivated the sadistic violence of some members of MUFC. \"Some of them were...working for the security police,\" he speculated, a widely-held view among those who believe the apartheid regime would have stopped at nothing to discredit Winnie Mandela. Former security branch policeman Paul Erasmus, who was involved in efforts to subvert anti-apartheid groups, claimed this week that the \"entire soccer club was security branch, informers\". Whatever the loyalties of MUFC, their brutality \"is a shadow that has followed (Winnie) for the last 30 years\" , said Paul Verryn, the priest who was sheltering Stompie and his friends before they were abducted. She was \"just as bright as the sun\" but also \"dark (as) the night\" , added Verryn. \"(But) the real culprit was the violent repression we were living under where the boundaries and the filters that would be in a normal society had disappeared .\" AFP", "articleID": "2018041213_00189110_W", "names": {"Desmond Tutu": ["Q43033", "Q48815071"], "Jerry Richardson": ["Q27915159", "Q6184318"]}}, {"date": "2018-04-12", "url": "https://www.moviefone.com/2018/04/12/westworld-jeffrey-wright-weirdest-fan-theory/", "content": "\"Westworld' Actor Debunks\" One of the Weirdest' Fan Theories He's Heard Posted April 12, 2018 by Stephanie Topacio Long \"Westworld\" is a unique show, so is it any surprise that the fan theories about it are equally so? For every twist and turn the show has given us, fans have come up with millions more options for where the show could go. Fan theories have been known to get pretty wild, and it seems like the cast enjoys these ideas. During a recent interview with the U.K.'s Independent, Jeffrey Wright (<mark>Bernard Shaw</mark>) shared a particularly strange one he heard. \"One of the weirdest that I took in,\" he said, \"was the notion that because the weather never changes in\" Westworld' they must be in a biosphere underwater. \"As creative as the idea is, it apparently doesn't have any credence. Wright promptly debunked the theory, explaining,\" I was like, \"No dude, the weather doesn't change because we shoot in LA.'\" Fans aren't the only ones who come up with ideas about the show's secrets. Evan Rachel Wood (Dolores Abernathy) also spoke to the Independent and shared that she and her fellow \"Westworld\" actors got together during Season 2 and \"compared notes .\" Wood noted that \"part of the fun is figuring things out\" and thinks the audience will enjoy how complicated Season 2 is. \"I'm excited to hear the theories because I think there's going to be quite a lot of them,\" she said. The upcoming episodes will explore the aftermath of Season 1, which ended in a host revolt. Let's see if anyone can top the underwater biosphere idea. \"Westworld\" Season 2 premieres April 22 at 9 p.m. ET/PT on HBO. [via: The Independent] Westworld HBO TVMA October 2, 2016 74 metacritic Based on 43 critics Exploring the dawn of artificial consciousness and the evolution of sin. Read More Watch on iTunes Store Amazon.com VUDU HBO XFINITY tags fan theories hbo Jeffrey Wright westworld Westworld Season 2 categories Tv News", "articleID": "2018041223_00175435_W", "names": {"Bernard Shaw": ["Q10537487", "Q322736", "Q4893642"]}}, {"date": "2018-04-15", "url": "http://sciencedaily.com/releases/2018/04/180414171614.htm", "content": "Follow all of ScienceDaily's and! latest research news top science headlines Science News Scientists find positive workplace experiences among Americans with disabilities National survey demonstrates that Americans with disabilities are striving to work and overcoming barriers Date: Kessler Foundation Summary: A multidisciplinary team of researchers have authored a new article that identifies how Americans with disabilities are striving to work and overcoming barriers to employment. Share: FULL STORY A multidisciplinary team of researchers at Kessler Foundation and the University of New Hampshire, Institute on Disability (UNH-IOD), have authored a new article that identifies how Americans with disabilities are striving to work and overcoming barriers to employment. Their findings are detailed in \"Striving to work and overcoming barriers: Employment strategies and successes of people with disabilities,\" which was published online February 26, 2018 by the Journal of Vocational Rehabilitation. The authors are <mark>John O'Neill</mark>, PhD, and Elaine Katz, MS, CCC-SLP, of Kessler Foundation, and Vidya Sundara, PhD, OTR/L, <mark>Andrew</mark> Houtenville, PhD, Kimberly G. Phillips, PhD, Tracy Keirns, PhD, and <mark>Andrew Smith</mark>, PhD, of UNH. advertisement People with disabilities experience persistent obstacles to employment, resulting in poorer labor force participation, higher unemployment rates, and lower wages earned compared to people without disabilities. Identifying the strategies and resources necessary to sustain people with disabilities in paid employment is the first step toward increasing the participation of this population in the workforce. Findings of the 2015 Kessler Foundation National Employment and Disability Survey (KFNEDS) show that people with disabilities are actively engaging in job preparation and job search activities, and successfully negotiating barriers at work. \"Approximately 69 percent of those surveyed are striving to work, which is defined as working, actively preparing for employment, searching for jobs, seeking more hours, or overcoming barriers to finding and maintaining employment\" said Elaine Katz, senior vice president of grants and communications at Kessler Foundation. \"By focusing on the successful outcomes of jobseekers and employees with disabilities, rather than the barriers, we are reframing the discourse and adding to the growing body of knowledge on best employment practices .\" A substantial percentage of employees reported experiencing--and overcoming--barriers to finding and maintaining employment, including insufficient education or training, negative attitudes of supervisors and coworkers, inaccurate assumptions on ability, pay disparity, and lack of transportation. Over 42 percent of survey respondents were currently working, with 60.7 percent of those working more than 40 hours a week. Other findings showed that approximately 50 percent of the respondents used workplace accommodations and were satisfied with their jobs, and nearly 90 percent felt accepted in their workplace. \"This review highlights the strategies people with disabilities use to search for work and navigate barriers, a topic largely overlooked in contemporary disability and employment research,\" explained <mark>John O'Neill</mark>, PhD, director of disability and employment research at Kessler Foundation. \"Our hope is that this information will aid the development of targeted policies and programs that foster long-term increases in workforce participation among Americans with disabilities .\" Further research exploring the efficacy of practices that employers use to recruit, hire, train, and retain people with disabilities in their organizations, from the unique perspective of supervisors of employees with and without disabilities, is presented in the 2017 Kessler Foundation National Employment and Disability Survey: Supervisor Perspectives. advertisement", "articleID": "2018041503_00035500_W", "names": {"Andrew Smith": ["Q14330096", "Q15637779", "Q16116774", "Q16193862", "Q16244589", "Q18352207", "Q19474813", "Q20713799", "Q20922198", "Q21456626", "Q21501584", "Q24005645", "Q25189558", "Q26831165", "Q28378643", "Q28835024", "Q28870725", "Q30717045", "Q334296", "Q38361975", "Q4758601", "Q4758603", "Q4758604", "Q4758605", "Q4758606", "Q4761331", "Q50326709", "Q506331", "Q507501", "Q507502", "Q58146205"], "John O'Neill": ["Q16122131", "Q2628718", "Q53536543", "Q54771468", "Q6250976", "Q6250980", "Q6250982", "Q6250984", "Q6250987", "Q6250991", "Q6250993", "Q6250995", "Q6251003"]}}, {"date": "2018-04-15", "url": "http://abc11.com/news/comey-says-his-assumption-clinton-would-win-was-a-factor-in-the-email-investigation/3345493/", "content": "LIVE VIDEO Wheelmobile at Streets at Southpoint in Durham Watch Now share tweet share email Comey says his assumption Clinton would win was' a factor' in the email investigation SHARE: share tweet share email SHARE share tweet share email ABCNews LAUREN EFFRON Sunday, April 15, 2018 02:04 PM James Comey said his decision to announce that the FBI was going to look back into the Hillary Clinton email investigation just days before the election was influenced by his belief that she would beat <mark>Donald Trump</mark> and his desire to make sure that the election results were viewed as legitimate. \"I don't remember consciously thinking about that, but it must have been because I was operating in a world where Hillary Clinton was going to beat <mark>Donald Trump</mark>, and so I'm sure that it was a factor,\" Comey told ABC News' chief anchor George Stephanopoulos in an exclusive interview ahead of the April 17 release of his book, \"A Higher Loyalty: Truth, Lies, and Leadership .\" \"I don't remember spelling it out, but it had to have been, that she's going to be elected president and if I hide this from the American people, she'll be illegitimate the moment she's elected, the moment this comes out,\" he added. This comment goes further than what Comey wrote in his book, in which he says, \"Like many others, I was surprised when <mark>Donald Trump</mark> was elected president. I had assumed from media polling that Hillary Clinton was going to win. I have asked myself many times since if I was influenced by that assumption. I don't know. Certainly not consciously, but I would be a fool to say it couldn't have had an impact on me .\" Clinton previously has said that she thinks the letter Comey sent to Congress on Oct. 28, 2016, announcing that the FBI would be looking back at the email investigation, just 11 days before the election, killed her chances of winning. When asked about if the letter had done so, Comey said \"I hope not. I don't know. I honestly don't know. I sure hope not .\" Comey said that part of the reason he chose to write a book about his experiences was to share his perspective, and he hopes readers \"try to realize that I'm not trying to help a candidate or hurt a candidate; I'm trying to do the right thing .\" When asked if he would still release the letter if he knew that doing so would help elect <mark>Donald Trump</mark>, Comey said, \"I would. I would .\" He said that on the morning that they were going to release the letter, a colleague asked him if he should consider how the letter could help <mark>Trump</mark>. \"I paused, and then I said,\" Thank you for asking that question. That's a great question. But the answer is not for a moment because down that path lies the death of the FBI as an independent force in American life. If I ever start considering whose political fortunes will be affected by a decision, we're done,' \"Comey said. Stephanopoulos pressed Comey on the decision, saying,\" there's no precedent for putting out information like this at the end of a campaign. \"\"I think I did it the way that it should have been done,\" Comey said. \"I'm not certain of that. Other people might have had a different view. I pray to God no future FBI director ever has to find out .\" Watch the exclusive interview in a special edition of \"20/20\" on Sunday, April 15 at 10 p.m. ET on ABC. Related Topics: abc news national SHARE: share tweet share email (Copyright © 2018 ABC News Internet Ventures .) Top Stories Severe storms looking more likely this evening Raleigh man dies in stabbing Wheelmobile is in Durham today! Hundreds attend 2nd Amendment rally in Raleigh Starbucks CEO apologizes after video of Phila. arrests goes viral Suspect wanted in shooting Harnett County sheriff's deputy caught Check your eggs! 200 million eggs recalled over salmonella fears Starbucks responds after video of arrest in Philly store goes viral Show More Tree falls on wagon carrying 50 people at NC zoo park Fayetteville man missing in Bladen County state park found dead PHOTOS: Wheelmobile visits Raleigh, Durham Fourth suspect arrested in Sanford car wash murder Man dies after being found shot in road in Lumberton More News", "articleID": "2018041518_00063848_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2018-04-16", "url": "http://ktbs.com/sports/national/winter-storm-delays-start-of-green-bay-packers-offseason-program/article_1827fdae-8ce9-56c9-adf1-552e92f4ef9d.html", "content": "Winter storm delays start of Green Bay Packers' offseason program JASON WILDE For the State Journal 8 min ago Save GREEN BAY--Justin McCray would have been one of the lucky ones. Already in town working out for most of past week, the Green Bay Packers second-year offensive lineman would've avoided the travel issues many of his teammates encountered because of the second-worst snow storm in Green Bay history. Except McCray left late in the week for Atlanta, where he was standing up in his cousin's wedding on Saturday night. As a result, while he was able to celebrate with the newly minted Mr. and Mrs. Earnest and Annette Gaines, he wasn't able to make it back in time for what was supposed to be the kickoff of the team's official offseason program on Monday. \"I'm giving (the groom) a hard time about it,\" McCray said from his hotel room near the Hartsfield International Airport, where he spent Sunday night hoping to make it to snowy Green Bay sometime Monday. \"But it's all jokes .\" The storm, however, was no joke. Because of the travel challenges it created for his players, Packers coach <mark>Mike McCarthy</mark> pushed the start of the offseason workouts back a day to Tuesday--weather permitting, of course. Among the players who weren't able to get into town as planned was quarterback Aaron Rodgers, who was slated to fly in but said in a text message his flight wouldn't be able to get in on Sunday night as scheduled. But he was hardly alone. The workouts are technically voluntary, although the Packers have historically had extremely high attendance for the offseason program, in part due to the money they invest in workout bonuses to incentivize the sessions for players. Those players already in town can work out on their own at the team facility on Monday, per NFL rules, but Tuesday will now be the first day of official workouts. The bizarre April storm won't cost the Packers any sessions, a club spokesperson said, as they weren't required to begin on Monday. According to the National Weather Service's Green Bay office, the storm had dumped 23.2 inches in Green Bay at of 4 p.m. Sunday--making it the area's largest snow storm in 130 years, or dating back to before the Packers came into existence in 1919. The only time more snow fell on Green Bay during a single storm was on March 1-2, 1888, when the area received 29 inches. (The biggest April snow storm recorded in Green Bay before this was in 1977, when 11 inches fell .) While McCray was spending an unexpected extra night in Atlanta, he got off easy compared to fellow offensive linemen Lucas Patrick and <mark>Kyle Murphy</mark>, who got stuck at the Minneapolis-St. Paul airport on Friday night and had quite the odyssey from there. Patrick, who was connecting from Portland, Oregon, and <mark>Murphy</mark>, who was coming back from California, were in the Delta Airlines airport lounge at 2 a.m. Saturday morning and caught a few hours of sleep there. After getting rebooked on a Sunday flight into Appleton, they headed to the nearby Mall of America later Saturday morning where Patrick realized--about the same time that the mall was closing due to the weather in the Twin Cities--that he had a bit of a wardrobe emergency. \"I was out of clean undergarments,\" Patrick recounted. \"So we kind of ran around the mall to find only Sears was open--so (at least) I could get some fresh socks and underwear .\" The pair stayed at an airport hotel Saturday night and then endured a bumpy ride into Appleton on Sunday morning--\"It was rough, and we almost had to turn around in mid-air (before) we were cleared to land,\" Patrick said--and another one once we got on the ground. After landing in Appleton, Patrick, <mark>Murphy</mark> and practice-squad wide receiver DeAngelo Yancey, who was also on their flight, rented a minivan to drive up Interstate 41 to Green Bay. The ice-covered highway was bad enough--<mark>Murphy</mark> said the fastest he was able to drive was 35 miles per hour--but when Patrick went to drop <mark>Murphy</mark> off first, the minivan got stuck in the snow and the threesome had to push the vehicle out. The drive to Yancey's hotel and his own apartment were no picnic either, Patrick said. \"Worst weather I've ever driven in, and the first time I was actually scared of the weather,\" Patrick said. So was it worth it? \"It's always worth it,\" Patrick replied. \"You never know where life can take you--especially in the job I'm in. So it's fun to do these things. Plus, being miserable with another person makes everything better--(even) with all the crazy travel .\" This article originally ran on host.madison.com. Love 7 min ago (...) Get caught up on who's in, who's out and who's TBD as the Packers make roster changes ahead of the 2018 NFL season.", "articleID": "2018041601_00232875_W", "names": {"Kyle Murphy": ["Q20826698", "Q24005654", "Q24549968"]}}]