[{"date": "2018-04-16", "url": "http://ktbs.com/sports/national/winter-storm-delays-start-of-green-bay-packers-offseason-program/article_1827fdae-8ce9-56c9-adf1-552e92f4ef9d.html", "content": "Winter storm delays start of Green Bay Packers' offseason program JASON WILDE For the State Journal 8 min ago Save GREEN BAY--Justin McCray would have been one of the lucky ones. Already in town working out for most of past week, the Green Bay Packers second-year offensive lineman would've avoided the travel issues many of his teammates encountered because of the second-worst snow storm in Green Bay history. Except McCray left late in the week for Atlanta, where he was standing up in his cousin's wedding on Saturday night. As a result, while he was able to celebrate with the newly minted Mr. and Mrs. Earnest and Annette Gaines, he wasn't able to make it back in time for what was supposed to be the kickoff of the team's official offseason program on Monday. \"I'm giving (the groom) a hard time about it,\" McCray said from his hotel room near the Hartsfield International Airport, where he spent Sunday night hoping to make it to snowy Green Bay sometime Monday. \"But it's all jokes .\" The storm, however, was no joke. Because of the travel challenges it created for his players, Packers coach <mark>Mike McCarthy</mark> pushed the start of the offseason workouts back a day to Tuesday--weather permitting, of course. Among the players who weren't able to get into town as planned was quarterback Aaron Rodgers, who was slated to fly in but said in a text message his flight wouldn't be able to get in on Sunday night as scheduled. But he was hardly alone. The workouts are technically voluntary, although the Packers have historically had extremely high attendance for the offseason program, in part due to the money they invest in workout bonuses to incentivize the sessions for players. Those players already in town can work out on their own at the team facility on Monday, per NFL rules, but Tuesday will now be the first day of official workouts. The bizarre April storm won't cost the Packers any sessions, a club spokesperson said, as they weren't required to begin on Monday. According to the National Weather Service's Green Bay office, the storm had dumped 23.2 inches in Green Bay at of 4 p.m. Sunday--making it the area's largest snow storm in 130 years, or dating back to before the Packers came into existence in 1919. The only time more snow fell on Green Bay during a single storm was on March 1-2, 1888, when the area received 29 inches. (The biggest April snow storm recorded in Green Bay before this was in 1977, when 11 inches fell .) While McCray was spending an unexpected extra night in Atlanta, he got off easy compared to fellow offensive linemen Lucas Patrick and <mark>Kyle Murphy</mark>, who got stuck at the Minneapolis-St. Paul airport on Friday night and had quite the odyssey from there. Patrick, who was connecting from Portland, Oregon, and <mark>Murphy</mark>, who was coming back from California, were in the Delta Airlines airport lounge at 2 a.m. Saturday morning and caught a few hours of sleep there. After getting rebooked on a Sunday flight into Appleton, they headed to the nearby Mall of America later Saturday morning where Patrick realized--about the same time that the mall was closing due to the weather in the Twin Cities--that he had a bit of a wardrobe emergency. \"I was out of clean undergarments,\" Patrick recounted. \"So we kind of ran around the mall to find only Sears was open--so (at least) I could get some fresh socks and underwear .\" The pair stayed at an airport hotel Saturday night and then endured a bumpy ride into Appleton on Sunday morning--\"It was rough, and we almost had to turn around in mid-air (before) we were cleared to land,\" Patrick said--and another one once we got on the ground. After landing in Appleton, Patrick, <mark>Murphy</mark> and practice-squad wide receiver DeAngelo Yancey, who was also on their flight, rented a minivan to drive up Interstate 41 to Green Bay. The ice-covered highway was bad enough--<mark>Murphy</mark> said the fastest he was able to drive was 35 miles per hour--but when Patrick went to drop <mark>Murphy</mark> off first, the minivan got stuck in the snow and the threesome had to push the vehicle out. The drive to Yancey's hotel and his own apartment were no picnic either, Patrick said. \"Worst weather I've ever driven in, and the first time I was actually scared of the weather,\" Patrick said. So was it worth it? \"It's always worth it,\" Patrick replied. \"You never know where life can take you--especially in the job I'm in. So it's fun to do these things. Plus, being miserable with another person makes everything better--(even) with all the crazy travel .\" This article originally ran on host.madison.com. Love 7 min ago (...) Get caught up on who's in, who's out and who's TBD as the Packers make roster changes ahead of the 2018 NFL season.", "articleID": "2018041601_00232875_W", "names": {"Mike Mccarthy": ["Q1933317", "Q21062541", "Q22279122", "Q506866", "Q6847875", "Q6847876", "Q6847877"]}}, {"date": "2018-04-17", "url": "https://thinkprogress.org/ohio-lawmaker-tells-ferc-coal-ceo-robert-murray-is-unhappy-ac7f2fce7385/", "content": "Ohio lawmaker tells federal regulators that <mark>Murray</mark> Energy's CEO is unhappy with them Coal industry interests have financed Rep. <mark>Bill Johnson</mark>'s campaigns. SHARE Facebook Twitter Email SMS WhatsApp Share Rep. <mark>Bill Johnson</mark>, R-Ohio, questioned FERC commissioners on April 17, 2018, about their decision to reject a DOE proposal to subsidize coal and nuclear plants. CREDIT: Tom Williams/CQ Roll Call An Ohio congressman who receives a large portion of his campaign contributions from coal industry interests informed members of the Federal Energy Regulatory Commission (FERC) on Tuesday that one of his most important constituents--<mark>Murray</mark> Energy CEO <mark>Robert Murray</mark>--is not happy with their decision to reject a Trump administration proposal to subsidize coal and nuclear power plants. Rep. <mark>Bill Johnson</mark> (R-OH), who represents the small Ohio town where <mark>Murray</mark> Energy is headquartered, told the regulators at a House committee hearing: \"I take notice when major employers in my district speak out on this issue. For instance, the CEO of <mark>Murray</mark> Energy recently stated that FERC did not do its job when it rejected this proposal .\" Advertisement <mark>Murray</mark> has been highly critical of the commission's decision in January to vote down Energy Secretary Rick Perry's proposed taxpayer bailout of coal and nuclear power. He has accused the agency's two Democratic commissioners, Richard Glick and Cheryl LaFleur, of political bias, saying they will never support coal or nuclear power. Two of the three Republicans who voted against Perry's proposal, Chairman <mark>Kevin McIntyre</mark> and Commissioner Robert Powelson, \"are wrong in their decision and it needs to be overturned,\" the coal executive told CNBC in January. Filthy Five: New House Energy Committee Members Ignore Climate While Taking $1.7 Million From Fossil Fuels All five FERC commissioners were present at the House Energy and Commerce Energy Subcommittee hearing on Tuesday, where they discussed the agency's fiscal 2019 budget and the agency's top priorities. Advertisement <mark>Johnson</mark>, who has received $13,040 from <mark>Murray</mark> Energy PACs and individuals during the current election cycle, kicked off his questioning by telling the commissioners he's been closely following the discussion surrounding the Department of Energy's proposed rule. \"These issues hit especially close to home,\" <mark>Johnson</mark> said, referring to the heavy amount of coal mining and natural gas production that occurs in his congressional district. <mark>Johnson</mark> has represented the 6th district of Ohio since 2011. Over that time, he has gained a reputation as one of the most right-wing members of Congress. In 2016, <mark>Johnson</mark> called the Environmental Protection Agency \"un-American\" and accused it of \"draining the lifeblood out of our businesses .\" <mark>Johnson</mark>'s district runs along the southeast of Ohio, bordering Kentucky, West Virginia, and Pennsylvania. He has said that because he \"is a scientist\" (he has a degree in computer science), he does not accept the science of human-caused climate change. \"I am not an alarmist that believes that greenhouse gas emissions coming from the coal industry are causing major problems,\" he said in 2011. House Hearing On EPA Rule Turns Ugly As Rep Calls Regulations \"Un-American' In late September, Perry sent the proposal to FERC--called a grid reliability and resilience pricing plan--that would subsidize struggling coal and nuclear plants in the name of keeping power grids dependable. Many viewed the proposal as an unprecedented and unnecessary intrusion by an administration into the operations of an independent federal agency. Advertisement FERC, by a vote of 5-0 in January, didn't buy Perry's reasoning. The unanimous vote is especially notable since 3 of the 5 commissioners are Trump appointees. <mark>Murray</mark> told Bloomberg News at the time that four of the five members\" defaulted \"on their duties by refusing to support the plan and should be fired. Meanwhile, according to <mark>Murray</mark>, FERC Commissioner Neil Chatterjee, who also voted to reject the plan, should not be fired because he was\" overwhelmed \"by the other four. Chatterjee sounded apologetic when he explained to <mark>Johnson</mark> during Tuesday's hearing why he voted against Perry's proposal .\" While I have deep sympathy for the sentiments that Mr. <mark>Murray</mark>, the folks in your community are expressing and the concerns they have about the economic impact, the job impact, the cultural impact of these [plant] shutdowns, from the seat I sit in now, our record simply didn't support taking action at that time, \"he said. <mark>Johnson</mark> specifically targeted Commissioner Robert Powelson for comments he made on Twitter about the coal CEO's criticism of FERC. Here's the now-deleted Tweet...pic.twitter.com/ZLeFgKsEwa--Sam Mintz (@ samjmintz) April 10, 2018 Last week, in a tweet, Powelson noted that <mark>Murray</mark> blamed the\" feckless \"FERC for not approving the plan to boost coal and nuclear plants .\" I challenge Mr. <mark>Murray</mark> to a debate on CNBC or Fox News, \"he wrote in the tweet. Advertisement <mark>Johnson</mark>, in reference to the tweet, said:\" Commissioner Powelson, I believe you recently made some comments indicating that you disagree with Mr. <mark>Murray</mark>. Can you expound on that? \"\"I take offense to the word feckless being used to [describe] colleagues who I serve with here,\" Powelson responded. However, the commissioner added he realized his tweet, which he later deleted, was \"inappropriate\" and \"I dialed it back rather quickly .\" ", "articleID": "2018041721_00381670_W", "names": {"Bill Johnson": ["Q16204402", "Q17385655", "Q17626755", "Q21585452", "Q24817767", "Q2903258", "Q30717048", "Q3366808", "Q339036", "Q48645040", "Q4909622", "Q4909623", "Q4909624", "Q4909626", "Q56558077", "Q720797", "Q862215", "Q862229"], "Kevin Mcintyre": ["Q6396944", "Q6396945"], "Robert Murray": ["Q16149751", "Q16193097", "Q43910843", "Q7347885", "Q7347887", "Q7347888", "Q7347889", "Q7350719"]}}, {"date": "2018-04-19", "url": "http://www.mining.com/web/bhp-cuts-2018-iron-ore-forecast-cites-rail-car-upload-problems/", "content": "BHP cuts 2018 iron ore forecast, cites rail car upload problems Apr. 18, 2018, 5:07 PM | PeopleMine Facebook LinkedIn Twitter Email Print Haul truck at an iron ore mine in western Australia. (Image courtesy of BHP .) BHP Billiton Ltd cut its 2018 fiscal year iron ore output guidance on Thursday citing issues in its railroad car unloading system, while reporting an 8 percent rise in third-quarter iron ore production. The miner cut its fiscal 2018 production guidance to between 272-274 million tonnes of iron ore from 275-280 million tonnes. It also narrowed its full-year copper guidance to 1.70-1 .785 million tonnes from the earlier range of 1.655-1 .790 million tonnes. BHP, the world's biggest miner, said its copper production target was affected by a \"slower than planned\" ramp-up in production during the March quarter at its Olympic Dam facility in South Australia. BHP's iron ore output rose to 67 million tonnes in the three months ended March 31, compared with 62 million tonnes a year ago. \"BHP remains on track to achieve six per cent volume growth for the 2018 financial year,\" BHP Chief Executive <mark>Andrew Mackenzie</mark> said in the group's quarterly operations review. The miner said its decision to exit its underperforming U.S. shale oil and gas business last year was going as planned. BHP reiterated it expected bids by June 2018 and added that transactions could be announced in the first half of the 2019 financial year. Sky News last month reported Royal Dutch Shell Plc and U.S. private equity firm Blackstone Group LP were working on a joint $10 billion bid for BHP's U.S. shale assets. Reporting by Rushil Dutta in Bengaluru Editing by <mark>Tom Brown</mark> and Eric Meijer.", "articleID": "2018041900_00286835_W", "names": {"Andrew Mackenzie": ["Q15042554", "Q21456523", "Q4275769", "Q43914061"], "Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}}, {"date": "2018-04-18", "url": "http://rss.cnn.com/~r/rss/edition_europe/~3/KH6z_cORxUY/index.html", "content": "Beyond the bars: How rugby is reforming Italian prisoners By Alan Dymock, for CNN Updated 1040 GMT (1840 HKT) April 18, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. Photos: Italian rugby's governing body, Federazione Italiana Rugby (FIR), has introduced rugby in 15 prisons across the country. Hide Caption 1 of 7 Photos: It's part of a wider social project to help reform certain reaches of society. The first game was played in 2010 and has been a huge success. Hide Caption 2 of 7 Photos: The project began with La Drola Rugby (in red) in Turin, with help from former Italy international player Walter Rista. Hide Caption 3 of 7 Photos: \"There were hundreds of spontaneous inmates requests to be included in the team--from Turin as well as from other penitentiaries around Italy,\" says Rista after the project was launched. Hide Caption 4 of 7 Photos: The values of respect, cohesion, and responsibility--all epitomized by rugby--are helping reform the inmates. Hide Caption 5 of 7 Photos: There are hopes in the future to grow the resources funding the program. This could improve players' access to medical treatment, better nutrition and training equipment. Hide Caption 6 of 7 Photos: In one Turin jail, the tendency to reoffend in rugby-playing inmates is about 25% compared with normal figures of about 70%. Hide Caption Alan Dymock is the Features Editor for Rugby World magazine. (CNN) They might live behind bars, but rugby has given prisoners in Italy a new-found freedom. A unique project has taken the sport into 15 jails across the country and its benefits are having a huge impact on inmates, both while in prison and when they are released. \"Rugby's values are perfectly fitting with inmates' needs for rehabilitation\" Stefano Cantoni, Italian Rugby Federation (FIR) In one Turin jail, the tendency to reoffend in rugby-playing inmates is about 25% compared with normal figures of about 70%, according to Ovale Olte le Sbarre (Rugby Beyond the Bars), which is behind the scheme. \"The aim is to contribute, through the concrete application of rugby's values--respect for the rules, for your adversary, for the referee, for the supporters--to the resocialization of detainees,\" says Stefano Cantoni of the Italian Rugby Federation (FIR), which is backing the project. Read More \"The results so far demonstrate the undoubted beneficial effects on the human relations within the prisons, through a new appreciation of each other. It also offers a new network that can be invaluable for inmates' reintegration into civil society .\" Photos: Hong Kong Sevens 2018 It's perhaps the biggest party in the world of sport...Hide Caption 1 of 11 Photos: Hong Kong Sevens 2018 The annual Hong Kong Sevens, which this year was held from April 6-8, is loved by rugby fans and players alike, regularly attracting as many as 120,000 spectators. Hide Caption 2 of 11 Photos: Hong Kong Sevens 2018 Asked about the key to enjoying the event, comedian <mark>Al Murray</mark> once said: \"You just have to hand yourself over and not worry about what time of day or night it might be .\" Hide Caption 3 of 11 Photos: Hong Kong Sevens 2018 No wonder there is a saying in Hong Kong: \"If you ever get bored of the sevens, you can turn around and watch the rugby .\" Hide Caption 4 of 11 Photos: Hong Kong Sevens 2018 The Hong Kong Sevens dates back to 1976, with Fiji boasting more wins than any other country. The island nation picked up a record fourth-straight victory at the 2018 tournament. Hide Caption 5 of 11 Photos: Hong Kong Sevens 2018 From small beginnings, it's now a truly global affair, with 28 teams in total at the ground this year. Hide Caption 6 of 11 Photos: Hong Kong Sevens 2018 \"What is incredibly special is that the city shuts down for it,\" says England sevens veteran James Rodwell, describing the sight of rugby-hungry fans in the stadium for three whole days as \"humbling .\" Hide Caption 7 of 11 Photos: Hong Kong Sevens 2018 World famous for the atmosphere it generates, the Hong Kong South Stand does not stop jumping all weekend. Hide Caption Photos: Hong Kong Sevens 2018 Fancy dress is a must. Hide Caption 9 of 11 Photos: Hong Kong Sevens 2018 With the 40,000 seater stadium a vibrant mix of color and noise, Hong Kong's atmosphere has set a precedent for other World Series tournaments, most notably London and Las Vegas. Hide Caption", "articleID": "2018041913_00367686_W", "names": {"Al Murray": ["Q4704500", "Q6000623"]}}, {"date": "2018-04-19", "url": "http://www.tsn.ca/popovich-to-miss-game-3-after-wife-s-death-1.1061310", "content": "Bodog: Raps favourite to win the East over Cavs Report: Knicks to interview TNT's Smith LeBron drops 46 as Cavs even series Paul leads Rockets past T-Wolves for 2-0 series lead Mitchell lifts Jazz past Thunder to even series Popovich to miss Game 3 after wife's death DeRozan's evolution on display early in Raptors playoff series Rautins: Raptors' incredible depth goes beyond the second unit Thoughts on the Raps' second unit, Bledsoe and more Sterner: DeMar has put in the work to become this good LeBron: Cavs need to adjust to intensity of playoffs LeBron, Cavs look to avoid 2-0 hole Stephen A.: Lillard's been \"completely shut down' Lowe puts name on LeBron, Kawhi predictions Raptors beat Wizards, take 2-0 series lead Lowry gives DeRozan a hard time after 37-point game\" Who?' - Bledsoe does not know who Rozier is Oubre says it's all love between him and Drake Gentry on Holiday: \"Tell me a better two-way player' Rozier on motivation: Everybody's\" writing us off' Reds fire manager Price after 3-15 start Granderson hits grand slam as Blue Jays pound Royals Red Sox improve to 15-2 with win over Angels LaMarre, Twins top Indians in 16 innings Future Watch: Reid-Foley's strong start good news for pitching pipeline Braves sign <mark>Bautista</mark> to minor-league deal A's beat White Sox in 14-inning marathon Baseball fans were confused as to which <mark>Jose Bautista</mark> the Braves signed Mets rally for nine runs in 8th inning to stun Nats D-Backs' lose starter Walker for season Flaherty's three-run HR powers Braves past Phillies Yankees sign 1B/OF Lind to minor league deal Gibbons: Donaldson not ready to return Will <mark>Bautista</mark> play at the major league level again? <mark>Bautista</mark> will live in Blue Jays history Yelich makes diving grab in return from DL, Brewers top Reds Pirates avoid sweep, pound Rockies Machado's homer in 9th lifts Tigers over Orioles Faria gets 1st win since July, Rays beat Rangers The Mitchell Report: Hernandez, Jays wield hot bats TFC have work to do after dropping CONCACAF CL opener to Chivas Ronaldo scores with backheel flick, saves Madrid from loss Futures uncertain at Dortmund ahead of crunch games Whitecaps head to Kansas City looking to end two-game losing skid Lukaku scores as United beats Bournemouth Chelsea's Alonso gets 3-match ban for violent conduct Aguero struggling to be fit for WCup Chivas capitalizes on mistakes as TFC wastes opportunity at home Osorio: \"We have 90 minutes to win this game, it's not over' VAR decisions at World Cup to be explained on giant screens FIFA Council member arrested for corruption Kane ignites Golden Boot bid as Spurs draw at Brighton Bayern reaches German Cup final Barcelona rests Messi, draws at Celta Vigo Neymar says he'll be well rested when World Cup starts Aguero says he's recovering after knee surgery Bayern loses Vidal (knee) for rest of season Argentina's Trouble Chelsea wing back Alonso charged with violent conduct Relegation-troubled Cologne hires coach Anfang for next season WATCH LIVE: Canada vs. USA at U18 Worlds Must See: Lafreniere dances around the Americans Hughes, Lafreniere among the players to watch at U-18s Canada names U-18 Worlds roster Bailey replaces Dunn on Canada WHC roster Team Canada names 18 to WHC roster Peters named head coach for Canada at WHC Sens' Chabot will represent Canada at WHC Report: Isles' Pulock, Eberle to play in WHC Isles' Barzal to play for Canada at WHC Sabres C O'Reilly to play for Canada at WHC Sens' Duchene declines Canada's WHC invite Habs G Price won't play for Canada at worlds Brodeur, Burke to co-GM Canada at Worlds Stacey lifts Thunder to Clarkson Cup win Klefbom: McDavid to play for Canada at WHC The Pas Huskies win the 2018 Chevrolet Good Deeds Cup Germany stuns Canada to advance to gold-medal game Canada's Olympic reign ends with shootout loss to USA Up and Down: Can Henderson become World No. 1? The Monday Nine: Henderson on record pace after latest win Kodaira rallies to win playoff at RBC Heritage Garcia feeling at home at Texas Open Henderson on pace to become Canada's most decorated pro golfer Henderson grinds out her sixth career win Rahm holds off Dunne to win Spanish Open Canadian Henderson wins LOTTE Championship Flesch wins Mitsubishi Electric Classic DeChambeau shoots 64 to take Harbour Town lead Canadian doc helped Finau to Masters finish Henderson takes Lotte Championship lead Woods files entry to play US Open Hadwin withdraws from RBC Heritage Initially Tiger exceeded expectations, but his performance at the Masters was disappointing The Monday Nine: Masters edition Reed wins Masters for first career major championship Woods finishes strong on final day at Masters Woods posts even score in round three Putting woes stifle some big names at Masters Team Homan to continue curling together next season Season of Change: A roundup of curling's roster movement frenzy Sinclair, Koe win Players' Championship Sweden defeats Canada in world men's final Gushue apologetic following Canada's loss to Sweden New worlds playoff format getting mixed reviews The growth of curling evident in this season of champions Four-time world champ Howard will take things one season at a time A visionary on and off the ice, Martin enters World Curling Hall of Fame Cotter, Laycock teaming up for new BC rink Dunstone announces new lineup for next season Curling having a US moment in wake of Shuster's Olympic gold Crocker, Muyres capture Canadian mixed doubles title Rule exemption to be made so Jones can return to Scotties as Team Canada Canada beats Sweden to win women's worlds Canada's perfect run sends Jill Officer off in style McEwen finds new home with Team Carruthers Koe recruits Neufeld, Flasch to team Laing, Savill reunite with new-look Team Epping Canada edges South Korea for emotional Paralympic bronze Mayfield's playbook comments raise eyebrows Hester, Forte to retire with Bears NFL announces London games Titans to exercise Mariota's fifth-year option Jackson cherishes chance to retire with Bills Report: Brady expected back, but hasn't committed to play 2018 Rodgers hopeful for contract extension as Packers retool Wentz learned a lot about himself with injury McCarron unfazed by talk of Bills drafting a quarterback Lions DE Ansah signs franchise tag Landry says OBJ should be highest-paid player Bucs exercise Winston's 5th-year option Centre Mangold retires after 11 seasons Super Bowl hero Foles wants to start DL Donald skips start of Rams' voluntary workouts NFL prohibits certain helmets for first time Longtime Steelers LB Harrison retires Mitchell says his arm is in order for upcoming season Ticats to induct Montford on Wall of Honour Blue Bombers post $5.1 million profit for 2017 Alouettes release Canadians Vonk, Junior Haidara Police: Stampeders' Finch arrested Ticats move Austin to consultant role Als bring back Canadian LB Muamba Hunter tops final Scouting Bureau rankings ahead of draft Manziel shines in final Spring League game Lions sign former Eskimos DB Young MLSE unveils its vision for the Argonauts Raonic withdraws from Monte Carlo Masters Zverev and Goffin reach Monte Carlo quarterfinals Djokovic needs 10 match points to beat Coric at Monte Carlo Dimitrov, Thiem rusty but reach Monte Carlo 3rd round Donaldson fined $6,200 for ranting at umpire Raonic tops Catarina to reach second round of Monte Carlo Masters Shapovalov ousted in opening round of Monte Carlo Masters NATIONAL BANK Presents - Dennis Shapovalov: By the Numbers Djokovic reaches second round at Monte Carlo Masters Canada glad to have Bouchard back for Fed Cup Sharapova commits to play in new Bay Area tour event Canada to host Netherlands in Davis Cup play in September US Open to use 25-second clocks, timed warmup in main draw Bertens tops Goerges to capture Volvo Car Open title Brengle sues WTA, ITF on blood testing procedure Muguruza wins Abierto GNP Seguros Doubles' win puts US in Davis Cup semis US now waits after clinching 1st Davis Cup semi since 2012 Isner wins US opener vs. Belgium at Davis Cup quarters Zverev gives Germany lead over Spain at Davis Cup UFC vet Condit:\" Maybe my time has passed' The Ultimate Fighter Undefeated: 16 Fighters, 0 Losses, 2 Winners Miocic: Cormier hasn't fought anyone like me UFC Notebook: Poirier wins epic battle with Gaethje Poirier beats Gaethje by TKO in UFC lightweight fight Jackson: I'm just going in there and smacking CM Punk in his face VanZant opens up about sexual assault in new book Waterson: McGregor incident \"insane, ridiculous and shouldn't have happened' Former UFC champ Lesnar re-signs with WWE White praises UFC 223 fighters, admits to\" brutal week' Nurmagomedov captures lightweight title at UFC 223 Nick Diaz eligible to return April 19 after USADA settlement Namajunas retains UFC strawweight title Aubin-Mercier on impressively quick victory Whittaker on recovery from infection, fight with Romero Stephen A. sees Mayweather vs. McGregor coming to life McGregor arraigned, released on 50K bond Kowalkiewicz on McGregor: \"He went too far, he crossed the line' White was working on new deal with McGregor before incident Romero says he'll see Michael Bisping soon Hauraney: It's Lance's job to figure out the new car NASCAR Richmond Entry List Bourdais proving he is still among the best in world Phase one: Richmond set to host races as redesign continues 2018 NASCAR Pinty's Series teaser Ford announces switch to Mustang beginning at Daytona in' 19 Busch wins at Bristol for seventh time Hamilton says he's been\" underperforming' this season, looking for answers Stroll happy with performance despite not having luck with safety cars Ricciardo storms to victory at Chinese GP Ricciardo happy to see his team rewarded for its incredible work in China Rossi grabs 3rd career IndyCar win in Long Beach Preece takes Xfinity race, $100,000 prize at Bristol Action scheduled to resume Monday at Bristol Verstappen takes blame for collision with Vettel Wickens an instant fit in new IndyCar job For most of the F1 teams, 4th place is as good as it gets Davison enters Indy 500 with A.J. Foyt Racing Hildebrand enters Indy 500 and brings car count to 34 Popovich to miss Game 3 after wife's death The Canadian Press Emotional LeBron sending his love to Popovich and family VIDEO SIGN OUT {{video. Duration | time}} SAN ANTONIO--The NBA is paying tribute to the wife of San Antonio Spurs coach Gregg Popovich. Erin Popovich died Wednesday at 67, the team said. Her death came after a long illness, the San Antonio Express-News reported. LeBron James, who was playing Game 2 of Cleveland's first-round series against Indiana, was visibly upset when told after the game. \"Obviously, I'm a huge Pop fan. I love Pop. That's such a tragedy,\" James said during his postgame interview on TNT. \"My best wishes go out to Pop and his family. That's devastating news .\" The NBA family, we all stick together. I know we compete every night. But something like this happens, it puts everything in perspective. \"Popovich is the current Olympic men's basketball coach. James calls him a\" mastermind of the game \"and has said he'd consider playing for the U.S. team under Popovich at the 2020 Tokyo Games after skipping the Rio Olympics. Popovich has coached San Antonio since 1996, leading the Spurs to five NBA titles. San Antonio trails Golden State 2-0 in their first-round playoff series. The 69-year-old Popovich ran practice Wednesday, but there was no immediate word on his status for Game 3 on Thursday night. Assistant coach Ettore Messina likely would lead the team if Popovich were to miss it. When told of Erin Popovich's death, Golden State's Kevin Durant said from San Antonio:\" Seriously? Man. Prayers and condolences go out to his family. \"The Popovichs have two daughters and two grandchildren. They met at the Air Force Academy in the 1970s when he was an assistant coach for the Falcons. Erin's father, Jim Conboy, was Air Force's head athletic trainer. Spurs general manager RC Buford called Erin Popovich a\" strong, wonderful, kind, intelligent woman who provided love, support and humour to all of us. \"Former Spurs assistant and current Philadelphia coach Brett Brown said he has known her a long time .\" Their family is wonderful, \"he said .\" Their family has been incredibly kind to my family. And she was a star, like a real star. A very strong woman, and somebody that will be missed. \"<mark>Bill Russell</mark>, <mark>Magic Johnson</mark> and Kobe Bryant were among those expressing condolences on Twitter. <mark>Steve Nash</mark> wrote on Twitter,\" Knowing Pop, it's fair to assume Erin Popovich was an absolute legend. My deepest sympathies to Pop and his daughters. \"", "articleID": "2018041915_00325982_W", "names": {"Bill Russell": ["Q242185", "Q4910727", "Q862419"], "Jose Bautista": ["Q1346122", "Q32406"], "Magic Johnson": ["Q134183", "Q7490891"]}}]