[{"date": "2018-04-19", "url": "http://www.tsn.ca/popovich-to-miss-game-3-after-wife-s-death-1.1061310", "content": "Bodog: Raps favourite to win the East over Cavs Report: Knicks to interview TNT's Smith LeBron drops 46 as Cavs even series Paul leads Rockets past T-Wolves for 2-0 series lead Mitchell lifts Jazz past Thunder to even series Popovich to miss Game 3 after wife's death DeRozan's evolution on display early in Raptors playoff series Rautins: Raptors' incredible depth goes beyond the second unit Thoughts on the Raps' second unit, Bledsoe and more Sterner: DeMar has put in the work to become this good LeBron: Cavs need to adjust to intensity of playoffs LeBron, Cavs look to avoid 2-0 hole Stephen A.: Lillard's been \"completely shut down' Lowe puts name on LeBron, Kawhi predictions Raptors beat Wizards, take 2-0 series lead Lowry gives DeRozan a hard time after 37-point game\" Who?' - Bledsoe does not know who Rozier is Oubre says it's all love between him and Drake Gentry on Holiday: \"Tell me a better two-way player' Rozier on motivation: Everybody's\" writing us off' Reds fire manager Price after 3-15 start Granderson hits grand slam as Blue Jays pound Royals Red Sox improve to 15-2 with win over Angels LaMarre, Twins top Indians in 16 innings Future Watch: Reid-Foley's strong start good news for pitching pipeline Braves sign <mark>Bautista</mark> to minor-league deal A's beat White Sox in 14-inning marathon Baseball fans were confused as to which <mark>Jose Bautista</mark> the Braves signed Mets rally for nine runs in 8th inning to stun Nats D-Backs' lose starter Walker for season Flaherty's three-run HR powers Braves past Phillies Yankees sign 1B/OF Lind to minor league deal Gibbons: Donaldson not ready to return Will <mark>Bautista</mark> play at the major league level again? <mark>Bautista</mark> will live in Blue Jays history Yelich makes diving grab in return from DL, Brewers top Reds Pirates avoid sweep, pound Rockies Machado's homer in 9th lifts Tigers over Orioles Faria gets 1st win since July, Rays beat Rangers The Mitchell Report: Hernandez, Jays wield hot bats TFC have work to do after dropping CONCACAF CL opener to Chivas Ronaldo scores with backheel flick, saves Madrid from loss Futures uncertain at Dortmund ahead of crunch games Whitecaps head to Kansas City looking to end two-game losing skid Lukaku scores as United beats Bournemouth Chelsea's Alonso gets 3-match ban for violent conduct Aguero struggling to be fit for WCup Chivas capitalizes on mistakes as TFC wastes opportunity at home Osorio: \"We have 90 minutes to win this game, it's not over' VAR decisions at World Cup to be explained on giant screens FIFA Council member arrested for corruption Kane ignites Golden Boot bid as Spurs draw at Brighton Bayern reaches German Cup final Barcelona rests Messi, draws at Celta Vigo Neymar says he'll be well rested when World Cup starts Aguero says he's recovering after knee surgery Bayern loses Vidal (knee) for rest of season Argentina's Trouble Chelsea wing back Alonso charged with violent conduct Relegation-troubled Cologne hires coach Anfang for next season WATCH LIVE: Canada vs. USA at U18 Worlds Must See: Lafreniere dances around the Americans Hughes, Lafreniere among the players to watch at U-18s Canada names U-18 Worlds roster Bailey replaces Dunn on Canada WHC roster Team Canada names 18 to WHC roster Peters named head coach for Canada at WHC Sens' Chabot will represent Canada at WHC Report: Isles' Pulock, Eberle to play in WHC Isles' Barzal to play for Canada at WHC Sabres C O'Reilly to play for Canada at WHC Sens' Duchene declines Canada's WHC invite Habs G Price won't play for Canada at worlds Brodeur, Burke to co-GM Canada at Worlds Stacey lifts Thunder to Clarkson Cup win Klefbom: McDavid to play for Canada at WHC The Pas Huskies win the 2018 Chevrolet Good Deeds Cup Germany stuns Canada to advance to gold-medal game Canada's Olympic reign ends with shootout loss to USA Up and Down: Can Henderson become World No. 1? The Monday Nine: Henderson on record pace after latest win Kodaira rallies to win playoff at RBC Heritage Garcia feeling at home at Texas Open Henderson on pace to become Canada's most decorated pro golfer Henderson grinds out her sixth career win Rahm holds off Dunne to win Spanish Open Canadian Henderson wins LOTTE Championship Flesch wins Mitsubishi Electric Classic DeChambeau shoots 64 to take Harbour Town lead Canadian doc helped Finau to Masters finish Henderson takes Lotte Championship lead Woods files entry to play US Open Hadwin withdraws from RBC Heritage Initially Tiger exceeded expectations, but his performance at the Masters was disappointing The Monday Nine: Masters edition Reed wins Masters for first career major championship Woods finishes strong on final day at Masters Woods posts even score in round three Putting woes stifle some big names at Masters Team Homan to continue curling together next season Season of Change: A roundup of curling's roster movement frenzy Sinclair, Koe win Players' Championship Sweden defeats Canada in world men's final Gushue apologetic following Canada's loss to Sweden New worlds playoff format getting mixed reviews The growth of curling evident in this season of champions Four-time world champ Howard will take things one season at a time A visionary on and off the ice, Martin enters World Curling Hall of Fame Cotter, Laycock teaming up for new BC rink Dunstone announces new lineup for next season Curling having a US moment in wake of Shuster's Olympic gold Crocker, Muyres capture Canadian mixed doubles title Rule exemption to be made so Jones can return to Scotties as Team Canada Canada beats Sweden to win women's worlds Canada's perfect run sends Jill Officer off in style McEwen finds new home with Team Carruthers Koe recruits Neufeld, Flasch to team Laing, Savill reunite with new-look Team Epping Canada edges South Korea for emotional Paralympic bronze Mayfield's playbook comments raise eyebrows Hester, Forte to retire with Bears NFL announces London games Titans to exercise Mariota's fifth-year option Jackson cherishes chance to retire with Bills Report: Brady expected back, but hasn't committed to play 2018 Rodgers hopeful for contract extension as Packers retool Wentz learned a lot about himself with injury McCarron unfazed by talk of Bills drafting a quarterback Lions DE Ansah signs franchise tag Landry says OBJ should be highest-paid player Bucs exercise Winston's 5th-year option Centre Mangold retires after 11 seasons Super Bowl hero Foles wants to start DL Donald skips start of Rams' voluntary workouts NFL prohibits certain helmets for first time Longtime Steelers LB Harrison retires Mitchell says his arm is in order for upcoming season Ticats to induct Montford on Wall of Honour Blue Bombers post $5.1 million profit for 2017 Alouettes release Canadians Vonk, Junior Haidara Police: Stampeders' Finch arrested Ticats move Austin to consultant role Als bring back Canadian LB Muamba Hunter tops final Scouting Bureau rankings ahead of draft Manziel shines in final Spring League game Lions sign former Eskimos DB Young MLSE unveils its vision for the Argonauts Raonic withdraws from Monte Carlo Masters Zverev and Goffin reach Monte Carlo quarterfinals Djokovic needs 10 match points to beat Coric at Monte Carlo Dimitrov, Thiem rusty but reach Monte Carlo 3rd round Donaldson fined $6,200 for ranting at umpire Raonic tops Catarina to reach second round of Monte Carlo Masters Shapovalov ousted in opening round of Monte Carlo Masters NATIONAL BANK Presents - Dennis Shapovalov: By the Numbers Djokovic reaches second round at Monte Carlo Masters Canada glad to have Bouchard back for Fed Cup Sharapova commits to play in new Bay Area tour event Canada to host Netherlands in Davis Cup play in September US Open to use 25-second clocks, timed warmup in main draw Bertens tops Goerges to capture Volvo Car Open title Brengle sues WTA, ITF on blood testing procedure Muguruza wins Abierto GNP Seguros Doubles' win puts US in Davis Cup semis US now waits after clinching 1st Davis Cup semi since 2012 Isner wins US opener vs. Belgium at Davis Cup quarters Zverev gives Germany lead over Spain at Davis Cup UFC vet Condit:\" Maybe my time has passed' The Ultimate Fighter Undefeated: 16 Fighters, 0 Losses, 2 Winners Miocic: Cormier hasn't fought anyone like me UFC Notebook: Poirier wins epic battle with Gaethje Poirier beats Gaethje by TKO in UFC lightweight fight Jackson: I'm just going in there and smacking CM Punk in his face VanZant opens up about sexual assault in new book Waterson: McGregor incident \"insane, ridiculous and shouldn't have happened' Former UFC champ Lesnar re-signs with WWE White praises UFC 223 fighters, admits to\" brutal week' Nurmagomedov captures lightweight title at UFC 223 Nick Diaz eligible to return April 19 after USADA settlement Namajunas retains UFC strawweight title Aubin-Mercier on impressively quick victory Whittaker on recovery from infection, fight with Romero Stephen A. sees Mayweather vs. McGregor coming to life McGregor arraigned, released on 50K bond Kowalkiewicz on McGregor: \"He went too far, he crossed the line' White was working on new deal with McGregor before incident Romero says he'll see Michael Bisping soon Hauraney: It's Lance's job to figure out the new car NASCAR Richmond Entry List Bourdais proving he is still among the best in world Phase one: Richmond set to host races as redesign continues 2018 NASCAR Pinty's Series teaser Ford announces switch to Mustang beginning at Daytona in' 19 Busch wins at Bristol for seventh time Hamilton says he's been\" underperforming' this season, looking for answers Stroll happy with performance despite not having luck with safety cars Ricciardo storms to victory at Chinese GP Ricciardo happy to see his team rewarded for its incredible work in China Rossi grabs 3rd career IndyCar win in Long Beach Preece takes Xfinity race, $100,000 prize at Bristol Action scheduled to resume Monday at Bristol Verstappen takes blame for collision with Vettel Wickens an instant fit in new IndyCar job For most of the F1 teams, 4th place is as good as it gets Davison enters Indy 500 with A.J. Foyt Racing Hildebrand enters Indy 500 and brings car count to 34 Popovich to miss Game 3 after wife's death The Canadian Press Emotional LeBron sending his love to Popovich and family VIDEO SIGN OUT {{video. Duration | time}} SAN ANTONIO--The NBA is paying tribute to the wife of San Antonio Spurs coach Gregg Popovich. Erin Popovich died Wednesday at 67, the team said. Her death came after a long illness, the San Antonio Express-News reported. LeBron James, who was playing Game 2 of Cleveland's first-round series against Indiana, was visibly upset when told after the game. \"Obviously, I'm a huge Pop fan. I love Pop. That's such a tragedy,\" James said during his postgame interview on TNT. \"My best wishes go out to Pop and his family. That's devastating news .\" The NBA family, we all stick together. I know we compete every night. But something like this happens, it puts everything in perspective. \"Popovich is the current Olympic men's basketball coach. James calls him a\" mastermind of the game \"and has said he'd consider playing for the U.S. team under Popovich at the 2020 Tokyo Games after skipping the Rio Olympics. Popovich has coached San Antonio since 1996, leading the Spurs to five NBA titles. San Antonio trails Golden State 2-0 in their first-round playoff series. The 69-year-old Popovich ran practice Wednesday, but there was no immediate word on his status for Game 3 on Thursday night. Assistant coach Ettore Messina likely would lead the team if Popovich were to miss it. When told of Erin Popovich's death, Golden State's Kevin Durant said from San Antonio:\" Seriously? Man. Prayers and condolences go out to his family. \"The Popovichs have two daughters and two grandchildren. They met at the Air Force Academy in the 1970s when he was an assistant coach for the Falcons. Erin's father, Jim Conboy, was Air Force's head athletic trainer. Spurs general manager RC Buford called Erin Popovich a\" strong, wonderful, kind, intelligent woman who provided love, support and humour to all of us. \"Former Spurs assistant and current Philadelphia coach Brett Brown said he has known her a long time .\" Their family is wonderful, \"he said .\" Their family has been incredibly kind to my family. And she was a star, like a real star. A very strong woman, and somebody that will be missed. \"<mark>Bill Russell</mark>, <mark>Magic Johnson</mark> and Kobe Bryant were among those expressing condolences on Twitter. <mark>Steve Nash</mark> wrote on Twitter,\" Knowing Pop, it's fair to assume Erin Popovich was an absolute legend. My deepest sympathies to Pop and his daughters. \"", "articleID": "2018041915_00325982_W", "names": {"Steve Nash": ["Q16137022", "Q192955", "Q42316961"]}}, {"date": "2018-04-22", "url": "http://www.goupstate.com/news/20180421/charlie-boone-who-led-spartanburg-hostpital-for-30-years-dies-at-90", "content": "Charlie Boone, who led Spartanburg hostpital for 30 years, dies at 90 Saturday Apr 21, 2018 at 8:23 PM Apr 21, 2018 at 8:25 PM Chris Lavender Staff Writer @ LavenderSHJ Former Spartanburg General Hospital President and CEO Charlie Boone, a beloved leader who guided the local hospital through medical and technological advancements over three decades, died Saturday at Spartanburg Regional Hospice Home. He was 90. Boone led the Spartanburg Regional Healthcare System from 1965 to 1995. Before coming to Spartanburg, Boone served as the chief operating officer for Duke University Medical Center. He also helped build the first hospital in Barnwell when he was 25. After leaving the Spartanburg Regional, Boone remained active in the community and kept an office at Spartanburg Medical Center where he would continue to visit, eating in the cafeteria and socializing with hospital staff. Mark Aycock, Spartanburg Regional Healthcare System executive vice president and chief operating officer, said he visited with Boone on Monday. The pair talked about all that's been accomplished in the healthcare system over the past few decades. While Aycock didn't work for Boone when he was CEO, the two did find time in recent years to get to know one another. \"We would talk about Duke basketball and current events,\" Aycock said. He said Boone was a source of wisdom who rarely offered unsolicited advice. Boone will be missed, he said. In November, an honorary sign was unveiled for Boone on a street near the hospital campus that connects Aimee Street to North Church Street. The Charles C. Boone Drive sign still stands in his honor. Boone received numerous awards in his lifetime, including the Distinguished Citizen Award from the Wofford College Alumni Association in 1980 and Citizen of the Year from the Spartanburg Kiwanis Club in 1982. <mark>Bill James</mark> was the healthcare system's chief of staff in 1994 and worked directly with Boone at the time. <mark>James</mark> serves as a member of the Spartanburg Regional board of trustees. Boone helped broaden the healthcare system's service, paving the way for it to expand into Cherokee and Union counties and parts of North Carolina, <mark>James</mark> said. \"People enjoyed working with Charlie because they knew he was there to support them and be nurtured by him,\" he said. \"Charlie Boone was also the best at public relations. He talked to people at all levels .\" Spartanburg County Councilman David Britt said Boone was someone that could be trusted. The county worked closely with Boone as the hospital expanded. Boone oversaw construction of new buildings, including the Montgomery Tower and the medical center parking garage. He also led efforts to improve access to care for the community, starting in 1966 when Spartanburg General began accepting Medicare. \"He could get anything done,\" Britt said. \"He was always visible to everyone at the hospital and put the hospital on the path to growth .\" State Rep. Rita Allison's husband Ron served on the hospital board for 16 years during Boone's time as president and CEO. \"It's a real loss for our community,\" Allison said. \"He did a fine job for Spartanburg Regional Healthcare System .\" A service honoring Boone will be held at 11 a.m. Friday at Central United Methodist Church at 233 N. Church St., Spartanburg. Visitation will be held in the church fellowship hall immediately following the service. A private graveside service will be held at a later date.", "articleID": "2018042200_00121500_W", "names": {"Bill James": ["Q18378575", "Q18687984", "Q2037014", "Q2903257", "Q4909587", "Q4909589"]}}, {"date": "2018-04-22", "url": "http://www.wahpetondailynews.com/national/sports/brewers-beat-marlins-on-walk-off-homer-by-jesus-aguilar/article_b8420a16-6773-54a6-8ca1-b93f9e3f01b7.html", "content": "Facebook Twitter Email TownNews.com Content Exchange Facebook Twitter Email Print Save MILWAUKEE--<mark>Jesus Aguilar</mark> quickly found himself in an 0-2 hole while leading off the bottom of the ninth inning. The Milwaukee Brewers first baseman eventually fouled off seven pitches, including three with a full count. On the 13th pitch of the at-bat, he broke through. <mark>Aguilar</mark> homered to right-center off Miami Marlins reliever Junichi Tazawa, sending Milwaukee to a 6-5 victory Saturday night at Miller Park. The Brewers, who have won five straight games, trailed 4-0 early before <mark>Aguilar</mark> capped the team's seventh come-from-behind victory of the season. \"I'm very happy,\" said <mark>Aguilar</mark>, who entered the game in the top of the ninth. \"He's become a force in the National League off the bench as a pinch hitter,\" Brewers manager Craig Counsell said. Milwaukee (13-9) tied the score in the eighth when Miami left fielder Derek Dietrich misplayed Eric Sogard's two-out popup to left, allowing Travis Shaw to score from second. Eric Thames was thrown out at the plate attempting to score the go-ahead run from first. \"We certainly caught a break there,\" Counsell said. Jeremy Jeffress (2-0) pitched a scoreless inning of relief to get the win. The Marlins, who have lost six of seven, went ahead on Dietrich's solo homer off left-hander Brent Suter in the first inning. A three-run homer by former Brewers outfielder Lewis Brinson in the second extended Miami's lead to 4-0. Shaw's leadoff home run in the bottom of the second off Jose Urena got the Brewers on the scoreboard. Shaw has reached first base 11 times (six walks, four hits, including two home runs, and hit by pitch) in the first three games against the Marlins. Milwaukee scored twice in the fourth on Thames' run-scoring single and an RBI groundout by Sogard. Miami extended the lead to 5-3 in fifth when <mark>Brian Anderson</mark>'s base hit drove in Starlin Castro, who singled and advanced to second on a wild pitch. The Brewers again pulled within a run in their half of the fifth on <mark>Ryan Braun</mark>'s sacrifice fly. Suter gave up five runs and eight hits in five innings. He walked one and struck out four. \"Probably too many pitches that caught the bad part, or good part, of the plate,\" Counsell said of Suter's outing. Urena, who made his first road start of the season, gave up four runs and four hits in five innings. He walked two batters and struck out three. The Marlins (5-15) dropped their third in a row and are now 3-12 since opening the season with a four-game split against the Cubs at home. Arcia sits out Milwaukee shortstop Orlando Arcia sat out after twisting his ankle attempting to get back to first base after singling in the eighth inning of Friday night's victory. \"He just kind of jammed his ankle and had a little swelling,\" Counsell said. \"I don't think we are completely out of the woods with it, but we will give him at least today (off).\" X-rays taken Friday were negative. \"That's definitely the best-case scenario. Very good news,\" Arcia said of the negative result. \"They told me everything was good, nothing broken, nothing bad. We just have to wait until (Saturday to see) how I feel .\" Arcia fractured the same ankle in 2012 while in the minors and missed the entire season. This article originally ran on host.madison.com. Love 0 Funny 0 Wow 0 Sad 0 Angry 0 Facebook Twitter Email Print Save Sports cover photo AARON GASH, ASSOCIATED PRESS Updated 8 min ago 0 Brewers' <mark>Jesus Aguilar</mark> reacts after hitting a walk-off home run Saturday night against the Marlins. Sports jump photo AARON GASH, ASSOCIATED PRESS Updated 8 min ago 0 Marlins left fielder Derek Dietrich commits an error as he attempts to catch a fly ball off the bat of Eric Sogard in the eighth inning. Travi...Tags Milwaukee Brewers Craig Counsell Baseball Sport Pitch Brent Suter <mark>Jesus Aguilar</mark> Orlando Arcia First Base Inning Locations Wisconsin Madison Load comments × Post a comment as Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching", "articleID": "2018042204_00116278_W", "names": {"Brian Anderson": ["Q1057342", "Q19609578", "Q38626646", "Q4962970", "Q4962975", "Q4962976", "Q4962977", "Q55777627"], "Jesus Aguilar": ["Q16887607", "Q26963305"], "Ryan Braun": ["Q1207567", "Q3453746"]}}, {"date": "2018-04-22", "url": "http://abc7.com/presidents-trump-macron-solidify-political-bromance-with-state-visit/3377883/", "content": "share tweet share email Presidents Trump, Macron solidify political bromance with state visit SHARE: share tweet share email SHARE share tweet share email ABCNews JORDYN PHELPS Sunday, April 22, 2018 03:43 AM Their relationship began with a show of machismo--an extended, white-knuckle handshake on their first meeting last year in Belgium. Emmanuel Macron had reportedly studied <mark>Donald Trump</mark>'s style of domineering power-grabbing handshakes, apparently prepared to avoid being outdone by his counterpart. Instead, it was President Trump who at one point in the 5-second-long handshake attempted to withdraw his hand from Macron's firm grasp. The maneuver marked the start of what has become a close partnership between the two leaders, who recently joined forces along with the United Kingdom to strike Syria earlier this month. \"It's no secret that President Trump and President Macron enjoy a good working relationship. I may say a close personal relationship,\" a senior administration official said in a briefing with reporters. President Macron has already feted Trump in grand style, inviting him to be his guest of honor at France's elaborate Bastille Day celebrations last summer. The president and first lady dined with Macron and his wife at the Eiffel Tower and sat side-by-side as French military tanks, planes and troops rolled down the Champs-Elysee in the elaborate military parade. The event so inspired Trump that he has since called on the Pentagon to look into organizing a military parade in the United States. That parade is now set to take place on Veterans Day. By extending an invitation to host Macron for a state visit in the United States, Trump is in many ways returning the favor and celebrating the deeply-rooted historical ties between the two countries and marking the 100th anniversary of the end of World War I. This will be the president and first lady's first time hosting a foreign leader to the full ceremonial honors of a state visit and sends a symbolic message about the value Trump places on his close ties with the French president. \"This will be a visit of symbolism of the strength and history of the U.S.-French relationship,\" says Heather A. Conley, senior vice president for the Center for Strategic and International Studies. \"It will be more symbolism than substance .\" The events When Macron arrives in Washington on Monday for a three-day visit, he and his wife will stay at Blair House, the presidential guest house, and will dine privately with the president and first lady at George Washington's Mount Vernon home and pay a visit to the first president's tomb. \"President Trump is eager to host the Macrons for this special event, as he remembers fondly the dinner the couples shared together in the Eiffel tower on the eve of Bastille day last July,\" a senior administration official said. President Trump will officially welcome Macron to the White House on Tuesday with an elaborate welcome ceremony on its South Lawn, complete with honor guards and marching bands. They are scheduled to engage in bilateral meetings and partake in a joint news conference. Macron will also dine with Vice President Mike Pence at the State Department for a luncheon that is traditionally hosted by the Secretary of State, and visit the tomb of the unknown soldier. The day will conclude with a formal white-tie state dinner that has been in the works for several months at the personal direction of First Lady Melania Trump. Anita McBride, who served as chief of staff to First Lady Laura Bush, said the dinner will be a chance for the first lady to showcase her skills as a hostess. McBride predicted that Melania Trump has put a keen interest in creating an elegant evening. \"Mrs. Trump wants her guests to have a wonderful, sensory experience. The flowers and lighting in the room. She pays great attention to detail. It's really a chance for her to show how they entertain,\" McBride said. The White House is closely guarding the invite list, with plans to only release the names of the invitees after the final guest has arrived for the evening, which is sure to include both French and American dignitaries. But the guest list is one of the most important and trickiest matters to navigate--to strike the right balance and set the desired tone. Several offices and departments are involved in the process, with recommendations flowing in from the State Department, the Office of Public Liaison--which largely manages the White House's relationship with outside groups--and the offices of Cabinet Affairs and legislative affairs, McBride said. But the most important suggestions of all, she added, are those that come from the first couple. \"The most important list of all is who the first family wants to have there,\" said McBride. As for what's on the menu, the White House has yet to reveal what will be served but says the first lady has personally selected and taste-tested the dishes. While some modern state dinners have been hosted in a large event tent on the South Lawn of the White House, Tuesday's dinner will be in its State Dining Room. Stephanie Grisham, a spokeswoman for Melania Trump, says the setting is a \"nod to tradition and the historic relationship between the two countries .\" She added that there has been an effort on the part of the first lady's office \"to keep things elegant and more traditional than perhaps some of the last few state dinners .\" The live musical accompaniment for the evening will be \"classical and traditional,\" says Grisham. She suggested the entertainment will be a departure from the modern artists who made a splash at some of former President Obama's state dinners, which included live performances from A-list artists like Gwen Stefani and Beyonce Knowles. On Wednesday, Macron will deliver an address to a joint session of Congress, which Elysée Palace says will be a \"very important moment\" of Macron's visit. \"The French president will introduce himself to the American people, will send a message of friendship, of respect and affection toward the American nation,\" the Elysée Palace says. \"Our common history is incredible, a history of friendship that started 250 years ago. The central message that we will see at the Congress will be: Do you want to continue to write history together?\" Macron will also make a public address at George Washington University, and hold his own news conference at the conclusion of his U.S. visit. The Issues Amid all the pomp and circumstance of the ceremonial visit, there will also be the work of high-level diplomacy between the two leaders and their delegations. Macron has described his relationship with Trump as \"extremely direct and frank,\" telling the BBC in January: \"Sometimes I manage to convince him, and sometimes I fail .\" Macron appeared to test the limits of that frankness when he seemed to take credit recently for convincing President Trump not to pull U.S. troops out of Syria in the immediate future; Trump had said days before that the U.S. mission in Syria was nearly complete and that troops would be coming home \"very soon .\" \"We convinced him that it was necessary to stay there long-term,\" Macron said during an extended televised interview on Sunday. The White House then came out to refute Macron's assertion. \"The U.S. mission has not changed--the President has been clear that he wants U.S. forces to come home as quickly as possible,\" White House Press Secretary Sarah Huckabee Sanders said. And Macron himself also sought to walk back the comments, later attempting to clarify: \"I did not say that either the U.S. or France will remain militarily engaged in the long term in Syria .\" After the joint strike earlier this month and the public fissure around Macron's comments on the duration of a U.S. military commitment, one issue to watch will be whether the two countries come to any sort of shared understanding around next steps for war-torn Syria. A senior administration official said the leaders would \"discuss probably in some detail the way forward on Syria\" but said it's \"difficult to say right now\" how far those discussions will go. \"The question around Syria would be,\" Now what?' \"says Conley .\" President Macron very much wants to see a diplomatic process come through. He wants more U.S. engagement...[and] wants to talk to President Trump about what the U.S. policy towards Syria will be at the same moment where President Trump has publicly announced that his desire is to remove U.S. forces from Syria. \"Conley added that it will be interesting to see how the\" leaders comment publicly on their two positions on Syria and a diplomatic process moving forward. \"While the Elysée Palace has made clear they don't have high expectations for producing substantive agreements, the French delegation will try their hand at the art of persuasion in presenting the French position on issues of disagreement, namely the Iran nuclear deal, trade, and the Paris Climate Accord .\" We hope that this State visit will be useful and allow us to present our arguments, to convince and move forward. But on these three topics, we do not expect to obtain results, make deals [or] agreements during the visit. For example, on the Iran deal, we know that President Trump has not made a decision yet. We do not think there will be a diplomatic breakthrough during the State visit, \"the Elysée Palace said. A senior administration official said the Iran nuclear deal is sure to be a\" a major topic of discussion \"during the meetings but said that any decisions as it relates to the United States' continuing participation in the agreement would come in mid-May, when the president faces a deadline on whether to continue to keep the U.S. a party to the deal. Even as both U.S. and French officials say there's no expectation that a final decision will be reached on the Iran deal during the visit, Conley says Macron is uniquely suited among European leaders to make potential headway with Trump as he seeks to convince him not to withdraw the United States from the pact .\" This visit will be dubbed the \"Save the Iran Nuclear Agreement' trip,\" Conley said. \"The French have historically been the toughest EU of the three--that's U.K., France, and Germany--on being tough on Iran, getting the toughest compliance possible. So in some ways, President Macron is the best to provide the president with...the toughness that he wants about and towards Iran, but trying to do so in a way that preserves the Iran nuclear agreement .\" But as it relates to the Paris Climate Accord--the historic pact on climate change to which President Obama had previously committed the United States and has since been adopted by every other country in the world--the Elysée Palace says President Macron will refrain from trying to convince President Trump to get back on board with the agreement. \"We are not trying to get the United States back into the Paris Accord,\" the Elysée Palace said. \"What we are doing is describing the consequences of climate change. We continue scientific and economic cooperation with the U.S.. This goes beyond the U.S. Federal state; working with American cities, NGOs, companies. By working collectively, the United States will reach their objective of decreasing gas emissions. On the political aspect, it can show the Trump administration the positive consequences of actions to fight climate change in terms of job creations and innovation .\" Asked if Paris Climate Accord is set to be discussed, a senior administration official said, \"I don't have any insight on that for you\" and said the topic is not on the agenda \"unless it's brought up by President Macron .\" Related Topics: abc news national SHARE: share tweet share email (Copyright © 2018 ABC News Internet Ventures .) Top Stories 2 brothers found inside car in Burbank died of gunshot wounds, coroner says Verne Troyer, actor in \"Austin Powers' franchise, dies at 49 Compton shooting: Mother killed, young daughter wounded Mini pony led police on short chase in Texas White Sox player in critical condition following brain hemorrhage Local woman is a mother figure for thousands of orphaned kids Powerhouse influencer creates\" sisterhood \"digital conference for Latinas Brush fire burns at least 21 acres in Montebello Show More April 21 is last day to use Toys R Us gift cards Compton, Willowbrook residents dealing with\" contaminated' water Teacher asked 8th-graders to list positives of slavery Family, friends remember 2 killed in Studio City fire LAPD sets up checkpoints to keep people safe on 420 More News", "articleID": "2018042210_00190108_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2018-04-24", "url": "http://www.nationalobserver.com/2018/04/23/news/richmond-hill-resident-bombarded-calls-after-media-and-police-misidentify-him", "content": "Sign up for your daily dose of news and inspiration. Email Address * I'm already signed up. Richmond Hill resident bombarded by calls after media and police misidentify him as Toronto van attack suspect Previous story \"Not me. No connection,\" Richmond Hill resident Alex Minassian angrily posted on Facebook, as media started to bombard him with messages after mistaking him for Alek Minassian--the alleged suspect who killed 9 in Toronto by ramming a van into pedestrians on Yonge Street. \"NBC, ABC, CBC, stop harassing my friends and family .\" Minassian said he'd been contacted by numerous media outlets, and had his name and information linked by a number of media outlets, after he was misidentified by media as the suspect. Toronto Police tried to clarify with a tweet: The correct spelling of the arrested male in the Yonge And Finch incident is Alek Minassian, 25 of Richmond Hill. ^ sm--Toronto Police (@ TorontoPolice) April 24, 2018 But earlier in the day, it too had misidentified the name as \"Alex\" instead of \"Alek,\" causing confusion. It later tweeted the correct spelling. Toronto Police Service Chief <mark>Mark Saunders</mark> is updating media. It can be watched #LiveNow at media link below. Arrested male is Alex MINASSIAN, 25 of Richmond Hill ^ sm https: //t.co/EKnAD8MfuC--Toronto Police (@ TorontoPolice) April 24, 2018 \"I am not the person who committed these acts,\" he told National Observer. \"My name and accounts were linked and shared across a variety of online platforms, and while I carry no ill-will towards these people, I hope they use this as a lesson before spreading fake news again. The actual suspect is in custody .\" He added, \"\"I'd also like to note that I don't consider myself a victim in any way. The real victims are the victims of this tragedy .\" ", "articleID": "2018042400_00243502_W", "names": {"Mark Saunders": ["Q20006905", "Q4428797", "Q56724352", "Q6769597"]}}, {"date": "2018-04-24", "url": "http://www.bloomberg.com/news/articles/2018-04-24/china-stocks-get-adrenaline-shot-from-policy-easing-speculation", "content": "China Stocks Get Adrenaline Shot From Policy Easing Speculation - Bloomberg Bloomberg the Company & Its Products Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 MENU China Stocks Get Adrenaline Shot From Policy Easing Speculation By Shanghai Composite Index advances most in two months Authorities signal willingness to ease policy if needed Photographer: Johannes Eisele/AFP via Getty Images Chinese stocks got a much-needed shot in the arm Tuesday, rallying the most in two months amid signs the government is willing to ease its tightening campaign to avoid an overly sharp economic slowdown. The rally followed a meeting where policy makers mentioned the need to boost domestic demand for the first time since 2015, and dropped a reference to deleveraging. Government bonds, which had been rallying at the fastest pace since 2008, declined. It's a change for China's equity investors, where virtually nothing worked only days ago. A $1 trillion rout had left banks and other onshore giants flirting with a bear market, while foreign-listed tech was having its worst start to a year since 2013, and previously profitable Wall Street strategies tracking the cheapest stocks or biggest dividend payers had all but unraveled. Even small caps, which enjoyed a brief moment in the sun in March, had resumed a multiyear rout. \"The Politburo meeting sends a signal that China may roll out fiscal stimulus and supportive monetary policies to resolve financial risk and stabilize markets,\" said <mark>Ken Chen</mark>, a Shanghai-based analyst with KGI Securities Co. \"That has boosted sentiment on the market, especially for blue chips .\" Bulls returned in full force Tuesday, at one point sending the FTSE China A50 Index toward its biggest daily gain since 2016. All industry groups on the broader CSI 300 Index rose, with property developers and banks leading gains. Even tech rebounded from a two-day slump. Firms tied to materials advanced as strength in cement companies outweighed declines for aluminum makers. While the rally helped patch some of the damage inflicted on Chinese stocks this year, the country's benchmarks are still among the world's worst performers since their January peaks. For Bocom International Holdings Co.'s Hao Hong, onshore equities are still going through a volatile period, with valuations, a slowing economy and limited inflation pressure tipping the balance in favor of bonds. \"The general trend for the stock market is down,\" he said. \"If you were buying Chinese banks for their dividend yield, then you might as well buy Chinese government bonds .\" The gap between dividend yields and bond yields has been watched by investors after the Shanghai Composite Index's best start to a year in a decade made stocks pricey relative to government debt. That spread widened again Tuesday. Hints from the Politburo meeting suggest policy makers are well aware of what's been causing market jitters. A trade spat with the U.S. has added another layer of uncertainty to an economy already grappling with the effects of the government's goal to curb leverage and reduce risk in the financial sector. The shift in tone is \"a sign that China is paying attention to the downward pressure in the economy,\" <mark>Han Wang</mark>, chief macro analyst at Industrial Securities Co., wrote in a note Tuesday. \"This would cushion part of investors' worries about the economy due to trade concern and would boost the risk appetite of the market .\" --With assistance by Amanda <mark>Wang</mark>, and Jeanny Yu Quotes from this Article", "articleID": "2018042406_00182298_W", "names": {"Han Wang": ["Q40418557", "Q42932186", "Q45464785", "Q45532219", "Q45548312", "Q45705530", "Q56027720", "Q57629190"], "Ken Chen": ["Q22774027", "Q6387439"]}}, {"date": "2018-04-24", "url": "http://en.canoe.ca/news/world/parkland-kid-questioned-by-school-officials-officers-for-shooting-ar-15-at-gun-range", "content": "PARKLAND, Fla.--A Marjory Stoneman Douglas student alleges he was aggressively questioned by school administrators and local law enforcement after posting on social media that he fired an assault weapon at a gun range with his dad. Junior Kyle Kashuv said he was brought in for questioning Monday by a school security officer and a Broward County deputy in what he says was an attempt to intimidate him. It was great learning about our inalienable right of #2A and how to properly use a gun. This was my first time ever touching a gun and it made me appreciate the #Constitution even more. My instructor was very informative; I learnt a lot. #2A is important and we need 2 preserve 2A pic.twitter.com/4rcOZbpl88--Kyle Kashuv (@ KyleKashuv) April 21, 2018 \"I can now check off being wrongfully questioned by law enforcement off my bucket list,\" tweeted Kashuv, adding \"school will be interesting for the remainder of my tenure at MSD. I am not looking forward to it .\" On Tuesday, Kashuv told Fox News host Tucker Carlson that the meeting with officials was an interrogation. \"It was a clear attempt to intimidate me, and they used very, very, very harsh intimidation tactics,\" Kashuv said. After first being questioned by a school security officer, a Broward County deputy entered the room and sat behind the teen, Kashuv said. The deputy began asking Kashuv who the rifle belonged to and who he went shooting with. Kashuv said he asked if he could record the interview and was told that he couldn't. The teen said he felt like the deputy was trying to get him to incriminate his father. Kashuv said the gun debate has become so prominent since the Valentine's Day massacre that killed 17 that he \"felt it was important to learn about the physical mechanics of it,\" Kashuv said in a text to The Associated Press. \"I made sure to post about it because I wanted to show people it's people that are the issue, not guns .\" Kashuv also tweeted \"Apparently using my constitutional rights to learn how to defend myself is wrong? Sorry, I thought this was still the United States of America .\" On Friday, Kashuv posted videos on Twitter showing him firing an AR-15 rifle at a target, saying it \"strengthened my love for 2A\" and taught him \"America is the greatest country ever, where freedom intensifies and liberty is required to be a real American .\" His posts came as thousands of students around the country walked out of school for gun reform in honour of the 19th anniversary of the Columbine shooting. Kashuv has been a vocal supporter of gun rights and garnered heavy support from conservative pro-gun groups. The teen has drawn criticism from the core #NeverAgain students, including Emma Gonzalez and <mark>David Hogg</mark>, who have repeatedly called for a ban on assault rifles. A Broward Sheriff's Office incident report confirmed the meeting, but didn't provide any specific response to Kashuv's claim that the deputy used interrogation techniques against him. A school security supervisor told the deputy several students had expressed concern about the social media post, even though no threats were on the video, the report said. When asked about the post, Kashuv said he had borrowed the rifle from a friend and went shooting with his father, the report said. Officials contacted Kashuv's mother, who stated she knew about the video and the trip to the gun range. U.S. lawmaker calls school shooting survivor Emma Gonzalez a'd ummy' TV host resigns after \"hot poker' tweet directed at Parkland student", "articleID": "2018042504_00032934_W", "names": {"David Hogg": ["Q29642981", "Q49712061", "Q53843732"]}}]