[{"date": "2018-04-25", "url": "http://blogs.dallasobserver.com/music/jack-white-and-the-ticket-will-face-off-in-a-game-of-baseball-at-reverchon-park-10618753", "content": "Lee Ann Womack Returns Home to Texas for Album Recording and Dallas Concert \"I listened to it again, and it sounded so telegraphed,\" he says. \"Which is kind of funny, because people often accuse us of scripting our show, and nothing could be farther from the truth, but this was predetermined, like wrestling .\" Although the game is free to the public, donations are encouraged. The money raised will go to Texas Scottish Rite Hospital for Children, which is next to the park. <mark>White</mark> is the co-owner of the baseball bat company Warstic, based out of Deep Ellum, along with former Texas Ranger Ian Kinsler and native Texan Ben Jenkins. With <mark>White</mark> playing a venue that's not too far from the Warstic building, which doubles as a retail space and a manufacturing shop, this baseball game makes plenty of sense. <mark>White</mark> has not announced who will be on his team, but several Ticket hosts have been announced for the Ticket Timbers. Personalities from The Musers, BaD Radio and The Hardline will be on the field. Brothers Cash and Mike Sirois will join Mike Rhyner, Corby Davidson, <mark>Ty Walker</mark>, David Mino, Balis, Dan McDowell and Jake Kemp, as well as former Hardline board op Michael \"Grubes\" Gruber. For the Ticket Timbers, there are no plans for practicing ahead of time. \"I'm probably the most athletic guy at the Ticket .\" --Dan McDowell email \"As far as I know, the plan is going to be show up and just kinda use our natural talents,\" McDowell says. \"We talk about baseball a lot, so I'm sure it's going to be very easy to play .\" The last time many of the Ticket Timbers played baseball was the Ticket Great Game in the summer of 2010. \"We played college baseball women, and I struck out and got hit by a pitch,\" Balis says. \"I'm pretty terrible at this game .\" Gruber played baseball in high school when he was a student at Jesuit, but it's been a while. \"I just want to survive,\" Gruber says. \"It's been eight years since I last played any sort of competitive baseball. I'm not sure how many catcher's squats my stubby legs have in them now .\" <mark>Walker</mark> has played slow-pitch softball for a while, but he hasn't played baseball since the 2010 Great Game. He's up for the challenge, though. \"While I'd like to see a close game, part of me thinks the Warstic guys believe they're gonna blow us out,\" he says. \"I'd like to prove them wrong .\" McDowell has coached softball for years in addition to playing baseball. \"I'm very versatile,\" he deadpans. \"I'm probably the most athletic guy at the Ticket .\" The players say they're not scared. \"I believe we would expect to win,\" McDowell says. \"That's kind of the way we face everything, whether it comes to radio or whatever it is .\" McDowell thinks about what the hardcore Ticket fans, known as the P1's, will want to see. \"I don't think anyone wants to see <mark>Jack White</mark> win,\" McDowell says. \"Now, if we were in some kind of musical competition, I would think he would be favored. But this is a sports competition, and we are sports guys .\" The mental game is strong with the Timbers. \"When I think of <mark>Jack White</mark> rocking, it's a beautiful thing,\" Mike Sirois says. \"When I think of <mark>Jack White</mark> and baseball, all I picture is that meme when he was at that Cubs game a few years ago. That person I am not afraid of .\" Kemp just hopes no one gets hurt. Well, no one famous. If you like this story, consider signing up for our email newsletters. SHOW ME HOW X SUCCESS! You have successfully signed up for your selected newsletter (s) - please keep an eye on your mailbox, we're movin' in! \"And if they do, that I am not responsible for their injury,\" Kemp says. \"I do not have the money to get myself good representation in a civil suit against any of these people .\" Nobody wants to see anyone get hurt, but if <mark>White</mark>'s team loses, it could change how <mark>White</mark>'s second show goes. \"We want Sunday's show to be all slow ballads and all the sad songs that he has,\" Sirois says. \"So hopefully, if we put a good crushing on him and his team, that will be the case .\" The Sandlot War will be at 6 p.m. Saturday at Reverchon Park. Eric Grubbs is a Dallas-based writer who has published two books, Post: A Look at the Influence of Post-Hardcore 1985-2007 and When We Were the Kids. His writing has been featured in Punk Planet, Popdose, Fort Worth Weekly, The Dentonite and LA Weekly. He supports Manchester City and will never root for Manchester United. Contact:", "articleID": "2018042509_00031267_W", "names": {"Jack White": ["Q10539822", "Q24073723", "Q272031", "Q6115762", "Q70713"], "Ty Walker": ["Q15926177", "Q3542640"]}}, {"date": "2018-04-25", "url": "http://www.washingtontimes.com/news/2018/apr/25/louisiana-editorial-roundup/?utm_source=RSS_Feed&utm_medium=RSS", "content": "Louisiana editorial roundup After Macron visit, will Trump come back to Paris climate deal? Question of the Day By The Associated Press - Associated Press - Wednesday, April 25, 2018 Recent editorials from Louisiana newspapers: ___ April 24 The Town Talk on responsibility for pollution: In sports, fans of top-ranked teams will sometimes be accused of trash talking. Today we're going to do some trash talking of our own based on a high rating, but it's not in a proud way. Just in time for Earth Day, which was celebrated Sunday, Louisiana ranked 5th overall in the nation in a recent survey of the \"most polluted\" states. Texas, New Jersey, Michigan and Pennsylvania took the top four spots. Nevada, South Carolina, Georgia, Kansas, and Oklahoma rounded out the top 10. The \"most polluted\" rankings are based on evaluated indicators from government, nonprofit and private sources, including observations by citizens, deaths from collisions with rubbish, \"profiled litterer\" population percentages, effectiveness of litter abatement spending, public entity corruption rankings and discernible maintenance by employees, contractors and volunteers. Pollution results vary in Central Louisiana. On the one end you have communities like Pineville that routinely earn recognition in the annual Cleanest Cities contest. On the other end of the spectrum, Grant Parish recently created a traveling garbage display to help residents realize just how much trash is being tossed out in their community. Recent Gallup Polls have found a majority of Americans have a \"great deal of concern\" about toxic pollutants lingering at water and landed areas managed by states and localities. We have seen those government-regulated environmental concerns grow locally, most notably regarding the Clean Harbors open-burn facility in Grant Parish where expired and surplus explosive materials are destroyed. The most visible sources of litter are the fast-food wrappers and plastic drink bottles that dot our roadways. But it's not uncommon to find larger items along local roadways, from full trash bags to chunks of truck tires to furniture items that have fallen from vehicles. Littering damages landscapes, breeds diseases, causes injuries and deaths to animals and humans. You may be surprised to learn more than 800 Americans die every year from vehicle crashes with ordinary litter like the aforementioned tire chunks and furniture items. Even coolers or other unsecured loads falling from trucks and trailers can appear out of nowhere in front of a driver and cause a fatal crash. We're somewhat more fortunate in Rapides Parish than other areas as inmate crews routinely work local roadways picking up trash and a number of communities have made maintaining a clean community a priority. We're grateful to those who are working to keep Central Louisiana clean, and we encourage all residents to do their part to lessen the workload. Rather than carelessly tossing trash from the car, please wait and throw it out when you reach your destination. If you have a pickup truck or open trailer, please take the time to secure any loose items so they don't blow out while you are driving. It's nothing more than using some common sense and common courtesy to be a good - and clean - member of the community. Online: https: //www.thetowntalk.com April 25 The Advocate cheers the announcement of a petrochemical plant: The numbers really are staggering: $9.4 billion in direct foreign investment, 1,200 permanent jobs, 8,000 construction jobs at its peak. The announcement of the petrochemical plant in St. <mark>James</mark> Parish just south of the Sunshine Bridge is a huge win for the community but also for the state as a whole. Sunshine, indeed. The company bought 2,400 acres for the site and anticipates that construction - lasting over a decade - could begin as soon as next year. Because of the size of Formosa's investment and the number of jobs the plant will create, it will \"fundamentally alter the economy and the wealth of the River Region,\" said <mark>Michael Hecht</mark>, president and chief executive officer of Greater New Orleans Inc., the regional economic development agency. \"This is a big one,\" he said. We congratulate Gov. John Bel Edwards, GNO Inc. and the state's economic developers for this success. We note that this has been a long time in the works, beginning in the administration of former Gov. Bobby Jindal and continuing into today. There's a lot of credit to go around. Louisiana's banks of the Mississippi are among the world's great concentrations of petrochemical refining and manufacturing. Our state is home to a network of pipelines and railroad connections and also a direct source of natural gas, cheap and plentiful, to fuel such a major plant. An economic impact study done by LSU economist <mark>James Richardson</mark> forecast the 10-year construction period will yield $362 million in new state and local tax receipts, plus $313 million in new state and local taxes during the initial 10 years of operation, beginning in 2025. The project will take advantage of the state' Industrial Tax Exemption Program. Although state and community leaders have not always been strategic in the tax breaks they grant to business, we're heartened that tax policy here seems aimed at capital investments representing a long-term commitment to the region. And we're hopeful that the environmental impacts of the project can be addressed in a way that balances progress and sound stewardship of land, air and water. This is a long-term investment. It is one that we hope will not become embroiled in the pointless trade debate with China that has begun, but has not yet escalated, under President Donald Trump. However, steel tariffs - and a $9 billion plant uses a lot of steel - can be an additional cost for the company. Even the president cannot object to the Formosa plant: The company is not from the mainland Communist-ruled China but the independent and democratic Republic of China on Taiwan. The island was formerly named Formosa; its namesake company already has been an investor and contributor to Louisiana's economy since 1981 with facilities in Baton Rouge and in Pointe Coupee Parish. This is, as <mark>Eric Smith</mark> of Tulane's Energy Institute said, a nice confirmation of Louisiana's vitality in petrochemical manufacturing. A very nice confirmation, we think, and one that is sweeter because our friends in Texas competed vigorously for the site selection. Online: http: //www.theadvocate.com The Houma Courier on the New Orleans Pelicans: The New Orleans Saints have held a place in local sports fans' hearts for decades. Often the lovable losers, they had enjoyed a few brief brushes with success over the years, but none of the good runs continued. The past decade, though, has seen the fan base turn from steady, local and faithful to rabid and nationwide. That's due in large part to the team's recent success with coach Sean Payton and quarterback Drew Brees. The New Orleans Pelicans are hoping they've tapped into a similar vein of success with All-Star forward <mark>Anthony Davis</mark> and a host of young stars around him. Since his arrival last season as a free agent, center Demarcus Cousins has added fuel to the excitement surrounding the team. Unfortunately, a misstep in the final seconds of a game back in January left Cousins with a torn Achilles tendon, unable to play the remainder of the season. The team and its fans worried that their hopes for a playoffs appearance could be dashed. And the team went on a losing streak that saw it drop five of its next six games and looking increasingly unlikely to make the postseason. But <mark>Davis</mark> and his healthy teammates then went on a 10-game winning streak and a strong finish to the season that propelled them into the playoffs. Their playoff matchup was the Portland Trailblazers, who had split the season series with the Pelicans - with each team winning two of the four games. The Blazers finished with the third seed in the West, the Pelicans the sixth. Most national observers assumed Portland would beat New Orleans handily. They were wrong. The Pelicans won four straight games to sweep Portland out of the playoffs and await their Round 2 opponents. In fact, the Pelicans were the only team in the first round to sweep its opponent - an impressive feat for a team that just a few months ago seemed on the verge of collapse. Their fans, meanwhile, remain hopeful that they can once again defy the odds, as they will likely face the defending champion Golden State Warriors in the second round. But with the Pelicans riding the longest active winning streak in the NBA, anything is possible. The Pelicans might never enjoy the kind of love the Saints have with their fan base. But they are doing everything they can to make local fans once again embrace the winning tradition in New Orleans - a feeling many haven't felt since point guard <mark>Chris Paul</mark> was leading the team to multiple postseason appearances. If nothing else, <mark>Davis</mark> and his team are helping south Louisiana fans through the long months that precede the football season. Let's go, Pelicans! Online: http: //www.houmatoday.com/", "articleID": "2018042600_00039931_W", "names": {"Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"], "Eric Smith": ["Q18145133", "Q21822473", "Q30122558", "Q3731526", "Q51745810", "Q5387537", "Q5387540", "Q5387541", "Q5387543", "Q57895239"], "James Richardson": ["Q16226010", "Q18637809", "Q43912606", "Q4394973", "Q6142072", "Q6142076", "Q6142078"], "Michael Hecht": ["Q1423703", "Q6831048"]}}, {"date": "2018-04-27", "url": "http://www.femalefirst.co.uk/celebrity/orlando-bloom-finds-hard-impress-son-1140914.html?f=rss", "content": "Orlando Bloom finds it hard to impress his son Orlando Bloom finds it \"very hard to impress\" his seven-year-old son Flynn. STUMBLE SHARE SHARE TWEET PIN 27 April 2018 Orlando Bloom finds it \"very hard to impress\" his seven-year-old son. Orlando Bloom The \"Pirates of the Caribbean' star has revealed Flynn - who he has with his ex-wife Miranda Kerr - is one of his biggest critics and is difficult to please. He said:\" He definitely won't be seeing \"Killer <mark>Joe</mark>' but he has seen some of\" Pirates of the Caribbean'. It's very hard to impress him but he liked it. \"And the 41-year-old actor - who is currently dating Katy Perry - loves the\" massive adrenalin rush \"he has got from starring in a play. Speaking on The <mark>Graham Norton</mark> Show, he added:\" It's fantastic and although it's 17 years old, it feels very current. Most people would not think of me in this role after \"Will Turner' and\" Legolas'. It has sensitive material and is quite dark, shocking and challenging. The appeal of the theatre is the response from the audience. It's like free-falling and a massive adrenalin rush. \"Meanwhile, Orlando previously confessed he will be studying animals at the zoo to prepare for his gritty return to the West End in black comic thriller\" Killer <mark>Joe</mark>'. Speaking about how he'll work on the part of detective <mark>Joe Cooper</mark> - who has a side job as a contract killer - he shared: \"This play is particularly interesting at this time. It's about the disenfranchised American dream. But it's funky and provocative and visceral. It's everything I go to the theatre for...I will start to look at animals - I'll go to the zoo. I like to find an animal, some kind of creature that helps me to inhabit the character - their rhythm, beat and pace. I'm quite physical as a person .\" The <mark>Graham Norton</mark> Show airs on BBC One on Friday (April 27) at 10.35 pm. Tagged in Katy Perry Orlando Bloom STUMBLE SHARE SHARE TWEET PIN", "articleID": "2018042714_00285576_W", "names": {"Graham Norton": ["Q19154", "Q5593104"], "Joe Cooper": ["Q16236053", "Q17484134", "Q17484135", "Q592854"]}}, {"date": "2018-04-27", "url": "http://ctvnews.ca/sci-tech/distracted-by-technology-microsoft-tries-to-help-1.3905375", "content": "Distracted by technology? Microsoft tries to help Windows 10 operating on a Microsoft Surface computer in New York. (<mark>Richard Drew</mark> / AP) Matt O'Brien, The Associated Press Published Friday, April 27, 2018 1:33 PM EDT Technology companies whose devices and constantly scrolling online services have driven us to distraction are beginning to acknowledge that their products can be a waste of time. Some of them now say they're trying to help. Microsoft is rolling out a free update to its Windows 10 computer operating system Monday with new features to keep people in a distraction-free zone. The \"Focus Assist\" feature enables workers to temporarily switch off email and social media notifications during times when they need to keep their heads down. They can allow messages from certain people to break through. Microsoft says the update is inspired by research showing office workers are being interrupted or having to switch tasks about every three minutes--and it takes 23 minutes to get back in focus. Microsoft is also adding a \"Timeline\" feature aimed at saving time by more easily retrieving documents or unfinished work from the past 30 days. \"Almost every application and web service is vying for your attention,\" said Aaron Woodman, a marketing general manager for Microsoft Windows. \"Increasingly, people are going to prefer environments where they can control and manage their distractions .\" It may be easier for Microsoft to create such limits, as its business is far less reliant on advertising than Google and Facebook. With advertising in the mix, more time spent means more revenue. Apple's iPhone and Google's Android phones have \"Do Not Disturb\" modes for muting notifications. Microsoft's biggest email rival, Gmail, began rolling out a redesign this week that includes time-saving measures. One uses artificial intelligence to allow Google to help respond to emails with quick answers such as \"Will do, thanks!\" or \"Sorry, I won't be able to attend .\" Facebook CEO Mark Zuckerberg surprised investors earlier this year when he said he welcomed the idea of fewer hours spent on his site, arguing that \"helping people connect is more important than maximizing the time people spend on Facebook .\" The social network also on Friday said it is adding a \"sleep\" mode to its Messenger Kids service to let parents limit when their kids can use it. Related Stories", "articleID": "2018042717_00193244_W", "names": {"Richard Drew": ["Q1531836", "Q53350768"]}}]