[{"date": "2018-04-27", "url": "http://wdel.com/blogs/allan-loudell/open-friday-weekend-forum-special-korea-edition/article_f08360d6-4a34-11e8-9138-8769dc2ad455.html", "content": "So which stories / issues / topics grab your attention here at the end of the week? At week's end, Delaware's media, political, and academic establishments were still rocked by that homicide-suicide in Radnor Township, Pennsylvania. So many folks knew Meredith Chapman. And, as we've learned, homicide-suicides perpetrated by women are quite rare. Looks like Delaware's three casinos could be on track to get a tax break to keep them viable. At least, the state Senate finance committee has okayed a measure to reduce taxes and fees; it remains to be seen if this package will clear the legislature. I realize jobs are on the line, but casinos are no panacea for jobs, as even some very impoverished places--such as Tunica County, Mississippi--have discovered. Casinos are no elixir. In fact, with all kinds of gambling, we have an oversaturation of casinos. Just look at Atlantic City. So would Delaware lawmakers be throwing good money after bad? And let's not forget the ugly social costs from all this gambling. From casinos to state lotteries, a charlatan's way to raise revenue. That task force that reviewed the pros and cons of consolidating school districts in Delaware decides consolidation is not the way to go. No matter the calls to talk-shows and letters to the editor of newspapers. The benefits of consolidation are also illusory. It's interesting how many of the proponents of consolidation also somehow favor charter schools, which require principals, assistant principals, and, of course, buildings. Can't people comprehend the inherent contradiction? Not to mention making a school board and superintendent even more remote from the general community? I happen to come from a part of the country (suburban Chicago), where each village or town generally has its own school board and administrators for the elementary schools (K-8). But the high schools come under the township level, with their separate school boards and administrators. Could you imagine? Yet, because the public schools enjoy widespread public support in most cases--with hardly any competition from Catholic or other private schools--you don't hear all that consolidation talk. Even with much higher property taxes. Consolidation is also not some elixir. During the \"Susan Monday Show\" this (Friday) morning, I heard Susan and callers debate whether President <mark>Trump</mark> should get most of the credit for the two Koreas seemingly come together. Not so fast. From my analysis, such talk is unrealistically premature. What good is a vague North Korean pledge to denuclearize? People have short memories. We've seen this before. Arguably, North Korea's dictator <mark>Kim Jong-Un</mark> is just trying to detach South Korea from its U.S. alliance. Arguably, Pyongyang has set a trap for President <mark>Trump</mark>. Has \"Rocket Man\" not pulled out the rug from underneath President <mark>Trump</mark>? Because if President <mark>Trump</mark>, in a summit, cannot win intense verifiable inspections of North Korea's nukes - and he withdraws from any talks, or even again threatens North Korea--Mr. <mark>Trump</mark> comes off looking like the global bully. From The Guardian...And a reality check from The Asia Times...Yet, clearly, in South Korea, at least some people are optimistic, given all the hopeful visual symbolism. But again, this could serve to detach South Korea's interests from America's. From The Korea Times of Seoul...Yet, there's something to the argument that President <mark>Trump</mark>'s \"Crazy-like-a-Fox\" posture brought North Korean leader <mark>Kim Jong-Un</mark> to the negotiating table. From Australia's Melbourne Age...Still, one can't help but think: Either this unorthodox President has achieved a great breakthrough precisely because he's avoided all the usual diplomatic niceties, or he's fallen into the same trap as all his predecessors, but doesn't even realize it yet. From The Atlantic...Of course, the buzz has begun: <mark>Donald Trump</mark> for the Nobel Peace Prize! From New York Magazine...I continue to believe the <mark>Trump</mark> Administration is toxic for nearly all who serve in it. Almost everyone who serves comes out diminished or degraded. This analysis from Politico Magazine...Also, from Politico Magazine: \"The Puzzle of Sarah Huckabee Sanders\" Article continues below advertisement Remember so-called \"Freedom Fries\" (in response to France's opposition to the proposed second invasion of Iraq, in 2003)? That seems so long ago, when many Americans were enraged with France. Now, France has arguably eclipsed Britain and Germany as a top international player with the U.S., following French President Macron's state visit to Washington. The Germans certainly are aware. From Spiegel...What is so ironic is that the French President's speech to Congress was, in so many ways, a sharp rebuke to Trumpism. From Time...A revealing behind-the-scenes look from the Presidential photographer after the <mark>Barbara Bush</mark> funeral. Special Michelle--Melania bond? From The Daily Mail...Aftermath of the guilty verdict returned against Bill Cosby: Yanking honorary degrees and other awards. The big question mark is Philadelphia's Temple University. From The Philadelphia Inquirer / philly.com ...", "articleID": "2018042719_00062723_W", "names": {"Barbara Bush": ["Q153730", "Q190628", "Q2884044"], "Donald Trump": ["Q22686", "Q27947481"], "Kim Jong-Un": ["Q10855883", "Q56226"]}}, {"date": "2018-04-27", "url": "https://www.teenvogue.com/gallery/rihanna-met-gala-red-carpet-best-looks", "content": "Rihanna's Best Met Gala Looks of All Time 11 years of red carpet perfection. Pinterest Getty Images Rihanna will be co-hosting this year's 2018 Met Gala along with Donatella Versace and Amal Clooney (with Vogue Magazine's Editor-In-Chief, Anna Wintour, serving as Chair, of course). In collaboration with the Metropolitan Museum of New York and the Costume Institute, this year's theme will be \"Heavenly Bodies: Fashion and the Catholic Image .\" Rihanna is one of the most fitting choices we can imagine to host, as she's attended the gala as far back as 2007, skipping a few in between to amount to a total of seven appearances on NYC red carpet. As one of the biggest nights of the year when it comes to fashion, we can't wait to see how all in attendance--especially Rihanna herself--will interpret the religiously-pointed theme. 11 years ago, 19-year-old Rihanna hit the red carpet for her first ever Met Gala in a Georges Chakra dress that was understated and simple, despite some embellishment on top. Since then, she's only risen further and further up the fashion-statement totem pole, consistently topping the best-dressed list and being one of the few celebrities on the red carpet to nail the theme each year. From Chinese designer <mark>Guo Pei</mark> to a Comme des Garçons look that we're still dreaming about, here are all of Rihanna's Met Gala looks to date.", "articleID": "2018042720_00080426_W", "names": {"Guo Pei": ["Q20984058", "Q45454805", "Q45644543", "Q45677692"]}}, {"date": "2018-04-28", "url": "http://www.themalaymailonline.com/s/1625024/the-fight-for-ayer-hitam-begins", "content": "Datuk Seri Wee Ka Siong (pic), Datuk Samsol Bari Jamali, and Ling Tian Soon were almost disqualified today .--Bernama pic AYER HITAM, April 28--Barisan Nasional's (BN) candidates for Ayer Hitam parliamentary and state seats were almost disqualified today after they arrived at the nomination centre a minute later after 9am. In response, their supporters started chanting for Datuk Seri Wee Ka Siong, Datuk Samsol Bari Jamali, and Ling Tian Soon to run to the centre. Shouts of \"calon mana? (Where's the candidate?)\" , \"Suruh dia cepat lari\" (Ask them to run) and \"Dah pukul sembilan! (It's already nine o’clock!)\" were heard as the group arrived at the school. Meanwhile, a sea of red and blue enveloped <mark>Yong Peng</mark> on Nomination Day. About 400 Pakatan Harapan (PH) supporters gathered at PH <mark>Yong Peng</mark> Ops Centre before they marched to SMK Dato Seth at around 7.50 am. Supporters chanted \"Pakatan Harapan\" and \"Hidup Rakyat\" as they marched along Jalan <mark>Yong Peng</mark> to Dataran Gemilang <mark>Yong Peng</mark> food court about a kilometre away for a short break. PH Ayer Hitam candidate Liew Chin Tong said he hoped the nomination process would go smoothly. \"I also hope in the next 11 days the battle here in Ayer Hitam will be able to change the political landscape of Malaysia,\" he said on the sidelines before the march. Meanwhile, at BN's camp, about 400 supporters gathered at Bilik Gerakan MCA <mark>Yong Peng</mark> before making their way towards Dataran Gemilang <mark>Yong Peng</mark>. PH Ayer Hitam candidate Liew Chin Tong said he hoped the nomination process would be incident-free.", "articleID": "2018042802_00101282_W", "names": {"Yong Peng": ["Q51570293", "Q58814502"]}}, {"date": "2018-04-27", "url": "http://chronicleonline.com/news/local/hospital-physical-rehabilitation-focuses-on-bettering-golf-swing/article_7e553af2-4a43-11e8-ad15-0be1d2dc7b3d.html", "content": "Despite decades of playing golf, the next time Richard Decker swings a club, there's no telling where the ball will go. Decker, 72, was a pretty good weekend golfer with scores below 100 and playing two or three times a week. Then his shoulder started hurting and he was hitting the ball 15 yards short. \"Then I hit one too many...and I hurt it more. Then a tried taking another and I just couldn't do it,\" he recalled. That was late last year. He had torn his rotator cuff. Surgery was Jan. 19. Now he can barely raise his left arm above his shoulder and his surgeon doesn't want him playing golf for several more months. \"So I can't swing yet. I can't play,\" he said. As to what his game will be like when he takes up golf again next year? \"I don't know,\" said the former assistant warden from the federal prison system, shaking his head. To give himself the best chance of being able to play again, though, Decker and 32 other golfers attended a recent presentation at the Citrus County YMCA hosted by Citrus Memorial Hospital's rehabilitation program. The program offers physical rehabilitation with a focus on getting your golf game back as we age or recover from surgery or injury. About 40,000 Americans opt for rotator-cuff surgery every year, but more than half don't return to normal use of their arm if they've had a large tear, according to an Orthopaedic Research Institute study done in Australia. Decker is recovering from a bad tear. Physical therapist Fred Shirley told the group of mostly seniors that the hospital's program works like most other rehabilitation strategies, but with the goal that the patient wants to golf again or improve their game. Shirley uses a Blast Motion cell phone app that video records the patient's golf swing. The program also includes a small sensor placed on the handle of the club that records swing velocity along each point in the swing. The rehabilitation focuses on injuries that cause golfers to swing incorrectly or changes in their swing due to surgeries. He said the therapy is useful whether the patient is still recovering from surgery or an injury and not yet back playing golf again. It's also good for patients back at the game but not playing up to par. Shirley said that while he's not a great golfer, that's not important in this therapy program. \"I look at everything from a biomedical (perspective) and I'm looking for balance,\" Shirley said. The problem is that during the healing period, golfers often pick up bad habits to compensate for their injuries or surgeries, he said. \"And that drastically changes your swing,\" he said. And even when the injury heals or the surgery site recovers, those bad habits remain, he told the golfers. \"That's where I come in,\" he said. Shirley analyzes the swing and then gets to work building the patient's strength in the right areas and ending unwanted compensation. In many cases health insurance will pay for the rehabilitation when there is a legitimate injury or when the patient is recovering from surgery, Shirley said. Shirley works out of Citrus Memorial's Crystal River rehabilitation location. Decker and others like him are good candidates for the program, Shirley said. \"The habits he's picking up now are ones we can eliminate before they become really difficult to get rid of,\" Shirley said. Ale Denton is an 80-year-old retired postman. He also came to the event. It's not the surgeries that have slowed his golf game down, Denton said, but rather the natural progression of age. \"I was never really that good,\" Denton said, \"but maybe I can be better .\" He wants Shirley to help with that. Shirley told the group that most people can't hit the ball as far as they could 20 years ago, so analyzing a player's swing as they age and then strengthening where they can would help most players, Shirley said. <mark>David Reed</mark> is the YMCA's operations director and an avid golfer. He lent Citrus Memorial Hospital the YMCA room for the presentation because there are many golfers here enjoying Citrus County's more than a dozen golf courses. \"Golf is a sport; a community,\" <mark>Reed</mark> said. \"People respect the game of golf. It brings people together .\" Katie Myers, Citrus Memorial's director of marketing and public relations, said that all of the hospital's physical therapists enjoy specializing in one kind of rehabilitation in addition to traditional therapy. \"Fred's really honed in on something that's near and dear to him,\" Myers said. \"People don't realize how much that they do during their daily lives that can be helped with physical therapy,\" she said, \"and that includes golf .\" Golf is such an important aspect of our community, \"she said,\" and Citrus Memorial wants people to continue to do what they love. \"People interested in contacting Shirley can reach him at 352-563-0030. Contact Chronicle reporter Fred Hiers at fred.hiers @ chronicleonline.com or 352-397-5914. Sign Up for Email Updates For Email Marketing you can trust.", "articleID": "2018043001_00189722_W", "names": {"David Reed": ["Q10514791", "Q1176289", "Q20737746", "Q3018673", "Q5238951", "Q5238952"]}}, {"date": "2018-04-30", "url": "http://www.koimoi.com/box-office/avengers-infinity-war-is-one-of-the-highest-weekend-grossers-of-all-time-in-india-see-where-it-stands/", "content": "Box Office Trending tweet Marvel Studio's Avengers: Infinity War has created a storm at every box office in the world. Smashing records left and right without even breaking a sweat, the film has managed create new milestones for Hollywood films in India as well. After the crown for the highest opening day collection of 2018 with 31.30 crores, the film has also successfully become the second highest weekend grosser of 2018 at 94.30 crores, after Padmaavat's whooping 114.00 crores (Extended weekend). But that is not all. The superhero flick has also managed to become one of the highest weekend grossers of all time in India, a feat not yet achieved by any other Hollywood film. Avengers: Infinity War Is One Of The Highest Weekend Grossers Of All Time In India; See Where It Stands! Avengers: Infinity War currently ranks 14th on the list, with a close competition between it and Hrithik Roshan starrer Bang Bang, which now stand 15th at 94.13 crores. However, the Marvel film didn't manage to surpass the Khans' films like PK, Jab Tak Hai Jaan, Chennai Express and Bajrangi Bhaijaan. Still, the film has made history, achieving such numbers even though it had a much lower screen count compared to the others on the list. Trending Akshay Kumar Rustom Uniform Controversy: \"It's A Crime To Sell Uniform,\" Says GD Bakshi WATCH: Ranveer Singh Looks Like A Splitting Image Of Queen's Freddie Mercury! Here's the complete list of the top 15 highest weekend grossers in India: Sultan - 180.36 cores Prem Ratan Dhan Payo - 129.77 crores Baahubali 2 - 128 crores Ek Tha Tiger - 116.05 crores Tiger Zinda Hai - 1 14.93 crores Padmaavat - 114.00 crores Happy New Year - 108.86 crores Dhoom 3 - 107.00 crores Dangal - 106.95 crores Bajrangi Bhaijaan - 102.60 crores Chennai Express - 100.35 crores Jab Tak Hai Jaan - 98 crores PK - 95.21 crores Avengers: Infinity War - 94.30 crores Bang Bang - 94.13 crores The first week collections of Avengers: Infinity War will be a clear indicator of where the film stands. Since it is not facing any competition from other films at the India Box office, it should make the most of it. Also the film is receiving a lot of positive word of mouth, which will help the film's collections in the weeks to come. RELATED ARTICLES BOLLYWOOD NEWS Dadasaheb Phalke Film Foundation Awards 2018: Farida Jalal, Akshay Kumar & Manisha Koirala Shine Bright! Anil Kapoor: <mark>Salman Khan</mark> Has Done Things Wholeheartedly In Race 3! WATCH: Ranveer Singh Looks Like A Splitting Image Of Queen's Freddie Mercury! Check This Out When Deepika Padukone Turned \"Desi Girl' At TIME 100 Gala Ranbir Kapoor On His Own Biopic:\" Don't Think My Life Is...Naseeruddin Shah Feels More Rape Cases Being Reported Is A Good...Sanju Teaser: The Widest Viewed, Most Searched & Most Talked About! Aanand L. Rai's Unconventional Love Story Meri Nimmo Sees A Major...Will <mark>Salman Khan</mark> Repeat The Biwi No. 1 Magic With Bharat...LEAVE A REPLY Cancel reply Please enter your comment! Please enter your name here You have entered an incorrect email address! Please enter your email address here Box Office Verdict 2018 Avengers: Infinity War 94.30 Cr October 42.50 Cr Rampage 26.50 Cr Blackmail 19.11 Cr Baaghi 2 155.65 Cr Top 10 Bollywood Movies 2018 Padmaavat 300.26 Cr Baaghi 2 155.65 Cr Sonu Ke Titu Ki Sweety 108.71 Cr Raid 101.54 Cr PadMan 78.95 Cr Don't miss Race 3 New Poster: <mark>Salman Khan</mark> & Jacqueline Fernandez's SEXY Stare...Aamir Khan's 30 Years In Bollywood Leads To Fan Frenzy On...Happy Birthday Varun Dhawan: GRAND Box Office Total Of All His...Box Office Star Ranking <mark>Salman Khan</mark> 2100 Points Aamir Khan 1350 Points Shah Rukh Khan 1000 Points Ajay Devgn 900 Points Akshay Kumar 800 Points Ranveer Singh 550 Points Hrithik Roshan 500 Points Varun Dhawan 400 Points Upcoming Movies 4th May Omerta 4th May Laila Majnu 4th May 102 Not Out 11th May Raazi 11th May Hope Aur Hum 11th May Fry Day 25th May Bhavesh Joshi Superhero Previous Next View Complete List Reviews Avengers: Infinity War Movie Review: Marvel Will Hold Your Breath & BLOW Your Mind Away! Avengers: Infinity War Movie Review Quicker: Marvel Has Done The Unimaginable! Nanu Ki Jaanu Movie Review: Read This & Save Yourself From Some Horrendous Torture", "articleID": "2018043011_00219254_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}, {"date": "2018-04-30", "url": "http://foxbusiness.com/markets/wynn-sues-ex-salon-chief-quoted-in-sexual-conduct-stories", "content": "Facebook Twitter Comments Print article Former casino mogul <mark>Steve Wynn</mark> has filed a defamation lawsuit against a former Wynn Las Vegas salon director over claims attributed to the man in media reports about sexual misconduct by Wynn. Continue Reading Below Wynn accuses defendant Jorgen Nielsen of malice for quotes reported by the Wall Street Journal and ABC News that the lawsuit says left a false and defamatory impression \"that Mr. Wynn is a sexual predator who used his power over decades to coerce or pressure various women into non-consensual sexual conduct .\" Nielsen declined Monday to comment when reached by telephone about the lawsuit filed Thursday in state court in Las Vegas. His attorneys did not immediately respond to telephone and email messages. Nielsen was salon director at several hotels developed and built by Wynn, including Bellagio, Wynn Las Vegas and Encore. Nielsen told the Journal that he and other employees informed company executives about sexual advances by Wynn, but no action was taken. Wynn denies the allegations. In a statement Monday, his attorney Lin Wood referred to a \"media frenzy\" surrounding the initial reporting of accusations against Wynn. Wood noted that the filing against Nielsen was the third defamation lawsuit by Wynn recent weeks. Advertisement The statement said Wynn does not wish to prosecute the lawsuits in the media but does \"seek to hold the defendants accountable for the accusations they made against him .\" A separate Wynn filing in federal court in Las Vegas accuses lawyer Lisa Bloom, representing a dancer in a show at Wynn Las Vegas, of defaming Wynn with allegations of inappropriate behavior. Bloom said she'll fight Wynn in court and believes the lawsuit was an attempt to intimidate other women. Two massage therapists and a manicurist have in recent months sued Wynn, accusing him of using his power to coerce them into sexual acts. Wynn has filed a defamation lawsuit against The Associated Press for its reporting on a separate allegation made to Las Vegas police. Wynn's lawsuit against Nielsen accuses him of \"smearing Mr. Wynn...at a time when he was embroiled in highly contentious and public litigation with his ex-wife, Elaine Wynn .\" The Journal reported that several women said Wynn harassed or assaulted them and one case led to a $7.5 million settlement. The newspaper quoted <mark>Steve Wynn</mark> saying the idea that he had assaulted any woman was \"preposterous .\" Wynn has resigned as chairman and CEO of the company that bears his name and sold his company shares. He reached a $25 million settlement with Elaine Wynn, ending a boardroom battle that started in 2012 between <mark>Steve Wynn</mark> and a former business partner.", "articleID": "2018043021_00229656_W", "names": {"Steve Wynn": ["Q323739", "Q524369"]}}, {"date": "2018-04-30", "url": "http://triblive.com/usworld/world/13600551-74/jhoon-rhee-father-of-american-taekwondo-dies-at-age-86", "content": "Jhoon Rhee, \"father of American Taekwondo,' dies at age 86 The Associated Press | Monday, April 30, 2018, 9:42 p.m. Jhoon Rhee Sign up for one of our email newsletters. Updated 15 minutes ago ARLINGTON, Va.--Grandmaster Jhoon Rhee, the man known as the\" father of American Taekwondo, \"died Monday after a long illness. He was 86. His son, Chun Rhee, said his father died in hospice care in Arlington, Virginia, a suburb of the nation's capital. Jhoon Rhee was a 10th-degree black belt credited with popularizing taekwondo in the United States, especially around the nation's capital, after emigrating from Korea in the 1950s. He opened his first taekwondo school in Washington, D.C., in 1962. By the 1980s, Rhee had 11 schools in the Washington area. Rhee became friends with legendary martial artist and actor Bruce Lee and appeared in a 1973 movie titled\" When Taekwondo Strikes. \"He also befriended boxer <mark>Muhammad Ali</mark>. Chun Rhee said that during a 1976 sports awards ceremony, his father jokingly challenged <mark>Ali</mark> and basketball legend Wilt Chamberlain to a fight to settle which one of them was\" the greatest \"athlete .\" Martial arts was a way of life for him, \"Chun Rhee said. Chun Rhee said funeral arrangements have not yet been finalized. He said information about a memorial service will be posted later this week. TribLIVE commenting policy You are solely responsible for your comments and by using TribLive.com you agree to our Terms of Service. We moderate comments. Our goal is to provide substantive commentary for a general readership. By screening submissions, we provide a space where readers can share intelligent and informed commentary that enhances the quality of our news and information. While most comments will be posted if they are on-topic and not abusive, moderating decisions are subjective. We will make them as carefully and consistently as we can. Because of the volume of reader comments, we cannot review individual moderation decisions with readers. We value thoughtful comments representing a range of views that make their point quickly and politely. We make an effort to protect discussions from repeated comments either by the same reader or different readers We follow the same standards for taste as the daily newspaper. A few things we won't tolerate: personal attacks, obscenity, vulgarity, profanity (including expletives and letters followed by dashes), commercial promotion, impersonations, incoherence, proselytizing and SHOUTING. Don't include URLs to Web sites. We do not edit comments. They are either approved or deleted. We reserve the right to edit a comment that is quoted or excerpted in an article. In this case, we may fix spelling and punctuation. We welcome strong opinions and criticism of our work, but we don't want comments to become bogged down with discussions of our policies and we will moderate accordingly. We appreciate it when readers and people quoted in articles or blog posts point out errors of fact or emphasis and will investigate all assertions. But these suggestions should be sent via e-mail. To avoid distracting other readers, we won't publish comments that suggest a correction. Instead, corrections will be made in a blog post or in an article.", "articleID": "2018050101_00197576_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}}, {"date": "2018-05-02", "url": "https://www.boxingscene.com/warren-wilder-joshua-beat-tyson-fury-true-champ--127759", "content": "Read More By: Boxing Clever <mark>Warren</mark>: Wilder, Joshua Must Beat Tyson Fury To Be \"True Champ' The efforts of Anthony Joshua (21-0, 20 KOs) and Deontay Wilder (40-0, 39 KOs) to unify the heavyweight division are in vain until they defeat lineal champion Tyson Fury, according to promoter <mark>Frank Warren</mark>. Joshua and Wilder are in talks for a mammoth bout to unify their five main belts, with the former holding the IBF, IBO, WBA and WBO straps previously owned by Fury. However, as Joshua did not beat Fury to take those titles, <mark>Warren</mark> has questioned his position as the\" true \"heavyweight champion before he has fought the returning 29-year-old. Fury is viewed as the <mark>man</mark> who beat the <mark>man</mark>, because he handed Wladimir Klitschko his first defeat in a decade back in November of 2015 .\" Tyson is the best heavyweight out there, \"<mark>Warren</mark> told talkSPORT .\" He's the lineal champion, he never lost his titles in the ring, he gave them up, and now he's back to get those belts back where they should be. \"No one can consider themselves the true heavyweight champion of the world unless they beat the lineal champion, the guy who never lost the titles in the ring - and that's Tyson Fury .\" Fury will make his comeback in June against an as yet unnamed opponent, though he intends to take \"baby steps\" as he plots a path to the top of the division. \"I'm not in any rush,\" he said in an interview with talkSPORT. \"I'm in a fantastic place at the minute and I hope to stay there .\" I'm 29 years old, I've got a wealth of experience behind me, I've got the <mark>magic man</mark> <mark>Frank Warren</mark> in my corner and we're just going to take baby steps. \"The ultimate goal is to unify the titles again and be the undisputed champion .\" The short-term goal is to get back in the ring, dance beneath the stars and have fun, enjoy it, give the fans something to talk about and give the fans value for money. \"", "articleID": "2018050209_00035076_W", "names": {"Frank Warren": ["Q1444412", "Q23657144", "Q5490233"]}}]