[{"date": "2018-05-02", "url": "https://www.boxingscene.com/warren-wilder-joshua-beat-tyson-fury-true-champ--127759", "content": "Read More By: Boxing Clever <mark>Warren</mark>: Wilder, Joshua Must Beat Tyson Fury To Be \"True Champ' The efforts of Anthony Joshua (21-0, 20 KOs) and Deontay Wilder (40-0, 39 KOs) to unify the heavyweight division are in vain until they defeat lineal champion Tyson Fury, according to promoter <mark>Frank Warren</mark>. Joshua and Wilder are in talks for a mammoth bout to unify their five main belts, with the former holding the IBF, IBO, WBA and WBO straps previously owned by Fury. However, as Joshua did not beat Fury to take those titles, <mark>Warren</mark> has questioned his position as the\" true \"heavyweight champion before he has fought the returning 29-year-old. Fury is viewed as the <mark>man</mark> who beat the <mark>man</mark>, because he handed Wladimir Klitschko his first defeat in a decade back in November of 2015 .\" Tyson is the best heavyweight out there, \"<mark>Warren</mark> told talkSPORT .\" He's the lineal champion, he never lost his titles in the ring, he gave them up, and now he's back to get those belts back where they should be. \"No one can consider themselves the true heavyweight champion of the world unless they beat the lineal champion, the guy who never lost the titles in the ring - and that's Tyson Fury .\" Fury will make his comeback in June against an as yet unnamed opponent, though he intends to take \"baby steps\" as he plots a path to the top of the division. \"I'm not in any rush,\" he said in an interview with talkSPORT. \"I'm in a fantastic place at the minute and I hope to stay there .\" I'm 29 years old, I've got a wealth of experience behind me, I've got the <mark>magic man</mark> <mark>Frank Warren</mark> in my corner and we're just going to take baby steps. \"The ultimate goal is to unify the titles again and be the undisputed champion .\" The short-term goal is to get back in the ring, dance beneath the stars and have fun, enjoy it, give the fans something to talk about and give the fans value for money. \"", "articleID": "2018050209_00035076_W", "names": {"Magic Man": ["Q23928996", "Q2654402"]}}, {"date": "2018-05-04", "url": "https://www.mprnews.org/story/2018/05/04/vikings-bow-to-neighbors-to-turn-off-lights-at-night", "content": "Vikings team bows to neighbors, to turn off lights at night Sports & Leisure The Associated Press · Eagan · May 4, 2018 The Minnesota Vikings' new practice facility in Eagan, as seen while it was under construction Oct. 23, 2017. Courtney Perry for MPR News 2017 The Minnesota Vikings are turning off the lights at the team's new practice facility in Eagan after neighbors complained about the glow. Spokesperson <mark>Jeff Anderson</mark> says the NFL team will turn off the lights between 11 p.m. and 6 a.m.. The shut-off time will be moved to about midnight when the team hosts night events such as high school games. • Soccer: Stadium's skeleton nearly complete. Next: translucent skin for Allianz Field The team moved into the new building in March. The building's north side is nearly 100 feet high and is lit up with the team's Norseman logo and the words \"Twin Cities Orthopedics Performance Center--Home of the Minnesota Vikings .\" Mendota Heights residents complained about the lights last month. <mark>Anderson</mark> says the team is \"listening to the community .\" The team expects the change to occur this weekend. The news on your schedule from MPR News Update Email Address *", "articleID": "2018050413_00238258_W", "names": {"Jeff Anderson": ["Q1140895", "Q26899394", "Q29167254", "Q50239827", "Q6173216", "Q6173217"]}}, {"date": "2018-05-05", "url": "http://baynews9.com/fl/tampa/news/2018/05/05/new-pinellas-park-soccer-fields-open-to-all-at-a-low-price", "content": "New Pinellas Park soccer fields open to all at a low price By Tim Wronka | May 5, 2018 @ 1:54 PM SHARE It's a favorite sport for many kids but the cost keeps many of them from playing it. Now, youth soccer players in the Bay Area have a new alternative: soccer fields that anyone can use for a low price. New Pinellas Park soccer fields open to all at a low price BT Sports Academy on 49th Street More info on BT Sports Academy Bruce To invested his own money to build new soccer fields in Pinellas Park. He wants them open to everyone. \"I've come across a lot of kids who couldn't afford to play, especially travel clubs,\" To said. He and volunteers cleared out a junkyard on 49th Street, turning it into BT Sports Academy. It's a place where anyone can play a pickup game of soccer. \"Our goal is to have a place where kids, or adults even, can come play the game and not have to worry about being asked to leave,\" To said. The fields are a hit. They consistently fill up with parents and some smaller leagues who can't pay thousands for a soccer club. \"We want parents to be able to get good coaching without paying an arm and a leg for it,\" said parent and soccer coach <mark>Matthew Young</mark>. To has plans to build even more, including some indoor fields and even a restaurant. It's part of a lifelong dream to see no child turned away from a game. \"Every time I watch kids, dads, moms playing, kids versus coach, it's a great feeling,\" To said. BT Sports Academy does charge a small fee, sometimes as low as $5 for a pickup game. To says that is lower than what many public parks charge. Plus, To says many public parks are usually occupied by bigger leagues. READ MORE", "articleID": "2018050518_00065502_W", "names": {"Matthew Young": ["Q19921862", "Q3299822", "Q58209744", "Q58234510", "Q6791459"]}}, {"date": "2018-05-06", "url": "http://www.stuff.co.nz/the-press/business/103645157/In-Their-Prime-Bennys-Barber-Shop-opens-warehouse-space-in-central-Christchurch", "content": "In Their Prime: Benny's Barber Shop opens warehouse space in central Christchurch JACK FLETCHER Last updated 15:48, May 6 2018 JOSEPH JOHNSON/STUFF Benny's Barber Shop owner <mark>Ben Scott</mark> is moving his business inside a warehouse at the corner of Orbell and Disraeli streets. Clients will be able to shoot hoops and play video games. Basketball, coffee and clipper cuts. All is on offer at Christchurch's biggest and most unique barber. Maximising its cult-like following, Benny's Barber Shop has opened its new 300-square-metre headquarters in an old glazing warehouse on Orbell St in Sydenham. JOSEPH JOHNSON/STUFF Benny's Barber Shop owner <mark>Ben Scott</mark> plays a computer arcade game at his new premises. Owner <mark>Ben Scott</mark> said it would become the company's main premises; its existing barbershops literally moved in under the high ceilings. Previously dotted around the city, Benny's three containers and two caravans were rolled in and installed over the weekend, bordering a basketball half court. READ MORE: * Benny cutting his own path to success in Christchurch * A barber shop in retro caravans gives Christchurch men an edge JOSEPH JOHNSON/STUFF Benny's Barber Shop's new premises will provide a cafe, entertainment areas and space for haircuts. \"This kind of space is always what I wanted,\" <mark>Scott</mark> said. \"So we can throw rugby balls and basketballs around and it doesn't break anything .\" Customers were welcome to shoot hoops and video game machines offered further entertainment. The barber's own clothing line was for sale in a small retail space next to a barista coffee bar. JOSEPH JOHNSON/STUFF Benny's Barber Shop has new headquarters. <mark>Scott</mark> built much of the fit out himself, from the bar at the entrance to the office space upstairs, which housed an independent filmmaker, a graphic designer and Canterbury's Red Bull distributor. Ad Feedback \"It was just a flat floor up there when we got the place, so I built the office, the desks and everything else,\" he said. The building itself was refurbished by Box 112, the Christchurch property developers behind the reopening of the Caffe Roma building, several industrial spaces on Welles St and numerous other developments. Junk & Disorderly has taken up space next door to Benny's in the Orbell St warehouse. <mark>Scott</mark> started the business about four years ago after a rugby injury forced him to give up a building apprenticeship. He was already cutting his mates' hair and decided to hone his skills at barber school in Auckland. Using his building skills, <mark>Scott</mark> fitted out a campervan and operated from his parents' Burnside property. He built a following, helped in no small way by slick haircuts for All Blacks and other rugby stars, photos of which were posted to social media. \"That first year for me was stupid hours really, like, 8am till 10pm. I just kept going,\" he said. The business has since expanded. Now 3 years old, the company employs 12 staff and operates a space in Hallensteins' Christchurch store. Another is opening in the Wellington store, on Lambton Quay, in July. \"If that goes well they want to look at Auckland too, so that's a big move, but definitely exciting .\" I'm hoping it continues to expand really, so we'll open this and rip into that, start a second clothing line, do some more marketing and potentially tap into some hair product ranges, \"he said. - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Business story: Lincoln: From mill town to boom town The Press Homepage Comments", "articleID": "2018050603_00162144_W", "names": {"Ben Scott": ["Q15078073", "Q27839151", "Q4886426", "Q4886429"]}}, {"date": "2018-05-08", "url": "http://www.digitaljournal.com/news/world/scandal-protesting-stars-and-bans-as-cannes-festival-opens/article/521616", "content": "Scandal, protesting stars and bans as Cannes festival opens Listen | Print By Fiachra GIBBONS (AFP) 5 mins ago in World The most political Cannes film festival in years opens Tuesday with female stars vowing to protest on the red carpet, two top directors barred from attending and bans hanging over other movies. With the industry still reeling from the Harvey Weinstein scandal, and Cannes under fire for its dearth of women directors, Cate Blanchett and Kristen Stewart are likely to join actresses and women directors Saturday in a protest in support of the #MeToo and Time's Up movements. The new \"Star Wars\" spin-off, \"Solo\" , is the only Hollywood blockbuster in a slightly less starry line-up than usual. But with no less than a dozen films with LGBT themes, and others tackling child abuse, male prostitution and an eye-watering DIY sex change, it has all the makings of a vintage year for scandal and controversy. A new documentary about the tragic singer Whitney Houston by Oscar winner <mark>Kevin Macdonald</mark> reportedly includes a devastating revelation about the demons that dogged her short life. \"Black Panther\" director Ryan Coogler--whose film is breaking box office records--is also likely to tackle the lack of black faces in Hollywood in a Cannes masterclass. - Lesbian film banned - Australian actress Cate Blanchett heads this year's Cannes jury Alberto PIZZOLI, AFP With Monty Python's Terry Gilliam fighting in the French courts to have his disaster-plagued \"The Man Who Killed Don Quixote\" shown, the first Kenyan movie to be selected for the world's top festival has already been banned in its homeland for daring to depict a lesbian romance. Despite a plea by US director Oliver Stone, Tehran has refused to lift a travel ban on Iranian master Jafar Panahi, whose \"Three Faces\" is in the running for the top Palme d'Or prize. The dissident director made it clandestinely after being banned from making films for 20 years for his activism after the \"stolen election\" of 2009. Appeals to bail Russia's Kirill Serebrennikov, under house arrest in Moscow on embezzlement charges his supporters claim are political, have also fallen on deaf ears. Festival director Thierry Fremaux told reporters Monday that it was ironic that both Iran and Russia should be \"punishing the directors when neither film is political\". Serious doubts also hang over whether Gilliam's Pythonesque movie will be allowed to close the festival after it became embroiled in a bitter legal battle over who owns the rights. Judges in Paris will decide Wednesday whether the film, which Gilliam has laboured on for nearly two decades, can be shown. - \"Problem with women' - But it is Cannes'\" dismal \"record on female directors, and Saturday's red carpet protest led by A-list stars, which may generate the most political heat. Long before Weinstein had been accused of attacking four women at the festival, Cannes had been under fire for a\" problem with women \". Women have been stopped on the red carpet in previous years for not wearing high heels, and its dress code has been condemned as sexist. But the Weinstein scandal has given its critics further ammunition, with screenwriter <mark>Kate Muir</mark> of Women and Hollywood lacerating the festival as\" a two-week celebration of male brains and female beauty \". The 71st Cannes film festival Simon MALFATTO, AFP The fact that only three out of 21 directors in the running for the top prize are women--the same number as last year--has also rankled. While admitting that Cannes\" will never be the same again \"after the Weinstein scandal, Fremaux said he was against quotas. Instead he put Hollywood star Blanchett--one of the first to call out Weinstein--at the head a majority-female jury alongside another of Weinstein's victims, French\" Bond \"actress Lea Seydoux. But Fremaux's surprise decision to lift the festival's seven-year ban on Danish director Lars von Trier has stoked feminist ire. The ageing provocateur has been accused of sexual harassment by the singer Bjork, and his production company has been hit by multiple similar claims. Von Trier sparked outrage during a 2011 Cannes press conference by saying that he was a Nazi who understood Hitler and sympathised\" with him a little bit \". But Michel Hazanavicius, the Oscar-winning director of\" The Artist \", who is on the festival's board, insisted von Trier was joking, while Fremaux said Monday that the Dane was not an anti-Semite. Pointedly, however, he has not risked giving von Trier a press conference this time for his new serial killer flick,\" The House That Jack Built \"with Uma Thurman and <mark>Matt Dillon</mark>. Hazanavicius said the veteran Swiss-French director <mark>Jean-Luc Godard</mark>, whose latest film is also at Cannes, has also said\" much worse things than Lars von Trier on this very same topic \". But that\" doesn't mean we have to condemn them \"as artists, he added. The festival runs for two weeks and is considered the world's most prestigious film awards LOIC VENANCE, AFP\" It's very difficult for people to accept the idea that you can be a jerk in your personal life and a great artist. \"", "articleID": "2018050801_00146971_W", "names": {"Jean-Luc Godard": ["Q3167159", "Q53001"], "Kate Muir": ["Q58403926", "Q6375675"], "Kevin Macdonald": ["Q1344373", "Q52018728", "Q614111", "Q6396823"], "Matt Dillon": ["Q193070", "Q6788561", "Q93062"]}}, {"date": "2018-05-14", "url": "http://www.fox46charlotte.com/home/getting-results/memorial-honors-us-army-soliders-father-buried-on-family-farm", "content": "Image Gallery 2 PHOTOS MONROE, NC (FOX 46 WJZY) - A young military couple in Monroe was honored for their service this weekend. Purple Heart Homes created a memorial for the woman's dad who served in the Special Forces. \"He was totally supportive of me joining the military,\" Leah Schumacher said. Schumacher joined the U.S. Army when she was 22. Her dad was Special Forces and served in Vietnam. \"I had heard stories about him being a Green Berets, but I didn't really fully grasp the gravity of that,\" Schumacher said. Their bond as father and daughter strengthened as fellow soldiers. Leah deployed to Iraq in 2003. \"I called my father from Germany. Of course I was sobbing. He said,\" Sweet girl, the Lord is going to protect you in Iraq just like he protected me in Vietnam .' And he was right, \"Schumacher said. She's the first woman in her family to join the military .\" Being the first in your family to do something I think is already pretty special. Then being the first female in your family to serve your country is pretty special as well, \"Schumacher said. Fast-forward a few years, Leah met her husband Jason, also an Army veteran. They have two little boys Gavin and Bryce and live in Monroe where Leah grew up .\" I lived here for 22 years before I joined the Army. I joined the Army in 2003. When I got out and after my husband and I both met, my parents vacated the property and we moved in. It's been a huge blessing to live where I grew up. \"Her childhood home needed some time, love, and care. These people had the time, love, and care to give .\" It's important to give back to these families and make an impact on their lives, \"<mark>Rebecca Smith</mark> said. <mark>Smith</mark> is giving back through a charity called Purple Heart Homes. Many of the people helping paint, plant, and weed are colleagues from MSC Industrial Supplies in Davidson. Her job is special. Leah explains .\" March 31st of last year, my father passed away from Agent Orange-related diabetes. He died unexpectedly. One of his final wishes is that he be buried here on our property, \"Schumacher said. <mark>Rebecca</mark> and her colleagues created a space that honors both Leah and her father William C. Sganga .\" He received a Purple Heart and a Bronze Star Metal for Valor for saving other people's lives on the battlefield, \"Schumacher said. <mark>Rebecca</mark>'s dad also died from an Agent Orange related illness. He was a Marine .\" My father was a Vietnam vet and that is dear to my heart. To be able to work on the grave-site was very endearing, \"she said. At the end of the day, everyone took a tour of their handiwork. Leah's husband Jason thanked Purple Heart Homes and MSC. Jason was injured in Iraq so even small tasks, he says, are a big help .\" A lot of it may have seemed small jobs or whatever. It's a tremendous help to us. It all adds up. Even pulling weeds wears me out on a normal basis. Don't think you didn't make a big difference today. In my mind you sure did, \"Jason said. A big difference that honored these two young veterans and the man who inspired Leah to serve her country .\" This is so awesome you all. This is so awesome, \"Leah said .\" Your dad would be proud, \"Jason said .\" He would. He would be very proud, \"Leah said. They placed two American flags next to the Green Berets' headstone.", "articleID": "2018051419_00156316_W", "names": {"Rebecca Smith": ["Q30907428", "Q39072694", "Q43525202", "Q440719", "Q45729447", "Q47452564", "Q7301927"]}}, {"date": "2018-05-15", "url": "http://www.sun-sentinel.com/news/obituaries/ct-tom-wolfe-dead-20180515-story.html#nt=oft12aH-1li3", "content": "Author <mark>Tom Wolfe</mark>, who chronicled everything from hippies to the space race before turning his sharp eye to fiction, has died. He was 87. <mark>Wolfe</mark>'s agent Lynn Nesbit told The Associated Press that <mark>Wolfe</mark> died in a New York City hospital. Additional details were not immediately available. The \"new journalism\" reporter and novelist insisted that the only way to tell a great story was to go out and report it. His writing style was rife with exclamation points, italics and improbable words. Among his acclaimed books were \"The Right Stuff\" and \"The Bonfire of the Vanities,\" a satire of Manhattan-style power and justice that became one of the best-selling books of the '80s. Check out the latest movie reviews from <mark>Michael Phillips</mark> and the Chicago Tribune.", "articleID": "2018051515_00132096_W", "names": {"Michael Phillips": ["Q1928892", "Q1928904", "Q2352024", "Q40912762", "Q4354599", "Q59203552", "Q6833535", "Q6833536", "Q6833537", "Q6833538", "Q6833539"]}}]