[{"date": "2018-05-15", "url": "http://www.sun-sentinel.com/news/obituaries/ct-tom-wolfe-dead-20180515-story.html#nt=oft12aH-1li3", "content": "Author <mark>Tom Wolfe</mark>, who chronicled everything from hippies to the space race before turning his sharp eye to fiction, has died. He was 87. <mark>Wolfe</mark>'s agent Lynn Nesbit told The Associated Press that <mark>Wolfe</mark> died in a New York City hospital. Additional details were not immediately available. The \"new journalism\" reporter and novelist insisted that the only way to tell a great story was to go out and report it. His writing style was rife with exclamation points, italics and improbable words. Among his acclaimed books were \"The Right Stuff\" and \"The Bonfire of the Vanities,\" a satire of Manhattan-style power and justice that became one of the best-selling books of the '80s. Check out the latest movie reviews from <mark>Michael Phillips</mark> and the Chicago Tribune.", "articleID": "2018051515_00132096_W", "names": {"Tom Wolfe": ["Q216195", "Q7818092"]}}, {"date": "2018-05-16", "url": "https://www.coventrytelegraph.net/news/uk-world-news/north-korea-threatens-trump-14664240", "content": "News North Korea threatens to cancel US summit with Donald Trump It is still unclear, however, whether the North intends to scuttle all diplomacy or merely wants to gain leverage Share Comments By James Rodger Advanced Content Writer 11:20, 16 MAY 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email North Korea has threatened to scrap a historic summit next month between US president Donald Trump and North Korean leader <mark>Kim Jong Un</mark> over military exercises between Seoul and Washington. The surprise declaration, which came in a pre-dawn dispatch in North Korea's state media, appears to cool what had been an unusual flurry of outreach from a country that last year conducted a provocative series of weapons tests that had many fearing the region was on the edge of war. It is still unclear, however, whether the North intends to scuttle all diplomacy or merely wants to gain leverage ahead of the planned June 12 talks between Mr <mark>Kim</mark> and Mr Trump. Meanwhile, Pyongyang cancelled a high-level meeting with South Korea. The two Koreas were due to meet at a border village to discuss how to implement their leaders' recent agreements to reduce military tensions along their heavily fortified border and improve their overall ties. The North's Korean Central News Agency called the two-week Max Thunder drills, which began on Monday and reportedly include about 100 aircraft, an \"intended military provocation\" and an \"apparent challenge\" to an April summit between Mr <mark>Kim</mark> and South Korean president Moon Jae-in, when the leaders met on their border in their countries' third-ever summit talks since their 1948 division. \"The United States must carefully contemplate the fate of the planned North Korea-US summit amid the provocative military ruckus that it is causing with South Korean authorities,\" the North said on Wednesday. \"We'll keenly monitor how the United States and South Korean authorities will react .\" Annual military drills between Washington and Seoul have long been a major source of contention between the Koreas, and analysts have wondered whether their continuation would hurt the detente that, since an outreach by Mr <mark>Kim</mark> in January, has replaced the insults and threats of war. Earlier--and much larger--springtime drills, which Washington and Seoul toned down, went off without the North's typically fiery condemnation or accompanying weapons tests. In Washington, the US State Department emphasised that Mr <mark>Kim</mark> had previously indicated he understood the need and purpose of the US continuing its long-planned exercises with South Korea. Read More Donald Trump confirms US is pulling out of Iran nuclear deal State Department spokeswoman Heather Nauert said the US had not heard anything directly from Pyongyang or Seoul that would change that. \"We will continue to go ahead and plan the meeting between President Trump and <mark>Kim Jong Un</mark>,\" Ms Nauert said. Army Colonel Rob Manning said this current exercise is part of the US and South Korea's \"routine, annual training program to maintain a foundation of military readiness\". Col Manning, a Pentagon spokesman, said the purpose of Max Thunder and exercise Foal Eagle--another training event--is to enhance the two nations' abilities to operate together to defend South Korea. \"The defensive nature of these combined exercises has been clear for many decades and has not changed,\" said Col Manning. Washington and Seoul delayed an earlier round of drills in the spring because of the North-South diplomacy surrounding February's Pyeongchang Winter Olympics in the South, which saw Mr <mark>Kim</mark> send his sister to the opening ceremonies. Mr <mark>Kim</mark> told visiting South Korean officials in March that he \"understands\" the drills would take place and expressed hope that they will be modified once the situation on the peninsula stabilises, according to the South Korean government. Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now South Korea did not immediately make any official response to the North's announcement. The North's statement on Wednesday comes amid a slew of surprising moves from the North in recent weeks. On Tuesday, South Korea's military said North Korea was moving ahead with plans to close its nuclear test site next week, an assessment backed by US researchers who say satellite images show the North has begun dismantling facilities at the site. The site's closure was set to come before the Kim-Trump summit, which had been shaping up as a crucial moment in the decades-long push to resolve the nuclear standoff with the North, which is closing in on the ability to viably target the mainland United States with its long-range nuclear-armed missiles. Despite the North's moves, some experts were sceptical about whether Mr <mark>Kim</mark> would completely give up a nuclear programme that he had pushed so hard to build. Mr <mark>Kim</mark> has expressed his intention to negotiate over his weapons, but he still uses a long-contentious term, \"the denuclearisation of the Korean Peninsula\". The North previously has used this phrase when demanding that the United States pull its 28,500 troops out of South Korea and withdraw its so-called \"nuclear umbrella\" security guarantee to South Korea and Japan as a condition for its nuclear disarmament. Wednesday's threat could also be targeted at showing a domestic audience that Mr <mark>Kim</mark> is willing to stand up to Washington. Mr <mark>Kim</mark> has repeatedly told his people that his nukes are a \"powerful treasured sword\" that can smash US hostility. North Korea also has a long history of launching provocations or scrapping deals with Seoul and Washington at the last minute. In 2013, North Korea abruptly cancelled reunions for families separated by the 1950-53 Korean War just days before they were held to protest what it called rising animosities ahead of joint drills between Seoul and Washington. A year earlier in 2012, the North conducted a prohibited long-range rocket launch weeks after it agreed to suspend weapons tests in return for food assistance. Download our all-new mobile app to get the latest news, sport and what's on. Click here for iPhone and here for Android Looking for an older story? Search our archives Search for jobs, motors and property, or place an advert or family notice here. Like us on Facebook Follow us on Twitter Daily Newsletter coventrytelegraph Follow @ live_coventry Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Donald Trump North Korea", "articleID": "2018051614_00089037_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2018-05-18", "url": "http://overtheinvisiblewallblog.wordpress.com/2018/05/18/racial-inequality-william-blake-and-a-biblical-perspective/", "content": "This post is adapted from an essay I wrote for a Liberty University English class. In 1789, eighteen years before slavery was abolished in Great Britain, <mark>William Blake</mark> published the poetry collection Songs of Innocence, among which is the poem \"Little Black Boy .\" <mark>Blake</mark> condemned slavery, which was evidence of the rampant racial inequality of his time (\"<mark>Blake</mark> and Wordsworth\" ). Interestingly, the same year that <mark>Blake</mark> published Songs of Innocence, the French stormed the Bastille, and the ideology of freedom initially upheld by the French revolutionaries was reflected in the goals of abolitionists, both American and British. Other materials were published that year, such as a description of a slave trade ship, a report on the slave trade, a speech about slavery by <mark>William</mark> Wilberforce in the House of Commons, and a former slave by the name of Olaudah Equiano published one of the first books by a black author (Wikipedia). Attitudes about race were changing for the better, leading to increased equality. In the 1960s, as in the US, there was more progress made towards racial equality. The UK passed the Race Relations Act in 1965, which was the first legislation addressing racial discrimination; in 1976 they passed new legislation with the same name, making racial discrimination illegal (EqualityHumanRights.com). <mark>William Blake</mark>'s poem \"The Little Black Boy\" uses racial imagery to convey spiritual truth and oppose the slave trade. The poem is as follows: My mother bore me in the southern wild, And I am black, but O! my soul is white; White as an angel is the English child: But I am black as if bereav'd of light. My mother taught me underneath a tree And sitting down before the heat of day, She took me on her lap and kissed me, And pointing to the east began to say. Look on the rising sun: there God does live And gives his light, and gives his heat away. And flowers and trees and beasts and men receive Comfort in morning joy in the noonday. And we are put on earth a little space, That we may learn to bear the beams of love, And these black bodies and this sun-burnt face Is but a cloud, and like a shady grove. For when our souls have learn'd the heat to bear The cloud will vanish we shall hear his voice. Saying: come out from the grove my love & care, And round my golden tent like lambs rejoice. Thus did my mother say and kissed me, And thus I say to little English boy. When I from black and he from white cloud free, And round the tent of God like lambs we joy: I'll shade him from the heat till he can bear, To lean in joy upon our fathers knee. And then I'll stand and stroke his silver hair, And be like him and he will then love me. In this poem <mark>Blake</mark> writes from the perspective of a black slave boy in the southern U.S. to promote a biblical view of blacks as equal to whites. In line two, <mark>Blake</mark> states that the boy has a soul, despite the popular belief at the time that black people do not have souls (\"<mark>Blake</mark> and Wordsworth\" ). For slave owners, claiming that black people did not have souls served as a justification of their owning slaves and treating them like animals, who are also believed to lack souls. American and British slave owners who believed the Bible is God's word might have defended slavery by proof-texting a passage such as Ephesians 6:5, which tells slaves to obey their masters. Ephesians 6:5 defends slavery only if the literary and historical context is ignored; slaves in biblical times were often repaying a debt and were freed after their debt had been paid, unless they chose to remain the master's slave. <mark>Blake</mark> insinuates throughout the poem that all people, regardless of skin color, are equal in their relationship to God (lines 3, 9-14, 17-20, 22-28). This is a biblical idea; as Galatians 3:28 (NIV) says, \"There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus .\" The black boy compares an English child to an angel because of his white skin, viewing himself as \"bereav'd of light\" (lines 3-4). It had been made clear to blacks that they were inferior to whites; it was ingrained in the culture and in their minds that they were lesser than whites, even when they were striving for equality. The culture, in this case, was wrong; all people are equal, because all are created in God's image (Genesis 1:27). All people are the same in a fundamental aspect, making them all equal. Equality in God's sight is <mark>Blake</mark>'s focus in \"Little Black Boy,\" though equality and fair treatment from whites was also important considering blacks were slaves, both in Britain and America. In lines thirteen and fourteen, the black slave boy relates what his mother taught him: \"And we are put on earth a little space, / That we may learn to bear the [sun] beams of love .\" The sun seems to symbolize the trials men face on earth. This is reminiscent of James 1:2 -4, which says, \"Consider it pure joy, my brothers, whenever you face trials of many kinds, because you know that the testing of your faith develops perseverance. Perseverance must finish its work so that you may be mature and complete, not lacking anything\" (NIV). It seems from the black boy's hope that the English boy will one day love him that <mark>Blake</mark> saw a future day when whites would realize they were not superior to other races and equality would be gained. At the very least, the final lines emphasize that all of God's children are equal in His sight, or, as a popular phrase among Christians puts it, \"the ground is level at the cross .\" <mark>William Blake</mark> masterfully used racial imagery to teach his contemporaries about equality in Christ. It was surely not a popular message for slave owning Brits or Americans at the time, but it is a biblical one. The poem decries the prejudice inherent to racism and the slave trade and points readers to Christ. It was vital to the abolitionist movement that blacks be viewed and treated as equal to whites, and <mark>Blake</mark> communicated this well in \"Little Black Boy .\" Of course, racial equality did not stop there, and freedom for slaves was only the first step. A lot of progress has been made. Today on the internet there is an upsurge of racism, not towards \"people of color,\" generally, but towards whites. While some say things about \"reverse racism isn't real\" or similar things, racism is any prejudice against someone because of their skin color or race. All people should be viewed as equal insofar as they are human regardless of race. References Equality Human Rights. \"A History of Human Rights in Britain .\" https: //www.equalityhumanrights.com/en/what-are-human-rights/history-human-rights-britain Liberty University. \"<mark>Blake</mark> and Wordsworth .\" (Video presentation .) Liberty University. \"Historical Context and Wollstonecraft .\" (Video presentation .) Wikipedia. \"1789 in Great Britain .\" https: //en.wikipedia.org/wiki/1789_in_Great_Britain <mark>William Blake</mark>. Songs of Innocence, \"Little Black Boy .\" https: //www.poetryfoundation.org/poems/43671/the-little-black-boy Advertisements Like this: Like Loading ...", "articleID": "2018051821_00157116_W", "names": {"William Blake": ["Q19423981", "Q53765056"]}}, {"date": "2018-05-21", "url": "https://www.mirror.co.uk/tv/tv-news/eastenders-pushed-back-coronation-street-12573725", "content": "TV EastEnders pushed back and Coronation Street airs hour-long special in major schedule changes for NHS Heroes Awards Guests including Dame Shirley Bassey and Louis Tomlinson attended the annual event brought to you by ITV and the Mirror Share Comments By Kyle O'Sullivan 17:39, 21 MAY 2018 Updated 17:44, 21 MAY 2018 TV Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get soaps updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email The soap schedule has been drastically changed tonight for a very important reason. The NHS Heroes Awards, which took place last week to praise the stars of our health service, air on ITV at 8.30 pm tonight. Paul O’Grady hosts as Prince William, the Duchess of Cornwall and showbiz favourites including <mark>Elton John</mark>, Shirley Bassey and Louis Tomlinson lead tributes to winners who go that extra mile. This means that Coronation Street will air a special hour-long episode at 7.30 pm rather than the usual double-bill. To avoid a clash, EastEnders will be shown on BBC One at the slightly later time of 8.30 pm, but it will be well worth the wait. The NHS Heroes Awards air tonight on ITV Read More NHS Heroes Awards Winners in full Best dressed Scarlett Moffatt thanks NHS Tribute to Dale Winton A kiss for Camilla Ferne's ready for love Vicky on her wedding plans Joel's disastrous proposal Shakil Kazemi and Keegan Baker will be stabbed in shocking scenes as part of a huge knife crime storyline. The schoolboys will be attacked by a disgusting gang, who take extreme measures after Keegan steals one of their bikes to get home. The dark storyline will so the devastating consequences of knife crime and the heartbreaking aftermath when Shakil tragically dies. Keegan and Shakil will be stabbed on EastEnders tonight (Image: 5710) Shakil will die from his injuries (Image: BBC) Keegan will be taken to hospital after surviving the initial attack, to be treated by fictional versions of the inspiring NHS staff that will be honoured at the NHS Heroes Awards. Stars from Coronation Street, Holby City, Casualty and Call the Midwife took part in the celebration of the awe-inspiring winners at the red carpet bash at the Hilton in London. In a message played at the event, guests heard Prince William say: \"The National Health Service is one of our country's greatest treasures and something we should all be immensely proud of. Louis Tomlinson presents Freya Lewis with the Young Fundraiser Award (Image: Daily Mirror)\" Perhaps the most wonderful thing about the NHS is its people. The skill, care and dedication they provide every day is truly inspirational. \"I would like to pay tribute to every member of NHS staff and the wonderful volunteers who do so much to support them--we owe you all a huge thank you .\" The winners were drawn from the full range of frontline NHS services across the UK, including an inspirational surgeon who saves the lives of knife and gun victims on a daily basis--and saved the first stabbing victim of the London Bridge terror attack. * Coronation Street airs tonight on ITV at 7.30 pm, while EastEnders airs on BBC One at 8.30 pm Like us on Facebook Follow us on Twitter Soaps Newsletter dailymirrortv Follow @ MirrorTV Subscribe to our Soaps newsletter Enter email Subscribe Comments Show more comments More On ITV BBC1 Coronation Street EastEnders NHS Heroes Awards", "articleID": "2018052116_00240105_W", "names": {"Elton John": ["Q16209157", "Q2808"]}}, {"date": "2018-05-23", "url": "https://www.newsletter.co.uk/news/ni-teen-who-died-in-tractor-accident-is-named-locally-1-8508415", "content": "NI teen who died in tractor accident is named locally The incident happened in the Boho Road area of Enniskillen Published: 12:20 Wednesday 23 May 2018 Share this article Sign Up To Our Daily Newsletter Sign up Tributes have been paid to teenager from a well respected family in Co Fermanagh who lost his life in an accident involving a tractor yesterday. Named locally as <mark>Neil Graham</mark>, the 18-year-old was an apprentice mechanic. His father, Edward <mark>Graham</mark>, is involved in the Loyal Orders in the local area. Ulster Unionist MLA <mark>Rosemary Barton</mark> said: \"The family of the man are a very well respected and community orientated family, not only in the Garrison area, but far beyond. The tragic loss of a young life like this is unbearable to contemplate. The pain that the family must be going through is totally unknown to most of us .\" She continued: \"This young man had a great and bright future ahead of him, which has been cut short in heart-breaking circumstances .\" My heart goes out to his parents, and the entire family circle at this terrible time. \"The former Fermanagh and South Tyrone MP <mark>Tom Elliott</mark> said:\" It's a huge tragedy to the family. This is a young 18-year-old and it is almost unthinkable what the family is going through. \"They are a very well respected family in the wider community, not just in that local area. They are known right through the wider Fermanagh area and for something like this to come upon them - I can't bear to think what they are going through .\" The family are very community based and would have great relationships with everyone. They are very well liked, so obviously the communinty will be very upset and will want to come together to support them. \"There is a big family network as well and I am sure that will be a massive support to them, but at this stage they will feel great pain .\" <mark>Neil Graham</mark> is described in a death notice as the \"loving son of Joy and Edward .\" ", "articleID": "2018052311_00111337_W", "names": {"Neil Graham": ["Q30506329", "Q6988647"], "Rosemary Barton": ["Q19955946", "Q24052788"], "Tom Elliott": ["Q16196918", "Q21461424", "Q7815715", "Q8952291"]}}, {"date": "2018-05-23", "url": "http://mysanantonio.com/news/politics/article/The-Latest-Pompeo-says-bad-deal-on-N-Korea-not-12937273.php", "content": "Text \"NEWS' to 77453 for Alerts Officials: Motorcyclist skidded hundreds of feet after I-35 crash S.A.-area race unfolds against unknown Texas Rangers probe https: //www.mysanantonio.com/news/politics/article/The-Latest-Pompeo-says-bad-deal-on-N-Korea-not-12937273.php The Latest: White House team off to Singapore for prep work Updated 1:20 pm, Wednesday, May 23, 2018 window. _ taboola = window. _ taboola | | []; _ taboola. push ({mode:\" thumbnails-c', container: \"taboola-interstitial-gallery-thumbnails-4', placement:\" Interstitial Gallery Thumbnails 4', target_type: \"mix'}); _ taboola. push ({flush: true}); Photo: Evan Vucci, AP Image 1 of / 4 Caption Close Image 1 of 4 President Donald Trump boards Air Force One for a trip to New York to discuss immigration policy, Wednesday, May 23, 2018, in Andrews Air Force Base, Md.. Trump will hold a roundtable discussion on Long Island on illegal immigration and gang violence that the White House is calling a\" national call to action for legislative policy changes. \"less President Donald Trump boards Air Force One for a trip to New York to discuss immigration policy, Wednesday, May 23, 2018, in Andrews Air Force Base, Md.. Trump will hold a roundtable discussion on Long Island...more Photo: Evan Vucci, AP Image 2 of 4 Secretary of State Mike Pompeo looks over his notes as he waits to testify at the House Foreign Affairs Committee hearing on Capitol Hill in Washington, Wednesday, May 23, 2018. Secretary of State Mike Pompeo looks over his notes as he waits to testify at the House Foreign Affairs Committee hearing on Capitol Hill in Washington, Wednesday, May 23, 2018. Photo: <mark>Pablo Martinez</mark> Monsivais, AP Image 3 of 4 Secretary of State Mike Pompeo, center, is greeted by Chairman Rep. Ed Royce, R-Calif ., left, and Ranking Member Rep. Eliot Engel, D-NY ., right, before testifying at the House Foreign Affairs Committee hearing on Capitol Hill in Washington, Wednesday, May 23, 2018. less Secretary of State Mike Pompeo, center, is greeted by Chairman Rep. Ed Royce, R-Calif ., left, and Ranking Member Rep. Eliot Engel, D-NY ., right, before testifying at the House Foreign Affairs Committee hearing...more Photo: <mark>Pablo Martinez</mark> Monsivais, AP Image 4 of 4 The Latest: White House team off to Singapore for prep work 1 / 4 Back to Gallery WASHINGTON (AP)--The Latest on the United States and North Korea (all times local): 2:10 p.m.. A White House team is heading to Singapore this weekend to work on logistics for President Donald Trump's planned summit with North Korean leader <mark>Kim Jong Un</mark> (<mark>kim</mark> jawng oon). Trump cast doubt Tuesday on the future of the June 12 meeting. But a White House spokesman, <mark>Raj Shah</mark>, says the U.S.\" always sends advance teams ahead of any scheduled presidential visit. \"<mark>Shah</mark> says Joe Hagin--the deputy chief of staff for operations--will go to Singapore over the weekend to continue the preparations. ___ Local Channel Now Playing: Now Playing Fatal pedestrian crash on San Pedro Jacob Beltran Woman found with gunshot wound to face San Antonio Express-News 3 armed suspects break into San Antonio home San Antonio Express-News Armed suspect at large after robbing San Antonio IHOP San Antonio Express-News Reporter saves drowning dog Sarah Duran, Courtesy Fatal hit-and-run ends in bystanders shooting at suspect driver Jacob Beltran, Staff Robbery suspect dons disguise in mask, dreadlock wig San Antonio Express-News SAPD: Driver ran over teen who hit his Mercedes with a bat San Antonio Express-News Duo crashes after leading 100 mph motorcycle chase on I-10 San Antonio Express-News 4th suspect accused in drugging, prostitution of teen arrested San Antonio Express-News 12:40 p.m. President Donald Trump says he will know next week whether his planned summit with North Korean leader <mark>Kim Jong Un</mark> is still on, as his administration looks to keep the historic meeting on track. He says:\" We will know next week about Singapore and if we go I think it will be a great thing for North Korea. \"On Tuesday, Trump expressed doubts about the June 12 meeting taking place as scheduled when he hosted South Korean President Moon Jae-in at the White House, amid concerns that the North isn't committed to discussing dismantling its nuclear program. Speaking from the White House before boarding Marine One on Wednesday, Trump said,\" Someday a date will happen, \"for the North Korea talks, adding, and\" It could very well be June 12. \"____ 11:15 a.m. Secretary of State Mike Pompeo says it is ultimately up to North Korean leader <mark>Kim Jong Un</mark> whether a planned summit with President Donald Trump takes place. Pompeo was asked at a congressional hearing if the meeting in Singapore on June 12 will happen or not after Trump said Tuesday\" there's a very substantial chance \"it won't go off as planned. Pompeo said <mark>Kim</mark>\" asked for the meeting, the president agreed to meet with him. I'm very hopeful that meeting will take place. \"He was testifying Wednesday before the House Foreign Affairs Committee. ____ 11 a.m. Secretary of State Mike Pompeo says the Trump administration will walk away from talks with North Korea if the\" right deal \"is not on the table for negotiation. Pompeo told the House Foreign Affairs Committee in prepared testimony on Wednesday that a\" bad deal \"is not an option. He says preparations continue for a planned June 12 summit in Singapore between President Donald Trump and North Korean leader <mark>Kim Jong Un</mark>. Pompeo says previous U.S. administrations had been\" fooled before and we can't permit that to happen again. \"However, based on his own discussions with the North Korean leader, Pompeo said he was hopeful that Trump could convince <mark>Kim</mark> to make a strategic decision to denuclearize. ___ 12:33 a.m.. The United States and South Korea are working to keep the scheduled U.S. summit with North Korea on track--even after President Donald Trump's comment that\" there's a very substantial chance \"it won't go off as planned. Trump and South Korea's leader met in the Oval Office on Tuesday, and President Moon Jae-in says\" the fate and the future of the Korean Peninsula hinge \"on the summit set for June 12 in Singapore. The summit would offer a historic chance for peace. But there also is the risk of a diplomatic failure that would allow the North to revive and advance its nuclear weapons program. Sign up for instant alerts from MySA by texting NEWS to 77453. Most Popular 1 Buc-ee's wins federal court trademark fight against competitor Choke Canyon 2 Photos: KENS-TV anchor weds in Caribbean paradise 3 S.A.'s Instagramable Flower Vault will remain open throughout the summer 4 Lake levels heading into Memorial Day weekend 5 Motorcyclist suffered life-threatening injuries in crash that closed I-35 6 Former cheerleader sues Texans over pay, other issues 7 Former patients of doctor indicted in $240M fraud file notices to sue him 8 S.A. amusement park gets major praise from TV star 9 Affidavit: Former San Antonio nurse stole nearly 1,700 pills from rehab facility 10 People who sleep in on weekends avoid dying young, study suggests 11 Police find stabbing victim in Terrell Hills while en route to burglary call 12 A peek inside one of San Antonio's swankiest Pearl apartments 13 SAPD: Victim shot in neck in NE side neighborhood 14 Valdez wins tight race to become first Latina, first lesbian to win major party nod for governor 15 Woman who met R. Kelly after San Antonio show accuses singer of sexual battery, giving her herpes View Comments © 2018 Hearst Communications, Inc. .", "articleID": "2018052318_00158869_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"], "Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Raj Shah": ["Q1274250", "Q29043436"]}}]