[{"date": "2018-05-22", "url": "http://reddead.wikia.com/wiki/New_Austin?diff=320754&oldid=319614", "content": "Revision as of 11:33, April 10, 2018 (edit) JamesTheNerdKing (wall | contribs) (Capitalizing Word) ← Older edit Latest revision as of 11:59, May 22, 2018 (edit) (undo) KuroUrufu (wall | contribs) m Line 137: Line 137: [[es: New Austin]] [[es: New Austin]] + [[de: New Austin]] + [[fr: New Austin]] + [[it: New Austin]] [[Category: Redemption Locations]] [[Category: Redemption Locations]] [[Category: New Austin | *]] [[Category: New Austin | *]] Latest revision as of 11:59, May 22, 2018 \"New Austin: the last real outlaw country. Where the old ways still hold true .\" --John Marston New Austin is one of three territories in Red Dead Redemption and is also the largest. It is also known as the Frontier. Click to enlarge Contents [show] Description Edit This territory is characterized as a largely rugged and arid wilderness in the process of colonization. As such, there is an expected presence of wild animals and outlaws. The name of the region and its largest town as well as its border location, prominent fort, mines, and oil derricks all show a strong Texas influence. Geography Edit New Austin lies between Nuevo Paraiso to the south, and West Elizabeth to the northeast. It comprises four regions: Cholla Springs, Gaptooth Ridge, Hennigan's Stead, and Río Bravo. The terrain of New Austin resembles aspects of several real Southwestern U.S. states. Cholla Springs resembles Arizona's desert with its saguaro cactus, desert scrub, and prickly pears. The scrub desert of Rio Bravo is strongly reminiscent of New Mexico. Gaptooth Ridge is more like Southern California, Nevada, and western Arizona with its tan rocks and Joshua trees, and Hennigan's Stead resembles the western parts of Kansas, Oklahoma, central Colorado, and the square part of Texas called the Panhandle Plains, with the Eastern end (Stillwater Creek) resembling the United States The South comprising of Texas North Texas, Texas East Texas, and Louisiana. Locations in New Austin Edit The following is an alphabetical list of the 46 locations found in New Austin: Hennigan's Stead Edit Click to enlarge Brittlebrush Trawl Butter Bridge Dixon Crossing Greenhollow MacFarlane's Ranch Manteca Falls Mason's Bridge Mescalero Montana Ford The Old Bacchus Place Pike's Basin Stillwater Creek Tanner's Span Thieves' Landing Warthington Ranch Cholla Springs Edit Click to enlarge Armadillo Coot's Chapel Critchley's Ranch Hamlin's Passing The Hanging Rock Jorge's Gap Lake Don Julio Mercer Station Odd Fellow's Rest Pleasance House Rattlesnake Hollow Ridgewood Farm Río del Lobo Riley's Charge Twin Rocks Two Crows Venter's Place Gaptooth Ridge Edit Click to enlarge Cueva Seca Gaptooth Breach Rathskeller Fork The Scratching Post Silent Stead Solomon's Folly Tumbleweed Río Bravo Edit Click to enlarge Benedict Pass Benedict Point Del Lobo Rock Fort Mercer Frontera Bridge Plainview Repentance Rock Achievements/Trophies Edit The discovery of locations in New Austin counts towards the following Trophies/Achievements: ON THE TRAIL OF DE VACA 10 gamerscore Bronze bronze Uncover every location on the map in Single Player. AUSTIN OVERPOWERED 25 gamerscore Silver silver Complete Twin Rocks, Pike's Basin, and Gaptooth Breach hideouts in Single Player. INSTINTO ASESINO 25 gamerscore Silver silver Complete Fort Mercer and Nosalida hideouts in singleplayer. EVIL SPIRITS 25 gamerscore Silver silver Complete Tumbleweed and Tesoro Azul hideouts in singleplayer. REDEEMED 100 gamerscore Gold gold Attain 100% List in the singleplayer game completion list. Trivia Edit People in MacFarlane's Ranch and in Armadillo will mention Governor Nate Johns, suggesting that New Austin and West Elizabeth are located in the same territory; this is further evidenced by the lack of any government building in New Austin, but there are a few in West Elizabeth. The railroad tunnel between Hennigan's Stead and Cholla Springs and the snow capped canyon in north Hennigan's Stead are some of the few places in the game where the player is, technically, off the map. MacFarlane's Ranch is the largest settlement in the region, despite its status as a privately owned ranch. The racing track in Gaptooth Ridge is the westernmost point in the game. As with the boundary between New Austin and West Elizabeth, the transition of the music when the player moves between New Austin and Nuevo Paraiso can take some time to register. External Links Edit Map of New Austin at the Official Red Dead Redemption Site Related Content Edit v • d • e Related Content for New Austin Wiki Content Blog posts Forum posts Images External Content Google • Images YouTube videos Rockstar site Wikipedia The links above will perform a search for the content that matches this page's name. v • d • e Locations in Red Dead Redemption New Austin Armadillo • Benedict Pass • Benedict Point • Brittlebrush Trawl • Butter Bridge • Cholla Springs • Coot's Chapel • Critchley's Ranch • Cueva Seca • Del Lobo Rock • Dixon Crossing • Fort Mercer • Frontera Bridge • Gaptooth Breach • Gaptooth Ridge • Greenhollow • Hamlin's Passing • Hanging Rock • Hennigan's Stead • Jorge's Gap • Lake Don Julio • MacFarlane's Ranch • Manteca Falls • Mason's Bridge • Mercer Station • Mescalero • Odd Fellow's Rest • Old Bacchus Place • Pike's Basin • Plainview • Pleasance House • Rathskeller Fork • Rattlesnake Hollow • Repentance Rock (Mystery Site) • Ridgewood Farm • Riley's Charge • Río Bravo • Rio del Lobo • Scratching Post • Silent Stead • Solomon's Folly • Stillwater Creek • Tanner's Span • Thieves' Landing • Tumbleweed • Twin Rocks • Two Crows • Venter's Place • Warthington Ranch Nuevo Paraiso Agave Viejo • Alta Cabeza • Barranca • Campo Mirada • Casa Madrugada • Chuparosa • Crooked Toes • Diez Coronas • El Matadero • El Presidio • Escalera • Hendidura Grande • Laguna Borrego • Las Hermanas • Mesa de la Luna • Mesa del Sol • Nosalida • Ojo del Diablo • Perdido • Plata Grande • Primera Quebrada • Puerto Cuchillo • Punta Orgullo • Ramita de la Baya • Rancho Polvo • Rio del Toro • Roca de Madera • Sepulcro • Sidewinder Gulch • Tesoro Azul • Torquemada West Elizabeth Aurora Basin • Bearclaw Camp • Beecher's Hope • Blackwater • Broken Tree • Cochinay • Great Plains • Manzanita Post • Montana Ford • Nekoti Rock • Pacific Union Railroad Camp • Tall Trees • Tanner's Reach • Wreck of the Serendipity Border regions Butter Bridge • Dixon Crossing • Flat Iron Lake • Frontera Bridge • Manteca Falls • Mason's Bridge • Montana Ford • Redemption Mountains • San Luis River • Sea of Coronado • Tanner's Span Category: Redemption Locations • Category: Locations v • d • e 100% Completion 94 Map Locations Discovered | 57 Main Story Missions Completed 20 Bounty Locations Completed | 18 Stranger Side-missions Completed 13 Safehouses Obtained | 9 Outfits Obtained | 7 Gang Hideouts Cleared | 6 Minigames Won 5 Job Locations Completed | 5 Rare Weapons Obtained | 4 Single Player Ambient Challenges Completed v • d • e Red Dead Redemption Characters John Marston (Quotes) • Jack Marston (Quotes) • Abraham Reyes • <mark>Edgar Ross</mark> • Bill Williamson • Javier Escuella • Dutch van der Linde • Nigel West Dickens • Bonnie MacFarlane • Category Information Storyline Missions • Weapons • Outfits • Transport • Hunting Gameplay Activities • Hunting (Animals) • Horses (Horse Taming, Horse Breeds) • Gang Hideouts • Dead-Eye Targeting • Random Encounters (Strangers) • Fame • Honor Locations New Austin • Cholla Springs • Rio Bravo • Gaptooth Ridge • Hennigan's Stead • Armadillo • Plainview • Thieves' Landing • Rathskeller Fork • Tumbleweed • Ridgewood Farm • MacFarlane's Ranch • Fort Mercer • Tanner's Span • Mason's Bridge • Pacific Union Railroad Camp • Nuevo Paraiso • Punta Orgullo • Perdido • Diez Coronas • Chuparosa • Escalera • El Presidio • Las Hermanas • Agave Viejo • El Matadero • Torquemada • Casa Madrugada • West Elizabeth • Tall Trees • Great Plains • Nekoti Rock • Blackwater • Manzanita Post • Cochinay Challenges Sharpshooter • Survivalist • Master Hunter • Treasure Hunter • Tomahawk Master • Master Exploder Others 100% Completion • Achievements • Cheats • Multiplayer DLC Outlaws to the End • Legends and Killers • Liars and Cheats • Undead Nightmare • Hunting and Trading Outfits • Deadly Assassin Outfit • War Horse • Golden Guns Hunting Armadillo • Beaver • Bighorn Sheep • Boar • Bobcat • Buck • Buffalo • Cattle • Chicken • Coyote • Cougar • Crow • Deer • Dog • Duck • Eagle • Elk • Fox • Goat • Bear • Hawk • Horse • Mule • Owl • Pig • Rabbit • Raccoon • Rattlesnake • Seagull • Songbird • Sheep • Skunk • Vulture • Wolf • Brumas the Bear • Lobo the Wolf • Gordo the Boar • Khan the Jaguar • Wilbur the Boar • Demi the Cougar • Keifer the Wolf • Roberto the Bobcat • Jackalope The Man from Blackwater • Portal • Soundtrack • Infobox • Category: Red Dead Redemption Retrieved from \"http: //reddead.wikia.com/wiki/New_Austin? oldid=320754\" Categories: Redemption Locations New Austin Languages: Deutsch Español Français Italiano", "articleID": "2018052419_00191077_W", "names": {"Edgar Ross": ["Q3047487", "Q5337445"]}}, {"date": "2018-05-21", "url": "https://www.livetradingnews.com/white-house-sets-up-investigation-into-election-spying-by-fbi-88752.html", "content": "White House Sets Up Investigation Into Election Spying by FBI The White House announced Monday that US President Donald Trump's Chief of Staff <mark>John Kelly</mark> plans to \"immediately set up a meeting\" with congressional leaders and the FBI, Justice Department and Director of National Intelligence to review \"highly classified and other information they have requested\" [...] The post White House Sets Up Investigation Into Election Spying by FBI appeared first on Live Trading News.", "articleID": "2018052420_01136230_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}}, {"date": "2018-05-25", "url": "http://www.channel3000.com/news/world-news/15-injured-in-explosion-at-restaurant-near-toronto/746001040", "content": "15 injured in explosion at restaurant near Toronto No information on any incendiary devices By: ARTEMIS MOSHTAGHIAN AND NICOLE CHAVEZ, CNN Posted: May 25, 2018 12:11 AM CDT Updated: May 25, 2018 12:14 AM CDT 6 officers injured in Conn. explosion during domestic incident (CNN) - At least 15 people were wounded Thursday night in an explosion at a restaurant in Mississauga, Ontario, police said. The explosion was reported about 10:30 p.m. at Bombay Bhel Indian restaurant in the Toronto suburb of Mississauga, Peel Regional Police Constable Iryna Yashnyk said. Among those injured, three people suffered critical injuries and were taken to a Toronto trauma center, officials said. Their injuries were \"consistent with those of an explosion,\" said <mark>Brian Gibson</mark>, deputy chief at Peel Regional Paramedic Services. There was no information on any incendiary devices being found at the restaurant, Yashnyk said. Copyright 2018 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Local And Regional News", "articleID": "2018052505_00156528_W", "names": {"Brian Gibson": ["Q2924895", "Q4963837", "Q4963838"]}}, {"date": "2018-05-26", "url": "http://www2.ljworld.com/news/2018/may/26/kansas-fades-long-hot-day-ncaa-golf-championships/", "content": "By <mark>Tom Keegan</mark> Twitter: @ TomKeeganLJW Stillwater, Okla.--Even at the highest level of college golf, not many can pull off what freshman Harry Hillier did to finish his steamy, long day in the sun Saturday at unforgiving Karsten Creek in the NCAA championship. Hillier crushed a drive and stuck a 4-iron to 6 feet on the 575-yard 18th hole, which runs alongside Lake Louise. He made the putt for an eagle. And shot 81. \"Kind of like making a 3 at the buzzer when you're down four, isn't it?\" sixth-year Kansas coach Jamie Bermel said. \"Didn't really matter. That's about the way our day went too .\" Precisely. When the Jayhawks walked off the course, they were in dead last, 21 over par, in the field of 30 schools with a chance of moving up because some schools were just getting started. Friday's rain delay forced KU to play one-and-a-half rounds Saturday. The players started teeing off at 7 a.m. after finishing past 8:30 p.m. Friday. The difficulty of the course, the short turnaround, the searing heat and the enormity of the stage combined to make this not just another Saturday on the golf course for the Jayhawks. So far, KU's two seniors have handled it the best. Daniel Sutton, the team's straightest driver, has shot 71-73 to enter Sunday's round at even par. Daniel Hudson shot 76-72 and is 4 over, battling back from a triple-bogey 7 on his first hole of the tournament, No. 10 on Friday. Sophomore Andy Spencer (72-78) is 6 over. Harry Hillier (76-81) is 13 over, junior Charlie Hillier 82-79) 17 over. After Sunday's round, the field will be trimmed to 15 schools and the eight best of those after Monday will advance to match play. Do you believe in miracles? KU has so much ground left to make up, which in many instances would mean taking more chances is the way to go, but Karsten Creek counterpunches so viciously that might not be wise. \"I just don't know if you can be real aggressive out here because you're going to get punched in the nose if you get overly aggressive,\" Kansas coach Jamie Bermel said. \"The holes where we made big numbers on, a lot of the guys hit 3-woods and couldn't keep it in play. That part of it we just have to get better at. A lot of courses we play you can hit a driver and if it goes wayward you can still find it. Not out here .\" Sutton, who came to KU from Birmingham, England, wants to go out in style. \"For me and Hud, potentially it can be our last round of college golf,\" Sutton said. \"We're going to give it our all .\" Sutton has no ambivalence about the approach with the team so far behind. \"Same as always,\" he said. \"We're going to keep it in the fairway. If the putts start to fall and and a bunch of us start making birdies, you never know what can happen. We just need to stick to the game plan of hitting it in the fairway, post a respectable score and see where that leaves us .\" Kansas is one of seven Big 12 schools competing. Texas Tech (-5), Oklahoma State (-4), Oklahoma (+2), Texas (+4) need to hold their positions in the field to make the first cut. Baylor (+21) is just two strokes ahead of Kansas, and Iowa State, which teed off later than the rest of the Big 12 schools, hovered right around the cut line in the early going of its second round. Hudson did a nice job of capturing what makes Karsten Creek such a difficult challenge to negotiate. \"You can hit good shots off the tee and you have to aim to where the wind's going to push the ball to the fat part of the fairway,\" Hudson said. \"And that's if you're comfortable over the shot. But if you don't feel like you have a consistent flight off the tee, you're standing up there on a hole that's 40 yards wide and if you don't hit it in that 40-yard gap, you're re-teeing .\" KU's second round was marred by four triple-bogeys and two doubles. Copyright 2018 The Lawrence Journal-World. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. We strive to uphold our values for every story published.", "articleID": "2018052623_00281791_W", "names": {"Tom Keegan": ["Q57433677", "Q7816407"]}}, {"date": "2018-05-29", "url": "https://www.dailypost.co.uk/news/north-wales-news/mans-loving-tribute-brother-who-14716020", "content": "News Man's loving tribute to brother who loved this rare vintage van The 1969 Austin van is one of only seven left in the world and once belonged to <mark>David Thomas</mark>, a former English and PE teacher Share Comments By Mari Jones Reporter 10:54, 29 MAY 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email A rare vintage van unexpectedly found neglected in a garage following its owner's death has been lovingly restored by his brother in his memory. The 1969 Austin van is said to be one of only seven left in the world and once belonged to <mark>David Thomas</mark>, a former English and PE teacher known as Dynamite Danny due to his football prowess. After years of teaching in London, he moved back to his hometown of Penycae in Wrexham but became a recluse, according to his brother Terry, a former lecturer in forestry and agriculture economics at Bangor University. Read More In pictures: Llandudno Victorian Extravaganza and Transport Festival Mr Thomas said: \"Everybody loved Danny, as he was known, but I think he expected to find Penycae hadn't changed since he was a boy .\" Obviously, it had and his friends had moved on. \"He lived by himself, sadly became mentally ill, and died when he was 66 from a haemorrhage .\" The Austin van is said to be one of only seven in the world today (Image: UGC TNW) A few weeks later, Mr Thomas received a call from the owner of a lock-up garage in Penycae, who said his brother owed him money. \"I went to the lock-up, not having a clue as to what was inside it, and discovered a 1969 Austin van,\" he said. \"It was in a very bad condition and I decided there and then I was going to restore it in my brother's memory .\" Terry Thomas, pictured on the far left, with his friends from Menai Bridge who helped restore the Austin van (Image: UGC TNW) Mr Thomas, who lives in Menai Bridge in Anglesey, told his story to a group of his friends and they all agreed to help him. \"It's taken us seven years but it has been a labour of love,\" he said. \"It's cost £ 8,000 to restore, and it's probably worth well over £ 20,000 as it's so rare, but I wouldn't dream of selling it .\" Read More <mark>Clint Eastwood</mark>'s £ 150K pink Cadillac that's used as a shopping run-around in Conwy Mr Thomas, who runs the Whistlestop Cafe on Bangor Pier, admits he didn't know what to do with the van once he'd restored it. Terry Thomas superimposed this picture of brother <mark>David</mark> on a snap of the restored Austin van (Image: UGC TNW) He said: \"I asked my wife June:\" What the heck do I do next with it? Do I drive it to <mark>David</mark>'s graveside? \"' His wife suggested they superimpose a photograph of <mark>David</mark> next to the van and put the picture on his gravestone. Read More The vintage Austin 7 with a pedigree pop connection Mr Thomas said:\" My brother was a funny and gentle man, who was a very popular schoolteacher. I think he'd be astounded to know what we've done with his van. \"The plan is to use it to raise money for adult males with mental health problems .\" Share your views about this story using the comment section below. Like us on Facebook Follow us on Twitter Daily Newsletter dailypostwales Follow @ dailypostwales Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Bangor University Anglesey Gwynedd Menai Bridge Wrexham Education", "articleID": "2018052909_00273916_W", "names": {"Clint Eastwood": ["Q2979323", "Q43203"], "David Thomas": ["Q1176834", "Q19325401", "Q19661636", "Q21453115", "Q21996049", "Q2255794", "Q23020660", "Q27909751", "Q29846103", "Q3018873", "Q3703350", "Q40328171", "Q5240342", "Q5240345", "Q5240349", "Q5240351", "Q5240356", "Q5240359", "Q56187784", "Q56596995", "Q57897985"]}}, {"date": "2018-05-29", "url": "http://www.durangoherald.com/articles/225910-serena-williams-wins-in-grand-slam-return-at-french-open", "content": "Serena Williams wins in Grand Slam return at French Open Durango, Colorado Summary: No precipitation throughout the week, with high temperatures rising to 92 ° on Saturday. Currently Weather data from The Durango Herald and darksky.net Tue Partly cloudy in the morning. 12% chance of precipitation Partly cloudy in the morning. 6% chance of precipitation Serena Williams wins in Grand Slam return at French Open Nadal, Sharapova advance By Howard Fendrich AP Tennis Writer Tuesday, May 29, 2018 3:22 PM Serena Williams of the U.S. clenches her fist after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams won 7-6 (4), 6-4. Allessandra Tarantino/Associated Press Serena Williams of the U.S. reacts after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Allessandra Tarantino/Associated Press Krystina Pliskova of the Czech Republic returns a shot against Serena Williams of the U.S. during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Michel Euler/Associated Press Serena Williams of the U.S. serves against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams recorded 13 aces in the match. Michel Euler/Associated Press PARIS--For all that has changed in the 16 months since Serena Williams last played in a Grand Slam tournament--she is now married and a mother--so much was familiar about her at the French Open on Tuesday. The fashion statement, this time in the form of a black bodysuit with a red belt that she said made her feel like a \"warrior princess .\" The cries of \"Come on!\" The big serves that provided 13 aces. The returns that eventually produced three consecutive breaks of serve. And, yes, the victory. Competing as a mom for the first time at a major, and only about nine months since giving birth to her daughter, Alexis Olympia, then dealing with postpartum complications, Williams edged 70th-ranked Kristyna Pliskova of the Czech Republic 7-6 (4), 6-4 at Roland Garros. Already a transcendent sports star and cultural icon, Williams now carries a new title: working mother. \"Well, my priority is Olympia. No matter what, that's my priority. I have given tennis so much, and tennis has actually given me a lot, and I couldn't be more grateful,\" Williams said. \"She's my priority, and I work everything around her .\" The 36-year-old American had not played in one of tennis's biggest tournaments since winning the Australian Open in January 2017 for her 23rd Grand Slam title, breaking a tie with Steffi Graf for the most in the professional era. Williams, the world found out later, was pregnant at the time. Her baby was born Sept. 1; Williams married Reddit co-founder Alexis Ohanian in November. Williams eventually revealed that she had an emergency cesarean section, then encountered trouble breathing afterward because of a pulmonary embolism and needed a follow-up operation. \"Just literally not sure if I was going to make it or not at several different times,\" Williams said. \"A lot of people have really reached out, because they have so many similar stories, too. I feel like a lot of people don't talk about it. They talk about the baby and how happy they are. But it's a lot that goes into it with the pregnancy and with giving birth, and it's called a\" miracle' for a reason. \"The first match of her comeback was in doubles alongside her older sister, Venus, for the U.S. Fed Cup team in February. She entered two tournaments in singles the next month, going 2-2. An absence of more than two months followed, until Tuesday in Paris. So a woman who has spent hundreds of weeks ranked No. 1 is currently No. 451 and unseeded at the French Open, a subject of some debate: Should her past success accord her the protection a seeding offers? Williams faces 17th-seeded Ash Barty of Australia next .\" She's a genuine champion, \"Barty said .\" What she's done to be able to get back...is a pretty amazing thing. \"Tuesday's return was striking, from Williams' powerful shots to her outfit, which called to mind the\" catsuit \"she wore at the 2002 U.S. Open. It was by far the most significant event of Day 3 at Roland Garros, even though there were so many other Grand Slam champions in action. Rafael Nadal finished off a rain-interrupted victory as he begins his try for a record-extending 11th French Open title. Maria Sharapova, a two-time champ in Paris, was pushed to three sets in a win. Garbine Muguruza, who beat Williams in the 2016 final at Roland Garros, beat another past champion, <mark>Svetlana Kuznetsova</mark>. All eyes were on Williams, though. On the fifth point, she delivered an ace at 112 mph. Moments later, the chair umpire intoned,\" Jeu, Madame Williams, \"--French for\" Game, Mrs. Williams, \"a change from the\" Mademoiselle \"used for unmarried female players. Pliskova, a lefty whose twin sister upset Williams in the 2016 U.S. Open semifinals, actually hit more aces, 15. That's the most anyone has hit against Williams since at least 2008, according to the WTA. Indeed, Williams appeared to have trouble reading Pliskova's serves early on. There were other blips, of the sort to be expected from someone who hasn't played lately. Williams double-faulted seven times. She had nearly as many unforced errors, 25, as winners, 29. But she is not simply skilled. She is smart, too, and she figured things out. After trailing 3-0 in the tiebreaker, she reeled off six points in a row. After falling behind 2-0 in the second set, Williams came up with a trio of service breaks. All was not perfect, of course. In the final game, Williams' right foot gave way as she sprinted toward the net and she landed on her backside. At least she was able to laugh at that as she went to the sideline to towel off. A spectator yelled:\" That's all right, Serena! You still look great! \"After months of worrying more about diapers than drop shots, of breastfeeding for what she called\" a really, really, really long time, \"of organizing her practice schedule around her newborn's nap schedule, Williams was back to doing what she's most famous for, in an arena where she earned trophies in 2002, 2013 and 2015. On Tuesday, she noted that she showed up at her news conference more promptly than she used to, so she could have more time to spend with Olympia .\" I don't want her to ever feel like I'm not around. I'm a super hands-on mom, \"Williams said .\" Maybe too much. \"A reporter wanted to know whether Williams believes she can win the title again .\" I'm definitely here to compete and do the best that I can do, obviously. I'm not putting any pressure on myself as I normally do, \"Williams began. Then, perhaps questioning her own words as she heard them, she paused, before adding with a laugh:\" I think deep down, we all know the answer to that. \"Serena Williams wins in Grand Slam return at French Open Serena Williams of the U.S. clenches her fist after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams won 7-6 (4), 6-4. Allessandra Tarantino/Associated Press Serena Williams of the U.S. reacts after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Allessandra Tarantino/Associated Press Krystina Pliskova of the Czech Republic returns a shot against Serena Williams of the U.S. during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Michel Euler/Associated Press Advertisement (1/1) Serena Williams of the U.S. serves against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams recorded 13 aces in the match. Michel Euler/Associated Press", "articleID": "2018052921_00115343_W", "names": {"Svetlana Kuznetsova": ["Q192064", "Q21063641", "Q3978501", "Q4245117"]}}, {"date": "2018-05-29", "url": "https://www.thespec.com/news-story/8638734-fight-over-pipeline-continues-b-c-premier/", "content": "Fight over pipeline continues: B.C. premier | TheSpec.com Fight over pipeline continues: B.C. premier News07:35 PMThe Canadian Press VICTORIA--Premier <mark>John Horgan</mark> says he will continue the fight to protect British Columbia's coast from the consequences of an oil spill regardless of who owns the Trans Mountain pipeline. The federal government's decision to take over the pipeline from Kinder Morgan doesn't change his government's position to oppose the expansion project from Edmonton to Burnaby or its decision last month to pursue a reference case to the B.C. Court of Appeal, <mark>Horgan</mark> said Tuesday. \"I believe we have an obligation to ensure that we are doing everything we can to avoid the catastrophic consequences of a diluted bitumen spill,\" he said. <mark>Horgan</mark> said Ottawa's decision to buy the pipeline does not reduce the risk to B.C.'s environment and economy, which is why the province is asking the court whether it has jurisdiction to protect itself from a spill. The fact the pipeline is about to be owned by a federal Crown corporation doesn't affect the reference case, he added. But the federal government's decision to take over the project puts Ottawa in charge of managing the pipeline, including its risks, <mark>Horgan</mark> said. \"I do believe the federal government now is totally accountable, not just for regulation and approval of a pipeline, but they now are responsible from wellhead to tidewater and beyond,\" he said. \"That allows us now to have more candid discussions with the owners of the pipeline than I would have been able to when they were shareholders in a Texas-based oil company .\" B.C.'s Opposition Liberals said <mark>Horgan</mark> is about to be given the cold shoulder by Prime Minister Justin Trudeau's government. \"This is a bad day for B.C. because <mark>John Horgan</mark> has decided to kick the feds in the shins,\" Liberal Leader <mark>Andrew Wilkinson</mark> said. \"This is a government that is creating investor chaos here in B.C.\" Political experts said relations between B.C. and the federal government and neighbouring Alberta are strained over the ongoing pipeline dispute, but Trudeau's Liberals have the most to lose with the pipeline purchase. The move could backfire politically in B.C., where the federal Liberals hold 14 seats, and globally on the environmental stage because the government has committed to fight climate change but has chosen to buy a pipeline, said Prof. Kathryn Harrison, an expert on federal-provincial relations at the University of British Columbia. \"By repeatedly saying the pipeline will be built, prime minister Trudeau has painted himself into a corner where this was the last and only option,\" she said in an interview. Prof. David Tindall, an expert on climate change politics at UBC, said <mark>Horgan</mark> has gained support in B.C. for his calm and focused approach to the pipeline debate. \"He's really emphasized the issue of trying to avoid oil spills and protecting the coast,\" he said. \"That's one set of environmental issues, I think, that has broad support .\" <mark>Horgan</mark> also gained support by not appearing as an environmental ideologue through his comments that endorse oil refineries over pipelines and his backing of liquefied natural gas projects, said Tindall. The federal decision to buy the pipeline could prompt further legal challenges by Indigenous Peoples, said Prof. Margot Young, a constitutional law and Indigenous legal rights expert at the University of British Columbia's Peter A. Allard School of Law. \"What is clear is that local and Indigenous opposition to the project can only be inflamed by this federal move,\" she said. \"And that opposition is independent of any constitutional decision reached by the courts .\" (Companies in this story: TSX: KML) By <mark>Dirk Meissner</mark>, The Canadian Press Fight over pipeline continues: B.C. premier News07:35 PMThe Canadian Press VICTORIA--Premier <mark>John Horgan</mark> says he will continue the fight to protect British Columbia's coast from the consequences of an oil spill regardless of who owns the Trans Mountain pipeline. The federal government's decision to take over the pipeline from Kinder Morgan doesn't change his government's position to oppose the expansion project from Edmonton to Burnaby or its decision last month to pursue a reference case to the B.C. Court of Appeal, <mark>Horgan</mark> said Tuesday. \"I believe we have an obligation to ensure that we are doing everything we can to avoid the catastrophic consequences of a diluted bitumen spill,\" he said. <mark>Horgan</mark> said Ottawa's decision to buy the pipeline does not reduce the risk to B.C.'s environment and economy, which is why the province is asking the court whether it has jurisdiction to protect itself from a spill. The fact the pipeline is about to be owned by a federal Crown corporation doesn't affect the reference case, he added. But the federal government's decision to take over the project puts Ottawa in charge of managing the pipeline, including its risks, <mark>Horgan</mark> said. \"I do believe the federal government now is totally accountable, not just for regulation and approval of a pipeline, but they now are responsible from wellhead to tidewater and beyond,\" he said. \"That allows us now to have more candid discussions with the owners of the pipeline than I would have been able to when they were shareholders in a Texas-based oil company .\" B.C.'s Opposition Liberals said <mark>Horgan</mark> is about to be given the cold shoulder by Prime Minister Justin Trudeau's government. \"This is a bad day for B.C. because <mark>John Horgan</mark> has decided to kick the feds in the shins,\" Liberal Leader <mark>Andrew Wilkinson</mark> said. \"This is a government that is creating investor chaos here in B.C.\" Political experts said relations between B.C. and the federal government and neighbouring Alberta are strained over the ongoing pipeline dispute, but Trudeau's Liberals have the most to lose with the pipeline purchase. The move could backfire politically in B.C., where the federal Liberals hold 14 seats, and globally on the environmental stage because the government has committed to fight climate change but has chosen to buy a pipeline, said Prof. Kathryn Harrison, an expert on federal-provincial relations at the University of British Columbia. \"By repeatedly saying the pipeline will be built, prime minister Trudeau has painted himself into a corner where this was the last and only option,\" she said in an interview. Prof. David Tindall, an expert on climate change politics at UBC, said <mark>Horgan</mark> has gained support in B.C. for his calm and focused approach to the pipeline debate. \"He's really emphasized the issue of trying to avoid oil spills and protecting the coast,\" he said. \"That's one set of environmental issues, I think, that has broad support .\" <mark>Horgan</mark> also gained support by not appearing as an environmental ideologue through his comments that endorse oil refineries over pipelines and his backing of liquefied natural gas projects, said Tindall. The federal decision to buy the pipeline could prompt further legal challenges by Indigenous Peoples, said Prof. Margot Young, a constitutional law and Indigenous legal rights expert at the University of British Columbia's Peter A. Allard School of Law. \"What is clear is that local and Indigenous opposition to the project can only be inflamed by this federal move,\" she said. \"And that opposition is independent of any constitutional decision reached by the courts .\" (Companies in this story: TSX: KML) By <mark>Dirk Meissner</mark>, The Canadian Press Top Stories Fight over pipeline continues: B.C. premier News07:35 PMThe Canadian Press VICTORIA--Premier <mark>John Horgan</mark> says he will continue the fight to protect British Columbia's coast from the consequences of an oil spill regardless of who owns the Trans Mountain pipeline. The federal government's decision to take over the pipeline from Kinder Morgan doesn't change his government's position to oppose the expansion project from Edmonton to Burnaby or its decision last month to pursue a reference case to the B.C. Court of Appeal, <mark>Horgan</mark> said Tuesday. \"I believe we have an obligation to ensure that we are doing everything we can to avoid the catastrophic consequences of a diluted bitumen spill,\" he said. <mark>Horgan</mark> said Ottawa's decision to buy the pipeline does not reduce the risk to B.C.'s environment and economy, which is why the province is asking the court whether it has jurisdiction to protect itself from a spill. The fact the pipeline is about to be owned by a federal Crown corporation doesn't affect the reference case, he added. But the federal government's decision to take over the project puts Ottawa in charge of managing the pipeline, including its risks, <mark>Horgan</mark> said. \"I do believe the federal government now is totally accountable, not just for regulation and approval of a pipeline, but they now are responsible from wellhead to tidewater and beyond,\" he said. \"That allows us now to have more candid discussions with the owners of the pipeline than I would have been able to when they were shareholders in a Texas-based oil company .\" B.C.'s Opposition Liberals said <mark>Horgan</mark> is about to be given the cold shoulder by Prime Minister Justin Trudeau's government. \"This is a bad day for B.C. because <mark>John Horgan</mark> has decided to kick the feds in the shins,\" Liberal Leader <mark>Andrew Wilkinson</mark> said. \"This is a government that is creating investor chaos here in B.C.\" Political experts said relations between B.C. and the federal government and neighbouring Alberta are strained over the ongoing pipeline dispute, but Trudeau's Liberals have the most to lose with the pipeline purchase. The move could backfire politically in B.C., where the federal Liberals hold 14 seats, and globally on the environmental stage because the government has committed to fight climate change but has chosen to buy a pipeline, said Prof. Kathryn Harrison, an expert on federal-provincial relations at the University of British Columbia. \"By repeatedly saying the pipeline will be built, prime minister Trudeau has painted himself into a corner where this was the last and only option,\" she said in an interview. Prof. David Tindall, an expert on climate change politics at UBC, said <mark>Horgan</mark> has gained support in B.C. for his calm and focused approach to the pipeline debate. \"He's really emphasized the issue of trying to avoid oil spills and protecting the coast,\" he said. \"That's one set of environmental issues, I think, that has broad support .\" <mark>Horgan</mark> also gained support by not appearing as an environmental ideologue through his comments that endorse oil refineries over pipelines and his backing of liquefied natural gas projects, said Tindall. The federal decision to buy the pipeline could prompt further legal challenges by Indigenous Peoples, said Prof. Margot Young, a constitutional law and Indigenous legal rights expert at the University of British Columbia's Peter A. Allard School of Law. \"What is clear is that local and Indigenous opposition to the project can only be inflamed by this federal move,\" she said. \"And that opposition is independent of any constitutional decision reached by the courts .\" (Companies in this story: TSX: KML) By <mark>Dirk Meissner</mark>, The Canadian Press", "articleID": "2018053002_00250042_W", "names": {"Andrew Wilkinson": ["Q17020421", "Q56446756"], "Dirk Meissner": ["Q1227970", "Q58064401"], "John Horgan": ["Q16145291", "Q21175985", "Q331298", "Q6239861", "Q6239868", "Q6239870"]}}]