[{"date": "2018-05-30", "url": "http://www.bournemouthecho.co.uk/news/16257421.Healthcare_services_given_funding_to_alleviate___39_bed_blocking__39_/", "content": "File photo dated 25/01/13 of a model posing with a stethoscope, as the National Institute for Health and Care Excellence (Nice) has said that healthcare professionals will be given more help in spotting the crucial early signs of cancer to prevent late d 0 comments HEALTHCARE services in Dorset are set to receive a share of £ 1.4 million to help ease delayed transfers in care. NHS Digital has announced that Dorset is one of seven local authority partnerships successful in bidding for a share of the funds. The money will help digitise assessment, discharge and withdrawal (ADW) notices. A delayed transfer of care is where a patient is ready and safe to leave hospital care, but is unable to do so, and continues to occupy a hospital bed. Dorset NHS patients spend 2,000 days more than they need to in hospital due to delays in transfers of care, or \"bed-blocking .' Systems in place to handle ADWs are currently non-digital and have been identified by local authorities and NHS partners as one of the stumbling blocks to the transfer of care from health to social care settings. <mark>James Palmer</mark>, programme head for the social care programme at NHS Digital, said:\" This funding isn't going to be the whole solution to delays in transfers of care but as a digital substitute for faxes and post, these projects will help smooth the process of moving statutory key information from a healthcare setting to local authority social care. \"0 comments", "articleID": "2018053004_00034933_W", "names": {"James Palmer": ["Q30122660", "Q57198787"]}}, {"date": "2018-05-30", "url": "http://news.bbc.co.uk/sport/tennis/44303026", "content": "French Open 2018: Simona Halep beats Alison Riske to reach second round By Jonathan Jurejko BBC Sport at Roland Garros 30 May From the section Tennis Share this page Share this with Digg Facebook Google LinkedIn Reddit StumbleUpon Twitter Copy this link http: //www.bbc.co.uk/sport/tennis/44303026 Read more about sharing. Romania's Simona Halep was a beaten finalist in both the 2014 and 2017 French Open French Open 2018 Venue: Roland Garros, Paris Dates: 27 May-10 June Coverage: Daily live radio and text commentaries on BBC Radio 5 live, the BBC Sport website and app. World number one Simona Halep began her bid for a first Grand Slam title with a gutsy fightback in her rain-delayed French Open first-round match. Halep, last year's runner-up, lost the first set before recovering to win 2-6 6-1 6-1 against American Alison Riske. Ukraine's fourth seed Elina Svitolina reached the third round with a 6-3 6-4 win over Slovakia's Viktoria Kuzmova. Two-time Wimbledon champion Petra Kvitova, seeded eighth, also beat Spain's Lara Arruabarrena 6-0 6-4. \"Catsuit makes me feel like tennis superhero' Live scores, schedule and results Alerts: Get tennis news sent to your phone Halep overcomes slow start Two-time French Open finalist Halep has spent much of the past seven months as the world's leading female player, despite never transferring her consistency on tour into lifting one of tennis' most prestigious prizes. Halep lost to unseeded Latvian Jelena Ostapenko in the Roland Garros final last year, one of six defeats in a showpiece over the past year. But reaching a second final in Paris looked a long way off as she made a woeful start in a match which originally supposed to be played on Tuesday. The 26-year-old Romanian hit 16 unforced errors in a opening set, but then won nine of the next 10 games to take control. Riske, who is Johanna Konta's doubles partner, stemmed the tide by claiming the fourth game of the final set, but only managed to win another 12 points in a final set which Halep won in 28 minutes. Halep put her sluggish start down to pre-match nerves, which she said were not caused by the extra pressure of finally landing her first major prize .\" I didn't feel the pressure, because I know that every match is tough at this tournament, so I don't expect anything, \"she said .\" I think the nerves are really good. It means that you care about what you are doing and your desire is really big. \"Halep will face Riske's compatriot <mark>Taylor Townsend</mark> in the second round.", "articleID": "2018053014_00313600_W", "names": {"Taylor Townsend": ["Q766964", "Q7690149"]}}, {"date": "2018-05-31", "url": "http://chronicle.northcoastnow.com/browns-notes/2018/05/31/BrownsZone-New-safety-Damarious-Randall-goes-viral-with-tweet-about-Cavs.html", "content": "Advertisement Scott Petrak The Chronicle-Telegram BEREA--Damarious Randall had no clue what he was getting himself into. And he has no idea how he'll get himself out...if necessary. Randall, the new Browns free safety who's a big fan of Golden State Warriors guard <mark>Stephen Curry</mark>, became one of the most popular subjects on the internet the last couple of days after sending this tweet late Monday night: \"If the Cleveland Cavaliers win the 2018 NBA finals I'll buy everyone who retweet's this a jersey...\"As of 9 p.m. Wednesday, it had been retweeted 892,000 times--about 131,000 more than when Randall met with reporters about seven hours earlier. Game 1 of the NBA Finals between Cleveland and Golden State doesn't start until today at 9 p.m.\" Honestly, I didn't think it was going to get over 100, \"Randall said after an organized team activities practice in which he made a diving interception .\" I didn't think people were going to actually view that as a serious tweet from me. But obviously it got the whole world excited about it, and now I'm actually excited about it. \"Randall said he had to ask teammates for the latest retweet counts because his phone shut down when he opened Twitter. For the last week, Randall's tweet was the most retweeted in the U.S., according to Twitter. On one unofficial list, it had the most retweets in history for an athlete .\" Do I get a trophy? \"he asked. No. . But maybe he'll get a plaque for so severely underestimating Cleveland sports fans .\" I definitely didn't think the Cleveland fan base would go this crazy about it, \"he said .\" Obviously, it was a joke, but just to know how passionate this fan base is, I mean, it's just really encouraging. \"Randall is from Pensacola, Fla., and doesn't have ties to the Warriors but started following <mark>Curry</mark> when he came out of college. Randall may have meant the original tweet as a joke but after being challenged, he tweeted there's a\" 100% chance \"he delivers on the promise. He hasn't started working on a payment plan in case the underdog Cavs shock the world .\" I don't think I've ever been a guy that worries about much myself, so we'll talk about it whenever the series is over, \"he said .\" This is just going to make the game a lot, lot more exciting for the fans, for myself. This should be a great, great series. \"Randall started to get himself in trouble Sunday after the Cavs beat the Celtics in Game 7 of the Eastern Conference finals .\" I'm glad the Cavs made it to the finals so I can watch <mark>Curry</mark> light that b * #% $up Game 3 & 4, \"he tweeted. He said Wednesday he wasn't referring to anyone in particular with the expletive .\" Oh, just the stadium, I mean the crowd, ’cause obviously <mark>Curry</mark> does shoot a lot of threes and he scores a lot of points, so that would be lighting it up, \"he said .\" I am not anti-LeBron. I am actually a big LeBron fan as well, but when he's going against Steph, I would rather Steph over LeBron, but at the end of the day, I mean they are both great, great players, and I definitely respect everything that LeBron has done for this community and for this city and state. I mean, he is one of the greatest players to ever touch a basketball if you ask me. \"Randall was acquired from Green Bay in a trade in March. Without having taken a snap in the orange and brown, he made himself a target for many Cleveland fans .\" He definitely did a couple things that the Dawg Pound does not like, \"cornerback TJ Carrie said. Randall isn't worried the anger will follow him into the season .\" No, because obviously I put a lot of work in what I do every day, and week in and week out I'm going to try my best to bring this team wins and to ultimately bring this organization championships, \"he said. Quarterback Tyrod Taylor said there was no need to ruffle feathers .\" Don't hit send, \"he said .\" Should have been smarter about the whole situation, about the tweet. Whether you feel that way or not, don't tweet it. \"Taylor knows the spotlight on athletes is always bright and has a simple method for staying out of trouble on social media .\" I just think of my mom's face. She wouldn't approve of it, \"he said. Coach Hue Jackson used the fervor to address his team about social media. He said he tells the players to keep the focus narrow and not to talk about other teams .\" I think what Damarious found out is that there's a lot of passionate Cleveland fans here and you've got to be careful about what you say, \"Jackson said. Randall planned to sit courtside for Games 3 and 4 at The Q but is reconsidering. Jackson said if he goes he might have to dodge popcorn and soda. Jackson knows about guarantees gone wrong and will jump into Lake Erie on Friday after promising more than one win in 2017. He said he's done stepping out on limbs, won't contribute a penny to the jersey fund and was adamant about where the Browns stand .\" We'll be all pulling for (the Cavs). Every last one of us will be pulling for them starting Thursday night, \"he said. Randall didn't get the memo in time. But he still believes he and Cleveland fans can find common ground .\" I feel like either way it goes it'll be a good thing to just be interacting with the fans, \"he said .\" Even if the Cavs do lose, I actually still plan on doing something for the fans. And if the Cavs win, obviously things are going to get done. \"Contact Scott Petrak at 329-7253 or spetrak @ chroniclet.com. Like him on Facebook and follow him @ scottpetrak on Twitter. Click to view comments Close comments Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2018053113_00167729_W", "names": {"Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}}, {"date": "2018-05-31", "url": "https://www.mysanantonio.com/news/texas/article/Former-pitcher-Joe-Sambito-sues-agency-he-worked-12958286.php", "content": "Text \"NEWS' to 77453 for Alerts Father left with questions after son accused of shooting officer Workers sue Valero for gross negligence Driver pleads in fatal church bus crash https: //www.mysanantonio.com/news/texas/article/Former-pitcher-Joe-Sambito-sues-agency-he-worked-12958286.php Former pitcher Joe Sambito sues agency he worked for Updated 4:08 pm, Thursday, May 31, 2018 Photo: <mark>Paul</mark> Benoit, AP Image 1 of / 1 Caption Close Image 1 of 1 FILE - In this Tuesday, Oct. 21, 1986 file photo, dejected Boston Red Sox relief pitcher Joe Sambito holds a towel to his face as he sits in the dugout in the eighth inning after being pulled out of third game of the World Series against the New York Mets at Fenway Park in Boston, Mass.. Former major league pitcher Joe Sambito has sued Independent Sports & Entertainment, the company that employed him as an agent, claiming wrongful termination and age discrimination. Sambito filed the suit Wednesday, May 30, 2018 in California Superior Court in Orange County. less FILE - In this Tuesday, Oct. 21, 1986 file photo, dejected Boston Red Sox relief pitcher Joe Sambito holds a towel to his face as he sits in the dugout in the eighth inning after being pulled out of third game...more Photo: <mark>Paul</mark> Benoit, AP Former pitcher Joe Sambito sues agency he worked for 1 / 1 Back to Gallery SANTA ANA, Calif. (AP)--Former major league pitcher Joe Sambito has sued the company that employed him as an agent, claiming wrongful termination and age discrimination. Sambito filed the suit Wednesday in California Superior Court in Orange County against Independent Sports & Entertainment, ISE Baseball and ISE Chairman Ron Burkle along with a pair of predecessor companies. Sambito, who turns 66 next month, represented Arizona's <mark>Paul Goldschmidt</mark> before the first baseman left ISE for Excel Sports Management. Sambito alleges he was fired effective Feb. 1 and asks to be awarded $2 million. Among his other claims are fraud, unjust enrichment, breach of fiduciary duty, breach of contract and unlawful business practices. Local Channel Now Playing: Now Playing S.A. contractor accused of scamming elderly residents arrested San Antonio Express-News Off-duty police officer gunned down at strip club San Antonio Express-News Swerving driver causes head-on collision San Antonio Express-News 1 hospitalized after shooting near S.A. tourist hub San Antonio Express-News SWAT talks down man threatening to kill self after breakup San Antonio Express-News Strip club security guard shoots man Sunday morning on N.E. Side 21 Pro Video Power line crashes onto home, sparking fire San Antonio Express-News Motorcyclist hospitalized after smashing into SUV San Antonio Express-News Police find stabbing victim in Terrell Hills San Antonio Express-News Fatal pedestrian crash on San Pedro Jacob Beltran\" This lawsuit contains self-serving and meritless allegations, and Independent Sports & Entertainment will vigorously defend itself against this groundless suit, \"the company said in a statement. Sambito was 37-38 with a 3.03 ERA for Houston (1976-82,' 84), the New York Mets (1985) and Boston (1986-87). ___ More AP baseball: https: //apnews.com/tag/MLBbaseball Sign up for instant alerts from MySA by texting NEWS to 77453. Most Popular 1 Blue water temporarily invades Galveston Island beaches 2 SAPD: Man sexually assaulted 7-year-old boy in Santikos bathroom 3 Two more Schlitterbahn employees charged in decapitation death of 10-year-old boy at Kansas park 4 SAPD academy instructor allegedly shot by barber in NW Side parking lot identified 5 Father left with questions after son accused of shooting off-duty police officer in San Antonio 6 UTSA-area barber accused of shooting SAPD officer during road rage altercation at NW Side strip club 7 Boerne middle school locked down after ammunition found in hallway 8 How does Lakewood Church spend its millions? Here's a look at the budget 9 Teen set to receive $8M from parents arrested in dad's death 10 Lawyer attacks witness for role in burying S.A. man 11 San Antonio contractor accused of scamming elderly residents arrested 12 Gunman at large after opening fire during party on NE Side, injuring 1 13 Lower lanes of I-35 reopen after 18-wheeler crash near downtown 14 A son helped plan a\" fake robbery' of his father's guns, police say. He and his parents ended up dead. 15 Hardbodies dispels closure rumors, changes iconic name View Comments © 2018 Hearst Communications, Inc. .", "articleID": "2018053121_00224731_W", "names": {"Paul Goldschmidt": ["Q2792929", "Q3067488"]}}, {"date": "2018-05-31", "url": "http://www.reporterherald.com/news/larimer-county/ci_31915359/gov-hickenlooper-signs-transportation-bill-big-thompson-canyon", "content": "Gov. Hickenlooper signs transportation bill in Big Thompson Canyon Measure will fund $645 million for road projects in 2018-19 By Pamela Johnson Reporter-Herald Staff Writer Posted: 05/31/2018 06:30:28 PM MDT Gov. John Hickelooper is surrounded by legislators as he signs a major transportation funding bill Thursday, during an event to celebrate the reopening of U.S. 34 west of Loveland. (Jenny Sparks / Loveland Reporter-Herald) With the newly completed Big Thompson Canyon roadway in the background, Gov. John Hickenlooper signed into law Thursday a bill to provide millions of dollars in extra funding to transportation statewide. At the site of a new bridge rerouting U.S. 34 away from the river in the canyon, west of Loveland, Hickenlooper and other state lawmakers lauded Senate Bill 1, a measure that will infuse $645 million into Colorado transportation in 2018 and 2019. \"It's not enough for what the state needs, but it certainly is a start,\" said Hickenlooper, adding that the bipartisan bill is one of the largest boosts to transportation in Colorado history. State lawmakers credited cooperation across party lines for accomplishing the bill, which lawmakers from across Colorado said will add $495 million to this year's transportation budget, $150 million to next year's and an additional $50 million in ongoing funding per year for the next of 20 years. The $495 million will be split with $346.5 million going to the Colorado Department of Transportation for projects statewide, while $74.5 million will funnel to projects on the local level statewide and another $74.5 million will be dedicated to multimodal projects on both the state and local levels, according to a summary of the legislation. Advertisement Sen. <mark>John Cooke</mark>, a Weld County Republican, was one of five sponsors of the bipartisan bill, which he called \"government at its best .\" He said the money will help meet the state's infrastructure needs. \"We're going to have a wonderful transportation system eventually,\" said <mark>Cooke</mark>. With many of the bills sponsors and other legislators surrounding him, Hickenlooper signed on the dotted line at exactly 11:52 a.m. May 31, according to those surrounding him; they noted the exact time to mark what they described as a momentous accomplishment. Larimer County Commissioner Tom Donnelly, after the ceremony, said that while other means of funding will be necessary to meet all the state's transportation needs, including widening of Interstate 25 and U.S. 34 around Loveland, the passage of Senate Bill 1 was a step in the right direction. \"Everyone who drives ---all of us as we drive to work, as we drive our kids to school, when we recreate on the weekend--knows we seriously underfund transportation,\" Donnelly said. \"Anything done to fund transportation is important. This is only a first step .\" Pamela Johnson: 970-699-5405, johnsonp @ reporter-herald.com", "articleID": "2018060100_00159229_W", "names": {"John Cooke": ["Q15637838", "Q19667214", "Q21460847", "Q22958846", "Q28962198", "Q40476653", "Q58049053", "Q6227025", "Q6227029"]}}, {"date": "2018-06-02", "url": "http://asia.eurosport.com/boxing/tyson-fury-labels-himself-greatest-heavyweight-of-all-time-ahead-of-comeback_sto6787922/story.shtml", "content": "Tyson Fury labels himself \"greatest heavyweight of all time' ahead of comeback By PA Sport 2 hours ago Updated 3 minutes ago 0 0 The 29-year-old will fight little-known Albanian Sefer Seferi on June 9. Tyson Fury proclaimed himself\" the greatest heavyweight of all time \"and is making a beeline for Anthony Joshua and Deontay Wilder in an effort to become top dog in the division once again. Fury established himself as the number one in boxing's blue riband weight class in November 2015 when he wrenched the WBA, IBF and WBO crowns from the long-reigning Wladimir Klitschko in a stunning upset. Well-publicised personal issues and an anti-doping case have kept Fury out of the ring since then but he resumes his professional career next Saturday against little-known Albanian Sefer Seferi at the Manchester Arena. The 29-year-old (25-0, 18KOs) remains the lineal heavyweight champion although Joshua has risen to prominence in his British rival's absence and holds his old belts while Wilder is the WBC titlist. Fury, though, is supremely confident in his own abilities to the extent that he believes there is no man alive who is able to defeat him, and that he can handle Joshua and Wilder with ease. He said:\" There's been plenty of come forward aggressors throwing big bombs, there's been plenty of boxers on the back foot, but when has there ever been a 6ft 9in switch-hitter with the confidence of <mark>Muhammad Ali</mark> and Floyd Mayweather rolled into one? \"There has never, ever, ever been anybody like me. I'm unbeaten, I'm fast, I'm brash, I'm young, I'm good looking, I can dance, I've even got white teeth. What more can I have as a fighter, as a boxer, as a sportsman, as a showman?\" I am the greatest heavyweight of all time, I'm not even going to be modest. I already beat the legendary Wladimir Klitschko and I did it easy, it was an easy fight. \"So put me in the ring with these bums and I'll tell you how to put them down: easy peasy lemon squeezy!\" I am the best that there's going to be and I don't believe there's a man born yet that can beat me. \"Nobody has seen what I can do yet because I've not had an opponent take me to that level that I need to go to. The better the opponent you put in front of me, the better I become .\" Seferi has spent the majority of his career at cruiserweight although he has only lost once in 24 contests in the paid ranks and never before been stopped. Ahead of his highly-anticipated comeback, Fury insists he feels better than ever following his lengthy lay-off. He said: \"You're going to see the best Tyson Fury there's ever been. I know a lot of people talk a good game when they've been (inactive for a long period), they always say they've done everything correctly .\" But when I say I've never, ever, ever been better or stronger or fitter or faster, I mean it. I've sparred hundreds and hundreds of rounds in the gym, I'm doing very, very well. \"Fury intends to box up to four more times in 2018 and thinks he could be challenging for world honours before the year is out. He added:\" It's 100 per cent possible this year. Don't rule it out that I don't take over the world this year and win a world title back. \"0 Read and react", "articleID": "2018060221_00209318_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}}, {"date": "2018-06-03", "url": "https://nba.nbcsports.com/2018/06/03/warriors-try-to-solve-their-lebron-james-problem-in-game-2/", "content": "OAKLAND--For a decade now, the conventional wisdom on slowing down LeBron James and his teams came down to one basic tenet: Let him be a scorer, or let him be a passer, but don't let him be both. LeBron seems to have evolved past that in these playoffs. \"In the past that may have been true, but I think that every year it is different,\" Warriors assistant coach <mark>Ron Adams</mark> said of the scorer vs. passer idea. \"He's a different athlete right now, so the concerns about his offense, there are things he's doing better than in the past .\" \"There were parts of my game you could disrespect earlier in my career. You can't do that now,\" LeBron said more directly. The ability of No. 23 to control and change the game is the biggest challenge for Golden State heading into Game 2 Sunday at Oracle Arena. LeBron carved up the Warriors defense like a surgeon in Game 1. He was a scorer with the 51 points, but he was a passer too with eight assists--and he should have had a lot more, the Cavaliers shot 3-of-17 from three on passes from LeBron. It's not how the Cavaliers attacked the Warriors--using a high pick to force a switch that puts <mark>Stephen Curry</mark> or Kevon Looney on LeBron--that caused Golden State trouble. \"It's the fourth year, every year they've done the same thing,\" Shaun Livingston said. Rather, it was the Warriors execution of their defensive principles they think got them in trouble. It could have been a hangover from dealing with the simpler Rockets' attack. \"When you get switched onto LeBron, he's different from (James) Harden. He's going to look to pass early in a possession,\" Warriors coach Steve Kerr said. \"They're running a lot of sets, really good sets where they isolate him. But then you've got (Kyle) Korver on a pindown or you've got (Kevin) Love off of a curl .\" So there's more going on around that isolated player, for the most part, with Cleveland. And LeBron obviously is such a great passer, he's going to try to pick you apart. \"\"He puts great stress on the defense,\" <mark>Adams</mark> said of LeBron. \"But we have our formulas we try to follow. He's gonna score, but we can do a better job than we did the first game....\" You're always going to make mistakes, you can't be perfect offensively or defensively. With mistakes, the question is how will you cover them up? Is your ball pressure good enough to, perhaps, take away the real penetrating part of passing that sets an offense up? \"In Game 1 it was not. The Warriors' communication also was not as sharp as it needed to be .\" I think in the first game we didn't communicate well, \"Looney said .\" We left (Kevin Durant) out there on an island on some of those screens without communicating. It is our job, and me as a big, to let him know when the screens are coming, and just be louder on the backside. \"Draymond (Green) talked to us, Andre (Iguodala) talked to us just about communicating. Our defense is a lot better when we're communicating and we're rotating and we're activated. LeBron is gonna make shots, he's a great scorer and been on a tear these whole playoffs, we've got to make it tough for him, make him work for each bucket, change the defense on him--he's such a smart player if you give him the same diet he's going to pick it apart, so just give him different looks and pray for the best .\" The Warriors want to make LeBron a jump shooter on Sunday night. Which sounds good, except in Game 1 LeBron was knocking down his jumpers (7-of-14). Still, that is better than the alternative. \"Once he gets into the paint, the defense breaks down and that's when you get into scramble mode, and I think where they are strongest,\" Livingston said. \"Guys are able to get involved and get their offense going .\" The Warriors also want to be more physical with LeBron in Game 2 (again, easier said than done). The bottom line is to not let LeBron get comfortable. \"I didn't think we made him work hard enough, though,\" Kerr said of Game 1. \"I thought everything was smooth sailing for him. It's one thing to have a philosophy where you're going to say, hey, we're going to make this guy beat us and shut everybody else down. You can have that philosophy in general. Lot of teams have done it with superstars in the past, whether you're talking about Kobe or Michael (Jordan) or LeBron or whoever .\" But it only works if you actually make the guy have to really use a lot of energy. That's not necessarily our strategy. Of course we're trying to keep other guys down, but we've got to make them work harder in general. I thought our defense was subpar the other night. \"If it's subpar again on Sunday night, the Warriors could be heading to Cleveland in a tie series.", "articleID": "2018060312_00051694_W", "names": {"Ron Adams": ["Q18683794", "Q26899613", "Q7363452"], "Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}}, {"date": "2018-06-06", "url": "http://www.chinchillanews.com.au/news/airfares-could-get-more-expensive-due-to-rising-fu/3434722/", "content": "Airfares may rise as airlines cope with the rising cost of crude oil, airline bosses say. Travel Airfares are about to get more expensive by Lauren McMah 6th Jun 2018 3:26 PM BAD news, budget travellers: the price of flights is about to get more expensive, according to the bosses of several major airlines. At an annual meeting of the International Air Transport Association (IATA) in Sydney this week, a hot topic for airline bosses and delegates has been the skyrocketing price of oil, which is at its highest since 2014 - and rising at a faster rate than ticket prices. With fuel making up around 25 per cent of an airline's costs, they will be forced to drive up the price of their fares to cope, American Airlines chief executive officer <mark>Doug Parker</mark> warned. He added that as carriers looked at ways to drive fuel efficiency, they may also consider reducing the capacity of their aircraft - which may mean there are fewer seats to pick from, Fortune reports. It's not the first time Mr <mark>Parker</mark>, who leads the world's largest airline, has warned about having to pass on the rising cost of fuel to passengers. \"Oil is our second-largest expense. So when it increases, the cost of air travel increases,\" he said in April. \"I would expect you would see higher fares to consumers over time .\" Air New Zealand chief executive Christopher Luxon echoed that warning in Sydney this week. \"At this point with rising fuel, you control costs, raise prices and you may have some fall off in demand and reduce capacity,\" Mr Luxon told Reuters. The boss of American Airlines has been warning for months that passengers may have to start wearing the skyrocketing cost of fuel. Picture: Lynne Sladky/Associated Press \"I think we are seeing pricing move up internationally and certainly yields come up as well .\" Brent crude is trading at around $99 a barrel, up nearly 50 percent from a year ago, Reuters reports. Some airline companies, such as China Eastern Airlines, have signalled plans to hedge oil while others, like Emirates and Delta, ruled it out. Aviation chiefs and economists at the IATA conference suggested hedging did not avoid the inevitable impact of rising fuel costs. \"Whilst most of us have hedging in place, that hedging eventually runs out or gets replaced by new positions you have got, and it is a question then of what do you do?\" Virgin Australia Holdings Ltd CEO John Borghetti told Reuters. \"If you look at history, typically some of that cost has to be passed on at some point because you just simply can't absorb it .\" Between mid-2014 and early 2015, lower oil prices ushered in an era of lower airfares and bigger growth for airlines. This year, the price of oil is expected to average more than $91.40 a barrel. The IATA had been expecting it to reach only $78.40. The association has now revised its estimated overall industry profits to $44.6 billion, which is 12 per cent lower than it originally forecast in December. \"We have seen a rise in the fuel cost now for almost 15 months,\" IATA chief executive officer Alexandre de Juniac said. \"Usually you see an impact on fares 10 to 12 months after, but for the moment I have to say the fuel increase has not been passed on in fares .\" Will it happen? Mr de Juniac said that was up to the airlines. \"It is also an individual decision by each airline to decide whether or not they want to increase the fares to reflect the increase in fuel costs,\" he said. The lower fuel prices of recent years also helped spur a higher-than-projected growth in passenger demand. That was also likely to change, said Peter Harbison, executive chairman of Sydney's CAPA Centre for Aviation. \"If they are forced to start raising prices, that traffic growth could very quickly disappear at the same time that profits disappear,\" he said. Airline bosses have also voiced concerns labour and infrastructure costs could also contribute to the end of a three-year run of unusually high returns for the airline industry. Still, the IATA expects passenger air travel to expand by 7 per cent in 2018. That rate is more sluggish than the 8.1 per cent growth recorded in 2017, but it's faster than the 20-year average of 5.5 per cent, for the sixth consecutive year. aeroplane Read More Login to follow editors picks Read More Login to follow fuel costs Read More Login to follow travel Read More Login to follow aeroplane editors picks fuel costs travel", "articleID": "2018060605_00077363_W", "names": {"Doug Parker": ["Q5300803", "Q5300806"]}}, {"date": "2018-06-07", "url": "http://www.myrecordjournal.com/News/Wallingford/Wallingford-News/Wallingford-police-remind-residents-to-lock-cars-after-recent-rise-in-car-break-ins.html", "content": "Wallingford police remind residents to lock cars after uptick in car burglaries, thefts Wallingford police remind residents to lock cars after uptick in car burglaries, thefts Wallingford police remind residents to lock cars after uptick in car burglaries, thefts The Wallingford Police Department, Thursday, Nov. 16, 2017. | Dave Zajac, Record-Journal Advertisement The Wallingford Police Department, Thursday, Nov. 16, 2017. | Dave Zajac, Record-Journal June 07, 2018 03:06 PM By Matthew Zabierek, Record-Journal staff WALLINGFORD--Police are reminding residents to lock their vehicles in response to a recent uptick in car break-ins and thefts. Police said in a press release they are \"continuing to investigate numerous thefts from motor vehicles and stolen motor vehicles,\" and asked residents \"to secure all valuables and lock their vehicles .\" Burglars usually commit the crimes at night and target unlocked cars, police said. \"The crime is often being committed by groups of individuals, many of them juveniles, who come into our neighborhoods and steal from vehicles that are left unlocked,\" the press release said. \"They typically do not force entry into locked vehicles, however, we are cautioning people to remove valuables from their vehicles .\" While car burglaries are something police continue to deal with, there has been a recent uptick in incidents, Police Chief <mark>William Wright</mark> said. \"There has been an increase,\" <mark>Wright</mark> said in an interview. \"I couldn't tell you with any great certainty by how much, but there has been an increase .\" <mark>Wright</mark> couldn't say whether break-ins occur more often in the summer months, but said \"it's not unreasonable to think that .\" <mark>Wright</mark> said investigating vehicle break-ins is difficult, but said the department has solved \"many cases, either through forensic evidence or work that other agencies have done .\" \"The Wallingford Police Department does initiate special enforcement to try to deter this activity,\" the release said, \"and have made several arrests, however, we need the assistance of our residents to put an end to this activity .\" <mark>Wright</mark> said many local communities are also dealing with car break-ins, and said in some other communities, burglars have used a garage-door opener left in an unlocked car to gain access to homes. Police are also asking residents to lock their vehicles to \"lock your vehicles at all times to prevent children from gaining access and getting locked inside vehicles during the hot summer months .\" mzabierek @ record-journal.com", "articleID": "2018060719_00039772_W", "names": {"William Wright": ["Q17018282", "Q1724921", "Q19043849", "Q21006566", "Q28945688", "Q56598355", "Q8020587"]}}]