[{"date": "2018-06-09", "url": "http://forgottenrealms.wikia.com/wiki/Figurehead_of_disguise?diff=410899&oldid=0", "content": "Latest revision as of 03:34, June 9, 2018 (edit) Johnnyriot999 (Talk | contribs) (Created page with \"{{Item | image = | caption = | name =\" Figurehead of Disguise \"| othernames = | nicknames = | type = [[Figurehead of wondrous powe...\") Latest revision as of 03:34, June 9, 2018 Figurehead of Disguise Rules Information A figurehead of disguise was a wooden statue, affixed upon a spelljammer that granted magical illusory powers to the mage at the helm. [1] Contents [show] Description Edit These statues were made from cherry wood and adorned with a large onyx. Unlike other spelljamming figureheads, which were carved in humanoid form, these took the shape of couatl. The wings of the statue would wrap around each side of the ship and the tail would dip beneath its prow. Each figurehead granted their ship a unique illusion. [1] Powers Edit When activated by the mage at the spelljammer's helm, figureheads of illusion could, once per day, create an illusory effect, altering the appearance of the ship. These images could be additional weaponry, larger and more numerous sails and armor or other such deceptive appearances. These illusions were non-functioning, but could be eliminated by contact, the spelljamming mage losing concentration or until dispelled. [1] Appendix Edit See also Edit Figurehead of wondrous power References Edit ↑ 1.0 1.1 1.2 1.3 Steven <mark>E.</mark> Schend (July 1990).\" Bazaar of the Bizarre: Magic from the stars \". In <mark>Roger E. Moore</mark> ed. Dragon #159 (TSR, Inc.), pp. 15--18. Retrieved from\" http: //forgottenrealms.wikia.com/wiki/Figurehead_of_disguise? oldid=410899 \"Categories: Magic items Cherry items Wooden items Items 20000-29999 gold pieces", "articleID": "2018060903_00107510_W", "names": {"Roger E. Moore": ["Q30075241", "Q7358135"]}}, {"date": "2018-06-11", "url": "http://www.governing.com/topics/mgmt/net-neutrality-officially-ends-bigger-telecoms.html", "content": "So Long to Net Neutrality, Hello to Bigger Telecoms? June 11, 2018 Two pivotal developments this week could dramatically expand the power and footprint of major telecom companies, altering how Americans access everything from political news to \"Game of Thrones\" on the Internet. Monday marks the official end of the U.S. government's net neutrality rules, which had required broadband providers such as AT & T, Charter, Comcast and Verizon to treat all Web traffic equally. The repeal is part of a campaign by <mark>Ajit Pai</mark>, the Republican chairman of the Federal Communications Commission, to deregulate the telecom industry in a bid to boost its investments--particularly in rural areas. \"I think ultimately it's going to mean better, faster, cheaper Internet access and more competition,\" <mark>Pai</mark> said in an interview. Others disagree and will challenge <mark>Pai</mark> in court, while many states are fighting back with their own laws, further muddling the situation. One day after the net neutrality changes, a federal judge is set to rule on Tuesday on whether AT & T can buy Time Warner. AT & T, already the country's second-largest wireless network, stands to gain a content trove from Time Warner that includes HBO and CNN--leading the Justice Department, which filed the lawsuit, to argue that the company could harm its rivals.", "articleID": "2018061115_00024374_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}}, {"date": "2018-06-11", "url": "http://thehill.com/blogs/floor-action/senate/391720-deal-to-include-zte-penalties-in-must-pass-defense-bill", "content": "© Greg Nash Senators announced Monday that legislation keeping in place penalties against Chinese telecommunications giant ZTE will be included in a must-pass defense policy bill. \"By including this provision to undo the ZTE deal in the defense bill, the Senate is saying loudly and in a bipartisan fashion that the president is dead wrong to back off on ZTE,\" Senate Minority Leader Charles Schumer Charles (Chuck) Ellis Schumer Dem leaders condemn <mark>Trump</mark> after reversal on G-7 communique endorsement Dem lawmaker: <mark>Trump</mark> conceding \"role as leader of the free world' after G-7 summit Schumer: <mark>Trump</mark>\" turning our foreign policy into an international joke' MORE (D-N.Y.), a supporter of the amendment, said in a statement. The amendment keeping in place penalties against ZTE is expected to be added to the National Defense Authorization Act (NDAA), an annual defense policy bill that the Senate is poised to pass as soon as this week. ADVERTISEMENT The amendment would also ban government agencies from buying or leasing telecommunications equipment and services from Chinese telecom firms Huawei and ZTE and ban the government from providing loans to or subsidizing either company. The provision still needs to survive a conference with the House, which passed its own defense bill. If it's in the final bill it could provoke a showdown with President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> <mark>Trump</mark>: \"Excitement in the air' ahead of Kim meeting <mark>Trump</mark> doubles down on criticism of EU, Canada Merkel: EU will retaliate against <mark>Trump</mark> tariffs MORE, who needs to sign the must-bill defense policy bill. The <mark>Trump</mark> administration announced late last week that it had reached a deal to lift penalties against the company in exchange for ZTE paying a $1 billion fine and embedding a U.S.-selected compliance team in the firm. But talk of a deal to save ZTE has sparked bipartisan backlash on Capitol Hill, where lawmakers have been frustrated with the administration's efforts. Schumer said earlier on Monday that the agreement was as\" weak as a wet noodle \"and argued the administration had been\" outmaneuvered \"in the agreement. Schumer, as well as Sens. Chris Van Hollen Christopher (Chris) Van Hollen Hillicon Valley: Deal reached on ZTE, but lawmakers look to block it | New encryption bill | Dems push Ryan for net neutrality vote | Google vows it won't use AI for weapons Overnight Defense: <mark>Trump</mark> hopes to normalize relations with North Korea | Senate defense bill would limit help for Saudis in Yemen | US to honor temporary Taliban ceasefire Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint MORE (D-Md .), Tom Cotton Thomas (Tom) Bryant Cotton Hillicon Valley: Deal reached on ZTE, but lawmakers look to block it | New encryption bill | Dems push Ryan for net neutrality vote | Google vows it won't use AI for weapons Overnight Defense: <mark>Trump</mark> hopes to normalize relations with North Korea | Senate defense bill would limit help for Saudis in Yemen | US to honor temporary Taliban ceasefire Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint MORE (R-Ark .) and Marco Rubio <mark>Marco Antonio Rubio</mark> Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint <mark>Rubio</mark>: ZTE a greater threat than steel from Argentina and Europe <mark>Trump</mark> throws ZTE a lifeline as part of broader China strategy MORE (R-Fla .), filed the amendment last week to the NDAA to restore the Commerce Department's penalties on ZTE for violating U.S. sanctions against Iran and North Korea .\" ZTE has repeatedly violated U.S. law and represents a threat to our national security--Congress cannot and will not allow the Administration to let ZTE off the hook in the interest of Chinese jobs, \"Van Hollen said in a statement .\" The threat Huawei and ZTE pose to our national security is too great to ignore. This amendment will help keep Americans' private information out of the hands of the Chinese Communist Party, and I'm pleased it will be included in the NDAA, \"Cotton added. Senators have been privately discussing adding the bipartisan proposal into the NDAA. <mark>Rubio</mark> told reporters earlier on Monday that he expected it to be included, while GOP Sen. John Cornyn John Cornyn GOP senators want NAFTA deal from <mark>Trump</mark> by Labor Day Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint The Hill's Morning Report--Sponsored by PhRMA--Some GOP lawmakers reject script on <mark>Trump</mark> MORE (Texas) cautioned that talks were ongoing but no final decision had been made. Commerce Secretary Wilbur Ross Wilbur Louis Ross ZTE ordeal shows allied cooperation key to keeping bad actors in check Census Bureau's chief scientist warned secretary in memo against adding citizenship question Lawmakers spar at hearing over census citizenship question MORE is meeting with senators on Monday evening to walk them through the details of the agreement. Tags Chris Van Hollen Charles Schumer <mark>Donald Trump</mark> Wilbur Ross John Cornyn Marco Rubio Tom Cotton", "articleID": "2018061122_00154473_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Marco Antonio Rubio": ["Q324546", "Q3845892"]}}, {"date": "2018-06-12", "url": "http://www.eurosport.co.uk/football/premier-league/2016-2017/ljungberg-returns-to-arsenal-as-under-23-coach_sto6804575/story.shtml", "content": "<mark>Fredrik Ljungberg</mark> returns to Arsenal as Under-23 coach By Eurosport 10 minutes ago Updated 2 minutes ago 0 0 Former Arsenal midfielder <mark>Fredrik Ljungberg</mark> has returned to the Premier League club as coach of the Under-23 side, Arsenal said on Tuesday. The 41-year-old Swede, who coached Arsenal's Under-15 team in the 2016-17 season, was part of \"The Invincibles\" side who won the north London club's last Premier League title in 2003-04. \"He understands the club's values and how important it is to give young players the opportunity to grow and develop,\" Arsenal academy manager Per Mertesacker told Arsenal's website https: //www.arsenal.com/news/freddie-rejoin-u-23s-head-coach. \"Everyone knows Freddie loves the club and we look forward to him developing his career with us .\" <mark>Ljungberg</mark> played for Arsenal from 1998-2007 and made 216 appearances, scoring 46 goals. He was named the Premier League's player of the season in 2001-02. On the same topic", "articleID": "2018061211_00553927_W", "names": {"Fredrik Ljungberg": ["Q10560", "Q5960884"]}}, {"date": "2018-06-12", "url": "http://www.spokesman.com/stories/2018/jun/12/aging-tiger-woods-phil-mickelson-set-to-resume-sto/", "content": "Twitter Facebook Email Reddit SMS SOUTHAMPTON, N.Y.--The 40-40 club will be front and center this week at Shinnecock. No longer the red-hot weekly rivals they'd been over the previous two decades, Tiger Woods, now 42, is seeking to win his first major title in a decade, while Phil Mickelson, at 47, is still chasing his first U.S. Open title (after six runner-up finishes) to complete the career Grand Slam. \"We're certainly on the back end of our careers,\" Woods said when asked about Mickelson on Tuesday. \"We've been going at it for 20-plus years. That's a long time. We've been ranked 1 and 2 and have gone at it a lot of times throughout the years. And we've developed a pretty good friendship because of it .\" Phil's won ump-teen tournaments all around the world and he's finished second at this event six times. Of all the events, you would think this would be the one event he would have the least chance to win, because of the way he's driven for most of his career. But that short game of his is off the charts. A U.S. Open is about wedging. He can spray it a little bit here and there, but you have to be able to get it up and down from 100 yards. We're all gonna face it. And he's been one of the best of all-time at doing that. So he's made some of the more difficult pars that you have to make to win this championship. It's just that he hasn't, but he's come so close. For him to be able to somehow pull it off at his age, I don't think it's ever been done at that age. But also to complete the career grand slam, it would be an unbelievable task and an unbelievable accomplishment. \"Woods typically had the largest practice-round gallery on Tuesday and spoke to a packed interview room before his first Open appearances since 2015, while recent winners of majors--such as Jordan Spieth, <mark>Patrick Reed</mark>, <mark>Jason Day</mark>, <mark>Dustin Johnson</mark>, <mark>Justin Thomas</mark> and Brooks Koepka--all drew considerably smaller crowds .\" It's not really for me. It's to the game in general. . It adds a whole \"nother level, for sure,\" Spieth said of Tiger's presence. \"I think it's great for the sport, but he's not here because of that. He's here because he loves the game and he loves to compete and he wants to win. And that's what he's been obsessed with, and it's what's driven him, and it's why he's so successful .\" But the kind of extra to that is that it's good for the rest of us. He, like Arnie (Palmer) and Jack (Nicklaus), are in that elite company that have shifted the game and made it popular and made the way of life significantly different for professional golfers. We certainly owe a lot to him. But that doesn't mean that anybody wants to take it easy on him if they're coming down the stretch with him. \"<mark>Day</mark>, the 2015 PGA winner, added that he considers\" the biggest story probably \"of the week to be Woods, despite a star-studded field of past champions .\" Not taking anything away from Phil because winning the career Grand Slam is absolutely huge, and I know that he's been so close so many times now, \"<mark>Day</mark> said .\" But for what happened to Tiger, it's been 10 years, what he did in that period of when he dominated, and I think a lot of people are kind of chomping at the bit for him to come back and do something special. Seeing if he can get back to winning and beating Jack's record (of 18 major titles). I think a lot of people will probably be more excited--well, a lot of people will look at that more so than Phil's. \"So I think he's pretty much ready. He's primed and ready for this week. So it would be pretty cool to see that. But, obviously, I don't want that to happen, because I want to win .\" ", "articleID": "2018061221_00583053_W", "names": {"Dustin Johnson": ["Q1002293", "Q30015838"], "Jason Day": ["Q24005613", "Q246992", "Q6162329", "Q6162331"], "Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"], "Patrick Reed": ["Q15905139", "Q57514710"]}}, {"date": "2018-06-14", "url": "https://www.out-law.com/en/articles/2018/june/gross-payment-cancelled-without-considering-taxpayer/", "content": "Europe \"This will be an extremely disappointing decision for many in the construction industry where the removal of gross payment status can result in the loss of business or failure to win business in the first place,\" said <mark>Steven Porter</mark>, a tax disputes expert at Pinsent Masons, the law firm behind Out-Law. com. JP Whitter (Water Well Engineers) Limited, a family-run business of water well engineers, had its gross payment registration cancelled by HMRC after failing to comply with the CIS by making late payments of taxes. It appealed HMRC's decision, arguing that HMRC should have taken into account the detrimental effect the revocation would have on the company's business. The company said that major customers would be likely to withdraw work if it lost its gross payment status. At the time of HMRC's decision, the company said cancellation would have been likely to lead to the loss of around 60% of the company's turnover and the dismissal of about 80% of its employees. It estimated that recovery would take about ten years. CIS is a tax deduction scheme which involves tax being deducted at source from payments which relate to construction work. It was introduced in order to counter widespread tax evasion amongst subcontractors in the construction industry. Contractors must deduct tax from payments to subcontractors and pay the tax to HMRC. The amount deducted and paid over is allowed as a credit against the subcontractor's liability to HMRC. Subcontractors fulfilling certain conditions can register with HMRC to be able to receive payments gross. This makes a sub-contractor with gross payment status a more attractive party for a contractor to deal with and improves the sub-contractor's cash flow by enabling the sub-contractor to receive the contract price without deduction. The legislation provides that HMRC \"may\" cancel a person's registration for gross payment \"if it appears to them\" that various conditions are satisfied. The company argued that in exercising its discretion to cancel the registration HMRC should take into account the likely impact on the company's business. The First-tier Tribunal agreed with the company but the Upper Tribunal and the Court of Appeal decided that HMRC had no duty to take into account matters outside the CIS regime. Giving the decision of the Supreme Court, Lord Carnwarth said that HMRC did not have an unfettered discretion as to whether to cancel the registration as \"any statutory discretion must be exercised consistently with the objects and scope of the statutory scheme\". Agreeing with, and quoting from Henderson LJ's decision in the Court of Appeal, he said that HMRC's power did not extend to matters \"which do not relate, directly or indirectly, to the requirements for registration for gross payment, and to the objective of securing compliance with those requirements\". Lord Carnwarth said that the Court of Appeal had \"rightly emphasised the highly prescriptive nature of the [CIS] scheme\". \"The mere fact that the cancellation power is not itself mandatory is unsurprising. Some element of flexibility may be desirable in any enforcement regime to allow for cases where the failure is limited and temporary (even if not within the prescribed classes) and poses no practical threat to the objectives of the scheme. It is wholly inconsistent with that tightly drawn scheme for there to be implied a general dispensing power such as implied by the company's submissions .\" \"The goal going forward when a business's status is removed will be seeking to persuade HMRC that the circumstances are within the narrower margin of discretion that the Supreme Court confirmed HMRC has to not remove gross payment status,\" said <mark>Steven Porter</mark>. The Supreme Court also dismissed the Company's arguments that HMRC had breached Article 1 of the First Protocol to the European Convention on Human Rights (A1P1), which entitles a person to \"the peaceful enjoyment of his possessions\" : \"Once it is accepted that the statute does not in itself require the consideration of the impact on the individual taxpayer, there is nothing in A1/P1 which would justify the court in reading in such a requirement. Registration is a privilege conferred by the legislation, which has significant economic advantages, but it is subject to stringent conditions and the risk of cancellation. The impact on the company is no different in kind from that which is inherent in the legislation. I agree entirely with Henderson LJ that the exercise of the power within the scope of the statutory framework comes well within the wide margin of appreciation allowed to the state for the enforcement of tax,\" said Lord Carnwarth.", "articleID": "2018061416_00113309_W", "names": {"Steven Porter": ["Q20985660", "Q7615158"]}}]