[{"articleID": "2013011817_00012750_W", "names": {"Neeraj Kumar": ["Q20684424", "Q57081351", "Q6986927"]}, "date": "2013-01-18", "url": "http://zeenews.india.com/news/delhi/unplanned-colonies-fuelling-capital-crime-delhi-police_823723.html", "content": "new delhi: there has been a small 1.75 percent increase in the national capital's crime graph in 2012 in comparison to 2011, delhi police commissioner <mark>neeraj kumar</mark> said here on friday but attributed city crimes largely to the growth of \"unplanned colonies\" . a total of 54,287 cases were registered under indian penal code (ipc) in 2012. in 2011, the number of cases was lower at 53,353, <mark>kumar</mark> said, adding that it was a rise of 1.75 percent. despite the increase in crimes, delhi police solved 53.15 percent cases in 2012 in comparison to 51.47 percent in 2011. \"in delhi, almost 65 percent of the population lives in unplanned colonies. about 11.7 percent live in rural or urban villages while only 23.7 percent people staying in planned colonies, which is an important causative factor for crime in delhi,\" said <mark>kumar</mark>. <mark>kumar</mark> said that the number of cases per lakh of the population declined from 392.64 cases in 2001 to 318.98 in 2012. in 2012, 521 cases of murder were registered as against 543 cases in 2011, a decline of 4.05 percent. cut all ties with pakistan it is time for india to reassess its policy towards pakistan."}, {"articleID": "2018090315_00312018_W", "names": {"James Chester": ["Q28024774", "Q546799"]}, "date": "2018-09-03", "url": "http://www.eurosport.co.uk/football/james-chester-welcomes-possibility-of-facing-denmark-without-top-players_sto6916660/story.shtml", "content": "<mark>James Chester</mark> welcomes possibility of facing Denmark without top players By PA Sport 2 hours ago Updated 1 minute ago 0 0 The Danes are involved in a long-running dispute over their squad's commercial rights. Wales defender <mark>James Chester</mark> has welcomed the possibility that UEFA Nations League opponents Denmark could be without Christian Eriksen and company in Aarhus on Sunday. The Danes are involved in an extraordinary row between their Player Association (Spillerne) and Football Association (DBU) which threatens both this fixture and Denmark's participation in the 2020 European Championship. The long-running dispute is over a new commercial rights agreement for the squad, and the DBU has threatened to select players from Denmark's lower leagues rather than the likes of Tottenham midfielder Eriksen, Chelsea defender Andreas Christensen and Leicester goalkeeper Kasper Schmeichel. \"It would certainly make it an easier fixture without Eriksen,\" <mark>Chester</mark> said. \"He is one of the best players in the Premier League. He showed that at the World Cup.\" Denmark are due to play a friendly in Slovakia on Wednesday but at present do not have a playing squad to fulfil the fixture. Manager Age Hareide and assistant Jon Dahl Tomasson are said to be \"working from home\" and will not be in charge for the game in Trnava. Hareide's squad were due to meet in Copenhagen on Monday to discuss the situation after Spillerne issued a strongly-worded statement that the DBU had walked out of talks over the weekend. Denmark, who are a lofty ninth in the FIFA rankings, have been beset by internal problems over the past 12 months. The national women's team boycotted a World Cup qualifier against Sweden in October 2017 in a dispute over employment conditions. Sweden were awarded a 3-0 win and UEFA fined the DBU £ 18,000. The DBU was also warned that Denmark would be barred from UEFA tournaments if it cancelled another match in the next four years. \"All is not well over there at the moment, but it's nothing to do with us,\" <mark>Chester</mark> said. \"We'll be in Denmark on Sunday regardless of what squad they pick, and looking to win the game whoever's playing.\" While Wales to discover the outcome of the Danish talks, Ryan Giggs' side are preparing for their opening Nations League game against the Republic of Ireland in Cardiff on Thursday. The two sides met twice last year when the Republic ended Wales' World Cup dream with a 1-0 win in Cardiff. The two games were controversial affairs and Republic defender Seamus Coleman suffered a broken leg in the Dublin clash. \"Any game that involves Ireland holds a bit of bite and tension in the air,\" <mark>Chester</mark> said. \"It's slightly different to most international football as you do know the vast majority of players you're playing against.\" The referees are perhaps a bit on edge knowing it's a Welsh and Irish thing. \"It could may be refereed in a slightly different way because they're not used to that sort of game.\" But it's a good game for us after our World Cup disappointment and something we're really excited for. \"0 Read and react"}, {"articleID": "2016072219_00045972_W", "names": {"John Walsh": ["Q17123667", "Q18385563", "Q29436093", "Q54321922", "Q58040597", "Q6262859", "Q6262861", "Q6262863", "Q6262867", "Q6262872", "Q6262874", "Q6262876", "Q6262884"]}, "date": "2016-07-22", "url": "http://www.nj.com/hudson/index.ssf/2016/07/cops_nab_man_they_say_robbed_3_north_jersey_banks.html", "content": "Cops nab man they say robbed 3 North Jersey banks 035. JPG <mark>John Walsh</mark>, 37, is placed under arrest Wednesday, July 19, 2016 after allegedly carrying out three bank robberies in Jersey City, Maplewood and Summit, police said. Joe Shine | For The Jersey Journal commentsJersey City police, State Police and members of the FBI responded to 98 Bright St. in Jersey City where a 37-year-old man was arrested on robbery charges, cops said. Joe Shine | For The Jersey Journal Law enforcement arrested a 37-year-old Jersey City man they say carried out three bank robberies throughout North Jersey, police said. <mark>John Walsh</mark>, of Bright Street, was charged with robbery in connection to bank robberies in Jersey City, Maplewood and Summit, Jersey City spokeswoman Jennifer Morrill said. Just after 12:30 p.m. July 15, <mark>Walsh</mark> entered the Wells Fargo Bank on Central Avenue wearing sunglasses and a black tee shirt, and approached the teller window. He passed a note that read \"give me all your $50 and $100 bills and don't press the alarm.\" The teller gave him $250, Morrill said. The robber then left the bank with the money and the note. The Jersey City Major Case Squad was notified and responded to handle the investigation, the city spokeswoman said. On Wednesday, Violent Crimes Commander Capt. Michael Gajewski was notified by the FBI that a male matching the description from the Wells Fargo robbery had just robbed a bank in Summit, as well as one in Maplewood. Further investigation by Major Case Detectives led to a positive identification of <mark>Walsh</mark> as the suspect, Morrill added. Gajewski, Jersey City Police Lt. Mark Conroy and detectives from the Major Case Squad responded to 98 Bright St. with FBI agents and State Police, and placed <mark>Walsh</mark> under arrest. A search of <mark>Walsh</mark>'s residence and vehicle led to the recovery of evidence further linking the actor to the three bank robberies, Morrill said. Most Read"}, {"articleID": "2010021704_00027077_W", "names": {"Angela Palmer": ["Q28741494", "Q532218"]}, "date": "2010-02-17", "url": "http://.dothaneagle.com/dea/news/local/article/dothan_commissioners_to_examine_nonprofit_funding_policy/131350/", "content": "they didn't get any answers, but at least they now know the questions. the dothan city commission's work session tuesday didn't lead to any firm decisions about which non-profit organizations the city should support, because the commissioners agreed the current policy for deciding such matters needs to be examined. each of the commissioners expressed some concern about city commission policy no. 16, which sets the conditions nonprofit groups must meet in order to receive funding from the city. as a result, the commissioners agreed to examine 20 questions laid out in a report by the city's internal analyst, valerie harris, based on existing nonprofit funding policies in other communities across the state. \"let's take these 20 questions, take a look at all the information we have, and come to some conclusions,\" mayor mike schmitz told the commission. \"i want us to really study this issue and these questions.\" the commissioners will report back to the mayor with their responses to the questions in two weeks, at which time they can begin work on a new policy. district 1 commissioner james reading was the first to raise concerns about the existing policy during the meeting, citing confusion about how much power the commission actually has regarding allocation of funds. \"i have some problems with the way policy 16 is written,\" he said. \"let's look at what this commission is responsible for, which should be everything, and what the city manager is responsible for.\" according to district 6 commissioner keith seagle, the commission's primary concern is accountability for the agencies receiving funding. harris' report laid out some common practices among other communities statewide that seagle would like to see implemented in dothan. \"there are some basic rules as far as being fair and competitive, such as making an application process and demonstrating that you are doing with the people's money what you said you'd do with the people's money,\" seagle said. during the meeting, dothan finance director <mark>angela palmer</mark> said nonprofit funding currently takes up 3.29 percent of the city's budget. free registration) please avoid offensive, vulgar, or hateful language. news editor christie kulavich guides you to fun events happening in the wiregrass. sports writer drew champlin writes about the latest sports news from troy university."}, {"articleID": "2015090800_00041926_W", "names": {"Kari Mäkinen": ["Q28789619", "Q5394527", "Q961480"]}, "date": "2015-09-07", "url": "http://newsinfo.inquirer.net/720111/communities-ready-to-open-their-doors-after-popes-refugee-appeal", "content": "Communities ready to open their doors after pope's refugee appeal Communities ready to open their doors after pope's refugee appeal SHARES: 07:47 AM September 8th, 2015 Recommended September 8th, 2015 07:47 AM Pope Francis. AP FILE PHOTO VATICAN CITY, Holy See--Campaigners have warmly welcomed Pope Francis's call for every Catholic parish in Europe to take in a refugee family to help ease the continent's unprecedented migrant crisis. Francis, giving the Angelus blessing in Saint Peter's Square on Sunday, urged \"every parish, every religious community, every monastery, every sanctuary in Europe\" to take in migrants in need. Some see the proposal as over-ambitious but many groups called it a useful blueprint that draws on the formidable organizing skills of the Catholic Church. ADVERTISEMENT \"There are tens of thousands of parishes in Europe,\" said Father Peter Balleis, international director of the Jesuit Refugee Service (JRS). \"And in each one, hundreds of families are able to organize and take turns welcoming refugees.\" According to the UN refugee agency, it takes about six to eight months to process an asylum application in Europe, sometimes longer if legal issues arise. During this time, many refugees are in desperate need of a place to stay. Increasing efforts The JRS has already been working with refugees looking for a temporary home, and plans to expand its efforts. Five years ago the group launched a program in the Paris area called \"Welcome,\" under which around a hundred families and religious communities house refugee families for five weeks. The program has been successful in helping migrants integrate and is now being rolled out to several other French cities, as well as to other countries, such as Spain. JRS says the five-week time limit is to encourage the refugees to be independent--without leaving any of the refugees on the street. \"After a while, you need the person to enter into the society\" of the host country, said Jean-Marie Carriere, regional director of the JRS. Other European communities have also already welcomed thousands of asylum seekers and are preparing for more. Cardinal Angelo Bagnasco, chairman of the Italian bishops' conference, told the country's La Repubblica daily there was evidence \"of an important movement in all dioceses.\" Italy's Catholic organizations have already taken in between 15,000 and 20,000 asylum seekers. In Austria too, dioceses have offered thousands of places for migrants to stay and several have announced plans to do more. Pannonhalma Abbey in northwest Hungary, which is run by the Benedictine Order, has also opened its doors to Syrian families trekking across the country to western Europe, and said it is prepared to repeat the experience. Carlotta Sami, spokesperson in Italy for the UN refugee agency, said that the pope's calls to action supported the agency's goals. \"The pope's voice has helped us for years to strongly support the welcome of those fleeing war and violence,\" she said. Opportunity for interreligious dialogue One detail the pope didn't mention in his appeal is that the majority of the 336,000 migrants who arrived this year on Europe's shores are Muslim. Father Balleis saw it as a chance for foreign and local families to \"get to know and understand\" one another. The Catholic Church isn't the only church appealing for greater solidarity. The archbishop of the Finnish Lutheran Church, <mark>Kari Mäkinen</mark>, called Saturday for the country's parishes to open up their centers for retreats and summer activities to refugees. There has also been an outpouring of solidarity from groups with no religious affiliation, in Germany and elsewhere. In France, the Singa foundation said it had received more than 1,000 offers of accommodation in just a few days, and in the UK more than 2,000 residents have said they are ready to welcome refugees as well. RELATED STORIES"}, {"articleID": "2018052921_00115343_W", "names": {"Svetlana Kuznetsova": ["Q192064", "Q21063641", "Q3978501", "Q4245117"]}, "date": "2018-05-29", "url": "http://www.durangoherald.com/articles/225910-serena-williams-wins-in-grand-slam-return-at-french-open", "content": "Serena Williams wins in Grand Slam return at French Open Durango, Colorado Summary: No precipitation throughout the week, with high temperatures rising to 92 ° on Saturday. Currently Weather data from The Durango Herald and darksky.net Tue Partly cloudy in the morning. 12% chance of precipitation Partly cloudy in the morning. 6% chance of precipitation Serena Williams wins in Grand Slam return at French Open Nadal, Sharapova advance By Howard Fendrich AP Tennis Writer Tuesday, May 29, 2018 3:22 PM Serena Williams of the U.S. clenches her fist after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams won 7-6 (4), 6-4. Allessandra Tarantino/Associated Press Serena Williams of the U.S. reacts after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Allessandra Tarantino/Associated Press Krystina Pliskova of the Czech Republic returns a shot against Serena Williams of the U.S. during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Michel Euler/Associated Press Serena Williams of the U.S. serves against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams recorded 13 aces in the match. Michel Euler/Associated Press PARIS--For all that has changed in the 16 months since Serena Williams last played in a Grand Slam tournament--she is now married and a mother--so much was familiar about her at the French Open on Tuesday. The fashion statement, this time in the form of a black bodysuit with a red belt that she said made her feel like a \"warrior princess.\" The cries of \"Come on!\" The big serves that provided 13 aces. The returns that eventually produced three consecutive breaks of serve. And, yes, the victory. Competing as a mom for the first time at a major, and only about nine months since giving birth to her daughter, Alexis Olympia, then dealing with postpartum complications, Williams edged 70th-ranked Kristyna Pliskova of the Czech Republic 7-6 (4), 6-4 at Roland Garros. Already a transcendent sports star and cultural icon, Williams now carries a new title: working mother. \"Well, my priority is Olympia. No matter what, that's my priority. I have given tennis so much, and tennis has actually given me a lot, and I couldn't be more grateful,\" Williams said. \"She's my priority, and I work everything around her.\" The 36-year-old American had not played in one of tennis's biggest tournaments since winning the Australian Open in January 2017 for her 23rd Grand Slam title, breaking a tie with Steffi Graf for the most in the professional era. Williams, the world found out later, was pregnant at the time. Her baby was born Sept. 1; Williams married Reddit co-founder Alexis Ohanian in November. Williams eventually revealed that she had an emergency cesarean section, then encountered trouble breathing afterward because of a pulmonary embolism and needed a follow-up operation. \"Just literally not sure if I was going to make it or not at several different times,\" Williams said. \"A lot of people have really reached out, because they have so many similar stories, too. I feel like a lot of people don't talk about it. They talk about the baby and how happy they are. But it's a lot that goes into it with the pregnancy and with giving birth, and it's called a\" miracle' for a reason. \"The first match of her comeback was in doubles alongside her older sister, Venus, for the U.S. Fed Cup team in February. She entered two tournaments in singles the next month, going 2-2. An absence of more than two months followed, until Tuesday in Paris. So a woman who has spent hundreds of weeks ranked No. 1 is currently No. 451 and unseeded at the French Open, a subject of some debate: Should her past success accord her the protection a seeding offers? Williams faces 17th-seeded Ash Barty of Australia next.\" She's a genuine champion, \"Barty said.\" What she's done to be able to get back...is a pretty amazing thing. \"Tuesday's return was striking, from Williams' powerful shots to her outfit, which called to mind the\" catsuit \"she wore at the 2002 U.S. Open. It was by far the most significant event of Day 3 at Roland Garros, even though there were so many other Grand Slam champions in action. Rafael Nadal finished off a rain-interrupted victory as he begins his try for a record-extending 11th French Open title. Maria Sharapova, a two-time champ in Paris, was pushed to three sets in a win. Garbine Muguruza, who beat Williams in the 2016 final at Roland Garros, beat another past champion, <mark>Svetlana Kuznetsova</mark>. All eyes were on Williams, though. On the fifth point, she delivered an ace at 112 mph. Moments later, the chair umpire intoned,\" Jeu, Madame Williams, \"--French for\" Game, Mrs. Williams, \"a change from the\" Mademoiselle \"used for unmarried female players. Pliskova, a lefty whose twin sister upset Williams in the 2016 U.S. Open semifinals, actually hit more aces, 15. That's the most anyone has hit against Williams since at least 2008, according to the WTA. Indeed, Williams appeared to have trouble reading Pliskova's serves early on. There were other blips, of the sort to be expected from someone who hasn't played lately. Williams double-faulted seven times. She had nearly as many unforced errors, 25, as winners, 29. But she is not simply skilled. She is smart, too, and she figured things out. After trailing 3-0 in the tiebreaker, she reeled off six points in a row. After falling behind 2-0 in the second set, Williams came up with a trio of service breaks. All was not perfect, of course. In the final game, Williams' right foot gave way as she sprinted toward the net and she landed on her backside. At least she was able to laugh at that as she went to the sideline to towel off. A spectator yelled:\" That's all right, Serena! You still look great! \"After months of worrying more about diapers than drop shots, of breastfeeding for what she called\" a really, really, really long time, \"of organizing her practice schedule around her newborn's nap schedule, Williams was back to doing what she's most famous for, in an arena where she earned trophies in 2002, 2013 and 2015. On Tuesday, she noted that she showed up at her news conference more promptly than she used to, so she could have more time to spend with Olympia.\" I don't want her to ever feel like I'm not around. I'm a super hands-on mom, \"Williams said.\" Maybe too much. \"A reporter wanted to know whether Williams believes she can win the title again.\" I'm definitely here to compete and do the best that I can do, obviously. I'm not putting any pressure on myself as I normally do, \"Williams began. Then, perhaps questioning her own words as she heard them, she paused, before adding with a laugh:\" I think deep down, we all know the answer to that. \"Serena Williams wins in Grand Slam return at French Open Serena Williams of the U.S. clenches her fist after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams won 7-6 (4), 6-4. Allessandra Tarantino/Associated Press Serena Williams of the U.S. reacts after scoring a point against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Allessandra Tarantino/Associated Press Krystina Pliskova of the Czech Republic returns a shot against Serena Williams of the U.S. during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Michel Euler/Associated Press Advertisement (1/1) Serena Williams of the U.S. serves against Krystina Pliskova of the Czech Republic during their first round match of the French Open tennis tournament Tuesday at the Roland Garros stadium in Paris. Williams recorded 13 aces in the match. Michel Euler/Associated Press"}, {"articleID": "2017100114_00613325_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Brian Jackson": ["Q16091880", "Q18276044", "Q19816341", "Q19948342", "Q2402879", "Q2924927", "Q4964166", "Q4964167", "Q4964169", "Q4964172", "Q4964173", "Q4964175", "Q4964177", "Q55163166"], "James Woods": ["Q193105", "Q2333487", "Q6145792"]}, "date": "2017-10-01", "url": "https://twitchy.com/samj-3930/2017/10/01/just-wow-late-night-with-jimmy-fallon-writer-says-trump-supporters-should-lose-their-kids/", "content": "So why is it that every time <mark>Trump</mark> says something that seems pretty unbearable, the Left jumps up and says something that makes him look almost bearable? <mark>Trump</mark> has indeed made some questionable remarks about Puerto Rico over the past few days, but wowza...these proggies just can't seem to stand being outdone in the awful department. Case in point: light reminder that being president of the US means nothing anymore, if you support <mark>Trump</mark> you should have your children taken away, etc etc--Jen Statsky (@ jenstatsky) October 1, 2017 Meet Jen Statsky. We didn't know who she was either until we did a Google search and found that she's been a writer for Parks and Recreation and Late Night with Jimmy Fallon. There were other shows listed but we've never heard of them so, eh. So, you're a fascist then. Got it. See you at the next election, where the non-fascists meet to make your life miserable .--Fuzzy Chimp (@ fuzzychimpcom) October 1, 2017 The fascist instinct sure is strong in those than claim to love democracy???--OutThere (@ SoSemiPrecious) October 1, 2017 \"but we're not fascists\" --Jen Statsky--Kinda Bored (@ lamblock) October 1, 2017 Trending Such a TOUGHIE: SNL's Michael Che calls <mark>Trump</mark> \"bitch' and a racial slur during triggered rant on PR\" The T-shirt Shack has reopened!' Where did San Juan's mayor get that custom-printed \"Help Us' shirt anyway? Funny how they are ok with people they disagree with politically having their lives destroyed and their freedoms taken away. And we don't mean funny\" ha ha,' we mean funny \"pathetic and fascist .'\" Its Sunday and I am feeling particularly needy, how can I best attention whore on this day of rest? \"--StuckinLAwithzombies (@ stucknLAwzmbies) October 1, 2017 Got our attention. Fair point. OK. I'm not a <mark>Trump</mark> supporter, but taking away the kids...that's a bit extreme .--<mark>Brian jackson</mark> (@ bjackson3030) October 1, 2017 And this is key, they're even turning people who aren't <mark>Trump</mark> supporters into his defenders, all but handing him re-election in 2020. Gosh, thanks Jen. Related: TFW Lauren Duca and her bully-brigade call <mark>Trump</mark> and his followers domestic terrorists Share on Facebook Share on Twitter Tags: <mark>Donald Trump</mark> Jen Statsky jimmy fallon recent stories Entertainment Just WOW: Late Night with Jimmy Fallon writer says <mark>Trump</mark> supporters should lose their kids Entertainment Mic DROP: <mark>James Woods</mark> SHREDS Sen.\" Bobby Kickback' Menendez for trash-talking <mark>Trump</mark> on PR Media PRIORITIES! Ana Navarro encourages Puerto Rico residents resettle in these states Please enable JavaScript to view the comments powered by Disqus."}, {"articleID": "2014060222_00094347_W", "names": {"Sam Keller": ["Q15438098", "Q7407734"]}, "date": "2014-06-02", "url": "http://www.idigitaltimes.com/articles/23280/20140602/ea-sports-ncaa-likeness-lawsuit-40-milliom-settlement.htm", "content": "EA Sports, NCAA Likeness Lawsuit: Proposed $40 Million Settlement, Current Student Athletes Eligible For Payouts [REPORT] Kahlil Thomas on June 2, 2014 11:38 AM EDT EA, along with the CLC, agreed to pay $40 million to current and former NCAA student athletes to resolve their end of the NCAA likeness lawsuit. The agreement has to be approved by the presiding judge in case. (Photo: Twitter/EA Sports) For the last four and a half years Electronic Arts, the NCAA and the Collegiate Licensing Company has been engaged in a lawsuit with Ed O'Bannon, <mark>Sam Keller</mark> and other current and former student athletes. At issue is the NCAA, along with EA and the CLC, using the likeness of the NCAA athletes without any type of reimbursement for the student-athletes themselves. While the NCAA continues to fight the claims of O'Bannon and <mark>Keller</mark>, EA and the CLC announced that the two companies and the student-athletes agreed in principle to a settlement in the lawsuit last year. In documents filed Friday night, the lawyers representing the players asked for the court to finally approve the settlement. With the settlement, over 100,000 current and former NCAA football and men's basketball players are included for possible payment from the $40 million deal made between the players, Electronic Arts and the CLC. This means that for the first time in history, current NCAA athletes could receive payment for using their likeness in a video game. Now while this settlement has been agreed to, this only represents the EA-CLC portion of the lawsuit. The O'Bannon suit against the NCAA is set to begin its trial on June 9 Now while NCAA rules makes it illegal for a current student athlete to profit off of their name and likeness while a student, something that happened to a very famous ex-college football player while he was still in school may have changed that rule and made this settlement possible. \"While in college, former Texas A & M quarterback Johnny Manziel sued a man who sold shirts using the football player's trademarked\" Johnny Football \"nickname. The NCAA said then it would allow Manziel to collect damages if his corporation's lawsuit won,\" wrote CBS Sports' Jon Solomon. \"That's one of the most interesting things is what's the NCAA going to say about eligible players?\" said Leonard Aragon, an attorney for the <mark>Sam Keller</mark> plaintiffs in the video game settlement. \"It's our opinion that it's the same thing here as Manziel. If someone stole your laptop, you'd be able to get payment and still be considered an amateur. Here, right of publicity is a property right.\" Back in September, EA cancelled their NCAA Football franchise while the lawsuit was still pending. This was after the SEC conference pulling out of the game also. \"Today I am sad to announce that we will not be publishing a new college football game next year, and we are evaluating our plan for the future of the franchise,\" said Cam Weber, GM of American Football from EA Sports on the company's site. \"This is as profoundly disappointing to the people who make this game as I expect it will be for millions who enjoy playing it ach year.\" \"We have been struck in the middle of a dispute between the NCAA and student-athletes who seek compensation for playing college football. Just like companies that broadcasts college games and those that provide equipment and apparel, we follow rules that are set by the NCAA - but those rules are being challenged by some student-athletes. The ongoing legal issues combined with increased questions surround schools and conference have left us in a difficult position - one that challenges our ability to deliver an authentic sports experience, which is the very foundation of EA Sports games.\" Rod Carey, another of <mark>Sam Keller</mark>'s lawyers, estimates that 7,000 players, or 20% of current college athletes in Division 1-A, are eligible for a payment from settlement. The payouts could range from $96 and $517 per roster year appearance, depending on the amount of claims made by players. A player who claims who appeared in four consecutive editions of EA Sports' NCAA Football games could receive thousands of dollars due the settlement. As of press time, the NCAA themselves are reviewing the terms of the agreement, which is the first time that a NCAA partner will reimburse student athletes for using their likeness. Here is what the named plaintiffs in the EA-CLC case will receive. - $15,000 to former Arizona State/Nebraska football player <mark>Sam Keller</mark> - $15,000 to former UCLA basketball player Ed O'Bannon - $15,000 to former Rutgers football player Ryan Hart - $5,000 to former West Virginia football player Shawne Alston - $5,000 to the remaining plaintiffs who were deposed - $2,500 for all other named plaintiffs In March, Judge Claudia Wilken ordered the NCAA and O'Bannon's lawyers to set June 9 th as the date that the case would go to trial. With EA and the CLC out of the lawsuit, pending Judge Wilken's approval, it seems that the NCAA are on an island by themselves in a case that could change the way things are done in college athletics...and it's about time. EA Is The Worst? NCAA Football Cancellation Not Court Ordered But Right Thing To Do NCAA Football 14 Review: EA Sports' New College Football Game May Be The Best Ever In The Series State Of Decay: Lifeline Solidifies Undead Labs Current Dominance Over Zombie-Survival Genre [REVIEW] Pokémon X And Y News: Delta Emerald Could Join Omega Ruby, Pokémon Alpha Sapphire According To Nintendo Trademark State Of Decay: Lifeline Solidifies Undead Labs Current Dominance Over Zombie-Survival Genre [REVIEW] Xbox One Vs PS4: Sony Might Not Exist By End Of Console War - International Digital Times Watch Dogs Wii U Release Date: So, Um, When IS Watch Dogs Coming To Nintendo? - International Digital Times Metroid Prime 4: Will Nintendo Announce A New Metroid Wii U Game From Retro At E3? - International Digital Times"}, {"articleID": "2010040715_00180554_W", "names": {"Andy Ford": ["Q22908472", "Q4760677"]}, "date": "2010-04-07", "url": "http://tallahassee.com/article/20100407/NEWS01/4070328/1010/NEWS01/Legislators-offer-alternatives-to-FCAT?GID=/+dT9KKNh+btf4Si0d/kpTTuJ39izHqDGAxNzPLwOj4%3D", "content": "the do-or-die mandate that high-school students pass the florida comprehensive assessment test before they graduate may become a thing of the past. and that sits well with godby high school student caroline maxwell. \"i personally don't like the fcat,\" caroline said. \"it does show me where i am, but there is so much pressure on the fcat that i freeze up.\" senate bill 6/hb 7189 passed in the senate and could pass in the house by the end of the week. the legislation subs end-of-course testing in place of the high-school portion of the fcat. the bill also calls for teacher pay to be based on how well their students perform on standardized tests. \"it is not being phased out, it is being revised,\" paul felsch, director of student assessment said of the new testing proposal. end-of-course testing is what it sounds like, a test at the end of a course rather than the more comprehensive fcat. if the bill passes, students taking algebra i could be taking the test as soon as next year. \"i think there is too much high-stakes testing when it comes to the fcat but at the same time i recognize if we didn't have the fcat we'd have some other kind of testing,\" leon county superintendent jackie pons said. \"the focus on education should not just be on testing.\" florida education association president <mark>andy ford</mark> said while schools are doing better on the fcat, the test has hurt the arts and physical education programs. \"it's created an environment where those things are luxuries,\" <mark>ford</mark> said. he believes end-of-course testing will give school districts the ability to broaden curriculum. you must fill out the comment body in order to submit a comment. copyright © 2010 use of this site signifies your agreement to the"}, {"articleID": "2013012221_00037920_W", "names": {"John Betts": ["Q16979833", "Q51097646"]}, "date": "2013-01-22", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=12qv6pnrk/*http://beta.fool.com/vamosrafa7/2013/01/22/will-champion-keep-winning-coffee-race/22379/?source=eogyholnk0000001", "content": "waqar is a member of the motley fool blog network--entries represent the personal opinions of our bloggers and are not formally edited. at the moment, the retail value of u.s. coffee market is a staggering $30-32 billion. with 20,366 stores in 61 countries, the american coffee giant,. given the fact that the restaurant industry isn't on a rise, what should we expect from starbucks in 2013? one dollar reusable cups starbucks is about to offer its customers $1 reusable plastic cups. according to the company, the customers would be served in the same cups (cups would be cleaned with boiling water) each time they bring them back. these cups were tested in 600 stores in the u.s. and would be introduced soon in the whole north american region. this comes as a part of? company's goal of serving 5% of all drinks in reusable cups by 2015. currently, starbucks is earning a gross margin of 11% on its sales, but with more competitors making inroads in the coffee market, the margins are bound to get smaller in the future. therefore, decreasing costs in the long run is of foremost importance to the company. most expensed restaurants in the u.s. when it comes to consumers' choice for coffee, starbucks still remains one of the favorite spots in the u.s., but the competitors are gradually bridging the gap. according to a travel and expense company, starbucks is one the favorite spots for employees when it comes to business travel. on average, employees expensed around 21,000 transactions at the company, with a bill of $7.54. the hamburger giant, mcdonald's grabs the second spot with 12,420 transactions and an average bill amounting to $6.73. while subway recorded a total of 8627 transactions, it had an average bill of $11.88 .? during the past few months, the lawmakers in the u.k. have severely criticized? starbucks for avoiding taxes in the country. as a result, the company has finally announced that it would pay taxes in excess of 10 million pounds in each of the next two years. starbucks has more than 700 stores in the u.k. and has been operating in the region for the last 14 years, yet it has paid only 8.6 million pounds in taxes. according to the company, it hasn't done anything illegal, as a foreign company doing business in europe is allowed to base itself anywhere in the 27 eu nations. the company has been paying royalties in netherlands, where it has established its headquarters. the matter of fact is that these new tax regulations in the u.k. will have a major effect on starbucks' cash flows. starbucks is earning a healthy 29% on its equity, plus a payout ratio of 47% depicts that the company is keen on returning money back to its shareholders. with far less cash on hand in 2013, it won't be easy for the company to grow its dividends like it did before (in 2012, company's dividends grew by 24%). starbucks is currently trading at a forward p/e (1yr) of 20.92 x and is yielding a dividend of 1.50% on its stock. though the industry's p/e is 30.62 x at the moment, starbucks should sell at a 5% discount to industry's p/e amid higher taxes in the u.k. according to the consensus estimates, starbucks should be selling at $62.80; hence, it has an upside potential of 14.6%. moreover, the mean target price from the sell side is $60.32, which means it's undervalued by 10%. mcdonald's starbucks' biggest competitor, mcdonald's, have started selling bags of ground coffee at its restaurants in canada. at the moment, its ground coffee is available at canada's 1400 stores. according to the company, if the coffee does well, it could spread throughout the world. mcdonald's has a habit of trying its new products in a specific region, before making it a worldwide product. same was the case with mccafe coffees, which were first launched in australia before being introduced in the u.s and europe. for the last couple of years, mcdonald's coffee has played a pivotal role in driving its revenues. as <mark>john betts</mark>, president of mcdonald's canada says \"if you want to be a credible player in the restaurant industry, you have to have a great cup of coffee.\" you can have a look at my detailed take on mcdonald's here. more and more retail food unders? tand the fact that coffees are an essential part of their business, which have a large room to grow in the future. as a result, starbucks is not only facing tough competition from mcdonald's, but also from the likes of burger king and wendy's. the recent addition of coffee frappes in burger king's menu has shown a lot of promise. moreover, wendy's have also started to test its specialty coffee in select markets. dunkin' brands group starbucks' second biggest competitor in the u.s. is dunkin' brands. at the moment, the company has more than 7,200 restaurants in the country. moreover, the company has plans of opening 15,000 restaurants in the u.s. in the next 20 years. the company has a long term goal of having more than 1000 restaurants in california. as part of this plan, the company has initially decided to open a series of restaurants in southern california. according to the company, it would also be opening chains in airports, casinos, military bases, universities and super markets. last year, the company opened 291 restaurants in the u.s and in 2013, the company plans on opening a further 350 restaurants. with a catchy tagline, \"america runs on dunkin,\" the company has been putting more emphasis on its coffee in the last few months. moreover, the company is marketing itself as a far less expensive brand than starbucks. dunkin's ceo, nigel travis said that the company would also increase its drive-thrus in california, as it can have a major effect on company's revenues. the company has already expanded itself in western states like nevada, arizona and colorado. vamosrafa7 has no position in any stocks mentioned. the motley fool recommends mcdonald's and starbucks. the motley fool owns shares of mcdonald's and starbucks. try any of our foolish newsletter services"}]