[{"date": "2018-06-15", "url": "http://kgun9.com/news/local-news/jesse-owens-park-makeover-nearly-complete", "content": "Jesse Owens Park makeover nearly complete 10:31 PM, Jun 14, 2018 Share Article Previous Next Ward 2 City Council member <mark>Paul Cunningham</mark> has high hopes for the future of Jesse Owens Park KGUN9 On Your Side Copyright 2017 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next TUCSON, Ariz. - It's been more than a year in the making, but Jesse Owens Park on Tucson's east side is nearly complete. While some parts are fenced off and still being renovated, much of the park has come back to life, like the baseball and softball fields. Debi Beatty, who's son plays on the field, feels that he can now play safely. \"They can play on that field without falling in holes,\" she said. \"It's great .\" About a year ago, Beatty approached her City Council representative, Ward 2's <mark>Paul Cunningham</mark>, and KGUN9 On Your Side, explaining she felt that the park was in a state of disrepair. Soon afterwards, the park began to transform. But this past April, well into renovations, Beatty didn't think the park would be ready for the summertime. \"No,\" she said. \"No. . Not at all .\" But now, with much of it usable, she's on board and pleased with the progress. \"They're really kicking some booty out here,\" Beatty said. \"I mean, look at the fields, they're awesome .\" <mark>Cunningham</mark> says this project was long overdue. \"It's really coming together,\" he said. \"There's no use in having a park if no one is going to use it .\" Once all of the pieces are complete, including the pool, parking lot, and basketball court, <mark>Cunningham</mark> has high hopes for the future of Jesse Owens Park. That being said, he is asking people in the area to be patient and stick to the parts that are totally complete for now, so that the grass will grow in well. \"Try to curb that use just a little bit longer, as the monsoon comes in and we get the benefit of the rain,\" <mark>Cunningham</mark> said. \"When we do re-open we'll have a lush, green park. I'm really excited about it and I think so is the neighborhood .\" The City Council member explained the nearly $2 million for the project came from seven different sources. <mark>Cunningham</mark> plans to have a soft re-opening for Jesse Owens Park sometime in August. Beatty plans to be there, and is looking forward to the future of the park. \"We all worked together, all came through. It's great,\" she said. \"This is just the beginning of what its going to be. It's amazing already, can you imagine it in another month?\" Copyright 2018 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2018061506_00153703_W", "names": {"Paul Cunningham": ["Q10518573", "Q23014437", "Q7150060", "Q7150061"]}}, {"date": "2018-06-18", "url": "https://en.dailypakistan.com.pk/pakistan/nadra-rejects-ptis-allegation-of-sharing-sensitive-data-with-pml-n/", "content": "ISLAMABAD--The National Database and Registration Authority (Nadra) has dismissed the allegation of providing sensitive information to the Pakistan Muslim League-Nawaz (PML-N) ahead of general elections. The denial from the authority came on Sunday after the Pakistan Tehreek-e-Insaf hurled accusations at NADRA chief, Yousaf Mubeen. A spokesperson for Nadra, in a statement issued on Sunday, said the allegations of corruption are fabricated and baseless, adding that the authority had a limited role in conducting elections, Radio Pakistan reported. \"The organisation is only providing technical assistance to the Election Commission of Pakistan (ECP) in accordance to the law and the Constitution,\" said the Nadra spokesperson. \"Nadra has not given data to any political party, whatsoever,\" he added PTI Chairman <mark>Imran Khan</mark> on Sunday directed his party leaders to file a petition against NADRA Chairman Usman Yousaf Mubeen before the Election Commission of Pakistan. PTI claims the NADRA chairman provided important data to the PML-N to grab victory in the upcoming general elections, and to that end, has decided to file a petition against him. A petition, prepared by the PTI, states the NADRA chief was appointed by the former government and hence, as long as he is there, free and fair elections will not be possible. Mobeen was reappointed as NADRA chairman for a period of three years in February this year after his earlier tenure ended. Facebook Twitter Reddit Follow Daily Pakistan", "articleID": "2018061806_00033939_W", "names": {"Imran Khan": ["Q155164", "Q15987686", "Q1660487", "Q17306146", "Q18351186", "Q18619306", "Q18637473", "Q18637525", "Q18637527", "Q18649030", "Q18687912", "Q18687913", "Q18687915", "Q18687916", "Q21061850", "Q27951129", "Q312781", "Q42560214", "Q43384689", "Q50064378", "Q51161844", "Q57064458", "Q59198528", "Q6008185", "Q6008187"]}}, {"date": "2018-06-20", "url": "http://www.journal-news.com/news/new-business-alert-bar-arcade-coming-hamilton/o9C1LOV66PoOL6z13ZZ7jL/", "content": "By Eric Schwartzberg, Staff Writer Share on Facebook Share on Twitter...More Reddit Pinterest Email HAMILTON--A Butler County business that creates virtual pinball machines is planning to move to a high-profile downtown Hamilton storefront and create a fun place to hang out while playing the classic game. MORE: You see the top level of a parking garage. Hamilton sees its next party space. VPcabs Virtual Pinball, will move this summer from Fairfield to a space that is three times larger at 113 North 3rd St., and work to introduce a separate \"barcade\" --a combination arcade, bar and restaurant--to the mix. \"I've had the amazing opportunity of being on Season 7 of Shark Tank and made a deal with (businessman and investor) Daymond John,\" said owner <mark>Brad Baker</mark>. \"Since then we've grown quite a bit and need more room. I was hoping to eventually be able to get more space, but none has come available where we're at .\" The business builds virtual, WiFi-ready pinball machines that can download thousands of games, giving home gamers the opportunity to play \"just about any pinball game ever made\" on one machine, he said. MORE: The wait for rooftop dining in Hamilton is over <mark>Baker</mark>, who also owns a home theater business, started VPCabs Virtual Pinball in 2013 by building the machines out of his garage, then moved to a Fairfield storefront in 2017. The extra space in the new Hamilton location means double the amount of manufacturing space for the pinball company's nine employees, which should help it expand its manufacturing into other video game-related areas, <mark>Baker</mark> said. The manufacturing portion of the business is expected to move to the new location, right next door to the George McDulin Parking Garage, in July and August. The arcade/bar portion of the business, tentatively named The Pinball Garage, should open there soon thereafter, he said. VPcabs Virtual Pinball manufactures four different machines, none of them coin-operated, with the vast majority purchased not by businesses but by individuals for home use. It typically sells between 300 to 500 machines each year, he said. MORE: Plan to enjoy a beer while strolling the streets in Hamilton? 5 rules to know about new outdoor drinking program <mark>Baker</mark> said he plans to purchase between 30 and 50 mechanical pinball machines to feature in the Pinball Garage alongside VPcabs' own creations. \"We really want this to be an old-school, retro pinball barcade concept where you can come in and play pinball games from the 1950s all the way up until...brand new mechanical pinball games,\" he said. The Pinball Garage name, if used, would be an homage to the storefront's configuration, which was home to Jim's Auto Service Store until that business moved to 1270 Clinton Ave. in Hamilton earlier this year. Recommended for you Recommended for you Recommended for you Most read 1 No trial date yet for Middletown teens charged with murder 2 Americana amusement park demolition nears 3 Bullet hits fire chief's vehicle after false alarm Share on Facebook Share on Twitter...More Reddit Pinterest Email", "articleID": "2018062013_00040277_W", "names": {"Brad Baker": ["Q22003274", "Q4953788"]}}, {"date": "2018-06-20", "url": "https://www.timesofisrael.com/jews-separated-from-families-during-holocaust-condemn-us-border-policy/", "content": "home page JTA--A group representing children hidden during the Holocaust slammed the US border policy of separating families seeking asylum. \"Separation of the family for us is probably the worst thing that ever happened to us,\" said Rachelle Goldstein, who was separated from her parents in Belgium when she wasn't even 3 years old. Goldstein, the co-director of the Hidden Child Foundation, and her husband, Jack, who also was separated from his parents as a child, appear in a video released Tuesday by the Anti-Defamation League. Get The Times of Israel's Daily Edition by email and never miss our top stories Free Sign Up The <mark>Trump</mark> administration's policy of separating migrant children from their parents at the southern US border has drawn criticism this week from across the political spectrum. More than 2,300 children have been separated from their parents, according to The New York Times. \"When you take a child away from the parents, from the home, from everything that they know, they are never the same,\" Goldstein said in the video, adding that many children separated from their parents during the Holocaust had still not overcome the trauma. \"Most hidden children are now in their late 70s, 80s, some are even 90, and they still think about it, and it still hurts, it still aches,\" she said. A boy from Honduras is shown being taken into custody by US Border Patrol agents near the US-Mexico Border near Mission, Texas, on June 12, 2018. (John Moore/Getty Images via JTA) The new policy dictates that every migrant who crosses the United States border illegally will be prosecuted and detained. Since children cannot be prosecuted with adults, they are reclassified as unaccompanied minors and taken away. <mark>Trump</mark> administration officials, including Attorney General Jeff Sessions, say it's a necessary measure to enforce border security. Since many of the migrants have ended up in detention centers and temporary shelters, some have compared the policy to Nazi-era actions. Sessions on Tuesday called those comparisons exaggerated. A broad spectrum of Jewish groups have spoken out against the policy, along with many other religious organizations. \"It's wrong, it's wrong,\" Goldstein said. \"How can this happen in the 21st century?\" read more: Jewish Times ADL Anti-Defamation League Holocaust immigration policy Holocaust survivors <mark>Donald Trump</mark> asylum seekers United States Facebook Twitter email Print 0 shares comments", "articleID": "2018062020_00164441_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2018-06-20", "url": "http://nbr.co.nz/article/wall-street-calm-us-drops-out-unhrc-ns-p-216462", "content": "Wall Street calm as US drops out of UNHRC <mark>Nathan Smith</mark> Thursday June 21, 2018 Play NBR radio on Wall Street was buoyed mostly by large NASDAQ gains as fears of a US/China trade war dissipate. Twenty-First Century Fox lifted 7.8% after Walt Disney, also up 0.7%, increased its offer for some of Fox's assets to $US71 .3 billion, hoping to muscle Comcast's recent bid. PayPal shares also rose after the company agreed to acquire financial-technology company Hyperwallet Systems for $US400 million. Elsewhere, although the S & P tech sector was 0.7% higher, Facebook rose 2.8%, Alphabet advanced 1.5% and Amazon.com climbed 1.4%. Shares in those companies have been relatively unaffected by trade worries. The Dow Jones Industrial Average fell 15.7 points, or 0.06%, to 24,684.51, the S & P 500 gained 8.69 points, or 0.31%, to 2,771.28 and the Nasdaq Composite added 74.08 points, or 0.96%, to 7,799.67. The S & P 500 almost broke a three-session losing streak, as gains in media stocks helped send the consumer discretionary sector up 0.7%. Shares in Boeing, which has acted as a proxy for trade fears, rose 0.8% after six straight declines keeping the Dow almost unchanged. The aerospace company was considering plans of a new mid-market jet that could enter service in 2025. Among those which dipped, shares of Starbucks fell 9.2% after it said it would close 150 US stores in its 2019 fiscal year, while Oracle dropped 6.4% after warning currency conversions would weaken the company's quarterly performance. The yield on the benchmark 10-year US Treasury yield edged up to 2.924%, from 2.893%. Federal Reserve Chairman Jerome Powell says sturdy US economic growth has built a strong case for continuing to gradually lift interest rates. US out of UNHRC \"For too long, the [UN] Human Rights Council has been a protector of human rights abusers, and a cesspool of political bias,\" US ambassador to the UN Nikki Haley the 47-member Council based in Geneva. Ms Haley cited the Council's \"chronic anti-Israel bias,\" and says she had warned a year ago that the US would leave if the council failed to kick out human rights abusers and continue to discuss Israel's treatment of Palestinians at every meeting. Ms Haley then announced the US will leave the council. \"We take this step because our commitment does not allow us to remain a part of a hypocritical and self-serving organisation that makes a mockery of human rights,\" adding that the decision \"is not a retreat from human rights commitments .\" Ms Haley highlighted says the council has passed more resolutions against Israel than the \"number passed against North Korea, Iran and Syria combined,\" condemning the \"disproportionate\" focus. The Israeli Prime Minister Benjamin Netanyahu praised the US decision against \"this prejudiced body\" in a message on Twitter yesterday. The Democratic Republic of Congo's election to Council membership in the past year was one of the final straws for the Trump administration, Ms Haley explained, adding that the US would be \"happy to rejoin\" if the body reforms. \"The Secretary-General [António Guterres] would have much preferred for the United States to remain in the Human Rights Council,\" the spokesperson for the UN chief said in a statement. <mark>Kim</mark> and Xi talks North Korean leader <mark>Kim Jong-un</mark> is on the second day of his visit to China, having been greeted by Chinese President Xi Jinping yesterday. Mr Xi says he hopes Pyongyang and Washington would be able to implement fully the outcome of last week's nuclear summit in Singapore, where Mr <mark>Kim</mark> pledged to work toward denuclearisation in return for US security guarantees. He also praised <mark>Kim</mark> for the \"positive\" outcome of the summit, adding that \"the Chinese people's friendship for the North Korean people will not change, and China's support for socialist North Korea will not change .\" For his part, Mr <mark>Kim</mark> reportedly promised to cooperate with Chinese officials to secure \"true peace\" in the process of \"opening a new future\" on the Korean Peninsula. South Korean President Moon Jae-in urged Pyongyang to produce a plan for concrete steps toward denuclearisation raising pressure on Mr <mark>Kim</mark> during his Beijing visit. Mr Moon remarked that \"it's necessary for North Korea to present far more concrete denuclearisation plans, and I think it's necessary for the United States to swiftly reciprocate by coming up with comprehensive measures .\" US and South Korean officials are hoping the suspension yesterday of a major joint military exercise will help solidify nuclear negotiations with the DPRK. And North Korea could begin the process of handing over the remains of troops missing in the Korea war in the next few days, including those of US soldiers. Cambridge Analytica denies tampering Aleksandr Kogan, the British professor at the centre of the Cambridge Analytica data scandal, denied that the user data he provided to the firm helped in targeting voters during the 2016 US election. \"I believe there is almost no chance this data could have been helpful to a political campaign--and I still have not seen any evidence to indicate that the Trump campaign used this dataset to micro-target voters,\" Dr Kogan told the Senate Commerce subcommittee on consumer protection. However, Cambridge Analytica whistleblower Christopher Wylie says he was aware of efforts by the firm to reduce voter engagement and turnout among certain demographic groups. Mr Wylie says he \"was aware of various projects where voter suppression\" was discussed at the firm, including efforts to \"demotivate turnout\" by certain \"target groups,\" primarily African Americans. Violence in Israel A major escalation of violence flared up overnight between Israel and the militants in the Gaza Strip after Hamas fired a volley of rockets at Israeli territory, leading the Israeli military to target 25 Palestinian militant Hamas group positions in Gaza. Israel's Iron Dome defence system intercepted seven of the 45 rockets fired into Israel, and there have been no immediate official reports of deaths or injuries from the militant attacks. The escalation started shortly after Israel carried out strikes against three Hamas sites in response to Palestinians flying fire kites and balloons over the Gaza border, which have caused significant damage to Israeli territory.", "articleID": "2018062020_00370523_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"], "Nathan Smith": ["Q18088901", "Q1966636", "Q1966650", "Q24005445", "Q24663895", "Q27448076", "Q30123019", "Q6969340", "Q6969341", "Q6969342"]}}, {"date": "2018-06-21", "url": "http://tampabay.com/florida-politics/buzz/2018/06/21/youth-care-worker-overseeing-kids-seized-at-border-has-pending-felony-drug-charges/", "content": "The Buzz Youth care worker overseeing kids seized at border has pending felony drug charges \"People with open criminal cases should not be watching children that we have in holding facilities in our country,\" said Circuit Judge Jeri B. Cohen. \"I think it's a disgrace .\" The entrance for the Homestead Temporary Shelter for Unaccompanied Children on Monday, June 18, 2018. Ellis Rua | [email protected] By Carol Marbin Miller 24 minutes ago During the day, Franky Santos attends meetings for people trying to get clean, occasionally performs community service, and appears regularly before the Miami judge who oversees the county's Drug Court. At night, he's a caregiver for immigrant children being held at a Homestead shelter. As controversy continues to swirl over the Trump administration's immigration policy--even after it walked back a decision to separate undocumented immigrant children from their parents and house them in shelters--a new question looms: Who's minding the kids? Though children's advocates and human rights groups have criticized the administration's decision to house even small children in shelters--some of which include chain-link fencing likened to cages--Attorney General Jeff Sessions and other administration officials have insisted that the youngsters are well-cared for. In Homestead, it turns out, some of the youngsters are, or were, being cared for by a 38-year-old man who is in Miami-Dade's Drug Court facing pending felony drug possession charges. On Monday, Franky Santos appeared before Circuit Judge Jeri B. Cohen, who is overseeing his case in drug court. Santos told the judge he had just been hired as a \"lead youth care worker\" at the U.S. Department of Health and Human Services' compound in Homestead. \"I watch over the children,\" he said, to \"make sure they don't sneak off or go anywhere where they're not supposed to .\" The judge, who had presided over child welfare cases for more than a decade, appeared to be surprised at Santos' new job. \"People with open criminal cases should not be watching children that we have in holding facilities in our country,\" she said. \"I think it's a disgrace .\" \"I'm just shocked, although I shouldn't be,\" she added. Santos said he works at the Homestead Temporary Shelter for Unaccompanied Children, a 1,000-bed center for children who have entered the U.S. without permission. The shelter was shuttered last year when the number of unaccompanied youths being held there declined. But it was reopened in recent weeks just as the Trump administration announced it would hold children separately from their families if the parents faced criminal prosecution for illegal entry. The administration's decision, reversed Wednesday, to separate children from their parents drew harsh rebukes from civil rights groups and children's advocates, especially after it was revealed that children at a Texas shelter were being housed within chain-link fencing that critics said resembled cages. <mark>George Sheldon</mark>, a former secretary of the Florida Department of Children & Families who now heads Miami's private foster care agency, Our Kids, called the policy \"obscene .\" \"There's no word I can use to describe what I think is an extremely inhumane policy,\" <mark>Sheldon</mark> added. Said U.S. Rep. Charlie Crist: \"This is indefensible. Stunning and disappointing, to say the least .\" \"I know the president signed what appears to be a reversal, but there are a lot of problems still left hanging, sadly,\" the St. Petersburg Democrat said Thursday. \"Where are the 2,300 children that were already removed, and how will they be returned. And, obviously, some of the employees watching them may be questionable. It's one thing after another after another. When you launch a bad policy, it only gets worse. This is a nightmare for our country, but, most importantly, for these children .\" The administration had defended the practice, and leaders at the Justice Department, Homeland Security and elsewhere insisted youngsters were well-cared for. \"It is important to note that these minors are very well taken care of--don't believe the press,\" Homeland Security Secretary Kirstjen Nielsen told the National Sheriff's Association, while addressing reports of substandard treatment of minors. And although the Trump administration says it will no longer separate children from their parents at the border, immigrant advocates insist it will be difficult to reunify the more than 2,000 children who already are held in shelters after being removed from their families. It's impossible to say whether the private company that operates the Homestead shelter was aware of Santos' legal troubles and hired him anyway--as Santos claimed in court--or failed to perform a background check. Comprehensive Health Services Inc., which operates the Homestead shelter under contract with the U.S. Department of Health & Human Services, declined to comment, referring questions to HHS. A spokesman for HHS, which oversees the youth shelters, did not reply to requests from the Miami Herald to discuss the Homestead shelter. <mark>Sheldon</mark> oversaw the development of shelters for immigrant children beginning in 2012, when he was assistant secretary at the U.S. Administration for Children & Families at HHS under the Obama administration. He said the contracts his agency inked required providers to vet the men and woman who were in caregiver roles with children. \"This raises the question of how good their background screening is,\" <mark>Sheldon</mark> said. \"There have got to be federal regulations in that contract .\" Comprehensive Health Services, which is one of the largest providers of workforce medical services, has been criticized in the past for its performance while under contract with U.S. government agencies. Last year, the Justice Department announced CHS had agreed to pay the U.S. government $3.8 million to settle a complaint under the False Claims Act that it had double-billed and mischarged the Internal Revenue Service as part of a contract to provide medical services to IRS criminal investigation agents. The Justice Department said CHS double-billed for vision screenings, electrocardiograms and blood tests between April 2009 and April 2014. \"Businesses that knowingly overcharge the government should be held accountable and penalized,\" then-U.S. Attorney Rod Rosenstein said. The top federal prosecutor in Baltimore at the time, Rosenstein now is deputy attorney general. In 2012, an Arkansas man and woman sued a subsidiary of CHS, claiming they'd been fired by the company after they complained that the subsidiary had provided \"substandard care\" to personnel at Sather Air Force Base, now known as Baghdad Diplomatic Support Hospital, in Iraq as part of a contract with the U.S. State Department. In their lawsuit, the two claimed a man died after a \"critical care practitioner\" botched the insertion of a breathing tube. The lawsuit was later settled. In August of last year, Santos was pulled over for speeding in Key Largo when an officer smelled what he thought was marijuana in Santos' Jeep. An officer found more than 20 grams of the drug in a gym bag in Santos' trunk. Santos agreed to enter drug court, and his case was transferred to Miami-Dade County. Other arrests included a 2008 misdemeanor marijuana charge, for which adjudication was withheld, a 2008 misdemeanor loitering charge, which was dropped, and a 2012 misdemeanor domestic battery charge, which also was dropped. At a hearing Monday, Santos was upbeat when asked how he was doing. \"I'm doing great,\" he said. \"I just recently got a new job for the government .\" Santos said he was overseeing children aged 12-17 who were detained at the U.S. border. \"It's not a public thing,\" he said. \"I'm not even really supposed to talk about it .\" Training for the job consisted of \"an orientation class,\" Santos said. \"It's like a daycare,\" he added. \"They just want you to observe the children, make sure that they're not...acting crazy or just being rude or--they just want to keep control and make sure that they're not doing anything out of the usual .\" Santos said the company was aware he was facing felony drug charges when it hired him. A representative of the county's drug court program said in court that Santos had tested positive for marijuana on Monday--not his first failed test, court records show. . Santos said the test was picking up marijuana he had smoked in mid-April, but Cohen said the substance would not be detected after so many weeks. \"No, that's impossible,\" the judge said. \"Marijuana doesn't stay in the system 60 days .\" \"Can you give me two weeks, and I will come up clean?\" Santos asked. \"I just want you to be honest,\" the judge replied. It's unclear whether Santos still has the job at the Homestead shelter; Cohen said in court he should quit and look for another job that doesn't entail caring for children. Before concluding the hearing, Cohen offered her opinion on the government's system for overseeing kids: \"The United States government should be hanging its head in shame,\" she said. It's \"disgusting that they would hire someone with an open felony to watch children .\" Herald writer Aaron Leibowitz and researcher Monika Z. Leal contributed to this report. Sign up for the Daily Buzz newsletter Get the top five stories from the Tampa Bay Times political team emailed to you Monday-Friday at 3p. m. Enter your email address", "articleID": "2018062117_00080312_W", "names": {"George Sheldon": ["Q16980854", "Q5544490"]}}, {"date": "2018-06-21", "url": "https://www.brainerddispatch.com/sports/hockey/4463330-barry-trotz-named-islanders-head-coach-three-days-after-resigning-capitals", "content": "Barry Trotz named Islanders' head coach three days after resigning from Capitals Barry Trotz named Islanders' head coach three days after resigning from Capitals By Washington Post Today at 2:25 p.m. Barry Trotz did not wait long to land his next coaching job, signing with the Islanders. Washington Post photo by <mark>John McDonnell</mark> Barry Trotz resigned from the Washington Capitals on Monday, June 18, just 11 days after he and the team won the franchise's first Stanley Cup. He was spotted wearing a suit at the Newark airport later that afternoon, fueling speculation he was meeting with the New York Islanders, the only team that had a head-coaching vacancy. Three days later, Trotz became the Islanders' new coach while the Capitals have yet to name his replacement. Once Washington accepted Trotz's resignation, there were no restrictions on where he could coach, and his move to a Metropolitan Division opponent the Capitals will play at least four times a year stings. Trotz and Washington's split was largely related to financial differences; Trotz asked for a five-year term with a $5 million annual salary, a significant bump from the $1.5 million he was reportedly making each of the past four years with the team. MacLellan said the term especially was \"a sticking point\" because it would have secured Trotz as coach of the Capitals for nine seasons, and that kind of tenure with a team is rare. \"It's a long time and a lot of money to be committing to a coach,\" MacLellan said Monday. \"There are probably four guys that are making that money, so it's the upper echelon. It's the big-revenue teams .\" New York and new general manager Lou Lamoriello got closer to Trotz's price with a deal believed to be in the neighborhood of $20 million for five years, according to Sportsnet's Elliotte Friedman. The Islanders have missed the playoffs the past two seasons, but New York was one the highest-scoring teams in the league last season. Hiring Trotz, the fifth-winningest coach all time, will likely be part of the team's pitch for retaining pending free agent center <mark>John Tavares</mark>. Known for coaching good defensive structure, Trotz could help a team that allowed the most goals in the league last season. The Islanders are also considered a possible trade destination for Capitals goaltender Philipp Grubauer. Washington superstars Alex Ovechkin and Nicklas Backstrom expressed disappointment over Trotz's resignation Wednesday night at the NHL Awards in Las Vegas, but both wished him well and praised his positive impact on them. \"Something you can't take away from Barry is what he's done to this team,\" Backstrom said. \"Him and the coaching staff has been doing a tremendous job to just get us together. He's been schooling us good these four years, and we got a good finish out of it...Hopefully there's no hard feelings. He's always going to be remembered in Washington as a champion, which is great, which he deserves .\" Said Ovechkin: \"He's been very good for me. We've been back and forth all the time, you know? He was hard on me. He give me very good advice because he have experience and that's the whole thing. When the coach know who you are and know how to use you, you just feel great .\" Along with the franchise's first Stanley Cup, Trotz guided the Capitals to back-to-back Presidents' Trophy-winning seasons and three division titles. Washington advanced to the second round of the playoffs in all four seasons he was with the team. Though MacLellan said there's no time frame to name Trotz's replacement, Capitals associate coach Todd Reirden is the overwhelming favorite to get the job, and that Washington seemed to be grooming him for the role for the past year created tension in the relationship between Trotz and the organization. Assistant coach Lane Lambert and Capitals director of goaltending Mitch Korn had followed Trotz to Washington from their previous stop in Nashville, and it's likely they will now join him in New York. Story by Isabelle Khurshudyan. Khurshudyan covers the Washington Capitals. A University of South Carolina graduate, she has worked at The Washington Post since 2014, previously reporting on high school sports and local colleges. Additional Articles Recommended by Brainerd Dispatch", "articleID": "2018062120_00151114_W", "names": {"John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "John Tavares": ["Q537353", "Q6260293"]}}, {"date": "2018-06-23", "url": "http://www.avclub.com/?startTime=1529690400772", "content": "The A.V. Club - Pop culture obsessives writing for the pop culture obsessed. The A.V. Club Go to permalink Bad Witch is a thin, if rewarding, listen from Nine Inch Nails; while Kamasi Washington's cinematic soul-jazz is more ambitious than ever on the awe-inspiring Heaven And Earth; and Gang Gang Dance turn in a somewhat too-impeccable sixth LP with Kazuashita. These, plus Martyn and The Orb in this week's notable new...View on Kinja Deals | The Inventory Go to permalink In his new film, <mark>Paul Rudd</mark> plays Moe Berg, a Major League Baseball veteran who joined the Office Of Strategic Services as a spy in World War II to thwart Germany's attempt at a nuclear weapon. At the premiere of the film, we spoke with <mark>Rudd</mark> about the role. The Catcher Was A Spy Go to permalink A - After the mystical and enigmatic happenings in The Defenders, it's a real treat to return to the down-to-earth setting of Luke Cage. The subject matter feels familiar; the thrilling chess game of the underworld, dirty cops, drugs, stylish musical performances, and jazz and that's a good thing. The season two premiere...Go to permalink Welcome back to, where we throw out a question for discussion among the staff and readers. Consider this a prompt to compare notes on your interface with pop culture, to reveal your embarrassing tastes and experiences, and to ponder how our diverse lives all led us to convene here together. Got a question you'd AVQ & A...Go to permalink There are a handful of things that the average person knows about lobsters. They're an expensive thing to order at a restaurant. According to cartoons, they'll pinch the hell out of you. Jordan Peterson seems weirdly fixated on them. But, did you know that, technically speaking, lobsters can live forever? For a brief...Go to permalink Netflix stood by Jeffrey Tambor in the wake of his firing from Amazon's Transparent on sexual misconduct charges, but Paramount--perhaps after seeing the complete media shitshow currently swirling around Tambor and Arrested Development--is taking no such chances. reports that the studio has booted Tambor from...The Wrap Go to permalink Variety reports NBC has canceled the sci-fi drama. No, you're not experiencing déjà vu--it's just that a little more than a year after the network reversed its own decision to cancel the series from Eric Kripke and Shawn Ryan, NBC has decided once more that time's up for Timeless. Timeless Go to permalink The Weather Channel, it would seem, has received a bunch of money and decided to spend it on creating a cyberpunk-style postmodern augmented reality nightmare called Immersive Mixed Reality. Here Meteorologist Jim Cantore plays the role of Hiro Protagonist, as reality melts away and a furious tornado lays siege to The...Go to permalink Sometimes it's the simple things in life that bring the most joy--the smell of a freshly blooming wild flower on a spring day; a cup of coffee in the early morning hours; notorious blowhard Piers Morgan trying to make fun of someone on TV and inadvertently embarrassing himself instead. Shared from The Takeout Go to permalink Hey Salty, I live in a foodie-friendly city that allows my burger-loving heart (philosophically, not physically) to try out a new burger joint almost every week. I'm not terribly picky, and love trying out specialty burgers. If there's an item that I'm not super fond of, I'll usually try it anyway to see if they can...Go to permalink The Terror, AMC's first foray into the anthology-series trend, has been a big success for the network, ending its first season as the No. 2 drama on cable and earning high marks from critics like The A.V. Club's own Sean T. Collins, who gave all but one episode a stellar \"A\" rating. (Episode two got an \"A - .\" ) So,...Go to permalink The Dora Milaje are a household name after the massive success of Ryan Coogler's Black Panther. Now, Wakanda's group of elite warrior women is stepping into the spotlight in a Wakanda Forever trio of one-shots teaming these female fighters with Marvel's most popular heroes. Writer Nnedi Okorafor wrote a fantastic...View on Kinja Deals | The Inventory Go to permalink Need to get caught up before you see Jurassic World: Fallen Kingdom? All four films (including the semi-recent Jurassic World) are down to just $17 in one awesome Blu-ray set, complete with two discs full of bonus features, and even digital copies. Advertisement Go to permalink Introducing his Thursday interviewee (or \"opponent,\" as his ironic blowhard calls them), Jordan Klepper mentioned that all the proceeds from comedian Cameron Esposito's new standup special are going to charity. \"Comedy doing good in the world?,\" Klepper's pompous pundit asked incredulously, \"I just don't see it .\" But,...Go to permalink This month marks the 25th anniversary of Sleepless In Seattle, which reunited Meg Ryan with her co-star Tom Hanks. Well, kind of. While some rom-coms end in a kiss, some end in a wedding, and some don't offer a romantic happy ending at all, Sleepless In Seattle is something even more unique: a...Joe Versus The Volcano Go to permalink A dark-ish secret of the entertainment industry is that a major factor in big awards like the Oscars and Emmys is the advertising campaigns that try to get voters' attention. The idea is that if a voter gets a huge stack of critically acclaimed TV show episodes with no guidance, they might be so crippled by the huge...Go to permalink <mark>Edgar Wright</mark> movies tend to land somewhere between \"really good\" and \"great,\" so it's always a big deal when word starts to spread about whatever his next project will be. Will he reunite with Simon Pegg and Nick Frost for another brilliant genre satire? Will he make something wholly unique like Scott Pilgrim Vs. The...Go to permalink A - Pardon me while I catch my breath, because this is the most intense reunion ever held on RuPaul's Drag Race. I was expecting fireworks when all the queens got back together, particularly with The Vixen in the mix, but I couldn't have foreseen just how incendiary this episode would get. The elimination of The Vixen...More from The A.V. Club", "articleID": "2018062311_00047099_W", "names": {"Edgar Wright": ["Q21552520", "Q37979146", "Q522057"]}}]