[{"date": "2018-06-23", "url": "http://www.avclub.com/?startTime=1529690400772", "content": "The A.V. Club - Pop culture obsessives writing for the pop culture obsessed. The A.V. Club Go to permalink Bad Witch is a thin, if rewarding, listen from Nine Inch Nails; while Kamasi Washington's cinematic soul-jazz is more ambitious than ever on the awe-inspiring Heaven And Earth; and Gang Gang Dance turn in a somewhat too-impeccable sixth LP with Kazuashita. These, plus Martyn and The Orb in this week's notable new...View on Kinja Deals | The Inventory Go to permalink In his new film, <mark>Paul Rudd</mark> plays Moe Berg, a Major League Baseball veteran who joined the Office Of Strategic Services as a spy in World War II to thwart Germany's attempt at a nuclear weapon. At the premiere of the film, we spoke with <mark>Rudd</mark> about the role. The Catcher Was A Spy Go to permalink A - After the mystical and enigmatic happenings in The Defenders, it's a real treat to return to the down-to-earth setting of Luke Cage. The subject matter feels familiar; the thrilling chess game of the underworld, dirty cops, drugs, stylish musical performances, and jazz and that's a good thing. The season two premiere...Go to permalink Welcome back to, where we throw out a question for discussion among the staff and readers. Consider this a prompt to compare notes on your interface with pop culture, to reveal your embarrassing tastes and experiences, and to ponder how our diverse lives all led us to convene here together. Got a question you'd AVQ & A...Go to permalink There are a handful of things that the average person knows about lobsters. They're an expensive thing to order at a restaurant. According to cartoons, they'll pinch the hell out of you. Jordan Peterson seems weirdly fixated on them. But, did you know that, technically speaking, lobsters can live forever? For a brief...Go to permalink Netflix stood by Jeffrey Tambor in the wake of his firing from Amazon's Transparent on sexual misconduct charges, but Paramount--perhaps after seeing the complete media shitshow currently swirling around Tambor and Arrested Development--is taking no such chances. reports that the studio has booted Tambor from...The Wrap Go to permalink Variety reports NBC has canceled the sci-fi drama. No, you're not experiencing déjà vu--it's just that a little more than a year after the network reversed its own decision to cancel the series from Eric Kripke and Shawn Ryan, NBC has decided once more that time's up for Timeless. Timeless Go to permalink The Weather Channel, it would seem, has received a bunch of money and decided to spend it on creating a cyberpunk-style postmodern augmented reality nightmare called Immersive Mixed Reality. Here Meteorologist Jim Cantore plays the role of Hiro Protagonist, as reality melts away and a furious tornado lays siege to The...Go to permalink Sometimes it's the simple things in life that bring the most joy--the smell of a freshly blooming wild flower on a spring day; a cup of coffee in the early morning hours; notorious blowhard Piers Morgan trying to make fun of someone on TV and inadvertently embarrassing himself instead. Shared from The Takeout Go to permalink Hey Salty, I live in a foodie-friendly city that allows my burger-loving heart (philosophically, not physically) to try out a new burger joint almost every week. I'm not terribly picky, and love trying out specialty burgers. If there's an item that I'm not super fond of, I'll usually try it anyway to see if they can...Go to permalink The Terror, AMC's first foray into the anthology-series trend, has been a big success for the network, ending its first season as the No. 2 drama on cable and earning high marks from critics like The A.V. Club's own Sean T. Collins, who gave all but one episode a stellar \"A\" rating. (Episode two got an \"A - .\" ) So,...Go to permalink The Dora Milaje are a household name after the massive success of Ryan Coogler's Black Panther. Now, Wakanda's group of elite warrior women is stepping into the spotlight in a Wakanda Forever trio of one-shots teaming these female fighters with Marvel's most popular heroes. Writer Nnedi Okorafor wrote a fantastic...View on Kinja Deals | The Inventory Go to permalink Need to get caught up before you see Jurassic World: Fallen Kingdom? All four films (including the semi-recent Jurassic World) are down to just $17 in one awesome Blu-ray set, complete with two discs full of bonus features, and even digital copies. Advertisement Go to permalink Introducing his Thursday interviewee (or \"opponent,\" as his ironic blowhard calls them), Jordan Klepper mentioned that all the proceeds from comedian Cameron Esposito's new standup special are going to charity. \"Comedy doing good in the world?,\" Klepper's pompous pundit asked incredulously, \"I just don't see it .\" But,...Go to permalink This month marks the 25th anniversary of Sleepless In Seattle, which reunited Meg Ryan with her co-star Tom Hanks. Well, kind of. While some rom-coms end in a kiss, some end in a wedding, and some don't offer a romantic happy ending at all, Sleepless In Seattle is something even more unique: a...Joe Versus The Volcano Go to permalink A dark-ish secret of the entertainment industry is that a major factor in big awards like the Oscars and Emmys is the advertising campaigns that try to get voters' attention. The idea is that if a voter gets a huge stack of critically acclaimed TV show episodes with no guidance, they might be so crippled by the huge...Go to permalink <mark>Edgar Wright</mark> movies tend to land somewhere between \"really good\" and \"great,\" so it's always a big deal when word starts to spread about whatever his next project will be. Will he reunite with Simon Pegg and Nick Frost for another brilliant genre satire? Will he make something wholly unique like Scott Pilgrim Vs. The...Go to permalink A - Pardon me while I catch my breath, because this is the most intense reunion ever held on RuPaul's Drag Race. I was expecting fireworks when all the queens got back together, particularly with The Vixen in the mix, but I couldn't have foreseen just how incendiary this episode would get. The elimination of The Vixen...More from The A.V. Club", "articleID": "2018062311_00047099_W", "names": {"Paul Rudd": ["Q276525", "Q7153351"]}}, {"date": "2018-06-24", "url": "https://steelerswire.usatoday.com/2018/06/24/mike-tomlin-continues-to-praise-rookie-conditioning-in-minicamp/?src=rss", "content": "Mike Tomlin continues to praise rookie conditioning at minicamp Mike Tomlin continues to praise rookie conditioning at minicamp By: Curt Popejoy | 22 hours ago Last season, there were some significant keys to why the 2017 rookie class saw the field as quickly as they did for the Pittsburgh Steelers. Head coach Mike Tomlin praised players like safety <mark>Sean Davis</mark> and wide receiver JuJu Smith-Schuster for the level of conditioning they showed up with and pointed to that as the reason he and the Steeler's coaches were able to integrate them into the team as quickly as they did. And this season another rookie is drawing that rare praise from Tomlin for his conditioning. Wide receiver <mark>James Washington</mark> has always had the reputation of being a workhorse and maintaining a high level of conditioning. Tomlin spoke on Steelers Nation Unite and talked about why <mark>Washington</mark> is getting plenty of reps in minicamp. \"He's absorbing a lot of reps during our work right now, and he's getting those reps because he's in good shape,\" Tomlin said. \"If he wasn't in as good as condition, he wouldn't be able to get those things. There's consequences of not being in condition .\" The Steelers are counting on <mark>Washington</mark> to fill the void created by the trade of Martavis Bryant. If he cannot, Pittsburgh should strongly consider signing Eli Rogers back, assuming he's healthy. Slot receiver is vital to the success of this offense. If <mark>Washington</mark> can win the No. 3 spot it gives the Steelers the freedom to rotate three guys into it, which creates natural mismatches.", "articleID": "2018062515_00150541_W", "names": {"James Washington": ["Q27915139", "Q4111278", "Q48841117"], "Sean Davis": ["Q19867419", "Q24005664", "Q3476712", "Q37390205", "Q58148906", "Q74305"]}}, {"date": "2018-06-27", "url": "https://www.financialexpress.com/entertainment/amazon-prime-video-to-stream-superstar-rajinikanth-starrer-kaala-soon/1222768/", "content": "Amazon Prime Video to stream superstar Rajinikanth starrer Kaala soon Amazon Prime Video to stream superstar Rajinikanth starrer Kaala soon Amazon Prime Video will soon stream on its platform superstar Rajinikanth-starrer Kaala, a top company executive said today. By: PTI | Published: June 27, 2018 8:47 PM Rajinikanth-starrer Kaala Amazon Prime Video will soon stream on its platform superstar Rajinikanth - starrer Kaala, a top company executive said today. \"Kaala will be on our platform for streaming soon, probably in next two months or so...the film will be available for customers,\" Amazon Prime Video India Director and Head (Content) Vijay Subramanian told PTI here. \"Kaala will connect with customers across languages because Rajinikanth is such a popular star not only in India, but also globally,\" he said. Subramanian is in the city for the release of the trailer of their new Prime Original series Comicstaan. Produced by Only Much Louder (OML) and hosted by comedians Abish Mathew and Sumukhi Suresh, Comicstaan is a talent hunt to discover Indias next big comedic talent. Replying to a query, Subramanian said he did not foresee any disruption taking place in television serials due to webserials. \"There are creative people like Karan Johar, <mark>Salman Khan</mark>, who are associated with online entertainment streaming platforms. They also are doing work on television and big screens too,\" he said. \"I don't see any disruption in television serials. In fact, it will complement each other due to the sheer opportunity it offers to both types of entertainment-seekers,\" he added.", "articleID": "2018062716_00027881_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}, {"date": "2018-06-28", "url": "http://www.shropshirestar.com/news/uk-news/2018/06/28/british-second-world-war-pilots-family-visit-scene-of-spitfire-crash-in-ireland/", "content": "British Second World War pilot's family visit scene of Spitfire crash in Ireland UK News | Published: Less than an hour ago The Spitfire crashed because of massive engine failure during a flight across Northern Ireland on September 20 1942. Subscribe to our daily newsletter Sign UpSarah Tysoe with her son George Tysoe, right, and aviation historian Jonny McNee The family of a British war pilot have visited the spot where a Spitfire aircraft crash-landed in a field in Ireland. Second World War pilot Lieutenant Gordon Hayter Proctor bailed out of the plane moments before it plummeted into the field in Co Monaghan. The Spitfire crashed because of massive engine failure during a flight across Northern Ireland on September 20 1942. The pilot's niece Sarah Tysoe travelled from England on Thursday after local archaeologists uncovered parts of the Spitfire last year which remained buried in the field since WWII. The aircraft's engine are among some of the parts exhibited at Monaghan County Museum. This summer, Monaghan County Museum hosts a fascinating new exhibition: The Monaghan Spitfire--Life on the Border with a World at War. Opening on 28th June 2018 and includes a real Spitfire and an anticraft gun outside Monaghan County Museum #MyMonaghan pic.twitter.com/eNNn31roqs <mark>Liam Bradley</mark>, the museum creator, and aviation historian Jonny McNee were instrumental in locating and recovering parts of the RAF Spitfire. Mr <mark>Bradley</mark> said: \"The Spitfire suffered massive engine failure and the pilot bailed out. Advertising\" As the engine is so front heavy it flew on for a few minutes but once it lost power it dipped down almost at an 80-degree angle at 400 miles an hour. \"Most of the plane disintegrated on impact but the engine was buried some three metres below the surface. The pilot parachuted out and landed a few miles across the border in Co Tyrone. Mr McNee said:\" The Spitfire crash is part of the local history. Advertising \"Everybody heard about it, lots of people went to the area and stole a bit of the plane before the Irish Army arrived. Sarah Tysoe views the crank shaft of the Spitfire plane (Brian Lawless/PA)\" Proctor was flying with a meteorological flight that were based at RAF Aldergrove (Belfast). He would go up and take the temperature, humidity and air pressure. \"He did that two or three times a day and feed information back to the base .\" The first thing he did when he landed was bury his parachute as he didn't know if he was in the North or South. \"The locals approached him, politely, with pitchforks. But they welcomed him and he had a bath and a meal and was able to ring his base .\" Some hours later he was back flying. He was an exceptional pilot. \"However, the pilot went missing in Burma in October 1944 and was never found. Ms Tysoe described the visit as\" surreal \".\" It's amazing to actually see the spot, it's indescribable, \"she said. Sarah Tysoe is shown the site were the plane came down by Josie McCusker, who witnessed the crash first-hand as a schoolgirl (Brian Lawless/PA)\" I've only known about this since February as when I watched Dunkirk I decided to search his name. So it was by pure chance that I came across all the articles. \"I got in touch with the museum and it's been an amazing story for the whole family .\" It's lovely for us to have him remembered in Ireland rather than his name on a memorial stone in Singapore. \"I had all the documentation from when he died and a few of his personal items but that's all I knew .\" This has filled in many of the gaps of his life. \"Josie McCusker, who witnessed the crash as a five-year-old girl, said:\" The noise was like thunder, it was very close to my house. \"The whole family rushed out to see what happened, it was very exciting .\" There were so many people who came to the field from near and far and loads of soldiers were about too. \"A life-size Spitfire, similar to the one that crashed some 15 miles outside Monaghan, went on display in the town on Thursday.", "articleID": "2018062816_00312810_W", "names": {"Liam Bradley": ["Q6539495", "Q6539496"]}}, {"date": "2018-07-01", "url": "https://www.elitedaily.com/p/selena-gomezs-comments-about-trumps-family-separation-policy-are-so-emotional-9644691", "content": "Matt Winkelmeyer/Getty Images Entertainment/Getty Images Selena Gomez's Comments About <mark>Trump</mark>'s Family Separation Policy Are So Emotional By Shelby Black 3 min ago On June 30, Selena Gomez attended the Hotel Transylvania 3: Summer Vacation premiere in Los Angeles, CA to promote her upcoming film. However, the night wasn't all fun and games for the movie star, because Selena Gomez's comments about <mark>Trump</mark>'s family separation policy proves that she hasn't forgotten about today's political issues. You go, Selena. During the movie premiere, Gomez revealed that <mark>Trump</mark>'s family separation policy has \"affected\" many people around her. \"It's extremely disheartening,\" Gomez said. \"There's a lot of confusion and anger. It's definitely been affecting so many people who are close to me .\" The recent crisis of separating immigrant children from their families at the border has resulted in the public organizing protests to fight against the <mark>Trump</mark> administration's \"zero tolerance\" immigration policy. Since these protests broke out, a number of celebrities, Gomez included, have spoken in favor of the fight to end this separation. On June 29, Gomez tweeted in support of the Keep Families Together Marches that took place on June 30. She wrote, Families seeking safety in our country need protection, understanding and opportunity, not detention. This is a moral choice, not a political one. I don't know about y' all, but there's seriously nothing I love more than celebrities speaking out on the issues. Following the complete backlash in response to <mark>Trump</mark>'s family separation policy, <mark>Donald Trump</mark> signed an executive order on June 20 that would stop this crisis. However, there's still a number of problems that need to be addressed even with the new order. On June 29, Attorney General Jeff Sessions announced that they plan to detain families together and hold them in detention centers indefinitely, or up until their immigration cases. To protest <mark>Trump</mark>'s family policy, individuals all over the nation gathered together on June 30 in honor of the Families Belong Together march. The Families Belong Together (FBT) Coalition, one of the key nonprofits who spearheaded this march, discussed on their website how this crisis is still not over even with the executive order signing. The coalition said, We're rallying in Washington, D.C., and around the country to tell <mark>Donald Trump</mark> and his administration to permanently end the separation of kids from their parents. End family internment camps. End the \"zero-humanity\" policy that created this crisis. And reunify the children with their parents. From Washington D.C. to Los Angeles, CA, people from all over the nation marched together to fight against <mark>Donald Trump</mark>'s separation policy. Even though this activism is coming from unfortunate circumstances, it's still so inspiring to see the passion these concerned individuals have for the injustices immigrant families are currently facing. Joe Raedle/Getty Images News/Getty Images Despite <mark>Trump</mark>'s claim that the executive order will \"keep families together,\" NBC News reported on June 27 that the Department of Homeland Security (DHS) is reportedly asking for more military space to house detainees. According to NBC News, DHS asked the the Department of Defense (DOD) for space that would care for a \"family population of up to 12,000 people .\" Also, nearly 2,000 of those families would require housing within 45 days. Elite Daily reached out to DHS for comment at the time, but did not hear back. Clearly this border crisis isn't going anywhere, but rest assured that activists and other concerned individuals will be fighting against the <mark>Trump</mark> administration in any way they can. Not everyone can take part in weekend marches to protest witnessed injustices, but that won't stop people from calling out <mark>Trump</mark> staffers wherever they can. On June 22, White House press secretary Sarah Huckabee Sanders was eating at Red Hen restaurant in Lexington, VA, but was asked by the owner, Stephanie Wilkinson, to leave the establishment. In fact, Sanders is just one of a few White House staffers that has been openly heckled while eating out in public, such as Department of Homeland Security Secretary Kirstjen Nielsen and <mark>Trump</mark> senior adviser <mark>Stephen Miller</mark>. I might not have been able to see this public outcry go down, but this is kind of what I imagine it to resemble. Giphy Whether it's during a protest march or at a movie premiere, it's so inspiring to see so many people standing up for these families. I hope the fight never stops.", "articleID": "2018070122_00193224_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Stephen Miller": ["Q11894443", "Q15707390", "Q27996060", "Q42884001", "Q7609994"]}}, {"date": "2018-07-03", "url": "http://www.siouxlandmatters.com/news/hundreds-celebrate-the-life-of-slain-maryland-journalist/1280250169", "content": "Suspect wrote he aimed to kill everyone at Maryland newsroom By: Posted: Jul 03, 2018 01:12 PM CDT Updated: Jul 03, 2018 01:12 PM CDT BALTIMORE (AP) - A man charged with slaying five people at a Maryland newspaper sent three letters on the day of the attack, police said, including one that said he was on his way to the Capital Gazette newsroom with the aim \"of killing every person present .\" Sgt. Jacklyn Davis, a spokeswoman for Anne Arundel County police, said the letters were received Monday. They were mailed to an attorney for The Capital newspaper, a retired judge of the Maryland Court of Special Appeals and a Baltimore judge. The letter Ramos sent to the Annapolis newspaper's Baltimore-based lawyer was written to resemble a legal motion for reconsideration of his unsuccessful 2012 defamation lawsuit against the paper, a columnist and then-publisher Tom Marquardt. Marquardt shared a copy of the letter with The Associated Press. \"If this is how the Maryland Judiciary operates, the law now means nothing,\" Ramos wrote. He quoted a description of the purpose of a defamation suit, saying it was intended for a defamed person to \"resort to the courts for relief instead of wreaking his own vengeance .\" \"\"That' is how your judiciary operates, you were too cowardly to confront those lies, and this is your receipt,\" Ramos wrote. He signed it under the chilling statement: \"I told you so .\" Below that, he wrote that he was going to the newspaper's office \"with the objective of killing every person present .\" In a letter attached to what appeared to be the faux court filing, he also directly addressed retired special appeals court Judge Charles Moylan, who decided against Ramos in his defamation case. Ramos sued the paper after pleading guilty to harassing a high school classmate. \"Welcome, Mr. Moylan, to your unexpected legacy: YOU should have died,\" he wrote. He signed it: \"Friends forever, Jarrod W. Ramos .\" Douglas Colbert, a University of Maryland law professor, described the letters as \"very powerful\" evidence of intent that the state will make full use of at trial. Colbert said as long as it's established in court that Ramos authored the letters, they will be used to show his \"planning and deliberate actions\" on the day of the attack. The apparent admissions by the defendant will weaken a defense lawyer's strategy of suggesting that he was \"suffering from a mental disease or defect\" that would impair his ability to understand the consequences of his actions, Colbert said. Ramos, 38, has a well-documented history of harassing the paper's journalists. The defamation suit was thrown out as groundless, and he often railed against current and former Capital staff in profanity-laced tweets. Police found him hiding under a desk after Thursday's attack and jailed him on five counts of first-degree murder. At a memorial service Monday night for one of those killed, editor Rob Hiassen, Marquardt said he once slept with a baseball bat by his bed because he was so worried about Ramos. He also said that they \"stepped up security\" at the newspaper years ago, and posted Ramos's photo around the office. \"But then he went dormant for about two years and we thought the problem has been solved. Apparently, it was just building up steam,\" he said. The mourning in Annapolis continued Tuesday, marked by a lowering of U.S. flags to honor the victims. President Donald Trump ordered flags flown at half-staff on federal property through sunset. Annapolis Mayor Gavin Buckley said Monday that Trump, who has repeatedly called journalists the \"enemy of the people,\" said he had been told his request to lower the flags had been denied. The White House said Tuesday that Trump ordered the flags lowered as soon as he learned of the mayor's request. Buckley expressed frustration Monday afternoon when he was told by a Maryland congressman's office the request had not been granted. He said he considered lowering flags on his own, but decided to follow protocol. He said he received a call from White House Press Secretary Sarah Huckabee Sanders just after 11 p.m. Monday, asking him for confirmation if he personally was making the request. \"She was very sympathetic,\" Buckley said in an interview. \"She felt for our community. She said\" I'll get back to you in the morning,' and she called me 7:16 this morning to say the president had issued a proclamation, and we're very grateful for that. \"Hiaasen was remembered Monday evening in stories, poems, prayers and songs at the\" celebration of life \"ceremony Monday evening. He was fatally shot last week at the Capital Gazette along with colleagues Gerald Fischman, <mark>John McNamara</mark>, <mark>Rebecca Smith</mark> and Wendi Winters. ___", "articleID": "2018070318_00161567_W", "names": {"John Mcnamara": ["Q16227873", "Q23616982", "Q3182071", "Q6248201", "Q6248203", "Q6248205"], "Rebecca Smith": ["Q30907428", "Q39072694", "Q43525202", "Q440719", "Q45729447", "Q47452564", "Q7301927"]}}, {"date": "2018-07-05", "url": "https://www.politicshome.com/news/uk/political-parties/conservative-party/theresa-may/news/96582/david-davis-‘-last-ditch-bid", "content": "<mark>David Davis</mark> \"in last-ditch bid to halt new <mark>Theresa May</mark> customs plan' ahead of Cabinet showdown Written by: Emilio Casalicchio Posted On: 5th July 2018 <mark>David Davis</mark> has warned <mark>Theresa May</mark> that her latest Brexit wheeze is unworkable in a bid to avert a furious Cabinet clash, it has been reported. <mark>David Davis</mark> is also said to be concerned the plan waters down of the Government position on Brexit Credit: PA Images The Brexit Secretary is said to have written a last-ditch letter to the Prime Minister telling her the so-called\" third way' proposal on post-Brexit customs will be point-blank rejected by Brussels. It comes amid fears from anti-EU MPs that the Government position will be watered down - although chief whip Julian Smith reportedly told them they would not be forced to vote for a deal they do not like. Tory minister defies <mark>Theresa May</mark> to say a no deal Brexit would be a disaster for business ANALYSIS: Brexiteers fear a stitch-up as <mark>Theresa May</mark>'s \"third way' customs plan takes shape Tories at war as Brexiteers hit out at <mark>Theresa May</mark>'s customs compromise plan Mrs <mark>May</mark> will present her Cabinet with her new customs plan at a crunch showdown at Chequers tomorrow. According to reports, the proposals are a mix of the two previous suggestions - both of which were rejected by Cabinet sub-committees tasked with investigating them. The so-called facilitated customs arrangement will use tech to keep the Irish border open but will still leave the UK collecting tariffs on behalf of Europe, it has been claimed. Downing Street is said to be confident the new plan - designed to free the UK to strike its own trade deals while still exchanging goods with the EU - offers the\" best of both worlds \"and has business support. But Mr <mark>Davis</mark> told Mrs <mark>May</mark> in his letter that Brussels would not countenance a plan that would allow the UK to police the EU border, according to the Daily Telegraph. A source told the paper:\" This plan would be like <mark>Donald Trump</mark> allowing us to keep an eye on his borders for him, it will never happen. \"We need to have this row in the party now so that we have time to negotiate something bespoke with heads of state before it's too late\". The source added: \"It provides unfair advantage to British companies .\" Meanwhile, the Sun reports that Mr <mark>Davis</mark> fears the customs plan would be too great a softening of the Government's Brexit red lines and wants to harden the Prime Minister's stance. \"It's a choice about strategy. Do you be extremely reasonable and adjust, or do you face down the EU?\" a pro-Brexit figure told the paper. \"They will come to us eventually, we just need to hold our nerve .\" FACILITATED CUSTOMS PLAN The facilitated customs arrangement would see the UK collecting the correct level of tariff at the border regardless of whether goods are bound for the UK or the EU - a marked difference from the previous plan. Technology would allow the Government to determine in advance where 96% of the goods are headed - while tariffs on the remaining 4% of goods will have to be rejigged later, as per the old plan. A Number 10 source told the Times: \"This is a serious proposal that addresses the legitimate concerns of the EU as well as the new for the UK to be able to sign free trade deals .\" It takes the best bits of both models and ensures a friction-free border in Northern Ireland while at the same time allowing businesses to benefit. \"\"REALLY FOOLISH' But eurosceptic MPs have already raised concerns about the plan - in particular suggestions it could involve keeping the UK in a single market on goods. Jacob Rees-Mogg, the chair of the European Research Group of Conservative backbenchers, told the BBC such a plan would be\" really foolish \". But according to the Times, chief whip Julian Smith told Mr Rees-Mogg and his allies in a meeting yesterday:\" If you don't like it, you don't have to vote for it. \"Mrs <mark>May</mark> will travel to Berlin today to discuss the new customs proposal with chancellor Angela Merkel.", "articleID": "2018070506_00069098_W", "names": {"David Davis": ["Q1174175", "Q1174177", "Q13471238", "Q16206936", "Q28037658", "Q300023", "Q41256031", "Q4710588", "Q56596944", "Q843907"]}}]