[{"date": "2018-07-05", "url": "https://www.politicshome.com/news/uk/political-parties/conservative-party/theresa-may/news/96582/david-davis-‘-last-ditch-bid", "content": "<mark>David Davis</mark> \"in last-ditch bid to halt new <mark>Theresa May</mark> customs plan' ahead of Cabinet showdown Written by: Emilio Casalicchio Posted On: 5th July 2018 <mark>David Davis</mark> has warned <mark>Theresa May</mark> that her latest Brexit wheeze is unworkable in a bid to avert a furious Cabinet clash, it has been reported. <mark>David Davis</mark> is also said to be concerned the plan waters down of the Government position on Brexit Credit: PA Images The Brexit Secretary is said to have written a last-ditch letter to the Prime Minister telling her the so-called\" third way' proposal on post-Brexit customs will be point-blank rejected by Brussels. It comes amid fears from anti-EU MPs that the Government position will be watered down - although chief whip Julian Smith reportedly told them they would not be forced to vote for a deal they do not like. Tory minister defies <mark>Theresa May</mark> to say a no deal Brexit would be a disaster for business ANALYSIS: Brexiteers fear a stitch-up as <mark>Theresa May</mark>'s \"third way' customs plan takes shape Tories at war as Brexiteers hit out at <mark>Theresa May</mark>'s customs compromise plan Mrs <mark>May</mark> will present her Cabinet with her new customs plan at a crunch showdown at Chequers tomorrow. According to reports, the proposals are a mix of the two previous suggestions - both of which were rejected by Cabinet sub-committees tasked with investigating them. The so-called facilitated customs arrangement will use tech to keep the Irish border open but will still leave the UK collecting tariffs on behalf of Europe, it has been claimed. Downing Street is said to be confident the new plan - designed to free the UK to strike its own trade deals while still exchanging goods with the EU - offers the\" best of both worlds \"and has business support. But Mr <mark>Davis</mark> told Mrs <mark>May</mark> in his letter that Brussels would not countenance a plan that would allow the UK to police the EU border, according to the Daily Telegraph. A source told the paper:\" This plan would be like <mark>Donald Trump</mark> allowing us to keep an eye on his borders for him, it will never happen. \"We need to have this row in the party now so that we have time to negotiate something bespoke with heads of state before it's too late\". The source added: \"It provides unfair advantage to British companies .\" Meanwhile, the Sun reports that Mr <mark>Davis</mark> fears the customs plan would be too great a softening of the Government's Brexit red lines and wants to harden the Prime Minister's stance. \"It's a choice about strategy. Do you be extremely reasonable and adjust, or do you face down the EU?\" a pro-Brexit figure told the paper. \"They will come to us eventually, we just need to hold our nerve .\" FACILITATED CUSTOMS PLAN The facilitated customs arrangement would see the UK collecting the correct level of tariff at the border regardless of whether goods are bound for the UK or the EU - a marked difference from the previous plan. Technology would allow the Government to determine in advance where 96% of the goods are headed - while tariffs on the remaining 4% of goods will have to be rejigged later, as per the old plan. A Number 10 source told the Times: \"This is a serious proposal that addresses the legitimate concerns of the EU as well as the new for the UK to be able to sign free trade deals .\" It takes the best bits of both models and ensures a friction-free border in Northern Ireland while at the same time allowing businesses to benefit. \"\"REALLY FOOLISH' But eurosceptic MPs have already raised concerns about the plan - in particular suggestions it could involve keeping the UK in a single market on goods. Jacob Rees-Mogg, the chair of the European Research Group of Conservative backbenchers, told the BBC such a plan would be\" really foolish \". But according to the Times, chief whip Julian Smith told Mr Rees-Mogg and his allies in a meeting yesterday:\" If you don't like it, you don't have to vote for it. \"Mrs <mark>May</mark> will travel to Berlin today to discuss the new customs proposal with chancellor Angela Merkel.", "articleID": "2018070506_00069098_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2018-07-05", "url": "https://www.outsidethebeltway.com/majority-of-americans-want-new-supreme-court-justice-confirmed-before-midterms/", "content": "Entertainment Majority Of Americans Want New Supreme Court Justice Confirmed Before Midterms Democrats are making largely meaningless appeals to the so-called \"Merrick Garland Precedent\" to argue for a delay in confirming the President's next Supreme Court nominee. The American people feel differently. Doug Mataconis · Thursday, July 5, 2018 · 1 comment Ever since Justice <mark>Anthony Kennedy</mark> announced his retirement last week, Democrats have been arguing that the Senate should put off consideration of whoever the President might select to replace him until after the upcoming midterm elections, which as of tomorrow will be exactly four months away. This call is quite obviously a call back to the refusal of Senate Majority Leader Mitch McConnell and the Republicans to hold a hearing or take a vote on the nomination of Judge Merrick Garland to succeed Justice Antonin Scalia after he died. At the time, Republicans and their supporters cited the fact that there was an upcoming Presidential election and that the American people should have an opportunity to be heard on the outcome of that election before the Senate acts on any nomination. Using much the same logic, many Democratic Senators and pundits are citing what they've come to call either the \"Merrick Garland Precedent\" or the \"Mitch McConnell Precedent\" in support of their argument that the Senate should delay consideration of a new Supreme Court nominee until after the election. This position began mere minutes after <mark>Kennedy</mark>'s retirement announcement became public when Senate Majority Leader said on the Senate floor that the Republican-controlled Senate \"should follow the rule they set in 2016, not to consider a Supreme Court justice in an election year .\" He also said that \"millions of people are just months away from determining the senators who should vote to confirm or reject the president's nominee, and their voices deserve to be heard now .\" Senate Minority Whip Dick Durin said pretty much the same thing, and the message has been repeated by other Democratic Senators, including Kamala Harris, Elizabeth Warren, and several Democrats who sit on the minority side of the Senate Judiciary Committee. Just today, Senator Schumer doubled down on his position by making the rather absurd suggestion that President Trump should appoint Merrick Garland to replace <mark>Kennedy</mark>, mirroring similar comments that were made by some on the left before Trump named Justice Gorsuch as his nominee early last years. By contrast, Senator McConnell has said that he intends to move quickly on the nomination once the President announces it and that he intends to hold a vote on the nomination before the beginning of the new Supreme Court term in October. This means there would need to be a Senate vote before the end of September and preferably early enough before the start of the new term on October 1st so as to allow the new Justice to prepare for the first two weeks of oral argument, which have already been announced. Obviously, Democrats have at least some hope that their appeal to what the Republicans did with respect to the Merrick Garland nomination will work to their political advantage notwithstanding the fact that it doesn't appear to have had much of an impact on the 2016 election outside the Democratic base. In any case, if a new NBC News poll is any indication, the American public does not agree: A majority of Americans believe the Republican-led Senate should vote on President Donald Trump's Supreme Court nominee before the November midterm elections, undercutting the Democratic argument that it should be delayed until after the pivotal fall elections, according to a new NBC News | SurveyMonkey poll. More than six in 10 Americans, or 62 percent, said Trump's nominee, who will be announced on Monday, should be confirmed or rejected before the elections in which control of the House and Senate are at stake. About three in 10, or 33 percent, said the Senate should wait until after the elections, the poll found. Sixty-six percent of Democrats and 60 percent of Republicans said Trump's nominee would be an important factor in their vote in the midterms. However, less than half of independents, 46 percent, said it would be on their mind when casting their November ballot. The vast majority of Republicans surveyed, 85 percent, said the Senate's vote on the nominee should take place before the election. Roughly six in 10 Independents, or 61 percent, agreed. However, more than half of Democrats, 55 percent, believe the voting on a new justice should wait. Obviously, there is at least some amount of hypocrisy in the fact that Republicans are prepared to proceed on a nomination to replace <mark>Kennedy</mark> just four months before the midterms, with a final vote on that nomination that would take place just 6-8 weeks before the election, after having refused to take any action on Garland's nomination which was announced some eight months before the Presidential election and seven months before the start of the Court's next term. However, as James Joyner correctly noted in his post on this issue on the day <mark>Kennedy</mark> announced his retirement, what the Republicans did with respect to the Garland nomination was in the end purely an exercise in power politics, it was not intended to be the establishment of some new precedent regarding the consideration of judicial nominees prior to an election. Additionally, as I put it in a post just a few weeks before President Trump took office, the Senate GOP Leadership made a huge political bet in the wake of Scalia's death, one that they easily could have lost had Hillary Clinton won the election, and they ended up winning. In the end, that was all that really matters. Part of the reason for this is because, in the end, voters outside the beltway clearly don't really care about the \"process stories\" that routinely become the obsession of Members of Congress, pundits, reporters, and activists. By that, I mean that they generally don't seem to care how something gets done in Washington as long as it gets done. This is the main reason why the GOP's gamble on the Merrick Garland nomination failed to resonate with the American public and why Democratic efforts to portray the efforts to get to a quick vote on the new Supreme Court vacancy isn't likely to resonate with them either. Polls like this make clear that they're more concerned with what gets done than how it happens, and the intricacies of the rules of the United States Senate are hardly something that is going to interest the average American voter. Given that, any hope on the part of Democrats that they're going to score political points on the contrast between the GOP position in March 2016 when Garland was nominated and its position today is way off the mark. In any case, the Democrats efforts to resurrect the ghost of Merrick Garland are clearly meant to be a political move. By bringing it up, they obviously hope to revive the memories of that matter in the minds of their base and the American public in the hope that it will be advantageous to them in the midterm elections. Obviously, they are essentially powerless to stop the nomination itself thanks to the Republican decision to finish the work that <mark>Harry Reid</mark> had started and end the filibuster for Supreme Court nominations. People such as Schumer and Durbin are obviously smart enough to realize that. If this poll is any indication, though, the argument isn't likely to resonate with the American public as a whole and could end up backfiring on Democrats if they try to slow the nomination down right before the election since such a move would seem to run counter to public opinion", "articleID": "2018070521_00003953_W", "names": {"Anthony Kennedy": ["Q11171", "Q59192346"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}}, {"date": "2018-07-08", "url": "http://www.theargus.co.uk/sport/16340520.will-beer-hails-sussexs-strength-in-depth/", "content": "Sussex's Will Beer 0 comments WILL BEER believes Sussex have the all-round depth to be a threat in this year's Vitality T20 Blast. Beer, 29, brought up his 100th T20 appearance for Sharks on Wednesday in the 36-run victory against Essex Eagles at Chelmsford. Beer hails Sussex's strength in depth Multiple Classic-winning trainer Dunlop dies Rosenior gets boost as he trains with Albion under-23s Albion closing in on goalkeeper Four Albion fixtures picked for live TV It was the ideal start for Jason Gillespie's side and they head to Wales today to face Glamorgan at Sophia Gardens looking to secure back-to-back wins. Spin sensation <mark>Rashid Khan</mark> made his debut in the win while David Wiese finished with a five-wicket haul. Beer was part of the Sussex side which won the competition in 2009 and hopes that success can be repeated with the current squad. He said: \"You have the dream and the hope every year in every competition to get a trophy .\" But if you look round our dressing room now we have the bowling attack but we also have the batting to go with it. \"We've got <mark>Luke Wright</mark> while <mark>Laurie Evans</mark> is in incredible form. <mark>Michael Burgess</mark> is playing really well and we also have <mark>Tom Bruce</mark>, who not many teams will know about, but is a really good player .\" I think we have real depth in our batting, real depth with the ball and we're going to have guys sat on the bench for a few games who would get into most teams around the country. \"It's very exciting so we just have to go out there, put performances together, not get complacent and take every game as it comes .\" Everybody is looking forward to it as a competition. \"Beer does not want to be one of those on the bench as he tries to add to his T20 appearances record for Sharks but knows the bowling options are the envy of many a club. He said:\" We have a lot of bowling options. If you look at the squad, we have the best T20 bowler in the world in <mark>Rashid Khan</mark>. \"And then you have guys who have played or are playing for England in <mark>Chris Jordan</mark>, Tymal Mills and <mark>Danny Briggs</mark>, while we also have the likes of David Wiese, who is also an international cricketer, as well as Jofra Archer .\" It's a tough team to get in to. \"Beer says short-format starman <mark>Khan</mark> has slotted in immediately. He said:\" <mark>Rashid</mark> has been really good so far and I have tried to pick his brains as much as I can in the short time he's been here. \"He's good to talk to about fields and bowling in different conditions. I am looking forward to spending a good two months with him .\" <mark>Khan</mark> picked up two wickets on his debut and was a box of tricks for the home batsmen to deal with. Beer said: \"He's got lots of different variations and he bowls it so fast it is so hard for the batsmen to pick .\" He's been so good because he bowled for an hour and a half in the nets the other day to <mark>Michael Burgess</mark> when he was batting and wicketkeeping so he's given a lot of time to the boys, especially <mark>Michael</mark> who is going to be keeping to him. \"That will help him get used to him so he can pick him .\" Leg-spinner Beer marked his ton of T20 appearances with a tweet which said: \"Proud to have made my 100th T20 appearance for @ SussexCCC yesterday! Hopefully there's another trophy around the corner for us this year! #doubleup #GOSBTS\" But he did not make a big deal of it before the game--even though he knew the milestone was on the horizon from a while back. He revealed: \"I knew last year that the last T20 game against Essex was my 99th as someone pointed it out .\" I've known all winter that I had one to go to bring up my century. \"It was pretty low-key really .\" A few of the boys knew but I didn't want to make a massive thing out of it. \"I just wanted to enjoy the game and contribute towards a win .\" The win was all the more special as Beer admits Chelmsford has not always been a happy hunting ground for Sussex. \"It's definitely special to go there and win and silence that crowd,\" he said \"They can be pretty rowdy so it was nice to hear them go quiet near the end. They were even trying to be nice to us - you know you have won them over when you have the Chelmsford crowd being nice to you .\" Now he wants to be part of the team that gives the crowd in Cardiff nothing to shout about and hopes conditions will work in Sussex's favour. He said: \"England are playing there (Friday).\" I expect we shall be playing on the same wicket and hopefully, that will work in my favour, playing on a nice used wicket. \"It usually is quite slow there and spins so, hopefully, conditions will suit our attack nicely .\" Sussex have named an unchanged squad for the trip. 0 comments", "articleID": "2018070809_00085611_W", "names": {"Chris Jordan": ["Q2895170", "Q5107045", "Q5107047"], "Danny Briggs": ["Q16193492", "Q5220180"], "Laurie Evans": ["Q6501566", "Q6501567"], "Luke Wright": ["Q3529926", "Q6702480"], "Michael Burgess": ["Q21005228", "Q22985966", "Q30071045", "Q6828931", "Q6828932"], "Rashid Khan": ["Q14474511", "Q16227794", "Q21285307", "Q21621685", "Q4781922"]}}]