[{"date": "2018-07-08", "url": "http://www.theargus.co.uk/sport/16340520.will-beer-hails-sussexs-strength-in-depth/", "content": "Sussex's Will Beer 0 comments WILL BEER believes Sussex have the all-round depth to be a threat in this year's Vitality T20 Blast. Beer, 29, brought up his 100th T20 appearance for Sharks on Wednesday in the 36-run victory against Essex Eagles at Chelmsford. Beer hails Sussex's strength in depth Multiple Classic-winning trainer Dunlop dies Rosenior gets boost as he trains with Albion under-23s Albion closing in on goalkeeper Four Albion fixtures picked for live TV It was the ideal start for Jason Gillespie's side and they head to Wales today to face Glamorgan at Sophia Gardens looking to secure back-to-back wins. Spin sensation <mark>Rashid Khan</mark> made his debut in the win while David Wiese finished with a five-wicket haul. Beer was part of the Sussex side which won the competition in 2009 and hopes that success can be repeated with the current squad. He said: \"You have the dream and the hope every year in every competition to get a trophy .\" But if you look round our dressing room now we have the bowling attack but we also have the batting to go with it. \"We've got <mark>Luke Wright</mark> while <mark>Laurie Evans</mark> is in incredible form. <mark>Michael Burgess</mark> is playing really well and we also have <mark>Tom Bruce</mark>, who not many teams will know about, but is a really good player .\" I think we have real depth in our batting, real depth with the ball and we're going to have guys sat on the bench for a few games who would get into most teams around the country. \"It's very exciting so we just have to go out there, put performances together, not get complacent and take every game as it comes .\" Everybody is looking forward to it as a competition. \"Beer does not want to be one of those on the bench as he tries to add to his T20 appearances record for Sharks but knows the bowling options are the envy of many a club. He said:\" We have a lot of bowling options. If you look at the squad, we have the best T20 bowler in the world in <mark>Rashid Khan</mark>. \"And then you have guys who have played or are playing for England in <mark>Chris Jordan</mark>, Tymal Mills and <mark>Danny Briggs</mark>, while we also have the likes of David Wiese, who is also an international cricketer, as well as Jofra Archer .\" It's a tough team to get in to. \"Beer says short-format starman <mark>Khan</mark> has slotted in immediately. He said:\" <mark>Rashid</mark> has been really good so far and I have tried to pick his brains as much as I can in the short time he's been here. \"He's good to talk to about fields and bowling in different conditions. I am looking forward to spending a good two months with him .\" <mark>Khan</mark> picked up two wickets on his debut and was a box of tricks for the home batsmen to deal with. Beer said: \"He's got lots of different variations and he bowls it so fast it is so hard for the batsmen to pick .\" He's been so good because he bowled for an hour and a half in the nets the other day to <mark>Michael Burgess</mark> when he was batting and wicketkeeping so he's given a lot of time to the boys, especially <mark>Michael</mark> who is going to be keeping to him. \"That will help him get used to him so he can pick him .\" Leg-spinner Beer marked his ton of T20 appearances with a tweet which said: \"Proud to have made my 100th T20 appearance for @ SussexCCC yesterday! Hopefully there's another trophy around the corner for us this year! #doubleup #GOSBTS\" But he did not make a big deal of it before the game--even though he knew the milestone was on the horizon from a while back. He revealed: \"I knew last year that the last T20 game against Essex was my 99th as someone pointed it out .\" I've known all winter that I had one to go to bring up my century. \"It was pretty low-key really .\" A few of the boys knew but I didn't want to make a massive thing out of it. \"I just wanted to enjoy the game and contribute towards a win .\" The win was all the more special as Beer admits Chelmsford has not always been a happy hunting ground for Sussex. \"It's definitely special to go there and win and silence that crowd,\" he said \"They can be pretty rowdy so it was nice to hear them go quiet near the end. They were even trying to be nice to us - you know you have won them over when you have the Chelmsford crowd being nice to you .\" Now he wants to be part of the team that gives the crowd in Cardiff nothing to shout about and hopes conditions will work in Sussex's favour. He said: \"England are playing there (Friday).\" I expect we shall be playing on the same wicket and hopefully, that will work in my favour, playing on a nice used wicket. \"It usually is quite slow there and spins so, hopefully, conditions will suit our attack nicely .\" Sussex have named an unchanged squad for the trip. 0 comments", "articleID": "2018070809_00085611_W", "names": {"Tom Bruce": ["Q21620944", "Q542091"]}}, {"date": "2018-07-09", "url": "https://www.mediaite.com/tv/gop-senator-john-kennedy-on-russia-trip-i-told-them-to-stop-screwing-with-american-elections/", "content": "During an appearance on CNN today, GOP Senator <mark>John Kennedy</mark> of Louisiana attacked Russian Foreign Minister Sergey Lavrov as a \"bully\" and a \"smart-ass,\" while also demanding the Kremlin \"stop screwing with American elections .\" \"I went for two reasons,\" <mark>Kennedy</mark> said of his recent trip to Russia. \"Number one, to deliver a message. I delivered that to the foreign minister, to the speaker of the house, and to a number of their senators .\" He continued by elaborating on his reasons for the visit: \"This is what I said Number one, stop screwing with American elections. Number two, get out of eastern Ukraine and let them self-determine. Number three, get out of Crimea and let Crimea self-determine. Number four, stop screwing around in Syria and help us settle the mess. And number five, do not allow Iran to get a foothold in southern Syria. Because if you do that, there's going to be another war. Israel is not going to stand for <mark>Kennedy</mark> went on to say that the meeting with the Russian foreign minister was\" probably the toughest \"part of his trip .\" We exchanged words--he's a bully, \"the Republican lawmaker said .\" He impressed me as the sort of guy who started out in the world as a smart-ass and worked his way up. And it was a pretty tough meeting. But I think our message was delivered. \"<mark>Kennedy</mark> added that he and his colleagues informed the Russian that if they\" screw with the elections this fall, \"then\" the Congress is going to double down on sanctions. \"Watch above, via CNN. [image via screengrab] Follow the author on Twitter (@ calebecarma). Have a tip we should know? tips @ mediaite.com Follow Mediaite Follow @ mediaite Like us on Facebook filed under CNN, <mark>John Kennedy</mark>, Russia", "articleID": "2018070918_00026586_W", "names": {"John Kennedy": ["Q16090838", "Q16105132", "Q16195622", "Q1700694", "Q20737930", "Q25190305", "Q28530228", "Q43021748", "Q48775493", "Q548829", "Q593437", "Q59417950", "Q6242832", "Q6242834", "Q6242838", "Q6242847", "Q6242859", "Q6242864", "Q6242872", "Q6250211"]}}, {"date": "2018-07-13", "url": "http://phoenixnewtimes.com/news/arizona-abolish-ice-david-garcia-kyrsten-sinema-doug-ducey-steve-farley-10606198", "content": "\"I do not support abolishing ICE,\" Congresswoman Kyrsten Sinema says in Welton's cellphone video of the prickly exchange on July 5. \"That wasn't the question I asked,\" Welton says. Sinema cuts him off. \"I do believe that ICE does provide some important functions in our community,\" she says, explaining that ICE deports dangerous people. \"But I do believe we should reform ICE, so that ICE is not targeting individuals who have done nothing wrong in our country,\" Sinema continues. Welton asks the question again, interrupting her, but Sinema tells him that she has to move on. \"I will not call for the abolition of ICE, but I do believe I just explained my opinion,\" she says. \"So, thanks .\" Part 2: I asked @ RepSinema @ kyrstensinema again: \"Will you use your platform as a member of congress to call for a halt in ICE operations that target immigrants with no criminal history?\" She has chosen not to speak up. pic.twitter.com/IIzK2UOjA3--connor (@ c_boy17) July 6, 2018 A 24-year-old who lives outside Tucson, Welton was there to watch Congresswoman Kyrsten Sinema speak about her quest to become an independent - minded senator. Sinema chatted. She snapped photos. And shortly after the awkward exchange about ICE, she was whisked away to the next campaign stop. Sinema is not the only Arizona Democrat grappling with the abolish ICE movement from the party's unapologetic left flank. But not every Democrat has responded like her. This week, Democratic gubernatorial candidate and Arizona State University Professor <mark>David Garcia</mark> threw his support behind the movement to erase ICE as a federal agency, though he has eschewed the specific phrase of abolishing ICE. Both are running competitive races in a red state, yet they've charted wholly different strategies: <mark>Garcia</mark> has mounted a full-throated progressive campaign for the governor's office; Sinema barely qualifies as a member of the Democratic Party in the eyes of left-leaning voters like Welton. ICE is a relatively new agency that was formed just 15 years ago during the creation of the Department of Homeland Security. And because of the Trump administration's crackdown on immigrants and the traumatic family separation policy, Democratic candidates are increasingly fielding calls to deep-six the agency. Alexandria Ocasio-Cortez, a 28-year-old Democrat in New York, stunned the political establishment last month by taking out a 10-term congressman in a primary. Since then, abolishing ICE, one of her planks, has taken over the mainstream debate. But as for Sinema, Ocasio-Cortez she is not. Sinema endlessly talks about a pragmatic approach to governing and touts her bipartisan credentials. She's right in that respect: In her Congressional voting record, Sinema has voted in line with Trump's position more than half the time, according to FiveThirtyEight. She voted for the anti-immigrant Kate's Law last year. A priority of Attorney General Jeff Sessions, the bill adds years to the prison sentences of people who repeatedly cross the border illegally. Sinema voted for the proposal \"to keep convicted and dangerous felons off our streets,\" she said at the time. And in 2015, Sinema voted to prevent the resettlement of Syrian and Iraqi refugees, citing \"a duty to keep our country safe from terrorism .\" She calls it pragmatism. Left-of-center voters call it something else. A spokesperson for Sinema did not respond to questions about specific reforms to ICE or why Sinema continues to field criticism from left-leaning voters. Gubernatorial candidate <mark>David Garcia</mark>. Joseph Flaherty Compare Sinema to <mark>Garcia</mark>, a veteran who has adopted a menu of liberal policy positions in his race to unseat Governor Doug Ducey. <mark>Garcia</mark> is proposing free community college for Arizonans and supports universal health care through a Medicare-for-all plan. He was a constant presence at the #RedForEd protests during the teachers' strike at the Capitol in late April--<mark>Garcia</mark> has a Ph.D. from the University of Chicago and works at ASU's college of education--and supports raising taxes to fund schools. So it makes sense that for <mark>Garcia</mark>, tweaking ICE is not enough. He issued a statement on Monday that condemned the administration's family separation policy, saying that Trump's actions \"demand that we rebuild our immigration system top-to-bottom and start by replacing ICE with an immigration system that reflects our American values, values I and so many before have served to protect .\" <mark>Garcia</mark>'s communications director Sarah Elliott suggested that a new agency, better attuned to human rights and the rights of families, could replace ICE, just as ICE replaced its predecessor, the Immigration and Naturalization Service. \"Our message is that we need to get away from the false choice of open borders versus Trump and Ducey's cruelty,\" Elliott wrote in an email. Ducey, on the other hand, spent the week leaning heavily on his experience as a border-state governor and the idea that the existing law-enforcement regime (and, by extension, him) protect Arizona. On Tuesday, Ducey published an op-ed in USA Today in which he called ICE a \"lifeline\" for border communities and criticized in stark terms the push to abolish ICE. \"I want to be clear--this call to abolish ICE is not only wrong--it is reckless, and puts the people of my state and others in direct threat,\" Ducey wrote. The governor has also spent this week touting the operations of the Arizona Border Strike Force, an amalgam agency Ducey created to combat smuggling and drug trafficking that includes state, federal, and local officers. Evidently, his campaign views these efforts as part of a winning strategy--Ducey's re-election slogan is \"Securing Arizona's Future .\" Running for statewide office in Arizona as a Democrat is difficult--certainly a contributing factor for Sinema moderating her positions over the years between her time as a more outspoken, liberal state legislator before she became a three-term congresswoman. Courtesy of Kyrsten Sinema/Facebook <mark>Garcia</mark> could tell you as much. He lost narrowly to Diane Douglas in the 2014 contest for superintendent of public instruction even though Douglas was widely viewed as a weak candidate. Nevertheless, in a midterm year when Democrats might capitalize on anti-Trump energy, the same year that a popular uprising of underpaid teachers swept Arizona, <mark>Garcia</mark>'s timing for the governor's race certainly seems right. Whether the broader voting public in Arizona is on board with his idea to abolish ICE is another question. Local polling firm Data Orbital released a poll on Wednesday that suggests Arizona voters at the moment are not sold on getting rid of ICE. Surveying 550 likely general election voters, the firm found that 80 percent of Republicans, 70 percent of Independents, and 39 percent of Democrats do not support abolishing ICE. In an email, Ducey campaign spokesperson Patrick Ptak said that based on these polls, \"it's no surprise (<mark>Garcia</mark>) is now trying to nuance his comments .\" Ptak called abolishing ICE an \"extreme position .\" Data Orbital President George Khalaf said that the poll is another sign of Sinema's canny sense for what will win over Arizona voters. \"Sinema knows how to not just read her base, but she knows how to have a good finger on the pulse of the state,\" Khalaf told New Times. \"She has been the loudest Democrat to ensure that she would not favor abolishing ICE .\" Khalaf's background includes a stint as a political director with the state Republican Party. <mark>Garcia</mark>'s main opponent in the Democratic primary, State Senator Steve Farley, said Monday that he favors fixing ICE as opposed to abolishing the agency. Polls show <mark>Garcia</mark> has a strong lead in the three-way Democratic primary matchup, and perhaps even a tiny edge over Ducey in the general election. The daylight that exists between <mark>Garcia</mark> and Sinema on ICE is tied up in a perennial question for Arizona Democrats. Do you run to the left, winning over voters like Welton--the future of a Democratic party in which abolishing ICE might become a platform plank--and lose in the general election? Or, like Sinema, do you absorb the criticism from your own party, cast highly questionable votes for Kate's Law and a halt to refugee settlement, and emerge as a victorious senator as a result? From Khalaf's point of view, the political fighting turf could be the determining factor for whether <mark>Garcia</mark> and Sinema succeed. \"It is a tale of two campaigns,\" Khalaf said. \"I just think that Sinema's running a campaign that's more like Arizona and, quite frankly, I think <mark>David Garcia</mark> is running as if he's running in a California or a New York .\" If you like this story, consider signing up for our email newsletters. SHOW ME HOW X SUCCESS! You have successfully signed up for your selected newsletter (s) - please keep an eye on your mailbox, we're movin' in! Welton, like Ocasio-Cortez, identifies as a socialist. After confronting Sinema last week, he left the Pima County headquarters unsatisfied with her response--Welton noted that during their exchange, he never even specifically asked Sinema if she would abolish ICE. Sinema is \"doing everything she can do to court conservative--frankly, racist--white voters hoping that will put her over the top,\" Welton said in an interview. \"And in the course of that, she is abandoning the actual people who are the Democratic Party base .\" In spite of his discomfort with Sinema, Welton conceded that in November, he'll vote strategically and definitely won't support the Republican in the race. But questions about immigration enforcement are going to continue to trail Arizona Democrats, Welton said. \"Democrats definitely should stand up for immigrants' rights and oppose abuses by government agencies that are targeting immigrants,\" Welton said. \"And that's going to be messaged in different ways in different districts, but that should be the message .\" Joseph Flaherty is a staff writer at New Times. Originally from Wisconsin, he is a graduate of Middlebury College and Columbia University's Graduate School of Journalism. Contact:", "articleID": "2018071314_00052593_W", "names": {"David Garcia": ["Q21284974", "Q27830908", "Q3703187", "Q56281988", "Q56928231"]}}, {"date": "2018-07-13", "url": "http://www.the-star.co.ke/news/2018/07/14/policy-requires-ecde-tutors-to-hold-diplomas_c1786701", "content": "Policy requires ECDE tutors to hold diplomas Jul. 14, 2018, 12:30 am By LEWIS NYAUNDI @ xnyaundih Education CS <mark>Amina Mohamed</mark> and TSC CEO Nancy Macharia after a meeting with Parliamentary committee on Education on recruitment of teachers in the country. April 10, 2018. Photo/Jack Owuor Early childhood development and education teachers will be required to hold diplomas once a draft policy comes into force. A draft framework to guide the scheme of service in the sector states that the teachers will have to undergo two-and-a-half-year training, while assistant teachers will be required to have certificate qualification. The scheme was developed by the Council of Governors, the Teachers Service Commission, the Ministry of Education and the Salaries and Renumeration Commission in conjunction with Unicef. Upon employment, the teachers will have a chance to move up the promotion ladder in six grades. The scheme also allows bachelor degree holders to compete for administrative roles currently reserved for P1 teachers. The framework has yet to be launched as the sector players await the approval of the ECDE Bill of 2014. On Thursday, Council of Governors education committee chairman Paul Chepkwony (Kericho) said the main problem hampering proper facilitation of ECDE education is inadequate funding from the Exchequer. \"The CoG is lobbying for more funds from the national government to support the sector. It has not been the most successful sector in the country because it is highly underfunded,\" he said. Chepkwony spoke during a joint meeting of ECDE teachers, the Kenya Institute of Curriculum Development and other players. He said the scheme seeks to harmonise salaries to reduce pay disparityies among the counties. Education CS <mark>Amina Mohamed</mark> said the government is finalising quality standard guidelines, the national pre-primary education policy, the national competence-based assessment tool and review of teacher education curriculum. Kenya Publishers' Association chairman Lawrence Njagi raised concerns over misleading teaching materials for ECDE. He said unapproved materials hurt education quality. He cited charts with wrong sounds mismatched with letters.", "articleID": "2018071320_00036638_W", "names": {"Amina Mohamed": ["Q23809287", "Q4746345"]}}, {"date": "2018-07-14", "url": "http://assassinscreed.wikia.com/wiki/Khaliset?diff=743249&oldid=743225", "content": "Revision as of 00:44, July 14, 2018 (view source) The Cat Master (Talk | contribs) (Undo revision 743221 by JohnAlexander23 (talk)) ← Older edit Latest revision as of 07:03, July 14, 2018 (view source) Sadelyrate (Talk | contribs) m (→ Equipment and Skills) Line 23: Line 23: = = = Equipment and Skills = = = = = = Equipment and Skills = = = − Khaliset was able to tame [[hyenas]] to do her bidding, and had several accompanying her wherever she went. Khaliset was also skilled with a [[bow]] as well as matters of stealth which she used to her advantage in combat during a sandstorm. <ref name = \"The Hyena\" /> + Khaliset was able to tame [[hyena]] s to do her bidding, and had several accompanying her wherever she went. Khaliset was also skilled with a [[bow]] as well as matters of stealth which she used to her advantage in combat during a sandstorm. <ref name = \"The Hyena\" /> = = Trivia = = = = Trivia = = Latest revision as of 07:03, July 14, 2018 \"I just want my daughter back...Please?!\" --Khaliset's final words, begging the gods for reunion with her deceased daughter Khaliset Khaliset (c. 80s BCE--48 BCE), also known as The Hyena, was a member of the Order of the Ancients during the reign of Ptolemy XIII. Contents [show] Biography Edit Khaliset served the Order by gathering silica for them in the ancient tombs of Giza, as silica had special properties and could be used to power the Isu technology the Order sought. [1] Eventually, however, she went rogue and began keeping the silica for herself, prompting Taharqa, a fellow member known as The Scarab, to write her a letter questioning her lack of contact with them. At some point, she had begun to study the ancient symbols in the Isu vault beneath Khufu's Pyramid and began to learn how to use the technology for her ultimate purpose of resurrecting her deceased daughter Eshe. [2] [3] In 48 BCE, the Medjay, Bayek, tracked Khaliset to the Great Pyramid of Giza, where he found the Isu Temple, Eshe's sarcophagus, and evidence of Khaliset's attempts to resurrect her, before Khaliset herself appeared, furious that Bayek had disturbed her daughter's \"tomb\". He chased her through the pyramid's tunnels, eventually succeeding in killing her after a dramatic confrontation in the middle of a sandstorm outside the pyramid. [2] Personality and traits Edit Unlike most of the other members of the Order who sought power and dominance over Egypt, Khaliset was only determined to use the Order's resources to resurrect her daughter who died by unknown means. To that end, she was willing to commit many atrocities and sacrifice many innocents in deadly rituals that she believed would aid in her daughter's resurrection. She expressed remorse as she died, lamenting the fact she had been unable to protect her child in life or in death. [2] [3] Equipment and Skills Edit Khaliset was able to tame hyenas to do her bidding, and had several accompanying her wherever she went. Khaliset was also skilled with a bow as well as matters of stealth which she used to her advantage in combat during a sandstorm. [2] Trivia Edit Khaliset's place of origin and ethnicity was never mentioned in the game. Instead, they are listed in the Official Game Guide. Gallery Edit Khaliset's symbol Character model's of Khaliset Add a photo to this gallery Appearance Edit Assassin's Creed: Origins References Edit ↑ Assassin's Creed: Origins ↑ 2.0 2.1 2.2 2.3 Assassin's Creed: Origins--The Hyena ↑ 3.0 3.1 Assassin's Creed Origins: Official Game Guide Assassin's Creed: Origins Characters Hidden Ones William Miles | Bayek (Senu) • Aya • Phanos the Younger • Pasherenptah • Tahira • Phoxidas • <mark>Marcus Junius Brutus</mark> • Gaius Cassius Longinus | Kashta • Kawab • Maqwat • Osorkon • Paanchi • Shaqilat Order of the Ancients Juhani Otso Berg • Sofia Rikkin • Simon Hathaway | Actaeon • Berenike • Eudoros • Flavius Metellus • Hetepi • Julius Caesar • Khaliset • Ktesos • Livius • <mark>Lucius Septimius</mark> • Medunamun • Pothinus • Rudjek • Taharqa | Ampelius • Ptahmose • Rufio • Tacito Gladiators The Axes • The Brothers (Diovicos • Viridovix) • The Duelist • The Guardians of Siwa (Bayek • Kensa) • The Hammer • Hilarus Maximus • The Hoplite • Kosey • Polymestor • The Seleucid • The Slaver • Wamukota Mythical Beings Egyptian Deities (Anubis • Sobek • Sekhmet • Apep) • Undead Pharaohs (Akhenaten • Ramesses II • Nefertiti • Tutankhamun) • Afterlife Guardians (Faithless One • Relentless One) • Lost Army of Cambyses Others Layla Hassan • Deanna Geary | Alexander the Great | Apate • Apollodorus • Aristo of Alexandria • Benipe • Caesarion • Claridas • Cleopatra • Chenzira • Damastes • Diocles • Esiocles • Fenuku • Gennadios • Ghupa • Harkhuf • Hepzefa • Hotephres • Jeska • Khemu • Khenut • Menehet • Melitta • Phoebe • Pompey • Praxilla • Ptolemy XIII • Rabiah • Venator • Vitruvius • Zahra | Gamilat | Sutekh • Isidora • Merti • Tahemet Factions Hidden Ones (Egyptian Brotherhood) • Templars (Abstergo Industries | Sigma Team | Order of the Ancients) | Gabiniani • Medjay • Phylakes • Ptolemaic dynasty Locations Egypt (Alexandria • Bakchias • Euhemeria • Dionysias • Faiyum • Great Sphinx of Giza • Giza • Herakleion • Kanopos • Karanis • Kerkasoros • Krokodilopolis • Lake Moeris • Letopolis • Memphis • Natho • Per Ousir • Philadelphia • Pr-Hapi-n-Iwnw • Remetch Ra • Sais • Sau Village • Siwa • Soknopaiou Nesos • Udjat Apiary • Yamu • Yw Huts) • Kyrenaika (Apollonia • Cyrene • Balagrae) • Rome • Sinai (Arsinoe • Klysma Quarry) • Valley of the Kings (Set-Ma \"at • Swenett • Thebes) • Afterlife (Aaru • Aten • Heb Sed • Duat) Events Alexandrine Civil War (Siege of Alexandria • Battle of the Nile) • Assassination of Julius Caesar Terms and gameplay Achievements • Crafting • Customization • Discovery Tour • Eagle Vision • Genetic memory • Horde Mode • Leap of Faith • Animus Pulse • Memories • Outfits • Photo Mode • Pieces of Eden (Apple of Eden • Flickering Daggers • Glowing Mace • Isu Armor • Lightning's Strike • Moonlit Shield • Midnight Sun • Staff of Eden) • Skills • Treasure chests • Hunting • Viewpoints Weapons Hidden Blade • Bow • Swords • Spear • Shield DLC Ambush At Sea • The Curse of the Pharaohs • Discovery Tour • The Hidden Ones • Secrets of the First Pyramids • Trial of the Gods Retrieved from\" http: //assassinscreed.wikia.com/wiki/Khaliset? oldid=743249 \"Categories: 80s BCE births 48 BCE deaths Individuals Nubians Thieves Marksmen Order of the Ancients Languages: Polski Русский", "articleID": "2018071407_00528850_W", "names": {"Lucius Septimius": ["Q11934160", "Q6697612"], "Marcus Junius Brutus": ["Q11033721", "Q5996354"]}}, {"date": "2018-07-16", "url": "https://www.saipantribune.com/index.php/crisostomos-convictions-over-rape-killing-of-romero-affirmed/", "content": "Crisostomo's convictions over rape, killing of Romero affirmed Tag: car, DNA, life, William Bodziak Joseph Acosta Crisostomo The CNMI Supreme Court has affirmed the convictions of notorious habitual offender Joseph Acosta Crisostomo, who was slapped with a life sentence for the kidnapping, raping, and killing of bartender Emerita R. Romero. In a 39-page opinion issued Friday, the high court justices said even after omitting the errors in Superior Court Associate Judge Joseph Camacho's rulings in the case, numerous evidence remains. \"We find sufficiently strong, unrefuted evidence supporting Crisostomo's conviction, and are unable to say, even when taken together, that it is more probable than not that the errors materially affected the verdict. We decline to reverse for cumulative error,\" said the Supreme Court's opinion penned by Associate Justice John A. Manglona and concurred by Chief Justice Alexandro C. Castro and Associate Justice Perry B. Inos. Crisostomo, through counsel Janet H. King, appealed his convictions claiming numerous deficiencies before and during trial. The defendant presented 10 issues: denial of expert testimony; admission of expert testimony; denial of his motion to transfer venue; failure to reiterate jury instructions at the close of evidence; admission of improper character evidence; admission of testimony based on impermissibly suggestive identification; admission of footprint evidence; use of Skype testimony; admission of testimony concerning refusal to submit to polygraph examination; and cumulative errors resulting in an unfair trial. Then-assistant attorney general Matthew C. Baisley argued for the government before the CNMI Supreme Court. Then-interim chief prosecutor <mark>Brian Flaherty</mark> and then-assistant attorney general Margo Brown-Badawy represented the government at the trial. On the denial of expert testimony issue, the justices ruled that Superior Court Associate Judge Joseph N. Camacho did not allow either counsel to question Crisostomo's DNA expert Dr. <mark>David</mark> Haymer as to his methodology and its reliability, nor did the judge inquire as to these issues on his own accord, failing to establish a sufficiently developed record for the high court's review. The justices said Camacho unreasonably limited the evidence regarding the reliability and application of Haymer's methodology, and, as a result, prematurely rendered his conclusion on Haymer's admissibility. The justices said because of this error, Camacho could not make specific findings on the record. \"The manner in which the court made its rulings was manifestly erroneous, based on an erroneous view of the law,\" said the justices in concluding that Camacho abused his discretion. The justices, however, ruled that although Camacho erred in determining the admissibility of Haymer testimony, a close review leads the high court to conclude the exclusion was harmless. The justices said Crisostomo did not seek to introduce Haymer to testify about any evidence, rather, his testimony was sought to point out potential flaws in Federal Bureau of Investigation DNA analyst Susana Kehl's interpretation of the DNA mixture. The justices said although the exclusion of Haymer rendered Crisostomo's trial imperfect, it was nonetheless fair. \"We find a fair assurance of harmlessness that the error did not materially affect the verdict: had Haymer been able to testify, it is more probable than not that the same verdict would have been returned,\" said the justices, concluding that they deem the error harmless. On barefoot morphology expert William Bodziak's testimony, the justices said they find it evident--and certainly more probable than not--that Camacho would have nonetheless admitted Bodziak as an expert after a proper reliability determination. \"As such, we deem the failure to make findings as to the reliability of barefoot morphology harmless,\" the justices said. With respect to change venue issue, the justices found Crisostomo's vague claim as insufficient. The justices said discussion of certain jurors' knowledge of the case in the news is insufficient; the constitution requires the trier of fact to be impartial, not ignorant. \"We thus defer to the province of the trial judge and find no abuse of discretion,\" the justices said. On jury instructions matter, the justices said because the judge has broad discretion in deciding to give a cautionary instruction rather than declare a mistrial and they (justices) assume the judge's curative instruction was followed so as to overcome any prejudicial effect of a witness' statement, they find no error. Pertaining to identification of Crisostomo's voice in the 911 call issue, the justices said despite the police officers' suggestive setup, Joanne Castro, Crisostomo's prior live-in partner of 17 years, was able to give a reliable identification, rendering the out-of-the court identification admissible. \"We find no due process violation,\" the justices pointed out. On footprint evidence, the justices concluded that the taking of Crisostomo's footprints was not a critical stage of the proceeding and that subsequently admitting evidence of Crisostomo's footprints did not violate his Sixth Amendment right to counsel. The justices found no error in Camacho admitting the footprint evidence. On Skype testimony, the justices said given that Camacho did not err in allowing <mark>David Snyder</mark> to testify via Skype, they find no plain error occurred. <mark>Snyder</mark> is the forensic audio examiner who enhanced Romero's 911 call. With respect to polygraph testimony, the justices said any error in admitting the testimony about Crisostomo's refusal to submit to a polygraph was not plain in light of the record as a whole. \"Accordingly, we find no plain error,\" the justices said. On cumulative error, the justices said they weigh the aggregate prejudicial effect of the trial errors against the sum of the evidence presented against Crisostomo. The justices noted Camacho's errors in four issues, particularly the denial of Crisostomo's DNA rebuttal expert, were undeniably prejudicial. The justices said, however, the government's evidence pointing to Crisostomo as the perpetrator was undeniably strong. The justices highlighted some of this evidence. The justices said in particular, Alice Kintaro, Shaine Castro, and Crisostomo himself all identified Crisostomo as driving a vehicle matching the description of that seen by Natalie Ocon. The justices said hair and fiber in the rented car were consistent with Romero's hair, leggings, and fibers found on her shoe. The justices said three individuals separately identified Crisostomo's voice on a 911 call where Romero was heard pleading to be released, complaining that her neck hurt, and asking to pick up her pants. The justices said without knowing either party, the 911 operator identified the female voice as Filipina and the male voice as local. The justices said cell tower records matched Romero and Cristomo's movement, including pinging Crisostomo's borrowed phone in Marpi at 6am on Feb. 5. The justices said footprints matching Crisostomo's were found at La Fiesta next to drag marks. The justices said Crisostomo was seen by a witness attempting to sell a Blackberry Torch shortly after. The justices noted Kehl's testimony of a 1 in 960 million probability that the DNA found in Romero belonged to someone in the Chamorro population other than Crisostomo. The justices said the government notes Crisostomo has taken an \"everything-but-the-kitchen-sink approach\" to the appeal, and that they agree. In addition, the justices pointed out that Crisostomo's briefing is littered with violations of the NMI Supreme Court rules, conclusory statements, underwhelming legal arguments, and misstatements of law. Camacho presided over the trial and decided the misdemeanor charges. He found the defendant guilty of assault and battery, and disturbing the peace. On April 24, 2014, the jury reached a guilty verdict against the then-40-year-old Crisostomo as to the charges of first degree murder, kidnapping, sexual assault in the first degree, and robbery. On May 28, 2014, Camacho sentenced Crisostomo to life imprisonment. Romero, 37, was last seen boarding a car near her house in Garapan in the early morning of Feb. 5, 2012. She was supposed to meet her boyfriend in Chalan Piao. Two days later, FBI agents found her body in a small bathroom at the abandoned La Fiesta Mall in San Roque/As Matuis. Autopsy revealed she was beaten and strangled with a pair of leggings. Share", "articleID": "2018071521_00031156_W", "names": {"Brian Flaherty": ["Q4963753", "Q57530516"], "David Snyder": ["Q28421742", "Q2856358"]}}, {"date": "2018-07-16", "url": "https://www.sportsnews.com.au/nrl/bunnies-better-than-14-burgess/443028", "content": "By AAP + on 16/07/2018 at 5:34 pm Filled in: NRL News Sam Burgess has declared South Sydney's class of 2018 better than their 2014 NRL premiership group. The Rabbitohs are flying high at the top of the NRL ladder after notching up nine straight victories. With the likes of Damien Cook and <mark>Robert Jennings</mark> enjoying breakout seasons, George and <mark>Tom Burgess</mark> running over the top of rival forward packs and veteran <mark>John Sutton</mark> discovering career-best form, the Bunnies have been installed as premiership favourites. Before a ball had been kicked in anger this year they were considered title outsiders, however expectations are now soaring in Redfern. Parallels are being drawn between this year's side under rookie coach Anthony Seibold and the one that broke a 43-year premiership brought in 2014. While clubs usually shy away from such comparisons, Rabbitohs talisman <mark>Burgess</mark> is happy to declare the side is playing better football this year compared with four years ago. However he points out that the rest of the competition has gone forward alongside them. \"We're playing better football than in 2014, certainly,\" <mark>Burgess</mark> said. \"Some of the shape that we're throwing and the combinations we've got going at the moment are probably better than what we had in 2014 .\" But that's probably a reflection of the competition as well. Everyone improves year-in and year-out and adapts with the times. \"Whether that means we're going to do the same thing as 2014, that's a different story. The competition is completely different. We understand that .\" Their convincing 24-6 win over Canterbury on Saturday got Souths to nine wins on the trot, the first time in 29 years they've achieved the feat. But <mark>Burgess</mark> said it would count for little if they didn't go on with the job. When the Rabbitohs last went nine in a row in 1989, they fell one game short of the grand final and <mark>Burgess</mark> said they were out to avoid the same fate. \"It really doesn't count, the amount of games you win in a row,\" <mark>Burgess</mark> said. \"You've got to be consistent, we understand that. But also you've got to get it right when the time's right and we all know when that is .\" When finals come around, there's no point winning nine in a row and resting on that because people don't care about it. \"* All Offers and Promotions posted in this article excludes NSW residents.", "articleID": "2018071607_00222622_W", "names": {"John Sutton": ["Q20675734", "Q21463425", "Q25796470", "Q2702211", "Q28037473", "Q429951", "Q48481687", "Q6259719", "Q6259722", "Q6259724", "Q6259728", "Q6259730"], "Robert Jennings": ["Q19874645", "Q7346099"]}}]