[{"date": "2018-07-16", "url": "https://www.sportsnews.com.au/nrl/bunnies-better-than-14-burgess/443028", "content": "By AAP + on 16/07/2018 at 5:34 pm Filled in: NRL News Sam Burgess has declared South Sydney's class of 2018 better than their 2014 NRL premiership group. The Rabbitohs are flying high at the top of the NRL ladder after notching up nine straight victories. With the likes of Damien Cook and <mark>Robert Jennings</mark> enjoying breakout seasons, George and <mark>Tom Burgess</mark> running over the top of rival forward packs and veteran <mark>John Sutton</mark> discovering career-best form, the Bunnies have been installed as premiership favourites. Before a ball had been kicked in anger this year they were considered title outsiders, however expectations are now soaring in Redfern. Parallels are being drawn between this year's side under rookie coach Anthony Seibold and the one that broke a 43-year premiership brought in 2014. While clubs usually shy away from such comparisons, Rabbitohs talisman <mark>Burgess</mark> is happy to declare the side is playing better football this year compared with four years ago. However he points out that the rest of the competition has gone forward alongside them. \"We're playing better football than in 2014, certainly,\" <mark>Burgess</mark> said. \"Some of the shape that we're throwing and the combinations we've got going at the moment are probably better than what we had in 2014 .\" But that's probably a reflection of the competition as well. Everyone improves year-in and year-out and adapts with the times. \"Whether that means we're going to do the same thing as 2014, that's a different story. The competition is completely different. We understand that .\" Their convincing 24-6 win over Canterbury on Saturday got Souths to nine wins on the trot, the first time in 29 years they've achieved the feat. But <mark>Burgess</mark> said it would count for little if they didn't go on with the job. When the Rabbitohs last went nine in a row in 1989, they fell one game short of the grand final and <mark>Burgess</mark> said they were out to avoid the same fate. \"It really doesn't count, the amount of games you win in a row,\" <mark>Burgess</mark> said. \"You've got to be consistent, we understand that. But also you've got to get it right when the time's right and we all know when that is .\" When finals come around, there's no point winning nine in a row and resting on that because people don't care about it. \"* All Offers and Promotions posted in this article excludes NSW residents.", "articleID": "2018071607_00222622_W", "names": {"Tom Burgess": ["Q3530669", "Q7815127", "Q7815128", "Q7815129"]}}, {"date": "2018-07-16", "url": "http://www.chattanoogan.com/2018/7/16/372950/Khyree-Thompson-Denied-New-Trial-For.aspx", "content": "Khyree Thompson Denied New Trial For 2015 Motel Murder Monday, July 16, 2018 Khyree Thompson Khyree Thompson, 23, appeared in Judge Don Poole's courtroom Monday with a motion for a new trial. Thompson was sentenced to life in prison for the February 2015 murder of Reginald Ballard during a motel robbery. Attorney Donna Miller referenced close-up photos of the victim's wounds shown during trial, the introduction of \"allegations of the defendant's gang involvement,\" and instances of prejudicial error as some of the reasons behind Thompson's motion for a new trial. Judge Poole denied the motion, though Thompson still has 30 days to appeal. Khyree Thompson Denied New Trial For 2015 Motel Murder Khyree Thompson, 23, appeared in Judge Don Poole's courtroom Monday with a motion for a new trial. Thompson was sentenced to life in prison for the February 2015 murder of Reginald Ballard during a motel robbery. Attorney Donna Miller referenced close-up photos of the victim's wounds shown during trial, the introduction of \"allegations of the defendant's gang involvement,\" and...(click for more) State Route 68 To Be Closed In Rhea County On Wednesday And Thursday For Stabilization Project TDOT personnel and contract crews are nearing completion of a stabilization project on State Route 68 near log mile 5 in Rhea County. To expedite completion of the project, it will be necessary to completely close the road for a two-day period beginning on Wednesday, at 5 a.m. The closure was originally scheduled to begin on Monday, but has been postponed...(click for more) Here We Go Again With The Same Cummings Highway, 12th Street Flooding - And Response Here we go again with the same pitiful news reports about the Cummings Highway Interstate interchange with I-24 - Flooding yet again after a heavy rain. TDOT is derelict in not having repaired this years ago. How hard is it to get some excavators out there to dig up the collapsed drainage pipes which TDOT says are the cause of the flooding and replace them with...(click for more) Deal With The Graffiti Vandals I travel to other neat old cities and don't see nearly the graffiti vandalism as in Chattanooga. Why do we allow one or two or three repeat vandals to mar our venerable Walnut Street Bridge, the pillars to the Holmberg Bridge, the remodeled Chief <mark>John Ross</mark> Market Street Bridge, the walls along our multi-million-dollar Riverwalk, our sidewalks, street signs and our old limestone...(click for more) Lee Set To Begin Construction on New Baseball Stadium A new era will begin for the storied Lee University baseball program as construction began this month on a brand-new stadium for the Flames to call home with completion set for the upcoming spring 2019 season. The new venue, which will sit in the same location as Old Olympic Field, will be two levels and approximately 9,400 square feet. The stadium will feature chair back seating...(click for more) Local Tennis: The City Championships are July 19-22 The annual City Tennis Championships will be held July 19-22 at Manker Patten Tennis Club Open Division: The event will include the open division in men's and women's singles, doubles and mixed with prize money at $1000 for men's and women's singles winners and $500 for the runners-up and $250 for the semifinalists. NTRP Doubles Pla y: Doubles play...(click for more)", "articleID": "2018071619_00192231_W", "names": {"John Ross": ["Q11727979", "Q1701610", "Q19661432", "Q21063323", "Q27925053", "Q43380308", "Q43911093", "Q56254622", "Q6255678", "Q6255693", "Q6255697", "Q7252813"]}}, {"date": "2018-07-19", "url": "http://hardenexpress.com.au/story/5537037/bezos-launches-spacecraft-higher-than-ever/", "content": "Blue Origin's passenger was Mannequin Skywalker, an instrumented dummy which has flown before. Jeff Bezos' Blue Origin rocket company has shot a capsule higher into space than it has ever done before. The New Shepard rocket blasted off from west Texas on the company's latest test flight. Once the booster separated, the capsule's escape motor fired, lifting the spacecraft to an altitude of 120 kilometres. It is part of a safety system intended to save lives once space tourists and others climb aboard for suborbital hops. Wednesday's passenger was Mannequin Skywalker, an instrumented dummy in a blue flight suit which has flown before, plus science experiments. The booster and capsule - both repeat fliers - landed successfully. It was the ninth test flight and lasted 11 minutes. \"Crew Capsule looks great even after it was pushed hard by the escape test. Astronauts would have had an exhilarating ride and safe landing,\" Mr Bezos said in a tweet. Blue Origin has yet to announce when it will start selling tickets or how much flights will cost. Launch commentator Ariane Cornell promised it would be soon. Mr Bezos, founder and chief executive of Amazon, aims to send people and payloads into orbit from Cape Canaveral. Those missions will rely on the bigger, more powerful New <mark>Glenn</mark> rocket still under development. He has named his rockets after NASA's original Mercury astronauts Alan Shepard, the first American in space, and <mark>John Glenn</mark>, the first American to orbit the Earth. Australian Associated Press facebook SHARE twitter TWEET email whatsapp", "articleID": "2018071907_00161277_W", "names": {"John Glenn": ["Q16230701", "Q182642", "Q6235502"]}}, {"date": "2018-07-19", "url": "http://www.espnfc.us/sydney-fc/story/3569724/sydney-fc-wont-rush-into-marquee-signing-chief-executive-danny-townsend", "content": "By AAP Share Tweet less than a minute ago Sydney FC won't rush into marquee signing - chief executive Danny Townsend Steve Corica has an extra $1.3 million in the kitty after pocketing a transfer fee for Adrian Mierzejewski. Sprinting great Usain Bolt appears close to securing a trial stint with the Central Coast Mariners. Manchester City manager Pep Guardiola takes time to meet Melbourne City players and fans in Australia. Sydney FC won't rush into signing replacements for Bobo and Adrian Mierzejewski, with chief executive Danny Townsend aiming to reel in a big fish as European transfer actions heats up. The Sky Blues are searching far and wide as they attempt to cover the loss of Bobo, who earlier this year broke the record for most goals in an A-League season, and Mierzejewski, who claimed the Johnny Warren medal in his only season with the club. They unsuccessfully courted Spanish striker <mark>Fernando Torres</mark>, while Japanese star Keisuke Honda has been strongly linked with Melbourne Victory. Townsend still has high hopes of attracting a high-profile player with the help of the Football Federation Australia's marquee fund. \"<mark>Torres</mark> was obviously one to be allocated some of those funds. If we come up with another one that has that level of marketing attraction then we'd put it to the FFA,\" he told AAP. \"We're doing that every day. Every day another player comes up, we ask the question .\" They run it through their models and tell us if it's viable. \"The important thing is we don't need to rush. We've got the core nucleus of the team in place and we'll look to add some quality, most probably in the front three .\" The A-League season starts in October while European transfer windows close in August. \"If you look back over the years, our foreign players have come in reasonably late,\" Townsend said. \"We're not panicking, we've got plenty of time .\" We want to make the right decision both from a performance and marketing perspective. \"There's plenty of fish in the sea...every day throws up a different name .\" There's so many different players, particularly as the window in Europe opens and gets going post World Cup; there'll be more and more opportunities. \"Bobo and Mierzejewski scored a combined 40 goals in the 2017-18 season, underling the immense void the Sky Blues are attempting to fill. Captain Alex Brosque--who has scored more goals and made more appearance for Sydney FC than any other player--insists the duo's departure won't change the way his side plays .\" Our style, defensively how aggressive we are...that won't change, \"Brosque said .\" The boys that come in will have to adapt to that and learn that quickly. \"Adrian and Bobo leave a very big hole, when you consider what they did last season, but it's the way football is .\" They'll leave and new players will replace them and do just as good a job. \"Comments Use a Facebook account to add a comment, subject to Facebook's Terms of Service and Privacy Policy. Your Facebook name, photo & other personal information you make public on Facebook will appear with your comment, and may be used on ESPN's media platforms. Learn more. Sydney FC Australian A-League", "articleID": "2018071907_00284814_W", "names": {"Fernando Torres": ["Q3821470", "Q42731", "Q47088453", "Q58658056"]}}, {"date": "2018-07-19", "url": "https://www.theepochtimes.com/trump-rejects-putins-offer-asks-for-extradition-of-indicted-officers_2598502.html", "content": "Trump Presidency Politics Related Rand Paul Defends Trump Amid Backlash Over Summit With Putin Trump Rejects Putin's Offer, Asks for Extradition of Indicted Officers By Ivan Pentchoukov July 19, 2018 6:35 pm Last Updated: July 19, 2018 7:39 pm President Donald Trump and the Russian President Vladimir Putin hold a joint press conference at the Presidential Palace in Helsinki, Finland, on June 16, 2018. (Samira Bouaou/The Epoch Times) Share Tweet Share Email LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON President Donald Trump has declined Russian President Vladimir Putin's offer to interrogate the 12 Russian intelligence officers indicted on charges linked to attempted interference in the 2016 U.S. presidential election. At the July 16 summit in Helsinki, Putin offered to submit a request for Russian law enforcement to interrogate the 12 officers, who were charged days before the meeting. The Russian leader further offered to allow members of special counsel Robert Mueller's team travel to Russia and observe the interrogation, under the condition that the United States reciprocate the concession. \"It is a proposal that was made in sincerity by President Putin, but President Trump disagrees with it,\" White House press secretary <mark>Sarah Sanders</mark> said in a statement on July 19. \"Hopefully, President Putin will have the 12 identified Russians come to the United States to prove their innocence or guilt .\" Mueller filed the indictment against the Russian officers on July 13 at the U.S. Court for the District of Columbia. The indictment charges that the Russians hacked into Democratic computer systems, stole emails and files, and disseminated the loot with the intention of interfering in the 2016 election. The United States does not have a standing extradition treaty with Russia. Complicating matters further, since 2014, members of Russia's active military, intelligence, and law enforcement are prohibited by an internal directorate from traveling outside Russia, except to a few countries including China and Vietnam. All 12 of the Russian nationals named in the indictment are members of the Russian military intelligence agency formerly known as the GRU. In addition, the Russian constitution shields its citizens from extradition and deportation. As a result, extradition of nationals from Russia is extremely difficult and rare. The United States has succeeded in extraditing several Russian nationals for computer crimes in recent years, but in all cases, they were not in Russia at the time of the extradition. During the summit, Putin referenced a treaty between the United States and Russia that allows for cooperation between the two nations on criminal investigations. Signed in 1999 by President Bill Clinton and approved by the Senate in 2001, the treaty establishes a process for law enforcement agencies to carry out criminal investigations at the request of their counterparts. Trump's rejection of the offer comes after a nearly four-day media onslaught following the summit. Major news outlets with a track record of anti-Trump coverage seized on his remarks at the summit to paint a picture of American surrender. Despite measured statements by both leaders and signals of a warming relationship, commentators compared the summit to Pearl Harbor and 9/11. \"The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media,\" Trump wrote on Twitter on July 19. The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media. I look forward to our second meeting so that we can start implementing some of the many things discussed, including stopping terrorism, security for Israel, nuclear....... .--Donald J. Trump (@ realDonaldTrump) July 19, 2018.... proliferation, cyber attacks, trade, Ukraine, Middle East peace, North Korea and more. There are many answers, some easy and some hard, to these problems...but they can ALL be solved!--Donald J. Trump (@ realDonaldTrump) July 19, 2018 \"I look forward to our second meeting so that we can start implementing some of the many things discussed, including stopping terrorism, security for Israel, nuclear proliferation, cyber attacks, trade, Ukraine, Middle East peace, North Korea and more,\" he wrote. \"There are many answers, some easy and some hard, to these problems...but they can ALL be solved!\" At the summit, Putin said that Russia didn't meddle in the 2016 election. Standing alongside Putin, Trump told reporters that he has confidence in American intelligence agencies and that Putin offered him a \"powerful\" denial when they met in private. After the summit, and with the media in overdrive about his comments, Trump corrected a single word from his statement in Helsinki and again affirmed his support of the U.S. intelligence agencies. \"It should have been obvious. I thought it would be obvious, but I would like to clarify, just in case it wasn't. In a key sentence in my remarks, I said the word\" would' instead of \"wouldn't,'\" Trump said on July 18. \"The sentence should have been,\" I don't see any reason why it wouldn't be Russia .' \"Trump's request for the Russian officers to stand trial mimics Putin's own take on how the meddling allegations can be resolved. When discussing the allegations at the summit, Putin told a reporter that only a court of law could have the final say on the issue .\" Do you believe the United States is a democracy? \"Putin said .\" And if so, if it is a democratic state, then the final conclusion in this kind of dispute can only be delivered by a trial by the court, not by the executive--by the law enforcement. \"In announcing the charges against the Russian officers, Deputy Attorney General Rod Rosenstein said that the indictment contains no allegation of a crime by an American citizen. Rosenstein noted that Trump was briefed on the charges ahead of the announcement. Watch Next: US Leaves UN Human Rights Council\" If the righteous many do not confront the wicked few, then evil will triumph. \"Share Tweet Share Email ❯ See more Trump Presidency Democrats' Lack of Support for ICE Could Hurt in Midterms July 19, 2018 Trump Thanks Novartis, Pfizer for Putting Off Drug Price Hikes July 19, 2018 Kavanaugh's Former Students Send Letter to Senate July 19, 2018 Editor's Picks In Photos: President Trump and the First Lady's Trip to Europe Read more President Trump:\" Where Is the Server?' President Donald Trump, during a joint press conference with Russian President Vladimir Putin, questioned what happened to three...Read more Barclays Leads European Banks' Pursuit of Risky US Debt When an indebted infant health-care company in Atlanta wanted to borrow hundreds of millions of dollars to buy...Read more Trump and Putin Finish Meetings on a High Note Update at 7:25 p.m. local time / 12:25 a.m. EDT Trump and Putin finished their time together with...Read more", "articleID": "2018072000_00137230_W", "names": {"Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}}, {"date": "2018-07-20", "url": "http://saukvalley.com/2018/07/20/standard-man-guilty-of-sister-in-laws-death/at9rgsy/", "content": "Dave Cook/Shaw Media Caption Clifford A. Andersen Jr., 68, of Standard is wheeled away by a Putnam County deputy sheriff after a Putnam County jury found him guilty Friday of first-degree murder and the concealment of the homicidal death of Deborah Dewey, 62, of Ladd, in 2016. The jury deliberated most of Friday afternoon before announcing its verdict in the 8-day trial. HENNEPIN--A 68-year-old Standard man is guilty of bludgeoning his 62-year-old sister-in-law to death and burying her in a yard near his home, a Putnam County jury ruled late this afternoon. Clifford A. Andersen Jr., who bashed in 62-year-old Deborah Dewey's head, will be sentenced Aug. 23--the 2-year anniversary of her disappearance--for first-degree murder and concealment of her homicide. He faces a minimum of 20 years and up to life in prison with no possibility of parole. The Ladd woman was reported missing on Aug. 23, 2016; her body was found that Sept. 12 buried in the yard of a vacant home blocks from Andersen's, which he cared for. His DNA was mixed with hers in blood that was found inside the home. \"Justice for Debbie has been a long time coming,\" Dewey's niece, Sue Marshall, said this afternoon. The 2-week trial, presided over by Judge Stephen A. Kouri, featured 55 witnesses and more than 600 exhibits. Andersen, who gambled and had taken out numerous high-interest payday loans, was getting money from Dewey, who finally decided to cut him off. That, the prosecution said, was the motive for the killing. Standard man guilty of sister-in-law's death New law better protects DCFS workers Police reports for Friday, July 20, 2018 Dixon man sought in hit-and-run; two other felony cases pending Andersen admits to affair with murder victim Pro Football Weekly welcomes Brian Urlacher, Mean <mark>Joe Greene</mark>, Lawrence Taylor, Anthony Munoz, <mark>Randy White</mark> and Dan Hampton! get tickets now Tweets from https: //twitter.com/saukvalley/lists/svm-news-sports-staff Do you support or oppose the permanent income tax increase for individuals and corporations that the Illinois Legislature approved over Gov. Rauner's veto? I support it I oppose it Not sure No opinion Vote! Show results", "articleID": "2018072100_00177914_W", "names": {"Joe Greene": ["Q505256", "Q6210111", "Q982412"], "Randy White": ["Q1849885", "Q2565823", "Q7292511", "Q7292512", "Q7292513", "Q7292514"]}}, {"date": "2018-07-24", "url": "https://news.nationalpost.com/news/toronto/toronto-danforth-shooting-victim-reese-fallon?video_autoplay=true", "content": "Reese Fallon, 18, a recent Toronto high school graduate and political activist who was set to study nursing in the fall, was identified by her family Monday as one of two people killed in a shooting rampage Sunday night. She spent the evening celebrating a birthday with two friends with dinner at a downtown pizza restaurant, before heading to the Danforth. A woman who answered the phone at the Fallon family's east-end Toronto home said they are devastated and asked that their privacy be respected. She identified herself as a family friend, but did not wish to be named. \"She was the nicest person--enjoying her life, living her life. She did not deserve to die this way,\" said her friend Frank Hong, who met her in April at the federal Liberal convention in Halifax, where Fallon was part of the Young Liberals delegation, talking politics and sizing up candidates. \"She had a promising life ahead of her .\" Danforth shooting victim Reese Fallon. Facebook She did not deserve to die this way In the 2015 federal election, Fallon volunteered as a canvasser for Nathaniel Erskine-Smith, Liberal MP for her home riding of Beaches-East York. \"She was smart, passionate, energetic and out to make a difference in the world,\" Erskine-Smith said in an interview. \"This is a huge loss .\" One of Fallon's dinner companions on Sunday was Samantha Price. Snapping a picture from what appeared to be a hospital bed Monday, Price wrote on Instagram: \"Thank you to everyone who has been supportive during this time. It was truly devastating to have gone through this experience. My heart goes out to the other families suffering through this .\" Social media postings indicate Fallon graduated this year from Malvern Collegiate Institute, and was set to study nursing at McMaster University in Hamilton in the fall. Carrie Lauren Fallon, who identified herself as Reese Fallon's cousin on social media, posted a link to news coverage of the shooting on Monday morning, with the comment: \"My beautiful cousin. My heart hurts seeing this everywhere. Seeing my friends <mark>mark</mark> themselves as safe on Facebook. But Reese can't <mark>mark</mark> herself safe. I'm so devastated for her and her family. I'm in f--king shock .\" Reese Fallon was identified on Monday as the 18-year-old victim of the Danforth shooting in Toronto. Facebook The Toronto District School Board said in a statement it was \"heartbroken,\" and called Fallon \"an engaging student\" who was \"highly regarded by staff and loved by her friends .\" Director of education John Malloy said the school will open on Tuesday, despite summer holidays, and flags at Malvern and all school board administrative buildings will fly at half-staff. The other victim who died, identified by police as a 10-year old Toronto-area girl, has not been publicly named. It is not known where Fallon was along the strip of Danforth Avenue, where a gunman shot 15 people, prompting mass casualty responses at Toronto hospitals. But the 15 victims were found on the street, in a restaurant, an ice cream parlour, a coffee shop, and other places in Toronto's Greektown. Video shot from an apartment above a store shows a man dressed in black firing at least three times into an ice cream parlour from the sidewalk. Police were urging witnesses to immediately contact police to report what they may have seen or heard. Given the time, around 10 p.m. on a warm summer night, the Danforth would have been busy with hundreds of people. Video screenshot of the suspected gunman who opened fire in Toronto's Greektown. @ arilanise / Instagram The emergency medical response was the largest since the van attack on Yonge Street in April. St. Michael's Hospital in the downtown core received five patients, of whom three underwent immediate life-saving surgery for gunshot wounds, according to Dr. Najma Ahmed, the acting medical director of trauma. She said all remained in serious but stable condition on Monday. Sunnybrook Hospital in north Toronto received three patients with gunshots, of whom two are now in good condition, and one in critical but stable condition, according to spokeswoman Laura Bristow. The 15 victims ranged in age from 10 to 59, with injuries ranging from minor to fatal, Toronto Police Chief <mark>Mark Saunders</mark> said at a Monday afternoon press conference. He said family members of all victims have been notified. The 29-year-old male shooter also died after being shot. His death, whether by suicide or police fire, is the subject of a separate investigation by the Special Investigations Unit. The SIU identified him Monday evening as Faisal Hussain. Police line the street at the scene where a gunman shot more than a dozen people on Danforth Avenue in Toronto, Ontario, July 23, 2018. Tyler Anderson / National Post Bonnie Levine, executive director of Victim Services Toronto, a charity that works with police to provide immediate short-term assistance to victims of trauma, urged people deeply affected by the shootings to contact her agency for help. \"We know that these events have far-ranging effects. We know that, not only do people who were at the Danforth and in the shops and those who were injured and families of those who are deceased, are affected, but it can also be triggering for anyone who was at the April 23 van attack .\" These situations really can compound the trauma. If anyone is needing any type of support, our services are offered 24 hours a day, 365 days a year, \"she said. The phone number is 416-808-7066. Det.-Sgt. Terry Browne, the lead investigator for Toronto Police, described\" a moving scene \"that was\" very rapid and fluid \"and the investigation is focused on several\" scenes within the scene. \"He said a key question is whether there were other people involved. With files from Joe O’Connor • Email: jbrean @ nationalpost.com | Twitter: josephbrean", "articleID": "2018072402_00235876_W", "names": {"Mark Saunders": ["Q20006905", "Q4428797", "Q56724352", "Q6769597"]}}, {"date": "2018-07-24", "url": "http://wbtv.com/story/38712403/man-in-nh-dies-after-yellow-jacket-stings-him", "content": "Man in NH dies after yellow jacket stings him - | WBTV Charlotte Man in NH dies after yellow jacket stings him - | WBTV Charlotte Member Center: Man in NH dies after yellow jacket stings him 2018-07-24T05:49:12 Z2018-07-24T05:49:12 Z Family members describe 34-year-old <mark>Brian Baker</mark> Jr. as a man with a \"heart of gold\" who \"always had good intentions .\" (Source: Mandi Baker/WMUR/CNN) WINCHESTER, NH (WMUR/CNN)--The family of a New Hampshire man who died after he was stung by a yellow jacket is sharing his story to encourage others to undergo allergy testing, even as an adult. Family members describe 34-year-old <mark>Brian Baker</mark> Jr. as a man with a \"heart of gold\" who \"always had good intentions .\" \"He would do anything for anyone,\" said his wife, Mandi <mark>Baker</mark>. <mark>Baker</mark> Jr. died Wednesday from an allergic reaction to two stings from a yellow jacket. He had been doing electrical work outside on his deck July 14 when he was stung. After her husband was stung, Mandi <mark>Baker</mark> jumped into action, administering an EpiPen as she dialed 911. \"I had him cooling with wet towels, and I believe he started to stop breathing before the ambulance was even there,\" Mandi <mark>Baker</mark> said. Eventually, <mark>Baker</mark> Jr. ended up in the intensive care unit at a Manchester, NH, hospital. \"Rescue personnel really went--everything to keep <mark>Brian</mark> with us and give him a chance. They performed CPR on him for 40 to 45 minutes, just to give him that chance,\" said the man's father, <mark>Brian Baker</mark> Sr.. Unfortunately, the 34-year-old died from his injuries. Family said it's tragic that such a strong man could be overcome by two stings. They want to share his story in hopes that it may save lives. <mark>Baker</mark> Jr. found out about his allergy only two years ago, and experts say that can often be the case. \"If they have any kind of reaction distant from the sting site, such has hives or the same kind of symptoms previously described--tightness, problems breathing, those kinds of symptoms--they should see an allergist and have testing done,\" said Dr. Marie-Helen Sajous of Dartmouth Medical Center. <mark>Baker</mark> Jr. was an organ donor, and his family said it brings them some peace knowing his death may change someone's life for the better. Copyright 2018 WMUR, Mandi <mark>Baker</mark> via CNN. All rights reserved. Raycom reports Raycom reports More>> Tuesday, July 24 2018 1:49 AM EDT 2018-07-24 05:49:12 GMT Updated: Tuesday, July 24 2018 1:49 AM EDT 2018-07-24 05:49:12 GMT Family members describe 34-year-old <mark>Brian Baker</mark> Jr. as a man with a \"heart of gold\" who \"always had good intentions .\" (Source: Mandi Baker/WMUR/CNN) The 34-year-old was working outside on his deck when he was stung twice and had an allergic reaction. Monday, July 23 2018 3:05 AM EDT 2018-07-23 07:05:17 GMT Updated: Tuesday, July 24 2018 1:46 AM EDT 2018-07-24 05:46:06 GMT (AP Photo/Carolyn Kaster, File). FILE - In a Wednesday, June 27, 2018 file photo, Veterans Affairs Secretary nominee Robert Wilkie is sworn in at the start of a Senate Veterans Affairs Committee nominations hearing on Capitol Hill in Washington. Wilkie...The Senate on Monday confirmed Pentagon official Robert Wilkie to be secretary of Veterans Affairs. Monday, July 23 2018 12:35 AM EDT 2018-07-23 04:35:01 GMT Updated: Tuesday, July 24 2018 12:46 AM EDT 2018-07-24 04:46:13 GMT President Donald Trump issued an all-caps warning via Twitter to Iranian President Hassan Rouhani overnight. (Source: CNN) Trump has a history of firing off heated tweets that seem to quickly escalate long-standing disputes with leaders of nations at odds with the U.S. Sunday, July 22 2018 11:44 PM EDT 2018-07-23 03:44:54 GMT Updated: Tuesday, July 24 2018 12:03 AM EDT 2018-07-24 04:03:46 GMT Police have not yet released a possible motive for the suspect. Monday, July 23 2018 4:12 PM EDT 2018-07-23 20:12:42 GMT Updated: Monday, July 23 2018 11:51 PM EDT 2018-07-24 03:51:13 GMT Nia Wilson, 18, was murdered at a BART station in Oakland on Sunday night, and her sister was taken to the hospital.", "articleID": "2018072406_00122404_W", "names": {"Brian Baker": ["Q4963025", "Q4963026", "Q4963027", "Q4963029", "Q53329", "Q911812"]}}, {"date": "2018-07-26", "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/james-moore-biddulph-brindley-ford-1820180", "content": "News Terrifying ordeal of \"screaming' girl, 13, sexually assaulted on cycle path by this pervert Sex offender had approached a 28-year-old woman just an hour earlier Share By Stoke-on-Trent Live 05:00, 26 JUL 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Get Daily updates directly to your inbox + Subscribe See our privacy notice Thank you for subscribing! Could not subscribe, try again later Invalid Email Pervert <mark>James Moore</mark> grabbed a 13-year-old girl before sexually assaulting her as she cycled away from a park. The victim - who was with a younger child at the time - suffered\" significant psychological harm' and is now afraid to play outside following the terrifying incident near Brindley Ford park. It happened just an hour after a 28-year-old woman fled when <mark>Moore</mark> approached her and asked if she had a boyfriend. Now the 28-year-old defendant - who has 40 previous convictions - has been handed a 26-month prison sentence after pleading guilty to the sexual assault and riding a motorbike while disqualified. Stoke-on-Trent Crown Court heard last year's incident happened on a bridge across Whitfield Greenway. Read More Bogus security guard who opened shutters to reveal this massive cannabis factory told cops: \"This will make your day' <mark>James Moore</mark> has been sentenced to 26 months Prosecutor <mark>Brian McKenna</mark> said:\" The two children saw the defendant standing on the bridge next to a motorbike. As they passed him he asked the girl if she had a boyfriend and she said that she didn't and moved on. Read More Man dragged his partner though the streets by her HAIR - after they accused each other of being unfaithful \"He then grabbed his victim around the waist with one hand and held her as she tried to wriggle free. He placed his other hand down her leggings for a few seconds. He let her go and the two rode off and were shaken. They called for help and police were contacted. The victim had been at Brindley Ford Park\" The defendant was arrested the following day. He made no comment in his interview and denied any sexual touching. But they held an identification parade and he was picked. The victim's clothing was sent off for analysis and it showed the defendant's DNA on the inside of her leggings. \"<mark>Moore</mark>, of St John's Road, Biddulph, also admitted failing to appear in court last month. Read More This paedophile groomed a schoolgirl before putting hand down her pyjama bottoms <mark>Jason Holt</mark>, mitigating, said:\" It is certainly behaviour that's bizarre in the extreme. This was someone under the influence of a substance and drink behaving in an erratic way. He was not planning on assaulting people and he was not targeting young people. \"<mark>James Moore</mark> was on a bridge near the park The court heard the girl was\" screaming' when she contacted her mum. Read More Handyman caught with knuckle duster in his man bag tells court: \"It was a souvenir' Judge Paul Glenn said:\" The girl's statement is quite moving and no girl of her age should feel like that. She speaks of feeling unsafe and fearful even when playing out in the street. She must have been terrified at both the time and during the aftermath. She will have suffered significant psychological harm. \"<mark>Moore</mark> was also handed a 12-month driving ban which will take effect when he is released from prison. Like us on Facebook Follow us on Twitter Daily Newsletter sentinelstaffs Follow @ Sotlive Subscribe to our Daily newsletter Enter email Subscribe More On Stoke-on-Trent Crown Court Biddulph Crime Courts", "articleID": "2018072604_00032779_W", "names": {"Brian Mckenna": ["Q20090341", "Q2924955"]}}]