[{"date": "2018-07-26", "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/james-moore-biddulph-brindley-ford-1820180", "content": "News Terrifying ordeal of \"screaming' girl, 13, sexually assaulted on cycle path by this pervert Sex offender had approached a 28-year-old woman just an hour earlier Share By Stoke-on-Trent Live 05:00, 26 JUL 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Get Daily updates directly to your inbox + Subscribe See our privacy notice Thank you for subscribing! Could not subscribe, try again later Invalid Email Pervert <mark>James Moore</mark> grabbed a 13-year-old girl before sexually assaulting her as she cycled away from a park. The victim - who was with a younger child at the time - suffered\" significant psychological harm' and is now afraid to play outside following the terrifying incident near Brindley Ford park. It happened just an hour after a 28-year-old woman fled when <mark>Moore</mark> approached her and asked if she had a boyfriend. Now the 28-year-old defendant - who has 40 previous convictions - has been handed a 26-month prison sentence after pleading guilty to the sexual assault and riding a motorbike while disqualified. Stoke-on-Trent Crown Court heard last year's incident happened on a bridge across Whitfield Greenway. Read More Bogus security guard who opened shutters to reveal this massive cannabis factory told cops: \"This will make your day' <mark>James Moore</mark> has been sentenced to 26 months Prosecutor <mark>Brian McKenna</mark> said:\" The two children saw the defendant standing on the bridge next to a motorbike. As they passed him he asked the girl if she had a boyfriend and she said that she didn't and moved on. Read More Man dragged his partner though the streets by her HAIR - after they accused each other of being unfaithful \"He then grabbed his victim around the waist with one hand and held her as she tried to wriggle free. He placed his other hand down her leggings for a few seconds. He let her go and the two rode off and were shaken. They called for help and police were contacted. The victim had been at Brindley Ford Park\" The defendant was arrested the following day. He made no comment in his interview and denied any sexual touching. But they held an identification parade and he was picked. The victim's clothing was sent off for analysis and it showed the defendant's DNA on the inside of her leggings. \"<mark>Moore</mark>, of St John's Road, Biddulph, also admitted failing to appear in court last month. Read More This paedophile groomed a schoolgirl before putting hand down her pyjama bottoms <mark>Jason Holt</mark>, mitigating, said:\" It is certainly behaviour that's bizarre in the extreme. This was someone under the influence of a substance and drink behaving in an erratic way. He was not planning on assaulting people and he was not targeting young people. \"<mark>James Moore</mark> was on a bridge near the park The court heard the girl was\" screaming' when she contacted her mum. Read More Handyman caught with knuckle duster in his man bag tells court: \"It was a souvenir' Judge Paul Glenn said:\" The girl's statement is quite moving and no girl of her age should feel like that. She speaks of feeling unsafe and fearful even when playing out in the street. She must have been terrified at both the time and during the aftermath. She will have suffered significant psychological harm. \"<mark>Moore</mark> was also handed a 12-month driving ban which will take effect when he is released from prison. Like us on Facebook Follow us on Twitter Daily Newsletter sentinelstaffs Follow @ Sotlive Subscribe to our Daily newsletter Enter email Subscribe More On Stoke-on-Trent Crown Court Biddulph Crime Courts", "articleID": "2018072604_00032779_W", "names": {"James Moore": ["Q16231821", "Q1680851", "Q21099520", "Q28444878", "Q3161289", "Q3806683", "Q48815536", "Q6139963", "Q6139968", "Q6139971", "Q6139973"], "Jason Holt": ["Q18044104", "Q57196134", "Q6162724"]}}, {"date": "2018-07-27", "url": "https://www.vanityfair.com/hollywood/2018/07/cbs-les-moonves-sexual-misconduct-allegations", "content": "By Taylor Hill/FilmMagic. On Friday morning, the CBS board of directors announced that it will investigate sexual misconduct claims made against Les Moonves, the network's C.E.O. \"All allegations of personal misconduct are to be taken seriously,\" the board stated in a press release. \"The Independent Directors of CBS have committed to investigating claims that violate the Company's clear policies in that regard. Upon the conclusion of that investigation, which involves recently reported allegations that go back several decades, the Board will promptly review the findings and take appropriate action .\" The announcement arrived hours before The New Yorker was reportedly set to publish an exposé from Ronan Farrow, the Pulitzer Prize--winning journalist whose reporting on Harvey Weinstein helped fell the Hollywood mogul and crystalize the current Time's Up and #MeToo movements. Farrow's forthcoming report, according to The Hollywood Reporter, is said to accuse Moonves of \"unwanted kissing and touching that occurred more than 20 years ago, as well as numerous claims that occurred more recently .\" (The CBS board's statement did not mention Moonves by name, but did reference a pending New Yorker article .) CBS also noted the timing of the new claims--as arriving \"in the midst of the Company's very public legal dispute .\" This past May, Vanity Fair's William D. Cohan reported that the battle between Moonves and Shari Redstone, whose family currently controls both CBS and Viacom, for command over the network had gone \"nuclear\" --with CBS attempting to wrest voting power away from the Redstones. Shari, the heir apparent to father Sumner Redstone's media kingdom, has been hoping to merge the companies that her father split into two publicly traded corporations. Moonves and the CBS board sued Shari in hopes of preventing the merger. The suit is set to be argued in court in October. Get Vanity Fair's HWD Newsletter Sign up for essential industry and award news from Hollywood. E-mail Address Subscribe Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement. Share Email Facebook Twitter <mark>Julie Miller</mark> <mark>Julie Miller</mark> is a Senior Hollywood writer for Vanity Fair's website.", "articleID": "2018072718_00195505_W", "names": {"Julie Miller": ["Q25190310", "Q2569812"]}}, {"date": "2018-07-28", "url": "https://www.football365.com/news/sokratis-things-will-be-much-better-in-arsenals-defence", "content": "Home Arsenal Sokratis: \"Things will be much better' in Arsenal's defence Share this Page Sokratis:\" Things will be much better' in Arsenal's defence Date published: Saturday 28th July 2018 9:09 Sokratis has explained how \"things at the back will be much better\" for Arsenal this season. Arsenal purchased Sokratis from Borussia Dortmund for £ 17.7 million this summer, arriving as instead of a marquee signing. a warrior The Greece international has echoed that sentiment with an insight into new manager Unai Emery's tactical preparation. \"A lot of coaches and a lot of teams now look at only how to play, not how to defend,\" Sokratis said. \"But with the new coach we work also on the situations when we don't have the ball and this is very important .\" On the first day, the coach worked on this. \"With him, all the players we work on tactics, we look a lot at videos, what was wrong, what we have to do better .\" I think and hope this year things at the back will be much better. \"Thirty is the best age for a defender, so for the next three or four years I would like to give everything for the team. I want to win with this team .\" With Borussia, with Milan, with Genoa, for 10 years now I have been outside Greece and of course I have experience. \"I feel very good and I'm working on the pitch and also off the pitch to help all the young guys to be very good with us .\" I am here to show I am first a defender and after that comes everything else. \"I played with Nesta, that was one big school for me .\" Also with <mark>Thiago Silva</mark>, great players to learn from--they were defenders who were defenders first. \"I learned a lot and now I am ready to give what I know .\" ", "articleID": "2018072809_00050040_W", "names": {"Thiago Silva": ["Q210453", "Q59245327", "Q604996", "Q7783822"]}}, {"date": "2018-07-29", "url": "http://indiatoday.intoday.in/india/tamil-nadu/story/photo-of-karunanidhi-in-kauvery-hospital-out-condition-stable-1299475-2018-07-29", "content": "A photograph from inside the Kauvery Hospital in Chennai where DMK chief M Karunanidhi is admitted has surfaced today. It shows Vice President M Venkaiah Naidu meeting Karunanidhi for inquiring about his health condition. Along with Naidu were Tamil Nadu Governor Banwarilal Purohit and Karunanidhi's family members. Naidu said doctors informed that Karunanidhi's condition was stable. \"Visited Kaveri Hospital and met former Chief Minister Thiru Kalaignar Karunanidhi. Met his family members and doctors and enquired about his health. Doctors said he is stable. Wish him a speedy recovery,\" Naidu tweeted. Last night, the hospital had said, \"Karunanidhi's health condition continues to remain stable with ongoing active medical support. He is continuously being monitored and treated by the panel of expert doctors in the ICU .\" The 94-year-old DMK president, who is being treated for fever due to urinary tract infection, was admitted to the Intensive Care Unit (ICU) of Kauvery Hospital yesterday following a dip in his blood pressure. Besides Naidu, TMC leader <mark>Derek O'Brien</mark> also visited the hospital. \"I came here on behalf of the TMC and Mamata Banerjee. I met M K Stalin and Kanimozhi and inquired about Karunanidhi's health,\" <mark>O'Brien</mark> said. With inputs from PTI READ MORE | DMK patriarch Karunanidhi's health condition continues to remain stable ALSO WATCH | Karunanidhi's well-wishers gather in large numbers outside hospital", "articleID": "2018072910_00135037_W", "names": {"Derek O'Brien": ["Q5262230", "Q5262231", "Q5262233", "Q5262236"]}}, {"date": "2018-07-30", "url": "http://hardenexpress.com.au/story/5556502/gibson-believes-folau-is-happy-at-tahs/", "content": "NSW Waratahs are hopeful they'll retain Israel Folau, who is yet to confirm his playing future. NSW Waratahs coach Daryl Gibson says there's every indication his superstar back Israel Folau is happy at the Super Rugby club and he's also backed captain <mark>Michael Hooper</mark> to be fit for Australia's first Rugby Championship game. Australia's representation in the Super Rugby competition ended last weekend when the Waratahs lost their semi-final to the Lions in Johannesburg. With teams travelling overseas in the finals disadvantaged, Gibson liked the idea of having a break during the series, along the lines of the NFL, where there is a week off before the Superbowl. NSW arrived home on Monday, with their established Test stars not having to go into the Wallabies camp until Sunday. Gibson expected some of their other players on the fringe of the Wallabies squad to get a run in Friday's trial game in Sydney. Speculation has surrounded Folau's future, with suggestions he could head to Queensland, though Gibson remained hopeful the star back would stick with the Tahs \"Obviously a lot of those negotiations are with Rugby Australia, but certainly every indication is that Israel is really happy here,\" said Gibson, who is soon expected to re-sign as head coach for another two years. Wallabies and Waratahs leader and flanker <mark>Hooper</mark> hasn't played since injuring his hamstring early in the final Test against Ireland on June 23, missing the Tahs last five games, Gibson expects the forward to be right for the August 18 clash with the All Blacks in Sydney. \"Hoops is tracking really well,\" Gibson said. \"I know he's getting a little frustrated with the delay and where he wants to be, but certainly he's on course, from what I understand, to be available for that Bledisloe .\" Gibson felt Australian players were in a good space going into that game. \"I think it's been a good year for Australian rugby in terms of Super Rugby,\" he said. \"In my view, the gap is closing against New Zealand, particularly the performances of all Australian sides against New Zealand opposition this year, so I think we're trending and heading in the right direction .\" Gibson endorsed the trial between the Wallabies squad and a team primarily comprised of other players drawn mostly from Super Rugby sides. \"I think it's become vital now, the short preparation time, getting a new team together and giving it a hitout against some quality opposition,\" he said. \"I think its the right thing, but finding that opposition is a bit tough at the moment, but I fully support what Australia are doing .\" He will be reviewing the Tahs roster with some spots to fill, with backs Taqele Naiyaravoro, <mark>Andrew Kellaway</mark> and Irae Simone leaving and veteran prop <mark>Paddy Ryan</mark> not having his contract renewed. Australian Associated Press facebook SHARE twitter TWEET email whatsapp", "articleID": "2018073011_00037463_W", "names": {"Andrew Kellaway": ["Q21621665", "Q4757590"], "Michael Hooper": ["Q6831231", "Q6831232"], "Paddy Ryan": ["Q55375304", "Q7123620"]}}, {"date": "2018-07-30", "url": "https://www.4ni.co.uk/northern-ireland-news/247857/charity-leaders-raise-concerns-over-ongoing-political-instability", "content": "30/07/2018 Charity Leaders Raise Concerns Over Ongoing Political Instability Charities and social enterprises in Northern Ireland are concerned about politically instability and believe action is needed to ensure decisions can be made in the absence of an Executive. The views of charity and social enterprise bosses have been revealed in the latest Ulster Bank and CO3 3rd Sector Index. Published by CO3 Chief Officers 3rd Sector, the report is a key barometer of Northern Ireland's third sector, involving a quarterly survey of CO3 members, who include the leaders of some of Northern Ireland's largest charities and social enterprises. Services they provide range from care, to counselling and support, as well as training and development. A total of 65% of respondents believe that political instability in Northern Ireland will worsen over the year ahead and almost two-thirds expect the Northern Ireland economy to deteriorate over the same period, an increase on the previous quarter (61%). As fears for the economy and political instability continue, almost three quarters (72%) of third sector leaders advocate for a shift in the political decision-making process. While opinion is mixed, only 24% believe in maintaining the status quo, opting for civil servants to make decisions about Northern Ireland in the absence of a Stormont Executive. Overall, third sector leaders believe the responsibility for making decisions about Northern Ireland should fall with the Secretary of State (27%), a joint British-Irish intergovernmental conference (25%) or a Citizens' Assembly (20%). One respondent to the survey said: \"Having no decision makers, having no decisions being made, having civil servants who are afraid to commission anything new and being stuck in contracts that are out of date, under paying us and undervaluing us is frustrating and leaving us unable to have much flexibility in responding to the needs of our groups .\" Despite the uncertain environment though, respondents say that their organisations continue to increase employment and remain optimistic that turnover will increase. The latest report shows an increase in employment levels to deal with an increasing demand for services, with 33% of organisations increasing their headcount in the past quarter, the highest rate of increase over the previous 12 months. This comes as organisations are once again reporting continued increases in demand for their services (67%). As a result, 74% expect their turnover to increase or remain the same. Nora Smith, Chief Executive of CO3, said: \"Once again, the political situation in Northern Ireland remains a key concern for third sector organisations and one which they don't expect to improve. Our latest report demonstrates that the lack of a government is impacting on the sector however the resilience of organisations is also apparent. What is clear is that the third sector needs government decisions to be made and the majority feel that the current situation where decisions aren't being made is unsustainable .\" <mark>Richard Ramsey</mark>, Chief Economist, NI, at Ulster Bank added: \"Despite no shortage of political uncertainty, the Northern Ireland economy has been resilient in the past year, with private sector activity continuing to increase and labour market statistics posting a number of records of the positive variety. The latest Ulster Bank and CO3 Third Sector Index suggests that this is being reflected in the third sector where despite issues being created by a lack of decision-making including in relation to funding, third sector organisations report that they are seeing growing demand and are increasing their headcount. Whether this is sustainable in a situation where political stalemate continues and the economy as a whole feels the increasing squeeze of rising inflation and stagnant wages remains to be seen .\" (MH/LM) Charity Leaders Raise Concerns Over Ongoing Political Instability Charities and social enterprises in Northern Ireland are concerned about politically instability and believe action is needed to ensure decisions can be made in the absence of an Executive. The views of charity and social enterprise bosses have been revealed in the latest Ulster Bank and CO3 3rd Sector Index. 30 July 2018 Britain First in Northern Ireland is \"imploding\" , according to Alliance Strangford MLA Kellie Armstrong. Ms Armstrong joined a counter-protest against the alleged far-right organisation in Newtownards, Co Down on Saturday, 28 July. 30 July 2018 Police are appealing for information and witnesses following a report of criminal damage caused to a number of vehicles in Rostrevor. 30 July 2018 Green Party Leader Steven Agnew To Step Down Green Party leader and MLA, Steven Agnew, has announced that he will step down from his position later this year. Mr Agnew, who has led the party for seven years, will continue as MLA for his North Down constituency. The Green Party will now begin the process to elect a new leader, which is expected to conclude in the autumn. 30 July 2018 Four DUP MLA's Accused Of Failing To Declare Donations For Israel Trip Four out of six DUP MLA's who made trips to Israel have allegedly failed to make complete donation reports, according to a report by BBC News NI. According to the report, six MPs from the party declared receiving donations from NI Friends of Israel of £ 2,700 each, which was used to pay for a four-day trip they undertook in May. 30 July 2018 Police Appeal For Information On North Belfast Burglary Police have issued an appeal for information following the burglary of an elderly woman's home in north Belfast. Thieves broke into the property on the Old Cave Hill Road at about 8am on Sunday, 29 July. It is understood that the elderly homeowner was in the house at the time of the burglary but was not harmed. 30 July 2018 Loyalist Paramilitaries Order North Belfast Woman To Leave Her Home - SF A woman in North Belfast has allegedly been threatened and ordered to leave her home by loyalist paramilitaries, according to Sinn Féin MLA Carál Ní Chuilín. The North Belfast MLA said that the woman's son \"died tragically only days ago\" and reported that her home was attacked hours after a warning was issued on Sunday, 29 July. 30 July 2018 Suspected Hate Crime At Kingsmill Memorial Investigated An investigation has been launched into a suspected sectarian hate crime after an Irish flag was nailed to a Kingsmill memorial. 27 July 2018 Men Arrested After Drugs Found At Carrickfergus Crash Site Two men have been arrested for motoring and drug offences after a quantity of drugs were discovered following a road traffic collision in Carrickfergus. Police responded to reports of a collision on the Larne Road at around 1.15 am this morning, 27 July. 27 July 2018 The jailing of a 59-year-old west Belfast woman for non-payment of her TV license has been described as \"an appalling misuse of justice and tax payers money\". Northern Ireland Weather This Evening and Tonight: Scattered showers this evening will soon die out leaving plenty sunshine to end the day. After dusk, dry with clearer skies, this will allow it to turn quite cool in rural inland areas. Cloud thickening towards dawn. Minimum temperature 9 ° C.", "articleID": "2018073015_00190752_W", "names": {"Richard Ramsey": ["Q21176501", "Q59471801"]}}, {"date": "2018-07-31", "url": "http://motherboard.vice.com/en_us/article/a3q744/where-did-shadow-banning-come-from-trump-republicans-shadowbanned", "content": "Illustration: Chris Kindred shadow ban | by <mark>Samantha Cole</mark> | Jul 31 2018, 1:00 pm Where Did the Concept of \"Shadow Banning' Come From? It's been called shadow banning, toading, being\" sent to coventry, \"and ghost banning--but where did it actually start? by <mark>Samantha Cole</mark> | Jul 31 2018, 1:00 pm SHARE TWEET Illustration: Chris Kindred On Thursday, <mark>Donald Trump</mark> tweeted:\" Twitter \"SHADOW BANNING' prominent Republicans. Not good. We will look into this discriminatory and illegal practice at once! Many complaints .\" The tweet, seemingly in response to a VICE News article posted last week, uses the phrase \"shadow banning,\" a term that has been co-opted by conspiracy theorists who say that Silicon Valley is discriminating against them. Since the early days of the web, a \"shadow ban\" has been a moderation technique used to ban people from forums or message boards without alerting them that they've been banned. Typically, this means that a user can continue posting as normal, but their posts will be hidden from the rest of the community. In this case, Twitter made changes to how it ranks its search results for accounts from what it considers to be \"bad-faith actors who intend to manipulate or divide the conversation,\" the company said. Twitter also had a bug that caused some accounts to not be auto-suggested in search results even when people were searching for their names. That means users couldn't see Pizzagate conspiracy theorist Mike Cernovich's account in their search results, but Twitter says that hundreds of thousands of accounts were impacted by this issue, and that it didn't impact users based on their political affiliation. The bug didn't prevent affected users' tweets from being seen or interacted with, but some conservatives still called it a Twitter \"shadow ban .\" Twitter says the bug was just that--a bug, which has since been fixed. But \"shadow banning\" continues to be a digital bogeyman, used to shoo away the nuances of social media platforms' increasingly complicated (and often opaque) content moderation strategies. The term has been used by Ted Cruz and Project Veritas's James O’Keefe to suggest an anti-conservative bias in Silicon Valley, and the term itself has recently become part of conspiracy theorists' vocabularies, much like \"crisis actor\" and \"the deep state .\" And while the term refers to a real and commonly implemented moderation technique used on countless internet forums over the years, using the term now often says something about a person's political beliefs. Shadow banning sounds nefarious, but the term has a much less controversial origin that I spent the last few days tracking down. Toading and Twit Bits Before there were \"shadow bans,\" there was \"toading .\" Early internet anthropologist and Motherboard contributor Claire Evans told me that a practice similar to shadow banning--not exactly a ban, but more of a muting--was happening on multi-user domains (MUDs), text-based Dungeons and Dragons - like chat rooms that were popular as early as the 70s. MUD users had \"toading,\" which was \"the act of metaphorically turning someone into a\" toad' as a punitive measure, \"Evans told me in an email. Toading someone removed\" the flag by which the system recognizes the player-object as a player, \"according to Yib's Guide to MOOing. This effectively made the player invisible to the system and other players .\" Another version of toading was kind of the opposite, moving the player to a public space in the game in order to humiliate them, \"Evans, the author of Broad Band said .\" Sunlight is the best antiseptic, etc. \"Read more: The Secret History of a Fleeting Pre-Internet Digital Media Channel Other shadow ban-like moderation tools evolved in the 1980s and 1990s. According to The Telecommunications Illustrated Dictionary, many bulletin board systems (BBS) server access control lists in the 80s (like mod privileges, but for everyone on your server) included flags for each user that admins could toggle individually, granting users access to things like chat, email, or downloads in the BBS. One of these flags was an early version of a shadow ban: The\" twit bit' is a flag that basically labels a user as a \"loser,\" in BBS parlance. In other words, the twit is someone who has been flagged for limited access because s/he exhibits immature behavior and can't be trusted with access to any of the powerful features. In this very thorough Metafilter thread users agree that the earliest concept of shadowbanning came from Citadel-derived BBS servers. User ricochet biscuit wrote: \"It was easy then to create a forum on a topic that would enrage a known troll and just set it so the only users who could see it were the troll and myself. I would post a single item and then watch him try to rabble-rouse and wonder aloud why no one was taking the bait .\" Someone claiming to be a former systems administrator of a Citadel BBS board said on the forum Simple Machine that they remember a feature called \"coventry,\" named after the idiom for ostracizing someone. Admins could set a coventry \"bit\" on a user and their messages, so that if they did happen to add something worthwhile to the conversation, individual messages could be taken out of coventry, so to speak. \"Most of the time, such users would get increasingly worse for a short period of time, then never come back again,\" user labradors wrote. \"In some cases, though, they realised that nobody would respond to their rants--only their helpful messages, and they would quiet down to become good, productive members of the board .\" Kill Files, * plonk * and MUDs At the same time BBS users were sending people out to coventry, people on Usenet newsgroups were managing their feeds with personalized filters. Philip Greenspun, an early internet entrepreneur and pioneer of online communities, alluded to a similar feature in 80s Usenet servers. Back then, \"it was possible to establish a\" bozo filter' to screen out messages from posters with a track record of being uninteresting, \"he wrote on his blog. Read more: Ten Years of' 2 Girls 1 Cup,' the Most Memorable Brazilian Shit on the Internet I asked Seth Morabito--a Unix programmer who worked at one of the biggest Silicon Valley startups in the 90s and has spent a lot of time in then-obscure online communities--whether he recalled seeing anything like a shadow ban on the forums he frequented. He told me in an email that the closest he could think of happened on Usenet newsgroups, where a decentralized conversation could take place. What he described sounds kind of like the\" bozo filter. \"If you were in a flame war, or if you were just acting like an asshole, you could be added to other another user's\" kill file. \"The kill file let users create a list of usernames and keywords they no longer wanted to see (similar to\" muting \"on Twitter .)\" People being people, folks very rarely put anyone into their kill file without letting the target KNOW that they were being put into a kill file, \"Morabito said. It became tradition to reply to the victim with a single word: * plonk, * surrounded by asterisks .\" It was more or less public shaming, letting both the target and the rest of the newsgroup know that your buttons had been pushed so hard that you were just going to outright ignore the troublemaker forever more, \"he said. The\" Shadow Ban \"Like so much other modern internet lingo, the\" shadow ban \"seems to have come from the humor website and forums Something Awful. Rich Kyanka, the creator of Something Awful, says that the site that spawned\" weird Twitter \"coined ubiquitous internet terminology including\" banhammer, \"\"spoiler alert,\" \"let's play,\" and \"AMA .\" (Ask Me Anything). He also says that Something Awful mods invented the term \"shadow ban\" in 2001. \"We would use it as a joke and only do it to people who were intentionally trying to troll others,\" Kyanka, who is regular-banned from Twitter these days, told me in an email. \"None of the moderators used it very often, and we got rid of it within a year, replacing it with simply banning the person .\" The banned user could easily tell if they were shadowbanned by logging out of their account and looking for their own posts. Kyanka is banned from Twitter for making jokes that the platform deemed against its community guidelines. Some of those jokes include telling far-right personality Baked Alaska that he \"should go to a room and the room should fill full of concrete,\" which Twitter deemed a death threat, and telling Nancy Pelosi to \"eat the children,\" which the platform considered hate speech. The term shadow banning has persisted in internet forums and subreddits until today. Message boards still have functionalities like this, including vbulletin's \"global ignore\" which adds a user to every other user's ignore list. There's a subreddit dedicated to figuring out whether you've been shadow banned, where a bot will give you the verdict. But even though platforms like Twitter claim they don't shadow ban users, there are still people who blame their voices not being heard on this real feature of other internet communities. The Birth of a Conspiracy Theory The idea that Silicon Valley giants use shadow banning to silence conservatives was popularized by far right publications over the last two years. In 2016, Breitbart published a story claiming that Twitter shadow banning is \"real and happening every day,\" citing a source inside the company. In January, Project Veritas published a selectively edited video of a former Twitter software engineer who explained the concept of shadow banning and how Twitter was using it. Sen. Ted Cruz repeated the claim from Project Veritas during a Senate hearing with Twitter's director of public policy Carlos Monje, who denied that Twitter was shadow banning users. In a blog post published Thursday, Twitter said unequivocally: \"We do not shadow ban .\" In the early days of the web, online communities were small, fractured, and came up with different ways to police themselves, which is why we have all these different, interesting terms like toading and kill files. Today, platforms like Twitter have to moderate millions of people--billions, in Facebook's case. Because of this scale, content moderation is significantly different. Moderators are rarely members of the communities they're moderating and are instead people who are paid to action content that is reported by users for violating a platform's rules or content that is surfaced by algorithms. Read more: How r/the _ <mark>donald</mark> Became a Melting Pot of Frustration and Hate The types of actions that can be taken against content are also far more sophisticated. Because very few social media sites use reverse-chronological timelines anymore, every piece of content is \"moderated\" automatically by a platform's algorithm in some way, making it more - or less-likely to show up in users' feeds. Though Facebook and Twitter can and do delete content and ban users for violating their rules, they also have more nuanced ways of moderating content that they believe to be problematic. In the case of Holocaust denial for example, Facebook will sometimes \"significantly reduce the distribution of content\" rather than outright ban it. Part of the current confusion about shadow banning is happening because conspiracy theorists are trying to prove an anti-conservative bias from some of the world's most powerful companies, and \"shadow banning\" sounds scary. But not all of this confusion is in bad faith: Social media companies have traditionally been terrible at explaining how they do moderate, and its timeline algorithms and rule-making processes are all black boxes that have not been sufficiently explained to the public. In fact, last month, the special rapporteur to the United Nations's Human Rights Council issued a 20-page report noting that social media companies \"must embark on radically different approaches to transparency at all stages of their operations, from rule-making to implementation and development of\" case law \"framing the interpretation of private rules .\" It would be a lot cleaner and easier to explain away why people aren't engaging with your social media posts on a platform purposefully deciding it wants to censor you, but the fact is that algorithms are making a lot of the decisions about what people see and don't see. Content moderation simply isn't as straightforward these days. \"I'd say one of the key advantages the old-school Internet has over today's platforms is that it you were much more likely to just get booted from a community if you didn't follow the rules,\" Evans said. SHARE TWEET Tagged: Twitter <mark>Trump</mark> moderation shadowbanning", "articleID": "2018073113_00138083_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]