[{"date": "2018-07-31", "url": "http://motherboard.vice.com/en_us/article/a3q744/where-did-shadow-banning-come-from-trump-republicans-shadowbanned", "content": "Illustration: Chris Kindred shadow ban | by <mark>Samantha Cole</mark> | Jul 31 2018, 1:00 pm Where Did the Concept of \"Shadow Banning' Come From? It's been called shadow banning, toading, being\" sent to coventry, \"and ghost banning--but where did it actually start? by <mark>Samantha Cole</mark> | Jul 31 2018, 1:00 pm SHARE TWEET Illustration: Chris Kindred On Thursday, <mark>Donald Trump</mark> tweeted:\" Twitter \"SHADOW BANNING' prominent Republicans. Not good. We will look into this discriminatory and illegal practice at once! Many complaints .\" The tweet, seemingly in response to a VICE News article posted last week, uses the phrase \"shadow banning,\" a term that has been co-opted by conspiracy theorists who say that Silicon Valley is discriminating against them. Since the early days of the web, a \"shadow ban\" has been a moderation technique used to ban people from forums or message boards without alerting them that they've been banned. Typically, this means that a user can continue posting as normal, but their posts will be hidden from the rest of the community. In this case, Twitter made changes to how it ranks its search results for accounts from what it considers to be \"bad-faith actors who intend to manipulate or divide the conversation,\" the company said. Twitter also had a bug that caused some accounts to not be auto-suggested in search results even when people were searching for their names. That means users couldn't see Pizzagate conspiracy theorist Mike Cernovich's account in their search results, but Twitter says that hundreds of thousands of accounts were impacted by this issue, and that it didn't impact users based on their political affiliation. The bug didn't prevent affected users' tweets from being seen or interacted with, but some conservatives still called it a Twitter \"shadow ban .\" Twitter says the bug was just that--a bug, which has since been fixed. But \"shadow banning\" continues to be a digital bogeyman, used to shoo away the nuances of social media platforms' increasingly complicated (and often opaque) content moderation strategies. The term has been used by Ted Cruz and Project Veritas's James O’Keefe to suggest an anti-conservative bias in Silicon Valley, and the term itself has recently become part of conspiracy theorists' vocabularies, much like \"crisis actor\" and \"the deep state .\" And while the term refers to a real and commonly implemented moderation technique used on countless internet forums over the years, using the term now often says something about a person's political beliefs. Shadow banning sounds nefarious, but the term has a much less controversial origin that I spent the last few days tracking down. Toading and Twit Bits Before there were \"shadow bans,\" there was \"toading .\" Early internet anthropologist and Motherboard contributor Claire Evans told me that a practice similar to shadow banning--not exactly a ban, but more of a muting--was happening on multi-user domains (MUDs), text-based Dungeons and Dragons - like chat rooms that were popular as early as the 70s. MUD users had \"toading,\" which was \"the act of metaphorically turning someone into a\" toad' as a punitive measure, \"Evans told me in an email. Toading someone removed\" the flag by which the system recognizes the player-object as a player, \"according to Yib's Guide to MOOing. This effectively made the player invisible to the system and other players .\" Another version of toading was kind of the opposite, moving the player to a public space in the game in order to humiliate them, \"Evans, the author of Broad Band said .\" Sunlight is the best antiseptic, etc. \"Read more: The Secret History of a Fleeting Pre-Internet Digital Media Channel Other shadow ban-like moderation tools evolved in the 1980s and 1990s. According to The Telecommunications Illustrated Dictionary, many bulletin board systems (BBS) server access control lists in the 80s (like mod privileges, but for everyone on your server) included flags for each user that admins could toggle individually, granting users access to things like chat, email, or downloads in the BBS. One of these flags was an early version of a shadow ban: The\" twit bit' is a flag that basically labels a user as a \"loser,\" in BBS parlance. In other words, the twit is someone who has been flagged for limited access because s/he exhibits immature behavior and can't be trusted with access to any of the powerful features. In this very thorough Metafilter thread users agree that the earliest concept of shadowbanning came from Citadel-derived BBS servers. User ricochet biscuit wrote: \"It was easy then to create a forum on a topic that would enrage a known troll and just set it so the only users who could see it were the troll and myself. I would post a single item and then watch him try to rabble-rouse and wonder aloud why no one was taking the bait .\" Someone claiming to be a former systems administrator of a Citadel BBS board said on the forum Simple Machine that they remember a feature called \"coventry,\" named after the idiom for ostracizing someone. Admins could set a coventry \"bit\" on a user and their messages, so that if they did happen to add something worthwhile to the conversation, individual messages could be taken out of coventry, so to speak. \"Most of the time, such users would get increasingly worse for a short period of time, then never come back again,\" user labradors wrote. \"In some cases, though, they realised that nobody would respond to their rants--only their helpful messages, and they would quiet down to become good, productive members of the board .\" Kill Files, * plonk * and MUDs At the same time BBS users were sending people out to coventry, people on Usenet newsgroups were managing their feeds with personalized filters. Philip Greenspun, an early internet entrepreneur and pioneer of online communities, alluded to a similar feature in 80s Usenet servers. Back then, \"it was possible to establish a\" bozo filter' to screen out messages from posters with a track record of being uninteresting, \"he wrote on his blog. Read more: Ten Years of' 2 Girls 1 Cup,' the Most Memorable Brazilian Shit on the Internet I asked Seth Morabito--a Unix programmer who worked at one of the biggest Silicon Valley startups in the 90s and has spent a lot of time in then-obscure online communities--whether he recalled seeing anything like a shadow ban on the forums he frequented. He told me in an email that the closest he could think of happened on Usenet newsgroups, where a decentralized conversation could take place. What he described sounds kind of like the\" bozo filter. \"If you were in a flame war, or if you were just acting like an asshole, you could be added to other another user's\" kill file. \"The kill file let users create a list of usernames and keywords they no longer wanted to see (similar to\" muting \"on Twitter .)\" People being people, folks very rarely put anyone into their kill file without letting the target KNOW that they were being put into a kill file, \"Morabito said. It became tradition to reply to the victim with a single word: * plonk, * surrounded by asterisks .\" It was more or less public shaming, letting both the target and the rest of the newsgroup know that your buttons had been pushed so hard that you were just going to outright ignore the troublemaker forever more, \"he said. The\" Shadow Ban \"Like so much other modern internet lingo, the\" shadow ban \"seems to have come from the humor website and forums Something Awful. Rich Kyanka, the creator of Something Awful, says that the site that spawned\" weird Twitter \"coined ubiquitous internet terminology including\" banhammer, \"\"spoiler alert,\" \"let's play,\" and \"AMA .\" (Ask Me Anything). He also says that Something Awful mods invented the term \"shadow ban\" in 2001. \"We would use it as a joke and only do it to people who were intentionally trying to troll others,\" Kyanka, who is regular-banned from Twitter these days, told me in an email. \"None of the moderators used it very often, and we got rid of it within a year, replacing it with simply banning the person .\" The banned user could easily tell if they were shadowbanned by logging out of their account and looking for their own posts. Kyanka is banned from Twitter for making jokes that the platform deemed against its community guidelines. Some of those jokes include telling far-right personality Baked Alaska that he \"should go to a room and the room should fill full of concrete,\" which Twitter deemed a death threat, and telling Nancy Pelosi to \"eat the children,\" which the platform considered hate speech. The term shadow banning has persisted in internet forums and subreddits until today. Message boards still have functionalities like this, including vbulletin's \"global ignore\" which adds a user to every other user's ignore list. There's a subreddit dedicated to figuring out whether you've been shadow banned, where a bot will give you the verdict. But even though platforms like Twitter claim they don't shadow ban users, there are still people who blame their voices not being heard on this real feature of other internet communities. The Birth of a Conspiracy Theory The idea that Silicon Valley giants use shadow banning to silence conservatives was popularized by far right publications over the last two years. In 2016, Breitbart published a story claiming that Twitter shadow banning is \"real and happening every day,\" citing a source inside the company. In January, Project Veritas published a selectively edited video of a former Twitter software engineer who explained the concept of shadow banning and how Twitter was using it. Sen. Ted Cruz repeated the claim from Project Veritas during a Senate hearing with Twitter's director of public policy Carlos Monje, who denied that Twitter was shadow banning users. In a blog post published Thursday, Twitter said unequivocally: \"We do not shadow ban .\" In the early days of the web, online communities were small, fractured, and came up with different ways to police themselves, which is why we have all these different, interesting terms like toading and kill files. Today, platforms like Twitter have to moderate millions of people--billions, in Facebook's case. Because of this scale, content moderation is significantly different. Moderators are rarely members of the communities they're moderating and are instead people who are paid to action content that is reported by users for violating a platform's rules or content that is surfaced by algorithms. Read more: How r/the _ <mark>donald</mark> Became a Melting Pot of Frustration and Hate The types of actions that can be taken against content are also far more sophisticated. Because very few social media sites use reverse-chronological timelines anymore, every piece of content is \"moderated\" automatically by a platform's algorithm in some way, making it more - or less-likely to show up in users' feeds. Though Facebook and Twitter can and do delete content and ban users for violating their rules, they also have more nuanced ways of moderating content that they believe to be problematic. In the case of Holocaust denial for example, Facebook will sometimes \"significantly reduce the distribution of content\" rather than outright ban it. Part of the current confusion about shadow banning is happening because conspiracy theorists are trying to prove an anti-conservative bias from some of the world's most powerful companies, and \"shadow banning\" sounds scary. But not all of this confusion is in bad faith: Social media companies have traditionally been terrible at explaining how they do moderate, and its timeline algorithms and rule-making processes are all black boxes that have not been sufficiently explained to the public. In fact, last month, the special rapporteur to the United Nations's Human Rights Council issued a 20-page report noting that social media companies \"must embark on radically different approaches to transparency at all stages of their operations, from rule-making to implementation and development of\" case law \"framing the interpretation of private rules .\" It would be a lot cleaner and easier to explain away why people aren't engaging with your social media posts on a platform purposefully deciding it wants to censor you, but the fact is that algorithms are making a lot of the decisions about what people see and don't see. Content moderation simply isn't as straightforward these days. \"I'd say one of the key advantages the old-school Internet has over today's platforms is that it you were much more likely to just get booted from a community if you didn't follow the rules,\" Evans said. SHARE TWEET Tagged: Twitter <mark>Trump</mark> moderation shadowbanning", "articleID": "2018073113_00138083_W", "names": {"Samantha Cole": ["Q7408640", "Q7608923"]}}, {"date": "2018-08-01", "url": "http://www.texomashomepage.com/news/politics/house-speaker-paul-ryan-uncovers-jewish-roots-on-pbs-show/1337568137", "content": "House Speaker <mark>Paul Ryan</mark> uncovers Jewish roots on PBS show By: Posted: Jul 31, 2018 08:57 PM CDT Updated: Jul 31, 2018 08:57 PM CDT House Speaker <mark>Paul Ryan</mark> uncovers Jewish roots on PBS show Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. <mark>BEVERLY HILLS</mark>, Calif. (AP) - House Speaker <mark>Paul Ryan</mark> was surprised and proud to find out he has Jewish roots. The Wisconsin Republican discovered his family history while filming a segment for the upcoming season of the PBS series \"Finding Your Roots With Henry Louis Gates Jr.\" Gates said Tuesday at a TV critics meeting that he traced <mark>Ryan</mark>'s heritage back to his 10th great-grandfather born in 1531 in Germany. The research showed <mark>Ryan</mark> is 3 percent Ashkenazi Jewish. \"You could have knocked him over with a feather and then he was very proud of it,\" Gates said of <mark>Ryan</mark>'s reaction. \"We don't know who that Jewish person was, but we know it was on his mother's German line, which makes sense. So somebody who was a Christian German slept with a Jewish German person and that's where that came from .\" Also featured on the show's fifth season debuting in January is Sen. Marco Rubio, R-Florida, and Rep. Tulsi Gabbard, D-Hawaii. Gates said he chose <mark>Ryan</mark> because he was fascinated by him and not his politics. He picked Rubio because he wanted to include a Cuban and Gabbard because of her Pacific ancestry. \"Her genome looks like the rainbow coalition because it's Asian and European and African and it's beautiful,\" he said. Rubio's history was traced to his fifth great-grandparents born in Italy and on his father's side his seventh great-grandparents born in the Canary Islands, off the northwest coast of Africa. \"There was a lot going on politically and in terms of immigration for him,\" Gates said. Gates' wife, Sharon Adams, is a Cuban historian and she had her graduate students research Rubio's history in addition to hiring people in Cuba to find his family tree in parish churches. \"It was like a challenge, an intellectual challenge for me,\" Gates said. Gates said his purpose in doing the show is to deconstruct race and show how racism manifests itself in the current anti-immigrant feeling in the United States. \"We're all immigrants. We're all mixed up,\" he said. \"When the lights came down, everybody was sleeping with everyone else .\" Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. More Stories HONOLULU (AP) - U.S. Vice President Mike Pence is flying to Hawaii on...4 hours ago NEW YORK (AP) - The war of words intensified between two titans in...6 hours ago TAMPA, Fla. (AP) - President Donald Trump on Tuesday wrongly claimed...17 hours ago Don't Miss Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2018080110_00081855_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2018-08-01", "url": "https://www.newburytoday.co.uk/news/home/25032/mammoth-wasps-nest-uncovered-in-newbury.html", "content": "Mammoth wasps' nest uncovered in Newbury <mark>Shane Jones</mark> made the extraordinary find, which contained around 10,000 wasps Fiona Tomas Contact: 01635 886639 A PEST controller who filmed the moment he uncovered a gigantic wasp nest at a house in Newbury has gone viral. <mark>Shane Jones</mark> from RIDTEK Pest Control discovered the monster nest--which was two to three feet in size--in a garage cupboard last week. The 49-year-old pest expert was alerted to the nest after the resident opened the cupboard, which had remained shut for some time. The owner reportedly \"screamed and ran\" before picking up the phone to call RIDTEK--an independent family owned pest control business which Mr <mark>Jones</mark> has been running for five years. Mr <mark>Jones</mark>, who relocated to Basingstoke from his native Australia, said he decided to film the huge nest as he didn't want to miss out on such an extraordinary find. He said: \"Last year we found a pretty big one in a loft in Tadley, but we didn't take a video of it .\" You don't come across these often. \"We deal with so many wasps nests every day, but we never really know what we're going to find - it was a good one .\" Mr <mark>Jones</mark> said this summer's hot weather has led to more queen wasps surviving in hibernation for longer, which has resulted in larger nests. \"All pest controllers are having a fantastic wasp season--it's a really big thing for us .\" This year, we are having an exceptional summer--which means there are a lot of other insects for wasps to eat. \"The whole point is that the queen wasp stays a lot longer in hibernation .\" Mr <mark>Jones</mark>, who used to work as a tour guide for crocodile and snake cruises in North Queensland, followed the normal procedure in discarding the wasp nests--by simply incinerating it. \"A wasp nest is rather fragile--it looks like they're made from paper,\" he said. \"If you touch them, they kind of crumble and collapse .\" Mr <mark>Jones</mark> said that had the nest not been found, it would have grown to a certain point before it dies. The nest was successfully removed from the cupboard and the insects released safely. Photo and video supplied by <mark>Shane Jones</mark>", "articleID": "2018080113_00080676_W", "names": {"Shane Jones": ["Q3959109", "Q7488117"]}}, {"date": "2018-08-02", "url": "https://www.breitbart.com/national-security/2018/08/01/north-korea-our-society-is-the-best-in-the-world/", "content": "North Korea's state newspaper Rodong Sinmun published a column Wednesday urging North Koreans not to be enticed by other cultures or ways of life, insisting instead that the brutally repressive communism of the <mark>Kim</mark> family regime is the \"best in the world .\" The article is the latest in a string of propaganda pieces urging North Koreans to hang onto their austere communist ways and reject the \"cultural poisoning\" of the free world in anticipation of dictator <mark>Kim Jong-un</mark> announcing a refocus of his regime towards economic development. That shift has stalled as President Donald Trump has refused to lift sanctions on the country, citing its refusal to denuclearize. \"The DPRK [North Korea] is a socialist country which has been cherished in its people's mind as the benevolent bosom where they lead an independent and creative life and happiness of all generations is ensured for 70 years,\" Rodong Sinmun asserted in its column Wednesday. \"The Korean people have enjoyed the most dignified life in the bosom of the DPRK for 70 years .\" \"Our society is the best in the world as everyone enjoys happiness in very stable living condition, helping and leading each other though their life is not so luxurious and rich,\" the piece continues, touting \"the principle of collectivism\" as the key to the alleged success of the regime. \"Ordinary workers, peasants and intellectuals have become deputies to the Supreme People's Assembly to discuss state affairs and conduct free socio-political activities. This is a true picture that can be found only in the Korean-style socialist society .\" In reality, North Korea is one of the world's most impoverished countries and arguably the most repressive regime in the world. In contrast to the picture of equality that Rodong Sinmun alleges, the <mark>Kim</mark> regime divides society into castes in a system known as songbun. Those who exhibit the greatest loyalty to the <mark>Kim</mark> family, who are worshipped as gods, receive higher songbun, while anyone suspected of not being sufficiently loyal to the regime, harboring any religious faith at all, or sharing family ties with someone suspect loses songbun. Those of lower songbun may be banned from Pyongyang or forced to live in labor camps for generations. The claim that North Korean society is prosperous also belies warnings in state propaganda published as recently as last week that the nation might soon face even more poverty than it is used to. Rodong Sinmun suggested in an article last week that North Koreans should be prepared to sacrifice in the recent future, urging, \"even if (we) have to travel a long distance through snowstorms with our belts tightened, we will go straight to the people's road which was proved as immortal in the process of the 70-years-long struggle and to the road of socialism .\" Yet Rodong Sinmun continues to publish stories insisting that the <mark>Kim</mark> regime is not amenable to compromise in negotiations with the United States or South Korea. In another story published Wednesday, the state newspaper argued that \"a new mode of thinking\" is necessary in the government of Seoul to understand and accept that North Korea will not change. It decries negotiations with South Korea as \"not substantial\" and suggests that South Koreans want \"a comprehensive and great change in inter-Korea relations, not a partial change, and permanent reconciliation and peace, not a temporary escape from the phase of confrontation and danger of war .\" The article also demanded an end to unprecedented global sanctions weighing on the <mark>Kim</mark> regime. \"The anti-north sanctions are an unreasonable step taken by the U.S. and other hostile forces for the mere reason that the DPRK conducted self-defensive nuclear tests and ballistic rocket fires to defend peace and security from the aggression and war threat by outsiders,\" it argued. American officials have repeatedly stated that they will offer no sanctions relief to North Korea until the country completely, irreversibly ends its illegal nuclear weapons program. Instead, reports released this month suggest that North Korea has continued to attempt to manufacture long-range missiles. Secretary of State Mike Pompeo told Congress last week that the Trump administration has reason to believe North Korea is still producing fissile material, following the release of satellite images showing some activity at the nation's Yongbyon nuclear energy facility. This week, a report in the Washington Post suggested that images showed renewed activity at a facility in Sanumdong believed to have been the factory that created the Hwasong-15, a liquid-fueled intercontinental ballistic missile (ICBM) considered the most powerful in North Korea's arsenal. Follow Frances Martel on Facebook and Twitter.", "articleID": "2018080201_00172586_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}}, {"date": "2018-08-02", "url": "http://www.kiro7.com/news/local/sprinklers-keep-arson-fire-in-check-at-suquamish-elementary-school/804440310", "content": "Sprinklers keep arson fire in check at Suquamish elementary school Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Sprinklers keep arson fire in check at Suquamish elementary school By: KIRO 7 News Staff Updated: Aug 2, 2018 - 12:04 PM Loading...Sprinklers keep arson fire in check at Suquamish elementary school SUQUAMISH, Wash. - North Kitsap Fire & Rescue crews responded to a fire at Squamish Elementary School at 11:51 p.m. Wednesday night that officials say was the result of someone setting a couch on fire just outside the school. Squamish Elementary School is part of the North Kitsap School district and is located at 8950 Park Blvd NE, Suquamish, WA 98392. Related Headlines Crews rescue dog, owner from embankment Arriving firefighter crews found heavy smoke at the scene, water flowing from the sprinkler system, but no flames. \"About 100 square feet of the building's exterior finish was blackened. School officials believe that the couch, which was destroyed in the incident, was dumped by unknown person (s) in or near the building's dumpster,\" North Kitsap Fire & Rescue said in a news release. A fire investigation of the Kitsap County Fire Marshal's Office responded to the scene and determined the fire was intentionally set. Officials say no firefighters or civilians were injured in the fire. Anyone with information about the incident is asked to call Deputy Fire Marshal <mark>Ken Rice</mark> at (360) 337-5777. More news from KIRO 7", "articleID": "2018080219_00056215_W", "names": {"Ken Rice": ["Q37620027", "Q6388359", "Q6388360"]}}, {"date": "2018-08-06", "url": "http://sports.espn.go.com/cfl/story/_/id/24296094/terrell-owens-works-cfl-saskatchewan-roughriders", "content": "print A day after hosting an unconventional Pro Football Hall of Fame induction ceremony at the University of Tennessee at Chattanooga, former NFL wide receiver Terrell Owens worked out for the Canadian Football League's Saskatchewan Roughriders in nearby South Pittsburg, Tennessee. The workout, overseen by Roughriders head coach and general manager <mark>Chris Jones</mark>, was held Sunday at South Pittsburg High School and featured a handful of attendees, among them former UCF quarterback Justin Holman and former South Carolina defensive back Rico McWilliams. \"I know I'm truly blessed and I can still play the game,\" Owens, 44, told the Chattanooga Times Free Press after the hour-plus workout. \"What I did out there today is just a small little snippet of what I can do. I just appreciate Coach for the opportunity. I guess he wanted to assess and see where I am physically .\" It's key when you're trying out to put your best foot forward, and I'm very pleased with what they saw and what I did out there. To be inducted into the Hall of Fame and come back and play, why not me? I know I can do it; it's just a matter of someone giving me the opportunity. \"<mark>Jones</mark>, a graduate of the University of Tennessee at Chattanooga, said he wanted to evaluate Owens' route running and test his stamina .\" I have tryouts whenever it's possible so that former college and pro athletes have the chance to prove themselves and see if they can improve our team, \"<mark>Jones</mark> told the Chattanooga Times Free Press .\" But I've never been faced with anything like this. I mean, he's 44 years old but still runs a 4.4-second 40. \"An agent reached out to me to say that T.O. was interested in a tryout. I gave him the dates we would be available, and it just happened to work out that the timing was perfect for him since he was in Chattanooga for his ceremony. I told him it would be better to come here for the tryout because there wouldn't be the media frenzy that would be created if he crossed the border to work out in Canada .\" A third-round draft pick of San Francisco in 1996, Owens played eight seasons with the 49ers, two with the Philadelphia Eagles, three with the Dallas Cowboys and one each with the Buffalo Bills and Cincinnati Bengals. The six-time Pro Bowler compiled 15,934 receiving yards and 153 receiving touchdowns on 1,078 career receptions. He was released by the Seattle Seahawks early in the 2012 preseason and has not played professionally since. On Saturday, Owens delivered an emotional, 40-minute speech at his alma mater, during which he reiterated why he skipped this weekend's Hall of Fame ceremonies and criticized what he called a \"flawed\" voting process. Owens was elected to the Hall of Fame in his third time on the ballot. Information from ESPN's Vaughn McClure was used in this report.", "articleID": "2018080606_00021207_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"]}}, {"date": "2018-08-05", "url": "http://www.standard.net.au/story/5569554/lakes-appear-to-be-on-road-to-recovery-after-fires/?cs=72", "content": "Work to extinguish the Cobrico peat fire in April. Picture: Rob Gunstone Water quality in two south-west lakes affected in the St Patrick's Day fires appear to be improving, new testing shows. Testing at Lake Elingamite and Lake Cobrico by the Department of Environment, Land, Water and Planning (DELWP) shows that while nutrient levels remain high, early results indicate that levels are trending downward and do not currently pose a risk to the community or the environment. DELWP Barwon South West fire recovery co-ordinator <mark>Ross Martin</mark> said water quality testing was ongoing. \"The samples have been analysed and results compared to the EPA's results from samples taken during the fires, which provided a comparison to evaluate how the lakes are responding post-fires,\" he said. \"Results indicate that nutrient levels are relatively high for the two lakes, however, this is not unusual for a waterway that's recently been impacted by fire or any inland lake of this kind .\" Mr <mark>Martin</mark> said limited water quality data prior to the fires made it impossible to determine whether the high nutrient levels in the lakes was caused by the fires. \"High nutrient levels are common in these types of inland lakes and can vary seasonally and with changes in rainfall,\" he said. \"DELWP will continue to test water quality at both lakes to monitor changes against early sampling results and ensure any risks or impacts are identified and addressed as quickly as possible .\" facebook SHARE twitter TWEET email whatsapp comment Comments", "articleID": "2018080606_00146848_W", "names": {"Ross Martin": ["Q25189950", "Q7369492"]}}, {"date": "2018-08-07", "url": "http://www.thewesternstar.com/news/regional/italian-premier-visits-victims-of-fiery-crash-near-bologna-231858/", "content": "Italian premier visits victims of fiery crash near Bologna The Canadian Press Published: 1 hour ago Updated: 6 minutes ago MILAN--Italy's premier visited victims of the fiery crash of a tanker truck carrying highly flammable gas near Bologna, saying Tuesday that it was important to understand what happened to prevent future tragedies. The truck's driver was the only person killed. \"I am here today to demonstrate the closeness of the government to the people who are suffering, but also to understand why so that these things are not repeated,\" said <mark>Giuseppe Conte</mark>, who plans to travel later to the scene of another deadly crash in southern Italy. Prosecutors have opened an investigation into the Bologna accident, triggered when the tanker truck carrying liquefied petroleum gas, or LPG, rammed into a truck stuck in a line of traffic. The tanker immediately caught fire, and then exploded a short time later across eight lanes, collapsing part of the raised highway. Police video shows that by the time of the explosion, most vehicles had been evacuated from the highway. Highway police said only the tanker driver died in the crash, revising earlier reports by the carabinieri that there were two dead. Dozens of people were injured, many with burns or cuts from flying glass when windows of buildings nearby were shattered in the blast. The victim was identified as 41-year-old Andrea Anziolin of the northern city of Vicenza. \"Maybe it was a moment of distraction, or a wave of sleepiness,\" Bologna prosecutor <mark>Giuseppe Amato</mark> told RAI radio. \"But it is too early to say with certainty .\" <mark>Conte</mark> will later travel to the southern region of Puglia, where a van packed with immigrant farmworkers overturned after colliding with a truck carrying tomatoes in the southern Puglia region, killing 12. It was the second such fatal accident in the area in the space of three days. ___ Simone Somekh contributed to this report from Rome. Colleen Barry, The Associated Press More regional stories", "articleID": "2018080712_00061688_W", "names": {"Giuseppe Amato": ["Q3769954", "Q56682291", "Q58868222"], "Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"]}}]