[{"date": "2018-08-07", "url": "http://pastemagazine.com/articles/2018/08/supreme-court-nominee-brett-kavanaugh-thinks-the-p.html", "content": "Supreme Court Nominee Brett Kavanaugh Thinks the President Can Ignore Laws He Doesn't Like By Allison Bolt | August 7, 2018 | 4:50 pm Share Tweet Submit Pin In 2013, President Trump's Supreme Court nominee Brett Kavanaugh stated that it's a \"traditional exercise\" for a president to ignore new laws passed by Congress if the White House believes they are unconstitutional. For Democrats, knowing Kavanaugh's position on giving Trump total power makes the future look even more bleak. Kavanaugh said that if the president signs a bill into law \"and says these certain provisions in here are unconstitutional, and we're not going to follow those provisions, that is a traditional exercise of power by Presidents .\" This statement was in reference to President George W. Bush's controversial \"signing statements .\" A signing statement takes place when a bill has been passed by Congress and arrives on the president's desk and he signs it into law, but adds notes addressing sections of the bill he deems to be unconstitutional. Basically, a president can bypass laws passed by Congress without vetoing them, which would allow congress to override the president's decision. <mark>Bush</mark>'s use of signing statements were often condemned by critics for abusing power and ultimately ignoring laws passed by Congress. <mark>Bush</mark> objected to over 500 provisions in more than 100 pieces of legislation passed by Congress. <mark>Bush</mark>'s signing statements were often on legislation that discussed the war on terror, affirmative action programs and even bills that created basic qualifications for executive appointees. One of his most controversial signing statements took place while Kavanaugh was serving as the White House staff secretary. This particular signing statement was on a torture ban bill which outlawed the torture of detainees. In the statement, <mark>Bush</mark> declared he could override and bypass this new legislation. In an Aug. 13, 2013, opinion Kavanaugh wrote, \"If the President has a constitutional objection to a statutory mandate or prohibition, the President may decline to follow the law unless and until a final Court order dictates otherwise .\" He wrote a similar opinion in 2011. Sen. Chuck Schumer (D-NY) said, \"Understanding the nature of his involvement in those actions is absolutely critical to evaluating the type of justice he would be on the bench. If Republicans continue to stonewall, the American people will wonder what they are hiding .\" Many allies of Kavanaugh have pointed to the fact that President Obama once said, \"For nearly two centuries, Presidents have issued statements addressing constitutional or other legal questions upon signing bills into law .\" However, a law professor at the University of Texas and CNN analyist Stephen Vladeck said: President <mark>Bush</mark> wasn't the first to use signing statements, but he used them more often than both his predecessors and successors, and, as importantly, he consistently used them to advance an aggressive theory of constitutional limits on Congress' power to interfere with the Executive Branch that was largely a novelty. Some Republicans, such as Senate Judiciary Charimain Chuck Grassley (R-IA), say Democrats are just attempting to delay Kavanaugh's confirmation. Yet GOP Sen. Tom Thom Tillis (R-NC) said, \"I want to learn about what he has done in the 307 opinions and his writings about his jurisprudence and whether or not he's qualified to be in the role of the Supreme Court .\" On Aug. 2, Democrats demanded full access to all of Kavanaugh's documents during his time in the <mark>Bush</mark> administration from 2003-2006. Also on Thursday, the Senate Judiciary Committee stood in front of a large wall of 167 boxes labeled \"Kavanaugh records\" in an attempt to illustrate Democrats are only attempting to stall the Supreme Court appointment. Tillis said, \"If you were to stack up all these pages, it would be taller than the <mark>Big Ben</mark>, taller than the Statue of Liberty, taller than the Capitol Dome, and taller than the <mark>Taj Mahal</mark>. Here's the reality: The same people that are asking for the documents oppose Judge Kavanaugh .\" Apparently some poor staffers spent their evening assembling boxes labeled the \"Kavanaugh Files\" ...Senate Republicans holding a press conference momentarily to object to Democratic demands for documents tied to the Supreme Court nominee @ SpectrumNewsDC @ SpecNewsRDU pic.twitter.com/c4kcetvdCu", "articleID": "2018080721_00016401_W", "names": {"Big Ben": ["Q2902145", "Q295364", "Q537679", "Q599161", "Q657876"], "President Bush": ["Q207", "Q23505"], "Taj Mahal": ["Q353023", "Q59627566"]}}, {"date": "2018-08-13", "url": "https://www.independent.ie/entertainment/painting-bought-for-185000-fails-to-convince-expert-it-is-genuine-37209988.html", "content": "Independent. ie Painting bought for € 185,000 fails to convince expert it is genuine The still life had been attributed to <mark>William Nicholson</mark>. <mark>Fiona Bruce</mark> with the painting (Rolf Marriott/BBC) Laura Harding Painting bought for € 185,000 fails to convince expert it is genuine Independent. ie A painting bought for € 185,000 (£ 165,000) and attributed to <mark>William Nicholson</mark> has failed to convince the artist's leading expert of its authenticity and been rejected as close to worthless. https: //www.independent.ie/entertainment/painting-bought-for-185000-fails-to-convince-expert-it-is-genuine-37209988.html Email A painting bought for € 185,000 (£ 165,000) and attributed to <mark>William Nicholson</mark> has failed to convince the artist's leading expert of its authenticity and been rejected as close to worthless. The still life of a glass jug and pears was rejected by the leading authority on <mark>Nicholson</mark>, Patricia Reed, and left out of the artist's latest catalogue raisonne--the official list of all his known works. The piece was examined on BBC One's Fake Or Fortune? but a thorough forensic case was not enough to persuade Reed that the painting is genuine. The programme obtained new evidence that scientifically linked the painting to <mark>Nicholson</mark>'s very own paint box which is kept in his grandson's house, and a handwriting expert also confirmed that writing on the back of the painting was very likely to have been written by <mark>Nicholson</mark> himself. <mark>Fiona Bruce</mark>, Philip Mould with Glass Jug with Plates and Pears. attributed to <mark>William Nicholson</mark> (Rolf Marriott) Presenter <mark>Fiona Bruce</mark> met reformed art forger John Myatt to ask him if he had ever faked a <mark>Nicholson</mark>, with Myatt revealing that he had, but not this painting. The programme found that while there are physical aspects to the painting that link it to <mark>Nicholson</mark>, there is not enough direct evidence to prove that he executed the work himself. It has been suggested that because there was a group of amateur painters who were tutored individually by <mark>Nicholson</mark> in his studio and elsewhere during the 1930s, known as the \"Sunday painters\" , the painting could have been executed by one of them, under his supervision. One of <mark>Nicholson</mark>'s most famous tutees in this group was Winston Churchill. <mark>Bruce</mark> said: \"I'm genuinely shocked by that verdict. I didn't expect it. I thought the case was so strong .\" Fake Or Fortune? is on BBC One on Sundays at 9pm. Press Association", "articleID": "2018081307_00147721_W", "names": {"Fiona Bruce": ["Q266078", "Q2893114"], "William Nicholson": ["Q41779114", "Q55758217", "Q706935"]}}, {"date": "2018-08-13", "url": "https://www.thesportreview.com/2018/08/toronto-masters-2018-rafael-nadal-masters-tstisipas-to-win-80th-title-but-is-out-of-cincinnati/", "content": "Toronto Masters 2018: Rafael Nadal masters Tstisipas to win 80th title, but is out of Cincinnati Rafael Nadal beats Stefanos Tsitsipas in the final to win the Toronto Masters title By Marianne Bevis Monday 13 August 2018, 12:08 UK @ mariannebevis Rafael Nadal Photo: Marianne Bevis The week in Toronto began with what looked like a truly challenging draw for the world No1 Rafael Nadal, but seven days later, he lifted his fourth Rogers Cup trophy to become only the fourth man in the Open era to win 80 career titles. Nadal won the title in Toronto in 2008 and in Montreal in both 2005 and 2013. On the last occasion, he went on to join a very select group of players in adding the Cincinnati title and then the US Open title, a remarkable North American treble. But while he is the defending champion in New York this year, but he will not be attempting the treble this time around. Now age 32, he has pulled out of Cincinnati. He said: \"I am sorry to announce that I won't be playing in Cincinnati this year. No other reason than personally taking care of my body and trying to keep as healthy as I feel now .\" It is a sensible decision: The Toronto title was his 40th match-win of the year, with all but four of those wins coming since April. After being forced to retire in the Australian Open quarter-finals with a hip injury, he was absent until the Davis Cup quarter-finals, where he won both his singles matches. They were immediately followed by title runs at the Monte-Carlo Masters, Barcelona, the Rome Masters and the French Open, plus a quarter-final finish in Madrid along the way. He went on to conclude his Wimbledon campaign in the semis on the back of two intense five setters, first a four hour 48 minute win over Juan Martin del Potro, then a five and a quarter hour loss to Novak Djokovic. In Toronto, he negotiated his potentially tricky draw with relative ease, with the exception of his three-set comeback over Marin Cilic in the quarters. It included wins over the often dangerous Benoit Paire, a three-time Major champion on the injury comeback trail, Stan Wawrinka, and the big, powerful 22-year-old Karen Khachanov. Finally, Nadal had to top the talk of the tournament, the charismatic Stefanos Tsitsipas. The Greek, who less than a year ago had yet to win a main-tour match, and was ranked 192, began what has been a stunning rise up the ranks from No91 this January. By the time he reached his first final in Barcelona, had broken the top 50. By then, he had claimed five top-20 scalps, and added David Goffin to that count with his semi-final run in Washington. Toronto, though, would bring out a whole new level of flair, attack, and sheer determination from the teenager who would turn 20 on the day of his first Masters final. He beat four top-10 players, the youngest ever to do so in a single tournament, including Dominic Thiem, Djokovic, <mark>Alexander Zverev</mark> and <mark>Kevin Anderson</mark>. What is more, he did it the hard way. The last three of those matches required three sets, the last two from a set down, and each involved tie-breaks. How much did he have left for the biggest final of his career? He began well enough, but Nadal had the look of a man on a mission, and his serving in particular was outstanding. He broke in the third game and again in the fifth, and while Tsitsipas would hold once, Nadal served out the set, 6-2, having dropped just one point on his serve. The Greek could not find an opening to hit back, but was not helped by below-par serving and a slew of forced forehand errors. And by the time Nadal led 4-2 in the second set, the Spaniard had yet to drop a first-serve point, and only two overall. It looked a foregone conclusion, then, that Nadal would serve out the victory at 5-4, but Tsitsipas, as he has so often this week, went for broke, swung freely, and helped by some unexpectedly tense serving--two double faults--from Nadal, broke to level. He then held comfortably, and threatened the Nadal serve, but could not convert his break chance for the set. And so it went to another tie-break, with many in the Toronto arena fully expecting the magician from Greece to take this to a third set again. But Nadal did not waver, and the hour-long second set ended 7-6 (4) in his favour. This is now Nadal's most successful hard-court event, and this his first Masters on the hard stuff since that famous treble run in North America in 2013. He said of his victory: \"If you told me this two weeks ago I would not have believed it...It's a very important victory for me and I'm very happy .\" Canada is a place that I feel comfortable. I play well. That's it. And I played with the Canadian colours during the whole event. \"But aside from Nadal's memorable achievement at the tournament, the Rogers Cup of 2018 will be remembered for bringing the personality and tennis of one of the new generation's brightest prospects centre stage. Tsitsipas, and his will to win, have charmed the crowds in Canada, but he will not be stopping here. He was ranked 27 at the start of the tournament, and has jumped to 15 this week. If he can hold that position until the US Open, it would be a helpful boost--he would not face a higher seed before the fourth round. However, Cincinnati will be a big physical test after his Washington and Toronto efforts, and he gets no first-round bye, either. He will be back on court come Tuesday against No11 seed Goffin in a draw at least as tough as the one in Toronto. But his will is strong, as his assorted messages on cameras and Twitter testify .\" Fight like there is no tomorrow. \"\"It never gets easier. You just get better .\" Talking to ATPWorldTour.com about his Nadal encounter, that fighting spirit was as intense as ever. He had learned, he said: \"How much I have to work. How much gap there is between him and me, and how much more I need to...Work more hours and become stronger and a more solid baseliner and withstand pressures, physical pressures on the court that to him it just seems like nothing special. That's the big difference between my game and his. He never cracks. He will always grab you like a bulldog .\" He concluded: \"I'm really hungry for more. I believe I can achieve much more this year .\" Few will disagree with that. But the day, the week, and very possibly the year, belong to world No1 Nadal, who now has almost 4,000 points between himself and No2 Roger Federer, after the two men had exchanged the No1 ranking six times in the opening months of the year. He has, it is fair to say, earned is rest during Cincinnati.", "articleID": "2018081311_00163822_W", "names": {"Alexander Zverev": ["Q13990552", "Q24689242", "Q4189526"], "Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"]}}, {"date": "2018-08-14", "url": "http://wegotthiscovered.com/movies/new-venom-fan-art-gives-sinister-symbiote-classic-look/", "content": "x Unfortunately, whether or not Spider-Man will indeed be swinging by Ruben Fleischer's Venom is as up in the air as ever. That said, even if the eponymous web-head does unexpectedly drop in, it likely won't be the \"friendly neighborhood\" version we're all used to. After all, Holland's twenty-something web-slinger just doesn't fit the bill. Nevertheless, that hasn't stopped the fandom from envisioning what <mark>Tom Hardy</mark>'s Eddie Brock locked in battle with the current portrayer of <mark>Peter Parker</mark> could look like. At the beginning of the month, a delectable piece of fan art--or so it would appear to Venom--depicting the cantankerous Klyntar administering a chokehold onto the Iron Spider exploded online. Far-fetched, if nothing else, the image spurred on a new fan theory in which a Redditor theorized that Andrew Garfield could feasibly reprise his role as <mark>Peter Parker</mark>, seeing as the thirty-four-year-old actor would fit in much \"better with the new Venom film .\" Regardless, apparently feasibility isn't something the Holland fanbase is concerned with, as you'll see below. Instagram user Spdrmnkyxxiii posted an updated version of his piece of fan art in which the iconic white encrusted spider symbol is applied to the back of <mark>Hardy</mark>'s symbiote, and Holland's Spider-Man has taken the proverbial place of the \"turd in the wind .\" New Venom Fan Art Gives The Sinister Symbiote A Classic Look 1 of 2 Click to skip MORE FROM THE WEB Click to zoom The latest intel on the situation, at least according to director Ruben Fleischer, is that the titular web-head will not be apart of Venom. Although, seeing as <mark>Tom Hardy</mark> did give Holland quite a tongue lashing at SDCC last month, I suppose anything's possible. Hell, even Fleischer himself has teased that it might just become a reality one day. Until then, though, we'll just have to make due with creative fan art. Which, by the way, is totally fine with us. Source: Heroic Hollywood", "articleID": "2018081415_00193686_W", "names": {"Peter Parker": ["Q19596717", "Q21165177", "Q51587673", "Q56513979", "Q7176298"], "Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}}, {"date": "2018-08-17", "url": "http://www.newsobserver.com/news/local/counties/wake-county/article216897850.html#storylink=latest_side", "content": "August 17, 2018 03:40 PM Raleigh Shrouded in black, taller than some children and tucked into a corner on City Plaza downtown, the covered object is out of place. But what's underneath is a musical treat for the brave who dare look under the cover. In an attempt to make downtown Raleigh a little bit more fun, the city placed a piano along Fayetteville Street on Friday afternoon. The hope is that it will stay there for at least a few months and that passersby will play a tune or stop to listen. \"It's a toy,\" said Jen Baker, the city's downtown coordinator. \"I hate to refer to a great musical instrument like that as a toy, but it's really just for fun. SIGN UP\" It's just another opportunity to interact, \"Baker said .\" It's not social media. It's real life. And it's one more way to enjoy downtown Raleigh. \"Before city staff could load the piano stool off the truck, Kristeena Yates started to play. She'd just finished her shift at nearby Jimmy John's and one of her coworkers watched behind her. Yates also plays the guitar, and she insists she only dabbles with the piano .\" There is a piano up here, \"<mark>Earl Jones</mark> said as he walked along the street. <mark>Jones</mark> plays guitar, bass and keyboard and sometimes performs downtown for free. He'd like to make some money, he said, but he wasn't willing to pay the city for a busking permit .\" I think it's cool, \"he said of the piano .\" It'd be great if people want to play the piano and bring a guitar and bass out here. \"Raleigh bought two pianos from the Habitat for Humanity ReStore for $175. While one is on Fayetteville Street, the other will be painted by the Glenwood South Neighborhood Collaborative and placed in that part of downtown. Anyone who wants to donate more musical instruments for downtown can use the social media hashtag #TeamDowntownRaleigh or email teamdowntownraleigh @ raleighnc.gov.", "articleID": "2018081719_00177767_W", "names": {"Earl Jones": ["Q1628498", "Q2899402", "Q5325944", "Q55610368", "Q969854"]}}]