[{"date": "2018-08-17", "url": "http://www.fox28.com/news/regional/two-more-arraigned-in-what-msp-is-calling-a-child-porn-ring", "content": "Two more arraigned in what MSP is calling a child porn ring by Nicky Zizaza | Newschannel 3 Two more arraigned in what MSP is calling a child porn ring. (WWMT/Jason Heeres) A A BATTLE CREEK, Mich.--Michigan State Police arrested two more people in what detectives have called a child porn ring. Matthew Toole and Talia Furman appeared in Calhoun County District Court on Friday to face charges in a child pornography in a case the Michigan State Police have been following closely. Calhoun County Judge said, \"Count five did persuade, entice, endure, coerce or cause or knowingly allow a 3-year-old child to engage in a child sexually abusive activity\" Toole and Furman were arraigned on multiple charges including, but not limited to criminal sexual conduct and using computers to commit a crime. Calhoun County Judge said, \"Count three, did perform or intentionally commit an act likely to cause physical or mental harm to a child by performing bleep on the child\" Calhoun County Prosecutor <mark>David Gilbert</mark> said one of the victims was harmed at the hands of a parent. <mark>Gilbert</mark> said, \"A mother and someone else doing something to her own children .\" A tip led MSP detectives to 19-year-old Jayme Lapoint where they uncovered chat messages and videos depicting sexually abusive material. Calhoun County Judge said, \"Count one did engage in sexual penetration, with a child under the age of 13 .\" Prosecutors alleging that both Furman and Toole attempted to lure a 12-year-old out of a county fair and transport the child up north. <mark>Gilbert</mark> said, \"The allegations are this is a child pornography ring it's also basically a human trafficking ring .\" Lapoint has already been charged and is headed to trial at a future date. A pre-exam hearing for Furman and Toole is scheduled August 30. Unmute", "articleID": "2018081801_00073185_W", "names": {"David Gilbert": ["Q1174544", "Q16228862", "Q17385807", "Q42322165", "Q5234127"]}}, {"date": "2018-08-20", "url": "http://journalgazette.net/opinion/columns/20180820/one-nominee-two-views", "content": "Monday, August 20, 2018 1:00 am One nominee, two views Trump pick faithful constitutional adherent <mark>David McIntosh</mark> <mark>David McIntosh</mark>, founding director of the Federalist Society, was a three-term member of the U.S. House for Indiana's 2nd District. He is a native of Kendallville. Outside the White House, no one knew the name of President Donald Trump's Supreme Court nominee until minutes before Judge Brett Kavanaugh stepped into the East Room. And yet on the most important question of all--the judicial philosophy of the nominee, whomever the president had chosen--the event was mercifully free of suspense. From the outset, we all knew that to be considered by Trump, any prospective justice would have to be a judicial conservative, understanding that courts exist to interpret our Constitution and laws without venturing to set national policy. In his 2016 campaign, the president again and again promised to appoint justices in the mold of Antonin Scalia. And now, for the second time, he has delivered exactly that. Over 12 years as a federal appeals court judge, Kava-naugh's opinions reflect a clear understanding of the judicial role under the Constitution. This is a judge who has firmly defended the separation of powers as designed by the framers; consistently adhered to the Constitution and laws as written; and left political issues to the executive and legislative branches, where they belong. He has authored more than 300 opinions for the U.S. Court of Appeals for the D.C. Circuit. Not one of them displays an impulse to overreach, grandstand or achieve any objective beyond a fair decision in the case at hand. At the appeals level, one measure of a judge's influence is how often his or her reasoning is later adopted by the Supreme Court. This has happened at least 11 times with opinions by Kavanaugh. In fact, some of those opinions were dissents that the high court found more persuasive than the majority view of Kavanaugh's circuit court colleagues. And whatever side the judge was on, his position rested on the clearest of principles. As he said on the night of his nomination, \"A judge must be independent and must interpret the law, not make the law ....A judge must interpret the Constitution as written, informed by history and tradition and precedent .\" As one of the founding directors of the Federalist Society, I of course agree with him because that philosophy is faithful to the vision of the framers. This does not mean I can predict how a Justice Kavanaugh would rule in any given case. Indeed, two of the court's most conservative members, Clarence Thomas and Samuel Alito, do not always come down on the same side, even when applying fundamental constitutional principles. It does mean that Kavanaugh would not use his judicial powers to reach a desired result or to create rights not found in the law or traditions of our country. Should Kavanaugh be confirmed by the Senate, his modest, Constitution-based approach to judging would be the prevailing one on the Supreme Court, a turn of events no one on the political left was expecting just two years ago. For decades, liberal activists have depended on federal courts to further agendas that have little or nothing to do with constitutional law, and that would go nowhere if pursued by democratic means. These endless judicial power plays have brought deep divisions to the country. Now, so very suddenly, the winds have changed and the era of judicial supremacy is coming to a close. This explains the spreading panic in progressive circles over an obviously well qualified nominee. Lacking serious objections, all that Senate Democrats will have against Kavanaugh are menacing caricatures and hysterical warnings--tactics likely to work as well as they did against Justice Neil Gorsuch. As the nomination advances, it will be little noted that Trump's model justice, Scalia, was confirmed by a unanimous vote, as was the departing Justice <mark>Anthony Kennedy</mark>. That's a reminder of a time when obvious merit made for a straight path to confirmation. We're now in a different day, when Senate Democrats are reduced to vowing, as Minority Leader Charles Schumer has put it, to resisting the nominee \"with everything I've got .\" The need for such bluster, however, only draws attention to what Kavanaugh's got--which is, by every measure, the ability, temperament and character we should all expect in a Supreme Court justice.", "articleID": "2018082005_00125314_W", "names": {"Anthony Kennedy": ["Q11171", "Q59192346"], "David Mcintosh": ["Q27981538", "Q3703259", "Q5237379", "Q55989505"]}}, {"date": "2018-08-23", "url": "http://www.azcentral.com/story/news/local/arizona-education/2018/08/23/arizona-junior-college-football-end-after-2018-season/963334002/", "content": "Is Arizona junior college football dead after this season? Anne Ryman Arizona Republic Published 12:00 p.m. UTC Aug 23, 2018 Head football coach Ryan Felker puts his arm around defensive back Gerald Wilbon (30) during practice at Mesa Community College on Aug. 16, 2018. Patrick Breen/The Republic Gerald Wilbon won a football scholarship from Southern Utah University for 2018. But what appeared to be the fulfillment of a long-standing dream to play Division 1 college football turned to disappointment when the 18-year-old cornerback's grades weren't good enough to enroll. He gets a second shot at his dream this fall with a football scholarship to Mesa Community College, where he hopes to improve in the classroom, work on his game and eventually earn a scholarship to a four-year school. \"Without this, I don't know what I'd be doing right now,\" the Red Mountain High School graduate said at a recent team practice. But for Wilbon and about 400 other athletes, this opportunity to play football while furthering their education likely ends with the 2018 season. The Maricopa County Community College District, the state's largest community-college system, is pulling the plug on the sport for financial reasons. District officials say the colleges need to prioritize their spending as enrollment has leveled off and the Arizona Legislature has eliminated state funding. A district task force also raised concerns about injuries and football's low academic performance compared with other sports. The announcement earlier this year sent shock waves across the district, where four colleges--Glendale, Phoenix, Scottsdale and Mesa--have fielded football teams for decades. Football supporters in other Arizona communities fear that decision will have a domino effect. Pima Community College officials said Maricopa's decision \"accelerated\" an already-planned financial review of athletics. They announced in June that the Tucson school would also end football after 2018 as part of a three-year plan to cut college-wide spending by $15 million. The departure of Pima and Maricopa will leave two junior college football teams in Arizona and three in the Western States Football League: Eastern Arizona College in Thatcher, Arizona Western College in Yuma and Snow College in central Utah. Without Pima and the Maricopa schools, Eastern and Western will have to travel farther to compete. In June, Eastern announced plans for a \"careful review\" of football to see if a schedule is viable and if the sport can operate within budget beyond 2018. The move to eliminate JUCO football in Arizona comes as the sport, in general, is under increased scrutiny as more studies show links between football and brain problems. Already, participation is down among high-school students nationally and in Arizona--partly because of concerns over injuries, athletic officials said. \"It's an educational institution' Risk and cost aside, Maricopa football is not going down without a fight. A grassroots group is pushing to save the sport, including a Twitter campaign with the hashtag #savejcfootball. They are also pushing to shift the balance of power on the college district's governing board, hoping to elect four candidates sympathetic to football in the Nov. 6 election. Attorneys filed a complaint in early August with the U.S. Department of Education's Office for Civil Rights on behalf of 22 Maricopa players, alleging cutting football violates federal law because it adversely affects African-American students, who make up 62 percent of the rosters. The department is evaluating the complaint but hasn't said yet whether it will investigate. RELATED: Maricopa Community Colleges to eliminate football Football supporters say college officials used false or misleading statements to justify killing the program. They aren't buying the argument that the sport was eliminated for financial reasons, not when cutting football is estimated to save $989,000 a year and the college district projects $682 million in general-fund revenue this year, or about $11 million more than last year .\" They're trying to turn this into a business. It's not a business. It's an educational institution, \"said Louis Casillas, a retired dentist who played football at Mesa Community College and is advocating to save the program. Maria Harper-Marinick, chancellor of Maricopa Community Colleges. Maricopa Community Colleges In response to questions from The Arizona Republic, the district released a one-paragraph statement saying the decision to eliminate football was an operational decision made by district administrators after consulting with college presidents .\" We will support our players, coaches and staff through this final season, and we will honor the scholarships of our players through the Spring 2019 semester, \"the statement said. A district spokesman said Maricopa Chancellor Maria Harper-Marinick was busy with the start of the fall semester and unavailable for an interview. Governing Board President Laurin Hendrix told The Republic he supports the administration's decision and has not heard any opposition from board members .\" Our mission as a community college is to educate people. It's not to train football players, \"he said .\" If they play football while they are getting an education, that's great. But our mission is to educate. \"Last Chance U? Temperatures hovered in the triple digits at Mesa Community College on a recent Monday night as players practiced drills on a grassy field. Hip-hop music blasted from speakers. Shrill whistles pierced the air along with shouts of\" Go get 'em \"and\" Move! \"JUCO teams bring together a mix of backgrounds: players not big enough, fast enough, strong enough or mature enough for Division 1. Some who have struggled in the classroom. And others who have attended big schools but\" bounced back \"to JUCO because their grades or athletic abilities need work. JUCO football doesn't draw the revenue, attention or prestige of Division 1 college football. But it's a key pipeline for athletes who want to play football at major universities. About 65 to 70 percent of the Maricopa players are from Arizona, the rest from out of state. RELATED: Pima College in Tucson to drop football program Thanks to the popularity of the Netflix documentary\" Last Chance U, \"it's fair to say more people than ever before understand what the acronym\" JUCO \"means .\" It just opens so many doors for people, \"said Joe Kersting, a former head football coach at Glendale Community College, who is leading the fight to save the sport. Former Glendale player Kevin Cary, 48, credits JUCO football with opening doors for him. He grew up in a single-parent household in Maryvale, one of 10 children. By the time he was born, his mother had lost the family's home. She and the four children still living with her moved into a mobile home. A natural athlete, Cary played football at Trevor Browne High School, where he was recruited by many out-of-state junior colleges. But the partial scholarships they offered weren't enough to cover costs. Cary and his mother decided he would live at home and attend Glendale Community College on a football scholarship. The team won the national championship in 1988, his sophomore year. In January of his sophomore year, Temple University recruited him on a full scholarship .\" My mom used to say to me, \"Use football to get your education. Your football will end. You have to have something to live on .'\" Cary followed her advice. He majored in health marketing and management and today works with 1,400 doctors as a physician coordinator for a major health-care system in Pennsylvania. He considers himself a success, thanks largely to JUCO football giving him a start. Players line up during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic How football landed on the chopping block The move to eliminate football has its roots in a strategic plan to transform the 10-college Maricopa system into a national leader in higher education. To do that, district officials are focusing on student academic success. They want more students to complete degrees or certificates, and they want more to transfer to four-year schools after junior college. To fund what is known as \"the transformation,\" district officials and governing board members are also looking for efficiencies. Jeffrey Darbut, vice president of administrative services at Mesa Community College. Mesa Community College A March 2017 position paper written by Jeffrey Darbut, vice president of administrative services at Mesa Community College, offered several recommendations. Among them: to eliminate all athletic programs. Darbut estimated the district could save $12.5 million a year by getting rid of athletics. Another $25 million to $75 million could be raised by selling the athletic land and buildings. The report said athletics is \"viewed by many faculty members as not contributing to the college mission\" and that \"there are no student outcomes to support the enormous cost of the athletic programs .\" The document has become known by critics as the \"Darbut manifesto\" because the governing board has already implemented some recommendations. Football is the only sport that is being eliminated after 2018. Also, in May 2017, a college-district task force that had been reviewing athletics determined football players had the lowest grade-point averages, the second-lowest retention rates and the second-highest student-loan default rates of all sports. Football had the highest operating costs, the report said, and highest insurance claims. Eliminating football would save $770,000 a year and another $219,000 in insurance premiums, a report said. \"The high risk of catastrophic physical injury, low levels of student success and high cost to maintain football teams outweigh the intrinsic value of participation in the sport,\" the report concluded. \"The recommendation is made to eliminate these teams .\" In October 2017, the chancellor announced football would remain in place and be re-evaluated in 2018-19. Football supporters breathed a sign of relief. But the relief was short-lived when in early February, college employees received an email just before college-football signing day. The district had made a difficult decision, the email said: Football will be eliminated following the 2018 season. Players take a break during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic How accurate were statistics cited to kill the program? Football advocates say the district used incomplete or misleading statistics, in some cases, to justify getting rid of the sport. Take fall-to-fall student retention, which measures whether students who play football return to the Maricopa district the following fall. A school wants retention to be as high as possible, because students who come back are more likely to earn a degree or certificate. Half of football players don't return the next fall, the second-lowest rate of all college sports behind men's soccer. But football supporters say this statistic is misleading because it gives the impression that all of those players drop out. Retention rates fail to take into consideration a key goal of JUCO--for players to get scholarships from university teams. Consider 22-year-old Juan Giraldo. He wouldn't count toward the fall-to-fall retention rate because he spent a semester at Mesa Community College in fall 2014 but was recruited the next semester to Eastern Michigan University, where he played football for three years as a safety. He said his tuition was covered by athletic scholarships at Mesa and Eastern Michigan. He graduated this spring with a bachelor's degree in criminal justice. Without the scholarships, he wouldn't have attended a four-year school, he said. Also a matter of dispute: the projected cost to maintain and improve football facilities. The district said that ongoing costs to maintain football programs \"could exceed $20 million\" in capital improvements. But this figure is an estimate that came up in a meeting; there is no written report that details projected costs. Football supporters say athletic facilities such as stadiums will still need to be maintained and improved even if football ends because other sports teams use them. Football advocates also take issue with the task force's conclusions that eliminating the sport will save about $989,000 a year. That figure fails to take into account tuition paid by football players who aren't on scholarships. Head football coach Ryan Felker watches his team during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Nor does it account for the scholarships that players earn to four-year universities. Mesa Community College players have earned about $1.1 million a year in scholarships from other universities for each of the last three years, according to Ryan Felker, Mesa's football coach. The college district declined to answer specific questions that The Republic posed about data in the athletic report. Hendrix, the governing-board president, said he has not read the report but said the chancellor briefed him on it. He said a mixture of facts--financial, risk of injury, insurance concerns--supported eliminating football. \"Unfortunately, there's a group that feels football is necessary to go to college. I don't agree with that point,\" he said. Nov. 6 election could decide football's fate When Arizona State University announced it was dropping in 2008 three sports from its NCAA roster--men's tennis, wrestling and men's swimming--because of state budget cuts, the decision was made at the university level, not by the Arizona Board of Regents who set policy for the universities. Wrestling and men's swimming were saved via fundraising. Men's tennis was cut and returned in 2017-18 because of donations from the athletic director and the Adidas sportswear company. Similarly, the decision to eliminate football never came before the Maricopa Community Colleges Governing Board and such a decision doesn't require a board vote. Laurin Hendrix, president of the Maricopa Community Colleges governing board. Maricopa Community Colleges Hendrix, the board president, said he has not received any requests from board members to discuss football at a board meeting. \"I think the administration made a good decision, and I support the decision they made. I don't see it coming (to the board),\" he said. An email exchange between governing-board members on Oct. 20, 2017, shows at least one current board member opposed football. In the email to board President Hendrix, Chancellor Harper-Marinick asks for clarification on where fellow board member Jean McGrath stands on football: \"Is she in favor of keeping football or eliminating? It is not prudent to take that one on at this time, (in) my professional and political judgement,\" the chancellor wrote. Hendrix responded: \"Ms. McGrath's hot buttons at the moment are sabbaticals, travel, union memberships and most recently football. If we give her victories to give to her supporters, it will keep her on board for the bigger agenda, namely the transformation,\" Hendrix wrote, referring to the district's strategic plan. \"The ball that we need to keep our eye on is the transformation. This other stuff is window dressing but we need it so that the board members can share their list of victories with their supporters and remain supportive for the bigger picture .\" Hendrix told The Republic he wrote the \"candid\" email to the chancellor as a preview of issues that were going to come up. He said he wasn't passionately in favor of or opposed to football. Jean McGrath, member of the Maricopa Community Colleges governing board. Maricopa Community Colleges McGrath told The Republic the college district can't afford football. \"I'm not in favor of it going away, but...it was a financial decision .\" McGrath said she is especially concerned about liability if players are injured and sue. The NFL is being sued by former players who suffered concussions, and attorneys representing the players estimated that payouts from a settlement could top $1.4 billion, according to the Associated Press. \"I don't see how any educational institution can afford football,\" McGrath said. But football advocates are hoping to save the sport by throwing their support behind four candidates running in the Nov. 6 board election who they hope will be sympathetic to reviewing the decision. Four seats are open on the seven-member board with only two incumbents, McGrath and Augustine Bartning, running for re-election. Football supporters are backing challengers Tom Nerini, Stan Arterberry, Marie Sullivan and Roc Arnett. Arterberry is the sole candidate running against incumbent McGrath, whose District 4 includes the Sun City area. Arterberry told The Republic he hasn't committed to saving the sport. But if elected, he wants the board to review in a public meeting the data that went into the decision to eliminate football. \"Having said all that, I support athletics for students,\" said Arterberry, who attended college on a football scholarship. \"Because of football, I stayed in school, I passed my courses and most important graduated,\" he said. Did a football coach go too far? The rhetoric surrounding the football debatehas become heated at times. Hendrix, the board president, said he received in March a threat via Twitter from Scottsdale Community College football coach Doug Madoski. Madoski had responded to questions on Twitter about the decision to eliminate football. The March 2 tweet said, \"My mom taught me patience is a virtue and my dad taught me that when battling the king you only get one shot...make sure you kill him before he kills you. No need for other schools to panic I'm pretty calculated as are the others fighting this fight. Patience is a virtue .\" Hendrix said he interpreted the tweet as \"when they refer to killing the king, I'm the president of the board. I have to think that might be me .\" Madoski told The Republic the tweet was taken out of context, adding that he would never threaten anyone. \"The\" king' is not relating to an actual person or Mr. Hendrix, \"he said .\" It was simply...this is a large group of things, an ideological purpose, that we're confronted with now...Be patient. \"Players head in for water during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Is JUCO football on the decline? Most of the country's 1,500 community colleges don't offer football. The sport exists in pockets with a strong, decades-long football tradition. California has by far the most JUCO teams, with 68 belonging to the California Community College Athletic Association. Another 66 are part of the National Junior College Athletic Association (NJCAA), with six states fielding six or more football teams: Arizona, Texas, Minnesota, Kansas, New York and Mississippi. NJCCA Executive Director <mark>Christopher Parker</mark> said the number of schools sponsoring football has remained relatively steady over the last decade, plus or minus five schools. Among the junior colleges that have cut football since 2010: Rock Valley College, Joliet Junior College and Harper College, all in Illinois, and Grand Rapids Community College in Michigan. All of the schools cited financial reasons. Over the next decade, <mark>Parker</mark> predicts,\" I don't see a huge influx of schools adding and I don't see a huge number of schools dropping. \"He said he's been approached by some two-year colleges considering adding football as a way to boost enrollment. But he declined to name them until the schools make their decisions. Players line up for drills during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Concern over injuries Participation in high-school football is on the decline, nationally and in Arizona, in part because of concern over head injuries, officials said. The National Federation of State High School Associations reports participation is down 3 percent in the last five years, with about a million students playing the sport. Football participation in Arizona declined from about 22,000 five years ago, to about 19,900 in the 2017-18 school year, said David Hines, executive director of the Arizona Interscholastic Association. Hines said he's unaware of any large high schools that plan to drop the sport. He is seeing some smaller schools eliminate freshman teams because of a lack of interest .\" With the national attention on concussions, there are parents or kids that have said, \"You know what? I'm not going to play,'\" he said. The Maricopa colleges task force called football \"the most risky of the intercollegiate sports\" offered by the schools. The task force's report cited a 2007 study in the Journal of Athletic Training that analyzed 16 years of NCAA data and found football had the highest injury rate compared with other intercollegiate sports. At Maricopa colleges, football injuries in 2014 accounted for 51 percent of injury-related insurance claims. College officials have taken steps to make football safer, which has resulted in fewer sports-related claims, the report said. But that comes at a cost. Oakland Raiders running back Charlie Garner runs to the end zone on a 46-yard touchdown pass play against the Tennessee Titans in the second quarter on Sept. 7, 2003, in Nashville, Tennessee. AP/The Tennessean/George Walker IV One of Maricopa's former JUCO players, former NFL running back Charlie Garner, recently went public with his health struggles. The former Scottsdale Community College player revealed last year, at age 45, that doctors believe he is dealing with symptoms of Chronic Traumatic Encephalopathy (CTE), the degenerative brain disease found in athletes who have suffered repetitive brain trauma. Garner played pro football for 11 years for the Philadelphia Eagles, San Francisco 49ers, Oakland Raiders and Tampa Bay Buccaneers. \"I don't have all my faculties anymore,\" Garner told sportingnews.com. \"I can't remember things. When I go to the mall or grocery store, I have to take one of my kids with me to remember where the car is parked. I have trouble remembering conversations I had five minutes ago. Bright lights bother me. I just don't feel right all the time .\" Ernie Renfro's son, 18-year-old Trevor, played football at Centennial High School and is on Mesa Community College's team this fall on the offensive line, at center and guard positions. Renfro reflected on the increased scrutiny of football injuries as he watched the team practice on a recent night. \"I don't worry about it,\" he said. \"I think they've gotten better with the helmets and equipment and the safety rules. Can it happen? Yes. But it can happen with everything you do .\" Player Trevor Renfro poses for a picture during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Students try to focus, not lose hope Amid the ongoing debate over the future of Maricopa football, players are preparing for their first games of the season. Mesa faces Phoenix College and Scottsdale takes on Glendale on Saturday night. With football expected to go away next year, the push to land scholarships to Division 1 schools has never been greater. Those who get scholarships won't have to worry about the future. Mesa has sent 88 players to Division 1 schools on football scholarships during the last six years, and a total of 169 players on to four-year colleges overall. Player Ivory Williams talks with an Arizona Republic reporter during practice at Mesa Community College in Mesa, Ariz. on Aug. 16, 2018. Patrick Breen/The Republic Ivory Williams is a 19-year-old, red-shirt freshman safety from Tempe. Without a football scholarship, he said he has no way to pay for college. He has already turned down partial-scholarship offers from Division 2 schools because he can't afford it. He hopes to secure a scholarship to a four-year school. He and other players are also hopeful that Maricopa college-district officials may reconsider their decision and keep the sport. There are no guarantees on either. Unless something changes, Maricopa football scholarships end after the spring semester. And the stadium lights will go dark. Reach the reporter at 602-444-8072 or anne.ryman @ arizonarepublic.com. Published 12:00 p.m. UTC Aug 23, 2018", "articleID": "2018082315_00142621_W", "names": {"Christopher Parker": ["Q19325302", "Q5113026", "Q56000137"]}}, {"date": "2018-08-26", "url": "http://www.theadvocate.com.au/story/5607462/work-begins-on-godfreys-beach-penguin-platform/?src=rss", "content": "Work has begun on building a penguin platform at Godfreys Beach, Stanley. Braddon Liberal MHA <mark>Adam Brooks</mark> said the Tasmanian Government had provided $450,000 over two years and the Tourism Infrastructure in Parks project has funded $75,000 for project planning. \"The viewing platform will be a valuable tourist drawcard and also help to minimise disturbance to the penguins,\" he said. \"The works will be constructed in a manner to protect penguin nesting habitat, providing visitors with an incredible viewing experience on the beach via an elevated boardwalk .\" RELATED: Upgrades planned for North-West icon at Stanley The work also includes improved circulation and parking for vehicles, new toilets and signage. Don-based company AJR Construct is building the boardwalk. It also rebuilt the Lillico penguin viewing platform in 2017. The site will be closed during construction. Work is expected to be completed by mid-October. facebook SHARE twitter TWEET email whatsapp", "articleID": "2018082604_00109843_W", "names": {"Adam Brooks": ["Q28445574", "Q348885", "Q4678785"]}}, {"date": "2018-08-26", "url": "http://www.shropshirestar.com/sport/uk-sports/2018/08/26/valverde-hits-out-at-state-of-pitch-after-barcelonas-victory-at-real-valladolid/", "content": "Valverde hits out at state of pitch after Barcelona's victory at Real Valladolid Less than an hour ago Barca secured a narrow win. Subscribe to our daily newsletter Sign UpErnesto Valverde was left unhappy Coach Ernesto Valverde has criticised the pitch at Real Valladolid after Barcelona scraped to a 1-0 victory. The players were seen struggling as the newly laid turf began cutting up during the match at the Estadio Jose Zorrilla, with Valverde saying he had not seen anything like it \"for a long time\". The Barca coach blamed the state of the surface for making it difficult for his players to launch a counter attack and find a second goal. Quoted on the club's official website, he said: \"Valladolid played with good pressure and they pushed us, but the pitch had a lot to do with it .\" We were more dominant and had opportunities, but we couldn't score the second goal. \"There was a time when they changed the system and we could've made it 0-2 then, but in the last few minutes we did badly .\" These results give us opportunities to win the league, but we feared that there could be some injury, the state of the pitch has conditioned both teams. \"Ousmane Dembele scored the only goal just before the hour in the hard-fought win, but the hosts would not lie down and almost snatched a last-gasp point. Advertising Deep into stoppage time, Keko headed home what he thought was an equaliser but it was eventually ruled out for offside after intervention by the video assistant referee. Valladolid coach <mark>Sergio Gonzalez</mark> said after the match he thought his team had deserved to walk away with a draw .\" We were very involved the first 30 minutes, we knew how to suffer, be strong and endure situations of danger to grow and surpass us, making good football and looking for a point that finally did not come and maybe we deserved, \"he told the club's website. He defended the state of the pitch, saying they had done\" everything possible \"to have it in the best condition. Advertising\" My players are also soccer players, not farmers. Nobody is interested in playing on a lawn that does not meet good conditions, \"he said. The grass\" was the same for everyone \", he added, saying the only option was to\" adapt \"to what was there. LaLiga president Javier Tebas tweeted after the match to say the turf\" did not meet the minimum conditions required \", adding that the league planned on opening a disciplinary file.", "articleID": "2018082605_00100578_W", "names": {"Sergio Gonzalez": ["Q28514300", "Q52162147", "Q56501664", "Q7454279"]}}, {"date": "2018-08-28", "url": "https://www.rollingstone.com/politics/politics-news/trump-mccain-veterans-716470/", "content": "President Trump, surrounded by Vietnam veterans, speaks before signing a proclamation commemorating the 50th anniversary of the Vietnam War during a veterans event at the Grand Hyatt, in Danang, Vietnam. AP/REX Shutterstock For someone who talks a big game about respecting the military, President Trump spends a lot of time offending service members. His latest affront came after John McCain died Saturday. That night, the president reportedly nixed the released of a statement honoring McCain's legacy, instead opting to fire off a perfunctory tweet that failed to commend the senator. The next morning, Trump occupied himself by attacking the Justice Department, and on Monday he ordered the American flags at the White House to return to full-staff, despite the tradition that they remain lowered until the deceased can be interned. While appearing before reporters later in the day, Trump refused to answer questions about McCain. Some of America's most prominent veterans groups were not happy. \"On the behalf of the American Legion's two million wartime veterans, I strongly urge you to make an appropriate presidential proclamation noting Senator McCain's death and legacy of service to our nation, and that our nation's flag be half-staffed through his interment,\" Denise Rohan, the national commander of the American Legion, wrote in a statement, adding that McCain \"was an American hero and cherished member of The American Legion\" before listing his credentials as a Vietnam veteran and member of Congress. AMVETS posted several tweets expressing their disappointment \"in the lack of traditional and appropriate respect in the White House's reaction to the death of McCain, a\" retired Navy captain and former prisoner of the Vietnam war, who gave 60 years of honorable service to his country. \"3 ️ ⃣ / deaths of Senators <mark>Ted Kennedy</mark> and <mark>Robert Byrd</mark>. But John McCain was not just a sitting senator. He was a war hero, twice a presidential contender, and a national treasure who devoted his entire adult life to protecting and improving the American way of life. pic.twitter.com/Qtf3OQnpAG--AMVETS (@ AMVETSHQ) August 27, 2018 Veterans of Foreign Wars chimed in, as well .\" The U.S. Flag Code calls for lowering the flag to half-staff on the day of and the day after the death of a member of Congress, \"a VFW spokesman told HuffPost .\" That the White House did on Saturday and Sunday. We have asked the White House if the honor could be extended. No response back yet. \"The backlash from veterans' groups reportedly spurred the president to order White House flags be returned to half-staff later on Monday .\" Despite our differences on policy and politics, I respect Senator John McCain's service to our country, and, in his honor, have signed a proclamation to fly the flag of the United States at half-staff until the day of his interment, \"Trump said in a statement. While speaking at a dinner celebrating evangelical leadership Monday night, the president said,\" We very much appreciate everything that Senator McCain has done for our country. \"AMVETS thanked Trump for ordering the flag be re-lowered to half-staff. The American Legion and the VFW tweeted the news. Sen. Lindsey Graham (R-SC), an Air Force veteran and one of McCain's best friends, didn't seem too bothered about the president's response during an appearance on the Today show Tuesday morning .\" It is all over now, \"Graham said .\" The flag is down. When the president mentioned John he got applause. \"He added that Trump was\" not the only one to have a tense relationship with John McCain. \"Related Jamil Smith: Lessons From a Botched Voter Suppression Scheme Taibbi: Why Did John McCain Continue to Support War? For some former service members, the damage may have already been done. Hearing tonight from a surprising number of veterans and vets' relatives who all say Trump's handling of McCain's death, esp the flag fiasco, did irreparable damage to their opinion of him, which had been positive until now. WH & GOP, take note: It's more serious than you think .--Christina Wilkie (@ christinawilkie) August 28, 2018 But no one should be surprised by Trump's pettiness toward McCain, which is only the latest example of the conditionality of the president's respect for the military. If showing appropriate reverence for service members in any way conflicts with his own ego, he'll throw any veteran under the bus without giving it a second thought. He did so with McCain after the senator was critical of him in 2015, arguing that the Vietnam veteran--who not only was shot down and jailed, but refused to be released because other American soldiers had been imprisoned longer--was not a war hero. That comment alone should have disqualified Trump from ever pretending to respect those who have served. Veterans, including Lindsey Graham, were outraged. If there was ever any doubt that @ realDonaldTrump should not be our commander in chief, this stupid statement should end all doubt .--Lindsey Graham (@ LindseyGrahamSC) July 18, 2015 At the heart of @ realDonaldTrump statement is a lack of respect for those who have served--a disqualifying characteristic to be president--Lindsey Graham (@ LindseyGrahamSC) July 18, 2015 Trump never apologized for the statement, and after McCain's family announced on Friday that the senator had decided to discontinue medical treatment, the Washington Post reported that Trump still did not regret making it. A year after discounting McCain's service, Trump bashed Khzir Khan after the Gold Star father criticized Trump during a speech at the Democratic National Convention .\" Mr. Khan who has never met me, has no right to stand in front of millions of people and claim I have never read the Constitution, (which is false) and say many other inaccurate things, \"Trump said in a statement. A few days later, while discussing how he was gifted a Purple Heart by a retired lieutenant colonel who served in Iraq, Trump joked about the honor .\" And I said, \"Man, that's like big stuff. I always wanted to get the Purple Heart,\" Trump said. \"This was much easier .\" (Trump famously received five dubious draft deferments during the Vietnam War .) Once again, everyone was outraged. \"A direct attack on a Gold Star family, for their patriotism, for their integrity, is totally unprecedented,\" Paul Reickhoff, the founder and CEO of Iraq and Afghanistan Veterans of America, told Rachel Maddow. \"This is beyond partisanship. This is about honor. This is about integrity. It's completely out of bounds .\" Reickhoff added a belief that the issue would affect Trump at the polls. \"There are 22 million veterans in America,\" he said. \"Our members are extremely diverse. A lot of them are independents, but they vote at over 90 percent. They're very influential in their communities .\" A few months later, veterans would vote for Trump by a two-to-one margin. Since becoming president, Trump has continued to make empty, ostentatious shows of support for the armed services. He regularly accuses NFL players of disrespecting the military as they protest police brutality during the national anthem. He ordered the Pentagon to plan an over-the-top military parade in Washington D.C., one that he ultimately canceled as costs ballooned. He has been known to literally hug the flag. At the same time, the Trump administration is working to prevent transgender Americans from serving their country. On Memorial Day he used dead soldiers as a means to tout his own accomplishments. ProPublica reported earlier this month that three members of Trump's Mar-a-Lago club--a Marvel executive, a Palm Beach doctor and a lawyer--were essentially running the Department of Veteran Affairs despite having no relevant experience. A few days later, the administration announced its plan to stop checking for violations of the Military Lending Act, making it easier for financial predators to take advantage of service members and their families. The list goes on. This is the most inappropriate #MemorialDay comment that a @ POTUS has ever made. Self-promotion on a day to remember the fallen, and wishing those remembering their deceased loved ones a \"happy\" holiday is appalling. #CadetBoneSpurs pic.twitter.com/kRse4dnwiu--VoteVets (@ votevets) May 28, 2018 Veterans have long been used as political props, but never before has a politician failed to uphold so many baseline standards for decency toward those who have served. It hasn't seemed to matter, though. The Veterans of Foreign Wars, which vociferously condemned Trump's attacks on the Khan family, recently hosted the president in Missouri. The welcome was warm and, as expected, Trump mostly used the occasion to complain to the thousands of veterans assembled in front of him about how unfairly he has been treated by the media. He might as well have been talking to his supporters at one of his campaign-style rallies. Trump doesn't respect or care about veterans in any meaningful sense, and, as is the case with Trump's obstruction of justice and his campaign's collusion with Russia, the evidence is hiding in plain sight. His behavior is just so abhorrent that it's easier to find twisted ways to rationalize it rather than confronting the president's moral vapidity directly. \"Everyone keeps talking about this as breaking a taboo, crossing a line and doing something unprecedented,\" Maddow said while speaking with Reickhoff in 2016. \"Because of that we don't actually know what the response is. There's nothing like this in history to say this is the appropriate response or this is the equivalent political fate that befell somebody else who did this .\" The same is true two years later, and while the nation remains paralyzed in bewilderment, Trump continues to be president. His response to McCain's death won't be the last time he disrespects the military in service of a mind-numbingly petty grudge or the enrichment of the ruling class. Whenever that next time comes, America will once again be outraged. Now, however, it knows better than to think it will affect Trump at the polls.", "articleID": "2018082819_00041447_W", "names": {"Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"], "Ted Kennedy": ["Q134549", "Q326157"]}}, {"date": "2018-08-29", "url": "http://meforum.org/articles/2018/where-is-the-us-turkey-crisis-headed", "content": "Where Is the US-Turkey Crisis Headed? Jerusalem Post August 24, 2018 As <mark>Trump</mark> and Erdogan dig in, the chances that the two countries can return to a stable relationship is shrinking. Turkey and Turks \"Turkey buying the Russian S-400 missile defense system would threaten the security of our F-35 aircraft and let Putin collect critical intelligence on us. We must pass my provision in the defense bill this week to block the F-35 delivery until Turkey ends its deal with Russia,\" wrote US Sen. Chris Van Hollen on Wednesday. His comments came a day after US National Security Adviser <mark>John Bolton</mark>, visiting Jerusalem, said that Ankara made a \"big mistake\" by not releasing US Pastor Andrew Brunson. \"Every day that goes by, that mistake continues. This crisis could be over instantly if they did the right thing as a NATO ally, part of the West, and release pastor Brunson without condition .\" In Turkey the comments by <mark>Bolton</mark> were met with anger. Ibrahim Kalin, spokesman and adviser to President Recep Tayyip Erdogan, said that Turkey's judicial independence was being challenged by Washington. \"There is a rule of law in Turkey, and the Andrew Brunson case is a legal issue. There is an ongoing legal process related to this individual,\" Kalin said. Turkey and the US face their greatest diplomatic crisis in recent memory as both countries engage in a war of words that has also harmed the Turkish economy. Five years ago, $1 was worth two lira. Now you can get six liras for the same dollar. In the last month the lira lost almost a quarter of its value against the dollar. This has caused a crisis in Turkey, in which Qatar has now pledged $15 billion to support the Turkish economy, further tying Ankara and Doha together. It has also caused Turkey to strengthen its ties to Moscow. Over the last three years Turkey has increasingly grown closer to Moscow, Qatar and Iran on a variety of issues. But Ankara had hoped briefly that <mark>Donald Trump</mark>'s election in October 2016 would bring warmer relations. The view from Ankara is that the US has been working with allies of the Kurdistan Worker's Party (PKK) in Syria. The PKK's Syrian affiliate is named the People's Protection Units (YPG). The YPG has been the main force fighting ISIS in Syria since 2014, and the US helped the YPG push ISIS back from Kobani in 2015 and then began to work closely with the YPG in its rebranded form as the Syrian Democratic Forces (SDF). The SDF liberated Raqqa last year, and the US is increasing its footprint in Syria, sending new special envoys and diplomatic staff, as well as securing hundreds of millions in assistance for stabilization from Saudi Arabia and the United Arab Emirates. Turkey's conduit to <mark>Trump</mark>'s White House was supposed to be <mark>Michael Flynn</mark>, <mark>Trump</mark>'s first national security adviser. According to the BBC Ankara asked for <mark>Flynn</mark>'s help in getting a cleric named Fethullah Gulen deported from the US back to Turkey, where he faced charges connected to the 2016 coup attempt. But <mark>Flynn</mark> was fired by <mark>Trump</mark> and got snared in the Russia collusion investigation of Robert Mueller. Erdogan flew to Washington in May 2017 to meet <mark>Trump</mark>. But the visit turned sour when Turkish security personnel were filmed beating up protesters next to the Turkish Embassy in an embarrassing and unprecedented incident. Things went downhill slowly from there. Turkish officials repeatedly warned that Turkish forces and their Syrian rebel allies wanted to move on Manbij in northern Syria, a town held by the SDF east of the Euphrates. Instead, in January 2018, Turkey and its Syrian rebels invaded Afrin in northwestern Syria, a small Kurdish canton held by the YPG. This angered the SDF, which shifted forces from fighting ISIS and warned the Americans that they shouldn't abandon their friends in Syria. After Turkey took Afrin in March 2018, it set its sights again on Manbij. In June 2018 Secretary of State Mike Pompeo flew to Ankara and worked up a \"road map\" on Manbij with Ankara. There would be independent patrols around the town, with Turkish and US troops coordinating. These were supposed to lead to \"joint patrols,\" but in August Secretary of Defense <mark>James Mattis</mark> said there were more details to be ironed out. The problems in Manbij were playing out against the larger dispute between Ankara and Washington. The pawn in this dispute became Brunson, who had been arrested in Turkey and accused of being connected to the coup plot. \"A fine gentleman and Christian leader in the United States is on trial and being persecuted in Turkey for no reason,\" <mark>Trump</mark> tweeted on April 17. \"A total disgrace that Turkey will not release respected US Pastor,\" he tweeted again on July 18. According to a report on Ynet, <mark>Trump</mark>'s team sought out a deal with Ankara where Israel would release a Turkish woman detained for ties to Hamas, in exchange for Brunson. She was released and flew back to Turkey on July 15. But although Brunson was let out to house arrest on July 25, he wasn't released. <mark>Trump</mark>, apparently feeling betrayed, announced a doubling of tariffs on steel and aluminum on August 10. Since then the Turkish economy has been damaged. Average Turks have taken to the Internet to express anger, bashing iPhones, cutting up dollars and encouraging Muslims around the world to support the lira as a form of religious support for Turkey. This is part of the current mood in Ankara that is increasingly one that views the world through the lens of political Islam. But at the same time that Turkey asserts that the charges against Brunson are just an \"independent\" judicial issue, a report on The Wall Street Journal website claimed on August 20 that Ankara had proposed freeing the pastor in exchange for the end of a US investigation into a Turkish bank. Probably the story is more complex than that. Turkey also wants Gulen deported. The fact that two \"deals\" regarding Brunson were reportedly in the works seems to indicate that the story of \"judicial independence\" is not entirely rock solid. Turkey is willing to negotiate. That calls into question what exact evidence there is regarding Brunson. The <mark>Trump</mark> administration has made Brunson the centerpiece of its policy, as opposed to discussing wider issues such as why Turkey is buying the S-400 from Russia and Turkey's role in Syria. US media have begun to discuss whether the NATO alliance with Turkey is beneficial. \"Time for Turkey and NATO to go their separate ways,\" reads a piece in The Washington Post. Another piece at Foreign Policy says, \"<mark>Trump</mark> is the first president to get Turkey right .\" The rift was already there, says The National Interest. Indeed, the rift has been growing for more than a decade since the US invasion of Iraq in 2003, when Turkey rejected a proposal to base US troops on its soil. The problem with the <mark>Trump</mark> administration's crackdown on Turkey relations is that it could be reversed easily if the pastor is released. It could also change dramatically when <mark>Trump</mark> leaves office, as the next US administration will seek to do the opposite of everything <mark>Trump</mark> did. In US foreign policy circles, there is a vibrant pro-Turkey lobby that argues for \"engagement\" with Ankara, that worries that any pressure from the US will result in Turkey's growing embrace of Iran and Russia. It sees the SDF as a temporary ally, a group that was convenient when fighting ISIS, but which can be quietly abandoned in the next few years, as Washington maneuvers back to Ankara, which is seen as a 70-year ally since the start of the Cold War. These voices ignore Turkey's own agency and independent policy. They don't see Turkey as a full-fledged country making its own choices. They see it as only reacting to whatever the US is doing. But Turkey's crackdown on the press and frequent outbursts in Ankara harshly slamming various European countries or the US are not just reactions; they represent a growing Turkish national wand religious consensus. <mark>Trump</mark> could make a deal, but the long-term relationship will likely remain unstable. Seth Frantzman is The Jerusalem Post's op-ed editor, a Writing Fellow at the Middle East Forum, and a founder of the Middle East Center for Reporting and Analysis.", "articleID": "2018082900_00258932_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "James Mattis": ["Q1680776", "Q267902"]}}]