[{"date": "2018-08-29", "url": "http://meforum.org/articles/2018/where-is-the-us-turkey-crisis-headed", "content": "Where Is the US-Turkey Crisis Headed? Jerusalem Post August 24, 2018 As <mark>Trump</mark> and Erdogan dig in, the chances that the two countries can return to a stable relationship is shrinking. Turkey and Turks \"Turkey buying the Russian S-400 missile defense system would threaten the security of our F-35 aircraft and let Putin collect critical intelligence on us. We must pass my provision in the defense bill this week to block the F-35 delivery until Turkey ends its deal with Russia,\" wrote US Sen. Chris Van Hollen on Wednesday. His comments came a day after US National Security Adviser <mark>John Bolton</mark>, visiting Jerusalem, said that Ankara made a \"big mistake\" by not releasing US Pastor Andrew Brunson. \"Every day that goes by, that mistake continues. This crisis could be over instantly if they did the right thing as a NATO ally, part of the West, and release pastor Brunson without condition .\" In Turkey the comments by <mark>Bolton</mark> were met with anger. Ibrahim Kalin, spokesman and adviser to President Recep Tayyip Erdogan, said that Turkey's judicial independence was being challenged by Washington. \"There is a rule of law in Turkey, and the Andrew Brunson case is a legal issue. There is an ongoing legal process related to this individual,\" Kalin said. Turkey and the US face their greatest diplomatic crisis in recent memory as both countries engage in a war of words that has also harmed the Turkish economy. Five years ago, $1 was worth two lira. Now you can get six liras for the same dollar. In the last month the lira lost almost a quarter of its value against the dollar. This has caused a crisis in Turkey, in which Qatar has now pledged $15 billion to support the Turkish economy, further tying Ankara and Doha together. It has also caused Turkey to strengthen its ties to Moscow. Over the last three years Turkey has increasingly grown closer to Moscow, Qatar and Iran on a variety of issues. But Ankara had hoped briefly that <mark>Donald Trump</mark>'s election in October 2016 would bring warmer relations. The view from Ankara is that the US has been working with allies of the Kurdistan Worker's Party (PKK) in Syria. The PKK's Syrian affiliate is named the People's Protection Units (YPG). The YPG has been the main force fighting ISIS in Syria since 2014, and the US helped the YPG push ISIS back from Kobani in 2015 and then began to work closely with the YPG in its rebranded form as the Syrian Democratic Forces (SDF). The SDF liberated Raqqa last year, and the US is increasing its footprint in Syria, sending new special envoys and diplomatic staff, as well as securing hundreds of millions in assistance for stabilization from Saudi Arabia and the United Arab Emirates. Turkey's conduit to <mark>Trump</mark>'s White House was supposed to be <mark>Michael Flynn</mark>, <mark>Trump</mark>'s first national security adviser. According to the BBC Ankara asked for <mark>Flynn</mark>'s help in getting a cleric named Fethullah Gulen deported from the US back to Turkey, where he faced charges connected to the 2016 coup attempt. But <mark>Flynn</mark> was fired by <mark>Trump</mark> and got snared in the Russia collusion investigation of Robert Mueller. Erdogan flew to Washington in May 2017 to meet <mark>Trump</mark>. But the visit turned sour when Turkish security personnel were filmed beating up protesters next to the Turkish Embassy in an embarrassing and unprecedented incident. Things went downhill slowly from there. Turkish officials repeatedly warned that Turkish forces and their Syrian rebel allies wanted to move on Manbij in northern Syria, a town held by the SDF east of the Euphrates. Instead, in January 2018, Turkey and its Syrian rebels invaded Afrin in northwestern Syria, a small Kurdish canton held by the YPG. This angered the SDF, which shifted forces from fighting ISIS and warned the Americans that they shouldn't abandon their friends in Syria. After Turkey took Afrin in March 2018, it set its sights again on Manbij. In June 2018 Secretary of State Mike Pompeo flew to Ankara and worked up a \"road map\" on Manbij with Ankara. There would be independent patrols around the town, with Turkish and US troops coordinating. These were supposed to lead to \"joint patrols,\" but in August Secretary of Defense <mark>James Mattis</mark> said there were more details to be ironed out. The problems in Manbij were playing out against the larger dispute between Ankara and Washington. The pawn in this dispute became Brunson, who had been arrested in Turkey and accused of being connected to the coup plot. \"A fine gentleman and Christian leader in the United States is on trial and being persecuted in Turkey for no reason,\" <mark>Trump</mark> tweeted on April 17. \"A total disgrace that Turkey will not release respected US Pastor,\" he tweeted again on July 18. According to a report on Ynet, <mark>Trump</mark>'s team sought out a deal with Ankara where Israel would release a Turkish woman detained for ties to Hamas, in exchange for Brunson. She was released and flew back to Turkey on July 15. But although Brunson was let out to house arrest on July 25, he wasn't released. <mark>Trump</mark>, apparently feeling betrayed, announced a doubling of tariffs on steel and aluminum on August 10. Since then the Turkish economy has been damaged. Average Turks have taken to the Internet to express anger, bashing iPhones, cutting up dollars and encouraging Muslims around the world to support the lira as a form of religious support for Turkey. This is part of the current mood in Ankara that is increasingly one that views the world through the lens of political Islam. But at the same time that Turkey asserts that the charges against Brunson are just an \"independent\" judicial issue, a report on The Wall Street Journal website claimed on August 20 that Ankara had proposed freeing the pastor in exchange for the end of a US investigation into a Turkish bank. Probably the story is more complex than that. Turkey also wants Gulen deported. The fact that two \"deals\" regarding Brunson were reportedly in the works seems to indicate that the story of \"judicial independence\" is not entirely rock solid. Turkey is willing to negotiate. That calls into question what exact evidence there is regarding Brunson. The <mark>Trump</mark> administration has made Brunson the centerpiece of its policy, as opposed to discussing wider issues such as why Turkey is buying the S-400 from Russia and Turkey's role in Syria. US media have begun to discuss whether the NATO alliance with Turkey is beneficial. \"Time for Turkey and NATO to go their separate ways,\" reads a piece in The Washington Post. Another piece at Foreign Policy says, \"<mark>Trump</mark> is the first president to get Turkey right .\" The rift was already there, says The National Interest. Indeed, the rift has been growing for more than a decade since the US invasion of Iraq in 2003, when Turkey rejected a proposal to base US troops on its soil. The problem with the <mark>Trump</mark> administration's crackdown on Turkey relations is that it could be reversed easily if the pastor is released. It could also change dramatically when <mark>Trump</mark> leaves office, as the next US administration will seek to do the opposite of everything <mark>Trump</mark> did. In US foreign policy circles, there is a vibrant pro-Turkey lobby that argues for \"engagement\" with Ankara, that worries that any pressure from the US will result in Turkey's growing embrace of Iran and Russia. It sees the SDF as a temporary ally, a group that was convenient when fighting ISIS, but which can be quietly abandoned in the next few years, as Washington maneuvers back to Ankara, which is seen as a 70-year ally since the start of the Cold War. These voices ignore Turkey's own agency and independent policy. They don't see Turkey as a full-fledged country making its own choices. They see it as only reacting to whatever the US is doing. But Turkey's crackdown on the press and frequent outbursts in Ankara harshly slamming various European countries or the US are not just reactions; they represent a growing Turkish national wand religious consensus. <mark>Trump</mark> could make a deal, but the long-term relationship will likely remain unstable. Seth Frantzman is The Jerusalem Post's op-ed editor, a Writing Fellow at the Middle East Forum, and a founder of the Middle East Center for Reporting and Analysis.", "articleID": "2018082900_00258932_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"]}}, {"date": "2018-08-30", "url": "https://www.news24.com/World/News/trump-revisits-wargames-with-south-korea-as-north-korea-talks-stall-20180830", "content": "US President Donald Trump said that there's no reason to spend a lot of money on military wargames with South Korea, but he warned he could \"instantly\" relaunch the exercises again and they would be \"far bigger than ever before\". Trump made the comment on Wednesday in a series of tweets that primarily took aim at China, blaming it for lack of progress on getting North Korea to end its nuclear programme, following the president's landmark summit with <mark>Kim Jong Un</mark> in June. But there was also a loaded message for <mark>Kim</mark>: Mixing an expression of goodwill to the North Korean autocrat with an implicit military threat that will add to speculation over the direction of Trump's attempted rapprochement with a longtime adversary. \"The president believes that his relationship with <mark>Kim Jong Un</mark> is a very good and warm one, and there is no reason at this time to be spending large amounts of money on joint US-South Korea war games,\" Trump said, citing what was presented as a White House statement. \"Besides, the president can instantly start the joint exercises again with South Korea, and Japan, if he so chooses. If he does, they will be far bigger than ever before .\" Trump caught military leaders by surprise in June when he announced the suspension with the South, \"unless and until we see the future negotiation is not going along like it should\". He called the drills costly and provocative. The cancellation was an olive branch to Pyongyang, which has long complained that the exercises were invasion preparations. Often the North has reacted to the exercises with its own demonstrations of military might, including firing a new intermediate-range missile over Japan last year as a countermeasure to the drills. There was some hope that the gesture of shelving the fall exercises would foster goodwill and help nudge the North in the denuclearisation talks. But beyond returning the potential remains of about 55 US troops missing from the Korean War, and its continuing suspension in its missile and nuclear tests, there has been little movement from the North. As a result, the US last week shelved a planned trip to Pyongyang by Secretary of State Mike Pompeo, citing lack of progress on denuclearisation, but remaining open to future talks. As doubts grow in Washington and beyond over <mark>Kim</mark>'s willingness to relinquish his nukes, Trump has been heaping blame on China, which is North Korea's traditional ally and main trading partner. On Wednesday the president accused Beijing of pressuring the North because of current tensions in US-China trade relations, and also of providing North Korea money, fuel, fertiliser and other commodities, which he said was not helpful. China cooperated with the US last year in adopting tough international sanctions against North Korea and maintains it is still enforcing the restrictions adopted by the <mark>UN</mark> Security Council. But in his tweets, Trump also signalled that the US has its own military means of exerting pressure on Pyongyang. His remarks compounded confusing messages from the Pentagon over the past two days that have revived speculation over the drills. On Tuesday, Defence Secretary Jim Mattis told reporters the US might carry out drills with South Korea next spring after having cancelled a major exercise this summer. He said no decision has been made on when to resume military exercises, but his statements suggested the recent cancellation might not be repeated. Several US officials acknowledged on Wednesday that planning is going forward for the spring exercises, which require months of preparation. \"Routine planning continues for major US-ROK exercises on the peninsula in accordance with the normal exercise programme planning cycle,\" said Air Force Col. Patrick Ryder, spokesperson for the Joint Chiefs of Staff, referring to the acronym for South's official name, the Republic of Korea. Other US officials also said preliminary work on the drills has begun, noting that it is much easier to cancel an exercise than it is to slap one together quickly. The officials spoke on condition of anonymity to discuss internal conversations. <mark>David Maxwell</mark>, a senior fellow at the Washington-based Foundation for Defence of Democracies, said the initial planning for the exercises can begin a year in advance, including the funding, scheduling and movement of forces and units that will participate. As time goes on, planners would nail down the war game scenario and other details. \"We continue to plan for exercises, but we can stop them on a dime,\" said <mark>Maxwell</mark>, a retired Army colonel who served five tours in Korea. \"We can't restart them on a dime .\" He said the risk of a continued halt in the major drills would be a diminishing of skills and institutional memory between South Korean forces and the more than 28 000 US troops based there. \"The longer we go without exercises, the more risk there is that we will suffer significant challenges if there is a war,\" <mark>Maxwell</mark> said. US officials said Gen. Vincent Brooks, commander of US Forces in Korea, has taken steps to mitigate any loss of training by scheduling smaller exercises and staff drills. A key challenge in Korea is that the bulk of the US forces deploy for just a year, so they rely on the summer exercise to get familiar with the South Korean military and the ways allied troops coordinate and operate with them. The spring Foal Eagle drill is more expansive and includes fighter jets, maritime maneuvers, amphibious assault tactics and computer-simulated scenarios. KEEP UPDATED on the latest news by subscribing to our FREE newsletter. - FOLLOW News24 on Twitter", "articleID": "2018083017_00269243_W", "names": {"David Maxwell": ["Q17155889", "Q21997859", "Q27909749", "Q51586019", "Q5237245", "Q5237246", "Q5237247"], "Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2018-09-01", "url": "http://www.msn.com/en-us/money/careersandeducation/the-online-gig-economys-race-to-the-bottom/ar-BBMH0QE?srcref=rss", "content": "© B.K. Bangash / AP When the whole world is fighting for the same jobs, what happens to workers? Load Error You can buy almost any thing you want online--toothpaste, books, plastic devices that allow you to lick your cat. On digital work platforms like Upwork, Fiverr, and Freelancer.com, you can also buy nearly any service--often from someone halfway around the world, sometimes for just a few bucks. On Fiverr, one of the most popular of these platforms, you'll find offers for someone who will write an Ebook \"on any topic\" ; a person who will perform \"a Voiceover as Bernie Sanders\" ; someone who will write your Tinder profile for you, and someone who will design a logo for your real estate company. The people selling this labor live in Nigeria, Mexico, the United Kingdom, and Bangladesh, respectively. Each of them charge $5 for these tasks. For buyers, the appeal of these sites is obvious: They're a great place to find skilled and semi-skilled sellers willing to work for cheap. They track when work has been completed, allow sellers to rate workers, and provide staff who can help resolve disputes. The people selling their skills win, too: workers--especially those living overseas--can make a decent amount of money being paid in US dollars. The proliferation of online freelance job sites have allowed some people to leave poorly paying jobs in their home countries; it also allows students and those with little experience to sell their work, get good reviews, and start cultivating clients. It's free to list services on most of these sites, and once freelancers start getting reviews--which they can get from actual clients, or from friends who buy their service, or from people through \"Fiverr review' or other such Facebook groups--other buyers trust them and hire them. More than 48 million people have registered globally on websites allowing them to sell their labor. Optimistic about the potential of the digital economy to lift people from poverty, countries like Malaysia and Nigeria have embarked on campaigns to train residents in how to use online labor platforms; Malaysia aims to have 340,000 workers, mostly from the bottom 40 percent of income earners, make a living from online freelancing by 2020. The global digital labor force will only continue to grow: Nearly a quarter of a billion people came online for the first time last year, and about 4 billion people, more than half of the world's population, now have internet access. In 2016, the World Bank estimated that the global market for online freelancing was $4.4 billion. But while freelance websites may have raised wages and broadened the number of potential employers for some people, they've forced every new worker who signs up into entering a global marketplace with endless competition, low wages, and little stability. Decades ago, the only companies that outsourced work overseas were multinational corporations with the resources to set up manufacturing shops elsewhere. Now, independent businesses and individuals are using the power of the internet to find the cheapest services in the world too, and it's not just manufacturing workers who are seeing the downsides to globalization. All over the country, people like graphic designers and voice-over artists and writers and marketers have to keep lowering their rates to compete .\" There really is a race to the bottom effect going on here, because there's so much of an oversupply of workers, \"<mark>Mark Graham</mark>, a professor of internet geography at the Oxford Internet Institute, told me. <mark>Graham</mark> and his colleagues have been conducting an extensive study of the digital economy, interviewing hundreds of digital workers and analyzing data about tens of thousands of projects. They found that most buyers are located in high-income countries like the U.S., and most sellers are in countries such as India, Nigeria, and the Philippines. While digital labor markets are intended to allow sellers to auction off their work to whoever will pay the highest price for it, <mark>Graham</mark> and his Oxford colleagues Isis Hjorth and Vili Lehdonvirta found that they also help buyers find the cheapest sellers. The Internet Is Enabling a New Kind of Poorly Paid Hell\" Rates are way too low, but it's how it works, \"Jelena, a 17-year-old in Serbia who lists services on Fiverr.com, told me. (The Atlantic is not publishing her last name because Fiverr prohibits users from sharing email addresses and personal details, as she did with me .)\" Whoever offers the lowest price, gets the job. \"Jelena will translate 1,000 words from Serbian to English, or make a PowerPoint presentation, or even\" write a beautiful love letter \"for just $5 a pop. Fiverr takes about 20 percent of that, and then she gets charged a PayPal fee, so she ends up with about $3 for each service, she told me. Related video: The highest-paying side hustles on Fiverr (provided by CNBC) Click to expand Replay Video UP NEXT Never overpay for auto repairs with these 3 tips Here's how to get a fair price at the auto shop. USA TODAY Amazon closing in on $1 trillion Brent Thill, Jefferies senior tech analyst, and Colin Sebastian, Baird senior research analyst, discuss Amazon's march to a $1 trillion market cap after crossing the $2,000 <mark>mark</mark>. CNBC Disneyland's new Star Wars area will serve alcohol A first for Disneyland. The Happiest Place on Earth will be serving alcoholic drinks in a galaxy far, far away. Stacey Butler reports. CBS Los Angeles 1 Cancel SETTINGS OFF HD HQ SD LO The highest-paying side hustles on Fiverr CNBC See more videos SHARE SHARE TWEET SHARE EMAIL What to watch next Never overpay for auto repairs with these 3 tips USA TODAY 0:51 Amazon closing in on $1 trillion CNBC 2:58 Disneyland's new Star Wars area will serve alcohol CBS Los Angeles 2:07 You could win $11K if you name your baby after KFC's Colonel Buzz60 1:07 Former Enron CEO moved from prison to halfway huse Veuer 0:42 Disposable toothbrush aims to keep both teeth and planet clean Reuters 1:17 From Barack boom to Trump slump: Demand slows for AR-15-style rifles The Wall Street Journal. 4:18 Restaurants say no to cell phone use while dining CBS News 1:38 Small business creates kid-friendly cheese that tastes like candy Fox Business 2:38 California becomes the first state to eliminate its cash bail system Veuer 0:48 California wants all of its electricity to be carbon-free by 2045 Newsy 0:58 Stocks are always more attractive than bonds, Warren Buffett says CNBC 1:52 5 things you need to know before buying an electric car USA TODAY 1:50 FDA approving drugs at record-setting pace Fox Business 3:55 Abercrombie & Fitch sales disappoints Reuters 0:55 Mobile pay: It's faster and safer than a credit card so why aren't you using it? USA TODAY 1:26 UP NEXT I encountered Jelena when I logged onto Fiverr, and, curious about the quality of the stuff I could buy for just $5, hired her a few other freelancers to do some tasks. For just $7--$5 plus a $2 service fee charged by Fiverr--Jelena wrote a 200-word love letter for me. It was great: I told her that my fictional paramour and I had been dating for 161 days, and she added up those digits, which equal the number eight, and made a reference to how flipping an\" 8 \"on its side would lead to the infinity sign .\" I wannaflip that 8 to the left and spend it with you, \"she wrote. Fiverr was founded in 2010 to take some of the\" friction \"out of the process of finding and working with a freelancer, making it as easy to buy labor as it is to buy a T-shirt online. In a statement, spokesperson Sam Katzen described it as\" a global community that enables anyone to be a doer. \"Freelancers have been allowed to charge more than $5 since 2015, and they are increasingly raising their rates: Just 5 percent of services cost $5, according to Katzen. Last year, Fiverr introduced a tier called Fiverr Pro that\" hand-picks \"high-quality workers who charge more, Katzer said. While I found many logo designers listing their services for $5 on Fiverr, the Fiverr Pro designers charged much more, from $375 and up. Digital freelance sites each work a little differently. On Fiverr, buyers and sellers correspond through the platform anonymously and are not supposed to exchange email addresses or phone numbers, a rule designed to ensure that people won't connect off the platform and thus hire one another without Fiverr getting a cut. Anyone can create a profile and begin selling their services right away, but they don't have to upload a photo of themselves, or enter their education qualifications or use their real name. Because people are restricted from exchanging too much information about themselves, it can be hard to know who you're hiring. One of the workers I hired to write a Christian-themed blog post for $5 had a profile that listed her name as\" Deborah Hutton. \"It said that she was a\" journalist by training, \"and it featured a picture of a young white woman in glasses looking at a laptop, smiling. But when I did a reverse Google image search of the photo, I found it was actually an Adobe stock photo, titled\" Happy woman using laptop at café. \"And the name Deborah Hutton is the same as that of an English journalist for Vogue who died in 2005. When I asked\" Deborah \"if that was really her name, she did not write back. Fiverr listed her location as Nigeria. (Sites like Upwork, by contrast, require workers to submit an application that includes a real photo, their qualifications, and schooling .) The internet makes all workers equal; there's no way for a buyer to know who really is sitting behind the computer doing the work. This is a boon for many. <mark>Graham</mark> talked to people who did not have legal immigration status in the countries where they lived, but were still able to earn a living online, and older workers who had lost their jobs, but had disguised their age and finding work. But that also means similarly talented people can charge equal rates, regardless of their actual qualifications, even if they live in countries that have vastly different costs of living--and that Americans and other skilled workers in the developed world have a particularly hard time competing. That's partly why the Harvard economist Richard B. Freeman warned more than a decade ago that the growth of the global workforce, with its proliferation of educated workers everywhere,\" presents the U.S. economy with the greatest challenge since the Great Depression. \"Monika Taylor lives in the United States and offers psychic readings for $5 on Fiverr to supplement her full-time job. She had mostly been selling her readings on Facebook and Pinterest for about $65 to $85, she told me, but when she stumbled across Fiverr, she figured it was a good way to broaden the number of people she could reach. Though she balked when she saw that others were charging just $5 for psychic readings, she decided to list her services anyway, figuring she could raise rates once she had enough clients. She got a few clients over the last few years, but when she raised her rates recently, to $15 from $5, people stopped buying her readings, she said. Now, she has gone back to mostly selling on other platforms .\" If I had to make a living on Fiverr, \"she told me,\" I would be living under a bridge. \"Sellers know that if they complain or ask for more money, there are millions of workers out there who will replace them. They also don't want to ally with other workers and advocate for better working conditions because they see those people as competitors, not colleagues, <mark>Graham</mark> found .\" They don't want to make a fuss, they just want to get a five-star rating, \"<mark>Graham</mark> told me. Many workers are willing to lower their rates beyond what they considered fair, the academics wrote in a paper summing up their research. Of course, many people are having a positive experience in the online digital economy. <mark>Graham</mark> and his colleagues interviewed Arvin, a university professor in Manila, who, at the time he signed up for a digital platform, was frustrated by his low wages and long commute at the university. Once he started selling his services doing search engine optimization, he was able to leave his university job and soon made three times what he had made before--about $600 a month--working just 25-30 hours a week. Another worker, Kim-Ly, who lives in Vietnam, found a data entry job online that paid $8 an hour--about four times what she had made before as an accountant at a bank--that allowed her to travel abroad and buy luxury goods. I also corresponded with Jahanzeb Malik, a 24-year-old Pakistani man who told me he made about $5,000 over two years on Fiverr creating PowerPoint presentations for startups pitching to investors. He did Fiverr while he was in school, and liked having the extra money, he said. He was good at PowerPoints, and he was good at social media, and by answering questions about Fiverr on sites like Quora, he became\" a guru-like figure \"in the community of Fiverr sellers, he told me. That allowed him to launch his own website, NerdsHD.com, where he blogs about the digital economy and sells what he had sold on Fiverr before, but for more money. His work on Fiverr gave him the client list and name recognition to start his own business, he told me. For other workers, though, gigs are too unstable to make a living. The firm that employed Kim-Ly, for instance, reduced her pay to $6 and then closed the project. When she found a new job, it was for just $4 an hour, and she told the researchers she didn't feel comfortable bargaining for better pay. Another study of a different digital work platform in Europe found that the vast majority of people who listed a service were never hired for any gigs. Jelena, the woman from Serbia, told me she's made her peace with the idea that she has to offer the lowest possible rates\" in order to get any jobs at all. \"A woman I hired to write a short story, a 23-year-old who didn't want her name used, lives in Canada, where she is trying to become a writer. She's sold writing on Fiverr since 2015, and told me that while it was hard to get work at first because there were so many sellers to compete with, she now has lots of good reviews, and consistent jobs. The 500 word story she completed for me was funny, succinct, and well-written, but she still charged just $5 for it. After more than three years, she still sees Fiverr as a way to earn some side cash, rather than as a full-time job. Genevieve Hannon used to be a voice actor in New York City, where she was a member of SAG-AFTRA, which meant that she sometimes made $500 for a quick session doing TV voiceover promos. She made about $85,000 to $100,000 a year, she told me. She eventually left the East Coast to become a veterinary tech in Utah, but when she decided to supplement her income by doing voiceover work online, she had to dramatically lower her rates to find work on Fiverr. At first, she charged just $5 for 100 words of script, which made her feel guilty because she knew she was drastically undercutting union rates. When she started getting good reviews, she slowly raised her rates, and eventually made $17,000 one year. But she felt guilty doing work for multinational companies that had previously hired union actors for much more money, she told me. She was stuck: If she rejoined the union, she wouldn't get much work, because so many buyers had gone to digital work sites. But Fiverr didn't earn her as much money. She eventually got kicked off Fiverr for listing her website in a correspondence with a client, she told me, and in the end, she was glad to leave the site .\" It was a real relief to feel like I'm not doing something harmful for the overall good, \"she said. Still, now that she's banned from Fiverr, she's had to resort to other digital work sites to sell her services, which she says don't have the reach of Fiverr. <mark>Graham</mark> has a few suggestions for how these sites can pay better. He suggested forming a global group that could ensure international labor standards are being met, for example. He recently wrote a proposal for a FairWork Foundation, which would give certifications to companies that pay the minimum wage and treat workers fairly. Workers could also form digital picket lines to disrupt employers who don't pay fairly or treat workers well, or they could gather on Reddit or Facebook to share information about better-paid gigs. (Workers on Amazon's Mechanical Turk have Turkopticon, for example, a browser plugin that allows users to rate employers .) Some workers in other gig industries have established platform co-ops that allow them to better control rates and working conditions. These changes might not have much of an impact on U.S. and Canadian workers who are competing with people overseas. But paying workers in the developing world better will have a positive effect on everyone else, <mark>Graham</mark> said. A U.S. law requiring that any employer who uses these platforms follow the labor laws in the countries where they're operating could help .\" I guess my only hope within this reality is that we can...raise working conditions for those that currently have bad ones, rather than lowering working conditions for everyone, \"he told me. America has, for a long time, decided that the upsides of outsourcing outweigh the downsides. When U.S. companies first started sending manufacturing jobs overseas, millions of American customers got lower prices for the goods they were buying, which made them a little less concerned about the tens of thousands of people whose manufacturing job had disappeared, but we never did find a way to help the losers of globalization become winners. It's possible that Americans will still decide that this latest wave of outsourcing is, on the whole, beneficial, too. But the usual mantra told to people who have lost their jobs to outsourcing--get more education, get more training--doesn't make sense in an economy where educated people across the world are competing: On Fiverr, I found someone in Pakistan offering to do architectural designs for just $5. This is good news for the many talented people who now have a global platform to sell their services to buyers everywhere. One recent paper has predicted that a\" Matthew effect \"could begin to dominate the global gig economy, in which the most successful workers do better and better. Everyone else, though, is going to do worse.", "articleID": "2018090113_00017871_W", "names": {"Mark Graham": ["Q2268347", "Q26214583", "Q55673782", "Q6767788", "Q6767789", "Q6767790", "Q6767791", "Q6767792"]}}, {"date": "2018-09-03", "url": "http://www.irishnews.com/news/brexit/2018/09/03/news/boris-johnson-offering-no-new-brexit-ideas-sasy-downing-street-1423757/", "content": "Boris Johnson offering no new Brexit ideas, says Downing Street <mark>Theresa May</mark> hit back over Boris Johnson's criticism of how she is handling Brexit. Picture by Stefan Rousseau/PA Wire Andrew Woodcock, Press Association 03 September, 2018 16:20 Downing Street has delivered a stinging slapdown to former Briitsh foreign secretary Boris Johnson, saying he has produced \"no new ideas\" on Brexit. In a barely-veiled rebuff to Mr Johnson's ambitions to become prime minister, <mark>Theresa May</mark>'s official spokesman told reporters that the country needed \"serious leadership with a serious plan\" which was being provided by the current premier. The comments came after Mr Johnson used his regular Daily Telegraph column to launch a scathing attack on Mrs <mark>May</mark>'s Brexit strategy, branding it a \"fix\" that can only lead to victory for the EU. In what was seen by many at Westminster as an opening sally in a bid to oust the British prime minister, the ex-foreign secretary insisted the UK was \"lying flat on the canvas\" in withdrawal talks. Britain has \"gone into battle with the white flag fluttering over our leading tank\" due to Mrs <mark>May</mark>'s Chequers proposals to align UK standards on goods to the EU, Mr Johnson said. But Mrs <mark>May</mark>'s spokesman insisted that the plans set out in the British government's Brexit White Paper were \"the only credible and negotiable plan which has been put forward\". And the spokesman added: \"Boris Johnson resigned over Chequers. There's no new ideas in this article to respond to .\" What we need at this time is serious leadership with a serious plan and that's exactly what the country has with this prime minister and this Brexit plan. \"Writing in the Telegraph, Mr Johnson compared withdrawal negotiations between Brexit Secretary Dominic Raab and the EU's chief negotiator Michel Barnier to a rigged wrestling match .\" The fix is in, \"said the former foreign secretary .\" The whole thing is about as pre-ordained as a bout between Giant Haystacks and Big Daddy; and in this case, I am afraid, the inevitable outcome is a victory for the EU, with the UK lying flat on the canvas and 12 stars circling symbolically over our semi-conscious head. \"Mr Johnson accused\" some members \"of the Briitsh government of deliberately using the Irish border question to\" stop a proper Brexit \"and effectively keep Britain in the EU. He said that the real\" scandal \"was\" not that we have failed, but that we have not even tried \"on Brexit .\" The UK has agreed to hand over £ 40 billion of taxpayers' money for two-thirds of diddly squat, \"he said. Under the Chequers plan,\" we will remain in the EU taxi, but this time locked in the boot, with absolutely no say on the destination \". But <mark>Theresa May</mark>'s spokesman retorted:\" The Chequers proposals are the only credible and negotiable plan which has been put forward and which will deliver on the will of the British people. \"And Home Secretary Sajid Javid said Tories should unite behind Mrs <mark>May</mark>'s blueprint, pointedly adding:\" For those who think there is a different way then they need to properly set out what alternatives there might be. \"Mr Johnson's intervention won the backing of leading Tory Brexiteers <mark>Steve Baker</mark>, who described it as\" superb \"and Owen Patterson, who said it offered a clear articulation of the\" myths \"surrounding the Irish border. It came as Mrs <mark>May</mark> faced growing opposition on Tory benches to the compromise deal agreed by the Cabinet at her country residence in July, with Brexiteers warning it will be voted down if it comes before the House of Commons. With Parliament returning from recess on Tuesday, the PM is expected to face a coordinated effort from Tory hardline Brexiteers to abandon her exit agenda amid reports that election strategist Sir Lynton Crosby is involved in a\" chuck Chequers \"campaign. And the viability of the Chequers model was also coming under question in Brussels, with Mr Barnier telling a German newspaper that he is\" strongly opposed \"to elements of the plan. Mrs <mark>May</mark>'s proposals, which would see the UK remain in a free trade area for goods while ending freedom of movement, would involve\" insane and unjustifiable bureaucracy \", said Mr Barnier. The PM's spokesman insisted that the Chequers plan had received\" a positive response \"from a number of EU leaders and said that Number 10 believes it\" can carry the support of the House of Commons \".\" We want the EU to engage in these negotiations with energy and imagination, \"said the spokesman .\" Michel Barnier has said a lot of things in recent weeks. The negotiations between the secretary of state and Michel Barnier are ongoing. You can expect some to be taking place in the coming days. \"It's very clear that the Chequers proposals are being taken seriously...What you've seen over the summer from a series of European leaders is a positive response to the Chequers proposals .\" Despite warning that the PM had declared \"open sesame\" for further concessions to Brussels, former Brexit secretary <mark>David Davis</mark> rejected suggestions she should be replaced. In what appeared to be a veiled attack on Mr Johnson - who walked out of the Cabinet hours after his own resignation over Chequers - Mr <mark>Davis</mark> told ITV1's Good Morning Britain it was not the time for \"personality politics\". Asked if it would be better if Mrs <mark>May</mark> stood down, Mr <mark>Davis</mark> said: \"No, we don't need any more turbulence right now .\" What matters in all of this is not the personality politics, it's the outcome at the end. \"Asked if he thought the Chequers deal was in tatters, Labour leader Jeremy Corbyn said:\" It sounds like it is and it sounds like Boris Johnson, having spent two years as Foreign Secretary, has achieved nothing and now says it's all off. \"Well surely, it's time for some serious people to take over the negotiations? The Tories have had two years since the referendum and made no progress at all .\" Enjoy reading the Irish News? Subscribe from just £ 1 for the first month to get full access Subscribe Topics brexit <mark>Theresa May</mark> boris johnson Michel Barnier Categories Brexit 03 September, 2018 16:20 Brexit", "articleID": "2018090315_00086146_W", "names": {"David Davis": ["Q1174175", "Q1174177", "Q13471238", "Q16206936", "Q28037658", "Q300023", "Q41256031", "Q4710588", "Q56596944", "Q843907"], "Steve Baker": ["Q10379857", "Q15973457", "Q1991602", "Q2346812", "Q260111", "Q6380444", "Q7611849", "Q7611850", "Q7611852", "Q9345785"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2018-09-03", "url": "http://www.eurosport.co.uk/football/james-chester-welcomes-possibility-of-facing-denmark-without-top-players_sto6916660/story.shtml", "content": "<mark>James Chester</mark> welcomes possibility of facing Denmark without top players By PA Sport 2 hours ago Updated 1 minute ago 0 0 The Danes are involved in a long-running dispute over their squad's commercial rights. Wales defender <mark>James Chester</mark> has welcomed the possibility that UEFA Nations League opponents Denmark could be without Christian Eriksen and company in Aarhus on Sunday. The Danes are involved in an extraordinary row between their Player Association (Spillerne) and Football Association (DBU) which threatens both this fixture and Denmark's participation in the 2020 European Championship. The long-running dispute is over a new commercial rights agreement for the squad, and the DBU has threatened to select players from Denmark's lower leagues rather than the likes of Tottenham midfielder Eriksen, Chelsea defender Andreas Christensen and Leicester goalkeeper Kasper Schmeichel. \"It would certainly make it an easier fixture without Eriksen,\" <mark>Chester</mark> said. \"He is one of the best players in the Premier League. He showed that at the World Cup .\" Denmark are due to play a friendly in Slovakia on Wednesday but at present do not have a playing squad to fulfil the fixture. Manager Age Hareide and assistant Jon Dahl Tomasson are said to be \"working from home\" and will not be in charge for the game in Trnava. Hareide's squad were due to meet in Copenhagen on Monday to discuss the situation after Spillerne issued a strongly-worded statement that the DBU had walked out of talks over the weekend. Denmark, who are a lofty ninth in the FIFA rankings, have been beset by internal problems over the past 12 months. The national women's team boycotted a World Cup qualifier against Sweden in October 2017 in a dispute over employment conditions. Sweden were awarded a 3-0 win and UEFA fined the DBU £ 18,000. The DBU was also warned that Denmark would be barred from UEFA tournaments if it cancelled another match in the next four years. \"All is not well over there at the moment, but it's nothing to do with us,\" <mark>Chester</mark> said. \"We'll be in Denmark on Sunday regardless of what squad they pick, and looking to win the game whoever's playing .\" While Wales to discover the outcome of the Danish talks, Ryan Giggs' side are preparing for their opening Nations League game against the Republic of Ireland in Cardiff on Thursday. The two sides met twice last year when the Republic ended Wales' World Cup dream with a 1-0 win in Cardiff. The two games were controversial affairs and Republic defender Seamus Coleman suffered a broken leg in the Dublin clash. \"Any game that involves Ireland holds a bit of bite and tension in the air,\" <mark>Chester</mark> said. \"It's slightly different to most international football as you do know the vast majority of players you're playing against .\" The referees are perhaps a bit on edge knowing it's a Welsh and Irish thing. \"It could may be refereed in a slightly different way because they're not used to that sort of game .\" But it's a good game for us after our World Cup disappointment and something we're really excited for. \"0 Read and react", "articleID": "2018090315_00312018_W", "names": {"James Chester": ["Q28024774", "Q546799"]}}, {"date": "2018-09-03", "url": "http://www.lightreading.com/messages.asp?piddl_msgthreadid=76958&piddl_msgid=289795&piddl_msgtocontent=yes#msg_289795", "content": "21st Century Networking? Welcome to the Lock-In From the Founder <mark>Steve Saunders</mark>, Founder, Light Reading 2/20/2018 Comment (24) Login 100% 0% Tweet Industry pundits are fond of saying that the communications market is in the middle of \"unprecedented\" innovation. Not true. We've actually seen this level of creativity before--way back in the 1970s. That was the era when developments in microprocessors set off a huge explosion in computing. And yet it was also when success was constrained by the proprietary nature of the technology. As the customer, you bought your computer from IBM, DEC, Wang (heh), Honeywell or whoever, and you used the code (today we call them \"applications\" ) that the manufacturer sold with their massive computer box thingy. It was the first and biggest technology \"user lock-in\" that the computer tech industry had seen. And customers paid the price--figuratively and literally. Today, it looks like we're heading back to that proprietary environment. And the effect on end users--enterprises and service providers--will be the same: Paying more money for less choice. Want to learn more about 21st Century networking? Join me at Light Reading's Automation Everywhere on April 4 in Dallas. We will be tackling the business and technology challenges behind driving network automation. The event is free for communications service providers--register today! Why is this happening? Back in the 1970s the proprietary nature of computing triggered a visceral reaction in the adjacent world of communications, as standards bodies such as the International Telecommunication Union (ITU) and Institute of Electrical and Electronics Engineers Inc. (IEEE) took a stand to make sure that technologies that were vital to the growth of the global economy couldn't be co-opted by a single vendor. Vendors took these standards seriously, for very good reason, knowing that if they didn't comply they'd be left on the outside of a free market technology economy/ecosystem comprising a bunch of standards-compliant competitors. But then, somewhere in the first decade of the 21st century, our industry forgot about the importance of standards. Oops. Partly this was because of the undeniable appeal of \"open source .\" It's not hard to see why, with so many instances of open source code being successfully deployed in telcos around the world, our industry thought the same approach could work when virtualization became the \"next big thing .\" In the case of SDN virtualization, to a certain extent it has. But with the exponentially more complicated world of network functions virtualization (NFV), it has been a disaster. In fact, in my view, far from being \"open,\" the work on NFV has turned out to be both proprietary--nothing more than a giant production line of poorly thought-out and utterly incompatible code--and massively political (think Brussels bureaucracy, but for computers). The result is that, as an industry, we've spent the past five years making an utter balls-up of determining the new software-based infrastructure that will form the underlying foundation for all applications and services in the future. Instead of a clearly defined network layer, we now have a jumble of incompatible approaches to NFV, none of which work together without a huge lift involving lots of expensive lab work. Indeed, more than five years after NFV first became a \"thing\" in telecoms, Heavy Reading surveys of the world's major operators show that interoperability and the integration of virtualization technology with legacy technology is still the biggest barrier to successful NFV implementation. Network operators will struggle to find a \"Get out of lock-in free!' card once they're trapped behind vendor bars. Ironically, recent industry efforts to demonstrate NFV interoperability have actually shown how hard it still is to get virtualization products from different vendors to work together. Participants at ETSI's most recent NFV Plugfest event in January this year say the only way to get products from 24 of the 25 participants to\" talk \"to each other was by manually hard-coding the buggers--a process that does little more than allow vendors to feel a bit better about themselves and be able to claim some sort of interop success. (Note: The one exception to this manually-intensive exercise at the Plugfest was EnterpriseWeb, a company that has developed middleware that provides interconnectivity between different products without the need for hard coding and which, according to testimony seen by Light Reading, delivered on its promises. Disclosure: I am an advisor to EnterpriseWeb .) This is not how technology in the 21st century is supposed to work! No simple, plug-and-play interoperability = No falling prices = No free-market-technology-economy-soup for you! This doesn't mean we don't have innovation galore in the industry right now. The cost of entry for companies that want to code new and exciting applications and services is, as the US President is want to say, a small loan of a million dollars. That's literally all it costs to put together the software engineering team and servers that are required. What it does mean is that the software they produce won't work over the networks for which it's designed without a ridiculous amount of trial and error. And expense. My suspicion is that a lot of the incumbent vendors aren't so unhappy about how things have played out. If you're a company caught in the crosshairs of a rapidly shifting and increasingly unpredictable market, such as Ericsson or Nokia, for example, and the comms market isn't delivering the revenues you thought it would, the idea of jumping into a time warp--Weeeee!!!--back to a world where you can charge more and the customer has fewer options probably sounds, well, brilliant! But I'll tell you who isn't thinking like that, though--the Chinese. When the New IP Agency (NIA), a not-for-profit organization that I help run, recently announced the industry's first and only independent, open, NFV interoperability certification, designed to clear up the current miasma, Huawei and ZTE were the ones that signed up to be certified first. (See NIA to Tackle NFV's Ball & Chain: Interoperability .) These companies understand that having virtualization technology that is proven to work with code from third parties--yes, even from their competitors--and then have the results and methodologies made public so they can be accessed and referenced, is the only way to assuage the concerns of service providers and light a fire under the virtualization market. And if vendors in the rest of the world don't follow the example of the Chinese--and soon--we are going to end up with a situation where the Chinese beat them at a game that the West invented (successful, interoperable, standards-based technology). Last week I was visiting an enterprise organization in North America that is deploying one of the most advanced networks in the world--a software-based, virtualized architecture with analytics and automation capabilities. The. Whole. Nine. Yards. I asked them if they weren't worried about the fact that today's next-gen applications aren't readily interoperable with the virtualization infrastructure from third-party suppliers .\" Oh no, \"came the answer .\" We're a Cisco shop. \"From that statement, it's just a short hop to\" no one ever got fired for buying IBM. \"And then getting fired for buying IBM .--<mark>Steve Saunders</mark>, Founder, Light Reading (24) | Comment | Print | RSS", "articleID": "2018090320_00247166_W", "names": {"Steve Saunders": ["Q11950377", "Q42421831", "Q7613853"]}}]