[{"articleID": "2014042907_00065334_W", "names": {"Catherine Russell": ["Q1051036", "Q2001814", "Q28530986"], "Ben Wolfe": ["Q21887601", "Q4886719"], "Jimmy Webb": ["Q1287983", "Q18637872", "Q3179158"]}, "date": "2014-04-28", "url": "http://audaud.com/2014/04/catherine-russell-bring-it-back-tracklist-follows-jazz-villagediane-schuur-i-remember-you-with-love-to-stan-and-frank-tracklist-follows-jazzheads/", "content": "<mark>Catherine Russell</mark> - Bring It Back [TrackList follows] - Jazz Village Diane Schuur - I Remember You (With Love to Stan and Frank) [TrackList follows] - Jazzheads: Two terrific jazz vocalists you should know about. Diane Schuur - I Remember You (With Love to Stan and Frank) [TrackList follows] - Jazzheads: \"alt =\" <mark>Catherine Russell</mark> - Bring It Back [TrackList follows] - Jazz Village <mark>Catherine Russell</mark> - Bring It Back [TrackList follows] - Jazz Village JV579001 [Distr. by Harmonia mundi] (2/11/14) ****: Diane Schuur - I Remember You (With Love to Stan and Frank) [TrackList follows] - Jazzheads JH1209, 51:59 ****: (with Alan Broadbent, p.; <mark>Ben Wolfe</mark>, bass; Ulysses Owens Jr., drums; Roni Ben-Hur, guitar; Joel Frohm, saxes; Romeo Lubambo, guitar on 2 tracks) <mark>Catherine Russell</mark> has four CDs already out on this label, but I'm just discovering her. She's joined by a dozen sidemen on this session, and she wrote the horn arrangement for \"Aged and Mellow,\" and plays percussion on the tracks 6 and 10. Pianist Mark Shane is a standout and B-3 organist Glenn Patscha plays on three of the 13 tracks on the disc. The tunes range from soul-influenced numbers such as the opener and album title, thru Great American Songbook tunes like \"I Let a Song Go Out of My Heart,\" to jazz standards such as the closing \"I Cover the Waterfront .\" Generally they come from the jazz age thru the swing era. <mark>Russell</mark> is very big in France, where she earned both the Pris du Jazz Vocal and the Grand Prix du Hot Club de France. This is a versatile singer who can reinvent many of the tunes and is always in tune and doing just the right thing to make every song work. TrackList: Bring It Back; I'm Shooting High; I Let a Song Go Out of My Heart; You Got To Swing and Sway; Aged and Mellow; The Darktown Strutters Ball; Lucille; You've Got Me Under Your Thumb; After The Light Go Down Low; I'm Sticking With You Baby; Strange as it Seems; Public Melody Number One; I Cover The Waterfront. Diane Schuur, known as \"Deedles,\" is getting better every album she does. This CD is devoted to compositions and tunes previously recorded by her two early mentors: Stan Getz and Frank Sinatra. During her 30-year career she has become every bit the graceful and in some ways more subtle singer than she used to be. And she's picked up a most effective scat-singing style on the way. The blind singer really pays very close attention to the lyrics and you may get some meanings out of them that you had never thought of before. She also doesn't try to mimic either the style of Sinatra or any of the amazing solos that Stan Getz played, but she delivers these 11 songs with plenty of enthusiasm and a most swinging approach that will captivate any listener. Alan Broadbent's terrific arrangements and the all-star band help the whole thing along; both these albums make the usual vocalist-and-piano album sound rather lame. With names like Cole Porter, Michael Legrand, Antonio Carlos Jobim, <mark>Jimmy Webb</mark> and Hoagy Carmichael, these tunes can't fail even they weren't made famous by Getz and Sinatra. The whole production is a winner."}, {"articleID": "2011100310_00110960_W", "names": {"Greg Myers": ["Q50368122", "Q5606051", "Q5606053"], "Nick Powell": ["Q17014304", "Q22279725", "Q321082", "Q56000397"], "Josh Robinson": ["Q1109967", "Q18157453", "Q30122996"]}, "date": "2011-10-02", "url": "http://standardspeaker.com/sports/1.1212061?cache=03D163D03D163Dp%3A%2Fhe3D03Dn63Freporti3D19.11145issed-1.1176%2F%3FparentPage%3D2.2127%3Fcache%3D03D163D03D163Dp%3A%2Fhe3D03Dn63Freporti3D19.11145issed-1.1176%3Fcache%3D03D163D03D163Dp%3A%2Fhe3D03Dn63Freporti3D19.11145issed-1.1176%2F%3FparentPage%3D2.2127%3Fcache%3D03D163D03D163Dp%3A%2Fhe3D03Dn63Freporti3D19.11145issed-1.1176&localLinksEnabled=false", "content": "wright twp. - crestwood coach <mark>greg myers</mark> wanted to see his team's response to its first loss of the season. the comets showed their coach they're ready for a playoff push in the second half of the season as crestwood jumped on tunkhannock early and often in a 49-0 victory saturday night at comets stadium. <mark>nick powell</mark> recovered a fumble in the end zone, eric pickett had an interception return for a touchdown, <mark>nick</mark> aigeldinger and ian ashford hooked up for a touchdown and roger legg and evan callaghan each scored two touchdowns in the victory. \"we've been talking about having good leadership, i don't think we had it last week,\" <mark>myers</mark> said. \"our leaders stepped up this week and we responded exactly how i hoped we would respond .\" two miscues by the tigers punt team resulted in 14 easy points for the comets in the first quarter. on the fourth play of the game, a long snap went over punter wes custer's head and <mark>powell</mark> landed on the loose ball in the end zone to make it 7-0 custer then mishandled a snap two drives later and swarm of crestwood players blocked the punt. tilar black caught the ball in the air before falling in a mass of comet players at the tunkhannock 3-yard line. legg plunged in two plays later from 2 yards out to make it 21-0 at the end of the first quarter. pickett then picked off a luke seaberg pass on the first play of the second quarter and returned it 85 yards for a score. callaghan came in at the end of the second quarter at running back and and scored the first of his two touchdowns from 7 yards away. hannah coffin scored the first point of her career on the point after attempt to make it 42-0 at halftime. she added another extra point on callaghan's final score of the night. the comets limited the tigers to minus-23 yards rushing in the first half, thanks largely to the botched snap on the first punt. tunkhannock though, did throw for 61 yards including a 39-yard pass to <mark>josh robinson</mark>. <mark>robinson</mark> was one of the bright spots for the tigers as he ran 12 times for 66 yards and added three catches for 46 yards. tunkhannock wasn't the same team that nearly upset hazleton area a week earlier. the cougars beat the tigers by a touchdown in the game's final few minutes. the tigers' performance impressed the comets and crestwood came ready and put tunkhannock away early on saturday night. \"they improved their first couple weeks and took hazleton right down to the wire,\" <mark>myers</mark> said. \"they're definitely an improved football team and we were worried about them all week, playing hazleton tough .\" we welcome user discussion on our site, under the following guidelines: to comment you must first create a profile and sign-in with a verified disqus account or social network id. sign up here. comments in violation of the rules will be denied, and repeat violators will be banned. please help police the community by flagging offensive comments for our moderators to review."}, {"articleID": "2016050609_00091886_W", "names": {"Phil Simmons": ["Q47434073", "Q6827914"]}, "date": "2016-05-06", "url": "http://antiguaobserver.com/lara-says-return-of-bravo-pollard-vital-for-tri-nations/#respond", "content": "Latest: Plant Protection Unit makes another attempt at money for snail eradication <a href = \"http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a929a526 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src =\" http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=12 & cb=INSERT_RANDOM_NUMBER_HERE & n=a929a526' border =' 0' alt = \"/> </ a> <a href =\" http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a6763b0a & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src = \"http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=29 & cb=INSERT_RANDOM_NUMBER_HERE & n=a6763b0a' border =' 0' alt =\" /> </ a> <a href = \"http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a5e87b37 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src =\" http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=17 & cb=INSERT_RANDOM_NUMBER_HERE & n=a5e87b37' border =' 0' alt = \"/> </ a> Lara says return of Bravo, Pollard vital for Tri-Nations May 6, 2016CMC The Big Scores No comments New Story Batting legend Brian Lara wants to see the return of the likes of Kieron Pollard and Dwayne Bravo, for next month's Tri-Nations Series involving Australia and South Africa. Both players have been overlooked by selectors for One-Day Internationals since the controversial abandoned limited overs tour of India two years ago, but Lara said having them involved in Twenty20 Internationals alone was a backward step .\" In terms of the Tri-Nations, I think it's going to be a pretty exciting Tri-Nations series, \"the former West Indies captain said .\" And hopefully we can have the likes of Pollard and Bravo--some guys who have not played that form of the game [recently]--back in the team because they are integral to any West Indies team. \"Just to have them for the T20 version, I think, is doing a disservice to West Indies cricket .\" The non-selection of Pollard and Bravo have resulted in controversy over the last year, and was at the heart of an outburst by West Indies coach <mark>Phil Simmons</mark>, who claimed there was \"outside influence\" on selectors, in keeping them out of the squad. Bravo is a veteran of 164 ODIs, and is just 32 runs short of 3,000 runs and one wicket shy of 200 scalps in the format. Pollard, meanwhile, has struck three centuries in 91 ODIs, and taken 44 wickets with his slow medium. Under West Indies Cricket Board regulations, neither player is eligible for the tournament after failing to participate in January's Regional Super50. The Tri-Nations Series, which runs from June 3-26 in Guyana, St Kitts and Nevis and Barbados, will act as a precursor to a four-Test series against the powerful Indians starting in July. And Lara, who plundered 11,953 runs from 131 Tests, believes West Indies will have to be at their best against an in-form India side, despite having the advantage of home conditions. \"You saw their (India) performances against Australia...and not just in India, but also playing away from home; there have been great performances,\" Lara noted. \"I do believe that playing in home conditions is a slight advantage. I'm hoping that <mark>Phil Simmons</mark> is doing his homework [and] getting his players ready to play good Test cricket .\" For us, West Indians, we're not too disappointed if we get defeated playing hard cricket. I think what is very disappointing is when the team falls apart and we look like we don't know anything about cricket at all. \"West Indies are coming off their capture of the Twenty20 World Cup in India last month, where they beat England in the final to win the tournament for the second time in five years."}, {"articleID": "2020011804_00138025_W", "names": {"Stephen Paddock": ["Q41529365", "Q41711871"]}, "date": "2020-01-18", "url": "http://newstimes.com/entertainment/article/Eminem-s-Music-to-Be-Murdered-By-Album-14985439.php", "content": "https: //variety.com/2020/music/reviews/eminem-music-to-be-murdered-by-album-review-1203471710/ Eminem's \"Music to Be Murdered By': Album Review Take away the Las Vegas massacre shock-bait number and Eminem's latest is a passable, forgettable meandering through popular hip-hop sounds. Jemayel Khawaja, provided by Published 10:32 pm EST, Friday, January 17, 2020 Photo: Courtesy Interscope Photo: Courtesy Interscope Image 1 of / 1 Caption Close Image 1 of 1 Photo: Courtesy Interscope Eminem's\" Music to Be Murdered By': Album Review 1 / 1 Back to Gallery Click here to read the full article. Eminem's surprise album release may bear the Hitchcock-referencing title \"Music to Be Murdered By,\" but, yes, as you'd expect, \"Music to Murder To\" might be a more apt description. The 20-track LP, his tenth since soundtracking the turn of the millennium with 1999's \"The Slim Shady LP,\" finds the Detroit rap legend in an alternately rancorous and pensive mood while showcasing his still obliterative rhyming skills, penchant for controversy and even a provocative turn of questionably executed advocacy for gun safety. Featuring everyone from Q-Tip to Ed Sheeran, Anderson. Paak and the gone-too-soon emo-rap icon Juice Wrld, the album poses the question: When you've been raging against the world for a half-century, is there anything left unscathed? Eminem takes listeners on a tour of gripes familiar and occasionally new, ranging in theme from domestic abuse to copious opiate use, various rap feuds, staying culturally relevant, euthanized childhood pets and a preoccupation with mass shootings. More from Variety Eminem Reenacts Las Vegas Massacre in Anti-Gun Video, Jokes About Manchester Bombing in Separate Track Eminem Pays Homage to Alfred Hitchcock With \"Murdered' Album Cover and Title Eminem's Violent 2009 Lyric About Rihanna Leaks Related Stories Eminem Reenacts Las Vegas Massacre in Anti-Gun Video, Jokes About Manchester Bombing in Separate Track Eminem Pays Homage to Alfred Hitchcock With\" Murdered' Album Cover and Title Eminem's Violent 2009 Lyric About Rihanna Leaks Although Eminem's impish affectation has been replaced over time with a far more grouchy demeanor, don't let the Hitchcock references, dad beard or Simon and Garfunkel samples fool you with illusions of maturity or subtlety. He wants you to know that he very much still does not give a f--, as promised way back in \"99. Some of Eminem's references in his diss-topian rhymes--JonBenet Ramsey and Ayatollah Khomeini, for example--may have been best left in the last century, but it's his commentary on a far more persistent phenomenon that has the Internet ablaze. Most of the early attention on the record has been on the controversial video for the single\" Darkness, \"a\" Stan \"- esque dirge that places Em in the shoes of the 2017 Las Vegas massacre shooter. The track intertwines Eminem's own struggles with alcohol, pharmaceuticals, anxiety and depression with the final moments of <mark>Stephen Paddock</mark>'s life, a macabre blur of semiautomatic weapons, booze and a blood-soaked hotel room spliced with moody shots of Eminem pacing around a blue-tinged minimalist set. As the protagonist un-hoods, revealing not Eminem but a <mark>Paddock</mark> lookalike, he rains machine gun fire down on the Strip below before shooting himself in the mouth. It's a bleak and startling affair, arresting in its sheer lack of subtlety and grim shock factor all familiar Eminem tropes, just without any semblance of his usual humor. The video fades with clips of media coverage of mass shootings forming the shape of the contiguous United States and a public service announcement:\" Make Your Voice Heard and Help Change Gun Laws in America. \"Many have lauded the rap veteran for the video's political message. It's a sign of the alternate reality we have warped into that Eminem--the lovable scamp who made his career motor-mouthing fantasies of murdering his ex-wife, shooting up clubs and assaulting strippers--is now pitching gun safety legislation and get-out-the-vote drives .\" Darkness \"is wedged between tracks that gleefully quip about the Manchester Arena and Columbine shootings, so the continuity of messaging barely lasts a couple minutes. Even in this post-truth age, the lack of accountability is galling. But this is where we find ourselves .\" This is America, \"it ain't, but we'll take our advocates where we can get\" em. Eminem has always used imagery of violence and guns, even if under the guise of extremist satire, to sell millions of records that have perpetuated a culture in which gun violence is normalized. Depending on your perspective, that makes his turn on \"Darkness\" either all the more valiant or deeply hypocritical and exploitative. If it makes even one individual vote or one middle American angry boy consider mental health and gun safety in a different way, do we join the chorus of consternated applause? The album has its less topical highlights. \"Godzilla\" and \"Yah Yah\" are memorable uptempo bangers with notable featured performances from Juice Wrld and the Roots' Black Thought, respectively, that show Eminem's often-astounding flow still carries water over various niches of hip-hop. Longtime collaborator Royce Da 5' 9 \"brings a fresh energy to all three tracks on which he appears. And after doffing his baseball cap to Tyler, the Creator on\" No Regrets \"while highlighting lesbian rapper Young MA on\" Unaccommodating, \"it seems that Eminem's rampant homophobia may be in remission. Elton will be pleased. Then again, on the regrettable\" Those Kinda Nights \"collab with Ed Sheeran (can we call EdandEm a thing?), Eminem eagerly opines on the joys of sexual harassment, so there's clearly still plenty of room for improvement on the wokeness scorecard. All the hullabaloo around\" Darkness \"will likely obscure too much rumination on the rest of\" Music to Be Murdered By. \"Perhaps that's a good thing for Eminem. While his talent for head-spinning flow and cutting barbs is still very much in effect, the album is a passable but ultimately forgettable meandering through popular hip-hop sounds of today. It's usually a bad sign when an artist opens an album with a track berating you about how relevant he is. But if Eminem has found a way to turn his perennial talent for shock-baiting into an even infinitesimally safer America, it might be possible to chalk it up as a win anyway. Sign up for Variety's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. Most Popular 1 CT could see 4 to 8 inches of snow Saturday 2 Man attacked with baseball bat in downtown Danbury 3 Police: Sherman woman charged after domestic incident 4 Ex-Newtown man charged in child porn investigation 5 After missing nearly 1 month, CT teen found safe 6 New Haven teen fatally shot by state police after apparent...7 Danbury police investigate second shooting in less than a week View Comments © 2020 Hearst Communications, Inc. ."}, {"articleID": "2019110218_00193150_W", "names": {"Denis Shapovalov": ["Q20979382", "Q4520285"]}, "date": "2019-11-03", "url": "https://www.channelnewsasia.com/news/sport/tennis-impressive-djokovic-beats-dimitrov-as-nadal-pulls-out-in-12058078?cid=cna_flip_070214", "content": "Tennis: Impressive Djokovic beats Dimitrov as Nadal pulls out in Paris Toggle share menu Tennis: Impressive Djokovic beats Dimitrov as Nadal pulls out in Paris close breaking news Sport Tennis: Impressive Djokovic beats Dimitrov as Nadal pulls out in Paris Tennis - ATP 1000 - Paris Masters - AccorHotels Arena, Paris, France - November 2, 2019 Serbia's Novak Djokovic celebrates after winning his semi final match against Bulgaria's Grigor Dimitrov REUTERS/Christian Hartmann 10 related media assets (image or videos) available. Click to see the gallery. 02 Nov 2019 11:26 PM Bookmark PARIS: Novak Djokovic reached the Paris Masters final for the sixth time when he downed Bulgarian Grigor Dimitrov 7-6 (5) 6-4 on Saturday (Nov 2) but Rafael Nadal pulled out injured. Serbia's world number one, who will be supplanted by Nadal at the top of the ATP rankings on Monday, won a high-octane first-set tiebreak before wearing down Dimitrov in the second set. Advertisement Advertisement Djokovic will face Canada's <mark>Denis Shapovalov</mark> in Sunday's final at Bercy after 19-time Grand Slam champion Nadal, who would have secured the year-end number one spot with the title here, withdrew minutes before his semi-final match with an abdominal injury. The Spaniard did not want to take any risks ahead of the Nov. 10-17 ATP Finals, where his participation now hangs in the balance. \"In one of the last serves of the warm-up, I felt something in the abdominal. And immediately I came back to the doctor here to do the echography and to check with the doctor, and the doctor told me that we need to wait a little bit more,\" Nadal told a news conference. \"So I waited for one hour and a half more to do a second test. And we did it, we saw something on the image, probably a small strain .\" Advertisement Advertisement He explained he was hoping to be ready for the season-ending event at the O2 Arena in London and would \"do all I can do and all that's mathematically possible to recover for it\". \"But as you can expect, today I can't answer this question,\" he said when asked if he would recover in time. Top seed Djokovic, who has lifted the trophy here four times and will feature in his 50th Masters final, played better than Dimitrov in the key moments and served well throughout. There were no break points in the first set. In the tiebreak, Dimitrov moved 5-3 up after an untimely Djokovic double fault, only for the Serbian to regain his composure, levelling for 5-5 with an exquisite defensive lob and winning the set at the end of a lung-busting, 35-shot rally. Dimitrov let his guard down in the fifth game of the second set, allowing Djokovic to snatch the only break of the match. The 16-time Grand Slam winner held serve throughout to strengthen his hopes of ending the season as world number one. Djokovic said winning the opening set was the key to a tense match. \"We both really understood the importance of clinching the first set so we could feel a bit more relaxed in the second and start swinging through,\" he told a news conference. \"The beginning of the second I was focused. I did well and managed to break his serve and hold my serve really well towards the end .\" Source: Reuters"}, {"articleID": "2015093018_00081880_W", "names": {"Matt Walsh": ["Q2278533", "Q611871"]}, "date": "2015-09-30", "url": "http://www.theblaze.com/contributions/this-gender-confused-boy-is-being-poisoned-and-abused-and-were-all-applauding/", "content": "This Gender-Confused Boy Is Being Poisoned And Abused, And We're All Applauding Sep. 30, 2015 2:19 pm <mark>Matt Walsh</mark> is a blogger, writer, speaker, and professional truth sayer. 0 Tweet This Email this story to a friend Yesterday I came across one of the most disturbing and heartbreaking videos I've ever seen in my life, and I say this as someone who watched all 10 undercover Planned Parenthood clips. It shows a mother surprising her healthy 14-year-old son with a gift: a package of estrogen patches. Her boy, Corey, decided with his mother's encouragement to start \"living as a girl\" when he was 11. Some five years before he's considered legally competent to drive or apply for a job, seven years before we trust him to vote or get a tattoo or purchase spray paint, a full decade before society judges him mature enough to consume a can of Miller Lite or gamble on a game of cards, and 15 entire years before health insurance companies will declare him an independent adult, the child decided to reject his biological identity and assume a false one for the rest of his life. When I was 11, I still hadn't given up hope of one day becoming an Avenger. When this boy was 11, his parents let him give up hope of ever becoming a man. It is nothing short of a travesty and an injustice. Want more from <mark>Matt Walsh</mark>? Follow <mark>Matt</mark> on Twitter Apparently, the young boy had already been given a \"puberty suppressing implant,\" and was eager to start a rigorous estrogen routine, which would stunt his physical maturation, infuse harmful chemicals into his growing body, interfere with his development, and create the synthetic facade of femininity. Estrogen is particularly important for (real) women because it thickens the lining of the uterus, enabling the implantation of fertilized eggs. Interestingly, no \"trans woman\" has ever, will ever, or can ever have eggs to fertilize or a uterus to implant them in. Men do have some estrogen naturally, but high levels of the hormone put them at a considerable risk for heart disease, cancer, obesity, diabetes, and other serious side effects. I guess that's a fatal chance Corey's mother and doctors are willing to take. This kind of hormone therapy is common for women who are menopausal or who struggle with fertility, but it's incredibly dangerous for a perfectly healthy teenage boy. Nobody knows what sort of physiological devastation this will wreak, but we do know something about the psychological toll; sadly, a vast number of \"transgender\" people fall into a deep despair and attempt suicide after \"transitioning .\" This boy has a tough, terrible road ahead of him. All we can do is pray for him. Corey Maison's mother surprised her transgender daughter with her first box of hormone treatments. (Image source: YouTube) But dangerous or not, the boy's quack doctors had no problem prescribing him medication usually taken by grown women. It was determined by all involved--mother, child, reckless medical professionals who should be fired and imprisoned--that Corey ought to be deprived of the opportunity to grow into a healthy man all because he likes to wear pink and play with dolls. His mother marked the happy occasion by giving him the women's hormones on camera for all the world to see. The boy still won't be able to buy DayQuil for another two years, but at least now he's legally ingesting medication meant to treat hot flashes in 55-year-old grandmas. Naturally, liberal outlets fawned over the footage. MTV called it \"life changing\" and declared the boy's mother \"mom of the year .\" The Daily Mail described it as \"moving\" and \"emotional .\" BuzzFeed wrote about it glowingly, noting that the family has received \"nothing but positive reactions .\" Huffington Post called it \"beautiful\" and \"wonderful .\" Cosmopolitan gushed that this \"was the emotional moment a mom changed her trans daughter's life .\" Other outlets squealed that it was \"special\" and \"the best gift ever .\" The comments threads under these articles have, as BuzzFeed accurately reported, been almost entirely celebratory. Something tells me these people wouldn't be celebrating if a mother filmed herself giving her effeminate son testosterone to be more manly. Magically, as soon as the video went viral, a crowdfunding page (I won't link to it) was set up to help the boy with \"medical expenses\" and college tuition. They don't specify what the expenses are exactly, or why his college tuition ought to be handled by charity, but one wonders if the money from the donors will eventually help pay for the day when this poor boy's genitals are removed. I would say it's unprecedented for the mutilation of a child to be funded by cheering strangers, but then I remember Planned Parenthood. Just think about it: the boy is being poisoned on camera, and virtually no one has offered even a word of protest. It makes me think back to a few weeks ago when a mother was filmed giving wine to a toddler. She was deservedly condemned and castigated by everyone, but that was nothing compared to this. Giving wine to a toddler is bad. Injecting high doses of estrogen into a 14-year-old boy is psychotic. I don't mean the boy is acting psychotically, I mean the adults in his life and in the medical community are. Corey is simply acting like an adolescent who's grown up in an environment utterly devoid of guidance and clarity. He is a victim, and not a single person has stood and spoken out for him. It's not his fault he's been abused by his parents and his doctors. It's not his fault nobody ever stepped up to teach him to love himself and seek and accept God's plan for his life. It's not his fault he'll be used as a stage prop by predators in the LGBT movement. It's not his fault his mother not only decided to poison him, but broadcast his personal torment all over the internet. It's not his fault our culture has legitimized the mental illness of gender confused people. Indeed, it's that last point I think we need to reflect upon. Corey's mom tells us he was \"always feminine .\" She says she \"just assumed [he] might be gay .\" Already we see how gender stereotypes are rigidly enforced by the very people pretending to break them down. Even if the boy was \"feminine,\" why must that automatically mean he's gay or a girl? I thought girls don't have to be feminine and boys don't have to be masculine? I mean, isn't that the whole point liberals have been making about gender for the past 40 years? Who's putting men and women into boxes here? Who's denying that men can be effeminate? It's certainly not me. I completely accept the notion that some boys are less boyish than others. I would never allow my son to dress up like a princess or run around wearing makeup and tutus, but I'm not so backwards as to think the makeup and tutu are medical symptoms. That's the anti-science LGBT perspective, not mine. I believe there's a wide range of ways in which a boy might express his masculinity. It is the gay agenda--not any \"conservative\" or Christian initiative--that really restricts children (and exploits them). Marchers walk down Fifth Avenue during the 2014 Gay Pride March on June 29, 2014 in New York City. (Photo by Eric Thayer/Getty Images) Corey's mother says he \"loved to wear high heels and dresses\" from a young age. Of course he did. When they're young enough, any child loves to wear anything. A 2-year-old sees a dress as just another fun, silly costume. Their affinity for the fabric means absolutely nothing, unless the parent gives it meaning. Moreover, a boy does not develop a consistent habit of wearing girl clothes on his own, anymore than a fifth grader could develop a drinking habit on his own. I realize you can't control everything your kid does, but if your 9-year-old son is regularly donning skirts and blouses, it's because you're letting him. You're tolerating it. You're encouraging it. If you decide to tolerate and encourage whatever weird, disordered behavior your child wants to indulge in, there's no telling what you'll end up with. If my parents weren't there to offer me even the basic, fundamental direction and instruction parents are meant to impart, I might still be crawling around on all fours and barking like a dog or darting around the house in my Batman cape. The point is, parents are supposed to guide children in the process of becoming themselves, not in becoming somebody else. But what struck me about Corey's tale is that, according to his mother, he decided he was \"transgender\" only after watching another YouTube video about a \"transgender\" boy who pretends to be a girl named Jazz. Corey, 11 years old at this point, didn't \"recognize his inner female identity\" until he saw a \"transgender\" propaganda video of the sort he would eventually star in himself. This was just a confused boy whose parents let him wear dresses--until he saw a video. Then he mystically became a girl. As Elite Daily records, \"...it wasn't until the fifth grade, when Maison watched a video by transgender YouTube star Jazz Jennings, that he realized he didn't just like girly things--he was a girl .\" WHAT? This is nonsense to its core, yet the whole country just goes along with this sort of thing. He saw a video and realized he was a girl? How so? How do you distinguish between a boy who \"likes girly things\" and a boy who \"is a girl,\" aside from the the obvious distinction that one is a physically impossible oxymoron? Is there some kind of medical test that detects when \"liking girly things\" crosses over into \"being a girl\" ? And, again, what is a \"girly thing\" ? I thought we're supposed to believe there's no such thing as a girly thing? Isn't that why Target went gender neutral? Does any of this make sense? I swear, everyday I feel like I'm sitting in a basement with the entire country and I'm the only one who isn't high on LSD. In any case, the important takeaway is that the perversions heralded by progressivism--\"transgenderism,\" homosexuality, etc.--can, in effect, spread. A person can indeed \"become\" gay or \"transgender,\" due to the heavy, almost suffocating influence society has on his sexual formation. A child, especially when he lacks proper parental guidance, is profoundly susceptible to the messages promoted through TV, movies, and music. He goes to the media and pop culture with his feelings and confusions, and these defacto counselors and parental figures interpret his feelings for him. \"Oh, you're wearing pink shorts? Well, maybe you're a girl!\" If that's a convincing argument to grown adults in this country, imagine how it sounds to a child. Corey was likely just a normal--if slightly more effeminate--boy. Had his parents steered him away from cross dressing, and had he existed in a culture that doesn't try so hard to normalize deviant behaviors, he'd be a well adjusted young man by now. One day he'd probably go on to become a husband and a father, and he'd live his life with his natural body and organic identity. He'd be fine. He'd be happy. He'd be true. Our culture took that from him. And as parents, that should terrify us. Even if we dedicate ourselves to \"training a child up in the way they should go\" (Proverbs 22:6), they are still living in a deeply depraved and wicked culture. Just this morning I read about the casting contract for a new HBO show debuting next year. It's going to be, maybe even more than \"Game of Thrones,\" hardcore porn airing at 8 or 9 on a Sunday night while your kids are still awake. The contract stipulates that performers on the program \"may be required to perform genital-to-genital touching, simulate oral sex with hand-to-genital touching, contort to form a table-like shape while being fully nude, pose on all fours while others who are fully nude ride on your back, [and] ride on someone's back while you are both fully nude .\" No doubt this will be another critically renowned smut-fest that quickly ingrains itself into the Zeitgeist. Another report tells us the next Oscars ceremony will likely be dominated by propaganda movies about \"transgenders\" and gays. And even if you steer your child away from premium cable and homosexual films, there's still some five or six shows on TV celebrating and normalizing gender confusion. And don't worry, if he flips past that, your kid might find a cartoon show where Jesus Christ has sex with a married woman, or commercials where half naked women sell hamburgers. Beyond movies and TV, the internet is obviously teaming with pornography and progressive sexual indoctrination, now branching into regularizing pedophilia. Of course, your child's public school won't be a shelter from such things, as more districts are taking it upon themselves to teach kindergartners how to have sex and masturbate. When you think about it all at once, you might see why I find politics so irrelevant. Go ahead and put a Republican in the White House. What good will that do when our society is fundamentally rooted in debauchery, and our children are raised from a young age to reject their true selves and rejoice at porn, sodomy, and violence against the unborn? Do you think lower taxes and border walls will save us from that? I only wish more Christians and \"conservatives\" would speak out loudly about our culture's descent into corruption and madness. This is where the real battle must be fought. While we're all talking about the presidential election, progressives have spent the last couple of days throwing parades for a mother who poisoned her son with medically unnecessary medication. Why? Because they know they win everything if they can convince society to accept their teachings about sex, gender, and the nature of human life. Nothing matters once that process is complete. Until the rest of us wake up to this reality and jump into the fight to save our culture from mass suicide, there's not much progress that can be made collectively. However, on an individual basis, we can keep our children close, pray with them every night, show them God, show them beauty, show them goodness, and equip them to venture out into the world and fight to the death for Truth. That's really the only hope we have. As for young Corey, I pray one day, with the Lord's help, he finds his way to the light. Hopefully that happens before it's too late .--TheBlaze contributor channel supports an open discourse on a range of views. The opinions expressed in this channel are solely those of each individual author."}, {"articleID": "2015012919_00037770_W", "names": {"Jeff Miller": ["Q30981158", "Q43459095", "Q6174508", "Q6174513", "Q6822669", "Q746834", "Q970478"], "Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"], "Amanda Palmer": ["Q240377", "Q4591749"]}, "date": "2015-01-29", "url": "http://salon.com/2015/01/29/apnewsbreak_nfl_says_concussions_down_25_percent_this_year", "content": "News PHOENIX (AP) - The rate of concussions among NFL players fell 25 percent this season, according to the league, even as injury reporting and trips to injured reserve list rose overall. Data provided to The Associated Press by the NFL ahead of its annual pre-Super Bowl health and safety news conference Thursday shows there were 111 concussions in games during the 2014 regular season, down from 148 in 2013, and 173 in 2012, a 36 percent drop over that three-year span. When preseason games, plus preseason and regular-season practices, are included, the 202 concussions this season declined 12 percent from 2013, and 23 percent from 2012. That's despite no new rules meant to protect players' heads. \"Players are changing the way they're tackling,\" NFL Senior Vice President of Health and Safety Policy <mark>Jeff Miller</mark> said. \"They're changing the way they play the game .\" In all, the concussion rate is down to 0.43 per game, <mark>Miller</mark> said, adding: \"You have to play more than two games to get a concussion in the NFL, by those numbers .\" A total of 59 concussions were caused by helmet-to-helmet or shoulder-to-helmet hits this season, the league's data says, almost exactly half as many as two years ago. \"With all the technological innovations that we've had over the past few years, I'm surprised the numbers keep going down,\" St. Louis Rams team doctor Matthew Matava said. \"Because you'd think, with more vigilance, you'd see more of any sort of condition .\" According to STATS, there were 265 players placed on injured reserve during the regular season in 2014, a 17 percent jump from the 226 the year before. This season, for the first time, NFL injury data was collected by all 32 teams through electronic medical records, allowing for more comprehensive accounting. That system does a better job of capturing all injuries - from a bruise, say, to a broken leg - according to Christina Mack, an epidemiologist at Quintiles, a clinical research organization that works with the league. One change is that less-severe injuries, such as a first-degree sprain, are captured more frequently now, she said. Something worse, such as a concussion or torn knee ligament, is just as likely to have been reported under the old setup. A 15 percent hike in injury reporting from 2013 to 2014 - an increase of about 0.9 per game, on average - is at least in part due to the new system, according to Mack. \"We knew it was going to be up this year, because we transitioned to the electronic medical records,\" Mack said in a telephone interview, echoing <mark>Miller</mark>'s explanation. \"We can't conclude the incidence of injuries is up. We know the reporting of injuries is up .\" In December 2013, New England Patriots coach Bill Belichick - whose team plays the Seattle Seahawks on Sunday - said it was \"a matter of record, not opinion\" that injuries league-wide had been on the rise recently. Belichick blamed a decrease in the number of offseason, preseason and in-season practice sessions and workouts allowed as a main contributor to higher injury totals. That reduction in practice time was among changes made in an effort to cut down on head injuries after the NFL's concussion policies were criticized by Congress, and thousands of ex-players sued the league. Other safety measures include rules protecting defenseless receivers and barring hitting with the crown of the helmet; revised return-to-play protocols; independent neurologists on sidelines during games; \"eye in the sky\" monitoring by athletic trainers to make sure in-game injuries aren't overlooked. ___ Follow Howard Fendrich on Twitter at http: //twitter.com/HowardFendrich \"Broad City\" and the City: 10 ways you know you live in Abbi and Ilana's New York Thanks for nothing, Netflix: Depressing new research links TV binging to depression Lil B launches the vegan emoji app you never knew you needed <mark>Stewart</mark> on \"manspreading\" : \"Don't be an a ** hole on the subway\" <mark>Jon Stewart</mark> slams the Koch brothers for putting a price tag on the 2016 election Bieber's teary apology: \"I'm not that person who says' I don't give a f--!' I'm not that kid\" Not the next \"Gone Girl\" : Why \"The Girl on the Train\" can't fill Amazing Amy's shoes \"You're only as healthy as your darkest secret\" : Director Thomas Schlamme on what drives \"The Americans\" and his new show \"Manhattan\" \"Amira & Sam\" : Meet the rom-com antidote to \"American Sniper\" David Letterman reportedly sent Jay Leno an invitation to appear on \"Late Show\" \"Just about everybody else in this book is white\" : Daniel Handler and the race questions the New York Times won't ask Louis C.K.'s new stand-up special: From kids to death, the comedian covers familiar, very funny ground \"Ghostbusters\" reboot: Let's weigh the pros and cons of the new cast <mark>Amanda Palmer</mark> responds to Twitter outrage over Jonathan Chait essay with a poem, of course \"It was ill-advised, unfunny and not brand-appropriate\" : The \"Fifty Shades\" - inspired ad campaign too hot for Domino's \"Oh for f ***'s sake Jenny McCarthy\" : Larry Wilmore slams anti-vaxxers Watch the first-ever anti-domestic violence Super Bowl ad, brought to you by the NFL <mark>Jon Stewart</mark> destroys CNN over absurd blizzard coverage Rainn Wilson mocks hipster foodies: \"It makes me sick\" Why \"American Sniper\" Chris Kyle's defenders are so misguided Elite Daily/Twitter 2014's fast food atrocities McDonald's Black Burger: Because the laws of competition say that once Burger King introduces a black cheeseburger, it's only a matter of time before McDonald's follows suit. You still don't have to eat it. Domino's 2014's fast food atrocities Arby's / Facebook 2014's fast food atrocities KFC'S ZINGER DOUBLE DOWN KING: A sandwich made by adding a burger patty to the infamous chicken-instead-of-buns creation can only be described using all caps. NO BUN ALL MEAT. Only available in South Korea. Taco Bell 2014's fast food atrocities Krispy Kreme Triple Cheeseburger: Only attendees at the San Diego County Fair were given the opportunity to taste the official version of this donut-hamburger-heart attack combo. The rest of America has reasonable odds of not dropping dead tomorrow. Taco Bell 2014's fast food atrocities Boston Pizza's Pizza Cake: The people's choice winner of a Canadian pizza chain's contest whose real aim, we'd imagine, is to prove that there's no such thing as \"too far .\" Currently in development. 7-Eleven 2014's fast food atrocities Photos from the Happy Ending Salon Make Summer More Poetic with These 10 International Works 8 Illustrated Books for Every Age and Every Summer Reading List 10 Great Science Reads That You Can Take to the Beach Turn Summer into a Literary Field Day with these 9 Collections of Non-Fiction Sports Writing Travel to Foreign Lands in 10 Newly Translated Novels Get Lost in 8 Great Biographies - from Lawrence of Arabia to Margaret Fuller Explore Diverse Cultures Through Varied Genres with These 8 New Works 8 Great Essay Collections for Your Reading Pleasure Looking for Fresh Fiction for your Summer Reading? The best and worst series finale music of all time Stories from a Warming Planet: Wildfires Seven celebrity \"authors\" who didn't do it alone They're no \"Divergent\" : Eight young-adult movie franchises that died untimely deaths The Super Bowl Scammer: Dion Rich Is the Godfather of Gatecrashing Ringo Starr Slates \"Postcards From Paradise' Weeks Before Hall of Fame Watch Marty Stuart Sing, Shred and\" Streamline' on \"Letterman' Universal Orlando went by the book when creating live shows for the Wizarding World of Harry Potter - Diagon Alley\" The Nightly Show' Takes On The Koch Brothers' Dark Money...Or, Rather, \"Old, White Money' Kim Kardashian Masters The Art Of The Public Bathroom Selfie You Might Think You Know What This Mormon Woman Is Going To Say About Gay People, But Just Watch Boobs, Boobies, The Girls, Tatas. Whatever You Name 'Em, They're Kinda Incredible. They Liked Her Because She\" Talked White .' I Bet They Didn't Expect This. 90 Seconds Of Wiggling, Jiggling, Sweating, And Shaking Is All It Took To Get Me Off The Couch Copyright © 2015 Salon Media Group, Inc.. Reproduction of material from any Salon pages without written permission is strictly prohibited. SALON ® is registered in the U.S. Patent and Trademark Office as a trademark of Salon Media Group Inc. ."}, {"articleID": "2016070906_00319891_W", "names": {"Al Davis": ["Q1389376", "Q16151684"], "Eddie Robinson": ["Q1151037", "Q1419778", "Q3047306", "Q5336448"], "Doug Williams": ["Q1364004", "Q20687595", "Q28933869", "Q5301013", "Q5301014", "Q5301015", "Q5301016", "Q951164"]}, "date": "2016-07-09", "url": "http://www.silverandblackpride.com/2016/7/8/12134324/thank-you-jsnoop61#comments", "content": "Thank You JSNOOP61  TweetShare on Twitter  ShareShare on Facebook  PinPinterest + Comments Raider Nation, As I write this I am watching a replay of \"A Football Life: <mark>Al Davis</mark>\" on the NFL Network. Some time ago I wrote a post when it originally aired, \"Why Are We Raiders?\" It prompted me to revisit that post and among the comments I found a response from JSNOOP61 that far outshines my original post. It deserves to stand alone. Raider Nation Forever. Ok, I have been a Raiders fan since the late 60s when I was still in my single digits...I went to a black college, Tennessee State Univ in 1978...Interestingly, head coaches and coaching staffs at black colleges loved two teams: the Raiders and Chiefs, because <mark>Al Davis</mark> and Lamar Hunt were color blind. When the NFL had an unwritten policy that a team couldn't have more than 5 or 6 black players on a team, the AFL was different and the Raiders & Chiefs were more different. They had scouts travel the Southeast and East Coast, where most black colleges were located, looking for talent. And that's one of the reasons <mark>Al Davis</mark> got his reputation as a maverick. Even AFL owners tried to come up with an unwritten policy of a limited number of black players, but <mark>Al</mark> bucked the system, along with Lamar Hunt. Not many people can tell you the colleges Gene Upshaw (Texas A & I) and Art Shell (Maryland State) attended. These were obscure colleges back in the day, and their glory days were back in the 60s, but still, they were fairly unknown colleges that were on the Raiders radar & only the Raiders. Before the Bear Bryants & Joe Paternos got smart and got their heads out of their asses, it was guys like <mark>Eddie Robinson</mark> & John Merritt who were supplying black ballplayers to the AFL & NFL. And in many ways, <mark>Al Davis</mark> was the leading opportunist who opens the flood gates for black players. If Walter Payton & Jerry Rice were coming up today, no way they would attend or play for a Jackson State or Mississippi Valley State. No way <mark>Doug Williams</mark> attend a Grambling State. <mark>Al Davis</mark> brought a lot of focus to the black athlete on both the professional & college level. The man was great. His last 10 years or so he wanted to go to the Super Bowl again before he died. I hate the fact those are the years he will be remembered for vs. everything he done for the AFL & NFL. He & Lamar Hunt deserves way more credit than Pete Rozelle & definitely way more than a Roger Goodell. Those guys will forever receive credit, but the true innovators were guys like <mark>Al</mark>, Hunt, Sid Gillman, etc.. Why Am I A Raider? Because of the great innovator, the man who believed in giving others opportunities that other owners wouldn't--<mark>Al Davis</mark>. And I hate the fact that <mark>Al</mark> would never receive credit for giving Art Shell & Tom Flores an opportunities to be head coaches when no other owner would. And everyone plays it down, because it was only <mark>Al Davis</mark>, a maverick. Give the man credit! Up until the last decade or so, the Raiders were truly the team of the Decades, and the team of opportunity."}, {"articleID": "2010032813_00065389_W", "names": {"Barbara Bush": ["Q153730", "Q190628", "Q2884044"], "Jean Becker": ["Q13103237", "Q13103238", "Q1387804", "Q1685404"]}, "date": "2010-03-28", "url": "http://CITIZEN-TIMES.com/article/2010100328001", "content": "your browser's security settings are preventing some features from appearing. houston - former first lady <mark>barbara bush</mark> was hospitalized saturday in houston to undergo routine tests but doctors don't suspect anything serious, a family spokeswoman said. bush, 84, was being treated at methodist hospital and should be released in a day or two, spokeswoman <mark>jean becker</mark> said late saturday. \"she hasn't been feeling well for about a week, and the doctors thought she should come in and undergo a battery of tests,\" <mark>becker</mark> said. \"it's not serious. she just hasn't been feeling herself and they're just trying to figure out why .\" <mark>becker</mark> declined to provide details, but said former president george h.w. bush drove his wife to the hospital saturday morning after consulting with her doctors. a hospital spokeswoman declined comment, saying information was only being released through the family. you must fill out the comment body in order to submit a comment. rss feeds for the latest western north carolina news, sports, business and more. subscribe copyright © 2010 use of this site signifies your agreement to the"}, {"articleID": "2014070414_00028064_W", "names": {"Richard Neal": ["Q1464697", "Q7328011"]}, "date": "2014-07-04", "url": "http://newsobserver.com/2014/07/03/3983753/mint-hill-man-rides-out-hurricane.html?sp=/99/100/&ihp=1", "content": "Mint Hill man rides out Hurricane Arthur...in middle of ocean Related Links: Link Watch video of Hurricane Arthur from in-ocean B & B Frying Pan Station Link The storm: News, photos, video, stats, forecast and more Link Get the latest storm data and follow its path with ABC11's storm tracker Related Stories: Hurricane Arthur makes landfall on NC coast A Mint Hill man didn't have to chase Hurricane Arthur to experience the storm's fury. He just waited for the storm - in the middle of the Atlantic Ocean. <mark>Richard Neal</mark> is owner of Frying Pan Tower, an old U.S. Coast Guard tower anchored about 35 miles east of Wrightsville Beach, and on Thursday he provided play-by-play on his Facebook page as the hurricane roared almost directly over his station. \"This is quite a storm,\" <mark>Neal</mark> said at one point Thursday evening, after a weather station at his tower registered a wind gust of 99 mph. \"We just entered the eye of Arthur!\" he wrote in a Facebook post shortly before 6 p.m. <mark>Neal</mark> paid $85,000 for the rusting station in an auction in 2010, converting it into a bed-and-breakfast for people who love the ocean and those looking for an up-close fishing expedition. The station, which is 140 feet off the ocean surface, was abandoned by the Coast Guard in the late 1970s. <mark>Neal</mark>, a software sales engineer, decided to ride it out Thursday on his tower. As the center of Hurricane Arthur approached during the afternoon, <mark>Neal</mark> continued to provide updates on Facebook. He reported 24-foot waves about 4 p.m. and then the 99-mph gust nearly two hours later. About the same time, he said a government buoy apparently broke loose from its anchor and drifted by. \"NOAA Buoy No. 16 just slid past us, heading toward the Wrightsville beaches,\" he reported on Facebook. A short time later, he posted video of the buoy being carried away by huge waves. His reports quickly caught the fancy of weather followers and national media. ABC News showed the video on its evening news, and <mark>Neal</mark>'s video was the rage on weather Internet bulletin boards. \"This is like a getaway to me,\" Wood said in a 2012 Charlotte Observer story. \"I got up at 7:30 and worked until the sun went down. It's fun being out in the middle of the ocean, nothing but blue water all around, and doing restoration .\" Lyttle: 704-358-6107; Twitter: @ slyttle"}]