[{"date": "2018-09-03", "url": "http://kstp.com/politics/group-us-russia-block-consensus-at-killer-robots-meeting-/5056597/?cat=12510", "content": "Group: US, Russia Block Consensus at \"Killer Robots' Meeting Photo: AP Photo/Jamey Keaten, file In this Monday, Aug. 27, 2018 file photo, Peter Asaro, left, of the International Committee for Robot Arms Control, and <mark>Jody Williams</mark> of the Nobel Women's Initiative speak to reporters at a news conference in Geneva, Switzerland. September 03, 2018 09:22 PM A key opponent of high-tech, automated weapons known as\" killer robots \"is blaming countries like the U.S. and Russia for blocking consensus at a U.N.-backed conference, where most countries wanted to ensure that humans stay at the controls of lethal machines. Advertisement Coordinator Mary Wareham of the Campaign to Stop Killer Robots spoke Monday after experts from dozens of countries agreed before dawn Saturday at the U.N. in Geneva on 10\" possible guiding principles \"about such\" Lethal Automated Weapons Systems. \"Point 2 said:\" Human responsibility for decisions on the use of weapons systems must be retained since accountability cannot be transferred to machines. \"Related Stories Tesla CEO Elon Musk Tells Newspaper He is Cracking Under Stress Wareham said such language wasn't binding, adding that\" it's time to start laying down some rules now. \"U.N. Secretary-General Antonio Guterres welcomed the principles and expressed hopes the countries who signed on\" can build upon this achievement, \"according to a statement from his spokesman. Wareham said delegates had just\" kicked the can down the road \"until the next meeting on LAWS in November. The\" usual suspects \"including the United States, Russia, Israel and South Korea--joined unexpectedly by Australia, she said--were behind an effort to keep the text from being more binding .\" The fact is that it's the majority that wants it, but you know, it's the Convention on Conventional Weapons--and this is where it's about consensus and...a small minority of states--or even a single one can hold back the desires of the majority, \"Wareham said. Amandeep Gill, an Indian diplomat who chaired last week's meeting of experts, expressed satisfaction about the outcome, while cautioning that such systems should not be\" anthropomorphized, \"or attributed with human qualities. He insisted that they were not like\" Iron Man and Terminator. \"Credits Created: September 03, 2018 09:22 PM (Copyright 2018 by The Associated Press. All Rights Reserved .) Advertisement", "articleID": "2018090402_00128299_W", "names": {"Jody Williams": ["Q211239", "Q27949760", "Q3179955", "Q36337023", "Q6208173", "Q6208175"]}}, {"date": "2018-09-04", "url": "http://heatworld.com/entertainment/tv-movies/coleen-nolan-kim-woodburn-interview/", "content": "Coleen Nolan breaks down over her confrontation with Kim Woodburn on This Morning Coleen Nolan breaks down over her confrontation with Kim Woodburn on This Morning by Emma Dodds | 54 mins ago © Coleen Nolan & Kim Woodburn © Shutterstock They tried to make amends last week Coleen Nolan had a well-publicised feud with celebrity cleaner Kim Woodburn when they were in the Celebrity Big Brother house together in January 2017. However, their bad blood has spilled into real-life - and despite attempts to patch things up, Kim and Coleen are still at loggerheads over 18 months later. Last week, Kim appeared on Loose Women where Coleen is a panelist, in a segment in which the pair were set to attempt to clear the air - but it quickly descended into a slanging match and ended with Kim storming off the show. © Kim stormed off the show © Shutterstock After the show, Kim vowed to have Coleen and her sister Linda fired from the show, saying that they'd been \"vile\" to her after the appearance which has since drawn over 7,000 Ofcom complaints. Now, Coleen has done her first TV interview since the incident, speaking to Holly Willoughby and Phillip Schofield on This Morning about what she's dubbing \"the worst week of her life .\" Swipe through to see the most OUTRAGEOUS Celebrity Big Brother contestants EVER View Gallery 9 photos Channel 4 Jackie Stallone Perhaps the greatest entrance into CBB ever, Jackie Stallone was introduced as the queen of the house and iconically announced: \"Yeah, I'm Jackie .\" She then continued to act like royalty by calling Blazin Squad's Kenzie \"the little kid' because she forgot his name, demanding champagne and calling the house' a dump'. Her presence was hard for Brigitte Neilsen - ex wife of Jackie's son Sylvester Stallone - who nearly walked out on the night Jackie arrived. Jackie also hilariously told Big Brother to\" kiss my ass' in the Diary Room. Jackie: we bow down to you. 1 / 9 Channel 4 Jackie Stallone Perhaps the greatest entrance into CBB ever, Jackie Stallone was introduced as the queen of the house and iconically announced: \"Yeah, I'm Jackie .\" She then continued to act like royalty by calling Blazin Squad's Kenzie \"the little kid' because she forgot his name, demanding champagne and calling the house' a dump'. Her presence was hard for Brigitte Neilsen - ex wife of Jackie's son Sylvester Stallone - who nearly walked out on the night Jackie arrived. Jackie also hilariously told Big Brother to\" kiss my ass' in the Diary Room. Jackie: we bow down to you. Channel 4 Pete Burns Where do we even start with cross-dressing controversial 80s popstar Pete Burns? After boasting about his \"gorilla fur' coat, PETA got involved and made Big Brother confiscate it. Pete's response?:\" I want my effing coat back! \"It's also fair to say that he despised Jodie Marsh, who he reduced to tears on more than one occasion. He told Big Brother in the Diary Room:\" I wouldn't p ** s on her if she burst out in flames. \"OUCH. Pete passed away in 2016. Channel 4 Jade Goody It was the year of the Big Brother racism row which quickly became political and hit headlines on all the mainstream news channels and papers. Jade Goody, unfortunately, was leader of the pack with Danielle Lloyd and S Club 7's Jo O'Meara. The show received a record number of complaints after the group\" bullied' Bollywood star Shilpa Shetty and did impressions of her accent. Jade was the third to be evicted but because the controversy was so HUGE, no crowd was allowed to be present when she left the house. Jade sadly died of ovarian cancer in 2009, but her death helped raise awareness of smear tests among young women. Channel 4 Kim Woodburn Queen of clean (except from when it comes to what comes out of her mouth) Kim Woodburn made A LOT of enemies in the Big Brother house. She frequently quarrelled with Bianca Gascoigne and <mark>Nicola McLean</mark>, telling them to shut up and calling them bullies, cowards and bitches. But the BIG argument came when she had to be dragged away by security from <mark>Jamie O'Hara</mark> while shouting \"ADULTERER!\". She told Big Brother in the Diary Room that he was the type of scum you wash down the sink. We probably won't be booking her in to clean up our gaff anytime soon, TBH. Channel 4 Perez Hilton It takes a big character to get under Katie Hopkins' skin, and Perez Hilton fitted the bill perfectly. He went so far in arguments that he actually cracked Katie and was labelled a \"bully' by viewers. Some of his other attention-seeking moments included threatening Calum Best, comparing the experience in the house to serious illnesses and running around stripping. He clearly LOVED annoying people. Channel 4 Gemma Collins Ah, The GC had MANY an outrageous moment during her time in the CBB house. Her biggest feud seemed to be with the Big Brother system, refusing to take part in challenges and telling them she doesn't need the fee money to pay her mortgage (\"I'VE GOT MONEY!\" ). Other memorable moments include Gemma thinking she was pregnant, telling Gillian McKeith to F off down the phone and choosing to have a blow dry at the cost of her housemates missing out on hot water for the day. Channel 4 Megan McKenna Ex On The Beach's Megan McKenna screamed and shouted so much that we very nearly got tinnitus. Her most famous meltdown came when she nearly got into a physical fight with Tiffany Pollard. She also called <mark>John Partridge</mark> every name under the sun and cried: \"I've eaten gruel for that c ** t.\" It's almost admirable (and hilarious) how easily Megan can get hysterical over...well, nothing. Channel 4 Stephen Bear The Ex On The Beach star was either loved or loathed. Stephen's most, ahem, \"memorable' moments perhaps took place with romantic interest Chloe Khan. The pair put on quite a show in front of other contestants by dry humping in front of a window, and they made noises we'll never be able to un-hear when they got intimate in the shower. So it was a bit awkward when Stephen's girlfriend came in to confront him...Despite his Marmite character, Stephen went on to win the show. Channel 4 <mark>Stephanie Davis</mark> Hollyoaks star <mark>Stephanie Davis</mark> entered the most turbulent relationship EVER (well, probably) when she met Jeremy McConnell in the house. The pair weren't shy around each other and quickly got jiggy in between the sheets. Slight problem: <mark>Stephanie</mark> was already in a relationship outside the house. Daniella Westbrook and Gemma Collins took particular offence to <mark>Stephanie</mark>'s behaviour, which sparked arguments. In fact, Danielle said:\" I'd be happy not to breathe the same air as her again in my life. \"Oh dear oh dear.", "articleID": "2018090412_00278714_W", "names": {"Jamie O'Hara": ["Q1429719", "Q470340"], "John Partridge": ["Q23680943", "Q454634", "Q51584622"], "Nicola Mclean": ["Q7029075", "Q7029076"], "Stephanie Davis": ["Q6134141", "Q7608260"]}}, {"date": "2018-09-04", "url": "http://themoderatevoice.com/what-former-toronto-mayor-rob-ford-can-teach-us-about-donald-trump/", "content": "Posted by Richard Barry, Associate Editor - Politics and the Arts on Jul 21, 2015 in 2016 Presidential Election, Featured, Politics | 0 comments What former Toronto Mayor Rob Ford can teach us about <mark>Donald Trump</mark> Since the only thing going on in domestic politics over the last few days is the <mark>Donald Trump</mark> story, I'll bite. I'll try to say something useful about it. Here goes: I am American living in Toronto. I have lived here for decades, and worked in politics for much of that time, including a stint at Toronto City Hall as a political staffer. That means I got to witness, up close and personal, the phenomenon much of the world came to know as Mayor Rob Ford, a.k.a. the crack-smoking mayor of Toronto. I could go into detail about how someone so unqualified came to be mayor of one of the truly great cities of the world. Partly it had to do with the weaknesses of other candidates, partly vote splitting, partly the tension between voters outside the downtown core and those within it, but mostly it had to do with the fact that, for a brief moment when it counted, Rob Ford was very popular. Though he was from a relatively wealthy family and very much aligned with conservative politics in Canada, his popularity cut across ideological lines. Yes, people open to a conservative message supported him, but many not necessarily in that orbit were drawn in. Less affluent voters, supposedly less sophisticated voters and others typically considered to be without power liked <mark>Ford</mark>'s very unsophisticated and direct way of saying things. They related to the fact that he spoke the way they did and broke things down in a way that made sense to them, even if there was a great of deal of dishonesty in the simplification. If the pointy heads talked about complex transit policy, he talked about how dirty the subways were and about how streetcars and bike lanes made it difficult for cars to get around downtown. He called it the war on the car. If other candidates talked about city budget woes, he talked about how city councillors got free coffee and sandwiches at council meetings. He promised to shrink the size of government by reducing taxes and eliminating fees, putting cash in people's pockets. And he certainly wasn't afraid to criticize those in greatest need while making it sound to the poorer sorts like he was talking about someone else. The more the media and other opinion leaders criticized <mark>Ford</mark>'s coarseness and apparent failings as a potential political leader, the more his supporters rallied around him. And that coarseness was legendary. Going into the election his history of gaffes and indiscretions was well known. He had a drunk driving conviction in Florida in 1999; he referred to Asian people in a 2008 speech as \"Orientals who work like dogs...[who are] slowly taking over\" ; he called a fellow councillor a \"waste of skin\" ; he had been forcibly removed from a Maple Leafs hockey game for verbally abusing a spectator; he expressed opposition to homeless shelters and immigration; and even once said that cyclists killed by cars have only themselves to blame. Torontonians elected him anyway. It just didn't matter. The plain talk about how the city should be run, boiling down complex public policy to the level of manageable annoyances, along with the, I suppose, very human way of expressing himself and living his life resonated with voters. Of course, his problems ran deep and his mayoralty eventually imploded, but it took a while and horrible international media attention for the final curtain to fall. Even then, when he was forced to end his campaign because of health issues, his brother <mark>Doug Ford</mark>, in many ways his mirror image, stepped in and actually received 34% of the vote on election day to the winners 40%. So, after all that, the family brand remained resilient. I am not suggesting this means <mark>Donald Trump</mark> can win the Republican nomination, and certainly not the presidency (though <mark>Ford</mark>'s victory in 2010 was unthinkable to many until the votes were counted and certified). A mayoralty race is a very different beast, but there are lessons to be learned. There may be much dishonesty in presenting complex political issues as if they are nothing more than technical problems that can be solved by the right leader, perhaps someone who has succeeded in business. Such a person, with the will to forge ahead, unconcerned about the niceties that apparently hamstring the less capable, could to some be a very compelling candidate. Yes, the McCain comment was off-script and may do <mark>Trump</mark>'s campaign harm, but we are living through a time in politics when, and I'll use the word again, a certain coarseness is not only forgiven but embraced by a large part of the electorate. Candidates who claim to be able to easily explain and solve our most complex problems are treated as saviours, which in itself is not new. What is new is that the boorish behaviour exhibited by some of these \"saviours\" is perceived as proof that they are tough enough, and unconcerned enough about conventional or polite methods, to get the job done. The mantra has become \"simplify and bluster .\" (Cross-posted at Phantom Public.)", "articleID": "2018090412_00290178_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Doug Ford": ["Q28066064", "Q4348031", "Q5300478", "Q5300480"]}}, {"date": "2018-09-05", "url": "https://www.prnewswire.com:443/news-releases/scality-ring-brings-public-cloud-private-with-hpe-greenlake-flex-capacity-300705228.html", "content": "Scality RING Brings \"Public' Cloud Private with HPE GreenLake Flex Capacity New consumption-based IT model for on-premises infrastructure with cloud-scale economics News provided by 08:00 ET Share this article SAN FRANCISCO, Sept. 5, 2018 / PRNewswire /--Scality, leader in software for distributed file and object storage and multi-cloud data control, today announced that its long-standing partner, Hewlett Packard Enterprise (HPE), is now offering HPE GreenLake Flex Capacity and HPE Scalable Object Storage with Scality RING software-defined storage on Apollo 4000 Systems. Streamlining petabyte-scale storage deployments, HPE GreenLake Flex Capacity gives customers a new choice for data storage deployments: consumption-based pricing for increased agility. Freeing up capital budgets and making growth effortless, this new HPE GreenLake Flex Capacity service offering from HPE Pointnext delivers best of breed Scality RING software on HPE Apollo 4000 servers configured, delivered, installed and managed to meet customers' specific needs. All that, and with the benefits of variable payments based on metered usage and vendor management .\" In the context of today's massive growth in unstructured data, elastic consumption combined with infinitely-scalable HPE Scalable Object Storage with Scality RING clearly makes good sense, \"said <mark>Patrick Osborne</mark>, HPE's VP & GM for Big Data and Secondary Storage .\" The HPE GreenLake Flex Capacity program brings the cloud into the data center, making storage and its inevitable expansion easier to accommodate with an elastic consumption-based technology acquisition model. \"\"This is a great deployment option for organizations that want the benefits of cloud but need the control and/or performance of on-premises IT,\" said Michelle Rockler, Scality's VP of Strategic Alliances. \"Customers can set up IT capacity, pay monthly fees based on usage, and easily scale up or down without repeated capital outlay and lengthy IT procurement processes .\" The HPE Scalable Object Storage with Scality RING offering is a software-defined storage platform that is density-optimized to allow organizations to seamlessly scale to petabytes and beyond in less physical space and without compromising data availability and durability. HPE Apollo 4200 (2U form factor) and HPE Apollo 4510 (4U form factor) servers are the foundation for HPE Scalable Object Storage with Scality RING, giving customers a choice in platforms to meet their requirements. About Scality Scality builds the most powerful storage tools to make data easy to protect, search and manage anytime, on any cloud. We give customers the freedom and control necessary to be competitive in a data driven economy. Recognized as a leader in distributed file and object storage by Gartner and IDC, we help you to be ready for the challenges of the fourth industrial revolution. Let us show you how. Follow us on Twitter @ scality and @ zenko. Visit us at www.scality.com. Press Contact", "articleID": "2018090512_00181202_W", "names": {"Patrick Osborne": ["Q17521924", "Q7147434"]}}, {"date": "2018-09-09", "url": "http://www.90min.com/posts/6166114-real-madrid-s-sergio-ramos-reveals-death-threats-to-his-family-after-mohamed-salah-injury", "content": "Spain and Real Madrid captain <mark>Sergio Ramos</mark> has revealed that \"death threats' were sent to his family after his infamous incident involving <mark>Mohamed Salah</mark> in the Champions League final in June. The incident in question saw <mark>Ramos</mark> lock arms with <mark>Salah</mark> in a challenge, leading to an awkward landing and a subsequent game-ending injury that put the Egyptian's World Cup participation at risk.  ️ @ SergioRamos joined Real Madrid #OnThisDay in 2005!  2014, 2016, 2017, 2018 #UCL pic.twitter.com/kJecF86c8c--UEFA Champions League (@ ChampionsLeague) September 8, 2018 Real went on to win 3-1, and despite <mark>Ramos</mark>' repeated insistence that his\" conscience is clear', some fans have not let the incident go. Upon his visit to Wembley with Spain for the first round of Nations League fixtures, <mark>Ramos</mark> received a hostile reception. Speaking after the match, he told ESPN: \"One tries to evade the boos. In the end you feel it, but I stay out of everything. It doesn't affect my game .\" I would have liked another reception because people only remember the action of the final, and nobody remembers the death threats that my family and my children received. Any time <mark>Sergio Ramos</mark> is on the ball he's met with a chorus of boos. I guess some Liverpool fans are at Wembley  #ENGSPA pic.twitter.com/KPgMSzAuKZ--90min (@ 90min_Football) September 8, 2018 \"It is a very sensitive issue that people maybe take as a joke about and that's why they whistle in a great stadium like this. My conscience is very clear. I do not have to give more explanations .\" The victory over England eased tensions in the Spain national side after a disappointing World Cup, and gave <mark>Luis Enrique</mark> victory in his first game in charge. <mark>Ramos</mark> was a prominent topic of conversation with new La Roja boss <mark>Enrique</mark>, who hailed his captain's leadership qualities. \"When you see him compete you see that he is special,\" the former Barcelona boss said, via Marca. \"He is a great leader in any situation and a person who leads on the pitch and off it .\" I'm thrilled about him and hope that he is with us for a long time. He has exceeded what I expected of him. \"", "articleID": "2018090909_00081225_W", "names": {"Luis Enrique": ["Q222789", "Q322350"], "Mohamed Salah": ["Q1354960", "Q22109496", "Q43975293", "Q50365713"]}}]