[{"date": "2018-09-09", "url": "http://www.90min.com/posts/6166114-real-madrid-s-sergio-ramos-reveals-death-threats-to-his-family-after-mohamed-salah-injury", "content": "Spain and Real Madrid captain <mark>Sergio Ramos</mark> has revealed that \"death threats' were sent to his family after his infamous incident involving <mark>Mohamed Salah</mark> in the Champions League final in June. The incident in question saw <mark>Ramos</mark> lock arms with <mark>Salah</mark> in a challenge, leading to an awkward landing and a subsequent game-ending injury that put the Egyptian's World Cup participation at risk.  ️ @ SergioRamos joined Real Madrid #OnThisDay in 2005!  2014, 2016, 2017, 2018 #UCL pic.twitter.com/kJecF86c8c--UEFA Champions League (@ ChampionsLeague) September 8, 2018 Real went on to win 3-1, and despite <mark>Ramos</mark>' repeated insistence that his\" conscience is clear', some fans have not let the incident go. Upon his visit to Wembley with Spain for the first round of Nations League fixtures, <mark>Ramos</mark> received a hostile reception. Speaking after the match, he told ESPN: \"One tries to evade the boos. In the end you feel it, but I stay out of everything. It doesn't affect my game .\" I would have liked another reception because people only remember the action of the final, and nobody remembers the death threats that my family and my children received. Any time <mark>Sergio Ramos</mark> is on the ball he's met with a chorus of boos. I guess some Liverpool fans are at Wembley  #ENGSPA pic.twitter.com/KPgMSzAuKZ--90min (@ 90min_Football) September 8, 2018 \"It is a very sensitive issue that people maybe take as a joke about and that's why they whistle in a great stadium like this. My conscience is very clear. I do not have to give more explanations .\" The victory over England eased tensions in the Spain national side after a disappointing World Cup, and gave <mark>Luis Enrique</mark> victory in his first game in charge. <mark>Ramos</mark> was a prominent topic of conversation with new La Roja boss <mark>Enrique</mark>, who hailed his captain's leadership qualities. \"When you see him compete you see that he is special,\" the former Barcelona boss said, via Marca. \"He is a great leader in any situation and a person who leads on the pitch and off it .\" I'm thrilled about him and hope that he is with us for a long time. He has exceeded what I expected of him. \"", "articleID": "2018090909_00081225_W", "names": {"Sergio Ramos": ["Q483309", "Q514286"]}}, {"date": "2018-09-09", "url": "https://www.newkerala.com/news/read/43966/serena-williams-points-at-sexism-in-controversial-defeat-in-us-open-final.html", "content": "Serena Williams points at sexism in controversial defeat in US Open final 2 minutes ago Sep 09, 2018 IANS New York, Sep 9: Former world number one Serena Williams was the centre of all attention at Flushing Meadows despite having lost the US Open final to young Japanese rising star Naomi Osaka (6-2, 6-4) in a match mired in controversies and penalties. Wiliams, who failed to clinch her seventh US Open title and 24th Grand Slam, directly accused the chair umpire, Portuguese <mark>Carlos Ramos</mark>, of sexism during a post-match press conference Saturday, reports Efe news. <mark>Ramos</mark> called out three violations against Williams in the second set: the first being a warning about receiving coaching, the second a penalty point for racket destruction and the third another penalty for verbal abuse for calling him a \"thief .\" \"He took a point from me. He alleged that I was cheating, and I wasn't cheating. Then I had a good conversation with him. I said, Listen, you know my character. You know me really well. I don't cheat to win. I'd rather lose,\" Williams said. \"Then when I sat down, I said it again (...) I can understand what you saw because it may have looked (...) like I was getting coaching, but I'm telling you, that's not what I do,\" she added The younger of the Williams sisters claimed that male tennis players go unpunished even when they argue and use bad words on court all the time. \"I've seen other men call other umpires several things. I'm here fighting for women's rights and for women's equality and for all kinds of stuff. For me to say\" thief' and for him to take a game, it made me feel like it was a sexist remark. He's never taken a game from a man because they said \"thief,'\" said Williams at the press conference. Williams then argued that her protest could serve as an example for people who have emotions and want to express them with total freedom. \"I just feel like the fact that I have to go through this is just an example for the next person that has emotions, and that want to express themselves, and want to be a strong woman. They're going to be allowed to do that because of today. Maybe it didn't work out for me, but it's going to work out for the next person,\" said Williams.", "articleID": "2018090910_00150284_W", "names": {"Carlos Ramos": ["Q19402537", "Q19966735", "Q3476506", "Q3660122", "Q5042526", "Q5042527", "Q57081680"]}}, {"date": "2018-09-10", "url": "http://telegraphindia.com/india/court-blow-to-sonia-rahul-258431?ref=hm-new-stry", "content": "Court blow to Sonia, Rahul Sep 11, 2018 00:00 IST The Congress president places a stone at the memorial to Mahatma Gandhi in New Delhi. Picture by <mark>Prem Singh</mark> New Delhi: Delhi High Court on Monday dismissed petitions from Congress politicians Sonia Gandhi, Rahul Gandhi and Oscar Fernandes that had challenged the reopening of their tax assessments for 2011-12. The bench of Justices S. Ravindra Bhat and A.K. Chawla said: \"The writ petitions have failed .\" On August 16, the high court had reserved its order after the income-tax department contended that Rahul's tax assessment for 2011-12 had been reopened on the ground of the concealment of material facts. The bench had orally asked the income-tax department not to take any coercive step against Sonia, Rahul or Fernandes till it had pronounced its verdict. Senior advocate P. Chidambaram, appearing for Sonia, had said he had faith in the oral statement made by additional solicitor-general Tushar Mehta. Mehta had argued that the Congress politicians had alleged mala fide on the part of the income-tax department but had not made any averments on this. Rahul Gandhi offers water from Kailash Mansarovar at Rajghat on Monday. Picture by <mark>Prem Singh</mark> The income-tax cases against the Congress politicians had arisen from a probe into a private criminal complaint lodged by BJP leader Subramanian Swamy with a trial court in connection with the National Herald newspaper case. Swamy has accused Sonia, Rahul and others of conspiring to misappropriate funds by floating a company called Young Indian that paid only Rs 50 lakh for the right to recover assets worth Rs 90.25 crore that Associated Journals Ltd, the publisher, owed the Congress. The income-tax department has said the shares Rahul has in Young Indian would lead him to have an income of Rs 154 crore and not around Rs 68 lakh, as was assessed earlier. It has already issued a demand notice for Rs 249.15 crore to Young Indian for the assessment year 2011-12. The department's move followed its probe into a complaint alleging the Gandhis had misappropriated Associated Journals' assets while transferring their shares to the newly formed Young Indian. PTI", "articleID": "2018091021_00167360_W", "names": {"Prem Singh": ["Q28058336", "Q28419672", "Q7240178"]}}, {"date": "2018-09-11", "url": "https://www.hollywoodreporter.com/news/oscars-hungary-selects-sunset-foreign-language-category-1142032", "content": "Oscars: Hungary Selects \"Sunset' for Foreign-Language Category 2:30 AM PDT 9/11/2018 by Nick Holdsworth FACEBOOK TWITTER EMAIL ME COMMENTS Courtesy of Venice International Film Festival\" Sunset' The sophomore film by <mark>Laszlo Nemes</mark>, who won an Oscar in 2016 for his debut \"Son of Saul', premiered last week at the Venice Film Festival. Hungary has selected Academy Award winning director <mark>Laszlo Nemes</mark>' sophomore feature Sunset as its submission in the best foreign-language film for the Oscars. In 2016 <mark>Nemes</mark> won an Oscar for his feature debut, Son of Saul - a stunning portrayal of a Jewish man's desperate attempt to give a dead boy he believes is his son a proper burial in the midst of the brutality of Nazi concentration camp. His new film, which premiered in competition at the Venice film festival last week, is set some 30 years before Son of Saul at another major historical juncture in the lives of Hungarians: the eve of the First World War .\" Sunset is about a civilisation at its crossroads, \"<mark>Nemes</mark> said in a statement issued Tuesday by the Hungarian National Film Fund .\" In the heart of Europe at the height of progress and technology, without being written in history, the personal story of a young woman becomes the reflection of the birth of the 20th century. \"Starring Juli Jakab as Irisz, a young woman who comes to live and work in Budapest in 1913 on a mission to find a brother she had never known of, the film dives into a world of violence and intrigue. With visual references to Stanley Kubrick's seminal 1957 anti-war film Paths of Glory and a nod to the masked sex party scene from his 1999 film Eyes Wide Shut, the film runs to nearly two and half hours in length. The Hollywood Reporter critic Deborah noted:\" The [film's] heavy symbolism and penchant for creating unresolved mysteries drives it far from the poignancy of Son of Saul. \"Produced by Laokoon Filmgroup, (Hungary) and Playtime (France) with the support of the Hungarian National Film Fund, Sunset was made on a budget of $10.4 million. Sony Pictures Classics has picked up the film for North America and Australia. World sales are being handled by Playtime. Hungary has a long history of submitting films to the Oscars, starting in 1965 with Zoltan Fabri's Twenty Hours. Nominated ten times (including last year for Ildiko Enyedi's On Body and Soul), it has won the coveted golden statuette twice - in 1981 for <mark>Istvan Szabo</mark>'s Mephist o and in 2016 for Son of Saul. FACEBOOK TWITTER EMAIL ME COMMENTS Nick Holdsworth THRnews @ thr.com @ thr Comments comments powered by Disqus", "articleID": "2018091110_00044095_W", "names": {"Istvan Szabo": ["Q1253970", "Q1293571", "Q1293574", "Q1293579", "Q246617", "Q25465430", "Q30331879", "Q3803926", "Q58821223", "Q6089363"], "Laszlo Nemes": ["Q1216411", "Q1216413", "Q1216415", "Q6495014"]}}, {"date": "2018-09-11", "url": "http://lalouvedesmers.wordpress.com/2018/09/11/why-is-it-good-for-children-to-play-freely/", "content": "Free playtime is something I would qualify as a \"basic\" in my professionnal practice. It doesn't mean that I let the children playing alone during I share gossips with my coleagues, absolutely not. We call free playing also \"free activity\" which shows more the \"active\" side of it. What is it about? Concretely, you can set up a room with some toys, all reachable easily by the kids, and let them act as they want (as part as the house's rules, thought by the team!). And that's it? Actually not. To go further, I'll quote Anna Tardos (psychologist) describe it more in her article Une vie active (\"An active life\" , from Association Pikler-Lóczy de France, n ° 43, not translated in English). For her, there are some factors which help the child to have a better quality of playing: A physical and psychological wellness A long enough duration of playtime, and a regularity for it A big enough place to play, where the child can feel secure Some things to play which stimulate his activity The behaviour from the adults: being patient and letting the time for the children to act with independence With these elements, the child can use his energy to learn a lot of new capacities. Why is it interesting for children? Because it is part of their life! They actually learn so much without any free from adults' instructions. Playing is serious. \"We cannot suppose at first, how much he [a child] can learn while he handles something. He is not only learning to know himself, with his hands and feet, he is not only learning to use, to position his hands, to take things and to become more skilled, but he exercices also his attention, to stay focused and to discover what is around him. He learns that difficulties can be overcome and that one can conquer them by persistence. His success gives him the pleasure of discovering. He is learning how to learn. Most of us think that\" playing \"is something frivolous, only to get a child rid of boredom and so a waste of time. However, a child's first activity is to play: the baby is playing putting something in his mouth, touching, observing and manipulating the objects around him...but in the same time he is learning about the different textures, the colours, the tastes, to compare the sizes and the shapes...his curiosity will lead him to learn and master new concepts and movements. If we go further, he learns also some universal laws (like the gravity, probability, ...) and he learns function of his needs and interests, that makes it more efficient. So, during the firsts months, we can mostly observe manipulations games, and then, when the child is a bit more intellectually mature,\" Pickaboo \"games linked with the situations of separations he lives. Later, we will see more role-playing games, to play daily life scenes or other special moments thats chocked him, to be able to appropriate them and make them easier to tolerate. But this is not a rule, I summarize a lot! Free-playing, an activity that support children'S developpment Photo by Markus Spiske on Unsplash As I explained before, to play is connected with the child's development. Actually a child who can play freely will: Developp his motricity in his way and feel confident and strong Discover the world Start to learn school skills Developp his creativity and imaginaition Improve his social skills Developp a strong self-esteem, which looks at his own difficulties without dip into his self confidence...And so much more! I think it's important to instist on the ability of children to do it alone, I mean, an adult doesn't need to inerfere directly and to show how to do. That leads children to be more self-confident and to know themselves better, and also to feel comfortable in a group and with his interactions with others. Doing alone, a child feels that he is able to try new things and doesn't have a fear of failure...which becomes the opportunity to try again and learn. What are the adults suppose to do then? Their role is so important! He stays further back but must be watchful: he has to observe carefully children, and that is the basis of his role. He must act only if necessary and mostly to comment an action, to put a feeling in words, to explain a situation to a child who doesn't understand He will act physically only in case of danger for a child. The adult will show interest for a child's activity looking at him, giving sense to it with some words. His observations will be very useful too: it helps to know each child better, and so to better know his needs and understand more why is he acting in a certain way. Then the adult can offer other toys and objects that respond better to children's need in the group, reorganize the playing room. He is not passive at all because he will lead children with the choice of toys he gives, and his way of speaking with them, asking sometimes well-choose questions...Which kind of toys for a free-playtime? Absolutely everything if it fits with children's needs and capacities! For my, less oriented is a toy to a type of game, better it is. I would say also that all toys that put children in a passive state (like babies' computers, tablets, smartphones or every noisy -\" pedagogic \"- things). With an\" open \"toy, which gives a plenty of possibilities to play with, a child can imagine an infinity of games, developp his creativity, and make new discoveries with only one object. For example, these toys with rings in different size that we can put in the size's order on a stick: it's obviously possible to rank them from the smaller to the bigger, a child can also manipulate and discover what is the particularity of this shape, to make it roll, or turn on itself, to mix it with other toys to do something new...Another example: these cubes that can be integrated one into another, like Russian dolls. It is possible to make a tower with it, to rank them, discover their shape, to hide other things insid and to learn about their capacity by fulling them...But so many other toys are insterstings: small cars, dolls, doll's tea...most of everything as long as we let children playing by themselves. Adults doesn't have to intervene and say\" You should do it like this...\"or\" No like this it doesn't work! Look, I show you. \"or everything that could influence a child's game. Antje Bostelmann and <mark>Michael Fink</mark> describe 10 types of spontaneous games that we can observe with children (until 3 years old) playing freely) in the book Elementare-spielhandlungen von Kinder under 3: Erkennen, Begleiten, Fördern (not translated in English). They distinguish: Photo by Alexander Dummer on Unsplash The things to hide To investigate how things fall down To investigate the sound of the things To reach behind the surfaces To move things To connect things To rank things To change and alternate the perspectives To mark and create new places To experiment the balance This is only an example of categorization but I find it useful to start to observe children playing. But as each individual is different and that so many elements of context can influence a situation, I think that it is restrictive to only be based on a list with types of games. But let's notice the use of the word\" Thing \"(\"Ding\" in German) instead of \"Toy\" (\"Spielzeug). That's underline that a child uses first objects, not toys to play...So actually, almost everithing can be used! So, be creative! Do you ever see a child who just received a present, playing with the gift wrap, and forgot the new toy? To go further...If you are curious, please, take a look to that we call\" alternative pedagogies \", particulary Emmi Pikler. Her pedagogy is actually based on the free-play and free-motion, mostly in direction of children under 3 years old. The association exists in different countries and offers trainings in diverse topics about the young child. In the UK: http: //www.pikler.co.uk/ In the USA: https: //pikler.org/ The Hungarian Website (but offers the books and trainings in many other languages, like German en Spanish): https: //www.pikler.hu/ About how to speak to children, as a French, I can advice you the Françoise Dolto's books like The Cause of Children, Underlying Stages of Childhood, and Everything is Language. But in the same topic, you can also find interesting books from the Pikler Institute. And for the German speakers, I will recommend you the book I mentioned before: Elementare-spielhandlungen von Kinder under 3: Erkennen, Begleiten, Fördern from Antje Bostelmann andMichael Kink, which is a good tool to begin with children's observation. Photo by Yasmin Dangor on Unsplash Advertisements Like this: Like Loading...Related", "articleID": "2018091115_00073286_W", "names": {"Michael Fink": ["Q18025929", "Q1927414", "Q19596670", "Q683541"]}}, {"date": "2018-09-11", "url": "https://www.mirror.co.uk/sport/football/news/hugo-lloris-names-toughest-striker-13227835", "content": "Sport Hugo Lloris names toughest striker he's faced - and it's not Cristiano Ronaldo or Lionel Messi The Spurs goalkeeper, who led France to World Cup glory this summer, has faced a wealth of attacking talent in his career Share Comments By Thomas Bristow Online sports writer 16:48, 11 SEP 2018 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Get FC Barcelona updates directly to your inbox Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Hugo Lloris has named the toughest striker he's ever faced - and it's not Cristiano Ronaldo or Lionel Messi. The World Cup winning captain played for Nice and Lyon before arriving at Spurs and has more than 100 caps under his belt. At the fairly ripe age of 31 Lloris has faced a wealth of attacking talent throughout his career, but the best forward he's come up against is neither of the five-time Ballon d'Or winners. Instead, the Spurs shot-stopper named Real Madrid and Spain legend Raul. Read More Kylian Mbappe or Neymar: Atletico Madrid boss Diego Simeone reveals which PSG star he would rather sign Real Madrid's Raul celebrates scoring (Image: Getty) Hugo Lloris has faced some of the best strikers in the game (Image: <mark>Michael Regan</mark>) \"It's hard to pick one,\" Lloris told RMC Sport. \"A player like Raul, I played him when he was at Real Madrid and Schalke, he always had that quick glance on the goalkeeper, on where he was positioned and he shot depending on that .\" After that, there's the Suarezs, the Messis, I don't need to present them. Back in the day, there was also Pauleta at Paris Saint-Germain. I played him a lot when I was at Nice. \"The Spain forward scored 323 goals in 741 appearances for Los Blancos and 44 in 102 caps for Spain. Like us on Facebook Follow us on Twitter FC Barcelona Newsletter mirrorfootball Follow @ mirrorfootball Subscribe to our FC Barcelona newsletter Enter email Subscribe Comments Show more comments More On Hugo Lloris Nice Paris Saint-Germain Cristiano Ronaldo FC Barcelona Lionel Messi", "articleID": "2018091115_00247001_W", "names": {"Michael Regan": ["Q21062491", "Q21459008", "Q58249666"]}}, {"date": "2018-09-13", "url": "http://www.channelnewsasia.com/news/sport/spanish-anti-doping-agency-investigates-russia-winger-cheryshev-10710326?cid=cna_flip_070214", "content": "Spanish anti-doping agency investigates Russia winger Cheryshev Toggle share menu Spanish anti-doping agency investigates Russia winger Cheryshev close breaking news Sport Spanish anti-doping agency investigates Russia winger Cheryshev Spain's anti-doping agency said on Wednesday it had opened an investigation into Valencia and Russia winger Denis Cheryshev, following remarks from his father Dmitri in the Russian media about an injection the player took to treat an injury. Soccer Football - UEFA Nations League - League B - Group 2 - Turkey v Russia - Medical Park Arena, Trabzon, Turkey - September 7, 2018 Russia's Denis Cheryshev celebrates scoring their first goal REUTERS/Murad Sezer13 Sep 2018 12:36 AM Bookmark BARCELONA: Spain's anti-doping agency said on Wednesday it had opened an investigation into Valencia and Russia winger Denis Cheryshev, following remarks from his father Dmitri in the Russian media about an injection the player took to treat an injury. \"We can confirm we have started an investigation to find out more information about the case,\" said a spokesman from the AEPSAD, the Spanish Agency for Health Protection in Sport, which is responsible for the fight against doping. Advertisement \"The investigation is being carried out with the co-operation of Russia's anti-doping agency and is in contact with the World Anti-Doping Agency (WADA).\" Cheryshev, who scored four goals in Russia's surprise run to the World Cup quarter-finals, has denied ever taking a banned substance. The investigation stems from an interview which Dmitri Cheryshev gave to Russian publication Sport Weekend during the World Cup, in which he was quoted saying his son had received an injection containing \"growth hormone\" in the run-up to the tournament to treat injury. On the eve of Russia's last-16 game against Spain, Cheryshev said: \"I have never used any prohibited substances and you don't even have to think twice about it .\" Advertisement Advertisement The Russian Football Union (RFU) said at the time that the treatment the player received had been a platelet-rich plasma (PRP) injection which is legal and said the journalist had incorrectly interpreted Dmitri Cheryshev's words. Cheryshev joined Valencia on loan from Villarreal in August. He scored in Russia's 2-1 win at Turkey in the UEFA Nations League last Friday. Valencia's director general Mateu Alemany said on Wednesday the club was unaware of the investigation, adding he believed the player's father had been misquoted. \"We haven't been notified about what has been published. If the player was involved in an investigation then they (the agency) should have told the club and the player,\" Alemany said. \"We have had no communication in any form, he was subject to controls at Villarreal and at the World Cup. After reading everything, I think it's an error in the transcription, because growth factors are not the same as growth hormones .\" (Reporting by <mark>Richard Martin</mark>; Editing by Toby Davis) Source: Reuters", "articleID": "2018091216_00433600_W", "names": {"Richard Martin": ["Q16203893", "Q16266799", "Q3431026", "Q7327662", "Q7327664", "Q7327665"]}}, {"date": "2018-09-13", "url": "https://nascar.nbcsports.com/2018/09/13/nascar-america-chase-elliott-erik-jones-highlight-playoff-underdogs/", "content": "Click to share on LinkedIn (Opens in new window) Whether it's the Big 3 of Kyle Busch, Kevin Harvick and Martin Truex Jr. or the Dynamic Duo of <mark>Busch</mark> and Harvick who are expected to dominate the playoffs, the remainder of the field has been relegated to the status of underdog before this week's race at Las Vegas Motor Speedway (3 p.m. ET on NBCSN). Throughout the season, the quest has been underway to determine who will be the driver most likely to join the Big 3 at Homestead with a shot at winning the Cup. Brad Keselowski has \"won two races; he's still not my guy,\" Kyle Petty said on Wednesday's edition of NASCAR America. \"Even Brad said it a Darlington. Darlington and Bristol are anomalies. You can win there and not have the fastest car ....You just have to make things work. When we went to Indy, he didn't have the fastest car. He just won on strategy. He's not going to...use\" strategery' for the last 10 races of the year. \"With Keselowski out of the final four picture for Petty, attention turns to Chase Elliott .\" Chase Elliott's my guy ....Here's the way I look at it, \"Petty said .\" There's the Big 3--and Martin is just teetering right now--and then there's another seven, eight cars that are all the same to me. Nobody jumps out ....But if I take that middle group, Chase Elliott's my guy. \"\"I look at Chase Elliott and I see a guy who--the last two years, Alan Gustafson has figured out...as soon as we hit the track at Vegas, we're going to be on another gear,\" Nate Ryan said. Elliott has run so well, however, that Ryan does not consider him an underdog. He's a favorite to make the final four. Instead, Ryan is going with a driver in his first Cup contention. \"If I'm looking for an underdog, I think <mark>Erik Jones</mark>,\" Ryan said. For more, watch the video above. Since he began driving in Cup for Roush in 2015, Bayne has zero wins, four top fives and 11 top-10 finishes in 124 starts. Here's a look at where Silly Season stands at this point: ANNOUNCED CUP RIDES FOR 2019--Bubba Wallace will remain with Richard Petty Motorsports through the 2020 season (announcement made July 28) CUP RIDES NOT YET ANNOUNCED FOR 2019 No. 1: The Associated Press reported Sept. 10 that car owner Chip Ganassi had offered Jamie McMurray a contract to drive in the 2019 Daytona 500 only and then move into a management position. Ganassi was awaiting McMurray's decision. The move means the No. 1 will be open for 2019. No. 6: Car owner Jack Roush said Sept. 12 on SiriusXM NASCAR Radio that Trevor Bayne would not be back with Roush Fenway Racing after this season. Bayne, who has shared the No. 6 ride this season with Matt Kenseth, has driven in Cup for Roush since 2015. No. 23: Front Row Motorsports purchased the BK Racing team in bankruptcy court. Front Row needs the team to run the rest of the season to maintain the charter. After this season, Front Row could run a third car, lease this charter or sell this charter. No. 32: Go Fas Racing is looking for a driver after Matt DiBenedetto's announcement Sept. 7 that he won't return to the team after this season. No. 41: <mark>Kurt Busch</mark> signed a one-year deal last December to remain at Stewart-Haas Racing. He said Aug. 31 at Darlington that he has two contract offers for 2019 but did not reveal what teams they were from. <mark>Busch</mark> said Sept. 7 he had no updates on his status. No. 95: Kasey Kahne announced Aug. 16 that he would not return for another full-time season. Also, this team has told Richard Childress Racing it won't be a part of its technical alliance next year. Car owner Bob Leavine said Aug. 5 that \"in our talking to the manufacturers this year, Toyota has been head-and-shoulders above the rest so far .\" DRIVERS WITHOUT ANNOUNCED PLANS FOR 2019 Trevor Bayne: 2011 Daytona 500 winner is looking for a ride after the Sept. 12 announcement he won't return to Roush Fenway Racing in 2019. <mark>Kurt Busch</mark>: 2004 champion's contract expires after this season with Stewart-Haas Racing. Matt DiBenedetto: Said he was betting on himself by leaving Go Fas Racing and looking to race elsewhere. While he would like a full-time ride, he would entertain a part-time ride in the Xfinity Series with a winning team, following what Ryan Preece has done. Daniel Hemric: The Xfinity driver for Richard Childress Racing was asked Aug. 17 at Bristol about his future and he described it as: \"Cloudy, very cloudy .\" He said then he has not signed anything for the 2019 season, adding: \"I'm trying to do everything I can on the race track to prove to somebody that would be willing to put me in a car and give me a shot .\" Jamie McMurray: Although he has not revealed his plans, car owner Chip Ganassi told the AP that he had offered McMurray a contract for only the 2019 Daytona 500 before McMurray would move into a management role. Ryan Preece: Modified ace who has run a limited schedule in the Xfinity Series with <mark>Joe Gibbs</mark> Racing and had great success has not announced his 2019 plans. Martin Truex Jr.: Reigning series champion has not announced a ride for 2019 with the Sept. 4 news that Furniture Row Racing is shutting down after this season. XFINITY SERIES OPEN RIDES FOR 2019 Click to share on LinkedIn (Opens in new window) With three tracks in the playoffs that never hosted playoff races before and conversation surrounding a dramatically new aero package for next year, it seems that change is in the air for NASCAR. On Wednesday's edition of NASCAR America, fans used the hashtag #WednesDale on social media to see just how far those changes could go. Their questions began a conversation between Dale Earnhardt Jr., Kyle Petty and Nate Ryan about how NASCAR could alter their summertime calendar to consolidate the schedule without lessening the number of races run. The panelists were uniform in their desire to see most tracks host only one NASCAR Cup race per year. \"I hate to say this Jason, but...I wouldn't want any of the tracks to get a second date,\" Nate Ryan said. \"I don't really want to run anywhere twice,\" Dale Earnhardt Jr. joined in. \"I like Daytona a couple of times, but I'd like to see everyone go to one...and let's consolidate and make it special,\" Petty said. Taking away the second dates would create opportunities for new tracks to join the senior series--opening up new markets in the process. But there is also an opportunity to make the schedule more compact. The answer for Earnhardt, Petty and Ryan is mid-week races. \"We don't have to shorten the amount of races; let's shorten the time of the season,\" Earnhardt said. \"Run on some Wednesdays. Do even some doubleheaders and stuff like that ....But I think they should go to all the racetracks once and then add Iowa, Nashville Fairgrounds--places like that .\" \"Brad Keselowski has talked about this,\" Ryan said. \"That dead of summer period, June, July when NASCAR could really own some Wednesdays .\" For more, watch the video above. Click to share on LinkedIn (Opens in new window) Jack Roush confirmed on SiriusXM NASCAR Radio on Thursday night that Trevor Bayne will not return to the No. 6 in 2019. In April it was announced that Matt Kenseth would replace Bayne behind the wheel of the No. 6 for select races in 2018. Kenseth's first race was at Kansas on May 12. Since then, Bayne has piloted the car six times with a best finish of 11th at Bristol. He is scheduled to run this week at Las Vegas. \"We're...in negotiations with drivers right now that would drive the 6 car next year,\" Roush told Claire B Lang. \"I think the decision has been made--and I don't want to be breaking the story here, but...it's been announced that Trevor's not going to be in the car next year .\" Roush did not provide further details about the driver search, saying: \"Who it is we're talking to and how close we are in those negotiations, I'm not...inclined to say, based on the fact that we are negotiating .\" While he would not reveal who is being evaluated for the ride, he has a type of driver in mind. \"I want a driver that can be fast,\" Roush said. AUDIO: @ roushfenway Jack Roush confirms to @ ClaireBLang that Trevor Bayne WILL NOT return to @ Roush6Team in 2019. Who do you think gets that ride? pic.twitter.com/K1hkmhUdYe Click to share on LinkedIn (Opens in new window) The regular-season finale at Indianapolis Motor Speedway set the stage for raw emotion that bubbled over on the radio and into the pits. Jamie McMurray and William Byron knew their only hope to make the playoffs was in winning one of the biggest races of the NASCAR season, but they were not the only drivers crushed when Brad Keselowski pulled into victory lane instead. Here are some of this week's highlights: \"All right driver. You know what we got to do today. Make it happen .\" --<mark>Matt McCall</mark>, Jamie McMurray's crew chief \"Boys remember, a win gets us in,\" Darian Grubb, William Byron's crew chief \"It was really fast man; sorry about the brakes .\" Cole Pearn, Martin Truex Jr.'s crew chief \"I let him go every time he's been even close to me all year. Lead lap or not. If he don't want to do the same, then the next time racing, good luck getting around me .\" --Matt Kenseth on Joey Logano. \"The 6 wasn't too appreciative of the blocking .\" --Logano's spotter \"Yeah, well I'm not too appreciative of a lot of things from that guy--so: so what .\" --Logano \"He just frickin' dive-bombed the hell out of me .\" --Landon Cassill after contact with Jeffrey Earnhardt \"Cautions didn't fall our way. Make sure to keep your heads up; no dejection here .\" --<mark>Mike Wheeler</mark>, Denny Hamlin's crew chief after they lost the race. \"Not have meaningless guys in the back wreck. I mean, I don't know what they're doing crashing with a couple of laps to go--multiple laps down .\" --Hamlin For more, watch the video above.", "articleID": "2018091312_00338371_W", "names": {"Erik Jones": ["Q16239574", "Q57422872"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"]}}]