[{"date": "2018-09-13", "url": "https://nascar.nbcsports.com/2018/09/13/nascar-america-chase-elliott-erik-jones-highlight-playoff-underdogs/", "content": "Click to share on LinkedIn (Opens in new window) Whether it's the Big 3 of Kyle Busch, Kevin Harvick and Martin Truex Jr. or the Dynamic Duo of <mark>Busch</mark> and Harvick who are expected to dominate the playoffs, the remainder of the field has been relegated to the status of underdog before this week's race at Las Vegas Motor Speedway (3 p.m. ET on NBCSN). Throughout the season, the quest has been underway to determine who will be the driver most likely to join the Big 3 at Homestead with a shot at winning the Cup. Brad Keselowski has \"won two races; he's still not my guy,\" Kyle Petty said on Wednesday's edition of NASCAR America. \"Even Brad said it a Darlington. Darlington and Bristol are anomalies. You can win there and not have the fastest car ....You just have to make things work. When we went to Indy, he didn't have the fastest car. He just won on strategy. He's not going to...use\" strategery' for the last 10 races of the year. \"With Keselowski out of the final four picture for Petty, attention turns to Chase Elliott .\" Chase Elliott's my guy ....Here's the way I look at it, \"Petty said .\" There's the Big 3--and Martin is just teetering right now--and then there's another seven, eight cars that are all the same to me. Nobody jumps out ....But if I take that middle group, Chase Elliott's my guy. \"\"I look at Chase Elliott and I see a guy who--the last two years, Alan Gustafson has figured out...as soon as we hit the track at Vegas, we're going to be on another gear,\" Nate Ryan said. Elliott has run so well, however, that Ryan does not consider him an underdog. He's a favorite to make the final four. Instead, Ryan is going with a driver in his first Cup contention. \"If I'm looking for an underdog, I think <mark>Erik Jones</mark>,\" Ryan said. For more, watch the video above. Since he began driving in Cup for Roush in 2015, Bayne has zero wins, four top fives and 11 top-10 finishes in 124 starts. Here's a look at where Silly Season stands at this point: ANNOUNCED CUP RIDES FOR 2019--Bubba Wallace will remain with Richard Petty Motorsports through the 2020 season (announcement made July 28) CUP RIDES NOT YET ANNOUNCED FOR 2019 No. 1: The Associated Press reported Sept. 10 that car owner Chip Ganassi had offered Jamie McMurray a contract to drive in the 2019 Daytona 500 only and then move into a management position. Ganassi was awaiting McMurray's decision. The move means the No. 1 will be open for 2019. No. 6: Car owner Jack Roush said Sept. 12 on SiriusXM NASCAR Radio that Trevor Bayne would not be back with Roush Fenway Racing after this season. Bayne, who has shared the No. 6 ride this season with Matt Kenseth, has driven in Cup for Roush since 2015. No. 23: Front Row Motorsports purchased the BK Racing team in bankruptcy court. Front Row needs the team to run the rest of the season to maintain the charter. After this season, Front Row could run a third car, lease this charter or sell this charter. No. 32: Go Fas Racing is looking for a driver after Matt DiBenedetto's announcement Sept. 7 that he won't return to the team after this season. No. 41: <mark>Kurt Busch</mark> signed a one-year deal last December to remain at Stewart-Haas Racing. He said Aug. 31 at Darlington that he has two contract offers for 2019 but did not reveal what teams they were from. <mark>Busch</mark> said Sept. 7 he had no updates on his status. No. 95: Kasey Kahne announced Aug. 16 that he would not return for another full-time season. Also, this team has told Richard Childress Racing it won't be a part of its technical alliance next year. Car owner Bob Leavine said Aug. 5 that \"in our talking to the manufacturers this year, Toyota has been head-and-shoulders above the rest so far .\" DRIVERS WITHOUT ANNOUNCED PLANS FOR 2019 Trevor Bayne: 2011 Daytona 500 winner is looking for a ride after the Sept. 12 announcement he won't return to Roush Fenway Racing in 2019. <mark>Kurt Busch</mark>: 2004 champion's contract expires after this season with Stewart-Haas Racing. Matt DiBenedetto: Said he was betting on himself by leaving Go Fas Racing and looking to race elsewhere. While he would like a full-time ride, he would entertain a part-time ride in the Xfinity Series with a winning team, following what Ryan Preece has done. Daniel Hemric: The Xfinity driver for Richard Childress Racing was asked Aug. 17 at Bristol about his future and he described it as: \"Cloudy, very cloudy .\" He said then he has not signed anything for the 2019 season, adding: \"I'm trying to do everything I can on the race track to prove to somebody that would be willing to put me in a car and give me a shot .\" Jamie McMurray: Although he has not revealed his plans, car owner Chip Ganassi told the AP that he had offered McMurray a contract for only the 2019 Daytona 500 before McMurray would move into a management role. Ryan Preece: Modified ace who has run a limited schedule in the Xfinity Series with <mark>Joe Gibbs</mark> Racing and had great success has not announced his 2019 plans. Martin Truex Jr.: Reigning series champion has not announced a ride for 2019 with the Sept. 4 news that Furniture Row Racing is shutting down after this season. XFINITY SERIES OPEN RIDES FOR 2019 Click to share on LinkedIn (Opens in new window) With three tracks in the playoffs that never hosted playoff races before and conversation surrounding a dramatically new aero package for next year, it seems that change is in the air for NASCAR. On Wednesday's edition of NASCAR America, fans used the hashtag #WednesDale on social media to see just how far those changes could go. Their questions began a conversation between Dale Earnhardt Jr., Kyle Petty and Nate Ryan about how NASCAR could alter their summertime calendar to consolidate the schedule without lessening the number of races run. The panelists were uniform in their desire to see most tracks host only one NASCAR Cup race per year. \"I hate to say this Jason, but...I wouldn't want any of the tracks to get a second date,\" Nate Ryan said. \"I don't really want to run anywhere twice,\" Dale Earnhardt Jr. joined in. \"I like Daytona a couple of times, but I'd like to see everyone go to one...and let's consolidate and make it special,\" Petty said. Taking away the second dates would create opportunities for new tracks to join the senior series--opening up new markets in the process. But there is also an opportunity to make the schedule more compact. The answer for Earnhardt, Petty and Ryan is mid-week races. \"We don't have to shorten the amount of races; let's shorten the time of the season,\" Earnhardt said. \"Run on some Wednesdays. Do even some doubleheaders and stuff like that ....But I think they should go to all the racetracks once and then add Iowa, Nashville Fairgrounds--places like that .\" \"Brad Keselowski has talked about this,\" Ryan said. \"That dead of summer period, June, July when NASCAR could really own some Wednesdays .\" For more, watch the video above. Click to share on LinkedIn (Opens in new window) Jack Roush confirmed on SiriusXM NASCAR Radio on Thursday night that Trevor Bayne will not return to the No. 6 in 2019. In April it was announced that Matt Kenseth would replace Bayne behind the wheel of the No. 6 for select races in 2018. Kenseth's first race was at Kansas on May 12. Since then, Bayne has piloted the car six times with a best finish of 11th at Bristol. He is scheduled to run this week at Las Vegas. \"We're...in negotiations with drivers right now that would drive the 6 car next year,\" Roush told Claire B Lang. \"I think the decision has been made--and I don't want to be breaking the story here, but...it's been announced that Trevor's not going to be in the car next year .\" Roush did not provide further details about the driver search, saying: \"Who it is we're talking to and how close we are in those negotiations, I'm not...inclined to say, based on the fact that we are negotiating .\" While he would not reveal who is being evaluated for the ride, he has a type of driver in mind. \"I want a driver that can be fast,\" Roush said. AUDIO: @ roushfenway Jack Roush confirms to @ ClaireBLang that Trevor Bayne WILL NOT return to @ Roush6Team in 2019. Who do you think gets that ride? pic.twitter.com/K1hkmhUdYe Click to share on LinkedIn (Opens in new window) The regular-season finale at Indianapolis Motor Speedway set the stage for raw emotion that bubbled over on the radio and into the pits. Jamie McMurray and William Byron knew their only hope to make the playoffs was in winning one of the biggest races of the NASCAR season, but they were not the only drivers crushed when Brad Keselowski pulled into victory lane instead. Here are some of this week's highlights: \"All right driver. You know what we got to do today. Make it happen .\" --<mark>Matt McCall</mark>, Jamie McMurray's crew chief \"Boys remember, a win gets us in,\" Darian Grubb, William Byron's crew chief \"It was really fast man; sorry about the brakes .\" Cole Pearn, Martin Truex Jr.'s crew chief \"I let him go every time he's been even close to me all year. Lead lap or not. If he don't want to do the same, then the next time racing, good luck getting around me .\" --Matt Kenseth on Joey Logano. \"The 6 wasn't too appreciative of the blocking .\" --Logano's spotter \"Yeah, well I'm not too appreciative of a lot of things from that guy--so: so what .\" --Logano \"He just frickin' dive-bombed the hell out of me .\" --Landon Cassill after contact with Jeffrey Earnhardt \"Cautions didn't fall our way. Make sure to keep your heads up; no dejection here .\" --<mark>Mike Wheeler</mark>, Denny Hamlin's crew chief after they lost the race. \"Not have meaningless guys in the back wreck. I mean, I don't know what they're doing crashing with a couple of laps to go--multiple laps down .\" --Hamlin For more, watch the video above.", "articleID": "2018091312_00338371_W", "names": {"Kurt Busch": ["Q201820", "Q42507470"], "Matt Mccall": ["Q20744528", "Q21872602", "Q6789029"], "Mike Wheeler": ["Q20687571", "Q24703080"]}}, {"date": "2018-09-15", "url": "http://catherine.wikia.com/wiki/Katherine_McBride?diff=20004&oldid=19986", "content": "Revision as of 20:28, September 12, 2018 (view source) AlexShepherd (wall | contribs) (→ Catherine: Full Body) ← Older edit Latest revision as of 10:52, September 15, 2018 (view source) AlexShepherd (wall | contribs) (→ Catherine: Full Body) Line 265: Line 265: <mark>Katherine</mark> work. png | <mark>Katherine</mark> at work. <mark>Katherine</mark> work. png | <mark>Katherine</mark> at work. VincentKatherineIntimate. png | <mark>Katherine</mark> getting intimate with Vincent. VincentKatherineIntimate. png | <mark>Katherine</mark> getting intimate with Vincent. + KatherineCheerleader. png | <mark>Katherine</mark> in a cheerleader outfit. </ gallery> </ gallery> Latest revision as of 10:52, September 15, 2018 <mark>Katherine McBride</mark> Sex Female Age 32 Hair Beige Eyes Dark brown Height 175cm Blood Type B Occupation Office Manager at Bantam Suits ENG VA Michelle Ruff JPN VA Kotono Mitsuishi \"Look, Vincent. You're not...hiding anything from me...are you ...?\" <mark>Katherine McBride</mark> (キャサリン ・ マクブライド Kyasarin Makuburaido) is Vincent Brooks's loyal and steadfast girlfriend, who wants something more. She and Vincent were classmates in high school, but they only started dating after they met again at their high school reunion five years ago and have currently been together since. <mark>Katherine</mark> has been thinking more and more about their relationship, and wants him to fully commit to her by marriage, but his indecisiveness is starting to increasingly annoy her as time goes by. <mark>Katherine</mark> currently works as an office manager for a clothing company called Bantam Suits, the same company Todd Bozeman and Archie Wallace work for. <mark>Katherine</mark> and Vincent don't live together for unknown reasons (possibly because of their workplace commutes) although she occasionally visits him to see how he's doing and drop off snacks. During the game, they frequently visit a cafe called Chrono Rabbit where they meet up to see how each other are doing and chow down on food. Asides from the main Golden Playhouse storyline, <mark>Katherine</mark> is also a playable character in co-op mode, where she and Vincent must work together to ascend the Babel. If a second player is present, they will control <mark>Katherine</mark>. If not, <mark>Katherine</mark> will be controlled by an AI bot. Contents [show] Design Edit <mark>Katherine</mark> has long blonde-beige hair, brown eyes, and glasses. She wears blue nail polish and violet eyeshadow. She wears a black turtleneck sweater with vertical blue lines on the lower half; the sweater is rolled up to show a bit of her forearms. She black pants, a blue jeweled accessory around her waist, and black high heels. Personality Edit \"No...I usually do the killing in my dreams .\" --<mark>Katherine</mark> to Vincent's question if she has died in a dream <mark>Katherine</mark> has a by-the-book Type A personality. She is intelligent, mature, assertive, dominant, responsible, goal-oriented, but is not without a sense of humor. <mark>Katherine</mark> is a bit of a workaholic who puts her career above almost everything else. When Vincent admits to working severe overtime with no extra pay, she chides him for being taken advantage of it and not taking a stand for himself. She never tells him to relax when it comes to work and accepts work as a valid excuse if he misses time with her. <mark>Katherine</mark> ordering Vincent to be neater. At times, <mark>Katherine</mark> can seem overbearing, naggy and bossy with a domineering attitude towards Vincent. For example, she is trying to pressure him into marriage which he isn't comfortable with. She proves that if someone can't be trusted to do something right, she will take care of it for them. The clearest example of this is when she takes full control of their finances after Vincent consistently spends all his money on new computers, cell phones, alcohol and cigarettes. Another example is that she hates Vincent's messy apartment room, and one of her texts reveals she has a set of spare keys to Vincent's apartment and she cleaned it for him at least once (Vincent may condone this or reply \"Don't touch my stuff .\" ) <mark>Katherine</mark> is not shown to be the affectionate type. The only time she kisses Vincent or tells him she loves him is during the <mark>Katherine</mark> True Ending. Most times she leaves him with a simple \"Goodbye\". Whether this is a result of their recent relationship troubles or because of her natural personality is unknown. It's unknown how she feels about Vincent's drinking and smoking habits although she once sent a text saying Vincent shouldn't drink too much which shows that she cares about Vincent's health, and because of this, she probably doesn't like the idea of Vincent smoking. This is affirmed by her smug smiling when she says that Vincent should stop smoking since it won't be good for the child. From this, it can be deduced that <mark>Katherine</mark> loves and cares for Vincent in her own way. <mark>Katherine</mark> is always straight-forward, and doesn't appreciate between-the-lines insinuations or passive-aggressive accusations, both of which Vincent is guilty of. She frequently texts Vincent to let him know what's new as well as her feelings. Despite her cautious and responsible personality, <mark>Katherine</mark> apparently overlooks unprotected sex with Vincent, eventually thinking she may be pregnant. However, this is likely intentional by <mark>Katherine</mark>, hinting that she wants to become pregnant so that when she has a child, Vincent won't leave her and commit to marriage. Even though her fidelity was called into question with Steve Delhomme, she has only made one lie (of omission) in the entire game: not telling Vincent immediately when she knew she wasn't pregnant. While clues have been left that <mark>Katherine</mark> might have been lying about the pregnancy as a test for Vincent to pass, her reaction during the break up with him paints a clearer picture. She not only tells him that the knowledge of the pregnancy actually scared her, but admits to him she knew about the news earlier, but didn't tell him because she feared he would leave her. She feels guilty about this and realizes she was not being honest with Vincent, and how she was being manipulative by trying to \"trap\" Vincent with a child. Her moral conscience arises when she decides to tell Vincent this truth. <mark>Katherine</mark> Meets Catherine <mark>Katherine</mark> meets Catherine. The only things in the game shown to rattle her are when she murders Catherine (though it happens in a dream), and when she is effectively dealing with the possibility of being pregnant completely alone, as Vincent is off in his own world. It can also be inferred that <mark>Katherine</mark> enjoys fashion, given she puts the effort into painting her nails and wears eyeshadow. She works at a clothing company and seems to go on a shopping spree in one of the endings although it could be argued her working at a clothing company doesn't necessarily means she likes clothing, and that the boxes in her ending may not be clothes either. In an interview, her voice actress (Michelle Ruff) said <mark>Katherine</mark> is also very vulnerable, yet strong and courageous, saying she stands up for herself and what she believes is best for her. \"She's the character we find ourselves relating to from real life experiences or wanting to relate to. I really relied on my own experiences to put myself in her shoes. I think you'll find when you listen to her, she's really close to my own natural voice. I really tried to be as vulnerable as I could in that booth when we were recording .\" [1] Voice director, Valerie Arem, commented, \"<mark>Katherine</mark> is a real woman. She has dreams and emotions and feelings that make her special and unique. She really wants Vincent to see her for that and love her for her uniqueness. She is the strong one in their relationship and I think she is really hoping that Vincent will step up and finally be the strong one .\" [2] History Edit <mark>Katherine</mark> attended elementary school with Vincent, Orlando Haddick, Jonny Ariga and Erica Anderson. <mark>Katherine</mark>'s and Vincent's friendship was initially antagonistic, as the boys would often steal and eat her lunch. Though it upset her, she began giving Vincent her snacks, indicating that she had a crush on him. They met again during their 10-year high school reunion. Afterwards when she was depressed, Vincent ran to her side in the middle of the night and comforted her. He found out that she was having dating problems and started to give her advice, but ended up falling for her himself. While seemingly romantic, Erica theorizes that <mark>Katherine</mark> only started dating him because her maternal instincts and dominant personality wouldn't allow her to leave a slacker like Vincent alone. The two have been in a steady relationship for the past 5 years, though Vincent isn't interested in taking it to the next level, and <mark>Katherine</mark>'s parents have started to pressure her to marry. Many of <mark>Katherine</mark>'s friends are also married and have kids, and it makes her feel left out to the point where <mark>Katherine</mark> wants both marriage and a child/children. It is ambiguous if this is what <mark>Katherine</mark> truly wants, or if she is vulnerable to peer pressure. Catherine Edit <mark>Katherine</mark>'s first scenes in the game are with Vincent, arguing over his lack of overtime pay and inability to stand up for himself. <mark>Katherine</mark> introduces the possibility of marriage between them. Though he blows her off, she continues bringing it up in texts and conversations until she finally tells him that she thinks she's pregnant and will probably have to take maternity leave. Although initially upset by his sheer terror, he manages to calm her down. <mark>Katherine</mark>'s pregnancy <mark>Katherine</mark> almost discovers Catherine. In the following days, she visits him at home to bring him cake (which results in an ant infestation), and meets him at Chrono Rabbit, all the time narrowly missing Catherine. She finds out she actually is pregnant, which she tells Vincent, who reacts much the same as he did before. During one of their meetings, Vincent passive-aggressively accuses her of cheating on him with a man named Steve Delhomme, whom she never heard of before. At this point, <mark>Katherine</mark> mentions the mysterious and intimidating anonymous texts she's been receiving. These turn out to be from Catherine, sent in an effort to drive a wedge further between her and Vincent. <mark>Katherine</mark> furious at Vincent for cheating. Later on, she manifests with Catherine in Vincent's dream on Day 8, which takes place in his apartment. After a heated exchange of insults between the two women in which they call each other bitches and whores and futile attempts of trying to order each other out of Vincent's room, <mark>Katherine</mark>, due to Vincent's betrayal and Catherine's constant insults of her worthlessness to Vincent and Catherine's superiority to <mark>Katherine</mark>, snaps with despair. On the edge of her sanity and feeling embarrassed, humiliated and defeated, <mark>Katherine</mark> silently stands up and moves over the kitchen sink to search for a kitchen knife while still facing and blankly staring at Vincent and Catherine but to no avail as Catherine predicted this and took the knife in advance. <mark>Katherine</mark> horrified by Catherine's death. Vincent attempts to calm down <mark>Katherine</mark> by telling her that he had already called off his affair with Catherine, causing Catherine to snap with rage and jealousy and Catherine blames <mark>Katherine</mark> for Vincent's confusion. Catherine claims that if <mark>Katherine</mark> went away, Vincent could finally be free and attempts to kill <mark>Katherine</mark> with the kitchen knife. Vincent tries to defend <mark>Katherine</mark> and is cut non-fatally in his right lower rib cage. As <mark>Katherine</mark> dashes over the coffee table to escape, Catherine grabs <mark>Katherine</mark>'s hair, shoves her to the floor and a struggle begins. Catherine ends up impaling her abdomen while seemingly having the upper-hand on <mark>Katherine</mark> while they are both on the ground. Catherine ~ Stage 8-1 (Normal Gold EN Version) Catherine's boss form. Vincent pulls a terrified <mark>Katherine</mark> away to escape only to find that the two have been pulled into the Nightmare World: 8-1, The Cathedral. They both climb the tower, with a transformed Catherine chasing after them. <mark>Katherine</mark>, understandably, lags behind due to not having any experience climbing blocks in the nightmares. At the top of the tower, Vincent confesses his love and commitment to <mark>Katherine</mark> when she cannot continue on because of his previous lies and affairs. <mark>Katherine</mark> cries and turns suicidal, apologizing to Vincent and saying she can't think of the future any more. <mark>Katherine</mark> asks Vincent if he still thought about her during the affair, and Vincent says of course he did. After Vincent apologizes to her, she is still reluctant to escape. The area shakes and <mark>Katherine</mark> falls down, but Vincent jumps to cushion <mark>Katherine</mark>. <mark>Katherine</mark> asks Vincent a question, but doesn't finish it. Catherine \"Part 13' Cutscenes Only <mark>Katherine</mark> breaks up with Vincent. In reality on Day 8, when Vincent wakes up from his nightmare, he finds <mark>Katherine</mark> in his apartment, who has no recollection of the prior events, even mentioning she has been watching him toss and turn in his sleep for a while. She came by because he wasn't answering his phone. When Vincent mentions Catherine, <mark>Katherine</mark> confronts Vincent on the infidelity she knows he has been hiding from her, and he admits he was cheating on a girl with the same name as her, but he ended it and is done with her. <mark>Katherine</mark> admits that her pregnancy was a false alarm, although she was incredibly scared because Vincent's reactions did not increase her confidence in him, making her question if Vincent would rather leave her and the baby, and not have to deal with the stress and commitment of being a father. <mark>Katherine</mark> also admits she discovered she knew she was not pregnant earlier, but did not tell him because she felt that he would leave her. Although Vincent claims he was happy about the news of her\" pregnancy \", <mark>Katherine</mark> is saddened because she is not entirely convinced. Despite his best efforts to stop her, she politely and firmly breaks up with him and leaves his apartment, giving him an energy drink on the way out, likely because of his fatigue. <mark>Katherine</mark> only shows up in her three endings: <mark>Katherine</mark> True Ending, <mark>Katherine</mark> Good Ending and <mark>Katherine</mark> Bad Ending. <mark>Katherine</mark> and Vincent kiss in <mark>Katherine</mark> True. <mark>Katherine</mark> True: Vincent tricks <mark>Katherine</mark> into meeting with him alone at the Stray Sheep, with Orlando sending a fake invitation to a friendly reunion and Boss providing the transportion. Once there, he explains his side of the story, that Catherine wasn't real, so technically there was no cheating. While hesitant to accept this ridiculous explanation, Orlando, Jonny and Toby back him up, with Boss providing proof of the supernatural elements. The others step away to give Vincent and <mark>Katherine</mark> time alone, and while <mark>Katherine</mark> bursts into tears, Vincent says that even if Catherine wasn't real, he was still cheating in his heart. He begs for forgiveness, says that his life has no meaning without her, and finishes,\" I will hold you dear for the rest of our lives. Will you marry me? \"<mark>Katherine</mark> replies,\" I guess...I'll consider it. \"As the camera pans out, both show themselves to be very happily relieved and surprised. The scene returns to the Stray Sheep a few months later, where Boss introduces\" the bride \"for the cheer - and the bride turns out to be <mark>Katherine</mark>, clad in a wedding dress, wearing her hair in a bun and without her glasses. She and Vincent have just been wed and are holding their reception at the Stray Sheep with Boss presiding as MC. After the credits roll, Vincent's friends then subject <mark>Katherine</mark> and him to the traditional kiss call - and despite blushes, they oblige. She leans close and passionately tells him,\" I love you so much, Vincent...\"She pulls away, and he replies just after the screen fades to black,\" And I love you...<mark>Katherine</mark>. \"[3] <mark>Katherine</mark> Good: Vincent tricks <mark>Katherine</mark> into meeting with him alone, with Orlando sending a fake invitation to a friendly reunion and Boss providing the transportion. Once there, he explains his side of the story, that Catherine wasn't real, so technically there was no cheating. While hesitant to accept this ridiculous explanation, Orlando, Jonny and Toby back him up, with Boss providing proof of the supernatural elements. <mark>Katherine</mark> agrees to give it another shot with Vincent. A few months later, <mark>Katherine</mark> and Vincent are unclothed in Vincent's bed, <mark>Katherine</mark> sitting on top on him looking through a wedding dress magazine. She nags Vincent about putting together the list of his wedding guests, which he still has yet to do. After ignoring Vincent's pleas to get off him as she is crushing him, she decides to go out to grab something to eat with him. Afterwards, an ant crawls out the window. [4] <mark>Katherine</mark> Bad: Vincent tricks <mark>Katherine</mark> into meeting with him alone at the Stray Sheep, with Orlando sending a fake invitation to a friendly reunion and Boss providing the transportation. Once there, he explains his side of the story: that Catherine wasn't real, so technically he did not cheat at all. Although <mark>Katherine</mark> does trust his words, she senses that he only wants the excitement. Despite Vincent's pleading, <mark>Katherine</mark> tells him there is no second chance for them to be together again, and bids farewell. Vincent is consoled by Boss, encouraging him to give it more time, and Orlando and Jonny, telling him that he is already free from commitment and can date again, which puts Boss off. However, these do little to comfort Vincent, and says he will be okay without her. Exhausted from all the nightmares, Vincent falls asleep at the table. While at it, his pals accompany him for a round of drinks. Unlike most other endings, there are no pictures shown after credits. Instead, <mark>Katherine</mark> is heard tapping her finger onto the table (as how she shows her irritation whenever Vincent does not pay attention) and snaps him out of it by saying,\" Hey, where'd you go? \". This is reminiscent of the game's prologue scene at the Chrono Rabbit. [5] During the Freedom endings, Jonny mentions asking <mark>Katherine</mark> out after their breakup. Though the fate of that is somewhat vague, his reaction implies she turned him down. Quotes Edit Texts\" Like I said before, I'm having dinner with some old friends. It's surprising...Most of them are already married, and almost half of them have kids. They're all showing off pictures of their families and it makes me feel left out. Maybe it's time for us to get out of our comfort zone too. \"\"Wait a second...Are you out drinking at Stray Sheep again? You know you have work tomorrow! Geez...Take it easy, ok?\" \"Um...Can I meet you for lunch tomorrow? You don't need to reply to me now. Just meet me at the cafe for lunch. I'll be there...Please come. Good night .\" \"Are you still at the Stray Sheep? Haven't you been there every night lately? I thought you had an upset stomach today...Why are you drinking again? Please, take care of yourself. You're not just living for you anymore .\" \"Sorry. Maybe I was a little too harsh. I mean, I did overload you with stuff about maternity leave and money...But it's important, so be sure to keep it in mind, okay?\" \"Hi. This morning must have been hard for you. Well...I guess I was in the wrong too, for showing up so suddenly. But...I wanted to talk to you a little more, face-to-face .\" \"I.. . I'm...really confused right now...I mean, you've been acting really strange this week. This has never happened before. I'm worried about us...\"\"Eat that piece of cake I gave you, or it's going to get stale. I know we couldn't talk much yesterday. I've been busy with work, and it's hard to make time. I might not be able to pick up the phone sometimes...I'll give you a call soon .\" \"What's going on? Vincent...Have you gotten involved in something bad? If that's the case, tell me. Tell me the truth. Your problems are my problems now .\" \"Can I trust you? How can I believe what you're saying ...? I hate to have to say that, but you were being weird at lunch. I'm sorry, but I'm not so gullible that I can just believe whatever comes out of your mouth. I need to hear the truth from you. We're going to be sharing our lives together!\" Catherine \"It's so hard to tell what you're thinking sometimes...\"(to Vincent)\" See ya. \"\"Who's that ...?\" (seeing Catherine for the first time) \"We're going inside and you're going to tell me exactly what's going on here .\" (to Vincent) \"So...if I'm not mistaken, it would appear you have another woman in your life, yes?\" \"If you're going to make excuses, can you at least look me in the eye?\" \"I thought you were acting a little weird recently, but THIS?\" \"What are you saying? And I don't want to hear any more of your bullshit .\" \"What are you, damn sick in the head or something?\" (to Catherine) \"Why the hell should I?! YOU'RE the ONE who should be leaving, BITCH!\" (to Catherine) \"W-why you ...! You little WHORE ...! DAMMIT, VINCENT!\" (to Catherine) \"You want me to FORGIVE YOU ...?! HOW CAN I.. .?! I WILL NEVER FORGIVE YOU!\" (to Vincent) \"Of course it's not a lie! You just SHUT YOUR DIRTY WHORE MOUTH!\" (to Catherine) \"What is this...What the hell is this!?\" (entering Cathedral) \"No ...! I'm scared ...!\" \"I'm sorry! I can't think of the future after all this ...!\" \"...You've been cheating on me, haven't you? Do you admit it?\" \"Just stop babbling for a second. You haven't made a bit of sense this entire time. * sigh * You're such a disappointment .\" \"It isn't about forgiveness...Look, did you think I didn't notice? I've been with you this long...Of course I noticed...\"\"Snap out of it! Vincent...I came here to break up with you .\" \"When I thought I was pregnant, I was scared the entire tine...But I thought...maybe you'd be happy for me...\"(<mark>Katherine</mark> cries)\" ...None of that will change anything...There's nothing left between us, so don't call me. \"\"It's over...between us. What you want is\" excitement. \"It's written on your face. I'm going now. Goodbye .\" (in her Bad Ending) The Trivia for Tonight...Edit Fist of Grudge in the Prison of Despair. Doom's Bride in Quadrangle. In unused dialogue, Erica mentions <mark>Katherine</mark> likes kids, and so is probably happy about the pregnancy. [citation needed] In unused dialogue, Orlando mentions that <mark>Katherine</mark> had a pet caterpillar when she was younger. [citation needed] Atlus held a <mark>Katherine</mark> versus Catherine poll. Although the competition was close, <mark>Katherine</mark> won with a slight edge. [6] Catherine is written as キャサリン (Kyasarin) in Japanese for both Catherine and <mark>Katherine</mark>. This leads to a lot more ambiguous references in the Japanese game, as the player must rely on context which C/Katherine is being talked about. In a few instances in the English version, the vagueness of which one Vincent is talking about is so important, the localization team altered the subtitles to read as \"her\" when he actually speaks her name, leaving the player intentionally confused. She plays a very large part of Vincent's fears, manifesting herself in the Nightmare stages as the Fist of Grudge and Doom's Bride. She has an impressive sweet tooth. Every time (except Day 6) that she is at Chrono Rabbit, she is eating cake, usually strawberry, with her milky coffee. <mark>Katherine</mark> represents the black haired and mature looking woman in which a man has to choose between her or a blonde and young looking woman (Catherine) in one of the Lovers Arcana tales. <mark>Katherine</mark> represents the romantic and intellectual attraction shown by how she is towards Vincent in the game. <mark>Katherine</mark> and Catherine share the same English voice actors with Yukari Takeba (Michelle Ruff voices <mark>Katherine</mark> and Yukari) and Rise Kujikawa (<mark>Laura Bailey</mark> voices Catherine and Rise), the characters who represent the Lovers Arcana (as Lovers Social Links and dating interests) in Persona 3 and Persona 4, respectively. Both games are related to Catherine. <mark>Katherine</mark>'s four toes. The last name \"<mark>McBride</mark>\" obviously alludes to the fact that she wants to get married to Vincent. Doom's Bride also hints at this. In one of her phone images, <mark>Katherine</mark> inexplicably only has four toes. Either this is simply an animation goof, or <mark>Katherine</mark> is oligodactyly. Makoto Niijima of Persona 5 can dress as <mark>Katherine</mark>. <mark>Katherine</mark> bears a resemblance to Makoto's sister Sae. Physically, they have long light-colored hair, black outfits with turtlenecks and pants, nail polish, and high heels. They are also workaholics and somewhat manipulative women. Gallery Edit Art Edit <mark>Katherine</mark>. <mark>Katherine</mark>. <mark>Katherine</mark>. <mark>Katherine</mark> as the background on the Official Web Site. Default wallpaper from the Official Web Site. Special wallpaper No. 1 from the Official Web Site. Art. <mark>Katherine</mark> featured on the uncensored Xbox 360 cover. <mark>Katherine</mark> featured on the censored Xbox 360 cover. <mark>Katherine</mark> in an unused title screen. Scans from Venus Mode Art Book. Scans from Venus Mode Art Book. Scans from Venus Mode Art Book. Scans from Venus Mode Art Book. Scans from Venus Mode Art Book. Scans from Venus Mode Art Book. <mark>Katherine</mark>'s and Vincent's wedding clothes from Venus Mode Art Book. Concept art scanned from Venus Mode Art Book. Art. Official \"Ascent of Sheep\" design. The trio. The trio. Add a photo to this gallery Catherine: The Novel Edit <mark>Katherine</mark> and Catherine on the cover. Vincent and <mark>Katherine</mark> in the novel. Add a photo to this gallery Catherine Edit Catherine / <mark>Katherine</mark> icon. <mark>Katherine</mark> and Vincent in the main menu. <mark>Katherine</mark> ignoring or unaware of Vincent screaming for help. <mark>Katherine</mark> waiting. \"Were you even listening?\" <mark>Katherine</mark> asks Vincent if he's really okay. <mark>Katherine</mark> smiles. \"No, I usually do the killing in my dreams .\" \"Well, yeah .\" \"Here, two sugars .\" (the way Vincent likes his coffee) \"To be honest, I was a little worried .\" \"Speak up and tell me!\" <mark>Katherine</mark> smiles at Vincent. <mark>Katherine</mark> smiles at Vincent. <mark>Katherine</mark> shocked. <mark>Katherine</mark> angered. <mark>Katherine</mark> at Chrono Rabbit. \"I think I'm pregnant .\" <mark>Katherine</mark> at Chrono Rabbit. \"HEY! LISTEN TO ME!\" \"What the--Why's this locked!? Unchain this door!\" \"What the hell, Vincent?!\" Vincent and <mark>Katherine</mark>. <mark>Katherine</mark>. \"We're going inside and you're going to tell me exactly what's going on here .\" \"If you're going to make excuses, can you at least look me in the eye?\" \"Why the hell should I? You're the one who should be leaving, BITCH!\" \"Why you...you little whore! Dammit, Vincent!\" \"I WILL NEVER FORGIVE YOU!\" Catherine pointing a knife at <mark>Katherine</mark>. \"GET AWAY FROM ME!\" Catherine dead. <mark>Katherine</mark> in shock. Catherine dies. <mark>Katherine</mark> horrified by Catherine's bloody corpse. <mark>Katherine</mark> panicking. <mark>Katherine</mark> being slapped by Vincent. Vincent putting on <mark>Katherine</mark>'s glasses. <mark>Katherine</mark> panicking. <mark>Katherine</mark>. <mark>Katherine</mark>. <mark>Katherine</mark>. \"I'm sorry! I can't think of the future after all this!\" \"You mean...you still...thought about us?\" <mark>Katherine</mark> almost falls to her death. <mark>Katherine</mark> and Vincent hug. \"Vincent, do you...\"<mark>Katherine</mark> confronting Vincent. <mark>Katherine</mark> confronting Vincent. <mark>Katherine</mark> Good ending. <mark>Katherine</mark> Good ending. <mark>Katherine</mark> Good ending. <mark>Katherine</mark> Good ending. <mark>Katherine</mark> Good ending. <mark>Katherine</mark> True ending. <mark>Katherine</mark> True ending. <mark>Katherine</mark> True ending. Vincent kisses <mark>Katherine</mark>. Unlocked from the beginning. Unlocked after viewing 1 Good/True ending. Unlocked after viewing 2 Good/True endings. Unlocked after viewing 3 Good/True endings. Unlocked after viewing 4 Good/True endings. Unlocked after viewing 5 Good/True endings. <mark>Katherine</mark> in the Nighty Night achievement. Add a photo to this gallery Catherine: Full Body Edit <mark>Katherine</mark>. Young <mark>Katherine</mark>. <mark>Katherine</mark> at work. <mark>Katherine</mark> getting intimate with Vincent. <mark>Katherine</mark> in a cheerleader outfit. Add a photo to this gallery Boss forms Edit Fist of Grudge. Doom's Bride. Doom's Bride. Doom's Bride. Doom's Bride. Add a photo to this gallery Figure Edit <mark>Katherine</mark>. <mark>Katherine</mark>. <mark>Katherine</mark>. <mark>Katherine</mark> and Catherine. <mark>Katherine</mark> and Catherine. Add a photo to this gallery Characters Vincent · <mark>Katherine</mark> · Catherine · Orlando · Jonny · Toby · Erica · Boss · Trisha · Steve · Rin Side Characters Justin · Todd · Archie · Daniel · Morgan · Anna · Lindsay and Martha · Paul · The Couple · Feather Retrieved from\" http: //catherine.wikia.com/wiki/Katherine_McBride? oldid=20004 \"Categories: Characters", "articleID": "2018091511_00068122_W", "names": {"Katherine Mcbride": ["Q56422205", "Q59396385"], "Laura Bailey": ["Q2364867", "Q42888244", "Q6498649"]}}, {"date": "2018-09-14", "url": "http://insideedition.com/student-pilot-who-landed-safely-after-losing-wheel-first-solo-flight-returns-air-46814", "content": "Search Enter the terms you wish to search for. Student Pilot Who Landed Safely After Losing a Wheel on First Solo Flight Returns to the Air News 6:06 AM PDT, September 15, 2018 - Inside Edition Staff Student Pilot Who Landed Safely After Losing a Wheel on First Solo Flight Returns to the Air 6:06 AM PDT, September 15, 2018 - Inside Edition Staff hh: mm: ss The 17-year-old student pilot who successfully landed a plane that lost a wheel during her first solo flight marked her return to the air just days after the frightening incident. Maggie Taraska had just taken off in a single-engine Piper PA-28 Warrior Sunday when the aircraft's right main wheel fell off. \"I was just petrified, I was thinking about all of the bad things that could've happened; I was thinking about how my parents were on the ground and I knew that they were watching,\" Taraska told Inside Edition. Taraska circled the Beverly Regional Airport in Massachusetts for a half-hour under the guidance of her flight instructor and air traffic controllers, and was able to walk away unscathed after landing the plane perfectly. And just several days later, Taraska returned to the tarmac and returned to the sky. \"I'm not nervous right now,\" she said ahead of her flight. \"I don't know how I'm gonna feel once I'm up there, but I'm hopeful everything's going to be fine .\" Taraska went to work ensuring her pre-flight safety inspections were completed before taking off, checking the wings, wheels and under the hood before buckling up and starting the engine. Taraska's flight instructor, <mark>John Singleton</mark>, accompanied her on the flight, which lasted about 30 minutes. Her parents, both Air Force veterans, watched from the ground and sang her praises. And Taraska was all smiles as she landed the plane safely. \"It feels amazing,\" she said of being back up in the air. \"It feels really freeing .\" Taraska has already logged 60 hours of flying. RELATED STORIES", "articleID": "2018091513_00194504_W", "names": {"John Singleton": ["Q363005", "Q6258000"]}}, {"date": "2018-09-16", "url": "http://abc11.com/risk-to-life-is-rising-with-florences-floodwaters-governor-says/4257798/", "content": "share tweet share email \"Risk to life is rising' with Florence's floodwaters, governor says SHARE: share tweet share email SHARE share tweet share email ABCNews MARK OSBORNE Sunday, September 16, 2018 07:34 PM Florence weakened to a tropical depression Sunday, but that is cold comfort to residents in North Carolina who have seen over 2 feet of rain and are now battling major-river flooding and possible tornadoes .\" Flood waters are still raging across parts of our state, and the risk to life is rising with the angry waters, \"North Carolina Gov. <mark>Roy Cooper</mark> said at a midday news conference. He added that\" this storm has never been more dangerous than it is right now \"in certain areas of the state. Some parts of the state were getting 2 to 3 inches an hour, <mark>Cooper</mark> said .\" That's enough to cause flooding in areas that have never flooded before until now, \"<mark>Cooper</mark> said. Since the storm made landfall as a hurricane in North Carolina on Friday morning, it has been blamed for 16 deaths. Officials said that 10 people died in North Carolina and six in South Carolina. The death toll included a person killed Sunday in a pickup truck crash near Gilbert, South Carolina, that occurred when the motorist drove through standing water on a roadway, according to the South Carolina Department of Public Safety. Hundreds of people have been rescued by local authorities, Cajun Navy volunteers and the U.S. Coast Guard since Friday morning. New evacuation orders were issued Sunday for a mile-long area along the Cape Fear and Little rivers in North Carolina. More than 700,000 households and businesses in the state were still without power as of Sunday afternoon, an estimated 15,000 people were in shelters, and 171 primary roads were closed including parts of two interstates, authorities said. The state Highway Patrol advised people to stay off the roads, saying troopers responded to 48 collisions from Saturday night and into Sunday morning. Adding to the threat of further flooding, a tornado watch was in effect for most of Sunday for the areas of Wilmington, Fayetteville, Myrtle Beach, Jacksonville, Oak Island, and Florence .\" It's bad right now, and we do expect it to get worse over the coming days, \"Michael Sprayberry, director of North Carolina Emergency Management, said on ABC's\" This Week \"Sunday .\" We know that's going to be a major mission going forward because this is historic and unprecedented flooding. \"Major river flooding a threat Catastrophic flooding unfolded Sunday morning in parts of North Carolina, exceeding flooding 19 years ago in Hurricane Floyd. the National Weather Service said. One waterway, the Cape Fear River, rose 15 feet in just 24 hours from early Saturday to early Sunday. It reached flood stage in Fayetteville, North Carolina, where mandatory evacuation orders were issued Saturday .\" This will be very dangerous flooding over the next few days, \"the National Weather Service said in a tweet Sunday morning. The Coast Guard head echoed this view .\" My biggest concern is the rising water, \"Schultz said on\" This Week, \"noting that Wilmington, North Carolina, got 24 inches of rain and could potentially get 15 inches more .\" We're looking at a high water situation, \"he said .\" The rivers could potentially crest here into the early part of this week. So, we have not seen the worst of the flooding. \"Schultz was among the emergency officials who briefed President Trump on the storm on Saturday .\" We talked about the massive risk the storm poses, catastrophic flooding, prolonged flooding, \"he said of the briefing .\" We gave him an update on response capabilities in the theater and the president is completely leaning in. Anything the feds need to do to support the local, the state partners here in South Carolina and North Carolina. We feel fully supported. \"The Lumber River, near Lumberton, North Carolina, rose to into major flood stage Sunday. It is expected to reach a level very near the record Hurricane Matthew set in 2016. Mandatory evacuations were issued for South Lumberton on Saturday. Major river flooding is also expected on some rivers from southern Virginia to northern South Carolina. The Northeast Cape Fear River, near Chinquapin, North Carolina, will rise above record flood levels set by Hurricane Floyd in 1999. This will cause devastating flooding across much of Onslow County with travel made impossible and many homes completely flooded. The Neuse River, both near Goldsboro and Kinston, North Carolina, will reach major flood stage late Sunday and into Monday. The Waccamaw River, near Conway, South Carolina, will rise near record levels by the end of the week. Florence has dropped a tremendous amount of rain in eastern North Carolina, with a widespread 20 to 30 inches reported already. Radar is estimating that some areas between Wilmington and New Bern, North Carolina, have received over 30 inches of rain. These are some of the latest rainfall totals as of 11 p.m. on Saturday:--Swansboro, N.C.--30.59 inches--Newport/Morehead City, N.C.--25.20 inches--Elizabethtown, N.C.--20.17 inches--Jacksonville, N.C.--16.13 inches--Conway, S.C.--9.90 inches--Myrtle Beach Airport, S.C.--6.74 inches Florence is now the third storm to set a tropical cyclone state rainfall record in just the last 12 months. Harvey dropped 60.58 inches of rain last year in Texas, setting the state's new record. Lane just last month dropped 52.02 inches of rain in parts of Hawaii, breaking the state record. The 30.59 inches that have fallen in Swansboro sets a new record for North Carolina. Florence also currently stands as the sixth-highest tropical cyclone rainfall total across the U.S. for records dating back to 1950. Heavy rain spreads inland Heavy rains bands are still coming onshore in eastern South Carolina and North Carolina on Sunday morning. Some of the heavier bands have shifted toward Fayetteville, Charlotte, and Raleigh. Torrential rain is causing inland flooding with major roadways, including large portions of I-95, closed. An additional 6 to 10 inches of rain is still possible along the southeast border of North Carolina and South Carolina. Life-threatening, catastrophic flash flooding is likely over the southern to central Appalachians from western North Carolina into western Virginia and eastern West Virginia. Torrential rain will cause flash flooding and increase the risk of landslides in the higher terrains. Florence is still moving very slowly inland. The track shows Florence moving west through Sunday, and then gradually turning north by Monday. Florence will likely become a remnant low within 36 hours. Even though Florence is weakening, it will still bring significant rainfall inland to the Appalachians before moving toward the Northeast on Tuesday. Totals could exceed 4 inches locally for inland New York and Massachusetts .\" People need to heed the warnings from their local emergency management experts and stay in safe ground, \"the Coast Guard's Adm. Schultz said. Related Topics: abc news national SHARE: share tweet share email (Copyright © 2018 ABC News Internet Ventures .) Top Stories WATCH LIVE: Florence flooding is most dangerous right now, Governor says New Bern flooding: Aerial footage shows extent of Florence's damage LIST: Tropical Storm Florence school closings Florence updates: 17 dead, including 11 in NC Cape Fear River at flood stage, expected to pass Matthew Florence flooding: Monitoring potential flooding in your area with FIMAN Exclusive first look at Atlantic Beach after Hurricane Florence Floodwaters rise in North Carolina, evacuations begin in Lillington Show More Officials say there may be sewage in Florence floodwaters VIDEO: Florence damage in Wilmington Rescue crews from all across the country ready to assist North Carolina VIDEO: Sanford Dam breaches in Boiling Spring Lakes More than 632,000 remain without power as crews work to restore service More News", "articleID": "2018091700_00014315_W", "names": {"Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"]}}, {"date": "2018-09-17", "url": "https://www.irishmirror.ie/sport/soccer/soccer-news/toby-alderweireld-kieran-trippier-left-13261727", "content": "Sport Toby Alderweireld and Kieran Trippier left out of Spurs squad for Inter Milan clash for \"technical reasons\" Both centre back Alderweireld and full-back Trippier have started all four of Spurs Premier League games so far this season Share By <mark>Darren Lewis</mark> 17:53, 17 SEP 2018 Updated 18:39, 17 SEP 2018 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe See our privacy notice Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email Mauricio Pochettino has taken a Champions League gamble by leaving Toby Alderweireld and Kieran Trippier out of his squad to face Inter Milan tonight. The Spurs boss maintained his move to axe his star defender and England's best player at the World Cup is a \"technical decision\" , not a punishment after defeat to Liverpool last Saturday. He said: \"It's a technical decision. You can look it up, find it in the dictionary. A technical decision .\" Tactical is on the pitch. Yeah maybe tactical is outside of the pitch too. But it's technical decision, tactical decision, it's a decision in the end. You cannot bring 25 players. You can only play 11 players with seven on the bench. That is the reason. \"(Image: REUTERS) Kieran Trippier will also not feature against Inter (Image: REUTERS) Hugo Lloris and Dele Alli are still out injured for Tottenham's opener but Pochettino added:\" I never punish players because you win and lose. The plan is to leave them and use different players. \"There's nothing behind it. Only that we will play with different players. We believe the best decision is to play with different players .\" But it has once more plunged the future of Alderweireld into doubt. Spurs fans have been hoping that the former Southampton and Atletico Madrid defender could be persuaded to commit his long-term future to the club after a summer in limbo. But now, with less than two years left on his current deal, Alderweireld could leave for just £ 25million during a two-week window next summer because of a clause in his contract. Mauricio Pochettino has revealed Spurs' team news (Image: AFP) The Belgian centre-back was frozen out of the Spurs team last season - only to play in six out of his country's seven games during the summer at the World Cup. He was priced out of a move to Manchester United where he would have been lining up against Young Boys tomorrow night but now finds himself out in the cold again. Pochettino insists Tottenham's supporters need not be worried about lining up against Inter - who return to the competition after a six-year absence - without two of his his key players. He added: \"Why would the fans be concerned? We win or we lose. Against Liverpool they play and we lose. The fans might be concerned because we didn't play Davinson Sanchez or Serge Aurier. It is wrong to think that way .\" After winning their first three Premier League games, Spurs have been beaten in their last two. Inter have won just one of their opening four games of the season. Like us on Facebook Follow us on Twitter Daily Newsletter irishmirrorsport Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe More On Internazionale Milano F.C. Premier League Champions League Tottenham Hotspur FC Toby Alderweireld Kieran Trippier UEFA Champions League Barclay's Premier League", "articleID": "2018091717_00241013_W", "names": {"Darren Lewis": ["Q5225019", "Q5225021"]}}, {"date": "2018-09-21", "url": "http://thesaturdaypaper.com.au/news/law-crime/2018/09/22/new-domestic-intelligence-powers/15375384006887", "content": "Edition No. 223 September 22--28, 2018 News A new Office of National Intelligence will have increased powers to access personal information and scrutinise online activities. But who will monitor the monitor? By <mark>Karen Middleton</mark>. New domestic intelligence powers Australia's intelligence community is set to increase its monitoring of Australian citizens and bypass privacy laws blocking access to personal information, with its focus also expanding to domestic political activity for the first time since the 1970s. As part of the overhaul of national security architecture, prompted by last year's independent intelligence review, the new Office of National Intelligence (ONI) within the prime minister's department becomes the senior agency and central coordinating body for Australia's intelligence agencies, now expanding from six to 10. In replacing the Office of National Assessments, ONI's remit will be extended from collecting only international open-source information and preparing assessments on how overseas developments affect Australia, to collecting domestic information, too, scanning social media and other online material for local activity that could threaten national security. They will be partially exempted from the Privacy Act to enable disclosure of personal information to ONI. ONI will also have access to personal information that other government agencies have collected for other purposes and may be able to access private social media accounts. Legislation to establish the new office confirms four more organisations will be designated as intelligence agencies--the departments of Home Affairs and Defence, the Australian Federal Police and the Australian Transaction Reports and Analysis Centre (AUSTRAC), which tracks suspect financial transactions. They will be partially exempted from the Privacy Act to enable disclosure of personal information to ONI. Other departments and agencies right across government will be enabled to effectively sidestep privacy laws and provide Australians' personal information to ONI voluntarily, apparently without a warrant being required. The watchdog parliamentary joint committee on intelligence and security is currently examining the ONI legislation. Security experts have told The Saturday Paper that rapidly changing technology and terrorist methods mean greater sharing of information between government agencies is both essential and inevitable. But they say there must be adequate protections and stronger oversight built in to prevent the system being abused. The ONI legislation also broadens the definition of public information, allowing ONI to collect some online data that Australians might generally assume to be private. It describes this as \"information relating to matters of political, strategic or economic significance to Australia that is accessible to any section of the public\". It appears the phrasing may allow it to include accounts on social media sites such as Facebook, even if they are set to private. In a submission to the committee, the inspector-general of intelligence and security (IGIS), <mark>Margaret Stone</mark>, has confirmed this could include \"activities in closed forums where membership must be approved by an administrator and/or requires payment of a fee, or where membership is limited to those with specialist skills, knowledge or access to technology\". \"Assessing whether information is accessible to\" any section of the public' is more difficult than it may seem, \"<mark>Stone</mark> noted, saying she would scrutinise ONI's collection activities. The Department of the Prime Minister and Cabinet and the current Office of National Assessments have taken the unusual step of also making a submission to the parliamentary committee, known as the PJCIS. Attached to it is a privacy assessment from the Australian Government Solicitor that says the bill's wording will create what is described legally as\" a relevant exception \"to the law that usually prevents individual personal information being used or disclosed for a secondary purpose without consent .\" One such exception is where the use or disclosure of the information is \"required or authorised by or under an Australian law',\" it says. It says the ONI bill \"will enable Commonwealth authorities to voluntarily disclose personal information obtained for the purposes of their own functions to the ONI on the basis the disclosure will be\" required or authorised by law'. \"To obtain the information, the ONI director-general, Nick Warner--former head of the Australian Secret Intelligence Service--will have to first consult the agency and then make the request in writing. While the Australian Government Solicitor assessment acknowledges ONI's scope to collect information will widen, it says what it can do with it will be more restricted and there will be\" a stronger and more transparent regime for the handling and protection of personal information than currently exists for ONA \". The prime minister will be required to draft new privacy rules governing its handling and use. The inspector-general of intelligence and security said the rules should be made public, as for those applying to other agencies. A spokesman for the Department of the Prime Minister and Cabinet told The Saturday Paper they would be, except for any parts that could identify a classified capability. In the only other submission to the inquiry, the Law Council of Australia said the privacy commissioner should be consulted. The council says the ONI legislation should include privacy protection measures, such as requiring privacy impact assessments and yearly compliance audits, appropriate training and public reporting on the number of instances in which information is disclosed or used inconsistent with the privacy rules. The PM & C and ONA submission confirms the new ONI's role will reach beyond foreign intelligence assessments to also\" prepare strategic-level intelligence assessments on other matters of political, strategic or economic significance to Australia \". Combined with new laws on foreign interference, espionage and foreign influence, the arrangements also herald a new scrutiny of domestic political activity. The joint submission seeks to allay fears about ONI's role .\" In performing this function, ONI may have access to a greater amount of personal information [relating] to Australians, however, ONI's assessment focus will remain at the strategic, rather than the individual, level. \"The change reintroduces a focus on subversion absent from the remit of disrupting agencies such as the Australian Security Intelligence Organisation since the first Hope royal commission condemned its heavy-handedness in 1974. To date, the guidelines governing ASIO's work have limited its reach and effectively entrenched the right to peaceful protest and other lawful political activity in Australia. Those guidelines are being reviewed. ASIO remains a statutory authority but has moved from the Attorney-General's Department to Home Affairs. The head of the Strategic and Defence Studies Centre at the Australian National University, Professor John Blaxland, says the powers of the inspector-general of intelligence and security and the PJCIS need boosting to guarantee accountability in the new regime .\" Power can corrupt, and to avoid the people who are operating in a very secretive space from abusing that power, the checks on that power need to be robust, \"he said. Blaxland, who co-wrote the official history of ASIO, says the provisions of the Intelligence Services Act requiring warrants for actions against Australian citizens should be explicitly added to the ONI legislation but that the warrant system should also be updated. He says the inspector-general's expanded remit to cover the actions of all 10 agencies must also be explicit, to ensure her office is properly funded and resourced. Blaxland says that with the boundaries of illegal activity blurring, powers to let federal and state agencies interact and share information must also be spelt out. He echoed the argument that prompted the system overhaul--that without more cooperation, agencies can't keep ahead of national security threats .\" It's in that space between finding out something's wrong and getting the warrant and acting on the warrant that things can go pear-shaped, \"Blaxland says .\" That's what's leading intelligence practitioners to say this isn't fast enough. \"Centre Alliance senator Rex Patrick has drafted a private member's bill aimed at expanding the PJCIS's role beyond just scrutinising legislation and the intelligence agencies' administration and spending to include their operations--something now only open to the IGIS, who has the powers of an enduring royal commission. He says parliament should be wary of agencies' reach extending into ordinary Australians' political and private lives. Patrick says both the IGIS and PJCIS should be strengthened, pointing to Australia's international security partners--especially Canada--where legislatures play stronger watchdog roles .\" If the intelligence community won't trust elected members of parliament to examine their operations, at home and abroad, how can the parliament and public be fully confident that these very powerful agencies won't one day be turned to partisan advantage by the government of the day in what could amount to a high-tech police state? \"Former ONA analyst and now independent MP Andrew Wilkie is similarly concerned .\" I have a natural suspicion of anything in Australia that extends the power of the security services--the power of the state--because I believe Australia has already reached what I call a pre-police state, \"he says. But Wilkie takes\" zero comfort \"from calls to beef up the PJCIS, saying it has too few critical voices and tends to be\" hawkish \". Other security sources say the IGIS's power is appropriately greater. Wilkie is the only non-major-party MP to have served on the committee, after the Greens insisted then prime minister <mark>Julia Gillard</mark> appoint him as part of their minority government agreement. He is no longer a member and the committee again consists only of Liberal and Labor members, with governments believing minor parties and independents would undermine bipartisanship. Another former analyst, Clinton Fernandes, now professor of International and Political Studies at the University of New South Wales, says the various new laws may mean agencies more closely monitor the activities of environmental and other protest organisations. But he says ONI's central role as the new\" tsar \"of Australian intelligence is appropriate and suggests Wilkie is being\" a bit alarmist \".\" I would avoid the words \"police state',\" Fernandes says. \"The term he's looking for is\" surveillance state', or \"intelligence state'...The effect of this is to give ONI the ability to reach down and get any information they want .\" He says renewed monitoring for subversion made parliamentary oversight even more important. The PM & C spokesman said the government was still considering further oversight measures recommended in last year's review. The government is also introducing other security legislation that would sidestep privacy restrictions, to permit telecommunications and technology companies to hand over so-called backdoor access keys to their customers' encrypted information. The Assistance and Access Bill would allow the companies to enable access to encrypted sites, devices and applications voluntarily. It would also enable security agencies to force them to create and provide access if they refused, under threat of jail. And it gives ASIO the power to seek a warrant to demand passwords, PIN codes or fingerprints to unlock personal smartphones, either from the phone's user or from an associate with the information, with refusal punishable by up to five years' jail. After what the digital civil liberties group Digital Rights Watch calls \"a ridiculously short\" public consultation period in which 15,000 submissions were nevertheless lodged, the Coalition's party room approved the bill this week. The Greens are among those raising privacy concerns, warning it also creates a greater risk of hacking and will allow the information to be shared with Australia's \"Five Eyes\" partners--the US, Britain, Canada and New Zealand. \"It is akin to opening your mail, and allowing <mark>Donald Trump</mark> to read it over your shoulder,\" says Greens senator Jordon Steele-John. While the government dismisses the concerns, it's a prospect that might make even more people sit up and take notice. This article was first published in the print edition of The Saturday Paper on Sep 22, 2018 as \"Information overlord\". Subscribe here.", "articleID": "2018092115_00057715_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Julia Gillard": ["Q41563", "Q59400153"]}}]