[{"date": "2018-09-21", "url": "http://thesaturdaypaper.com.au/news/law-crime/2018/09/22/new-domestic-intelligence-powers/15375384006887", "content": "Edition No. 223 September 22--28, 2018 News A new Office of National Intelligence will have increased powers to access personal information and scrutinise online activities. But who will monitor the monitor? By <mark>Karen Middleton</mark>. New domestic intelligence powers Australia's intelligence community is set to increase its monitoring of Australian citizens and bypass privacy laws blocking access to personal information, with its focus also expanding to domestic political activity for the first time since the 1970s. As part of the overhaul of national security architecture, prompted by last year's independent intelligence review, the new Office of National Intelligence (ONI) within the prime minister's department becomes the senior agency and central coordinating body for Australia's intelligence agencies, now expanding from six to 10. In replacing the Office of National Assessments, ONI's remit will be extended from collecting only international open-source information and preparing assessments on how overseas developments affect Australia, to collecting domestic information, too, scanning social media and other online material for local activity that could threaten national security. They will be partially exempted from the Privacy Act to enable disclosure of personal information to ONI. ONI will also have access to personal information that other government agencies have collected for other purposes and may be able to access private social media accounts. Legislation to establish the new office confirms four more organisations will be designated as intelligence agencies--the departments of Home Affairs and Defence, the Australian Federal Police and the Australian Transaction Reports and Analysis Centre (AUSTRAC), which tracks suspect financial transactions. They will be partially exempted from the Privacy Act to enable disclosure of personal information to ONI. Other departments and agencies right across government will be enabled to effectively sidestep privacy laws and provide Australians' personal information to ONI voluntarily, apparently without a warrant being required. The watchdog parliamentary joint committee on intelligence and security is currently examining the ONI legislation. Security experts have told The Saturday Paper that rapidly changing technology and terrorist methods mean greater sharing of information between government agencies is both essential and inevitable. But they say there must be adequate protections and stronger oversight built in to prevent the system being abused. The ONI legislation also broadens the definition of public information, allowing ONI to collect some online data that Australians might generally assume to be private. It describes this as \"information relating to matters of political, strategic or economic significance to Australia that is accessible to any section of the public\". It appears the phrasing may allow it to include accounts on social media sites such as Facebook, even if they are set to private. In a submission to the committee, the inspector-general of intelligence and security (IGIS), <mark>Margaret Stone</mark>, has confirmed this could include \"activities in closed forums where membership must be approved by an administrator and/or requires payment of a fee, or where membership is limited to those with specialist skills, knowledge or access to technology\". \"Assessing whether information is accessible to\" any section of the public' is more difficult than it may seem, \"<mark>Stone</mark> noted, saying she would scrutinise ONI's collection activities. The Department of the Prime Minister and Cabinet and the current Office of National Assessments have taken the unusual step of also making a submission to the parliamentary committee, known as the PJCIS. Attached to it is a privacy assessment from the Australian Government Solicitor that says the bill's wording will create what is described legally as\" a relevant exception \"to the law that usually prevents individual personal information being used or disclosed for a secondary purpose without consent .\" One such exception is where the use or disclosure of the information is \"required or authorised by or under an Australian law',\" it says. It says the ONI bill \"will enable Commonwealth authorities to voluntarily disclose personal information obtained for the purposes of their own functions to the ONI on the basis the disclosure will be\" required or authorised by law'. \"To obtain the information, the ONI director-general, Nick Warner--former head of the Australian Secret Intelligence Service--will have to first consult the agency and then make the request in writing. While the Australian Government Solicitor assessment acknowledges ONI's scope to collect information will widen, it says what it can do with it will be more restricted and there will be\" a stronger and more transparent regime for the handling and protection of personal information than currently exists for ONA \". The prime minister will be required to draft new privacy rules governing its handling and use. The inspector-general of intelligence and security said the rules should be made public, as for those applying to other agencies. A spokesman for the Department of the Prime Minister and Cabinet told The Saturday Paper they would be, except for any parts that could identify a classified capability. In the only other submission to the inquiry, the Law Council of Australia said the privacy commissioner should be consulted. The council says the ONI legislation should include privacy protection measures, such as requiring privacy impact assessments and yearly compliance audits, appropriate training and public reporting on the number of instances in which information is disclosed or used inconsistent with the privacy rules. The PM & C and ONA submission confirms the new ONI's role will reach beyond foreign intelligence assessments to also\" prepare strategic-level intelligence assessments on other matters of political, strategic or economic significance to Australia \". Combined with new laws on foreign interference, espionage and foreign influence, the arrangements also herald a new scrutiny of domestic political activity. The joint submission seeks to allay fears about ONI's role .\" In performing this function, ONI may have access to a greater amount of personal information [relating] to Australians, however, ONI's assessment focus will remain at the strategic, rather than the individual, level. \"The change reintroduces a focus on subversion absent from the remit of disrupting agencies such as the Australian Security Intelligence Organisation since the first Hope royal commission condemned its heavy-handedness in 1974. To date, the guidelines governing ASIO's work have limited its reach and effectively entrenched the right to peaceful protest and other lawful political activity in Australia. Those guidelines are being reviewed. ASIO remains a statutory authority but has moved from the Attorney-General's Department to Home Affairs. The head of the Strategic and Defence Studies Centre at the Australian National University, Professor John Blaxland, says the powers of the inspector-general of intelligence and security and the PJCIS need boosting to guarantee accountability in the new regime .\" Power can corrupt, and to avoid the people who are operating in a very secretive space from abusing that power, the checks on that power need to be robust, \"he said. Blaxland, who co-wrote the official history of ASIO, says the provisions of the Intelligence Services Act requiring warrants for actions against Australian citizens should be explicitly added to the ONI legislation but that the warrant system should also be updated. He says the inspector-general's expanded remit to cover the actions of all 10 agencies must also be explicit, to ensure her office is properly funded and resourced. Blaxland says that with the boundaries of illegal activity blurring, powers to let federal and state agencies interact and share information must also be spelt out. He echoed the argument that prompted the system overhaul--that without more cooperation, agencies can't keep ahead of national security threats .\" It's in that space between finding out something's wrong and getting the warrant and acting on the warrant that things can go pear-shaped, \"Blaxland says .\" That's what's leading intelligence practitioners to say this isn't fast enough. \"Centre Alliance senator Rex Patrick has drafted a private member's bill aimed at expanding the PJCIS's role beyond just scrutinising legislation and the intelligence agencies' administration and spending to include their operations--something now only open to the IGIS, who has the powers of an enduring royal commission. He says parliament should be wary of agencies' reach extending into ordinary Australians' political and private lives. Patrick says both the IGIS and PJCIS should be strengthened, pointing to Australia's international security partners--especially Canada--where legislatures play stronger watchdog roles .\" If the intelligence community won't trust elected members of parliament to examine their operations, at home and abroad, how can the parliament and public be fully confident that these very powerful agencies won't one day be turned to partisan advantage by the government of the day in what could amount to a high-tech police state? \"Former ONA analyst and now independent MP Andrew Wilkie is similarly concerned .\" I have a natural suspicion of anything in Australia that extends the power of the security services--the power of the state--because I believe Australia has already reached what I call a pre-police state, \"he says. But Wilkie takes\" zero comfort \"from calls to beef up the PJCIS, saying it has too few critical voices and tends to be\" hawkish \". Other security sources say the IGIS's power is appropriately greater. Wilkie is the only non-major-party MP to have served on the committee, after the Greens insisted then prime minister <mark>Julia Gillard</mark> appoint him as part of their minority government agreement. He is no longer a member and the committee again consists only of Liberal and Labor members, with governments believing minor parties and independents would undermine bipartisanship. Another former analyst, Clinton Fernandes, now professor of International and Political Studies at the University of New South Wales, says the various new laws may mean agencies more closely monitor the activities of environmental and other protest organisations. But he says ONI's central role as the new\" tsar \"of Australian intelligence is appropriate and suggests Wilkie is being\" a bit alarmist \".\" I would avoid the words \"police state',\" Fernandes says. \"The term he's looking for is\" surveillance state', or \"intelligence state'...The effect of this is to give ONI the ability to reach down and get any information they want .\" He says renewed monitoring for subversion made parliamentary oversight even more important. The PM & C spokesman said the government was still considering further oversight measures recommended in last year's review. The government is also introducing other security legislation that would sidestep privacy restrictions, to permit telecommunications and technology companies to hand over so-called backdoor access keys to their customers' encrypted information. The Assistance and Access Bill would allow the companies to enable access to encrypted sites, devices and applications voluntarily. It would also enable security agencies to force them to create and provide access if they refused, under threat of jail. And it gives ASIO the power to seek a warrant to demand passwords, PIN codes or fingerprints to unlock personal smartphones, either from the phone's user or from an associate with the information, with refusal punishable by up to five years' jail. After what the digital civil liberties group Digital Rights Watch calls \"a ridiculously short\" public consultation period in which 15,000 submissions were nevertheless lodged, the Coalition's party room approved the bill this week. The Greens are among those raising privacy concerns, warning it also creates a greater risk of hacking and will allow the information to be shared with Australia's \"Five Eyes\" partners--the US, Britain, Canada and New Zealand. \"It is akin to opening your mail, and allowing <mark>Donald Trump</mark> to read it over your shoulder,\" says Greens senator Jordon Steele-John. While the government dismisses the concerns, it's a prospect that might make even more people sit up and take notice. This article was first published in the print edition of The Saturday Paper on Sep 22, 2018 as \"Information overlord\". Subscribe here.", "articleID": "2018092115_00057715_W", "names": {"Karen Middleton": ["Q6369885", "Q6369887", "Q6369888"], "Margaret Stone": ["Q6759926", "Q6759927"]}}, {"date": "2018-09-24", "url": "http://www.indystar.com/story/news/2018/09/24/nickel-plate-trail-fishers-noblesville-projects-cost-keeps-rising/1370748002/", "content": "Nickel Plate Trail's price tag was once $9.3 M. Here's why a fraction will cost nearly that John Tuohy Indianapolis Star Published 6:00 AM EDT Sep 24, 2018 Nickel Plate Trail at 116th Steet Submitted by Fishers As Fishers begins designing its stretch of the Nickel Plate Trail, the estimated cost of the greenway to be built in partnership with Noblesville is climbing, prompting some trail opponents to allege taxpayers were duped. Fishers is budgeting $7 million to $9 million for construction of the first, 2-mile-long leg of the trail, a bill that comes close to the $9.3 million officials estimated for the whole 9-mile trail when plans were announced more than 1-1/2 years ago. The decision to build a tunnel or bridge, though likely the former, at 116th Street is a big reason for the sudden price bump. The passage will allow trail users to cross the busy street without stopping traffic. Fishers spokeswoman Ashley Elrod said the original $9.3 million estimate anticipated only the cost of laying down the concrete and asphalt for the trail path that will replace tracks in the Nickel Plate Rail corridor. Officials at the time could not say whether extra construction was needed to take bikers, joggers and walkers across the streets, she said. Dig this: Fishers plans tunnel under 116th for Nickel Plate Trail In Carmel: Midtown is rising: 8 projects totaling $231M \"The cost still remains about $1 million per mile, separate from the special crossings,\" Elrod said. A website maintained by the two cities, Nickelplatetrail.com, said the construction estimate was \"assuming standard crossings at intersections .\" Because 11 crossings are needed in Fishers, the cost could shoot even higher if planners find that bridges or viaducts are needed at other intersections, officials acknowledged. Nickel Plate Trail in Fishers to be built in 3 segments Fishers' 4.5-mile segment of the trail will be built in three stages. The first, from 106th Street to 126th Street, is likely to be the most expensive because of the crossing at 116th. The other sections are 96th to 106th and 126th to 146th. The trail will connect with the 4.5-mile section Noblesville plans, but that suburb won't start designing it for a couple of years. Down the line, observers say, a bridge or tunnel will probably be needed at busy 146th Street, a separated 4-lane road that borders the two cities. Train advocates have sued over trail Though Fishers is proceeding apace with the greenway, it still faces fierce opposition from train advocates, who object to tearing out the Nickel Plate railroad tracks to build it. They say the trail can be built alongside the tracks and have filed a series of unsuccessful lawsuits against the cities to halt construction. Logan Day, a member of Save the Nickel Plate, called the climbing cost estimate \"ludicrous\" and said it suggests the cities have not been upfront about the project. \"Our group saw this coming the minute they gave their original cost estimate, which we didn't think was realistic,\" Day said. \"But we had no idea the cost would go through the roof this fast. We feel this is a betrayal of the public trust .\" Save the Nickel Plate recently filed another suit in Hamilton Superior Court alleging that the cities and Hamilton County violated the state's Open Door Act when they held a series of meetings to pass trail-related measures. The suit contends the public either wasn't notified properly or wasn't allowed to speak when the Fishers Board of Public Works and Safety, Noblesville Board of Public Works and Safety, and the county commissioners took certain actions. The group wants a judge to stop the trail from proceeding. Fishers Mayor Scott Fadness called the legal action \"frivolous\" and \"uninformed\" and is seeking to get the suit dismissed. He notes that Noblesville and Fishers each held public meetings attended by scores of residents after they announced the trail plan, as did the Hoosier Heritage Port Authority. Rail preservation activists and others also filed petitions of objection to the federal Surface Transportation Board when the cities sought permission to remove the tracks. The board approved the plan earlier this year, but more objections have since been filed and are still pending. Fishers mayor: Bridge/tunnel would cost about $2.5 M Fadness said at a budget presentation last week that a bridge or tunnel would cost about $2.5 million. Elrod said the $7 million to $9 million dedicated to the first segment of the trail in Fishers also includes the cost of amenities--like bathrooms, water fountains, landscaping and art--alongside the trail. Any dedicated dollars left over would be used to begin building one of the other trail sections, she said. A proposed property tax hike would help repay a $12 million bond that will fund the first leg of the trail and other road and public works projects, Fadness said. The tax increase amounts to 4 cents per $100 in assessed property values--from 65 cents to 69 cents. Mike Colby, a member of the Fiscal Conservatives of Hamilton County, said he favored keeping the train tracks and opposes the trail because tax dollars could be better spent elsewhere. \"I think there are higher priorities, like repairing some of these private roads that the private land owners won't repair up to code,\" said Colby a former councilman. \"There are other areas of the city that need development attention .\" But Colby said he didn't see the cost of the trail ballooning to boondoggle levels. \"I think it will stay pretty close to what they said,\" said Colby. \"There are always cost overruns here and there due to unexpected things, like hidden utility lines .\" Carmel's Monon Greenway saw similar cost escalation The added costs for the crossings is similar to what happened when Carmel built the 5.2-mile Monon Greenway, which was finished in 2001 and connects to the Monon Trail in Indianapolis. The Carmel trail's cost was initially $1.6 million, with another $1.4 million for land acquisition. But since then the city has added a tunnel at 116th Street for $9 million and bridge over West Carmel Drive for $3 million. Now the city is spending $30 million to make the trail wider through Midtown and add parkland and other features. Carmel City Councilman <mark>Ron Carter</mark>, an avid bicyclist who was instrumental in planning the Monon in Carmel, said its economic benefits far outweigh the costs. Dozens of businesses have set up shop along the trail route, and home values have increased. Monon mural: Carmel to pay $42,000 for mural on Midtown parking garage Trail merger? Monon, Nickel Plate trails could form 50-mile loop under proposal \"It's a linear park, which is much cheaper to build than a box park,\" he said. \"You don't need people to administer it or run programs. People know what to do on it. You run and walk and bike and shop. No one has to tell you how to do that .\" <mark>Carter</mark> said tunnels and bridges, though expensive, are necessary at busy intersections for safety and to keep trail traffic moving and users happy. \"It's definitely worth the investment and something you have to do,\" he said. \"Especially because train tracks are in the middle of blocks .\" Two firms have nine months to finish the master plan for the Fishers trail. BBJ, a Seattle-based architectural firm, and Ex2 Partners of Indianapolis are being paid a combined $225,000 and will work together to design and promote the trail. The bid proposal the city sent out said the designers should plan a tunnel at 116th Street. The mayor's office said a tunnel is still most likely, but a bridge has not been ruled out. Call IndyStar reporter John Tuohy at 317 444-6418. Follow on Twitter and Facebook. Published 6:00 AM EDT Sep 24, 2018", "articleID": "2018092410_00024551_W", "names": {"Ron Carter": ["Q1622114", "Q17103444", "Q29843006", "Q434593", "Q6380147"]}}, {"date": "2018-09-24", "url": "https://www.cricket365.com/countries/englands-adil-rashid-agrees-all-format-deal-with-yorkshire/", "content": "cricket365 - September 24, 2018September 24, 2018 England spinner Adil Rashid on Monday agreed a new one-year all-format deal with his county, Yorrkshire. The new contract will see the 30-year-old make himself available for all forms of the game, continuing his 12-year affiliation with the White Rose county. Rashid, who made his first-class debut for Yorkshire in 2006, had initially signed a one-year contract at the start of the year so that he was only involved in one-day formats. But he was selected for England's recent home Test series against India, playing all five Tests in a 4-1 victory. He has also included for the tour to Sri Lanka in October and he will hope good form for Yorkshire can strengthen his claim for next summer's home Ashes. Yorkshire's Director of Cricket, Martyn Moxon, said: \"There's been a lot of talk and speculation but Adil is a very valuable cricketer for us .\" Now he's in the Test team, how much he'll be available for us next season is unclear. But when he is available we'd be delighted to have him and for him to be part of what would hopefully be a successful summer. \"For now, it will just be for a year because it's still not clear what career path he's going to take. He's back in the Test team and continues to do well, so we'll see where that takes us .\" Obviously going into 2020 and with the new competition, players are waiting to see how that will affect contracts. \"I think for now it's good to have the one year and see how the winter goes for Adil. We'll probably have another look at it after the World Cup and see where he is, particularly with England and how much he's involved with them .\" In the short-term it's good to know when he's available he'll be playing for us. \"Rashid has taken 500 first-class wickets at an average of 34.98. All of his 10 hundreds have come for the White Rose. The leg-spinner made his Test bow in 2015 on tour of the UAE against Pakistan and has made 15 appearances to date in te longest format. Rashid was recently told by England selector <mark>Ed Smith</mark> that he must be available across the board from the start of next summer to be considered for Test cricket. Moxon continued:\" It was a big surprise that he wanted to play white ball only and asked us for a white-ball only contract. That changed very quickly and unexpectedly so that created a bit of confusion and instability for a little while. \"But I think we've been clear from the outset that we wanted to keep Adil at the club. When it became known he had to have a red-ball contract, we were more than happy to put that in place .\" Speaking to Adil he's keen to stay here and has been here all his life. He's in no mood to change that. We're really pleased to keep him. \"We all know he's a matchwinner for us. Leg-spin bowlers, wrist-spin bowlers are vital part of the game and that's what we want from Adil, that potential to be a matchwinner for us in all formats .\" Share on Facebook Share Share on Twitter Tweet Send email Mail Countries County Cricket England News Top Story", "articleID": "2018092411_00073998_W", "names": {"Ed Smith": ["Q1282498", "Q28935720", "Q5335419", "Q5335422", "Q5335423", "Q5335424", "Q5335426"]}}, {"date": "2018-09-25", "url": "http://denverbroncos.com/news/broncos-high-school-coach-of-the-week-derrick-martin", "content": "Saturday, Sep 22, 2018 05:54 PM Copied! Broncos High School Coach of the Week: Derrick Martin Photo taken by Dustin Price / dustinpricephotography.com Derrick Martin is no stranger to a championship atmosphere. The 2003 graduate of <mark>Thomas Jefferson</mark> High School has been to the very top of the highest mountain when it comes to football. Among his collection of memorabilia from his time in the NFL are two Super Bowl rings. One with the Green Bay Packers and one with the New York Giants. Martin's last season in the NFL was 2013 and it was in March of 2016 that he was chosen to revitalize his alma mater. This year, his efforts have paid off as he has the Spartans sitting at 4-0 after a 44-0 win over Northfield on Friday. His path through high school football, a Division I college program and the NFL has been one that he feels fortunate enough to be able to share with kids once stood in his very shoes. \"I can say that most of my (learning) experiences are from high school,\" he said. \"It's crazy because not too much has changed at <mark>Thomas Jefferson</mark> in terms of the hallways so I can put myself in their same environment and guide them and tell them things that I didn't do that I wish I would have .\" Having the chance to offer up life lesson is just as valuable to Martin as being able to pass on football lessons. He buys into his kids as human beings and not as football players. They've rewarded him by taking care of what he asks them to on and off the field. For that reason, Martin was selected as this week's Denver Broncos High School Coach of the Week. Years as a head coach: 3 (20-5 overall record) Years at <mark>Thomas Jefferson</mark>: 3 (20-5, 4-0 this season) Previous coaching stops: None. Q: Why do you coach? Martin: I coach for the kids. I like being out there with the kids just to be out there and drop some knowledge on them and hopefully some lifelong lessons that they can pick up as human beings. Q: What do you think it's like for your players to be coached by a former D-I standout and Super Bowl champion? Martin: I think it's hard. I have high expectations for my guys and I've been in the same situation as a lot of them so I can put myself in their shoes. They know I'm telling the truth. Anything that comes out of my mouth is first-hand experience. Q: What are your favorite coaching memories? Martin: Oh man, I don't know. It was fun to beat (Denver) South this year. South has been a powerhouse in the DPS for several years. To play them for the first time in a long time and beat them was pretty awesome. Q: Does this experience, especially starting 4-0 this year, let you go back and remember just how much fun the high school football world is? Martin: Yeah, it's funny, I was actually talking to one of my former coaches kind of about that. We're playing a (Class) 3A schedule and I feel like we have the same number of kids that we had back then (when <mark>Thomas Jefferson</mark> was 4A). For me, it puts things in perspective of the atmosphere of the 3A, 4A, 5A landscape. Q: From a football standpoint, how does it feel emotionally when you've accomplished something like winning a Super Bowl compared to having a kid grow and develop according to the plan you've built for him? Martin: It's crazy. I have a running back who I think is the best in the state in Daveon Hunter. He just turned 16. He's just a kid. We had to tell him his freshman year that he had to workout, he had to watch film and to see that he's done that and now that he's on the field and he's not supposed to be there is an accomplishment. You give these guys the potion and once they figure it out, it's astonishing to see how it changes their passion for the game. Story by Dan Mohmann / CHSAANow Photo taken by Dustin Price / dustinpricephotography.com.", "articleID": "2018092500_00151994_W", "names": {"Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}}, {"date": "2018-09-25", "url": "http://www.comingsoon.net/movies/trailers/986957-new-a-star-is-born-teaser-previews-lady-gaga-song-is-that-alright", "content": "By Maggie Dela Paz ON September 25, 2018 BEGIN SLIDESHOW New A Star is Born teaser previews Lady Gaga song \"Is That Alright?' Lady Gaga took to Twitter to release a new teaser for Warner Bros.. Pictures\" s upcoming A Star is Born featuring a short preview of one of the films' song \"Is That Alright?\" The ballad track was written by Gaga along with other collaborators including \"Born This Way\" producer DJ White Shadow and Lukas Nelson. Check it out below! RELATED: A Star is Born Soundtrack Now Available For Pre-Order A Star is Born stars four-time Oscar nominee <mark>Bradley Cooper</mark> (American Sniper, American Hustle, Silver Linings Playbook) and multiple award-winning, Oscar-nominated music superstar Lady Gaga (as Stefani Germanotta), in her first leading role in a major motion picture. <mark>Cooper</mark> helms the drama, marking his directorial debut. In this new take on the tragic love story, <mark>Cooper</mark> plays seasoned musician Jackson Maine, who discovers--and falls in love with--struggling artist Ally (Gaga). She has just about given up on her dream to make it big as a singer...until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons. The cast of A Star is Born also includes Andrew Silverstein (aka Andrew Dice Clay), with Dave Chappelle and Sam Elliott. RELATED: A Star is Born Trailer Starring <mark>Bradley Cooper</mark> & Lady Gaga In addition to playing Ally, Gaga, who earned her Oscar nod for the song \"Til It Happens to You\" from The Hunting Ground, performs original songs in the film, which she wrote with <mark>Cooper</mark> and a handful of artists, including Lukas Nelson, Jason Isbell and Mark Ronson. All the music is original and was recorded live. A Star is Born is being produced by Bill Gerber, <mark>Jon Peters</mark>, <mark>Bradley Cooper</mark>, <mark>Todd Phillips</mark> and Lynette Howell Taylor; with Basil Iwanyk, Michael Rapino, Heather Parry and Ravi Mehta serving as executive producers. The screenplay is by Will Fetters & <mark>Bradley Cooper</mark> and Eric Roth, based on the 1954 screenplay by Moss Hart and the 1976 screenplay by <mark>John Gregory</mark> Dunne & Joan Didion and Frank Pierson, based on a story by William Wellman and <mark>Robert Carson</mark>. The feature will arrive in theaters on October 5, 2018. Is that alright? #AStarIsBorn pic.twitter.com/aTsNiTmMXD--Lady Gaga (@ ladygaga) September 25, 2018 4 images SHARE TWEET Show Comments Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2018092515_00080540_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"], "John Gregory": ["Q28016802", "Q49783724", "Q55739798", "Q6236260", "Q942124"], "Jon Peters": ["Q2563751", "Q27983586"], "Robert Carson": ["Q3434739", "Q43911818"], "Todd Phillips": ["Q362824", "Q7812568"]}}]