[{"date": "2018-09-25", "url": "https://forums.macrumors.com/threads/apples-bud-tribble-to-offer-support-for-comprehensive-federal-privacy-legislation-at-senate-hearing-on-wednesday.2142912/", "content": "Apple's Bud Tribble to Offer Support for \"Comprehensive Federal Privacy Legislation' at Senate Hearing on Wednesday #1 Apple is sending longtime employee and Vice President of Software Technology Bud Tribble to a Senate Commerce Committee hearing on Wednesday to offer support for federal privacy regulations, reports. According to Tribble's prepared statement obtained by Axios, he plans to\" convey Apple's support for comprehensive federal privacy legislation that reflects Apple's long-held view that privacy is a fundamental human right. \"Tribble will echo sentiments that Apple executives have shared time and time again, explaining Apple's belief that customers have a right to keep their personal information private, a stance that differs from companies like Facebook and Google. Back in June, Apple CEO <mark>Tim Cook</mark> said in an interview that privacy\" from an American point of view \"is one of the\" key civil liberties \"defining what it means to be American. <mark>Cook</mark> has also said multiple times that Apple's customers are not its product .\" We could make a ton of money if we monetized our customers, \"<mark>Cook</mark> said in March .\" If our customers were our product. We've elected not to do that. We're not going to traffic in your personal life. \"Tribble will be testifying before the US Senate Committee on Commerce, Science, and Transportation alongside representatives from other tech and media companies that include Amazon, Twitter, Google, AT & T, and Charter Communications. Ahead of the meeting, the National Telecommunications and Information Administration, part of the U.S. Department of Commerce, released a proposal for consumer data privacy protection and is seeking public comment. The NTIA is asking for feedback on certain desired outcomes for organizational practices: [*] Organizations should be transparent about how they collect, use, share, and store users' personal information. [*] Users should be able to exercise control over the personal information they provide to organizations. [*] The collection, use, storage and sharing of personal data should be reasonably minimized in a manner proportional to the scope of privacy risks. [*] Organizations should employ security safeguards to protect the data that they collect, store, use, or share. [*] Users should be able to reasonably access and correct personal data they have provided. [*] Organizations should take steps to manage the risk of disclosure or harmful uses of personal data. [*] Organizations should be accountable for the use of personal data that has been collected, maintained or used by its systems. These are the same kind of topics that will be explored during the privacy-focused Senate hearing, which is designed to\" examine the privacy policies of top technology and communication firms \"as well as review the\" current state of consumer data privacy. \"Note: Due to the political nature of the discussion regarding this topic, the discussion thread is located in our Politics, Religion, Social Issues forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts. Axios Quote\" We want your device to know everything about you; we don't feel that we should, \"he'll say .\" These concepts have guided our design process for years because privacy is a core value at Apple, not an obligation or an aftermarket add-on. \"Click to expand...Never heard of that guy before, on reading the title I thought - what's a Bud Triddle? #6 CarlJ said: ↑ This seems like an exceptionally good idea. The list of points seem quite reasonable, and hard to argue against it being a good idea. Not sure why this needs to be in PRSI. Someone will probably be along shortly to prove the need. Click to expand...Since it's about potential law it's definitely political simply by nature. Either way I suspect 99% of posters will support this idea as we all know what bunk it is to wreck encryption wholesale just because (once again) authorities want to throw around\" national security \"in order to do ridiculous things and give powerful tools to people who have proven they can't properly secure what they already have. #11 It is big for Apple to do this. One of their key competitive advantages is their stance on privacy and how that informs every aspect of what they do. It is better for the long-term survival of our union to have privacy listed as a fundamental human right, but in some ways it weakens their position in the market. If Google was held to the same standard as Apple when it comes to privacy, I'd be more inclined to use Google's software and services. Would I actually end up using them? Maybe not, but for me privacy and security are the #1 top concern, followed by design and use of use.", "articleID": "2018092517_00197983_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}, {"date": "2018-09-27", "url": "https://www.scotsman.com/news/opinion/bill-jamieson-an-snp-labour-coalition-at-westminster-is-not-impossible-1-4805700", "content": "Bill Jamieson: An SNP-Labour coalition at Westminster is not impossible Published: 06:00 Thursday 27 September 2018 Share this article Sign Up To Our Daily Newsletter Sign up Have your say Ahead of us, an impasse: Brexit negotiations as good as paralysed; a Prime Minster trapped in a hole of her own making; a deeply divided Conservative Party; a Labour opposition pledged to oppose Chequers; Brexiteers equally opposed; and growing calls for a second referendum--possibly with the option to abandon Brexit and stay in the EU: if you thought politics was the art of the possible, today it is about making the impossible a reality. The impasse we face looks grim. Tomorrow looks little better. We are trapped in a politics of exasperation. But the day after tomorrow? How about this \"impossibility\" ? Few would rule out a general election over the next year. With Tories and Labour neck and neck, another minority government is no remote outcome. And in that event, how about the \"impossibility\" of a Labour-SNP coalition? Fanciful, you may think. The two parties are not just opposed--they can't stand each other. They would no more sit together than buddy up to Jacob Rees-Mogg at a monarchist rally. And has not Scotland's Labour leader <mark>Richard Leonard</mark> this week ruled out support for a second independence referendum? But note also this: Scotland should have major land reform with new rules to tax foreign and absentee landlords; an extra £ 3.7 billion for public services through a \"windfall' tax on the richest 10 per cent in Scotland to combat income and wealth inequality; ring-fencing of hundreds of millions of pounds of state aid funding for foreign-owned businesses and redirect it towards Scottish companies to re-train staff and save manufacturing jobs. Some £ 222 million has been handed out since 2007 in Regional Selective Assistance (RAS) to foreign-owned companies, compared to £ 140.7 million that has gone to Scottish-owned firms. The total amount of RAS has also fallen by 80 per cent since 2007. Such a programme would bring an SNP conference to its feet with cheers and stamping of feet. But these were not pronouncements from the SNP. They came from the same <mark>Richard Leonard</mark> at the Labour conference this week--the one in which the Shadow chancellor also pledged that rail, energy and mail services would join Scottish Water in public ownership, that the bosses of these companies should be made to seek re-election and their bumper pay packets substantially cut. There would be tough penalties for tax evasion and a new employees' share scheme giving workers dividends of up to £ 500. What SNP heart would not warm to such a programme? It is, after all, an unarguably Left-leaning party, a passionate advocate of bigger government, higher taxes on the wealthy, achingly liberal in social policy, and avowedly anti Brexit. As for economic policy, former SNP MP George Kerevan, the Antonio Gramsci of the party's economic gurus, would love it. And the Green Party MSP Andy Wightman would be doing cartwheels: would this not bring him closer than he has ever been to achieving his land reform dreams? But what of <mark>Leonard</mark>'s opposition to a second indyref? Would not this stand in the way of some form of coalition pact that would put Jeremy Corbyn in Downing Street? Yet how intoxicating is the nectar of political power when close to the olfactory senses: the nearer the deal-brokers approach, the more powerful it becomes. Is it really beyond the art of the possible that some contrivance of words could be constructed with which both sides could live -\" plausible ambiguity \"in Brexit parlance? Here, indeed,\" the art of the possible \"comes into its own. And after all, if Labour can be so cavalier in dropping its earnest protestations that it would\" respect \"(sic) the outcome of the 2016 EU referendum, who could rule out a similar somersault on its views on a second indyref? Is our paralysed politics today not truly entering the realms of the surrealist writer Peter Pomerantsev where\" Nothing Is True and Everything Is Possible \"? It is in this spirit that we should view the declaration this week of shadow chancellor <mark>John McDonnell</mark>:\" The greater the mess we inherit, the more radical we have to be; the greater the need for change, the greater the opportunity we have to create that change and we will. \"In time-honoured political tradition, words can be made to mean whatever the speaker wants them to mean--and which may be quite different from what the audience hears them to mean. Take Mr <mark>McDonnell</mark>'s declaration about share ownership by employees. He invoked the example of the <mark>John Lewis</mark> Partnership. But that is not what is on offer. The shares would not be given to the employees but would be held by a state-mandated committee which would distribute up to £ 500 of any share dividend to each employee. The committee would hold the rest and pass it back to the Treasury--Corporation Tax by another name. Who would exercise the voting rights? Employees would not enjoy a sense of direct equity participation in the affairs of the company, and no direct holding over which they had control to build on or sell as they wished. As such, it is a poor substitute for the scheme introduced by former Labour chancellor <mark>Gordon Brown</mark>--the\" All Employee Share Ownership Plan' or Share Incentive Plan. This provided a stronger basis for individual employee participation and retention of capital value, and is the most tax efficient UK investment plan in existence (more so than personal pensions). Perhaps Tory chancellor <mark>Philip Hammond</mark>, to spike Labour's guns, could unveil an updated and extended model in his November budget. But the Conservatives have already surrendered ground to the Left - on tax, health spending and social housing policy. It is in ideological disarray. A Labour-SNP coalition is thus by no means impossible--indeed it increasingly looks a plausible runner. And in the absence of an inspiring electoral alternative, what could possibly stymie it? Perhaps this: the prospect of a raucous whooshing sound as capital and people start heading for the exits. Hard Labour, asset seizure, higher tax and a grasping state: not at all \"impossible\" once the populist wagons roll. Follow Us On", "articleID": "2018092705_00034086_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Philip Hammond": ["Q18388174", "Q332987"], "Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"]}}, {"date": "2018-09-28", "url": "https://www.mortgagefinancegazette.com/market-news/funding/new-investor-pumps-60m-masthaven-28-09-2018/", "content": "New investor pumps £ 60m into Masthaven By Joanne Atkin in Company news, Funding 28th September 2018 0 Global alternative investment firm Värde Partners is to make a strategic £ 60 million equity investment into specialist bank Masthaven, subject to regulatory approval from the Bank of England. The investment, along with Masthaven's existing capital base, will enable the bank to significantly increase lending to consumers and SMEs over the next three to five years and provide deposit solutions to its customers. Masthaven serves borrowers without access to the traditional high street banks, and has seen significant growth in its chosen market niches--namely retail savings, SME lending, short - and long-term property financing across commercial, buy-to-let and specialist residential real estate. Värde Partners, a $14 billion global alternative investment firm, has more than 20 years of experience investing in consumer and commercial credit in the specialty finance sector. Andrew Bloom, Masthaven's founder and CEO, said: \"In Värde Partners we have chosen our strategic partner for the next phase of the continued journey of Masthaven bank. Our original investors remain committed to the bank--what Värde Partners brings to the table is the commitment, experience and firepower to take us to the next level .\" \"Masthaven has made tremendous strides in the past few years and, since our launch of the bank two years ago, we have successfully launched specialist residential and buy-to-let mortgages, plus bolstered our savings suite by entering the SME savings market, all while growing our team to above 170 people and generating over £ 0.5 billion of deposits .\" Now it's time for us to further enhance our propositions for both our existing customers and intermediary partners as well as our future clients. Masthaven will use the investment to bring more capacity to the UK market and enable us to innovate in terms of both our savings and lending propositions. \"Elena Lieskovska, senior managing director and head of European specialty finance at Värde Partners, said:\" Masthaven is an exciting brand in the UK challenger bank scene and we're thrilled about the opportunity to work together to hone the bank's proposition and to take it to the next level. \"At Värde, we are active in our portfolio companies, favouring the partnership approach to creating value, and that's exactly how we expect to work with the Masthaven team .\" <mark>Michael Baker</mark>, Managing Director Joint Ventures at The William Pears Group, Pears being an investor in Masthaven, said: \"We've backed Masthaven Finance since 2011 together with the launch of Masthaven Bank in 2016 and are pleased to welcome Värde Partners as a new investor and look forward to them being part of the next phase in Masthaven's journey .\" Masthavem Värde Partners 2018-09-28 Joanne Atkin Share Twitter LinkedIn", "articleID": "2018092809_00063727_W", "names": {"Michael Baker": ["Q20090207", "Q22030053", "Q22906618", "Q41804624", "Q52222700", "Q54932801", "Q6828371", "Q6828372"]}}, {"date": "2018-09-28", "url": "http://www.bostonherald.com/news/national/2018/09/the_latest_trump_says_ford_was_credible_witness", "content": "WASHINGTON--The Latest on the Supreme Court nomination of Brett Kavanaugh (all times local): 2:35 p.m. President <mark>Donald Trump</mark> says he found Christine Blasey Ford, who accused Supreme Court nominee Brett Kavanaugh of sexually assaulting her in high school, \"a very credible witness .\" <mark>Trump</mark> told reporters Friday at the White House that he thought Ford's testimony Thursday to the Senate Judiciary Committee \"was very compelling\" and that \"she looks like a very fine woman, very fine woman .\" But <mark>Trump</mark> also says he though Kavanaugh's adamant denial \"really something that I hadn't seen before. It was incredible .\" <mark>Trump</mark> called it \"an incredible moment I think in the history of our country .\" The Senate Judiciary Committee voted Friday to advance Kavanaugh's nomination to the Senate floor--but Arizona Sen. Jeff Flake said the full Senate vote should be delayed for a week. __ 2:25 p.m. Republican Sen. Lindsey Graham says it's going to fall to him to lay out to President <mark>Donald Trump</mark> why Brett Kavanaugh's Supreme Court confirmation vote has been delayed. He spoke after Arizona Sen. Jeff Flake said he would vote to advance Kavanaugh's nomination to the full Senate only if the final confirmation vote is delayed for an FBI investigation into sexual assault allegations. Christine Blasey Ford says Kavanaugh attacked her in a locked room at a high school house party. Kavanaugh denies that. The Senate Judiciary Committee voted Friday to advance the nomination to the full Senate, but Senate Judiciary Chairman Chuck Grassley noted the timing on Senate vote was up to Senate Majority Leader Mitch McConnell. Graham, of South Carolina, is a <mark>Trump</mark> ally who is on the panel. Graham told reporters after the committee vote that somebody is going to have to explain the delay to <mark>Trump</mark>. Graham added: \"I guess that'll be my job .\" __ 2:18 p.m. President <mark>Donald Trump</mark> says he'll leave it to the Senate to determine when it will vote on his Supreme Court nominee Brett Kavanaugh. But <mark>Trump</mark> is expressing optimism, saying: \"I'm sure it will all be very good .\" <mark>Trump</mark> told reporters Friday during a meeting with the President of Chile that undecided Republican senators \"have to do what they think is right\" and \"be comfortable with themselves\" on the Kavanaugh vote. But he said he hadn't thought at all about a replacement, \"Not even a little bit .\" The Senate Judiciary Committee voted Friday along party lines to advance Kavanaugh's nomination to the Senate floor. But Sen. Jeff Flake of Arizona said at the last minute that he could not promise to vote for Kavanaugh on the Senate floor and called for a delay of up to a week for a further investigation of sexual assault accusations. Kavanaugh has denied the allegations. __ 2:10 p.m. Sen Jeff Flake says Brett Kavanaugh's Supreme Court nomination should on hold so the FBI can investigate the sexual misconduct allegations against him. Flake, the deciding vote in the Senate Judiciary Committee, voted to advance Kavanaugh's nomination to a full floor vote, but said the vote should be delayed for up to a week to allow time for the investigation of Christine Blasey Ford's claims. Ford says Kavanaugh sexually assaulted her while the two were in high school. Kavanaugh has denied Ford's accusation. __ 2 p.m.. The Senate Judiciary Committee has voted along party lines to advance Brett Kavanaugh's Supreme Court nomination to the Senate floor. The 11-10 vote Friday came just one day after Republicans heard testimony from Christine Blasey Ford, who accused Kavanaugh of sexually assaulting her when they were teens. Kavanaugh denied the accusation. At the last minute, Sen. Jeff Flake of Arizona, said he could not promise to vote for Kavanaugh on the Senate floor and called for a delay of up to a week for a further investigation. Republicans voted to move ahead with Kavanaugh's nomination. Senate Judiciary Chairman Chuck Grassley noted the timing on Senate vote was up to Senate Majority Leader Mitch McConnell. __ 1:40 p.m.. The Senate Judiciary Committee was supposed to be voting at 1:30 p.m. Friday on whether to recommend Brett Kavanaugh's confirmation, but something is afoot. Behind-the-scenes negotiations have delayed the committee vote on Kavanaugh's nomination. It wasn't clear what was being discussed. Republicans believed they had to votes to advance Kavanaugh out of the committee when Sen. Jeff Flake announced his support earlier Friday. But senators seated in the hearing room are talking among themselves--and Flake is not seated. Some senators have stepped out of the room. __ 1:10 p.m. Senate Republicans do not yet have the votes to confirm Brett Kavanaugh to the Supreme Court. That's according to Sen. <mark>John Thune</mark> of South Dakota, the third-ranking member of Republican leadership. <mark>Thune</mark> said that Republicans still have \"a little work to do\" to get enough support. Whether Kavanaugh is confirmed to the Supreme Court could hinge on the votes of two Republican senators: <mark>Susan Collins</mark> of Maine and Lisa Murkowski of Alaska. It does not appear that President <mark>Donald Trump</mark> or the White House is reaching out to them to try and influence their decision. <mark>Thune</mark> said while such calls may be well-intended, \"it's better to let people decide on their own up here .\" Republicans have set a committee vote for Friday afternoon to send Kavanaugh's nomination to the full Senate. __ 1:10 p.m. Democratic Sen. Heidi Heitkamp of North Dakota says \"there are a lot of lawyers in America who can sit on the court\" and Brett Kavanaugh isn't the only person who can do the job. Heitkamp said Friday she hasn't decided whether to support Kavanaugh's confirmation to the Supreme Court. But her remarks to the AP suggest she may vote no. Heitkamp is facing a tough re-election this year in a Republican-leaning state. Her decision on Kavanaugh is being closely watched. She said she found testimony from both Kavanaugh and Christine Blasey Ford, who accused him of sexual assault, \"compelling\" but \"this is not a criminal case .\" Heitkamp says appointees \"don't all have to come from Harvard and Yale and they don't all have to come from prep schools __ 12:40 p.m. Montana Sen. Jon Tester says he will join other Democrats in voting against Supreme Court nominee Brett Kavanaugh. Tester is up for re-election this year in his deeply Republican home state. But he said he has concerns about Kavanaugh's positions on privacy issues, campaign finance and about a California professor's claim that he sexually assaulted her when both were teenagers. Kavanaugh denied Christine Blasey Ford's allegations in a hearing Thursday. Tester said he has requested a meeting with Kavanaugh\" numerous times \"but the White House wouldn't commit. The Montana senator said his office had received\" thousands of calls and emails from Montanans \"about Kavanaugh, a majority of which were opposed to his confirmation. ___ 12:30 p.m.. The dean of Yale Law School is calling for additional investigation into sexual misconduct allegations against Brett Kavanaugh before the Senate votes on his nomination to the U.S. Supreme Court. Dean Heather Gerken said in statement Friday that she agrees with the American Bar Association that more investigation is needed. Gerken said proceeding with the confirmation process without more review is not in the best interest of the Supreme Court or the legal profession. Kavanaugh received his undergraduate and law degrees from Yale. The Senate Judiciary Committee is scheduled to vote on Kavanaugh's nomination Friday afternoon. A vote in favor will send the nomination to the full Senate. Kavanaugh denies allegations by Christine Blasey Ford that he assaulted her when they were in high school. Kavanaugh says he's never sexually assaulted anyone. ___ 11:50 a.m. Democratic Sen. Joe Donnelly says he'll vote against the confirmation of Supreme Court nominee Brett Kavanaugh. Donnelly is a moderate Democrat who voted for President <mark>Donald Trump</mark>'s first nominee to the high court, Neil Gorsuch (GOR' - suhch). Donnelly is up for re-election this year in Indiana, which is a strongly Republican state. His decision comes after a hearing Thursday when a California professor testified that Kavanaugh sexually assaulted her in high school when they were teenagers. Kavanaugh also testified and denied Christine Blasey Ford's allegations. Donnelly says Ford's allegations are\" disturbing and credible \"and should be investigated by the FBI, which <mark>Trump</mark> and Senate Republicans say isn't needed. ___ 11:45 a.m. Anita Hill says one of the things that stood out to her from Supreme Court nominee Brett Kavanaugh's testimony was how emotional and angry it was compared with the\" calm \"words coming from the woman accusing him of sexual assault when they were teenagers. Kavanaugh denies the accusation. Hill gave Senate testimony in 1991 about her allegations of sexual harassment by then-Supreme Court nominee Clarence Thomas. Hill--speaking Friday in Houston--says Kavanaugh\" was able to express a real anger, an aggression, as well as a lot of emotion. \"She said no woman nomination to the high court\" would ever have the license to express (herself) in that way. \"Hill says she was impressed with the calm and careful testimony of Kavanaugh's accuser, Christine Blasey Ford. ___ 11:40 a.m. Sen. John Cornyn of Texas says it is\" cruel \"and\" indecent \"for Democrats to seek public testimony from Mark Judge, a high school friend of Supreme Court nominee Brett Kavanaugh. Judge has told the committee in a signed statement that he doesn't recall the events described by Christine Blasey (BLAH' - zee) Ford. She accuses Kavanaugh of sexually assaulting her when they were teens. Kavanaugh denies the accusation. Ford has told senators that Judge was in the room during the alleged assault. Democrats have asked for the committee to subpoena Judge, but Republicans have voted down the request. Cornyn says Judge admits to being a recovering alcoholic and is a cancer survivor. Cornyn says Democrats are ignoring that and seeking to\" drag Mr. Judge into this circus-like atmosphere \"and subject his battles with addition to public ridicule. In Cornyn's words:\" That is cruel. That is reckless. That is indecent. \"___ 11:10 a.m. CNN cameras caught an extraordinary scene of Arizona Sen. Jeff Flake being confronted by two protesters as he waited in an elevator to take him to the Senate Judiciary Committee meeting. Moments earlier, Flake had announced he'd vote to confirm Supreme Court nominee Brett Kavanaugh. Flake stood looking downcast as one of the women said to Flake:\" Tell me, I'm standing right here in front of you, do you think he's telling the truth to the country? \"The senator listened for nearly two minutes until the elevator door closed. He told the women he had put out a statement and would have more to say before the committee. CNN's Jim Scutto said:\" I don't think we've witnessed a moment like that in recent memory. \"___ 10:50 a.m.\" Feels like Alice in Wonderland. \"That's what a top Democrat says about the Senate Judiciary Committee in moving forward with Brett Kavanaugh's nomination to the Supreme Court. Vermont's Patrick Leahy is denouncing the way that majority Republicans have handled Kavanaugh's nomination. Leahy says the committee has lost its independence and become, in his words,\" an arm, and a very weak arm, of the <mark>Trump</mark> White House. \"The committee has set a vote for later Friday on whether to recommend the nomination to the full Senate. Leahy says Kavanaugh has been\" credibly accused of sexual assault \"and the committee has failed to conduct a meaningful investigation. Christine Blasey Ford testified Thursday that Kavanaugh sexually assaulted her when they were teens. Kavanaugh says the accusation is\" categorically \"false. ___ 10:30 a.m. Sen. Dianne Feinstein (FYN' - styn) says the Supreme Court nomination of Brett Kavanaugh is\" a real test \"for the Senate and the nation\" to see how we treat women, especially women who are survivors of sexual assault. \"The top Democrat on the Senate Judiciary Committee says that 27 years after the Clarence Thomas hearings, Republicans appear to have a new strategy for handling sexual assault allegations. She says,\" The Republican strategy is no longer \"attack the victim .' It is to ignore the victim .\" Feinstein says she's disappointed the committee is set to vote on Kavanaugh's nomination less than a day after emotional testimony by Kavanaugh and Christine Blasey Ford, who accuses Kavanaugh of sexually assaulting her when both were teenagers. He denies the allegation. ___ 10:25 a.m.. The wife of Justice Clarence Thomas is praising Sen. Lindsey Graham for his criticism of Senate Democrats for their treatment of Supreme Court nominee Brett Kavanaugh. Ginni Thomas says on her Facebook page \"Thank you, Senator Graham, for speaking for so many of us!\" Thomas included a link to video from Graham's fiery comments Thursday when he called the Democrats' actions the \"most despicable thing\" he has seen in politics. The link says Graham \"exposes Democrat Kavanaugh sham .\" Ginni Thomas is a conservative activist who once worked for congressional Republicans. She made headlines in 2010 when she called Anita Hill and asked Hill to apologize for making sexual harassment allegations about Clarence Thomas after he had been nominated to the Supreme Court. ___ 10:15 a.m. Several Democrats on the Senate Judiciary Committee have walked out of a hearing on Brett Kavanaugh's nomination to the Supreme Court. Kamala Harris of California, Mazie Hirono of Hawaii, Richard Blumenthal of Connecticut, Sheldon Whitehouse of Rhode Island left after the GOP chairman set a vote on the nomination for 1:30 p.m. Friday. That was approved by a committee vote. Democrats say Republicans are rushing the confirmation. During that vote, Hirono yelled: \"\"I strongly object! What a railroad job! No, no, NO .\" ___ 10:05 a.m. Republicans have blocked Democratic efforts to subpoena a high school friend of Supreme Court nominee Brett Kavanaugh who's been described as a witness to an alleged assault involving Kavanaugh about three decades ago. The Senate Judiciary Committee's vote to subpoena Mark Judge has been defeated in a party-line vote, with all 11 Republicans on the panel voting against the motion and all 10 Democrats voting for it. Democrats say Judge has never been interviewed by the FBI or questioned by a member of the committee, and that committee has a responsibility to subpoena Judge before it votes on whether to recommend Kavanaugh to the full Senate. Kavanaugh denies the allegation. The committee chairman, Iowa Republican Chuck Grassley, has read a statement from Judge that says he doesn't recall the events described by Kavanaugh's accuser and \"never saw Brett act\" in the way that he's accused of. ___ 10 a.m.. The Senate Judiciary Committee is set to vote at 1:30 p.m. on whether to recommend Supreme Court nominee Brett Kavanaugh's nomination to the full Senate. The chairman, Iowa Republican Chuck Grassley, announced the vote as the committee began its meeting. Kavanaugh has just picked up a key vote of support from a committee Republican, Arizona's Jeff Flake. Republicans have slim 11-10 majority on the committee. With Flake's support, Kavanaugh's nomination is expected to clear the committee and go to the full Senate. The Senate could begin taking procedural votes over the weekend ahead of a final confirmation vote early next week. ___ 9:55 a.m. Emotions in the Capitol are running high over the Supreme Court nomination of Brett Kavanaugh. Soon after Republican Sen. Jeff Flake announced he'd vote to confirm Supreme Court nominee Brett Kavanaugh, he was cornered by two women as he got into an elevator to head to the Senate Judiciary Committee. Through tears, the women implored him to change his mind about his Kavanaugh vote. The women were seen in TV footage blocking the Arizona senator from closing the elevator door. One woman begged Flake to look him in the eye. She said: \"Look at me and tell me that it doesn't matter what happened to me .\" Another woman said Flake was allowing someone who \"violated someone\" to serve on the Supreme Court. Both women cried as they spoke to him. Eventually a member of Flake's staff said they needed to go and the doors closed. A committee confirmation vote is set for 1:30 p.m. Kavanaugh has denied that he sexually assaulted a woman when they were teenagers. The committee on Thursday heard emotional and sometimes combative testimony from both Kavanaugh and his accuser. ___ 9:40 a.m.. It'll be a \"yes\" vote on Brett Kavanaugh from one of the most closely watched Republican senators who's determining the fate of the Supreme Court nominee. The announcement from Arizona's Jeff Flake that he'll vote to confirm Kavanaugh virtually ensures that the nomination will advance to the full Senate from the Judiciary Committee. The committee is expected to vote Friday--and if the nomination advances to the full Senate, then senators could begin voting as early as Saturday. Flake says he wishes he could express the confidence in Kavanaugh that some of his other GOP colleagues have. But Flakes says in a statement he still has \"much doubt\" after the committee's explosive hearing Thursday. Kavanaugh has denied Christine Blasey Ford's allegation that he sexually assaulted her when they were teenagers. Flake says that without evidence to corroborate Ford's story, he believes \"our system of justice affords a presumption of innocence .\" ___ 9:10 a.m.. A Democratic senator who's facing a tough re-election race has come out against President <mark>Donald Trump</mark>'s Supreme Court nominee, Brett Kavanaugh. <mark>Bill Nelson</mark> of Florida tweets that he'll vote \"no\" if the nomination comes to the full Senate. The Senate Judiciary Committee is set to vote on Kavanaugh on Friday. <mark>Nelson</mark>'s decision comes a day after Kavanaugh told the committee that he didn't sexually assault a woman when they were teenagers. The accuser, Christine Blasey Ford, says she's \"100 percent\" certain that he did. <mark>Nelson</mark> hadn't taken a public position on the nomination before his announcement Friday. <mark>Nelson</mark> had never met with Kavanaugh even though his office said they tried several times to schedule a meeting. The senator is in a tight re-election race with Florida's Republican governor, Rick Scott, who has previously come out in support of Kavanaugh. Scott's campaign hasn't responded to questions about Ford's testimony. ___ 8:45 a.m. Former President George W. Bush has been advocating for Supreme Court nominee Brett Kavanaugh with wavering senators in recent days. That's according to a person familiar with the outreach who wasn't authorized to discuss the development publicly and spoke on condition of anonymity. Kavanaugh is a former top aide in Bush's administration. Bush has reached out to Republicans Jeff Flake of Arizona and <mark>Susan Collins</mark> of Maine. Bush spoke earlier this month to Democrat Joe Manchin of West Virginia in a call the senator's office says Manchin initiated .--Associated Press writer Catherine Lucey. __ 8:05 a.m.. The White House is pushing back against a call from the American Bar Association to slow the vote on Supreme Court nominee Brett Kavanaugh until the FBI can do a full background check. Spokeswoman Sarah Huckabee Sanders told reporters Friday that Kavanaugh has already \"been through six separate background investigations by the FBI .\" Kavanaugh testified Thursday to the Senate Judiciary Committee over an allegation of sexual assault when he was in high school. His accuser, Christine Blasey Ford, also appeared before the committee during the emotionally charged day. Sanders stressed <mark>Trump</mark>'s support for Kavanaugh and said he wanted to see a vote. She said <mark>Trump</mark> thought Kavanaugh's testimony was \"powerful, it was riveting and it was honest .\" ___ 1:30 a.m.. The American Bar Association has urged the Senate Judiciary Committee and the full Senate to slow down on the vote on Brett Kavanaugh for a position on the Supreme Court until the FBI has time to do a full background check on claims of sexual assault made by Christine Blasey (blah-zee) Ford and other women. \"We make this request because of the ABA's respect for the rule of law and due process under law,\" the ABA letter to committee leadership said. \"Each appointment to our nation's highest court (as with all others) is simply too important to rush to a vote .\" The Judiciary committee plans a vote on Kavanaugh Friday. ___ 12:35 a.m. Senate Republicans are plowing forward with a committee vote Friday on Brett Kavanaugh's nomination. Voting at the Senate Judiciary Committee comes after an extraordinary and highly emotional hearing over Christine Blasey Ford's allegations that Kavanaugh sexually assaulted her when they were teens. The marathon session appears to have only deepened the partisan divide. The Judiciary committee is narrowly split with the slimmest Republican majority. And Democrats are expected to oppose President <mark>Donald Trump</mark>'s nominee. But even if the panel deadlocks over recommending Kavanaugh, the nomination can push forward. The full Senate may start taking procedural votes as soon as Saturday toward confirmation next week. Senate Majority Leader Mitch McConnell says the committee's going to vote Friday and \"move forward .\" Related Articles Tesla without Musk at the wheel? That's what the SEC wants GOP advances Kavanaugh after Flake calls for FBI probe The Latest: Bush advocating for Kavanaugh with senators More On: Supreme Court of the United States U.S. Republican Party United States Senate United States Congress United States government U.S. Democratic Party American Bar Association Mitch McConnell Joe Manchin Brett Kavanaugh Lindsey Graham Anita Hill Patrick Leahy Clarence Thomas Kamala Harris Chuck Grassley Sheldon Whitehouse Dianne Feinstein Mazie Hirono Richard Blumenthal <mark>Donald Trump</mark> Christine Blasey Ford Jeff Flake <mark>Susan Collins</mark> Rick Scott <mark>Bill Nelson</mark> George W. Bush", "articleID": "2018092818_00357541_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"], "Donald Trump": ["Q22686", "Q27947481"], "John Thune": ["Q4571225", "Q462981"]}}]