[{"date": "2018-10-02", "url": "http://wlos.com/sports/content/hurricanes-foegele-among-surprises-to-make-nhl-rosters", "content": "Hurricanes' Foegele among surprises to make NHL rosters by STEPHEN WHYNO, AP Hockey Writer Carolina Hurricanes left wing Warren Foegele (13) celebrates with center Clark Bishop (64) and right wing Saku Maenalanen (8), of Finland, after Foegele scored a goal against the Nashville Predators during the first period of an NHL preseason hockey game Tuesday, Sept. 25, 2018, in Nashville, Tenn. (AP Photo/Mark Zaleski) A A (AP)--Warren Foegele carried his Charlotte Checkers bag out of the visiting locker room and insisted he hadn't yet earned an upgrade. Foegele needs a new bag now because he beat the odds and made the Carolina Hurricanes' opening night roster with an impressive preseason. Only reigning Art Ross Trophy winner Connor McDavid and last year's rookie of the year Mathew Barzal had more preseason assists than Foegele, the top surprise player to make an NHL team out of training camp. \"I just came to camp, just put my head down and tried to work hard and tried to make good plays,\" Foegele said. \"I'm a hard-working player and I think I can fit anywhere in the lineup. I think I can grind, I think I can make plays, but I think the work ethic is what I really take a lot of pride in and that's what I try to show .\" With seven points in eight preseason games--only nine players around the league had more--Foegele beat out other forwards on one-way contracts to make Carolina's roster. He's a Rod Brind \"Amour kind of player because the coach said Foegele is always around the play and\" even if he doesn't produce points or whatever, you just feel like he wins his shifts. \"Foegele was at his best against the defending Stanley Cup champion Capitals when he forced turnovers and set up a pair of goals. The late-blooming 22-year-old who went from the University of New Hampshire to the Ontario Hockey League to the American Hockey League doesn't stand out with his skill but can do a little bit of everything .\" He really can skate and also he can score some goals, \"Hurricanes forward <mark>Sebastian Aho</mark> said .\" He's not just a grinder. I think he can really make some plays, too. \"Foegele will get that chance this season. Here are some other players who surprised by making NHL season-opening rosters: MIKHAIL VOROBYEV, FLYERS The 6-foot-2, 194-pound Russian center didn't just challenge for a spot with Philadelphia. General manager Ron Hextall said the 2015 fourth-round pick broke down the door and forced the organization's hand. Vorobyev led the Flyers with seven preseason points and has stood out since Day One of training camp .\" It's what you're looking for with your young players: Come in and make an impact, and he did, \"Hextall said .\" He's a real good two-way player. He's not a young guy that you're afraid to put him out there because of the defensive side of the puck. \"MATHIEU JOSEPH, LIGHTNING An injury to forward <mark>Tyler Johnson</mark> opened up a role for Joseph on Tampa Bay's third line and second power-play unit. Joseph's quickness is his most noticeable attribute, and he made the Lighting in large part because he led them in preseason scoring with eight points on four goals and four assists .\" Speed is probably the big thing, \"coach <mark>Jon Cooper</mark> told reporters Monday .\" What we really liked in the preseason: He was finishing a lot. \"DILLON DUBE, FLAMES It would have been very easy for Calgary to keep Curtis Lazar, but GM Brad Treliving knew Dube would play for the Flames someday. The 20-year-old made sure it was now. Dube had four goals in the preseason and could open the season on the third line with <mark>Derek Ryan</mark> and free agent signing <mark>James Neal</mark>, giving him an opportunity to put up plenty of points when the games count. JESPERI KOTKANIEMI, CANADIENS It's no surprise the top two picks from June's draft, Buffalo defenseman Rasmus Dahlin and Carolina forward Andrei Svechnikov, are in the NHL right away. So maybe it shouldn't be a shock about Kotkaniemi, but Montreal seemed to take him third as a long-range investment. Instead, the Finnish center was one of the Canadiens' best players in exhibition action and never looked out of place. In an organization short on big centers, Kotkaniemi is a welcome addition right away. ___", "articleID": "2018100211_00283010_W", "names": {"Jon Cooper": ["Q16196878", "Q3183185"], "Sebastian Aho": ["Q13402197", "Q16158994"], "Tyler Johnson": ["Q17489372", "Q30122141", "Q57423105", "Q7585450", "Q7860052"]}}, {"date": "2018-10-02", "url": "http://qz.com/africa/1408683/melania-trump-will-face-a-hurdle-in-africa-no-other-first-lady-has-her-husband/", "content": "By Abdi Latif Dahir 7 hours ago On her debut major solo international trip, first lady Melania Trump is headed on a five-day visit to Ghana, Malawi, Kenya, and Egypt to promote children's welfare, highlight successful US humanitarian and development work, and focus on tourism and conservation efforts. By flying without the president, Melania Trump will be following in the footsteps of her forerunners who toured the continent without their husbands. Pat Nixon was the first to go it alone, traveling to Liberia, Ghana, and Cote d’Ivoire in 1972 as a representative of president Richard Nixon. Hillary Clinton took her daughter Chelsea to five African states in 1997, while Laura Bush made five trips alone in support of president <mark>Bush</mark>'s global health initiatives. Michelle Obama traveled unaccompanied to South Africa in 2011, and in 2016 took her daughters Malia and Sasha to Liberia and Morocco to promote education for girls. Reuters Hillary Clinton arrives in the Masai village of Olturoto in Tanzania in 1997. But what sets apart the current first lady's international trip from her predecessors is that it comes at a time when US-Africa policy has been set adrift. Since coming to office, president Trump's administration has shown that it cares little, and understands even less, about the continent. Trump has reportedly called African states \"shithole,\" imposed travel bans on nations including Somalia and Libya, delayed the appointment of key officials to the continent, and even applauded a fictional African state during a meeting with African leaders. Trump also propagated false allegations of \"large scale killing\" of white farmers in South Africa, expediently ignoring data that shows violence against white farmers was on the decline. REUTERS/Jason Reed Laura Bush in Nigeria in 2006. In so far as there's a policy, the administration is focused on security and countering China's influence in the continent. This problematization of the deepening Sino-Africa relations was a narrative touted by former secretary of state Rex Tillerson, who was fired during his first and last trip to Africa. Last year, Trump also proposed to slash funding for HIV and AIDS programming, cuts that could lead to four million deaths and 26 million new infections in sub-Saharan Africa over the next 15 years, according to advocacy organization ONE campaign. Despite all this, Trump said last week that both he and his wife \"love Africa. Africa is so beautiful. The most beautiful part of the world, in many ways .\" Melania has also said her trip was rooted in globalism and was meant to encourage \"open dialogue and the exchanging of ideas\" --a point of contrast with her husband's \"America first\" fervor. REUTERS/Youssef Boudlal Michelle Obama in Morocco in 2016. Amid this conflicting messaging, experts are wondering how effective Melania's trip could be and if she can help improve and repair US image abroad. Myra Gutin, a professor at Rider University in New Jersey who studies American first ladies says that she found the choice of a trip to Kenya \"interesting\" given that Melania supported her husband's claims that Obama wasn't born in Hawaii but in Kenya where his father was from. Gutin, however, notes Melania can leverage the goodwill and \"positive vibe\" associated with first ladies given they aren't elected officials. As an intensely private first lady associated with a chaotic White House, she said she could also use this opportunity to engender a constructive portrait by speaking up on critical issues including healthcare and education. \"She can show that the United States cares about these things, not just at home but around the world .\" Sign up to the Quartz Africa Weekly Brief here for news and analysis on African business, tech and innovation in your inbox Tags", "articleID": "2018100217_00114406_W", "names": {"President Bush": ["Q207", "Q23505"]}}, {"date": "2018-10-04", "url": "https://www.seattletimes.com/nation-world/small-investors-bought-into-trump-hotels-then-the-embarrassment-came/", "content": "CHICAGO--Ten years ago, retired electrician <mark>Dave Roberts</mark> invested $650,000 in Donald Trump. <mark>Roberts</mark> bought a single room in Trump's hotel on the Chicago River, then waited for his share of the Trump profit stream. \"Everything he touches turns to gold,\" <mark>Roberts</mark> remembered being told. But the gold wore off, starting in 2016. Fewer guests checked in. Revenue dropped. <mark>Roberts</mark> estimated that his property value decreased by half, as the real-estate market was flooded with unsold Trump hotel rooms. \"I don't even like walking past the building\" now, he said. \"I can't even look at it .\" Most Read Nation & World Stories What was that \"presidential alert' test that appeared on your cell phone today? Trump engaged in suspect tax schemes as he reaped riches from father Kavanaugh allegations raise new question: Have you ever been in a bar fight? McConnell sets Friday test vote on Kavanaugh nomination WATCH Rancor rises as FBI's Kavanaugh report wraps up Unlimited Digital Access. $1 for 4 weeks. As a private company, the Trump Organization says little about its financial ups and downs. But The Washington Post obtained details from two of President Donald Trump's landmark properties--his luxury hotels in Chicago and Manhattan--from small-time investors such as <mark>Roberts</mark>, who get details that the public does not. Those investors--and internal documents they provided--showed that revenue at both properties dropped noticeably as Trump's political career took off. The decreases have stirred tensions in the buildings and left many investors worried that the Trump brand may be curdling in the liberal cities where Trump built much of his empire. In New York, documents show that the ownership board at Trump's hotel considered the stunning idea of removing the Trump name from the hotel the president still calls his\" flagship. \"The idea stalled. One board member, who spoke in favor of keeping the Trump name, was later nominated by Trump to a celebrity-studded presidential council on fitness. For the small-time investors--who bought individual hotel rooms, under an unusual arrangement that allowed Trump to offload financial risks onto others--the downturn has brought a bitter sense that they're suffering for the political rise of a figure who is now loathed in their communities .\" There's a lot of people who have nothing to do with him, that are being injured, \"said Howard Finkelstein, an investor in Trump's New York hotel .\" We're the ones that are paying the price for his ridiculous ego. There's no reason to have that name on there. \"Between 2015 and 2017, revenue from room rentals at the New York hotel declined 14 percent after adjusting for inflation, according to quarterly statements the Trump Organization provided to unit owners. At Trump's hotel in Chicago, a document investors saw last week showed a similar drop-off. Bookings fell 8 percent from 2015 to 2016, and this year's figures are still lower than the pace in 2016. At both hotels, the Trump Organization told investors that it did have some good news: In recent months, their losses had been cushioned, partly by new customers from overseas. Both hotels noted an influx of visitors from Saudi Arabia. Eric Trump--the president's son, who now runs the Trump Organization with his brother Donald Jr.--said this\" has been an incredible year \"for the Trump hotel brand. Across all Trump hotels, he said, business has increased since 2017 .\" Our teams are consistently recognized for providing exceptional service and we couldn't be more proud of their hard work and dedication, \"he wrote .\" Year to date the portfolio as a whole is exceeding revenue and gross operating profit over last year considerably, as well as exceeding 2018 budget targets. \"The Trump Organization declined to give specifics about the hotels, or about the chain as a whole. There are now 11 Trump-branded hotels worldwide. That number is smaller than it used to be: Since Inauguration Day 2017, the owners of Trump hotels in Toronto, Panama and New York's SoHo neighborhood all cut ties with the Trump brand, and changed their hotels' names. Marriott announced this week that it will take over the Panama property. Among those remaining 11, some seem to be prospering: Trump's hotel in Washington, D.C., is busy with conservative groups, foreign embassy parties and GOP fundraisers. At Trump's hotel in Las Vegas, investors said their low rates have brought an influx of tourists from China. But the news has been worse at the Trump hotels in New York and Chicago, according to people who have invested in them. In these cities, Trump took on dozens or hundreds of small partners in an arrangement called a\" condo-hotel. \"That meant legally subdividing his hotels, so that each room could be sold as a separate piece of property. For the room owners, the benefit was that they got a share of the income, and the right to stay in their rooms for some nights. They also got details about income and occupancy rates for their rooms and--in some cases--for the hotel as a whole. In recent weeks, The Post spoke to 19 investors from the two hotels combined. For Trump--whose risk-taking businesses had needed repeated cash infusions from his father, Fred Trump, as a New York Times article detailed this week--the hotel-condo arrangement gave him two things he needed. One was cash. The other was a dilution of his financial risk. He got paid on the front end, by selling the units. Then he got paid on the back end, because he kept the contracts to operate the hotels .\" It's a way to enjoy a revenue stream, sort of indefinitely, if you can control the management group, \"said Jonathan <mark>J. Miller</mark>, a real-estate consultant who has studied condo-hotels. But, he said, that's a big\" if \": In many cases, he said, the investors who own rooms eventually take control, and kick out the original operator. In New York--where Trump's hotel opened at 1 Central Park West in 1997--it worked for many years. Celebrities visited often, liking the small, private lobby and sweeping park views. In 2012, for instance, a paparazzo caught Robert De Niro emerging with a laptop and papers in hand. The hotel's revenue from room rentals increased every year from 2011 to 2015, according to hotel-wide statistics shared with owners .\" 2015 was a banner year for us, \"Prince A. Sanders, the hotel's general manager, wrote in a letter to room owners. Trump had sold almost all of the hotel's 176 rooms. On the campaign trail, Trump bragged about this hotel, which had helped him re-enter the world of big-time New York real estate after his debt-fueled crash in the early 1990s. He called it\" a great success from the day it was built. \"Then came 2016. Overnight, Trump had transformed his brand--from an icon of big-city success, he became an icon of smoldering resentment against big-city America. In New York, his hotel was left to sell the old Trump, as this deep-blue city turned angrily on the new one .\" You come outside, you get yelled at. They have it gated off, there's police there, \"because of protests, said Finkelstein, one of the room owners .\" If you're going to stay in a hotel in New York, you figure out which one you're going to stay at. \"In 2017, Finkelstein said, he lost money on his unit for the first time after years--the room revenue didn't cover the fees and taxes. As Trump's political star rose, the celebrities thinned out, owners say. Protests increased. Sometimes, the celebrities led the protests: De Niro, for instance, returned to the hotel to speak to a large anti-Trump rally outside last year .\" I don't even like to use the umbrellas \"with the name\" Trump \"on them, said Ngaere Macray, who owns a hotel unit in the building that she uses for part of the year. She doesn't like Trump's politics, but doesn't want to sell her unit because she says the view is too good, the service is too nice. (The research firm CityRealty says the resale value of hotel-condo units has stayed stable, or even increased, despite the problems with revenue .) Macray wants Trump to go instead .\" He is the management group that we could, in theory, vote out. \"In the statements mailed to owners, good numbers turned south. From 2015 to 2017, the hotel's revenue from room rentals dropped from $34.4 million to $30.9 million. The average room rate--which had been high, even by New York's inflated standards--fell from $767 a night to $710. At the same time, other hotels nearby were also struggling as new competitors sprouted all over Midtown, cutting into everyone's revenue. But the Trump hotel fared worse than the others, said industry analyst <mark>Michael</mark> <mark>J.</mark> Bellisario of Robert W. Baird and Co.\" That decline is probably somewhat election-related, \"Bellisario said .\" There's no way of knowing for sure. \"At last, in early 2018, the Trump Organization told owners that it had identified the source of the problem. It wasn't the Trump brand. It was the bathrooms .\" A major dissatisfier has been the detrition of our room product...especially our bathrooms, which are actually twenty years old, \"Sanders, the general manager, wrote in the letter. Some were still outfitted with some 1990s-era Jacuzzi tubs. Sanders said a $20 million renovation would update the hotel's interior. But the hotel's board also was considering a more radical change. At a special meeting in January--the minutes of which were obtained by The Post--the board pondered whether it had the legal right to change the building's name (some owners wanted to call the hotel simply\" One Central Park West \"). First, three board members--including Donald Trump Jr. and a New Jersey doctor named Stephen Soloway--tried to shut down the discussion and adjourn quickly. But they were outvoted. Then the six other board members present voted to investigate the issue further, seeking out attorneys' advice. At some point after that, it appears, the idea fizzled. In recent weeks, Sanders issued a statement on behalf of the board, saying that it was not considering renaming the hotel and that it was pleased with its performance this year, one in which the New York hotel market is experiencing a comeback. Individual board members either declined to comment about the minutes of that meeting, or did not return calls from The Post. In May, Sanders wrote to the hotel's investors with a bit of good news: Revenue had increased in the first quarter of 2018. The reason, he wrote in his quarterly letter:\" a last-minute visit to New York by the Crown Prince of Saudi Arabia, \"in which a number of travelers accompanying the prince paid to stay at the Trump hotel. The Trump Organization did not respond to questions asking whether the Saudi government--a key U.S. ally--had paid for that block of rooms. Also in May, Trump nominated Soloway--the board member who had voted to end discussion of a name change--to the President's Council on Sports, Fitness and Nutrition alongside a raft of celebrities, including New England Patriots coach Bill Belichick, former baseball star <mark>Mariano Rivera</mark>, TV personality Mehmet Oz and <mark>Lou Ferrigno</mark>, who starred in the TV show\" The Incredible Hulk. \"A spokeswoman for the council said that Soloway had withdrawn his name from consideration a month later, on June 7. When The Post emailed Soloway about the hotel, his response included 62 exclamation points .\" Don't write or attempt to reach me again!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \"he wrote in late August. He signed the email,\" Stephen Soloway...Presidents Council for Sports Fitness & Nutrition. \"In Chicago, Trump's hotel had a lot going for it: a prime location along the revitalized Chicago River; a roof-deck restaurant, Sixteen, with two Michelin stars; and a clientele that included at least five pro-sports teams .\" Then the embarrassment came, \"said <mark>Michael Goldberg</mark>, who has owned his unit since the building opened in 2008 and, like some other investors who responded to The Post, is no fan of Trump's politics. The pro teams stopped coming. The two-star restaurant closed. <mark>Goldberg</mark> found that he couldn't even give away his unit for nothing .\" My daughter is getting married in September. They had their bachelorette [party], and I offered it to her for free. And she said, \"I would rather pay [to stay] somewhere else .'\" The Trump Organization issued a statement about the Chicago hotel, saying that \"the hotel is performing incredibly well, exceeding market share while garnering numerous accolades .\" But in a \"sales and marketing strategic update\" shared with investors in late September--and obtained by The Post--the hotel said its 2018 bookings were still 3.5 percent below the levels they'd decreased to in 2016. When the hotel tracked customers by country of origin, it found that bookings from U.S.-based visitors had fallen especially sharply. But there was good news, again, from Saudi Arabia. At last count, the hotel said, Saudi-based customers had booked 218 nights at Trump Chicago this year--a 169 percent increase from the same period in 2016. It also told investors about a rise in customers from China: \"China's room night production has increased significantly compared to 2016 .\" The Trump Organization did not respond to questions from The Post about these latest statistics on the Chicago hotel. <mark>Roberts</mark>, the retired electrician, said he had invested in the hotel against his lawyer's advice. He had put down a $64,000 deposit on the unit in 2004, before the hotel was built. Then, in 2008, Trump asked for the rest of the money. \"\"Lose your $64,000, don't do it,'\" <mark>Roberts</mark> remembered his real estate lawyer saying. The lawyer worried that he was paying too much, as a financial crisis and a housing bust loomed. But <mark>Roberts</mark> went ahead: \"I'm careful with money, so I didn't want to lose my $64,000 .\" Now, he said, the pain of the hotel's decreasing revenue has fallen disproportionately on him. He said that, before Trump's company passes along his room's earnings, it takes out fees for maintenance, reservations, housekeeping and other services. When revenue decreased, <mark>Roberts</mark> said, Trump's company took about the same cut--which left much less for him. \"I paid for the difference,\" he said. As a result, <mark>Roberts</mark> said, his room's payout dropped much faster than the hotel's overall revenue: It fell from $20,900 in 2015 to $8,900 in 2017. But after he pays taxes and his mortgage, <mark>Roberts</mark> says, Trump's unit gives him about $7 a day. \"I owe more than I can sell it for,\" he said. \"I can't catch up with the drop in price. I keep thinking that I'm ready to sell, and it drops again .\" He has $290,000 left on his mortgage. Even as revenue ticked up this year, owners of Trump hotel rooms in Chicago have struggled to sell them: Seventeen units are on the market now, and many of them have been available for months. \"The market is still significantly below where it was when the building opened. It's not a pretty picture for somebody who purchased then,\" said Gail Lissner of Integra Realty Resource In Chicago, there has been no sign of a revolt by the hotel's ownership board. <mark>Edward Martin</mark>, a Wisconsin businessman who heads the board, responded to The Post's queries with a short text message: \"Trump Tower Chicago is the premier property in Chicago .\" Soloway, the New Jersey doctor, is also on the board. But this spring, the Trump Organization's own real-estate brokers did something radical. They removed the Trump name from the building. At least, in the sales brochure. \"The perfect entertainment + dining destination,\" said the brochure, which was first reported by Crain's Chicago business. It was advertising some long-vacant retail space in the Trump building's bottom floors. In the photo under those words, the giant TRUMP sign on the building's facade had been airbrushed away. Krakow was a fellow at the Investigative Reporting Workshop at American University. The Washington Post's Crystal Duan in Las Vegas and Jack Gillum and Alice Crites in Washington contributed to this report.", "articleID": "2018100415_00344071_W", "names": {"Dave Roberts": ["Q5229686", "Q5229688", "Q5229690", "Q5229691", "Q5229692", "Q5229694", "Q5229696", "Q5229697", "Q5229698", "Q5229699", "Q5229701", "Q5229702"], "Edward Martin": ["Q18819404", "Q42322260", "Q51589473", "Q5344354"], "J. Miller": ["Q18730558", "Q56239397"], "Lou Ferrigno": ["Q24955125", "Q313306"], "Mariano Rivera": ["Q382303", "Q48924970"], "Michael Goldberg": ["Q18206169", "Q23061147", "Q24005553", "Q28542651", "Q56061854"]}}]