[{"date": "2018-10-06", "url": "http://www.gamereactor.eu/games/80323/FIFA", "content": "FIFA 19 REVIEW. Written by <mark>Mike Holmes</mark> on the 28th of September 2018 at 10 \"It's a solid football sim, make no mistake, but EA Sports is going to have to do better next year .\" 0 REVIEW. Written by Ricardo C. Esteves on the 19th of September 2018 at 13 \"FIFA 18 was a phenomenal football game, and FIFA 19 follows suit, although not quite to the same degree .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of October 2018 at 12:06 He has been removed from the cover on EA's website. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 5th of October 2018 at 10 Seeing all 20 clubs take part. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of October 2018 at 09 Coming to Paris Games Week later this month. 0 NEWS. Written by <mark>Mike Holmes</mark> on the 1st of October 2018 at 18:08 Still willing to take a chance?", "articleID": "2018100609_00187371_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2018-10-06", "url": "http://www.gamereactor.eu/news/?system=wiiu&sid=6ca509377fa8c5ee63bd7cad4c4c481c", "content": "On the 5th of October 2018 Magnus and Dóri take a closer look at what's new in the SteelSeries Rival 710. Diablo III: Eternal Collection - Local multiplayer Gameplay On the 5th of October 2018 Nintendo Switch introduces on Diablo III a local multiplayer mode for up to four people. We play the 20 first minutes of the game with friends. Coca-Cola Zero Sugar and Gamereactor's Weekly Esports Round-up S02E36 On the 5th of October 2018 It's Friday, so that means we have another episode of our Weekly Esports Round-up, including results from two big CS: GO events, an interview with the NBA 2K League's managing director, hardware, and so much more. Quick Look - MSI GeForce RTX 2080 On the 4th of October 2018 Magnus and Dóri take a look at the new MSI GeForce RTX 2080, discussing how this new generation of graphics cards could well be a game-changer for the industry. Battlerite Royale - Livestream Replay On the 4th of October 2018 Dóri knows a thing or two about battle royale games, but what does he make of Battlerite Royale, a game that takes the basic BR formula and puts a MOBA spin on things? Find out as we play the game for a couple of hours in this Livestream Replay. Quick Look - HP OMEN 35 Curved Monitor On the 4th of October 2018 Dóri and Magnus take a look at the impressive UWQHD, G-Sync, ultrawide monitor by HP. Watch them as they talk about its resolution, response time, design, image quality and potential use for gaming. Assassin's Creed Odyssey - A Fully Fledged RPG (Video #2) On the 4th of October 2018 In this second chapter in our massive video series, we take a look at how Ubisoft has turned the series into a fully fledged RPG. League of Legends: The Lure - Dan Abnett Interview On the 4th of October 2018 Dan Abnett wrote the League of Legends comic The Lure, and we talked to him about its creation. League of Legends Esports - NicoThePico Interview On the 4th of October 2018 We talked with League of Legends coach NicoThePico about how he got into the game, his experience, and what he's doing now. Fortnite: Season 6 - Livestream Replay On the 3rd of October 2018 Fortnite Season 6 has just landed to make things extra spooky in the battle royale game, and although we're a bit early for Halloween, we tried the new Season 6 content to see what's up. And no, we're not just talking about the Loot Lake island. Runescape Old School Mobile - John Colgrave Interview On the 3rd of October 2018 We caught up with John Colgrave from Jagex to learn more about their efforts to bring Runescape Old School to mobile devices. Liftoff - Kevin Haelterman Interview On the 3rd of October 2018 We were joined by LuGus Studios' Kevin Haelterman to learn more about the drone racing simulator Liftoff that recently exited Steam Early Access. Spyro Reignited Trilogy - Lou Studdert Interview On the 3rd of October 2018 Spyro is coming back this year with the Reignited Trilogy and producer Lou Studdert is here to tell us all about it. Mutant Year Zero: Road to Eden - Mark Parker Interview On the 3rd of October 2018 We caught up with producer Mark Parker to chat about the enticing combination of real-time stealth, tactical combat, and deep narrative that makes up Mutant Year Zero: Road to Eden. GTFO - Simon Viklund Interview On the 3rd of October 2018 We caught up with 10 Chamber Collective's Simon Viklund to learn more about the \"loveletter to hardcore co-op shooter fans\" that is GTFO. Remnant: From The Ashes - <mark>David Adams</mark> Interview On the 3rd of October 2018 Creative director <mark>David Adams</mark> joined us for a chat about one of the many exciting projects in the works at Gunfire Games, the supernaturally themed co-op shooter Remnant: From the Ashes. Trüberbrook - Darius Cernota Interview On the 3rd of October 2018 Producer Darius Cernota joined us for a chat about the lovely looking adventure game Trüberbrook that's been created using miniatures and is set in a small German town in the 1960s. The Surge: The Good, the Bad, and the Augmented - Livestream Replay On the 2nd of October 2018 Despite a few technical hiccups, we finally got stuck into some futuristic limb removal, this time with a western theme. That's right, we've been playing The Surge: The Good, the Bad, and the Augmented!", "articleID": "2018100618_00307759_W", "names": {"David Adams": ["Q16091376", "Q24007533", "Q2633956", "Q42713808", "Q47546710", "Q5230604", "Q5230607", "Q5230608", "Q5230609", "Q5230611", "Q56855421", "Q57602629", "Q58218009", "Q586939"]}}, {"date": "2018-10-07", "url": "http://www.gamereactor.eu/gadgets/?system=ps3&sid=01255adf9a7563f808a7948ab221224e", "content": "On the 5th of October 2018 Portuguese livestream. Diablo III: Eternal Collection - Local multiplayer Gameplay On the 5th of October 2018 Nintendo Switch introduces on Diablo III a local multiplayer mode for up to four people. We play the 20 first minutes of the game with friends. Coca-Cola Zero Sugar and Gamereactor's Weekly Esports Round-up S02E36 On the 5th of October 2018 It's Friday, so that means we have another episode of our Weekly Esports Round-up, including results from two big CS: GO events, an interview with the NBA 2K League's managing director, hardware, and so much more. Quick Look - MSI GeForce RTX 2080 On the 4th of October 2018 Magnus and Dóri take a look at the new MSI GeForce RTX 2080, discussing how this new generation of graphics cards could well be a game-changer for the industry. Battlerite Royale - Livestream Replay On the 4th of October 2018 Dóri knows a thing or two about battle royale games, but what does he make of Battlerite Royale, a game that takes the basic BR formula and puts a MOBA spin on things? Find out as we play the game for a couple of hours in this Livestream Replay. Quick Look - HP OMEN 35 Curved Monitor On the 4th of October 2018 Dóri and Magnus take a look at the impressive UWQHD, G-Sync, ultrawide monitor by HP. Watch them as they talk about its resolution, response time, design, image quality and potential use for gaming. Assassin's Creed Odyssey - A Fully Fledged RPG (Video #2) On the 4th of October 2018 In this second chapter in our massive video series, we take a look at how Ubisoft has turned the series into a fully fledged RPG. League of Legends: The Lure - Dan Abnett Interview On the 4th of October 2018 Dan Abnett wrote the League of Legends comic The Lure, and we talked to him about its creation. League of Legends Esports - NicoThePico Interview On the 4th of October 2018 We talked with League of Legends coach NicoThePico about how he got into the game, his experience, and what he's doing now. Fortnite: Season 6 - Livestream Replay On the 3rd of October 2018 Fortnite Season 6 has just landed to make things extra spooky in the battle royale game, and although we're a bit early for Halloween, we tried the new Season 6 content to see what's up. And no, we're not just talking about the Loot Lake island. Runescape Old School Mobile - John Colgrave Interview On the 3rd of October 2018 We caught up with John Colgrave from Jagex to learn more about their efforts to bring Runescape Old School to mobile devices. Liftoff - Kevin Haelterman Interview On the 3rd of October 2018 We were joined by LuGus Studios' Kevin Haelterman to learn more about the drone racing simulator Liftoff that recently exited Steam Early Access. Spyro Reignited Trilogy - Lou Studdert Interview On the 3rd of October 2018 Spyro is coming back this year with the Reignited Trilogy and producer Lou Studdert is here to tell us all about it. Mutant Year Zero: Road to Eden - Mark Parker Interview On the 3rd of October 2018 We caught up with producer Mark Parker to chat about the enticing combination of real-time stealth, tactical combat, and deep narrative that makes up Mutant Year Zero: Road to Eden. GTFO - Simon Viklund Interview On the 3rd of October 2018 We caught up with 10 Chamber Collective's Simon Viklund to learn more about the \"loveletter to hardcore co-op shooter fans\" that is GTFO. Remnant: From The Ashes - <mark>David Adams</mark> Interview On the 3rd of October 2018 Creative director <mark>David Adams</mark> joined us for a chat about one of the many exciting projects in the works at Gunfire Games, the supernaturally themed co-op shooter Remnant: From the Ashes. Trüberbrook - Darius Cernota Interview On the 3rd of October 2018 Producer Darius Cernota joined us for a chat about the lovely looking adventure game Trüberbrook that's been created using miniatures and is set in a small German town in the 1960s.", "articleID": "2018100715_00179283_W", "names": {"David Adams": ["Q16091376", "Q24007533", "Q2633956", "Q42713808", "Q47546710", "Q5230604", "Q5230607", "Q5230608", "Q5230609", "Q5230611", "Q56855421", "Q57602629", "Q58218009", "Q586939"]}}, {"date": "2018-10-09", "url": "http://www.gamereactor.eu/?system=android&sid=efa9733869f9835d56639913891369e8", "content": "Android With 2012's reboot, Firaxis fanned the flames for a whole sub-genre. Review Written by Bengt Lemne on the 8th of October 2018 at 09:28 Robert Kirkman's Skybound steps in, though all details are not final. 0 Written by <mark>Sam Bishop</mark> on the 7th of October 2018 at 09:30 \"There's better ways to spend time on the road .\" 0 Written by <mark>Sam Bishop</mark> on the 6th of October 2018 at 09:13 He laughed about it on stream. 0 Written by Christian Gaca on the 4th of October 2018 at 18:00 Make a deck and then play either in the story or PvP. 0 Report: Telltale staff might get hired to finish Walking Dead Written by Bengt Lemne on the 4th of October 2018 at 11:49 Sources tell Kotaku Telltale are looking for another company to hire staff and finish the last two episodes. 0 Written by Arya W. Wibowo on the 3rd of October 2018 at 13:54 Calamity is now the third most searched character. 0 Written by <mark>Sam Bishop</mark> on the 3rd of October 2018 at 12 Mark December 1 in your calendars. 0 Written by <mark>Mike Holmes</mark> on the 3rd of October 2018 at 12:34 We're taking a look at the latest content to drop in Fortnite. 0 Written by <mark>Sam Bishop</mark> on the 2nd of October 2018 at 14 FaZe Clan get some good news in the competition. 0 Written by Sergio Figueroa on the 2nd of October 2018 at 13:42 Less shooting, more grooving. Written by Bengt Lemne on the 29th of September 2018 at 18:30 Villagers get updated, improved add-on system, and pandas. 0 Written by Petter Hegevall on the 29th of September 2018 at 13:30 Planned for mobiles and based on a game franchise. 0 Written by Islem Sharouda on the 28th of September 2018 at 17:17 \"This is unintended, embarrassing, and it was careless for us to let this ship .\" 0 Written by Islem Sharouda on the 28th of September 2018 at 12:01 Shadow Stones pulled after exploit exposed. 0 Written by Petter Hegevall on the 27th of September 2018 at 17:00 Including a llama.", "articleID": "2018100903_00163824_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2018-10-09", "url": "https://www.bbc.co.uk/news/uk-northern-ireland-45804193", "content": "Brexit mitigation measures announced in Irish budget By <mark>John Campbell</mark> BBC News NI Economics & Business Editor 9 October 2018 These are external links and will open in a new window Close share panel Image caption Ireland's European affairs minister Helen McEntee said the budget was an important step in getting \"Brexit ready\" The Irish government has announced spending on a number of Brexit mitigation measures in its budget. It is setting up a € 300m Human Capital Fund to pay for the training and re-skilling of workers in sectors vulnerable to Brexit. There is also more than € 20m for the recruitment of customs and food safety inspectors as well as new IT systems. The government has emphasised these inspectors will be needed for sea ports rather than the land border. VAT increased European affairs minister Helen McEntee said the budget was an important step in \"getting Ireland Brexit ready\". \"We must do everything to minimise against the potential impacts while at the same time reinforcing the importance of our EU membership,\" she added. Media playback is unsupported on your device Media caption Brexit is \"challenge of our generation' Meanwhile, the Republic of Ireland's finance minister has increased the VAT rate for the hospitality sector from 9% to 13.5%. The special low rate of 9% was introduced in 2011 as a temporary measure to help the industry in the depths of a recession. Paschal Donohoe said that given Ireland's strong recovery it was now appropriate to increase the rate. Ireland's tourism sector has boomed in recent years with growth in visitor numbers of about 8% this year alone.", "articleID": "2018100919_00432365_W", "names": {"John Campbell": ["Q1148728", "Q12885331", "Q12885333", "Q1383155", "Q1444898", "Q15861577", "Q16198535", "Q18685177", "Q18704951", "Q19596498", "Q22003550", "Q2277620", "Q258792", "Q29216", "Q30077568", "Q3181179", "Q4251090", "Q43911585", "Q478094", "Q51212260", "Q51542318", "Q52834952", "Q56254457", "Q56434401", "Q57945700", "Q6217589", "Q6219128", "Q6224971", "Q6224989", "Q6224992", "Q6224995", "Q6224999", "Q6225008", "Q6225027", "Q6232197", "Q6249971", "Q6253779", "Q6264129"]}}, {"date": "2018-10-09", "url": "https://www.irishexaminer.com/breakingnews/entertainment/seann-walsh-and-katya-joness-next-strictly-dance-confirmed-874757.html", "content": "Seann Walsh and Katya Jones's next Strictly dance confirmed Tuesday, October 09, 2018 - 08:28 PM Seann Walsh and Katya Jones will dance the Charleston on Strictly Come Dancing when they return to the dancefloor on Saturday. The pair, who have faced scrutiny after they were pictured kissing while <mark>Jones</mark> is married and Walsh was in a relationship, will perform the jovial routine to upbeat hip-hop track Bills by LunchMoney Lewis. Speculation has mounted that the pair may quit the series before the next episode, amid rumours the programme's bosses want them to leave. Time to reveal all the #Strictly routines for Week Four?? https: //t.co/c56vCyFfk0 pic.twitter.com/TBrM2xM4eM--BBC Strictly ✨ (@ bbcstrictly) October 9, 2018 However, they will take to the dancefloor to fight for their place in the competition for their fourth dance of the series. They have previously performed a jive, as well as the more sensual tango and paso doble routines. Comedian Walsh and <mark>Jones</mark>, who is married to Strictly dancer <mark>Neil Jones</mark>, have both apologised for making a mistake after being pictured in The Sun kissing on a night out. Walsh has since been publicly dumped by his girlfriend Rebecca Humphries, who has received support from celebrities including Stacey Solomon and Carol Vorderman. Humphries, a theatre and TV actress, had said in a statement on Twitter that she was \"not a victim\" , thanking people for their support and revealing that the pictures were taken last week on her birthday while she was home alone. She said that \"his actions over the last three weeks had led to believe something inappropriate was going on\" , and that he denied it, repeatedly calling her \"psycho/nuts/mental\". Humphries, who had been in the audience last weekend to support Walsh and <mark>Jones</mark>, added: \"But--this whole business has served to remind me that I am a strong, capable person who is now free; and no victim .\" I have a voice and will use it by saying this to any woman out there who deep down feels worthless and trapped with a man they love: \"Believe in yourself and your instincts. It's more than lying. It's controlling .\" She thanked her close friends for taking care of her, and added: \"It's important also to recognise that in these situations those who hold power over you are insecure and fragile, and their need for control comes from a place of vulnerability.", "articleID": "2018100919_00569724_W", "names": {"Neil Jones": ["Q10379398", "Q27925020", "Q28124321", "Q54982366", "Q6988797"]}}, {"date": "2018-10-10", "url": "http://wtnh.com/sports/what-now-for-the-yankees-/1514090439", "content": "What now for the Yankees? By: Posted: Oct 10, 2018 06:31 PM EDT Updated: Oct 10, 2018 06:31 PM EDT What now for the Yankees? Video Saints' Brees becomes NFL's all-time yards passing leader WTNH - So what now for the Yankees? They won 100 games this season, hit the most home runs in major league history--but come up short of the ultimate goal--a World Series Championship. Rookie Manager <mark>Aaron Boone</mark> with some growing pains during the playoffs and obviously last night was a tough pill to swallow \"Well we want to continue to get better, we're chasing the perfect offense, so, as a major league athlete we're chasing to be the best we can be. Offensively, pitching, defense your always chasing utopia. We're chasing that .\" Look for the Yankees to try to add some big free agent pieces this winter.", "articleID": "2018101022_00357525_W", "names": {"Aaron Boone": ["Q4661862", "Q4661865"]}}, {"date": "2018-10-10", "url": "https://eu.montgomeryadvertiser.com/story/sports/2018/10/10/how-arkansas-surprised-alabama-defense/1592899002/", "content": "How Arkansas surprised Alabama's defense, may have provided blueprint for Missouri Alex Byington Montgomery Advertiser Published 5:00 PM EDT Oct 10, 2018 Arkansas tight end Cheyenne Oâ € ™ Grady (85) is stopped by Alabama linebacker Mack Wilson (30), defensive back Deionte Thompson (14), defensive back Xavier McKinney (15) and defensive lineman Isaiah Buggs (49) during second half action in Fayetteville, Ark., on Saturday October 6, 2018. Mickey Welsh TUSCALOOSA--Given the tireless preparation Alabama's coaches go through in the buildup to games, it's not often that the top-ranked Crimson Tide defense gets surprised on Saturdays. But Arkansas found away to do just that last Saturday, utilizing a simple tight end screen to burn Alabama's usually stingy defense for a pair of first-half touchdown passes to junior Cheyenne O’Grady in the closer-than-it-should've - been 65-31 loss. \"It was just how they ran it (that) surprised us,\" Tide sophomore nose guard Quinnen Williams admitted Tuesday. \"It looked just like a type of pass protection that we go over all the time. The quarterback held the ball almost like 3-4 seconds and then the tight ends just slipped out of the back .\" You see something new every game, something new every day, so it's (about) correcting it and getting it better so if we see it again, it won't happen again. \"Of course, with Missouri's potent offense coming to Tuscaloosa for Saturday's Homecoming game (6 p.m. CT, ESPN), including 6-foot-5 and 255-pound junior tight end Albert Okwuegbunam, who led all FBS tight ends last season with 11 receiving touchdowns. Missouri Tigers tight end Albert Okwuegbunam (81) celebrates after scoring a touchdown in the second quarter against the Arkansas Razorbacks at Donald W. Reynolds Razorback Stadium. Nelson Chenault, USA TODAY Sports The Razorbacks took advantage of this particular tight end screen multiple times on its first touchdown drive, as O’Grady began the play as a blocker against a blitzing outside linebacker before releasing and immediately turning around near the line of scrimmage to face quarterback Ty Storey for a quick pass over the middle. At that point, O’Grady simply followed the blocks laid by Razorback offensive linemen already 5 yards downfield for an 11-yard completion across midfield. Storey and O’Grady connected three times on that drive for 35 yards, including an 8-yard touchdown pass to the left corner of the end zone to pull within 21-7 of Alabama with 24 seconds left in the first quarter. O’Grady led the Razorbacks with seven catches for 48 yards and the two touchdowns .\" A couple of those plays last week, I think three of them, are where the guy blocked, blocked, blocked, and we kind of released them in coverage, whoever had them, and then a lineman gets in between you and the tight end and they throw them a little screen, \"Tide head coach Nick Saban said Monday .\" We hadn't seen that play prior to last week's game. It didn't kill us in the game, but it is certainly something we need to defend better in the future. It is a difficult play and you have to be disciplined in coverage. \"Arkansas head coach Chad Morris and Alabama head coach Nick Saban chat at mid field before the Alabama vs. Arkansas game in Fayetteville, Ark., on Saturday October 6, 2018. Mickey Welsh In developing the game plan against Alabama last week, Arkansas head coach Chad Morris noticed how aggressive the Tide defensive front seven is, especially in the pass rush, and figured a delayed screen for the tight end could be just what can help even the odds .\" We felt like they were just aggressive up front, they give a lot of pressure, and did a really good job of retracing on any screen releases you had, so we tried to use that against them, \"Razorbacks head coach Chad Morris said Wednesday on the SEC teleconference .\" They're very sound and very well coached, so when you go against teams of that caliber, you try to do some things that maybe make a few of their keys lie to them. \"More: Tide defense seeks return to\" Alabama standard' against Mizzou More: Imperfect Alabama defense knows the buck stops with them For defensive linemen like Williams, the tight end's initial attempt at blocking at the line of scrimmage sent sure signals for a natural run or run-pass option play, but instead utilized those predetermined notions to catch Alabama off guard, even if it was only good for a series or two in the first half. \"We're all thinking,\" pass rush, pass rush, \"' Williams said .\" So when the tight end slipped out of the back, it was like, \"Woah .' I've never seen it before like that .' It was just a great game plan on Arkansas' behalf .\" Added sophomore middle linebacker Dylan Moses: \"That was something that I really didn't see on film. I'm pretty sure they looked at that as something that could hurt us and it did. We went in at halftime, game planned against it and fixed it .\" Of course, with Missouri (3-2, 0-2 SEC) and preseason Heisman Trophy contender Drew Lock bringing the Tigers' own innovative offense to town this Saturday, and senior receivers Nate Brown and Emanuel Hall still out with injuries, it's a safe bet first-year Tigers offensive coordinator <mark>Derek Dooley</mark> will try and find different ways to move the ball against No. 1 Alabama (6-0, 3-0 SEC), including taking advantage of a potential mismatch with the 6-5 Okwuegbunam at tight end. \"They have a prolific offense, (and) Drew Lock is hands down one of the best quarterbacks in the nation, if not the best,\" junior safety Deionte Thompson said Monday. \"The way that he can get the ball out of his hands is very fast. The way they move, they average a play every six seconds after the ball is snapped. They average the most plays in college football. It's going to be a fast-paced game. We have to get lined down, get the call, communicate and be ready to play .\" Missouri Tigers tight end Albert Okwuegbunam attempts to make a catch in the end zone as South Carolina Gamecocks defensive back Jaycee Horn defends in the second half at Williams-Brice Stadium. Jeff Blake, USA TODAY Sports Published 5:00 PM EDT Oct 10, 2018", "articleID": "2018101101_00100780_W", "names": {"Derek Dooley": ["Q5261924", "Q5261925"]}}]