[{"date": "2018-10-11", "url": "http://www.undertheradarmag.com/interviews/fucked_up_vs_devo/", "content": "The Full Transcript of a Conversation Between Damian Abraham and Mark Mothersbaugh Jul 28, 2010 Web Exclusive By Matt Fink Photography by <mark>Norman Wong</mark> Damian Abraham (aka Pink Eyes) doesn't figure to be the type of person who gets starstruck easily, having earned his reputation with fearless and frenzied performances as the burly frontman of Toronto's Fucked Up. But when speaking with Devo vocalist and multi-instrumentalist Mark Mothersbaugh, Abraham is all nervous energy, unleashing a cascade of words that tangle and circle back on themselves, and winding through explanations of his introduction to Devo through his dad's record collection to the origins of the Pink Eyes moniker and the evolution of his prodigious beard. Eventually, he settles and gets around to actually asking Mothersbaugh some questions, revealing himself to be a pop music scholar with an encyclopedic knowledge of rock history and Devo's place in it. With Devo's Something for Everybody--their first new record in 20 years--taking them everywhere from The Colbert Report to Live with Regis and Kelly, Abraham offers a refresher course on why Devo still matters in this uncut transcription of their interview (a shorter version of which appears in our Summer 2010 issue). Damian Abraham: Well, I'm a big fan, so I'll get started. Mark Mothersbaugh: I'm honored, sir. Damian: Believe me, the honor is all mine. I was talking about the fact that my son is really into the music, but you're still singing about very dark subject matter, and there's a lyrical depth that was lost on me growing up. And it wasn't until listening to Devo after I'd been to school and done some reading and seen the world a little bit that I realized how deep the lyrics were. Was it the music or the lyrics that drove Devo's focus in the beginning? Mark: Well, I think what you're referring to in the lyrics is just talking about de-evolution and the human condition as we feel like we see it. Our vision of that was shaped largely by our time in school. We're older than your parents probably, because Gerry [Casale] and I went to Kent State in the ’70s. In 1970, we were there for the shootings at Kent State, and on that day we really realized that even in a democracy you really don't have freedom of choice. And we came to the decision that rebellion was obsolete, that you could always get beaten down by Big Brother, but if you really wanted to affect change in our culture, you had to employ techniques of subversion. So we talked about serious things, but we talked about them with a sense of humor and made it so that it was hard to attack on some levels, and it was not always evident. Innocent little kids like yourself could take on a song like \"Freedom of Choice,\" and it might not be until years later that you realize that the end is \"freedom of choice is what you got/but freedom from choice is what you want .\" Damian: It's interesting to hear you say this, because this week in Toronto--I don't know how much it was covered in the States--but the G20 was happening. And once again it was the typical refrain where people have peaceful protests--and there were agitators there, as well--but the people having the peaceful protests wound up thrown in jail. There's a shocking, really telling video on YouTube right now of a group of protesters very peacefully singing \"O Canada,\" and as soon as they sit down the police phalanx charges them, pushing them down, busting heads. So it's amazing how here we are 30, 40 years on from Kent State, and it still resonates in a very real way. Mark: Isn't it true? For us, we looked around and we were saying, \"Who really does affect change in our culture? Who is really successful at it?\" And we looked at Madison Avenue and we looked at TV commercials, and we said, \"Those people really change the way people think without them even knowing it .\" And usually it was for bad things. Madison Avenue sells a lot of shit to people every day. But [those were] the techniques that we were interested in and what we wanted to employ. So it was with great happiness when back in 1976 we had made this film called The Truth About De-evolution, and there was nowhere to show it because there was no such thing as MTV, so we talked the Akron Art Institute into letting us show this seven-and-a-half minute film. And I remember afterwards this woman who came up to me and she was really livid. She goes, \"I saw what you're doing! I know what you're doing with that film!\" And we're like, \"Huh?\" And we think she's upset because Gerry and I have on rubber monkey masks and we're paddling a woman...and she's going to say, \"Oh, you're misogynists,\" or something like that. And she goes, \"I saw exactly what you're doing. I saw subliminal words flash by the screen: submit and obey .\" And we're both like, \"What a great idea!\" It made us feel like we were onto something at that point. So we've always played around with that. As soon as we got a record deal, we incorporated. We became \"Devo Incorporated .\" We tried to blur the line between pop art and commercial art on purpose. Damian: I think the thing about Devo that has always been so interesting is that from the very beginning--and obviously I wasn't around to witness that, but subsequently I've been reading on it--the process is so involved. There actually is a process. With a lot of bands, the music just comes to be, almost by some weird accident. But with Devo, it always seems to be operating on two or three different levels. Mark: We were shitty musicians, so that was part of it. But we talked about things, too. A lot of bands, they're even distrustful of that, and they feel like the only way for what they really feel to come out is to be nonverbal about it, and I respect that. I love The Ramones. They were one of the best bands ever in the world, and I know that they would definitely back down from any kind of claims of any intellectual overtones to what they were doing. Yet they were one of the smartest bands ever. With Devo, we did talk about things, and we did talk about what was going on. We were trying to figure out what we thought was going on. We were in this cultural wasteland in the Midwest, where it was a factory town. Akron, Ohio, they made rubber tires. We could see everything that was going on in the world. We knew there was a Haight-Ashbury and a Carnaby Street and a Sunset Boulevard and a Village in Manhattan. We knew there was a Velvet Underground and Iggy Pop and people around the world doing interesting things. But you never saw them in Akron. You just heard about them. So we spent a lot of time there just talking. We did a lot of talking and trying to figure out what we were seeing long distance. Damian: It's funny you mention The Ramones, because I think a lot of people--myself included--thought about The Ramones being year zero for new rock and roll. But you guys actually predate The Ramones. The Ramones didn't really play their first shows until ’75 or start rehearsing until' 74, and you guys had already started recording and playing shows in' 74. But it's almost like that was Ohio at that time...Mark: Yeah, in Ohio, you could have lived and died there and no one would know it, and it really wasn't until ’77 that we actually drove to New York and play Max's [Kansas City] and CBGB's, and that kind of changed things for us. Damian: How close were you to the stuff that was going on in Cleveland at the time? The Rocket from the Tombs and The Electric Eels and all that stuff that was happening almost simultaneously? Mark: Yeah, we were friends with The Dead Boys and Pere Ubu and Peter Laughner. As a matter of fact, there were only two clubs in Ohio that you could play original music at, and one was Pirate's Cove up in Cleveland, and one was The Crypt in Akron. And those guys would come down to The Crypt and play, and we'd go up to Pirate's Cove and play, and that was all you could do or you had to leave the state. Otherwise, you had to lie and say you were a Top 40 band, and somewhere about song seven, we'd be going, \"Hi. We'd like to do another by Foghat. This one is called\" Mongoloid. \"' And then right about then, there'd be some Vietnam vet who was unemployed and bummed out, and he'd say,\" OK, that's it! \"And he'd slam his beer on the table and he'd come up and start fist fighting with us, and the club owner would say,\" OK, you guys can leave now. \"And I'd go,\" No! We got another set to go! \"And he'd say,\" No, no. . That's OK. You don't have to play the next set. Just please go before my place gets torn apart. \"Damian: It seems like at that time a lot of those bands--having read about Electric Eels performances and stuff--there was almost a deliberate agitation of the crowd. And with the Devo records, it never seemed like what the audience wanted was what you wanted to give them. But with the new record, you opened it up for the fans to help you make the record. Was there an epiphany moment when you decided to democratize or did you think that audiences are a little more worldly than they were back then? Mark: Well, also, it's like the world caught up and passed us. We're no longer ahead of our time. There's crazier music. I don't know if there's anything shocking happening right now, except maybe guys that go out on tour and come home and kill themselves because they did their tour and they're done. It's almost like you have to do that. You have to blow yourself up to be shocking at this point. When nothing is shocking, it's easier to be a little less insular about what you're doing. We have a historical side to us, so people know who Devo was. Not everybody, but there are people that do, and they say,\" Oh yeah. I've listened to that music. \"There are people like you who say,\" Yeah, I heard my dad's records, and it got me into it. \"They have that their own version of that story. It's not like in the old days when we'd hire a producer like Brian Eno or Roy Thomas Baker--not so much with Brian, he was pretty great--but Roy would try to make us sound like another record that he had done, and we'd end up spending the whole time fighting him, trying to make his recording sound like the way we did our demos of the same song. And it was self-defeating for us [laughs]. Damian: Not to beat up on The Ramones, because don't get me wrong, I love The Ramones, or The Dead Boys for that matter, but with those bands you can hear a lineage. And even bands like The Sex Pistols or The Clash, you can hear Dr. Feelgood and how that begat what they were doing. But with what you guys did, you were really without peers. I could never think of what begat Devo. Mark: We spent a lot of time festering on a cultural wasteland island by ourselves. In Manhattan, or probably the same thing in Toronto when you were starting your band, when you're in a big city like that, people are watching you from the beginning. They remember Fucked Up when you guys were only kind of Fucked Up. Damian: [Laughing] We're less fucked up now than we were then! Mark: Ok. Maybe more fucked up. But they remember before you had a beard and all these things, so they totally understand Fucked Up. And Devo, we were just back in our log cabin in Ohio, just kind of entertaining ourselves, so by the time we got to New York, we had these outfits and we had enough songs for three albums, and we had our own slang language that we were using and our own dialog. And we were making these big posters. I figured out a way to use blueprint machines to make four-by-six foot posters for 50 cents apiece, so we'd print up big posters and just change the date on them. People would look at them and\" Wow. My band is doing 8 1/2 by 11 flyers at Kinkos. How are they doing it? They must be ad executives. \"There were all these strange ideas that people would have about it. But when we finally did come out from underneath our rock, which was appropriately titled\" Akron, \"it was surprising to people in a way. That worked to our advantage. Damian: It's also funny because with Akron, there was the Clone Records scene and a lot of bands without peers. It was like an entirely approach to music, so I guess it must have been like you guys were all alone together. Mark: Yeah, there wasn't as much unity as you would think, and I'll tell you why I think that happened. We put out records on Boogie Boy Records, and that was just somebody's living room. And we had no idea what a record company was or how it worked. We had no idea of what a recording studio would be really like to be in one. It all seemed so fantastic and confusing and beyond our reach for sure. So we made stuff on a four-track deck and we went to Cincinnati, Ohio, and printed a thousand records at 35 cents apiece, and we printed up these covers ourselves and made up the artwork and folded them up and put them in it. And I'd get in a car and I'd drive from Akron to Cleveland, which is about a 40-minute drive, and I'd go in a record store and say,\" Hey! Need any Devo records? \"And the guy would go,\" Let me see, \"and he'd go down to the last bin in the row and it would say\" Other stuff \"on it, and he'd pull out this one Devo record and say,\" Nope. Still got the one you brought in last week. \"And I'd say,\" Ok. See you next week, \"and I'd keep making my drive. Then <mark>Dave Robinson</mark> from Stiff Records found one of our records at Bleeker Bob's in New York and he called us up and said,\" Hey, let me put this out in England and Europe, and I think I could sell them. \"And he actually did. He put out three singles--\"Mongoloid/Jocko Homo,\" the \"Satisfaction\" single, and a song called \"Be Stiff .\" So he put out those three singles in Europe, and, fuck, they all charted. That was crazy. \"Mondo\" was number one in France, and we didn't even have a record deal. \"Satisfaction\" was number one in Yugoslavia and charted in England. And \"Jocko Homo\" charted in Scotland. But we had no record deal; we had nothing. We still didn't know what a recording studio was. Why am I telling you that? It just sounds like I'm bragging for no good reason.... It was about something, but now, fuck, if I can remember...Damian: Well, that's something we can never go back to, and it goes back to how you what you were talking about the time you spent fermenting somewhere. Not to beat up on Akron, but no matter where you are...Mark: Yeah, there are creative people being ignored. This is why I said that. We did English press, and they said, \"What is Akron?\" And we said, \"Well, it's a lot like Liverpool. It's a factory town. It's gray and overcast 350 days of the year, and nobody is ever happy there. It's exactly like Liverpool .\" And in Melody Maker the next week, it said: \"Akron: The New Liverpool .\" And it really made record company people come over and start combing around Akron, and believe me, those unemployed musicians in Akron aren't stupid. They put bands together overnight. Rachel Sweet was never in a band before she got asked to audition for Stiff Records, and she got a record deal out of it. Good for her. Damian: But now, no matter what you're doing, because of the Internet, you can get someone to watch. Mark: The Internet has changed everything. The way artists make music, the way they present their art, what the art is, the way an audience consumes it--it's totally different. It's so amazing now. If you're getting into music because you want to be a rock star and live in Malibu, you're about 20 years too late. But if you're making music because you love it or because you absolutely have to make it, then you're at a really great time, because now you can find tape recorders at RadioShack that anyone can afford and are more powerful than the ones The Beatles used when they made their first albums. And you can start your own website on the same day you write your first song, and you can put your music out there for people to hear. And someone who is really creative or Internet savvy or has an interesting viewpoint, they are the ones who are going to be really successful. Damian: But because you guys had that time of being ignored, you developed your own world. It's almost like that can never happen again...Mark: If you want it, you can let it happen on purpose. You decide when you put things out. I just love the Internet because sometimes I'll go and type \"Chinese computer rock and roll banjo,\" and you put those four phrases in and something comes up! There's some band somewhere that fits that. \"Clog dancing reindeer death metal .\" You say those things, and some band will come up and those terms will all be used in the description of the band. It's such a great time to be an artist. I would love to be 20 and just starting right now. Damian: You're right. It's a game changer. Nothing will ever be what it was, and I'm sure for some people, that's a bad thing...Mark: Well, yeah. For people who had their hand on the faucet and got to say, \"Here's what you get to listen to and how you get to listen to it. You get to my vinyl,\" and then it was \"my audio cassette,\" and then you have to throw that way, and it's \"my CDs .\" And then the Internet came along and it cut their legs out from underneath them. I feel sorry for them, kind of, but not too much, because they had an easy ride. It wasn't like that before. Popular music was never passed on through recordings until about a hundred years ago. It's a fairly new phenomena. Before that, you went to some place, either a beer hall or an opera house or the king's castle, and you heard a piece of music that inspired you, and you played that same piece of music. That's how somebody else heard it, because you played that song that you heard at the local beer tavern. You copied it and played it again, and then people kept doing that, and it was a whole different methodology of music traveling around the world. So the record thing had a long run. But it's over now. Damian: Well, it's not like recordings are over. It's like the physical medium is done, but the recording itself is having a life of its own. Mark: Oh yeah. Now it's something totally different, because everyone can do it. Damian: And you don't have to go to a symphony and hire the symphony for a day. You can make a reasonable facsimile of a symphony. Mark: You can do it at home! You don't even have to have a band. You can be totally asocial. You can be poor as shit. You don't have to have a rich dad or a rich uncle or somebody that is going to loan you the money or a record company that says, \"I think you deserve to get to make a record .\" Now it's like anybody can say, \"You know what? I deserve to make a record, and I'm going to do it .\" Damian: There's that quote from [Jean] Cocteau where he says that \"films will not be an art form until cameras and film become as cheap as pencils .\" It's almost like the same can be said about popular music. Popular music is now truly becoming an art form because anyone can do it. Mark: I like that! Damian: And I'm not saying everyone. There are obviously people who took the means of production for themselves, like you guys running your own label and making your own records, but now it's like the means of distribution and production are all in the hands of the artist. Now we're going to see where pop music can go. Mark: [Sings] \"Hooray for 2010! Hooray for 2010! We're all here, whoopee! We've got the Internet! We've got digital computers! Hooray for 2010!\" So now as long as the Chinese don't take their missiles and knock out every satellite in space...Damian: Right! We can enjoy it. We're going to make some amazing pop songs as long as we don't blow ourselves up. Mark: Unfortunately, the math of human population isn't looking good right now. It's looking like there has to be a readjustment through some sort of chimpanzee flu. Damian: There will be a paradigm that supersedes the paradigm shift of music production. I don't know how much you can talk about this...but Devo has permeated mass culture. Because you guys have made your own toys, and different artists have done their interpretations, and there are bands that are literally Devo tribute bands and bands that are ostensibly also Devo tribute bands with the way that they approach music and the way they try and create the same sound that you guys created. But also the fact that McDonalds made a toy with a guy that had a Devo hat on. It's so bizarre that your critique of pop culture has almost been absorbed within pop culture. Mark: Yeah, it's kind of ironic that that was one of the few things that we were able to trademark. Early on, [Virgin Records founder] Richard Branson, because we loved the fact that he signed The Sex Pistols, I was stupid enough to trust him. So he had my publishing [rights] for a long time. I probably paid for a couple ashtrays on one of his spaceships. I do remember at one point that he got me stoned. He asked me to meet him in Jamaica and Bob 2 [Bob Casale] and I went down there, and we sat around and got stoned with him. And we were talking about The Sex Pistols because they had just broke up, and I said, \"Yeah, I met them last week because we were staying at the office where they print Search and Destroy [magazine], and they came over and hung out with us. It's too bad they broke up. We really love that band .\" And in the meantime Richard Branson and his South African buddies that he started Virgin with were rolling these gigantic joints. I'd never seen marijuana that looked like cigars before, but it was Jamaica. Damian: It wasn't Akron, Ohio, weed. Mark: Yeah, that wasn't even real weed. It was probably oregano that had rat poison in it. But anyway, he was saying, \"What do you think of Johnny Rotten?\" And we go, \"Oh, he's great! The Sex Pistols were the best band ever and we're so sorry they broke up\" and blah blah blah. And he said, \"Well, I'll tell you why you're here. Johnny Rotten wants to join Devo, and if you say yes, we're going to go down to the beach right now, and I've got reporters from Melody Maker, New Music Express, and Sounds, and we'll announce it to everybody that Johnny Rotten is joining Devo .\" And I remember at that moment thinking, wait a minute, they're not smoking the pot. They've only been giving it to Bob and me. And look at his teeth! I realized his teeth protruded like a brain-eating ape. I remember thinking that all in five seconds. I don't know how you were brought up, but my parents had serious religion issues, so I had to go to church as a kid. And I remember one time sitting in church and all of a sudden everything seemed so ridiculous to me that I started laughing in the middle of a very quiet prayer. And the more I tried to stifle it, the more I started laughing, because everything seemed so absurd. And that's what happened. I said, \"Richard, I'm not laughing at you, man. It's kind of an interesting idea, but I'm not really sure what Johnny Rotten would do in Devo. We'll help him put a band together. He should start a corporation. Johnny Rotten should incorporate. But I'm not laughing at you .\" I remember looking at his mouth and thinking he looked like a cannibal. I should have known right then that I shouldn't have signed with him. Damian: I'm sure if you asked John Lydon now if he should have signed with Virgin, he would say no. . It was one of those things where in hindsight you see that even the cool hippies were kind of evil in their own way. Mark: Oh yeah. They became the hip capitalists. Damian: They had better marketing. Mark: They knew how to get you when you had turned the other way to defend yourself from the evil you knew. They were just a different kind of filth that was able to totally take you, even when you thought you were totally cognizant and able to protect yourself. Damian: Well...Devo as a way of infiltrating culture and creating culture, Devo has been exorbitantly successful. You must be so proud that this thing that you created as a way of thinking about the world has become something so massive unto itself. Mark: Well, I got to tell you, for a long time we thought as the end of the ’80s became the ’90s, OK, we've had our moment, and that was great. But that was it. It felt like there was no legacy, and I think the Internet helped change that. It gave kids a chance to go investigate things that were going on before they were around, and I think that brought a renewed interest in Devo. And that's kind of a nice thing to have happen. Damian: Bear in mind that I play in a band called Fucked Up, so our ability to permeate the mainstream is somewhat limited. But [Devo's] music will be there long after you're gone. The fact that you've changed popular culture in such a way, that's going to be there forever. Well, as long as popular culture is here...Mark: Which could be until the end of the year! Damian: Exactly, but you've created something that only a handful of bands have done. There are a lot of bands that--Mark: Okay, now you're going overboard, sir [laughing]. Damian: Well, but I really believe this, and believe me, I have these conversations with myself. It's not just because I'm on the phone with you. But at the end of the day, there are a lot of bands that are classic bands, and there are a lot of bands that have important records, but there are very few bands that have created a world unto themselves. And that, to me, is the most impressive thing a band can do. Mark: Well, damn, Pink Eye, you can call me \"Booji Boy .\" Damian: Well thank you very much. Mark: I think we should get our own talk show. Damian: I would love that. I like to draw, too, so maybe we can have our own drawing talk show. That would be an awesome show. Mark: That sounds perfect. Damian: I would watch it. Now all I need is to find a million other people who think just like me, and we'll have a hit show. Mark: I think it could even go a lot further than Fucked Up. Damian: I think anything could go a lot further than Fucked Up. I think this conversation will go a lot further than Fucked Up. Mark: You guys are pretty good. Damian: Thank you very much. Mark: Thanks to the Internet, I'm now Fucked Up literate. Damian: But for us, the way you guys approached things--the way that it wasn't 100% about writing a catchy riff--it's about writing a song but also the work that goes into that song and the creation of the song and making that part of the experience is something that has had a really profound effect on us. So, for that, I definitely have to thank you, because we stole that from you wholeheartedly. Mark: Well, man, I'm sure I stole that from somebody. Damian: Well, that's the thing with Devo, and not to keep harping on this, but it's hard to think who you stole anything from. I'm a huge nerd when it comes to music, and I'm a big music collector and a big nerd when it comes to music. And I like to think of myself as reasonably well-versed in music, but I can't for the life of me put my finger [on it]. Obviously, there's German stuff that was coming out at that time, and you can hear shades of that in the keyboard work. But Devo was without peers...Mark: I know where we got our stuff. To me, if there was one guy that influenced me and was the most inspirational to me for keyboard, it would be Brian Eno, and it was because of one song. It was his solo on \"Additions of You\" on Roxy Music. People like Rick Wakeman [from Yes] always kind of creeped me out because their synthesizer sounds always sounded like a calliope or something. They were always silly. And Brian Eno did this solo where it went [makes flailing synthesizer sounds with his mouth]. And I was like, \"Oh my God! He can't be using a keyboard. He's using joysticks or something like that .\" And that changed a lot of things for me. So we would have to admit that there are people who really influenced us a lot, and as much as it wouldn't seem that he was the guy, he was. And that's why we asked him to produce our first record, because of that. Damian: Also, with your new record, a lot of bands that you hear, you're like, \"Oh, they've got a new record coming out .\" And then you hear it, and you're like \"Aw, they're pissing on their legacy .\" But I honestly think the new record is amazing. And it's not because it's a rehash of the old, it's because it does fall perfectly in...Mark: Oh, man. Thank you. We haven't been able to put as much time in a record since our first album. This is the one that we've been able to put the most time into, and I think that's what you're hearing. Damian: Well, if something is worth hearing, it's worth doing right.", "articleID": "2018101104_00024471_W", "names": {"Dave Robinson": ["Q1173329", "Q15043151", "Q5229706"], "Norman Wong": ["Q58337123", "Q7052960"]}}, {"date": "2018-10-11", "url": "http://www.gamereactor.eu/esports/?sid=1e4a7620fb124b802eb42fa66dc835b9", "content": "Esports ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 12 Along with PUBG and Blackout. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 11 Including video content and workbooks. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 10 It's a \"strategic effort to position our organisation for the future .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 09 They'll have their rematch against Astralis. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 9th of October 2018 at 13 Coming to Las Vegas in December. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 9th of October 2018 at 13 Including Uzi, Svenskeren, and more.", "articleID": "2018101106_00292433_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2018-10-11", "url": "http://www.gamereactor.eu/?system=ios&sid=16dbcb307daf3c1bce686f57f1be3a3f", "content": "iOS It's been MIA for more than 12 years now, but it just got a brand-new website. Article Written by David Caballero on the 10th of October 2018 at 17:15 It's been MIA for more than 12 years now, but it just got a brand-new website. 0 Written by David Caballero on the 10th of October 2018 at 13:37 Android users will have to wait a bit longer. 0 Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 12 Along with PUBG and Blackout. 0 Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players. 1 Written by Magnus Groth-Andersen on the 9th of October 2018 at 17:11 Their trailer for Season 6's Battle Pass was removed. 0 Written by Bengt Lemne on the 8th of October 2018 at 09:28 Robert Kirkman's Skybound steps in, though all details are not final. 0 Written by <mark>Sam Bishop</mark> on the 7th of October 2018 at 09:30 \"There's better ways to spend time on the road .\" 0 Written by <mark>Sam Bishop</mark> on the 6th of October 2018 at 09:13 He laughed about it on stream. 0 Written by Christian Gaca on the 4th of October 2018 at 18:00 Make a deck and then play either in the story or PvP. 0 Written by Christian Gaca on the 4th of October 2018 at 13:35 On October 25 we get the successor to Euclidean Lands. 0 Report: Telltale staff might get hired to finish Walking Dead Written by Bengt Lemne on the 4th of October 2018 at 11:49 Sources tell Kotaku Telltale are looking for another company to hire staff and finish the last two episodes. 0 Written by Arya W. Wibowo on the 3rd of October 2018 at 13:54 Calamity is now the third most searched character. 0 Written by <mark>Sam Bishop</mark> on the 3rd of October 2018 at 12 Mark December 1 in your calendars. 0 Written by <mark>Mike Holmes</mark> on the 3rd of October 2018 at 12:34 We're taking a look at the latest content to drop in Fortnite. 0 Written by <mark>Sam Bishop</mark> on the 2nd of October 2018 at 14 FaZe Clan get some good news in the competition.", "articleID": "2018101113_00103101_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2018-10-12", "url": "https://wdef.com/2018/10/12/asian-stock-markets-stem-bleeding-left-behind-by-wall-street-2/#respond", "content": "International News US & World News Share on Facebook Tweet on Twitter Currency traders watch monitors at foreign exchange dealing room of KEB Hana Bank headquarters in Seoul, South Korea, on October 12, 2018 Ahn Young-joon / AP - Advertisement - Last Updated Oct 12, 2018 4:09 AM EDT SINGAPORE--Share prices in Asia rebounded Friday on a report that President Trump and his Chinese counterpart Xi Jinping may meet at the Group of 20 summit in Argentina in late November. The Wall Street Journal said the White House had informed officials in Beijing that it would go ahead with a summit meeting in Buenos Aires. It cited unnamed sources from both sides. There was no immediate word from Chinese officials in Beijing. The aim was to find a way out of the impasse over trade that has led both countries to impose penalty tariffs on billions of dollars of each other's exports. Strong Chinese export data also helped breathe life into share benchmarks that had languished in recent days. Defying tariffs, China's trade surplus with the United States grew to a record $34.1 billion in September, customs data showed. This marked a jump of 13 percent over a year earlier. Its exports to the United States rose to $46.7 billion although growth was slower than in August. Imports of U.S. goods grew too, but at a slower pace than before. On the overall, China's global exports picked up and its imports steadily increased. Asia's rebound followed another rout Thursday on Wall Street, where indexes tumbled for a second straight day on worries that rising interest rates and trade tensions could hurt global growth. \"It seems Asia has had a reassessment, and calmer heads have prevailed as we close out the week,\" <mark>Chris Weston</mark> of Pepperstone Group Limited said in a commentary. Japan's Nikkei 225 index gained 0.5 percent Friday to 22,694.66 after sinking early in the day following a nearly 4 percent loss on Thursday. Australia's S & P ASX 200 rose 0.2 percent to 5,895.70. Hong Kong's Hang Seng surged 1.8 percent to 25,726.78. The Shanghai Composite index advanced 0.9 percent to 2,606.91. Shares rallied in Taiwan and rose throughout Southeast Asia. A decline in the yield on 10-year Treasury yields hit bank stocks, while technology and retail companies stumbled. The benchmark S & P 500 index started the day with gains, but ended losing 2.1 percent to 2,728.37, its lowest close in three months and sixth straight loss. The Dow Jones Industrial Average dropped 2.1 percent to 25,052.83 and the Nasdaq composite gave up 1.3 percent to 7,329.06. The Russell 2000 index of smaller-company stocks fell 1.9 percent to 1,545.38. The U.S. Treasury will soon release a currency report that some analysts suggest might change the official stance on China's exchange rate policy. Reports that U.S. Treasury Secretary Steven Mnuchin was advised against labeling China as a currency manipulator--a status that could trigger penalties--have eased tensions, Stephen Innes of OANDA said. Despite \"a semblance of sanity returning,\" the markets are ultimately \"not out of the weeds,\" he added. Officials at the IMF-World Bank annual meeting, held on the Indonesian island of Bali this week, have called on the U.S. and China to work out their dispute over technology while abiding by world trade rules. On Friday, Indonesian President Joko Widodo alluded the tensions to popular TV series \"Game of Thrones\". He said fighting among the \"great houses\" was distracting them from the threat of an \"evil winter .\" \"Victory or defeat in wars always brings the same result--destruction,\" Widodo said. In other trading, U.S. crude oil added 84 cents to $71.81. The contract dropped 3 percent to close at $70.97 in New York. Brent crude, the international standard, was $1 higher at $81.26. It dropped 3.4 percent to $80.26 in London. The dollar strengthened to 112.40 yen from 112.13 yen late Thursday. The euro rose to $1.1598 from $1.1586. Wall Street was set for an optimistic open. S & P 500 futures rebounded 1.3 percent to 2,781.50. Dow futures was 1.2 percent higher at 25,494.00. © 2018 CBS Interactive Inc.. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.", "articleID": "2018101208_00104161_W", "names": {"Chris Weston": ["Q27889126", "Q5108451"]}}, {"date": "2018-10-12", "url": "https://www.bizbash.com/october-12-2018-fyre-festival-organizer-sentenced-to-six-years-in-prison-inside-the-us-premiere-of-if-beale-street-could/new-york/story/36332", "content": "1. FYRE FESTIVAL ORGANIZER SENTENCED TO SIX YEARS IN PRISON: <mark>Billy McFarland</mark>, the organizer of the infamous Fyre Festival, was sentenced Thursday in Manhattan federal court to six years in prison for the disastrous event in 2017. Page Six: \"The 26-year-old scam artist, who pleaded guilty in two cases since his 2017 music fest he planned with Ja Rule fell apart, had faced up to 20 years at his sentencing .\" I'm sorry, I am deeply sorry for my mistakes,' <mark>McFarland</mark> told Judge Naomi Buchwald in court, where his father sat crying along with other family members .' I betrayed the trust of investors, family and even the court. I come from an incredible family--a loving environment, they [family] tried to teach me the value of family and friends,' added <mark>McFarland</mark>, who also faces a $26 million forfeiture order ....In March, <mark>McFarland</mark> copped to two counts of wire fraud for using bogus documents to lure investors to what was billed as a luxe festival on the island of Exuma island in April and May of 2017. About four months later, the Short Hills, New Jersey, native pleaded guilty to another fraud in a fake ticket-selling scheme he admitted to carrying out while he was out on bail. He earned about $100,000 by selling the bogus tickets to exclusive events such as the 2018 Met Gala and Burning Man. \"https: //pge.sx/2OZda20 2. INSIDE THE U.S. PREMIERE OF\" IF BEALE STREET COULD TALK' AT THE APOLLO THEATER: On Tuesday night, James Baldwin was celebrated in Harlem, his neighborhood of birth, as part of the 56th annual New York Film Festival. The U.S. premiere of If Beale Street Could Talk, <mark>Barry Jenkins</mark>' film adaptation of Baldwin's novel of the same name, took place at the historic Apollo Theater. The Atlantic: \"The significance of hosting the stateside premiere of Beale Street at the legendary Harlem auditorium was not lost on <mark>Jenkins</mark>.\" James Baldwin was born and raised in Harlem, this book is set in Harlem, it was filmed in Harlem,' the director said during a brief introduction preceding the screening. \"The first time it shows in the U.S. had to be in damn Harlem!' <mark>Jenkins</mark>, who directed the Oscar-winning 2016 picture Moonlight and the 2008 indie romantic drama Medicine for Melancholy, spoke with warmth as he introduced the cast of the film, whom he called\" the village of If Beale Street Could Talk .' As they gathered, the Liberty City, Miami--bred <mark>Jenkins</mark> turned the mic over to members of the Baldwin family. Standing onstage in the Harlem venue, several of Baldwin's relatives spoke about the writer's legacy and the film's place in it. Karim and Aisha Karefa-Smart, Clarence <mark>Harris</mark>, and Trevor Baldwin all shared their accounts before the film played ....At the after-party following the Apollo screening, held at the Lenox Avenue mainstay Red Rooster, cast members and crew drank and danced alongside audience members. Macaroni and cheese, hot honey chicken, cornbread madeleines, and grits nourished the filmgoers who'd been physically (and emotionally) spent. \"https: //bit.ly/2pQ4T2b 3. SALT LAKE COMIC CON SAYS COURT-ORDERED PAYMENT OF $4 MILLION IN TRADEMARK WAR WILL\" DESTROY' THE EVENT: The producers of the Salt Lake City comic convention fear for the event's future, and Utah's economy, after they were given a court order to pay $4 million in a trademark infringement war with San Diego Comic-Con. The Salt Lake Tribune: \"Dan Farr Productions, the company behind the FanX Salt Lake Comic Convention, filed an emergency motion with the U.S. 9th Circuit Court of Appeals on Wednesday, asking for a temporary postponement on the payment pending appeal in court. If the $4 million judgment is enforced, the company will be\" destroyed,' the motion states, costing Utah's economy \"millions of dollars .' But the court\" likely wouldn't harm' the other party--San Diego Comic-Con, by granting a stay. The California-based convention sued the event formerly known as Salt Lake Comic Con in 2014 about the use of \"comic con' in the Utah company's name. San Diego Comic-Con's legal team argued that even without the hyphen, those words infringed on its own trademark and confused people into thinking the events were associated. A federal jury sided with San Diego Comic-Con at the end of last year but found there had been no willful infringement and awarded FanX a slight break on attorney fees. The jury awarded $20,000 in damages to San Diego Comic-Con, which had originally sought $12 million, and $3.9 million in attorney fees and costs rather than the $5 million its lawyers had initially asked for. Still, the Utah-based company said in its motion Wednesday that the\" nearly $4 million award is wildly excessive .' The producers of FanX are also protesting a judgment that FanX stop using the phrase \"formerly known as Salt Lake Comic Con' in advertising and social media and delete any posts before the court ruling that refer to their event as\" comic con .' \"https: //bit.ly/2OlTNAF * INDUSTRY NEWS * AccorHotels has completed its acquisition of a 50-percent stake in Sbe Entertainment Group. Sbe founder and C.E.O. Sam Nazarian will control the remaining 50 percent. * LOCAL NEWS * ATLANTIC CITY: Caesars Entertainment has announced new restaurant concepts at its Atlantic City properties. Harrah's Atlantic City has debuted <mark>Gordon Ramsay</mark> Steak, which seats 280 guests; Caesars Atlantic City has debuted a bar and lounge called 2100 Bar & Lounge; and Bally's Atlantic City has debuted surf-inspired bar Bally's Beach Bar. CHICAGO: Viceroy Chicago hotel has launched\" Designer Doors for Charity, \"a monthlong installation that showcases doors on the fifth floor painted by eight local artists, each depicting an interpretation of the fight against breast cancer. A portion of revenue from each room booked on the floor throughout October will be donated to the Lynn Sage Cancer Research Foundation. AIC Hotel Group has announced plans to open a 100-key Nobu Hotel this spring in the city's Fulton Market district. That's in addition to Nobu Hotel Los Cabos, the brand's first property to open in Mexico, slated to open in early 2019. Chicago Children's Museum will unveil its renovated meeting and event spaces on October 16. LONDON: BMF Media Group has opened a London office to expand its global footprint. Craig MacIntyre will lead the London office and the continued expansion. LOS ANGELES: The inaugural Wellspring from Wanderlust Wellness Conference takes place October 26-28 at the Palm Springs Convention Center. The event will feature more than 200 workouts, lectures, workshops, and panels from Glennon Doyle, Marianne Williamson, Alicia Silverstone, and more. Hotel Indigo Los Angeles Downtown has partnered with Baron Hats to host a monthlong pop-up shop October 18 through the end of November. The shop will showcase Baron Hat creations, including those worn by Beyoncé during her Formation Tour, Sylvester Stallone in Creed, Harrison Ford in Indiana Jones, and <mark>Ed Harris</mark> in Westworld. Attendees will be able to purchase hat replicas and order a customized hat. For information on upcoming events in Los Angeles, visit Masterplanner: http: //www.masterplanneronline.com/losangeles NASHVILLE: Water and music attraction SoundWaves will open at Gaylord Opryland Resort in December. The venue will have 106,000 square feet of outdoor water attractions and 111,000 square feet of indoor attractions including lazy rivers, rock climbing, restaurants, and an adults-only indoor pool, bar, and lounge. NEW YORK: Lufthansa will host Fly Through Time, an interactive consumer pop-up, on Sunday at Duarte Square. The activation will feature a 1950s-theme Lufthansa terminal set; an interactive model of the 1958 Lufthansa Super Constellation\" Senator Service \"first class onboard lounge; an augmented-reality mirror where guests can virtually dress in vintage uniform and passenger styles; an A.R. model of the first-ever luxury transatlantic flight; and a life-like boarding scenario. The New York Civil Liberties Union (N.Y.C.L.U.) will host its 16th annual Broadway Stands Up For Freedom concert We The People on October 15 at Town Hall. Alan Cumming will receive the 2018 Freedom Award. The fourth annual Through Her Lens: The Tribeca Chanel Women's Filmmaker Program, in collaboration with Pulse Films and Tribeca Film Institute, will take place October 16-18. The three-day program provides mentorship, project support, and master classes for 10 emerging female filmmakers and awards $100,000 in grants. Meatpacking District's annual Harvest Fest will take place October 27. The event will feature bites from neighborhood restaurants including Fig & Olive, Santina, and Dos Caminos. For information on upcoming events in New York, visit Masterplanner: http: //www.masterplanneronline.com/newyork RALEIGH, NORTH CAROLINA: Visit North Carolina has named J Public Relations its PR agency of record. VANCOUVER: In Goop Health will have its first Vancouver edition October 27-28 at Stanley Park Pavilion. WASHINGTON, D.C.: Sage Hospitality has appointed <mark>Mike Nelson</mark> general manager and Portia Hood director of sales and marketing to the Alexandrian Hotel and Morrison House. YOUR NEWS: What are you doing? Tell us: tips @ bizbash.com. JOB BOARD: Post a job or find a job: http: //jobs.bizbash.com With contributions from Claire Hoffman in Los Angeles and Beth Kormanik, Michele Laufik, and Ian Zelaya in New York. BizBash Daily is the must-read digest of event industry news from BizBash.com. Feed the Sheet: tips @ bizbash.com Subscribe: www.bizbash.com/bizbashdaily Advertise with BizBash: n_peck @ bizbash.com", "articleID": "2018101214_00051834_W", "names": {"Barry Jenkins": ["Q2383951", "Q26821227", "Q2885745"], "Billy Mcfarland": ["Q18044835", "Q4912992"], "Ed Harris": ["Q104791", "Q16729663"], "Gordon Ramsay": ["Q15280", "Q22279905", "Q27557641"]}}]