[{"date": "2018-10-12", "url": "https://www.bizbash.com/october-12-2018-fyre-festival-organizer-sentenced-to-six-years-in-prison-inside-the-us-premiere-of-if-beale-street-could/new-york/story/36332", "content": "1. FYRE FESTIVAL ORGANIZER SENTENCED TO SIX YEARS IN PRISON: <mark>Billy McFarland</mark>, the organizer of the infamous Fyre Festival, was sentenced Thursday in Manhattan federal court to six years in prison for the disastrous event in 2017. Page Six: \"The 26-year-old scam artist, who pleaded guilty in two cases since his 2017 music fest he planned with Ja Rule fell apart, had faced up to 20 years at his sentencing .\" I'm sorry, I am deeply sorry for my mistakes,' <mark>McFarland</mark> told Judge Naomi Buchwald in court, where his father sat crying along with other family members .' I betrayed the trust of investors, family and even the court. I come from an incredible family--a loving environment, they [family] tried to teach me the value of family and friends,' added <mark>McFarland</mark>, who also faces a $26 million forfeiture order ....In March, <mark>McFarland</mark> copped to two counts of wire fraud for using bogus documents to lure investors to what was billed as a luxe festival on the island of Exuma island in April and May of 2017. About four months later, the Short Hills, New Jersey, native pleaded guilty to another fraud in a fake ticket-selling scheme he admitted to carrying out while he was out on bail. He earned about $100,000 by selling the bogus tickets to exclusive events such as the 2018 Met Gala and Burning Man. \"https: //pge.sx/2OZda20 2. INSIDE THE U.S. PREMIERE OF\" IF BEALE STREET COULD TALK' AT THE APOLLO THEATER: On Tuesday night, James Baldwin was celebrated in Harlem, his neighborhood of birth, as part of the 56th annual New York Film Festival. The U.S. premiere of If Beale Street Could Talk, <mark>Barry Jenkins</mark>' film adaptation of Baldwin's novel of the same name, took place at the historic Apollo Theater. The Atlantic: \"The significance of hosting the stateside premiere of Beale Street at the legendary Harlem auditorium was not lost on <mark>Jenkins</mark>.\" James Baldwin was born and raised in Harlem, this book is set in Harlem, it was filmed in Harlem,' the director said during a brief introduction preceding the screening. \"The first time it shows in the U.S. had to be in damn Harlem!' <mark>Jenkins</mark>, who directed the Oscar-winning 2016 picture Moonlight and the 2008 indie romantic drama Medicine for Melancholy, spoke with warmth as he introduced the cast of the film, whom he called\" the village of If Beale Street Could Talk .' As they gathered, the Liberty City, Miami--bred <mark>Jenkins</mark> turned the mic over to members of the Baldwin family. Standing onstage in the Harlem venue, several of Baldwin's relatives spoke about the writer's legacy and the film's place in it. Karim and Aisha Karefa-Smart, Clarence <mark>Harris</mark>, and Trevor Baldwin all shared their accounts before the film played ....At the after-party following the Apollo screening, held at the Lenox Avenue mainstay Red Rooster, cast members and crew drank and danced alongside audience members. Macaroni and cheese, hot honey chicken, cornbread madeleines, and grits nourished the filmgoers who'd been physically (and emotionally) spent. \"https: //bit.ly/2pQ4T2b 3. SALT LAKE COMIC CON SAYS COURT-ORDERED PAYMENT OF $4 MILLION IN TRADEMARK WAR WILL\" DESTROY' THE EVENT: The producers of the Salt Lake City comic convention fear for the event's future, and Utah's economy, after they were given a court order to pay $4 million in a trademark infringement war with San Diego Comic-Con. The Salt Lake Tribune: \"Dan Farr Productions, the company behind the FanX Salt Lake Comic Convention, filed an emergency motion with the U.S. 9th Circuit Court of Appeals on Wednesday, asking for a temporary postponement on the payment pending appeal in court. If the $4 million judgment is enforced, the company will be\" destroyed,' the motion states, costing Utah's economy \"millions of dollars .' But the court\" likely wouldn't harm' the other party--San Diego Comic-Con, by granting a stay. The California-based convention sued the event formerly known as Salt Lake Comic Con in 2014 about the use of \"comic con' in the Utah company's name. San Diego Comic-Con's legal team argued that even without the hyphen, those words infringed on its own trademark and confused people into thinking the events were associated. A federal jury sided with San Diego Comic-Con at the end of last year but found there had been no willful infringement and awarded FanX a slight break on attorney fees. The jury awarded $20,000 in damages to San Diego Comic-Con, which had originally sought $12 million, and $3.9 million in attorney fees and costs rather than the $5 million its lawyers had initially asked for. Still, the Utah-based company said in its motion Wednesday that the\" nearly $4 million award is wildly excessive .' The producers of FanX are also protesting a judgment that FanX stop using the phrase \"formerly known as Salt Lake Comic Con' in advertising and social media and delete any posts before the court ruling that refer to their event as\" comic con .' \"https: //bit.ly/2OlTNAF * INDUSTRY NEWS * AccorHotels has completed its acquisition of a 50-percent stake in Sbe Entertainment Group. Sbe founder and C.E.O. Sam Nazarian will control the remaining 50 percent. * LOCAL NEWS * ATLANTIC CITY: Caesars Entertainment has announced new restaurant concepts at its Atlantic City properties. Harrah's Atlantic City has debuted <mark>Gordon Ramsay</mark> Steak, which seats 280 guests; Caesars Atlantic City has debuted a bar and lounge called 2100 Bar & Lounge; and Bally's Atlantic City has debuted surf-inspired bar Bally's Beach Bar. CHICAGO: Viceroy Chicago hotel has launched\" Designer Doors for Charity, \"a monthlong installation that showcases doors on the fifth floor painted by eight local artists, each depicting an interpretation of the fight against breast cancer. A portion of revenue from each room booked on the floor throughout October will be donated to the Lynn Sage Cancer Research Foundation. AIC Hotel Group has announced plans to open a 100-key Nobu Hotel this spring in the city's Fulton Market district. That's in addition to Nobu Hotel Los Cabos, the brand's first property to open in Mexico, slated to open in early 2019. Chicago Children's Museum will unveil its renovated meeting and event spaces on October 16. LONDON: BMF Media Group has opened a London office to expand its global footprint. Craig MacIntyre will lead the London office and the continued expansion. LOS ANGELES: The inaugural Wellspring from Wanderlust Wellness Conference takes place October 26-28 at the Palm Springs Convention Center. The event will feature more than 200 workouts, lectures, workshops, and panels from Glennon Doyle, Marianne Williamson, Alicia Silverstone, and more. Hotel Indigo Los Angeles Downtown has partnered with Baron Hats to host a monthlong pop-up shop October 18 through the end of November. The shop will showcase Baron Hat creations, including those worn by Beyoncé during her Formation Tour, Sylvester Stallone in Creed, Harrison Ford in Indiana Jones, and <mark>Ed Harris</mark> in Westworld. Attendees will be able to purchase hat replicas and order a customized hat. For information on upcoming events in Los Angeles, visit Masterplanner: http: //www.masterplanneronline.com/losangeles NASHVILLE: Water and music attraction SoundWaves will open at Gaylord Opryland Resort in December. The venue will have 106,000 square feet of outdoor water attractions and 111,000 square feet of indoor attractions including lazy rivers, rock climbing, restaurants, and an adults-only indoor pool, bar, and lounge. NEW YORK: Lufthansa will host Fly Through Time, an interactive consumer pop-up, on Sunday at Duarte Square. The activation will feature a 1950s-theme Lufthansa terminal set; an interactive model of the 1958 Lufthansa Super Constellation\" Senator Service \"first class onboard lounge; an augmented-reality mirror where guests can virtually dress in vintage uniform and passenger styles; an A.R. model of the first-ever luxury transatlantic flight; and a life-like boarding scenario. The New York Civil Liberties Union (N.Y.C.L.U.) will host its 16th annual Broadway Stands Up For Freedom concert We The People on October 15 at Town Hall. Alan Cumming will receive the 2018 Freedom Award. The fourth annual Through Her Lens: The Tribeca Chanel Women's Filmmaker Program, in collaboration with Pulse Films and Tribeca Film Institute, will take place October 16-18. The three-day program provides mentorship, project support, and master classes for 10 emerging female filmmakers and awards $100,000 in grants. Meatpacking District's annual Harvest Fest will take place October 27. The event will feature bites from neighborhood restaurants including Fig & Olive, Santina, and Dos Caminos. For information on upcoming events in New York, visit Masterplanner: http: //www.masterplanneronline.com/newyork RALEIGH, NORTH CAROLINA: Visit North Carolina has named J Public Relations its PR agency of record. VANCOUVER: In Goop Health will have its first Vancouver edition October 27-28 at Stanley Park Pavilion. WASHINGTON, D.C.: Sage Hospitality has appointed <mark>Mike Nelson</mark> general manager and Portia Hood director of sales and marketing to the Alexandrian Hotel and Morrison House. YOUR NEWS: What are you doing? Tell us: tips @ bizbash.com. JOB BOARD: Post a job or find a job: http: //jobs.bizbash.com With contributions from Claire Hoffman in Los Angeles and Beth Kormanik, Michele Laufik, and Ian Zelaya in New York. BizBash Daily is the must-read digest of event industry news from BizBash.com. Feed the Sheet: tips @ bizbash.com Subscribe: www.bizbash.com/bizbashdaily Advertise with BizBash: n_peck @ bizbash.com", "articleID": "2018101214_00051834_W", "names": {"Mike Nelson": ["Q1933393", "Q3857428", "Q6848173"]}}, {"date": "2018-10-12", "url": "http://www.goal.com/en-india/news/105/main/2018/10/13/48529032/forget-mandzukic-its-over-dalic-wants-croatia-to-move-on", "content": "UEFA Nations League <mark>Jack Davies</mark> 23:42 Comments Getty Images UEFA Nations League Croatia v England Z. Dalić M. Mandžukić Croatia England The Juventus forward retired from international duty after the World Cup and the Croatia boss says it is time to move on Zlatko Dalic has told Croatia to forget Mario Mandzukic as he works to uncover a replacement for the Juventus striker. Mandzukic retired from international duty following his country's run to the World Cup final and Croatia have scored just one goal in three matches since, the latest of which was a 0-0 draw against England on Friday. That result followed a 6-0 drubbing at the hands of Spain but coach Dalic is focusing on the future, rather than dwelling on the past. \"It is not like us not to be able to score two matches in a row,\" he said. \"But we have to forget Mandzukic, it is over, he is not with us anymore .\" He made his decision and we have to respect that and look for other solutions. \"Croatia rode their luck at times in a match that was played behind closed doors as punishment for a swastika that was marked on the pitch ahead of a Euro 2016 qualifier against Italy. England hit the woodwork twice through Eric Dier and <mark>Harry Kane</mark>, while Marcus Rashford squandered two golden opportunities in the second half .\" It was a tough game, as we expected. We were compact and aggressive, better than in last match, \"said Dalic .\" It was not easy to come back after such a big defeat. It is still not as we should be playing, we have to be braver in attack, more decisive and keep the ball better. Article continues below \"We created some good chances but also were lucky with them hitting woodwork twice. I am satisfied with our game organisation and defensive block, which was bad in Spain .\" It was not easy to play that kind of game [at an empty stadium], it was sad and I hope it's the last time. I hope we will host Spain in front of 30,000 people in Maksimir Stadium. \"I am satisfied with our performance, although I hope we'll be better .\" Comments ()", "articleID": "2018101223_00382859_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"], "Jack Davies": ["Q25171802", "Q6112030"]}}, {"date": "2018-10-13", "url": "http://articles.economictimes.indiatimes.com/news/politics-and-nation/supreme-court-stays-uttarakhand-high-courts-order-banning-religious-outfits-from-issuing-fatwas/articleshow/66189951.cms", "content": "Supreme Court stays Uttarakhand High court's order banning religious outfits from issuing fatwas By Samanwaya Rautray, ET Bureau | Oct 13, 2018, 07.03 AM IST READ MORE ON \"Uttarakhand High Court | Raju Ramachandran | fatwa | Delhi | Constitution of India\" The panchayat, instead of sympathising with the woman, had the audacity to remove the family from the village, \"a division bench of acting Chief Justice <mark>Rajiv Sharma</mark> and Justice <mark>Sharad Kumar</mark> <mark>Sharma</mark> had said. New Delhi: The Supreme Court on Friday stayed a controversial Uttarakhand High Court order which had banned all religious institutions from issuing any fatwas, or diktats or firmans, till it examined the constitutional validity of the issue. A bench led by Justice Madan B Lokur also issued notices to the state government to place its stand formally on the issue. Justice <mark>Deepak Gupta</mark> was the other judge on the bench. The high court had imposed this blanket ban on any kind of orders being passed by any religious institution following a media report that a rape victim's family had been banished from the village under such an order. The case was argued in the top court by senior advocate Raju Ramachandran. The petition was filed by <mark>Shakeel Ahmed</mark> Syed. Fatwas are non-binding advisory opinions provided under Islamic law by a Muslim cleric, the petition filed by the Jamat-e-Ulema-e-Hind said. There was nothing illegal and unconstitutional a b o u t t h e s e, Ramachandran told the top court. The top court has in earlier judgements upheld the validity of these nonbinding opinions, he argued. These are only valid between parties who seek such opinion on any religious iss u e, b u t a r e non-binding, the petition said. The High Court had ruled that no religious body, statutory panchayat or group of p e o p l e i n Uttarakhand can issue a fatwa, because it\" infringes upon the statutory rights, fundamental rights, dignity, status, honour and obligation of individuals \".\" The panchayat, instead of sympathising with the woman, had the audacity to remove the family from the village, \"a division bench of acting Chief Justice <mark>Rajiv Sharma</mark> and Justice <mark>Sharad Kumar</mark> <mark>Sharma</mark> had said .\" Fatwa is nothing but extra-constitutional adventurism, not permissible under the Constitution. \"The High Court had acted on a media report which was brought to its attention by an advocate. The bench had directed that the media report be treated as a public interest litigation and directed that criminal proceedings be initiated against the panchayat members who issued the diktat. In this case the panchayat had ordered that the rape victim's family to be banished from the village of Laskar in Haridwar. The High Court had also asked the police to give protection to the family.", "articleID": "2018101301_00242322_W", "names": {"Deepak Gupta": ["Q16745252", "Q39073074", "Q48741305"], "Rajiv Sharma": ["Q16223440", "Q47532510", "Q57286957"], "Shakeel Ahmed": ["Q24005560", "Q24005561", "Q24005562", "Q24005564", "Q25206235", "Q3527966"], "Sharad Kumar": ["Q16186757", "Q27069143", "Q37380153"]}}, {"date": "2018-10-13", "url": "http://www.washingtontimes.com/news/2018/oct/13/old-army-depot-now-teems-with-wildlife-in-iowa/", "content": "Old Army depot now teems with wildlife in Iowa Follow Us Will there be a \"blue wave' in the midterm elections? Question of the Day By BARB ICKES - Associated Press - Saturday, October 13, 2018 SAVANNA, Iowa (AP) - The little office is what you'd expect, mostly. One wall of the National Wildlife & Fish Refuge office at Savanna is occupied by your typical taxidermy. The stuffed owls, hawks and eagles should come as no surprise in such a habitat, right? On a table under the mounted birds of prey, however, is a collection that doesn't fit the motif. Scattered upon the little display table are hand grenades, mortar shells, shrapnel and bullets. Hawks and hand grenades? Welcome to the Lost Mound Unit, formerly the Savanna Army Depot. The old depot property an hour north of the Quad-Cities, bequeathed to the Refuge when the Army shipped out about 15 years ago, contains a bunch of little surprises, rolled into one. The natural beauty is striking, for sure. What a treat it would be to help manage the old prairie's return - if only the bombs weren't hiding underfoot. The Quad-City Times reports that when the Refuge was the Depot, it contained a massive operation. During World War II, Savanna was the largest munitions storage base in the country. During that period, about 7,500 people worked there, making, testing and storing artillery and explosives. An untold number of unexploded ordnance - UXO - never was accounted for. Along with the pieces of scrap that are scattered on the table in the office are several large photographs of items found on the property that cannot be displayed. One such photo shows a practice grenade, found in shallow water of the Mississippi River by contractors digging for fiber-optic cable. Live rounds have been found, too, and there's the rub: How do you know the difference?\" You don't know whether it's live or scrap, \"said Wildlife Refuge Specialist Alan G. Anderson .\" From bombs to bullets, it's all here. The first bombs dropped after Pearl Harbor were made here. \"On the backside of Anderson's business card, the reality of the risk is in black and white:\" UXO-MEC (Munition of Explosive Concern) DO NOT TOUCH! \"Do Not Move Closer, Remove or Disturb. Mark Your Location (leave a hat).\" Walk Away (on same path you entered)... After hours or weekends call 911. \"The explosive risk is so worrisome in large sections of the former depot, the public never will be allowed there. But the public also has more access than ever before. The U.S. Fish & Wildlife Service accepted the mission from the federal government to manage nearly 10,000 acres of the former Army Depot. And that's what they're doing - one cautious step at a time .\" If there's risk, we won't take it. We'll manage it, \"Anderson said. In fact, he manages 4,000 acres, focusing primarily on restoring the prairie to its natural state and urging it into a condition that makes it increasingly accessible to the public. He pointed to a map on his office wall and said,\" That shows where you can and cannot go. The Illinois EPA, U.S. EPA and the Army have to declare a site clean before it can be included in what's open to the public. \"A large swath of land near the center of the Lost Mound Unit of the refuge is restricted. Called the\" range fan, \"it's the area where munitions made at the depot and at the Rock Island Arsenal were test fired and proof fired .\" Thousands of rounds of live munitions were fired, and some hit the ground without going off, \"said Ed Britton, manager of the Savanna District of the Upper Mississippi River National Wildlife & Fish Refuge, which includes Lost Mound .\" A couple of years ago, during a land survey in the range fan, more than 1,000 black powder grenades were found. \"You can clean up everything you find, but you'll never find everything .\" The government already has spent at least $200 million cleaning up the munitions left by the Army's operations, Britton said. Estimates suggest the final cost could reach $350 million. \"As World War I, World War II, Korea and Vietnam all wound down, the leftover munitions had to be stored somewhere, and tens of thousands were at Savanna,\" he said. \"They had to be tested to see if they still worked .\" Some munitions were dumped into a giant burn pit to be destroyed. They'd just put an explosive on the top of the pile. But some didn't explode; they just scattered around about a 2,000-acre tract that'll never be open to the public. \"Most of the ominous-sounding\" range fan \"acreage - an old firing range, basically - has been a dream for the Fish & Wildlife folks. When the Army had the Depot, grazing animals were permitted on sections. They ate the grass, which reduced the fire risk. Storing enormous quantities of explosives, they couldn't be too careful about fire. But the grazing ended when the land went to the Refuge, and the grass grew back .\" With a grass habitat, mice came, \"Anderson said .\" That's what brought owls here. \"In 2002, 40 long-eared owls were counted in a grove of pines in the range fan. That was the biggest concentrated population of the species in the nation. They had been on the endangered list .\" An endangered species of turtle also has occupied the old depot, courtesy of its rich supply of sand. The refuge, after all, contains the largest sand dune in Illinois. The sand prairie at Savanna is ten times larger than the next size of dune, and its presence is a magnet to wildlife. One such creature is the Ornate box turtle, which is like a tortoise in that it lives in sand, not water. The species is on Illinois' list of threatened species, but it is thriving at Savanna. A small population of the turtles was identified south of Savanna at Thomson, which is part of the Refuge and where Britton's district office is located. When Ornate box turtle nests are found at Thomson, four eggs are removed. Two go to Niabi Zoo in Coal Valley and the other pair go to a zoo in Chicago for incubation and care, Anderson said. After about a year, two are released at Savanna and two at Thomson. While Anderson is not a biologist, he is a big player in the turtle-conservation effort. \"This project took 20 acres of turtle fence - the largest there is,\" he said. \"It's a 24-inch steel strip that we dug 12 inches into the ground, leaving 12 inches above. There's then what looks like a barbed-wire fence and a third layer of fencing .\" My job is to build that fence. My job is not to manage turtles. But I'm happy to help. It's another way the Army left us a treasure. \"Many things at the refuge catch your eye, including the height of the prairie grass (to your shoulders in areas), the silence of the remote refuge, the abundance of wildlife (including birds I didn't recognize) and the vast absence of civilization. But the bunkers are what really grab you. The concrete structures with grass roofs look like pyramids that had their points seared off. Besides being oddly shaped, they appear oddly located - sitting vacant among the cactus and milkweed. Anderson and others with the refuge call them\" igloos, \"and he has 409 of them to maintain .\" There were 410, \"he said .\" One went boom! \"Seventy years ago, Britton elaborated, one of the bunkers got too cold. It was filled with land mines, containing liquid chemicals and a fuse, which typically were stored at about 55 degrees. Somehow, the temperature in the bunker dropped to the point the chemical froze, causing a massive explosion .\" It was heard all the way to Hanover (about 14 miles away), \"Britton said .\" It blew storefront windows out for miles around. \"Thereafter, fuses never were loaded into munitions while in storage. The old bunkers were long ago disarmed, and Anderson doesn't have much to do on the maintenance front, given they're thoroughly sealed and unused. The property contains hundreds of other igloos, differentiated by single doors, which belong to the refuge. The bunkers with double doors are on land that is privately owned, which accounts for another few thousand acres of former depot. The sloping grass rooftops give a false impression. It wasn't until Anderson permitted me to pull open one of the 1,000-pound doors that the vastness of the interior revealed itself. He rattled off the dimensions: 15 feet tall at the center; concrete 2 feet thick on the sides and back wall; 1 foot of concrete on the front wall and ceiling; 60 feet in length and 30 feet wide. None of the igloos face one another. That way, an explosion in one would have less of a chance of taking out another. The Army stored massive amounts of munitions in the bunkers - from bullets to 500-pound bombs. The walls contain lots of scribble, but it's not just graffiti. A few personal messages, mostly initials and dates, mingle with the copious ledger-like jottings .\" They basically took inventory on the walls, \"Anderson said .\" As they hauled things in and out, they sometimes kept a count on the wall. It's almost an historical document. \"Other telltale signs appear on the walls, including deep and shallow scratches and gouges in the concrete. As weapons and munitions were loaded in and out, their pallets and racks sometimes made contact with the concrete. As I stepped outside to give photographer <mark>Kevin Schmidt</mark> uninterrupted interior shots, I spotted something on the ground. It looked like a large o-ring; a circular piece of black plastic .\" You've proven once again there's military stuff everywhere, \"Anderson said as I handed him the relic .\" That's a bomb cap, probably from a 100-pound bomb. They placed them on the nose of a bomb as they put it in storage. \"In addition to the igloos, the old base contains many buildings of varying size. Some are in private hands. While there once as an inventory of 30\" black powder magazine storage \"buildings, only two remain. The refuge uses the remaining 100-year-old structures (with pine rafters) to store hunting blinds, animal monitoring equipment and other supplies. Everyone wants to see the land in Savanna become much more refuge than depot .\" We're trying to recreate the old black oak savanna, \"Anderson said .\" We spend a lot of time on burns that encourage the prairie to return. \"And there is evidence everywhere that it's working. In addition to the on-site success of the Ornate box turtle and the long-eared owl, other animals and plants are coming back with gusto. A total of 47 species of endangered or threatened plants and animals have been observed at Lost Mound. Anderson burns about 1,000 acres each winter to coax the natural grasses back onto the prairie in the spring. Meanwhile, exotic and invasive species are fought back. It's easy to get caught up in the fascinating history of the depot and give short shrift to the ongoing success of the refuge. But that would be a mistake .\" Trappers can take five otter. That's how abundant they've become, \"Anderson said .\" It's not unusual to have another species observed out here, especially with so much prairie coming back. \"The Army didn't destroy it. They just suppressed it .\" ___", "articleID": "2018101306_00048386_W", "names": {"Kevin Schmidt": ["Q10432773", "Q1740247", "Q1740249", "Q26091", "Q3195802"]}}, {"date": "2018-10-13", "url": "https://www.krmg.com/news/national-govt--politics/trump-expected-meet-american-pastor-released-turkey/9oSrDohXIlL3WESZC1aCNJ/", "content": "<mark>Trump</mark> expected to meet American pastor released by Turkey Photo Credit: AP Photo/Emre Tazegul Pastor Andrew Brunson, center, and U.S. Charge d'Affaires Jeffrey Hovenier, left, arrive at Adnan Menderes airport for a flight to Germany after his release following his trial in Izmir, Turkey, Friday, Oct. 12, 2018, A Turkish court on Friday convicted an American pastor of terror charges but released him from house arrest and allowed him to leave Turkey, in a move that is likely to ease tensions between Turkey and the United. (AP Photo/Emre Tazegul) <mark>Trump</mark> expected to meet American pastor released by Turkey October 13 2018 1:28 AM Updated: October 13 2018 1:27 AM Photo Credit: AP Photo/Emre Tazegul WASHINGTON - An American pastor freed after nearly two years of detention in Turkey is expected to meet President <mark>Donald Trump</mark> at the White House on Saturday. The release of Andrew Brunson was a diplomatic triumph for <mark>Trump</mark>, who is counting on the support of evangelical Christians for Republican candidates in the November election. Thousands of <mark>Trump</mark>'s supporters cheered Friday night when he informed them that Brunson was once again a free man. \"I'm really proud to report that earlier today we secured the release of pastor Andrew Brunson from Turkey,\" <mark>Trump</mark> said at a campaign rally in Ohio. \"He is now free from jail and he is in the air heading to Germany, where he'll get offered a brief check and I think he's going to be in great shape. And then he's coming to Washington, D.C., tomorrow and we'll say hello to him .\" Brunson, a North Carolina native, was due to arrive at Joint Base Andrews near Washington around noon. \"He went through a lot but he's on his way back,\" added <mark>Trump</mark>, who had pressured the government of Turkey, a U.S. ally, to release Brunson. <mark>Trump</mark> also used the outcome to remind the audience of other detained Americans who regained their freedom under his leadership. They include three Americans released this year by North Korea before <mark>Trump</mark>'s historic meeting with North Korean leader <mark>Kim Jong Un</mark>, and an Egyptian-American charity worker freed by Egypt in 2017. \"We bring a lot of people back and that's good,\" <mark>Trump</mark> said. A Turkish court on Friday convicted Brunson of having links to terrorism and sentenced him to just over three years in prison, but released the 50-year-old evangelical pastor because he had already spent nearly two years in detention. An earlier charge of espionage was dropped. Hours later, Brunson was flown out of Turkey, his home for more than two decades. He was being taken to a U.S. military hospital in Landstuhl, Germany, for a medical check-up before the trip to Washington and Saturday's meeting with <mark>Trump</mark>. \"I love Jesus. I love Turkey,\" an emotional Brunson, who had maintained his innocence, told the court at Friday's hearing. He tearfully hugged his wife, Norine Lyn. Burson's release could benefit Turkey by allowing the government to focus on an escalating diplomatic crisis over Jamal Khashoggi, a Saudi contributor to The Washington Post who has been missing for more than a week and is feared dead after entering the Saudi consulate in Istanbul. Turkish officials suspect Khashoggi, a critic of the Saudi government, was killed in the consulate; Saudi officials deny it. Turkey may also hope the U.S. will now lift tariffs on Turkish steel and aluminum imports, a move that would inject confidence into an economy rattled by high inflation and foreign currency debt. But Brunson's release doesn't resolve disagreements over U.S. support for Kurdish fighters in Syria, as well as a plan by Turkey to buy Russian missiles. Turkey is also frustrated by the refusal of the U.S. to extradite Fethullah Gulen, a Pennsylvania-based Muslim cleric accused by Turkey of engineering a 2016 coup attempt. Brunson was accused of committing crimes on behalf of Gulen and Kurdish militants who have been fighting the Turkish state for decades. He faced up to 35 years in jail if convicted of all the charges against him. The pastor, who is originally from Black Mountain, North Carolina, and led a small congregation in the Izmir Resurrection Church, was imprisoned for nearly two years after being detained in October 2016. He was formally arrested that December and placed under house arrest on July 25 for health reasons. Turkish President Recep Tayyip Erdogan had resisted U.S. demands for Brunson's release, insisting that the courts are independent. But he had suggested a possible swap involving Brunson and Gulen, who has denied organizing the coup attempt. ___ Follow Darlene Supervile on Twitter: http: //www.twitter.com/dsupervilleap Read More VIEW COMMENTS Melania Trump says she ignores rumors of <mark>Trump</mark>'s infidelity Melania Trump says she loves President <mark>Donald Trump</mark> and has \"much more important things to think about\" than allegations he cheated on her. Mrs. <mark>Trump</mark> says she's \"a mother and a first lady\" and media outlets \"speculate\" about her marriage and \"circulate the gossip .\" She says allegations of her husband's infidelities are not a \"concern and focus .\" Porn star Stormy Daniels says she had sex with <mark>Donald Trump</mark> years ago. The president has denied a tryst with Daniels but has acknowledged reimbursing his lawyer for a hush money payment made to her. Mrs. <mark>Trump</mark> has generally stayed quiet on the subject. Asked if she loves her husband, she says, \"Yes, we are fine. Yes .\" Mrs. <mark>Trump</mark> was interviewed on her Africa trip by ABC, which aired portions Friday on \"Good Morning America .\" Hershey's mixes two favorites in new candy bar It is a match made in candy heaven .>> Read more trending news The Hershey Company is debuting a new candy bar that combines the company's signature chocolate bar with Reese's Pieces, and has found the perfect couple to celebrate the union, WHTM reported. Hershey's invited Craig Hirschey and Jenny Ries for a photo shoot at the company's headquarters in Hershey, Pennsylvania, the television station reported. The couple got engaged this year and will be married in February. Undoubtedly, this couple has shared some kisses during their four-year courtship, and Hershey will document that love in its marketing campaign, WHTM reported. The new candy bar will hit stores in November. With deal on judges, Senate goes home for the elections Less than a week after ending a bruising partisan fight over the confirmation of Supreme Court nominee Brett Kavanaugh, the U.S. Senate joined the House in heading home for the November mid-term elections, as Democrats and Republicans agreed to allow approval of a package of GOP nominations, freeing those Senators who are up for re-election to return home to campaign. The House left town two weeks ago; both chambers will return for their next votes on November 13, a week after Election Day. Democrats cut the deal despite a lot of grumbling from their own side, as many more liberal activists wanted the Senate to stay in session, and have Democrats force votes and debates over any judicial nominee by President <mark>Trump</mark>. 15 judges were approved in the deal, which included three nominees to federal appeals courts, and a dozen federal district judges. While Democrats have forced Republicans to use extra debate time repeatedly on nominations, GOP leaders have been relentless in using time on the Senate floor for judicial picks by President <mark>Trump</mark> in 2017 and 2018, confirming 84 judges to all levels of the judiciary. And with the rules changes in the Senate--spearheaded by Democrats back in 2012--which eliminated the use of the 60 vote filibuster against judicial nominees, there isn't much Democrats can do to stop those <mark>Trump</mark> nominations, unless Republicans refuse to support the choices. \"<mark>Trump</mark> and McConnell are confirming conservative judges at a breakneck pace in what's sure to be <mark>Trump</mark>'s most enduring legacy,\" said <mark>Brian Fallon</mark>, who worked for Hillary Clinton and the Obama Justice Department, and has tried to spur Democrats to fight harder to block President <mark>Trump</mark>'s nominees. \"Senate Must Stop Rubberstamping of <mark>Trump</mark>'s Takeover of Federal Courts,\" boomed a press release by the Leadership Conference on Civil and Human Rights, as liberal groups denounced the deal. But without any votes from Republicans--Democrats are powerless to stop the GOP from confirming judges. Their best weapon is to simply win a majority in the Senate in the upcoming election. The Senate has confirmed President <mark>Trump</mark>'s judicial nominees at a historic pace--84 total, including Brett Kavanaugh and Neil Gorsuch to the Supreme Court, 29 circuit judges, and 53 district court judges .--Leader McConnell (@ senatemajldr) October 11, 2018 A number of other nominations by the President were also approved late Thursday, including a series of ambassadors. As GOP Senators crowed about their record number of judicial confirmations, they also took aim at Democrats on the way out of town. \"Senate Democrats must want to get out of Washington to campaign,\" said Sen. John Cornyn (R-TX). One note--while the House and Senate will not conduct any legislative business until after the elections, but Congress is not officially in \"recess'--so, President <mark>Trump</mark> will not be able to make any recess appointments. Driver ed teacher rear-ends car while drunk A Long Island driver education teacher rear-ended a car while drunk, then drove off, without his students, police said. Russell Cohen, 58, was instructing four students from Suffolk Auto Driving School Saturday when they began to suspect he was inebriated .>> Read more trending news Cohen was asked at 11 a.m. to stop at a McDonald's, where the students got out and called 911. Cohen then drove off and hit a car. The victim was treated for non-life-threatening injuries, police said. Cohen was arrested and charged with aggravated driving while intoxicated and endangering the welfare of a child. The Associated Press contributed to this report. Police release photo of suspected serial robber Owasso Deputy Chief of Police Jason Woodruff says the investigation of a robbery at a Check N Go last week led them to two other similar cases. The Check Into Cash in Broken Arrow was robbed October 1st. The Muskogee store was robbed in September. Police are asking anyone with information on any of the cases to come forward. Investigators from all three Green Country cities are now working together to identify the suspect. Police are hoping that someone will recognize him in the surveillance picture and call police. The suspect did have a gun and should be considered armed and dangerous. Anyone with any information is asked to contact the Owasso Police Department at 918-272-COPS. Callers can remain anonymous.", "articleID": "2018101307_00163290_W", "names": {"Brian Fallon": ["Q2503485", "Q27656993", "Q4963711"], "Donald Trump": ["Q22686", "Q27947481"]}}]