[{"articleID": "2012020612_00027631_W", "names": {"Javier Hernandez": ["Q16225765", "Q5927834", "Q6165550", "Q6165552"], "John Terry": ["Q20022506", "Q21463485", "Q381791", "Q83456"]}, "date": "2012-02-06", "url": "http://soccerway.com/news/2012/February/06/chelsea-taunts-inspire-ferdinand", "content": "rio ferdinand has thanked the chelsea fans who taunted him for inspiring manchester united's comeback at stamford bridge. rio ferdinand has thanked the chelsea fans who taunted him for inspiring manchester united's comeback at stamford bridge. the red devils were 3-0 down just five minutes into the second half of the premier league match but came back to draw 3-3 thanks to two wayne rooney penalties and a header from <mark>javier hernandez</mark>. and the united centre back, whose brother anton is at the centre of the <mark>john terry</mark> race row after accusing the england man of racially abusing him, was booed throughout the match. however, the defender later hit back via twitter, commenting: \"i got booed by the cfc fans today - well done guys. thanks for inspiring me & the lads!\" \"that's like fuel to me! teamspirit .\" chants directed at ferdinand were alleged to be heard at stamford bridge in an unsavoury a show of support for <mark>terry</mark>, who was absent due to injury, following the incident in october. the fa recently stripped <mark>terry</mark> of the england captaincy, against the wishes of manager fabio capello, after the centre-back's trial was delayed until july 9, after the euro 2012 finals. professional sports handicappers giving free and exclusive tips at betadvisor.com"}, {"articleID": "2016051616_00447608_W", "names": {"Gareth Jones": ["Q15990091", "Q16194126", "Q25189125", "Q28766870", "Q304629", "Q30505322", "Q5522881", "Q5522882", "Q5522883", "Q5522885", "Q5522889", "Q57245256"]}, "date": "2016-05-16", "url": "http://uk.reuters.com/article/us-health-who-glyphosate-idUKKCN0Y71HR", "content": "U.N. experts find weed killer glyphosate unlikely to cause cancer File photo of Monsanto's Roundup weedkiller atomizers seen on sale at a garden shop at Bonneuil-Sur-Marne near Paris, France, June 16, 2015. Reuters/Charles Platiau/Files LONDON May 16 The pesticide glyphosate, sold by Monsanto in its Roundup weed killer product and widely used in agriculture and by gardeners, is unlikely to cause cancer in people, according to a new safety review by United Nations health, agriculture and food experts. In a statement likely to intensify a row over its potential health impact, experts from the U.N.'s Food and Agriculture Organization (FAO) and World Health Organization (WHO) said glyphosate is \"unlikely to pose a carcinogenic risk to humans\" exposed to it through food. It is mostly used on crops. Having reviewed the scientific evidence, the joint WHO/FAO committee also said glyphosate is unlikely to be genotoxic in humans. In other words, it is not likely to have a destructive effect on cells' genetic material. Diazinon and malathion, two other pesticides reviewed by the committee, which met last week and published its conclusions on Monday, were also found to be unlikely to be carcinogenic. \"In view of the absence of carcinogenic potential in rodents at human-relevant doses and the absence of genotoxicity by the oral route in mammals, and considering the epidemiological evidence from occupational exposures, the meeting concluded that glyphosate is unlikely to pose a carcinogenic risk to humans from exposure through the diet,\" the committee said. Glyphosate is also \"unlikely to be genotoxic at anticipated dietary exposures\" , it added. The group reaffirmed an acceptable daily intake (ADI) of up to 1 milligram of glyphosate for every kilogram of body weight. CONTRADICTORY? The conclusions appear to contradict a finding by the WHO's Lyon-based International Agency for Research on Cancer (IARC), which in March 2015 said glyphosate is \"probably\" able to cause cancer in humans and classified it as a \"Group 2A' carcinogen. Seven months after the IARC review, the European Food Safety Authority (EFSA), an independent agency funded by the European Union, published a different assessment, saying glyphosate is\" unlikely to pose a carcinogenic hazard to humans \". The United States' Environmental Protection Agency (EPA), which first assessed glyphosate in 1986 and has reviewed it several times since then, had also previously concluded it has\" low toxicity for humans \". The differing findings thrust glyphosate into the centre of a row involving EU and U.S. politicians and regulators, the IARC experts, the WHO and environmental and agricultural scientists. The EU's pesticides committee is due to meet later this week to decide whether to re-license glyphosate. The U.S. EPA is being investigated for withdrawing a report saying the chemical is probably not carcinogenic. In a question-and-answer document issued alongside the joint FAO/WHO statement, the WHO denied that the conclusions by the joint group and by IARC were contradictory. It said they were\" different, yet complementary \", with the IARC assessment focussed on hazard while the other looked at risk .\" IARC reviews published studies to identify potential cancer hazards, \"the WHO said .\" It does not estimate the level of risk to the population associated with exposure to the hazard. \"In contrast, it said, the joint FAO/WHO committee looks at published and unpublished studies to assess the health risk to consumers from dietary exposure to pesticide residues in food. (Editing by <mark>Gareth Jones</mark>) More from Reuters Newsletters | Mobile Apps News and Media Division of Thomson Reuters Thomson Reuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on Reuters.com, video, mobile, and interactive television platforms. Thomson Reuters journalists are subject to an Editorial Handbook which requires fair presentation and disclosure of relevant interests. NYSE and AMEX quotes delayed by at least 20 minutes. Nasdaq delayed by at least 15 minutes. For a complete list of exchanges and delays, please click here. & copy; 2016 Reuters All Rights Reserved"}, {"articleID": "2011081822_00048565_W", "names": {"Laura Vaughan": ["Q20739849", "Q57445462"]}, "date": "2011-08-18", "url": "http://stuff.co.nz/southland-times/culture/arts/5473073/Baroque-trio-set-to-wow-Invercargill", "content": "baroque trio set to wow invercargill music from 400 years ago will come alive this weekend, as the trans-tasman baroque trio, latitude 37, perform a concert as part of chamber music of new zealand's 2011 kaleidoscopes season. wellington-born harpsichordist donald nicolson, 31, is a part of that trio, along with australians julia fredersdorff and <mark>laura vaughan</mark> on violin and viola da gamba. nicolson spent about eight years learning the harpsichord, a keyboard instrument. \"it sounds like 18th-century france,\" he says. taking music from 400 years ago and making it contemporary appeals to nicolson. \"there was something deeply emotional, and human about it,\" he says. he became interested in the instrument after his father rescued an old harpsichord from wellington's broadcasting house. he went to victoria university for four years, and then to the rock conservatorium in the hague, in the netherlands, for another four. while there, he studied with harpsichordist ton koopman, who he says was \"one of the godfathers of the harpsichord and early music movement. he influenced me very much .\" but although he came from a piano background, it was not until after 10 years of learning that he finally thought he was playing the way he wanted. \"it's all arts in a way. you're always practising, trying to keep getting better and find new ideas,\" he says. latitude 37 is a trio of performers, who were bought together through their love of dynamic performances of rock. they represent australia and new zealand combined, and this was where the name came from. latitude 37 is the latitudinal position linking melbourne to australia. the band formed in 2008 and this will be its second tour of new zealand. the band plans to wow southlanders on sunday at the civic theatre. \"i'm looking forward to it. i really like invercargill. it's a lovely, lovely town,\" he said. tickets are available from ticketdirect. nicole.mcdougall @ stl.co.nz ad feedback - the southland times"}, {"articleID": "2013082305_00034008_W", "names": {"Eric Holder": ["Q312644", "Q3591180"]}, "date": "2013-08-22", "url": "http://blogs.wsj.com/law/2013/08/22/gibson-dunn-hires-another-scotus-relative/", "content": "Supreme Court Justice Samuel Alito pictured in Sept. 14, 2012. Lawyers tend to beget other lawyers, and the latest example of the apple not falling far from the tree comes from a very prominent tree indeed-the Supreme Court of the United States. Philip Alito, son of Supreme Court Justice Samuel Alito, is joining Gibson Dunn & Crutcher LLP as an associate in the firm's Washington D.C. office (h/t Legal Times). \"He is a smart, talented and hard-working young lawyer with impressive credentials,\" Thomas Dupree, Jr., the firm's D.C. hiring partner, told Law Blog in an emailed statement on Thursday. \"We are delighted that he has chosen to begin his career with Gibson Dunn and look forward to welcoming him this fall .\" The appointment of a fee examiner to monitor legal bills in Detroit's Chapter 9 case comes in the midst of a push by the Department of Justice to crack down on the perception of bankruptcy as a billing bonanza for attorneys. Legal Events to Watch This Week This week: Army Pfc. Bradley Manning is likely to learn how much longer he must spend in prison for the largest breach of U.S. classified material in the nation's history. When judges and lawyers invoke Orwell, they usually cite \"Nineteen Eighty-Four .\" A recent court case in Ohio, though, provided fodder for references to \"Animal Farm .\" Attorney General <mark>Eric Holder</mark> said Monday the country's criminal justice system \"is in many respects broken,\" and called for \"sweeping, systemic changes\" to alter how criminal suspects are charged, tried, and punished. close Thank You Your email has been sent .? You must enter the verification code below to send .? Invalid entry: Please type the verification code again. close Thank You Your email has been sent .? You must enter the verification code below to send."}, {"articleID": "2017091119_00219556_W", "names": {"Stephen Ward": ["Q27831019", "Q334576"]}, "date": "2017-09-11", "url": "http://wkms.org/post/after-irma-shelter-residents-weigh-whether-brave-roads-or-wait-it-out", "content": "After Irma, Shelter Residents Weigh Whether To Brave The Roads--Or Wait It Out By Camila Domonoske • 57 seconds ago Tweet Share Google + Email View Slideshow 1 of 4 Flooding outside the Germain Arena in Estero, Fla., where some 5,000 people sought shelter from Hurricane Irma. Meredith Rizzo / NPR View Slideshow 2 of 4 Roger Forsythe volunteered at the Germain Arena, where thousands took shelter during the storm. \"This isn't safe for me to drive in,\" he says. Meredith Rizzo / NPR View Slideshow 3 of 4 Lydia Makarova's car broke down while she was trying to leave Germain Arena. Meredith Rizzo / NPR View Slideshow 4 of 4 After two nights in the shelter, many people were eager to leave and go home even though Lee County officials hadn't cleared the roads to travel. Meredith Rizzo / NPR Originally published on September 11, 2017 2:14 pm <mark>Stephen Ward</mark> arrived at the Germain Arena in Estero, Fla., at 4 o'clock in the morning on Saturday as Hurricane Irma was making its approach. On Monday morning, after the storm had passed, the elderly Fort Myers resident was unhappily looking out over the parking lot at the arena where some 5,000 people had sought shelter. \"I have to get home and see if I still have a house,\" he said. But the lot was covered in water, spilling from a nearby pond and rising over the hubcaps of the smaller cars. And both roads out of the parking lot were underwater, too. \"It's over. We made it out,\" <mark>Ward</mark> said, with an unhappy laugh that verged on tears. \"But we can't get out .\" A few minutes later, he climbed in his Lincoln Town Car and slowly drove out to try his luck. It's a decision that scores of residents in other storm-tossed parts of Florida were likely having to make. Germain Arena was secure during Irma, though not comfortable. The hockey rink was chilly, and the roof sprang a leak when the eyewall passed over late Sunday night. But after two nights in the shelter, people were eager to leave even though county officials hadn't cleared the roads to travel. \"They're going out right now on their own accord,\" Staff Sgt. Shawn Pennick of the Deep Florida Army National Guard said as he watched cars leave. He said the National Guard was warning people on their way out. \"If you feel that you want to do that, then you're able to go out, and if you get stuck--it happened,\" he says. It happened to Lidia Makarova. She pointed back at a row of six cars stranded on one road out of the arena. Her car was now on dry land, but the engine wouldn't start. Police told her to walk back to the shelter, she said. She pointed at her legs, soaked to the knee. \"It's very terrible. It's impossible .\" \"You call AAA, it's not working today,\" Makarova said. \"You call a garage to deliver my car home, it's not working. What [must I] do?\" A sheriff's deputy told her to wait and that someone would come along to help eventually. Five and a half hours later, she was still standing by her stranded car. In general, authorities in Lee County were urging residents to stay off the roads and be patient. The county's Department of Transportation said crews were working to clear culverts and catch basins, which \"should help with many standing-water issues .\" By the wall of the arena, three women, two men, three kids and a dog were resigned to wait it out. Teandra Evans of Fort Myers said she already had a good guess what she'd be going back to find. \"I know for a fact my apartment will probably be flooded,\" she said. \"When Harvey came and we just got that little rain, I was flooded. So just having this hurricane, I know it's flooded out there .\" And none of them were eager to risk the roads. \"It's a waiting game,\" said Veronica Smith. Curtis Christmas looked out over the parking lot, filled with indecisive drivers trying to gauge their odds. \"Ain't no reason to go out there and get stuck,\" he said. Copyright 2017 NPR. To see more, visit http: //www.npr.org/. Tags: Hurricane Irma Tweet Share Google + Email View the discussion thread."}, {"articleID": "2018070809_00085611_W", "names": {"Rashid Khan": ["Q14474511", "Q16227794", "Q21285307", "Q21621685", "Q4781922"], "Luke Wright": ["Q3529926", "Q6702480"], "Laurie Evans": ["Q6501566", "Q6501567"], "Michael Burgess": ["Q21005228", "Q22985966", "Q30071045", "Q6828931", "Q6828932"], "Tom Bruce": ["Q21620944", "Q542091"], "Chris Jordan": ["Q2895170", "Q5107045", "Q5107047"], "Danny Briggs": ["Q16193492", "Q5220180"]}, "date": "2018-07-08", "url": "http://www.theargus.co.uk/sport/16340520.will-beer-hails-sussexs-strength-in-depth/", "content": "Sussex's Will Beer 0 comments WILL BEER believes Sussex have the all-round depth to be a threat in this year's Vitality T20 Blast. Beer, 29, brought up his 100th T20 appearance for Sharks on Wednesday in the 36-run victory against Essex Eagles at Chelmsford. Beer hails Sussex's strength in depth Multiple Classic-winning trainer Dunlop dies Rosenior gets boost as he trains with Albion under-23s Albion closing in on goalkeeper Four Albion fixtures picked for live TV It was the ideal start for Jason Gillespie's side and they head to Wales today to face Glamorgan at Sophia Gardens looking to secure back-to-back wins. Spin sensation <mark>Rashid Khan</mark> made his debut in the win while David Wiese finished with a five-wicket haul. Beer was part of the Sussex side which won the competition in 2009 and hopes that success can be repeated with the current squad. He said: \"You have the dream and the hope every year in every competition to get a trophy .\" But if you look round our dressing room now we have the bowling attack but we also have the batting to go with it. \"We've got <mark>Luke Wright</mark> while <mark>Laurie Evans</mark> is in incredible form. <mark>Michael Burgess</mark> is playing really well and we also have <mark>Tom Bruce</mark>, who not many teams will know about, but is a really good player .\" I think we have real depth in our batting, real depth with the ball and we're going to have guys sat on the bench for a few games who would get into most teams around the country. \"It's very exciting so we just have to go out there, put performances together, not get complacent and take every game as it comes .\" Everybody is looking forward to it as a competition. \"Beer does not want to be one of those on the bench as he tries to add to his T20 appearances record for Sharks but knows the bowling options are the envy of many a club. He said:\" We have a lot of bowling options. If you look at the squad, we have the best T20 bowler in the world in <mark>Rashid Khan</mark>. \"And then you have guys who have played or are playing for England in <mark>Chris Jordan</mark>, Tymal Mills and <mark>Danny Briggs</mark>, while we also have the likes of David Wiese, who is also an international cricketer, as well as Jofra Archer .\" It's a tough team to get in to. \"Beer says short-format starman <mark>Khan</mark> has slotted in immediately. He said:\" <mark>Rashid</mark> has been really good so far and I have tried to pick his brains as much as I can in the short time he's been here. \"He's good to talk to about fields and bowling in different conditions. I am looking forward to spending a good two months with him .\" <mark>Khan</mark> picked up two wickets on his debut and was a box of tricks for the home batsmen to deal with. Beer said: \"He's got lots of different variations and he bowls it so fast it is so hard for the batsmen to pick .\" He's been so good because he bowled for an hour and a half in the nets the other day to <mark>Michael Burgess</mark> when he was batting and wicketkeeping so he's given a lot of time to the boys, especially <mark>Michael</mark> who is going to be keeping to him. \"That will help him get used to him so he can pick him .\" Leg-spinner Beer marked his ton of T20 appearances with a tweet which said: \"Proud to have made my 100th T20 appearance for @ SussexCCC yesterday! Hopefully there's another trophy around the corner for us this year! #doubleup #GOSBTS\" But he did not make a big deal of it before the game--even though he knew the milestone was on the horizon from a while back. He revealed: \"I knew last year that the last T20 game against Essex was my 99th as someone pointed it out .\" I've known all winter that I had one to go to bring up my century. \"It was pretty low-key really .\" A few of the boys knew but I didn't want to make a massive thing out of it. \"I just wanted to enjoy the game and contribute towards a win .\" The win was all the more special as Beer admits Chelmsford has not always been a happy hunting ground for Sussex. \"It's definitely special to go there and win and silence that crowd,\" he said \"They can be pretty rowdy so it was nice to hear them go quiet near the end. They were even trying to be nice to us - you know you have won them over when you have the Chelmsford crowd being nice to you .\" Now he wants to be part of the team that gives the crowd in Cardiff nothing to shout about and hopes conditions will work in Sussex's favour. He said: \"England are playing there (Friday).\" I expect we shall be playing on the same wicket and hopefully, that will work in my favour, playing on a nice used wicket. \"It usually is quite slow there and spins so, hopefully, conditions will suit our attack nicely .\" Sussex have named an unchanged squad for the trip. 0 comments"}, {"articleID": "2018110511_00336366_W", "names": {"Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "Mike Wallace": ["Q2272587", "Q2919006", "Q325487", "Q3313573", "Q6849199", "Q6849200"]}, "date": "2018-11-05", "url": "http://harwichandmanningtreestandard.co.uk/sport/17201682.coyle-new-boss-mark-was-a-big-factor-in-my-decision-to-join-witham/", "content": "Sport Coyle: New boss Mark was a big factor in my decision to join Witham By Matt Plummer @ MattPlummer4 Sports reporter New signing Kevin Coyle Picture: <mark>Chris Smith</mark> 0 comment KEVIN Coyle is delighted to be back at step four level--and says manager Mark Ashford is one of the main factors in his decision to join Witham Town. The 31-year-old is set to put pen to paper at training on Tuesday night, after a short spell with Thurlow Nunn League outfit Harwich and Parkeston. He will remain dual registered with the Shrimpers, who he joined after parting company with Coggeshall Town in early October. But for now he is excited to be back in the Bostik League north division and eager to be involved when second-from-bottom Witham head to basement boys Soham Town Rangers on Saturday. \"I'm back at the level I want to be at,\" said Coyle, who is also record appearance-maker at hometown club FC Clacton. \"I didn't feel out of place at Coggeshall .\" I felt I coped well and really enjoyed my time there. \"Everyone was lovely but I just didn't see eye to eye with the manager .\" That's why I left and now I'm very happy to have joined Witham. \"I've been so impressed with Mark Ashford .\" We've only spoken on the phone so far but he sounds very clued up. \"He's a UEFA A coach and reminds me of my brother (former Clacton boss David).\" He knows his stuff and is clearly very tactically aware and very strong in terms of his man-management skills. \"He's been up front with me from the word go .\" He hasn't tried to string me along and said from start \"this is my budget. This is what I can offer you' .\" Mark spoke highly of me. \"He'd clearly done his homework and remembered me from watching games this season, which counts for a lot .\" Coyle, who turned down an approach from another Bostik League side, believes his new Witham side are in a \"false position\". He is confident they can start climbing the table soon--starting with three points against Soham. \"I've played against Witham four times this season, for Coggeshall,\" he said. \"Each time, I could see they were getting better and better .\" They're a well-drilled side. \"Silly errors are still costing them but they've played all the sides currently in the top ten .\" From what I've seen, they're in a bit of a false position. \"Coyle also spoke highly of Harwich, who he has played for since leaving Coggeshall. He made his last appearance, and scored a goal, in Friday's 4-2 division one south victory against Brightlingsea Regent Reserves .\" It's been great fun playing for Harwich, \"said Coyle .\" I've really enjoyed it. \"They've got a good set of lads and I've got a good relationship with (manager) Kieron Shelley and (assistant) <mark>Mike Wallace</mark>.\" They've helped me and I've helped them. It's been mutually beneficial. \"They're good guys and they're doing a great job there, in the club's first season back at step six level .\" They don't look out of place and I've agreed to remain dual registered, so I might be able to help them out again later in the season. \"0 comment"}, {"articleID": "2011050413_00010739_W", "names": {"Timothy Williams": ["Q22097240", "Q23058846", "Q3529088", "Q7807612"]}, "date": "2011-05-04", "url": "http://goupstate.com/article/20110504/znyt02/105043013", "content": "security on higher alert across us <mark>timothy williams</mark> and ian lovett published: wednesday, may 4, 2011 at 5:15 a.m. last modified: wednesday, may 4, 2011 at 5:15 a.m. there have been no known specific or credible threats received since american troops killed osama bin laden this week, but on tuesday security at public spaces - including mosques, synagogues, train stations and basketball arenas - remained at elevated levels. police officers on tuesday monitored los angeles international airport, one of a number of sites where security was increased. although the department of homeland security has not issued an alert, the agency remains at what the homeland security secretary, janet napolitano, has called a \"heightened state of vigilance .\" the state department, on the other hand, has issued a worldwide travel alert to americans. in philadelphia, the police commissioner, charles h. ramsey, has placed the department on \"high alert,\" increased patrols around religious buildings, and intensified security at tourist attractions and shopping malls, the police said. \"we haven't added more personnel; we're just doing more checks and asking our officers and citizens to be more aware,\" said lt. ray evers, a police spokesman. the additional security includes hourly checks at some of the city's synagogues and mosques, as well as arranging meetings with building superintendents and representatives of large businesses and manufacturers to remind them to report suspicious activity to the police, lieutenant evers said. in phoenix, officials said they had supplemented security at the city's airport, municipal buildings and houses of worship and on its light rail system, said scott krushak, the coordinator for phoenix's office of emergency management. \"we're not doing it because we've had any threats, but because it is part of a\" lean forward' strategy we have here in the city of phoenix, \"mr. krushak said .\" we are really relying on the community to tell us if they see anything. \"in los angeles, the police sent additional officers to the staples center for the lakers playoff basketball game against dallas on monday, and officials said they intended to also supplement police patrols at dodger stadium. even before the death of bin laden, security at dodgers games had been stepped up after a fan of the rival san francisco giants was badly beaten in a stadium parking lot last month. in addition, lt. andy neiman, a police spokesman, said the police were paying particular attention to airports, ports and telecommunications hubs. at los angeles international airport on tuesday, debby cummings, 44, who was on a flight from detroit to visit friends in los angeles, said the security screening in detroit seemed normal except that more passengers had been told to go through full-body scanners. ms. cummings said that she had not been overly concerned about flying, but that her 15-year-old son had worried the plane might explode .\" in detroit they had two of the body scanners, which they were sending most people through, but other than that it was the same, \"she said .\" they only had one scanner before, and they didn't used to make the majority of people go through it. \"in chicago, the police department said it had sent additional officers to patrol around houses of worship, the richard j. daley center, and at the united center, where arena security personnel checked fans arriving to monday night's basketball game against atlanta with handheld metal detectors. similar procedures were to be in place for an n.b.a. playoff game in oklahoma city on tuesday night and for all remaining basketball playoff games, officials said. in miami, the police have added officers with dogs at miami international airport, but many airports around the country, including those in san francisco and seattle, said they had taken no additional security precautions because the federal government had not issued a threat warning. police investigating death of fairforest man killed with hatchet police release video of weekend assault at west-side bar in spartanburg"}, {"articleID": "2019012911_00160211_W", "names": {"John Simon": ["Q14917949", "Q17090371", "Q174650", "Q5480013", "Q56597927", "Q6257894", "Q6257900", "Q6257904"]}, "date": "2019-01-29", "url": "http://localnews8.com/news/national-world/pge-files-for-bankruptcy-after-california-wildfires/994149092", "content": "PG & E files for bankruptcy after California wildfires Utility faces billions of dollars in claims By: ROB MCLEAN AND CHRIS ISIDORE CNN BUSINESS Posted: Jan 29, 2019 03:25 AM MST Updated: Jan 29, 2019 03:25 AM MST The Camp Fire burns in the hills on Nov. 11, 2018, near Oroville, California. Justin Sullivan/Getty Images The Camp Fire burns in the hills on Nov. 11, 2018, near Oroville, California. Related content Lawsuit: Utility caused wildfire that preceded mudslides (CNN) - Pacific Gas and Electric has filed for bankruptcy protection after coming under pressure from billions of dollars in claims tied to deadly wildfires. California's largest power company said in a statement Tuesday that it had submitted a Chapter 11 bankruptcy filing in the Northern District of California. PG & E said it was committed to maintaining services for customers during the bankruptcy process. <mark>John Simon</mark>, the company's Interim CEO, said he would work \"to create a more sustainable foundation for the delivery of safe, reliable and affordable service .\" \"We have heard the calls for change and we are determined to take action throughout this process to build the energy system our customers want and deserve,\" he said in the statement. PG & E has been linked to a series of wildfires in California, including the Camp Fire, which caused 86 deaths and destroyed 14,000 homes, along with more than 500 businesses and 4,300 other buildings. PG & E announced on January 14 that it intended to file for bankruptcy, but it had to wait 15-day period required by California law. The company needs to use the bankruptcy process--which will allow it to shed some of its debt--to pay for damages and stay in business. PG & E said Tuesday it was seeking approval for a $5.5 billion debtor-in-possession financing agreement. Previously, it said in a filing that it has only about $1.5 billion in cash and cash equivalents on hand. The company has cited at least $7 billion in claims from the Camp Fire. It is believed that the Camp Fire was started when a PG & E power line came in contact with nearby trees. PG & E reported \"an outage\" on a transmission line in the area where the blaze began, about 15 minutes before it started. Within the massive burn area, PG & E found power equipment and a fallen power pole riddled with bullet holes, according to a letter it sent to regulators. The company also reported that it found a downed line with tree branches on it. In addition, a series of wildfires in 2017--many of which were also blamed on PG & E--caused $10 billion in damages and 44 deaths. In 11 of those fires, state investigators found the company violated codes regarding brush clearance near its power lines or had made related violations. Copyright 2019 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2008112104_00011088_W", "names": {"David Harley": ["Q42856967", "Q5234729"], "Billy Burke": ["Q325020", "Q4912295"]}, "date": "2008-11-21", "url": "http://bloody-disgusting.com/news/14405", "content": "twilight, beyond the break you can check out <mark>david harley</mark>'s thoughts on the film, which is about a high school girl named bella falls in love with a vampire. the new couple leads a rival vampire clan to pursue them and attempt to force her to decide if she, too, wishes to become one of the undead. the film opens in theaters tonight at midnight and is expected to take in close to $70m this weekend. don't forget to back in 2005, my then 12-year-old sister brought home a 498-page novel called twilight. she managed to breeze through it in only a day or two, talking up a storm about how good it was and even hinting that there was a faint possibility i might enjoy it. the premise of a teenage girl falling in love with a vampire, with lots of \"drama\" assumedly thrown into the mix, didn't strike me as anything original or something i'd want to waste a few hours on, so i shrugged it off and forgot about it, only to be reminded of it each subsequent year when the next installment was released. i had no idea how huge stephenie meyer's series was until this past august 1st, when i made a trip to a local bookstore around 7pm. a mob-like crowd of 15-year-olds gathered in the lobby, overtaking the store with their shrill, giddy laughter. \"why are all these people here? did rowling pop out another potter book and i didn't hear about it?\" i asked a worker who was making a feeble attempt to corral the tweens. \"new twilight book comes out at midnight\" she replied. even though i knew the film adaptation had wrapped principal photography back in april and its magazine covers had began to trickle out, it was at that moment, after making it to the periodical rack by wading through a giant crowd, when i realized that twilight was a pop culture phenomenon and a force to be reckoned with. having just seen twilight, a film which has proven itself to be among the most anticipated of the year, i can honestly say that i have no intention of ever reading the books now, simply because there is absolutely no way they can match the utter ridiculousness that oozes from every frame of catherine hardwicke's romantic-fantasy debut. kristen stewart stars as isabella \"bella\" swan, a shy 17-year-old who moves from phoenix, arizona to forks, washington to live with her father, charlie (<mark>billy burke</mark>). walking into biology class on her first day of school, bella spots edward cullen (robert pattinson), an angelic-looking outsider. the two share really bizarre passionate gazes while the wind blows through bella's hair and close-up shots of pouty lips, flickering tongues and deer eyes pop on screen at a more alarming rate than in whatever the last playboy \"best of\" video was. sadly, berlin's take my breath away was mysteriously absent in the background. after several mood swings on edward's behalf, bella eventually picks up on the fact that he's a vampire and makes him own up to it. sexually frustrated and apparently desperate, she falls for the vampire and begins the complicated relationship that will potentially last us for four films. of course, twilight wouldn't be much of a film if it stopped there (then again, it isn't much of a film after it keeps going either); enter james, an evil \"vampire\" who begins stalking bella just because he loves the thrill of the hunt. i feel weird using the word vampire in this review because i felt it was used in the film (and assumedly, the novel) for lack of a better phrase. the \"cold ones\" , as the quileute tribe refers to them as, aren't hurt by the sun, but rather sparkle like the diamond cream from arrested development in it. the cullen clan doesn't drink the blood of humans, only animals, and their body temperatures are frigid. they don't ever sleep, nor do they have fangs and their reflections can be seen in mirrors. they do, however, seem to have character-specific powers bestowed upon them, which are presented with the same quality of cgi found in a children's live-action show. the characters act more like superheroes than vampires, which makes sense in the context of the action-oriented ending and baseball sequence, but not during the goofy tone of the rest of the film. catherine hardwicke gave us thirteen back in 2003, a film that i personally enjoy. what's impressive about that script is that it was written in only six days by hardwicke and 14-year-old actress nikki reed, who takes on the role of rosalie in twilight. even though the character development is rushed, the film is an honest portrayal of the great lengths a teen will go to fit in and find themselves. you know what's impressive about the script for twilight? that a first-time writer/director and a 14-year-old could write more naturally sounding dialogue than an executive co-producer and writer from dexter. characters spout out lines like \"you're my own personal brand of heroin\" and \"hang on, my little spider monkey\" , leaving me confused as to whether it's supposed to be taken seriously or written as a cutesy tween joke. with a running time of a little over two hours, the joke is evidently on me. i hear the books aren't written well either, so maybe this is just a case of trying to stick to the source material to keep fans happy, however terribly conceived it might be to begin with. why would anybody want to see a vampire movie with no blood sucking or fangs!!! sarah director: catherine hardwicke another serial killer thriller in the works...first look at one of the creatures from the film ..."}]