[{"date": "2018-10-13", "url": "https://www.krmg.com/news/national-govt--politics/trump-expected-meet-american-pastor-released-turkey/9oSrDohXIlL3WESZC1aCNJ/", "content": "<mark>Trump</mark> expected to meet American pastor released by Turkey Photo Credit: AP Photo/Emre Tazegul Pastor Andrew Brunson, center, and U.S. Charge d'Affaires Jeffrey Hovenier, left, arrive at Adnan Menderes airport for a flight to Germany after his release following his trial in Izmir, Turkey, Friday, Oct. 12, 2018, A Turkish court on Friday convicted an American pastor of terror charges but released him from house arrest and allowed him to leave Turkey, in a move that is likely to ease tensions between Turkey and the United. (AP Photo/Emre Tazegul) <mark>Trump</mark> expected to meet American pastor released by Turkey October 13 2018 1:28 AM Updated: October 13 2018 1:27 AM Photo Credit: AP Photo/Emre Tazegul WASHINGTON - An American pastor freed after nearly two years of detention in Turkey is expected to meet President <mark>Donald Trump</mark> at the White House on Saturday. The release of Andrew Brunson was a diplomatic triumph for <mark>Trump</mark>, who is counting on the support of evangelical Christians for Republican candidates in the November election. Thousands of <mark>Trump</mark>'s supporters cheered Friday night when he informed them that Brunson was once again a free man. \"I'm really proud to report that earlier today we secured the release of pastor Andrew Brunson from Turkey,\" <mark>Trump</mark> said at a campaign rally in Ohio. \"He is now free from jail and he is in the air heading to Germany, where he'll get offered a brief check and I think he's going to be in great shape. And then he's coming to Washington, D.C., tomorrow and we'll say hello to him .\" Brunson, a North Carolina native, was due to arrive at Joint Base Andrews near Washington around noon. \"He went through a lot but he's on his way back,\" added <mark>Trump</mark>, who had pressured the government of Turkey, a U.S. ally, to release Brunson. <mark>Trump</mark> also used the outcome to remind the audience of other detained Americans who regained their freedom under his leadership. They include three Americans released this year by North Korea before <mark>Trump</mark>'s historic meeting with North Korean leader <mark>Kim Jong Un</mark>, and an Egyptian-American charity worker freed by Egypt in 2017. \"We bring a lot of people back and that's good,\" <mark>Trump</mark> said. A Turkish court on Friday convicted Brunson of having links to terrorism and sentenced him to just over three years in prison, but released the 50-year-old evangelical pastor because he had already spent nearly two years in detention. An earlier charge of espionage was dropped. Hours later, Brunson was flown out of Turkey, his home for more than two decades. He was being taken to a U.S. military hospital in Landstuhl, Germany, for a medical check-up before the trip to Washington and Saturday's meeting with <mark>Trump</mark>. \"I love Jesus. I love Turkey,\" an emotional Brunson, who had maintained his innocence, told the court at Friday's hearing. He tearfully hugged his wife, Norine Lyn. Burson's release could benefit Turkey by allowing the government to focus on an escalating diplomatic crisis over Jamal Khashoggi, a Saudi contributor to The Washington Post who has been missing for more than a week and is feared dead after entering the Saudi consulate in Istanbul. Turkish officials suspect Khashoggi, a critic of the Saudi government, was killed in the consulate; Saudi officials deny it. Turkey may also hope the U.S. will now lift tariffs on Turkish steel and aluminum imports, a move that would inject confidence into an economy rattled by high inflation and foreign currency debt. But Brunson's release doesn't resolve disagreements over U.S. support for Kurdish fighters in Syria, as well as a plan by Turkey to buy Russian missiles. Turkey is also frustrated by the refusal of the U.S. to extradite Fethullah Gulen, a Pennsylvania-based Muslim cleric accused by Turkey of engineering a 2016 coup attempt. Brunson was accused of committing crimes on behalf of Gulen and Kurdish militants who have been fighting the Turkish state for decades. He faced up to 35 years in jail if convicted of all the charges against him. The pastor, who is originally from Black Mountain, North Carolina, and led a small congregation in the Izmir Resurrection Church, was imprisoned for nearly two years after being detained in October 2016. He was formally arrested that December and placed under house arrest on July 25 for health reasons. Turkish President Recep Tayyip Erdogan had resisted U.S. demands for Brunson's release, insisting that the courts are independent. But he had suggested a possible swap involving Brunson and Gulen, who has denied organizing the coup attempt. ___ Follow Darlene Supervile on Twitter: http: //www.twitter.com/dsupervilleap Read More VIEW COMMENTS Melania Trump says she ignores rumors of <mark>Trump</mark>'s infidelity Melania Trump says she loves President <mark>Donald Trump</mark> and has \"much more important things to think about\" than allegations he cheated on her. Mrs. <mark>Trump</mark> says she's \"a mother and a first lady\" and media outlets \"speculate\" about her marriage and \"circulate the gossip .\" She says allegations of her husband's infidelities are not a \"concern and focus .\" Porn star Stormy Daniels says she had sex with <mark>Donald Trump</mark> years ago. The president has denied a tryst with Daniels but has acknowledged reimbursing his lawyer for a hush money payment made to her. Mrs. <mark>Trump</mark> has generally stayed quiet on the subject. Asked if she loves her husband, she says, \"Yes, we are fine. Yes .\" Mrs. <mark>Trump</mark> was interviewed on her Africa trip by ABC, which aired portions Friday on \"Good Morning America .\" Hershey's mixes two favorites in new candy bar It is a match made in candy heaven .>> Read more trending news The Hershey Company is debuting a new candy bar that combines the company's signature chocolate bar with Reese's Pieces, and has found the perfect couple to celebrate the union, WHTM reported. Hershey's invited Craig Hirschey and Jenny Ries for a photo shoot at the company's headquarters in Hershey, Pennsylvania, the television station reported. The couple got engaged this year and will be married in February. Undoubtedly, this couple has shared some kisses during their four-year courtship, and Hershey will document that love in its marketing campaign, WHTM reported. The new candy bar will hit stores in November. With deal on judges, Senate goes home for the elections Less than a week after ending a bruising partisan fight over the confirmation of Supreme Court nominee Brett Kavanaugh, the U.S. Senate joined the House in heading home for the November mid-term elections, as Democrats and Republicans agreed to allow approval of a package of GOP nominations, freeing those Senators who are up for re-election to return home to campaign. The House left town two weeks ago; both chambers will return for their next votes on November 13, a week after Election Day. Democrats cut the deal despite a lot of grumbling from their own side, as many more liberal activists wanted the Senate to stay in session, and have Democrats force votes and debates over any judicial nominee by President <mark>Trump</mark>. 15 judges were approved in the deal, which included three nominees to federal appeals courts, and a dozen federal district judges. While Democrats have forced Republicans to use extra debate time repeatedly on nominations, GOP leaders have been relentless in using time on the Senate floor for judicial picks by President <mark>Trump</mark> in 2017 and 2018, confirming 84 judges to all levels of the judiciary. And with the rules changes in the Senate--spearheaded by Democrats back in 2012--which eliminated the use of the 60 vote filibuster against judicial nominees, there isn't much Democrats can do to stop those <mark>Trump</mark> nominations, unless Republicans refuse to support the choices. \"<mark>Trump</mark> and McConnell are confirming conservative judges at a breakneck pace in what's sure to be <mark>Trump</mark>'s most enduring legacy,\" said <mark>Brian Fallon</mark>, who worked for Hillary Clinton and the Obama Justice Department, and has tried to spur Democrats to fight harder to block President <mark>Trump</mark>'s nominees. \"Senate Must Stop Rubberstamping of <mark>Trump</mark>'s Takeover of Federal Courts,\" boomed a press release by the Leadership Conference on Civil and Human Rights, as liberal groups denounced the deal. But without any votes from Republicans--Democrats are powerless to stop the GOP from confirming judges. Their best weapon is to simply win a majority in the Senate in the upcoming election. The Senate has confirmed President <mark>Trump</mark>'s judicial nominees at a historic pace--84 total, including Brett Kavanaugh and Neil Gorsuch to the Supreme Court, 29 circuit judges, and 53 district court judges .--Leader McConnell (@ senatemajldr) October 11, 2018 A number of other nominations by the President were also approved late Thursday, including a series of ambassadors. As GOP Senators crowed about their record number of judicial confirmations, they also took aim at Democrats on the way out of town. \"Senate Democrats must want to get out of Washington to campaign,\" said Sen. John Cornyn (R-TX). One note--while the House and Senate will not conduct any legislative business until after the elections, but Congress is not officially in \"recess'--so, President <mark>Trump</mark> will not be able to make any recess appointments. Driver ed teacher rear-ends car while drunk A Long Island driver education teacher rear-ended a car while drunk, then drove off, without his students, police said. Russell Cohen, 58, was instructing four students from Suffolk Auto Driving School Saturday when they began to suspect he was inebriated .>> Read more trending news Cohen was asked at 11 a.m. to stop at a McDonald's, where the students got out and called 911. Cohen then drove off and hit a car. The victim was treated for non-life-threatening injuries, police said. Cohen was arrested and charged with aggravated driving while intoxicated and endangering the welfare of a child. The Associated Press contributed to this report. Police release photo of suspected serial robber Owasso Deputy Chief of Police Jason Woodruff says the investigation of a robbery at a Check N Go last week led them to two other similar cases. The Check Into Cash in Broken Arrow was robbed October 1st. The Muskogee store was robbed in September. Police are asking anyone with information on any of the cases to come forward. Investigators from all three Green Country cities are now working together to identify the suspect. Police are hoping that someone will recognize him in the surveillance picture and call police. The suspect did have a gun and should be considered armed and dangerous. Anyone with any information is asked to contact the Owasso Police Department at 918-272-COPS. Callers can remain anonymous.", "articleID": "2018101307_00163290_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2018-10-13", "url": "http://www.surreycomet.co.uk/sport/national/16981050.gareth-southgate-four-man-defence-can-boost-england-in-attack/", "content": "Gareth Southgate 0 comments Gareth Southgate believes England's players are now established and equipped enough to use a four-man defence that can boost their attacking threat. After sealing World Cup qualification against Slovenia this time last year, the 48-year-old moved to a three-man defence that had its kinks but provided the platform for a summer to remember. Southgate ended a run of 16 matches using that defensive structure on Friday as England reverted to a four-man backline against the side that halted their progress at the semi-final stage in Russia, where Croatia's midfield ran amok as they came back to secure a 2-1 extra-time win. Thanks to everyone supporting us from afar. See you in Seville .?? #threelions pic.twitter.com/EOgBKHeDcO--England (@ England) October 12, 2018 But, just 93 days on, England managed to nullify that threat, with their re-shaped defence working well as the side began to threaten from open play in a Nations League encounter that should have been an away win rather than a 0-0 draw. \"In the last few matches, we have been pinned back in different ways,\" Southgate said after a match played behind closed doors. \"With three opponents pinning our five back--against Spain that was the two wingers and centre forward, against Switzerland that was the wing-backs--so we were then getting outnumbered without the ball .\" We'd also had some problems building up against the pressure, so tonight I was really pleased that we did both things very well. \"We were able to get more pressure higher up the pitch, we were able to get tighter to their midfielder. I thought our three midfield players did an excellent job .\" We used the ball well against a very good team, so very pleased with it. The players adapted quickly and well. \"The three at the back, the 3-5-2, allowed some players to bed into international football. People like (<mark>Harry</mark>) Maguire .\" Going into the World Cup, I felt we needed a little bit more protection for the defence and the opportunity to get two forwards in the game. \"Now, I think some of those players are a bit more established. They look very comfortable as a back four .\" So, I think that gives us good opportunities because some of the players that we've got coming through--we've got some very strong No. 8s and wingers coming through the system--so it's good that we have got the opportunity to play different systems. \"Jordan Henderson (left) and John Stones are suspended for the clash with Spain (Adam Davy/PA) Southgate now has to decide whether to stick or twist against a Spain side that mauled Croatia 6-0 after winning the Nations League opener 2-1 at Wembley last month. Luke Shaw, Jesse Lingard and Dele Alli all started that game but miss the Group A4 rematch through injury, while John Stones and Jordan Henderson are suspended in Seville after picking up bookings on Friday .\" Well, it doesn't make life any easier! \"Southgate said with a smile .\" But there's opportunities for other players. \"It's going to be a really good test for us in Seville. We'll have thousands of fans there, so we want to give another good performance .\" These players give absolutely everything. I could never, ever question their commitment or the intensity of their game. The youngest player in 63 years to make a competitive debut for @ England. Bravo, @ Sanchooo10?????? #NationsLeague pic.twitter.com/pnqR2RsgeB--UEFA Nations League (@ UEFAEURO) October 12, 2018 \"And, again, tonight a couple of players have emerged. I thought (debutant Jadon) Sancho had a really good impact when we eventually got the ball to him, so I think lots of encouraging things from the game .\" Southgate has some decisions to make, but there appears little doubt that captain <mark>Harry Kane</mark> will start again despite hitting the bar on a night that saw his scoreless run to a sixth match. \"I think he had the chance that he was just offside that he buried,\" the England manager added. \"<mark>Harry</mark> will get his goals. I've no (doubt).\" 0 comments", "articleID": "2018101309_00093768_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}, {"date": "2018-10-13", "url": "https://www.seattletimes.com/seattle-news/politics/i-1634-campaign-with-millions-from-soda-industry-aims-to-block-local-sweet-beverage-taxes/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all", "content": "The most lopsided campaign on Washington's November ballot is a microcosm of the battle the soda industry is waging across the country. Initiative 1634--taxation of food and beverages This initiative would prohibit new local taxes on food or beverages. It would not overturn Seattle's sugary-drink tax, but would block any rate increase. Supporters: Coca-Cola Company, PepsiCo, Keurig Dr Pepper, Red Bull North America Opponents: Foundation for Healthy Generations, the American Cancer Society, El Centro De La Raza Initiative 1634, backed to the tune of $13 million by a soda-pop industry that sees a threat to its profits in a growing wave of regulation, would ban local taxes on any food or beverage or ingredient intended for human consumption. The campaign echoes a similarly well-funded effort that took out a smaller statewide soda tax eight years ago. The I-1634 campaign is blanketing the airwaves with advertisements that raise the specter of looming local grocery taxes, while making little or no mention of the sweetened beverages produced by the companies funding the campaign. The public-health advocates opposing I-1634--on a shoestring budget--say the rhetoric about grocery taxes is an attempt to disguise the real purpose of the initiative and its funders. Seattle's sweetened-beverage tax, which raised $10.5 million in its first six months, is designed to discourage consumption and fund health and education programs. It has rankled Seattle retailers who say it is costing them business as consumers go outside the city limits to buy their beverages. Most Read Local Stories Federal jury awarded $5 million to man fired from Mercedes-Benz of Seattle after cancer surgery Tales from the road: How I survived decades of Skagit-to-Seattle commuting \"The Property': A family's getaway cabin defined its dreams, until a tragic Sunday morning VIEW Kim Schrier ad ties opponent to fugitive developer;\" sleazy garbage,' answers <mark>Dino Rossi</mark> campaign Truck driver arrested in crash at Tiger Mountain summit that killed 2 Unlimited Digital Access. $1 for 4 weeks. While I-1634 would not repeal the Seattle tax, which took effect Jan. 1, it would ensure that no other Washington cities can follow suit, and would stop any increases in Seattle beyond the current rate of 1.75 cents per ounce. When Seattle's sugary-drink tax is mentioned in I-1634 campaign ads, it's often abbreviated and paired with images that overstate the scope of the tax. In one spot, a mom in the grocery store looks at a container of milk while a narrator talks about Seattle's \"huge new beverage tax .\" In fact, milk-based beverages are explicitly exempted. Proponents originally sought a ballot title that included the word \"groceries,\" but a judge changed it to \"certain items intended for human consumption .\" The focus on local taxes, say opponents of I-1634, hews closely to a strategy employed by the tobacco and gun industries to limit the powers of local government, over which they have less political influence, to regulate them. \"This is an existential battle for the soda-pop industry,\" said state Sen. Reuven Carlyle, D-Seattle, who opposes the initiative. \"They know that they are now in the same light as tobacco, fossil fuels and other products that have negative externalities and affect public health .\" Earlier this year, lawmakers in Michigan and Arizona enacted bans on local food and beverage taxes. In California, where a handful of cities have enacted sweetened-beverage taxes, the soda industry threatened to bring a statewide initiative to the ballot that would have required a two-thirds majority to raise local taxes of any kind unless the Legislature put a moratorium on local food and beverage taxes, which it did. Oregon voters will decide in November on an initiative backed by a soda industry trade group and grocery chains with similar goals. The campaign backing I-1634 says it will close a \"loophole\" in Washington law that allows local jurisdictions to tax groceries--though not through sales taxes. Sales taxes on groceries were eliminated by a 1977 initiative, but local jurisdictions can still tax food items through other means. Seattle's sweetened-beverage tax, for instance, is structured as an excise tax on businesses distributing the drinks. The campaign's ads suggest that other Washington cities are considering sugary-drink taxes and that taxes on beef, dairy or other groceries could be next. There are few if any examples, however. \"We aren't aware of anybody else who has a tax that would be impacted by this initiative or who had been contemplating one,\" said Sheila Gall, general counsel of the Association of Washington Cities, which does not take a position on political campaigns. But the grocery industry is an easy target for new taxes, said Paul Kapioski, owner of the West Seattle Thriftway and chairman of the Washington Food Industry Association, which gave $20,000 to the I-1634 campaign, the only contributor besides the soda industry. Grocery taxes would exacerbate an already regressive tax code in Washington, hitting low-income people hardest, he said, and soda taxes could be just the beginning as policymakers try to change consumer behavior. \"It only takes one city or one group of people to say here's another area that we can target,\" he said. Kapioski argues that taxes like this, if they happen at all, should be implemented on a state level, both for efficiency in administering the tax collection and so that grocers in one jurisdiction don't lose business to competitors in nearby non-taxed jurisdictions. That's already happening with soda-pop sales for Seattle businesses, particularly those near the edge of the city. \"We've definitely seen a drop in sales in that category,\" said Kapioski, whose store is about a mile and a half from White Center, which has no tax. \"There is some crossover there where people will drive outside of the city limits and buy it substantially cheaper .\" If I-1634 passes, Seattle businesses would continue to have a price disadvantage compared to competitors in adjacent cities. That was news to some of the 1,300 people and businesses listed as endorsers on the yes campaign's website, including Aychu Aweke, at a 7-Eleven at the city limits in northeast Seattle. \"Across from [my] store, McDonald's, no tax. Taco Bell, no tax. Mine, soda tax. I have to increase my price and people don't come to my store,\" Aweke said. \"That hurts my business .\" Aweke said he thought I-1634 would repeal the Seattle tax. When told it wouldn't, he said, \"You called the wrong person .\" He wasn't clear on how his name had been added to the list of I-1634 endorsers--which includes small businesses and restaurants, farm groups and the Teamsters Union, which has many members in the soda industry--but other people on the list said representatives from their soda distributor asked them to sign-on, and that they knew the initiative would leave Seattle's tax in place. Henry Kim at Rotary Grocery in Pike Place Market said he didn't want to see other businesses hurt by the soda tax. \"No other victims for Washington state,\" he said. While some individual businesses report lost sales due to Seattle's tax, it's unclear yet whether the tax is discouraging sweetened beverage consumption or just shifting purchases to other cities. The soda companies funding the I-1634 campaign--The Coca-Cola Company, PepsiCo, Keurig Dr. Pepper and Red Bull North America--either did not respond to questions about how the Seattle tax has impacted overall Washington sales, or declined to comment. The companies have for years been concerned about taxes on their products or ingredients, calling that out among their \"risk factors\" in securities filings. Coca-Cola's latest annual report states, \"Obesity and other health-related concerns may reduce demand for some of our products .\" It goes on to note that taxes on sweetened beverages aiming \"to reduce consumption or to raise revenue...could adversely affect our profitability .\" Voters will have more than anecdotal data about the impact of Seattle's soda taxes before they vote Nov. 6. Researchers at the University of Washington and Public Health Seattle & King County are studying several impacts of Seattle's soda tax, including the extent to which the cost is passed on to consumers. Results on that question for the first half of the year are due Oct. 22, said Jesse Jones-Smith, a UW obesity epidemiologist, co-leader of the research team tasked by the city to evaluate the tax. Additional research will focus on whether the tax has changed attitudes about and reduced consumption of sugary beverages, whether small food stores in Seattle have lost sales and whether people change buying patterns at supermarkets based on the tax, Jones-Smith said. Their research will join a small but growing body of analyses that have followed a wave of new soda taxes around the country and abroad. These new taxes differ from state-level soda taxes that have been around for decades in that they are mostly imposed by cities and are explicitly designed to raise the price for consumers in order to reduce consumption. In one study, researchers found that sweetened-beverage sales had fallen 9.6 percent a year after Berkeley implemented the first large soda tax in the U.S.--1 cent per ounce--in November 2014. The study found overall beverage sales did not decrease, leading researchers to conclude that sweetened beverage taxes \"may be effective in shifting consumers to purchase healthier beverages without causing undue economic hardship and while raising revenue for social objectives .\" In Philadelphia, which began taxing sweetened beverages at a rate of 1.5 cents per ounce in 2017, residents reported lower consumption compared to nearby cities, according to phone surveys conducted for Drexel University researchers. \"Taxation is probably our most powerful policy lever that we could pull in terms of really trying to shift use patterns with these risky products,\" said Vic Coleman of the Washington Healthy Kids Coalition, which opposes I-1634. The opposition campaign has raised $7,650, mainly from the Foundation for Healthy Generations, a Seattle nonprofit, and the American Cancer Society. Coleman hopes people will weigh the potential public health benefits before voting to restrict cities' taxing authority. The link between sweetened beverages and obesity, diabetes and other major health concerns was only just coming into focus the last time a beverage tax came before Washington voters. In 2010, the Legislature passed a carbonated-beverage tax amounting to 2 cents per 12-ounce container--a fraction of the Seattle rate--part of a three-year package of temporary tax increases that were also levied on candy and bottled water to help fill a state budget deficit. That year, the soda industry poured a then-record $16 million into a successful initiative campaign to repeal the tax.", "articleID": "2018101314_00258290_W", "names": {"Dino Rossi": ["Q3707956", "Q5278544"]}}, {"date": "2018-10-14", "url": "http://www.ijpr.org/post/oscar-romero-pope-paul-vi-elevated-sainthood", "content": "<mark>Oscar Romero</mark>, Pope <mark>Paul</mark> VI Elevated To Sainthood By Camila Domonoske • 32 minutes ago Tweet Share Google + Email View Slideshow 1 of 3 A mass for a canonization ceremony of Pope <mark>Paul</mark> VI and the martyred Salvadoran Archbishop <mark>Oscar Romero</mark>, as well as five other people, was in St Peter's Square at the Vatican, on Sunday. Filippo Monteforte / AFP/Getty Images View Slideshow 2 of 3 Fireworks go off as Catholic faithful watch a televised screening of the ceremony of the canonization of martyred archbishop <mark>Oscar Romero</mark> at Gerardo Barrios Square in San Salvador on Sunday. Marvin Recinos / AFP/Getty Images View Slideshow 3 of 3 A man lights a candle in Ciudad Barrios, the hometown of blessed Monsignor <mark>Oscar Romero</mark>, some 165 kilometres from San Salvador, to mark his canonization Sunday. <mark>Oscar</mark> Rivera / AFP/Getty Images <mark>Oscar Romero</mark>, the murdered archbishop of San Salvador who spoke up for the poor and oppressed, and Pope <mark>Paul</mark> VI, the former pontiff who declared birth control \"intrinsically wrong,\" were declared saints on Sunday morning in a ceremony at St. Peter's Square in the Vatican. The ceremony featured seven new saints all told, including, as the Vatican put it, \"five other lesser-known blessed .\" <mark>Romero</mark>, who stood up to a violent regime, was killed by a right-wing death squad on a church altar in 1980. He was a strong influence on Pope Francis, who was born in Argentina, NPR's Sylvia Poggioli reports. \"<mark>Romero</mark>'s dedication to the poor and marginalized greatly influenced the first Latin American pope,\" Poggioli says. \"As soon as he became pope, Francis authorized <mark>Romero</mark>'s canonization--a rebuke to his predecessors, <mark>John Paul</mark> II and Benedict XVI, who believed <mark>Romero</mark> was too far to the left .\" In the ceremony at the Vatican on Sunday, Francis said, <mark>Romero</mark> \"left the security of the world, even his own safety, in order to give his life according to the gospel--close to the poor and to his people .\" During the ceremony, Francis wore \"the blood-stained rope belt that <mark>Romero</mark> wore when he was gunned down,\" The Associated Press reports. Thousands of Salvadoran pilgrims traveled to Rome to watch <mark>Romero</mark>'s canonization, the AP notes. Back in El Salvador, many more stayed up late in the night to watch live video of the canonization of the martyred archbishop. Photos show people weeping in the Gerardo Barrios square in San Salvador, and mothers holding sleepy, blanket-wrapped children in Romeros' hometown of Ciudad Barrios. <mark>Romero</mark>, whose supporters called him by the honorific Monseñor, was a hero to many, particular El Salvador's poor. But others--including some bishops within the church--accused him of being a communist subversive, driven by politics instead of faith. As NPR's Danny Hajek reports, crowds packed into the cathedral in San Salvador to hear his homilies, and across the country, even more people listened to live radio broadcasts. <mark>Romero</mark> called out bloodshed and defended human rights, becoming known as the \"voice for the voiceless .\" He also named the victims of both murders and disappearances, during a time of widespread silence and denial on the topic, making him a source of news as well as comfort and religious guidance. He exhorted members of El Salvador's military to disobey orders to kill civilians, well aware that he was risking his life by speaking up. Hajek reports: \"<mark>Romero</mark> was a champion of human rights at a time when El Salvador was on the brink of civil war. His tireless fight for civil rights ranks him among figures like Martin Luther King Jr....<mark>Romero</mark>'s voice echoed above the violence that engulfed his country .\" \"At a time of so much confusion and anguish,' <mark>Romero</mark> said in his homily on Feb. 10, 1980,' I want to be a messenger of hope. In the midst of tragedy and bloodshed, there is hope .'\" The next month, <mark>Romero</mark> was assassinated. Pope <mark>Paul</mark> VI, who was also elevated to sainthood on Sunday, oversaw the closing of the Church's pivotal Second Vatican Council, and issued the landmark encyclical that cemented the church's opposition to birth control. NPR's Tom Gjelten revisited that encyclical this summer, 50 years after it was released: \"On July 25, 1968, Pope <mark>Paul</mark> VI stunned Catholics around the world with his announcement of Humanae Vitae,\" Of Human Life, \"a document in which he forcefully reaffirmed the church's previously stated position on the use of artificial birth control, calling it\" intrinsically wrong. \"\"\"We are obliged once more to declare that [methods for] the direct interruption of the generative process,' the pope wrote,'...are to be absolutely excluded as lawful means of regulating the number of children .'\" Humane Vitae came as a surprise to many Vatican observers. Though an encyclical issued in 1930 already prohibited birth control, a papal commission had been assembled to revisit that ban, and a majority of the commission members suggested that it be dropped. \"The Vatican calls <mark>Paul</mark> VI the\" pope of modernity \"for his influence on changes in\" liturgy, seminary formation, theological study, and many other areas of ecclesiastical life. \"The five other saints canonized on Sunday were all born in Europe during the 18th or 19th century: <mark>Francesco Spinelli</mark>, born in Milan in 1853, founded a community of nuns. Vincenzo Roman, born near Naples in 1751, taught children and helped his community recover from an eruption of Mount Vesuvius. Maria Catherine Kasper, born in Germany in 1820, created an organization that served the poor. Nazaria Ignazia of Saint Teresa of Jesus, born in Spain in 1889, founded a missionary group in Bolivia that served women and the poor. Nuncio Sulprizio, born in Italy in 1817, died of bone tuberculosis at the age of 19 and was praised for his\" heroic virtues. \"All seven new saints,\" in different contexts, put today's word into practice in their lives, without lukewarmness, without calculation, with the passion to risk everything and to leave it all behind, \"the pope said, according to Vatican News. Copyright 2018 NPR. To see more, visit http: //www.npr.org/. Tweet Share Google + Email View the discussion thread.", "articleID": "2018101415_00122137_W", "names": {"Francesco Spinelli": ["Q18016120", "Q57491365"], "John Paul": ["Q1701359", "Q6252169"], "Oscar Romero": ["Q22667011", "Q47806597"]}}, {"date": "2018-10-15", "url": "http://www.northwichguardian.co.uk/news/national/16982730.government-seeks-advice-on-net-zero-emissions-target/", "content": "Scottish Labour set climate change target 0 comments Climate change experts have been asked to advise the Government on setting a target for achieving net zero greenhouse gas emissions from across the economy. The Committee on Climate Change will also advise on whether the UK needs to review its 2050 target of cutting emissions by at least 80% relative to 1990 levels, to meet international commitments set out in the Paris Agreement. Prime Minister Theresa May said: \"On the global stage, the UK is driving forward action on climate change through our work at the UN and with our Commonwealth partners .\" To ensure that we continue to lead from the front, we are asking the experts to advise on targets for net zero emissions. \"Are we on the #RoadtoZero road transport emissions? The 2050 target requires it. DfT's strategy wasn't out in time for our 2018 report--yesterday we wrote to @ transportgovuk & @ beisgovuk Lots to welcome (esp charging infra) but it won't meet cost effective path to the targets. https: //t.co/vK76ppbqcJ--Chris Stark (@ ChiefExecCCC) October 12, 2018 The request to the CCC comes after a major UN report said countries must take\" unprecedented \"action to slash carbon emissions to zero by 2050 and limit global warming to 1.5 C above pre-industrial levels. Limiting warming to 1.5 C is possible but will require fast and far-reaching changes to power generation, industry, transport, buildings and potential shifts in lifestyle such as eating less meat. It will also require action to take excess carbon emissions out of the atmosphere, the Intergovernmental Panel on Climate Change said. The letter to CCC chairman Lord Deben invites his committee to consider what emissions reductions would be needed to make an appropriate contribution to the Paris target of a\" well below 2C \"rise or the 1.5 C limit urged in the new report. Energy and clean growth minister Claire Perry said the CCC would give\" advice on a roadmap to a net zero economy, including how emissions might be reduced and the expected costs and benefits of doing so \". The move comes at the start of the Green GB Week initiative, and the Government claimed that jobs in green industries could reach two million by 2030, generating up to £ 170 billion in exports. Ministers will also set out proposals for new laws for\" smart energy \"appliances like washing machines and electric heating, with the ambition of making all new buildings smart by 2030. Environmental campaigners welcomed the Government's net-zero move, but called for a commitment to the 1.5 C goal. Gareth Redmond-King, head of climate at WWF said:\" Scientists from around the world said we had 12 years to tackle climate change. \"Governments can no longer shirk their responsibilities .\" It's time to act and, crucially, embrace the opportunities a green economy presents. \"Done right, this could be the biggest economic opportunity in history, driving innovation, job creation and better living standards .\" By limiting global temperature rise to 1.5 ° C, we could reduce air pollution and save the lives of 153M children, neighbours, and people around the world. What future will you choose? #ClimateChange?? https: //t.co/yA1FjnpK9u pic.twitter.com/wNpgRHj7Li--The ClimateCoalition (@ TheCCoalition) October 8, 2018 Ed Matthew from The Climate Coalition said: \"It is not just the target that matters, it's how fast we get there .\" The CCC must now ensure that this net-zero pathway is compliant with no more than 1.5 C of warming. \"Shadow business secretary Rebecca Long-Bailey said the announcement came as Government\" slashes support for small scale renewables, scales back support for electric vehicles \"and had been\" slammed \"by leading climate scientist <mark>James Hansen</mark> for its pursuit of fracking .\" This gaping contradiction is no accident--it is hypocrisy of the highest order, and an affront to those communities on which this government has forced the fracking industry, \"she said. Liberal Democrat environment spokesman Tim Farron claimed the Tories had\" lurched drastically away from supporting green technologies \". 0 comments", "articleID": "2018101501_00326107_W", "names": {"James Hansen": ["Q21556323", "Q58205689", "Q724095"]}}, {"date": "2018-10-15", "url": "http://www.thisislocallondon.co.uk/news/national/16983838.sturgeon-warns-mps-cobbled-together-brexit-deal-would-be-dereliction-of-duty/", "content": "Nicola Sturgeon 0 comments MPs who help <mark>Theresa May</mark> get a \"cobbled-together\" Brexit deal through Parliament would be guilty of a \"dereliction of duty\" , Nicola Sturgeon has warned. The Scottish First Minister used a speech in London on Monday to urge Westminster politicians to vote down any compromise deal the Prime Minister can strike with Brussels. She accused the UK Government of \"threatening us with fire, to make us choose the frying pan\" , and argued that any deal that is presented to the Commons was likely to be deliberately vague about the future relationship and damaging to the UK's interests. Ms Sturgeon told an audience at the Royal Society of Arts that voting down the Prime Minister's proposal would allow a deal keeping the UK in the customs union and single market--which the SNP wants--to be presented instead. Voting against \"a bad or blindfold Brexit\" was not a vote for no-deal, she argued, but \"the only chance the House of Commons will have to reset these negotiations and think again before it is too late\". She said: \"As the crucial vote looms closer, it is also time for individual members of the House of Commons to consider what compromises they see as justified--and which are not--if they are to serve their constituents, and the wider public interest .\" If they do that, I believe that a commonsense outcome could yet be found. \"Ms Sturgeon has said the SNP's strong preference is to remain in the EU (Jane Barlow/PA) She added:\" For MPs to support a bad or blindfold Brexit--a cobbled-together withdrawal agreement and a vague statement about our future relationship--would, in my view, be a dereliction of duty. \"In the June 2016 referendum, Scotland voted by 62% to 38% in favour of remaining in the EU. As part of her speech, the First Minister presented a new paper from the Scottish Government--Scotland's Place in Europe: Our Way Forward. It noted that the\" core \"of the proposal was the same as it set out in December 2016. Writing in her foreword to the paper, Ms Sturgeon said:\" The Scottish Government, in line with the overwhelming vote for Remain in Scotland, supports continued EU Membership. Remaining in the EU continues to be our strong preference. \"Nevertheless in December 2016 we set out a compromise plan to keep Scotland and the UK in the European Single Market and Customs Union to limit the damage of Brexit as much as possible .\" It is therefore simply incorrect for the Prime Minister to say that there is no alternative to Chequers. \"In fact, the UK Government's position is increasingly absurd--insisting on pursuing proposals they have been told will not work while rejecting a plan that will .\" She adds: \"With crucial decisions coming up over the next few weeks and months at EU level--and in the House of Commons, where the UK Government must seek the approval of the UK Parliament--it is vital to break the deadlock .\" For the Prime Minister and the UK Government it is time to face reality. For MPs at Westminster it is time to come together in a commonsense coalition to minimise the Brexit damage. \"A spokesman for the Department for Exiting the European Union (Dexeu) said:\" We will have an ambitious course outside of the EU that enhances our prosperity and security and that genuinely works for everyone across the UK. \"We have put forward a precise and credible plan for our future relationship with the EU and look forward to continuing to engage with the EU Commission on our proposals .\" 0 comments", "articleID": "2018101512_00316813_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2018-10-17", "url": "https://www.scout.com/Article/Torrey-Smith-Panthers-vs-Eagles-123447096/", "content": "Torrey Smith looking forward to playing against former team Slot to Scout.com Newsletter Players going up against their former teams can be a complicated affair. For some players, it's a welcome opportunity to see some old friends, reminisce about good memories, and try to beat them. But for others, it's a personal grudge match - An opportunity to stick it to an organization that let you go. Fortunately, Carolina Panthers wide receiver falls into the former category. Now in Carolina after a one-year stint with the Philadelphia Eagles, Smith is a welcome face in what is usually a hostile environment for opposing teams to play in - That'll happen when you're a member of the Eagles' first-ever Super Bowl-winning team. Torrey Smith \"\"said Smith of returning to Philadelphia in a report by Jelani Scott of the Panthers .\" I'm the only one who hasn't been able to see it yet. \"I can't wait to see the (Super Bowl LII Champions) banner, Although the Eagles opted during the offseason not to make Smith a part of their plans moving forward, trading him to the Panthers instead, Smith continues to speak highly of his former team. And, in return, Eagles head coach spoke highly of him. Doug Pederson\" \"said Pederson .\" I think that's the same thing he's doing in Carolina ....He's a great leader - A great man, first of all. Good person ....He is explosive and he can make plays on the ball and down the field. That's what helped us a year ago win a championship. \"I'm so grateful for what Torrey did and what he brought to this football team with his leadership ability, Although Smith had a quiet first month as a Panther, he is coming off of his best performance of the season against the Washington Redskins. While he didn't get the ball until the fourth quarter, Smith ended up catching all five of his targets for 43 yards and a touchdown, as well as a two-point conversion. Smith acting when called upon, in addition to his veteran leadership and the way he conducts himself, factors in to why quarterback referred to Smith as a\" pro \". <mark>Cam Newton</mark>\" \"said <mark>Newton</mark>.\" This is a production-based league, this is a production-based society. When those opportunities came to him, he made the most of them. And we wouldn't have expected anything else from him because of his whole approach. No one cares that he didn't get any passes thrown to him (until) the fourth quarter, Bring well-traveled in the course of his NFL career, Smith brings a wealth of perspective to the Panthers' Week Seven match: He's played in Philadelphia as a member of the Eagles, and as a member of the visiting team. He's very familiar with quarterback (Who Smith called a \"magician\" ), and how talented and well-coached the Eagles' defense is. Carson Wentz But being a pro entails not allowing sentimentality to get in the way of your job. And come kickoff on Sunday, Smith plans to be all business. \"We're going to have our hands full, and we got to go out there and execute and try to play mistake-free football .\" ", "articleID": "2018101803_00129835_W", "names": {"Cam Newton": ["Q5024850", "Q5024852", "Q591678"]}}, {"date": "2018-10-18", "url": "http://thechronicleherald.ca/more/custom-content/a-bright-way-to-increase-sales-251417/", "content": "A bright way to increase sales Sponsored content Published: 35 minutes ago Updated: 1 minutes ago All of the lighting was replaced in July at Hometown Furniture & Mattress in Dartmouth, and they have already seen incredible savings in their monthly power bills. - Contributed Energy-efficient lighting boosts sales at Dartmouth furniture store After recently upgrading to energy-efficient LED lighting in his Dartmouth store, <mark>Qing Chen</mark> was thrilled to see his power bill go down--and his sales figures go up. \"We had the lighting replaced in July, and then we had record-breaking months in August and September because of it,\" says <mark>Chen</mark>, the owner of Hometown Furniture & Mattress. \"The old lighting made the store feel dark and not inviting. Now our furniture looks much better, and our customers are enjoying their shopping experience .\" <mark>Chen</mark> had been paying steep energy bills just to keep the lights on in his 10,000-square-foot store, and the ancient lights were dim and dreary. It was his friend--a fellow small business owner--who suggested he reach out to Efficiency Nova Scotia and inquire about their Small Business Program. \"When I heard I could switch to energy-efficient LED lighting and Efficiency Nova Scotia would cover up to 60 per cent of the cost, I couldn't believe it,\" says <mark>Chen</mark>. His business saw a savings of more than 13,000 kWh, which equates to an estimated savings of just over $1,200 per year--cutting the power bill nearly in half. <mark>Chen</mark>'s employees love the new lighting, too, since it makes for a more comfortable environment and allows them to work more safely. \"They thought I'd spent a lot of money to make everything so nice and bright,\" says <mark>Chen</mark>. \"They were so surprised to hear the new lights were actually saving us money, because the store has never looked better .\" He's so happy with Efficiency Nova Scotia that he's talking them up whenever he meets another small business owner. \"I went to a convenience store the other day and the owner and I got to talking about power bills,\" says <mark>Chen</mark>. \"He was paying what I used to pay, and his store is maybe 1,000 square feet and mine is 10,000 square feet. I said,\" That's not right. You have to call Efficiency Nova Scotia! \"' <mark>Chen</mark> is preparing to open a second Hometown Furniture & Mattress in Bayer's Lake, and he's already contacted Efficiency Nova Scotia to help with upgrades there, too. While he'll enjoy the savings on his energy bill, he says the most important reason for the upgrade is to make his store the best it can possibly be .\" It's so important for a store to have the right atmosphere, \"says <mark>Chen</mark>.\" You need to create a bright, welcoming environment so your customers want to browse and stay a while. \"More custom-content stories", "articleID": "2018101819_00233314_W", "names": {"Qing Chen": ["Q57754358", "Q59452713", "Q59597636"]}}]