[{"date": "2018-10-19", "url": "https://www.irishexaminer.com/breakingnews/sport/killyclogher-captain-emmet-mcfadden-theres-no-man-bigger-than-the-team-here-876741.html", "content": "Killyclogher captain Emmet McFadden: \"There's no man bigger than the team here' Friday, October 19, 2018 - 04:40 AM By Francis Mooney Killyclogher captain Emmet McFadden wears the number 15 on his back, but you won't see him taking on defenders and knocking over scores in Sunday's Tyrone SFC final against Coalisland. The Killyclogher team celebrate with the cup after the Tyrone County Senior Club Football Championship Final in 2016 McFadden is the embodiment of the modern game, a player with the footballing brain to master the sweeper brief and keep things tight and organised at the back. The 28-year-old has perfected the role through several seasons of sacrificing his own game and working for the greater good of the team. But he's hoping he will get to savour his moment of individual glory by climbing the steps of the Healy Park stand to take delivery of the O’Neill Cup this weekend. READ MORE: Condensed calendar fails to free up club championships\" My role is not as a scorer, \"he said .\" Of course you get forward an odd time, but trying to keep the scores to a minimum for the other team is my job. I'll just take it for the team. \"Both finalists have come through tight games on their way to this weekend's title decider, with Killyclogher dragging themselves back from the brink to deny Ardboe and win their semi-final in extra-time. We showed a lot of character in the last few minutes of that game. We knew we were never beaten until the final whistle. We were creating a few chances but the ball wasn't really sticking at times when we were going through. There were a few mistakes, but we always knew we were going to get the chance, and thank God we took it. Three points down in stoppage time with ace finisher <mark>Mark Bradley</mark> off the pitch, they had to look elsewhere for scores, and Conall McCann who rescued them with a dramatic goal .\" There's no man bigger than the team here. <mark>Mark</mark> has carried us with his talent, and it's great to have him but every player makes his own contribution. We have all dug in and got over the line. \"KEYWORDS", "articleID": "2018101903_00245139_W", "names": {"Mark Bradley": ["Q25190093", "Q3849450", "Q55111709", "Q56549811", "Q6766814", "Q6766815", "Q6766817"]}}, {"date": "2018-10-19", "url": "http://feeds.cbsnews.com/~r/CBSNewsNational/~3/R8sbbOXVCsE/", "content": "Kierra Coles CBS Chicago Share Tweet Reddit Flipboard Email Police suspect foul play in the disappearance of Kierra Coles, a 26-year-old pregnant postal worker who went missing about two weeks ago. Coles, 26, was last seen on Oct. 2 in the Chatham neighborhood, CBS Chicago reports. She is three months pregnant with her first child. \"Based on the length of time of Kierra Coles' disappearance and the fact that she has fallen off the grid, police suspect possible foul play,\" the Chicago Police Department told The Associated Press. \"We continue to get leads and are following up diligently on those leads .\" Surveillance video from the South Side neighborhood shows Coles walking past her car in her U.S. Postal Service uniform, even though she had called in sick that day, WLS TV reports. Coles' mother, <mark>Karen Phillips</mark>, called police to report her missing two days later. She said she became concerned that her daughter hadn't called her and that her calls to her daughter's number went straight to voicemail. Police went to Coles' home to conduct a well-being check and didn't find her, but saw that her car was parked out front. \"She wouldn't go this long without talking to me,\" <mark>Phillips</mark> told WLS TV. She said when the two did talk on Oct. 2, her daughter told her how happy and emotional she was to hear her baby's heart beating. \"We talk every day. She wouldn't have me worrying like this .\" The U.S. Postal Service has offered a $25,000 reward for information on Coles' whereabouts and is assisting in the investigation into her disappearance. © 2018 CBS Interactive Inc.. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. Share Tweet Reddit Flipboard Email", "articleID": "2018101918_00084324_W", "names": {"Karen Phillips": ["Q27043974", "Q3812973"]}}, {"date": "2018-10-20", "url": "http://www.sailingscuttlebutt.com/2018/10/20/grand-harbour-releases-rolex-middle-sea-race/", "content": "News Grand Harbour releases Rolex Middle Sea Race Published on October 20th, 2018 Valletta, Malta (October 20, 2018)--The 50th anniversary Rolex Middle Sea Race is underway as a record fleet of 130 yachts waved its way by large crowds filling the bastions of Valletta and the Three Cities, and other vantage points. Grand Harbour is a magnificent location in its own right. Each year, the lily is gilded by an intrepid fleet of Corinthian and professional sailors, adventurers and voyagers, all determined to take on the challenge presented by this classic 606nm offshore race. By 17:00 CEST, the majority of the fleet was hard on the wind heading for Capo Passero on the southern tip of Sicily. The heavier displacement boats are enjoying the upwind conditions. Strategic decisions are beginning to play out, with most staying north of the rhumb line. Approaching the land, the breeze looks to be shifting and fading. Staying in the best pressure to round the cape will be the common goal. <mark>George David</mark>'s Maxi American Rambler 88 is leading the charge in the monohull fleet, with their closest rivals on the water two miles behind: Dieter Schön German Maxi72 Momo, and the 115ft Baltic Nikata. In the Multihull fleet, Giovanni Soldini's Maserati and the Ned Collier Wakefield skippered PowerPlay were in close combat just off the coast of Sicily, locked in a duel, having blasted close to 70 miles upwind in just four hours. Just before going to press, Maserati reported suffering damage to the starboard rudder. She continues to race and the extent of the problem is being examined. The start line between the Saluting Battery on the Valletta side and Fort St. Angelo, on Birgu, is an intimidating setting. Atmosphere and tension within the crews is heightened by the crash of cannon fire for each of the seven starts. A 15 knot north-easterly developed a building sea-state outside the breakwater, but importantly meant each start was able to get away in breeze. First away was the four boat Multihull class. Two pairs of contrasting boats making up this compact, but nevertheless impressive-looking division. PowerPlay got the better of Maserati in the battle of the MOD70 racing trimarans, while Allegra was quicker off the mark than R-Six. Tacking a multihull is tricky at the best of times, within the gusty confines of the starting arena it becomes an art-form. PowerPlay's on-the-money start allowed her to choose her lanes and she led the class out of the harbour. For the considerably more numerous monohull contingent, the starts come in size order with the smallest and slowest going first. Class Six was marked by a number of double-handed crews, including the Austrian entry 2Hard, British yacht Jangada and the 2017 Overall Winner, Bogatyr. Having won the race fully-crewed last year, the owner, Igor Rytov, has chosen to take on the course short-handed. Few would bet against him pulling off another remarkable achievement given his early commitment. The Russian's competitive edge got the better of him at the start, with Bogatyr over the line early requiring a frustrating turnabout to restart. Rytov, though, then lit the afterburners and by the turning mark off Dragonara was back amongst his classmates. Seawolf looked to have the best start, but by the harbour entrance Timofey Zhbankov's Rossko was out in front. The last start was reserved for most powerful yachts in the fleet. The eight-boat class was one of contrasts. The mammoth 115-foot Nikata, the largest yacht ever to start the Rolex Middle Sea Race, towering over the likes of the 60-footers Wild Joe and Oz, at almost half the length. Rambler 88, the three-time Line Honours winner, with her all-star crew led by owner <mark>George David</mark>, with Brad Butterworth and Silvio Arrivabene providing tactical advice and navigational input, was handed a lesson off the line by the Maxi 72 Momo. Just past the harbour entrance turning mark, normal order resumed with Rambler broadening her sailing angle and using her performance-enhancing assets to rapidly reel in and overtake the German pretenders. The starts sandwiched between these two were just as dramatic, just as exciting. The breath-taking amphitheatre offered by Grand Harbour provides a start environment the equal of any other 600nm offshore classic. Sir Robin Knox-Johnston, one of the race's guests of honour, may have seen it all over the years, but even he was enthralled, admiring the scene from the Saluting Battery: \"It's a truly impressive spectacle; what a place to start a race .\" Ahead of race start, crews made their last-minute preparations. Loading provisions, checking personal kit, saying their goodbyes to loved ones. The anticipation for the adventure ahead was tangible. Italian sailor, Andrea Iacopini, racing aboard Amapoula, is taking part for the fourth time. Uncertain of the weather, he was clear in his appreciation of the course: \"It's the most incredible race I've done. Volcanoes, islands, currents, tides, wonderful colours. It is definitely the most beautiful race in the world .\" Even professional crew, like Laurent Pages sailing on Eric de Turckheim's Teasing Machine in his third Rolex Middle Sea Race, are able to look beyond the immediate tactical battles to appreciate the race environment: \"The attraction of this race is a combination of things: technically it's very intense, from the start in Grand Harbour to the strength of the fleet, which always makes it a real challenge. And, the course that goes around Sicily, so Etna, Messina Strait, Stromboli and all the other spots is simply quite amazing. Nicolas Ibanez Scott, owner of Chilean yacht Anita, took part for the first-time last year. Back again for another go despite the beating given by the weather conditions in 2017, Ibanez was looking forward to the race ahead:\" Last year it was rough, it was tough, the weather was hard. We are enthused to be going again. There are great teams out there and we hope to enjoy a fine race, with better winds. In terms of strategy, we have a much clearer view of what we should do and should try to avoid. We feel better prepared, but that doesn't mean it will be any easier. It's fascinating and a privilege to be a part of this great race. \"Royal Malta Yacht Club Principal Race Officer, Peter Dimech, was delighted to have got the full fleet away on time and without issue:\" It went like clockwork with all starts on time. Although the fleet had at least one tack in harbour, it all went smoothly and they cleared the harbour without any incident. \"CLASS ANALYSIS AT 17:00 CEST: IRC Two: the Andrea Calabria skippered Swiss Swan 82, 2nd Chance, is revelling in the upwind conditions, Vadim Yakimenko's TP52 Freccia Rossa is going well after a cracking start, as is Eric de Turckheim's French NM54 Teasing Machine, and Vincenzo Addessi's Italian Mylius 60, Fra Diavolo. IRC Three: Dominique Tian's French Ker 46, Tonnerre de Glen, leads on the water by two miles from Vittorio Biscarini's Ars Una. Ramon Sant Hill & Jonas Diamantino's Maltese Farr 45, Comanche Raider III, has made an impressive start and is in the mix with the leaders. IRC Four: Swan 651 Lunz Am Meer, skippered by Riccardo Genghini, has been in her element upwind. Philippe Franz's NM43 Albator is holding on to their bigger rival, just ahead of Frank Werst's Swan 53 Silveren Swaen. The Podesta family racing the Maltese First 45, Elusive 2, is among the front-runners, and holding off their local rivals, Josef Schultheis & Timmy Camilleri on the Xp-44, XP-ACT. IRC Five: Jonathan Gambin's Maltese Dufour 44, Ton Ton Maltacharters, leads on the water from two well-sailed French teams: Géry Trentesaux's JPK 11.80 Courrier Recommandé and Yves Grosjean's J/133 Jivaro. IRC Six: Rossko, skippered by Timofey Zhbankov, holds lead from a trio of boats just a mile astern: Gerard Ludovic's Solenn, Igor Rytov's Bogatyr, and Piercarlo Antonelli's Bora Fast. Event Details--Entry List--Tracker--Facebook 606 nautical mile course Source: Royal Malta Yacht Club Tags: Rolex Middle Sea Race Related Posts Blown away by the Rolex treatment → Record fleet for Rolex Middle Sea Race → Fifty Years of Middle Sea Race → Middle Sea Race Celebrates Milestone →", "articleID": "2018102116_00114960_W", "names": {"George David": ["Q5535947", "Q5538395"]}}, {"date": "2018-10-21", "url": "http://www.harpersbazaar.com/celebrity/latest/a24021080/pippa-middleton-new-baby-boy-photos-kate-middleton-sister/", "content": "Oct 21, 2018 Getty Images HGL Following the exciting reports that Pippa Middleton gave birth to a baby boy, Kate's sister has been seen out and about with a pram for the first time. Related Story See Pippa Middleton's Perfect Wimbledon Style Advertisement - Continue Reading Below Per the Daily Mail's royal correspondent, Rebecca English, Pippa allegedly gave birth to a baby boy at approximately 1:58 p.m. London time, on October 15, 2018. While a name is yet to be announced, it was revealed that the baby boy weighed in at 8 pounds and 9 ounces. And now, the is reporting that Pippa and her husband, <mark>James Matthews</mark>, have stepped out for the first time with their newborn baby. Sharing a series of photos of Pippa walking the couple's dog, while <mark>Matthews</mark> pushed their baby in a pram, the reports that Kate's sister was wearing a Kate Spade dress for the outing. Head over to the Daily Mail to see the photos of Pippa now. Daily Mail Daily Mail As for the Kate Spade wild roses, ruffle wrap dress that Pippa donned for the occasion, it's still available to shop: wild roses ruffled wrap dress KATE SPADE NEW YORK nordstrom.com $398.00 Earlier this month, Pippa attended Princess Eugenie's wedding while 9 months pregnant. Arriving with her husband, Pippa wore a dark green, long-sleeved dress, with mock-turtleneck detail, which she paired with a green fascinator with bow on it. Getty Images Max Mumby/Indigo Throughout her pregnancy, Pippa has written a column for magazine, in which she's discusses the different forms of exercise she's been partaking in during each trimester. In her most recent column, Pippa describes how \"movement is certainly getting more awkward\" as her pregnancy progresses (via). Waitrose Weekend People Advertisement - Continue Reading Below", "articleID": "2018102117_00108215_W", "names": {"James Matthews": ["Q16215416", "Q29643199", "Q30512782", "Q5979722"]}}, {"date": "2018-10-24", "url": "http://bridgemi.com/detroit-journalism-cooperative/detroit-studying-whether-shut-water-underpopulated-neighborhoods", "content": "DETROIT ‒ Detroit officials are studying whether it makes sense to shut water service and relocate residents in parts of this sprawling and often vacant city, a top city official told Bridge Magazine. Seven years after a disastrous series of public meetings about then-Mayor Dave Bing's plan to downsize Detroit, city officials are amid a $57 million, five-year analysis of the water and sewer system. The study is intended to help prioritize repairs, but water officials acknowledge the findings may help determine whether the city should offer to pay to move residents out of abandoned neighborhoods and shut water lines. \"Areas that are so sparsely populated, perhaps the neighborhood should be shut down and just move people out? We think so .\" ‒ <mark>Gary Brown</mark>, director of the Detroit Water and Sewerage Department. \"Areas that are so sparsely populated, perhaps the neighborhood should be shut down and just move people out? We think so,\" <mark>Gary Brown</mark>, director of the Detroit Water and Sewerage Department, told Bridge. <mark>Brown</mark> said the study is being conducted in conjunction with several city departments, including the office of Mayor Mike Duggan, planning officials and roads. <mark>Brown</mark> stressed that any proposal about enticing residents to relocate would be at least three to five years away. Related: In Detroit, surviving without running water has become a way of life \"I'm interested. The mayor is interested: Whether it's more advantageous to offer people a (city-owned) Land Bank home that has five times the value elsewhere...When you get into some of these neighborhoods with only a few houses, you'd get a better return on your investment to just move three people and shut down the infrastructure .\" Alexis Wiley, Duggan's chief of staff, issued a statement Tuesday distancing Duggan from <mark>Brown</mark>'s remarks, telling Bridge \"the mayor completely disagrees with this idea .\" \"The mayor's consistent approach has been to provide city services equally to all neighborhoods, regardless of population density,\" Wiley said. \"We've lit every neighborhood to the same national standard. We pick up trash, maintain parks, cut vacant lots and remove dead trees to the same standard in every neighborhood and we sweep every mile of residential streets just the same. That will continue .\" Whatever the case, the study and discussion come as Detroit continues to confront decades of neglect necessitating millions or perhaps billions of dollars in infrastructure repairs--and amid heightened sensitivities about whether all neighborhoods are benefiting from new investment in the city. Detroit officials have floated various forms of downsizing for years, as the population fell from nearly 2 million in the 1950s to 670,000 today and services have become harder to deliver in the 139-square-mile city. \"It's not for <mark>Gary Brown</mark> to decide where people live. Water is a service vital to people's health. It's not to be used as a political tool to re-engineer the city .\" ‒ Russ Bellant, Detroit neighborhood activist But shrinking services for entire neighborhoods, especially to residents who have remained in the city while neighbors fled, has been political kryptonite. Told of <mark>Brown</mark>'s comments by Bridge, East Side housing leader <mark>Linda Smith</mark>'s reaction was succinct. \"Aw, hell to the no,\" said <mark>Brown</mark>, executive director of U-SNAP-BAC, a nonprofit that develops affordable housing. Old system, rising costs Detroit's issues with abandonment are legendary. A city geographically large enough to fit San Francisco, Manhattan and Boston and still have leftover land, Detroit has more than 2.5 million fewer residents than those cities. All told, Detroit has about 24 square-miles of vacant land, including 72,000 publicly owned empty parcels, according to a report last year by Detroit Future City, a nonprofit planning group. More than 20 square miles of Detroit are considered abandoned. Here's a look at vacancy and abandonment in the city. (Photo courtesy of Data Driven Detroit) Over the years, there's been debate about whether it makes sense for the city to provide services to them all. As part of its municipal bankruptcy, Detroit agreed in 2015 to lease its water system--which serves 4 million residents in southeast Michigan--to a new suburban group, the Great Lakes Water Authority. In exchange, Detroit gets $50 million per year for 40 years, about $500 million of which will pay for upgrades and line replacements in the next five years for an old, neglected system. That's enough to replace about 2 percent of the system per year. The money comes as Detroit faces a reckoning: Water usage is dropping, down 27 percent since 2008 because of conservation efforts and efficiencies in home plumbing, but the system faces more needs than ever. Much of 2,700-mile network of water pipes was built before World War II, and the average line is 95 years-old. Many pipes from the late 1800s remain, and the city has only replaced 15 percent of the system in a century. The sewer system also is showing its age, averaging 200 sinkholes and cave-ins per year in the past five years, city records show. \"This was a beautifully designed system for 100 years ago,\" said <mark>Brown</mark>, the water chief. \"But we haven't done much maintenance for two decades. We were trying to stay out of bankruptcy,\" said <mark>Brown</mark>, who discussed the city's infrastructure needs and his ideas about shutting lines during three interviews with Bridge in the past two weeks. BRIDGE INFRASTRUCTURE COVERAGE: A s cities rush to sell off utilities, Wyandotte boasts 3 city-run systems Michigan's infrastructure is in shambles. Answers aren't easy Michigan needs $4B more per year for infrastructure, but how to pay for it? Michigan's 2018 infrastructure report card: D + Lansing dozes as infrastructure crumbles In recent years, Detroit has pursued several controversial plans to increase water and sewer revenues. It has disconnected water at 112,000 homes since 2014 to increase collections, and raised sewage fees for drainage, prompting an outcry from pastors and lawsuits. The water department's 2015 master plan discusses closing or modifying some water filtration plants, which could need $1 billion in upgrades by 2035. Shutting service in select areas may make that easier, <mark>Brown</mark> said. The city could perhaps redevelop fallow land into industrial parks to create jobs, he said. \"There are pieces of a large system that can be taken out without impacting the system as a whole,\" <mark>Brown</mark> said. The city is amid a $57 million, five-year study with national engineering firm AECOM to develop metrics on which service lines in Detroit should be replaced first. The study weighs several factors, including age and health of the lines, but also the likelihood of neighborhood comebacks. Perhaps unsurprisingly, two of the city's hottest areas--downtown and Midtown--are deemed higher priorities for line replacement. \"We need the data to make these kinds of decisions, but this has been talked about lots of times,\" said <mark>Brown</mark>, who served on the City Council before taking over the water department. \"It's politically difficult to pick winners and losers, which neighborhoods are viable and which should go back to God .\" \"But this is the fact: This is a city built for 2 million people and now we have 650,000,\" <mark>Brown</mark> said. He noted the city is already pursuing a similar model in Southwest Detroit, where as many as 350 families are being offered publicly owned homes if they leave the area near the planned Gordie Howe International Bridge to Windsor. <mark>Brown</mark> said the city can look to one of the water department's municipal customers, Highland Park, as a cautionary tale of how abandonment can wreck infrastructure. The city within Detroit, whose population plummeted to 10,000 from 53,000 in the 1930s, is so empty Highland Park has to send vacuum trucks to move human waste through its pipes. Gravity is supposed to propel sewage from pipes to treatment plants, but there are too few people flushing toilets to move the waste along in Highland Park, <mark>Brown</mark> said. A non-starter for many Any talk of relocations or downsizing in Detroit--especially amid a flurry of public investment in downtown and Midtown--is bound to be controversial. Told of the water study by Bridge on Tuesday, one neighborhood activist sighed and said, \"Jesus .\" \"It's appalling,\" said the activist, Russ Bellant, president of the HelCo Block Club on the city's northeast side, a retired Water Department plant operator and city council candidate last year. \"It's not for <mark>Gary Brown</mark> to decide where people live. Water is a service vital to people's health. It's not to be used as a political tool to re-engineer the city .\" Bellant was among those who attended meetings in 2011 about the so-called Detroit Works plan to re-engineer and shrink the city. The idea by former mayor Bing was devised as Detroit slipped toward bankruptcy to streamline services and perhaps relocate residents. The plan never recovered from poorly organized initial meetings that got off to a rough start when Bing likened some neighborhoods to a \"hell hole .\" Talk of moving Detroiters still strikes raw nerves for many in this predominantly black city, including residents old enough to recall city relocation efforts in the past targeting minority residents, most notably \"urban renewal\" drives in the early 1960s that demolished the Black Bottom neighborhood for freeways. Other controversial efforts included using eminent domain to clear the Poletown neighborhood in the 1980s for a General Motors Plant and the city's clearing of land in the Rivertown neighborhood in the 1990s for casinos that eventually located elsewhere. Most of Detroit's 2,700-mile network of water pipes was built before World War II and maintenance was delayed for years as the city slunk toward bankruptcy. (Bridge photo by Anthony Lanzilote) Under Duggan, city planners have adopted many of the concepts from Bing's failed plan, including using empty land as an asset to develop green spaces, farms or green belts. Duggan, though, has been careful to say his goal is to expand the city's population and has never characterized planning efforts as downsizing. \"One of the challenges in the city is even highly vacant places aren't totally vacant,\" said Tom Goddeeris, deputy director of Detroit Future City, a planning group that has been involved in discussions about reimagining Detroit. \"There aren't a lot of places where there is just one house. It's three or four house here and three or four there .\" Overall, 6 percent of Detroit is considered \"low density\" ; that is, areas that are home to five or fewer people per acre, according to a Detroit Future City report. That's comparable to poor cities nationwide, but what makes Detroit unique is the lack of high-density neighborhoods to offset the vacant ones. Goddeeris noted that the response to the city's offer to relocate residents near the planned Gordie Howe International Bridge--in one of the most industrial, polluted corners of Michigan--could be instructive. So far, only a small fraction of 350 offered city-owned homes have wanted to leave. \"Even if there are compelling reasons to move and there are fairly reasonable options,\" Goddeeris said, \"people still aren't interested .\" Wiley, the mayor's chief of staff, stressed the goal of that program was not to downsize but to help residents of the neighborhood near the planned bridge \"relocate to another neighborhood in the city of Detroit .\" Related: In Detroit, surviving without running water has become a way of life Next article Read 3 comments Twitter Facebook Google + Mail", "articleID": "2018102422_00052187_W", "names": {"Gary Brown": ["Q13468194", "Q42322389", "Q5524765", "Q5524766", "Q5524767", "Q5524768", "Q5524769", "Q5524770", "Q5524771"], "Linda Smith": ["Q16885749", "Q3241375", "Q435239", "Q57744472"]}}, {"date": "2018-10-27", "url": "http://www.thenorthernecho.co.uk/news/national/17085646.casey-kidding-himself-over-election-votes-says-traveller/", "content": "<mark>Peter Casey</mark> 0 comments A Traveller woman has said that <mark>Peter Casey</mark> is \"kidding himself\" after he rejected claims his support was bolstered by populist views. Mr <mark>Casey</mark>, who was projected to come runner-up in the Irish presidential race after Michael D Higgins, claimed on Saturday morning that people voted for him because he spoke for \"middle Ireland\" who were working and \"paying the bills\". Mr <mark>Casey</mark> previously made comments that Travellers should not be recognised as an ethnic minority, because they are \"basically people camping in someone else's land\" , and the group are \"not paying their fair share of taxes in society\". He had come under increased scrutiny in presidential debates and had some of his comments labelled \"populist\" and \"racist\" by other candidates. He was also compared to former Ukip leader Nigel Farage. Kathleen Lawrence, who works at Traveller outreach programme Pavee Point, said that Mr <mark>Casey</mark> had used an already disenfranchised community to bolster his lead in the polls. \"The fact that he garnered 20% of votes is disappointing but it's not surprising given his comments,\" she said. \"I think now we need to look at the fact that 20% bought into his message .\" I think we need to target those people to help them and change the way politics is being done. \"People are drained, working full time and barely scraping by and that's awful, but the fact <mark>Peter Casey</mark> used an ethnic minority to make up the blame, that is disturbing .\" I think what needs to happen is we need to tap into why people voted for him, we can't let this pass by. \"We need to put protocols in place that would prevent people like <mark>Peter Casey</mark> and any other potential candidate at all levels, we need anti-racism protocols in place that they have to sign up to, to make sure that they don't use minorities to further their own political agenda .\" Ms Lawrence said the feeling in her family was one of fear after Mr <mark>Casey</mark> said he had received thousands of letters of support after making his views on Travellers known. \"I can't speak for all Travellers, but amongst my own family there was a lot of fear around what would happen if he got in,\" she said. \"We're already marginalised, we're already facing extreme discrimination and extensive cuts, people were feeling like,\" Well, what more can we handle?' \"I don't know what he stood for, all we know is he spoke about Travellers and people on welfare for the last three weeks .\" A good portion of his votes came from his Traveller comments. \"I know he's trying to convince people that isn't the case, but he's really trying to kid himself .\" The reason he continued in the race was because he received emails of support after the comments, he said that himself. \"On Saturday, Archbishop of Cashel and Emly Kieran O’Reilly expressed concern over hurt caused by the public discussion during the election campaign .\" In recent weeks I was alarmed by some of the inflammatory language used during the public discourse which formed part of this election campaign, \"he said .\" Feedback that I have received from members of the Travelling community, and from those dependent on financial assistance from the state in order to survive, has confirmed my concerns. \"Ill-informed and inflammatory language has caused real hurt, humiliation and heartache. This offensive commentary was particularly virulent on social media. It has been particularly damaging to the Traveller community which has been endeavouring to grow and preserve its ethnic identity as part of our society .\" He asked that those who engage in projects around Traveller health and well-being redouble their efforts. 0 comments", "articleID": "2018102717_00249692_W", "names": {"Peter Casey": ["Q15040081", "Q16188918", "Q41787474"]}}, {"date": "2018-10-27", "url": "http://www.gamereactor.eu/news/703643/The", "content": "Not long ago, we reported that new information on Medievil Remastered was set to be revealed soon. In line with this, Jay Gunn, also called <mark>Jason Wilson</mark>, is not only the co-creator of the MediEvil series, but he also voiced Sir Daniel, the main character of these adventures. Recently, <mark>Wilson</mark> who is a comic book author these days posted tweet a strange photo with him reading with a bucket on his head accompanied by this sentence: \"The things that I do to prepare for some jobs .\" The reference is actually very subtle because it refers to an interview given in October 2006 at The Dan-Fanclub in which he said: \"I wrote a script for what Dan [Sir Daniel] actually says and then just read the lines through gritted teeth with a bucket over my head!\" We can, therefore, assume that <mark>Jason Wilson</mark> will return to re-record the lines for the remaster? Comments This is an ad:", "articleID": "2018102720_00078791_W", "names": {"Jason Wilson": ["Q16225684", "Q26611719", "Q39074930", "Q6163780", "Q6163781", "Q6163783"]}}, {"date": "2018-10-28", "url": "https://www.theage.com.au/sport/cricket/peter-handscomb-talks-up-harris-test-claims-20181028-p50cgw.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "Peter Handscomb talks up <mark>Harris</mark>' Test claims Peter Handscomb talks up <mark>Harris</mark>' Test claims Peter Handscomb talks up <mark>Harris</mark>' Test claims By <mark>Roger Vaughan</mark> Larger text sizeVery large text size Victorian captain Peter Handscomb would have had <mark>Marcus Harris</mark> in the Test batting debate well before the opener's career-best innings. <mark>Harris</mark> was man of the match for his unbeaten 250 as Victoria thrashed NSW by an innings and 107 runs in their Sheffield Shield match at the MCG. Test consideration? <mark>Marcus Harris</mark>. AAP Credit: Injured tailenders <mark>Trent Copeland</mark> and <mark>Mickey Edwards</mark> defied Victoria for an extra half an hour on Saturday, taking the game into day four. But paceman Scott Boland bowled <mark>Edwards</mark> in the second over on Sunday morning to dismiss NSW for 179 and seal Victoria's second innings win in as many Shield Games. Victoria are on a roll, having also won the one-day title, and now <mark>Harris</mark> has entered the Test batting debate with his first double ton at any level. Advertisement <mark>Harris</mark> has impressed Handscomb since coming to Victoria from WA two years ago. \"He's really put his hand up, but he's been doing a good job for us since he came here,\" Handscomb said. \"It's a shame that it's taken this long for his name to come up .\" I think he was a chance earlier, for sure. \"NSW captain Peter Nevill also praised <mark>Harris</mark>' innings, but noted the game might have turned out much differently had they not dropped a chance from the opener when he was yet to score. <mark>Harris</mark>, 26, left WA with a stinging critique from then-WA coach Justin Langer, now in charge of the national team, who called him mediocre with flashes of brilliance. But <mark>Harris</mark> has scored 1790 Shield runs since the move, the most in that time. He has eight Shield tons, including two last season, and in 65 first class matches <mark>Harris</mark> has scored 3928 runs at an average of 35.38. Handscomb, another potential Test candidate, was left kicking himself when he did a lot of hard work to reach 48, only for a poor shot to end his innings .\" I'm trying not to focus on the one ball I stuffed up and focus more on the 79 that I played really well, \"he said .\" I felt good out there...unfortunately I made one mistake and that's the batter's game. \"But I'm not that worried, I'm not that frustrated and I'm just very happy with how my game's going, but more importantly how the team is going .\" Boland also starred for Victoria in the second innings with 6-49. Handscomb and rival captain Nevill praised the new-look MCG wicket. It is the first Shield or Test result at the MCG since NSW won in February last year by an innings. \"It's obviously better than it has been...it's a great improvement,\" Handscomb said. Nevill was left lamenting his team's 7-56 batting collapse in the first innings and another 4-0 slump on Saturday. AAP", "articleID": "2018102803_00104406_W", "names": {"Marcus Harris": ["Q1379373", "Q17708799", "Q6758213", "Q6758214"], "Mickey Edwards": ["Q1931352", "Q41446770"]}}]