[{"date": "2018-10-28", "url": "https://www.theage.com.au/sport/cricket/peter-handscomb-talks-up-harris-test-claims-20181028-p50cgw.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "Peter Handscomb talks up <mark>Harris</mark>' Test claims Peter Handscomb talks up <mark>Harris</mark>' Test claims Peter Handscomb talks up <mark>Harris</mark>' Test claims By <mark>Roger Vaughan</mark> Larger text sizeVery large text size Victorian captain Peter Handscomb would have had <mark>Marcus Harris</mark> in the Test batting debate well before the opener's career-best innings. <mark>Harris</mark> was man of the match for his unbeaten 250 as Victoria thrashed NSW by an innings and 107 runs in their Sheffield Shield match at the MCG. Test consideration? <mark>Marcus Harris</mark>. AAP Credit: Injured tailenders <mark>Trent Copeland</mark> and <mark>Mickey Edwards</mark> defied Victoria for an extra half an hour on Saturday, taking the game into day four. But paceman Scott Boland bowled <mark>Edwards</mark> in the second over on Sunday morning to dismiss NSW for 179 and seal Victoria's second innings win in as many Shield Games. Victoria are on a roll, having also won the one-day title, and now <mark>Harris</mark> has entered the Test batting debate with his first double ton at any level. Advertisement <mark>Harris</mark> has impressed Handscomb since coming to Victoria from WA two years ago. \"He's really put his hand up, but he's been doing a good job for us since he came here,\" Handscomb said. \"It's a shame that it's taken this long for his name to come up .\" I think he was a chance earlier, for sure. \"NSW captain Peter Nevill also praised <mark>Harris</mark>' innings, but noted the game might have turned out much differently had they not dropped a chance from the opener when he was yet to score. <mark>Harris</mark>, 26, left WA with a stinging critique from then-WA coach Justin Langer, now in charge of the national team, who called him mediocre with flashes of brilliance. But <mark>Harris</mark> has scored 1790 Shield runs since the move, the most in that time. He has eight Shield tons, including two last season, and in 65 first class matches <mark>Harris</mark> has scored 3928 runs at an average of 35.38. Handscomb, another potential Test candidate, was left kicking himself when he did a lot of hard work to reach 48, only for a poor shot to end his innings .\" I'm trying not to focus on the one ball I stuffed up and focus more on the 79 that I played really well, \"he said .\" I felt good out there...unfortunately I made one mistake and that's the batter's game. \"But I'm not that worried, I'm not that frustrated and I'm just very happy with how my game's going, but more importantly how the team is going .\" Boland also starred for Victoria in the second innings with 6-49. Handscomb and rival captain Nevill praised the new-look MCG wicket. It is the first Shield or Test result at the MCG since NSW won in February last year by an innings. \"It's obviously better than it has been...it's a great improvement,\" Handscomb said. Nevill was left lamenting his team's 7-56 batting collapse in the first innings and another 4-0 slump on Saturday. AAP", "articleID": "2018102803_00104406_W", "names": {"Roger Vaughan": ["Q52086338", "Q57739110"], "Trent Copeland": ["Q15052216", "Q7838379"]}}, {"date": "2018-10-29", "url": "http://www.gamereactor.eu/games/29421/Hearthstone", "content": "HEARTHSTONE: HEROES OF WARCRAFT REVIEW. Written by Ricardo C. Esteves on the 19th of April 2018 at 14 \"Witchwood is yet another quality expansion for Hearthstone .\" 0 REVIEW. Written by Kristian Kask on the 17th of August 2016 at 12 \"It's a good entry point for all the old World of Warcraft players who want to feel a bit nostalgic .\" ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players. 0 NEWS. Written by Ricardo C. Esteves on the 17th of September 2018 at 10:33 New Tavern Brawl and quests are available. 0 NEWS. Written by Ricardo C. Esteves on the 19th of July 2018 at 12:51 Especially the Magnetic mechanic.", "articleID": "2018102902_00238532_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2018-10-30", "url": "https://geektyrant.com/news/hawkeye-may-be-getting-a-series-for-disneys-streaming-platform-and-not-a-solo-film", "content": "Hawkeye May Be Getting His Own Series on Disney's Streaming Platform Rumor TV Movie Hawkeye Jeremy Renner Katherine Langford about 3 minutes ago by <mark>Tommy Williams</mark> Do you remember that report from several months ago that Hawkeye was going to get his own film? MCU Cosmic, the same source that gave us that rumor, is providing an update about that project. The update mentions that it is possible that instead of a film, the project may be a series for Disney's upcoming streaming service. It is also said that the project will \"involve Clint Barton's Hawkeye, but it will deal with him training a new younger archer .\" Many fans will know that most likely means they're bringing Kate Bishop into the universe, which would be pretty awesome. What's even cooler is that we may see Kate Bishop before then. The rumor mill has been trying to figure out who Katherine Langford will play in Avengers 4, and now fans think they have their answer: Kate Bishop. We know that Jeremy Renner will be Ronin in Avengers 4, but with the time traveling, who's to say that we don't see Kate show up? What are your thoughts? If Langford isn't Kate, who do you think she'll play and who should play Kate? <mark>Tommy Williams</mark> When I'm not writing for GameTyrant or GeekTyrant, I enjoy playing games and running my YouTube channel Poor Man Pedals for guitarists. For official inquiries, please email me: tommywilliams @ geektyrant.com | | @ tyguitaxe GeekTyrant Homepage Categories Art Comic Book GameTyrant Gear Humor Infographic Movie Music Tech Toy TV Original Podcast Rant Review Media Interview Photos Poster Trailer Videos Events Comic-Con D23 Expo E3 FantasyCon GT-X NYCC Star Wars Celebration Sundance WonderCon Alerts Rumor Spoiler Updated", "articleID": "2018103013_00054027_W", "names": {"Tommy Williams": ["Q1488293", "Q17143263", "Q7820010", "Q7820011"]}}, {"date": "2018-10-30", "url": "http://www.forestparkreview.com/9_12_11811/?utm_source=RSS&utm_medium=RSS&utm_campaign=RSS", "content": "How would Jesus vote next Tuesday? How would Jesus vote next Tuesday? Opinion: Columns By <mark>Tom Holmes</mark> Pastor Walter Mitty sat at his office desk at the Poplar Park Community Church earlier this morning staring out the window at the maple tree whose leaves were starting to turn yellow. He'd often slip into this meditative kind of zone when he was frustrated, and this morning he was having a severe case of brain freeze. What happened was that early last week he felt that he had to write a sermon on how being a follower of Jesus should change the way you vote in the upcoming election. His problem was that the more he listened to people talking about whom they were going to vote for and why the more unsure he became regarding what to say when he would climb into the pulpit. For example, after church on Sunday he had driven up to Manitowoc to celebrate his nephew Brian's birthday. It was a cozy family affair--Brian, Brian's brother Matt, and Mitty's sister-in-law Susan. As he was about to blow out sixteen candles Brian confessed, \"It's been three years since dad died, and I still miss him .\" In a way, everyone was relieved that Brian had acknowledged the elephant in the room. And all nodded their heads when Brian added, \"But lately I find myself not choking up when I talk about him. Three years ago I wouldn't have thought that could be possible .\" Brian's acknowledgment seemed to open the door to other topics. \"Hey, Uncle Walt,\" began Brian's younger brother Matt. \"My friend Koobmeej asked me to help with the Immigrant and Minority Farmers Conference coming up soon. It's a lot of work, but what I really like is listening to Koob's grandfather tell stories about when he was growing up in Vietnam during the war .\" Mitty turned to Susan and asked, \"So they're doing OK since the government settled them here as refugees?\" \"Yes, for the most part,\" answered his sister-in-law. \"I think the latest census revealed that there are around 1,400 Hmong living in Manitowoc, and especially the third generation kids like Koob are fitting in. What tickles me is to see Koob wearing Packer gear. Growing up in the mountains in northern Vietnam his grandfather didn't even know what football was, and here we have Vietnamese kids playing on our high school football team .\" Mitty took a chance and said, \"When President Trump was in Wisconsin on Wednesday he didn't say anything good about immigrants .\" Susan sighed and replied, \"I know. I know. Walt, you're very aware that I voted for Trump two years ago, even though I thought that he was a spoiled little boy who treats people like crap. I voted for him because he promised to put pro-life judges on the Supreme Court, and now that that has been accomplished, I'm done with him. I'm voting for Tony Evers for governor. Walker thinks he'll win by hanging on to Trump's coat tails and I think he'll be in for a big surprise on Nov. 6 .\" On the three-hour drive home from Manitowoc, Mitty pondered how this red state family which he loved did not fit the stereotype of a redneck, white supremacist Trump voter. On Monday, Mitty and <mark>Michael Rosenthal</mark> decided to get a cappuccino at the Retro and who should walk in but Fr. <mark>Bob Sullivan</mark>, who joined at the table by the window. Mitty had been telling <mark>Michael</mark> about his short visit to Manitowoc, so he brought the Franciscan up to speed with the story. He then confessed that he was thinking about preaching the next Sunday on how Jesus would tell people to vote on Nov. 6. <mark>Michael</mark> laughed and said, \"You think that would cut ice with this Jewish boy?!\" but added, \"I know what you mean, Walt .\" Fr. <mark>Bob</mark> said, \"Yeah, I struggle with that, too. First, I think you know that Catholic teaching declares that a fetus is a human life from the moment of conception. Cardinal Bernardine used to talk about the seamless garment. That is, if you are against war and capital punishment and are for a ban on killing wolves, then to be morally consistent you have to be pro-life .\" \"I'm pretty sure,\" said <mark>Michael</mark>, \"that in my temple most of the women, especially the younger ones, would say they are pro-choice, but if you would take a poll, say in Skokie, I think you'd get a whole different response .\" \"Here's what I struggle with,\" Fr. <mark>Sullivan</mark> said after a minute of thoughtful silence. \"I think my church's teaching on the sanctity of life is consistent with God's intention for us. On top of that, I saw that a poll two years ago showed that six in 10 Americans, including 61 percent of women, say abortion is morally wrong and that one-third of pro-choice Americans agree .\" \"My question,\" he continued after another pause, \"is what happens when the government tries to make a crime out of having an abortion. I do worry about back alley abortions and I think we learned something from the failure of Prohibition to rid society of the scourge of alcoholism .\" So, Mitty sat staring out the window at the maple tree this morning trying to figure out what he should say. The gospels record nothing from Jesus on the subject of abortion, partly because 2,000 years ago it was not an issue. What's more, his conversations lately had focused on abortion but there were issues like the environment, gun control, the budget deficit, foreign policy, taxes, tariffs, racism, the income gap, the achievement gap, immigration, health care, LGBTQ rights, the size and scope of government and sexual harassment. And then there was local politics. Candidates were already lining up to challenge Mayor Ernie Romano in the spring election and the ads were already getting personal and nasty. Carl Reiniger, for one, made a post on Facebook that implied that Romano's judgment was being limited by dementia, so one of Ernie's supporters made a post that accused Reiniger's wife of having an ongoing affair. As of lunch time the maple tree hadn't shared any wisdom with the pastor of Poplar Park Community Church. As he ate his toasted coconut flavored Greek yogurt, Mitty decided that anything Jesus might have to say about the election would have something to do with love, but how in the world he could apply that to next Tuesday he still had no idea. One thing that he knew for sure, however, was that anything he would say would be said with a humility informed by the fact that he didn't know all the answers.", "articleID": "2018103020_00414328_W", "names": {"Bob Sullivan": ["Q4934119", "Q888274"], "Michael Rosenthal": ["Q23302033", "Q24005022"], "Tom Holmes": ["Q19874293", "Q23016967", "Q4499221", "Q50366051", "Q7816220"]}}, {"date": "2018-10-30", "url": "https://lasentinel.net/los-angeles-urban-league-and-omniworks-promote-entrepreneurship-as-a-path-to-success-for-minorities-and-women.html", "content": "Los Angeles Urban League and OmniWorks ™ Promote Entrepreneurship as a Path to Success for Minorities and Women By Sentinel News Service Published October 30, 2018 Sponsored in part by CIT/OneWest Bank and the Los Angeles Department of Water & Power. Los Angeles Urban League and OmniWorks ™ create entrepreneurship workshops to provide small business owners with real-world, practical information to help take their business to the next level. Los Angeles Urban League and OmniWorks ™ are proud to announce the launch of their Entrepreneurship Workshop, a free two-day workshop that will give aspiring and existing small business owners a chance to get their questions answered and learn best-practices for starting and growing successful businesses. The first workshop will start November 2 nd from 1:00 PM-6:00 PM at Los Angeles Trade Tech College, and with more than 150 participants already registered, more workshops are being planned for early 2019. \"There's obviously a demand for quality entrepreneurial education\" said <mark>Brian Williams</mark>, Vice president and COO of Los Angeles Urban League. \"One of the main reasons small businesses fail is due to a lack of business and management education. This workshop is a great way for business owners to get a lot of practical information in a short period of time .\" The Entrepreneurship Workshops will focus on Principles of Lean Startup Methodology Being A Successful Entrepreneur Creating A Powerful Fast Pitch Creating Your Own SWOT Analysis Creating Generational Wealth Funding Panel: VC, Loans, Crowdfunding and Women & Minority Business Owner Certification Taking Your Business to the Next Level \"At OmniWorks our goal is to provide underserved communities democratized access to business education, markets and capital,\" said Quentin Strode, co-founder of OmniWorks. \"Entrepreneurship is a tough, but worthwhile path for individuals to create long-term wealth for their families and jobs in their communities .\" According to the U.S. Small Business Administration (SBA), small businesses have accounted for creating two out of every three net new jobs in the United States since 1995. In Los Angeles, small businesses are especially important to communities of color. In fact, a 2015 study by the U.S. Census Bureau reported that Los Angeles County is a \"microcosm of [the] nation's diverse collection of business owners .\" The report reflected that \"Collectively, Los Angeles County was home to 631,218 minority-owned firms including 81,563 Black-owned businesses .\" However, the SBA reports that 30 percent of small businesses fail within the first two years. Often the deciding factor between stumbling and success can be as simple as having access to basic information and resources.", "articleID": "2018103021_00132151_W", "names": {"Brian Williams": ["Q10498110", "Q11688807", "Q16106138", "Q20273975", "Q22636441", "Q28777337", "Q39185757", "Q43162643", "Q459695", "Q4965638", "Q4965639", "Q4965640", "Q4965642", "Q4965643", "Q4965645"]}}, {"date": "2018-10-31", "url": "http://whbl.com/news/articles/2018/oct/31/trump-constitution-doesnt-cover-birthright-citizenship/", "content": "Trump: Constitution doesn't cover birthright citizenship Wednesday, October 31, 2018 8:38 a.m. CDT FILE PHOTO: U.S. President Donald Trump speaks during a campaign rally at Southern Illinois Airport in Murphysboro, Illinois, U.S., October WASHINGTON (Reuters) - President Donald Trump on Wednesday said that the U.S. Constitution does not guarantee the right to citizenship to everyone born in the country and that he would continue his push to end it. \"So-called Birthright Citizenship, which costs our Country billions of dollars and is very unfair to our citizens, will be ended one way or the other. It is not covered by the 14th Amendment because of the words\" subject to the jurisdiction thereof .' Many legal scholars agree...\"Trump wrote in a Twitter post. (Reporting by <mark>Lisa Lambert</mark>; Editing by Chizu Nomiyama) More From National In Pittsburgh, more funerals Wednesday for synagogue massacre victims Kansas militia men blame Trump rhetoric for mosque attack plan PBF Energy's Delaware City refinery explosion injures three: media Los Angeles prosecutors decline to charge Stallone after sexual assault allegation Waymo gets first California OK for driverless testing without backup driver Republicans focus on defending U.S. Senate in campaign's last week Comments", "articleID": "2018103113_00589502_W", "names": {"Lisa Lambert": ["Q15485234", "Q25189499"]}}, {"date": "2018-10-31", "url": "http://www.msn.com/en-gb/lifestyle/style/this-is-the-real-reason-your-jeans-have-those-studs-on-the-pockets/vi-BBPchHb?srcref=rss", "content": "SETTINGS OFF HD HQ SD LO Southern Living The reason your jeans have those studs on the pockets Duration: 01:12 9 hrs ago SHARE SHARE TWEET SHARE EMAIL This Is The Real Reason Your Jeans Have Those Studs On The Pockets UP NEXT NOW PLAYING: Style The reason your jeans have those studs on the pockets Southern Living UP NEXT Video: Rangers v Kilmarnock in pictures - 13514401 Daily Record Phil interviews woman's ghost fiancee Daily Record Squirrel Tries on Ghost Mask Dailymotion Non-guilty pleasure! Chocolate fashion show opens Salon du Chocolat in Paris Dailymotion Royal Blue: Can <mark>Marco Silva</mark> afford to give Kevin Mirallas another chance? Liverpool Echo \"Bar Rafaeli removes niqab in controversial Hoodies advert\" Evening Standard Billie Faiers reveals how to apply false nails Closer Bhutan: What it means to be happy in the \"happiest country' Dailymotion Video: Outlander - Season 4 Official Trailer - STARZ - Full Trailer Daily Record Makeup Artist Does Human to Zombie Transformation Dailymotion Why forcing cyclists to wear helmets will not save lives The Guardian Video: Dundee v Celtic in pictures - 13514411 Daily Record Soldier Mom Makes Surprise Visit to Daughter's School Dailymotion", "articleID": "2018110106_00013516_W", "names": {"Marco Silva": ["Q20118419", "Q57025699", "Q6757714"]}}]