[{"date": "2018-11-01", "url": "https://www.zawya.com/mena/en/press-releases/story/EROS_GROUP_expands_its_Brand_Stores_concept_in_Partnership_with_Huawei-ZAWYA20181101140909", "content": "EROS GROUP expands its Brand Stores concept in Partnership with Huawei The Intelligent Life store concept redefines consumer experience Press Release Dubai, United Arab Emirates: Huawei in partnership with Eros Group opened doors to its all new store in Mirdiff City Center, Dubai. Only the second of its kind in the UAE, the new flagship store is themed on Huawei's Intelligent Life agenda that allows customers to get a hands-on experience and explore the latest technology from the brand in a comfortable futuristic space that is designed with nature in mind. The store was officially opened on 25 th October to coincide with the Mate 20 Series Pre-Order by Honorary Store manager <mark>Abdul Aziz</mark> Al Marzouqi @ Fex, Emirati entrepreneur and public figure, who welcomed hundreds of customers to place their pre-orders. Deepak J Babani, Executive Vice Chairman, Eros Group commented \"In recent years, experience stores of leading brands across categories have been attracting customers, especially in the high-end segment. The Huawei experience store will bring Huawei, as a brand, closer to the consumer. Eros Group is proud to be associated with it and is committed to open many such experience stores at most prominent destinations in UAE\". Commenting on the opening, <mark>David Wang</mark>, UAE Country Manager, Huawei CBG said, \"The United Arab Emirates holds a key strategic position for Huawei's goals of global leadership in the industry. We are very glad partnering with our long standing local partner, EROS GROUP, to being the new Huawei experience store and expand our presence in the market. We welcome both new and existing Huawei and Eros customers to come and experience our Intelligent Life store concept, along with our latest developments in consumer technology .\" Advertisement Niranjan Gidwani, CEO, Eros Group also added, \"Acceptability of Huawei mobile phone is on the rise. The recent success of Nova 3E, Nova 3i & P20 has contributed substantially to Huawei's market share. Huawei Experience stores will act as a catalyst in introducing the customer centric technology & user friendly design to the prospective buyers .\" Huawei Consumer Business Group (CBG), is offering customers attractive deals while pre-ordering the company's latest flagship, the Huawei Mate 20 series. Packed with some of the most powerful hardware today and features that rival no other in the market, the Huawei Mate 20 series is Huawei CBG's most powerful phone to-date. These offers will not only make it easier to purchase, but also include a variety of add-ons to even further improve the Mate 20 experience. Orders come with two separate offers for the Huawei Mate 20 Pro and the Huawei Mate 20. The Huawei Mate 20 Pro pre-order customers will receive the brand-new Huawei Watch GT, launched together with Mate 20 series at the regional event, and the Huawei Wireless Quick Charger. Customers who opt for the Huawei Mate 20 will receive a Huawei Bluetooth Speaker and the Huawei Supercharger Car Charger. Pre-order customers for the Huawei Mate 20 series will receive their device on 8 th November, the day when long awaited smartphone king hits the shelves. - Ends -", "articleID": "2018110114_00265866_W", "names": {"Abdul Aziz": ["Q22958462", "Q23542680", "Q23542681", "Q27830812", "Q30121874", "Q30600990", "Q4665272", "Q59601323"], "David Wang": ["Q16199852", "Q28871824", "Q9315976"]}}, {"date": "2018-11-02", "url": "http://invezz.com/news/equities/32912-Sage-share-price-outperforms-as-group-appoints-finance-chief-as-CEO-", "content": "Sage share price outperforms as group appoints finance chief as CEO Sage share price outperforms as group appoints finance chief as CEO Steve Hare to take top job at software specialist with immediate effect by Alice Young Friday, 02 Nov 2018, 10:34 GMT Shares in The Sage Group (LON: SGE) have climbed higher in today's session as the software specialist appointed its finance chief and interim chief operating officer as its new chief executive. The move came after <mark>Stephen Kelly</mark> stood down from the top job in August. As of 10:22 GMT, Sage's share price had added 3.02 percent to 566.60 p, outperforming the broader UK market, with the benchmark FTSE 100 index currently standing 0.67 percent higher at 7,162.02 points. The group's shares have given up just under 24 percent of their value over the past year, as compared with about a five-percent drop in the Footsie. Sage appoints new CEO The Sage Group announced in a statement this morning that it had appointed Steve Hare to the role of Chief Executive Officer with immediate effect. Hare joined the board in January 2014 as the group's finance chief, and was subsequently appointed to the additional post of interim chief executive officer on August 31, following the departure of outgoing CEO <mark>Stephen Kelly</mark>. The software group's chairman Donald Brydon commented that Hare had \"impressed the Board with the momentum, focus and clarity he has brought to the organisation over the last few months as COO but also throughout his tenure as CFO\". The Sage Group said that it had started a process to find new finance chief, with Hare to combine his CEO and CFO duties until an appointment was made. Analysts weigh in on move \"We welcome Mr. Hare's appointment as CEO and believe the shares will react positively to the news,\" analysts at Shore Capital commented in a note, as quoted by Proactive Investors, adding that in their view, the group was \"now unlikely to make any radical departures from the current strategy, as some had speculated, as Mr. Hare has been central to the current direction of travel\" .", "articleID": "2018110210_00450644_W", "names": {"Stephen Kelly": ["Q331908", "Q7609663", "Q7609664", "Q7609665"]}}, {"date": "2018-11-04", "url": "https://www.brisbanetimes.com.au/sport/soccer/it-s-a-lie-muscat-and-merrick-accuse-each-other-of-handshake-snubs-20181104-p50dwa.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "\"It's a lie': Muscat and Merrick accuse each other of handshake snubs\" It's a lie': Muscat and Merrick accuse each other of handshake snubs Merrick and Muscat celebrate the 2009 A-League grand final win. Sebastian Costanzo Credit: The frosty relationship between Newcastle Jets coach Ernie Merrick and Melbourne Victory coach Kevin Muscat has become even colder, after they accused each other of failing to shake hands during Victory's 1-0 win over the Jets on Saturday night. Merrick and Muscat were a formidable coach and captain duo at Melbourne Victory, winning two A-League grand finals between 2005 and 2011. However since then, and especially since 2017 when Merrick became coach of the Jets while Muscat continued his time at the helm of Victory, the relationship has soured. Victory won Saturday night's grand final re-match at Hunter Stadium courtesy of a brilliant second-half strike by Terry Antonis. In the post match press conference a journalist asked Merrick to \"elaborate\" on suggestions the Jets coach couldn't find Muscat to shake hands straight after the final whistle. \"I walked over to the bench to shake hands as I did with the assistant coach, the goalkeeping coach, the fitness coach but Kevin sprinted in the opposite direction over to his fans and I wasn't going to chase him,\" Merrick said. \"But that's just the way he is .\" Advertisement Merrick also suggested former Sydney FC coach <mark>Graham Arnold</mark> may have had a similar experience with Muscat. \"I was looking forward to a handshake,\" Merrick said. \"He's the one that disappeared, I mean I don't make a big thing of it but it's just disappointing, really. He won the game, should be happy .\" The same journalist told Muscat that \"Ernie's apparently made some mention after the game that he went to shake your hand and you declined\". To which Muscat responded: \"I didn't see Ernie. That's a lie. One of you are lying\". \"I was also waiting for a handshake prior to the game and there was none, which normally happens when you're the home team,\" Muscat said. Loading \"If you watch the footage I shook all the officials' hands, and all their players' hands. So, it is what it is .\" I don't mean to jump down your throat but if you're going to assassinate someone's character, I know you're only passing the message, but it's a lie. \"The handshake incident comes after Merrick refused to have a joint press conference with Muscat before the Jets and Victory grand final in May. It was the first time in A-League history there was no joint coaches' press conference before a grand final. Victory won the game on Newcastle's home turf 1-0, thanks to a controversial Kosta Barbarouses goal that should have been ruled out by VAR for offside in the build-up, but the technology suffered a malfunction .\" One thing we want to do here in Newcastle is host a wonderful grand final and show our hospitality, \"Merrick told Macquarie Radio at the time .\" The last thing I wanted was a joint press conference descending downwards and it becoming about the coaches one way or another. \"I think we're the only country in the world that has joint press conferences with coaches before a match .\" \"I've moved on. I don't know if Kevin Muscat has regarding our time,\" he said.", "articleID": "2018110403_00065414_W", "names": {"Graham Arnold": ["Q1336203", "Q5592634"]}}, {"date": "2018-11-04", "url": "https://www.thesun.co.uk/sport/football/7657865/thierry-henry-monaco-flops-reims-loss/", "content": "By Daniel Cutts Invalid Date, THIERRY HENRY has blasted his Monaco flops for lacking desire and refusing to play the way he wants. The Arsenal legend has yet to win any of his first four games as the struggling side's manger, drawing and losing twice - fans were furious at the end of the game, attempting to get onto the pitch to give the players a piece of their mind. Getty 3 Thierry Henry has had a shocking start to his reign at Monaco, with another loss at Reims yesterday The mega-rich club lie second bottom in Ligue 1, and were forced into sacking Leonardo Jardim in October after just one league victory all season. And Monaco were left humiliated against last night after losing 1-0 at minnow Reims, with both teams finishing the match with ten men. Following the game, Henry raged: \"They won basically all the duels. When we were at 11 vs 10, we really weren't in the match at all .\" Then we get a red card of our own and penalise ourselves completely on our own. Getty 3 Henry has a huge job to turn around Monaco, who are shot of confidence and in the relegation zone \"This was more worrying than on previous occasions because we do not produce any football .\" This evening was not about tactics, it was about a lack of desire. If you don't win any duels, then its difficult to win a football match. \"I understand our fans' frustration .\" This is a delicate situation. When you enter the pitch and your players involuntarily refuse to play, it is difficult. 3 Monaco fans vented their anger towards Thierry Henry and the players at full-time yesterday MOST READ IN FOOTBALL \"DO YOUR WORST' Stoke ace slams\" uneducated cavemen' after abuse for not wearing poppy \"truly humbled' Rooney confirms shock England return but insists it will be his last game TELL ME <mark>MOORE</mark> Get in the know on England and West Ham legend <mark>Bobby Moore</mark> PRAYERS FOR A KING Jamie Vardy prays as Leicester City players attend funeral of owner instaslam Thomas Muller's wife removes every photo of her with Germany star from Instagram Latest\" DISGRACE' Nemanja Matic subject to vile abuse after refusing to wear poppy for Man Utd win Exclusive HODD'S HEART OP HOPE Glenn Hoddle faces triple heart bypass surgery after birthday collapse McClean has a pop Stoke to quiz James McClean after attacking own fans over poppy abuse \"We have to find our confidence again. I would not have come to Monaco if I did not think that there was quality in this team .\" Henry and the rest of the Monaco squad were confronted by furious fans at the end of the Reims game, chanting and setting off flares. Stewards had to step in as supporters stormed to the front of the away section to throw abuse at their team, who are on just seven points. Comments Topics AS Monaco Thierry Henry Comments", "articleID": "2018110423_00414404_W", "names": {"Bobby Moore": ["Q4935388", "Q4935389", "Q4935390"]}}, {"date": "2018-11-05", "url": "http://harwichandmanningtreestandard.co.uk/sport/17201682.coyle-new-boss-mark-was-a-big-factor-in-my-decision-to-join-witham/", "content": "Sport Coyle: New boss Mark was a big factor in my decision to join Witham By Matt Plummer @ MattPlummer4 Sports reporter New signing Kevin Coyle Picture: <mark>Chris Smith</mark> 0 comment KEVIN Coyle is delighted to be back at step four level--and says manager Mark Ashford is one of the main factors in his decision to join Witham Town. The 31-year-old is set to put pen to paper at training on Tuesday night, after a short spell with Thurlow Nunn League outfit Harwich and Parkeston. He will remain dual registered with the Shrimpers, who he joined after parting company with Coggeshall Town in early October. But for now he is excited to be back in the Bostik League north division and eager to be involved when second-from-bottom Witham head to basement boys Soham Town Rangers on Saturday. \"I'm back at the level I want to be at,\" said Coyle, who is also record appearance-maker at hometown club FC Clacton. \"I didn't feel out of place at Coggeshall .\" I felt I coped well and really enjoyed my time there. \"Everyone was lovely but I just didn't see eye to eye with the manager .\" That's why I left and now I'm very happy to have joined Witham. \"I've been so impressed with Mark Ashford .\" We've only spoken on the phone so far but he sounds very clued up. \"He's a UEFA A coach and reminds me of my brother (former Clacton boss David).\" He knows his stuff and is clearly very tactically aware and very strong in terms of his man-management skills. \"He's been up front with me from the word go .\" He hasn't tried to string me along and said from start \"this is my budget. This is what I can offer you' .\" Mark spoke highly of me. \"He'd clearly done his homework and remembered me from watching games this season, which counts for a lot .\" Coyle, who turned down an approach from another Bostik League side, believes his new Witham side are in a \"false position\". He is confident they can start climbing the table soon--starting with three points against Soham. \"I've played against Witham four times this season, for Coggeshall,\" he said. \"Each time, I could see they were getting better and better .\" They're a well-drilled side. \"Silly errors are still costing them but they've played all the sides currently in the top ten .\" From what I've seen, they're in a bit of a false position. \"Coyle also spoke highly of Harwich, who he has played for since leaving Coggeshall. He made his last appearance, and scored a goal, in Friday's 4-2 division one south victory against Brightlingsea Regent Reserves .\" It's been great fun playing for Harwich, \"said Coyle .\" I've really enjoyed it. \"They've got a good set of lads and I've got a good relationship with (manager) Kieron Shelley and (assistant) <mark>Mike Wallace</mark>.\" They've helped me and I've helped them. It's been mutually beneficial. \"They're good guys and they're doing a great job there, in the club's first season back at step six level .\" They don't look out of place and I've agreed to remain dual registered, so I might be able to help them out again later in the season. \"0 comment", "articleID": "2018110511_00336366_W", "names": {"Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "Mike Wallace": ["Q2272587", "Q2919006", "Q325487", "Q3313573", "Q6849199", "Q6849200"]}}, {"date": "2018-11-06", "url": "http://www.gamereactor.eu/blogs/mike", "content": "Board games on GR Written by <mark>Mike Holmes</mark> on the 13th of September 2017 at 12:39 We love games here at Gamereactor (the clue's in the name, right?) and when it comes to the games we play we're looking to expand our scope a little. From here on in we're going to start writing about our experiences with board games too, specifically ones that have some sort of direct link to video games. If that goes down well with you lot, maybe we think about widening the range of games we talk about. Let us know what you think in the comments below. How Long is Too Short? Written by <mark>Mike Holmes</mark> on the 1st of August 2016 at 08:55 The recent news that No Man's Sky can apparently be completed in around 30 hours, and the reaction that this news has brought with it, certainly has caught my attention, and it has me pondering the question: what is the ideal length for a video game? As someone who plays them in less than ideal circumstances (having to rush through them for review) a complete but somewhat succinct experience can be quite a relief, but that doesn't mean that every now and then I don't like an extended love affair with a game (Crusader Kings 2, Destiny or The Witcher 3 in my case). 30 hours, with the option to get distracted and expand on that if required, seems like a perfectly reasonable period of time to play a game like No Man's Sky, but I also appreciate why some people might be disappointed that the scale of the galaxy built by Hello Games doesn't quite tally with the (prospective) length of the game. In this case we'll have to wait and see what the future brings, but it's still an interesting question and the answer will change depending on who you ask. As someone who loved the super-short Thirty Flights of Loving just as much as the timesink that is Destiny, I'm going to sit on the fence on this one and say \"how long is a piece of string?\" Who Won E3? Written by <mark>Mike Holmes</mark> on the 15th of June 2016 at 18:36 Two very different companies pitched us two very different shows during E3 this year. Sony and Microsoft, not for the first time, went head to head in unveiling their latest wares. Microsoft had an ace up their collective sleeve, but Sony were able to show a line-up of games that had the audience purring. Let's get it out of the way now and say there wasn't a clear winner, although if I was pushed into making a call, I might say that Sony edged it. The why is perhaps a little more complicated, and were it not for leaks and (potential) absentees, I might well have been singing a very different song. Let's face it, we knew practically everything about the Microsoft presser before it even happened. You can't help but think that maybe Sony knew too, and that their conference would have been ten minutes longer and would have included a hardware reveal of their own. Perhaps the power of Scorpio forced the PlayStation team to hold fire on their own announcement because they knew they were bested. Speculation on our part, fuelled by whispers, but certainly plausible. Either way, it was good work across the board, with Microsoft continuing the process of rebuilding their reputation, and Sony continuing to deliver great software for their all-conquering console. And while nobody is talking about Nintendo in the same breath as its rivals this time around, it's worth noting that a study shows that The Legend of Zelda: Breath of the Wild was the most talked about game at the show (so far). That's got to count for something. Finally, let's also shout out for the PC crowd (that includes me), who got another PC Gaming show, as well as a bunch of cross-buy and cross-platform announcements during Microsoft's event. It's a good time to do your gaming on PC. On top of all that, if you throw in a bunch of games on show at EA Play, Bethesda and Ubisoft, and everything else in between, and you've got a solid E3 all round. It might not have the stellar game that has everyone buzzing (perhaps, possibly, with the exception of Zelda), but we've still seen some big reveals and a few fascinating trailers. Covering it from here in the UK has been largely enjoyable (chaotic, but enjoyable) and, from where I'm sitting, nearly everyone has come out this year's show a bit better off. Parental Guidance Written by <mark>Mike Holmes</mark> on the 17th of April 2016 at 08:19 As the father of two young boys, games are on my radar in one more than one sense. Not only do I have my own gaming habits to consider, but I have to think about the games that my sons consume too. Given my profession, there's no getting away from this, and because I play and write about games all the time, it's only natural that the boys find them fascinating. Monkey see, monkey do. Given what I do for a living, as you might expect, other parents often talk to me about what they let their children play, and while I'll either agree or disagree with what they consider age appropriate, one thing is constant throughout each discussion, and that's a shared appreciation that kids today have it so good when it comes to games. They really are spoiled for choice. Whether we're talking about cleverly made tablet titles that take advantage of the intuitive touch screen controls (something that we now take for granted), or educational offerings on the desktop PC that test the grey matter, or even console games that develop coordination and reflexes (for example, my kids, like so many others, are partial to a bit of Lego-based gaming); there's so many great games for the younger generation to enjoy. Of course there's some total shite out there too, and with kids being easy to please and an impressionable audience, it's often parents like yours truly that are left to pick up the tab for questionable pieces of programming. However, once you ignore all the rubbish and start to seek out real quality, it becomes abundantly clear that there's plenty of decent stuff for them to play. The starting point for this blog came yesterday, Saturday, walking through town on the way to the local swimming pool, bumping into a friend and fellow parent, and talking about Disney Infinity and how impressed he was with the depth of the offering. It got me thinking about the difference in quality between what I played as a youngster, and what my children have to enjoy nowadays. Of course, back then, a lot more games were universal in terms of age appeal, and as a whole the game-consuming audience was less mature and it was less socially acceptable (remember when it wasn't really normal to play games?), but I still think it's fair to say that youngsters have never been served better than they are today. My kids enjoy Lego games (we're currently playing Lego Jurassic World at the moment), Steamworld Dig is another favourite, we're all partial to classic Sonic, and of course Nintendo makes great family friendly titles that we enjoy playing together. We've not got into full-on Minecraft mode just yet, but it's edging ever closer; I fear that addiction is just around the corner. There's a nice range of titles for the boys to choose from, and I know other parents think the same, even if we don't always agree on when it's suitable to let the little ones start playing games made for a slightly older audience. One thing we all agree on, though, is the online element, and I'm not alone in keeping my kids away from the interwebs and limiting (almost completely) their online interactions. Because while we can trust our kids to play nicely - most of the time - the same can't be said of everyone else, and I think it prudent parenting to be extremely careful about what, and who, they're exposed too. To sum up this rambling blog post: kids have never had it better. But like most parents, I think it pays to limit the time they can spend playing, as well as being extremely careful about what/who they're exposed to. There's a world of amazing digital experiences out there waiting to be discovered and enjoyed, but as a parent I personally think that we have a responsibility to our children, to expose them to certain games when they're ready for them, which isn't always when they might want to play them. My Private Army Written by <mark>Mike Holmes</mark> on the 4th of February 2016 at 09:46 Xcom 2 is here tomorrow, and I for one am looking forward to personalising my cadre of elite marines and taking on the alien scum. One of my favourite things about Xcom, and the reason I love the series so much, is the bond you form with your soldiers, this because of the permadeath feature, but equally because of the range of customisation options on offer. In particular, being able to name your soldiers makes such a difference. But who to name them after? My last play of the original game (well, the reboot) saw me name my soldiers after popular sci-fi movie characters, which worked better than my first play, where I named them after my friends. Watching your buddies die is less fun. So which way will I go this time? Name them after the players at my beloved Arsenal FC? No, they'd just bottle it and finish in fourth. Name them after musicians? I'd be worried they'd all check out aged 27. What about video game characters? That might work...Hmmmm. Decisions, decisions. What I don't want to do is spend too many hours of my initial play through customising my troopers, because you know, there's aliens to kill! Regardless of what I call the troopers in my private army, I can't wait to see how this next game plays out. Expect my thoughts on Xcom 2 in the nearish future.", "articleID": "2018110618_00414265_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}}, {"date": "2018-11-06", "url": "http://harrowtimes.co.uk/news/national/17205552.michelin-to-consider-scottish-government-proposals-to-prevent-plant-closure/", "content": "Michelin factory closure 0 comments Michelin has agreed to consider Scottish Government proposals that could save its closure-threatened Dundee tyre plant, MSPs have been told. Scottish Economy Secretary Derek Mackay said an action group, which he will chair, has been established to develop the proposition and it will meet in the city on Monday. Mr Mackay said: \"We're aware that this task is not easy one, and there are significant challenges to be faced .\" But we are, as a government, determined to do everything within our power, to prevent this closure. \"Economy Secretary Derek Mackay met workers at the plant on Tuesday (Andrew Milligan/PA) The developments emerged after the company announced that the tyre factory, which has 845 workers, will cease production within two years. Dundee City Council leader <mark>John Alexander</mark> has described the proposed shutdown as a\" body blow \"for all of the staff. A meeting was held on Tuesday at the plant, while production has been suspended until Thursday to allow employees to digest the news. Mr Mackay, who was in Dundee on Tuesday to meet representatives from Michelin, the Unite union and Dundee City Council, later returned to the Scottish Parliament to update MSPs on the situation. He said he met Michelin group executives on Sunday with Scottish Enterprise and\" they have agreed to consider a proposition we will bring forward to secure a sustainable future for the plant \". The Michelin plant will remain closed until Thursday morning (Andrew Milligan/PA) Mr Mackay told the chamber that\" good will \"between unions and Michelin was part of the reason Michelin is willing to listen to the proposition. He said:\" Michelin's announcement that it intends to close its plant in Dundee is devastating, not just for those who work at the plant but their families and the whole of the city of Dundee and the wider area. \"The Scottish Government will do all we can to secure a future for the plant and the workforce .\" Let me be clear--we will leave no stone unturned in our efforts to keep this plant operation in Dundee. \"Our top priority is to pursue options for the site to continue with commercial production .\" Potential options include \"repurposing\" the factory to do other work for Michelin. The market for premium smaller tyres such as those produced at the Tayside factory has dropped significantly due to an increase in cheap imports from Asia and a shift to larger car tyres, according to the French firm. It says it is not economically viable to produce small, low-cost tyres at the Dundee site or switch to the production of larger tyres. The plant opened in 1972 is due to cease operations by mid-2020. Unite said it had been working on a \"flexibility agreement\" involving voluntary redundancies and changes to the shift patterns over the last two months to secure the factory's future. It said it was given no notice of Monday evening's announcement. Many workers said they found out via the news and social media. Marc Jackson, Unite Michelin convener, said: \"It is important to stress to the workforce and the wider community in Dundee that Unite has a viable plan on the table .\" The flexibility agreement, which we believed would be signed-off this week, takes into consideration the current challenging market conditions but we have a plan in place to manage this situation over the coming years. \"The workforce can be assured that Unite will work tirelessly to ensure that this flexibility agreement is reconsidered by the Michelin Group and that the factory can stay open .\" Marc Jackson, Unite Michelin convenor said: \"To stress to the workforce and the wider community in Dundee, Unite has a viable plan on the table. It is a plan that can work for the workforce and the company .\" pic.twitter.com/T8gAfiJ4kX--Unite Scotland (@ UniteScotland) November 6, 2018 Dundee East MSP Shona Robison said all options would be looked at. She said: \"It's not going to be easy but one thing that really comes through is just how strong the workforce is .\" Dundee is part of a £ 350 million Tay Cities Deal aimed at boosting economic growth in the region through investment from both the Scottish and UK Governments. Mr Mackay has called on the UK Government to bring forward additional measures and investment in light of Michelin's announcement. Labour MSP Jenny Marra told the Scottish Parliament the proposed £ 350 million for the Tay Cities deal \"will not now touch the sides, especially as investments will go to other parts of the region\". Michelin said it would provide a personalised support package for each worker, with the opportunity to train in new skills and the possibility of being redeployed within the company or elsewhere. It will begin a consultation with employees and trade unions on the closure plan over the next fortnight. 0 comments", "articleID": "2018110619_00391034_W", "names": {"John Alexander": ["Q1281683", "Q15130097", "Q15485788", "Q17984377", "Q18637103", "Q23580725", "Q30314318", "Q30610836", "Q3180874", "Q3180876", "Q43126666", "Q43396031", "Q43913359", "Q6105197", "Q6218537", "Q6218545", "Q6218548"]}}, {"date": "2018-11-07", "url": "https://www.gladstoneobserver.com.au/news/cyclist-vows-to-keep-cameron-frewers-legacy-alive/3568829/", "content": "Experienced cyclist Matthew Eaton says for safety advocate Cameron Frewer's legacy to continue, more driver awareness and education is needed. <mark>Grant Edwards</mark> News Cyclist vows to keep Cameron Frewer's legacy alive by Ashley Carter Ashley Carter Full Profile Login to follow 7th Nov 2018 5:00 AM | Updated: 6:25 AM premium_icon Subscriber only 0 AS THE Sunshine Coast comes together to mourn safety advocate Cameron Frewer, one cyclist says more awareness is needed about road safety. Matthew Eaton, of Caloundra, had a near miss earlier this year, just 2km away from where Mr Frewer was killed Monday morning. Mr Eaton was turning right from Ivadale Blvd about 8am on April 17 when he was taken out by a driver who he said was not paying attention. \"I signalled and I had bike lights and everything,\" he said. \"After entering the roundabout...a car came up continuing on Parklands Blvd and didn't see me, and took me out from behind .\" He sustained a bad elbow injury with soft tissue and bone bruising, severe gravel rash to his back and legs, and whiplash in his back. Mr Eaton said the Sunshine Coast had \"amazing\" infrastructure for both cyclists and drivers, and the biggest issue with road incidents was driver inattention. \"I commuted every day in Sydney for five years...never had an accident,\" he said. \"It was sort of funny to come up here where there was a lot more space, and then suddenly there's an accident .\" The Sunshine Coast is really well set up for cycling. The shoulders of the roads are huge, there's usually a lot of space at intersections, there's lots of cycle lanes. \"But in a way, that almost breathes a bit of complacency amongst a lot of people, drivers and cyclists included .\" Mr Eaton is one of many cyclists who have saught legal advice from Shine Lawyers over incidents on Sunshine Coast roads. Cam Frewer has created a facebook page to educate drivers about cyclists on the roads and he has received death threats for his efforts. John McCutcheon While Mr Eaton didn't know safety advocate Cameron Frewer personally, he had read about his campaign efforts online. \"He was quite well known,\" he said. Mr Eaton said while there were \"bullies\" on the roads, they weren't the issue when it came to cyclist safety. To continue Mr Frewer's cyclist safety legacy, Mr Eaton said drivers needed to be educated on road sharing rules and be more attentive. \"They (bullies) are out there, and they intimidate you and they yell things and drive particularly close, but in actual fact I don't think they're the ones who are the most dangerous, because they're so attentive of you,\" he said. \"They see you and they try to annoy you, and they know you're there .\" In my accident it was just a normal, middle-aged lady who wasn't paying attention. \"Matthew Eaton had a near miss earlier this year. A long-running feud between drivers and cyclists on the Sunshine Coast has reignited in the wake of Mr Frewer's death. Mr Eaton said if each side could see the other's point of view, it would make a huge difference .\" I think every driver needs to ride a bike at one point, \"he said .\" If you got every person who drives a car just to ride a bike once on the road...that would make them understand. \"For cyclists to feel safe riding on public roads, Mr Eaton said all road users needed to be mindful and respectful of each other .\" At the end of the day, you're completely trusting people in vehicles...that they're going to see you and they're going to be attentive of you, \"he said .\" There's a lot of trust involved. \"Related Items premium_icon\" Cyclists are human beings': Lawyer's plea to drivers 0 caloundra Read More Login to follow cameron frewer Read More Login to follow cycling Read More Login to follow cyclist safety Read More Login to follow editors picks Read More Login to follow little mountain Read More Login to follow motoring Read More Login to follow road safety Read More Login to follow caloundra cameron frewer cycling cyclist safety editors picks little mountain motoring road safety", "articleID": "2018110621_00059670_W", "names": {"Grant Edwards": ["Q5596200", "Q56590026"]}}]