[{"date": "2018-11-06", "url": "http://www.msn.com/en-gb/news/newsliverpool/47-year-old-man-died-after-horrific-frenzied-attack-inside-kirkby-flats/ar-BBPpuOS?srcref=rss", "content": "© LIVERPOOL ECHO A murder investigation has been launched after a man was attacked inside a flat on Kelday Close in Kirkby A 47-year-old man died in hospital after an horrific \"frenzied attack' inside a block of flats, neighbours said. The emergency services were called out to to an address in Kelday Close in the Northwood area of Kirkby at around 3.45 am on Tuesday, October 23 to reports a man had been assaulted. Days later police put a closure order in place at a flat in the close. Today police said that the victim, who suffered serious head and chest injuries after an assault, died in hospital this morning. A 55 year-old man from the Kirkby area was arrested on suspicion of murder this afternoon and is being questioned by detectives. Today locals told the ECHO that the victim died after a\" frenzied attack .' Man trying to get his stolen bike back is brutally attacked by youths and put in hospital © Credits: LIVERPOOL ECHO LIVERPOOL ECHO A neighbour said: \"The lad's name was Ian. He was visiting the flats when he was attacked. He was beaten and then stabbed. He was a good lad and it was all over it nothing .\" Another local man said: \"It was a frenzied attack, really really bad. He was kicked, punched and then stabbed .\" © Credits: LIVERPOOL ECHO LIVERPOOL ECHO Police declined to comment on the suggestion the victim died from stab wounds prior to a post-mortem which is set to take place. The victim's family have been told of his death. A police closure order was put in place at 15 Kelday Close on October 31 following reports of drug fuelled violence, criminal damage and alcohol misuse. South Liverpool crime wave warning as shocking new tactics being used to raid homes A 50-year-old man and a 55-year-old man arrested at the time of the assault have since been released on bail. Detective Inspector <mark>Steve Ball</mark> said: \"A murder investigation has now been launched following the death of the victim in hospital and I would now urge anyone with information to please come forward .\" You may have been in the Kelday Close area around the time of the incident, or witnessed or heard something in the weeks following. No matter how small, your information could prove vital to the investigation and I would ask you to please contact @ MerPolCC, 101 quoting ref. 18400009584 or @ CrimestoppersUK on 0800 555 111. \"", "articleID": "2018110623_00220012_W", "names": {"Steve Ball": ["Q16836483", "Q7611857"]}}, {"date": "2018-11-07", "url": "https://economictimes.indiatimes.com/news/international/world-news/trump-frames-midterms-as-tremendous-success-despite-losses/articleshow/66533574.cms", "content": "Trump frames midterms as \"tremendous success' despite losses AP | Nov 07, 2018, 11.44 AM IST 0 Comments WASHINGTON (AP)--Resigned to losing his party's grip on the House, President Donald Trump congratulated the House Democratic leader on Tuesday night and chose to celebrate\" tremendous success \"for Republicans in maintaining the Senate. Trump called Rep. Nancy Pelosi and noted her pitch for bipartisanship in her remarks, her office tweeted. The president, in an earlier tweet, weighed in on the midterm results, overlooking the Democratic pickups in the House and writing:\" Tremendous success tonight. Thank you to all! \"With results still coming in, Democrats were on track to gain control of the House, while Republicans kept their Senate majority. Widely viewed as a referendum on Trump's presidency, the results offered a split decision that revealed deep divides in the American electorate. Control of the House would give Democrats the ability to launch investigations into the president and stymie his agenda. But White House spokeswoman Sarah Huckabee Sanders minimized the magnitude of likely Democratic gains .\" Maybe you get a ripple, but I certainly don't think that there's a blue wave, \"she told reporters, pointing to several early Republican wins. As for Republicans retaining control of the Senate, she called it\" a huge moment and victory for the president. \"White House aides called on Democrats to work with Republicans in the next Congress. Said White House counselor Kellyanne Conway:\" I don't know that there will be much of an appetite for Democrat lawmakers to spend all of their time, or most of their time or even a fraction of their time investigating, instigating, trying to impeach and subpoena people. \"In addition to the call to Pelosi, Trump called Republican Senate Majority Leader Mitch McConnell, Republican House Speaker <mark>Paul Ryan</mark> and Senate Democratic leader Chuck Schumer, as well as a number of candidates he backed during the race, the White House said. Sanders said he would continue making calls Wednesday. Trump had aggressively campaigned in the closing days of the race, his focus on boosting Republicans in states that he carried in 2016. Of the three races he targeted in the final day, the Republicans won all of them: Mike Braun defeated Democratic Sen. Joe Donnelly in Indiana, Josh Hawley defeated Democratic Sen. Claire McCaskill in Missouri and Attorney General Mike DeWine defeated Democrat Richard Cordray in the race for Ohio governor. The White House has been stressing the historical headwinds it faced: In the last three decades, 2002 was the only midterm election when the party holding the White House gained Senate seats. And only twice in the past eight decades has the president's party picked up House seats in the midterms. Trump spent election night watching returns with family and friends at the White House, his shadow looming large over the results. Nearly 40 percent of voters cast their ballots to express opposition to the president, according to AP VoteCast, a national survey of the electorate, while about 25 percent said they voted to express support for Trump. Opposition to Trump proved to be more a motivating factor for Democrats than support for the president a factor for Republicans. Still, Republican voters tended to be overwhelmingly supportive of the president. Faced with the possibility of keeping the Senate but losing the House, aides in recent days had laid out the political reality to Trump, who could face an onslaught of Democratic-run investigations. In turn, Trump began trying out defensive arguments ahead of Election Day, noting that midterm losses are typical for the party in the White House, pointing out a high number of GOP retirements and stressing that he had kept his focus on the Senate. Aides set up televisions in the White House residence for Trump, first lady Melania Trump and their guests to watch election results come in, with the sets tuned to different cable news channels. Among those expected were Trump's adult children, White House aides, Republican officials and presidential friends. The election served as a referendum of sorts on Trump's racially charged appeals and the strength of the coalition that powered him to the White House--a group he will need again in just two years. Overall, more voters disapproved of Trump's job performance than approved--a finding that is largely consistent with recent polling. Voters scored Trump positively on the economy and for standing up\" for what he believes in. \"But the president received negative marks from voters on temperament and trustworthiness. Still, about one-third of voters said Trump was not a factor in their votes. Trump's scorched-earth campaigning came to define the 2018 campaign. In the final days, he sought to motivate supporters with the battle over the confirmation of Supreme Court Justice Brett Kavanaugh. Ahead of the election, both parties claimed that the emotionally charged debate over Kavanaugh's confirmation would motivate their supporters to turn out. Returning to his immigration-heavy 2016 playbook, Trump went on to unleash his full fury on a caravan of migrants slowly making their way to the southern border. His take-no-prisoners approach troubled many Republicans seeking to appeal to moderate voters in suburban House districts, but Trump prioritized base voters in the deep-red states that could determine the fate of the Senate. At times he even appeared at odds with his own campaign, which in the election's final days released a gauzy ad aimed at suburban women. Trump did not care for the soft-focus ad, which notably did not mention him, according to a person familiar with the president's thinking who was not authorized to speak publicly. Instead he promoted an expletive-loaded video featuring a Latino man convicted of murdering two police officers, which was widely decried as being racist. ___ Associated Press writer Deb Riechmann contributed to this report. ___ Follow Lucey on Twitter at http: //twitter.com/ @ catherine_lucey and Lemire at http: //twitter.com/ @ JonLemire ___ For AP's complete coverage of the U.S. midterm elections: http: //apne.ws/APPolitics (This story has not been edited by economictimes.com and is auto--generated from a syndicated feed we subscribe to .) 0 Comments", "articleID": "2018110707_00097664_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2018-11-07", "url": "http://www.newcastlestar.com.au/story/5746510/pat-howard-was-stealing-an-income-macgill/?cs=4783", "content": "Stuart MacGill has slammed the tenure of axed Cricket Australia high performance manager <mark>Pat Howard</mark>. Stuart MacGill has savaged <mark>Pat Howard</mark> for \"stealing an income from Cricket Australia\" , while Ian Chappell believes the sacked team-performance boss's rugby background meant he was in a difficult position from day one. <mark>Howard</mark> made it clear to players and CA staff earlier this year that he intended to leave after the 2019 Ashes, when his contract expired. But he was tapped on the shoulder by CA chief executive <mark>Kevin Roberts</mark> on Wednesday. Former legspinner MacGill wondered why the former Wallabies five-eighth, who was appointed in 2011, lasted so long. \"I just wish we had it a few years ago because <mark>Pat Howard</mark> has been stealing an income from Cricket Australia for a long time,\" MacGill told Macquarie Sports Radio. \"It was always a joke to me and to a lot of my mates that he was high-performance manager when his performance during pretty much his whole time with Cricket Australia has been anything but .\" There was a period of time where <mark>Pat Howard</mark> was providing Australian selectors with a list of players they were allowed to pick the team from. \"In effect there was only one Australian selector and it was <mark>Pat Howard</mark>. It was absolute rubbish .\" Former Test quick <mark>Stuart Clark</mark>, who last year described <mark>Howard</mark> as useless, has also been among his most vocal critics. The high-performance environment created by <mark>Howard</mark> was criticised in last week's independent report but <mark>Roberts</mark> declared it a successful innings. \"I've got a huge amount of respect for <mark>Pat</mark>'s courage,\" he said. \"Multiple World Cups across both genders .\" It's easy to get caught up in our most recent ODI loss or Test loss but Australia over the last three years has been the best-performed non-Asian Test nation playing in Asia. \"Chappell argued <mark>Howard</mark> was\" at a handicap right from the start \", having met stern resistance from key figures in the sport because he was appointed after 20 Tests for the Wallabies and a stint as high-performance manager at the Australian Rugby Union .\" He came into a difficult situation...(people asked) what the hell a rugby union bloke was doing in a position that you'd think would require a lot of cricket knowledge, \"Chappell told Wide World of Sports .\" His other problem was being the person who had to tell blokes they couldn't play because of concerns over workload. \"Australian Associated Press facebook SHARE twitter TWEET email whatsapp", "articleID": "2018110708_00335852_W", "names": {"Kevin Roberts": ["Q10408794", "Q28421791", "Q28510868", "Q30122050", "Q6397367", "Q6397368", "Q6397369", "Q6397371"], "Pat Howard": ["Q10456326", "Q3368542"], "Stuart Clark": ["Q10858359", "Q3107247"]}}, {"date": "2018-11-07", "url": "http://macarthuradvertiser.com.au/story/5746566/pacific-2b-fund-in-foreign-policy-shift/?cs=9397", "content": "<mark>Scott Morrison</mark> is to announce a $2 billion Pacific infrastructure fund. A $2 billion fund will be created for infrastructure investment in the Pacific as <mark>Scott Morrison</mark> puts Australia's island nation neighbours at the centre of foreign policy. Defence links will also be beefed up, with more training of Pacific militaries and regular Navy deployments. In a speech in Townsville on Thursday, the prime minister will outline how Australia will make sure it is the first choice for Pacific nations on security, culture and the economy. \"My government is returning the Pacific to where it should be - front and centre of Australia's strategic outlook, foreign policy and personal connections, including at the highest levels of government,\" Mr <mark>Morrison</mark> will say. China has increasingly moved into the region with loans for infrastructure but Mr <mark>Morrison</mark> wants Australia to be the first port of call for Pacific nations. He's announcing the creation of an Australian Infrastructure Financing Facility for the Pacific to develop energy, communications and transport projects. \"This $2 billion infrastructure initiative will significantly boost Australia's support for infrastructure development in Pacific countries and Timor Leste,\" he says. \"It will use grant funding combined with long term loans to support high priority infrastructure development .\" A further $1 billion will go to Efic, Australia's export financing agency, to support Australian businesses active in the Pacific. Australian navy boats will be deployed to the Pacific for training and exercises using the new Guardian patrol boats Australia is giving to island nations. Defence, police and border security chiefs will also be invited to annual meetings. Mr <mark>Morrison</mark> will also speak to commercial TV networks about getting more Australian TV programming and sport available in Pacific countries. \"Our Pacific family switching on to the same stories, news dramas and sports we are watching at home,\" he says. Australia's diplomatic network is already larger than any other country in the Pacific but it will be expanded with posts in Palau, the Marshall Islands, French Polynesia, Niue and the Cook Islands. \"This will mean Australia is represented in every member country of the Pacific Islands Forum,\" Mr <mark>Morrison</mark> says. A new sports pathway program will also provide stronger sporting links between the Pacific, which has a population of more than 11 million, most of them in Papua New Guinea. Mr <mark>Morrison</mark> will host a barbecue for Pacific leaders at the APEC conference in Port Moresby next weekend. \"It's time to open a new chapter in relations with our Pacific family,\" Mr <mark>Morrison</mark> says. Australian Associated Press facebook SHARE twitter TWEET email whatsapp", "articleID": "2018110713_00172049_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}}, {"date": "2018-11-07", "url": "http://www.bromsgroveadvertiser.co.uk/news/national/17208464.youre-fired-notable-departures-from-donald-trumps-white-house/", "content": "<mark>Donald Trump</mark> waving 0 comments With US attorney general Jeff Sessions announcing he is standing down at the request of <mark>Donald Trump</mark>, we take a look at some of the other high-ranking officials who have departed from the White House--either voluntarily or by being sacked by the president .--November 7: US attorney general Jeff Sessions resigns as the country's chief law enforcement officer, saying the move came \"at Mr Trump's request\" .--October 9: Mr Trump announces UN Ambassador Nikki Haley's resignation, effective at end of the year. Saddened to hear @ nikkihaley will resign her post at the end of the year. A terrific Ambassador, Haley has stood up for American interests and championed democratic values around the world. I wish her well in whatever success comes next! pic.twitter.com/oMlj4gFjby--Ambassador Johnson (@ USAmbUK) October 9, 2018--August 29: The president announces that White House counsel Don McGahn would leave sometime in the autumn .--July 5: Environmental Protection Agency Administrator Scott Pruitt--June 5: Communications aide Kelly Sadler--April 12: Deputy national security adviser Ricky Waddell--April 11: Deputy national security adviser Nadia Schadlow Gen McMaster, Dina Powell and Nadia Schadlow did extraordinary job building national security strategy around President Trump's principles--Newt Gingrich (@ newtgingrich) December 6, 2017--April 10: Homeland security adviser Tom Bossert--March 28: Veterans Affairs Secretary David Shulkin--March 22: National security adviser HR McMaster--March 13: Secretary of State Rex Tillerson (PA Graphics)--March 12: Special assistant and personal aide to the president <mark>John McEntee</mark>--March 6: Economic adviser <mark>Gary Cohn</mark>--February 28: Communications director Hope Hicks--February 7: Staff secretary Rob Porter--December 13, 2017: Communications director for the White House Office of Public Liaison Omarosa Manigault Newman ❗ ️ Official Statement from my Publisher @ simonschuster @ GalleryBooks on TRUMPs attempt to stop publication of #Unhinged https: //t.co/iS0wlhAYfb--OMAROSA (@ OMAROSA) August 16, 2018--December 8, 2017: Deputy national security adviser Dina Powell--September 29, 2017: Health and Human Services Secretary <mark>Tom Price</mark>--August 25, 2017: National security aide Sebastian Gorka--August 18, 2017: Chief strategist Steve Bannon Steve Bannon behind White House senior adviser Jared Kushner and then-chief of staff Reince Priebus (Stefan Rousseau/PA)--July 31, 2017: Communications director Anthony Scaramucci--July 28, 2017: Chief of staff Reince Priebus--July 21, 2017: Press secretary Sean Spicer A friend of mine and a man who has truly seen politics and life as few others ever will, Sean Spicer, has written a great new book, \"The Briefing: Politics, the Press and the President .\" It is a story told with both heart and knowledge. Really good, go get it!--<mark>Donald</mark> J. Trump (@ realDonaldTrump) June 30, 2018--May 30, 2017: Communications director Michael Dubke--May 9, 2017: FBI Director James Comey--March 30, 2017: Deputy chief of staff <mark>Katie Walsh</mark>--February 13, 2017: National security adviser <mark>Michael Flynn</mark> 0 comments", "articleID": "2018110721_00421812_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Gary Cohn": ["Q5524866", "Q5524867", "Q5524868"], "John Mcentee": ["Q11727943", "Q28741861", "Q6247725"], "Katie Walsh": ["Q28600075", "Q6377580"]}}]