[{"date": "2018-11-07", "url": "http://www.bromsgroveadvertiser.co.uk/news/national/17208464.youre-fired-notable-departures-from-donald-trumps-white-house/", "content": "<mark>Donald Trump</mark> waving 0 comments With US attorney general Jeff Sessions announcing he is standing down at the request of <mark>Donald Trump</mark>, we take a look at some of the other high-ranking officials who have departed from the White House--either voluntarily or by being sacked by the president .--November 7: US attorney general Jeff Sessions resigns as the country's chief law enforcement officer, saying the move came \"at Mr Trump's request\" .--October 9: Mr Trump announces UN Ambassador Nikki Haley's resignation, effective at end of the year. Saddened to hear @ nikkihaley will resign her post at the end of the year. A terrific Ambassador, Haley has stood up for American interests and championed democratic values around the world. I wish her well in whatever success comes next! pic.twitter.com/oMlj4gFjby--Ambassador Johnson (@ USAmbUK) October 9, 2018--August 29: The president announces that White House counsel Don McGahn would leave sometime in the autumn .--July 5: Environmental Protection Agency Administrator Scott Pruitt--June 5: Communications aide Kelly Sadler--April 12: Deputy national security adviser Ricky Waddell--April 11: Deputy national security adviser Nadia Schadlow Gen McMaster, Dina Powell and Nadia Schadlow did extraordinary job building national security strategy around President Trump's principles--Newt Gingrich (@ newtgingrich) December 6, 2017--April 10: Homeland security adviser Tom Bossert--March 28: Veterans Affairs Secretary David Shulkin--March 22: National security adviser HR McMaster--March 13: Secretary of State Rex Tillerson (PA Graphics)--March 12: Special assistant and personal aide to the president <mark>John McEntee</mark>--March 6: Economic adviser <mark>Gary Cohn</mark>--February 28: Communications director Hope Hicks--February 7: Staff secretary Rob Porter--December 13, 2017: Communications director for the White House Office of Public Liaison Omarosa Manigault Newman ❗ ️ Official Statement from my Publisher @ simonschuster @ GalleryBooks on TRUMPs attempt to stop publication of #Unhinged https: //t.co/iS0wlhAYfb--OMAROSA (@ OMAROSA) August 16, 2018--December 8, 2017: Deputy national security adviser Dina Powell--September 29, 2017: Health and Human Services Secretary <mark>Tom Price</mark>--August 25, 2017: National security aide Sebastian Gorka--August 18, 2017: Chief strategist Steve Bannon Steve Bannon behind White House senior adviser Jared Kushner and then-chief of staff Reince Priebus (Stefan Rousseau/PA)--July 31, 2017: Communications director Anthony Scaramucci--July 28, 2017: Chief of staff Reince Priebus--July 21, 2017: Press secretary Sean Spicer A friend of mine and a man who has truly seen politics and life as few others ever will, Sean Spicer, has written a great new book, \"The Briefing: Politics, the Press and the President .\" It is a story told with both heart and knowledge. Really good, go get it!--<mark>Donald</mark> J. Trump (@ realDonaldTrump) June 30, 2018--May 30, 2017: Communications director Michael Dubke--May 9, 2017: FBI Director James Comey--March 30, 2017: Deputy chief of staff <mark>Katie Walsh</mark>--February 13, 2017: National security adviser <mark>Michael Flynn</mark> 0 comments", "articleID": "2018110721_00421812_W", "names": {"Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"], "Tom Price": ["Q1415243", "Q18737190", "Q21622399", "Q2439995", "Q40284708", "Q6379460", "Q7817278", "Q7817279", "Q9023595"]}}, {"date": "2018-11-08", "url": "http://www.wirralglobe.co.uk/sport/national/17211770.pochettino-would-prefer-not-to-send-players-on-international-duty/", "content": "Mauricio Pochettino 0 comments Tottenham manager Mauricio Pochettino would prefer not to send his players on international duty if he had the choice. Spurs are battling their way through a hectic run of five games in 13 days, culminating in Saturday's Premier League trip to Crystal Palace. They have had to do it with a lengthy injury list, which has seen them robbed of Dele Alli, Eric Dier and Christian Eriksen among others .???????????????? Our #FiveLions named in Gareth Southgate's latest @ England squad. pic.twitter.com/826clZFbwh--Tottenham Hotspur (@ SpursOfficial) November 8, 2018 Alli has been managing a hamstring problem, Dier has missed the last three games with a thigh injury and Eriksen has not fully recovered from an abdomen injury, yet all three have been called up by their countries for the games next week. That is not ideal for Pochettino, not to mention the other players that are still playing catch up from an extended stint at the World Cup, but he has no choice but to wave them off. \"Yes it is true if you said to me would you prefer all my international players stay here and rest for two weeks without competition, I would say yes,\" he said. \"But that is impossible. That is why we were talking before about Dele Alli and Christian Eriksen and international duty. Eric Dier has been called up for England despite missing Tottenham's last three games with injury (Nick Potts/PA)\" It is play, play, then move them there and play again. If you see our schedule for the next few months it will be so tough. How do you manage that? \"I understand we need to sacrifice some games for some players so they can cope with the demand in the future .\" Dier was named in Gareth Southgate's England squad for the games against the United States and Croatia shortly after Spurs had confirmed he was fit after his recent injury. With Mousa Dembele out for the rest of 2018 it seems likely that Dier will come straight back into the side at Selhurst Park. TEAM NEWS: @ mousadembele (ankle)--scans have confirmed ligament damage to right ankle and is unlikely to be available until the New Year. pic.twitter.com/twfAUTMoKh--Tottenham Hotspur (@ SpursOfficial) November 8, 2018 Even if he does not play, Spurs have no power to keep him. \"If he is fit and the manager calls him, he must go,\" Pochettino added. \"If he is fit but I decide not to put him in the starting XI we will need to get permission as well from the national team .\" Despite the injury problems, which have also seen Victor Wanyama, <mark>Danny Rose</mark> and Jan Vertonghen spend time out, Spurs have recorded their best-ever Premier League start, with eight wins from 11 games. Pochettino has masterminded it by using more players than any other side and he finally feels happy with his back-up players. TEAM NEWS: @ ericdier (thigh) and @ VictorWanyama (knee) have both returned to training with the squad. pic.twitter.com/pTCu6HUgh1--Tottenham Hotspur (@ SpursOfficial) November 8, 2018 \"Of course now every time I decide to pick my starting XI I have a name I feel comfortable to play,\" he added. \"It's so important. Because competition in football is an important thing that puts pressure on yourself. It's not only the pressure from the coaching staff, fans and club .\" It's from your team-mate. \"If you are not ready I'll take your place' .\" The most important thing is when you players start to feel pressure from their team-mates pushing you to move and be conscious and responsible to increase your level. That is a very good thing that happens in teams that need to win. \"0 comments", "articleID": "2018110822_00371402_W", "names": {"Danny Rose": ["Q5220782", "Q5220783", "Q5220785", "Q83498"]}}, {"date": "2018-11-09", "url": "http://nbc29.com/story/39453321/psychologist-explains-why-you-cant-just-buy-one-thing-at-target", "content": "Psychologist explains why you can't just buy one thing at Target Posted: Updated: Credit: Shutterstock We're all familiar with that thing that happens at Target--the one where you walk in to buy dog biscuits and shampoo and push a cart with more than a hundred dollars' worth of stuff out the door an hour later. It even has a name and an Urban Dictionary entry; it's the Target Effect. It's something many of us joke about, but this unintended overspending can wreak havoc on a family's finances and lead to money stress. If it's a problem, what's to be done? Avoid Target altogether? It's my favorite store to shop for household items so I didn't want to give it up, but repeated hundred--and even two hundred dollar trips--I hadn't budgeted for left me planning to stick with online shopping where I'd be less tempted by the latest must-have thing from Hearth & Hand with Magnolia or that good-smelling candle. But I wondered if it was possible to overcome the Target Effect with less drastic measures. To find out I talked with Louisville-based licensed clinical psychologist <mark>Kevin Chapman</mark>, who specializes in anxiety and related disorders. And yes, according to <mark>Chapman</mark>, it can be done. He shared his Target intervention tips with NBC News BETTER. A HAPPY SHOPPER IS A SPENDING SHOPPER First, we have to understand how this effect works: in short, it just feels good to be in Target. \"The lighting, the bright colors...it brightens your affect and you tend to have a pretty good time so it's conducive to buying,\" <mark>Chapman</mark> said. Of course being able to stop at Starbucks for a vanilla crème cold brew can also induce us to spend more time, he said. Spending more time translates to spending more money--and buying things we didn't intend to. Target is also very clever at placing things in strategic places to boost cross-selling, and many stores now are rolling out lifestyle settings that help shoppers visualize the goods in their own home. Meanwhile they're employing \"psychological pricing,\" <mark>Chapman</mark> said. \"They give you the impression that you're getting a deal .\" It's a dead simple trick, but one we fall prey to. \"Because it has a 9 on the end of it it appears to be on sale,\" he said, \"so how could you pass it up?\" But we can't blame it all on the retailer. To understand how some of us are affected by Target's sales-boosting techniques we should look at why others aren't, <mark>Chapman</mark> said. THE TARGET EFFECT AS A SYMPTOM \"People who aren't affected, I would consider to be much more emotionally regulated,\" he said. \"They're not engaging in retail therapy--which is just code for shopping as an emotional behavior to provide relief from strong emotions .\" \"Many people just have a hard time dealing with certain emotional experiences, say anxiety,\" he went on. So they \"try to do things to feel better. Retail therapy makes them feel better temporarily but the problem is it contributes to more negative consequences .\" Despite that, he said, \"since we're creatures of habits,\" the next time I'm triggered I do what worked before, but it backfires and I feel like garbage .' \"So the Target Effect is less its own thing, he said, than a symptom of a different problem. TOOLS TO REIN YOUR WORST TENDENCIES Still, though, there are tools shoppers can use to prevent overbuying .\" One strategy is to have a strict budget and to know \"this is what I have every month,'\" he said. \"That's not particularly sexy but stating that is important. Frugal and financially consciousness people...create a budget and don't engage in impulsive buying .'\" I learned that myself during a period of unemployment in our household. When there was literally no money available to overspend we just didn't. But what if you are less disciplined and/or aren't as financially limited? \"The only way to not succumb [to the Target Effect] is to reprogram your mentality about even going,\" <mark>Chapman</mark> said. \"One thing I would encourage people to think about is the idea of not--quote unquote--window shopping. Window shopping is a misnomer, so why are you wandering around Target if you don't need to be there? This will decrease impulsive buying tendencies. If I don't need to shop and it's not in my budget simply don't go to Target .\" Well, there's that. But what about once we're there, and we need a few household things? GIVE YOURSELF A PEP TALK BEFORE HEADING IN \"People who are emotionally regulated who won't fall victim, they're choosing their thoughts and appraisals beforehand, kind of like pep talking,\" <mark>Chapman</mark> said. We can all use these thoughts, he said. \"For instance, say I know I have a problem with Target Effect. Before I go I have to be diligent enough to say I'm not drinking the Kool-Aid today. I have to strategically pick certain thoughts before I even get in my car that are conducive to only buying what I want to buy .\" Key to these thoughts are that they're short and easily memorizable, and realistic, he said. \"One example of a thought to be would be' I only need detergent,'\" <mark>Chapman</mark> said. \"The reason that thought is important is the word need based on my budget, the only thing I need to purchase and the only reason I need to go is to purchase this product. [If I] rehearse that, my behavior is guided to the laundry aisle, [I] look at nothing else, and checkout .\" Wait, really? Just repeat to yourself you only need detergent? Yes, <mark>Chapman</mark> said. Say, \"I budgeted for dog food so I put on a thought like' I only need dog food .' That dictates I can only buy dog food so if I buy anything else I'm violating my code .'\" Ok, but it's very easy to see this thought turning into \"Yes I only need dog food, BUT ...' Right? But I see this cute rug on sale, or wouldn't it be nice to have this yummy smelling hand soap? NEED MORE BACKUP? ASK YOURSELF THESE QUESTIONS In this case, <mark>Chapman</mark> said,\" Use disputing questions. \"These are\" all-purpose questions that force you to challenge [those] thoughts. Before I go I need to practice that dialog. I'm only going for dog food but I find this other item conveniently nearby would make me feel better. What's the evidence that I need that [item], that it would make me feel good? You have to base it on evidence that I need that item. Are you 100 percent sure you need to buy it? No, you want it. What's another perspective?' I would regret it .' \"But for this to work, he said,\" you have to practice it before you go. \"If you think it will take more than repeating some thoughts to combat your Target Effect behavior, there's another level, <mark>Chapman</mark> said. Drawing up on his experience with people with anxiety, he recommends exposure therapy .\" Go into Target practicing those mantras, and having a companion with [you], going in with the intention of that one item you choose in advance, purchase the item, flee the store, and after the fact, process how you feel emotionally after. If you didn't buy the Poo-Pourri, did the sky fall? \"Now\" Ask \"what did I learn?'\" he said. \"You learn' I can go to Target and buy one thing .' That forms a new association in your brain that tell you can buy one thing at Target .\" Now that association can't be rewritten overnight, he said; it can take some practice. But he's so confident, \"I would straight up take someone who tells me they are a victim of the Target Effect and take them in and show them,\" he said. Looks like I know who to call next time I just need detergent.", "articleID": "2018110915_00119105_W", "names": {"Kevin Chapman": ["Q15303992", "Q3195676"]}}, {"date": "2018-11-09", "url": "https://theworldgame.sbs.com.au/double-agents-how-clubs-players-and-advisers-play-the-tax-game", "content": "Behind most millionaire football stars stands a successful agent. Except when it comes to filling out a tax return. Updated Updated 3 mins ago Share Share on Facebook Share on Twitter Take Manchester City and the French player Gael Clichy, recruited by the club in 2011 for more than 4 million pounds ($5.2 million) a year. Man City recorded that soccer agent Darren Dein represented it in the negotiations. Yet British press reports identified Dein as Clichy's agent starting in 2010. And in two emails to officials at a European club in 2013, Dein said he acted for Clichy. Who Dein represented became the subject of inquiry by UK tax inspectors. It is not the only instance to attract the attention of Her Majesty's Revenue and Customs (HMRC). An examination of thousands of documents relating to some of the world's richest football clubs shows how clubs and players have repeatedly clashed with the tax authority over the role and pay of agents. At stake are hundreds of millions of pounds in tax revenue. The \"Football Leaks\" documents, which include emails and contracts, were obtained by the German publication Der Spiegel and reviewed by Reuters in partnership with European Investigative Collaborations, a consortium of international media. Agents typically take a cut of at least five percent of a player's wage for negotiating on the player's behalf. In many cases, the club pays, treating this sum as part of the player's overall remuneration package. Under UK law, this is a taxable \"benefit in kind\" to the player. The player becomes liable for income tax and sales tax, and the club becomes liable for social security payments. If the player has negotiated a salary net of tax, the club ends up paying all of it. But if the parties can show that the agent worked for the club, not the player, none of these taxes are due and the agent's fee is treated as a regular business expense. In such cases, clubs benefit, and the tax authorities are the losers. In the instance of Man City and Dein, tax inspectors challenged the club's account of Dein's role in negotiating that 2011 contract with Clichy, the documents show. In 2013, the tax authority wrote to Man City about a 1.2 million pound payment it made to Dein in 2011 and asked why the club hadn't reported a \"benefit\" to Clichy. It noted that \"all the information in the public domain shows that Dein is the player's agent .\" In November 2015, after a meeting with the club, the tax authority wrote, \"As stated during our meeting, we do not accept that Darren Dein doesn't act for the player .\" Later the same month, Man City's head of finance, Andrew Widdowson, acknowledged in a letter to the tax authority that while Man City had paid Dein \"to influence the player into joining us\" in 2011, the club also accepted that \"as you point out, Darren Dein is the player's agent and with that in mind we accept that a proportion of the fee should be apportioned as Dein acting for the player .\" Man City sought to reach a deal with HMRC over the unpaid tax, exchanges between the club and the tax authority show. Reuters was unable to determine the outcome. Based on the sum involved and the tax rate at the time, the total bill was likely to have been at least one million pounds, if Dein was deemed to have represented Clichy alone, Reuters has calculated. Sterling becomes highest-paid British player with new contract Man City said it would not comment on \"out of context materials purported to have been hacked or stolen from City Football Group and Manchester City personnel and associated people. The attempt to damage the Club's reputation is organised and clear .\" A law firm representing Dein and Clichy declined to answer questions about their relationship. The tax authority said it would not comment on individual cases, but added, \"HMRC works closely with football clubs to ensure payments made to their agents during the renegotiation of a contract or club transfer are taxed correctly. We actively challenge any payments we consider not to be realistic and ask for evidence to prove legitimacy of any arrangement .\" In recent years, the UK tax authority has increased its scrutiny of clubs, including those in the world's richest league, the English Premier League. As of November 2018, the tax authority was investigating 171 players, 44 clubs and 31 agents about agents' fees and other tax issues and had recouped 332 million pounds, it said, without naming the agents, clubs or players concerned. But in the documents examined by Reuters, the tax authority didn't impose any punishment. Instead it offered to settle back-tax claims without a penalty. And, the documents show, it allowed clubs to say agents jointly represented a club and a player. The tax authority declined to answer questions about this arrangement and why it hadn't imposed penalties. Between May 2015 and January 2018, agents were involved in around 1,400 contract negotiations between Premier League clubs and players, according to player transfer data gathered by the Football Association (FA). In over 80 percent of these negotiations, the FA recorded that the club and the player used the same agent, a Reuters analysis of the publicly available data found. But public statements by some agents suggest that in many instances the agent was only working for the player. Some club officials have expressed concern that they are pushing the boundaries of what is permissible. Following inquiries by the UK tax authority about how Man City reported player benefits, club finance head Widdowson in July 2015 emailed the chief financial officer of Man City's parent company and noted agents' fees were sometimes an area \"where we are sailing close to the wind .\" Man City declined to answer questions about how it reported its relationship with football agents. Widdowson did not respond to requests for comment. THE FATHER AGENT Players rely on agents to help them negotiate contracts, choose clubs and maximise their earnings off the field, from activities such as advertising. For many years it was routine for clubs to pay agent fees on behalf of players without reporting these payments as a \"benefit in kind,\" and for the UK tax authority to let the practice go unchallenged. By the early 2000s, with the value of player contracts soaring, the tax authority began to look more closely at this arrangement. One of the people that caught its attention was Vincent Kompany, captain of Man City and then captain of Belgium's national team. Kompany lured by EPL appeal In November 2014, Belgian agent Jacques Lichtenstein told Dutch magazine Sports Football that Kompany had been a client for years. In June that year, an executive at Lichtenstein's firm, Eleven Management, wrote to a potential business partner listing several of Eleven's clients. Vincent Kompany was the first name on the list drawn up by the executive, Peter Verplancke. Yet in July 2012, when Kompany agreed a new 6 million-pounds-a-year contract with Man City, the club recorded in a submission to the FA that Kompany was advised not by Lichtenstein, but by someone with no apparent experience of the high rolling English Premier League - his father, Pierre. Pierre Kompany's name does not appear on Belgian or English lists of registered agents. His website says he has worked as a taxi driver, engineering lecturer and municipal politician. For its part, Manchester City signed a contract with Lichtenstein and his firm Eleven Management. The tax authority wrote to Man City asking it to clarify Lichtenstein's role in the negotiations. Man City finance head Widdowson replied in November 2012 that the club had retained Lichtenstein to \"help negotiate with his (Kompany's) father .\" Kompany did not have an agent, Widdowson said in the letter. \"As far as we are aware there is no signed agreement between Jacques Lichtenstein and Vincent Kompany .\" As late as October 2015, Widdowson was maintaining in an email to the tax authority that \"Vincent Kompany's father actually represents him in all of his negotiations .\" If the tax authority accepted Man City's account that Lichtenstein worked for the club, and not the player, payments to the agent wouldn't be considered a taxable \"benefit in kind\" to Kompany. The authority wouldn't levy sales tax or social security. If it considered that Lichtenstein solely represented Kompany, however, the total tax bill would have been at least 2.3 million pounds, according to Reuters calculations based on the agreed fee and prevailing tax rates. The authority's review of the matter found that \"Lichtenstein to all intents and purposes acts and behaves like he is the player's agent,\" a tax official wrote to Man City in November 2015. Documents appear to show Man City considered settling with tax authorities. Reuters was unable to determine whether Man City ultimately accepted that Lichtenstein represented Kompany or paid back taxes. The tax authority, Man City and Pierre Kompany declined to comment. Lichtenstein and Verplancke did not respond to requests for comment. Vincent Kompany's lawyer said \"my Client's case has been investigated by the Authorities thoroughly in the recent past and he has answered all their questions satisfactorily, which was confirmed in writing .\" He said Reuters calculations \"can only be based on incorrect facts and/or guesses\" but declined to identify inaccuracies or answer detailed questions. In 2014, the tax authority challenged Man City about another deal involving a Belgian player, Dedryck Boyata. Boyata had signed a contract with the club in 2010 and negotiated a new deal in 2011. Man City recorded for tax purposes that in both deals, Boyata relied on the advice of his father, Bienvenu, a former player who ran a van rental business. Bienvenu Boyata does not appear on Belgian or English lists of registered agents. Man City again retained Lichtenstein as its agent, contracts and other files show. The club told the tax authority it felt the need to retain an agent because Boyata, advised by his father, had demands the club found unrealistic. \"DB's father was asking for too much money and JL was used to try to get DB's father to see sense & reduce his demands,\" according to club minutes of a February 2015 meeting between Man City and tax officials. Man City had hired Lichtenstein after club official Brian Marwood met him at a Boyata family event, where the agent was present \"as a family friend,\" the club told tax officials at that same meeting. Yet Man City documents referred to Lichtenstein as Boyata's agent. These include a 2012 spreadsheet that listed Man City players and their representatives and other communications. In an interview with Belgium newspaper DH in August this year, Boyata said Lichtenstein had represented him \"for a long time .\" Reuters could not determine the outcome of the tax authority's inquiry or whether Man City agreed to pay any back tax for the Boyata deals. The tax authority and Man City declined to comment. Marwood, Lichtenstein and Dedryck Boyata did not respond to requests for comment. Bienvenu Boyata replied in a text message that \"for good growing of the player you need both the father and best agent's service .\" A NEAT STEPOVER From around 2010 clubs, managers and players were increasingly adopting a different approach to recording agent fees. They recorded in their tax filings that an agent worked for both a club and a player or manager. They didn't split the agent's fee evenly. Instead, they attributed only a small share of the fee to the player or manager. That gave some ground to the tax authorities, but limited the tax liability assumed by the player or manager. For example, in 2013, Jose Mourinho, one of the biggest names in world soccer, returned to Chelsea Football Club as manager. Public statements and documents reviewed by Reuters show Mourinho has used an agent named Jorge Mendes since at least 2004. When Chelsea sent a draft contract to Mendes' firm, Gestifute, in June 2013, it proposed paying Mendes's fee and recording that 90 percent of the total was in recompense for his work for Chelsea. UK tax rules state that the breakdown of fees must reflect the true nature of the business relationship. If the club pays almost all the fee on its own account, rather than on behalf of the manager or player, then the agent must have acted overwhelmingly to represent the club's interests. Emails between Chelsea and Gestifute show Mendes acted diligently in Mourinho's interest, not the club's. For example, when Gestifute lawyer <mark>Carlos Osorio</mark> de Castro returned a draft contract to Chelsea, he omitted a clause inserted by the club that 10 percent of Mendes's fee would be reported as a benefit to Mourinho. The clause, de Castro noted, would have made Mourinho liable for tax. Chelsea Finance and Operations Director <mark>Chris Alexander</mark> responded that, despite the additional cost to Mourinho, the clause had to be in the contract. Because Mendes \"is Jose's agent,\" <mark>Alexander</mark> wrote in an email to de Castro, \"it is not credible for tax purposes that some part of the fee is not allocated to services for Jose. 10 percent is the absolute minimum we feel we can put in .\" Gestifute accepted that the clause be kept in the contract. Chelsea declined to answer any questions about the matter. \"We do not comment on speculation concerning confidential contracts or related matters,\" a club spokesman said. De Castro declined to answer questions citing confidentiality obligations to clients. The tax authority also declined to comment. <mark>Alexander</mark>, Gestifute and Mourinho did not respond to requests for comment. NO PENALTIES In hundreds of emails and letters between the UK tax authority and clubs and between club officials, Reuters did not come across a single proposed or threatened penalty in respect of an inaccurate filing. Even in cases where the tax authority says it believes a club has inaccurately reported the role of an agent, it has only sought back tax in relation to half the agent's fee, the documents show. In October 2015, the tax authority wrote to Man City to say it believed the club had inaccurately reported who agents worked for in respect of seven players. In the case of one, it said the club \"must have been aware\" of the inconsistency at the time it submitted tax filings. Nonetheless, the tax authority did not threaten penalties and simply proposed that the club recalculate its past tax bills. The tax authority and Man City declined to comment. In the most recent deals reviewed by Reuters, the clubs and tax authorities appear to have found common ground. The tax authority has settled on an approach that accepts an agent can equally represent both sides of a negotiation, emails from the tax authority to the clubs and between clubs and their tax advisers show. Consequently, the even splitting of agents' fees between the two sides has become common in the top echelons of British football, dozens of player contracts and other emails seen by Reuters show. Yet the documents raise questions about whether the equal sharing of fees accurately reflects the relationships between the parties. For example, when manager Jose Mourinho went on to join Manchester United in 2016, he, the club and agent Jorge Mendes signed a contract which apportioned the agent's fee evenly between the club and the manager. In an email to Gestifute's lawyer de Castro, however, Man United's Director of Legal & Business Affairs <mark>Patrick Stewart</mark> referred to Mourinho as \"your client\" seven times. And in one way at least, Gestifute appeared to be working contrary to Manchester United's interests. At the same time as Gestifute was negotiating the terms of Mourinho's Man United contract, the agency was in negotiations with another club to hire Mourinho. In May 2016, de Castro exchanged dozens of emails with officials of French team Paris St. Germain. A deal was never reached, but the talks progressed to the point of exchanging a Heads of Terms, or provisional contract. Reuters couldn't determine if the tax authority challenged the way the agent's fee was split or how much tax was paid. The tax authority declined to comment. Manchester United and <mark>Stewart</mark> declined to answer questions about the negotiations with Mourinho, but the club said it \"operates within the rules set by football's governing bodies and all payments and agreements are reported to HMRC in the standard way .\" Gestifute, Mourinho and PSG did not respond to requests for comment. De Castro declined comment. The tax authority's willingness to accept split fees in the face of contrary evidence means the football industry gets a generous break, and the UK Treasury and millions of ordinary taxpayers lose out.", "articleID": "2018110922_00412546_W", "names": {"Carlos Osorio": ["Q41674730", "Q48453034"], "Chris Alexander": ["Q16164161", "Q5105713", "Q5105714"], "Patrick Stewart": ["Q16296", "Q43394636", "Q43911027"]}}, {"date": "2018-11-11", "url": "http://newsok.com/politics-monday-voters-send-more-women-to-state-capitol/article/5614727?custom_click=rss", "content": "Politics Monday: Voters send more women to state Capitol by Ben Felder Published: Sun, November 11, 2018 3:47 PM Updated: Mon, November 12, 2018 10:35 AM shares email Advertisement Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman Female lawmakers will still make up less than one-fifth of House and Senate members when the state Legislature convenes in February, but their numbers are growing. There will be 31 women serving in the state Legislature, up from 21 during the 2018 session. There are 149 seats in the House and Senate. The Oklahoman's Dale Denwalt has more on the increase in women elected to office. Kendra Horn will become the only female (and only Democrat) member of Oklahoma's congressional delegation after she beat incumbent Rep. <mark>Steve Russell</mark>. Horn was a guest on last Friday's episode of Political State, which you can watch here. During her appearance on the show, Horn said she is still considering potential committee assignments and determining which will best help her Oklahoma City-based district. \"I worked in the space industry for a number of years,\" Horn said. \"So, the idea of Science, Space and Technology (Committee) is pretty exciting. I think there are a number of others .\" Horn also said she hasn't committed to voting for Nancy Pelosi for speaker of the House. \"I don't know who all's thrown their hat in the ring so I can't say who I'm going to vote for but I do think the Democratic Party and Democratic leadership, they need new leaders to step in and fresh blood,\" Horn said. Oklahoma City council: Nikki Nice lost her job in radio one day after winning her race to be the next Ward 7 representative on the Oklahoma City Council. An on-air personality at Heart & Soul 92.1 and Power 103.5, Nice had been handling off-air duties since filing for office. Asked Thursday whether letting Nice go was related to her being elected, Russell Perry, chairman and owner of Perry Publishing & Broadcasting, said, \"No, it's just that we've taken a different direction .\" Commutation requests headed to governor's desk Gov. Mary Fallin now will decide whether to reduce the prison sentences of 22 individuals who received favorable recommendations from the Oklahoma Pardon and Parole Board last week. Michael McNutt, a spokesman for Fallin, said the commutations likely will reach the governor's office in the next two weeks. (Story continued below ...) Asked whether Fallin plans to act on those 22 cases before leaving office in January, McNutt said: \"It is a priority of Governor Fallin to act on pardons, paroles, and commutations to get them processed as expeditiously as possible so that a backlog is not left for the next administration .\" Rural vote helps get Stitt to governor's office Gov.-elect Kevin Stitt won the election for Oklahoma governor last week by 12 percentage points, a wide margin of victory that surpassed most expectations and indicated the enthusiasm behind Stitt, especially in rural communities, was greater than expected. \"Right now, that sea of red is still outweighing the islands of blue,\" said Bill Shapard, CEO of Shapard Research, speaking about the concentration of Democratic votes in the state's two largest cities, surrounded by Republican support across rural Oklahoma. Democrat Drew Edmondson's largest vote totals came from Oklahoma City and Tulsa, and he even made some headway in the Oklahoma City suburbs, winning dozens of precincts in Edmond that had long been Republican strongholds. But the urban vote wasn't enough as rural Oklahoma showed its continued relevancy in statewide races. On Sunday, I had a story in The Oklahoman that took a closer look at Stitt's rural support and why both campaigns thought he did so well. Related Photos Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman <figure> <img src = \"/ / cdn2. newsok. biz/cache/r960 -311 ea56a7ee51655d695b84f152f8d39. jpg\" alt = \"Photo - Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman\" title = \"Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman\" > <figcaption> Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman </ figcaption> </ figure> Ben Felder Ben Felder is an investigative reporter for The Oklahoman. A native of Kansas City, Ben has lived in Oklahoma City since 2010 and covered politics, education and local government for the...Read more' Comments Comments Politics Monday: Voters send more women to state Capitol × Commenting on NewsOK requires a NewsOK Pro or Oklahoman subscription. Log in or subscribe to read and leave comments.", "articleID": "2018111216_00464894_W", "names": {"Steve Russell": ["Q16195304", "Q2634274", "Q30122065", "Q42277880", "Q43388452"]}}, {"date": "2018-11-12", "url": "http://www.wvtf.org/post/close-elections-fla-judge-calls-out-fraud-rhetoric-ariz-democrat-extends-lead", "content": "Close Elections: Fla.. Judge Calls Out Fraud \"Rhetoric,' Ariz.. Democrat Extends Lead By Jessica Taylor • 12 minutes ago Tweet Share Google + Email Workers load ballots into machines at the Broward County Supervisor of Elections office during a recount on Sunday in Lauderhill, Fla.. Brynn Anderson / AP As recounts are underway in Florida, a judge is issued a warning on Monday to\" ramp down the rhetoric \"as top Republicans--including President Trump--are casting doubt on the process. The Associated Press reports that law enforcement and elections monitors have found no evidence of wrongdoing, but Republican lawyers and candidates, along with Trump, have claimed--without evidence--that there have been voter irregularities and fraud, in addition to improper behavior by local voting officials, that cast doubt on the integrity of the process. The president tweeted early Monday morning that the elections should be called in favor of Republican Gov. Rick Scott, who's challenging Democratic Sen. <mark>Bill Nelson</mark>, and former GOP Rep. Ron DeSantis in his bid for governor over Tallahassee Mayor Andrew Gillum .\" An honest vote count is no longer possible-ballots massively infected. Must go with Election Night! \"Trump wrote. With Republicans leading in both the Senate and gubernatorial races, both contests are within the 0.5 percent margin that mandates a statewide recount. Many of the outstanding ballots could be from overseas military personnel, who can have their ballots counted as long as they arrive by Friday and were postmarked by Nov. 6, and it's hardly unusual for votes in many states to be counted after Election Day. Broward Circuit Chief Judge Jack Tuter made the comments during an emergency hearing requested by Scott's attorneys, saying,\" I am urging because of the highly public nature of this case to ramp down the rhetoric. \"\"If someone in this lawsuit or someone in this county has evidence of voter fraud or irregularities at the supervisor's office, they should report it to their local law enforcement officer,\" Tuter said. \"If the lawyers are aware of it, they should swear out an affidavit, but everything the lawyers are saying out there in front of the elections office is being beamed all over the country. We need to be careful of what we say. Words mean things these days .\" Republicans have cast doubt on the actions of Broward County Supervisor of Elections Brenda Snipes, questioning why the county has been so slow to count ballots. Snipes has pointed to high turnout and a lengthy ballot. The AP details that during the hearing, Scott's legal team claimed that Snipes was involved in \"suspect and unlawful vote counting practices\" against state law and that she could \"destroy evidence of any errors, accidents or unlawful conduct .\" They also requested additional sheriff's deputies to be sent to her office to oversee the ballots and voting machines, including to be present to watch them when they weren't in use. Snipes' lawyers rebutted that the Scott campaign's goal was to \"undermine\" faith in the elections, and ultimately the outcome if it doesn't go in their favor. The Broward County office already has cameras, deputies and security guards protecting the ballots. The judge ultimately ordered the parties to meet to find a compromise, and three deputies will be added to the Broward elections office. Tuter isn't the only Florida official to register apparent frustration with some of the rhetoric coming from the White House. NPR's Miles Parks reports that Mark Early, the supervisor of elections in Leon County, said that he didn't want to comment on politics, but did stress that these were public servants who were working hard to ensure every vote is counted fairly. \"You've got dedicated patriots out there who are going without sleep, to protect democracy and if anyone is out there undermining that especially when they have a role in making sure it's done well, that hurts our nation,\" the Leon County supervisor said. Georgia counties face deadline In neighboring Georgia, the gubernatorial contest between Republican Brian Kemp, who narrowly leads, and Democrat Stacey Abrams is also drawing scrutiny. According to WABE reporter Johnny Kauffman, Georgia's recently appointed Secretary of State Robyn Crittenden says the deadline for counties to certify election results is no later than Tuesday at 5 p.m. ET. Kemp stepped down last week as secretary of state, anticipating not only a win but amid criticism that he was overseeing the close count. Throughout their race, Abrams has alleged that Kemp has been trying to suppress minority voters and new registrations. Kauffman reports that in court filings, the state wrote that Crittenden should be able to certify the state election as soon as possible, and any delay would inhibit preparations for upcoming runoffs in December. Meanwhile, the Atlanta Journal-Constitution reports that the Abrams campaign is trying to find any remaining provisional ballots or other uncounted ballots to push Kemp's tally below 50 percent, forcing a runoff next month. As of 4:25 p.m. ET on Monday, Kemp had 50.26 percent of the vote. Democrats are also pursuing legal action to force counties to revisit some ballots and try to delay the deadline set by the state until Wednesday. Kemp's campaign has called such efforts \"frivolous\" and says Abrams should concede. Arizona Democrat expands lead The Senate race in Arizona also remains in limbo. According to the Arizona Republic, with additional ballots being counted Democrat Kyrsten Sinema has now widened her lead over Republican Martha McSally to over 30,000 votes. About 215,000 ballots remain to be counted, but Sinema's campaign says those come from areas that will favor the Democrat. The count has been delayed because of the need to check signatures from mail-in ballots. If Sinema wins, it would represent a Democratic pick-up of the open seat held by retiring Republican Sen. Jeff Flake. Arizona has not elected a Democrat to the Senate since 1988. But there's talk now of both Sinema and McSally going to the Senate, as an Arizona Republic op-ed called on Gov. Doug Ducey to appoint McSally to Arizona's other Senate seat. Former GOP Sen. Jon Kyl was appointed to fill the term of the late Sen. John McCain, but if Kyl steps down Ducey would need to name another Republican to replace him. Copyright 2018 NPR. To see more, visit http: //www.npr.org/. Tweet Share Google + Email View the discussion thread.", "articleID": "2018111223_00329645_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"]}}, {"date": "2018-11-13", "url": "http://www.mariettatimes.com/news/2018/11/veterans-march/", "content": "Veterans march Reporter jpatterson @ mariettatimes.com JANELLE PATTERSON The Marietta Times Members of the Marietta Fire Department lead the Veterans Day Parade down Putnam Street Monday with flags raised for the country, prisoners of war and those missing in action. JANELLE PATTERSON The Marietta Times Liberty <mark>Smith</mark>, 5, right, hands out artificial poppies during the Veterans Day Parade in Marietta Monday in remembrance of those who have served in the U.S. military. JANELLE PATTERSON The Marietta Times Marietta High School's color guard moves in sync Monday during the Veterans Day Parade in Marietta Monday. JANELLE PATTERSON The Marietta Times Liberty <mark>Smith</mark>, 5, right, hands out artificial poppies during the Veterans Day Parade in Marietta Monday in remembrance of those who have served in the U.S. military. Attendees of the Veterans Day Parade in Marietta, weren't looking for candy when they lined Putnam Street Monday. \"We talked on the way over about how we're here to say thank you,\" said Nancy Morehead, 59, of Boaz, as she shepherded her grandchildren, husband, sister and daughter across the street prior to the parade. \"These children are privileged that they don't have any immediate family who has served in a war, but they do have a heritage of relatives who have. And we talked about how those sacrifices aren't to be taken lightly and they should be proud of their heritage .\" Morehead's grandson, Willem Nuhfer, 9, of Boaz, explained that he had learned in school about veterans and what the annual recognition day means. \"We're free and safe because they fought for us,\" he said as he waved an American flag in the chilly wind Monday. Nuhfer, and his cousins Jesse Morris, 9, and Justus Morris, 6, shouted thank you throughout the parade to the passing veterans and danced to the patriotic songs played by Marietta High School's marching band. JANELLE PATTERSON The Marietta Times Members of the Marietta Fire Department lead the Veterans Day Parade down Putnam Street Monday with flags raised for the country, prisoners of war and those missing in action. The three were even excited to receive an artificial poppy from Liberty <mark>Smith</mark>, 5, who walked in the parade with her father, Washington County Veteran Service Commissioner <mark>Jared Smith</mark>. \"Liberty told me when it was all finished today that it was the best day ever, and she stuck with me not only for the parade but also for the luncheon at the Masonic Temple afterward,\" explained <mark>Smith</mark>. \"She said she was stopped by a World War II veteran and he thanked her for helping him with his dishes and that made her feel so good .\" <mark>Smith</mark> said he let his daughter walk in the parade to help instill a sense of community service. \"I was passing out poppies to honor veterans,\" explained Liberty. \"My dad was a veteran and I like him so much .\" The poppy, since the First World War, has been used as a symbol of remembrance of war veterans lost, and for the welfare of those still remaining after conflict. JANELLE PATTERSON The Marietta Times Marietta High School's color guard moves in sync Monday during the Veterans Day Parade in Marietta Monday. Korean War Veteran Bob Baumgarner, of Marietta, said he was thankful he could watch the parade. \"I didn't walk, but I liked to see it,\" he said. \"It's a good day to remember the sacrifices of all veterans .\" Baumgarner waved not only to the veterans of World War II, Vietnam and more recent conflicts, but also representatives from the Washington County Veteran Service Commission, the Order of the Purple Heart, Marietta College and the Marietta Shrine Club, all of whom marched in the parade. Volunteer fire departments also followed the patriotic tunes resounding from Marietta High School's marching band, Wall of Sound, led by the high school's color guard and followed by Troop 207 of the Boy Scouts of America.", "articleID": "2018111306_00524842_W", "names": {"Jared Smith": ["Q14918430", "Q17042774", "Q55169623"]}}]